{"title": "Horse Whisperer, The", "film_link": "/Movie Scripts/Horse Whisperer, The Script.html", "script_link": "/scripts/Horse-Whisperer,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Horse Whisperer, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Horse Whisperer, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (9.50 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Eric Roth\" title=\"Scripts by Eric Roth\">Eric Roth</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a><br/><br/>\n<b>Script Date</b> : January 1997<br/>\n<br/>\n<a href=\"/scripts/Horse-Whisperer,-The.html\">Read \"Horse Whisperer, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>THE HORSE WHISPERER</title>\n\n<pre>\n\n\tThe Horse Whisperer\n\n\tScreenplay by\n\tEric Roth\n\n\tRevised by\n\tRichard LaGravenese\n\n\tScreenplay by\n\tErich Roth\n\n\tBased on the Novel by Nicholas Evans\n\tRevised by\n\tRichard LaGravenese\n\n\tSecond Draft\n<b>\t1/21/97\n</b>\n\n\n<b>\tFADE IN:\n</b>\n<b>\tA DREAM:\n</b>\n<b>\tINT. STABLES; PILGRIM'S STALL - MORNING\n</b>\n\tSunlit illuminates the darkened stable, highlighting the \n\tcontours of a magnificent HORSE (PILGRIM) in surreal, dream-\n\tlike imagery: his legs, his muscles, his sheen, his mane... \n\this eyes. He shakes his head and stamps his feet. He seems \n\tconfined. Eager to run.\n\n<b>\tINT. STABLES - MORNING\n</b>\n\tPilgrim bursts through the stall and runs out the stables \n\tinto a blinding white morning.\n\n<b>\tEXT. AN OPEN FIELD LEADING TO WOODS - BRIGHT MORNING\n</b>\n\tWhiteness. Snow and sky without any discernible line between.\n\n\tCamera is POV, as if on the horse, riding through the \n\twhiteness. Snow kicks up from the side. We hear the breathing \n\tof the horse. As we travel on hills, through trees, we \n\texperience of sense of wild, exhilarating freedom.\n\n\tWe hear the giggles of a GIRL (GRACE) on the horse. An \n\toccasional line;\n\n<b>\t\t\t\t  GRACE (O.S.)\n</b>\t\tYeah, fly boy... that's it... go... \n\t\tgo... go...\n\n\tEND OF DREAM as we CUT TO:\n\n<b>\tINT. GRACE'S BEDROOM - MORNING\n</b>\n\tGrace awakens, calmly. Takes a breath. Slides out of bed and \n\tstands before a window, overlooking a beautiful Connecticut \n\tcountry house. We see a snow-covered field and distant woods. \n\tGrace presses her faces against the cold, frosted window \n\teager to get out.\n\n<b>\tINT. MACLEAN NEW YORK APARTMENT - MORNING\n</b>\n\tAlarm rings, ANNIE MACLEAN awakens. She shuts the alarm and \n\tscoots up in bed. She waits. Seconds later the television \n\tacross the foot of her bed turns on from a timer -- to a CNN \n\t24 NEWS channel.\n\n<b>\tINT. HALLWAY/ANNIE &amp; ROBERT'S BEDROOM - MORNING\n</b>\n\tGrace, fully dressed except for her boots, tiptoes past a \n\tpartially opened bedroom door. Her father ROBERT is asleep, \n\talone, on his huge king size bed.\n\n<b>\tINT. MACLEAN FARMHOUSE KITCHEN - MORNING\n</b>\n\tGrace is putting on her boots on a bench beside a back door. \n\tShe is wearing her mother's outfit. As she slides the boot \n\ton, we see behind her a row of framed photos -- Robert, Grace \n\tand Annie in happy times.\n\n\tShe slaps a note on the refrigerator, with a magnet -- \"Gone \n\triding. Back around 10. Love, G.\"\n\n<b>\tEXT. MACLEAN FARMHOUSE, BACK ENTRANCE - MORNING\n</b>\n\tGrace slips on her jacket and hat as she comes down the \n\tsteps, her feet hitting the walk...\n\n<b>\tEXT. CENTRAL PARK - MORNING\n</b>\n\tAnnie's feet hit the ground, running -- her breath showing in \n\tthe cold air. She passes other joggers with ease. She crosses \n\tthe street and heads for an elegant CPW building.\n\n<b>\tINT. MACLEAN'S NEW YORK APARTMENT - MORNING\n</b>\n\tDressed in running clothes, Annie opens the door and picks up \n\tseveral newspapers that were delivered. She carries them into \n\tthe kitchen and sets them beside a huge stack of publications, \n\tmagazines, papers, etc... Knowing she must read all of them at \n\tsome point, she breathes a disgusted sign. She thumbs through \n\tthe POST as she pours herself a cup of coffee. Something \n\tcatches her eyes and she snarls:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThat little shit!\n\n\tShe dials a portable phone and moves through the apartment as \n\tshe talks:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHi Lucy?... Did I wake you?... Have \n\t\tyou read the Post?... They've got a \n\t\tlittle item about me and Fiske. He's \n\t\tsaying I fired him and that I faked \n\t\tthe new circulation figures.. Ha, ha... \n\t\tOh, please... It's the last act of a \n\t\tdesperate gnome... Set up a phone call \n\t\twith Don Farlow for 9:30...\n\n\tThroughout the phone call, Annie is selecting clothes, \n\tturning on the shower, undressing...\n\n<b>\tEXT. DYER HORSE FARM - MORNING\n</b>\n\tThe snow has stopped falling. Grace walks along a hill, hands \n\tin pocket. Spread out on the landscape are horses, on a horse \n\tfarm, standing like statues in the white covered fields.\n\n\tAs Grace comes along the hill, we see another GIRL (JUDITH) \n\tcoming from the opposite direction. She doesn't have Grace's \n\tlean elegance but her warm, friendly smile brightens her \n\tface. Upon reaching her, Grace returns the smile with a hug.\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tIt's warmer than I thought.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYou want to go to a movie tonight?\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tI thought your mom's coming up?\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(prickly)\n\t\tSo?\n\n\tJudith immediately senses a problem so she continues casually, \n\tas they begin walking away from Camera...\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tMy parents are having friends from \n\t\tcollege over. They're really nice... \n\t\tThey have this gorgeous son who wants \n\t\tto be a forest ranger.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tCan I come? I'll start a fire...\n\n\tJudith laughs as they continue talking, their voices trailing \n\toff, as the girls head for the stables.\n\n<b>\tINT. STABLES, THE DYER HORSE FARM - MORNING\n</b>\n\tThere are several horses in their stalls. Grace and Judith \n\tenter, talking, carrying their English saddles. Judith stops \n\tat a stall, disappearing into it as she says \"Hello?\"..., \n\tGrace continues to the end stall.\n\n\tPilgrim (the horse from the dream) stands looking at her.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tHello, beautiful boy.\n\n\tHe's a massive figure beside her but she shows no inhibition. \n\tShe enters, touching his muzzle. He plays with her by nudging \n\ther back.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tStop... Will you stop!\n\n<b>\tEXT. DYER HORSE FARM - MORNING\n</b>\n\tThey lead their horses, now saddled and ready, from the barn. \n\tPilgrim tosses his head, prancing, playing with the snow.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tShow-off.\n\n\tThe girls mount the horses and ride off together.\n\n<b>\tINT. ANNIE'S MAGAZINE OFFICE - MID-MORNING\n</b>\n\tAnnie, casually dressed, enters the empty offices of her \n\tmagazine. She turns on the light, revealing a large row of \n\tstalls and glassed in private offices. Everywhere we look, we \n\tsee indications of the kind of magazine she edits.\n\n\tShe strolls to her office -- the largest -- surrounded by \n\twindows. The office walls are covered with photos, most of \n\twhich are COVER STORIES ON ANNIE.\n\n\t(One photo is of Annie's father MARTIN. A BRITISH AMBASSADOR \n\twith his young daughter on his lap, her arms affectionately \n\taround his neck. Her mother stands right behind them, posing \n\tlike a member of the royal family.)\n\n\tAnnie sits and takes a breath. The only photo on her desk is \n\ta family portrait, taken when Annie was given the Crystal \n\tAward -- Robert, Grace, herself and the Award. She checks her \n\twatch -- it is almost 9:30.\n\n<b>\tINT. MACLEAN FARMHOUSE, MASTER BEDROOM/CLOSET - MID-MORNING\n</b>\n\tA WALK-IN CLOSET of the master bedroom; one side is Annie's, \n\tone side is Robert's.\n\n\tRobert stands before his bureau in the closet -- he has just \n\tshowered and is putting on his watch and ring which lay \n\tbeside his cologne assortment. A FRAMED PHOTO OF HE AND ANNIE \n\tin India -- younger, vibrant, in love... when they first met.\n\n\tTHE PHONE RINGS. Robert enters into the bedroom to pick up.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHello?\n\n\tINSERT ANNIE: They speak in dulled, emotionless voices:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's me.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHi.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHi.\n\n\tAwkward pause.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tSo, what, uh, what train are you taking?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI should be in by two.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tOkay. You want me to pick you up?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSure... What's Grace up to?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tRiding with Judith.\n\n\tBeat.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI'm sorry about last night. I shouldn't \n\t\thave brought it up over the phone.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tThat's okay. We have to talk about it \n\t\tand we're not always in the same place\n\t\t... so... I just have to get used to it.\n\t\t\t(beat)\n\t\tWhat do you want to do about dinner?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't know. We'll figure it out.\n\n\tPause. There is a lot unspoken but understood between them. \n\tAnnie's other phone line rings. Robert hears it as well.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tOkay. We'll see you later then.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah. Bye.\n\n\tAnnie picks up the other line and her manner brightens, her \n\tenergy boosts...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDON! My love, how are you? Did you hear \n\t\tabout Fiske?... No, suing is too \n\t\tcivilized. Can't we get your friend at Le \n\t\tCirque to serve him a fatal piece of \n\t\tpoached salmon?... Ha, ha... That's even \n\t\tbetter...\n\n<b>\tEXT. CONNECTICUT COUNTRYSIDE - MORNING\n</b>\n\tLong Shot of the girls riding at an easy pacing, talking all \n\tthe time. Grace is an elegant rider, quite self-assured for a \n\t13-year-old... We come into the scene at the moment the \n\tgirls have just shared a secret or a fantasy. Judith is \n\tgiggling uncontrollably. Grace laughs as she says:\n\n<b>\t\t\t\t  GRACE\n</b>\t\t...Oh, come on! You think the same thing!\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tI just could never say it!\n\n\tThey stop at the end of the field, facing the woods.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDo you want to go around by the \n\t\told road?\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tWhy don't we just cut through the \n\t\twoods?\n\n\tGrace nods. They ride into the woods, continuing their talk.\n\n<b>\tEXT. WOODS - MORNING\n</b>\n\tThe girls ride down, along a stand of hickories and poplars \n\tto a RIVER. They stop the horses and their conversation, to \n\tlisten to the sound of the water. Below them, off in the \n\tdistance, they can just make out a two-lane country road.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYou want to go down or stay along \n\t\tthe river?\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tWe already did the river. Let's go down \n\t\tand across the old bridge. We can circle \n\t\tback.\n\n\tThey begin to make their way.\n\n<b>\tINT. ANNIE'S OFFICE - MORNING\n</b>\n\tAnnie's office is now crowded with a dozen or so employees; \n\tsitting on the couch, on the window sills, on the arms of \n\tchairs, against the walls... Paper bag emptied of bagels, \n\tcream cheese, orange juice, paper plates...\n\n\tHand Held Camera captures the energy of the room as it \n\tfollows overlapping lines, laughter, etc... yet, no matter how \n\tcasual it all seems, Annie is very much at the center of \n\tcontrol... We enter the scene of LAUGHTER, as Annie asks \n\tKEVIN, a feature writer:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t... So what did you say to her?\n\n<b>\t\t\t\t  KEVIN\n</b>\t\tI said, thank you very much...\n<b>\t\t\t(LAUGHTER, AD LIBS)\n</b>\t\tI really should do the interview... But \n\t\tperhaps if you'd like to have dinner...\n\n\tLAUGHTER... Everyone starts Ad Libbing...\n\n<b>\t\t\t\t  VARIOUS CHARACTERS\n</b>\t\tDinner!!... He's so cute.... Why don't I \n\t\tget those kind of interviews?... Look, \n\t\the has husband number eight written on \n\t\this forehead...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tAll right, all right, all right... Kevin, \n\t\tgood job. Write the interview. If I don't \n\t\tlike it, you may have to sleep with her \n\t\tfor a follow-up!\n\t\t\t(laughter)\n\t\tNow... I'm thinking about another fashion \n\t\tdesigner spread... Who's news out there?\n\n\tCharacters shout out designer names and comments as the phone \n\trings and LUCY picks up... speaking amdist the talking...\n\n<b>\t\t\t\t  LUCY\n</b>\t\tHold on.\n\t\t\t(presses hold)\n\t\tGottschalk.\n\n\tThe room goes dead quiet, instantly. Then erupts in laughter \n\tas everyone realizes it. Annie, however, waves her hand as \n\tshe takes the phone...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tQuiet... Quiet!\n\n\tEveryone obeys. Annie presses SPEAKER PHONE.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDavid?\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (VO)\n</b>\t\tWho's there?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tEveryone. Working overtime. Just for you.\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (VO)\n</b>\t\tDid you speak to Farlow?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYes. We're suing.\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (VO)\n</b>\t\tIs that absolutely necessary? It'll just \n\t\tmake it a bigger story.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDavid, he signed an agreement that he \n\t\twouldn't talk to the press and he's \n\t\tlibeled me by saying I faked the figures. \n\t\tYou're not going soft on me, are you?\n\n\tSilence. Gottschalk doesn't immediately respond. Everyone \n\twaits. Covert looks between characters suggest this is \n\tinteresting -- has Annie over-stepped her bounds with the \n\tmagazine's owner? Annie waits without a shred of anxiety -- \n\teven though she might have some. Finally:\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (VO)\n</b>\t\tWell, I suppose we could use another \n\t\tgood public feud...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tExactly...\n\n\tEveryone silently acknowledges Annie guts and influence.\n\n<b>\tEXT. COUNTRYSIDE - MORNING\n</b>\n\tIt's perfectly still. We are looking down an empty TWO-LANE \n\tROAD covered with fresh snow. We see the girls slowly riding \n\tout of the woods, talking. They cross the road and start up \n\tinto the woods on the other side... They are trying to sing a \n\tLIZ PHAIR song, \"CHOPSTICKS\"\n\n<b>\t\t\t\t  GRACE/JUDITH\n</b>\t\t\t(singing)\n\t\t\"I met him at a party and he told me how \n\t\the like to drive me home... He said he \n\t\tliked to do it backwards...\"\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(singing)\n\t\t\"... I said it--\"\n\n<b>\t\t\t\t  JUDITH\n</b>\t \t\t(singing)\n\t\t\"... and I said that\"...\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(stops singing)\n\t\tNo, wait, it just goes... \"he said he \n\t\tliked to do-\"...\n\n\tSuddenly there's the SOUND OF THE METAL OF JUDITH'S HORSE \n\tscraping on some sheer ice hidden under the soft snow. Judith \n\tnotices first...\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tWhat was --\n\n\tThe horse staggers... Judith looks to Grace --\n\n<b>\t\t\t\t  JUDITH\n</b>\t\tGrace!\n\n\tThe horse tries to find tracing with his hindfeet, kicking \n\tup sprays of snow and ice shards. The horse suddenly falls on \n\tthe ice and goes down hard on its knees...\n\n<b>\t\t\t\t  GRACE\n</b><b>\t\tJUDITH!\n</b>\n\tThe horse stumbles to get back on its feet, slipping again. \n\tFrightened, it rears and Judith, caught off balance, is \n\tthrown, her foot catching in the stirrup...\n\n<b>\t\t\t\t  JUDITH\n</b><b>\t\tGRAAACE!\n</b>\n\tHer horse, unable to find its balance, starts to slide backward \n\tdown the incline.\n\n<b>\t\t\t\t  GRACE\n</b><b>\t\tPILGRIM, COME ON! MOVE!\n</b>\n\tGrace, directly behind Judith, tries to turn Pilgrim to avoid \n\tbeing hit by the errant horse.\n\n\tWhat follows, we see from Grace's perspective. The details \n\tthat form the images and sounds of Grace's mind are fast, \n\tdisembodies, almost surreal as --\n\n\tJudith's horse bulldozes into Pilgrim, taking his legs out \n\tfrom under him, sending both horses careening down the icy \n\tslope. Grace hangs onto Pilgrim's neck. Judith, her leg \n\thelplessly tangled in the stirrup, is dragged, her head \n\tbouncing on the frozen ground.\n\n\tThey slide all the way back down to the COUNTRY ROAD. Pilgrim \n\tis the first to find his legs and stand. Grace manages to sit \n\tup in the saddle. She sees Judith's horse stumbling back onto \n\tits feet, one of his legs broken at the ankles, walking in \n\tconfused circles, dragging Judith -- her face bleeding, her \n\tleg hanging from the stirrup.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(frightened)\n\t\tJude, you okay?\n\n<b>\t\t\t\t  JUDITH\n</b>\t\t\t(softly, crying)\n\t\tI'm okay... I'm okay.\n\n\tShe tries to extricate her leg from the stirrup.\n\n\tGrace sees it before she hears it. A GLINT off of steel. We \n\tthen hear the rumbling SOUND of a TRUCK coming around the \n\tbend... The Girls on their horses in the middle of the road... \n\tThe Truck, an 18 wheeler carrying logging equipment, comes \n\taround the turn... Grace grabs the bridle, trying to get \n\tJudith's horse out of the road... The driver, seeing them, lays \n\ton the air horn. The Horses bolt at the sound, the bridle \n\tslipping out of Grace's hand...\n\n<b>\t\t\t\t  GRACE\n</b><b>\t\tJUUDE!!!\n</b>\n\t... The horses turn apart. The Driver starts furiously \n\tdownshifting, trying to brake... He seems to get it under \n\tcontrol when suddenly THE TRUCK SKIDS on some ice. It begins \n\tto slide, out of control, the truck bed and the cab jack-\n\tknifing. The truck literally plows over the helpless Judith \n\tand her horse -- the horse going down on the pavement, Judith \n\tdisappearing under him. The truck's cab, like a mythic \n\tmonster, heads right for Grace and Pilgrim... Grace looks \n\tright into the Driver's helpless, frightened eyes... Suddenly, \n\tPilgrim rears up at the truck, sending Grace flying, bouncing \n\ther off the pavement and under the wheel of the truck.\n\n\tPilgrim instinctively jumps onto the hood of the truck, his \n\thooves caught between the rear-view mirrors like some \n\tgrotesque ornament. His head and chest slams into the window, \n\tshattering through the glass.\n\n\tAnd then it is still.\n\n\tThe truck has stopped halfway in the road. Judith's horse \n\tlies in the road, motionless. Pilgrim, on the truck's hood, \n\this legs splayed, stuck, his head and chest, bleeding. He \n\tshrieks, struggling to get to his feet. He manages to free \n\this legs and, stepping off the cab onto the road, walks off, \n\twounded, in pain, into the sanctuary of the woods...\n\n\tThe Driver stumbles out of the cab, his head bleeding, in \n\tshock. He sits on the ground. All we hear is the sound of the \n\triver and the wind in the trees.\n\n\tGrace, halfway under the truck, frozen, stares up at the \n\tbeautiful morning sky.\n\n<b>\tWE HEAR THE SOUND OF A HELICOPTER...\n</b>\n<b>\tINT. MACLEAN FARMHOUSE/KITCHEN - LATER MORNING\n</b>\n\tANGLE ON GRACE'S NOTE on the refrigerator as Robert enters \n\tfrom the outside with two bags of groceries. He places them on \n\tthe counter near the PHONE MACHINE. He sees ONE MESSAGE is \n\tthere. He presses PLAY as he puts away the groceries.\n\n\tA BEAT LATER the PHONE RINGS and he picks up, with the machine \n\tstill playing...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(on phone)\n\t\tHello? Paul, hi -- are you guys back? \n\t\tHow was it? Oh that sounds great. Oh \n\t\tPaul.. hold on...\n\n<b>\t\t\t\t  LIZ\n</b>\t\t\t(on machine)\n\t\tRobert! Are you there?... Robert! It's \n\t\tLiz!... Look, there's... there's been \n\t\tan accident... Uh... Jesus... uh...\n\n\tAs Robert listens, the voice of Liz's on the machine from \n\tinside, pulls his attention. On hearing \"accident,\" Robert \n\tlowers the receiver, frozen, as he listens to Liz...\n\n<b>\t\t\t\t  LIZ\n</b>\t\t\t(on machine)\n \t\tRobert, just call me on my call phone... \n<b> \t\t1-917-449-7805...\n</b>\n<b>\tEXT. THE WOODS - LATE MORNING\n</b>\n\tPilgrim is hiding in the shadows under an old railroad bridge, \n\tstanding up to his knees in the river. His chest is cut open, \n\tbleeding. His face cut, contorted and swollen. LIZ HAMMOND, \n\tthe local veterinarian, hides a hypodermic needle in her \n\tjacket, quietly walking into the water.\n\n\tA Policeman is going into the water downstream from Pilgrim, \n\twhose chest is heaving, blood drips into the water. He \n\twatches Liz. She is almost to him when suddenly he bolts, \n\trunning upstream.\n\n\tThe Policeman behind him shouts and waves his arm. Frightened, \n\tPilgrim wheels back toward Liz, who manages to stick the hypo \n\tin his neck. He rears, knocking her down, then runs out of \n\tthe river, the hypo still in his neck. He runs for the \n\tsanctuary of the woods.\n\n<b>\tINT. TRAIN - LATE MORNING\n</b>\n\tAnnie sits on a train -- her laptop out, notes beside her, \n\ther cellular phone, ever-ready. The train passes through \n\tbeautiful countryside but Annie is focused on an editorial \n\tshe's writing.\n\n\tThe train pulls into a station and stops, causing Annie to \n\ttake a break and stretch her arms and neck. She looks out the \n\twindow for the first time and sees:\n\n\tA MAN, his hands in his pockets, waiting on the platform. She \n\twatches as the Man holds out his arms to his two young \n\tchildren, who are getting off the train. He picks them up as \n\this wife enters the scene, kissing him and wrapping her arm \n\taround his waist. The children talk a mile a minute and the \n\tfather listens to every word.\n\n\tAnnie doesn't even realize she is staring. As they leave the \n\tplatform, she turns back to her laptop. As the train begins \n\tto move again, Annie returns to work.\n\n\tHER CELLULAR PHONE RINGS. She answers.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah?... Hi. I made the 1:00 so...\n\n\tThe expression on her face sinks into a stunned panic.\n\n<b>\tINT. HOSPITAL, CONNECTICUT - DAY\n</b>\n\tAnnie is running through the corridors, her bags in tow. She \n\tsees Robert standing in the corridor talking to a DOCTOR. She \n\truns for them.\n\n\tWhen she appears, Robert and the Doctor stop their \n\tconversation. Robert looks to Annie, who is waiting for news.\n\n<b>\t\t\t\t  ANNIE\n</b><b>\t\tWHAT!?\n</b>\n\tRobert is teary eyed, beaten down.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tJudith's dead.\n\n\tAnnie's horrified, waiting for news of Grace.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat about Grace?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tShe was in pretty bad shape. They've \n\t\tdone a C.A.T. Scan -- she has some \n\t\themorrhaging...\n\n<b>\t\t\t\t  DOCTOR\n</b>\t\tBut nothing we can't handle...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(impatient)\n\t\tWhere is she now?\n\n<b>\t\t\t\t  DOCTOR\n</b>\t\tSurgery.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSurgery! For what-?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(interrupting)\n\t\tAnnie, her leg was shattered -- what \n\t\tthey call the distal epi.. epi..\n\n<b>\t\t\t\t  DOCTOR\n</b>\t\tDistal epicondyle of the femur...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(quietly, crying)\n\t\tThey have to take the leg off.\n\n\tAnnie responds without tears and cries but with a quiet \n\tshock. We can tell her mind is racing, trying to process the \n\tinformation, until finally she asks:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhich leg?\n\n\tThe Doctor and Robert are surprised by the question.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWhat difference does it make?\n\n\tAnnie stares for a beat, then nods apologetically.\n\n<b>\tEXT. WOODS - DAY\n</b>\n\tPilgrim is sedated, lying in his own blood in the snow, \n\tsurrounded by Police and trackers. He is being attended to by \n\tLIZ HAMMOND, who is dictating to her assistant:\n\n<b>\t\t\t\t  LIZ\n</b>\t\t... His skull, cheek, and nose are \n\t\tseverely fractured. He has a deep \n\t\tchest wound. I'm not even sure it \n\t\tcan be closed.\n\n<b>\t\t\t\t  LOCAL TRACKER\n</b>\t\t\t(deadpan, local accent)\n\t\tAnimal should be put down -- anybody can \n\t\tsee that.\n\n\tLiz looks up to him, resentfully, but knows he's right.\n\n<b>\tINT. GRACE'S HOSPITAL ROOM - DAY\n</b>\n\tCamera moves from Grace's face down her body to Robert's \n\thand, which rubs her good leg. He looks at her lovingly, \n\tpushing the hair from her forehead.\n\n\tAnnie, needing to do something, tenderly straightens Grace's \n\tblankets. It is plain to see where her leg had once been. \n\tRobert can't look. Annie, one to face her fears, bravely \n\tlooks at it head on. She notices the I.V. Bag and rises on:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThat bag's almost empty.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(looking)\n\t\tNo, it's got a little left. They'll be \n\t\tin to change it.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(as she exits)\n\t\tRobert, you leave it up these people...!\n\n\tRobert is about to respond but Annie is already out the door. \n\tWe hear the O.S. DIALOGUE as Robert listens.\n\n<b>\t\t\t\t  ANNIE (O.S.)\n</b>\t\tExcuse me, my daughter needs a new \n<b>\t\tI.V.\n</b>\n<b>\t\t\t\t  NURSE (O.S.)\n</b>\t\tWe have her down, we'll be right in.\n\n<b>\t\t\t\t  ANNIE (O.S.)\n</b>\t\tI'd like it taken care of now please.\n\n\tAnnie enters first.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou have to keep on top of these people \n\t\tor else they just sit on their --\n\n\tBut Robert is ignoring her. Facing Grace, smoothing away her \n\thair. He's giving her the silent treatment. Annie knows this \n\tmeans Robert doesn't approve of her dictatorial behavior. \n\tAnnoyed, she turns away as well.\n\n\tThe Nurse enters with a new bag and begins to replace the old \n\tone as Robert backs away.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI'm sorry.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tTch. What are you --\n\n\tAnnie, about to respond to his inappropriate politeness, is \n\tstopped by Robert, who finally looks at her. It's a powerful \n\tlook that tells her to calm down and shut up. It's a look \n\tthat, for all of Robert's sensitivity, affects Annie. She \n\tgets the message and stays calm.\n\n\tAs the nurse leaves, Annie is about to say thank you, but \n\tRobert beats her to it.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tThank you.\n\n\tAnnie and Robert stand facing each other, when the PHONE RINGS. \n\tAnnie picks up.\n\n<b>\tINTERCUT\n</b>\n<b>\tEXT. WOODS - DAY\n</b>\n\tLIZ HAMMOND on a cellular, walking away from the crowd.\n\n<b>\t\t\t\t  LIZ\n</b>\t\tAnnie, it's Liz. How's Grace?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(journalistic)\n\t\tHer leg was shattered so they had to, \n\t\tuh... remove it. She had some bleeding \n\t\tbut it's under control.\n\n<b>\t\t\t\t  LIZ\n</b>\t\tOh God, Annie, I'm so sorry. I... I \n\t\tknow you're being hit with a low now, \n\t\tI don't want to take too much of your \n\t\ttime but I have to talk to you about \n\t\tPilgrim.\n\n\tAnnie hears the name as if it's some distant echo she can't \n\tquite identify; Liz speaks quickly as Annie watches Grace \n\tbreathing in her sleep --\n\n<b>\t\t\t\t  LIZ\n</b>\t\tIt's not good. I've never seen an animal \n\t\twith these injuries still breathing. I \n\t\tknow this is difficult to hear right now \n\t\tI'd like your permission to put him down. \n\t\tIt's the really best thing we can do for --\n\n\tThat was too much information for Annie;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWait, uh, I, I don't understand. Start \n\t\tagain -- He's alive...\n\n<b>\t\t\t\t  LIZ\n</b>\t\tYes, but he's in a tremendous pain...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, of course, right...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWhat is it?\n\n<b>\t\t\t\t  LIZ\n</b>\t\t\t(overlapping)\n\t\tWe really shouldn't wait...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(overlapping)\n\t\tHold on, Liz...\n\t\t\t(to Robert)\n\t\tSomething about Pilgrim...\n\n\tThe Doctor pokes his head in.\n\n<b>\t\t\t\t  DOCTOR\n</b>\t\t\t(overlapping)\n\t\tMr. and Mrs. MacLean...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(overlapping)\n\t\t-- put him down. She says...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(overlapping, to Doctor)\n\t\tYes. Hi.\n\t\t\t(to Annie)\n\t\tTell her you'll call her back.\n\n\tHe exits with the Doctor.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLiz, listen, the Doctor's here and I \n\t\tjust can't, uh... talk now... so --\n\n<b>\t\t\t\t  LIZ\n</b>\t\t\t(interrupting)\n\t\tI understand, but Annie, please...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(overlapping)\n\t\t- See, what you can do for him --...\n\n<b>\t\t\t\t  LIZ\n</b>\t\t\t(overlapping)\n\t\tAnnie, no matter what I do, this horse \n\t\twill never be the same.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t... I just don't know right now! Do \n\t\twhatever you can and when Grace is --\n\n<b>\t\t\t\t  LIZ\n</b>\t\tIt isn't right to make him suffer...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tAnd I can say the same thing about my \n\t\tdaughter! But she is suffering! Can you \n\t\tsolve that problem!\n\t\t\t(Liz is quiet)\n\t\tI can't deal with this now, Liz! If you \n\t\tneed a yes or no right now, then no -- \n\t\tdon't do it! Not until I know Grace is \n\t\tall right. Now, please! Just do what you \n\t\tcan. Okay?\n\t\t  \t(softer)\n\t\tPlease.\n\n\tLiz is stopped by Annie's almost pleading tone.\n\n<b>\t\t\t\t  LIZ\n</b>\t\tAll right...\n\n\tThey hang up. Annie takes a breath. Robert re-enters.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat did he say?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tNothing new. He's just going off duty.\n\n\tBeat. Silence.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI'm going to get all the nurses' \n\t\tnames... It's good to know all their \n\t\tnames.\n\n\tRobert nods. But neither of them moves. They stand motionless \n\tfor a beat, then Annie begins to break down and eases herself \n\tinto Robert's arms.\n\n\tRobert embraces her, kissing her head, with an almost fatherly \n\tcomfort. His expression tells us it's the moment he's been \n\texpecting... and wanting. Now she'll be all right, in his arms. \n\tWhatever distance between them, whatever problems felt \n\tinsurmountable last night on the phone, are now, for the moment \n\t-- for Robert -- gone.\n\n\tBut Annie's expression tells us something different. Her \n\tinstinct to hold him was honest... but the effect isn't the \n\tsame anymore. Something doesn't feel right. Something isn't \n\tworking anymore about his comforting embrace.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI should go get some of her things.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tNo, let me go.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(gently pushing away)\n\t\tNo, I'll go. You stay... In case she \n\t\twakes up.\n\n<b>\tINT. THE UNIVERSITY ANIMAL HOSPITAL, RECOVERY STALLS - NIGHT\n</b>\n\tA line of recovery stalls with various sick and hurt animals. \n\tLiz, exhausted asleep, on a chair outside a stall. There's a \n\tslight scratching sound. A hoof against the stall. It gets \n\tlouder, awakening Liz. She gets up and looks inside the \n\tpaddled stall:\n\n\tPilgrim is lying in the stall, heavily bandaged. He is waking \n\tup. His first instinct is to kick at the paddled stall walls. \n\tHe looks at Liz, his eyes filled with madness -- enraged to \n\tstill be alive.\n\n<b>\tINT. GRACE'S BEDROOM IN FARMHOUSE - NIGHT\n</b>\n\tAnnie opens the door and enters, flicking on the light. \n\tCamera is on her back, as she places a small suitcase on the \n\tbed and opens it. She begins her task with cool efficiency. \n\tOpening drawers and closets, assessing what should be taken, \n\twhat isn't necessary.\n\n\tSuddenly, she stops. She feels disoriented for a moment. She \n\tcan't remember the last time she was inside this room. She \n\ttakes a moment to pause and actually look around.\n\n\tIn the light, we now see more of Grace's inner sanctum. Horse \n\triding prize ribbons in various colors adorn the walls. \n\tBooks. A girl's bureau cluttered with teenage possession \n\tranging from childhood toys to items that suggest a reaching \n\ttowards adulthood. Annie examines some items, affectionately. \n\tA GOOD LUCK CHARM from India sits among her things. Annie \n\ttakes it to pack in the suitcase.\n\n\tShe notices a framed 8X10 of Grace sitting proudly atop \n\tPilgrim with Judith at her heel. She then notices the edge of \n\tanother picture behind this one, in the frame. She pulls the \n\tPilgrim photo out to reveal: An old 8X10 of Annie hugging \n\tGrace as a toddler. With her back to Camera, Annie remembers:\n\n<b>\tMEMORY:\n</b>\n<b>\tINT. GRACE'S ROOM - A DAY REMEMBERED\n</b>\n\tAnnie is playing with toddler Grace. Chasing her around the \n\troom. Picking her and tossing her onto a small, toddler bed. \n\tBlowing into her stomach. Grace is laughing uncontrollably.\n\n<b>\tEND OF MEMORY\n</b>\n\tAnnie slides the Pilgrim picture back into the frame, then \n\treturns to her task of packing.\n\n<b>\tINT. GRACE'S HOSPITAL ROOM - NIGHT\n</b>\n\tAnnie enters. No one else is there. She places the suitcase \n\ton a chair and opens it. She takes out the INDIAN LUCKY CHARM \n\tand some horse books, and places them on her bedside table. \n\tShe takes care to prop up the Lucky Charm.\n\n\tShe wets a cloth with some water from a pitcher and gently \n\twipes Grace's sweaty brow... INSERT VISUAL FLASHBACK HERE, \n\tinstead of in Country House.\n\n\tAnnie then continues unpacking the suitcase. She opens \n\tGrace's closet and sees a hospital bag filled with Grace's \n\tclothes at the time of the accident. Annie examines them and \n\tdiscovers they are hers. Annie shoves the clothes into a bag \n\tand starts unpacking.\n\n<b>\tINT. HOSPITAL CAFETERIA - PRE-DAWN\n</b>\n\tThe Clock is ticking on the wall. The cafeteria is empty \n\texcept for one tired Intern, drinking coffee on a break.\n\n\tRobert and Annie are having a cup of coffee. In the silence, \n\tthey search for things to say. Until:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI saw Judith's parents while you were \n\t\tat the apartment...\n\t\t\t(Annie listens)\n\t\tI wanted to say something...\n\t\t\t(beat)\n\t\tBut I... I was so relieved that Grace \n\t\twas still... that it wasn't our daughter.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWe're very lucky.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(nods)\n\t\tThe funeral's on Friday.\n\n\tHe rises and crosses to the self-help coffee dispenser as he \n\tcontinues...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tOh, uh, I meant to tell you... Alex \n\t\tbrought that fabric over...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOkay.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tIt's on the table by the phone. I didn't \n\t\tknow what to tell him...\n\t\t\t(returns to table, sits)\n\t\t... Whether or not we were...\n\t\t\t(beat)\n\t\t... if we still we're thinking of redoing \n\t\tthe couch.\n\n\tAnnie just nods. She senses Robert is looking for some kind \n\tof reassurance, but she can't give it to him. He continues;\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t... And uh... Mario called about moving \n\t\tthe wisteria?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh. Right. I'll call him.\n\n\tPause. Annie looks at her husband as he stares off to the \n\tside, deep in his thoughts. She can sense he's sinking as he \n\tfidgets with the napkins. She remembers:\n\n<b>\tMEMORY:\n</b>\n<b>\tINT. A SMALLER APARTMENT, KITCHEN - A NIGHT REMEMBERED\n</b>\n\tA younger Annie stands in a bathrobe, noticeably pregnant, \n\tcooking at a stove -- reading instructions from a propped up \n\tcookbook. FRANK SINATRA IS BLASTING as she sings along, in \n\tfull voice, without inhibitions;\n\n<b>\t\t\t\t  ANNIE\n</b><b>\t\t\"SHE'S LOVES THE THEATRE BUT NEVER COMES \n</b><b>\t\tLATE... SHE NEVER BOTHERS WITH PEOPLE SHE \n</b><b>\t\tHATES... THAT'S WHY THE LADY IS A TRAMP!...\"\n</b>\n\tA younger Robert, wearing a suit, arrives home from work. Seeing \n\ther, he smiles affectionately. He puts down his briefcase and \n\tbursts into his own playful Sinatra impersonation:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\"She loves the free...\"\n\n\tStartled, Annie turns around and smiles:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(sexily undoing his tie)\n<b>\t\t\"... FRESH, WIND IN HER HAIR... LIFE \n</b><b>\t\tWITHOUT CARE... SHE'S BROKE... BUT \n</b><b>\t\tIT'S 'OK'...\n</b>\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(a la fan)\n\t\tSing it to me, Frankie!\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(a la Sinatra cool)\n\t\tHow's my pregnant chick!\n\n\tShe moves to him and they embrace... He wraps his arms around \n\ther. They kiss. Annie laughs.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou can hardly get your arms around me. \n\t\tHow depressing. You're so early.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI had to excuse myself from a meeting. \n\t\tIt's ridiculous. I kept thinking about \n\t\tthe baby... you... and, I swear, I was \n\t\tgoing to start bawling right into my \n\t\tbriefs.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(loving it)\n\t\tAw... that's so sweet.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI love you.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDo you? Do you really?\n\n\tThey turn to each other and kiss.\n\n<b>\tEND OF MEMORY.\n</b>\n<b>\tINT. HOSPITAL CAFETERIA - PRE-DAWN\n</b>\n\tAnnie and Robert sit silently at the table in an empty hospital \n\tcafeteria, a lifetime later.\n\n<b>\tINT. GRACE'S HOSPITAL ROOM - DAYBREAK\n</b>\n\tThe room's lights are dimmed. Dawn is being to break through.\n\n\tGrace, slowly, opens her eyes coming out of sedation. She \n\ttakes a moment to figure out where she is... to remember.\n\n\tShe uses her hands to hoist herself up, but she's unsteady \n\tand knocks into her bedside table -- knocking the Good Luck \n\tCharm from India off the table. It rolls under the bed, with \n\ta water tumbler. Grace never sees the Charm.\n\n\tGrace looks where her leg once was. She feels the blanket, \n\tthe empty space where her leg once was... just like her mother \n\tdid (did her father couldn't). Instead of self-pity, she's \n\toddly fascinated.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tINT. GRACE'S HOSPITAL ROOM - LATER THAT DAY\n</b>\n\tDaylight pours in. Robert and Annie enter. Robert, loaded \n\twith gifts, immediately crosses to Grace, on the side of her \n\tgood leg. Annie takes her position beside the lost leg. \n\tRobert kisses his daughter;\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHi, sweetheart...\n\n\tAnnie's hand finds Grace's hand, and holds one of her fingers \n\ttightly. Grace responds by wrapping her hand around her \n\tmother's. They exchange a look of respect and gratitude.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tHave you heard from Judith's parents?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tNo, not yet.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tHow's Pilgrim doing?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLiz is taking care of him.\n\t\t\t(to change the subject)\n\t\tThe doctor said the sooner you start \n\t\ttherapy the better the chances are you \n\t\tcan --\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI can't even get out of bed yet! You're \n\t\talready putting me in therapy!!\n\n\tAnnie, slightly hurt, drops it as Robert takes over:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tThe doctor said whenever you're ready. \n\t\tTake your time. You tell us... But he \n\t\tthinks it'll only be a few months, then --\n\n\tAs Robert continues talking, Annie drifts to the Nurse. \n\tNeeding to manage something, she asks:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDid you get her fresh towels?\n\n<b>\tSOME TIME LATER:\n</b>\n<b>\tEXT. CENTRAL PARK WEST APARTMENT BUILDING - DAY\n</b>\n\tA limousine drives up as the Doorman gets the car door. The \n\tweather is slightly warmer. People's clothing looks as if \n\tspring is coming nearer.\n\n\tAnnie exits first, carrying a jacket for Grace. She is \n\tfollowed by Robert, who immediately turns to help Grace. We \n\thear her O.S.\n\n<b>\t\t\t\t  GRACE (O.S.)\n</b>\t\tDad! I can do it, OK?!\n\n<b>\t\t\t\t  ROBERT\n</b><b>\t\tOK, OK.\n</b>\n\tAnnie shoots him a disapproving look.\n\n\tWe see Grace's good leg exit first... then two crutches, \n\tfollowed by... a PROSTHETIC LEG. Grace scoots into view, and \n\ttakes a breath.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYou all go ahead. I'll be up by \n\t\tChristmas.\n\n<b>\tINT. CENTRAL PARK WEST APARTMENT - NIGHT\n</b>\n\tThe three sit at a dinner table, eating dinner. Grace picks \n\tat her food. Robert can't help staring at her. Annie eats, \n\twatching them both.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tDo you want something else, honey? \n\t\tWe order something else?\n\n<b>\t\t\t\t  GRACE\n</b>  \t\tNo, I'm just not that hungry.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhy don't you go lie down?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI don't want to lie down. I've been \n\t\tlying down enough.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tYou want to watch some television?\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(edgy)\n\t\tMaybe... look -- just...\n\n\tRobert and Annie wait. She doesn't continue. She rises, \n\treaching for her crutches. Robert moves to help.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI got it! I got it!\n\n\tShe exits into her room. Annie looks at him disapprovingly.\n\n<b>\tINT. ANNIE AND ROBERT'S BATHROOM/BEDROOM - NIGHT\n</b>\n\tAnnie and Robert stand before their separate sinks, talking \n\tto each other through their separate mirrors, as they wash up \n\tfor bed.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou've got to stop doing that?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tDoing what?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHelping all the time! Running to her \n\t\tevery time she trips or falls... \n\t\tAnticipating her all the time.\n\n\tRobert shuts off his sink and dries his face, without a word. \n\tHe exits into the bedroom, and gets into bed. For a beat, he \n\tstares up at the ceiling -- then says quite plainly.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tYou know, Annie, this didn't just happen \n\t\tto you.\n\n\tAnnie is applying moisturizer when she hears this. As it \n\tsinks in, she doesn't like it.\n\n<b>\tINT. GRACE'S BEDROOM - NIGHT\n</b>\n\tGrace stands by her door and can hear her parents muffled, \n\ttense voices. Annie is angry at his complacency. Robert just \n\twants what's best for Grace. She closes the door. Silence. \n\tShe puts her crutches against the wall and tries to walk \n\ttowards her bureau without them. It is a struggle, but she \n\tdoes... almost falling, but grabbing the bureau just in time. \n\tThe 8X10 of her and Pilgrim, falls face down. She props it up \n\tand looks at it -- focusing on her horse, then on Judith. \n\tSuddenly, she lashes out, knocking the photograph onto the \n\tfloor...\n\n<b>\t\t\t\t  ROBERT (O.S.)\n</b>\t\tHoney, you all right? Did something \n\t\tfall?\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(angrily shouts)\n<b>\t\tNO!\n</b>\n<b>\tEXT. GRACE'S PRIVATE SCHOOL - MORNING\n</b>\n\tAnnie pulls up in a Range Rover and stops. Grace moves for \n\tthe door. Annie asks respectfully;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDo you want any help?\n\n\tGrace doesn't even bother to answer. She manages to get onto \n\tthe pavements, then turns for her bag...\n\n\tAnnie notices other kids looking at Grace from behind, as they \n\tenter the school.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDad'll pick you up today, all right?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tOkay.\n\n\tGrace looks up to her mother. What is unspoken between them \n\tis the understanding that today will be difficult and there's \n\tnothing either one can do about it.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou'll be fine.\n\n\tGrace nods and turns to the school. Annie watches her go.\n\n<b>\tINT. GRACE'S SCHOOL - MORNING\n</b>\n\tGrace makes her way through the hall. It is the first time \n\tshe has had to maneuver through a crowd. Some of the younger \n\tchildren are especially unconscious. Grace sweats her way \n\tthrough, trying to maintain her balance and her sanity.\n\n\tAs Grace slowly moves along, whatever small faith she had \n\tthat she could get through this day, begins to diminish.\n\n<b>\tINT. ANNIE'S OFFICE - DAY\n</b>\n\tAnnie moves about the office, hands in pocket, in front of \n\ther wall of windows. LUCY and her staff sitting around the \n\toffice. Annie is speaking to a YOUNG WOMAN staff member;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't care what he told you! The \n\t\tman's a liar! The man's an actor, for \n\t\tChrist's sake. They're all liars! \n\t\tThey'll say anything to get a cover...\n\n\tThe Young Woman looks insulted. AN ASSISTANT comes in to give \n\tAnnie a note;\n\n<b>\tEXT. GRACE'S SCHOOL - DAY\n</b>\n\tAnnie is crossing an empty school yard. Grace is sitting on \n\tthe ground, her back against a wall, her \"legs\" in front of \n\ther. She has been crying. She looks up to her mother.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tIt's too hard.\n\n\tAnnie kneels before her sympathetically brushing her hair away:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, honey... What happened?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDoesn't matter. I... I don't want to \n\t\tcome back, that's all.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(softly)\n\t\tOh. Well, what are you going to do? You \n\t\thave to go to school, honey. I mean, what --\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(snaps)\n\t\tI'm not coming back! That's it! I want to \n\t\tgo home!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace, listen to me. Your body is just \n\t\thealing. You have to give the rest of you \n\t\ttime as well...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tIs that your version of a pep talk?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou are not staying home all day feeling \n\t\tsorry for yourself. You're going to get \n\t\tup and you're going to figure this out.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(snotty)\n\t\tFine!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's still early. What's your next class?\n\n\tWith secret delight, Grace viciously utters the word:\n\n<b>\t\t\t\t  GRACE\n</b>\t\tGym!\n\n<b>\tINT. ANNIE AND ROBERT'S BEDROOM - NIGHT\n</b>\n\tAnnie is at her desk studying Grace's book on Horse Whisperers. \n\tRobert is on his bed with briefs laid out before him.\n\n<b>\tINT. GRACE'S BEDROOM - SAME NIGHT\n</b>\n\tThe door is closed. A SONG blares on her stereo. Grace is in \n\ther bed watching a video of her and Pilgrim... riding at a \n\thorse show. There's a shot of Annie standing proudly, \n\twatching her ride. Another shot of her and Judith, both of \n\tthem on their horses, waving to camera.\n\n<b>\tINT. BEDROOM - SAME NIGHT\n</b>\n\tGrace enters.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDad?\n\n\tBoth Robert and Annie look up.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWhat, sweetheart?\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(beat)\n\t\tI want to see Pilgrim.\n\n\tRobert and Annie exchange an anxious look.\n\n<b>\tEXT. DYER HORSE FARM, CONNECTICUT - DAY\n</b>\n\tIt's raining. The MacLean car is parked by the barn. They \n\tare walking towards the stables under their umbrellas as Liz \n\truns to greet them.\n\n<b>\t\t\t\t  LIZ\n</b>\t\tHello...\n\t\t\t(to Grace)\n\t\tIt's so good to see you. How ya \n\t\tdoing?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tShe's doing just grea. Aren't you \n\t\tkiddo?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI'm fine.\n\n<b>\t\t\t\t  LIZ\n</b>\t\tWell, come on. He's out back now...\n\t\t\t(leads them)\n\t\tMind how you go. It's pretty muddy back \n\t\tthere.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhy is he in the back? Why isn't he in \n\t\tthe barn with the other horses?\n\n\tLiz stops, causing everyone to stop. She turns to face Grace, \n\trealizing she doesn't know. She looks at Robert and Annie, \n\taccusingly. She tries to explain:\n\n<b>\t\t\t\t  LIZ\n</b>\t\tWell, Grace, you see... Pilgrim just... \n\t\tisn't the same horse he used to be.\n\t\t\t(to the parents)\n\t\tAs a matter of fact, maybe now's not \n\t\tthe best time to --\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI really want to see him.\n\n\tLiz looks at Annie. Annie nods. Liz leads them on.\n\n\tThey reach a row of empty old stalls. They cross to one of \n\tthe stalls -- its doors are closed. Liz draws back the bolt \n\ton top half of the door.\n\n\tThere is an immediate explosion of sound inside the stall, \n\tthe sound of fear, startling them. Then it's still. Liz \n\tslowly opens the door. Grace, with the aide of her cane, \n\twalks to the stall. She hesitates, then looks in. It takes a \n\tmoment for her eyes to grow accustomed to the dark. She sees \n\tPilgrim with his head down in the shadows...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tHello, beautiful boy...\n\n\tHe lifts his head at the sound of her voice. Grace, and the \n\taudience, see him for the first time -- His mad eyes, his \n\tterrible disfigurement...\n\n\tGrace cries out, stepping backwards, nearly stumbling in the \n\tmud... What is left of her horse are gone. Annie realizes \n\twhat's happened and, together with Robert, rush to her... They \n\ttoo see the monster Pilgrim has become and are horrified. \n\tGrace angrily pushes away from them and \"runs\" off. Robert \n\tgoes after her.\n\n\tAnnie is standing in the rain with Liz -- her eyes unable to \n\tmove away from the sight of Pilgrim.\n\n<b>\t\t\t\t  LIZ (O.S.)\n</b>\t\tYou should have told her, Annie. I \n\t\ttried to explain to you how bad it was... \n\t\tI guess you had to see it. But, there's \n\t\tnothing to be done. This animal's beyond \n\t\thelp. Annie, can I have your permission \n\t\tnow to put him down?\n\n\tAnnie stands in the rain, hands in pocket, fixed on Pilgrim \n\tand more determined than ever;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo.\n\n<b>\tEXT. CENTRAL PARK WEST APARTMENT - NIGHT\n</b>\n\tAlone in her study, Annie sits before her computer searching \n\tthe Internet for information on HORSES -- Veterinarian \n\tJournals, Therapies, Accidents, Eistories... We sense she's \n\tbeen at it a while...\n\n\tShe locates an ITEM TITLE -- HORSE WHISPERERS. Interested, she \n\tbrings it up on the screen.\n\n<b>\tINT. NEW YORK PUBLIC LIBRARY - NIGHT\n</b>\n\tAnnie sits in the huge reading room, books spread out before \n\ther, under a green reading lamp. Her voice tells us what she's \n\treading:\n\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\t\"It was in America that horses first \n\t\troamed...\"\n\n\tIn the books, we see pictures, lithographs, paintings and \n\tdrawings...\n\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\t\"A million years before the birth of \n\t\tman, they grazed the vast empty plains of \n\t\tgrass and crossed to other continents \n\t\tover bridges of rocks... They first knew \n\t\tman as the hunted knows the hunter, for \n\t\tlong before man saw horses as a means to \n\t\tkilling other beasts, man killed them for \n\t\tmeat...\"\n\n<b>\tANNIE'S V.O. CONTINUES OVER;\n</b>\n<b>\tINT. PILGRIM'S STALL - NIGHT\n</b>\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\t\"...The alliance with man would forever \n\t\tbe fragile -- for the fear he'd struck \n\t\tinto their hearts was too deep to be \n\t\tdislodged... Since that Neolithic moment \n\t\twhen a horse was first haltered, there \n\t\twere those among men who understood \n\t\tthis...\"\n\n<b>\tINT. GRACE'S ROOM - NIGHT\n</b>\n\tGrace sits alone in her darkened room, staring out the window \n\tbut not looking at anything. There's a discomforting distance \n\tin her expression.\n\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\t\"... They could see into the creature's \n\t\tsoul and soothe the wounds they found \n\t\tthere...\"\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. A FAIRGROUNDS PARKING LOT, CALIFORNIA - DAY\n</b>\n\tA hot, dusty fairgrounds horse arena. The worn wooden bleachers, \n\tcrowded. Lines of cars and pick-up trucks.\n\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\t\"...For secrets uttered softly into \n\t\ttroubled ears, these men were known as \n\t\tThe Whisperers...\"\n\n\tOne particular pick-up truck has its back door opened. A \n\tMAN'S LEG is sticking out, putting on a pair of boots.\n\n\tA moment later the Man gets out of the car. Holding a cowboy \n\that, he has a certain quality, a self-respect, that men who \n\tknow themselves seem to have. TOM BOOKER.\n\n\tA weathered redheaded woman named RONA -- late forties, strong, \n\twiry horsewoman's build -- is walking towards him.\n\n<b>\t\t\t\t  RONA\n</b>\t\tHey, darlin'.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHey, Rona. Sorry I'm late.\n\n<b>\t\t\t\t  RONA\n</b>\t\tI wouldn't know what to do if you were \n\t\ton time.\n\n\tThey walk together towards the fairgrounds.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou're looking fit.\n\n<b>\t\t\t\t  RONA\n</b>\t\tFit? You want to check my teeth.\n\t\t\t(Tom laughs)\n\t\tGood crowd today. I think you'll have \n\t\tsome fun. You going to stay for dinner?\n\n<b>\t\t\t\t  TOM\n</b>\t\tIf it's not too much trouble, I thought \n\t\tI might.\n\n<b>\t\t\t\t  RONA\n</b>\t\t\t(playful)\n\t\tKind of trouble I'm in the mood for.\n\n<b>\t\t\t\t  TOM\n</b>\t\tOh-oh... Maybe I better get back in the \n\t\ttruck.\n\n\tRona lets out a hearty laugh as they enter the horse arena.\n\n<b>\tEXT. HORSE ARENA, CALIFORNIA - DAY\n</b>\n\tInside the corral, a small black thoroughbred is being worked \n\tby Tom. As he rides and narrates into a radio microphone to \n\tthe crowd, we sense this is a man of good humor and great \n\tskill --  guileless, sensible, of the earth.\n\n<b>\t\t\t\t  TOM\n</b>\t\t... It's always kind of interesting to \n\t\thear the horse's side of the story...\n\n\tThe crowd laughs warmly. He directs his comments to a WOMAN \n\twearing an expensive Ralph Lauren western outfit, standing \n\toutside the corral...\n\n<b>\t\t\t\t  TOM\n</b>\t\tNow if he was cranky or lazy, like you \n\t\tsay he is, we'd be seeing his tail \n\t\ttwitching there and his ears back, \n\t\tmaybe. But this isn't a cranky horse, \n\t\tit's a scared horse. You see how braced \n\t\the is up around the neck back there. \n\t\tHe just doesn't know which way to turn...\n\n\tThe Woman nods. Tom turns the horse on a dime so that he \n\talways stays facing the circling thoroughbred...\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou see how he keeps pointing his \n\t\thindquarters in at me? Well, I'd guess \n\t\tthe reason he seems reluctant to move \n\t\tout is because when he does, he gets in \n\t\ttrouble for it.\n\n<b>\t\t\t\t  THE WOMAN\n</b>\t\tHe's not good at transitions, you know? \n\t\tWhen I want him to move from a trot to a \n\t\tlope, say...\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(smiles)\n\t\tWell, I'm sure that's what you think but \n\t\tthat's not what I'm seeing. You may think \n\t\tyou're asking for a lope, but your body \n\t\tmay be saying something else altogether. \n\t\tYou might be putting too many conditions \n\t\ton him. For instance, you might be saying \n\t\t\"GO, but, hey, don't go too fast.\" He can \n\t\ttell that from the way you feel. Your \n\t\tbody can't lie. You ever give him a kick \n\t\tto make him move out?\n\n<b>\t\t\t\t  THE WOMAN\n</b>\t\tHe won't go unless I do.\n\n<b>\t\t\t\t  TOM\n</b>\t\tAnd then he goes and you feel like he's \n\t\tgoing too fast, so you yank him back?\n\t\t\t(she nods)\n\t\tAnd next thing you know, he's bucking.\n\t\t\t(she nods again)\n\t\tWell, if someone told you to go, stop, \n\t\tgo, stop -- you'd buck too.\n\n\tThe people laugh. The Woman smiles self-consciously.\n\n<b>\t\t\t\t  TOM\n</b>\t\tIt's a dance, see... Somebody has to lead \n\t\tand somebody has to follow.\n\n\tTom gracefully moves his horse around the ring, \"dancing\". He \n\tthen takes up a long coiled rope and throws it so that the \n\tcoils slap against the black horse's flank, making it burst \n\tinto a lope. And again... Making the animal go from a trot to \n\ta lope, letting it slow, then up to a lope again.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI want him to get so he can leave real \n\t\tsoft. He's getting the idea now. He's \n\t\tnot all braced up and tense like he was \n\t\tat the start. He's finding out it's okay.\n\n\tHe throws the rope again and this time the transition to the \n\tlope is a smooth one.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou see that? He's getting better \n\t\talready. Pretty soon, if you work at \n\t\tit, you'll be able to make all these \n\t\ttransitions easy on a loose rein.\n\t\t\t(sotto voce, wry)\n\t\tYeah, and pigs'll fly.\n\t\t\t(to Woman)\n\t\tHe's going to be okay -- so long as you \n\t\tdon't go yanking on him.\n\n\tShe nods, but he can see she's upset, feeling foolish. He \n\twalks the horse over to her, turns off the microphone and \n\tspeaks sympathetically:\n\n<b>\t\t\t\t  TOM\n</b>\t\tLook, the truth is it's all about self-\n\t\tpreservation. These animals.\n\t\t\t(with great affection)\n\t\t... well, they just have such big hearts, \n\t\tyou know? There's nothing they want more \n\t\tthan to do what you want them to do. But \n\t\twhen the messages get all confused, the \n\t\tonly thing they know to do is try and \n\t\tsave themselves... Now, why don't you go \n\t\tsaddle up and see what happens.\n\n\tFeeling better, and not a little attracted to his heartfelt \n\tman's man, the Woman smiles and reaches for his hand to climb \n\tover the rail. Her horse lets her come right up to him and \n\tstroke his neck. Tom comments;\n\n<b>\t\t\t\t  TOM\n</b>\t\tThey won't ever hold a thing against \n\t\tyou. They're the most forgiving \n\t\tcreatures God ever made.\n\n\tTurning on his mike and turning back to the crowd, he says:\n\n<b>\t\t\t\t  TOM\n</b>\t\tOkay, who's next?\n\n\tA Young Boy leads a mule into the ring. Tom smiles:\n\n<b>\t\t\t\t  TOM\n</b>\t\tNow God has another idea entirely with \n\t\tthe mule.\n\n<b>\tEXT. THE FAIRGROUNDS - LATER THAT DAY\n</b>\n\tTom has finished his \"show.\" People are shaking his hand, \n\tthanking him, as he walks away from the corral, towards a \n\ttrailer.\n\n\tThe Woman in the Ralph Lauren approaches:\n\n<b>\t\t\t\t  WOMAN\n</b>\t\tExcuse me.\n\n\tHe faces the Woman:\n\n<b>\t\t\t\t  WOMAN\n</b>\t\tHi. I'm Dale. I just wanted to -- I can't \n\t\tget over the way he felt under me after \n\t\tyou'd finish with him. Everything had \n\t\tjust, I don't know, freed up or something.\n\n\tThe Woman is flirting. Tom shrugs, uncomfortably;\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, that'll happen.\n\n<b>\t\t\t\t  WOMAN\n</b>\t\tWhere did you learn all this stuff?\n\n<b>\t\t\t\t  TOM\n</b>\t\tWhat stuff is that?\n\n<b>\t\t\t\t  WOMAN\n</b>\t\tAbout horses? I'd love to learn more \n\t\tabout it myself. Do you offer any \n\t\tprivate lessons for riders?\n\n<b>\t\t\t\t  TOM\n</b>\t\t \t(getting the message)\n\t\tWell... Dale... you know, a lot of this \n\t\tstuff... it just... nuts and bolts.\n\n<b>\t\t\t\t  WOMAN\n</b>\t\tWhat do you mean?\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, if the rider's nuts, the horse \n\t\tbolts.\n\t\t\t(smiles)\n\t\tThat's the whole lesson right there. \n\t\tYou have a good day now... Just... keep \n\t\ton freeing yourself up.\n\n\tHe leaves her, entering the trailer.\n\n<b>\tINT. RONA'S TRAILER - NIGHT\n</b>\n\tA small, well-used trailer. Tom and Rona are finishing dinner \n\tlike comfortable old friends. Rona rises, taking the plates \n\tinto the kitchen and starts rinsing them:\n\n<b>\t\t\t\t  RONA\n</b>\t\tOh I clear forget. You had a call from \n\t\tsome woman in New York. She sounded \n\t\tpretty wound up.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI don't any woman in New York. But from \n\t\twhat I hear, most of them are wound up.\n\n<b>\t\t\t\t  RONA\n</b>\t\tThe number's by the phone.\n\n\tHe nods but doesn't move. He just looks at Rona and smiles. \n\tShe's a good woman. But Tom hopes she doesn't want anymore \n\tthan what they have together. Rona notices him looking and \n\tsmiles:\n\n<b>\t\t\t\t  RONA\n</b>\t\tWhat are you looking at, young man?\n\n<b>\t\t\t\t  TOM\n</b>\t\tHow long were you married?\n\n<b>\t\t\t\t  RONA\n</b>\t\tLong enough.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou ever miss it?\n\n<b>\t\t\t\t  RONA\n</b>\t\tDoes a horse miss a saddle?\n\n<b>\t\t\t\t  TOM\n</b>\t\tSometimes.\n\n\tShe chuckles, shuts the water off and crosses back to him, \n\tsitting beside him.\n\n<b>\t\t\t\t  RONA\n</b>\t\tWell as a matter of fact, I don't... most \n\t\tof the time.\n\n\tShe starts unbuttoning his shirt.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou know, Rona, we weren't all that good \n\t\ttogether even when we were good together.\n\n<b>\t\t\t\t  RONA\n</b>\t\tHoney... I was always good.\n\n\tTom smiles as Rona leans in. They kiss.\n\n<b>\tINT. ANNIE'S OFFICE, N.Y.C. - MORNING\n</b>\n\tAnnie is looking over a magazine cover with Lucy and her staffers. \n\tShe is unhappy.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou know it's perfectly shot, it's \n\t\tperfectly cropped, it's perfectly laid \n\t\tout and I'm so bloody bored, I'd rather \n\t\tbuy a Motor Racing magazine -- Start \n\t\tover.\n\n\tSome general whines and groans as her assistant hands her a \n\tnote.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tUh, would you all excuse me a moment?\n\n\tShe waits for them to leave as she sits before the phone. One \n\tof her lines is lit:\n\n<b>\tEXT. A ROADSIDE SERVICE STATION SOMEWHERE IN UTAH - DAY\n</b>\n\tAn endless sky. An empty ribbon of two-lane highway in Utah. \n\tA small roadside station. Tom's pick-up truck, his horse \n\ttrailer hitched to it, getting gas.\n\n\tTom is on the pay phone. We hear Annie's voice:\n\n<b>\t\t\t\t  ANNIE (O.S.)\n</b>\t\tThis is Annie MacLean.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYeah. Hello. This is Tom Booker. I got a \n\t\tmessage you called.\n\n\tINTERCUT ANNIE in her office:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(efficient, expeditiously)\n\t\tOh! Yes. Thank you for calling back. Uh, \n\t\tall right, let me try to explain my \n\t\tsituation as briefly as possible... You \n\t\tsee, my daughter had an accident with \n\t\ther horse... They were both injured and \n\t\tshe, my daughter, she hasn't been able \n\t\tto... fully... uh... It was an extremely \n\t\ttraumatic experience... and uh...\n\n\tTom, sensing her turmoil, listening compassionately.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI went on the Internet and found this \n\t\tarticle about you... It says you're a Horse \n\t\tWhisperer, that you... you help people \n\t\twith horse problems. And you have quite a \n\t\tsuccess rate when it comes to traumatized --\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, see, truth is, ma'am, I help horses \n\t\twith people's problems.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, you know, however you want to put \n\t\tit -- I got your information from the \n\t\tpublisher of the article. I called \n\t\tMontana and your sister-in-law, I think, \n\t\tgave me this number.\n\t\t\t(trying to be charming)\n\t\tI'm been hot on your trail you could say \n\t\tbecause I was hoping you'd consider \n\t\tcoming to New York and taking a look at \n\t\tmy daughter's horse and possibly --\n\n<b>\t\t\t\t  TOM\n</b>\t\tMa'am, I'm very sorry about your problems \n\t\tand I appreciate what your daughter must \n\t\tbe going through, but I'm afraid you've \n\t\tmisunderstood whatever it is you read. I \n\t\tdon't do that sort of thing.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, if you could just come for the day. \n\t\tNew York's only a few hours by plane, \n\t\tI'd have you home by dinner...\n\n<b>\t\t\t\t  TOM\n</b>\t\tLook, even if it was nearer, that's just \n\t\tnot what I do. I give clinics. And I'm \n\t\tnot even doing them for a while. I'm \n\t\theading back to Montana right now. I got \n\t\ta ranch to take care of...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(interrupts, abruptly)\n\t\tI'll pay you for your fare. I'll send you \n\t\tto Montana first class.\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(getting impatient)\n\t\tMa'am, first class to Montana is a waste \n\t\tof good money. Now, am I being too polite \n\t\there or when I say NO in Utah, does that \n\t\tmean YES in New York City?\n\n\tAnnie is taken aback. Tom feels badly.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI, I don't mean to sound insensitive. I \n\t\tunderstand your situation. But there's \n\t\tnothing I can do. You just called the \n\t\twrong person, that's all. I hear there \n\t\tare a bunch of therapists in New York. \n\t\tMaybe you should call one of them.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tMr. Booker, if I could just ex --\n\n<b>\t\t\t\t  TOM\n</b>\t\tI am very sorry, ma'am. Goodbye now.\n\n\tHe hangs up before Annie can continue.\n\n<b>\tINT. GRACE'S BEDROOM - NIGHT\n</b>\n\tAnnie reaches for Grace's bedroom door, then pauses. She \n\trealizes she should knock. She does and whispers:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace?\n\t\t\t(knocks again)\n\t\tGrace, it's mom.\n\n\tAnnie slowly opens the door. She finds Grace's bed empty. She \n\tlooks over to the window to find Grace sitting in a chair, in \n\tthe dark, looking out the window.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace. What are you doing?\n\n\tNot looking up, Grace speaks in a hollow voice.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI can't find that charm Daddy gave me \n\t\tfrom India.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI brought it to you in the hospital.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tNo, you didn't.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace, I put it on the table near your --\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(apathetic)\n\t\tDoesn't matter.\n\n\tBeat.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHave you decided about Pilgrim?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat about him?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell... how you feel all right about \n\t\ttelling Liz to put him down...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI think we should. It's not fair to let \n\t\thim suffer. He's not much use anymore. \n\t\tHe'd hate living like that.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI think that's... very compassionate \n\t\tand... mature way of looking at it.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tMom?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tMaybe they should put me down too.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI mean, I'm not much use anymore. Why \n\t\tcan't they be compassionate to me?\n\n\tWhat frightens Annie most is the calm and apathy in Grace's \n\tvoice. She's surrendering... Annie, for the first time in a \n\tlong time, feels she's losing control.\n\n<b>\tINT. CENTRAL PARK WEST APARTMENT - NIGHT\n</b>\n\tAnnie sits alone at the kitchen table, nursing a glass of \n\twine.\n\n\tRobert enters and sits opposite her, wearing a tuxedo -- his \n\ttie and collar undone.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHow was the dinner?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t   (wry)\n\t\tAll our \"favorite\" people were there \n\t\tsaying all their \"favorite\" things about \n\t\ttheir \"favorite\" subjects. I thought to \n\t\tmyself, we've been friends with these \n\t\tpeople almost twenty years and nobody \n\t\tknows anybody. We're so afraid we won't \n\t\tlike each other and have nobody go to \n\t\tdinners with.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhy did you go?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(surprised)\n\t\tThey're still our friends, Annie. It's \n\t\tnothing serious. You kid about them all \n\t\tthe time... And I could tell Paul really \n\t\tappreciated me being there.\n\n\tHe drinks Annie's wine as she looks at him.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tDid you get a hold of that horse guy?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWhat did he say?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo.\n\n\tRobert nods. Accepting. Silence. Annie sips her wine. Then:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI was thinking... Maybe we should think \n\t\tabout the three of us going someplace \n\t\twarm... Remember that house we rented in \n\t\tBermuda... The pink one with the --\n\n\tHis arm accidentally spills the wine.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tShit.\n\n\tAs he bends down to wipe it up with a napkin, Annie watches \n\tRobert clean the spill. Something about his movements, his \n\tposture -- a sense of weakness, of surrendering, of not having \n\tthe inclination to fight, of just accepting and smoothing \n\tover the rough sports -- strikes her hard. Annie realizes the \n\tlove she feels for Robert isn't fading. It's gone.\n\n\tHe finishes cleaning and sits.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWhat was I saying?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tAbout us going someplace warm... \n\t\tSomeplace Grace'll have to wear shorts \n\t\tor bathing suits or summer dresses...\n\n\tRobert looks at her and realizes it's a bad idea. He nods, \n\tagain, getting the message. Silence. In that silence, Annie \n\tlooks at him... and makes a decision:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tRobert, I want to take Pilgrim out to Mr. \n\t\tBooker. Drive him out to Montana... With \n\t\tGrace.\n\n\tRobert is confused... and a little worried.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI don't understand. You just said he \n\t\tsaid no.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHe did, but... I think I can change his \n\t\tmind.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tThat's the craziest thing I ever heard. \n\t\tAbsolutely not.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tRobert, Grace isn't adjusting to school. \n\t\tAnd she can't sit in this apartment all \n\t\tday... I think it would be good for her.\n\n<b>\t\t\t  \t  ROBERT\n</b>\t\t\t(at a loss)\n\t\tNO! What are you -- you're serious about \n\t\tthis?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI've called Liz. They can set me up with \n\t\ta trailer for Pilgrim. I thought we'd \n\t\tstay at motels along the way...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(overlapping)\n\t\tYou've already made arrangements!?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo. I was just researching. Calm down.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI come home and you tell me we're going \n\t\tto drive a psychotic horse to Montana! I \n\t\tcan't just pick up and leave...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI'm not asking you to. I'll do it.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tYou want to do this by yourself? How? \n\t\tYou can't take care of Pilgrim all the --\n\n<b>\t\t\t \t  ANNIE\n</b>\t\tHe'll be sedated. I know horses, Robert. \n\t\tI'm the one who taught Grace how to ride.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(overlapping)\n\t\tWhat... Bo-... What about the magazine?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI'm in charge. I went back very soon \n\t\tafter the accident. They didn't expect me \n\t\tfor a couple of months. I'll just take \n\t\tthat time now... I can still oversee \n\t\tthings from Montana... Take my fax... \n\t\tMy computer...\n\n\tBeat. Robert fears this is about the marriage. Yet --\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tNo. It's, uh... No, I really don't think \n\t\tit's a good idea\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhy?!\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(searching)\n\t\tHer psychiatrist... said... she needs \n\t\tsecurity now... stability...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI can't say he's been all that effective \n\t\twith her.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tAre you a psychiatrist? He said it takes \n\t\ttime.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't care what he says! We have to do \n\t\tsomething, Robert! I can't sit here and \n\t\ttrust everything's going to work out just \n\t\tby pretending it will.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI'm not pretending anything!\n\n\tBeat. Robert just stares at her. He looks concerned... almost \n\tworried. Annie gets uncomfortable.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat?\n\n\tIt is very difficult for Robert to say;\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI thought... well, ever since the \n\t\taccident, I just thought we...\n\n\tHe stops. Annie knows where he headed and prays to God he \n\tdoesn't continue. He doesn't. A thick silence hangs between \n\tthem.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI really wish I could understand why \n\t\tyou think this is so necessary.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(frustrated)\n\t\tRobert, we're losing her. We're losing \n\t\ther.\n\t\t\t(he listens)\n\t\tI don't care what the doctors say. The \n\t\ttruth is, they don't know anymore than \n\t\twe do -- less, when it comes to Grace... \n\t\tThis may not sound sensible or... logical, \n\t\tbut nobody's suggesting anything better. \n\t\tI can't explain it, Robert. I just have \n\t\tthis feeling... this annoying... bloody \n\t\tfeeling that if... if, somehow, Pilgrim \n\t\tcan be made all right... then so can Grace. \n\t\tI just know it!\n\n\tRobert can feel the strength of her will. He can find no way \n\taround it.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWhat if she doesn't want to go?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tShe will if you think she should.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tAnd you think it's best if I don't come.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(hesitates)\n\t\tNo, that's not what I said. I'm not a \n\t\tdictator. If you feel you should come, \n\t\tthen come. Just do whatever you think \n\t\tis right.\n\n\tAt some moment, they realize Grace is standing at the entrance \n\tto the kitchen. They are surprised.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI'm not going! I don't care what she \n\t\tsays!\n\n\tAnnie lowers her head. Robert stares at Grace as she walks to \n\thim.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDaddy?... I don't want to go.\n\n\tGrace stands next to Robert. He holds her hands. Annie looks \n\tat him, without sympathy. Robert looks back. In his face is \n\tthe total acceptance of what must be. As well as the sadness \n\tof it's inevitability. He looks back at his daughter, whose \n\teyes have never left him.\n\n<b>\tEXT. JOAN DYER STABLE - DAY\n</b>\n\tPilgrim is being loaded into the trailer by four strong stable \n\tmen, violently kicking and pulling all the way.\n\n\tAnnie watches with anxiety -- an almost giddy Liz by her side.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tMaybe we should give him another \n\t\tsedative.\n\n<b>\t\t\t\t  LIZ\n</b>\t\tProblem is, there aren't many \n\t\tvolunteers. He's already had enough \n\t\tto sink a battleship. You have a \n\t\tpin, just in case?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOf course not.\n\n<b>\t\t\t\t  LIZ\n</b>\t\tProbably best. You may want to shoot \n\t\tyourself half way to Ohio.\n\n\tIn the back seat of ANNIE'S SUBURBAN sits Grace -- her back to \n\tthe action. Hearing Pilgrim's struggle. Putting her walkman \n\ton her ears and raising the volume... We hear --\n\n\tGRACE'S MUSIC, ON THE SOUNDTRACK, bringing us to:\n\n<b>\tEXT. A HIGHWAY, IN PENNSYLVANIA - DAY\n</b>\n\tAnnie's Suburban drives along Route 80, pulling the horse \n\ttrailer behind.\n\n<b>\tINT. SUBURBAN - DAY\n</b>\n\tGrace, in the back seat, wearing her headphones, listening to \n\ther music (maybe LIZ PHAIR OR HOLLY COLE). Detached. Non-\n\tcommittal. As trucks pass by, their time slapping the pavement, \n\tshe reacts and turns to the other window.\n\n\tAnnie, in sunglasses, shifts her attention between the road \n\tand her rear-view mirror -- checking on Grace.\n\n<b>\tEXT. HIGHWAY IN - EARLY MORNING\n</b>\n\tThe Suburban drives as the sun begins to set.\n\n<b>\tEXT. MOTEL IN OHIO - NIGHT\n</b>\n\tThe Suburban and Horse Trailer are parked in the lot.\n\n<b>\tINT. MOTEL ROOM, OHIO - NIGHT\n</b>\n\tA small furnished motel room with two twin beds.\n\n\tGrace sits up in bed watching TV, with no expression. A sitcom \n\twith canned laughter serves as a hypnotic drug.\n\n\tAnnie enters from the bathroom, after showering, drying her \n\thair. Grace doesn't bother to look up.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou want to take your bath?\n\t\t\t(Grace shakes her head)\n\t\tWe have to get up early tomorrow. You \n\t\tmay not have enough time to --\n\n<b>\t\t\t\t  GRACE\n</b>\t\tFine -- I'll take my bath.\n\n\tShe begins moving off the bed.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo, I don't mean you have to. It's just \n\t\tthat we may not have enough --\n\n<b>\t\t\t\t  GRACE\n</b>\t\t-- enough time tomorrow. I know.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLook, if you want to take it in the \n\t\tmorning, that's fine.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(interrupts on \"fine\")\n\t\tI don't care.\n\n\tAnnie realizes she may have pushed too hard, but she also \n\trealizes there's no talking to Grace now. So, she achieves \n\ther goal --\n\n<b>\t\t\t\t  JANNIE\n</b>\t\tTake it now.\n\n\tGrace hobbles off the bed, enters the bathroom and shuts the \n\tdoor.\n\n<b>\tINT. MOTEL ROOM IN OHIO - NIGHT\n</b>\n\tThe lights are off. Annie lays in bed, wide awake. It is the \n\tmiddle of the night.\n\n\tGrace, asleep in the other bed, begins whimpering. She's \n\thaving a bad dream. Annie rises -- considering whether or not \n\tto intercede... Finally, Grace begins to cry out... softly at \n\tfirst, but with increasing intensity until she awakens in \n\tfear... Annie appears right by her side.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat, sweetheart? What?\n\n\tShaken, Grace cannot fight how much she needs her mother at \n\tthat moment. She wraps her arms around her, tightly, and tries \n\tto catch her breath.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's sleeping in a strange bed, \n\t\tthat's all. Happens sometimes. It's \n\t\tOk. It's OK.\n\n<b>\tEXT. ANOTHER ROAD, MID-WEST - DAY\n</b>\n\tThe Suburban continues its journey.\n\n\tOnce again -- Annie, in the front, and Grace, in the rear, \n\tdrive without a word between them.\n\n<b>\tINT. SUBURBAN - DAY\n</b>\n\tGrace and Annie occupy their same positions. Annie is on the \n\tcar phone with her office.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOkay, listen -- let's do this. When \n\t\tI get to the next motel, I'll see if \n\t\tthey have a fax. If not, I'll call \n\t\tyou tomorrow to --\n\n\tAnnie continues O.S. when we hear a shifting, a rocking in \n\tthe trailer behind them. As if Pilgrim made a sudden move. \n\tGrace quickly turns her head. Annie looks in the rear view at \n\tGrace.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tUh Lucy, look, I have to go. OK... \n\t\tLater.\n\n\tAnnie hangs up and smiles at Grace through the mirror. Grace \n\treaches for her walkman and headphones. Annie offers;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace! GRACE!\n\n\tGrace lowers one side of her headphones;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWould you like to put your music on \n\t\tup here?\n\n\tGrace shrugs. Annie shrugs it off as well. Grace replaces the \n\theadphone. Annie turns on the radio -- nothing but country or \n\tgospel or religious talk shows... She shuts it off. Frustrated, \n\tAnnie looks up ahead and sees:\n\n<b>\tA TRUCK STOP DINER\n</b>\n\tAnnie yells to be heard through the headphones;\n\n<b>\t\t\t\t  ANNIE\n</b><b>\t\tIT'S ALMOST LUNCHTIME. ARE YOU \n</b><b>\t\tHUNGRY!?\n</b>\n<b>\t\t\t\t  GRACE\n</b>\t\t\t   \t (shrugs)\n\t\tWhatever you want.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tFine!\n\n<b>\t\t\t\t  GRACE\n</b>\t\tFine.\n\n\tAnnoyed, Annie pulls onto the gravel and stops, talking to \n\therself --\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tFine!\n\n\tShe exits the car, banging the door. As she walks acrund the \n\tcar to help Grace, she talks to herself in a sarcastic whisper:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\"Whatever you want!\" Well, this is what \n\t\tI want. I want to eat lunch and I want \n\t\tto smoke a cigarette and I want to keep \n\t\ttalking to myself for the next two \n\t\tthousand fucking miles...\"!\n\n\tShe opens Grace's door. Grace senses her mother's anger.\n\n<b>\tINT. TRUCK STOP DINER - DAY\n</b>\n\tAnnie and Grace enter. They look around:\n\n\tFormica floors, truckers in caps and beer bellies stuffed \n\tinto booths or at the counter. There is not a single space \n\tavailable.\n\n\tAnnie and Grace stand near the entrance. Another Trucker \n\tenters and they step aside, huddled together in this foreign \n\tland.\n\n<b>\tINT. MOTEL IN IOWA - NIGHT\n</b>\n\tGrace and Annie enter the room to find A DOUBLE BED instead \n\tof two twins. Neither comments.\n\n\tAnnie exits O.S., carrying the bags inside, as she says:\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou should call your dad before it \n\t\tgets too late.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI already did.\n\t\t\t(Annie's surprised)\n\t\tThis morning. When you went running.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh. You didn't tell me.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI didn't know I had to.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(stares angrily, speaks \n\t\t\t softly)\n\t\tYou don't.\n\n\tSilence. Annie exits past her to the car.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tLATER\n</b>\n\tGrace is asleep in her twin bed. Once again, Annie is wide \n\tawake. The clock reads: 4:55 AM. But Annie can not sleep. \n\tCamera moves away from Annie, past her side of the bed, to \n\tthe other side of the room.\n\n\tWE SEE THE SHADOW OF A WOMAN coming towards the bed. She \n\tcomes in camera angle and we follow to her back to the bed, \n\twhich has now transformed into --\n\n<b>\tA BED FROM THE PAST, IN WHICH A TEN-YEAR-OLD ANNIE IS \n</b><b>\tSLEEPING WITH HER YOUNGER BROTHER GEORGE.\n</b>\n<b>\tWE ARE IN MEMORY.\n</b>\n\tThe Woman gently shakes little Annie awaken.\n\n<b>\t\t\t\t  WOMAN\n</b>\t\tAnnie... Annie, sweetheart... wake \n\t\tup.\n\n\tThe little girl, with sleep in her eyes, turns and sees her.\n\n<b>\t\t\t\t  WOMAN\n</b>\t\tBad news I'm afraid. Your Daddy's \n\t\tgone.\n\n<b>\tEND OF MEMORY.\n</b>\n\tAnnie, in present time next to Grace, thinks of this as she \n\tstays awake. Putting her jogging parka on over her nightgown, \n\tshe goes outside.\n\n<b>\tEXT. IOWA MOTEL - NIGHT\n</b>\n\tShe crosses the motel parking lot to the horse trailer. She \n\tlooks in through the siding at Pilgrim, checking on him. She \n\tsees he is caught his halter on the side of the van. She \n\tcrosses to the trailer door, hesitates, then opens it. \n\tPilgrim looks at her. Gathering her courage, she climbs \n\tinside. He is still, looking at her. She carefully frees his \n\thalter. And suddenly he bares his teeth, biting at her. She \n\tstumbles back out of the trailer, slamming the door shut. She \n\tstands leaning against the trailer -- wondering if she's out \n\tof her mind for attempting this.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. IOWA MOTEL - LATER THAT SAME MORNING\n</b>\n\tAnnie is returning from her jog, sweating. As she crosses to \n\ther motel room, she stops by the window, looking in to see:\n\n\tGrace, on the floor, straining to do her exercises.\n\n\tAnnie fills with compassion for her girl -- reminded of the \n\tstruggle she faces everyday.\n\n<b>\tEXT. THE BADLANDS - DAY\n</b>\n\tIn the distance, the Suburban and horse trailer look like a \n\tdot on the horizon, moving across the Badlands.\n\n<b>\tINT. THE SUBURBAN - ANOTHER TIME, DUSK\n</b>\n\tGrace leans against the window in the back, in one of her \n\tdarker moods. Annie switches radio stations, from Bible \n\tthumping to Farm reports. She shuts it off. Silence.\n\n\tShe sees a ROAD SIGH: \"LITTLE BIGHORN NATIONAL MONUMENT\".\n\n<b>\t\t\t\t ANNIE\n</b>\t\tGrace, look!\n\n\tGrace reads the sign.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWould you like to see that?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI don't care.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(overlapping)\n\t\tI don't care.\n\n\tAnnie's comic mimicking, throws Grace off center.\n\n\tAnnie turns off onto the exit. They drive by a massive casino \n\t-- it's neon sign flickering. They drive up a hill past a cafe, \n\ttwo Indians in high crowned Cowboy hats standing outside of \n\tthe cafe. She drives up a hill towards the parking lot of the \n\tMonument...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThis'll be nice. We haven't seen any \n\t\tof the sights yet. It's history. When \n\t\tI was thirteen I used to love seeing \n\t\tthings like this.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYou were never thirteen, Mom.\n\n\tAnnie laughs, taking it as a joke. Grace almost smiles.\n\n\tBut, Annie drives up to sign only to find a CLOSED SIGN. The \n\tpark was closed at six. Annie stops the car. She's hit a \n\tbrick wall once more. Silence. Finally, Grace speaks with her \n\tusual sarcasm;\n\n<b>\t\t\t\t  GRACE\n</b>\t\tGreat idea. So now what?\n\n\tBeat. Annie's patience snaps;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHow long is this going to go on?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou know what I mean?\n\t\t\t(turns to the back seat)\n\t\tIs this it now? Is this the way we're \n\t\tgoing to be from now on?\n\n\tIgnoring her, Grace edges to the passenger side and exits the \n\tcar. Annie gets out of the driver's side and walks around as \n\tshe speaks:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDo you want us to turn around and go \n\t\tback home? Do you?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat are you asking me for? You didn't \n\t\task me if I wanted to come in the first \n\t\tplace -- now I get to decide? Forget it!\n\n\tShe begins to turn away. Annie grabs her arm.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWho do you think I'm doing this for? \n\t\tI'm doing this for you!\n\n<b>\t\t\t\t  GRACE\n</b>\t\tBullshit! It's about you! About you \n\t\tdeciding! About you always being \n\t\tright! You always getting everything \n\t\tyour way, controlling everybody -- \n\t\tlike we work for you or something!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't believe this!\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYou just want to get away from Daddy \n\t\tand you're using me to do it!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThat's not true! Whatever problems your \n\t\tfather and I are having, have nothing \n\t\tto do with this.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYou're amazing! You act like I don't \n\t\tlive in that house! Don't you think I \n\t\thear the two of you!? Don't you think \n\t\tI can tell what's going on? I'm not \n\t\tfive years old, Mom!\n\t\t\t(Annie is stopped)\n\t\tYou want to divorce Daddy and Daddy \n\t\tdoesn't want to.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDid he tell you that?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tHe doesn't have to! It's, like, so \n\t\tobvious you can't stand him.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThat's not true!\n\n<b>\t\t\t\t  GRACE\n</b>\t\tThen why do you want to leave?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's... it's not that simple to explain. \n\t\tI know you think it is, but it's not. \n\t\tThe truth is, I don't really know what \n\t\tI want to do. I don't have all the \n\t\tanswers.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tNo, you just act like you do.\n\n\tAnnie is choked with fury. She doesn't know whether to \n\tscream, cry or strangle Grace. She turns away and begins \n\twalking quickly, blindly, up past a grove of trees. She comes \n\tto a CEMETERY enclosed by a black railing. At the crest of \n\tthe hill there's a stone monument \"The Little Bighorn \n\tCemetery.\"\n\n\tIn the growing darkness, she sees, scattered on the hillsides \n\tbelow her, white tombstones. A place of sorrow. A cool breeze \n\truffles her coat and she sticks her hands in her pockets. \n\tFrustrated, alone, at a complete loss as to what to do, what \n\taction to take -- Annie, for the first time in frozen, \n\tstanding still -- and with her, comes a rush of emotion.\n\n\tShe sits with her back against the monument and begins to \n\tweep. For Grace, for Robert, herself, for the tombstones, for \n\teveryone.\n\n\tA FLASHLIGHT shines on her face. It is a PARK RANGER.\n\n<b>\t\t\t\t  PARK RANGER\n</b>\t\tYou okay, ma'am?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(wipes face)\n\t\tYes. Fine.\n\n<b>\t\t\t\t  PARK RANGER\n</b>\t\tThat young lady is getting a little \n\t\tworried.\n\n\tAnnie realizes she left Grace alone as it got darker.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI'm sorry. I'm sorry...\n\n\tAnnie rises and is escorted back to the Suburban by the \n\tRanger. She sees:\n\n\tGrace is sitting in the front seat now, waiting for her -- \n\tlike a little girl lost.\n\n<b>\tINT. SUBURBAN - CONTINUOUS\n</b>\n\tAnnie gets into the driver's seat. Buckles up. Grace holds \n\tback tears.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou buckled up?\n\t\t\t(Grace nods)\n\t\tYou cold?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tLittle.\n\n\tAnnie reaches into the back seat and pulls a blanket out, \n\thanding it to Grace, making sure it covers her. Grace turns \n\ttowards the window and closes her eyes. Annie starts the car.\n\n<b>\tEXT. MONTANA, BACK ROAD - MORNING\n</b>\n\tC.U. on Pilgrim's head in the trailer as we PULL BACK to \n\treveal the Suburban coming down an empty, seemingly infinite \n\tstretch of two-lane road in Montana.\n\n<b>\tINT. SUBURBAN - MORNING\n</b>\n\tAnnie and Grace, both in front seats, eating doughnuts and \n\tcoffee. They stop.\n\n\tPOV -- Through the windshield is an endless sky and a rolling \n\tsea of land.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tGee, this looks like a fun place.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDon't they believe in signs here?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat would they say? \"Ten miles to big \n\t\trock.\" \"Twenty miles to bigger rock.\"\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThere was supposed to be a turn off. \n\t\tDid I miss it?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI didn't see it.\n\n\tTheir Suburban is the only vehicle on what seems like miles \n\tof road. Annie sighs and puts the Suburban in drive.\n\n<b>\tEXT. PETERSON'S MOTEL &amp; STABLES, RED FORK MONTANA - DAY\n</b>\n\tThe Suburban and the horse trailer, pulls into Peterson's -- a \n\tcollection of motel cottage adjacent to an expanse of land \n\tthat includes stable, corral, a main house and various riding \n\ttrails into the mountains.\n\n\tMr. Peterson runs out from the main house to greet Annie as \n\tshe gets out of the car.\n\n<b>\tINT. SUBURBAN, ON ANOTHER MONTANA BACK ROAD - LATER THAT DAY\n</b>\n\tAnnie, showered and changed, is trying to follow Mr. \n\tPeterson's directions to Tom's ranch -- written on Peterson \n\tmotel stationary. She is lost once again.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(reading)\n\t\t... after left, stay on main road until \n\t\trise, then...\n\t\t\t(frustrated)\n\t\tWhat bloody rise?!? What main road!?\n\n\tShe stops the Suburban (no longer carrying the trailer).\n\n<b>\tEXT. ANOTHER MONTANA BACK ROAD - CONTINUOUS\n</b>\n\tFrom outside the Suburban, we see, but cannot hear, Annie \n\thitting the steering and cursing in frustration.\n\n<b>\tINT. SUBURBAN - CONTINUOUS\n</b>\n\tAnnie, panting, looks ahead and sees nothing but empty space, \n\tabove and below -- as if the earth and sky met with nothing in \n\tbetween.\n\n\tShe sighs and starts the car again. As she moves forward, she \n\tsenses an almost indistinguishable rise in the road -- as we \n\tfollow her POV up the road through the windshield to reveal:\n\n\tPOV -- A BREATHTAKING VALLEY just beyond the rise, hidden \n\tfrom view only a few yards before. THE DOUBLE DIVIDE RANCH \n\tsits nestled in the valley, a few miles away. Annie is \n\timpressed.\n\n<b>\tEXT. THE DOUBLE DIVIDE RANGE - DAY\n</b>\n\tMen are working in the corral, saddle horses standing nearby, \n\ttrying to get a sick calf to suckle a cow. One of the men is \n\tTom Booker, working along side his brother FRANK, and his \n\tnephew, JOE. Frank is a good man -- solid work ethic, \n\tChristian fearing, wry sense of humor. With the build of a \n\tfootball player, his strength never overwhelms his boyish, \n\tgood-natured heart. Joe is eleven, wearing his cowboy hat \n\tlike a badge of honor. The three men seem as inseparable to \n\teach other, as they are to the land. As they work:\n\n<b>\t\t\t\t  JOE\n</b>\t\tCan we take a look at Bronty's foal \n\t\twhen we're done here, Dad?\n\n<b>\t\t\t\t  FRANK\n</b>\t\tSure. As long as she don't mind.\n\n<b>\t\t\t\t  JOE\n</b>\t\tThere's a kid at school says we \n\t\tshould've imprint-trained him.\n\n\tTom and Frank don't say anything. Just nod, knowingly.\n\n<b>\t\t\t\t  JOE\n</b>\t\tHe says if you do it soon as they're \n\t\tborn, it makes them real easy to handle \n\t\tlater on.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tThat's what some folks say.\n\n<b>\t\t\t\t  JOE\n</b>\t\tThere was this thing on the TV about a \n\t\tguy who does it with geese. He has this \n\t\tairplane and these baby geese all grow \n\t\tup thinking it's their mom, and he flies \n\t\tit and they just follow.\n\t\t\t(to Tom)\n\t\tYou hear 'bout that, Uncle T?\n\n<b>\t\t\t\t  TOM\n</b>\t\tYeah, I hear about that.\n\n<b>\t\t\t\t  JOE\n</b>\t\tWell, what do you think about that \n\t\tstuff?\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, Joe, I'll tell ya -- I don't know \n\t\ta whole lot about geese. Maybe it's okay \n\t\tfor them to grow up thinking they're \n\t\tairplanes. But horses, as far as I can \n\t\ttell, can't fly.\n\n\tFrank laughs. Joe smirks as Tom messes his hat up. There's the \n\tsound of a car. They turn.\n\n\tThe Suburban is coming over the ridge, heading down the \n\tdriveway in a cloud of dust.\n\n<b>\t\t\t\t  JOE\n</b>\t\tWe expecting company?\n\n\tFrank shakes his head. As the Suburban slows down, Tom \n\trecognizes the driver.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI don't believe it.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tYou know her?\n\n\tAnnie, out of her element, hiding behind sunglasses, gets out \n\tas Tom approaches her by himself. Annie girds herself for the \n\tconfrontation.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHello, Mr. Booker. Annie MacLean. From \n\t\tNew York. We talked on the phone.\n\n\tShe extends her hand. TOM shakes it, nodding, staring at her \n\tcuriously.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's, uh... beautiful country. I had a \n\t\tlittle bit of a hard time finding the \n\t\tplace. There are no signs.\n\n<b>\t\t\t\t  TOM\n</b>\t\tPlenty of signs -- just none of them \n\t\tprinted. Who do I get the idea you're \n\t\tnot just passing through!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell... OK... here it is... Uh... I'd \n\t\tlike you to take a look at my horse. \n\t\tNow -- it won't take long and if, after \n\t\tthat, you still don't feel...\n\n<b>\t\t\t\t  TOM\n</b>\t\tWere you thinking of personally driving \n\t\tme back East?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh no. She's here. I brought him along. \n\t\tAnd my daughter, too. We're staying at \n\t\tPeterson's...\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou mean you hauled him all the way out \n\t\there? Just like that?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(slightly taken aback)\n\t\tWell... yes... I had a trailer. It's not \n\t\tlike I made him run along side of the car.\n\n<b>\t\t\t\t  TOM\n</b>\t\tAll by yourself?\n\n\tShe nods. Tom cannot help be impressed by her guts and fortitude.\n\n\tCamera cuts away for a moment to a window in the ranch house, \n\tthrough which DIANE -- Frank's fiery, loyal pioneer wife -- \n\tlooks at the duo with suspicion.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI uh... ha, ha... I don't think I ever \n\t\tmet a lady quite like yourself and I \n\t\tappreciate all the pains you've gone \n\t\tthrough to --\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLook! Please! Don't do the \"shucks, \n\t\tma'am\" thing again!\n\t\t\t(Tom, surprised, listens)\n\t\tI've driven a few thousand miles for a \n\t\tfew minutes of your time. I've brought \n\t\thim here -- to your neck of the...\n\t\t\t(seeing no woods)\n\t\t-- mountains. Just take a look at him. \n\t\tIf you still feel the same way, I'll \n\t\tbe on the road by morning and you'll \n\t\tnever see me again. OK? Deal?\n\n\tTom tries to hide a smile of respect. Annie, thinking she may \n\thave him, starts backing away towards her car -- as one would \n\ta dangerous animal they think they might have tamed...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWe're at Peterson's. Whenever you're \n\t\tfree. You don't even have to call.\n\n\tShe gets into the Suburban. Tom watches her drive off.\n\n<b>\tEXT. ANNIE AND GRACE'S COTTAGE - DAY\n</b>\n\tTom walks up some wooden steps to a door and knocks. He hears \n\ta TV on inside. And Grace's Voice:\n\n<b>\t\t\t\t  GRACE (O.S.)\n</b>\t\tMOM! The door!\n\n\tHe hears Annie's muffled reply from O.S. He hears some banging \n\tas Grace fumbles for her crutch and comes to the door. She \n\topens it only so far as to reveal her upper body:\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYeah?\n\n<b>\t\t\t\t  TOM\n</b>\t\tUh, I'm Tom Booker. Your mother \n\t\taround?\n\n\tGrace hops to the side as Tom walks by her, into the room. \n\tGrace is closing the door as he turns to see, for the first \n\ttime, that Grace is one leg.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tShe'll be right out. She's on the \n\t\tphone.\n\n\tGrace hops back to the bed in front of the TV. Tom nods and \n\tputs his hat down -- noticing the prosthetic leaning against \n\tthe window, near her bed. He hears Annie on the phone and \n\tlooks to the other room, the door ajar -- seeing only her \n\tlegs, seated on the edge of her bed, as she talks. Her foot \n\ttaps impatiently.\n\n<b>\t\t\t\t  TOM\n</b>\t\tFirst time in Montana?\n\n\tGrace, rudely nods, still looking at the TV.\n\n\tBeat. Tom doesn't like her manner, but can easily see through \n\tit. He sits.\n\n<b>\t\t\t\t  TOM\n</b>\t\tShe gonna be long?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tProbably. She's on the phone twenty-\n\t\tthree hours a day.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWhat does she do?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tShe's an editor.\n\n<b>\t\t\t\t  TOM\n</b>\t\tMmm. An editor.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tNot like books or literature or anything. \n\t\tJust a magazine... Just in case she \n\t\thasn't told you -- which I'm sure she \n\t\thasn't -- I don't want to be a part of \n\t\tthis, OK?\n\n\tTom just sort of nods. A beat or two later, Annie enters.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSorry about that. Hi. Grace, this is \n\t\tMr. Booker... Have you looked at \n\t\tPilgrim?\n\n\tTom sees Grace turn away, just as Annie enters. He takes a \n\tmoment. He could say no right there, but something stops him.\n\n<b>\t\t\t\t  TOM\n</b>\t\tUh, no. I was gonna take a look now.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou want us to come with you? I just \n\t\thave to run to the main house and give \n\t\tMr. Peterson a check.\n\n<b>\t\t\t\t  TOM\n</b>\t\tDoesn't matter.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace?... Grace, you want to come with \n\t\tus, take a look at Pilgrim?\n\n\tGrace keeps looking at the TV. No reply. Tom is half way out \n\tthe door when he says to Annie -- making sure Grace can hear --\n\n<b>\t\t\t\t  TOM\n</b>\t\tProbably best she stays behind, anyway.\n\n\tHe disappears. Annie gives Grace a final look and exits, closing the door.\n\n\tAlone, Grace flings her body across the bed, reaching for her \n\tprosthetic -- putting it on feverishly. She is completely \n\tintrigued by Tom.\n\n<b>\tEXT. PETERSON'S STABLES - DAY\n</b>\n\tTom stands alone at the stable. Opening the bottom door, \n\tducking under the stall, he goes inside.\n\n<b>\t\t\t\t  TOM\n</b>\t\tOkay now... Okay now...\n\n\tWalking towards him, Tom raises his hand, showing Pilgrim a \n\tsign of respect, of trust... He quietly makes his way along \n\tPilgrim's side, along his flank, prompting Pilgrim to move \n\tout from the shadows, into the light. Tom moves to look at \n\thim. And Pilgrim suddenly kicks out at him. Tom, not cowed, \n\tstands his ground. He bends, looking at Pilgrim's withered \n\tlegs. He looks up at his scarred head. He looks into the \n\tpools of the horse's tortured eyes. Pilgrim stands still -- \n\tallowing Tom this brief intimacy.\n\n\tAs Grace walks towards the stable, she realizes that the door \n\tis open and Tom must be inside. She is amazed.\n\n\tAnnie, appearing behind her, is also impressed.\n\n\tTom exits the stable and sees them, as he closes the doors.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell... You're closest anyone's \n\t\tgotten.\n\n\tHe walks straight towards them -- veering more to Grace. He \n\tstops in front of her and they look into each other's eyes -- \n\tin a way that reminds us of how Tom looked at Pilgrim.\n\n\tExcept, Grace is made even more uncomfortable by the intimacy. \n\tShe turns away and walks to the corral, to lean on a post -- \n\tas if she doesn't care. Tom turns to Annie.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI have to be honest. I still feel \n\t\tyou made a long trip for nothing.\n\n\tHe looks at Annie. Annie has no more words -- just an ever-\n\tpresent pleading in her face.\n\n\tTom watches as Grace makes a small, naked movement -- putting \n\ther hand on her cheek, like a hurt child.\n\n\tHe can't help but see these three being connected by one wound.\n\n<b>\t\t\t\t  TOM\n</b>\t\tBut before I even think about it, I \n\t\tneed to know something here and now. \n\t\tIt's a question for Grace here.\n\n\tGrace stiffens.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWhen I work with a horse, it's no good \n\t\tjust me doing it. It doesn't work that \n\t\tway. The owner needs to be involved too.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, that'll be a little complicated --\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou can make it as complicated or as \n\t\teasy as you like. But she's the one \n\t\twho's gonna be riding him, am I right? \n\t\tSo here's the deal. I'm not sure I can \n\t\tdo anything, but I'm prepared to give \n\t\tit a go --\n\t\t\t(to Grace)\n\t\t-- if you'll help.\n\t\t\t(Grace gives a bitter laugh)\n\t\tYou have a problem with that?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tIsn't it like, obvious?\n\n<b>\t\t\t\t  TOM\n</b>\t\tNot to me. Either you want to or you \n\t\tdon't.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLook, I'll talk to Grace and call you \n\t\tlater--\n\n<b>\t\t\t\t  TOM\n</b>\t\tExcuse me, with all due respect, but \n\t\tthis is her decision, not yours. And I \n\t\tdon't want to waste anybody's time -- \n\t\tmostly mine.\n\n\tGrace reacts anew to Tom's remark. She likes her mother being \n\tdis-empowered. Annie keenly understands the importance of Tom \n\tputting it this way to Grace. Grace has all eyes on her -- \n\tjust what she wants. All waiting for her response. She turns \n\taway, flicks her head and says:\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWell, there's nothing else to do around \n\t\there.\n\n\tAnnie smiles in relief. But Tom isn't satisfied.\n\n<b>\t\t\t\t  TOM\n</b>\t\tNot good enough. I can't help you.\n\n\tHe starts walking away. Annie doesn't know what to do. Grace \n\tmumbles.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat do I have to do?\n\n\tTom keeps walking out... Grace says it louder.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI said, what do I have to do?!\n\n\tTom stops and looks at her. Annie holds her breath.\n\n<b>\tINT. THE RANCH HOUSE, DOUBLE DIVIDE - NIGHT\n</b>\n\tFrank, Tom, Joe and TOM TWIN BOYS, 6 years old, sit at a dining \n\ttable eating dinner, as Diane serves. We parachute into the \n\tmiddle of the conversation:\n\n<b>\t\t\t\t  DIANE\n</b>\t\t... well, I just think she's got a lot \n\t\tof nerve showing up here. Draggin' that \n\t\tchild and that poor animal all the way...\n<b>\t\t\t(TO ONE OF THE TWINS)\n</b>\t\tYou eat with those fingers again and you \n\t\tknow what'll happen!\n\t\t\t(the boy cowers)\n\t\tFrank, don't you think she's got a nerve?\n\n<b>\t\t\t\t  FRANK\n</b>\t\tOh hell, I don't know... According to Tom, \n\t\tshe's a pretty determined woman. Must've \n\t\tthought it was worth it.\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(sits down)\n\t\tI guess they'll want feeding and all, out \n\t\there all day long.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI don't believe they'll expect that.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tWhat, they ain't going forty miles into \n\t\tChoteau everytime they want a hamburger.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tMixed salad.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tWhat?\n\n<b>\t\t\t\t  FRANK\n</b>\t\t\t(slyly)\n\t\tI believe women from New York eat mixed \n\t\tsalads. Ain't that right, Tom?\n\n\tTom hides a grin -- he knows Frank into teasing her now.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI believe so. Saw it on a television \n\t\tshow, once.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tWell, that's just what we need on a cattle \n\t\tranch -- a vegetarian from New York.\n\n\tEveryone eats. Beat.\n\n<b>\t\t\t\t  JOE\n</b>\t\tWhen you figure on branding?\n\n<b>\t\t\t\t  FRANK\n</b>\t\tWeekend after next...\n\n<b>\t\t\t\t  TOM\n</b>\t\tIf the weather holds.\n\n\tFrank nods. Silence again. Everyone eats. Beat.\n\n<b>\t\t\t\t  JOE\n</b>\t\tWhat's an editor do anyway?\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(playing)\n\t\tWe're not sure, sweetheart, but they \n\t\teat like rabbits.\n\n\tTom and Frank chuckle. Diane smiles -- in on the joke with \n\tthem. The children are curiously confused.\n\n<b>\tINT. ANNIE AND GRACE'S MOTEL ROOM - NIGHT\n</b>\n\tCamera moves to reveal Annie on the phone in front of her \n\tcomputer and fax...  plugging in extension cords as she talks:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t... the phone company's putting in extra \n\t\tlines. I'll call back with the numbers. \n\t\tOh, and I want you to get in touch with \n\t\tthis lady in town here -- they say she's \n\t\tsort of a physical therapist for the \n\t\trodeo boys but keep the one at the \n\t\thospital we already contacted on call...\n\n\tGrace sits alone in the living room. Watching TV, but anxious \n\tand disturbed about what she's committed herself to.\n\n<b>\tINT. DOUBLE DIVIDE KITCHEN - CONTINUOUS - NIGHT\n</b>\n\tDiane is in her bathrobe doing bills at the kitchen table, as \n\tshe listens to a BOOK OF TAPE. Her hand on her forehead, her \n\tother hand writing. Tom enters to take his hat off the \n\tsideboard. He moves to the table and reaches over for a \n\tcookie from a plate of cookies. Without looking up, Diane \n\tslaps his hand. Tom then pours himself a cup of coffee... then \n\tswiftly sneaks his hand back and grabs a cookie. Diane smiles. \n\tTom exits.\n\n\tIt is only then that Diane looks up after him.\n\n<b>\tINT. UPPER FLOOR OF RANCH HOUSE - NIGHT\n</b>\n\tCamera follows Tom towards his bedroom --  passing the others. \n\tPerhaps we see Frank sprawled out asleep already in his \n\tunderwear. We might see the Twins in their bunks. One of the \n\tTwins' lower torso is laying outside of the blanket. He \n\tcasually flips the blanket over the kid's bare feet and \n\tcontinues to his room.\n\n<b>\tINT. TOM'S BEDROOM - NIGHT\n</b>\n\tTom enters and closes the door. Turns on a stereo which plays \n\ta cello piece by Yo-Yo Ma. Books fills his room. He sits at \n\this desk, puts on eye glasses and looks through some paperwork. \n\tSuddenly he stops, looking over the paperwork, into space. A \n\tthought passes by. We don't know what.\n\n<b>\t\t\t\t\t\t\tFADE OUT:\n</b>\n<b>\tEXT. THE RANCH, A CORRAL - DAYBREAK\n</b>\n\tFirst light of day. Pilgrim stands stock still in the middle \n\tof the corral. Tom, motionless, is crouched on his haunches \n\tin the corral -- watching him.\n\n\tTOM'S POV: As Pilgrim moves, he can see that the horse is \n\tstove up.\n\n\tHe softly tosses a handful of dirt at Pilgrim's withered \n\tlegs... Pilgrim, sensitive to the slightest provocation, \n\tbucks, wheeling away from him. Then stops. Tom sits on his \n\thaunches again... and watches him.\n\n\tFrank appears, exiting from the barn (perhaps).\n\n<b>\t\t\t\t  FRANK\n</b>\t\tTom?\n\n<b>\t\t\t\t  TOM\n</b>\t\tYeah.\n\n\tTom leaves Pilgrim, hooking up with Frank -- the two brothers \n\tgo off, discussing the ranch work that is ahead of them.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. THE RANCH - ANOTHER DAY\n</b>\n\tAnnie and Grace arrive in the Suburban. They exit. As they \n\thead towards the ranch, they see in the distance:\n\n\tPilgrim standing along the fence of a round pen. Tom stands \n\tin the pen, holding a rope, looking at Pilgrim.\n\n<b>\tEXT. THE ROUND PEN - DAY\n</b>\n\tTom stands in the pen with Pilgrim. He looks to see Annie and \n\tGrace approaching but makes no acknowledgement. He turns his \n\tfocus back to Pilgrim.\n\n\tAnnie and Grace appear. Grace takes a position (that is to \n\tbecome her regular spot) a distance away from the pen. Annie \n\tmoves in closer, beside SMOKEY (a ranch hand) with one leg \n\tup on the pen fence.\n\n<b>\t\t\t\t  SMOKEY\n</b>\t\tHowdy...\n\t\t\t(sees Grace)\n\t\tHowdy.\n\n\tHe and Annie watch as Tom stands before Pilgrim -- turning \n\tsideways... then standing...\n\n<b>\t\t\t\t   ANNIE\n</b>\t\tWhat's he doing?\n\n<b>\t\t\t\t   SMOKEY\n</b>\t\tTrying to get his eye.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHow's it going?\n\n\tSmokey doesn't respond -- how it's going is exactly how it \n\tlooks. Tom takes a few steps, stops and stands still again. We \n\tsense the process is long and requires great patience.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. ROUND PEN - DAY\n</b>\n\tTwo hours later. Grace is in the same spot. Smokey is gone, \n\tdoing his work. Annie has taken a different position, looking \n\tover SEVERAL PAGES OF FAXES on her lap.\n\n\tTom is still standing in the pen trying to get Pilgrim's eyes.\n\n\tJoe has joined the proceedings, sitting on the pen rail.\n\n\tTom deftly throws a hoolihan, gently lassoing Pilgrim around \n\tthe neck. And Pilgrim, at the touch of the rope, crazed, \n\tresists, pulling back, striking at the rope... The rope \n\tcutting into Tom's hands. Tom gives him some slack, giving \n\this head, letting him relax... then gently heads him by the \n\trope, walking him around the pen, getting his feet to moving.\n\n\tGrace's eyes never leave Tom.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. DOUBLE DIVIDE - DAY\n</b>\n\tTom, off in the distance -- against a sky that seems to be \n\ttouching the land -- is riding along a creek. Closer up, we \n\tsee he's rustling the bushes with a stick. Some stray cows \n\trun out of the bushes. Tom races after them. His horse \n\tshepherds the cow across the creek and up a hillside.\n\n\tAt the top of the hill, with the ranch spread out endlessly \n\tbefore him, Tom sees Frank on his horse, chasing strays. Tom \n\twhistles. Frank waves back. In the near distance, a pickup \n\ttruck is parked on the range.\n\n\tJoe and the TWINS are throwing food pellets out of the back \n\tof the truck. Cattle come from across the range for the food. \n\tWhat begins as a handful of cows becomes dozens, then \n\thundreds -- the truck virtually disappearing among them.\n\n\tTom stops for a moment to look out at his ranch. Far off in \n\tthe distance, he sees Annie's Suburban coming along the road \n\tto the ranch. He watches as Annie's distant figure gets out \n\tof the car with Grace. Annie instinctively turns and looks \n\tacross the land. Even though there is such a distance, \n\tthere's a sense Tom and Annie are looking at each other.\n\n\tTom senses Joe driving Frank's truck, slowly moving off the \n\trange -- the Twins in the back, the cattle following. Tom sits \n\ton his horse atop the hill.\n\n<b>\tEXT. THE DOUBLE DIVIDE - ANOTHER DAY\n</b>\n\tPilgrim, his scarred head above water, legs moving in odd \n\tsycopation, swimming. We discover he is in a pond, tethered \n\tto a pole... Except for the sound of his legs in the water, \n\teverything is quiet and focused on Pilgrim.\n\n\tSMOKEY, holds the pole, walking on the outside of the pond, \n\tleading Pilgrim back and forth as he swims. Tom, crouched by \n\tthe pond, silently concentrating on Pilgrim...\n\n\tGrace watches, off by herself... Annie stands beside Joe. She \n\tcan't help but be intrigued by the sight. She asks Joe;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI though horses were afraid of \n\t\twater?\n\n\tJoe doesn't answer her. Grace likes that. Annie, frustrated, \n\tfeels she has the right to simple shout out to Tom.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIs that to get his strength back?\n\n\tTom pays her no mind -- concentrating on Pilgrim.\n\n\tSuddenly, Annie's CELL PHONE rings, jarring the proceedings. \n\tTom turns to Annie. She hides her embarrassment by answering \n\tit, walking away. Tom gives her a look. Grace is loving this. \n\tTom turns back to Pilgrim. After a few moments --\n\n\tTom, taking the rope tether, unhooks it from the pole. He \n\tstarts to lead Pilgrim out of the water. Pilgrim, fearful, \n\tfights him. He rears, splashing Tom, not wanting to come out \n\tof the water. Grace is worried. She looks to Joe and sees he \n\tis concerned too, though he stands quietly.\n\n\tAnnie hears the commotion from where she stands and finishes \n\ther call to return to the pond.\n\n\tTom enters the pond, waist deep in water, trying to grab \n\tPilgrim's rope. Pilgrim rises up, rearing at him. Joe and \n\tSmokey, sensing danger, come closer to the pond. Annie \n\tappears beside Grace and watches as Tom reaches for the rope \n\tagain. Pilgrim rears again. Tom stumbles backwards from his \n\thooves. Annie gasps. Grace turns to walk away from the pond. \n\tShe can't watch -- it brings back too much. But as she does, \n\tshe is stopped by the sight of --\n\n\tTom, righting himself, unphased, calmly walks back to Pilgrim. \n\tThe horse, baffled by this man's lack of fear, lets him take \n\tthe rope and walk him out of the pond.\n\n\tGrace can't help but be impressed. Joe nods. Annie is shaken.\n\n<b>\t\t\t\tANNIE\n</b>\t\tMr. Booker, I'm not at all comfortable \n\t\twith you taking those kinds of chances...\n\n\tAs Tom leads Pilgrim out, the horse suddenly whirls, bolting, \n\tknocking Tom down...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, God!\n\n\tPilgrim runs off, pulling the wet rope behind him. Joe runs \n\tover and grabs for the rope.\n\n<b>\t\t\t\t  TOM\n</b><b>\t\tNO... LET HIM GO!\n</b>\n\tJoe obeys. Pilgrim runs past the corral and down into a hill \n\tout onto a pasture, He keeps on running into the distance --\n\trunning across the pasture, not knowing where he is going...\n\n\tTom, arms folded across his chest, watches him run. A \n\tconcerned Annie approaches.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tShe's running away! How are you going \n\t\tto get him back?\n\n\tTom doesn't respond. He walks off down the hill out onto the \n\tpasture, stops, arms folded and watches Pilgrim. Annie turns \n\twhen she hears Smokey, who appears behind her:\n\n<b>\t\t\t\t  SMOKEY\n</b>\t\tHe don't really want to run. Don't \n\t\tknow where he's going. All this open \n\t\tspace scares the daylight out of him.\n\n\tConfused, Pilgrim stops running and walks, in no particular \n\tdirection.\n\n<b>\t\t\t\t  SMOKEY\n</b>\t\tMy guess is he's spent his life in a \n\t\tsix-by-eight stall... He's forgot what \n\t\tit's like to be a horse...\n\n\tSmokey ambles off and she turns back to see Tom crouching on \n\this haunches, sitting in the grass, just waiting. Pilgrim \n\twalks back towards the ranch, stops a distance from Tom, \n\tlooks at him... Annie, needing to know exactly what's going \n\ton, crosses down the hill to him.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSo what now? Should we leave?\n\n\tTom continues watching Pilgrim. Annie looks at him, sitting \n\tthere motionless and feels like an idiot. Clearly she doesn't \n\tunderstand all this and clearly no one thinks this is the \n\ttime to explain to her.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, we're going to go then...\n\n\tWithout looking at her, Tom just nods. Annie, awkwardly, \n\twalks back up the hill to where Grace is...\n\n\tON THE GRASSY HILLSIDE, Grace is watching the scene by herself \n\tas Joe appears, staring at her leg... It makes her uncomfortable. \n\tShe turns to him with a curt, impatient tone;\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat?\n\n\tTheir eyes meet. Joe is so guileless, Grace is taken off guard \n\twhen he asks in such a compassionate voice;\n\n<b>\t\t\t\t  JOE\n</b>\t\tDoes that hurt you?\n\n\tGrace tries to think of an answer -- and of how to say it:\n\n<b>\t\t\t\t  GRACE\n</b>\t\tOnly when I kick somebody.\n\n\tHer gentle delivery makes him smile. She smiles, then:\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDon't you go to school?\n\n<b>\t\t\t\t  JOE\n</b>\t\tTwice a month they give you a day off \n\t\tto work on the ranch.\n\n\tHe tips his hat down as he looks out to Pilgrim with respect;\n\n<b>\t\t\t\t  JOE\n</b>\t\tLook at him out in the pasture -- Yeah, \n\t\the must've been a big, beautiful looking \n\t\thorse. How was he to ride?\n\n\tGrace is uncomfortable again. She looks away, just struggling. \n\tJoe senses she's done talking;\n\n<b>\t\t\t\t  JOE\n</b>\t\tExcuse me. I got chores to look after.\n\n\tHe tips his hat and walks off, passing Annie as she arrives.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou ready to go?\n\n\tGrace hesitates. Then mother and daughter take one more look --\n\n\tPOV -- Pilgrim standing in the pasture with Tom crouching in \n\tthe grass waiting for him.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. PASTURE - LATER THAT DAY\n</b>\n\tTom is still sitting in the grass, just where we left him -- \n\twaiting patiently. Pilgrim is still out in the pasture.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. PASTURE - STILL LATER THAT DAY\n</b>\n\tAfternoon shadows cross the ranch. Tom is in the exact same \n\tspot and position. Pilgrim is somewhat closer -- but still at \n\ta distance -- watching him.\n\n\tFrank rides back from work. As he passes Tom, the two nod as \n\tif nothing usually is going on. Frank rides up to the barn.\n\n<b>\tINT. PETERSON'S MOTEL -\n</b>\n\tGrace is flicking the television -- repeating the only three \n\tchannels over and over...\n\n\tAnnie works at her computer, surrounded by work. She notices \n\tthe time, gets a thought and dials the phone...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHello, Mr. Booker... Oh, hello, Frank. \n\t\tThis is Annie MacLean... I was \n\t\twondering, has-...\n\t\t\t(listens)\n\t\tUh-huh... And Pilgrim?...\n\t\t\t(listens)\n\t\tStill?... Uh-huh...\n\t\t\t(politely cheery)\n\t\tOkay then. Thank you.\n\n\tShe hangs up, pauses, then speaks to the window out loud enough \n\tfor Grace to hear --\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHe's still sitting in that damn \n\t\tfield.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(w/o looking at her)\n\t\tI think they call it a pasture.\n\n\tAnnie looks at her as if to say the last thing I need to know is \n\ta lesson on the local lingo...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLet's go see what's going on, then \n\t\tget something to eat.\n\n<b>\tEXT. DOUBLE DIVIDE RANCH - DUSK\n</b>\n\tThe sky is changing colors, the temperature has dropped. Tom \n\tis still sitting in the grass, although someone has brought \n\thim a blanket for his shoulders. Pilgrim is in the pasture, \n\tbut now -- he too is motionless, looking back at Tom.\n\n\tThe sound of a car makes Tom turn to see Annie driving up. \n\tShe gets out, stands by the car with a proprietary air, \n\twatching Tom and Pilgrim. Grace remains in the car. There's a \n\tsound. She turns to see Diane coming out of the house...\n\n<b>\t\t\t\t  DIANE\n</b>\t\tThere's coffee inside... I was just \n\t\tbringing this to Tom.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWould you mind if I did? I'd like to \n\t\ttalk to him.\n\n\tDiane, knowing full well Tom ain't in a talking mood, hands \n\ther a cup...\n\n<b>\t\t\t\t  DIANE\n</b>\t\tSure.\n\t\t\t(seeing Grace in car)\n\t\tDoes your daughter want to come \n\t\tinside?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tUh, no, we're going to dinner... Is \n\t\tthis the way to the pasture?\n\n<b>\t\t\t\t  DIANE\n</b>\t\tPasture? Oh, that stretch of field near \n\t\tthe hill? Yeah.\n\n\tShe's gone. Annie grimaces, then crosses the hillside to \n\twhere Tom is squatting down. She appears to his side and, \n\twithout speaking, tries to indicates she has his coffee by \n\tleaning it toward him. Tom sees her and accepts it with a \n\tgrateful nod. Annie waits. Nothing happens. Feeling foolish, \n\tshe begins to walk back.\n\n\tAt some point, she turns to see Pilgrim moving across the \n\tpasture toward Tom. He stops in front of him, just a few feet \n\taway. Tom says something to him. Annie is intrigued -- and she \n\tknows enough to stay quiet now. She watches Pilgrim walk over \n\tto him. She watches as Tom gets up and pats Pilgrim's scarred \n\thead. In spite of herself, Annie is somewhat moved by this act.\n\n\tOnly we see Grace, peering out from the car, seeing this act \n\tof communion as well. Only we see her reaction to it.\n\n\tAs Tom turns and walks back to the ranch, Pilgrim follows him. \n\tAs he passes Annie, all he says is...\n\n<b>\t\t\t\t  TOM\n</b>\t\tFrom now on, leave your phone \n\t\tsomewhere else...\n\n\tAs he moves past her, Annie responds;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tBut I have business calls I have \n\t\tto --\n\n\tTom keeps heading for the barn as he suggests, without turning \n\tback;\n\n<b>\t\t\t\t  TOM\n</b>\t\tThen drop off Grace in the morning, \n\t\tgo on back and do your business. \n\t\tCome pick her up around dinner.\n\n\tStanding there, Annie has the impulse to respond to this \n\tsuggestion, but has no idea what to say and saying it wouldn't \n\tmake much sense since Tom is already out of ear shot.\n\n\tDiane appears from the house and calls out:\n\n<b>\t\t\t\t  DIANE\n</b>\t\tMrs. MacLean -- why don't you and \n\t\tdaughter stay for dinner?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh uh, thank you. No, we don't want to \n\t\timpose.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tNo imposition. Plenty of food. Gonna \n\t\tget pretty dark soon. Hard to find a \n\t\tplace.\n\n\tAnnie looks up to the alien sky and realizes she's right. She \n\tlooks to Grace, who doesn't seem to oppose the idea.\n\n<b>\tINT. RANCH HOUSE/KITCHEN - NIGHT\n</b>\n\tEveryone sits around the kitchen table. Joe, still wearing \n\this hat, eyes Annie and Grace with acute curiosity.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tJoe, take off the hat -- I'm not \n\t\tgoing to say it again.\n\n\tJoe obeys. Diane puts the last of the serving plates on the \n\ttable -- pork chops, potatoes, gravy, peas, bread... And a big \n\tbowl of mixed salad. The boy can't help eyeing how the \n\t\"vegetarians\" will act.\n\n\tAnnie and Grace eye the food. Annie reaches out for a serving \n\tladle, picking up Grace's plate to serve her as Grace reaches \n\tfor a piece of bread, when:\n\n<b>\t\t\t\t  FRANK\n</b>\t\tDear Lord, we are humbly thankful \n\t\tfor...\n\n\tAnnie and Grace freeze as Frank continues his prayer -- they \n\tnotice everyone's head bowed slightly.\n\n<b>\t\t\t\t  FRANK\n</b>\t\t\t(continues)\n\t\tthese gifts. For the blessings on our \n\t\thome, our family and our guests. Bless \n\t\tthose that aren't as fortunate. Bless \n\t\tall God's creatures.\n\n<b>\t\t\t\t  EVERYONE\n</b>\t\tAmen.\n\n\tEveryone begins eating. Annie and Grace breath a sigh of relief. \n\tSilence. Utensils hitting plates, the only sound.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tBank out us a couple more men to run \n\t\tthe cattle.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWe should be fine, then.\n\n\tBeat. Annie and Grace listen...\n\n<b>\t\t\t\t  JOE\n</b>\t\tTeacher asked me why we raise Black \n\t\tAngus-Herefords 'stead of Pure Herefords.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tTell her they suit the weather better. \n\t\tTheir udders are black, 'stead of pink.\n\n<b>\t\t\t\t  TOM\n</b>\t\tThey don't get burned by the sun bouncing \n\t\toff the snow. And they're good mother.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tOur daddy raised Pure Herefords.\n\n\tSilence... Eating... Annie tries her hand at conversation:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou know, that's interesting. I always \n\t\twondered when I went into a restaurant \n\t\twhat was the difference between a regular \n\t\tsteak or a Black Angus steak. I couldn't \n\t\ttaste any difference although I could \n\t\tswear one was more tender. I didn't know \n\t\tthere was that big a difference between \n\t\tcows...\n\t\t\t(silence)\n\t\tI've never been on a cow farm before. I \n\t\tmust say, the bulls seem to have the \n\t\tbest time of it. Just laying around the \n\t\tfields all day until they're asked to...\n\t\t\t(uncomfortable)\n\t\tdo their... work.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tWell, get born a bull, got a ninety \n\t\tpercent chance of getting castrated and \n\t\tserved up as hamburger. On a balance I \n\t\treckon I'd choose being a cow.\n\t\t\t(to Grace)\n\t\tWould you mind passing that salad \n\t\tyoung lady?\n\n<b>\t\t\t\t  DIANE\n</b>\t\tHow's Peterson's holding up for you?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(lying)\n\t\tIt's fine. Comfortable. I still can't \n\t\tget used to how dark it gets around here, \n\t\tthough. When we leave the ranch, I \n\t\talways hold my breath until I can see \n\t\tthe motel.\n\n<b>\t\t\t\t  FRANK\n</b>\t\t\t(innocently)\n\t\tYou know, Tom, while you're working on \n\t\tthat horse of theirs, Annie and Grace \n\t\tshould move into the old Creek house.\n\n\tDiane and Tom react accordingly; Diane hiding her annoyance, \n\tTom hiding his surprise and pleasure.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tNobody's using it. Silly for her to be \n\t\tdriving back and forth when she don't \n\t\tknow her way around that well...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, I don't know...\n\n<b>\t\t\t\t  FRANK\n</b>\t\tWell, I know Peterson's. Old place is as \n\t\tgood as falling down around your ears.\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(overlapping)\n\t\tThey're already all settled in, Frank. \n\t\tAnyway, I'm sure Annie wants her privacy.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tIt's got doors, Diane. Private as can be. \n\t\tTom?\n\n<b>\t\t\t\t  TOM\n</b>\t\tI don't have a problem with that. It's up \n\t\tto Annie.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, it's worth it, really? I mean, how \n\t\tmuch longer do you think you need to work \n\t\twith Pilgrim?\n\n<b>\t\t\t\t  TOM\n</b>\t\tThat's up to Pilgrim.\n\n\tEveryone waits on Annie's answer as she considers this.\n\n<b>\tINT. MOTEL ROOM - NIGHT\n</b>\n\tGrace is on the phone with Robert. Annie is packing things \n\tup. Grace is telling him about the day;\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(listens)\n\t\tI know. Me, too. Why don't you come \n\t\tone weekend?\n\n\tAnnie reacts to this.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWe'll have more room because we're \n\t\tmoving onto the ranch. They have this \n\t\tempty house near this creek. It's \n\t\tactually pretty... OK... I love you.\n\t\t\t(to Annie)\n\t\tDad wants to talk to you.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(takes the phone)\n\t\tHi.\n\n<b>\tINTERCUT\n</b>\n<b>\tINT. CENTRAL PARK WEST APARTMENT - NIGHT\n</b>\n\tRobert is burning the midnight oil in the study with files \n\tall around him.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHey... She sounds like she's doing \n\t\tall right. How is she?\n\n\tGrace exits into the bathroom. Annie talks softly;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(cautious)\n\t\tYeah. She seems to be getting more \n\t\tcomfortable on the ranch, which is why \n\t\tI said yes to this move. But, whenever \n\t\tit's just the two of us, I don't know... \n\t\tAnyway... what's happening with the \n\t\tDelco lawsuit?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tTaking forever. I just got an additional \n\t\tlist of sixty-two employees to interview \n\t\tbefore Monday. I don't know how I'm going \n\t\tto do it.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, it's good that you're there.\n\n\tRobert didn't mean to validate his separation from them.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tSo, how are you doing in Marlboro \n\t\tcountry? Is the magazine complaining at \n\t\tall?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah, but nothing I can't handle. Lucy \n\t\ttells me she thinks Gottchalks's \n\t\tplotting, but what else is new.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWhen are you coming home?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou know, I just asked that myself \n\t\ttonight. He doesn't know.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWell then... maybe I will take some \n\t\ttime... come visit.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOkay.\n\n\tBeat. Annie knows Robert needed an invitation from her. But \n\tshe can't do it. Robert tries again.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI miss you, Annie.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI know. We miss you too.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tGood night.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNight.\n\n\tAwkwardly, they hang up. Grace exits the bathroom.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDid you ask him to come visit?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou already did.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDid he mention it?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t (resumes packing)\n\t\tYeah, he's going to think about it. \n\t\tYou want me to pack for you?\n\n\tGrace looks at her disapprovingly as she passes to go to the \n\tbathroom. Annie registers this.\n\n<b>\tINT. RANCH HOUSE - LATE DAY\n</b>\n\tDiane is washing windows while listening to an audio book on \n\ther tape player. Through the windows, she sees:\n\n\tJoe and the Twins helping Annie and Grace move into the Creek \n\tHouse.\n\n\tDiane has conflicting feelings about this. She continues her \n\twork.\n\n<b>\tINT. CREEK HOUSE - LATE DAY\n</b>\n\tVARIOUS SHOTS of ANNIE CONNECTING HERSELF BACK TO THE REST OF \n<b>\tTHE WORLD, BY PLUGGING IN HER COMPUTER, FAX, ETC...\n</b>\n\tGrace is in the other room, as she was in the motel. Alone. \n\tWith no television, she is just listening to her music laying \n\ton the couch. The two women remain separate no matter where \n\tthey are.\n\n\tBut we see a small difference. Grace rises and walks to the \n\twindow. She looks out;\n\n\tPOV: She sees people working about the ranch. Maybe Joe is \n\tamong them -- riding his horse as he works. Or maybe it's \n\tjust a vision of people with tasks to complete -- who do so \n\twith pride, discipline and clarity.\n\n\tGrace looks out the window longingly.\n\n<b>\tEXT. THE RANCH - ANOTHER DAY\n</b>\n\tA cloud of dust. A dozen or so horses are running in an arena \n\tby the stables. Tom is riding among them, holding a long stick \n\twith an orange flag at the end of it, waving it at the young \n\thorses, making them run away from him. The colts stay close \n\ttogether. One of the horses, PILGRIM, stays at a distance, off \n\tto himself.\n\n\tGrace watches from along the railing. She alternates her \n\tattention from the horses... to Tom.\n\n<b>\t\t\t\t  TOM\n</b>\t\t What we're doing here, Grace, is \n\t\t trying to get him to learn how to \n\t\t be a horse again.\n\n\tHe cracks the flag, the horses move together...\n\n<b>\t\t  \t \t  TOM\n</b>\t\tThe others already know, see. That's \n\t\thow they are in the wild -- herd \n\t\tanimals...\n\t\t\t(cracks the flag)\n\t\t...When they've got a problem, like \n\t\tthey have now with me and this flag, \n\t\tthey look to each other. But old \n\t\tPilgrim there has forgotten. I'm the \n\t\trock and they're the hard place. He \n\t\tthinks he hasn't got a friend in the \n\t\twhole wild world...\n\n\tC.U. on GRACE, who clearly feels the same way... but wants \n\tdesperately not to. She watches him ride off towards Pilgrim \n\twho has stopped like all the others at the far end of the \n\tring. He stands by himself, tossing his head, snorting, not \n\twanting to be around other horses. Tom cracks the flag, \n\tkeeping them moving. Pilgrim does his own private dance.\n\n\tTom rides by Grace and hands her the stick;\n\n<b>\t\t\t\t  TOM\n</b>\t\tHold this for a minute...\n\n\tGrace stiffens. She doesn't want to, but she's afraid to say \n\t\"No\" to Tom. He just insists by tossing it to her...\n\n<b>\t\t\t\t  TOM\n</b>\t\tHold onto it, go on...\n\n\tShe's forced to catch it. He turns and rides away, chasing \n\tdown Pilgrim, trying to edge him toward the herd. For a \n\tmoment, he has him breaking to the left with the horses. But \n\tas soon as he's clear of Tom, he separates himself and comes \n\tto stop on his own.\n\n\tTom rides back to Grace, taking back the flag.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWe'll get there, Grace.\n\n\tAs he says this, he flashes a small, reassuring smile and a \n\tlittle wink. Grace melts just a little. As he rides away.\n\n\tAnnie appears, having come from the Creek House. She calls:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace? The clinic just called... \n\t\tThey had to change your physical \n\t\ttherapy appointment. We have to \n\t\tleave now.\n\n\tGrace frowns a little -- her mother's \"perfect timing.\" Annie \n\tapproaches the arena, watching Tom riding. As he passes her;\n\n<b>\t\t\t\t  TOM\n</b>\t\tHello, Annie...\n\n\tAnnie notices how he says her name.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tMr. Booker...\n\n\tHe flashes a smile in her direction and Annie's expression \n\tcomically matches her daughter's reaction. She quickly covers \n\tit, however. Her eyes follow him as he glides around the \n\tarena. It's like watching a great ballet -- his control of the \n\thorses, his effortlessness, his grace, his strength... She \n\tsmiles to herself in appreciation. Then catches herself:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(to Grace)\n\t\tYou got everything you need?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tIf I had everything I need, I wouldn't \n\t\tbe going to physical therapy.\n\n\tTom approaches as he overhears Grace respond;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t  (trying to cheer her)\n\t\tHoney, come on. Would you like to stay \n\t\tin town for dinner? Maybe see what \n\t\tmovie's playing tonight?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhy? There's no food in the house?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo. I just thought... forget it.\n\n\tHe's getting a clearer view of their relationship.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou know, we're branding here \n\t\ttomorrow. If you two want to come \n\t\tby to watch or give a hand, you're \n\t\twelcome.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(laughs)\n\t\tBranding?\n\t\t\t(sarcastic)\n\t\tI haven't branded in years.\n\n\tTom chuckles.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI'll come.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tUh, I don't, honey. Branding? Oooh... \n\t\tI think we'd just be in Mr. Booker's \n\t\tway.\n\n<b>\t\t\t\t  TOM\n</b>\t\tAs long as you don't get in the way of \n\t\tthe branding iron, it doesn't matter too \n\t\tmuch.\n\n\tAnnie smiles. She turns to Grace, questioningly. Grace says \n\tmatter-of-factly, to prove her point.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI watched Margo Neuberger get a \n\t\ttattoo.\n\n\tTom squints. Annie shrugs and nods.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOkay.\n\n\tAs Grace and Annie walk to the car, Tom says:\n\n<b>\t\t\t\t  TOM\n</b>\t\tHey, Grace -- maybe we can get your \n\t\tmom to put me and you branding on the \n\t\tcover of her magazine. Start a whole \n\t\tnew fashion craze.\n\n\tThey continue walking as Grace smiles, enjoying being singled \n\tout for his joke. Annie responds, almost flirtatiously.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tTry not to fall off your high horse, \n\t\tMr. Booker.\n\n\tTom tips his hat and rides away... Annie smiles and nods... \n\tGrace doesn't like their sudden familiarity. Or her mother's \n\tcoy manner. As they enter the Suburban, Grace asks point blank;\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDid you call Dad today?\n\n\tAnnie is caught off guard.\n\n\tTom, riding in the arena, catches himself looking after them... \n\tthen goes riding after Pilgrim.\n\n<b>\tEXT. DOUBLE DIVIDE - DAY\n</b>\n\tThe air smells of scorched flesh. There is nothing but NOISE. \n\tCalves, separated from their mothers, \"cry.\" They are moved \n\tout through a series of connected pens into a narrow chute, \n\tand then one by one into a holding pen. They're clamped and \n\tlowered sideways onto a table and given a shot, a yellow \n\tinsect tag in one ear, branded, then sent back to their \n\tmother's. The bulls, in a pen by themselves, stand haughty, \n\tpaying no attention. Frank helps \"doctor\" the calves. Joe \n\tbrands.\n\n\tAnnie and Grace are standing by the railing, watching with a \n\tmixture of fascination and disgust.\n\n\tTom moves in the feeder pen, waist deep in calves, moving them \n\tthrough the chute. He looks to Annie.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHey, over there, you want to make \n\t\tyourself useful?\n\n\tIt isn't a question.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHank, I got you a volunteer!\n\n\tAnnie and Grace realize they have no choice.\n\n<b>\t-- WHAT FOLLOWS IS A SEQUENCE OF SCENES SHOWING ANNIE AND \n</b><b>\tGRACE PARTICIPATING IN THE BRANDING. AND HOW THEY GRADUALLY \n</b><b>\tCOME TO LOSE THEMSELVES IN THE EXPERIENCE.\n</b>\n<b>\tSEQUENCES WILL INCLUDE:\n</b>\n<b>\t-- HANK, A RANCH HEAD, HELPING ANNIE INTO THE CHUTE... ANNIE \n</b><b>\tGETTING KICKED BY A CALF.\n</b>\n<b>\t-- GRACE BEING SHOWN HOW TO HOLD THE BRANDING IRON.\n</b>\n<b>\t-- HANK TEACHING ANNIE HOW TO SAY \"HYAH!!\"...\n</b>\n<b>\t-- TOM IN THE HOLDING PEN WITH HIS ARMS AROUND GRACE, SHOWING \n</b><b>\tHER HOW TO APPLY THE BRAND... GRACE, A LITTLE FRIGHTENED OF THE \n</b><b>\tBRAND, IS IN HEAVEN IN TOM'S ARMS...\n</b>\n<b>\t-- ANNIE IS STILL TRYING TO SAY \"HYAH\"!! WITH THE PROPER FORCE. \n</b><b>\tSHE CLAPS HER HANDS, PUSHING THE CALVES ALONG, KNEE DEEP IN \n</b><b>\tCOW SHIT.\n</b>\n<b>\t-- GRACE CLOSES HER EYES AND THE IRON TOUCHES THE CALF'S HIDE.\n</b>\n<b>\t\t\t\t  TOM\n</b>\t\tThat's good... firm but gentle...\n\t\t\t(Grace opens her eyes)\n\t\tIt hurts but he'll get over it.\n\n\tGrace smiles proudly.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou handled that pretty well. Think \n\t\tit's time you earn your keep around \n\t\there. So, when we're not working \n\t\tand when you don't have your therapy, \n\t\tI'd like you to help out with the \n\t\thorses... Rubbing them, cleaning up \n\t\tthe stalls... You think you can \n\t\thandle that?\n\n\tGrace knows him well enough to know;\n\n<b>\t\t\t\t  GRACE\n</b>\t\tThat's not a question, is it?\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou're catching on.\n\n\tGrace smiles.\n\n\t-- Annie turns and, not looking where she's doing, trips over \n\ta calf, falling down. And calves, coming down the chute, \n\tstart to run towards her. Suddenly, Tom grabs her by the leg \n\tand pulls her to safety. He helps her up and dusts her off.\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(not wanting to smile, \n\t\t\t but...)\n\t\tYou okay?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt is cocktail hour yet?\n\n\tTom laughs. She takes a big breath.\n\n<b>\tEXT. THE RANCH - LATE AFTERNOON\n</b>\n\tThe ranch is colored in amber light.\n\n\tNear the house, two long tables pushed together to make one \n\tlong one... A gentle breeze ruffles the tablecloth. Everyone \n\tis seated for a meal. We hear laughter and conversation... We \n\tparachute into the middle of the moments;\n\n\t-- Hank helping with his wife get to their three children to \n\tsit still for dinner...\n\n\t-- Diane organizing the women and their various plates of side \n\tdishes...\n\n\t-- The Ranch Hand piling up their plates and kidding each \n\tother...\n\n\t-- Joe is instructing Grace on the various sauces for the \n\tribs. The Twins are making fun of him behind his back.\n\n\t-- Tom and Smokey are barbecuing, the last one to sit.\n\n\t-- Frank assists his frail mother, ELLEN BOOKER, at the table, \n\tfilling her plate with all the things she can't reach for.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n\tThe faces are beautiful. Laughing. Eating. Everyone is tanned \n\tand exhausted after a long day, but filled with life and \n\teager to live it. The tables are covered with heavy food. \n\tThe communion at this table is as much a part of the ritual \n\tas the branding itself...\n\n\tAnnie and Grace look different to us. Tanned from the sun, \n\ttheir bodies sore -- they feel softened, yet more vital. As if \n\tthe artifice had been worn off... the armor of urban life. As \n\tthe table thrives with conversations, we focus on:\n\n\tAnnie and Ellen Booker. Annie looks calmer than we've seen \n\ther -- and more naturally beautiful. She is seated beside \n\tEllen Booker. We sense they have been talking for a while. \n\tAnnie is so sincerely interested in listening to her, she's \n\thardly touched her own plate...\n\n<b>\t\t\t\t  ELLEN BOOKER\n</b>\t\t... he was a blacksmith by trade, my \n\t\tfather. My grandson Joe was named \n\t\tfor him. But he always dreamed of \n\t\thaving his own place and raising \n\t\thorses...\n\n\tWe see Tom a few places down and across from Annie and his \n\tmother -- but fully aware of their conversation.\n\n<b>\t\t\t\t  ELLEN BOOKER\n</b>\t\tHe'd heard of some land. What's \n\t\tStockett now. Rode out there. Got off \n\t\this horse and walked about as far as \n\t\the could in one way. Then he walked as \n\t\tfar as he could another way and \n\t\tanother until he got back to where he \n\t\tstarted and that's where he put his \n\t\troots down... That's where my husband \n\t\tand I ranched and raised Frank and \n\t\tTommy...\n\n\tShe motions proudly to Tom who looks up. Annie smiles to him. \n\tHe looks to her with gratitude for the respect she's showing \n\this mother.\n\n<b>\t\t\t\t  ELLEN BOOKER\n</b>\t\tQuite a different life from what you \n\t\tknow, I expect. Which place to you \n\t\tcall home?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, I was born in London, but my \n\t\tfather was an ambassador and we \n\t\tmoved constantly. I've lived in a lot \n\t\tof places but I don't really know what \n\t\tI'd call home.\n\n\tTom listens to this.\n\n<b>\t\t\t\t  ELLEN BOOKER\n</b>\t\tAn ambassador! My! That's very \n\t\timportant.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHe was a wonderful man.\n\n\tShe looks to Tom and he can sense a sadness around this in her \n\teyes.\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(to Grace)\n\t\tI sure hope you're gonna eat more \n\t\tthan that, young lady. You're a \n\t\tgrowing girl.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI've never eaten this much in my \n\t\tlife.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tProbably never worked so hard, \n\t\tneither. Those arms of yours are \n\t\tgonna be pretty sore tomorrow. I'll \n\t\tgive you a little bit of ointment I \n\t\tmake. It's a magic recipe my Mama \n\t\tgave me.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tWe used to call Diane's mother \n\t\tMedicine Woman. None of us never went \n\t\tto the doctor when she was alive.\n\n\tAnnie and Grace listen in...\n\n<b>\t\t\t\t  HANK\n</b>\t\tToo bad she wasn't here for old \n\t\tHenry Vanoker...\n\n<b>\t\t\t\t  FRANK\n</b>\t\tNot much would have helped him.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI never got that whole story, what \n\t\thappened?\n\n<b>\t\t\t\t  HANK\n</b>\t\tOld Henry was changing a flat tire on \n\t\this truck over on 118 when that...\n\t\t\t(laughs)\n\t\t... two-hundred-year-old jack he has \n\t\tgives way and the side of that truck \n\t\tcome slamming down on that rock he \n\t\tcalls head...\n\n\tThere's laughter -- everyone knows Old Henry. Except:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat happened?\n\n<b>\t\t\t\t  HANK\n</b>\t\tKnocked him out for a while. He woke \n\t\tup, finished putting on the tire and \n\t\tdrove himself to the hospital.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tOld Fool... Darling, pass down those peas \n\t\tfor me, thank you.\n\n\tAnnie and Grace don't know how to respond... But everyone else \n\ttakes it their stride as they continue eating...\n\n\tGrace notices Joe is whispering something to Frank, who nods \n\this head and speaks to the table.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tHuh, Joe here has something to say.\n\n\tJoe stands, somewhat formally, with his hat on.\n\n<b>\t\t\t\t  JOE\n</b>\t\tI wrote this for you Grandma...\n\n\tMrs. Booker, and Diane, beam. Annie and Grace don't know what \n\tto expect. Joe stands straight as an arrow and recites a poem \n\tfrom memory...\n\n\tAt first, Annie and Grace appear to be embarrassed for the boy \n\tbut soon they can't help but be won over by his guilessness. \n\tHe finishes and everyone applauds. Hank's wife asks:\n\n<b>\t\t\t\t  HANK'S WIFE\n</b>\t\tThat was lovely. Who wrote that, \n\t\tJoe?\n\n<b>\t\t\t\t  JOE\n</b>\t\tI wrote it myself, ma'am.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tNow son, you tell 'em when it came \n\t\tfrom.\n\n<b>\t\t\t\t  JOE\n</b>\t\tBe honest, I can't say I did it all \n\t\tmyself. My grandma helped me get the \n\t\twords right.\n\n\tOOoo's and aah's and smiles and conversations erupting over \n\teach other.\n\n\tOnly we see, Grace looking over to Joe who gives her kickass, \n\tshy grin...\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(raising his beer)\n\t\tWell, I'd like to welcome Annie and \n\t\tGrace to their first branding...\n\n<b>\t\t\t\t  FRANK\n</b>\t\tAnd next time, Miss Annie, you can run \n\t\tdown the calves...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI'll drink to that...\n\n\tEveryone toasts and drinks. Annie and Tom exchange a look. \n\tShe smiles, but not in a alluring way -- rather, in a grateful \n\tway. Grateful for this brief moment of community and good \n\tfeeling. And somehow, Tom knows what she's feeling.\n\n\tNo one notices this silent exchange -- except for Diane, who \n\tsees everything that's going on.\n\n<b>\tINT. RANCH HOUSE, DINING ROOM - NIGHTFALL\n</b>\n\tThe Women are bringing in dishes and plates and food from the \n\ttables through the house and into the kitchen. Annie is among \n\tthem, feeling apart of the group. She enters carrying a large \n\tbowl, that held the corn.\n\n\tDiane is replacing newly-cleaned forks and knives in her \n\tdining room drawers, above which are several FAMILY PICTURES.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(referring to clean bowl)\n\t\tWhere does this go, Diane?\n\n<b>\t\t\t\t  DIANE\n</b>\t\tOh, you can just set up on the dining \n\t\ttable. I have to rearrange my shelves \n\t\ttomorrow.\n\n\tAnnie complies. She notices the framed pictures on the wall in \n\tthe dining room.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIs this Mr. Booker? Tom's \n\t\tgrandfather?\n\n\tDiane looks at a faded photo circa late 1800's.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tMm-mm. I never knew him. He died \n\t\tbefore Frank and I met. This here's...\n\t\t\t(another photo)\n\t\tFrank and Tom's mother and father... \n\t\tthere's little Frank and Tom...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tShe calls him Tommy...\n\n<b>\t\t\t\t  DIANE\n</b>\t\tAlways did. I think she favored him a \n\t\tlittle. You tend to when you have more \n\t\tthan one, even though you love 'em all \n\t\tthe same.\n\n\tShe studies the old faces of Tom's Parents -- although 20th \n\tCentury people, there is still a pioneering strength in their \n\tvisage... a stoicism and power.\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(putting away forks)\n\t\tHa, she loves telling this story about \n\t\thow when he was two years old, he ran off. \n\t\tThey found him in the barn, sleeping \n\t\tbetween two giant hooves of a Percheron \n\t\tstallion. She said that horse was \n\t\tprotecting him and nobody could convince \n\t\ther otherwise.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI got a little confused though. The ranch \n\t\tEllen was talking about -- that's not this \n\t\tone?\n\n\tDiane is sorting silverware throughout the following:\n\n<b>\t\t\t\t  DIANE\n</b>\t\tNo. See, Frank and Tom were raised near \n\t\tthe Clark's Fork River, right between the \n\t\tPryor and Beartooth Mountains. Beautiful \n\t\tpiece of land. But they had this uncle \n\t\tNed -- useless man, never interested in \n\t\tranching. And when the grandparents died, \n\t\the left for the city and sent word \n\t\tthrough lawyers he wanted his claim to \n\t\tthe land so he could sell it. Three years \n\t\tof legation broke their father. Frank took \n\t\tit all in stride, but Tom... Tom loved that \n\t\tland. I don't think he ever got over it -- \n\t\tHis home being sold out from under him. \n\t\tSeeing his father like that. Once he and \n\t\tFrank got their folks set up in a new \n\t\tplace, Tom left... went off. We didn't see \n\t\thim for years...\n\n\tAnnie is intrigued by what she's learning about Tom. \n\tSomething outside the window catches her eyes. She watches:\n\n<b>\tPOV;\n</b><b>\t\n</b>\tTom and Frank, on either side to Ellen, are escorting her to \n\ta car that will drive her home.\n\n<b>\tEXT. RANCH HOUSE - NIGHT\n</b>\n\tAnnie wanders out, passing Grace and Joe on her way out. The two \n\tare sitting in a glider. As Annie exits O.C., we hear them;\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhy do you always wear that hat?\n\n<b>\t\t\t\t  JOE\n</b>\t\tBecause it fits my head. You want to \n\t\ttry it on?\n\n\tGrace doesn't know if she should.\n\n\tAnnie continues towards Tom who's sitting in a rocker playing \n\twith the twins.\n\n<b>\t\t\t\t  TWINS\n</b>\t\tShow us again! Come on! One more time! \n\t\tIt's my turn now!\n\n<b>\t\t\t\t  TOM\n</b>\t\tAll right, al right. Hold out your \n\t\tfinger.\n\n\tAnnie takes a seat nearby and watches as Tom holds out the \n\tfirst finger of his right hand. The Twins holds out his. Tom \n\tsplits his focus between Annie and the Twins as he takes a \n\tsmall piece of rope out of his back pocket. He ties the ends \n\ttogether making a loop. He puts the loop over the Twin's \n\tfinger. And holding the other end of the loop taut with his \n\tleft hand, he draws one side of the cord over the other with \n\tthe middle finger of his right hand. Then he rolls his hand \n\tover so it's under the loop, and back over it again, so that \n\this finger is tip to tip with the Twin's. The loop seemingly \n\tknotted around their touching fingertips, and can only be \n\tremoved if their touch is broken.\n\n<b>\t\t\t\t  TOM\n</b>\t\tThe loop's knotted, right.\n\t\t\t(Twins nod)\n\t\tLooks like the only way to take it \n\t\toff, is if we break our touch...\n\t\t\t(they nod)\n\t\tWatch now...\n\n\tAnnie and the Twins look down at the touching fingers as Tom \n\tgently pulls the rope away, revealing they are still knotted, \n\tand without even breaking their touch...\n\n<b>\t\t\t\t  TWINS\n</b>\t\tAgain! Again. One more time!\n\n<b>\t\t\t\t  TOM\n</b>\t\tOh, no. No, no. I only fall for that \n\t\tonce. Go inside now before your mother \n\t\tstarts hunting you down. Go on.\n\n\tThe Twins exit. Annie and Tom make eye contact.\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(smiles, relaxes back)\n\t\tSo how was your first and last day of \n\t\tbranding?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDon't be so sure it's my last. There \n\t\tare a few people back home I'd like \n\t\tto put under a red hot iron.\n\n\tTom looks at her with a sly expression, and notices she's \n\tshivering.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou got too much sun today... \n\t\tHere...\n\n\tHe takes his jacket and puts it around her shoulders.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThank you.\n\n\tHe sits back down. Annie crosses her arms over her chest, \n\tlooks around, unconsciously swinging her foot. Tom watches \n\ther leg. Annie notices him watching;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat?\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou ever just stand still for a \n\t\tminute?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou stand still too long in New York \n\t\tyou get hit by a bicycle messenger.\n\t\t\t(smiles wryly)\n\t\tYou know, sometimes, I get the feeling, \n\t\tMr. Booker, that you're laughing at me. \n\t\tWhy is that?\n\n\tTom shrugs. Annie waits a beat, then:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThat's your cue to say you're not \n\t\tlaughing at me.\n\n<b>\t\t\t\t  TOM\n</b>\t\tOh, I see, you write both sides of the \n\t\tconversation?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's a man's world, Mr. Booker. Most \n\t\twomen have to.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, maybe I am laughing a bit... I \n\t\tjust thought, as long as you're here, \n\t\tit would be nice for you to relax into \n\t\tthe place a little.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(understanding)\n\t\tWell... It's beautiful country, I'll give \n\t\tyou that. And I could see having some \n\t\tkind of vacation place. Retreat. But I \n\t\tdon't know how you do it full time. Don't \n\t\tyou miss the rest of the world?\n\n<b>\t\t\t\t  TOM\n</b>\t\tWhat's that to miss?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHa... if you've never lived in a city \n\t\twith museums, theater, music, restaurants, \n\t\tuh... god, a million things, then it's \n\t\tsomething I can't explain.\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(thinks, teasing a bit)\n\t\tDoes Chicago count?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(surprised)\n\t\tYou lived in Chicago?\n\n<b>\t\t\t\t  TOM\n</b>\t\tWhen I was first married.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(stunned)\n\t\tYou were married to a woman in \n\t\tChicago?\n\n\tTom likes disturbing her picture of him as the predictable \n\tcowboy. He smiles;\n\n<b>\t\t\t\t  TOM\n</b>\t\tI once heard Itzhak Perlman guest star \n\t\twith the Chicago Symphony Orchestra. \n\t\tHe played Rachmaninov's Vocalize Opus 34. \n\t\tNo. 14. It was one of the most beautiful \n\t\tpieces of music I ever heard. I actually \n\t\tforgot where I was for a time.\n\t\t\t(Annie is floored)\n\t\tYou seem surprised?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(not wanting to insult)\n\t\tWell, I, uh... you didn't...\n\n<b>\t\t\t\t  TOM\n</b>\t\tJust who's been laughing at who here?\n\n\tTom says this with a wry smile. Annie returns with a smile -- \n\tas an understanding is reached between them: they've both \n\tstereotyped the other. They are both pleased -- and attracted -- \n\tby what they don't know.\n\n<b>\tINT. CREEK HOUSE - NIGHT\n</b>\n\tGrace is fast asleep, exhausted. She does not stir when the \n\tphone rings.\n\n\tAnnie picks up from her own bed, awakened, still dressed in \n\ther branding clothes, having just passed out on the bed.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHello?\n\n<b>\tINT. CENTRAL PARK WENT APARTMENT - NIGHT\n</b>\n\tINTERCUT: Robert, alone, in the vast apartment.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI thought you guys were going to call \n\t\tme.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, Robert, I'm sorry. We were so tired \n\t\tfrom the branding. Grace barely made it \n\t\tto her bed and I didn't have the energy \n\t\tto take my clothes off.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tOh well... branding will do that to you.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tEverything all right.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHuh-huh. You?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tFine. Actually, today was a good day. \n\t\tYou should have seen her.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI wish I did.\n\n\tThe sound of self-pity was so obvious for both of them, so \n\tRobert quickly re-groups, resorting to something he knows is \n\timportant to her;\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWell, uh the real reason I called, \n\t\tactually, was to tell you I saw Lucy \n\t\tat Jo-Jo's tonight and she seems very \n\t\tworried.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tAbout what?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tApparently, Gottschalk's been seen around \n\t\ttown lunching with some very prominent \n\t\tmagazine editors. Lucy said she tried to \n\t\tcall you, but no one answered so she faxed \n\t\tyou the list of names. She said one of \n\t\tthem have contracts up fairly soon.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh. I didn't look at my faxes today. We \n\t\tleft before sunrise.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHoney, I hope you're not endangering \n\t\tyour position. Listen, if you need to \n\t\tcome back and you want me to come take \n\t\tover, for a while, I'll work it out. I \n\t\tmean, the firm's got other lawyers, but \n\t\tthe magazine's got only one of you.\n\n\tAfter a day of hard work and simple pleasures, Annie begins to \n\tsuccumb to old anxieties and pressures.\n\n<b>\tINT. CREEK HOUSE - NIGHT\n</b>\n\tAnnie is awake reading the faxes Lucy sent. One after other. \n\tAs she flips through them, one falls to the floor near the bed.\n\n\tShe gets down on all fours to retrieve and sees something \n\tunder the bed. AN OLD, BATTERED CELLO CASE. She pulls it out \n\tto find the initials R.B. carved on the top. She opens it to \n\tfind papers, receipts, bills -- all from Tom's married life.\n\n<b>\tEXT. THE DOUBLE DIVIDE - EARLY MORNING\n</b>\n\tTom rides a young colt along the creek. He hears footsteps. \n\tHe turns and sees Annie running along the creek on the other \n\tside. He stops to watch. When his horse SNORTS, Annie looks \n\tup to see him. She stops. He tips his hat to her.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI've decided it's impossible to \n\t\tproperly say hello in this place \n\t\twithout a hat.\n\n<b>\t\t\t\t  TOM\n</b>\t\tA jogger, huh?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't jog, Mr. Booker. I run.\n\n<b>\t\t\t\t  TOM\n</b>\t\tLucky for you. The grizzlies around \n\t\there only go for joggers.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIf I can survive rush hour, I figure I \n\t\tcan handle grizzlies...\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(smiles)\n\t\tYou sleeping all right in that house?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't sleep all right anywhere. But \n\t\tthe house is fine.\n\n\tTom walks his horse across the creek to her, comfortable in \n\tthe silence. Annie moves about, uncomfortable in the waiting.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWho's R.B.?\n\n\tTom is finding Annie's blunt curiosity more endearing.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI found this old cello case filled with \n\t\tbills and receipts.\n\n<b>\t\t\t\t  TOM\n</b>\t\tSorry about that. I thought everything \n\t\tgot cleared out. R.B. is my wife... \n\t\tex-wife... Rachel. We used to live in \n\t\tthat house \n\t\ttogether.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI thought you lived in Chicago?\n\n<b>\t\t\t\t  TOM\n</b>\t\tI thought you were an editor, not a \n\t\treporter?\n\n\tAnnie smiles and nods, realizing she's asking too many questions. \n\tShe tries to casually reach out to touch the horse's head, but \n\tit's too abrupt and the horse tosses his head away, taking a \n\tcouple of steps back. Annie is embarrassed.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI have a way with animals.\n\n<b>\t\t\t\t  TOM\n</b>\t\tIt's all right. He's young. Just hold \n\t\tout your hand a little lower so he can \n\t\tget the smell of you.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh yes. I forgot.\n\n\tShe does and the horse sniffs at her hand.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHe's beautiful.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWhy don't you ride anymore? Grace told \n\t\tme you used to ride when she was \n\t\tyounger.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tShe did?\n\n\tAnnie is somewhat moved by her daughter telling him that.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't know, really. No time mostly.\n\n\tA cold wind blows. She folds her arms across her breasts.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI thought it was supposed to be spring.\n\n\tTom can't help but notice her nipples are hard from the cold. \n\tHe looks away. She laughs.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tAre you shy, Mr. Booker?\n\n<b>\t\t\t\t  TOM\n</b>\t\tJust polite. Well, maybe you'd like \n\t\tto try riding again, some time before \n\t\tyou go home.\n\n\tAnnie is struck by the words \"before you go home.\" Tom ambles \n\toff on his horse.\n\n<b>\t\t\t\t  TOM\n</b>\t\tEnjoy the day.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou too.\n\n\tAnnie steps across the rocks at the ford, crossing the creek. \n\tHer foot slips, one of her shoes goes into the water.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tShit.\n\n<b>\t\t\t\t  TOM\n</b>\t\tNeed a lift?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI can handle it!\n\n\tShe crosses the creek. She turns, giving him a small wave. He \n\ttouches his hat. She runs off. Tom watches her go, head down, \n\tconcentrating...\n\n<b>\tINT. CREEK HOUSE - DAY\n</b>\n\tA tense Annie is having a difficult phone with DAVID GOTTSCHALK;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t... David, we've been behind a day or \n\t\ttwo before. But Lucy just Fedexed me all \n\t\tthe material and it'll be approved by \n\t\tthe end of the day.\n\n<b>\t\t\t\t  DAVID GOTTSCHALL (V.O.)\n</b>\t\tIf nothing goes wrong. If the faxes don't \n\t\tgo down. If the phone lines are opened. \n\t\tI can't have this magazine hitting the \n\t\tstreets by the skin of its ass, Annie.\n\n\tDuring David's lines, Diane has entered, carrying fresh towels \n\t-- she crosses into the bathroom.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, come on! This is such bullshit! The \n\t\twork is getting done, David. Lucky keeps \n\t\tme on top of everything.\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (V.O.)\n</b>\t\tLucy isn't you. We're losing something \n\t\twithout you being here. Now, I know this \n\t\tis a rough time for you, but I think we \n\t\tshould make another arrangement.\n\n\tWithout Annie's awareness, Diane re-enters and takes her time \n\tleaving, so she can take in all of Annie's things; her \n\tbusiness \"office,\" books, etc...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat the hell does that mean? How much \n\t\tmore do I have to do to prove how \n\t\timportant this magazine is to me?\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (V.O.)\n</b>\t\tIf this magazine is so important to you \n\t\tAnnie, why are you in Montana?\n\n\tDiane can't help but notice a slight vulnerability in Annie.\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (V.O.)\n</b>\t\tLook, this is what we're going to do. \n\t\tFinish up this issue. I'll set up a \n\t\tconference call in a few weeks. Just \n\t\tyou, me and your lawyer and we'll \n\t\tjust work this out so that everyone \n\t\twill be taken care of. Fair enough?\n\n\tAnnie is now aware of Diane's presence and chooses to play it \n\tcool. It's not the moment.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tUh, yes... Sure, David.\n\n<b>\t\t\t\t  DAVID GOTTSCHALK (V.O.)\n</b>\t\tAll right. Speak to you then.\n\n\tHe hangs up. Annie forces a smile to Diane.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThank you. You're all doing too much.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tOh, it's... I wanted to tell you that, \n\t\tif you'd like, you being so busy, I \n\t\tcould take Grace to her therapy \n\t\texercises for you. I have to go in \n\t\tonce a week for shopping anyway.\n\n\tAnnie doesn't know whether or not to accept.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh... Well... thank you very much. I \n\t\tdon't --\n\n\tBefore she finishes her line, the Phone Rings again.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSorry.\n\t\t\t(to phone)\n\t\tHello? Hi, yeah, I just spoke to him. \n\t\tOh, you know David, Mr. Strong Arm...\n\n\tDiane feels out of place and exits. Annie doesn't notice \n\tuntil she hears the door close. She pushes back her hair and \n\ttakes a deep breath. She looks out through the side window \n\tand sees:\n\n\tGrace and Joe doing chores. Grace looks involved and not at \n\tall self-conscious. A moment of gratitude and calm for Annie.\n\n<b>\tEXT. THE DOUBLE DIVIDE - DAY\n</b>\n\tPilgrim bursts out of a chute and into the riding arena. He \n\truns to the far end and abruptly stops. Tom is holding the \n\torange flagstick, and coiled rope, coming through a gate \n\tinto the arena, crossing to the middle of the ring. Something \n\tin his demeanor tells us that fun and game are over.\n\n\tPilgrim and Tom stand there, motionless, eyeing each other. \n\tPilgrim snorts and takes a few, small steps backward. Tom \n\ttakes a beat, then starts slowly towards Pilgrim, lifting the \n\tflag and \"cracking\" it. At the sound, Pilgrim whirls away from \n\thim and runs, around the arena. He starts to slow, looking at \n\tTom. Again, Tom cracks the flag and Pilgrim runs, round and \n\tround the arena... like a ringmaster, Tom keeps Pilgrim \n\tmoving, cracking the flag.\n\n\tSomething about Tom's demeanor tells us it isn't going well.\n\n<b>\tEXT. THE RANCH - DAY\n</b>\n\tTom, carrying a saddle, comes around the side of the barn. \n\tThrough the slats, he sees Grace working in the barn, \n\twatering a horse. She has stopped and is looking through the \n\tcracks of Pilgrim's stall at him. She turns and sees Tom \n\tthrough the slats. She goes back to work as Tom comes to the \n\tbarn door.\n\n<b>\t\t\t\t  TOM\n</b>\t\tCome and take a ride with me.\n\n<b>\tEXT. THE RANCH - DAY\n</b>\n\tThey walk towards his pick-up truck.\n\n<b>\t\t\t\t  TOM\n</b>\t\tCan you drive?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDrive? I'm not old enough yet.\n\n<b>\t\t\t\t  TOM\n</b>\t\tIt's never too soon to start.\n\n\tHe enters the passenger side.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI can't...\n\n<b>\t\t\t\t  TOM\n</b>\t\tI don't have all day.\n\n\tShe hesitates and gets into the truck.\n\n<b>\tINT. PICK-UP TRUCK - DAY\n</b>\n\tGrace doesn't know what to do.\n\n<b>\t\t\t\t  TOM\n</b>\t\tPut the key in and turn it.\n\t\t\t(Grace obeys)\n\t\tThe right pedal is gas, the other \n\t\tone's the brake.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI don't know if I can with my leg.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, there's only one way to find out.\n\t\t\t  (puts truck in gear)\n\t\tGive it a little gas.\n\n\tShe awkwardly puts her prosthetic foot on the gas pedal. Too \n\tmuch. It lurches forward. She takes her foot off.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, we know you can. Now you just \n\t\tgot to feel how much. Try it again.\n\n\tShe does. They slowly, very slowly, move along the dirt road.\n\n<b>\t\t\t\t  TOM\n</b>\t\tNice, real nice. There's a little \n\t\troad down at the end here, turn onto \n\t\tit.\n\n\tGrace badly oversteers, but makes the turn. She drives along \n\tthe road, across a pasture, heading toward distant mountains.\n\n<b>\t\t\t\t  TOM\n</b>\t\tJust follow this. Nothing to it. I'm \n\t\tgoing to shut my eyes here for a \n\t\tlittle while. Just keep going till \n\t\tyou run out of road.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(afraid)\n\t\tI don't know if I can.\n\n<b>\t\t\t\t  TOM\n</b>\t\tNot a question of if you can -- you \n\t\tare. Just keep your eyes on the road \n\t\tand your foot on the pedal and the \n\t\trest will take care of yourself.\n\n\tFolding his arms over his chest, shutting his eyes, Tom \n\trelaxes back. Grace locks her hand on the steering wheel and \n\ther eyes straight ahead...\n\n<b>\tEXT. DOUBLE DIVIDE - DAY\n</b>\n\tThe truck is parked at the foot of a mountain. Grace, very \n\tpleased with herself, sits beside Tom on the cab's roof, \n\tlooking around them at the great Montana. After a beat;\n\n<b>\t\t\t\t  TOM\n</b>\t\tWhere did you get Pilgrim from?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWe bought him in Kentucky. My mother \n\t\tand I took a trip down there to see \n\t\thim.\n\n<b>\t\t\t\t  TOM\n</b>\t\tThat must have been pretty special.\n\n\tGrace nods. It is a pleasant memory. He motions for her to be \n\tquiet. An old ELK with a prodigious rack of antlers, has come \n\tdown out of the mountains. Seeing them, he stops in his \n\ttracks, dead still. They watch each other. Then the elk turns \n\tand runs back up into the mountains. Tom smiles at Grace who \n\tsmiles back -- partly because of the elk, partly because she's \n\talone with Tom.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tAre you afraid of anything?\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(thinks)\n\t\tGetting old. Not being of much use, \n\t\tI guess.\n\t\t\t(beat)\n\t\tWhat went on out there, Grace? With \n\t\tPilgrim?\n\n\tGrace doesn't say anything. Tom nods then;\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou see, Grace, I've got a problem. \n\t\tWhen I'm working with a horse, I like \n\t\tto know its history. Now, most times, \n\t\tthe horse can tell you pretty much the \n\t\twhole story, but sometimes he can be \n\t\tso messed up in his head that you need \n\t\tmore to go on. You need to know exactly \n\t\twhat went wrong. Often times, it's the \n\t\tobvious thing, but something that went \n\t\twrong just before that, maybe even some \n\t\tlittle thing...\n\n\tGrace is quiet. She doesn't want to think about that.\n\n<b>\t\t\t\t  TOM\n</b>\t\tIt's like if I'm driving and run into \n\t\ta tree. When somebody asks me, \"Well, \n\t\twhat happened?\", I don't say, \"Well, \n\t\tI plowed into a tree.\" I'd say, \"The \n\t\tsun was in my eyes.\" or \"I skidded.\" or \n\t\t\"I took my mind off the road for a \n\t\tsecond.\" See what I mean?\n\t\t\t(Grace nods)\n\t\tI don't know how you feel about talking \n\t\tabout it and I can understand you might \n\t\tnot want to. But if I'm going to figure \n\t\tout what's going on in his head, it'd \n\t\tsure help if I knew exactly what \n\t\thappened that day.\n\n\tGrace looks away. Tom smiles and gently puts his arm around \n\ther shoulders, which has a soothing effect on Grace -- making \n\ther feel safe...\n\n<b>\t\t\t\t  TOM\n</b>\t\tNot today -- whenever you feel like it. \n\t\tI leave it up to you.\n\n\tGrace looks into Tom's eyes, wanting so much to unburden herself \n\tto him and have him make everything all right. She nods.\n\n<b>\tEXT. RANCH HOUSE - LATE AT NIGHT\n</b>\n\tTom is making his way to the house at the end of the day, when \n\the stops and looks over to the Creek house --\n\n\tPOV -- the lights are on. And he can see Annie, exhausted... \n\tapproving pages, talking on the phone and faxing all \n\tsimultaneously.\n\n\tHe gets an idea.\n\n<b>\tEXT. CREEK HOUSE - MORNING\n</b>\n\tAnnie sits on the porch of the creek house, with a guilt over \n\therself, sipping coffee and deep in thought. She looks up to \n\tsee:\n\n\tTom riding towards the house on his horse, leading another \n\thorse behind him. He looks to her and smiles.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(murmurs)\n\t\tOh-oh.\n\n\tTom reaches the house as Annie rises.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThe answer's no.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou haven't heard the question yet. Truth \n\t\tis, you'd be doing me a favor. I got all \n\t\tthese eager young colts need riding and \n\t\tpoor old Rimrock here is feeling kind of \n\t\tleft out...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tPoor thing.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHe'd be grateful, he'd take real good \n\t\tcare with you.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIs this how you're going to make me pay \n\t\tmy phone bill?\n\n<b>\t\t\t\t  TOM\n</b>\t\tNo, ma'am, I'm afraid that's extra.\n\n\tShe gives him a crooked smile.\n\n<b>\tEXT. THE RANCH, PASTURE - DAY\n</b>\n\tAnnie, in Levis and a jacket, rides Rimrock beside Tom across \n\tthe pasture. We overhear them in the midst of talking.\n\n<b>\t\t\t\t  TOM\n</b>\t\tRelax our center... It's just sitting \n\t\tin a bucket.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah, it's been a while, but I... I \n\t\tremember the basic ideas...\n\n<b>\t\t\t\t  TOM\n</b>\t\tOK. I'll stop talking then.\n\n\tHe rides a few steps ahead as Annie realizes she doesn't \n\tremember. She just went into automatic \"I don't have to be \n\ttold anything\" mode.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tActually, I never rode Western. I'm \n\t\tsorry. Go ahead.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, he don't know that. Just sit the \n\t\thorse.\n\t\t\t(watches her ride)\n\t\tGood... You have a nice seat.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThanks.\n\n<b>\t\t\t\t  TOM\n</b>\t\tFeel good?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou look all right. You want to pick \n\t\tit up a little?\n\n<b>\t\t\t\t  ANNIE\n</b><b>\t\tOK.\n</b>\n\tTom urges his horse into a center. Annie canters alongside.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWatch your reins, he'll go with you, \n\t\tgive him some room, let him do the \n\t\twork. Relax, don't grab him with \n\t\tyour thighs, just so long as he can \n\t\tfeel your body.\n\n\tAnnie responds to every suggestion without resistance. And \n\tshe experiences this sense of pleasure -- this great animal \n\tbeneath her, the physicality and the surrender of letting \n\tsomeone else lead...\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou want to let it go some more?\n\n\tShe begins to let herself go, losing herself in the experience. \n\tShe just nods... Tom breaks into a full gallop... Annie follows \n\tsuit... She lets everything go -- her job, her marriage, \n\tmotherhood, guilt, anxiety... all of it. Her only focus is the \n\thorse beneath her, and the man on the horse leading her...\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. DOUBLE DIVIDE - DAY\n</b>\n\tThey ride along the creek, crossing at a ford. They ride up \n\ttowards the mountains.\n\n<b>\t\t\t\t\t\t  LAP DISSOLVE TO:\n</b>\n<b>\tEXT. THE MOUNTAINS - DAY\n</b>\n\tThey ride through a narrow pass with sheer rock walls, riding \n\tby a waterfall...\n\n<b>\t\t\t\t\t\t LAP DISSOLVE TO:\n</b>\n\tThey ride across a meadow, cattle stepping lazily aside to \n\tlet them pass. And as they ride alongside each other, \n\tappreciating the silence...\n\n<b>\t\t\t\t\t\t LAP DISSOLVE TO:\n</b>\n\tThey ride up along a sloping ridge covered with pine trees. \n\tThey come to the rim of a high bluff. They stop. They look \n\tout at the twin valleys that gave the ranch its name. And \n\tthey can just see the old CREEK HOUSE hidden in the shade of \n\tsome trees along the creek...\n\n\tTom looks over at Annie, who is looking out over this \n\tbeautiful vista.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's a whole other world you have \n\t\tgoing on here. It just goes along, \n\t\tdoing what it has to. And you're a \n\t\tpart of it, you just wake up and, \n\t\tand there you are... And everything \n\t\tthat seems like life or death some \n\t\tplace else -- doesn't affect any of \n\t\tthis one bit.\n\n\tTom is impressed by her feelings. He sees her saddle cinch \n\tneeds fixing and gets off his horse.\n\n<b>\t\t\t\t  TOM\n</b>\t\tLift your leg.\n\n\tAnnie complies once she realizes what he's doing.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHow long did you live here with your \n\t\twife?\n\n<b>\t\t\t\t  TOM\n</b>\t\tFive years. My son was born here.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(opens her eyes)\n\t\tSon?\n\n<b>\t\t\t\t  TOM\n</b>\t\tYeah. I haven't seen him in a while. He \n\t\tused to come to the ranch over summers, \n\t\tbut then he started having friends and \n\t\twas going off to college, so... Good boy. \n\t\tHal. Lives in New York near his mom.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHow did you meet her?\n\n<b>\t\t\t\t  TOM\n</b>\t\tCollege. In Illinois. She was playing \n\t\tthe cello. I hadn't heard cello music \n\t\tgrowing up. She had the reddest hair, \n\t\tthe bluest eyes. When she played, it \n\t\twas...\n\n\tTom can't find a beautiful enough word. But Annie understands.\n\n<b>\t\t\t\t  TOM\n</b>\t\tShe was the most beautiful thing I'd \n\t\tever seen.\n\n\tAnnie sees Tom as if with new eyes -- his love for this woman \n\the lost.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhy didn't it work out?\n\n<b>\t\t\t\t  TOM\n</b>\t\tShe was never really happy here. She did \n\t\tthe best she could.\n\n\tAnnie looks at him and for the first time senses a kinship -- \n\tan understanding they both have of being torn between two \n\tworlds... a desire for home...\n\n<b>\t\t\t\t  TOM\n</b>\t\tGrace told me you have a country house \n\t\tin Connecticut. Sounds like a beautiful \n\t\tplace.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt is. It's lovely.\n\n<b>\t\t\t\t  TOM\n</b>\t\tEver think of moving there full time?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWe did at one point. When we thought \n\t\twe'd have more children. And we after \n\t\ttried. We tried everything, but... \n\t\twasn't meant to be.\n\n\tThere is an awkward silent beat for a moment. Annie is \n\tmomentarily self-conscious. Tom helps by speaking of himself;\n\n<b>\t\t\t\t  TOM\n</b>\t\tI hear that! See, I knew she was never \n\t\tgoing to be a ranchest, but I wanted \n\t\tto try -- I thought maybe she'd give \n\t\tmusic lessons to the kids in town or at \n\t\tthe school, maybe even recitals. My son \n\t\twould grow up here. Maybe have one or \n\t\ttwo more. I'd teach 'em what I could. \n\t\tThey'd play with my brother's kids. All \n\t\tgrow up together. And even if they all \n\t\tdecided to go out into the world, they'd \n\t\talways know where home was -- cause we'd \n\t\tkeep it for 'em...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThat's very important to you, isn't it? \n\t\tHome.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYeah, I think it is. And I don't mean \n\t\teverybody's got to be married, have kids\n\t\t-- It's more like, knowing where you're \n\t\tfrom, where you belong, what feeds you, \n\t\twhere you can go no matter what happens... \n\t\tKnowing what you're supposed to be doing \n\t\twhile you're here.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHow did you find out all that?\n\n\tTom looks right into her eyes and confesses without a shred \n\tof self-consciousness.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI got lost.\n\n\tThey smiles.\n\n<b>\tEXT. CREEK HOUSE - NIGHT\n</b>\n\tThe world is in silhouette. Off in the distance, we see Tom \n\tstanding by his horse, offering his hand to Annie, helping \n\ther off. There's an awkward moment, neither of them wanting \n\tthe day, or the moment, to end.\n\n<b>\tINT. CREEK HOUSE - NIGHT\n</b>\n\tGrace is standing by the window, looking out at them. Their \n\tmovements indicate an intimacy that upsets her.\n\n<b>\tEXT. CREEK HOUSE - NIGHT\n</b>\n\tAfter a beat;\n\n\tTom gets back on his colt. He takes Rimrock's reins and leads \n\thim off. Annie stops for a moment, watching him ride away...\n\n\tShe watches her mother walk towards the house;\n\n<b>\tINT. CREEK HOUSE - MOMENT'S LATER\n</b>\n\tGrace watches her mother stand there a moment, then turn and \n\twalk towards the house. Grace moves away from the window, \n\ther emotions churning -- jealousy, anger -- and enters her \n\tbedroom, shutting the door.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. THE PASTURE - EARLY MORNING\n</b>\n\tJoe, hat tipped low, is riding his horse, leading some young \n\thorses, exercising them in the morning pasture. He sees Grace, \n\twalking with her cane, coming across the pasture.\n\n<b>\t\t\t\t  JOE\n</b>\t\t\t(shy)\n\t\tHi...\n\n\tShe stops. After a beat;\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWould you let me ride your horse?\n\n<b>\t\t\t\t  JOE\n</b>\t\t\t(hesitates)\n\t\tHave you talked to Tom about it?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tOf course I have.\n\n<b>\t\t\t\t  JOE\n</b>\t\t\t(beat, then:)\n\t\tI don't know... You sure Tom said it's \n\t\tall right?\n\n\tShe nods. He hesitates.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tAre you going to give me a hand or \n\t\taren't you?\n\n\tHe gets off his horse and holds it. She puts down her cane, \n\tthen puts her hand on the saddle horn. She puts her \n\tprosthetic leg into a stirrup. Frightened, she starts to \n\tshake;\n\n<b>\t\t\t\t  JOE\n</b>\t\tYou sure?\n\n\tAngry, determined, Grace tries to swing her leg onto the \n\thorse. She can't do it. Tears of frustration on her face. She \n\ttries again. She manages to pull herself halfway on, her \n\tprosthetic leg buckles and she falls. Frightened, Joe runs to \n\ther.\n\n<b>\t\t\t\t  JOE\n</b>\t\tYou okay?\n\n\tShe gasps to catch her breath. He reaches to help her up. She \n\tpulls her hand away. Embarrassed, she \"runs\" off. Joe remains \n\tstill. He hears a little VOICES. He turns and sees the TWINS \n\thaving been watching the whole thing from a small hill. As \n\tthey run off, he yells, threateningly.\n\n<b>\t\t\t\t  JOE\n</b>\t\tYou better not say anything!!!\n\n<b>\tEXT. CREEK HOUSE - NIGHT\n</b>\n\tWe follow Joe running towards the creek house, fastening a \n\tgood shirt. He's dressed and cleaned for dinner. He's late.\n\n<b>\tINT. CREEK HOUSE - NIGHT\n</b>\n\tAnnie is in the midst of making a spaghetti dinner. She's a \n\tlittle frazzled but she's on top of it. Grace enters wearing \n\ta lovely dress -- it is the first time we have seen her in a \n\tdress. Annie hears her enter before she sees her, asking;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHoney, would you see if anybody \n\t\twants --\n\n\tAnnie notices Grace standing there, in her dress. She stops.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou look really pretty.\n\n\tGrace is a little self-conscious but grateful. She begins \n\ttaking forks out of her dress pocket.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI thought there were too many forks \n\t\ton the table.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, one was for salad...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tMom, they don't mind eating with one \n\t\tfork.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(thinks, then;)\n\t\tYou're right. Good.\n\n\tGrace puts them away.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDoes anybody out there want \n\t\tsomething to drink?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI'll take care of it.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThanks, honey.\n\n\tGrace nods and exits to the living room.\n\n<b>\tLIVING ROOM:\n</b>\n\tThe room is silent because every Booker is READING A \n\tDIFFERENT COPY OF ANNIE'S MAGAZINE. Frank covertly glimpses \n\tat the scantily-clad models... The Twins sharing a magazine, \n\tdoing the same thing as their father, but keeping an eye out \n\tfor mom... Diane is looking at pictorial exposes on the kind \n\tof lives she only hears about on audio tapes...\n\n\tTom sits off to the side, amused by the sight.\n\n\tGrace enters as Joe enters. They nod across the room to each \n\tother with a little smile.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWould anyone like something to drink?\n\n\tWe hear a CRASH in the kitchen, then:\n\n<b>\t\t\t\t  ANNIE (O.S.)\n</b><b>\t\tSHIT!\n</b>\n\tEverybody looks up for a minute. The Twins giggle. Diane gives \n\tthem a dirty look.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI'll give your mom a hand.\n\n\tDiane watches him enter the kitchen, then returns to her \n\tmagazine.\n\n<b>\tINT. KITCHEN - CONTINUOUS\n</b>\n\tAnnie has dropped a hot pot into the sink, after pouring the \n\ttomato out of it, and into a terrine.\n\n<b>\t\t\t\t  TOM\n</b>\t\tEverything under control?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(laughs)\n\t\tNot really. I'd forgotten how long \n\t\tit's been since I've done this. And \n\t\tI couldn't get any Parmesan cheese.\n\n<b>\t\t\t\t  TOM\n</b>\t\tJust make yourself comfortable.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI am comfortable.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHa, ha... all right, well, uh I guess \n\t\tyou can bring out the pasta.\n\n\tShe undoes her apron and crosses towards the bowl. Tom's eyes \n\tnever leave her. It's the first time he's seen her in her \n\tdress, sans apron. As she lifts the bowl to hand to him, she \n\trealizes he's been looking at her. There's a silent moment, \n\tthen;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou missed a button.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHuh?\n\n\tShe looks for it. Tom crosses to her and buttons it, then \n\ttakes the bowl.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThank you.\n\n\tThey're quiet for a beat as they exchange a look. Suddenly, \n\tGrace enters -- she clearly doesn't like the two of them being \n\talone, Annie quickly covers;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, good, Grace, would you bring in \n\t\tthe bread... I'll get the salad and \n\t\tthen we're all set.\n\n\tTom has already exited by the time Annie finishes, and Grace \n\tgrabs the bread basket.\n\n<b>\tINT. CREEK HOUSE - LATER THAT NIGHT\n</b>\n\tWe parachute into the middle of the meal. The spaghetti is a \n\thit... We cut to different conversations and reactions around \n\tthe table.\n\n\tFrank is in the middle of saying;\n\n<b>\t\t\t\t  FRANK\n</b>\t\tIt'd be a whole lot easier to pay \n\t\tthe feed end of the month...\n\n<b>\t\t\t\t  TOM\n</b>\t\tI don't think Warren would go for that.\n\n\tGrace is talking to Joe and the Twins.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t... like, for instance, you can go on \n\t\tthe Internet and access this thing \n\t\tcalled The Visible Man -- who was this \n\t\tmurderer they caught in Texas that was \n\t\texecuted and donated his body to \n\t\tscience and you can call him up on the \n\t\tscreen and dissect him, like in Three-D...\n\n\tGrace eats as she talks. Joe and the Twins are fascinated.\n\n\tAnnie asks Tom, Frank and Diane;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, did you ever think about hiring \n\t\ta business manager?\n\n<b>\t\t\t\t  FRANK\n</b>\t\tWe have a business manager. The best \n\t\taround.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tHa...\n\n<b>\t\t\t\t  TOM\n</b>\t\tDiane takes care of the books. I don't \n\t\tknow how, but at the end of every \n\t\tmonth, everything adds up to the penny.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tAin't brain surgery.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's pretty impressive. Where I come \n\t\tfrom, you'd be a gold mine.\n\n\tDiane doesn't know how to accept that, but inside she's \n\tbursting with pride. She focuses on the Twins who fight;\n\n<b>\t\t\t\t  TWINS\n</b>\t\tThis is MY fork. That's YOUR fork, ya \n\t\tidiot!\n\n<b>\t\t\t\t  DIANE\n</b>\t\tHey. You stop that kind of talk at the \n\t\ttable.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tI'll have another round of that \n\t\tspaghetti if may?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tAbsolutely. I made enough for an army.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI uh... I like the sauce very much. Maybe \n\t\tI get the recipe.\n\n\tAnnie is so pleased and is about to reply, but Grace, noticing \n\tTom smiling at Annie:\n\n<b>\t\t\t\t  GRACE\n</b>\t\tIt's from a jar.\n\n\tThere's an odd silence as a deflated Annie serves Frank.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tThank you.\n\n\tFinally, Diane saves it.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tWell, I tried jar sauce once -- \n\t\twasn't this good. Ya gotta know \n\t\twhich brand to buy. I'd like to \n\t\tget the name of this one.\n\n\tAnnie is grateful. Grace feels foolish.\n\n<b>\t\t\t\t  TWIN (SCOTT)\n</b>\t\tCan we see the dead body on the \n\t\tscreen?\n\n<b>\t\t\t\t  DIANE\n</b>\t\tWhat?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tIt's just my computer.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tOh, I don't --\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's okay. Grace, show them. I'm going \n\t\tto put the coffee on. I made an apple \n\t\ttart for dessert.\n\n\tThe Twins excitedly move to the computer. Joe waits for Grace.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI'll help you with the coffee.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell... I know I should reject that \n\t\toffer, but I'm not going to.\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(jovial)\n\t\tNo reason you should, no reason you \n\t\tshould.\n\n\tThey exit into the kitchen. Frank continues eating.\n\n\tTom looks around -- Grace showing the boys the computer. Annie \n\tand Diane in the kitchen. For a second, we see Tom realize an \n\timage of the life he once thought he could.\n\n<b>\tINT. KITCHEN - NIGHT\n</b>\n\tAs Diane and Annie prepare coffee and dessert;\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI was looking in one of your magazines \n\t\tand saw that picture of the couple \n\t\tgetting married at the Pyramids. Were \n\t\tyou ever in Egypt?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI was there for that shot, actually.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tWhat was it like?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, God -- I think it was the fourth \n\t\tor fifth time I'd been there, so all \n\t\tI remember was the heat and how \n\t\tincompetent the photographer was...\n\n\tShe laughs as she directs this last line to Diane, who just \n\tsmiles. And Annie realizes that's not what she meant at all. \n\tThis woman is starving for glimpses into this other life.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tBut, uh, Egypt is, well, it's like \n\t\tnothing else. It's like going back in \n\t\ttime.\n\t\t\t(Diane listens)\n\t\tI remember as a kid trying to imagine \n\t\twhat a kid my age, centuries ago, \n\t\twalking over that same ground, was \n\t\twondering about or, if they had the \n\t\tsame problems as me... and I felt, \n\t\tconnected to... to time itself, almost. \n\t\tHa, I never realized how hard it was \n\t\tto describe.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI'd love to go there one time...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou and Frank ever take a vacation?\n\n<b>\t\t\t\t  DIANE\n</b>\t\tSoon. We're going to Branson, Missouri \n\t\tto see my cousin Emma married. Frank \n\t\tloves in there.\n\n\tAnnie can sense the disappointment in her voice, and at the \n\tsame time, the comfortable resignation.\n\n\tSuddenly, from inside, they hear LOUD OVERLAPPING VOICES as \n\tthe children fight.\n\n<b>\t\t\t\t  TWIN (SCOTT)\n</b><b>\t\tIT WAS MY TURN!\n</b>\n<b>\t\t\t\t  JOE\n</b><b>\t\tYA JUST HAD A TURN. IT WAS NOT.\n</b>\n<b>\t\t\t\t  TWIN (SCOTT)\n</b><b>\t\tWAS SO!\n</b>\n<b>\tLIVING ROOM:\n</b>\n\tDiane and Annie enter to find Joe and Scott fighting, as Tom \n\ttries to break them up...\n\n<b>\t\t\t\t  TOM\n</b>\t\tBoys! Settle down!\n\n<b>\t\t\t\t  TWIN (SCOTT)\n</b>\t\tYou never let me have a turn!\n\n<b>\t\t\t\t  JOE\n</b>\t\tDon't be such a baby!\n\n<b>\t\t\t\t  TWIN (SCOTT)\n</b>\t\tYou just showing off for her!\n\n<b>\t\t\t\t  JOE\n</b>\t\tYou shut up, stupid!\n\n<b>\t\t\t\t  TWIN (SCOTT)\n</b>\t\tYou're the one who's stupid -- letting \n\t\ther go and fall off your horse!!\n\n\tEveryone goes quiet, except for the computer screen.\n\n<b>\t\t\t\t  JOE\n</b>\t\tYou little shit!\n\n<b>\t\t\t\t  DIANE\n</b><b>\t\tJOE!\n</b>\n<b>\t\t\t\t  TWIN (SCOTT)\n</b>\t\tI saw 'em. In the pasture. Her trying to \n\t\tget on Gonzo! I saw 'em.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat does he mean?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tNothing.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDid you go riding?\n\n<b>\t\t\t\t  JOE\n</b>\t\tLittle shit!\n\n\tJoe lunges for Scott and the two start rolling in a fight. \n\tFrank and Tom work to pull them apart as Diane yells.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tAnnie, I'm so sorry, but they're just \n\t\ttired. We'll have dessert another time. \n\t\tFrank, get them out of here.\n\t\t\t(to other Twin)\n\t\tCome on. Say good night and thank \n\t\tyou...\n\n\tVoices everywhere. Yelling. \"Thank you's!!\" During which, \n\tGrace quickly turns and exits. Annie eyes follow her out of \n\tthe room, but with her guests and the chaos, she doesn't know \n\twhether or not to leave.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tDinner was delicious. Thank you.\n\t\t\t(to Twins)\n\t\tSay thank you!!\n\n\tDiane and Frank usher the kids out. Tom holds onto Joe until \n\tthey're gone, then lets him go.\n\n<b>\t\t\t\t  JOE\n</b>\t\tSorry, ma'am, I thank you for dinner. \n\t\tIt was very good.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDid Grace try to ride, Joe?\n\n<b>\t\t\t\t  JOE\n</b>\t\t\t(hesitates)\n\t\tI expect you should talk to Grace about \n\t\tthat, ma'am. And if I did anything \n\t\twrong, then I am sorry.\n\n\tEver the gentlemen, Joe exits. Annie looks to Tom. He's about \n\tto leave, when he stops and says:\n\n<b>\t\t\t\t  TOM\n</b>\t\tDon't let her turn you away.\n\n\tTom exits.\n\n\tAnnie stands and faces Grace's closed door. Slowly, she \n\tlowers herself to her knees and sits on them, thinking... \n\treminiscent of Tom, waiting for his moment with Pilgrim, in \n\tthe field.\n\n<b>\tINT. CREEK HOUSE, GRACE'S ROOM - LATER THAT NIGHT\n</b>\n\tWe don't know how long Annie waited, but she knocks gently, \n\tthen enters to find Grace, in her nightgown, on her bed, with \n\tthe night stand light on. Her prosthesis is against the wall.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace? Is everything all right?\n\t\t\t(no answer)\n\t\tCan we talk?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tAbout what?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell...\n\t\t\t(nervous)\n\t\tSo you tried riding again?\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(snotty)\n\t\tYeah. Does that mean I'm cured?!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHoney, nobody's trying to cure you --\n\n<b>\t\t\t\t  GRACE\n</b>\t\t... You worried everything all right \n\t\tnow and we'll have to go home?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat are you talking about?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYou... not wanting to go home because \n\t\tyou hate daddy so much.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGrace, I don't hate your father.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI can't remember the last time you \n\t\tmade him dinner.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI was just trying to say thank you to \n\t\tDiane and Frank and --\n\n<b>\t\t\t\t  GRACE\n</b>\t\tTom?\n\n\tAnnie sits by the bed, Grace moves away a little.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLook, I just wanted to say, I think \n\t\tit's great you're riding again. \n\t\tAnd... and I think I know why you, \n\t\tyou needed to do it alone... without \n\t\tanyone knowing...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYeah, you know everything!!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSTOP IT! Why can't I talk to you!!\n\n<b>\t\t\t\t  GRACE\n</b>\t\tNO, YOU STOP IT! Stop pretending like \n\t\tyou care! Like this really isn't about \n\t\tyou and Tom.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(angry)\n\t\tWHAT?! How can you --\n\t\t\t(at a loss)\n\t\tI'm sorry if my friendship with Tom \n\t\tbothers you so much, but I happen to \n\t\tvalue having someone to talk to, \n\t\tespecially when my own daughter \n\t\tignores me night and day because no \n\t\tmatter what I say, it's wrong and no \n\t\tmatter what I do, it's wrong... I'm \n\t\tsorry I'm such a disappointment to \n\t\tyou.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWell, now you know what it feels like.\n\n\tBeat.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't deserve that. I have never \n\t\tlooked at you as a disappointment. If \n\t\tI'm on your back to do better, if I \n\t\tpush you to try harder it's because \n\t\tI want you to be the best you can be.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tFOR YOU! Because I'm your daughter \n\t\twhich means you're the best mother! \n\t\tIsn't that what you're always talking \n\t\tabout in interviews -- having it all, \n\t\tthe great career, the great family... \n\t\tProving everybody wrong. Wanting \n\t\teverybody to think you're this perfect \n\t\twoman!\n\n\tBeat. They're both exhausted.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tListen, if... if there's a part of you \n\t\tas parent that... that takes pride in \n\t\tyour child -- that, you can look at \n\t\tthem and see something you've \n\t\taccomplished as well... if that's wrong, \n\t\tthen I'm sorry.\n\t\t\t(no answer)\n\t\tBut it wasn't my intention. I don't push \n\t\tfor me. I do it for you... So you don't \n\t\twaste half your life feeling like you \n\t\tdon't know where you belong.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tYeah, well, you've done a great job.\n\n\tBeat. Annie feels deeply hurt.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, then I do apologize... But what \n\t\tI'm most sorry for is turning you \n\t\tinto a spoiled brat who can only \n\t\tthink about what she's feeling... who \n\t\tcan't admit when she's wrong and who \n\t\tcan't forgive when she's not.\n\n<b>\t\t\t\t  GRACE\n</b><b>\t\tLEAVE ME ALONE!!\n</b>\n\tAnnie stops to exit as Grace says something under her breath. \n\tAnnie stops.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat did you say?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI said... I started.\n\n\tGrace starts to sob. Annie doesn't understand.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tStarted what?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tMy period.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(softer)\n\t\tWhen? Tonight?\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(nods)\n\t\tI felt it happen downstairs and when \n\t\tI went into the bathroom.\n\n\tAnnie reaches down to touch Grace's shoulder. Grace turns -- \n\tthere is no anger in her face. Annie sits and takes her in \n\ther arms. Grace clings to her and sobs like a little girl. \n\tAnnie sees tears run -- gratefully, lovingly.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWho's going to want me now?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat?... Oh baby...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWho's ever going to want me? Nobody \n\t\twill.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThat's not true.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhy should they?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tBecause you are... one of the most... \n\t\tincredible, bravest, most beautiful \n\t\twoman I have ever met. The efforts \n\t\tyou make. Your courage and your \n\t\tdignity.\n\t\t\t(laughs thru tears)\n\t\tI don't know where you got it? I \n\t\thonestly don't know how I would have \n\t\thandled all this if I were you.\n\n\tGrace is so grateful, they cling to each other even harder. \n\tAs the tears subside, Grace manages to admit...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI'm sorry... about what I said. It's \n\t\tjust that -- all those times you \n\t\tand Daddy were trying for another \n\t\tkid, I... I used to pray at night that \n\t\tit would work. And not because of \n\t\tyou guys or that I wanted a brother \n\t\tor sister... but... just so I wouldn't \n\t\thave to be...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tSo special. Because I was the only \n\t\tone. You both wanted me to be so \n\t\tgood at everything, so perfect and \n\t\tI wasn't. I was just me. And now I've \n\t\tcompletely ruined everything, \n\t\tanyway...\n\n\tThey both start crying again as Annie rocks her gently.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSshhh... Ssshhhh...\n\n\tThey hold each other as if for dear life...\n\n\tLATER -- CAMERA PANS to discover mother and daughter, fast \n\tasleep, in each other's arms.\n\n<b>\tINT. TOM'S ROOM, RANCH HOUSE - NIGHT\n</b>\n\tTom sits alone, writing at his desk. His music is playing. \n\tHe stops to look out the window overlooking the Creek House.\n\n\tAnnie and Grace fell asleep with the lights still on in the \n\tliving room.\n\n\tTom is thinking of Grace and Annie -- wondering what happened \n\tafter he left... conflicted by what he feels for Annie... And \n\tremembering why they're here in the first place...\n\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\tINT. CREEK HOUSE - NEXT MORNING\n</b>\n\tThe phone rings, awakening Annie first, then Grace.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHello?\n\n<b>\t\t\t\t  OPERATOR (V.O.)\n</b>\t\tHello, this is ATT Conference Service. \n\t\tIs this Annie MacLean?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYes.\n\n<b>\t\t\t\t  OPERATOR (V.O.)\n</b>\t\tI have a conference call scheduled for \n\t\tyou with Mr. Gottschalk and Mr. Farlow.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(remembering)\n\t\tOh. Oh, yes. One moment, please.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWho is it?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tUh, nothing. I'm going to pick it up \n\t\tin the other room -- would you hang \n\t\tthis up for me?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tSure.\n\n\tAnnie moves to the other room, sits down at her office space, \n\ttakes a breath, then picks up, yelling to Grace;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOkay, Grace...\n\t\t\t(click)\n\t\tOperator?... I'm ready.\n\n<b>\tEXT. RIDING ARENA - LATER THAT MORNING\n</b>\n\tAnnie and Grace are standing by the arena fence. Frank, Joe \n\tand the Twins are sitting on the fence rail. Joe is holding a \n\tsaddle and a bridle, standing in some shadows in an empty \n\tarena. Pilgrim comes running into the ring. Out of habit, he \n\tstarts circling the ring. He sees Tom holding a saddle. \n\tPilgrim walks towards him. Curious, he stops, looking at him. \n\tTom puts the saddle down, sitting crossways on it. Pilgrim \n\twalks towards him again. He stops, looking at Tom again. Tom \n\tjust sits there, playing with the bridle. Pilgrim walks \n\taround him. Tom doesn't show him any interest. Pilgrim comes \n\tcloser. He looks at the saddle. He runs off. He stops, \n\tlooking back. Tom just sits. Pilgrim walks back over. Tom \n\tstands and shows him the bridle. Pilgrim comes closer, \n\tsniffing it. He rubs his nose against the leather. Tom pats \n\this head. Then, in one quick, but deft motion, he puts the \n\tbridle on him. Pilgrim tosses his head, but it doesn't seem \n\tto bother him. Grace and Annie watch intently. Tom takes the \n\treins, walking Pilgrim around the ring. He walks him to the \n\tsaddle. Pilgrim paws at it with his hoof. He turns and runs \n\toff. Tom lets him go. Pilgrim runs around the ring, slows \n\tdown, looks over at Tom. Tom picks up the saddle. Pilgrim, \n\tcautiously, comes back over. Tom, with the saddle, walks away \n\tfrom him. Pilgrim, again curious, follows him. He nudges Tom. \n\tTom stops. Pilgrim comes around to take a good look at the \n\tsaddle. Tom rubs his back. And gently, like laying down a \n\tsheet, puts the saddle on his back. Pilgrim shuffles slightly \n\tat the touch. Tom quickly cinches it. Taking up the reins, he \n\twalks Pilgrim around the ring again. He starts to jog. \n\tPilgrim jogs with him. And in the middle of the jog, Tom \n\tgrabs onto the saddle horn, and without breaking his stride, \n\tpulls himself back up onto his back. He lays across the \n\tsaddle, letting Pilgrim feel his weight. He sits up, and \n\twithout letting him break his stride, he urges Pilgrim with \n\this thighs, keeping him in the jog, riding around the ring.\n\n\tGrace and Annie cheer. Tom tips his hat to them...\n\n<b>\tINT. THE BARN - DAY\n</b>\n\tGrace is cleaning stalls, etc... She exits one of the stalls \n\twith a pail and stops -- looking down the barn to where she \n\tknows Pilgrim is. She places the pail down and gathers her \n\tcourage. She walks to Pilgrim's stall. She stands motionless \n\tfor some moments before she opens the doors and enters...\n\n\tPilgrim steps back a bit. He looks at her. He pins his ears \n\tback. Stomps his feet. Grace is about to turn and leave, but \n\tshe stops herself and remains still.\n\n\tSlowly, she reaches out to touch Pilgrim's head... and he \n\tlets her. We see in Grace a maturity of character, a \n\twillingness to face what she must face... the beginning of a \n\tcompassion, not only for Pilgrim, but perhaps for herself as \n\twell.\n\n<b>\tEXT. DOUBLE DIVIDE - NIGHT\n</b>\n\tA full moon lights the ranch. Tom pulls up to the ranch house \n\tin his truck, parks and gets out. As he walks towards the \n\thouse, he hears:\n\n\tGrace exits the Creek House and coming towards him, a coat \n\tover her nightgown. Tom waits until she reaches him.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI was waiting for you to come back.\n\n\tTom instinctively knows what she wants.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou hungry?\n\n<b>\tINT. RANCH HOUSE, KITCHEN - NIGHT\n</b>\n\tGrace sits at the table. Tom is cooking at the stove. It feels \n\tas if they are the only two people on earth. Grace gets up her \n\tnerve... and begins:\n\n<b>\t\t\t\t  GRACE\n</b>\t\tJudith was telling me about this boy \n\t\tshe really liked. She never even had \n\t\ta chance to tell me his name...\n\n\tShe starts to quietly cry, but it doesn't stop her.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWe were going to go around by the \n\t\trailroad bridge...\n\n\tAnd we see the accident all over again... But this time, a \n\tmovie -- as clear as reality -- but in deathly silence. Just \n\tthe sound of Grace's voice, and her heartbeat...\n\n<b>\tEXT. THE WOODS, CONNECTICUT - EARLY MORNING\n</b>\n\tThe horses are going up the icy path...\n\n<b>\t\t\t\t  GRACE (V.O.)\n</b>\t\tWe were laughing about something, I \n\t\tdon't remember what. Her horse fell...\n\n\tJudith's horse suddenly stumbles on the ice, going down, \n\tthrowing Judith, her foot helplessly caught in the stirrup. \n\tHer horse sliding back down the hill.\n\n\tGrace tries to move Pilgrim to avoid the errant horse, but \n\tit's too late, the horse plows into them, the horses sliding \n\tback down the hillside onto the empty COUNTRY ROAD...\n\n<b>\tEXT. COUNTRY ROAD, CT. - EARLY MORNING\n</b>\n\tPilgrim is first to find his legs. Judith's horse, its leg \n\tbroken at the ankle, walks in a confused state. Judith's foot \n\tis helplessly caught in the stirrup...\n\n<b>\t\t\t\t  GRACE (V.O.)\n</b>\t\t... Judith's foot was caught in the \n\t\tstirrup... she couldn't get up, she \n\t\twas so scared...\n\t\t\t(cries)\n\t\tI saw this truck, coming around the \n\t\tturn...\n\n\tShe sees the glint of the steel. The Truck suddenly appears \n\tfrom around the bend.\n\n<b>\t\t\t\t  GRACE (V.O.)\n</b>\t\t...He was honking, trying to get us to \n\t\tmove... I tried to grab the reins to \n\t\tget Judith's horse out of the way...\n\n\tGrace grabs the reins of Judith's horse. The horses are \n\tspooking...\n\n<b>\t\t\t\t  GRACE (V.O.)\n</b>\t\t...And the truck started skidding...\n\n\tThe truck skidded on the icy road, going out of control, jack-\n\tknifing, heading right for them...\n\n<b>\t\t\t\t  GRACE (V.O.)\n</b>\t\t...It was coming right at us... There \n\t\twasn't any time to do anything... It \n\t\tran right into Judith's horse...\n\n\tThe truck bed plows into Judith's horse...\n\n<b>\t\t\t\t  GRACE (V.O.)\n</b>\t\t...Judith just disappeared... And it \n\t\tcame right at Pilgrim and me...\n\n\tWe see this...\n\n<b>\t\t\t\t  GRACE (V.O.)\n</b>\t\t...And Pilgrim reared up at the truck \n\t\tand I fell off...\n\n\tGrace falls onto the road, the truck running over her.\n\n<b>\tINT. RANCH HOUSE, KITCHEN - NIGHT\n</b>\n\tGrace sobs uncontrollably now.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tJudith... Oh God, Judith. I'm sorry...\n\n\tTom is near and holds her as she puts her head on his chest.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI won't tell you it'll stop feeling \n\t\tthis bad... But I can tell you, you \n\t\tdidn't do anything wrong... The same \n\t\tthing would have happened to me... or \n\t\tFrank... or Joe... And there's no \n\t\tsense in looking for a reason why \n\t\tthings happen...\n\t\t\t(self-reflective)\n\t\tI used to try and... always came up \n\t\tshort. I don't think the why so's \n\t\timportant as... what we do with what \n\t\twe get. I remember this boy I'd see \n\t\tup on the Blackfeet Reservation. He \n\t\twas sixteen. Great kid. Strong. He'd \n\t\tgone swimming and dived headfirst into \n\t\ta rock. Snapped his neck, paralyzed \n\t\thim... After the accident, I'd look \n\t\tin on him from time to time... and he \n\t\twasn't there anymore. His mind, his \n\t\tspirit, whatever you want to call it, \n\t\tit just disappeared. And what was left \n\t\twas nothing but anger... It's like the \n\t\tboy I knew just went away somewhere...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI know where he goes.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI know you do. Don't you disappear.\n\t\t\t(holds her tighter)\n\t\tYou do whatever you have to, to hold \n\t\ton...\n\t\t\t(thinks)\n\t\tI'll tell you one more thing... When \n\t\tPilgrim reared up to face that \n\t\ttruck... you know what I think?... I \n\t\tthink that damn horse loved you so much, \n\t\the was trying to protect you... That's \n\t\twhat I think.\n\n\tGrace listens to this. As Tom holds her in silence, it's \n\talmost as if they were father and daughter...\n\n<b>\tEXT. THE CORRAL - PRE-DAWN\n</b>\n\tTom stands with Grace in the corral. Tom's horse, Rimrock, is \n\tsaddled nearby. Tom takes Grace's cane.\n\n<b>\t\t\t\t  TOM\n</b>\t\tLet me hold that...\n\n\tGrace stands, looking at the horse...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI can't... not yet...\n\n<b>\t\t\t\t  TOM\n</b>\t\tThere's no hurry. Take you time.\n\n\tShe's trying so hard to be brave. After a moment, she reaches \n\tfor the saddle horn. She puts her prosthetic leg in the \n\tstirrup, takes a breath and swings her leg up -- slipping, \n\tfalling to the ground. Tom doesn't say anything. She pulls \n\therself back up. She repeats the action... determinedly. She \n\tswings her leg over again and sits squarely on the horse. Tom \n\tremains still, but proud.\n\n\tAs the day breaks, we leave them in silence -- Tom standing, \n\thands in pocket... Grace sitting up on the horse, proudly.\n\n<b>\tEXT. DOUBLE DIVIDE, THE PASTURE - EARLY MORNING\n</b>\n\tEndless sky. Annie is jogging off in the distance when she \n\tlooks up and stops to see: Tom and Grace, both on horses, \n\tstopped on a rolling hill. They do not see her.\n\n\tAnnie is filled with emotion... pride for her daughter, \n\tgratitude for this amazing man.\n\n\tAs the two ride off into the distance we do a slow:\n\n<b>\t\t\t\t\t\t FADE OUT:\n</b>\n<b>\t\t\t\t\t\tSHOCK CUT:\n</b>\n<b>\tBRIGHT SUNSHINE... CATTLE DRIVE...\n</b>\n<b>\tEXT. THE MOUNTAINS - DAY\n</b>\n\tFrank and Diane, with the Twins, dogs at their heels, ride in \n\tfront of the herd. Behind them, Joe riding alongside Grace. \n\tSmokey and some Hands ride among the herd, keeping them moving.\n\n\tAnd riding behind the herd are Annie and Tom...\n\n<b>\tMONTAGE OF VARIOUS MOMENTS THROUGHOUT THE DAY DURING THE CATTLE \n</b>\tDRIVE... Highlighting, in particular, those in which the rising \n\tsexual tension between Tom and Annie is apparent.\n\n<b>\tEXT. THE MOUNTAINS - NIGHT\n</b>\n\tThe cattle stands in silhouette. We hear singing.\n\n\tEveryone is sitting around a campfire. Frank's playing the \n\tguitar, singing along with Tom. They laugh when a lyric or a \n\tnote goes wrong. Everyone is enjoying it.\n\n\tAnnie, her arms around her knees, sits off by herself. The \n\tsong ends and people applaud.\n\n\tFrank hands the guitar to Hank;\n\n<b>\t\t\t\t  FRANK\n</b>\t\tPlay that sweet one you know. The one \n\t\tmakes my wife here so friendly.\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(slaps his shoulder)\n\t\tYou!\n\n\tHank begins to play and sing a painfully pretty song. His \n\tsweet voice is stark contrast to his gruff, strongman \n\tappearance. Frank offers his hand to Diane, she slaps it away \n\tand laughs, he helps her up and they start to dance. As \n\teveryone watches...\n\n\tJoe stands and offers his hand to Grace;\n\n<b>\t\t\t\t  JOE\n</b>\t\tYou wouldn't want to dance with me, \n\t\twould you?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI don't thinks you'd want me tripping \n\t\tall over you in front of everybody.\n\n<b>\t\t\t\t  JOE\n</b>\t\t\t(sweetly)\n\t\tI wouldn't let happen.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(affectionately)\n\t\tYou know, you're a good kid.\n\n\tJoe smiles and helps her up. They come together and start \n\tdancing.\n\n\tAnnie is watching, holding her breath with gratitude.\n\n\tTom notices Annie off by herself and crosses to her. He \n\textends his hand. She hesitates, looks again to Grace with \n\tJoe, then accepts...\n\n\tHis hand slide to her back. Her hand to his shoulder. They \n\tdance. Their bodies closer than they've ever been. Slowly, \n\tshe leans her head against his body. And surrenders, for the \n\tmoment...\n\n\tDiane sees them. She holds her husband fast, and buries her \n\thead on his neck.\n\n<b>\tEXT. THE MOUNTAINS - DAY\n</b>\n\tMORE CATTLE DRIVE MANTAGE -- Taking Tom and Annie a bit \n\tfurther in their intimacy; perhaps Tom takes extra special \n\tcare to explain things to Annie, or fix her saddle cinch, or \n\tmake her laugh...\n\n<b>\tEXT. THE MOUNTAINS - EVENING\n</b>\n\tThe cows stands in the pasture, grazing. Annie and Diane are \n\tcleaning some pots and pans in the stream.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tMust be nice for you to take a few \n\t\tdays off from your work, huh?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWell, I have more than a few days, ha, \n\t\tha... I uh... I'm sort of... not an \n\t\teditor anymore... right now... First \n\t\ttime I've said it out loud.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tThey fired you?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo, it's more like a leave of-\n\t\t\t(stops)\n\t\tHa, ha, ha. Yeah, they fired me.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tYou don't seem to upset?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDelayed shock. Or maybe not. I know \n\t\tI could talk my way back if I wanted \n\t\tor... go to another magazine, \n\t\tsomeplace... Just not sure if I want \n\t\tto.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tGuess you don't have to figure it out \n\t\tuntil you go home.\n\n\tThis phrase \"go home\" stings Annie -- though Diane said it \n\tinnocently.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tDid you always know this was the life \n\t\tyou wanted?\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI fell in love. After that, I never \n\t\tthought about being anything but a \n\t\trancher's wife. I never saw it like I \n\t\twas losing some other life, just felt \n\t\tlike I was gaining one. I know that's \n\t\tnot a popular opinion nowadays and I \n\t\tain't saying it's the right one. We \n\t\tall have to find the life meant for us.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tFrank's a good man.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tThey don't come better. But I don't \n\t\tdeny there are times I wonder about \n\t\tthings I won't have. Maybe one day I'll \n\t\tget to see Egypt. Maybe not. But I know \n\t\tif you try too many different lives, \n\t\tyou can wind up with no life at all...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tSounds like something Tom would say.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tYes, it does.\n\n\tAnnie and Diane resume washing the dishes in silence. Annie \n\tdeep in thought. Until Diane stops. After a beat, Annie \n\tnotices.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat?\n\n<b>\t\t\t\t  DIANE\n</b>\t\tAnnie, I'm not good at this kind of talk \n\t\t-- goes round and round a thing but \n\t\tnever comes to it -- so let's just say \n\t\twhat it is. When you first came here, \n\t\tI didn't like you and I was worried. Tom \n\t\tmeans a lot to me and this family. Don't \n\t\tgo looking here for whatever you looking \n\t\tfor. Don't make that man go through \n\t\tsomething it took him a long time to see \n\t\this way clear out of the first time.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't think anybody can make Tom do \n\t\tanything he didn't want.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tHe's a good man, Tom is. He's got a \n\t\tgift, come from heaven above, I swear. \n\t\tBut he's still a man. And a woman can \n\t\tlead a man into the middle of a mountain \n\t\tlake -- and still make him think he's on \n\t\tdry land.\n\n\tDiane's words ring in Annie's head.\n\n<b>\tEXT. THE MOUNTAINS - DEAD OF NIGHT\n</b>\n\tDead in stillness. The cattle dark and motionless. Everyone \n\tasleep in bedrolls around the pasture.\n\n\tAnnie awakens, looks up at the moon, watching it go in and \n\tout of the clouds. She looks over to sleeping Grace... Then \n\tlooks to where Tom is -- and sees his sleeping bag is empty. \n\tQuietly, she rises and looks for him.\n\n\tShe starts across the grass and sees him crossing on his \n\thaunches, wearing a slicker, sitting in the grass by the \n\tstream, drinking some water. She watches him.\n\n\tTom senses something and turns. For a moment, they just look \n\tat each other -- half disbelieving the inevitable is so close \n\tat hand. Annie approaches as Tom rises.\n\n\tThey meet. They kiss. Tentative at first, but more, just to \n\tmake that very, precious first moment of discovery last as \n\tlong as it can. The kiss grows more passionate. They begin to \n\tlose themselves in each other.\n\n\tUntil, suddenly, aware of their surroundings, they part. No \n\twords. Their expressions to each other tell all. Annie \n\tseparates herself and goes back to her bedroll... Tom stands \n\tin the grass, by the stream... the moving water, the night's \n\tonly sound.\n\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\tEXT. DOUBLE DIVIDE - DAY\n</b>\n\tThe cattle drive returns. Tom, Annie, Grace, et al... are on \n\ttheir horses, heading back towards the ranch when Grace sees \n\tin the distance;\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDad?\n\n\tAnnie looks up and sees:\n\n\tPOV -- ROBERT has come to the ranch. He is waiting for them \n\twith his luggage beside a rental car... standing out like an \n\tLike The Man In The Gray Flannel Suit in the middle of \n\tWyeth's \"Christina's World.\"\n\n<b>\tEXT. RANCH HOUSE - DAY\n</b>\n\tEveryone is being introduced to Robert, as Grace hugs him \n\tfrom the side, never letting go of him. Frank, Diane -- who \n\tintroduce their kids, then Tom and Robert shake hands...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThis is Mr. Booker, Robert.\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(extends hand)\n\t\tTom.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHi. It's a pleasure. I'm very grateful \n\t\tfor the way you took in my girls here. \n\t\tI bet you were surprised when they \n\t\tjust showed up out of nowhere.\n\n<b>\t\t\t\t  TOM\n</b>\t\tOh yeah...\n\n\tLaugh. Awkward silence...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWell I uh... I can already see a change.\n\t\t\t(hugging Grace)\n\t\tAnd I'm very grateful to you.\n\n\tRobert is so sincere -- in that openly, modern, \"express your \n\tfeelings\" kind of way. Tom just nods.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDid you notice -- no cane?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI know. Amazing.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tCan we show him Pilgrim, Tom?\n\n<b>\t\t\t\t  TOM\n</b>\t\tOh, we're gonna show your dad plenty. \n\t\tWhy don't you all get settled in and \n\t\twe'll do the tour. Excuse me.\n\n\tAs Tom walks away, a nervous Robert feels compelled to say:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tSee you later!\n\n\tTom just nods and keeps walking. Annie and Robert face each \n\tother for a beat.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLet's bring your bags inside.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWait till you see this -- we have the \n\t\twhole house to ourselves...\n\n\tThe MacLean walk to the Creek House.\n\n<b>\tEXT. DOUBLE DIVIDE - DAY\n</b>\n\tIn the distance, we see the pick-up truck parked out in the \n\tpasture. Tom is standing with Robert -- in jeans, now -- and \n\tGrace, telling Robert about the ranch. Robert has his arms \n\taround Grace, asking questions, interested in everything... \n\tGrace is loving being with her two favorite men...\n\n<b>\tEXT. RANCH - DAY\n</b>\n\tGrace waits in the truck as Tom leads Robert through the cows \n\tand cowshit, climbs up and hops over a wood fence. Robert \n\tfollows suit -- not as gracefully -- and gets a splinter...\n\n<b>\tINT. RANCH KITCHEN - DAY\n</b>\n\tDiane is busy in the kitchen when Annie enters.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIs there anything you need? I'm going \n\t\tfood-shopping.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tWell, I am going to go after lunch.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo, no, I'll go -- just give me a \n\t\tlist.\n\n\tAnnie is determined. She needs to be by herself for a bit.\n\n<b>\tEXT. ANOTHER PART OF THE RANCH - DAY\n</b>\n\tTom continues his tour as the dogs run about them. Tom pays \n\tthe dogs no attention, except to bark an order. Robert, \n\thowever, engages with them -- picking up a stick and throws \n\tit. A dog returns and gives it back. Robert kneels and begins \n\trubbing the dog's fur, talking to it, looking like an \n\tanachronism in his baggy jeans with designer cowboy belt and \n\tspanking new designer cowboy boots.\n\n\tTom waits patiently for Robert, who... and carries on with \n\tthe dog a bit too long. When Robert gets up, he habitually \n\tbrushes the dirt off his jeans, maybe even his boots, and \n\tmakes sure his outfit is hanging properly.\n\n<b>\tINT. BARN - DAY\n</b>\n\tGrace is in the stall with Pilgrim. Once again, close enough \n\tto touch him, which he allows.\n\n\tOutside the stall, stand Robert and Tom. Robert squeezes his \n\tsplinter...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI can't believe it's the same horse.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWe still have a way to go.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHow much longer do you think?\n\n\tTom understands this man wants his family back.\n\n<b>\t\t\t\t  TOM\n</b>\t\tWell, like I told your wife, it's \n\t\treally up to Pilgrim.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI understand...\n\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\tINT. KITCHEN - EARLY MORNING\n</b>\n\tEveryone is seated around the table, eating, talking, laughing. \n\tGrace is right by her father's side. Frank's in the middle of \n\ttelling Robert:\n\n<b>\t\t\t\t  FRANK\n</b>\t\tWe thought we lost him in the snow \n\t\tstorm... Told the kids. Had a funeral \n\t\tfor the damn thing. Finally, snow \n\t\tstops. Staring to warm up. I go out \n\t\tand start cleaning the truck... \n\t\tGoddamn if that dog doesn't jump out \n\t\tfrom the back seat covered in snow... \n\t\tI nearly stained myself.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHe thought it was a ghost.\n\n<b>\t\t\t\t  JOE\n</b>\t\tA dog ghost!\n\n\tLaughter all around.\n\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\tEXT. RANCH HOUSE - NIGHT\n</b>\n\tEveryone is outside enjoying the night after a long day.\n\n\tDiane and Annie are on the porch. Diane is showing Annie how \n\tshe does her needlepoint. Annie is genuinely interested.\n\n\tTom and Frank and Robert are sitting out front. Grace is at \n\tRobert's feet. Joe sits on the ground in front of his father, \n\topposite Grace.\n\n<b>\t\t\t\t  TOM\n</b>\t\tIs the poverty worse, now, you \n\t\tthink?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI haven't been back in over twenty \n\t\tyears, but I wouldn't be surprised. \n\t\tThe population's larger.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tWhat were you doing over in India?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tUh, this was right after college. I \n\t\twas in the Peace Corps.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tThat right?\n\n\tBack on Diane and Annie, who hear the laughter O.S. and look. \n\tDiane smiles, seeing how much Grace is enjoying her dad.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tShe sure loves her daddy, huh?\n\n\tAnnie smiles and looks herself. Yes, she does, she thinks. Why \n\tcan't I?\n\n\tBack to the others. Everyone is very interested in Robert's \n\tstories... especially Tom.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t... and I thought before I settled \n\t\tinto law school -- everybody knew that \n\t\twas the plan -- I'd take this time for \n\t\tmyself.\n\n\tGrace rises to go to the Creek House.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tAnd I tell you, Frank, it was one of \n\t\tthe --\n\n\tAs Grace passes by, she stumbles a bit and Robert habitually \n\trises to help, but Grace ignores him and rights herself, \n\tcontinuing. Robert quickly sits back down, continuing.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t... one of the uh... greatest times \n\t\tof my life... I had experiences that, \n\t\tI think, changed my outlook forever. \n\t\tI came back a different person, \n\t\tliterally.\n\n\tTom listens with great interest and respect.\n\n\tBack to Diane and Annie, who watch as Joe follows Grace.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI think I'm going to have my hands \n\t\tfull with the son of mine when you \n\t\tleave. Just might be his first \n\t\tbroken heart.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, how sweet.\n\n\tA burst of laughter pulls their attention to the group -- \n\tRobert is now standing, acting out a story.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t... and I have no idea what he's \n\t\tsaying because I don't understand \n\t\tHindu...\n\n\tEveryone is listening, with big expectant smiles. Annie \n\twatches -- having heard this story before. Her eyes gradually \n\tshift to Tom, who is enjoying the story.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t... So, finally I'm trying to explain \n\t\tto him that I'm allergic to wool and \n\t\twould he please get his sheep out of \n\t\tmy car --\n\n\tLaughter. Robert continues, giving a quick look to Annie -- \n\twho is looking at Tom... Robert lets it go, continuing his \n\tstory.\n\n<b>\tINT. CREEK HOUSE - NIGHT\n</b>\n\tGrace is asleep. Robert sits by her bed, lit by the moon \n\tthrough a window. He stares at this creature he loves so \n\tmuch. He rises and enters Annie's room.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tTired?\n\n\tAnnie shrugs. Robert looks at the bed. He teases.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tSmall bed. Maybe I should sleep in \n\t\tthe barn.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(teases back)\n\t\tYou're allergic to hay.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(smiles)\n\t\tI apologize for the surprise, but the \n\t\tdays only opened yesterday and I \n\t\tfigured...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou don't have to explain. You have \n\t\tevery right to come.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI can see why you put your faith in \n\t\thim. He's a genuine... good guy... \n\t\tGood at what he does. That's rare.\n\n\tAnnie nods. She tries to hide her discomfort. Robert sits on \n\tthe bed before her.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tYou were right about coming here. I'm \n\t\tsorry for not thinking...\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tNo, it's okay. Believe me, there were \n\t\tplenty of times I didn't know what \n\t\tthe hell was right.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHow are you feeling about work?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLet's not talk about that now.\n\n\tAnd they're quiet. He moves to kiss her. It's awkward. They \n\tlook to each other -- as they try to remember how to make love \n\ttogether...\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI feel like I'm on a first date.\n\n\tAnnie smiles sympathetically.\n\n<b>\tEXT. BARN DANCE, HANK'S RANCH - DUSK\n</b>\n\tCars and pick-up trucks haphazardly parked along a dirt \n\troad... Smoking open grill barbecues. Ranchers and families \n\tmove about the ranch, sit and eat at picnic tables with \n\tgingham tablecloths... Some teenagers hanging around the \n\tcorral, talking. Diane and some other women, eating and \n\ttalking... Frank with a group of men, drinking beer, telling \n\tstories.\n\n\tA BAND has been set up by the barn. People are dancing under \n\tthe harvest moon. Grace is dancing with Joe... Tom is dancing \n\twith a local woman... Annie with a rancher... Everyone is \n\thaving a good time...\n\n\tRobert is enjoying a smoke with some men. He looks over to \n\tthe dance floor and smiles when he sees Grace and Joe.\n\n\tJoe and the Rancher trade place... Joe dances with Annie, the \n\tRancher with Grace... But Tom sees his chance and switches \n\twith the Rancher so that he can dance with Grace... She is \n\tthrilled and he guides her effortlessly across the floor.\n\n\tJoe and Annie are interrupted by another couple. Joe switches \n\tpartners, but Annie smiles and excuses herself -- she wants to \n\trest.\n\n\tRobert continues talking with some of the men. He puts out \n\this smoke and looks over to the dance floor. He sees Grace now \n\tdancing with Tom... His eyes search for Annie. He moves away \n\tfrom the men until he sees, from a distance;\n\n\tAnnie, sitting by herself, amidst the crowd... No one would \n\tnotice her unless they were looking for her... But Robert does \n\t-- and what he sees is Annie looking at Grace and Tom... then, \n\tonly looking at Tom... Smiling to herself gently... Watching \n\this every move. Suddenly, she rises and exits out of the barn \n\tto get some air.\n\n<b>\tEXT. HANK'S RANCH - NIGHT\n</b>\n\tAnnie finds an isolated spot, behind the main house, to be by \n\therself and catch her breath.\n\n<b>\tINT. BARN - NIGHT\n</b>\n\tTom and Grace continue dancing. She's in heaven. Robert \n\tapproaches and Tom quickly allows him to take over. Grace \n\tloves the attention from both men. As they dance off, Tom \n\tcrosses the dance floor and is met by Hank's wife;\n\n<b>\t\t\t\t  HANK'S WIFE\n</b>\t\tOh Tom, would you check the shed and see \n\t\tif there's anymore chairs.\n\n<b>\t\t\t\t  TOM\n</b>\t\tSure.\n\n<b>\tEXT. HANK'S RANCH - NIGHT\n</b>\n\tTom is walking along when he turns the corner of Hank's house \n\tand finds;\n\n\tAnnie sitting alone, staring up at the night. They see each \n\tother. From behind the house, no one else can see them.\n\n\tIt is as if the fates brought them face to face and alone. \n\tWithout any will to stop it, they embrace and kiss \n\tpassionately. But when they look into each other's eyes, \n\tthere is no joy in the kiss. Tom releases her and walks away, \n\theading for the shed. Annie quickly pulls herself together \n\tand enters the main house through the back door.\n\n<b>\tINT. DOUBLE DIVIDE RANCH, KITCHEN - NIGHT\n</b>\n\tDiane is once more sitting at the kitchen table, looking over \n\tsome bills before bed. Her tape player is on softly. Tom \n\tenters and crosses to the sink to get a glass of water.\n\n\tDiane looks up, seeing Tom with his back to her -- standing at \n\tthe sink, filling his glass -- staring out the window over the \n\tsink. She looks to the dish of brownies on the table.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tI have some brownies left over. Want \n\t\tone?\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(w/o turning around)\n\t\tNo thanks.\n\n\tDiane senses an uneasiness in Tom. She looks as he drinks his \n\twater.\n\n\tMEDIUM CLOSE-UP ON TOM'S BACK, as if from Diane's POV.\n\n\tBut when we pull back we find ourselves;\n\n<b>\tINT. BARN - NIGHT\n</b>\n\tTom is standing in front of Pilgrim's stall. He opens the \n\tdoor. They look at each other. He strokes him and begins to \n\twhisper;\n\n<b>\t\t\t\t  TOM\n</b>\t\tThere's something you have to do \n\t\ttomorrow, boy...\n\n\tCamera gently moves away... and Tom whispers to Pilgrim what \n\tmust be done...\n\n<b>\tEXT. THE RIDING ARENA - DAY\n</b>\n\tThere's a stillness. A sense of import. Annie, Robert, Frank, \n\tDiane, Joe and Smokey, are all at various spots along the fence.\n\n\tGrace stands inside the ring. Tom is standing beside Pilgrim \n\tin the middle of the ring. Pilgrim is bridled and saddled. \n\tTom adjusts he stirrup. He walks over to Grace...\n\n<b>\t\t\t\t  TOM\n</b>\t\tAll set?\n\n\tGrace swallows hard, nodding. She's worried...\n\n<b>\t\t\t\t  TOM\n</b>\t\tSure?\n\n<b>\t\t\t\t  GRACE\n</b>\t\t\t(softly)\n\t\tSure.\n\n\tTom puts his arms around her shoulders and walks out to \n\tPilgrim. The horse pricks up his ears as they approach. Tom \n\tmotions Grace to stop a short distance from Pilgrim so as not \n\tto crowd him. Tom walks over alone, reaching to gently take \n\thold of him. Holding him by the bridle, he puts his head \n\tbeside Pilgrim's, quietly speaking to him, soothing Pilgrim's \n\tneck with his other hand...\n\n\tAnnie and Robert are fascinated. Anxious.\n\n\tPilgrim never takes his eyes off Grace. Tom tries to ease him \n\tforward. Pilgrim resists, lifting his head and looking at \n\tGrace so you can see the white at the top of his eye. Tom \n\tturns him away, walking him in circles, trying to calm him. \n\tHe leads him back to Grace. Pilgrim tosses his head and \n\tstomps his feet.\n\n\tRobert grows more anxious. Annie is calmer, more focused.\n\n\tTom climbs up on him, riding him around the arena in an easy \n\tlope. Grace watches them go round the ring. She looks at her \n\tparents and tries to smile. They try as well.\n\n\tTom dismounts and leads Pilgrim back to Grace. Pilgrim balks \n\tagain, violently throwing his head, kicking... Grace's \n\tshoulders slump, she presses her hands in her pockets, \n\tfighting not to cry...\n\n<b>\t\t\t\t  TOM\n</b>\t\tSmokey...\n\n\tSmokey climbs over the rail into the ring as Tom says something \n\tto him. Meanwhile Frank reassures Grace:\n\n<b>\t\t\t\t  FRANK\n</b>\t\tHe'll be okay, Grace. Just you hang \n\t\ton there a minute or two. Tom'll get \n\t\thim, okay, you'll see...\n\n\tSmokey jogs over to the gate, climbing it, and disappearing \n\tinto the barn. Tom crosses to Grace.\n\n<b>\t\t\t\t  TOM\n</b>\t\tThere's still something going on \n\t\tinside of him I can't reach. So me \n\t\tand Smokey here, we're going to \n\t\ttry laying him down. Okay?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat does that mean?\n\n<b>\t\t\t\t  TOM\n</b>\t\tIt's more or less how it sounds. \n\t\tSometimes it's not pretty to watch. \n\t\tSome horses fight it real hard. \n\t\tYour fella's already shown us he \n\t\tlikes a good fight. So if you don't \n\t\twant to watch, I'll call you when it's \n\t\tdone.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI want to watch.\n\n\tSmokey re-enters the ring, carrying some rope. He talks \n\tbriefly to Tom. Pilgrim, sensing something, turns and runs to \n\tthe far side of the ring. Tom, his arms spread, walks over \n\tto him, keeping him by the fence. Tom takes him by the \n\tbridle. Smokey comes beside him. Tom unhitches the bridle and \n\tin its place slips a rope halter Smokey passes to him. \n\tSmokey then hands him two long ropes, one at a time. Tom \n\tfastens one under the halter and ties the other to the saddle \n\thorn. Tom asks Smokey.\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou got that soft rope?\n\n\tSmokey hands it to him. Tom quietly talks to Pilgrim, runs \n\this hand down Pilgrim's left foreleg and lifts his hoof. \n\tPilgrim slightly shifts. And when he's still, Tom slips the \n\tloop at the end of the soft rope over the hoof making sure \n\tit's snug. And taking the other end of the rope, he hoists the \n\tweight of Pilgrim's raised hoof and ties the rope to the \n\tsaddle horn. Pilgrim stands on three legs -- an explosion \n\twaiting to happen. Tom moves away from Pilgrim, taking the \n\thalter line from Smokey. Pilgrim, trying to move, finds he's \n\tcrippled. Scared, he lurches, hopping on his right foreleg. \n\tSeeing he can't walk, panicked, he tries to run. Tom and \n\tSmokey, brace themselves, lean back on their ropes and force \n\thim around them in a tight circle. He goes around and around \n\tlike a crazed rocking horse with a broken leg. Tom looks over \n\tand sees Annie has left Robert outside the ring to stand by \n\tan anguished Grace -- her hands on her shoulders, gripping \n\ther. Robert watches, feeling too much a foreigner...\n\n<b>\t\t\t\t  GRACE\n</b>\t\tWhat is he doing this?\n\n<b>\t\t\t\t  FRANK\n</b>\t\tIt'll be OK, Grace.\n\n\tBut even Frank isn't so sure. Pilgrim, covered in sweat, \n\tstill circles. As he runs, his hobbled foot jabs at the air, \n\ttrying to find peace. He runs and runs as Tom and Smokey lean \n\ton the ropes -- until he can't run any more and stops. Tom and \n\tSmokey let the lines go slack. Pilgrim, stands there, his wet \n\tsides heaving, panting like an asthmatic, making loud rasping \n\tsounds. Tom and Smokey speak. Smokey hands him his rope. \n\tTurning, he gets a coiled lasso out of the sand. He swings \n\tthe rope in a wide loop and makes it fall over Pilgrim's \n\tsaddle horn. He pulls it tight. And he takes the other end of \n\tthe rope to the far side of the fence and ties it in a quick \n\trelease knot to the bottom rung. Coming back he takes the \n\tother two lines from Tom. Tom crosses to the rail. He starts \n\tputting pressure on the rope. Pilgrim feeing it, braces \n\thimself. The pressure tilts the saddle hold downward.\n\n<b>\t\t\t\t  FRANK\n</b>\t\t\t(to Grace and Annie)\n\t\tHe's trying to get him to go down \n\t\ton his knees...\n\n\tPilgrim fights. Tom pulls on the rope. Pilgrim, slowly, \n\tbegrudgingly, gives ground. Tom, brings him to his knees, \n\tbut it is short lived. Pilgrim is muscling his way back to \n\this feet. Tom pulls him down to his knees again. Pilgrim, \n\tfighting with every bit of strength, slowly gets to his feet \n\tagain. But the pressure Tom is putting on the saddle is too \n\tstrong and relentless and finally Pilgrim goes down on his \n\tknees and stays down. Yet Tom keeps the pressure on... Tom \n\tshouts to Smokey.\n\n<b>\t\t\t\t  TOM\n</b>\t\tDrop the lines and come help me...\n\n\tSmokey, dropping the line, runs over. They both pull on \n\tthe saddle rope.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tThat's enough! Stop it!\n\n\tPilgrim snorts and foams at the mouth, fighting. But \n\tslowly, like a wounded bird, she starts giving in. He \n\trolls over on his side and lays his head in the sand and \n\tis still. It seems like a total, humiliating surrender. \n\tGrace starts to sob, burying her face in Annie's chest. \n\tRobert feels impotent to help.\n\n<b>\t\t\t\t  TOM\n</b><b>\t\tGRACE!\n</b>\n\tTom and Smokey stand over the fallen horse like two big \n\tgame hunters at the carcass of a kill.\n\n<b>\t\t\t\t  TOM\n</b>\t\tGRACE! Will you come here, please!\n\n\tGrace shakes her head \"NO.\" Frank motions to Annie for \n\ther to let Grace go... to let stand alone... We see \n\tthat it's not easy for Annie to trust this, but she does. \n\tAnd she steps back to where Robert stands...\n\n\tTom, his face set, walks toward Grace...\n\n<b>\t\t\t\t  TOM\n</b>\t\tGrace, I need you to come with me.\n\n\tGrace violently shakes her head \"NO\"... Robert gets up the \n\tcourage to say aloud:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWell maybe she shouldn't be here...\n\n\tAnnie quickly turns to him and says with quick intensity:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tRobert! Let him handle it! Please!\n\n\tRobert can't watch this. He turns and takes a few steps. \n\tJust stops... standing behind and apart from Annie, to \n\tjust watch... slowly becoming transfixed, like someone \n\twho can't stop staring at an accident.\n\n\tTom reaches Grace and puts his hand tenderly on her shoulder...\n\n<b>\t\t\t\t  TOM\n</b>\t\tGrace, I need you to come with me.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tNo, you're only going to hurt him \n\t\tsome more.\n\n<b>\t\t\t\t  TOM\n</b>\t\tHe's not hurt. He's okay. Look at him.\n\n<b>\t\t\t\t  GRACE\n</b>\t\t  \t(turned away)\n\t\tNo!\n\n<b>\t\t\t\t  TOM\n</b>\t\tGrace, Listen... you've got to do this. \n\t\tJust trust me one more time.\n\n\tGrace looks into his eyes and is reminded of all this man \n\thas done for her... and she remembers her trust.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tDo what?\n\n\tTom, prouder of her now than ever before.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI'll show you.\n\n\tTom leads her across the ring, with his arm around her \n\tshoulder. Annie tries to maintain her composure. Robert \n\tremains still and focused.\n\n\tTom and Grace come to Pilgrim, lying in the dirt, his \n\tbreathing plaintive. Tom speaks gently;\n\n<b>\t\t\t\t  TOM\n</b>\t\tI want you to lay down with him. I \n\t\twant you to stroke him. I want to \n\t\tstart with his hindquarters and rub \n\t\thim, feel him all over.\n\n\tGrace is shaking her head \"NO.\" He speaks more firmly.\n\n<b>\t\t\t\t  TOM\n</b>\t\tGrace, you've got to do what I say.\n\n\tGrace knows there's no way out. She takes a breath and slowly \n\tkneels in the dirt beside him, with Tom's help. She lays on \n\thim, rubbing him, his hindquarters, his legs, his side, \n\tsoftly rubbing his neck and the wet silky side of his head.\n\n<b>\t\t\t\t  TOM\n</b>\t\tNow, listen. I want you to stand on \n\t\thim.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat?!\n\n\tTom responds to their voice without looking at them:\n\n<b>\t\t\t\t  TOM\n</b><b>\t\tPLEASE!\n</b>\t\t\t(they stop)\n\t\tGrace, do what I'm telling you. Stand \n\t\ton him... now!\n\n\tGrace obeys him through her tears. She lets Tom take her hand \n\tand guide her up onto the curve of Pilgrim's belly. Then he \n\tlets go. Grace stands there with teas steaming down her \n\tface -- standing on the animal she loved most in the world.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's so cruel.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tNo. He had the choice.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat choice!!?\n\n<b>\t\t\t\t  FRANK\n</b>\t\tEither fight the way things are or \n\t\taccept it.\n\n\tRobert, however, is hypnotized by the event. He is having a \n\tprivate epiphany of sorts.\n\n\tGrace sits in the dirt by Pilgrim and strokes him quietly -- \n\tshe begins talking to him, the way Tom does. Tom watches, as \n\the cautiously steps further away. Pilgrim looks up at Grace \n\tout of the dark pool of his one sad eye. They look at each \n\tother. And we understand there's a connection once more. A \n\tmoment of understanding... and forgiveness.\n\n\tGrace starts to untie his ropes. Smokey is about to stop her \n\tbut Tom shakes \"NO\"...\n\n\tPilgrim, like an infant coming out of the water, breathing \n\tlife for the first time, gets to his feet. Grace and him look \n\tto each other. And all is still.\n\n\tGrace grabs the saddle horn. Pilgrim shuffles as if he's \n\tgoing to bolt. Grace quietly reassures him... She then \n\tcarefully puts her prosthetic leg in the stirrup. Pilgrim \n\tshifts slightly. Annie covers her mouth so as not to scream \n\tout her fear. Robert breaths heavily. They watch as Grace \n\tswings her leg, determined, and pulls herself into the \n\tsaddle. Sitting on his back, Pilgrim tosses his head and \n\tlooks as he's going to run off. But Grace puts her arms \n\taround his neck, and once again, quietly reassures him.\n\n\tShe starts to ride him, slowly, her arms around his neck, \n\ttalking all the while, around the ring.\n\n\tAnnie laughs as she cries -- emotion overwhelming her. Robert \n\tfeels almost numb with fascination, gratitude, confusion...\n\n\tThe slow ride turns into a trot... then a lope... then a \n\tcanter... round and round the ring. Frank and Diane smile. \n\tDiane looks to Tom and knows what he's feeling...\n\n\tTom watches as any father would -- his heart pounding with \n\tpride for the miracle of his child. But he doesn't let on for \n\ta second.\n\n\tGrace brings Pilgrim to a stop, lifts her arms to the \n\theavens, victorious. Everyone cheers. Smokey helps her off \n\tthe horse. She stops to look at Tom, who busies himself with \n\tpicking up the ropes... So she re-focuses on her parents. They \n\trun to each other and embrace... First, she and Annie... then, \n\tshe and her father...\n\n\tBut, as Robert and Grace hold each other and begins to exit, \n\tAnnie manages to make eye contact with Tom... and tell him \n\twith one look, how grateful she is... and how much she loves \n\thim. And he receives it...\n\n<b>\tEXT. DOUBLE DIVIDE - DAY\n</b>\n<b>\tWE FOLLOW THE DAYS AFTER THIS EVENT...\n</b>\n\tWork on the ranch goes on as usual while Tom and Grace keep \n\tnurturing Pilgrim back to life.\n\n<b>\tEXT. PASTURE - ANOTHER DAY\n</b>\n\tGrace and Annie go riding...\n\n<b>\tEXT. MOUNTAIN TRAIL - DAY\n</b>\n\tRobert takes an isolated hike up the mountain until he comes \n\tupon a ridge overlooking an inspiring vista. We can tell \n\tRobert is moved by the sight. Sweaty, tired, he find a place \n\tto sit... to be still... and to consider his life.\n\n<b>\tEXT. THE RANCH HOUSE - DAY\n</b>\n\tFrank's car is parked up for the trip to the airport that \n\twill take the Bookers to Branton, Missouri for Diane's \n\tcousin's wedding...\n\n\tGrace, Annie and Robert are outside saying goodbye to the \n\tBookers; Diane, the Twins... and Joe... Joe awkwardly shakes \n\ther hand... then removes his hat and puts it on her head. \n\tEveryone laughs. They want to hug each other, but don't know \n\tif they would...\n\n\tFrank and Tom are packing the car...\n\n<b>\t\t\t\t  DIANE\n</b>\t\tOh Frank, don't forget the wedding \n\t\tpresent -- it's behind the door in \n\t\tthe laundry room.\n\t\t\t(to Robert and Annie)\n\t\tI got her a pasta maker from the \n\t\tcatalogue... Not that they'll know \n\t\twhat to do with it in Branton, \n\t\tMissouri... Probably use it as a \n\t\tplanter.\n\n<b>\t\t\t\t  FRANK\n</b>\t\tDiane!\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(whispers)\n\t\tFrank's touchy about his cousins.\n\t\t\t(they laugh)\n\t\tWell, it was nice to meet you, Mr. \n\t\tMacLean.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tSame here, Mrs. Booker. Thank you \n\t\tagain for all your kindness.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tAh...\n\n\tDiane turns to Annie. Robert instinctively steps away, saying \n\tgoodbye to Joe and the boys... The two women look at each \n\tother with respect and concern.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tNow, are you sure you want to drive \n\t\tthat horse back yourself? There are \n\t\tplenty of people 'round here who do \n\t\tthat sort of thing.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI already know the way... and it's \n\t\tnot like I have a job I have to rush \n\t\thome for.\n\t\t\t(Diane nods)\n\t\tBetween you and me, I could use the \n\t\ttime alone.\n\n\tDiane understands.\n\n<b>\t\t\t\t  DIANE\n</b>\t\tAnd you'll be all right by yourself \n\t\there,\n\t\t\t(referring to Robert and Grace)\n\t\tafter they've gone?\n\n\tTom hears this bit of info as he passes by with the wedding \n\tpresent and puts it in the truck. Annie makes sure to avert \n\ther look.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tIt's just one night. If I get \n\t\tuncomfortable, I'll go over to \n\t\tHanks.\n\n<b>\t\t\t\t  DIANE\n</b>\t\t\t(double meaning)\n\t\tPromise?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tPromise.\n\n\tDiane just nods, knowingly. She extends her hand. The women \n\tshake.\n\n<b>\t\t\t\t  DIANE\n</b>  \t\tGood luck to you, Annie.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou too, Diane.\n\n\tThey part. Diane starts giving order as she gets in the car:\n\n<b>\t\t\t\t  DIANE\n</b>\t\tAll right, everybody in. Frank, we \n\t\tall set...\n\n\tCamera wides as we hear the voices of departure... see the \n\tMacLeans waving... See Tom off by himself, waving... but \n\tthinking of something else...\n\n<b>\tINT. CREEK HOUSE - NIGHT\n</b>\n\tIn the midst of packing, Annie has made dinner for Grace and \n\tRobert. In the midst of eating, Robert asks:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tShouldn't we have invited Tom over?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI did. He said he had work to do \n\t\tuntil late.\n\n\tAnnie remains silent.\n\n<b>\tEXT. RANCH HOUSE -- NIGHT\n</b>\n\tTom exits with a small, leather satchel. He crosses to his \n\ttruck, tosses in the satchel, gets in and drives off.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. BARN - MORNING\n</b>\n\tGrace enters the barn to say goodbye to Pilgrim.\n\n<b>\tINT. BARN - CONTINUOUS\n</b>\n\tShe moves to his stall and opens the doors. He stands there, \n\twithout any fear of her. She smiles and enters. She wraps her \n\tarm around his neck, pets him and whispers.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tI'll see you home... OK?\n\n<b>\tINT. CREEK HOUSE - DAY\n</b>\n\tEverything is being packed up. Robert is dressed for travel. \n\tAnnie is taping up the boxes containing her computer \n\tequipment.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tAre you going to stay in the city or \n\t\tgo up to Connecticut?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tConnecticut. I told the office I'd \n\t\twork out of there next week. When are \n\t\tyou planning to start back?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tProbably first thing in the morning. \n\t\tIt's too late to start now. I'm going \n\t\tto try not to do too much driving in \n\t\tthe dark.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tMay I have a suggestion?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYeah, what?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tTake your time.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(innocently)\n\t\tWhat do you mean?\n\n\tAnnie looks up from the box to see Robert is calmly staring \n\tat her. His demeanor is different. Something's going on.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tYou look like something's wrong.\n\n\tThis is Robert's moment. He knows it. He takes a breath and \n\thopes it comes out right:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tI'll tell you something, Annie -- I \n\t\tstood there looking at what was \n\t\thappening to that horse... And, I \n\t\tswear, it felt like the same thing \n\t\twas happening to me.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI don't understa-\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t  \t(continues)\n\t\tAnd I have two choices. I can either \n\t\tfight the way things are, or accept \n\t\tthem.\n\t\t\t(Annie waits; he smiles)\n\t\tSee, I always knew I loved you more. \n\t\tDidn't bother me. I always felt \n\t\tlucky... a little amazed... that such \n\t\ta vibrant, beautiful woman would want \n\t\tto be with a man like me... And I \n\t\tguess I thought as long as I did \n\t\teverything right -- if I was the best \n\t\thusband I could be, the best father... \n\t\teven being a good lawyer only mattered \n\t\tto me because of what it meant for \n\t\tus... if I could do all that, it \n\t\twouldn't make any difference if we \n\t\tloved each other the same or not... \n\t\tI wasn't asking for more. I told myself \n\t\tI didn't need more.\n\t\t\t(smiles)\n\t\tBut you don't know how you feel about \n\t\tme. You don't know... if you want a \n\t\tlife with me anymore...\n\t\t\t(bravely)\n\t\tAnd I don't want you to come home \n\t\tuntil you do know...\n\t\t\t(the hard part)\n\t\t... one way or the other.\n\n\tAnnie cannot remember a time when she ever loved her husband \n\tmore than in this moment -- knowing what it took for him to \n\tsay this. She would not disrespect it with denials. Her \n\tthroat is choked with tears, she swallows down. She nods.\n\n\tRobert nods, feeling both pride and heartbreak in the same \n\tmoment. He picks up his bag, kisses her goodbye and exits.\n\n<b>\tEXT. RANCH HOUSE - DAY\n</b>\n\tAnnie and Robert walk towards the car to find Grace, leaning \n\tagainst it -- looking depressed.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat's the matter, honey? Gonna miss \n\t\tPilgrim?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tTom's gone.\n\n\tBoth Robert and Annie are surprised.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tSmokey told me he left last night to \n\t\tlook at some horses in Sheriden. He \n\t\twon't be back for three days. I can't \n\t\tbelieve he didn't want to say goodbye.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(hiding her own distress)\n\t\tWell... honey... you know... that's \n\t\tjust not his way. Maybe you can write \n\t\thim a letter or something. Say thank \n\t\tyou... Don't think about it... You \n\t\ttake care and I'll see you home.\n\n\tShe embraces Grace and, over her shoulder, watches Robert \n\tenter the car. Grace follows suit. The car drives off leaving \n\tAnnie alone at the Double Divide.\n\n<b>\tEXT. CREEK HOUSE - DUSK\n</b>\n\tThe ranch is still. Annie stands on the porch, her arms \n\tfolded, vulnerable, looking at the ranch. All her boxes are \n\tpacked and stacked in the room. She looks over to the Ranch \n\tHouse... to Tom's window.\n\n<b>\tINT. TOM'S ROOM - DUSK\n</b>\n\tA light goes on. Annie enters, cautiously. She's never been \n\tin this room. She crosses to the desk, touches it. She \n\tnotices a tape player and pushes it on. MUSIC PLAYS... She \n\tsees a small framed photo -- of Tom's son, years ago.\n\n\tSuddenly, she feels like an intruder. She shuts the music off \n\tand exits...\n\n<b>\tINT. BARN - DUSK\n</b>\n\tAnnie faces Pilgrim... she gently lifts her hand and caresses \n\this face. He returns her gentleness. Annie is remembering \n\tRobert's words, her heart is heavy with conflict. She jokes:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhy do I get the feeling you know \n\t\twhat I should do, but you're not \n\t\ttelling me?\n\n\tShe hears a truck pull up... Then, a door open and close. Her \n\theart races...\n\n<b>\tEXT. BARN - DUSK\n</b>\n\tAnnie exits the barn and sees:\n\n\tTom, walking away from the truck with the headlights left \n\ton... is walking right towards her.\n\n\tAnnie begins moving towards him, When they meet:\n\n<b>\t\t\t\t  TOM\n</b>\t\tI won't apologize for this. And I \n\t\twon't hide it. Not for anybody.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI won't ask you to.\n\n\tHe takes her in his arms and they kiss.\n\n<b>\tEXT. RANCH HOUSE - NIGHT\n</b>\n\tTom leads Annie to the front door. She waits as he unlocks it.\n\n<b>\tINT. RANCH HOUSE, SECOND FLOOR, TOM'S ROOM - NIGHT\n</b>\n\tTom leads her to his room. Annie cups his grasp on her with \n\tboth hands. He opens the door for her, ushers her in, then \n\tcloses the door. He hangs his hat. She turns to him. They \n\tembrace, surrendering to each other's passions.\n\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\tINT. RANCH - DAWN\n</b>\n\tCamera pas from Tom's window, bright with dawn, past his \n\tdesk upon which his classical music is playing, over to the \n\ttwo lovers in bed, kissing and embracing. Then:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, God, what are we going to do? \n\t\tI'm supposed to --\n\n<b>\t\t\t\t  TOM\n</b>\t\tSsshhh...\n\t\t\t(she stops)\n\t\tStand still, Annie. Takes what we've \n\t\tgot, just for now. Can you do that?\n\n\tBeat. She nods. The permission Tom is giving her acts like a \n\tgreat burden being lifted, and for the time being, she \n\tsurrenders and accepts the gift of what they feel. They kiss.\n\n<b>\tEXT. THE RANCH - DAY\n</b>\n\tSince the ranch must continue, Tom and Annie move through a \n\tday of ranch chores --\n\n<b>\t-- TOM AND ANNIE CLEANING STALLS AND FEEDING THE HORSES.\n</b>\n<b>\t-- TOM IS TRYING TO SHOW ANNIE HOW HE HAS TO FIX SOMETHING. \n</b><b>\tANNIE INTERRUPTING WITH HER OWN IDEAS... TOM TRIES TO EXPLAIN \n</b><b>\tBUT ANNIE KEEPS TALKING, EXCITED BY HER PLAN... TOM LAUGHS.\n</b>\n<b>\tINT. CREEK HOUSE - DAY\n</b>\n<b>\tANNIE HAS UNPACKED HER COMPUTER AND HOOKED IT UP, SHOWING \n</b><b>\tTOM HOW TO USE IT. HE PUSHES THE THRONG BUTTON AND MAKES A \n</b><b>\tFRIGHTENED FACE... ANNIE SCREAMS, THEN LAUGHS AND HUGS HIM.\n</b>\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\tTHEY ARE MAKING LOVE ON A BLANKET AMIDST OF THE MOVING BOXES IN \n</b><b>\tTHE MIDDLE OF THE DAY.\n</b>\n<b>\tINT. KITCHEN, RANCH HOUSE - DAY\n</b>\n<b>\t-- ANNIE COOKING LUNCH IN THE KITCHEN, SEEING TOM WORKING WITH \n</b><b>\tSMOKEY...\n</b>\n<b>\tEXT. PASTURE - DAY\n</b>\n<b>\t-- THE TWO ARE EATING LUNCH IN THE PASTURE. THEY ARE TALKING \n</b><b>\tSERIOUSLY ABOUT SOMETHING... PERHAPS EVEN DISAGREEING... ANNIE \n</b><b>\tSHAKES HER HEAD, NOT WANTING TO LISTEN. THEY EAT IN SILENCE.\n</b>\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\t-- THEY ARE WALKING AND DISCUSSING, HOLDING HANDS... UNTIL TOM \n</b><b>\tWRAPS HIS ARM AROUND HER AND HOLDS HER CLOSER... ANNIE, BURYING \n</b><b>\tHER HEAD IN HIS BODY.\n</b>\n<b>\tEXT. THE MOUNTAINS - DAY\n</b>\n\tTom and Annie, their horses packed with gear, ride across the \n\thigh mountain pasture through the grazing cattle...\n\n<b>\tEXT. THE MOUNTAINS - DAY\n</b>\n\tAnnie and Tom sit overlooking a breathtaking view. Tom is \n\tshowing her the rope trick... She looks down at their touching \n\tfingers and he gently pulls the rope away, still knotted, and \n\twithout ever breaking their touch... Annie looks into his \n\teyes, understanding what this means, raises his hand to her \n\tmouth and kisses it. She looks up at him with a curious \n\texpression;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tShow me again.\n\n<b>\t\t\t\t  TOM\n</b>\t\tAnnie!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOne more time.\n\n<b>\tEXT. THE MOUNTAINS - DUSK\n</b>\n\tAnnie lays asleep in Tom's arms, under a blanket. He picks up \n\tanother blanket with his free hand and shimmies it under her \n\thead, laying her down. She snuggles with the blanket and \n\tkeeps sleeping.\n\n\tTom takes a moment to look at her as she sleeps, gently \n\tbrushing her hair away from her eyes. He's deeply in love \n\twith this woman and wants to keep her with him. But there is \n\ta sad resignation in his look. A confusion.\n\n\tHe rises and walks to a stream nearby. He bends down to take \n\tsome water when he hears something. He looks up and sees on \n\tthe other side:\n\n\tA WILD HORSE giving birth to a foal in the tall grass. And a \n\tWHITE STALLION steps in between Tom and the mare, as if \n\tprotecting her.\n\n\tTom rises slowly to his feet. Then stands stock still. He and \n\tthe Stallion penetrate each other.\n\n\tSuddenly this beautiful, powerful Stallion rears -- violently. \n\tTom remains still, but clearly the horse is treating him as \n\tan invader...\n\n\tIt's as if the Whisperer is now being guided by the Horse \n\ttowards understanding. As Tom receives it, he remembers;\n\n<b>\t\t\t\t  TOM (V.O.)\n</b>\t\tSummers are short here, Annie. There \n\t\tisn't much of a fall. Before you know \n\t\tit, the roads are closed... the nights \n\t\tget long.\n\n<b>\tWE BEGIN TO FADE OUT ON TOM\n</b>\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\tI don't care! We'd be together.\n\n<b>\t\t\t\t  TOM (V.O.)\n</b>\t\tTwo people can't just be alone together \n\t\tin the world. At least not us...\n\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\tI can't do this. I can't leave you...\n\n\tVoice-Overs have carried over into a...\n\n<b>\t\t\t\t\t\t DISSOLVE TO:\n</b>\n<b>\tINT. CREEK HOUSE - NIGHT\n</b>\n\tTom and Annie make love...\n\n<b>\t\t\t\t  ANNIE (V.O.)\n</b>\t\tI won't.\n\n\tBut there is a difference in their lovemaking. There's a \n\tslowness, a reverence... a sense of two people so bounded, that \n\tthey are outside of time... Their love is so strong it almost \n\tfeels like despair -- their need to connect has gone beyond \n\ttheir bodies and into their spirits, for which there is no \n\tearthly satisfaction.\n\n<b>\tEXT. CREEK HOUSE - MORNING\n</b>\n\tThe sun has risen.\n\n<b>\tINT. CREEK HOUSE - MORNING\n</b>\n\tAnnie awakens in bed and discovers she is alone. She looks \n\taround for Tom. She rises and enters the other room to \n\tdiscover:\n\n\tAll her boxes and all her luggage have been removed.\n\n\tHer heart sinks. Tom re-enters, fully dressed, to get the \n\tlast box. He sees on her face a look of confusion and hurt.\n\n<b>\t\t\t\t  TOM\n</b>\t\tI figured, whenever you decided to \n\t\tgo, you'd be all set.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(curt)\n\t\tHow thoughtful of you. And what if \n\t\tI decide not to go?\n\n\tTom doesn't know how to respond. He looks away and bends down \n\tto reach for the box when Annie commands:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tLeave me alone!\n\n\tBeat. They stand awkwardly for a moment, until;\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(pleadingly)\n\t\tAnnie, please...\n\n\tTom reaches to embrace her, but Annie attacks him. Punching \n\this chest... pulling at his shirt as Tom tries to put his \n\tarms around her...\n\n<b>\t\t\t\t  ANNIE\n</b><b>\t\tNO!... NO!... YOU DON'T DECIDE \n</b><b>\t\tTHIS!... NO!...\n</b>\n\tTom's heart is breaking as he manages to get his arms around \n\ther and hold her... as she breaks down and softly, the rage \n\tpasses... Annie speaks softly.\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(struggling)\n\t\tI don't know any other way, Annie.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(more adamant)\n\t\tWhy?\n\n\tSuddenly;\n\n<b>\t\t\t\t  TOM\n</b>\t\tYou think this is easy for me!?\n\n\tAnnie is struck by the powerful sincerity of his words;\n\n<b>\t\t\t\t  TOM\n</b>\t\tIt's just happened this way sometimes. \n\t\tI can't explain it. But I look at you \n\t\tand see Grace and I see Robert, and \n\t\tno matter what you decide about him, \n\t\tI just know this is right. Your life \n\t\tisn't here and you know it.\n\n\tAnnie looks into his eyes and asks, softly defiant;\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tThen what have we been doing? I mean \n\t\twhat was the point?\n\n<b>\t\t\t\t  TOM\n</b>\t\t\t(confused by her question)\n\t\tThe point was to love each other.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhy?\n\n\tAs if there has to be a result... Tom looks at her and says \n\twith an almost innocent conviction:\n\n<b>\t\t\t\t  TOM\n</b>\t\tBecause we had to... And I'll never \n\t\tstop loving you, Annie. Here. Where \n\t\tmy life is.\n\n\tThe simplicity, and truth, of it hits Annie strongly.\n\n\tAnnie releases herself from him and turns away... despondent. \n\tRealizing the utter truth and inevitability of what he says. \n\tShe starts shaking her head. Tom can't hear it... He reaches \n\tfor her;\n\n<b>\t\t\t\t  TOM\n</b>\t\tAnnie...\n\n\tShe turns back into his arms and they kiss passionately... \n\tholding each other... as if for the last time.\n\n<b>\tEXT. RANCH HOUSE - DAY\n</b>\n\tTom is escorting Pilgrim into the trailer attached to the \n\tSuburban. He looks across the ranch to see the figure of \n\tAnnie, standing alone, perfectly still, in the pasture, \n\tlooking out to the horizon... (reminiscent of Tom earlier in \n\tthe film)\n\n<b>\tEXT. THE PASTURE - DAY\n</b>\n\tTom approaches Annie from behind, stopping a few feet away.\n\n<b>\t\t\t\t  TOM\n</b>\t\tAnnie?\n\n\tShe doesn't answer... as if she has found her own private \n\tplace within her, at last... A place of strength. She looks as \n\tif she knows what must be done... She hears him about to walk \n\taway when she asks:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tCan we go for one more ride?\n\n\tTom stops. Considers this. Then:\n\n<b>\t\t\t\t  TOM\n</b>\t\tSure. I'll saddle them up.\n\n\tHe exits. Not seeing the tears in Annie's eyes.\n\n<b>\tINT. BARN - DAY\n</b>\n\tTom enters the barn slowly. He crosses to Rimrock's stall... \n\tthen stops. As if he is waiting. As if he knows...\n\n\tThen... he hears the sound of Annie's Suburban starting up. He \n\tlooks up and knows she's leaving. He waits.\n\n<b>\tEXT. DOUBLE DIVIDE - CONTINUOUS\n</b>\n\tWide angle of Annie driving away in the Suburban with the \n\ttrailer.\n\n<b>\tINT. SUBURBAN - CONTINUOUS\n</b>\n\tAnnie doesn't look back -- her eyes wet with tears -- but no \n\tsobs.\n\n<b>\tINT. BARN - CONTINUOUS\n</b>\n\tTom lowers his head. It is not his way to say goodbye. And he \n\tis moved by Annie's knowing.\n\n<b>\tEXT. HIGHWAYS &amp; ROADS ACROSS AMERICA - DAYS &amp; NIGHTS\n</b>\n\tA MONTAGE of images of Annie traveling home...\n\n\tAcross different terrains, we see Annie driving -- missing \n\tTom... thinking of what she will decide by the time she gets \n\thome. Remembering IMAGES OF TOM:\n\n\t-- Riding on Rimrock and tipping his hat to her...\n\n\t-- Sitting in the pasture, staring at Pilgrim. Ignoring her.\n\n\t-- Seeing her arrive at the ranch for the very first time.\n\n<b>\tEXT. A DIFFERENT HIGHWAY OR COUNTRY ROAD - DAY\n</b>\n\tAnnie drives, she continues remembering...\n\n\t-- She and Tom in the branding...\n\n\t-- She and Tom dancing around the camp fire at the cattle drive.\n\n\t-- She and Tom kissing in secrecy behind Hank's house the night \n\tof the barn dance...\n\n<b>\tEXT. ANOTHER HIGHWAY OR COUNTRY ROAD - DAY\n</b>\n\tAnnie continues driving and remembering;\n\n\t-- Annie and Tom coming towards each other that first night \n\tafter everyone had left the ranch...\n\n\t-- Tom opening the front door to the ranch house...\n\n<b>\tSUDDENLY WE;\n</b>\n<b>\t\t\t\t\t\t\t\tCUT TO:\n</b>\n<b>\tINT. ROBERT'S HOUSE IN INDIA - A DAY REMEMBERED\n</b>\n\tA much younger Annie waits, surrounded by luggage, as A DOOR \n\tOPENS revealing a much younger, more vital, very handsome \n\tRobert:\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tYes?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHi. Um, there doesn't seem to be any \n\t\thotel room available and someone told \n\t\tme to come here and ask for \"Tubab\" \n\t\twho might to have a place for me to \n\t\tstay. Are you \"Tubab\"?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tNo. I am a \"tubab.\"\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tWhat do you mean?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tTubab means white man.\n\n\tAnnie is first surprised, then embarrassed but Robert seems so \n\tcharming and his smile breaks into a laugh, that she just nods \n\tand laughs herself.\n\n<b>\tINT. ROBERT'S HOME IN INDIA - A NIGHT REMEMBERED\n</b>\n\tOver a meal, Robert talks excitedly of his experiences. Annie \n\tis captivated.\n\n<b>\tINT. ROBERT'S BEDROOM IN INDIA - A NIGHT REMEMBERED\n</b>\n\tAfter Annie and Robert have made love, Robert sleeps with his \n\tarms wrapped around Annie. She lies awake, feeling safe and \n\tloved.\n\n<b>\t\t\t\t\t\t\tFADE OUT:\n</b>\n<b>\tEXT. LITTLE BIGHORN NATIONAL MONUMENT - TWILIGHT\n</b>\n\tAnnie stands where she stood when she and Grace stopped here on \n\ttheir way to Montana...\n\n\tShe removes from her pocket the KNOTTED LOOP he made for her, \n\tand looks at it.\n\n<b>\t\t\t\t\t\t\t  DISSOLVE TO:\n</b>\n<b>\tEXT. MACLEAN CONNECTICUT HOME - DAY\n</b>\n\tA car is driving up the driveway to the house. It stops.\n\n\tRobert and Grace get out as Annie exits from the front door. \n\tShe looks beautiful -- but in a completely different way than \n\tever before. There is a calm center to her. A softness and a \n\tstrength. She smiles and walks to meet them.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tOh, I miss you. You look beautiful.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tSo do you.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tHow's everything?\n\n<b>\t\t\t\t  GRACE\n</b>\t\tGood.\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(to Robert)\n\t\tHi.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tHi.\n\n\tThey kiss as Grace watches.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tWas the trip okay?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tMmm. I made good time.\n\t\t\t(to Grace)\n\t\tPilgrim's in the back. I found a new \n\t\tstable, but they can't take him until \n\t\ttomorrow.\n\n<b>\t\t\t\t  GRACE\n</b>\t\tGreat!\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tGo ahead...\n\n\tGrace exits excitedly O.C. Annie and Robert face each other. \n\tRobert doesn't know what to expect... but he softens when Annie \n\tsmiles:\n\n<b>\t\t\t\t  ANNIE\n</b>\t\tI have so much to tell you.\n\n<b>\t\t\t\t  ROBERT\n</b>\t\tYou want to take a walk with me?\n\n<b>\t\t\t\t  ANNIE\n</b>\t\t\t(a little nervous)\n\t\tWhere to?\n\n<b>\t\t\t\t  ROBERT\n</b>\t\t\t(smiles)\n\t\tI don't know. Let's just go and... \n\t\twe'll see...\n\n\tAnnie nods. He reaches for her hand, and Annie gives it \n\twillingly... They begin to walk away from Camera... together.\n\n\tAnnie begins to speak, telling him what we already know. How \n\the will react or what will happen, is unknown. But these two \n\tpeople will no longer avoid their life together... somehow, \n\tthey will make the effort to face it together.\n\n\tAs Camera Widens, we see included in the frame, Grace and \n\tPilgrim... as she strokes him and whispers in his ear... and \n\tleads him for a walk...\n\n\n<b>\t\t\t\tTHE END\n</b>\n\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Horse Whisperer, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Eric Roth\" title=\"Scripts by Eric Roth\">Eric Roth</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Horse Whisperer, The Script.html#comments\" title=\"Horse Whisperer, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:07:32.950108"}