{"title": "Hospital, The", "film_link": "/Movie Scripts/Hospital, The Script.html", "script_link": "/scripts/Hospital,-The.html", "info_raw": "\n\nHospital, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Paddy Chayefsky\nGenres  Comedy  Drama\nMovie Release Date : December 1971\n\nRead \"Hospital, The\" Script\n\n\n", "script": "\n\n\n\n                                       THE HOSPITAL\n\n\n\n                                        Written by\n\n                                     Paddy Chayefsky\n\n\n\n\n                                      SHOOTING DRAFT\n\n                                           1971\n\n                \n\n               THE HOSPITAL. DAY. MAY,\n\n               PANORAMIC VIEW of The Hospital -- a vast medical complex, a \n               sprawling pastiche of architecture extending ten blocks north \n               and south on First Avenue and east to the river.\n\n               The Hospital was founded in the late 19th century, and there \n               are still a few begrimed Victorian Bedlams and Bastilles \n               among the buildings. Mostly though, it is Medical Modern \n               1971, white and chrome and lots of glass and concrete shafts \n               and rotundas. A spanking new Community Mental Health Clinic \n               towers among the tenements at the northern end of the complex. \n               On the far side of First Avenue, a twenty-story apartment \n               house with recessed balconies and picture windows to house \n               the resident staff has just recently been completed, and \n               next to it, eight ghetto buildings are being demolished to \n               make way -- according to the construction company's sign -- \n               for a new Drug Rehabilitation Center, to be completed in \n               1973, we should all live so long. This is where the shattering \n               SOUNDS OF CONSTRUCTION are coming from. A block length of \n               generators and cement and demolition machines are POUNDING, \n               CRASHING, SCREAMING. Traffic HONKS and BRAYS up First Avenue.\n\n               It is a cold spring morning -- 10:00 A.M.\n\n               A 1966 station wagon pulls up to the Holly Pavilion.\n\n               A tiny, fragile, white-bearded OLD MAN, almost lost in his \n               overcoat, is helped from the rear of a station wagon and \n               slowly led to the entrance doors by a middle-aged nurse.\n\n                                     NARRATOR\n                         On Monday morning, a patient named \n                         Guernsey, male, middle-seventies was \n                         admitted to the hospital complaining \n                         of chest pains.\n\n               HOLLY PAVILION. EIGHTH FLOOR CORRIDOR\n\n               The old man is now in a wheelchair pushed by a hospital \n               orderly down the corridor.\n\n                                     NARRATOR\n                         He had been referred by a nursing \n                         home where the doctor had diagnosed \n                         his condition as angina pectoris. \n                         Now it is axiomatic that nursing \n                         home doctors are always wrong.\n\n               ROOM 806\n\n               The old man, shirtless, is propped on the edge of the bed, \n               wheezing. DR. SCHAEFER, a young intern in white-uniform, \n               perches beside him with the old man's chart in his lap, taking \n               down his history. The other patient in the two-bedded room, \n               a MIDDLE-AGED MAN, is comatose and all rigged up with I.V.'s \n               and catheters.\n\n                                     NARRATOR\n                         The intern who admitted Mr. Guernsey, \n                         however, accepted the diagnosis and \n                         prescribed morphine, a drug suitable \n                         for angina but not at all suitable \n                         for emphysema, which is, \n                         unfortunately, what the old man \n                         actually had. Within an hour...\n\n               EIGHTH FLOOR CORRIDOR\n\n               Two orderlies rush the old man's bed with, of course, the \n               old man in it, past the Nurses' Station and into a waiting \n               elevator.\n\n                                     NARRATOR\n                         ...the patient became unresponsive \n                         and diaphoretic and was raced up to \n                         Intensive Care with an irregular \n                         pulse of 150, blood pressure 90 over \n                         60, respiration rapid and shallow.\n\n               INTENSIVE CARE\n\n               An oxygen mask is applied to the old man's face by the \n               resident.\n\n                                     NARRATOR\n                         The resident on duty now compounded \n                         the blunder by treating the old man \n                         for pulmonary edema. He gave him \n                         digitalis, diuretics and oxygen. \n                         This restored the old man's color...\n\n               EIGHTH FLOOR CORRIDOR\n\n               The elevator door opens. Two orderlies wheel the sleeping \n               man on his bed back around the Nurses' Station and down the \n               corridor to his room.\n\n                                     NARRATOR\n                         ...and he was sent back to his room \n                         in the Holly Pavilion, ruddy \n                         complected and peacefully asleep.\n\n               ROOM 806. EVENING\n\n               The old man is back in his room sleeping serenely, his tiny \n               body making barely a ripple in the white sheet that covers \n               him. The room is in hushed shadows. A yellowish light diffuses \n               into the room from the half-opened bathroom door. The other \n               patient in the room remains as before, comatose and silent.\n\n                                     NARRATOR\n                         In point of fact, the patient was in \n                         CO2 narcosis...\n\n               ROOM 806\n\n               All the lights are on now. NURSE PENNY CANDUSO and an orderly \n               are wrapping the old man in a post-mortem shroud. BRUBAKER, \n               the senior resident, is giving hell to Schaefer, the intern.\n\n                                     NARRATOR\n                         ...and died at seven-thirty that \n                         evening.\n\n               The shrouded body of the old man is wheeled out of the room. \n               CAMERA STAYS on the vacated bed.\n\n                                     NARRATOR\n                         I mention all this, only to explain \n                         how the bed in Room 806 became \n                         available.\n\n               PAN from bed to Schaefer, now alone in the room and regarding \n               the empty bed with frowning interest. Schaefer is a scraggly \n               young fellow, bespectacled, with a contemporary mess of hair \n               and a swinging unkempt moustachio. HOLD on Schaefer.\n\n                                     NARRATOR\n                         The intern involved was a prickly \n                         young buck named Schaefer who had a \n                         good thing going for him with a \n                         technician in the hematology lab. In \n                         the haphazard fashion of hospital \n                         romances, Dr. Schaefer had been \n                         zapping this girl on wheelchairs, \n                         stretchers, pantry shelves...\n\n               Dr. Schaefer moves for the phone on the table between the \n               two beds.\n\n                                     NARRATOR\n                         ...in the kitchen, in the morgue, in \n                         the dark corners of corridors...\n\n               Schaefer speaks softly into the phone.\n\n                                     NARRATOR\n                         ...standing up, sitting down -- so \n                         you can imagine what an available \n                         bed meant to him.\n\n                                     SCHAEFER\n                              (on phone)\n                         Hey, Sheila, this is Howard, Sheila. \n                         Hey listen. I got us a bed for \n                         tonight. A real, honest-to-god bed.\n\n               FREEZE on CLOSE-UP of the beaming, lubricious Schaefer on \n               phone as\n\n               CREDITS AND MUSIC ERUPT ONTO THE SCREEN --\n\n                                       THE HOSPITAL\n\n               INTERSPERSED WITH CREDITS, the following scenes:\n\n               ROOM 806. NIGHT\n\n               Dark. Just a bit of moonlight streaking through the not quite \n               closed bathroom. The hallway door opens, and a young woman, \n               carrying a top coat, slips quickly in giggling like hell, \n               followed by Schaefer, who is likewise giggling and admonishing \n               her to be quiet. Her name is SHEILA. Sheila notices the other \n               patient in the room sleeping away and looks questioningly at \n               Schaefer, who reassures her as he removes her coat. After \n               which he strips off his own white jacket and trousers and \n               hangs them in the armoire. The girl asks in a hoarse whisper \n               if they're going to get totally nude and wonders if that's \n               such a good idea. For an answer, Schaefer fondles her crotch. \n               They both giggle, they both shush each other, they giggle \n               again; they're both stoned. The girl unzippers her dress. \n               The dark room is filled for the moment with the flurry of \n               undressing, flung garments, elbows, legs and arms, bumpings \n               into each other, and Sheila saying between giggles, \"Boy, I \n               sure hope nobody walks in.\"\n\n               They eventually wind up on the unoccupied bed, and the scene \n               ends looking ACROSS the sleeping profile of THE PATIENT in \n               the other bed as Schaefer and his girl thump away at each \n               other with much creaking of springs, moans, groans, giggles \n               and the white-limbed patterns of fornication.\n\n               ROOM 806\n\n               Dark, silent, hushed. The fun and games are over. Sheila is \n               in front of the armoire. She slips back into her dress, after \n               which she tiptoes back to the bed where Schaefer is deeply \n               asleep, smiling in postcoital peace. Sheila bends, shakes \n               his shoulder.\n\n                                     SHEILA\n                              (whispers)\n                         I'll see you.\n\n               Schaefer smiles, grunts, sleeps on.\n\n               END OF CREDITS.\n\n                                                                  FADE OUT.\n\n               FADE IN:\n\n               THE HOSPITAL. 6:30 A.M. NEXT MORNING, TUESDAY\n\n               A cold newly-dawned sun shines down on the vast sprawling \n               complex of the hospital. Desultory early morning traffic on \n               First Avenue.\n\n               HOLLY PAVILION, EIGHTH FLOOR\n\n               The night shift of nurses is closing out another night's \n               work, which has been on the whole uneventful. The head nurse, \n               MRS. REARDON, hunches over her paperwork. NURSE ELIZABETH \n               RIVERS sits at the desk beside her, resting her head on the \n               palm of one hand. NURSE'S AID J.C. MILLER crosses with an \n               armful of linens. She disappears into the pharmacy and supply \n               areas behind the Nurses' Station. In the west corridor, NURSE \n               LUCINDA PEREZ glances at her watch, then pads down to Room \n               806. She enters.\n\n               ROOM 806. DAY\n\n               A cold gray light cheerlessly illuminates the room. Nurse \n               Perez checks the I.V. on the comatose patient who is in the \n               bed nearest the door. Then she turns to regard the other bed -- \n               which gives her pause.\n\n               NURSE'S P.O.V.: Intern Dr. Schaefer is lying on this bed, \n               rigid, eyes dilated, pupils staring unseeing. An I.V. tube \n               sticks out of his naked right arm. Nurse Perez doesn't quite \n               know what to make of the fact that Dr. Schaefer is lying on \n               that bed with an I.V. tube sticking out of him looking dead. \n               Frowning, she reaches out a tentative hand to shake his naked \n               shoulder.\n\n                                     NURSE PEREZ\n                         Doctor Schaefer...\n\n               There is, of course, no response. A terrible suspicion enters \n               Nurse Perez's mind, and she closes her eyes and sighs a long \n               shuddering sigh. Then she opens her eyes and, with a second \n               and briefer sigh, reaches for Schaefer's neck to take his \n               pulse. Clearly, the result is not encouraging. She sighs \n               another short sigh and regards Schaefer's unblinking, dilated \n               pupils. It's all a bit too much for her; she shuffles to the \n               window and stares out into the gray morning where things are \n               a little more comprehensible. Once again, she returns to the \n               bed, regards Schaefer's death mask. She raises the bedsheet \n               and, for one short but appreciative moment, considers \n               Schaefer's naked body. She lets the bedsheet carefully down. \n               She sighs again.\n\n                                     NURSE PEREZ\n                              (trying again, with \n                              little hope)\n                         Doctor Schaefer?\n\n               She sighs, turns and leaves the room.\n\n               EIGHTH FLOOR CORRIDOR\n\n               Nurse Perez, frowning and pursing her lips, moves slowly \n               back to...\n\n               EIGHTH FLOOR, NURSES' STATION\n\n               Head Nurse Reardon is still bent over her paperwork.\n\n                                     NURSE PEREZ\n                         Listen, did you know Doctor Schaefer \n                         was in Eight-O-Six, because he's \n                         dead?\n\n                                     MRS. REARDON\n                              (late forties, \n                              continues her \n                              painstaking paperwork, \n                              grunts)\n                         What?\n\n                                     NURSE PEREZ\n                         I'm just telling you, Dr. Schaefer \n                         is dead.\n\n                                     MRS. REARDON\n                              (works on; after a \n                              moment, looks up)\n                         What do you want, Perez?\n\n                                     NURSE PEREZ\n                         Look, I don't know what the hell \n                         this is all about, but Dr. Schaefer \n                         is in Room 806 with an I.V. running \n                         and he's dead. I didn't even know he \n                         was sick.\n\n                                     MRS. REARDON\n                              (regards Perez a moment)\n                         Perez, what the hell are you talking \n                         about?\n                              (appeals to Nurse \n                              Rivers coming out of \n                              the floor pharmacy)\n                         Do you know what the hell she's \n                         talking about?\n\n                                     NURSE PEREZ\n                         Well, maybe I'm going crazy. I don't \n                         know. Isn't Room 806 the patient \n                         Guernsey? I mean, did something happen \n                         I don't know about?\n\n                                     MRS. REARDON\n                         Perez, I don't know what you're \n                         talking about.\n\n                                     NURSE PEREZ\n                         This is the nuttiest thing I ever \n                         saw. Dr. Schaefer's in Room 806 dead.\n\n                                     MRS. REARDON\n                         What Dr. Schaefer? Our Dr. Schaefer?\n\n                                     NURSE PEREZ\n                         Our Dr. Schaefer. The one who's always \n                         grabbing everybody's ass.\n\n                                     MRS. REARDON\n                              (to Nurse Rivers)\n                         Do you know what she's talking about? \n                         I don't know what she's talking about.\n                              (to Perez)\n                         What do you mean Doctor Schaefer's \n                         in Room 806 dead?\n\n                                     NURSE PEREZ\n                         I mean, he's lying on the far bed, \n                         stone dead, and with an I.V. tube \n                         sticking out of him. And if you don't \n                         believe me, maybe you just ought to \n                         get up and look for yourself.\n\n               With a short, irritable sigh, Mrs. Reardon abandons her \n               paperwork and heads down the west corridor, followed by Nurses \n               Perez and Rivers. CAMERA TRACKS as Mrs. Reardon turns to \n               Nurse Rivers.\n\n                                     MRS. REARDON\n                         All right, maybe you'd better call \n                         Mrs. Christie.\n\n               Phone RINGS.\n\n               BOCK'S HOTEL ROOM\n\n               Dark. Venetian blinds drawn. TV set on, a gray coarse-grained \n               square. PHONE RINGS.\n\n               DR. HERBERT BOCK, 53 years old, a large man, bulky, \n               disheveled, apparently fell asleep in a chair while watching \n               television the night before. The bed still has its spread on \n               but is rumpled. Bock is in trousers and shirt, collar opened, \n               barefooted. PHONE RINGS. The reading lamp is the only light \n               in the room except for the sheen of gray hissing from the \n               television. Newspapers litter the floor. Books, two-day-old \n               plates of food, yesterday's mugs of coffee, cigar-stuffed \n               ashtrays, a shirt, a pair of pants, a winter overcoat, a \n               battered gray fedora have been slung about. PHONE on the \n               bedtable RINGS again, begins to penetrate the sotted sleep \n               of the man. Two bottles of booze, one empty, and a clump of \n               glasses are on the coffee table in front of Bock. He grunts, \n               opens an eye. PHONE RINGS. Bock suddenly exsufflates in a \n               snorting grunt. He stands, shuffles to the bed, a big, sodden \n               fellow, picks up the receiver, interrupting its next RING. \n               He sinks, sitting on the bed.\n\n                                     BOCK\n                         This is Dr. Bock... Yes, Mrs. \n                         Christie, what is it? It's all right, \n                         I'd be getting up in a few minutes \n                         anyway... I'm sorry I missed that. \n                         Would you say it again? Yes, I know \n                         him, Schaefer, the stud with the \n                         glasses, who fancies the nurses... \n                         I'm afraid I don't understand that, \n                         what do you mean? Was he sick? I \n                         mean, was he... uh, what was the \n                         cause of death? Was he being treated? \n                         I don't understand. What was he doing \n                         in the bed? You did say he... Look, \n                         Mrs. Christie, did you call the \n                         office? Good, well, I'll... No, no, \n                         it's all right. I'll be getting my \n                         wake-up call any minute anyway.\n\n               He returns the receiver to its cradle, sits disoriented, \n               unbuttoning his shirt.\n\n               HOSPITAL. MORNING. 8:00 A.M.\n\n               LONG SHOT of the hospital, now alive and jumping. Taxis pull \n               up and out of the large U-shaped drive. A noisy picket line \n               of about twenty chanting protesters parade with signs in an \n               uneven ellipse.\n\n                                     GRUMBLING PROTESTERS\n                              (chanting)\n                         Two-four! Help the poor!\n\n               Most of the placards are slogan-y: \"PEOPLE YES! DOCTORS NO!\" -- \n               \"CURE POVERTY! HEAL THE POOR!\" Two protesters move toward \n               the street, waving and yelling at an approaching car. One, a \n               young white fellow wears a sandwich board that goes into the \n               matter at some length: \"WE PROTEST THE EVICTION OF 386 BLACK \n               FAMILIES AND THE DESTRUCTION OF THEIR HOMES TO SERVE THE \n               EXPANSIONIST POLICIES OF THIS IMPERIALIST HOSPITAL.\"\n\n               In the back seat of the car sits JOHN SUNDSTROM, handsomely \n               graying, tanned, early fifties, the Director of the Hospital. \n               He looks up. That young demonstrator, DR. IVES, a sandy-haired \n               bespectacled man of 30 in a white doctor's coat, sidles to \n               the car's open rear window angrily shouting.\n\n                                     DR. IVES\n                         What do you say, Sundstrom? How much \n                         longer do you think our monopolistic, \n                         exclusionary, racist policies will \n                         work?\n\n                                     PROTESTER\n                         We're the hope!\n\n               Sundstrom lowers his window and gives his driver directions. \n               He exits in the BACKGROUND parking area, where he notices \n               Bock emerging from his car. Sundstrom waits for him.\n\n                                     SUNDSTROM\n                         So how's it going, Herb?\n\n               Bock's sour glance says it all. He locks his car, joins \n               Sundstrom, and the two men start down the concrete ramp.\n\n                                     BOCK\n                              (after a moment)\n                         One of my interns dropped dead this \n                         morning.\n\n                                     SUNDSTROM\n                         Really? I'm sorry to hear that. I \n                         understand you've moved out to a \n                         hotel.\n\n                                     BOCK\n                         Yes.\n\n                                     SUNDSTROM\n                         It got that bad with Phyllis?\n\n                                     BOCK\n                         It's been that bad for twenty-four \n                         years. Are you going to be solicitous?\n\n                                     SUNDSTROM\n                         Yes.\n\n                                     BOCK\n                         Oh, God.\n\n               They trudge across the U-shaped entrance drive, pausing to \n               let a car pass.\n\n                                     SUNDSTROM\n                         Listen, Herb, I'm the guy who brought \n                         you into this hospital, so I think I \n                         can skip the diplomatic overtures. \n                         Marty stopped me in the hall \n                         yesterday, very upset. He had just \n                         had lunch with you and said you \n                         sounded suicidal. Marty tends to be \n                         extravagant, but he's not the only \n                         one. Jack Singer mentioned the other \n                         day you've been boozing it up a lot. \n                         And let's face it, you've been \n                         sloughing off. I understand you \n                         haven't even been doing rounds.\n\n                                     BOCK\n                         I'm going to do rounds today.\n\n               They pick their way around the shuffling line of protesters -- \n               many with Afro haircuts and tinted glasses, including a black \n               minister and four young white activists.\n\n               HOSPITAL, HOLLY PAVILION, EXECUTIVE CORRIDOR\n\n               Early-arriving secretaries chat in the doorways. The corridor \n               itself connects to the Bryce Pavilion (pediatrics, gynecology \n               and obstetrics), so a steady stream of traffic moves back \n               and forth. Bock and Sundstrom enter the corridor and slow to \n               a halt to continue their chat by a wall.\n\n                                     SUNDSTROM\n                         Herb, want a couple of days off?\n\n                                     BOCK\n                         No.\n\n                                     SUNDSTROM\n                         Go down to Montego Bay, get drunk, \n                         get laid, get a little sun.\n\n                                     BOCK\n                         For God's sake, John, I'm fifty-three \n                         years old with all the attendant \n                         fears. I just left my wife after \n                         twenty-four years. Standard case of \n                         menopausal melancholy.\n\n                                     SUNDSTROM\n                         Maybe you ought to have a talk with \n                         Joe Einhorn.\n\n                                     BOCK\n                         I don't want to see a psychiatrist. \n                         Stop worrying about me. All I have \n                         to do is get my ass back to work, \n                         and I'll be fine. I'm sorry I've \n                         caused you concern.\n\n               He sets off down the long corridor to the elevators. MILTON \n               MEAD, the Administrator of the Hospital, comes out of one of \n               the offices, waves a good morning to Bock, who acknowledges \n               him and plods on. Mead comes up to Sundstrom, now moving \n               toward his own office.\n\n                                     MILTON MEAD\n                         Sid just called from St. Luke's, and \n                         he's heard that the demonstrators up \n                         there are planning a march to join \n                         the bunch down here.\n\n                                     SUNDSTROM\n                         Oh, God.\n                              (he wraps his arm \n                              around Mead's \n                              shoulders, ushering \n                              him into his office \n                              area)\n                         Did you call the cops?\n\n                                     MILTON MEAD\n                         Yes.\n\n               HOLLY PAVILION, EIGHTH FLOOR. 8:15 A.M.\n\n               The elevator door opens. Out comes Bock, overcoat unbuttoned \n               now. He clumps to the Nurses' Station. An unusual number of \n               nurses seems to be there. Through the doorway of the floor \n               pharmacy, we can see Nurse Rivers of the night shift being \n               comforted by Nurse Perez of the night shift and Nurse Edwards \n               of the morning shift. The head morning nurse, MRS. DONOVAN, \n               is at the desk hunched over her paperwork. (Nurses are always \n               hunched over their paperwork.) NURSE FELICIA CHILE is also \n               seated at the desk doing some paperwork. Head Nurse Donovan \n               looks up briefly as Dr. Bock approaches.\n\n                                     MRS. DONOVAN\n                              (back to her paperwork)\n                         They're all in Eight-O-Six, Doctor.\n\n                                     BOCK\n                         What happened?\n\n                                     MRS. DONOVAN\n                         I think I'll just let Mrs. Christie \n                         tell you about it.\n\n               Bock lumbers off for the west corridor through a press of \n               activity. Kitchen workers trundle creaking portable carts, \n               nurse's aids and attendants pop in and out of doorways bearing \n               trays and used dishes. A robed patient or two ambulates along \n               the hall. Morning rounds have just started, which means a \n               clump of white-jacketed, white-trousered young doctors are \n               gathered in a gaggle at the far end. The group includes senior \n               resident MONROE BRUBAKER, junior resident HARVEY BIEGELMAN, \n               interns SAM CHANDLER and IRVING AMBLER and another medical \n               student, all lounging outside a door discussing the condition \n               of the patient within.\n\n               Chandler is presenting the case from a handful of notecards \n               in his hand. The others lean against the walls, listening. \n               They wear shirts and ties with the exception of Ambler, who \n               is new to the floor and still in the canonical white tunic \n               under his jacket. They are all in their twenties and have \n               swinger sideburns and occasional mustaches. When he spots \n               Dr. Bock, senior resident Brubaker turns the rounds over to \n               Biegelman and joins Bock just outside 806.\n\n                                     BRUBAKER\n                              (as he approaches, \n                              rolls his eyes)\n                         Oh boy.\n\n                                     BOCK\n                         What happened?\n\n                                     BRUBAKER\n                         I've seen some pretty good snafus, \n                         but this one... I mean, there's a \n                         certain splendor to this one. One of \n                         the night nurses, a float, thought \n                         Schaefer was a patient and plugged \n                         an I.V. into him. He was a diabetic, \n                         you know.\n\n                                     BOCK\n                         What do you mean, a nurse plugged an \n                         I.V. into him?\n\n                                     BRUBAKER\n                         Oh, it's really a screwed-up story, \n                         Doctor. You see, what happened was \n                         we had an old man in that bed who \n                         died last night, so the bed was \n                         available. And you know Schaefer. \n                         He's Sammy Stud.\n\n                                     BOCK\n                         And he talked a nurse into zapping \n                         him on that bed.\n\n                                     BRUBAKER\n                         I think it was a girl from hematology \n                         he's been running with.\n\n                                     BOCK\n                         My God, it's a Roman farce.\n\n               The door to Room 806 opens, and an Assistant Administrator \n               named HITCHCOCK pokes his head out.\n\n                                     HITCHCOCK\n                         I thought I heard you out here, \n                         Doctor.\n                              (he too rolls his \n                              eyes heavenward in \n                              an expression of \n                              incredulity)\n\n               Bock makes a noise and goes into...\n\n               ROOM 806\n\n               Aside from Hitchcock, the room includes MRS. CHRISTIE, the \n               Director of Nurses, a fusty forty-six, in streetclothes; \n               Head Night Nurse, Mrs. Reardon, in uniform; Head Evening \n               Nurse, MRS. DUNNE, mid-fifties, who had apparently been called \n               in from home because she's in mufti and wearing a winter \n               coat; and, of course, the comatose patient and the dead Dr. \n               Schaefer. Mrs. Christie is instructing the two nurses.\n\n                                     MRS. CHRISTIE\n                         I'll need one from both of you, three \n                         copies, and I suggest you do that \n                         right now. The forms are in my \n                         office...\n\n               Mrs. Dunne, on the verge of tears, head bobbing, looks up to \n               Bock.\n\n                                     MRS. DUNNE\n                         I'm really so terribly sorry about \n                         this, Dr. Bock. I...\n\n                                     BOCK\n                              (regarding Schaefer's \n                              rigid death mask)\n                         As I understand it, one of the nurses \n                         inadvertently administered an I.V. \n                         to Schaefer here. How the hell could \n                         that happen?\n\n                                     HITCHCOCK\n                         Listen, I think we ought to straighten \n                         this out somewhere else.\n\n                                     MRS. CHRISTIE\n                         Yes, very good idea. Oh God, what a \n                         mess.\n\n               They all file out now, Bock in the rear into...\n\n               HALLWAY, NURSES' STATION AND LOBBY AREA\n\n               They all go along to the Nurses' Station where Mrs. Reardon \n               and Mrs. Dunne disappear into the rooms behind. Mrs. Christie \n               leads Hitchcock and the trailing Bock to the TV-solarium; \n               but Dr. Brubaker is now holding his rounds there. He stands, \n               quietly expounding on the uses of heparin, a decoagulant. \n               One of the patients last night had hemorrhaged consequent to \n               injudicious use of that drug. Listening, the other young \n               doctors make notes. Mrs. Christie leans against the wall. \n               Apparently, the conference is to take place in the corridor. \n               Background activity continues normally.\n\n                                     MRS. CHRISTIE\n                              (with a sigh)\n                         Well, these things happen, of course.\n\n                                     HITCHCOCK\n                         I suppose I'd better call the Medical \n                         Examiner.\n\n                                     BOCK\n                         I still don't know what happened.\n\n                                     MRS. CHRISTIE\n                         Well, it took an hour to get it sorted \n                         out. It seems a patient named Guernsey \n                         died last night in Eight-O-Six, but \n                         that information wasn't given to the \n                         night nurses. These things happen.\n\n               Bock has begun to get the drift. A curious state of apathy \n               settles over him.\n\n                                     MRS. CHRISTIE\n                              (rattling on)\n                         At any rate, according to the cardex, \n                         the patient Guernsey was down for \n                         twenty-five milligrams of Sparine Q-\n                         6-H, so Mrs. Reardon sent Nurse Perez \n                         to give him his twelve o'clock shot. \n                         Meanwhile, it seems Dr. Schaefer had \n                         usurped that particular bed for his \n                         own purposes. Dr. Brubaker suggests \n                         it was for a love tryst, and some \n                         weight is given that hypothesis by \n                         the fact that Dr. Schaefer was naked.\n\n                                     BOCK\n                              (trying to give his \n                              attention to this)\n                         I get the drift, Mrs. Christie. In \n                         other words, Nurse Perez went in and \n                         sedated Dr. Schaefer thinking it was \n                         the patient Guernsey. My God! What I \n                         don't understand...\n\n                                     MRS. CHRISTIE\n                         If I may finish, Doctor. Well, after \n                         Perez gave him his shot, she noticed \n                         the I.V. on the bed had been pinched \n                         off, and she reported that back to \n                         Mrs. Reardon, who then assigned Nurse \n                         Rivers to restart the I.V.\n                              (Bock sighs)\n                         Now Rivers was a float. She didn't \n                         even know the staff people on the \n                         floor, and nobody knew what the \n                         patient Guernsey looked like anyway, \n                         since he'd only been admitted that \n                         morning.\n\n                                     BOCK\n                         So she plugged an I.V. into him.\n\n                                     MRS. CHRISTIE\n                         Yes.\n\n                                     BOCK\n                         How much?\n\n                                     MRS. CHRISTIE\n                         A liter.\n\n                                     BOCK\n                              (The doctor in him \n                              intrudes into his \n                              lassitude)\n                         A five percent glucose solution won't \n                         kill anybody. Did he have any other \n                         ancillary conditions? He wasn't \n                         dehydrated, was he? Didn't anybody \n                         bother to go in to check him during \n                         the night, even under the impression \n                         he was merely a patient? Was he \n                         hyperasthmolic? Did he have a bad \n                         heart? He must have had some kind of \n                         thrombosis. I want the post done \n                         here, Mr. Hitchcock. And you and I \n                         better have a little chat, Mrs. \n                         Christie, about your excessive use \n                         of float nurses.\n\n                                     MRS. CHRISTIE\n                         I've got nearly a thousand nurses in \n                         this hospital.\n\n                                     BOCK\n                              (gathering rage)\n                         And every time one of them has her \n                         period, she disappears for three \n                         days. My doctors complain regularly \n                         they can't find the same nurse on \n                         the same floor two days in a row. \n                         What the hell am I supposed to tell \n                         that boy Schaefer's parents? That a \n                         substitute nurse assassinated him, \n                         because she couldn't tell the doctors \n                         from the patients on the floor? My \n                         God, the incompetence here is \n                         absolutely radiant! I mean, two \n                         separate nurses walk into a room, \n                         stick needles into a man -- and one \n                         of those was a number eighteen jelco! -- \n                         tourniquet the poor sonofabitch, \n                         anchor the poor sonofabitch's arm \n                         with adhesive tape, and it's the \n                         wrong poor sonofabitch! I mean, my \n                         God! Where do you train your nurses, \n                         Mrs. Christie? Dachau!?\n                              (he is aware his voice \n                              has risen and is \n                              attracting attention. \n                              He lowers his voice)\n                         All right, wrap him up and get him \n                         down to Pathology. I'm especially \n                         interested in his blood sugar. A \n                         liter of glucose never killed anybody. \n                         Your ladies must've done something \n                         else to him.\n\n                                     MRS. CHRISTIE\n                         Will there be anything else, Doctor?\n\n                                     BOCK\n                         No.\n\n                                     HITCHCOCK\n                         Before you call the family, Doctor, \n                         I wish you'd talk to Mr. Mead about \n                         this. We'd like, naturally, to avoid \n                         litigation.\n\n               Bock heads abruptly down the corridor to the elevators.\n\n               HOLLY PAVILION, SEVENTH FLOOR, CORRIDOR\n\n               A corridor of offices. This is the Department of Medicine, \n               where Bock and all the senior staff members of the department \n               have their offices. It's quiet, since most of the staff are \n               away at their various specialties about the hospital.\n\n               Bock comes up the corridor still wearing the overcoat he \n               arrived in some hours ago. He has only managed to unbutton \n               it in all the time it has taken him to reach the corner \n               office. Gilt lettering on the door reads: DEPARTMENT OF \n               MEDICINE and below that DR. HERBERT E. BOCK.\n\n               BOCK'S OFFICE, OUTER OFFICE\n\n               Small office with two desks. As Department Chief, Bock gets \n               two secretaries. Both are at their desks, one on the phone, \n               MISS GLORIA LEBOW, and the other rattling away on the IBM, \n               MISS STEPHANIE McGUIRE.\n\n                                     MISS LEBOW\n                              (mouthing)\n                         Coffee?\n\n               It would seem not. Bock waves a listless hand, exits into...\n\n               BOCK'S PRIVATE OFFICE\n\n               The modestly imposing office is lined with medical tomes. \n               Bock slips out of his coat and jacket and hangs them in the \n               closet. In shirtsleeves with his tie a bit askew -- \n               fastidiousness in dress is not Bock's strong point -- he \n               crosses to his desk and sits, breathing more heavily than \n               his small exertions would seem to warrant. He seems exhausted. \n               There is a KNOCK on the door. Miss Lebow enters, holding a \n               filing envelope stuffed with papers.\n\n                                     MISS LEBOW\n                         A few things have been piling up. \n                         Would you like to go into them?\n\n               A guttural noise indicates yes. Miss Lebow pulls up a chair, \n               opens her folder.\n\n                                     MISS LEBOW\n                         A quickie. Dr. Esterhazy wants to \n                         start hiring temporary people to \n                         cover the summer vacations. He says \n                         last year some of the replacement \n                         people didn't receive their checks \n                         until they waited six months. He \n                         wonders if you could do something \n                         about getting these people paid more \n                         promptly.\n\n               She places a sheet of paper on the desk in front of Bock. He \n               tries to give his attention to it.\n\n                                     MISS LEBOW\n                              (drones on)\n                         Miss Aronovici complains the lab \n                         reports are coming in slow into the \n                         E.R. I called Dr. Immelman about \n                         that, and she said three microscopes \n                         have been stolen out of her lab in \n                         the last two months. Charley Waters \n                         also complains about pilferage. I've \n                         clumped all those together for you...\n                              (she lays a sheaf of \n                              memos in front of \n                              Bock, who stares at \n                              them blankly)\n                         Now, as you know, Doctor, we've agreed \n                         to take over the local ambulance \n                         cases as part of the hospital's \n                         commitment to the community, and \n                         it's created a serious overload in \n                         the E.R. I don't know why this was \n                         dumped in our lap, but...\n\n               Bock obviously isn't up to all this. He waves a limp hand to \n               stop Miss Lebow's morning report.\n\n                                     BOCK\n                              (staring at his desktop)\n                         Find out if Dr. Einhorn is in his \n                         office yet.\n\n                                     MISS LEBOW\n                         Which Dr. Einhorn? Ophthalmology or \n                         Psychiatry?\n\n                                     BOCK\n                         Psychiatry.\n                              (suddenly stands)\n                         Never mind. I'll look in myself.\n\n               He lumbers across the room and out into...\n\n               BOCK'S OUTER OFFICE\n\n               ...and down past Miss McGuire, rattling away on her IBM, and \n               out into...\n\n               HOLLY PAVILION, SEVENTH FLOOR, CORRIDOR\n\n               ...down past several closed doors, stopping at a door marked \n               DEPARTMENT OF PSYCHIATRY, DR. JOSEPH EINHORN. He enters.\n\n               DR. EINHORN'S OFFICE, SECRETARY'S OFFICE\n\n               A secretary at her desk, sips coffee and reads a paperback \n               novel.\n\n                                     BOCK\n                         Is he in?\n\n               The doctor is obviously in. He can be seen through the open \n               door sitting at his desk writing in a notebook. Bock leans \n               in.\n\n                                     BOCK\n                         Can you give me a few minutes, Joe?\n\n                                     EINHORN\n                              (short, chunky, \n                              bespectacled, late \n                              fifties)\n                         Of course.\n\n               Bock goes in, closes the door behind himself.\n\n               DR. EINHORN'S OFFICE\n\n               Bock looks only at the floor.\n\n                                     BOCK\n                              (ill at ease)\n                         I've been having periods of acute \n                         depression recently. Apparently, \n                         it's becoming noticeable. A number \n                         of people have remarked on it. Anyway, \n                         John Sundstrom thought it might be a \n                         good idea if I spoke to you about \n                         it.\n\n                                     EINHORN\n                         Do you want to sit down, Herb?\n\n                                     BOCK\n                         No. I'm not good at confessional.\n                              (he ambles around)\n                         Well, what can I tell you? The last \n                         year, two, three... it goes way back, \n                         I suppose. I can remember entertaining \n                         suicidal thoughts as a college \n                         student. At any rate, I've always \n                         found life demanding. I'm an only \n                         child of lower-middle-class people. \n                         I was the glory of my parents. My \n                         son the doctor. Well, you know. I \n                         was always top of my class. \n                         Scholarship to Harvard. The boy \n                         genius, the brilliant eccentric. \n                         Terrified of women, clumsy at sports. \n                         God, Joe, how the hell do I go about \n                         this?\n\n                                     EINHORN\n                         I understand you just separated from \n                         your wife.\n\n                                     BOCK\n                         I left her a dozen times. She left \n                         me a dozen times. We stayed together \n                         through a process of attrition. \n                         Obviously sado-masochistic dependency. \n                         My home is hell. We've got a twenty-\n                         three-year-old boy I threw out of \n                         the house last year. A shaggy-haired \n                         Maoist. I don't know where he is, \n                         presumably building bombs in basements \n                         as an expression of his universal \n                         brotherhood. I've got a seventeen-\n                         year-old daughter who's had two \n                         abortions in two years and got \n                         arrested last week at a rock festival \n                         for pushing drugs. They let her off. \n                         The typical affluent American family. \n                         I don't mean to be facile about this.\n\n               Indeed, he does not. He is horrified by the fact his eyes \n               are wet and he is verging on tears. He turns away quickly.\n\n                                     BOCK\n                         I blame myself for those two useless \n                         young people. I never exercised \n                         parental authority. I'm no good at \n                         that. Oh, God, I'm no good at this \n                         either. Joe, let's just forget the \n                         whole thing. I'm sorry I bothered \n                         you.\n\n               He starts for the door.\n\n                                     EINHORN\n                         How serious are your suicidal \n                         speculations, Herb?\n\n                                     BOCK\n                              (at the door)\n                         I amuse myself with different ways \n                         of killing myself that don't look \n                         like suicide. I wouldn't want to do \n                         my family out of the insurance.\n\n                                     EINHORN\n                         Digitalis will give you an arrhythmia.\n\n                                     BOCK\n                         A good toxologist would find traces. \n                         Potassium's much better. Sixty milli \n                         equivalent. Instantaneous. Of course, \n                         then you're stuck with how to get \n                         rid of the hypodermic. Forty milli \n                         equivalent. Gives you plenty of time \n                         to dispose of the evidence.\n\n                                     EINHORN\n                         You seem to have given considerable \n                         thought to the matter.\n\n                                     BOCK\n                         You ought to know a man who talks \n                         about it all the time never does it.\n\n                                     EINHORN\n                         I don't know. I see a man who's \n                         exhausted, emotionally drained, \n                         riddled with guilt, and has been \n                         systematically stripping himself of \n                         his wife, children, friends, isolating \n                         himself from the world. Are you \n                         impotent?\n\n                                     BOCK\n                         Intermittently.\n\n                                     EINHORN\n                         What does that mean?\n\n                                     BOCK\n                         It means I haven't tried in so long, \n                         I don't know. Let's just drop the \n                         whole thing, Joe. I feel humiliated \n                         and stupid. All I have to do is pull \n                         myself together and get back into my \n                         work. I'm sorry I troubled you. Take \n                         care of yourself. I'll see you.\n\n               Before Einhorn can say a word, he slips away and disappears \n               into his own office.\n\n               HOLLY PAVILION. 8:30 A.M.\n\n               The score of protesters outside the pavilion still move in \n               an uneven ellipse and shout: \"Two -- Four! Help the Poor!\" \n               Ives, the bespectacled demonstrator who shouted at Sundstrom \n               earlier, is removing his sandwich boards and giving them to \n               his replacement. He hurries across the walk and into...\n\n               HOLLY PAVILION, LOBBY\n\n               Ives cuts through the congestion of people and moves swiftly \n               up the long corridor leading to the Farkis Building, \n               unbuttoning his overcoat as he goes into...\n\n               THE FARKIS BUILDING, FIFTH FLOOR\n\n               ...and comes out, as the elevator opens. This is a laboratory \n               floor, and the corridors are empty except for a white-\n               uniformed orderly leaning against a wall and for one young \n               woman in a white smock in the background, who waves to the \n               young man before disappearing into one of the rooms. Ives \n               fishes out a ring of keys and unlocks the door to his own \n               lab. He enters into...\n\n               FARKIS BUILDING, NEPHROLOGY LAB\n\n               Dingy and cheerless place, as labs go. Ives hangs his coat \n               in the cupboard, loosens his tie, unbuttons his suit jacket, \n               squats on a stool, reaches over for a loose file on the work \n               table, opens the file and begins to read the papers inside.\n\n               A door CLICKS open behind him, and without looking up, he \n               waves briefly to whoever has entered. CAMERA DOLLIES to FULL \n               SHOT of Ives frowning over his notes. We are suddenly \n               conscious of a white-uniformed presence behind him. We know \n               it's medical personnel, but we can't see the face. Ives starts \n               to turn to the presence behind him, when suddenly a small \n               hospital sandbag is whipped down on his head, and he slumps \n               forward, his forehead thumping against the black surface of \n               the lab table.\n\n                                                               DISSOLVE TO:\n\n               HOSPITAL. NOON\n\n               HIGH ANGLE SHOT establishing the passing of hours. Sun high \n               overhead, traffic on First Avenue an impenetrable river of \n               HONKS and HOOTS. At a crosswalk, a loose procession of fifty \n               or so shouting demonstrators, bearing placards, flows toward \n               the main gates. Their posters read: \"FIGHT DOPE -- NOT DOPES!\" \n               \"DRUGS YES! TRANSPLANTS NO!\" and \"SAVE OUR KIDS FROM THE \n               SKIDS!\" which is what they now chant: \"Save our kids! From \n               the Skids!\" The demonstration moves through a handful of \n               city cops where our original group of twenty still ramble \n               around, chanting: \"Two -- Four! Help the Poor!\"\n\n               HOLLY PAVILION, EIGHTH FLOOR\n\n               The staff elevator doors open and Bock comes out, wearing \n               his long white doctor's coat unbuttoned. Hanging about the \n               Nurses' Station are Dr. Brubaker and a few young men in white. \n               They come quickly to respectful attention at Bock's entrance. \n               CLATTERING TRAYS dominate the lunchtime atmosphere.\n\n                                     BOCK\n                         All set?\n\n                                     BRUBAKER\n                         Yes, sir.\n\n               The doctors move off toward the solarium on the east corridor \n               overlooking the river. They pass a curious quartet of people \n               consisting of a very handsome YOUNG WOMAN in her late twenties \n               in an out-of-fashion miniskirt (She has great legs, long and \n               tanned.); an ELDERLY MAN, uncomfortable in city clothes and \n               unmistakably an INDIAN; a tall overcoated man in his forties \n               wearing a MINISTER's white collar; and a DISTINGUISHED MAN \n               dressed in fashionable gray who is trying to persuade the \n               young woman of something. The young woman and the Indian \n               stand absolutely still, silent, impassive. The minister is \n               more fidgety.\n\n                                     BOCK\n                              (to Brubaker en passant)\n                         Who's that exotic group?\n\n                                     BRUBAKER\n                              (murmurs)\n                         You got me. They've been here about \n                         an hour.\n\n                                     ONE YOUNG DOCTOR\n                         I think they're with the old man in \n                         Eight-O-Six.\n\n               Bock and Brubaker, trailed by young doctors, move into the \n               TV room.\n\n                                     BOCK\n                         Dr. Perry said he picked the \n                         tuberculosis and the liver nodes for \n                         today, right?\n\n                                     BRUBAKER\n                         Yes, sir.\n\n                                     BOCK\n                         Good. Because that's the one I studied \n                         up. A hell of a case.\n\n               EIGHTH FLOOR, TV ROOM\n\n               Some twenty-five or thirty young doctors, two or three of \n               them black, three or four of them women, fill the room. At \n               Bock's entrance, they find places around the walls, sofas, \n               soft chairs and benches. The TV set has been pushed into a \n               corner, and a large portable blackboard has been set up. \n               This is the Chief of Service Round, attended by every \n               available intern and resident. Somebody closes the door, \n               just as two young doctors come hurrying in.\n\n                                     BOCK\n                         All right, who's presenting?\n\n               EMERGENCY AREA, WAITING ROOM\n\n               People of all ages sit around on aluminum chairs arranged \n               around the walls of the room. All are in streetclothes. Some \n               speak to each other. A line of people, extending into the \n               hallway and holding their charts, waits for a lady from the \n               accounting department taking Blue Cross numbers. This lady \n               from accounting is MRS. CUSHING, late forties, bespectacled \n               and testy. She calls out at large.\n\n                                     MRS. CUSHING\n                         Is there anybody seated who hasn't \n                         been to see me first? Is there anyone \n                         here who hasn't given me their health \n                         insurance number?\n\n               Her phone RINGS. She picks it up.\n\n                                     MRS. CUSHING\n                         Emergency Room... Well, I don't know, \n                         Sybil. What's his name?\n\n               To a man on line at her desk, thrusting his chart out to \n               her.\n\n                                     MRS. CUSHING\n                         Would you wait a moment, please. I'm \n                         on the phone, can't you see I'm on \n                         the phone?\n                              (rummaging through a \n                              stack of charts, \n                              large paper forms in \n                              quadruplicate)\n                         ...Of course not, do they ever?\n                              (hangs up, takes two \n                              charts from the desk, \n                              pushes through the \n                              waiting line)\n                         Would you mind, please. I have to \n                         get through, do you mind?\n\n               She makes her way to the door and goes out into...\n\n               EMERGENCY AREA, ENTRANCE LOBBY\n\n               ...which is congested. Mrs. Cushing enters...\n\n               EMERGENCY, ADMITTING AND TREATMENT ROOMS\n\n                                     NURSE\n                              (on phone)\n                         Give me that one again... thirty-\n                         two?\n\n               Facing the desk are six curtained treatment rooms, mostly \n               open to view. Behind the desk are a supply room and another \n               treatment room. Both are occupied, the former by a PARANOID \n               LADY wringing her hands in a paranoid rush and listened to \n               by a very patient young intern.\n\n                                     PARANOID LADY\n                         They follow me everywhere. Three big \n                         black men. Naked, completely exposed. \n                         Right in the street. Hanging down to \n                         their knees. Disgusting. They're \n                         waiting out there for me now...\n\n               ...and in the other room, a man in his thirties is being \n               treated for some sort of head lacerations. In one treatment \n               room, the Chief of Emergency Service, DR. SPEZIO, a man in \n               his late thirties, along with an intern, an anesthesiologist \n               and a nurse, is bent over a naked and comatose young black \n               woman of eighteen, covered somewhat with a sheet. She's a \n               junkie, being intubated, i.e. a small endotracheal tube has \n               been inserted into her mouth. This is the most melodramatic \n               of the varied activity here.\n\n               A middle-aged man complaining of chest pains is lying clothed \n               in another treatment room; a nurse attends him.\n\n               An asthmatic middle-aged woman sits in still another room \n               being administered her 500 mg. of amenophylene subcutaneously.\n\n               The curtains on another room are drawn for privacy. On chairs \n               in the corner sit a teenage boy with a badly sprained ankle \n               and an elderly man bathing his hand in an enamel basin held \n               in his lap.\n\n               A young mother with a five-year-old daughter with a badly \n               cut arm is being attended to by the back wall. The Emergency \n               Room Nursing Supervisor, MISS ARONOVICI, a pretty woman in \n               her mid-twenties, is sterilizing the little girl's wound.\n\n               Mrs. Cushing makes her way to Miss Aronovici. They detest \n               each other.\n\n                                     MRS. CUSHING\n                         Did you call upstairs and tell them \n                         to admit a patient named Mitgang?\n\n                                     MRS. ARONOVICI\n                              (continuing to treat \n                              the little girl)\n                         The concussion?\n\n                                     MRS. CUSHING\n                         I don't know. They just called me. \n                         They said you didn't fill out the \n                         chart. And where do you come off \n                         sending anyone up to Admitting without \n                         my okay?\n\n               Miss Aronovici turns to Mrs. Cushing, regarding her sweetly.\n\n                                     MRS. ARONOVICI\n                         Sally, would you get the fuck out of \n                         here. The patient's in the Holding \n                         Room. You want his Blue Cross number, \n                         you go in and you get his Blue Cross \n                         number.\n\n               Mrs. Cushing elbows back through the line of patients waiting \n               at the Admitting desk.\n\n                                     MRS. CUSHING\n                         Do you mind, please...\n\n               There are now three nurses behind the desk, all of them on \n               phones. One nurse calls to Dr. Spezio.\n\n                                     NURSE\n                         O.P.D. wants to know how that \n                         asthmatic they sent down is.\n\n                                     DR. SPEZIO\n                              (just leaving the \n                              group around the \n                              junkie)\n                         She's fine. We'd like to keep her \n                         here a little while.\n\n               Spezio heads for the door where he is intercepted by Mrs. \n               Cushing.\n\n                                     MRS. CUSHING\n                         May I see you a moment, Doctor, if \n                         you don't mind.\n\n                                     DR. SPEZIO\n                              (sighs, calls back to \n                              the triage nurse)\n                         I'll be right back.\n\n               He goes out, followed by Mrs. Cushing, into...\n\n               EMERGENCY AREA, LOBBY\n\n               Spezio and Mrs. Cushing move between laundry and supply carts.\n\n                                     MRS. CUSHING\n                              (thrusting some papers \n                              at the doctor)\n                         If you don't mind, Doctor, is this \n                         your handwriting?\n\n               Spezio stops, sighs, examines the paper.\n\n                                     MRS. CUSHING\n                         Am I supposed to read that? Was it a \n                         sprain? Was it a broken wrist? I \n                         can't read that scribbling. I mean, \n                         I have to bill these people. I know \n                         you doctors are the ministering \n                         angels, and I'm just the bitch from \n                         the Accounting Department, but I \n                         have my job to do too. I mean, if \n                         you don't mind, Doctor...?\n\n                                     DR. SPEZIO\n                              (studies the paper)\n                         The kid had a collar fracture. We \n                         had him in the O.R. We reduced it \n                         and we gave him a small cast.\n\n               He strides off.\n\n                                     MRS. CUSHING\n                              (calls after him)\n                         But did you give him a sling? You \n                         must have taken X-rays. How am I \n                         supposed to make up the charges?\n\n               She turns into...\n\n               EMERGENCY AREA, HOLDING ROOM\n\n               Designed to hold patients who've been examined and wait to \n               be admitted to a room upstairs, it's in fact used for \n               examination, treatment, storage. The room is quiet. Two male \n               patients lie on comfortable stretchers, apparently sedated \n               and resting. Mrs. Cushing turns to the patient immediately \n               to her right as she enters. To the still figure she poses \n               her questions.\n\n                                     MRS. CUSHING\n                         Are you Mitgang?\n\n               She gets no answer from that bed. From another direction, a \n               voice.\n\n                                     MITGANG\n                         I'm Mitgang.\n\n               She turns to Mitgang. Something bothers her about the first \n               patient. She finds Mitgang's chart tucked in under his pillow, \n               takes out her pencil.\n\n                                     MRS. CUSHING\n                         Do you carry Blue Cross, Blue Shield, \n                         Mr. Mitgang, if you don't mind?\n\n               Mitgang, eyes closed, emits a sound.\n\n                                     MRS. CUSHING\n                         Do you have your card with you?\n                              (no answer)\n                         Do you know your number?\n\n               Negative grunt from Mitgang.\n\n                                     MRS. CUSHING\n                         Mr. Mitgang, you're not leaving this \n                         room until I have this information.\n\n                                     NURSE\n                              (enters for some chore)\n                         Will you leave that man alone?\n\n               In a fit of temper, Mrs. Cushing throws the chart and her \n               pencil down on the floor.\n\n                                     MRS. CUSHING\n                              (indicating the other \n                              patient)\n                         Do you mind if I at least ask this \n                         gentleman to fill out his chart?\n\n               She pulls his chart from under his pillow, bends and retrieves \n               her pencil from the floor, straightens. She speaks to the \n               silent patient.\n\n                                     MRS. CUSHING\n                         May I have your A.H.S. policy number, \n                         sir?\n\n               No answer. CAMERA MOVES SLOWLY IN on the patient. We now \n               recognize him as the bespectacled young activist Dr. Ives, \n               so recently coshed over the head with a sandbag.\n\n                                     MRS. CUSHING\n                              (looming)\n                         Do you carry Blue Cross? Blue Shield?\n\n               Mrs. Cushing stares at the patient. He is not breathing. \n               Behind her, the nurse exits carrying whatever she came for. \n               Mrs. Cushing turns to her, but she is gone. Frowning, Mrs. \n               Cushing backs out...\n\n               ...as Dr. Spezio and others come down the corridor.\n\n                                     MRS. CUSHING\n                              (as Spezio approaches, \n                              with spiteful relish)\n                         I think one of your patients in here \n                         is dead, Dr. Spezio.\n\n                                     DR. SPEZIO\n                              (enters the Holding \n                              Room)\n                         Why do you say that, Mrs. Cushing?\n\n                                     MRS. CUSHING\n                         Because he wouldn't give me his Blue \n                         Cross number, Dr. Spezio.\n\n               HOLDING ROOM\n\n               Spezio regards the death mask of a face.\n\n                                     DR. SPEZIO\n                         Oh, Christ.\n\n               He moves quickly forward to raise the dead man's eyelid. \n               Behind him, a nurse enters. He wheels on her angrily.\n\n                                     DR. SPEZIO\n                         How the hell long has this man been \n                         lying here? Isn't this that doctor \n                         who came in around nine o'clock?\n\n               MILTON MEAD'S OFFICE. 2:00 P.M.\n\n               MILTON MEAD, late thirties, lean, efficient but under constant \n               strain, is having his daily staff luncheon conference, which \n               consists of a CHIEF ENGINEER, the ASSISTANT ADMINISTRATOR OF \n               PERSONNEL, three residents in administration, including \n               Hitchcock, sandwiches and coffee.\n\n                                     CHIEF ENGINEER\n                         I mean, they gave me a hard time, \n                         Con Ed. \"For Pete's Sake,\" I said, \n                         \"this is a hospital. One of our \n                         feedlines just blew...\"\n\n               Mead's phone RINGS and he picks it up.\n\n                                     MILTON MEAD\n                         Yeah?\n                              (it's another \n                              annoyance; he sighs \n                              with irritation)\n\n                                     CHIEF ENGINEER\n                         I mean, it's lucky we traced it in \n                         time.\n\n                                     MILTON MEAD\n                              (on phone)\n                         No, I'll be right up.\n                              (hangs up, stands)\n                         Have we covered about everything?\n\n                                     ADMINISTRATIVE RESIDENT\n                         Dr. Kish has been driving me nuts \n                         with the O.R. schedule.\n\n                                     MILTON MEAD\n                         He's supposed to see me about that.\n\n               He moves across his office into...\n\n               MEAD'S SECRETARY'S OFFICE\n\n               Actually a communal office with desks for three secretaries.\n\n                                     MEAD'S SECRETARY\n                              (looks up to Mead \n                              from talking on the \n                              phone)\n                         This is the Emergency Room. One of \n                         the doctors just died of a heart \n                         attack.\n\n                                     MILTON MEAD\n                              (pauses)\n                         One of our staff?\n\n                                     MEAD'S SECRETARY\n                         I think so.\n\n               Mead frowns, leans back into his own office.\n\n                                     MILTON MEAD\n                              (to Hitchcock)\n                         Tom, you want to go down to the \n                         Emergency Room? One of our doctors \n                         just died.\n\n                                     HITCHCOCK\n                         What? Another one?\n\n                                     MILTON MEAD\n                         Yeah, see what that's about.\n                              (en passant to \n                              secretary)\n                         I'll be on Holly Eight. I'll be right \n                         back.\n\n               HOLLY PAVILION, EIGHTH FLOOR\n\n               The staff elevator door opens, and Milton Mead comes out. He \n               has apparently been buttonholed in the elevator by a woman \n               in a doctor's coat, DR. IMMELMAN, Pathology, who follows him \n               out...\n\n                                     DR. IMMELMEN\n                         It's no longer pilferage, Milton. \n                         It's reached the point of piracy. \n                         That's the third microscope this \n                         month.\n\n                                     MILTON MEAD\n                         Why don't we get together on this \n                         sometime this afternoon, Fran?\n\n                                     DR. IMMELMAN\n                         One o'clock?\n\n                                     MILTON MEAD\n                         One o'clock will be fine.\n\n               He turns left and heads for...\n\n               HOLLY PAVILION, EIGHTH FLOOR, NURSES' STATION\n\n               ...where Head Nurse Donovan is bent over her paperwork. In \n               the background, we see normal morning hospital activity. \n               Nurse's Aid, SHARLENE STONE, takes towels into a room. R.N. \n               Felicia Chile comes out of another, bearing her enamel tray \n               of instruments.\n\n               Also in the background, the curious quartet from before -- \n               the beautiful woman, the elderly Indian, the minister, Dr. \n               Sutcliffe. Mead hardly notices them as he makes for the desk.\n\n                                     MRS. DONOVAN\n                              (without pausing or \n                              looking up)\n                         Your brother's in the room, Mr. Mead.\n\n                                     MILTON MEAD\n                         What room is it?\n\n                                     MRS. DONOVAN\n                         Eight-O-Six.\n\n               Mead bobs his head thank you and heads for the west corridor.\n\n               EIGHTH FLOOR, ROOM\n\n               As Milton Mead enters, his elder brother, WILLIAM MEAD, mid-\n               forties, a smaller and manifestly nervous man, is seated \n               sullenly puffing a cigar, fidgeting, still wearing his coat \n               and hat. He looks up briefly when Milton enters and avoids \n               his brother's eye. His wife, MARILYN, late thirties, is \n               standing in suppressed exasperation, staring out the window. \n               Out of respect for the COMATOSE PATIENT, the ensuing agitated \n               scene is held in whispers.\n\n                                     MILTON MEAD\n                         For heaven's sake, Willie, you're \n                         going to be in the hospital for two \n                         lousy days. What're you making such \n                         a fuss about?\n\n                                     WILLIAM MEAD\n                         You're supposed to be such a big \n                         wheel here.\n\n                                     MILTON MEAD\n                         There are no private rooms available. \n                         If they brought in Jesus Christ fresh \n                         off the cross, I couldn't get Him a \n                         private room.\n\n                                     WILLIAM MEAD\n                         I'm not going to stay in a room with \n                         a dying man...\n\n                                     MARILYN MEAD\n                         He's not dying. They'll screen him \n                         off. You won't even know he's here.\n\n                                     MILTON MEAD\n                         If you want a private room, go on \n                         home, and I'll call you the first \n                         one that comes up. But you're the \n                         one who phoned me in a panic, you're \n                         going on a vacation. For heaven's \n                         sake, Willie, they'll cut this polyp \n                         out tomorrow morning. You'll be home \n                         Thursday, you'll be in Miami Friday. \n                         Marilyn, will you talk some sense \n                         into this lunatic?\n\n                                     MARILYN MEAD\n                         Well, you said it, he's a lunatic.\n\n                                     WILLIAM MEAD\n                         Big wheel, can't even get me a private \n                         room.\n\n                                     MILTON MEAD\n                         I'll get you a tranquilizer...\n\n               He exits.\n\n               EIGHTH FLOOR, TV ROOM\n\n               Bock -- excited, vivid, alive -- is in full flush with his \n               lecture. He moves around in front of the blackboard, chalk \n               in hand. The blackboard itself is scrawled with formulae and \n               diagrams. He is writing the words \"full abdomen,\" as the \n               fifth in a list reading \"(1) parexia, (2) hepatomegaly, (3) \n               splenomegaly, (4) episodes of arthralgia.\" The audience is \n               forty young doctors rapt with attention. There is a good \n               deal of note-taking.\n\n                                     BOCK\n                         ...five, a full abdomen contrasted \n                         to wasting elsewhere; six, ascites \n                         with a protein content above four \n                         grams; unexplained anemia, leukopenia, \n                         unexplained elevation of the serum \n                         gamma globulin level, especially \n                         abnormal flocculation tests, and of \n                         course, a positive P.P.D. All these \n                         findings assume special significance \n                         among Negroes. This has been a very \n                         commendable workup, as commendable a \n                         workup of an F.U.O. as I can remember. \n                         The staff of this floor is to be \n                         applauded.\n                              (spots Brubaker among \n                              the others)\n                         It's a reportable case, Brubaker. \n                         Write it up.\n                              (a brief, rare smile)\n                         Well, let's go have a look at the \n                         girl.\n\n               He rumbles toward the door. The class of doctors dissolves \n               into hospital murmurs and mutters and a general dispersal. \n               They follow Bock out to...\n\n               EIGHTH FLOOR, EAST CORRIDOR\n\n               ...where Dr. Sutfcliffe, the beautiful young woman, the \n               elderly Indian and the minister are engaged in agitated \n               discussion. The girl and the Indian retain their stoic \n               impassivity. Dr. Sutcliffe leaves them and moves down the \n               corridor to the counter of...\n\n               EIGHTH FLOOR NURSES' STATION\n\n                                     SUTCLIFFE\n                         Nurse! Nurse, who's the Senior \n                         Resident on this floor?\n\n                                     NURSE\n                         That would be Dr. Brubaker. But I'm \n                         afraid he's at Chief of Service rounds \n                         right now.\n\n               Sutcliffe points off right.\n\n                                     SUTCLIFFE\n                         That's... this way?\n\n               The nurse nods indifferently.\n\n               ACROSS to Bock coming out of the TV room, followed by some \n               dozen young doctors. Bock is in very good spirits indeed. He \n               quizzes his young doctors en route:\n\n                                     BOCK\n                         I wonder if there might not be some \n                         correlation between hepatic \n                         tuberculosis and drug addiction. \n                         Presumably, there was an early \n                         consideration of S.B.E.\n\n                                     BRUBAKER\n                              (off-screen)\n                         Yes, sir. We discounted it after \n                         repeated blood cultures were negative.\n\n                                     BOCK\n                         You, Ambler. Is that right, Ambler?\n\n                                     AMBLER\n                         Yes, sir.\n\n                                     BOCK\n                         What else do you look for in bacterial \n                         endocarditis?\n\n                                     AMBLER\n                              (nervous)\n                         Some sort of embolic phenomena, sir.\n\n                                     BOCK\n                         Good.\n\n                                     SUTCLIFFE\n                              (flagging Brubaker)\n                         Dr. Brubaker, I wonder if I could \n                         see you for a moment?\n\n               Brubaker detaches himself from his group to join Sutcliffe. \n               CAMERA STAYS with Bock and his entourage, following them \n               down the east corridor, Bock still happily conducting class. \n               Bock strides into...\n\n               ROOM 819\n\n               Past two beds, they group around the foot of a third bed on \n               the right side of the room. Bock checks the patient lying in \n               the bed.\n\n                                     BOCK\n                         Still a little icteric. Who's got an \n                         opthalmoscope?\n\n               One of the young men hands his to Bock, who leans over the \n               patient to look through it.\n\n                                     BOCK\n                         Did anyone note Roth spots?\n\n               The doctors exchange a look as Bock rises, moves toward them, \n               laughing.\n\n                                     BOCK\n                         Well, don't worry about it. There \n                         aren't any. Ambler, you're our big \n                         man on S.B.E. What was the latex-\n                         fixation?\n\n                                     BIEGELMAN\n                         It wasn't done, sir.\n\n                                     BOCK\n                         Don't you think that's an important \n                         test to differentiate S.B.E. from \n                         miliary T.B.?\n\n                                     BIEGELMAN\n                              (off-screen)\n                         No, s...\n\n                                     BOCK\n                         Not you, Biegelman. Ambler.\n\n                                     AMBLER\n                         Well, there's about a seventy percent \n                         incidence of false-positive latex in \n                         S.B.E.\n\n               Bock hands the opthalmoscope to Ambler.\n\n                                     BOCK\n                         You have been reading up. If the \n                         diagnosis were S.B.E., would a \n                         positive latex indicate anything in \n                         the therapy?\n\n                                     AMBLER\n                         We'd expect the latex to become \n                         negative.\n\n                                     BOCK\n                         If...?\n\n                                     AMBLER\n                         If the antibiotic therapy were \n                         successful.\n\n                                     BOCK\n                         Are you applying for your internship \n                         here?\n\n                                     AMBLER\n                         I'm not sure.\n\n                                     BOCK\n                         Come and see me.\n                              (to the patient, \n                              helping her up)\n                         Would you sit up for a minute?\n\n               Bock turns to the off-screen patient, helping her sit up and \n               forward, percussing her back as the students look on.\n\n               EIGHTH FLOOR, EAST CORRIDOR\n\n               Brubaker and Sutcliffe are now both involved in discussion \n               with the woman, the Indian and the minister, as Bock drifts \n               through the background, followed by the band of young doctors \n               now dispersing. Bock crosses past the foreground group to \n               the staff elevator. He pushes the button. Brubaker approaches \n               Bock. They confer quietly in the hallway.\n\n                                     BRUBAKER\n                         We've got a little thing over here, \n                         Doctor. The girl over there is the \n                         daughter of the patient in Eight-O-\n                         Six. He is at the moment comatose \n                         and requires intravenous feeding and \n                         meds.\n\n               The elevator comes and goes, disgorging some, taking on \n               others. Bock, who greeted Brubaker with a rare, benign smile, \n               has begun to look a bit sodden. Poor Brubaker, aware of the \n               gathering storm in Bock's demeanor, sighs and continues \n               regardless.\n\n                                     BRUBAKER\n                         The thing is, the daughter wants to \n                         take the father out of the hospital \n                         and back to Mexico where they live. \n                         The patient's name is Drummond. He's \n                         apparently a Methodist missionary, \n                         and he and his daughter run some \n                         kind of religious mission among the \n                         Apache Indians. The daughter claims \n                         to be a licensed nurse, so she can \n                         give the necessary I.V. treatment. I \n                         certainly don't think he should be \n                         let out of this hospital. The \n                         Attending -- he's the guy in gray \n                         over there -- concurs.\n\n               Bock squints at Brubaker.\n\n                                     BOCK\n                         All right, wait a minute. Let me \n                         have all that again.\n\n                                     BRUBAKER\n                         As a matter of fact, Doctor, this is \n                         Dr. Biegelman's case.\n\n                                     BOCK\n                         Never mind the professional ethics, \n                         what happened?\n\n                                     BRUBAKER\n                              (sighs)\n                         I don't know why I'm covering for \n                         that sonofabitch in Farkis Pavilion \n                         anyway.\n                              (sighs and begins)\n                         The patient, a man of fifty-six, was \n                         admitted to the hospital ten days \n                         ago for a check-up, in good health, \n                         no visible distress. We did the \n                         mandatory work-up on him. Blood \n                         cultures, stool, L.E. preps, chest, \n                         E.K.G., all negative. But there was \n                         apparently some evidence of protein \n                         in his urine. I don't know how that \n                         sonofabitch in Farkis Pavilion ever \n                         found out about it. Maybe he had \n                         some kind of deal with one of the \n                         girls in the lab. Anyway, he turned \n                         up the next day, conned the patient \n                         into signing an authorization for a \n                         biopsy...\n\n                                     BOCK\n                         What sonofabitch in Farkis Pavilion?\n\n                                     BRUBAKER\n                         Some post-grad fellow named Ives. \n                         Elroy Ives. I never met him. He's on \n                         one of the immunology research \n                         programs.\n\n                                     BOCK\n                         Are you trying to tell me some post-\n                         grad fellow came up here and did a \n                         biopsy on the patient?\n\n                                     BRUBAKER\n                         Yes, sir. He conned Biegelman with \n                         that old story about...\n\n                                     BOCK\n                         ...protein in the urine?\n\n                                     BRUBAKER\n                         Yes, sir.\n\n                                     BOCK\n                         And he biopsied the man?\n\n                                     BRUBAKER\n                         And he nicked a vessel, and at two \n                         o'clock in the morning, they woke up \n                         Biegelman because the nurse found \n                         the patient in shock. Biegelman called \n                         the kidney people for a consult right \n                         away. What was there to see? The man \n                         was sour and bleeding. We spoke to \n                         this fellow Sutcliffe, and he referred \n                         us to a surgeon named Welbeck...\n\n                                     BOCK\n                         Welbeck?! That barber!\n\n                                     BRUBAKER\n                         You ain't heard nothing yet. So we \n                         finally got Welbeck around four in \n                         the morning. He said, go ahead. So \n                         they laid on the surgery for eight. \n                         Welbeck turns up, half-stoned, orders \n                         an I.V.P., clears him for allergies...\n\n                                     BOCK\n                         ...without actually testing.\n\n                                     BRUBAKER\n                         Right.\n\n                                     BOCK\n                         And the patient went into shock...\n\n                                     BRUBAKER\n                         ...and tubular necrosis. They lopped \n                         out the bleeding kidney, ran him \n                         back to the room, and we sat around \n                         waiting for three days to see how \n                         obstructed he was. Fever began spiking \n                         like hell, euremia, vomiting, so we \n                         arranged hemodialysis. He's putting \n                         out good water now. But some nurse \n                         goofed on his last treatment. A leak \n                         in the tube, something. His blood \n                         pressure plunged. They ran him right \n                         up to I.C.U., checked out vital signs, \n                         all normal except he's comatose. \n                         That was two days ago.\n\n                                     BOCK\n                         In short, a man came into this \n                         hospital in perfectly good health, \n                         and, in the space of one week, we \n                         chopped out one kidney, damaged the \n                         other, reduced him to coma and damn \n                         near killed him.\n\n                                     BRUBAKER\n                         Yes, sir.\n\n               A great sad serenity has settled over Bock.\n\n                                     BOCK\n                         You know, Brubaker, last night I sat \n                         in my hotel room, reviewing the \n                         shambles of my life and contemplating \n                         suicide. Then I said \"No, Bock, don't \n                         do it. You're a doctor, a healer. \n                         You're the Chief of Medicine at one \n                         of the great hospitals of the world. \n                         You're a necessary person. Your life \n                         is meaningful.\" Then I came in this \n                         morning and find out one of my doctors \n                         was killed by a couple of nurses who \n                         mistook him for a patient because he \n                         screwed a technician from the \n                         nephrology lab...\n\n                                     BRUBAKER\n                         Hematology, sir.\n\n                                     BOCK\n                         And now you come to me with this \n                         gothic horror story in which the \n                         entire machinery of modern medicine \n                         has apparently conspired to destroy \n                         one lousy patient. How am I to sustain \n                         my feeling of meaningfulness in the \n                         face of this? You know, Brubaker, if \n                         there was an oven around, I'd stick \n                         my head in it. What was the name of \n                         that sonofabitch from Farkis Pavilion \n                         again?\n\n                                     BRUBAKER\n                         Ives, sir. Elroy Ives. Somebody ought \n                         to ream his ass.\n\n               The gathering storm erupts. Rage suffuses Bock's face. Out \n               of respect for the hospital corridor and the people working \n               around him and Brubaker, he keeps it glacial. But there is \n               no mistaking the volcanic fury he feels.\n\n                                     BOCK\n                              (barely containing \n                              himself)\n                         I'm going to ream his ass. And I'm \n                         going to break that barber Welbeck's \n                         back. I'm going to defrock those two \n                         cannibals. They won't practice in my \n                         hospital, I'll tell you that!\n\n                                     BRUBAKER\n                         What'll I tell the girl, sir? She \n                         says we have no legal right to stop \n                         her from taking her father out. She's \n                         willing to sign an A.O.R. form.\n\n                                     BOCK\n                         Let him go. Before we kill him.\n\n               The elevator door opens. A couple of nurses come out. Bock \n               strides in.\n\n               SEVENTH FLOOR, DEPT. OF MEDICINE CORRIDOR\n\n               Bock advances in a cold fury down to his office. He wrenches \n               the door open.\n\n               BOCK'S OFFICE, OUTER OFFICE\n\n               Miss Lebow and Miss McGuire clatter away at typewriters. \n               Sitting on a chair in the crowded office is a senior staff \n               doctor, a man in his late forties, wearing a coat similar to \n               Bock's. He is DR. LAGERMAN. He looks up from the magazine \n               he's been leafing through as Bock storms in.\n\n                                     DR. LAGERMAN\n                         Hi, Herb...\n\n               Bock acknowledges him with a brusque nod, storms over to \n               Miss Lebow.\n\n                                     BOCK\n                         Get me Dr. Gilley. Put him on page \n                         if you have to. I want to talk to \n                         him right now. I don't care if he's \n                         operating.\n                              (wheels around to \n                              Miss McGuire)\n                         And you get me some monkey named \n                         Ives. Ives. I-V-E-S, first name Elroy. \n                         He's in the Farkis Pavilion.\n\n                                     DR. LAGERMAN\n                         Herb...\n\n                                     BOCK\n                         I want to talk to you, Joe. Would \n                         you mind coming into my office?\n\n               He strides, followed by Dr. Lagerman, into...\n\n               BOCK'S PRIVATE OFFICE\n\n               ...and slams the door shut behind him.\n\n                                     BOCK\n                         Have you got some punk named Ives \n                         rotating in your department?\n\n                                     DR. LAGERMAN\n                         Listen, Herb...\n\n                                     BOCK\n                              (sits at his desk)\n                         I also want to know what the hell \n                         kind of a dialysis room you're \n                         running. I just came from...\n\n               The phone RINGS. Bock seizes it.\n\n                                     BOCK\n                         Yeah... Gilley? Put him on. Bock. \n                         Didn't you tell me a couple of months \n                         ago you were going to cut off all \n                         privileges for that assassin, Welbeck? \n                         Yeah. Wellbeck. He just butchered \n                         another one of my patients... Oh, \n                         come on, Harry! The man's a buccaneer! \n                         I want him brought before the Medical \n                         Executive Committee... He's in your \n                         department, Harry, not mine. He's \n                         putatively a surgeon!... I'll be \n                         here!\n                              (slams receiver down, \n                              stares at Lagerman)\n                         Listen, Joe, I think you should know \n                         that you've got a research guy in \n                         your department named Ives who's \n                         been doing some very dubious biopsies. \n                         We're having enough trouble squeezing \n                         grants out of the Nixon \n                         administration...\n\n                                     DR. LAGERMAN\n                         Ives is dead, Herb. That's why I'm \n                         here.\n\n               This gives Bock pause. He blinks at Lagerman.\n\n                                     BOCK\n                         What do you mean, Ives is dead?\n\n                                     DR. LAGERMAN\n                         I mean he's dead. He had a heart \n                         attack in the Emergency Room.\n\n                                     BOCK\n                         He had a heart attack in the Emergency \n                         Room?\n\n                                     DR. LAGERMAN\n                         Yeah.\n\n                                     BOCK\n                              (blinking)\n                         What the hell is this? Some kind of \n                         plague?\n                              (stands)\n                         Where is he now?\n\n                                     DR. LAGERMAN\n                         They were just taking him down to \n                         Pathology.\n\n               HOLLY PAVILION, FIRST FLOOR, PATHOLOGY DEPT\n\n               Bock, Lagerman and Hitchcock have gathered across the shrouded \n               figure of Dr. Ives on a stretcher. We are in the lab section \n               of Pathology; in the background, through the glass part of \n               the door separating the lab from the surgery room, we can \n               see the autopsy on Dr. Schaefer being performed.\n\n               Schaefer's naked white cadaver is stretched out on an \n               operating table. He has been opened up and all his vital \n               organs are being excised. It's bloody. The autopsy is being \n               performed by DR. BREWSTER, the Resident in Pathology, dressed \n               in surgical scrub.\n\n                                     HITCHCOCK\n                         ...and the next thing anybody knew, \n                         about three hours later, Mrs. Cushing \n                         from Accounting came in and said \n                         there was a dead man in the Holding \n                         Room.\n\n                                     BOCK\n                         You don't find anything grotesque \n                         about all this?\n\n                                     HITCHCOCK\n                         What do you mean?\n\n                                     BOCK\n                         I mean, at half past eight this \n                         morning, we meet over a doctor who's \n                         been killed intravenously, and here \n                         we are again, four hours later, with \n                         another doctor who had a heart attack \n                         in the Emergency Room.\n\n                                     HITCHCOCK\n                         Well, what're you suggesting Doctor? \n                         Do you think we have a mad killer \n                         stalking the halls of the hospital? \n                         Presumably, Dr. Ives died of a heart \n                         attack and Schaefer in a diabetic \n                         coma. People do die of these things. \n                         It's all perhaps coincidental, but I \n                         don't think I'd call it grotesque.\n\n                                     BOCK\n                         How long are they going to be on \n                         Schaefer's post?\n\n               He knocks on the glass window of the door separating the \n               laboratory from the operating room. Dr. Brewster turns from \n               his gory chore. Bock makes a gesture saying, \"How much \n               longer?\" Brewster raises ten blood-drenched rubber-gloved \n               fingers. Bock turns and shuffles across the lab for the door \n               out.\n\n                                     BOCK\n                              (pauses at door, to \n                              Lagerman)\n                         I don't suppose you'd like to call \n                         next of kin?\n\n                                     DR. LAGERMAN\n                         No thanks.\n\n                                     BOCK\n                              (deeply depressed)\n                         Oh God, I need a drink.\n\n               He goes down...\n\n               THE PATHOLOGY CORRIDOR\n\n               ...and is soon lost in the normal traffic of the area.\n\n               THE HOSPITAL. NIGHT\n\n               CRASH of THUNDER. CRACKLE of LIGHTNING. A horror-film \n               rainstorm lashes the vast dark complex of buildings.\n\n               SEVENTH FLOOR, DEPT. OF MEDICINE CORRIDOR\n\n               Dark, empty, silent. One lonely light at the lobby end of \n               the long, closed corridor of offices. The door to Bock's \n               office stands ajar and issues a trace of light.\n\n               BOCK'S OFFICE\n\n               ACROSS the silent, dark, typewriter-covered desks of the two \n               secretaries through the doorway to Bock's private office, we \n               can see Bock at his desk, lit by the desk lamp. He has a \n               bottle of booze on his desk. He gets up from his desk. He \n               has made a decision.\n\n               HOLLY PAVILION, EIGHTH FLOOR\n\n               The corridors are silent; the night lights are on, subdued. \n               Head Evening Nurse Mrs. Dunne is back at her desk, hunched \n               over paperwork. Resident Brubaker passes by.\n\n               EIGHTH FLOOR, PHARMACY\n\n               Nurse SHERLEE DEVINE, a black woman in her mid-twenties, has \n               a porcelain tray on the shelf onto which she puts a small \n               jar of alcohol, cotton swabs, a wrapped hypodermic needle \n               and syringe. She moves out into...\n\n               NURSES' STATION\n\n               ...where Mrs. Dunne looks up as she passes.\n\n                                     NURSE DEVINE\n                         Mead.\n\n               Mrs. Dunne nods. Nurse Devine makes her way silently down \n               the sleeping doors to...\n\n               ROOM 806\n\n               Dark, sleeping. The bathroom light is on, but only a thin \n               stream of yellow light trickles through the door. THUNDER \n               CRASHES. William Mead sleeps fitfully. The other patient is \n               entirely curtained off. Nurse Devine sets her tray on Mead's \n               bedtable, turns on the goose-neck lamp, keeping it from his \n               eyes. She unwraps the hypodermic syringe, sets in the needle, \n               draws the required dosage, reaches over and gently shakes \n               Mead by the shoulder.\n\n                                     NURSE DEVINE\n                              (softly)\n                         Mr. Mead... Mr. Mead, I have an \n                         injection for you.\n\n               Mead sleeps on. Expressionlessly, Nurse Devine extracts Mead's \n               right arm from under the sheets, wets a swab with alcohol \n               and rubs down the vein. The needle slides into Mead's vein. \n               OVER THIS, we begin to hear a distant sibilant HISSING, \n               indistinct like the leakage of a bad heart. There is also an \n               occasional distinctly human but not quite civilized sound.\n\n               CAMERA PULLS BACK SLOWLY to Nurse Devine withdrawing the \n               needle, looking up, for she too has heard the soft, strange \n               sounds. They emanate from behind the curtains of the other \n               bed. Nurse Devine returns the syringe to the tray, gathers \n               her things and pads silently around Mead's bed to Drummond's \n               bed. With her free hand, she opens the curtains a little and \n               stares in.\n\n                                     NURSE DEVINE\n                         What the hell is going on in there?\n\n               NURSE DEVINE'S P.O.V.: THE INDIAN AND BARBARA DRUMMOND BEND \n               OVER DRUMMOND PERFORMING SOME PAGAN RITUAL. THE HISSING IS \n               BARBARA'S CONTRIBUTION TO THE CEREMONY. (IT SOUNDS LIKE PIS-\n               PIS, AND IS IN FACT AN IMITATION OF THE NIGHTHAWK, MEANT TO \n               APPEASE THE SPIRIT OF THE THUNDER.)\n\n               The old Indian has stripped to the waist and marked his body \n               with smears of dye and tule pollen. He wears a ceremonial \n               hat, a sort of beaded beanie. He holds a small buckskin bag \n               of pollen in his cupped palms and is facing north, east, \n               south and west, offering the bag and prayers under his breath \n               as he does. A beaded amulet lies stretched across the white \n               sheet covering the comatose Drummond.\n\n               When Nurse Devine draws the curtains, Barbara frowns at Nurse \n               Devine, holds a cautioning finger to her lips and draws the \n               curtains closed again. Nurse Devine, carrying her porcelain \n               tray, exits.\n\n               EIGHTH FLOOR, NURSES' STATION\n\n               Bock comes out of the elevator, jacketed now, fairly drunk \n               but holding it well.\n\n               He heads for the Nurses' Station as Nurse Devine comes down \n               the west corridor. Bock grunts at Mrs. Dunne and goes into...\n\n               PHARMACY\n\n               ...where he quickly runs his finger along the second shelf \n               until he comes to the bottle of potassium which he filches \n               off the shelf and slips into his pocket. He rummages through \n               the drawers for a hypodermic syringe. Through the open \n               doorway, we see Nurse Devine making her way swiftly up to \n               Mrs. Dunne at the desk.\n\n                                     NURSE DEVINE\n                         Well, honey, we got a witch-doctor \n                         in Eight-O-Six, and you better go in \n                         there. You know that Indian that was \n                         sitting in Eight-O-Six all night? \n                         He's still there, and the girl's \n                         there, and they're doing some voodoo \n                         in there, and I ain't kidding.\n\n               Behind Mrs. Dunne, Bock appears in the doorway to the pharmacy \n               where he stands listening.\n\n                                     MRS. DUNNE\n                              (looking up)\n                         What are you talking about?\n\n                                     NURSE DEVINE\n                         I mean that Indian's in there, half-\n                         naked and going pis-pis-pis with a \n                         little bag. You just better get in \n                         there, Mrs. Dunne.\n\n               Mrs. Dunne, annoyed, gets up and heads for the west corridor, \n               followed by Nurse Devine and by an intrigued Dr. Bock at a \n               few paces behind.\n\n                                     NURSE DEVINE\n                              (to NURSE WEITZENBAUM, \n                              coming out of another \n                              room)\n                         You want to see somethin', baby? You \n                         jus' come here.\n\n               As the small procession bears down, Barbara Drummond slips \n               out of that room to intercept them.\n\n                                     BARBARA\n                              (keeping her voice \n                              low)\n                         Look, it's a perfectly harmless \n                         ceremony, nothing to get excited \n                         about. It'll be over in a few minutes \n                         anyway. Mr. Blacktree is a shaman \n                         who gets his power from the thunder, \n                         and it's imperative he conclude his \n                         rituals while the storm is still \n                         going on.\n\n                                     NURSE DUNNE\n                         Visiting hours were over at nine \n                         o'clock, Miss.\n\n               Bock reaches for the door to the room.\n\n                                     BARBARA\n                         All that's going on in there, Doctor, \n                         is a simple Apache prayer for my \n                         father's recovery.\n\n               Bock makes a vague noise, neither contradicting her nor \n               assenting, and continues around her into...\n\n               ROOM 806\n\n               As Bock slides in, a bit of the corridor light comes in with \n               him. The curtains have been left sufficiently open to reveal \n               Mr. Blacktree. He is still stripped to the waist and marked \n               with crosses of pollen. He extends two twigs to the four \n               directions after which he places the twigs carefully on the \n               white sheet covering Drummond in a pattern around the amulet \n               already there. Behind Bock, Mrs. Dunne can be seen peeking \n               in. The Indian is oblivious to both of them. Bock watches it \n               all with interest for a moment and then backs out into...\n\n               EIGHTH FLOOR CORRIDOR\n\n               ...closing the door after him.\n\n                                     BARBARA\n                         The markings he's made on my father's \n                         arms are from the pollen of the tule \n                         plant. The twigs have no significance \n                         other than they've been struck by \n                         lightning and are consequently appeals \n                         to the spirit of lightning. It's all \n                         entirely harmless, a religious \n                         ceremony, not a medical one.\n\n                                     BOCK\n                         You don't seriously believe all that \n                         mumbo-jumbo will cure him?\n\n                                     BARBARA\n                         On the other hand, it won't kill \n                         him, Doctor.\n\n               They regard each other levelly.\n\n                                     BOCK\n                              (grunts)\n                         Okay. Go ahead.\n\n               He wheels and clumps off for the stairway exit.\n\n                                     BARBARA\n                         Thank you.\n\n               Nurse Weitzenbaum opens the door of the room and peeks in. \n               At the stairway exit, Bock pauses to look back at all the \n               women in front of Room 806.\n\n                                     BOCK\n                         Miss Drummond, are you still taking \n                         your father out?\n\n                                     BARBARA\n                         Yes. I still have to arrange an \n                         ambulance service. Is there a phone \n                         around I could use?\n\n                                     BOCK\n                         Use my office.\n\n                                     BARBARA\n                         Thank you.\n\n               Bock exits. Barbara edges past Weitzenbaum, who is still \n               peeking into the room.\n\n               ROOM 806\n\n               Barbara comes in, gathers her coat and purse from a chair \n               and moves to the Indian, now occupied with what seems to be \n               the rolling of a cigarette. The two exchange a brief dialogue \n               in Apache. The old Indian nods. Barbara turns and exits, \n               taking Nurse Weitzenbaum out with her and closing the door. \n               The room is dark and hushed again. Blacktree lights his \n               cigarette and \"sends the smoke up,\" a ritual which consists \n               of puffing smoke to each of the four directions, muttering \n               in Apache \"May all be well\" after each puff.\n\n               CAMERA SLOWLY PANS to the other bed where William Mead sleeps \n               fitfully. The Apache words and pis-pis-pis penetrate Mead's \n               drugged sleep. He opens one eyelid and stares glazedly at \n               the dark air. The SOUNDS persist. Blacktree chooses this \n               moment to sidle out from behind the curtains and continue \n               his ritual in the less-confined space at the head of \n               Drummond's bed. It's quite a sight for a nervous, sedated \n               man to wake to.  Thunder RUMBLES and the rain SLASHES and a \n               sudden, savage STREAK of lightning illuminates it all.\n\n               Mead figures it's all a bad dream and, after a moment of \n               dully regarding the odd spectacle, closes his one eye and \n               goes back to sleep.\n\n               BOCK'S OFFICE, OUTER OFFICE\n\n               Barbara Drummond comes in. Bock has apparently turned the \n               lights on for her, but Bock himself is not immediately \n               visible. She looks through the half-open door to Bock's \n               private office, and there he is, staring blankly at the \n               bottle. Barbara starts to say something, thinks better of \n               it, lays down her coat, and looking around, spots a Manhattan \n               classified directory which she hauls up from its shelf and \n               sets on Miss Lebow's desk. She sits, quickly flips through \n               the pages.\n\n               Barbara flips through the directory. Bock is partially visible \n               in the background at his desk. He sits soddenly. Barbara \n               finds what she wants, opens her purse and takes out two \n               airplane tickets. She dials. The CLICKING of the dial catches \n               Bock's ear. He looks up for a moment.\n\n                                     BARBARA\n                              (on phone)\n                         Hello. I'd like to arrange an \n                         ambulance for one-thirty tomorrow \n                         afternoon... Thank you...\n\n               REVERSE ACROSS Bock at his desk with Barbara partially visible \n               at Miss Lebow's desk. All he can see are her great long tanned \n               legs.\n\n                                     BARBARA\n                              (in background on \n                              phone)\n                         ...Drummond, first name, Barbara. \n                         I'll pay cash...\n\n               Bock stands a little unsteadily and moves around his desk to \n               get a better look at those legs.\n\n                                     BARBARA\n                              (on phone)\n                         No, you're to pick up my father, \n                         Drummond, Edward, at the Manhattan \n                         Medical Center, Holly Pavilion, Room \n                         Eight-O-Six. It's a stretcher case. \n                         I presume you provide the stretcher.\n\n               She senses Bock watching her, turns, smiles. She's a very \n               beautiful girl. She returns to the phone.\n\n                                     BARBARA\n                         He's to be taken to American Airlines, \n                         Yes... No... Kennedy Airport, Flight \n                         Seven-Two-Nine to Yuma, Arizona. \n                         I'll accompany the patient... Yes, \n                         thank you.\n\n               She returns the receiver to its cradle. When she looks up \n               again, Bock is no longer there. She returns the flight tickets \n               to her purse, snaps it shut, stands and moves to the doorway, \n               enters a step into...\n\n               BOCK'S OFFICE\n\n               Bock, back at his desk, looks up.\n\n                                     BOCK\n                         You believe in witchcraft, Miss \n                         Drummond?\n\n                                     BARBARA\n                         I believe in everything, Doctor.\n\n                                     BOCK\n                         Like a drink?\n\n                                     BARBARA\n                         Yes.\n\n               Bock drains his glass and pours her a hefty shot of bourbon.\n\n                                     BARBARA\n                              (from the door suddenly)\n                         My father, you should know, was a \n                         very successful doctor in Boston, a \n                         member of the Harvard Medical Faculty. \n                         He was a widower, and I was his only \n                         child. He was not an especially \n                         religious man, a sober Methodist. \n                         One evening, seven years ago, he \n                         attended a Pentecostal meeting in \n                         the commons rooms at Harvard and \n                         suddenly found himself speaking in \n                         tongues.\n                              (she takes her drink \n                              and crosses to the \n                              sofa)\n                         That is to say, he suddenly sank to \n                         his knees at the back of the room \n                         and began to talk fluently in a \n                         language which no one had ever heard \n                         before. This sort of thing happens \n                         frequently at Pentecostal meetings, \n                         and they began to happen regularly \n                         to my father.\n                              (she sits)\n                         It was not unusual to walk into our \n                         home and find my father sitting in \n                         his office, utterly serene and happily \n                         speaking to the air in this strange \n                         foreign tongue. I was, at that time \n                         twenty years old and having my \n                         obligatory affair with a minority \n                         group, in my case a Hopi Indian, a \n                         post-graduate fellow at Harvard doing \n                         his doctorate in the aboriginal \n                         languages of the Southwest. One day, \n                         I brought the Indian boy home just \n                         as my father was sinking to his knees \n                         in the entrance foyer in one of his \n                         trances. The Indian wheeled in his \n                         tracks and said, \"Well, I'll be a \n                         sonofabitch.\" You see, my father was \n                         speaking an Apache dialect, an obscure \n                         dialect at that, spoken only by a \n                         ragged band of unreconstructed Indians \n                         who had rejected the reservation and \n                         were living in total isolation in \n                         the Sierra Madre Mountains of northern \n                         Mexico. Well! What do you say to \n                         that, Dr. Bock?\n\n                                     BOCK\n                              (who has been staring \n                              at her as if she \n                              were insane)\n                         What the hell am I supposed to say \n                         to that, Miss Drummond?\n\n               Barbara throws back her head and roars with laughter.\n\n                                     BOCK\n                         I'm sitting here boozing and, all of \n                         a sudden, you start telling me some \n                         demented story about your father's \n                         religious conversion.\n\n                                     BARBARA\n                         No, no, you miss the point, Doctor. \n                         Not my father's conversion -- mine. \n                         You see, I had been hitting the acid \n                         pretty regularly at that time. I had \n                         achieved a few minor sensory \n                         deformities, some suicidal despairs, \n                         but nothing as wild as fluency in an \n                         obscure Apache dialect. I mean, like \n                         wow, man! I mean, here was living \n                         afflatus right before my eyes! Within \n                         a week, my father had closed his \n                         Beacon Hill practice and set out to \n                         start a mission in the Mexican \n                         mountains. And I turned in my S.D.S. \n                         card and my crash helmet and followed \n                         him. It was a disaster, at least for \n                         me. My father had received the \n                         revelation, not I. He stood gaunt on \n                         a mountain slope and preached the \n                         apocalypse to solemnly amused Indians. \n                         I masturbated a great deal. We lived \n                         in a grass wickiup and ate raw rabbit \n                         and crushed piñon nuts. It was \n                         hideous. Within two months, I was \n                         back in Boston, a hollow shell and \n                         dizzy with dengue, disenchanted with \n                         everything. I turned to austerity, \n                         combed my hair tight and entered \n                         nursing school. I became haggard, \n                         driven and had shamelessly incestuous \n                         dreams about my father. I took up \n                         with some of the senior staff at the \n                         hospital. One of them, a portly \n                         psychiatrist, explained I was \n                         generated by an unresolved lust for \n                         my father. I apparently cracked up. \n                         One day, they found me walking to \n                         work naked and screaming obscenities. \n                         There was talk of institutionalizing \n                         me, so I packed a bag and went back \n                         to my father in the Sierra Madre \n                         Mountains. I've been there ever since. \n                         That's three years. My father is, of \n                         course, mad as a hatter. I watch \n                         over him and have been curiously \n                         content. You see, Doctor, I believe \n                         in everything.\n\n               She pauses, her story over. Throughout, Bock has been trying \n               to keep his glowering eye on the desktop. During her long \n               narrative, he once seized the bottle and took a swig. Mostly \n               he is finding the experience murkily sensual. His glance \n               keeps darting out from under his brows to surreptitiously \n               look at the beautiful long tanned legs; or, when she bends \n               for the drink she set on the floor, to peer down the flapping \n               open scalloped neck of her dress; she is bra-less.\n\n               She, on the other hand, has been crossing and uncrossing her \n               legs, bending, stretching, so that her short dress has ridden \n               up almost to her waist and is saved from utter exhibitionism \n               only by the darkness of the shadows. She seems unaffected by \n               Bock's voyeuristic interest in her, but she is surely not \n               unaware of it. It is hard to believe she is not courting his \n               attention.\n\n                                     BOCK\n                         Now what was that all about, Miss \n                         Drummond?\n\n                                     BARBARA\n                         I thought I was obvious as hell. I'm \n                         trying to tell you I have a thing \n                         for middle-aged men.\n\n                                     BOCK\n                         I admire your candor.\n\n                                     BARBARA\n                         You've been admiring a lot more than \n                         that.\n\n               Bock looks up, and they suddenly find their eyes locked. The \n               dark, dense air in the room fairly steams with incipient \n               sexuality.\n\n                                     BOCK\n                              (looks down again)\n                         You're wasting your time. I've been \n                         impotent for years.\n\n                                     BARBARA\n                         Rubbish.\n\n               With a crash of his fist on the desktop, Bock stands; he is \n               in a drunken rage.\n\n                                     BOCK\n                              (lurches about)\n                         What the hell's wrong with being \n                         impotent? My God, you kids are more \n                         hung up on sex than the Victorians! \n                         I've got a son, twenty-three. I threw \n                         him out of the house last year. \n                         Pietistic little humbug. He preached \n                         universal love and despised everyone. \n                         He had a blanket contempt for the \n                         middle class, even its decencies. He \n                         detested my mother because she had \n                         petit bourgeois pride in her son the \n                         doctor. I cannot tell you how \n                         brutishly he ignored that rather \n                         good old lady. When she died, he \n                         didn't even come to the funeral. He \n                         thought the chapel service an \n                         hypocrisy. His generation didn't \n                         live with lies, he told me. \"Everybody \n                         lives with lies,\" I said. I grabbed \n                         him by his poncho, dragged him the \n                         full length of our seven-room \n                         despicably affluent middle-class \n                         apartment and flung him out. I haven't \n                         seen him since. But do you know what \n                         he said to me as he stood there on \n                         that landing on the verge of tears. \n                         He shrieked at me: \"You old fink! \n                         You can't even get it up anymore!\" \n                         That was it, you see. That was his \n                         real revolution. It wasn't racism \n                         and the oppressed poor and the war \n                         in Vietnam. The ultimate American \n                         societal sickness was a limp dingus. \n                         Hah!\n                              (he lurches about, \n                              laughing rustily)\n                         My God, if there is a despised and \n                         misunderstood minority in this \n                         country, it's us poor impotent \n                         bastards. Well, I'm impotent and \n                         proud of it! Impotence is beautiful, \n                         baby!\n                              (he raises a militant \n                              fist)\n                         Power to the Impotent! Right on, \n                         baby!\n\n                                     BARBARA\n                              (smiling)\n                         Right on.\n\n                                     BOCK\n                              (stares drunkenly at \n                              her)\n                         When I say impotent, I don't mean \n                         merely limp. Disagreeable as it may \n                         be for a woman, a man may sometimes \n                         lust for other things, something \n                         less transient than an erection, \n                         some sense of permanent worth. That's \n                         what medicine was for me, my reason \n                         for being. When I was thirty-four, \n                         Miss Drummond, I presented a paper \n                         before the annual convention of the \n                         Society of Clinical Investigation \n                         that pioneered the whole goddam field \n                         of immunology. A breakthrough! I'm \n                         in all the textbooks. I happen to be \n                         an eminent man, Miss Drummond. And \n                         you want to know something, Miss \n                         Drummond? I don't give a goddam. \n                         When I say I'm impotent, I mean I've \n                         lost even my desire for work, which \n                         is a hell of a lot more primal a \n                         passion than sex. I've lost my raison \n                         d'etre, my purpose, the only thing I \n                         ever truly loved. It's all rubbish \n                         anyway. Transplants, antibodies, we \n                         manufacture genes, we can produce \n                         birth ectogenetically, we can \n                         practically clone people like carrots, \n                         and half the kids in this ghetto \n                         haven't even been inoculated for \n                         polio! We have assembled the most \n                         enormous medical establishment ever \n                         conceived, and people are sicker \n                         than ever! We cure nothing! We heal \n                         nothing! The whole goddam wretched \n                         world is strangulating in front of \n                         our eyes! That's what I mean when I \n                         say impotent! You don't know what \n                         the hell I'm talking about, do you?\n\n                                     BARBARA\n                         Of course, I do.\n\n                                     BOCK\n                         I'm tired, I'm terribly tired, Miss \n                         Drummond. And I hurt, and I've got \n                         nothing going for me anymore. Can \n                         you understand that?\n\n                                     BARBARA\n                         Yes, of course.\n\n                                     BOCK\n                         Then can you understand that the \n                         only admissable matter left is death?\n\n               He suspects he is going to cry and turns quickly away. He \n               sits heavily and fights his tears.\n\n                                     BARBARA\n                         Sounds to me like a familiar case of \n                         morbid menopause.\n\n                                     BOCK\n                         Oh Christ.\n\n                                     BARBARA\n                         Well, it's hard for me to take your \n                         despair very seriously, Doctor. You \n                         obviously enjoy it so much.\n\n                                     BOCK\n                         Oh, bugger off. That's all I need \n                         now, clinical insights. Some \n                         cockamamie twenty-five-year-old...\n\n                                     BARBARA\n                         Twenty-seven.\n\n                                     BOCK\n                         ...acidhead's going to reassure me \n                         about menopause now. Look, I'd like \n                         to be alone, so why don't you beat \n                         it? Close the door and turn off the \n                         lights on your way out.\n\n               They are both suddenly conscious of a third presence in the \n               room. They look to the door where Mr. Blacktree, fully clothed \n               again and carrying his coat, is standing in the doorway. \n               Barbara uncrosses her long legs and stands.\n\n                                     BARBARA\n                              (crossing to the door)\n                         Mr. Blacktree disapproves of my \n                         miniskirt, but it was the only thing \n                         I had to come to the city with. Back \n                         at the tribe, I wear ankle-length \n                         buckskin.\n\n                                     BOCK\n                         Swell. Just close the door and turn \n                         off the lights.\n\n               Barbara regards his hunched form and, murmuring in Apache, \n               she exits, closing the door. In the subsequent hush, thunder \n               RUMBLES and CRASHES. Wind sweeps the rain against the window \n               panes.\n\n               The sounds go unheeded by Bock, still as marble. Slowly, he \n               raises his head and sighs and then fishes about in his jacket \n               pockets to bring out the bottle of potassium and syringe. He \n               takes off his jacket, rolling up his shirtsleeve, poking \n               about for the vein. He removes his trouser belt, which he \n               ties tightly about his upper arm for a tourniquet. Now, he \n               tears the wrapping of the syringe and fits the needle to it. \n               Fiddling about in the pockets of his jacket, he finally finds \n               a crumpled pack of cigarettes. He lights one and returns to \n               the business of killing himself, puffing expressionlessly as \n               he does. Thunder RUMBLES and rain SLASHES. He carefully draws \n               just the right amount of potassium from the bottle to the \n               syringe, peering at the procedure against the light of his \n               desk lamp. He sets the cigarette on the ashtray, switches \n               the hypodermic to his right hand, holds his left arm rigidly \n               out under the light of the lamp...\n\n                                     BARBARA'S VOICE\n                              (off-screen)\n                         What're you shooting, Doc?\n\n               He turns slowly to the doorway, his bare left arm still \n               rigidly extended, the belt dangling, the hypodermic clenched \n               in his other hand. Barbara is perfectly framed in the doorway. \n               He stares at her, slowly suffusing with the numb, blind, \n               total rage of the aborted suicide. The thunder CRASHES.\n\n                                     BOCK\n                              (barely gets the words \n                              out)\n                         Leave me alone...\n\n               She approaches the desk affably, turns the potassium around \n               to read the label.\n\n                                     BARBARA\n                         Potassium. You take enough of this \n                         stuff, it'll kill you, Doc.\n                              (moves toward the \n                              couch)\n                         It occurred to me that I might have \n                         read you wrong, that you really were \n                         suicidal. So I came back.\n\n               Bock's rage erupts. He crashes the hypodermic syringe down, \n               shattering it. The potassium puddles on the wood.\n\n                                     BOCK\n                              (hysterical rage)\n                         Who the hell asked you!\n\n               He moves around the desk, a shambling bear of a man, a leather \n               belt dangling dementedly from his arm, tears coursing down \n               his cheeks. He advances on her in a stuperous shuffle.\n\n                                     BOCK\n                         Who the hell asked you!\n\n               She regards his lumbering approach with a faint, grotesquely \n               sensual smile. He reaches with his naked left arm to the \n               neck of her dress and, with one savage wrench, rips her stark \n               naked, sobbing through hysterical tears.\n\n                                     BOCK\n                         Leave me alone! Why the hell don't \n                         you leave me alone!\n\n               He is on her, crushing her down into the shadows of the couch, \n               ravenous at her neck and shoulders in a brutish assault, \n               sobbing.\n\n                                     BOCK\n                         Why didn't you let me do it? Who the \n                         hell asked you!\n\n               Throughout the scene, CAMERA MOVES SLOWLY IN through the \n               flesh and fury to an INTENSE TWO-SHOT of this terrified act \n               of love. Then slowly over Bock's plunging shoulder to the \n               woman's face. She gasps at the moment of penetration, then \n               her lovely face slowly shapes into smiling serenity. Bock \n               sobs; even in the shadows we can see the path of the tears \n               on his cheek.\n\n               ABRUPT SILENCE.\n\n               OUTSIDE THE HOSPITAL, NIGHT. 4:00 A.M.\n\n               The quiet, black streets glisten wetly in the puddles of \n               lamplight.\n\n               THE STEINMETZ PAVILION, TENTH FLOOR\n\n               The night shift is finishing up. THERESA CAMPANELLA, R.N., a \n               high-strung girl in her early twenties, stands at a water \n               tap holding a glass and popping some pills in her mouth. To \n               the room:\n\n                                     CAMPANELLA\n                         Well, I'll see you.\n\n               TENTH FLOOR CORRIDOR. NIGHT\n\n               Campanella comes out of the Dialysis room, puts on her coat \n               and walks to...\n\n               HOLLY PAVILION LOBBY. NIGHT\n\n               Campanella moves down the empty corridor. All the doors are \n               closed now; only the overhead light in the background of the \n               corridor glows weakly. Campanella puts a cigarette in her \n               mouth, pauses to look for matches; she hasn't any. Scowling \n               with annoyance, she continues to the lobby and stops by a \n               partially visible white-jacketed figure reading a newspaper.\n\n                                     CAMPANELLA\n                         Do you have a match, Doctor?\n\n               She takes the matches, lights her cigarette, inhaling deeply, \n               when he suddenly sandbags her from behind. She goes down.\n\n               BOCK'S OFFICE. DAYBREAK, WEDNESDAY\n\n               Covered by Bock's overcoat, Barbara tosses and turns on the \n               couch in a small nightmare. Through the windows comes the \n               first gray wash of dawn. FULL SHOT of Barbara, awake and up \n               on one elbow on the verge of a scream. She looks around the \n               room. It is dark, empty, silent.\n\n               ACROSS Barbara looking through the door to the secretarial \n               office. It is likewise dark, but suddenly the lights go on \n               and, a moment later, Bock enters. He holds a container of \n               coffee in each hand and has something white draped over his \n               forearm. From under Bock's bulky coat, Barbara watches him \n               lumber to his desk, where he sets the containers of coffee \n               down. He drops the whitish garment over the back of a chair \n               and then sits. He hoists a bulging folder of correspondence \n               from his filing tray and hunches to work, reading. After a \n               moment, he regards the silent figure on the couch across the \n               room.\n\n                                     BOCK\n                         You wouldn't be awake.\n\n                                     BARBARA\n                         What time is it?\n\n               He rises, picks up the second container and white dress from \n               the chair. She reaches out an arm for the coffee. Bock holds \n               up -- a nurse's uniform.\n\n                                     BOCK\n                         I swiped this for you out of the \n                         nurses' locker room. I'll make good \n                         on your dress. I'm afraid it's torn \n                         beyond repair. Buy yourself a new \n                         one or, if you like, give me your \n                         size and I'll send it on to you. But \n                         I want to talk to you about that.\n\n                                     BARBARA\n                         Talk to me about what?\n\n                                     BOCK\n                         About your father. You really \n                         shouldn't move him in his condition. \n                         I just had a look at his chart. \n                         There's no reason to presume brain \n                         damage. You know as well as I you \n                         can't predict anything in these \n                         instances. He could pull out of that \n                         coma at any time. I think you should \n                         let him stay here. I'll personally \n                         look after him.\n\n               He has perched on the edge of the couch, and she rests her \n               cheek against the long, bent curve of his back, smiling.\n\n                                     BARBARA\n                         Is this your way of saying you'd \n                         like me to stay in town a few more \n                         days?\n\n               He turns to look at her, smiles back.\n\n                                     BOCK\n                         Well, that would be nice, too.\n\n               She sips her coffee.\n\n                                     BOCK\n                         What do you say, Miss Drummond?\n\n                                     BARBARA\n                         I expect you can call me Barbara, \n                         considering you ravished me three \n                         times last night.\n\n                                     BOCK\n                         Three times?\n\n                                     BARBARA\n                         Oh, look at him, pretending he didn't \n                         count. You were as puffed up as a \n                         toad about it. Punched a couple of \n                         holes in your crusade for universal \n                         impotence, didn't it? I think we're \n                         on a first name basis by now. I'll \n                         call you Herb.\n\n                                     BOCK\n                         Let's give your father a week, \n                         Barbara, what do you say?\n\n                                     BARBARA\n                              (a frown darkens her \n                              face)\n                         No, I don't want my father in this \n                         hospital. I had a dream about this \n                         hospital.\n                              (some of the terror \n                              shows on her face)\n                         I dreamt this enormous starched white \n                         tile building suddenly erupted like \n                         a volcano, and all the patients, \n                         doctors, nurses, attendants, \n                         orderlies, the whole line staff, the \n                         food service people, the aged, the \n                         lame -- and you right in the middle -- \n                         were stampeding in one hideous \n                         screaming suicidal mass into the \n                         sea.\n                              (she stares at him \n                              wide-eyed, reliving \n                              the dream)\n                         I'm taking my father out of here -- \n                         and as quickly as I can.\n\n               They stare at each other, she in terror, he with affection.\n\n                                     BOCK\n                         You're a real fruitcake, you know?\n\n               She sets her coffee down on the couch and decides to wear \n               Bock's overcoat rather than use it as a cover. She searches \n               for the sleeves. Bock assists her.\n\n                                     BARBARA\n                         Well, let me put it this way. I love \n                         you. I fancied you from the first \n                         moment you came lumbering down that \n                         hallway upstairs. I said to Mr. \n                         Blacktree, \"Who's that hulking bear \n                         of a man?\" The Apaches are reverential \n                         about bears. They won't eat bear \n                         meat; they never skin bears. Bear is \n                         thought of as both benign and evil, \n                         but very strong power. Men with bear \n                         power are highly respected and are \n                         frequently said to be great healers.\n\n               By now she's standing, the overcoat reaching her toes. She \n               looks down at Bock perched on the couch.\n\n                                     BARBARA\n                         I said to Mr. Blacktree, \"That man \n                         gets his power from the bear.\"\n\n                                     BOCK\n                         Swell. Now, look, do you have a hotel, \n                         some sort of accommodations where \n                         you can stay for a week or so?\n\n               Barbara reaches for her coffee, sips, moves around in her \n               tent of a coat.\n\n                                     BARBARA\n                         All right, let me put it this way, \n                         Herb. My father and I accept the \n                         implacability of death. If he dies, \n                         he dies, but I'm taking him out of \n                         here and back to Mexico about one \n                         o'clock this afternoon. I want you \n                         to come with us, because I love you \n                         and want children.\n\n                                     BOCK\n                         I'm afraid Mexico sounds a little \n                         too remote for me.\n\n                                     BARBARA\n                         We could use you down there, you \n                         know. There's a curiously high \n                         incidence of T.B. And you'd be a \n                         doctor again, Herb. You'd be necessary \n                         again. If you love me, I don't see \n                         what other choice you have.\n\n                                     BOCK\n                         What do you mean, if I love you? I \n                         raped you in a suicidal rage. How \n                         did we get to love and children all \n                         of a sudden?\n\n                                     BARBARA\n                         Oh, for heaven's sake, Herb, I ought \n                         to know if a man loves me or not. \n                         You must have told me half a hundred \n                         times last night you loved me. You \n                         murmured it, shouted it; one time, \n                         you opened the window and bellowed \n                         it out into the street.\n\n                                     BOCK\n                         I think those were more expressions \n                         of gratitude than love.\n\n                                     BARBARA\n                         Gratitude for what?\n\n                                     BOCK\n                         Well, my God, for resurrecting \n                         feelings of life in me I thought \n                         dead.\n\n                                     BARBARA\n                         Well, my God, what do you think love \n                         is?\n\n                                     BOCK\n                         Okay, I love you, and you love me. \n                         I'm not about to argue with so \n                         relentless a romantic. Well, then, \n                         since we have this great passion \n                         going for us, I don't see why you \n                         won't stay on here in New York for a \n                         week or ten days...\n\n                                     BARBARA\n                         It's up to ten days now.\n\n                                     BOCK\n                         As long as it takes for your father's \n                         condition to improve.\n\n                                     BARBARA\n                         No. I've had these prophetic dreams \n                         for seven nights. Seven is a sinister \n                         number. The meaning of these dreams \n                         is very clear, seven times as clear. \n                         I am to get my father and you out of \n                         this hospital before we are all \n                         destroyed.\n\n                                     BOCK\n                              (throws up his hands)\n                         You're certifiable! My God, half the \n                         time you're a perfectly intelligent \n                         young woman, and then suddenly you \n                         turn into a goddam cabalist who \n                         believes in dreams, witchcraft and \n                         bear power! And I don't like the way \n                         you dismiss my whole life as \n                         unnecessary. I do a lot of healing \n                         right here in Manhattan. I don't \n                         have to go to Mexico for it. I also \n                         teach. I send out eighty doctors a \n                         year into the world, sometimes \n                         inspirited, at least competent. I've \n                         built up one of the best damned \n                         departments of medicine in the world. \n                         We've got a hell of a heart unit \n                         here and a hell of a kidney group. A \n                         lot of people come into this hospital \n                         in big trouble, Miss Drummond, and \n                         go out better for the experience. So \n                         don't tell me how unnecessary I am.\n\n                                     BARBARA\n                              (who's been slipping \n                              into the nurse's \n                              uniform)\n                         Yeah?\n\n                                     BOCK\n                         Yeah.\n\n                                     BARBARA\n                         So how come, eight hours ago, you \n                         were trying to kill yourself with an \n                         overdose of potassium?\n\n                                     BOCK\n                         Where are you going now?\n\n               This last in reference to Barbara crossing to the secretaries' \n               office, zippering her uniform.\n\n               BOCK'S SECRETARIES' OFFICE\n\n                                     BARBARA\n                              (gathering her coat \n                              and purse)\n                         My hotel. I have to check out. Mr. \n                         Blacktree doesn't speak any English.\n\n                                     BOCK\n                              (from the connecting \n                              doorway)\n                         Well, you're coming back, of course.\n\n                                     BARBARA\n                         Of course. I have to settle the bill \n                         here and pack my father. And I think \n                         you need a few hours alone to make \n                         your decisions.\n\n                                     BOCK\n                         What decisions?\n\n                                     BARBARA\n                         You're a very tired and very damaged \n                         man. You've had a hideous marriage \n                         and I assume a few tacky affairs \n                         along the way. You're understandably \n                         reluctant to get involved again. \n                         And, on top of that, here I am with \n                         the preposterous idea you throw \n                         everything up and go off with me to \n                         some barren mountains of Mexico. It \n                         sounds utterly mad, I know. On the \n                         other hand, you obviously find this \n                         world as desolate as I do. You did \n                         try to kill yourself last night. So \n                         that's it, Herb. Either me and the \n                         mountains or the bottle of potassium. \n                         I'll be back in an hour or so. I'll \n                         be in my father's room.\n\n               She slips into her coat and exits, as Bock looks after her \n               thoughtfully, then turns back to his own office.\n\n               BOCK'S OFFICE\n\n               He shuffles around distractedly, not knowing how to articulate \n               the exuberance he feels. Suddenly, he opens the window, leans \n               out and bellows to the empty air.\n\n                                     BOCK\n                         All right. I love you!\n                              (softly)\n                         My God!\n\n               FIRST AVENUE, CONSTRUCTION AREA. DAWN\n\n               A construction sign fills the screen. It reads ON THIS \n               LOCATION, THE NEW YORK MEDICAL UNIVERSITY CENTER WILL BUILD \n               A DRUG REHABILITATION COMMUNITY CENTER, TO BE COMPLETED IN \n               1973. E.F. SCHLAGER & CO., CONTRACTORS. Suddenly, the sign \n               comes crashing down into CAMERA. It has been wrenched off \n               the wooden fence protecting the row of tenements and \n               brownstones being demolished. About a dozen young and loud \n               militants have torn it down.\n\n               CAMERA PANS to show the row of houses behind the fence, two \n               of which have already been reduced to rubble; the others \n               have been boarded up. The demolition generators and cranes \n               are parked silently along the curb. In the dark of 5:00 A.M., \n               three black families, carrying children, and children carrying \n               household effects, mattresses, pots, pans, bags of groceries, \n               etc., are repossessing the condemned buildings.\n\n               FIRST AVENUE, CONSTRUCTION AREA. DAY, 10:00 A.M.\n\n               Strong sun overhead. The street has been roped off, and police \n               are all over the place. A sparse crowd of a hundred or so \n               throng the sidestreets off First Avenue. Signs read, \"People \n               Sí, Doctors No.\" A Channel 11 mobile news crew, newspaper \n               photographers, and a radio newscaster are recording the \n               situation with desultory interest.\n\n               A POLICE CAPTAIN stands in the middle of the cordoned street, \n               bullhorning the occupiers of the condemned brownstones, who \n               can be seen through the broken windows.\n\n                                     POLICE CAPTAIN\n                         I repeat. I'm asking you to come out \n                         peacefully. These buildings are \n                         condemned and unfit for habitation.\n\n               A piece of brick arches down from the roof of a building and \n               cracks the street a few feet from the Captain.\n\n                                     POLICE CAPTAIN\n                              (sighs, tries again)\n                         You people are possessing this \n                         building illegally and in violation \n                         of the law. I'm asking you to come \n                         out peacefully...\n\n               HOLLY PAVILION, ENTRANCE LOBBY. DAY\n\n               A small press conference is going on in a corner of the lobby. \n               Reporters cluster, and TV cameras surround the Press \n               Representative of the Hospital, a young woman in her thirties \n               named EVELYN BASSEY, who is trying to read a statement, \n               squinting under her mod glasses at the blaze of lights set \n               up by the camera crews.\n\n                                     MRS. BASSEY\n                              (reading)\n                         ...complete sympathy with the tenants. \n                         So the hospital has assumed the \n                         responsibility of finding 400 housing \n                         units in good buildings. The hospital \n                         wishes to point out that this \n                         particular row of buildings on First \n                         Avenue was condemned by the City \n                         before the hospital acquired \n                         ownership, and even then, only after \n                         responsible leaders in the community \n                         had approved the building of our new \n                         drug rehabilitation center.\n\n               SUNDSTROM'S OFFICE\n\n                                     SUNDSTROM\n                              (explodes on the phone)\n                         Goddammit, Barry, I've got a dozen \n                         community leaders waiting for me in \n                         the library! We've been trying to \n                         work out some kind of negotiable \n                         formula for two years! And with no \n                         help from you people in the Urban \n                         Affairs Division, I might add!\n\n               DR. WELBECK appears in the doorway. He's in his fifties, \n               gray, distinguished and very tanned with terribly, terribly \n               kindly old country doctor eyes. He wears a camel hair topcoat. \n               He smiles benignly and twinkles at Sundstrom from one of the \n               leather chairs across the desk from the Director.\n\n                                     SUNDSTROM\n                              (hardly notices Welbeck)\n                         And I'm not going to throw all that \n                         down the drain because some cockamamie \n                         activist group is show-boating for \n                         the television cameras! You get those \n                         people out of those buildings before \n                         a wall collapses or a fire breaks \n                         out and we've got a riot on our \n                         hands!... Okay!\n\n               He hangs up, sighs, turns to the man across the desk.\n\n                                     WELBECK\n                              (smiles, twinkles)\n                         Having your troubles, eh? Well, I \n                         won't take much of your time. My \n                         name's Welbeck. I've been associated \n                         with this hospital for six years, \n                         and, yesterday afternoon, Dr. Gilley \n                         called me to say he was cutting off \n                         my privileges at the hospital. Do \n                         you know anything about it?\n\n                                     SUNDSTROM\n                              (glances at his watch)\n                         It's news to me.\n\n                                     WELBECK\n                         He said he sent the report on.\n\n                                     SUNDSTROM\n                         I'll probably get it tomorrow. Report \n                         on what?\n\n                                     WELBECK\n                         Well, I'm not sure myself. I did a \n                         nephrectomy on a man about seven \n                         days ago. Emergency, called in at \n                         four in the morning. The man was \n                         hemorrhaging, he'd gone sour...\n\n                                     SUNDSTROM\n                         Welbeck, I'm terribly sorry, but I \n                         do have this meeting.\n                              (crosses to the door)\n                         In any event, there's nothing I can \n                         do about it. If Gilley wants to cut \n                         your privileges, he's Chief of \n                         Surgery, it's within his province. \n                         You'll have to have the hearing...\n\n               He exits, followed by Welbeck into the...\n\n               DIRECTOR'S SUITE, SECRETARIES' OFFICES\n\n               Buzzing now. Typewriters clicking. Phones ringing.\n\n                                     WELBECK\n                         I have a laparotomy laid on for this \n                         morning. I assume I'll be allowed to \n                         go through with that.\n\n                                     SUNDSTROM\n                         Of course.\n\n                                     WELBECK\n                              (huffing a little)\n                         I've been associated with this \n                         hospital for six years...\n\n                                     SUNDSTROM\n                         Now, now, Welbeck. It seems to me \n                         I've had your name down here before \n                         for something...\n                              (to his secretary en \n                              passant)\n                         I'll be in the staff room.\n\n               He and Welbeck pass out into the...\n\n               EXECUTIVE CORRIDOR\n\n               Flowing with a normal stream of traffic, Sundstrom and Welbeck \n               turn right and head down to the last room of the corridor. \n               Something comes to him, and Sundstrom pauses.\n\n                                     SUNDSTROM\n                         Wait a minute. You're the fellow \n                         with the Medicaid collecting business \n                         who incorporated and went public, \n                         right? I mean, something like that? \n                         Milton Mead was telling me about you \n                         just the other day. You're a whole \n                         medical conglomerate. You've got a \n                         Factoring service, a computerized \n                         billing company, and a few proprietary \n                         hospitals, a few nursing homes. Good \n                         heavens, Welbeck, you shouldn't be \n                         brought up before a committee of \n                         mere doctors. You should be \n                         investigated by the Securities and \n                         Exchange Commission. You'll have to \n                         go through with the hearing, Welbeck. \n                         I don't interfere in these things.\n\n               He opens the door of the staff room and strides in. Even \n               before he enters, we get a blast of angry voices, both male \n               and female. For the moment the door is ajar, we see a harried \n               Milton Mead being assailed by angry blacks and Puerto Ricans \n               and young white activist doctors.\n\n               HOSPITAL LIBRARY\n\n                                     VOICES\n                              (all overlapping)\n                         ...no goddam halfway house, no way, \n                         baby! We ain't gonna wait 'til 1973 \n                         to deal with this problem! We want \n                         to kill the drug thing right now!... \n                         imperializing the Blackaporican \n                         community, and we reject the bourgie-\n                         ass middle-class black traitors and \n                         flunkies who are selling out the \n                         Blackaporican proletariat masses to \n                         the expansionist, racist policies of \n                         this shit hospital!...\n\n                                     WOMAN\n                         Let's get back to the abortion issue!\n\n                                     VOICE\n                         Sit down, Woman!\n\n                                     WOMAN\n                         What the hell does the male \n                         establishment know about abortions?\n\n               There's an agitated reaction in the crowd.\n\n                                     BLACK WOMAN\n                         Who the hell raised the issue of \n                         birth control? The issue at hand is \n                         the control of drug addiction in \n                         this community and in the ghetto \n                         generally.\n\n               A black man jumps up and points off right.\n\n                                     BLACK MAN\n                         We don't want no goddam abortion...\n\n               A white doctor jumps in from the left.\n\n                                     WHITE DOCTOR\n                         Let's... let's get down to the core \n                         of this matter.\n\n               More murmuring. A Che Guevara -- styled revolutionary moves \n               toward Mead and Sundstrom at the table.\n\n                                     MAN\n                         The point is that this hospital is \n                         the landlord for those buildings and \n                         they should've turned them down.\n\n               Angrily, he leans over the table facing Sundstrom.\n\n                                     MAN\n                         Those buildings are imperialistic \n                         extensions of the medical \n                         establishment. This hospital ought \n                         to be rebuilding those tenements, \n                         give those people decent housing.\n\n               Sundstrom raises his hands for quiet and starts to rise. The \n               hostile din has gotten to him.\n\n                                     SUNDSTROM\n                         Please, please, please!\n\n               HOLLY PAVILION, ROOM\n\n               William Mead is transferred from his bed to a rolling \n               stretcher by an orderly in shirt and trousers and by Nurse \n               Felicia Chile. Nurse Chile tucks Mead in. He opens his eyes \n               to look at her drowsily.\n\n                                     WILLIAM MEAD\n                              (under sedation)\n                         You know, I hallucinated last night. \n                         I hallucinated there was an Indian \n                         doing a war dance in here.\n\n                                     NURSE CHILE\n                              (affably)\n                         You weren't hallucinating, Mr. Mead. \n                         There was an Indian in here last \n                         night.\n\n                                     WILLIAM MEAD\n                              (staring through his \n                              sedation at her)\n                         There was?\n\n               They wheel him out into...\n\n               HOLLY PAVILION, SURGICAL AREA CORRIDOR\n\n               Mead is wheeled down the corridor by the orderly. At the far \n               end, an anesthetized patient, blue in the harsh light, fresh \n               from surgery, is being wheeled into a recovery room.\n\n               Surgery is busy and efficient but not as clinically tidy as \n               we'd like. Linens and equipment and surgical gear are piled \n               into corners or on empty stretchers. Green-uniformed nurses, \n               doctors and orderlies go in and out of the many doors flanking \n               the corridor. This is the non-sterilized area, where doctors \n               and nurses confer in the corridors; three black orderlies \n               await an assignment, sit on stretchers, chuckle, mutter. \n               Phones can be heard RINGING. The orderly wheeling Mead turns \n               left into the...\n\n               SURGICAL AREA, CENTRAL PLAZA\n\n               ...a small, cluttered central area with the office of the \n               Operating Room Nursing Supervisor on the right and the Holding \n               (for Anesthesia) Room on the left. The O.R. is like the \n               Emergency Ward, desperately busy but staffed by people grown \n               so accustomed to it that they display a calm, almost casual \n               but febrile efficiency. A large blackboard faces the \n               Supervisor's Office with the day's schedule of operations \n               neatly chalked in. It is full. A middle-aged surgeon, still \n               in his overcoat, is studying the schedule.\n\n               A green-uniformed NURSE swings through the glass doors from \n               the Operating Room area to lean into the Supervisor's Office.\n\n                                     NURSE\n                         Dr. Norris says about half an hour.\n\n                                     SECOND NURSE\n                         Tell Shirley it was just an ovarian \n                         cyst.\n\n               The THIRD NURSE leans back into the Supervisor's Office to \n               relay this information.\n\n                                     THIRD NURSE\n                         Shirley, it was just an ovarian cyst!\n\n               This is apparently good news, for we hear someone saying\n\n                                     VOICE\n                              (off-screen)\n                         Oh, thank God.\n\n               An orderly rumbles by with an E.K.G. machine. O.R. Nursing \n               Supervisor DOROTHY KIMBALL, a pleasant lady in her late \n               thirties, leans out of her office to speak to one of the \n               lounging orderlies.\n\n                                     MRS. KIMBALL\n                              (handing the orderly \n                              a slip)\n                         All right, Jerry, go up to Holly \n                         Six.\n\n               The orderly detaches himself from his cronies and exits. It \n               is into this atmosphere of subdued febrility that William \n               Mead is wheeled.\n\n                                     ORDERLY\n                              (to Mrs. Kimball)\n                         William Mead from Holly Eight.\n\n                                     MRS. KIMBALL\n                         Hold him there, Tom. We've got \n                         somebody coming out right now.\n\n               Indeed, a stretcher is being wheeled out of the Holding Room. \n               The patient is sedated and covered. As the orderly wheels \n               her past CAMERA, we may recognize the pale, sleeping profile \n               of Miss Campanella, the nurse who had been coshed with a \n               sandbag not many scenes ago. A CIRCULATING NURSE comes through \n               the glass doors, examines the chart dangling from the \n               stretcher.\n\n                                     MRS. KIMBALL\n                              (to this nurse)\n                         Who's that? Mangafranni?\n\n                                     CIRCULATING NURSE\n                              (checking wristband)\n                         Yeah.\n                              (to orderly)\n                         Number three, Marty.\n\n               The orderly wheels the silent Miss Campanella off to Operating \n               Room Three, as Dr. Welbeck, in his natty blue suit, carrying \n               his camel coat, turns in from the outer corridor and examines \n               the blackboard. He goes back to...\n\n               OUTER CORRIDOR\n\n               ...Welbeck crosses, opens a door and enters...\n\n               SURGEONS' LOCKER ROOM\n\n               All four walls are lined with lockers. Shelves and cartons \n               of green surgical clothes, caps, masks, trousers, shoe-\n               coverings. Obviously, surgeons dress for their operations \n               here. Two surgeons, one middle-aged and the other a young \n               RESIDENT, are changing. The resident turns to Welbeck on his \n               entrance and says:\n\n                                     RESIDENT\n                         It's legal for a doctor to incorporate \n                         in New York, isn't it, Doctor?\n\n                                     WELBECK\n                              (en route to phone)\n                         Since last September. If they had \n                         that when I was your age, I'd have \n                         put away a couple of million by now.\n                              (dials)\n                         It gives you a variety of deferral \n                         devices, profit-sharing for example. \n                         Let's say you pick yourself an October \n                         31-fiscal. You declare a bonus payable \n                         in '71. An accrued item payable to a \n                         principle share-holder must be paid \n                         within two and half months after the \n                         close of the year to get the deduction \n                         in the prior year. But your \n                         corporation doesn't pay that tax, \n                         because we've eliminated the taxable \n                         income with the bonus. With two \n                         taxable entities, you can bury a \n                         hell of a lot of expenses...\n                              (on phone)\n                         Hello, this is Welbeck, any \n                         messages?... Well, I'm at the \n                         hospital. I have to cut open some \n                         guy in a couple of minutes. I'll try \n                         to make it as fast as I can. How \n                         urgent did he say it was?... Well, \n                         Dr. Hogan made those arrangements \n                         with the underwriters. The \n                         Registration Statement was filed \n                         with the S.E.C. well over a year \n                         ago... If he calls again, have me \n                         paged here.\n                              (hangs up, turns back \n                              to the attentive \n                              young doctors to \n                              conduct his class in \n                              medical finance while \n                              changing into surgical \n                              scrub)\n                         The really big money is in health \n                         leasing, of course. Dr. Hogan, the \n                         eminent orthopedic surgeon, and I \n                         incorporated a leasing company and \n                         went public last year. I hold a \n                         controlling interest in a number of \n                         proprietary hospitals, nursing homes \n                         and rest farms, and I've been leasing \n                         hospital equipment to my own hospitals \n                         at excessive rates. Why, you ask, am \n                         I draining my own hospitals? Well, \n                         my hospitals are taxed at 48 percent, \n                         and I'm giving my leasing company a \n                         hell of a price-earnings ratio, \n                         which'll balloon the market value of \n                         the stock. I hold three hundred \n                         thousand shares of that stock, \n                         lettered of course, but in a year, \n                         I'll dump those shares at a capital \n                         gain and walk off with a bundle...\n\n               OPERATING ROOM THREE\n\n               Just like on TV -- well, almost. The surgeon, DR. MALLORY, a \n               bad-tempered man in his fifties, sits on a stool with his \n               gloved hands wrapped in a towel, waiting for the two surgical \n               RESIDENTS to finish painting the operable area, which happens \n               to be the abdomen. It's a hysterectomy. The patient is sheeted \n               except for the small square of abdominal area.\n\n                                     DR. MALLORY\n                         Mangafranni, right?\n\n                                     SCRUB NURSE\n                         Right.\n\n                                     DR. MALLORY\n                              (grumbles to one of \n                              the residents)\n                         What do you say, huh? We're not going \n                         to hang it in the Louvre, you know.\n\n               The anesthesiologist, DR. CHU, injects pentathol in the I.V. \n               tube.\n\n                                     DR. CHU\n                         Bring a mask over.\n\n               The RESIDENT ANESTHESIOLOGIST trundles over the oxygen tank, \n               takes the hypodermic syringe from Dr. Chu, who now applies \n               the oxygen mask to the enmarbled profile of the patient. He \n               studies the gauges and equipment around him at the head of \n               the operating table.\n\n                                     RESIDENT ANESTHESIOLOGIST\n                         There's no pulse, Doctor.\n\n                                     DR. CHU\n                         What's the pressure?\n\n                                     RESIDENT ANESTHESIOLOGIST\n                         There's no blood pressure, Doctor.\n\n                                     DR. CHU\n                         No pulse. Get the tube and E.K.G.\n\n                                     DR. MALLORY\n                         What's the matter?\n\n                                     RESIDENT\n                         I can't feel a thing, sir.\n\n               The room galvanizes into the swift, silent activity of a \n               chest massage. Dr. Mallory, standing and stretching in the \n               back of the room, turns and moves toward the off-screen \n               patient. He begins a vigorous rhythmic massage of the \n               patient's rib cage over the heart.\n\n                                     DR. MALLORY\n                         What the hell happened?\n\n               Dr. Mallory thumps the patient's chest hard with his fist, \n               and the others, likewise, go to work.\n\n                                     DR. CHU\n                         I don't know. She must have thrown \n                         an embolus. She was doing fine up to \n                         now.\n                              (to Resident \n                              Anesthesiologist)\n                         Did you check the gasses?\n\n                                     RESIDENT ANESTHESIOLOGIST\n                         I did, sir.\n\n                                     DR. CHU\n                         The only time I ever saw anybody \n                         conk out like this, some jerk switched \n                         the nitrous oxide and the gas lines.\n\n               The scrub nurse is applying electrode paste to the \n               defibrillators. Dr. Mallory yanks the sheets and hospital \n               shirt off the patient and begins very rigorous massage of \n               the exposed ribs; we can hear one rib crack.\n\n                                     DR. MALLORY\n                         Get the damn leads on. For Chrissakes, \n                         what the hell is this?!\n\n                                     RESIDENT\n                         She's just a young woman, sir. Do \n                         you think we should open the chest?\n\n                                     DR. MALLORY\n                              (defibrillating)\n                         She's fifty-three, you buttonhead!\n\n                                     RESIDENT\n                              (off-screen)\n                         Bicarb?\n\n               Dr. Chu, who has been inserting some suprel and bicarbonate \n               into the tube of the patient's I.V., is frowning at her rigid, \n               white-capped face. He leans over to check the E.K.G. readings.\n\n                                     DR. CHU\n                         She's fibrillating, Doctor.\n\n               Mallory straddles the patient. He's doing heavy heart massage.\n\n                                     DR. MALLORY\n                         Jesus H. Christ!\n\n                                     DR. CHU\n                         Okay, stop for a minute... Doctor...\n\n               Dr. Chu pushes back, the operating cap on the patient's head, \n               revealing jet-black hair. Mallory starts to massage again.\n\n                                     DR. MALLORY\n                              (barking at the scrub \n                              nurse)\n                         You got those paddles ready?\n\n               Dr. Chu stares blankly at the patient's face, then looks up \n               at the sweating surgeon, perched on the operating table, \n               rhythmically crushing away at the patient's rib cage.\n\n                                     DR. CHU\n                         I may be crazy, Doctor, but I don't \n                         think this is your patient.\n\n               Dr. Mallory, now pausing for a moment, looks up. He is beaded \n               with sweat.\n\n                                     DR. MALLORY\n                         What the hell are you talking about?\n\n               He massages away. Another rib cracks.\n\n               HOLLY PAVILION, BOCK'S OFFICE\n\n               The Supervisor of Nurses, Mrs. Christie, is sitting on a \n               chair reading a report. Bock, now in his doctor's coat, is \n               hunched over his desk, hands clasped.\n\n                                     BOCK\n                         Now, I don't want to get into an \n                         institutional hassle with you, Mrs. \n                         Christie. The malpractice here is \n                         monumental. As you see, Dr. Schaefer's \n                         blood sugar was twenty-three. No \n                         glucose solution is going to do that. \n                         The only thing that will do that is \n                         at least fifty units of insulin, \n                         probably more. The only presumption \n                         is that one of those nurses on the \n                         Eighth Floor shot fifty units of \n                         insulin into Schaefer's blood stream, \n                         either by injection or through the \n                         I.V., although how in God's name...\n\n               Mrs. Christie's electric pocket-pager BEEPS.\n\n                                     MRS. CHRISTIE\n                         I'm very sorry, Doctor.\n                              (reaches for a phone)\n                         May I?\n\n               Miss McGuire leans in from the secretaries' office.\n\n                                     MISS MCGUIRE\n                              (to Bock)\n                         Doctor, did you ask the head nurse \n                         on the eighth floor to let you know \n                         when a Miss Drummond got there?\n\n                                     BOCK\n                         Yes.\n\n                                     MISS MCGUIRE\n                         Well, she just got there.\n\n                                     BOCK\n                         Thank you.\n\n                                     MRS. CHRISTIE\n                              (on phone)\n                         Oh, dear me, Dorothy. I better get \n                         right down there directly. Have you \n                         called the O.O.D.? And you better \n                         call Dr. Gilley. And you better call \n                         Mr. Sloan... Yes, I'll be down \n                         directly.\n                              (hangs up; to Bock)\n                         I'm very sorry, Doctor, but there's \n                         a real nasty one in the O.R. They've \n                         just operated on the wrong patient...\n\n               O.R. NURSING SUPERVISOR'S OFFICE\n\n               Crowded now. The administrative resident, Hitchcock, is here \n               and a uniformed man in his fifties, MR. SLOAN, the Chief of \n               Safety and Traffic. Sloan represents the Hospital's security \n               force. Mrs. Kimball is at her desk, on the phone.\n\n                                     MRS. KIMBALL\n                              (on phone)\n                         ...well, I don't understand, is she \n                         back in her room? When did she get \n                         back to her room? Who brought her \n                         back?...\n                              (she stares at \n                              Hitchcock)\n                         She's back in her room.\n\n                                     HITCHCOCK\n                         Who?\n\n                                     MRS. KIMBALL\n                         Mrs. Mangafranni, the woman who was \n                         supposed to have been operated on...\n                              (calls to a nurse \n                              passing)\n                         Are they still working on that woman \n                         in Three?\n\n                                     NURSE\n                         Yeah.\n\n                                     MRS. KIMBALL\n                              (back on phone)\n                         I'm sorry, Mrs. Fried, would you say \n                         that again?... Well, nobody in this \n                         office sent her back up... Well, all \n                         right, Mrs. Fried, I'll have to call \n                         you back.\n\n               She hangs up, stands, goes out into...\n\n               THE OPERATING AREA, PLAZA\n\n               ...where three orderlies lounge about.\n\n                                     MRS. KIMBALL\n                         Did any of you take a woman named \n                         Mangafranni out of the Holding Room \n                         back up to Holly Five around ten \n                         o'clock?\n\n               Apparently, none of these three. Mrs. Christie turns in from \n               the outer corridor. Normal Operating Room activity flows by: \n               patients wheeled to and from their various surgeries, surgeons \n               checking the blackboard, staff doctors, orderlies keeping \n               the noise level low but steady.\n\n                                     MRS. CHRISTIE\n                              (to Hitchcock in the \n                              doorway)\n                         What happened?\n\n               Hitchcock shrugs helplessly.\n\n                                     MRS. KIMBALL\n                              (to Mrs. Christie)\n                         I don't know what happened. A patient \n                         named Mangafranni was scheduled for \n                         a hysterectomy at ten o'clock -- Dr. \n                         Mallory. I talked to Sylvia in the \n                         Holding Room who admitted her, so \n                         she was here. And now I just spoke \n                         to Mrs. Fried on Holly Five, and she \n                         says an orderly brought Mrs. \n                         Mangafranni back to her room about \n                         twenty minutes ago. Now Mrs. \n                         Mangafranni is in her room sleeping.\n\n                                     MRS. CHRISTIE\n                         Well, who's the woman in the operating \n                         room?\n\n                                     MRS. KIMBALL\n                         I don't know.\n\n               Mrs. Kimball, Mrs. Christie, Hitchcock and Sloan push through \n               the glass doors to the crossroads of the operating rooms. \n               Through each window, we see operating crews hacking away.\n\n                                     MRS. CHRISTIE\n                         Is she dead?\n\n                                     MRS. KIMBALL\n                         Well, they had to open her up, and \n                         that's not good.\n\n               They gather in anticipation outside O.R. Three and peer over \n               each other's shoulders into the room where the operating \n               crew is hunched over the open-heart massage. The masked \n               circulating nurse looks up, notices the audience at the door, \n               and gives a hopeless shrug.\n\n                                     HITCHCOCK\n                         I better get Mr. Mead.\n\n               HOLLY PAVILION, THE STAFF ROOM\n\n               Milton Mead is sitting in a back seat of the Staff Room -- a \n               lounge with couches, easy chairs and magazine racks -- gives \n               half an ear to the several opinions being simultaneously \n               expressed by:\n\n                                     LADY FROM WOMEN'S LIB\n                         ...abortion? The clinic should be \n                         under the supervision and entirely \n                         staffed by women and administered by \n                         a member of the Women's Committee \n                         for Medical Liberation!\n\n               and by\n\n                                     YOUNG WHITE ACTIVIST\n                         ...let's get to the core of the matter \n                         which is the criminal and gangster \n                         collusion between the American medical \n                         establishment and the drug, insurance \n                         and tobacco companies who, through \n                         their combined racketeering efforts, \n                         have produced a dual system of health \n                         care. Everything for the rich and \n                         nothing for the poor!\n\n               and by\n\n                                     BLACK PANTHER\n                         ...abortion clinic! That's genocide, \n                         baby! You're just killing off blacks! \n                         We consider proliferation elemental \n                         to the class struggle!\n\n               and by\n\n                                     SUNDSTROM\n                              (who has lost his \n                              cool altogether and \n                              is screaming right \n                              along with everyone \n                              else)\n                         ...for God's sake! We've got eleven \n                         people in these buildings, and we've \n                         got to get them out of there! We can \n                         rectify the injustices of the world \n                         tomorrow, but right now, for God's \n                         sake, can we get those people out of \n                         those buildings? Will you people \n                         please listen to me? Will you people \n                         please shut up and listen to me? \n                         Will you people please call a halt \n                         to this participatory democracy and \n                         address ourselves to the immediate \n                         problem?!\n\n               During this maelstrom, the phone at Mead's elbow RINGS. Mead \n               answers it, listens, nods, returns the receiver, stand and \n               slips out of the room into the delicious silence of the...\n\n               HOLLY PAVILION, EXECUTIVE CORRIDOR\n\n               ...where Hitchcock emerges from the Administration offices. \n               The two men move down the hall toward each other.\n\n                                     MILTON MEAD\n                         How long ago did this happen?\n\n                                     HITCHCOCK\n                         About half an hour.\n\n                                     MILTON MEAD\n                         Have you called the Medical Examiner?\n\n                                     HITCHCOCK\n                         Not yet.\n\n                                     MILTON MEAD\n                         Well, you'd better do that now. And \n                         you better call the precinct station \n                         house as well.\n\n               OPERATING ROOM THREE\n\n               Dr. Mallory is wrenching off his blood-drenched rubber gloves \n               and flinging them to the floor in a rage. The door to the \n               room opens, and Mrs. Kimball, Mrs. Christie and Mr. Sloan \n               enter. Dr. Mallory is stupefied with anger. Dr. Chu, blessed \n               with Eastern containment, blandly gathers his equipment \n               together, nods to Mrs. Christie.\n\n                                     DR. CHU\n                         Good morning.\n\n                                     MRS. CHRISTIE\n                         Good morning, Doctor.\n\n                                     DR. CHU\n                         This is really something, isn't it? \n                         I thought she looked a little \n                         different when they brought her in. \n                         I even said to one of the nurses, \n                         \"She looks a little younger without \n                         her dentures.\" I'd only talked to \n                         her half an hour before.\n\n                                     MRS. CHRISTIE\n                         Does anybody know who she is?\n\n               Dr. Mallory can only stare at her numbly. He turns and stares \n               numbly at Mr. Sloan.\n\n                                     MRS. CHRISTIE\n                              (to Mrs. Kimball, \n                              examining the chart \n                              dangling from the \n                              operating table)\n                         What's her chart say?\n\n                                     CIRCULATING RESIDENT\n                         Her chart says Mangafranni. Her \n                         bracelet says Mangafranni. The only \n                         thing that isn't Mangafranni is the \n                         woman.\n\n               Dr. Mallory finally explodes.\n\n                                     DR. MALLORY\n                         Jesus H. Christ! I've been chopping \n                         out three uteruses a day for twenty \n                         years, and is it too much to expect \n                         for you people to bring in the right \n                         goddam Jesus Christ uterus?!\n\n                                     DR. CHU\n                         I had just been talking to her in \n                         the Holding Room. She was perfectly \n                         fine. A little drowsy. I thought it \n                         was funny that when they brought her \n                         in, she was out cold.\n\n                                     DR. MALLORY\n                              (shuffling around in \n                              aimless circles)\n                         Jesus H. Kee-rist!\n\n               Mrs. Christie stares down at the face of the dead patient on \n               the table, who has had her chest spread wide open so that \n               the organs are exposed.\n\n                                     MRS. CHRISTIE\n                         Well, we'll just all have to stay \n                         here until Mr. Mead or someone from \n                         the O.O.D. comes back.\n\n                                     DR. MALLORY\n                         Well, I'm not taking the rap for \n                         this! I've already got one malpractice \n                         suit pending, and I'm not taking the \n                         rap for this one!\n\n               HOLLY PAVILION, ROOM\n\n               William Mead's bed is empty. The Reverend Drummond's suit, \n               still on its hanger, is lying on it. Drummond himself lies \n               comatose and rigged out with I.V.s and catheters. Barbara \n               Drummond is packing her father's things into an open one-\n               suiter valise. The door opens. She looks up. It's Bock. They \n               look at each other -- two people in love.\n\n                                     BOCK\n                         Look, you're not going. I love you, \n                         and I'm not going to let you go.\n\n               He picks up the suit lying on the bed.\n\n                                     BOCK\n                         Come on, let's start putting your \n                         father's things back. He's staying \n                         here.\n                              (hangs the suit in \n                              the closet)\n                         I'll find an apartment somewhere. \n                         I'm staying in a filthy little hotel \n                         room. We can't use that.\n\n               His eyes are caught by a white doctor's uniform hanging in \n               the armoire along with the suits and overcoats of the two \n               patients in the room. He bends over to peer at the nameplate \n               over the breast pocket.\n\n                                     BARBARA\n                         I can't make it here, Herb. I'll \n                         crack up. I cracked up once already. \n                         One week here, and I'd be running \n                         naked through the streets screaming \n                         again. I can retain my sanity only \n                         in a simple society.\n\n                                     BOCK\n                         For God's sake, Barbara, you can't \n                         seriously see me living in a grass \n                         shack hunting jackrabbits for dinner? \n                         Be sensible for God's sake.\n\n                                     BARBARA\n                         I am being sensible. What is it you're \n                         so afraid of leaving here? Your \n                         plastic home? Your conditioned air? \n                         Your synthetic clothes? Your instant \n                         food? I'm offering you green silence \n                         and solitude, the natural order of \n                         things. Mostly, I'm offering me. I \n                         think we're beautiful, Herb.\n\n                                     BOCK\n                              (utterly in love)\n                         You make it sound almost plausible.\n\n                                     BARBARA\n                         I don't know why you even hesitate. \n                         What's holding you here? Is it your \n                         wife?\n\n                                     BOCK\n                         No, that's all over. I suppose if \n                         I'm married to anything, it's this \n                         hospital. It's been my whole life. I \n                         just can't walk out on it as if it \n                         never mattered. I'm middle-class. \n                         Among us middle-class, love doesn't \n                         triumph over all. Responsibility \n                         does.\n\n                                     BARBARA\n                         Herb, don't ask me to stay here with \n                         you, because I love you, and I will. \n                         And we'll both be destroyed.\n\n               He turns to her again. They both look away.\n\n                                     BARBARA\n                         I've got the bill here to pay yet.\n\n                                     BOCK\n                         I'll come with you.\n\n               She gathers her raincoat and goes. Bock follows her out into \n               the...\n\n               HOLLY PAVILION, EIGHTH FLOOR, CORRIDOR\n\n               ...where Dr. Joseph Lagerman, Head of Nephrology, perhaps \n               remembered from an earlier scene, has been waiting for Bock. \n               He joins them en route to the elevators.\n\n                                     LAGERMAN\n                         Herb, you asked me to find that \n                         dialysis nurse.\n\n                                     BOCK\n                         What dialysis nurse?\n\n               Barbara has continued walking. Bock starts to follow her.\n\n                                     BARBARA\n                         I'll go pay the bill.\n\n                                     LAGERMAN\n                         The one who goofed on your patient, \n                         Drummond.\n\n               Bock turns back to Lagerman.\n\n                                     LAGERMAN\n                         Well, her name is Theresa Campanella, \n                         but you are not going to believe \n                         this, Herb. She died on the operating \n                         table in O. R. Three about an hour \n                         ago.\n\n               Barbara is disappearing into an elevator. Bock starts after \n               her, then turns back to Lagerman.\n\n                                     BOCK\n                         What do you mean, she died on the \n                         operating table in O.R. Three?\n\n               They hurry down the corridor to the elevators.\n\n                                     BOCK\n                         You mean she was the one?\n\n                                     LAGERMAN\n                         That's the one. I just identified \n                         her.\n\n                                     BOCK\n                         What the hell's going on around here? \n                         Every time I try to find somebody in \n                         this hospital, they either died of a \n                         heart attack in Emergency or of \n                         anesthesia shock in an operating \n                         room.\n\n               Elevator doors open. A nurse and visitor get out. Bock and \n               Lagerman go into...\n\n               THE ELEVATOR\n\n               Two or three people besides the elevator operator are there, \n               as well as a patient on a stretcher and an orderly.\n\n                                     LAGERMAN\n                         Listen, I just came from the O.R. \n                         They're trying to find a Dr. Schaefer. \n                         Don't you have a kid named Schaefer \n                         in your service?\n\n                                     BOCK\n                              (scowls, mutters)\n                         I had a Schaefer. He died yesterday \n                         of an overdose of insulin. What do \n                         they want Schaefer for?\n\n                                     LAGERMAN\n                         The Holding Room nurse says there \n                         was a Dr. Schaefer hanging around \n                         the Holding Room. It wouldn't have \n                         been your Schaefer anyway. The nurse \n                         says it was senior staff, a middle-\n                         aged man.\n\n                                     BOCK\n                         There's no senior staff named Schaefer \n                         in this hospital.\n\n                                     LAGERMAN\n                         I told them that. I said, I don't \n                         know any senior staff around here \n                         named Schaefer. They've got detectives \n                         down there, everything. It's a whole \n                         big investigation.\n\n               The elevator stops at the seventh floor. The doors open and \n               Bock and Lagerman stroll into...\n\n               HOLLY PAVILION, SEVENTH FLOOR, CORRIDOR\n\n               Bock lumbers down the west corridor, turns into...\n\n               ROOM 806\n\n               William Mead, sedated and apparently zonked out cold, is \n               being transferred from a stretcher back into bed by an O.R. \n               orderly and nurse's aid. Bock rolls back the curtains around \n               Drummond's bed revealing the comatose patient, his face \n               sculptured against the white pillow, an I.V. tube in his \n               right arm, a catheter projecting from under the sheet. Bock \n               lowers the protective railing, leans in, takes the man's \n               pulse on his neck, raises one closed eyelid, then the other. \n               The pupils stare vacuously back at him; the eyelids drop \n               closed as soon as they are released.\n\n               In the background, the orderly and aid finish tucking in \n               William Mead and exit, wheeling their creaking stretcher \n               out. The room is shockingly silent. Bock goes to the window \n               and frowns in thought.\n\n               HOLD ACROSS the patient Drummond, on Bock in the background \n               at the window with his back to us. Suddenly, Drummond's eyes \n               open. He lies rigid, his eyes staring dementedly into the \n               air above him.\n\n               Slowly, his left hand reaches out and carefully withdraws \n               the catheter from his bladder, lays it on the white sheet \n               beside him, and silently reaches over to withdraw the I.V. \n               needle from his right arm. He lets the needle dangle, dripping \n               onto the bed. Carefully, he twists out from under his sheet, \n               swings his legs over the side of the bed and sits up.\n\n               REVERSE ACROSS Bock at the window, pondering. With a swift \n               lash of movement, the double tubes of a stethoscope are \n               whipped over his head and tightened around his throat.\n\n                                     DRUMMOND\n                              (mad as a hatter)\n                         I am the Fool for Christ and the \n                         Paraclete of Caborca.\n\n               CLOSE TWO SHOT of Bock being strangled, Drummond's face frozen \n               in bland dementia behind him.\n\n                                     BARBARA'S VOICE\n                              (off-screen)\n                         For heaven's sake, Dad! What the \n                         hell's going on?\n\n               Drummond pauses in his strangling and, releasing the poor \n               man altogether, turns to his daughter in the doorway.\n\n               CAMERA DOLLIES to include all three -- Bock recuperating; \n               Drummond staring madly; and Barbara infuriated with her \n               father.\n\n                                     BARBARA\n                              (annoyed)\n                         We all thought you were at Death's \n                         Door! What're you doing out of bed?\n\n               Drummond, abashed, stands there, a scolded schoolboy, a \n               rawboned figure in a hospital shift, a stethoscope dangling \n               from his right hand.\n\n                                     BARBARA\n                              (to Bock)\n                         What happened? Did he say anything \n                         to you?\n\n                                     BOCK\n                              (sufficiently recovered)\n                         As a matter of fact, he said, \"I am \n                         the Fool for Christ and the Paraclete \n                         of Caborca.\" And you'd better close \n                         the door, because if he's going to \n                         tell everyone who walks in here he's \n                         the Fool for Christ and the Paraclete \n                         of Caborca, they'll put us all away. \n                         He's already killed two doctors and \n                         one nurse.\n\n                                     DRUMMOND\n                         I am the wrath of the lamb and the \n                         angel of the bottomless pit.\n\n                                     BARBARA\n                         What do you mean he killed two doctors \n                         and a nurse?\n\n                                     BOCK\n                         I mean, he's killed two doctors and \n                         a nurse! And he just tried to kill \n                         me! He has something against doctors. \n                         Somehow he got hold of a thousand \n                         units of insulin and put it in Dr. \n                         Schaefer's intravenous solution. And \n                         somehow he got Dr. Ives to die of a \n                         heart attack in the middle of the \n                         Emergency Room. And somehow he got a \n                         dialysis nurse named Campanella to \n                         die of anesthesia shock on an \n                         operating table!\n                              (opens the closet, \n                              points to the white \n                              doctor's uniform \n                              hanging there)\n                         He's been running around the hospital \n                         wearing Dr. Schaefer's uniform. Right \n                         now, they're looking all over the \n                         place for this mysterious Dr. \n                         Schaefer. I know this all sounds as \n                         grotesque to you as it does to me, \n                         but you can see for yourself your \n                         father is not the helpless comatose \n                         patient we thought he was. Don't \n                         look at me like I'm the one who's \n                         crazy. Ask your crazy father!\n\n                                     DRUMMOND\n                         I was merely an instrument of God. I \n                         killed no one. They all three died \n                         by their own hands, ritual victims \n                         of their own institutions, murdered \n                         by irony, an eye for an eye, biblical \n                         retribution. Schaefer was first, you \n                         see, because he killed God. God was \n                         admitted to this hospital last Monday \n                         under the name of Guernsey...\n\n               ROOM 806. MORNING. (FLASHBACK)\n\n               A cheerless, gray sunlight fills the room as the fragile, \n               white-haired and bearded old Guernsey (whose admittance to \n               the hospital was the opening scene of the film) is being \n               helped into the room by Nurse Felicia Chile. She solicitously \n               helps the wispy old man off with his coat and jacket and hat \n               which she puts in the armoire. With palsied fingers, the \n               little old man unknots his stringy tie and unbuttons the \n               collar, which is three sizes too large. In the other bed, \n               Drummond's eyes slowly open.\n\n                                     DRUMMOND\n                              (off-screen)\n                         I was instantly aware of a divine \n                         presence.\n\n               The old man is slipping out of his clothes to expose a thin \n               little body in a torn nightshirt.\n\n                                     DRUMMOND\n                              (off-screen)\n                         I was convinced this porcelain old \n                         man was, in fact, an Angel of the \n                         Lord...\n\n               The old man sits back, wheezing a little. Nurse Chile smiles \n               nicely at him and takes her leave. For a moment, Drummond \n               lies rigidly on his bed, staring dully into the air and the \n               old man sits with his hunched back to us. The room is silent \n               except for his rheumy wheeze.\n\n                                     DRUMMOND\n                              (off-screen)\n                         ...perhaps even Christ Himself.\n\n               After a moment, the old man rises and goes to the washbasin \n               and, with some wheezing, spits into it. He shuffles back to \n               bed. Dr. Schaefer comes into the room with a professional \n               smile and the patient Guernsey's chart.\n\n                                     DRUMMOND\n                              (off-screen)\n                         Our Savior was, it seems, suffering \n                         from emphysema.\n\n               Schaefer perches on the bed beside Guernsey and begins to \n               take his history.\n\n                                     DRUMMOND\n                              (off-screen)\n                         He was relentlessly subjected to the \n                         benefits of modern medicine. He was \n                         misdiagnosed, mismedicated, and put \n                         into shock by Dr. Schaefer; raced \n                         off to Intensive Care, where the \n                         resident compounded the blunder and \n                         induced a coma. I can tell you with \n                         authority that God is indeed dead. \n                         He died last Monday under the name \n                         of Guernsey.\n\n               CLOSE-UP of Drummond in deep shadow shows him sleeping.\n\n                                     DRUMMOND\n                              (off-screen)\n                         A few hours later, he appeared to me \n                         in a revelation.\n\n               ROOM 806. NIGHT, 7:00 P.M.\n\n               The room is lit only by the yellow light from the half-opened \n               bathroom door. Guernsey walks out of the shadows, hands \n               raised. He shuffles to Drummond's bedside and looks down on \n               him from his frail height.\n\n                                     GUERNSEY\n                              (softly)\n                         Rise up, Drummond. You are dead, now \n                         you are restored.\n\n               Drummond's eyes open and roll to the direction of the voice.\n\n               DRUMMOND'S P.O.V.: Guernsey, dressed only in his hospital \n               shift, is shuffling up and down the aisle of the room, hands \n               clasped behind his back like a Mittel-European intellectual, \n               head hunched forward -- a little old man with a white beard \n               talking to himself.\n\n                                     GUERNSEY\n                         Those who killed you and those who \n                         killed me will die in our place. You \n                         are the Paraclete of Caborca, the \n                         wrath of the lamb. The angel of the \n                         bottomless pit.\n\n               Guernsey closes his eyes in religious ecstacy.\n\n                                     GUERNSEY\n                         In this fashion has it been revealed \n                         to you.\n\n               Drummond starts to sob and slowly sits up in his bed, imbued \n               with belief. He looks mutely up at the frail old man, who \n               now raises his right hand and his face is transfigured into \n               vast majesty.\n\n                                     GUERNSEY\n                              (thunders out)\n                         The age is closed! The end is at \n                         hand! The seal is broken!\n\n               So saying, he reverts to the little old man he was, wheezing \n               a bit, and with some effort, climbs back on his bed and lies \n               there, eyes closed. His thin, high nose projects from the \n               whiteness of his face. He sighs the rattling last sigh of \n               life and dies. CAMERA DOLLIES slowly to CLOSE-UP of Drummond \n               lying motionless on his bed. His eyes are wide, glinting in \n               the shadows, a man imbued. His cheeks are wet with tears of \n               exaltation.\n\n                                     DRUMMOND\n                              (off-screen)\n                         Well! Not quite the burning bush \n                         perhaps but prodigal enough for me. \n                         I was to avenge the death of God and \n                         my own brutalization. I was to kill \n                         Doctors Schaefer, Ives and Welbeck \n                         and the dialysis nurse Miss \n                         Campanella, whose negligence caused \n                         my coma.\n\n               FULL SHOT of Drummond. He raises his left hand, flexing his \n               fingers. Then he moves his other arm, his head, his shoulders. \n               Obviously, he is regaining his faculties.\n\n                                     DRUMMOND\n                              (off-screen)\n                         I awaited a further sign from God, \n                         which was given to me later that \n                         evening. Dr. Schaefer, it seems, had \n                         arranged an assignation with a girl \n                         from the hematology lab named Sheila.\n\n               ACROSS Drummond to the now empty other bed. All the lights \n               are on. PAN on Nurse Penny Canduso and an orderly wheeling \n               away the wrapped body of Guernsey. Intern Schaefer, at the \n               door, considers the empty bed with interest. Moving to the \n               bedtable, he picks up the receiver of the phone.\n\n                                     SCHAEFER\n                              (on phone)\n                         Hey Sheila, this is Howard, Sheila. \n                         Hey listen, I got us a bed for \n                         tonight. A real, honest-to-god bed.\n\n               ROOM 806. NIGHT\n\n               REPRISE the scene originally played UNDER CREDITS where Dr. \n               Schaefer and his girlfriend Sheila sneak into the room and \n               undress. Giggles and shushings, gooses and fondles.\n\n                                     SHEILA\n                         Boy, I sure hope nobody walks in.\n\n               During the replay, however, an additional segment is added. \n               At one point, the girl, hanging her dress in the armoire, \n               turns and holds something up.\n\n                                     SHEILA\n                         What's this in your pocket?\n\n                                     SCHAEFER\n                         That's my insulin. Put it back.\n\n                                     SHEILA\n                         What do you take insulin for? \n                         Diabetes? I didn't know you were a \n                         diabetic.\n\n                                     SCHAEFER\n                         It ain't contagious, don't worry \n                         about it.\n\n               They head for the unoccupied bed. CLOSE-UP on Drummond's \n               profile.\n\n               ROOM 806\n\n               Dark, hushed. Schaefer's girl is leaving; she tiptoes to the \n               door, peeks out. Apparently, the coast is clear. She quickly \n               slips out.\n\n               ROOM 806. DAY\n\n               Drummond on his chair. Barbara perched on one side of her \n               father's bed, Bock on the other. William Mead sleeps on.\n\n                                     BOCK\n                         And you put Schaefer's insulin into \n                         the I.V. jar.\n\n                                     DRUMMOND\n                         Yes. And then a second nurse came \n                         and plugged the I.V. jar into \n                         Schaefer. God clearly intended a \n                         measure of irony here. The hospital \n                         was to do all the killing for me. \n                         All I need do was arrange for the \n                         doctors to become patients in their \n                         own hospital. Accordingly, the next \n                         morning, I set out for Dr. Ives. I \n                         put on Dr. Schaefer's uniform, pinched \n                         some digoxine from the pharmacy and \n                         a sandbag from a utility cart, and \n                         found my way to Dr. Ives' laboratory. \n                         I coshed him with the sandbag, gave \n                         him a massive shot of the digoxine. \n                         This, you see, brought on an instant \n                         condition of cardiac arrhythmia. \n                         When he came to, I brought him down \n                         to the Emergency Room.\n\n               EMERGENCY ROOM AREA, LOBBY. DAY\n\n               The usual E.R. crush and motion goes on in the background. \n               Drummond escorts an obviously ill Dr. Ives to the Admitting \n               Room. Drummond's voice under the narration explains matters \n               to Miss Aronovici at the desk.\n\n                                     DRUMMOND\n                         This is Dr. Ives. He's in the \n                         Nephrology Lab. I was in there a \n                         little while ago, and he was suddenly \n                         taken ill, and I thought I'd better \n                         get him over here right away.\n\n                                     DRUMMOND\n                              (off-screen)\n                         He had at that time perhaps an hour \n                         to live. Prompt treatment would have \n                         saved his life.\n\n               They go into the...\n\n               EMERGENCY ADMITTING AND TREATMENT ROOMS\n\n               Ives, seated on a table in evident distress, breathes heavily.\n\n                                     DRUMMOND\n                              (voice-off)\n                         As a staff doctor, he was seen without \n                         preliminaries...\n\n               An attendant takes his pulse, pressure and respiration. Ives \n               collapses.\n\n                                     DRUMMOND\n                              (voice-off)\n                         His vital signs were taken, an \n                         electrocardiogram...\n\n               PAN SLOWLY across the Emergency Room to catch its state of \n               contained febrility. Every curtained treatment room is \n               occupied, including the storage room in the back. The triage \n               nurse and a second nurse behind the desk are busy on the \n               phones. The triage nurse takes the history of the first in a \n               line of five people seeking admission even as she answers \n               her phone.\n\n               We watch Miss Aronovici and the other nurse and Dr. Spezio \n               and his two interns, the two attendants -- all busy with one \n               patient or another.\n\n                                     DRUMMOND\n                              (voice-off)\n                         ...which revealed occasional \n                         ventricular premature contractions. \n                         An intern took his history...\n\n               ACROSS Drummond, white-uniformed, standing in the back against \n               the filing cabinets and linens, watching the the new patients \n               trickle and crowd in.\n\n                                     DRUMMOND\n                              (voice-off)\n                         ...and then he was promptly...\n\n               At the Admitting Desk, a MAN in his forties is being signed \n               in by a uniformed cop.\n\n                                     DRUMMOND\n                              (voice-off)\n                         ...simply... forgotten to death. \n                         Simply mislaid...\n\n               CAMERA JUST STARES at the pageant of pain.\n\n                                     DRUMMOND\n                              (voice-off)\n                         ...mislaid among the broken wrists, \n                         the chest pains, scalp lacerations, \n                         the man whose fingers were crushed \n                         in a taxi door, the infant with the \n                         skin rash, the child swiped by a \n                         car, the old lady mugged in the \n                         subway, the derelict beaten by \n                         sailors, the teenage suicide, the \n                         paranoids, drunks, asthmatics, the \n                         rapes, the septic abortions, the \n                         overdosed addicts...\n\n               EMERGENCY ROOM AREA, LOBBY\n\n               Looking to the street doors as two ambulance attendants, \n               bearing a seventeen-year-old black girl on a stretcher, burst \n               in.\n\n                                     AMBULANCE ATTENDANTS\n                              (shouting)\n                         Not breathing! Not breathing!\n\n               They hurry into the Admitting Room past a nurse and into \n               the...\n\n               EMERGENCY ADMITTING AND TREATMENT ROOMS\n\n               ...which is already galvanized into action. Miss Aronovici \n               is at the girl's pulse even as she is being transferred to \n               the bed that has just been cleared of Mr. Mitgang and his \n               concussion case.\n\n                                     INTERN\n                              (instructing attendant \n                              with Mitgang)\n                         Better put him in the Holding Room.\n\n                                     MISS ARONOVICI\n                              (with the seventeen-\n                              year-old girl)\n                         She's taking a little pulse.\n\n                                     DR. SPEZIO\n                              (to triage nurse)\n                         Get an anesthesiologist, one-five-\n                         one-five...\n\n               On screen we continue watching the scene of the overdose \n               case treatment, as the live-action sound in the room fades \n               behind Drummond's tale.\n\n                                     DRUMMOND\n                              (off-screen)\n                         ...the fractures, infarcts, \n                         hemorrhages, concussions, boils, \n                         abrasions, the colonic cancers, the \n                         cardiac arrests -- the whole wounded \n                         madhouse of our times...\n\n               REACTION SHOT of Drummond staring at this ceaseless panorama \n               of pain, tears streaking down his cheeks.\n\n                                     MAN'S VOICE\n                              (off-screen)\n                         I wonder if I could have a minute of \n                         your time, Doctor...\n\n               Drummond turns to the voice. CAMERA PULLS BACK to include \n               the man who had been brought into the E.R. by a uniformed \n               cop.\n\n                                     DRUMMOND\n                         I am the fool for Christ and the \n                         Paraclete of Caborca.\n\n                                     NAMELESS MAN\n                         Well, it's an honor and a privilege, \n                         Doctor. I've been here ten minutes, \n                         I can't seem to get anybody to help \n                         me. I'm suffering from some sort of \n                         amnesia. I can't remember my name. \n                         As a matter of fact, it's pretty \n                         screwy. I got mugged. Two hours ago, \n                         walking out of a coffee shop on Fifty-\n                         Seventh Street and Second Avenue, \n                         eight o'clock in the morning, broad \n                         daylight, I got mugged. A sixteen-\n                         year-old girl walks up to me, shows \n                         me a knife about a yard long and \n                         says, \"Give me your wallet.\" I thought \n                         she was kidding. I mean there's \n                         hundreds of people walking right by. \n                         Well, she wasn't kidding. \"Listen,\" \n                         I said, \"all I got's about twenty \n                         bucks.\" So she takes the wallet \n                         anyway. So I said, \"How about leaving \n                         me my identification?\" I mean, I had \n                         my driver's license, my Diner's Club, \n                         my credit cards. But she took them \n                         all, the whole damn wallet, credit \n                         cards, everything. So I stopped some \n                         guy, I said, \"Hey, you see that girl \n                         there, walking away?\" He says, \"Yeah.\" \n                         I said, \"She just stole my wallet, \n                         credit cards and everything.\" He \n                         says, \"Well, that's what they want, \n                         the credit cards.\" So I started \n                         looking for a cop. I mean, go find a \n                         cop, right? Well, I finally find a \n                         cop. The girl's halfway to South \n                         America by now, probably bought the \n                         ticket with my credit cards. So the \n                         cop says, \"What's your name?\" And \n                         you want to know something? I couldn't \n                         think of my name. The girl took all \n                         my identification, you know what I \n                         mean? She took all my credit cards. \n                         So I said, \"You know this is screwy. \n                         I can't think of my name.\" So he \n                         took me to the station house. The \n                         sergeant says, \"What's your name?\" I \n                         said, \"I don't know! She took all my \n                         credit cards!\" So they took me down \n                         here. So what do you think, Doctor? \n                         I'm nuts, right? I finally flipped.\n\n               PAN SLOWLY to Drummond who stares at the Nameless Man.\n\n               In BACKGROUND the door opens and Mrs. Cushing, the lady from \n               accounting, enters. She calls out in her annoying voice from \n               a chart.\n\n                                     MRS. CUSHING\n                         Who's number 7-6-8-0-2-S? Is there \n                         anybody here who is that number?\n\n                                     DRUMMOND\n                              (off-screen)\n                         In this way was it revealed to me \n                         the manner of Nurse Campanella's \n                         death. She was to die of the great \n                         American plague -- vestigial identity.\n\n               RETURN FROM FLASHBACK:\n\n               ROOM 806. DAY\n\n               Drummond in his hospital shift, gaunt and mad as a prophet, \n               sits rigidly on his chair. Barbara perches on her father's \n               bed. Bock wanders disorientedly about the room, staring \n               incredulously first at Barbara and then at her father.\n\n                                     DRUMMOND\n                         So last night, I coshed Miss \n                         Campanella with a sandbag, sedated \n                         her with thorazine, shaved her, \n                         prepped her, and parked her in a \n                         corridor of the X-Ray Department for \n                         five hours.\n\n                                     BOCK\n                         Why X-Ray?\n\n                                     DRUMMOND\n                         Well, at X-Ray, a sedated body lying \n                         around unattended for five hours \n                         wouldn't seem unusual.\n\n                                     BOCK\n                         Of course.\n\n                                     DRUMMOND\n                         Her operation -- that is to say, \n                         Mrs. Mangafranni's operation -- was \n                         not scheduled until nine-thirty. So \n                         at nine-fifteen this morning, I rang \n                         for my nurse...\n\n                                     BOCK\n                         You rang for your nurse?\n\n                                     DRUMMOND\n                         To insure one full hour of \n                         uninterrupted privacy.\n\n                                     BOCK\n                         Oh yes.\n\n                                     DRUMMOND\n                         I got up, wheeled Miss Campanella \n                         off to the operating rooms, replaced \n                         her bed with Mrs. Mangafranni's, \n                         exchanged charts and identity \n                         bracelets. She died officially of \n                         anesthesia shock. But, in point of \n                         fact, she died because she was wearing \n                         another woman's identity.\n\n                                     BARBARA\n                              (to Bock)\n                         God, what do we do now? Let me take \n                         him back to Mexico. It's a simple \n                         world there. If you turn him in, \n                         they'll just cage him in the Rockland \n                         State Hospital for the Criminally \n                         Insane. Let me take him back, Herb.\n\n                                     BOCK\n                         Are you kidding? We'll both take \n                         him. I'm going with you! Get him \n                         dressed. We're getting out of here \n                         before the police put us all in \n                         Rockland State.\n\n                                     DRUMMOND\n                         I haven't finished my work here. I \n                         have this Welbeck to dispose of. I \n                         am the angel of the bottomless pit \n                         and the wrath of the lamb.\n\n                                     BARBARA\n                         Oh dear, he's having another \n                         revelation.\n\n               Bock holds Drummond's coat and hat and crosses to take his \n               arm. He finds the entranced Drummond as rigid as a statue.\n\n                                     BOCK\n                         Look, that ambulance must be here by \n                         now. You go down and get them. I'll \n                         give him a shot of something to knock \n                         him out. We'll take him to the airport \n                         in the ambulance.\n\n               They both hurry out of the room. Drummond remains enmarbled \n               in his trance. CAMERA SUDDENLY MOVES DOWN to William Mead, \n               whose eyes now open; he has heard it all. In background, \n               Drummond, suddenly released from his catatonic trance, heads \n               for the armoire and extracts the white trousers of Dr. \n               Schaefer's uniform. He puts them on, tucking in the tails of \n               his hospital shift. He notices William Mead staring at him.\n\n                                     DRUMMOND\n                         You're hallucinating again.\n\n               William Mead just stares at Drummond.\n\n               EIGHTH FLOOR, NURSES' STATION AND LOBBY AREA\n\n               Bock and Barbara come hurrying around the corner from the \n               west corridor. Barbara heads for the elevators. Bock heads \n               for the Nurses' Station. The Eighth Floor is going about its \n               normal 1:15 P.M. activity. Mrs. Donovan is at her desk on \n               the phone.\n\n                                     MRS. DONOVAN\n                         ...Edwards never showed up. I'm short-\n                         staffed as hell. It's just me and \n                         Felicia. It's like Sunday. Nobody's \n                         here.\n\n                                     DR. BIEGELMAN\n                         I'll be at lunch...\n\n               A nurse's aid, a bathrobed patient and two of his visitors \n               stroll by. It's the end of the lunch hour, when the kitchen \n               workers bring used trays back.\n\n                                     MRS. DONOVAN\n                         Yeah, you gotta send me somebody... \n                         Oh yeah?\n\n               Bock moves past Mrs. Donovan and into the pharmacy where we \n               see him scouring the shelves for thorazine and a syringe. An \n               elevator arrives, disgorging Milton Mead and his resident \n               assistant, Thomas Hitchcock and, of all people, Dr. Richard \n               Welbeck himself. Barbara and Dr. Biegelman go into the \n               elevator. The doors close. Milton Mead and Hitchcock head \n               for the west corridor. Welbeck, in his natty double-breasted \n               suit and carrying his cashmere coat, heads straight for the \n               Nurses' Station.\n\n                                     MEAD\n                         We'll be in Eight-O-Six.\n\n                                     MRS. DONOVAN\n                              (chuckles into phone)\n                         ...then what did she say?\n\n                                     WELBECK\n                              (to Mrs. Donovan)\n                         I'm Dr. Welbeck. I have a patient on \n                         this floor named Drummond, and I'd \n                         like to see his chart.\n\n                                     MRS. DONOVAN\n                         I'll call you back.\n\n               Bock immediately emerges from the pharmacy holding a bottle \n               of thorazine and a wrapped hypodermic syringe. He scowls at \n               Welbeck, who scowls back.\n\n                                     WELBECK\n                         Oh, Dr. Bock. Can I have a few minutes \n                         of your time, sir?\n\n                                     BOCK\n                         No.\n\n               He starts to pass Mrs. Donovan and would continue, but Welbeck \n               lays a restraining hand on his arm.\n\n                                     WELBECK\n                         Dr. Gilley tells me you're the one \n                         who initiated these proceedings \n                         against me.\n\n                                     BOCK\n                         I'm busy, Welbeck.\n\n                                     WELBECK\n                         I'd like to know what you have against \n                         me.\n\n                                     BOCK\n                         You turned up half-stoned for a simple \n                         nephrectomy eight days ago, botched \n                         it, put the patient into failure and \n                         damn near killed him. Then, pausing \n                         only to send in your bill, you flew \n                         off on the wings of man to an island \n                         of sun in Montego Bay. This is the \n                         third time in two years we've had to \n                         patch up your patients; the other \n                         two died. You're greedy, unfeeling, \n                         inept, indifferent, self-inflating \n                         and unconscionably profitable. Aside \n                         from that, I have nothing against \n                         you. I'm sure you play a hell of a \n                         game of golf. What else do you want \n                         to know?\n\n               Welbeck's pocket-beeper BEEPS.\n\n                                     WELBECK\n                         Excuse me for a moment, Doctor.\n                              (he reaches over the \n                              nurses' desk for a \n                              phone)\n                         This is Dr. Welbeck. Were you paging \n                         me?\n                              (regarding Bock with \n                              cold scorn)\n                         How much do you make a year, Bock? \n                         For a guy who makes a lousy forty, \n                         fifty grand...\n                              (on phone)\n                         Hello, Arthur, I understand you've \n                         been trying to reach me all morning...\n\n               Bock turns and heads back for...\n\n               EIGHTH FLOOR, WEST CORRIDOR\n\n               ...and down that through the kitchen workers and strolling \n               patients to...\n\n               ROOM 806\n\n               ...which he enters. He is startled to find Milton Mead and \n               Hitchcock leaning over William Mead, who is up on one elbow \n               and in a state.\n\n                                     WILLIAM MEAD\n                         I'm telling you, Milton, he pulls \n                         out all the wires and the tubes, and \n                         he gets up and puts on a doctor's \n                         uniform, and he goes out, and he \n                         murders doctors! He just went out \n                         ten seconds before you came in!\n\n               Indeed, there is no Drummond to be seen. His bed is empty. \n               Bock nods to Milton Mead and Hitchcock, who nod back, and \n               crosses quickly to look into the bathroom which is likewise \n               empty.\n\n                                     WILLIAM MEAD\n                         And I'll tell you something else \n                         about this crazy place you got here! \n                         There was a naked Indian in here \n                         last night doing a war dance! That's \n                         the kind of crazy place you're running \n                         here, Milton! You got to get me out \n                         of here, Milton. This is a crazy \n                         place, Milton!\n\n               Milton Mead's pocket-beeper BEEPS. Milton Mead reaches for \n               the phone.\n\n                                     WILLIAM MEAD\n                              (appealing to Bock)\n                         I wake up last night, there's a goddam \n                         Indian in here, a naked Indian! What \n                         kind of hospital is this?\n\n                                     MILTON MEAD\n                              (on phone)\n                         This is Mr. Mead, are you paging me?\n\n                                     WILLIAM MEAD\n                         A couple of hours later I wake up \n                         again, and the guy in that bed there \n                         is getting out of the bed...\n\n                                     MILTON MEAD\n                              (to Hitchcock)\n                         Are the police still in the building?\n\n                                     HITCHCOCK\n                         Yes.\n\n                                     MILTON MEAD\n                         You'd better get them up here. Yes.\n\n                                     WILLIAM MEAD\n                         All day long, he lays there like a \n                         dead man. All of a sudden, in the \n                         middle of the night, he gets out of \n                         bed! I thought I was going crazy!\n\n                                     MILTON MEAD\n                              (on phone)\n                         Yes, this is Mead... Oh, dear. \n                         When?...\n\n                                     WILLIAM MEAD\n                         You know what he says to me? He says, \n                         you're hallucinating. Listen, I just \n                         saw a naked Indian. Now, I'm seeing \n                         a ghost. I got to figure he's right, \n                         I'm hallucinating, right?\n\n                                     MILTON MEAD\n                         I'll be down directly.\n                              (hangs up)\n                         Never rains but it pours. A fire \n                         just broke out in one of those \n                         condemned buildings. The squatters \n                         in the building came out. The police \n                         tried to arrest them and, apparently, \n                         the situation has erupted into a \n                         riot.\n                              (to Bock as he heads \n                              for the door)\n                         I'm sure you're wondering what this \n                         is all about, Herb.\n\n                                     WILLIAM MEAD\n                         You're not going to leave me alone \n                         in this crazy place, Milton!\n\n                                     MILTON MEAD\n                              (at the door with \n                              Bock)\n                         Mr. Hitchcock is staying with you.\n                              (to Hitchcock)\n                         You better call the cops, Tom.\n\n                                     WILLIAM MEAD\n                         Milton! Milton! Milton!!!\n\n               The door slams.\n\n               WEST CORRIDOR AND NURSES' STATION\n\n               Bock and Milton Mead stride up the corridor through the linen \n               wagons and kitchen carts.\n\n                                     MILTON MEAD\n                         I haven't the time now, and I'm not \n                         even going to try to tell you this \n                         curious story my brother just told \n                         me. I'll fill you in on it at lunch \n                         some time.\n\n               He waves his hand helplessly to indicate the utter incredulity \n               of it all.\n\n                                     MILTON MEAD\n                              (rushes not to miss \n                              the elevator)\n                         Hold it!\n\n               They reach an open elevator. Mead goes in, the doors close. \n               The doors of a second elevator then open, and Barbara comes \n               out. She and Bock stare at each other. In background, Welbeck \n               is on the phone at the Nurses' Station.\n\n                                     BARBARA\n                         The ambulance is here.\n\n                                     BOCK\n                         Yeah, but your father isn't. He's \n                         disappeared. He put on Schaefer's \n                         uniform and has gone out to do God's \n                         work, presumably the murder of Dr. \n                         Welbeck. Except, that fellow on the \n                         phone over there is Dr. Welbeck.\n\n                                     WELBECK\n                              (in background on \n                              phone)\n                         Oh my God, Arthur! What are you \n                         talking about? Have you talked to \n                         Dr. Hogan about this?\n\n                                     BOCK\n                         And, on top of everything else, the \n                         other patient in your father's room \n                         overheard his whole confession and \n                         just told the Chief Administrator of \n                         the hospital. They're sending for \n                         the cops.\n\n               REVERSE ACROSS Welbeck on phone at Nurses' Station. In the \n               background, Bock and Barbara stare at him.\n\n                                     WELBECK\n                              (almost apoplectic on \n                              phone)\n                         Oh, my God, Arthur. Well, who held \n                         title? Do the underwriters know about \n                         this yet?... Oh my God! Arthur, \n                         what're you waiting for? Arrest the \n                         son of a bitch! Turn him in!... Oh \n                         my God! When?... Of course, Arthur, \n                         call me right back. I'm at the Holly \n                         Pavilion, Eighth Floor. Please! Right \n                         away!\n\n               He hangs up.\n\n                                     BOCK\n                         Are you all right, Welbeck?\n\n                                     WELBECK\n                         All right?! That son of a bitch is \n                         trying to wipe me out! My partner, \n                         the eminent orthopedic surgeon, Dr. \n                         Noel Hogan, is a miserable thief. \n                         And he's trying to wipe me out!\n\n                                     MRS. DONOVAN\n                              (extending a chart)\n                         Mr. Drummond's chart, Doctor.\n\n                                     WELBECK\n                              (angrily seizes the \n                              chart)\n                         What room is it?\n\n                                     MRS. DONOVAN\n                         Eight-O-Six.\n\n                                     WELBECK\n                         I'm expecting a phone call. Put it \n                         straight through to me in that room.\n\n               He strides off angrily, followed by an anxious Bock and \n               Barbara, for the...\n\n               EIGHTH FLOOR, WEST CORRIDOR\n\n               Bock and Barbara hurry along in Welbeck's wake.\n\n                                     WELBECK\n                         The son of a bitch has been draining \n                         the company with phony purchase orders \n                         on another company, of which, it now \n                         turns out, his wife is the principal \n                         stockholder! Transparent fraud! I'll \n                         send him up for twenty years!\n\n               He wrenches open the door of 806, marches in, followed by \n               Bock and Barbara.\n\n               EIGHTH FLOOR, ROOM\n\n               Welbeck advances on William Mead's bed, since he is the only \n               patient in the room. (Hitchcock is on the phone.)\n\n                                     WELBECK\n                         Well, Drummond, you don't seem that \n                         much the worse for the wear.\n\n               William Mead stares dully at Welbeck. Then he looks dully at \n               Bock.\n\n                                     WELBECK\n                              (to Hitchcock)\n                         Would you mind using some other phone? \n                         I'm expecting an important call.\n\n                                     WILLIAM MEAD\n                         What is this? Who... who is this \n                         guy?\n\n                                     HITCHCOCK\n                              (on phone)\n                         Yes, well, I'll be at the Nurses' \n                         Desk, Sergeant. It would be futile \n                         for me to try to explain this to you \n                         over the phone.\n\n                                     WELBECK\n                              (leafing through \n                              Drummond's chart)\n                         You've got a bit of fever, Drummond, \n                         but you're coming along very well.\n\n                                     WILLIAM MEAD\n                         I'm not Drummond, you monkey! \n                         Drummond's the other bed!\n\n               The phone now BUZZES. Welbeck and Hitchcock both head for \n               it.\n\n                                     WELBECK\n                         That's mine.\n                              (on phone)\n                         It's Welbeck here... Yes, Arthur, go \n                         ahead...\n\n               William Mead is painfully trying to get off his bed.\n\n                                     WILLIAM MEAD\n                         I'm getting out of this nuthouse!\n\n                                     BOCK\n                              (pushing him gently \n                              back)\n                         All right, take it easy, Mr. Mead.\n\n               Hitchcock, satisfied the call is not for him, exits.\n\n                                     WILLIAM MEAD\n                         I came in here just to get a lousy \n                         polyp cut out.\n\n                                     WELBECK\n                              (on phone)\n                         Oh, my God, what do you mean? How \n                         many transactions were there? Bu... \n                         but Arthur, I... I borrowed against \n                         that stock! I'm in the hole for over \n                         three hundred thousand!...\n\n                                     WILLIAM MEAD\n                              (appealing to the \n                              gods)\n                         I'm a sick man! I'm supposed to have \n                         peace and quiet!\n\n                                     WELBECK\n                              (on phone and \n                              apoplectic)\n                         What do you mean, Brazil?! I just \n                         spoke to Hogan's office yesterday, \n                         and they just told me...\n\n               The phone slips from his fingers. He turns to stare at Bock \n               and Barbara.\n\n                                     WELBECK\n                         I'm wiped out. The S.E.C. has \n                         suspended trading in my stock!\n\n               He keels over like a felled tree, falling face-up on \n               Drummond's bed, his legs dangling to the floor. William Mead \n               promptly hides his head under his sheet.\n\n               Bock moves quickly to the prostrate Welbeck, feels his throat \n               for the carotid pulse, pulls out his stethoscope, rips \n               Welbeck's shirt open, and listens for heartsounds. He picks \n               up the dangling telephone receiver, gets a dial tone.\n\n                                     BOCK\n                              (on phone)\n                         Cardiac arrest, Holly Eight.\n\n               Barbara strips off her coat. She is still in nurse's uniform. \n               She leans into the hall and calls a passing nurse.\n\n                                     BARBARA\n                         We have an emergency here.\n\n                                     BOCK\n                              (rips off Welbeck's \n                              natty jacket)\n                         Breathe him.\n\n               Barbara helps Bock get Welbeck's dead weight onto the floor. \n               On his knees, Bock straddles Welbeck's prone form, balls his \n               fist and belts Welbeck on his chest. He begins intensive \n               heart massage. Barbara gets down on her knees, opens Welbeck's \n               mouth and commences mouth-to-mouth resuscitation. In the \n               background, the P.A. system blandly echoes:\n\n                                     P.A. SYSTEM\n                              (off-screen)\n                         C.A.C. Holly Eight. Please clear all \n                         corridors.\n\n               Mrs. Donovan and aides move C.A.C. into the room, immediately \n               followed by Intern Chandler rushing past them.\n\n                                     MRS. DONOVAN\n                         Where's Biegelman?\n\n                                     CHANDLER\n                         He went to lunch.\n\n                                     MRS. DONOVAN\n                         Natch. Get that other bed out of \n                         here.\n\n               William Mead, of course, is still huddled under his sheet. \n               He peers out from under his covers in wide-eyed disbelief \n               and ducks under again. Bock massages Welbeck's heart. Barbara \n               continues mouth-to-mouth. Nurse Felicia Chile hurries in, \n               pushing the emergency cart before her.\n\n                                     BARBARA\n                              (to Nurse Chile as \n                              others begin moving \n                              William Mead's bed \n                              out of the room)\n                         Give him an ambu bag and an airway.\n\n                                     VOICE\n                              (off-screen)\n                         What's been happening?\n\n               Nurse Chile has shunted the emergency cart aside to let the \n               bed out and is extracting an ambu bag and tube from the cart's \n               lower shelf.\n\n                                     CHANDLER\n                              (to Seventh Floor \n                              Nursing Supervisor \n                              just outside door)\n                         Watch it...\n\n                                     P.A. SYSTEM\n                              (off-screen)\n                         C.A.C. Holly Eight. Please clear all \n                         corridors.\n\n               Nurse Chile hands the Berman airway and ambu bag to Barbara, \n               who inserts the airway and the ambu tube into Welbeck's mouth \n               and pumps in air by hand. Bock massages away.\n\n               EIGHTH FLOOR, WEST CORRIDOR\n\n               Mrs. Donovan and Intern Chandler finally get Mead and his \n               bed out into the corridor where they park it. In background, \n               emergency activity on all sides. The resident cardiologist, \n               DR. GEOFFREY MORSE, and anesthesiologist, DR. LAWRENCE LOOMIS, \n               both thirty-three, come hurtling around the corner.\n\n                                     DR. MORSE\n                         In here?\n\n                                     MRS. DONOVAN\n                         Yeah.\n\n               She follows Morse in as, from the lobby corner, two \n               technicians come racing a max cart and an I.V. stand before \n               them. Behind them, a bewildered Hitchcock moves into view, \n               trying to determine what's going on.\n\n                                     HITCHCOCK\n                              (to Intern Chandler)\n                         Who is it?\n\n                                     P.A. SYSTEM\n                              (off-screen)\n                         Dr. Robert Jackson.\n\n                                     CHANDLER\n                         One of the patients had a cardiac \n                         arrest.\n\n               Hitchcock looks down at the sheeted figure hunched on the \n               bed parked in the hallway and slowly pulls the sheet off his \n               head. William Mead stares up at him like a hunted animal. \n               Hitchcock covers Mead's head again.\n\n               ROOM 806\n\n               Bock still massages, sweating bullets by now. Barbara works \n               the ambu bag. Dr. Morse is feeling Welbeck's groin for his \n               femoral pulse.\n\n                                     DR. MORSE\n                         What do you have, Dr. Bock?\n\n                                     BOCK\n                         Total cardiac arrest.\n\n                                     P.A. SYSTEM\n                              (off-screen)\n                         Dr. Rigby. Dr. Rigby. Dr. Lilac.\n\n                                     DR. MORSE\n                         How long has he been like this?\n\n                                     BOCK\n                         About a minute. No pulse, no \n                         heartbeat, no respiration...\n\n               If we can see anything of Welbeck through other bodies, we \n               notice almost all his clothes have been ripped off his body. \n               Dr. Loomis replaces Barbara.\n\n                                     DR. LOOMIS\n                         All right, I'll take over.\n\n               The two nursing supervisors have been getting the max cart \n               ready, snapping up the gateleg-footrest and attaching the \n               I.V. tube to the oxygen jar, and that to the ambu bag.\n\n                                     BOCK\n                         Endotrachial tube.\n\n                                     DONOVAN\n                              (rushing in background \n                              with others)\n                         I'm sorry, Doctor, but we have another \n                         emergency in 823.\n\n                                     CHANDLER\n                         Endotrachial tube.\n\n                                     DR. LOOMIS\n                         Shall we get him up on the cart?\n\n                                     DR. MORSE\n                         Yeah.\n\n               Drs. Loomis, Bock and Morse struggle to lift the the nearly \n               naked dead weight of Dr. Welbeck up from the floor and onto \n               the max cart. Dr. Morse has picked up Drummond's chart from \n               the bed where Welbeck had left it.\n\n                                     DR. MORSE\n                         All right, who is this patient? What's \n                         the story on this patient?\n\n               CLOSE-UP of Bock trying to hoist Welbeck and looking up \n               slowly.\n\n                                     DR. MORSE\n                         Is this his chart, Dr. Bock?\n\n               Bock cocks his head to him.\n\n                                     DR. MORSE\n                         What's his name? Drummond?\n\n               Bock looks across to Barbara, now helping out at the max \n               cart. She looks back at Bock. She shrugs. He shrugs. They \n               exchange a smile.\n\n                                     BOCK\n                         Yes, his name's Drummond. That's his \n                         chart.\n\n               Straining under the effort, the three doctors get Welbeck \n               off the floor.\n\n                                     DR. MORSE\n                              (studying the chart)\n                         Oh Christ, the poor son of a bitch \n                         just had a nephrectomy a week ago.\n\n               Mrs. Donovan exits into...\n\n               EIGHTH FLOOR, WEST CORRIDOR\n\n               ...as Mrs. Donovan comes out, Hitchcock turns to her.\n\n                                     HITCHCOCK\n                         Was it Drummond?\n\n                                     MRS. DONOVAN\n                         Who else would it be?\n\n               Hitchcock silently thanks God.\n\n               ROOM 806\n\n                                     DR. MORSE\n                              (off-screen)\n                         Pick him up. Put him on it. Stop the \n                         massage.\n\n               Welbeck's body is finally on the max cart. Nurses and doctors \n               converge on him. Dr. Loomis sets about intubating Welbeck, \n               and the Nursing Supervisor begins clamping the metal bands \n               of the E.K.G. machine on each of Welbeck's extremities.\n\n               While all this goes on, Bock and Barbara have picked up the \n               remnants of Welbeck's jacket, trousers, shirt and underwear. \n               Dr. Morse is squatting by the max-cart reading the E.K.G. \n               script as it rolls slowly out of the cart.\n\n                                     DR. MORSE\n                         Ventricular fibrillation. Get me the \n                         paddles. Push another amp of bicarb.\n\n               The Nursing Supervisor starts applying electrode paste to \n               the defibrillating paddles. Another nurse measures off an \n               ampule of bicarbonate of soda which Dr. Loomis injects into \n               the I.V. tube.\n\n                                     DR. MORSE\n                         Set it for two hundred.\n\n               Barbara unsnaps her father's valise and stuffs Welbeck's \n               garments in it. Bock takes Welbeck's coat and piles Drummond's \n               things on top of that.\n\n               The Nursing Supervisor hands Dr. Morse the defibrillating \n               paddles to place on Welbeck's left breast.\n\n                                     NURSE\n                              (off-screen)\n                         That's two hundred.\n\n                                     DR. MORSE\n                         Everybody bock away.\n\n               All back away from the max-cart. Bock and Barbara are at the \n               window, piled up with valise and coats; they look like they're \n               off for Europe.\n\n                                     DR. MORSE\n                              (off-screen)\n                         One-two-three...\n\n               He pushes the defibrillating button, sending an electric \n               shock through Welbeck's body so as to bounce it into the \n               air.\n\n               Bock and Barbara remain at the window with heart-resuscitation \n               team in background. Barbara slips into her own coat, in \n               preparation for escape.\n\n                                     DR. MORSE\n                              (in background)\n                         Did he convert?\n\n                                     DR. LOOMIS\n                              (in background)\n                         No, he's still fibrillating.\n\n                                     DR. MORSE\n                              (in background)\n                         Let's go to four hundred.\n\n                                     BARBARA\n                              (sotto voce to Bock)\n                         What do we do now?\n\n               Bock is staring out the window. Barbara stares out with him.\n\n               THEIR P.O.V.: looking down onto the U-shaped drive of the \n               entrance plaza of the hospital and First Avenue full of \n               traffic. A band of some fifty black and Puerto Rican youths, \n               including females and young white revolutionaries, most in \n               Che Guevara garb, have broken past the security guards at \n               the gates and spill across the drive. Some policemen and \n               security guards move tentatively out of the hospital to \n               intercept them.\n\n               The shouting can't be heard from up here. Off-screen we hear \n               the activities of the resuscitation team.\n\n                                     NURSING SUPERVISOR\n                              (off-screen)\n                         It's four hundred.\n\n                                     DR. MORSE\n                              (off-screen)\n                         Everybody back One-two-three...\n\n               SOUND of the shock.\n\n                                     DR. MORSE\n                              (off-screen)\n                         That didn't work either.\n\n               FIRST AVENUE. HIGH SHOT\n\n               Low crowd noises. Bock looks out the window at the protesting \n               mob below.\n\n                                     DR. MORSE\n                              (off-screen)\n                         All right. Let me have a c.c. of \n                         Adrenaline and intercardiac needle.\n\n               CAMERA PANS SLOWLY UP over the melee in the plaza to the \n               fence. Barbara and Bock stare down at the crowd.\n\n                                     DR. MORSE\n                              (off-screen)\n                         Stop the massage. Ventricular \n                         fibrillation. Put another amp of \n                         bicarb. Two hundred.\n\n               ZOOM DOWN into the maelstrom to FULL SHOT of the Reverend \n               Drummond dressed in Schaefer's white uniform, standing on \n               the slim island separating the uptown traffic from the \n               downtown traffic. Drummond is a private island of his own, \n               hands stretched to the skies. He is prophesying.\n\n                                     DRUMMOND\n                              (barely audible above \n                              the traffic rumbling \n                              heedlessly around \n                              him)\n                         Let those who are in Judea flee to \n                         the mountains, for the age is closed, \n                         the season of the seventh seal is at \n                         hand!\n\n               ROOM 806\n\n               Bock and Barbara slip through doctors and nurses, heading \n               for the door.\n\n                                     DR. MORSE\n                         Hang isopril, two in five hundred. \n                         Let's take one more crack with the \n                         paddles. Everybody back off the cart.\n\n               Bock, carrying two overcoats, and Barbara, wearing hers and \n               carrying her father's valise, exit into...\n\n               EIGHTH FLOOR, WEST CORRIDOR\n\n               ...as Bock and Barbara come out, the activity is normal, \n               with the exception of William Mead's bed along the wall. \n               Hitchcock and two overcoated men are in the hallway, and \n               Hitchcock hurries to Bock.\n\n                                     HITCHCOCK\n                         Is he dead?\n\n                                     BOCK\n                         They can't get him out of fib. I \n                         don't think he'll make it.\n\n                                     HITCHCOCK\n                         Thank God.\n                              (sighs, turns to the \n                              two detectives)\n                         This should close the case, Sergeant.\n\n               Bock and Barbara hurry toward the elevators.\n\n               THE HOSPITAL, HOLLY PAVILION, LOBBY\n\n               The small army of militants and activists has broken through \n               the security into the lobby. Their entrance is greeted by \n               one small scream from a woman in the lobby. A LEADER of the \n               invading troop calls out.\n\n                                     LEADER\n                         Everybody take it easy! Nobody's \n                         going to be hurt! We just want the \n                         Director!\n\n               Others in the troop shout reassurances, but it doesn't really \n               reassure anybody. The lady in the gift shop closes her door \n               and locks up. People crowd in a solid block in the doorway \n               to the coffee shop to see what's going on.\n\n               From the long tunnels of corridors, nurses, doctors, \n               administrative personnel pause in their chores and errands \n               and missions to watch the tide of events in the lobby.\n\n               HOLLY PAVILION, EXECUTIVE CORRIDOR\n\n               The exit door is wrenched open, and Bock comes hurtling into \n               the carpeted executive corridor toward the lobby, and at \n               that moment the troop of militants come rumbling in from the \n               other end. Every door of the corridor fills with secretaries \n               and administrators unsure of what's happening. Then, Sundstrom \n               elbows his way through the clutch of secretaries in his \n               doorway and comes into the corridor. He regards the militants \n               moving down the corridor toward him.\n\n                                     SHOUTING CROWD\n                         We want Sundstrom! We want Sundstrom! \n                         Community control! Community control! \n                         Hip-hip-Hippocrates! Up with service! \n                         Down with fees!\n\n                                     SUNDSTROM\n                         You people want to see me?\n\n                                     FIRST MILITANT\n                         Yeah, baby, we want to see you...\n\n                                     SECOND MILITANT\n                         We're taking over this hospital, \n                         man...\n\n                                     SUNDSTROM\n                         I've had it up to here. I'm not \n                         dealing with this kind of cheap \n                         blackmail!\n\n                                     LEADER\n                         Now look, man. Now wait a minute \n                         there!\n\n                                     FIRST MILITANT\n                         We're looking for a hostage!\n\n                                     LEADER\n                         Fourteen people just got arrested \n                         for doing...\n\n               In the background, one of their fellow revolutionaries speaks \n               up...\n\n                                     MAN\n                         Lookit, man, where's the TV camera?\n\n               ...but he's shut up by the Leader.\n\n                                     LEADER\n                         Would you be cool, man?\n                              (now yelling)\n                         Fourteen people got arrested for \n                         doing nothing but living in their \n                         homes, which you people threw them \n                         out of.\n\n                                     CROWD\n                         Right on!\n\n                                     LEADER\n                         So now we're going to arrest you. \n                         We're going to hold you hostage and \n                         we ain't letting you go un...\n\n               Ambler, the medical student we met during Bock's teaching \n               rounds, pushes in front of the Leader to face Sundstrom.\n\n                                     AMBLER\n                         We, the members of the Doctors \n                         Liberation Committee indict this \n                         hospital for the criminal neglect of \n                         the community in which it is situated! \n                         We demand an immediate dissolution \n                         of the governing and executive boards.\n\n                                     SHOUT\n                         What are you going to do about those \n                         fourteen ghetto people?\n\n               As the shouts continue, Sundstrom raises a hand to quiet the \n               crowd.\n\n                                     SUNDSTROM\n                         I am not going to do anything... \n                         about anything.\n\n                                     SHOUT\n                         Yes, you are!\n\n                                     SUNDSTROM\n                         By God, if you want to take over \n                         this hospital, you take it over!\n\n                                     SHOUTS\n                         We will! Right on!\n\n                                     SUNDSTROM\n                         You run it! I am finished! I quit! \n                         You run it! You pay the bills! You \n                         fight the city!\n\n                                     MILITANT\n                         We will!\n\n                                     SUNDSTROM\n                         You fight the state! You fight the \n                         unions. You fight the community! \n                         You... you think you can do a better \n                         job, you do it! Now I am finished! I \n                         quit! It's all yours!\n\n               Eyes filled with tears of rage, Sundstrom lowers his head \n               and moves into the mass of militants, which parts for him to \n               leave.\n\n                                     CROWD\n                         Quit! Quit!\n\n               The mass engulfs Sundstrom, moving back out into the lobby \n               with him, pushing him, shoving him, humiliating him.\n\n               REACTION SHOT of Bock watching it all from the far end of \n               the corridor. He closes his eyes and the pain of watching \n               all this shows on his face. He opens his eyes. The corridor \n               is now silent and empty. He hurries to...\n\n               HOLLY PAVILION, THE LOBBY\n\n               Bock rushes in, as the milling throng dissolves into the \n               bystanders, security police and city cops. Common sense has \n               settled in and the general tenor is to avoid any further \n               trouble. We can hear the rhythmic patter of cops.\n\n                                     SHOUTS OF COPS\n                         All right, come on... come on -- \n                         Let's clear the area. -- Come on, \n                         let's clear this place... Keep cool. \n                         Everybody keep cool.\n\n               Bock elbows his way through the throng as it drifts toward \n               the doors to...\n\n               THE HOSPITAL, ENTRANCE PLAZA. DAY\n\n               ...and goes through the gathering police. A mobile TV camera \n               crew and a few reporters are hurrying up through the gates \n               from First Avenue.\n\n               FIRST AVENUE. DAY\n\n               The Reverend Drummond stands, a solitary human island, among \n               the shrill ROAR of the city. The protesters protest endlessly, \n               CHANTING, SHOUTING. Absolutely no one pays any attention to \n               the gaunt, doctor-clad sixty-year-old man standing on an \n               island.\n\n               Except, of course, for Bock, who must pause to wait for a \n               red light. Bock hustles through the traffic to where Drummond \n               stands.\n\n                                     DRUMMOND\n                         Let those who are in Judea flee to \n                         the mountains, for the age is closed, \n                         the season of the seventh seal is at \n                         hand! The age is closed! The season \n                         of the seventh se...\n\n                                     BOCK\n                         Dr. Welbeck is dead. They thought he \n                         was you.\n\n                                     DRUMMOND\n                         Yes, I know. We must arrange to have \n                         his body shipped to my Apache village \n                         where we will bury him with full \n                         tribal rites. In a day or two, \n                         somebody'll ask, \"Whatever happened \n                         to Dr. Welbeck?\" And it will be \n                         assumed he absconded to Brazil to \n                         join his partner, the eminent \n                         orthopedic surgeon, Dr. Noel Hogan. \n                         Welbeck, too, was mislaid, overlooked, \n                         forgotten to death, you see.\n\n               The ambulance pulls up and Barbara gets out of it.\n\n                                     BARBARA\n                              (taking her father \n                              around to the back)\n                         We have to hurry, Dad.\n\n               The light turns green. The traffic starts flowing around \n               them, disjoined by the ambulance blocking one lane on each \n               side of the dividing island. An ambulance attendant has opened \n               the back doors to get Drummond in. Barbara hurries toward \n               the front, climbs in, holds the door open for Bock. He stands \n               a few paces back.\n\n                                     BOCK\n                         I'm not going.\n                              (he moves to the \n                              ambulance, closes \n                              the door)\n                         The hospital's coming apart. I can't \n                         walk out on it when it's coming apart. \n                         Somebody has to be responsible, \n                         Barbara. Everybody's hitting the \n                         road, running to the hills, running \n                         away. Somebody's got to be \n                         responsible.\n                              (across Barbara to \n                              the driver)\n                         Kennedy Airport. You've got a two-\n                         thirty flight to make.\n\n               He turns, and the ambulance pulls away. Bock goes back to \n               the sidewalk where he meets Sundstrom, now wearing his coat.\n\n                                     BOCK\n                         You going back in?\n\n                                     SUNDSTROM\n                         Yeah.\n\n               They make their way back toward...\n\n               THE HOSPITAL, ENTRANCE PLAZA\n\n               The two physicians trudge across the U-drive.\n\n                                     SUNDSTROM\n                              (matter-of-factly)\n                         It's like pissing in the wind, right, \n                         Herb?\n\n                                     BOCK\n                         Right.\n\n                                                                  FADE OUT.\n\n                                         THE END\n\n\n\n\n\n\nHospital, The\nWriters :   Paddy Chayefsky\nGenres :   Comedy  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:27:05.946578"}