{"title": "Human Nature", "film_link": "/Movie Scripts/Human Nature Script.html", "script_link": "/scripts/Human-Nature.html", "info_raw": "\n\nHuman Nature Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Charlie Kaufman\nGenres  Comedy\nScript Date : January 2001\n\nRead \"Human Nature\" Script\n\n\n", "script": "\n                                      \"HUMAN NATURE\"\n\n                                            by\n\n                                     Charlie Kaufman\n\n                                       May 20, 1995\n\n                                       FIRST DRAFT\n\n                \n\n               BLACKNESS.\n\n               There is a gunshot. A crow screams. A fluttering of wings.\n\n               FADE IN:\n\n               EXT. FOREST - DAY\n\n               Bird's-eye view. We circle lazily above the forest.\n\n               Through a break in the trees, we catch an occasional glimpse \n               of a prostrate form on the ground. As the circling camera \n               gets closer we see that the form is a human body.\n\n                                                                    CUT TO:\n\n               EXTREME CLOSE-UP OF LILA TALKING TO THE CAMERA\n\n                                     LILA\n                         I'm not sorry.\n\n               A bead of sweat trickles down her cheek. Then: a blinding \n               flash of light obliterates her face.\n\n                                                                    CUT TO:\n\n               EXTREME CLOSE-UP OF PUFF TALKING TO THE CAMERA\n\n                                     PUFF\n                         I am sorry.\n\n               A tear wells in Puff's eye and runs down his face. Another \n               blinding flash of light.\n\n                                                                    CUT TO:\n\n               EXTREME CLOSE-UP OF NATHAN TALKING TO THE CAMERA\n\n                                     NATHAN\n                         I don't even know what sorry means \n                         anymore.\n\n               As Nathan speaks, a trickle of blood drips down his face \n               from his out-of-frame forehead. Another blinding flash of \n               light.\n\n                                                                    CUT TO:\n\n               EXT. POLICE STATION - NIGHT\n\n               It's a frenetic hand-held shot as Lila is pulled from a police \n               car and dragged into the precinct house. Cameras flash. \n               Reporters shout questions. Lila attempts to shield her face \n               from view, but she is handcuffed and can only manage to hunch \n               her shoulders.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               A ratty interrogation room. Institutional green walls.\n\n               Beat-up file cabinets. Dark. A bit of fluorescent light spills \n               in through the frosted glass door. Lila, thirties, sits at \n               the end of a long table. A reel-to-reel tape recorder whirs \n               in front of her. She is smoking. Three fat, mean-looking \n               cops sit in shadows at the other end of the table. One of \n               the cops eyes her lasciviously. Lila's hand shakes as she \n               brings the cigarette to her mouth.\n\n                                     LILA\n                         I'm not sorry. So I spend the rest \n                         of my life in jail. So what? I've \n                         been in jail my whole life anyway. A \n                         jail of blood and tissue and coursing \n                         hormones...\n\n               One of the cops sighs and massages the bridge of his nose.\n\n               It's going to be a long night.\n\n                                     LILA\n                         ...a jail called the human body.\n\n               The lascivious cop smiles lasciviously at Lila's reference \n               to \"human body.\"\n\n                                     LILA\n                         My soul held prisoner in this reeking, \n                         stench-ridden bag of bones and \n                         entrails. A bag of feces and piss \n                         and fibroid cysts in my tits and \n                         precancerous moles on my sun-damaged \n                         back...\n\n               The lascivious cop gags, then vomits on the floor. Lila drags \n               on her cigarette, calmer now.\n\n                                     LILA\n                         At least now I'll be able to blame \n                         the state, not God, for my \n                         incarceration.\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff, thirties, dirty, scraggly hair and beard but in a crisp \n               business suit, testifies before a congressional committee. \n               The auditorium is filled with reporters and spectators. Puff \n               sits in front of a microphone, counsel at his side. He pours \n               himself a glass of water, drinks, clears his throat, then \n               speaks: stentorian, confident.\n\n                                     PUFF\n                         I am sorry, gentlemen, sorry for all \n                         of us. Your's is a complicated, sad \n                         world.\n\n               This is a revelation to the assembled crowd. People whisper \n               to each other.\n\n                                     PUFF\n                         And I never knew that. I was living \n                         a life of simplicity, of purity, \n                         when I was ripped out of my Eden and \n                         immersed in this harshness. Some \n                         would argue that the life I was living \n                         was not a human life at all. And, \n                         gentlemen, I don't have any clever \n                         retort. I am not a philosopher. The \n                         only thing I know is that I am sorry, \n                         sorry for my expulsion from Eden, \n                         sorry for my Lila rotting in her \n                         jail cell, and sorry for Nathan... \n                         rotting in his grave.\n\n                                                                    CUT TO:\n\n               INT. WHITE SPACE - DAY\n\n               Nathan, thirties, in a white robe, sits alone at a white \n               table. Everything is white except for an oozing bullet wound \n               in Nathan's temple.\n\n                                     NATHAN\n                         I don't even know what sorry means \n                         anymore. It's odd. When I was alive \n                         I knew -- maybe it was all I knew -- \n                         but here sorry is meaningless. Love \n                         is meaningless. Jealousy is \n                         meaningless. Ambition is meaningless. \n                         Everything that motivated my every \n                         breath while I was alive is \n                         meaningless now.\n                              (beat)\n                         I guess that's how I can be sure I'm \n                         really dead.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila watches the slowly churning tape recorder reels, fixated. \n               The cop who vomited is mopping it up. The other two are \n               sipping coffee. Lila talks.\n\n                                     LILA\n                         My story begins when I was twelve.\n\n                                     COP\n                              (checks watch)\n                         Jesus.\n\n                                                                    CUT TO:\n\n               EXT. SUBURBAN STREET - DAY\n\n               It's got that faded, \"memory\" look. Twelve year old Lila \n               hurries home from school, books clutched to her chest.\n\n               Other kids walk along the street in pairs or groups, laughing \n               and chatting. Lila walks alone, a worried scowl on her face.\n\n                                     LILA (V.O.)\n                         Something terrible happened when I \n                         was twelve.\n\n                                                                    CUT TO:\n\n               INT. LITTLE GIRL'S ROOM - DAY\n\n               Colors are still muted. It looks to be somewhere in the early \n               70's based on the preponderance of Bay City Rollers posters \n               on the wall. Twelve year old Lila enters the room, closes \n               the door, locks it, rattles the doorknob to make sure that \n               the door is really locked. She draws the shades. She pulls \n               some t-shirts from her dresser drawer and stuffs them into \n               the space between the bottom of the door and the floor.\n\n                                     KID BROTHER (O.S.)\n                              (muffled)\n                         Hey, no fair!\n\n                                     TWELVE YEAR OLD LILA\n                         Drop dead, Eric.\n\n               Lila stands nervously in front of the full-length mirror on \n               her closet door. She takes a deep breath and begins to \n               unbutton her shirt, watching herself carefully in the mirror.\n\n                                     ADULT LILA (V.O.)\n                         Something terrible started to happen \n                         to my body when I was twelve. My \n                         mother said because of it I would \n                         never be able to get a man, so I \n                         should get used to the idea of \n                         dedicating my life to the pursuit of \n                         knowledge, or religion... or whatever.\n\n               Lila's shirt is now unbuttoned. She pulls it open. She is \n               wearing a training bra over the very beginning of breast \n               buds. On the chest above the bra, and on her stomach below \n               it, is hair. Dark curly hair. She stares at it, touches it \n               cautiously. Then she starts to cry. She crouches into a ball \n               and weeps.\n\n                                     ADULT LILA (V.O.)\n                         The doctor said...\n\n                                                                    CUT TO:\n\n               INT. DOCTOR'S OFFICE - DAY\n\n               Old fashioned office. Twelve year old Lila sits on the \n               examination table, her shirt off. An elderly male doctor \n               touches the hair, fingers it. Her mother looks on.\n\n                                     DOCTOR\n                              (to the mother)\n                         It's hormonal. Nature is a funny and \n                         complex thing. It could get worse \n                         with time.\n\n               Young Lila turns to the camera.\n\n                                     TWELVE YEAR OLD LILA\n                         By the time I was twenty I looked \n                         like an ape.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               The cop who vomited, gags again. Lila stares at him. Her \n               face is hard, blank. She stubs out her cigarette.\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff testifies before the committee.\n\n                                     PUFF\n                         I don't think there's anyone in the \n                         world who doesn't know by now that I \n                         was raised in the wilderness by an \n                         ape. Well, to be fair, by a man who \n                         thought himself an ape, but it amounts \n                         to the same thing gentlemen, does it \n                         not?\n\n                                                               DISSOLVE TO:\n\n               EXT. FOREST CLEARING - DAY.\n\n               This has a faded, \"memory\" look also. A naked, bearded, dirty \n               middle-aged man and a naked, dirty ten year old Puff walk \n               along like apes, crouched over and dragging their knuckles.\n\n                                     PUFF (V.O.)\n                         My father escaped from a New Jersey \n                         mental institution in 1963.\n\n                                                                    CUT TO:\n\n               EXT. CITY STREET - NIGHT\n\n               It's raining and deserted. Puff's father, in pajamas, comes \n               tearing around the corner. He runs crazily towards the camera, \n               waving his arms, puffing out his cheeks.\n\n                                     PUFF (V.O.)\n                         He had been committed the previous \n                         year after applying one too many \n                         times at our local zoo for the job \n                         of \"apprentice ape.\"\n\n               Puff's father passes a newspaper vending machine, stops, \n               goes back and examines the headline. It reads: President \n               Kennedy Assassinated. Puff's father looks heavenward and \n               clutches at his temples in despair.\n\n                                     PUFF (V.O.)\n                         My father saw what the human race \n                         had come to while he was... in \n                         captivity. He felt something had to \n                         be done to create a better world.\n\n                                                                    CUT TO:\n\n               EXT. SUBURBAN HOUSE - NIGHT\n\n               Puff's father climbs out a second story window with a small \n               bundle in his arms. He runs off into the night.\n\n                                     PUFF (V.O.)\n                         He stole little me from my mother, \n                         his ex-wife, and raised me, with \n                         love and tenderness and respect, as \n                         an ape like himself.\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff looks pointedly at the congressman.\n\n                                     PUFF\n                         Apes don't assassinate their \n                         presidents, gentlemen.\n\n               The congressmen are shamed: they look down, they take notes, \n               they mumble instructions to the assistants seated behind \n               them.\n\n                                                                    CUT TO:\n\n               EXT. FOREST - DAY\n\n               An adult Puff and his now older father sit on the forest \n               floor and pick bugs off each other and eat them.\n\n                                     PUFF (V.O.)\n                         Until quite recently I believed myself \n                         to be an ape, although I didn't know \n                         specifically what type. Apes don't \n                         think in terms of type.\n\n                                                               DISSOLVE TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff testifies.\n\n                                     PUFF\n                         It might be argued, gentlemen, that \n                         apes don't even know that they are \n                         apes. In retrospect, however, I'd \n                         say that I was a pygmy chimp.\n\n               Puff holds up an illustration of a pygmy chimp. Several \n               reporters run from the room: a scoop!\n\n                                                                    CUT TO:\n\n               INT. WHITE SPACE - DAY\n\n               Nathan talks to nobody in particular.\n\n                                     NATHAN\n                         I have to say I always hated apes. \n                         Of course I don't any longer. I don't \n                         even know what hate means now. But \n                         while alive, I hated apes. I blame \n                         my parents. I mean, I don't blame \n                         them. I don't know what blame is, \n                         really, anymore, but I think they \n                         influenced me in my ape-hating \n                         tendencies.\n\n                                                               DISSOLVE TO:\n\n               EXT. ZOO - DAY\n\n               Faded colors. Ten year old Nathan in a bow tie and shortpanted \n               suit walks along with his uptight, British parents.\n\n               They arrive at the ape pen. Nathan is excited. He jumps up \n               and down. The apes jump up and down also.\n\n                                     NATHAN AS A BOY\n                         Monkeys! Look, mama, monkeys!\n\n                                     MOTHER\n                              (clamping down on his \n                              shoulder)\n                         Nathan, those are not monkeys. Those \n                         are apes. Mountain Gorillas to be \n                         precise.\n\n               There is a commotion off screen. Two uniformed attendants \n               drag Puff's father, straitjacketed and kicking and screaming \n               like an ape, past Nathan and his parents.\n\n                                     PUFF'S FATHER\n                         I am not a human being! I am an \n                         animal!\n\n               Nathan, his father, and the other zoo patrons look on \n               curiously, a little frightened. Nathan's mother chooses to \n               ignore it.\n\n                                     MOTHER\n                         And furthermore... Tell him, Harold.\n\n                                     FATHER\n                              (distracted)\n                         Uh...\n                              (then by rote)\n                         We must never act like apes, son. \n                         For you see, The ape is our closest \n                         biological relative -- specifically \n                         the pygmy chimp.\n                              (holds up the same \n                              illustration of a \n                              pygmy chimp that \n                              Puff showed the \n                              congressional \n                              committee)\n                         A single chromosome separates us. \n                         But you know what truly separates us \n                         from the apes, what makes us better \n                         than apes?\n\n                                     NATHAN AS A BOY\n                         No, papa. What?\n\n                                     FATHER\n                         Culture. Civilization. Refinement. \n                         If we do not have these as humans, \n                         then we might as well be living in \n                         pens and throwing our feces about, \n                         masturbating in public...\n                              (beat, a reverie)\n                         ...sniffing red swollen female rump...\n\n                                     MOTHER\n                         Enough, Harold.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila lights a new cigarette with her spent one. She drags.\n\n                                     LILA\n                         Oh, I had sexual urges. I had the \n                         urge to merge, officers. Inside I \n                         was 100% Grade A female.\n                              (laughs derisively)\n                         But what self-loathing I felt! Who \n                         would have someone as repulsive, as \n                         unladylike as me? I did everything I \n                         could to shield the world from this \n                         repulsiveness.\n\n                                                               DISSOLVE TO:\n\n               INT. COLLEGE DORM BATHROOM - DAY\n\n               Stockings hang over the shower curtain rod. The window shade \n               is drawn. Towels are stuffed in the space under the door. A \n               twenty year old naked Lila is covered with shaving cream, \n               face to feet. She is shaving. There is a pounding on the \n               door.\n\n                                     FEMALE ROOMMATE (O.S.)\n                         Lila, what are you doing in there? I \n                         need to get ready for my date.\n\n                                     LILA\n                         Nothing! I'll be out in a minute!\n\n               The door opens. Lila freezes.\n\n                                     FEMALE ROOMMATE\n                         Look, I'll just...\n                              (stops in her tracks \n                              when she sees Lila)\n                         What the...?\n\n               Lila is mortified.\n\n                                                               DISSOLVE TO:\n\n               INT. DORM ROOM - A BIT LATER\n\n               Lila is sitting in her bathrobe on her bed and staring out \n               the window. There is a bit of shaving cream behind her ear.\n\n               Her roommate runs back and forth getting ready for her date.\n\n                                     FEMALE ROOMMATE\n                         I don't know why you didn't tell me \n                         about this.\n\n                                     LILA\n                         It's embarrassing, okay?\n\n                                     FEMALE ROOMMATE\n                         It's not so bad.\n                              (beat)\n                         So, it just keeps growing?\n\n                                     LILA\n                         Yeah, Natalie. It's hair. It grows.\n\n                                     FEMALE ROOMMATE\n                         Well, don't jump down my throat. I'm \n                         just trying to help.\n\n                                     LILA\n                         How is that helping, Natalie? How \n                         exactly?\n\n                                     FEMALE ROOMMATE\n                         Look, if you're going to be like \n                         that... You should be appreciative \n                         that I'm interested.\n\n                                     LILA\n                         Why, because I'm a freak and you are \n                         beautiful, and you are being nice \n                         enough to come down to my freak, \n                         nonbeautiful level and act concerned \n                         about my repulsive troubles?\n\n                                     FEMALE ROOMMATE\n                              (pegged)\n                         You're fucked up, Lila.\n                              (out the door)\n                         Why don't you fucking try electrolysis \n                         or something? Figure it out for \n                         chrissake.\n\n               The door slams. Lila hugs her knees to her chest.\n\n                                     LILA (V.O.)\n                         At sixty dollars an hour, electrolysis \n                         was not a feasible solution. I \n                         explored my alternatives.\n\n                                                                    CUT TO:\n\n               INT. ART MUSEUM - DAY\n\n               Twelve year old Lila walks sadly through an art museum. she \n               looks at various old portraits of men. She studies their \n               facial hair. When she turns a corner, she is shocked to see \n               a large Renaissance painting of a naked woman entirely covered \n               with fur. She hurries to it. She looks at the placard next \n               to the painting. It is a painting of Mary Magdalene.\n\n                                     LILA (V.O.)\n                         I remember once coming across a \n                         painting of Mary Magdalene entirely \n                         covered with fur. I guess that's \n                         where I got the idea that maybe the \n                         Catholic Church might be a place \n                         that encouraged excessive hair growth \n                         in its women.\n\n               INT. CONVENT - DAY\n\n               Lila, in a nun's habit, is on her knees praying.\n\n                                     LILA (V.O.)\n                         So I became a nun.\n\n                                     LILA\n                         Heavenly Father...\n                              (sighs)\n                         ...please let this hair go away.\n\n                                     LILA (V.O.)\n                         But my prayers were always so selfish.\n\n                                                                    CUT TO:\n\n               EXT. FIELD - NIGHT\n\n               A bunch of naked women dance and chat around a campfire.\n\n               Lila is there, pretty hairy. So are many of the other women.\n\n                                     LILA (V.O.)\n                         I tried being a lesbian separatist.\n\n                                     LESBIANS\n                              (chanting)\n                         A woman without a man / Is like a \n                         fish without a bicycle.\n\n                                     LILA (V.O.)\n                         But I guess I just wasn't attracted \n                         to women, even hostile, man-hating, \n                         hairy ones who wore sensible shoes.\n\n                                                                    CUT TO:\n\n               INT. TENT - DAY\n\n               Lila, in a full beard, sits on a throne before a crowd of \n               gawking, dumb-looking, mouth-breathing children. Next to her \n               on a separate stage is a sour-looking, middle-aged midget \n               man sitting on a throne, staring blankly into space.\n\n                                     LILA (V.O.)\n                         For a while I was a professional \n                         circus freak.\n\n                                                               DISSOLVE TO:\n\n               INT. TENT - DAY\n\n               Lila, in a Santa suit, with beard sprayed white, sits on a \n               throne in front of a crowd of gawking, dumb-looking, mouth-\n               breathing children. One of them is on her lap. Next to her \n               sits the sour midget, dressed in an elf suit.\n\n                                     LILA (V.O.)\n                         During the holiday season, they made \n                         us wear costumes.\n\n                                     LILA\n                              (depressed)\n                         Ho ho ho.\n\n                                     KID ON HER LAP\n                         That's not real.\n\n               The kid pulls Lila's beard.\n\n                                     LILA\n                         Ow! You little fuck.\n\n                                     LILA (V.O.)\n                         Aside from the great dental, this \n                         occupation was not pleasant.\n\n                                                                    CUT TO:\n\n               EXT. CITY STREET - NIGHT\n\n               Lila walks home. She's wrapped in winter clothing, but we \n               can still see a bit of her white beard. It's snowing. The \n               street is deserted. She spots a lighted window, she peers \n               in. It's a warm family scene. Large group of chatting, \n               laughing people. Fire in the fireplace. Big turkey on the \n               table.\n\n                                     LILA (V.O.)\n                         They say the holidays are difficult \n                         for a lot of people.\n\n               Lila looks down the street and sees dozens of lonely-looking \n               people peering forlornly in warmly lit windows. Some on \n               ladders to peer in second-floor windows. Lila sighs.\n\n                                                                    CUT TO:\n\n               INT. BATHROOM - NIGHT\n\n               The room is lit with candles. Lila finishes shaving herself \n               all over. Then she takes the double-edged blade out of the \n               razor and climbs into the a bathtub filled with warm water.\n\n               She is about to slice her wrists.\n\n                                     LILA (V.O.)\n                         I decided there was something poetic \n                         about killing myself with a razor \n                         blade.\n\n               On the shelf next to the tub a little gray mouse watches her \n               intently. At first she is startled, but then she and the \n               creature seem to be communing. His little black beady eyes \n               reflect the light. Lila starts to cry. She puts down the \n               blade.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila wipes a tear from her eye.\n\n                                     LILA\n                         The way that mouse looked at me. \n                         There was no judgement. It didn't \n                         care if I had hair all over my body. \n                         I was just what I was. I felt so \n                         free. Do you understand what I'm \n                         saying?\n\n               The cops look up, on the spot. It seems their minds were \n               elsewhere.\n\n                                     COP\n                         Something about a mouse, right?\n\n               Lila sighs.\n\n                                                               DISSOLVE TO:\n\n               EXT. FOREST - EARLY MORNING\n\n               We see a tent in a clearing. A smoking campfire. There is a \n               rustling inside the tent. Lila steps out naked. She is covered \n               with fur. She pours a cup of coffee, and stands, comfortable \n               in her skin, watching the world around her.\n\n               Squirrels jump from tree to tree, birds look down at her.\n\n               She smiles.\n\n                                     LILA (V.O.)\n                         Birds and squirrels and rocks and \n                         trees didn't seem to judge my hair. \n                         I felt at peace when there were no \n                         humans around. I figured out a way \n                         to spend as much time as possible \n                         with no people around. I became a \n                         nature writer.\n\n               Lila picks up a pad and pen from a rock, sits on the rock \n               and writes.\n\n                                                                    CUT TO:\n\n               INT. BEAUTY PARLOR - DAY\n\n               A woman under a hair drier reads a book intently. We see the \n               first sentence of the chapter: \"Last night I almost died on \n               this mountain top.\" We hear Lila's dramatic reading competing \n               with the very loud sound of the hair drier.\n\n                                     LILA\n                         Last night I almost died on this \n                         mountain top, and the irony is I had \n                         never felt more alive.\n\n                                                               DISSOLVE TO:\n\n               EXT. FOREST - NIGHT\n\n               There is a violent, violent storm. The hair drier drone has \n               turned into the explosive noise of rain beating down in sheets \n               and wind howling at fifty miles an hour. Branches crack. \n               Lila's tent blows over, revealing her huddled there with a \n               sleeping bag wrapped around her like a blanket.\n\n                                     LILA\n                         I knew it was coming when in late \n                         afternoon, a thunderhead drifted \n                         over, sneaking in like kids through \n                         the back door of a movie theater, \n                         forced casual. It turned the sky a \n                         queer shade of green. A green that \n                         said \"watch out, baby, this is gonna \n                         hurt like hell.\" I could've \n                         hightailed, but that would be \n                         cheating. Part of the Nature \n                         experience is recognizing its mastery \n                         over you, your smallness in the face \n                         of it.\n\n               Lightning hits a tree nearby. It falls with a smack \n               practically on top of Lila. She screams, then defiantly \n               stands, throwing off the sleeping bag. The wind and rain \n               whip her hair around her head. She laughs with amazing gusto \n               and raise her arms like a runner winning a marathon.\n\n                                     LILA\n                         As Nietzsche said, what does not \n                         kill me makes me stronger, and that \n                         goes double if you're a woman.\n\n                                                                    CUT TO:\n\n               EXT. BOOK STORE WINDOW - DAY\n\n               We see many copies of a book entitled \"Wind in my Hair\" by \n               Lila Jute.\n\n                                     LILA (V.O.)\n                         I became a successful nature writer.\n\n                                                                    CUT TO:\n\n               INT. BEAUTY PARLOR - DAY\n\n               We see a woman under a hair drier reading \"Wind in my Hair\".\n\n               We pull back to see that a long row of women under hair driers \n               are reading Lila's book. They all stand defiantly, proudly, \n               knocking their hair driers up and back as they do.\n\n               The blowing hair driers whip the women's wet hair around \n               their heads. The blowing hair drier drone is unbearably loud.\n\n                                     LILA\n                         Then I became a famous nature writer. \n                         I said to myself, fuck humanity...\n\n                                                                    CUT TO:\n\n               EXT. BOOKSTORE WINDOW - DAY\n\n               A big display of the book \"Fuck Humanity\" by Lila Jute. A \n               long line of women with beautifully coiffured hair snakes \n               out of the store.\n\n                                     LILA\n                         ...and I became a recluse. I had a \n                         menagerie of animals at my house. \n                         They loved me because I was me. They \n                         loved me on the days I shaved. They \n                         loved me on the days I didn't. For a \n                         while this was enough.\n\n                                                               DISSOLVE TO:\n\n               INT. LOG HOUSE - DAY\n\n               Lila lies in bed tapping on a lap top. A dog lies with her \n               and licks her knee. She seems to enjoy it, and gets lost in \n               a reverie. The dog morphs into a handsome man, kissing her \n               knee and working his way up her thigh and under her nightgown. \n               Lila is getting seriously hot and bothered. Her head lolls. \n               But the reverie dissipates and the man turns back into a dog \n               rooting around her crotch with his cold nose. She pushes him \n               away. The dejected dog gets off the bed.\n\n                                     LILA (V.O.)\n                         By the time I was thirty I was very, \n                         very horny.\n\n               Lila gets out of bed and studies herself in the mirror. She \n               brushes her hands against her hairy body.\n\n                                     LILA\n                         I had to have a man in my... life. \n                         At any cost. I would become what I \n                         needed to become to achieve this. I \n                         would become a hairless lie.\n\n               The mirror image of Lila shimmers and turns into Lila with \n               no body hair. Lila all made-up and with a smart new hairstyle. \n               She assumes a coquettish pose and smiles cutely at herself.\n\n                                     LILA\n                         I was rich enough for electrolysis \n                         by this time, so I began the long \n                         arduous process of having each \n                         inappropriate hair burned out of my \n                         body at the root.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila talks. One of the cops is doodling. One is picking wax \n               from his ear with a pencil. One is reading a paperback novel \n               under the table.\n\n                                     LILA\n                         This is when everything changed, and \n                         this is where my confession really \n                         begins.\n\n               The cops look up.\n\n                                                                    CUT TO:\n\n               INT. ELECTROLOGIST'S OFFICE - DAY\n\n               Lila lies shirtless on a table while Rose, her fifty year \n               old electrologist, works on her back.\n\n                                     ROSE\n                         Progress!\n\n                                     LILA\n                         Ouch. Yeah?\n\n                                     ROSE\n                         Oh yes, honey. Getting to be smooth \n                         smooth smooth all over. Smooth as a \n                         baby's butt.\n\n                                     LILA\n                         I love it, Rose. I'm getting to be a \n                         real girl.\n\n                                     ROSE\n                         You still in the market for a real \n                         boy?\n\n                                     LILA\n                         Always. Ow.\n\n                                     ROSE\n                              (beat)\n                         Cause there's this guy. My brother \n                         knows him. Might be right up your \n                         alley.\n\n                                     LILA\n                         Tell me. I could use someone up my \n                         alley.\n\n                                     ROSE\n                              (playing dumb)\n                         I don't get that. Is that sexual?\n\n                                     LILA\n                         Shut up and tell me.\n\n                                     ROSE\n                         Handsome, thirties, psychologist...\n\n                                     LILA\n                         Loves animals? Ouch. Must love \n                         animals, Rose.\n\n                                     ROSE\n                         Loves animals. Loves you.\n\n                                     LILA\n                         What do you mean?\n\n                                     ROSE\n                         Somehow it came up that you were a \n                         friend of mine. Mr. handsome, animal-\n                         loving psychologist said he would \n                         love to meet you.\n\n                                     LILA\n                         Holy shit. Your brother didn't tell \n                         him about the nature of our \n                         relationship, did he?\n\n                                     ROSE\n                         My brother is discreet.\n\n                                     LILA\n                              (rubbing her hand \n                              over her jaw)\n                         Won't he be able to tell?\n\n                                     ROSE\n                         My brother says the guy's a thirty-\n                         five year old virgin, so maybe he \n                         won't know how women usually feel. \n                         Plus he's got bad eyesight, almost \n                         legally blind, which is helpful in \n                         this situation. Plus he's got an \n                         extremely small penis, of which he \n                         is \"mortifyingly ashamed\", so chances \n                         are he'll be so grateful for any non-\n                         judgmental attention, that he'll be \n                         yours forever.\n\n                                     LILA\n                         God, he must be really close to your \n                         brother to tell him such personal \n                         stuff.\n\n                                     ROSE\n                         Yeah, well my brother is his shrink.\n\n                                                                    CUT TO:\n\n               INT. RESTAURANT - NIGHT\n\n               It's a chi-chi place. Lila sits at a table with Nathan, \n               fastidious in dress and manner. There is an awkward firstdate \n               silence. She sneaks a glance at his crotch. Then:\n\n                                     NATHAN\n                         Meditations on a Banana Slug was a \n                         delightful read.\n\n                                     LILA\n                         Thank you so much. I love slugs. All \n                         slugs, not just banana slugs.\n\n                                     NATHAN\n                         As do I.\n\n                                     LILA\n                         They're so even keel. They forge \n                         ahead with slow determination. They \n                         don't get distracted or side-tracked. \n                         They don't care what they look like.\n                         They don't care that people look at \n                         them and go, \"Ewww. A slug.\"\n\n                                     NATHAN\n                         They don't seem to be especially ego \n                         driven, this is true.\n\n                                     LILA\n                         You've got to respect that.\n\n                                     NATHAN\n                         I have to say that I'm not there \n                         yet.\n\n                                     LILA\n                         Where?\n\n                                     NATHAN\n                         Slugdom. Sluggishness. Whatever you'd \n                         call it. I'm not there yet. I still \n                         have many human characteristics.\n\n                                     LILA\n                         That's not necessarily a bad thing.\n\n                                     NATHAN\n                         Yes. I suppose not. But still. One \n                         would like to move along. To move \n                         beyond.\n\n                                     LILA\n                         I'm not sure we can escape our \n                         natures. Believe me I've tried. I'm \n                         not even so sure anymore that we \n                         should want to.\n\n                                     NATHAN\n                         I love that you said that. It makes \n                         me feel a bit lighter. I've been \n                         rather heavy lately. Thinking about \n                         my childhood. Realizing how much a \n                         product I am of my upbringing.\n                              (beat, cautiously)\n                         I've been seeing someone. A therapist.\n\n                                     LILA\n                              (feigning surprise)\n                         You are a therapist, right?\n\n                                     NATHAN\n                         No no. I'm a psychologist, but I do \n                         research. I'm a behaviorist. I work \n                         with animals. Mice at the moment.\n\n                                     LILA\n                         I hope you don't perform any of those \n                         dreadful torture experiments, Nathan.\n\n                                     NATHAN\n                         Heavens no. My work now is... Right \n                         now I'm teaching mice... well, table \n                         manners, to be candid.\n\n                                     LILA\n                              (beat. doesn't know \n                              what to say)\n                         How's it going?\n\n                                     NATHAN\n                         Quite well, really. It's a lot of \n                         work. A lot of reinforcement, mostly \n                         positive. Right now I've gotten two \n                         of my subjects to use napkins. Tiny \n                         napkins of course.\n\n                                     LILA\n                         Paper or cloth?\n\n                                     NATHAN\n                         I hope you don't think me daft. It's \n                         important work. It's part of a larger \n                         sociological experiment. I'm federally \n                         funded.\n\n                                     LILA\n                         What's the larger experiment?\n\n                                     NATHAN\n                         It's my thesis that if table manners \n                         can be taught to mice, they can be \n                         taught to humans.\n\n                                     LILA\n                         Going out on a limb, aren't you, \n                         Nathan?\n\n                                     NATHAN\n                              (speech)\n                         The truth is most people don't have \n                         table manners today. And when the \n                         foundations of civilized society \n                         crumble and disappear, civilized \n                         society in its entirely follows \n                         closely at its heels.\n\n                                     LILA\n                         I'm not sure.\n\n                                     NATHAN\n                              (stridently)\n                         Courtesy, decorum, manners, are all \n                         sadly lacking from our daily \n                         intercourse. Rudeness, vulgarity, \n                         meanness are the norm.\n\n                                     LILA\n                         We are animals after all.\n\n                                     NATHAN\n                         Ergo if I can teach table manners to \n                         mice, I can teach them to humans. If \n                         I can teach table manners to humans, \n                         I can save the world.\n\n               Nathan blushes. Lila stares at him for a long moment. Her \n               thoughts are unreadable.\n\n                                                                    CUT TO:\n\n               INT. ELECTROLOGIST'S OFFICE - DAY\n\n               Lila lies on her back. Rose works on her breasts.\n\n                                     ROSE\n                         So?\n\n                                     LILA\n                         I really like him, Rose. He's so...\n                              (searching)\n                         ...passionate about his work.\n\n                                     ROSE\n                         My brother says he likes you, too.\n\n                                     LILA\n                              (pleased)\n                         Really?\n\n                                     ROSE\n                         Yeah. Says he likes you even more \n                         than he likes his own mother. And \n                         according to my brother Nathan's \n                         abormally close with his mother.\n\n                                                                    CUT TO:\n\n               INT. WHITE SPACE - DAY\n\n               Nathan talks.\n\n                                     NATHAN\n                         I began going to a therapist when I \n                         was in my thirties, because I felt \n                         that I wasn't enjoying life the way \n                         my friends were.\n                              (beat)\n                         After a time my childhood came up.\n\n                                                               DISSOLVE TO:\n\n               INT. DINING ROOM - DAY\n\n               It is another sepia scene. Nathan as a ten year old sits at \n               the table with his parents. There is a bowl of salad in front \n               of each of them. Everyone's head is bowed in prayer.\n\n                                     FATHER\n                         Lord, we thank you for this bountiful \n                         gift we are about to receive.\n\n                                     ALL\n                         Amen.\n\n               Eyes open, and young Nathan reaches for a fork to eat the \n               salad. He grabs the wrong fork. Mother's eyes widen in horror.\n\n                                     MOTHER\n                         My God, no! My God!\n                              (disappointed)\n                         Oh, Nathan.\n\n               Nathan looks up.\n\n                                     MOTHER\n                         That is the wrong fork, young man.\n                              (to father)\n                         Harold, tell the boy.\n\n                                     FATHER\n                         That is the wrong fork, young man.\n\n                                     NATHAN AS A BOY\n                              (panicky)\n                         I'll use the right one. I'm sorry. I \n                         forgot.\n\n                                     MOTHER\n                         Harold, tell the boy more.\n\n                                     FATHER\n                         Too late. Go to your room.\n\n                                     NATHAN AS A BOY\n                         But...\n\n                                     MOTHER\n                         Harold! Tell the boy again.\n\n                                     FATHER\n                              (looking at mother)\n                         No \"buts.\" Go to your room now.\n\n                                     MOTHER\n                              (looking at father)\n                         And?\n\n                                     FATHER\n                         And think about what you've done.\n\n                                                               DISSOLVE TO:\n\n               INT. THERAPIST'S OFFICE - DAY\n\n               Adult Nathan sits on the couch, dabbing at his eyes.\n\n               Wendall, his therapist sits across from him and writes \n               something in his notebook.\n\n                                     WENDALL\n                         And do you think maybe this early \n                         childhood indoctrination has something \n                         to do with your interest in table \n                         manners in the present.\n\n               Nathan thinks long and hard about this. He seems to be really \n               straining, squinting his eyes. Finally:\n\n                                     NATHAN\n                         I don't think so. No.\n\n               Wendall nods and scribbles something on his pad.\n\n                                     NATHAN\n                         Why do you ask?\n\n               Wendall looks up.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Everything's white. People in lab coats hustle back and forth. \n               Nathan, also in a lab coat, is hovering over a Lucite \n               encasement. Inside we see two white mice, both attached to \n               electrodes. They sit in little chairs at a little table. In \n               front of each of them is a little plate of salad and three \n               forks of varying size under Lucite domes.\n\n               Nathan nods to his pretty French assistant, Gabrielle, who \n               presses a button. The Lucite domes over the salads lift.\n\n               Tentatively both mice reach for a fork. There is a tiny piece \n               of velcro on each mouse's paw and a tiny piece of velcro on \n               each of the forks. The first mouse picks the correct fork, \n               and stabs it into the salad and eats happily, relieved. The \n               second mouse picks the wrong fork. Nathan presses a button, \n               which sends the mouse flying off his chair with an electric \n               shock. The correct mouse keeps eating, unconcerned. Nathan \n               makes a note in his notebook.\n\n               Gabrielle watches Nathan as he writes, enchanted.\n\n                                                                    CUT TO:\n\n               INT. NATHAN'S APARTMENT - NIGHT\n\n               The table is elegantly set, candlelit. Lila sits at it while \n               Nathan fusses in the kitchenette. Something classical wafts \n               over from the stereo in the living room. Nathan places a \n               salad in front of Lila and sits across from her with his own \n               salad.\n\n                                     LILA\n                         It looks wonderful.\n\n                                     NATHAN\n                         You look wonderful. I'm on top of \n                         the world tonight, Lila. Work is \n                         going splendidly and my personal \n                         life is ...\n\n               Lila picks up a fork from the inside of her setting, not the \n               outside. Nathan blinks. Lila tastes the salad.\n\n                                     LILA\n                         Um-mmm. Oh Nathan, this salad is \n                         delish...\n\n                                     NATHAN\n                              (clenched teeth)\n                         My God! The fork! The fork!\n\n                                     LILA\n                         I'm sorry?\n\n                                     NATHAN\n                              (strangely)\n                         Tell her, Harold...\n                              (stops himself)\n                         It's just that... It's nothing. It's \n                         just that the outside fork is the \n                         salad fork. One goes from the outside \n                         in as the dinner progresses.\n\n                                     LILA\n                         Oh, I'm sorry.\n                              (picks up correct \n                              fork)\n                         I'm sorry, Nathan. I never really \n                         learned those things.\n\n                                     NATHAN\n                              (forced casual)\n                         No biggie.\n\n               There is a long silence as they both eat the salad.\n\n                                     LILA\n                         Boy, this is good!\n\n                                     NATHAN\n                         I'm sorry that I became so upset.\n\n                                     LILA\n                         No, I'm sorry. I'm really backward \n                         in certain areas.\n\n                                     NATHAN\n                              (beat, blurting)\n                         It's only that I really enjoy your \n                         company and...\n\n                                     LILA\n                         You do?\n\n                                     NATHAN\n                         Yes, and...\n\n                                     LILA\n                         You really enjoy my company?\n\n                                     NATHAN\n                         Yes.\n                              (beat, blurting)\n                         Please don't talk with food in your \n                         mouth, Lila. Please. You're so pretty \n                         and it only mars your... I'm sorry. \n                         I'm being critical.\n\n               Nathan pounds his forehead with his fist. Lila waves her \n               hand to indicate that it's fine. She doesn't say anything \n               because she's chewing.\n\n                                     NATHAN\n                         It's just that I have some \n                         peculiarities, and...\n\n                                     LILA\n                         I like you, too, Nathan.\n\n                                     NATHAN\n                         You do?\n\n                                     LILA\n                         Yeah\n                              (beat)\n                         But I have some peculiarities also.\n\n                                     NATHAN\n                              (happily)\n                         I don't care. I don't care!\n                              (then, concerned)\n                         Like what, for example?\n\n               Lila takes a deep breath, about to go into it, thinks better \n               of it.\n\n                                     LILA\n                         Like nothing.\n\n               Nathan smiles, relieved. Lila smiles back. Nathan recoils \n               slightly, skittishly half-points to his bared teeth.\n\n               Apparently there's a piece of food stuck in Lila's teeth.\n\n               She closes her mouth, runs her tongue over her teeth, smiles \n               again, mouth closed.\n\n                                                                    CUT TO:\n\n               INT. ELECTROLOGIST'S OFFICE -DAY\n\n               Rose is doing Lila's feet.\n\n                                     ROSE\n                         My brother says things are going \n                         really well between you and Nathan.\n\n                                     LILA\n                         I cannot believe how in love I am \n                         with this man.\n\n                                     ROSE\n                         Yeah?\n\n                                     LILA\n                         He's so cute. I even like his cute \n                         little penis. It's like a little \n                         pig's penis or something.\n                              (beat)\n                         Rose, we connect on every level. \n                         I've finally found someone I can \n                         feel completely safe with.\n\n                                     ROSE\n                         Don't throw that away. I had that \n                         once with a guy. But I threw it away \n                         for a cheap thrill.\n\n                                     LILA\n                         One night stand?\n\n                                     ROSE\n                         No. I married a midget.\n\n                                     LILA\n                         Marrying a midget was a cheap thrill?\n\n                                     ROSE\n                         Well he wasn't really a midget. He \n                         was on the cusp of midgethood. That's \n                         what made it cheap. Had he been an \n                         actual midget, there would've been \n                         nothing cheap about it, my dear.\n\n                                     LILA\n                         I didn't know you were into that \n                         sort of thing.\n\n                                     ROSE\n                         Let me tell you, honey, midgets are \n                         the best kept secret in male \n                         companionship. They're portable. \n                         They're controllable. They're eager. \n                         And they're exactly the right height \n                         for a little covert oral fun on the \n                         dance floor.\n\n                                     LILA\n                              (screams with delight, \n                              then:)\n                         I have a friend you might like to \n                         meet.\n\n                                     ROSE\n                         Oh?\n\n                                     LILA\n                         Three foot one.\n\n                                     ROSE\n                         Be still my crotch.\n\n                                     LILA\n                         Rose, Nathan's no midget, but he's \n                         asked me to move in with him.\n\n                                     ROSE\n                         Yeah. My brother told me.\n\n                                     LILA\n                         And I think I'm going to.\n\n                                     ROSE\n                              (mulling it over)\n                         Stand on a stepladder sometimes.\n\n                                                                    CUT TO:\n\n               INT. WHITE SPACE - DAY\n\n               Nathan talks.\n\n                                     NATHAN\n                         Lila moved in with me. Did I love \n                         her? I thought so. But from my new \n                         vantage point I realize that love is \n                         nothing more than a messy \n                         conglomeration of need, desperation, \n                         fear of death, insecurity about penis \n                         size, and the self-involved, ego \n                         driven need to collect other people's \n                         hearts. Not that I judge it.\n                              (puts head in hands. \n                              beat. looks up)\n                         Listen, I don't want to be dead yet. \n                         Is there any way to...\n\n               Nathan looks around for some sign of another person. There \n               is nobody.\n\n                                     NATHAN\n                         No I suppose not.\n                              (beat)\n                         No biggie. Anyway, Lila moved in. We \n                         had our problems, but we both wanted \n                         love so badly, we turned a blind \n                         eye.\n\n               INT. NATHAN'S APARTMENT - NIGHT\n\n               Nathan, Lila, and Nathan's parents (looking very, very old) \n               sit at the dining room table. Salad is about to be eaten, \n               and everyone glances sideways over at Lila, waiting for her \n               to make her move. She reaches for the wrong fork, corrects \n               herself and picks the salad fork. Nathan breathes a sigh of \n               relief. His mother looks disappointed, clucks. They eat in \n               silence. Finally:\n\n                                     LILA\n                         It's lovely to finally meet you, Mr. \n                         and Mrs. Bronfman. I've heard so \n                         much about you and I've seen you in \n                         photographs from Nathan's childhood, \n                         but it's nice to meet you in the \n                         flesh. I must say, you look exactly \n                         the same as in the photographs.\n\n                                     MOTHER\n                         Thank you, dear.\n\n                                     NATHAN\n                         Actually, Mother and Father, you \n                         look very, very old. You look \n                         terrible.\n\n                                     LILA\n                         Nathan!\n\n               His mother and father touch their faces reflexively, then \n               look at each other and laugh.\n\n                                     MOTHER\n                         Tell him, Harold.\n\n                                     FATHER\n                         Son, your mother and I are doing a \n                         production of The Gin Game at the \n                         local community theater. We forgot \n                         to take off our make-up.\n\n               The mother and father laugh again. Then they pull at their \n               latex faces. The wrinkles come off. And they look exactly as \n               they did in the flashback scene, albeit a bit pink-faced.\n\n               There is another pause.\n\n                                     LILA\n                              (awkward)\n                         Goodness, you two look exactly as \n                         you did in those old photos.\n\n                                     MOTHER\n                              (cold)\n                         Yes, so you mentioned earlier, dear.\n\n                                     NATHAN\n                              (changing the subject)\n                         Lila's a nature writer, mother.\n\n                                     MOTHER\n                         I love nature. As long as it stays \n                         in the zoo where it belongs.\n\n               The father and Nathan laugh at mother's joke. Lila joins in \n               weakly, against her better judgment.\n\n                                     MOTHER\n                              (to Lila)\n                         Don't you agree, dear?\n\n               Lila hesitates.\n\n                                     NATHAN\n                         Of course she does, mother.\n\n                                                                    CUT TO:\n\n               INT. NATHAN AND LILA'S BEDROOM - LATER\n\n               Nathan is in bed, in starched pajamas. He lies on his back \n               under perfect covers and stares straight up at the ceiling.\n\n                                     NATHAN\n                         What are you doing in there?\n\n                                     LILA (O.S.)\n                              (pissy)\n                         I'll be out in a minute.\n\n                                     NATHAN\n                         I'm sorry about my parents.\n\n                                     LILA (O.S.)\n                         You didn't seem sorry when you were \n                         laughing at all your mother's stupid, \n                         tasteless, cruel animal jokes.\n\n                                     NATHAN\n                         I was simply attempting to keep the \n                         evening light. You know that I feel \n                         similarly to you about nature.\n\n                                     LILA (O.S.)\n                         Do you?\n\n                                     NATHAN\n                         Of course.\n                              (beat)\n                         I simply love the... naturalness of \n                         it all.\n\n               Lila emerges from the bathroom, radiant, hopeful.\n\n                                     LILA\n                         Do you? Oh do you, darling?\n\n                                     NATHAN\n                         Why certainly!\n\n               Lila happily leaps into bed. She smothers Nathan with kisses.\n\n                                     LILA\n                         Oh, darling. I'm so relieved. Let's \n                         celebrate with a long hike in the \n                         woods tomorrow!\n\n                                     NATHAN\n                              (oh shit)\n                         That's a great idea.\n\n               Nathan kisses her.\n\n                                     LILA\n                         It'll be wonderful! I'll show you my \n                         old stomping grounds!\n\n                                     NATHAN\n                         Terrific. Can't wait!\n\n               Nathan kisses her ear. He looks confused, sticks his finger \n               behind her ear, and pulls it out with a dab of shaving cream \n               on it.\n\n                                     NATHAN\n                         Shaving cream?\n\n                                     LILA\n                         I don't think so.\n                              (beat)\n                         Why?\n\n                                                                    CUT TO:\n\n               INT. CAR - MORNING\n\n               Nathan drives. He's dressed in spanking new, freshly starched \n               safari clothes, big shiny new hiking boots. Lila sits in the \n               front passenger seat. She is dressed in a costume identical \n               to Nathan's, but, as opposed to Nathan, she seems awkward in \n               it. She fidgets in it, straightens it, sighs, comes to terms \n               with it, and looks dreamily out the window at the passing \n               trees. She is home. That's all that matters.\n\n                                     NATHAN\n                         Darling, did you bring the insect \n                         repellent lotion?\n\n                                     LILA\n                         Yes, darling.\n\n                                     NATHAN\n                              (beat)\n                         Oh, and the sun block?\n\n                                     LILA\n                         Of course.\n\n                                     NATHAN\n                         What SPF, sweetie?\n\n                                     LILA\n                         Fifteen.\n\n                                     NATHAN\n                         Perfectomundo! We are ready!\n                              (beat)\n                         Say, wouldn't it be wonderful to \n                         have an insect repellent lotion that \n                         also worked as a sun block? Think of \n                         all the time one would save.\n\n                                     LILA\n                         Yes, darling.\n\n                                     NATHAN\n                         I think I'll get Johannsen in \n                         chemistry on that.\n                              (beat)\n                         Oh! Did you bring the first aid kit?\n\n                                     LILA\n                         Yes.\n\n                                     NATHAN\n                         Flares?\n\n                                     LILA\n                         Absolutely.\n\n                                     NATHAN\n                         We could call it \"Quit Bugging Me, \n                         Sunny.\"\n                              (laughs a lot)\n                         Get it? Sunny. S-u-n-n-y.\n\n                                     LILA\n                              (laughs appreciatively)\n                         That's very funny.\n\n                                     NATHAN\n                         I love you so much.\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff testifies.\n\n                                     PUFF\n                         Then, gentlemen, one day I saw \n                         something I hadn't seen since my \n                         father died in a freak accident \n                         involving a rotted log and four \n                         thousand bees stinging his head... I \n                         saw other human beings. They chattered \n                         away at each other in what appeared \n                         to be gibberish. Later I learned it \n                         was English. Now I wonder if perhaps \n                         my initial assessment hadn't been \n                         correct.\n\n                                                               DISSOLVE TO:\n\n               EXT. FOREST - DAY\n\n               Puff's POV: Through some brush we watch Nathan and Lila \n               hiking. We hear Puff's loud heavy breathing and, in the \n               distance, the relentless gibberish chatter of Nathan and \n               Lila. Puff moves. Lila glances over.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila talks.\n\n                                     LILA\n                         It was a flash of white. I ruled out \n                         deer immediately. Too... upright.\n\n                                                                    CUT TO:\n\n               INT. FOREST - DAY\n\n               We're with Lila and Nathan now. Lila has stopped and is \n               peering into the distance.\n\n                                     LILA\n                         Did you see that?\n\n                                     NATHAN\n                         What?\n\n                                     LILA\n                         I don't know. Something.\n\n                                     NATHAN\n                         A deer?\n\n                                     LILA\n                         No. Too... upright. Might've been a \n                         person.\n\n                                     NATHAN\n                              (nervously)\n                         It might behoove us to turn back at \n                         this point.\n\n               Lila walks in the direction of the sighting.\n\n                                     LILA\n                         Come on.\n\n                                     NATHAN\n                              (not budging)\n                         If it's a person, why should we go \n                         see it? It's not like it's nature or \n                         anything. It's just a person.\n                              (beat)\n                         Sometimes people who live in the \n                         woods don't want to be seen. They \n                         live in the woods because they're \n                         anti-social, Lila. We have to respect \n                         that.\n\n               Lila trudges through the brush. Nathan follows. Better than \n               being left behind.\n\n                                     NATHAN\n                         This is the way to get ticks, Lila. \n                         This is it. Bingo! Lyme Disease! \n                         You've hit the nail on the head here.\n\n               Lila is in her element. Her whole demeanor has changed.\n\n               She is tracking. She sniffs the breeze, cocks her head, moves \n               stealthily. Then she sheds her clothes, almost shaking them \n               off, like a dog shaking off some cute costume his owner had \n               dressed him in.\n\n                                     NATHAN\n                         Oh for God's sa...\n\n               Lila turns her head and glares at Nathan. There is an animal \n               fierceness in her eye that shuts him up instantly.\n\n               She turns back to pursue her prey.\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff testifies.\n\n                                     PUFF\n                         I had never seen anything like it.\n\n                                                               DISSOLVE TO:\n\n               EXT. FOREST - DAY\n\n               Puff's POV: We see a naked Lila looking in our general \n               direction, but not seeing us. The sun dapples her body.\n\n               She moves closer and closer.\n\n                                     PUFF (V.O.)\n                         It was an ape as I had never seen \n                         before. Like me, yet different in \n                         certain essential details. And all \n                         at once I felt a heat pass through \n                         me. My heart raced. Gentlemen, I \n                         wanted to touch her, to caress her, \n                         to be one with her. I had urges and \n                         desires I could not explain. I felt \n                         overwhelmed by the power this strange \n                         creature had over me, and so I did \n                         what any animal would do when it \n                         comes across an animal of superior \n                         strength...\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               The cops are transfixed.\n\n                                     LILA\n                         He bolted.\n\n                                                                    CUT TO:\n\n               INT. FOREST - DAY\n\n               We are with Lila. She creeps along, when suddenly a tan, \n               muscular figure tears out from behind a tree and runs, \n               practically on all fours, through the dense underbrush.\n\n               Lila follows, almost as agile as the forest creature.\n\n               Nathan just stands there. The chase continues. There is a \n               great deal of heaving and panting. Puff shimmies up a large \n               tree. Lila follows. Puff leaps from branch to branch.\n\n               Lila follows easily. Puff swings from a vine. So does Lila. \n               Finally they come to the end of the trees, a clearing. There \n               is no nowhere for Puff to leap. Lila is with him in the tree. \n               They are crouched, bloody, heaving, on separate branches, \n               staring at each other. After a long moment, Lila speaks.\n\n                                     LILA\n                         Who are you?\n\n               Puff cocks his head. The high timbre of her voice surprises \n               him, pleases him, but he doesn't understand the words.\n\n                                     LILA\n                         You don't understand my language, do \n                         you?\n\n               Puff looks at his crotch. Apparently there is some activity \n               down there. Lila, following his eyes, glances down there \n               also.\n\n                                     LILA\n                              (laughing)\n                         I take it back, you do understand my \n                         language.\n\n               Puff grabs for his crotch and begins to play with himself \n               distractedly, looking at her all the while. He falls out of \n               the tree. Lila gasps. Branches crack and snap as he passes \n               through them and then there is an unpleasant thud when he \n               hits the forest floor. Lila shimmies down the tree, and kneels \n               by Puff. He is unconscious.\n\n                                     LILA\n                         Oh God.\n\n               Nathan comes limping through the brush. Somehow his safari \n               suit and boots are as clean and pressed as they were in the \n               car. He is carrying Lila's clothes. Somehow he has had time \n               to neatly fold them.\n\n                                     NATHAN\n                         Oh my God! Is he dead? Please put \n                         something on.\n\n               Lila looks up at icily at Nathan.\n\n                                     NATHAN\n                         You'll catch cold. It's cold.\n                              (beat)\n                         What do you suppose he is, a \n                         survivalist?\n\n                                     LILA\n                         I think he's feral.\n\n                                     NATHAN\n                              (jumping back)\n                         Feral? Don't touch him! He might be \n                         diseased! He might... My God, rabies!\n\n                                     LILA\n                         He looks perfectly fine.\n\n                                     NATHAN\n                         I think we should go. Please. Before \n                         he wakes up and, I don't know, eats \n                         us, or whatever feral things do.\n\n                                     LILA\n                         I don't understand you. This is \n                         fascinating and you just want to run \n                         away. I mean, here we have a human \n                         being totally uncontaminated by \n                         civilization, totally free, and all \n                         you want to do is run back to your...\n\n                                     NATHAN\n                              (thinking)\n                         Actually, I just had an amusing \n                         thought.\n\n                                     LILA\n                         What?\n\n                                     NATHAN\n                              (musing)\n                         Feral, huh? Totally uncontaminated?\n\n                                     LILA\n                         Look at him. He doesn't understand \n                         English. He moves like an animal.\n\n                                     NATHAN\n                         It's perfect!\n\n                                     LILA\n                         Nathan, what the hell are you talking \n                         about?\n\n                                     NATHAN\n                              (doing a little dance)\n                         Forget mice! Actually forget guinea \n                         pigs, cats, monkeys, and chimps also. \n                         I'm on to stage five: The human \n                         subject.\n\n                                     LILA\n                         Oh no. You can't take him from his \n                         home, Nathan.\n\n                                     NATHAN\n                              (ranting)\n                         Don't you see? He's my Tabula Rasa, \n                         my Eliza Dolittle. He's my ticket to \n                         the top of the Behaviorist food chain. \n                         He's going to make me famous.\n\n                                     LILA\n                         I won't allow you. It's wrong. He's \n                         happy here.\n\n                                     NATHAN\n                         Is he, Lila? Is he happy living filthy \n                         and naked alone in this tick infested \n                         wilderness? Never to know the love \n                         of a good woman, never to revel in \n                         the pitter-patter of little feet, \n                         never to read Moby Dick, or marvel \n                         at a Monet, or just sit back after a \n                         day of hard but rewarding work, smoke \n                         a pipe, and wonder about the nature \n                         of reality.\n\n                                     LILA\n                              (weakening resolve)\n                         You'd be taking away his freedom, \n                         Nathan.\n\n                                     NATHAN\n                         Freedom's just another word for \n                         nothing left to lose, Lila, to quote \n                         Janet Jackson.\n\n               Lila looks off into the distance, her eyes brimming with \n               tears. As Nathan continues his speech, we move closer and \n               closer into Lila's eyes. Nathan's voice fades into nothing \n               by the time we dissolve.\n\n                                     NATHAN\n                         Belonging to something, a person or \n                         a society, is a basic human craving. \n                         We are communal creatures. This poor \n                         soul has no one, nothing...\n\n                                                               DISSOLVE TO:\n\n               EXT. CLIFF - SUNSET\n\n               A naked, very hairy Lila sits by herself on the cliff and \n               watches the sunset. There's a chill in the air and she shivers \n               and hugs herself.\n\n                                     LILA\n                         Oh God, I have no one. Nothing. You \n                         give me this beautiful gift, this \n                         glorious sunset. But with no one to \n                         say \"isn't that a beautiful sunset\" \n                         to, it becomes meaningless, just \n                         another stupid sunset. They happen \n                         everyday. So what?\n\n                                                               DISSOLVE TO:\n\n               EXT. FOREST - DAY\n\n               Lila is hovering over the unconscious Puff. Nathan's voice \n               comes back into focus. He is still speechifying.\n\n                                     NATHAN\n                         ...what is it that makes us human, \n                         if not the knowledge that we are \n                         indeed human? Think of this poor \n                         soul's education as the greatest \n                         gift we could bestow upon...\n\n                                     LILA\n                         All right.\n\n                                     NATHAN\n                         Great. Grab his feet. We'll throw \n                         him in the trunk.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Nathan hovers over the Lucite case with the tiny dinner table \n               in it. His assistant, Gabrielle, presses a button, a door \n               opens, and two white mice scurry in. The male pulls out a \n               chair for the female. The female climbs up on the chair, and \n               the male pushes the chair in, then scurries around to the \n               other side of the table and climbs onto his own chair. The \n               Lucite lid over the silverware and salads lifts and both \n               mice pick up the proper forks and begin eating. Nathan \n               scribbles in his notebook.\n\n                                     GABRIELLE\n                         Doctor...\n\n               Nathan looks up. Gabrielle jerks her head in the direction \n               of a very large Lucite case. Inside, Puff, now dressed in a \n               diaper and connected to all sorts of electrodes, is stirring. \n               Nathan and Gabrielle hurry over.\n\n                                     NATHAN\n                         Good morning.\n\n               Puff groggily takes in his surroundings. This is quite a lot \n               to take in. The white room, the strange apes in strange suits, \n               his own clothing, the wires. After surveying the scene for a \n               moment, Puff becomes frightened and agitated.\n\n               He tries to escape. Not understanding Lucite, he smashes \n               into it, again and again. He tears at his diaper. Nathan \n               gives a nod to Gabrielle, who presses a button on a panel.\n\n               An electric shock sends Puff flying. He lies on the floor \n               confused and dazed. After a moment, he gets up and again \n               crashes into the Lucite. Nathan gives the signal to Gabrielle \n               and once again she shocks Puff. He once again gets up and \n               crashes against the Lucite. Again he is shocked. He gets up \n               again, and is about to crash against the Lucite, but he thinks \n               better of it, and squats in place, immobilized.\n\n                                     NATHAN\n                              (to Gabrielle)\n                         Only three shocks. A chimp takes \n                         fifteen. This is going to be tres \n                         simple, no, Gabrielle?\n\n                                     GABRIELLE\n                              (in love with Nathan)\n                         Oui, doctor, oui.\n\n                                     NATHAN\n                              (to Puff)\n                         Good morning...\n                              (to Gabrielle)\n                         We need a name for him, don't we?\n\n                                     GABRIELLE\n                         Oui.\n\n                                     NATHAN\n                         You decide. Today is your day.\n\n                                     GABRIELLE\n                         Really? My day? Well, I had a sweet \n                         little mongrel puppie named Puff \n                         when I was a girl. This one reminds \n                         me of my dog, all shaggy! So cute!\n                              (giggles girlishly)\n                         I loved my doggie very much, monsieur.\n\n                                     NATHAN\n                              (charmed)\n                         Puff it is then. Puff Bronfman. Is \n                         that okay?\n\n                                     GABRIELLE\n                         Oui. Perfect!\n\n                                     NATHAN\n                              (to Puff)\n                         Good morning, Puff Bronfman. I'm Dr. \n                         Bronfman and this is my assistant \n                         Gabrielle. We're your mommy and daddy \n                         while you are here.\n\n               Gabrielle likes this concept a great deal. She smiles and \n               moves closer to Nathan.\n\n                                     NATHAN\n                              (to Puff)\n                         How about some salad, son?\n\n               Gabrielle poises her finger above the button. She winks at \n               Nathan. He blushes.\n\n                                                                    CUT TO:\n\n               EXT. PARKING LOT - EVENING\n\n               Nathan, carrying a brief case, is walking to his car.\n\n               Gabrielle hurries to catch up to him. Her high heels click \n               on the pavement.\n\n                                     GABRIELLE\n                         Dr. Bronfman! Dr. Bronfman!\n\n               Nathan turns.\n\n                                     NATHAN\n                         Oh, Hi, Gabrielle.\n\n                                     GABRIELLE\n                              (out of breath)\n                         Hi. I just wanted to tell you that I \n                         very much enjoy working with you.\n                              (blushes)\n                         Now I'm embarrassed that I say this.\n\n               They walk along.\n\n                                     NATHAN\n                         No. Don't be. I really enjoy hearing \n                         that. You're a terrific assistant.\n\n                                     GABRIELLE\n                         Merci. I... Do you... would you like \n                         to go get a cup of coffee, perhaps?\n\n                                     NATHAN\n                         Well, I don't know. I'm actually on \n                         my way to...\n\n                                     GABRIELLE\n                         Now I am truly embarrassed. Forgive \n                         me. I should not have asked such a \n                         stupid question. I know you are a \n                         very important man and...\n\n                                     NATHAN\n                         No. Don't be silly. It's just...\n\n                                     GABRIELLE\n                         I am a foolish little thing. I am \n                         pink in my face, no? It is only that \n                         I have been so lonely lately and... \n                         I am ashamed. I'll see you tomorrow, \n                         okay? Unless... Am I fired now?\n\n               Gabrielle pouts. Nathan is charmed.\n\n                                                                    CUT TO:\n\n               INT. COFFEE SHOP - EVENING\n\n               Nathan and Gabrielle sit at a romantic little table in a \n               trendy coffee shop.\n\n                                     GABRIELLE\n                         Thank you so much for accompanying \n                         me.\n\n                                     NATHAN\n                         Not at all.\n\n                                     GABRIELLE\n                         I have had such a difficult time in \n                         my personal life and you seem to be \n                         such a nice man... but I'm talking \n                         too much again, no?\n\n                                     NATHAN\n                         Of course not.\n\n                                     GABRIELLE\n                         You're so sweet. Oh, why are there \n                         not more men out there like you?\n\n               Gabrielle starts to cry softly. Nathan doesn't know what to \n               do. His eyes dart around, then:\n\n                                     NATHAN\n                         There there.\n\n               Gabrielle looks up at him appreciatively. She sniffs.\n\n                                     GABRIELLE\n                         You know just the right thing to \n                         say.\n\n               She reaches across the table and touches his hand lightly \n               for a moment.\n\n                                     NATHAN\n                         Listen, you're the best assistant \n                         I've ever had... Gabrielle.\n\n                                     GABRIELLE\n                              (smiles)\n                         I like it when you say my name. Is \n                         that stupid?\n\n                                                                    CUT TO:\n\n               INT. NATHAN'S BEDROOM - NIGHT\n\n               Nathan, in his pajamas, lies in bed reading. He looks up.\n\n                                     NATHAN\n                         What are you doing in there?\n\n                                     LILA (O.S.)\n                         Nothing. Be right out.\n\n               The phone rings. Nathan picks it up.\n\n                                     NATHAN\n                         Hello?\n                              (beat, happily)\n                         Oh, hi... Gabrielle!\n\n               Nathan sits up in bed.\n\n                                     LILA (O.S.)\n                         Who is it?\n\n                                     NATHAN\n                         Uh-huh. Right, Gabrielle. Right.\n\n               Nathan laughs.\n\n                                     LILA (O.S.)\n                         Who is it?\n\n                                     NATHAN\n                              (into phone)\n                         Absolutely, Gabrielle.\n                              (covering phone, \n                              testily)\n                         Someone from work!\n                              (into phone)\n                         Sorry about that, Gabrielle. Uh-huh. \n                         Exactly.\n\n               Nathan laughs.\n\n                                     LILA (O.S.)\n                         Who from work?\n\n                                     NATHAN\n                              (into phone)\n                         Excuse me one second, would you, \n                         Gabrielle?\n\n               Nathan puts down the phone and heads to the bathroom.\n\n                                     LILA (O.S.)\n                         Who is it, Nathan?\n\n               Nathan opens the bathroom door.\n\n                                     NATHAN\n                         Look, Lila, when I'm on a work...\n\n               Lila turns with a gasp. She has shaving cream all over her \n               chest. Nathan looks stunned. He backs away.\n\n                                     LILA\n                         Nathan, I...\n\n                                                                    CUT TO:\n\n               INT. GABRIELLE'S BEDROOM - NIGHT\n\n               The lights are low. The room is peppered with lit candles.\n\n               Gabrielle, in a slip, lies on her bed, eating cherries from \n               a bowl, and listening to Nathan and Lila's conversation on \n               speaker.\n\n                                     LILA (O.S.)\n                         It's hormonal, Nathan. I can't help \n                         it. I'm sorry.\n\n                                     NATHAN (O.S.)\n                         Your entire body?\n\n                                     LILA (O.S.)\n                         I'm getting electrolysis. It's \n                         working, but it takes time. So \n                         meanwhile I have to...\n\n                                     NATHAN (O.S.)\n                         You have to shave? Like an ape?\n\n                                     LILA (O.S.)\n                              (crying)\n                         Apes don't shave, you son of a bitch!\n\n                                     NATHAN (O.S.)\n                         Don't quibble. You know what I mean.\n\n                                     LILA (O.S.)\n                         I'm sorry. Please don't be mad at me \n                         for this.\n\n                                     NATHAN (O.S.)\n                         Mad? I'm I'm... disgusted!\n\n                                     LILA (O.S.)\n                         I'm the same person I was before you \n                         knew, damn it! Oh God!\n\n                                     NATHAN (O.S.)\n                         I have to think! I have to think!\n\n               Footsteps and a door slam. Lila is near the phone now and \n               crying in desperate heaves.\n\n                                     LILA (O.S.)\n                         Oh God, why... do... I... have... \n                         to... be... like... Oh, no! Oh, shit!\n                              (rustling sound, then \n                              into phone)\n                         Hello? Hello? Is anyone there? Who's \n                         there?\n\n               Gabrielle calmly pops another cherry in her mouth and hangs \n               up the phone.\n\n                                                                    CUT TO:\n\n               INT. CAR - NIGHT\n\n               Nathan, in his pajamas, drives. His face is set in a furious \n               scowl and he drives fast.\n\n                                                                    CUT TO:\n\n               INT. ANOTHER CAR - NIGHT\n\n               Gabrielle drives leisurely. She is calm, a slight smile on \n               her face.\n\n                                                                    CUT TO:\n\n               INT. LAB - NIGHT\n\n               Nathan paces in front of Puff's Lucite case. Puff watches \n               suspiciously from the corner where he is huddled. The lights \n               are off. But there is a green glow from a couple of exit \n               signs.\n\n                                     NATHAN\n                         I don't get it. I don't get it. I \n                         don't get it. How could I find myself \n                         in this mess? This is a mess. This \n                         is not a situation I understand. \n                         This is a mess. How do I extricate \n                         myself from this mess? Is my \n                         girlfriend a man? I don't understand. \n                         This is not part of any plan. She \n                         deceived me. She has hair.\n                              (beat)\n                         But am I being fair? So what if she \n                         has hair? Who am I to judge? I have \n                         hair.\n                              (beat)\n                         But I'm supposed to have hair. I am \n                         a man. Men are supposed to have hair.\n                              (beat)\n                         But poor Lila. Think of what she's \n                         had to go through. The courage she's \n                         had to have in the face of this \n                         abomination of nature. I should love \n                         her all the more. I should love every \n                         hair on her body. I mean, she doesn't \n                         mind that I have a mortifyingly \n                         small...\n\n               The lights flick on. Nathan turns with a start. It's \n               Gabrielle. She's in an overcoat. She gasps.\n\n                                     GABRIELLE\n                         Oh, Doctor. I did not know. I'm sorry \n                         to disturb you. I just came for some \n                         papers I left.\n\n                                     NATHAN\n                         Gabrielle. No, I'm sorry if I startled \n                         you. I came to think.\n                              (beat, remembering)\n                         God, Did I hang up on you?\n\n                                     GABRIELLE\n                         Oui. Perhaps I called at a bad time. \n                         I am sorry.\n\n                                     NATHAN\n                         No. I just got distracted. I'm so \n                         sorry.\n\n                                     GABRIELLE\n                         Is everything fine?\n\n                                     NATHAN\n                         Oui.\n                              (laughs)\n                         Now you've got me talking French.\n\n                                     GABRIELLE\n                              (laughs)\n                         I was in my p.j.'s when I remembered \n                         I left some papers I need to go over.\n                              (opens overcoat to \n                              reveal lingerie)\n                         See? I rushed right out of the house.\n                         I must look a mess. I'm so \n                         embarrassed.\n\n                                     NATHAN\n                              (taken)\n                         I'm in my p.j.'s, too. Funny, huh?\n\n               Puff is taken also. His eyes are wide.\n\n                                     GABRIELLE\n                         Coincidence, yes?\n                              (beat)\n                         And how is our son?\n\n                                     NATHAN\n                         Our...? Oh!\n                              (laughs, out of control)\n                         He seems fine. I guess we woke him. \n                         The lights and all.\n\n                                     GABRIELLE\n                         I should turn them off.\n                              (she does)\n                         Maybe I sing him a lullaby my mama \n                         sang to me when I was a little girl.\n\n                                     NATHAN\n                              (a little giddy)\n                         When you were a little French girl?\n\n                                     GABRIELLE\n                         Oui.\n\n                                     NATHAN\n                              (back in control)\n                         That would be good.\n\n               Gabrielle kneels by Puff's case. Puff crawls over, tries to \n               touch her through the Lucite. Gabrielle sings a French \n               lullaby. It's very sweet. Nathan watches her, looks at her \n               thigh, her hair, the delicate way the tip of her nose moves \n               when she sings. Puff gets drowsy. He curls up on the floor \n               and sleeps.\n\n                                     GABRIELLE\n                              (quietly to Nathan)\n                         There.\n\n               Nathan stares at her, transfixed. She pretends not to notice.\n\n                                     GABRIELLE\n                         Shall we close up, then?\n\n                                     NATHAN\n                         Maybe we should just sit for a while. \n                         It's very peaceful.\n\n                                     GABRIELLE\n                         It's nice, yes. I'm glad I ran into \n                         you, both in our silly pajamas. It \n                         is two happy coincidences, no?\n\n                                     NATHAN\n                         Yes. Happy happy.\n\n                                     GABRIELLE\n                         Yet you look so sad. A great man \n                         like you should not be sad.\n\n                                     NATHAN\n                         I'm fine. Life is funny, that's all.\n\n               Gabrielle stands. She stretches languorously, revealing a \n               lot of leg.\n\n                                     GABRIELLE\n                         I am sleepy.\n\n                                     NATHAN\n                         I shouldn't say this, but you're \n                         pretty, Gabrielle. It's \n                         unprofessional, I know.\n\n                                     GABRIELLE\n                         Really? I always think myself so \n                         ugly. No, not ugly, but plain. A \n                         wallflower.\n\n                                     NATHAN\n                              (buying her line)\n                         Really? No. Not at all. You're a \n                         very pretty girl. You should know \n                         that. You should be confident.\n\n                                     GABRIELLE\n                         Thank you so much. Merci. It's very \n                         wonderful to hear a man say such a \n                         nice compliment.\n\n                                     NATHAN\n                         It's true. I wouldn't lie.\n\n                                     GABRIELLE\n                         You are sweet.\n\n               Gabrielle walks slowly by Nathan. He inhales deeply, breathing \n               her in. She smiles to herself. He reaches out touches her \n               leg.\n\n                                     GABRIELLE\n                              (vaguely protesting)\n                         Doctor.\n\n               She moves into Nathan. She presses her thigh against his \n               shoulder. Nathan leans forward, kisses her exposed thigh.\n\n                                     NATHAN\n                         So soft. So smooth.\n                              (back to reality)\n                         I'm sorry. It's just...\n\n                                     GABRIELLE\n                              (soothing)\n                         Shh.\n\n                                                                    CUT TO:\n\n               INT. BATHROOM - NIGHT\n\n               Lila is shaving herself all over. Shaving and weeping.\n\n               There are nicks all over her body. She has no eyebrows any \n               more. The hair on her head is hacked off.\n\n                                                                    CUT TO:\n\n               INT. LAB - NIGHT\n\n               Nathan and Gabrielle are lying naked on the floor.\n\n               Gabrielle rests her head on Nathan's chest.\n\n                                     NATHAN\n                         Was that okay? I mean, was I able \n                         to... satisfy you?\n\n                                     LILA\n                         You are an animal.\n\n                                     NATHAN\n                         Really? Wow! That's that's terrific \n                         to hear from someone so... feminine, \n                         so female.\n\n                                     LILA\n                         I love being female because it, how \n                         do you say, allows me to be close to \n                         men.\n\n                                     NATHAN\n                         I'm glad you're female.\n                              (beat)\n                         Do you think our boy witnessed the \n                         primal scene?\n\n                                     GABRIELLE\n                         Anyway it's time he grew up. N'est-\n                         ce pa?\n                              (sighing, running her \n                              fingers along his \n                              chest)\n                         I love chest hair on a man. I know \n                         it isn't fashionable now, hairy men. \n                         But to me it is the very sign of \n                         masculinity.\n\n               Nathan tenses. Gabrielle looks up innocently at him.\n\n                                     GABRIELLE\n                         What is wrong, my darling?\n\n                                     NATHAN\n                         Nothing, my darling. All is right \n                         with the world.\n\n               Puff watches from his case. Gabrielle smiles to herself.\n\n               INT. AUDITORIUM - DAY\n\n               Puff testifies.\n\n                                     PUFF\n                         I saw it, gentlemen. I saw the whole \n                         sweaty, passionate, ugly, beautiful \n                         act, and to use the vernacular, I \n                         wanted me some of that.\n\n               The congressmen laugh appreciatively. The laughter is a little \n               too enthusiastic and goes on a little too long. It stops \n               abruptly.\n\n                                     PUFF\n                         And I think I understood from that \n                         moment, that in order to get some, I \n                         would have to do what they said. In \n                         order to experience this primal, \n                         basic, animal thing, I would first \n                         have to become a civilized, prissy, \n                         uptight human. I would have to become \n                         Nathan.\n\n               The congressmen nod sadly, in recognition of this reality.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Puff, in his Lucite case, sits behind a set dinner table.\n\n               He seems attentive, calm, interested as Nathan teaches him \n               table manners. Gabrielle stands very close, almost \n               possessively close, to Nathan. She wears a lab coat, but it \n               is unbuttoned, and underneath she is wearing a skin-tight \n               black minidress. She strokes the back of Nathan's head as he \n               works with Puff.\n\n                                     NATHAN\n                              (slow. talking to an \n                              idiot)\n                         Excellent, Puff. Now, the lady you're \n                         with excuses herself to go powder \n                         her nose.\n\n               The wheels turn in Puff's head. He thinks hard. Then he \n               stands. Gabrielle shrieks and claps happily.\n\n                                     NATHAN\n                         Perfect. Perfect, Puff!\n\n               Nathan leans over and kisses Gabrielle. Puff watches. He \n               makes an exaggerated kissy-face, pursing his lips, trying to \n               imitate Nathan. The phone rings. Gabrielle pulls herself \n               away, giggles as Nathan tries to keep her from going, and \n               picks up the phone.\n\n                                     GABRIELLE\n                              (still giggling)\n                         Dr. Bronfman's line. Yes. One moment \n                         please.\n                              (puts it on hold)\n                         Lila.\n\n                                     NATHAN\n                         Shit.\n                              (takes phone)\n                         Hi, honey.\n\n                                                                    CUT TO:\n\n               INT. LILA AND NATHAN'S LIVING ROOM - CONTINUOUS\n\n               Lila sits on the couch. Eyebrows are attractively drawn onto \n               her face. She wears a very femme blonde wing. Lots of make-\n               up.\n\n                                     LILA\n                         So, how's it going today?\n\n                                     NATHAN (O.S.)\n                         Good. Making progress.\n\n                                     LILA\n                         Honey, can we talk tonight? You know, \n                         about stuff? Things have been so \n                         strained for the past three weeks, \n                         since you know, and I just want to \n                         talk.\n\n                                                                    CUT TO:\n\n               INT. LAB - CONTINUOUS\n\n               Nathan, phone cradled between shoulder and ear, puts his \n               face in his hand. Gabrielle rests a hand on his shoulder.\n\n                                     NATHAN\n                         Everything's fine, honey. We don't \n                         need to talk. Besides I have to work \n                         late.\n\n                                     LILA (O.S.)\n                         Please, Nathan. I really need this. \n                         You've been working late a lot.\n\n               Nathan looks up helplessly at Gabrielle.\n\n                                     NATHAN\n                         Okay, we'll have dinner tonight.\n\n               Gabrielle gets mad, exhales sharply, pulls her hand away.\n\n               Nathan gives her a pleading look, grabs for her. She moves \n               away.\n\n                                     NATHAN\n                         Yeah. Okay. Be home around seven. \n                         Bye.\n                              (hangs up)\n                         What? I'm sorry. What was I supposed \n                         to do?\n\n                                     GABRIELLE\n                              (disgusted)\n                         I don't know, Nathan. What are you \n                         supposed to do?\n\n                                     NATHAN\n                         You don't abandon somebody because \n                         they have a physical problem.\n\n                                     GABRIELLE\n                         Funny. I thought that's exactly what \n                         you did. You just don't have the \n                         courage to admit it to yourself.\n\n                                                                    CUT TO:\n\n               INT. WHITE SPACE - DAY\n\n               Nathan talks. A tear runs down his face, mingles with the \n               blood.\n\n                                     NATHAN\n                         Funny. I still feel guilt. Even dead. \n                         One would've hoped... But alas. You \n                         know, I really did love Lila. But \n                         with her... problem... and then when \n                         Gabrielle revealed her feelings. And \n                         Gabrielle was so... conventionally \n                         female. And she had an accent. I was \n                         lost from that moment on. But \n                         Gabrielle was right. I couldn't admit \n                         it to myself, this shallowness of \n                         character, let alone to Lila.\n\n                                                                    CUT TO:\n\n               INT. RESTAURANT - NIGHT\n\n               Lila and Nathan eat. Lila is in her new, very feminine make-\n               up, wig, and dress. Her table manners are impeccable, almost \n               robotic. There is an awkward silence\n\n                                     LILA\n                         Are you seeing somebody else, Nathan? \n                         I just have to know.\n\n                                     NATHAN\n                         Of course not.\n\n                                     LILA\n                         It would just be helpful to know.\n\n                                     NATHAN\n                         No.\n\n                                     LILA\n                         Because, you know, you seem so \n                         distant. And you work late every \n                         night. And we hardly ever have sex, \n                         and when we do, it's... I don't know. \n                         It feels different.\n\n                                     NATHAN\n                         I'm just preoccupied.\n\n                                     LILA\n                         Do you like my new look?\n\n                                     NATHAN\n                         Yeah. It's nice. It's really good.\n\n                                     LILA\n                         I'm trying, you know.\n                              (starting to cry)\n                         I'm trying to be what you want. I \n                         want to be what you want, Nathan. \n                         All I want is to be what you want.\n\n                                     NATHAN\n                              (embarrassed)\n                         Shh. It's okay.\n                              (takes her hand)\n                         It's okay, Lila. You're what I want. \n                         You know that. You're exactly what I \n                         want.\n\n                                     LILA\n                              (hopefully, sniffing)\n                         Really?\n\n                                     NATHAN\n                         Sure. Of course.\n\n                                     LILA\n                         Because I'm really trying, you know. \n                         Rosie says maybe only another two \n                         years of the elctrolysis.\n\n                                     NATHAN\n                              (hard to stomach)\n                         That's great.\n\n                                     LILA\n                         I've signed up for a ballet class. \n                         And look at my nails! A real girl!\n\n               Lila holds out her hands. Her finger nails are polished fire \n               engine red.\n\n                                     NATHAN\n                         That's great. It's a great color for \n                         you.\n\n                                     LILA\n                         Oh, Nathan, let's have a baby!\n\n                                                                    CUT TO:\n\n               INT. NURSERY - DAY\n\n               Lila holds and rocks a swaddled baby. She passes it to Nathan, \n               who looks at it and sees that it's a baby monkey.\n\n               Nathan shudders. Lila looks on lovingly, oblivious.\n\n                                                               DISSOLVE TO:\n\n               INT. THERAPIST'S OFFICE - DAY\n\n               Nathan sits with his head in his hands. Wendall listens \n               attentively.\n\n                                     NATHAN\n                         So anyway, that's the nightmare I've \n                         been having lately.\n\n                                     WENDALL\n                         Do you suppose it has anything to do \n                         with Lila's unusually hairy body?\n\n                                     NATHAN\n                              (beat)\n                         No, why?\n\n                                     WENDALL\n                         Well, it seems that since Lila \n                         broached the subject of children, \n                         you've been on edge and I know you \n                         have an issue with the, uh, body \n                         hair.\n\n                                     NATHAN\n                              (revelation)\n                         Oh, I see. Yes, that's something to \n                         think about. That's very good. That's \n                         what you get the big bucks, right? \n                         Ha ha.\n\n                                     WENDALL\n                         I just think it might be important \n                         to explore your feelings for Lila.\n\n                                     NATHAN\n                         I love Lila. I mean, she's a wonderful \n                         person. And... she loves me! That's \n                         no small potatoes. I mean she really \n                         loves me. She's sacrificed so much \n                         to be in this relationship with me. \n                         And she's a good person. A truly \n                         good person. How rare is that in \n                         this world, eh? And how could I stop \n                         loving somebody because of a little \n                         physical imperfection, if it can \n                         even be called that. I mean, God \n                         knows I'm not perfect! What about my \n                         eyesight? It's lousy, that's what! \n                         Lila's not going to leave me because \n                         of my eyesight. What about my penis?\n\n                                     WENDALL\n                         And how do you feel about Gabrielle?\n\n               Nathan puts his head in his hands and sighs.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Nathan is holding flash cards up to Puff. Puff tentatively \n               reads aloud from the cards. Gabrielle sits nearby on a stool, \n               fish-netted legs crossed, arms crossed, and an angry \n               expression on her face.\n\n                                     PUFF\n                         Good-eve-n-ing-lay-dees-and-gent-\n                         elmen.\n\n                                     NATHAN\n                         Bravo, Puff! Bravo!\n\n               Puff smiles happily. Nathan and Puff both look over at \n               Gabrielle for her approval. None is forthcoming.\n\n                                     NATHAN\n                         Isn't Puff doing spectacularly, honey?\n\n                                     GABRIELLE\n                         Hmmmph.\n\n                                     NATHAN\n                         Gabby, what is it?\n\n                                     GABRIELLE\n                         Hmmph. Hmmph.\n                              (beat)\n                         Nathan, we have to talk, you and I.\n\n                                     NATHAN\n                         Fine.\n\n                                     GABRIELLE\n                         Not in front of the boy.\n\n                                     NATHAN\n                         Very well.\n\n               Gabrielle stands, turns, and stomps across the room. Nathan \n               follows her angry, switching hips with his eyes, as does \n               Puff. She exits into the hall. Nathan looks at Puff and \n               shrugs. Puff returns the shrug. Nathan follows Gabrielle \n               into the hall.\n\n                                                                    CUT TO:\n\n               INT. HALL - CONTINUOUS\n\n               Gabrielle stands there waiting, a troubled look on her face, \n               her eyes brimming. Nathan emerges, tries to embrace her.\n\n                                     NATHAN\n                         My little French.\n\n                                     GABRIELLE\n                              (pushing him away)\n                         Stop. Get away.\n\n                                     NATHAN\n                         What is it?\n\n                                     GABRIELLE\n                         You have to choose Nathan. It's like \n                         Sophie's choice. Only it is Nathan's \n                         choice. Did you ever see that movie, \n                         Sophie's Choice? It is like that. \n                         Only it is this.\n\n                                     NATHAN\n                         Gabby, you know I'm trying to sort \n                         things out.\n\n                                     GABRIELLE\n                              (hard)\n                         No! It is now that you must decide.\n                              (soft)\n                         I love you, Doctor Nathan...\n                              (hard)\n                         ...but I will not wait. I will not \n                         be your chippy. I will not be your \n                         little Mademoiselle Parlez-vous side \n                         dish.\n                              (soft)\n                         My love. I want to have a sweet tiny \n                         baby inside my belly... from you.\n\n               Nathan gets a faraway look in his eyes.\n\n                                                               DISSOLVE TO:\n\n               EXT. BEACH - DAY\n\n               Nathan and Gabrielle sit on a blanket on this otherwise empty \n               beach. There is a light breeze. Gabrielle has one of her \n               breasts exposed and is nursing an infant. Nathan looks at \n               the baby's face. It is angelic. He looks up and smiles at \n               Gabrielle. She smiles back. They kiss.\n\n                                                               DISSOLVE TO:\n\n               INT. HALL - DAY\n\n               Nathan snaps out of his reverie, looks pleadingly at the \n               waiting Gabrielle.\n\n                                     NATHAN\n                         I love you so much, Gabrielle.\n\n                                     GABRIELLE\n                         But?... But? There is a \"but,\" Nathan.\n\n                                     NATHAN\n                         But I don't know how to leave Lila.\n\n               Gabrielle tears off her lab coat. Underneath she is wearing \n               practically nothing, a skimpy black dress. She throws the \n               lab coat at Nathan, turns and storms down the hall. Nathan \n               watches until she disappears around the corner.\n\n                                     NATHAN\n                              (quietly)\n                         Now there's a butt, Nathan.\n\n               He brings the lab coat up to his face and breathes in her \n               fragrance.\n\n                                                                    CUT TO:\n\n               INT. LILA AND NATHAN'S - NIGHT\n\n               Lila, all prettied up and civilized and manicured, is setting \n               the table for dinner. She is humming. Nathan walks in the \n               door. Lila doesn't hear him. He stands in the doorway for a \n               moment, watching Lila from behind. His face is blank. Lila \n               catches sight of him. She's startled.\n\n                                     LILA\n                         Oh!\n                              (laughs)\n                         I didn't see you there, sneaky boy!\n                              (runs over and kisses \n                              him)\n                         You're like a boy sneaking in...\n\n                                     NATHAN\n                              (so bored)\n                         ...the back door of a movie theater. \n                         Yes, indeed.\n\n                                     LILA\n                         You remember that from my book? I'm \n                         touched!\n                              (kisses him again)\n                         What's wrong?\n\n                                     NATHAN\n                         Nothing. Hard day. Gonna have a drink.\n\n                                     LILA\n                         I'll make it.\n                              (beats him to the \n                              portable bar)\n                         I'm so happy, Nathan! Everything's \n                         going to be so great! Scotch on the \n                         rocks, right?\n                              (giggles)\n                         Just kidding. I know what you drink, \n                         mister. I know what you drink.\n                              (pours and blends and \n                              shakes, etc.)\n                         Voila!\n\n               Lila hands Nathan a frothy pink concoction with a pineapple \n               wedge sticking out of it.\n\n                                     NATHAN\n                         Thanks.\n\n               Nathan stares contemplatively out the window and sips his \n               drink. Lila watches him, comes up behind him, puts her arms \n               around him. Nathan cringes, but tries to cover it. Lila feels \n               the cringe, but pretends not to have. She keeps her arms \n               around him for a moment longer, then casually removes them.\n\n                                     LILA\n                              (fishing)\n                         How's work?\n\n                                     NATHAN\n                         Cruddy, okay? Are you satisfied?\n\n                                     LILA\n                              (pouty)\n                         No. I don't want your work to be \n                         cruddy.\n\n                                     NATHAN\n                         My assistant quit today. Okay? He \n                         was highly valuable to the project.\n\n                                     LILA\n                         Oh, baby. I'm sorry. Can't you hire \n                         somebody else?\n\n                                     NATHAN\n                         I guess.\n\n               Lila screws up her face in concentration, trying to come \n               with a viable solution to Nathan's problem.\n\n                                     LILA\n                         Hey! I could come work for you! I \n                         know I haven't been all that \n                         supportive of this project, but I've \n                         come around.\n\n                                     NATHAN\n                         Have you?\n\n                                     LILA\n                         Oh yes, baby! I think that this is a \n                         wonderful project you're doing, taking \n                         this poor unfortunate, uncivilized \n                         creature and turning him into a human \n                         being! What a wonderful wonderful \n                         compassionate man you are!\n\n                                     NATHAN\n                         Really?\n\n                                     LILA\n                         Yes! And I want to help. You won't \n                         have to pay me, and I was thinking \n                         of giving up that crazy nature writing \n                         anyway.\n\n                                     NATHAN\n                         How come?\n\n                                     LILA\n                         Who needs it? I have you and I have \n                         being a woman and I have thinking \n                         about womanly things! I love being a \n                         woman because...\n\n                                     NATHAN\n                         Such as what womanly things?\n\n                                     LILA\n                         Such as my man and how to please \n                         him!\n                              (kisses him)\n                         Such as making wonderful dinners for \n                         my man!\n                              (kisses him again, \n                              leads him to the \n                              table, sits him down)\n                         Such as looking pretty for my man!\n                              (kisses him again)\n                         And I'm writing an article on quilting \n                         for the Ladies Home Journal!\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n                                     LILA\n                         I had sold my fucking soul.\n\n                                                                    CUT TO:\n\n               INT. WHITE SPACE - DAY\n\n                                     NATHAN\n                         I let her sell her soul. I stood by \n                         as she did it. It's inexcusable.\n                              (beat)\n                         At the time though I thought it might \n                         help.\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n                                     PUFF\n                         When she came to work with Nathan, \n                         she seemed different, gentlemen, I \n                         don't know, somehow soulless.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Puff is in his case in formal evening wear in a makeshift \n               opera box. There is a mannequin woman sitting next to him \n               and a boom box pumping out Beethoven's Fidelio. Puff seems \n               attentive, refined, occasionally bringing a pair of opera \n               glasses up to his eyes, pinky extended. Outside the case, \n               Nathan and Lila look on. The opera is over. Puff stands, \n               applauds, yells \"Bravo\", and tosses a rose in the direction \n               of the imaginary stage. The rose hits the Lucite wall and \n               falls to the floor. Nathan and Lila stand and applaud Puff.\n\n                                     NATHAN\n                         Bravo to you, Puff!\n\n                                     LILA\n                         That was wonderful!\n\n               Puff smiles and performs a foppish bow, almost a curtsy. He \n               picks up the rose, sniffs it, dramatically savoring its scent.\n\n                                                                    CUT TO:\n\n               INT. LILA AND NATHAN'S BEDROOM - NIGHT\n\n               Nathan and Gabrielle are having sex. They are focused and \n               intent, although Gabrielle keeps chatting.\n\n                                     GABRIELLE\n                         You were wonderful today, darling. \n                         Such authority with the ape-man boy. \n                         It made me so hot for you.\n\n                                     NATHAN\n                         Unnhh.\n\n                                     GABRIELLE\n                         The way you are taming him, it sends \n                         chills down my girlish spine and... \n                         everywhere else, too.\n\n                                     NATHAN\n                         Urgh.\n\n                                     GABRIELLE\n                         Take me, darling! Tame your little \n                         monkey of love!\n\n               There is a mutual climax. A moment of silence, then a spent \n               Nathan rolls off onto his side of the bed. We see that it is \n               really Lila in bed with him, not Gabrielle.\n\n                                     LILA\n                              (sighing)\n                         Well, I'm tamed, Dr. Bronfman.\n\n               Nathan stares up at the ceiling.\n\n                                     NATHAN\n                         I'm glad... my assistant.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               We see a montage of interactions between Nathan, Puff, and \n               Lila.\n\n               1) Nathan demonstrates the proper way to taste wine: sniffing \n               the cork, swishing the wine around in the glass, sipping, \n               nodding in the affirmative to the waiter. Puff, inside his \n               case, imitates it perfectly.\n\n               2) Nathan shows Puff a flashcard which reads: \"I'll start \n               tonight with the foie gras.\"\n\n               3) Puff is holding up a small hand mirror and trimming nose \n               hairs. Lila applauds.\n\n               4) Puff juggles three balls while riding a unicycle.\n\n               5) Puff, dressed as Peter Pan, stands with legs spread and \n               hands on hips. He is singing \"I Gotta Crow.\"\n\n               6) Puff, dressed in an apron and chef's hat, is tossing a \n               salad. There are two types of vinegar to choose from. He \n               hesitates, then chooses the balsamic. Nathan and Lila applaud.\n\n               7) Puff, in a smoking jacket and smoking a pipe, is sitting \n               in an easy chair, next to a fake fire and a fake sleeping \n               dog, and reading a book of poems by Yeats. Lila and Nathan, \n               outside the case, applaud and embrace.\n\n                                     NATHAN\n                         I think he's ready.\n\n                                     LILA\n                         Oh boy!\n\n                                     PUFF\n                              (jumping up)\n                         Oh boy!\n\n                                     NATHAN\n                         Now, Puff, we're leaving on the \n                         electronic collar. I don't think \n                         we'll need to shock you, but just in \n                         case.\n\n                                     PUFF\n                         Okay. That's fair.\n\n               Nathan unlocks the case. Puff tentatively steps out into the \n               world. He hugs Nathan. It's a grateful, obsequious, slightly \n               pathetic hug. Nathan hugs him back, but he's keeping him at \n               a distance. Puff pulls himself out of the hug, but still \n               rests his hands on Nathan's shoulders and looks him in the \n               eye, almost like a lover. Then he parts with Nathan and goes \n               over to embrace Lila. She graciously receives him. After a \n               moment in the embrace, Puff starts dry-humping Lila. Lila \n               can't get out of his clutches.\n\n                                     NATHAN\n                         No, Puff! Bad!\n\n               Nathan presses a button, which shocks Puff and sends him \n               flying. Puff appears disoriented, then gets up off the floor, \n               brushes himself off, and turns to Lila with a bow of his \n               head.\n\n                                     PUFF\n                         My apologies, madam.\n\n                                     LILA\n                         It's okay, Puff.\n\n                                     PUFF\n                         Shan't happen again.\n\n                                                                    CUT TO:\n\n               EXT. CITY STREET - DAY\n\n               Lila, Nathan, and Puff walk along. Puff is astounded by \n               everything he sees. He looks with wonderment at the tall \n               buildings, the cars, the many different types of people. He \n               looks like an idiot.\n\n                                                                    CUT TO:\n\n               INT. FANCY RESTAURANT - DAY\n\n               Puff, Lila, and Nathan are eating lunch. Everything is very \n               proper. Puff is doing wonderfully.\n\n                                     NATHAN\n                         This is great, Puff. You're doing \n                         fine.\n\n                                     PUFF\n                         I'm loving this. It's such a treat \n                         to be out and about. What a wonderful \n                         invention a city is. The immense \n                         buildings of glass and steel glinting \n                         in the afternoon sun, the smartly \n                         dressed women in their best summer \n                         frocks, the colorful street vendors.\n\n               The waitress comes by.\n\n                                     WAITRESS\n                         How is everything?\n\n                                     PUFF\n                         Just spectacular. Great salmon. \n                         Fantastico! You've got to give me \n                         the recipe! My compliments to the \n                         chef!\n\n                                     WAITRESS\n                         I'm glad you...\n\n               Puff stands and grabs her and starts humping her.\n\n                                     NATHAN\n                         Puff, no!\n\n               Nathan presses a button on a small black box. Puff falls to \n               the floor. The waitress looks on, sort of confused.\n\n                                     WAITRESS\n                         And will that be all today?\n\n                                                                    CUT TO:\n\n               INT. TAXI - DAY\n\n               Lila, Nathan, and Puff are in the back seat of the moving \n               taxi.\n\n                                     PUFF\n                         It shan't happen again. I swear it. \n                         I'm just getting my sea legs, you \n                         know.\n\n                                     LILA\n                              (patting Puff on the \n                              back)\n                         It's an animal urge, Puff. It's \n                         nothing to be ashamed of.\n\n                                     NATHAN\n                         Lila! Tell him.\n\n               Lila looks at Nathan, amends her statement.\n\n                                     LILA\n                              (to Puff)\n                         You just have to control it. We're \n                         not apes.\n\n                                     NATHAN\n                         Thank you very much for that.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Puff is sitting in a chair and facing a screen. The collar \n               is around his neck. Nathan and Lila stand behind him at a \n               slide projector.\n\n                                     PUFF\n                         I don't think this aversion therapy \n                         is really necessary, doctor. I \n                         understand the problem.\n\n                                     NATHAN\n                         Humor me, Puff. It's essential that \n                         I am able to trust you to function \n                         independently in the world.\n\n                                     PUFF\n                         I bow to your expertise in these \n                         matters.\n\n                                     NATHAN\n                         Lila?\n\n               Lila dims the lights and switches on the projector. An image \n               of a pretty, fully clothed woman appears on the screen. Puff's \n               eyes widen, but he remains seated.\n\n                                     NATHAN\n                         Good. You're doing fine.\n\n               The slide changes to a naked woman standing in a neutral \n               position, no expression on her face. Puff twitches, but stays \n               seated.\n\n                                     NATHAN\n                         Excellent.\n\n               The slide changes to another photo of the same woman in the \n               same position, but with a seductive smile on her face. Puff \n               clutches the arms of the chairs.\n\n                                     NATHAN\n                         You're doing very nicely, Puff. I'm \n                         pleased.\n\n               The slide changes to another picture of the same woman, this \n               time she is naked, has her back to the camera, is sticking \n               her butt out, and looking over her shoulder at the viewer \n               with shiny, heavily lipsticked, pursed lips. Puff is shaking.\n\n                                     NATHAN\n                         Great...\n\n               Puff leaps out of his chair screaming and lunges for the \n               screen. Nathan grabs the black box and jolts him. Puff goes \n               flying in the air and lands with a crack. He heaves for a \n               while, then leaps up and runs for the screen again.\n\n               Again Nathan shocks him. Again he lands on the floor. He \n               heaves, stands, lunges for the screen again. Nathan shocks \n               him. This happens seven more times. Smoke is pouring out \n               from the collar. Puff struggles to his feet. Looks at the \n               screen. He shrugs.\n\n                                     PUFF\n                              (unimpressed)\n                         Eh.\n\n               Puff sits down in his chair, and studies his finger nails.\n\n               Nathan switches off the projector.\n\n                                     NATHAN\n                         Excellent work, Puff. Extra desert \n                         tonight.\n\n                                     PUFF\n                         Yahoo!\n\n                                     NATHAN\n                         Tomorrow, the acid test.\n\n                                                                    CUT TO:\n\n               INT. RESTAURANT - DAY\n\n               This is a Hooters-type establishment called \"Chester's.\"\n\n               The waitresses are very busty and in Tight t-shirts which \n               are emblazoned with the name of the restaurant. Lila, Nathan, \n               and Puff sit at a table. Puff studies his menu intently, not \n               daring to look up. Lila looks around uncomfortably. A waitress \n               approaches.\n\n                                     CHESTER'S WAITRESS\n                         How you all doin' today?\n\n                                     NATHAN\n                              (cheerily)\n                         Very well.\n\n                                     LILA\n                              (awkwardly)\n                         Very well.\n\n                                     PUFF\n                              (looking down)\n                         Very well.\n\n                                     CHESTER'S WAITRESS\n                         Good enough! What can I get for you?\n\n                                     NATHAN\n                         Puff, why don't you order first?\n\n                                     PUFF\n                              (looking at menu)\n                         Uh, what's a Reuben, please?\n\n               The waitress leans over to study the menu. Her breasts are \n               in Puff's face.\n\n                                     CHESTER'S WAITRESS\n                         The what, honey? Oh, the Reuben? \n                         That's a sandwich with corned beef \n                         and sauer...\n\n                                     PUFF\n                         That's fine. That's what I'll have. \n                         Corned beef is a good food.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY - DAY\n\n               Lila, Nathan, and Puff walk along.\n\n                                     NATHAN\n                         Puff, I'm proud of you! You did \n                         remarkably well under difficult \n                         circumstances.\n\n                                     LILA\n                         Absolutely!\n\n               Puff jumps up and down excitedly.\n\n                                     PUFF\n                         Did I? I tried so hard! I really \n                         concentrated! Oh, I'm so happy!\n\n                                     NATHAN\n                         And because you did so well, we have \n                         a little surprise for you.\n\n                                     PUFF\n                              (happily)\n                         Extra dessert?\n\n                                     NATHAN\n                         Even better.\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Lila, Nathan, and Puff enter. Puff sees his Lucite case.\n\n               It has been transformed into a bachelor pad. Inside is a \n               king-size bed, a TV, a couch, coffee table, shelves lined \n               with books, a small kitchenette. There is a curtain which \n               can be drawn for privacy. Puff is taken aback.\n\n                                     NATHAN AND LILA\n                         Surprise!\n\n               Puff gasps and runs into the room. He is thrilled. Nathan \n               holds up a key.\n\n                                     NATHAN\n                         Free to come and go as you please. \n                         There's some \"mad money\" in the night \n                         table drawer.\n\n                                     PUFF\n                              (taking the key, \n                              hugging Nathan)\n                         It's wonderful! Do you think I'm \n                         ready? Do you really?\n\n                                     NATHAN\n                         I trust that you'll make good, mature \n                         decisions. I trust that you'll do \n                         the proper thing.\n\n                                     PUFF\n                         Oh, I will!\n                              (gravely)\n                         Your very trust has instilled an \n                         enormous sense of responsibility in \n                         me. I don't want to disappoint you.\n\n                                     NATHAN\n                         Good. Remember, when in doubt: Don't \n                         ever do what you really want to do.\n\n                                     PUFF\n                              (taking it in)\n                         Got it.\n\n                                                                    CUT TO:\n\n               INT. LILA AND NATHAN'S LIVING ROOM - NIGHT\n\n               Lila and Nathan sit as far as possible from each other and \n               read books. Nathan looks at his watch.\n\n                                                                    CUT TO:\n\n               INT. PUFF'S CASE - NIGHT\n\n               Puff, dressed identically to Nathan, reads Moby Dick and \n               smokes a pipe. He distractedly taps his foot, stands and \n               studies a Monet print on the wall. His foot is still nervously \n               tapping. He checks his watch.\n\n                                                                    CUT TO:\n\n               INT. LILA AND NATHAN'S LIVING ROOM - NIGHT\n\n               Nathan stands.\n\n                                     NATHAN\n                         I'm going to go down and check on \n                         Puff. See how he's holding up.\n\n                                     LILA\n                              (stretching)\n                         Should I come with?\n\n                                     NATHAN\n                         Nah. You just relax. How's the book?\n\n                                     LILA\n                              (lazily, happily)\n                         Ummm. It's good.\n\n               Nathan kisses Lila on the forehead.\n\n                                     NATHAN\n                         I won't be long.\n\n                                                                    CUT TO:\n\n               INT. CAR - NIGHT\n\n               Nathan drives with a determined look on his face.\n\n                                                                    CUT TO:\n\n               INT. GABRIELLE'S APARTMENT - NIGHT\n\n               The apartment is a mess. Every single light is on.\n\n               Gabrielle is lounging in a stained nightshirt with a dopey \n               cartoon bear on the front. She's got some sort of pimple \n               medication dabbed on her face. She unconsciously but \n               ferociously bites her nails as she watches TV and talks on \n               the phone. There is no trace of a French accent.\n\n                                     GABRIELLE\n                              (into phone)\n                         You're kidding! Holy shit.\n                              (beat)\n                         Yeah, no duh! I had a wild hair up \n                         my ass over that for a month.\n\n               There's a knock at the door.\n\n                                     GABRIELLE\n                         Yeah? What?\n\n                                     NATHAN (O.S.)\n                         Hi. It's Nathan.\n\n               Gabrielle's eyes widen. She jumps up from the couch and starts \n               straightening.\n\n                                     GABRIELLE\n                              (into phone)\n                         Call you back.\n                              (hangs up, assumes \n                              French accent)\n                         You bastard! What do you want?\n\n                                     NATHAN (O.S.)\n                         I just want to talk.\n\n                                     GABRIELLE\n                              (ripping off her \n                              nightshirt)\n                         We have nothing to say! You are a \n                         rotten bastard, that's what!\n\n                                                                    CUT TO:\n\n               INT. HALLWAY - CONTINUOUS\n\n               Nathan stands there leaning against the door.\n\n                                     NATHAN\n                         Please. Just one minute of your time.\n\n                                     GABRIELLE (O.S.)\n                         Why? You've made your decision, Mister \n                         Stinky American! Now I hate you! No, \n                         I don't hate you; I don't even think \n                         about you!\n\n                                     NATHAN\n                         I've got some things to tell you.\n\n                                                                    CUT TO:\n\n               INT. GABRIELLE'S APARTMENT - CONTINUOUS\n\n               Gabrielle is standing in front of a mirror, holding different \n               sexy outfits up to herself, trying to decide.\n\n                                     GABRIELLE\n                         Like what?\n\n                                     NATHAN (O.S.)\n                         Well, I think it would be easier if \n                         I could talk to you in person.\n\n                                     GABRIELLE\n                         What for?\n\n                                                                    CUT TO:\n\n               EXT. HALLWAY - CONTINUOUS\n\n               We hear banging and rustling and arranging coming from inside \n               the apartment.\n\n                                     NATHAN\n                         Well, I think...\n\n                                     GABRIELLE (O.S.)\n                         You think too much. I need a man who \n                         doesn't think so much but acts more \n                         than he thinks... is what I need!\n\n                                     NATHAN\n                         What?\n\n                                     GABRIELLE\n                         You heard me! You make me sick when \n                         you pretend to not understand what I \n                         am saying to you! Go away from here!\n\n                                     NATHAN\n                              (turning away)\n                         Well, look, I'm sorry to have bothered \n                         you.\n\n               He starts to head down the hall.\n\n                                     GABRIELLE (O.S.)\n                              (beat, then screaming)\n                         All right, already! Come in if you \n                         must! The door's open, you son of a \n                         bitch!\n\n               Nathan heads back to the apartment, tries the knob. The door's \n               open. He enters.\n\n                                                                    CUT TO:\n\n               INT. GABRIELLE'S APARTMENT - CONTINUOUS\n\n               The lights are low. The place is neat. Cool jazz plays quietly \n               in the background. Candles are lit. Gabrielle is nowhere to \n               be found. Nathan takes it all in. It's quite seductive.\n\n                                     GABRIELLE (O.S.)\n                         In here, you lousy piece of merde.\n\n               Nathan follows her voice. He exits into the bedroom.\n\n                                                                    CUT TO:\n\n               INT. GABRIELLE'S BEDROOM - CONTINUOUS\n\n               Candles in here also. Gabrielle, now made up and in a satin \n               teddy, lounges in bed, eating cherries from a bowl. Nathan \n               just stares. She is slightly out of breath, but trying to \n               conceal it. A film of perspiration glistens on her brow.\n\n                                     GABRIELLE\n                              (testy)\n                         Well?\n\n                                     NATHAN\n                         God, you're beautiful.\n\n                                     GABRIELLE\n                         Please. I look a mess.\n\n                                     NATHAN\n                         No. You look so beautiful.\n\n                                     GABRIELLE\n                         Anyway. Come already to the point.\n\n                                     NATHAN\n                         I'm... I'm going to leave Lila. I \n                         can't stop thinking about you.\n\n                                     GABRIELLE\n                         I've moved on.\n\n                                     NATHAN\n                         No!\n\n                                     GABRIELLE\n                         I've been seeing Johannsen in \n                         chemistry.\n\n                                     NATHAN\n                              (raging)\n                         That goddamn Neanderthal? I'm the \n                         one who gave him the idea for the \n                         combination bug spray-sun screen! \n                         Did you know that?!\n\n                                     GABRIELLE\n                              (calm, dismissive)\n                         That's not how he tells it.\n\n                                     NATHAN\n                         Of course not, that Swedish thief! \n                         He's a thief of hearts!\n                              (beat)\n                         I love you, Gabrielle.\n\n                                     GABRIELLE\n                              (dismissive)\n                         Hunh.\n\n                                     NATHAN\n                         Just give me some time to let Lila \n                         down easily. She's a really nice \n                         girl and I don't want to hurt her \n                         more than is necessary.\n\n                                     GABRIELLE\n                              (beat)\n                         You hurt me, you know, when you made \n                         Nathan's Choice. Does that not even \n                         matter to you, you pig?\n\n               Gabrielle cries quietly. Nathan moves closer to her. He \n               strokes her hair.\n\n                                     NATHAN\n                         Can you ever forgive me?\n\n               Gabrielle looks up at him. Her expression is noncommittal \n               and pouty, but she grabs his arm and pulls him down on top \n               of her.\n\n                                                                    CUT TO:\n\n               INT. STRIP CLUB - NIGHT\n\n               Puff, dressed a bit like he's a Victorian dandy, sits in the \n               front row and watches a naked woman on stage dancing. A \n               topless cocktail waitress comes by with a fresh drink for \n               him. She takes away his empty glass. He is horribly drunk \n               and holding himself with exaggerated rigidity -- an amateur \n               drinker's attempt to look sober.\n\n                                                                    CUT TO:\n\n               INT. LILA AND NATHAN'S APARTMENT - NIGHT\n\n               Nathan enters. Lila sits on the couch still reading. She \n               looks up.\n\n                                     NATHAN\n                         Hey.\n\n               Nathan kisses her on the forehead.\n\n                                     LILA\n                         You were gone a long time.\n\n                                     NATHAN\n                              (sits down next to \n                              her)\n                         Yeah. Puff and I got into a big, \n                         philosophical discussion. He's really \n                         quite well read, considering he's \n                         only been literate for a month now. \n                         He's going to make us famous, Lila.\n\n                                     LILA\n                         So he's doing okay?\n\n                                     NATHAN\n                         Seemed fine. Quiet evening enjoying \n                         his new digs.\n\n                                     LILA\n                         That's funny because, you know, I \n                         just went and picked him up at some \n                         flophouse on the lower eastside. He \n                         called here when he ran out of his \n                         \"mad\" money after spending an entire \n                         evening drinking, watching strippers, \n                         and fucking a whore!\n                              (then casually)\n                         Oh, and what did you do tonight, \n                         honey?\n\n                                     NATHAN\n                         Shit.\n\n                                     LILA\n                         And what did you do tonight, honey?\n\n                                     NATHAN\n                         I've fallen in love with somebody \n                         else, Lila.\n\n                                     LILA\n                              (pointedly)\n                         And what did you do tonight, honey?\n\n                                     NATHAN\n                         I fucked her! Okay? I fucked her. \n                         I'm sorry. But that's what the hell \n                         I did.\n\n                                     LILA\n                              (standing)\n                         Do you know what I gave up to be \n                         with you?\n\n                                     NATHAN\n                         Yes.\n\n                                     LILA\n                         I gave up my soul, my beliefs. I \n                         gave up my body hair!\n\n                                     NATHAN\n                         Yeah, well, I'm sorry. The human \n                         heart is a strange thing.\n\n                                     LILA\n                         How the hell would you know anything \n                         about the human heart?\n\n                                     NATHAN\n                              (moving to her)\n                         Lila...\n\n               Lila turns around and slugs him, square on the jaw, hard, \n               knocking him to the floor.\n\n                                     LILA\n                         How's that for ladylike, Nathan.\n\n               Lila opens up the hall closet and pulls out a suitcase.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila looks pale and shaken. She smokes.\n\n                                     LILA\n                         For two weeks I holed myself up in a \n                         motel room. I didn't even know who I \n                         was. My world had crumbled. There is \n                         nothing that makes you feel dirtier \n                         than finally deciding to sell your \n                         soul and finding no buyers.\n\n                                                                    CUT TO:\n\n               INT. HOTEL ROOM - DAY\n\n               Lila lies in bed watching TV. She is a mess. The room is a \n               mess. The wig is off. There's hair sprouting on her face.\n\n               The curtains are drawn. There is a knock at the door.\n\n                                     LILA\n                         No maid service! For God's sake, \n                         can't you read the fucking \"do not \n                         disturb\" sign on the fucking doorknob?\n\n                                     ROSE (O.S.)\n                         Lila, it's Rosie.\n\n                                     LILA\n                              (beat)\n                         Go the fuck away, Rosie.\n\n                                     ROSE (O.S.)\n                         Please, honey, let me in.\n\n                                     LILA\n                         Rose, please go away.\n\n                                     ROSE (O.S.)\n                         Lila, I want to help you.\n\n               Lila gets up, drags herself to the door, and opens it. Rose \n               stands there trying not to let it show how lousy Lila looks.\n\n                                     LILA\n                         How'd you know where I was?\n\n                                     ROSE\n                         Nathan told my brother.\n\n                                     LILA\n                         Your brother should have his license \n                         revoked.\n\n                                     ROSE\n                         Yeah, although I'm not going to turn \n                         him in. I like hearing the dirt.\n\n                                     LILA\n                              (suddenly crying)\n                         Why didn't your brother tell you \n                         that Nathan was having an affair?\n\n               Rose holds Lila, who hangs on her as she weeps.\n\n                                     ROSE\n                         I don't know, honey. I don't know. \n                         Maybe he just didn't want to get \n                         involved.\n\n                                     LILA\n                         Oh, Rosie.\n\n                                     ROSE\n                         Let's get you out of here. Come stay \n                         with me until you get your strength \n                         back.\n                              (cheerily)\n                         Free electrolysis, if you want it! \n                         We'll get that face of yours cleared \n                         up in no time.\n\n               Lila mulls it over. She looks back at the hotel room. It's \n               depressing. She sniffs in her snot.\n\n                                     LILA\n                         Yeah. I gotta get myself together. I \n                         want to look good. If I'm gonna fuck \n                         with Nathan, and I am, I want him to \n                         want to fuck me when I do it.\n\n                                                               DISSOLVE TO:\n\n               MONTAGE SEQUENCE\n\n               This sequence is Lila getting her strength back, both \n               emotional and physical. It is intercut with scenes of Nathan \n               and Gabrielle taking Puff on the lecture circuit.\n\n               1) Lila eating a good breakfast.\n\n               2) Lila struggling to do push-ups.\n\n               3) Lila getting electrolysis on her face.\n\n               4) Lila reading Nietzsche.\n\n               5) Lila jogging.\n\n                                                                    CUT TO:\n\n               INT. LECTURE HALL - DAY\n\n               A bearded psychologist addresses a crowd of bearded \n               psychologists.\n\n                                     BEARDED PSYCHOLOGIST\n                         ...and so without further ado, I \n                         give you Dr. Nathan Bronfman and \n                         Puff.\n\n               The room bursts into applause as Nathan and Puff walk out \n               onstage, both in tuxes. Nathan stands behind a podium, Puff \n               sits casually, legs crossed, in a chair.\n\n                                     NATHAN\n                         Thank you. Let's get right to it. \n                         Here we have Puff the day of his \n                         capture.\n\n               A video of Puff naked in his Lucite case, clawing at it, \n               shrieking like a banshee, and neurotically hopping up and \n               down, is projected onto a screen behind Nathan. There is a \n               collective gasp from the audience. Puff watches the video \n               with amused detachment. The video stops.\n\n                                     NATHAN\n                         And here he is today, a scant three \n                         months later.\n\n               Puff stands, bows slightly to the audience. They burst into \n               vigorous applause.\n\n                                     NATHAN\n                         Puff, why don't you say a few words \n                         to the assemblage.\n\n                                     PUFF\n                         It would be my pleasure, doctor.\n                              (behind podium)\n                         Distinguished gentlemen and ladies \n                         of the psychological community, I \n                         stand before you today, a living \n                         testament to the amazing skill of \n                         Dr. Nathan Bronfman. To say that he \n                         took me from crayons to perfume would \n                         be a vast understatement. Dr. Bronfman \n                         took me from playing with my own \n                         feces, then to crayons, and then to \n                         an appreciation of the complex works \n                         of Franz Kline, Joseph Beuys, and \n                         Marcel Duchamp. From compulsive \n                         masturbation to...\n\n                                                               DISSOLVE TO:\n\n               INT. BACKSTAGE - A BIT LATER\n\n               Gabrielle waits in the wings.\n\n                                     PUFF (O.S.)\n                         And, so, goodnight, adieu, until we \n                         meet again, au revoir.\n\n               The audience bursts into thunderous applause. Gabrielle joins \n               in. Nathan and Puff hurry off stage. Gabrielle embraces \n               Nathan.\n\n                                     GABRIELLE\n                         You were wonderful!\n\n                                     NATHAN\n                         Was I? I wasn't a tad stiff?\n\n                                     GABRIELLE\n                         Don't be silly!\n                              (hugs Puff)\n                         And you were wonderful, too! I loved \n                         the way you said \" au revoir.\"\n\n               Puff and Gabrielle exchange a look. She discreetly pinches \n               Puff's butt, smiles, winks. Nathan doesn't see this. He puts \n               his arm around Gabrielle.\n\n                                     NATHAN\n                         Come on, you two. Let's go celebrate!\n\n               Nathan and Gabrielle walk on ahead. Puff tags behind, watching \n               Gabrielle's delightful walk.\n\n                                                               DISSOLVE TO:\n\n               INT. HOTEL ROOM - LATER\n\n               Puff sits up on his bed, looking dejected. He listens to the \n               sounds of Nathan and Gabrielle having sex in the adjoining \n               room. He looks at his watch, gets up, gets dressed.\n\n                                                               DISSOLVE TO:\n\n               INT. X RATED BOOKSTORE - LATER\n\n               A sweaty, sick-looking Puff watches a porno film in a little \n               booth. It ends. He steps out into the fluorescent glare of \n               the store. He walks out past several skulking degenerates.\n\n                                                                    CUT TO:\n\n               EXT. STREET - CONTINUOUS\n\n               Puff exits the bookstore, walks down the street checking out \n               the tawdry hookers. He chooses one. She leads him into a \n               dark alley.\n\n                                                                    CUT TO:\n\n               MONTAGE\n\n               6) Lila in a Tai Chi class.\n\n               7) Lila doing jumping jacks.\n\n               8) Lila reading The Art of War.\n\n               9) Lila doing stomach crunches.\n\n               10) Lila doing chin ups.\n\n               11) Lila swimming laps.\n\n               12) Lila getting more electrolysis.\n\n                                                                    CUT TO:\n\n               INT. LECTURE HALL - DAY\n\n               Puff is on stage demonstrating his ballroom dancing technique. \n               He is waltzing with Gabrielle. Nathan stops the music, and \n               picks up a microphone.\n\n                                     NATHAN\n                         Now the tango.\n\n               Nathan puts a tango record on. Gabrielle and Puff perform \n               expertly. The audience applauds.\n\n                                                                    CUT TO:\n\n               INT. RESTAURANT - NIGHT\n\n               Gabrielle, Nathan, and Puff are eating dinner.\n\n                                     NATHAN\n                         I think it went swimmingly today. \n                         You two make an excellent team.\n\n               Gabrielle and Puff look at each other. She touches Puff's \n               knee under the table. Nathan is busy eating.\n\n                                                                    CUT TO:\n\n               INT. ANOTHER HOTEL ROOM - NIGHT\n\n               Puff paces as he listens to sex noises from the next room.\n\n                                                                    CUT TO:\n\n               EXT. BAD NEIGHBORHOOD - NIGHT\n\n               Puff walks along checking out the prostitutes. He signals to \n               one with a nonchalant jerk of his head.\n\n                                                                    CUT TO:\n\n               MONTAGE\n\n               13) Lila doing one-handed push-ups.\n\n               14) Lila rolling on the ground with a rifle.\n\n               15) Lila, in boxing gloves, punching a bag.\n\n               16) Lila reading the Kama Sutra.\n\n               17) Lila getting electrolysis.\n\n                                                                    CUT TO:\n\n               INT. LECTURE HALL - DAY\n\n               Puff addresses the crowd. Lila and Nathan look on adoringly \n               from the wings.\n\n                                     PUFF\n                         To be taken from the depths of \n                         ignorance and depravity and raised \n                         to heights of culture and refinement! \n                         This is the priceless gift bestowed \n                         upon me by Dr. Nathan Bronfman.\n\n               Thunderous applause.\n\n                                                                    CUT TO:\n\n               INT. ALLEY - NIGHT\n\n               Puff leans against the wall drinking whiskey from a bottle, \n               as a prostitute, down on her knees in front of him, does her \n               business. The look on his face is not one of pleasure or \n               even release. It is a look of decay.\n\n                                                                    CUT TO:\n\n               MONTAGE\n\n               18) Lila does chin ups. Her sweaty, muscular arms glisten in \n               the sun.\n\n               19) Lila wind sprinting.\n\n               20) Lila getting electrolysis. Rose moves away from her.\n\n                                     ROSE\n                         Done!\n\n                                     LILA\n                              (standing triumphantly)\n                         Ready!\n\n                                                                    CUT TO:\n\n               INT. LAB - DAY\n\n               Nathan and Gabrielle, in lab coats, sit chatting with Puff.\n\n               Puff sneaks glances at Gabrielle's legs and cleavage. She \n               makes his viewing possible.\n\n                                     GABRIELLE\n                              (off clipboard)\n                         So we've got seventeen new bookings \n                         for speaking engagements, my wonderful \n                         men.\n\n                                     NATHAN\n                         Terrific. We're all going to be rich \n                         and famous.\n\n               Nathan kisses Gabrielle.\n\n                                     PUFF\n                         Thanks to you, Nate.\n\n                                     NATHAN\n                         Thanks to you, Buddy. And your \n                         diligence and intelligence and \n                         perseverance.\n\n               Puff blushes.\n\n                                     NATHAN\n                              (to Gabrielle)\n                         And of course to you, my sweet, for \n                         your... moral support.\n\n                                     PUFF\n                              (applauding)\n                         here, here.\n\n               Gabrielle kisses Nathan while glancing at Puff. A midget in \n               a business suit enters. It's the sour-looking guy from the \n               freak show.\n\n                                     MIDGET\n                         Excuse me, are you Dr. Bronfman?\n\n                                     PUFF\n                         Is that a little boy?\n\n                                     NATHAN\n                              (teaching)\n                         No, Puff. This man is a midget. In \n                         actuality, they prefer to be called \n                         \"Little People.\" Isn't that correct, \n                         my good man?\n\n                                     MIDGET\n                         Yes sir. Little People.\n\n                                     NATHAN\n                         This Little Person is actually a \n                         fully grown adult man, Puff, believe \n                         it or not, who, due to a genetic \n                         anomaly, is miniature but perfectly \n                         proportioned.\n                              (to midget)\n                         Turn, please.\n\n               The midget turns.\n\n                                     PUFF\n                              (jotting in notebook)\n                         Interesting.\n\n                                     NATHAN\n                         Now, my diminutive friend, what can \n                         I do for you?\n\n               The midget pulls out a gun.\n\n                                     MIDGET\n                         You can get into that goddamn Lucite \n                         bachelor pad for starters, Goliath.\n\n               Nathan, Gabrielle, and Puff look frightened. They stand and \n               back into the case.\n\n                                     MIDGET\n                              (to Puff)\n                         Not you, Joyboy.\n\n               Puff stops in his tracks. Nathan and Gabrielle continue to \n               back into the case.\n\n                                     NATHAN\n                         What is this about? We have no money \n                         on these premises. Please if you are \n                         from some little person terrorist \n                         fringe group...\n\n                                     MIDGET\n                              (loud and scary)\n                         Shut up!\n\n               Nathan and Gabrielle hurry into the case. The midget closes \n               and locks the door behind them. Puff is frozen with fear.\n\n               Lila enters. She looks different now. Savage. Strong.\n\n               Kind of sexy. She wears guerilla-like black clothing and a \n               beret over her closely hacked-off hair. She also carries a \n               gun.\n\n                                     NATHAN\n                         Lila?\n\n                                     GABRIELLE\n                         That's Lila?\n\n                                     LILA\n                         Shut up! Yeah, this is Lila, cunt. \n                         And don't let the hirsutism fool \n                         you. I know more about being a woman, \n                         and more about the black hearts of \n                         men than you, in your pretty little \n                         powdered, bullshit fantasy world, \n                         can ever imagine. I know the darkness \n                         and cruelty of nature, sweetie pie.\n\n                                     NATHAN\n                         Lila, you don't intend to hurt us, \n                         do you?\n\n                                     LILA\n                         Eat shit, thumbtack dick!\n                              (to Midget)\n                         Thank you, Frank. You're the best.\n\n               Lila kisses the midget on the top of the head.\n\n                                     MIDGET\n                         Anything for you, Lila.\n\n                                     LILA\n                         See, Frank and I are kindred spirits. \n                         We both know what it's like to be \n                         shunned because of our appearance. \n                         We both know how easily that turns \n                         into self-hatred.\n\n                                     MIDGET\n                         Amen. Praise the Lord and pass the \n                         ammunition!\n\n               Rose enters hurriedly, carrying rope. She bends over and \n               kisses Frank hard on the mouth for a long moment, then:\n\n                                     ROSE\n                              (to Lila)\n                         Sorry I'm late, parking is a bitch \n                         at this place.\n\n               Lila looks over and sees the two trained mice in the Lucite \n               case sitting at a tiny table and very politely eating their \n               lunch. One of the mice makes eye contact with Lila.\n\n                                                               DISSOLVE TO:\n\n               INT. BATHROOM - NIGHT\n\n               Lila is naked in the bathroom and about to kill herself when \n               she makes eye contact with the mouse on the shelf next to \n               the tub.\n\n                                                               DISSOLVE TO:\n\n               INT. LAB - DAY\n\n               Lila brings her focus back to the room. Everyone is watching \n               her, waiting for some direction.\n\n                                     LILA\n                         Uh, tie them up, Rosie. If you will.\n\n                                     ROSE\n                         With pleasure.\n\n               Frank keeps the gun on Gabrielle and Nathan. Rose enters the \n               case and begins to tie them up and gag them.\n\n                                                               DISSOLVE TO:\n\n               EXT. PARKING LOT - DAY\n\n               Puff is sitting in the car. The electronic collar is back \n               around his neck. Lila holds the black control box, and the \n               Lucite case with the two mice in it. She stands outside the \n               car with Frank and Rose.\n\n                                     ROSE\n                         I'm going to miss you.\n\n                                     LILA\n                         Oh, Rosie.\n\n                                     ROSE\n                         And I'm going to miss the lifestyle \n                         having you as a client has afforded \n                         me.\n\n                                     LILA\n                         Shut up, you.\n\n               Lila laughs and hugs her.\n\n                                     ROSE\n                         I like you so much, with or without \n                         hair.\n                              (confidentially)\n                         But don't spread that around. Bad \n                         for business.\n\n                                     LILA\n                         I'm really glad you two found each \n                         other.\n\n               Frank and Rose put their arms around each other. Frank is \n               exactly crotch-high to Rose.\n\n                                     MIDGET\n                         We're soul mates.\n\n                                     ROSE\n                         Souls have nothing to do with it, \n                         babe.\n\n                                     LILA\n                         I'll be in touch.\n\n                                     ROSE\n                         No you won't. But it's okay. You \n                         have stuff you gotta do.\n\n               Lila tears up. So does Rose. They just stand there for a \n               moment, then:\n\n                                     LILA\n                              (choked)\n                         Gotta go.\n\n               Lila hurries around the car, gets in, and drives off. Rose \n               and Frank embrace. Frank nestles. Rose sighs contentedly.\n\n                                                                    CUT TO:\n\n               EXT. HIGHWAY - AFTERNOON\n\n               Lila's car drives along. Puff looks nervously out the window.\n\n                                                                    CUT TO:\n\n               INT. CAR - EVENING\n\n               Lila and Puff are driving in silence on a dirt road through \n               the woods. Lila pulls off the road, drives to a place where \n               the car will be camouflaged, and parks.\n\n                                     LILA\n                         Stay.\n\n               Puff stays in the car. Lila gets out, pulls the Lucite mouse \n               case from the back seat.\n\n                                                                    CUT TO:\n\n               EXT. CAR - CONTINUOUS\n\n               Lila puts the case on the ground and unlatches it. The mice \n               looks confused at first. Then the male mouse pushes the door \n               open and holds it for the female mouse, who exits. The male \n               mouse follows her, and closes the door behind him. He turns \n               to Lila, nods, then extends his arm for the female mouse to \n               hold on to. She does, and they walk off together on their \n               hind legs into the woods. Lila sighs, and turns to Puff.\n\n                                     LILA\n                         Out.\n\n               Puff gets out casually, then makes a mad dash for the road.\n\n               Lila calmly presses the button on her black box. Puff spasms \n               and falls to the ground.\n\n                                     LILA\n                         Bad.\n\n               Puff stays on the ground, breathing hard.\n\n                                     LILA\n                         Get up.\n\n               Puff does.\n\n                                     LILA\n                         Take off your clothes.\n\n               Puff does. So does Lila. She is covered with hair, except \n               for her face. But whereas Puff is now white and soft-looking, \n               Lila is tan and taut and muscular. This is a reversal of the \n               way both of them were when they first met.\n\n               Puff seems taken with her body.\n\n                                     LILA\n                         We're going back to nature, you and \n                         I. I'm going to retrain you. I'm \n                         going to make you free again if I \n                         have to kill you doing it.\n\n                                     PUFF\n                         But I like being human now.\n\n               Lila shocks Puff. He falls to the ground.\n\n                                     LILA\n                         You what?\n\n                                     PUFF\n                         I want to be the way I was before.\n\n                                     LILA\n                              (sweet)\n                         Good. I'll show you how, apey.\n\n                                                               DISSOLVE TO:\n\n               EXT. WOODS - A BIT LATER\n\n               Puff and Lila have built makeshift shelter out of leaves and \n               twigs. They are sitting around a campfire, naked and dirty, \n               roasting a couple of skinned squirrels on sticks. The black \n               box rests in Lila's lap. Puff looks at the roasting squirrel, \n               is repulsed.\n\n                                     PUFF\n                         Nice night.\n\n                                     LILA\n                         Talking is to be kept to a minimum. \n                         Eventually, when we are ready, there \n                         will be none. Language was invented \n                         so that people could lie to each \n                         other and to themselves. There is no \n                         other reason.\n\n               Puff begins to disagree. Lila's hand hovers over the button. \n               He stops himself.\n\n                                     PUFF\n                              (confused)\n                         I agree?\n\n               Lila shocks Puff.\n\n                                     LILA\n                         You lose. Any answer is the wrong \n                         answer.\n\n                                                               DISSOLVE TO:\n\n               INT. MAKESHIFT SHELTER - NIGHT\n\n               Puff and Lila lie seperately under blankets of moss. The \n               breathing is heavy. Both seem to be sleeping. Puff opens his \n               eyes and tries to extricate himself from the moss without \n               making any noise. Lila presses the button and Puff falls in \n               a quivering mess.\n\n                                     LILA\n                              (whisper)\n                         You'll thank me eventually, Puff. \n                         Well, you won't thank me, because we \n                         won't be speaking, but you'll sort \n                         of thank me with a special look, the \n                         look a dog gives you to let you know \n                         he loves you.\n\n                                     PUFF\n                         What an enchanting picture you paint \n                         of our future together.\n\n               Lila shocks Puff once again. As he spasms, we:\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff testifies.\n\n                                     PUFF\n                         And so commenced my reeducation, \n                         gentlemen. Lila taught me so much. \n                         She was a stern but fair teacher. \n                         And over time, I began to remember \n                         the carefree joy of living in a pure \n                         state of being. But something else \n                         happened as well, something perhaps \n                         distinctly human... I began to fall \n                         in love with Lila.\n\n                                                               DISSOLVE TO:\n\n               EXT. WOODS - DAY\n\n               Lila and Puff are naked and collecting mushrooms and berries. \n               Time has passed. Both Lila and Puff are dirtier and hairier. \n               Puff still wears his collar. Lila bends over to pick a \n               mushroom. Puff looks at her from behind.\n\n                                     PUFF\n                         Boy, you look so good from this ang...\n\n               Lila turns, puts her finger to her lips in a gentle \"no \n               talking\" reminder, then shocks the hell out of Puff. He spasms \n               and falls on top of her, knocking her to the ground.\n\n               He regains his composure, finds himself on top of Lila.\n\n               They look at each other for a moment. Then they kiss. It's a \n               violent kiss. They grope each other. This is primal sex now. \n               In the dirt. Sweaty. Loud grunting. Lila even presses the \n               shock button at the right moment. Puff seems to like it in \n               this context.\n\n                                                                    CUT TO:\n\n               INT. GABRIELLE'S APARTMENT - NIGHT\n\n               Nathan and Gabrielle are in bed, making love. It is gentle, \n               romantic, in good taste -- in direct contrast to the animal, \n               violent sex Puff and Lila are having. They finish. Nathan \n               pulls himself off of Gabrielle and falls onto his back, \n               staring up at the ceiling.\n\n                                     GABRIELLE\n                         A penny for your thoughts, mon cheri.\n\n                                     NATHAN\n                         I don't know. Something's missing.\n\n                                                                    CUT TO:\n\n               INT. DINING ROOM - NIGHT\n\n               Gabrielle, Nathan, and Nathan's parents eat dinner.\n\n               Nathan's parents are in clown make-up. There is a long \n               silence. Nathan is still sad. Gabrielle steals glances at \n               Nathan's parents. Finally Nathan speaks.\n\n                                     NATHAN\n                              (uninterested)\n                         So, Mother and Father, how's Godspell \n                         going?\n\n                                     MOTHER\n                         How did you know we...\n\n               The parents look at each other burst out laughing.\n\n                                     MOTHER\n                         Tell him, Harold.\n\n                                     FATHER\n                         It's going famously, son, famously!\n\n                                     NATHAN\n                              (despondent)\n                         I'm glad.\n\n                                     MOTHER\n                         Harold, ask Nathan what's wrong.\n\n                                     GABRIELLE\n                         Yes, please, somebody ask him what \n                         is wrong.\n\n                                     NATHAN\n                         I don't know.\n\n                                                                    CUT TO:\n\n               INT. BEDROOM - NIGHT\n\n               Nathan and Gabrielle are in bed. Nathan stares up at the \n               ceiling. Finally:\n\n                                     NATHAN\n                         I want our boy back.\n\n                                     GABRIELLE\n                              (sadly)\n                         Oui.\n\n                                     NATHAN\n                         That bitch. I worked so hard. We \n                         worked so hard, you and I. He would've \n                         made us famous.\n\n                                     GABRIELLE\n                         We still have you and I.\n\n                                     NATHAN\n                         I know. And that's great. But it \n                         would be great in a better way, not \n                         a better way but a different way, if \n                         I could find him and bring him back.\n\n                                     GABRIELLE\n                         Where do we look for little lost \n                         Puff?\n\n                                     NATHAN\n                         I have some thoughts. I think that \n                         hairy bitch is somewhere trying to \n                         turn him back into an ape.\n\n                                     GABRIELLE\n                         That is horrible. Apes are dirty. \n                         No?\n\n                                     NATHAN\n                         You better believe they're dirty! \n                         And smelly! And messy! And they don't \n                         know their forks from their assholes!\n\n               Nathan, seemingly in the grips of a sudden horrific migraine, \n               scrunches his face and holds his ears. He relaxes a bit, and \n               gets out of bed. He walks across the room, pulls on some \n               pants, and picks up a container called \"Stop Buggin' Me, \n               Sunny.\"\n\n                                     NATHAN\n                         I'm going alone. This could be \n                         dangerous.\n\n                                     GABRIELLE\n                              (pulling covers up \n                              and turning away \n                              from him onto her \n                              side)\n                         Okay, my sweet. Good night.\n\n                                     NATHAN\n                         A little resistance would be nice, \n                         damn it.\n\n                                     GABRIELLE\n                              (without opening her \n                              eyes)\n                         Please let me go with you.\n\n                                     NATHAN\n                         No.\n\n                                     GABRIELLE\n                         Okay.\n\n                                                               DISSOLVE TO:\n\n               INT. CAR - DAY\n\n               Nathan is driving along a wooded dirt road. He's in his \n               immaculate safari suit. He looks tired. He stops the car, \n               pulls out a gun, and gets out.\n\n                                                                    CUT TO:\n\n               EXT. WOODS - CONTINUOUS\n\n               Nathan gets out of the car and runs into the woods. We follow.\n\n                                     NATHAN\n                              (yelling)\n                         Aha!\n\n               He looks around there is no one there. He sighs and walks \n               back to his car, pulls out a map and marks an area with a \n               red X.\n\n                                                                    CUT TO:\n\n               INT. MOTEL - NIGHT\n\n               Nathan is in his underwear. He is ironing his safari suit as \n               he talks on the phone.\n\n                                     NATHAN\n                         No luck yet, my sweet.\n\n               We see an unfolded map on the bed. There are red X's in almost \n               all the state parks along the east coast.\n\n                                                                    CUT TO:\n\n               EXT. FOREST - EVENING\n\n               Lila and puff are having sex again next to a campfire. Now \n               Lila is wearing the collar, and Puff is giving her well timed \n               shocks. They giggle and kiss after they finish. Puff sits \n               up. He holds his stomach and grunts hungrily. Lila grunts \n               back. She stands and retrieves a sack of berries.\n\n               Puff and Lila greedily, gluttonously stuff their faces.\n\n               Lila takes some berries and smashes them against Puff's face. \n               She laughs heartily. He looks annoyed for a second, but then \n               grabs a handful and squishes them against Lila's face. Pretty \n               soon they are having a berry war and are covered in purple \n               stains. They hug each other, out of breath and laughing.\n\n                                                               DISSOLVE TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila smiles.\n\n                                     LILA\n                         It was paradise.\n                              (beat, sadly)\n                         At least for a tiny little while.\n\n                                                                    CUT TO:\n\n               EXT. FOREST - DAY\n\n               Lila and Puff lie naked in a tree, lazily soaking up the \n               midday sun. There is a rustling in the bushes. They both \n               look up, alert but calm. Nathan, immaculate in his safari \n               suit, appears in the clearing. He holds a gun.\n\n                                     NATHAN\n                         Aha! Finally. I've covered almost \n                         the entire seaboard and parts of \n                         eastern Ohio.\n\n                                     LILA\n                         Ugnh.\n\n                                     PUFF\n                         Ugnh.\n\n                                     NATHAN\n                         Oh please, is that as articulate as \n                         you can be after all the time I spent \n                         teaching you? We've discussed \n                         Wittgenstein, for Christ's sake. Not \n                         that you ever had anything very \n                         original or challenging to say on \n                         the subject.\n\n                                     PUFF\n                         Unn.\n\n                                     NATHAN\n                         Down from the tree. Both of you. \n                         Keep your hands where I can see them. \n                         Don't want you pulling any weapons \n                         out of your fur.\n\n               Nathan laughs heartily, haughtily, at his joke as Lila and \n               Puff climb down from the tree.\n\n                                     NATHAN\n                         Look at you two. You both disgust \n                         me.\n\n                                     LILA\n                         Oook. Oook.\n\n                                     NATHAN\n                         Shut up!\n                              (to Puff)\n                         I gave you... life. I created you in \n                         my image, Puff. I took you from this \n                         primordial ooze and brought you into \n                         the world of culture and art and \n                         manners. And this is how you repay \n                         me? By heading back to the ooze first \n                         chance you get? I should leave you \n                         here with Lila the ape woman. It \n                         would serve you right, you ungrateful \n                         piece of crap. But I'm not going to. \n                         You're too valuable to me. Totally \n                         selfish of me. You serve my purpose. \n                         But if you had any smarts you would \n                         realize that I serve your purpose as \n                         well. Life is so much more delightful \n                         when lived in a silk suit.\n\n                                     LILA\n                         Ooka.\n\n                                     NATHAN\n                         Don't worry, Lila. You can stay. I \n                         don't have any interest in you \n                         anymore.\n                              (to Puff)\n                         C'mon, monkey boy.\n\n               Puff looks at Lila. Lila shrugs helplessly. Puff reaches out \n               to touch her hand.\n\n                                     NATHAN\n                         Now!\n\n               Puff looks at Lila again. She jerks her head in the direction \n               of Nathan. Puff sighs and moves to Nathan.\n\n               Nathan prods Puff, and they head off through the trees.\n\n               Suddenly Puff elbows Nathan. Nathan grunts, doubles over.\n\n               Puff turns, lunges, and the two wrestle on the ground.\n\n               Puff pries the gun from Nathan's hand, and jumps up. Nathan \n               stands also, backing away. Puff has the gun trained on Nathan. \n               Lila runs to Puff, stands behind him.\n\n                                     NATHAN\n                         Puff, put the gun down.\n\n                                     PUFF\n                         Ounpoo. Ungh.\n\n                                     NATHAN\n                         Let's be reasonable human beings \n                         here. We're all reasonable human \n                         beings, aren't we?\n\n                                     PUFF\n                              (jumping up and down \n                              like a chimp)\n                         Unka unka unka unka unka.\n\n                                     NATHAN\n                         Look, why don't you and Lila stay \n                         here and have your natural life. \n                         I'll just go on my way. You'll never \n                         see me again.\n\n                                     PUFF\n                              (to Lila, guiltily)\n                         I have to talk. Is that okay?\n\n               Lila nods.\n\n                                     PUFF\n                              (to Nathan)\n                         You did create me in your image, \n                         Nathan. Before you I was a simple, \n                         happy, complete being, in harmony \n                         with the world around me. After you \n                         I became duplicitous, cynical, angry, \n                         anal, totally out of touch with my \n                         surroundings. In a word, Nathan, I \n                         became you. Lila has reintroduced me \n                         to myself. And, incidentally, what \n                         I'm about to do, kill you, is \n                         something that would never have \n                         occurred to me to do as a creature \n                         of the Earth. Before when I killed, \n                         it was for food or in self-defense. \n                         Now I will kill for revenge. Revenge \n                         is an abstract concept, Nathan. And \n                         I learned abstract thinking from \n                         you.\n\n                                     NATHAN\n                         No.\n\n                                     LILA\n                         Puff, don't.\n\n               Puff shoots. A crow screams. The fluttering of wings. The \n               bullet hits Nathan in the head. He falls.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - NIGHT\n\n               Lila sobs.\n\n                                     LILA\n                         Then I shot Nathan.\n\n                                                                    CUT TO:\n\n               INT. AUDITORIUM - DAY\n\n               Puff dabs his eye.\n\n                                     PUFF\n                         Then Lila shot Nathan.\n\n                                                                    CUT TO:\n\n               INT. WHITE SPACE - DAY\n\n               Nathan talks.\n\n                                     NATHAN\n                         Then Puff shot me. Then I died. That's \n                         all I know. That's the end of my \n                         story. Do I get to go to heaven now?\n                              (beat)\n                         Or is it... hell?\n                              (beat)\n                         Or... what?\n                              (beat)\n                         I just stay here, is it? I just stay \n                         here and tell it again? And after \n                         that? Again? And after...\n                              (sighs)\n                         Yes. Yes, of course.\n                              (sighs, clears his \n                              throat)\n\n               We move into an extreme close-up.\n\n                                     NATHAN\n                              (beginning again)\n                         I don't even know what sorry means \n                         anymore. It's odd. When I was alive \n                         I knew -- maybe it was all I knew...\n\n                                                               DISSOLVE TO:\n\n               EXT. FOREST - DAY\n\n               Lila runs to Nathan. She kneels beside him.\n\n                                     LILA\n                         He's dead.\n\n                                     PUFF\n                              (calmly)\n                         We bury the body. We disappear into \n                         the woods. Nobody knows.\n\n                                     LILA\n                              (beat, then quietly)\n                         No. This is the end of the road. \n                         There's a dead human being here. For \n                         all of his faults, he was a human \n                         being, and certainly a victim of his \n                         culture as much as anybody.\n\n                                     PUFF\n                         Forget him, Lila. We'll disappear. \n                         We'll never talk about it again. \n                         We'll never talk again period. I \n                         love you.\n\n                                     LILA\n                         Puff, what happened to you is as \n                         much my fault as Nathan's. Maybe \n                         more so, because I knew it was wrong \n                         and I went along with it anyway. I'm \n                         taking responsibility for the murder. \n                         I want you to go back to your old \n                         life.\n\n                                     PUFF\n                         I won't let you do that. I shot the \n                         bastard. And I'm glad.\n\n                                     LILA\n                         No. Go back to the woods. This is a \n                         sacrifice I need to make. In my world \n                         we have something called penance. \n                         It's another abstraction, but I had \n                         the concept drummed into my head \n                         during my years in the convent. It \n                         doesn't exist for you, and it \n                         shouldn't. See, I could never be \n                         free again anyway, so I might as \n                         well be in jail.\n\n                                     PUFF\n                              (beat)\n                         Then I'll live for both of us, Lila. \n                         I'll be the most free, truest animal \n                         in the whole forest. For both of us.\n\n                                     LILA\n                              (tearing up)\n                         That's what I'm counting on.\n\n                                     PUFF\n                              (an idea)\n                         But first I'll live among them, just \n                         long enough to testify before congress \n                         about the waywardness of humankind.\n\n                                     LILA\n                              (shrugs)\n                         Okay. If you think it will help.\n\n                                                                    CUT TO:\n\n               INT. JAIL - DAY\n\n               Lila, now in prison coveralls, sits in a dayroom with other \n               women convicts. She is watching a TV mounted on the wall.\n\n               Puff is testifying.\n\n                                     PUFF\n                         And so, gentlemen, that is my story. \n                         I agreed to testify before this \n                         committee because I hoped to convey \n                         to the American public that there is \n                         indeed a paradise lost. Human beings \n                         have become so enamored of their \n                         technologies and their intellectual \n                         prowess and their fancy gourmet foods, \n                         that they've forgotten to look to \n                         the Earth as a teacher. This is \n                         hubris, my friends. And my story of \n                         destruction and betrayal is proof of \n                         that. I will keep my promise to Lila. \n                         I will shed this suit and go back \n                         into the wilderness. I will live out \n                         my days naked and free.\n\n                                     CONGRESSMAN\n                         Thank you, sir. Your story has touched \n                         us all deeply. We will pass some \n                         legislation addressing this problem.\n\n                                     PUFF\n                         Thank you. That is all I ask.\n                              (to camera)\n                         Good-bye, Lila. I take you with me \n                         in my untamed heart.\n\n               Puff stands and exits the auditorium. Flashbulbs flash.\n\n               In the prison common room, Lila wipes a tear from her eye.\n\n               She seems genuinely happy. She looks out a small barred window \n               and sees a bluebird light there, then fly away.\n\n                                                                    CUT TO:\n\n               EXT. WASHINGTON STREET - DAY\n\n               Puff walks along, a man on a mission. As he walks he sheds \n               articles of clothing. He is followed by reporters and \n               cameramen and celebrity hounds. Soon he is naked.\n\n                                                                    CUT TO:\n\n               EXT. SUBURBAN STREET - DAY\n\n               Puff walks along, naked. People cheer from porches.\n\n                                                                    CUT TO:\n\n               EXT. RURAL ROAD - DUSK\n\n               Puff walks along. He is still followed by reporters. Cows \n               watch the parade.\n\n                                                                    CUT TO:\n\n               EXT. FOREST - EVENING\n\n               Puff walks along a dirt road. He is about to disappear into \n               the forest. An older woman rushes out from the crowd.\n\n                                     OLDER WOMAN\n                         Wait!\n\n                                     PUFF\n                              (turning)\n                         Yes?\n\n                                     OLDER WOMAN\n                         I saw you on C-Span. I've been looking \n                         for you for thirty years. Then there \n                         you were, such a beautiful, beautiful \n                         grown man.\n\n               The older woman starts to cry.\n\n                                     PUFF\n                         Mother?\n\n                                     OLDER WOMAN\n                         Yes... Derek.\n\n               Puff holds out his hand for her to shake. Flashbulbs flash.\n\n                                     PUFF\n                              (formally)\n                         It's a pleasure to meet you, mother. \n                         But I'm an ape like dad was...\n                              (checks watch)\n                         And I have to go back into the woods \n                         now... forever.\n\n                                     OLDER WOMAN\n                              (resigned)\n                         Yes, I suppose so. I suppose I knew \n                         that was going to be what you would \n                         say. It's good to see you again \n                         though.\n\n                                     PUFF\n                         Yes.\n\n                                     OLDER WOMAN\n                         I'm in the book, if you ever want to \n                         drop me a line or something.\n\n                                     PUFF\n                         I'm an ape, mom. I'm an ape. And \n                         apes don't drop lines.\n\n               His mother weeps. Puff gently rests his hand on her shoulder \n               for a moment, then he turns and waves to the reporters. The \n               crowd bursts into applause. Flashbulbs flash. Puff jogs into \n               the woods. There is a collective sigh, and then everyone \n               turns and heads back in the direction from which they came. \n               We hold on the woods for a moment. A car pulls up. Puff \n               hurries out of the woods and jumps in the passenger side of \n               the car.\n\n                                                                    CUT TO:\n\n               INT. CAR - CONTINUOUS\n\n               Puff leans over and kisses Gabrielle, who is driving the \n               car.\n\n                                     GABRIELLE\n                         Hello, my little boy.\n\n                                     PUFF\n                         Hey, ma. Did you bring any clothes? \n                         I'm freezing my ass off.\n\n                                     GABRIELLE\n                         Oui. Nathan's silk suit, just like \n                         you asked.\n\n                                     PUFF\n                         Great.\n                              (putting on suit)\n                         God, I've wanted you forever.\n\n               Gabrielle giggles. Puff kisses her.\n\n                                     GABRIELLE\n                         Say my name.\n\n                                     PUFF\n                         Gabrielle.\n\n                                     GABRIELLE\n                              (eyes glistening)\n                         You remind me so much of Nathan.\n\n                                     PUFF\n                         Like father, like son.\n\n                                     GABRIELLE\n                              (stroking his face)\n                         You remind me so much of Nathan plus \n                         so much of my little mongrel doggie.\n\n                                     PUFF\n                         Woof.\n\n               This turns Gabrielle on. She kisses him passionately. When \n               the kiss runs its course, Puff speaks.\n\n                                     PUFF\n                         Arf.\n\n               Gabrielle kisses him again, even more passionately this time\n\n                                     PUFF\n                         As much as I loved Nathan, I'm not \n                         sorry she killed him, if it means I \n                         can have you. Is that a terrible \n                         thing to say, my sweet?\n\n                                     GABRIELLE\n                              (putting her finger \n                              to his lips)\n                         Hush. No, it is never terrible to be \n                         in love. Nathan's memory lives on in \n                         our sacred union.\n                              (beat)\n                         I'm not sorry she killed him either. \n                         Nathan was wonderful. He was erudite \n                         and sophisticated and charming. You \n                         are all that, too. But you have \n                         something more. You have a bit of \n                         the animal in you.\n\n               They smile flirtatiously at each other. Puff leans over and \n               kisses Gabrielle's neck.\n\n                                     PUFF\n                         Let's go eat, I'm starved.\n\n                                     GABRIELLE\n                         French?\n\n                                     PUFF\n                         Oui.\n\n                                                                    CUT TO:\n\n               EXT. DIRT ROAD - NIGHT\n\n               The car makes a screeching u-turn. It disappears in the \n               direction of the city. When the dust clears, we see the two \n               white mice standing there on the side of the road, shivering \n               and emaciated. The male holds out his the thumb and the female \n               holds a tiny little sign which reads: New York.\n\n               There is a look of hopelessness in their beady black eyes.\n\n               FADE OUT.\n\n                                         THE END\n\n\n\n\nHuman Nature\nWriters :   Charlie Kaufman\nGenres :   Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:27:15.269322"}