{"title": "I am Sam", "film_link": "/Movie Scripts/I am Sam Script.html", "script_link": "/scripts/I-am-Sam.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>I am Sam Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/I-am-Sam.jpg\" title=\"I am Sam Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  Provided me with 2 laughs and not much else.<br/><br/>\n<b>IMSDb rating</b><br/>  <img src=\"/images/rating/3-stars.gif\"/> (3 out of 10)<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (9.68 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Kristine Johnson\" title=\"Scripts by Kristine Johnson\">Kristine Johnson</a><br/>  <a href=\"/writer.php?w=Jessie Nelson\" title=\"Scripts by Jessie Nelson\">Jessie Nelson</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Movie Release Date</b> : January 2002<br/>\n<br/>\n<a href=\"/scripts/I-am-Sam.html\">Read \"I am Sam\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<b>                                       \"I AM SAM\"\n</b>\n                                      Screenplay by\n\n                                     Kristine Johnson\n\n                                      Jessie Nelson\n\n<b>                                           2001\n</b>\n<b>                                      SHOOTING DRAFT\n</b>\n\n\n<b>            INT. STARBUCKS - 7:30 A.M.\n</b>\n            We're watching a pair of hands arrange white sugar packets,\n            blue Equal packets, and pink Sweet and Low into small\n            containers.  With precision and lightning speed, the mixed up\n            colors and crumpled packets are transformed into neat little\n            color-coded rows.  Wait, this container has three Equals and\n            four Sweet 'n' lows.  The hand quickly plucks the mutant\n            Sweet 'n' Low.  There.  Symmetry.\n\n            We move up those hands and meet SAM DAWSON as he surveys his\n            domain.  Something about him.  He's extremely compelling,\n            uniquely handsome.  But it's more than that.  Those eyes,\n            they sparkle with the wonder of a child.  Life's cynical edge\n            has not etched it's path across this face.  They light on a\n            COFFEE CUP held by one of the Regulars.\n\n<b>                                SAM\n</b>                      Double double decaf low-fat Cap.\n\n<b>                                BRUCE\n</b>                      You got it, buddy.\n\n<b>                                SAM\n</b>                      Good choice very good choice.\n\n            Sam moves along, commenting to CUSTOMERS as he places Sweet\n            'n Lows on tables, the self-appointed host of Starbucks.\n\n<b>                                SAM (CONT'D)\n</b>                      Mocha rumba Frappuccino no whipped, half\n                      low, half non.  Excellent choice.  Very\n                      good choice.\n\n            He stops in front of sale mugs and turns them so that the\n            logos all face the same way.  His boss GEORGE approaches.\n\n<b>                                GEORGE\n</b>                      Sam, they called.  It's time for you to\n                      go.\n\n            Sam FREEZES, but doesn't turn around.\n\n<b>                                GEORGE (CONT'D)\n</b>                      Sam, did you hear me?\n\n<b>                                SAM\n</b>                      \"It's time for you to go.\"\n\n<b>                                GEORGE\n</b>                      Yes.\n\n<b>                                SAM\n</b>                      It's time.\n\n<b>                                GEORGE\n</b>                      Good luck.\n\n            Without another word, Sam walks straight out the door.\n\n<b>            EXT. LOS ANGELES STREET - DAY\n</b>\n            Sam, still in his white apron, walks down the busy street. \n            He has a fast, loping gait that doesn't slow or hesitate for\n            anyone. A COUPLE argue on the sidewalk.  Sam WALKS RIGHT\n<b>            BETWEEN THEM.\n</b>\n<b>                                SAM\n</b>                      It's time.  It's time.\n\n            Sam keeps moving, he crosses the street without stopping. \n            Traffic SCREECHES to a HALT!  Cars HONK, a taxi driver YELLS.\n\n<b>                                SAM (CONT'D)\n</b>                      It's time, it's time for you to go.\n\n<b>            INT. HALLWAY - LATER\n</b>\n            Sam plows down the hall and comes to room 324.\n\n<b>                                SAM\n</b>                      Rebecca!\n\n            Sam pushes the DOOR OPEN.  And we REALIZE we are entering: A\n<b>            HOSPITAL LABOR DELIVERY ROOM AT LA COUNTY HOSPITAL.\n</b>\n            REBECCA is in the middle of a major contraction.  Her face is\n            the opposite of Sam's.  Hardened.  She lets out a scream that\n            stops Sam dead in his tracks.  GERTIE, a no-nonsense Black\n            Nurse, looks up from the monitor.\n\n<b>                                GERTIE\n</b>                      You the one responsible for this?\n\n            Sam nods, taking Gertie quite literally.\n\n<b>                                SAM\n</b>                      I'm sorry.\n\n<b>                                GERTIE\n</b>                      Too late for sorries, daddy, get over\n                      here and hold her hand.\n\n            Sam reaches for Rebecca's hand.  She pulls it away.  ANOTHER\n            CONTRACTION - Rebecca screams.  Sam SCREAMS.\n\n<b>                                NURSE\n</b>                      You got a live one, Gert.\n\n<b>            INT. LABOR ROOM - LATER\n</b>\n<b>                                DR. JAMISON\n</b>                      Okay, this is it!\n\n<b>                                SAM\n</b>                          (spins in circles)\n                      This is it!  This is it!\n\n<b>                                DR. JAMISON\n</b>                      And it's a girl...\n\n            The BABY lets out her first cry.  Sam watches, awestruck. \n            Gertie wraps the baby in a blanket and holds her out to\n            Rebecca.  Rebecca shakes her head - NOT NOW.  Gertie walks\n            over to Sam.\n\n<b>                                GERTIE\n</b>                      There's someone who's been waitin' an\n                      awful long time to see you, Sam.\n\n            She places the BABY into SAM'S ARMS.  Suddenly Sam's whole\n            body RELAXES and becomes very still.  He looks to Rebecca,\n            but she has turned away.  He meets Gertie's eyes.  Then in\n            quiet amazement:\n\n<b>                                SAM\n</b>                      This is it.\n\n<b>                                GERTIE\n</b>                      What's her name?\n\n<b>                                SAM\n</b>                          (looks at clock)\n                      Let me see let me see let me see. \n                      12:17, March 2nd.  Lucy in the Sky with\n                      Diamonds.  Recorded March 2nd.  1967. \n                      Lyrics by John Lennon, music by Paul\n                      McCartney.  Lucy Diamond Dawson.\n\n            We hear LIKE A LULLABY, \"Picture yourself on a boat in a\n            river with tangerine trees and marmalade skies...\"\n\n<b>            EXT. HOSPITAL - NEXT MORNING\n</b>\n            Sam, holding the baby, and Becca, having just checked out,\n            walk down the steps of the hospital holding their\n            complimentary plastic baby bag.  Sam is nervous haling the\n            precious cargo and Becca is agitated.  They see the bus\n            pulling up and down the street and Sam moves quickly so they\n            can hurry and catch it.  As he approaches the bus, he looks\n            to Becca by his side, but she is not there.  He looks around\n            and no sign of her. \n            Frantically turning in a full circle, he sees the fabric of\n            her dress disappearing into the crowd down the street.  He\n            screams.\n\n<b>                                SAM\n</b>                      Becca!  Becca!\n\n            The more he screams the faster she moves away.  Till there's\n            no trace of her.  Sam stands in the middle of the busy block\n            holding Lucy to his chest, devastated.\n\n            We hear, \"Look for the girl with the clouds in her eyes, but\n            she's gone.\"\n\n<b>                                                           SMASH CUT TO:\n</b>\n<b>            INT. BUS - NIGHT\n</b>\n            Sam holds the now sleeping baby to his chest.  Next to him is\n            the plastic bag from the hospital containing diapers, two\n            cans of formula and a half empty bottle of milk.  Sam is\n            surrounded by PASSENGERS, the eerie world of the underground\n            at night.  Instinctively, Sam holds her even tighter, two\n            against the world.\n\n<b>            INT. SAM'S APARTMENT - DAWN\n</b>\n            A marvel of organization.  A closet reveals clothes on\n            hangers exactly equidistant from each other; precisely folded\n            T-shirts, underwear and socks organized by color.  A\n            carefully systemized record collection fills makeshift\n            bookshelves.\n\n            Beatles posters from every era decorate the walls.  Becca's\n            things sit in one corner.  An island of chaos in an \"Hold\n            Everything\" showroom.  The kitchen counter has been\n            transformed into a changing table.  Bottles and pacifiers\n            lined up next to a stack of cloth diapers.  Underneath, a\n            clothes line of baby clothes.\n\n            The sound of a CRYING BABY breaks the silence.  The camera\n            follows and finds the CRADLE: a DRAWER tucked snugly into a\n            blanket hanging like a hammock between two chairs.  An\n            exhausted SAM POPS up from his bed, behind the hammock.  He\n            swings the hammock, hoping against hope the baby will go back\n            to sleep.\n\n<b>                                SAM\n</b>                      Didn't you just fall asleep, little\n                      girl?\n                          (Lucy cries harder)\n                      Okay, if you say it's time to get up,\n                      then it's time to get up, time to get\n                      up.\n                          (Sam sniffs the air)\n                      Oh my, oh my, oh my.  Quite a bit of\n                      business.\n\n            He rushes over to the kitchen counter and unsnaps the baby's\n            pajamas, revealing a cloth diaper held together with\n            promotional buttons: one says \"Hertz, #1 for Car Rentals\",\n            the other a picture of Magic Johnson and reads \"Go, Lakers,\n            Go!\"  Sam undoes it.\n\n<b>                                SAM (CONT'D)\n</b>                      Oh my God, oh my God, oh my God.  Let me\n                      see let me see let me see.\n\n            Sam attempts to clean and diaper her.  He finally manages to\n            pin the buttons so that it at least stays on.\n\n<b>                                SAM (CONT'D)\n</b>                      You look very beautiful this morning,\n                      very beautiful.\n\n            He holds her up, and the diaper falls down around her ankles.\n\n<b>                                                                 CUT TO:\n</b>\n            We pan across a row of diapers on a supermarket shelf:\n\n<b>            HUGGIES, PAMPERS, EXTRA ABSORBENT PAMPERS, LUVS...\n</b>\n<b>            INT. WALMART - DAY\n</b>\n            Sam stares at the \"Great Wall of Diapers\", awed.  He reaches\n            for the Pampers, balancing Lucy, then the Luvs, no, the\n            Huggies.  Sam stops moving, Lucy starts CRYING, so he jogs in\n            place.  Sam decides on one of each.  He heads to the FORMULA\n            AISLE.  Gerber, Carnation, Carnation Iron Fortified.  He\n            stops.  Lucy WAILS.  WE HEAR THE SONG \"HELP, I NEED SOMEBODY\"\n\n<b>            INT. SAM'S APARTMENT - 9 P.M.\n</b>\n            Sam paces, carrying Lucy who screams at the top of her lungs.\n\n<b>            INT. SAM'S APARTMENT - 11:25 P.M.\n</b>\n            Sam rocks the CRYING BABY in the hammock.  He's exhausted,\n            but she's just getting started.  He puts another blanket on\n            her.\n\n<b>            INT. SAM'S APARTMENT - 1:30 A.M.\n</b>\n            Peace.  A punch-drunk Sam lays the sleeping baby into the\n            cradle as if she were a bomb that might detonate. \n            He tiptoes, his FIST raised victoriously - \"YES!\"  He doesn't\n            get two steps before Lucy wakes screaming.  Defeated, he\n            picks her up.  HELP.  The PHONE RINGS.  HE PRESSES speaker.\n\n<b>                                RASPY WOMAN (O.S.)\n</b>                      What the hell are you doing to that\n                      baby?!\n\n            He looks out his window and sees ANNIE CASSELL, his neighbor\n            on the phone, watching him through her window.  She is a\n            strange creature with very thick glasses.  We sense a\n            uniquely profound intelligence behind all that armor.\n\n<b>                                SAM\n</b>                      Everything's so tiny, tiny.  Tiny. \n                      Everything.  Won't you please come over? \n                      Help.  I need somebody.  Won't you\n                      please please help me.\n\n<b>                                ANNIE\n</b>                      You know I can't do that.  What does her\n                      mother say?\n\n<b>                                SAM\n</b>                      Her mother?  Her mother said \"This isn't\n                      my life.  I'm outta here when she comes. \n                      It didn't mean anything, Sam.  It was\n                      just one night.  The two of you.  That's\n                      all I need...\" Annie, what if she's\n                      sick?\n\n<b>            EXT. HALLWAY - CONTINUOUS\n</b>\n            ANNIE has her door open a crack.  Annie feels the baby's\n            forehead.  Lucy stares up at her, quiet now, fascinated.\n\n<b>                                ANNIE\n</b>                      She's overheated and not eating enough. \n                      How often are you feeding her?\n\n<b>                                SAM\n</b>                      A lot, Gerber, Carnation, Gerber.\n\n<b>                                ANNIE\n</b>                      What's a lot?\n\n<b>                                SAM\n</b>                      Breakfast, lunch, and dinner.  Three\n                      squares hot.\n\n<b>                                ANNIE\n</b>                      Babies need food every two hours, Sam.\n\n<b>                                SAM\n</b>                      Oh.  I'm sorry Lucy Diamond.\n<b>\t\t\t\t\t  \n</b><b>                                ANNIE\n</b>                      What time does the little diamond wake\n                      up?\n\n<b>                                SAM\n</b>                      She never really goes to sleep.\n\n<b>                                ANNIE\n</b>                      Okaaaay.  Well, let's assume she's up at\n                      six.  Keep your TV on Nickelodeon.  I\n                      want you to feed her first while\n                      \"Bewitched\" is on.  Then again, when\n                      \"Hogan's Heroes\" starts.  After that,\n                      well until \"Father Knows Best...\"\n\n<b>                                                                    CUT:\n</b>\n<b>            INT. SAM'S APARTMENT - EVENING\n</b>\n            We are watching \"Hogan's Heroes\".  We hear SHULTZ'S INFAMOUS\n            RESPONSE: \"I know nothing, absolutely nothing!\"  Sam feeds a\n            content Lucy.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            INT. SAM'S APARTMENT - LATER\n</b>\n            \"Father Knows Best\" on TV.  Lucy blissfully falls asleep in\n            Sam's arms.  Euphoric, he tiptoes to the cradle and places\n            her ever so gently, when suddenly, the FRONT DOOR FLIES OPEN.\n\n            Sam's BEST FRIENDS DESCEND inside: IFTY, a Pakistani\n            gentlemen with a gentle face and a wide smile, carrying a\n            large stuffed giraffe with a bow on it.  BRAD, who sees\n            himself as a real ladies man, in tight jeans and a Farrah\n            Fawcett T-shirt; and ROBERT, highly paranoid, thinks the\n            world's out to get him.  Lucy WAILS.  Sam RUNS to the CRIB.\n\n<b>                                SAM\n</b>                      What are you doing here now?!  Her first\n                      sound sleep, not a sound, not a sound.\n\n<b>                                BRAD\n</b>                      Eight years every Thursday Video Night\n                      and you forgot?!\n\n<b>                                SAM\n</b>                      Oh my god, Video Night.  First Thursday\n                      of the month.  Video night at Sam's\n                      house.  I'm sorry, I forgot.\n\n<b>                                IFTY\n</b>                      Becca's gone.  \"Gone with the Wind\" is a\n                      very sad movie.\n\n<b>                                ROBERT\n</b>                      Oh here we go...Everything changes now. \n                      Soon you'll forget about Wednesday night\n                      Denny's and Friday night Karaoke.  And I\n                      got hit by a car today.\n\n<b>                                SAM\n</b>                      You did?\n\n<b>                                ROBERT\n</b>                      It's probably that guy from the V.A.\n\n<b>                                BRAD\n</b>                      What guy?\n\n<b>                                ROBERT\n</b>                          (closing window)\n                      I can't discuss it.  And now this.\n\n            Ifty makes ORIGAMI BIRDS out of newspapers.  Lucy's rapt.\n\n<b>                                SAM\n</b>                      She looks smart, doesn't she?\n\n<b>                                IFTY\n</b>                      Of course, look.  She's already reading\n                      the newspaper.  I have five smart\n                      sisters in Pakistan.  I am only brother. \n                      \"Seven Brides for Seven Brothers\" was a\n                      wonderful movie I forgot to bring last\n                      week for Video Night...\n\n<b>                                BRAD\n</b>                      Did you get \"Blade Runner\" for tonight?\n\n<b>                                ROBERT\n</b>                      Now it's all my fault?!\n\n<b>                                BRUCE\n</b>                      Don't tell me you forgot again.  I broke\n                      a date with a daydream to come here.\n\n            There's a knock at the door.  Ifty goes to get it.  Brad\n            moans when he sees his 65 YEAR OLD MOTHER, ESTELLE, standing\n            in the doorway.\n\n<b>                                BRAD\n</b>                      Mom!  I told you Video Night's over at\n                      nine!  It's only six-thirty!\n\n<b>                                ESTELLE\n</b>                          (unaware of the baby)\n                      Sorry.  I'll wait in the lobby.\n\n            She exits.  Lucy begins to CRY.  Brad takes her - like a hot\n            potato, Robert takes her - now Ifty runs around in circles.\n\n<b>                                IFTY\n</b>                      She needs motion.  My father drove my\n                      sisters in his taxi to get them to go to\n                      sleep.  Two-fifty surcharge on all\n                      taxi's from the airport...\n\n<b>                                ROBERT\n</b>                      I got hit by a taxi on Tuesday.\n\n            And it all starts again and we --\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. BUS - NIGHT\n</b>\n            An empty bus makes its way through the city at night.\n\n<b>            INT. BUS - NIGHT\n</b>\n<b>                                BUS DRIVER\n</b>                      Main and Temple...again.  She out yet?\n\n            The camera moves along and stops on the long seat at the\n            back.  Sam lies with Lucy spooned into the crook of his arm,\n            almost asleep.\n\n<b>                                SAM\n</b>                      Almost there, almost there.  One more\n                      round and she'll be down for the night.\n\n            We hear the song \"Golden Slumbers\".  In a SERIES OF\n            DISSOLVES, we see Lucy and Sam in DIFFERENT SLEEPING\n            POSITIONS on the bus seat.  Gradually, she GROWS in HIS\n<b>            PROTECTIVE EMBRACE --  \n</b>\n            ONE MONTH,  THEN TWO.  NOW FIVE.  She's BIG AND ROUND at SIX\n            MONTHS.  And on and on into the night...\n\n<b>            INT. WALMART'S PHOTO BOOTH - DAY\n</b>\n            We see Sam and Lucy CRAMMED into the booth, wearing birthday\n            hats, taking HER FIRST BIRTHDAY picture.  We see the PHOTO\n            STRIP as it comes out of the slot.  Sam's shoulder with\n            Lucy's ear - Lucy's nose with Sam's elbow, their faces never\n            made it into the picture.\n\n<b>            INT. STARBUCKS - 8:30 A.M.\n</b>\n            The place is packed.  Sam moves from table to table,\n            cleaning.\n\n<b>                                SAM\n</b>                      Double macciatto, low foam, low-fat. \n                      Good choice, very good choice.\n\n            Sam turns and WE SEE LUCY attached to him in a handmade\n            snugly, crocheted by Annie.  She faces outward, all hands,\n            all 16 MONTHS of her; too big for the snugly.  She grabs a\n            croissant from a customer.  George looks confused.  Then\n            makes a SWIPE for a customer's coffee, knocking it to the\n            ground.  It SPLATTERS all over an anorexic, on-her-fourth\n            double-latte WOMAN in a designer exercise outfit.  She begins\n            shrieking.  George looks at Sam, this can't go on.\n<b>\t\t\t\n</b><b>            INT. APARTMENT HALLWAY - MORNING\n</b>\n            Sam, Lucy by his side, has his foot in Annie's door.\n\n<b>                                SAM\n</b>                      Please, Annie!  She's too big to take to\n                      work.\n\n<b>                                ANNIE\n</b>                      I'm not a baby-sitter.  I'm too busy.\n\n<b>                                LUCY\n</b>                      Annie, Annie, Annie...\n\n<b>                                ANNIE\n</b>                          (suspicious)\n                      Did you teach her that?\n\n<b>                                SAM\n</b>                      It was her first word.  Very first word.\n\n            Annie opens the door, takes Lucy's hand, and pulls her in.\n\n<b>                                ANNIE\n</b>                      And people worry you're not smart.\n\n<b>            INT. ANNIE'S APARTMENT - ONE WEEK LATER\n</b>\n            The apartment looks like a fallout shelter.  The kitchen\n            contains enough canned goods to last a year.  Brightly\n            colored crocheted doilies - Annie's hobby - adorn every\n            available surface.  The BRIGHTLY COLORED WEB of an\n<b>            AGORAPHOBE.\n</b>\n            Lucy sits in Annie's lap, getting her first piano lesson.  WE\n            SEE LUCY'S TINY FINGERS on the keys.  In a SERIES OF\n            DISSOLVES, it is joined by Annie's hand tapping out one note,\n            now two notes, and as the weeks pass, a chord.  Until finally\n            the notes merge to become the most unlikely duet of \"Twinkle,\n            Twinkle, Little Star\".\n\n<b>                                ANNIE\n</b>                      This is Mozart.  He did twenty-two\n                      variations of \"Twinkle Twinkle Little\n                      Star\".  You smell good.  You can tell a\n                      lot about a person by their smell.  If\n                      they've got too much perfume on they're\n                      covering something up.  You gotta watch\n                      someone who smells like soap.  Gotta\n                      wonder what their priorities are. \n                      Nervous people.  People who try too\n                      hard.  They smell like fish.  But you. \n                      You smell like milk.  Milk and hope.\n\n            Lucy leaves the piano and toddles over to Annie's loom and\n            plays with a ball yarn.\n\n<b>                                VOICE (O.S.)\n</b>                      Groceries, Annie.\n\n<b>                                ANNIE\n</b>                      Thanks.\n\n            Annie opens the door to pull in the groceries.  The ball of\n            yarn ROLLS OUT the door and Lucy chases after it.  Annie,\n            terrified, bellows:\n\n<b>                                ANNIE (CONT'D)\n</b>                      Lucy!  Come back here!  Come back!\n\n            It becomes obvious Annie can't walk outside.  Trembling:\n\n<b>                                ANNIE (CONT'D)\n</b>                      \"Lucy in the sky with diamonds...\"\n\n            Hearing the familiar tune, Lucy stops and toddles back. \n            Annie sweeps her up, relieved and we --\n\n<b>            INT. KARAOKE BAR - NIGHT\n</b>\n            Sam on stage, with Ifty and Brad as his back-up singers,\n            continuing the song in the oddest, most heartfelt version to\n            Lucy who sits on Robert's lap and in heaven.\n\n<b>            EXT. PARK - DAY\n</b>\n            A beautiful blue sky.  And \"Lucy in the Sky with Diamonds\"\n            continues as Lucy's THREE YEAR OLD laughing face SWINGS INTO\n            FRAME on a swing then DISAPPEARS out THE OTHER END OF FRAME. \n            Now Lucy SWINGS BACK DOWN and out of the other end again...\n\n            Sam's FACE, glowing with delight, APPEARS AGAINST THE SKY and\n            then disappears.  Sam and Lucy are on swings surrounded by\n            MOTHERS and KIDS at the park.\n\n<b>                                LUCY (V.O.)\n</b>                      Daddy, where does the sky end?\n\n<b>                                SAM (V.O.)\n</b>                      Let me see, let me see.  I've never been\n                      there but they say it's somewhere near\n                      China.\n\n<b>            EXT. PARK - ONE YEAR LATER\n</b>\n            Lucy FLIES INTO FRAME, now FOUR, sitting on Sam's lap,\n            swinging.\n\n<b>                                LUCY (V.O.)\n</b>                      Are lady bugs only girls or are there\n                      boys, too.  And if there are, what are\n                      they called?\n\n<b>                                SAM (V.O.)\n</b>                      The Beatles.\n\n<b>            EXT. PARK - ONE YEAR LATER\n</b>\n            Then Lucy FLIES INTO FRAME, now FIVE, followed by Sam.\n\n<b>                                LUCY (V.O.)\n</b>                      Do I look more like you or Mommy?\n\n<b>            ON SAM'S FACE\n</b>\n            He knew this moment would come.\n\n<b>            INT. DENNY'S - THURSDAY NIGHT DINNER - EVENING\n</b>\n            Lucy and Sam are having a serious talk over breaded Sole.\n\n<b>                                LUCY\n</b>                      If you and Mommy liked each other enough\n                      to have me, how come you're not together\n                      anymore?\n\n<b>                                SAM\n</b>                      I think she fell out of love with me. \n                      Not you, never you.  Me, just me.\n\n<b>                                LUCY\n</b>                      When you fall out of love where do you\n                      land?\n\n<b>                                SAM\n</b>                      Somewhere in Florida, I think.\n\n<b>                                LUCY\n</b>                      Do you think she'll ever come back?\n\n<b>                                SAM\n</b>                          (long pause)\n                      Paul McCartney lost his mother when he\n                      was fourteen.  John lost his mother\n                      twice.  First when Julie gave John to\n                      her sister Mimi to raise.  And then\n                      again when Julia was hit by a car.  They\n                      say God picks certain people, special\n                      people.  That's what they say.\n\n            Lucy takes this in.  Sam begins to shift his tomatoes just\n            so... his potatoes just slightly to the left.  Lucy watches.\n\n<b>                                LUCY\n</b>                      Daddy, did God mean for you to be like\n                      this or was it an accident?\n\n<b>                                SAM\n</b>                      Do you mean - what do you mean?\n\n<b>                                LUCY\n</b>                      I mean you're different.\n\n<b>                                SAM\n</b>                      What do you mean?  I mean, what do you\n                      mean?\n\n<b>                                LUCY\n</b>                      You're not like the other daddies.\n\n<b>                                SAM\n</b>                      I'm not am I.  I'm sorry.\n\n<b>                                LUCY\n</b>                      Don't be sorry.  I'm lucky.  Nobody\n                      else's daddy ever comes to the park.\n\n<b>            ON SAM'S FACE\n</b>\n            Filled with relief.  Bursting with love.\n\n<b>                                SAM\n</b>                      We are very lucky, aren't we?\n\n            Grace approaches with two plates of pie, ice cream on the\n            side.\n\n<b>                                GRACE\n</b>                      Ice cream on the side.\n\n<b>                                LUCY\n</b>                      Not on top.  Not on top.\n\n<b>                                SAM\n</b>                      Good choice.  Very good choice.\n\n<b>            INT. SAM'S APARTMENT - THURSDAY NIGHT VIDEO NIGHT\n</b>\n<b>                                SAM\n</b>                      Brad, I know it was your turn.  I'm sure\n                      of it.\n\n<b>                                BRAD\n</b>                      I swear to God it was Robert's turn.\n\n<b>                                ROBERT\n</b>                      Why is it always my fault?\n\n<b>                                IFTY\n</b>                      I keep track, last time, I say to\n                      myself, I say, write it down... Bank of\n                      America give away beautiful calendar,\n                      every month a picture of wild animal,\n                      look June, an Elk.  Elke Sommer...she\n                      starred in the remake of \"Prisoner of\n                      Zenda\"... Three stars Leonard Maltin\n                      video movie guide.\n\n            As they go on, Lucy matter-of-factly PULLS A VIDEO OUT OF HER\n            BACKPACK, and puts it in the VCR.  She turns it on.  It's\n            \"Kramer vs. Kramer\".  Everyone stops their arguing and stares\n            at Lucy.\n\n<b>                                LUCY\n</b>                      Annie let me borrow it.\n\n<b>            INT. CHILDREN'S SHOE STORE - DAY\n</b>\n            A row of brand new children's shoes on display.  Lucy tries\n            on dozens of school shoes, surrounded by Sam and her\n            \"Godfathers\": Ifty, Brad and Robert.\n\n<b>                                SAM\n</b>                      You need a good sturdy school shoe. \n                      Arches are very important.\n\n<b>                                IFTY\n</b>                      Sturdy is boring.  Red shoes bring good\n                      luck.\n\n<b>                                BRAD\n</b>                      But red doesn't got with green.\n\n<b>                                IFTY\n</b>                      Except on Christmas.\n\n<b>                                BRAD\n</b>                      No brown clodhoppers.  Everyone will\n                      make fun of her.\n\n<b>                                SAM\n</b>                      NO ONE will make fun of Lucy.\n\n<b>                                ROBERT\n</b>                      She might be stupid.\n\n<b>                                IFTY\n</b>                      No she's not --\n\n<b>                                ROBERT\n</b>                      Did they test her?\n\n<b>                                BRAD\n</b>                      You don't know for sure.\n\n<b>                                SAM\n</b>                      Yes I do.\n\n<b>                                BRUCE\n</b>                      But if she is, don't make her go to\n                      school.\n\n<b>                                ROBERT\n</b>                      Don't let her in the lunch room.  Johnny\n                      Marzettie's there.\n\n<b>                                BRAD\n</b>                      And gym.  Get her a pass.  The rules for\n                      volleyball are so hard to remember. \n                      \"Rotate Rackman Rotate.\"\n\n<b>                                IFTY\n</b>                      Throw the ball at his forehead and the\n                      water on his brain will come out his\n                      nose.\n\n            Meanwhile, Lucy has been trying on a simple brown shoe.\n\n<b>                                LUCY\n</b>                      I like these.\n\n<b>                                SAM\n</b>                      She know what she likes.  She likes\n                      these.  How much are they?\n\n<b>                                SALESMAN\n</b>                      Forty-nine ninety-nine.\n\n<b>                                SAM\n</b>                      One penny less than fifty.  These shoes\n                      are one penny less than fifty?\n\n<b>                                LUCY\n</b>                      It's okay, Dad.  I don't really like\n                      them.\n\n<b>                                SAM\n</b>                      No, no no no no.\n\n<b>                                IFTY\n</b>                      We'll all give ten dollars.\n\n<b>                                BRAD\n</b>                      I've only got three plus five.  But I\n                      need one for stamps.\n\n<b>                                ROBERT\n</b>                      Don't pull your wad out in front of\n                      people.\n\n            They all dig in their pockets and begin counting very slowly.\n\n<b>                                SAM\n</b>                      Thank you, thank you.  We are rich in\n                      friends.  That's what our fortune cookie\n                      said.  1, 2, 3, 4, quarters that makes\n                      one.\n\n<b>                                SALESMAN\n</b>                      I'll count it.\n\n<b>                                SAM\n</b>                      Is it enough?\n\n<b>                                SALESMAN\n</b>                          (exasperated)\n                      If there's a God.\n\n<b>                                BRAD\n</b>                      Do we get a balloon with these?\n\n<b>                                SALESMAN\n</b>                      Yes.\n\n<b>                                ROBERT\n</b>                      All of us, or just her?\n\n<b>                                                           SMASH CUT TO:\n</b><b>            EXT. STREET NEAR SHOE STORE - DAY\n</b>\n            Those new little brown shoes walking in between four pairs of\n            man's shoes.  We move up from those shoes to see FIVE PAIR OF\n            HANDS tightly clasping their balloons as they march\n            victoriously down the street.  We MOVE IN on Lucy's little\n            brown shoes skipping with joy and --\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            EXT. SCHOOL FIELD - DAY\n</b>\n            Those same little shoes in the midst of a mass of black\n            soccer cleats.  We move up and see Lucy in the middle of a\n            fierce kids soccer game.\n\n            Score's tied.  The ball comes to Lucy.  She kicks and misses. \n            From the sidelines we hear:\n\n<b>                                SAM\n</b>                      Beautiful kick!  Very close!\n\n            Lucy looks up at her dad proudly.  The ball comes again. \n            Nobody could miss this one.  But Lucy does.\n\n<b>                                SAM (CONT'D)\n</b>                      Thatta girl!  Thatta girl!  They're\n                      getting scared now!\n\n            The game continues.  The GOALIE'S FATHER, DUNCAN RHODES,\n            handsome, commanding and dressed in a suit, calls to his son:\n\n<b>                                MR. RHODES\n</b>                      C'mon, Conner!  On your toes!  They're\n                      all counting on you!\n\n            Conner tenses up, alert under the pressure.  Meanwhile, down\n            at the other end, the ball heads toward Lucy.  She kicks it! \n            Hard.  Right into her team's own goal.  The crowd GROANS.\n\n<b>                                SAM\n</b>                      Hurray, Lucy!  You're getting the hang\n                      of it now!  You've got them scared now!\n\n            Lucy's bursting with confidence, plows toward the ball and\n            NAILS IT!  The ball goes flying.  The parents in the stand\n            are completely baffled!  Sam is completely ecstatic!\n\n<b>                                SAM (CONT'D)\n</b>                      L-u-c-y!  That's our battlecry!\n\n            The ball heads into the goal, just passing the goalie,\n            Conner.  Sam runs to embrace Lucy when he hears Duncan\n            reaming his son --\n\n<b>                                MR. RHODES\n</b>                      The whole game was right in front of\n                      your nose!  I leave work early to watch\n                      you blow the whole game!?\n\n            Conner slouches against the fence as his father walks away. \n            Seeing this, Sam whispers to Lucy.\n\n<b>            INT. SAM'S APARTMENT - AFTERNOON\n</b>\n            A child's hand double jumps across a checker board.\n\n<b>                                CONNER (O.S.)\n</b>                      Ha!\n\n            Lucy and Conner are playing checkers while Sam cooks dinner. \n            Two carrots cut into ten pieces. Bow Tie Pasta - 35 pieces\n            each.\n\n<b>                                CONNER (CONT'D)\n</b>                      What's wrong with your father?  Why's he\n                      acting like a retard?\n\n<b>                                LUCY\n</b>                      He is.\n\n            Their hands graze against each other on the check board - he\n            pulls his hand away.\n\n<b>                                CONNER\n</b>                      Are you?\n\n<b>                                LUCY\n</b>                      No.\n\n<b>                                CONNER\n</b>                      Are you sure?\n\n<b>                                LUCY\n</b>                      Yeah.\n\n<b>                                CONNER\n</b>                      How do you know?\n\n<b>                                LUCY\n</b>                      He told me.\n\n<b>                                CONNER\n</b>                      But he's a retard.\n\n<b>                                LUCY\n</b>                      Yeah well it takes one to know one!\n\n            He crowns her - her eyes shift to Sam in the kitchen, for the\n            first time a bit uneasily.\n\n<b>            INT. SAM'S APARTMENT - NIGHT\n</b>\n            Sam's reading Lucy her homework book.\n\n<b>                                SAM\n</b>                      \"They perched in sisisi...\"\n\n<b>                                LUCY\n</b>                      \"Silence.\"\n\n<b>                                SAM\n</b>                      \"...silence for a long time.\"  Boy. \n                      Your teacher chose a hard book this\n                      time.  \"How can we be so difdifdif...\"\n\n<b>                                LUCY\n</b>                      \"Different.\"\n\n            Sam glances up at Lucy self-consciously.  Lucy grabs the book\n            from Sam, tosses it on the pile and picks up another.\n\n<b>                                LUCY (CONT'D)\n</b>                      I don't like that book - let's read\n                      \"Green Eggs and Ham\".\n\n            Relieved, Sam plunges into the book, which is more memorized\n            than read.\n\n<b>                                SAM\n</b>                      \"I am Sam, Sam I am.  Do you like green\n                      eggs and ham?  I do not like them, Sam I\n                      am!\"\n\n            They both laugh, delighted.  Lucy looks sleepy.\n\n<b>                                                         MATCH DISSOLVE:\n</b>\n            Lucy is getting drowsy.  Sam is just getting started.\n\n<b>                                SAM (CONT'D)\n</b>                      \"And I will eat them here and there. \n                      Say I will eat them ANYWHERE.  I do so\n                      like green eggs and ham, thank you thank\n                      you, Sam I am!\"  One more time!\n<b>\t\t\t\t\t  \n</b><b>                                LUCY\n</b>                      Daddy, I have school tomorrow...I don't\n                      wanna be too sleepy.\n\n<b>                                SAM\n</b>                      Just the part about the boat and the\n                      goat in the rain in the train?\n\n<b>                                LUCY\n</b>                      Daddy, Hamburger Hamlet has twelve\n                      different kinds of hamburgers.  Can we\n                      go there Wednesday instead of Denny's?\n\n<b>                                SAM\n</b>                      But Wednesday night's Denny's,\n                      Thursday's Video Night, Friday Night\n                      Karaoke.\n\n            Lucy nods, a little deflated.\n\n<b>                                SAM (CONT'D)\n</b>                      How about one more time, just the\n                      beginning?  \"I am Sam, Sam I am...\"\n\n            Lucy sighs and closes her eyes against her father's chest.\n\n<b>            INT. CLASSROOM - DAY\n</b>\n            Lucy draws a picture while everyone reads aloud from\n<b>            \"STELLALUNA\".\n</b>\n<b>                                MISS WRIGHT\n</b>                      Lucy, your turn.  Start where Sara left\n                      off...Lucy?\n\n<b>                                LUCY\n</b>                      I can't.\n\n<b>                                MISS WRIGHT\n</b>                      Sure you can.\n\n<b>                                LUCY\n</b>                      \"They perched in sisisisi...\"\n\n<b>                                MISS WRIGHT\n</b>                      Silence.\n\n<b>                                LUCY\n</b>                          (throws down book)\n                      There.  I told you.  It's too hard.\n\n<b>                                MISS WRIGHT\n</b>                      Lucy!  I know you can read this!\n\n<b>                                LUCY\n</b>                      No, I can't!  And you can't make me!\n\n            Lucy runs out of the class.\n\n<b>            EXT. BUS STOP - DUSK\n</b>\n            Sam, in sunglasses, waits for the BUS.  A YOUNG WOMAN, LILY,\n            sits down next to him.  The WIND CATCHES her floral dress\n            that's just left of innocent; just right of alluring.  She\n            reads a TABLOID.\n\n<b>                                LILY\n</b>                      Look here.  \"Premature baby claims he's\n                      cupid - has the arrow to prove it.\"  Do\n                      you believe that?\n\n<b>                                SAM\n</b>                      Well, if he has the arrow.\n\n<b>                                LILY\n</b>                      Yeah.  You got a good point.\n\n            She crosses her legs.  A tuft of pink dress falls on Sam's\n            knee.\n\n<b>                                SAM\n</b>                      You're a good reader.\n\n<b>                                LILY\n</b>                      Yeah, I've always been smart.\n\n<b>                                SAM\n</b>                      You're lucky.  I'm looking for a smart,\n                      good mother.\n\n<b>                                LILY\n</b>                      I can be a mother.  A real good mother.\n\n<b>                                SAM\n</b>                      Oh, good.  Good.\n\n<b>                                LILY\n</b>                      I could even spank you.\n\n<b>                                SAM\n</b>                      Oh no no no.  I don't believe in that.\n\n<b>                                LILY\n</b>                      Okay okay.  I can be very gentle.\n\n<b>                                SAM\n</b>                      Gentle.  Gentle.  Yes.  Do you tell\n                      stories?\n\n<b>                                LILY\n</b>                      I got stories up the wazoo.  Why don't\n                      you come with me.  I'll tell you a nice\n                      story.\n\n<b>                                SAM\n</b>                      I have to pick up Lucy at Annie's first.\n\n<b>                                LILY\n</b>                      A menage a toi?\n\n<b>                                SAM\n</b>                      French, French the language of France. \n                      You could teach my daughter, Lucy.\n\n<b>                                LILY\n</b>                      Your daughter?!  Can't you pick her up\n                      after?!\n\n<b>                                SAM\n</b>                      After?!  No no, Lucy comes too.\n\n<b>                                LILY\n</b>                      Whatever.\n\n            She takes Sam's hand, they move to get on the bus JUST AS\n            ANOTHER HAND brusquely lands on theirs.\n\n<b>                                COP\n</b>                      Not so fast.  You're under arrest. \n                      Solicitation.\n\n<b>                                LILY\n</b>                      He wanted to bring his kid, I said no.\n\n            A lightbulb flashes and we --\n<b>\t\t\t\n</b><b>                                                           SMASH CUT TO:\n</b>\n<b>            INT. POLICE HEADQUARTERS - THAT NIGHT\n</b>\n            Sam blinks as his MUGSHOT is being taken.  Now the profile. \n            He turns so they can get the back of his head.  Now the\n<b>            FINGERPRINT.\n</b>\n            Now Sam, in the corner of the room, on the phone making\n            thumbprints on the wall.  While the COP discusses his case\n            with a social worker, MARGARET BROWN.  Over the years she's\n            seen it all, and to get through it has had to pretend it's\n            just a job.\n\n<b>                                COP\n</b>                      It's the first time in nineteen years I\n                      actually believe the guy when he says he\n                      didn't know she was a hooker --\n\n<b>                                MARGARET BROWN\n</b>                      You say that like it's a good thing.\n\n<b>                                SAM\n</b>                      ...Your teeth don't sound like they were\n                      brushed.  Do it with me now.\n\n<b>                                COP\n</b>                      Let him go.  He says he's never spent a\n                      night away from his kid... Come with me -\n                      I got a guy who beat the shit out of his\n                      two year old.  Again.\n\n            Her cell phone beeps.\n\n<b>                                MARGARET BROWN\n</b>                      Yes.  I am seeing you tomorrow, Mr.\n                      Rabins.  She's still screaming?  No,\n                      McDonald's won't help...she's four\n                      months old.\n\n<b>                                SAM\n</b>                      Thirteen up...not on the gum line not on\n                      the gum line, 1, 2, 3.\n\n            Margaret watches Sam as he talks to Lucy on the phone.\n\n<b>            INT. PRINCIPALS OFFICE - DAY\n</b>\n            The WALLS are lined with CHILDREN'S ART.  Various\n            interpretations of the family.  We stop at one of a very\n            small man and a very big little girl with her arm around him.\n\n<b>                                MISS WRIGHT\n</b>                      It gives us a great deal of insight into\n                      what she must be feeling.  And in the\n                      classroom, it's becoming clear she's\n                      holding herself back.  It's as if she's\n                      literally afraid to learn.\n\n            We PULL BACK and see Sam staring at the picture.  Mrs. Wright\n            and the principal watch him.\n\n<b>                                MISS WRIGHT (CONT'D)\n</b>                      No one doubts that you love your\n                      daughter, Mr. Dawson.  But the\n                      Department of Social Services contacted\n                      us.  They shared with us that your\n                      records show that your intellectual\n                      capacity is around that of a seven year\n                      old.  Our concern is what happens when\n                      Lucy turns eight?\n\n<b>                                PRINCIPAL\n</b>                      Mr. Dawson, do you understand what Miss\n                      Wright is trying to tell you about Lucy?\n\n<b>                                SAM\n</b>                      No one wanted The Beatles to break up. \n                      But you can hear it on the White Album. \n                      They were going in different directions.\n\n<b>            INT. LUCY'S BEDROOM - NIGHT\n</b>\n            It's bedtime.  Sam and Lucy are reading from \"STELLALUNA\".\n\n<b>                                LUCY\n</b>                      How can we be so dif..dif...I don't know\n                      that word.\n\n<b>                                SAM\n</b>                      Yes you do.  It starts with a \"d\" --\n\n<b>                                LUCY\n</b>                      I'm tired.\n\n<b>                                SAM\n</b>                      I don't believe you.\n\n<b>                                LUCY\n</b>                      Are you calling me a liar?\n\n<b>                                SAM\n</b>                      Yes.  Now read the word.\n\n<b>                                LUCY\n</b>                          (crying)\n                      No...I'm stupid.\n\n<b>                                SAM\n</b>                      No you're not.\n\n<b>                                LUCY\n</b>                      I don't want to read it if you can't.\n\n<b>                                SAM\n</b>                      It makes me happy.  I'm happy hearing\n                      you read it.\n\n            He holds the book open for Lucy.  Now Lucy, pushing through a\n            mountain of resistance, reads.  And reads beautifully.\n\n<b>                                LUCY\n</b>                      \"Why are we different and so much\n                      alike?\"\n\n<b>            INT. SCHOOL HALLOWEEN PARADE - AUDITORIUM - DAY\n</b>\n            Two children, dressed as Batman, march followed by\n            CINDERELLA.  We see Lucy dressed in NEWSPAPER - an ORIGAMI\n            BIRD.  And behind her, marching more proudly than any child,\n            is Sam, dressed as PAUL McCARTNEY, in the black suit era -\n            with Beatle boots and guitar strapped to his chest.  Sam is\n            the only adult participating in the parade.\n\n            Music BLASTS over the loudspeaker.  Sam begins to dance with\n            joyous abandon.  Lucy joins him.  They dance together\n            happily.\n\n            Suddenly Lucy becomes aware that her classmates are beginning\n            to laugh.  She slows and watches through their eyes Sam pony\n            around the room.  Conner pulls up his pants high on his waist\n            and begins to imitate Sam.  Another kid joins him.\n\n<b>                                KID\n</b>                      I'm a Super Freak!\n\n<b>                                CONNER\n</b>                      And I thought my dad was a dork.\n\n            Lucy's face hardens for the first time.  In a corrupt world\n            the pure can only stay pure for so long.\n\n<b>            INT. HAMBURGER HAMLET - EVENING\n</b>\n            Sam and Lucy sit in a booth.  Lucy's ecstatic.  Sam's trying.\n\n<b>                                LUCY\n</b>                      They have eleven different kinds of\n                      hamburgers.  This is so great.\n\n<b>                                SAM\n</b>                      A new place.  Your choice.  I said we'd\n                      go to a new place.  And here we are.\n\n            Sam anxiously rearranges the condiments on the table.  Lucy\n            tries to fold a napkin into an Origami bird.\n\n<b>                                LUCY\n</b>                      You know what else I want for my\n                      birthday, Daddy?  I want a hundred\n                      birds.\n\n<b>                                SAM\n</b>                      The napkins are much stiffer at Denny's. \n                      They make better birds.  There's not so\n                      much stuff on the tables there either. \n                      Why do they have two kinds of mustard on\n                      every table?\n\n<b>                                WAITRESS\n</b>                      Coffee?\n\n<b>                                SAM\n</b>                      No, no coffee.  Sam's system can't\n                      handle coffee.\n\n<b>                                WAITRESS\n</b>                      Okaaay!  What can I get you folks?\n\n<b>                                LUCY\n</b>                      I'd like the Benito Bandito burger and a\n                      chocolate chip milkshake, please.\n\n<b>                                SAM\n</b>                      I'll have the fish special, side of\n                      potatoes, salad with Thousand Island\n                      Dressing, cherry pie, and...\n\n<b>                                WAITRESS\n</b>                      I'm sorry, sir.  We don't have a fish\n                      special.  There's fish and chips.  It\n                      comes with a dinner salad.\n\n<b>                                SAM\n</b>                      Chips, chips?  You mean potato chips?  I\n                      don't want potato chips.  I want a side\n                      of potatoes.\n\n<b>                                WAITRESS\n</b>                      You want french fries?\n\n<b>                                SAM\n</b>                      No, a side of potatoes, like at Denny's. \n                      A side of potatoes.\n\n<b>                                LUCY\n</b>                      They're little red potatoes.\n\n<b>                                WAITRESS\n</b>                      We don't have new potatoes...\n\n<b>                                SAM\n</b>                      Denny's has new potatoes.  Six new\n                      potatoes parsley garnish parsley\n                      garnish...\n\n<b>            ON LUCY\n</b>\n            Her smile fades.\n<b>\t\t\t\n</b><b>                                                           SMASH CUT TO:\n</b>\n<b>            INT. DENNY'S - HALF-HOUR LATER\n</b>\n            Sam happily eats his fish special with six new potatoes. \n            Lucy's untouched dinner sits in the middle of the table.  She\n            doodles on the placement - drawing a man sitting with a pile\n            of new potatoes in front of him; larger than he is.\n\n<b>                                SAM\n</b>                      Fish and chips fish and chips.  I will\n                      not eat fish and chips.\n\n<b>                                LUCY\n</b>                          (exploding)\n                      I will not eat them here or there!  I\n                      will not eat them anywhere!  I will not\n                      eat green eggs and ham!  I will not eat\n                      them, Sam I am!\n\n<b>            INT. SAM'S APARTMENT - DAY\n</b>\n            Balloons and a banner reading \"Happy Birthday, Lucy!\"  For\n            Lucy's birthday, Sam has rented a moon bounce - which sits in\n            the center of the apartment and filling the entire place -\n            leaving no room for the few kids and their parents.  Brad\n            stands too close to a young attractive mother.  Robert shakes\n            all the presents suspiciously.\n\n<b>                                SAM\n</b>                      Now when they come through the door,\n                      everybody yell \"Surprise!\"  Do you want\n                      to rehearse again?\n\n<b>                                CONNER\n</b>                      No.  I bet she already knows.\n\n<b>                                ROBERT\n</b>                      I didn't tell her.  Did Brad say I did?\n\n            There's a KNOCK at the door.\n\n<b>                                SAM\n</b>                      Is that Lucy?  Annie's supposed to call\n                      and warn us.  Shhhh, everyone.\n\n            Brad hits the lights.  Sam OPENS THE DOOR and everyone yells\n            \"SURPRISE!\"  But instead of Lucy, it's the Social Worker.\n\n<b>                                MARGARET BROWN\n</b>                      I don't know if you remember me.  I'm\n                      Margaret Brown from Children's Social\n                      Services.  We met at the police station.\n\n<b>                                SAM\n</b>                      Put your present over there - Hurry up! \n                      Lucy might be on her way.\n                          (the phone rings)\n                      Hello?  Annie says she's coming up the\n                      stairs.  Everyone be quiet.  Assume\n                      surprise positions!\n                          (Conner keeps talking)\n                      Be quiet!  Assume surprise positions!\n\n<b>                                CONNER\n</b>                      Oh brother!\n\n<b>                                SAM\n</b>                      Why are you such a party pooper?! \n                      Assume surprise positions!\n\n<b>                                CONNER\n</b>                      Make me!\n\n            Sam puts a hand over Conner's mouth; Conner struggles against\n            him.\n\n<b>                                MR. RHODES\n</b>                      Hey!\n\n<b>                                SAM\n</b>                      He's gonna ruin the surprise!  He's\n                      gonna ruin the surprise!\n\n<b>                                CONNER\n</b>                      He touched me!  I've got cooties!  I've\n                      got cooties!\n\n<b>                                MR. RHODES\n</b>                      Get your hands off my boy!\n\n            Conner's father hurls Sam across the room - Sam gets tangled\n            in the MOON BOUNCE!  To get attention, Conner bursts into\n            tears.  We hear FOOTSTEPS outside the door - Brad hits the\n            lights.  We hear a CRASH!  And in the light, the DOOR SHEDS\n            as it opens, Lucy and Ifty see - that MOONBOUNCE, swaying. \n            Then from within the Moonbounce:\n\n<b>                                SAM\n</b>                      Surprise!  Happy Birthday!\n\n            Lucy stands frozen, holding a red balloon.\n\n<b>                                LUCY\n</b>                      Daddy?!\n\n<b>                                CONNER\n</b>                      You don't have to call him \"Daddy\".\n                          (in Sam's face)\n                      She says you're not her real father,\n                      anyway.  She's adopted!\n\n            Humiliated, Lucy RUNS AWAY!  The Social Worker watches,\n            profoundly concerned, and reaches for her cellular phone.\n\n<b>            EXT. WALMART - DAY\n</b>\n            A police car pulls into the parking lot.  Sam and Margaret in\n            the back.  Sam and Margaret see Lucy's little feet dangling\n            from beneath the curtain of the photo booth.\n\n<b>                                SAM\n</b>                      I'll go get her.\n\n<b>                                MARGARET BROWN\n</b>                      It would be better if you stay here. \n                      I'm sorry to say this, Mr. Dawson, it's\n                      clear how much you love your daughter,\n                      but we're going to have to remove Lucy\n                      from your home.\n\n            Sam's baffled.  One cop places his hand on Sam's shoulder,\n            restraining him.  The OTHER heads toward the photo booth.\n\n<b>                                SAM\n</b>                      No, no no no.  It's her birthday!  It's\n                      her birthday!\n\n<b>                                MARGARET BROWN\n</b>                      I know how hard this must be...\n                          (cell phone rings)\n                      ...Hello, Betsy.  I'm scheduled to come\n                      to your apartment at four.  No, not five\n                      every two hours.  It's two every five\n                      hours.  She only weighs thirty pounds\n                      for chrissakes...\n                          (back to Sam)\n                      The city has given me the difficult task\n                      of deciding when to intervene on behalf\n                      of the child.  Unfortunately, I've\n                      learned the hard way that it's better\n                      too soon than too late.  For now the\n                      court will decide what's in Lucy's best\n                      interest.\n\n            Sam watches the cop's legs meet Lucy's under the curtain. \n            Suddenly, Sam screams from the deepest core of his being.\n\n<b>                                SAM\n</b>                      Run, Lucy, run!\n\n            We see LUCY'S FEET KICK the COP'S LEGS and wrestle out of his\n            grasp.  She flies out the booth, holding that balloon.  She\n            runs down the street, the balloon soaring into the sky - a\n            cop follows.  Sam struggles.\n\n<b>            ON SAM\n</b>\n            Reeling, devastated, we HEAR A JUDGE speaking:\n\n<b>                                JUDGE (O.S.)\n</b>                      Given the fact that the father was\n                      arrested for solicitation, did not\n                      cooperate with the police...\n\n<b>            INT. COURTROOM - DAY\n</b>\n            Sam sits ALONE.  At another table, Margaret Brown and a\n            lawyer, along with several people from the CPS.\n\n<b>                                JUDGE\n</b>                      ...could not control his emotions,\n                      endangering other children.  Miss Brown\n                      also cites Mr. Dawson's mental\n                      deficiencies which raise serious\n                      questions about his ability to properly\n                      parent.  I agree to grant petition. \n                      The child shall be removed from the home\n                      until a forma jurisdictional hearing. \n                      Mr. Dawson, is there anything you'd like\n                      to add?\n\n<b>                                SAM\n</b>                      Yes.  I just wanted it to be a nice\n                      surprise party.  I had gotten the plates\n                      at Pic-N-Save.  Pink and yellow, pink\n                      and yellow.  Like a princess.  And the\n                      balloons at --\n\n<b>                                JUDGE\n</b>                          (gently)\n                      Mr. Dawson, it sounds like a lovely\n                      party, but right now I want to talk to\n                      you about your legal rights.  I would\n                      strongly suggest you get yourself legal\n                      counsel and allow your attorney to\n                      present your case at the jurisdictional\n                      hearing on February 13th.  Counsel, are\n                      you available?\n\n<b>                                COUNSEL\n</b>                      Ted, I have a trial that day.\n\n<b>                                JUDGE\n</b>                      February 20th.  8:00 a.m.\n<b>\t\t\t\t\t  \n</b><b>                                SAM\n</b>                          (panicking)\n                      Twenty-two days?  Lucy will come home\n                      and you want me to bring Lucy back in\n                      twenty-two days?\n\n<b>                                JUDGE\n</b>                      No, Mr. Dawson.  You'll have supervised\n                      visits twice a week for two hours.  Now\n                      I'm sorry, we have thirty more cases to\n                      see today.  Next!  Hopkins vs. Clifford.\n\n<b>            INT. SAM'S APARTMENT - DAY\n</b>\n            Sam's on the phone, a teddy bear in his hand.  Robert, Ifty,\n            and Brad all sit with Yellow Pages open in front of them.\n\n<b>                                SAM\n</b>                      Thursday?  Today is Monday, Mrs.  Brown. \n                      That's three days away.  That's too\n                      long.  She can't sleep without Mr.\n                      Jeeters.  Well if you're not available\n                      until Thursday, maybe I could see her\n                      without you there...\n                      maybe the Judge made a mistake - maybe\n                      he doesn't know that for seven years I\n                      played with her without you there...No\n                      Mrs. Brown, I'm not trying to violate\n                      the court...\n                          (the other line hangs up)\n                      Mrs. Brown?\n\n<b>                                ROBERT\n</b>                      I bet they were recording the whole\n                      conversation.  Check your phone.  You\n                      can't make a move.  You need a lawyer.\n\n<b>                                BRAD\n</b>                      Call Jerry Spence.  He has his own show. \n                      He must know what he's doing.\n\n<b>                                ROBERT\n</b>                      No.  Johnny Cochran.  He has his own\n                      show, too.\n\n<b>                                BRAD\n</b>                      Yeah!  He can even get a guilty person\n                      off.\n\n<b>                                SAM\n</b>                      So you think I'm guilty?\n\n<b>                                IFTY\n</b>                      No.  You didn't kill anybody.\n\n<b>                                SAM\n</b>                      But she said I'm not her father.  \n\n<b>                                IFTY\n</b>                      She didn't say that.  That runty kid\n                      with the blue shirt and the mean father\n                      whose voice sounds like the man on the\n                      Channel Four News who has a toupee. \n                      Toupees are expensive.\n\n<b>                                SAM\n</b>                      But Ifty.  She said it.\n\n<b>                                IFTY\n</b>                      But she didn't mean it.  I said I hated\n                      my mother once.  \"Once upon a time...\"\n                      is how stories begin.\n\n<b>                                ROBERT\n</b>                      You should get a personal injury lawyer. \n                      You've been personally injured.\n\n<b>                                BRAD\n</b>                      Here - look at this - \"Sebastion\n                      Gibson.\"  He can do anything. \n                      Pedestrians.  Back and neck.  Uninsured\n                      Motorist.  Dog attacks.\n\n<b>                                SAM\n</b>                      The Social Worker said it's a custody\n                      case.\n\n<b>                                ROBERT\n</b>                      Then get a divorce lawyer.\n\n<b>                                IFTY\n</b>                      When Dustin Hoffman was trying to keep\n                      Billy from going back to Meryl Streep,\n                      his lawyer said it was going to cost him\n                      fifteen thousand dollars - and that's if\n                      we win!\n\n<b>                                SAM\n</b>                      Fifteen thousand dollars!\n\n<b>                                BRAD\n</b>                      Don't worry about money now.  Get the\n                      best.  Century City - Here: \"Rubel Bly\n                      Harrison and Williams\".\n<b>\t\t\t\t\t  \n</b><b>            INT. RITA HARRISON'S CENTURY CITY OFFICE - DAY\n</b>\n            A Century City lawyer spins in front of our eyes.  It's SAM'S\n            POV as he sits in a chair that spins - in the center of RITA\n            HARRISON'S lavish, penthouse office.  Now we see the\n            panoramic of Los Angeles.  Now the dots in the Lichtenstein\n            on the wall WHIRL PAST US.  Now the DOOR SWINGS OPEN AND --\n\n            RITA HARRISON and her assistant burst in.  Rita moves in\n            opposite circles around the room.  Looking for something.  In\n            fact, as we watch Rita, we realize that she never stops\n            moving.  Period.  Ten steps ahead of anyone, too much energy,\n            too much caffeine, not enough food.  If she slowed down a\n            beat she might get vulnerable.  Can't have that.  Can't be\n            wrong.  Can't really look you in the eye.  Can't help it if\n            she's smarter than anyone else in the room.  Any room.  Any\n            time.\n\n<b>                                RITA\n</b>                      Did Fred Kimble call?  I'm already\n                      twenty minutes late.\n\n<b>                                PATRICIA\n</b>                      He --\n\n<b>                                RITA\n</b>                      What'd Michelle Kresge say?\n\n<b>                                PATRICIA\n</b>                      She --\n\n<b>                                RITA\n</b>                      She wasn't defensive, was she?\n\n<b>                                PATRICIA\n</b>                      Well --\n\n<b>                                RITA\n</b>                      That's ridiculous.  What happened with\n                      my car?\n\n<b>                                PATRICIA\n</b>                      They --\n\n<b>                                RITA\n</b>                      Because it wasn't my fault.\n\n<b>                                PATRICIA\n</b><b>                      I --\n</b>\n<b>                                RITA\n</b>                      Thank you, Patricia.\n\n<b>                                PATRICIA\n</b>                      This is Mr. Dawson.  There was some\n                      confusion with the temp last week and --\n\n<b>                                RITA\n</b>                      Mr. Dawson, it's a pleasure.  Since\n                      somebody made a mistake, unfortunately\n                      we only have a little time.  Hold all my\n                      calls unless it's my kid - I'll have a\n                      double cap.\n\n<b>                                SAM\n</b>                      Good choice, very good choice.\n\n<b>                                RITA\n</b>                      Can we get you anything to drink?\n\n<b>                                SAM\n</b>                      Is it free?\n\n<b>            ON RITA\n</b>\n            Hmmmm?\n\n<b>            TEN MINUTES LATER --\n</b>\n            Sam is in the middle of the beginning of his story.  Rita on\n            her second cappuccino, eyes her computer screen for calls.\n\n<b>                                SAM (CONT'D)\n</b>                      ...Lucy had an ice-cream cake with pink\n                      flowers - pink, not white not\n                      white...Lucy's favorite is cherry\n                      vanilla which is pink, too.  Cherries\n                      and vanilla.\n\n<b>                                RITA\n</b>                      Uh huh uh huh -- uh huh uh\n                          (into Amtel)\n                      If that's Jake Hiller, put him through.\n                          (picking up phone)\n                      Jake.  No no no no no no.\n\n<b>                                PATRICIA\n</b>                          (from speaker)\n                      Your son's on line two.\n\n<b>                                RITA\n</b>                      Jake, did you get that?!  \n                          (to Patricia)\n                      Tell him to hold for just one second. \n                      Jake I have to go...he what?\n\n<b>                                PATRICIA\n</b>                          (through speaker)\n                      Deborah Chapman on line three --\n\n<b>                                RITA\n</b>                      Hold on Jake.\n                          (she punches another line)\n                      No no no no no no no.  Have a nice\n                      weekend.\n                          (punches another button)\n                      Jake?!\n\n            We HEAR MUSIC coming from the other end of the phone --\n\n<b>                                SAM\n</b>                      Burt Bacharach shared billing with The\n                      Beatles and Jose Jiminez on the Ed\n                      Sullivan Show June 5th, 1968.\n\n<b>                                RITA\n</b>                      Really?\n                          (then)\n                      Jake, what'd you say you tell him yes I\n                      am.\n                          (yelling; re: coffee)\n                      This tastes like low, are you sure it's\n                      non?  Okay okay okay.  I think there's\n                      been a little mistake here --\n\n<b>                                SAM\n</b>                      Yes.  A little one.  Your son's on line\n                      two.\n\n<b>                                RITA\n</b>                      Oh my God.\n                          (pushes another line)\n                      Danny?\n                          (Danny's hung up)\n                      Patricia?  Get Danny back.  Well keep\n                      trying.\n\n            She unconsciously digs through the bowl of jelly beans on her\n            desk sorting out all the yellow ones.\n\n<b>                                RITA (CONT'D)\n</b>                      Mr. Dawson, what I'm trying to say is\n                      I'm a divorce lawyer and as much as I'd\n                      like to, I don't handle cases like yours\n<b>                      --\n</b>\n<b>                                SAM\n</b>                      Since you would like to, why don't you\n                      talk to your boss.  Maybe he would let\n                      you.\n\n            She pours the bowl of jelly beans onto her desk, now\n            frantically sorting through them.\n\n<b>                                RITA\n</b>                          (into phone)\n                      Then keep dialing --\n                          (to Sam)\n                      What I mean is that at this point in my\n                      career, I can't afford to.\n\n<b>                                SAM\n</b>                      I earn eight dollars an hour at\n                      Starbucks.  I can pay your hourly rate,\n                      rate by the hour, hourly --\n\n            Rita stands up, ushering him to the door.\n\n<b>                                RITA\n</b>                      Mr. Dawson, I'm sorry, I have to be in\n                      court in eight minutes with the Kresges. \n                      You understand, good luck to you and\n                      don't give up.\n\n            She turns, ahhhh!  He's gone!  She begins searching the room.\n\n<b>                                RITA (CONT'D)\n</b>                      Patricia?!  Where are my keys?  Where\n                      the hell are my keys?!  Alright alright.\n                          (replaying)\n                      I walked into the room - I went over\n                      here - I looked at my desk - I put my\n                      coat down - Patricia?!  Where's my coat?\n\n<b>                                SAM (O.S.)\n</b>                      Is there a child involved in Mr.\n                      Kresges' case?\n\n            Stunned, Rita looks up and sees Sam holding up a strip of\n            photos taken at the birthday booth.\n\n<b>                                RITA\n</b>                      No.\n\n<b>                                SAM\n</b>                      This is Lucy.  One year old.  First\n                      word, \"apple\".  December third.  3:16\n                      p.m.  December third.\n\n            Out of his pocket he pulls another photo strip.\n\n<b>                                SAM (CONT'D)\n</b>                      Here's Lucy two years old.  First merry\n                      go-round ride.  June 6th.  4:13 p.m. \n                      June 6th.  Here's Lucy.  Seven years\n                      old.  The day the police took her away.\n\n            Rita looks at the photo strip of Lucy's birthday.  In the\n            first three we see Lucy's sad face.  The fourth has a cop's\n            face smashed into the frame with her.\n\n<b>                                SAM (CONT'D)\n</b>                      Thank you for telling me not to give up. \n                      I won't give up.\n\n<b>                                PATRICIA\n</b>                          (through the phone)\n                      Danny on Line 2.\n\n            Rita LUNGES FOR THE PHONE.\n\n<b>                                RITA\n</b>                      Danny?  Hi.  Could we possibly talk\n                      about this when I get home.  Danny? \n                      Danny?  C'mon.  You're not gonna talk to\n                      me?  I bought you a bag of your favorite\n                      lemonade jelly beans.  Danny?\n                          (Rita starts singing)\n                      \"One little bird in one little tree,\n                      we're all alone and we don't want to\n                      be... So they flew far away over the\n                      trees...\" I said \"Over the sea...\" I\n                      know the words, I said \"Over the sea...\"\n                      Since when don't you like that song? \n                      Danny?\n\n            She checks her watch, puts him on the SPEAKER PHONE, and\n            frantically searches the room for her keys.\n\n<b>                                RITA (CONT'D)\n</b>                      Danny?\n\n            Silence.  We hear SIX LOUD THUDS - the sound of a basketball\n            bouncing against the floor.\n\n<b>                                RITA (CONT'D)\n</b>                      Danny?\n\n            CLICK!  The LINE GOES DEAD.  Rita trips over the coffee\n            table, completely losing it.\n\n<b>                                RITA (CONT'D)\n</b>                      I hate this stupid coffee table - how\n                      many times have I asked you to get rid\n                      of this crappy coffee table?\n\n            She kicks it, sending the lemonade jelly beans FLYING.  Then,\n            after a beat.\n\n<b>                                SAM\n</b>                          (from the doorway)\n                      You did say \"over the trees\" instead of\n                      \"over the sea.\"  It's hard to remember\n                      all the words to all the songs.  There's\n                      so many.\n                          (Rita almost stops)\n                      you have a child Rita rubel Bly Harrison\n                      Williams.  If they took him away\n                      wouldn't you hire the fastest talking\n                      four-named lawyer you could?\n\n<b>                                RITA\n</b>                      Yes, I would.  I went to college with a\n                      friend who does these kinds of cases. \n                      Leave your number.  I'll see if she can\n                      help you.\n\n<b>                                PATRICIA\n</b>                          (through your phone)\n                      Your therapist on Line 1.\n\n<b>                                RITA\n</b>                      Tell him you can't find me.\n\n<b>            INT. STARBUCKS - DAY\n</b>\n            Sam is face to face with George.\n\n<b>                                SAM\n</b>                      I'm ready.\n\n<b>                                GEORGE\n</b>                      Let's not add more stress to your life.\n\n<b>                                SAM\n</b>                      I'm ready.  I'm ready to make coffee. \n                      Lo-fat decaf latte.  Coffee up to here. \n                      Add steamed milk up to here.  No foam,\n                      no foam.  Cinnamon or chocolate\n                      sprinkles.\n\n<b>                                GEORGE\n</b>                      That's pretty good Sam.  I'll think\n                      about it.\n\n<b>                                SAM\n</b>                      I know what that means.  I stock shelves\n                      at Lucky Supermarkets.  I want to bag\n                      groceries, Miss Losey says \"I'll think\n                      about it.\"  Randy Brenner gets the job. \n                      I was the janitor at the La Reina\n                      Theater, I wanted to take tickets.  Mr.\n                      Jenkins said he'd think about it.  Larry\n                      Peters gets the job.  Lets his friends\n                      in for free...\n\n<b>                                GEORGE\n</b>                      I promise you, Sam.  I'll honestly think\n                      about it.  You have my word.\n\n<b>                                SAM\n</b>                      Words, words, words.  I need more than\n                      that.  I need to pay my lawyer.  I need\n                      to make coffee.\n\n<b>            INT. RUBEL BLY HARRISON AND WILLIAMS - 8:15 P.M.\n</b>\n            A group of Rita's colleagues are celebrating a big win.  Rita\n            is backing out of the room with her glass of champagne.\n\n<b>                                RITA\n</b>                      I am celebrating congratulations to us\n                      these are the moments good night.\n\n            She stops, stunned, as she sees Sam, sitting in the lobby\n            holding out a Starbucks Cappuccino.\n\n<b>                                SAM\n</b>                      Non-fat vente cap.  I'm sorry to bother\n                      you, but did you call your friend?\n                          (Rita's confused)\n                      Your friend from college, your friend\n                      who does this kind of work?\n\n<b>                                RITA\n</b>                          (there never was a friend)\n                      I don't have her number anymore, Sam. \n                      We lost touch.\n\n<b>                                SAM\n</b>                          (devastated)\n                      Oh, that happens.  That happens.  People\n                      lose touch.  Will you call me if you\n                      find it?  If you get back in touch?\n\n<b>                                RITA\n</b>                      Yes, I'm just in the middle..it's a\n                      special..I'll call you.\n\n            To avoid any further interaction, she heads back to the\n            employee party she previously escaped from.  Sam walks down\n            the hall.\n\n<b>                                COLLEAGUE\n</b>                      Is that the new janitor?\n\n<b>                                RITA\n</b>                      No, it's a case.  Sort of a pro-bono\n                      thing.\n\n            Her assistant Patricia clears her throat.\n\n<b>                                RITA (CONT'D)\n</b>                      What's that supposed to mean?\n\n<b>                                PATRICIA\n</b>                      Nothing.  A cracker went down the wrong\n                      pipe.\n\n            Muffled laughter from her colleagues.\n\n<b>                                RITA\n</b>                      You think I don't pro-bono?..I can do\n                      pro-bono.. I can do Goddamn pro-bono..\n                      where the hell are my keys..hold the\n                      door!\n\n            Rita runs to the open elevator and comes face to face with\n            Sam who's been holding the door open for her.\n\n<b>            INT. ELEVATOR - CONTINUOUS\n</b>\n            The door closes.  Rita is trapped with Sam.  She stares\n            forward trying to will him not there.  Rita gulps her\n            champagne.\n\n<b>                                SAM\n</b>                      32nd floor.  32 floors more.  31st\n                      floor.  31 floors more...\n\n            And on and on and on.  Rita is about to spontaneously\n            combust.  Finally, \"G\" - Rita bolts out the elevator doors,\n            then just as suddenly turns around.\n\n<b>                                RITA\n</b>                      Alright, alright I'll take you. \n                      Alright, Goddammitt, I'll take you.\n\n<b>                                SAM\n</b>                      Oh my God oh my God!  Rubel Bly Harrison\n                      and Williams!\n\n            Sam, shaking with relief, pulls out his wallet just as the\n            elevator door starts closing.\n\n<b>                                RITA\n</b>                      No, no  no.  Pro-bono.  Alright?  Pro\n                      bono.\n\n            The doors close.  We hear from within, as Sam goes up again:\n\n<b>                                SAM (O.S.)\n</b>                      Yes!  Alright!  I liked Sonny Bono too!\n\n<b>            INT. BUS - MORNING\n</b>\n            Sam stares out the window at an unfamiliar neighborhood.  On\n            his lap, the pink box, now ripped, allowing us to see Lucy's\n            birthday cake.  It's lopsided from having been thawed and\n            refrozen.\n\n<b>            EXT. BUS STOP - NOON\n</b>\n            Sam waits for his transfer.  He sets the cake down on the\n            bench and takes out a piece of paper with directions written\n            on it.  The number 43 bus pull sup and Sam consults his paper\n            once more before jumping on, forgetting the cake.\n\n            The bus goes half a block before it SCREECHES to a halt.  Sam\n            jumps off and runs back for the cake, but the bus continues\n            on its way.  Moments later, the NUMBER 34 bus pulls up. \n            Flustered and worried about being late, Sam jumps on.  He\n            feels something cold on his hand, looks down, the box is\n            starting to leak ice cream.\n\n<b>            INT. SOCIAL WORKERS OFFICE - DAY\n</b>\n            Lucy, Margaret, a therapist and a child psychologist wait for\n            Sam.\n\n<b>                                MARGARET BROWN\n</b>                      Lucy, I'm sorry.  But it doesn't look\n                      like he's going to make it.\n\n<b>                                LUCY\n</b>                          (staring forward)\n                      He'll be here.  You smell like soap.\n\n<b>                                MARGARET BROWN\n</b>                      Lucy, he's an hour and 45 minutes late. \n                      You'll only have a few minutes left.\n\n            Suddenly through the door comes Sam CARRYING THE MELTED,\n            DRIPPING birthday cake.  Lucy runs to him.\n\n<b>                                LUCY\n</b>                      Daddy!  I told you I told you!\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. THE SOCIAL WORKER'S SMALL GREY OFFICE - MOMENTS LATER\n</b>\n            Margaret, the therapist (Ms. Geller), and the Child\n            Pscyhologist all write voraciously into note pads as they\n            observe Sam and Lucy who sit in the center of the room,\n            nervous under their scrutiny.\n\n<b>                                SAM\n</b>                      ...and she's a Century City lawyer - a\n                      very famous lawyer.  Guess what her name\n                      is?  Rita Harrison.\n\n<b>                                LUCY\n</b>                          (jaw drops)\n                      Lovely Rita Meter Maid.\n\n<b>                                SAM\n</b>                      Harrison.  Just like George.\n\n            They move to hug each other.  EVERYONE REACHES for their\n            pens.  Sam pulls back self-consciously.  Everyone writes even\n            harder.\n\n<b>                                SAM (CONT'D)\n</b>                      You've grown.\n\n<b>                                LUCY\n</b>                      Have I?\n\n<b>                                SAM\n</b>                      Your ears are larger.  And your eyes are\n                      older.\n\n            He's right.  Her eyes are older.  He hugs her - ALL THE PENS\n<b>            GO UP.\n</b>\n<b>                                SAM (CONT'D)\n</b>                      I'm gonna get a phone machine.  Next\n                      paycheck.  If I'm not home, you can\n                      leave a message.  \"Hi, This is Lucy.\"\n\n<b>                                LUCY\n</b>                      You can't afford a phone machine.\n\n            The writing starts again.\n\n<b>                                SAM\n</b>                      Yes we can.  I'm in line for a\n                      promotion.  Big promotion.  A promotion\n                      that's big.\n\n<b>                                LUCY\n</b>                      They're gonna let you make coffee?!\n\n<b>                                SAM\n</b>                      Set your dreams high, Lucy.\n<b>\t\t\t\t\t  \n</b>            Lucy looks at her father lovingly.\n\n<b>                                LUCY\n</b>                      I'm sorry, Daddy.  It was all my fault.\n\n<b>                                SAM\n</b>                      No, Lucy.  Don't say that.\n\n<b>                                LUCY\n</b>                      I wouldn't want any Daddy but you.\n\n            She looks around to see if anybody's writing.  NOBODY IS. \n            She suddenly screams at them:\n\n<b>                                LUCY (CONT'D)\n</b>                      I said I was sorry!  I said I didn't\n                      want any Daddy but him!  Why don't you\n                      write that down?!\n\n<b>            INT. RITA'S OFFICE - DAY\n</b>\n            We hear sobbing and see Rita sitting across from a very rich,\n            very angry COUPLE.  Rita's foot is twitching furiously.\n\n<b>                                RITA\n</b>                      ...are you telling me that neither of\n                      you want custody of your child?\n\n<b>                                WOMAN\n</b>                      He's created a monster.  He's exactly\n                      like him.  He...he...\n\n            The woman is distracted by a loud thumping on Rita's glass\n            wall - it's SAM.  Holding an envelope.  Very distressed, as\n            the Secretary attempts to corral him back into the lobby.\n\n<b>                                RITA\n</b>                      I am right here with you, excuse me.\n                          (she unlocks door)\n                      Sam?  Didn't I tell you that you have to\n                      call?\n\n<b>                                SAM\n</b><b>                      I -\n</b>\n<b>                                RITA\n</b>                      You know how to make an appointment.\n\n<b>                                SAM\n</b>                      It's -\n\n<b>                                RITA\n</b>                      That's ridiculous you can always get\n                      Patricia.\n\n<b>                                SAM\n</b>                      They -\n\n<b>                                RITA\n</b>                      Good.  I'll see you next week.\n\n<b>                                SAM\n</b>                      But it's an emergency - lots of three\n                      syllable words urgent open at once.\n\n            He hands the letter to Rita.  Rita looks through the glass\n            wall at her clients who are getting impatient.\n\n<b>                                RITA\n</b>                      They want to have you and Lucy evaluated\n                      by a shrink.  The appointment is today\n                      at three.  Today.  Now.  Today!\n\n<b>                                SAM\n</b>                      I know and I want you to object.\n\n<b>                                RITA\n</b>                      Sam I can't object.  It's court ordered.\n\n            Sam notices that the woman in Rita's office is crying.  He\n            walks in and hands her a handkerchief from his pocket.\n\n<b>                                SAM\n</b>                      Here.  Don't be sad.\n\n            She looks at him as if he's from Mars.  Rita, now outside her\n            office, watches Sam now inside the office.\n\n<b>                                RITA\n</b>                      Patricia, I'm in the middle - get him\n                      out of there -\n\n            She quickly gets up but Rita's too impatient and pushes past\n            her into the office.\n\n<b>                                RITA (CONT'D)\n</b>                      Sam.  Sam come with me.\n                          (to the Couple)\n                      We're gonna get through this excuse\n                      us...\n                          (to Sam)\n                      Sam this is their turn now.  Not yours. \n                      Theirs.  If you leave now you'll never\n                      make it and you have to make it.\n\n<b>                                SAM\n</b>                      Okay okay I know I take the #34 bus and\n                      transfer to the #13...than the Downtown\n                      Express to Wilshire then -\n\n            Rita looks at the Couple leaving her office.\n\n<b>            INT. RITA'S PORSCHE - DAY\n</b>\n            Redefining road rage, Rita's slamming the horn.  Sam next to\n            her.\n\n<b>                                RITA\n</b>                      Go! Go! GO! for chrissakes!  Green means\n<b>                      GO!\n</b>\n<b>                                SAM\n</b>                      Red means stop yellow in the middle\n                      means no no no...I don't like shrinks. \n                      I've seen too many shrinks.\n\n<b>                                RITA\n</b>                      Yeah.  You and me both.  Right or left\n                      which will it be you IDIOT!?\n\n<b>                                SAM\n</b>                      Your mother sent you to shrinks, too?\n\n<b>                                RITA\n</b>                      No.  Well, sort of.  I talk about her\n                      the whole time I'm there.\n\n<b>                                SAM\n</b>                      That's nice.  Did you notice that\n                      everyone else is driving slower.  I\n                      noticed that did you?\n\n<b>                                RITA\n</b>                          (on the horn)\n                      Go for Chrissakes!  How about your\n                      mother?  Maybe she can help you -\n\n<b>                                SAM\n</b>                      She's gone.  She's at the Park Lane\n                      Mortuary.  Two from the left.  Under the\n                      big tree.\n\n<b>                                RITA\n</b>                      Oh.  I'm sorry.  The light is green! \n<b>                      WOULD YOU MOVE MOVE MOVE!?\n</b>\n            She cuts around the car in front of her; flips him off, and\n            in a split second that her head is turned, almost SMASHES\n            into the car in front of her!  She slams on the brakes.\n\n<b>                                SAM\n</b>                      Too many shrinks...I'm sorry Mrs.\n                      Dawson, if I were you I wouldn't waste\n                      any more time.  I'm sorry Mrs. Dawson it\n                      must be a tremendous disappointment. \n                      I'm sorry Mrs. Dawson I think you'd both\n                      be happier if Sam was in a home.\n\n            Rita looks over at Sam, forced to stop.\n\n<b>            INT. PSYCHOLOGIST OFFICE - DAY\n</b>\n            Sam sits across from a shrink, MS. GELLER, nervously\n            straightening her desk.\n\n<b>                                PSYCHOLOGIST\n</b>                      Mr. Dawson, you do understand, that\n                      since I am a court appointed\n                      psychologist, the traditional client\n                      therapist confidentiality will be\n                      waived.\n                          (Sam looks confused)\n                      Mr. Dawson, do you understand that the\n                      confidentiality will be waived?\n\n            Sam nods nervously and waves.  With that she begins.\n\n<b>            INT. SAM'S APARTMENT - NIGHT\n</b>\n            Sam, Ifty, Brad and Robert hover over a used answering\n            machine.  Ifty pours over the instructions.\n\n<b>                                IFTY\n</b>                      Before you read your message press the\n                      red button for record, when you finish,\n                      press the yellow button.  If you press\n                      the green button, it will play it back\n                      you.  Let's start with the \"ogm\".\n\n<b>                                SAM\n</b>                      Okay, okay.  I'm ready.  Hello, I am\n                      Sam.\n\n<b>                                IFTY\n</b>                      No, no.  I didn't press the red button.\n\n<b>                                SAM\n</b>                      Oh, yes.  False start, false start.\n\n<b>                                IFTY\n</b>                      It's not working.  That's what you get\n                      for buying a used machine.  Used means\n                      broken.  You're asking for other\n                      people's problems, you have enough of\n                      your own, not that everyone doesn't have\n                      problems.\n\n<b>                                BRAD\n</b>                      It's not used.  It's pre-owned.  Guy\n                      bought it for his auto shop and then he\n                      got a secretary.\n\n<b>                                IFTY\n</b>                      Testing, one two three.\n\n<b>                                SAM\n</b>                      That's a good code.  I'll remember that. \n                      One, two, three.\n\n<b>                                IFTY\n</b>                          (pressing button)\n                      Quick, you're recording.\n\n<b>                                SAM\n</b>                      I'm hi.  I am Sam.  I'm not home.\n\n<b>                                ROBERT\n</b>                      No, you don't want to say that.  you\n                      don't want them to know you're not home.\n\n<b>                                SAM\n</b>                      But then I'm lying.\n\n<b>                                ROBERT\n</b>                      Everybody's lying.\n\n<b>                                SAM\n</b>                      I'm not a liar.  It will send a mixed\n                      message to Lucy.\n\n<b>                                IFTY\n</b>                          (pressing the button)\n                      You're on the air!\n\n<b>                                SAM\n</b>                      Let me see, let me see, let me see.  Hi,\n                      how are you?\n\n            BEEP! the tape runs out.\n\n<b>                                IFTY\n</b>                      That was pretty good.  That was natural.\n\n<b>                                SAM\n</b>                      Did I sound like a good father?\n\n<b>                                IFTY\n</b>                      It's the outgoing message.  You need to\n                      sound more outgoing.  Let's start again.\n<b>\t\t\t\t\t  \n</b><b>            INT. GROUP HOME - NIGHT\n</b>\n            Mrs. Kerry unlocks the phone and dials.  She hands the phone\n            to Lucy who waits eagerly in her pj's.  Sam's answering\n            machine clicks on; as if on slow speed.\n\n<b>                                ANSWERING MACHINE\n</b>                      Hi, it's Len's Auto Body Shop.  We'd\n                      love to show you our body work, but it's\n                      invisible.  Leave it at the beep.\n\n<b>                                LUCY\n</b>                      Try again.  You must have dialed the\n                      wrong number.\n\n<b>            INT. RITA'S OFFICE - DAY\n</b>\n            Rita and Sam walk through the lobby at Rita's Olympic pace. \n            She passes the elevator and heads for the stairs.\n\n<b>                                RITA\n</b>                      Look, we've got a lot to go over and\n                      I've got five minutes.\n\n<b>                                SAM\n</b>                          (pointing to elevator)\n                      Rubel Bly Harrison and Williams thirty\n                      second floor, thirty-two floors up.\n\n            Rita heads up the stairs.  We hear a BEEP.  Then another. \n            Rita checks her heart rate watch.  Starts walking up the\n            stairs.\n\n<b>                                RITA\n</b>                      One-twenty.  Gotta get to one-twenty\n                      five to make it count.  Okay okay okay. \n                      I'm gonna need that list of people who\n                      can testify that you're a good father\n                      despite your handicap.  I didn't mean\n                      your handicap I meant your disability -\n                      I mean the fact that you're retarded. \n                      That's not the right word.  I mean...\n                      What do I call you?\n\n<b>                                SAM\n</b>                      Sam.  I am Sam.\n\n            Rita looks at Sam as she bounds up the fourth floor.\n\n<b>                                RITA\n</b>                      Yes you are.\n                          (he hands her a list - her CELL\n<b>                           PHONE RINGS)\n</b>                      Hello Ted how you doing/  Whattaya mean\n                      what's that supposed to mean? \n                          (her heart beep rate goes up)\n                      Put Danny on... You're supposed to be\n                      taking him to karate.  No it is not my\n                      day it's your day.  I took your day last\n                      Wednesday - are you eating no I will not\n                      hold.  Go pick him up!  What?  I can't\n                      hear you I'm in the car - they put you\n                      through to me here...I'm losing you --\n                          (clicks off phone)\n                      I get paid for this memory - I know I\n                      took him last.\n\n            A look of horror falls across her face.  She does a 180 and\n            starts RUNNING down the stairs reading the list.\n\n<b>                                RITA (CONT'D)\n</b>                      We're making progress.  Three character\n                      witnesses.  That's a good start.  What\n                      does Ifty Bhutto do?\n\n<b>                                SAM\n</b>                      He works in a bank.\n\n<b>                                RITA\n</b>                          (tripping down the stairs)\n                      Excellent.\n\n<b>            INT. RITA'S OFFICE - THE VERY NEXT DAY\n</b>\n            Ifty sits across from Rita who attempts to take notes.\n\n<b>                                IFTY\n</b>                      Sam is a very concerned father.  He\n                      always saves his money at Bank of\n                      America.  Last year there was a lion on\n                      the calendar.  This year a gazelle.  The\n                      gazelle is national bird of Tunisia.  We\n                      have clients, not customers.  At Bank of\n                      America.  Bank on us.\n\n            He looks up at her, lost.  So is she.\n\n<b>                                IFTY (CONT'D)\n</b>                      What was the question again, please?\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. RITA'S OFFICE - DAY\n</b>\n<b>            ON BRAD\n</b>\n            Who sits across from Rita.  She tape records him.\n\n<b>                                BRAD\n</b>                      He always made a point of feeding her\n                      breakfast when \"Bewitched\" was on and\n                      lunch when \"Jeopardy\" was on so she'd be\n                      smart.  Is that Wonderbra you're\n                      wearing?  Because you look wonderful.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. RITA'S OFFICE - DAY\n</b>\n            Robert sits across from Rita, who records him.\n\n<b>                                RITA\n</b>                      How long have you and Sam - \n\n<b>                                ROBERT\n</b>                      Why are you recording this?  Who's\n                      listening?\n\n<b>                                RITA\n</b>                      It's often necessary -\n\n<b>                                ROBERT\n</b>                      Who are you really?\n\n<b>                                RITA\n</b>                      I'm -\n\n<b>                                ROBERT\n</b>                      What's that supposed to mean?\n\n<b>                                RITA\n</b>                      Let's -\n\n<b>                                ROBERT\n</b>                      I need to talk to my lawyer.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. RITA'S OFFICE - LATER\n</b>\n            Rita maniacally picks the frosting off a donut.\n\n<b>                                RITA\n</b>                      Patricia, get Mr. Dawson on the line.\n\n            Over her INTERCOM, we hear SAM'S ANSWERING MACHINE.\n\n<b>                                ANSWERING MACHINE (O.S.)\n</b>                      Hi, it's Len's Auto Body Shop -\n\n<b>                                RITA\n</b>                      I need this like a - call him at\n                      Starbucks - no I don't know which\n                      Starbucks.  There's forty two between\n                      here and the end of the block.\n\n<b>            EXT. STREETS - DAY\n</b>\n            Rita stands next to her Porsche.  There are Starbucks in\n            every direction she looks.\n\n<b>            INT. STARBUCKS - DAY\n</b>\n            Sam is straightening Sweet and Lows.  Rita barrels in.\n\n<b>                                RITA\n</b>                      Look I don't think you understand what\n                      you're up against we have to be in court\n                      in three days and we don't have a decent\n                      witness.  Now you've gotta know someone\n                      who can testify who's been to college -\n                      or has a degree of some kind - or some\n                      sort of way of expressing themselves\n                      that's gonna make the court believe that\n                      you deserve to get your daughter back I\n                      need a coffee.  Big.  Tall.\n\n<b>                                SAM\n</b>                      Tall's the smallest.\n\n<b>                                RITA\n</b>                      Of course.  Of course, whatever.  Okay\n                      okay okay.  Damn!  I forgot to call back\n                      no I did and once you think of this\n                      person and there has to be one person -\n                      I want you to call me at work - because\n                      I'm going back there now to my seven\n                      other cases --\n                          (her cellphone RINGS)\n                      What?  Mrs. Robeck?  I'm on my way, the\n                      traffic's horrible on the 405.  Dorothy,\n                      we put in five months lets not let a\n                      three car pile up..I know it's been\n                      enormously stressful.. Your Esczema? \n                      Oh, honey, nobody notices..AH!  They\n                      opened a lane!\n\n<b>                                SAM\n</b>                          (too loudly)\n                      Do you want it here or to go?\n\n<b>                                RITA\n</b>                          (dial tone)\n                      Dorothy?  Dorothy?  No no no I didn't\n                      stare at the eczema for five months for -\n\n            She takes out her car beeper, clicks it towards the window\n            and realizes that they're towing her car!\n\n<b>                                RITA (CONT'D)\n</b>                      Sonuvabitch!\n<b>\t\t\t\t\t  \n</b><b>            INT. ANNIE'S APARTMENT - EVENING\n</b>\n            Annie is at the piano, lost in a Beethoven concerto.\n\n<b>                                SAM\n</b>                      Annie, it's one day.  One hour.  Maybe\n                      only 53 minutes.  Lucy needs you.\n                          (Annie keeps playing)\n                      You went to college.  You can give the\n                      right answers.\n\n            Annie plays even harder.  Frustrated, he POUNDS the piano.\n\n<b>                                SAM (CONT'D)\n</b>                      We can't lose her.\n\n<b>                                ANNIE\n</b>                      I can't.  I'd make it worse for you.  I\n                      can't do it.  Don't you think I would if\n                      I could?\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. COURTROOM - DAY\n</b>\n            We HEAR A VOICE:\n\n<b>                                VOICE (O.S.)\n</b>                      All rise for the Honorable Judge Phillip\n                      McNeily.\n\n            Sam stands along with others in the courtroom.  The Judge\n            enters and sits.  Everyone else sits now, too.  Except Sam. \n            Who continues to stand until Rita pulls him down.  Now we\n            see:\n\n            Ifty, Robert, Brad - and Brad's MOTHER, who sits several\n            seats behind Brad knitting.  Robert holds up a handmade sign\n            from the back of the courtroom \"Free Lucy Dawson\".\n\n<b>            INT. COURTROOM - ONE HOUR LATER\n</b>\n            Turner, the prosecuting attorney, examines his first witness. \n            He's disheveled, but don't let the rumpled suit fool you. \n            This man is razor-sharp.  The THERAPIST who evaluated Sam is\n            on the stand.  Sam anxiously rearranges all the pens on the\n            desk he sits at with Rita.  Projected on a SCREEN is a SLIDE\n            of the drawing Lucy made in school.\n\n<b>                                THERAPIST\n</b>                      ...there is an unhealthy reversal of\n                      roles here. \n                      As you can see from her drawings, she\n                      has an exaggerated sense of\n                      responsibility.  Lucy feels she has to\n                      take care of her father.  Although at\n                      her birthday party her true feelings\n                      about her father were revealed.\n\n<b>                                RITA\n</b>                      Objection.  \"True feelings revealed\"?!\n\n<b>                                TURNER\n</b>                      The state is paying Miss Geller for her\n                      opinions -\n\n<b>                                RITA\n</b>                      Then every child who rages because they\n                      didn't get to stay up for that extra\n                      hour of TV -\n\n<b>                                TURNER\n</b>                      Objection your honor -\n\n            Sam TUGS at Rita's sleeve.  She ignores it.\n\n<b>                                RITA\n</b>                      ...in fact any child who said they hated\n                      their parents because they didn't want\n                      to take a bath would be a prime\n                      candidate for Foster Care.\n\n<b>                                TURNER\n</b>                      Objection.\n\n<b>                                SAM\n</b>                      I think they want you to stop.\n\n<b>                                RITA\n</b>                      Really?!  Thank you, Sam.\n\n<b>                                JUDGE MCNEILY\n</b>                      We all appreciate your assistance Mr.\n                      Dawson - continue with your witness, Mr.\n                      Turner.\n\n<b>                                TURNER\n</b>                      Now Ms. Geller, I assume in your therapy\n                      session, Mr. Dawson extolled his\n                      parenting abilities.\n\n<b>                                THERAPIST\n</b>                      On the contrary, Mr. Dawson admitted he\n                      felt profoundly inadequate - that he was\n                      terrified he'd made and would continue\n                      to make - and I quote: \"Huge mistakes,\n                      huge mistakes, mistakes that are huge.\"\n\n<b>                                TURNER\n</b>                      No further questions.\n\n            Rita starts to scribble notes furiously.  So does Sam. \n            Turner smugly sits down.  Rita confidently strides toward the\n            witness.\n\n<b>                                RITA\n</b>                      You're a mother, aren't you Ms. Geller?\n\n<b>                                THERAPIST\n</b>                      Yes.\n\n<b>                                RITA\n</b>                      Would it be fair to say that as a\n                      parent, you've felt confused from time\n                      to time, possibly overwhelmed on\n                      occasion, even though you're a wonderful\n                      mother?\n\n<b>                                TURNER\n</b>                      Objection.  It's Mr. Dawson's parenting. \n                      Not Ms. Geller's that's at question\n                      here.\n\n<b>                                RITA\n</b>                      But if Ms. Geller has never had a moment\n                      where she felt confused as a mother it\n                      would bias her opinion.  And it is her\n                      expert opinion we're all after, isn't\n                      it, Mr. Turner?\n\n<b>                                JUDGE MCNEILY\n</b>                      Overruled.  I'll allow it.\n\n<b>                                RITA\n</b>                      Thank you, your Honor.  Ms. Geller, I\n                      know there have been many moments as a\n                      parent where I've felt I've made huge\n                      mistakes - mistakes that are huge.  And\n                      I've had to admit them to myself.  My\n                      husband.  But most importantly, to my\n                      therapist.  Which is the guise Mr.\n                      Dawson thought he was seeing you under,\n                      isn't that right, Ms. Geller?\n\n<b>                                TURNER\n</b>                      Objection.\n\n<b>                                JUDGE MCNEILY\n</b>                      Get to the point, Ms. Harrison.\n\n<b>                                RITA\n</b>                      The point is you've never had those\n                      moments, have you Ms. Geller?  Moments\n                      that every parent I've ever spoken to\n                      has - moments when you've felt the task\n                      is so unbelievably challenging that you\n                      feel retarded, disabled in some way. \n                      Moments when you feel everyone has the\n                      key but you.  But you've never had those\n                      moments, have you Ms. Geller?\n\n<b>                                THERAPIST\n</b><b>                      I -\n</b>\n<b>                                RITA\n</b>                      Yes or no?\n\n<b>                                THERAPIST\n</b><b>                      I - \n</b>\n<b>                                RITA\n</b>                      Let me rephrase the question.  When your\n                      son od'ed -\n\n<b>                                TURNER\n</b>                      Objection!\n\n<b>                                RITA\n</b>                      But if Ms. Geller didn't feel she had\n                      made mistakes - mistakes that were huge\n                      it might bias her opinion toward Mr.\n                      Dawson.\n\n<b>                                JUDGE MCNEILY\n</b>                      I will -\n\n<b>                                RITA\n</b>                      Thank you.  So Ms. Geller - yes or no -\n                      when your son od'ed, did you feel you\n                      might have made mistakes, mistakes that\n                      were huge?\n\n<b>                                THERAPIST\n</b>                          (tearfully)\n                      Yes.\n\n<b>            INT. COURTROOM CAFETERIA - DAY\n</b>\n            Sam and Rita go down the cafeteria line.\n\n<b>                                SAM\n</b>                      You made her cry.\n\n<b>                                RITA\n</b>                      You got lucky.\n\n<b>                                SAM\n</b>                      That's not nice.  Not very nice.\n\n<b>                                RITA\n</b>                      Only in there.\n\n<b>                                SAM\n</b>                      Your secretary too.  Yellow and green in\n                      one bowl.\n                          (Sam stares at a bowl of Lima\n                           beans and corn)\n                      You separate the Lima beans from the\n                      corn please?\n\n            The CAFETERIA WORKER stares at him.  Yeah.  Sure he will.\n\n<b>                                RITA\n</b>                      Sam, don't be impossible.\n                          (then to Worker)\n                      Can I have the spinach omelet - only egg\n                      whites no fat no oil no butter and extra\n                      mushrooms.\n\n<b>                                CAFETERIA WORKER\n</b>                      Absolutely.\n\n            Sam is anxiously separating his Lima beans and corn into\n            separate piles.  They arrive at the cashier.  Rita pulls out\n            her billfold.  Sam reaches for his wallet.\n\n<b>                                SAM\n</b>                      My treat.  My treat.\n\n<b>                                RITA\n</b>                      Don't be ridiculous.  I'll get it.\n\n<b>                                SAM\n</b>                      I said it's my treat.  That means I'll\n                      get it.\n\n<b>                                RITA\n</b>                      Sam, do you really want to get it or are\n                      you just trying to --\n\n<b>                                SAM\n</b>                      Trying to what?\n\n<b>                                RITA\n</b>                      You know, trying to act like a -\n\n<b>                                SAM\n</b>                      Like a what?\n\n<b>                                RITA\n</b>                      Like a...a...\n\n<b>                                SAM\n</b>                      A real man?\n\n<b>                                RITA\n</b>                      I didn't say that.\n\n<b>                                SAM\n</b>                      You're my lawyer and you think what they\n                      think.  I don't have a chance.  No\n                      chance at all.  Even with an expert\n                      witness.\n\n            Rita looks at him.  He's right.  She chooses her words\n            carefully.\n\n<b>                                RITA\n</b>                      I think...you deserve...a fair trial.\n\n<b>                                SAM\n</b>                      Answer the question.\n\n<b>                                RITA\n</b>                      Okay okay okay.  What was the question\n                      again?\n\n<b>                                SAM\n</b>                      Do you think what they think?  Sam can't\n                      order food.  Sam can't pay a check.  Sam\n                      can't take care of Lucy?\n\n<b>                                RITA\n</b>                      It doesn't matter what I think - it\n                      matters that we win.\n\n<b>                                SAM\n</b>                      You're my lawyer it matters what you\n                      think.\n\n<b>                                RITA\n</b>                      Hey, it doesn't matter to them what I\n                      think.\n\n<b>                                SAM\n</b>                      Me.  It matters to me.\n\n            He reaches for the receipt, and faces the CASHIER defiantly.\n\n<b>                                SAM (CONT'D)\n</b>                      Fourteen thirty three.  That's 5 ones, 2\n                      quarters and 16 cents less than twenty.\n\n            He slowly counts his money, takes his tray and walks away. \n            Rita watches him, with a trace of remorse and a hint of\n            admiration.\n\n<b>            INT. COURTROOM - DAY\n</b>\n            DR. DONOVAN, an attractive soft-spoken woman is on the stand. \n            Rita is working the room.  Sam, having a hard time\n            concentrating, is following a crack up the wall and onto the\n            ceiling.\n\n<b>                                RITA\n</b>                      Dr. Donovan, the American Medical\n                      Journal named you one of the country's\n                      leading oncologists.  Isn't that\n                      correct?\n\n<b>                                DR. DONOVAN\n</b>                      Yes.\n\n<b>                                RITA\n</b>                      What kept you going the twelve years you\n                      were in medical school?\n\n<b>                                DR. DONOVAN\n</b>                      Caffeine.  Sugar.  And my mother's\n                      confidence in me.\n\n<b>                                RITA\n</b>                      I wish I had a mother like that.  She\n                      must have been smart.\n\n<b>                                DR. DONOVAN\n</b>                      She had great instincts.\n\n<b>                                RITA\n</b>                      Do you have any idea what her IQ was?\n\n<b>                                DR. DONOVAN\n</b>                      In the lower ranges.  About eighty.\n\n<b>                                RITA\n</b>                      So your mother, this woman with the IQ\n                      of a nine-year old had the wisdom to\n                      recognize that you would be a great\n                      doctor.  I guess her disability didn't\n                      seem to hold you back in life.\n\n<b>                                DR. DONOVAN\n</b>                      No.  My mother's condition taught me\n                      what they can't teach you; compassion\n                      and patience.\n\n<b>                                RITA\n</b>                      Traits most doctors have in spades. \n                      Thank you, no further questions.\n\n            Sam runs to hug Dr. Donovan, bumping into Rita who sits him\n            down.\n\n<b>                                TURNER\n</b>                      How'd you get through medical school? \n                      Where'd you live?\n\n<b>                                DR. DONOVAN\n</b>                      We lived with my mother's parents.\n\n<b>                                TURNER\n</b>                      Oh, Grandma and Grandpa.  Would it be\n                      fair to say your grandparents were of\n                      normal intelligence?\n\n<b>                                DR. DONOVAN\n</b>                      Yes.\n\n<b>                                TURNER\n</b>                      And didn't these people - your\n                      grandparents - with normal intelligence -\n                      have the real responsibilities?\n\n<b>                                RITA\n</b>                          (relishing this)\n                      Objection!  I hear Mr. Turner's mother\n                      in-law lives with him!  She must help\n                      out.  Does that mean he doesn't have the\n                      real -\n\n<b>                                TURNER\n</b>                      Motion to strike that from the record. \n                      Irrelevant, immaterial and immature -\n\n<b>                                RITA\n</b>                      Irrelevant?!  Any parent has a right to\n                      a support system.\n\n<b>                                TURNER\n</b>                      I'm not talking about the rights of the\n                      parent, I'm talking about the rights of\n                      a child.\n                          (the gavel bangs)\n                      I'm talking about entrusting an eight\n                      year old's welfare in the hands of\n                      someone whose records show he was\n                      diagnosed with infantile autism, mental\n                      retardation...\n\n<b>                                RITA\n</b>                      Objection!  Motion to strike that from\n                      the record.  It's clear that one's\n                      intellectual capacity has no bearing on\n                      their ability to love.  You Honor, would\n                      you please instruct council to proceed\n                      with a modicum of sensitivity?\n\n<b>                                TURNER\n</b>                      Oh, I'm sensitive.  I'm real sensitive\n                      when I see people like you --\n                          (the gavel BANGS!)\n                      come here and try to give meaning to\n                      your life by screwing up somebody\n                      else's!\n<b>\t\t\t\t\t  \n</b><b>                                JUDGE MCNEILY\n</b>                      That's enough.  Both lawyers approach\n                      the bench!\n\n<b>                                RITA\n</b>                          (both approach)\n                      And I suppose tearing apart a family is\n                      truly noble work, Mr. Turner.\n\n<b>                                JUDGE MCNEILY\n</b>                      That's it.  I fine you both for\n                      contempt.  Two-hundred fifty dollars.\n\n<b>                                TURNER\n</b>                      What's that to her?  She gets that for\n                      picking up the phone.\n\n<b>                                RITA\n</b>                      Oh, that's what this is about.\n\n<b>                                TURNER\n</b>                      I'll tell you what this is about.  See\n                      this is an award for you at some\n                      luncheon.  But I'm here everyday.\n                          (gavel POUNDS AGAIN)\n                      You win, you're out the door. \n                      But guess who I see come back?  The kid. \n                      Most of the time, in less than a year. \n                      Only now it's too late.  So you're\n                      right.  I'm real sensitive.  You can't\n                      even touch that area.\n\n<b>            ON SAM\n</b>\n            Devastated.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. INSTITUTIONAL GRAY SOCIAL WORKERS OFFICE - DAY\n</b>\n            Margaret Brown observes Sam and Lucy.\n\n<b>                                LUCY\n</b>                      But how did he prove it?\n\n<b>                                SAM\n</b>                      Columbus had to sail around the world to\n                      prove it was round.\n\n<b>                                LUCY\n</b>                      You're so smart, Daddy.\n\n            Sam shoots a look at Margaret.  He hasn't heard anything nice\n            about himself in so long.  Lucy looks into her father's eyes.\n\n<b>                                LUCY (CONT'D)\n</b>                      Are we winning, Daddy?\n\n            Sam shoots ANOTHER look.  He doesn't want to lie.  Lucy\n            catches the look between Sam and Margaret.\n\n<b>                                MARGARET BROWN\n</b>                      Excuse me, time's up.\n\n<b>                                LUCY\n</b>                      Please.  Just a little more.\n\n<b>                                MARGARET BROWN\n</b>                      I have another client at two-thirty. \n                      You need to put your shoes on and get\n                      ready to go.\n\n<b>                                LUCY\n</b>                      Oh no!  There's a knot.  A really big\n                      knot.\n\n            Sam attempts to undo it.  Lucy and he work very slowly,\n            cherishing each moment together.\n\n<b>                                MARGARET BROWN\n</b>                      I'll help you.\n\n            She undoes it quickly.  Hands it back.\n\n<b>                                LUCY\n</b>                      I need to go to the bathroom.\n\n<b>            INT. BATHROOM - MOMENTS LATER\n</b>\n            Lucy's feet dangle from under the stall.  Margaret's sturdy\n            shoes from under another.  Suddenly, Lucy's head pops out and\n            now she quietly wriggles out from under the stall, tip toes\n            across the room and out the door.  Locking it with a key.\n\n<b>            INT. SOCIAL WORKERS ROOM - CONTINUOUS\n</b>\n            Lucy runs up to her father.\n\n<b>                                LUCY\n</b>                      Daddy, she said we could go to the park.\n\n<b>                                SAM\n</b>                      What's going on?  What made her change\n                      her mind?\n\n<b>                                LUCY\n</b>                      I started crying in the bathroom.  She\n                      thought we needed more time.\n\n<b>                                SAM\n</b>                      That was so nice of her.  Very nice.\n\n<b>            INT. BUS - DAY\n</b>\n            Sam and Lucy hold hands and look out the window.  Sam sees\n            Echo Park approaching and gets up.  Lucy pulls him back to\n            the seat.  She looks Daddy in the eye and in a furtive\n            whisper:\n\n<b>                                LUCY\n</b>                      Let's not get off.  Let's keep going.\n\n<b>                                SAM\n</b>                      No, Lucy.\n\n<b>                                LUCY\n</b>                      Please.\n\n<b>                                SAM\n</b>                      That would be wrong.\n\n<b>                                LUCY\n</b>                      Tamara's Mommy lost her case and Tamara\n                      hasn't seen her in six years.  She's had\n                      five different mommies and one of them\n                      hit her.\n\n<b>                                SAM\n</b>                      I won't let that happen.\n\n<b>                                LUCY\n</b>                      That's what her real mommy said.  And\n                      now they won't even let her talk to her.\n\n            Sam reels with confusion.  Lucy buries herself in his chest.\n\n<b>                                LUCY (CONT'D)\n</b>                      Daddy, it's the only way to be together. \n                      We'll start a new life, get new names. \n                      We'll live in a new apartment.  They'll\n                      never find us.\n\n            The bus has stopped.  Passengers for the park have exited. \n            Sam doesn't move.  As the BUSDRIVER closes the door and heads\n            on, he holds Lucy protectively to his chest.\n\n<b>                                SAM\n</b>                      I love you Lucy.  I love you.\n\n<b>                                LUCY\n</b>                      My name isn't Lucy anymore, it's\n                      Michelle.\n<b>\t\t\t\t\t  \n</b><b>            INT. BUS - NIGHT\n</b>\n            Lucy sleeps cuddled close to Sam, who is wide awake, as he\n            gazes out at the passing highway, far from home.  We hear the\n            song \"Michelle\".\n\n<b>            EXT. PARK - 4 A.M.\n</b>\n            Sam, totally disoriented, walks in circles around the plastic\n            tunnels and jungle gym.  A flashlight shines in Sam's face.\n\n<b>                                COP\n</b>                      Hey, buddy.  No loitering.  Move it.\n\n<b>                                SAM\n</b>                      Not yet not yet not yet.\n\n<b>                                COP\n</b>                      You want me to get a black and white\n                      down here?\n\n            He moves toward Sam.  SUDDENLY THE SPRINKLER SYSTEM goes on. \n            The cop backs off, but Sam doesn't move, standing in the\n            middle of the park and getting totally wet.\n\n<b>                                SAM\n</b>                      Not yet not yet not yet.\n\n            He shines the flashlight in Sam's face and we see INSIDE THE\n            PLASTIC TUNNEL where LUCY SLEEPS PEACEFULLY on a bed of\n            coats, holding a discarded stuffed animal.\n\n<b>                                COP\n</b>                      Jesus Christ.\n\n<b>                                SAM\n</b>                      She hasn't been sleeping well.  She\n                      needs a good night's rest.  Let her\n                      sleep, let her sleep.\n                          (the cop moves toward Sam)\n<b>                      NO!\n</b>\n<b>                                COP\n</b>                      What are you, crazy?\n\n            All the cop sees is a lunatic walking in protective circles\n            in the downpour of the sprinklers with a kid in a plastic\n            tunnel.\n\n<b>                                                           SMASH CUT TO:\n</b>\n<b>            INT. POLICE STATION - DAWN\n</b>\n            Police doors swing open as Rita, coat over pj's, a sleepy\n            DANNY by her side, storm inside.  Lucy lies on a bench with\n            her head in Sam's lap.\n\n<b>                                RITA\n</b>                      What were you thinking what were you\n                      possibly thinking?!\n\n<b>                                SAM\n</b><b>                      I -\n</b>\n<b>                                RITA\n</b>                      That's ridiculous!  Danny stay with me -\n                          (he moves away)\n                      What could you possibly gain by\n                      kidnapping your kid in the middle of a\n                      custody hearing?!\n\n<b>                                SAM\n</b>                      She -\n\n<b>                                RITA\n</b>                      I don't wanna hear it!  Can you possibly\n                      explain this to me?!\n\n<b>                                SAM\n</b>                      But Lucy said -\n\n<b>                                RITA\n</b>                      Who's the parent here?  Who's the\n                      goddamned parent here?  Danny!  Stay in\n                      the hallway -\n\n            Danny turns the corner just as Margaret Brown rushes in. \n            Rita turns to her - her expression changes on a dime.\n\n<b>                                RITA (CONT'D)\n</b>                      Miss Brown, I can imagine what you're\n                      thinking.\n\n<b>                                MARGARET BROWN\n</b>                      I'm -\n\n<b>                                RITA\n</b>                      But I ask you what parent in their right\n                      mind seeing their child in pain --\n\n<b>                                MARGARET BROWN\n</b>                      I have seen -\n\n<b>                                RITA\n</b>                      Their yearning for contact - wouldn't\n                      take them in an attempt to comfort them? \n                      Where the hell is Danny?\n\n<b>                                MARGARET BROWN\n</b>                      You - \n\n<b>                                RITA\n</b>                      He - \n\n<b>                                MARGARET BROWN\n</b>                      There's - \n\n<b>                                RITA\n</b>                      Oh yes there is!  And if I were you I'd\n                      look at my conscience you do have one\n                      don't you long and hard before I tried\n                      to use this in court.\n\n<b>                                MARGARET BROWN\n</b>                      Is that a threat?\n\n<b>                                RITA\n</b>                      No.  It's a plea.  Give'm a break. \n                      Give'm one goddman break.\n<b>\t\t\t\t\t  \n</b>            Margaret's cell phone RINGS.\n\n<b>                                MARGARET BROWN\n</b>                      What?!  No, Mrs. Sloan.  His temperature\n                      couldn't be 117, no not even 107.  Okay,\n                      okay, I'll come...Come on Lucy, I'll\n                      take you back.\n\n<b>                                RITA\n</b>                      C'mon, Danny.  We're going home. \n                      Danny!?  Danny!?!?\n\n            The FIRE ALARM GOES OFF and --\n\n<b>                                RITA (CONT'D)\n</b>                      Goddamn it, Danny!\n\n            Rita avoids Margaret's look.  Margaret's cell phone goes off\n            again.  She doesn't answer.  Now Rita looks at Margaret, but\n            this time Margaret avoids looking at her.  Lucy runs to Rita\n            and throws her arms around her waist.\n\n<b>                                LUCY\n</b>                      Please don't fire us.  It was all my\n                      idea.  Please don't.  Please.  Please.\n\n            Rita is disarmed.  She's moved and not used to being moved.\n\n<b>            INT. COURTROOM - DAY\n</b>\n<b>                                BAILIFF\n</b>                      ...the whole truth, and nothing but the\n                      truth, so help you God?\n\n            Lucy's in her best dress, being sworn in.  One hand in the\n            air.\n\n<b>                                LUCY\n</b>                      So help me God...\n\n            And now CAMERA MOVES AROUND HER AND WE SEE THAT SHE'S HIDING\n<b>            HER OTHER HAND BEHIND HER BACK - FINGERS CROSSED.\n</b>\n<b>            INT. COURTROOM - LATER\n</b>\n            Lucy is on the stand, Turner is cross-examining her.\n\n<b>                                TURNER\n</b>                      I heard you turned seven this year. \n                      That's pretty exciting.\n\n<b>                                LUCY\n</b>                      Everybody gets older.  It's not that big\n                      a deal.\n\n<b>                                TURNER\n</b>                      What'd you get for your birthday?\n\n<b>                                LUCY\n</b>                      I haven't opened my presents yet.\n\n<b>                                TURNER\n</b>                      Really?  That's odd.  Why not?\n\n            Lucy looks to her father and Rita.\n\n<b>                                LUCY\n</b>                      I opened my presents.  I got the HELP\n                      album - limited edition.\n\n<b>            ON RITA AND SAM\n</b>\n            What is she doing?\n\n<b>                                TURNER\n</b>                      Oh, I'm sorry.  I was confused.  I\n                      thought you didn't open your birthday\n                      presents because you ran away from your\n                      own party when your best friend told\n                      everyone that you were adopted.\n\n<b>                                LUCY\n</b>                      I never said that; why would I say that?\n\n<b>                                TURNER\n</b>                      Why would your friends say it if you\n                      hadn't said it?\n\n<b>                                LUCY\n</b>                      Kids lie all the time.\n\n            Next to her skirt, we see her fingers are crossed so hard\n            they're practically turning purple.\n\n<b>                                TURNER\n</b>                      May I remind you Lucy that you're under\n                      oath?\n\n<b>                                LUCY\n</b>                      You may.\n\n<b>                                TURNER\n</b>                      And do you know that means if you lie\n                      you could be in serious trouble?\n\n<b>                                LUCY\n</b>                      I do.\n\n<b>                                TURNER\n</b>                      So now that you and I have agreed to\n                      tell the truth, where did you sleep last\n                      night?\n\n            Rita glares at Margaret.  Thanks a lot.\n\n<b>                                LUCY\n</b>                      In my bed at the Foster home.\n\n<b>                                TURNER\n</b>                      All right, Lucy.  If you're not going to\n                      tell the truth, I am.  Your dad\n                      kidnapped you last night and the police\n                      found you sleeping in a seedy park a\n                      hundred miles from here.  You're lying\n                      right now because you're afraid.  Afraid\n                      that everyone will see how scared and\n                      frustrated you really are.  You're\n                      afraid of hurting him, but now we need\n                      to tell the truth.  The truth is deep\n                      inside you know you're not getting what\n                      you need from your father.  Isn't that\n                      right, Lucy?\n\n            A LONG SILENCE.  She stares at Turner defiantly.\n\n<b>                                LUCY\n</b>                      \"All you need is love.\"\n\n<b>            INT. COURTROOM CORRIDOR - DAY\n</b>\n            WE HEAR THAT SONG as Sam and Rita walk out of the courtroom. \n            Rita is breaking pieces off a candy bar she has stuffed in\n            her purse.  They see Lucy running down the corridor toward\n            Sam, Margaret Brown behind her.\n\n<b>                                LUCY\n</b>                      Daddy!  I did great, didn't I?\n\n<b>                                SAM\n</b>                      No, Lucy, you lied.\n\n<b>                                LUCY\n</b>                      Shhh!  Don't tell anyone.\n\n            Rita watches Sam.  Moved by his concern as a parent.\n\n<b>                                MARGARET BROWN\n</b>                      Lucy, Mrs. Kerry's here to take you\n                      back.\n\n<b>                                LUCY\n</b>                      I thought you'd be proud of me.  Jo Jo's\n                      mom told him to lie on the stand and say\n                      he never saw a needle in the house; and\n                      he did, and now they're back together.\n\n<b>                                SAM\n</b>                      Jo Jo isn't us.  The truth, the truth,\n                      when the judge hears the truth, he'll\n                      know, he'll know we should be together.\n\n<b>                                LUCY\n</b>                          (bursting)\n                      Nobody's interested in the truth, Daddy. \n                      Nobody cares!\n\n            They lead her down the hallway toward Mrs. Kerry - Sam's\n            voice gets louder and louder - determined to make her hear.\n\n<b>                                SAM\n</b><b>                      I CARE!  DO YOU HEAR ME?  THE TRUTH. \n</b><b>                      THE WHOLE TRUTH!  SO HELP ME GOD!!\n</b><b>\t\t\t\t\t  \n</b><b>            INT. SAM'S APARTMENT - NIGHT\n</b>\n            The darkness of Sam's apartment.  We see him on his knees. \n            Saying his prayers by his bedside.\n\n<b>                                SAM\n</b>                      Help me, God.  Help me, God.  Help me,\n                      God...\n\n            We see ANNIE'S SILHOUETTE from the window of her apartment as\n            it moves across the frame.\n\n<b>            INT. COURTROOM - DAY\n</b>\n            Turner cross examines George, the manager of Starbucks.\n\n<b>                                GEORGE\n</b>                      Sam's my most reliable employee.  He's\n                      never missed a day of work in eight\n                      years.  Always warm, always friendly.\n\n<b>                                TURNER\n</b>                      Admirable qualities for a single father. \n                      Mr. Walker, in these eight years, have\n                      Mr. Dawson's responsibilities,\n                      which...let me see...would include\n                      bussing tables, replenishing Sweet 'n\n                      Lows, and sweeping up the place...\n                      increased?\n\n<b>                                GEORGE\n</b>                      No.  Not really.\n\n<b>                                TURNER\n</b>                      And isn't that because he's mentally\n                      incapable of learning management skills\n                      or working the cash register or even\n                      making a cup of coffee?\n\n<b>                                RITA\n</b>                      Objection.  Leading the witness.\n\n<b>                                JUDGE MCNEILY\n</b>                      You may answer the question.\n\n            George searches for a way to tell the truth.\n\n<b>                                GEORGE\n</b>                      Well as a matter of fact, Sam and I have\n                      been discussing a promotion that I was\n                      planning on putting into effect at the\n                      end of the week.\n\n            Sam leaps to his feet.\n\n<b>                                SAM\n</b>                      Oh boy!  Thank you, George!\n\n            Rita pulls him down.  Turner seizes the moment.\n\n<b>                                TURNER\n</b>                      Yes.  Thank you, George.  Now, after\n                      eight years, Sam can finally measure out\n                      a teaspoon of coffee and cup of water. \n                      Now, he must certainly be able to help\n                      Lucy with her geometry.\n\n<b>                                RITA\n</b>                      Objection -\n\n<b>                                TURNER\n</b>                      No further questions.\n\n<b>            INT. COURTROOM CORRIDOR - LATER\n</b>\n            Rita prepares Ifty.\n\n<b>                                RITA\n</b>                      ...and when I ask another question?\n\n<b>                                IFTY\n</b>                      I answer in one sentence.\n\n<b>                                RITA\n</b>                      Yes.  Short and sweet.\n\n<b>                                IFTY\n</b>                      Yes.  One sentence.  Short and sweet. \n                      My aunt was short and sweet.  But her\n                      cooking was too spicy she...\n\n            Rita's twitching foot knocks over her purse.  Out spill\n            several Snickers Bars with the chocolate picked off them. \n            Embarrassed, she kneels to pick them up when she and Sam see\n            something that stops them both, awestruck.  In the corner of\n            the corridor, huddled on a bench in dark sunglasses, sits\n            ANNIE IN A PROFESSIONAL BUSINESS SUIT.  Sam runs to her.\n\n<b>                                SAM\n</b>                      Annie!  I can't believe it!\n\n<b>                                ANNIE\n</b>                          (visibly trembling)\n                      Tell them to take me quickly.\n\n<b>                                RITA\n</b>                      Give me one minute with the judge.\n\n<b>            INT. COURTROOM - FIFTEEN MINUTES LATER\n</b>\n            Annie, wearing her dark glasses, is being questioned by Rita.\n\n<b>                                RITA\n</b>                      Besides being Lucy's godmother, aren't\n                      you also Lucy's piano teacher?\n\n<b>                                ANNIE\n</b>                      Yes.\n\n<b>                                RITA\n</b>                      Lucy's very lucky.  Didn't you graduate\n                      Magna Cum Laud from the Julliard School\n                      of Music?\n\n<b>                                ANNIE\n</b>                      Summa Cum Laud.\n\n<b>                                RITA\n</b>                          (delighted)\n                      Excuse me.  Now Ms. Cassell, in all the\n                      time you've known them, have you ever\n                      questioned Sam's ability as a father?\n\n<b>                                ANNIE\n</b>                      Never.\n\n<b>                                RITA\n</b>                      Never?\n\n<b>                                ANNIE\n</b>                      Never.  Look at Lucy.  She's strong,\n                      she's able to display true empathy for\n                      people, all kinds of people.  I know you\n                      all think she's as bright as she is\n                      despite him.  But it's because of him.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            INT. COURTROOM - LATER\n</b>\n            Turner stands where Rita did.\n\n<b>                                TURNER\n</b>                      Can Sam add?\n\n<b>                                ANNIE\n</b>                      Yes.\n\n<b>                                TURNER\n</b>                      How about multiplication?\n\n<b>                                ANNIE\n</b>                      He's learning.\n\n<b>                                TURNER\n</b>                      So what you're saying is that Sam can\n                      not even multiply two times two?  \n\n<b>                                ANNIE\n</b>                      I don't know about you, Mr. Turner, but\n                      my fondest memories of my parents have\n                      nothing to do with times tables or state\n                      capitals.\n\n<b>                                TURNER\n</b>                      I bet he's knocking on your door all the\n                      time with questions.\n\n<b>                                ANNIE\n</b>                      Yes.  All the time.  The last question\n                      was whether to use Biz or Clorox to get\n                      the grass stains out of Lucy's soccer\n                      uniform.\n\n<b>            ON RITA AND SAM\n</b>\n            This is too good to be true.\n\n<b>                                TURNER\n</b>                      So let's see..he doesn't know math...he\n                      can't even wash her clothes.  How about\n                      puberty?  I can only imagine how much\n                      insight he'll bring to approaching the\n                      sensitive issues of a young girl's\n                      development.\n\n<b>                                ANNIE\n</b>                      Mr. Turner, show me a father, any\n                      father, who knows how to do that and\n                      I'll give them the Parent of the Year\n                      award.\n\n<b>                                TURNER\n</b>                      And you've had plenty of opportunity to\n                      observe fathers, haven't you?\n\n<b>                                RITA\n</b>                      Objection!\n\n<b>                                TURNER\n</b>                      But the fact that Ms. Cassell hasn't\n                      come out of her room in years might have\n                      some effect on her perception.\n\n<b>                                JUDGE MCNEILY\n</b>                      I'll allow it.\n\n<b>                                ANNIE\n</b>                      I had twenty eight years in the world to\n                      observe all kinds of fathers.\n\n<b>                                TURNER\n</b>                      What about your father, Ms. Cassell? \n                      Since you appear to be an expert on\n                      father-daughter relationships.\n\n            A long pause.  Sam watches as Annie visibly tightens.\n\n<b>                                TURNER (CONT'D)\n</b>                      Excuse me, Ms. Cassell, I didn't hear\n                      your response.  What about your father?\n\n            Annie reaches for her water glass.  We see her hand SHAKE. \n            It knocks over the glass, shattering it on the floor.\n\n<b>                                SAM\n</b>                      Objection!  No further questions!\n\n<b>                                TURNER\n</b>                      Excuse me, Mr. Dawson?\n\n<b>                                SAM\n</b>                      I said that's enough!  I will not allow\n                      it!  Overruled!  Overruled!!\n\n            Rita doesn't stop him.  The Judge hesitates, incredulous,\n            then pounds the gavel as the courtroom erupts.\n<b>\t\t\t\n</b><b>            EXT. SAM'S APARTMENT - DUSK\n</b>\n            Rita sits in her Porsche with Annie and Sam.  Annie is curled\n            into a tight ball in the passenger seat.  Sam is tucked into\n            the shelf in the back.  His legs kick Rita in the face with\n            every gear shift.\n\n<b>                                RITA\n</b>                      Thank you again, Annie.  You were truly\n                      extraordinary.\n\n<b>                                SAM\n</b>                      Extraordinary.  Truly extraordinary.\n\n            Annie doesn't move.\n\n<b>                                RITA\n</b>                      Okay okay okay okay.  Well, Sam has his\n                      big day on the stand tomorrow and we\n                      need to work a little bit so that he's\n                      as effective as you were.\n\n<b>                                SAM\n</b>                      Effective.  Very effective.\n\n<b>                                RITA\n</b>                      On a Porsche, the, uh, the door handle\n                      is a little hidden by that thingamajig,\n                      so if you're having a hard time finding\n                      it I'll just --\n\n            Rita reaches across to open Annie's door when she SCREAMS!\n\n<b>                                ANNIE\n</b>                      Noooooooo!\n\n<b>                                SAM\n</b>                      Annie's not quite ready to go outside\n                      yet.\n\n<b>                                RITA\n</b>                      Okay, we'll just take our time.\n\n<b>            INT. PORSCHE - TWO HOURS LATER\n</b>\n            It's dark now.  Annie is still catatonic.  Rita's on the car\n            phone, the kind that voice activates and she's yelling.\n\n<b>                                RITA\n</b>                      Home!  Home!  HOME GODDAMNIT!  Juanita,\n                      help Danny with his English assignment. \n                      Ayude Danny un story...story...STORIO!\n\n<b>                                ANNIE\n</b>                          (rising from the dead)\n                      I'm ready now.\n\n<b>                                RITA\n</b>                          (gently)\n                      Good, fine, Sam?  Annie's ready.\n\n            Sam's fallen asleep.\n\n<b>            EXT. RITA'S LAVISH BEL AIR HOME - NIGHT\n</b>\n            Rita and Sam enter.\n\n<b>            INT. RITA'S BEL AIR HOME - NIGHT\n</b>\n            Sam is awestruck at the magnificent home.\n\n<b>                                RITA\n</b>                      Okay okay okay okay.  We'll work in the\n                      library.  It's down the hall and to the\n                      left.\n\n            They pass another room and see Danny zoned out in front of\n            the wide-screen TV watching MUTANT NINJA TURTLES.\n\n<b>                                RITA (CONT'D)\n</b>                      Hey, Danny.  \n                          (no answer)\n                      Where's your father?\n\n<b>                                DANNY\n</b>                          (staring at TV)\n                      Guess.\n\n<b>                                RITA\n</b>                      I don't want to guess.  Where is he?\n                          (Sam watches Rita)\n                      I told you I don't want to guess.\n\n<b>                                DANNY\n</b>                      Well where was he last night?\n\n<b>                                RITA\n</b>                      Working late.\n\n<b>                                DANNY\n</b>                      There you guessed it.\n\n<b>                                RITA\n</b>                      He said he was working late?\n\n<b>                                DANNY\n</b>                      That's what he said.\n\n<b>                                RITA\n</b>                      Well who did he say was taking care of\n                      you?\n\n<b>                                DANNY\n</b>                      You.  But you said you were working\n                      late.\n\n<b>                                RITA\n</b>                      I am working late.\n\n<b>                                DANNY\n</b>                      Then go work.\n\n<b>                                RITA\n</b>                      How was your day?\n\n<b>                                DANNY\n</b>                      You have to work.  Go work.\n\n<b>                                RITA\n</b>                      No.  How was your -\n\n            Her CELL PHONE goes off.  Rita moves into the hallway to\n            answer her phone.  Sam moves into the den, sits on the couch,\n            the sound of Rita arguing with her husband drifts into the\n            room.  Sam looks sideways at Danny who remains stonefaced.\n\n<b>                                SAM\n</b>                      This is my favorite part.  Hey Dommy,\n                      this one looks like he's suffering from\n                      shell shock.\n\n<b>                                DANNY\n</b>                      Boy I guess we can shell it out... It\n                      was a shell of a good hit.\n\n            Rita stands in the doorway watching Sam have a longer\n            conversation with her son than she's had in months.  She\n            retreats.\n\n<b>            INT. RITA'S DEN - LATER\n</b>\n            Danny and Sam eat popcorn watching the movie.\n\n<b>                                SAM\n</b>                          (bellowing)\n                      \"Turtles in the half-shell, turtle\n                      power!\"  Rita!  Come this is the best\n                      part.\n\n            He heads towards Rita.\n\n<b>            INT. PANTRY - CONTINUOUS\n</b>\n            In the half-light Sam catches a glimpse of Rita standing in\n            the pantry unconsciously stuffing marshmallows into her\n            mouth.  Their eyes lock for a moment.\n\n<b>                                SAM\n</b>                      You eat too fast.  Come watch the movie.\n\n<b>                                RITA\n</b>                      It's getting late.  We have to get to\n                      work.\n                          (handing him a suit)\n                      This is my husband's.  He won't notice. \n                      He's got ten more just like it.  Try it\n                      on.\n\n<b>            INT. RITA'S LIBRARY - MOMENTS LATER\n</b>\n            Sam comes out of the bathroom in the new suit.  Rita stares\n            at him astonished.  He looks incredibly handsome.  Rita,\n            attempting to stifle her reaction, turns away from Sam.\n\n<b>                                SAM\n</b>                      Bad?\n\n<b>                                RITA\n</b>                      No.  Very, very good.  But your tie's\n                      crooked.\n\n            Rita stands behind Sam with her around him showing him how to\n            do his tie properly.  Their images are reflected in the\n            mirror.\n\n<b>                                RITA (CONT'D)\n</b>                      Cross over once.  Loop it around on the\n                      inside of your neck.\n                          (her hand grazes his neck)\n                      Slide the other side through the loop,\n                      then tighten.\n\n            Rita comes around to the front and straightens and tightens\n            the tie.  They are both nervous.  The room is charged.\n\n<b>                                RITA (CONT'D)\n</b>                      Okay okay okay okay.  Our strategy is\n                      that we're aggressively pursuing a\n                      support system.  I'm going to ask you h\n                      ow are you prepared to help Lucy in\n                      school?\n\n<b>                                SAM\n</b>                      Let me see let me see let me see.\n\n<b>                                RITA\n</b>                      Sam!  I told you you have to stop that! \n                      It makes you look stupid!  Okay okay\n                      okay.  Try again.\n                          (endless pause)\n                      You say you will find her a tutor.  Then\n                      I say, \"How will you pay for it?\"\n\n<b>                                SAM\n</b>                      Could you slow down?  Why do you eat so\n                      fast?\n\n<b>                                RITA\n</b>                          (ignoring him)\n                      We've gone over this a million times. \n                      You've found a free tutoring service for\n                      her at the YMCA.\n\n<b>                                SAM\n</b>                      But I didn't.  You did.\n\n<b>                                RITA\n</b>                      Can't you grasp the concept of\n                      manipulating the truth?  Not lying. \n                      Just a little tweak here and there.\n\n<b>                                SAM\n</b>                      No...You're so lucky.  You get to play\n                      with Danny all the time.\n\n<b>                                RITA\n</b>                      He doesn't want to play with me.\n\n<b>                                SAM\n</b>                      Yes he does.  He does he does.  He\n                      thinks you don't want to.\n\n<b>                                RITA\n</b>                      Oh that's ridiculous of course I want\n                      to.\n\n<b>                                SAM\n</b>                      Tweak, tweak.\n\n<b>                                RITA\n</b>                          (exploding)\n                      I drove around after work yesterday 'til\n                      9:30 looking for a goddman razor\n                      scooter!\n\n<b>                                SAM\n</b>                          (in his own world)\n                      Tweak, squeak, peek peek...\n\n            Rita shifts uneasily, embarrassed by her overreaction.\n<b>\t\t\t\n</b><b>            INT. RITA'S LIBRARY - LATER\n</b>\n<b>                                RITA\n</b>                      Okay, why did you harass that young boy\n                      at your home?\n\n<b>                                SAM\n</b>                      You know I didn't harass him, Rita.  You\n                      know that, you know that!\n\n<b>                                RITA\n</b>                      Sam, I'm pretending to be Mr. Turner,\n                      remember?  Okay?\n\n<b>                                SAM\n</b>                      Oh yeah yeah yeah yeah.  I didn't harass\n                      him, Mr. Turner.  Mr. Turner -\n                          (Sam can't keep a straight\n                           face)\n                      You don't look like him.\n\n<b>                                RITA\n</b>                      That's a blessing.\n\n<b>                                SAM\n</b>                      You're so much prettier.\n\n<b>                                RITA\n</b>                          (suddenly shy)\n                      Thank you.  Now. \n                      What makes you think you can take care\n                      of a woman - I mean a young child - when\n                      you have a hard time taking care of\n                      yourself?\n\n<b>            INT. RITA'S LIBRARY - TWO HOURS LATER\n</b>\n            Rita is relentless.  Sam is exhausted but determined.\n\n<b>                                RITA\n</b>                      But who are you kidding?  Isn't Lucy\n                      already smarter than you?\n\n<b>                                SAM\n</b>                      In some ways.  But in other ways, she's\n                      not, I think.\n\n<b>                                RITA\n</b>                      You think?\n\n<b>                                SAM\n</b>                      I think.\n\n<b>                                RITA\n</b>                      Sam.  You've got to be firm on this.\n\n<b>                                SAM\n</b>                      I think in other ways I'm smarter than\n                      her.  Smarter than you are, Mr. Turner. \n                      In fact, in some ways I'm smarter than\n                      you, Judge McNeilly.\n\n<b>                                RITA\n</b>                      Whoa!  Bring it down.\n\n<b>                                SAM\n</b>                      What parent doesn't want more for their\n                      child?  To be more than the sum of the\n                      parts of the whole of them.\n\n<b>                                RITA\n</b>                      Yeah yeah yeah, but it's one thing for a\n                      little girl to love her daddy when she's\n                      a baby, but once she loses respect for\n                      you, what will you do?\n\n<b>                                SAM\n</b>                          (fierce)\n                      I won't let that happen.  I won't.\n\n<b>                                RITA\n</b>                      How can you say that?\n\n<b>                                SAM\n</b>                      Respect is not just about how smart\n                      someone is.  Smart is not just about how\n                      smart someone is.\n\n<b>                                RITA\n</b>                      But what about Lucy?  Aren't you being\n                      selfish?  Doesn't she deserve a better\n                      life?  Don't you think she's just\n                      pretending she's happy to not hurt your\n                      feelings?  \n\n            Sam jumps up from the table, trembling with anger.\n\n<b>                                SAM\n</b>                      Lucy is happy!  We have fun!  We go to\n                      Denny's, we go to video night.  I know\n                      how to love her.  I know I'm not going\n                      to able to go to law school and learn\n                      how to be a mean person, but I know how\n                      to love.  I know how to be her father,\n                      Mr. Turner!\n\n            By this time he is face to face with Rita, breathing hard,\n            overcome with emotion.  Rita is unexpectedly near tears. \n            Suddenly before she knows it, she is HOLDING SAM.  The room\n            charged.  She speaks tenderly, moved by this awkward boy/man.\n\n<b>                                RITA\n</b>                      I know you do, Sam.  I know you do.\n<b>\t\t\t\t\t  \n</b><b>            INT. STARBUCKS - MORNING\n</b>\n            Sam rushes into the coffee shop in his new suit.\n\n<b>                                GEORGE\n</b>                      You look great, Sam.  What time do you\n                      have to be in court?\n\n<b>                                SAM\n</b>                      Half day, half day.  I take the stand at\n                      two.\n\n            George leads him behind the counter.  THE STAFF BEAMS. \n            Euphorically, Sam approaches the huge espresso machines.\n\n<b>                                GEORGE\n</b>                      Okay, we need two grande cappucinos, non\n                      fat.\n\n<b>                                SAM\n</b>                      Sprinkles or Cinnamon?\n\n<b>            INT. STARBUCKS - 11:00 A.M.\n</b>\n            Sam is doing great.  He's humming as he prepares a triple\n            latte with the precision of a Swiss watchmaker.\n\n<b>            INT. STARBUCKS - 12:00 P.M.\n</b>\n            The place is packed, including a GROUP OF JAPANESE TOURISTS. \n            Sam zips around, trying to juggle between the blender, the\n            espresso machine, steamed milk, icemaker, all the while\n            glancing up at the clock.  Sam hands three cups to customers,\n            the foam overflowing, coffee spilling out.\n\n            A CUSTOMER takes a sip and SPITS IT OUT.\n\n<b>                                GUY\n</b>                      What is this?  I ordered an Americano,\n                      not a latte.\n\n<b>                                SAM\n</b>                      Americano, Americano, not a latte.\n\n            Working as fast as he can but still NOT FAST ENOUGH, Sam\n            unconsciously drinks the latte.\n\n<b>            INT. STARBUCKS - 12:45 P.M.\n</b>\n            Hyped on coffee, Sam is zooming around and he's a mess. \n            Shirt hangs out, coffee stains on it, his hair wild. \n            Frazzled, he forgets to put the lid on the blender and turns\n            it ON.  A mint mocha frappuccino SPLATTERS HIM in the face. \n            At that moment, George comes out of his office.\n\n<b>                                SAM\n</b>                      I'm going to be late!  I'm going to be\n                      late!\n\n<b>                                GEORGE\n</b>                      I'll call a taxi.\n\n<b>                                SAM\n</b>                      No, no, I can't wait.  I can't wait. \n                      I've got to go right now.\n\n            Sam heads out, the coffee drink still dripping from his face.\n\n<b>            EXT. STREET - DAY\n</b>\n            Walking a hundred miles an hour, Sam barrels down the street\n            out of his mind.  Cars are jammed up.  He walks over them, a\n            man possessed.\n\n<b>            INT. COURTROOM - DAY\n</b>\n            Everyone is in their places, waiting.\n\n<b>                                TURNER\n</b>                      Your Honor, if the defendant doesn't\n                      have enough interest in his daughter to\n                      even show up -\n\n<b>                                RITA\n</b>                      Your Honor, I'm sure he'll be here any\n                      moment.  This is an extremely important\n                      day to Mr. Dawson.\n\n            At THAT MOMENT, Sam bursts through the doors.  Suit stained,\n            hair sticky with frappuccino.  Rita's jaw drops.\n\n<b>                                RITA (CONT'D)\n</b>                      Your Honor, may I have a moment with my\n                      client?\n\n<b>                                JUDGE MCNEILY\n</b>                      Make it brief, Ms. Harrison.\n\n            Rita heads towards Sam.  Up close, he looks even worse.  \n\n<b>                                RITA\n</b>                      What the hell happened?\n                          (sniffing the air)\n                      What is that smell?  Mint?\n\n            Sam, determined, heads for the stand.  Rita grabs Sam's\n            shoulders and tries to focus him.  Looks deep into his eyes.\n\n<b>                                RITA (CONT'D)\n</b>                      Sam, look at me.  Look at me! \n                          (he does)\n                      I will guide you like last night.\n                          (Sam hugs her)\n                      Not that part of last night, the other\n                      part.  Now you can do it.  I know you\n                      can.  Lucy needs you.\n\n<b>                                SAM\n</b>                          (a mile a minute)\n                      Lucy needs me.\n\n<b>                                RITA\n</b>                      Yes, slow down because Lucy needs you.\n\n<b>                                SAM\n</b>                      Lucy needs you.\n\n<b>                                JUDGE MCNEILY\n</b>                      Ms. Harrison.  We need you!\n\n<b>            INT. COURTROOM - LATER\n</b>\n            Sam, on the stand, talks a mile a minute from the coffee.\n\n<b>                                RITA\n</b>                      How will you be able to pay for private\n                      tutoring?\n\n<b>                                SAM\n</b>                      There's a free program at the YMCA. \n                      Lucy can go there.\n\n<b>                                RITA\n</b>                      But don't you ever think it would be\n                      better for Lucy if she lived with a\n                      permanent foster family and you could\n                      visit whenever you wanted?\n\n<b>                                SAM\n</b>                      The Fosters don't know her.  Why can't\n                      she live with me and they can come visit\n                      if they want to.  I'm firm on this.  And\n                      I'm getting firmer.  Lucy belongs with\n                      me.\n\n<b>                                RITA\n</b>                      Why?\n\n            Sam puts his finger to his chin and starts his \"Let me\n            see...\" Rita gives him a look; he lowers his finger and\n            starts talking very fast from the coffee.  The STENOGRAPHER\n            desperately tries to keep pace.\n\n<b>                                SAM\n</b>                      Paul wrote the first part of the song\n                      \"Michelle\".  He said to John, \"Where do\n                      I go from here?\"  John had been\n                      listening to Nina Simone.  There was a\n                      line in it that went something like, \"I\n                      love you, I love you, I love you...\"\n                      They put that into the song.  It\n                      wouldn't be the same song without that. \n                      It made the song complete.  That's why\n                      the whole world cried when they broke up\n                      on April 10, 1970.\n\n<b>            ON RITA\n</b>\n            Well, he has some kind of point. \n\n            MARY, the Stenographer, is still typing.\n\n<b>                                JUDGE MCNEILY\n</b>                      Did you get that, Mary?\n\n<b>            INT. COURTROOM - LATER\n</b>\n            Turner fires questions at Sam - a mile a minute.\n\n<b>                                TURNER\n</b>                      When you were Lucy's age, were you\n                      living at home?\n\n<b>                                SAM\n</b>                      No.\n\n<b>                                TURNER\n</b>                      Were you living with your mother and\n                      father?\n\n<b>                                SAM\n</b>                      No.\n\n<b>                                TURNER\n</b>                      Well then where were you living?\n\n<b>                                SAM\n</b>                          (very quietly)\n                      In an institution.\n\n<b>                                TURNER\n</b>                      So your parents put you in an\n                      institution?\n\n<b>                                SAM\n</b>                      Only after my mom got sick.\n\n<b>                                TURNER\n</b>                      What about your father?  Where was he?\n\n<b>                                SAM\n</b>                      Gone with the wind when Sam was born.\n\n<b>                                TURNER\n</b>                      So, you weren't raised by your mother?\n\n<b>                                SAM\n</b>                      I saw her I saw her.\n\n<b>                                TURNER\n</b>                      When?\n\n<b>                                SAM\n</b>                      Christmas, Easter and my birthday.\n\n<b>                                TURNER\n</b>                      Oh, once a year on your birthday.  So in\n                      a way, the people at the institution\n                      were your parents.  Were they nice to\n                      you?\n\n<b>                                SAM\n</b>                      Some yes.  Some on.  Some yes.\n\n<b>                                TURNER\n</b>                      Did they hit you?\n\n<b>                                SAM\n</b>                      Sometimes.  Sometimes they did\n                      sometimes.\n\n<b>                                TURNER\n</b>                      Like when you hit Lucy's friend at her\n                      birthday party?\n\n<b>                                RITA\n</b>                      Objection!  Nobody hit anybody!\n\n<b>                                TURNER\n</b>                      Let me rephrase that, strong-armed.  So\n                      what role model do you call upon as a\n                      father when you're parenting Lucy?  The\n                      head of the institution?  The Principal \n                      the warden?\n\n<b>                                SAM\n</b>                      No.  Not Mr. Whitehead.  Not him.\n\n<b>                                TURNER\n</b>                      Then who?\n\n<b>                                SAM\n</b>                      Myself.\n\n<b>                                TURNER\n</b>                      you have the mental capacity of a seven\n                      year old.  So you ask yourself, a seven\n                      year old -\n\n<b>                                SAM\n</b>                      I am not a seven-year old.\n\n<b>                                TURNER\n</b>                      How to parent a fellow seven-year old?\n\n<b>                                SAM\n</b>                      Yes.  No.  What was the question?\n\n<b>                                TURNER\n</b>                      The question is: what makes you think\n                      you can be a parent?  Your background? \n                      Your IQ?  Your friends who can't even\n                      testify for you?\n\n<b>                                RITA\n</b>                      Objection -\n\n<b>                                SAM\n</b>                      My friends -\n\n<b>                                RITA\n</b>                      Objection -\n\n<b>                                SAM\n</b>                      My friends love Lucy even if Rita\n                      thought they weren't smart enough to\n                      testify.  Even if she said you'd wipe\n                      the floor with them.\n\n<b>            ON RITA\n</b>\n            Trying to telepathically reach Sam.\n\n<b>                                TURNER\n</b>                      Excuse me, Mr. Dawson, your lawyer just\n                      objected; that means you didn't have to\n                      answer the question.  You can't even\n                      follow the simple rules you've watched\n                      here day after day.  You really think\n                      you can raise a seven-year old?  A ten\n                      year old?  A thirteen-year old?\n                          (in his face)\n                      That means she'll be six years more\n                      advanced than you.\n\n            Sweat pours down Sam's coffee stained collar.  He searches\n            for words.  Then from the clearest place inside himself:\n\n<b>                                SAM\n</b>                      I've had a lot of time to think about\n                      whatever it is that makes somebody a\n                      good parent.  It has to do with\n                      constancy.  It has to do with patience. \n                      It has to do with listening.  To\n                      pretending to listen when you can't even\n                      listen anymore.\n\n            The court is riveted by Sam's eloquence.  Rita's amazed.\n\n<b>                                SAM (CONT'D)\n</b>                      It has to do with love, like she says...\n\n            Rita's antenna goes up: who's \"she?\"\n\n<b>                                SAM (CONT'D)\n</b>                      And I don't know where it's written that\n                      a woman has a corner on that market,\n                      that a man has any less of those\n                      emotions than a woman.  Billy has a home\n                      with me!  It's not perfect!  I'm not a\n                      perfect parent!  Sometimes I forget he's\n                      just a little kid...\n                          (whispers from the courtroom)\n                      We built a life together and we love\n                      each other and if you destroy that, it\n                      may be irrep, irrep, irrep...\n\n<b>                                IFTY\n</b>                      Irreparable.\n\n            All eyes TURN to the back of the room.  Ifty is there trying\n            with all his might to help his friend.\n\n<b>                                IFTY (CONT'D)\n</b>                      Joanne, don't do that, please.  Don't do\n                      it twice, not to him.  Then Meryl Streep\n                      can't even look at Dustin Hoffman after\n                      that.\n\n<b>                                TURNER\n</b>                      Right, \"Kramer vs. Kramer.\"  Thank you\n                      for the commentary, Mr. Bhutto.  It's\n                      hard to find words isn't it, Mr. Dawson. \n                      It's confusing.  It's confusing to know\n                      what to say to Lucy half the time, isn't\n                      it?\n\n            Mortified, so uncomfortable in this strange world, so at a\n            loss how to swim through it, beginning to believe everything\n            Turner's saying, Sam looks out at the faces in the courtroom. \n            Rita, stunned and incredulous; Turner and his associate\n            smirking at him; Ifty, shaking his head; Robert, his face in\n            his hands; Miss Wright, Margaret Brown, the State's Expert,\n            almost willing him to fail.  Are they right?  Are they?\n\n<b>                                SAM\n</b>                      No, yes, no.\n\n<b>                                TURNER\n</b>                      No what?\n\n<b>                                SAM\n</b>                      Let me see let me see let me see.\n\n<b>                                TURNER\n</b>                      You don't know what?\n\n<b>                                SAM\n</b>                      Yes.\n\n<b>                                TURNER\n</b>                      Yes.  You're right, you don't know.  You\n                      don't know enough to really raise your\n                      daughter?\n\n<b>                                RITA\n</b>                      Objection.  These aren't questions,\n                      these are attacks.\n\n<b>                                SAM\n</b>                          (frantic)\n                      I am Lucy's father.\n\n<b>                                TURNER\n</b>                      Are you?  Are you really?  I'm not\n                      talking about the fact that you got some\n                      homeless woman pregnant.\n\n<b>                                RITA\n</b>                      Objection your Honor.  I motion a\n                      recess.\n\n<b>                                JUDGE MCNEILY\n</b>                      Denied.  Get to the question, Mr.\n                      Turner.\n\n<b>                                TURNER\n</b>                      The question is if you love your\n                      daughter as much as they say you do\n                      don't you think she deserves more?! \n                      Don't you?  In your heart of hearts,\n                      secretly question yourself every day? \n                      Don't you?!\n\n<b>                                SAM\n</b>                      Yes.\n\n<b>                                TURNER\n</b>                      Was that a \"yes?\"\n\n<b>                                RITA\n</b>                      Objection.\n\n<b>                                SAM\n</b>                      Yes.  She does.  She deserves\n                      everything.  In my heart of hearts.\n\n<b>                                TURNER\n</b>                      Yes she does.  And you agree with\n                      everyone, you can't give her that?\n\n<b>                                SAM\n</b>                          (in unbearable pain)\n                      Maybe.  Maybe everybody's right.\n\n<b>            ON TURNER\n</b>\n            There.  He got it.  \n\n<b>            ON RITA\n</b>\n            Anguished.  Watching Sam unravel as he stands up and starts\n            walking around in a circle in the witness box.\n\n<b>                                SAM (CONT'D)\n</b>                      No more no more!  Let it stop!  No more! \n                      No more!  No more!\n\n            The Judge watches Sam, sad and stunned.  The verdict is\n            obvious.  Sam has passed judgement on himself.\n\n<b>            EXT. CHILD AND FAMILY PROTECTIVE SERVICES - HALLWAY\n</b>\n            Sam, broken, walks down the long hallway with Rita toward\n            Margaret Brown's office.  Suddenly, Rita stops as she and Sam\n            both see -\n\n<b>            LUCY\n</b>\n            Sitting, hopeful on the bench.  She searches Sam's face for\n            the verdict.  The minute she sees sorrow in his eyes, she\n            knows.  She runs to him, gluing herself to his chest.\n\n<b>                                LUCY\n</b>                      No Daddy!  No Daddy!  No Daddy!\n\n            In a SERIES OF WORDLESS DISSOLVES, they hold each other in\n            the hallway through the entire forty five minute visit.  The\n            only thing moving is the hands of a large wall clock in the\n            background.  Pained, Margaret reaches for Lucy.\n\n<b>                                MARGARET BROWN\n</b>                      C'mon, Lucy.  It's time to say goodbye.\n\n<b>                                LUCY\n</b>                      NOOOO!  Don't let go don't let go don't\n                      let go -\n\n            Sam's tears mix with Lucy's as they sob, clinging to each\n            other.  With such fierce love; a parent and a child.\n\n<b>                                LUCY (CONT'D)\n</b>                      Don't let them Daddy don't let them! \n                      Don't ever let me go!\n\n            He can't let her go.  That he can't do.  Margaret, steel\n            herself, turns to Rita, no matter how many times she's done\n            this.\n\n<b>                                MARGARET BROWN\n</b>                      Please help me.\n\n            Rita, aching from a place she thought she buried long ago,\n            shakes her head, NO.  Now, Margaret literally has to wrench\n            Lucy away from her father's arms.  Lucy bellowing as she\n            pulls her down the hallway.  Sam is frozen in incalculable\n            pain.\n\n<b>            EXT. SAM'S APARTMENT HALLWAY - NIGHT\n</b>\n            We hear \"Fool on the Hill\".  We follow a trail of PINK LIQUID\n            melting down the hall and come to Annie's door where a pile\n            of grocery bags and newspapers sit in a PUDDLE OF STRAWBERRY\n            ICE CREAM.  Suddenly, the needle SCRAPES LOUDLY across the\n            record, followed by a mysterious POUNDING against the wall.\n\n<b>            INT. SAM'S APARTMENT - NIGHT\n</b>\n            The CAMERA MOVES to the WINDOW.  Inside, the lights are dim. \n            Lucy's HAMMOCK SWINGS EMPTY, ghostlike.  Sam, curled into a\n            ball in Lucy's bare corner, bangs his head over and over\n            again against the wall, overcome with grief.\n\n<b>            INT. DANNY'S ROOM - RITA'S HOUSE - NIGHT\n</b>\n            The POUNDING CONTINUES as we see Rita standing in the\n            doorway, watching her sleeping child.  This stranger that\n            she's raised.  She moves to cover him, this tough little boy,\n            when she sees POOH BEAR tucked under his arm.  She tucks them\n            both in, tenderly.\n\n<b>            EXT. CARPENTER HOUSE - DAY\n</b>\n            Saturday in idyllic suburbia.  Sam, directions and a map in\n            his hands, tentatively rounds the corner.  A small bouquet of\n            flowers in his hands when he stops - STARING AHEAD AT --\n\n<b>            REVERSE ANGLE\n</b>\n            Lucy looking absolutely radiant in a new spring dress.  She\n            stands on the front porch with RANDY, who wears a red smock\n            and is setting up TWO EASELS AND PAINTS.  There's a tiny\n            chair for Lucy and a tiny chair for her.\n\n<b>            CLOSE ON LUCY AND RANDY\n</b>\n            The tension in Lucy's face, Randy straining to connect with\n            her.\n\n<b>                                RANDY\n</b>                      Your teacher told me you were an artist.\n\n<b>                                LUCY\n</b>                      You wear too much perfume.  You're\n                      trying too hard.\n\n<b>                                RANDY\n</b>                      I am, aren't I.  Maybe you could teach\n                      me how to paint.\n\n<b>                                LUCY\n</b>                      My daddy's coming today.  We're going to\n                      open my birthday presents.  Why don't\n                      you just go do something.\n\n<b>            BACK TO SAM\n</b>\n            From where he stands, all he sees is Lucy getting everything\n            she deserves.  He looks down at the tiny bouquet in his hand -\n            feeling profoundly inadequate, he reaches for some flowers\n            from a garden he's passing.  Puts them in his bouquet.  Then\n            stops.  Feels guilty.  Tries to put the flowers BACK.  He\n            stares up at Lucy on the porch a few houses away.\n\n            Lucy sits on the steps.  Randy sits right next to her.\n\n<b>            BACK ON SAM\n</b>\n            Where he WAS standing, but is now GONE.  The flowers lay in\n            the dirt.  From the porch, Lucy looks out and waits.  And\n            waits.  And waits.\n\n<b>            INT. STARBUCKS - DAY\n</b>\n            It's Saturday.  The place is buzzing.  Sam listlessly cleans\n            the tables, without the usual energy and verve.  A TODDLER\n            marches around a table, playing under the adoring gaze of his\n            parents.\n\n<b>                                MAN\n</b>                      Excuse me, my kid knocked over a coffee,\n                      could you clean this up?\n\n            Sam sees a FAMILY at a table covered with spilled coffee.\n\n<b>                                MAN (CONT'D)\n</b>                      I said I need a refill and a towel over\n                      here.\n\n<b>                                SAM\n</b>                          (snapping)\n                      You need a towel?  A refill?  A glass of\n                      water?  You need more than you already\n                      have?  You have everything -\n                          (all his fury and frustration)\n                      Everything.  But it's not enough.  Take\n                      my daughter, too!\n\n            Sam's out of control, the whole shop stares at him as he\n            backs into a shelf of MUGS he so carefully arranged.  They\n            CRASH onto the floor.\n\n<b>                                                           SMASH CUT TO:\n</b>\n<b>            EXT. CARPENTER PORCH - DAY\n</b>\n            Paints and brushes go FLYING across the porch as Lucy KNOCKS\n            THEM OVER.  Totally out of control.\n\n<b>                                LUCY\n</b>                      You gave him the wrong address!  You're\n                      hiding me from him!\n\n            As Randy reaches for her, Lucy pours black paint on her.\n\n<b>            EXT. CARPENTER HOUSE - DUSK\n</b>\n            Lucy sits in a ball on the corner of the porch.  Her eyes\n            swollen from crying.  Finally, she gets up and moves to the\n            tiny chair that Randy put out for her.  Straightens the easel\n            and begins to paint.\n\n            The front door opens and Randy comes out having washed her\n            face and hair.  Without speaking, Randy straightens her easel\n            and sits down next to Lucy and begins to paint.  Randy and\n            Lucy paint in silence for a long time.  Then -\n\n<b>                                LUCY\n</b>                      You're going to send me away now, aren't\n                      you?\n\n<b>                                RANDY\n</b>                          (tenderly)\n                      No.\n\n            We hear what sounds like a child's hand playing the song\n            \"Here, There and Everywhere...\"\n\n<b>            INT. SAM'S APARTMENT - EVENING\n</b>\n            We see SAM sitting at Lucy's miniature toy piano as he plays\n            with one finger.  IN A SERIES OF DISSOLVES, as DAYS and WEEKS\n            PASS, we see SAM'S HANDS at the PIANO -\n<b>\t\t\t\n</b><b>                                                               INTERCUT:\n</b>\n<b>            EXT. CARPENTER HOUSE - DAY\n</b>\n            With Lucy and Randy's hands as they PAINT side by side to\n            Sam's sad melody.  Lucy's pictures start ANGRY, angular with\n            blacks and blues, then GRADUALLY soften and the dark figures\n            recede.  By the END, there is a BRUSHSTROKE of the red of\n            Randy's smock peeking into the corner of Lucy's picture.\n\n<b>            INT. SAM'S APARTMENT - DAY\n</b>\n            We come back to Sam, having withdrawn completely into himself\n            serenading no one.\n\n<b>            INT. LUCY'S BEDROOM - DAY\n</b>\n            We see Lucy and Randy sitting on her bed unwrapping the\n            birthday presents.  TIME HAS PASSED.  They look close, almost\n            like a mother and daughter.  Lucy finishes unwrapping Sam's\n            present and we see a stack of ONE HUNDRED DENNY'S NAPKINS.\n\n<b>                                RANDY\n</b>                      Oh, he must've forgotten to put the gift\n                      in.\n\n            Randy picks up one of Lucy's pictures and moves to the wall.\n\n<b>                                RANDY (CONT'D)\n</b>                      You know, this wall really needs\n                      something special on it.\n\n            Lucy half-smiles and unconsciously begins to fold one of the\n            Denny's napkins into an origami bird.  Then crushes it.  Then\n            cautiously:\n\n<b>                                LUCY\n</b>                      What's the longest any one of those kids\n                      stayed with you?\n\n<b>                                RANDY\n</b>                      Megan stayed a little over a year.\n\n<b>                                LUCY\n</b>                          (averting her eyes)\n                      Did you ever want any of them to stay\n                      longer?\n\n<b>            ON RANDY\n</b>\n            Moved herself.  Understanding how huge a question this is\n            coming from this bruised little heart.\n<b>\t\t\t\n</b><b>            INT. SAM'S APARTMENT - WEEKS LATER - DAY\n</b>\n            Sam sits in a dark corner; maniacally folding newspaper into\n            an odd origami pattern.  There's a knock at the door - Sam\n            doesn't move, he just continues folding his paper.\n\n<b>                                RITA (O.S.)\n</b>                      Sam it's me!  Open up!\n\n            He doesn't answer it, just methodically folds.\n\n<b>            EXT. SAM'S APARTMENT - CONTINUOUS\n</b>\n            Rita stands there impatiently.\n\n<b>                                RITA\n</b>                      I don't have time for this!  You were\n                      supposed to show up for your first\n                      evaluation.  And I leave work early to\n                      get there and where the hell are you?! \n                      Open the door!  Sam!  Open the goddamn\n                      door!\n                          (nothing)\n                      Alright.  If you don't care enough to\n                      open the goddamn door I'm outta here! \n                      I've ruined my practice, I've alienated\n                      my colleagues - I sent my kid off on a\n                      fishing trip with his father so I could\n                      work with you and you won't open your\n                      goddman door for me?!  Fine!  THAT'S IT! \n                      I've had enough!\n\n            She starts down the hall when suddenly she turns and - with\n            the mastery of a karate black belt - RUNS AND KICKS the door\n            down.\n\n<b>            INT. SAM'S APARTMENT - CONTINUOUS\n</b>\n            Rita bursts through the door and then stops.  Sam has created\n            an origami wall of newspapers, intricately woven together. \n            A fortress against the world.  He keeps folding - doesn't\n            even look at Rita.  He's more far gone than she could\n            imagine, she walks gingerly to the wall and knocks gently on\n            it.\n\n<b>                                RITA\n</b>                      Sam, it's Rita.  Can I come in?\n\n<b>                                SAM\n</b>                      No room.  No room.\n\n<b>                                RITA\n</b>                      Hey.  I lived in the East Village.  I\n                      don't need a lot of room.\n\n<b>                                SAM\n</b>                      Sam makes life too hard.  Sam makes life\n                      too hard on everyone.\n\n<b>                                RITA\n</b>                      Sam, I can go at least nine more rounds. \n                      But you gotta let me in.  Please Sam. \n                      Please.\n\n            He pulls out one small brick of origami, opening a window.\n\n<b>                                RITA (CONT'D)\n</b>                      Thank you.  Now I can see your kind\n                      eyes...George told me you needed a break\n                      from work.\n\n<b>                                SAM\n</b>                      I don't want to work there anymore.  Too\n                      many people.\n\n<b>                                RITA\n</b>                      Maybe we could find you a quieter job. \n                      Because remember one of the judges\n                      conditions is you have to earn more\n                      money; you've got to keep earning more\n                      money for when we get you Lucy back.\n\n<b>                                SAM\n</b>                      Lucy doesn't need me anymore.  She has a\n                      new family.  She doesn't need me\n                      anymore.\n\n<b>                                RITA\n</b>                      Is that what she said?\n\n<b>                                SAM\n</b>                      She didn't have to say it.  I may be\n                      stupid, but I know.  I know.\n\n<b>                                RITA\n</b>                      Well that's the first stupid thing I've\n                      ever heard you say.\n\n            Sam looks at her through the window.  A CHINK in the wall.\n\n<b>                                RITA (CONT'D)\n</b>                      Sam, Sam you can get her back.  The\n                      court favors reunification.  The only\n                      thing that can block you is if the\n                      foster family petitions to adopt.  And\n                      from what I've heard, Lucy's making\n                      their life miserable - that's our girl. \n                      Sam, fight for her.\n\n<b>                                SAM\n</b>                      I tried.  I tried.\n\n<b>                                RITA\n</b>                      Try harder.\n\n<b>                                SAM\n</b>                      You don't know.  You don't know.\n\n<b>                                RITA\n</b>                      I don't know?\n\n<b>                                SAM\n</b>                      You don't know what it is to try and try\n                      and never get there.  You were born\n                      perfect, perfect.\n\n<b>                                RITA\n</b>                      Is that right?  Everyone else is perfect\n                      but only Sam feels loss and pain?\n\n<b>                                SAM\n</b>                      That's right.  People like you don't\n                      know.\n\n<b>                                RITA\n</b>                      People like me?\n\n<b>                                SAM\n</b>                      People like you don't know, don't know\n                      what hurt feels like, people like you\n                      don't feel, don't feel anything.\n\n            She slaps him.  STUNNED, he slaps her back.  STUNNED, she\n            slaps him again.  HE SLAPS HER.  She rips the newspaper wall\n            down.\n\n<b>                                RITA\n</b>                      You think you got the market cornered on\n                      human suffering?  Well let me tell you\n                      something about \"People like me.\" \n                      People like me feel little and lost and\n                      ugly and dispensable.  People like me\n                      have perfect husbands screwing someone\n                      far more perfect than me and my son, my\n                      son hates me, I try too hard and I push\n                      and he knows it and I talk in that\n                      voice, that voice I promised I'd never\n                      use, and I've screamed, I've screamed\n                      horrible things to him, a five year-old\n                      because he doesn't want to get in the\n                      car at the end of a day and he stares at\n                      me with such anger and I hate him then. \n                      I know I'm failing you, I know I'm\n                      disappointing you, I know you deserve\n                      better but get in the fucking car!  It's\n                      like every morning I wake up and fail,\n                      and I look around and anybody, anybody\n                      can pull it off, but somehow I can't. \n                      And I know, I know I have everything,\n                      and I'm still miserable and it's\n                      pathetic.  I know it's pathetic.  No\n                      matter how hard I try, something about\n                      me will never be enough.\n\n            She's crying too hard to continue.  He pulls her to him. \n            Before she realizes what's happening, she's holding him\n            tightly.  He whispers in her ear.\n\n<b>                                SAM\n</b>                      You're enough.  You're so much more than\n                      enough.\n\n            He looks her straight in the eye - she's undone by the\n            intimacy of the moment, by the strength of his purity.  And\n            staring into his eyes, she begins to sob, walls crumbling. \n            He kisses her elbow, her shoulder, her forehead, her eyes,\n            her tears.  And something ignites between them - something\n            confused and scary and deep and filled with a passionate\n            ache.\n\n<b>                                SAM (CONT'D)\n</b>                      Lovely Rita...\n\n            On a bed of newspaper that was once a wall they come\n            together, whole again.\n\n<b>            EXT. RANDY'S NEIGHBORHOOD - DAY\n</b>\n            Sam rounds the corner walking - or rather being walked by SIX\n            DOGS, all shapes, all sizes.  He heads up the walkway to\n            Randy's house.  She comes out of the house and shuts the door\n            behind her, stopping him.\n\n<b>                                RANDY\n</b>                      You're early.\n\n<b>                                SAM\n</b>                      All the lights were green.\n\n<b>                                RANDY\n</b>                      There's a reason for the court schedule. \n                      You stopped showing up.  Lucy has had to\n                      rebuild her life.\n\n<b>                                SAM\n</b>                      I want her back.  I can do it.  I know I\n                      can.\n\n<b>                                RANDY\n</b>                      That's not up to me, but I'm telling\n                      you, I will do everything in my power to\n                      prevent Lucy from getting hurt again.\n\n            Sam hangs his head.  A dog barks at Randy.\n\n<b>                                RANDY (CONT'D)\n</b>                      Whose dogs are these?\n\n<b>                                SAM\n</b>                      Supplemental income supplemental income -\n                      bathe, walk and feed.  Sam Dawson meets\n                      your canine needs.\n                          (to dogs)\n                      Sit! Sit! Sit! Sit! Sit! Sit!\n<b>\t\t\t\t\t  \n</b>            All the dogs sit but a BIG BLACK LAB.  Randy heads into the\n            house.  The front door opens and Lucy comes out.  She runs\n            down the stares to Sam.  Thrilled, Sam opens his arms to her. \n            She leaps into them and begins slugging his chest with pent\n            up fury.\n\n<b>                                LUCY\n</b>                      You never came!  You never even called! \n                      You forgot about me!  How could you\n                      forget me!\n\n<b>                                SAM\n</b>                      I never forgot you.  I forgot me.\n\n<b>                                SAM (CONT'D)\n</b>                      I hate you I hate you I hate you!\n\n            Lucy pulls away.  A long charged silence.  Lucy refusing to\n            even look at her father.\n\n<b>                                SAM (CONT'D)\n</b>                      Lucy, I tried to write you a letter last\n                      night...\n\n<b>            A BASSET HOUND SNEEZES.\n</b>\n<b>                                SAM (CONT'D)\n</b>                      Gesundheit, Buster.  Buster has a cold. \n                      But the letter had too many big words. \n                      Pokey, sit.\n\n            The black lab has begun eating Randy's flowers.  Lucy stares\n            forward.  Sam speaks tentatively, carefully:\n\n<b>                                SAM (CONT'D)\n</b>                      Dear Lucy.  Pokey sit.  Dear Lucy, I'm\n                      sorry that I hurt you.  Every moment of\n                      the day I thought about you.  Lucy in\n                      the hammock, Lucy at school.  Lucy in\n                      the sky...XXOO.  Daddy.  P.S. I love\n                      you, recorded September 11th, the day\n                      you took your first step.\n\n            Lucy raises her head and looks at Sam for the first time.\n\n<b>            INT. DENNY'S - DAY\n</b>\n<b>            ON SALAD BAR\n</b>\n            Rows of carrots, tomatoes, cucumbers and - uh-oh, a tomato's\n            in the peas.  A hand comes into frame and carefully places\n            the tomato just so, in the tomato bin.  Now it moves to the\n            olives.  Shouldn't all the pimentos be facing up?\n\n<b>            PULL BACK\n</b>\n            To reveal Sam, in white apron and hat, deftly filling the\n            containers of the elaborate salad bar as people fill their\n            plates.\n\n<b>                                SAM\n</b>                      Napa cabbage, excellent choice.  Purple\n                      and green, purple and green.  Very rich\n                      in Vitamin C.  Good choice. Very good\n                      choice.\n\n<b>            INT. COURTHOUSE - HALLWAY - DAY\n</b>\n            Sam walks toward the courtroom when we see Rita approaching\n            from the other end of the hall.  They both slow down when\n            they see each other.  Rita unconsciously fixes her hair.  Sam\n            adjusts his tie.\n\n<b>                                RITA\n</b>                      Hello, Sam.  Mr. Dawson.  Sam.  Dawson.\n\n<b>                                SAM\n</b>                      Hello, lawyer.\n\n            They almost shake hands - realize that means touching each\n            other and don't.  Rita motions toward the door.\n\n<b>                                RITA\n</b>                      Shall we?\n\n<b>                                SAM\n</b>                      No.  We already did.  Don't tell\n                      anybody.\n\n            They nervously walk through the door, bumping into each\n            other.\n\n<b>            INT. SMALL COURT ROOM - LATER\n</b>\n            She's very aware of Sam.  He looks away, over compensating\n            obviously.  Throughout the scene, Rita's hair falls in her\n            eyes.  She attempts to put it in place.\n\n<b>                                RITA\n</b>                      Furthermore, my client has found a new\n                      job, and is making every effort to find\n                      a bigger apartment so that -\n\n            Rita's hair falls in her eyes again.  Sam stands up, pulls\n            HER BARRETTE from his pocket, the one she left at his house.\n\n<b>                                SAM\n</b>                      Here.\n\n            Rita stares at the barrette as if it were the murder weapon.\n\n<b>                                RITA\n</b>                      Oh, thank you.  What a...a lovely\n                      barrette, Mr. Dawson.  It will look\n                      great on Lucy.  Who I'm sure you bought\n                      it for.  Furthermore, so that...there\n                      will be more room for Lucy as she grows\n                      up.\n\n<b>                                MARGARET BROWN\n</b>                      All of that is well and good but the\n                      fact that Mr. Dawson quite his job,\n                      missed his hearing, and did not even\n                      show up for his visits with his\n                      daughter...\n\n<b>                                RITA\n</b>                      The fact that my client went through\n                      profound depression is the most natural\n                      reaction any parent could have.\n\n<b>                                MARGARET BROWN\n</b>                      But once again he had no idea how his\n                      behavior during that depression impacted\n                      on his daughter.\n\n<b>                                RITA\n</b>                      In these next months, Mr. Dawson will be\n                      expanding his support system to include\n                      Social Service programs, tutors --\n\n<b>                                MARGARET BROWN\n</b>                      It's too late!  The foster family is\n                      petitioning the court for sole custody\n                      of Lucy and I fully support their\n                      request.\n\n            Sam turns to Rita.  This can't be happening.\n\n<b>            INT. DENNY'S - NIGHT\n</b>\n            Sam, Rita, Ifty, Robert and Brad sit in a booth.  With one\n            extra person, it's a little tight.  Rita picks at her\n            Salisbury Steak special, trying to deal with the business at\n            hand.\n\n<b>                                IFTY\n</b>                      Isn't it illegal?  It's illegal to go\n                      through stop signs.  It's illegal to\n                      cross on the red.\n\n<b>                                RITA\n</b>                      It's not illegal.  It's very\n                      complicated.  When a strong foster\n                      parent lobbies for a child it changes\n                      the equation.\n\n<b>                                ROBERT\n</b>                      They're reaching right through Sam as if\n                      he doesn't exist.  As if he's a ghost.\n\n<b>                                RITA\n</b>                      There's one option we've never talked\n                      about, Sam. \n                          (very carefully)\n                      I know what you went through the last\n                      time you took the stand.  We could\n                      settle out of court, ask for the most\n                      incredible visitation rights - it would\n                      almost seem like joint custody.\n\n<b>                                SAM\n</b>                      You're saying I don't have a chance. \n                      That's what you're saying.\n\n<b>                                RITA\n</b>                      I'm not saying you don't have a chance.\n\n<b>                                ROBERT\n</b>                      That's what you said last time and look\n                      where he is now.\n\n<b>                                SAM\n</b>                      Stop.  Rita's not saying I don't have a\n                      chance.  Are you?  Tell me I have a\n                      chance.\n\n            Too long a pause.  Ifty looks at the clock.\n\n<b>                                IFTY\n</b>                      Oh my God!  6:35 is Video Night at my\n                      house and I'm not even there!\n\n<b>                                ROBERT\n</b>                      If we get there before you do we'll wait\n                      for you - check!\n\n<b>                                BRAD\n</b>                      Sam get your dessert to go.\n\n<b>                                SAM\n</b>                      This is very hard to say.  I'm having my\n                      dessert here.  With Rita.  I'm not\n                      coming to video night.\n\n            Devastated, Ifty, Robert and Brad solemnly gather their\n            things.\n\n<b>                                RITA\n</b>                      Sam - if you want to go...\n\n<b>                                SAM\n</b>                      I said no, Rita.\n\n<b>                                RITA\n</b>                      I know, but if you -\n\n<b>                                SAM\n</b>                      What?  Do you want me to go?\n\n<b>                                RITA\n</b>                      I didn't say that.  But do you want to\n                      go?\n\n<b>                                SAM\n</b>                      Where?\n\n<b>                                RITA\n</b>                      Nevermind.\n\n<b>                                SAM\n</b>                      Fine.\n\n<b>                                RITA\n</b>                      Fine.\n\n<b>                                IFTY, ROBERT &amp; BRAD\n</b>                      Fine.\n\n            They leave in a huff.  The WAITRESS delivers the check with\n            dessert and coffee.\n\n<b>                                RITA\n</b>                      I've got it.\n\n<b>                                SAM\n</b>                      I've got it.\n\n            Long pause.  Rita slowly eats her pie.\n\n<b>                                SAM (CONT'D)\n</b>                      It's good to chew.  You're eating more\n                      slowly.\n\n            Rita laughs and nods.\n\n<b>                                SAM (CONT'D)\n</b>                      Coconut Rhubarb.  Sidebar, we need to\n                      talk.  Sidebar.\n\n<b>                                RITA\n</b>                          (carefully)\n                      Yes we do.\n\n<b>                                SAM\n</b>                      I need to get Lucy back.  We need, we\n                      need - to be professional.\n\n<b>                                RITA\n</b>                      Do you know what that means?\n\n<b>                                SAM\n</b>                      When dealing with Starbucks' customers,\n                      be friendly but not familiar.  I can be\n                      your friend.\n\n<b>                                RITA\n</b>                          (oddly touched)\n                      Thank you, Sam.\n\n<b>                                SAM\n</b>                      You need to leave your husband.\n\n<b>                                RITA\n</b>                          (her armor up again)\n                      Oh, my marriage isn't so bad.\n\n<b>                                SAM\n</b>                      'Life is very short and there's no time\n                      for fussing and fighting, my friend.'\n\n<b>                                RITA\n</b>                          (undone)\n                      It's just...it's just that...I've never\n                      lost anything.\n\n<b>            EXT. SCHOOL - DAY\n</b>\n            Randy kisses Lucy goodbye as she heads toward school.  We\n            follow Lucy - suddenly a BIRD SAILS THROUGH THE SKY and LANDS\n            IN FRONT OF LUCY.  It's an ORIGAMI BIRD.  She looks around -\n            but doesn't see Sam anywhere.  But she feels him.  She walks\n            toward school, clutching the bird, past a tree and we move up\n            that tree and see Sam nestled in the branches.  There.  They\n            made contact.\n\n<b>            EXT. RANDY'S NEIGHBORHOOD - DAY\n</b>\n            It's later that week.  Lucy walks proudly down the street in\n            a GIRL SCOUT UNIFORM, selling cookies.  Randy is by her side,\n            beaming.\n\n<b>                                LUCY\n</b>                      We've made $22.36.  That's seven\n                      dollars, 64 cents less than thirty.\n\n<b>                                RANDY\n</b>                      Well that's one way of looking at it.\n\n<b>            EXT. RANDY'S NEIGHBORHOOD - LATER\n</b>\n            DISSOLVE as they move through the neighborhood.  Finally we\n            see her bound up the steps to an apartment building.  She\n            knocks on the door.  It opens - and Lucy and Randy's JAW\n<b>            DROPS. \n</b>\n<b>            REVERSE ANGLE\n</b>\n            Sam stands there.  Holding three kittens.  WE see various\n            dogs in arm chairs, the couch...\n\n<b>                                LUCY\n</b>                      Daddy?!\n\n<b>                                RANDY\n</b>                      What are you doing here?\n\n<b>                                SAM\n</b>                      I live here.  This is where I live.\n\n<b>                                LUCY\n</b>                      This is where you live?  So close to me?\n\n<b>                                SAM\n</b>                      I wanted to be close to you.  I wanted\n                      to be closer.  Look at my apartment\n                      number.\n                          (it's number 9)\n                      John was born on October 9th.  His son\n                      was born on October 9th.\n\n<b>                                LUCY\n</b>                      John met Yoko on November 9th.\n\n<b>                                SAM\n</b>                      His mother lived at 9 Newcastle,\n                      Liverpool.\n\n<b>                                LUCY\n</b>                      Newcastle.  9 letters.  Liverpool - 9\n                      letters...\n\n<b>                                RANDY\n</b>                      Lucy, give me one minute with your\n                      father.  Sam, I consider myself an\n                      understanding person but I don't\n                      understand this.  You can't close the\n                      distance between you and Lucy with a new\n                      address.  We go to court in a week -\n\n<b>                                SAM\n</b>                      I don't want to spend half my visit with\n                      Lucy on the bus getting to Lucy.  I\n                      don't want to waste one more minute.\n\n            Buster sneezes.\n\n<b>                                LUCY\n</b>                          (from the doorway)\n                      Does Buster still have his cold?\n\n<b>                                SAM\n</b>                      He's better, much better.  Now I'll have\n                      one box of mint chocolate cookies.\n\n<b>                                LUCY\n</b>                      That'll be three-eighty six.\n\n<b>                                LUCY &amp; SAM\n</b>                          (in unison)\n                      Let me see let me see let me see...\n                      That's one dollar and 14 cents less than\n                      five.\n\n            Randy watches with a mixture of jealousy and fear as Lucy\n            effortlessly enters her and Sam's universe.\n<b>\t\t\t\n</b><b>            EXT. CARPENTER HOUSE - DAY\n</b>\n            From the window, Randy watches as Sam hands Lucy four leashes\n            and the two of them get pulled down the street by the dogs.\n\n<b>            INT. LUCY'S BEDROOM - 2 A.M.\n</b>\n            Lucy lies in her hammock, unable to sleep.  Staring at the\n            little origami bird on her window sill.  She moves it, opens\n            the window wide, quickly takes Mr. Jeeters - and within a\n            moment she's out the window and onto the limb of the tree.\n\n<b>            EXT. MAIN THOROUGHFARE - NIGHT\n</b>\n            \"The night grows teeth...\" stray dogs fight over garbage - a\n            wino talks to himself and in the midst of it all walks Lucy\n            in her pj's.  Mr. Jeeters tucked under her arm.  Lucy crosses\n            the street.  HONK!  the screeching of tires...\n\n<b>            EXT. APARTMENT BUILDING - MOMENTS LATER\n</b>\n            We're looking at an old fashioned fire escape when suddenly\n            we make out a figure climbing higher and higher.  It's Lucy. \n            We catch glimpses of her and then lose her as the neon sign\n            across the street blinks on and off.\n\n<b>            INT. SAM'S BEDROOM - CONTINUOUS\n</b>\n            Sam's asleep.  Suddenly his eyes open wide.  And like an\n            animal sensing danger, he gets up.  We HEAR THE SOUND of\n            something THUMPING AGAINST RUNG AFTER RUNG OF THE FIRE\n            ESCAPE.  He rushes to his window and looks to see --\n\n<b>            EXT. SAM'S APARTMENT\n</b>\n            Lucy climbing the fire escape!  Sam opens the window and\n            reaches for her.\n\n<b>                                SAM\n</b>                      Lucy Lucy.  What are you doing?!  You\n                      could have really hurt yourself.  What\n                      are you doing?\n\n<b>                                LUCY\n</b>                      I couldn't sleep.  Daddy, did you know\n                      that Warren G. Harding was the twenty\n                      ninth President of the United States?\n\n<b>                                SAM\n</b>                      No.\n\n<b>                                LUCY\n</b>                      Remember - the twenty-ninth President. \n                      In case the Judge asks.\n\n<b>            EXT. RANDY'S STREET - NIGHT\n</b>\n            Sam, in his pajamas, holds a sleeping Lucy in his arms.  He\n            turns a corner and heads up the walkway to Randy's house.  He\n            knocks on the door.  Finally the door opens and we see Randy\n            and Bill in their pajamas SHOCKED at seeing Sam and Lucy.\n\n<b>                                SAM\n</b>                      She couldn't sleep.\n\n<b>                                RANDY\n</b>                      Give me my daugh -\n                          (she stops herself)\n                      Give me - I'll take Lucy.\n\n<b>                                SAM\n</b>                      Maybe if you rub her tummy twenty-three\n                      times, tell her two stories and give her\n                      half a Denny's blueberry muffin and a\n                      third of a glass of milk she'll sleep. \n                      Good night.\n\n            Randy and BILL, her husband, watch as Sam turns and walks\n            purposely down the walkway - his houseslippers scuffling on\n            the quiet street.\n\n<b>            SERIES OF SHOTS AT 3:00 A.M. --\n</b>\n<b>            EXT. STREET - NIGHT\n</b>\n            Lucy in her pj's walks down the middle of the street.\n\n<b>            EXT. SAM'S WINDOW - NIGHT\n</b>\n            Lucy knocks on Sam's window.\n\n<b>            EXT. STREET - NIGHT\n</b>\n            Lucy and Sam walk back down the street to Randy's house.\n\n<b>            EXT. SAM'S WINDOW - NIGHT\n</b>\n            Lucy lugs encyclopedias to Sam's windowsill.\n\n<b>            EXT. STREET - NIGHT\n</b>\n            Lucy in a blanket being carried by Sam toward Randy's house.\n\n<b>            INT. LUCY'S ROOM - NIGHT\n</b>\n            Until FINALLY, we see Lucy in her hammock at Randy's house\n            looking out the windows, which have now been completely\n            covered with BARS.  Her room is filled with origami birds\n            from the 100 Denny's napkins, her birthday gift.  Lucy gets\n            out of her hammock and tiptoes across her room - quietly\n            opening the door.\n\n<b>            INT. CARPENTER HOUSE - STAIRS TO LIVING ROOM - NIGHT\n</b>\n            We follow her through the dark house as she creeps down the\n            stairs.  She gets to the front door.  It's been DEAD BOLTED\n            where she cannot reach it.  From the darkness we hear --\n\n<b>                                RANDY\n</b>                          (tenderly)\n                      Lucy.  Come here.\n\n            Randy sits in the darkness, next to a THIRD OF A GLASS OF\n            MILK and a HALF A DENNY'S BLUEBERRY MUFFIN.\n\n<b>                                RANDY (CONT'D)\n</b>                      I made us a midnight snack.\n\n            Lucy stares at the muffin and milk.  Torn.\n\n<b>                                RANDY (CONT'D)\n</b>                      I understand that you want to see your\n                      daddy.  And I don't want to keep you\n                      from him.  I honestly don't.  So you\n                      tell me when you want to see him.  You\n                      can see him anytime you want.  But we\n                      have to arrange it first.  Do you\n                      understand?\n                          (Lucy nods)\n                      Now would you like a snack?\n\n            Lucy nods.  Elated, Randy makes room for her on the couch. \n            But Lucy just reaches for the milk and muffin and heads up\n            the stairs then turns back and speaks gently to Randy.\n\n<b>                                LUCY\n</b>                      Thank you.  Goodnight.\n\n<b>                                RANDY\n</b>                          (words caught in her throat)\n                      Goodnight, Lucy.\n\n<b>            INT. SAM'S BEDROOM - DAY\n</b>\n            We PAN ACROSS THE ROOM and see Sam's shoes, his tie, and a\n<b>            YELLOW PAD WITH ALL THE PRESIDENTS LISTED IN ORDER.  A KNOCK\n</b>            at the door - Sam opens it to see Rita standing there,\n            looking intensely vulnerable, holding her husband's suit.\n\n<b>                                RITA\n</b>                      My husband left this when he moved out.\n\n<b>                                SAM\n</b>                      Oh, lovely Rita, meter maid.\n\n<b>                                RITA\n</b>                          (entering)\n                      Nice place.  I worry.  I worry\n                      sometimes...\n\n<b>                                SAM\n</b>                      You worry you did the wrong thing?\n\n<b>                                RITA\n</b>                      I worry that I've gotten more out of\n                      this relationship than you.\n\n<b>                                SAM\n</b>                      No no no.  I'm the lucky one.  I have\n                      the lawyer that never loses.\n\n<b>                                RITA\n</b>                          (covering)\n                      That's me...okay, let me see, let me\n                      see, let me see.\n                          (pulls out notes)\n                      They're going to put Bill and Randy on\n                      the stand first and then you.\n\n<b>                                SAM\n</b>                      Them first, then me.  They're a nice\n                      couple.  They have a nice house.  She's\n                      pretty.  She's smart, too.  I can tell. \n                      The manager of the salad bar is gonna\n                      testify, isn't he?  That will help us.\n\n            For a moment, Rita's mask drops and her fear for Sam\n            overwhelms her.\n\n<b>                                RITA\n</b>                      Absolutely.\n\n<b>                                SAM\n</b>                      Nobody believed that George Harrison\n                      could really be a song writer.  But he\n                      wrote \"Here Comes the Sun\".  John and\n                      Paul said it was one of the best songs\n                      on ABBEY ROAD.\n\n<b>                                RITA\n</b>                          (tenderly)\n                      George was always my favorite Beatle.\n\n<b>                                SAM\n</b>                      Lucy's was Paul.\n<b>\t\t\t\t\t  \n</b><b>            INT. RANDY AND BILL'S BEDROOM - 2 A.M.\n</b>\n            Randy and Bill are asleep when Randy senses something.  She\n            opens her eyes and sees Lucy staring at her.\n\n<b>                                LUCY\n</b>                      Now.\n\n<b>                                RANDY\n</b>                      What honey?\n\n<b>                                LUCY\n</b>                      Now.  I want to see him now.\n\n<b>            INT. SAM'S BEDROOM - 3:30 A.M.\n</b>\n            We see Sam sleeping in bed.  There's a KNOCK at the door. \n            Sam wakes with a start, throws down the covers. \n            We see that he's wearing the Armani suit.  Sam opens the door\n            to see Randy standing there, holding a sleeping Lucy in her\n            arms.\n\n<b>                                RANDY\n</b>                      She fell asleep on the car ride over.  I\n                      was gonna turn back and tuck her in to\n                      her bed...with the pink canopy...and the\n                      quilt I made...But I was afraid she'd\n                      wake up at our house...\n                          (fighting the ache in her soul)\n                      ...and want to come home.\n\n            Sam looks at Randy with profound compassion.\n\n<b>                                RANDY (CONT'D)\n</b>                      I was gonna tell the judge that I could\n                      give Lucy the kind of love she never\n                      had.  But I would be lying.\n\n<b>                                SAM\n</b>                      I hope I hope I hope that you're saying\n                      what I think you're saying even though\n                      you're not saying it.\n\n            Randy nods and hands the sleeping Lucy into Sam's strong\n            arms.  For a moment they BOTH HOLD LUCY between them in the\n            most unique embrace.  Randy finally lets go and struggles to\n            say goodbye.\n\n<b>                                RANDY\n</b>                      Goodnight.  I'll see you in court.  Save\n                      me a seat...on your side.\n\n            Randy walks away.  Stunned, Sam watches her, holding Lucy in\n            his arms.  Then, from a very brave place:\n\n<b>                                SAM\n</b>                      Randy!  If I tell you I can't do it\n                      alone, will you tell the judge?\n\n<b>                                RANDY\n</b>                          (turns gently)\n                      No.\n\n<b>                                SAM\n</b>                      Promise?\n\n<b>                                RANDY\n</b>                      Promise...\n\n<b>                                SAM\n</b>                      I've looked and looked for a mother for\n                      Lucy. \n                      Help, I need someone, help, not just\n                      anyone.  You're the red in Lucy's\n                      painting.\n\n<b>            ON RANDY\n</b>\n            So unexpectedly bonded to them both.\n<b>\t\t\t\n</b><b>            EXT. SOCCER FIELD - DAY\n</b>\n            A glorious sunny day.  Lucy and her team are in the middle of\n            a fierce game.  A foul is called when we hear -\n\n<b>                                SAM\n</b>                      Penalty!  Rules broken.  Penalty,\n                      please!\n\n            Sam, wearing a UNIFORM and whistle around his neck, walking\n            his inimitable walk, races up the field, COACHING THE TEAM.\n\n            Ifty, Robert and Brad sit in the bleachers.  Robert, in\n            sunglasses, paranoid, looking behind him.  Brad follows\n            around an attractive YOUNG WOMAN as close as he can get to\n            her.  Sam runs by the water stand, manned by Randy and Bill.  \n\n            They share a look - a moment of intense parental pride.  Lucy\n            and a kid named PHILLIP go after the ball.\n\n<b>                                OBNOXIOUS MOM\n</b>                      Get her!  Phillip, you get her!\n\n<b>                                ROBERT\n</b>                      I saw that!  You gave him a secret\n                      signal!  Didn't you?\n\n<b>                                IFTY\n</b>                      Keep both eyes on the ball, Lucy - balls\n                      are round - on sale at Kmart.  The earth\n                      is a ball, too...\n\n            Phillip steps in front of Lucy and shoves her as hard as he\n            can.  Sam blows his whistle repeatedly and races over.\n\n<b>                                SAM\n</b>                      Penalty!  Repeat!  Rules broken! \n                      Penalty!\n\n<b>                                RITA (O.S.)\n</b>                      Penalty?!  Sue him!  Kick his ass outta\n                      the game!\n\n            It's RITA!  With Danny - hollering from the stands.\n\n<b>            ON LUCY\n</b>\n            Looks over at her father.  Sam does every coaching gesture,\n            and referee hand signal from every sport known to man.  It\n            looks like a bizarre TWYLA THARP DANCE.\n\n<b>            ON LUCY\n</b>\n            She does it right back at him.  Their secret code.  The code\n            that will bind them for the rest of their lives.\n\n<b>            ON THE CROWD AND PLAYERS\n</b>\n            All watching.  What the hell was that?  Sam blows his\n            whistle.\n\n<b>                                SAM\n</b>                      Play ball!  Play ball!\n\n            The game heats up.  Lucy's team gets the ball and is headed\n            toward the goal.  Sam is running right alongside them, so\n            excited, until he can't hold himself back anymore and\n            intercepts the ball!  Sam runs valiantly down the field with\n            it!  We hear \"Here Comes the Sun\"...\n\n            Little darlin', it's been a long, cold lonely winter.  Little\n            darlin', it feels like years since you've been here.  Here\n            comes the Sun...Here comes the sun...And I say, \"It's\n            alright...\"\n\n            And the CREDITS ROLL.\n\n                                                          FADE TO BLACK.\t\t\t\t  \t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t\t  \t\t\t\t\t  \t\t\t\t\t  \t\t\t\t\t  \t\t\t\t\t  \t\t\t\t\t  \t\t\t\t\t  \t\t\t\t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t\t  \t\t</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/I-am-Sam.jpg\"/>\n</td><td><h1>I am Sam</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Kristine Johnson\" title=\"Scripts by Kristine Johnson\">Kristine Johnson</a>  <a href=\"/writer.php?w=Jessie Nelson\" title=\"Scripts by Jessie Nelson\">Jessie Nelson</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/I am Sam Script.html#comments\" title=\"I am Sam comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:07:46.591168"}