{"title": "Indiana Jones and the Last Crusade", "film_link": "/Movie Scripts/Indiana Jones and the Last Crusade Script.html", "script_link": "/scripts/Indiana-Jones-and-the-Last-Crusade.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Indiana Jones and the Last Crusade Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Indiana Jones and the Last Crusade Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.17 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=George Lucas\" title=\"Scripts by George Lucas\">George Lucas</a><br/>  <a href=\"/writer.php?w=Philip Kaufman\" title=\"Scripts by Philip Kaufman\">Philip Kaufman</a><br/>  <a href=\"/writer.php?w=Menno Meyjes\" title=\"Scripts by Menno Meyjes\">Menno Meyjes</a><br/>  <a href=\"/writer.php?w=Jeffrey Boam\" title=\"Scripts by Jeffrey Boam\">Jeffrey Boam</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/><br/>\n<b>Script Date</b> :  1989<br/>\n<br/>\n<a href=\"/scripts/Indiana-Jones-and-the-Last-Crusade.html\">Read \"Indiana Jones and the Last Crusade\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<b>                INDIANA JONES AND THE LAST CRUSADE\n</b>\n                           Screenplay\n\t\t\t       by\n\n\n<b>                            JEFF BOAM\n</b>\n                               Story\n                                 by\n\n<b>                           GEORGE LUCAS\n</b>                                 and\n<b>                           MENNO MEYJES\n</b>\n\n\n\n\n\n<b>\tFADE IN:\n</b>\n<b>\tEXT. DESERT OF THE AMERICAN SOUTHWEST - DAY\n</b>\n\tA mountain peak dominates the landscape.\n\n\n<b>\tTITLES BEGIN.\n</b>\n\tRiders on horseback cross the desert. From this distance they appear to be a\n\tcompany of Army Cavalry Soldiers.\n\n<b>\tCLOSER ANGLES ON THE RIDERS\n</b>\n\treveal only details of saddles, hooves and uniforms. The riders are silhouetted\n\tagainst the rising sun as they ride into an ancient CLIFF PUEBLO.\n\n\tThe OFFICER IN COMMAND raises his hand halting his troops.\n\n<b>\t\t\tOFFICER\n</b>\t\tDis-mount!\n\n\tRIDERS climb down from their mounts... and only now do we realize that\n\tthis is a TROOP OF BOY SCOUTS, all of them about thirteen years of age. The\n\t\"Commanding Officer\" is only their SCOUTMASTER, Mr. Havelock.\n\n\tOne of the Scouts, a pudgy kid named HERMAN, steps away from his horse,\n\tbends over and pukes. The other Scouts rag on him.\n\n<b>               \t\t\tFIRST SCOUT\n</b>\t\tHerman's horsesick!\n\n\tA BLOND SCOUT, however, befriends Herman. He has a thatch of straw-colored\n\thair and the no-nonsense expression common to kids whose curiosity and appetite\n\tfor knowledge exceed what they teach in school. Additionally, he has adorned his\n\tuniform with an authentic HOPI INDIAN WOVEN BELT.\n\n<b>               \t\t\tSCOUTMASTER\n</b>\t\tChaps, don't anybody wander off.\n\t\tSome of the passageways in here\n\t\tcan run for miles.\n\n\tTwo Boy Scouts climb up the rocky base of the cliff.\n\n\n<b>\tINT. THE PASSAGEWAY - DAY\n</b>\n\tThe two boys head down the passageway. It's dark, and the temperature drops\n\tseveral degrees. Spiders have built huge webs that get caught in the boys' hair.\n\n\tHERMAN appears very uncertain as to the wisdom of this enterprise, but he's\n\tdrawn on by his companion's adventurous curiosity.\n\n\n<b>CONTINUED:\n</b>\n<b>               \t\t\tHERMAN\n</b>\t\tI don't think this is such a good\n\t\tidea.\n\n\tLAUGHTER is HEARD; the Blond Scout pulls Herman forward toward its source.\n\n\tThe VOICES GROW LOUDER now as the boys get closer to their source. The light\n\tof kerosene lanterns dances on the tunnel walls ahead. The boys approach\n\tcautiously, careful to stay hidden.\n\n<b>\t\t\tHERMAN\n</b>\t\tWhat is it?\n\n\tThis is what they see:\n\n\n\tFOUR MEN digging with shovels and pick-axes. They have broken into one of the\n\tpueblo's SECRET CHAMBERS... called \"Kivas.\"\n\n\tThe men are ROUGH RIDER (his name describes his dress), ROSCOE (a Bowery\n\tBoy bully of 14) and HALFBREED (with straight black hair that cascades over his\n\tshoulders).\n\n\tAnd the fourth man wears a LEATHER WAIST JACKET and BROWN FELT\n\tFEDORA HAT. He has his back turned to us, but we would be willing to bet\n\tanything that this is INDLANA JONES.\n\n\tHowever, when the man turns, and his face is illuminated by the lantern's glow,\n\twe are shocked to discover that it is someone else.\n\n\tWe'll call him FEDORA.\n\n<b>TITLES END.\n</b>\n\tThe TWO BOYS are mesmerized by what they see.\n\n\tNow we realize that the Blond Scout is actually young INDIANA JONES.\n\n<b>                  \t\t               FEDORA\n</b>\t                 \tAlfred, did you get anything yet?\n<b>\t\t\t\n</b><b>\t\t\tMAN\n</b>           \t     \tNothing. Dig in.\n\n\tTwo of the men stand and look at ROSCOE who steps forward holding a box in his\n\thands.\n\n<b>                  \t\t\tROSCOE\n</b>\t\tHey, I've got something!\n\n\tWhoops from the other men.\n\n<b>\t\t                ROSCOE\n</b>\t\tI got something, Garth!\n\n<b>CONTINUED: (2)\n</b>\n\tROSCOE rushes forward and gives FEDORA the box. Fedora steps toward a\n\tlantern resting on a rock.\n\n<b>               \t\t\tROSCOE\n</b>\t\tI got something... I got something\n\t\tright here.\n\n\tMore whoops from the other men.\n\n\tFEDORA puts the box on the rock next to the lantern. HALFBREED pushes\n\tROSCOE as he jumps with excitement. ROUGH RIDER steps forward to look at the\n\tbox as Fedora opens it.\n\n<b>\t\t\tROSCOE\n</b>        \t\t      (more whoops; then)\n\t\tOh, look at thatl\n        \t\t      (more whoops)\n\t\tWe're richl We're rich!\n\n<b>               \t\t\tHALFBREED\n</b>\t\tShut up. Shut up.\n\n\tFEDORA takes a BEJEWELED CROSS from the box and holds it aloft. Fedora's\n\tcomrades practically salivate at the sight of it.\n\n<b>               \t\t\tROSCOE (O.S.)\n</b>\t\tWell, we're rich, ain't we?l\n\n\tINDY takes off his hat and looks down at the o.s. action.\n\n<b>               \t\t\tHERMAN\n</b>\t\tIndy? Indy? What are they doing?\n\t\tIndiana? Indiana?\n\n<b>               \t\t\tINDY\n</b>\t\tShhhl\n\n\tFEDORA blows dust from the Cross, turning it in his hand, silently appraising its\n\tbeauty... and its value. He seems aloof from the others; somehow superior to\n\tthem.\n\n<b>               \t\t\tHALFBREED\n</b>\t\tHey, we got to find more stuff\n\t\tto bring back.\n\n\tINDY stays hidden, but is astounded by what he sees.\n\n<b>\t\t\tINDY\n</b>        \t\t      (hushed; urgent)\n\t\tIt's the Cross of Coronadol\n\t\tCortes gave it to him in 15201\n\n\n<b>CONTINUED: (3)\n</b>\n\tFEDORA continues to admire the Cross, then places it on the rock next to its box\n\tand the lantern.\n\n\tINDY turns back to observe the men.\n\n<b>               \t\t\tINDY\n</b>\t\tThat Cross is an important artifact.\n\t\tIt belongs in a museum.\n\n\tA look of resolve comes into INDY's expression, and he turns back toward\n<b>\tHERMAN.\n</b>\n<b>               \t\t\tINDY\n</b>\t\tRun back and find the others.\n\t\tTell Mister Havelock that there\n\t\tare men looting in the caves.\n\n\tHERMAN doesn't seem to be listening. Instead, he watches in wide-eyed horror\n\tas a SNAKE SLITHERS ACROSS HIS LAP.\n\n<b>               \t\t\tINDY\n</b>\t\tHave him bring the sheriff.\n\n\tINDY matter-of-factly picks up the snake and tosses it aside. HERMAN gasps.\n\n<b>               \t\t\tINDY\n</b>\t\tIt's only a snake.\n\n\tINDY grabs HERMAN's scout scarf and pulls him closer.\n\n<b>               \t\t\tINDY\n</b>\t\tDid you hear what I said?\n\n<b>               \t\t\tHERMAN\n</b>\t\tRight. Run back. Mister Havelock.\n\t\tThe Sheriff. What, what are you\n\t\tgonna do?\n\n<b>               \t\t\tINDY\n</b>\t\tI don't know... I'll think of\n\t\tsomething.\n\n\tINDY releases the scarf, gives HERMAN a pat and Herman dashes off. Indy sees\n\tthe Cross on the rock next to the lantern. As the Robbers continue to search for\n\tadditional valuables, Indy is able to work his way unseen to within arm's reach of\n\tthe Cross...\n\n\tFEDORA looks over at the men digging in a hole b.g.\n\n<b>               \t\t\tFEDORA\n</b>\t\tDig with your hands.\n\n\tINDY picks up the Cross.\n\n\n<b>CONTINUED: (4)\n</b>\n<b>               \t\t\tFEDORA (O . S . )\n</b>\t\tNot with your mouth.\n\n\tAs FEDORA stands watching the other men digging, INDY puts the Cross in his\n\tpants and begins to pull himself up a rope hanging nearby. As he climbs, Indy's\n\tfeet break a wooden beam, attracting the men's attention.\n\n<b>               \t\t\tROSCOE\n</b>\t\tHe's got our thing!\n\n<b>\t\t\t HALFBREED\n</b>\t\tGet 'im!\n\n<b>                                  \n</b>\n\tThe three Robbers are so eager to get their hands on INDY, they almost knock\n\teach other over in the attempt.\n\n\tOnly FEDORA is unperturbed. He casts a disgusted glance in\n\tthe direction of his fleeing companions\u0097then sets off\n\tafter INDY.\n\n\n<b>         \n</b><b>\tEXT. THE  CLIFFS - DAY\n</b>\n\tINDY EMERGES from the darkness of the Pueblo into the brightness of day.\n\n\tHe pauses\u0097squints\u0097shields his eyes\u0097looks in all directions.\n\n<b>               \t\t\tINDY\n</b>\t\tMister Havelock! Anybody\n\t\tEverybody's lost but me!\n\n\tHe hears RUNNING FOOTSTEPS BEHIND HIM and dashes off. ROUGH RIDER,\n\tHALFBREED, and ROSCOE are quick to appear and run after him.\n\n<b>\t\t\tFEDORA\n</b>\t\t  There he isl                   \n\n<b>       \t\t\tMEN\n</b><b>\t\t      (AD-LIBS)\n</b>\t\tLet's go! Let's get him! Let's\n\t\tgo!\n\n\tIndy jumps from one rock to another; the SCOUT TROOP HORSES are below. Indy\n\tputs two fingers in his mouth and WHISTLES for his horse, who trots over. Indy\n\tputs the Cross in his belt.\n\n\tINDY PREPARES TO JUMP into the saddle. Hesitates. Then... he JUMPS. But\n\tthe horse moves exactly at the wrong moment and Indy lands flat on his feet in a\n\tstanding position. The impact sends a shock wave up his body that rattles his\n\tback teeth. Indy stands up and successfully mounts his horse.\n\n\tFEDORA AND HIS MEN ARRIVE at the roof's edge in time to see INDY climb into\n\tthe saddle and gallop off.\n\n\n<b>CONTINUED:\n</b>\n<b> \t\t\tINDY\n</b>\t\tHyahl Hyah!\n\n<b>                     \n</b>\n<b>                                    \t\tROSCOE\n</b>\t\tHey! Come back here!\n\n\tFEDORA puts two fingers in his mouth and WHISTLES... and A VINTAGE TRUCK\n\tAND AUTOMOBILE come ROARING OUT from behind the Pueblo (Driven by two\n\tmore gang members). Now we glimpse...\n\n\n<b>\tTHE MAN IN THE PANAMA HAT\n</b>\n\tThe passenger in the car. His face is concealed by the hat's wide brim. His arm\n\tis out the window, however, and we see an olive-colored hand protruding from\n\tthe sleeve of an expensive white linen suit. He gestures to the Robbers, now in\n\tthe truck.\n\n<b>                                  \t\tPANAMA HAT\n</b>\t\tCome on. Get him!\n\n\tINDY SPURS his mount on to greater speeds but the autos not only keep pace\n\twith his horse... they begin to squeeze in on it.\n\n\tSpeeding Autos. Thundering hooves. Rushing wind. Flying dust. INDY crouched\n\tlow and leaning forward in the saddle, his heart pounding, his adrenalin\n\tpumping.\n\n\tINDY VEERS OFF in a new direction\u0097toward a RAILROAD TRACK.\n\n\n<b>\tEXT. A CIRCUS TRAIN - DAY\n</b>\n\tThe train is barreling down the track. INDY rides up beside it. He glances over\n\this shoulder and sees the car and truck gaining on him. No other choice... he\n<b>\tLEAPS FROM HORSE TO TRAIN.\n</b>\n\tHe clings to the side of a BOXCAR, as HALFBREED and ROUGH RIDER leap from\n\tthe truck onto the train.\n\n\tHALFBREED tries to grab INDY, but Indy leaps onto another boxcar. Halfbreed\n\truns after him but Indy leaps from the boxcar onto some covered boxes stacked\n\ton a flatcar.\n\n\tINDY loses his balance but regains it. With HALFBREED and ROUGH RIDER still\n\trunning after him, Indy enters the trap door of...\n\n\n<b>\tINT. THE REPTILE CAR - DAY\n</b>\n\tand finds himself CRAWLING on a CATWALK suspended from the car's ceiling.\n\tSeveral feet below are NUMEROUS VATS containing all manner of reptiles:\n\tAlligators, crocodiles, giant lizards, etc.\n\n\n<b>CONTINUED:\n</b>\n\tThen, HALFBREED ENTERS through the trap door\u0097followed by ROUGH RIDER.\n\tHalfbreed grabs hold of INDY's feet, but Indy kicks at him and he loses his grasp.\n\n\tINDY crawls away, toward an opening on the opposite side. HALFBREED grabs at\n\tIndy's feet again; Indy rolls away and we SEE large bins of squirming snakes.\n\n\tThe combined weight of the three people is more than the catwalk was intended\n\tfor, and the BOLTS BEGIN TO RIP FROM THE CEILING.\n\n\tEveryone holds their breath, afraid to make another move. Too late. SEVERAL\n\tBOLTS TEAR FREE. HALFBREED and ROUGH RIDER SCREAM... but it's Indy's\n\tend of the catwalk that DROPS DOWN... PLUNGING INDY to the floor of the car.\n\n\tHe lands hard, with a SPLASH into a vat of water... where he finds himself eye-\n\tto-eye with an\u0097\n\n<b>\tENORMOUS ANACONDA\n</b>\n\tThe head of this snake is so damn big, it looks more like a Tyrannosaurus Rex.\n\n<b>\t\t\tINDY\n</b>\t\tOh...\t\t\n\n\tINDY jumps back in horror... only to land with a SQUISH into the SNAKE VAT.\n\n<b>\t\t\tINDY\n</b>\t\tOh... Oh...\n\n\tHundreds of slippery, squirming snakes. INDY sinks into them. They cover him.\n\tEngulf him. Almost smother him.\n\n\tINDY jumps out of the side of the vat, freeing himself.\n\n\tINDY locates a clean-out door at the bottom of the car and uses it to escape.\n\n\tHALFBREED, meanwhile, tries to open the closed window of the car. He groans.\n\tROUGH RIDER moves to assist him.\n\n<b>\t\t\tROUGH RIDER\n</b>\t\tHere, let me.\n\n\n\n<b>\tEXT. THE TRAIN- DAY\n</b>\n\tINDY stops, checks to see the Cross still lodged in his belt. Suddenly he looks\n\tworried as he frantically reaches into his shirt, REMOVES A SNAKE FROM and\n\ttosses it away.\n\n\tROSCOE APPEARS atop the reptile car and manages to grab INDY. Indy kicks at\n\thim. Roscoe grabs onto the side of the reptile car as Indy moves on to...\n\n<b>\tEXT. A FLATCAR - DAY\n</b>\n\tINDY climbs over canvas-covered circus equipment. ROSCOE follows, grabbing a\n\tlong stick with a hook on it. He reaches forward and trips Indy, who falls onto\n\tthe roof of the rhino boxcar.\n\n\n<b>\tINT. THE RHINO BOXCAR - DAY\n</b>\n\tas a lamp falls from the ceiling with the impact of Indy's fall, hitting a HUGE\n<b>\tBLACK RHINOCEROS.\n</b>\n\n<b>\tEXT. THE RHINO BOXCAR - DAY\n</b>\n\tROSCOE grabs INDY by the ankle and yanks him off his feet. The two struggle,\n\trolling from side to side, coming perilously close to rolling right off the edge.\n\tThings get even more serious when Roscoe PULLS A KNIFE.\n\n\n<b>\tIN THE BOXCAR BELOW\n</b>\n\t... THE FEROCIOUS BLACK RHINO is becoming extremely agitated by the\n\tcommotion going on atop his cage. Finally, he raises his head and THRUSTS HIS\n<b>\tHORN THROUGH THE ROOF.\n</b>\n<b>\tBACK TO THE ROOFTOP\n</b>\n\tas the horn SMASHES through the wood only inches from INDY's head. Indy and\n\tRoscoe stare at the horn in amazement as they continue to struggle.\n\tSMASH! The horn comes up again\u0097RIGHT BETWEEN INDY'S LEGS.\n\n<b> \t\t\tINDY\n</b>                   \t\tHoly smokes!\n<b>                                    \n</b>\n\tINDY kicks ROSCOE away. Roscoe rolls to the edge of the car but keeps from\n\tfalling. Indy flips over onto his stomach.\n\n\n<b>\tEXT. THE REPTILE CAR - DAY\n</b>\n\tThe WOODEN TRAP DOOR EXPLODES as a BULLET is FIRED from within. The\n\tdoor is pushed open and HALFBREED and ROUGH RIDER hurry out of the car.\n\n\n<b>\tEXT. THE RHINO BOXCAR - DAY\n</b>\n\tINDY gets to his feet\u0097looks ahead\u0097sees a WATER TANK alongside the track\n\tdirectly up ahead. Indy gets an idea...\n\n\tIn an instant, he calculates his approach\u0097times the distance\u0097and LEAPS for\n\tthe tank's WATER SPOUT.\n\n\n<b>CONTINUED:\n</b>\n\tHe catches it perfectly... but his velocity causes the water spout to ROTATE A\n\tFULL 360 DEGREES. With INDY hanging on, feet kicking, the water spout\n\tdeposits him back on the train, onto the ROOF OF A STOCKCAR, where he looks\n\tup to see FEDORA walking toward him.\n\n<b>               \t\t\tFEDORA\n</b>\t\tCome on, kid. There's no way\n\t\tout of this.\n\n\tAs INDY edges away from FEDORA, a portion of the STOCKCAR'S ROOF\n\tCOLLAPSES and Indy FALLS THROUGH into the car below.\n\n\n<b>\tINT. THE STOCKCAR - DAY\n</b>\n\tINDY CRASHES down from above. Dust rises.\n\n<b>\t\t\tINDY\n</b>                  \t\tOhhh!                                   \n\n\tINDY's eyes take a moment to adjust to the dark. A bit of sunlight leaks in\n\tthrough the cracks between the boards.\n\n\tThen INDY sees it. At the far end of the boxcar. Rising slowly to its feet... an\n\tAFRICAN LION. The Lion ROARS. The boxcar walls shake. Indy gasps. Dust\n\tswirls up into the shafts of sunlight.\n\n\tAnd INDY has one more surprise in store: The Cross of Cortes has been dislodged\n\tfrom his belt during the fall...\n\n\tINDY glances around, sees a coiled LION TAMER'S WHIP hanging on a nail. He\n\tcarefully takes it down by the handle. The Lion sees this and GROWLS SOFTLY.\n\n\tINDY swallows hard and gives the whip a try. It unravels awkwardly, its TIP\n\tflying back and HITTING INDY IN THE FACE... CUTTING his chin.\n\n\tThe Lion GROWLS LOUDER. Indy quickly gathers up the whip, wets his lips, and\n\ttries again. This time\u0097success! The WHIP CRACKS SHARPLY. The Lion\n\tBELLOWS and SWATS the air... and steps back.\n\n\tINDY looks amazed and delighted. He CRACKS the whip again. The Lion backs\n\taway even more. Indy inches forward\u0097bends down (never taking his eyes off\n\tthe Lion)\u0097picks up the Cross\u0097and steps back again, sweat pouring down his\n\tface.\n\n\tBut now... how to get out?\n\n\tHe looks up at the opening through which he fell and sees FEDORA LOOKING\n\tDOWN AT HIM. Fedora extends his hand.\n\n<b>               \t\t\tFEDORA\n</b>\t\tToss up the whip.\n\n<b>\tEXT. THE ROOFTOP OF STOCKCAR\n</b>\n\tFEDORA, assisted by HALFBREED and ROUGH RIDER, \"reels\" INDY out of the\n\tStockcar as the Lion ROARS and lunges and Indy screams.\n\n\tThe men, including ROSCOE, pull INDY through the hole in the roof. He stands to\n\tface them as ROUGH RIDER points a gun in his direction.\n\n<b>\t\t\tFEDORA\n</b>         \t \tYou've got heart, kid.\n\t\t       (indicates Cross)\n\t\tBut that belongs to me.\n\n<b>       \t\t\tINDY\n</b>\t\t       (takes Cross from his belt)\n\t\tIt belongs to Coronado.\n\n<b>       \t\t\tFEDORA\n</b>\t\t       (overlapping)\n          \t\tCoronado is dead. And so are all\n\t\this grandchildren.\n\n<b>\t\t\tINDY\n</b>\t\tThis should be in a museum.\n\n<b>\t\t\tROSCOE\n</b>          \t\tNow give me thatl\n\n\tROSCOE makes a grab for the Cross\u0097but INDY doesn't let go. A tug-of-war\n\tensues until a SNAKE WIGGLES OUT FROM INDY'S SHIRTSLEEVE and WRAPS\n\tAROUND Roscoe's hand.\n\n\tROSCOE SCREAMS BLOODY MURDER\u0097releases his grip on the Cross and tries\n\tto shake off the snake. This is all the opportunity Indy needs. He LEAPS ONTO\n<b>\tTHE NEXT CAR.\n</b>\n<b>\t\t\tFEDORA\n</b>          \t\tDon't let him get awayl\n\n\tINDY swings down to the caboose. He sees a sign above the caboose door reading\n<b>\t\"DR. FANTASY'S MAGIC CABOOSE.\"\n</b>\n<b>\t\t\tINDY\n</b>\t\tMagic?\n\n\tHe glances back at the men and quickly opens the door to the caboose, stepping\n\tinside.\n\n\tFEDORA puts out his arm, gesturing for the others not to follow INDY.\n\n<b>\t\t\tFEDORA\n</b>          \t\tHold it. Make sure he doesn't\n\t\tdouble back.\n\n<b>\tINT. THE CABOOSE - DAY\n</b>\n\twhich contains the circus MAGIC EQUIPMENT. INDY rushes to the rear door of\n\tthe caboose but can't open it. He hears FEDORA coming, and dives into a MAGIC\n<b>\tBOX.\n</b>\n<b>               \t\t\tFEDORA\n</b>\t\tOkay, kid. out of the box.\n\t\tNow.\n\n\tFEDORA smiles confidently and advances toward the box. The box unexpectedly\n\tcollapses; all four sides flop away... revealing NOTHING. INDY has completely\n\tvanished.\n\n\tFEDORA is mystified, frustrated and angered. Then he feels a breeze at his back.\n\tHe turns and discovers that the caboose door is open. He rushes out onto the\n\tbalcony and sees:\n\n\tINDY RUNNING along the tracks, turning up a street of modest clapboard houses.\n\n\n<b>\t\t\tFEDORA\n</b>\t\tDamn.\n\n\n<b>\tEXT. STREET - SMALL TOWN - DAY\n</b>\n\tas INDY runs from the railroad tracks and approaches his house we see the name\n\t\"JONES\" painted on the mailbox.\n\n<b>               \t\t\tINDY\n</b>\t\tDad!\n\n<b>\tINT. THE HOUSE - DAY\n</b>\n\tINDY bursts through the front door holding the Cross in his hand. A Husky\n\tBARKS as Indy runs past in search of his father.\n\n<b>               \t\t\tINDY\n</b>\t\tDad!\n\n<b>               \t\t\tINDY\n</b>\t\tDad!\n\n<b>\tINT. THE STUDY - DAY\n</b>\n\tINDY charges in. The study is cluttered with books. Pictures, charts and maps\n\tclearly reflect the father's passion for Medieval studies.\n\n\tPROFESSOR HENRY JONES is absorbed at his desk. In fact, he is studying a very\n\tancient parchment volume which lies open on the desk. The page shows a\n\tbeautifully illuminated picture of what might be a stained-glass window. The\n\tsketch incorporates a series of Roman numerals. The Professor is not just\n\tstudying it, he is copying it into his own notebook.\n\n\n<b>CONTINUED:\n</b>\nWe never get to see the PROFESSOR's face in this scene.\nSo INDY CHARGES IN.\n<b>                 \n</b><b>\t\t\tINDY\n</b>\t\tDad!\n\n<b>\t\t\tHENRY\n</b>\t\tOut!\n\n<b>\t\t\tINDY\n</b>\t\tIt's important!\n\n<b>\t\t\tHENRY\n</b>\t\tThen wait\u0097count to twenty.\n\n<b>\t\t\tINDY\n</b>\t\tNo, Dad. You listen to me\u0097\n\n<b>\t\t\tHENRY\n</b>                 \t\t      (now he shouts)\n\t\tJunior!\n\n\tNo question who is the boss here. INDY gulps, his look says \"What am I going to\n\tdo with this guy?\" And obeys\u0097\n\tstarts counting, VERY, VERY FAINTLY.\n\n<b>\t\t\tINDY\n</b>\t\tOne, two, three, four...\n\n\tNow we see what HENRY is concentrating on. We see his hand\n\tsketching; then, he holds up one finger.\n\n<b>\t\t\tHENRY\n</b>\t\tIn Greek.\n\n\tINDY's reaction:\n\n<b>\t\t\tINDY\n</b>                 \t\t     (louder, in Greek)\n\t\tOne... two... three... four...\n\n\tAn ancient car is heard arriving. Perhaps INDY glimpses it going past the\n\twindow. Anyway, it stops outside the house. Two men sit in the front seat.\n\tHERMAN sits in the rear, BLOWING A TRUMPET.\n\n\tINDY's reaction: Trouble!\n\n\tHENRY is just finishing the sketch.\n\n<b>\t\t\tHENRY\n</b>\t\tMay he who illuminated this...\n\t\tilluminate me...\n\n<b>\tINT. THE FRONT ROOM - DAY\n</b>\n\tThe study door is just closing, INDY closing it behind him... just as HERMAN\n\tcomes through the front door, still playing the trumpet.\n\n\tINDY reaches for the trumpet, pulling it from HERMAN's mouth. Herman\n\tcontinues to spit\u0097right into Indy's face. Indy flinches.\n\n<b>               \t\t\tHERMAN\n</b>\t\tI brought the Sheriff.\n\n\tHERMAN means the SHERIFF, who now enters the house.\n\n\n<b>               \t\t\tINDY\n</b>\t\tJust the man I want to see! Now,\n\t\tthere were five or six of them.\n\n\n<b>            \t\t\tSHERIFF\n</b>        \t\t      (interrupting)\n\t\tAll right, son.\n\n<b>              \t\t\tINDY\n</b>        \t\t      (overlapping)\n\t\t... they came after... me...\n\n\n<b>                          \t\tSHERIFF\n</b>\t\tYou still got it?\n\n<b>               \t\t\tINDY\n</b>\t\tWell, yes, sir. It's right here!\n\n\tINDY shows the CROSS, more or less handing it to the SHERIFF to make his\n\tpoint. The Sheriff takes it casually.\n\n<b>               \t\t\tSHERIFF\n</b>\t\tI'm glad to see that... because\n\t\tthe rightful owner of this Cross\n\t\twon't press charges, if you give\n\t\tit back.\n\n\tFEDORA enters the house, followed by ROSCOE, ROUGH RIDER and HALFBREED.\n\tHe politely removes his hat and holds it in his hand. He nods at INDY in a\n\tfriendly manner.\n\n<b>               \t\t\tSHERIFF\n</b>\t\tHe's got witnesses, five or six\n\t\tof them.\n\n\tThe SHERIFF and FEDORA are in Cahoots\n\n\tThe SHERIFF hands the Cross to FEDORA. ROSCOE reaches in and takes it from\n\tFedora, then runs out the door.\n\n<b>\t\t\tROSCOE\n</b>           \t\tYahoo!\n\n<b>CONTINUED:\n</b>\n\tAs ROSCOE runs outside INDY sees\u0097through the screen door\u0097the MAN IN\n\tTHE PANAMA HAT waiting patiently beside the car that is parked out front.\n\tRoscoe approaches and gives the Man the Cross\u0097the Man hands Roscoe some\n\tmoney in exchange.\n\n\tThe SHERIFF tips his hat and leaves.\n\n<b>\t\t\tSHERIFF\n</b>\t\tGood day.\n\n\tFEDORA remains behind for a moment. He turns and speaks to INDY in an ironic\n\tman-to-man way.\n\n<b>                \t\t\tFEDORA\n</b>     \t\tYou lost today, kid, but that\n\t\tdoesn't mean you have to like it.\n\n\tThen, FEDORA takes off his hat and takes a step towards INDY. He holds the hat\n\tby the crown, and puts it on Indy's head, a show of respect and admiration for\n\tthe boy. The hat blocks Indy's face.\n\n<b>\tCLOSE ON THE TOP OF THE FEDORA HAT\n</b>\n\tThe hat brim fills the screen. As the brim tilts up, WE SEE the face of FULL\n<b>\tGROWN INDIANA JONES.\n</b>\n\tAnd... POW!... he's punched in the face while his arms are pinned behind his\n\tback.\n\n<b>\tFADE IN TITLE: \"PORTUGUESE COAST\u00971938\"\n</b>\n<b>                                  \t\tPANAMA HAT\n</b>\t\tSmall world, Doctor Jones.\n\n<b>                                     \t\tINDY\n</b>\t\tToo small for two of us.\n\n\tTHE MAN IN THE PANAMA HAT (years older now) removes the CROSS OF\n\tCORONADO from Indy's belt.\n\n<b>                                  \t\tPANAMA HAT\n</b>     \t\tThis is the second time I've had\n     \t\tto reclaim my property from you\u0097\n\n<b>                \t\t\tINDY\n</b>     \t\tThat belongs in a museum\u0097\n\n<b>                \t\t\tPANAMA HAT\n</b>\t\tSo do you.\n\t\t      (he moves his eyeline)\n\t\tThrow him over the side.\n\n<b>\tTHE DECK OF A PORTUGUESE CARGO SHIP\n</b>\n\tIt's NIGHT. RAIN POURS down. We're in the middle of a violent STORM AT SEA.\n\tThirty-foot waves crash across the deck.\n\n\tThe TWO PORTUGUESE SAILORS (who have Indy's arms pinned behind his back)\n\tpropel INDY across the deck toward the rail.\n\n\tAs they pass a BUNDLE OF FUEL DRUMS, INDY uses the Two Sailors as leverage\n\tto KICK UP HIS FEET and break open the CLAMP on the metal bands that hold\n\tthe drums together.\n\n\tINDY jabs his elbows into the stomachs of the startled Sailors and rushes toward\n\tthe MAN IN THE PANAMA HAT.\n\n\tPANAMA HAT sees INDY coming and hurries toward the ladder that leads up to\n\tthe bridge. Indy withstands the force of waves crashing on the deck and makes\n\this way to where Panama Hat is climbing the ladder. He pulls him off the ladder\n\tfrom behind the two men fall down on the deck. Indy takes the cross back from\n\tPanama Hat.\n\n\tA sailor delivers a powerful blow to Indy's face, sending the cross flying out of\n\this grip and skittering across the deck. Indy grabs a crowbar and fends off two\n\tsailors who attack him from the sides.\n\n\tINDY sees that the Cross is about to be swept overboard. He lunges for it.\n\n\tHe SNATCHES UP the Cross only to be knocked down to the deck by a giant wave.\n\tHe struggles to his feet, managing to avoid the giant fuel drums sliding across the\n\tdeck around him.\n\n\tSEVERAL MORE DRUMS come INDY's way. He sidesteps them all.\n\n<b>               \t\t\tPANAMA HAT\n</b>\t\tGrab him, he's getting away!\n\t\tGrab him!\n\n\tIndy turns around and pummels two sailors with one punch. Indy sees a large\n\tStevedore's hook above him and he climbs up on crates to reach it. He grabs a\n\thold of the hook and uses it to swing all the way across the deck, narrowly\n\tavoiding a huge wave behind him. He jumps into the rollicking ocean, still\n\tholding onto the cross. On the ship, a giant fuel drum rolls wildly, falling directly\n\tonto a crate of TNT. The crate explodes, causing the entire ship to blow, sending\n\tan enormous orange fireball into the sky.\n\n<b>\tLONG SHOT - THE BOAT EXPLODING OUT OF THE WATER\n</b>\n\tas bits of debris fall from the sky like rain.\n\n<b>\tINDY BOBS UP\n</b>\n\tin the water amid the debris, holding the Cross in his hand. He grabs for\n\tsomething to keep him afloat. It turns out to be one of the ship's LIFE\n\tPRESERVERS. INDY loops his arm through the preserver.\n\n\n<b>CONTINUED:\n</b>\n\tOnly now do we see the FADED LETTERING on the preserver revealing the\n\tdestroyed ship's name and city of port:\n\n                  VAZQUEZ de CORONADO\n<b>\tBARCELONA\n</b>\n\tA SHREDDED PANAMA HAT floats past.\n\n<b>\tEXT. COLLEGE - DAY\n</b>\tStudents walk along brick, tree-lined paths.\n\n<b>\t\t\tINDY (V.O .)\n</b>\t\tArchaeology is...\n\n\n<b>\tINT. COLLEGE LECTURE HALL - DAY\n</b>\n<b>\tDISSOLVE TO:\n</b>\n\tINDY, dressed in professorial tweeds, stands before his class. He turns to the\n\tblackboard with a piece of chalk and writes the word: \"FACT.\"\n\n<b>\t\t               INDY\n</b>\t\t... the search for fact. Not truth.\n\t\tIf it's truth you're interested\n\t\tin, Doctor Tyree's Philosophy\n\t\tclass is right down the hall.\n\n\tLaughter.\n\n<b>\tINT. CORRIDOR - DAY\n</b>\n<b>\t\t               INDY\n</b>\t\tSo forget any ideas you've got\n\t\tabout lost cities, exotic travel,\n\t\tand digging up the world. Eve\n\t\tdo not follow maps to buried\n\t\ttreasure and \"X\" never, ever,\n\t\tmarks the spot.\n\n\n\tMARCUS BRODY approaches Indy's classroom. He peers through the window in\n\tthe door to see INDY completing his lecture.\n\n<b>\t\t               INDY\n</b>\t\tSeventy percent of all archaeology\n\t\tis done in the library. Research.\n\t\tReading.\n\n\n<b>\tINT. LECTURE HALL - DAY\n</b>\n\tBRODY enters the lecture hall and stands at the rear of the room.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               INDY\n</b>\t\tWe cannot afford to take mythology\n\t\tat face value.\n\n\tThe BELL RINGS. INDY stands at his desk as students begin to disperse. A\n\tpretty coed puts a note on the desk.\n\n<b>\t\t               INDY\n</b>\t\tNext week: \"Egyptology.\" Starting\n\t\twith the excavation of Naukratis\n\t\tby Blinders Petrie in 1885. I will\n\t\tbe in my office if anybody's got\n\t\tany problems for the next hour\n\t\tand a half.\n\n\tBRODY approaches as the last of the students leaves the lecture hall.\n\n<b>\t\t\tINDY\n</b>\t\tMarcus!\n\t\t      (slaps his pocket)\n\t\tI did it!\n\n<b>\t\t\tBRODY\n</b>\t\tYou've got itl\n\n\tINDY removes the cloth-wrapped Cross from his desk. He places it on the desk\n\tand takes off his glasses as BRODY examines the Cross.\n\n<b>\t\t               INDY\n</b>\t\tYou know how long I've been\n\t\tlooking for that?!\n\n<b>\t\t\tBRODY\n</b>\t\tAll your life.\n\n<b>\t\t\tINDY\n</b>\t\tAll my life!\n\n\n<b> \t\t              BRODY\n</b>\t\tWell done, Indy. Very well done,\n\t\tindeed This will find a place\n\t\tof honor in our Spanish collection.\n\n\tINDY gathers up his books and makes his way toward the door.\n\n<b>\t\t               INDY\n</b>\t\tWe can discuss my honorarium over\n\t\tdinner and champagne tonight.\n\n\tHe turns back toward BRODY, now holding the Cross.\n\n<b>\t\t\tINDY\n</b>\t\tYour treat.\n\n<b>\t\t\tBRODY\n</b>\t\tYes. My treat.\n\n<b>\tINT. INDY'S OUTER OFFICE - DAY\n</b>\n\tBursting with STUDENTS, all competing for his attention at once: \"Professor\n\tJones! \" \"Doctor Jonesl \" etc., etc.\n\n<b>\t\t               INDY\n</b>\t\tShush! Shush! Shushl\n\n\tINDY shoulders his way to the desk of his secretary, an overwhelmed Teaching\n\tAssistant named IRENE.\n\n<b>\t\t               IRENE\n</b>\t\tDoctor Jones! I'm so glad you're\n\t\tback! Your mail is on your desk.\n\t\tHere are your phone messages.\n\n<b>\t\t               MALE STUDENT\n</b>\t\tDoctor Jones, you promised...\n\t\tDoctor Jones\u0097\n\n<b>\t\t               IRENE\n</b>\t\tThis is your appointment schedule.\n\t\tAnd these term papers still haven't\n\t\tbeen graded.\n\n\tINDY takes the term papers then turns to enter his PRIVATE OFFICE. Students\n\tonce again CLAMOR for his attention: \"Doctor Jones!\" \"Wait, Doctor Jonesl\"\n\t\"My grade!\" \"Sign my registration card!\"\n\n\tINDY silences the mob with a raised hand.\n\n<b>\t\t\tINDY\n</b>\t\t        (very efficiently)\n\t\tOkay. Irene, put everyone's name\n\t\ton a list, in the order they\n\t\tarrived, and I'll see each and\n\t\tevery one of them in turn.\n\n\tThe Students descend upon poor IRENE, each claiming to be first. INDY slips into\n\this -\n\n<b>\tPRIVATE OFFICE\n</b>\n\twhere he goes to his desk and finds a thick envelope with a foreign postmark on it.\n\n<b>\t\t\tINDY\n</b>\t\t        (softly; reading)\n\t\t\"Venice, Italy.\"\n\n\tThen, INDY stuffs his mail into his coat pockets, goes to the WINDOW, slides it\n\topen and STEPS OUT INTO THE GARDEN.\n\n\n<b>\tEXT. SIDE OF COLLEGE BUILDING - DAY\n</b>\n\tINDY escapes through the garden.\n\n<b>\tEXT. FRONT OF COLLEGE BUILDING - DAY\n</b>\n\tINDY walks briskly toward the street; smiling, erUoying his freedom. As he\n\tarrives at the curb, a LONG BLACK PACKARD SEDAN pulls up before him.\n\n\n<b>\t\t\tMAN (O.S.)\n</b>\t\tDoctor Jonesl\n\n\tTHREE MEN step out of the sedan. Everything about them bespeaks \"G-MAN.\"\n\tThe First Man steps behind Indy.\n\n<b>\t\t               MAN\n</b>\t\tDoctor Jones?\n\n<b>\tINT. PENTHOUSE APARTMENT - DAY\n</b>\n\tINDY is ushered into a large Art Deco apartment and left alone. Numerous\n\tmuseum-quality artifacts are displayed around the room. Indy takes this\n\topportunity to examine them.\n\n\tAfter a moment, WALTER DONOVAN enters from across the room. During the\n\tbrief time that the door is open, we HEAR a COCKTAIL PARTY going on in the\n\tnext room: VOICES and SOFT PIANO MUSIC.\n\n\tDONOVAN strides across the room toward INDY. Although in his late fifties,\n\tDonovan has the broad shoulders and trim physique of a much younger man.\n\tDressed in a tuxedo, he exudes both confidence and power.\n\n<b>\t\t               DONOVAN\n</b>\t\tI trust your trip down was\n\t\tcomfortable, Doctor Jones. My\n\t\tmen didn't alarm you, I hope.\n\n\tHe shakes hands with INDY.\n\n<b>\t\t               DONOVAN\n</b>\t\tMy name is Donovan. Walter Donovan.\n\n<b>\t\t               INDY\n</b>\t\tI know who you are Mr. Donovan.\n\t\tYour contributions to the museum\n\t\tover the years have been extremely\n\t\tgenerous. Some of the pieces in\n\t\tyour collection here are very\n\t\timpressive.\n\n<b>\t\t               DONOVAN\n</b>\t\tWell, like yourself, Doctor Jones,\n\t\tI have a passion for antiquities.\n\t               \t         (beat)\n\t\tHave a look over here. This might\n\t\tinterest you.\n\n\n<b>CONTINUED:\n</b>\n\tDONOVAN goes to a table where an object is wrapped in cloth. He throws back\n\tthe cloth revealing a flat STONE TABLET\u0097about two feet square, inscribed with\n\tletters and symbols.\n\n\tINDY looks impressed. He puts on his glasses to make a closer examination.\n\n<b>\t\t               INDY\n</b>\t\tWell, it's sandstone. Christian\n\t\tsymbol. Early Latin text. Mid-\n\t\tTwelfth Century, I should think.\n\n<b>\t\t               DONOVAN\n</b>\t\tThat was our assessment as well.\n<b>\t\n</b><b>\t\t               INDY\n</b>\t\tWhere did this come from?\n\n<b>\t\t               DONOVAN\n</b>\t\tMy engineers unearthed it in the\n\t\tmountain region north of Ankara\n\t\twhile excavating for copper.\n\t\t        (beat)\n\t\tCan you translate the inscription?\n\n\tTranslating the inscription is no easy matter, even for someone as knowledgeable\n\tas INDY.\n\n<b>\t                                      INDY\n</b>\t\t        (stumbling through it)\n\t\t\"... who drinks the water I shall\n\t\tgive him, says the Lord, will have\n\t\ta spring inside him welling up\n\t\tfor eternal life. Let them bring\n\t\tme to your holy mountain in the\n\t\tplace where you dwell.\n\n\tDonovan pours champagne into several fluted glasses as Indy reads.\n\n<b>\t\t               INDY\n</b>\t\tAcross the desert and through\n\t\tthe mountain to the Canyon of\n\t\tthe Crescent Moon, to the Temple\n\t\twhere the cup that\u0097\"\n\n\tSuddenly INDY stops and looks up at DONOVAN with a startled expression.\n\n<b>\t\t               INDY\n</b>\t\t\"Where the cup that holds the\n\t\tblood of Jesus Christ resides\n\t\tforever. \"\n\n<b>\t\t\t\t                                       (CONT'D)\n</b>\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t        DONOVAN\n</b>\t\t      (reverently)\n\t\tThe Holy Grail, Doctor Jones.\n\t\tThe chalice used by Christ during\n\t\tthe Last Supper. The cup that\n\t\tcaught His blood at the Crucifixion\n\t\tand was entrusted to Joseph of\n\t\tArimathaea.\n\n\tINDY rubs his chin with a dubious expression as he takes the glass of champagne\n\tDONOVAN now offers him.\n\n<b>\t\t               INDY\n</b>\t\tThe Arthur Legend. I've heard\n\t\tthis bedtime story before.\n<b>\t\n</b><b>\t\t               DONOVAN\n</b>\t\tEternal life, Doctor Jones! The\n\t\tgift of youth to whoever drinks\n\t\tfrom the Grail.\n\t\t        (beat)\n\t\tOh, now that's a bedtime story I'd\n\t\tlike to wake up to!\n\n<b>\t\t               INDY\n</b>\t\tAn old man's dream.\n\n<b>\t\t               DONOVAN\n</b>\t\tEvery man's dream.\n\t      \t      (beat)\n\t\tIncluding your father's, I believe.\n\n\tINDY stiffens slightly at the mention of his father, nods.\n\n<b>\t\t               INDY\n</b>\t\tGrail lore is his hobby.\n\t\tHe's a teacher of Medieval\n\t\tLiterature. The one the students\n\t\thope they don't get.\n\n\tThe door opens and MRS. DONOVAN steps into the room. She's a matronly\n\twoman in an expensive evening gown.\n\n<b>\t\t               MRS. DONOVAN\n</b>\t\tWalter, you're neglecting our\n\t\tguests.\n\n<b>\t\t               DONOVAN\n</b>\t\tBe along in a moment, dear.\n\n\tHe leans over and kisses her cheek. MRS. DONOVAN sighs to herself and returns\n\tto the party. INDY, meanwhile, has turned his attention back to the Grail Tablet,\n\tobviously hooked by its archaeological promise. He moistens his finger with\n\tchampagne and rubs it over the tablet. DONOVAN steps up next to Indy.\n\n\n<b>CONTINUED: (3)\n</b>\n<b>\t\t               DONOVAN\n</b>\t\tHard to resist, isn't it? The\n\t\tHoly Grail's final resting place\n\t\tdescribed in detail!\n\n<b>\t\t               INDY\n</b>\t\tWhat good is it? This Grail\n\t\tTablet speaks of deserts and\n\t\tmountains and canyons. Pretty\n\t\tvague. Where do you start\n\t\tlooking? Maybe if the Tablet were\n\t\tintact, you'd have something to\n\t\tgo on. But the entire top\n\t\tportion is missing.\n\n<b>\t\t               DONOVAN\n</b>\t\tJust the same, an attempt to\n\t\trecover the Grail is currently\n\t\tunderway.\n\n\tINDY has to shake his head at DONOVAN's apparent lack of judgment.\n\n<b>\t\t               DONOVAN\n</b>\t\tLet me tell you another \"bedtime\n\t\tstory, \" Doctor Jones.\n\t\tAfter the Grail was entrusted\n\t\tto Joseph of Arimathaea, it\n\t\tdisappeared and was lost for a\n\t\tthousand years before it was found\n\t\tagain by three Knights of the\n\t\tFirst Crusade. Three brothers,\n\t\tto be exact.\n\n<b>\t\t               INDY\n</b>\t\tI've heard this one as well.\n\t\tTwo of these brothers walked out\n\t\tof the desert one hundred and\n\t\tfifty years after having found\n\t\tthe Grail and began the long\n\t\tjourney back to France. But\n\t\tonly one of them made it. And\n\t\tbefore dying of extreme old\n\t\tage, he supposedly imparted\n\t\this tale to a\u0097to a Franciscan\n\t\tfriar, I think.\n\n<b>\t\t               DONOVAN\n</b>\t\tNot \"supposedly,\" Doctor Jones.\n\n\tDONOVAN produces an ANCIENT LEATHER-BOUND VOLUME with very brittle\n\tpages. INDY views the manuscript with considerable interest.\n\n\n<b>CONTINUED: (4)\n</b>\n<b>\t\t               DONOVAN\n</b>\t\tThis is the manuscript in which\n\t\tthe friar chronicled the Knight's\n\t\tstory... it doesn't reveal on\n\t\tlocation of the Grail, I'm afraid...\n\t\tbut the Knight promised that two\n\t\t\"markers\" that had been left\n\t\tbehind would.\n\t\t       (indicates the Tablet)\n\t\tThis Tablet is one of those\n\t\t\"markers.\" It proves the Knight's\n\t\tstory is true. But as you pointed\n\t\tout\u0097it's incomplete.\n\t\t       (beat)\n\t\tNow, the second \"marker\" is\n\t\tentombed with the Knight's dead\n\t\tbrother. Our project leader\n\t\tbelieves that tomb to be located\n\t\twithin the city of Venice, Italy.\n\t\t       (beat)\n\t\tAs you can now see, Doctor Jones,\n\t\twe're about to complete a great\n\t\tquest that began almost two\n\t\tthousand years ago. We're only\n\t\tone step away.\n\n<b>\t\t               INDY\n</b>\t\tThat's usually when the ground\n\t\tfalls out from underneath your\n\t\tfeet.\n\n<b>\t\t               DONOVAN\n</b>\t\tYou could be more right than you\n\t\tknow.\n\n<b>\t\t               INDY\n</b>\t\tYes?\n\n<b>\t\t               DONOVAN\n</b>\t\tWe've hit a snag. our project\n\t\tleader has vanished. Along with\n\t\tall his research. Uh, we received\n\t\ta cable from his colleague, Doctor\n\t\tSchneider, who has no idea of his\n\t\twhereabouts or what's become of\n\t\thim.\n\t\t        (beat)\n\t\tI want you to pick up the trail\n\t\twhere he left off. Find the man\n\t\tand you will find the Grail.\n\n\n<b>CONTINUED: (5)\n</b>\n<b>\t\t                INDY\n</b>\t\tYou've got the wrong Jones, Mister\n\t\tDonovan. Why don't you try my\n\t\tfather?\n\n<b>\t\t\tDONOVAN\n</b>\t\t        (after a pause)\n\t\tWe already have. Your father is\n\t\tthe man who's disappeared.\n\n\n<b>\tEXT. A RESIDENTIAL STREET - DAY\n</b>\n\tA FORD COUPE speeds down the tree-lined street.\n\n<b>\tEXT. PROFESSOR HENRY JONES' HOUSE - DAY\n</b>\n\tThe Ford coupe pulls up in front of the house. INDY climbs from the car and\n\thurries up the walkway. BRODY is a step behind.\n\n<b>\t\t                BRODY\n</b>\t\tYour father and I have been\n\t\tfriends since time began. I've\n\t\twatched you grow up, Indy. And\n\t\tI've watched the two of you grow\n\t\tapart.\n\t\t        (beat)\n\t\tI've never seen you this concerned\n\t\tabout him before.\n\n\tThey climb the porch and notice that the front door is ajar. They exchange a\n\tquick look of concern as they enter.\n\n<b>\tINT. THE HOUSE - LATE AFTERNOON\n</b>\n\tINDY approaches the half-open front door.\n\n\n<b>                      \t\tINDY\n</b>\t                  \tDad?\n\t                            (to BRODY)\n\t\tHe's an academic A bookworm.\n\t\tHe's not a field mans\n\n\tHe pushes open the door. He enters the house and calls out.\n\n<b>\t                                    INDY\n</b>\t\tDad? Dad?\n<b>                                          \n</b>\tINDY opens one half of the curtains dividing the hall from the sitting room.\n\n\tWe see the place has been ransacked.\n\n\n<b>CONTINUED:\n</b>\n\tBRODY sees INDY's face and opens the other half.\n\n<b>\t\t\tBRODY\n</b>\t                        Dear God.\n\n\tThey walk into the room.\n\n\n<b> \t\t              BRODY\n</b>\t\tWhat has the old fool got\n\t\thimself into now?\n\n<b>\t\t               INDY\n</b>\t\tI don't know. But whatever it\n\t\tis, he's in over his head!\n\n\tBRODY picks up some mail from Henry's cluttered desk.\n\n<b>\t\t\tINDY\n</b>\t\tDad?              \n\n<b>\t\t               BRODY\n</b>\t       \tIt's today's mail. And it's been\n\t\topened.\n\n\tINDY turns and sees the pile of torn papers and envelopes. Then something hits\n\thim.\n\n<b>\t\t               INDY\n</b>       \t\tMail! That's it, Marcus!\n\n\tHe immediately empties his pockets of his own mail taken earlier in the day from\n\this college office and finds the envelope with the Venice postmark.\n\n<b>\t\t\tINDY\n</b>\t\t      (as he tears it open)\n\t\tVenice, Italy!\n\n<b>\t\t\tBRODY\n</b>\t\tWhat is it?\n\n\n\tINDY uncovers a small book. It looks like a JOURNAL or\n\tDIARY. Indy flips through it: Page after page of\n\thandwritten notes and drawings. BRODY glances at it with\n\tgreat curiosity.\n\n<b>\t\t               INDY\n</b>\t\tIt's Dad's Grail Diary. Every\n\t\tclue he ever followed. Every\n\t\tdiscovery he made. A complete\n\t\trecord of his search for the Holy\n\t\tGrail. This is his whole life.\n\t\tWhy would he have sent this to me?\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               BRODY\n</b>\t\tI don't know. But someone must\n\t\twant it pretty badly.\n\n<b>\t\t               INDY\n</b>\t\tDo you believe, Marcus?\n\n\tAs INDY asks the question, he turns to a PAINTING on the wall: A depiction of\n\tChrist on the Cross, his blood being captured in a golden chalice.\n\n\tA SECOND PAINTING on the wall shows Eleventh Century Crusaders plummeting\n\tto their deaths over a high cliff. One Crusader, however, floats safely in midair\n\tbecause he holds the Grail in his hands.\n\n<b>\t\t               INDY\n</b>\t\tDo you believe the Grail actually\n\t\texists?\n\n<b>\t\t               BRODY\n</b>\t\tThe search for the Cup of Christ\n\t\tis the search for the divine in all\n\t\tof us.\n\n\tBRODY sees that INDY is unsatisfied by this response.\n\n<b>\t\t               BRODY\n</b>\t\tBut if you want facts, Indy, I\n\t\thave none to give you. At my age,\n\t\tI'm prepared to take a few things\n\t\ton faith.\n\n<b>\t\t               INDY\n</b>\t\tCall Donovan, Marcus. Tell him\n\t\tI'll take that ticket to Venice\n\t\tnow.\n\n<b>\t\t               BRODY\n</b>\t\tI'll tell him we'll take two.\n\n\n<b>\tEXT. AIRFIELD - DAY\n</b>\n\tA LIMO is parked beside a PRIVATE AIRLINER that bears the DONOVAN\n\tCORPORATE LOGO. BRODY peers inside to DONOVAN and INDY.\n\n<b>\t\t               BRODY\n</b>\t\tTell me, what's going to happen\n\t\twhen we get to Venice?\n\n<b>\t\t\tDONOVAN\n</b>\t\t      (overlapping)\n\t\tDon't worry. Doctor Schneider will\n\t\tbe there to meet you.\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tBRODY\n</b>\t\t      (overlapping)\n\t\tSchneider?\n\n<b>\t\t               DONOVAN\n</b>\t\t     (overlapping)\n\t\tI maintain an apartment in Venice,\n\t\tat your disposal.\n\n<b>               \t\t\tBRODY\n</b>\t\tOh, well. That's good. Thank\n\t\tyou.\n\n\tBRODY and DONOVAN shake hands. INDY steps from the back seat of the limo.\n\tHe turns back to Donovan and shakes his hand.\n\n<b>\t\t               DONOVAN\n</b>\t\tDoctor Jones. Good luck. Be\n\t\tvery careful. Don't trust anvbody.\n\n\n<b>\tINT. AIRLINER - FLYING - DAY\n</b><b>\t\n</b>\tINDY opens the Grail Diary and thoughtfully turns through the pages. He stops\n\tat one page and glances at a PENCIL SKETCH of what might be a stained-glass\n\twindow. Below the sketch is a SERIES OF NUMBERS.\n\n\n<b>\tEXT. THE PRIVATE AIRLINER - FLYING - DAY\n</b>\n\tSUPERIMPOSED over a MAP that traces a course from New York City to Venice,\n\tItaly.\n\n<b>\tDISSOLVE TO:\n</b>\n\n<b>\tEXT. VENICE - BOAT LANDING - DAY\n</b>\n\tINDY and BRODY disembark from the Water Bus onto the Boat Landing as other\n\tGondoliers steer their boats in the water.\n\n<b>\t\t\tINDY\n</b>\t\t Ah, Venice...\n\n<b>\t\t               BRODY\n</b>\t\tYes. Uh, how will we recognize\n\t\tthis Doctor Schneider when we\n\t\tsee him?\n\n<b>\t\t               INDY\n</b>\t\tI don't know. Maybe he'll know\n\t\tus.\n\n\n<b>CONTINUED:\n</b>\n\tSuddenly a WOMAN comes up to him. Attractive features. Blonde hair. Eyes\n\tthat are bright and intelligent.\n\n<b>\t\t\tELSA\n</b>\t\tDoctor Jones?\n\n<b>\t\t\tINDY\n</b>\t\tYes?\n\n<b>\t\t               ELSA\n</b>\t\tI knew it was you\u0097\n\n\tShe looks at him with an appraising expression that is brazenly flirtatious.\n\n<b>\t                                      ELSA\n</b>\t                       \u0097you have your father's eyes.\n\n\tINDY is instantly attracted to her.\n\n<b>\t\t               INDY\n</b>\t\tAnd my mother's ears. But the\n\t\trest belongs to you.\n\n<b>\t\t               ELSA\n</b>\t\tLooks like the best parts have\n\t\talready been spoken for.\n\n\tINDY grins, enjoying the repartee. The WOMAN turns to BRODY, who tips his hat.\n\n<b>\t\t               ELSA\n</b>\t\tMarcus Brody?\n\n<b>\t\t               BRODY\n</b>\t\tThat's right.\n\n\tThe Woman, DR. ELSA SCHNEIDER, extends her hand to BRODY.\n\n<b>\t\t\tELSA\n</b>\t\t        (introducing herself)\n\t\tDoctor Elsa Schneider.\n\n\tINDY's grin fades. BRODY registers a look of surprise.\n\n<b>\t\t               BRODY\n</b>\t\tUh... how do you do?\n\n<b>\t\t\t\t\tCUT TO:\n</b>\n\n<b>\tEXT. VENICE CANAL - DAY\n</b>\n\tINDY, BRODY and ELSA walk along the narrow canal, lined with buildings on\n\teither side.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               ELSA\n</b>\t\tThe last time I saw your father\n\t\twe were in the library. He was\n\t\tvery close to tracking down the\n\t\tKnight's Tomb. I've never seen\n\t\thim so excited. He was as giddy\n\t\tas a schoolboy.\n\n<b>\t\t               INDY\n</b>\t\tWho? Attila the Professor? He\n\t\twas never giddy, even when he was\n\t\ta schoolboy!\n\n\tINDY can't take his eyes off ELSA. Perhaps he's feeling a bit like a schoolboy\n\thimself right now. As they cross over a bridge to the opposite side of the canal,\n\tIndy steals a flower from a street vendor. He holds it out to Elsa.\n\n<b>\t\t               INDY\n</b>\t\tFraulein\u0097will you permit me?\n\n<b>\t\t               ELSA\n</b>\t\tI usually don't.\n\n<b>\t\t               INDY\n</b>\t\tI usually don't either.\n\n<b>\t\t               ELSA\n</b>\t\tIn that case, I permit you.\n\n\tINDY gives her the flower.\n\n<b>\t\t               INDY\n</b>\t\tIt would make me very happy.\n\n<b>\t\t               ELSA\n</b>\t\tBut I'm already sad\u0097by tomorrow\n\t\tit will have faded.\n\n<b>\t\t               INDY\n</b>\t\tTomorrow I'll steal you another.\n\n<b>\t\t               BRODY\n</b>\t\t        (cutting in)\n\t\tI hate to interrupt you\u0097but the\n\t\treason we're here\u0097\n\n<b>\t\t\tELSA\n</b>\t\t        (interrupting)\n\t\tYes. I have something to show\n\t\tyou.\n\n\tShe hands a slip of paper to INDY.\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               ELSA\n</b>\t\tI left your father working in\n\t\tthe library. He sent me to the\n\t\tmap section to fetch an ancient\n\t\tplan of the city. When I got back\n\t\tto his table\u0097he'd gone\u0097with\n\t\tall his papers\u0097except for that\n\t\tscrap which I found near his chair.\n\n\tINDY extends the scrap of paper to BRODY.\n\n<b>\t\t               INDY\n</b>\t\tRoman numerals.\n\n\n<b>\tEXT. VENICE PIAZZA - DAY\n</b>\n\tELSA leads INDY and BRODY into the large piazza. People walk about and sit at\n\ttables in front of a large building.\n\n<b>\t\t               ELSA\n</b>\t\tHere is the library.\n\n\tThey have arrived at the front steps of the library.\n\n<b>\t\t               INDY\n</b>\t\tThat doesn't look much like a\n\t\tlibrary.\n\n<b>\t\t               BRODY\n</b>\t\tIt looks like a converted church.\n\n\tELSA leads the way inside.\n\n\n<b>\tINT. THE LIBRARY - DAY\n</b>\n\tINDY, BRODY and ELSA enter, their heels CLICKING across the marble floor.\n\n\tWe notice, along with INDY and BRODY, that the library contains many stained-\n\tglass windows.\n\n<b>\t\t               ELSA\n</b>\t\tIn this case it's the literal\n\t\ttruth. We're on holy ground.\n\t\tThese columns over here...\n\n\tShe indicates FOUR HUGE MARBLE COLUMNS that go from floor to ceiling.\n\n<b>\t\t               ELSA\n</b>\t\t... were brought back as spoils\n\t\tof war after the sacking of\n\t\tByzantium during the Crusades.\n\n\n<b>CONTINUED:\n</b>\n\tINDY glances at the Columns, then notices a Stained-Glass Window that depicts a\n\tKnight of the Crusades. Indy lingers for a moment in front of the window.\n\n<b>\t\t               ELSA\n</b>\t\tNow please excuse me. The library's\n\t\tclosing in a few moments. I'll\n\t\tarrange for us to stay a little\n\t\tlonger.\n\n\tThe minute ELSA is out of earshot.\n\n<b>\t\t               INDY\n</b>\t\tMarcus\u0097I've seen this window\n\t\tbefore.\n\n<b>\t\t\tBRODY\n</b>\t\tWhere?\n\n\tINDY whips out the Grail Diary and opens it to the sketch he noticed in the\n\tairplane.\n\n<b>\t\t               INDY\n</b>\t\tRight here. In Dad's Diary.\n\t\tYou see?\n\n\tBRODY glances at the Diary, then at the window\u0097noticing that the Roman\n\tnumerals in question have been worked into the window's design.\n\n<b>\t                                     BRODY\n</b>\t\tLook, Indy. The Roman numerals!\n\n<b>\t\t               INDY\n</b>\t\tDad was onto something here!\n\n<b>\t\t               BRODY\n</b>\t\tWell, now we know the source of\n\t\tthe numbers, but we still don't\n\t\tknow what they mean.\n\n\tINDY and BRODY now see ELSA approaching. Indy quickly tucks the Diary back\n\tinto his pocket.\n\n<b>\t\t               INDY\n</b>\t\t      (explaining to Brody)\n\t\tMy dad sent me this Diary for a\n\t\treason. Until we find out why,\n\t\tI suggest we keep it to ourselves.\n\n<b>\t\t               ELSA\n</b>\t\tFind something?\n\n\tINDY doesn't reply. He's looking in five directions at once. His eyes moving\n\tacross the walls and ceilings\u0097charged with the thrill of discovery.\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               BRODY\n</b>\t\t        (to ELSA)\n\t\tUh, yes. Three, seven and tent\n\t\tThat window seems to be the source\n\t\tof the Roman numerals.\n\n<b>\t\t               ELSA\n</b>\t\tMy God, I must be blind\n\n<b>\t\t               INDY\n</b>\t\tDad wasn't looking for a book\n\t\tabout the Knight's Tomb... he was\n\t\tlooking for the Tomb itself\n\n\tELSA wears a blank expression.\n\n<b>\t\t               INDY\n</b>\t\tDon't you get it? The Tomb is\n\t\tsomewhere in the library! You\n\t\tsaid yourself it used to be a\n\t\tchurch! Look.\n\n\tINDY's eyes travel up one of the four huge marble columns.\n\n<b>\t\t\tINDY\n</b>\t\tThree.\n\nINDY looks again to the stained-glass window. He points.\n\n<b> \t\t              INDY\n</b>\t\tThree!\n\n\tINDY has discovered that each Column is numbered with a Roman Numeral. Indy\n\thurries away toward Column VII. All BRODY and ELSA can do now is try to keep\n\tup with him.\n\n<b>\t\t              INDY\n</b>\t\tSeven.\n\n\tHe points again to the stained-glass window.\n\n<b>\t\t\tINDY\n</b>\t\tSeven... Ten.\n\n\tHe looks down to the scrap of paper in his hands.\n\n<b>\t\t               INDY\n</b>\t\tAnd ten. Now where's the ten?\n\t\tLook around for the ten.\n\n\tINDY walks past aisles of book-lined shelves. He stops, turns, then looks down.\n\n\n<b>CONTINUED: (3)\n</b>\n<b>\t\t\tINDY\n</b>\t\tThree, seven and ten.\n<b>\t\n</b>\tHe climbs a spiral staircase leading up to a LOFT and looks down at BRODY and\n\tELSA. The floor beneath their feet is an elaborate tile design containing a huge\n\t\"X\"\u0097visible only from this higher angle.\n\n<b>\t\t\tINDY\n</b>\t\tTen.\n\t\t      (wryly; to himself)\n\t\t\"X\" marks the spot.\n\n\tINDY rushes down the staircase and goes to the CENTER TILE where the two\n\tsides of the X intersect. He blows dust away from the tile and tries to pry it up,\n\tbut cannot.\n\n\tINDY rushes past BRODY to a cordon held in place by a brass stand underneath\n\tthe stained-glass window.\n\n\tINDY raises the brass stand and timing his actions, hits the tile precisely as the\n\tLibrarian stamps a book. The Librarian regards the stamper curiously.\n<b>\t\n</b>\tINDY continues to pound at the tile as the Librarian resumes his stamping, still\n\tpuzzled by the SOUND ECHOING through the library.\n\n\tFinally INDY breaks the tile. As he bends to remove the pieces of broken tile, a\n<b>\tTWO-FOOT SQUARE HOLE IS REVEALED.\n</b>\n\tCold air and a wet, rancid smell escape from the hole.\n\n<b>\t\t\tINDY\n</b>\t\tBingo.\n\n<b>\t\t\tELSA\n</b>\t\tYou don't disappoint, Doctor Jones.\n\t\tYou're a great deal like your\n\t\tfather.\n\n<b>\t\t\tINDY\n</b>\t\tExcept he's lost, and I'm not.\n\n<b>\t\t\tELSA\n</b>\t\tLower me down.\n\n\tINDY is impressed with Elsa's spirit, and cooperates agreeably\u0097holding her by\n\tthe hands and lowering her into the hole. When her feet finally touch ground\n\tbelow, Indy releases his grip on her and slips the Grail Diary to BRODY.\n<b>\t\n</b><b>\t\t\tINDY\n</b>\t\tLook after this for me, will you?\n\n\tThen INDY disappears into the hole.\n\n<b>\tINT. CATACOMBS BELOW LIBRARY - DAY\n</b>\n\tINDY jumps down a steep step. He reaches back to help ELSA.\n\n<b>\t\t\tINDY\n</b>\t\tCome on.\n\n\tINDY and ELSA glance around. This is really a horrid place. Dark and dank.\n\tfoul smelling. Elsa turns. She removes a cigarette lighter with a unique ivory\n\tfour-leaf clover design.\n\n\tINDY and ELSA inspect markings carved onto the walls.\n\n<b>\t\t               ELSA\n</b>\t\tPagan symbols. Fourth or Fifth\n\t\tCentury.\n\n<b>\t\t               INDY\n</b>\t\tRight. Six hundred years before\n\t\tthe Crusades.\n\n<b>\t\t               ELSA\n</b>\t\tThe Christians would have dug\n\t\ttheir own passages and burial\n\t\tchambers centuries later.\n\n\tINDY takes the lighter from her and lights their way down a dark passageway.\n\n<b>\t\t               INDY\n</b>\t\tThat's right. If there's a\n\t\tKnight of the First Crusade\n\t\tentombed down here, that's where\n\t\twe'll find him.\n\n\n<b>\tINT. LIBRARY - DAY\n</b>\n\tTHREE MEN carrying guns make their way down the spiral staircase toward an\n\tunsuspecting BRODY. One of the Men, KAZIM, raises his gun and brings it down\n\thard on Brody's head.\n\n<b>\t\t               BRODY\n</b>\t\tOhhhh. . .\n\n\tKAZIM gestures with his gun toward the now-unconscious BRODY. The other two\n\tmen take Brody's hands and drag him into one of the book-lined aisles.\n\n<b>\tINT. ANOTHER PART OF THE CATACOMBS - DAY\n</b>\n\tDECOMPOSING CORPSES rest in niches carved into the stone walls. Grotesque\n\tskeletal remains with rotting linen stretched across blackened bones.\n\n\tINDY holds the lighter up as he and ELSA inspect symbols carved into the walls.\n\n\n<b>CONTINUED:\n</b>\n\tELSA spots a symbol cut into the wall that she doesn't recognize. As she blows\n\taway some cobwebs:\n\n<b>\t\t               ELSA\n</b>\t\tWhat's this one?\n\n\tINDY only has to give it a quick glance to know.\n\n<b>\t\t               INDY\n</b>\t\tThe Ark of the Covenant.\n\n<b>\t\t\tELSA\n</b>\t\tAre you sure?\n\n<b>\t\t\tINDY\n</b>\t\t      (deadpan)\n\t\tPretty sure.\n\n\tINDY holds the lighter up and he and ELSA enter another dark passageway.\n\n<b>\tANOTHER PART OF THE CATACOMBS\n</b>\n\tINDY steps to the wall and runs his hand over the stone. He scrapes the cobwebs\n\taway to reveal the ROMAN NUMERAL \"X.\"\n\n<b>\t\t\tINDY\n</b>\t\tWatch out.\n\n\tELSA now holds the lighter as INDY rams his shoulder into the wall. The wall\n\tcollapses on impact and Indy falls through into another room.\n\n\n<b>\tANOTHER ROOM - THE CATACOMBS\n</b>\n\tas INDY falls through the hole in the wall onto rocks surrounded by bubbling,\n\tgreen, slimy liquid. More skeletons surround him, resting in their carved niches.\n\tELSA holds the lighter as she peers in at him through the hole in the wall.\n\n<b>\t\t               INDY\n</b>\t\tPetroleum. I could sink a well\n\t\tdown here and retire.\n\n\tINDY reaches up and tears a piece of cloth from one of the skeletons, which\n\tbreaks apart and falls into the oil-slick water.\n\n\tINDY uses the scrap of cloth and a bone to fashion a crude torch, which he then\n\tdips into the oily water.\n\n<b>\t\t               INDY\n</b>\t\tGive me the lighter.\n\n<b>\tANOTHER PART OF THE CATACOMBS\n</b>\n\tUsing the cloth-wrapped bone torch to guide their way, INDY and ELSA come\n\tupon a NARROW PASSAGEWAY. The water is knee-deep and TEEMING WITH\n\tRATS. Thousands of them Crawling on one another's backs. SQUEALING.\n\tSquirming. Thrashing in the water.\n\n<b>\t\t\tINDY\n</b>\t\tOh, rats...\n\n\tELSA gasps as the rats scamper between her legs.\n\n\tINDY moves forward through the rat-infested water as ELSA follows, still gasping\n\tin horror. Suddenly he slips into a hole. Recovering his balance, he reaches out\n\tto Elsa.\n\n<b>\t\t              INDY\n</b>\t\tCome onl\n\n\tShe gasps once again, terrified. INDY lifts her and carries ELSA as he moves\n\tforward.\n\n\n<b>\tTHE CATACOMBS - THE HOLE IN THE WALL\n</b>\n\tKAZIM and his men step to the opening Indy made earlier and shine their\n\tflashlights through to the rat-infested water.\n\n<b>\tANOTHER PART OF THE CATACOMBS\n</b>\n\tMore rat-infested water as ELSA, now walking again, follows INDY through\n\tanother passageway lined with skulls and bones.\n\n\tINDY reaches for a wall to steady himself and inadvertently grabs a skeleton. A\n\tbone comes loose in his hand as rats scurry about and leap at him from all\n\tdirections.\n\n\tHe takes a moment to compose himself, then steps across the water to ELSA's\n\tside. He steps into the water, then reaches up to help Elsa do the same.\n\n<b>\t\t\tINDY\n</b>\t\tCome here.\n\n<b>\tLARGE BURIAL CHAMBER\n</b>\n\tThe chamber is flooded with black, briny water.\n<b>\t\t\t\n</b><b>\t\t\tINDY\n</b>\t\tLook. . .\n\n\tIn the center of the chamber, jutting up above the water, is what amounts to an\n\t\"island altar\" on which SEVERAL ANCIENT COFFINS rest. They move toward the\n\taltar.\n\n\n<b>CONTINUED:\n</b>\n\tINDY and ELSA begin to inspect the ornately carved COFFINS like the scholars of\n\tantiquity that they are. These are big oak caskets held together by straps of\n\tetched brass.\n\n<b>\t\t             INDY\n</b>\t\tIt must be one of these...\n\n<b>\t\t             ELSA\n</b>\t\tLook at the artistry of these\n\t\tcarvings and the scrollwork.\n\n\tOne coffin is elevated above the others.\n\n<b>\t\t             ELSA\n</b>\t\tIt's this one.\n\n\tTogether they begin to push on the lid\u0097STRAINING and GROANING until it\n\tslides away and BANGS against the stone platform.\n\n\n<b>\tINSIDE THE COFFIN\n</b>\n\tlie the DECOMPOSED REMAINS of a KNIGHT IN ARMOR. INDY and ELSA look\n\tin...Elsa gasps.\n\n<b>\t\t               INDY\n</b>\t\tThis is itl we found it! Look\u0097\n\t\tthe engraving on the Shield. It's\n\t\tthe same as on the Grail Tablets\n\t\tThe Shield is the Second Marker!\n\n\tINDY unfolds a piece of paper and holds it over the shield.\n\n<b>\t\t\tELSA\n</b>\t\tWhat's that?\n\n<b>\t\t               INDY\n</b>\t\tIt's a rubbing Dad made of the\n\t\tGrail Tablet.\n\n\tThe missing portion of the rubbing is completed by the shield.\n\n<b>\t\t               ELSA\n</b>\t\tJust like your father\u0097giddy\n\t\tas a schoolboy.\n\n\tINDY laughs.\n\n<b>\t\t               ELSA\n</b>\t\tWouldn't it be wonderful if he\n\t\twere here now to see this?\n\n<b>\t\t               INDY\n</b>\t\t       (chuckles)\n\t\tHe never would have made it past\n\t\tthe rats!  He hates rats!  He's\n\t\tscared to death of them!\n\n<b>\tCLOSE - A HAND\n</b>\n\tas it lights a match.\n\n\tPULL BACK TO REVEAL KAZIM dropping the lighted match into the oil-slick\n\twater.\n\n\n<b>\tINDY AND ELSA\n</b>\n\tELSA holds the torch. INDY looks around. Listens. Something is wrong. And\n\tthen he sees the GLOW OF FIRELIGHT dancing across the Catacomb walls.\n\n\tThis is followed by THOUSANDS OF RATS FLEEING from around the corner of the\n\tNarrow Passageway, STAMPEDING toward ELSA and INDY\u0097SHRIEKING and\n\tSQUEALING as they approach.\n\n\tThe rats literally wash over them\u0097like a rodent tidal wave\u0097in their efforts to\n\tescape a:\n\n<b>\tHUGE ORANGE BALL OF FIRE\n</b>\n\tROARING around the corner hurtling towards them\u0097feeding on the oil slick;\n\tconsuming the oxygen.\n\n<b>\tELSA SCREAMS.\n</b>\n<b>\t                                     INDY\n</b>\t\tGet back! Back against the wall.\n\n\tINDY braces his back against the altar and TOPPLES THE COFFIN with his feet.\n\tIt CRASHES against the stone platform and SPLASHES into the water.\n\n<b>\t                                     INDY\n</b>\t\tQuick! Under it!\n\n\tThey jump into the water beside the bobbing, overturned coffin.\n\n<b>\t                                     INDY\n</b>\t\tAir pocket!\n\n\tELSA hesitates. INDY literally DUNKS her and pushes her underneath.\n\n\n<b>\tUNDER THE COFFIN\n</b>\n\tELSA surfaces into the air pocket created by the coffin, SPUTTERING and\n<b>\tSPITTING.\n</b>\n\tNow INDY pops up into the air pocket. He looks at ELSA\u0097they are both soaking\n\twet.\n\n<b>\t\t           \tINDY\n</b>\t\tDon't wander off.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tELSA\n</b>\t\tWhat?\n\n\tINDY disappears under the water and swims out from under the coffin.\n\n<b>\t\t\tELSA\n</b>\t\tWhat?\n\n<b>\tUNDER THE WATER\n</b>\n\tINDY swims, looking for an escape route.\n\n<b>\tUNDER THE COFFIN\n</b>\n\tThe rats are beginning to force their way inside, swimming through the water\n\tand climbing on ELSA, who squirms and screams in terror.\n\n\tINDY pops back up through the water.\n\n<b>\t\t\tINDY\n</b>\t\tI think I've found a way out.\n\t\tDeep breath.\n\n\tELSA groans. They take a deep breath and both dive under the water.\n\n\n<b>\tEXT. VENICE PIAZZA - OUTDOOR CAFE - DAY\n</b>\n\tThe perfect picture postcard\u0097St. Mark's Square and the Grand Canal beyond.\n\tCafe customers are startled to see INDY and ELSA climb out of the sewer, wet\n\tand smelly. Indy looks around at the postcard-perfect setting and smiles.\n\n<b>                  \t\t\tINDY\n</b>\t\t           (wryly)\n\t\tAh, Venicel\n\n\tIndy's delight, however, is short-lived since KAZIM and TWO OTHER TURKISH\n\tAGENTS are running towards them with drawn guns.\n\n\tHe grabs ELSA by the hand and the two of them run down the dock and LEAP\n<b>\tINTO A MOTORBOAT.\n</b>\n\n<b>\tINT. THE MOTORBOAT - DAY\n</b>\n\tINDY fires up the engine and pulls away from the dock... but not before a\n\tTurkish Agent JUMPS in with him.\n\n\tELSA grabs the wheel and begins to steer the boat while INDY and the Turk trade\n\tpunches.\n\n<b>\tEXT. THE HARBOR - DAY\n</b>\n\tIndy's Speedboat BOUNCES across the choppy waters heading in the direction of\n\tthe DOCKED STEAMSHIP.\n\n\tKAZIM and his men rush to TWO MORE SPEEDBOATS tied to the dock.\n\n\tThey chase after INDY.\n\n\tINDY grapples with the Turkish Agent. As Indy grips his arms, we SEE a GUN in\n\tthe Agent's hand. It FIRES.\n\n\tAs INDY fights with the Turk, he becomes aware of the Speedboats behind him\n\tand two enormous Freighters ahead of him, joined together by two giant ropes.\n\n\tINDY, having gained the advantage, leans on top of the Turkish Agent.\n\n<b>\t\t\tINDY\n</b>\t\t      (to ELSA)\n\t\tAre you crazy?! You don't go\n\t\tbetween them!\n\n\tELSA can barely hear INDY over the noise of the motor.\n\n<b>\t                                      ELSA\n</b>\t\tGo between them? Are you crazy?!\n\n\tINDY finally delivers the punch that sends the Turkish Agent flying overboard.\n\tTurning, Indy sees that ELSA has committed the speedboat to a course BETWEEN\n\tthe two Freighters, now being pushed even closer together by a Tugboat.\n\n<b>\t\t\tINDY\n</b>\t\tI said go around!\n\n<b>\t\t\tELSA\n</b>\t\tYou said go between them!\n\n<b>\t\t\tINDY\n</b>\t\tI said don't go between them!\n\n\tIt's purely academic at this point since the hulls of the the two Freighters loom\n\tup on either side of them like cavern walls.\n\n\n<b>\tEXT. FULL SHOT - THE HARBOR - DAY\n</b>\n\tOne Enemy Speedboat chases INDY between the two Freighters. But the Speedboat\n\tcontaining KAZIM veers off and goes around.\n\n\n<b>\tEXT. BETWEEN THE TWO FREIGHTERS - DAY\n</b>\n\tIt's a race for daylight as the two Freighters drift ever closer to one another.\n\n\tIndy's Speedboat just manages to squeeze through the gap. But the Enemy\n\tSpeedboat EXPLODES as it is crushed between the two Freighters, FLYING INTO\n\tTHE AIR and SPLASHING back down into the water.\n\n<b>\tINDY AND ELSA\n</b>\n\tspin their boat around in a sharp half-circle to see KAZIM'S SPEEDBOAT appear\n\tracing toward them. He stands in the moving boat, FIRING A MACHINE GUN at\n\tINDY and ELSA.\n\n\n<b>\tKAZIM'S SPEEDBOAT\n</b><b>\t\n</b>\tmatches Indy's move for move.\n\n<b>\tFULL SHOT - THE HARBOR\n</b>\n\tThe two boats race across the water nearly side-by-side. A CHATTERING\n\tMACHINE GUN from Kazim's boat SPLINTERS the wood of Indy's boat, until\n\tfinally the rear of the boat CATCHES ON FIRE.\n\n\tThe machine gun runs out of ammunition. KAZIM puts it down and takes control\n\tof the wheel from one of the Turkish Agents in the boat with him.\n\n\tAs Indy's boat drifts toward the GIANT, TURNING PROPELLERS at the STERN of\n\tANOTHER STEAMER, Kazim's boat draws up alongside and hits them. INDY\n\tsteps into Kazim's boat. He knocks one of the Turkish Agents to the deck, then\n\tturns his attention to KAZIM. The two men trade punches as the boat spins\n\thelplessly in the churning water.\n\n<b>\t\t\tELSA\n</b>\t\tNo!!\n\n\tINDY kicks KAZIM in the face, knocking him into the water, then pulls him back\n\tinto the boat, now being SUCKED THROUGH THE CHURNING WATER toward the\n\tSteamer's giant propeller blades.\n\n<b>\t\t               INDY\n</b>\t\tWhy are you trying to kill us?\n\n<b>\t\t               KAZIM\n</b>\t\tBecause you're looking for the\n\t\tHoly Grail.\n\n<b>\t\t               INDY\n</b>\t\tMy father was looking for the\n\t\tHoly Grail. Did you kill him\n\t\ttoo?\n\n<b>\t\t\tKAZIM\n</b>\t\tNo.\n\n<b>\t\t               INDY\n</b>\t\tWhere is he? Talk\u0097or you're\n\t\tdead. Damn it, tell me! Tell\n\t\tme!\n\n<b>\t\t\tKAZIM\n</b>\t\tIf you don't let go, Doctor Jones,\n\t\twe'll both die.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               INDY\n</b>\t\tThen we'll die.\n\n<b>\t\t               KAZIM\n</b>\t\tMy soul is prepared. How's yours?\n\n\tBy now half the boat has been chopped up into matchwood and the blades are\n\tgetting closer.\n\n<b>\t\t               INDY\n</b>\t\tThis is your last chance.\n\n<b>\t\t               KAZIM\n</b>\t\tNo, Doctor Jones. It's yours!\n\n\tThe wind of the blades is on their necks. INDY grabs KAZIM just in time and\n\tjumps... into the motorboat, driven by ELSA, which gets alongside in the nick of\n\ttime.\n\n<b>\t\t\tINDY\n</b>\t\tAll right! Where's my father\n\n<b>\t\t               KAZIM\n</b>\t\tIf you let me go, I will tell you\n\t\twhere he is.\n\n<b>\t\t               INDY\n</b>\t\tWho are you?\n\n<b>\t\t               KAZIM\n</b>\t\tMy name is Kazim.\n\n<b>\t\t               INDY\n</b>\t\tAnd why were you trying to kill\n\t\tme?\n\n<b>\t\t               KAZIM\n</b>\t\tThe secret of the Grail has been\n\t\tsafe for a thousand years. And\n\t\tfor all that time the Brotherhood\n\t\tof the Cruciform Sword has been\n\t\tprepared to do anything to keep\n\t\tit safe.\n\n\tKAZIM pulls back his shirt to reveal a birthmark... or is it a tattoo? Whatever it\n\tis, it's a cruciform sword; a Christian cross which tapers down, like the blades of\n\ta broadsword.\n\n<b>\t\t               KAZIM\n</b>\t\tLet me get off at this jetty.\n\n\tThe boat is close to the edge of the canal. INDY gives ELSA a nod, telling her to\n\tbring the boat in. KAZIM steps ashore.\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               KAZIM\n</b>\t\tAsk yourself, why do you seek\n\t\tthe Cup of Christ? Is it for His\n\t\tglory, or for yours?\n\n<b>\t\t               INDY\n</b>\t\tI didn't come for the Cup of\n\t\tChrist. I came to find my father.\n\n<b>\t\t               KAZIM\n</b>\t\tIn that case, God be with you in\n\t\tyour quest. Your father is being\n\t\theld in the Castle of Brunwald on\n\t\tthe Austrian-German border.\n\n\tKAZIM walks away.\n\n<b>\tINT. VENICE APARTMENT - DAY\n</b>\n\tCLOSE ON THE WATER-SOAKED PAPER IMPRESSION: The rubbing taken from\n\tthe shield of the Grail Knight.\n\n\tBRODY is giving it careful study while he dabs the lump on the back of his head\n\twith an ice pack.\n\n<b>\t\t               INDY\n</b>\t\tHow's the head?\n\n<b>\t\t\tBRODY\n</b>\t\tIt's better, now I've seen this.\n\t\tIt's the name of a city.\n\t\t\"Alexandretta?\" Hmmm...\n\n\tINDY, wearing a bathrobe, leans over to study the impression.\n\n<b>\t\t               INDY\n</b>\t\tThe Knights of the First Crusade\n\t\tlaid siege to the city of\n\t\tAlexandretta for over a year.\n\t\tThe entire city was destroyed.\n\n\tBRODY lowers the ice pack from his head and looks at INDY.\n\n<b>\t\t               INDY\n</b>\t\tThe present city of Iskenderun\n\t\tis built on its ruins. Marcus\u0097\n\t\tyou remember what the Grail\n\t\tTablet said. \"Across the desert\n\t\tand through the mountain to the\n\t\tCanyon of the Crescent Moon.\"\n\t\t       (pause)\n\t\tBut where exactly?\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               BRODY\n</b>\t\tYour father would know. Your\n\t\tfather did know. Look. He\n\t\tmade a map.\n\n\tBRODY picks up the Grail Diary.\n\n<b>\t\t               BRODY\n</b>\t\tHe must have pieced it together\n\t\tfrom clues scattered through the\n\t\twhole history of the Grail Quest.\n\t\tA map with no names.\n\n\n<b>\tINSERT: A PENCIL-DRAWN MAP\n</b>\n\tIt covers two pages of the Diary. BRODY's finger moves across it.\n\n<b>\t\t               BRODY\n</b>\t\tNow, he knew there was a city\n\t\twith an oasis due east. Here.\n\t\tHe knew the course turned south\n\t\tthrough the desert to a river, and\n\t\tthe river led into the mountains.\n\t\tHere. Straight to the canyon.\n\t\tHe knew everything except where\n\t\tto begin, the name of the city.\n\n<b>\t\t\tINDY\n</b>\t\t      (solemnly)\n\t\tAlexandretta. Now we know.\n\n<b>\t\t               BRODY\n</b>\t\tYes. Now we know.\n\n<b>\t\t\tINDY\n</b>\t\t      (rising)\n\t\tMarcus, get hold of Sallah. Tell\n\t\thim to meet you in Iskenderun.\n\n\tINDY closes the Grail Diary and puts it into the pocket of his robe.\n\n<b>\t\t               BRODY\n</b>\t\tWhat about you?\n\n<b>\t\t               INDY\n</b>\t\tI'm going after Dad.\n\n\n<b>\tINT. INDY'S BEDROOM - DAY\n</b>\n\tINDY opens the door. His bedroom has been ransacked...the mattress on the\n\tfloor, the drawers turned out.\n\n<b>\tINT. HALLWAY - DAY\n</b>\n\tINDY approaches another door (Elsa's bedroom) and knocks.\n\n<b>\t\t               INDY\n</b>\t\tElsa?\n\n\tHe goes in.\n\n\n<b>\tINT. ELSA'S BEDROOM - DAY\n</b>\n\t... and finds that Elsa's bedroom is in a similar ransacked state to his own. The\n\troom is empty.\n\n\tHe is worried for her, knocks and calls out:\n\n<b>\t\t               INDY\n</b>\t\tElsa?\n\n\tHe steps into the room and knocks upon the bathroom door.\n<b>\t\n</b><b>\t\t               INDY\n</b>\t\tElsa?\n\n\tHe opens the bathroom door, peering inside.\n\n<b>\t\t               INDY\n</b>\t\tElsa?\n\n\n<b>\tINT. ELSA'S BATHROOM - DAY\n</b><b>\t\n</b>\tElsa is standing before a mirror, wearing a silk bathrobe. She gasps, startled, as\n\tINDY enters. He retreats back into her bedroom as she reaches up to turn off a\n\trecord player sitting on a ledge above the bathtub.\n\n\n<b>\tINT. ELSA'S BEDROOM - DAY\n</b>\n\tELSA joins INDY, waiting in the ransacked room. she looks around in shock.\n\n<b>\t                                       ELSA\n</b>                                    \tMy room!\n\n<b>\t\t\tINDY\t\t\n</b>\t\tMine, too.\n\n<b>\t\t\tELSA\n</b>\t\tWhat were they looking for?\n\n\tShe looks to INDY, who pulls the Grail Diary from his pocket.\n\n<b>\t\t\tINDY\n</b>\t\tThis.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               ELSA\n</b>\t\tThe Grail Diary.\n\n<b>\t\t               INDY\n</b>\t\tUh-huh.\n\n<b>\t\t               ELSA\n</b>\t\tYou had it? You didn't trust\n\t\tme!\n\n\tShe looks hurt and beautiful. She comes closer to him.\n\n<b>\t\t               INDY\n</b>\t\tI didn't know you.\n\n\tShe's awfully hard to resist.\n\n<b>\t\t               INDY\n</b>\t\tAt least I let you tag along.\n\n<b>\t\t               ELSA\n</b>\t\tOh, yes. Give them a flower and\n\t\tthey'll follow you anywhere.\n\n<b>\t\t               INDY\n</b>\t\tKnock it off. You're not mad.\n\n<b>\t\t\tELSA\n</b>\t\tNo?\n\n<b>\t\t                INDY\n</b>\t\tNo. You like the way I do things.\n\n<b>\t\t               ELSA\n</b>\t\tIt's lucky I don't do things the\n\t\tsame way. You'd still be standing\n\t\tat the Venice pier.\n\n\tShe stomps her foot angrily. INDY flinches. She starts to walk away but Indy\n\tgrabs her.\n\n<b>\t\t               INDY\n</b>\t\tLook, what do you think is going\n\t\ton here? Since I've met you,\n\t\tI've nearly been incinerated,\n\t\tdrowned, shot at, and chopped into\n\t\tfish bait. We're caught in the\n\t\tmiddle of something sinister here.\n\t\tMy guess is Dad found out more\n\t\tthan he was looking for. And\n\t\tuntil I'm sure, I'm going to\n\t\tcontinue to do things the way I\n\t\tthink they should be done.\n\n\n<b>CONTINUED: (2)\n</b>\n\tHe pulls her to him and kisses her.\n\n<b>\t\t                ELSA\n</b>\t\tHow dare you kiss me!\n\n\tNow ELSA reaches for INDY and kisses him.\n\n<b>\t\t                INDY\n</b>\t\tLeave me alone. I don't like\n\t\tfast women.\n\n\tBut he embraces her, and ELSA begins to nibble at his ear.\n\n<b>\t\t                ELSA\n</b>\t\tAnd I hate arrogant men.\n\n\tINDY smiles slyly as they fall to the bed.\n\n\n<b>\tEXT. VENICE CANAL - DAY\n</b>\n\tA GONDOLIER SINGS as he steers his gondola carrying two passengers past\n\tIndy's window.\n\n\n<b>\tINT. INDY'S BEDROOM - DAY\n</b>\n\tINDY lies on top of ELSA, kissing her. He stops for a moment as he hears the\n<b>\tGONDOLIER SINGING.\n</b>\n<b>\t\t                INDY\n</b>\t\tAhh, Venice.\n\n\tELSA reaches up and pulls him back down to her.\n\n\n<b>\tEXT. ROAD THROUGH THE AUSTRIAN MOUNTAINS - DAY\n</b>\n\tA Mercedes-Benz glides through the sharp mountain curves. This is\n\tSUPERIMPOSED OVER A MAP that charts their course from Venice across Austria\n\ttoward Salzburg.\n\n\n<b>\tEXT. CASTLE IN THE AUSTRIAN MOUNTAINS - DAY\n</b>\n\tStorm clouds darken the skies. THUNDER EXPLODES in the\n\tdistance; lightning flashes. The Mercedes-Benz drives into the courtyard of the\n\tformidable stone castle.\n\n<b>\t\t                INDY\n</b>\t\tWhat do you know about this\n\t\tplace?\n\n<b>\t\t                ELSA\n</b>\t\tI know the Brunwalds are famous\n\t\tart collectors.\n\n<b>\tINT. MERCEDES-BENZ - DAY\n</b>\n\tINDY reaches into the back seat and retrieves his bullwhip.\n\n<b>\t\t\tELSA\n</b>\t\tWhat are you going to do?\n\n<b>\t\t\tINDY\n</b>\t\tDon't know. Think of something.\n\n\tHe glances up to the beret ELSA is wearing. She reaches up and adjusts it.\n\n\n<b>\tINT. CASTLE ENTRANCE HALL - DAY\n</b>\n\tA BUTLER walks to the door and opens it to reveal INDY and ELSA standing\n\toutside in the rain. she now wears Indy's fedora; Indy is wearing Elsa's beret.\n\n<b>\t\t\tBUTLER\n</b>\t\tYes?\n\n\tINDY, followed by ELSA, steps inside, shaking the water from his overcoat. He\n\tadopts a Scottish accent.\n\n<b>\t\t               INDY\n</b>\t\tAnd not before time! Did you\n\t\tintend to leave us standing on\n\t\tthe doorstep all day? We're\n\t\tdrenched!\n\n\tAs INDY says this he pushes his way past the startled BUTLER, pulling a\n\thandkerchief from the man's pocket. ELSA follows, taking off her coat. INDY\n<b>\tSNEEZES HARD.\n</b>\n<b>\t\t               INDY\n</b>\t\tNow look! I've gone and caught\n\t\ta sniffle.\n\n\tINDY dabs at his nose with the handkerchief as ELSA looks on in amused\n\tamazement.\n\n<b>\t\t\tBUTLER\n</b>\t\t      (coldly; with\n\t\t       Austrian accent)\n\t\tAre you expected?\n\n<b>\t\t               INDY\n</b>\t\tDon't take that tone with me, my\n\t\tgood man. Now buttle off and tell\n\t\tBaron Brunwald that Lord Clarence\n\t\tMacDonald and his lovely assistant\n\t\tare here to view the tapestries.\n\n\n<b>\t\t\t\t                                       (CONT'D)\n</b>\n<b>CONTINUED:\n</b><b>\t\t\tBUTLER\n</b>\t\tTapestries?\n\n<b>\t\t               INDY\n</b>\t\tDear me, the man is dense. This\n\t\tis a castle, isn't it? There are\n\t\ttapestries?\n\n<b>\t\t               BUTLER\n</b>\t\tThis is a castle. And we have\n\t\tmany tapestries. But if you're a\n\t\tScottish lord, then I am Mickey\n\t\tMouse.\n\n<b>\t\t               INDY\n</b>\t\tHow dare he?!\n\n\tSimultaneously knocking the BUTLER cold with one slug on the jaw. The Butler\n\tfalls against a wall tapestry, sliding down to the floor, out cold.\n\n\n<b>\tINT. CASTLE HALLWAY - DAY\n</b>\n\tINDY and ELSA move cautiously and quietly down the wide, vaulted hallway.\n\tAPPROACHING VOICES ARE HEARD. Indy and Elsa creep past a room full of\n\tNAZI SOLDIERS working around a large table with a map atop it..\n\n\tINDY reacts to the sight of them.\n\n<b>\t\t\tINDY\n</b>\t\t        (to ELSA; softly)\n\t\tNazis. I hate these guys.\n\n\tINDY and ELSA continue down the hallway. Indy carries a gun in his hand and\n\this whip hangs from his belt. He steps to a closed door and listens.\n\n<b> \t\t              INDY\n</b>\t\tThis one. I think he's in here.\n\n<b>\t\t\tELSA\n</b>\t\tHow do you know?\n\n\tINDY points out an ELECTRICAL WIRE.\n\n<b>\t\t               INDY\n</b>\t\tBecause it's wired.\n\n\tHe studies the situation for a moment, then decides to enter one of the other\n\tdoors. He knocks at the door\u0097there is no response. He looks back at ELSA and\n\tenters.\n\n<b>INT. CASTLE ROOM - DAY\n</b>\n\tThe room is dark and empty. INDY throws open the window shutters and looks\n\tout. RAIN comes down in sheets. There is a wide ledge beneath each window\u0097\n\tbut below that is a SHEER DROP. Indy wants to get out onto the window ledge,\n\twhich is several yards away.\n\n<b>\t\t\tELSA\n</b>\t\tIndy? Indy?\n\n\tINDY reassures her.\n\n\n<b>\t\t               INDY\n</b>\t\tDon't worry... this is kid's play.\n\t\tI'll be right back.\n\n\tHe leans out the window and wraps his bullwhip around some wires that protrude\n\tfrom the castle wall above the next window.\n\n\tHe gives the whip a forceful tug to make certain it will hold his weight.\n\n\n<b>\tEXT. THE CASTLE - DAY\n</b>\n\tINDY SWINGS from the window to the stone gargoyle.\n\n<b>\tCLOSE ON THE WINDOW LEDGE\n</b>\n\tA PAIR OF WOODEN SHUTTERS seals the window.\n\n\tINDY takes hold of the bullwhip with both hands, pushes off with his feet...\n\tswings toward the shuttered window with his feet extended... CRASHING\n\tTHROUGH THE WOODEN SHUTTERS as a CLAP OF THUNDER disguises the noise.\n\n\n<b>\tINT. THE ROOM - DAY\n</b>\n\tINDY CRASHES THROUGH SHUTTERS AND GLASS into the room. The broken\n\tshutters hang by their hinges. Rain and cold air whip through the open window.\n\n\tNo sooner does Indy get to his feet, than a VASE COMES CRASHING DOWN ON\n<b>\tTHE BACK OF HIS HEAD.\n</b>\n\tStunned, INDY sinks to one knee... and Indy's father, PROFESSOR HENRY JONES,\n\tsteps out of the shadows.\n\n<b>\t\t\tHENRY\n</b>\t\tJunior?\n\n\tINDY gets to his feet.\n\n<b>\t\t\tINDY\n</b>\t\t      (a reflex)\n\t\tYes, sirl\n\n<b>CONTINUED:\n</b>\n\tThis reply is a kneejerk reaction on Indy's part. Now they look at each other.\n\n<b>\t\t\tHENRY\n</b>\t\tIt is you Junior!\n\n<b>\t\t\tINDY\n</b>\t\t     (an old familiar\n\t\t      irritation)\n\t\tDon't call me that, please.\n\n<b>\t\t\tHENRY\n</b>\t\t     (amazed)\n\t\tBut what are you doing here?\n\n<b>\t\t\tINDY\n</b>\t\tI came to get you! What do you\n\t\tthink? \n\n\tNAZI VOICES ARE HEARD approaching. INDY and HENRY press themselves\n\tagainst the wall, Henry still holding the broken vase in his hand.\n\n\tINDY steps to the window and looks down. HENRY moves to a lamp, holding the\n\tvase under the light for a closer look.\n\n<b>\t\t\tHENRY\n</b>\t\t       (sotto, mumbled)\n\t\tLate Fourteenth Century, Ming\n\t\tDynasty.\n\n\tHENRY is all about the broken vase which he still holds in his hand. Father and\n\tson get onto crossed lines for a couple of moments.\n\n<b>\t\t\tHENRY\n</b>\t\tOh, it breaks the heart.\n\n<b>\t\t                 INDY\n</b>\t\t    (quietly to himself)\n\t\tAnd the head.\n\t\t    (to HENRY, aggrievedly)\n\t\tYou hit me, Dad!\n\n<b>\t\t\tHENRY\n</b>\t\t     (referring to the\n\t\t      vase)\n\t\tI'll never forgive myself\u0097\n\n<b>\t\t\tINDY\n</b>\t\t       (surprised,\n\t\t        misunderstanding)\n\t\tDon't worry\u0097I'm fine.\n\n<b>\t\t\tHENRY\n</b>\t\tThank God!\n\n\n<b>CONTINUED: (2)\n</b>\n\tHENRY has clearly been concentrating entirely on the vase... he is examining the\n\tbroken end carefully.\n\n<b>\t\t               HENRY\n</b>\t\t... it's fake. See, you can tell\n\t\tby the cross section.\n\n\tHENRY throws the vase against the wall where it SHATTERS.\n\n<b>\t\t               INDY\n</b>\t\tNo! Dad, get your stuff. We've\n\t\tgot to get out of here.\n\n<b>\t\t               HENRY\n</b>\t\tWell, I am sorry about your head,\n\t\tthough. But I thought you were\n\t\tone of them.\n\n<b>\t\t               INDY\n</b>\t\tDad, they come in through the\n\t\tdoors.\n\n<b>\t\t\tHENRY\n</b>\t\t      (laughs)\n\t\tGood point.\n\n\tINDY steps to the door and stands, listening.\n\n<b>\t\t\tHENRY\n</b>\t\tBut better safe than sorry.\n\n\tHENRY slides his umbrella through the straps of his bag.\n\n<b>\t\t               HENRY\n</b>\t\tHumpf\u0097so I was wrong this time.\n\t\tBut by God, I wasn't wrong when I\n\t\tmailed you my Diary. You obviously\n\t\tgot it.\n\n<b>\t\t               INDY\n</b>\t\tI got it and I used it. We found\n\t\tthe entrance to the catacombs.\n\n<b>\t\t\tHENRY\n</b>\t\t     (excited)\n\t\tThrough the library?\n\n<b>\t\t               INDY\n</b>\t\tRight.\n\n<b>\t\t               HENRY\n</b>\t\tI knew it. And the tomb of Sir\n\t\tRichard?\n\n\n<b>CONTINUED: (3)\n</b>\n\tINDY nods.\n\n<b>\t\t               INDY\n</b>\t\tFound it.\n\n<b>\t\t\tHENRY\n</b>\t\t     (breathless)\n\t\tHe was actually there? You saw\n\t\thim?\n\n\n<b>\t\t               INDY\n</b>\t\tWell, what was left of him.\n\n<b>\t\t\tHENRY\n</b>\t\t      (trembling with\n\t\t       anticipation)\n\t\tAnd his shield... the inscription\n\t\ton Sir Richard's shield...?\n\n<b>\t\t               INDY\n</b>\t\tAlexandretta.\n\t\t    (beat)\n\n\tIt's a great moment in HENRY's life. He turns aside, lost to himself for a\n\tmoment, then turns to INDY with joy.\n\n<b>\t\t               HENRY\n</b>\t\tAlexandretta... of course... on\n\t\tthe pilgrim trail from the Eastern\n\t\tEmpire. Oh, Junior...\n\n\tINDY winces, and would interrupt but suddenly it's not the moment.\n\n<b>\t\t\tHENRY\n</b>\t\t... you did it.\n\n\n<b>\t\t               INDY\n</b>\t\tNo, Dad. You did. Forty years.\n\n<b>\t\t               HENRY\n</b>\t\tIf only I could have been with\n\t\tyou.\n\n<b>\t\t\tINDY\n</b>\t\tThere were rats, Dad.\n\n<b>\t\t\tHENRY\n</b>\t\tRats?\n\n<b>\t\t\tINDY\n</b>\t\tYeah. big ones. What do the\n\t\tNazis want with you Dad?\n\n<b>\t\t\tHENRY\n</b>\t\tThey want my diary.\n\n\n<b>CONTINUED: (4)\n</b>\n<b>\t\t\tINDY\n</b>\t\t     (interested)\n\t\tYeah?\n\n\tINDY's interest is a moment which becomes important later but for now it passes.\n\n<b>\t\t               HENRY\n</b>\t\tI knew I had to get that book as\n\t\tfar away from me as I possibly\n\t\tcould.\n\n\tINDY's hand moves unconsciously to his pocket. His eyes turn inward.\n\n<b>\t                                      INDY\n</b>\t\t      (thoughtfully)\n\t\tYeah. . .\n\n\tThen... BAMI The door is kicked open and three NAZIS enter. One is an S.S.\n\tOFFICER. The other two are SOLDIERS with machine guns. HENRY and INDY\n\traise their hands.\n\n<b>\t\t\tS.S. OFFICER\n</b>\t\tDoctor Jones!!\n\n<b>\t\t\tHENRY &amp; INDY\n</b>\t\tYes!!\n\n\n<b>\t\t               S.S. OFFICER\n</b>\t\tI will take the book now.\n\n<b>\t\t\tINDY/HENRY\n</b>\t\t      (simultaneously)\n\t\tWhat book?\n\n<b>\t\t\tS.S. OFFICER\n</b>\t\t     (to INDY)\n\t\tYou have the Diary in your pocket.\n\n\tHENRY laughs genuinely, believing himself to be laughing at the expense of the\n<b>\tS.S. OFFICER.\n</b>\n<b>\t\t               HENRY\n</b>\t\tYou doltl Do you think that my\n\t\tson would be that stupid that\n\t\the would bring my Diary all the\n\t\tway back here?\n\n\tAt which point an awful thought strikes HENRY.\n\n<b>\t\t               HENRY\n</b>\t\tYou didn't, did you?\n\t\t    (a beat)\n\t\tYou didn't bring it, did you?\n\n\n<b>CONTINUED: (5)\n</b>\n<b>\t\t\tINDY\n</b>\t\tWell, uh...\n\n<b>\t\t\tHENRY\n</b>\t\tYou did!!\n\n\n<b>\t\t\tINDY\n</b>\t\tLook, can we discuss this later?\n\n<b>\t\t\tHENRY\n</b>\t\tI should have mailed it to the\n\t\tMarx Brothers.\n\n<b>\t\t\tINDY\n</b>\t\t       (overlapping)\n\t\tWill you take it easy....!\n\n<b>\t\t\tHENRY\n</b>\t\tTake it easy?! Why do you think\n\t\tI sent it home in the first place?\n\t\t        (points towards\n\t\t        the NAZIS)\n\t\tSo it wouldn't fall into their\n\t\thands!!\n\n<b>\t\t\tINDY\n</b>\t\tI came here to save you.\n\n<b>\t\t\tHENRY\n</b>\t\tOh yeah? And who's gonna come to\n\t\tsave you, Junior??\n\n\tINDY's eyes blazes His nostrils flares He's so pissed off, he literally RIPS A\n\tMACHINE GUN from the hands of one of the startled soldiers... and for a moment\n\twe think he's going to use it on his dad.\n\n<b>\t\t\tINDY\n</b>\t\tI told you--\n\n\tHe turns and sprays the room with machine gun fire, cutting all three NAZIS to\n\tribbons and blowing them backwards across the room.\n\n<b>\t\t\tINDY\n</b>\t\t--don't call me Junior!\n\n\tHENRY looks shocked and horrified.\n\n<b>\t\t\tHENRY\n</b>\t\tLook what you did!!\n\n\tIndy grabs him and pushes him ahead.\n\n<b>\t\t\tHENRY\n</b>\t\t     (aghast)\n\t\tI can't believe what you just....\n\n<b>\tINT. CASTLE HALLWAY - DAY\n</b>\n\tINDY leads HENRY down the hallway as he searches for Elsa.\n\n<b>\t\t\tINDY\n</b>\t\tElsa? Elsa?\n\n\tHe opens a door and enters:\n\n<b>\tINT. FIRST CASTLE ROOM - DAY\n</b>\n\n\tINDY and HENRY rush back into the room where ELSA had been left, only to\n\tfind: A Nazi COLONEL HOLDING ELSA HOSTAGE.\n\n\tHis name is VOGEL: a vicious-looking, lantern jawed brute. One arm is wrapped\n\taround Elsa's waist, the other hand presses the muzzle of a LUGER behind her\n\tear.\n\n<b>\t\t               VOGEL\n</b>\t\tThat's far enough Put down the\n\t\tgun, Doctor Jones. Put down the\n\t\tgun or the Fraulein dies.\n\n<b>\t\t               HENRY\n</b>\t\tBut she's one of them!\n\n<b>\t\t\tELSA\n</b>\t\tIndy, please!\n\n<b>\t\t\tHENRY\n</b>\t\tShe's a Nazi!\n\n<b>\t\t\tINDY\n</b>\t\tWhat?!\n\n\tINDY  is thrown. He doesn't know what to do. He looks at ELSA, then back to his\n\tfather. Everyone is yelling at once:\n\n<b>\t\t\tHENRY\n</b>\t\tTrust me!\n\n\n<b>\t\t               ELSA\n</b>\t\tIndy, no!\n\n<b>\t\t               VOGEL\n</b>\t\tI will kill her!\n\n<b>\t\t               HENRY\n</b>\t\tOh yeah? Go ahead!\n\n<b>\t\t               INDY\n</b>\t\tNo! Don't Shoot!\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tHENRY\n</b>\t\t        (to Indy)\n\t\tDon't worry. He won't.\n\n<b>\t\t\tELSA\n</b>\t\tIndy, please! Do what he says!\n\n<b>\t\t\tHENRY\n</b>\t\tAnd don't listen to her!\n\n<b>\t\t\tVOGEL\n</b>\t\tEnough! She diesl\n\n\tVOGEL jams the barrel of the luger painfully into ELSA's neck. Elsa SCREAMS.\n\n<b>\t\t\tINDY\n</b>\t\tWait!  Waitl\n\n\tAnd then Indy gives in. He drops the machine gun to the table and it slides\n\tacross, SHATTERING GLASS. HENRY GROANS audibly.\n\n\tVOGEL releases his grip on ELSA and shoves her toward INDY. She is propelled\n\tdirectly into his arms. He holds her tightly. She buries her face in his chest.\n\n<b>\t                                     ELSA\n</b>\t\tI'm sorry.\n\n\tINDY comforts her.\n\n<b>\t                                     INDY\n</b>\t\tNo, don't be.\n\n\tHer hand slips into his coat pocket and removes the Grail Diary.\n\n<b>\t                                     ELSA\n</b>\t\tBut you should have listened to\n\t\tyour father.\n\n\tShe steps back next to VOGEL. INDY is stunned. HENRY gives him his most\n\twithering look of reprimand.\n\n\n<b>\tINT. BARONIAL ROOM - DAY\n</b>\n\tA large baronial room decorated with ancient tapestries and suits of armor.\n\tFirelight\u0097from the giant fireplace\u0097dances across the ceiling and walls.\n\n\tINDY and HENRY are ushered in, hands tied behind back, accompanied by VOGEL\n\tand ELSA and TWO NAZI GUARDS.\n\n\tELSA crosses the room toward a high-backed chair facing the fireplace. INDY and\n\tHENRY do not have the advantage of seeing who is sitting in that chair. They\n\tonly see a HAND REACH OUT AND TAKE THE BOOK.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tINDY\n</b>\t\t        (quietly to HENRY)\n\t\tShe ransacked her own room and I\n\t\tfell for it. How did you know\n\t\tshe was a Nazi?\n\n<b>\t\t               HENRY\n</b>\t\tUmh?\n\n<b>\t\t               INDY\n</b>\t\tHow did you she was a Nazi?\n\n<b>\t\t               HENRY\n</b>\t\tShe talks in her sleep.\n\n\tINDY nods, and then the statement catches up with him. He looks at HENRY\n\twith surprise.\n\n<b>\t\t               HENRY\n</b>\t\tI didn't trust her. Why did\n\t\tyou?\n\n<b>\t\t               MAN IN CHAIR\n</b>\t\tBecause he didn't take my advice.\n\n\tThe MAN IN THE CHAIR gets to his feet and turns, revealing himself to be...\n\tWALTER DONOVAN. INDY and HENRY react with stunned expressions.\n\n<b>\t\t               INDY\n</b>\t\tDonovan\n<b>\t\n</b><b>\t\t               DONOVAN\n</b>\t\tDidn't I warn you not to trust\n\t\tanybody, Doctor Jones?\n\n\tDONOVAN smiles benignly and flips through the Grail Diary.\n\n<b>\t\t               HENRY\n</b>\t\tI misjudged you Walter\u0097I knew\n\t\tyou'd sell your mother for an\n\t\tEtruscan vase.\n\t\tBut I didn't know you'd sell your\n\t\tcountry and your soul to the slime\n\t\tof humanity.\n\n<b>\t\t               DONOVAN\n</b>\t\t        (suddenly erupting)\n\t\tDoctor Schneider There're pages\n\t\ttorn out of thisl\n\n\tELSA rushes to DONOVAN's side. she takes the Grail Diary from him. Elsa takes\n\ta look for herself\u0097then glances up at Indy.\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               ELSA\n</b>\t\tThis book contained a map\u0097a\n\t\tmap with no names\u0097precise\n\t\tdirections from the unknown city\n\t\tto the secret Canyon of the\n\t\tCrescent Moon.\n\n<b>\t\t\tINDY\n</b>\t\tSo it did.\n\n\n<b>\t\t               DONOVAN\n</b>\t\tWhere are these missing pages?\n\t\tThis maps we must have these\n\t\tpages backs\n\n\tHENRY gives INDY a look of surprise. Indy smirks.\n\n<b>\t\t\tELSA\n</b>\t\t        (to Donovan)\n\t\tYou're wasting your breath. He\n\t\twon't tell us. And he doesn't\n\t\thave to... it's perfectly obvious\n\t\twhere the pages are...\n\t\t        (looking at Indy)\n\t\t... he's given them to Marcus\n\t\tBrody.\n\n\tHENRY now wears a pained expression.\n\n<b>\t\t\tHENRY\n</b>\t\t        (to Indy)\n\t\tMarcus?! You didn't drag poor\n\t\tMarcus along, did you? He's not\n\t\tup to the challenge.\n\n<b>\t\t               DONOVAN\n</b>\t\tHe sticks out like a sore thumb.\n\t\tWe'll find him.\n\n<b>\t\t               INDY\n</b>\t\tThe hell you will. He's got a\n\t\ttwo-day head-start on you, which\n\t\tis more than he needs.\n\t\t        (beat)\n\t\tBrody's got friends in every town\n\t\tand village from here to the Sudan.\n\t\tHe speaks a dozen languages, knows\n\t\tevery local custom. He'll blend\n\t\tin. Disappear. You'll never see\n\t\thim again. With any luck, he's\n\t\tgot the Grail already.\n\n\tHENRY looks amazed and impressed.\n\n<b>\tEXT. TRAIN STATION - CITY OF ISKENDERUN - DAY\n</b>\n\tBRODY disembarks from the train along with the other PASSENGERS, a cross-\n\tsection of ARABS and TUSKS.\n\n<b>\t\t               BRODY\n</b>\t\tDoes anyone here speak English?\n\t\tOr even ancient Greek?\n\n\tA Man in the crowd holds out a cup of water to BRODY.\n\n<b>\t\t               BRODY\n</b>\t\tNo water, no thank you. No, fish\n\t\tmake love in it.\n\n\tBRODY continues through the crowd past various STREET VENDORS. A Woman\n\tholds a chicken out to him.\n\n<b>\t\t               BRODY\n</b>\t\tThank you so much. No, I don't\n\t\tlike that. No, I really don't\n\t\twant... No, no, thank you very\n\t\tmuch. No, thank you, madam.\n\t\tI'm a vegetarian.\n\n\n\tThe Woman walks away, leaving BRODY alone in the crowd.\n\n<b>\t\t               BRODY\n</b>\t\tDoes anyone understand a word I'm\n\t\tsaying here?\n\n\tSALLAH shoulders his way through the mob toward BRODY.\n\n<b>\t\t\tSALLAH\n</b>\t\tMister Brodyl\n\n\tThey meet and hug, then begin to walk.\n\n<b>\t\t\tBRODY\n</b>\t\tOh, Sallahl What a relief!\n\n<b>\t\t\tSALLAH\n</b>\t\t     (laughs)\n\t\tMarcus Brody, sir. And where is\n\t\tIndy?\n\n<b>\t\t\tBRODY\n</b>\t\t     (overlapping)\n\t\tOh, he's in Austria. A slight\n\t\tdetour.\n\n<b>\t\t               SALLAH\n</b>\t\tYou are on your own?\n\n\tA Woman runs in and tugs on BRODY's coat. He waves her away.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               BRODY\n</b>\t\tYes, but don't panic. Everything's\n\t\tunder control. Have you. . .have\n\t\tyou arranged our supplies?\n\n<b>\t\t               SALLAH\n</b>\t\tOh, yes, of course. But where\n\t\tare we going?\n\n<b>\t\t               BRODY\n</b>\t\tOh, this map will show you. It\n\t\twas drawn by, uh...\n\n\tBRODY searches in his coat pocket for the map as a SINISTER MAN approaches.\n\n<b>\t\t\tSINISTER MAN\n</b>\t\tMister Brody?\n\n\tBRODY puts the map back in his pocket. The SINISTER MAN clicks his heels and\n\tbows quickly.\n\n<b>\t\t               SINISTER MAN\n</b>\t\tWelcome to Iskenderun. The\n\t\tDirector of the Museum of\n\t\tAntiquities has sent a car for\n\t\tyou.\n\n\tBRODY takes off his hat.\n\n<b>\t\t               BRODY\n</b>\t\tOh, what?... your servant, sir.\n\n<b>\t\t\tSALLAH\n</b>\t\tAnd I am his.\n\n\n<b>\t\t\tSINISTER MAN\n</b>\t\tFollow me, please.\n\n\tThe man turns and joins a SECOND MAN. BRODY and SALLAH follow them.\n\n<b>\t\t               BRODY\n</b>\t\tMy reputation precedes me.\n\n<b>\t\t\tSALLAH\n</b>\t\tThere is no museum in Iskenderun.\n\n\tThe SECOND MAN overhears SALLAH. He and his companion turn quickly.\n\n<b>\t\t\tSECOND MAN\n</b>\t\tPapers please.\n\n<b>\t\t               SALLAH\n</b>\t\tPapers?\n\t\t     (laughs)\n\t\tOf course.\n\n\n<b>CONTINUED: (2)\n</b>\n\tSALLAH puts Brody's luggage down and glances at BRODY.\n\n<b>\t\t\tSALLAH\n</b>\t\tRun.\n\n\n\tBRODY does not run. SALLAH pats his clothing, searching for his papers.\n\n<b>\t\t\tBRODY\n</b>\t\tYes.\n\n<b>\t\t\tSALLAH\n</b>\t\tPapers, sir. Got it here.\n\n\tSALLAH laughs and pulls out a newspaper.\n\n<b>\t\t\tSALLAH\n</b>\t\tJust finished reading it myself.\n\t\t         (laughs; then, to\n\t\t          Brody)\n\t\tRun!\n\n\tBRODY looks confused. SALLAH shows the newspaper to the SECOND MAN.\n\n<b>\t\t\tBRODY\n</b>\t\tYes.\n\n\n<b>\t\t              SALLAH\n</b>\t\tEgyptian Mail. Morning edition.\n\t\t     (to Brody)\n\t\tRun!\n\n<b>\t\t              BRODY\n</b>\t\tDid you say...? Uh, uh...\n\n\tSALLAH puts the newspaper in front of the SECOND MAN's face, then punches\n\thim through the newspaper.\n\n<b>\t\t\tSALLAH\n</b>\t\tRun!\n\n\n\tThe SECOND MAN falls, knocking over a vendor's stand. SALLAH and BRODY\n\tbegin to run. SALLAH knocks the FIRST MAN into another vendor's stand. The\n\tSTAND COLLAPSES on impact.\n\n\tSALLAH grabs BRODY and pulls him through the crowded streets.\n\n<b>\t\t\tSALLAH\n</b>\t\t        (to Brody; pointing)\n\t\tOkay, okay, quick, quick, quickl\n\t\tHide in that doorl Hide in that\n\t\tdoor!\n\n\tSALLAH points to a DARKENED DOORWAY, hung with a curtain, at the top of a\n\tramp. BRODY runs up the ramp, throws back the curtain and disappears into\n\tthe darkness.\n\n\n<b>CONTINUED: (3)\n</b>\n\tThen\u0097METAL DOORS ARE SLAMMED behind Brody and we realize that he has\n\tactually run into the back of a Nazi TROOP TRUCK.\n\n\tSALLAH runs after the Truck until he reaches a wall, then leans against the wall\n\tdejectedly as the Truck drives away with BRODY inside.\n\n\n<b>\tINT. CASTLE ROOM - DAY\n</b>\n\tThe room is dark. Ancient, floor-length drapes cover the windows. A HUGE\n\tFIREPLACE that's nearly large enough for a man to stand upright in dominates\n\tone wall.\n\n\tThe NAZI GUARDS have tied INDY and HENRY back-to-back in a pair of chairs.\n\tELSA and DONOVAN stand over them. VOGEL enters.\n\n<b>\t\t\tHENRY\n</b>\t\tIntolerable.\n\n\n<b>\t\t               VOGEL\n</b>\t\tDoctor Schneider. Message from\n\t\tBerlin. You must return immediately:\n\t\ta rally at the Institute of Aryan\n\t\tCulture.\n\n<b>\t\t               ELSA\n</b>\t\tSo?\n\n<b>\t\t               VOGEL\n</b>\t\tYour presence on the platform is\n\t\trequested... at the highest level.\n\n<b>\t\t               ELSA\n</b>\t\tThank you, Herr Oberst.\n\t\t      (to DONOVAN)\n\t\tI will meet you at Iskenderun.\n\n<b>\t\t               DONOVAN\n</b>\t\tTake this Diary to the Reich\n\t\tMuseum in Berlin. It will show\n\t\tthem our progress, ahead of\n\t\tschedule. Without a map, I'm\n\t\tafraid it's no better than a\n\t\tsouvenir.\n\n\tHe hands her the Grail Diary.\n\n<b>\t\t\tVOGEL\n</b>\t\t         (to DONOVAN, meaning\n\t\t          Indy and Henry)\n\t\tLet me kill them now.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               ELSA\n</b>\t\tNo. If we fail to recover the\n\t\tpages from Brody, we'll need them\n\t\talive.\n\n<b>\t\t\tDONOVAN\n</b>\t\t    (to VOGEL, with a\n\t\t     helpless shrug)\n\t\tAlways do what the doctor orders.\n\n\tDONOVAN leads VOGEL out. The NAZI GUARDS follow. Once they are gone,\n\tELSA turns to INDY.\n\n<b>\t\t               ELSA\n</b>\t\tDon't look at me like that\u0097we\n\t\tboth wanted the Grail, I would\n\t\thave done anything to get it.\n\t\tYou would have done the same.\n\n\tINDY shakes his head \"no.\"\n\n<b>\t\t               INDY\n</b>\t\tI'm sorry you think so.\n\n\tShe runs her hand down the side of his face. INDY pulls away.\n\n\tINDY and HENRY are still tied back-to-back of course. ELSA bends to speak\n\tquietly into INDY's ear... which is near enough to Henry's ear.\n\n<b>\t\t\tELSA\n</b>\t\t      (whispers)\n\t\tI can't forget... how wonderful\n\t\tit was.\n\n<b>\t\t               HENRY\n</b>\t\tThank you. It was rather wonderful.\n\n\tShe smiles and kisses INDY passionately. HENRY glances back and looks rather\n\tdisappointed.\n\n\tVOGEL appears to remind ELSA of her appointment.\n\n<b>\t\t               VOGEL\n</b>\t\tDoctor Schneider! Your car is\n\t\twaiting.\n\n<b>\t\t\tELSA\n</b>\t\t     (to INDY, after\n\t\t      finishing the kiss)\n\t\tThat's how Austrians say goodbye.\n\n\tELSA exits. VOGEL stays behind for another moment.\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               VOGEL\n</b>\t\tAnd this is how we say goodbye in\n\t\tGermany, Doctor Jones.\n\n\tVOGEL punches INDY in the jaw. A hard and vicious jab that snaps Indy's head\n\taround.\n\n<b>\t\t\tHENRY\n</b>\t\tOhh. . .\n\n\tVOGEL exits. INDY shakes his head clear.\n\n<b>\t\t\tINDY\n</b>\t\t      (to himself)\n\t\tOoooh... I like the Austrian way\n\t\tbetter.\n\n<b>\t\t\tHENRY\n</b>\t\tSo did I.\n\n<b>\t\t               INDY\n</b>\t\tLet's try and get these ropes\n\t\tloose. We've got to get to Marcus\n\t\tbefore the Nazis do!\n\n<b>\t\t\tHENRY\n</b>\t\t     (confused)\n\t\tYou said he had two days' start.\n\t\tThat he would blend in. Disappear!\n\n<b>\t\t               INDY\n</b>\t\tAre you kidding?\u0097I made that\n\t\tup! You know Marcus\u0097he got\n\t\tlost once in his own museum!\n\n\tIndy and Henry are pulling at the ropes with great urgency.\n\n<b>\t\t               INDY\n</b>\t\tCan you try and reach into my\n\t\tleft jacket pocket?\n\n\tHENRY is able to wiggle his hand towards Indy's coat pocket. INDY squirms his\n\tbody around towards Henry's hand.\n\n<b>\t\t               HENRY\n</b>\t\tWhat am I looking for?\n<b>\t\n</b><b>\t\t               INDY\n</b>\t\tMy lucky charm.\n\n<b>\t\t               HENRY\n</b>\t\tFeels like a cigarette lighter.\n\n\n<b>CONTINUED: (3)\n</b>\n<b>\t\t\tINDY\n</b>\t\tTry and burn through the ropes.\n\n\tHENRY's fingers open the lighter and ignite the flame.\n\n<b>\t\t\tHENRY\n</b>\t\tVery good.\n\n\tHENRY yelps as the cigarette lighter burns his hand. He drops the lighter to the\n\tfloor. Henry kicks at the lighter, trying to reach it, but cannot. The rug starts to\n\tburn. INDY doesn't know it yet.\n\n<b>\t\t               HENRY\n</b>\t\tI ought to tell you something.\n\n<b>\t\t               INDY\n</b>\t\tDon't get sentimental now Dad\u0097\n\t\tsave it 'til we get out of here.\n\n<b>\t\t               HENRY\n</b>\t\tThe floor's on fire! See?!\n\n<b>\t\t               INDY\n</b>\t\t        (turns and sees)\n\t\tWhat???\n\n<b>\t\t               HENRY\n</b>\t\tAnd the chair.\n\n<b>\t\t               INDY\n</b>\t\tAll right, movel Move!  Rock\n\t\tyour Chair.  Do what I do.\n\n\tThey begin to rock their chair legs, inching their way off the burning carpet.\n\n\n<b>\tEXT. CASTLE - DAY\n</b>\n\tas ELSA is driven away. VOGEL and DONOVAN remain behind, flanked by NAZI\n<b>\tSOLDIERS .\n</b>\n\tAnother car pulls up and VOGEL holds the door open for DONOVAN who gets into\n\tthe rear seat. A LIEUTENANT approaches with a written message for Donovan.\n\n<b>\t\t\tLIEUTENANT\n</b>\t\tEtwas wichtig, mein Herr.\n\n\tDONOVAN puts on his glasses to read the message.\n\n<b>\t\t               DONOVAN\n</b>\t\tWell, we have Marcus Brody. But\n\t\tmore important, we have the map.\n\n\tA RADIO OPERATOR steps forward with yet another written message for\n<b>\tDONOVAN.\n</b>\n\n<b>CONTINUED:\n</b>\n\n<b>\t\t               RADIO OPERATOR\n</b>\t\tAus Berlin, mein Herr.\n\n<b>\t\t               DONOVAN\n</b>\t\t        (reading)\n\t\t\"By the personal command of the\n\t\tFuhrer. Secrecy essential to\n\t\tsuccess. Eliminate the American\n\t\tconspirators.\"\n\t\t        (to VOGEL)\n\t\tGermany has declared war on the\n\t\tJones boys.\n\t\t        (to DRIVER)\n\t\tLos fahren.\n\n\tThe car drives off.\n\n<b>\tINT. CASTLE ROOM - DAY\n</b>\n\tINDY and HENRY are still in their chairs, tied back-to-back. Indy tries to\n\tcommunicate with Henry, but each time he calls him, the men turn their heads in\n\topposite directions.\n\n<b>\t\t               INDY\n</b>\t\tDad!\n\n<b>\t\t               HENRY\n</b>\t\tWhat?\n\n<b>\t\t               INDY\n</b>\t\tDad!\n\n<b>\t\t               HENRY\n</b>\t\tWhat?\n\n<b>\t\t               INDY\n</b>\t\tDad!\n\n\tFinally they turn their heads in the same direction.\n\n<b>\t\t\tHENRY\n</b>\t\tWhat?\n\n<b>\t\t\tINDY\n</b>\t\tHead for the fireplace!\n\n<b>\t\t\tHENRY\n</b>\t\tOh.\n\n\n\tBANGING, ROCKING and HOPPING their chairs, they work their way INTO THE\n\tFIREPLACE\u0097the only safe place from the now ROARING FIRE.\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tINDY\n</b>\t\tI think I can get these ropes\n\t\toff.\n\n\tIndy struggles to free his hands. His foot kicks out and accidentally hits a metal\n\tgrill that operates a Secret Door.\n\n<b>\t\t\tINDY\n</b>\t\tWhoopsl\n\n\tThe fireplace floor rotates like a Lazy Susan and Indy and his father find\n\tthemselves in the:\n\n\n<b>\tINT. RADIO ROOM - DAY\n</b>\n\twhere a NAZI RADIOMAN wearing headphones sits at an elaborate panel of dials,\n\tswitches and meters, and a WOMAN stands over a map plotting coordinates.\n\tTheir backs are turned to INDY and HENRY.\n\n\tThe floor begins to rotate again, and INDY and HENRY find themselves back in:\n\n\n<b>\tINT. CASTLE ROOM - DAY\n</b>\n\tinside the fireplace, still tied back-to-back.\n\n<b>\t\t\tHENRY\n</b>\t\tOur situation has not improved.\n\n\tINDY glances over his shoulder at HENRY.\n\n<b>\t\t\tINDY\n</b>\t\tListen Dad... I'm almost free.\n\n\tINDY's foot hits the grill again... and the fireplace rotates to:\n\n\n<b>\tINT. RADIO ROOM - DAY\n</b>\n\tFOUR NAZI RADIOMEN and the WOMAN are still hard at work with controls and\n\tcoordinates. Suddenly the Woman looks up and spots HENRY and INDY. She\n\tscreams.\n\n<b>\t\t\tWOMAN\n</b>\t\tAlarm!\n\n\tNow the RADIOMEN turn to see HENRY and INDY.\n\n<b>\t\t\tWOMAN\n</b>\t\tSchnel!!\n\n\tTWO NAZIS draw their revolvers and FIRE SEVERAL SHOTS at INDY and HENRY\n\n<b>\tINT. CASTLE ROOM - DAWN\n</b>\n\tINDY and HENRY rotate into the room which is now an INFERNO. The carpet,\n\tdrapes and furniture are all ablaze.\n\n<b>\t\t               HENRY\n</b>\t\tThis is intolerable!\n\n<b>\t\t\tINDY\n</b>\t\tI'm out, Dad!\n\n\n\tINDY finally breaks free. And he immediately begins to untie his father.\n\n<b>\t\t\tHENRY\n</b>\t\tWell done, boy!\n\n<b>\tINT. RADIO ROOM - DAY\n</b>\n\tAll FOUR RADIOMEN now have their guns drawn. They activate the lever and\n\tbegin to rotate through the Secret Door.\n\n\n<b>\tINT. CASTLE ROOM - DAY\n</b>\n\tThe RADIOMEN appear in the fireplace on the other side\u0097but there is NO SIGN\n<b>\tOF INDY AND HENRY.\n</b>\n\tThe RADIOMEN move cautiously toward the flame, shielding their faces with one\n\thand, holding their guns with the other. Is it possible that INDY and HENRY\n\tescaped through these flames?\n\n\tNot a chance.\n\n\tThey've hidden themselves UP THE CHIMNEY. And now they DROP DOWN,\n\tBEHIND the RADIOMEN.\n\n\tOne of the RADIOMEN grabs INDY by the neck. As they struggle they fall against\n\tthe rotating wall and disappear into the next room, leaving a frightened HENRY\n\tbehind.\n\n\tHENRY presses against the wall, which rotates again. As he disappears into the\n\tnext room, a DEAD NAZI RADIOMAN swivels into the room. The other NAZIS\n\trush forward to him.\n\n<b>\tINT. RADIO ROOM - DAY\n</b>\n\tINDY picks up a BUST OF HITLER and uses it to jam the rotating wall in place,\n\tsealing the NAZIS inside the burning room.\n\n\n<b>\tINT. CASTLE HALLWAY- DAY\n</b>\n\tVogel strides purposefully down the hallway. He BARKS an order, and TWO\n\tMORE NAZIS fall into step with him.\n\n<b>\tINT. RADIO ROOM - DAY\n</b>\n\tINDY grabs his whip, his leather sack and Henry's case from a table. He hands\n\tthe case to HENRY and they begin to run.\n\n<b>\t\t\tINDY\n</b>\t\tCome on Dad.\n\n<b>\tINT. SECRET ROOM - DAY\n</b>\n\tINDY and HENRY step into an empty room.\n\n<b>\t\t\tINDY\n</b>\t\tDead end.\n\n\tHENRY looks horrified by what he's been forced to do as INDY searches\n\tfrantically for an exit.\n\n<b>\t\t               INDY\n</b>\t\tThere's got to be a... a secret\n\t\tdoor around. A passageway or\n\t\tsomething.\n\n\tINDY begins to run his hands over the walls\u0097frantic.\n\n<b>\t\t               HENRY\n</b>\t\tI find that if I just sit down\n\t\tand think...\n\n\tHENRY sits on a chair which tips back, hitting the wall behind it. The floor at\n\tINDY's feet suddenly begins DROPPING AWAYI\n\n\tINDY grabs a railing to keep from falling, but loses his grip and plunges through\n\tthe opening which has formed a SPIRAL STAIRCASE. He rolls down the stairs.\n\n<b>\t\t\tINDY\n</b>\t\tDad! \n\n<b>\t\t\tHENRY\n</b>\t                   ... the solution presents itself.\n\n\tHENRY follows INDY down the staircase.\n\n\n<b>\tINT. CAVERN/UNDERGROUND HARBOR - DAY\n</b>\n\tThe stairway deposits Indy and Henry into an enormous WATERY CAVERN\n\tbeneath the mountain on which the castle was built.\n\n\tA full-scale Nazi BOAT DOCK has been built inside the cavern. We see\n\tMOTORBOATS, GUNBOATS, SUPPLY BOATS, etc.\n\n<b>\t\t                  INDY\n</b>\t\tGreat. More boats.\n\n\n<b>CONTINUED:\n</b>\n\tINDY boards one of the motorboats and STARTS THE MOTOR.\n\n<b>\t\t               HENRY\n</b>\t\tWould you say this has been just\n\t\tanother typical day for you? Huh?\n\n\tHENRY tosses his case at INDY who catches it and angrily throws it back to his\n\tfather.\n\n<b>\t\t\tINDY\n</b>\t\t        (ironically)\n\t\tOoofl No! It's been better than\n\t\tmost.\n\n\tINDY moves back to the dock and pushes the boat away. HENRY looks confused.\n\n<b>\t\t\tINDY\n</b>\t\tCome on, Dad. Come onl\n\n<b>\t\t               HENRY\n</b>\t\tWhat about the boat? We're not\n\t\tgoing on the boat?\n\n\n<b>\tINT. SECRET ROOM - DAY\n</b>\n\tVOGEL and the NAZI SOLDIERS enter the room and spot the spiral staircase\n\tleading below. They quickly descend the stairs.\n\n\n<b>\tINT. CAVERN/UNDERGROUND HARBOR - DAY\n</b>\n\tas VOGEL and the NAZI SOLDIERS rush to the dock. Vogel sees that a motorboat\n\tis missing. He orders the Nazi Soldiers into a boat.\n\n<b>\t\t               VOGEL\n</b>\t\tSie alle ins Boat. Schnell!\n\n\tCAMERA PULLS BACK TO REVEAL a large box which suddenly BREAKS APART\n\tas INDY, now on a motorbike with HENRY in the sidecar, ROARS PAST THE\n\tDOCK, hitting TWO NAZI SOLDIERS who scream as they fall into the river.\n\n\tVOGEL screams after INDY and HENRY as they drive off.\n\n<b>\tSTRAIGHT CUT TO:\n</b>\n<b>\tEXT. COUNTRY ROAD - DAY\n</b>\n\tINDY looks pleased as he drives the motorbike along the road, but HENRY\n\tappears worried.\n\n<b>\t                                     INDY\n</b>\t\tHa!\n\n<b>\tFOUR NAZI SOLDIERS ON MOTORCYCLES\n</b>\n\tThey chase down the road after INDY and HENRY.\n\n\tINDY turns the motorbike down a smaller, dusty tree-lined road. HENRY gasps\n\tas he is jostled about in the sidecar. One of the NAZI SOLDIERS gives chase along\n\ta higher road running in the same direction.\n\n\n<b>\tEXT. ROAD BARRICADE - DAY\n</b>\n\tINDY approaches the barricade from one direction as one of the NAZI SOLDIERS\n\tapproaches from a higher road.\n\n\tA GUARD steps from the road station and calls to the vehicles as INDY and\n<b>\tHENRY SMASH THROUGH THE BARRICADE.\n</b>\n<b>\t\t               GUARD\n</b>\t\tHalt! Halt!\n\n\tTHE NAZI SOLDIER rides his motorcycle through the other side of the barrier--\n<b>\tIT SHATTERS.\n</b>\n<b>\tINDY AND HENRY\n</b>\n\tINDY grabs at a FLAGPOLE as they roar past\u0097it snaps off in his hand.\n\n\tThe NAZI SOLDIER drives his motorcycle toward INDY and HENRY. He\n\tunshoulders his machine gun.\n\n\tINDY uses the broken flagpole as a lance and knocks the NAZI SOLDIER from his\n\tmotorcycle.\n\n<b>\tTHE RIDERLESS MOTORCYCLE\n</b>\n\tdrives on toward the other NAZI SOLDIERS now approaching the guardhouse,\n<b>\tCOLLIDING WITH TWO OF THEM.\n</b>\n\tThe remaining NAZI SOLDIER maneuvers his motorcycle around his fallen\n\tcomrades and continues the chase.\n\n\n<b>\tINDY AND HENRY\n</b>\n\tAs the remaining NAZI SOLDIER rides alongside their motorbike he cocks his gun,\n\tpreparing to fire.\n\n\tINDY quickly jams the remaining portion of the flagpole through the spokes of the\n\tNazi's front wheel.\n\n\tThe NAZI SOLDIER'S MOTORCYCLE FLIPS THREE TIMES, throwing him high into\n\tthe air.\n\n\n<b>CONTINUED:\n</b>\n\tINDY glances back and smiles, but the smile fades as he looks forward again to\n\tsee a sign at a CROSSROAD. Arrows pointing in opposite directions indicate the\n\tway to BERLIN or VENEDIG.\n\n\tIndy starts down the road marked VENEDIG.\n\n<b>\t\t\tHENRY\n</b>\t\tStop!\n\n<b>\t\t\tINDY\n</b>\t\tWhat?\n\n<b>\t\t\tHENRY\n</b>\t\tStop! Stop!\n\n\tThe motorbike skids to a stop.\n\n\n<b>\t\t               HENRY\n</b>\t\tYou're going the wrong Way!  We\n\t\thave to get to Berlin!\n\n<b>\t\t\tINDY\n</b>\t\t     (pointing towards\n\t\t      Venedig)\n\t\tBrody's this way.\n\n<b>\t\t               HENRY\n</b>\t\tMy Diary's in Berlin.\n\n<b>\t\t               INDY\n</b>\t\tYou don't need the Diary, Dad.\n\t\tMarcus has the map.\n\n<b>\t\t               HENRY\n</b>\t\tThere is more in the Diary than\n\t\tjust the map.\n\n<b>\t\t               INDY\n</b>\t\tAll right Dad\u0097tell me.\n\n<b>\t\t               HENRY\n</b>\t\tWell, he who finds the Grail must\n\t\tface the final challenge.\n\n<b>\t\t               INDY\n</b>\t\tWhat final challenge?\n\n<b>\t\t               HENRY\n</b>\t\tThree devices of such lethal\n\t\tcunning.\n\n<b>\t\t               INDY\n</b>\t\tBooby traps?\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               HENRY\n</b>\t\tOh, yes. But I found the clues\n\t\tthat will safely take us through,\n\t\tin the Chronicles of St. Anselm.\n\n<b>\t\t               INDY\n</b>\t\tBut what are they? Can't you\n\t\tremember?\n\n<b>\t\t               HENRY\n</b>\t\tI wrote them down in my Diary so\n\t\tthat I wouldn't have to remember\n\n<b>\t\t               INDY\n</b>\t\tHalf the German Army's on our\n\t\ttail and you want me to go to\n\t\tBerlin? Into the lion's den?\n\n<b>\t\t               HENRY\n</b>\t\tYes! The only thing that matters\n\t\tis the Grail.\n\n<b>\t\t               INDY\n</b>\t\tWhat about Marcus?\n\n<b>\t\t               HENRY\n</b>\t\tMarcus would agree with me.\n\n<b>\t\t               INDY\n</b>\t\tTwo selfless martyrs. Jesus\n\t\tChristl\n\n\tHENRY slaps him across the face. INDY is rocked to his foundations, not by any\n\tmeans entirely by the blow itself.\n\n<b>\t\t               HENRY\n</b>\t\tThat's for blasphemy. The quest\n\t\tfor the Grail is not archaeology.\n\t\tIt's a race against evil.\n\t\tIf it is captured by the Nazis,\n\t\tthe armies of darkness will march\n\t\tall over the face of the earth.\n\t\tDo you understand me?\n\n<b>\t\t               INDY\n</b>\t\tThis is an obsession Dad. I never\n\t\tunderstood it. Never. Neither\n\t\tdid Mom.\n\n<b>\t\t               HENRY\n</b>\t\tOh yes, she did. Only too well.\n\t\tUnfortunately she kept her illness\n\t\tfrom me until all I could do was\n\t\tmourn her.\n\n<b>\tEXT. CROSSROADS - DAY\n</b>\n\tArrows point in opposite directions to VENICE and BERLIN. The CAMERA MOVES\n\tIN on the portion of the sign reading BERLIN.\n\n\n<b>\tEXT. CITY SQUARE - BERLIN - NIGHT\n</b>\n\tA Nazi Rally\u0097a book-burning is in process.\n\n\tThe mound of burning books is ten feet tall and growing by the minute as College\n\tStudents and Nazi Brownshirts continually toss more books onto the fire.\n\n\tFlags, banners and standards displaying the swastika are waved rhythmically\n\tfrom side to side in a motion that echoes the mounting frenzy of the enormous\n\tcrowd.\n\n\tINDY and HENRY walk toward the Square. Indy wears the uniform of a Nazi\n\tSoldier. He is now buttoning up the tunic\u0097which happens to be several sizes\n\ttoo big.\n\n<b>\t\t\tHENRY\n</b>\t\tMy boy, we are Pilgrims in an\n\t\tunholy land.\n\n\tThen... Indy sees something that makes him stop in his tracks. WE PAN ALONG\n\tHIS LINE OF SIGHT to:\n\n<b>\tTHE PODIUM\n</b>\n\twhere high-ranking Officers of the Third Reich stand flanking ADOLF HITLER as\n\tthey oversee the rally.\n\n\n<b>\tANOTHER ANGLE\n</b>\n\tELSA is walking away in an open area, background of torches, vehicles, Nazi\n\tOfficers... one of whom is now none other than INDY, coming up to her before she\n\tknows he is there. His voice is quiet and tough, his eyes hard.\n\n<b>\t                                      INDY\n</b>\t\tFraulein Doctor. Where is it?\n\n\tStill startled, her reaction makes it clear that Indy is even now a lover in her\n\tthoughts.\n\n<b>\t                                      ELSA\n</b>\t\tHow did you get here?\n\n<b>\t                                      INDY\n</b>\t\tWhere is it? I want it.\n\n\tINDY pushes ELSA against a column and begins to search her clothing for the\n\tDiary. He pulls the book from Elsa's pocket.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               ELSA\n</b>\t\tYou came back for the book?\n\t\tWhv?\n\n<b>\t\t               INDY\n</b>\t\tMy father didn't want it\n\t\tincinerated.\n\n\tShe understands him. It's as though he slapped her.\n\n<b>\t\t               ELSA\n</b>\t\tIs that what you think of me?\n\t\tI believe in the Grail, not the\n\t\tSwastika.\n\n<b>\t\t\tINDY\n</b>\t\t      (vicious)\n\t\tYet you stood up to be counted\n\t\twith the enemy of everything the\n\t\tGrail stands for\u0097who gives a\n\t\tdamn what you think?\n\n\n<b>\t\t\tELSA\n</b>\t\t     (hard and fast)\n\t\tYou do.\n\n\tNow it's as though she'd slapped him back. His hands fly to her neck.\n\n<b>\t\t\tINDY\n</b>\t\tAll I have to do is squeeze.\n\n<b>\t\t\tELSA\n</b>\t\tAll I have to do is scream.\n\n\tIt's a standoff emotionally. He knows he'd never do it. she knows it too. And\n\tthe same goes for screaming.\n\n\tINDY releases her and backs away. she looks at him with a lover's pain. He\n\tmoves over to HENRY.\n\n<b>\t\t\tINDY\n</b>\t\tI've got it. Let's get the hell\n\t\tout of here.\n\n\tThey move off and almost run headlong into HITLER and his entire entourage\n\tcoming down from the Podium. 50 kids push their autograph books for Hitler's\n\tsignature.\n\n\tHITLER pauses to sign them. Hitler looks Indy's way. They make eye contact. It\n\tonly lasts a moment but the moment is electric.\n\n\tHITLER breaks the spell by taking the Grail Diary from him, opens it to the first\n\tpage and signs his autograph. He hands it back and moves on.\n\n<b>\tEXT. AIRFIELD - BERLIN, GERMANY- DAY\n</b>\n\tIndy's motorcycle pulls up to the main terminal.\n\n\n<b>\tINT. TERMINAL BUILDING - DAY\n</b>\n\tA Plainclothes Agent distributes leaflets bearing HENRY'S PICTURE to Nazi\n\tSoldiers inside the terminal.\n\n\tHENRY leans in a doorway reading a newspaper as INDY enters down the stairs\n\tand taps Henry's shoulder.\n\n\tThey begin to walk toward the boarding gates.\n\n<b>\t\t               HENRY\n</b>\t\tWhat did you get?\n\n<b>\t\t               INDY\n</b>\t\tI don't know. The first available\n\t\tflight out of Germany.\n\n<b>\t\t               HENRY\n</b>\t\tGood.\n\n\tINDY and HENRY show their papers to the Boarding Guards, then join the line of\n\tpassengers, which has already begun to move toward a:\n\n\n<b>\tMOORED ZEPPELIN\n</b>\n\tTen stories tall and longer than two football fields: Flying in the grand tradition!\n\n\n<b>\tINT. THE ZEPPELIN - PASSENGER COMPARTMENT - DAY\n</b>\n\tThe Zeppelin is about to take off. INDY and HENRY make themselves comfortable\n\tin one of the compartments.\n\n<b>\t\t               INDY\n</b>\t\tWell, we made it.\n\n\tHENRY looks over his newspaper at INDY.\n\n<b>\t\t               HENRY\n</b>\t\tWhen we're airborne, with Germany\n\t\tbehind us, then I'll share that\n\t\tsentiment.\n\n<b>\t\t               INDY\n</b>\t\tRelax.\n\n\tBut INDY looks out the window and is suddenly concerned when he sees:\n<b>\tVOGEL AND A GESTAPO AGENT\n</b>\trushing across the tarmac toward the Zeppelin.\n\n<b>\t\t             VOGEL\n</b>\t\tNicht zumachen! Wir steigen ein!\n\n<b>\tINDY\n</b>\n\tsits back in his chair, looks to HENRY, now reading his newspaper.\n\n\tA STEWARD enters and sets a bowl of nuts on the table in front of INDY and\n\tHENRY, then continues down the aisle of passengers. Indy follows after the\n\tSteward. He puts his arm around the Steward's shoulder and together they walk\n\tup a flight of stairs.\n\n<b>\tVOGEL\n</b>\n\tnow walks up the aisle. He approaches a MALE PASSENGER hidden behind a\n\tnewspaper. VOGEL uses his walking stick to lower the newspaper and show the\n\tPassenger the leaflet with Henry's photograph.\n\n<b>\t\t\tVOGEL\n</b>\t\tHaben sie disen Mann gesehen?\n\n\tThe Passengers at the table shake their heads in the negative. VOGEL shows the\n\tpicture to other Passengers.\n\n<b>\t\t\tFEMALE PASSENGER\n</b>\t\tNein.\n\n<b>\t\t\tINDY (O.S.)\n</b>\t\tFahrscheine, bitte.\n\n<b>\t\t\tMALE PASSENGER\n</b>\t\tNein.\n\n\tVOGEL turns to see:\n\n<b>\tINDY\n</b>\n<b>\tWEARING THE HAT AND JACKET OF THE CHIEF STEWARD.\n</b>\n<b>\t\t\tMALE PASSENGER (O.S.)\n</b>\t\tIch habe ihn night gesehen.\n\n<b>\t\t\tINDY\n</b>\t\tTickets please.\n\n\tThe Passengers do not react to the request, made in English.\n\n<b>\t\t\tINDY\n</b>\t\tFahrscheine meine Dame. Bitte.\n\n<b>\tVOGEL\n</b>\n\tapproaches HENRY, still hidden behind his newspaper. Again, VOGEL uses his\n\twalking stick to lower the paper, revealing Henry's face.\n\n<b>\t\t\tVOGEL\n</b>\t\tGuten Tag, Herr Jones.\n\n\tNow INDY, still playing the role of Steward, asks VOGEL for his ticket.\n\n<b>\t\t\tINDY\n</b>\t\tFahrscheine meine Herr.\n\n<b>\t\t\tVOGEL\n</b>\t\tWeg.\n\n<b>\t\t\tINDY\n</b>\t\tTickets please.\n\n\tHENRY looks confused.\n\n<b>\t\t\tVOGEL\n</b>\t\t      (in German)\n\t\tWas?\n\n\n\n\tVOGEL glances up and recognizes INDY\u0097who quickly punches Vogel in the face,\n\tknocking him toward the window. In another quick move, Indy TOSSES HIM OUT\n\tTHE WINDOW onto the tarmac below.\n\n\tShocked Passengers blink in bewilderment.\n\n<b>\t\t\tINDY\n</b>\t\t     (in German; with a\n\t\t      shrug)\n\t\tNo ticket.\n\n\tEveryone else with a ticket quickly produces it and waves it in Indy's face.\n\n\n<b>\tEXT. AIRFIELD TARMAC - DAY\n</b>\n\tVOGEL gets to his knees as the huge Zeppelin rises into the sky above him,\n\trevealing an airplane attached to the belly of the airship. Vogel shakes his fist at\n\tthe rising Zeppelin.\n\n<b>\t\t\tVOGEL\n</b>\t\tDu wirst nochmal boren von mir!\n\n<b>\tINT. ZEPPELIN - DAY\n</b>\n\tINDY and HENRY together again in their compartment.\n\n<b>\t\t                HENRY\n</b>\t\tYou know, sharing your adventures\n\t\tis an interesting experience.\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tINDY\n</b>\t\t        (meaning ELSA)\n\t\tThat's not all we shared. It's\n\t\tdisgraceful. You're old enough to\n\t\tbe her fa---er, her grandfather!\n\n<b>\t\t               HENRY\n</b>\t\tWell, I'm as human as the next\n\t\tman.\n\n<b>\t\t               INDY\n</b>\t\tI was the next man.\n\n<b>\t\t               HENRY\n</b>\t\t       (laughs)\n\t\tShips that pass in the night...\n\n\tHENRY opens his Diary and begins to thumb through it.\n\n<b>\t\t               INDY\n</b>\t\tDo you remember the last time we\n\t\thad a quiet drink? I had a milk\n\t\tshake.\n\n<b>\t\t               HENRY\n</b>\t\tHmmm... What did we talk about?\n\n<b>\t\t               INDY\n</b>\t\tWe didn't talk. We never talked.\n\n<b>\t\t               HENRY\n</b>\t\tAnd do I detect a rebuke?\n\n<b>\t\t               INDY\n</b>\t\tA regret. It was just the two of\n\t\tus, Dad. It was a lonely way to\n\t\tgrow up. For you, too. If you\n\t\thad been an ordinary, average\n\t\tfather like the other guys' dads,\n\t\tyou'd have understood that.\n\n<b>\t\t               HENRY\n</b>\t\tActually, I was a wonderful father.\n\n<b>\t\t\tINDY\n</b>\t\tWhen?\n\n\n\tHENRY looks up from his Diary.\n\n<b>\t\t               HENRY\n</b>\t\tDid I ever tell you to eat up?\n\t\tGo to bed? Wash your ears? Do\n\t\tyour homework? No. I respected\n\t\tyour privacy and I taught you self-\n\t\treliance.\n\n\n<b>CONTINUED: (2)\n</b>\n\n<b>\t\t               INDY\n</b>\t\tWhat you taught me was that I was\n\t\tless important to you than people\n\t\twho had been dead for five hundred\n\t\tyears in another country. And I\n\t\tlearned it so well that we've\n\t\thardly spoken for twenty years.\n\n<b>\t\t               HENRY\n</b>\t\tYou left just when you were\n\t\tbecoming interesting.\n\n<b>\t\t               INDY\n</b>\t\tDad, how can you --?\n\n<b>\t\t\tHENRY\n</b>\t\t        (interrupting)\n\t\tVery well. I'm here now.\n\n\tHe closes the Diary and leans back in his seat.\n\n<b>\t\t               HENRY\n</b>\t\tWhat do you want to talk about?\n\t\tHmmm?\n\n\tINDY stutters uncomfortably as HENRY stares at him, waiting for a response.\n\n<b>\t\t\tINDY\n</b>\t\t        (laughs)\n\t\tWell... I can't think of anything.\n\n<b>\t\t               HENRY\n</b>\t\tThen what are you complaining\n\t\tabout?\n\t\t        (laughs)\n\t\tLook, we have work to do. When\n\t\twe get to Alexandretta we will\n\t\tface three challenges.\n\t\t        (he reads from the\n\t\t         Diary)\n\t\t\"First, the breath of God. Only\n\t\tthe penitent man will pass.\n\t\tSecond, the Word of God, only in\n\t\tthe footsteps of God will he\n\t\tproceed. Third, the Path of God,\n\t\tonly in the leap from the lion's\n\t\thead will he prove his worth. \"\n\n<b>\t\t               INDY\n</b>\t\tWhat does that mean?\n\n<b>\t\t\tHENRY\n</b>\t\t        (laughs)\n\t\tI don't know. We'll find out.\n\n\n<b>CONTINUED: (3)\n</b>\n\n\tSunlight falls across the table from the window. INDY reaches for the drink. The\n\tbar of sunlight turns like the hand of a clock over the tabletop across the drinks.\n\n\tWe see INDY puzzled. Only for a moment.\n\n<b>\t\t               INDY\n</b>\t\tThey're turning around. They're\n\t\ttaking us back to Germany.\n\n\n<b>\tINT. FRAMEWORK OF ZEPPELIN - DAY\n</b>\n\tINDY and his father emerge from the hatchway into the belly of the Zeppelin.\n\tThe Zeppelin's elaborate metal framework is exposed.\n\n\tINDY and HENRY hurry down the catwalk until arriving at a PAIR OF\n\tDOORWAYS framed into the Zeppelin's outer skin.\n\n<b>\t\t               INDY\n</b>\t\tWell, I thought it would take\n\t\tthem a lot longer to figure out\n\t\tthe radio was dead. Come on,\n\t\tDad. Move!\n\n\tThen INDY opens the doors. We see plenty of blue sky and white clouds. We also\n\tsee a small BIPLANE that is suspended from the Zeppelin by a HOOK &amp; CRANE\n<b>\tDEVICE.\n</b>\n<b>\t\t               INDY\n</b>\t\tCome on, Dad. Come on!\n\n<b>\tEXT. AIRPLANE - DAY\n</b>\n\tINDY climbs into the cockpit of the Biplane as HENRY takes the tail gunner's\n\tseat.\n\n<b>\t\t\tHENRY\n</b>\t\t       (with delight)\n\t\tI didn't know you could fly a\n\t\tplane.\n\n<b>\t\t               INDY\n</b>\t\tFly--yes. Land--no.\n\n\n<b>\tINT. THE BIPLANE - DAY\n</b>\n\tINDY turns in his seat to give HENRY the \"thumbs up.\" Henry smiles valiantly\n\tand points down to the ground.\n\n\tThen they both become aware of a STRANGE SOUND in the skies behind them.\n\tSomething between a ROAR and a WAIL.\n<b>\tTWO MESSERSCHMIDT FIGHTER BOMBERS\n</b>\n\tstreak out of the clouds and race across the sky.\n\n\n<b>\tINDY AND HENRY\n</b>\n\tshrink in their seats as the MESSERSCHMIDTS (going three times as fast as they\n\tare) SCREAM past on either side.\n\n<b>\t\t               INDY\n</b>\t\tDad, you're gonna have to use the\n\t\tmachine gun. Get it ready.\n\n\tHENRY turns and grips the MOUNTED MACHINE GUN with a perplexed\n\texpression.\n\n<b>\t\t\tINDY\n</b>\t\t        (turning; pointing)\n\t\tEleven o'clock!\n\n\tHENRY pulls out his watch.\n\n<b>\t\t               INDY\n</b>\t\tDad\u0097eleven o'clock!!\n\n<b>\t\t               HENRY\n</b>\t\tWhat happens at eleven o'clock?\n\n\tINDY uses his arm to demonstrate that he's referring to a direction and not a\n\ttime.\n\n<b>\t\t\tINDY\n</b>\t\t        (frustrated)\n\t\tTwelve\u0097eleven\u0097ten. Eleven\n\t\to'clock. Fire!\n\n\tHENRY does\u0097and the EXPLODING GUN nearly shakes him out of his seat.\n\n\tIndy's slow speed and small size works to his advantage. The speeding\n\tMesserschmidts continually overshoot him, WHIZZING past in a blur\u0097making\n\twide turns miles away in the sky.\n\n\tHENRY has one of the Messerschmidts in his sight. He pulls back on the trigger\n<b>\t--RATTA-A-TAT-TAT!  RATTA-A-TAT-TAT!\n</b>\n\tThe Messerschmidt banks to the left, but HENRY keeps it in his gun sight. Henry\n\tswings the gun around, inadvertently CUTTING HIS OWN REAR STABILIZER IN\n<b>\tHALF.\n</b>\n<b>\t\t               INDY\n</b>\t\tDad, are we hit?!\n\n<b>\t\t\tHENRY\n</b>\t\tMore or less.\n\n<b>CONTINUED:\n</b>\n\n<b>\t\t\tHENRY\n</b>\t\tSon, I'm sorry. They got us.\n\n\tINDY looks back at the missing tail section, then at his father.\n\n\tThe plane begins to go down. INDY struggles to control its descent.\n\n<b>\t\t\tINDY\n</b>\t\tHang on, Dads We're going in!\n\n\tHENRY slumps down fearfully in his seat.\n\n\n<b>\tEXT. A FIELD - DAY\n</b>\n\tThe wheels of the plane touch down. OUT OF CONTROL, the PLANE SKIDS and\n\tCRASHES first into a corral of goats and then into the farmhouse beyond sending\n\ta cloud of dust into the air.\n\n\tAs INDY pulls himself from the cockpit:\n\n<b>\t\t\tHENRY\n</b>\t\t        (sarcastic)\n\t\tNice landing.\n\n<b>\t\t\tINDY\n</b>\t\tThanks.\n\n\n\tSuddenly, INDY's attention is directed to:\n\n\n<b>\tTWO SCREAMING MESSERSCHMIDTS\n</b>\n\tcoming in low. Guns BLAZING.\n\n\tAs BULLETS EXPLODE around them, INDY and HENRY jump over a stone\n\tbarricade. Henry, frightened, grabs at Indy.\n\n<b>\t\t               HENRY\n</b>\t\tThose people are trying to kill\n\t\tus!\n\n<b>\t\t\tINDY\n</b>\t\tI know, Dadl\n\n<b>\t\t\tHENRY\n</b>\t\tIt's a new experience for me.\n\n<b>\t\t\tINDY\n</b>\t\tIt happens to me all the time.\n\n\n<b>\tEXT. ROAD - DAY\n</b>\n\tAn OLD MAN kneels at his car repairing a rear tire.\n\n<b>\tTHE MAN\n</b>\n\tturns to the wheel, the hubcap in his hands. Suddenly the wheel moves forward,\n\tstartling the Old Man.\n\n\n<b>\tINT. THE CAR - TRAVELING - DAY\n</b>\n\tINDY has the throttle down, both hands tightly gripping the steering wheel.\n\tHENRY is a very nervous passenger.\n\n\tINDY sees a LOW-FLYING MESSERSCHMIDT coming up behind him in the SIDE\n<b>\tMIRROR.\n</b>\n\tAs the Messerschmidt ROARS by overhead, BULLETS EXPLODE around them,\n\tnarrowly missing the car.\n\n<b>\t\t               HENRY\n</b>\t\tThis is intolerable!\n\n<b>\t\t               INDY\n</b>\t\tThis could be close.\n\n\n<b>\tEXT. THE ROAD - LONG SHOT - DAY\n</b>\n\tThe car races toward a TUNNEL that cuts through a steep MOUNTAINSIDE.\n\n\tThe Messerschmidt bears down on Indy's car, machine guns CHATTERING.\n\n\tThe car ENTERS the tunnel. The Messerschmidt cannot pull up in time. It\n\tSLAMS into the MOUTH OF THE TUNNEL, SHEARING OFF its WINGS.\n\n\n<b>\tINT. THE TUNNEL - DAY\n</b>\n\tThe FLAMING FUSELAGE continues to ROCKET through the tunnel like a bullet\n\tdown the muzzle of a gun. SPARKS fly as its belly SCRAPES against the\n\tpavement and the sides of the tunnel.\n\n\n<b>\tINT. THE CAR - DAY\n</b>\n\tIndy and Henry look over their shoulders to see this wingless BALL OF FIRE\n\tgaining on them; about to overtake them.\n\n<b>\t\t\tHENRY\n</b>\t\tFaster, boy --faster!\n\n\n<b>\tEXT. THE ROAD - OTHER SIDE OF THE MOUNTAIN - DAY\n</b>\n\tThe car exits the tunnel at top speed and veers off the\n\troad. The flaming Messerschmidt fuselage shoots past and\n\tEXPLODES in the middle of the road.\n\n<b>\tINT. THE CAR - DAY\n</b>\n\tAs the car emerges safely from the flames, Henry wipes the sweat from his brow.\n\n<b>\t\t\tHENRY\n</b>\t\tWell, they don't come any closer\n\t\tthan that!\n\n\tHENRY looks out the windshield and sees the second Messerschmidt SCREAMING\n\tout of the sky toward them.\n\n\n<b>\tEXT. THE ROAD - LONG SHOT - DAY\n</b>\n\tThe MESSERSCHMIDT drops its single UNDER-FUSELAGE BOMB. It EXPLODES in\n\tthe road directly ahead of the car, missing it by only several feet.\n\n<b>\tTHE CAR\n</b>\n\tFALLS INTO THE HOLE made by the bomb.\n\n<b>\tDISSOLVE TO:\n</b>\n\n<b>\tEXT. ROAD - DAY\n</b>\n\tINDY climbs out of the car, still in the bomb crater. He turns back to HENRY.\n\n<b>\t\t               INDY\n</b>\t\tDad, he's coming back.\n\n\tINDY and HENRY run down the mountainside to:\n\n\n<b>\tA DESERTED MEDITERRANEAN BEACH - DAY\n</b>\n\tINDY and HENRY run to the shoreline. Indy reaches for his gun, tucked in his\n\tpants. He opens the chamber\u0097the GUN HAS NO BULLETS.\n\n\n<b>\tTHE MESSERSCHMIDT\n</b>\n\tswings around and is coming in for another pass.\n\n\n<b>\tINDY AND HENRY\n</b>\n\texchange a wordless glance. They don't even think about running: there is no\n\tplace to run to. HENRY hands his case to INDY.\n\n\tHolding his umbrella, HENRY suddenly spins around and runs screaming and\n\tshouting into A FLOCK OF SEA GULLS...\n\n\tTHE SEA GULLS take to the wing in flight. Thousands of them.\n\n<b>\tINDY\n</b>\n\tBullets kick up sand leading up to him... then\u0097\n\n\tTHE MESSERSCHMIDT AND THE SEA GULLS meet in midair. MASSACRE! Sea\n\tgulls are shredded by the Messerschmidt's whirling propeller blades into a\n\tFEATHERY WHITE PUREE that SPLATTERS against the cockpit and CLOGS THE\n<b>\tENGINE.\n</b>\n\tENGINE SPUTTERS... STALLS... Silence. The Messerschmidt falls from the skies\n\tand EXPLODES in an OFF CAMERA SOUND EFFECT.\n\n\tINDY stands as before\u0097stunned\u0097a statue.\n\n\tHENRY walks back to INDY.\n\n<b>\t\t               HENRY\n</b>\t\tI suddenly remembered Charlemagne.\n\t\t\"Let my armies be the rocks and the\n\t\ttrees and the birds in the sky.\"\n\t\t       (he chuckles)\n\n\tINDY wears a proud expression as he watches HENRY walk down the beach.\n\n\n<b>\tEXT. MOSQUE - DAY\n</b>\n<b>\tFADE IN TITLE: \"REPUBLIC OF HATAY\"\n</b>\n<b>\tFADE OUT TITLE.\n</b>\n\n<b>\tEXT. COURTYARD OF SULTAN'S PALACE - ISKENDERUN - DAY\n</b>\n\tThe SULTAN is seated in his royal chair, flanked by WALTER DONOVAN and\n\tVOGEL and surrounded by his minions.\n\n\tDONOVAN holds the missing Grail Diary pages.\n\n<b>\t\t               DONOVAN\n</b>\t\tThese pages are taken from Professor\n\t\tJones' diary, Your Highness. And\n\t\tthey include a map that pinpoints\n\t\tthe exact location of the Grail.\n\n\tDONOVAN and the SULTAN walk together through an archway.\n\n<b>\t\t               DONOVAN\n</b>\t\tAs you can see, the Grail is all\n\t\tbut in our hands.\n\t\t      (beat)\n\t\tHowever, Your Highness, we\n\t\twould not think of crossing your\n\t\tsoil without your permission,\n\t\tnor of removing the Grail from\n\t\tyour borders without suitable\n\t\tcompensation.\n\n\n<b>CONTINUED:\n</b>\n\n<b>\t\t               SULTAN\n</b>\t\tWhat have you brought?\n\n<b>\t\t               VOGEL\n</b>\t\tBring den Schatzl\n\n\tTWO NAZI SOLDIERS bring forward a HUGE STEAMER TRUNK. They open the lid\n\tand begin to empty it of its contents:\n\n\tGold and silver objects of every description.\n\n<b>\t\t               DONOVAN\n</b>\t\tPrecious valuables, Your Highness,\n\t\t\"donated\" by some of the finest\n\t\tfamilies in all of Germany.\n\n\tThe SULTAN gets up from his chair and walks toward the trunk. He goes right\n\tpast it and begins to inspect the Nazi staff car parked nearby.\n\n<b>\t\t               SULTAN\n</b>\t\tRolls-Royce Phantom Two. 4.3\n\t\tlitre, 30 horsepower, six cylinder\n\t\tengine, with Stromberg Downdraft\n\t\tcarburetor.\n\n\tThe SULTAN points to the engine under the hood.\n\n<b>\t\t               SULTAN\n</b>\t\tCan go from zero to 100 kilometres\n\t\tan hour in 12.5 seconds. And I\n\t\teven like the color.\n\n<b>\t\t\tDONOVAN\n</b>\t\t       (after a beat)\n\t\tThe keys are in the ignition,\n\t\tYour Highness.\n\n<b>\t\t               SULTAN\n</b>\t\tYou shall have camels, horses, an\n\t\tarmed escort, provisions, desert\n\t\tvehicles\u0097and tanksl\n\n<b>\t\t\tDONOVAN\n</b>\t\tYou're welcome.\n\n\tSomebody else is also taking note...and we see that it is KAZIM, the spy at the\n\tcourt.\n\n\tELSA is revealed coming down the stairs toward DONOVAN and VOGEL.\n\n<b>\t                                     ELSA\n</b>\t\tWe have no time to lose. Indiana\n\t\tJones and his father have escaped.\n\n<b>\tEXT. ISKENDERUN STREET - DAY\n</b>\n\tSALLAH drives his car through the crowded streets, INDY beside him and HENRY\n\tin the back seat.\n\n<b>\t\t               SALLAH\n</b>\t\tWe go this way.\n\n\tSALLAH waves his arms and shouts to a CAMEL HERDER.\n\n<b>\t\t               SALLAH\n</b>\t\tGet that camel out of the way!\n\n<b>\t\t\tINDY\n</b>\t\tWhat happened to Marcus, Sallah?\n\n<b>\t\t\tSALLAH\n</b>\t\t      (overlapping)\n\t\tAh, they set out across the desert\n\t\tthis afternoon. I believe they\n\t\ttook Mister Brody with them.\n\n\tHENRY removes his hat and hits INDY with it.\n\n<b>\t\t               HENRY\n</b>\t\tNow they have the map! And in\n\t\tthis sort of race, there's no\n\t\tsilver medal for finishing second.\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\nElsa and Donovan's party\u0097consisting of a SUPPLY TRUCK, OPEN CAR, TUhKISH\n<b>SOLDIERS RIDING CAMELS, SPARE HORSES AND A TANK AND VARIOUS OTHER\n</b>VEHICLES\u0097all moving along through the ramble of this box canyon.\n\nELSA, DONOVAN and VOGEL travel in the open car. The TANK is a vintage World\nWar I model with enormous treads. The Turkish soldiers wear native dress and\ncarry both carbines and sabers.\n\nBRODY sits alongside ELSA in the rear of the car carrying DONOVAN. Donovan\nhands a canteen back to him.\n\n<b>\t\t               DONOVAN\n</b>\t\tCare to wet your whistle, Marcus?\n\n<b>\t\t\tBRODY\n</b>\t\tI'd rather spit in your face.\n\t\tBut as I haven't got any spit...\n\n\tVOGEL snatches the canteen away from BRODY before he can drink.\n\n<b>\t\t               VOGEL\n</b>\t\tWe must be within three or four\n\t\tmiles. Otherwise we are off the\n\t\tmap.\n\n\n<b>CONTINUED:\n</b>\n\n\tHe hands the map to ELSA, drinks from the canteen, and hands that back to\n<b>\tDONOVAN.\n</b>\n<b>\t\t               DONOVAN\n</b>\t\tWell, Marcus, we are on the brink\n\t\tof the recovery of the greatest\n\t\tartifact in the history of mankind.\n\n<b>\t\t               BRODY\n</b>\t\tYou're meddling with powers you\n\t\tcannot possibly comprehend.\n\n\tHENRY and SALLAH are at INDY's side as he views Donovan's party in the\n\tdistance. Parked nearby is a CAR containing all of their supplies.\n\n<b>\t\t               INDY\n</b>\t\tAh, I see Brody. He seems okay.\n\t\tThey've got a tank. Six-pound\n\t\tgun.\n\n\tThen Donovan notices a reflection from the hills.\n\n\tWhat he sees is:\n\n\n<b>\tTHE SUN REFLECTING OFF THE LENSES OF INDY'S BINOCULARS\n</b>\n<b>\t\t\tHENRY\n</b>\t\tWhat do you think you're doing?!\n\t\tGet down!\n\n<b>\t\t               INDY\n</b>\t\tDad, we're well out of range.\n\n\tAt that moment the tank FIRES A SHELL in their direction.\n\n\tIt WHISTLES overhead and BLOWS UP THE PARKED CAR. INDY, HENRY and\n\tSALLAH cover their heads as automobile fragments rain down upon them.\n\n<b>\t\t               SALLAH\n</b>\t\tThat car belonged to my brother-\n\t\tin-law.\n\n<b>\t\t\tINDY\n</b>\t\t      (gesturing to the\n\t\t       others)\n\t\tCome on--come on!\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\n<b>\t\t               VOGEL\n</b>\t\tI can't see anyone up there.\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t               DONOVAN\n</b>\t\tMaybe it wasn't even Jones.\n\n<b>\t\t               ELSA\n</b>\t\tNo. It's him all right. He's\n\t\there somewhere.\n\n<b>\t\t\tDONOVAN\n</b>\t\t      (to VOGEL)\n\t\tPut Brody in the tank.\n\n\tKAZIM peers over a rock, pointing his rifle at the group below.\n\n<b>\t\t\tDONOVAN\n</b>\t\t      (to ELSA)\n\t\tWell, in this sun, without\n\t\ttransportation, they're as good\n\t\tas dead.\n\n\tBULLETS EXPLODE off the vehicles and cliff. DONOVAN and ELSA duck.\n\n\tA NAZI SOLDIER falls from the tank as BULLETS EXPLODE around him.\n\n\tKAZIM'S MEN, BRETHREN OF THE CRUCIFORM SWORD, continue to FIRE. ELSA\n\tand DONOVAN take cover beside the parked car.\n\n<b>\t\t               DONOVAN\n</b>\t\tIt's Jones, all right.\n\n\n<b>\tANGLE ON INDY'S GROUP\n</b>\n\tINDY and HENRY, followed by SALLAH, take cover behind a rock to watch\n\tKazim's Men and the Nazi Troops exchanging fire below them.\n\n<b>\t\t               HENRY\n</b>\t\tNow, who are all these people?\n\n<b>\t\t               INDY\n</b>\t\tWho cares? As long as they're\n\t\tkeeping Donovan busy. Dad, you\n\t\tstay here while Sallah and I\n\t\torganize some transportation.\n\n\tCUT BACK to the action. The BRETHREN are firing at the\n\tDONOVAN party and are being fired on by the Donovan party.\n\n\tTWO NAZI SOLDIERS throw HAND GRENADES into the cliffs. They EXPLODE,\n\tkilling one of Kazim's Brethren.\n\n\tThe battle continues\u0097a fierce exchange of GUNSHOTS, GRENADES and\n\tMACHINE GUN FIRE with losses on both sides.\n\n<b>\tINDY AND SALLAH\n</b>\n\tcrouch behind a rock watching as men on both sides of the battle run amongst\n\tcamels and horses.\n\n<b>\t\t\tINDY\n</b>\t\tI'm going after those horses.\n\n<b>\t\t\tSALLAH\n</b>\t\tI'll take the camels.\n\n<b>\t\t\tINDY\n</b>\t\tI don't need camels.\n\n<b>\t\t\tSALLAH\n</b>\t\tBut, Indy\u0097\n\n<b>\t\t\tINDY\n</b>\t\tNo camels!\n\n\n<b>\tDONOVAN AND ELSA\n</b>\n\tThey look down at KAZIM who lies mortally wounded on the ground at their feet.\n\tELSA looks saddened.\n\n<b>\t\t\tDONOVAN\n</b>\t\t      (re KAZIM)\n\t\tWho is he?\n\n<b>\t\t               KAZIM\n</b>\t\tA messenger from God. For the\n\t\tunrighteous, the Cup of Life\n\t\tholds everlasting damnation.\n\n\tKAZIM dies.\n\n\n<b>\tINDY\n</b>\n\tleaps atop a TURKISH SOLDIER on horseback, pulling the man and the horse to\n\tthe ground. A SECOND TURK comes to assist his comrade; INDY mounts the\n\thorse, knocking both Turks to the ground.\n\n\n<b>\tINT. THE TANK - DAY\n</b>\n\tBRODY has been left alone in the tank. HENRY climbs down into the tank and\n\ttaps Brody on the shoulder, startling him.\n\n<b>\t\t               HENRY\n</b>\t\tMarcus!\n\n<b>\t\t               BRODY\n</b>\t\tArghhh! Oh!\n\n\n<b>CONTINUED:\n</b>\n\tThey exchange an old University Club toast, swinging their arms at one another\n\tand missing. Then HENRY flaps his arms and tugs his ears.\n\n<b>\t\t\tHENRY\n</b>\t\t\"Genius of the Restoration\u0097\"\n\n\tNow BRODY tugs his ears, flaps his arms and touches his head.\n\n<b>\t\t\tBRODY\n</b>\t\t\"\u0097aid our own resuscitation!\"\n\n\tThey exchange a handshake.\n\n<b>\t\t\tBRODY\n</b>\t\tHenryl What are you doing here?!\n\n<b>\t\t\tHENRY\n</b>\t\tIt's a rescue, old boys Come on.\n\n\n\tAs HENRY starts to climb out of the tank, TWO NAZI SOLDIERS DROP DOWN from\n\tabove, their Lugers drawn. They are followed by VOGEL.\n\n<b>\t\t\tVOGEL\n</b>\t\t       (re HENRY)\n\t\tSearch him.\n\n\tThe NAZI SOLDIERS point their guns at HENRY and BRODY.\n\n<b>\t\t\tVOGEL\n</b>\t\t       (to HENRY)\n\t\tWhat is in this book? That\n\t\tmiserable little Diary of yours!\n\n\tVOGEL removes a glove and slaps HENRY with it.\n\n<b>\t\t\tVOGEL\n</b>\t\tHere's the map. The book is\n\t\tuseless, and yet you come all the\n\t\tway back to Berlin to get it.\n\t\tWhy? \n\n\tHe slaps HENRY again.\n\n<b>\t\t\tVOGEL\n</b>\t\tWhat are you hiding?\n\n\tAnother slap.\n\n<b>\t\t\tVOGEL\n</b>\t\tWhat does the Diary tell you that\n\t\tit doesn't tell us?!\n\n\tVOGEL reaches out to slap HENRY yet again, but Henry grabs his arm, stopping\n\thim.\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               HENRY\n</b>\t\tIt tells me that goose-stepping\n\t\tmorons like yourself should try\n\t\treading books instead of burning\n\t\tthem.\n\n\tDONOVAN appears at the turret cover.\n\n<b>\t\t               DONOVAN\n</b>\t\tColonel? Jones is getting away.\n\n<b>\t\t               VOGEL\n</b>\t\t        (indicating HENRY)\n\t\tI think not, Herr Donovan.\n\n\n<b>\tEXT. TANK - DAY\n</b>\n<b>\t\t               DONOVAN\n</b>\t\tNot that Jones\u0097the other Jones!\n\n<b>\t\t               NAZI SOLDIER\n</b>\t\tHerr Colonel!\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\n\tINDY rides away on one horse, leading three others as he goes.\n\n\tSALLAH approaches on horseback leading five camels.\n\n<b>\t\t               INDY\n</b>\t\tSallah, I said no camels! That's\n\t\tfive camels. Can't you Count?\n\n<b>\t\t               SALLAH\n</b>\t\tCompensation for my brother-in-\n\t\tlaw's car. Indy, your father and\n\t\tBrody\u0097\n\n<b>\t\t               INDY\n</b>\t\tWhere's my father?\n\n<b>\t\t               SALLAH\n</b>\t\tThey have them. In the belly of\n\t\tthat steel beast.\n\n\tINDY and SALLAH charge forward leading their horses and camels.\n\n\tThen VOGEL commands the Tank Driver to give chase.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tVOGEL shouts to the Tank Driver.\n\n<b>\t\t\tVOGEL\n</b>\t\tFire!\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\n\n\tThe tank starts firing at INDY on horseback. Indy zigs and zags as the tank fires\n\ttwo rounds at Indy, barely missing him. Each time Indy emerges from the plume\n\tof desert dust, hanging like a toadstool in the air.\n\n\n<b>\tINT. TANK- DAY\n</b>\n\tHENRY and BRODY hold their hands over their ears.\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\n\tDONOVAN shouts orders to the Troops. INDY is followed by various vehicles in\n\tthe caravan.\n\n\tINDY notices that the side gun that is now firing at him can only pivot so far.\n\tIndy makes a mental note of this and while riding right in front of the tank,\n\tturns his horse completely around, 180 degrees. The tank starts to follow.\n\n\n<b>\tPOV THROUGH THE VIEWING PORT\n</b>\n\tVOGEL watches the ground turning 180 degrees as he tries to catch up with\n<b>\tINDY.\n</b>\n\tCleverly, INDY has turned the tank directly into a head-on\n\tcollision course with some of the pursuit vehicles and a Kubelwagon.\n\n\tThe tank and the Kubelwagon smash into each other, the German military sedan\n\tbecoming lodged between the treads while blocking the front view and any use of\n\tthe six-pound cannon on the turret.\n\n\tINDY, meanwhile, leans down on his horse, scooping up a stone from the wall of\n\ta culvert. He reigns his horse, paralleling the tank, as everyone scurries about\n\tinside, looking through viewing ports, trying to figure out exactly where Indy is.\n\n\n<b>\tINT. TANK- DAY\n</b>\n\tVOGEL shouts to the Gunner.\n\n<b>\t                                      VOGEL\n</b>\t\tDer Kubelwagon sprengen!\n\n\tThe Gunner puts a shell into the large gun. He FIRES, CATAPULTING THE\n\tKUBELWAGON into the air, where it EXPLODES.  The tank drives through the\n\tresulting smoke an dust, then rolls over the Kubelwagon, crushing it\n<b>\t\n</b><b>\tEXT. DESERT VALLEY - DAY\n</b>\n\tINDY gallops up to the side cannon and jams the stone down the barrel, lodging\n\tseveral rocks inside. Then he steers his horse directly in range of that gun.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tA NAZI SOLDIER pushes HENRY away from the window.\n\n<b>\t                              \tNAZI SOLDIER\n</b>\t\tKeine Bewegung.\n\n\tHe points his gun at HENRY and BRODY.\n\n<b>\t\t\tNAZI SOLDIER\n</b>\t\tKeine Bewegung.\n\n\tThe smaller gun, blocked by the rocks, BACKFIRES, blowing the breech out into\n\tthe face of the gunner, killing him and filling the tank with smoke.\n\n\tBRODY, HENRY, VOGEL and the driver begin to choke.\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\n\tINDY rides his horse alongside the tank.\n\n<b>\t\t\tINDY\n</b>\t\tDad!  Dad!  Dad!\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tHENRY and BRODY still held at gunpoint by the NAZI SOLDIER.\n\n<b>\t\t\tHENRY\n</b>\t\tJunior? Junior? Junior!\n\n\tThe NAZI SOLDIER swings his fist, knocking HENRY off his seat.\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\n\tSmoke pours from the top of the tank as the turret pops open. VOGEL emerges\n\tand aims his gun at INDY.\n\n\tINDY and VOGEL EXCHANGE SHOTS as Indy chases the tank on his horse.\n\n\tINDY pulls the trigger again\u0097his gun is empty! Indy immediately takes the\n\thigh trail.\n\n\tNow INDY is above the tank twelve feet on a paralleling trail. He moves out of\n\tthe saddle and leaps from the speeding horse onto the trundling tank.\n\n\n<b>\tCLOSE UP - VOGEL\n</b>\n\tHate-staring at INDY\n\n<b>\tCLOSE UP - INDY\n</b>\n\tHate-staring back at VOGEL.\n\nSuddenly, from nowhere a German soldier flies INTO FRAME, tackling Indy.\n\n<b>\t\t\t\t\tCUT TO:\n</b>\n<b>\tSIDE ANGLE\n</b>\n\tOne of the two troop carriers is paralleling the tank and like pirates boarding a\n\tgalleon, Nazi Soldiers leap over the treads and are swarming all over INDY.\n\n\tINDY is struggling with a German's Luger.\n\n\tINDY presses the luger against his assailant and forces the Nazi to squeeze off a\n\tshot into himself. The bullet not only passes through the Nazi, but passes\n\tthrough two other Nazis standing directly behind him on the crowded tank top\n\tand three bodies fall away, leaving Indy to stare at the gun in disbelief.\n<b>\t\n</b>\tAnother Soldier leaps from the truck onto the tank and raises his knife as he\n\tgrabs INDY. They struggle and fall.\n\n\tINDY sits up to see VOGEL standing over him. Vogel wraps a chain around Indy's\n\tneck.\n\n\n<b>\tINT. TANK- DAY\n</b>\n\tINDY appears at the entrance, the chain still wrapped about his neck and held by\n<b>\tVOGEL.\n</b>\n<b>\t\t\tINDY\n</b>\t\tDad!\n\n\tHe drops the gun down into the tank.\n\n<b>\t\t\tINDY\n</b>\t\tDad! Dadl Get it!\n\n\tVOGEL pulls INDY from the tank entrance, yanking on the chain wrapped around\n\this neck.\n\n\n<b>\tEXT. TANK - DAY\n</b>\n\tA NAZI SOLDIER approaches.\n\n\tINDY hits him, knocking him onto the tank tread. The Nazi Soldier screams as he\n\tis dragged under the rolling tank.\n\n\tNow INDY and VOGEL struggle with one another, the chain still wrapped around\n\tIndy's neck.\n\n\n<b>\tINT. TANK- DAY\n</b>\n<b>\tTHROUGH THE PERISCOPE\n</b>\n\tWe SEE INDY and VOGEL struggling atop the tank. Indy lifts his feet, lunging\n\ttoward the periscope and pulling Vogel with him.\n\n\tINDY's face is pressed up against the lens of the periscope.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tThe NAZI SOLDIER looking through the periscope pulls away from it, smiles, then\n\tturns back to it.\n\n\n<b>\tTHROUGH THE PERISCOPE\n</b>\n\tINDY's face, still pressed against the lens.\n\n\tVOGEL pulls INDY from the periscope.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tThe NAZI SOLDIER pulls away from the periscope again.\n\n<b>\t\t\tPERISCOPE SOLDIER\n</b>\t\t        (laughing)\n\t\tDiese Amerikane. Sie Kampfen wie\n\t\tWeiber.\n\n<b>\tEXT. TANK - DAY\n</b>\n\tINDY now lies on top of VOGEL. He kicks out at the periscope which spins\n\taround.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tThe periscope handle spins around and hits the PERISCOPE SOLDIER in the head.\n\tHe falls against the NAZI SOLDIER guarding HENRY and BRODY.\n\n\tHENRY pushes the NAZI SOLDIER aside and grabs the gun. The PERISCOPE\n\tSOLDIER struggles to take the gun from Henry.\n\n\n<b>\tEXT. TANK- DAY\n</b>\n\tVOGEL holds the chain around INDY's neck, pushing his head downward toward\n\tthe revolving tread.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tThe PERISCOPE SOLDIER holds HENRY from behind, forcing the gun toward him.\n\tHenry reaches down and pulls a fountain pen from his coat pocket.\n\n\n\n<b>CONTINUED:\n</b>\n\tAs the PERISCOPE SOLDIER pulls on HENRY's face, Henry lifts the fountain pen\n\tand squirts ink into his face. The Soldier falls, his head smashing into the wall of\n\tthe tank. At the same time, Henry loses his grip on the gun which falls to the\n\tfloor.\n\n\n<b>\t\t\tBRODY\n</b>\t\tHenry, the pen\u0097\n\n<b>\t\t\tHENRY\n</b>\t\tWhat?\n\n\n<b>\t\t               BRODY\n</b>\t\tBut don't you see? The pen is\n\t\tmightier than the sword.\n\n\n<b>\tEXT. DESERT VALLEY - DAY\n</b>\n\tA troop truck pulls near the tank.\n\n\n<b>\tINT. TANK- DAY\n</b>\n\tHENRY fires the TANK GUN at the troop truck. SOLDIERS FLY INTO THE AIR.\n\tThe TROOP TRUCK flips over and EXPLODES.\n\n\n<b>\tEXT. TANK - DAY\n</b>\n\tThe EXPLOSION knocks INDY off the tank and onto the tread. He grabs onto the\n\tshredded gun protruding from the side of the tank.\n\n\tVOGEL looks down at INDY and smiles smugly.\n\n\tThe tank is approaching a cliff wall. As INDY tries to secure footing, VOGEL\n\tsteps on his hands.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tBRODY looks at HENRY.\n\n<b>\t\t\tBRODY\n</b>\t\tLook what you didl\n\n<b>\t\t               HENRY\n</b>\t\tIt's war.\n\n\n<b>\tEXT. TANK - DAY\n</b>\n\tVOGEL now swings a shovel at INDY, smashing at his hands.\n\n\tBRODY climbs up out of the tank, followed by HENRY.\n\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tHENRY\n</b>\t\tDidn't I tell you it was a rescue,\n\t\thuh?\n\n\tA NAZI SOLDIER appears and pulls HENRY down.\n\n\tVOGEL raises the shovel above his head and brings it crashing down on INDY,\n\tstill hanging from the protruding gun.\n\n\tINDY loses his grip and now hangs from the gun suspended only by the strap of\n\this leather pouch. He screams as the gun scrapes against the cliff wall, sending\n\tstones tumbling down over him.\n\n\n<b>\tINT. TANK - DAY\n</b>\n\tThe NAZI SOLDIER knocks HENRY into a pile of boxes, then punches him in the\n\tface.\n\n\tAs the SOLDIER raises the gun to HENRY's face, BRODY hits him over the head\n\twith a canister. The Soldier falls, discharging the gun into the air.\n\n\tThe BULLET RICOCHETS around the tank, past the Tank Driver who is\n\tmanipulating levers at the control panel. SPARKS FLY; then the BULLET PINGS\n\tAGAINST THE WINDOW and RICOCHETS ONCE MORE, this time passing THROUGH\n\tTHE TANK DRIVER'S HAT. Blood flows from under the hat as the Tank Driver\n\tslumps forward, his body depressing the levers.\n\n\n<b>\tEXT. TANK - DAY\n</b>\n\tINDY still hangs from the strap of his leather pouch as the tank swerves, barely\n\tmissing the rocks and causing VOGEL to fall. Indy finally manages to pull\n\thimself atop the tank once more where he punches Vogel over the side, then\n\tpeers down to HENRY, still inside the tank.\n\n<b>\t\t\tINDY\n</b>\t\tDad?\n\n<b>\t\t\tHENRY\n</b>\t\tYou call this archaeology?\n\n<b>\t\t\tINDY\n</b>\t\tGet out of there, Dad!\n\n\tINDY pulls HENRY and BRODY from the tank. VOGEL pulls himself back atop the\n\ttank armed again with the shovel which he swings at Indy, who ducks and grabs\n\tVogel's arm.\n\n<b>\t\t\tBRODY\n</b>\t\tHow does one get off this thing?\n\n\tAs INDY winds up to punch VOGEL he catches BRODY in the face on the\n\tbackswing, then completes the movement and knocks Vogel down.\n\n<b>\tINT. TANK - DAY\n</b>\n\tVogel's hat sails in and falls to the floor.\n\n\n<b>\tEXT. TANK- DAY\n</b>\n<b>\t\t\tHENRY\n</b>\t\t        (to INDY)\n\t\tWhere's Marcus?!\n\n\tBefore INDY can answer, VOGEL is up and swinging with the shovel. Indy ducks\n\tbut the shovel catches HENRY sending him over the side and onto the moving\n\ttread.\n\n\tINDY grabs his whip, knocking VOGEL aside.\n\n\tAs HENRY speeds toward the front of the tank to certain doom, INDY, with\n\tlightning speed, whips out his bullwhip, wrapping the end of the whip around\n\tHenry's right ankle.\n\n<b>\t\t\tINDY\n</b>\t\tDad!\n\n\tHENRY is bouncing across the treads like a rag-doll. INDY struggles to hold onto\n\tthe end of the bullwhip.\n\n<b>\t\t\tINDY\n</b>\t\tHang on, Dad!\n\n\tSALLAH draws his horse next to the treads. He tips his fez to HENEY.\n\n<b>\t\t               SALLAH\n</b>\t\tFather of Indy\u0097give me your\n\t\thand!\n\n\tVOGEL now punches INDY in the back and grabs him around the neck. Still,\n\tINDY refuses to let go of the whip.\n\n<b>\t\t\tINDY\n</b>\t\tSallah! Get Dadl\n\n\tSALLAH reaches out to HENRY.\n\n<b>\t\t               SALLAH\n</b>\t\tGive me your hand!\n\n\tSALLAH manages to hold onto HENRY as he brings his horse to a stop just at the\n\tcliff's edge.\n\n\tINDY finally frees himself of VOGEL's grasp, twisting his arm painfully away\n\tfrom Indy's neck, then landing a hard blow to Vogel's head.\n\n\n<b>\tINDY\n</b>\n\tlooks down at the fast-approaching cliff, his face filled with horror.  We SEE his\n\tHAT BLOW OFF and sail over the cliff's edge.\n\n<b>\tVOGEL\n</b>\n\tHe sees his life passing before him, he screams at the top\n\tof his lungs!\n\n\n<b>\tLONG SHOT\n</b>\n\tThe tank trundles over the cliff and PLUMMETS TO THE BOTTOM.\n\n\n<b>\tEXT. CLIFF EDGE - DAY\n</b>\n\tHENRY, BRODY and SALLAH look down at the flaming wreckage\n\tof the tank.\n\n<b>\t\t\tHENRY\n</b>\t\tJunior?!\n\n\tWe HEAR the TANK EXPLODING.\n\n<b>\t\t\tSALLAH\n</b>\t\tIndy?!\n\n\n<b>\t\t               HENRY\n</b>\t\tOh, God. I've lost him. And I\n\t\tnever told him anything. I just\n\t\twasn't ready, Marcus. Five\n\t\tminutes would have been enough.\n\n\tAnd then... looking dazed and bewildered, INDY STAGGERS UP BEHIND THEM.\n\tHe joins the others at the edge of the cliff, looking down at the wreckage below\n\twith a bewildered expression.\n\n\tFinally, Henry becomes aware of his presence.\n\n\tHENRY says nothing. He just looks at Indy, overcome with emotion. Finally, he\n\tthrows his arms around him.\n\n<b>\t\t\tHENRY\n</b>\t\tI thought I'd lost you, boy.\n\n\tAfter a moment, Indy's head clears. And he becomes aware of his father's\n\tembrace. Something he hasn't felt in a long time\u0097if ever. And it touches him.\n\tHe hugs his father back.\n\n<b>\t\t               INDY\n</b>\t\tI thought you had too, sir.\n\n\tBRODY and SALLAH are moved by this sudden reconciliation.\n\n<b>\t\t\tHENRY\n</b>\t\tWell\u0097well done! Come on!\n\n\tHENRY pats INDY on the back and Indy collapses, sitting hard on the rocky cliff\n\tedge.\n\n\n\n<b>CONTINUED:\n</b>\n\tUnaware, HENRY, SALLAH and BRODY start to walk away. Henry turns back to\n\tsee INDY still sitting on the ground.\n\n<b>\t\t               HENRY\n</b>\t\tLet's go then. why are you\n\t\tsitting there resting when we're\n\t\tso near the end? Come on\u0097\n\t\tlet's go!\n\n\tHENRY turns and walks toward the horse with BRODY and SALLAH. Suddenly\n\tthe FEDORA, borne on the wind, BLOWS INTO SCENE and lands at INDY's feet.\n\n\n<b>\tEXT. MOUNTAIN ROAD - DAY\n</b>\n\tDONOVAN peers through binoculars to see the CANYON OF THE CRESCENT\n\tMOON. He lowers the binoculars and turns to ELSA.\n\n<b>\t\t\tDONOVAN\n</b>\t\tThe Canyon of the Crescent Moon.\n\n\tNow ELSA peers through the binoculars.\n\n\n<b>\tEXT. SECRET CANYON - DAY\n</b>\n\tINDY, HENRY, SALLAH and BRODY ride into the canyon. They hear a WAILING\n\tWIND. Feel the biting cold. And sense the danger.\n\n\tNow we turn a corner and they see the hidden city. Its spectacular Grecian\n\tfacade is carved directly into the rock. It is a stunning sight. The vehicles,\n\tcamels and horses belonging to DONOVAN's party have been left at the entrance.\n\n<b>\t\t\t\t\tCUT TO:\n</b>\n\n<b>\tINT. TEMPLE - DAY\n</b>\n\tINDY, SALLAH, HENRY AND BRODY creep forward to see:\n\n<b>\tTHE TERRIFIED FACE OF A TURKISH SOLDIER\n</b>\n\tHe's walking slowly. Eyes darting. Muttering a prayer under his breath.\n\tWhat's going on here?\n\n\n<b>\tFULL SHOT - INSIDE THE MOUNTAIN TEMPLE\n</b>\n\tTHE TURK stands alone in the center of the Temple. It is very dark. GIANT\n\tCOLUMNS define the Temple's perimeter.\n\n<b>\tELSA AND DONOVAN\n</b>\n\twatch him from a safe distance.\n\n<b>\tTHE TURK\n</b>\n\tis about to approach the spot where a TURKISH SOLDIER LIES DEAD. We don't\n\tnotice it right away, but the dead soldier has been DECAPITATED.\n\n\tTHE TURK stops\u0097only one step away from the beheaded soldier.\n\n\n<b>\tTHE TURK\n</b>\n\ttakes one more step\u0097a fatal step, it turns out. We hear a ROAR\u0097A WHOOSH\n\tof air\u0097but we SEE NOTHING\u0097except THE TURK'S HEAD FLY OFF AND\n\tBOUNCE across the ground.\n\n\n<b>\tINDY, HENRY, BRODY AND SALLAH\n</b>\n\treact to the sight.\n\n\n<b>\tELSA AND DONOVAN\n</b>\n\tShe looks at him, horrified.\n\n\n<b>\t\t\tDONOVAN\n</b>\t\tHelmut, another volunteer!\n\n\tTWO NAZI SOLDIERS force another Turk forward. Suddenly...\n\n\n\tThe SOUND OF RIFLE BOLTS being cocked. Everyone turns to discover INDY and\n\this party surrounded by NAZI SOLDIERS. Indy's group are relieved of their guns.\n\n\n<b>\tFULL SHOT - THE TEMPLE\n</b>\n\tINDY, HENRY, BRODY and SALLAH are brought forward by the Nazi Soldiers.\n\n\n\tELSA's eyes light up: glad Indy's not dead. she controls herself and continues\n\tmore coldly.\n\n<b>\t\t\tELSA\n</b>\t\t       (to INDY)\n\t\tI never expected to see you again.\n\n<b>\t\t                INDY\n</b>\t\tI'm like a bad penny. I always\n\t\tturn up.\n\n<b>\t\t                DONOVAN\n</b>\t\tStep back now, Doctor Schneider.\n\t\tGive Doctor Jones some room. He's\n\t\tgoing to recover the Grail for us.\n\n\n\n<b>CONTINUED:\n</b>\n\tINDY laughs.\n\n<b>\t\t               DONOVAN\n</b>\t\tImpossible? What do you say,\n\t\tJones? Ready to go down in\n\t\thistory?\n\n<b>\t\t\tINDY\n</b>\t\tAs what? A Nazi stooge like you?\n\n<b>\t\t\tDONOVAN\n</b>\t\t       (scornfully)\n\t\tNazis?!\u0097Is that the limit of\n\t\tyour vision?! The Nazis want to\n\t\twrite themselves into the Grail\n\t\tlegend and take on the world.\n\t\tWell, they're welcome. But I want\n\t\tthe Grail itself. The cup that\n\t\tgives everlasting life.\n\t\tHitler can have the world, but\n\t\the can't take it with him. I'm\n\t\tgoing to be drinking my own health\n\t\twhen he's gone the way of the\n\t\tDodo.\n\t\t      (he draws his\n\t\t       pistol)\n\t\tThe Grail is mine, and you're\n\t\tgoing to get it for me.\n\n<b>\t\t\tINDY\n</b>\t\tShooting me won't get you anywhere.\n\n<b>\t\t               DONOVAN\n</b>\t\tYou know something, Doctor Jones?...\n\t\tyou're absolutely right.\n\n\tThen DONOVAN shifts his aim, just a bit, and SHOOTS HENRY. The bullet enters\n\this side below the ribs.\n\n<b>\t\t\tINDY\n</b>\t\tDad?!\n\n<b>\t\t\tHENRY\n</b>\t\tJunior. . .\n\n<b>\t\t\tELSA\n</b>\t\tNo!!\n\n<b>\t\t\tDONOVAN\n</b>\t\t     ( to ELSA)\n\t\tGet back!\n\n\tHENRY collapses. Blood flowing from the wound. BRODY and SALLAH rush to\n\this assistance.\n\n\n\n<b>CONTINUED: (2)\n</b>\n\n\tINDY spins toward DONOVAN with murder in his eyes.\n\n\tDONOVAN points the gun at him:\n\n<b>\t\t\tDONOVAN\n</b>\t\tYou can't save him when you're\n\t\tdead.\n\n\tINDY hesitates.\n\n<b>\t\t               DONOVAN\n</b>\t\tThe healing power of the Grail is\n\t\tthe only thing that can save your\n\t\tfather now. It's time to ask yourself\n\t\twhat you believe.\n\n\tINDY takes in the situation. The two decapitated men lie a few yards in front of\n\thim. He walks to the entranceway, flanked by two stone lions. We get silent\n\treaction shots\u0097ELSA\u0097SALLAH\u0097BRODY\u0097DONOVAN\u0097registering their\n\tdifferent emotions\n\n\tINDY proceeds forward. His hands open the Grail Diary.\n\n<b>\t\t               INDY\n</b>\t\t\"The Breath of God... Only the\n\t\tpenitent man will pass. Only\n\t\tthe penitent man will pass. . . \"\n\n\tINDY takes a few steps forward.\n\n<b>\t\t               INDY\n</b>\t\t\"The penitent man will pass.\n\t\tThe penitent man...\"\n\n\tINDY stops. He is about to reach the spot where two men have just died.\n\n\tHENRY looks at INDY. Indy looks at Henry.\n\n<b>\t\t\tHENRY\n</b>\t\t        (in a raspy voice)\n\t\t\"Only the penitent man will pass.\n\t\tOnly the penitent man will pass.\"\n\n<b>\t\t\tINDY\n</b>\t\t        (quietly to himself)\n\t\tThe penitent man will pass. The\n\t\tpenitent... the penitent. The\n\t\tpenitent man...\n\n<b>\t\t\tHENRY\n</b>\t\tThe penitent man. The penitent...\n\n\tINDY takes a step forward through the cobwebs.\n\n\n\n<b>CONTINUED: (3)\n</b>\n\n<b>\t\t\tINDY\n</b>\t\tThe penitent man is humble before\n\t\tGod.\n\n<b>\t\t\tHENRY\n</b>\t\tPenitent. Penitent...\n\n<b>\t\t\tINDY\n</b>\t\tThe penitent man is humble...\n\n\tThe cobwebs begin to move....\n\n<b>\t\t\tINDY\n</b>\t\tHe kneels before God.\n\t\t       (to himself; suddenly)\n\t\tKneel!!\n\n\tWe hear the awful rush of air\u0097WHOOSH! Because INDY is in the act of\n\tkneeling, only his hat is knocked off and his hair flies in his face.\n\n\tInstinctively he ROLLS FORWARD on the ground out of harm's way and looks up.\n\tFrom his new position he is able to see what is causing all the trouble: A RAZOR\n<b>\tSHARP TRIPLE PENDULUM.\n</b>\n\tINDY gets cautiously to his feet. Now he sees the pendulum has been guarding a\n\tSMALL CORRIDOR which turns a corner to the left fifty yards ahead. Wooden\n\twheels turn\u0097the mechanism controlling the spinning blades. INDY loops a rope\n\taround the wheels, jamming the mechanism and stopping the blades in mid-swipe.\n\n<b>\t\t\tINDY\n</b>\t\tI'm through!\n\n\n<b>\tELSA AND DONOVAN\n</b>\n<b>\t\t\tDONOVAN\n</b>\t\tWe're through!\n\n\tBRODY and SALLAH smile, relieved.\n\n<b>\t\t\tSALLAH\n</b>\t\t      (to HENRY)\n\t\tHe's all right.\n\n\tHENRY shakes his head.\n\n<b>\t\t\tHENRY\n</b>\t\tNo.\n\n<b>\tBACK TO INDY\n</b>\n\tholding the Grail Diary, reading once again, his fedora now covered in cobwebs.\n\n\n<b>\t\t\tINDY\n</b>\t\t\"The second challenge is the\n\t\t Word of God. Only in the\n\t\tfootsteps of God will he proceed.\"\n\t\t       (to himself)\n\t\tThe Word of God... The Word of...\n\n\n\tINDY pulls away some cobwebs to reveal a cobblestone path. Each cobble is\n\tengraved with a letter.\n\n<b>\t\t\tINDY\n</b>\t\t\"Proceed in the footsteps of the\n\t\tWord.\"\n\n\n\n<b>\tHENRY\n</b>\n\tlifts his head painfully.\n\n\n<b>\t\t\tHENRY\n</b>\t\tThe Word of God...\n\n\n\n<b>\t\t\tBRODY\n</b>\t\tNo, Henry. Try not to talk.\n\n\n<b>\t\t\tHENRY\n</b>\t\tThe Name of God...\n\n<b>\tBACK TO INDY\n</b>\n\tas he studies the cobblestones before him.\n\n\n<b>\t\t\tINDY\n</b>\t\tThe Name of God... Jehovahl\n\n\n\n<b>\tHENRY\n</b>\n\tstill lies in SALLAH's arms. BRODY leans over him.\n\n\n<b>\t\t\tHENRY\n</b>\t\tBut in the Latin alphabet,\n\t\t\"Jehovah\" begins with an \"I.\"\n\n\n<b>\tBACK TO INDY\n</b>\n\n<b>\t\t\tINDY\n</b><b>\t\t\"J.\"\n</b>\n\tINDY takes a step and immediately a stone breaks away and INDY falls up to his\n\thip -- his leg stuck through the hold where the stone once was.\n\n<b>\tHENRY\n</b>\n\treacts.\n\n\n<b>\t\t               HENRY\n</b>\t\tOh dear!\n\n<b>\tBACK TO INDY\n</b>\n\twho grunts as he pulls himself from the hole, the v-rail Diary in his hand.\n\n<b>\t\t               INDY\n</b>\t\tIn Latin, \"Jehovah\" starts with\n\t\tan \"I.\" \"I\"...\n\n\tNow we SEE each letter on the stones as INDY carefully walks forward.\n\tDONOVAN and ELSA follow in his footsteps.\n\n<b>\t\t\tINDY\n</b><b>\t\t\"E\"... \"H\"... \"O\"... \"V\"... \"A\"...\n</b>\n\n\tINDY sighs with relief and steps forward to:\n\n\n<b>\tTHE GREAT ABYSS\n</b>\n\tINDY stands in a small opening, just small enough for his shoulders to squeeze\n\tthrough and beyond that a 100 foot drop to the rocks below and 100 feet across,\n\tnothing but a rough, stony cliff wall.\n\n\n<b>\tBACK TO INDY\n</b>\n\tHe can see nowhere to cross. He looks again to the v-rail Diary.\n\n<b>\t\t               INDY\n</b>\t\t\"The path of flood. Only in the\n\t\tleap from the lion's head will\n\t\the prove his worth.\"\n\n\tINDY looks around and then he notices that inscribed into\n\tthe rock above his head is the head of a lion.\n\n<b>\t\t\tINDY\n</b>\t\tImpossiblel Nobody can jump this!\n\n\tINDY looks down into the Diary and tortures over what it\n\tis asking him to do.\n\n\n<b>\tBRODY\n</b>\n\trushes forward and calls to INDY.\n\n<b>\t\t\tBRODY\n</b>\t\tIndy... Indy, you must hurry!!\n\t\tCome quickly!\n\n<b>\tBACK TO INDY\n</b>\n<b>\t\t\tINDY\n</b>\t\t     (realizing)\n\t\tIt's... a leap of faith. Oh,\n\t\tGod.\n\n<b>\tHENRY\n</b>\n\tcalls to his son.\n\n\n<b>\t\t               HENRY\n</b>\t\tYou must believe, boy. you must...\n\t\tbelieve.\n\n\tWe see him do it. We see him leap into space. We see that he is in midair. We\n\tsee that he is not going to make it. His hands claw for the opposite wall but he is\n\tgoing to fall 100 feet to his death. And then\u0097he doesn't! He appears to be held\n\tup by thin air as he lands on his hands and knees.\n\n\tINDY looks around and down and now he figures it out.\n\n\tIngeniously, the First Crusaders have painted a pathway to align with the rocks\n\t100 feet below. It is a perfect forced perspective image of the rocks below with\n\tlines from a hundred feet continuing six feet below his sight line where his feet\n\tare stepping.\n\n\tIt's painted to blend in with the rocks below. Highly evolved camouflage... in\n\tperfect alignment with everything we see below.\n\n\tWhen INDY leans out to the left or right... that's when he sees the perfect\n\talignment shift that betrays the trick. Indy throws some dirt on the bridge and\n\the crosses it like the first Crusader from the painting over Henry's desk.\n\n\tIndy crawls through a small opening in the side of the cliff and enters a Temple.\n\n\tA vast array of chalices is displayed on the altar of this small Temple. Perhaps a\n\thundred or more. Many sizes, many shapes, some gold, some silver, but they all\n\tglitter and shine.\n\n\tINDY is mesmerized by their number and their beauty. And then he realizes that\n\ta man is praying at the altarl\n\n\tHe has his back turned to INDY... but he is dressed as what he is! A GRAIL\n<b>\tKNIGHT.\n</b>\n\n<b>\tCLOSE ON THE GRAIL KNIGHT\n</b>\n\tBut we can't see the Grail Knight's face. The visor of his helmet is down.\n\tPerhaps we see his eyes.\n\n\n\n<b>CONTINUED:\n</b>\n\tWhen the GRAIL KNIGHT sees INDY he gets wearily to his feet and, surprisingly,\n\tprepares to give combat...taking up his two-handed broadsword...he comes at\n\tIndy, attempting to swing the huge, heavy sword but finding the effort almost too\n\tmuch. Indy dodges two or three clumsy swings of the sword, making no attempt\n\tto fight back...until the Knight, exhausted, drops the sword and collapses. Indy\n\tapproaches him and raises the visor and we see that the Knight is a very ancient\n\tman.\n\n<b>\t\t               KNIGHT\n</b>\t\tI knew you'd come, but my strength\n\t\thas left me.\n\n<b>\t\t               INDY\n</b>\t\tWho are you?\n\n<b>\t\t               KNIGHT\n</b>\t\tThe last of three brothers who\n\t\tswore an oath to find the Grail\n\t\tand to guard it.\n\n<b>\t\t               INDY\n</b>\t\tThat was seven hundred years ago.\n\n<b>\t\t               KNIGHT\n</b>\t\tA long time to wait.\n\n\tThe GRAIL KNIGHT reaches forward and fingers Indy's clothing.\n\n<b>\t\t               KNIGHT\n</b>\t\tYou're strangely dressed...for a\n\t\tknight.\n\n<b>\t\t               INDY\n</b>\t\tI'm not exactly...a knight. What\n\t\tdo you mean?\n\n<b>\t\t               KNIGHT\n</b>\t\tI was chosen because I was the\n\t\tbravest and the most worthy. The\n\t\thonor was mine until another came\n\t\tto challenge me to single combat.\n\t\tI pass it to you who vanquished me.\n\n\tThe GRAIL KNIGHT holds his sword out to INDY.\n\n<b>\t\t\tINDY\n</b>\t\t      (gulp)\n\t\tListen, I don't have time to\n\t\texplain, but\u0097\n\n\tAt that moment DONOVAN and ELSA appear. Donovan turns to face the display\n\tof cups.\n\n<b>\t\t               DONOVAN\n</b>\t\tWhich one is it?\n\n\n\n<b>CONTINUED: (2)\n</b>\n<b>\t\t               KNIGHT\n</b>\t\tYou must choose.\n\t\t     (beat)\n\t\tBut choose wisely. For as the\n\t\tTrue Grail will bring you life\u0097\n\t\tthe False Grail will take it from\n\t\tyou.\n\n<b>\t\t               DONOVAN\n</b>\t\tI'm not a historian. I have no\n\t\tidea what it looks like. Which\n\t\tone is it?\n\n<b>\t\t               ELSA\n</b>\t\tLet me choose.\n\n<b>\t\t               DONOVAN\n</b>\t\tThank you, Doctor.\n\n\tELSA and INDY exchange looks. He thinks he is seeing her in her true colors.\n\n\tELSA chooses a cup\u0097a solid gold, emerald encrusted goblet.\n\n\tDONOVAN instantly takes it from her.\n\n<b>\t\t               DONOVAN\n</b>\t\tOh, yes. It's more beautiful than\n\t\tI'd ever imagined. This certainly\n\t\tis the cup of the King of Kings.\n\n\tDONOVAN rushes to the well and fills the goblet with water.\n\n<b>\t\t\tDONOVAN\n</b>\t\tEternal life!\n\n\tDONOVAN drinks from the goblet.\n\n\tThen, DONOVAN'S entire body starts to convulse. His face contorts in agony. He\n\tgrabs his stomach and turns toward ELSA.\n\n<b>\t\t               DONOVAN\n</b>\t\tWhat . . . is . . . happening. . . to . . .\n\t\tme. . .?\n\n\tHe starts to age\u0097fast! His hair grows long and gray and brittle. His face sinks.\n\tFingernails curl back on themselves. Milky cataracts coat his eyes.\n\n\tELSA gasps and screams.\n\n<b>\t                                     DONOVAN\n</b>\t\tWhat. . . is . . . happening. . . ?\n\n\tHis skin turns brown and leathery and stretches across his bones until it splits.\n\tHis skeletal hands reach for ELSA's throat, choking her.\n\n\n\n<b>CONTINUED: (3)\n</b>\n\tINDY rushes forward and pushes DONOVAN away. As he falls he BODY BREAKS\n\tINTO FLAMES, then SHATTERS AGAINST THE WALL.\n\n<b>\t\t\tKNIGHT\n</b>\t\tHe chose...poorly.\n\n\tINDY studies the array of chalices.\n\n\n<b>\t                                     ELSA\n</b>\t\tIt would not be made out of gold.\n\n\tINDY picks up another cup\u0097a simple earthenware jug.\n\n<b>\t                                     INDY\n</b>\t\tThat's the cup of a carpenter.\n\n\tHe and ELSA exchange a look.\n\n<b>\t                                     INDY\n</b>\t\tThere's only one way to find out.\n\n\tINDY goes to the well and fills the earthenware jug with water, then pauses.\n\tINDY brings the jug to his lips and takes several large swallows.\n\n\tA strange sensation overcomes him, a feeling of peace and contentment...and we\n\tsee his wounds begin to heal.\n\n<b>\t                                    KNIGHT\n</b>\t            You have chosen wisely. But the\n\t            Grail cannot pass beyond the\n\t            Great Seal. That is the boundary\n\t            and the price of immortality.\n\n\n\tCUT TO BRODY AND SALLAH who attend to Henry awaiting Indy's return.\n\n\tINDY and ELSA come forward with the Grail.\n\n\tThe TWO NAZI SOLDIERS are over-awed by the possessors of the Grail. They put\n\tdown their guns and kneel.\n\n\tINDY kneels by HENRY's side and tilts his head forward and holds the Grail to\n\this lips.\n\n\tHENRY is too weak to even open his eyes.\n\n\tHENRY swallows some of the water. Much of it runs down the corners of his\n\tmouth. Finally INDY pours the water over the wound and everyone watches in\n\tastonishment as the wound and the blood stain disappear before their eyes. The\n\tcolor returns to Henry's face.\n\n\tHENRY's eyes open. The first thing he sees is the Grail and they light up. Then\n\tthey shift to INDY's face\u0097and they light up even more...\n\n<b>\tNAZI SOLDIERS\n</b>\n\trun forward. SALLAH points a rifle at them.\n\n<b>\t                                     SALLAH\n</b>\t\tDrop your guns. Please.\n\n\tThe NAZI SOLDIERS drop their weapons at their feet and raise their arms in\n\tsurrender.\n\n<b>\t                                      INDY\n</b>\t\t     (to HENRY)\n\t\tDad, come on. Get to your feet.\n\n<b>\tELSA\n</b>\n\tsteps forward and picks up the Grail. She turns to INDY, her face alight with\n\tpossession of the Grail.\n\n<b>\t\t\tELSA\n</b>\t\tWe have got it. Come on.\n\n\tELSA steps onto the edge of the Great Seal.\n\n<b>\t\t\tINDY\n</b>\t\tElsa! Elsa, don't movel\n\n<b>\t                                      ELSA\n</b>\t\tIt's ours, Indy. Yours and mine.\n\n<b>\t                                      INDY\n</b>\t\tElsa, don't cross the Seal. The\n\t\tKnight warned us not to take the\n\t\tGrail from here.\n\n\tA RUMBLING SOUND IS HEARD and the ground roars and shifts. Dirt falls from\n\tthe ceiling of the cavern. ELSA falls on the Great Seal. The Grail bounces away\n\tfrom her grasp. She reaches for it and the ground beneath her begins to SPLIT\n\tOPEN. ELSA slips into the crevasse. She screams.\n\n\tELSA is hanging perilously in the abyss, with the Grail almost within her reach.\n\tAs her hands lose their grip, INDY just manages to one of them, he himself\n\tsliding forward across the slanted floor.\n\n<b>\t                                     HENRY\n</b>\t\tJunior!  Junior!\n\n\tWith her free hand, ELSA is trying to get the Grail. INDY can't save her unless\n\tshe gives him her free hand. She has to choose.\n\n<b>\t\t\tINDY\n</b>\t\tElsa. Elsa don't. Elsa. Elsa.\n\t\tGive me your other hand,\n\t\thoney. I can't hold you.\n\n\n\n<b>CONTINUED:\n</b>\n<b>\t\t\tELSA\n</b>\t\tI can reach it. I can reach it...\n\n\tHer hand begins to slip from Indy's grasp.\n\n<b>\t\t                INDY\n</b>\t\tElsa! Give me your hand. Give\n\t\tme your other hand!\n\n\tELSA just manages to touch the Grail. In doing so, she has tipped the balance too\n\tfar\u0097INDY slides down another yard, Elsa loses her grip and falls screaming to\n\ther death.\n\n<b>\t\t\tINDY\n</b>\t\t     (horrified)\n\t\tElsa!!\n\n\tNow the ledge INDY lies upon begins to break apart. HENRY grabs one of his\n\thands as Indy struggles to reach the Grail with the other.\n\n<b>\t\t\tHENRY\n</b>\t\tJunior, give me your other hand!\n\t\tI can't hold on!!\n\n<b>\t\t                INDY\n</b>\t\tI can get it\u0097I can almost\n\t\treach it, Dad.\n\n\tINDY looks down into the black bottomless pit beneath him from which nothing\n\tcan ever be retrieved.\n\n<b>\t\t\tHENRY\n</b>\t\tIndiana. Indiana!!\n\n\tINDY snaps his look up to his father. His father has never called him this before.\n\n\n<b>\t\t\tHENRY\n</b>\t\t     (very calmly)\n\t\t... let it go...\n\n\n\tINDY abandons the Grail and grabs onto HENRY with both hands.\n\tHENRY pulls him up to safety.\n\n\n<b>\tTHE GRAIL KNIGHT\n</b>\n\tlooks through the falling debris to INDY and HENRY. SALLAH and BRODY rush\n\tfrom the crumbling Temple.\n\n<b>\t\t\tINDY\n</b>\t\tDad. . .\n\n\tThe GRAIL KNIGHT raises his arm to HENRY.\n\n\n<b>CONTINUED:\n</b>\n\n<b>\t\t\tINDY\n</b>\t\tPlease, Dad...\n\n\tINDY and HENRY down the passageway just as a huge stone column tumbles\n\tdown upon the spot where they stood. The GRAIL KNIGHT lowers his arm as he\n\twatches them leave.\n\n\n<b>\tEXT. ENTRANCE TO MOUNTAIN TEMPLE - AFTERNOON\n</b>\n\tINDY, HENRY, SALLAH and BRODY emerge from the Mountain Temple through\n\tthe Grecian Facade.\n\n\tFrom within the Mountain Temple, the ROAR OF WALLS CAVING IN IS HEARD. A\n\tcloud of dust and smoke billows out from the entrance.\n\n\tHENRY turns to INDY.\n\n<b>\t\t\tHENRY\n</b>\t\tElsa never really believed in the\n\t\tGrail. She thought she'd found a\n\t\tprize.\n\n<b>\t\t\tINDY\n</b>\t\tWhat did vou find, Dad?\n\n<b>\t\t\tHENRY\n</b>\t\tMe?... Illumination.\n\n\tHENRY and INDY mount their horses. Henry turns back to his son.\n\n<b>\t\t\tHENRY\n</b>\t\tWhat did you find, Junior?\n\n<b>\t\t\tINDY\n</b>\t\tJunior?! Dad...\n\n\n<b>\t\t\tSALLAH\n</b>\t\tPlease...What does it always\n\t\tmean, this...this \"Junior?\"\n\n<b>\t\t\tHENRY\n</b>\t\tThat's his name. Henry Jones,\n\t\tJunior.\n\n<b>\t\t\tINDY\n</b>\t\tI like Indiana.\n\n<b>\t\t\tHENRY\n</b>\t\tWe named the dog Indiana.\n\n<b>\t\t\tBRODY\n</b>\t\tMay we go home now, please?\n\n\n\n<b>CONTINUED:\n</b>\n\n<b>\t\t\tSALLAH\n</b>\t\t        (to INDY)\n\t\tThe dog!?\n\t\t        (laughs)\n\t\tYou are named after the dog...\n\n<b>\t\t\tINDY\n</b>\t\t        (embarrassed)\n\t\tI've got a lot of fond memories\n\t\tof that dog.\n\n\tA moment passes as they all ready their mounts and SALLAH continues to laugh\n\tat INDY.\n\n<b>\t\t               INDY\n</b>\t\tReady?\n\n<b>\t\t               HENRY\n</b>\t\tReady.\n\n<b>\t\t               BRODY\n</b>\t\tIndy! Henryl Follow met I know\n\t\tthe way!\n\t\t        (to his horse)\n\t\tHaaa!\n\n<b>\t\t\tHENRY\n</b>\t\t        (to INDY)\n\t\tGot lost in his own museum, huh?\n\n<b>\t\t\tINDY\n</b>\t\tUh-huh.\n\n\n<b>\t\t               HENRY\n</b>\t\tAfter you, Junior.\n\n<b>\t\t\tINDY\n</b>\t\tYes, sir!\n\t\t   (to his horse)\n\t\tHaaa!\t\t\n\n\n<b>\tEXT. THE SECRET CANYON - AFTERNOON\n</b>\n\tThey THUNDER through the canyon\u0097whose towering walls threaten to collapse\n\tupon them.\n\n\n<b>\tEXT. ENTRANCE TO CANYON - SUNSET\n</b>\n\tas BRODY, INDY, HENRY AND SALLAH ride from the canyon toward the SETTING\n<b>\tSUN.\n</b>\n<b>\t\t\tTHE END\n</b>\n\t</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Indiana Jones and the Last Crusade</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=George Lucas\" title=\"Scripts by George Lucas\">George Lucas</a>  <a href=\"/writer.php?w=Philip Kaufman\" title=\"Scripts by Philip Kaufman\">Philip Kaufman</a>  <a href=\"/writer.php?w=Menno Meyjes\" title=\"Scripts by Menno Meyjes\">Menno Meyjes</a>  <a href=\"/writer.php?w=Jeffrey Boam\" title=\"Scripts by Jeffrey Boam\">Jeffrey Boam</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Indiana Jones and the Last Crusade Script.html#comments\" title=\"Indiana Jones and the Last Crusade comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:08:00.675260"}