{"title": "Indiana Jones and the Temple of Doom", "film_link": "/Movie Scripts/Indiana Jones and the Temple of Doom Script.html", "script_link": "/scripts/Indiana-Jones-and-the-Temple-of-Doom.html", "info_raw": "\n\nIndiana Jones and the Temple of Doom Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  George Lucas  Willard Huyck  Gloria Katz\nGenres  Action  Adventure\nScript Date :  1984\n\nRead \"Indiana Jones and the Temple of Doom\" Script\n\n\n", "script": "\n\n                     INDIANA JONES AND THE TEMPLE OF DOOM\n\n                                 STORY BY:\n\n                               GEORGE LUCAS\n\n\n                               SCREENPLAY BY:\n\n                               WILLARD HUYCK\n                                    AND\n                                GLORIA KATZ\n\n\n\n\n\n        TM* & (c) Lucasfilm Ltd., 1984\n\n\n                                --------------\n\n       FADE IN:\n\n1.     INT.  \"THE DRAGON\" NIGHTCLUB - NIGHT                            1.\n\n       A Chinese GONG SOUNDS and the glittering doors of an art Deco pa-\n       poda slide open to reveal a mammoth silver stairway down which\n       rows of beautiful women start descending   (BEGIN MAIN TITLES)\n\n       The lovely ladies are a mix of races and they sing a strange,\n       haunting melody -- one might think them a heavenly choir, if it\n       weren't for their sexy, clinging lame gowns.\n\n2.     INT.  CLUB ENTRANCE                                             2.\n\n       From the ethereal beauties, we cut to a street urchin's dirty\n       face: SHORT ROUND is a ten-year-old Chinese kis wearing a beat-\n       up American baseball cap.\n\n       Sneaking into the club, Short Round weaves past the fancy gowns\n       and silk suits, heading toward the music in the main ballroom.\n\n3.     INT.  THE BALLROOM                                              3.\n\n       Short Round enters and stares across the smoky nightclub.  On the\n       stage, he sees a giant paper-mache dragon laying curled around\n       the pagoda.\n\n       Now, the dragon's eyes light up, its nostrils exhale smoke and\n       its enormous jaws open.  Out of the dragon's mouth walks the star\n       of the stage show:\n\n       WILLIE SCOTT, a dreamy beauty singing a sultry solo white the or-\n       chestra wails the accompaniment.\n\n       But Short Round's not here to ogle crooning dames.  He surveys\n       the rich Chinese, American and European revelers.  Jewels flash\n       and champagne flows.  Short Round finally spots a table of\n       somber-looking Chinese men in suits.\n\n       Short Round chews gum and stares at the men.  Then he turns to\n       go.  WU HAN, a waiter with a scar across his cheek, watches Short\n       Round leave.\n\n4.     INT.  CLUB ENTRANCE                                            4.\n\n       As Short Round hurries toward the exit, he bumps into a man in a\n       tuxedo entering the club.  Short Round looks up at the man, but\n       we don't see his face.\n\n       Then Short Round is grabbed by the scruff of his neck and a door-\n       man hustles him out the door, Short Round yelling insults all the\n       way.\n\n       A maitre d' apologizes to the man in the tuxedo and two hat-check\n       girls smile at him familiarly as he continues into the ballroom.\n       We notice something incongruous:  the man in the tuxedo is wear-\n       ing work boots caked with mud.\n\n5.     INT.  THE BALLROOM                                             5.\n\n       The man in the tuxedo stops to watch Willie Scott singing sexily\n       on the stage.  Then he looks around and sees the table of somber\n       Chinese men that Short Round spotted earlier.\n\n       As the man in the tuxedo walks toward the table, he removes a\n       cigarette from a silver case.  He arrives at the table just as\n       the chorus and orchestra reach a crescendo --\n\n       And on the stage, a glistening, muscular slave swings a huge ham-\n       mer toward an enormous brass gong --\n\n       The man in the tuxedo leans to receive a light from a cigarette-\n       girl and, as the GONG BOOMS, the match flares to reveal his face\n       for the first time:\n\n       It's INDIANA JONES.  Elegant in a tuxedo -- dressed to kill.  The\n       TITLES END and over this a legend appears on the screen:\n\n                                SHANGHAI - 1935\n\n       At the table, the four Chinese man in suits stare coldly at Indi-\n       ana.\n\n                                   LAO\n                       Dr. Jones.\n\n                                   INDIANA\n                       Lao She.\n\n                                   LAO\n                       Nee chin lie how ma?\n\n       Lao's men laugh and assume that Indy doesn't understand his joke.\n\n                                   INDIANA\n                       Wah hung how, nee nah?  Wah hwey\n                       hung jing chee jah loo nee kao\n                       soo wah shu shu.\n\n       LAO SHE looks angry and his men's smiles fade.\n\n                                   LAO\n                       You never told me you spoke my\n                       language, Dr. Jones.\n\n                                   INDIANA\n                       I don't like to show off.\n\n       Indiana takes a seat across the table from Shanghai's notorious\n       crime-lord.  Lao is fifty, wealthy enough to now display some\n       fat, but still muscular from his fight to the top of the garbage\n       heap.\n\n                                   LAO\n                       For this special occasion, I\n                       ordered champagne and caviar.\n\n       Indiana looks at the pile of caviar on the plate in front of him\n       -- and stubs his cigarette out in it.  The cigarette sizzles and\n       Lao's smiles dies with it.\n\n       There's applause as Wille Scott finishes her song.  At the\n       table, Lao stares at Indiana with a strange intensity.\n\n                                   LAO\n                       So, it is true, Dr. Jones?  you\n                       found Nurhachi?\n\n                                   INDIANA\n                       Sure, I found him.  Then last\n                       night I had a little trouble.\n                       Somebody tried to slit my throat.\n\n       Indiana looks across the table at Lao's son, CHEN, who resembles\n       a bulldog and snarls like one now.\n\n                                   INDIANA (Cont'd)\n                       It was dark, but I think one of\n                       your sons tried to get Nurhachi\n                       without paying for him.\n\n       Indy stares pointedly at Chen's recently bandaged hand.  Chen\n       mutters and stands angrily -- Lao barks a command in Chinese and\n       Chen sits down again.\n\n                                   LAO\n                       You have insulted my son.\n\n                                   INDIANA\n                       Next time I'll cut off more than\n                       his finger.\n\n                                   LAO\n                       Dr. Jones -- I want Nurhachi.\n\n       Lao pulls a wad of cash out of his pocket and puts it on the\n       table.  Indiana glances at it.\n\n                                   INDIANA\n                       As I recall the deal was consid-\n                       erably more.\n\n       Now a pretty hand slips onto Lao's shoulder and he looks up to\n       see Willie Scott.  Lao kisses her hand.  Willie is unaware of the\n       explosive mood at the table and she smiles flirtaciously at Indi-\n       ana.\n\n                                   WILLIE\n                                   (to Lao)\n                       Aren't you going to introduce\n                       us?\n\n                                   LAO\n                       This is Willie Scott.\n                             (watching Indy)\n                       And this is Indiana Jones, the\n                       famous archaeologist.\n\n       Willie sits down between Lao and Indy.  She takes out a small\n       mirror to check her make-up.\n\n                                   LAO (Cont'd)\n                       Dr. Jones found Nurhachi for me\n                       and is about to deliver him --\n                       now.\n\n       Lao nods across the table and Indy sees KAO KAN, Lao's second\n       son, open his coat and remove a silver-plated pistol.  Indiana\n       looks worried.  Willie doesn't notice as she fixes her make-up\n       and coyly teases Indiana.\n\n                                   WILLIE\n                       Well -- I thought archaeologists\n                       were always funny little men\n                       searching for their mummies --\n                                  (yelping)\n                       Aaahhh!\n\n       She looks down terrified at the knife Indy is poking against her\n       ribs.\n\n                                   WILLE (Cont'd)\n                       I was only kidding, can't you\n                       take a joke -- ?\n                                  (to Lao)\n                       Lao, he's got a knife!\n\n                                   INDIANA\n                       Put the gun away, sonny.\n\n       Kao Kan glances at his father.  Lao finally nods to his son and\n       he slips the pistol back into his pocket.\n\n                                   INDIANA\n                       Now I suggest you pay me what you\n                       promised -- or your girlfriend\n                       here is going to be squealing a\n                       new tune.\n\n       The ritzy patrons at the tables nearby are unaware of the tawdry\n       drama quietly unfolding at this table.\n\n       Willie eyes the blade and whimpers.  She looks imploringly at Lao\n       and he slowly reaches into his pocket.  He puts ten gold coins\n       next to the cash on the table.\n\n       Indy leans forward to look at the gold coins -- so intently that\n       he fails to notice Kao Kan spilling some powder into Indy's cham-\n       pagne glass!\n\n                                   INDIANA\n                       Try again Lao -- the deal was\n                       more.\n\n       The knife pokes Willie and she whimpers again.  Lao reaches into\n       another pocket and brings out a folded piece of rice paper -- he\n       opens it and a large diamond and ruby spill out onto the table.\n\n                                   INDIANA (Cont'd)\n                       Bingo...you see, Lao, with a\n                       but of persuasion, even you can\n                       be an honest fellow.\n\n       Indy smiles and jabs the knife into the middle of the table.\n       Then he lifts his champagne glass in a toast to Lao -- who\n       watches expectantly as Indiana moves the glass toward his lips --\n\n       Suddenly Willie stands angrily, jostling Indy's arm so that he\n       doesn't drink his champagne.\n\n                                   WILLIE\n                       Look at this!  He put a hole\n                       in my dress from Paris!\n\n       Lao sees Indy put his champagne glass down and he snarls at Wil-\n       lie --\n\n                                   LAO\n                       Sit down!\n\n       Willie quickly obeys.  Lao forces a smile at Indy and lifts his\n       glass to seal the deal --\n\n                                   LAO (Cont'd)\n                       To your health, Dr. Jones.\n\n       Lao sips hs champagne and watches hopefully as Indy picks up his\n       glass and this time Indy does drink the champagne. Then he\n       reaches for the cash --\n\n       But Chen grins and puts a silver snuff bottle next to the cash,\n       gold and jewels -- he tips the little bottle over and some white\n       powder spills out of it --\n\n                                   INDIANA\n                       What's that?\n\n                                   LAO\n                       A bonus, Dr. Jones.  That is\n                       poison.  You just drank the\n                       rest of it.\n\n       Indiana examines his champagne glass and sees a residue at the\n       bottom of it.  He swallows and feels sick, wondering it it's fear\n       or the poison already taking effect.\n\n                                   LAO (Cont'd)\n                       There is an antidote for this\n                       poison.  You give me Nurhachi --\n                       I give you the antidote.\n\n       Indiana is sweating.  Willie looks at him and sees Indy's hand\n       shaking.\n\n                                   LAO (Cont'd)\n                       The poison works fast, Dr. Jones.\n                       Where is Nurhachi?\n\n       Indiana finally reaches into his pocket.  Next to the cash, gold,\n       jewels and poison, Indiana sets down a beautiful small box.  Lao\n       and his men stare hypnotically at the exquisite gold and enamel\n       box.\n\n                                   WILLIE\n                                (nervously)\n                       This Nurhachi's a very small guy.\n\n       Nobody pays any attention to her as Lao reaches for the box.\n\n                                   INDIANA\n                       Inside are the remains of Nur-\n                       hachi -- the first Emperor of the\n                       Manchu Dynasty.\n\n       Lao opens the box carefully and stares reverently at the grey\n       powder inside.\n\n                                   INDIANA (Cont'd)\n                       Now what about the antidote,\n                       Lao.\n\n                                   LAO\n                             (holding the box)\n                       At last I have the ashes of my\n                       sacred ancestor!\n\n                                   WILLIE\n                       So, what's the big deal?  Let\n                       me see it --\n\n       Qillie grabs Lao's arm and some of the precious ashes spill out\n       of the gold box.  Stunned by this desecration of his ancestor,\n       Lao grabs Willie by the wrist and twists her arm --\n\n                                   LAO\n                       You fool!\n\n                                   WILLIE\n                       Ow, you're hurting me, you miser-\n                       able little hood!\n\n                                   INDIANA\n                       Let go of her, Lao.  And give me\n                       the antidote.\n\n       Lao just laughs evilly -- until a waiter moves up behind Lao and\n       the crimelord suddenly stiffens.  He lets go of Willie's wrist\n       and raises his hands off the table.  Chen stops collecting the\n       money and jewels.\n\n       Kao Kan tenses and Indy smiles at Wu Han, the Chinese waiter with\n       the scar, who is standing behind Lao.  Wu Han has a towel over\n       his hand  --  under it, he has a pistol pressed against Lao's\n       spine.\n\n                                   INDIANA (Cont'd)\n                              (smiling at Wu Han)\n                       I like the service here.\n\n                                   WILLIE\n                                  (puzzled)\n                       Hey, he's not a waiter...\n\n                                   INDIANA\n                       No, Wu Han's an old friend I\n                       brought along.\n                                   (to Lao)\n                       So, the game's not over. Put\n                       the antidote on the table, Lao.\n\n       Lao carefully reaches into his pocket and puts a small glass vial\n       of liquid next to the cash, gold, jewels, poison and sacred box.\n       Indy looks relieved as he reaches for the vial of antidote --\n       then he hears a muffled report!  And another!\n\n       Wu Han groans and sways.  Indy starts to stand but Chen immedi-\n       ately turns the smoking pistol with the silencer that he used to\n       kill Wu Han -- Indy sees it pointed at him now and he remains in\n       his seat.\n\n       Kao Kan stands and grabs Wu Han, easing the phoney waiter into\n       the chair he just vacated.  The muffled shooting hasn't attracted\n       any attention.  The nightclub activity continues an Indy speaks\n       emotionally to his dying friend.\n\n                                   INDIANA\n                       Wu Han  --  listen to me  --  I'm\n                       going to get you out of here.\n\n       In pain, Wu Han looks at Indy and struggles to speak --\n\n                                   WU HAN\n                       Not this time, my friend...\n                             (smiling bravely)\n                       I followed you on many adventures --\n                       but into the great Unknown Mystery,\n                       I go first, Indy...\n\n       Wu Han dies and slumps forward.  Indiana is shattered by the\n       death of his old friend.\n\n                                   LAO\n                       Don't be sad, Dr. Jones -- you\n                       will soon join him.\n\n       Indy's gaze shifts from his dead friend to Lao's sneering face.\n       Then Indy sees the murderous Chen giggling perversely.  Indy's\n       anger is compounded by the poison burning in his gut and his vis-\n       ion of Chen's ugly face blurs into a double image --\n\n       Indy stands up unsteadily.  Chen assumes he's about to keel over\n       from the poison -- but Indy suddenly turns and grabs a real wai-\n       ter at another table.  The waiter holds a long skewer of roasted\n       pigeons that he's just set afire --\n\n       Indy grabs the skewer of pigeons flambee and hurls is across the\n       table!  Chen fires and misses -- and screams as the skewer stabs\n       into his chest and the burning pigeons flame in front of his hor-\n       rified face!\n\n       This the other tables definitely notice.  There are screams and\n       all hell breaks loose.  Indiana shoves past Willie and reaches\n       for the vial on the table --\n\n                                   INDIANA\n                       The antidote -- !\n\n       But he's grabbed from behind by Kao Kan.  Indy elbows the punk,\n       reaches back and grabs his head -- and somersaults Kao Kan onto\n       the table!\n\n       As nubmer two son crashes into the table, the impact sends the\n       Emperor Nurhachi's ashes billowing into Lao's stricken face!\n\n       Indiana yells as he sees the vial of antidote rolling across the\n       table -- and falling!\n\n       Indiana dives and catches the antidote just before it hits the\n       floor -- then Indy's hand is brutally stomped on by one of Lao's\n       henchmen and the vial rolls away.\n\n       Indiana angrily raises his head, smashing it up into the hench-\n       man's groin -- the man howls like a banshee and hobbles away.\n       \n       Meanwhile, Willie watches Lao grabbing for cash from the table.\n       Willie lunges past the pigeon-skewered Chen to snatch the jewels,\n       but unfortunately Kao Kan knocks them off the table as he leaps\n       to attack Indy.\n\n       Indiana scrambles on his hands and knees after the rolling vial.\n       People keep kicking it -- he almost has it when Willie runs into\n       him, trips and lands on her back.\n\n                                   INDIANA\n                       Look out, damn it, I need that\n                       antidote!\n\n                                   WILLIE\n                       Who cares?  Where's that diamond!\n\n       Gunfire explodes and they both scramble in different directions.\n       Indy dives through the fleeing nightclub patrons and slides be-\n       hind a water-spewing fountain.  Water kicks up as Indy is shot at\n       by Lao and his henchmen.\n\n       Indy sees the vial of antidote kicked again and it spins across\n       the marble floor -- feeling the poison, Indy shakes his head\n       groddily and splashes water on his face.\n\n       Meanwhile, Willie is chasing her diamond, shoving through the\n       panicked crowd.  She spots the diamond!  Another elegantly\n       dresses soman is bending to pick it up --\n\n                                   WILLIE\n                              (acidly polite)\n                       Excuse me, but I believe that's\n                       my diamond!\n\n       Willie smiles and suddenly kicks the woman in the butt!  Willie\n       reaches to get the diamond but not before the other woman tackles\n       her.\n\n       Behind the fountain, Indiana makes a break -- he runs and dives\n       on top of a serving cart.  The wheeled cart hurtles toward an un-\n       suspecting gunman, crashes into him from behind and sends him\n       flying head first into a row of ice buckets.\n\n       Nearby, Willie slugs the other lady in the jaw and grabs for the\n       elusive diamond just as the ice buckets showers ice across the\n       floor -- which camouflages the diamond!\n\n                                   WILLIE\n                       Aw nuts!\n\n       Searching desperately for the jewel, Willie sees the vial of\n       antidote spinning across the floor --as it slides by, she grabs\n       it.\n\n                                   INDIANA (O.S.)\n                       Hey,doll!  Don't move!\n\n       She sees Indy speeding by atop the serving cart.  Lao and his\n       gunmen rush out to block the way.  Indy rolls off the cart and\n       slides behind a potted palm as Lao's men open fire again.\n\n                                   INDIANA (Cont'd)\n                           (shouting to Willie)\n                       Hey, don't go away!  I need that!\n\n       Willie smiles meanly as she slips the vial down the front of her\n       dress, thumbs her nose at Indiana and walks away.\n\n                                   INDIANA (Cont'd)\n                       If I wasn't dying, I'd kill her...\n\n       Hiding behind the palm tree, Indiana looks around and spots a gi-\n       ant statue at the side of the stage.  Indy makes a break for it.\n\n       As the gunmen open fire, Indy springs onto a chair -- jumps onto\n       a table -- and leaps onto the stage.  He grabs the golden broad-\n       sword from the Chinese warrior statue!\n\n       As bullets smash into the statue, Indiana hides behind it.  Then\n       he jumps out and swings the large sword toward the enormous brass\n       gong.\n\n       The crimson cord holding the gong is SLASHED!  Indy slings the\n       sword at his assailants and gives the three-meter-high gong a\n       helpful shove --\n\n       The giant gong rolls and echoes as it crashes down the marble\n       steps.  Indiana ducks behind it as it gains momentum and rolls\n       across the dance floor.\n\n       Using the gong as an enormous shield, Indy evades the gunfire ex-\n       ploding -- bullets ricochet off the rolling brass gong as Indy\n       runs behind it.\n\n       Ahead, Willie hurries toward an exit -- she hears something and\n       turns -- her eyes go wide as she sees the mammoth gong bearing\n       down on her!\n\n       Willie yells as Indiana grabs her arm and pulls her behind the\n       gong with him --\n\n       Lao watches amazed as he and his gunmen dodge tables trying to\n       get better firing positions -- and more henchmen come into the\n       club now and start firing machine guns!\n\n       As bullets clang against the gong, Indiana and Willie run behind\n       it.  Willie hollers as they head directly for a towering, floor-\n       to-ceiling window!\n\n       Indiana grabs Willie around the waist and, after the huge gong\n       crashes through the stained-glass window, they both fly after it!\n\n6.     EXT.  \"THE DRAGON\" NIGHTCLUB - NIGHT                           6.\n\n       In a shower of sparkling glass, the enormous gong sails out and\n       crashes down a sloping green-tiled roof.  Indiana Jones and Wil-\n       lie Scott hurtle into the night air after it!\n\n       The gong rolls down the roof and they hit the tiles behind it,\n       Indiana holding onto Willie as they roll one-over-the-other\n       toward the edge -- Willie screams as they fall into thin air!\n\n       Their entwined bodies plummet three stories:  ripping through a\n       third-floor awning, crashing through an old man's mattress on a\n       second-floor balcony --\n\n       Finally they smash through the convertible top of a parked Duesen-\n       berg and fall into the back seat!\n\n7.     INT.  THE DUESENBERG                                           7.\n\n       Willie sits up wide-eyed, speechless and amazed to be alive.\n       Then she sees an equally astonished Short Round looking at them\n       from the front seat.\n\n                                   SHORT ROUND\n                       Wow!  Holy smoke!  Crash landing!\n\n                                   INDIANA\n                       Step on it, Short Round!\n\n                                   SHORT ROUND\n                       Okey doke, Indy!  Hold onto your\n                       potatoes!\n\n       The twelve-year-old Chinese kid turns his baseball cap bill-\n       backwards and steps on the gas!  The tires squeal as the car\n       roars off --\n\n                                   WILLIE\n                       For crying out loud, a kid's driv-\n                       ing the car?!\n\n                                   INDIANA\n                       Relax, I've been giving him lessons.\n\n8.     EXT.  THE NIGHTCLUB - NIGHT                                    8.\n\n       The Duesenberg races past the entrace to the nightclub as Lao\n       and his man rush out and jump into two black sedans.  The sedans\n       screech off in pursuit of the Duesenberg.\n\n9.     INT.  THE DUESENBERG                                           9.\n\n       As Short Round eagerly swerves around a corner, Willie holds on\n       for dear life.  Indiana suddenly puts his hand down the front of\n       Willie's dress --\n\n                                   WILLIE\n                       Listen, we just met for crissake!\n                       I'm not that kind of gril!\n\n                                   INDIANA\n                       Don't get your hopes up -- where's\n                       the antidote?\n\n       Indiana withdraws his hand, having finally found the vial.  He\n       opens is quickly, tips the vial to his lips and grimaces as he\n       swallows the stuff.\n\n                                   WILLIE\n                       You don't look very good.\n\n                                   INDIANA\n                       Poison never agrees with me.\n                              (shouting forward)\n                       Pull a right, Short Round, and\n                       head for the Wang Poo bridge!\n\n                                   SHORT ROUND\n                       Check!  Gotcha!\n\n       As the car accelerates, Indy peers out the back window at their\n       pursuers.  Willie notices her reflection in the side window --\n\n                                   WILLIE\n                       Look at what you've done to me!\n                       I'm a mess!  My lipstick's smeared,\n                       I broke two nails, I've got an aw-\n                       ful run in my stocking -- !\n\n       Gunfire suddenly explodes, bullets whizz through the canvas top\n       and the rear window shatters and sprays glass!  Willie ducks and\n       cringes terrified in the corner --\n\n                                   INDIANA\n                       Somehow I think you've got bigger\n                       problems.\n\n       Indy grabs his shoulder bag and pulls a pistol out of it.  He\n       pokes the gun through the broken window and starts firing back at\n       their pursuers -- then he turns and looks ahead.\n\n                                   INDIANA (Cont'd)\n                       There, Shorty!  Through the\n                       tunnel!\n\n       Through the windows we see the car racing into a tunnel.  Lights\n       from the pursuing cars flash through the rear window and gunfire\n       echoes in the tunnel.\n\n                                   WILLIE\n                       What're we going to do?!  Where're\n                       we going?!\n\n                                   INDIANA\n                       The airport...No, look out,\n                       Short Round!  Left, left!\n\n       Indy reaches over the front seat and helps Short Round navigate.\n\n10.    EXT.  A SHANGHAI SQUARE - NIGHT                                10.\n\n       The Duesenberg tears around the square, followed by Lao's two se-\n       dans.  People on the street dive for cover -- coolies pulling\n       rickshaws go into hyper-jov --lanterns spanning the street crash\n       down and are dragged behind the Duesenberg.  Bullets exlode and\n       amazed prostitutes watch the cars zoom past.\n\n11.    INT.  THE DUESENBERG - NIGHT                                   11.\n\n       The chaotic chase continues -- bullets whine past and the shred-\n       ded convertible top whips in the wind.\n\n                                   INDIANA\n                                 (shouting)\n                       You got the tickets, Short Round?\n\n                                   SHORT ROUND\n                       Sure, Indy -- three tickets!\n                       You, me and Wu Han --\n\n       Shorty throws an envelope back and Indy looks at the three\n       tickets.\n\n                                   INDIANA\n                                   (sadly)\n                       Wu Han's not coming, Shorty.\n\n       Unaware of what happened at the club, Short Round thinks a mo-\n       ment.\n\n                                   SHORT ROUND\n                       Don't worry, Indy.  Short Round\n                       number one bodyguard now!\n\n       Willie reaches for the extra ticket.\n\n                                   WILLIE\n                       I'll take the extra ticket.\n                              (grabbing it\n                                 from Indy)\n                       Where's this plane going anyway?\n\n                                   INDIANA\n                       Siam.\n\n                                   WILLIE\n                       Siam?  But I'm not dressed for\n                       Siam...\n\n12.    EXT. COUNTRY HIGHWAY - NIGHT                                   12.\n\n       Leaving behind the squalid port, the Duesenberg flies along the\n       highway through the trees.  In a moment, Lao's two sedans race\n       by.\n\n13.    EXT.  NANG TAO AIRFIELD - NIGHT                                13.\n\n       The Duesenberg swings around a curve and skids through gravel to-\n       ward the airfield.  In the distance there is a small terminal but\n       Short Round wheels the car toward the cargo area --\n\n       A two-engine passenger plane is revving its motors and the last\n       passengers are boarding.  The Duesenberg squeals to a stop and\n       Indy jumps out with Willie and Short Round right on his heels.\n\n       A contingent of airport Military Police move to bar their way\n       until WEBER, a heavy-set Englishman, runs up pufffing and shout-\n       ing.\n\n                                   WEBER\n                       No, no, they're all right!\n                       Let them through please.\n\n                                   INDIANA\n                       Thanks, Weber.\n\n                                   WEBER\n                       Dr. Jones, this is positively the\n                       last time our airline can hold a\n                       plane for you.  Now you must hurry!\n\n       While Short Round grabs a small bag out of the car, Weber and a\n       stewardess take their tickets and rush them all toward the air-\n       plane.\n\n       Meanwhile, the two sedans skid to a stop and Lao and his son Kao\n       Kan jumpsout with their henchmen.  The puzzled military police\n       advance on them usspiciously  --\n\n       Realizing he's outnumbered, Lao instructs his men to stay back\n       and to put away their weapons.\n\n14.    EXT.  THE AIRPLANE                                             14.\n\n       Willie and Short Round charge up the ladder and onto the plane.\n       Indy pauses at the top of the steps to give Lao a cocky farewell\n       salute.  Indy boards the plane and the co-pilot slams the door.\n\n15.    EXT.  THE AIRFIELD                                             15.\n\n       The plane starts taxiing.  By the cars, Lao is buffeted by the\n       prop wash as he angrily watches the plane roll away.  Behind Lao,\n       his son, Kao Kan, stares at the plane taking off  -- a look on Kao\n       Kan's face indicates that he hasn't given up yet...\n\n       The plane lifts off the airfield, silhouetted against the clouds\n       and the first light of dawn.\n\n                                                               CUT TO:\n\n16.    EXT.  THE DKY - MORNING                                        16.\n\n       The sun flashes above the horizon and the plane banks through\n       white billowing clouds at it heads west.\n\n17.    INT.  THE PLANE                                                17.\n\n       A door opens at the rear of the plane and Indiana Jones exits\n       wearing more familiar attire:  a beat-up leather jacket over a\n       khaki shirt and a snap-brim hat.  He passes a dozen passengers as\n       he moves up the aisle carrying his rolled-up tuzedo.\n\n       In the first row, Willie is busy fixing her make-up.  Shorty sits\n       in the seat across the aisle from her.  Indy comes up and drops\n       his tuxedo onto the floor.\n\n       Willie sees him hook his coiled bullwhip over a coat-peg.\n\n                                   WILLIE\n                       So, what're you supposed to be,\n                       a lion tamer?\n\n                                   INDIANA\n                       Since I was nice enough to let\n                       you tag along, why don't you give\n                       your mouth a rest?  Okay, doll?\n\n       Indy pats her leg -- she removes his hand and reaches down and\n       picks up his tuxedo coat.  She slips it on.\n\n                                   WILLIE\n                       I'm freezing.  What do you mean,\n                       tag along?  From the minute you\n                       walked into that nightclub, you\n                       haven't been able to keep your\n                       eyes off me.\n\n                                   INDIANA\n                       Oh yeah?\n\n       He smiles and tips his hat down over his eyes to go to sleep...\n\n18.    INT.  THE COCKPIT                                              18.\n\n       At the same moment, the Chinese co-pilot tips his hat up off his\n       eyes -- and looks scared to death!  He exclaims in Chinese --\n\n                                   CO-PILOT (*subtitled*)\n                       Good lord!\n\n       He and the pilot see two biplanes materialize out of the clouds\n       and dive directly toward them!  Suddenly, machine gunfire erupts!\n\n                                   PILOT (*subtitled)\n                       Dive for the clouds!  Dive!\n\n19.    EXT.  THE SKY - DAY                                            19.\n\n       The DC-3 banks into the clouds as the two biplanes attack.  In\n       the back seat of the first biplane, we see Kao Kan watching the\n       DC-3 like a hawk about to bring down a sparrow.\n\n20.    INT.  THE COCKPIT                                              20.\n\n       The biplanes swoop past both sides of the plane and bursts of\n       gunfire rip along the fuselage.\n\n                                   CO-PILOT (*subtitled)\n                       They hit a fuel line!\n\n                                   PILOT (*subtitled*)\n                       Reduce speed -- get everyone out\n                       of the plane!\n\n21     INT.  THE PASSENGER CABIN                                      21.\n\n       As the air battle rages, the passengers are tossed about and some\n       start screaming.  Short Round peers out a window.\n\n                                   SHORT ROUND\n                       Lao send planes to kill Indy!\n\n       Willie shakes Indy's arm but he continues snoring under his hat.\n\n                                   WILLIE\n                       Wake up!  It's the drug he drank\n                       to stop the poison --\n\n       The cockpit door bursts open and the Chinese co-pilot exits to\n       make an announcement -- he smiles and speaks in CHINESE, then he\n       smiles and speaks in FRENCH --\n\n       Willie looks lost until the Chinese co-pilot smiles again and\n       speaks in ENGLISH --\n\n                                   CO-PILOT\n                       Please to remain calm.  We start\n                       passing out parachutes now --\n\n       The co-pilot hurries toward the rear.  Willie looks petrified as\n       a stewardess rushes up and hands her a parachute.\n\n                                   WILLIE\n                       You got to be kidding!  No!  No,\n                       I can't!\n\n       The pilot hurries out of the cockpit and grabs his parachute as\n       he heads toward the back.\n\n                                   WILLIE (Cont'd)\n                       Wait -- who's flying the plane?!\n\n       She opens the door to the cockpit --\n\n                                   WILLIE (Cont'd)\n                       Nobody's flying the plane ...\n\n22.    EXT.  THE SKY - DAY                                            22.\n\n       The DC-3 smokes through the clouds.  Passengers are bailing out\n       -- parachutes billowing.  As one of the fighters swoops through\n       the parachutes, Kao Kan searches the faces -- then he points at\n       the DC-3.\n\n                                   KAO KAN\n                               (into the radio)\n                       Jones!  Indiana Jones!\n\n       The two planes roar off and start strafing the DC-3 again.\n\n23.    INT.  THE PASSENGER CABIN                                      23.\n\n       The co-pilot has a parachute on and is trying to get Short Round\n       into one.\n\n                                   CO-PILOT\n                       Put it on!  What's wrong with\n                       you?  You've got to jump!\n\n                                   SHORT ROUND\n                       No, can't leave Indy!\n\n       Short Round suddenly butts the co-pilot in the stomach with his\n       head.  The co-pilot yells and falls out the door.  Short Round\n       sees the co-pilot's parachute billow.  Then Willie rushes up.\n\n                                   WILLIE\n                       Give me that parachute, I\n                       changed my mind --\n\n       She grabs the parachute and starts to fight Shorty over it--\n\n                                   SHORT ROUND\n                       No, this last one!  It's for Indy!\n\n       They scuffle until the parachute skids across the floor.  Short\n       Round jumps for it -- the parachute falls out the door and Short\n       Round starts to fall out after it!\n\n       Willie grabs him by the seat of his pants and hauls him back from\n       the abyss!\n\n24.    EXT.  THE SKY - DAY                                            24.\n\n       The fighters peel off toward the DC-3 with their guns flaming in\n       another attack.\n\n25.    INT.  THE PASSENGER CABIN                                      25.\n\n       Short Round tries to wake Indy again.  Finally, Shorty grabs\n       Indy's bag, pulls his holster out of it and runs toward the back.\n\n       Indy continues to sleep -- until bullets smash the window by his\n       head and a fire extinguisher is hit and starts spraying into\n       Indy's face.\n\n       He finally awakens and jumps up.  He looks around is disbelief at\n       the battle-torn, nearly-empty airplane.\n\n                                   INDIANA\n                                  (groggily)\n                       We there yet?\n\n       Indiana sees Shorty shooting his pistol out the side door as the\n       planes swoop by again.  Out of ammo, Shorty throws the gun\n       angrily at the passing plane.\n\n       Indiana picks up his whip and attaches it to his belt as Willie\n       runs over to him.\n\n                                   WILLIE\n                       There's nobody flying the plane!\n\n26.    INT.  THE COCKPIT                                              26.\n\n       The door flies open and Indy rushes in with Willie behind him.\n       Indy appraises the situation quickly and jumps into the pilot's\n       seat with total confidence --\n\n                                   WILLIE (Cont'd)\n                       You know how to fly?\n\n       Indy surveys the control panels, the myraid of dials and switches --\n\n                                   INDIANA\n                       No.\n                                  (hopefully)\n                       Do you?\n\n27.    INT.  THE PASSENGER CABIN                                      27.\n\n       Willie runs screaming out of the cockpit, her last hope shatter-\n       ed.  Shorty is pulling something out of the cargo compartment --\n       he's found a machine gun and sets it up on a short tripod.\n\n                                   SHORT ROUND\n                       Come here, lady, hold this and\n                       shut up please!\n\n       He pulls Willie down to the floor and shoves her the ammunition\n       belt that's draped toward the gun.  Then Shorty jumps behind the\n       machine gun --\n\n       As the first fighter appears off their side, Short Round blasts\n       out the open door!  The machine gun explodes to life, chewing\n       bullets, smoking and spitting shells at Willie --\n\n       Willie hollers terrified by manages to feed the ammo belt as\n       Short Round sights the blazing machine gun -- suddenly he shoops!\n\n       Willie sees the fighter hit -- it smokes and veers away -- and\n       then EXPLODES!\n\n                                   SHORT ROUND\n                       I get it!\n\n                                   WILLIE\n                       You got it!\n\n       The second plane swoops down and Short Round blasts away.  This\n       time as he swivels the gun, he misses and hits one of the DC-3's\n       own engines and it explodes!\n\n                                   SHORT ROUND\n                       Oh oh -- big mistake!\n\n28.    INT.  THE COCKPIT                                              28.\n\n       Trying to figure out the controls, Indy looks up to see their en-\n       gine explose into flames --\n\n                                   INDIANA\n                                  (angrily)\n                       Short Round, what in the hell\n                       are you doing?\n\n       Suddenly the DC-3 emerges out of a cloud and Indy sees they are\n       headed directly for a mountain!  He pulls back hard on the con-\n       trols as a rocky peak looms lethally in front of them.\n\n29.    EXT.  THE SKY - DAY                                            29.\n\n       The DC-3 lifts at the last second and smashes some snow off the\n       uppermost pinnacle as it clears the mountain by inches!\n\n       Kao Kan's fighter is glued to the DC-3's tail and continues to\n       strafe -- but the fighter pilot pulls up too late -- and the\n       fighter explodes as it hits the peak of the mountain!\n\n30.    INT.  THE PASSENGER CABIN                                      30.\n\n       Indy rushes out of the smoking cockpit to find Willie and Short\n       Round crawling out from under the debris that's fallen on them.\n       Then Indy spots something in the wreckage --\n\n       He pulls at some yellow canvas and Willie sees as sign: EMERGENCY\n       LIFE RAFT.  Indy drags the folded canvas over to the open door.\n\n                                   WILLIE\n                       Are you crazy, a lift raft?!  We're\n                       not sinking, we're crashing!\n\n                                   INDIANA\n                       Get over here, damn it!  Short Round,\n                       come on, grab onto me tight!\n\n       Willie sees Short Round rush over to Indiana and grab him around\n       the waist from behind.  Willie finally jumps up and runs over --\n\n                                   WILLIE\n                       Wait for me!\n\n       She throws her arms around Indy's neck so that she and Shorty are\n       both hugging him from behind.  Indy clutches the folded lift raft\n       in front of him and surveys the mountainside rushing close be-\n       neath the skinking airplane --\n\n       Finally, an instant before the plane will hit, Indy dives and\n       pulls the inflation cord!\n\n31.    EXT.  THE SKY                                                  31.\n\n       As the smoking DC-3 screams out of control toward the mountain,\n       skimming the rocky snow-covered slopes, we see the lift raft\n       spilling out the open door --\n\n       The raft pops into its full shape, acting now as a spoiler, soar-\n       ing against the rushing wind and finally crashing and bouncing\n       against the snowy mountainside.\n\n       In the distance, we see the DC-3 finally kiss the earth and ex-\n       plode in a cloud of flame against a rocky escarpment -- metal and\n       earth mushrooming in a million directions!\n\n32.    EXT.  THE MOUNTAINSIDE                                         32.\n\n       As the raft rockets down the snow, Indiana clutches the front and\n       Willie and Short Round hold on for dear life on either side of\n       him.\n\n       The raft plummets down the mountain, crossing the timber-line and\n       entering a forest.  Bouncing over a snow-hidden log, the raft\n       shoots directly for a tree --\n\n       Indiana pulls on the perimeter rope, rolls on his side and man-\n       ages to swerve the raft so it caroms offthe snow-drifted side of\n       the tree trunk.\n\n       Continuing its downhill run, the raft smashes across a small\n       steam, sending silvery water spraying.\n\n       As the raft skids below the snow-level, it starts bouncing over\n       rocky ground and its three passengers' teeth start chattering.\n\n33.    EXT.  A BLUFF                                                  33.\n\n       The yellow raft crashes through a tangle of bushes and then plum-\n       mets toward a bluff!  The raft goes airborne over a small bluff\n       and lands with a splash in a slow-moving river.\n\n34.    EXT.  THE RIVER                                                34.\n\n       The life raft drifts down the river and Indy looks around and\n       smiles cockily at Willie and Short Round --\n\n       Their faces don't show gratitude, but horror -- Indy hears some-\n       thing and turns to see:\n\n35.    EXT.  WHITE WATER RAPIDS                                       35.\n\n       The raft is heading directly toward a surging stretch of treach-\n       erous rapids.  Indiana looks less cocky as he and Willie and\n       Short Round hold on again for dear life!\n\n       The raft plunges into the roaring torrent, bouncing over rock-\n       swollen waves, twisting and spinning through narrow gaps.  The\n       three helpless passengers are drenched in the thundering cascades\n       of white water.\n\n       Willie is hallering, Short Round hangs on wide-eyed and even Indy\n       looks terrified as the raft crashes down the rapids.  Finally,\n       after one heart-stopping bounce, the raft seems to slow.\n\n36.    EXT.  RIVER CLEARING                                           36.\n\n       The raft drifts out of the main part of the river and glides to-\n       ward a clearing.  Its three soaked and bedraggled passengers lie\n       motionless in the bottom.\n\n       Indy's hand drags alongside the raft, his fingers leaving a trail\n       in the almost still water.  Battered and exhausted, but always\n       Indy's \"bodyguard\", Shorty looks over at him worriedly --\n\n                                   SHORT ROUND\n                       Indy?\n\n                                   INDIANA\n                       Okay, Shorty.\n\n       Indy looks over at Willie who is moaning.\n\n                                   INDIANA (Cont'd)\n                       You all right?\n\n                                   WILLIE\n                       No... I'm not cut out for the\n                       kind of life you lead.\n                                  (moaning)\n                       Oh no...I ripped my dress.  Where\n                       are we anyway?\n\n       The raft floats to a gentle stop -- we see it nudge against a\n       pair of dark feet.  Indy squints up into the sun and sees some-\n       thing.\n\n                                   INDIANA\n                       India...\n\n                                   WILLIE\n                       Holy cow -- India?  How do you\n                       know we're in --\n\n       She rolls over and yelps as she looks up at the bizarre, painted\n       face of a SHAMAN.  Silhoutted against the blazing sun, the skin-\n       ny little old man in a loincoloth stares down at them in the raft.\n\n       An eerie wind rises and howls.  The old man places his palms to-\n       gether and moves his hands up to touch his forehead.  Willie and\n       Short Round watch mystified as Indiana returns the old shaman's\n       silent greeting.\n\n                                                               CUT TO:\n\n37.    EXT.  THE MAYAPORE HILLS - DAY                                 37.\n\n       Indya and Short Round follow the shaman and four peasants down a\n       gutted path through barren rolling hills.  Willie is out of her\n       milieu, stumbling along this forlorn landscape in high heels,\n       tuxedo jacket and disheveled lame gown.\n\n       She hears the old shaman talking to Indy and catches up with them\n       to find out what's going on.\n\n                                   WILLIE\n                                (to Indiana)\n                       What'd he say?\n\n                                   INDIANA\n                       He told me they knew I was coming\n                       here.\n\n                                   WILLIE\n                       What do you mean -- how?\n\n                                   INDIANA\n                       The old man saw it in a dream.\n\n                                   WILLIE\n                       Dream -- nightmare is more like it.\n\n                                   INDIANA\n                       He said that's whey they were at\n                       river -- they were waiting for\n                       the plane to fall down.\n\n       He looks at her bewildered face and smiles faintly.  As they\n       walk, a hot wind swirls dust around them,  a wind slowly ravaging\n       what soil is left in this terribly blighted region.\n\n                                                               CUT TO:\n\n38.    EXT.  MAYAPORE - DAY                                           38.\n\n       At the base of the hills, Mayapore village does nothing to re-\n       lieve the awful sense of devastation.  A desolate road runs\n       through the village, along which groups of ptiifully poor vil-\n       lagers stare at the strangers being brought in.\n\n       Hopeless women lift buckets from a dry well -- finding only sand.\n       Skinny miserable dogs skulk between the decrepit village huts,\n       eyed by the patient vultures lurling in scraggly trees.\n\n       Indiana notices the wretched peasants staring at Short Round,\n       some of them pointing at him, a few haggard women shedding tears\n       down their wrinkled faces as the little Chinese boy passes.\n\n       There is no sign of children in the village and Short Round grows\n       frightened by the odd attention.  He moves closer to Indy as they\n       pass the devastated population.\n\n                                                               CUT TO:\n\n39.    RXT.  MAYAPORE VILLAGE - AFTER SUNSET                          39.\n\n       Black clouds clot across the blood-red sky as darkness falls.\n       Indiana, Willie and Short Round sit tensely on a shabby rug.\n       Above their heads, there is a thatched roof, but there are no\n       walls.\n\n       The dying sunset silhouettes them and the half-dozen elders seat-\n       ed in the dirt around them.  A grey-haired man, the village\n       CHIEFTAIN, gives quiet commands to the women who scuttle in and\n       set wooden plates in front of the three visitors.  No plates are\n       places in front of the elders.\n\n                                   WILLIE\n                               (quietly to Indy)\n                       I hope this means we're going to\n                       get some dinner.\n\n       Indiana sees the painted shaman, who sits next to the chieftain,\n       watching Willie.  The women bring in a bowl from which they scoop\n       tiny portions of grey gruel onto three plates.\n\n       To this the women add a few grains of yellowed rice and a with-\n       ered ,molding piece of fruit.  Willie looks aghast at the unappe-\n       tizing combination.\n\n                                   WILLIE\n                                  (quietly)\n                       God, I am starving, but I can't\n                       eat this...\n                                   INDIANA\n                       That's more food than these people\n                       eat in a week.\n                                  (pointedly) \n                       They're starving, too...\n\n       Willie looks around at the emaciated faces and feels like crawl-\n       ing into a hole.\n\n                                   WILLIE\n                       I'm sorry, I -- here, please.\n\n       She picks up her plate and gently hands it back to the women.\n       The chieftain finally speaks to them --\n\n                                   CHIEFTAIN\n                       You will rest here before you go\n                       on.\n\n                                   INDIANA\n                       We'd appreciate that.  This was an\n                       unexpected detour.  We'll have to go\n                       to Delhi now and find a flight west.\n\n                                   SHORT ROUND\n                                   (smiling)\n                       Indy is taking me to America.\n\n       All eyes are on Short Round.  Puzzled by this strange attention,\n       Shorty's smile fades nervously.\n\n                                   INDIANA\n                       I'm a professor.  I have to re-\n                       turn to the university.  Can you\n                       give us a guide to take us to Delhi?\n\n       The chieftain indicates a young villager sitting near them.\n\n                                   CHIEFTAIN\n                       Sanju will guide you.\n\n                                   INDIANA\n                       Thank you.\n\n       The old shaman speaks now for the first time.\n\n                                   SHAMAN\n                       On the way to Delhi, you will\n                       stop at Pankot.\n\n                                   INDIANA\n                                  (puzzled)\n                       Pankot isn't on the way to Delhi.\n\n                                   SHAMAN\n                       You will go to palace there.\n\n                                   INDIANA\n                       Hasn't the Pankot palace been de-\n                       serted since the Mutiny of 1857?\n\n                                   SHAMAN\n                                  (darkly)\n                       No. Now there is new Maharajah --\n                       and palace is powerful again.\n\n       The shaman looks around at his unfortunate people.\n\n                                   SHAMAN (Cont'd)\n                       It is Pankot Palace that kills my\n                       village.\n\n                                   INDIANA\n                       I don't understand.  What's hap-\n                       pened here?\n\n                                   SHAMAN\n                       The evil starts in Pankot.  Then\n                       like monsoon, it moves darkness\n                       over all country.\n\n                                   INDIANA\n                       What evil?\n\n                                   SHAMAN\n                       They came from Palace and took\n                       sivalinga from out village.\n\n       Willie looks over at Indiana --\n\n                                   WILLIE\n                       Took what?\n\n                                   INDIANA\n                       It's a sacred stone in a shine\n                       that's supposed to protect a\n                       village.\n\n                                   SHAMAN\n                       It is why Krishna brought you here.\n\n                                   INDIANA\n                               (politely firm)\n                       Nobody brought us here.  Our plane\n                       crashed.  We were shot down by --\n\n                                   SHAMAN\n                              (interrupting)\n                       No.  We pray to Krishna to help us\n                       find the stone.  It was Krishna who\n                       made you fall from sky -- so you can\n                       got to Pankot Palace.  To find siva-\n                       linga -- and bring back to us.\n\n       Indy's about to object -- then he looks at the sad chieftain, the\n       elders and peasants who are watching him helplessly.  And he sees\n       again the dark steady eyes of the old shaman.\n\n                                                               CUT TO:\n\n40.    EXT.  MAYAPORE VILLAGE - NIGHT                                 40.\n\n       Torches falre eerily and dogs howl as the peasants accompany the\n       shaman, elders and three visitors out ot the edge of the dark\n       village.  Short Round walks beside Indy.\n\n                                   SHORT ROUND\n                       Indy, they make out plane crash?\n                       To get you here?\n\n                                   INDIANA\n                       It's just superstition, Shorty.\n                       Like a ghost story.\n\n       Short Round looks plenty scared as they all stop walking.  The\n       shaman motions and the men with torches circle around a pile of\n       rocks to illuminate them.  The shaman makes a gesture of devotion\n       to the primitive shrine and Indy speaks to the village chieftain.\n\n                                   CHIEFTAIN\n                       Yes.\n\n       Indiana seems skeptical as he kneels to study the shrine.  On top\n       of the pile of rocks, there is a carved niche.  The niche is\n       empty but an indentation indicates the conical shape of the stone\n       that was stolen.\n\n                                   INDIANA\n                       Was the stone very smooth?\n                                 (he sees the\n                                 chieftain nod)\n                       It was probably brought here from\n                       a sacred river.\n\n                                   SHAMAN\n                              (joining Indy and\n                               the chieftain)\n                       Long ago -- before my father's\n                       father.\n\n                                   INDIANA\n                       And it had three lines painted\n                       across it?\n                                  (seeing the\n                                   shaman nod)\n                       The lines represent the three\n                       levels of the universe.  I've seen\n                       stones like the one you lost.\n\n       Indy stands slowly.  Willie is beside him looking at the shrine.\n\n                                   WILLIE\n                       I don't understand how losing one\n                       rock could destroy this village.\n                             (whispering to Indy)\n                       Is it really powerful?\n\n       Indy gives a doubtful smile.  He turns again to the old shaman.\n\n                                   INDIANA\n                       But why would the Maharajah take\n                       this sacred stone?\n\n                                   SHAMAN\n                       They say we must pray to their\n                       evil god.  We say we will not.\n\n       The old shaman looks off and fights the tears in his eyes as he\n       starts speaking in Hindi.\n\n                                   INDIANA\n                                 (translating)\n                       He says that when the sacred stone\n                       was taken the village wells dried\n                       up first and then the river stopped.\n\n       Indy turns and asks the shaman a question in Hindi.  The shaman\n       answers in Hindi.\n\n                                   INDIANA\n                                   (translating)\n                       He says their crops dies and then\n                       the animals died.\n\n       The shaman walks to the edge of the torchlight and looks out into\n       the darkness as he continues speaking emotionally in Hindi --\n\n                                   INDIANA\n                                   (translating)\n                       And then they took their children.\n\n                                   WILLIE\n                       Their children?\n\n       She looks at Short Round and finally understands the sorrowful\n       faces always watching him.  Indy asks another question in Hindi\n       and the shaman continues his story --\n\n                                   INDIANA\n                                   (translating)\n                       He says one night there was a fire\n                       in the fields.  The men went to\n                       fight it.  When they came back,\n                       they heard the women crying in the\n                       darkness.  And the children were\n                       gone.\n\n       The shaman walks slowly toward Indiana.\n\n                                   SHAMAN\n                       You will find them when you find\n                       sivlalinga.\n\n                                   INDIANA\n                       I'm sorry, I don't know how I can\n                       help you here.\n\n       The shaman and the chieftain stare and Indiana, refusing to accept\n       that.\n\n                                   INDIANA (Cont'd)\n                       The English authorities who con-\n                       trol this area are the only ones\n                       who can help you.\n\n                                   CHIEFTAIN\n                       They do not listen.\n\n                                   INDIANA\n                       I have friends in Delhi and I will\n                       make sure they investigate this...\n\n                                   SHAMAN\n                       No, you will got to Pankot...\n\n       The old man speaks again in his own tongue and Indy looks dis-\n       turbed.\n\n                                   WILLIE\n                       What'd he say now?\n\n                                   INDIANA\n                       It was destined that I came here --\n                       and the future cannot be changed...\n\n       Indy looks ath the shaman and the torchlight reflected in his\n       eyes.\n\n                                                               CUT TO:\n\n41.    EXT.  MAYAPORE - NIGHT                                         41.\n\n       Suddenly we're rushing headlong down a dark dirt path seen from\n       the POV of somebody running in terror.  We hear heavy breathing\n       -- above we see the scraggly trees blowing against the full moon\n       as an eerie wind rises and howls.  We continue crashing through\n       the dying fields tward the dark village...\n\n42.    INT.  INDIANA'S HUT - NIGHT                                    42.\n\n       The wind swirls into the hut and Indiana's eyes open.  He lies\n       still a moment and then sits up slowly.  He sees Short Round\n       sleeping nearby.\n\n       Sensing something strange, Indy gets to his feet.  He steps\n       around Short Round and goes to the door of the hut.\n\n43.    EXT.  THE HUT - NIGHT                                          43.\n\n       Indy walks against the rising wind and looks around.  The village\n       is asleep and seems deserted.  Then he turns and sees something.\n\n       We follow small bare feet stumbling through the dust...\n\n       Indy sees an emaciated child in rag running out of the darkness.\n       Indiana moves forward and the child runs toward him.  Indy grabs\n       the little boy as he falls into his arms.\n\n                                                               CUT TO:\n\n44.    INT.  THE SHAMAN'S HUT - NIGHT                                 44.\n\n       A few minutes later, the little boy is lying unconscious on a\n       blanket.  Elders crouch around him.  Indy is kneeling and watches\n       the shaman wet the boy's forehead with a rag and drip water onto\n       his lips.\n\n       The little boy's eyes open and he begins to revive.  Shrot Round\n       And Willie watch from a corner as the little boy looks at all the\n       faces peering down at him.\n\n       The little boy's arm moves and he reaches out to Indy rather than\n       any of the others.  Indy takes his small hand and sees that the\n       boy's fingers are cut and bruised -- his fingers open and drop\n       something into Indy's hand.\n\n       The little boy tries to whisper.  Indy has to lean close to hear\n       as the little boy's lips move again --\n\n                                   LITTLE BOY\n                       Sankara...\n\n       A mother rushes into the hut now and kneels and hugs her little\n       boy.  His skinny arms go around her as they are reunited.  Indy\n       stands slowly and looks at what the little boy gave him --\n\n       It is a small tattered piece of cloth:  an old fragment of a mini-\n       ature painting.  Indiana looks at it with an expression of recog-\n       nition and apprehension...\n\n                                   INDIANA\n                       Sankara...\n\n45.    EXT.  THE VILLAGE - MORNING                                    45.\n\n       The camera follows Indiana -- he's walking fast and determinded-\n       ly.  Villagers trot alongside of him, trying to keep up with is\n       pace as he questions thm in Hindi.\n\n       Indy approaches two large elephants and sees their guide Sajnu\n       trying to politely drag Willie toward one of them.\n\n                                   INDIANA\n                       Damn it , Willie, get on -- we've\n                       got to move out!\n\n       Willie's head comes up over the back of the elephant as she's\n       helped from below -- there is a look of sheer terror on her face.\n\n                                   WILLIE\n                       Whoa!  Easy now -- nice elephant...\n\n       Waiting by the second elephant, Short Round sees Indy coming and\n       runs up to him --\n\n                                   SHORT ROUND\n                       I ride with you, Indy?\n\n                                   INDIANA\n                       Nope, you got a little surprise\n                       over there, Shorty.\n\n       Short Round runs around the big elephant and sees a baby elephant\n       being brought out.  He can't believe his luck --\n\n                                   SHORT ROUND\n                       Oh boy!\n\n       Meanwhile Sajnu goads Willie's elephant over.  The villagers look\n       grief stricken and many are crying as they watch the three stran-\n       gers' departure.\n\n                                   WILLIE\n                               (to Short Round)\n                       This is the first time anybody\n                       ever cried when I left.\n\n                                   SHORT ROUND\n                       They don't cry about you.  They\n                       cry about the elephants leaving.\n\n                                   WILLIE\n                       Figures...\n\n                                   SHORT ROUND\n                       They got no food to feed them.  So\n                       they taking the elephants away to\n                       sell them.\n\n       Indy lumbers over on his elephant.\n\n                                   INDIANA\n                       All right, let's go.  I want to get\n                       to Pankot before tomorrow night.\n\n       She looks at Indiana as he rides past.\n\n                                   WILLIE\n                       Pankot?!  I thought we were going\n                       to Delhi!  Hey, wait a minute!\n                                (looking at\n                                 the villagers)\n                       Can't somebody take me to Delhi?!\n                       I don't want to go to Pankot!\n\n       Sajnu guides her elephant and Willie lurches forward --\n\n                                   WILLIE (Cont'd)\n                                  (yelling) \n                       Indiana!  Damn it!  Why'd you\n                       change your mind?  What did that\n                       kid tell you last night?!\n\n       Indy ignores her hollering.  The elephants move off through the\n       crowds of pitiful villagers.  Indy sees the elders, chieftain and\n       the old shaman who brings his hands up to his forehead as Indy\n       rides past.\n\n                                                               CUT TO:\n\n46.    EXT.  THE COUNTRYSIDE - DAY                                    46.\n\n       The elephants move across the desolate countryside toward the\n       distant hills.\n\n47.    EXT.  THE TRAIL                                                47.\n\n       Indiana rides the lead elephant.  Sajnu passes on foot guiding\n       Willie's elephant.  With the tuxedo jacket wrapped around her\n       waist, Willie is dabbing perfume behind her ears.\n\n                                   WILLIE\n                             (to her elephant)\n                       I think you need this more than\n                       me.\n\n       Willie leans forward and puts perfume behind the elephant's ears.\n       Grimacing at the animal's smell she simply dumps the rest of the\n       perfume on the elephant's back.\n\n       Willie yelps when the elephant's trunk comes back, sniffs the\n       foriegn fragrance and suddenly trumpets in disgust.\n\n                                   WILLIE (Cont'd)\n                       What're you complaining about,\n                       this is expensive stuff!\n\n                                                               CUT TO:\n\n48.    EXT.  LOWER JUNGLES - DAY                                      48.\n\n       From a cliff, we see the elephants below passing into the lower\n       jungles.\n\n       Spotting something on an overhanging tree branck, Short Round\n       stands up precariously on the baby elephant's back.  He pulls a\n       vine from the tree as they pass under it.  Plopping down onto the\n       baby elephant's back, he picks the wild fruit from the vine --\n\n                                   SHORT ROUND\n                       Here you go, lunch time!\n\n       The baby elephant's trunk comes back and takes the fruit.  Shorty\n       looks up in the sky.\n\n                                   SHORT ROUND (Cont'd)\n                       Indy, look!\n\n       Indiana and Willie look up and see hundreds of enormous winged\n       creatures flapping across the afternoon sky.\n\n                                   WILLIE\n                       Those are very big bird.\n\n       Sajnu says something and Indiana nods.\n\n                                   INDIANA\n                       Those aren't birds -- those are\n                       giant bats.\n\n       Willie shudders as she watches the bats.\n\n                                                               CUT TO:\n\n49.    EXT.  THE HILLS - AFTERNOON                                    49.\n\n       An enormous sun silhouettes the three elephants trekking west-\n       ward.\n\n                                                               CUT TO:\n\n50.    EXT.  A RIVER - LATER AFTERNOON                                50.\n\n       The three elephants stand sucking up river water with their\n       trunks.  Seated on the huge beasts, Willie, Short Round and Indi-\n       ana watch the thirsty animals.\n\n                                   WILLIE\n                       They must be pretty dumb to drink\n                       that awful-looking water.\n\n       In response, Willie's elephant calmly lifts its trunk and sprays\n       her in the face.  Short Round and Indy laugh as Willie sits\n       soaked and shocked.\n\n                                   INDIANA\n                       I think maybe we'll camp here.\n\n                                                               CUT TO:\n\n51.    EXT.  THE RIVER - SUNSET                                       51.\n\n       A plume of water sprays.  The three elephants submerge in a deep,\n       wide spot in the river.  Indy wades in the current with his shirt\n       off.  He and the guide splash water on the weary animals.\n\n       Short Round laughs and plays with the baby elephant.  Wrapped in\n       its trunk, he's swung in the air and lands on the elephant's\n       back.  Shorty makes a swan dive back into the water and the baby\n       elephant gives him a shower when he surfaces.\n\n52.    EXT.  UPRIVER                                                  52.\n\n       Thirty yards upstream, birds and monkeys chatter in a tree.  In\n       the shady river beneath, Willie surfaces cooly and wipes hair\n       from her eyes.  She hums contendedly.\n\n       Indiana wanders up the riverbank in his dripping trousers.  He\n       notices Willie's wet clothes spread over a tree limb hanging low\n       over the water and then he sees Willie paddling around.\n\n                                   INDIANA\n                       Hey, Willie -- I think you better\n                       get out now.\n\n                                   WILLIE\n                       Stark naked?  You wish... If you're\n                       trying to seduce me, Dr. Jones,\n                       this is a very primitive approach.\n\n                                   INDIANA\n                       Me seduce you?  Honey, you're the\n                       one who took your clothes off.\n                                  (shrugging)\n                       I just came over to remind you\n                       that you never know what else\n                       might be in the water.\n\n                                   WILLIE\n                       Somehow I feel safer in here.\n\n       As Indy turns and starts off, Willie reaches up to the tree\n       branch above her head and grabs her underwear.  At this moment we\n       notice something awful:\n\n       A BOA CONSTRICTOR is moving out along the branch, the enormous\n       snake slithering over Willie's clothes.\n\n       Willie watches Indiana walk away as she reaches up for her dress\n       -- her hands feel something strange -- not the dress and not the\n       tree limb --\n\n       Willie looks up and sees that she's pulling on a snake! She\n       SCREAMS as the boa constrictor falls off the t-ee on top of her!\n\n       Indy hears the scream and hears Willie calling to him.  He runs\n       back toward the river.  Stopping on the riverbank, he sees Willie\n       backing away in the water -- Indiana's already starting to pull\n       his boots off --\n\n                                   WILLIE\n                       Indy!  Help me!\n\n                                   INDIANA\n                       Don't worry, I'm coming in!  What\n                       is it?\n\n                                   WILLIE\n                       A snake!\n\n       Suddenly Indiana freezes and a strange look corsses his face --\n\n                                   INDIANA\n                       A what...?\n\n                                   WILLIE\n                       A SNAKE!!\n\n       He finally sees the boa constrictor thrashing in the water close\n       to Willie.  He leaves his boots on.\n\n                                   WILLIE (Cont'd)\n                       Hurry, help me out of here!\n                       What're you waiting for?!\n\n                                   INDIANA\n                       Uh, listen -- Willie -- I got a\n                       better idea.\n\n                                   WILLIE\n                       What?!\n\n                                   INDIANA\n                       First of all -- don't panic!\n\n       Willie suddenly screams as the boa constrictor wraps around her\n       arm --\n\n                                   WILLIE\n                       It's got me !  Indy, help me!\n\n       Indy runs along the riverbank, trying to get closer to her, but\n       not about to jump into the river (due to his aversion to snakes\n       -- see Episode One:  \"Raiders of the Lost Ark\").\n\n                                   INDIANA\n                       Don't let it pull you deeper!\n\n                                   WILLIE\n                       It's pulling me deeper!\n\n                                   INDIANA\n                       Don't let it curl around you!\n\n                                   WILLIE\n                       It's curling around me!  Damn it,\n                       stop talking and do something!\n\n       The snake is wrapping around her body and neck -- her head is\n       barely above water --\n\n       On the riverbank, Indy reaches down and grabs a piece of wood.\n       But as he watches the repulsive reptile, he starts to sweat and\n       his fear and loathing overpower him --\n\n                                   WILLIE (Cont'd)\n                       What's wrong?!  Indy please help\n                       me!\n\n       Indy groans and bolsters his courage -- he takes two steps into\n       the water -- but the complex is to strong and he can't go any\n       further.  He drops the piece of wood...\n\n                                   INDIANA\n                       Listen, Willie.  Do exactly what\n                       I tell you now.\n\n                                   WILLIE\n                       What?!\n\n                                   INDIANA\n                       Can you move your arm?\n\n                                   WILLIE\n                       Just one arm!\n\n                                   INDIANA\n                       Okay, I want you to lift your hand --\n                       and pet the snake.\n\n                                   WILLIE\n                       PET IT??!!\n\n                                   INDIANA\n                       Yes, stroke it right along the\n                       maxillary and precaudal verte-\n                       brae.\n\n                                   WILLIE\n                       THE WHAT?!\n\n                                   INDIANA\n                       Pet it on the head!  Go on, pet\n                       it!\n\n       In the water, Willie is whimpering as she lifts her hand and\n       starts petting the snake  coiling around her pale body.\n\n                                   WILLIE\n                       Oh -- my -- god -- it's going to\n                       crush me!\n\n                                   INDIANA\n                       Keep stroking it!\n\n       Willie keeps rubbing her hand along the snakes head and back and\n       it slowly stops thrashing in the water.\n\n                                   INDIANA (Cont'd)\n                       What's happening?\n\n                                   WILLIE\n                       It's starting to let go!\n\n                                   INDIANA\n                       That's good  -- you're doing fine.\n\n       Grimacing as she stares at the ugly serpent's head, Willie keeps\n       stroking it.\n\n                                   WILLIE\n                       It's letting fo.  I think it's --\n                       I think it's going to sleep!\n\n       Indiana looks relieved.  He sees the snake starting to drift away\n       from Willie and she starts paddling back to shore, collecting her\n       floating clothes along the way.\n\n       Holding her dripping dress against herself, she walks out of the\n       water toward Indy who smiles at her weakly.\n\n                                   INDIANA\n                       See -- I got you out...\n\n       She slows and hauls off and punches him in the mouth.  Indy holds\n       his jaw as she walks away infuriates.\n\n                                   WILLIE\n                       Thanks for nothing!  I hate snakes!\n\n                                   INDIANA\n                                  (looking at\n                                   the water)\n                       I know the feeling...\n\n                                                               CUT TO:\n\n53.    EXT.  THE CAMPSITE - NIGHT                                     53.\n\n       By firelight, we see Sajnu feeding the big elephants while Short\n       Round feeds and talks to the baby elephant --\n\n                                   SHORT ROUND\n                       You come to America with me, and\n                       we can get job in the circus --\n                       you like that?\n\n       The baby elephant trumpets affirmitively.\n\n       A ways off, Willie stands wrapped in a blanket watching Shorty\n       and the elephant as she dries her hair by a campfire.  Now Indy\n       comes up and drops an armload of wood for yet another fire.\n\n                                   WILLIE\n                       Where'd you find your little body-\n                       guard?\n\n                                   INDIANA\n                       I met Short Round when he tried\n                       to pick my pocket.\n\n       Indiana kneels and arranges the wood.\n\n                                   INDIANA (Cont'd)\n                       Shorty's family was killed when\n                       they bombed Shanghai.  He was\n                       living on the streets.\n\n                                   WILLIE\n                                  (smiling)\n                       He'll be okay.  He's a good kid.\n\n       Indy strikes a match and lights the new fire.\n\n                                   WILLIE (Cont'd)\n                       All these fires -- you expecting\n                       more snakes, Dr. Jones?\n\n       She smiles snidely and continues drying her hair.\n\n                                   INDIANA\n                       By the way, how'd you end up in\n                       Shanghai?\n\n                                   WILLIE\n                       Well, when my nightclub career was\n                       run over by the Depression, some\n                       pinhead convinced me that \"a girl\n                       could go places in the Orient...\"\n                       So, look where I got.\n\n       Indy picks up a blanket and spreads it on the ground.\n\n                                   INDIANA\n                       What about the future?\n\n                                   WILLIE\n                       Oh, that's easy -- I'm going to\n                       latch onto a good-looking, in-\n                       credibly rich prince.\n\n       Indy lies down on the blanket.\n\n                                   INDIANA\n                       I'd like to find one of those\n                       myself.\n\n                                   WILLIE\n                           (raising an eyebrow)\n                       Oh really?\n\n                                   INDIANA\n                       Yeah, but he's got to be dead and\n                       buried for a couple of thousand years.\n                                  (smiling)\n                       Fortune and glory...\n\n                                   WILLIE\n                       Is that what you're hoping to find\n                       at this palace, Dr. Jones?\n\n                                   INDIANA\n                       Maybe...\n\n       Indy reaches into his pocket and removes the old piece of cloth.\n\n                                   WILLIE\n                       What's that?\n\n       She walks over to where he's lying down and sits on a boulder.\n       He hands her the cloth and she looks at it by the firelight.\n\n                                   INDIANA\n                       Something that kid gave me last\n                       night.  It's a piece of an old\n                       manuscript.\n\n       Willie sees a crude drawing in reds, blue and gold.\n\n                                   INDIANA (Cont'd)\n                       The drawing shows a priest named\n                       Sankara who lived centuries ago.\n\n                                   WILLIE\n                       What does the writing say?\n\n                                   INDIANA\n                       It's Sanskrit.  It tells the story\n                       of Sankara climbing Mt. Kalisa\n                       where he met the Hindu god Shiva.\n\n                                   WILLIE\n                               (examining it)\n                       That's Shiva?  What's he giving\n                       the Priest?\n\n                                   INDIANA\n                       Legend says he told Sankara to go\n                       forth and combat evil.  To do that\n                       he gave him five sacred stones that\n                       had magical powers.\n\n                                   WILLIE\n                               (looking at Indy)\n                       You mean magical like the rock that\n                       was stolen from that village?\n\n       Indy looks at her meaningfully.\n\n                                   INDIANA\n                       It could be.\n\n       Willie seems frightened.  She hands him the piece of cloth and\n       stands up.\n\n                                   WILLIE\n                                   (quietly)\n                       Fortune and glory...sweet dreams,\n                       Dr. Jones.\n\n       She picks up a blanket and starts off.\n\n                                   INDIANA\n                       I think you should sleep closer.\n                                (seeing her sus-\n                                 picious look)\n                       I meant for safety.\n\n                                   WILLIE\n                                  (smiling)\n                       I'd be safer sleeping with\n                       that snake.\n\n       She steps over to a tree by the fire where her clothes are dry-\n       ing.  Indy watches her pull her dried clothes from the lower\n       branches.\n\n       She reaches up to remove another piece of her clothing -- it's\n       stuck to the tree and she looks up and yanks it.  Suddenly the\n       piece of clothing moves!\n\n       Two enormous winds open and the hideous face of a GIANT BAT\n       screeches and hisses at Willie!  She screams hysterically as the\n       bat flaps against her, biting and scratching at her before it fi-\n       nally takes off.\n\n       The bat flies off into the darkness and Indy chuckles as he\n       watches Willie shanking as she backs slowly toward the fire --\n\n                                   WILLIE\n                       Did you see it?!  It was one\n                       of those bats!\n                                   (staring into\n                                    the darkness)\n                       God, what else is out there...?!\n\n       She quickly picks up her blanket and lays it out very close to\n       Indy.\n\n                                   INDIANA\n                       Couldn't keep away, huh?\n\n                                   WILLIE\n                       Just try and control yourself.\n\n       Indiana watches her lie down and wrap herself in her blanket.\n       then he rolls over and tips his hat down over his eyes to get\n       some well-deserved shut-eye.\n\n       In a moment, however, we see something grotesque and snake-like\n       slide into frame and move towards Indy -- finally, we realize\n       it's an elephant's trunk.  The trunk nudges Indy's shoulder.\n\n                                   INDIANA\n                              (without looking)\n                       Still scared?  Okay, Willie, you\n                       can get closer if you want...\n\n       The elephant's trunk moves closer and nuzzles Indy's neck.\n\n                                   INDIANA\n                       Honey, I knew you'd be the first\n                       one to give in...\n\n       Now, we see that Short Round is guiding the baby elephant's trunk\n       with a prod.  Willie watches, stifling a laugh as the elephant's\n       trunk sniffs Indiana's ear --\n\n                                   INDIANA (Cont'd)\n                       You're going to start something\n                       I'm going to have to finish.\n                                  (moaning)\n                       Okay, doll, you asked for it.\n\n       Indiana rolls over, lifts his hat and hollers!  He nearly jumps\n       out of his pants as he stares into the elephant's trunk.  Willie\n       and Short Round dissolve into laughter.\n\n                                                               CUT TO:\n\n54.    EXT.  THE JUNGLE - DAY                                         54.\n\n       Tall, vine-covered trees sway in the wind.  Beneath them, the el-\n       ephants plough through the dense tropical forest.  The sounds of\n       the teeming jungle multiply as Short Round surveys the distant\n       hills.\n\n                                   SHORT ROUND\n                       Indy, look!\n\n                                   INDIANA\n                       That's it.  Pankot Palace.\n\n       Willie looks off at the resplendent while Moghul-style palace ri-\n       sing in the distance above the jungle.\n\n                                                               CUT TO:\n\n55.    EXT.  A JUNGLE CLEARING - LATER                                55.\n\n       Their Mayapore guide walks toward the camera and suddenly looks\n       frightened.  He barks commands and the elephants stop.  Indiana\n       jumps down an joins the fearful guide.\n\n       They stare at a small statue of a malevolent goddess with eight\n       arms.  Around the goddess's neck, a carved necklace displays\n       small human heads -- her eight hands hold other heads by their\n       hair.\n\n       Indiana moves closer to the statue as the terrified guide backs\n       away.  Indy is fascinated by the ritual objects adorning it:\n       leaves, dead birds, rodents and turtles.  Indiana grimaces as he\n       lifts a necklace of real pierced human fingers...\n\n                                   WILLIE (O.S.)\n                       Why are we stopping here?\n\n       Indiana goes back and joins the scared, jabbering guide who is\n       helping Willie down from the elephant.  Short Round jumps down.\n\n                                   SHORT ROUND\n                       What you look at, Indy?\n\n                                   INDIANA\n                       Just a statue.\n\n                                   WILLIE\n                       What's the guide talking about?\n                       He hasn't said a word the whole\n                       trip.\n\n       Indy listens to the agitated guide and then speaks a few words in\n       Hindi back to him.  They watch the distressed guide trun the ele-\n       phants and start away with them as fast as possible.\n\n                                   WILLIE\n                       He's afraid of something.\n\n                                   INDIANA\n                       He said he couldn't take us any\n                       farther.  He has to go sell the\n                       elephants.\n\n                                   WILLIE\n                       You mean we have to walk the rest\n                       of the way?\n\n       Willie moans and follows Indy.  Short Round watches the elephants\n       trudging away.  The little elephant turns and looks back.  Short\n       Round quickly wipes a tear from his face.\n\n                                                               CUT TO:\n\n56.    EXT.  A PALACE APPROACH - AFTERNOON                            56.\n\n       Indiana and Short Round hike up a rock-paved road beside a high\n       wall.  Exhausted, carrying her high heels, Willie trudges along\n       behind them.\n\n                                   WILLIE\n                       -- shot at, fallen out of a plane,\n                       nearly drowned, squashed by a snake,\n                       attacked by a bat -- I smell like\n                       an elephant!\n                                 (yelling)\n                       I tell you I'm not going to make it!\n\n       Indiana finally stops.  He walks back to Willie, suddenly picks\n       her us in his arms and starts carrying her the remaining way.\n       Willie is surprised and puzzled.\n\n                                   INDIANA\n                       Any more complaints?\n\n                                   WILLIE\n                              (smiling faintly)\n                       Yeah, I wish you'd thought of this\n                       sooner...\n\n       She doesn't seem to mind being carried by Indy.  He arrives at\n       the entrance to the palace and puts her down -- she stands close\n       to him and he gently smoothes the collar of her dress.\n\n                                   INDIANA\n                       It doesn't feel like there's been\n                       any permanent damage.\n\n       She smiles at him again and then turns around -- and whistles as\n       she sees Pankot Palace:  a sprawling, monumental mixture of Mo-\n       ghul and Rajput styles, the palace is an extravaganza of Princely\n       architecture.\n\n57.    EXT.  A BRIDGE                                                 57.\n\n       The three travelers start across a marble bridge toward the main\n       entrance.  Lined along the bridge, palace guards stand with\n       lances.\n\n       As the threesome passes, the first Rajput guard snaps noisily to\n       attention and Willie jumps.  As Willie continues across the\n       bridge, the other guards snap to attention in sequence and she\n       grins, enjoying the attention.\n\n58.    INT.  THE OUTER COURTYARD                                      58.\n\n       Short Round and Willie follow Indiana through a dark archway into\n       a glittering courtyard.  The palace seems deserted and forebod-\n       ing.\n\n                                   INDIANA\n                       Hello?...(hello?)...(hello?)\n\n       Indy's voice echoes off the marble facades -- three enormous Raj-\n       put guards with curved swords in their sashes appear silently at\n       opposite sides of the courtyard.\n\n                                   WILLIE\n                               (frightened)\n                       Hi...(hi)...(hi)...\n\n       Then, a tall severe-looking Indian in an English suit material-\n       izes out of the shadows and comes forward slowly.  CHATTAR LAL\n       appraises the intruders suspiciously:\n\n       He sees a whoozy beauty in a weary evening gown;  a dirty Chinese\n       kid with a baseball cap; a rugged-looking American carrying a\n       bullwhip...\n\n                                   CHATTAR LAL\n                       I would say you look rather lost.\n                                  (disdainfullt)\n                       But then I cannot imagine where\n                       in the world the three of you\n                       would look at home...\n\n                                   INDIANA\n                                (smiling evenly)\n                       Lost?  No, we're not lost.  We're\n                       on our way to Delhi.  This is Miss\n                       Scott -- and Mr. Round.  My name's\n                       Indiana Jones.\n\n                                   CHATTAR LAL\n                                  (surprised)\n                       Dr. Jones?  The eminent archae-\n                       ologist?\n\n                                   WILLIE\n                       Hard to believe, isn't it...?\n\n                                   CHATTAR LAL\n                       I remember first hearing your name\n                       when I was studying at Oxford.  I\n                       Am Chattar Lal, Prime Minister for\n                       His Highness the Maharajah of Pankot.\n\n       He bows and Willie sort of curtsies.\n\n                                   CHATTAR LAL (Cont'd)\n                       Welcome to Pankot Palace.\n\n59.    INT.  PANKOT PALACE - AFTERNOON                                59.\n\n       They walk along the marble halls, past dazzling walls inlaid with\n       pieces of mirror and semi-precious stones.  Fountains spray in\n       ivory countyards and they gaze in awe at the ornate splendour.\n\n       As Willie walks with Shorty she appraises the chronolgoical\n       portraits of the Pankot Prices that line the hall.  Dissipated \n       faces, elegant faces, evil faces -- she reacts to them.\n\n                                   WILLIE\n                               (to Short Round)\n                       How'd you like to run into him in\n                       a dark alley...that one's kind of\n                       cute...I could see myself married\n                       to a prince like that...\n\n       Ahead of them Chattar Lal  walks with Indy and questions him\n       suspiciously --\n\n                                   CHATTAR LAL\n                       The plane crash and your journey\n                       here sound -- most incredible.\n\n                                   WILLIE\n                       You should have been there...\n\n                                   INDIANA\n                       We'd appreciate it if the Mahara-\n                       jah would let us stay tonight.\n                       We'll be on out way in the morn-\n                       ing.\n\n                                   CHATTAR LAL\n                       I am only his humble servant, but\n                       the Maharajah usually listens to\n                       my advice.\n\n                                   WILLIE\n                       Is that him?\n\n       They've come to the last in the row of Princes portraits.  Wil-\n       lie stops and looks up disappointedly at a picture of an aged,\n       immensely corpulent Rajput prince.\n\n                                   WILLIE (Cont'd)\n                                (politely)\n                       He's not exactly what we call\n                       \"a spring chicken\".\n\n                                   CHATTAR LAL\n                       No, no, that is Uhmed Singh, the\n                       present Maharajah's late father.\n\n                                   WILLIE\n                       Oh -- good.  And maybe the pres-\n                       ent Marahajah is a little younger?\n                       And thinner?\n\n       Two female servants approach silently and bow.\n\n                                   CHATTAR LAL\n                       They will escort you to your rooms\n                       now.  You will be provided with\n                       fresh clothes.  Tonight you will\n                       be dining with His Highness.\n\n                                   WILLIE\n                       Dinner?  And with a prince?!  My\n                       luck is changing.  But look at\n                       me -- my god, I've to to get\n                       ready!\n\n       She hurried off with one of the servants toward her room.  Chat-\n       tar Lal smiles cooly at Indiana --\n\n                                   CHATTAR LAL\n                       Eight o'clock in the Pleasure\n                       Pavilion.\n\n                                                               CUT TO:\n\n60.    EXT.  THE PLEASURE PALIVION - NIGHT                            60.\n\n       An extraordinary gold dome rises in the middle of the eleaborate\n       gardens.  The Pleasure Pavilion is ablaze with torch lights,\n       flickering candles and exotic music.\n\n       Indiana comes out of the palace with Short Round.  Indy has on a\n       tweed jacket and a nectie -- his university professor's outfit.\n       Short Round has been cleaned up, but still sports his baseball\n       cap.\n\n       Willie joins them, looking stunning is a silk Western-styled\n       gown.  She's also been loaned some Moghul jewelry which sparkles\n       on her neck and arms.\n\n                                   INDIANA\n                       You look like a princess.\n\n       Willie's flattered by the first nice thing Indy's said to her.\n\n                                   WILLIE\n                       It's sort of like being in heaven.\n\n       They cross the garden toward the pavilion and Willie's eyes are\n       like a kid's at Christmas.\n\n61.    INT.  THE PLEASURE PAVILION                                    61.\n\n       As they enter, Indiana gives a half-dressed dancing girl the\n       once-over as she spins to the music of drums and \"vinhas\".\n\n                                   INDIANA\n                                  (smiling)\n                       I've always had a weakness for\n                       folk dancing.\n\n                                   WILLIE\n                                  (snidely)\n                       She might get away with that act\n                       here, but she'd never make it in\n                       a real nightclub.\n\n       They walk among the rich court ministers and Indian merchants.\n       Chattar Lal approaches with a British cavalry captain in unifrom.\n\n                                   CHATTAR LAL\n                       We are fortunate tonight to have\n                       some many unexpected guests.  his\n                       is Captain Phillip Blumburtt.\n\n       Blumburtt bows to Willie and Indiana.\n\n                                   CHATTAR LAL (Cont'd)\n                       Captain Blumburtt and his troops\n                       are here to check up on the\n                       \"natives\".\n\n                                   CAPT. BLUMBURTT\n                                  (politely)\n                       Just a routine inspection tour.\n\n                                   CHATTAR LAL\n                       The British worry so about their\n                       Emprie -- it makes us feel like\n                       well-cared-for children.\n\n                                   WILLIE\n                       Listen, Mr. Lal, what do you call\n                       the Maharajah's  wife?\n\n                                   CHATTAR LAL\n                       His Highness has not yet taken a\n                       wife.\n\n                                   WILLIE\n                                  (happily)\n                       No?  Well, I guess he just hasn't\n                       met the right woman...\n\n       As Willie chatters on with the Prime Minister, Indiana wanders\n       off.  He moves to a wall where bronze statues and strange devo-\n       tional objects are displayed.\n\n                                   CAPT. BLUMBURTT\n                                  (joining Indy)\n                       Interested in local curios?\n\n                                   INDIANA\n                       No.  But I am interested in the\n                       occult.  And this is a krtya.\n\n       Indiana picks up a small clay figurine and examines it.\n\n                                   CAPT. BLUMBURTT\n                                   (grimacing)\n                       Charming.\n\n                                   INDIANA\n                       It's like the voodoo dolls of West\n                       Africa.  The kryta represents your\n                       enemy -- and gives you complete\n                       power over him.\n\n                                   CAPT. BLUMBURTT\n                       That God all that mumbo jumbo\n                       rubbish is disappearing.\n\n                                   INDIANA\n                       You think so?\n\n                                   CAPT. BLUMBURTT\n                       Of course.  Admittedly, it's taken\n                       time.  Britian's controlled India\n                       for almost two hundred eyars now.\n\n       Indiana smiles at the somewhat pompous bureaucrat.\n\n                                   INDIANA\n                       You're hanging on better here\n                       than you did in America.\n\n                                   CAPT. BLUMBURTT\n                                  (smiling sourly)\n                       This is a different situation, Dr.\n                       Jones.  These people are like\n                       children.  We have to lead them\n                       slowly into the twentieth century.\n\n       Indiana puts the doll down and looks over at Chattar Lal and\n       Willie.\n\n                                   INDIANA\n                       The Prime Minister doesn't seem\n                       that naive.\n\n                                   CAPT. BLUMBURTT\n                       No, he's a very shrewd old boy.\n                       Power behind the throne and all\n                       that.  He actually runs this whole\n                       province.\n\n       Indy and the Prime Minister exchange distant looks as Willie\n       comes back over to Indiana.  She talks to him conspiratorially --\n\n                                   WILLIE\n                       I think this Maharajah is swim-\n                       ming in money.  Maybe coming here\n                       wasn't such a bad idea.\n\n       Blumburtt finds these Americans quite suspect and seems relieved\n       when he hears a drum.\n\n                                   CAPT. BLUMBURTT\n                       I believe we're being called to\n                       dinner.\n\n                                   WILLIE\n                       Finally!\n\n       As the drum beats the assembled guests move toward a long, low\n       table surrounded by colorful pillows.  Short Round follows with a\n       little monkey he's found perched on his arm.\n\n       As everyone stands around the table, Chattar Lal makes an an-\n       nouncement in Hindi and then in English --\n\n                                   CHATTAR LAL\n                       His Supremem Highness, guardian of\n                       Rajput tradition -- the Maharajah\n                       of Pankot -- Zalim Singh.\n\n       All eyes are on two solid silver doors which open -- and through\n       which now walks the MAHARAJAH ZALIM SINGH.  Everyone is bowing,\n       including Indiana and Willie, who looks amazed --\n\n                                   WILLIE\n                       That's the Maharajah -- that kid?!\n\n                                   INDIANA\n                       Maybe he likes older women.\n\n       Indeed, Zalim Singh is only thirteen.  Outfitted in silver and\n       gold brocade, festooned with enormous jewels, the litlle Mahara-\n       jah gazes imperiously at the bowing crowd -- and then glares at\n       Short Round.\n\n       Indy sees Short Round chewing gum, staring antagonistically at\n       the Maharajah.  Indy pushes SHort Round into a bowing position.\n\n       The Maharajah finally sits down on golden pillows.  He nods and\n       his guests take their seats.  Indiana sees Willie's dreams of\n       queendom have vanished.\n\n                                   INDIANA\n                       Cheer up, you lost your prince,\n                       but dinner's on the way.\n\n                                   WILLIE\n                       I've never been so hungry in my\n                       life...\n\n       Servants appear with silver platters of steaming food.  They\n       place a platter in front of Willie and she stares at it in amaze-\n       ment:\n\n       It's a whole raosted boar, replete with a decorative arrow pierc-\n       ing its bloated stomach and tiny broiled baby bores placed around\n       it as if they were suckling on their well-cooked mother.\n\n                                   WILLIE\n                                 (grimacing)\n                       My god, sort of grusome, isn't\n                       it...?\n\n       Seeing the meat being served, Indiana looks across the table at\n       Blumburtt who seems equally puzzled.  Meanwhile, the little Maha-\n       rajah whispers to his Prime Minsiter.  Then Chattar Lal speaks to\n       the table --\n\n                                   CHATTAR LAL\n                       His Highness wants me to welcome\n                       his visitors.  Especially the\n                       renowned Dr. Jones from America.\n\n       Indy bows slightly toward the Maharajah.\n\n                                   INDIANA\n                       We are honored to be here.\n\n       Servants put down another platter.  Willie stares at an enormous\n       steaming boa constrictor on the platter.  With a flash of a\n       knife, a servant slits the huge snake and exposes a mass of\n       squirming, live baby eels inside...\n\n                                   WILLIE\n                       Suddenly I'm not so hungry...\n\n       Meanwhile, Indiana is chatting poleitely with the Prime Minister.\n\n                                   INDIANA\n                       I had a question, Mr. Prime Mini-\n                       ster.  I was examining some of the\n                       Maharajah's artifacts.\n\n                                   CHATTAR LAL\n                       A very fine collection of very old\n                       pieces, don't you think?\n\n                                   INDIANA\n                       Yes, very fine.  But not all of the\n                       pieces look old.  Some were carved\n                       recently and look like images used\n                       by the Thuggees to worship the god-\n                       des Kali.\n\n       At the emntion of the Thuggees, the Indians at the table quiet,\n       as it a taboo has been broken.  Chattar Lal glares at Indiana.\n\n                                   CHATTAR LAL\n                       Dr. Jones, you know very well that\n                       the Thuggee cult has been dead for\n                       nearly a century.\n\n                                   CAPT. BLUMBURTT\n                       Of course.  The Thuggees were an\n                       obscenity that worshipped Kali\n                       with human sacrifices.  The Brit-\n                       ish Army wiped them out about the\n                       time of the Mutiny of 1857.\n\n       Short Round avoids the dinner by feeding it to his little monkey\n       as he listens to the scary conversation.\n\n       The talk is bad enough, but Willie finds the food unbelievable!\n       A servant leans overher shoulder and places a six-inch long BUG\n       on her plate!\n\n       Willie whimpers quietly as she watches the fat merchant next to\n       her lift one of the black, shiny baked-beetles -- and crack it in\n       two!  The man proceeds to enthusiastically suck the gooey innards\n       out.\n\n                                   MERCHANT\n                              (looking at Willie)\n                       But you're not eating!\n\n                                   WILLIE\n                                  (weakly)\n                       I uh -- had bugs for lunch.\n\n       Meanwhile, Indiana continues to politely needle Chattar Lal.\n\n                                   INDIANA\n                       I suppose stories of the Thuggees\n                       die hard.\n\n                                   CHATTAR LAL\n                       There are no stories anymore.\n\n                                   INDIANA\n                       Well, I don't know... we came here\n                       from a small village and the peas-\n                       ants there told us that the Pankot\n                       Palace was growing powerful again\n                       -- becuase of some ancient evil.\n\n       Indiana smiles and shrugs.\n\n                                   CHATTAR LAL\n                                  (sneeringly)\n                       Their stories are just fear and\n                       folklore.\n\n                                   INDIANA\n                                   (cooly) \n                       Maybe.. but how do you explain\n                       The Thuggee shrine I saw right\n                       below the palace?\n\n       Indy catches a glance between the little Maharajah and the prime\n       minister, who answers slowly --\n\n                                   CHATTAR LAL\n                       The local peasants are just as\n                       superstitious.  You're very ob-\n                       servant, Dr. Jones.  But you're\n                       beginning to worry Capt. Blum-\n                       burtt.\n\n       Blumburtt's phlegmatic attitude has changed to curiosity.\n\n                                   CAPT. BLUMBURTT\n                       I'm not worried, Prime Minister,\n                       just interested.\n\n       During their conversation, Willie listens to beetles SNAPPING and\n       she watches revolted as the other dinner guests suck the gooey\n       insides out of the bugs.\n\n                                   WILLIE\n                             (to Short Round)\n                       Give me your hat...\n\n                                   SHORT ROUND\n                       What for?\n\n                                   WILLIE\n                       I'm going to puke in it...\n\n       Meanwhile, Indy continues ingenously with Chattar Lal.\n\n                                   INDIANA\n                       You know the villagers also\n                       claimed that this palace stole\n                       something from them.\n\n                                   CHATTAR LAL\n                       Dr. Jones, it our country a guest\n                       does not usually insult his host.\n\n                                   INDIANA\n                       Sorry, I thought we were just talking\n                       about folklore.\n\n                                   CAPT. BLUMBURTT\n                           (trying to make peace)\n                       I'm sure it's nothing.  Just ru-\n                       mors.\n                                  (but interested)\n                       What was it they claimed was\n                       stolen?\n\n                                   INDIANA\n                       Something magical.  A sacred rock.\n\n                                   CHATTAR LAL\n                                 (condescendingly)\n                       There, you see, Captain.  A rock!\n\n                                   INDIANA\n                       When they lost this rock their\n                       fields and animals dies.  They\n                       also said their children were\n                       taken from them.\n\n                                   CHATTAR LAL\n                       I think that's enough  of this\n                       nonsense, Dr. Jones...\n\n       Indiana smiles faintly at Chattar Lal's anger.  Across the table,\n       Willie looks pale and motions to the waiter.\n\n                                   WILLIE\n                       So you have something, you know,\n                       simple -- like soup or something?\n\n       The servant goes off and returns with a covered bowl.  He uncov-\n       ers it and Willie looks at a soup with a dozen eyeballs floating\n       in it.\n\n                                   MERCHANT\n                       Looks delicious!\n\n                                   WILLIE\n                       I wanna go home...\n\n       Willie whimpers and tears start down her cheeks.\n\n                                   INDIANA\n                               (to Chattar Lal)\n                       I was dubious muself at first.\n                       Then something connected -- the\n                       village's rock and the old legend\n                       of the Sankara Stones...\n\n                                   CHATTAR LAL\n                            (controlling himself)\n                       Dr. Jones, we are all vulnerable\n                       to vicious rumors.  I seem to re-\n                       member that in Honduras you were\n                       accused of being a grave robber\n                       rather than a scientist.\n\n                                   INDIANA\n                                 (shrugging)\n                       The newspapers exaggerated the\n                       incident\n\n                                   CHATTAR LAL\n                       And didn't the Sultan of Madagas-\n                       car threaten to cut your head off\n                       if you ever returned to his coun-\n                       try?\n\n                                   INDIANA\n                       That was a misunderstanding.\n\n                                   CHATTAR LAL\n                                   (smiling)\n                       Exactly what we have here, Dr.\n                       Jones.\n\n                                   MAHARAJAH\n                       I have heard the terrible stories\n                       of the evil Thuggee cult...\n\n       When the little Marahajah speaks it surprises everyone and there\n       is silence.\n\n                                   MAHARAJAH (Cont'd)\n                       I thought the stories were told\n                       to frighten children.  Later, I\n                       learned that the Thuggee cult was\n                       once real and did unspeakable\n                       things.\n\n       The Marahajah looks at Indiana.\n\n                                   MAHARAJAH (Cont'd)\n                       I am ashamed of what happened here\n                       so many years ago.  We keep these\n                       objects -- to remind us that this\n                       will never again happen in my\n                       kingdom!\n\n                                   INDIANA\n                              (after a moment)\n                       I'm sorry if I've offended you.\n\n       Now, more trays are whisked in by servants.\n\n                                   MERCHANT\n                       Ah, dessert!\n\n       Short Round's monkey suddenly screeches and takes off.  Willie\n       closed here eyes in dread - but curiosity gets the best of her\n       and she looks -- it's worse than she could imagine:\n\n       Plates full of small, dead monkey heads!  (*Production note: be-\n       cause of his extremely sensitive nature, the director has reque-\n       ted that these monkey heads be simulated).\n\n       The tops of the monkey's skulls have been cut off and sit loose\n       like little covers.  Willie watches in utter dismay as the Maha-\n       rajah and his guests remove the skull-tops and start dipping\n       spoons into what's inside --\n\n                                   MERCHANT (Cont'd)\n                       Chilled monkey brains!\n\n       Willie keels over, crashing backwards in a dead faint!\n\n                                                               CUT TO:\n\n62.    INT.  A PALACE HALL - LATER                                    62.\n\n       Women servants help a woobly-kneed Willie toward her room.\n\n63.    EXT.  THE PELASURE GARDEN - NIGHT                              63.\n\n       Hundreds of lanters illuminate the garden where after dinner\n       drinks are served, cigars lighted and hookah pipes puffed on.\n\n       Indiana comes out of the pavilion into the garden with Capt.\n       Blumburtt and they talk quietly.\n\n                                   CAPT. BLUMBURTT\n                       Rather bizarre menu, woundn't you\n                       say?\n\n                                   INDIANA\n                       Even if they were trying to scare\n                       us away, a devout Hindu would\n                       never touch meat.\n                                (looking around)\n                       Makes you wonder what these people\n                       are...\n\n       Now, the little Maharajah comes over with his retinue and he\n       reaches for Indy's whip which Short Round is carrying.\n\n                                   MAHARAJAH\n                       I have seen this thing.  What is\n                       it, Dr. Jones?\n\n                                   SHORT ROUND\n                       Hey, nobody touches Indy's whip!\n\n       Short Round grabs for it, but Indiana restrains him.\n\n                                   INDIANA\n                       We're guests here, Shorty.\n\n       The Maharajah glares are Short Round and five the whip to Indy.\n\n                                   MAHARAJAH\n                       You will show me how it works\n                       please.\n\n       Indy bows to the little prince and smiles ironically --\n\n                                   INDIANA\n                       You wish is my command, your\n                       Highness.\n\n       While Short Round watches angrily, Indiana walks across the gar-\n       den and unfurls the whip.  Indy sees a servant lighting a candle.\n\n       Suddenly the whip flies and CRACKS like a pistol shot.  The\n       candle disappears!  Indiana whirls and CRACKS the whip again,\n       snagging a flower out of a dancing girl's hair.\n\n       The Maharajah reacts like any kid -- he shoops happily.\n\n                                   MAHARAJAH\n                       That is wonderful!  Please teach\n                       me how!\n\n       Short Round sulks as he listens to Indiana instructing the Maha-\n       rajah on how to hold the whip.  As the young prince practises the\n       grip, Indy notices Chattar Lal slip behind a fountain to talk to\n       a dark figure in robes who appears.\n\n       Indiana sees Chattar Lal bow to the dark figure -- and Indy\n       catches a glimpse of the stranger's pale face and dark hollow\n       eyes.  Then the robled apparition seems to disappear.\n\n       Meanwhile everyone watches respectfully as the Maharajah unfurls\n       the whip for his first attempt.  He flings the whip but it flies\n       back and snaps  -- biting his own  cheek.\n\n       There's a stunned silence -- then Short Round laughs  at the\n       little prince who is holding his wounded cheek.  The incensed Ma-\n       rahajah suddenly flashes the whip as Short Round.\n\n       Short Round grabs the end of it and pulls hard -- the whip is\n       tugged taut between the two hostile boys.  As they draw near each\n       other, Short Round sees something weird:\n\n       The little Maharajah's eyes begin glowing yelloe and he hisses\n       softly in a strange voice.  Nobody else sees or hears the bizarre\n       transformation...\n\n       Indiana finally intercedes -- he grabs Short Round by the neck.\n\n                                   INDIANA\n                       Okay, Short Round, let go of it.\n\n       Short Round lets go and Indy gently takes the whip back from the\n       little prince.\n\n                                   INDIANA (Cont'd)\n                       The Turks say that a whip can be\n                       an enemy even to its owner.  If\n                       you get some rope, it'll be easier\n                       to learn with, your Highness.\n                       Now, I think we'll say goodnight.\n\n       The Maharajah and Short Round stare hostiley at each other as\n       Indy recoils his whip.\n\n                                                               CUT TO:\n\n64.    INT.  A PALACE HALL - NIGHT                                    64.\n\n       Short Round walks beside Indiana down the shadowy hall toward\n       their room.  Short Round has Indy's whip curled around his shoul-\n       der.  The little fellow yawns and shakes his head.\n\n                                   SHORT ROUND\n                       That little Maharajah think he\n                       big stuff.\n\n                                   INDIANA\n                       You don't like him do you?\n\n                                   SHORT ROUND\n                       Next time I flatten him!  Did you\n                       see his eyes?\n\n                                   INDIANA\n                       No.\n\n                                   SHORT ROUND\n                       Indy, they glow like fire and get\n                       real crazy!  Then he talk in this\n                       real scary voice!\n\n       Indy tousles Short Round's hair.\n\n                                   INDIANA\n                       He was afraid of you.  He knows a\n                       tough  guy when he sees one.\n\n                                   SHORT ROUND\n                                  (not so shure)\n                       Yeah, that's what happened...\n\n       They reach their room and Short Round opens the door.\n\n                                   INDIANA\n                       I better see how Willie is.\n\n       Short Round shakes his head scornfully as Indy crosses the hall\n       and knocks on another door.  After a moment, the door opens and\n       Willie is standing there in a tempting nightgown.\n\n                                   INDIANA\n                       I brought you something.\n\n       He holds up something wrapped in a piece of silk.\n\n                                   WILLIE\n                                (disgusted)\n                       Not leftovers?\n\n                                   INDIANA\n                       No -- real food.\n\n       Willie opens the bundle suspiciously -- then her hace lights up\n       as she examines the breads and fruits inside.\n\n                                   WILLIE\n                       Oh, it is real food...it's\n                       beautiful.\n\n       She bites happily into a piece of fruit -- its juice runs down\n       her chin and Indy wipes it off gently with his hand.  The mouth\n       deliberately seductive and Willie is not displeased.\n\n                                   WILLIE (Cont'd)\n                       You're nice.  Listen, I'm taking\n                       applications -- how'd you like to\n                       be my palace slave?\n\n                                   INDIANA\n                                  (smiling)\n                       Wearing your jewels to be, prin-\n                       cess?\n\n       Indy touches her necklace -- then his hand caresses her neck and\n       ear.  She shivers slightly and speaks softly.\n\n                                   WILLIE\n                       Yeah -- and nothing else.\n                                  (smiling)\n                       That shock you?\n\n                                   INDIANA\n                              (shaking his head)\n                       I'm a scientist.  I like doing\n                       research on certain \"nocturnal\n                       activities\" --\n\n       She smiles and puts a grape to his lips.  He opens his mouth\n       takes it and chews it.\n\n                                   WILLIE\n                       You mean like love rituals...\n\n       He swallows the grape and they move toward each other slowly to\n       kiss, revealing the passion that's simmering.\n\n                                   INDIANA\n                       And mating customs...\n\n       They kiss again more heatedly.\n\n                                   WILLIE\n                       Primitive sexual practices?\n\n                                   INDIANA\n                       You're taling to an authority\n                       in that area.\n\n       They kiss again hungrily --\n\n                                   WILLIE\n                       You're dying to come into my room,\n                       aren't you?\n\n                                   INDIANA\n                       You want me so bad, why don't you\n                       invite me?\n\n                                   WILLIE\n                       Too proud to admit you're crazy\n                       about me, Dr. Jones?\n\n                                   INDIANA\n                       I think you're too used to get-\n                       ting you own way, Willie...\n\n       They kiss yet again -- and Indy breaks it off, just to show he's\n       still in control.  He backs away toward his room.\n\n                                   WILLIE\n                              (watching him)\n                       We'll see who gives in first --\n                       I'll leave my door open.\n\n                                   INDIANA\n                       Don't catch cold.\n\n                                   WILLIE\n                       Dr. Jones -- ?\n\n       Indy stops by his door and sees Willie smiling as she holds up\n       five fingers --\n\n                                   WILLIE (Cont'd)\n                       Five minutes... you'll be back\n                       over here in five minutes...\n\n                                   INDIANA\n                       You're dreaming, Willie.  You want\n                       to make it real, just knock on my\n                       door.\n\n       He winks.  She waves.  But neither one will surrender first.\n       Willie does into her room, leaving the door ajar.  Indy opens his\n       door.\n\n65.    INT.  INDIANA'S SUITE                                          65.\n\n       Indy comes in and closes the door -- leaving it open a crack.  He\n       stands and listens, waiting for her to come over.\n\n66.    INT.  WILLIE'S SUITE                                           66.\n\n       Willie stands likewise by her door, waiting to hear Indy come\n       back over.\n\n67.    INT.  INDIANA'S SUITE                                           67.\n\n       Indiana shrugs and walks over to a couch and starts taking off\n       his tweed jacket and necktie --\n\n                                   INDIANA\n                       Five minutes... fat chance.\n\n68.    INT.  WILLIE SUIT                                              68.\n\n       Willie moves around her lavish suite, turning down lights, creating\n       a romantic effect, checking herself in a mirror --\n\n                                   WILLIE\n                                (confidently)\n                       Five minutes, Dr. Jones...\n\n69.    INT.  INDIANA'S SUITE                                          69.\n\n       Indy undresses in the magnificently decorated room:  wall paint-\n       ings show palace scenes and landscapes; life-size figures\n       dance and there are full-scale portraits or Rajput princes and\n       prancing horses.  But Indy's more concerned with lust than with\n       art.\n\n                                   INDIANA\n                                 (muttering)\n                       ...want me to be her palace slave!\n\n       He picks up his whip and smiles, considering using it on her.\n       Then he just grubles and tosses the bullwhip onto the couch.\n\n70.    INT.  WILLIE'S SUITE                                           70.\n\n       Lying in bed in a seductive pose, Willie waits for Indy to show\n       up and she starts to look worried.  She grabs a clock and shakes\n       it to see if it's working.  She taps her fingers irritably won-\n       dering in her charm has failed...\n\n71.    INT.  INDIANA'S SUITE                                          71.\n\n       We see another clock ticking.  Looking annoyed, Indy tosses a\n       boot at it and the clock falls on its face, setting of the\n       alarm.\n\n       On the chaise lounge in front of Indy's bed, Short Round moves\n       groggily and sees Indy turning off the alarm.\n\n                                   SHORT ROUND\n                                  (half asleep)\n                       Get to sleep Indy -- I stay up\n                       and keep eye on things...\n\n                                   INDIANA\n                       Okay, Shorty ... see you in the\n                       morning...I'm going to have a\n                       little -- word with Willie.\n\n       Indy finally shakes his head and gives in to his animal\n       instincts.  He buttons his shirt, puts his boots back on and\n       grabs his leather jacket.\n\n       As he puts on his jacket he walks past the life-sized paintings of\n       armed gaurds standing in silent vigil.  Suddenly we see something\n       frightening behind him:  one of the wall paintings sees to come\n       to life!\n\n       A large figure in robes and a turban looms out from the wall and\n       lifts a silk cord -- the figure wraps the cord suddenly around\n       Indiana's neck!\n\n       The huge assassin stands behind Indy, twisting the cord even\n       tighter around his neck.  As Indy attempts to break free he\n       sees the assassin's face is a mirror -- and a strange yellow\n       light glowing in the killer's eyes.\n\n72.    INT.  WILLIE'S SUITE                                           72.\n\n       Willie's finally had enough waiting and she gets out of beg petu-\n       lantly.\n\n                                   WILLIE\n                       He's not coming...I can't be-\n                       lieve it...\n\n       She walks across the room and opens the door.  She looks out\n       the empty hall -- and her resolve starts to weaken --\n\n                                   WILLIE (Cont'd)\n                       Well...\n                               (bracing herself)\n                       No!  I'm not going over there...\n\n       She comes back into her room and kicks the door closed.\n\n                                   WILLIE (Cont'd)\n                       Sleep tight, Dr. Jones!\n                               (suddenly melancholy)\n                       I could've been your greatest ad-\n                       venture...\n\n73.    INT.  INDIANA'S SUITE                                          73.\n\n       Indy shoves the assassin backwards, ramming the big man into the\n       wall.  The assassin maintains his deathgrip -- while on the\n       chaise, Short Round sleeps through it all!\n\n       Gasping futilely for air, Indy sinks slowly to his knees  - his\n       eyes bulge and he stares at the tiny, smiling skulls at the ends\n       of the death-cord wrapped around the assassin's fists.\n\n       Indiana sinks lower and then feels something -- desperately he\n       grabs a brass pot on the floor by the handle and swings it with\n       his last strength, smashing it up into the assassin's head with\n       a skull-crushing clang!\n\n       The assassin is stunned and Indiana curls forward pulling him\n       into a somersault and sening him flying over his back.  The ass-\n       assin crashes on his sping next to the chaise.  Short Round still\n       doesn't wake up.\n\n       Indiana rips the cord from around his neck and gasps for breath.\n       He sees the assassin pulling a knife.  Indiana dives as the knife\n       flies through the air and slams into the wall.\n\n       Indiana grabs his whip, rolls and lands on his feet.  As the ass-\n       assin tries to retreat, Indy unleashes his whip -- it CRACKS and\n       wraps around the killer's neck.\n\n       The big man struggles, pulling on the whip, trying to release it\n       from his throat -- and Indiana holds fast, watching the killer\n       gasping for air now as his face turns red.\n\n       Suddenly the assassin does a full-blown backward sommersault\n       which rips the whip out of Indy's hand.  The assassin has an in-\n       stant to grin victoriously --\n\n       Until he sees that the whip handle is arching toward the ceiling\n       where is gets caught on the revolving fan!  The surprised assass-\n       in it tugged upwards -- and the whip twists around the ceiling\n       fan like fishing-line around a fishing-reel--\n\n       And like a doomed flounder, the assassin is slowly reeled up and\n       dragged toward the ceiling, his toes lifting off the floor.\n       The assassin screams as he is hanged!  His legs twitch in\n       his death throes -- and below him, Short Round finally wakes up.\n\n       Always Indiana's protector, Shorty instictively leaps off the\n       couch and draws a small dagger --\n\n                                   SHORT ROUND\n                       Don't worry, Indy!  Where are\n                       they?!\n\n       Short Round spins a 360 , then looks up and does a double-take\n       seeing the dead assassin twisting slowly around the ceiling fan.\n       Indy takes Short Rund by the shoulders and turns him away from\n       the grisly sight.\n\n                                   INDIANA\n                       It's okay, it's over -- go turn\n                       off the fan.\n\n       Short goes over and turns off the fan -- the assassin's body\n       drops and Indy recoils his whip.  Suddenly they hear a hideous\n       scream -- Willie!\n\n74.    INT.  WILLIE'S SUITE                                           74.\n\n       In a tight close-up:  Willie screams again.  She's lying in bed\n       looking down at something --\n\n       Moving up her shapely leg, a green and black, monstrous-looking\n       insect crawls onto her stomach and Willie stops breather.  Immo-\n       bilized by fear, Willie watches in silent agony as the hideous\n       insect climbs slowly up her breast and slithers toward her neck.\n\n       Across the suite, the doors burst open and Indiana rushes in.\n       Shorty is behind him, carrying Indy's whip.  Indiana leaps on a\n       stools and slides up to the bed to save WIllie --\n\n       Then he spots the giant insect crawling on her and decides to\n       have some fun.\n\n                                   INDIANA\n                       This a cheap trick to get me over\n                       here?\n\n       Willie speaks with desperate, fearful precision --\n\n                                   WILLIE\n                       No -- don't you see -- crawling --\n\n                                   INDIANA\n                       What -- the bug?\n\n       Willie is petrified and shaking.\n\n                                   WILLIE\n                       Get -- the -- bug -- off!\n\n                                   INDIANA\n                       Gee, I wouldn't want to touch an\n                       ugly critter like that!\n\n                                   SHORT ROUND\n                                   (grinning)\n                       Uh uh -- me neither!\n\n       Willie looks at the man-of-action like he's insane.  Then she\n       feels the bug crawling onto her cheek --\n\n                                   WILLIE\n                       Oh no -- oh no!!\n\n                                   INDIANA\n                               (studying the bug)\n                       You know, Willie, I'll bet he's\n                       mad because they were eating his\n                       friends for dinner.\n\n                                   WILLIE\n                       Please -- oh please, I'm going to\n                       die!  Get it off!\n\n       Indiana shrugs and leans over and casually swats the horrible bug\n       off her face.  He and Short Round watch the insect skid across\n       the floor -- and suddenly disappear as if by magic!\n\n       Puzzled, they wander toward the wall, leaving Willie behind,\n       bathed in sweat, staring at the ceiling --\n\n                                   WILLIE\n                       What did I do to deserve this\n                       trip?!\n\n       Kneeling by the wall, Short Round examines the baseboard --\n\n                                   SHORT ROUND\n                       It went under.  Hey, I feel\n                       wind, Indy.\n\n       Indiana knocks on the wall and considers the hollow sound.  He\n       moves back and looks at the whole wall.  Behind him, Willie moves\n       past --\n\n                                   WILLIE\n                       I'm packing!  I'm getting out of\n                       here right now tonight!\n\n       She dashes behind a screen to start getting dressed.  Meanwhile\n       Indy feels the marble walls.  He moves to a niche in which there\n       is a small statue of Ganesha, the friendly elephant god.\n\n       Indiana lifts the statue -- and a panel in the wall opens slow-\n       ly.  Short Round looks amazed.  Indy watches the light fall\n       across the far wall of a tunnel as the door opens slowly.\n\n       Indy peers into the tunnel at an old wall painting.  Spiderly San-\n       skrit calligraphy runs under a flanking illustration of a prince\n       bowing before a god.\n\n                                   INDIANA\n                       *(He reads aloud an inscription\n                       in Sanskrit).\n\n                                   SHORT ROUND\n                       What does it mean, Indy?\n\n                                   INDIANA\n                                 (translating)\n                       \"Follow in the footsteps of\n                       Shiva.  Do not betray his truth.\"\n\n       Indy takes out the piece of cloth the boy gave him in Mayapore,\n       the similarities are striking.  It is also a picture of Shiva\n       Sankara.\n\n                                   INDIANA\n                       *(He repeats aloud the inscrip-\n                       tion also written on the cloth)\n\n       Over behind the screen, Willie's getting into some silk pants with\n       an Indian-style brocade bodice top --\n\n                                   WILLIE\n                       I don't care if I have to walk to\n                       Delhi, I'm -- hey!\n\n       She notices Indy and Short Round bending to enter the dark tunnel\n       behind the wall.\n\n                                   WILLIE (Cont'd)\n                       Wait a minute!  What're you --\n                       where're you going?!\n\n       Indy pokes his head back into the room --\n\n                                   INDIANA\n                       Lock your door and don't leave\n                       until we get back.\n\n       He disappears behind the wall and Willie looks worried.\n\n75.    INT.  A PALACE TUNNEL - NIGHT                                  75.\n\n       Indy and Short Round enter the secret passage and move forward\n       slowly into the inky darkness.\n\n                                   SHORT ROUND\n                       I don't think we suppose to be in\n                       here, Indy...\n\n       They creep slowly down the dark tunnel.  It grows smaller and Indy\n       ducks his head.\n\n                                   SHORT ROUND (Cont'd)\n                       I step on something.\n\n       Their footsteps crunch on the tunnel floor.\n\n                                   INDIANA\n                       You're right, there's something\n                       all over the floor...\n\n       Even Short Round has to duck and Indy finally kneels to his\n       hands and knees.\n\n                                   INDIANA (Cont'd)\n                       We'll have to crawl.\n\n       As they crawl, their hands and knees continue to crunch on what-\n       ever it is littering the ground.\n\n                                   SHORT ROUND\n                       Indy, the floor -- there is some-\n                       thing alive!\n\n       Indiana gets a match out of his pocket.  He snaps it with his\n       thumb and the match flares -- a hideous insectarium: a living\n       collection of the world's ugliest antropods, hexapods and arch-\n       nids.\n\n                                   SHORT ROUND\n                       Holy smoke -- I'm scared, Indy!\n\n       Indiana turns and sees something else --\n\n                                   INDIANA\n                       There's a chamber here.  Come on --\n\n       Indy finds an oil lamp on the wall and lights it.  Short Round\n       happily scampers into the chamber and Indy follows him.  Suddenly\n       the door slides shut -- trapping them inside!\n\n76.    INT.  THE CHAMBER                                              76.\n\n       Indiana lights a match and finds another oil lamp.  He and Short\n       Round look for a way to open the door that closed behind them,\n       but they have no luck.\n\n                                   INDIANA\n                       Damn!\n\n       Then they hear Willie's voice echoing down the short tunnel.\n\n                                   WILLIE (O.S.)\n                       Hey -- where are you?!\n\n77.    INT.  WILLIE'S SUITE                                           77.\n\n       Back in the suite, Willie stands by the entrance to the secret\n       passage, peering into the dark tunnel --\n\n                                   WILLIE (Cont'd)\n                       Indiana Jones?!  Are you in there?!\n\n78.    INT.  THE CHAMBER                                              78.\n\n       Indy mutters irritably to himself --\n\n                                   INDIANA\n                       Yes, we're in here...\n\n       He looks everywhere for something to open the door.  Short\n       Round spots a loose brick and moves it --\n\n                                   SHORT ROUND\n                       Indy, I found a --\n\n       Suddenly they hear a rumble and Indy turns to see the opposite\n       wall moving -- the spikes start appearing!  Their lethal points\n       protrude from the wall as it starts closing in toward Indy and\n       Short Round.\n\n                                   SHORT ROUND (Cont'd)\n                       Indy -- !\n\n       Shorty points up and Indiana sees more spikes descending from the\n       ceiling!  Indy turns toward the door and shouts --\n\n                                   INDIANA\n                       Uh -- Willie?!\n                                   (louder)\n                       Willie, you better get down here!\n\n79.    INT.  WILLIE'S SUITE                                           79.\n\n       Willie listens and looks scared --\n\n                                   WILLIE\n                                (shouting back)\n                       What?!\n\n                                   INDIANA (O.S.)\n                       Willie, come here!  Hurry up,\n                       we're in trouble!!\n\n                                   SHORT ROUND (O.S.)\n                       Willie, help!!\n\n       Willie is frightened, confused and jumping around --\n\n80.    INT.  THE SPIKE CHAMBER                                        80.\n\n       The deadly spikes inch slowly toward them from the wall and ceil-\n       ing.  They start pounding on the door and shout --\n\n                                   INDIANA\n                       Willie, damn it!  Get down here,\n                       NOW\n\n81.    INT.  WILLIE'S SUITE                                           81.\n\n       Willie finds the courage to finally whimper and step into the\n       dark passage --\n\n                                   WILLIE\n                       Oh hell -- I bet I get all dirty\n                       again!\n\n82.    INT.  THE TUNNEL                                               82.\n\n       Willie starts down the dark tunnel toward the chamber.\n\n                                   INDIANA (O.S.)\n                       WILLIE?!\n\n                                   WILLIE\n                       I'm coming, what's the rush?!\n                       Ohh!  What's that?!  There's\n                       stuff all over the floor!  I\n                       can't see a thing!\n\n83.    INT.  THE SPIKE CHAMBER                                        83.\n\n       They hear her coming and Indy watches nervously as the spikes\n       draw even closer --\n\n                                   INDIANA\n                       Move, Willie!  Faster!\n\n84.    INT.  THE TUNNEL                                               84.\n\n       Willie crawls and crunches on the littered floor --\n\n                                   WILLIE\n                       It's all wet and icky!  Aaahh --\n                       things are moving!!\n\n       She sees the low lamp by the door to the chamber.\n\n                                   SHORT ROUND (O.S.)\n                       Please, Willie!\n\n       She grabs the lamp and turns it up so it burns brighter.  She\n       looks around -- and SCREAMS!!  She sees the sickening, swarming\n       mass of glistening insects crawling toward her, attracted by the\n       light --\n\n                                   WILLIE\n                               (hysterical)\n                       There's bugs!  Bugs all over!\n                       Help!  Help me!\n\n                                   INDIANA (O.S.)\n                       Willie, open the door!  GET US\n                       OUT OF HERE!\n\n       Willie pounds on the door --\n\n                                   WILLIE\n                       OPEN THE DOOR!  LET ME IN!!\n\n85.    INT.  THE SPIKE ROOM                                           85.\n\n       The spikes close in --\n\n                                   INDIANA\n                       GET US OUT!  Willie, shut up and\n                       listen!  There's got to be a ful-\n                       crum release!  Look around!\n\n                                   WILLIE (O.S.)\n                       A what?!\n\n86.    INT.  THE TUNNEL                                               86.\n\n       Willie whines and frantically searches the wall.  Insects are\n       crawling and jumping on her and she kicks at them!\n\n                                   INDIANA (O.S.)\n                       A fulcrum release lever!\n\n                                   WILLIE\n                       I can't find any lever!  Help me\n                       Indy!\n\n87.    INT.  THE SPIKE CHAMBER                                        87.\n\n       Indiana and Short Round are backed against the wall and the\n       spikes are a foot away and moving in --\n\n                                   INDIANA\n                       Look around, Willie!  There's got to\n                       be a liever hidden somewhere!  Come\n                       on, you can do it!\n\n88.    INT.  THE TUNNEL                                               88.\n\n       Insects drop onto Willie from the ceiling and fly at her as she\n       flattens against the wall.  Then her elbow hits something -- a\n       loose stone.  She claws at it and it falls out of the wall\n       leaving a hole.\n\n                                   WILLIE\n                       There's a hole!  I found a square\n                       hole!\n\n                                   INDIANA (O.S.)\n                       That's it -- the release lever --\n                       look inside!\n\n                                   WILLIE\n                       I am -- it looks horrible!\n\n       The hole is revolting :  covered with squirming insects, it also\n       oozes some kind of glistening mucus.\n\n                                   INDIANA (O.S.)\n                       Reach inside!\n\n       Willie moves her hand toward the nauseating hole then pulls back.\n\n                                   WILLIE\n                       I can't, Indy!  I can't!\n\n89.    INT.  THE SPIKE TUNNEL                                         89.\n\n       Indiana turns his head sideways and sucks in his breath, but the\n       deadly spikes are poking into his leater jacket now --\n\n                                   INDIANA\n                       The lever!  Willie, do it!  NOW!\n\n90.    INT.  THE TUNNEL                                               90.\n\n       Willie screams and jams her hand into the gross hole --\n\n                                   WILLIE\n                       Oh God, it's soft -- it's moving!\n\n                                   INDIANA (O.S.)\n                       Willie!\n\n91.    INT.  THE SPIKE CHAMBER                                        91.\n\n       Short Round is frightened to death and crying --\n\n                                   SHORT ROUND\n                       Willie, help us!  Hurry!\n\n92.    INT.  THE TUNNEL                                               92.\n\n       She hears Short Round crying and twists her hand in the disgust-\n       ing hole.  Suddenly the door springs open!  Willie pulls her hand\n       out and stares in horror -- her hand and arm are covered with\n       greenish slimey mung!\n\n93.    INT.  THE SPIKE CHAMBER                                        93.\n\n       The spikes suddenly retract, disappearing into the wall and clos-\n       ing.  Indy pulls Willie inside the chamber and the door slams\n       shut again.  Willie dances around, yelling about the hideous slime\n       on her arm.\n\n                                   WILLIE\n                       Get is off me -- get it off!\n\n       Indy helps her wipe it off.  Willie falls back against the door.\n\n                                   WILLIE (Cont'd)\n                       You left me out there!  What in\n                       the hell were you doing in here?!\n                       I want to leave this place right\n                       now!!\n\n       She sees the same lever that Short Round pulled earlier and grabs\n       for it.  Indiana dives and manages to stop her from activating\n       the spikes agian.\n\n                                   INDIANA\n                       Not that one!  We had enought of\n                       that one, thank you...\n\n       He looks around and spots a small rock protruding from the wall.\n       Cautiously, praying htat it won't activate another booby trap,\n       Indy pushes the rock.\n\n       A large door opens on the other side of the chamber -- a soft\n       wind howls past outside the chamber.\n\n94.    INT.  THE WIND TUNNEL                                          94.\n\n       Indiana, Short Round and Willie exit the spike chamber and head\n       down a larger tunnel through which a roaring wind intermittantly\n       blows, howling eerily like a note of gloomy music.\n\n       Indiana follows a curve in the tunnel and they see light approaching.\n       The wind holws another dramatic note which gales past them as\n       they reach the mouth of the tunnel.\n\n       Indiana is joined by Willie and Short Round.  They all stop in\n       astonishment at the sight below them:\n\n95.    INT.  THE TEMPLE OF DEATH                                      95.\n\n       As the camera pulls back,  the mouth of the wind tunnel in which\n       they are standing becomes just a small hole overlooking the stag-\n       gering vastness of the incredible TEMPLE OF DEATH.\n\n       The colossal subterranean temple has been carved out of a solid\n       mass of rock.  A vaulting cathedral-like ceiling is supported by\n       rows of carved stone columns.\n\n       Balconies overlook the temple floor.  Pillared halls leading to\n       dark side chambers.  Moving out of these chambers, hundreds of\n       faithful worshippers chant as they enter the temple.\n\n       Mammoth stone statues of elephants, lions and demi-gods (half/man,\n       half/animal monstrosities) loom above the swelling crowds or wor-\n       shippers.\n\n       As the wind howls out of the tunnel high above the temple, the\n       worshippers chant in response to the strange tunnel music.\n\n96.    INT.  THE TUNNEL                                               96.\n\n       The moaning wind rushes past Indiana, Willie and Short Round as\n       they watch the mystery cult below bowing toward an enormous altar\n       at the far end of the temple.\n\n       This altar is a platform jutting out from the stone wall of the\n       cavern.  Separating the worshippers from this altar is a wide\n       crevasse out of which wisps of smoke rise occasionally.\n\n97.    INT.  THE ALTAR                                                97.\n\n       On the other side of the crevasse, evil-looking priests\n       materialize out of clouds of swirling smoke.  The priests carry\n       smoke-billowing urns to a giant stone statue.\n\n       Now, we see the hideous protectress of the temple, the obscenely\n       malevolent ombect of the cult's devotion:  the bloodthirsty god-\n       dess KALI!\n\n       The red-eyed priests bow at the base of the statue and gaze\n       reverently at their KALI MA.  Skulls surround her stone feet\n       carved serpents twist up her legs, while around her waist there\n       is a guresome belt of human hands.\n\n       Naked to the hips, Kali's hair falls about her four arms.  In her\n       hand, she holds a sword, in the second the severed head of a\n       giant.With her other hands she encourages her worshipers, who\n       are chanting louder and louder!\n\n       Kali's face is loathsome:  her earrings are two corpses.  Her\n       evil tongue extends out of her twisted mouth and what looks like\n       read blood flows over her long fangs and down her naked breasts.\n\n98.    INT.  THE WIND TUNNEL                                          98.\n\n       Watching from the high opening, Willie looks disgusted.\n\n                                   WILLIE\n                       What is it...?\n\n                                   INDIANA\n                       It's a Thuggee ceremony.  They're\n                       whorshipping Kali, the goddess of\n                       Death and Destruction.\n\n99.    INT.  THE TEMPLE OF DEATH                                      99.\n\n       A huge drum sounds three times and the chanting stops.  The\n       silence is chilling as another robed figure appears out of the\n       some on the altar.\n\n       This is MOLA RAM, the High Priest of the Thugge cult.  Mola\n       Ram's red-rimmed eyes glare from the sunken sockets in his\n       sinister face.  Here is a man who looks as vile and diabolic\n       as the unholy goddess rising behind him.\n\n       Up in the wind tunnel, Indy stares down at the High Priest and\n       realizes that is was Mola Ram he saw conferring with Chattar Lal\n       in the palace garden.\n\n       As the drum booms three times more, Mola Ram lifts one arm\n       up from his emaciated body and suddenly there is a scream!\n\n       All heads turn toward an unfortunate, struggling Indian begin\n       dragged out by priests.  The man's face and body are wildly\n       painted.  He screams again as he's tied onto a square iron frame\n       laying atop a large flat stone.\n\n       Mola Ram steps forward to the stretched-out victim and the Indian\n       looks up into the High Priest's grotesque face --\n\n       Suddenly Mola Ram's hand shoots out toward the man's chest -- and\n       pierces it!  The High Priests hand sinks into the victim's\n       writing body and rips out his living heart!\n\n100.   INT. THE WIND TUNNEL                                           100.\n\n       Willie covers her mouth --\n\n                                   WILLIE\n                       Oh my God!  He ripped out his --\n                       he killed him!\n\n                                   INDIANA\n                       No...the heart's still beating!\n\n101.   INT.  THE ALTAR                                                101.\n\n       Indeed, the bloody heart is still beating in Mola Ram's hand!\n       He lifts the heart into the air and the worhippers begin the chant.\n\n                                   THE MULTITUDE\n                       Jai ma Kali, jai ma Kali!\n\n       Stranger still, the sacrificial victim is still alive -- there is\n       no evidence of a gash on his chest, only a reddish mark  The\n       priests add chains to the iron frame and carry the victim over\n       toward a hoist hanging over the crevasse.\n\n       The man thrashes about helplessly on the iron frame as it is up\n       ended and then lowered with the victim hanging face down --\n\n       As the sacrificial victim looks down into the crevasse below --\n       he screams -- and we see the molten lava bubbling crimson at the\n       bottom of the chasm!\n\n102.   INT.  THE WIND TUNNEL                                          102.\n\n       Willie closes her eyes but Indy and Short Round watch horrified\n       as the iron frame is lowered -- and the bloody heart continues to\n       beat in Mola Ram's hand -- and the molten lava burns and flickers\n       as the screaming victim is lowered deeper into the crevasse.\n\n103.   INT.  THE TEMPLE                                               103.\n\n       The weird paint on the victim's face starts to smoke and sizzle --\n       the man's skin blisters as he's lowered within feet of the\n       lava.  His flesh smokes and he screams one last time as his body\n       bursts into flame.\n\n       The iron frame sinks and submerges into the boiling fiery lava.\n\n104.   INT.  THE ALTAR                                                104.\n\n       Above the crevasse, Mola Ram continues to hold the heart in\n       his hand -- the heart is smoking and bursts into flames - and\n       disappears!\n\n105.   INT.  THE TEMPLE                                               105.\n\n       The iron frame is raised out of the lava -- the metal glows\n       like a branding iron, but there is no trace of the sacrificed\n       victim.\n\n106.   INT.  THE WIND TUNNEL                                          106.\n\n       As the wind howls again, Willie and Short Round look sickened and\n       appalled by the ceremony.  Even Indy seems shaken by what they\n       are witnessing.\n\n                                   THE MULTITUDE\n                       Jai ma Kali,  jai ma Kali!\n\n107.   INT.  THE ALTAR                                                107.\n\n       Moal Ram raises both hands and his voice echoes strange incanta-\n       tions.  Behind him, three priests carry cloth-wrapped objects to-\n       ward the altar.\n\n108.   INT.  THE WIND TUNNEL                                          108.\n\n       Willie is crying and her voice is shoking as she turns awa from\n       the hideous ritual --\n\n                                   WILLIE\n                       Let's go!  Let's get out of here!\n\n                                   INDIANA\n                       Quiet!\n\n109.   INT.  THE ALTAR                                                109.\n\n       The priests reverently unwrap three conical pieces of\n       crystallized quartz.  The place the three stones below the sta-\n       tue of Kali and slowly the smoke around the altar swirls --\n\n       The smoke is drawn to the three stones and they actually start in-\n       haling the piraling smoke.  The smoke disappears into the stones\n       and the air clears.  Then the three stones start to glow a\n       haunting incandescent white.\n\n110.   INT.  THE WIND TUNNEL                                          110.\n\n       Short Round looks scared.  Willie is still crying -- Indy waits,\n       horrified but fascinated.\n\n                                   INDIANA\n                       The village knew their rock was\n                       magic -- but they didn't know it\n                       was one of the lost Sankara Stones...\n\n                                   SHORT ROUND\n                       Why they glow like that?\n\n                                   INDIANA\n                       Legend says that when the stones\n                       are brought together the diamonds\n                       inside of them will glow.\n\n       Willie wipes her eyes and becomes more interested --\n\n                                   WILLIE\n                       Diamonds...?\n\n111.   INT.  THE ALTAR                                                111.\n\n       The Sankara Stones shimmer brightly, and inside the crystallized\n       quartz, the enormous sparkling diamonds of legend are now re-\n       vealed.\n\n       Mola Ram stands facing Kali with his arms outstretched and\n       kneels and bows and then walks off the altar and disappears.\n\n112.   INT.  THE WIND TUNNEL                                          112.\n\n       Indiana sees the woshippers below start to leave the temple.  He\n       looks at Willie and Short Round.\n\n                                   INDIANA\n                       Okay -- now listen -- you wait here\n                       and keep quiet.  Shorty, keep an\n                       eye on her.\n\n       Short Round nods and hands Indy his bullwhip and shoulder bag.\n       Willie sees Indiana peering down at the sheer drop below the\n       mouth of the wind tunnel.\n\n                                   WILLIE\n                       Wait -- what're you doing?\n\n                                   INDIANA\n                       I'm going down.\n\n                                   WILLIE\n                       Down?  Down there?!  Are you\n                       crazy --!\n\n                                   INDIANA\n                       I'm not leaving without those\n                       stones.\n\n                                   WILLIE\n                       You're gonna get killed chasing\n                       after your damn fortune and\n                       glory!\n\n                                   INDIANA\n                                (looking at her)\n                       Maybe...someday.\n                                 (smiling)\n                       Not today.\n\n                                   SHORT ROUND\n                       I keep my eye peeled, Indy.\n\n       Indiana nods and looks down at the now empty temple.  Then he\n       slips down from the mouth of the wind tunnel.\n\n113.   INT.  THE TEMPLE WALL                                          113.\n\n       Indiana skillfully clumbs down an enormous tmeple column -- find-\n       ing footholds on stone cobras, carved lions and the stone breasts\n       of dancing girls.  Slowly, he makes his way down and swings across\n       a balcony.\n\n114.   INT.  THE BALCONY                                              114.\n\n       Indiana walks quietly along the balcony overlooking the temple.\n       He stops -- between him and the altar is the crevasse with the\n       lava bubbling fire at the bottom.\n\n       Indiana looks across the gulf and sees another column near the\n       altar at the top of which stone elephants are perched.  Indy\n       curls his whip and suddenly lets it fly --\n\n       The whip cracks and its end wraps tightly around the tusk of one\n       of the stone elephants.  From the balcony, Indy tugs the whip\n       taut, takes a breath and runs --\n\n115.   INT.  THE CREVASSE                                             115.\n\n       Indiana leaps and swings out on the whip, arching down and up,\n       over the chasm of fiery lava in a spectacular curving jump!\n\n116.   INT.  THE LATAR                                                116.\n\n       Indy lands on his feet and turns to release the whip.  Short\n       Round waves to Indy that the coast is clear.  Indy snaps the whip\n       -- it releases from the elephant tusk and drops.\n\n       Recurling the whip, Indy attaches it to his belt and moves to-\n       ward the towering statue of Kali.  The three Sankara stones start\n       to glow and Indiana approaches them cautiously.\n\n       Reaching the stones, Indy's face is lighted by them.  He notices\n       that one of them (sthe stone from Mayapore village) has strange\n       lines painted across it.\n\n       Suspiciously, Indy touches the stone, but it doesn't burn.  He\n       lifts it carefully and peers into it.  The enormous diamond\n       sparkles inside.  He places the stone in his shoulder bag and\n       reaches for the others.\n\n117.   INT.  THE WIND TUNNEL                                          117.\n\n       Short Round and Willie watch apprehensively as Indiana bags the\n       three stones.\n\n118.   INT.  THE ALTAR                                                118.\n\n       Indiana backs away and looks up at the horrific statue of Kali.\n       It seems to be watching him.  He turns and is about to go when he\n       hears something --\n\n       It sounds like a voice and Indy is afraid to turn -- could it be\n       Kali?  The he hears other noises echoing and turns slowly.  Real-\n       alizing the sounds are coming from behind the altar, Indy moves\n       around it toward the back.\n\n119.   INT.  THE WIND TUNNEL                                          119.\n\n       Short Round and Willie are mystified as they see Indiana dissap-\n       pear behind the altar.\n\n                                   WILLIE\n                       Oh hell, where's he going?\n\n       Short Round looks worried.  Then the wind rushes past them quickly\n       and howls its somber musical note.  However, the wind sounds dif-\n       ferent this time, its tone quavering slightly.\n\n       Short Round is puzzled and looks around.  He  feeezes when he sees\n       two shadowy figures coming down the tunnel toward them -- the\n       bodies causing the tone of the wind to shift eerily --\n\n       Willie notices Short Round pulling a dagger from his belt -\n\n                                   WILLIE\n                       What're you -- ?\n\n       Suddenly she turns and screams as two huge Thuggee guards rush\n       at them!  One grabs at Short Round but the kid slashes the\n       guard's hand with his dagger.\n\n       Willie tries to get past the other guard, but he snatches her by\n       the arm and pulls her toward him -- from her training at the Col-\n       lege of Hard Knocks, Willie successfully knees the big man in the\n       balls.\n\n                                   WILLIE (Cont'd)\n                       Keep your paws off, letch!\n\n       The man groans and sinks to his knees.  Willie sees that Short\n       Round is in trouble.  She runs over, leaps onto the back of the\n       other guard and starts ripping his hair out.\n\n       Short Round picks up his fallen dagger.  The big guard lurches\n       backwards and smashes Willie into the rocky wall of the tunnel.\n       Willie falls to the floor.\n\n       Short Round approaches, holding the man at bay with his dagger.\n       Willie turns as the other guard, the one she kneed, crawls toward\n       her -- Willie scoops up some dirt and throws it.  The man claws\n       at his eyes and Willie jumps up.\n\n                                   SHORT ROUND\n                       Run Willie!\n\n       Willie starts to run and Short Round backs away, keeping the\n       guard at a distance with his dagger.  Suddenly the guard cries out\n       in Hindi and dives at Short Round.\n\n       Panicking, Shorty tries to run after Willie -- but he's tripped.\n       The guard has Short Round by the foot and drags him back.  Willie\n       looks around and stops running.  She sees Short Round is caught.\n\n                                   SHORT ROUND (Cont'd)\n                       No!  Run!  Go get help!\n\n       Willie hesitates, then runs down the tunnel.  Meanwhile, a mam-\n       moth hand clutches Short Round's throat -- the giant guard lifts\n       Shorty completely off the ground and the kid looks terrified and\n       helpless as he dangles in the air...\n\n120.   INT.  CHAMBER BEHIND ALTAR                                     120.\n\n       Indiana enters the dark chamber behind the altar.  The only il-\n       lumination is the back-light streaming around the silhouetted\n       statue of Kali.\n\n       Indy slowly crosses a narrow stone bridge and moves toward a cy-\n       lindrical shaft of light rising up from what appears to be an\n       enormous hole.\n\n       Indy hears voices and the clink of metal against rock as he con-\n       tinues forward.  The ground is dark in front of the large hole.\n       He edges toward the precipice and the light rising up illuminates\n       the look of shock on his face as he peers down into Hell...\n\n121.   INT.  THE THUGGEE MINES                                        121.\n\n       Indy looks into a deep pit around which concentric paths leads off\n       into numerous narrow tunnels.  Crawling out of these burrows,\n       scrawny children drag sacks of dirt and rock.  Other hollow-eyed\n       children pull these sacks to mine cars waiting on rails.\n\n       Straining to lift the rocks into the mine cars, several of the\n       children slip and fall.  Bare-chested Thuggee guards shout at the\n       enslaves children and kick those who've fallen.\n\n       For these children there would seem to be only one hope -- death\n       -- an end to their travail.\n\n       Indiana edges around the hole, looking into the ghastly mine and\n       feeling as if he's discovered an inferno of misery as grotesque\n       as Dante's.\n\n       Indy shifts the bag of stones on his shoulder.  He hesitates and\n       considers his choice:  he has the Sankara Stones and can leave\n       with them now...\n\n       But Indy hears the pleading cries of one child and peers down to\n       see a burly Thuggee guard beating the pitiful little slave.  Indy\n       gets angrier and angrier as he watches.\n\n       He finally steps over the grabs a boulder.  He lifts it and\n       flings it down into the mine --\n\n122.   INT.  THE MINE                                                 122.\n\n       We see Indiana above and the boulder hurtling down -- it crashes\n       onto the head of the Thuggee guard who hits the ground like a\n       sack of cement!\n\n12.    INT.  THE CHAMBER                                              123.\n\n       Indy sees the startled slave children looking up at him in shock.\n       He smiles victoriously at the Thuggees below who've run over to\n       see what happened.\n\n       Indy's smile seems to fade as his anger turns to surprise as he\n       feels something unnerving:\n\n       Dirt is crumbling away from the rim of the hole, a small\n       landslide starting beneath his feet.  Suddenly the floor gives\n       way and Indy slips!\n\n       The entire rim of the hole shears off and Indy topples with it\n       and plunges down into the mine toward the assembled guards who\n       scatter -- Indy yells as he falls and it echoes...\n\n                                                               CUT TO:\n\n124.   INT.  A CELL - NIGHT                                           124.\n\n       Indiana's yell continues to echo -- his head jerks suddenly --\n       Indy jolts awake as if coming out of a nightmare, awakened by his\n       own reverberating shout.\n\n       Indy is lying on the rocky floor of a dark cave/cell.  He lifts\n       his hands and discovers that they are chained.  In the murky\n       light, he sees Short Round sitting in chains across the cell.\n\n                                   SHORT ROUND\n                       Indy -- you knocked out when you\n                       fall.  You okay?\n\n       Indiana nods groggily.  He sees a young slave worker in rags sit-\n       ting near Short Round.  Through the iron bars of the cell, Indy\n       sees the children slaving in the mine tunnels.\n\n                                   SHORT ROUND\n                              (indicating the kid)\n                       This is Nainsukh -- from the vil-\n                       lage.  They bring him here to dig\n                       in the mines.\n\n                                   INDIANA\n                       Why?\n\n                                   NAINSUKH\n                       Children are small -- we can work\n                       in tunnels.  Now I am too old.\n\n                                   SHORT ROUND\n                       What they do to you now?\n\n                                   NAINSUKH\n                       I pray to Shiva -- let me die.\n                       But I do not.  Now -- now the\n                       evil of Kali take me.\n\n                                   SHORT ROUND\n                       How?\n\n                                   NAINSUKH\n                       They will make me drink blood of\n                       Kali.  Then I fall into black\n                       sleep of Kali Ma...\n\n                                   INDIANA\n                       What is that?\n\n                                   NAINSUKH\n                       I become like them.  I be  alive --\n                       nut like in nightmare.  You drink\n                       the blood, you not wake up from\n                       nightmare of Kali Ma.\n\n       There's a noise and they see two guards and a priest outside the\n       cell.  Nainsukh cowers in the darkness at the back of the cell,\n       like a trapped animal awaiting the inevitable.\n\n                                                               CUT TO:\n\n125.   INT.  A MINE TUNNEL - NIGHT                                    125.\n\n       Indiana and Short Round are pushed down a tunnel by guards.  They\n       are stopped at a door and shoved inside.\n\n126.   INT.  MOLA RAM'S CHAMBER                                       126.\n\n       Indiana and Short Round stumble into the chamber.  It is a terri-\n       fying gallery of occult yantras, ritualistic statues and grisly\n       icons of the evil Thuggee sect.\n\n       Grotesque statues of Kali's baleful minions line the walls.  In a\n       corner, there is another statue of Kali herself, draped with\n       flowers, necklaces of real human skills and slithering belts of\n       live snakes.\n\n       Fresh blood has been splashed over the statue and at its base are\n       the three Sankara Stones recovered from Indiana.  Mola Ram sits\n       in a yoga position near the statue of Kali.\n\n       Mola Ram opens his eyes and he sees Indiana and Short Round\n       standing in chains before him.\n\n                                   MOLA RAM\n                       You were caught trying to steal\n                       the Sankara Stones.\n\n                                   INDIANA\n                                 (shrugging)\n                       Nobody's perfect.  The way I\n                       heard it, you stole one of them\n                       from a small village.\n\n       Mola Ram stands and gazes transfixed at the stones glowing on the\n       altar.\n\n                                   MOLA RAM\n                       There were five stones in the\n                       beginning.  Over the centuries\n                       they were dispersed by wars,\n                       sold off by thieves like you...\n\n                                   INDIANA\n                       Two are still missing.\n\n                                   MOLA RAM\n                       No.  They are here -- somewhere.\n                       A century ago when the British\n                       raided this temple and butchered\n                       my people, a loyal priest his the\n                       last two stones down here in the\n                       catacombs.\n\n                                   INDIANA\n                       That's what you've got these chil-\n                       dren -- these slaves digging for?\n\n                                   MOLA RAM\n                       They dig for the gems to support\n                       our cause.  They also search for\n                       the last two stones.  Soon we will\n                       have all five Sankara Stones and\n                       the Thuggees will be all powerful!\n\n                                   INDIANA\n                       Nobody can say you don't have a\n                       vivid imagination.\n\n                                   MOLA RAM\n                       You do not believe me?  You will,\n                       Dr. Jones.  You will become a true\n                       believer.\n\n       The door opens and Mola Ram bows slightly as the little Maharajah\n       enters.  Indy looks surprised and Short Round tenses.\n\n                                   MOLA RAM (Cont'd)\n                       Your Highness will witness the\n                       thief's conversion.\n\n       Mola Ram nods and two guards grab Indy.  They drag him struggling\n       to a rock and chain him to it.  Short Round scuffles as he's\n       pulled aside to watch.\n\n       Remembering the High Priest's earlier open-heart surgery, Indi-\n       ana looks worried as Mola Ram approaches him --\n\n                                   MAHARAJAH\n                       You will not suffer.  I recently\n                       became of age and tasted the blood\n                       of Kali.\n\n       Now the young initiate comes forward and Indiana looks startled --\n       it's Nainsukh.  He is wearing robes and his eyes are glowing\n       strangely.  Nainsukh hands Mola Ram a hollow human skull full of\n       blood!\n\n       The guards hold Indiana's head back and force his mouth open.\n       Mola Ram tips the skull and blood spills out of its death-\n       grinning jaws and flows into Indiana's mouth.  Indy gags --\n\n       Suddenly he spits the blood, spraying Mola Ram and the little\n       Maharajah.  Looking at his blood-splattered clothes, the Mahara-\n       jah is furious.\n\n                                   MOLA RAM\n                       Hold him!\n\n       The little prince's eyes glow angrily and he hisses at Indy --\n\n                                   MAHARAJAH\n                       You will learn to obey because\n                       you are powerless!\n\n       The little Maharajah pulls a small krtya from his robes -- Indy\n       sees that the doll has been crudely fashioned to resemble him.\n\n                                   MAHARAJAH (Cont'd)\n                       I control you now!\n\n       The Maharajah turns and sticks the doll into a flaming urn.  In-\n       diana suddenly cries out and twists in pain as he is burned!  The\n       little prince smiles evilly and puts the doll back into his\n       robes.\n\n       Then he goes over to where Indy's whip and bag have been laid.\n       He grabs the bullwhip.\n\n                                   MAHARAJAH (Cont'd)\n                       You told me that a whip could be\n                       an enemy to its owner.  We shall\n                       see!  Turn him over!\n\n       As the guards turn Indy face down, they rip off his jacket and\n       chain his ahnds to the rock.  The Maharajah uncurls the whip -- he\n       notices Short Round smiling snidely --\n\n       Suddenly the Maharajah cracks the whip -- it lashes out and cuts\n       into Short Round's shoulder.  Blood appears and Short Round looks\n       stunned by the lash and by the fact the Marahajah knows who to\n       use the whip.\n\n                                   MAHARAJAH (Cont'd)\n                       As Dr. Jones suggested, I have\n                       been practicing.\n\n       The little Maharajah whirls and lashes the whip again.  Indiana\n       jerks as the bullwhip rips through his shirt and tears open his\n       flesh.  The Maharajah lashes again and again -- blood spurts\n       across Indy's tattered shirt.\n\n       As the whipping continues- Short Round jumps as if he is also be-\n       ing beaten.  His eyes fill with tears as he watches Indy suffer.\n\n       Finally, the little Maharajah lets the whip fall limp.  As the\n       Maharajah approaches Indy, Short Round lunges as him angrily but\n       the guards restrain him.\n\n       Indiana groans as he's turned over.  Blood trickles from his\n       mouth and he stares up hatefully at Mola Ram.\n\n                                   MOLA RAM\n                       The British in India will be\n                       slaughtered.  Then we will over-\n                       run the Moslems and force their\n                       \"Allah\" to bow to Kali.\n\n       Mola Ram is once again given the human skull by a priest and he\n       lifts it toward Indy's face --\n\n                                   MOLA RAM (Cont'd)\n                       And then the Hebrew God will fall\n                       and finally the Christian God will\n                       be cast down and forgotten.\n\n       Indy's head is held back and Mola Ram spills the blood -- it\n       flows out of the mouth of the skull into Indy's mouth.\n\n                                   MOLA RAM (Cont'd)\n                       Soon Kali Ma will rule the world!\n\n       Indy's eyes look horrified as the blood flows from the skull down\n       his choking throat -- some of the blood spills and falls to the\n       floor --\n\n       We see the very earth trembling as the evil spreads -- a fissure\n       appears beneath Indy's feet and a small line of crimson lava\n       oozes out and smiles evilly across the floor...\n\n                                                               CUT TO:\n\n127.   INT.  WILLIE'S SUITE - NIGHT                                   127.\n\n       Diaphanous curtains billow silently into the moonlighted room.\n       Two exotic birds sit on a golden perch, their eyes clicking\n       watchfully.  Suddenly the brids shriek and flap away --\n\n       Willie stumbles through the secret door and falls into the room.\n       Insects cover her and she shimpers as she knocks them off.  She\n       manages to stagger to her feet and she heads for the door.\n\n128.   INT.  THE PALACE - NIGHT                                       128.\n\n       Willie rushes out of her room and runs through the deserted pal-\n       ace looking for help.  She flies down the moonlit corridors, past\n       the huge wall paintings.\n\n       She stops by a courtyard and calls out desperately, but there is\n       no one around.  She backs away down a hallway and then jumps --\n       seeing something in a mirror:  a face looms behind her and she\n       screams!\n\n       Willie whirls and sees Chattar Lal, the Prime Minister, approach-\n       ing her.\n\n                                   WILLIE\n                       Oh my God, you scared me!  Listen,\n                       you've got to help.  We found this\n                       tunnel --\n\n       Captain Blumburtt comes around a corner and interrupts --\n\n                                   CAPT. BLUMBURTT\n                                   (to Chattar Lal)\n                       Jones isn't in his room.  Miss\n                       Scott -- my troops are leaving at\n                       dawn if you want us to escort you\n                       to Delhi --\n\n                                   WILLIE\n                       No -- you can't go!  Something aw-\n                       ful's happened.  They've got Short\n                       Round and I think Indy's been --\n\n                                   CAPT. BLUMBURTT\n                       What?\n\n                                   WILLIE\n                       We found a tennel that leads to a\n                       temple below the palace!  Please,\n                       come with me, I'll show you!\n\n       The two men exchange dubious looks.  Willie grabs Blumburtt by\n       the arm and they start down the hall.\n\n                                   CHATTAR LAL\n                       Miss Scott, you're not making any\n                       sense.\n\n                                   WILLIE\n                       I'm afraid they'll kill them!  We\n                       saw horrible things down there --\n                       they had a human sacrifice and they\n                       ripped a man's heart out!\n\n                                   CAPT. BLUMBURTT\n                       Who?\n\n                                   WILLIE\n                       It's some kind of cult!  And they've\n                       got the sacred stones that Indy was\n                       searching for.\n\n                                   CHATTAR LAL\n                       I sense the fumes of opium in all\n                       this.  Prehaps Miss Scott picked\n                       up the habit in Shanghai.\n\n                                   WILLIE\n                       What're you talking about -- I'm\n                       not a dope fiend!  I saw it!  I'll\n                       show you!\n\n129.   INT.  WILLIE'S SUITE                                           129.\n\n       She leads them into her suite.  Willie points to the dark opening\n       in the wall.  Blumburtt picks up an oil lamp and holds it toward\n       the opening -- suddenly he jumps back as Indiana emerges!\n\n                                   INDIANA\n                              (smiling faintly)\n                       What're we playing, hid and seek?\n\n       They're all startled.  Willie looks relieved and rushes over to\n       Indy and puts her arms around him.\n\n                                   WILLIE\n                       Oh, Indy, you got away!  Tell them\n                       what happened, they won't believe\n                       me --\n\n       He puts his arms around her and feels her trembling from fear and\n       anger.  He walks her to the bed and helps her sit down --\n\n                                   INDIANA\n                       It's okay.  You're all right now.\n\n                                   WILLIE\n                       They think I'm insane.  Tell them\n                       I'm not, Indy.  Please -- help me ...\n\n       The awful events have taken their toll and Willie covers her face\n       and cries like a scared kid.  Indy gets her to lie down on the\n       bed.  He sits beside her and smiles and touches her hair --\n\n                                   INDIANA\n                       Hey, I thought you were supposed\n                       to be a real tropper.  Willie?\n\n       He wipes the tears from her face and she holds his hand --\n\n                                   WILLIE\n                                 (quietly)\n                       What?\n\n                                   INDIANA\n                       You've got to go to sleep now.\n\n                                   WILLIE\n                                  (softly)\n                       I want to go home...\n\n                                   INDIANA\n                       I don't blame you... this hasn't\n                       been what you'd call a fun vaca-\n                       tion...\n\n       She smiles a little despite herself and he touches her cheek.\n       He eyes are already closing and he stands up.\n\n       A servant is entering the suite to take care of Willie.  She cov-\n       sers her with a blanket and start dropping the mosquito netting\n       as Indy walks off toward the verandah with Blumburtt and Chattar\n       Lal.\n\n130.   EXT.  THE VERANDAH - DAWN                                      130.\n\n       The first light is breaking over the mountain peaks.  Coming out\n       onto the verandah, Indy and the other two men see the cavalry\n       troops breaking camp below and readying their horses and trucks.\n\n                                   INDIANA\n                       I've spent by life crawling around\n                       in caves and tunnels -- I shouldn't\n                       have let somebody like Willie go\n                       in there with me.\n\n                                   CAPT. BLUMBURTT\n                       Miss Scott panicked?\n\n                                   INDIANA\n                       When she saw the insects she passed\n                       out cold.  I carried her back to\n                       her room.  She was sleeping when I\n                       re-entered the tunnel to look\n                       around.\n\n                                   CHATTAR LAL\n                       As she slept, she undoubtedly had\n                       nightmares.\n\n       Indiana looks at him and nods.\n\n                                   INDIANA\n                       Then she must have run out of the\n                       room and you found her.\n\n                                   CAPT. BLUMBURTT\n                       Did you discover anything in that\n                       tunnel, Dr. Jones?\n\n       Indiana stares into the rising sun.\n\n                                   INDIANA\n                       Nothing.  Just a dead end.  That\n                       tunnel's been deserted for years.\n\n       A sergeant-major shouts up to Blumburtt that the troops are\n       ready.\n\n                                   CAPT. BLUMBURTT\n                       Well, Mr. Prime Minister, my re-\n                       port will duly note that we\n                       found nothing unusual here in\n                       Pankot.\n\n                                   CHATTAR LAL\n                       I'm sure that will please the\n                       Maharajah, Captain.\n\n                                   CAPT. BLUMBURTT\n                                   (to Indiana)\n                       As I said before, we'd be happy to\n                       escort you to Delhi.\n\n                                   INDIANA\n                       Thanks, but I don't think Willie is\n                       ready to travel yet.\n\n                                                               CUT TO:\n\n131.   EXT.  THE PALACE ROAD - MORNING                                131.\n\n       Dust swirls as the British cavalry moves off with their Highland\n       Pipers at the head playing a military bagpipe tune.  Capt. Blum-\n       burtt comes out of the palace and gets into an open car.\n\n       Blumburtt's car moves off behind the cavalry and then the supply\n       trucks follow.\n\n132.   INT.  WILLIE'S SUITE                                           132.\n\n       The whine of the bagpipes is eerily muted in the dark room.\n       Through the gently swaying mosquito netting, we see Willie asleep\n       on the bed.\n\n       Then through her side of the gauzy netting, we see the door\n       opening across the room.  Indiana enters quietly and moves toward\n       the bed, his eyes fixed on Willie's sleeping body.\n\n       Indy sits down on the bed slowly.  Willie turns in her sleep and\n       opens her eyes.  Through the mosquito netting she sees Indy sit-\n       ting with his back to her.\n\n                                   WILLIE\n                       Indy?  Did you walk to them?\n\n                                   INDIANA\n                       Yes.\n\n                                   WILLIE\n                       So now they believe me.\n\n                                   INDIANA\n                       Yes, they believe you.\n\n       Indiana speaks in a strange monotone.\n\n                                   WILLIE\n                       Then they'll send the soldiers\n                       down into the temple...\n\n       Willie looks at Indiana's back and continues quietly.\n\n                                   WILLIE (Cont'd)\n                       I was scared to death last night\n                       when I thought they were going to\n                       kill you.\n\n                                   INDIANA\n                       No... they won't kill me.\n\n                                   WILLIE\n                                (smiling faintly)\n                       You know you've been nothing but\n                       trouble since I hooked up with\n                       you -- but I have to admit I'd\n                       miss you if I lost you...\n\n       Now Indiana starts to turn slowly.\n\n                                   INDIANA\n                       You won't lose me, Willie...\n\n       She sees him turn and his face slowly comes toward the mosquito\n       netting -- his face pushes into the netting and Willie looks\n       stunned as Indy's mouth opens --\n\n       He starts hissing grotesquely, smoke billows out of his mouth and\n       the mosquito netting BURNS OPEN to expose his terrifying face\n       moving toward Willie --\n\n       She is forzen with fear and unable to utter a sound as Indy's\n       malevolent face looms at her -- and then she notices his eyes --\n       his eyes glowing a hellish luminscent yellow!\n\n       Willie SCREAMS!!\n\n       She suddenly bolts from the bed and tries to run -- Indiana goes\n       into a rage, ripping the mosquito netting from the bed as he fol-\n       lows her.\n\n                                   INDIANA\n                       No!  I've found it -- you can't --\n                       Kali knows!\n\n       Willie tries the door but it's locked.  She sees Indiana moving\n       toward her ranting incoherently as he smashes a vase out of his\n       way --\n\n                                   INDIANA\n                       -- been too many lies -- there's no\n                       god's heaven -- just -- the horror!\n                       I've seen it -- life preying on\n                       life!\n\n       Willie cowers in a corner, horrified by the transformation she\n       sees in Indiana.  Shouting and pacing Indy holds his head against\n       the pain of his terrible thoughts --\n\n                                   INDIANA\n                       -- rivers -- destroying mountains --\n                       a comet in space -- exploding!\n                                 (holding his head)  \n                       Aaahh! -- the screams -- pitiful\n                       people -- their pain -- the hate --\n                       and greed -- always greed!\n\n       The light throws his shadow over Willie -- a giant shadow float-\n       ing back and forth over her as she cries in the corner, unable to\n       fight the evil devouring Indiana.\n\n                                   INDIANA\n                       -- but I've found -- Kali's touch!\n                       Death -- no more lies -- the death\n                       I've been searching for!\n                                  (shouting)\n                       Quit crying!  She can hear you --\n                       Kali knows fear -- don't you under-\n                       stand -- Kali is freedom!\n\n       Indiana stops pacing and Willie freezes in terror.  Now a bizarre\n       yellow light wipes across the room.  Indiana turns and watches\n       silently as two Thuggee guards emerge from a secret doorway\n       that's opened --\n\n       The shadows of the Thuggee guards loom over Willie and she\n       SCREAMS again!\n\n                                                               CUT TO:\n\n133.   INT.  THE TEMPLE OF DEATH - DAY                                133.\n\n       A sea of frightening faces once again intones the horrible sacri-\n       ficial chant.  Among the shorshippers, the little Maharajah sits\n       on a riased platform.  Like the other believers, he stares across\n       the crevasse at the altar of Kali Ma.\n\n       The wailing wind howls out of the high tunnel and the terrifying\n       chanting reaches a fever pitch.\n\n134.   INT.  THE TMEPLE ALTAR                                         134.\n\n       And once again the three sacred Sankara Stones glow magically.\n       Mola Ram materializes evilly amidst the swirling smoke and he\n       begins chanting in Sanskrit.\n\n       Beside the altar, half-clad female acolytes pass in front of the\n       robed priests -- with their fingers the women paint two white\n       lines across the priests' foreheads.\n\n       An acolyte moves in front of Chattar Lal -- the Prime Minister is\n       now dressed in robes.  As the devotional markings are painted on\n       his forehead, Chattar Lal translates the High Priest's speech to\n       Indiana who stands next to him.\n\n                                   CHATTAR LAL\n                       Mola Ram is telling the faithful\n                       of out victory.  He says the\n                       British have left the palace,\n                       which proves Kali Ma's new power.\n\n                                   INDIANA\n                       Yes, I understand.\n\n       Indiana bows his head to receive the mystical markings.  He lis-\n       tens to Mola Ram's rantings -- Indy's eyes are ominously vacant\n       as he stares up at the hideous statue of Kali.\n\n135.   INT.  MINE TUNNELS - DAY                                       135.\n\n       Beneath the temple, down in the bowels of the mountain, the piti-\n       ful children dig at the earth with their fingers.  A FAT GUARD\n       slouches down the tunnel, flogging malingerers with a aleather\n       strap.\n\n       Short Round sweats next to the others, clawing at the rocks,\n       doomed to work with them now in their search for the last wo\n       Sankara Stones.\n\n       The leather strap suddenly flays Short Round's back and he barely\n       manages not to scream out in pain.  The fat guard passes -- Short\n       Round and the other kids pull a large rock which suddenly comes\n       loose out of the wall -- !\n\n       They fall back and see they've exposed a vein of molten lava!\n       Hearing their shouts, the fat guard returns -- yelling at their\n       stupidity, he whips them and shoves them aside brutally.\n\n       Short Round see the fat guard's eyes glowing fiercely in anger.\n       Suddenly the fissure shoots out steam and spews some molten lava\n       over the guard's legs.\n\n       The guard screams and falls to the ground, thrashing about, try-\n       ing to kick the searing lava off his smoking flesh.\n\n       As the other kids cower, Short Round's humane instincts cause him\n       to jump forward to help the guard who moments earlier was beating\n       him --\n\n       Short Round tosses dirt on the guard's legs and grabs a gunny\n       sack and starts rubbing the lava off.  Shorty notices something\n       strange:\n\n       The guard's eyes, which were glowing yellow before, are now dim-\n       ming and returning to normal.  The moaning guard looks at Shorty\n       thankfully and then looks around as if waking from a nightmare --\n\n                                   SHORT ROUND\n                              (to another slave kid)\n                       His eyes -- they go out.\n\n       Other guards appear and lift the guard -- suddenly he starts\n       struggling against the guards not wanting to return to the night-\n       mare of Kali --\n\n                                   FAT GUARD\n                            (as he's dragged away)\n                       No!  NO!\n\n                                   SHORT ROUND\n                       The pain -- the pain makes him wake up!\n                                  (thinking quickly)\n                       Indy!  I can make Indy wake up!\n\n       But the other guards push and beat the children back to work.\n       Short Round is shoved against a wall and groans -- he reaches over\n       and grabs a large rock, lifting it defiantly --\n\n       But rather than heaving it at the guard, Short Round smashes the\n       rock down on the leg chains binding him to the other children.\n       Shorty beats at the chain with the rock, determined to escape.\n\n                                   SHORT ROUND\n                       Indy!\n\n136.   INT.  THE TEMPLE OF DEATH                                      136.\n\n       The wind moans and joins Mola Ram's voice echoing maniacally over\n       the multitude gathered in the enormous temple.  On his throne,\n       the little Maharajah listens transfixed.\n\n137.   INT.  THE ALTAR                                                137.\n\n       Chattar Lal watches Indiana staring hypnotically at the High\n       Priest as he speaks --\n\n                                   CHATTAR LAL\n                       You understand what he tells us?\n\n                                   INDIANA\n                       Kali Ma protects us now and for-\n                       ever, and we must pledge our\n                       devotion by worshipping her with\n                       an offering of flesh and blood!\n\n       Suddenly htere is a heart-rending scream of terror and the\n       priests draf forward the next sacrificial victim --\n\n       Indiana's glowing eyes watch emotionlessly as Willie is brought\n       out. Dressed in a Rajput maiden's outfit, Willie has been jewel-\n       ed and draped with flowers -- a strange contrast as she struggles\n       desperately.\n\n                                   CHATTAR LAL\n                       Your friend has seen and she has\n                       heard -- now she will not talk.\n\n       As Willie is dragged past she sees Indy and calls to him --\n\n                                   WILLIE\n                       Indy!  Help me!  Indy?!\n\n       Willie is shocked seeing that Indiana remains impassive and un-\n       caring as she's dragged to her death.\n\n                                   CHATTAR LAL\n                                   (to Indy)\n                       This will prove your devotion to\n                       Kali.\n\n       Indiana looks away from Willie's terrified face and stares up\n       adoringly at the monstrous statue of his goddess Kali.\n\n138.   INT.  THE MINE                                                 138.\n\n       In the dark tunnel, a rock smashes down onto a chain -- and\n       breaks it!  Short Round is exhausted.  He looks around furtively\n       and sees a guard approaching.\n       \n       Short Round takes a chance -- he dives and rolls across the\n       tunnel.  He ducks behind a mine car full of rocks being pushed\n       out by two chained children.\n\n       The guard lumbers past unsuspectingly as Short Round makes his\n       escape using the moving mine car as cover.\n\n139.   INT.  THE ALTAR                                                139.\n\n       Up in the temple, Willie continues to struggle as her legs are\n       strapped to the iron sacrifical frame.  Chattar Lal grabs her\n       hand and ties it down.  Willie's free hand reaches out imploring-\n       ly toward Indiana --\n\n                                   WILLIE\n                                (hoarsely)\n                       Please, God, don't let them do\n                       this to me -- help me, Indy!\n\n       He reaches out slowly and Willie grabs his hand tightly.  Indy\n       looks into her eyes and then stares at her hand -- and slowly\n       lifts it and starts tying it to the iron frame.\n\n                                   WILLIE (Cont'd)\n                       No -- no!\n\n       Willie cries is disbelief as Indiana calmly betrays her.\n\n140.   INT.  THE MINES BELOW                                          140.\n\n       Short Round races up a tunnel and then flattens himself behind a\n       corner.  He peers anxiously into a large carven and sees two\n       guards walking away.\n\n       When the coast is clear, Short Round darts across the cavern to a\n       long wooden ladder tilted up against a wall.  Short Round looks\n       up the high ladder and sees a kid with a sack of rocks descending\n       from a burrow-hole half-way up the wall.\n\n       The exhausted kid nearly collapses at the bottom -- then jumps\n       seeing Short Round.  Shorty motions for him to keep quiet.\n       Amaxed, the kid watches Short Round scramble up the ladder.\n       Shorty continues until he is high above the floor.\n\n       Dirty faces stare out of the high burrow as Short Round stops\n       climbing.  The kids are astonished as Short Round suddenly grunts\n       and kicks the ladder away from the wall!\n\n       The high ladder falls in an arc and what seem like sure suicide\n       slowly resembles a mini-Indiana Junes stunt as Short Round swings\n       to the other side of the falling ladder --\n\n       Short Round holds on for dear life as the ladder crashes against\n       the opposite cavern wall -- giving Short Round access to the\n       roof-hole that leads up to the temple!\n\n       Short Round scurries up the ladder and pulls himself up into the\n       chamber behind the altar.  He looks at the light flaring around\n       the statue of Kali --\n\n                                   SHORT ROUND\n                       Indy -- !\n\n141.   INT.  THE TEMPLE OF DEATH                                      141.\n\n       Chains clank and gears grind as the sacrificial frame is raised\n       over the crevasse.  Stretched out on it, Willie looks horrified\n       as she hangs suspended face down above the boiling lava!\n\n       The frame and victim descend slowly into the crevasse and the\n       crowd around the little Maharajah changs louder.\n\n142.   INT.  THE REAR CHAMBER                                         142.\n\n       Short Round dashes across the dark chamber behind the altar.  He\n       peers out and sees Willie disappearing into the crewasse!  He\n       sees Indiana watching impassively --\n\n                                   SHORT ROUND\n                       No -- Indy -- wake up!\n\n       Then Shorty sees a flaming torch hanging on a wall bracket and he\n       has an idea.\n\n143.   INT.  THE ALTAR                                                143.\n\n       Short Round suddenly darts out onto the altar and Mola Ram sees\n       him and yells.  Several priests grab for Shorty.  He eludes the\n       first priest, smashes the second in the stomach with his head,\n       and runs like a little quarterback toward the fiery torch --\n\n       Short Round snatches the torch from the wall and charges toward\n       Indiana.  Seeing him coming, Indy's eyes start glowing yellow and\n       when Short Round runs up to him, Indiana suddenly swings and\n       backhands the little guy brutally across the face!\n\n       The torch flies out of Shorty's hand as he's knocked against at\n       wall by Indy's vicious blow -- Short Round wipes a little blood\n       from his chin and stares at his hero in wounded disbelief.\n\n       Chattar Lal watches approvingly -- a priest moves toward Shorty.\n       Chattar Lal looks back toward the crevasse --\n\n       Willie hangs on the lowering frame, heat waves rising up now to\n       scald her skin and she chokes as the sulphuric air burns her\n       lungs!\n\n       Meanwhile Short Round is crawling backwards across the floor with\n       a look of terror on his face -- Indiana stalks him, hissing,\n       snarling, his eyes lgowing --\n\n       Short Round springs to his feet and tries to run -- Indy grabs\n       him and pulls him -- Shorty's hand grabs for another wall torch\n       and just manages to yank it free!\n\n       Indiana spins Short Round and clutches his throat.  As Indy\n       strangles him, Short Round struggles and finally jams the torch\n       into Indy's side.  The fiery torch burns Indy, smoking as it\n       sears his flesh, and he yells in pain.\n\n                                   SHORT ROUND\n                       Wake up!  It's just a nightmare,\n                       Indy!  Wake up, please Indy!\n\n       Indiana writhes in pain and Short Round sees the evil yellow glow\n       in Indy's eyes getting dimmer and finally going out.  Now it\n       seems like theold Indiana staring at him --\n\n                                   SHORT ROUND (Cont'd)\n                       Indy, you back?\n\n       Suddenly a priest grabs Short Round and pulls him off Indiana.\n\n                                   INDIANA\n                       No!  Give him to me!\n\n       Short Round is firghtened as Indy grabs him from the priest.\n       Indy lifts Short Round into the air --\n\n                                   SHORT ROUND\n                       No, Indy, no!\n\n       He sets Short Round down on the brink of the crevasse an inch\n       from doom.  Shorty looks down at the lava and is terrified.\n       Indiana finally flahses him a quick smile and winks!\n\n       Then Indiana whirls and punches the priest in the face!  Short\n       Round cheers, realizing that Indiana is back.\n\n                                   SHORT ROUND (Cont'd)\n                       We got to help Willie!\n\n       Indiana springs into action, stopping another priest with a quick\n       punch in the stomach.  Then he rushes over to the crankwheel and\n       pulley platform.  Indy jumps onto it, yanking one priest off who\n       spills onto the floor.\n\n       A second priest, who works the controls lowering the sacrificial\n       frame, sees Indy and releases the crankwheel --\n\n       Down in the crevasse, Willie screams as the iron frame suddenly\n       plummets toward the fulminating lava!\n\n       On the platform, the priest lunges at Indiana -- Indy uses the\n       man's own momentum to throw him over his head.  Indy then dives\n       for the crankwheel and manages to stop it --\n\n       Down in the crevasse, the fram jolts to a stop only yards above\n       the spumes of fiery lava.  The heat is so intense now that Wil-\n       lie's clothes start smoking and she passes out...\n       On the platform above, Indiana cranks furiously, raising the sa-\n       crificial frame.\n\n144.   INT.  THE TEMPLE                                               144.\n\n       The chanting stops at the Kali worshippers notice the battle on\n       the altar.  The little Maharajah looks concerned and leaves,\n       shoving through the crowd behind his bodyguards.\n\n145.   INT.  THE ALTAR                                                145.\n\n       Mola Ram shouts at his priests and another one of them runs to-\n       ward Indy on the platform.  Short Round dives and tackles the\n       priest.\n\n       Chattar Lal finally leaps onto the crankwheel platform and Indy\n       sees him pull a dagger.  He slashes at Indiana and Indy has to\n       let go of the crankwheel -- the gears scream and the chains\n       screech!\n\n       Below in the crevasse, the iron frame plunges again toward the\n       crimson lava!\n\n       On the platform, Indy hears the frame lowering and looks pan-\n       icked.  Chattar Lal slahses again with the dagger -- keeping Indy\n       away from the cogwheel mechanism --\n\n       Indy suddenly kicks the dagger from Chattar Lal's hand slugs him\n       in the stomach and dives toward the cogwheel mechanism.  He grabs\n       a iron rod and throws it into the gears --\n\n       the gears mangle the iron rod but finally grind to a stop.  Indi-\n       ana grabs the crankwheel and starts winding it up furiously.\n\n       Meanwhile, Short Round jumps onto the platform with Indy and\n       grabs a long wrench.  He starts swinging the wrench, keeping the\n       last priests off the platfrom.\n\n       The sacrificial frame finally rises up into view and Indiana\n       grabs it and swings it over onto the platform.  He looks at Wil-\n       lie anxiously as he releases her bindings --\n\n       Willie moans and moves her head.  Indy pulls her off the frame\n       and she starts coughing.  Gasping for breath, Willie ervives as\n       fresh air flows into her lungs.\n\n       Finally Willie opens her eyes and she sees Indiana.  Then she\n       notices something else and manages to cry out hoarsely --\n\n                                   WILLIE\n                       Look out -- !\n\n       Chattar Lal grabs a pistol from an unconscious guard and Indiana\n       whirls to see him pointing it -- Indy kicks the gun from his hand\n       and suddenly Chattar Lal starts shouting in a terrifying voice --\n\n       Chattar Lal's eyes glow as he lunges suicidally at Indiana, at-\n       tempting to take Indy with him as he dives from the platform!\n\n       Crashing into Indy, Chattar Lal knocks both of them back onto the\n       sacrificial frame which swings out over the crevasse --\n\n       Indy manages to dive off the frame just in time.  He grabs hold\n       of the platform as the crankwheel screams and the frame falls!\n\n       Looking up from the depths of the crevasse, we see the frame with\n       Chattar Lal on it plummeting downward into the sulphurous smoke!\n       The frame finally crashes, splashing into the molten lava.\n\n       Chattar Lal's body explodes inot flame friefly -- his flesh is\n       broiled off in an instant -- we glimpse a skeleton momentarily --\n       and then all is consumed and obliterated by the blazing lava.\n\n      scramble over to Short Round who jumps off the platform and they\n       follow him across the altar.\n\n       Indy sees Mola Ram quickly collecting the sacred Sankara Stones.\n       Indiana rushes over and spins Mola Ram around --\n\n       He slugs the High Priest in the face and Mola Ram keels over\n       backwards against the statue of Kali.  Short Round helps stuff\n       the Sankara Stones into Indiana's shoulder bag.\n\n146.   INT.  THE REAR CHAMBER                                         146.\n\n       Short Round, Willie and Indiana rush across the chamber behind\n       the altar.  They run over to the ladder and start climbing down\n       into the mines.\n\n147.   INT.  THE MINES\n\n       Willie follows Short Round.  Indiana jumps down last and pulls\n       the ladder away, letting it crash to the floor so they won't be\n       followed.\n\n       They draw the attention of the slave children working in the tun-\n       nels around the cavern.  But it's the sight of the approaching\n       guard that worries Indy --\n\n                                   INDIANA\n                       Come on, quick!\n\n       They duck into one of the tunnels.  As they hide, Indy watches\n       the guard passing.\n\n                                   WILLIE\n                       What're we going to do?\n\n       Indiana looks around at the silent, frightened children who've\n       stopped working in the tunnel and his anger darkens --\n\n                                   INDIANA\n                       We're going to get them out\n                       of here -- !\n\n       Then he looks at the bag holding the Sankara Stones and grows\n       still more determined --\n\n                                   INDIANA (Cont'd)\n                       And then we're going to get these\n                       out of here -- !\n                                  (seething)\n                       And somehow I'm going to see this\n                       place destroyed.\n\n148.   INT.  THE CAVERN - MOMENTS LATER                               148.\n\n       A gaurd passing hears a voice and stops --\n\n                                   INDIANA (O.S.)\n                       Ah, sir?  Excuse me --\n\n       The guard turns and looks amazed to see Indy smiling at him from\n       the mouth of the tunnel.\n\n                                   INDIANA (Cont'd)\n                       Listen, I'm from the union and I'd\n                       like to talk about the working\n                       conditions here.  Could you step\n                       inside a minute?\n\n       Indy smiles again and disappears into the tunnel.  In astonished\n       rage, the guard draws his sword and goes after Indy into the tun-\n       nel -- there's a pause and then we hear the guard yell!\n\n149.   INT.  THE TUNNEL                                               149.\n\n       Willie flattens against the wall as Indiana catapaults the big\n       guard past her back into the mine where he's set upon bu a horde\n       of rebellious slave children.\n\n       The kids swarm over the guard like jackalas and we see Short Round\n       pull a key from the struggling guard's robe.\n\n                                                               CUT TO:\n\n150.   MONTAGE - THE MINES                                            150.\n\n       A key is twisted and the chains are pulled from kids' legs...\n\n       Elsewhere, more chains are unlocked and rattle free.  Liberated\n       kids spill out of the tunnels...\n\n       A guard is tripped and attacked by a horde of ex-slaves...\n\n       In another location, kids wrap captured guards in layers of\n       chains...\n\n       High up on a ledge, a fleeing gaurd skids to a stop when he sees\n       kids charging at him.  He sees more kids rushing from behind him.\n       The guard scrams as he dives off the ledge...\n\n                                                        (END MONTAGE)\n\n151.   INT.  BEHIND THE ALTAR - DAY                                   151.\n\n       Freed children scramble up numerous ladders to escape the mines\n       below.  They follow the mass of children moving toward the front\n       altar.\n\n152.   INT.  THE ALTAR                                                152.\n\n       On the altar, under the statue of Kali, Willie and Short Round\n       are helping Indy and some of the bigger children rip down a\n       long wooden panel decorated with hideous Kali figures.\n\n       The childrens' escape is blocked by the chasm separating the\n       altar from the deserted sorshippers' area of the temple.  The\n       swelling crowds of children push and teeter dangerously on the\n       edge of the fire pit.\n\n       Indiana and the others carry the wooden panel through the crowd\n       toward the chasm.  They stand it up and when Indy gives thw word\n       they drop it --\n\n       The panel crashes across the chasm forming a plank across which\n       the children now begin running to safety.\n\n153.   INT.  BEHIND THE ALTAR                                         153.\n\n     The last of the children scramble up the ladders and run toward\n       the front of the altar.\n\n154.   INT.  THE ALTAR                                                154.\n\n       The childrens' bare feet stomp across the wooden plank -- below\n       them the lava of the fire pit bubbles and shows outbursts of\n       flame.\n\n       Indy stares at the plank and sees that it's starting to smoke\n       from the intese heat rising up.\n\n       On the far side of the plank, the children safely across scatter\n       through the deserted temple toward freedom.\n\n       Willie and Short Round help the last kids out onto the plank --\n       Indy sees one child's foot break though the smoldering wood --\n       the kid in front pulls the child to safety.\n\n       Willie and Short Round start to go out onto the plank but Indy\n       shouts at them --\n\n                                   INDIANA\n                       No, wait!\n\n       He runs over and pulls them aside -- he steps out onto the plank\n       and takes a few steps to test it -- suddenly the plank bursts\n       into flame in the middle.\n\n       Indy takes one more step -- and then the plank breaks!  Indy\n       dives back to the ledge of the altar and Willie and Short Round\n       grab him and pull him up and the wooden plank plummets into the\n       fiery chasm.\n\n                                   WILLIE\n                       What're we going to do?!\n\n                                   INDIANA\n                       There's got to be another way out.\n\n                                                               CUT TO:\n\n155.   INT.  A TUNNEL                                                 155.\n\n       Indiana, Willie and Short Round run through the deserted mine\n       tunnels.  They hear a rumbling noise and Indy leads them down a\n       side tunnel.  They stop and peer into a quarry.\n\n156.   INT.  THE QUARRY CAVERN                                        156.\n\n       A large cavern is the depository for the mine cars rolling in\n       with loads of rock.  Emaciated children (still unaware of the re-\n       volt and the other childrens' escape) break their backs shoving\n       the heavily-loaded mine cars.\n\n       Thuggee guards supervise the deadening work, while others oper-\n       ate the pulley-and-hoist system used to drag  the cars up the\n       sloped dump ramp.\n\n       Behind this operation, a thunderous waterfall cascades into a\n       huge cistern.  From there, chutes deply the rushing water to\n       power the large conveyor belt below it.\n\n       As the cars rise up the ramp, they tip and spill rocks onto the\n       conveyor belt which carries them toward an awesome stone cylinder\n       that rolls relentlessly , crushing the rocks into sand.\n\n       From the side tunnel, Indiana watches the noisy operation.\n\n                                   INDIANA\n                       Those empty cars have got to go\n                       out of the mines.\n\n       Willie and Short Round watch the children push the empty mine\n       cars.  The cars gain momentum and roll away down two dark tun-\n       nels.\n\n                                   INDIANA (Cont'd)\n                       Come on, let's see if we can\n                       catch a ride...\n\n       Tey duck out of the tunnel and run for cover behind a slag heap.\n       Loaded mine cars roaring down from the mines hurtle past them and\n       crash to a stop against the cars in front.\n\n                                   INDIANA (Cont'd)\n                       Okay, Shorty -- go!\n\n       He pushes Short Round who darts out after a mine car roars past\n       and dodges across the tracks before the next one descends.  Indy\n       pushes Willie  into  position and holds her ready --\n\n                                   WILLIE\n                       I can't!\n\n                                   INDIANA\n                       Go!\n\n       After another car crashes past, Indy shoves her.  Willie runs out\n       -- her shoe gets stuck and she freezes in the tracks!  Willie\n       sees a rock-filled car blasting down out of a tunnel directly\n       toward her!\n\n       Indiana dives, knocking Willie safely to the ground on the other\n       side of the tracks -- the heavy car hurtles past and crashes into\n       the cars in front.\n\n       Indy pulls Willie behind a massive wooden post holding up the\n       dump ramp and they hide from a passing gaurd.\n\n                                   INDIANA\n                       We've got to get across to the\n                       empty cars.  Wait here until I\n                       signal you.\n\n       They watch him run and hurdle a pile of lumber, bound up three\n       steps and duck behind a tool shack on the platform.  Indy reaches\n       out and grabs one of the passing slave children.\n\n       They see Indy put his hand over the kid's mouth and whisper to\n       him.  He releases the kid who sneaks away, alerting the other\n       children who start making their escapes into side tunnels.\n\n       Now Indy motions to Short Rounds and Willie to follow.  As they\n       start to move out they freeze dead in their tracks and Indy\n       motions again angrily --\n\n                                   INDIANA\n                       Come on!\n\n       Willie and Short Round see a guard coming up the steps on the\n       other side of the platform.  As the man rises he gets taller and\n       taller -- until they see it's a Thuggee giant coming up behind\n       Indiana.\n\n                                   INDIANA (Cont'd)\n                       Come one, what's wrong?\n\n                                   SHORT ROUND\n                       Behind you!\n\n       Indiana turns and looks into the bare chest of the seven-foot\n       tall guard.  Indy has to look up to see the man's mean-looking\n       face.\n\n                                   INDIANA\n                       I see the problem...\n\n       Indiana suddenly punches the giant in the stomach -- the giant\n       does not flinch, he just belches rudely.\n\n       Indiana growls and winds up to take a killer swing -- he steps\n       back, cocks his arm -- and suddenly turns and runs away.\n\n       No dummy, Indy dashes over and picks up a piece of wood.  The\n       giant starts toward him.  Indy drops the wood and looks around\n       for a much larger piece of wood.\n\n       As the giant stalks toward him, Indiana raises the large piece of\n       lumber -- Indy suddenly groans, drops the wood and clutches his\n       stomach.  Willie and Short Round looks startled --\n\n                                   WILLIE\n                       What happened?\n\n       Short Round shakes his head.  They see Indy recover from the\n       spasm as the giant rushes him.  Indy jumps aside, landing on a\n       loaded mine car that is passing by.\n\n       The car is being dragged up the dump ramp and the giant jumps out\n       onto it after Indiana.  Indy quickly grabs a rock and, as the\n       giant rushes him, Indy smashes the rock against the big man's\n       skull!\n\n       Unfortunately, it's the rock that shatters and not the skull.\n       Indy dives to the other end of the mine car and lifts a large\n       boulder.\n\n       Suddenly Indy drops the boulder and grabs him arm, feeling a\n       shooting pain again.  Then he yells as he feels yet another stab-\n       bing pain in his left leg.\n\n                                   WILLIE\n                       What's wrong with him?\n\n       Shorty is convused and worried -- and then he sees something!  He\n       looks up and there on a rock-cut balcony over the cavern is the\n       little Maharajah!\n\n       The little prince clutches the clay krtya doll that represents\n       Indy.  He jabs it in the leg with a long sapphire-tipped turban\n       pin.\n\n       On the mine car, Indy yells and grabs his right leg, which\n       collapses beneath him.  Short Round takes off.  He dashes under\n       the platform toward a bucket-chain carrying spent water back up\n       to the cistern.\n\n       Short Round leaps over the pool of water and grabs onto a bucket.\n       He rises up on this make-shift elevator toward the rock balcony\n       and the malicious little Maharajah.\n\n       Meanwhile, Indy is on the brink of unconsciousness as the giant's\n       massive hands throttle his neck.  Indy's head hangs over the end\n       of the mine car and suddenly his eyes widen --\n\n       The car with Indy and the giant reaches the peak of the dump ramp\n       and its upended -- spilling both of them and a shower of rocks\n       down the conveyor belt!\n\n       Down below, Willie dodges wooden pillars and weaves around\n       quarry equipment, trying to follow Indy's battle with the giant.\n       She trips and swears angrily --\n\n       Willie pushes and empty mine car out of her way -- an empty mine\n       car!  She runs back and starts shoving the mine car along the\n       rails toward the conveyor belt.\n\n                                   WILLIE\n                       I got one!  Indy, I got one!\n\n       Near the waterfall, Short Round ascends on the rising bucket\n       chain.  Up on the balcony, the little Maharajah chuckles evilly as\n       he watches Indiana on the conveyor belt --\n\n       The Maharajah lifts the clay doll and viciously jabs the pin in\n       the back of it!\n\n       On te conveyor, Indiana gets to his feet and then yells as a\n       stabbing pain lacerates his back!  He falls and writhed helpless-\n       ly as the giant staggers up the rocky conveyor belt toward him.\n\n       Willie shoves the mine car forward.  She sees Indy's desperate\n       situation as he's pulled along the conveyor toward the rock\n       crusher!\n\n                                   WILLIE\n                       Indy, look out!\n\n       She looks up and sees Short Round leap from the bucket-chain onto\n       the balcony.  The little Maharajah's eyes glow fiendishly as he\n       lifts the clay doll -- and jabs the pin into the doll's face.\n\n       On the conveyor belt, Indy yells agonizingly and clutches his\n       stabbed face!  Behind him, rocks explode as they're crushed and\n       pulverized by the mammoth roller.\n\n       In front of Indy, the Thuggee giant grabs a pick-axe as the con-\n       veyor slides past a tool bin.  The giant approaches Indy with it.\n\n       Short Round dashes across the balcny and tackles the Maharajah.\n       They fall and fight like mortal enemies.  Short Round sees the\n       little Maharajah's eyes glowing as he punches him in the face.\n\n       Only a few feet away from the rock-smashing roller, Indy is still\n       on his back on the conveyor belt, thrashing in pain, feeling the\n       Maharajah's pin piercing his face.  The giant raises the pick-axe\n       above his head and it about to split Indiana in two!\n\n       On the balcony, the Maharajah drops the doll and Short Round\n       dives for it -- he grabs the clay doll and pulls out the pin!\n\n       On the conveyor belt, Indiana is suddenly released from the\n       and looks up to see the giant swinging the pick-axe.  Indy rolls\n       aside at the last minute!\n\n       The pick-axe cleaves into the conveyor belt and the giant lurches\n       forward -- Indy gives him a helpful kick, sending the giant\n       flying toward the rock-crusher as Indy jumps off the conveyor\n       belt!\n\n       Seeing the huge roller looming in front of him, the giant crawls\n       desperately against the movement of the conveyor belt -- but he\n       gets snagged!\n\n       The sash around his waist gets caught under the rolling cursher\n       and he's dragged back under it feet first.  The Thuggee giant\n       screams hideously as his body is rolled over and squashed by the\n       enormous stone wheel!\n\n       On the balcony, Short Round is jabbing the pin into the squirming\n       little Maharajah.  The little pricne's eyes still glow yellow as\n       he hollers --\n\n                                   SHORT ROUND\n                       How you like bing pin cushion,\n                       Mr. Rajah-ha-ha?\n\n       The little prince rolls on the ground and tries to fight off\n       Short Round who keeps jabbing him -- suddenly the Maharajah\n       swings and the pin is accidentally rammed clear through his hand!\n\n       Shorty sees the pin sticking through both sides of the kid's\n       hand.  The Maharajah stares at his pierced hand, gasping in\n       astonishment.\n\n       Short Round notices the yellow glow dying out of the Maharajah's\n       eyes -- just as Indy's eyes cleared after he was released from\n       Kali's trance.\n\n                                   MAHARAJAH\n                       Please -- pull it out!\n\n       Short Round yanks the pin out of the little prince's hand.  The\n       Maharajah looks like he's jsut awakened from a bag dream.\n\n                                   SHORT ROUND\n                       It was the black sleep of Kali...\n\n                                   MAHARAJAH\n                       They made me do evil things...\n                       may lord Krishna forgive me.\n\n       Meanwhile, Indy runs along the catwalk above the conveyor belt.\n       He jumps and grabs onto a cross-bard -- he kicks out with his feet\n       and knocks a quarry guard off the catwalk.\n\n       The guard flies through the air and topples into the sand pit\n       where he thrashes around blindly under the sand falling from the\n       crusher.\n\n       Across the cavern, Willie shoves the rolling mine car toward the\n       balcony.\n\n                                   WILLIE\n                       Get down here, Shorty!  I got us\n                       a ride!\n\n       Willie shirls as another quarry guard rushes toward her.  She\n       yanks the iron brake-handle off the mine car and holds it threat-\n       eningly like a baseball bat --\n\n                                   WILLIE (Cont'd)\n                       Come on, let's see hoe hand your\n                       head is!\n\n       Up on the rock balcony, Short Round lowers himself over the edge.\n       The little Maharajah grabs his arm --\n\n                                   MAHARAJAH\n                       Please -- listen -- to go out\n                       you must take the left tunnel.\n\n       Shorty looks at him and he knows he's telling the truth.\n\n                                   SHORT ROUND\n                       Thanks pal.\n\n                                   MAHARAJAH\n                       I'm going to try to find the\n                       English soldiers.\n\n                                   SHORT ROUND\n                       Good luck.\n\n       Short Round slips over the edge and slides down a wet stalactite\n       to the floor of the cavern.\n\n       There he finds Willie swinging the brake-handle and smashing the\n       guard in the gut.  The man doubles in pain -- Willie kicks his\n       putt and he splashes into the pool of water.\n\n                                   WILLIE\n                       I don't appreciate being cooked\n                       like a french fry!\n\n                                   SHORT ROUND\n                       Willie, come on!\n\n       Willie starts pushing the empty mine car with Short Round.\n\n                                   SHORT ROUND (Cont'd)\n                       You do pretty good for a girl!\n\n       Across the quarry, Mola Ram and six temple guards run out onto a\n       high platform next to the waterfall.  Mola Ram sees Willie and\n       Short Round pushing the mine cat.\n\n       Mola Ram shouts to his men -- two of them pull pistols and open\n       fire!\n\n       Bullets ricochet off the mine car and Short Round shoves Willie\n       to the far side of the car where they both take cover.\n\n       Meanwhile, up on a catwalk, a guard slices a sword through the\n       air and Indiana ducks!  The sword slashes into a wooden railing\n       and the guard tries frantically to pull it out --\n\n       Indiana slams kis knee up into the guard's stomach and then\n       smashes his fist down on his neck -- the man collapses.  Indy\n       hears more gunfire.\n\n       Indiana rushes along the catwalk toward the platform above.  He\n       edges against the wall below the platform, staying out of sight\n       as he unfurls his whip.\n\n       One of Mola Ram's guards fires again from the high platform and\n       Indiana lashes the whip -- the whip wraps around the gunman's\n       arm and Indy yanks on it --\n\n       The gunman topples through the air and crashes down onto the cat-\n       walk.  Indy grabs the gun.  He kicks the guard off the catwalk\n       and the man falls into the waterfall pool.\n\n       As the other guards fire down at him, Indiana dodges along the\n       catwalk and fires back at them.  A bullet explodes near Mola Ram\n       and he ducks back --\n\n       Meanwhile, Short Round and Willie have the mine car rolling and\n       they jump into it --\n\n                                   SHORT ROUND\n                       Indy!  Hurry!\n\n       Indiana spots the rolling mine car racing across the quarry.  Indy\n       takes off and runs along the catwalk -- bullets explode around\n       him, splintering wood.  Indy reaches the end of the catwalk --\n\n       Suddenly he dives into the air and catches hold of a block and\n       tacke!  Indy skids along the pulley system, sliding down a cable\n       toward the mine car in which Short Round and Willie are riding.\n\n       Bullets whiz past as Indiana sails in the air above the speeding\n       mine car - when they are in sync, Indy lets go and drops into the\n       mine car next to Willie and Short Round!\n\n       Mola Ram rushes forward and watches the speeding mine car rolling\n       down the track toward the tunnels --\n\n                                   MOLA RAM\n                       They've stolen the Sankara\n                       Stones -- they must be stopped!\n\n       In the speeding  mine car, Indy sees the tracks separating in two\n       directions -- one back into the quarry, the other toward two tun-\n       nels that lead out of the mines.\n\n       Indiana lifts a shovel from the floor of the car and swings it\n       just in time -- he hits a switch which CLANGS as they speed by\n       and the car is shunted tipsy-turvy onto the track toward the two\n       tunnels.\n\n       Willie hangs on as the car tears down the track toward the tunnel\n       on the right -- and Short Round looks worried --\n\n                                   SHORT ROUND\n                       No, Indy, it's left tunnel.\n\n       But it's too late and they all hold on as the mine car shoots\n       donw into the darkness of the echoing tunnel.\n\n157.   INT.  THE TUNNEL                                               157.\n\n       The wind rushes past Indiana as the car descends into the tunnel\n       and picks up speed.  Willie hangs on with Short Round -- the mine\n       car roars around a curve and flies fater along the rails.\n\n158.   INT.  THE QUARRY                                               158.\n\n       Back in the quarry, Mola Ram supervises the guards as they shove\n       empty cars toward the tunnel.  Carrying long Khyber rifles, they\n       jump aboard the cars.  The first one rolls into the dark tunnel\n       and the second car speeds after it.\n\n159.   INT.  THE TUNNEL ENTRANCE                                      159.\n\n       The two Thuggee cars shoot past, descending into the darkness in\n       pursuit of the infidels who stole the Sankara Stones.\n\n160.   INT.  THE TUNNEL                                               160.\n\n       The mine car hurtles past.  Indy sits in front, pulling back on\n       the brake-lever to control their speed and keep them from careen-\n       ing off the tracks.\n\n       Expecting trouble, Short Round peers over the back end of the\n       car.  Willie ducks low, watching the heavy beams flashing danger-\n       ously close above their heads.\n\n       Then Willie's eyes go wide and she groans in terror like a girl\n       on a roller coaster as the mine car suddenly plunges downward,\n       taking their stomachs with it.\n\n       A gunshot rings out and Short Round sees the first Thuggee car\n       appear around a curve behind them.  Mola Ram's gunmen start\n       blasting.  Bullets ricochet off the mine car and Indy yells back\n       to Short Round.\n\n                                   INDIANA\n                       Come here and take the brake!\n\n       Short ROund scurries forward and grabs the brake from Indy.\n\n                                   INDIANA (Cont'd)\n                       Slow on the curves or we'll fly\n                       off the tracks!\n\n                                   SHORT ROUND\n                       Read you loud and clear, Indy!\n\n       Short Round grins as he holds the brake -- Willie realized that\n       this is Shorty's idea of a good time!\n\n161.   INT.  THE CAVERN                                               161.\n\n       Up in the quarry, gunmen push a third car toward the tunnel, but\n       Mola Ram stops them.  He shouts and they turn and look instead\n       toward the waterfall and huge cistern....\n\n162.   INT.  THE TUNNEL                                               162.\n\n       Indiana is crouched in the back of the zooming mine bar blasting\n       away with the pistol he captured in the quarry.\n\n       A gunman in the car behind returns his fire, the explosions\n       lighting up the tunnle walls.\n\n       Indy aims and fires again -- the gunman is hit and knocked back\n       in the car.  Another guard with a Khyber rifle moves up to the\n       front and starts firing.\n\n       Meanwhile, as the car goes into a hard turn, Short Round rides\n       the brake -- beneath the car we see the brake-pad scraping on the\n       metal wheel.\n\n       The tunnel gets lower and Indy has to duck under each beam flying\n       over and can only pop up to fire between the low beams.\n\n       The rifleman in the car behind is relading.  Then he lifts his\n       rifle -- Indy pops up simultaneously and shoots!\n\n       The gunman is hit, his rifle flies up and his head smashes\n       against the beam hurtling above!  Screaming horribly, the gunman\n       is knocked from the speeding car like a broken doll.\n\n163.   INT.  THE CAVERN                                               163.\n\n       Up in the quarry, Mola Ram's men swing sledge hammers, bashing\n       away at the rock supports under the huge water-filled cistern.\n\n164.   INT.  THE TUNNEL                                               164.\n\n       Indiana runs out of bullets.  He sees the car behind getting\n       closer.  He tosses the pistol and hits a Thuggee in the head.\n       Another Thuggee retrieves Indy's pistol and starts reloading it.\n\n       Suddenly Indy is being shot at by his own gun and he yells to\n       Short Round\n                                   INDIANA\n                       Let up on the brake!\n\n                                   SHORT ROUND\n                       What?!\n\n       Indy shoves past Willie and takes the brake level from Shorty.\n\n                                   INDIANA\n                       Let her go!  Our only chance is\n                       outrunning them!\n\n                                   WILLIE\n                       What above the curves?!\n\n       Short Round looks scared as Indy released the brake and the car\n       hurtles toward a curve.  They grab the sides of the car as it tips\n       precariously.  Behind them, the curve throws the gunmen from side\n       to side in the car following.\n\n                                   SHORT ROUND\n                       Indy, look out!\n\n       A sharper curve looms ahead and Indy shoves the brake completely\n       off!\n\n                                   WILLIE\n                       What're you doing?!  We're going\n                       too fast!!\n\n       Willie closes her eyes as they rocket toward the curve.  In the\n       car behind, the Thugge guard at the brake also shoves the brake\n       off -- and looks extremely worried.\n\n       Indy's car hits the curve and the centrifugal force lifts the in-\n       side wheels off the rails!\n\n                                   INDIANA\n                       Get over on the other side!\n\n       Willie and Short Round jumps over to his side as the car whips\n       around the curve!  Indy looks back and sees the car pursuing them\n       is also taking the curve at full speed --\n\n       Suddenly the Thuggee car swereves dangerously, the weight shifts\n       too much to the outside -- and the car derails!\n\n       The car bounces off the tracks and flies through the air into a\n       siding where is CRASHES against a stone wall in an EXPLOSION of\n       rock and metal!\n\n       Pieces of debris pommel the drive of the second Thuggee car and\n       he quickly grabs for the brake to slow down and avoid the same\n       fate!\n\n       In the lead car, Indy smiles smugly as Willie opens her eyes.\n\n                                   INDIANA\n                       One down, one to go!\n\n165.   INT.  THE CAVERN ABOVE                                         165.\n\n       Mola Ram's guards continue to bash away with sledge hammers at\n       the rock supports under the mammoth cistern.  One of the supports\n       starts to crumble --\n\n       From above, we see the cistern list to one side and water laps\n       dangerously over the edge as the huge tank creaks and sawsy.\n\n166.   INT.  THE TUNNEL                                               166.\n\n       Indiana and Short Round heft a railroad tie out of th bottom of\n       the car and Willie watches them lift it onto the back --\n\n       As gunfire continues to explode from the car behind them, Indiana\n       and Short ROund shove the railroad tie off the back of the car --\n\n       The wooden railroad tie falls and bounces back across the tracks.\n       The gunmen in the car behind spit it and yell in panic --\n\n       Indy and Willie watch the car behind crash into the railroad tie\n       -- but the tie just skids, catches and bounces up and out of the\n       way like a huge tumbling matchstick!\n\n                                   WILLIE\n                       Anymore ideas...?\n\n                                   INDIANA\n                       Yeah -- this time you're gonna\n                       help!\n\n167.   INT.  THE CAVERN                                               167.\n\n       The sledgehammers continue -- until two of the rock supports give\n       way!  There are shouts as the guards run for cover.\n\n       Mola Ram stands on a platform watching the huge cistern slowly\n       keel over -- the noise is incredible as the colossal tank crashes\n       to the ground!\n\n       Suddenly a half-million gallons of water explode across the cav-\n       cern and surge in a tidal wave toward the tunnels!\n\n168.   INT.  THE TUNNEL                                               168.\n\n       The walls of the tunnel flash past and curves appear suddenly out\n       of the darkness as the hair-raising chase continues --\n\n       Short Round and Willie struggle to help Indy lift a large boulder\n       from the bottom of the speeding mine car.\n\n       The cars descend again into a stretch of much lower tunnel where\n       the beams flash past inches above them.  Indy judges the beams --\n\n                                   INDIANA\n                       Okay  -- one -- two -- NOW!\n\n       All three of them groan as they raise the boulder and shove it\n       off the back of the car -- ducking instantly to avoid being de-\n       capitated by the next beam!\n\n       Looking back, they see the gunmen pop up between the beams -- and\n       they see the looks of terror on the gunmen's faces as they see\n       the boulder in front of them!\n\n       The Thuggee car hits the boulder and upends!  The guards scream\n       horribly as the car tumbles end over end, slamming against the\n       tunnel walls, getting ripped to shreds so that finally only\n       pieces of metal, wheels and debris fly like a meteorite shower\n       down the tunnel!\n\n       Willie whoops for joy and hugs Indy who smiles modestly --\n\n                                   INDIANA\n                       Okay, Shorty, hit the brakes!\n\n       Short Round dives for the front of the car and ahppily pulls the\n       brake lever -- it doesn't work!  Short Round yanks on it harder\n       -- the brake level suddenly breaks off!\n\n                                   SHORT ROUND\n                       Indy!!\n\n       Indy sees Short Round holding up the broken brake lever!  Indy\n       crawls quickly toward Shorty while Willie holds on for dear life!\n\n       Completely out of control, the car hurtles down a decline into a\n       section where the tunnel if larger again --\n\n       Indiana bends over the front of the car and looks underneath.  He\n       sees the brake tension hanging loose from the brake-pad.  Indiana\n       pulls himself back up and looks at Willie and Short Round.\n\n                                   INDIANA\n                       Grab onto me -- I'm going to try\n                       and slow us down from underneath!\n\n       Willie looks terrified but helps Short Round grab onto Indy's arm\n       and the back of his jacket.  He skips over the front of the car\n       and swings a leg underneath --\n\n       Indy is inches above the rails and the rocky ground blurring be-\n       neath the car as he tries to kick at the brake-pad.  His feet\n       fall and he bumps along, dragged dangerously for a moment --\n\n       Indy manages to find a foothold on the undercarriage of the car.\n       As they hold onto him, Indy kicks again and his foot hits the\n       brake-pad.  He shoves it and slowly the pad closes against the\n       spinning wheel...\n\n                                   WILLIE\n                       Oh no!\n\n       Willie and Short Round look up and see that the tunnel is ending\n       ahead and the track dead-ends into a stone wall!\n\n                                   INDIANA\n                       What's wrong?\n\n       He looks around -- and sees the car rocketing directly toward the\n       stone wall!\n\n       Indy's foot starts kicking in high-gear underneath the car -- he\n       slams at the brake-pad with all his strength -- the pad screeches\n       against the spinning wheeel and starts sparking!\n\n       The car seems to slow as it shoots toward the end of the tunnel.\n       Indy groans and pushes hard against the smoking brake-pad.\n\n       The car slows more and more until it runs down the last few yards\n       to the dead-end and rolls gently to a stop, just nudgeing Indy's\n       back against the wall....\n\n                                   INDIANA\n                       Ouch...\n\n       Willie looks faint as Indiana gets to his feet and Shorty jumps\n       out of the car.  They help Willie out and she stands shakily --\n\n                                   WILLIE\n                       I'm okay -- I'm fine -- I love to\n                       flirt with death...\n\n       Indiana sees that the tunnel ahead continues without any more\n       tracks.  Then they hear something --\n\n       A strange rumbling sound echoing down the tunnel from behind\n       them.  The walls seem to reverberate.  Looking worried, they\n       start walking away down the tunnel.\n\n       They walk faster as the noise behind them becomes louder and they\n       keep glancing over their shoulders --\n\n                                   WILLIE\n                       What's that?...Indy?!\n\n       Indiana isn't sure and he pulls Willie by the arm and all three of\n       them start jogging.\n\n       The rumbling behind them sounds increasingly ominous and finally\n       they start running full tilt.  They rush down the tunnel and the\n       awful noise becomes defening!  Willie looks around again and\n       slows suddenly --\n\n       Willie stops dead in her tracks -- paralyzed -- awestruck --\n       DOOMED!\n\n       Willie sees a monster wall of water (released from the quarry) as\n       it thunders around a curver -- a mammoth tidal wave crashing spec-\n       tacularly against the opposite tunnel wall!\n\n       A veritable \"tsunami\" caroming off the tunnel wall and spewing\n       furiously forward like a hydrous Juggernaut!\n\n                                   WILLIE\n                                 (frozen in\n                                  her tracks)\n                       Oh... shit...\n\n       Indiana and Short Round notice that Willie's sloed and they stop\n       running -- they also see the cataclysm of water crashing down the\n       tunnel toward them.\n\n       Indy runs back and grabs Willie.  All three of them take off,\n       running faster than they've ever run in their lives!\n\n       The tidal wave smashes forward, booming behind them and Indiana\n       realizes quickly that they're going to lose this race.  Suddenly\n       he sees a small side-tunnel in a bend ahead --\n\n                                   INDIANA\n                       There!  Dive!\n\n       They lunge toward the hole and Short Round dives in it first.\n       Indiana shoves Willie into the hole and jumps in after her just\n       as the colossal tidal wave explodes  past!\n\n169.   INT.  THE CHUTE                                                169.\n\n       The small tunnel drops precipitously and they slide down, shower-\n       ed by the small side-current of water that's broken off from the\n       main force.\n\n170.   INT.  A LARGE TUNNEL                                           170.\n\n       They rolls and tumble out of the small chute into a larger tunnel.\n       The roar of the tidal wave sounds distant and receding as they\n       catch their breath.\n\n                                   INDIANA\n                       Lucky I found a short cut.  Look,\n                       there's a light at the end of the\n                       tunnel...\n\n       Suddenly an EXPLOSION!  They turn and see the thundering tidal\n       wave crashing around a curve and cascading down the tunnel behind\n       them again!\n\n                                   WILLIE\n                       Some short cut!\n\n       They all holler in unison and start running like bats out of hell\n       toward the daylight.  The towering wall of water surges relent-\n       lessley after them --\n\n       The tidal wave looms up to annihilate them as they race to the\n       mouth of the tunnel -- and Willie SCREAMS!  Indy grabs her and\n       all three of the flail their arms to keep from losing their bal-\n       ance!\n\n171.   EXT.  THE TUNNEL EXIT - DAY                                    171.\n\n       The tunnel exits midway up a cliff and the three totter precari-\n       ously on the brink looking down at a 300 foot sheer drop to\n       a gorge below!\n\n       Indiana swings Willie onto a narrow ledge on one side and pushes\n       Short Round after her -- he jumps himself to the other side just\n       as the tidal wave crashes past them!\n\n       The water bursts out of the tunnel -- the gusher spews forth from\n       the cliffside into the air as if Hoover Dam just broke lose!\n\n       Short Round and Willie balance on the narrow ledge on one side of\n       the geyser -- Indy is perches on the ledge on the other side of\n       the incredible eruption of water.\n\n       Willie gets vertigo looking down into the gorge where the water\n       crashes at the bottom.  There crocodiles are disturbed and\n       slither angrily.\n\n       Indy looks up and sees a rope bridge swinging about twenty feet\n       above Willie and Short Round.  Indy shouts across the blasting\n       water --\n\n                                   INDIANA\n                       Willie -- the bridge!  Climb up\n                       to the bridge!\n\n       Willie looks frightened.\n\n                                   SHORT ROUND\n                       Nothing to it -- follow me!\n\n       He edges along the narrow ledge toward the bridge and Willie\n       follows him.  Once under the bridge, they start climbing up the\n       rocks to it.\n\n       Meanwhile, Indiana is scaling the cliff face to get over the\n       water geyser to the other side.  He grabs at scrub brush and\n       finds a few perilous footholds as he makes his way to the bridge.\n\n172.   EXT.  THE ROPE BRIDGE                                          172.\n\n       Willie and Short Round pull themselves up at the end of the\n       bridge.  Behind them a dark tunnel runs back into the mines.\n       What's in front of them is hardly more reassuring --\n\n       The rope bridge across the gorge is a century old and defintely\n       wasn't built by army engineers.  Laying across the two bottom\n       rope-spans, worm-eaten and moldy boards offer risky footings.\n\n       Vertical side ropes connect the bottom rope-spans to the two up-\n       per ropes that constitute the dangerous hand-railings.\n\n       Short Round steps tentatively out onto the bridge.  It holds him\n       and he turns and smiles at Willie --\n\n                                   SHORT ROUND\n                       Easy like pie!  Kid's stuff!\n\n       Suddenly the board under him breaks! Willie grabs Short Round\n       before he falls into the abyss!  Looking pale and less cocky,\n       Short Round starts out again and Willie follows his carefully.\n\n       They continue stepping across the bridge cautiously, a feat made\n       more difficult by the bridge's constant swaying and the hear-\n       stopping up and down movement.\n\n       Behind them, Indy finally pulls himself up from under the bridge.\n       He stands up and sees Willie and Short Round halfway across\n       already.  Then he hears something and turns quickly -- he takes\n       his whip out and ducks to the side of the tunnel as two Thuggee\n       guards rush out.\n\n       Indy cracks the whip, catching the first guard around the neck --\n       the guard spills forward and trips the second guard.  The first\n       man tries to stand but Indiana kicks him in the head.\n\n       The second guard gets to his feet and seings his sword -- Indy\n       ducks, slams him in the stomach and dives for the first guard's\n       sword.  He grabs it and rolls aside quickly as the second gaurd\n       attempts to slice him in two!\n\n       Indy gets to his feet and immediately finds himself about to en-\n       gage in a sword duel with the enraged Thuggee guard.  Indy looks\n       at the unfamiliar sword, hefts it, and tries to quickly decide\n       the best way to use it --\n\n       Suddenly the guard shouts and charges.  Indy decides shouting\n       must be the \"de rigueur\" technique and shouts back loudly -- the\n       two swords CLANG and spark as the duel erupts.\n\n       Indy flails and feints and the Thuggee guard lunges and slashes.\n       Indy finally gains the upper hand and dispatches the Thuggee\n       guard who slumps defeated into the dirt.\n\n       Keeping the sword, Indy starts out onto the bridge, walking as\n       quickly as possible across the rickety span.  He hears shouting\n       ahead and looks worried then temple guards appear at the far end\n       of the bridge.\n\n       The guards suprise Willie and Shorty as they finally get across\n       the bridge.  Struggling   futilely with the guards, Willie shouts\n       at Indiana --\n\n                                   WILLIE\n                       Indy -- looks out behind you!\n\n       Indy sees more Thuggee guards rushing out of the tunnel behind\n       him.  He turns and sees two of the tmeple guards who captured\n       Willie and Short Round coming across the bridge in front of him.\n\n       Indy stands helpless in the middle of the swaying bridge with\n       guards approaching from both sides, and nothing but heaven above\n       and the rocky gorge hundreds of feet below!\n\n       A wind comes up and the High Priest, Mola Ram, appears on the far\n       end of the bridge.  He stands with the guards who hold Willie and\n       Short Round.\n\n       The wind whips around Indy and he staggers unsteadily on the\n       swaying bridge as he watches Mola Ram --\n\n                                   INDIANA\n                       Let my friends go!\n\n       Mola Ram shouts in Hindi and the guards start to move toward Indy\n       from both sides of the bridge.\n\n                                   INDIANA (Cont'd)\n                       That's far enough!\n\n                                   MOLA RAM\n                       You are in no position to give\n                       orders, Dr. Jones.\n\n       Indiana indicates the bag over his shoulder --\n\n                                   INDIANA\n                       You want the stones, let them go\n                       and call off your guards!\n\n       Mola Ram motions and the guards move farther out on both sides of\n       the bridge -- suddenly Indiana swings the sword and it cuts into\n       one of the bottom rope-spans!\n\n       The rope is half-severed and frays slowly under the tension!\n\n                                   MOLA RAM\n                       Impressive, Dr. Jones. But I\n                       don't believe you would kill\n                       yourself!\n\n       Mola Ram motions again the his guards (looking more nervous now)\n       step farther out onto the bridge, mvoing closer to Indy from both\n       sides.\n\n       Indy swings the sword again, cutting into the other rope-span!\n       It, too, is now partially severed and frays slowly.  The bridge\n       jolts and Indy and the guards sway precariously!\n\n       Suddenly Mola Ram shoves Short Round out onto the bridge.  The\n       High Priest draws a dagger and pushes Willie onto the swaying\n       span, holding the knife behind them both.\n\n                                   MOLA RAM (Cont'd)\n                       Your friends will die with you!\n\n       In different times this would be called a Mexican stand-off\n       Indiana looks at the guards in front and behind him.  He sees\n       Willie and Short Round out on the bridge now with Mola Ram at\n       their backs.\n\n                                   INDIANA\n                       Then I guess we're all going to\n                       take a big dive!\n\n       Indy and Short Round's eyes meet -- and the kid realizes that his\n       hero isn't kidding.  Willie looks at Shout Round anxiously -- she\n       notices that Shorty is surreptitiously wrapping his foot around a\n       rope support.\n\n       Petrified, Willie also secretly wraps her foot around a rope and\n       does likewise with her arm --\n\n                                   MOLA RAM\n                       Give me the stones!\n\n                                   INDIANA\n                       Mola Ram -- you're about to meet\n                       Kali -- in Hell!\n\n       Indiana swings the sword with all his might -- it whooshes\n       through the air and slashes clear through the top and bottom\n       ropes --!\n\n       Immediately Mola Ram's guards start to flee in panic -- too late!\n       Indiana swings the sword again and the two ropes on the other\n       side are severed --\n\n       The rope bridge is sheared in two!  It breaks in the middle and\n       both halves fall apart!  The guards scream horribly in the air as\n       they plunge down into the rocky gorge!\n\n       Willie and Short Round cling to their established footholds and\n       fall with the bridge toward the wall of the gorge.  Mola Ram\n       spills forward, clutching desperately at the ropes and slats --\n\n       Below them, Indiana has latched onto a rope and swings with the\n       bridge as it hits the gorge wall and hangs vertically now, dang-\n       ling from its moorings at the top.\n\n       There's an instant of suspended animation as all who remain alive\n       realize they are alive.  Short Round and Willie cling near the\n       top of the now vertical bridge.\n\n       Below them, Mola Ram clutches onto one of the main ropes while\n       directly above him the last of his guards holds on for dear life.\n\n       Short Round and Willie struggle upwards, clutching ropes and\n       stepping on slats.  Finally, Short Round heaves himself up onto\n       solid ground and turns to help Willie up.\n\n       Meanwhile, dangling below on the bridge, Indy reaches up and\n       grabs Mola Ram's leg.  The High Priest kicks and tries to break\n       Indy's grip.  He kicks again and smashes Indy in the face.\n\n       Indy won't let go.  Suddenly the High Priest reaches up and grabs\n       his own Thuggee guard and yanks his down by the front of his\n       shirt --\n\n       Mola Ram shoves the luckless guard down onto Indy, trying to\n       dislodge him by sacrificing the screaming Thuggee.  Indy manages\n       to hang on.  The Thuggee is less fortunate and falls screaming to\n       his death.\n\n       Then Mola Ram looks across the gorge and yells.  Indy sees a dozen\n       of the last Thuggee guards streaming out of the tunnel -- only\n       to be stranded on the far side of the now bridgeless gorge.\n\n       Indy starts climbing up after Mola Ram again.  He grabs at the\n       back of Mola Ram's robe and pull him down.  Slipping, Mola Ram\n       turns and it's Indy's chance to punch Mola Ram in the face.\n\n       Mola Ram's eyes are glowing yellow and he's shouting incoherent-\n       ly.  He grabs the strap of Indy's shoulder bag and stamps on In-\n       dy's hand -- Indy falls!\n\n       Indiana slips downward, scrambling to catch hols of something --\n       meanwhile, Mola Ram now has the bag with the Sankara Stones.\n\n       Indy finally stops his downward slide and dangles dangerously\n       near the bottom of the bridge.\n\n       Across the gorge, the Thuggee guards run up a path to a small\n       gove of trees growing on a plateau above the gorge.  The guards\n       have bows and arrows and take firing positions --\n\n       At the top of the bridge, Mola Ram keeps climbing until rocks\n       start poundinghim from above -- Willie and Short Round pely him\n       with rocks which he tries to block with his arm.\n\n       Indiana starts to climb again, using all his strength.  He\n       reaches for a wooden slat -- suddenly a flaming arrow smashes\n       into the wood!\n\n       Indy turns in amazement and sees more flaming arrows rocketing\n       across the chasm directy for him!\n\n       Across the gorge, by the grove of trees, a Thuggee priest yells\n       orders to the archers who continue to launch the flaming arrows.\n\n       Indiana crawls up as the bridge starts to burn from the continu-\n       ing bursts of fiery arrows.  At the top, Mola Ram reaches up des-\n       perately for a hand old -- Willie smashes his hand with a rock!\n\n       The High Priest yells in pain and slips down to where Indy slugs\n       him again in the face!  They struggle as the fire burns up from\n       beneath them.\n\n       On the cliff above the fallen bridge, Willie watches the fire\n       rising toward Indy and Mola Ram as they fight.  Short Round turns\n       and sees something --\n\n                                   SHORT ROUND\n                       Willie, look!\n\n       They see horses galloping through a narrow pass -- the British\n       cavalry is returning.  Captain Blumburtt and the first troops draw\n       up their forses and dismount quickly.\n\n       A fussilade of flaming arrows force the British to take cover --\n       they quickly start firing back at the Thuggees with rifles.\n\n       As the battle above the gorge continues, Indy and Mola Ram fight\n       below on the dangling bridge --\n\n       Indiana sees the High Priest's eyes begin glowing and he hisses\n       insanely.  Mola Ram's hand thrusts out toward Indiana's chest and\n       Indy yells in pain --\n\n       Indy looks down and writhes terrified as he sees Mola Ram's hand\n       starting to enter his chest (as it entered the victim's chest\n       during the temple sacrifice)!\n\n       Mola Ram's finger are inching into Indy's body --  Indy clutches\n       at Mola Ram's piercing hand, trying to keep the deadly fingers\n       away from his heart.\n\n       Slowly, Indy is able to push Mola Ram's hand away and his fingers\n       withdraw from Indy's chest.  Indiana suddenly slugs the High\n       Priest in the face and grabs for the bag of Sankara Stones --\n\n                                   MOLA RAM\n                       No, the stones are mine!\n\n                                   INDIANA\n                       You're betrayed Shiva. *(He re-\n                       peats in Sanskrit Sankara's warn-\n                       ing)\n\n       As Indy pronounces the magical words, the bag begins glowing and\n       starts to burn Mola Ram as he clutches it -- the stones begin to\n       spill out of the bag and the High Priest grabs from them.\n\n                                   INDIANA (Cont'd)\n                       *(He repeats Sankara's warning\n                        in Sanskrit)\n\n       The blazing stones sear Mola Ram's flesh and he screams in pain.\n       The light suddenly dies in his eyes and for one instant he looks\n       at Indy as if awakened from a nightmare --\n\n       Mola Ram loses his balance and Indy grabs for the stones.  He\n       manages to clutch only one of them as Mola Ram screams and falls!\n\n       Indy sees the stone in his hand suddenly cool.  He watches Mola\n       Ram plummeting downward into the chasm and finally crashing into\n       the jagged rocks at the bottom.\n\n       The irritated crocodiles are disturbed once more -- but soon wel-\n       come the meal that just dropped in.  Jaws flash and teeth rip at\n       the High Priest's likeless corpse.\n\n       And Indy's bag with the Sankara Stones sinks into the murkly cur-\n       rent and disappears down the river ...\n\n173.   EXT.  THE CLIFF                                                173.\n\n       Indiana crawls up the burning bridge and Willie and Short Round\n       reach for him at the top.  They pull him up onto the cliff and\n       they all look around exhausted --\n\n       Across the gorge, more British troops emerge from the mine tun-\n       nels to subdue the remaining Thuggee guards on that side.\n\n       Finally the little Maharajah comes out of the dark mine tunnel.\n       He sees Short Round across the gorge -- and bows to thank him for\n       his help.  On the other side, Short Round waves his cap, saluting\n       him back.\n\n       Willie stands at the edge of the gorge looking down into the riv-\n       er far below.\n\n                                   WILLIE\n                       I guess Mola Ram got what he\n                       wanted.\n\n                                   INDIANA\n                       Not quite.\n\n       She sees Indy reach into his pocket.  He pulls something out\n       slowly -- as she watches he reveals a crystal stone --\n\n                                   INDIANA (Cont'd)\n                       The last Sankara Stone.\n\n       Short Round watches Willie take it carefully from Indiana.  She\n       gazes at it and looks delighted --\n\n                                   WILLIE\n                       And the diamond hidden inside...\n\n       Willie holds the stone up to the sun and it sparkles and flashes\n\n                                                               CUT TO\n\n174.   EXT.  THE MAYAPORE HILLS - DAY                                 174.\n\n       The sun flares and silhouettes three figures coming over a\n       hilltop.  Behinf them we see more smaller silhouettes appearing\n       over the rise.\n\n       Indiana, Willie and Short Round walk back down the dirt road into\n       Mayapore -- followed by a multitude of children returning to\n       their homeland.\n\n       Willie looks at the changed landscape and seems astonished:  the\n       barren countryside has been reborn.  They see streams flowing\n       beneath green trees, flowers blooming and peasants harvesting\n       golden grain in the fields.\n\n175.   EXT.  MAYAPORE VILLAGE                                         175.\n\n       Indiana, Willie and Short Round lead the children down the\n       village road.   Ahead they see villagers rebuilding their primi-\n       tive dwellings.\n\n       Now they hear shouts of joy from the peasants.  The children\n       returning home start running to meet their parents who are rush-\n       ing out to greet them.\n\n       There is laughter and tears as families are reunited.  Indiana\n       sees the old shaman approaching with the chieftain and the\n       village elders.\n\n       The shaman touches his fingers to his forehead and bows.  The\n       three travelers return his greeting and the shaman is quite moved\n       as he speaks to Indiana --\n\n                                   SHAMAN\n                       We know you are coming back --\n                                (indicating the\n                                 countryside)\n                       -- when life returns to our village.\n\n                                   WILLIE\n                       It's a real miracle.\n\n                                   SHAMAN\n                       Now you see the magic of the\n                       \"rock\" you bring back.\n\n       The old shaman smiles wisely at Indiana.  Indy takes the stone\n       out of his bag and unwraps it.\n\n                                   INDIANA\n                       Yes, I've seen its power\n\n       Willie watches the shaman take it reverently and bow to them.\n       The shaman joins the elders and they walk to the village's small\n       sacred mound.  Indy and Willie stay back.  They see him kneel and\n       replace the stone in its niche.\n\n                                   INDIANA\n                       The last Sankara Stone.\n\n                                   WILLIE\n                       And they don't even know what\n                       it really is.\n\n                                   INDIANA\n                                (smiling at her)\n                       Well, you didn't get your prince,\n                       and there goes your diamond.\n\n                                   WILLIE\n                       You didn't do so well yourself.\n                       Finding that stone could've got-\n                       ten you all the fortune and\n                       glory you were talking about.\n\n                                   INDIANA\n                       It's still a long way to Delhi.\n                       Who knows what might happen.\n\n       She looks at him like he's crazy.\n\n                                   WILLIE\n                       Oh no, I'm finding a native guide\n                       who knows the way.  No more de- \n                       tours for me, thank you Dr. Jones.\n\n       She turns and starts walking away continuing to complain --\n\n                                   WILLIE (Cont'd)\n                       If you think I'm going to Delhi\n                       or anyplace else with you, after\n                       all the trouble you've gotten me\n                       into...\n\n       Suddenly the bullwhip CRACKS and wraps around her waist.  Star-\n       tled Willie looks angry as Indiana reels her in, pulling her to-\n       ward him and into his arms.  But when he finally kisses her, she\n       doesn't seem to mind at all...\n\n       Short Round shakes his head, but looks sort of pleased.  When he\n       turns away, his face lights up!\n\n       Short Round runs toward the sunset, toward the three elephants\n       being brought back to the village.  The baby elephant starts\n       walking faster, as if he recognizes Short Round running out to\n       meet him...\n\n\n\n\n                                   THE END\n\n\t\n\t\t\t\n\n\n\n\nIndiana Jones and the Temple of Doom\nWriters :   George Lucas  Willard Huyck  Gloria Katz\nGenres :   Action  Adventure\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:27:33.235441"}