{"title": "Inventing the Abbotts", "film_link": "/Movie Scripts/Inventing the Abbotts Script.html", "script_link": "/scripts/Inventing-the-Abbotts.html", "info_raw": "\n\nInventing the Abbotts Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Ken Hixon\nGenres  Drama  Romance\nScript Date : March 1996\n\nRead \"Inventing the Abbotts\" Script\n\n\n", "script": "\nINVENTING THE ABBOTTS\n\n           Screenplay by\n\n             Ken Hixon\n\n\n       From the Short Story by\n\n             Sue Miller\n\n\n\n\n        March 21, 1996 DRAFT\n\n\n FOR EDUCATIONAL PURPOSES ONLY\n\n                          INVENTING THE ABBOTTS\n\n\n       FADE IN:\n\n\n1EXT. ABBOTT HOME - STREET (HALEY, ILLINOIS) - DAY                 1\n       (LATE SPRING, 1957)\n\n       OPENING CREDITS ROLL over a TENT MONTAGE -- ASSORTED\n       ANGLES of a group of men hard at work erecting a large\n       striped \"big-top\" style canvas tent, INCLUDING: The long\n       steel stakes being sledge-hammered into the lawn,\n       practiced hands rapidly rigging the lines, the tall\n       center poles being leveraged upright, the heavy rolled-up\n       sections of canvas being maneuvered into position, and\n       ENDING WITH the canvas being hoisted up the poles as the\n       tent assumes its full and finished form.\n\n\nNEW ANGLE - TENT\n\n       -- on the front yard of the Abbott mansion. The\n       residence is on Main Street, four blocks from where the\n       commercial district begins. The mature, over-arching\n       trees makes this street of prosperous houses a grand\n       promenade.\n\n\n2EXT. ABBOTT HOME - STREET - DAY                                   2\n\n       JACEY HOLT and DOUG HOLT walk along the sidewalk on their\n       way to school. Jacey is seventeen; he's as handsome and\n       seemingly self-confident as his younger brother is\n       rumpled and impulsive. Doug is fifteen, a popular\n       culture chameleon who takes on the colors and\n       affectations of whomever his \"hero\" is at the moment\n       (which presently happens to be Elvis Presley).\n\n       Jacey stops and stares with open-faced misery at the tent\n       on the Abbott's front yard (the installation of the tent\n       indicates that the Abbott's are having yet another of the\n       many parties they throw every year).\n\n                                 DOUG\n                   Didn't get invited, huh?\n\n                                 JACEY\n                   Go to hell.\n\n                                DOUG\n                   Who cares? I'm not going and I\n                   got invited.\n\n                                 JACEY\n                   Who invited you?\n\n                                                     (CONTINUED)\n\n         INVENTING THE ABBOTTS - Rev. 2/16/96                     2.\n\n2CONTINUED:                                                                2\n\n                               DOUG\n                 Pam, I guess. I don't know.\n                 Didn't open the envelope. I mean,\n                 come on, every time an Abbott girl\n                 gets her period they have some\n                 party.\n\n                                 JACEY\n                 Oh, shut up.\n\n                               DOUG\n                 Kotex parties, Kotex party hats,\n                 pin the Kotex on the...\n\n                                 JACEY\n                 Shut up!\n\n       Jacey swats Doug's school books out from under his arm --\n       Doug charges his brother to retaliate but they are rudely\n       interrupted by a CAR HORN. They scurry out of the way as\n       LLOYD ABBOTT pulls his 1957 Cadillac out of the driveway\n       and cruises down the street. Lloyd is a well-dressed-\n       and-fed man in his mid-forties. A Midwestern burgher, he\n       exudes the status he enjoys as one of the preeminent\n       pillars of this community. Doug is embarrassed by\n       Lloyd's passing, but Jacey evidently experiences a deeper\n       humiliation -- he gives Doug a glance of betrayal, turns\n       and walks down the block.\n\n\n3      OMITTED                                                         3\n\n\n4INT. HIGH SCHOOL - CORRIDOR - DAY (SHORT TIME LATER)                      4\n\n       ELEANOR ABBOTT gathers some books from her locker.\n       Eleanor is sixteen, outgoing, sarcastic, and very\n       popular. She is the middle of the three Abbott\n       daughters. Eleanor closes her locker, turns and\n       discovers Jacey standing behind her. He follows her down\n       the busy hall.\n\n                               JACEY\n                 I tried to call you last night but\n                 the line was busy.\n\n                                 ELEANOR\n                 No it wasn't.\n\n                                                        (CONTINUED)\n\n         INVENTING THE ABBOTTS - Rev. 3/20/96                    3.\n\n4CONTINUED:                                                               4\n\n                               JACEY\n                 It was busy all night.\n\n                               ELEANOR\n                 Maybe you had the wrong number?\n\n                               JACEY\n                 Are you mad at me?\n\n                                ELEANOR\n                 No.   Are you mad at me?\n\n                                JACEY\n                 No.   Who said I was?\n\n                                  ELEANOR\n                 I did.\n\n                               JACEY\n                 I just wanted to talk to you last\n                 night.\n\n                               ELEANOR\n                 We can talk tonight at the party.\n\n                               JACEY\n                 I wasn't invited.\n\n                                  ELEANOR\n                 Yes, you were.\n\n                                  JACEY\n                 No, I wasn't.\n\n                               ELEANOR\n                 Well, now you are. But if you're\n                 mad at me you don't have to come.\n\n       She gives him a sultry smile, turns and glides into a\n       classroom as the BELL RINGS. The corridor is quickly\n       vacated by all but Jacey -- he savors the aftertaste of\n       Eleanor's smile.\n\n\n5      EXT. HOLT HOME - EVENING (MAGIC HOUR)                          5\n\n       ESTABLISHING ANGLE of the modest two-story clapboard\n       house in a working class neighborhood. A home-made ping-\n       pong table takes up so much room in the detached garage\n       that it forced the eviction of the family car, a 1950\n       Plymouth coupe, which is parked nearby on the driveway.\n       The garage doors are open and the garage light is on.\n\n       We hear (V.O.) DOUG SINGING bits and pieces of\n       \"Heartbreak Hotel\" in his best Elvis fashion.\n\n      INVENTING THE ABBOTTS - Rev. 3/20/96                  3A/4.\n\n6   INT. HOLT HOME - BATHROOM - EVENING (MAGIC HOUR)             6\n\n    Doug stands in front of the bathroom mirror (wearing a\n    coat and tie) still singing \"Heartbreak Hotel\" while he\n    carefully draws sideburns on his face with a wide-nib pen\n    and a bottle of India ink. Jacey's reflection appears in\n    the mirror behind Doug -- he's wearing a coat and tie too.\n    Jacey does a pained take on Doug's handiwork:\n\n                            JACEY\n              Oh, Christ!\n\n7   INT. DINING ROOM - EVENING (MAGIC HOURMINUTES LATER)         7\n\n    HELEN HOLT is seated at the dining table. She was\n    grading a stack of spelling tests with a red pencil when\n    Jacey and Doug came in to ask her to adjudicate the\n    matter at hand. She is an attractive but unostentatious\n    woman without interest in appearing to be anything other\n    than what she is: a forty-one-year-old widow raising two\n    teenage sons on a school teacher's salary. (She teaches\n    second grade at Haley Elementary School.)\n\n                            JACEY\n              He has to wash it off, Mother.\n              You cannot let him go to the party\n              unless he washes it off.\n\n                            DOUG\n              It'll look worse if I wash it.\n              It's India ink, it'll turn gray,\n              it'll look like dirt.\n\n                            JACEY\n              He looks like such a clown and he\n              doesn't even know it! He doesn't\n              get how things work in this town.\n              I thought you weren't even going\n              to the party?\n\n                            DOUG\n              Changed my mind.\n\n                            HELEN\n              Doug, you do understand that you\n              may be the only person at this\n              party with artificial sideburns?\n\n                            DOUG\n              Yeah.\n\n                            HELEN\n              You do understand that your\n              sideburns don't look real?\n\n    Doug was hoping they didn't look that phony, but he\n    conceals his disappointment and nods:\n                                                  (CONTINUED)\n\n         INVENTING THE ABBOTTS - Rev. 2/16/96                    5.\n\n7CONTINUED:                                                           7\n\n                                 DOUG\n                 Yeah.\n\n                               HELEN\n                 That they look, really, as though\n                 you'd drawn them on?\n\n                                DOUG\n                         (swallows, then\n                          shrugs)\n                 Yeah.\n\n       She looks hard at Doug for a beat, then turns to Jacey.\n\n                               HELEN\n                 Well, darling, it seems he does\n                 understand. Why don't you just go\n                 on to the party and ignore Doug.\n                 Just have a good time and pretend\n                 you don't even...\n\n\n       Jacey curses under his breath and storms out the front\n       door before his mother can finish her sermon.\n\n\n8EXT. ABBOTT HOME/TENT - STREET - LATER THAT NIGHT                    8\n\n       The curb is lined with parked cars. We hear a dance band\n       playing \"QUE SERA\" and the sounds of the party as Doug\n       lopes up the sidewalk sporting his India ink sideburns\n       and smoking a cigarette. He flicks the cigarette into\n       the street with well-rehearsed ease as he turns and walks\n       up the long driveway towards the glowing \"big-top\" tent.\n       Doug trails his hand over Lloyd Abbott's Cadillac,\n       caressing it from hood-to-trunk as he ambles by.\n\n\n9INT. ABBOTT HOME/TENT - NIGHT                                        9\n\n       Doug enters the tent and surveys the gathering -- a\n       tuxedoed ten-piece band plays on the bandstand.\n\n       Despite his mother's advice, a nauseated grimace falls\n       over Jacey's face when he sees that his younger brother\n       has arrived. He is dancing with Eleanor.\n\n                                                     (CONTINUED)\n\n                                                                 6.\n\n9CONTINUED:                                                           9\n\n       They dance past a group of young men on the sidelines\n       (Jacey's senior classmates), they are all edgy with envy,\n       waiting like predators for their chance to dance with\n       Eleanor.\n\n                               ELEANOR\n                 I'm going out to the lake\n                 tomorrow. Sandy wants to show-off\n                 her dad's new boat. Why don't you\n                 come?\n\n                               JACEY\n                 I have to work.\n\n                               ELEANOR\n                 Well, I guess you'll just have to\n                 write me a letter.\n\n                               JACEY\n                 What do you mean?\n\n                               ELEANOR\n                 You said you wanted to talk to me\n                 in private.\n\n                               JACEY\n                 I meant... just... we never get a\n                 chance to be together, alone, you\n                 know?\n\n       STEVE (one of the envious classmates) makes his move and\n       cuts in on Jacey and dances away with Eleanor. Jacey\n       handles it with aplomb but his true irritation at being\n       separated from the object of his desire reveals itself as\n       he observes Eleanor flirting with her new dance partner.\n\n\n10       INT. ABBOTT HOME/TENT - BUFFET TABLE - DOUG                  10\n\n       -- sampling the hors d'oeuvres. He places the ones he\n       doesn't like back onto the platter. PAMELA ABBOTT steps\n       over to Doug. She is his age (fifteen), the youngest of\n       the Abbott girls, and the least stuck-up.\n\n                                  PAMELA\n                 Hi.\n\n                 u                DOUG\n                 Hi.\n\n       She points at Doug's chest.\n\n                                  PAMELA\n                 Like your tie.\n\n                                                       (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                   7.\n\n10     CONTINUED:                                                   10\n\n     Doug glances down at his tie and Pam flips her index\n     finger up across the tip of his nose. Doug scowls and\n     points at her bust.\n\n                             DOUG\n               Can I borrow a Kleenex?\n\n                             PAMELA\n               Greaser.\n\n                             DOUG\n                      (mouth full of\n                       food)\n               Got any smokes around here?\n\n\n11   INT. ABBOTT HOME - BACK YARD - NIGHT                          11\n\n     Doug and Pam smoke their cigarettes in the back yard.\n     The tent can be seen in the b.g. The band is playing\n     \"MONA LISA.\"\n\n                             DOUG\n               So, is this Peter guy Alice is\n               gonna marry rich?\n\n                             PAMELA\n               Of course. He's one of the Atlas\n               Steel Vanlaninghams. Pittsburgh.\n               He's a bully.\n\n                             DOUG\n               So how come Alice's marrying him?\n\n                             PAMELA\n               Because my parents want her to and\n               Alice is afraid of my parents.\n               It's practically an arranged\n               marriage. They think Alice has\n               peanut shells for brains or\n               something, so they sort of\n               suggested that maybe it was time\n               to tie the old knot and they sort\n               of suggested that Peter was the\n               one to do it with.\n\n                             DOUG\n               Jeez, no one can be that much of a\n               pushover.\n\n                                                    (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                    8.\n\n11     CONTINUED:                                                   11\n\n                             PAMELA\n               Look, Alice is the good daughter,\n               Eleanor is the bad one, and I'm\n               the one who sort of gets off the\n               hook. That's just the way it\n               works. Which one are you?\n\n                             DOUG\n               You mean, which kind of brother am\n               I? You got me? The little\n               brother, I guess.\n\n\n12     INT. ABBOTT HOME/TENT - NIGHT (SHORT TIME LATER)             12\n\n     The band improvises a FANFARE as Lloyd Abbott and his\n     wife, JOAN ABBOTT, step up onto the bandstand. Joan has\n     the practiced poise of a former beauty queen (as if her\n     smile had been surgically sewn onto her face). She has a\n     tendency to smoke and drink a bit too much and eat and\n     sleep a bit too little.\n\n                             LLOYD\n               Ladies and Gentlemen -- I'd like\n               to propose a toast in honor of our\n               cause for celebration tonight --\n               the engagement of our daughter,\n               Alice, to Mister Peter\n               Vanlaningham.\n\n     He gestures to ALICE ABBOTT and her fiance PETER\n     VANLANINGHAM. Alice is nineteen, the eldest and the\n     prettiest and seemingly most conventional of the three\n     sisters. Peter is the scion of a wealthy Pittsburgh\n     family. He and his bride-to-be smile and acknowledge the\n     applause and AD-LIBBED toasts.\n\n     The band strikes up \"I Got the World on a String\" and\n     Joan whispers something to Alice -- Alice goes over to\n     Lloyd and (despite his mock-protest) pulls him out onto\n     the dance floor.\n\n                                                    (CONTINUED)\n\n                                                                  9.\n\n12       CONTINUED:                                                    12\n\n       The guests applaud their uninspired box-step; neither\n       father nor daughter appear comfortable at such close\n       quarters.\n\n\n13       EXT. ABBOTT HOME - DRIVEWAY & TENT - NIGHT                    13\n\n       The party is going full swing as Doug wanders out of the\n       tent and walks down the driveway. He's had enough of\n       high society for tonight.\n\n\n14       EXT. SIDEWALK (HALEY) - NIGHT                                 14\n\n       Doug strolls along the sidewalk (in a residential\n       neighborhood) softly singing \"You Ain't Nothin' but a\n       Hound Dog.\" He pauses beside a rubbish can on the curb,\n       strikes a wooden match, and sets the trash on fire. As\n       he nonchalantly continues down the sidewalk we see\n       several trash cans on fire in the near distance.\n\n\n15       EXT. ABBOTT HOME - BACK YARD - NIGHT                          15\n\n       Eleanor necks with Steve (Jacey's rival) on the glider in\n       the gazebo in the distant corner of the yard. The sounds\n       of the PARTY can be heard in the b.g. (the band is\n       playing \"In Old Monterey\"). Jacey stands in the shadows\n       of the shrubbery spying on them with pure heartache.\n\n\n16       EXT. STREET (HALEY) - NIGHT (SHORT TIME LATER)                16\n\n       Jacey walks home with his eyes brimming with bitter tears\n       -- past the smoldering rubbish cans along the curb.\n\n\n17       EXT. HOLT HOME - SIDEWALK & GARAGE - NIGHT                    17\n(MINUTES LATER)\n\n       As Jacey turns up the driveway, a light snaps on in the\n       garage. The garage doors are open, Doug sits on the edge\n       of the ping-pong table smoking a cigarette with his hand\n       still on the light fixture pull chain.\n\n                               DOUG\n                 Three out of five?\n\n                               JACEY\n                 Two out of three. You serve.\n\n       Jacey and Doug pick up their paddles and begin a game of\n       ping-pong. They are expert players and fierce\n       competitors.\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                   10.\n\n18     EXT. TEXACO GAS STATION (DOWNTOWN HALEY) - NEXT DAY          18\n\n     Lloyd Abbott pulls his (1957) Cadillac up to the pumps.\n     The DING-DING of the BELL HOSE summons Jacey. He wears a\n     Texaco uniform complete with bow tie and cap.\n\n                              JACEY\n               'Morning.\n\n                              LLOYD\n               Fill 'er up.   Hi-test.\n\n     Jacey sets the pump nozzle on automatic and cleans the\n     windshield. Lloyd slips the ashtray out of the dash,\n     climbs out of the car, and empties the ashtray in the\n     trash can.\n\n                             JACEY\n               That was a nice party last night.\n\n                             LLOYD\n               You were there?\n\n                              JACEY\n               Yes, sir.   Eleanor invited me.\n\n                             LLOYD\n               Did she? Didn't see you.\n                      (slight beat)\n               You going to be an engineer like\n               your dad was?\n\n                             JACEY\n               I want to be an architect.\n\n                             LLOYD\n               Hmmm... I guess some people care\n               more about having ideas that they\n               do about making money.\n\n                             JACEY\n               I care about making money.\n\n     Lloyd idly examines the mechanism on the ashtray that\n     enables it to slide in-and-out of the dash.\n\n                             LLOYD\n               That full suspension file drawer\n               your dad invented is still in\n               production, did you know that?\n               We'll ship thirty-maybe-forty\n               thousand of those file cabinets\n               this year. Hell, that drawer put\n               Midwest Steel Desk on the map.\n\n                              JACEY\n               Yes, sir.   I know.\n                                                   (CONTINUED)\n\n                                                                 11.\n\n18      CONTINUED:                                                     18\n\n                              LLOYD\n                An architect, huh?\n\n      The GAS NOZZLE CLICKS OFF, Jacey hangs up the nozzle, and\n      replaces the gas cap. Lloyd pulls out his wallet.\n\n                              LLOYD\n                You want some free advice?\n\n                               JACEY\n                Sure.\n\n                              LLOYD\n                Don't waste your life making other\n                people rich. Keep the change.\n\n      He hands Jacey a five-spot and gets into his car. Lloyd\n      drives away in his Cadillac. Jacey crumbles the five\n      dollar bill into a ball. As he returns to the office he\n      catches his reflection in the mirror of the cigarette\n      machine. He frowns and pulls off his cap and bow tie.\n\n\nA19     INT. BOATHOUSE (LAKE) - LATER THAT DAY                         A19\n\n      The abandoned boathouse is a dilapidated structure\n      situated on an isolated shore of the large lake. Doug\n      strikes a wooden match, shepherds the flame, leans over,\n      holds the match to his ass and lights a fart. The\n      amorphous blue flame flares and almost instantly\n      disappears as the gas is consumed. VICTOR, Doug's\n      partner in crime and best friend, is impressed. (Victor\n      is fifteen, too.)\n\n                               VICTOR\n                Jeez Louise!   How'd you do that?\n\n                              DOUG\n                Intestinal gas -- produced by\n                bacterial metabolism of food\n                residues in the colon. A mixture\n                of oxygen, hydrogen, carbon\n                dioxide, and methane. That's the\n                secret ingredient.\n\n                              VICTOR\n                What's so secret about it?\n\n                              DOUG\n                Not everyone can produce methane.\n                It's genetic, that means it's\n                inherited. There's a lot of\n                methane in my family.\n\n                                                     (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 2/16/96                    12.\n\nA19     CONTINUED:                                                    A19\n\n                              VICTOR\n                You're full of shit.\n\n                              DOUG\n                Look it up, it's all in the\n                encyclopedia.\n\n                              VICTOR\n                They don't got farts in the\n                encyclopedia.\n\n                              DOUG\n                Hey, they got 'vagina' in the\n                dictionary, they got farts in the\n                encyclopedia.\n\n      The ROAR of a PASSING SPEEDBOAT attracts Doug's interest.\n\n                              VICTOR\n                       (incredulous)\n                Vagina is in the dictionary?\n\n                               DOUG\n                'A canal leading from the uterus\n                to the vulva'.\n\n\n                              VICTOR\n                You sure read a lot, man.\n                       (slight beat)\n                A canal?\n\n\nB19     EXT. BOATHOUSE DOCK (LAKE) - CONTINUOUS ACTION - DAY          B19\n\n      Doug steps out of the boathouse onto the   sagging dock and\n      sees a fast speedboat cutting across the   lake towing a\n      male water skier. (Another young man is    driving the boat\n      with two young women in bathing suits as   passengers.)\n      Victor comes out as the speedboat's wake   rocks the old\n      dock.\n\n                              VICTOR\n                Assholes!\n\n                              DOUG\n                It's Jacey -- that's him skiing.\n                He must've skipped out on work.\n\n\n19      EXT. LAKE - ANGLE ON SPEEDBOAT                                19\n\n      -- with Jacey skiing behind it. STEVE is at the helm.\n      Eleanor and SANDY lounge in their bathing suits.\n\n                                                      (CONTINUED)\n\n                                                               13.\n\n19     CONTINUED:                                                    19\n\n     As they pass a ski ramp Steve points to it. Jacey gives\n     him a thumb's up gesture and Steve circles the boat\n     around for the approach.\n\n                              SANDY\n               No way!   He's never done the ramp.\n\n                             STEVE\n               He wants to do it.\n\n     Steve lines up the approach and pushes the throttle open.\n\n     Jacey swings out on the end of the tow-rope and pops over\n     the wake.\n\n     Eleanor leans over to Steve.\n\n                             ELEANOR\n               You know you're going too fast?\n\n                                STEVE\n                      (grins)\n               Yeah, I know.\n\n     The boat zips by the ramp and Jacey's skis contact the\n     slippery surface and his skis go out from under him. He\n     takes a hard bounce, loses hold of the tow-rope, and goes\n     tumbling over the apex of the ramp into the water.\n\n\n20     INT. HOLT HOME - BATHROOM - THAT NIGHT                        20\n\n     Jacey is soaking in the bathtub.   Doug enters without\n     knocking.\n\n                                DOUG\n               Time to eat.\n\n     Doug washes his hands. Jacey climbs out of the tub and\n     fetches a towel. And Doug reacts to...\n\n                                DOUG\n               Jesus Christ!\n\n     Jacey's back and buttocks are severely bruised. Jacey\n     wraps the towel around his waist and turns to his\n     brother.\n\n                             JACEY\n               Don't tell Mom.\n\n                                DOUG\n               Oh, shit...\n\n                                                     (CONTINUED)\n\n                                                              14.\n\n20     CONTINUED:                                                   20\n\n                             JACEY\n                      (cutting him off)\n               Just don't tell Mom. All right?\n\n                             DOUG\n               Yeah, okay, all right.\n\n     Jacey walks out of the bathroom.\n\n\n21     EXT. TEXACO STATION (DOWNTOWN HALEY) - DAY (SUMMER 1957)     21\n\n     Lloyd Abbott's 1957 Cadillac pulls up to the pumps.\n     Lloyd is behind the wheel, Joan sits next to him, Eleanor\n     and Pamela are in the back seat. The DING-DING of the\n     BELL HOSE summons...\n\n\n22     INT. TEXACO STATION - JACEY                                  22\n\n     -- sticks the mop he's been using into a pail and goes to\n     answer the bell. He hesitates as he sees the Abbotts and\n     lets another attendant wait on them. He retreats into\n     the garage and resumes mopping the floor.\n\n                               ELEANOR (O.S.)\n               Hi.\n\n     Jacey finds Eleanor standing in the garage doorway.\n\n                             ELEANOR\n               Congratulations.\n\n                               JACEY\n               For what?\n\n                             ELEANOR\n               I heard you got accepted to Penn.\n\n                               JACEY\n               Oh.   Yeah.   Thanks.\n\n                             ELEANOR\n               How'd you swing an Ivy League\n               school like that?\n\n                             JACEY\n               My grandfather went there.   I had\n               the grades, so...\n\n                             ELEANOR\n               It stinks in here.\n\n                             JACEY\n               I dropped something.\n                                                    (CONTINUED)\n\n                                                            15.\n\n22     CONTINUED:                                                 22\n\n                             ELEANOR\n               Yeah, me.\n\n                             JACEY\n               I just thought you and Steve...\n\n                             ELEANOR\n               Well, that's what you thought. I\n               think Steve is... I don't even\n               know what I think about Steve, I\n               never think about him. I just do\n               things. And let other people\n               figure them out. That's what\n               parents are for. They're real\n               good at doing all the thinking.\n               Why should I?\n                      (slight beat)\n               Alice is going to have a baby.\n               She and Kilroy didn't waste any\n               time. He's already talking about\n               having another, and Alice is up-\n               chucking every hour on the hour.\n               She's got morning-noon-and-night\n               sickness. I've got the feeling\n               she'll be barefoot and puking for\n               years to come. Wallpaper patterns\n               -- that's all she talks about.\n               She and my mother spend hours\n               looking at wallpaper pattern\n               books. That's another thing I\n               never think about... wallpaper.\n                      (another beat)\n               Well, I think this is called the\n               silent treatment. I get enough of\n               that from my father, I don't need\n               it from you. Good luck at Penn.\n\n     She starts to walk away, but Jacey pulls her back and\n     kisses her fiercely -- Eleanor responds with equal heat.\n     They don't see Pamela enter the garage. Pam studies them\n     for an imperturbable beat, then:\n\n                             PAMELA\n               Come on, Eleanor -- Dad's waiting.\n\n\n23     EXT. TEXACO STATION - DAY (MOMENTS LATER)                  23\n\n     The Abbotts drive away. Jacey stands in the garage in\n     the b.g. He watches the Cadillac disappear into traffic.\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                    16.\n\n24     EXT. DOWNTOWN HALEY - INSIDE CADILLAC                         24\n\n     -- with Lloyd behind the wheel, Joan in the front\n     passenger seat, and Eleanor and Pam in the back seat.\n     Lloyd says to Eleanor:\n\n                               LLOYD\n                 Stay away from him.\n\n                               ELEANOR\n                 Who?\n\n                               LLOYD\n                 Jacey.\n\n                               ELEANOR\n                 Why?\n\n                               LLOYD\n                 Because I said so.\n\n\n25     OMITTED                                                       25\n\n26   EXT. IRON SKILLET RESTAURANT - DAY (TWO WEEKS LATER)          26\n\n     A family-style restaurant in the center of town. It's\n     a sweltering, hot July day. Heat shimmers off the\n     sidewalk.\n\n\n27     INT. IRON SKILLET RESTAURANT - DAY                            27\n\n     The decor is mock-Colonial. Victor and Doug (in their\n     bus boy uniforms) are stocking a waitress station with\n     silverware, coffee cups, and water glasses.\n\n                               VICTOR\n                 We should have a party out at the\n                 boathouse, man. That's what we\n                 should do.\n\n                               DOUG\n                 Sure.\n\n                               VICTOR\n                 You know, invite some girls.\n\n                               DOUG\n                 Right.\n\n                               VICTOR\n                 Get some beer, go swimming. Look\n                 up a few words in the dictionary.\n\n                                                     (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                     17.\n\n27     CONTINUED:                                                     27\n\n                             DOUG\n               Yeah, like 'boring' or 'eunuch.'\n\n                              VICTOR\n               Eunuch?   What's that?\n\n                             DOUG\n               It's Latin for bus boy.\n\n     WEBB CROSBY, the proprietor of the restaurant, steps\n     over.\n\n                             WEBB\n               Business is a little light today,\n               too damn hot. Which one of you\n               knuckle-heads wants to get off\n               early?\n\n                             DOUG & VICTOR\n                      (in unison)\n               Me... I do.\n\n                             WEBB\n                      (takes out a coin)\n               Call it in the air...\n\n\n28     EXT. IRON SKILLET RESTAURANT - DAY (MINUTES LATER)             28\n\n     Doug bicycles away (he won the coin toss).\n\n\n29     INT. HOLT HOME - KITCHEN - DAY (SHORT TIME LATER)              29\n\n     Doug sails through the back door. He gets a bowl out of\n     the cupboard and fetches the ice cream scoop from a\n     drawer.\n\n\n30   INT. HOLT HOME - GARAGE - CONTINUOUS ACTION - DAY            30\n\n     Doug enters with the bowl and ice cream scoop in hand.\n     He lifts the lid of the freezer, reaches for a carton of\n     ice cream and something startles him. He cocks his head\n     to listen and slowly lowers the freezer lid.\n\n     He peers into the silvery, dim light and sees Jacey and\n     Eleanor naked on an old daybed near the coal bin in the\n     back of the garage. She is on top of Jacey, riding him\n     rhythmically. Eleanor is facing Doug. She reacts without\n     alarm or shame when she notices Doug staring at her. She\n     coolly returns his stare. Doug tries, but he's unable to\n     avert his eyes.\n\n                                                   (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                     18.\n\n30     CONTINUED:                                                     30\n\n     Eleanor only shifts her gaze when distracted by her\n     orgasm, which triggers Jacey's -- as she recovers her\n     composure she says:\n\n                               ELEANOR\n                 Hi, Doug.\n\n     Jacey bolts upright, throwing her off of him, and shouts:\n\n                               JACEY\n                 Get out!!!\n\n     Doug drops the bowl and scoop and charges out of the\n     garage.\n\n\n31     EXT. HOLT HOME - STREET - DAY (SECONDS LATER)                  31\n\n     Doug races away from the house on his bicycle -- pumping\n     furiously and sweating profusely.\n\n\n32     EXT. LAKE - DAY (SHORT TIME LATER)                             32\n\n     Doug dives into the lake in his underpants, then\n     surfaces. The water has cooled his body, but not his\n     mind.\n\n\n33     OMITTED                                                        33\n\n\n34     INT. HOLT HOME - JACEY'S BEDROOM - DAY (EARLY FALL 1957)       34\n\n     Helen assists Jacey as he packs his bags in preparation\n     for his departure to college the next day.\n\n                               HELEN\n                 Oh, we forgot an umbrella.\n\n                               JACEY\n                 I'll buy a new one in\n                 Philadelphia.\n\n                               HELEN\n                 And don't forget your sport coat.\n\n                               JACEY\n                 Yeah, I'll go pick it up.\n\n                               HELEN\n                 Take Doug with you.\n\n                               JACEY\n                 I'm just going to the cleaners.\n                                                     (CONTINUED)\n\n                                                                19.\n\n34     CONTINUED:                                                     34\n\n                             HELEN\n               Take him along for the ride.   Go\n               have a root beer at the\n               Dog'n'Suds.\n\n                             JACEY\n               I gotta finish packing.\n\n                             HELEN\n               I'll finish up. Doug's going to\n               miss you.\n\n                             JACEY\n               Baloney.\n\n                             HELEN\n               I think he will.\n\n                             JACEY\n               Not much.\n\n                             HELEN\n               Oh, dammit, Jacey, please -- take\n               your brother with you.\n\n                             JACEY\n               Yes, ma'am.\n\n\n35     EXT. STREETS OF HALEY - DAY (SHORT TIME LATER)                 35\n\n     Jacey (behind the wheel) and Doug drive into town in the\n     Plymouth coupe. After a long silence:\n\n                             JACEY\n               If Mom starts having problems with\n               the car stalling just change the\n               fuel filter. It gets clogged up\n               when she lets the gas tank get too\n               low.\n\n                             DOUG\n               Okay.\n\n                             JACEY\n               And every-once-in-a-while take her\n               to the movies so she doesn't just\n               sit around the house all the time\n               reading.\n\n                             DOUG\n               She likes to read.\n\n                             JACEY\n               She reads too much.\n                                                    (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                    20.\n\n35     CONTINUED:                                                    35\n\n                             DOUG\n               Okay, I'll take her to the movies.\n\n                             JACEY\n                      (slight beat)\n               You want to go have a beer?\n\n                              DOUG\n               Root beer?\n\n                              JACEY\n               No, a beer.\n\n                              DOUG\n               A beer beer?\n\n                              JACEY\n               Yeah.\n\n                             DOUG\n               Where are we gonna get beer?\n\n                             JACEY\n               The bait shop. If you go in alone\n               and nobody else is in the store,\n               Ernie'll sell you a couple of\n               bottles.\n\n\n36   EXT. DIRT ROAD (COUNTRYSIDE) - DAY                           36\n\n     The Plymouth is parked on a dirt lane separating two\n     cornfields. Jacey sits on the fender of the car nursing\n     on a bottle of beer. Doug urinates between two rows of\n     corn.\n\n                             DOUG\n               Remember that time I got my dick\n               caught in my zipper?\n\n     Jacey gives Doug a quizzical look.\n\n                             DOUG\n               You know, when I was in first\n               grade. At school? In the boys'\n               room? Remember I wouldn't let\n               Mrs. Horton help me, so she went\n               and got Mom out of her classroom,\n               but I wouldn't let Mom help me\n               either. I told her to go get you.\n               Remember?\n\n                             JACEY\n               Yeah, I remember.\n\n                                                    (CONTINUED)\n\n                                                               21.\n\n36     CONTINUED:                                                    36\n\n     Doug retrieves his beer from the roof of the car. A\n     semi-trailer drives past with \"Midwest Steel Desk, Inc.\n     -- Haley, Illinois\" painted on its sides.\n\n                             JACEY\n               We should own that company.\n\n                             DOUG\n               What do you mean?\n\n                              JACEY\n               Midwest Steel Desk. Dad's file\n               cabinet drawer. Lloyd Abbott\n               screwed mom out of Dad's patent\n               after he died.\n\n                             DOUG\n               Says who?\n\n                             JACEY\n               It's true.\n\n                             DOUG\n               Mom's not stupid.\n\n                             JACEY\n               I didn't say she was stupid.\n               Lloyd's pretty smooth. That's why\n               he owns the company.\n\n                             DOUG\n               He owns the company 'cause he\n               married the boss's daughter.\n\n                             JACEY\n               He owns the company 'cause that\n               patent saved the company's ass\n               after the war, when all the war\n               contracts dried up.\n\n                             DOUG\n               Well, maybe Mom sold it 'cause we\n               needed the money.\n\n                            JACEY\n               What money? We never had any\n               money. Money had nothing to do\n               with it.\n\n                             DOUG\n               Then why did she sell the patent?\n\n                                                   (CONTINUED)\n\n                                                              22.\n\n36     CONTINUED:   (2)                                             36\n\n                             JACEY\n               She just did, that's all that\n               matters. And that's why we're\n               driving this car and not that one.\n\n     Jacey gestures to '57 Thunderbird convertible speeding\n     past them. He finishes off his beer, then:\n\n                             JACEY\n               I guess you'll just have to be\n               real careful zipping up your pants\n               while I'm gone.\n\n                             DOUG\n               Yeah.\n\n\n37     EXT. BUS DEPOT (DOWNTOWN HALEY) - NEXT DAY                   37\n\n     Helen stands on the curb waving good-bye as the Greyhound\n     bus carrying Jacey away to Philadelphia departs. Doug\n     hangs back, leaning against the Plymouth's fender.\n\n\n38     INT. HIGH SCHOOL - LIBRARY - DAY (SPRING, 1958)              38\n\n     Doug steals lustful looks at Eleanor from behind his\n     book. She is seated across the table from him. The\n     library is filled with students poring over their\n     assignments. Eleanor is seemingly oblivious to Doug's\n     probing eyes.\n\n     Doug allows his pencil to roll off the edge of the table.\n     He ducks under the table to retrieve his pencil and his\n     ruse is revealed as he stares up Eleanor's skirt at the\n     soft triangle that her white panties cover between her\n     parted legs. Eleanor's hand lowers a piece of notebook\n     paper beneath the table, on it she has written: \"Hi\n     Doug!\"\n\n     Doug starts with panic, rears back, cracks his head on\n     the bottom of the table, and then, as his head rebounds\n     from the blow, he accidentally impales himself in his\n     chin with the sharp pencil. Doug scrambles up from under\n     the table with the pencil dangling from his chin,\n     knocking over his chair in the process. The tranquility\n     of the library is destroyed by the flabbergasted\n     reactions of the students. Eleanor is momentarily\n     concerned about his welfare, but she cannot help but\n     laugh, too.\n\n                                                               23.\n\n39     EXT. STREETS OF HALEY - LATER THAT DAY                        39\n\n     Doug morosely slouches along the sidewalk on his way home\n     from school. He sports a Band-aid on his chin. Pamela\n     Abbott pulls up alongside Doug and tails him in her 1958\n     Dodge Custom Royal Lancer convertible (with the top\n     down).\n\n                             PAMELA\n               How's your chin?\n\n                                DOUG\n               Drop dead.\n\n                             PAMELA\n               You want a ride?\n\n                                DOUG\n               Nope.\n\n                                PAMELA\n               You can drive.\n\n                             DOUG\n               I don't have my license yet.\n\n                                PAMELA\n               I don't care.\n\n\n40     EXT. ROAD - COUNTRYSIDE - DAY                                 40\n\n     The convertible speeds along the two-lane blacktop with\n     Doug behind the wheel and Pamela sitting next to him.\n\n                             PAMELA\n               How come you never ask me out?\n\n                                DOUG\n               What for?\n\n                             PAMELA\n               For like a date, block-head.\n\n                             DOUG\n               I see you all the time.\n\n                             PAMELA\n               I don't mean hanging out.\n\n                                DOUG\n               Come on.\n\n                             PAMELA\n               You scared of me or something?\n\n                                                   (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                     24.\n\n40     CONTINUED:                                                     40\n\n                             DOUG\n               Hell, no. I gotta job, I got\n               school, I don't have time for\n               dates and all that stuff.\n\n                             PAMELA\n               Then forget it.\n\n                             DOUG\n               It's not like we're... you know...\n               like I'm your boyfriend or...\n\n                             PAMELA\n                      (cutting him off)\n               I said forget it, so forget it.\n\n\n41   INT. HOLT HOME - GARAGE - LATER THAT NIGHT                   41\n\n     Doug sits on the ping pong table gazing at the daybed as\n     he smokes a cigarette. His reverie is broken by Helen's\n     voice calling him:\n\n                              HELEN (V.O.)\n               Doug?   Dinner...!\n\n\n42     INT. HOLT HOME - DINING ROOM - NIGHT                           42\n\n     Helen and Doug are at the dinner table.\n\n                             HELEN\n               I wish you wouldn't smoke in the\n               garage, darling.\n\n                             DOUG\n               I don't smoke in the garage.\n\n                              HELEN\n               There's lots of old stuff out\n               there, I don't want anything to\n               catch on fire.\n\n                             DOUG\n               I don't smoke, Mom.\n\n                             HELEN\n               Well, just the same, I'd prefer it\n               if you'd smoke in the backyard.\n\n                             DOUG\n               Yes, ma'am.\n                      (slight beat)\n               I gotta go, gonna be late.\n\n                                                    (CONTINUED)\n\n                                                              25.\n\n42     CONTINUED:                                                   42\n\n                              HELEN\n               Late where?\n\n     He rises from the table and fidgets with his napkin.\n\n                             DOUG\n               I... have a date, kind of.    It's\n               Friday night, you know?\n\n                              HELEN\n               Yes, I know.   Well, have fun.\n\n                              DOUG\n               You too.\n\n     Doug walks out of the dining room.\n\n\n43     EXT. ABBOTT HOUSE - FRONT DOOR - NIGHT                       43\n\n     Doug waits nervously for the doorbell to be answered.\n     He's wearing a jacket and tie. Pamela opens the door and\n     reacts with surprise.\n\n                              DOUG\n               Hi.\n\n                             PAMELA\n               Jesus... what do you want?\n\n                             DOUG\n               What are you doing tonight?   You\n               want to go out?\n\n                             PAMELA\n               I don't believe you. You're\n               crazy. I'm baby-sitting. My\n               folks went out to dinner with\n               Peter and Alice and I got tricked\n               into watching the baby.\n\n                              DOUG\n               Oh.   Where's Eleanor?\n\n                             PAMELA\n               I thought you came over to ask me\n               out?\n\n                              DOUG\n               I did.\n\n                             PAMELA\n               Good, 'cause Eleanor isn't here.\n\n                                                    (CONTINUED)\n\n     INVENTING THE ABBOTTS - Rev. 2/16/96                   26.\n\n43     CONTINUED:                                                 43\n\n                                DOUG\n               Can I come in?\n\n                                PAMELA\n               No.\n\n                                DOUG\n               Why not?\n\n                             PAMELA\n               Because, you know, my parents\n               aren't here.\n\n                             DOUG\n               Well... maybe some other time...\n\n     Alice's BABY starts CRYING O.S. and Pamela grimaces.\n\n                             PAMELA\n               Oh, hell. Okay, but just for a\n               little while.\n\n\n44     INT. ABBOTT HOME - DEN - NIGHT (SHORT TIME LATER)          44\n\n     An episode of \"Death Valley Days\" with commercials for 29\n     Mule Team Borax AIRS on the deluxe console TV. Doug sits\n     on the sofa smoking a cigarette. Pamela sits at the\n     opposite end of the sofa.\n\n                             PAMELA\n               You're not like Jacey.\n\n                                DOUG\n               Why not?\n\n                             PAMELA\n               He's so... so trig and polished.\n\n                             DOUG\n               What's 'trig' mean?\n\n                             PAMELA\n               You know... handsome, sexy,\n               sophisticated. Pipe-smokers.\n\n                            DOUG\n               Oh. I don't think Jacey smokes a\n               pipe.\n\n                             PAMELA\n               Well, you don't have to smoke a\n               pipe to be trig.\n\n                                                   (CONTINUED)\n\n     INVENTING THE ABBOTTS - Rev. 2/16/96                  26A.\n\n44   CONTINUED:                                                   44\n\n                            DOUG\n             Oh.\n\n                           PAMELA\n             You think I'm... different than\n             Eleanor?\n\n                            DOUG\n             Sure.\n\n                            PAMELA\n             Like... how?\n\n                           DOUG\n             Like... you're smarter.\n\n                           PAMELA\n             Yeah, real smart, that's why I'm\n             baby-sitting and she's out having\n             fun.\n                    (slight beat)\n             Eleanor's smart.\n\n                           DOUG\n             So how come she flunked biology?\n\n                                                 (CONTINUED)\n\n                                                              27.\n\n44     CONTINUED:                                                   44\n\n                             PAMELA\n               Well, you're no Albert Einstein.\n\n                             DOUG\n               I got a three-point-two average.\n\n                             PAMELA\n               Doesn't mean you know my sister.\n\n                              DOUG\n               Oh yeah?   You might be surprised.\n\n                              PAMELA\n               About what?   What? What?\n\n                             DOUG\n               Why are we talking about Eleanor?\n\n                             PAMELA\n               I didn't bring her up.\n\n                             DOUG\n               Look, either you're mad at me\n               'cause you're mad at me -- or\n               you're mad at me 'cause you like\n               me. 'Cause that's how girls act.\n               I don't know much, but I know\n               that. So like which is it?\n\n                              PAMELA\n               Both.\n\n     Doug exhales with bewilderment, stubs out his cigarette,\n     then awkwardly slides down the sofa to Pamela. She holds\n     perfectly still as Doug slowly moves his mouth to hers\n     and kisses her. Then he concludes the kiss to check her\n     reaction; she timidly smiles. He kisses her again with\n     greater fervor. Doug creeps his hand up her blouse and\n     massages her breast. Pamela struggles to suppress her\n     surprise, which he mistakes as a sign of her approval.\n     Emboldened by her lack of resistance, he slips his hand\n     under her bra. Pam is shocked by the pleasure of the\n     sensation, then alarmed by the pace of their passion.\n\n                              PAMELA\n               Doug...\n\n     Doug kisses her again and as they kiss he stares at a\n     framed photograph of Eleanor amongst an assortment of\n     family photos on the long table behind the sofa. It is\n     Eleanor that he is thinking of -- in his mind's eye it is\n     Eleanor's breast that he is fondling. Pamela pulls her\n     lips from his:\n\n                                                    (CONTINUED)\n\n                                                                      28.\n\n44         CONTINUED:   (2)                                                 44\n\n                                 PAMELA\n                   Do you love me, Doug?   Do you?\n\n         He kisses her with such ardor that she   interprets his\n         answer to be yes, when in reality Doug   is only trying to\n         silence her. He pulls his hand out of    her blouse and\n         slips it under her skirt. Pam lurches    back into the\n         sofa:\n\n                                 PAMELA\n                   Jesus...\n\n         He tries to kiss her again but she twists her head away.\n\n                                 PAMELA\n                   Stop it... stop it!\n\n         She shoves him away and jumps off the sofa. Doug looks\n         at her with breathless confusion. She turns away from\n         him and tries to button her blouse, but she can't see the\n         buttons for her tears. She begins to sob and runs out of\n         the room.\n\n\n45         INT. ABBOTT HOME - ENTRY HALL AND STAIRCASE - CONTINUOUS         45\nACTION\n\n         Pamela dashes up the stairs. Doug comes out of the den\n         looking for her. He is quite shaken:\n\n                                 DOUG\n                   Pam?  Hey...\n                          (under his breath)\n                   Oh, dammit...\n\n         He slowly mounts the stairs, wary of invading Pamela's\n         privacy anymore than he already has.\n\n                                 DOUG\n                   Pam?\n\n\n46         INT. ABBOTT HOME - SECOND-FLOOR HALLWAY - CONTINUOUS             46\nACTION\n\n         Doug finds Pamela weeping in the dark hallway, still\n         fastening the buttons on her blouse.\n\n                                 DOUG\n                   I'm sorry... I'm really sorry...\n\n                                 PAMELA\n                   I'm not Eleanor... I can't go so\n                   fast.\n\n                                                         (CONTINUED)\n\n                                                                    29.\n\n46         CONTINUED:                                                     46\n\n         They are both seized with fright as they hear the front\n         DOOR OPEN below and Peter's angry voice:\n\n                                 PETER (O.S.)\n                   Every time we go out you have to\n                   tell that same goddamn story!\n\n         Pam pushes Doug down the hall away from the front stairs\n         and whispers urgently:\n\n                                 PAMELA\n                   Get out of here! Get out!\n\n\n47         INT. ABBOTT HOME - ENTRY HALL AND STAIRS - CONTINUOUS          47\nACTION\n\n         Peter and Alice are taking off their coats.\n\n                                 ALICE\n                   Accidentally brushing your teeth\n                   with Brylcreme is a funny story.\n\n                                 PETER\n                   Will you shut up about the fucking\n                   Brylcreme!\n\n                                 ALICE\n                   It comes in a red-and-white tube\n                   just like a tube of Pepsodent.\n\n                                 PETER\n                   Do you hear me, Alice?!   Shut up!\n\n         Their BABY begins to CRY (O.S.) and they find Pamela\n         standing at the top of the stairs.\n\n                                 PAMELA\n                   The baby's crying.\n\n\n48       INT. ABBOTT HOME - BACK STAIRWAY AND KITCHEN - NIGHT             48\n(MOMENTS LATER)\n\n         Doug sneaks down the back stairs and enters the kitchen\n         as Lloyd and Joan enter from the garage pulling off their\n         coats. Doug ducks back into the stair landing unseen.\n\n                                 LLOYD\n                   Just stay out of it, Joan.\n\n                                 JOAN\n                   Alice meant no harm, I think...\n\n                                                        (CONTINUED)\n\n                                                                30.\n\n48     CONTINUED:                                                     48\n\n                             LLOYD\n                      (cutting her off)\n               It doesn't matter what you think,\n               it's their business. Alice is a\n               spoiled brat, but she's Peter's\n               problem now. So just take one of\n               your pills and go watch Jack Paar,\n               see what he's crying about\n               tonight.\n\n\n49     INT. ABBOTT HOME - SECOND FLOOR HALLWAY - NIGHT                49\n\n     Doug sticks his head out of the back stairwell and spots\n     Peter pounding on a locked bedroom door.\n\n                             PETER\n               I'm warning you, Alice! Open the\n               damn door! Alice?! Dammit!\n\n\n50     INT. ABBOTT HOME - STAIRWELL - DOUG                            50\n\n     Trapped in the stairwell.   He hisses under his breath:\n\n                              DOUG\n               Oh, shit!   Let me out of here...\n\n     He notices a small window in the stairwell.\n\n\n51     EXT. ABBOTT HOME - WINDOW - NIGHT                              51\n\n     Doug squeezes out of the small window, his legs dangling\n     six feet above a large rose bush directly under him.\n\n\n52     INT. HIGH SCHOOL - CORRIDOR - DAYS LATER                       52\n\n     Doug makes his way along the crowded corridor showing a\n     few of his wounds from his emergency landing in the rose\n     bush. He slows as he nears Pamela at her locker. She's\n     aware of him, but pretends that she isn't. Doug\n     hesitates as if he might say something to her, but loses\n     his nerve and continues to mope along the hallway. Pam's\n     disappointment is plain to see.\n\n     Doug doesn't notice Eleanor and a few of her girl friends\n     approaching in the opposite direction. As they pass him\n     Eleanor smiles brightly and says:\n\n                              ELEANOR\n               Hi, Doug!\n\n                                                    (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                      31.\n\n52     CONTINUED:                                                      52\n\n     The girls giggle, \"Hi, Doug!\" has become a running\n     punchline to them. Doug is so undone by their laughter\n     that he walks into an open door.\n\n\n53     EXT. BUS DEPOT (DOWNTOWN HALEY) - DAY (SUMMER, 1958)            53\n\n     Jacey collects his suitcase from the bus driver. He's\n     become very much the Ivy League man. Doug waits for him\n     beside the Plymouth across the street. As Jacey starts\n     across the street a CAR full of young women, including\n     Eleanor and Sandy, HONKS, and stops beside him. Jacey\n     hops into the car and calls out to Doug:\n\n                              JACEY\n               Hey, Doug!   Get my suitcase!\n\n     The car pulls away and Doug irritably fetches Jacey's\n     bag.\n\n\n54     EXT. HOLT HOME - DRIVEWAY - DAY                                 54\n\n     The hood on the Plymouth is propped open.    Doug assists\n     Jacey as he replaces the fuel filter.\n\n                             DOUG\n               How do you know when a girl's...\n               ready?\n\n                             JACEY\n               What do you mean, `ready'?     Ready\n               for what... sex?\n\n                              DOUG\n               Yeah.\n\n                             JACEY\n               They're all ready for sex.\n\n                              DOUG\n               They are?\n\n                             JACEY\n               They might not be willing but\n               they're ready. Just have to make\n               them think you're the only one\n               around who has what they need.\n\n                             DOUG\n               How do you do that?\n\n                                                      (CONTINUED)\n\n                                                               32.\n\n54     CONTINUED:                                                    54\n\n                             JACEY\n               Find out what's making them itch\n               and scratch it. If they're\n               scared, be dependable. If they're\n               bored, be exciting. If they're on\n               the rebound, catch them.\n\n                             DOUG\n               What if you're not very dependable\n               or exciting, you know?\n\n                             JACEY\n               Pretend you are.\n\n                             DOUG\n               You mean, it's all just fake?\n\n                             JACEY\n               The sex is real. They pretend\n               they don't want it. You pretend\n               that you care. Everybody gets\n               what they want.\n\n                              DOUG\n               But what if you really feel\n               something for someone? Really\n               care for them?\n\n                             JACEY\n               I thought you were talking about\n               getting laid?\n\n                              DOUG\n               I guess. I don't know what I'm\n               talking about.\n\n                             JACEY\n               No shit.\n\n\n55     EXT. MOVIE THEATER (DOWNTOWN HALEY) - NIGHT                   55\n\n     The marquee reads: TONY CURTIS -- JANET LEIGH -- \"THE\n     PERFECT FURLOUGH\" -- CINEMASCOPE -- AIR-CONDITIONED.\n\n     It's Friday night -- a long queue has formed at the box\n     office window, mostly teenagers, but some adults, too.\n     Jacey cruises past the theater in the Plymouth, looking\n     for... Eleanor. She chats with a group of friends\n     standing in line. She sees Jacey, skips over, and gets\n     into the car.\n\n                                                               33.\n\n56     EXT. TEXACO GAS STATION (DOWNTOWN HALEY) - NIGHT              56\n\n     Lloyd Abbott opens a bottle of Coke that he just\n     purchased from the vending machine. His (1958) Cadillac\n     is being fueled at the gas pumps. As he returns to his\n     car he sees Eleanor and Jacey drive by the station in the\n     Plymouth.\n\n\n57     EXT. RIVER POINT PARK - WOODS (HALEY) - NIGHT                 57\n\n     Jacey and Eleanor are copulating on a blanket beneath a\n     canopy of tall trees near the river. Jacey is on top,\n     Eleanor has her legs clenched around his hips.\n\n                             ELEANOR\n               Come on, come on, come on...\n\n     Her encouragement inspires their mutual orgasms.\n\n\n58     EXT. RIVER POINT PARK - ROAD - LATER THAT NIGHT               58\n\n     Jacey and Eleanor approach the parked Plymouth. Jacey\n     has the blanket rolled up under his arm. Suddenly they\n     are captured by a pair of headlights. Lloyd Abbott\n     climbs out of his parked (1958) Cadillac.\n\n                                ELEANOR\n               Hi, Daddy.\n\n                             LLOYD\n               What are you doing out here?\n\n                                ELEANOR\n               Fucking Jacey.\n\n     Lloyd absorbs this information without surrendering his\n     composure -- but Jacey cannot conceal his shock.\n\n                             LLOYD\n               Get in the car.\n\n                                ELEANOR\n                         (to Jacey)\n               'Night.\n\n     Jacey doesn't respond to the kiss Eleanor gives him, but\n     when she places her hand on his crotch, he yanks her hand\n     off. Eleanor walks over and gets into the car. Lloyd\n     gazes at Jacey for a beat, then gets in the car and\n     drives away.\n\n        INVENTING THE ABBOTTS - Rev. 2/16/96                  34.\n\n59      INT. HOLT HOME - DINING ROOM - NEXT AFTERNOON               59\n\n      Doug is at the table doing homework. The DOORBELL RINGS.\n      Doug starts to get up as Helen comes out of the kitchen.\n\n                                HELEN\n                I'll get it.\n\n\n60      INT./EXT. HOLT FRONT DOOR/FRONT YARD - CONTINUOUS ACTION - 60\nDAY\n\n      Helen opens the screen door and finds a well-dressed\n      woman standing in the yard with her face turned away.\n\n                                HELEN\n                Hello?\n\n      The woman turns -- it is Joan Abbott. Helen is\n      momentarily caught off balance by Joan's bristling\n      presence.\n\n                                HELEN\n                Joan.    How are you?\n\n                              JOAN\n                May I have a word with you, Helen?\n\n                              HELEN\n                Of course, come in.\n\n                              JOAN\n                No... no, I don't have time...\n                thank you.\n\n\n61      INT. HOLT DINING ROOM AND FRONT DOOR - CONTINUOUS ACTION    61\n\n      Doug spies on Joan and Helen and their curious exchange\n      through a dining room window. Unable to hear their words\n      he can only witness how their words are spoken.\n\n\n62    EXT. HOLT HOME - DOUG'S POV                                  62\n\n      Helen steps off the porch and approaches Joan, who is\n      doing most of the talking -- but Joan seems to require a\n      certain distance from Helen and works her way to her\n      Chrysler Town & Country station wagon parked at the curb.\n      Joan grows more and more agitated as she talks.\n\n\n63      INT. HOLT HOME - ENTRYWAY                                   63\n\n      Eager to hear what is being said, Doug dashes through the\n      living room to the front door.\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                     35.\n\n64     EXT. STREET - HOLT HOME - DAY                                  64\n\n     Joan has the driver's door to her station wagon open now.\n     Helen is on the sidewalk. Her demeanor is measured,\n     purposefully matter-of-fact.\n\n                             HELEN\n               I don't think that's necessary.\n\n                             JOAN\n               Well, if I were you I would talk\n               to him and tell him...\n\n                             HELEN\n                      (cutting her off)\n               No, I'm sorry, Joan, I will not do\n               that. If you have something to\n               say to my son, then you'll have to\n               say it to him yourself.\n\n                             JOAN\n               I just thought you would like to\n               know what he's done.\n\n                             HELEN\n               And why on earth should I believe\n               anything you say, Joan?\n\n     Joan is unable to find a quick retort, she gets into her\n     station wagon and drives away.\n\n     Helen notices a baseball lying in the gutter, she picks\n     it up and cleans it off with her apron. As she turns to\n     go back to the house, she finds Doug standing on the\n     porch steps. Without warning, she expertly pitches the\n     baseball across the yard to Doug -- it makes his hand\n     sting when he catches it. Helen walks up to the porch.\n\n                             HELEN\n               I'm going to ask you one question,\n               Doug, and if you have no idea, or\n               don't want to answer, just tell\n               me.\n\n                             DOUG\n               Okay.\n\n                             HELEN\n               Is there any sense, you think, in\n               which Jacey has... oh, I don't\n               know, it sounds ridiculous...\n               corrupted Eleanor Abbott? Led her\n               astray?\n\n     Doug's mind works in several directions at once as he\n     tries to figure out how much he should or could tell her.\n\n                                                    (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                     36.\n\n64     CONTINUED:                                                     64\n\n                             DOUG\n               Well... jeez... I know that\n               he's... that he's slept with her.\n               But not because he's talked about\n               it. I mean... Eleanor has lots of\n               boyfriends. I think Jacey likes\n               her more than she likes him.\n\n                               HELEN\n                        (long beat)\n               I see.\n                      (another beat)\n               Go finish your homework.\n\n     Doug lobs the baseball back to her and goes inside.\n     Helen sits on the porch steps and now the true toll that\n     Joan's visit has taken on Helen becomes apparent -- a\n     bone-weary sadness falls over her. Her \"tranquility\" is\n     not borne of happiness, it is only a means of coping with\n     the sadness that is at the core of her being.\n\n\n65   EXT. COUNTRYSIDE - ROAD - DAY (ONE WEEK LATER)                 65\n\n     A drab, four-door Chevrolet sedan with Wisconsin license\n     plates speeds away from town.\n\n     Incongruously, the unassuming vehicle is chauffeured by\n     an African-American DRIVER. There are two passengers in\n     the back seat: a conservatively-dressed, middle-aged\n     WOMAN and Eleanor Abbott. There is nothing telling about\n     Eleanor's countenance, neither happiness nor sadness can\n     be found on her face.\n\n\n66     EXT. ABBOTT HOME - STREET - DAY (WEEKS LATER)                  66\n\n     Doug walks home from summer school. He pauses to watch\n     the workmen erecting the party tent in the Abbott's front\n     yard.\n\n                             PAMELA (O.S.)\n               How come you're going to summer\n               school?\n\n     Doug turns to find Pam at the driveway gate.\n\n                             DOUG\n               I got an incomplete in U.S.\n               History.\n\n                             PAMELA\n               How did you manage to do that?\n\n                                                      (CONTINUED)\n\n                                                              37.\n\n66     CONTINUED:                                                   66\n\n                             DOUG\n               Mrs. Bates caught me drawing boobs\n               on a picture of Mamie Eisenhower.\n\n                             PAMELA\n                      (laughs)\n               Why do you do things like that?\n\n                             DOUG\n               I wish I knew. I just can't seem\n               to help it sometimes.\n\n                             PAMELA\n               Are you coming to the party?\n\n     Doug shakes his head no.\n\n                             PAMELA\n               It's my birthday, you know?\n\n                             DOUG\n               Happy birthday.\n\n                             PAMELA\n               Everybody's going to be here.\n\n                                DOUG\n               I don't know.     Maybe.\n\n                             PAMELA\n               Just come, okay? Please.\n\n\n67     EXT. TEXACO STATION (DOWNTOWN HALEY) - THAT NIGHT            67\n\n     Doug pulls the Plymouth up to the pumps. He's neatly\n     dressed in a jacket and tie. Jacey comes out of the\n     office and leans in the car window.\n\n                                DOUG\n               Fill 'er up.\n\n                             JACEY\n                      (frowns)\n               Nice tie.\n\n                             DOUG\n               Oh -- mind if I borrow it?\n\n     Jacey puts the nozzle in the car as Doug climbs out.\n\n                             JACEY\n               I thought you didn't like those\n               parties at the Abbott's?\n\n                                                    (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                   38.\n\n67     CONTINUED:                                                   67\n\n                                DOUG\n               I don't.\n\n                             JACEY\n               Then why are you going?\n\n                             DOUG\n               Just doing someone a favor.    How\n               come you're not going?\n\n                             JACEY\n               I'm persona non grata.\n\n                             DOUG\n               What's that mean?\n\n                             JACEY\n               You know what it means.\n\n                             DOUG\n               What happened with you and\n               Eleanor?\n\n                             JACEY\n               Nothing. I just outlived my\n               usefulness, that's all.\n\n                             DOUG\n               How were you `useful' to her?\n\n                             JACEY\n               Christ, use your imagination.\n\n     Doug has no reply to that.\n\n                             JACEY\n               Eleanor was just looking for a way\n               out. A way out of the whole\n               Abbott world. And it turns out\n               that it takes a lot to get away.\n               It's not enough that you sleep\n               around with boys from your world,\n               you have to fuck boys from the\n               wrong side of the tracks.\n\n                              DOUG\n               What do you mean? Like guys from\n               Fountain Park?\n\n                                JACEY\n               No, I mean me.     She was fucking\n               me.\n\n                                                    (CONTINUED)\n\n                                                               39.\n\n67       CONTINUED:   (2)                                            67\n\n                               DOUG\n                 We're not from the wrong side of\n                 the tracks.\n\n       Jacey hangs up the nozzle and screws the gas cap back on.\n\n                               JACEY\n                 I wouldn't go to that party if I\n                 were you.\n\n                               DOUG\n                 Well, you're not me. We're just\n                 as good as the Abbotts.\n\n       Doug hands Jacey a few dollars.   Jacey heads for the\n       office.\n\n                               JACEY\n                 You still don't know, do you?\n\n                               DOUG\n                 Know what?\n\n\n68       INT. TEXACO STATION (DOWNTOWN HALEY) - OFFICE -             68\nCONTINUOUS ACTION\n\n       Doug follows Jacey inside as he rings up the sale.\n\n                               DOUG\n                 Know what?\n\n                               JACEY\n                 After Dad died... Mom... had an\n                 affair with Lloyd Abbott. That's\n                 how he got Dad's patent away from\n                 her.\n\n                               DOUG\n                 I don't believe you.\n\n                               JACEY\n                 Believe it or not. I don't care.\n\n                               DOUG\n                 You're full of shit.\n\n                               JACEY\n                 Then why don't you go ask Mom?\n                 Ask her what happened -- ask her\n                 why she doesn't have any friends\n                 -- ask her why she's never invited\n                 to the Abbott's -- ask her which\n                 side of the tracks we live on?\n\n       Jacey shoves the cash register drawer shut.\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                   40.\n\n69     INT. ABBOTT HOME - TENT - NIGHT                              69\n\n     The party is well underway, it's a younger crowd tonight.\n     The band plays \"Fly Me To The Moon.\" Doug stands apart\n     from the others. He's ill-at-ease. His conversation\n     with Jacey resonates within him. As he looks over the\n     gathering, he's pained to discover how easy it is to see\n     things the way Jacey does: Lloyd holding court with a\n     group of men in tuxedos... Joan Abbott propelling a\n     reluctant Alice towards a group of guests Alice's age\n     (Alice and Peter have separated)... and, finally, Pamela\n     dancing with a handsome young man (TED). She is the\n     belle of the ball, radiant and suddenly mature in her\n     beautiful gown. She smiles as she sees Doug, excuses\n     herself, and comes over to him.\n\n                             PAMELA\n               How long have you been here?\n\n                               DOUG\n               A while.\n\n                               PAMELA\n               Are you okay?\n\n                               DOUG\n               I'm fine.    Having fun?\n\n                               PAMELA\n               Yes, I am.    Come on, dance with\n               me.\n\n     She pulls him towards the dance floor.\n\n                             DOUG\n               You didn't tell me I had to dance.\n\n                             PAMELA\n               Just one dance and we'll be even.\n               I won't have to be mad at you\n               anymore and you won't have to be\n               so sorry.\n\n                             DOUG\n               What am I supposed to be so sorry\n               about?\n\n                             PAMELA\n               Oh, you're not sorry?\n\n                             DOUG\n               All right, yeah, I'm sorry.\n\n                             PAMELA\n               Sorry about what?\n\n                                                    (CONTINUED)\n\n                                                               41.\n\n69     CONTINUED:                                                    69\n\n                             DOUG\n               You always do this to me.\n\n                             PAMELA\n               You said you weren't sorry and now\n               you say you are. So maybe I'm not\n               sure what you're sorry about?\n\n                             DOUG\n               I'm sorry for what I'm supposed to\n               be sorry about. Okay?\n\n                             PAMELA\n               You're sorry for feeling me up?\n\n                             DOUG\n                      (embarrassed)\n               Oh, shit, come on, Pam. Dammit.\n               For crying out loud. Forget it.\n\n                             PAMELA\n               I accept your apology.   Let's\n               dance.\n\n     Doug allows Pam to pull him out onto the dance floor. He\n     feels like a dolt, but she arranges his hands on her and\n     they begin to dance. She gazes into his eyes and smiles:\n\n                             PAMELA\n               Hi.\n\n                             DOUG\n               Hi.\n\n     Pam is in love with Doug, she has been since they were\n     children. Doug is mellowed by his tender feelings for\n     her. For a golden minute they are in pleasurable bubble\n     of true affinity. But their bubble begins to deflate as\n     Doug sees Joan Abbott staring at them. Her disapproval\n     is unmistakable. Doug steers Pam around the dance floor\n     to avoid Joan's eyes, but then he sees Lloyd Abbott.\n     Lloyd's stare is even more discomforting. Pamela senses\n     the change in Doug's mood, but she is unaware of the\n     cause.\n\n                             PAMELA\n               Is Jacey home for the summer or is\n               he just here for a visit?\n\n     The mention of his brother's name at this exact moment\n     sends a chill down Doug's spine.\n\n                                                    (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                   42.\n\n69     CONTINUED:    (2)                                            69\n\n                             DOUG\n               Home for the summer.\n                      (slight beat)\n               It's cheaper if he stays here for\n               the summer. He can save more\n               money for school, 'cause he\n               doesn't have to pay rent. Money's\n               tight, you know, we're sort of\n               poor.\n\n                             PAMELA\n               You're not poor, are you?\n\n                             DOUG\n               Hell -- you kidding? Even with\n               Jacey working summers, my mom had\n               to borrow against the house so he\n               could go to Penn. I don't know\n               where the money'll come from for\n               me to go to college.\n\n     Doug sees Joan Abbott prompting Ted to cut in on his\n     dance with Pamela. Doug's bitterness swells.\n\n                             DOUG\n               I hear Alice and Peter are getting\n               a divorce.\n\n                             PAMELA\n               They're just separated.\n\n                             DOUG\n               What's the difference?\n\n                             PAMELA\n               I don't know, you'll have to ask\n               them.\n\n                             DOUG\n               So, where's Eleanor tonight?\n\n                             PAMELA\n               Eleanor's... just not here.\n\n                             DOUG\n               Is she pregnant?\n\n                               PAMELA\n               No!    Who said that?\n\n                                                    (CONTINUED)\n\n                                                               43.\n\n69     CONTINUED:   (3)                                              69\n\n                             DOUG\n               I don't know, everybody in town is\n               saying something different -- she\n               got knocked up, she ran away, your\n               old man kicked her out. So, which\n               is it?\n\n     Ted steps over and taps Doug on the shoulder.\n\n                              DOUG\n               Fuck off.\n\n     Ted is taken aback.   Pamela's eyes fill with tears.\n\n                             PAMELA\n               Why do you hate me so much?\n\n                             TED\n               Excuse me, asshole, but...\n\n     Doug spins and slugs Ted in the jaw -- sending him\n     reeling into the other dancers. Everyone pulls away from\n     Doug and Pam. Doug massages his fist and looks\n     helplessly at Pamela:\n\n                             DOUG\n               I don't hate you.\n\n\n70     INT. HOLT HOME - DOUG'S BEDROOM - LATER THAT NIGHT            70\n\n     The hall light is on but the bedroom is dark. Doug lies\n     on his bed (still dressed). Jacey appears in the\n     doorway.\n\n                              JACEY\n               You asleep?\n\n                              DOUG\n               Nope.\n\n\n71     EXT. HOLT HOME - GARAGE - NIGHT (SHORT TIME LATER)            71\n\n     Doug and Jacey play another hard fought game of ping-pong\n     in the garage. In the midst of a volley Doug says:\n\n                             DOUG\n               I'm gonna go to Penn like you.\n\n     Jacey snorts with incredulous laughter.\n\n                             JACEY\n               You're gonna what?\n\n                                                     (CONTINUED)\n\n                                                                44.\n\n71       CONTINUED:                                                   71\n\n                               DOUG\n                 I'm going to the University of\n                 Pennsylvania. I think I'm going\n                 to be an architect, too.\n\n                               JACEY\n                 Like hell you are.\n\n                               DOUG\n                 Why not? Maybe we can be\n                 roommates in Philadelphia?\n\n                               JACEY\n                 You're nuts. You'll never get\n                 accepted to Penn. Besides, Mom\n                 couldn't afford it anyway.\n\n                               DOUG\n                 I'll get a scholarship.\n\n                               JACEY\n                 I had a four-point-0 grade average\n                 and I couldn't get a scholarship\n                 -- so, I say you got your head up\n                 your ass.\n\n       Jacey skillfully manipulates the volley and wins the game\n       with a savage return that Doug is unable to counter.\n       Jacey smiles, puts his paddle down, and walks out of the\n       garage. Doug quickly picks up a ping-pong ball and hits\n       it into the back of Jacey's head. Jacey turns and shoots\n       a perturbed look at Doug -- Doug smiles:\n\n                               DOUG\n                 'Night.\n\n\n72       INT. WOMEN'S APPAREL STORE (DOWNTOWN HALEY) - DAY            72\n(WINTER, 1958)\n\n       Helen looks over the merchandise. Doug absent-mindedly\n       trails after his mother as he studies a large brochure\n       about the University of Pennsylvania.\n\n                               DOUG\n                 What's 'scenic design'?\n\n                               HELEN\n                 In what context?\n\n                               DOUG\n                 What a minute -- it's theatre.\n\n                               HELEN\n                 Mmmm?\n                                                      (CONTINUED)\n\n                                                                 45.\n\n72       CONTINUED:                                                    72\n\n                               DOUG\n                        (re: brochure)\n                 'The Howard Lambert Scholarship in\n                 Scenic Design for the Theatre.'\n                 It's a full ride, four years.\n                 Pays everything almost. Hell, I\n                 could do that. Just have to\n                 figure out what scenic design is.\n\n       Doug looks up from the brochure and comes face-to-face\n       with a mannequin wearing a bra, girdle, and stockings.\n       He almost flinches with surprise and blushes profusely:\n\n                               DOUG\n                 I'll wait for you outside, Ma.\n\n\n73       EXT. LADIES APPAREL STORE (DOWNTOWN HALEY) - MOVIE            73\nTHEATER - SIDEWALK - DAY (MINUTES LATER)\n\n       It's snowing -- Doug paces to keep warm. He momentarily\n       forgets the cold as he sees Pam and three of her girl\n       friends come out of the drugstore across the street. The\n       girls are in high spirits as they get into Pam's car.\n\n       Two well-dressed townswomen (MURIEL and DORIS) encounter\n       Helen on their way into the apparel shop as she steps out\n       onto the sidewalk.\n\n                               HELEN\n                 Hello, Muriel... Doris.\n\n       The women pass by Helen with obvious reserve. Helen is\n       seemingly unruffled by their distant responses. She\n       observes Doug as he watches Pam and her friends drive\n       off.\n\n       Helen and Doug walk up sidewalk (towards the movie\n       theater -- the marquee reads: KIM NOVAK -- JEFF CHANDLER\n       -- JEANNE EAGELS):\n\n                               HELEN\n                 Why don't you drop me off at home\n                 and take the car and go out with\n                 your friends. Go have some fun.\n\n                                  DOUG\n                 Why don't you?\n\n                               HELEN\n                 Why don't I what? Go hang out at\n                 the Dog'n'Suds?\n\n                                                      (CONTINUED)\n\n                                                                  46.\n\n73       CONTINUED:                                                     73\n\n                                 DOUG\n                   No, go out -- play bridge or\n                   whatever adults do for fun.\n\n                                 HELEN\n                   I read for fun.\n\n                                 DOUG\n                   You read too much.\n\n                                 HELEN\n                   You sound like your brother.\n\n                                 DOUG\n                   Come on -- let's go see a movie.\n\n\n74       INT. MOVIE THEATER (DOWNTOWN HALEY) - DAY                      74\n\n       Doug and Helen share a bag of popcorn as they wait for\n       the feature to begin.\n\n                                 HELEN\n                   Came here on my very first date\n                   with Charlie. Saw Rosalie with\n                   Nelson Eddy and... not Jeanette\n                   MacDonald... oh... Eleanor Powell.\n\n                                 DOUG\n                   Did Dad kiss you?\n\n                                 HELEN\n                          (gives Doug a \"look\")\n                   No.\n                          (slight beat)\n                   I kissed him.\n\n                                  DOUG\n                          (grins)\n                   All right, Mom.\n\n\n75       OMITTED                                                        75\n\n76       EXT. HIGH SCHOOL - PLAYING FIELD - GYMNASIUM - DAY             76\n(SUMMER, 1959)\n\n       The commencement exercises are being held in the\n       sweltering gym to accommodate the large crowd of proud\n       parents and family members. Doug, hot and uncomfortable\n       in his cap and gown, is seated among his fellow graduates\n       behind the podium. The PRINCIPAL (at the podium)\n       announces the names of the graduates as he calls them\n       forward to receive their diplomas.\n\n                                                        (CONTINUED)\n\n                                                                47.\n\n76     CONTINUED:                                                     76\n\n                             PRINCIPAL\n               Pamela Louise Abbott...\n\n     Pamela rises from her seat and takes her diploma.\n\n     Lloyd and Joan Abbott applaud their daughter. Joan\n     stands to take a snapshot. Alice is occupied with her\n     restless and fussy eighteen-month-old daughter, Susan.\n\n     Doug watches Pam return to her seat; she avoids his eyes.\n\n     Helen is all smiles, this is a very special day for her.\n     The chair next to her is empty. She glances behind her\n     and sees Jacey standing in the back of the gym.\n\n     Jacey idly surveys the gathering with irritable boredom.\n     He is only there at his mother's insistence. His eyes\n     settle on... Alice Abbott.\n\n     Alice tries to quiet her CRYING eighteen-month-old\n     daughter (SUSAN). Lloyd makes a reprimanding aside to\n     Alice and she rises and carries Susan up the aisle.\n\n     Jacey's eyes follow Alice -- she notices his stare as she\n     passes by with Susan in her arms.\n\n\n77     EXT. HIGH SCHOOL - PARKING LOT - LATER THAT DAY                77\n\n     Commencement is over -- the parking lot is a sea of cars\n     slowly negotiating through the mob of celebrating\n     graduates, beaming parents, and rambunctious siblings.\n\n     As Helen slips through the crowd she is pleasantly\n     ambushed by three (second grade) students of hers. She\n     has a brief exchange with the children and then moves on.\n\n     Helen finds herself face-to-face with Lloyd Abbott as\n     they both attempt to pass through a narrow space between\n     two parked vehicles. They are both caught off-guard --\n     there is no graceful way for them to squeeze past each\n     other.\n\n                             LLOYD\n               Congratulations, Helen.\n\n                            HELEN\n               Thank you. Congratulations to\n               you, too. Where's Pam going to\n               school?\n\n                             LLOYD\n               Hmm... Christ, I forgot.\n                             (MORE)\n\n                                                   (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                    48.\n\n77     CONTINUED:                                                    77\n\n                             LLOYD (CONT'D)\n               Bryn Mawr. I should be able to\n               remember that. It costs enough.\n\n                             HELEN\n               She'll do well there -- a very\n               bright girl.\n\n                             LLOYD\n               And Doug -- he's going to...?\n\n                             HELEN\n               He got a scholarship to the\n               University of Pennsylvania --\n               scenic design -- theater.\n\n                             LLOYD\n               Same school as...\n\n                               HELEN\n                        (filling in blank)\n               Jacey.\n\n                                LLOYD\n               Right.   Well.    Congratulations.\n\n                             HELEN\n               Thank you, Lloyd.\n\n     They pass each other and head their separate ways.   Their\n     chance meeting has not gone unobserved:\n\n     Joan Abbott has been watching them from the front seat of\n     Lloyd's brand-new 1959 Cadillac. She pretends to repair\n     her lipstick with her compact mirror as Lloyd slips\n     behind the wheel.\n\n     And Helen finds Jacey frowning at her. He opens the door\n     so that she can get into the Plymouth (Doug is already in\n     the back seat). Jacey glares at Lloyd as he walks around\n     the car and gets in behind the wheel.\n\n     Lloyd flips down his sun visor (to block Jacey's glare)\n     and pulls out of his parking spot.\n\n\n78     INT. IRON SKILLET RESTAURANT - THAT NIGHT                     78\n\n     A waitress walks across the busy diner to Helen, Jacey,\n     and Doug at their table. Helen and Doug are eating\n     their desserts -- Jacey is content to brood over his\n     cup of coffee. The waitress puts their bill on the\n     table and steps away.\n\n                                                    (CONTINUED)\n\n                                                                49.\n\n78     CONTINUED:                                                     78\n\n     As Helen starts to open her purse Webb Crosby appears and\n     picks up the bill.\n\n                             WEBB\n               It's on the house.\n\n                             HELEN\n               Oh, Webb, really -- that's not\n               necessary.\n\n                             WEBB\n               How many restaurants got an Ivy\n               League busboy? That's worth a\n               free meal. Charlie'd be real\n               proud of these two highbrows.\n\n                                HELEN\n               Yes, he would.     He'd be extremely\n               proud.\n\n                             WEBB\n                      (to Jacey)\n               You take good care of your little\n               brother in Philadelphia, you hear\n               me?\n\n                                JACEY\n               Yes, sir.\n\n\n79     EXT. ABBOTT HOME - STREET - NIGHT (SHORT TIME LATER)           79\n\n     The Holt family drives home from the restaurant -- Jacey\n     driving, Helen in front, and Doug in the back seat.\n\n                             HELEN\n               What a wonderful night. What a\n               wonderful day. My two Ivy League\n               boys.\n\n     This is torture for Jacey. Doug looks out the window at\n     the striped tent in the Abbott's front yard as they pass\n     by. A party for the \"Class of 1959\" is underway (as a\n     banner on the tent proclaims). The street is lined with\n     parked cars and busy with late-coming guests.\n\n     Doug checks the rearview mirror for Jacey's reaction, but\n     his brother keeps his eyes on the road.\n\n                             HELEN\n               I never understood that tent. I\n               wonder if they own it? I'm\n               surprised they don't just leave it\n               up all year long.\n                             (MORE)\n                                                      (CONTINUED)\n\n                                                              50.\n\n79     CONTINUED:                                                   79\n\n                             HELEN (CONT'D)\n                      (slight beat)\n               Lloyd's mother was a tough old\n               bird. She sold eggs. They had a\n               place way out on Ditch Road near\n               County Line. That was ages ago.\n               Poor Lloyd had to walk all that\n               way in to school and then back\n               everyday. Charlie used to call\n               Lloyd 'Egg-head' and he didn't\n               mean smart.\n                      (another beat)\n               I'm in the mood for ice cream.\n\n\n80     EXT. HOLT HOME - FRONT PORCH - LATER THAT NIGHT              80\n\n     Jacey and Doug sit on the porch steps eating bowls of ice\n     cream. Helen rises from the porch swing and takes her\n     empty bowl inside the house.\n\n                             HELEN\n               I think I'll have one more scoop.\n\n                             DOUG\n               Ping-pong?\n\n                             JACEY\n               Too hot.\n\n                             DOUG\n               You want to go out to the lake and\n               get a couple beers?\n\n                             JACEY\n               No, I don't want to go out to\n               the...\n                      (exhales)\n               Goddammit. Goddammit! Look, I\n               don't want you in Philadelphia. I\n               don't need you around to remind\n               everybody that I come from\n               Hicksville, U.S.A. So if you're\n               going to go to Philadelphia,\n               you're on your own, dip shit. I\n               don't need you riding my coat\n               tails. Christ -- why don't you\n               get your own life? Stop being my\n               fucking shadow.\n\n     Doug digests Jacey's insult, then scoops a ball of ice\n     cream out of his bowl with his spoon and flings the gooey\n     ice cream into the side of Jacey's face. Doug rises and\n     goes to the front door.\n\n                                                    (CONTINUED)\n\n                                                                51.\n\n80     CONTINUED:                                                     80\n\n                                DOUG\n               Screw you.\n\n                             JACEY\n               You little prick!\n\n     Jacey hurls his BOWL at Doug -- it misses and SHATTERS on\n     the wall.\n\n                             DOUG\n               Missed me, peckerhead.\n\n     As Doug opens the screen door Jacey dives into him --\n     they fall into the porch swing with such force that its\n     chains rip out of the porch ceiling and Doug, Jacey, and\n     the swing go overboard off the end of the porch into the\n     shrubs.\n\n                               HELEN (O.S.)\n                        (inside house)\n               Doug?    Jacey? What was that?\n\n     Doug and Jacey scramble to their feet, their clothes are\n     ripped and disheveled.\n\n                             JACEY\n               You're dead, dip shit!\n\n                             DOUG\n               You gotta catch me first, asshole!\n\n     Doug takes off with Jacey in hot pursuit. A few beats\n     later, Helen steps out onto the front porch and discovers\n     her sons and the porch swing missing.\n\n                                HELEN\n               Jacey?   Doug?\n\n\n81     EXT. HOLT HOME AND STREET - NIGHT                              81\n\n     Jacey races up a driveway -- Doug is nowhere to be seen.\n\n                             JACEY\n               Come on, weasel dick! Come on\n               out, you chicken shit!\n\n     A collection of GARBAGE CANS EXPLODE in all directions as\n     Doug pops up from behind them and bolts down the\n     driveway. Jacey chases after him, following him across\n     the street. They pay no heed to Helen (in the b.g.)\n     standing in their front yard, calling out to them:\n\n                                HELEN\n               Douglas Lee!     John Charles!\n\n                                                               52.\n\n82     NEIGHBORHOOD - HOLT HOME                                      82\n\n     Porch lights are turning on up and down the block and the\n     neighborhood DOGS begin to HOWL as Doug leads Jacey\n     between two houses.\n\n\n83     NEIGHBORHOOD - HOLT HOME                                      83\n\n     Doug jumps up onto a tall wooden fence. He gets halfway\n     over when Jacey leaps up and grabs him and the fence\n     collapses, dumping them into a back yard vegetable\n     garden.\n\n\n84     NEIGHBORHOOD - HOLT HOME                                      84\n\n     Doug and Jacey wrestle and grapple in the muddy soil,\n     cursing each other and crushing the rows of green crops.\n     MRS. PORTER appears at her back door brandishing a broom.\n\n                              MRS. PORTER\n               Git!   Stop that! You two git!\n\n     She sails into combat with her broom swinging. But Doug\n     and Jacey are unwilling to give up the fight -- they are\n     finally separated by a strong blast of water. They\n     sputter for breath and discover that Helen is holding the\n     hose.\n\n\n85     EXT. MRS. PORTER'S HOUSE - DAY (NEXT DAY)                     85\n\n     Helen sits in a lawn chair in the back yard wearing a\n     large straw hat and reading a book. Doug and Jacey are\n     repairing and painting the fence. Helen looks up from\n     her book:\n\n                             HELEN\n               That board doesn't look straight,\n               Jacey. Come on, Doug, you've been\n               painting the same spot for the\n               last five minutes.\n\n\n86     EXT. HOLT HOME - GARAGE - NIGHT                               86\n\n     Doug and Jacey clean their hands with turpentine. Doug\n     picks up a ping-pong paddle and bounces the ball on it,\n     trying to see how long he can keep it bouncing. Jacey\n     finishes cleaning up, picks up a paddle, and then,\n     without a word, Doug serves the ball and they begin to\n     volley.\n\n                                                                53.\n\n87     EXT. ROAD (COUNTRYSIDE) - DAY                                  87\n\n     The Plymouth drives along the two-lane blacktop past the\n     fields of tall, green corn. Doug is driving, Helen sits\n     beside him. She reacts to something in the distance:\n\n                             HELEN\n               Isn't that Pamela Abbott?\n\n     In the distance Pamela struggles with a jack as she tries\n     to remove a flat tire on her convertible.\n\n     Doug grimaces as he recognizes her.\n\n                               HELEN\n               It is Pam.    Pull over.\n\n     Doug reluctantly pulls over beside Pam's car. She's no\n     more pleased to see Doug than he is to see her.\n\n                              HELEN\n               Hi, Pam.   Do you need some help?\n\n                             PAMELA\n               Hi, Mrs. Holt. It's so darn hot\n               the stupid jack just keeps sinking\n               into the pavement.\n\n                             HELEN\n               Well, maybe Doug can give you a\n               hand?\n\n     Doug frowns and slowly climbs out of the Plymouth.\n\n                             DOUG\n               Where's the thing that goes on the\n               bottom of the jack?\n\n                               PAMELA\n               What thing?\n\n                             DOUG\n               The thing, the base that the jack\n               fits into?\n                      (finds it in her\n                       open trunk)\n               This.\n\n                             PAMELA\n               Oh, I thought that was just the\n               'spare-tire-holder-on-er.'\n\n                             DOUG\n               Read your manual.\n\n     Pamela would slug him if his mother wasn't present.\n\n                                                    (CONTINUED)\n\n     INVENTING THE ABBOTTS - Rev. 2/16/96                     54.\n\n87     CONTINUED:                                                   87\n\n     Doug releases the load on the jack and strains to extract\n     it from the molten pavement.\n\n                             HELEN\n               Pam, would you mind running Doug\n               home? I'd like to get to the bank\n               before they close.\n\n                               DOUG\n                        (protesting)\n               Mom...\n\n                             PAMELA\n               Sure, Mrs. Holt, I'll drive him\n               home. Thanks for stopping.\n\n                              HELEN\n               Of course.   Bye-bye.\n\n     Helen slides over behind the wheel and drives away.\n\n     Doug fumes silently while he reassembles the jack.\n\n\n88     INT. IRON SKILLET RESTAURANT - DAY                           88\n\n     Jacey sits at the counter at the rear of the busy diner\n     sipping an iced tea. He sees Alice Abbott enter -- she\n     pulls a dollar bill out of her purse as she approaches\n     the cash register near the front door. She calls out\n     to a waitress who is fetching an order from the grill.\n\n                             ALICE\n               Excuse me -- could I get change\n               for a dollar?\n\n     The waitress is too distracted to take notice of Alice\n     and Alice herself doesn't notice Jacey as he steps up\n     behind her.\n\n                             JACEY\n               Can I help you?\n\n                             ALICE\n               Yes, I need change for...\n                      (turns to him)\n               Oh... you don't work here, do you?\n\n                            JACEY\n               No. I was just thinking about\n               you. I was going to call you\n               tonight.\n\n                                                    (CONTINUED)\n\n     INVENTING THE ABBOTTS - Rev. 2/16/96                   55.\n\n88     CONTINUED:                                                 88\n\n                              ALICE\n                       (rattled)\n               What?   Why?\n\n                             JACEY\n               There's a picnic out at River\n               Point on Sunday -- I wanted to\n               invite you.\n\n                               ALICE\n               I couldn't.\n\n                             JACEY\n               Bring Susan, kids love picnics.\n\n                             ALICE\n                      (re: the dollar bill)\n               I need change for the parking\n               meter.\n\n                               JACEY\n               Here.\n\n     Jacey opens his palm and reveals the correct change.\n     Alice nervously exchanges the dollar bill for the\n     coins.\n\n                               ALICE\n               Oh, thanks.\n\n                             JACEY\n               Do you have time for an ice tea?\n\n                             ALICE\n               My mother's waiting by the car\n               so I won't get a ticket.\n\n                             JACEY\n               Maybe she'd like an ice tea, too?\n\n                               ALICE\n               No.\n\n                             JACEY\n               No harm asking.\n\n                              ALICE\n               No.   Don't do that.\n\n                               JACEY\n               Why not?\n\n                               ALICE\n               You know why.\n\n                                                   (CONTINUED)\n\n     INVENTING THE ABBOTTS - Rev. 2/16/96                     56.\n\n88     CONTINUED:    (2)                                            88\n\n                             JACEY\n               Then I'll make you a deal.\n\n                             ALICE\n               I just came in to get some change.\n\n                             JACEY\n               Come to the picnic on Sunday and\n               I'll wait here and let you leave\n               first, so your mother won't see me.\n\n                             ALICE\n               I don't care if my mother sees\n               you.\n\n                             JACEY\n                      (heads for the door)\n               Then you won't care if I ask her\n               if she'd like to join us for an\n               ice tea?\n\n                                ALICE\n               No!    Wait.\n\n     Jacey turns to her.\n\n                             ALICE\n               I don't know if I can.     I'll try.\n               It just depends.\n\n     Alice goes out the door -- as she passes by Jacey he\n     says:\n\n                                JACEY\n               Sunday.     River Point.   Around\n               noon.\n\n     Jacey watches through the window as Alice returns to\n     the Town & Country station wagon and puts a few coins\n     into the meter. Joan waits impatiently beside the car\n     with Susan in hand. As the Abbott women walk down the\n     sidewalk (away from the diner), Alice glances back and\n     sees Jacey smiling at her from the diner window.\n\n\n89     EXT. ROAD (COUNTRYSIDE) - DAY                                89\n\n     Pamela sits behind the wheel of her convertible listening\n     to PAT BOONE sing \"April Love\" on the car RADIO. Doug\n     drips with sweat as he tightens the lugs on the spare\n     tire. Pamela climbs out and inspects his progress.\n\n                                                      (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 2/16/96                    56A.\n\n89     CONTINUED:   (A1)                                              89\n\n                             PAMELA\n               You think you'll finish sometime\n               today? I'm getting sun stroke.\n\n                             DOUG\n               Put the top up.\n\n                             PAMELA\n               Stop acting like Jacey. What\n               makes you think you're so... cool?\n\n                             DOUG\n               Because -- I know all the answers\n               on 'The $64,000 Question,' because\n               I have X-ray vision and I can sing\n               better than Pat Boone. And\n               because I'm really a negro, but\n               don't tell anyone around here,\n               'cause you know what would happen\n               to me.\n\n                             PAMELA\n               God, I can't even talk to you.\n\n     She starts to get back into the car, then turns to him:\n\n                                                    (CONTINUED)\n\n                                                           57.\n\n89   CONTINUED:                                                  89\n\n                           PAMELA\n             Name one bad thing I've ever done\n             to you.\n\n                           DOUG\n             Why?\n\n                           PAMELA\n             Go on, name one bad thing.\n\n                           DOUG\n             What's the point?\n\n                           PAMELA\n             You tell me, because I don't get\n             it! Look, I'm not rich, my father\n             is. And I didn't pick my father.\n             And if I had a choice between\n             having tons of money or having\n             another father, I'd be absolutely\n             delighted to be poor! But\n             unfortunately life is not a\n             cafeteria!\n\n                           DOUG\n             Life is not a cafeteria?\n\n                           PAMELA\n             You know what I mean!\n\n                           DOUG\n             Shit, I'm supposed to feel sorry\n             for you 'cause you're rich?\n\n                           PAMELA\n             Well, am I supposed to feel sorry\n             for you 'cause you're so poor?\n\n                           DOUG\n             No.\n\n                           PAMELA\n             So then just stop it!\n\n                           DOUG\n             Stop what?!\n\n                           PAMELA\n             Stop treating me like an Abbott!\n\n                           DOUG\n             Well, how am I supposed to treat\n             you?\n\n                                                 (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                    58.\n\n89     CONTINUED:   (2)                                              89\n\n                             PAMELA\n               Like you used to. Like just plain\n               Pam.\n\n     Doug exhales as if he's winding up to apologize.\n\n                             PAMELA\n               And you don't have to say you're\n               sorry, and you don't have to look\n               like somebody just ran over your\n               dog. You just make me want to\n               scream sometimes.\n\n     Doug stares at her as if he's never seen her before.\n\n                             PAMELA\n               What are you looking at?\n\n                               DOUG\n               You.\n\n\n90     EXT. RIVER POINT PARK - DAY (FOLLOWING SUNDAY)                90\n\n     Jacey lounges on top of a blanket beside a cooler.\n\n                             ALICE (O.S.)\n               Where is everyone?\n\n     Jacey sits up and finds Alice standing behind him. She\n     carries a picnic basket. Other than a few children\n     skipping rock into the river they are alone.\n\n                             JACEY\n               We are everyone.\n\n                             ALICE\n               But you said...\n\n                             JACEY\n                      (overlapping)\n               No, I didn't. I just said a\n               picnic. I didn't say if anyone\n               else was coming.\n\n     Alice walks away.    Jacey jumps up and runs after her.\n\n                             JACEY\n               Where are you going?\n\n                             ALICE\n               I'm sorry... I thought...\n\n                                                     (CONTINUED)\n\n       INVENTING THE ABBOTTS - Rev. 3/20/96                    59.\n\n90     CONTINUED:                                                    90\n\n                             JACEY\n                      (blocking her way)\n               You didn't come here to see\n               everybody else. You came here to\n               see me. Didn't you? That's why\n               you didn't bring Susan along.\n\n                              ALICE\n               I'm married.\n\n                             JACEY\n               I thought you were getting a\n               divorce?\n\n                             ALICE\n               I am, but it's not final yet.\n               Besides, I'm two years older than\n               you.\n\n                             JACEY\n               Good, if the cops come around we'll\n               tell 'em you bought the beers in\n               the cooler.\n\n\n91     EXT. RIVERPOINT PARK - ANOTHER PART OF PARK -                 91\n     LATER THAT DAY\n\n     Jacey and Alice wander along a path on the riverbank.\n\n                             ALICE\n               I knew he would hit me. Peter's a\n               real hot-head. I knew if he hit\n               me hard enough, hurt me enough,\n               that even my father wouldn't stand\n               for it. Then one night I put too\n               much soap in the washing machine\n               and it overflowed. That did it.\n               He punched me. Broke my front\n               tooth.\n\n                              JACEY\n               Bastard.\n\n                             ALICE\n               So... what do you hear from\n               Eleanor?\n\n                              JACEY\n               I don't.   Do you?\n\n                              ALICE\n               No.   Did you love her?\n\n                                                     (CONTINUED)\n\n                                                                  60.\n\n91     CONTINUED:                                                       91\n\n                             JACEY\n               We weren't in love, we were in\n               heat.\n\n     Alice blushes.\n\n                             JACEY\n               Did you love Peter?\n\n                               ALICE\n               No.\n\n                             JACEY\n               Then why did you marry him?\n\n                               ALICE\n               Because...\n\n\n92     EXT. RIVERPOINT PARK - ROAD - LATER THAT DAY                     92\n\n     Jacey holds open the driver's door as Alice climbs in\n     behind the wheel (of her mother's Town & Country station\n     wagon). He closes the door.\n\n                             JACEY\n               Which tooth was it?\n\n     She points to a front tooth.      He leans over to look at\n     it.\n\n                             ALICE\n               This one. I had it capped.       You\n               can't really tell, can you?\n\n                               JACEY\n               No.    It's a beautiful mouth.\n\n                             ALICE\n               Are you going to kiss me?\n\n                             JACEY\n               I don't want to scare you.\n\n                             ALICE\n               I can't see you again, Jacey.\n\n                               JACEY\n               Sure you can.    There are ways.\n\n                             ALICE\n               Oh, God... why you? Why am I\n               telling all these things to you?\n\n                                                       (CONTINUED)\n\n                                                                61.\n\n92     CONTINUED:                                                     92\n\n                              JACEY\n               Because there's no one else you\n               can tell them to. Because I'm the\n               only person you know who will\n               admit to your face that your\n               father's a bag of shit. The\n               biggest bag of shit in this town.\n                      (slight beat)\n               Better head home. Shouldn't be\n               gone too long.\n\n     Alice drives away.   Jacey smiles -- he's won.\n\n\n93     EXT. ROAD (OUTSIDE HALEY) - DAY (SHORT TIME LATER)             93\n\n     The Plymouth cruises back toward town. Jacey drinks a\n     bottle of beer and happily contemplates the possibilities\n     of a relationship with Alice. He approaches a billboard\n     that reads: \"MIDWEST STEEL DESK, INC. -- Welcomes You to\n     Haley, Illinois.\"\n\n     Jacey drains the last of the beer and hurls the empty\n     bottle at the billboard as he drives past it.\n\n\n94     EXT. ABANDONED FARMHOUSE - DAY (WEEKS LATER -                  94\n     LATE AFTERNOON)\n\n     Pam's convertible is parked in a weed-choked yard. Pam\n     and Doug hurl rocks at the windows, trying to break what\n     is left of the shattered windows on the weather-beaten,\n     two-story farmhouse.\n\n                             PAMELA\n               Who do you look like more, your\n               father or your mother?\n\n                             DOUG\n               Hell, I don't know.\n\n                             PAMELA\n               Well, what did your father look\n               like?\n\n                             DOUG\n               Like a photograph. I never knew\n               him. He died like a month before\n               I was even born. Jacey probably\n               looks more like him than I do.\n               Jacey's named after him. That's\n               how he got to be called 'Jacey,'\n               after his initials, John Charles,\n               J.C.\n\n                                                      (CONTINUED)\n\n                                                              62.\n\n94     CONTINUED:                                                   94\n\n                             PAMELA\n               He died in a car wreck, right?\n\n                             DOUG\n               You never heard about that?\n\n                             PAMELA\n               About what?\n\n                             DOUG\n               Well, it was sort of a car wreck.\n               He drowned, or froze to death, or\n               both, I don't know. He was trying\n               to drive out to Mud Island.\n\n                             PAMELA\n               Mud Island's in the middle of the\n               lake.\n\n                             DOUG\n               It was winter time, the lake was\n               froze over.\n\n                             PAMELA\n               Jesus, that's pretty stupid.\n                      (catches herself)\n               Sorry.\n\n                             DOUG\n               It's all right, it is stupid.\n               Real stupid. He did it on a bet.\n               He bet someone twenty bucks that\n               he could do it. He made it all\n               the way out there, too. He went\n               through the ice on his way back.\n\n\n95     EXT. ABANDONED FARMHOUSE - ROOF - SUNSET                     95\n\n     Doug and Pamela sit on the ridge of the farmhouse roof\n     (they climbed out of a dormer window from the attic).\n\n                             DOUG\n               I think my dad was like Jacey is.\n               Some guys are just dare-devils. I\n               bet Jacey once that he couldn't do\n               a back-flip off the garage roof\n               into a big pile of leaves. And he\n               did it.\n\n                             PAMELA\n                      (slight beat)\n               One time Eleanor and I snuck out\n               and walked around the yard naked.\n\n                                                    (CONTINUED)\n\n                                                             63.\n\n95     CONTINUED:                                                  95\n\n                             DOUG\n               You did?\n\n                             PAMELA\n               Yeah. It was sort of a dare, too.\n               She dared me, I dared her, so we\n               both did it.\n\n                             DOUG\n               Was this day or night?\n\n                             PAMELA\n               Night.\n\n                             DOUG\n               Was there a full moon?\n\n                             PAMELA\n               I don't remember.\n\n                             DOUG\n               You walked around the yard or did\n               you like run from tree to tree?\n\n                             PAMELA\n               We just walked around the yard.\n\n                             DOUG\n               Front yard or back yard?\n\n                             PAMELA\n               Back yard.\n\n                             DOUG\n               Oh.\n\n                             PAMELA\n               Does it matter?\n\n                             DOUG\n               Yeah. Back yard nudity is\n               hypocritical. It's insincere.\n               People should do and say exactly\n               what they feel or think and not\n               try to hide things.\n\n                             PAMELA\n               Okay.\n\n                             DOUG\n               Okay.\n\n     Their conversation is stifled by this new standard of\n     absolute honesty.\n\n                                                   (CONTINUED)\n\n                                                                64.\n\n95     CONTINUED:    (2)                                              95\n\n     The sunset provides a convenient excuse for their\n     silence. But then Pam realizes he is staring at her.\n\n                             DOUG\n               Hi.\n\n                             PAMELA\n               Hi.\n\n                             DOUG\n               You look pretty.\n\n                             PAMELA\n               Really?\n\n                             DOUG\n               Yup.\n\n     Pamela takes his hand, gently unfolds it, and with her\n     index finger she writes on his palm, \"I love you.\"\n     Telling him took all the nerve she could muster, she\n     hasn't the stamina for a disappointing response -- she\n     places her fingers on his lips to silence him. Doug\n     leans over and kisses her, sweetly and tenderly, and for\n     a long time. They will always remember this kiss.\n\n\n96     EXT. MOVIE THEATRE (DOWNTOWN HALEY) - NIGHT                    96\n\n     The marquee reads: \"FRANK SINATRA -- EDW. G. ROBINSON --\n     'A HOLE IN THE HEAD' -- CINEMASCOPE -- AIR CONDITIONED.\"\n     Alice Abbott buys a ticket at the box office.\n\n\n97     INT. MOVIE THEATRE - NIGHT (MINUTES LATER)                     97\n\n     The movie has already begun. Alice enters the sparsely\n     peopled theatre and pauses to allow her eyes to adjust to\n     the darkness. A hand reaches out and takes her hand --\n     it is Jacey. He's seated beside the door. He rises and\n     leads her across the row of empty seats to the exit.\n\n\n98     INT. MOVIE THEATRE - BALCONY - NIGHT (MOMENTS LATER)           98\n\n     Jacey guides Alice to two seats deep in the shadows of\n     the otherwise unoccupied balcony. They gaze at the\n     screen for a few moments, then he moves his mouth to her\n     ear and nibbles on her lobe. She turns her lips to his\n     and they kiss passionately. Jacey slides his hand under\n     her skirt. Alice presses herself against his hand and\n     whispers:\n\n                                                     (CONTINUED)\n\n         INVENTING THE ABBOTTS - Rev. 2/16/96                    65/66.\n\n98       CONTINUED:                                                  98\n\n                                 ALICE\n                   Don't tell... don't tell anyone\n                   what we're doing... don't tell\n                   anyone... no one can know,\n                   Jacey... no one...\n\n\n99       INT. TEXACO STATION (DOWNTOWN HALEY) - NIGHT                99\n(WEEKS LATER)\n\n       The station is closed and locked up for the night. Jacey\n       and Alice are naked in the back seat of a car parked\n       inside the dark service bay. It is a hot and humid\n       night. They are slippery with sweat.\n\n                                   JACEY\n                   Marry me.\n\n                                   ALICE\n                   Impossible...\n\n                                 JACEY\n                   Nothing's impossible...\n\n\n100      OMITTED                                                     100\nthru                                                               thru\nB102                                                               B102\n\n\nC102     EXT. BUS DEPOT (HALEY) - DAY                                C102\n\n       Helen leans out a bus window and calls to Doug, who is\n       perched on the front fender of the Plymouth, which is\n       parked nearby with Jacey behind the wheel.\n\n                                 HELEN\n                   Don't forget to water my tomatoes!\n\n                                 DOUG\n                   Okay, Mom, okay.\n\n       The bus pulls away. Doug waves as the bus goes down the\n       street -- then he leaps with surprise as an impatient\n       Jacey leans on the CAR HORN.\n\n                                                                67.\n\n102     INT. HOLT HOME - LIVING ROOM - NIGHT (WEEKS LATER)            102\n\n      Doug and Pamela lounge on opposite ends of the sofa with\n      his bare feet pressed against hers in a gentle shoving\n      match. They are watching an episode of \"Sea Hunt\" on the\n      TELEVISION.\n\n                              PAMELA\n                How long is your mom gone?\n\n                              DOUG\n                Two weeks. She goes up every\n                summer to see this friend she went\n                to college with.\n\n                              PAMELA\n                Eleanor lives in Chicago.\n\n                                DOUG\n                She does?\n\n                             PAMELA\n                Yeah. She's going to stewardess\n                school.\n\n                              DOUG\n                What do they teach you at\n                stewardess school?\n\n                                PAMELA\n                I don't know.    How to wiggle your\n                bottom.\n\n                              DOUG\n                Maybe you should go there instead\n                of Bryn Mawr?\n\n      She pushes harder against his feet and her foot slips off\n      his and clobbers him in the crotch. He moans and sits\n      up.\n\n                                DOUG\n                Oww!   Damn!\n\n                                PAMELA\n                Sorry.\n\n                                DOUG\n                Watch it.\n\n                              PAMELA\n                It was an accident. Don't be\n                crabby.\n\n      She pulls him down on top of her. She kisses the tip of\n      his nose then blows his bangs off his forehead.\n\n                                                      (CONTINUED)\n\n                                                            68.\n\n102   CONTINUED:                                                  102\n\n                            DOUG\n              You want to... go upstairs?\n\n                               PAMELA\n              No.\n\n                            DOUG\n              I just thought maybe you were\n              tired of just kissing?\n\n                            PAMELA\n              I'm not tired of kissing.    Are\n              you?\n\n                            DOUG\n              No, but touching is nice.\n\n                            PAMELA\n              We are touching.\n\n                            DOUG\n              I just... you know... would like\n              to see what you look like without\n              any clothes on.\n\n                               PAMELA\n              Doug!\n\n                            DOUG\n              Aren't you curious?\n\n                            PAMELA\n              No, I know what I look like\n              without any clothes on -- I look\n              naked.\n\n                            DOUG\n              Can I touch your breasts?\n\n                               PAMELA\n              Jesus.\n\n                            DOUG\n              Just on the outside?\n\n                           PAMELA\n              No. You can kiss me.      I like\n              lips.\n\n                               DOUG\n              You like lips?\n\n                                                  (CONTINUED)\n\n                                                              69.\n\n102     CONTINUED:   (2)                                            102\n\n                              PAMELA\n                I like your lips, block-head. I\n                like being here like this. But\n                I'm not taking my clothes off,\n                'cause if we do that, you know\n                what we'll do. And I'm too... I\n                don't want to be like my sisters.\n                Not if I can help it.\n\n      They kiss but are almost instantly interrupted by the\n      SLAM of the SCREEN DOOR. Doug looks up and does a\n      surprised take as he sees Alice going up the stairs\n      followed by Jacey.\n\n                                DOUG\n                Shit...\n\n                                PAMELA\n                Who is it?\n\n                              DOUG\n                My brother. He just went upstairs\n                with your sister.\n\n                                PAMELA\n                With Eleanor?\n\n                                DOUG\n                Alice.\n\n\n103     EXT. HOLT HOME - STREET - NIGHT                             103\n\n      Pamela rushes out of the house with her shoes in her\n      hand. Doug chases after her in his bare feet.\n\n                              DOUG\n                Hey... hold up!\n\n                              PAMELA\n                Why didn't you tell me?\n\n                              DOUG\n                Hell, I didn't know. What does\n                this got to do with us?\n\n                              PAMELA\n                My God... what is she doing?\n\n                              DOUG\n                Why is it okay for you to sneak\n                around with me, but it's not all\n                right for Alice to sneak around\n                with Jacey?\n\n                                                    (CONTINUED)\n\n                                                                 70.\n\n103     CONTINUED:                                                     103\n\n                              PAMELA\n                Because I'm not Alice! And you're\n                not Jacey! Alice is... is like my\n                mom, they both get hurt so easy,\n                they're like turtles without\n                shells.\n\n                              DOUG\n                Come on, take it easy.\n\n                              PAMELA\n                You don't know my father. You\n                don't know how he is about Jacey.\n                He blames him for everything that\n                happened with Eleanor.\n\n                              DOUG\n                Eleanor fooled around with lots of\n                guys, it's not Jacey's fault your\n                dad kicked her out.\n\n                              PAMELA\n                Oh, Jesus! He didn't kick her\n                out, he put her in a nut house!\n                He shipped her off to this clinic\n                in Wisconsin.\n\n                              DOUG\n                       (taken aback)\n                But... I thought you said she's in\n                Chicago?\n\n                                 PAMELA\n                She is now.     They let her out a\n                month ago.\n\n                                 DOUG\n                Oh, shit.\n\n                                 PAMELA\n                Yeah.   Shit.\n\n\n104     EXT. ABBOTT HOME - STREET - LATER THAT NIGHT                   104\n\n      The Plymouth approaches -- Jacey turns off the headlights\n      and KILLS the MOTOR and coasts to a stop in front of the\n      house next door to the Abbotts'. Alice gets out of the\n      car, Jacey hurries after her, following her into her\n      front yard.\n\n                                 JACEY\n                Alice... wait!\n\n                                                       (CONTINUED)\n\n                                                                71.\n\n104     CONTINUED:                                                    104\n\n                                 ALICE\n                Go away.\n\n                              JACEY\n                It's the truth, you know it is.\n\n                              ALICE\n                No, no, it's all just... screwing.\n\n                              JACEY\n                It's called making love.\n\n                                 ALICE\n                Don't.\n\n                                 JACEY\n                Don't what?\n\n                              ALICE\n                Don't follow me.\n\n      He grabs her arm and stops her.\n\n                                 JACEY\n                What's wrong?\n\n                              ALICE\n                I spend all day, every day, just\n                waiting and waiting to be with\n                you, waiting to forget everything,\n                you make me forget... but then\n                when I get dressed and I come\n                home, you... just... leak out of\n                me. Leak away. I go into the\n                bathroom and I wash you off of me\n                and I remember everything.\n\n                                 JACEY\n                Remember what?\n\n                                LLOYD (O.S.)\n                Alice?!    Is that you?\n\n      Lloyd's voice paralyzes them.\n\n                                 LLOYD (O.S.)\n                Alice?\n\n      Alice steps out of the shadows and finds Lloyd standing\n      at the front door.\n\n                                 ALICE\n                Yes, Daddy...\n\n                                                     (CONTINUED)\n\n                                                                 72.\n\n104     CONTINUED:    (2)                                              104\n\n                              LLOYD\n                Who are you talking to?\n\n                              PAMELA (O.S.)\n                She's talking to me, Daddy.\n\n      Pamela rises from a wrought iron bench in another part of\n      the yard -- she strolls over to Alice.\n\n                              PAMELA\n                Just girl talk.\n\n                              LLOYD\n                You can talk inside.     It's late.\n\n      Pamela and Alice go inside the house.\n\n      Jacey exhales, he is ashen.\n\n\n105     EXT. IRON SKILLET RESTAURANT - NEXT DAY                        105\n\n      Doug hoses down the sidewalk in front of the restaurant.\n      Pamela pulls up in her car and gets out.\n\n                                DOUG\n                Hi.\n\n                                PAMELA\n                Hi.\n\n                                DOUG\n                What's up?\n\n                              PAMELA\n                I've been thinking -- maybe we\n                shouldn't see each other right\n                now.\n\n                                DOUG\n                Oh, yeah?    Why?\n\n                              PAMELA\n                Well... if my father... I don't\n                really care what would happen to\n                me if he found out I was seeing\n                you, but I have to take care of\n                Alice and my mother and Eleanor,\n                and... well, it would be hard for\n                me to do that if I were in the\n                doghouse, too. You know?\n\n                              DOUG\n                Christ, why do you have to take\n                care of them?\n                                                      (CONTINUED)\n\n                                                                 73.\n\n105     CONTINUED:                                                     105\n\n                              PAMELA\n                       (shrugs)\n                No one else will.\n\n      He struggles to hold his anger and frustration in check.\n\n                                DOUG\n                Okay.   Sure.   See you around.\n\n      Pam's composure begins to weaken, but she quickly returns\n      to the car before she can lose control. Doug turns the\n      hose back on. He doesn't look up as she drives away.\n\n\n106     INT. HOLT HOME - KITCHEN - DAY (TWO WEEKS LATER)               106\n\n      Helen rinses off some just-picked vegetables. She turns\n      off the faucet, then pauses in reaction to something.\n\n\n107     INT./EXT. HOLT HOME - STAIRS/FRONT PORCH - DAY                 107\n\n      Helen approaches the foot of the stairs drying her hands\n      with a dish towel. She listens for a beat, then steps\n      out on the front porch. Doug is brushing a coat of green\n      enamel on the repaired porch swing.\n\n                              HELEN\n                Who's upstairs with Jacey?\n\n                                DOUG\n                Alice Abbott.\n\n                              HELEN\n                       (long beat)\n                How long is she likely to stay?\n\n                              DOUG\n                I don't know, but I wouldn't hold\n                up dinner.\n\n\n108     INT. HOLT HOME - KITCHEN - NIGHT (EARLY EVENING)               108\n\n      Doug rinses the dirty dinner dishes in the sink.\n\n\n109     INT. HOLT HOME - DINING ROOM - NIGHT                           109\n\n      Helen hears the SCREEN DOOR SLAM as she fetches a clean\n      tablecloth from the buffet. She puts the tablecloth on\n      the table, starts for the kitchen, then hesitates.\n\n                                                              74.\n\n110     EXT. HOLT HOME - FRONT PORCH - NIGHT                        110\n\n      Jacey stands on the porch watching the taillights of\n      Alice's car disappear into the night. Helen appears\n      behind the screen door.\n\n                              HELEN\n                Do you want dinner?\n\n                                 JACEY\n                No, thanks.\n\n                              HELEN\n                Don't sit on the swing -- Doug\n                just painted it.\n\n                                 JACEY\n                I know.\n                       (slight beat)\n                I had to bring her here today.\n                She couldn't see me tonight and\n                there was nowhere else we could\n                go.\n\n                              HELEN\n                I can appreciate that, Jacey,\n                but...\n\n                              JACEY\n                I love her, Mother. I'm going to\n                marry her.\n\n                              HELEN\n                Do her parents know about this?\n\n                                 JACEY\n                Of course not.\n\n                              HELEN\n                Don't you think they should?\n\n                              JACEY\n                I don't give a damn about them.\n\n                              HELEN\n                Does Alice feel the same as you\n                do?\n\n                                 JACEY\n                She loves me.\n\n                              HELEN\n                Has she agreed to marry you?\n\n                                                    (CONTINUED)\n\n                                                               75.\n\n110     CONTINUED:                                                   110\n\n                             JACEY\n                She will. She needs time. She's\n                frightened. It's not easy for\n                her.\n\n                              HELEN\n                How does hiding it from her family\n                make it any easier?\n\n                              JACEY\n                We don't have any choice.\n\n                              HELEN\n                Alice is a grown woman, she's a\n                mother with a child of her own; if\n                she really loves you then she\n                should...\n\n                              JACEY\n                       (cutting her off)\n                All that matters is that I get her\n                away from them before they find\n                out.\n\n                              HELEN\n                I can't be a party to that, Jacey.\n\n                               JACEY\n                I don't need your help.   I'm not\n                asking for it.\n\n                              HELEN\n                       (slight beat)\n                You'll have to find somewhere else\n                to take Alice -- I can't have you\n                bringing her here again. I'm\n                sorry.\n\n      She steps away from the screen door.\n\n\n111     INT. ABBOTT HOME - ENTRY HALL AND STAIRCASE - NIGHT          111\n\n      Alice comes in the front door and goes up the stairs.\n\n                              JOAN (O.S.)\n                Alice? Where have you been?\n                Susie cut her finger on the piano\n                pedal. They're as sharp as razor\n                blades...\n\n      Joan steps into the entry hall.\n\n                                                     (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                    76.\n\n111     CONTINUED:                                                    111\n\n                              JOAN\n                Alice? Did you hear me? Susan\n                cut her finger on the piano pedal.\n\n      Alice disappears at the top of the stairs.\n\n\n112     INT. HOLT HOME - ENTRYWAY - LATE THAT NIGHT                   112\n\n      It is almost two o'clock in the morning. Helen has dozed\n      off in her chair with a book on her lap. She is startled\n      awake by a loud BANGING at the front door. Helen hurries\n      to the door and opens it. Pamela is on the porch. She\n      is out of breath and very distraught. Her CAR is parked\n      in the middle of the street with its lights on and MOTOR\n      RUNNING.\n\n                              HELEN\n                Pamela, are you all right?\n\n                              PAMELA\n                I need to talk to...\n\n      Jacey comes down the stairs, pulling on his bathrobe.\n      Doug appears on the stairs behind him.\n\n                                JACEY\n                What's wrong?\n\n                              PAMELA\n                Alice took some pills, some of my\n                mother's pills...\n\n                              JACEY\n                Oh, Jesus, no...\n\n                              PAMELA\n                She's all right, we took her to\n                the hospital...\n\n                              JACEY\n                I'll get dressed...\n\n                                PAMELA\n                No!\n\n                              JACEY\n                I have to see her.\n\n                              PAMELA\n                No. That's why she sent me, she\n                doesn't want you to come, she was\n                afraid you would if you heard from\n                someone else. She's all right.\n                              (MORE)\n                                                      (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                     77.\n\n112     CONTINUED:                                                     112\n\n                              PAMELA (CONT'D)\n                They just want her to rest\n                tonight, they said they might let\n                her come home in a day or two.\n                She just needs to rest. I've got\n                to go, I'm supposed to be on my\n                way home from the hospital.\n\n                              JACEY\n                But I have to see her.\n\n                              PAMELA\n                Dammit, no! I'm warning you, just\n                wait! I'll let you know just as\n                soon as she can see you. Please,\n                don't make things worse. Don't.\n\n\n113     EXT. HOLT HOME                                                 113\n\n      Pamela dashes back to her car.\n\n\n112     CONTINUED:                                                     112\n\n      as Jacey walks down the remainder of the stairs and\n      watches Pamela speed away.\n\n                              JACEY\n                Jesus...\n\n      Helen closes the front door and turns to say something\n      to Jacey, but he cuts her off:\n\n                              JACEY\n                Leave me alone, just leave me\n                alone.\n\n      Helen climbs the stairs, collects Doug at the top\n      landing, and leads him away.\n\n      Jacey punches his fist through a glass pane of the sheer-\n      curtained sidelight beside the front door.\n\n\n114     EXT. HOLT HOME - STREET - YARD - DAY (FIVE DAYS LATER)         114\n\n      Doug is mowing the front lawn.\n\n\n115     INT. HOLT HOME - JACEY'S BEDROOM - DAY                         115\n\n      The DRONE of the LAWN MOWER accompanies Jacey's pacing.\n      His face is haggard and unshaven. He glances out the\n      window and sees something that sends him bolting out of\n      his bedroom.\n\n           INVENTING THE ABBOTTS - Rev. 3/20/96                     78.\n\n116        EXT. HOLT HOME - STREET - FRONT YARD - DAY (MOMENTS            116\nLATER)\n\n         Pam's convertible barely comes to a halt at the curb\n         before Jacey comes charging out of the house to Pam.\n         Doug is occupied with the lawn mower; he doesn't notice\n         Pam and Jacey at first. (Jacey and Pam have to speak\n         over the din of the LAWN MOWER.)\n\n                                    JACEY\n                   How is she?\n\n                                 PAMELA\n                   She's all right.\n\n                                    JACEY\n                   Can I see her?\n\n                                 PAMELA\n                   At the boathouse -- at the lake.\n\n         Jacey turns and dashes up the driveway.\n\n         Doug watches Jacey jump into the Plymouth and speed down\n         the driveway and then up the street.\n\n         Doug SHUTS OFF the LAWN MOWER and walks over to Pam.\n\n                                 DOUG\n                   What's going on?\n\n         She looks at Doug with tears in her eyes.\n\n                                 PAMELA\n                   I had to... for Alice's sake.\n\n                                 DOUG\n                          (puzzled)\n                   Had to what? What?\n\n                                 PAMELA\n                   Tell Jacey I'm sorry.\n\n         Pam drives away.\n\n\n117        EXT. BOATHOUSE (LAKE) - DAY                                    117\n\n         The PLYMOUTH SKIDS to a stop behind the Abbott's Town &\n         Country station wagon. Jacey jumps out of his car and\n         rushes into the boathouse.\n\n\n118        INT. BOATHOUSE - DAY                                           118\n\n         Jacey discovers Lloyd Abbott waiting for him.\n\n                                                         (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 2/16/96                    79.\n\n118     CONTINUED:                                                    118\n\n                              LLOYD\n                I have plans for my daughters, Mr.\n                Holt, and they don't include you.\n                I know you. I know you better\n                than you know me. I know all\n                there is to know about screwing\n                your way into a wealthy family.\n                I'll never let you screw your way\n                into mine.\n\n                                  JACEY\n                Where is she?      Where's Alice?\n\n      Jacey turns and rushes out of the boathouse.\n\n\n119   EXT. BOATHOUSE - PLYMOUTH - DAY                               119\n\n      Jacey hops into the PLYMOUTH and PEELS OUT as he speeds\n      away. Lloyd Abbott steps out of the boathouse and\n      approaches the station wagon.\n\n\n120     EXT. PLYMOUTH (STREETS OF HALEY) - DAY                        120\n\n      Jacey speeds recklessly back into town.\n\n\n121     EXT. ABBOTT HOME - DRIVEWAY - DAY (MINUTES LATER)             121\n\n      Jacey skids into the driveway and leaps out of the car.\n\n\n122     INT. ABBOTT HOME - ENTRY HALL AND STAIRS - DAY                122\n\n      Jacey bursts through the front door and cries out.\n\n                                  JACEY\n                Alice!   Alice!\n\n      Joan Abbott rushes into the entry hall.\n\n                                  JOAN\n                Dear God!\n\n                                  JACEY\n                Where is she?!      Alice!   Alice!\n\n                              JOAN\n                Who do you think you are?\n\n                              JACEY\n                Dammit, where is she?!\n\n                                                      (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                     80.\n\n122     CONTINUED:                                                     122\n\n                              JOAN\n                Get out!\n\n                              JACEY\n                Alice!\n\n                              JOAN\n                Get out of here!\n\n                              JACEY\n                Alice!\n\n      Lloyd Abbott steps in the front door and drops his car\n      keys into the silver bowl on the hall table.\n\n                              LLOYD\n                Call the police, Joan.\n\n      Joan hurries away.\n\n                              JACEY\n                You son-of-a-bitch! Where is\n                she?!\n\n                              LLOYD\n                Behind you, Mr. Holt...\n\n      Jacey turns and sees Alice standing at the top of the\n      stairs. She is pale and drawn and wearing a bathrobe.\n\n                              JACEY\n                Come with me. Please, Alice, just\n                come with me now, right now.\n\n                              ALICE\n                I told you... I can't...\n\n      She walks OUT OF VIEW. Lloyd steps up behind Jacey and\n      says softly but with piercing intensity:\n\n                              LLOYD\n                Now, get out of here, you runt\n                stud. And keep your poor-boy dick\n                out of my daughters.\n\n      Jacey turns and stares at Lloyd -- then brushes past him\n      on his way out the door.\n\n\n123     INT. HOLT HOME - JACEY'S BEDROOM - LATER THAT DAY              123\n\n      Jacey haphazardly packs his suitcases. His emotions have\n      been spent. Helen stands in the doorway.\n\n                                                    (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                     81.\n\n123     CONTINUED:                                                     123\n\n                                HELEN\n                  Why spend all night and half the\n                  day tomorrow waiting in Chicago\n                  for the Philadelphia bus? Why not\n                  just wait and take the morning bus\n                  to Chicago?\n\n                                JACEY\n                  Because... the sooner I get out of\n                  this fucking town the better.\n\n                                 HELEN\n                         (slight beat; stung)\n                  Suit yourself.\n\n\n124     OMITTED                                                        124\n\n\n125   EXT./INT. ROAD/BUS (OUTSIDE HALEY) - EVENING (MAGIC            125\n      HOURSHORT TIME LATER)\n\n      Jacey doesn't look out the window as the bus (on its way\n      out of town) drives past the illuminated billboard that\n      reads: \"MIDWEST STEEL DESK, INC. -- Welcomes You to\n      Haley, Illinois.\"\n\n\n126     INT. HOLT HOME - DINING ROOM - LATER THAT NIGHT                126\n\n      Doug and Helen sit across from each other, neither one\n      has much of an appetite. They eat in silence for a few\n      moments, then:\n\n                                DOUG\n                  Dammit... why can't he just leave\n                  them alone?\n\n                                HELEN\n                  Who?\n\n                                DOUG\n                  The Abbotts. I don't know why...\n                  why couldn't he just forget 'em?\n                  Just pretend they didn't even\n                  exist?\n\n                                 HELEN\n                  If the Abbotts didn't exist, Jacey\n                  would've had to invent them, one\n                  way or another. There are no ends\n                  of Abbotts in the world, if that's\n                  what you need.\n                                 (MORE)\n\n                                                       (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 2/16/96                    82.\n\n126     CONTINUED:                                                    126\n\n                              HELEN (CONT'D)\n                And he just needs that somehow.\n                Well, actually, I know how.\n\n      She rises and picks up her plate.\n\n\n127     INT. HOLT HOME - KITCHEN - CONTINUOUS ACTION - NIGHT          127\n\n      Helen carries her plate to the sink.   Doug follows her\n      in.\n\n                              DOUG\n                What do you mean, how do you know?\n\n      She sits at the kitchen table and sighs as if coming\n      around to some central, hard truth.\n\n                              HELEN\n                I was just a wreck when Charlie\n                died.\n                              (MORE)\n\n                                                     (CONTINUED)\n\n      INVENTING THE ABBOTTS - Rev. 3/20/96                   83.\n\n127   CONTINUED:                                                   127\n\n                            HELEN (CONT'D)\n              Jacey was almost two and I was\n              eight months pregnant with you\n              and... well, some mornings I'd be\n              crying before I even woke up.\n              Then you were born. And Jacey\n              just got lost in there. I didn't\n              have anything for him. Mother\n              took him over. He'd cry or call\n              for me, and then I'd hear Mother\n              answer him, and I'd go back to\n              sleep.\n                     (sighs bitterly)\n              I should've taken us away from\n              here, gone somewhere else.\n\n                            DOUG\n              Why?\n\n                            HELEN\n              After Charlie died Lloyd Abbott\n              started dropping by on his way\n              home from work. He felt so bad\n              about that bet Charlie made with\n              him at the lake. That foolish,\n              idiotic bet. Poor Lloyd -- I felt\n              sorry for him. He'd have a cup of\n              coffee with Mother and me. If a\n              doorknob had come off he'd fix it.\n              He'd carry the garbage cans to the\n              curb. Someone dies, people try to\n              be helpful. But he was by here so\n              often that people started to talk.\n              It was fairly obvious that he\n              wanted something more from me than\n              just a cup of coffee. I suggested\n              that he didn't need to stop by\n              here so often, but... then one\n              afternoon I was at Woolworth's,\n              having lunch at the counter. All\n              of sudden Joan Abbott was standing\n              there -- screaming and yelling at\n              me to stop sleeping with her\n              husband, with Lloyd. I was\n              speechless. She was gone before I\n              could find my tongue.\n\n                            DOUG\n                     (stunned; almost\n                      ill)\n              Christ...\n\n                                                   (CONTINUED)\n\n                                                              84.\n\n127     CONTINUED:   (2)                                            127\n\n                              HELEN\n                I went to see Joan, I tried to\n                talk to her, to put her mind at\n                ease, but...\n\n                              DOUG\n                Dammit, why didn't Lloyd tell her\n                that nothing had happened?\n\n                              HELEN\n                I'm sure he did, but men always\n                say that, darling. Besides, Lloyd\n                was always having affairs. He's\n                that type of man.\n\n                              DOUG\n                Ahhh, Jesus... but why? Why did\n                everyone in town believe Joan\n                Abbott?\n\n                              HELEN\n                Because she's Joan Abbott. If you\n                cross Joan you don't get invited\n                to her parties -- and the Abbotts\n                have the best parties in town.\n                The only parties.\n\n                              DOUG\n                I hate this town. I hate the\n                Abbotts.\n\n      He slaps the back of a chair and knocks it over.\n\n                              HELEN\n                I'm sorry, Doug, I shouldn't have\n                told you.\n\n                              DOUG\n                I already knew.\n\n                              HELEN\n                People still talk about it?\n\n                              DOUG\n                No, I've never heard anyone talk\n                about it. Not to me.\n\n                              HELEN\n                Then how did...?\n\n                              DOUG\n                Jacey.\n\n                                                    (CONTINUED)\n\n         INVENTING THE ABBOTTS - Rev. 3/20/96                   85.\n\n127      CONTINUED:   (3)                                             127\n\n                               HELEN\n                 Oh, Lord... he knows too?\n\n                              DOUG\n                 Yeah. But he thinks it really\n                 happened.\n\n       Helen is overcome with tears. Doug stares at her\n       helplessly. He's never seen his mother weep before.\n\n\n128    OMITTED                                                      128\n&        &\n129                                                                 129\n\n\n130      EXT. COUNTRYSIDE ROAD - DAY                                  130\n\n       The bus cruises along the two-lane blacktop.   Doug stares\n       out the window.\n\n\nA131   EXT. PHILADELPHIA STREET - NIGHT (EARLY FALL 1959)           A131\n\n       Partygoers enter building.\n\n\n131    INT. JACEY'S APARTMENT                                       131\n\n       A vintage, third-floor, railroad flat -- sparsely\n       furnished and neat as a pin. Jacey is hosting a party.\n       A TONY BENNETT record (\"When Somebody Breaks Your Heart\")\n       plays on the hi-fi. The apartment is elbow-to-elbow with\n       Penn men and attractive coeds from Radcliffe, Mt.\n       Hollyoke, and Byrn Mawr. Doug sits in the middle of the\n       sofa wedged between two coeds having separate, but\n       equally animated conversations with two of Jacey's\n       classmates (who are perched on the arms of the sofa).\n       Doug wears a jacket and tie but his knack at looking out\n       of place is intact.\n\n       Jacey is apart from the others wooing a gorgeous CO-ED in\n       a tight cashmere sweater.\n\n                               JACEY\n                 Airplanes, bridges, skyscrapers,\n                 bras, all utilize the same\n                 fundamentals of structural\n                 design...\n\n       With his finger he traces the back strap of her bra\n       beneath her sweater...\n\n                                                      (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                    86.\n\n131     CONTINUED:                                                    131\n\n                               JACEY\n                A stable foundation that resists\n                compression...\n\n      His finger trails the shoulder strap of her bra...\n\n                              JACEY\n                Carefully calculated suspension...\n\n      He draws his fingertip around the outside of her breast\n      to the lower front of her bra...\n\n                              JACEY\n                And cantilevered elements to\n                provide support.\n\n      The Co-ed is bothered but none-the-less bewitched.\n\n                              CO-ED\n                Ahh... you know, I'm engaged.\n\n                                JACEY\n                So am I.\n\n                              CO-ED\n                       (shocked)\n                You are?\n\n                              JACEY\n                I'm engaged in conversation with\n                you.\n\n      Jacey smiles and then kisses her. Doug is spying on them\n      from the safety of the crowd. Jacey winks at Doug. Doug\n      shakes his head in wonder.\n\n\n132   EXT. CAMPUS - SIDEWALK (UNIVERSITY OF PENNSYLVANIA,          132\n      PHILADELPHIA) - DAY (MONTHS LATERLATE FALL, 1959)\n\n      Doug walks along the sidewalk towards the entrance of the\n      theater carrying some rolled-up plans under his arm. He\n      reacts as he sees:\n\n                                DOUG\n                Hey!   Hey!   Pam!\n\n      Pamela Abbott walks across the quad. Pam is 19 years old\n      now, her beauty in full bloom. Doug jogs over to her.\n\n                                DOUG\n                Hi.\n\n                                                     (CONTINUED)\n\n                                                                87.\n\n132     CONTINUED:                                                    132\n\n                                PAMELA\n                Hi.\n\n                              DOUG\n                What are you up to?\n\n                              PAMELA\n                I come down to use the library\n                sometimes or go shopping.\n\n                              DOUG\n                How's Bryn Mawr?\n\n                                PAMELA\n                Very... Bryn.    I got to catch the\n                bus back.\n\n                              DOUG\n                Just have to drop off these set\n                designs -- you want to go get\n                something to eat?\n\n                               PAMELA\n                I can't.   Sorry.\n\n                               DOUG\n                Why not?   It's been a long time.\n\n                              PAMELA\n                You seem taller.\n\n                              DOUG\n                       (re: her figure)\n                And you seem... not so plain.\n                       (slight beat)\n                So, dinner, okay?\n\n                               PAMELA\n                I can't.   I have to go to this\n                party.\n\n                                DOUG\n                What party?\n\n      The traffic light changes and the other pedestrians cross\n      the street.\n\n                              PAMELA\n                Just a party I got roped into\n                going. Maybe some other time,\n                okay? I mean it, really.\n\n                              DOUG\n                Just call -- I'm at Reed Hall.\n\n                                                      (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                     88.\n\n132     CONTINUED:                                                     132\n\n                               PAMELA\n                Okay.   Bye.\n\n                               DOUG\n                Bye.\n\n      Doug watches her cross the street.\n\n\n133     INT. REED HALL - DOUG'S DORM ROOM - THAT NIGHT                 133\n\n      Doug is revising a set design -- deeply concentrating on\n      his task. He's startled by a KNOCK on the door.\n\n                             MALE STUDENT (O.S.)\n                Hey, Holt! You got a visitor\n                downstairs!\n\n\n134     INT. REED HALL - LOBBY - NIGHT (MINUTES LATER)                 134\n\n      Doug comes down the wide stairs with a puzzled look on\n      his face. He stops at the front desk and the student\n      clerk points to another part of the lobby. Doug walks\n      across the cavernous lobby and finds Pamela Abbott\n      slumped in a chair.\n\n                              DOUG\n                Did you miss the bus?\n\n      Pam laughs and Doug suddenly realizes:\n\n                              DOUG\n                Damn, you're drunk. Awww, man...\n                I better get you out of here before\n                the Puritans tar-and-feather you.\n                Can you walk?\n\n      Pam awkwardly rises and Doug guides her to the door.\n\n                              DOUG\n                Listen to me -- go out the front\n                door, turn right, go around to the\n                side of the building and wait for\n                me by the fire escape. Okay?\n                Just wait.\n\n\n135     EXT. REED HALL - FIRE ESCAPE - NIGHT (MINUTES LATER)           135\n\n      Pamela leans against the side of the building as the fire\n      escape ladder descends to the pavement. Doug climbs\n      down.\n\n                                                      (CONTINUED)\n\n                                                                 89.\n\n135     CONTINUED:                                                     135\n\n                              DOUG\n                Come on -- up we go.   Pam?\n\n      Pam keels over and vomits.\n\n\n136     INT. REED HALL - DOUG'S DORM ROOM - NIGHT                      136\n\n      Pam sits on the bed as Doug pulls her stained turtleneck\n      sweater off over her head (she's wearing a bra).\n\n                              DOUG\n                What were you drinking, Sterno?\n\n                              PAMELA\n                I'm cold...\n\n                              DOUG\n                Hold on, we got to get your pants\n                too. Can you stand up.\n                       (as she collapses on\n                        the bed))\n                No, you can't stand up. All\n                right.\n\n      He undoes the waist of her pants and tugs on her pant\n      legs, but her panties start to slide off along with her\n      pants.\n\n                              DOUG\n                Nope, nope, let's keep the panties\n                on, okay? Pam? Can you hold on\n                to your underpants?\n                       (she's out)\n                I'll hold on to your underpants.\n\n      He holds her panties in place while he struggles to get\n      her pants over her hips.\n\n\n137     INT. REED HALL - RESTROOM - NIGHT                              137\n\n      Doug rinses out Pam's clothes in a sink.\n\n\n138     INT. REED HALL - DOUG'S DORM ROOM - NIGHT                      138\n\n      Pam's wet clothes have been draped over the radiator.\n      Pam is passed out, tucked in under the covers. Doug sits\n      on the edge of the bed gently cleaning her face with a\n      damp washcloth.\n\n                                                                 90.\n\n139     INT. DOUG'S DORM ROOM - NEXT MORNING                           139\n\n      Doug   stirs from his sleeping spot on the floor (he slept\n      with   his clothes on). He notices that Pam's clothes have\n      been   removed from the radiator. He sits up and finds\n      that   the bed is empty. She's gone.\n\n\n140     EXT. BRYN MAWR - DORMITORY - TWO DAYS LATER                    140\n\n      Pamela approaches her dorm carrying an armload of books.\n      She starts up the steps then stops when she sees Doug.\n\n                                DOUG\n                  You're welcome.\n\n                                PAMELA\n                  I'm sorry, Doug.\n\n                                  DOUG\n                  Shit.    That's it? You're sorry?\n\n                                PAMELA\n                         (suddenly alarmed)\n                  Oh Jesus... did we?\n\n                                DOUG\n                  Oh-Jesus-did-we what?\n\n                                PAMELA\n                  Did we... do it?\n\n                                DOUG\n                  What do you think?\n\n                                PAMELA\n                  I... don't... remember...\n\n                                DOUG\n                  Goddammit. Well, I know you might\n                  find this hard to believe, but I\n                  don't sleep with drunks.\n\n      He walks away.      She calls after him.\n\n                                  PAMELA\n                  Doug?    Hey!\n\n\n141     INT./EXT. DOUG'S DORM ROOM/FIRE ESCAPE - THAT NIGHT            141\n\n      Doug lounges on his bed reading a textbook. It is\n      raining outside. He is startled by a TAPPING on the\n      windowpane. Pamela is outside on the fire escape. He\n      ignores her.\n\n                                                      (CONTINUED)\n\n                                                                91.\n\n141     CONTINUED:                                                    141\n\n                              PAMELA\n                Doug! Open the window!     Come on,\n                I'm freezing. Doug...!\n\n      He gets out of bed, unlatches the window, then returns to\n      the bed and his book. Pamela opens the window (with\n      difficulty) and climbs in. She drapes her wet coat over\n      the radiator and sits in the desk chair.\n\n                              DOUG\n                If you feel like you're gonna puke\n                use the wastebasket there.\n\n                              PAMELA\n                I'm sorry. I am so sorry. I was\n                embarrassed. I didn't know where\n                I was when I woke up. I felt like\n                I was dying, so, I just... I was\n                going to call you.\n\n      Doug doesn't respond -- he turns the page of his book.\n\n                              PAMELA\n                I don't know... I was blotto. I\n                mean, I was so happy to see you.\n                Then I just got sad. I got sad.\n                And stupid. It happens, you know?\n\n      Doug snaps his book shut.\n\n                              DOUG\n                You want to hear something stupid?\n\n                               PAMELA\n                What?\n\n                              DOUG\n                When I was cleaning you up, wiping\n                the puke off your face, I suddenly\n                realized how much I miss you --\n                how much I love you. How's that\n                for stupid?\n\n      Pam is stung by his flippancy, she begins to cry.\n\n                              DOUG\n                What are you crying for?\n\n                               PAMELA\n                I love you.   But it's too late.\n\n                               DOUG\n                Why?\n\n                                                      (CONTINUED)\n\n                                                                  92.\n\n141      CONTINUED:    (2)                                              141\n\n                               PAMELA\n                 Everything's too screwed up.\n\n       Doug kneels in front of her and anxiously tries to\n       console her.\n\n                               DOUG\n                 No, no, it's not too late. It's\n                 perfect timing. We're on our own\n                 now. No Jacey and Eleanor or\n                 Jacey and Alice. That's what\n                 stinks about being the youngest,\n                 we have to sweep up after\n                 everybody else. But now it's just\n                 us. It's our turn.\n\n                               PAMELA\n                 How can you be in love with me?\n\n                               DOUG\n                 How can you be in love with me?\n\n                               PAMELA\n                 'Cause I've always have been.\n                 You... block-head.\n\n       He kisses her, then he gazes at her and strokes her hair.\n\n                               DOUG\n                 Hi.\n\n                               PAMELA\n                 Hi.\n\n                               DOUG\n                 You want to see something?\n\n                               PAMELA\n                 What?\n\n                               DOUG\n                 Come on.\n\n\n142      EXT. THEATER - SIDEWALK (UNIVERSITY OF PENNSYLVANIA,           142\nPHILADELPHIA) - NIGHT\n\n       Doug and Pam hurry along the rain-swept sidewalk towards\n       the theater.\n\n\n143      INT. THEATER - NIGHT (MOMENTS LATER)                           143\n\n       The large theater is dark except for a single work light\n       standing on the bare stage.\n                                                     (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                    93.\n\n143     CONTINUED:                                                    143\n\n      Doug leads Pam by the hand down the aisle from the lobby.\n\n                              PAMELA\n                What are we doing here?\n\n                              DOUG\n                I want to show you something.\n\n      He escorts her up a short flight of steps and positions\n      her center stage near the footlights.\n\n                              DOUG\n                Just stand right there.\n\n      He takes the work light with him as he walks off stage.\n      Then with a METALLIC CLANK everything goes dark.\n\n                               PAMELA\n                        (alarmed)\n                Doug!\n\n                              DOUG (O.S.)\n                It's all right -- don't move!\n                Stay put.\n\n      There's the RUMBLE and SQUEAK of a piece of SCENERY being\n      rolled onto stage -- then the SWOOSH of a backdrop being\n      lowered from the fly loft.\n\n                              DOUG (O.S.)\n                Almost, almost... hold on.\n\n      We hear Doug RUNNING somewhere backstage then a beautiful\n      sunset slowly illuminates the stage -- creating the\n      perfect mood for the modestly scaled stylized set that\n      Doug has put into place: It is the roof of a weathered\n      farmhouse with a dormer window and a tall brick chimney.\n      Doug steps on stage, he's a bit winded from his quick-\n      change routine.\n\n                              PAMELA\n                Oh, Doug, it's beautiful.\n\n                              DOUG\n                The senior acting class does\n                scenes from different plays, they\n                invite everybody, it's a real big\n                deal. So, there's this\n                competition among all the theater\n                design students to do the sets.\n                And -- anyway -- I'm the one\n                whose design got picked.\n\n                                                    (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                      94.\n\n143     CONTINUED:    (2)                                               143\n\n                              PAMELA\n                What scene is it for?     What play?\n\n                              DOUG\n                       (a tad embarrassed)\n                Umm... Romeo and Juliet. It's\n                something different, I think\n                that's why they picked it.\n                Everybody else was doing castles\n                and stuff. Rooftop Romeo and\n                Juliet by Douglas L. Holt.\n\n                              PAMELA\n                You're really good at this.\n\n                              DOUG\n                It's like building models when I\n                was a kid. It's fun. It's...\n                make-believe.\n\n                              PAMELA\n                You know, they tore that old\n                farmhouse down?\n\n                                 DOUG\n                Oh, no.     Did they?\n\n                                 PAMELA\n                Yeah.\n\n                              DOUG\n                They always tear down the wrong\n                stuff.\n\n                              PAMELA\n                Oh, Jesus, I missed you -- so\n                much.\n\n                              DOUG\n                Missed you, too.\n\n      They kiss -- then Pamela pulls away.    Doug studies her,\n      then:\n\n                              DOUG\n                You have a boyfriend, right?\n\n                                 PAMELA\n                No.\n\n                              DOUG\n                Well, what? You worried what your\n                old man would think?\n\n                                                       (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                    95.\n\n143     CONTINUED:   (3)                                              143\n\n                              PAMELA\n                He doesn't care what I do, as long\n                as I don't do it in Haley.\n\n                              DOUG\n                Then what's the problem?\n\n                              PAMELA\n                I can't... do this.\n\n                              DOUG\n                Why not? I mean... okay. We\n                don't have to go so fast. Shit,\n                I'm sorry. I blew it again, huh?\n\n                               PAMELA\n                No, I did.\n\n                               DOUG\n                How?\n\n      Pam climbs down off the stage and starts up the aisle.\n\n                              PAMELA\n                I'm on probation. They pulled a\n                bed-check the night I was here. I\n                have to be back in the dorm by\n                ten. Gotta go.\n\n                              DOUG\n                What about tomorrow? I could come\n                up in the afternoon and...\n\n                              PAMELA\n                No! It's just too late. It's all\n                messed up. I can't seem to make\n                things all right. The more I try\n                the worse everything gets. I'm\n                sorry.\n\n      Pam walks up the aisle and disappears through a door to\n      the lobby.\n\n                               DOUG\n                Pam!   It's not too late!\n\n\n144   OMITTED                                                     144\n&       &\n145                                                               145\n\n         INVENTING THE ABBOTTS - Rev. 3/20/96                     96.\n\n146      OMITTED                                                        146\n&        &\n147                                                                     147\n\n\nA148     INT. BRYN MAWR DORMITORY - LOBBY - LATER THAT NIGHT            A148\n\n       Pam enters the lobby. A female student CLERK (#1)\n       displays a message as Pam passes by the front desk.\n\n                                 CLERK #1\n                   Pam -- some guy named Doug keeps\n                   calling for you.\n\n       Pam ignores the Clerk and the message and goes upstairs.\n\n\n148      EXT. BRYN MAWR DORMITORY - DAY                                 148\n\n       Pamela approaches her dorm. She stops as she sees Doug\n       waiting beside the entrance. She turns and walks away.\n\n\nA149     EXT. BRYN MAWR DORMITORY - NIGHT                               A149\n\n       Doug still waiting beside the entrance for some sign of\n       Pam. He's tired, cold, and hungry. He grinds out his\n       cigarette with his heel and walks away.\n\n\nB149   EXT. JACEY'S APT. (PHILADELPHIA STREET) - DAY (SUNDAY)       B149\n\n\n149    INT. JACEY'S APARTMENT                                       149\n\n       Jacey sits in his favorite armchair reading the Sunday\n       newspaper. Doug sits in the middle of the sofa. Jacey\n       scrutinizes his brooding younger brother.\n\n                                 JACEY\n                   What's wrong with you?\n\n                                 DOUG\n                   Nothing.\n\n       A boiling water KETTLE starts to WHISTLE (O.S.) -- Jacey\n       goes into the kitchen to tend to it. There is a soft\n       KNOCK on the front door. Doug goes to answer it. He\n       opens the door and finds Pamela standing there with her\n       coat in her hand. He is pleasantly surprised; Pam is\n       distant, slightly off-balance.\n\n                                 DOUG\n                   Hi.\n\n                                 PAMELA\n                   Hi.\n                                                      (CONTINUED)\n\n         INVENTING THE ABBOTTS - Rev. 3/20/96                     97.\n\n149      CONTINUED:                                                     149\n\n                               DOUG\n                 How did you know I was here?\n\n                               JACEY (O.S.)\n                 You want another cup of...\n\n       Jacey steps out of the kitchen and frowns when he sees\n       Pam.\n\n                               JACEY\n                 I told you not to come by on\n                 Sundays.\n\n                                PAMELA\n                 I forgot.\n\n       The breath goes out of Doug as if he'd been struck in the\n       stomach.\n\n                               JACEY\n                 Dammit, why didn't you call first?\n\n                               PAMELA\n                 Didn't have any nickels.\n\n                               JACEY\n                 Well, I didn't expect to see you\n                 again. You want to fuck? I mean,\n                 that's why you came over, right?\n\n                                PAMELA\n                         (slight beat)\n                 Sure.\n\n                               JACEY\n                 Then take off your clothes.\n\n       Pamela drops her coat on the floor. She pulls her\n       sweater off over her head. Doug's anguish is as great\n       as Pamela's humiliation. He cannot bear any more if\n       this -- he walks out the door.\n\n\n150      EXT. JACEY'S APARTMENT (PHILADELPHIA) - SIDEWALK - DAY         150\n\n       Doug comes out of the apartment house and walks up the\n       sidewalk. Tears begins to stream down his face. He\n       begins to run and run as fast as he can.\n\n\n151      INT. REED HALL (PHILADELPHIA) - LOBBY AND STAIRS -             151\nTHAT NIGHT\n\n       Doug enters the dormitory and starts up the stairs.\n\n                                                      (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                   98.\n\n151     CONTINUED:                                                   151\n\n                                 JACEY (O.S.)\n                Doug...\n\n      Doug turns and finds Jacey at the foot of the stairs.\n\n                                 DOUG\n                Fuck you.\n\n      Doug continues up the stairs -- Jacey pursues him.\n\n                                 JACEY\n                I didn't know.\n\n                              DOUG\n                You didn't know what?!\n\n                              JACEY\n                How you felt about Pam.\n\n                                 DOUG\n                Fuck you.\n\n                                 JACEY\n                I'm sorry.\n\n                              DOUG\n                Apologize to her, you asshole!\n\n                                 JACEY\n                I did.\n                       (slight beat)\n                I ran into her a few weeks ago at\n                a party. She was drinking and\n                I... it was easy. She felt guilty\n                about telling her father about\n                Alice and me. Actually, I made\n                her feel guilty, I made her feel\n                like she had betrayed Alice.\n\n                              DOUG\n                She didn't betray Alice! She was\n                just trying to get rid of you so\n                Alice wouldn't try to kill herself\n                again. Jesus Christ, you shit-\n                head, Alice couldn't marry you!\n\n                                JACEY\n                I know.    I mean, I do now.\n\n                              DOUG\n                Then what the hell did Pam ever do\n                to deserve your revenge?\n\n                                 JACEY\n                Nothing.\n                                                     (CONTINUED)\n\n                                                                 99.\n\n151     CONTINUED:   (2)                                               151\n\n                              DOUG\n                Just your way of evening the score\n                with Lloyd Abbott, right?\n\n                                JACEY\n                Right.\n\n      Doug spins and delivers a wild, roundhouse punch that\n      lands brutally on the side of Jacey's face -- the impact\n      knocks him down onto the steps. Jacey's eyebrow has\n      split open, he is blinded by blood.\n\n                                DOUG\n                I don't know   you! I don't know\n                who the fuck   you are! You fuck\n                everything.    You fuck everything\n                up! Why did    you have to fuck Pam,\n                too?!\n\n      Doug walks away, leaving Jacey sitting on the steps,\n      clutching a banister for support. He presses his palm to\n      his eyebrow to squelch the flow of blood.\n\n\n152     EXT. BRYN MAWR DORMITORY - DAY                                 152\n\n      Doug approaches Pam's dormitory.\n\n\n153     INT. BRYN MAWR DORMITORY - LOBBY - DAY                         153\n\n      Doug steps up to the female student CLERK (#2) at the\n      front desk.\n\n                              DOUG\n                Pamela Abbott, please.     Tell her\n                Doug is here.\n\n                              CLERK #2\n                She's not here.\n\n                                DOUG\n                I'll wait.\n\n                                CLERK #2\n                But she left.\n\n                              DOUG\n                What do you mean?\n\n                              CLERK #2\n                She left... last night.\n\n                                                       (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                       100.\n\n153     CONTINUED:                                                        153\n\n                              DOUG\n                Where did she go?\n\n                                CLERK #2\n                I don't know.\n\n                              DOUG\n                Well, did she go home?\n\n                              CLERK #2\n                No one seems to know. She just\n                took some clothes and left.\n\n                              DOUG\n                       (lost)\n                Oh, God... no...\n\n      His pain is so clear that it spurs the Clerk's sympathy.\n\n                              CLERK #2\n                Look, I'm not supposed to do this,\n                but... well, I can give you her\n                home address.\n\n                              DOUG\n                       (explodes with irony)\n                Shit! Yeah, right...\n                       (slight beat)\n                I mean... thanks. Thanks anyway.\n                I know her home address.\n\n\n154     EXT. ABBOTT HOME - STREET - DAY (DECEMBER, 1959)                  154\n\n      The Abbott house is decked with snow. Doug sits    behind\n      the wheel of the Plymouth. He's parked down the    street.\n      He smokes a cigarette and stares at the house --   the\n      pavement outside the driver's window is littered   with\n      butts.\n\n\n155   EXT. SHOP (DOWNTOWN HALEY) - DAY                               155\n\n      Alice comes out on the street laden with packages and\n      shopping bags. She's startled by Doug when he falls in\n      beside her and follows her down the sidewalk.\n\n                                DOUG\n                Where's Pam?\n\n                                ALICE\n                I don't know.\n\n                              DOUG\n                Is she with Eleanor?\n                                                     (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                     101.\n\n155     CONTINUED:                                                      155\n\n                                ALICE\n                I don't know.\n\n                                DOUG\n                In Chicago?\n\n                                ALICE\n                I don't know.\n\n                              DOUG\n                I couldn't find Eleanor's name in\n                the Chicago phone book.\n\n                              ALICE\n                Maybe it's unlisted.\n\n                              DOUG\n                Well, do you know Eleanor's\n                address?\n\n                              ALICE\n                No. I don't know her address, I\n                don't know her phone number.\n                You'd have to ask my father for\n                it. All right?\n\n      Alice turns and steps into another shop -- leaving Doug\n      behind on the sidewalk.\n\n\n156   INT. HOLT HOME - LIVING ROOM - NIGHT (CHRISTMAS, 1959)       156\n\n      PERRY COMO SINGS \"The Little Drummer Boy\" ON the\n      TELEVISION. Doug rises from the sofa.\n\n\n157     INT. HOLT HOME - KITCHEN - CONTINUOUS ACTION - NIGHT            157\n\n      Helen is peeling apples to make a pie.   Doug enters and\n      studies her for a beat.\n\n                                DOUG\n                Are you okay?\n\n                                HELEN\n                I'm fine.\n\n                              DOUG\n                You look... tired.\n\n                                HELEN\n                Just a cold.\n\n                                DOUG\n                You sure?\n                                                     (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                    102.\n\n157     CONTINUED:                                                     157\n\n                               HELEN\n                I do wish Jacey had come home for\n                Christmas. Maybe that's what's\n                wrong with me.\n\n                              DOUG\n                I guess that free-lance drafting\n                job was too good for him to turn\n                down.\n\n                              HELEN\n                I don't think that's why he didn't\n                come home. I wrote him a letter,\n                you know. About Lloyd and me.\n                Has he mentioned it to you?\n\n                               DOUG\n                No.\n\n      Doug wants to avoid the topic of Jacey.    He opens the\n      refrigerator.\n\n                              DOUG\n                When did you start drinking beer?\n\n                              HELEN\n                Oh... I bought those for you. I\n                had them in the basement; I kept\n                forgetting to bring them up.\n\n      He does a bemused take on her.\n\n                              HELEN\n                Good heavens, I know you drink\n                beer.\n\n      Doug takes out two bottles of beer and opens them.\n\n                               DOUG\n                Here.   Have one with me.\n\n                              HELEN\n                I bought those for you, honey.\n\n                              DOUG\n                It's not good to drink alone, Mom.\n\n                              HELEN\n                Don't be silly.\n\n                               DOUG\n                Come on.   Sit down.   Have a beer.\n\n                                                      (CONTINUED)\n\n                                                               103.\n\n157     CONTINUED:   (2)                                              157\n\n      He pulls out a chair for her. She reluctantly comes over\n      and sits down. Doug sits and proposes a toast.\n\n                              DOUG\n                Merry Christmas.\n\n                              HELEN\n                Merry Christmas.\n                       (takes a sip)\n                It's beer.\n\n                              DOUG\n                Let's drink 'em all.\n\n      Helen laughs girlishly.\n\n                              HELEN\n                Charlie was always trying to get\n                me to drink beer.\n\n                              DOUG\n                Why do you always call him\n                Charlie?\n\n                              HELEN\n                That was his name.\n\n                              DOUG\n                Why don't you ever say 'your\n                father'?\n\n                              HELEN\n                Sometimes I do, don't I? I don't\n                know. When I think of him, I\n                think of 'Charlie.'\n\n                              DOUG\n                Did you ever... meet anybody else?\n\n                              HELEN\n                You mean another man?\n\n                                DOUG\n                Yeah.\n\n                              HELEN\n                Well, everyone always thinks\n                things are more possible than they\n                are. I mean, single men don't\n                stay in Haley if they have any\n                starch. The only eligible man\n                around was Drew Carter, but he\n                smells like his dog.\n\n                                                     (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 2/16/96                     104.\n\n157     CONTINUED:    (3)                                               157\n\n      Her remark cracks Doug up -- Helen laughs, too.\n\n                              HELEN\n                I wish I'd remembered the beers\n                sooner. It's nice to see you\n                smiling.\n\n                               DOUG\n                Sorry.\n\n                               HELEN\n                Don't be.   Everyone has sad times.\n\n      Doug dissolves into tears. He lowers his head and\n      shields his eyes with his hand. Helen leans over and\n      strokes his hair. After a few moments, he rises and\n      wipes away his tears with a dish towel.\n\n                              HELEN\n                I'll tell you a secret. I did\n                have a friend. A man in Chicago.\n                I used to see him when I went up\n                to Chicago to visit Bea during\n                summer vacations.\n\n                              DOUG\n                'Used to see him' -- you don't see\n                him anymore?\n\n                               HELEN\n                No.\n\n                              DOUG\n                Did you like him?\n\n                              HELEN\n                He was a wonderful man. A little\n                boring, but really, very\n                wonderful.\n\n                              DOUG\n                How long did this go on?\n\n                              HELEN\n                About eight years or so, it was\n                when you boys were still at home.\n\n                              DOUG\n                That's a long time. Did you ever\n                think about marrying him?\n\n                               HELEN\n                He proposed.   But, well, obviously,\n                I said no.\n\n                                                       (CONTINUED)\n\n                                                                  105.\n\n157      CONTINUED:   (4)                                                157\n\n                               DOUG\n                 Why?\n\n                               HELEN\n                 Because I'm in love with... your\n                 father. With my memory of him.\n                 He was the one for me. Oh, I\n                 don't know... there's different\n                 kinds of love, darling. Some\n                 people you love no matter what.\n                 Other people you love if the\n                 situation is right. To me the\n                 best kind of love is the 'no\n                 matter what' kind.\n                        (slight beat)\n                 Well, I am a cheap drunk, aren't\n                 I?\n\n\n158      EXT. COUNTRYSIDE - ROAD - DAYS LATER                            158\n\n       The bus cruises along the narrow ribbon of pavement.\n\n\n159      INSIDE BUS - ANGLE ON DOUG                                      159\n\n       -- sitting by himself; there's not many passengers today.\n       We hear the VOICES of rambunctious CHILDREN...\n\n\n160      INT. HALEY ELEMENTARY SCHOOL - CLASSROOM - DAY                  160\n(LATE SPRING, 1960)\n\n       The second-grade students are in the midst of an art\n       project where they make a design by gluing various sorts\n       of dried beans to colored paper -- but the beans are\n       being thrown about the room and other beans have been\n       spilled on the floor. Helen wearily attempts to rein in\n       the unruly children:\n\n                               HELEN\n                 Too much noise, please. Let's\n                 finish up. Keep the glue on the\n                 paper. Sam, Lillian, Jack -- in\n                 your seats, please...\n\n       Helen suddenly loses her energy and interest in policing\n       the children. Their hijinks continue as she steps out of\n       the classroom.\n\n           INVENTING THE ABBOTTS - Rev. 3/20/96                     106.\n\n161        INT. HALEY ELEMENTARY SCHOOL CORRIDOR - CONTINUOUS              161\nACTION\n\n         Helen steps over to a window and stares out -- lost in\n         her own thoughts and oblivious to the NOISE from her\n         classroom.\n\n\n162      INT. UNIVERSITY OF PENNSYLVANIA - THEATER - DAY (LATE        162\n         SPRING, 1960)\n\n         Doug is on a cat-walk in the fly loft high over the stage\n         floor. He strains as he drops 20 pound slabs of pig-iron\n         onto a counterweight carriage, then he releases the line\n         and flies a canvas backdrop up into the loft. He locks\n         off the line, wipes his brow, turns, and finds Jacey\n         standing behind him.\n\n                                 DOUG\n                   What-the-hell do you want?\n\n                                   JACEY\n                   Mom...\n\n\n163        INT. AIRPORT TERMINAL (PHILADELPHIA) - THAT NIGHT               163\n\n         Doug sits in an almost empty terminal waiting to catch a\n         red-eye flight to Chicago. A group of just arrived\n         stewardesses pass by chatting with a captain and other\n         flight officers. Eleanor Abbott does a take on Doug,\n         steps away from her co-workers, and doubles back to him.\n\n                                   ELEANOR\n                   Hi, Doug!\n\n         Doug almost doesn't recognize her. She is twenty years\n         old now and very grown-up, very stylish in her stewardess\n         uniform. She smiles at him.\n\n                                 ELEANOR\n                   How's your chin?\n                          (as he doesn't respond)\n                   Remember... the pencil?\n\n                                   DOUG\n                   Yeah.    I have a little scar.\n\n                                 ELEANOR\n                   You going home? Back to Hole-in- the-Ground,\n                   Illinois.\n\n                                 DOUG\n                   My mother died.\n\n                                                       (CONTINUED)\n\n      INVENTING THE ABBOTTS - Rev. 3/20/96                   107.\n\n163   CONTINUED:                                                    163\n\n                            ELEANOR\n                     (taken aback)\n              Oh God. Oh no. Oh, Doug, I'm\n              sorry.\n\n                            DOUG\n              She had cancer. I just saw her\n              Christmas. She was tired, but I\n              thought she just had the flu or\n              something. She didn't tell us.\n              The hospital told Jacey when they\n              called him.\n\n                            ELEANOR\n                     (slight beat)\n              How is Jacey?\n\n                            DOUG\n              He had to stay to take his state\n              board exams. He's coming back the\n              day after tomorrow.\n\n                            ELEANOR\n              He's an architect?\n\n                            DOUG\n              If he passes his exams.   He will.\n\n                            ELEANOR\n              I'm so sorry, Doug.\n\n                            DOUG\n              You know, I tried to find your\n              phone number a couple of months\n              ago.\n\n                            ELEANOR\n              It's in my roommate's name, I've got\n              to fix that.\n\n                            DOUG\n              I was wondering if you knew where\n              Pam was?\n\n                             ELEANOR\n                      (slight beat)\n              No.   I don't.\n\n                            DOUG\n              She left school.\n\n                             ELEANOR\n              I know.   My father called me.\n                             (MORE)\n\n                                                   (CONTINUED)\n\n                                                                 108.\n\n163     CONTINUED:   (2)                                                163\n\n                              ELEANOR (CONT'D)\n                He was looking for her. I don't\n                know where she is. I gotta run --\n                I'll miss my ride to the hotel.\n\n                              DOUG\n                Tell Pam I love her.\n\n      Eleanor looks at him.\n\n                              DOUG\n                Tell her... just tell her that.\n\n      Eleanor doesn't reply.   She turns and walks away.\n\n\n164     EXT. FUNERAL HOME (HALEY) - ALLEY - DAYS LATER                  164\n\n      The distance between Jacey and Doug is telling, as is the\n      difference in their behavior. Doug leans against a wall\n      with his hands in his pockets, his eyes cast down on his\n      shoes. Jacey roams the alley unable to stand still for\n      grief. He lights a fresh cigarette off the butt of\n      another.\n\n                               JACEY\n                Why?   Why didn't she tell us?\n\n      The FUNERAL DIRECTOR appears in the back door:\n\n                               FUNERAL DIRECTOR\n                Gentlemen...\n\n\n165     INT. FUNERAL HOME (HALEY) - DAY (MINUTES LATER)                 165\n\n      Helen's closed casket is surrounded by floral tributes.\n      Doug and Jacey enter from a door near the casket -- they\n      pause in reaction to the crowded parlor, it overflows\n      with mourners. Jacey explodes under his breath, so that\n      only Doug can hear:\n\n                              JACEY\n                Fucking hypocrites -- every one of\n                'em.\n\n      Jacey turns and walks out through the door they came in.\n      Doug walks over to his seat in the front row -- he\n      hesitates when he sees Lloyd Abbott standing in the back\n      of the parlor.\n\n                                                                   109.\n\n166      INT. HOLT HOME - DINING ROOM - NEXT DAY                          166\n\n       Doug sits at the table wrapping dishes in newspaper.\n       Jacey comes in with a framed photograph of their\n       grandmother.\n\n                               JACEY\n                 Do you want this picture of\n                 Grandma?\n\n                               DOUG\n                 You can have it.\n\n                                JACEY\n                 You sure?\n\n                                DOUG\n                 Yeah.\n\n       Jacey steps out of the dining room.\n\n\n167      INT. HOLT HOME - HELEN'S BEDROOM - DAY (SHORT                    167\nTIME LATER)\n\n       Jacey is packing Helen's things.   Doug steps in the\n       doorway.\n\n                               DOUG\n                 I'm starving. You want to go get\n                 something to eat?\n\n       Jacey is caught a bit off-guard by Doug's invitation,\n       then:\n\n                                JACEY\n                 Sure.\n\n\n168      INT. IRON SKILLET - NIGHT                                        168\n\n       Jacey and Doug are seated in a window booth.      They eat in\n       silence, then:\n\n                               DOUG\n                 You don't have to stick around.     I\n                 can handle things here.\n\n                               JACEY\n                 What about school?\n\n                                DOUG\n                 I hate Penn.   Always have.   You\n                 were right.\n\n                                                         (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                    110.\n\n168     CONTINUED:                                                     168\n\n                                JACEY\n                About what?\n\n                              DOUG\n                I should live my own life. Stop\n                being your shadow. I'm not like\n                you, Jacey -- I don't want to be\n                like you.\n\n                              JACEY\n                You going to stay here?   In Haley?\n\n                              DOUG\n                No. I was thinking New York. If\n                I'm going to really learn how to\n                design sets, that's the place to\n                do it.\n\n                              JACEY\n                       (long beat)\n                I'm sorry.\n\n                              DOUG\n                I know you are.\n                       (slight beat)\n                Did you have to get stitches?\n\n                                JACEY\n                Hmmm?\n\n                                DOUG\n                Your eyebrow.\n\n                              JACEY\n                My eyebrow -- yeah, ten stitches.\n\n                                DOUG\n                Sorry.\n\n      Doug takes an envelope out of his coat pocket and puts it\n      on the table.\n\n                              DOUG\n                Found this in one of the boxes in\n                the basement.\n\n                                JACEY\n                What is it?\n\n                              DOUG\n                A letter of agreement between\n                Lloyd Abbott and Dad. Dad sold\n                him the file drawer patent -- not\n                Mom.\n\n                                                      (CONTINUED)\n\n                                                               111.\n\n168     CONTINUED:   (2)                                              168\n\n      Jacey opens the envelope and studies the yellowed\n      document.\n\n                                   JACEY\n                           (re:   document)\n                A car?\n\n                                   DOUG\n                Yup.\n\n                              JACEY\n                Jesus Christ... he sold the patent\n                for a used car?\n\n                              DOUG\n                Used cars were the only kind of\n                cars around. The war was on --\n                everything was mobilized. They\n                stopped making new cars, they were\n                making tanks and bombers in\n                Detroit. And even Midwest Steel\n                wasn't making desks, they were\n                making ammo boxes and mortar\n                shells.\n\n                              JACEY\n                How did you get to be such an\n                expert on World War Two?\n\n                              DOUG\n                U.S. History -- high school. I\n                should be an expert, I had to take\n                the damn class twice. I guess Dad\n                needed a car and he figured who-\n                the-hell needed a full-suspension\n                file drawer?\n\n                              JACEY\n                       (reading aloud)\n                '1937 Desoto coupe convertible as\n                is.'\n\n                              DOUG\n                Wonder whatever happened to it?\n\n                              JACEY\n                He parked it at the bottom of the\n                lake.\n\n\n169     EXT. BUS DEPOT (DOWNTOWN HALEY) - NEXT DAY                    169\n\n      Doug follows Jacey to the door of the bus. Neither one\n      of them knows how to say good-bye, after an awkward beat:\n\n                                                     (CONTINUED)\n\n                                                                 112.\n\n169     CONTINUED:                                                      169\n\n                              JACEY\n                       (fighting back tears)\n                Do me a favor. Don't stand here\n                and wave good-bye... it makes me\n                think of Mom.\n\n                               DOUG\n                Okay.   See you.\n\n      Doug turns and walks away.   Jacey climbs onto the bus.\n\n\n170     EXT. ABBOTT HOME - STREET - DAY                                 170\n\n      Doug drives home from the bus depot in the old Plymouth.\n      He slows as he sees... the party tent in the Abbotts'\n      front yard (with its canvas sides rolled up).\n\n      Susan's third birthday party is underway, dozens of well-\n      dressed children and their parents are in attendance.\n      Alice (who is very pregnant) and Peter Vanlaningham and\n      Lloyd and Joan Abbott watch Susan riding her new pony, a\n      gift from her grandparents. A new generation of Abbott\n      parties has begun.\n\n\n171     EXT. HOLT HOME - DRIVEWAY - DAY                                 171\n\n      A \"For Sale\" sign has been placed on the front yard.\n      Doug pulls up the driveway in the Plymouth. He turns OFF\n      the ENGINE but doesn't get out of the car. Then he\n      STARTS the CAR again and backs out of the driveway.\n\n\n172     INT. ABBOTT HOME - TENT - DAY (SHORT TIME LATER)                172\n\n      Despite it being a birthday party for a three-year-old,\n      this is very much a grown-up affair. The band is\n      playing, the adults are dancing, Joan Abbott is flitting\n      from guest-to-guest, Alice is dutifully silent while\n      Peter dominates the talk at their table, Lloyd is with\n      his cronies. Doug enters the tent -- one-by-one the\n      guests take notice of him as he works his way across the\n      tent -- and all are very aware of his uninvited presence\n      by the time he reaches Lloyd Abbott. Lloyd scrutinizes\n      Doug, then:\n\n                              LLOYD\n                What do you want?\n\n                              DOUG\n                I want to talk to you.\n\n                                                                 113.\n\n173     INT. ABBOTT HOUSE - DEN - DAY                                   173\n\n      Doug follows Lloyd into the dark-paneled room.\n\n                                 LLOYD\n                Shut the door.\n\n      Doug closes the door.   Lloyd lights a cigarette.\n\n                                 LLOYD\n                Smoke?\n\n                                 DOUG\n                No thanks.\n\n                                 LLOYD\n                Sit down.\n\n                              DOUG\n                I don't want to.\n\n                              LLOYD\n                Then don't.\n                       (slight beat)\n                I'm sorry about your mother.\n\n                              DOUG\n                Sorry about what?\n\n                              LLOYD\n                You didn't know your mother at all\n                if you think someone like me\n                would've ever stood a chance with\n                someone like her. That just goes\n                to show you how stupid this town\n                is -- that they'd believe she\n                slept with me. That'd make\n                Charlie laugh. Your old man was\n                my best friend. He used to call\n                me 'Egg-head' -- hell, everybody\n                did. And back then everybody knew\n                that Egg-head Abbott didn't stand\n                a snowball's chance in hell with\n                Helen Riley. Of course, that was\n                all before I became Lloyd Abbott\n                -- Mr. Abbott. That was back when\n                I still had chicken shit on my\n                shoes and twelve cents in my\n                pocket. Charlie Holt was the only\n                one good enough for Helen. I used\n                to spy on 'em -- yup, I did.\n                       (fixes a drink)\n                Used to watch them sit on the\n                front porch of her house -- your\n                house -- and watch 'em talk.\n                              (MORE)\n\n                                                       (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                   114.\n\n173     CONTINUED:                                                    173\n\n                              LLOYD (CONT'D)\n                And talk. I never knew what to\n                say to a girl. Never could just\n                talk. Could dance, could listen\n                to the radio. But I couldn't\n                talk... except with your mother,\n                except with Helen. I talked more\n                to her after your dad died than\n                I'd ever talked to any woman\n                before then -- or since then.\n                Jesus, I talked. Just like this.\n                Just like right now. Just pouring\n                out. Helen would listen and\n                whatever I said, she'd never make\n                me feel bad or ignorant or guilty.\n                I mean... for Christ's sake, she\n                never blamed me for what happened\n                at the lake, for letting Charlie\n                drive out on that ice. She never\n                did anything but try to make me\n                hurt less and I...\n\n      Lloyd is startled by Joan as she opens the door.\n\n                              JOAN\n                Lloyd...?\n\n                              LLOYD\n                Get out of here!\n\n                              JOAN\n                It's time for Susie's birthday\n                cake.\n\n                              LLOYD\n                       (exploding)\n                Goddammit, Joan, go way! Get the\n                hell out of here! Leave me alone!\n\n      He hurls his GLASS at her and it SHATTERS on the door\n      jamb. Joan recoils in dumb-founded shock and backs out\n      of the doorway. Lloyd fumes over and slams the door shut\n      in her face. He leans against the door and catches his\n      breath.\n\n                              LLOYD\n                I wanted sons -- isn't that funny?\n                I wanted sons and I got three\n                daughters. I wanted a woman I\n                could talk to and I got a woman\n                whose ears are stuffed full of\n                money and Percodan. But I got the\n                chicken shit off my shoes.\n                              (MORE)\n\n                                                     (CONTINUED)\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                    115.\n\n173     CONTINUED:   (2)                                               173\n\n                              LLOYD (CONT'D)\n                My shoes are clean.\n                       (slight beat)\n                I know that's what Jacey thinks.\n                I could always tell by the way he\n                looked at me -- even when he was a\n                little boy -- like I owed him\n                something. But, goddammit, he's\n                wrong. That bet was your father's\n                idea and I never meant your mother\n                any harm. I would've done\n                anything for her -- anything. I\n                loved her. But the only thing she\n                ever wanted from me was just for\n                me to leave her alone.\n\n      He pours himself a fresh drink, then turns to Doug:\n\n                              LLOYD\n                So, what do you want?\n\n                              DOUG\n                I want to find Pam -- and you're\n                going to tell me where she is.\n\n\n174   EXT. BROWNSTONE APARTMENT BUILDING (CHICAGO) - THAT         174\n      NIGHT\n\n      Doug navigates the busy sidewalk to the entrance of the\n      building. He checks the number over the door to the\n      address on the scrap of paper in his hand.\n\n\n175   EXT. APARTMENT BUILDING DOORWAY - ELEANOR'S APARTMENT - 175\n      NIGHT (MINUTES LATER)\n\n      Doug knocks on the door. Eleanor opens it, she's dressed\n      for work in her stewardess uniform. She's obviously\n      surprised to find Doug on her doorstep, but she greets\n      him with a warm smile.\n\n                                DOUG\n                Where is she?\n\n\n176     EXT. DEPARTMENT STORE DISPLAY WINDOW (CHICAGO) -               176\n      SIDEWALK - NIGHT (SHORT TIME LATER)\n\n      Pamela dresses a mannequin in the display window. As she\n      moves behind the mannequin to fasten a garment she sees\n      Doug standing on the other side of the glass watching her\n      from the sidewalk. Doug writes a message on the plate\n      glass window with his index finger (printing the letters\n      in reverse so that the message is legible from Pam's\n      POV); his message reads: \"I love you.\"\n\n        INVENTING THE ABBOTTS - Rev. 3/20/96                     116.\n\n177   EXT. DEPARTMENT STORE ENTRANCE - SIDEWALK - NIGHT             177\n      (MOMENTS LATER)\n\n      Pamela comes out of the store via the revolving door and\n      finds Doug waiting for her on the sidewalk.\n\n                              PAMELA\n                How can you...?\n\n                              DOUG\n                How can I what?\n\n                              PAMELA\n                Ever... forgive me?\n\n                              DOUG\n                You always loved me no matter what\n                I did, right?\n\n                                 PAMELA\n                Yeah.\n\n                              DOUG\n                Maybe that's how I love you -- no\n                matter what. That's the best kind\n                of love, you know?\n\n                              PAMELA\n                But... oh, Jesus... how do we\n                start all over again?\n\n      Pam's eyes fill with tears. Doug steps over to her and\n      embraces her tenderly, holding her close.\n\n                               DOUG\n                There.   We're doing it.\n\n                              PAMELA\n                       (through her tears)\n                Doing what?\n\n                                 DOUG\n                Starting over.     So, what are you\n                doing tonight?     You want to go\n                out?\n\n                                 PAMELA\n                You're crazy.\n\n                              DOUG\n                Some people never change.\n\n      He wipes her tears from her cheeks with his fingers, then\n      gives a short, but sweet, kiss. Then he smiles:\n\n                                                      (CONTINUED)\n\n                                          117.\n\n177   CONTINUED:                                 177\n\n                    DOUG\n              Hi.\n\n                    PAMELA\n              Hi.\n\n                              FADE OUT.\n\n\n\n\n                    THE END\n\n\n\n\n\nInventing the Abbotts\nWriters :   Ken Hixon\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:27:46.155703"}