{"title": "Jackie Brown", "film_link": "/Movie Scripts/Jackie Brown Script.html", "script_link": "/scripts/Jackie-Brown.html", "info_raw": "\n\nJackie Brown Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.20 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Quentin Tarantino\nGenres  Comedy  Crime\nScript Date : March 1997\n\nRead \"Jackie Brown\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nJACKIE BROWN\n\n\n   \n                          Jackie Brown\n                                \n                 Screenplay by Quentin Tarantino\n   \n   \n   \n   OPENING CREDITS\n   \n   \n   INT. LOS ANGELES INTERNATIONAL AIRPORT - DAY\n   \n   We hear the rhythm of funky seventies SOUL MUSIC.\n   \n   Then SHE steps into FRAME.\n   \n   She is JACKIE BROWN, a stewardess dressed in her CABO AIR\n   uniform. (A little shuttle airline that flies from Los\n   Angeles to Cabo San Lucas. Approximate flight time: forty\n   five minutes)\n   \n   Jackie stands still as a people-mover slowly inches her\n   through the airport. The CREDITS APEAR and DISAPPEAR in\n   front of her.\n   \n   Jackie Brown is a very attractive black woman in her mid\n   forties, though she looks like she's in her mid-thirties.\n   \n   The people-mover reaches the end of the line, she steps\n   off.\n   \n   She breezes through Customs and we follow her with a\n   STEDICAM as she strides through the airport... She gets\n   to her gate disappears inside the plane for a moment\n   comes back out sans flight bag picks up the microphone.\n   \n                       JACKIE\n                   (into mike)\n             Flight 710 Cabo San Lucas, now\n             boarding Gate 12, first class only.\n   \n   With a smile on her face, she collects passengers'\n   boarding passes as they board the plane.\n   \n                                               FADE TO BLACK\n   \n   \n   TITLE CARD\n   \n   \"ORDELL ROBBIE\"\n   \n                                               FADE UP ON:\n   \n   \n   EXT. FIRING RANGE - DAY\n   \n   VIDEO\n   \n   A chorus line of six beautiful bikini-clad women, all\n   holding different automatic weapons, BLASTING away.\n   \n   The cheap VIDEO TITLES to:\n   \n   \"CHICKS WHO LOVE GUNS\"\n   \n   Play over this image.\n   \n   One bikini beauty is singled out. She's a gorgeous\n   brunette named SIDNEY. Sidney stands facing camera\n   holding a TEC-9 and describing it.\n   \n                       SIDNEY\n                   (to camera)\n             Hi, I'm Sidney. And I love to TEC-9.\n             The popular TEC-9 is advertised by\n             its makers as being tough as the\n             toughest customer.\n   \n   SIDNEY'S STATISTICS: Age, height, measurements, date of\n   birth, appear at the bottom left-hand corner. As Sidney\n   continues her sales pitch/demonstration, a BLACK MAN'S\n   VOICE begins talking over the video.\n   \n                       BLACK MAN (O.S.)\n             That's a TEC-9. It's a cheap ass\n             spray gun outta South Miami.\n   \n   After a CLOSEUP of the TEC-9, Sidney FIRES the weapon.\n   \n                       BLACK VOICE (O.S.) (CONT'D)\n             Cost three-eighty retail. I get them\n             for two hundred and sell 'em for\n             eight.\n   \n   \n   INT. MELANIE'S BEAHC APARTMENT - NIGHT\n   \n   The Black Voice belong to forty-five-year old ORDELL\n   ROBBIE.\n   \n   Ordell wears clothes nice and likes wearing nice clothes.\n   Stylish, athletic wear (Reebok), heavy, black leather\n   jackets (Hugo Boss), warm-colored berets and baseball\n   caps to cover his balding head are Ordell's \"look.\" At\n   this moment Ordell's wearing an open silk shirt.\n   \n   Ordell narrates the video playing on the big-screen V.\n   (the most expensive thing in the apartment). He holds a\n   cocktail in one hand (screwdriver, his drink of choice)\n   and the remote control in the other, pacing the floor in\n   his I-can-talk-anybody-into-anything voice.\n   \n   LOUIS GARA, who looks like he does his shopping at the\n   Salvation Army (dressed in a Hawaiian shirt and\n   dungarees), sits on the sofa staring blankly at the\n   video, drinking Jack Daniels on ice. Louis, white, also\n   in his mid forties, has lived over half of his life in\n   penal institutions. The experience has affected both his\n   body language and his thought process.\n   \n   While acutely aware of the rhythm of life inside a\n   correction facility, in the real world his timing is\n   thrown. It's like a song he doesn't know the lyrics to\n   but attempt to sing anyway.\n   \n   The third person watching the video is the person who\n   lives in this apartment, MELANIE RALSTON. Melanie, thirty-\n   three, is a tanned, blonde, California beach bunny. Like\n   the kind you se in the old Crown International movies\n   from the seventies like \"Pom Pom Girls\" \"Malibu Beach\"\n   and \"Beach Girls,\" except Melanie is older than any of\n   those girls ever are. She's dressed in her Melanie-\n   uniform of stringy Levis cutoffs and a stringy bra top.\n   So far Melanie has been able to make a living out of\n   lying in the sun, always finding a generous, wealthy man\n   more than willing to pay her rent and pick up her tabs.\n   In her prime (twenty two) it was Japanese industrialists,\n   film production guys, and Middle Eastern businessmen who\n   kept Melanie. And it was places like the Bahamas,\n   Acapulco, and the Virgin Islands where they kept her.\n   \n   But now, at thirty three, she lives in an apartment in\n   Hermosa Beach, California that Ordell pays for an drops\n   in and out of. She's curled up in a reclining chair,\n   smoking weed from a pipe, reading Movieline Magazine and\n   paying no attention to the video.\n   \n                       ORDELL\n             This TEC-9? They advertise it as\n             being the most popular gun in\n             American crime. Can you believe that\n             shit? It actually says that on the\n             little booklet that comes with it.\n             \"Most Popular Gun in American Crime,\"\n             like they're proud of that shit.\n   \n   Ordell hits the fast-forward on his remote control.\n   \n   Sidney is rushed off the screen and replace by CINDY, a\n   pretty, blonde bodybuilder clad in a red, white and blue\n   bikini, holding a Styer Aug.\n   \n                       ORDELL (CONT'D)\n             Check out this body-builder chick...\n             Now see what she got. That's a Styer\n             aug. Styer Aug's a bad motherfucker.\n             Listen.\n   \n   Ordell punches up the volume.\n   \n   Cindy BLASTS the Styer Aug, loud.\n   \n   Ordell imitates the sound of the weapon.\n   \n                       ORDELL (CONT'D)\n             Shit's expensive, man. Comes from\n             Austria. My customers don't know shit\n             about it, so there ain't no demand.\n                   (to Melanie)\n             Baby, I could use some more ice.\n   \n   Melanie puts down the magazine, takes his cocktail glass\n   from him and moves to the kitchen.\n   \n                       ORDELL (CONT'D)\n             But put that bad boy in a flick,\n             every motherfucker out there want\n             one. I'm serious as a heart attack.\n             Them Hong Kong movies came out, every\n             nigga gotta have a forty-five. And\n             they don't want one, they want two,\n             cause nigga want to be \"The Killer.\"\n             What they don't know, and that movie\n             don't tell you is a .45 has a serious\n             fuckin' jammin' problem. I always try\n             and steer a customer towards a 9-\n             millimeter. Damn near the same\n             weapon, don't have half the jammin'\n             problems. But some niggas out there,\n             you can't tell them anything. They\n             want a .45. The killer had a .45,\n             they want a .45.\n   \n   Melanie comes back, hands Ordell his screwdriver, then\n   sits where she was.\n   \n                       ORDELL (CONT'D)\n             Thanks, Baby.\n   \n                       LOUIS\n             Who's your partner?\n   \n   Ordell sits down on the couch. Melanie's reading\n   \"Movieline Inside\" magazine.\n   \n                       ORDELL\n             Mr. Walker. He runs a fishing boat in\n             Mexico. I deliver the merchandise to\n             him, gets it to my customers. On all\n             my bulk sales, anyway. Nigga didn't\n             have a pot to piss in or a window to\n             throw it out 'fore I set 'em up. Now,\n             motherfucker's rollin' in cash. He\n             got himself a yacht, with all kinds\n             of high tech navigational shit on it.\n                   (back to video)\n             AK-47, the very best there is.\n   \n   GLORIA, a tall, Amazonian, bikini-clad, black woman faces\n   camera and describes the AK-47.\n   \n                       ORDELL (CONT'D)\n             When you absolutely, positively,\n             gotta kill every motherfucker in the\n             room, accept no substitute. That\n             there is the Chinese one. I pay eight-\n             fifty and double my money.\n   \n   The phone rings.\n   \n                       ORDELL(CONT'D)\n             Get that for me, will ya baby?\n   \n                       MELANIE\n             You know it's for you.\n   \n   Ordell just stares at her.\n   \n                       ORDELL\n             Girl, you better not make me go over\n             there and put my feet to ya.\n   \n   Louis keeps staring at he screen.\n   \n   Melanie gets up, goes over to the counter that separates\n   the living room from the kitchen, picks up the phone,\n   says:\n   \n                       MELANIE\n             Hello.\n   \n   Puts the phone down and says;\n   \n                       MELANIE (CONT'D)\n             It's for you.\n   \n   Before Ordell knows it, Melanie is back in the reclining\n   chair, reclining back all the way.\n   \n   Ordell, pissed, looks at her a moment before taking the\n   phone.\n   \n                       ORDELL\n                   (into phone)\n             Yeah.\n                   (pause)\n             Hey, Junebug, what's up\n   \n   Louis sits on he couch, drinking his Jack Daniels,\n   watching the video.\n   \n   Melanie lies back on the reclining chair, takes a hit off\n   her pipe, then says in a 'holding in smoke' voice;\n   \n                       MELANIE\n                   (referring to the tape)\n             It's boring, isn't it?\n   \n                       LOUIS\n             I can sit through it once.\n   \n                       MELANIE\n             He thinks he's Joe Gunn now.\n   \n                       LOUIS\n             I'm impressed. He knows a lot.\n   \n                       MELANIE\n             He's just repeating shit he\n             overheard. He ain't any more a gun\n             expert than I am.\n   \n   Holding up her pipe.\n   \n                       MELANIE\n             Want a hit?\n   \n                       LOUIS\n             Sure.\n   \n   Louis takes a hit off the pipe.\n   \n                       MELANIE\n             When did you get out of jail?\n   \n                       LOUIS\n             Four days ago.\n   \n                       MELANIE\n             Where at?\n   \n                       LOUIS\n             Susanville.\n   \n                       MELANIE\n             How long?\n   \n                       LOUIS\n             Two months shy of four years.\n   \n                       MELANIE\n             Four years?\n   \n                       LOUIS\n             Uh-huh.\n   \n                       MELANIE\n             What for?\n   \n                       LOUIS\n             Bank robbery.\n   \n                       MELANIE\n             Really, I'm impressed.\n   \n   Louis takes a drink of whiskey.\n   \n                       MELANIE\n             Four years that's a long fuckin time.\n   \n   Louis nods his head in agreement.\n   \n   Ordell hangs up the phone.\n   \n   Ordell comes back, sitting down on the other side of\n   Louis.\n   \n                       ORDELL\n             See, what did I tell you? Man in New\n             York wants a 9 millimeter Smith and\n             Wesson Model 5946. Why does he want\n             it? It's the gun that nigga on \"New\n             York Undercover\" uses. Because of\n             that nigga, I can sell it to this\n             nigga for twelve-fifty.\n   \n                       LOUIS\n             What's your cost?\n   \n                       ORDELL\n             As low as two.\n   \n                       LOUIS\n             Are you serious?\n   \n                       ORDELL\n             That's what I been tellin' you. Start\n             adding these motherfuckin' figures\n             up, and you tell me this ain't a\n             business to be in.\n   \n   The phone rings again.\n   \n   Ordell looks at Melanie.\n   \n   Melanie looks at Ordell.\n   \n   They have a bit of a staring contest before she gets up\n   and gets the phone.\n   \n                       ORDELL (CONT'D)\n             I got me five M-60 machine guns.\n             These came straight from the Gulf\n             War. I sold me three of them so far,\n             twenty grand a piece.\n   \n                       LOUIS\n             That's good money.\n   \n                       ORDELL\n             Louis, this is it, man. I'm gonna\n             make me a million dollars out of\n             this. I already got me a half-a-\n             million sittin' in Mexico. When I do\n             this last delivery, I'm gonna make me\n             another half-million.\n   \n                       LOUIS\n             Then what?\n   \n                       ORDELL\n             I get out. Spend the rest of my life\n             spending.\n   \n   Melanie sits back down in he chair.\n   \n                       ORDELL (CONT'D)\n             Who is it?\n   \n                       MELANIE\n             It's Beaumont.\n   \n   \n   KITCHEN\n   \n   Ordell, drink in hand, picks up the receiver.\n   \n                       ORDELL\n                   (into phone)\n             Beaumont¢Ordell. What's the problem?\n                   (pause)\n             What the fuck you doin' in jail?\n                   (pause)\n             What the fuck you doin' that for?\n                   (pause)\n             Ain't you got better sense than to be\n             drivin' drunk carrying a goddam\n             pistol?\n   \n   He listens to Beaumont on the other line - it's obvious\n   Beaumont's starting to freak out. Ordell changes his\n   tone.\n   \n                   ORDELL (CONT'D)\n             - Beaumont. Beaumont. Listen to me.\n             Number one, you need to chill out,\n             nigga. Bad as this shit is, this shit\n             ain't as bad as you think it is.\n                   (pause)\n             Course you're scared. That's what\n             these motherfuckers get paid for\n             scarin' the shit outta ya. That's\n             their job. And my job is to get you\n             the fuck home so let me tell you what\n             is gonna happen... May I speak?...\n             Thank you... You gonna spend the\n             night in jail; it's too late to get\n             you out now. Tomorrow, they gonna\n             take you into court. I'm gonna be\n             there. Judge gonna set your bail. I'm\n             gonna pay your bail, they gonna cut\n             you loose. By tomorrow night, you'll\n             be back home, I promise.\n                   (pause)\n             So just calm your ass down, and I'll\n             see you tomorrow.\n                   (pause)\n             You owe me a helluva lot more than\n             one, nigga.\n                   (laughs)\n             See you.\n   \n   Ordell hangs up the phone.\n   \n                                               CUT TO:\n   \n   \n   EXT. CHERRY BAIL BONDS - DAY\n   \n   The store front window of Cherry Bail Bonds in Inglewood,\n   California. The name of the business is spelled out on\n   the window, which also includes a drawing of a fat red\n   cherry.\n   \n   Ordell's BLACK MERCEDES CONVERTIBLE pulls up.\n   \n   Ordell in the driver's seat. Louis in shotgun position.\n   \n   \n   INT. CHERRY BAIL BONDS - DAY\n   \n   Inside Cherry Bail Bonds, looking out through the picture\n   window. We can read the name on the glass backwards.\n   Ordell and Louis appears in the window and enter the\n   building. Ordell carries a L.A. Lakers athletic bag.\n   \n   An unidentified MALE VOICE, obviously on the telephone,\n   can be heard.\n   \n   Ordell goes toward the voice and tells Louis to \"hang\n   back.\"\n   \n                       MALE VOICE (O.S.)\n             ... the judge doesn't give a fuck\n             about that. He's ready to habitualize\n             you. Is that what you want - you\n             wanna look at ten years?\n   \n   The voice belong to MAX CHERRY, bail bondsman. Max, a\n   regular-Joe-type white guy in his fifties, sits behind\n   his desk talking on the phone. His eyes raise as he sees\n   Ordell approach him.\n   \n                       MAX (CONT'D)\n                   (on phone)\n             Just overnight is all. Tomorrow I'll\n             get you out, I promise. But it means\n             I gotta pick you up tonight.\n   \n   Ordell motion to the chair in front of Max's desk. Max\n   motions for Ordell to take a seat.\n   \n                       MAX (CONT'D)\n                   (on phone)\n             Reggie, there ain't no two ways about\n             it. You're spending the night in\n             jail, but I already told you I'll get\n             you out tomorrow. Now where are you?\n                   (pause)\n             You're at your mother's house, aren't\n             you?\n   \n   Ordell lights up a cigarette. (Viceroy).\n   \n   He notices a picture on the wall of Max with his arm\n   around a big, powerfully built black man. They're both\n   grinning.\n   \n   Louis pours himself some coffee from a coffeemaker into a\n   small, white styrofoam cup. He picks up a jar of powdered\n   non-dairy creamer that's so dry he has to break off a\n   rock. Louis adds the rock of coffeemate to his beverage.\n   \n                       MAX (CONT'D)\n                   (on phone)\n             Okay. Just stay put till I come for\n             you.\n                   (pause)\n             Reggie, do yourself a really big\n             favor and be there when I get there.\n   \n   He hangs up the phone.\n   \n   Ordell sits in front of the desk, smiling at him and\n   smoking.\n   \n                       MAX (CONT'D)\n             How can I help you?\n   \n                       ORDELL\n                   (indicating the Viceroy)\n             Where would you like me to put my\n             ash?\n   \n   Max looks at him for a moment.\n   \n                       MAX\n             Use that coffee cup on the desk.\n   \n   Ordell picks up the coffee cup, which still has a little\n   bit of coffee in it, and flicks his ash.\n   \n                       ORDELL\n             And I need me a bond for ten\n             thousand.\n   \n   Max throws a look past Ordell to Louis.\n   \n                       ORDELL (CONT'D)\n             Oh, that's just my white friend,\n             Louis. He's got nothing to do with my\n             business. We just hangin together.\n             We're on our way to a cocktail\n             lounge.\n   \n   From across the room, Louis nods his head in Max's\n   direction.\n   \n   Max looks at him a moment, then back to Ordell.\n   \n                       ORDELL (CONT'D)\n                   (returning to the photo)\n             Who's that big Mandingo nigga you\n             gotcha arm around?\n   \n   Max looks at him a moment and says;\n   \n                       MAX\n             That's Winston. He works here.\n   \n                       ORDELL\n             He's a big one. You two tight?\n   \n                       MAX\n             Yeah.\n   \n                       ORDELL\n             It was our idea to take the picture,\n             wasn't it?\n   \n   Max looks at Ordell, getting his drift, then says;\n   \n                       MAX\n             So, you want a ten-thousand dollar\n             bond. What've you got for collateral?\n   \n                       ORDELL\n             Gonna have to put up cash.\n   \n                       MAX\n             You have it with you?\n   \n   Ordell picks up his Lakers bag and puts it in the empty\n   chair next to him.\n   \n                       ORDELL\n             It's in my bag.\n   \n                       MAX\n             You have cash. What do you need me\n             for?\n   \n                       ORDELL\n             C'mon, you know how they do. Black\n             man comes in with ten thousand, they\n             wanna fuck with 'em. First off, they\n             gonna wanna know where I got it.\n             Second, they gonna keep a big chunk\n             of it - start talkin' that court cost\n             shit. Fuck that shit, Jack. I'll go\n             through you.\n   \n                       MAX\n             Cost you a thousand for the bond.\n   \n                       ORDELL\n             I know that.\n   \n   Louis just stands, feeling uncomfortable, in the other\n   room drinking coffee.\n   \n                       MAX\n             Who's it for? A relative?\n   \n                       ORDELL\n             Fella named Beaumont. They have him\n             up at county. It started out drunk\n             driving, but they wrote it up\n             \"possession of a concealed weapon.\"\n             Dumb monkey-ass had a pistol on him.\n   \n                       MAX\n             Ten thousand sounds high.\n   \n                       ORDELL\n             They ran his name and got a hit. He's\n             been in before. Besides, Beaumont's\n             from Kentucky, and I think they're\n             prejudiced against black men from the\n             South out here.\n   \n                       MAX\n             He takes off and I gotta go to\n             Kentucky to bring him back, you pay\n             the expenses.\n   \n                       ORDELL\n             You think you could do that?\n   \n   Max taking papers out of the drawer...\n   \n                       MAX\n             I've done it.\n   \n   ... picking up the pen...\n   \n                       MAX (CONT'D)\n             What's his full name?\n   \n                       ORDELL\n             Beaumont. That's the only name I\n             know.\n   \n   Max looks at Ordell, but doesn't ask him the obvious\n   question.\n   \n   Max picks up the phone.\n   \n                       MAX\n                   (on phone)\n             Records office.\n   \n   Max on hold, looks at Ordell.\n   \n   Ordell smiles.\n   \n                       MAX (CONT'D)\n                   (back on the line)\n             Hello, this is Max Cherry. Cherry\n             Bail Bonds. Who's this?\n                   (pause)\n             Hi, Vicki. Look, Vicki, I need you to\n             look up the booking card and rough\n             arrest on a defendant named Beaumont.\n                   (pause)\n             That's all I have. I believe it's a\n             surname but I'm not sure. Thanks.\n   \n   Louis enters the area, standing over Ordell.\n   \n                       LOUIS\n             I'm going to wait in the car.\n   \n                       ORDELL\n             Sure.\n                   (to Max)\n             We almost done, ain't we?\n   \n                       MAX\n             Getting there.\n   \n                       ORDELL\n             You go wait in the car. Wait a\n             minute.\n   \n   Ordell pulls out a heavy-duty keychain with a shitload of\n   keys on it.\n   \n                       ORDELL\n             Take the keys, man. Listen to music.\n   \n                       LOUIS\n             Which one is for the car?\n   \n   Ordell finds it. While he goes through the keys, Vicki\n   comes back on the line.\n   \n   Max speaks with her as he fills out his papers.\n   \n                       ORDELL\n                   (holding a key)\n             This one's for the ignition...\n                   (holding a little black\n                   box)\n             ... but you gotta hit this thing to\n             shut the alarm off and unlock the\n             door.\n   \n                       LOUIS\n             What do I do?\n   \n                       ORDELL\n             You ain't got to do nothing. Just\n             point at it and push the button.\n             You'll hear the car go \"bleep.\" That\n             means the alarm's off and the doors\n             are open.\n   \n                       LOUIS\n             Okay.\n   \n                       ORDELL\n             Now play the volume as loud as you\n             want but don't touch my levels. I got\n             them set just the way I want 'em.\n   \n   Louis nods and goes out.\n   \n   \n   EXT. CHERRY BAIL BONDS - DAY\n   \n   Louis walks out of the office. He goes up to Ordell's\n   black Mercedes. He points the little black box at it. The\n   car goes BLEEP.\n   \n   He gingerly approaches it, opens the door and climbs\n   inside.\n   \n   \n   INT. MAX CHERRY'S OFFICE - DAY\n   \n   Max hangs up the phone.\n   \n                       MAX\n                   (to Ordell)\n             Beaumont Livingston.\n   \n                       ORDELL\n             Livingston, huh?\n   \n                       MAX\n             On his prior, he served nine months,\n             and he's working on four years'\n             probation.\n   \n                       ORDELL\n             You don't say.\n   \n                       MAX\n             Do you know what he's on probation\n             for?\n   \n                       ORDELL\n             Haven't a clue.\n   \n                       MAX\n             Possession of unregistered machine\n             guns.\n   \n                       ORDELL\n             Will they consider this a violation\n             of his probation?\n   \n                       MAX\n             They do consider this a violation of\n             his probation. Your boy's looking at\n             ten years, plus the concealed weapon.\n   \n                       ORDELL\n             Man, he won't like that. Beaumont\n             don't got a doin' time disposition.\n   \n                       MAX\n             I need your name and address.\n   \n                       ORDELL\n             Ordell Robbie. O-R-D-E-L-L. R-O-B-B-I-\n             E. 1436 Florence Boulevard. Compton\n             90222.\n   \n                       MAX\n             House or apartment?\n   \n                       ORDELL\n             House.\n   \n                       MAX\n             Now I need you to count your money.\n   \n   Ordell hands him the Lakers bag. Max takes the money out\n   putting it on the desk.\n   \n                       ORDELL\n             Hope you don't mind me askin' where\n             you keepin' my money till I get it\n             back. In your drawer?\n   \n   Max begins counting it.\n   \n                       MAX\n             Across the street a Great Western. It\n             goes in a trust account. You'll need\n             to fill out an Application for\n             Appearance Bond, an Indemnity\n             Agreement, a Contingent Promissory\n             Note. That's the one, if Beaumont\n             skips and I go after him, you pay the\n             expenses.\n   \n                       ORDELL\n             Beaumont ain't going nowhere.\n                   (he takes a pen out of\n                   his pocket)\n             Where do I sign?\n   \n   Max pulls the forms from his desk, and lays them in front\n   of Ordell. Max goes back to counting the money. Ordell\n   reads the first agreement then says;\n   \n                       ORDELL (CONT'D)\n                   (reading the form)\n             Hey, Max.\n   \n                       MAX\n                   (still counting money)\n             Yes.\n   \n                       ORDELL\n                   (still reading form)\n             I was wondering. What if before the\n             court date gets here, Beaumont gets\n             hit by a bus or something and dies.\n                   (he puts the form down\n                   and looks at Max)\n             I get my money back, don't I?\n   \n                                               CUT TO:\n   \n   \n   A BLACK FINGER\n   \n   Pressing a BLACK BUTTON next to the name, \"BEAUMONT\n   LIVINGSTON\".\n   \n   \n   INT. BEAUMONT'S APARTMENT - NIGHT\n   \n   BEAUMONT LIVINGSTON, wearing no shirt, sweatpants, and\n   smoking a fatty answers the intercom, which buzzes\n   loudly. We can hear JAY LENO interviewing a CELEBRITY on\n   TV OFFSCREEN.\n   \n                       BEAUMONT\n                   (into the speaker)\n             Who is it?\n   \n   \n   EXT. BEAUMONT'S APARTMENT - NIGHT\n   \n   Ordell stands outside the security gate of Beaumont's\n   Hollywood apartment.\n   \n   EXTREME CLOSEUP - Ordell's lips talking into the intercom\n   speaker.\n   \n                       ORDELL\n             It's your benefactor, nigga. Buzz me\n             up.\n   \n   EXTREME CLOSEUP - Beaumont's finger pressing the entry\n   button.\n   \n   EXTREME CLOSEUP - The doorknob on the security gate,\n   BUZZING. Ordell's hand comes into frame twisting it open.\n   \n   Beaumont opens his apartment door, fatty between his\n   fingers. He sees Ordell approach.\n   \n   Ordell greets him, arms spread out in hug mode, with a\n   big smile across his face.\n   \n                       ORDELL\n             Look at you and your free ass. Come\n             over and give me a motherfuckin' hug.\n   \n   Ordell and Beaumont embrace.\n   \n                       BEAUMONT\n             What the fuck can I say? I'm serious,\n             man. What the fuck can I say? Thank\n             you... thank you... thank you.\n   \n                       ORDELL\n             Who was there for your ass?\n   \n                       BEAUMONT\n             You were there for me.\n   \n                       ORDELL\n             Who?\n   \n                       BEAUMONT\n             You.\n\n   Laughing his hustler's laugh and bumping Beaumont's fist\n   hard.\n   \n                       ORDELL\n             You goddam right!\n   \n   Beaumont laughs.\n   \n                       ORDELL\n             You see,ïit works like this. You get\n             your ass in trouble, I get your ass\n             out. That's my job. And I don't mind\n             tellin ya, nigga, it's steady work.\n   \n                       BEAUMONT\n             I'm still scared as a motherfucker,\n             Ordell. They talkin' like they\n             serious 'bout me doin' that machine\n             gun time.\n   \n                       ORDELL\n             Naw, man. They just tryin' to put a\n             fright in your ass.\n   \n                       BEAUMONT\n             If that's what they want to do,\n             they're doin' it.\n   \n                       ORDELL\n             How old is that machine gun shit?\n   \n                       BEAUMONT\n             Three years.\n   \n                       ORDELL\n             Three years. That crime's old, man.\n             They ain't got room in prison for all\n             the motherfuckers out there killin'\n             people. How they gonna find room for\n             you?\n   \n                       BEAUMONT\n             That's not what they're tellin' me.\n   \n                       ORDELL\n             That's why they call it \"fuckin' with\n             ya.\" Now you wanna hear how we\n             retaliate?\n   \n   Beaumont takes a hit off the fatty and nods his head.\n   \n                       ORDELL (CONT'D)\n             Tomorrow I pick you up, take you to\n             Century City, meet my lawyer. Now let\n             me tell you a little bit about my\n             lawyer. His name is Stacin Goins and\n             this nigga is a junkyard dog! He's my\n             own private Johnie Cochran. In fact,\n             he'd kick Johnie Cochran's ass. And\n             like Johnie Cochran, dude hates\n             fuckin' cops. I'm serious, this man\n             lives to fuck with the police. So as\n             a favor, I had him look at your case.\n             Stacin told me you aint got shit to\n             worry about. They just fuckin' wit\n             ya. So we sic the junkyard dog on\n             their ass, make 'em -\n             (he bumps fist with Beaumont)\n             ... Stop fuckin' wit ya!\n   \n   Beaumont gesture inside his apartment.\n   \n                       BEAUMONT\n             Hey, c'mon in, man. I was just - you\n             know - smokin' a fatty, watchin' TV.\n   \n                       ORDELL\n             Naw, man. I gotta be someplace. I was\n             kinda hopin you could come with me.\n   \n                       BEAUMONT\n             What'd ya mean?\n   \n                       ORDELL\n             Look, I hate to be the kinda nigga,\n             does a nigga a favor - then BAM -\n             hits a nigga up for a favor in\n             return. But I'm afraid I gotta be\n             that kinda nigga.\n   \n                       BEAUMONT\n             What?\n   \n                       ORDELL\n             I need a favor.\n   \n                       BEAUMONT\n             That requires me goin out tonight?\n   \n                       ORDELL\n             A bit.\n   \n                       BEAUMONT\n             Aaaaawww man, I wasn't plannin' on\n             goin no place. It's twelve o'clock,\n             man. I'm home, I'm high -\n   \n\n                       ORDELL\n             Why the fuck you at home? Cause I\n             spent ten thousand dollars gittin'\n             your ass home.\n                   (changes tone)\n             Look, I gotta problem. I need help,\n             and you can help me.\n   \n   This has the desired effect.\n   \n                                               TIME CUT:\n   \n   \n   WITH ORDELL WAITING OUTSIDE THE DOOR\n   \n   Beaumont comes out of the apartment, sporting Nikes and a\n   Queen Latifah t-shirt. He locks his front door and walks\n   with Ordell to his car. They talk the whole way. We\n   STEDICAM in front of them the whole way.\n   \n                       BEAUMONT\n             What's the problem?\n   \n                       ORDELL\n             Well, it ain't so much a problem a a\n             situation. Remember I sold those\n             three M-60 machine guns outta the\n             five I got?\n   \n                       BEAUMONT\n             Uh-huh.\n   \n                       ORDELL\n             I'm gonna sell the other two tonight.\n             This group of Koreans in Koreatown\n             have started a Neighborhood Watch\n             kinda thing. And they want a few\n             weapons so the neighborhood niggas\n             know they mean business. So I'm gonna\n             sell 'em my two machine guns tonight.\n             Only problem, I aint never dealt with\n             these Koreans before. Now I aint\n             worried. Asians are by and large real\n             dependable. They don't want no\n             trouble. You might argue about price,\n             but you aint gotta worry about them\n             shootin' you in the back. But I got\n             me kind of a rule. Never do business\n             with nobody you ain't never done\n             business with before without backup.\n             That's why I need you, backup.\n   \n                       BEAUMONT\n             Man, I ain't ready to be goin' out\n             nowhere -\n   \n                       ORDELL\n             - Let me finish. Can I finish?\n   \n                       BEAUMONT\n             Go ahead.\n   \n                                               CUT TO:\n   \n   \n   TRUNK\n   \n   The trunk of a car is opened.\n   \n   Ordell bends down into the trunk and pulls out a pump\n   action shotgun. Beaumont obviously doesn't want any part\n   of any Ordell game that requires a pump action shotgun as\n   a playing piece.\n   \n                       ORDELL\n             Now you're gonn be in the trunk\n             holding onto the shotgun. And I'm\n             going to tell them I'm opening up my\n             trunk to show 'em my goods. I open up\n             the trunk, you pop up, rack that bad\n             boy.\n   \n                       BEAUMONT\n             Fuck that shit, man. I ain't shootin'\n             anybody.\n   \n                       ORDELL\n             What the fuck I tell you. You don't\n             hafta shoot nobody. Just hold the\n             gun. They'll get the idea.\n   \n                       BEAUMONT\n             I ain't gittin' in that trunk.\n   \n                       ORDELL\n             We're only goin' to Koreatown. You'll\n             be in there - ten minutes.\n   \n                       BEAUMONT\n             Uh-uh. I ain't riding in that trunk\n             no minutes. Why don't I just ride\n             with you?\n   \n                       ORDELL\n             You can't ride with me. The surprise\n             effect is ninety percent of it.\n   \n                       BEAUMONT\n             Well, I'm sorry, man, but I ain't\n             gittin' in that trunk.\n   \n                       ORDELL\n             I can't believe you do me this way.\n   \n                       BEAUMONT\n             I ain't doin' you no way. I just\n             ain't climbin' in that trunk. I got a\n             problem with small places.\n   \n                       ORDELL\n             Well, my ass has got a problem\n             spending ten thousand dollars of my\n             own goddam money to get ungrateful,\n             peanut-head niggas outta jail, but I\n             do it -\n   \n                       BEAUMONT\n             Look, man, I know I owe you -\n   \n                       ORDELL\n             - Well, if you owe me, git your ass\n             in the trunk.\n   \n                       BEAUMONT\n             - I wanna help you, but I don't wanna\n             be locked in the trunk of no car.\n   \n                       ORDELL\n             You think I wanted to spend ten\n             thousand dollars on your ass?\n   \n   Beaumont starts to speak -\n   \n                       ORDELL (CONT'D)\n             Answer the question, nigga. Do you\n             think I wanted to spend the thousand\n             dollars on your ass? Yes or no?\n   \n                       BEAUMONT\n             Course you didn't.\n   \n                       ORDELL\n             But the only way to help you was to\n             do that, so I did it. (pause) Okay,\n             how 'bout this? After we're through\n             fuckin' with these Koreans, I take\n             you to Roscoe's Chicken and Waffles.\n             My treat.\n   \n   Beaumont smiles. So does Ordell.\n   \n                       ORDELL (CONT'D)\n             Just think, man. That Scoe's special,\n             smothered in gravy and onions. Get a\n             side of red beans and rice.\n             Uuuuummmmm, that's some good eatin'.\n   \n   Beaumont and Ordell laugh together... the Beaumont says;\n   \n                       BEAUMONT\n             Now exactly how long I gotta be in\n             this motherfucker.\n   \n                                               CUT TO:\n   \n   \n   TRUNK\n   \n   Beaumont in the trunk, holding the shotgun. The trunk lid\n   is SLAMMED closed.\n   \n   \n   EXT. / INT. OLDSMOBILE - NIGHT\n   \n   Ordell walks around the car, climbs into the plush\n   interior of the Olds and turns on the engine. It comes to\n   life with a SOFT RUMBLE. He puts a tape in the player\n   inside the dash.\n   \n   The tape is labeled \"ORDELL'S JAMS.\"\n   \n   Cool, old-school R&B fills the cab.\n   \n   Ordell cruises, moving his head to the rhythm and\n   mouthing the words.\n   \n   He drives for awhile, just groovin' on the music...\n   \n   ... then stops.\n   \n   Ordell switches the engine and the music off. The cab\n   goes black.\n   \n   He leans over the passenger seat, opening the glovebox. A\n   tiny light turns on when the glovebox is opened. It's the\n   only light in the cab. Ordell leaves it on.\n   \n   In silence he takes one glove out and puts it on his\n   right hand. Then with his gloved hand, reaches in the\n   glovebox and pulls out a five-shot .38 snubby. He closes\n   the glovebox.\n   \n   The cab goes black.\n   \n   \n   EXT. OLDSMOBILE - NIGHT\n   \n   The Olds is parked out in the middle of some urban\n   nowhere.\n   \n   Ordell gets out, sticks the snubby in his pants, and\n   walks to the back of the Olds. He sticks his key in the\n   trunk and says;\n   \n                       ORDELL\n             Don't worry. It's just me.\n   \n   The trunk opens. Beaumont is hunched on his side with the\n   shotgun.\n   \n                       ORDELL (CONT'D)\n             I was wondering. Did any federal\n             people come visit you in jail and I\n             should be watching my ass?\n   \n   Beaumont doesn't say anything.\n   \n                       ORDELL (CONT'D)\n             You wouldn't tell me if they did and\n             I wouldn't blame you.\n   \n   Ordell takes the snubby out of his pants.\n   \n   Beaumont quick-racks the pump shotgun, pulls the trigger,\n   and hears the click you hear from an empty weapon. He\n   racks it again, CLICK then BAM. Beaumont is shot hard in\n   the chest. He goes back into he trunk.\n   \n   Ordell puts one more shot in his head, BAM, tosses the\n   weapon on top of the dead body and closes the trunk.\n   \n   Ordell's Beaumont problem is solved. He climbs back into\n   the cab, turns on the engine. We hear the old-school R&B\n   song come back on, but VERY LOW.\n   \n   Ordell drives the Olds away.\n   \n                                               CUT TO:\n   \n   \n   INT. MOTEL - NIGHT\n   \n   Louis sits on a bed in a flophouse motel room, flipping\n   from one channel to another with a remote control,\n   drinking cocktails from a can.\n   \n   The phone rings. He answers it.\n   \n                       LOUIS\n             Hello.\n   \n   \n   INT. OLDSMOBILE (PARKED) - NIGHT\n   \n   Ordell is sitting parked in the comfy-cozy cab of the\n   Olds, listening to soul music with his tiny cellular\n   phone next to his ear.\n   \n                       ORDELL\n             Louis, my man. Watcha doin'?\n   \n                       LOUIS\n             Oh, I dunno. Watching TV.\n   \n                       ORDELL\n             Whatcha watchin'?\n   \n                       LOUIS\n             Nothin' really. Just kinda goin' back\n             and forth. They had some black girl\n             from some black show on Jay Leno. I\n             watched that for a bit, but I kept\n             flippin channels cause I didn't know\n             who she was.\n   \n                       ORDELL\n             Guess where I am?\n   \n                       LOUIS\n             I dunno.\n   \n                       ORDELL\n             I know you don't know. I said guess.\n   \n                       LOUIS\n             The moon - I dunno\n   \n                       ORDELL\n             I'm talkin' to you from the comfy-\n             cozy interior of an Oldsmobile parked\n             outside your nasty-ass welfare motel.\n   \n                       LOUIS\n             You're outside?\n   \n                       ORDELL\n             Uh-huh.\n   \n                       LOUIS\n             C'mon in.\n   \n                       ORDELL\n             Naw, man. I just told you, I'm\n             comfortable. I ain't about to walk\n             into that roach motel and get\n             uncomfortable. You bring your ass out\n             here.\n   \n                       LOUIS\n             I'm in my underwear.\n   \n                       ORDELL\n             Then put your goddam drawers on, and\n             get your ass out here. I got\n             somethin' to show you.\n   \n   \n   EXT. MOTEL - NIGHT\n   \n   Louis, having just thrown on some pants, walks outside\n   his room and sees Ordell's big, black Oldsmobile parked\n   in front of the motel.\n   \n   As he approaches, the power window on the driver's side\n   comes down, revealing a comfortable Ordell sitting back\n   in his seat looking up at Louis.\n   \n                       ORDELL\n             You know what your problem is, Louis?\n   \n   Louis doesn't say anything, he just puts his hands in his\n   pockets.\n   \n                       ORDELL (CONT'D)\n             You think you're a good guy. When you\n             go into a deal you don't go in\n             prepared to take that motherfucker\n             all the way. You go in looking for a\n             way out. And it ain't cause you're\n             scared neither. It's cause you think\n             you're a good guy, and you think\n             there's certain things a good guy\n             won't do. That's where we're\n             different, me and you. Cause me, once\n             I decide I want something, aint a\n             goddam motherfuckin' thing gonna stop\n             me from gittin' it. I gotta use a gun\n             get what I want, I'm gonna use a gun.\n             Nigga gets in my way, nigga gonna get\n             removed. Understand what I'm saying?\n   \n   \n   CLOSEUP: KEY GOING INTO TRUNK\n   \n   Trunk opens showing Beaumont shot in the chest with half\n   his head blown off.\n   \n   Louis looks inside, see Beaumont, looks at Ordell, then\n   back to Beaumont.\n   \n   Ordell closes the trunk.\n   \n                       LOUIS\n             Who was that?\n   \n                       ORDELL\n             That was Beaumont.\n   \n                       LOUIS\n             Who was Beaumont?\n   \n                       ORDELL\n             An employee I had to let go.\n   \n                       LOUIS\n             What did he do?\n   \n                       ORDELL\n             He put himself in a situation where\n             he was gonna have to do ten years in\n             the penetentiary, that's what he did.\n                   (taking out a Viceroy and\n                   lighting it up)\n             And if you know Beaumont, you know\n             there aint no way in hell he can do\n             no ten years. And if you know that,\n             you know Beaumont's gonna go any\n             goddam thing Beaumont can to keep\n             from doin' those ten years including\n             telling the Federal government\n             everything they want to know about my\n             ass. Now that, my friend, is a clear\n             case of him or me. And you best\n             believe it aint gonna be me. You know\n             what I'm sayin'? You gonna come in on\n             this with me, you gotta be prepared\n             to go all the way. I got me so far\n             over a half-a-million dollars sittin'\n             in lockboxes in a bank in Cabo San\n             Lucas. Me and Mr. Walker make us one\n             more delivery, I'm gonna have me over\n             a million. You think I'm gonna let\n             this little cheese eatin' nigga here\n             fuck that up? Shit, you better think\n             again. 'Fore I let this deal get\n             fucked up, I'll shoot that nigga in\n             the head, and ten niggas look just\n             like em.\n                   (pause)\n             Understand what I'm sayin'?\n   \n                       LOUIS\n             Yeah.\n   \n                       ORDELL\n             So we on the same page then?\n   \n                       LOUIS\n             I follow.\n   \n   Ordell smiles (not his hustler smile, but a genuine\n   smile).\n   \n   Louis grins.\n   \n   They both bump fists.\n   \n                                               FADE TO BLACK:\n   \n   \n   TITLE CARD:\n   \n   \"JACKIE BROWN\"\n   \n   The sound of airplanes landing and taking off can be\n   heard underneath this...\n   \n   \n   INT. LOS ANGELES INTERNATIONAL AIRPORT - DAY\n   \n   A SUBTITLE reads:\n   \n   \"LOS ANGELES INTERNATIONAL AIRPORT PARKING GARAGE\"\n   \n   We look down a row of cars in an enclosed parking garage\n   at LAX. Jackie Brown, the Cabo Air stewardess from the\n   opening credits, walks into frame. We dolly behind her as\n   she walks down the row of cars.\n   \n                       VOICE (O.S.)\n             Miss Brown.\n   \n   She turns towards the voice/camera.\n   \n   Young plainclothes cop, MARK DARGUS, walks up to her,\n   holding open his I.D. case.\n   \n                       DARGUS\n             Hi, I'm Detective Mark Dargus.\n             L.A.P.D. can I ask what you have in\n             that bag?\n   \n                       JACKIE\n             The usual things. I'm a flight\n             attendant with Cabo Air.\n   \n   Young plainclothes cop RAY NICOLET, enters the scene.\n   \n                       NICOLET\n             Can I be of some assistance?\n   \n   As Jackie pulls the cigarettes (Davidoffs) from her\n   purse, she says to Ray;\n   \n                       JACKIE\n             I doubt it.\n                   (to Dargus)\n             Who's your friend?\n   \n                       DARGUS\n             This is Special Agent Ray Nicolet\n             with Alcohol, Tobacco, and Firearms.\n             Would you mind if we looked in that\n             bag?\n   \n   Jackie lights her cigarette with a yellow Bic lighter.\n   \n                       JACKIE\n             Would I mind? Do I have a choice?\n   \n                       DARGUS\n             You have the right to say \"no.\" And I\n             have the right to make you wait here\n             with Ray while I go get a warrant.\n             And if I don't want to go through all\n             that trouble, I could just take you\n             in on suspicion.\n   \n                       JACKIE\n             Suspicion of what?\n   \n                       NICOLET\n             All he wants to do is peek in your\n             bag. I'll watch he doesn't take\n             anything.\n   \n   Jackie shrugs and says;\n   \n                       JACKIE\n             Go ahead.\n   \n   Dargus lays the flight bag on the pavement, gets down on\n   his haunches, and starts feeling through her things.\n   \n   \n   CLOSEUP FLIGHT BAG\n   \n   A soiled blouse, uniform skirt, - then a manila envelope,\n   a fat one, nine-by-twelve.\n   \n   Jackie watches him straighten the clasp...\n   \n   \n   ENVELOPE\n   \n   Opens it. Out drops several packets of one hundred dollar\n   bills secured with rubberbands.\n   \n   Nicolet whistles.\n   \n   Dargus looks up at her.\n   \n                       DARGUS\n             I'd say there's about, oh, fifty\n             thousand dollars here. What would you\n             say Ray?\n   \n                       NICOLET\n             That looks like fifty thousand\n             dollars from here.\n   \n   \n   JACKIE\n   \n   Not saying anything at the moment.\n   \n                       DARGUS\n             This is your money?\n   \n                       JACKIE\n             If I were to tell you \"no it\n             isn't...\"\n   \n   Dargus smiles.\n   \n                       DARGUS\n             You should know if you bring in\n             anything over ten thousand you have\n             to declare it. You forgot or what?\n             You could get a two hundred and fifty\n             thousand dollar fine, plus two years\n             in prison. Now you want to talk to us\n             about it, or you want to talk to\n             Customs?\n   \n                       JACKIE\n             I'm not saying another word.\n   \n                       NICOLET\n             Listen, Jackie, Hope you don't mind\n             if I call you Jackie. They're a bunch\n             of fuckin' pricks in Customs.\n             Something about that job makes them\n             kinda hard to get along with. Now, do\n             you want to talk with a bunch of\n             suspicious, disagreeable people like\n             them, or a couple good-hearted guys\n             like Mark and myself.\n   \n   Nicolet smiles.\n   \n   \n   CLOSEUP JACKIE\n   \n   Doesn't smile back.\n   \n                                               DISSOLVE TO:\n   \n   \n   CLOSEUP JACKIE\n   \n   Sitting in a chair facing the two offscreen detectives.\n   Jackie lights up a cigarette. We don't leave the CLOSEUP\n   until noted.\n   \n   \n   INT. DARGUS OFFICE - DAY\n   \n                       DARGUS (O.S.)\n             Hey, this is my office. There's no\n             smoking.\n   \n                       JACKIE\n             Arrest me.\n   \n   Nicolet laughs O.S.\n   \n                       DARGUS (O.S.)\n             We could, smart ass... or we could\n             work out what's known as a\n             Substantial Assistance Agreement.\n             That is if you're willing to\n             cooperate. Tell us who gave you the\n             money and who you're giving it to.\n   \n   Jackie doesn't sat anything... she just smokes.\n   \n                       NICOLET (O.S.)\n             You got a good lawyer?\n   \n                       DARGUS (O.S.)\n             Can she afford a good one is the\n             question. Otherwise she'll be in\n             Sybill Brand three weeks easy before\n             the Public Defender gets around to\n             her.\n   \n                       NICOLET (O.S.)\n             Ever heard of a fella named Beaumont\n             Livingston?\n   \n   Not a word.\n   \n                       NICOLET (O.S.) (CONT'D)\n             Don't know Beaumont? That's funny\n             'cause Beaumont knows you. Well he\n             did know you, Beaumont was found in\n             the trunk of a car - dead. Shot\n             twice. Once in the head and once in\n             the chest.\n   \n   Jackie, she puts the \"ool\" in \"cool.\"\n   \n                       NICOLET (O.S.) (CONT'D)\n             I had the chance to talk to Beaumont\n             yesterday. You see, like you,\n             Beaumont found himself in some hot\n             water. He was looking at ten years he\n             was pretty sure he didn't want to do\n             and was understandably concerned. Now\n             maybe you don't know Beaumont, but\n             Beaumont knew you, and maybe so does\n             the guy who blew Beaumont's head off.\n   \n   Not a word.\n   \n                       DARGUS (O.S.)\n             If you don't want to talk to us, I\n             guess we'll just have to hand you\n             over to Customs.\n   \n   Jackie puts out her cigarette.\n   \n                       JACKIE\n             Okay, let's go.\n   \n   She stares down the cops.\n   \n   \n   DARGUS AND NICOLET\n   \n   We cut to the detective and the special agent for the\n   first time in the scene.\n   \n                       DARGUS\n             You know, Miss Brown, there's\n             basically three types of people that\n             we come along in the performance of\n             our duty. One is, INNOCENT PEOPLE.\n             Victims, witnesses, innocent\n             bystanders... You ain't any of these.\n             Then there's two; CRIMINALS. These\n             sonabitches have dedicated their\n             lives to a life outside the law. That\n             ain't you either. Where you belong is\n             the third category. The category we\n             refer to as LOSERS.\n   \n   Jackie's eyes don't even narrow at the insult. She just\n   says without expression;\n   \n                       JACKIE\n             I'm not a loser.\n   \n                       DARGUS\n             Oh, you're both? In 1985 you were\n             flying for TWA and got busted for\n             carrying drugs. You were carrying\n             them for a pilot husband of yours. He\n             did time and you got off. But that\n             ended your career with the big\n             airlines. Cut to thirteen years\n             later. You're forty-four years of\n             age. You're flying for the shittiest\n             little shuttle-fucking piece of shit\n             Mexican airline that there is. Where\n             you make a whopping twelve-thousand\n             dollars a year. That ain't a hulluva\n             lot to show for a twenty year career.\n             And to top it off, you're going to\n             jail. Now true, the judge, even with\n             your prior, will probably only give\n             you a year or two. But this doesn't\n             seem like the time of life you got\n             years to throw away.\n                   (pause)\n             Now, we don't like trying losers like\n             they're criminals. But in the absence\n             of a criminal, we will try you. Now,\n             wasn't this money given to you by an\n             American living in Mexico by the name\n             of Cedric Walker?\n   \n   Jackie remains unmoved by this monologue.\n   \n   Nicolet joins back in.\n   \n                       NICOLET\n             You know, ol' Beaumont wasn't much\n             for talkin', either. Yeah, he told us\n             about you and Mr. Walker, but whoever\n             the hell it was he worked for out\n             here, he wouldn't say. Could it be\n             the same person you were supposed to\n             deliver this money to?\n   \n   Jackie just stares at them, saying nothing.\n   \n   Dargus sits behind his desk, with Jackie's flight bag on\n   it.\n   \n                       DARGUS\n             I'd like your permission to open this\n             again. So we'll know exactly how much\n             money we're talkin' about here.\n   \n   Jackie gets up from her chair, walks over to the desk,\n   unzips the bag, takes out the manila envelope and drops\n   it on the desk.\n   \n                       JACKIE\n             Help yourself.\n   \n                       DARGUS\n             While you're at it, let me see what\n             else is in there. You mind?\n   \n   She reaches in the bag and brings out a pocketbook.\n   \n                       JACKIE\n             My pocketbook.\n   \n                       DARGUS\n             What's in it?\n   \n                       JACKIE\n             Beauty products.\n   \n   Nicolet takes the manila envelope.\n   \n                       NICOLET\n             I'll count the money.\n   \n   Dargus points at a clear plastic bag with pills and\n   packets in it.\n   \n                       DARGUS\n             What's this?\n   \n                       JACKIE\n             That's my diet shit.\n   \n   Nicolet takes out the bills from the envelope.\n   \n                       DARGUS\n             Let's see what else is in there.\n   \n   Nicolet takes the bills and looks inside the envelope.\n   His expression changes to a shit-eating grin.\n   \n                       NICOLET\n             Oh, Miss Brown?\n   \n                       JACKIE\n             Yeah?\n   \n   Nicolet pulls out a clear cellophane sandwich bag with a\n   half-inch or so of white powder inside.\n   \n                       NICOLET\n             And what would this be, Sweet and\n             Low?\n   \n                       JACKIE\n             What the fuck is that shit?\n   \n                       NICOLET\n             I know what it looks like.\n   \n                       JACKIE\n             You planted that shit on me.\n   \n   Nicolet and Dargus laugh at that.\n   \n                       JACKIE\n             Look, that shit ain't mine.\n   \n                       NICOLET\n                   (to Dargus)\n             It isn't enough for Trafficking, but\n             how 'bout Posession with the Intent\n             to Distribute?\n   \n                       DARGUS\n             Oh, I wouldn't be so sure. What with\n             all the cash, I think I could go with\n             Conspiracy to Traffic.\n   \n                       JACKIE\n             I'm tellin' you, I don't know nothin'\n             about that fuckin' shit.\n   \n                       NICOLET\n             Well then, Miss Brown. Why don't you\n             have a seat and tell us who might\n             know something about this fuckin'\n             shit.\n   \n   Jackie just looks at the two grinning Cheshire cats as\n   the balance of power rolls over on her.\n   \n                                               CUT TO:\n   \n   \n   EXT. TORRANCE MUNICIPAL COURTHOUSE - DAY\n   \n   A Los Angeles County Jail bus pulls up behind the\n   Torrance Court House.\n   \n   \n   INT. COUNTY JAIL BUS - DAY\n   \n   Jackie, now wearing County Jail blues, sits next to\n   another BLACK WOMAN. Their hands cuffed together.\n   \n   The bus stops. A rough-looking FEMALE COUNTY SHERIFF\n   unlocks the gate that encloses the prisoners. Then\n   explains in a you-better-do-exactly-what-I-say manner,\n   how they're going to leave the bus.\n   \n   \n   EXT. COUNTY JAIL BUS - DAY\n   \n   MANY WOMEN, including Jackie, all wearing county blues\n   and handcuffed to each other, exit the bus.\n   \n   The SHERIFFS lead them into the back entrance to the\n   court house.\n   \n   \n   INT. HALLWAY COURTHOUSE - DAY\n   \n   Dargus and Nicolet confer with the PUBLIC DEFENDER, an\n   attractive blonde woman in a nice business suit.\n   \n                       DARGUS\n             If she'll cooperate with us, we'll\n             turn possession with intent into\n             plain ol' Possession, and she can\n             bond outta here for one thousand\n             bucks. If she doesn't help us, we'll\n             go for the Intent and request a\n             twenty-five-thousand dollar bond.\n   \n   \n   INT. COURTROOM - DAY\n   \n   Jackie and the Public Defender. Jackie, in her county\n   blues; Public Defender in her nice suit.\n   \n                       JACKIE\n             You tell those guys they'll have to\n             do one helluva lot better than that\n             before I'll even say 'hi' to them.\n   \n                       PUBLIC DEFENDER\n             Well, that's the State's offer. If\n             you plead to possession and tell\n             L.A.P.D. what they want to know, your\n             bond will be set at one-thousand\n             dollars. If you don't, L.A.P.D. will\n             request one at twenty- five thousand\n             based on your prior record and risk\n             of flight. If you don't post it or\n             don't know anyone who can, you'll\n             spend six to eight weeks in County\n             before your arraignment comes up.\n   \n                       JACKIE\n             Who's side are you on?\n   \n                       PUBLIC DEFENDER\n             I beg your pardon?\n   \n                       JACKIE\n             What if I plead guilty?\n   \n                       PUBLIC DEFENDER\n             And cooperate? You might get\n             probation.\n   \n                       JACKIE\n             If I don't cooperate?\n   \n                       PUBLIC DEFENDER\n             With the prior? You could get\n             anywhere from a year to five\n             depending on the judge. You want to\n             think about it? You got two minutes\n             before we're up.\n   \n   \n   COURT IN SESSION\n   \n   It's a full schedule in court today. Jackie sits with a\n   bunch of other females wearing county blues in the\n   defendant's area (where the jury sits during a jury\n   trial)\n   \n   Dargus and Nicolet sit in the courtroom.\n   \n   The JUDGE reads the next case.\n   \n                       JUDGE\n             Brown. Case number 700324.\n   \n   Jackie rises amongst the other defendants.\n   \n   The P.D. rises.\n   \n   Dargus, the arresting officer, rises.\n   \n                       JUDGE\n             The charge is possession of Narcotics\n             with the Intent to Distribute. How\n             does your client plead?\n   \n                       PUBLIC DEFENDER\n             She wishes to stand mute, your honor.\n   \n                       JUDGE\n             Very well...\n                   (to Dargus)\n             ... Detective Dargus - You're the\n             arresting officer in his case,\n             correct?\n   \n                       DARGUS\n             That's correct, your honor.\n   \n                       JUDGE\n             You have a recommendation for bail?\n   \n                       DARGUS\n             Yes, I do, your honor. Based on the\n             defendant's prior conviction and the\n             extreme possibility of flight due to\n             her occupation, the State requests a\n             bond of no less than twenty-five\n             thousand.\n   \n   The Judge looks at the report, then at Jackie...\n   \n                       JUDGE\n             I'll set bond at ten thousand and set\n             the date of August 14th for the\n             arraignment.\n   \n                       JACKIE\n             When is that, your honor?\n   \n                       JUDGE\n             That's six weeks from now, Miss\n             Brown. We'll continue this matter\n             then. Owens, case 72242.\n   \n   Jackie sits down.\n   \n   Dargus sits down next to Nicolet. They smile and giggle\n   together.\n   \n   Jackie sees them giggle like fifth graders. It fucking\n   pisses her off.\n   \n   \n   DIFFERENT PERSPECTIVE\n   \n   We go from a CLOSEUP of a boiling Jackie, to a\n   perspective from the back of the courtroom.\n   \n   We see Jackie in the defendant's area.\n   \n   We see the two happy detectives walk past us on their way\n   out of the courtroom.\n   \n   \n   ORDELL\n   \n   Sits in the back, watching the proceedings without any\n   expression. When he's seen enough, he stands up and out\n   of the shot leaving an EMPTY FRAME.\n   \n                                               FADE TO BLACK\n   \n   \n   TITLE CARD\n   \n   \"MAX CHERRY\"\n   \n                                               FADE UP ON:\n   \n   \n   INT. MAX CHERRY'S OFFICE - DAY\n   \n   The bathroom door in Max's office. We hear a toilet flush\n   behind it. The door opens, and Max Cherry emerges,\n   zipping up his pants with a TV guide in his hand.\n   \n   He looks up and stops dead.\n   \n   Ordell sitting oh-so comfortably in the chair in front of\n   Max's desk.\n   \n                       ORDELL\n             Unh... unh... unh... I din't hear you\n             wash your hands.\n   \n   Max looks at Ordell, then takes his place behind his\n   desk.\n   \n                       MAX\n             Comfortable?\n   \n                       ORDELL\n             The door was opened, so I just came\n             right in.\n   \n                       MAX\n             I can see that. Why?\n   \n                       ORDELL\n             I got some more business for ya.\n   \n                       MAX\n             Oh, yeah? What did he do?\n   \n                       ORDELL (O.S.)\n             She is an airline stewardess. Got\n             caught coming back from Mexico with\n             some blow. They set her bond this\n             afternoon at ten thousand. Now, what\n             I was thinkin', you could use the ten\n             thousand you owe me from Beaumont and\n             move it over on to the stewardess.\n   \n                       MAX\n             The bond for possession is only a\n             thousand.\n   \n                       ORDELL\n             They fuckin' wit' her. They callin'\n             it Possession with Intent. A black\n             woman in her forties gets busted with\n             less than two ounces on her, they\n             call that shit Intent. Same shit\n             happened to a movie star. It's\n             Possession.\n   \n                       MAX\n             It still sounds high.\n   \n                       ORDELL\n             She had, I believe it was... fifty\n             grand on her, too. There was a cop at\n             the hearing. Young guy with L.A.P.D.\n             wanted her bond set at twenty-five\n             thousand, saying there was a risk of\n             flight. Jackie being a stewardess and\n             all.\n   \n                       MAX\n             Before we start talking about\n             stewardess, let's get Beaumont out of\n             the way first.\n   \n   Sitting back in the chair - almost grinning - but not\n   quite.\n   \n                       ORDELL\n             Somebody already did.\n   \n                       MAX\n             What?\n   \n                       ORDELL\n             You didn't hear?\n   \n                       MAX\n             Hear what?\n   \n                       ORDELL\n             Somebody with a grudge blew\n             Beaumont's brains out - hey, that\n             rhymes - blew Beaumont's brains out.\n   \n                       MAX\n             Did the police contact you?\n   \n                       ORDELL\n             Very first motherfuckin' thing they\n             did. They see I put up a big money\n             bond on my boy, they start thinking\n             with that where-there's-smoke-there's\n             fire logic. They roust my ass outta\n             bed, ten o'clock in the morning.\n             Fuckin' scare my woman, Sherona, half\n             to death. She thought they were gonna\n             take my ass away for sure.\n   \n                       MAX\n             The stewardess. Do you know her last\n             name?\n   \n                       ORDELL\n                   (smiles)\n             Brown, Jackie Brown.\n   \n                       MAX\n             What does she do for you?\n   \n                       ORDELL\n             Who says she does anything for me?\n             She's my friend. When my friends get\n             into trouble, I like to help 'em out.\n   \n                       MAX\n             Beaumont worked for you.\n   \n                       ORDELL\n             That's what the police thought. I\n             told them I'm unemployed, how could I\n             have anybody work for me? Now I bail\n             out Jackie, I'm liable to have the\n             police on me again, huh? Wanting to\n             know was she doing things for me, was\n             she bringing me that money!\n   \n                       MAX\n             Was she?\n   \n                       ORDELL\n             Is this, me and you, like a lawyer-\n             client relationship? The lawyer can't\n             tell nothing he hears?\n   \n                       MAX\n             You're not my client until you get\n             busted and I bond you out.\n   \n                       ORDELL\n             If there's no - what do you call it -\n             confidentiality between us? Why would\n             I tell you anything?\n   \n                       MAX\n             Cause you want me to know what a\n             slick guy you are. You got\n             stewardesses bringing you fifty\n             grand.\n   \n                       ORDELL\n             Why would a stewardess bring me fifty\n             grand?\n   \n                       MAX\n             You want me to speculate on what you\n             do. I'd say you're in the drug\n             business, except the money's moving\n             in the wrong direction. Whatever\n             you're into, you seem to be getting\n             away with it, so more power to you.\n             Okay you want another bond, and you\n             want to move over the ten thousand\n             you put down on Beaumont to the\n             stewardess. That means paperwork. I\n             have to get a death certificate,\n             present it to the court, fill out a\n             receipt for return of bond\n             collateral, then type up another\n             application. An indemnity agreement -\n   \n                       ORDELL\n             - Jackie aint got time for all that\n             shit -\n   \n                       MAX\n             - I'm telling you what I have to do.\n             What you have to do, in case you\n             forgot, is come up with premium of a\n             thousand bucks.\n   \n                       ORDELL\n             I got it. I just don't got it on me.\n   \n                       MAX\n             Well, come back when you do, and I'll\n             bond out the stewardess.\n   \n                       ORDELL\n             Man, you know I'm good for it.\n             Thousand bucks ain't shit.\n   \n                       MAX\n             If I don't see it in front of me,\n             you're right. It ain't shit.\n   \n                       ORDELL\n             Man, you need to look at this with a\n             little compassion. Jackie ain't no\n             criminal. She ain't used to this\n             kinda treatment. I mean, gangsters\n             don't give a fuck - but for the\n             average citizen, coupla nights in\n             County fuck with your mind.\n   \n                       MAX\n             Ordell, this isn't a bar, an you\n             don't have a tab.\n   \n                       ORDELL\n             Just listen for a second. We got a\n             forty-year-old, gainfully employed\n             black woman, falsely accused -\n   \n                       MAX\n             Falsely accused? She didn't come back\n             from Mexico with cocaine on her?\n   \n                       ORDELL\n             Falsely accused of Intent. If she had\n             that shit - and mind you, I said \"if\"\n             - it was just her shit to get high\n             with.\n   \n                       MAX\n             Is white guilt supposed to make me\n             forget I'm running a business?\n   \n   Ordell gives up and takes an envelope out of his pocket.\n   \n                       ORDELL\n             Okay, man. I got your money. But\n             don't you ever ask me for no fuckin'\n             favor.\n   \n   \n   INT. MAX'S CADILLAC (MOVING) - NIGHT\n   \n   It's early evening; and Max's powder-blue Seville is\n   driving to the County Jail with a client, a young\n   Hispanic woman of twenty named ANITA.\n   \n                       MAX\n             Tomorrow I'll talk to your probation\n             officer. Karen's a good kid, but\n             she's mad at you, because you lied to\n             her. This business about your\n             grandmother's funeral\n   \n                       ANITA\n             I went. I did. I took my mother and\n             little brother.\n   \n                       MAX\n             But you didn't ask permission. You\n             broke a trust. If you had asked,\n             Karen probably would have let you.\n             I'm sure she would.\n   \n                       ANITA\n             I know. That's why I went.\n   \n                       MAX\n             But then you told her you were home.\n   \n                       ANITA\n             Sure, 'cause I didn't ask her if I\n             could go.\n   \n   Max gives up.\n   \n                       MAX\n             I don't know. Maybe it's a language\n             problem.\n                   (getting stern)\n             Anita, you ever cause this much\n             heartache over something that could\n             easily be avoided, I'll never write\n             you again. You understand?\n   \n                       ANITA\n             I understand.\n   \n                       MAX\n             I mean it. I don't care how many\n             times your mother calls or how much\n             she cries.\n   \n   Like an exasperated teenager.\n   \n                       ANITA\n             I understand.\n   \n                       MAX\n             Then say \"Yes, Max. I understand.\"\n   \n                       ANITA\n             Yes, Max, I understand.\n   \n   \n   INT. L.A. COUNTY JAIL - NIGHT\n   \n   POV THROUGH A WIRE MESH CAGE\n   \n   Max and Anita, side by side. Anita's hands are cuffed\n   behind her back.\n   \n                       MAX\n             Dropping off and picking up. Dropping\n             of Lopez, Anita. Picking up Brown,\n             Jackie.\n   \n   We're at the admitting desk of the L.A. County Jail. Max\n   undoes Anita's handcuffs, while a SHERIFF waits to take\n   her away.\n   \n                       ANITA\n             So you're gonna call Karen tomorrow?\n   \n                       MAX\n             I'll call her.\n   \n                       ANITA\n             Won't forget?\n   \n                       MAX\n             I won't forget.\n   \n   She kisses Max on the cheek and the Sheriff takes her\n   away.\n   \n                       ANITA\n             Thanks, Max. See you later.\n   \n   Max puts the cuffs away, sits on a bench, takes out a Len\n   Deighton paperback and begins to read.\n   \n                                               FADE TO BLACK\n   \n                                               FADE UP:\n   \n   \n   MAX\n   \n   Still reading his novel. We hear offscreen, a SHERIFF'S\n   voice.\n   \n                       SHERIFF (O.S.)\n             Max! Here she comes.\n   \n   Max puts his book down and see -\n   \n   Jackie being led into the Admitting Area by TWO SHERIFFS.\n   She's wearing her stewardess uniform and carrying a small\n   envelope with her belongings in it and her shoes. When\n   Max was imagining a woman in her forties, he had someone\n   with a bit of wear and tear on them in mind. But this\n   Jackie Brown's a knockout.\n   \n   As he watches her, she steps out of the County Jail\n   slippers she was wearing and slips into her shoes.\n   \n   He approaches, handing her his card.\n   \n                       MAX\n             Miss Brown... I'm Max Cherry. I'm\n             your bail bondsman.\n   \n   She takes the card and shakes his hand saying nothing.\n   \n                       MAX (CONT'D)\n             I can give you a lift home if you'd\n             like?\n   \n                       JACKIE\n             Okay.\n   \n   \n   INT. MAX'S CADILLAC - NIGHT\n   \n   Max puts his key in the ignition, when Jackie asks;\n   \n                       JACKIE\n             Are you really a bail bondsman?\n   \n                       MAX\n             Who do you think I am?\n   \n   She doesn't answer.\n   \n                       MAX (CONT'D)\n             I gave you my card there.\n   \n                       JACKIE\n             Can I see your I.D.?\n   \n                       MAX\n             You're serious?\n   \n   She waits.\n   \n   Max digs the case out of his pocket, hands it to her,\n   then reaches up and turns on the light above them for her\n   to see.\n   \n   \n   MAX'S ID: SURETY AGENT LICENSED BY THE STATE OF\n   CALIFORNIA\n   \n                       JACKIE\n             Who put up my bond? Ordell?\n   \n                       MAX\n             In cash.\n   \n   She looks straight ahead.\n   \n   Max shifts into drive.\n   \n   Max rolls down his window at the front gate. A DEPUTY\n   comes out of the gatehouse and hands through the window\n   Max's .38 revolver, cylinder opened. Max hands the Deputy\n   his pass in exchange for the gun, says \"thanks\", then\n   puts the .38 in his glovebox in front of Jackie. He\n   drives on.\n   \n   \n   MAX AND JACKIE (MOVING)\n   \n                       JACKIE\n             Can we stop for cigarettes?\n   \n                       MAX\n             Sure, ever been to the Riverbottom?\n   \n                       JACKIE\n             I don't think so.\n   \n                       MAX\n             It's okay. It's a cop hangout.\n   \n                       JACKIE\n             Couldn't we just stop at a seven-\n             eleven?\n   \n                       MAX\n             I thought you might want a drink?\n   \n                       JACKIE\n             I'd love one, but not there.\n   \n                       MAX\n             We could stop at the Hilton by the\n             airport.\n   \n                       JACKIE\n             Is it dark?\n   \n                       MAX\n             It's kind of a sports bar\n   \n                       JACKIE\n             That doesn't sound dark.\n   \n                       MAX\n             Why does it need to be dark?\n   \n                       JACKIE\n             'Cause I look like I just got outta\n             jail, that's why. You droppin' me off\n             at home, right? There's a place by\n             me.\n   \n                       MAX\n             Great.\n   \n                                               CUT TO:\n   \n   \n   EXT. THE COCKATOO INN - NIGHT\n   \n   A big neon sign of a cockatoo sits on op of a red brick\n   inn.\n   \n   \n   INT. THE COCKATOO INN - NIGHT\n   \n   CLOSEUP - A KNOB is pulled out.\n   \n   Jackie picks up a pack of Mild Seven's cigarettes from\n   the bottom of a cigarette machine. She crosses the bar to\n   join Max, sitting at a small table waiting for her to\n   return.\n   \n   The Cockatoo Inn is just what Jackie was looking for. A\n   dark and red cocktail lounge in Hawthorne off of\n   Hawthorne Boulevard by the apartment where the stewardess\n   lives (about ten minutes from LAX)\n   \n   The clientele of the Cockatoo is an older, black crowd\n   and an even older white crowd who'd been coming here\n   years before it became a black bar.\n   \n   A JUKEBOX plays soft, old-school R&B.\n   \n   Jackie and Max sit side by side at a small table, lit by\n   a bar candle in a red glass thing.\n   \n   Max drinks Bushmills over crushed ice. Jackie drinks\n   white wine. Jackie opens her Mild Sevens, offering one to\n   Max.\n   \n                       MAX\n             No thanks, I quit three years ago.\n   \n   As she lights her cigarette.\n   \n                       JACKIE\n             You gain weight?\n   \n                       MAX\n             Ten pounds. I lose it and put it back\n             on.\n   \n                       JACKIE\n             That's why I don't quit. If I can't\n             fly anymore, I'm gonna have a bitch\n             of a time gettin' my brand.\n   \n                       MAX\n             What's your brand?\n   \n                       JACKIE\n             Davidoffs. I get 'em in Mexico.\n             They're hard to find here. I was\n             locked up with the last two getting\n             legal advice from a woman who was in\n             for bustin' her boyfriend's head open\n             with a baseball bat.\n   \n                       MAX\n             Was she helpful?\n   \n                       JACKIE\n             She was more helpful than the fuckin'\n             Public Defender.\n                   (she takes a sip of wine)\n             I don't know - I guess what I need is\n             a lawyer, find out what my options\n             are.\n   \n                       MAX\n             You know, I figured out the other day\n             I've written something like' fifteen\n             thousand bonds since I've been in the\n             business. I'd say about eighty\n             percent of them were at least drug\n             related. If you want, I can help you\n             look at your options.\n   \n   Jackie takes the talk in a different direction.\n   \n                       JACKIE\n             You're not tired of it?\n   \n                       MAX\n                   (smiles)\n             I am, as a matter of fact.\n   \n   A moment of silence between them, they both take drinks.\n   \n                       MAX (CONT'D)\n             What have they told you?\n   \n                       JACKIE\n             So far I've been told I can cooperate\n             and get probation, maybe. Or, I can\n             stand mute and get as much as five\n             years. Does that sound right?\n   \n                       MAX\n             I'd say if you're tried and found\n             guilty you won't get more than a year\n             and a day. That's State time. Prison.\n   \n                       JACKIE\n                   (under her breath)\n             Shit.\n   \n                       MAX\n             But they won't want to take you to\n             trial. They'll offer you simple\n             Possession, a few months of County\n             time, and a year or two probation.\n                   (pointing to her drink)\n             How 'bout another?\n   \n                       JACKIE\n             Sure.\n   \n   Max gestures to an older black cocktail waitress named\n   ROWEN for two more.\n   \n                       MAX\n             You know who put the dope in your\n             bag?\n   \n                       JACKIE\n             Yeah, but that's not what this was\n             about. They were fuckin waitin' for\n             my ass. They knew I had that money,\n             they even knew the amount. The one\n             who searched my bag, from L.A.P.D.,\n             Dargus, hardly even looked at it.\n             \"Oh, I'd say there's fifty thousand\n             here. What would you say?\" But all\n             they could do was threaten me and\n             hand me over to Customs, and I could\n             tell they didn't want to do that.\n   \n                       MAX\n             They wanted you to tell them what you\n             know.\n   \n                       JACKIE\n             I had 'em too. I burnt those two\n             Starky and Hutch motherfuckers down.\n             Then their asses lucked out and found\n             that coke.\n   \n                       MAX\n             What did they want to know?\n   \n                       JACKIE\n             Who gave me the money and who I was\n             giving it to. And some guy they found\n             in a trunk with his head blown off.\n             Said it was him who told them 'bout\n             me.\n   \n   The Waitress comes with the drinks.\n   \n                       ROWEN\n             Can I get you two some popcorn?\n   \n                       MAX\n             No, thanks.\n   \n   Rowen exits.\n   \n                       MAX (CONT'D)\n             That would be Beaumont Livingston.\n   \n                       JACKIE\n             That's him. How do you know 'em?\n   \n                       MAX\n             I wrote him on Monday. They found him\n             dead on Tuesday.\n   \n                       JACKIE\n             Ordell pick up his bond?\n   \n                       MAX\n             Same as you. Ten thousand.\n   \n                       JACKIE\n             The federal agent kinda half hinted\n             Ordell might of done Beaumont.\n   \n                       MAX\n             You mentioned a guy from L.A.P.D.,\n             but you didn't mention the Federal.\n   \n                       JACKIE\n             I didn't?\n   \n                       MAX\n             No, you didn't. What branch?\n   \n                       JACKIE\n             Ray Nicolet with Alcohol, Tobacco,\n             and Firearms.\n   \n   Max puts it together.\n   \n                       MAX\n             He's the one who wants you.\n   \n                       JACKIE\n             It was the other guy who busted me.\n   \n                       MAX\n             'Cause if he busted you, you'd play\n             hell bonding out of federal court. He\n             doesn't want you mad at him, he wants\n             you to tell him what you know. He\n             uses you to get a line on Ordell,\n             make a case, then take him federal.\n             You know what Ordell's into?\n   \n                       JACKIE\n             I have a pretty good idea. Ordell\n             aint no bootlegger and I doubt he's\n             smugglin' Cuban cigars. So that only\n             leaves one thing an A.T.F. man would\n             be interested in.\n   \n   Jackie waits a moment before answering, weighs things in\n   her mind and makes a decision.\n   \n                       JACKIE\n             I used to bring over ten thousand at\n             a time. That's the legal limit, so I\n             never brought more than that.\n   \n                       MAX\n             How many trips did you make?\n   \n                       JACKIE\n             With ten thousand? Nine.\n   \n                       MAX\n             He's got that kinda money?\n   \n                       JACKIE\n             It's all in lock boxes in a Mexico\n             bank. But he's got a problem. He's -\n             what do you call it when you got\n             money, but don't have cash?\n   \n                       MAX\n             Cash poor?\n   \n                       JACKIE\n             That's it. He's cash poor. He kept on\n             me till I finally said okay. I'll\n             bring whatever fits in a nine-by-\n             twelve envelope. I got paid five\n             hundred dollars, and his friend, Mr.\n             Walker, in Mexico gave me the\n             envelope.\n   \n                       MAX\n             If you knew bringing anything over\n             ten thousand was against the law, why\n             not pack a hundred grand?\n   \n   Jackie gets exasperated.\n   \n                       JACKIE\n             Whatever it was had to fit in my bag\n             and not hit you in the face if the\n             bag was opened. This ain't solvin' my\n             problem. I gotta figure out a way to\n             either keep my job or get out of\n             trouble. I'm of today, but if I can't\n             leave the country I'm out of a job.\n             And if I don't got a job, I can't\n             hire a lawyer.\n   \n                       MAX\n             Ask A.T.F. They might give you\n             permission.\n   \n                       JACKIE\n             Yeah, if I cooperate.\n   \n                       MAX\n             Well, Jackie, you got caught, you're\n             gonna have to give 'em something.\n   \n                       JACKIE\n             But if all I can give 'em is Ordell's\n             name - I don't really know shit about\n             what he does or how he does it - That\n             don't give me much to bargain with.\n   \n                       MAX\n             Give 'em what you got. Offer to help.\n             Show a willingness to be helpful. You\n             want to stay out of jail, don't you?\n   \n   Max looks at Jackie thinking about something.\n   \n                       MAX (CONT'D)\n             What'dya think?\n   \n   \n   CLOSEUP JACKIE\n   \n                       JACKIE\n             I think maybe I have more options\n             than I thought.\n   \n                                               DISSOLVE TO:\n   \n   \n   CLOSEUP: ORDELL\n   \n   Sitting in his black Mercedes, parked across the street\n   from Jackie's apartment building in Hawthorne. Johnny\n   Cash is playing inside his car.\n   \n   \n   EXT. JACKIE'S APARTMENT COMPLEX - NIGHT\n   \n   ORDELL'S POV\n   \n   Through the windshield, he sees Max's powder-blue\n   Cadillac Seville pull up to Jackie's apartment. She gets\n   out, ten bends down and talks to him through the window\n   of the passenger side door. Then makes a goobye gesture\n   and turns, walking into her apartment complex. Max drives\n   off.\n   \n   \n   ORDELL\n   \n   While Johnny Cash continues crooning, Ordell puts on his\n   gloves. Then opens up his glovebox, taking out a little\n   Targa .22 pistol. He steps out of the car, slipping the\n   pistol into his coat pocket. We STEDICAM in front of him\n   as he walks across the street to Jackie's apartment. Once\n   inside the complex, Ordell passes us and WE FOLLOW BEHIND\n   HIM, up to Jackie's ground-floor apartment door.\n   \n   He gives it a soft knock with one knuckle. He waits a\n   moment, then Jackie opens the door.\n   \n                       ORDELL\n             How you doing, Ms. Jackie?\n   \n                       JACKIE\n             I was expecting you. Come in.\n   \n   Jackie holds the door open for him.\n   \n   \n   INT. JACKIE'S APARTMENT - NIGHT\n   \n   Ordell steps inside. He moves over by a halogen lamp in\n   the living room.\n   \n                       ORDELL\n             You got some booze?\n   \n   Jackie still standing by the door. She doesn't look\n   frightened.\n   \n                       JACKIE\n             I got some vodka in the freezer.\n   \n                       ORDELL\n             Got some o.j.?\n   \n                       JACKIE\n             Yeah.\n   \n   Ordell turns the halogen lamp to dim.\n   \n                       ORDELL\n             Well, then, why don't you be a good\n             hostess and make me a screwdriver?\n   \n                       JACKIE\n             Sure.\n   \n   Jackie moves into the kitchen area. Ordell follows her,\n   hanging in the doorway, while she makes the drink. Jackie\n   doesn't turn on the light.\n   \n                       ORDELL\n             You gonna thank me?\n   \n   Taking a glass from the cupboard.\n   \n                       JACKIE\n             For what?\n   \n                       ORDELL\n             Who you think got your ass outta\n             jail?\n   \n   Opening the freezer and filling a glass with ice cubes\n   and taking out vodka.\n   \n                       JACKIE\n             The same guy who put me in, thanks a\n             lot.\n   \n                       ORDELL\n             Hey, you get caught with blow, that's\n             our business.\n   \n   Opens refrigerator, light cuts into the kitchen. She\n   takes out orange juice, then closes the door.\n   \n                       JACKIE\n             It wasn't mine.\n   \n   Ordell has to stop and think.\n   \n   Jackie makes screwdriver.\n   \n                       ORDELL\n             Oh, shit. I bet it was that present\n             Mr. Walker was sending Melanie.\n             Yaaaah, he's the one musta put it in\n             there if you didn't. Oh, man, that\n             shit's uncalled for, baby, and I\n             apologize. I 'magine they asked you a\n             shitload of questions about it, huh?\n             All that money, want to know where\n             you got it?\n   \n   Jackie doesn't answer. She just walks up to Ordell\n   handing him his yellow drink in the darkness. Ordell\n   takes it, continues to look at Jackie.\n   \n                       ORDELL (CONT'D)\n             I'magine they asked who you givin' it\n             to, too.\n   \n                       JACKIE\n             They asked.\n   \n                       ORDELL\n             And what was your answer?\n   \n                       JACKIE\n             I said I wanted to talk to a lawyer.\n   \n                       ORDELL\n             You positive about that? You weren't\n             nervous and let something slip by\n             mistake? If you did, I ain't mad, I\n             just gotta know.\n   \n   Jackie says to his face;\n   \n                       JACKIE\n             You're not asking the right\n             questions.\n   \n   Then she walks past him back to the living room. She goes\n   over to the halogen lamp, turning the light up brighter,\n   then moves by the door, still standing and looking at\n   Ordell in the kitchen doorway.\n   \n                       JACKIE\n             Beaumont Livingston.\n   \n                       ORDELL\n             I knew it.\n   \n                       JACKIE\n             And they asked if I knew Mr. Walker.\n   \n   Ordell by the halogen lamp. He turns it back to dim.\n   \n                       ORDELL\n             Yeah?\n   \n                       JACKIE\n             I didn't tell 'em anything.\n   \n   Ordell moves slowly towards Jackie.\n   \n                       ORDELL\n             My name come up?\n   \n   Jackie slowly shakes her head \"no.\"\n   \n   Ordell directly in front of Jackie, he gently places his\n   gloved hands on her shoulders.\n   \n                       ORDELL (CONT'D)\n             You say anything about me?\n   \n   Jackie shakes her head \"no.\"\n   \n                       ORDELL (CONT'D)\n             Well, that's mighty honorable of you.\n   \n   Ordell's gloved fingertips move up her collarbone to her\n   throat, gently touching her skin. Jackie locks eyes with\n   his, but still shows no fear.\n   \n                       ORDELL (CONT'D)\n             This fella Beaumont, they say what\n             happened to him?\n   \n                       JACKIE\n             They told me.\n   \n   At this moment the film becomes a:\n   \n   \n   SPLIT SCREEN\n   \n   On the RIGHT-HAND SIDE is Ordell with his hands barely\n   touching Jackie's throat. On the LEFT-HAND SIDE is Max\n   driving home in his Seville.\n   \n   \n   MAX IN CAR\n   \n   Max drives home, an almost moony romantic look no his\n   face. He can't stop thinking about Jackie. During the\n   night she'd have a gleam in her eyes, the look saying;\n   \"WE COULD HAVE FUN\". Unless she was appraising kinda him\n   with the look, making a judgment and what it said was; \"I\n   COULD USE YOU\". Either way it was a turn-on.\n   \n   Max pulls into the driveway of his small house in\n   Torrance.\n   \n   \n   ORDELL AND JACKIE\n   \n                       ORDELL\n             Yeah, somebody musta been real mad at\n             Beaumont. Or  they were afraid of\n             what he might say to keep from doin\n             some time. I'magine from time-to-time\n             they asked you a whole shitload of\n             questions. And you didn't give 'em no\n             answer?\n   \n   Jackie shakes her head from side to side.\n   \n   Ordell moves his thumbs from her collarbone to the middle\n   of her throat.\n   \n                       ORDELL\n             You scared of me?\n   \n   Jackie shakes her head from side to side without her eyes\n   leaving his. Reaches over the seat\n   \n                       ORDELL\n             You got a reason to be nervous with\n             me?\n   \n   With his hands on Jackie's throat, staring into the\n   woman's eyes, from BELOW FRAME then feels something hard\n   the fuck against his crotch. Neither break eye contact.\n   \n   Ordell hears a CLICK.\n   \n   Can't believe it.\n   \n   \n   MAX IN CAR\n   \n   Max takes his keys, then to the glove box...\n   \n   \n   THE GLOVE BOX\n   \n   The gun is gone.\n   \n                       MAX\n             Where is it?\n   \n   \n   A CLOSEUP OF MAX'S GUN IN ORDELL ORDELL'S CROTCH\n   \n                       ORDELL\n             Is that what I think it is?\n   \n                       JACKIE\n             What do you think it is?\n   \n   \n   CLOSEUP GUN IN CROTCH\n   \n                       ORDELL\n             I think it's a gun pressing against\n             my dick.\n   \n                       JACKIE\n             You thought right... Now take your\n             hands from around my throat, nigga.\n   \n   Ordell flashes his hustler's smile and lets go.\n   \n   END OF SPLIT SCREEN\n   \n   Jackie turns Ordell around, gun firmly in his back, and\n   pushes him against the wall.\n   \n                       ORDELL\n             What the hell you doin'?\n   \n                       JACKIE\n             Shut your ass up and grab the wall!\n   \n   Jackie has Ordell against the wall and is frisking him\n   the way a cop would. She finds the .22 pistol in his\n   pocket\n   \n                       ORDELL\n             Now, baby, that's got nothin' to do\n             with you. I just carry that. You been\n             listenin' to them cops too much.\n   \n                       JACKIE\n             The cops didn't try and strangle my\n             ass.\n   \n                       ORDELL\n             Damn, Jackie, I was just playin' with\n             you.\n   \n                       JACKIE\n             Well, I ain't playin with you. I'm\n             gonna unload both these\n             motherfuckers, you don't do what I\n             tell you. Understand what I'm saying?\n   \n                       ORDELL\n             Baby, I ain't come here -\n   \n   She shoves both guns in Ordell's back.\n   \n                       JACKIE\n             I said, you understand what I'm\n             saying\n   \n                       ORDELL\n             I understand woman, damn!\n   \n                       JACKIE\n             Go sit over in that chair.\n   \n   Ordell moves over to a chair across from the couch.\n   Ordell still tries bullshit...\n   \n                       ORDELL\n             I'm tellin' you, those cops been\n             fuckin' wit your mind. They turn\n             black against black, that's how they\n             do.\n   \n                       JACKIE\n             Shut your raggedy ass up and sit\n             down.\n   \n   Ordell sits.\n   \n                       JACKIE (CONT'D)\n             Put both hands behind our head.\n   \n   Ordell does...\n   \n                       ORDELL\n             This shits gettin silly now...\n   \n   Jackie turns the halogen lamp to light.\n   \n                       JACKIE\n             I gotta tell you to shut up one more\n             time, I'm gonna shut you up.\n   \n   Jackie sits down on the couch, holding a gun in each\n   hand, both pointed dead at Ordell.\n   \n   A coffee table lays between them.\n   \n   Ordell, hands behind his head, continues to mumble...\n   \n                       ORDELL\n             I just came here to talk.\n   \n                       JACKIE\n             Way I see it, me and you only got one\n             thing to talk about. What you willing\n             to do for me?\n   \n   Ordell looks at her a moment and says;\n   \n                       ORDELL\n             Well, I can get you a good lawyer -\n   \n   Jackie shakes her head \"no!\"\n   \n                       JACKIE\n             Let's get realistic, baby. Sooner or\n             later they're gonna get around to\n             offering me a plea deal, and you know\n             that. That's why you came here to\n             kill me.\n   \n                       ORDELL\n             - Baby, I didn't -\n   \n                       JACKIE\n             - It's okay. I forgive you. Now,\n             let's say if I tell on you, I walk.\n             And if I don't, I go to jail.\n   \n   Ordell, very interested.\n   \n                       ORDELL\n             Yeah?\n   \n                       JACKIE\n             One hundred thousand put in an escrow\n             account in my name, if I'm convicted\n             up to a year, or put on probation. If\n             I have to do more than a year, you\n             pay another hundred thousand.\n   \n   Ordell just takes in what the woman said.\n   \n                       ORDELL\n             I got a problem...\n   \n                       JACKIE\n             All your money's in Mexico.\n   \n   Ordell has to smile at the woman.\n   \n                       ORDELL\n             Yeah.\n   \n                       JACKIE\n             I been thinkin about that, too, and I\n             got me a idea.\n   \n                                               TIME CUT:\n   \n   \n   DOORWAY\n   \n   Ordell goes through FRAME, out the door, Jackie steps\n   into FRAME, and talks with him.\n   \n                       JACKIE\n             I'll talk to the cops tomorrow and\n             tell you if it's on.\n   \n                       ORDELL (O.S.)\n             Talk to you tomorrow.\n   \n   Ordell leaves.\n   \n   Jackie shuts the door, and leaves FRAME.\n   \n                                               FADE TO BLACK\n   \n   \n   OVER BLACK\n   \n   We hear a knock-knock on the door.\n   \n                                               FADE UP ON:\n   \n   \n   SAME SHOT DORWAY\n   \n   Except it's day. Jackie in a bathrobe steps into FRAME\n   and opens the door. She says to the yet-unseen-by-camera\n   visitor;\n   \n                       JACKIE\n             You want your gun, don't you? Come\n             in. I'll go get it.\n   \n   She leaves FRAME, and Max enters it, closing the door\n   behind him. Max stands by the door, a little surprised\n   and a touch pissed at the nonchalantness.\n   \n   As he stands on the threshold to her living room, waiting\n   for her to return with the gun, feeling foolish, he\n   thinks about hauling her ass back to the stockade.\n   That'll change her expression, he'd bet.\n   \n   She returns from the bedroom, gun in hand, wearing a sort\n   of sad smile.\n   \n                       JACKIE (CONT'D)\n             Max, I'm sorry. I was afraid if I\n             asked to borrow it you'd say no.\n             You'd have to. Would you like some\n             coffee?\n   \n   Then, as quickly as the anger rose in Max, it dissipates\n   completely, leaving only curiosity.\n   \n                       MAX\n             If you're having some.\n   \n                       JACKIE\n             I am. Have a seat.\n   \n   Jackie head to the kitchen, making the coffee. Max sits\n   at the dining table off of the kitchen.\n   \n                       MAX\n             You get a chance to use it?\n   \n                       JACKIE\n             I felt a lot safer having it. My milk\n             went bad when I was in jail.\n   \n                       MAX\n             Black's fine.\n   \n   She puts a finger in the coffeemaker and starts scooping\n   coffee in it.\n   \n                       MAX (CONT'D)\n             You want to hang on to it awhile? It\n             wouldn't be legal, but if it makes -\n   \n   Jackie goes to the sink, filling the coffee pot.\n   \n                       JACKIE\n             Thanks, but I have my own now.\n   \n                       MAX\n             You went out this morning and bought\n             a gun?\n   \n   She turns off the water.\n   \n                       JACKIE\n             What, I couldn't hear you?\n   \n                       MAX\n             You went out this morning and bought\n             a gun.\n   \n   Pouring water into the coffee machine.\n   \n                       JACKIE\n             Let's just say I got one, okay?\n   \n   She turns on the coffeemaker.\n   \n                       MAX\n             Somebody loan it to you?\n   \n                       JACKIE\n             Yeah.\n   \n   Jackie leaves the kitchen.\n   \n   Max's eyes follow her to the living room.\n   \n                       JACKIE (CONT'D)\n             Want to hear some music?\n   \n                       MAX\n             Sure.\n   \n   Jackie ends her knees and goes through a stack of records\n   leaned up against the wall on the floor.\n   \n                       JACKIE\n             I couldn't wait till I got home last\n             night and wash my hair.\n   \n                       MAX\n             It looks nice.\n   \n   She finds a record, takes it out of the pile, removes the\n   album from the sleeve, and places it on her stereo\n   turntable.\n   \n                       MAX (CONT'D)\n             You never got into the whole CD\n             revolution?\n   \n                       JACKIE\n             I got a few. But I can't afford to\n             start all over again. I got too much\n             time and money invested in my\n             records.\n   \n   The song starts; it's an old romantic soul music number\n   from the early seventies.\n   \n                       MAX\n             Yeah, but you can't get new stuff on\n             records.\n   \n   Jackie picks up her cigarettes off the coffee table.\n   \n                       JACKIE\n             I don't buy new stuff that often.\n   \n   Jackie enters the kitchen door frame by Max. She lights a\n   cigarette and stands.\n   \n   Max listens to the soul song.\n   \n                       MAX\n             This is pretty.\n   \n                       JACKIE\n             Uh-huh.\n   \n                       MAX\n             Who is this?\n   \n                       JACKIE\n             The Delfonics.\n   \n                       MAX\n             '76?\n   \n                       JACKIE\n             '74, I think.\n   \n                       MAX\n             It's nice.\n   \n   They listen for a moment.\n   \n                       JACKIE\n             I called in sick this morning. As far\n             as the airline knows, I'm still\n             available.\n   \n                       MAX\n             Are you?\n   \n                       JACKIE\n             I don't know yet. 'm going to talk\n             with Dargus and Nicolet today. Do\n             what you suggested. Offer to help and\n             see what happens.\n   \n                       MAX\n             What I meant was have a lawyer do the\n             negotiating for you.\n   \n                       JACKIE\n             I want to talk to them first. I know\n             more now about Ordell's money.\n   \n                       MAX\n             Well, if the A.T.F. guy is the one\n             who wants you, that'll only interest\n             him up to a point.\n   \n                       JACKIE\n             It's a lot of money. About a half-a-\n             million dollars. All of it in Cabo in\n             safe deposit boxes and more comin in.\n   \n                       MAX\n             How'd you find that out?\n   \n                       JACKIE\n             He told me last night.\n   \n                       MAX\n             He called you?\n   \n                       JACKIE\n             He came by.\n   \n                       MAX\n             What?... What'd you do?\n   \n                       JACKIE\n             We talked.\n   \n   Jackie goes back in the kitchen. Coffee's almost there,\n   but not quite. She pulls down two mugs from a cabinet.\n   \n                       JACKIE (CONT'D)\n             He had his doubts at first. But he's\n             always trusted me an wants more than\n             anything to believe he still can.\n   \n                       MAX\n             Why?\n   \n                       JACKIE\n             He needs me. Without me all that\n             money is just gonna sit over there in\n             Cabo. Sugar?\n   \n                       MAX\n             No thanks. There's gotta be other\n             ways to get it out.\n   \n   She pours the coffee.\n   \n                       JACKIE\n             Maybe, but 'm the only one he's ever\n             used. He can't trust his other\n             people. They're crooks. He can try\n             bringing I in himself, but Ordell\n             sure don't want to go through no\n             Customs line. Either he recruits\n             another Cabo stewardess, or he\n             continues to trust me. I made him\n             feel he still can.\n   \n   Jackie walks to the table with the two coffee mugs and\n   sits down.\n   \n                       MAX\n             How do you get it out?\n   \n                       JACKIE\n             Same way I been don', but first they\n             got to let me go back to work.\n   \n                       MAX\n             You're gonna offer to set him up?\n   \n                       JACKIE\n             If I get let off. Otherwise, fuck\n             'em.\n   \n                       MAX\n             It's very possible Ordell's killed\n             somebody.\n   \n                       JACKIE\n             I ain't goin' to jail, and I ain't\n             doin' that probation thing again.\n   \n   Max watches her a moment\n   \n   Jackie takes a drink of coffee.\n   \n                       JACKIE (CONT'D)\n             How do you feel about getting old?\n   \n                       MAX\n             You're not old. You look great.\n   \n                       JACKIE\n             I'm asking how you feel. Does it\n             bother you?\n   \n                       MAX\n             It's not really something I think\n             about.\n   \n                       JACKIE\n             Really?\n   \n                       MAX\n             Okay, I'm a little sensitive about my\n             hair. It started falling out ten\n             years ago. So I did something about\n             it.\n   \n                       JACKIE\n             How'd you feel about it?\n   \n                       MAX\n             I'm fine with it, or I wouldn't of\n             done it, I did it to feel better\n             about myself, and I do. When I look\n             in the mirror it looks like me.\n   \n                       JACKIE\n             It's different with men.\n   \n                       MAX\n             You know, I can't really feel too\n             sorry for you in that department.\n   \n   Jackie smiles.\n   \n                       MAX (CONT'D)\n             In fact, I'd make a bet that except\n             possibly for an Afro - you look\n             exactly the same as you did at twenty\n             nine.\n   \n   Jackie smiles into her coffee.\n   \n                       JACKIE\n             My ass ain't the same.\n   \n                       MAX\n             Bigger?\n   \n                       JACKIE\n             Yeah.\n   \n   Max smiles.\n   \n                       MAX\n             Nothin wrong with that.\n   \n   Jackie's smile grows bigger.\n   \n                       MAX (CONT'D)\n             Does something else worry you?\n   \n                       JACKIE\n             I just feel like I'm always starting\n             over. You said how many bonds you\n             wrote?\n   \n                       MAX\n             Fifteen thousand.\n   \n                       JACKIE\n             Well, I've flown seven million miles.\n             And I've been waitin' on people\n             almost twenty years. The best job I\n             could get after my bust was Cabo Air,\n             which is about the worst job you can\n             get in this industry. I make about\n             sixteen thousand, with retirement\n             benefits , ain't worth a damn. And\n             now with this arrest hanging over my\n             head, I'm scared. If I lose my job I\n             gotta start all over again, but I got\n             nothin to start over with. I'll be\n             stuck with whatever I can get. And\n             that scares me more than Ordell.\n   \n                                               DISSOLVE TO:\n   \n   \n   INT. LOS ANGELES POLICE DEPARTMENT - DAY\n   \n   A.T.F. man, Ray Nicolet, moves down the hallway of the\n   big building... ten heads for the office of Mark Dargus.\n   \n   He reaches the closed door... raps on it.\n   \n                       DARGUS (O.S.)\n             Come in.\n   \n   Nicolet opens the door, revealing Dargus and Jackie Brown\n   sitting in the office talking.\n   \n                       DARGUS (CONT'D)\n             Great, you're here.\n   \n                       NICOLET\n             Hey, Jackie.\n   \n   Jackie waves.\n   \n   Dargus stands up and says to Jackie;\n   \n                       DARGUS\n             Let me have a word outside with Agent\n             Nicolet for a moment?\n   \n                       JACKIE\n             Take your time.\n   \n                       DARGUS\n             Thanks.\n   \n                       NICOLET\n             Well just be a minute.\n   \n                       JACKIE\n             Can I smoke?\n   \n                       DARGUS\n             Go ahead.\n   \n   The two detectives step outside and close the door on\n   Jackie as she pulls out her cigarettes.\n   \n                       NICOLET\n             What's going on?\n   \n                       DARGUS\n             She wants to make a deal.\n   \n                       NICOLET\n             She sound scared?\n   \n                       DARGUS\n             She almost sounds scared.\n   \n                       NICOLET\n             What's she want?\n   \n                       DARGUS\n             She wants to go back to work.\n   \n                       NICOLET\n             What's she willing to give us?\n   \n                       DARGUS\n             She hasn't one into specifics yet,\n             she's been waiting for you.\n   \n                       NICOLET\n             She knows it's my case?\n   \n                       DARGUS\n             She ain't said it, but she's not\n             stupid, she knows it's you who wants\n             her.\n   \n   \n   CLOSEUP JACKIE\n   \n   Inside Dargus' office, smoking a Mild Seven.\n   \n   Dargus and Nicolet come back inside.\n   \n                       NICOLET\n             Thanks for waiting, Jackie. Now tell\n             me, what can we do for you?\n   \n                       JACKIE\n             I need permission to leave the\n             country so I keep my job.\n   \n                       NICOLET\n             We can look into that.\n   \n                       JACKIE\n             I need it tomorrow. If I don't show\n             up for work tomorrow, I'm fired.\n   \n                       NICOLET\n             You know what we want.\n   \n                       JACKIE\n             If I'm working, I can help you.\n   \n                       DARGUS\n             Help us do what?\n   \n                       JACKIE\n             Help you get Ordell Robbie.\n   \n                       NICOLET\n             Oh, so now you know him?\n   \n                       JACKIE\n             You never asked me if I did or not.\n   \n                       DARGUS\n             But now you're telling us now you do.\n   \n                       JACKIE\n             'Course I do - I deliver money for\n             him.\n   \n                       NICOLET\n             No shit. You know how he makes hi\n             money?\n   \n                       JACKIE\n             He sells guns.\n   \n                       NICOLET\n             You ever see him sell guns?\n   \n                       JACKIE\n             No.\n   \n                       NICOLET\n             Then how do you know he sells guns?\n   \n                       JACKIE\n             He told me. Besides, why else would\n             an A.T.F. man be after him?\n   \n                       NICOLET\n             How can you help us?\n   \n                       JACKIE\n             Short of wearing a wire, I'll do\n             everything I can to help you throw\n             his ass in jail. And in exchange for\n             my help, I need permission to leave\n             the country and immunity.\n   \n                       DARGUS\n             You don't want much, do you?\n   \n                       JACKIE\n             Can you do it or not?\n   \n   The two cops look at each other.\n   \n                       DARGUS\n                   (to Nicolet)\n             It's your call.\n   \n   Nicolet looks at Jackie.\n   \n                       NICOLE\n             It's possible.\n   \n                                               FADE TO BLACK\n   \n   \n   TITLE CARD:\n   \n   \"LOUIS GARA & MELANIE\"\n   \n                                               CUT TO:\n   \n   \n   FADE UP ON ON TV\n   \n   Helmut Berger slaps a woman in the face with a newspaper,\n   proclaiming he's the \"mad dog.\" The film is an Italian\n   Policier from the seventies.\n   \n   Melanie sits in a comfy chair long-ways, bare legs\n   hanging over the arm. As she watches the TV, she picks up\n   a big bong with it's own handle. He takes a hit.\n   Melanie's dressed in her usual Melanie-uniform of shorts\n   and a loose top.\n   \n   The front door opens, and Ordell and Louis walk through\n   it carrying shopping bags.\n   \n                       ORDELL\n             We're back.\n   \n                       MELANIE\n             'Ola!\n   \n   We notice that Louis is sportin' new duds. Louis' new\n   \"look\" is a retro seventies-style bowling shirt and black\n   jeans.\n   \n   Melanie notices the change.\n   \n                       MELANIE (CONT'D)\n             Hey, hey, hey. I think somebody's got\n             some new clothes.\n   \n                       ORDELL\n             We been shoppin'. Can't have my boy\n             running around lookin' like a bum on\n             the street.\n   \n                       LOUIS\n             I didn't look like a bum.\n   \n                       ORDELL\n             But you did have a Salvation Army-\n             thing going.\n   \n   Ordell notices the bong in her hand and the smoke in the\n   air.\n   \n                       ORDELL (CONT'D)\n             Goddam, girl. You gettin' high\n             already. It's only two o'clock.\n   \n   Melanie smiles.\n   \n                       MELANIE\n             It's that late?\n   \n   Louis sits on the couch. He smiles at the comeback.\n   \n                       ORDELL\n             Ha-ha-ha. I'm serious, you smoke too\n             much of that shit. That shit robs you\n             of your ambition.\n   \n                       MELANIE\n             Not if your ambition is to get high\n             and watch TV.\n   \n   Melanie and Louis laugh.\n   \n   The phone rings.\n   \n                       ORDELL\n             You two a coupla Cheech and Chongs,\n             ain't ya.\n                   (he moves towards the\n                   phone - to Melanie)\n             Oh, that's okay, I'll get it.\n   \n   He picks it up.\n   \n                       ORDELL\n             Hello.\n                   (pause)\n             Hey, Jackie...\n                   (throwing a hard look at\n                   Melanie)\n   \n   No, Jackie, I didn't get your message.\n   \n                       MELANIE\n             I was gonna tell you...\n   \n   Ordell gives her a \"silence\" gesture and look.\n   \n   Melanie trades a look with Louis like \"I'm in trouble,\"\n   all the while smiling like a shark.\n   \n   Louis smiles to himself.\n   \n   Melanie holds up the bong, offering him a hit.\n   \n   Ordell's on the phone.\n   \n                       ORDELL\n             No, not on the phone, let's meet\n             somewhere. But you gotta make sure\n             they ain't followin' you...\n   \n   Louis has the bong in front of him.\n   \n   Melanie stays in her chair long-ways.\n   \n                       LOUIS\n             Is it ready to go?\n   \n                       MELANIE\n             Yeah, there's another hit left.\n   \n   Louis takes it.\n   \n   Ordell's on the phone.\n   \n   \n   INT. COCKATOO INN\n   \n   Jackie sits at the bar talking on their phone. We see\n   both sides.\n   \n                       JACKIE\n             The Cockatoo Inn.\n   \n                       ORDELL\n             The Cockatoo Inn? Where's that?\n   \n                       JACKIE\n             It's right on Hawthorne Boulevard and\n             Manhattan Beach Boulevard. It's red\n             brick...\n   \n                       ORDELL\n             Oh, wait, you mean that place that\n             has the big sign with a rooster on\n             it?\n   \n                       JACKIE\n             It's a cockatoo.\n   \n   Louis exhales his smoke, does an older man cough.\n   \n                       MELANIE\n             You okay?\n   \n                       LOUIS\n             Yeah, I'm just gettin' old. I can't\n             smoke or laugh now it seems without\n             coughing.\n   \n                       MELANIE\n             Coughing opens up the capillaries.\n             When you cough, you're getting air -\n             in this case smoke - to parts of the\n             lung that don't normally get used.\n             Coughing's good - gets ya higher. My\n             dad coughs when he smokes all the\n             time.\n   \n   Ordell hangs up the phone.\n   \n                       ORDELL\n                   (to Louis)\n             Hey, Louis, I have to go out awhile.\n             So since you like gettin' high so\n             much, why don't you stay here with\n             Melanie, get high, and watch\n             cartoons?\n   \n   Louis with a smile.\n   \n                       LOUIS\n             Way ahead of you.\n   \n   Melanie laughs.\n   \n   Ordell takes the remote control and turns the station\n   till he finds a channel with cartoons.\n   \n                       ORDELL\n             So you just watch this for the next\n             three hours, and I'll be back. Then,\n             when I'm through with all my\n             business, I'll get high. I get high\n             at night. Walk me to the door, space\n             girl.\n   \n   Melanie climbs out of the chair and walks Ordell to the\n   door,\n   \n   Ordell says to her in the doorway;\n   \n                       ORDELL (CONT'D)\n             Hope you don't mind keeping him\n             company.\n   \n                       MELANIE\n             No problem.\n   \n                       ORDELL\n             Try not to rip his clothes off 'em\n             they're new.\n   \n   Melanie gives him a sarcastic, \"Oh, you're so funny\"\n   look.\n   \n   Ordell kisses her quick on the mouth, then says past her;\n   \n                       ORDELL (CONT'D)\n             I'll be back in an hour, man. Just\n             hang with Mel.\n   \n   Ordell leaves and Melanie closes the door. She turns\n   around and looks at Louis.\n   \n                       MELANIE\n             Want a Metrix?\n   \n                       LOUIS\n             What's a Metrix?\n   \n   She crosses to the kitchen.\n   \n                       MELANIE\n             It's like this major meal in a shake\n             you drink instead of having a big\n             meal.\n   \n                       LOUIS\n             It's a diet thing?\n   \n                       MELANIE\n             No, it's what body builders drink to\n             beef up.\n   \n                       LOUIS\n             No thanks.\n   \n   She goes into the kitchen and starts making her Metrix\n   shake.\n   \n   He looks around and spots something interesting.\n   \n   \n   TWO SMALL PHOTOGRAPHS\n   \n   In a clear, plastic frame. Melanie, circa 1976, at about\n   sixteen wearing roller-disco skates. Melanie, in a green\n   setting, about five years ago, wearing a pretty Oriental-\n   style dress, with a \"smile for the camera\" look on her\n   face. The photo was obviously a picture of Melanie with\n   somebody else that's been cut in half. Somebody's\n   disembodied arm still rests on her shoulder.\n   \n   Louis picks up the photo frame.\n   \n                       LOUIS\n             How old were you here?\n   \n   She looks and sees what he's talking about.\n   \n                       MELANIE\n             Which one?\n   \n                       LOUIS\n             The roller disco one.\n   \n                       MELANIE\n             Fourteen.\n   \n   Louis walks over.\n   \n                       LOUIS\n             You're fourteen years old here?\n   \n                       MELANIE\n             Yeah.\n   \n                       LOUIS\n             I thought you were sixteen.\n   \n                       MELANIE\n             I was pretty much the same height now\n             as I was then.\n   \n                       LOUIS\n             Were you a disco girl?\n   \n                       MELANIE\n             Noooo, I was a surfer girl. Besides,\n             I was only fourteen. I couldn't go to\n             discos.\n   \n                       LOUIS\n             So where did you go?\n   \n                       MELANIE\n             The beach. Or get high, drop acid at\n             a friend's place. I was a K.L.O.S.\n             girl. I hated disco.\n   \n   She hits Whip on her blender. It makes an infernal noise\n   till she hits Stop!\n   \n   Carrying the blender full of Metrix, she walks over and\n   looks at the picture.\n   \n                       MELANIE (CONT'D)\n             That was taken at a place called\n             \"Flippers.\" It was in Hollywood. Were\n             you in L.A. back then?\n   \n                       LOUIS\n             No.\n   \n                       MELANIE\n             Where were you?\n   \n                       LOUIS\n             Detroit.\n   \n                       MELANIE\n             With Ordell?\n   \n                       LOUIS\n             We had done time together already.\n   \n   Melanie drinks her Metrix.\n   \n                       MELANIE\n             Were you a disco guy?\n   \n                       LOUIS\n             No.\n   \n                       MELANIE\n             C'mon, don't lie.\n   \n                       LOUIS\n             I don't like dancing.\n   \n                       MELANIE\n             Did you ever go I one?\n   \n                       LOUIS\n             I went to a few just to meet women.\n             But I don't like to dance, and it's\n             so fuckin; loud. During that whole\n             scene I just drank in bars.\n                   (he points to the cut\n                   picture)\n             Who didn't make the cut?\n   \n                       MELANIE\n             That's a picture of me in Japan.\n   \n                       LOUIS\n             You been to Japan?\n   \n                       MELANIE\n             I lived there for about nine months.\n   \n                       LOUIS\n             You lived in Japan, when?\n   \n                       MELANIE\n             About five years ago.\n   \n                       LOUIS\n             Who's arm is that?\n   \n                       MELANIE\n             That's the guy I lived with... his\n             name was... Hir.Hirosh.\n   \n                       LOUIS\n             Must of made quite an impression.\n   \n                       MEALINE\n             I never got to know him, really. I\n             couldn't speak Japanese, and his\n             English was terrible. But I couldn't\n             say anything, because his English was\n             better than my Japanese.\n   \n                       LOUIS\n             That sounds like a problem.\n   \n                       MELANIE\n             Not really. We didn't have much to\n             say to each other anyway. I never got\n             to know him that well, but I knew\n             enough to know I wasn't missing much.\n             I keep that, because of all the\n             fuckin' time I was there, that's the\n             only picture I got of me in Japan.\n                   (she points beyond her\n                   shoulder)\n             That's Japan.\n   \n   Melanie looks up at Louis.\n   \n                       MELANIE\n             Wanna fuck?\n   \n                       LOUIS\n             Sure.\n   \n                                               FADE TO BLACK\n   \n   \n   OVER BLACK\n   \n   SUBTITLE:\n   \n   \"THREE MINUTES LATER\"\n   \n                                               FADE UP:\n   \n   \n   LOUIS\n   \n   Lies on the couch on his back and Melanie sits on top of\n   him. They're going at it like a couple of fuck monkeys.\n   Almost on the fade up, Louis cums.\n   \n                       MELANIE\n             That was fun.\n   \n   She hops off and OUT OF FRAME.\n   \n                       LOUIS\n             Yeah, that really hit the spot.\n   \n                       MELANIE (O.S.)\n             Now that's over, let's get to know\n             each other.\n   \n   \n   INT. MUSIC STORE - DAY\n   \n   CLOSEUP a rack of CDs all beginning with \"D\" are flipped\n   through, till it stops on one CD, \"The Best of the\n   DELFONICS.\"\n   \n   Max is standing in he soul music section o a music store.\n   He lifts out the CD and turns it over.\n   \n   It has the song Jackie played this morning.\n   \n   He smiles and takes the CD up to the register.\n   \n   CLOSEUP the COCKATOO INN neon sign, unlit during the day.\n   \n   \n   INT. THE COCKATOO INN - DAY\n   \n   Ordell walks into the dark red cocktail lounge in the\n   middle of the day and sees Jackie sitting at the bar\n   drinking a white wine. Old-school soul plays on the\n   jukebox. He sits next to her.\n   \n                       ORDELL\n             I gotta remember this place. This is\n             all right. Two minutes from your\n             crib, ten minutes from your work. Not\n             bad...\n   \n   A black bartender named FLOYD approaches Ordell.\n   \n                       FLOYD\n             What's your drink, brother?\n   \n                       ORDELL\n             Screwdriver.\n   \n                       FLOYD\n                   (to Jackie)\n             How you doin'?\n   \n                       JACKIE\n             I'm fine.\n   \n                       FLOYD\n             Yes, you are.\n   \n   Jackie smiles.\n   \n   Floyd makes Ordell's drink.\n   \n                       ORDELL\n             I bet you come here on a Saturday\n             night, you need nigga repellent keep\n             'em off your ass.\n   \n                       JACKIE\n             I do okay.\n   \n                       ORDELL\n             You a fine lookin' woman, Jackie. I\n             bet you do a damn sight better than\n             okay. You think anybody followed you?\n   \n                       JACKIE\n             I don't think so, but it don't really\n             matter. They know I'm meeting you.\n   \n                       ORDELL\n             How the fuck they know that?\n   \n                       JACKIE\n             I told them.\n   \n   Floyd comes back with Ordell's screwdriver.\n   \n                       FLOYD\n             Three twenty-five.\n   \n   Ordell digs in his pocket and gives Floyd a five.\n   \n                       ORDELL\n             Keep it.\n   \n                       FLOYD\n             Thank you, sir.\n   \n   Floyd leaves.\n   \n                       ORDELL\n                   (to Jackie)\n             You told em? You told em it's me?\n   \n                       JACKIE\n             They already know it's you.\n   \n                       ORDELL\n             Well, shit. That don't mean you gotta\n             confirm it!\n   \n                       JACKIE\n             Look, the only way I can get\n             permission to fly is if I agree to\n             help them. Which is what I have to\n             appear to be doing. So I give them\n             something they already know. You.\n   \n                       ORDELL\n             Didja tell 'em anything else?\n   \n                       JACKIE\n             I told them you got a half a million\n             dollars in Mexico, and you want me to\n             bring it here.\n   \n   Ordell freaks.\n   \n                       ORDELL\n             You told them that?\n   \n                       JACKIE\n             It's true, isn't it?\n   \n                       ORDELL\n             What the fuck's that got to do with\n             it?\n   \n                       JACKIE\n             They know I'm delivering for you. I\n             mention the half-million - they don't\n             give a fuck about that - They want\n             you with guns. So I say, well, if you\n             want proof he's getting paid for\n             selling them, let me bring the money\n             in.\n   \n                       ORDELL\n             What did they say?\n   \n   Jackie smiles.\n   \n                       JACKIE\n             Yes.\n   \n   Ordell smiles.\n   \n   They both slap palms.\n   \n                                               CUT TO:\n   \n   \n   INT. MELANIE'S BEACH APARTMENT - DAY\n   \n   CLOSEUP - Louis taking a hit off Melanie's bong.\n   \n   Louis and Melanie are back in the living room, kicking\n   back, taking bong hits.\n   \n   As Louis gets his hit, Melanie talks;\n   \n                       MELANI\n             ... so first he tries to get into the\n             cocaine business but realizes right\n             away that shit's too competitive.\n             Piss the wrong person off, you get\n             shot. So he says, fuck that - moves\n             over to guns. You can sell guns\n             wherever there's a demand. No one\n             gives a shit. He acts like he's this\n             big international arms dealer, when,\n             come on, the only people he ever sold\n             to were dopers.\n   \n   Louis finishes his hit and slides the bong back across\n   the coffee table to Melanie.\n   \n                       LOUIS\n             He seems to be making out.\n   \n   Referring to the bong.\n   \n                       MELANIE\n             Is it dead?\n   \n                       LOUIS\n             Yeah.\n   \n   She starts preparing a bowl.\n   \n                       MELANIE\n             Well, so far he is. But you have to\n             admit he's not too bright.\n   \n                       LOUIS\n             I wouldn't go so far as to say that.\n   \n   Melanie still preparing her bowl.\n   \n                       MELANIE\n             He moves his lips when he reads, what\n             does that tell ya. Let's say he's\n             streetwise. I'll give 'im that. He's\n             still a fuck-up.\n   \n   She takes a major bong hit... holds in the smoke... then\n   while holding in the smoke, says;\n   \n                       MELANIE (CONT'D)\n             He killed a man worked for him the\n             other night.\n   \n                       LOUIS\n             So what are you trying to tell me? I\n             should get out of here?\n   \n   Melanie lets out her stream of smoke and flashes her\n   shark smile.\n   \n                       MELANIE\n             That's not what I'm saying at all.\n             (pause) You know where he went?\n   \n                       LOUIS\n             No.\n   \n                       MELANIE\n             He went to meet that stewardess.\n   \n                       LOUIS\n             Does that bother you?\n   \n   Melanie lets out a sarcastic laugh.\n   \n                       MELANIE\n             Please.\n   \n                       LOUIS\n             You live with him.\n   \n                       MELANIE\n             I live here. He drops in and out. He\n             tell you about that half-million\n             dollars he's got in Mexico?\n   \n                       LOUIS\n             Uh-huh?\n   \n                       MELANIE\n             Course he did, he tells everybody\n             who'll listen. That's what he's doin'\n             with this stewardess. He's scheming\n             how he can get it over here.\n   \n                       LOUIS\n             And your point is?\n   \n                       MELANIE\n             Let him and that stewardess get that\n             money over here...\n   \n                       LOUIS\n             Uh-huh?\n   \n                       MELANI\n             ... and just take it from him.\n   \n   \n   INT. COCKATOO INN - DAY\n   \n   Jackie explaining the plan to Ordell.\n   \n                       JACKI\n             ... I make two deliveries. The first\n             one with ten thousand, like a dry\n             run. They watch it. See how it works.\n             Then we do a second delivery, when I\n             bring in the half mill.\n   \n                       ORDELL\n             Naw, naw, that's too much exposure. I\n             ain't goin anywhere near that money.\n   \n                       JACKIE\n             You don't have to. I told 'em you're\n             real careful. You never pick up money\n             yourself. You always send someone,\n             and I never know who it is.\n   \n                       ORDELL\n             That's a good idea.\n   \n                       JACKIE\n             If you just listen, you'll see it's a\n             damn good idea. The first time I do\n             it they're lurking about. They see me\n             hand the ten thousand to someone.\n   \n                       ORDELL\n             Who?\n   \n                       JACKIE\n             I don't know. One of your friends.\n   \n                       ORDELL\n             A woman.\n   \n                       JACKIE\n             If you want.\n   \n                       ORDELL\n             Yeah, I think a woman.\n   \n                       JACKIE\n             The next trip, when I come with all\n             the money, it'll look like I hand it\n             to the same one I did before...\n   \n                       ORDELL\n             But you don't?\n   \n                       JACKIE\n             No, I give it to someone else first.\n   \n                       ORDELL\n             And they follow the wrong one\n             thinkin' she's bringing it to me.\n   \n                       JACKIE\n             That's the idea.\n   \n                       ORDELL\n             So we need two people, two women.\n   \n                       JACKIE\n             Can you cover that?\n   \n                       ORDELL\n             I got the woman covered. Where you\n             thinkin' about doin' this?\n   \n                       JACKIE\n             I was thinkin' the Del Amo Mall. In\n             the food court.\n   \n                       ORDELL\n             I suppose you see a piece of this for\n             yourself?\n   \n                       JACKIE\n             Well, it's my plan. We're in this\n             together.\n   \n                       ORDELL\n             Yeah, but it's my money, and I don't\n             need me a partner.\n   \n                       JACKIE\n             I ain't your partner, I'm your\n             manager. I'm managing to get your\n             money out of Mexico, into America, in\n             your hands, and I'm managing to do\n             all this under the nose of the cops.\n             That makes me your manager, and\n             managers get fifteen percent.\n   \n                       ORDELL\n             Managers get ten percent.\n   \n                       JACKIE\n             That's an agent. Manager's get\n             fifteen percent.\n   \n                       ORDELL\n             I'll give ya ten.\n   \n                       JACKIE\n             Plus the same deal as before.\n   \n                       ORDELL\n             I can do that.\n   \n   They clink their glasses together.\n   \n   \n   CLOSEUP DIGITAL CLOCK\n   \n   It flips to 11:00 P.M.\n   \n   It's now getting late at night. Jackie comes home. She's\n   dressed differently than she was at the Cockatoo. In\n   fact, she looks like she's coming home from a date.\n   \n   She walks into her bedroom... kicks off her shoes...\n   takes her earring off, putting them on the night-stand by\n   the bed... she sees that her answering machine is\n   flashing. She hits play.\n   \n   We begin a SLOW ZOOM into the answering machine. Never\n   seeing Jackie again.\n   \n   The machine voice says;\n   \n                       MACHINE VOICE (O.S.)\n             You have on message. Sent at 8:06\n             P.M.\n   \n   Max's voice comes out of the machine.\n   \n                       MAX'S VOICE (O.S.)\n             Hi, Jackie. It's Max. I was just\n             calling to find out how everything\n             went today with A.T.F. If you want to\n             call me, my home number is 555-6788,\n             or you can reach me at my office,\n             which is 555-B-A-I-L. That's also on\n             the card I gave you when we first met\n             - I don't know if you still have that\n             - but it's on it - Oh, let me give\n             you my beeper number. It's 555-7839.\n             Okay, so I'll talk to you later. Hope\n             everything's well. Bye-bye.\n   \n                       MACHINE VOICE (O.S.)\n             End of message.\n   \n                                               FADE TO BLACK\n   \n                                               FADE UP ON:\n   \n   \n   EXT. DEL AMO MALL - DAY\n   \n   We se the huge Del Amo Mall from the parking area.\n   \n   A SUBTITLE reads:\n   \n   \"DEL AMO MALL TORRANCE, CALIFORNIA LARGEST INDOOR MALL IN\n   THE WORLD\"\n   \n   \n   INT. DEL AMO MALL - FOOD COURT - DAY\n   \n   The Del Amo Mall on a lazy midday in the middle of the\n   week. A few people, mostly black, mill around, but it's\n   not like it is on the weekend.\n   \n   The international food court, where fast-food versions of\n   international cuisine are available to all the hungry Del\n   Amo Mall shoppers.\n   \n   Jackie and Ordell sit at a table in the food court. She\n   drinks an iced tea from Teriyaki Donut. A collection of\n   Broadway shopping bags sit on the table.\n   \n   We join in mid-conversation.\n   \n                       JACKIE\n             The money's in a Broadway shopping\n             bag. I get some food, and sit down\n             here in the food court. Then your\n             girl comes - you got somebody yet?\n   \n                       ORDELL\n             Uh-huh.\n   \n                       JACKIE\n             Who?\n   \n                       ORDELL\n             What'd you care?\n   \n                       JACKIE\n             Look, it's my ass facin' the\n             penitentiary. You send some hard-\n             headed roc whore, and she fucks\n             things up.\n   \n                       ORDELL\n             I ain't gonna send no roc whore. The\n             woman's cool, I promise.\n   \n   \n   INT. DEL AMO MALL - U.A. CINEMAS - DAY\n   \n   We're outside the Del Amo UA Cinemas, a six-screen\n   theater that's been in the Del Amo Mall since the early\n   seventies. A small afternoon crowd is exiting the cinema,\n   having just watched their matinee. Max Cherry is among\n   them. He exits the theater, and strolls through the mall.\n   \n   \n   BACK TO JACKIE AND ORDELL\n   \n   In the food court.\n   \n   Ordell rises from the table.\n   \n   Jackie moves a Broadway bag towards him.\n   \n                       JACKIE\n             Don't forget your bag.\n   \n   He takes it.\n   \n   We follow with Ordell out of the food court, when he\n   stops...\n   \n   ... He see Max Cherry strolling through the mall.\n   \n   Ordell almost steps into a store to get out of view.\n   \"What the fuck is Max Cherry doing here?\"\n   \n   As Ordell watches, he sees Max head towards the food\n   court.\n   \n                       MAX\n             walks into the food court. He stands\n             looking a all the international fast\n             food choices in front of him. As he\n             tries to decide, he hears from behind\n             him;\n   \n                       JACKIE (O.S.)\n             Max.\n   \n   Max turns and sees Jackie siting there drinking her iced\n   tea, smoking her Mild Seven, and smiling up at him.\n   \n   Max smiles back.\n   \n                       MAX\n             Well, hello.\n   \n                       JACKIE\n             Surprise.\n   \n   He approaches her table.\n   \n                       MAX\n             I walked right past you.\n   \n                       JACKIE\n             I know, ignoring me. What're you up\n             to?\n   \n                       MAX\n             Catching a movie.\n   \n                       JACKIE\n             What'd ya see?\n   \n                       MAX\n             \"American Prseident\"\n   \n                       JACKIE\n             How was it?\n   \n                       MAX\n             Pretty good. Me and Annette Bening\n             are goin steady.\n   \n                       JACKIE\n             Oh, are you? Does she know that?\n   \n                       MAX\n             No...\n                   (sitting down at the\n                   table)\n             ... I don't believe she's ever heard\n             of me. But that doesn't mean we're\n             not going steady.\n   \n   \n   BACK TO ORDELL\n   \n   Watching Max sit down and make himself comfortable at\n   Jackie's table.\n   \n                       ORDELL\n                   (to himself)\n             What's up with this shit.\n   \n   \n   BACK TO MAX AND JACKIE\n   \n                       MAX\n             I think falling in live with movie\n             stars is something that happens to a\n             man as he gets older.\n   \n                       JACKIE\n             Does it happen to all men?\n   \n                       MAX\n             Well, I'd never be so bold as to\n             speak for all men, but as or myself\n             and a few of my friends, that's\n             definitely the case. There's a lot of\n             actresses out there you like, and\n             there's some you have crushes on. But\n             there's always one who you love. And\n             with her it's sorta like going\n             steady.\n   \n                       JACKIE\n             And Annette's it for you?\n   \n                       MAX\n             For now. These relationships never\n             last too long.\n   \n   With a smile on her face;\n   \n                       JACKIE\n             That's a goddam man for ya. Can't\n             even be faithful to a fuckin' movie\n             star.\n   \n   Max smiles.\n   \n                       JACKIE\n             Who was your girl before Annette?\n   \n                       MAX\n             Sandra Bullock. You know her?\n   \n                       JACKIE\n             Yeah, she's the girl who drove the\n             bus in \"Speed.\" She's cute.\n   \n                       MAX\n             She's adorable. But I had to end it.\n   \n                       JACKIE\n             Why?\n   \n                       MAX\n             I'm old enough to be her father.\n   \n                       JACKIE\n             How old's Annette?\n   \n                       MAX\n             I don't care.\n   \n   Gesturing to the Broadway bags on the table.\n   \n                       MAX\n             What're you, a bag lady?\n   \n                       JACKIE\n             I go back to work tomorrow.\n   \n                       MAX\n             You talk them into it?\n   \n                       JACKIE\n             They seem to like the idea.\n   \n                       MAX\n             Bring the money in and they follow\n             it?\n   \n                       JACKIE\n             Yea, but I'm going to dress it up.\n             Put the money in a shopping bag and\n             hand it to someone I meet here.\n   \n                       MAX\n             You don't actually do it that way?\n   \n                       JACKIE\n             He always just picked it up at my\n             place. But with A.T.F. involved, I\n             want to stage it. You know, make it\n             look more intriguing, like we know\n             what the fuck we're doin'. Then it's\n             up to Ray Nicolet, the A.T. F. guy to\n             follow the shopping bag.\n   \n                       MAX\n             Make the delivery somewhere in the\n             mall.\n   \n                       JACKIE\n             Right around here, in the food court.\n   \n                       MAX\n             Sit down, leave the bag under the\n             table?\n   \n   Jackie nods her head \"yes.\"\n   \n                       MAX (CONT'D)\n             Will Ordell go for that?\n   \n                       JACKIE\n             I'm helping him bring his money into\n             America. He loves the idea. You just\n             missed him.\n   \n                       MAX\n             He was here?\n   \n                       JACKIE\n             Yeah, we were goin' over everything.\n             That's why all the bags.\n   \n                       MAX\n             I called you last night.\n   \n                       JACKIE\n             I know, I got your message. Ray\n             wanted to have dinner. He wanted to\n             talk about the sting we're plotting.\n             That's what he calls it. A sting.\n             He's being real nice to me.\n   \n                       MAX\n             You think he's got a thing for you?\n   \n                       JACKIE\n             Maybe. But I'm thinking it might be\n             something like he wants the money for\n             himself.\n   \n                       MAX\n             I don't follow your logic. What does\n             his being nice to you have to do with\n             him wanting Ordell's money?\n   \n                       JACKIE\n             He's setting me up to make a\n             proposition.\n   \n                       MAX\n             I see.\n   \n                       JACKIE\n             You don't propose something like that\n             unless you're pretty sure the other\n             person's into it.\n   \n                       MAX\n             Has he hinted around?\n   \n                       JACKIE\n             Not really. But I knew this narcotics\n             cop one time. Told me that in a raid,\n             the whole package never gets back to\n             the station. His exact words.\n   \n                       MAX\n             You know some interesting people.\n   \n                       JACKIE\n             We weren't bullshittin' either,\n             'cause later he was suspended and\n             forced to retire.\n   \n                       MAX\n             Has Nicolet told you any colorful\n             stories like that?\n   \n   She shakes her head \"no.\"\n   \n                       JACKIE\n             He tries to act cool.\n   \n                       MAX\n             No harm in that. He's a young guy\n             havin' fun being a cop. I know the\n             type, trust me on this. He's more\n             interested in Ordell than the money.\n             If he's gonna do anything suspect,\n             it'll be cutting corners to get the\n             conviction; but he wouldn't walk off\n             with the money. It's evidence.\n   \n                       JACKIE\n             What about you Max?\n   \n                       MAX\n             What? If I was in Nicolet's place?\n   \n                       JACKIE\n             No, I mean you, right now. Not it you\n             were somebody else.\n   \n                       MAX\n             If I saw a way to walk off with a\n             shopping bag full of money, would I\n             take it?\n   \n                       JACKIE\n             You know where it came from. It's not\n             like it's anybody's life savings. It\n             wouldn't even be missed.\n   \n                       MAX\n             A half-a-million dollars will always\n             be missed.\n   \n                       JACKIE\n             You're avoiding the question.\n   \n                       MAX\n             Okay, sure. I might be tempted.\n             Especially now, since I'm getting out\n             of the bail bonds business.\n   \n   Jackie looks at him, \"wow, that was a statement,\" but she\n   doesn't say anything.\n   \n   Max continues.\n   \n                       MAX\n             I have to stand behind all my active\n             bonds, but I'm not writing any new\n             ones.\n   \n                       JACKIE\n             Why?\n   \n                       MAX\n             A lot of reasons. But the main one\n             would be I'm tired of it.\n   \n                       JACKIE\n             When did you decide?\n   \n                       MAX\n             It's been a long time coming. I\n             finally made up my mind - I guess it\n             was Thursday.\n   \n   FLASH ON:\n   \n   \n   A RELEASE FORM\n   \n   With a date on it. Jackie's hand is signing her name. We\n   WHIP UP and se her face, just as Max Cherry approaches\n   her, handing her his business card.\n   \n                       MAX\n             Hi, I'm Max Cherry. Your bail\n             bondsman.\n   \n   \n   BACK TO MAX AND JACKIE\n   \n                       JACKIE\n             The day you got me out of jail?\n   \n                       MAX\n             Yeah, that night I went to pick up a\n             guy. I hear he's staying at this\n             house, so I sneak in, wait for him to\n             come home.\n   \n                       JACKIE\n             Wait a minute. After we were together\n             you went and snuck into a guy's\n             house?\n   \n                       MAX\n             Uh-huh.\n   \n   \n   FLASH ON\n   \n   Max is dropping off Jackie at her apartment and saying\n   goodbye.\n   \n                       MAX (V.O.)\n             I dropped you off...\n   \n   Max finding no gun in his glove box.\n   \n                       MAX (V.O.)\n             Went to my office, found out you took\n             my gun...\n   \n   Max in his office, taking another pistol from his drawer,\n   and a stun gun.\n   \n                       MAX (V.O.)\n             Got another gun and a stun gun...\n   \n   \n   BACK TO MAX AND JACKIE\n   \n                       MAX\n             And went to this guy's house in El\n             Monte, and I waited for him.\n   \n                       JACKIE\n             What do you do when he comes home?\n   \n                       MAX\n             Shoot him with the stun gun. While\n             he's incapacitated, cuff him, take\n             'em to County.\n   \n                       JACKIE\n             You do that?\n   \n                       MAX\n             That's my job.\n   \n                       JACKIE\n             Did you do it that night?\n   \n                       MAX\n             He never came home. But I'm sitting\n             on the couch, in the dark, holding my\n             stun gun and the whole house smells\n             of mildew - So after a couple hours I\n             think, \"What am I doing here?\n             Nineteen years of this shit? So I\n             made up my mind, that's it.\n   \n                       JACKIE\n             And is that it?\n   \n                       MAX\n             More or less.\n   \n   Jackie takes a pause before saying;\n   \n                       JACKIE\n             I'm not sure you answered my\n             question.\n   \n                       MAX\n             Which one?\n   \n                       JACKIE\n             If you had a chance, unemployed now,\n             to walk off with a half-million\n             dollars, would you take it?\n   \n                       MAX\n             I believe I said I'd be tempted.\n   \n   Jackie smiles at him behind cigarette smoke.\n   \n                       MAX\n             Don't even think about it. You could\n             get yourself killed go to prison...\n   \n   \n   CLOSEUP JACKIE\n   \n                       JACKIE\n             What if I've figured a way?\n   \n   Hold for a few beats, then...\n   \n                                               FADE TO BLACK.\n   \n   \n   TITLE CARD:\n   \n   \"MONEY EXCHANGE 10,000\"\n   \n   Over this card, we hear an airplane landing.\n   \n                                               FADE UP:\n   \n   \n   CLOSEUP JACKIE\n   \n   Back at work, standing at the exit of her plane. All the\n   passengers are filtering out. She says goodbye.\n   \n                       JACKIE\n             Bye bye... Bye now... Goodbye Bye\n             bye... Bye bye... Goodbye\n   \n   \n   INT. LAX PARKING STRUCTURE - DAY\n   \n   Jackie, wearing her stewardess uniform, walks into the\n   LAX parking structure, pulling her bad on wheels behind\n   her.\n   \n   Nicolet and Dargus are waiting for her.\n   \n                       NICOLET\n             We gotta stop meeting this way.\n   \n   Jackie smiles. They all fall in step towards Jackie's\n   Honda.\n   \n   \n   INT. JACKIE'S HONDA - DAY\n   \n   The two cops and the black woman sit parked in her Honda.\n   She, behind the wheel, Nicolet next to her in the\n   passenger seat, Dargus in the backseat. Nicolet has the\n   flight bag in his lap. He's taking out the manila\n   envelope with the ten thousand inside. Their demeanor is\n   very different from the first time they met. The three\n   now almost act like friends.\n   \n                       DARGUS\n             How was your flight?\n   \n                       JACKIE\n             Fine.\n   \n                       DARGUS\n             Bet you're happy to be working again.\n   \n                       NICOLET\n             This is A.T.F. agent Ray Nicolet,\n             Jackie Brown, Ordell Robbie money\n             exchange trial run. It's three p.m.,\n             July 4th 1997. The location is the\n             parking structure at LAX.\n   \n                       JACKIE\n             What are you doing?\n   \n   Pointing to a small mike on his lapel.\n   \n                       NICOLET\n             I'm recording this.\n   \n                       JACKIE\n             I thought you were going to let this\n             one through.\n   \n                       DARGUS\n             We are. Don't worry about it.\n   \n                       NICOLET\n             Every step of this goes in my report.\n                   (back to report voice)\n             I am now taking a manila envelope\n             from the subject's flight bag.\n   \n   He opens it and takes out the ten thousand dollars.\n   \n                       NICOLET (CONT'D)\n             The envelope contains currency... all\n             the same denomination, one-hundred-\n             dollar bills. Now, I'm counting it.\n   \n                       DARGUS\n             What time do you have to be there?\n   \n                       JACKIE\n             Four thirty. I'm meeting a woman.\n   \n                       DARGUS\n             What's her name?\n   \n                       JACKIE\n             He wouldn't say. You gonna follow\n             her?\n   \n                       DARGUS\n             She leaves, somebody'll be on her.\n   \n                       JACKIE\n             But you're not going to stop her?\n   \n   Nicolet finishes counting, then hushes them up.\n   \n                       NICOLET\n             The envelope contains ten thousand\n             dollars. The subject will be\n             delivering the currency in a...\n   \n                       JACKIE\n             A Broadway shopping bag.\n   \n   She holds it up.\n   \n                       NICOLET\n             A Broadway shopping bag. A large bag\n             with handles and brown lettering.\n   \n   \n   EXT. DEL AMO MALL - DAY\n   \n   The huge Del Amo Mall.\n   \n   \n   INT. DEL AMO MALL - FOOD COURT - DAY\n   \n   The Del Amo Mall on another lazy midday in the middle of\n   the week.\n   \n   Max rides up an escalator in the mall. He casually\n   strolls through the mall, goes into a cappuccino bar\n   called \"BUSTA CAP\" across from the food court. Walking up\n   to the counter;\n   \n                       MAX\n             Caf\u008a mocha.\n   \n                       BUSTA CAP GIRL\n             You want whipped cream on that?\n   \n                       MAX\n             No, thanks.\n   \n   Max checks his watch: 4:30. He looks over at the food\n   court and spots Jackie sitting at a table by herself.\n   \n                                               FLASH ON:\n   \n   \n   INT. JACKIE'S APARTMENT - NIGHT\n   \n   Jackie on the phone with Max, dressed for bed (long t-\n   shirt and panties).\n   \n                       JACKIE\n             Think of it as money that shouldn't\n             even be here. I mean does anybody\n             have a right to it?\n   \n   \n   INT. CHERRY BAIL BONDS - NIGHT\n   \n   Max in his office on the phone.\n   \n                       MAX\n             The feds. It's evidence.\n   \n                       JACKIE\n             It may be evidence once they get\n             their hands on it, but right now it's\n             only money.\n   \n   \n   BACK TO MAX AT THE MALL\n   \n   He ponders his words as he watches her from a distance.\n   \n   \n   INT. FOOD COURT - DAY\n   \n   Jackie sits at a table by herself, eating Japanese food\n   from Teriyaki Donut and drinking an iced tea. As she eats\n   she hears;\n   \n                       YOUNG GIRL'S VOICE (O.S.)\n             Is this seat taken?\n   \n   Jackie looks up and sees a skinny YOUNG GIRL, black,\n   quite pretty, no older than twenty.\n   \n   She holds a tray filled with tacos, enchiladas, rice and\n   beans and a giant-sized Coke. She also has a Broadway\n   shopping bag hanging from her arm.\n   \n                       JACKIE\n             Have a seat.\n   \n   The Young Girl does.\n   \n   Jackie looks at her tray of food.\n   \n                       JACKIE (CONT'D)\n             You're hungry?\n   \n                       YOUNG GIRL\n             Yes'm.\n   \n   It would seem our Young Girl's from the South.\n   \n                       JACKIE\n             Put your bag on the floor, okay?\n             Under the table, right next to mine.\n   \n   The Young Girl who hasn't looked right at Jackie since\n   sitting down, bends sideways to glance under the table.\n   \n                       JACKIE (CONT'D)\n             Then when I leave, well, you know.\n             What's your name?\n   \n   She looks up...\n   \n                       YOUNG GIRL\n             Sherona?\n   \n   ... then back down at her tray.\n   \n                       JACKIE\n             Go ahead, start eating.\n   \n   Sheronda starts eating, head down, hunching close to the\n   tray.\n   \n                       JACKIE (CONT'D)\n             Would it bother you if I smoked?\n   \n   Without raising her head, she shakes it from side to\n   side.\n   \n   Jackie takes out a pack of Davidoffs and lights one up\n   with her yellow Bic. As she does this she observes\n   Sheronda eating.\n   \n                       JACKIE (CONT'D)\n             Sheronda, can I ask you a question?\n             Are you and Ordell married?\n   \n   Without raising her head.\n   \n                       SHERONDA\n             He say we like the same thing as\n             married.\n   \n                       JACKIE\n             Do you live together?\n   \n   Sheronda hesitates, then says without raising her head.\n   \n                       SHERONDA\n             Most of the times.\n   \n                       JACKIE\n             Not every day?\n   \n   Sheronda looks up at her...\n   \n                       SHERONDA\n             Sometimes every day, for a while.\n   \n                       JACKIE\n             Then you don't see him for a few\n             days?\n   \n   ... She looks back down.\n   \n                       SHERONDA\n             Yes'm.\n   \n                       JACKIE\n             You know what's in the bag you're\n             taking?\n   \n                       SHERONDA\n             He say is a surprise.\n   \n                       JACKIE\n             Well, Sheronda, it was nice talking\n             to you.\n   \n   Jackie picks up Sheronda's bag and leaves.\n   \n   \n   INT. DEL AMO MALL - BUSTA CAP - DAY\n   \n   Max drinking his caf\u008a mocha sans whipped cream, watches\n   Jackie leave the Young Girl and with Broadway bag in\n   hand, walk out of the food court.\n   \n   Max watches her walk down the mall when two young men in\n   sport coats, jeans, and cowboy boots step out of a B.\n   Dalton bookstore, stop her and begin talking. Knowing\n   they must be Nicolet and Dargus, he watches one of them\n   take the Broadway bag from Jackie and look inside. They\n   talk for a minute - it would seem about nothing too\n   serious. Jackie nods her head, listens to the two cops,\n   nods her head again, and then walks off.\n   \n   As he watches her walk away from the cops...\n   \n   FLASH ON:\n   \n   \n   JACKIE AND MAX ON PHONE\n   \n                       JACKIE\n             You said it yourself. Ray wants\n             Ordell, he don't give a shit about\n             the money. Money won't convict him,\n             guns will. Yeah, sure, if it falls in\n             their lap, they take it. If they know\n             they got it, they'll look for it...\n             but if they don't...\n   \n   \n   BACK TO MAX AT MALL\n   \n   Max watches the two cops turn their attention to the\n   young girl eating in the food court.\n   \n   Max watches her, too. The Young Girl continues to work\n   her way through her Mexican food, when she turns her head\n   to an OLDER BLACK WOMAN sitting at the next table. The\n   older woman says something, and the younger woman hands\n   her the ashtray Jackie was using.\n   \n   Max watches the Young Girl finish her food and get up\n   from the table. She stoops down to get the Broadway\n   shopping bag and walks out of the food court.\n   \n   Max watches Nicolet and Dargus let the Young Girl get a\n   little ahead, then follow after her. They're gone.\n   \n   Max turns back on the older woman all alone.\n   \n   She finishes the coffee she was drinking and stands up,\n   carrying - how about that? - A Broadway shopping bag. The\n   woman heads out of the mall.\n   \n   Max follows her.\n   \n   The older woman walks past us. She heads straight for the\n   exit.\n   \n   \n   EXT. DEL AMO MALL - PARKING LOT - DAY\n   \n   Max follows the woman outside.\n   \n   She walks down a line of cars, then gets in a big, tan\n   Mercury sedan. She drives of...\n   \n   ... but not before Max writes down her license plate\n   number.\n   \n   FLASH ON:\n   \n   \n   MAX AND JACKIE ON PHONE\n   \n                       MAX\n             You're rationalizing.\n   \n                       JACKIE\n             That's what you do to go through with\n             the shit you start. You rationalize.\n             I can do this, Max, I know I can. But\n             I can't do it without you.\n   \n   \n   INT. MAX'S CADILLAC - DAY\n   \n   Max climbs into his Seville, starts her up, and drives\n   out of the parking lot.\n   \n   \n   CLOSEUP MAX\n   \n   Driving down the street, lost in thought.\n   \n                       MAX\n                   (to himself)\n             It could work... If she handles the\n             cops right, I could work...\n   \n   He hits 'play' on the dash CD player. The Delfonics fill\n   the cab of the Caddy.\n   \n                                               CUT TO:\n   \n   \n   BLACK\n   \n   A garage door is lifted open, revealing Ordell and Louis.\n   \n   \n   EXT. STORAGE FACLITY - DAY\n   \n   Ordell and Louis are at Mr. Robbie's storage facility. A\n   VAN is backed up nect to the opening. The facility is\n   pitch black. Ordell ahs a big flashlight in his hand.\n   \n                       ORDELL\n             Check this out.\n   \n   He turns on the flashlight.\n   \n   He shines the beam into darkness. We see the facility is\n   filled to the gills with machine guns, shotguns, uzis, a\n   rocket launcher, and handguns of many types.\n   \n                       LOUIS\n             How much is there?\n   \n                       ORDELL\n             Over half-million dollars worth of\n             merchandise.\n   \n   Ordell opens the back doors of the van. They start\n   unloading machine guns and boxes of ammo.\n   \n                       LOUIS\n             Can I ask you about Melanie?\n   \n                       ORDELL\n             Sure.\n   \n                       LOUIS\n             What's your relationship?\n   \n                       ORDELL\n             She one of the women I got set up. I\n             got Melanie in Hermosa Beach. I rent\n             Simone a small house in Compton, and\n             about four blocks away I got me this\n             nineteen-year-old country girl named\n             Sheronda. I found her waitin' for a\n             bus two days outta Alabama, barefoot,\n             country as a chicken coop. Took her\n             to my house in Compton, told her it\n             was Hollywood.\n   \n                       LOUIS\n             She believed you?\n   \n                       ORDELL\n             Hell, yeah. To her dumb country ass,\n             Compton is Hollywood. Close as she's\n             ever been, anyway.\n   \n   They both laugh together.\n   \n                       LOUIS\n             Do you trust Melanie?\n   \n   Ordell stops unloading.\n   \n                       ORDELL\n             If this is about you fucked Melanie,\n             I don't give a damn. I ain't a fool.\n             I leave you alone with a bitch like\n             Melanie, you're gonna be fuckin' that\n             twenty minutes after I'm out the\n             door. So say \"thank you\" and I'll\n             tell you, \"you're welcome.\"\n   \n                       LOUIS\n             That's not what I meant when I asked\n             did you trust her.\n   \n   Ordell looks at him.\n   \n                       ORDELL\n             She tryin' to work your ass against\n             me, ain't she?\n   \n                       LOUIS\n             Yep.\n   \n                       ORDELL\n             You didn't even hafta say it. I know\n             the woman.\n   \n                       LOUIS\n             Well, why the fuck keep her around?\n   \n                       ORDELL\n                   (smiling)\n             'Cause she my fine little surfer gal.\n             She can't do me no harm. Fact she\n             think she can play you against me\n             shows how little she knows. You could\n             teach that bitch for days how it is\n             'tween me an you, she never\n             understand a damn word.\n   \n                       LOUIS\n             Why do you let someone know your\n             business you can't trust?\n   \n                       ORDELL\n             I don't hafta trust her, I know her.\n   \n                       LOUIS\n             What does that mean?\n   \n                       ORDELL\n             You can't trust Melanie. But you can\n             always trust Melanie to be Melanie.\n   \n   Louis starts unloading.\n   \n                       LOUIS\n             I still don't understand why you keep\n             her around.\n   \n                       ORDELL\n             I told you, man.\n                   (smiling)\n             She my fine little surfer gal.\n   \n   \n   EXT. MELANIE'S APARTMENT BUILDING - DAY\n   \n   EXTREME CLOSEUP - Jackie's finger presses a small black\n   button next to the\n   handwritten name, \"M. RALSTON.\"\n   \n   \n   EXTREME CLOSEUP SPEAKER BOX\n   \n                       MELANIE'S VOICE (O.S.)\n                   (coming out of it)\n             What?\n   \n   \n   JACKIE\n   \n   Bends down to talk in the speaker.\n   \n                       JACKIE\n             It's Jackie.\n   \n   \n   INT. MELANIE'S APARTMENT HALLWAY - DAY\n   \n   Jackie walks down the hallway and finds the door.\n   \n   She rings the doorbell.\n   \n   The door opens, she sees Melanie (for the first time) on\n   the other side. Melanie, dressed in a t-shirt, cut offs,\n   doesn't say a word - just turns around and walks away.\n   \n   Once Melanie leaves, she sees Ordell standing inside the\n   apartment, screwdriver in hand, yelling after Melanie;\n   \n                       ORDEL\n             ... Now she's gonna pout...\n   \n   He turns his attention to Jackie.\n   \n                       ORDELL (CONT'D)\n             Hey, Jackie, c'mon in.\n   \n   Jackie steps inside.\n   \n   She sees Louis (for the first time) sitting on the couch.\n   \n   Ordell says to Louis, but loud enough for Melanie in the\n   other room to hear;\n   \n                       ORDELL (CONT'D)\n             She gonna hafta find her sandals...\n             find her bag... find her\n             sunglasses... take twenty damn\n             minutes get her ass out the door.\n                   (to Jackie)\n             Jackie - his is Louis, Louis -\n             Jackie. And the chick stompin' around\n             in the other room is Melanie.\n   \n   Melanie comes out of the bedroom with her sunglasses,\n   sandals, bag strung across her shoulders and her keys in\n   her hand. She makes a bee-line towards the door without\n   saying nothin' to nobody.\n   \n                       ORDELL (CONT'D)\n             You have a nice time, hear?\n   \n   The door SLAMS behind her.\n   \n   Ordell looks to Jackie, raises his screwdriver and says;\n   \n                       ORDELL (CONT'D)\n             Drink?\n   \n                       JACKIE\n             I need to talk to you alone.\n   \n   \n   EXT. MELANIE'S APARTMENT - BALCONY - DAY\n   \n   Ordell and Jackie on the balcony.\n   \n                       JACKIE\n             I don't want no more fuckin'\n             surprises. We do this the way I laid\n             it out, or we don't do it at all.\n   \n                       ORDELL\n             What the hell you talkin' bout?\n   \n                       JACKIE\n             Sheronda passin' the money onto\n             someone else, that's what the hell\n             I'm talkin' 'bout.\n   \n                       ORDELL\n             How do you know she did that?\n   \n                       JACKIE\n             I was there, I saw her do it.\n   \n                       ORDELL\n             Well, you weren't supposed to be\n             there.\n   \n                       JACKIE\n             I know, but I hung around, 'cause I\n             figured you'd try an' pull some shit\n             like this.\n   \n                       ORDELL\n             Now, hold on there. I ain't pullin'\n             no shit. It's my money, I can do\n             whatever the fuck I wanna do with it.\n   \n                       JACKIE\n             Not when it's my ass on the line you\n             don't. We do this my way or fuck it.\n   \n   Ordell tries to stop the hostile back and forth.\n   \n                       ORDELL\n             Just chill the fuck out, Jackie. It\n             ain't no big thing. The woman you saw\n             was my friend, Simone. She's the one\n             gonna be receiving the money, so I\n             just wanted her to see how it works.\n             She'll be here any minute. Nice\n             woman, you'll like her.\n   \n   Ordell opens the sliding glass and says to Louis in the\n   living room;\n   \n                       ORDELL\n             Louis, call Simone and tell her to\n             get her tail over here. We're waitin'\n             on her ass.\n   \n   Louis gets up to make the call.\n   \n   Ordell turns back to Jackie and smiles, holding up his\n   screwdriver.\n   \n                       ORDELL (CONT'D)\n             I'm about ready for a refill. Sure I\n             can't tempt you?\n   \n   \n   INT. MELANIE'S APARTMENT - DAY\n   \n   Ordell and Jackie sit on stools around the kitchen\n   counter/bar. Louis sits with them on the phone, silent.\n   \n                       JACKIE\n             Nicolet and Dargus stop me at the\n             airport and mark the bills.\n   \n                       ORDELL\n             Man, I don't like that part.\n   \n                       JACKIE\n             It washes off. I tell them we're\n             doing it the same way as before.\n             They'll follow Sheronda. I hate the\n             idea of leaving her for a fall.\n   \n                       ORDELL\n             She won't have no problems 'cause she\n             don't know nothin'.\n   \n                       JACKIE\n             Are you sure she don' know about the\n             money?\n   \n                       ORDELL\n             She don't know shit about the money.\n   \n                       JACKIE\n             What does she think she's gettin?\n   \n                       ORDELL\n             I told her this is a game us rich\n             folks play, exchanging gifts. Like a\n             scavenger hunt. She didn't know what\n             that was neither.\n                   (to Louis)\n             No answer?\n   \n   Louis shakes his head.\n   \n                       LOUIS\n             Uh-huh.\n   \n                       ORDELL\n             Hang it up, she's on her way. You\n             gotta listen to this. This involves\n             you.\n   \n   Louis hangs up the phone and joins the debriefing.\n   \n                       ORDELL (CONT'D)\n             No, you gonna give her a\n             Robinson's/May bag this time?\n   \n                       JACKIE\n             Right, the one Simone gives me.\n             Simone and I'll make the switch at\n             Robinson's/May. She knows what I look\n             like?\n   \n                       ORDELL\n             She saw you with Sheronda. So Simone\n             goes to the dress department with her\n             Robinson's/May bag.\n   \n                       JACKIE\n             Designer clothes.\n   \n                       ORDELL\n             She waits for you to go in the place\n             where you try things on.\n   \n                       JACKIE\n             The fitting room. There's a sign over\n             the door.\n   \n                       LOUIS\n             Why we doin' I there?\n   \n                       JACKIE\n             I have a hunch they'll be watchin'\n             me. We can't risk switching bags out\n             in the open or even in the dining\n             area. That's why it has to be a\n             woman, 'cause we do the switch in the\n             fitting room.\n   \n                       ORDELL\n             So you come out with her\n             Robinson's/May bag, go meet Sheronda.\n             Simone peeks out, waits for my man\n             Louis here to give her a signal\n             nobody's watchin'. She leaves the\n             store, gets in her car - mission\n             accomplished.\n   \n                       JACKIE\n             Where you gonna be during all this?\n   \n                       ORDELL\n             I'm gonna be sittin' at the titty bar\n             In downtown L.A. till my man over\n             here calls me and gives me the O.K.\n             sign.\n   \n   Jackie's pager goes off. She looks at it.\n   \n                       JACKIE\n             I gotta go.\n   \n   \n   INT. MELANIE'S APARTMENT - HALLWAY - DAY\n   \n   Ordell walks Jackie to the elevator.\n   \n                       ORDELL\n             Who's paging you?\n   \n                       JACKIE\n             Ray, the A.T.F. guy.\n   \n                       ORDELL\n             That works on my nerves, you bein' so\n             buddy-buddy with him.\n   \n                       JACKIE\n             If I wasn't, this wouldn't work. Now\n             once I deliver I'll have to trust\n             you.\n   \n                       ORDELL\n             Well, I've been trusting you all this\n             time, haven't I? We agreed on ten\n             percent of what you bring in and\n             that's what you gonna get.\n   \n   They reach the elevator. She presses the button.\n   \n                       JACKIE\n             And a hundred thousand if I go to\n             jail.\n   \n                       ORDELL\n             We're partners, Baby, sorta. I ain't\n             gonna screw you. You haven't told me\n             where I put it for you.\n   \n   The elevator arrives. Jackie steps in.\n   \n                       JACKIE\n             Give it to the bail bondsman, Max\n             Cherry. He'll take care of it.\n   \n                       ORDELL\n             Max Cherry? You and him friends now?\n             You tell him about this shit?\n   \n                       JACKIE\n             He won't know where the money came\n             from. Only that it's money.\n   \n   ... the elevator shuts... As it shuts Ordell yells;...\n   \n                       ORDELL\n             Don't you know all them bail bondsmen\n             are crooks...\n   \n   ... the door shuts.\n   \n   \n   CLOSEUP ORDELL\n   \n   He doesn't like the last piece of new information.\n   \n   \n   EXT. THE STRAND - DAY\n   \n   The Strand is the hip surfer street in downtown Hermosa\n   Beach. Jackie leaves the apartment building. She walks to\n   her car when she spots a funky little beach bar called,\n   \"Sally Leroy's.\"\n   \n   \n   INT. SALLY LEROY'S - DAY\n   \n   Sally Leroy's is a beach bar with surfboards, different\n   beer signs, and pictures of Marilyn Monroe, Elvis\n   Presley, James Dean, Ann Margaret, and surfers riding\n   monster waves all over the place.\n   \n   The JUKEBOX plays a loud seventies rock number.\n   \n   \n   BEGINNING OF SHOT\n   \n   The camera picks Jackie up through the window, walking\n   into the place and going up to the bar...\n   \n   A female bartender in her mid-twenties, wearing a plaid\n   workshirt, named WANDA, goes to Jackie.\n   \n                       JACKIE\n             Do you have a phone?\n   \n                       WANDA\n             Yeah, it's in the back.\n   \n                       JACKIE\n             Thanks.\n   \n   ... We follow with her to the back of the bar... the\n   MUSIC is LOUD... the phone booth is occupied by a fat\n   older GUY wearing surf clothes and sporting a mustache\n   like a walrus. Jackie waits for him to finish his call...\n   As she waits, the CAMERA MOVES BACK... until a blonde\n   head of hair comes into the f.g....\n   \n   The CAMERA MOVES around to a CLOSEUP ON MELANIE, sucking\n   on a beer, moving her head to the music, and watching\n   Jackie. She smiles and steps OUT OF FRAME.\n   \n   END OF SHOT\n   \n   Jackie hears behind her;\n   \n                       MELANIE (O.S.)\n             Hey!\n   \n   Jackie turns and sees Melanie holding a beer, standing\n   behind her.\n   \n                       JACKIE\n             Oh, hi.\n   \n                       MELANIE\n             Buy ya a beer?\n   \n                       JACKIE\n             I'm waiting for the phone.\n   \n                       MELANIE\n             Good luck. That guy's been in there\n             since I got here.\n   \n                       JACKIE\n             Well, I guess I better look for\n             another one, then. Thanks, anyway.\n   \n   Jackie turns to leave.\n   \n                       MELANIE\n             I know what you and Ordell got goin'.\n             You sit down and have a beer with me.\n             I'll tell you a secret.\n   \n   Jackie looks at her a moment.\n   \n                       JACKIE\n             Sure.\n   \n                       MELANIE\n             Great...\n                   (calling to the\n                   bartender)\n             ... Wanda!\n   \n   Wanda approaches.\n   \n                       WANDA\n             What?\n   \n                       MELANIE\n             This lady is thirsty.\n   \n                       WANDA\n             What do you want?\n   \n                       MELANIE\n             What's on tap?\n   \n                       WANDA\n             Coors, Sam, Rolling Rock, and\n             Killian's Red.\n   \n                       JACKIE\n             Killian's.\n   \n                       MELANIE\n             Better get me another Sam's.\n                   (to Jackie)\n             Join me in a Jaeger shot?\n   \n\n                       JACKIE\n             Uh-uh.\n             \n                       MELANIE\n             Gimme one anyway.\n   \n                       WANDA\n             You got it.\n             \n   Wanda goes away. Jackie and Melanie sit at the bar. The\n   MUSIC is LOUD, and they have to talk over it. Melanie\n   moves her head to it during the conversation.\n   \n                       JACKIE\n             How long you been with Ordell?\n   \n                       MELANIE\n             This time? Almost a year. I've known\n             him forever.\n   \n                       JACKIE\n             What were you two fighting about?\n   \n                       MELANIE\n             He told me to go outside.\n                   (imitating Ordell's\n                   voice)\n             \"You may leave us now.\" It's all part\n             of his pathetic attempt to be \"the\n             man.\" You know Mr. Walker don't you?\n   \n   Jackie nods \"yes.\"\n   \n                       MELANIE (CONT'D)\n             Mr. Walker's my buddy. Ask him about\n             Ordell.\n   \n                       JACKIE\n             That coke was yours, wasn't it?\n   \n   Melanie makes a face to show pain.\n   \n                       MELANIE\n             Oh, man, listen. I'm sorry about\n             that. I hope they don't come down on\n             you on my account. Ordell shoulda\n             told you it was in your bag.\n   \n   Wanda brings the drinks.\n   \n                       WANDA\n             Seven dollars.\n   \n   Melanie digs in her purse for the money.\n   \n                       JACKIE\n             He said he didn't know about it.\n   \n                       MELANIE\n                   (digging in her purse)\n             You believe that? Yeah, well, I guess\n             you have to trust him.\n                   (pulls out a ten)\n             I'd have second thoughts on that, but\n             then I know 'em.\n   \n   Melanie takes her Jaeger shot, lets it go down, then\n   continues.\n   \n                       MELANIE (CONT'D)\n             He killed a guy who works for him the\n             other day.\n   \n                       JACKIE\n             Beaumont Livingston?\n   \n                       MELANIE\n             You already knew that?\n   \n                       JACKIE\n             Kinda.\n   \n                       MELANIE\n             So tell me. Having all that money in\n             your flight bag - Is it tempting?\n   \n   Jackie nods 'yes', as she sips her beer.\n   \n                       MELANIE (CONT'D)\n             I tell you. If Ordell ever sent me to\n             carry in ten thousand dollars, that\n             would be the last motherfuckin' time\n             he saw me. The next trip you're gonna\n             have over half-a-million. If you\n             thought of cutting Ordell out, I sure\n             as hell wouldn't blame you.\n   \n   Jackie smiles.\n   \n                       MELANIE (CONT'D)\n             You think I'm kidding?\n   \n                       JACKIE\n             Dreaming.\n   \n                       MELANIE\n             You know how easy it would be? He\n             won't be anywhere near that mall.\n             Pull one more switch, up front.\n             That's it. half-a-million dollars.\n             Need help?\n   \n                       JACKIE\n                   (smiling)\n             Keep it between us girls?\n   \n                       MELANIE\n             What's that fucker ever done for us?\n   \n                       JACKIE\n                   (getting off the\n                   barstool)\n             I don't think so, but thanks for the\n             beer.\n   \n   Jackie leaves.\n   \n   \n   CLOSEUP MELANIE\n   \n   Watches her go.\n   \n                       MELANIE\n                   (softly under her breath)\n             Chicken shit.\n   \n   \n   INT. STEAKHOUSE - NIGHT\n   \n   Jackie and Nicolet sit at a steakhouse eating a steak\n   dinner. Nicolet drinks beer, Jackie drinks white wine.\n   \n                       JACKIE\n             Ordell has a white guy working for\n             him named Louis.\n   \n                       NICOLET\n             You two meet?\n   \n                       JACKIE\n             This afternoon before I came here. He\n             was with Ordell at an apartment in\n             Hermosa Beach. I don't know if he\n             lives there, but I can find out.\n   \n                       NICOLET\n             You talk to him?\n   \n                       JACKIE\n             Not really.\n   \n                       NICOLET\n             His full name is Louis Gara. He just\n             got out from serving four years in\n             Susanville.\n   \n                       JACKIE\n             What for?\n   \n                       NICOLET\n             Bank robbery? Do you know what he\n             does for Ordell?\n   \n                       JACKIE\n             I imagine shit needs to be done.\n   \n                       NICOLET\n             We've been following Mr. Gara, and\n             he's definitely working for Ordell.\n   \n                                               FLASH ON:\n   \n   \n   NICOLET AND DARGUS\n   \n   In a car, parked, on surveillance.\n   \n   \n   COPS POV\n   \n   Louis with the van, at the storage facility.\n   \n                       NICOLET (V.O.)\n             They served two years together almost\n             twenty years ago in Soledad. But he\n             doesn't live in Hermosa Beach.\n             Ordell's got him staying at a house\n             in.\n   \n   \n   MUG SHOT SIMONE\n   \n   The older woman in the mall.\n   \n                       NICOLET (V.O.)\n             ... Compton with a fifty-six-year-\n             old petty thief - woman named Simone\n             Hawkins.\n   \n   \n   BACK TO BAR\n   \n                       NICOLET\n             Ever meet her, or they talk about\n             her?\n   \n                       JACKIE\n             Not yet.\n   \n                       NICOLET\n             Who's the other one?\n   \n                       JACKIE\n             White girl named Melanie Ralston.\n             Another girlfriend of Ordell's.\n   \n                       NICOLET\n             What's her story?\n   \n                       JACKIE\n             It was her coke I got busted with.\n             She knows everything, but she's not\n             part of it, and she's pissed cause\n             she's not part of it. Ordell wouldn't\n             even let her stay at the meeting. She\n             tried to talk me into ripping off\n             Ordell.\n   \n                       NICOLET\n             And splittin' with her?\n   \n                       JACKIE\n             I'm sure that was the idea.\n   \n                       NICOLET\n             What did you say?\n   \n                       JACKIE\n             I smiled and walked away. She also\n             told me Ordell killed Beaumont.\n   \n                       NICOLET\n             She told you that?\n   \n                       JACKIE\n             Uh-huh.\n   \n                       NICOLET\n             Was she there?\n   \n                       JACKIE\n             She didn't say.\n   \n                       NICOLET\n             But she mentioned Beaumont by name?\n   \n                       JACKIE\n             Uh-huh.\n   \n                       NICOLET\n             Well, this sounds like a lady I'd\n             like to have a word with. So\n             everything's set for tomorrow?\n   \n                       JACKIE\n             Right. Everything's the same, except\n             one change...\n   \n   \n   INT. JACKIE'S APARTMENT - NIGHT\n   \n   Max sits on the couch in Jackie's apartment drinking\n   white wine.\n   \n   Jackie paces in front of him, white wine in one hand,\n   Davidoff in the other, going over the details of\n   tomorrow. One could notice a slight change in Jackie.\n   \n   There's a bit of an edge to Miss Brown that's bubbling\n   underneath her cool surface. It's understandable. After\n   all, she's been the architect of this half-a-million\n   dollars switcheroo. She's moved heaven and earth to make\n   all the pieces fall into place, and all the players thnk\n   what she wants them to think.\n   \n   As she talks to Max she knows tomorrow all her hard work\n   will either fail or succeed. But don't take this\n   difference the wrong way. This edge I'm referring to is\n   not one born out of fear (Jackie's nervous, but she's not\n   afraid). It's more the edge an athlete might feel before\n   an all-important competition.\n   \n                       JACKIE\n             I told them Ordell's changed the\n             amount he's bringing in.\n   \n                       MAX\n             Do you think they bought it?\n   \n                       JACKIE\n             Oh, yeah. I got them thinking\n             Ordell's real nervous. They love\n             thinking he's scared of them.\n   \n                       MAX\n             You know, a good cop won't let you\n             know he knows you're fulla shit.\n   \n                       JACKIE\n             All he needed was a reasonable\n             explanation.\n   \n                                               DISSOLVE TO:\n   \n   \n   BACK TO JACKIE WITH NICOLET\n   \n   MEDIUM JACKIE\n   \n                       JACKIE\n             Right. Everything's the same except\n             one change. Ordell thinks it's just\n             too hot right now to bring in all his\n             money. He knows you're watching him,\n             and he's paranoid. He's keeping his\n             stash where it is, but he wants to\n             bring in fifty thousand for bail in\n             case he needs it.\n   \n                                               CUT TO:\n   \n   \n   BACK TO JACKIE AND MAX\n   \n                       MAX\n             It'll be more than that.\n   \n                       JACKIE\n             Don't be so literal. Ray believed it.\n   \n                       MAX\n             But you still have to show him the\n             money at the airport.\n   \n                       JACKIE\n             Well, you know I'm not going to show\n             him the whole amount. He'll see fifty\n             thousand.\n   \n                       MAX\n             Where's the rest of it?\n   \n                       JACKIE\n             In the bag underneath.\n   \n                       MAX\n             What if he checks it?\n   \n                       JACKIE\n             He won't - I mean, he didn't the last\n             time. He'll be expecting fifty\n             thousand and there it is - on top.\n   \n                       MAX\n             You're takin' a helluva chance kid.\n   \n                       JACKIE\n             Not really. If he finds it, I say Mr.\n             Walker put the money in, and I didn't\n             know nothing about it. Like the coke.\n   \n                       MAX\n             Then you're out and you get nothing.\n   \n                       JACKIE\n             Yeah, but I'm not in jail and I\n             tried.\n   \n                       MAX\n             You're gonna have surveillance all\n             over you.\n   \n                       JACKIE\n             That's why you don't make a move till\n             I come out of the fitting room.\n   \n                       MAX\n             In a dress.\n   \n                       JACKIE\n             Well, a suit. There's one I had my\n             eye on.\n   \n   The phone rings.\n   \n                       JACKIE (CONT'D)\n             Excuse me.\n   \n   \n   INT. MELANIE'S APARTMENT - NIGHT\n   \n   EXTREME CLOSEUP - Ordell on the phone\n   \n                       ORDELL\n             It's Ordell. We got a bit of a change\n             in plans here. Nothing to worry 'bout\n             - everything's the same - except for\n             one change. That bitch you saw in the\n             mall, Simone. She wasn't here today,\n             cause she split on me.\n                   (pause)\n             Me an Louis went over to her place\n             ,she's gone. She's gone and all her\n             shit's gone and so's my ten thousand\n             dollars.\n                   (pause)\n             It ain't nothin' to worry about,\n             girl. Everything's just like we\n             discussed. Except when you do the\n             switch, instead of Simone, it's gonna\n             be Melanie.\n   \n   Melanie is lying on the couch, sprawled out like a cat.\n   Louis sits at the other end of the couch. They're\n   watching \"Dirty Mary and Crazy Larry\" on TV.\n   \n   \n   ON TV\n   \n   Peter Fonda and Susan George make jokes as they're\n   pursued by police cars.\n   \n   They can hear Ordell on the phone. Melanie smiling at\n   Louis, flirtatiously and conspiratorially lifts her bare\n   foot and rubs his arm with it. Louis turns to her and\n   gives her a look that says: \"I'm not on your side, bitch.\n   So knock it of.\"\n   \n   Melanie sees this and takes her foot away.\n   \n   Louis turns back to the television.\n   \n   \n   CLOSEUP MELANIE\n   \n   Looks at Louis for a moment, then sighs, saying under her\n   breath;\n   \n                       MELANIE\n             Chicken shit.\n   \n                                               FADE TO BLACK\n   \n   \n   TITLE CARD:\n   \n   \"MONEY EXCHANGE 550,000\"\n   \n                                               FADE UP:\n   \n   \n   A GRAPHIC MAP\n   \n   With Mexico and California on it. On the Mexico side we\n   see \"CABO SAN LUCAS\" with a big circle around it. On the\n   California side we see \"LAX\" in a similar circle. The\n   tiny figure of a black AIRPLANE appears in the Cabo\n   circle. With appropriate SOUND EFFECTS it takes off from\n   Cabo, flying towards LAX, leaving a dotted line behind\n   it. The CAMERA moves into a CLOSEUP of the little black\n   airplane.\n   \n                                               CUT TO:\n   \n   \n   CLOSEUP JACKIE\n   \n   Looking down...\n   \n   \n   INT. AIRPLANE BATHROOM - DAY\n   \n   Rearranging her bag. The five hundred thousand inside\n   takes up half the space. She tucks lingerie around the\n   edges, covers the money with blouses, shoes, and skirts\n   and ties I all down tight. Then places a fat envelope\n   with fifty thousand right on top.\n   \n   \n   INT. CABIN - AIRPLANE - DAY\n   \n   Jackie steps out of the bathroom, walks down the aisle,\n   and is stopped by a PASSENGER.\n   \n                       PASSENGER\n             Listen, Miss, I'm waiting for a drink\n             and you spend half the fuckin' flight\n             in the can. Soon as we land I'm\n             making a formal complaint.\n   \n                       JACKIE\n             Why, because I called you an asshole.\n   \n                       PASSENGER\n             You didn't call me that.\n   \n                       JACKIE\n             I didn't? Oh, well, you're an\n             asshole.\n   \n   \n   INT. LAX PARKING STRUCTURE - DAY\n   \n   SUBTITLE APPEARS BELOW:\n   \n   \"TIME: 3:00\"\n   \n   Jackie steps into the LAX parking structure, pulling her\n   bag on wheels behind her.\n   \n   Waiting for her is Ray Nicolet.\n   \n                       NICOLET\n             We have to stop meeting like this.\n   \n   They fall into step towards her car.\n   \n                       JACKIE\n             You said that the last time.\n   \n                       NICOLET\n             Well, it's true, isn't it? After his\n             is buttoned up we could meet\n             someplace else. What do you think?\n   \n                       JACKIE\n             We could, if I'm not in jail.\n   \n                       NICOLET\n             Oh, that's taken care of. I called\n             the State Attorney's Office. You were\n             no-filed this morning in Circuit\n             Court.\n   \n   \n   CLOSEUP JACKIE\n   \n   This information stops Jackie in her tracks.\n   \n                       JACKIE\n             Are you saying I'm off the hook?\n   \n   \n   JACKIE'S POV\n   \n   Nicolet, who kept walking when Jackie stopped, looks back\n   at Jackie.\n   \n                       NICOLET\n             Free as a bird. I still expect you to\n             finish the job, though. How much do\n             you have this time?\n   \n   Jackie starts walking again\n   \n                       JACKIE\n             Fifty thousand, like I said. He's\n             pretty sure he's gonna need it for\n             bail.\n   \n   \n   INT. JACKIE'S HONDA - DAY\n   \n   Jackie and Nicolet in the parked car. Ray has the flight\n   bag in his lap.\n   \n   He unzips it.\n   \n   He sees the clothes with the envelope on top.\n   \n   Jackie watches all of this.\n   \n                       NICOLET\n             That's fifty thousand, huh? It\n             doesn't look like that much.\n   \n                       JACKIE\n             I was told ten thousand in each pack.\n   \n                       NICOLET\n             You didn't count it?\n   \n                       JACKIE\n             I never have. It's not my money.\n   \n   He puts the envelope back in the bag and feels through\n   the folds of a skirt.\n   \n                       NICOLET\n             He might have slipped some coke in\n             here. Did you check?\n   \n   Jackie, cool.\n   \n                       JACKIE\n             Mr. Walker promised he'd never do\n             that again.\n   \n   Nicolet's fingers move to a pair of black heels wedged\n   into the side... they touch the shoes... then move over\n   to the envelope, opens the clasp and takes out five\n   rubber-banded bond packets of loot.\n   \n                       JACKIE (CONT'D)\n             Ever been tempted?\n   \n                       NICOLET\n             What? To put one of these in my\n             pocket?\n   \n                       JACKIE\n             Uh-huh.\n   \n                       NICOLET\n             If I did, I'd have to give you one,\n             wouldn't I? Or we could take what we\n             want. No one knows how much there is\n             except us, right?\n   \n                       JACKIE\n             Yes. All those things are true.\n   \n                       NICOLET\n             After all, it don't belong to nobody,\n             right?\n   \n                       JACKIE\n             That would be one point of view.\n   \n                       NICOLET\n             Yeah, well, it's not a point of view\n             that A.T.F. shares. Once we make it\n             evidence, it belongs to us. You are\n             now officially out of trouble. Don't\n             do nothing stupid, now.\n   \n                       JACKIE\n             How can I do anything if I'm being\n             watched every second?\n   \n                       NICOLET\n             I'm glad you realize that. Saves me\n             the trouble of pointing it out to\n             you.\n                   (holding up the money)\n             Put this in your shopping bag. It's\n             what I expect to find when I look in\n             Sheronda's. Comprende?\n   \n                       JACKIE\n             Si.\n   \n   \n   INT. MAX CHERRY'S OFFICE - DAY\n   \n   Max Cherry sits behind his desk. WINSTON POWELL, the big\n   black guy from the photo, is at the other desk on the\n   phone. Max looks at his watch.\n   \n   SUBTITLE APPEARS BELOW:\n   \n   \"TIME: 3:30\"\n   \n   Max stands up, takes the sport coat from the back of his\n   chair, putsit on, and walks over to Winston's desk.\n   Winston, still on the phone, looks up.\n   \n                       MAX\n             I'm going out for a few hours.\n   \n                       WINSTON\n                   (to phone)\n             Hold on a minute.\n                   (to Max)\n             Where you going?\n   \n                       MAX\n             I'm going to Del Amo, see a movie,\n             get something to eat.\n   \n                       WINSTON\n             Watcha gonna see?\n   \n                       MAX\n             Whatever looks best and starts the\n             soonest.\n   \n                       WINSTON\n             Have fun.\n   \n   Winston goes back to the phone.\n   \n   Max walks out of the office.\n   \n   \n   EXT. SAM'S HOFFIN BRAUR - DAY\n   \n   Sam's Hoffin Braur (German for beer garden) is a strip\n   joint bar in downtown L.A.\n   \n   \n   INT SAM'S HOFFIN BRAUR - DAY\n   \n   Ordell's on the pay phone. A STRIPPER strips in the b.g.\n   \n   SUBTITLE APPEARS BELOW:\n   \n   \"TIME: 3:47\"\n   \n                       ORDELL\n             What the fuck are you two still doing\n             there?!\n   \n   \n   INT. MELANIE'S APARTMENT - DAY\n   \n   Louis stands in the empty living room, talking to Ordell\n   on the phone. Kate Bush plays in the b.g.\n   \n                       LOUIS\n             I was ready to leave ten minutes ago.\n   \n   Ordell snaps at Louis, not so harsh Louis is forced to\n   retaliate, but enough to express his loss of patience.\n   \n                       ORDELL\n             Well, you the one in motherfuckin'\n             charge.\n   \n                       LOUIS\n             Well, she keeps saying 'in a minute.'\n   \n                       ORDELL\n             Go in there, snatch her by the hair,\n             and drag her big ass out. This is my\n             goddam money we're talking about. Get\n             your ass out the door.\n   \n   He hangs up on Louis.\n   \n   Louis, pissed at being hung up on and talked to like\n   that, hangs up the phone and turns his frustration where\n   it rightly belongs - Melanie.\n   \n   Louis stomps towards the bedroom where the music's\n   playing.\n   \n                       LOUIS\n             We're leaving now!\n   \n                       MELANIE (O.S.)\n             All right already.\n   \n   \n   MONTAGE\n   \n   We see a montage of the individual characters in route to\n   the mall.\n   \n   \n   JACKIE\n   \n   In her Honda, smoking a cigarette, looking cool as usual,\n   driving to the mall. Her car plays seventies soul.\n   \n   \n   MAX\n   \n   In his Cadillac Seville, cruising down Hawthorne\n   Boulevard to the mall. He plays hid Delfonics CD.\n   \n   \n   LOUIS AND MELANIE\n   \n   In Melanie's Toyota drive towards the mall. Melanie\n   drives singing along with Kate Bush on her car stereo.\n   \n   \n   EXT. DEL AMO MALL PARKING LOT - DAY\n   \n   Jackie's car pulls up to a lined parking space in the\n   parking lot.\n   \n   SUBTITLE APPEARS BELOW:\n   \n   \"TIME 3:52\"\n   \n   Jackie gets out of the Honda with her flight bag. She\n   goes to her hatchback, takes a Robinson's/May bag, lines\n   the first half of the bag with old paperbacks.\n   \n   Then takes out of the flight bag the envelope with the\n   fifty-thousand marked dollars, takes one packet of ten\n   thousand, and puts it in her pocket. She lines the\n   envelope with forty thousand across the books, then fills\n   the rest of the bag with beach towels.\n   \n   Then with her flight bag slung over her shoulder,\n   carrying the Robinson's/May bag and with all the\n   confidence of a world champion prize fighter going into\n   the ring, she strides toward the hugs mall.\n   \n   \n   INT. DEL AMO MALL - DAY\n   \n   Jackie enters the mall. She looks at the people buzzing\n   around. Any one of them could be surveillance.\n   \n   She calmly walks down the mall, then turns into the\n   Roinson's/May store.\n   \n   \n   INT. ROBINSON'S/MAY - DESIGNER CLOTHES - DAY\n   \n   Jackie, in her Cabo Air uniform, walks up to a young\n   Asian saleswoman named Amy in the Robinson's/May designer\n   clothing area.\n   \n   The saleswoman smiles when she sees Jackie.\n   \n                       AMY\n             Can I help you?\n   \n                       JACKIE\n             Yes, you have a suit I've had my eye\n             on.\n   \n   Jackie steps out of the fitting room wearing a real\n   sharp, badass, black suit with a white blouse.\n   \n                       AMY\n             Oh, my God. You look so cool.\n   \n   Jackie moves over to the mirror, and checks herself out.\n   \n                       JACKIE\n             This looks pretty good on me.\n   \n                       AMY\n             Are you kidding, it looks great. You\n             wear this to a business meeting,\n             you're the badass in the room. But\n             you can go out dancing in this too.\n             It's a total power suit.\n   \n   Jackie studies her reflection.\n   \n                       JACKIE\n             I think I'm gonna just get this for\n             today. I'm in kind of a hurry. Would\n             you mind ringing this up while I\n             change out of it?\n   \n                       AMY\n             Not a problem.\n   \n                       JACKIE\n             Thanks.\n   \n   Jackie walks into the fitting room.\n   \n   \n   INT. FITTING ROOM - DAY\n   \n   She walks down the fitting room hallway with changing\n   cubicles on her right, enters the last one.\n   \n   She closes the door and sits down on the bench in between\n   her flight bag full of money and the Robinson's/May bag.\n   \n   A full-length mirror is straight I front of her. She\n   looks at herself... when someone comes into the stall\n   next to her.\n   \n   Melanie's voice comes from the other side of the wall.\n   \n                       MEALNIE (O.S.)\n             Jackie?\n   \n                       JACKIE\n             Hi, Melanie.\n   \n                       MELANIE (O.S.)\n             Are you getting that black suit?\n   \n                       JACKIE\n             Yeah, do you like it?\n   \n                       MELANIE (O.S.)\n             It looks good on you.\n   \n                       JACKIE\n             Do you got something for me?\n   \n                       MELANIE (O.S.)\n             You betcha.\n   \n   A Robinson's/May bag, like Jackie's, filled with towels,\n   comes sliding underneath the stall.\n   \n   Jackie picks up her Robinson's/May bag, filled with\n   books, towels and the marked forty-thousand dollars.\n   \n   She takes the loose packet of ten-thousand marked dollars\n   and lies it on top of the bag.\n   \n   As she does all this Melanie continues talking.\n   \n                       MELANIE (O.S.) (CONT'D)\n             We coulda worked this. You know that,\n             dontcha? You would've made out a lot\n             better than you're going to, believe\n             me.\n   \n   Jackie slides the Robinson's/May bag with money under the\n   stall.\n   \n   Melanie sees the money on top and stops talking.\n   \n                       JACKIE\n             I put a little cherry on top. You're\n             right. What the hell he ever do for\n             us?\n   \n                       MELANIE (O.S.)\n                   (quietly)\n             Thanks.\n   \n                       JACKIE\n             Now be careful with that bag. You\n             don't want it ripping open on you in\n             the middle of the store.\n   \n   We hear the SOUND of Melanie leaving.\n   \n   Jackie then transfers the half of a million dollars out\n   of her flight bag into Melanie's Robinson's/May bag. She\n   sticks her uniform in the flight bag.\n   \n   Then takes the towels and puts them on top of the money.\n   She grabs her flight bag and leaves, leaving behind the\n   Robinson's/May bag filled with half of a million dollars.\n   \n   \n   INT. DESIGNER CLOTHES - DAY\n   \n   Jackie, looking sharp in her new suit but acting a touch\n   frantic and anxious, walks rapidly toward the sales\n   counter where Amy waits for her.\n   \n                       JACKIE\n             I'm sorry, I just decided to stay in\n             the suit - get out of that damn\n             uniform.\n   \n                       AMY\n             Oh, that's not a problem.\n   \n   As Jackie and the salesgirl complete their transaction\n   the CAMERA CIRCLES them, SLOWLY at first, but more\n   RAPIDLY each go-around. They complete the transaction and\n   as Jackie starts to leave, she stops and says to Amy;\n   \n                       JACKIE\n             Oh, somebody left a shopping bag in\n             there. Looks like beach towels.\n   \n   She leaves. We follow her...\n   \n   \n   INT. DEL AMO MALL - DAY\n   \n   ... Jackie walks out of Robinson's/May hurriedly into the\n   main mall. The calm, cool stride we're used to with\n   Jackie is completely gone.\n   \n   She stops, looks around, head darting from one direction\n   to another. She looks in a panic. The CAMERA begins to\n   twirl around her. She seems to be looking for something\n   she doesn't see. She looks helpless and on the verge of\n   tears.\n   \n   As the twirling CAMERA circles her, she screams;\n   \n                       JACKIE\n             Ray! Ray! I need you! Come out! She\n             took the money.\n   \n   The CAMERA stops twirling.\n   \n   Nicolet, Dargus, and two other plainclothes cops, come\n   running out of a store towards Jackie. As they reach her,\n   a frantic Jackie yells;\n   \n                       JACKIE (CONT'D)\n             Melanie burst in the dressing room\n             and took the money!\n   \n                                               CUT TO:\n   \n   \n   EXT. PARKING LOT - DEL AMO MALL - DAY\n   \n   Louis and Melanie pull up to a lined parking space in\n   Melanie's Toyota.\n   \n   SUBTITLE APPEARS BELOW:\n   \n   \"TIME: 4:12\"\n   \n   Louis is the first out of the car.\n   \n                       LOUIS\n             Come on, goddammit, we're late!\n   \n   \n   INT. DEL AMO MALL - DAY\n   \n   We STEDICAM in front of them, Louis the rapid pacesetter,\n   pulling Melanie behind him by the hand. Melanie carries\n   the Robinson's/May switch bag.\n   \n                       MELANIE\n             Jesus Christ, get a grip, Louis.\n   \n                       LOUIS\n             We shoulda been there already and we\n             woulda been if it hadn't been for\n             your fuckin' around!\n   \n   They go inside Robinson's/May...\n   \n   \n   INT. ROBINSON'S/MAY - DAY\n   \n   ... We STEDICAM into Robison's/May with them. We lose\n   them for a moment behind racks of dresses and mannequins,\n   but end up landing on Jackie in her black suit, looking\n   in a mirror and talking to Amy on the Designer Clothes\n   floor.\n   \n                       AM\n             ... You wear this to a business\n             meeting, you're the badass in the\n             room...\n   \n   We PAN away and find Louis and Melanie by a dress rack,\n   watching Jackie.\n   \n                       MELANIE\n             That's a nice outfit on her. I'm\n             gonna go over and look at this Michi\n             Moon display.\n   \n                       LOUIS\n             Just stay right fuckin' here, all\n             right?\n   \n                       MELANIE\n             Are you sweating?\n   \n   Louis' hand immediately goes to his forehead and touches\n   dampness.\n   \n                       MELANIE (CONT'D)\n             Job a little too much for you?\n   \n   Louis shoots Melanie a hard convict look.\n   \n   Melanie smiles at him, feeling the stare, but too much of\n   a natural-born smart ass to change.\n   \n                       MELANIE\n             I'll be over here. You're too\n             conspicuous.\n   \n   Louis looks over at the fitting room. Jackie is going\n   inside it, and the saleswoman is walking away towards\n   him.\n   \n   He watches the saleswoman walk by him, then looks back in\n   time to see Melanie enter the fitting room.\n   \n                       LOUIS\n                   (under his breath)\n             Goddammit, not till I tell ya.\n   \n   He decides he's watching the fitting room entrance too\n   much, so he starts throwing his look around when he sees\n   something that stops him cold.\n   \n   \n   MAX CHERRY\n   \n   Max is looking at dresses, paying no attention to the\n   fitting room.\n   \n   He thinks, 'what the fuck is Max Cherry doing here?'\n   \n   Max, doing what he's doing, looks up and sees Louis\n   staring at him across the floor. Max smiles and gives\n   Louis a wave before turning his back to him and continues\n   to do what he was doing.\n   \n   He quickly looks around the store to see anything else;\n   any more surprise guests, possible police surveillance.\n   Everything looks normal. The saleswoman is behind the\n   register ringing up Jackie's purchase. The few customers\n   there are doing customer stuff.\n   \n   Then he sees Melanie come out with a Robinson's/May bag\n   and head down a different aisle.\n   \n   He hurries down his aisle and cuts her off. Their whole\n   fight is said tense and low.\n   \n                       LOUIS\n             What are you doin'?\n   \n                       MELANIE\n             I'm getting out of here. What do you\n             think?\n   \n                       LOUIS\n             Lemme have the bag.\n   \n                       MELANIE\n             Fuck you. I can carry it.\n   \n   She tries to push past him, and he catches her by her arm\n   and pulls her around.\n   \n                       LOUIS\n             Goddam you. Gimme that bag,\n   \n                       MELANIE\n             Watch it, dipshit. You wanna rip the\n             fuckin' bag?\n   \n                       LOUIS\n             Gimme that bag before I knock you out\n             and take it.\n   \n   Melanie realizes Louis ain't fuckin' kiddin'. Not only\n   that, this old guy looks close to buggin'. She lets go of\n   the bag.\n   \n                       MELANIE\n             Okay, okay. Take it. Jesus, what's\n             wrong with you?\n   \n   He takes it. They start walking. We STEDICAM in front of\n   them.\n   \n                       LOUIS\n             I'm carrying it.\n   \n                       MELANIE\n             Okay, you got it. Just take a chill\n             pill, for christ sake.\n   \n   Louis has had enough of her slang and says tensely\n   through gritted teeth;\n   \n                       LOUIS\n             Fuck you with your chill pill.\n   \n   In mid-walk, Melanie asks him;\n   \n                       MELANIE\n             Remember where we came in?\n   \n   Louis stops dead. He looks around, confused.\n   \n                       MELANIE (CONT'D)\n                   (like a teacher on Romper\n                   Room)\n             Nooo, that's towards Sears. We came\n             in through Bullocks. I know where it\n             is. Want to follow me, Lou-is?\n   \n   Pissed, he leaves FRAME. Melanie, wearing her Melanie\n   smirk, follows behind.\n   \n   \n   EXT. PARKING LOT - DEL AMO MALL - DAY\n   \n   Louis, clutching the shopping bag close to his chest,\n   walks rapidly down an aisle of parked cars.\n   \n   Melanie follows close behind.\n   \n   We STEDICAM alongside. We walk for awhile, Louis changes\n   direction to another aisle. WE'RE NOW IN FRONT of him. We\n   see he has a searching look on his face.\n   \n                       MELANIE\n             You have no idea where you parked, do\n             you?\n   \n   Louis doesn't answer.\n   \n   Melanie laughs.\n   \n                       MELANIE (CONT'D)\n             Jesus, but if you two aren't the\n             biggest fuck-ups I've ever seen in my\n             life... How did you ever rob a bank?\n             When you robbed banks, did you have\n             to look for your car then too? No\n             wonder you went to jail.\n   \n   Louis could kill her right now. Just take his gun out of\n   his pants and shoot her in her snickering face. But\n   instead of doing what he wants, he does what he should.\n   He doesn't answer of look back. (If he looked back and\n   saw that Melanie-smirk, he couldn't e responsible for\n   what happens.)He changes directions, cuts down another\n   aisle and hopes for both their sakes she shuts the fuck\n   up.\n   \n   But our Melanie just keeps on being Melanie.\n   \n                       MELANIE (CONT'D)\n             Is it this aisle, Lou-is?\n   \n                       LOUIS\n             Yeah, down the end.\n   \n                       MELANIE\n             You sure?\n   \n   They walk it; it's not it.\n   \n   Louis changes direction and cuts between some cars to the\n   next one.\n   \n                       MELANIE (CONT'D)\n             Is it this aisle or the next one\n             over?\n   \n                       LOUIS\n             This one.\n   \n                       MELANIE\n             You sure?\n   \n   In between two cars, Louis spins on her.\n   \n                       LOUIS\n             Don't say anything else, okay? I'm\n             telling you, keep your mouth shut.\n   \n   Melanie was surprised by the spin, but is about to say\n   something anyway when Louis put his hand up and says;\n   \n                       LOUIS\n             I mean it. Don't say one fuckin'\n             word.\n   \n                       MELANIE\n             Okay, Lou-is.\n   \n   That did it!\n   \n   Louis whips out the Beretta Ordell gave him, shoots\n   her... BAM... in the belly.\n   \n   She bounces OFF one of the cars and goes down.\n   \n   BAM... Louis shoots her again on the ground.\n   \n   One; to make sure. Two; cause it felt good.\n   \n   Then he hurries of for his car. WE FOLLOW IN FRONT OF\n   HIM. He looks around, then yells out;\n   \n                       LOUIS\n             See, just where I fuckin' said it\n             was!\n   \n   He hops in the car, and throws it into reverse.\n   \n   We can se Melanie's bare legs sticking out from a row of\n   cars. Louis stops the Toyota alongside the dead Melanie,\n   and yells through the passenger window;\n   \n                       LOUIS\n             Hey, look. I found it!\n   \n   He drives away.\n   \n                                               CUT TO:\n   \n   \n   EXT. PARKING LOT - DEL AMO MALL - DAY\n   \n   Max Cherry's Cadillac Seville pulls up to a lined space\n   in the parking lot.\n   \n   SUBTITLE APPEARS BELOW:\n   \n   \"TIME: 4:04\"\n   \n   Max gets out of his car and casually strolls towards the\n   Del Amo Mall.\n   \n   \n   INT. ROBINSON'S/MAY - DAY\n   \n   Max, hands in pocket, strolls unhurriedly through the\n   Robinson's/May store.\n   \n   He walks around the store, keeping one eye peeled toward\n   the Designer Clothes section. He walks up to a jewelry\n   counter and begins looking at he pieces in the display\n   case, when a pretty, young SALESGIRL comes up to him.\n   \n                       SALESGIRL\n             Can I show you something?\n   \n                       MAX\n             Not right now. I'm just killing time\n             waiting for my wife. But thanks,\n             anyway.\n   \n                       SALESGIRL\n             Sure thing. If anything grabs you,\n             don't be shy.\n   \n                       MAX\n             Thanks, I won't.\n   \n   She goes off.\n   \n   He looks towards Designer Clothes and sees Jackie walking\n   out of the fitting room wearing the cool black suit.\n   \n                       AMY\n             Oh, my God. You look so cool.\n   \n   Jackie moves over to the mirror and checks herself out.\n   \n   Max looks back to the jewelry display case, saying under\n   his breath;\n   \n                       MAX (CONT'D)\n                   (low)\n             And away we go.\n   \n   Jackie looks at her reflection in the mirror. Then she\n   lifts her eyes, meeting Max's across the room. Max gives\n   her a nod of his head to show he approves. Jackie smiles\n   and breaks contact, turning to Amy. We hear her say from\n   a distance. \"This looks pretty good on me.\"\n   \n   Max hears a commotion behind him and turns to see Louis\n   and Melanie hurriedly making their way towards Designer\n   Clothes.\n   \n   He turns his attention back to browsing through dresses\n   on a rack.\n   \n   He sees Louis and Melanie squabbling.\n   \n   He sees Jackie disappear into the fitting room.\n   \n   He sees Amy leaving the fitting room entrance.\n   \n   He watches Melanie, by herself, watch Amy leave. Melanie\n   watches the fitting room for a few moments. Gathering her\n   courage, then makes her move, entering the fitting room.\n   \n   Max smiles to himself, \"so far so good\" he thinks. He\n   throws a look towards Louis, only to see Louis staring\n   dead at him with an unhappy look on his face. Max returns\n   the look with a smile and a wave then turns his back on\n   his before he can see a reaction.\n   \n   Max continues his fake browsing.\n   \n   He sees Melanie come out of the fitting room carrying a\n   Robinson's/May bag close to her chest.\n   \n   She and Louis disappear.\n   \n   He sees Jackie come out of the fitting room, go over to\n   Amy and buy the dress. Jackie goes into her act, acting\n   agitated and distracted as she talks to Amy, pays with\n   cash, then leaves stopping to say;\n   \n                       JACKIE\n             Oh, somebody left a shopping bag in\n             there. Looks like beach towels.\n   \n   She's gone.\n   \n   Amy is left alone by the cashier counter.\n   \n   It's Max's turn.\n   \n   As Max looks at Amy, then at the fitting room entrance,\n   he says to himself;\n   \n                       MAX\n             Max, old boy. You've spent nineteen\n             years dealing with people who take\n             incredible risks. You walk over to\n             that counter, you're gonna find out\n             what it's like.\n   \n   Max takes a few moments...\n   \n   ... then walks over to Amy.\n   \n                       MAX\n             Excuse me, but my wife thinks she\n             left a bag of beach towels in the\n             fitting room?\n   \n                       AMY\n             Yeah, I think they're back there. Go\n             get 'em. There's nobody in there. I\n             think they're in the last stall.\n   \n                       MAX\n             Thanks.\n   \n   Max walks toward the fitting room, enters it, walks down\n   the length of stalls, and stops in front of the last one.\n   \n   He opens the door to the stall. Sitting in the corner is\n   the Robinson's/May bag. He walks over to it, lifts out\n   the towels, and sees all that money. He replaces the\n   towels, picks up the bag and leaves. HE walks across the\n   Designer Clothes, passes by Amy, says;\n   \n                       MAX\n             Got 'em, thanks.\n   \n                       AMY\n             Sure thing.\n   \n   Max walks unhurriedly toward the door that leads to the\n   parking lot.\n   \n   \n   EXT. PARKING LOT - DEL AMO MALL - DAY\n   \n   He's outside; nobody's stopped him. He keeps walking\n   towards his blue Seville. He keeps walking unhurriedly,\n   never looking back. He gets to his car, uses opening the\n   car door as an excuse to look back at the mall.\n   \n   It's normal. Nobody's after him, nobody's watching him.\n   He made it. It worked.\n   \n   Max allows himself a smile, gets into his Cadillac with\n   his half-a-million bucks and drives away.\n   \n   \n   INT. SAM'S HOFFIN BRAUS - DAY\n   \n   Ordell sits at the bar in Sam's drinking a screwdriver\n   and watching a stripper strip.\n   \n                       BARTENDER\n             There a Ordell here?\n   \n                       ORDELL\n             That's me.\n   \n   The bartender hands him the phone.\n   \n                       BARTENDER\n             Don't talks all day.\n   \n   Ordell takes the receiver.\n   \n   \n   INT. TOYOTA (MOVING) - DAY\n   \n   A stressed Louis drives the Toyota, calling Ordell on\n   Ordell's tiny cellular.\n   \n                       LOUIS\n             It's Louis.\n   \n                       ORDELL\n                   (now into phone)\n             Did you get it?\n   \n                       LOUIS\n             I got it. Listen, there's something\n             else I have to tell you.\n   \n                       ORDELL\n             When I see you. Pick me up at Sam's.\n             You count the money?\n   \n                       LOUIS\n             I haven't even looked at it yet, it's\n             still in the shopping bag.\n   \n                       ORDELL\n             Melanie must be dyin' to see it.\n                   (pause)\n             Louis.\n   \n                       LOUIS\n             That's what I got to talk to you\n             about. You see, Melanie was giving me\n             a hard time -\n   \n                       ORDELL\n             - Not now, pick me up.\n   \n   Louis hears the phone disconnect.\n   \n   \n   EXT. SAM'S HOFFIN BRAUR - DAY\n   \n   The Toyota pulls up to the back of the bar. Ordell hops\n   in, the car takes off.\n   \n   \n   INT. TOYOTA (MOVING) - DAY\n   \n   Oredell in the passenger seat, bends over to the\n   backseat, grabs the shopping bag, and brings it to his\n   lap. He looks like a kid at Christmas.\n   \n                       ORDELL\n             You keep drivin' down Ninth, to where\n             they got all them car dealerships.\n             We're gonna leave this heap in a\n             parking lot and get one the cops\n             don't know about.\n                   (pause)\n             Hey, where's Melanie?\n   \n                       LOUIS\n             That's what I gotta tell you. She\n             bugged me the whole time. Got pissy\n             with me 'cause I wouldn't let her\n             carry the bag. Started running her\n             fuckin' mouth... I couldn't remember\n             right away when we came out where the\n             car was parked, so she got on me\n             about that. \"Is it this aisle Lou-is,\n             is it that one?\" She was totally\n             fuckin' with my nerves.\n   \n                       ORDELL\n             So what, you left her there.\n   \n                       LOUIS\n             I shot her.\n   \n   Ordell just looks at him.\n   \n                       LOUIS (CONT'D)\n             I expect she's dead.\n   \n   Ordell still doesn't say anything... then says;\n   \n                       ORDELL\n             You shot Melanie?\n   \n                       LOUIS\n             Twice. In the parking lot.\n   \n                       ORDELL\n             Couldn't talk to her?\n   \n                       LOUIS\n             You know how she is.\n   \n                       ORDELL\n             You couldn't just hit her?\n   \n                       LOUIS\n             Maybe... but at that moment... I\n             dunno...\n   \n                       ORDELL\n             You shot her twice?\n   \n                       LOUIS\n             Uh-huh.\n   \n                       ORDELL\n             So you're sure she's dead.\n   \n                       LOUIS\n             Pretty sure.\n   \n                       ORDELL\n             Where did you shoot her?\n   \n                       LOUIS\n             In the chest and stomach.\n   \n                       ORDELL\n             Well, if you had to do it, you had to\n             do it. What we don't want is that\n             bitch surviving on us. Anybody but\n             that woman.\n   \n   Ordell shrugs it off, and digs into the shopping bag. He\n   pulls out the towels and sees forty-thousand dollars on\n   top of a bunch of paperbacks. His stomach drops. He just\n   looks inside the bag for the longest time.\n   \n   Louis drives, oblivious to Ordell's dilemma.\n   \n                       ORDELL (CONT'D)\n                   (quiet)\n             Louis?\n   \n                       LOUIS\n                   (not looking at him)\n             What?\n   \n                       ORDELL\n             Where's the rest of it?\n             \n                       LOUIS\n                   (looking at him)\n             How much it there?\n   \n                       ORDELL\n             Maybe forty, maybe not that much.\n   \n                       LOUIS\n             You said five hundred and fifty!\n   \n                       ORDELL\n                   (calm)\n             So you light, ain't you. You light\n             about a half-a-million.\n   \n                       LOUIS\n             Look, that's the bag she came out\n             with. She never even put her hand in\n             it, and neither did I.\n   \n                       ORDELL\n             Came outta where?\n   \n                       LOUIS\n             The fitting room. It went down\n             exactly the way it was supposed to.\n   \n                       ORDELL\n             How long was she in there?\n   \n                       LOUIS\n             Maybe a minute. She came right out.\n   \n                       ORDELL\n             Louis, You tellin' me the truth?\n   \n                       LOUIS\n             Look, I swear to fucking god, she\n             came out with that bag and I took it\n             from her.\n   \n                       ORDELL\n             Then what?\n   \n                       LOUIS\n             We went to the parking lot.\n   \n                       ORDELL\n             Where you shot her.\n   \n                       LOUIS\n             That's right.\n   \n                       ORDELL\n             You sure she ain't somewhere with a\n             half-a-million dollars I worked my\n             ass off to earn?\n   \n   Louis looks at Ordell;\n   \n                       LOUIS\n                   (quietly)\n             Fuck you for asking me that.\n   \n                       ORDELL\n             Pull the car over.\n   \n   Louis pulls it over, and stops on Ninth.\n   \n                       ORDELL (CONT'D)\n             What'd you shoot her with?\n   \n                       LOUIS\n             It's in there.\n   \n   Ordell opens the glove box and takes out the Beretta. He\n   smells the end of the barrel. He releases the magazine.\n   \n                       LOUIS (CONT'D)\n             What's that gonna tell you\" If I was\n             really pullin' a burn, I'd have taken\n             two out, wouldn't I? I thought you\n             trusted me.\n   \n   Ordell looks at him. Louis didn't burn him.\n   \n   \n   CLOSEUP ORDELL\n   \n   He thinks.\n   \n                                               DISSOLVE TO:\n   \n   \n   CLOSEUP JACKIE\n   \n   Holding a bunch of money, looking into the camera, and\n   saying with a smile;\n   \n                       JACKIE\n             Gotcha, nigga.\n   \n                                               DISSOLVE BACK\n                                               TO:\n   \n   \n   CLOSEUP ORDELL\n   \n   Jackie's gonna die. He slaps the magazine back into the\n   Beretta.\n   \n                       ORDELL\n             Okay, so it was Jackie Brown.\n   \n                       LOUIS\n             If she's got it, why didn't she take\n             it all?\n   \n                       ORDELL\n             'fore I blow that bitch's brains out,\n             I'll ask her.\n   \n                       LOUIS\n             Maybe the Feds got it.\n   \n                       ORDELL\n             If there were nothin; in here but\n             towels, maybe she didn't get a chance\n             to take it from her suitcase and\n             A.T.F. got it. But, she put these\n             fuckin' books in here to trick our\n             ass.\n   \n                       LOUIS\n             That's why I never checked it. The\n             bag felt right.\n   \n                       ORDELL\n             Then she throws forty thousand in\n             here, to rub the shit in my face,\n             know what I'm saying? She wants me to\n             know she ripped me off.\n   \n                       LOUIS\n             I don't know. Either she has it or\n             the Feds.\n   \n                       ORDELL\n             Or...\n                   (pause)\n             ... she gave it to somebody else\n             first, before Melanie went in the\n             dressing room.\n   \n   It gets real quiet in the car, as Louis remembers\n   something.\n   \n                       LOUIS\n             Jesus Christ.\n   \n                       ORDELL\n             What?\n   \n                       LOUIS\n             You know who I saw in the dress\n             department?\n   \n                       ORDELL\n             Tell me.\n   \n                       LOUIS\n             I didn't really think anything of it.\n             No - I did wonder what he was doing\n             there, but didn't think it had\n             anything to do with us. You know like\n             maybe he was there with his wife or\n             girlfriend.\n   \n                       ORDELL\n             You gonna tell me who it was?\n   \n                       LOUIS\n             Max Cherry.\n   \n   Ordell has to look away from Louis, takes a beat, then\n   looks back.\n   \n                       ORDELL\n             You see Max Cherry in the dress\n             department. We're about to be handed\n             half-a-million dollars - Man, look at\n             me when I'm talking to you! And you\n             don't think nothing of him being\n             there!\n   \n                       LOUIS\n             Do Max Cherry and Jackie Brown know\n             each other?\n   \n                       ORDELL\n             Hell, yes, they know each other. He\n             bonded her out of county.\n   \n                       LOUIS\n             How am I supposed to know that?\n   \n                       ORDELL\n             You know the motherfucker's a bail\n             bondsman, don't ya? You know every\n             last one of them motherfuckers is\n             crooked as hell?\n   \n                       LOUIS\n             Why should I think anything's weird,\n             if I don't know nothin' about them\n             knowing each other?\n   \n                       ORDELL\n             Man, I don't want to hear your\n             fuckin' excuses!\n   \n   Louis gets mad.\n   \n                       LOUIS\n             I ain't givin' you fuckin' excuses,\n             I'm givin' you reasons.\n   \n                       ORDELL\n             Oh, you gonna tell me the reason you\n             lost all the goddam money I got in\n             the world! Let me tell you the\n             reason, motherfucker! The reason is,\n             your ass ain't worth a shit no more!\n   \n   Louis turns into the hard convict on the yard, and tells\n   Ordell;\n   \n                       LOUIS\n                   (hard)\n             You best back off.\n   \n   We hear a BAM.\n   \n   Louis jerks.\n   \n   Ordell shot him.\n   \n   Louis falls back against the car door, eyes wide open,\n   staring at Ordell.\n   \n   Ordell takes the pistol, works the barrel up higher on\n   Louis' side, right under him arm, and shoots him again.\n   \n   This time Louis' head BANGS against the car door window.\n   He slumps over - his life gone.\n   \n   Ordell looks at him.\n   \n                       ORDELL\n             What the fuck happened to you, man?\n             Shit, your ass use'ta be beautiful.\n   \n   Ordell takes the bag and gets out of the car, leaving\n   Louis' dead body there.\n   \n                                               DISSOLVE TO:\n   \n   \n   MEDIUM NICOLET\n   \n                       NICOLET\n             You didn't tell me you were gonna do\n             some shopping.\n   \n   \n   INT. NICOLET'S OFFICE (A.T.F. HEADQUARTERS) - DAY\n   \n   Jackie, still dressed in her cool black suit, sits in a\n   chair in Nicolet's office. Davidoff between the fingers\n   of one hand, she holds a small, white styrofoam cup of\n   coffee in he other.\n   \n   Ray stands.\n   \n                       JACKIE\n             I thought I did.\n   \n                       NICOLET\n             You didn't. I would think with all\n             this on your mind, you'd wait till\n             after.\n   \n                       JACKIE\n             I got there early. I've had my eye on\n             this suit - Wait, let's start over. I\n             got there early. The idea was to try\n             on the suit, see if I liked it. If I\n             did, get them to wrap it up, and\n             change back into my uniform. That's\n             what Sheronda's expecting me to wear.\n             Go meet Sheronda, give her the bag\n             with fifty thousand, and go home.\n   \n                       NICOLET\n             But you didn't do that.\n   \n                       JACKIE\n             Because I didn't have it. Ray, I\n             swear, Melanie came in and grabbed\n             it.\n                   (pause)\n             And someone killed her for it.\n   \n   Nicolet looks at Jackie for a moment.\n   \n                       NICOLET\n             Where's the bag she gave you?\n   \n                       JACKIE\n             She didn't give me one. I told you\n             before, Melanie wasn't part of the\n             plan. Ordell must of told her to do\n             it. She bursts in, grabs the shopping\n             bag, and takes off. What am I\n             supposed to do, go after her? I'm in\n             my fucking underwear. I had to get\n             dressed before I could do anything.\n             So I put this back on 'cause could\n             put this on faster than I could my\n             uniform.\n   \n                       NICOLET\n             You took the time to pay the\n             saleswoman.\n   \n                       JACKIE\n             I had to. I was frantic. I didn't\n             know what to do.\n   \n                       NICOLET\n             What did you do after that?\n   \n                       JACKIE\n             I went looking for you. I went\n             straight to the bookstore, 'cause\n             that's where you were last time, but\n             you weren't there. How the hell else\n             am I supposed to let anybody know\n             what happened? You didn't tell me how\n             to do that, did you? I knew I was\n             under surveillance, so when I\n             couldn't spot anybody, I started\n             yelling.\n   \n                       NICOLET\n             There was a guy with Melanie?\n   \n                       JACKIE\n             Not in the fitting room.\n   \n                                               CUT TO:\n   \n   \n   A YOUNG WOMAN A.T.F SURVEILLANCE AGENT\n   \n   Pretends to shop. She watches Louis grab Melanie.\n   \n                       NICOLET (V.O.)\n             We had our agent on you. She sees a\n             blonde come out of the fitting room\n             carrying a Robinson's/May bag and\n             tussle with a tough-looking white\n             guy. The white guy takes the shopping\n             bag and they go.\n   \n   \n   BACK TO OFFICE\n   \n                       NICOLET\n             This guy with Melanie, that was Louis\n             Gara?\n   \n                       JACKIE\n             I didn't see him. I was in my\n             underwear. If it was a white guy, it\n             was probably Louis. He kill Melanie?\n   \n                       NICOLET\n             It's possible. You're saying you\n             don't have any idea what happened to\n             that fifty thousand?\n   \n                       JACKIE\n             I have no idea.\n   \n                       NICOLET\n             You'd take a polygraph on it?\n   \n                       JACKIE\n             If it'll make you happy.\n   \n                       NICOLET\n             I sure hope you haven't done anything\n             dumb Jackie.\n   \n   Dargus comes to the doorway...\n   \n                       DARGUS\n                   (to Nicolet)\n             Can I have a word with you?\n   \n                       NICOLET\n             Sure.\n   \n   They both leave, leaving Jackie all by herself in the\n   room, smoking.\n   \n   They both come back in.\n   \n   Nicolet continues, Dargus takes a seat in the corner\n   saying nothing.\n   \n                       NICOLET (CONT'D)\n             Louis Gara's dead. L.A.P.D. found him\n             dead in a car on Ninth. And we've\n             lost Ordell.\n   \n                       JACKIE\n             I thought you were watching him.\n   \n                       NICOLET\n             We were, and we lost him. He walked\n             into a strip bar sometime around\n             three thirty and never came out. The\n             bar was on Ninth, less than a mile-\n             and-a-half from where Louis was found\n             dead. It looks like Louis's friend\n             shot him twice at point blank range.\n   \n                       JACKIE\n             So what happens now?\n   \n                       NICOLET\n             We pick up Ordell. We've got three\n             murders we can link him to. We have\n             the storage unit where he keeps his\n             guns, by tomorrow we'll have a search\n             warrant to go in and get him. And we\n             have you.\n   \n                       JACKIE\n             What about me?\n   \n                       NICOLET\n             What about you?\n   \n                       JACKIE\n             Do you think I took some of that\n             money?\n   \n                       NICOLET\n             I have no evidence of your taking\n             anything. You didn't pay for your\n             snazzy new suit with marked bills; I\n             was glad to see that. You've been\n             helping us out, you gave us Melanie\n             and Louis. Melanie had a packet of\n             marked bills stuffed in her shorts\n             when they found her, which goes a\n             long way backing up your story.\n   \n   Jackie listens.\n   \n                       NICOLET (CONT'D)\n             I'll settle for Ordell with the\n             marked bills.\n   \n                       NICOLET\n             If you have something else going on\n             you haven't told me about, it's\n             between you and Ordell. All I gotta\n             say is, you better hope we find him\n             before he finds you.\n   \n                                               DISSOLVE TO:\n   \n   \n   CLOSEUP ORDELL\n   \n   On the phone.\n   \n                       ORDEL\n             ... I can't leave here today... Mr.\n             Walker, I ain't goin' nowhere till I\n             get my money... You wouldn't have\n             that fuckin' boat weren't for me.\n             Man, I'm learnin' real fast who my\n             friends are... Mr. Walker?\n   \n   \n   INT. FILTHY APARTMENT - DAY\n   \n   Ordell turn to a glassy-eyed black female junkie nodding\n   on the couch named RAYNELLE. The filthy apartment we're\n   in belongs to her.\n   \n                       ORDELL\n             Can you believe that shit?\n             Motherfucker hung up on me. Ingrate\n             nigger. Do things for people and\n             that's how they treat you. Goddamn\n             girl, how can you live like this?\n   \n   He dials another number.\n   \n                       RAYNELLE\n                   (stoned)\n             Like what?\n   \n                       ORDELL\n             Girl, this shit is repugnant.\n   \n                       WINSTON (O.S.)\n                   (on other end of phone)\n             Cherry Bail Bonds.\n   \n                       ORDELL\n             Let me speak to Max Cherry.\n   \n   \n   INT. CHERRY BAIL BONDS - DAY\n   \n   Winston behind his desk, on the phone.\n   \n                       WINSTON\n             He ain't here right now.\n   \n                       ORDELL\n             He leave town?\n   \n                       WINSTON\n             He's around.\n   \n                       ORDELL\n             Give me his home number.\n   \n                       WINSTON\n             I'll give you his beeper.\n   \n                                               CUT TO:\n   \n   \n   A YOUNG BLACK COMEDIAN ON TV\n   \n   Def Comedy Jam plays on TV, a black comedian does a nasty\n   stand-up routine.\n   \n   \n   INT. FILTHY APARTMENT - NIGHT\n   \n   Ordell and Raynelle sit on the couch watching Def Comedy\n   Jam; neither one is laughing. Raynelle's too stoned.\n   Ordell's too tense. The phone rings, he jumps on it\n   \n                       ORDELL\n             Hello.\n   \n   \n   INT. CHERRY BAIL BONDS - NIGHT\n   \n   Max on the other end behind his desk. Winston sitting on\n   the edge of the desk listening.\n   \n                       MAX\n             I've been looking for you.\n   \n   Ordell's up and off the couch pacing.\n   \n                       ORDELL\n             You know who this is?\n   \n                       MAX\n             Mister Robbie, isn't it? I have the\n             ten thousand you put up. Isn't that\n             why you called.\n   \n   Ordell doesn't say anything.\n   \n                       MAX (CONT'D)\n             The bond collateral on Beaumont\n             Livingston you moved over to cover\n             Miss Brown, remember?\n   \n                       ORDELL\n             She got off, huh?\n   \n                       MAX\n             They decided to no-file. Tell me\n             where you are and I'll bring you your\n             money.\n   \n   Ordell doesn't say anything.\n   \n                       MAX (CONT'D)\n             You still there?\n   \n                       ORDELL\n             Looky here, I know you helped her and\n             I know you know what I want Jackie\n             can tell me any story come in that\n             pretty head of hers. Long as at the\n             end of that story, she hands over my\n             money. She do that, we're still\n             friends. Now, she don't wanna be my\n             friend no more, tell her to think\n             about ol' Louis. And if she tries to\n             turn me in, I'll name her ass as my\n             accessory. We'll go upstate together.\n             Hand in handcuffed hand. Now that\n             shit's a promise, understand what I'm\n             sayin'? You tell her that, and I'll\n             call you back.\n   \n   Ordell hangs up. Back in control. He looks to the TV. One\n   of the COMEDIANS cracks a joke. Ordell laughs.\n   \n   Max looks at Winston.\n   \n                       MAX\n             You're right, that was Ordell. You\n             have time, you think you could find\n             out for me where he's staying?\n   \n                       WINSTON\n             Cops can't locate him, huh?\n   \n                       MAX\n             They don't have your winning\n             personality.\n   \n                       WINSTON\n             Sure thing. I don't have to know what\n             I'm doing, long as you know.\n   \n                       MAX\n             I think I do. Is that good enough?\n   \n   \n   EXT. MOTEL - NIGHT\n   \n   A low-rent motel. We hear a phone ring inside one of the\n   rooms.\n   \n   \n   INT. MOTEL ROOM - NIGHT\n   \n   Jackie lies on a hotel bed, wearing a long t-shirt and\n   panties, watching TV that's chained to the wall.\n   \n   She answers the phone.\n   \n                       JACKIE\n             Hello.\n   \n   \n   INT. MAX'S OFFICE - NIGHT\n   \n   Max on the phone in his office, alone.\n   \n                       MAX\n             I know where he is.\n   \n   This gets her attention. She picks up the remote to the\n   TV set and zaps the sound.\n   \n                       JACKIE\n             How'd you find out?\n   \n                       MAX\n             All Winston had to do was ask around.\n             Ordell's living in Long Beach with a\n             woman junkie.\n   \n                       JACKIE\n             How does Winston find him if A.T.F.\n             and all the local Police can't?\n   \n                       MAX\n             People talk to Winston. He's street,\n             same as them, they trust him. They\n             get busted, they know somebody who\n             can bond them out. I thought I might\n             drop in on him. He'll no doubt be\n             surprised to see me.\n   \n                       JACKIE\n             He's liable to shoot you.\n   \n                       MAX\n             On the phone I told him I have the\n             ten thousand he put up for your bond.\n             I could bring the money and the\n             papers for him to sign. Walk out and\n             call the Sheriff's department.\n   \n   Jackie gets off the bed.\n   \n                       JACKIE\n             Ray wants him.\n   \n                       MAX\n             Everybody wants him, he's a homicide\n             suspect. It doesn't matter who brings\n             him in, he's gonna name you as an\n             accessory.\n   \n   Jackie lights up a Davidoff.\n   \n                       JACKIE\n             That's why A.T.F.'s gotta make the\n             case. I'm their witness. They\n             wouldn't have a case without me. If\n             it's his word against mine, who are\n             they gonna believe?\n   \n                       MAX\n             It's not that simple.\n   \n   Phone in one hand, smoke in the other, Jackie begins\n   pacing back and forth.\n   \n                       JACKIE\n             It never was, so I'm not gonna start\n             worrying about it now. Look, Ray more\n             or less believes my story, and he\n             more or less doesn't care. All he\n             really gives a shit about is getting\n             Ordell.\n   \n                       MAX\n             So how do we give Ordell to Nicolet?\n   \n                       JACKIE\n             Get Ordell to come to your office.\n   \n                       MAX\n             Set him up.\n   \n                       JACKIE\n             Uh-huh.\n   \n                       MAX\n             Tell him you want to see him?\n   \n                       JACKIE\n             Tell him I want to give him his\n             money.\n   \n                       MAX\n             Why?\n   \n                       JACKIE\n             I've chickened out. I'm afraid of\n             him. He'll like that.\n   \n                       MAX\n             What do you tell Nicolet?\n   \n                       JACKIE\n             Ordell called and wants to meet me\n             and I'm scared.\n   \n                       MAX\n             We get Ordell to come to my office.\n             Nicolet - is he already there, or\n             does he come busting in while we're\n             chatting?\n   \n   Jackie takes a drag.\n   \n                       JACKIE\n             He's already there.\n   \n                       MAX\n             What if he hears something he's not\n             supposed to?\n   \n                       JACKIE\n             Well, we don't let that happen, now\n             do we?\n   \n   \n   EXT. FILTHY APARTMENT - NIGHT\n   \n   Max at the front door or Raynelle's apartment. He pounds\n   on the door.\n   \n   Ordell throws open the door.\n   \n                       ORDELL\n             What the fuck you doin' knockin on\n             the door like the goddamn police? You\n             lookin' to get shot?\n   \n                       MAX\n             I thought you might be asleep.\n   \n                       ORDELL\n             You keep fuckin' with me, you're\n             gonna be asleep forever.\n   \n   He looks past Max.\n   \n                       MAX\n             I'm alone.\n   \n                       ORDELL\n             Git your ass in here.\n   \n   Max enters, Ordell slams the door.\n   \n   As Ordell turns away from the door, Maxis reaching into\n   his coat. Ordell brings his Beretta up at Max.\n   \n                       ORDELL\n             You better freeze, motherfucker!\n   \n   Max freezes, his hand in his coat pocket.\n   \n                       MAX\n             You want your money? Your bond\n             refund?\n   \n   He takes his hand out, it's holding stack of bills\n   wrapped in a rubber band. He tosses it to Ordell, who\n   catches it with his free hand.\n   \n                       ORDELL\n             That's all?\n   \n                       MAX\n             I have a bond receipt for you to\n             sign.\n   \n                       ORDELL\n             You know what the fuck I'm talkin'\n             about. You talk to her?\n   \n                       MAX\n             She wants to give you your money. If\n             she didn't, there'd be cops batter-\n             ramming the door right now.\n   \n                       ORDELL\n             How'd you find me?\n   \n                       MAX\n             Winston found you.\n   \n                       ORDELL\n             How the fuck did he find me?\n   \n                       MAX\n             That's what Winston does. He finds\n             people who don't want to be found.\n   \n                       ORDELL\n             Well, bully for that nigga. You say\n             she wants to give me the money, huh?\n   \n                       MAX\n             Uh-huh.\n   \n                       ORDELL\n             Well, give it to me then.\n   \n                       MAX\n             She wants to give it to you herself\n             and collect her ten percent. She also\n             wants to explain why she had to hold\n             on to it.\n   \n                       ORDELL\n             I'd like to hear that too. Turn\n             around and put your hands on your\n             head.\n   \n   Max does this, Ordell pats him down.\n   \n                       MAX\n             Jackie didn't trust Melanie. She'd\n             already tried to get Jackie to go in\n             with her, split the half million\n             amongst themselves. What she did was\n             take quite a risk to see you get your\n             money.\n   \n                       ORDELL\n             Lift up your pant leg. You help her?\n   \n                       MAX\n             All I did was walk out with it.\n   \n                       ORDELL\n             And you did that to protect my\n             interest?\n   \n                       MAX\n             In a way, yes.\n   \n                       ORDELL\n             My ass be dumb, but I'm not a\n             dumbass. Go sit over there on the\n             couch.\n   \n   Max does.\n   \n                       MAX\n             This place stinks.\n   \n                       ORDELL\n             You get used to it after a while. Now\n             tell me where my money's at.\n   \n                       MAX\n             My office.\n   \n                       ORDELL\n             And where's Jackie?\n   \n                       MAX\n             She's been there since Thursday\n             night.\n   \n                       ORDELL\n             She wanted to see me, why wasn't she\n             home?\n   \n                       MAX\n             She was afraid.\n   \n                       ORDELL\n                   (laughs)\n             That I gotta see.\n   \n                       MAX\n             She still is. She doesn't want to get\n             shot before she can tell you what\n             happened.\n   \n                       ORDELL\n             Have her bring the money here.\n   \n                       MAX\n             It's in the safe. She can't get at\n             it.\n   \n                       ORDELL\n             Call her, tell her the combination.\n   \n                       MAX\n             I'm telling you, you got her spooked.\n             She won't leave there till you have\n             your money and you're gone.\n   \n                       ORDELL\n             You expect me to just walk in there?\n   \n                       MAX\n             If she wanted to set you up, you'd be\n             in custody right now. When you said\n             you'd name her as an accessory she\n             believed you. That scares her more\n             than anything.\n   \n                       ORDELL\n             That's why she's givin' up my money\n             huh? Not that bullshit about Melanie.\n             I didn't trust her ass neither, but I\n             knew how to handle her. She was my\n             blonde-headed little surfer gal. I\n             fuckin' told Louis he could've just\n             given her a punch in the mouth, he\n             didn't need to shoot her. She's at\n             your office.\n   \n                       MAX\n             Uh-huh.\n   \n                       ORDELL\n             By herself. That big mandingo nigga\n             Winston ain't there, is he?\n   \n                       MAX\n             She's all alone.\n   \n                       ORDELL\n             I call your office, she better answer\n             the phone.\n   \n                       MAX\n             She will.\n   \n   \n   INT. CHERRY BAIL BONDS - NIGHT\n   \n   Jackie on the phone with Ordell, sitting behind Max's\n   desk.\n   \n                       JACKIE\n             I'll be here. Se ya' in a bit.\n   \n   She hangs up the phone. Then starts dialing again...\n   \n   \n   INT. RAY NICOLET'S APARTMENT - NIGHT\n   \n   A STEDICAM glides through the apartment, it falls on a\n   beeper \"beeping\", a gun, a wallet and car keys on a\n   dresser drawer... it leaves that and lands on a TV\n   screen: Tom Snyder is interviewing a guest on his show\n   ... it leaves that and falls on two empty and one quarter-\n   filled beer bottles... it leaves that and falls on a\n   sleeping Ray Nicolet passed out in his reclining chair.\n   The sound of Tom Snyder and the faint beeping are heard\n   offscreen.\n   \n   \n   EXT. FILTHY APARTMENT - NIGHT\n   \n   They leave the apartment walking to Max's car.\n   \n                       ORDELL\n             All the time I've known her, I never\n             heard her sound scared like that.\n             Ordinarily she's too cool for school.\n             I'm driving, gimme the keys.\n   \n   Max hands him the keys. They climb in.\n   \n   \n   INT. CHERRY BAIL BONDS - NIGHT\n   \n   Jackie sitting behind the desk. She opens the drawer to\n   her right, Max's .38 sits there. She closes the drawer.\n   \n   \n   INT. CADILLAC (MOVING) - NIGHT\n   \n   Ordell behind the wheel, Max the passenger. Ordell plays\n   the radio, he likes the song and turns it up.\n   \n   \n   BACK TO JACKIE\n   \n   Sitting alone in the office, she gets up and turns off\n   the lights. The office goes dark. No music.\n   \n   \n   BACK TO ORDELL AND MAX\n   \n   The song plays LOUD. Ordell moves his head to the music\n   slightly. Mak sits silently in the passenger seat,\n   sneaking a look at Ordell every once in a while.\n   \n   \n   BACK TO JACKIE\n   \n   Sitting behind Max's desk in the dark. She takes out her\n   Davidoffs and lights one up with her Bic. Her face is\n   illuminated for a moment - then it's out. She exhales a\n   drag. No music.\n   \n   \n   BACK TO ORDELL\n   \n   CLOSEUP ORDELL\n   \n   His face is ice, the music is LOUD.\n   \n   \n   BACK TO JACKIE\n   \n   CLOSEUP JACKIE\n   \n   She's cool as a breeze, smoking her brand. No music.\n   \n   \n   BACK TO ORDELL AND MAX\n   \n   Music is LOUD. Ordell's driving. Max says;\n   \n                       MAX\n             It's the next street.\n   \n                       ORDELL\n             I know where it is.\n   \n                       MAX\n             Turn left.\n   \n                       ORDELL\n             I know where to turn.\n   \n   \n   BACK TO JACKIE\n   \n   Sitting behind Max's desk. Headlights shine in the\n   window. She is lit by them. She puts out her Davidoff and\n   sits back in the chair. The light source cuts off.\n   \n   \n   BACK TO ORDELL AND MAX\n   \n   Sitting in the parked Cadillac. Ordell has just turned\n   off the lights and turns to Max, Beretta in hand.\n   \n                       ORDELL\n             My money's in that office, right?\n   \n                       MAX\n             Uh-huh.\n   \n                       ORDELL\n             She starts givin' me some bullshit\n             about it ain't there. It's somewhere\n             else and we can go get it.\n                   (he holds up his Beretta)\n             I'm shootin' you in the head right\n             then and there. Then I'm gonna shoot\n             her in the kneecap, find out where my\n             godamn money is. I go walkin' in\n             there and that nigga Winston or\n             anybody else is in there, you're the\n             first man shot, understand what I'm\n             sayin'?\n   \n                       MAX\n             Yeah.\n   \n                       ORDELL\n             Now, is there anything you want to\n             tell me before we get out of this\n             car?\n   \n                       MAX\n             No.\n   \n                       ORDELL\n             You sure?\n   \n                       MAX\n             Yes.\n   \n                       ORDELL\n             You better be, motherfucker.\n   \n   \n   EXT. CHERRY BAIL BONDS - NIGHT\n   \n   They both get out of the Cadillac. Ordell sticks his gun\n   in his pants.\n   \n                       ORDELL\n             Get ahead of me and open the door.\n   \n   Max steps in front of him, puts his keys in the lock and\n   opens the door.\n   \n                       ORDELL (CONT'D)\n             Step inside easy.\n   \n   Max does.\n   \n   Max sees; Jackie sitting at his desk in the dark.\n   \n   Ordell sees this, too and moves past Max.\n   \n                       ORDELL (CONT'D)\n             Hey, girl, what the hell you sitting\n             in the goddamn dark for?\n   \n   Max sees; Ordell moves past him... then he sees the\n   bathroom door on the left side of the desk open, throwing\n   light into the room, onto Jackie and the figure who steps\n   out of the bathroom... Mark Dargus.\n   \n   Max sees; Ordell looks to Dargus, then back to Jackie.\n   Then Jackie says;\n   \n                       JACKIE\n             Mark...\n                   (raising her voice)\n             ... he's got a gun!\n   \n   Max sees; Ordell almost jumps, his arm goes to the\n   Beretta in his pants...\n   \n   ... just as Dargus raises his gun and SHOOTS him three\n   times in the chest...\n   \n   ... Ordell drops o the ground like a sack of potatoes, he\n   lands at Max's feet.\n   \n   Max looks down and sees Ordell's head by his shoes, look\n   of panic still on his face, dead as fried chicken.\n   \n   Max sees Dargus come over, bending on one nee next to\n   Ordell's body.\n   \n   Max looks over at Jackie, still behind the desk. She\n   looks eyes with Max for a moment, then stands and walks\n   over to the body.\n   \n   Then Max sees ONE SHERIFF DEPUTY step out of the dark\n   holding a shogun ... then another... then Winston step\n   out of the bathroom.\n   \n                       DARGUS\n             He's dead.\n   \n   Dargus looks up at Max;\n   \n                       DARGUS (CONT'D)\n             Does he have the marked bills on him?\n   \n   Max still shaken;\n   \n                       MAX\n             In his inside coat pocket.\n   \n   Dargus reaches in and pulls out the envelope containing\n   the forty-thousand marked dollars.\n   \n   Max looks at Jackie.\n   \n   She looks down at the dead Ordell with no expression,\n   just light up another Davidoff.\n   \n   Dargus looks up at Max;\n   \n                       DARGUS\n             Why were you with him?\n   \n                       MAX\n             I went to give him his refund, so he\n             wouldn't have to come here.\n   \n                       DARGUS\n             How'd you know where he was?\n   \n                       MAX\n             I found out.\n   \n                       DARGUS\n             And you didn't tell the Police?\n   \n                       MAX\n             I told Jackie, and Jackie said you\n             wanted him.\n   \n   Dargus looks down at he man he just killed.\n   \n                       JACKIE\n             Remember when Ray said you hoped\n             you'd get him before he got me?\n   \n   Dargus looks up and nods his head.\n   \n                       JACKIE (CONT'D)\n             Well, you did. Thank you.\n   \n   She takes a drag on her Davidoff.\n   \n                                               FADE TO BLACK\n   \n   \n   INT. CHERRY BAIL BONDS - DAY\n   \n   As opposed to the last scene late at night, it's early\n   morning. Max sits at his desk, filling out a report.\n   \n   A SUB-TITLE APPEARS BELOW:\n   \n   \"TEN DAYS LATER\"\n   \n   Max hears someone go;\n   \n                       JACKIE (O.S.)\n             Knock knock.\n   \n   Max looks up and sees Jackie Brown, standing in the\n   doorway. She smiles at him.\n   \n                       JACKIE (CONT'D)\n             Hey.\n   \n   MAX FLASHES ON Jackie behind the desk.\n   \n                       JACKIE (CONT'D)\n             Mark... he's got a gun!\n   \n   Dargus shoots Ordell, Ordell drops.\n   \n   \n   BACK TO OFFICE\n   \n   Max smiles back.\n   \n                       MAX\n             Hey, you.\n   \n   Jackie walks toward him.\n   \n                       JACKIE\n             I got your package. It was fun\n             getting a half-a-million dollars in\n             the mail.\n   \n                       MAX\n             Less ten percent.\n   \n                       JACKIE\n             Yeah, your fee. I had to figure that\n             out, since there wasn't no note.\n   \n   She sits in the chair in front of his desk.\n   \n                       JACKIE (CONT'D)\n             Only this isn't a bail bond, Max.\n   \n                       MAX\n             I hesitated taking that much.\n   \n                       JACKIE\n             You worked for it - if you're sure that's all\n             you want.\n   \n                       MAX\n             I'm sure.\n   \n   Pause between them.\n   \n                       JACKIE\n             I'm leaving, I have my things in my\n             car. Why don't you walk out with me?\n             I want to show you something.\n   \n   Max hesitates.\n   \n                       JACKIE (CONT'D)\n             Come on, Max. I won't hurt you.\n   \n   He smiles and gets up from the desk.\n   \n   As she stands, Jackie says;\n   \n                       JACKIE (CONT'D)\n             I saw Ray the other day. Boy is he\n             pissed he missed all the excitement.\n   \n                       MAX\n             What's he doing?\n   \n                       JACKIE\n             He's on to a new thing. He's after a\n             guy who owns a gun shop he says is\n             \"woefully and wantonly\" selling\n             assault rifles to minors. He says\n             he's gonna take him down if it's the\n             last thing he does.\n   \n                       MAX\n             Did you tell him you were leaving?\n   \n                       JACKIE\n             I told him I might.\n   \n   \n   EXT. CHERRY BAIL BONDS - DAY\n   \n   They walk outside and Max sees Ordell's black Mercedes\n   convertible.\n   \n                       MAX\n             That's Ordell's.\n   \n                       JACKIE\n             They've confiscated all his other\n             stuff. But this one's sorta left\n             over. The registration's in the glove\n             box, the keys were under the seat...\n             What's a matter\" haven't you ever\n             borrowed someone's car?\n   \n                       MAX\n             Not after they're dead.\n   \n   She walks around to the other side of the car, and looks\n   at him across the black Mercedes.\n   \n                       JACKIE\n             I didn't use you, Max.\n   \n                       MAX\n             I didn't say you did.\n   \n                       JACKIE\n             I never lied to you.\n   \n                       MAX\n             I know.\n   \n                       JACKIE\n             We're partners.\n   \n                       MAX\n             I'm fifty-five-years old. I can't\n             blame anybody for anything I do.\n   \n                       JACKIE\n             Do you blame yourself for helping me?\n   \n   He shakes his head 'no.'\n   \n                       JACKIE (CONT'D)\n             'd feel a whole lot better if you\n             took some more money.\n   \n                       MAX\n                   (smiling)\n             You'll get over that.\n   \n   Jackie smiles.\n   \n                       MAX (CONT'D)\n             Where're you going?\n   \n                       JACKIE\n             Spain.\n   \n                       MAX\n             Madrid or Barcelona?\n   \n                       JACKIE\n             Start off in Madrid. Ever been there?\n   \n   He shakes his head 'no.'\n   \n                       JACKIE (CONT'D)\n             I hear they don't eat dinner till\n             midnight.\n   \n   Max doesn't say anything.\n   \n                       JACKIE\n             Wanna go?\n   \n                       MAX\n             Thanks, but you have a good time.\n   \n                       JACKIE\n             Sure I can't twist your arm?\n   \n                       MAX\n             Thank you for saying that, but no. My\n             business.\n   \n                       JACKIE\n             I thought you were tired of your\n             business?\n   \n                       MAX\n             I'm just tired in general.\n   \n                       JACKIE\n             Are you scared of me?\n   \n   Max smiles and holds up two fingers, close to each other.\n   \n                       MAX\n             A little bit.\n   \n   Jackie smiles back.\n   \n                       JACKIE\n             Come over here.\n   \n   Max does.\n   \n   They give each other a long, tender kiss.\n   \n   She breaks it.\n   \n                       JACKIE (CONT'D)\n             I'll send you a postcard, partner.\n   \n   \n   \n   THE END\n\n\n\n\n\n\nJackie Brown\nWriters :   Quentin Tarantino\nGenres :   Comedy  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:27:57.464929"}