{"title": "Jaws", "film_link": "/Movie Scripts/Jaws Script.html", "script_link": "/scripts/Jaws.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Jaws Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Jaws Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (9.71 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Peter Benchley\" title=\"Scripts by Peter Benchley\">Peter Benchley</a><br/>  <a href=\"/writer.php?w=Carl Gottlieb\" title=\"Scripts by Carl Gottlieb\">Carl Gottlieb</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> :  1975<br/>\n<br/>\n<a href=\"/scripts/Jaws.html\">Read \"Jaws\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>                                 \"STILLNESS IN THE WATER\"\n\n<b>                                           AKA:\n</b>\n<b>                                          \"JAWS\"\n</b>\n                                            by\n\n                                      Carl Gottlieb\n\n                                           and\n\n                                      Peter Benchley\n\n                                      From the novel\n\n                                            by\n\n                                      Peter Benchley\n\n<b>                \n</b>\n<b>               OVER BLACK\n</b>\n               Sounds of the innerspaces rushing forward.\n\n               Then a splinter of blue light in the center of the picture.\n\n               It breaks wide, showing the top and bottom a silhouetted \n               curtain of razor sharp teeth suggesting that we are inside \n               of a tremendous gullet, looking out at the onrushing undersea \n               world at night. HEAR a symphony of underwater sounds: \n               landslide, metabolic sounds, the rare and secret noises that \n               certain undersea species share with each other. Also, the \n               hint of familiar music, twisted and distorted by the depths.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               EXT. BEACH \u0096 NIGHT \u0096 SHARK'S POINT OF VIEW \u0096 RISING OUT OF \n</b><b>               THE WATER, LOOKING AT\n</b>\n               It is a pleasant, moonlit, windless night in mid-June. We \n               see a long straight stretch of white beach. Behind the low \n               dunes are the dark shapes of large expensive houses. Hear a \n               number of voices singing. It sounds like an eastern \n               university's alma mater, no longer distorted.\n\n<b>               EXT. BEACH \u0096 NIGHT \u0096 ANOTHER ANGLE\n</b>\n               Around a blazing bonfire, a group of young men and women, \n               beer cans (or maybe a keg) in evidence, as well as the bota \n               Spanish leather wine-bag much in favor by beach and ski-bum \n               types.\n\n               The group is swapping sentimental alma maters, weepily singing \n               eastern Ivy League anthems -\u0096 Dartmouth, Cornell, Harvard, \n               Penn, etc. Two young people break away from the others. They\n\n               are Tom Cassidy and Chrissie. Behind them, there is \n               considerable necking activity; Tom and Chrissie are more \n               serious.\n\n<b>               TOM\n</b>\n               Makes a clumsy attempt at snaring Chrissie, cups her from \n               behind. She squirms playfully out of his grasp. We discover \n               he's not especially sober.\n\n<b>                                     TOM\n</b>                         Hey! Hey hey! I'm with you, right?\n\n<b>               EXT. ANOTHER PART OF THE BEACH \u0096 NIGHT\n</b>\n               Tom and Chrissie are separated from the others, silhouetted \n               against the fire, she pauses and looks at the ocean, he is \n               plodding along in the sand, winded.\n\n               Chrissie runs down the slope of the dune towards the water, \n               leaving Tom reeling atop the dune. As she runs, she is \n               shedding her clothes. Tom is trying to trail her by her \n               clothes, like Hansel following bread crumbs through the woods.\n\n               But Chrissie is way ahead of him.\n\n<b>                                     CHRISSIE\n</b>                         C'mon!\n\n               She runs headlong into the inviting sea, plunges cleanly \n               into the water with a light \"Whoops!\" as the cold water sweeps \n               over her.\n\n               Behind all this, we continue to hear the sentimental, beery \n               chorus of alma maters.\n\n               Then we see it -- a gentle bulge in the water, a ripple that \n               passes her a dozen feet away. A pressure wave lifts her up, \n               then eases her down again, like a smooth, sudden swell.\n\n<b>                                     CHRISSIE\n</b>                         Tommy? Don't dunk me...\n\n               She looks around for him, finds him still on the beach, his \n               feet tangled in his pants, which have dropped around his \n               ankles. She starts to swim back in to him.\n\n<b>               EXT. CHRISSIE IN THE WATER\n</b>\n               Her expression freezes. The water-bulge is racing towards \n               her. The first bump jolts her upright, out of the water to \n               her hips. She reaches under water to touch her leg. Whatever \n               she feels makes her open her mouth to scream, but she is \n               slammed again, hard, whipped into an arc of about eight feet, \n               up and down, submerging her down to her open mouth, choking \n               off any scream she might try to make. Another jolt to her \n               body, driving her under so that only her hair swirls on the \n               surface. Then it too is sucked below in a final and terrible \n               jerking motion. HOLD on the eddies and swirls until we're \n               sure it's all over.\n\n<b>               EXT. CLOSE ON TOM ON BEACH\n</b>\n               In his shorts, laughing to himself, turning in slow stoned \n               circles, held prisoner by his windbreaker which seems to \n               have him in an armlock, as he struggles to free his arm from \n               a tight sleeve. As he turns, we hear the alma maters in the \n               background, from the fire.\n\n<b>               INT. BRODY HOUSE - BEDROOM - EARLY MORNING\n</b>\n               A shaft of morning sun blasts through the crack between the \n               bottom of the shade and the windowsill, falling across the \n               heads of the sleeping couple on the bed. It catches Martin \n               Brody right across the eyes, bringing him up from sleep.  \n               The job is completed by the clock radio, which clicks on \n               with local fisherman's report and weather.\n\n<b>                                     RADIO ANNOUNCER (V.O.)\n</b>                         Hayes Landing reports conditions \n                         good, with stripers and jacks. The \n                         Coast Guard has no storm warning \n                         from Block Island to Cape Hatteras; \n                         a light chop with freshening winds, \n                         continued clear and mild... (etc.)\n\n               Ellen Brody burrows her head under the covers, avoiding \n               morning for a few precious minutes more.\n\n<b>                                     BRODY\n</b>                         How come the sun didn't used to shine \n                         in here?\n\n<b>                                     ELLEN\n</b>                         'cause when we bought the house it \n                         was Autumn. This is summer. Feed the \n                         dogs.\n\n               We hear the scampering toenails of two cocker spaniels \n               scrabbling around the foot of the bed. Brody swings out of \n               bed, wearing shorts, socks, and tee shirt.\n\n<b>                                     BRODY\n</b>                         Right.\n\n<b>                                     ELLEN\n</b>                         Do you see the kids?\n\n<b>                                     BRODY\n</b>                         Probably out in the back yard.\n\n<b>                                     ELLEN\n</b>                         In Amity, you say 'Yahd.'\n                              (she gives it the \n                              Boston sound)\n\n<b>                                     BRODY\n</b>                         The kids are in the yahd, playing \n                         near the cah. How's that sound?\n\n<b>                                     ELLEN\n</b>                         Like you're from N'Yawk.\n                              (gives it Brooklyn \n                              sound)\n\n<b>                                     BRODY\n</b>                         Give me 30 years, I'll get it.\n\n               He leads the dogs out of the bedroom and down to the kitchen.\n\n<b>               INT. BRODY KITCHEN - MORNING\n</b>\n               Brody enters, sets down some dog food, goes to make coffee, \n               starts to fill kettle to boil water, the cold water rushes \n               through and out the burnt-out bottom of the kettle.\n\n<b>                                     BRODY\n</b>                         Did you burn another kettle? Y'know \n                         you're a fire hazard? This is the \n                         third one!\n\n<b>                                     ELLEN (O.S.)\n</b>                         I never hear the whistle.\n\n<b>                                     BRODY\n</b>                         Feed the dogs.\n\n               Ellen Brody, a tall, attractive blonde woman, enters from \n               upstairs. She's still slightly sleepy, not what you'd call \n               an \"Instant-On\" person. Mornings are not her best time.\n\n<b>                                     ELLEN\n</b>                         You want to go through those?\n                              (she indicates bag of \n                              clothes)\n                         I'm taking them to the Thrift Shop.  \n                         It's Marcia Vaughn's pet charity.  \n                         Pick out what you want to keep -- \n                         it's mostly your city clothes.\n\n<b>                                     BRODY\n</b>                              (looking through bag, \n                              remembering)\n                         I used to wear this to the Garden. \n                         Garbage strikes. Dog shit. Muggers.\n                              (he puts it all behind)\n                         Ship it.\n\n<b>                                     ELLEN\n</b>                         Don't be silly -\u0096 You're going to \n                         make summer better for them...\n\n               Before Brody can answer, Michael, his oldest boy, enters, \n               holding his hand. There is bright new blood on it, but he is \n               sensibly unconcerned. It's a normal childhood scrape.\n\n<b>                                     MICHAEL\n</b>                         Cut my hand. Hit by a vampire.\n\n<b>                                     BRODY\n</b>                         On the swing? I told you not to play \n                         near there until I sanded it down.\n                              (to Ellen)\n                         See what your son did?\n\n<b>                                     ELLEN\n</b>                         Go upstairs and bring Mommy a band-\n                         aid.\n\n               Michael goes on out and upstairs. Ellen fumbles in her pocket \n               and produces Brody's new glasses, which she holds out to \n               him.\n\n<b>                                     ELLEN\n</b>                         Don't forget these.\n\n<b>                                     BRODY\n</b>                         Oh, yeah.\n                              (he puts them on)\n                         How do I look? Older, huh?\n\n<b>                                     ELLEN\n</b>                         I think they make you look sexy.\n\n               Brody reacts to this, and bends to kiss her lightly. Then \n               more seriously.\n\n<b>                                     BRODY\n</b>                         Sexy, hm? What was I before?\n\n<b>                                     ELLEN\n</b>                         Older, sillier.\n\n<b>                                     BRODY\n</b>                              (as he goes to make \n                              coffee, he fumbles \n                              with the new glasses)\n                         I don't want to depend on these \n                         things, y'know -\u0096 sometimes you can \n                         weaken your eyes.\n\n               He looks out the window to the view beyond, discovering some \n               new wonder in the fresh sunlit morning.\n\n<b>               BRODY'S POINT OF VIEW \u0096 OUTSIDE THE HOUSE\n</b>\n               Sean, the younger child, is happily romping in the summer \n               air, enjoying the very air he breathes.\n\n<b>                                     BRODY\n</b>                         Let's see...\n\n               The phone rings.\n\n<b>               INT. BRODY KITCHEN \u0096 DAY\n</b>\n               Brody answers one of two phones on the wall.\n\n<b>                                     BRODY\n</b>                         Brody... yeah, what's up... mmm... \n                         Well, what do they usually do, float \n                         or wash up? Really?... okay, I'll \n                         meet both of you at the beach in\n                              (checks watch)\n                         ...20 minutes, okay? Okay.\n                              (hangs up)\n                         First goddamn weekend of the summer.\n\n               Michael reenters in bathing trunks, with a towel on his \n               shoulder, his hand washed, holding a band-aid ready for \n               application. Ellen takes it, and bandages the finger with \n               care and affection.\n\n<b>                                     ELLEN\n</b>                         There.\n                              (to Brody)\n                         What was that?\n\n               Michael heads toward the beach.\n\n<b>                                     BRODY\n</b>                              (struggling to get \n                              his shirt on over \n                              his glasses)\n                         The office.\n\n               He gets his shirt on with Ellen's help. She flicks imaginary \n               dust from the badge on his chest.\n\n<b>                                     ELLEN\n</b>                         Be careful.\n\n<b>                                     BRODY\n</b>                         Here? You gotta be kiddin'.\n\n               He gives her a light kiss, starts to go, with his cup.\n\n<b>                                     BRODY\n</b>                         Love ya.\n\n<b>                                     ELLEN\n</b>                              (kissing him back)\n                         Hey Chief. Bring my cup back.\n\n               At the door, he takes a windbreaker off a peg and goes on \n               out.\n\n               We can see the Amity Police shoulder patch as he goes to a \n               van parked outside.\n\n<b>               EXT. ISLAND HIGHWAY - MORNING\n</b>\n               Martin Brody's Country Squire police wagon rushes past, taking \n               the view to an enormous billboard depicting a typical summer \n               day in Amity. A beautiful model splashes in the gold surf, \n               languishing in a Solarcaine sun. AMITY WELCOMES YOU is written \n               above her flailing arms.\n\n<b>               EXT. AMITY BEACH - DAY\n</b>\n               Three small figures in the landscape, walking the beach. The \n               surf is rough and there is sea-floor debris strewn about \n               from the receding tide.\n\n<b>               CLOSER ANGLE\n</b>\n               Deputy Hendricks is searching the shore about one hundred \n               yards down wind. Meanwhile, Brody, in his casual police \n               attire, and Tom Cassidy, still in the clothing we saw him in \n               last night, walk down the beach. Brody fingers the missing \n               girl's shoes, purse and clothes. In the daylight, Cassidy \n               misconducts himself, wavering between inflated maturity and \n               tear-blown adolescence.\n\n<b>                                     BRODY\n</b>                         Christine what?\n\n<b>                                     CASSIDY\n</b>                         Worthingsly... Worthington -- no one \n                         ever died on me before.\n\n<b>                                     BRODY\n</b>                         You picked her up on the ferry.\n\n<b>                                     CASSIDY\n</b>                         I didn't know her.\n\n<b>                                     BRODY\n</b>                         And nobody else saw her in the water?\n\n<b>                                     CASSIDY\n</b>                         Somebody could've -- I was sort of \n                         passed out.\n\n<b>                                     BRODY\n</b>                         Think she might've run out on you?\n\n<b>                                     CASSIDY\n</b>                         Oh, no, sir. I've never had a woman \n                         do that. I'm sure she drowned.\n\n<b>                                     BRODY\n</b>                         You from around here?\n\n<b>                                     CASSIDY\n</b>                         No. Cambridge. Harvard. My family's \n                         in Tuxedo, New York, though.\n\n<b>                                     BRODY\n</b>                         You here for the summer?\n\n<b>                                     CASSIDY\n</b>                         Some friends and me took a house.\n\n<b>                                     BRODY\n</b>                              (genuinely curious)\n                         What d'you pay for a place just for \n                         the summer?\n\n<b>                                     CASSIDY\n</b>                         A thousand apiece, something like \n                         that. There's five of us. And we \n                         each kick in a hundred a week for \n                         beer and cleaning, stuff like that.\n\n<b>                                     BRODY\n</b>                         Pretty stiff.\n\n               A shrill whistle makes them turn. Hendricks is fifty yards \n               away, on his knees. He blows again, a feeble report this \n               time.\n\n<b>                                     BRODY\n</b>                         Maybe that's your girl.\n\n               Brody runs toward Hendricks, Cassidy hesitates, then follows \n               with:\n\n<b>                                     CASSIDY\n</b>                              (pathetically)\n                         You can't make me look -- !\n\n<b>               MASTER ANGLE - THE SAND DUNE\n</b>\n               A skein of seaweed garnishes the base of this isolated dune.\n\n               The booming waves and fizzing surf make dialogue inaudible.\n\n               Deputy Hendricks on hands and knees, looking white as a sheet.  \n               Brody tells Cassidy to wait at the foot of the dune, and \n               ventures up. Hendricks stops him with a wave-off, saying \n               something at the same time. Brody nods understanding and \n               steps up cautiously and looks down. He adjusts his glasses, \n               trying to make sense of what he is looking at.\n\n               Whatever he sees has a marked effect on his entire physique.\n\n               Kicking out with his foot, Brody sends dozens of angry \n               horseshoe crabs into an escape frenzy and they boil over the \n               top of the dune and down its slopes.\n\n               Cassidy takes a few uneasy steps backwards when Brody waves \n               him over. He shakes his head. An awkward moment. Then Cassidy \n               shuffles forward and up the few remaining feet, his eyes \n               looking everywhere but down. Brody says something else and \n               Cassidy shakes his head again, eyes out at sea. Brody puts \n               his hand gently around the quaking man's shoulder.\n\n               Nodding, he starts to look down, an inch at a time. He looks.\n\n               He, too, can't make out what it is at first. Then he \n               understands.\n\n               The jolt that assaults Cassidy is not unexpected. He falls \n               backward in a sitting position as though shot. Nods yes -- \n               it's her. Brody turns and slides off the dune, stumbling \n               close. Hear his breathing. He looks around, envisioning the \n               week ahead of him....\n\n<b>               QUICK SHARP CUT\n</b>\n               Chrissie's remains, incomplete from the chest down, horribly \n               bitten. (NOTE: See Hooper's dialog in Sc. 91 for complete \n               description of corpse.)\n\n<b>               INT. BRODY'S OFFICE - DAY\n</b>\n               Brody walks through the door and enters his office, holding \n               a fizzing glass of Alka-Seltzer. Polly, his sixty-one year \n               old secretary follows close on his heels with her shorthand \n               pad of messages and reminders.\n\n               In the outer office, Hendricks and Cassidy slump into chairs, \n               sipping from fizzing dixie cups.\n\n               Brody dips into file drawers for the appropriate forms. He \n               gently turns on Polly, who is behind him.\n\n<b>                                     BRODY\n</b>                         If this is going to work, you've got \n                         to keep current stuff out here, and \n                         put 'closed' files in there. The \n                         'Pendings' stay on my desk, okay?\n\n               Brody slips behind his typewriter, putting paper in the \n               machine with the effortless ease of years of practice. He's \n               obviously no stranger to paperwork. He touch types, hardly \n               ever looking down, checking his notes and listening with one \n               ear to Polly.\n\n               He is affected by what he's seen, but there's work to be \n               done.\n\n<b>                                     POLLY\n</b>                         This is in no order of importance, \n                         Chief: There's a meeting on the Amity \n                         Town Council on Aging this Monday \n                         night, Bentoncourt Hall. The Fire \n                         Inspector wants you to go over the \n                         fireworks site with him before he \n                         catches the one o'clock ferry. Mainly, \n                         you have a batch of calls about that \n                         new Karate school.\n\n<b>               CLOSE - ACCIDENT REPORT\n</b>\n               Brody has just typed the girl's name. He skips the space for \n               Cause-of-Death, and just under it types the Next-of-Kin \n               information he has collected from her wallet.\n\n<b>                                     POLLY\n</b>                         Searle's Rent-a-Bike, the Rainy Ale, \n                         Tisberry's Hardware... they say it's \n                         those nine-year-olds from the school \n                         practicing karate on all those nice \n                         picket fences.\n\n               The phone rings and Polly picks it up.\n\n<b>                                     POLLY\n</b>                         It's the Coroner. Somebody pass away \n                         in the night?\n\n               Brody nestles the phone between ear and collar, listening, \n               as he turns to the typewriter.\n\n<b>                                     BRODY\n</b>                         Jesus, Santos.\n\n<b>               INSERT - ACCIDENT REPORT\n</b>\n               Cause-of-Death line rolls into place. The hammers punch out: \n<b>               SHARK ATTACK.\n</b>\n<b>               BRODY\n</b>\n               leans forward, staring at what he just wrote. Polly cocks \n               her head and removes the phone from his ear.\n\n<b>                                     POLLY\n</b>                         What's the matter?\n\n               Brody takes a breath. A new resolve comes over him.\n\n<b>                                     BRODY\n</b>                         Polly, I want to know what water \n                         recreation is on for today.\n\n<b>                                     POLLY\n</b>                         Right this minute?\n\n               Brody gets up and moves hastily toward the door.\n\n<b>               BRODY'S OUTER OFFICE\n</b>\n               Cassidy and Hendricks look up as Brody enters.\n\n<b>                                     BRODY\n</b>                              (To Hendricks)\n                         Where'd you hide the 'Beach Closed' \n                         signs?\n\n<b>                                     HENDRICKS\n</b>                         We never had any. What's the problem?\n\n               A local merchant comes through the door.\n\n<b>                                     LOCAL MERCHANT\n</b>                         Glad I caught you. There's a city \n                         truck with New Hampshire plates parked \n                         right in front of my...\n\n               Brody pushes past him and out the door.\n\n<b>               EXT. AMITY MAIN STREET \u0096 DAY\n</b>\n               In the busy center of a town preparing for the big Fourth of \n               July weekend, Brody wends his way around sidewalk activity, \n               purpose and haste in each stride. As he turns a corner a \n               little man in a white smock emerges from the Funeral Parlor.\n\n               This is Carl Santos, Amity's part-time coroner. Santos looks \n               both ways before crossing Colonial Drive.\n\n               Brody passes Keisel's Bicycle Rental, navigating an awkward \n               course through an odd assortment of Schwinns that line the \n               sidewalk in front of a demolished white picket fence. Keisel \n               intercepts Brody on the run.\n\n<b>                                     KEISEL\n</b>                              (he stares at Brody's \n                              face)\n                         Wait-a-minute.\n                              (stares some more)\n                         Glasses, right?\n\n               Brody nods yes, and starts to move away, but Keisel holds on \n               to him.\n\n<b>                                     KEISEL\n</b>                         Look at those fences! Little guys \n                         about eight to ten years old. And \n                         look at this!\n\n               He holds up bicycle. The bicycle's spokes are bent and broken \n               from some sort of blows.\n\n<b>                                     KEISEL\n</b>                         They did that with their bare hands.\n\n<b>                                     BRODY\n</b>                         Call me later in the day, okay, Harry?\n\n<b>               ANGLE - AMITY GAZETTE NEWSPAPER OFFICE - PORCH\n</b>\n               Santos emerges with Ben Meadows, the stylish, late-thirties \n               editor of the Amity Gazette. Together they cut a beeline for \n               the other side of the street.\n\n<b>               ANGLE - AMITY STREET\n</b>\n               Past taverns and chowder shacks, past bleacher construction \n               and July Fourth posters, Brody enters Hardware and Sporting \n               Goods... so overstocked that beach umbrellas, aluminum deck \n               chairs, and rainbow beach towels splash a surplus of color \n               from the display window to the sidewalk.\n\n<b>               INT. HARDWARE STORE \u0096 DAY\n</b>\n               The store proprietor is busy at work on an inventory list \n               with a mainland delivery man.\n\n<b>                                     LYNWOOD\n</b>                         Stuff's no good to me in August when \n                         the Pilgrims come in June...\n                              (to Brody)\n                         Go on and help yourself to whatever \n                         you need, Chief. Can you work the \n                         register?\n\n<b>               EXT. HARDWARE STORE AND STREET - DAY\n</b>\n               Brody emerges with enough poster-board, wooden stakes, nails, \n               paint, and brushes to close every beach on the island. He \n               starts back the way he came when Hendricks shoots up the \n               street in the patrol jeep. He stops fast enough to call \n               attention, leans out the window.\n\n<b>                                     HENDRICKS\n</b>                         Polly told me to tell you there's a \n                         scout troop in Avril Bay doing the \n                         mile swim for their Merit Badges. I \n                         couldn't call them in, there's no \n                         phone out there.\n\n<b>                                     BRODY\n</b>                              (hands him the sign \n                              material)\n                         Get out of there \u0096 take these back \n                         to the office and make up some 'Beach \n                         Closed' signs, and let Polly do the \n                         printing.\n\n<b>                                     HENDRICKS\n</b>                         What's the matter with my printing?\n\n<b>               EXT. VAUGHN'S REALTY \u0096 DAY\n</b>\n               Revealing Larry Vaughn, the Mayor of Amity, exchanging \n               anxieties with Ben Meadows and Coroner Santos and two other \n               city Selectmen. They come out in a group, reach the sunlight, \n               and squint down the street as Brody careens around the corner \n               and out of sight. Deputy Hendricks, laden with his arts and \n               crafts, passes them on the street front.\n\n<b>                                     VAUGHN\n</b>                         What have you got there, Lenny?\n\n<b>                                     HENDRICKS\n</b>                         We had a shark attack at South Chop \n                         this morning, Mayor. Fatal. Gotta \n                         batten down the beach.\n\n               Vaughn and group exchange horrified looks, but we get the \n               impression it is not in response to the shark-attack news.\n\n<b>                                     VAUGHN\n</b>                         Who've you told this to, Lenny?\n\n<b>                                     HENDRICKS\n</b>                         I just found out about it -- but \n                         there's a bunch of Boy Scouts in the \n                         water a coupla miles down the coast \n                         from where we found the girl. Avril \n                         Bay, thereabouts. Chief went to dry \n                         them off.\n\n<b>                                     VAUGHN\n</b>                              (to Meadows)\n                         Take my car, okay?\n                              (to Hendricks)\n                         You come with us, Lenny.\n\n<b>                                     HENDRICKS\n</b>                         I've got all these signs here...\n\n<b>                                     VAUGHN\n</b>                         C'mon, it'll give us time to think \n                         about what they're going to say.\n\n               They all crowd into a Cadillac El Dorado with Vaughn Realty \n               signs on the doors.\n\n<b>               EXT. AVRIL BAY - DAY\n</b>\n               A flotilla of twenty exhausted Boy Scouts round a buoy that \n               marks the official course. A rowboat with Scoutmaster using \n               a bullhorn keeps pace, and urges the boys on.\n\n<b>                                     SCOUTMASTER\n</b>                              (bullhorn effect)\n                         Let's go, Robbie. You too, Hofner. \n                         Boyle, keep your head up. Alberts, \n                         keep kicking...\n                              (etc., ad lib)\n\n<b>               EXT. ON THE BEACH AT AVRIL BAY - DAY\n</b>\n               Two older Seascouts look on with stop watches and clipboards, \n               while some Parents shade their eyes from the sun, watching \n               their offspring. Brody pulls up in the Amity Police jeep, \n               and starts toward the people. Behind him, Vaughn's Cadillac \n               pulls up and skids to a stop. In it are Vaughn, Meadows, the \n               Doctor, maybe a Selectman, and Hendricks, with his arms still \n               full of sign material. Vaughn intercepts Brody, the others \n               circle around him, effectively slowing his progress through \n               the sand to the scouts.\n\n<b>                                     VAUGHN\n</b>                         Martin!\n                              (he catches up with \n                              him)\n                         Are you going to shut down the beach \n                         on your own authority?\n\n<b>                                     BRODY\n</b>                         Do I need any more authority?\n\n<b>                                     MEADOWS\n</b>                         Technically, you need the instruction \n                         of a civic ordinance, or a special \n                         meeting of the town selectmen...\n\n<b>                                     VAUGHN\n</b>                              (the good guy)\n                         That's just going by the book. We're \n                         just a little anxious that you're \n                         rushing into something serious here. \n                         This is your first summer.\n\n<b>                                     BRODY\n</b>                         Now tell me something I don't know.\n\n<b>                                     VAUGHN\n</b>                         All I'm saying is that Amity is a \n                         summer town -- we need summer dollars, \n                         and if they can't swim here, they'll \n                         use the beaches at Cape Cod, or Long \n                         Island.\n\n<b>                                     BRODY\n</b>                         So we should set out a smorgasbord?\n\n<b>                                     MEADOWS\n</b>                         We're not even sure what it was.\n\n<b>                                     BRODY\n</b>                         What else could've done that?\n\n<b>                                     VAUGHN\n</b>                              (to Doctor)\n                         Boat propeller?\n\n<b>                                     DOCTOR\n</b>                         I think, possibly... sure. A boating \n                         accident.\n\n<b>                                     VAUGHN\n</b>                         Some weekend tramp accidentally goes \n                         swimming too far, she's a little \n                         drunk, a fishing boat comes along --\n\n<b>                                     MEADOWS\n</b>                         Remember when Fred Ganz went \n                         scalloping in his BVD's? He was going \n                         to swim to New Bedford, he said.\n\n               The men all laugh, ad lib their remembrances of this \n               foolishness.\n\n<b>                                     MEADOWS\n</b>                         ...and Bill Mayhew almost caught him \n                         in his net...?\n\n<b>                                     BRODY\n</b>                              (interrupting the \n                              merriment)\n                         Doctor, you're the one who told me \n                         what it was!\n\n<b>                                     DOCTOR\n</b>                         I was wrong. We'll have to amend the \n                         report.\n\n<b>                                     MEADOWS\n</b>                         We never had that kind of trouble \n                         here.\n\n<b>                                     VAUGHN\n</b>                         I don't think you can appreciate the \n                         gut reaction people have to these \n                         things.\n\n<b>                                     BRODY\n</b>                         I was only reacting to what I was \n                         told.\n\n               Brody looks out to the water where the scouts are rounding \n               another buoy on the home stretch.\n\n<b>                                     VAUGHN\n</b>                              (taking Brody aside)\n                         It's all psychological, anyway. You \n                         yell 'Barracuda' and everyone says \n                         'huh'. You yell 'Shark' and we've \n                         got a panic on our hands. I think we \n                         all agree we don't need a panic this \n                         close to the 4th of July.\n\n               Vaughn indicates the beach where the Scouts are flopping out \n               onto the sand, exhausted, glad to be finished.\n\n<b>                                     BRODY\n</b>                         I can't work in a vacuum. Why don't \n                         you make Hendricks Chief? His family's \n                         been here since the Puritans -- half \n                         this island are his cousins.\n\n<b>                                     VAUGHN\n</b>                         Martin, we hired the best man we \n                         could find.\n\n               All ad lib agreement.\n\n<b>                                     VAUGHN\n</b>                         We need someone who isn't prejudiced \n                         by old feuds or family ties, someone \n                         who can referee things.\n\n<b>                                     MEADOWS\n</b>                         You have our complete support.\n\n<b>                                     VAUGHN\n</b>                         Now then. We've got a vandalism \n                         problem we ought to talk about...\n\n               The others surround Brody as Vaughn leads the way back to \n               the cars, ad libbing their problem with the little karate \n               choppers.\n\n               Hendricks puts the signs back into the trunk of Vaughn's \n               Cadillac. Vaughn waves casually to the Scouts and swimmers \n               who are vigorously toweling off in the background.\n\n<b>               EXT. AMITY STREET - DAY\n</b>\n               In front of Amity's only Music Store, a battered old pick-up \n               truck pulls in to the curb. Quint and his mate cross silently \n               heading into the music store.\n\n<b>               INT. AMITY MUSIC STORE - DAY\n</b>\n               A gently tinkling bell tolls Quint's entrance. Inside the \n               store, a ten-year-old boy is being shown a clarinet. He is \n               playing a mellow low tone, and running \"Ode to Joy.\" Quint \n               looms past him like Neptune rising from the deep, and lets \n               his hand drop on the counter with a slap that sounds like a \n               club on flesh. The Shopkeeper abandons the little boy and \n               meets Quint.\n\n<b>                                     SHOPKEEPER\n</b>                         Hello, Mr. Quint.\n\n<b>                                     QUINT\n</b>                         Four spools of Number 12 piano wire, \n                         Okay? I ordered them.\n\n<b>                                     SHOPKEEPER\n</b>                              (finding them under \n                              the counter)\n                         Yessir, right here. What do those \n                         fish do, eat this stuff?\n\n<b>                                     QUINT\n</b>                         They choke on it.\n\n               Without waiting for it to be wrapped, he picks up the gleaming \n               wire in his gnarled fist, and drops a bill on the counter.\n\n<b>                                     SHOPKEEPER\n</b>                         Bye now.\n\n               No answer from Quint, who stops and sings along with the \n               boy.\n\n               The little kid's music degenerates into a series of awkward \n               squeaks and blurps, as Quint stares at him. Quint continues \n               out the door, threading his way through the people in the \n               street like some great fish. As he gets up into the cab of \n               his pick-up, its door swings open so we can see a crude \n               stylized shark decorating its side. It slams behind him as \n               Quint gets in and drives away.\n\n<b>               EXT. AMITY BEACH - DAY\n</b>\n               A plump jelly-bowl of a woman plunges into the ocean. There's \n               enough there to satisfy the most gluttonous shark. Buoyant, \n               joyful, she splashes away in abandon. From her, we pan off \n               to reveal other cheerful bathers enjoying that last \n               uncluttered weekend before the season starts in earnest.\n\n<b>               ANGLE ON THE WATERLINE\n</b>\n               A Man and his dog are romping at the water's edge. The Man \n               is throwing a stick out into the surf, the dog, a happy \n               retriever, is bounding into the waves after it.\n\n<b>               TWO YOUNG PEOPLE ON THE BEACH\n</b>\n               A Girl and her Boyfriend leave their blanket and run for the \n               water, playing tag, chasing each other, having a wonderful \n               time.\n\n<b>               ANGLE ON BIRTHDAY PARTY ON THE SAND - MARTIN AND ELLEN BRODY\n</b>\n               He is sitting stiffly in a beach chair, scanning the beach \n               with careful, cautious looks, eyeballing everything that's \n               going on.\n\n               Around their particular blanket and umbrella are a number of \n               adults and their kids, the youngsters gathered to celebrate \n               Michael's birthday. Ellen is dishing out ice cream and cake \n               from a cooler chest to the raucous 10-year-olds. Michael's \n               hand is still bandaged.\n\n<b>                                     MAX TAFT\n</b>                              (an adult)\n                         Looks like another big season. Gets \n                         worse every year.\n\n<b>                                     MRS. TAFT\n</b>                         And none of them from the Island. \n                         Just a lot of bother.\n\n               Brody (and we) hear a shrill scream from the water. He \n               stretches to look past the group, to see what's happening \n               out there.\n\n<b>               BRODY'S POINT OF VIEW - THE WATER\n</b>\n               The young lady is disappearing under the water, pulled under \n               the waves by some force. She is shrieking. She pops right up \n               again riding the shoulders of her boyfriend, who pulled her \n               under. She's laughing hysterically. Brody is unamused.\n\n<b>               THE ADULTS\n</b>\n<b>                                     BRODY\n</b>                              (to Taft)\n                         What?\n\n<b>                                     TAFT\n</b>                         Present company excepted, but off-\n                         islanders are a pain in the butt. \n                         Pardon my French.\n\n               Ellen captures Sean, and holds him playfully, an example.\n\n<b>                                     ELLEN\n</b>                         What about this kid? What if he were \n                         born here. That make him an islander?\n\n<b>                                     TAFT\n</b>                         Just 'cause a cat has kittens in an \n                         oven, it don't make them muffins.\n\n<b>                                     SEAN\n</b>                         I'm not a muffin! I'm a boy!\n\n               Brody rumples his hair and sets him off to play.\n\n<b>               ANGLE ON ANOTHER SMALL BOY, PLAYING ALONE\n</b>\n               It's Alex Kintner, and his mother, nearby, reading a novel.\n\n               Alex is towing a funny rubber raft, and headed for the water.\n\n<b>                                     MRS. KINTNER\n</b>                         Alex! Alex Kintner! Where do you \n                         think you're going?\n\n<b>                                     ALEX\n</b>                         Water. Just once more, please?\n\n<b>                                     MRS. KINTNER\n</b>                         Let me see your fingers --\n\n               He holds out his hands.\n\n<b>                                     MRS. KINTNER\n</b>                         They're beginning to prune. 10 minutes \n                         more.\n\n               Alex starts for the ocean. Behind him, Michael and his gang \n               are also heading for the inviting waves. Brody is watching \n               them go, his spine rigid with tension.\n\n<b>               MAN AND HIS DOG\n</b>\n               As Alex and the boys hit the water, we see the man throwing \n               his stick into the waves, his dog swimming strongly after \n               it.\n\n<b>               BRODY'S POINT OF VIEW\n</b>\n               Out beyond the kids and the dog, the Fat Lady is bobbing \n               around, out way too far, isolated from the other swimmers.\n\n<b>               UNDERWATER VIEW - EXT. - DAY\n</b>\n               A fish's-eye view of the bathers: lots of little kicking \n               legs, rafts with tasty arms dangling in the blue, slowing \n               circling, favoring one raft (little Alex's). The Kintner \n               boy's legs and arms are kicking and paddling, producing \n               bizarre underwater vibrations of more than passing interest.  \n               Dog goes by, dog-paddling along.\n\n<b>               ON THE BEACH\n</b>\n               Brody is half-rising, looking out over the water. The Fat \n               Lady is not where he remembered her. He scans the water \n               anxiously.\n\n<b>                                     ELLEN\n</b>                         Do you want the boys to come in? \n                         Honey, if you're worried...\n\n               A Black Object swims across the water. It's the dog, breasting \n               against the surf.\n\n<b>               ANGLE ON THE WATER - BRODY'S POINT OF VIEW\n</b>\n               It's the Fat Lady, floating, relaxing. A black object swims \n               up to her. It's not the dog. It rears up out of the water.\n\n               It's a man in a black bathing cap. They exchange distant \n               pleasantries, he strokes away.\n\n<b>               ANOTHER ANGLE - WATER\n</b>\n               Alex Kintner, paddling around, making boat sounds, tooting, \n               going \"vroom, vroom.\"\n\n<b>               ANGLE ON THE BOY AND GIRL\n</b>\n               They kiss, embrace, kiss again. Strong stuff. They sink \n               beneath the waves, knotted in an embrace.\n\n<b>               ANGLE ON MICHAEL BRODY AND HIS FRIENDS\n</b>\n               He's trying to salvage a soggy piece of birthday cake, holding \n               it above the water, paddling with his other hand. The bandage \n               has come part way loose, and his cut is trailing in the water.\n\n<b>               BRODY AND ELLEN ON THE BEACH\n</b>\n               Ellen is rubbing suntan oil on his back, and he is allowing \n               himself to relax part way. His eyes still nervously scan the \n               beach in a constant surveillance. Mr. Keisel is coming out \n               of the water, toweling off vigorously, exclaiming to himself.\n\n<b>                                     BRODY\n</b>                              (to Keisel)\n                         How's the water?\n\n<b>                                     KEISEL\n</b>                         Too cold. I'm going in again Labor \n                         Day. Hope we get this weather next \n                         weekend.\n\n<b>                                     ELLEN\n</b>                         You're very tight, y'know?\n                              (digs in)\n                         Right there.\n\n<b>                                     BRODY\n</b>                         Ow.\n                              (he sees something)\n                         He's gotta be more careful in the \n                         water...\n\n<b>               ANGLE ON THE GANG PLAYING IN THE WATER\n</b>\n               Michael has just been drenched. He splashes back. A big \n               waterfight ensues, the boys splashing and chopping at the \n               water, shouting battle cries and karate whoops. Alex is \n               paddling around near them, but not involved with them.\n\n<b>               ALONG THE WATERLINE ON THE BEACH\n</b>\n               The Man with the Dog is whistling into the ocean, looking \n               for his dog.\n\n<b>                                     DOG MAN\n</b>                         Buster! Hey, Buster! Here boy!\n                              (whistles)\n                         He continues to ad lib calling his \n                         dog, but there's no answer, no dog \n                         in the water.\n\n<b>               THE WATERFRONT\n</b>\n               A huge splash explodes in the water near the gang, an eruption \n               of foam and spray that stops everyone cold for a moment.  \n               They stop to see who was responsible.\n\n<b>                                     A KID (MATHEW)\n</b>                         Hey, no fair splashing in the eyes!\n\n               Before anyone can answer, another kid (P.J.) renews the \n               battle, whooping a karate cry, and slashing at the water \n               with his hand like a little kung-fu warrior, advancing through \n               the waves.\n\n<b>               CLOSE ON MATHEW, SPLASHING BACK\n</b>\n               He hits the water, which sprays up suspiciously pink. He \n               stares at it, surprised.\n\n<b>               CLOSE ON P.J.\n</b>\n               His hands are dripping deep pink, the red matting his hair, \n               running into his eyes. He looks down. The boys are surrounded \n               with a deep pink slick, their little bodies ringed by a \n               spreading stain of blood.\n\n<b>               ANGLE ON SHORE, A TOURIST AND HIS WIFE\n</b>\n               He's pointing frantically out to sea.\n\n<b>                                     TOURIST\n</b>                         Something in the water. Right there! \n                         Didn't anyone see it?\n\n<b>                                     WOMAN\n</b>                         There's blood in the water.\n\n<b>               ANGLE ON BRODY\n</b>\n               He leaps to his feet, nearly knocking Ellen over, and starts \n               for the water.\n\n<b>                                     ELLEN\n</b>                         What is it...?\n\n               Brody is pelting towards the water. He kicks sand over an \n               annoyed Mrs. Kintner, who looks up, just in time to hear \n               Brody's bellow.\n\n<b>                                     BRODY\n</b>                         Michael! Sean! Out of the water. \n                         Everybody out of the water! Michael! \n                         Get out!\n\n               His urgency communicates itself to the others. Ellen snatches \n               Sean up from where he's been playing in the sand. Other \n               parents are calling their kids, hysteria mounting. People \n               rush into the water, dragging their children and families \n               bodily out of the ocean. The first kids coming out of the \n               surf are frantically trying to wash the sticky blood off \n               their bodies. The sight of the red sends the beach into a \n               full panic.\n\n<b>               CLOSE ON BRODY\n</b>\n               He rushes into the water, up to his ankles, and suddenly \n               stops, unable to move into deeper water. He is urging Michael \n               out, holding his hands out to his son, who is slogging through \n               the surf towards his dad. He stands there immobilized by the \n               water, nervously helping people out of it onto the beach.\n\n<b>               ANGLE ON MICHAEL\n</b>\n               As he emerges from the water, Alex Kintner's raft washes in \n               behind him, ripped in half, the water pink, the foam spreading \n               the stain onto the sand as the wave breaks.\n\n<b>               ANGLE ON MRS. KINTNER\n</b>\n               Her voice rising into panic and hysteria with each unanswered \n               cry.\n\n<b>                                     MRS. KINTNER\n</b>                         Alex! Alex? Alex...!\n\n<b>               EXT - THE COUNTY COURTHOUSE AND COUNTY OFFICES - DAY\n</b>\n               We are looking at the closed double white front doors of the \n               building, through which we can hear a rolling boil of agitated \n               conversation. After a beat, they open to reveal Mrs. Kintner, \n               looking as though she has been visited by the wrath of God; \n               in effect, she has. Her eyes are puffy and swollen from \n               weeping, her clothing is put on and fastened awkwardly, her \n               gait is not normal. As she walks toward us, Quint enters \n               with his back to us, they pass without notice; Mrs. Kintner \n               moving out of sight, Quint leading us through the doors into \n               the town hall.\n\n<b>               INT. COUNTY COURTHOUSE - DAY\n</b>\n               A crowd of angry men and women throng the central hallway, \n               their voices a babble of confusion. Many of them are gathered \n               around a roughly lettered notice that has been posted on the \n               town's official bulletin board. It reads.\n\n<b>               \"A $3000 BOUNTY TO THE MAN OR MEN WHO CATCH AND KILL THE \n</b><b>               SHARK THAT KILLED ALEX M. KINTNER ON SUNDAY, JUNE 29, ON THE \n</b><b>               AMITY TOWN BEACH.\"\n</b>\n               Vaughn and Brody are on the outskirts of the crowd, which \n               includes Meadows, some selectmen, and others.\n\n<b>                                     BRODY\n</b>                         Look, I've got to talk to her. This \n                         isn't a contest we want the whole \n                         country entering.\n\n<b>                                     MEADOWS\n</b>                         I agree. If she's going to advertise, \n                         I wouldn't recommend out-of-town \n                         papers. Amity people could take care \n                         of this.\n\n<b>                                     BRODY\n</b>                         I'm responsible for public safety \n                         around here...\n\n<b>                                     VAUGHN\n</b>                         Then go out tomorrow and make sure \n                         no one gets hurt.\n                              (addressing the crowd)\n                         Everybody, could I have your \n                         attention? Since this affects all of \n                         us, I suggest we move into council \n                         chambers, where there's more room...\n\n               There is a flurry and a bustle as everyone rearranges \n               themselves and makes their way into the Amity Selectmen's \n               Council Chambers.\n\n<b>               INT. COUNCIL CHAMBER - DAY\n</b>\n               The crowd is thronging into the large room. Already in the \n               room is a solitary figure, standing all the way in the rear, \n               watching everyone as they enter. Against the back wall is a \n               large blackboard used for town business during meetings.\n\n<b>                                     VAUGHN\n</b>                         Well, here we all are; anyone have \n                         any special questions?\n\n<b>                                     DENHERDER\n</b>                         Is that $3000 bounty on the shark in \n                         cash or check?\n                              (laughter from all)\n\n<b>                                     VAUGHN\n</b>                         That's private business between you \n                         brave fishermen and Mrs. Kintner.\n                              (to Brody)\n                         -- Chief --\n\n<b>                                     BRODY\n</b>                              (stepping in)\n                         I'd like to tell you what we're doing \n                         so far. These are some of the steps \n                         I've taken as Chief of Police...\n\n<b>                                     MEADOWS\n</b>                              (leading the direction \n                              of the discussion)\n                         What's going on with the beaches, \n                         Chief?\n\n               All react.\n\n<b>                                     BRODY\n</b>                         I'll get to that in a minute. First, \n                         I plan to start our seasonal summer \n                         help early, and to use shark spotters \n                         on beaches open to the sea. I'd like \n                         cooperation from local fishermen, \n                         and I've also contacted the \n                         Oceanographic Institute over on the \n                         mainland.\n\n<b>                                     VAUGHN\n</b>                              (Interrupting -- sotto \n                              voice to Brody)\n                         No need to involve outsiders in our \n                         business, Martin.\n\n<b>                                     WOMAN\n</b>                         Are you going to close the beaches?\n\n<b>                                     BRODY\n</b>                         Larry and I have also decided to \n                         close the beaches for a short time.\n\n               Pandemonium. A collective nerve has been touched.\n\n<b>                                     VAUGHN\n</b>                         Only 24 hours!\n\n<b>                                     BRODY\n</b>                         I didn't agree to that!\n\n<b>                                     MRS. TAFT\n</b>                         That official business could take \n                         all summer!\n\n<b>                                     MR. KEISEL\n</b>                         Maybe it's better to close.\n\n               Two opinions have been expressed, and the crowd takes sides \n               vociferously, ad libbing assent or dissent depending on the \n               point of view held forth.\n\n<b>                     THOSE IN FAVOR\n</b>\n<b>                         MR. WISEMAN\n</b>                 We should make sure \n                 there is no danger.\n\n<b>                         MR. HASSETT\n</b>                 I didn't raise my kids to be some \n                 fish's lunch! \n\n<b>                                                       THOSE OPPOSED\n</b>\n<b>                                                       MRS. TAFT\n</b>                                               The motel is all I own -- \n                                               you pull the plug on this \n                                               town and I go down the \n                                               drain with it.\n\n<b>                                                       MR. POSNER\n</b>                                               Nobody's seen a shark.\n\n<b>                                                       MR. POLK\n</b>                                               We'll lose business, we \n                                               lose taxes, we lose our \n                                               shirts!\n\n<b>               ANGLE ON QUINT, THE MAN IN THE BACK OF THE ROOM\n</b>\n               He has just run his large, coarse fingernails over the \n               blackboard. He is a large, rough man, a professional fisherman \n               marked by daily physical toil, About 45 or 50, it's hard to \n               tell where the scars leave off and the wrinkles begin. There \n               is a bit of the showman in him, as well as a bit of killer-\n               whale.\n\n<b>                                     QUINT\n</b>                              (after taking a deep \n                              breath)\n                         You all know me. You know what I do \n                         for a living. I'll go out and get \n                         this bird for you. He's a bad one \n                         and it's not like goin' down the \n                         pond chasing blue-gills and tommy-\n                         cods. This is a fish that can swallow \n                         a man whole. A little shakin', a \n                         little tenderizing and down ya' go.\n                              (a look to Vaughn)\n                         You gotta get this fellow and get \n                         him quick. If you do, it'll bring a \n                         lot of tourist business just to see \n                         him and you've got your business \n                         back on a paying basis.\n                              (beat)\n                         A shark of that size is no pleasure \n                         and I value my neck at a hell of a \n                         lot more'n 3,000 bucks.\n                              (a deadly look)\n                         I'll find him for three. But I'll \n                         kill him for ten.\n\n               Crowd reaction.\n\n<b>                                     QUINT\n</b>                              (he rises up)\n                         The bastard is costing you more'n \n                         that every day. Do you wanna stay \n                         alive and annee up the ten or play \n                         it cheap and be on welfare next \n                         winter.\n                              (a final moment)\n                         I'm gonna kill this thing... just a \n                         matter of whether I do it now -- or \n                         at the end of summer.\n\n<b>                                     VAUGHN\n</b>                         Thank you very much, Mr. Quint, the \n                         Selectmen will take your offer under \n                         advisement\n\n<b>               INT. BRODY'S STUDY AT HOME - SUNSET\n</b>\n               A riffly blur, color alternating with black and white. The \n               dizziness stops on a book page showing a black and white \n               rendering of eight species of shark. The banner at the top \n               of the page reads: THE KNOWN AND REPUTED MANEATERS.\n\n               The riffling begins again, stops on a grizzly photograph of \n               scar tissue on six former shark victims. Riffling -- stop.\n\n               Photograph of five Ichthyologists posing on wooden stools, \n               framed by the enormous jaws of a prehistoric shark from the \n               family Carcharodon charcharias.\n\n<b>               BRODY\n</b>\n               his reading glasses reflecting a stack of twelve library \n               books, all on the subject of sharks and shark attacks. The \n               door opens and Ellen enters, quietly, in respect for Brody's \n               mood.\n\n<b>                                     ELLEN\n</b>                         Can you stand something to eat?\n\n<b>                                     BRODY\n</b>                         Love a cup of tea. With lemon.\n\n               Ellen walks past Brody to the window and looks out the window \n               which overlooks the south bay. It is the hour of dusk.\n\n<b>                                     ELLEN\n</b>                         Mikey loves his birthday present.\n\n<b>                                     BRODY\n</b>                         Where is he?\n\n<b>                                     ELLEN\n</b>                              (with a slight laugh)\n                         He's sitting in it.\n\n               Brody gets up, concerned, and joins her at the window.\n\n<b>                                     ELLEN\n</b>                         Honey. He has it tied up to the jetty \n                         with a double-knot.\n\n<b>               BRODY'S POINT OF VIEW\n</b>\n               Michael is sitting in the boat, but two of his young school \n               chums are in the water, swimming around it. Brody opens the \n               window and calls down:\n\n<b>                                     BRODY\n</b>                         Son! -- Out of the water now!\n\n<b>                                     MICHAEL\n</b>                         My boat's neat, dad!\n\n<b>                                     BRODY\n</b>                              (turning to Ellen)\n                         I want him out of the ocean.\n\n<b>                                     ELLEN\n</b>                         It's three feet deep, Martin\n\n<b>                                     BRODY\n</b>                              (angry now)\n                         Michael! Come inside!\n\n<b>                                     ELLEN\n</b>                         It's his birthday present, and you \n                         closed the beach, Honey. I told him \n                         not to go in the water after what \n                         happened yesterday. I don't believe \n                         he'll ever do it again.\n\n<b>                                     BRODY\n</b>                         I told him not to go out until he \n                         memorized the handbook and the safety \n                         safety regulations, until he was \n                         sure of himself...\n\n               Ellen's eyes drift down to the open book, which is displaying \n               a reproduction of the famous painting \"The Gulf Stream,\" \n               showing a black fisherman in a small dinghy similar to \n               Michael's being assaulted by the jaws of three man-eating \n               sharks, circling his boat.\n\n<b>                                     ELLEN\n</b>                         You heard your father! Out right \n                         now!\n\n<b>               SUNSET ON THE BEACH\n</b>\n               Hendricks and another deputy are assisting Brody. Silhouettes \n               of townspeople look on like mourners at a funeral.\n\n               In the background some workmen are taking down the shutters \n               from a quaint summer cottage. They pause to watch the \n               declining moments of the day.\n\n               Three Selectmen also stand watching. One of them seems to be \n               whispering bounty news to three youngish men on a nearby \n               dune.\n\n               Sounds: Surf and hammering.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               EXT. OCEAN AND PIER - NIGHT\n</b>\n               Selectman Denherder and his buddy, Charlie, a professional \n               angler, row towards a tumble-down jetty that leads fifty \n               feet out into the black water.\n\n<b>                                     DENHERDER\n</b>                         You wanna call it a night after here?\n\n<b>                                     CHARLIE\n</b>                         It's only two-thirty. What, are you \n                         tired?\n\n<b>                                     DENHERDER\n</b>                         Yeah, Charlie, I got my second wind \n                         three nibbles back.\n\n               Denherder hefts a bloodstained laundry bag from the \n               wheelbarrow, revealing about a hundred feet of coiled dog \n               chain and a large patched inner tube. Charlie takes out a \n               monster hook and together they push the wheelbarrow onto the \n               rickety pier that is only about five feet across.\n\n<b>                                     DENHERDER\n</b>                              (reaching into the \n                              bag)\n                         Leg of lamb this time?\n\n<b>                                     CHARLIE\n</b>                         Screw lamb -- let's shoot the sirloin!\n\n<b>                                     DENHERDER\n</b>                              (a hyena laugh)\n                         We're blowin' half the bounty on \n                         bait --\n\n               The splintered pier sways to and fro as the men reach the \n               end and start to work. Charlie baits the hook with a massive \n               chunk of sirloin while Denherder secures the loose end of \n               chain to a skinny piling. Charlie then fastens the inner \n               tube to the chain five feet from the end of the hook.\n\n<b>                                     DENHERDER\n</b>                         One more after this, then I'm going \n                         home.\n\n<b>                                     CHARLIE\n</b>                         Set?\n\n               Denherder tugs the chain against the piling to prove that it \n               is. Charlie heaves the bait. Splash! The inner tube follows \n               and both men eagerly watch as it floats seaward, the chain \n               playing out from the wheelbarrow.\n\n<b>                                     CHARLIE\n</b>                         Tide's taking it right out.\n\n               Charlie lights his pipe and sits back against a piling. He \n               turns on his transistor radio and loops one end around a \n               fractured board. Denherder paces, bored to death.\n\n<b>                                     DENHERDER\n</b>                         You do this all the time, right, \n                         Charlie?\n\n<b>                                     CHARLIE\n</b>                         Twenty years.\n\n<b>                                     DENHERDER\n</b>                         I can't believe that people pay money \n                         to go fishing. This is really dumb. \n                         This isn't even relaxing... it's \n                         just boring.\n\n<b>               CLOSE - CHAIN IN WHEELBARROW\n</b>\n               Suddenly zipping out, faster and faster, as both men \n               straighten.\n\n               Denherder is goggle-eyed.\n\n<b>                                     DENHERDER\n</b>                         Hey! What's this?\n\n               The chain is coming out so fast that it begins to drag the \n               wheelbarrow to the end of the jetty. A section of chain \n               tangles around the handle and flips the entire machine into \n               the air. Both men watch dumbfounded as the inner tube, racing \n               out to sea in a wake of white water, suddenly dips under.\n\n<b>                                     CHARLIE\n</b>                         Look at him take it!\n\n<b>                                     DENHERDER\n</b>                         Do I set the goddam hook?\n\n<b>                                     CHARLIE\n</b>                         Let him do it! Go-go-go-go-go!\n\n               It is then that the chain whips taut against the narrow \n               pilings.\n\n<b>               CLOSE - PILING\n</b>\n               A lineup of five decrepit 2 x 4 inch pilings SNAP with a \n               resounding CRACK.\n\n<b>               ANGLE - JETTY\n</b>\n               The end of the jetty is yanked loose. Denherder is flipped \n               like a chip over the side and into the cold night water, \n               where he manages to snag hold of a splintered timber.\n\n<b>               DENHERDER'S POINT OF VIEW\n</b>\n               The severed section of jetty, a joined platform of footboards, \n               is being dragged seaward with Charlie sitting dazed on top \n               of it, his lit pipe still going.\n\n<b>                                     DENHERDER\n</b><b>                         CHARLIE! JUMP!\n</b>\n               Charlie rolls into the water, sputters, turns to watch the \n               flotilla of wood draw away.\n\n<b>               CLOSE - CHARLIE\n</b>\n               looking seaward.\n\n<b>               CHARLIE'S POINT OF VIEW\n</b>\n               The end of the jetty makes a 180-degree turn and heads back \n               in his direction.\n\n<b>                                     CHARLIE\n</b>                         Holy Jesus Christ!\n\n               Denherder steps up on the broken-off piling just to be out \n               of the water.\n\n<b>                                     DENHERDER\n</b>                         Get the hell out! Charlie! Swim!\n\n               Charlie, inhaling terror, trying to slog to shore. The jetty \n               is getting closer. Suddenly, an enormous black fin breaks \n               water like a periscope, making course corrections as it comes \n               for Charlie.\n\n               Denherder jumps from piling to piling, almost losing his \n               balance on his way to help Charlie. Charlie has reached the \n               last pylon toward open sea, and his hands clamber for a hold. \n               But --\n\n<b>               INSERT - CHARLIE'S HANDS\n</b>\n               The algae is too slippery, and his fingers keep sliding back.\n\n               That's when the fin behind him seems to reach up to the sky \n               and Charlie manages, with Denherder's desperate help, to \n               make it safely to shore. The remains of the pier float belly-\n               up in the inlet.\n\n<b>               CLOSE ON THE HARBORMASTER OF AMITY - DAY\n</b>\n               He is sitting on a little canvas folding chair, eating a \n               bowl of Cheerios with milk and sugar, watching a panorama of \n               ineptitude and greed unfold before his old seaman's eyes.\n\n               The Amity Pier area is a minor madhouse: out-of-state cars \n               elbow local vehicles for parking space at the foot of the \n               dock, and a parade of bounty-hunting townspeople, islanders, \n               off-islanders, tourist, and others shout and push their way \n               onto the crowded pier, each carrying some bizarre or \n               appropriate tool for the real or imagined capture of an \n               unarmed shark of indeterminate size.\n\n               Rods and reels, drop lines, crossbows, slingshots, harpoons, \n               shotguns, rifles, nets and tridents; every fishing supply \n               store and sporting goods house within a hundred miles has \n               been cannibalized to equip this weird array.\n\n<b>               ANGLE ON BRODY AND HENDRICKS ARRIVING ON THE SCENE\n</b>\n               Not having room to bring their police vehicle anywhere near \n               this mess, they are proceeding on foot into the confusion.\n\n<b>                                     HENDRICKS\n</b>                         ...So then Denherder and Charlie sat \n                         there trying to catch their breath, \n                         and figuring out how to explain to \n                         Charlie's wife what happened to her \n                         freezer full of meat.\n\n<b>                                     BRODY\n</b>                         That wasn't funny.\n\n               Some of the locals greet Hendricks with occasional nods of \n               recognition, or an ad libbed \"Hi, Lenny,\" or \"Hey, Lenny.\"\n\n<b>                                     HENDRICKS\n</b>                         Mrs. Kintner must've put her ad in \n                         Field and Stream.\n\n<b>                                     BRODY\n</b>                         Looks more like the readers of the \n                         National Enquirer.\n\n<b>               ANGLE ON BOAT RENTAL - PIER\n</b>\n               An argument is in progress between and Out-of-Towner and the \n               Boat Rental Man.\n\n<b>                                     OUT-OF-TOWNER\n</b>                         You're charging me double the usual \n                         rent! I didn't come up here all the \n                         way from New Rochelle to be gouged \n                         by some Yankee Cracker!\n\n<b>                                     BOAT RENTAL MAN\n</b>                         Prices go up June First every year. \n                         You want a nice cheap, leaky boat, \n                         you go down to the Hamptons.\n                              (he sees Brody)\n                         Right, Chief?\n\n<b>               ANGLE LOOKING OUT TO SEA\n</b>\n               Making its way through the channel towards the dock is a \n               sleek, expensive runabout with the name \"Fascinatin' Rhythm\" \n               on the stern. It's professionally handled, and rumbles in as \n               it coasts in towards the dock area. Some other boats clear \n               the way for it, zig-zagging in the harbor, causing an annoying \n               chop.\n\n<b>               CLOSE ON BOAT\n</b>\n               Matt Hooper, a bearded, bespectacled young man with an intent \n               look, is maneuvering the vessel peering through his windscreen \n               at the ragtag collection of seafaring loonies all around \n               him.\n\n<b>               BACK TO DOCKSIDE\n</b>\n               Hendricks is mediating the argument between the two men, and \n               we can hear a plaintive \"But Lenny,\" from the local as Brody \n               sees something that makes him move towards the other side of \n               the dock. We see him cross to a little boat built for two or \n               three that is settling low in the water as a seventh man \n               climbs in with his gear.\n\n<b>                                     BRODY\n</b>                         Hey! You know how many men that's \n                         supposed to hold?\n\n<b>                                     MAN IN BOAT (WALTER)\n</b>                         Whatever's safe, right?\n\n<b>                                     BRODY\n</b>                         What you got ain't safe. You take \n                         some guys off or you don't go out.\n\n<b>               BEN GARDNER AND HIS BOAT, FLICKA\n</b>\n               Matt Hooper is gliding into the dockside, and Ben throws him \n               a line to help make fast as he moors. It's a small island of \n               courtesy in an otherwise discourteous mob. Hooper nods \n               politely as he ties his boat up and steps onto the dock.\n\n<b>                                     HOOPER\n</b>                         Hello.\n\n<b>                                     GARDNER\n</b>                         Hello, back.\n\n               He's standing near where Brody is finishing after his \n               encounter with the chummers.\n\n               Brody approaches Ben Gardner.\n\n<b>                                     BRODY\n</b>                         You going out too, Ben?\n\n<b>                                     GARDNER\n</b>                         Might give it a try. That three \n                         thousand bounty beats working for a \n                         living.\n                              (yells to his Mate)\n                         We ready?\n\n               The Mate nods \"Yes\" and starts to prepare to get under way.\n\n               Ben and his Mate move away from the dock, headed towards the \n               channel and the open sea leaving Felix and Pratt to scamper \n               around the dock looking for another ride.\n\n<b>               ANOTHER DOCK AREA, CLOSE BY\n</b>\n               A particularly awkward moment between a small sailboat and a \n               couple of powerboats. The sailboat is trying to hoist sail \n               to make it away from the pier under sail, a real yachtsman's \n               conceit, since Hornblower himself probably couldn't navigate \n               through this mess. Brody, a landlubber for sure, is trying \n               to direct traffic to untangle this new mess.\n\n<b>                                     BRODY\n</b>                         Just back up! No, the other way! Cut \n                         it to your left! Your other left! \n                         The big boat, your front end is out \n                         way too far. Little boat, stay still!\n\n               Amidst all this, we can hear the angry shouts of the entangled \n               crews.\n\n<b>                                     SKIPPER 1 (THE SAILBOAT)\n</b>                         Dammit, a vessel under sail has the \n                         right of way!\n\n<b>                                     SKIPPER 2 (MOTORBOAT)\n</b>                         You schmuck, you ain't under sail, \n                         you're goddam drifting!\n\n<b>                                     HOOPER\n</b>                              (stepping in to help)\n                         Ahoy, sail! You got an oar? Well, \n                         scull it out!\n\n<b>                                     SAILBOAT SKIPPER\n</b>                         Tell that stinkpotter to belay!\n\n<b>                                     MOTORBOAT SKIPPER\n</b>                         Tell that ragsetter I'm going to \n                         poke him in the snoot!\n\n<b>                                     HOOPER\n</b>                         Just cast off in turn and make for \n                         the channel, OK?\n\n<b>                                     BRODY\n</b>                         Thanks.\n\n               Brody starts back towards the shore, Hooper is by his side.\n\n<b>                                     HOOPER\n</b>                         Excuse me, I wonder if you could \n                         tell me...\n\n               Before he can finish, Brody spots something on shore that \n               moves him to shout to his deputy.\n\n<b>                                     HOOPER\n</b>                              (noticing something)\n                         Is that dynamite?\n\n               Brody looks, and stops by a boat that's about to cast off.\n\n               He holds out his hand.\n\n<b>                                     BRODY\n</b>                         If that's dynamite, give it here, or \n                         don't leave port.\n\n<b>                                     MAN\n</b>                         Aw, c'mon, it's just fireworks. Sharks \n                         like fireworks, it attracts them.\n\n<b>                                     BRODY\n</b>                         Hand it over.\n\n               The man passes Brody a cigar box filled with dynamite sticks.\n\n               Brody tucks the dynamite under his arm, and continues down \n               the pier. Hooper is still with him.\n\n               All around them are two distinctly different breeds; the \n               quiet pros, like Ben Gardner, in well-worn, comfortable \n               clothes, with efficient, sensible gear, and the amateur \n               crazies, with all manner of weapons and impractical, silly \n               tourist clothing.\n\n<b>               INT. DOCK SHED - DAY\n</b>\n               Brody is on the phone, talking to his office, trying to get \n               Hendricks' attention. He throws a handful of washers at the \n               window.\n\n<b>                                     HOOPER\n</b>                         There's a fantail launch out there \n                         that won't make it beyond the \n                         breakwater.\n\n<b>                                     BRODY\n</b>                         You're tellin' me. I swear, this \n                         town has gone crazy.\n\n<b>                                     HOOPER\n</b>                         Officer, I wonder if you could tell \n                         me where I could find Chief Brody?\n\n<b>                                     BRODY\n</b>                         Who are you?\n\n<b>                                     HOOPER\n</b>                         Hooper, Matt Hooper. From the \n                         Oceanographic Institute.\n                              (holds out his hand)\n\n<b>               EXTERIOR - OCEAN - DAY\n</b>\n               Ben Gardner's boat is in the lead with Gardner's shouting \n               derisive comments at the crowd headed out from land. The \n               armada is spread out and moving in a ragged circle, fifteen \n               boats in all. One man heaves cherry bombs into the water. A \n               smaller boat going in the opposite direction offers us \n               Barwood, forking spaghetti leftovers into the ocean while \n               his friend pours out a bottle of ketchup.\n\n               A speedboat chugs by, one of the occupants reading \n               instructions aloud from a book entitled \"Sharks - East Coast, \n               Vol. I.\"\n\n               boatload of impoverished scallop fishermen throw a net \n               overboard, full of gaps and split ends. The professionals \n               look professional, but the landlubbers out for the $3000 \n               make it impossible for everybody. Collisions are barely \n               averted.\n\n<b>               THE RUBE GOLDBERG ERROR\n</b>\n               The Out-of-Towner in a small boat is bent over in a life and\n\n               death struggle, his rod in a tight arc. His buddy leaps across \n               to lend a hand.\n\n               Twenty yards away in another boat the same struggle ensues.\n\n               This time it's the overloaded boat with the poor scallop \n               fishermen. Shouts of I'M ON! DIG IN! STRIKE! Then a tangle \n               of tackle springs from the water. They have hooked each other.\n\n               Joy turns to swearing.  Arnold Felix stands up to applaud \n               the mishap, while his buddy Pratt takes careful aim with his \n               Remington 1100 12-gauge and blasts at the tackle as if it \n               were a clay pigeon.  The tangle explodes --\n\n               Both the Out-of-Towners and the Scallop Fisherman falls over \n               backward --\n\n<b>               ANGLE - HARRY'S BOAT\n</b>\n               Three men are aboard, one holding a rod which holds a fast \n               arc. A few yards off stern we see a triangular dorsal fin \n               crossing back and forth, struggling, jerking, the mighty \n               tail threshing. One man is screaming success, the other two \n               slapping the angler on the back.\n\n<b>               CLOSE - PRATT AND FELIX\n</b>\n               They spot it and sour.\n\n<b>                                     PRATT\n</b>                         Well, get over there! He ain't caught \n                         it yet!\n\n               The owner of Pratt's boat throws it forward and Pratt removes \n               a .45 automatic from the holster of his belt. He tests it, \n               firing once in the air. As they near the scene of the \n               struggle, eleven other boats begin converging, until --\n\n<b>               HARRY'S BOAT\n</b>\n               Everyone wants to get into the act. They are attacking the\n\n               threshing beast with all they've got. Pratt uses his \n               automatic, another blasts point blank with a shotgun. There \n               are occasional water ricochets and the bounty hunters duck \n               from time to time as bullets skip by. Finally, the shark \n               stops threshing.\n\n<b>               FELIX AND PRATT\n</b>\n               Their boat has moved close to the shark, closer than Harry's.\n\n<b>                                     PRATT\n</b>                              (exultant)\n                         Hand me that pole! Quick!\n\n               One of his party in the over-filled boat grabs a gaff and \n               leans out to grab the moribund shark. But Harry won't give \n               up the line, still reeling in.\n\n<b>                                     HARRY\n</b>                         Beat it! I hooked him!\n\n<b>                                     PRATT\n</b>                         How's the family, Harry?\n                              (to the man with gaff)\n                         Go on and do it!\n\n<b>                                     MAN WITH GAFF\n</b>                         We split down the middle?\n\n               Pratt nods reluctantly. The man swings, lodges the gaff and \n               hauls the shark up onto the gunwale. A paroxysm of cheers \n               from the surrounding boats. Smoke flares are fired into the \n               air.\n\n<b>                                     HARRY\n</b>                              (a tug-of-war)\n                         Let go my shark!\n\n               It is a ten-foot tiger, and what a mess -- splattered with \n               bullet punctures, gashes, bleeding from several orifices. \n               But it is not dead -- it kicks back to life and threatens to \n               capsize the boat. Pratt panics and fires six times with his \n               .45. The bullets pierce the shark's head, pass through, and \n               split the fiberglass hull through which a flood of water \n               rises. Everybody stands up as the boat slips beneath them.\n\n<b>               INT. MORGUE - DAY\n</b>\n               The Amity Morgue is also the Amity Funeral Home, a Victorian \n               house that normally serves as the community's mortuary. The \n               Coroner, a professional small-town GP, is standing by as \n               Hooper is speaking into a sophisticated cassette recorder \n               with a headpiece that leaves his hands free for measurement \n               with a calibrator or calipers.\n\n<b>                                     BRODY\n</b>                         Let's show Mr. Hooper our accident.\n\n               With a shrug, the Coroner slides open the drawer.\n\n<b>               CLOSE ON HOOPER\n</b>\n               He is looking down as the drawer slides past him, still matter-\n               of-fact, turning on his recorder.\n\n<b>                                     HOOPER\n</b>                         Victim One, identified as Christine \n                         Watkins, female Caucasian...\n\n               The sheet has just been lifted, and Hooper stares down at \n               the lump on the slab. He stops, turns off his recorder as \n               emotions wage war with his senses. Rationality wins, and he \n               turns on the recorder again.\n\n<b>                                     HOOPER\n</b>                         ...height and weight may only be \n                         estimated from partial remains. Torso \n                         severed in mid-thorax, eviscerated \n                         with no major organs remaining. May \n                         I have a drink of water? Right arm \n                         severed above the elbow with massive \n                         tissue loss from upper musculature. \n                         Portions of denuded bone remaining.\n                              (tense, to Brody)\n                         -- did you notify the coast guard?\n\n<b>                                     BRODY\n</b>                         No, it was local jurisdiction.\n\n<b>                                     HOOPER\n</b>                         Left arm, head, shoulders, sternum \n                         and portions of ribcage intact.\n                              (to Brody)\n                         Please don't smoke. With minor post-\n                         mortem lacerations and abrasions. \n                         Bite marks indicate typical non-frenzy \n                         feeding pattern of large squali, \n                         possibly carchaninus lonimanus, or \n                         isurus glaucas. Gross tissue loss \n                         and post-mortem erosion of bite \n                         surfaces prevent detailed analysis; \n                         however, teeth and jaws of the \n                         attacking squali must be considered \n                         above average for these waters.\n                              (to Brody again)\n                         -- Did you go out in a boat and look \n                         around?\n\n<b>                                     BRODY\n</b>                         No, we just checked the beach...\n\n<b>                                     HOOPER\n</b>                              (turns off the recorder)\n                         It wasn't an 'accident,' it wasn't a \n                         boat propeller, or a coral reef, or \n                         Jack the Ripper. It was a shark. It \n                         was a shark.\n\n<b>               EXT. DOCK AREA - DAY\n</b>\n               We open close on ugly, open shark's jaws, still oozing blood \n               and gore. As the shark is hoisted up into the air on a gin-\n               pole hoist dockside, Meadows is seen passing with his \n               secretary and a photographer from the Amity Gazette. A crowd \n               of returning fishermen from the Armada and townspeople are \n               gathering around the fish as it is hoisted tail-up into the \n               classic sports fisherman's trophy shot.\n\n<b>                                     MEADOWS\n</b>                         Ginny, get this out on the state \n                         wire to AP and UPI in Boston and New \n                         York. Have one of them pick it up \n                         for the national and call Dave Axelrod \n                         in New York and tell him this is \n                         from me and he owes me one... let's \n                         get a picture.\n\n               As he and the photographer turn to mob, we see Hooper and \n               Brody arriving from the morgue. Hooper immediately heads \n               towards the shark, while Brody pauses and we see a look of \n               relief and delight cross his features.\n\n<b>                                     HOOPER\n</b>                         Well, if one man can catch a fish in \n                         50 days, then I guess 50 of these \n                         bozos can catch a fish in one day -- \n                         beginner's luck.\n\n<b>                                     BRODY\n</b>                              (crossing to men around \n                              shark)\n                         You did it! Did Ben Gardner catch \n                         this?\n\n               Men ad lib \"No, I caught it...\" \"I hooked him,\" etc.\n\n<b>                                     MEADOWS\n</b>                         Okay, everybody, I want to get a \n                         picture for the paper -- could \n                         everyone clear out of the way?\n\n               He continues to call directions and move people out of the \n               way to set up his shot. Hooper is measuring the shark.\n\n<b>                                     MEADOWS\n</b>                         Could you get out of the shot, young \n                         man?\n\n<b>                                     HOOPER\n</b>                         Who, me? Okay...\n                              (he drifts off)\n\n               The men (Felix, Pratt, et al) get Brody to join them in the \n               shot. The whole town and the Armada fishermen all line up in \n               a classic \"high school\" graduating class shot with the \n               victorious fishermen kneeling in front, and the rest of the \n               Armada and Townspeople arranged behind them. Hendricks hold \n               up the \"Beach Closed\" sign in ironic victory.\n\n<b>               ANGLE SHOWING VAUGHN APPROACHING THE DOCK\n</b>\n               Brody spots the Mayor coming towards the dock, and detaches \n               himself from the group to join him.\n\n<b>                                     BRODY\n</b>                         Larry, if you'd see these clowns \n                         leave, you'd never believe they'd \n                         come back with anything. But they \n                         got him!\n\n<b>                                     VAUGHN\n</b>                         That's good. That's real good. Ben \n                         Meadows getting pictures for the \n                         paper.\n\n<b>                                     BRODY\n</b>                         Sure he is.\n\n<b>               HOOPER AND THE FISHERMEN\n</b>\n               The men who landed the monster are in a tight cluster, \n               debating something with Hooper, who is dwarfed by the big \n               beer bellies and ham-fisted hands all around him. It's \n               probable we don't even see him.\n\n               The Men ad lib \"What kind of shark is this?\" \"It's a shark \n               like in the movies they got sharks.\" \"It's a man-eater, for \n               sure.\" \"I bet it's a record-breaker,\" etc.\n\n<b>                                     HOOPER (O.S.)\n</b>                         It's a tiger shark. Very rare in \n                         these waters, and definitely a \n                         maneater.\n\n               Hooper enters the circle, and picks up where he left off, \n               measuring the shark's teeth. Others watch him. Charlie and \n               Denherder walk over to the shark. Charlie punches it.\n\n<b>               BRODY AND VAUGHN\n</b>\n               They are walking down to the shark together.\n\n<b>                                     VAUGHN\n</b>                         Who's that young man?\n\n<b>                                     BRODY\n</b>                         Matt Hooper, the specialist they \n                         send down from the Oceanographic \n                         Institute.\n\n<b>                                     VAUGHN\n</b>                              (speaking to everyone)\n                         I think we all owe a debt of gratitude \n                         to these men for catching this \n                         monster.\n\n               Brody and Vaughn are by now near the circle of fishermen, \n               who are surrounding Hooper, raising their voices at him.\n\n<b>                                     PRATT\n</b>                         Whadya mean, 'Bite Radius?' What's \n                         that?\n\n<b>                                     GAFFER\n</b>                         Teeth are teeth, right?\n\n<b>                                     HOOPER\n</b>                         I didn't say this wasn't the shark, \n                         I just said I wasn't sure this was \n                         the one...\n\n<b>                                     BRODY\n</b>                         What d'ya mean?\n\n<b>                                     HOOPER\n</b>                         There are hundreds of different kinds \n                         of sharks; makos, blues, hammerheads, \n                         white-tips... any one of them could've \n                         attacked. Look -- shark digestion is \n                         slow. We could open this one up, and \n                         find whatever he's been eating is \n                         still inside.\n\n<b>                                     VAUGHN\n</b>                         That's disgusting! This is the \n                         largest, meanest, most vicious shark \n                         ever landed off Amity Island, and a \n                         known maneater!\n\n<b>                                     HOOPER\n</b>                         Let's just cut him open and see what's \n                         inside...\n\n<b>                                     BRODY\n</b>                         Why not, Larry? We could get a \n                         positive confirmation that way.\n\n<b>                                     VAUGHN\n</b>                         Be reasonable, boys -- this isn't \n                         the time or the place to do some \n                         kind of half-assed autopsy on a fish. \n                         Ben...\n                              (to Meadows)\n                         do you have all the pictures you \n                         need?\n\n<b>                                     MEADOWS\n</b>                         Plenty.\n\n<b>                                     HOOPER\n</b>                         Wait a minute...\n\n               Felix, Pratt and the others ad lib disagreement. \"You're not \n               gonna cut up my trophy,\" etc.\n\n<b>                                     VAUGHN\n</b>                              (seeing something \n                              offstage, with low \n                              intensity)\n                         I am not going to stand here and \n                         watch this fish cut open and see \n                         some kid fall out on the dock. \n                         Besides...\n                              (he indicates off)\n\n               We see Mrs. Kintner approaching, dressed in black.\n\n<b>                                     VAUGHN\n</b>                              (to Brody)\n                         Chief, I'll take responsibility for \n                         this. Boys, cut this ugly sonofabitch \n                         down before he stinks up the whole \n                         island. Harve, tomorrow you and Carl \n                         take him out and dump him right in \n                         the drink.\n\n<b>               MRS. KINTNER JOINS THE GROUP\n</b>\n               She seeks out Brody, and stops in front of him.\n\n<b>                                     MRS. KINTNER\n</b>                         Chief Brody?\n\n               He nods, she slaps him full across the face. There is an \n               embarrassed silence. Some people leave, following a trend \n               that began with the first mention of cutting open the shark.\n\n<b>                                     MRS. KINTNER\n</b>                         My Alex was a beautiful little boy \n                         and you killed him. Did you know \n                         that? You knew there was a shark out \n                         there. You knew a girl got killed \n                         here last week. I just found that \n                         out. But you knew. You knew it was \n                         dangerous, but you let people go \n                         swimming anyway. You knew all those \n                         things, and still my boy is dead now \n                         and there's nothing you can do about \n                         that. My boy is dead. I wanted you \n                         to know that.\n\n               She stops, unable to continue. Her father takes her arm and \n               leads her away. Pratt, Harry and the others trail off after \n               her. During the rest of the scene, the camera tightens in on \n               Brody to the exclusion of the others.\n\n<b>                                     VAUGHN\n</b>                         I'm sorry, Martin. She's in a sick, \n                         terrible state.\n\n<b>                                     HOOPER\n</b>                         Look, maybe this is the wrong time \n                         to pursue this, but I'm not sure...\n\n               Before Hooper can finish, Brody's shoulders slump and he \n               goes slack.\n\n<b>                                     BRODY\n</b>                              (almost to himself)\n                         She's right.\n\n<b>                                     VAUGHN\n</b>                         Let's all get out of here, this place \n                         stinks.\n\n<b>                                     BRODY\n</b>                         I'm going home.\n\n               He turns and leaves abruptly, surrendering the dock to Vaughn \n               and Hooper, who eye each other with mutual dis-admiration.\n\n<b>               INT. BRODY HOUSE - NIGHT - DINING ROOM\n</b>\n               Brody and Ellen, Sean and Michael, have all finished dinner.\n\n               Brody's plate is untouched, a virgin meatloaf. His glass, on \n               the other hand, is well used, with the remnants of a stiff \n               scotch and ice. He is staring across the table at the \n               youngest, Sean, who makes a face at him. He makes a face \n               back.\n\n               They play this game together for a few minutes.\n\n<b>                                     BRODY\n</b>                         C'mere and give Daddy a kiss.\n\n<b>                                     SEAN\n</b>                         Why?\n\n<b>                                     BRODY\n</b>                         Because he needs it.\n\n               Sean gives Daddy the kiss. Brody shoos him and Michael off \n               to bed. Ellen, who is feeling progressively more left out \n               with each passing moment, gets up abruptly and clears a few \n               dishes. Brody is not letting her into his world for the \n               moment, and it shows. There's a knock at the door.\n\n<b>                                     HOOPER (O.S.)\n</b>                         Martin Brody residence?\n\n               Ellen opens the door for him.\n\n<b>                                     HOOPER\n</b>                         Hi. I'm Matt Hooper. If your husband \n                         is here, I'd like to talk to him.\n\n<b>                                     ELLEN\n</b>                         So would I. Come on in.\n\n               Hooper enters. He's carrying a couple of bottles of wine \n               which he picked up in town. He sits down near Brody.\n\n<b>                                     ELLEN\n</b>                         Would you like something? Some coffee?\n\n<b>                                     HOOPER\n</b>                              (seeing Brody's plate)\n                         Is anyone having this...?\n\n               He starts in on it, as soon as someone has indicated \"go \n               ahead.\"\n\n<b>                                     HOOPER\n</b>                         Dynamite!\n                              (to Brody)\n                         How was your day...?\n\n<b>                                     BRODY\n</b>                         Swell.\n\n               They exchange a long look that evolves into a slightly \n               desperate, but shared laughter.\n\n<b>                                     HOOPER\n</b>                              (producing wine)\n                         Here... one red, one white.\n\n               They laugh some more. Ellen is again left out of it.\n\n<b>                                     HOOPER\n</b>                              (boning his fish)\n                         Ummm. Really good.\n\n               Brody begins stripping the foil off the wine, screwing in a \n               corkscrew, etc.\n\n<b>                                     ELLEN\n</b>                         My husband tells me you're in sharks.\n\n<b>                                     HOOPER\n</b>                         I wouldn't put it that way. But I \n                         love sharks.\n\n<b>                                     ELLEN\n</b>                         You love sharks?\n\n<b>                                     HOOPER\n</b>                         I do.\n                              (he tells a story \n                              about his boyhood \n                              and a shark)\n                         But you've still got a problem here, \n                         there's a shark just off the island \n                         somewhere.\n\n<b>                                     BRODY\n</b>                         How come you have to tell them that?\n\n<b>                                     ELLEN\n</b>                         Excuse me, but what are you talking \n                         about? Didn't they catch the shark \n                         this afternoon? It was on the Cape \n                         station news.\n\n<b>                                     HOOPER\n</b>                         They caught a shark, not the shark. \n                         Big difference. I could've proved it \n                         this afternoon, by cutting that one \n                         open and examining his stomach \n                         contents. Also, his bite was too \n                         small.\n\n               Brody has the cork out of the wine. Pop.\n\n<b>                                     HOOPER\n</b>                         I was lucky to find that in town -- \n                         it's an estate bottled vintage year...\n\n               Brody takes the fine wine, and pours it into his drink glass \n               filling the tumbler to the top with ice cubes, diluted scotch, \n               and the wine.\n\n<b>                                     HOOPER\n</b>                              (as Brody pours)\n                         We ought to let it breathe... \n                         Whatever.\n\n<b>                                     BRODY\n</b>                         Let's all have a drink.\n\n               He extends the bottle to Hooper, who politely accepts a token \n               sip. He takes some for himself, and offers some to Ellen.\n\n<b>                                     BRODY\n</b>                         You too, sweetheart...\n\n<b>                                     ELLEN\n</b>                         Thank you.\n\n<b>                                     HOOPER\n</b>                              (toasting)\n                         Here's to your husband, the only \n                         other rational man on the island. \n                         Day after tomorrow, I'll be gone, \n                         and he'll be the only one.\n\n<b>                                     ELLEN\n</b>                         You're leaving?\n\n<b>                                     HOOPER\n</b>                         Going out on the 'Aurora.'\n\n<b>                                     ELLEN\n</b>                         Is that a boat?\n\n<b>                                     HOOPER\n</b>                         Is it! The best-funded research \n                         expedition to ever study the shark... \n                         around the world in 18 months.\n\n<b>                                     ELLEN\n</b>                         Like those Cousteau specials on \n                         television? I think it's for the \n                         kids, but I love them.\n\n<b>                                     HOOPER\n</b>                         Better than Cousteau, or Compagno \n                         with computers, telemetry, Defense \n                         Department funding...\n\n<b>                                     ELLEN\n</b>                         I saw a show with sea otters, and a \n                         big turtle... Mikey loved it. Made \n                         me promise to get him one. Will you \n                         live on the boat?\n\n<b>                                     HOOPER\n</b>                         Yep.\n\n<b>                                     ELLEN\n</b>                         Martin hates boats. Hates the water. \n                         On the ferry to the mainland, he \n                         sits in the car the whole way over. \n                         He's got this childhood thing, there's \n                         a clinical word for it.\n\n<b>                                     BRODY\n</b>                         Drowning. Lemme ask you something. \n                         Is it true most attacks take place \n                         in three feet of water, around 10 \n                         feet from the beach?\n\n<b>                                     HOOPER\n</b>                         Yeah. Like the kid on your beach.\n                         I wish I could've examined that shark \n                         they caught...\n\n<b>                                     BRODY\n</b>                         Something else. Do most attacks go \n                         unreported?\n\n<b>                                     HOOPER\n</b>                         About half of them. A lot of 'missing \n                         swimmers' are really shark victims.\n\n<b>                                     BRODY\n</b>                         There's a kind of a lone shark, \n                         called, uh...\n\n<b>                                     HOOPER\n</b>                         Rogue?\n\n<b>                                     BRODY\n</b>                         Yeah. Rogue. Picks out an area where \n                         there's food and hangs out there as \n                         long as the food supply lasts?\n\n<b>                                     HOOPER\n</b>                         It's called Territoriality. It's a \n                         theory.\n\n<b>                                     BRODY\n</b>                         And before 1900, when people first \n                         starting swimming for recreation, \n                         before public bathing and resorts, \n                         there were very few shark attacks, \n                         cause sharks didn't know what they \n                         were missing?\n\n<b>                                     HOOPER\n</b>                         You could say that.\n\n               Brody digests all this; confirmation of facts he has gleaned \n               in his newly acquired knowledge of the shark species.\n\n               There is a long pause.\n\n<b>                                     BRODY\n</b>                         Why don't we have one more drink, \n                         you and I, and then we go down and \n                         cut open that old shark and see for \n                         sure what's inside him, or not.\n\n<b>                                     ELLEN\n</b>                         Can you do that?\n\n<b>                                     BRODY\n</b>                         I am Chief of Police. I can do \n                         anything I want.\n                              (to Hooper)\n                         You want to come?\n\n<b>                                     HOOPER\n</b>                         I'm flattered you should ask.\n\n               He gets up and they both start out. Ellen watches them go.\n\n<b>               INT. BOAT SHED - NIGHT\n</b>\n               Dark, spooky shed, with shadows of boats and strange \n               silhouettes of boat parts and scaffolding. At one end, the \n               large, symmetrical bulk of the shark's carcass lies on a \n               tarp. A single dark figure is bending over the dead shark.\n\n               The large double doors at one end of the shed squeak open, \n               and the Shadowy Figure moves abruptly away from the shark.\n\n               The new entrants move into the shed. It is Hooper and Brody \n               and they are continuing the conversation begun in the car on \n               the way over.\n\n               As the Shadowy Figure moves silently into a vantage point \n               against one wall, he passes through the light from a window; \n               it is Quint, and we only see him long enough to recognize \n               him as he backs against the wall.\n\n<b>                                     HOOPER\n</b>                         ...And it was Dartmouth Winter \n                         weekend, and she was Homecoming Queen, \n                         and I was her date; then she got \n                         into the fact that her family had \n                         more money than my family, and she \n                         was right -- her great-grandfather \n                         was in mining, and my ancestors were \n                         Yankee shipbuilders. So we broke up \n                         and I went home with some beatnik \n                         from Sarah Lawrence.\n\n<b>                                     BRODY\n</b>                         What stinks so bad?\n\n<b>                                     HOOPER\n</b>                         Our friend, the shark.\n\n               They bend over the shape like 18th century graverobbers.\n\n<b>                                     HOOPER\n</b>                         We always had a summer place on the \n                         water -- Newport, the Vineyard, so I \n                         figured I'd major in something I \n                         knew about. Oceanography, marine \n                         biology. It was that, or design racing \n                         yachts like my older brother. Hmmm. \n                         He we go. Up the old alimentary canal. \n                         Hold the light.\n\n               We hear a slurp and a squish as Hooper produces a big knife \n               and dips into the shark with a major incision.\n\n<b>                                     HOOPER\n</b>                         We open the abdominal cavity and \n                         check the digestive tract. Simple.\n                              (he attends to his \n                              work)\n\n               From his vantage point, Quint watches, unseen by the two \n               men.\n\n               Brody is holding the light, fighting the gag reflex, \n               fascinated by the bizarre ritual.\n\n<b>                                     BRODY\n</b>                         What's that?\n\n<b>                                     HOOPER\n</b>                         Half a flounder. Hmmm... a burlap \n                         bag... a paint can... aha!\n\n<b>                                     BRODY\n</b>                         What? What?!\n\n<b>                                     HOOPER\n</b>                         Just as I thought. He drifted up \n                         here with the Gulf Stream, from \n                         southern waters.\n\n<b>                                     BRODY\n</b>                         How can you tell?\n\n<b>                                     HOOPER\n</b>                              (showing it)\n                         Florida license plate.\n\n<b>                                     BRODY\n</b>                         He ate a car?\n\n<b>                                     HOOPER\n</b>                              (laughs)\n                         No, but Tiger sharks are the garbage \n                         cans of the ocean. They eat anything. \n                         But this one didn't eat any people. \n                         There's nothing here...\n\n               He kicks the remains around below camera.\n\n<b>                                     HOOPER\n</b>                         ...Nothing.\n\n<b>                                     BRODY\n</b>                         What do we do?\n\n<b>                                     HOOPER\n</b>                         If you're looking for a shark, you \n                         don't look on land. You go out and \n                         chum for him.\n\n<b>                                     BRODY\n</b>                         Chum?\n\n<b>                                     HOOPER\n</b>                         Only one sure way to find him -- \n                         offer him a little something to eat. \n                         Chum -- blood, waste meat, fish, \n                         anything. They can sense it miles \n                         away. If he's out there, we might be \n                         able to get a closer look at him.\n                              (checks his watch)\n                         It's a good time, too. They're night \n                         feeders...\n\n<b>               EXT. ABOARD HOOPER'S BOAT - NIGHT (TANK)\n</b>\n               We see Brody, looking sick and nervous, holding on anxiously \n               as the \"Fascinatin' Rhythm\" moves slowly ahead trolling at \n               night. His glasses are already flecked with the white salt \n               of dried seawater. He is wearing a life-preserver.\n\n               Hooper is at the wheel, a chart spread in front of him, his \n               eyes scanning the sea restlessly, checking the dials and \n               gauges in front of him as well as the electronic depth-finding \n               and \"fish-finder\" gear mounted in the cockpit. A green glow \n               shines from the instruments on his face. Two closed-circuit \n               TV cameras mounted below the hull flash their pictures onto \n               monitors in the dash.\n\n               In the aisle between the seats is a large container filled \n               with unpleasant-looking bait; Hooper is long-lining for signs \n               of shark, and chumming.\n\n<b>                                     HOOPER\n</b>                              (indicating distant \n                              flashing beacon)\n                         That's the Cape Light -- we're on \n                         the stretch where he's feeding, if \n                         he's still here.\n\n               Brody, bored, tired, and slightly queasy, is trying to \n               concentrate on anything but the motion of the boat. He stares \n               at the sophisticated electronics displays.\n\n<b>                                     BRODY\n</b>                         What is all this stuff?\n\n<b>                                     HOOPER\n</b>                              (ticking them off)\n                         Depth-finder, fathometer, sonar, \n                         closed-circuit TV -- fore and aft -- \n                         RDF, single side band...\n                              (points to themselves)\n                         And two loose nuts behind the wheel.\n\n<b>                                     BRODY\n</b>                         Can you tell from that if a big man-\n                         eater is around?\n\n<b>                                     HOOPER\n</b>                         Sometimes.\n                              (indicates display)\n                         Look here -- something big, probably \n                         a school of mackerel clumped together. \n                         And staying right with us.\n\n<b>               INSERT - ELECTRONICS SCREEN\n</b>\n               It's blipping and peeping.\n\n<b>               CLOSE ON THE TWO MEN\n</b>\n<b>                                     BRODY\n</b>                         Where'd you get all this?\n\n<b>                                     HOOPER\n</b>                         I Bought it.  Both sets of \n                         grandparents set up trust funds for \n                         me; stocks went up, so I don't have \n                         to touch my principal.\n\n<b>                                     BRODY\n</b>                         You're at the Institute full time? \n                         Or do you have a job?\n\n<b>                                     HOOPER\n</b>                              (a nerve has been \n                              touched)\n                         It is a job. I'm not fooling around \n                         like some amateur. It's my life!\n\n<b>                                     BRODY\n</b>                         We gotta get back soon...\n\n<b>               WIDE ON THE \"FASCINATIN' RHYTHM\" AS IT SWINGS AROUND\n</b>\n               The two men looking very small and vulnerable in the open \n               sea, the low-hanging mist obscuring their visibility in the \n               night.\n\n<b>               CLOSE ON BRODY\n</b>\n               He hears something, his eyes widen. It is the \"bump-thump\" \n               of something scraping the hull.\n\n<b>                                     BRODY\n</b>                         Hey!\n\n               Hooper looks up and cuts the wheel hard, as the same time \n               dropping the engines into neutral, and then reverse. The \n               sudden change throws Brody to his knees.\n\n<b>                                     BRODY\n</b>                         What the hell?\n\n<b>               ANGLE FROM HOOPER'S BOAT: GARDNER'S BOAT \"FLICKA\" AWASH AND \n</b><b>               FLOATING DEAD IN THE SEA\n</b>\n               It's what they've just run into -- flooded to the gunwales, \n               loose debris floating around, a tangle of lines and gear \n               looking like floating garbage in the cockpit. Hooper's light \n               sweeps across it.\n\n<b>                                     BRODY\n</b>                         That's Ben Gardner's boat! It's the \n                         Flicka! Ben? Ben!\n\n               Hooper cuts his engines and drifts in; he scampers out to \n               the bow of his boat and makes a line fast to the Flicka.\n\n<b>               INSIDE THE COCKPIT OF HOOPER'S BOAT\n</b>\n               The electronic display is showing increased activity, but \n               only Brody, who is clinging to a support for dear life, can \n               see the blips and hear the chatter. Hooper is leaning out to \n               look at the Flicka.\n\n<b>               THE TWO BOATS\n</b>\n               Hooper is examining the Flicka, tying a towline to it.\n\n<b>               INSERT HIS POINT OF VIEW\n</b>\n               The light picks its way across the ruined boat. The rail \n               where a cleat once was is broadly scarred down to the raw \n               timber, and the heady cleat has been torn bodily out of the \n               hull, ripped out screws and all.\n\n<b>               HOOPER'S BOAT\n</b>\n               Something he has seen moves Hooper.\n\n<b>                                     BRODY\n</b>                         What happened?\n\n<b>                                     HOOPER\n</b>                         I want to check something. Hold my \n                         feet.\n\n               He sticks his head over the side, into the black water.\n\n<b>                                     BRODY\n</b>                         Don't they have lifejackets or \n                         something? An extra boat?\n\n<b>                                     HOOPER\n</b>                              (surfacing)\n                         They must've hit something.\n\n<b>               INSERT, ELECTRONICS DISPLAY\n</b>\n               Blip, chatter, blip, chatter.\n\n<b>               BRODY AND HOOPER\n</b>\n               Hooper moves to get a better look, the boat rocks in the \n               swell and from his movement, Brody clutches the rail in a \n               death-grip.\n\n               Hooper goes below decks, getting into his wet suit, buckling \n               on a weighted belt, holding a mask and hot flashlight.\n\n<b>                                     HOOPER\n</b>                         He didn't have a dinghy aboard. I'm \n                         going down to take a look at his \n                         hull.\n\n<b>                                     BRODY\n</b>                         Why don't we just tow it in?\n\n<b>                                     HOOPER\n</b>                              (hyperventilating)\n                         We will. There's something I've got \n                         to find out.\n\n<b>                                     BRODY\n</b>                         Be careful, for chrissake.\n\n               Hooper takes a last few breaths, orients himself, takes a \n               long, hard look at the quiet, open ocean, and falls into the \n               sea.\n\n<b>               CLOSE ON BRODY\n</b>\n               He is studying the surface, trying to follow Hooper's \n               movements. Brody is forcing himself to stay at the edge of \n               the boat by sheer willpower and grim determination. Brody is \n               fascinated by the sea like a bird facing a cobra. He is very \n               much alone. He grasps a flashlight or boathook as a fragile \n               defense against the unknown.\n\n<b>               PAST BRODY'S BACK TO THE ELECTRONICS\n</b>\n               Beep, chatter, blip.\n\n<b>               UNDERWATER SEQUENCE - HOOPER\n</b>\n               Hooper descends in a froth of bubbles. Warily he turns a \n               full circle with his hotlight. At first we see nothing out \n               of place about the Flicka except that it is lying so low in \n               the water. But as Hooper travels the bottom looking for \n               damage, he comes across a jagged hole two-thirds of the way \n               forward.\n\n               The hole is about the size of a basketball, and the wood \n               around it has been bashed and splintered. Hooper explores \n               the hole with his hands, then takes the knife from its sheath \n               and begins to dig at something. Whatever it is comes free in \n               his hand. As he studies his find, his light wanders upward, \n               pointing directly into the dark hole. Hooper looks up...\n\n<b>               CLOSE - HOLE\n</b>\n               Ben Gardner's dead face stares out through the hole in the \n               Flicka, eyes and mouth gaping in frozen horror, his skin \n               pinched like a prune.\n\n<b>               CLOSE - HOOPER\n</b>\n               bumps his head in trying to get away, seems to yell through \n               escaping bubbles. We hear the gasping shout as a bubbling \n               roar in the ears. His mask fills with water as he flails for \n               the surface. Miscalculating, he bumps into the hull of his \n               own boat, shocked, dismayed, his system jangling with \n               adrenaline shock, his hands open, and the object he pried \n               loose from the hull drifts down and out, falling into the \n               eternity of the ocean bottom. He finally bursts through the \n               surface.\n\n<b>               END OF UNDERWATER SEQUENCE\n</b>\n<b>               THE BOAT, HOOPER EMERGING FROM THE WATER\n</b>\n               He is gasping for breath, his whole body vibrating with \n               urgency. The salt water in his lungs combines with the \n               adrenaline in his blood to deprive him of speech.\n\n<b>                                     BRODY\n</b>                         You all right?\n\n<b>                                     HOOPER\n</b>                         A White! A Great White, I found a \n                         tooth buried in the hull. He must've \n                         attacked... I knew it... Gardner's \n                         dead in there. I didn't see the \n                         mate...\n\n<b>                                     BRODY\n</b>                         No shark did that to a boat!\n\n               Hooper, despite his shock and surprise, is strangely elated, \n               almost giddy with the wonder of his discovery.\n\n<b>                                     HOOPER\n</b>                         Jesus Christ! A Great White! Who'd \n                         believe it! We're not talking about \n                         a shark, we're talking about a Shark!\n\n               Brody sinks weakly into a chair. Brody huddles in the stern, \n               Hooper kicks the engine in with a roar, and still a-shiver \n               with excitement, turns the boat and its grim tow back to \n               port.\n\n<b>               EXT. ISLAND HIGHWAY - THE BILLBOARD - DAY\n</b>\n               Next to the \"Amity Welcomes You\" billboard is a group of \n               selectmen, Vaughn, Meadows, Hendricks, and another deputy \n               standing by with paint and brushes. Brody's wagon is there, \n               along with a few other cars. Busy late afternoon traffic is \n               starting to pile up as early weekenders and curiosity seekers \n               slow down to see what's happening.\n\n               Behind the billboard, Brody and Hooper have gotten Vaughn to \n               one side. They are making a closely reasoned presentation to \n               him.\n\n<b>                                     BRODY\n</b>                         There is a kind of shark called a \n                         Great White Shark that every expert \n                         in the world agrees is a maneater.\n\n<b>                                     HOOPER\n</b>                         You're situation here suggests that \n                         a Great White has staked out a claim \n                         in the waters around Amity Island, \n                         and that he will continue to feed \n                         here as long as there is food in the \n                         water.\n\n<b>                                     BRODY\n</b>                         There's no limits to where he can \n                         strike, and we've had three attacks \n                         and two deaths in the past few days. \n                         It happened like this before, in \n                         1916, when a Great White killed five \n                         swimmers at Jones Beach, in Long \n                         Island.\n\n<b>                                     HOOPER\n</b>                         A shark's attack is stimulated by \n                         the kind of splashing and activity \n                         that occurs whenever humans go \n                         swimming -- you can't avoid it!\n\n<b>                                     BRODY\n</b>                         A 4th of July beach is like ringing \n                         a dinner bell, for Chrissake!\n\n<b>                                     HOOPER\n</b>                         I just pulled a shark tooth the size \n                         of a shot glass out of the hull of a \n                         wrecked boat out there.\n\n<b>                                     BRODY\n</b>                         We towed Ben Gardner's boat in, Larry; \n                         he was dead and his boat was all \n                         chewed up.\n\n<b>                                     VAUGHN\n</b>                         Is that tooth here? Did anyone see \n                         it?\n\n<b>                         HOOPER\n</b>                 I don't have it.\n\n<b>                                                       BRODY\n</b>                                               He lost it on the way up.\n\n<b>                                     VAUGHN\n</b>                         What kind of a shark did you say it \n                         was?\n\n<b>                                     HOOPER\n</b>                         Carcaradon carcharias. A Great White.\n\n<b>                                     VAUGHN\n</b>                         Well, I'm not going to commit economic \n                         suicide on that flimsy evidence. We \n                         depend on the summer people for our \n                         lives, and if our beaches are closed, \n                         then we're all finished.\n\n<b>                                     BRODY\n</b>                         We have got to close the beaches. We \n                         have got to get someone to kill the \n                         shark, we need non-corrosive mesh \n                         netting, we need scientific support... \n                         It's gonna cost money just to keep \n                         the nuts out and save what we have.\n\n<b>                                     VAUGHN\n</b>                         I don't thing either of you is \n                         familiar with our problems...\n\n<b>                                     HOOPER\n</b>                         I'm familiar with the fact that you \n                         are going to ignore this thing until \n                         it swims up and bites you on the \n                         ass! There are only two ways to solve \n                         this thing: you can kill it, or you \n                         can cut off its food supply...\n\n<b>                                     BRODY\n</b>                         That means closing the beaches.\n\n<b>                                     VAUGHN\n</b>                         Come here, I want to show you \n                         something.\n\n               He leads Brody around to the front of the billboard, on which \n               we see that some pranksters have painted a huge shark fin in \n               the water behind the swimmer, so she looks now like a frantic \n               bather fleeing a pursuing monster.\n\n<b>                                     VAUGHN\n</b>                         Sick vandalism! Brody, that's a \n                         deliberate mutilation of a public \n                         service message! I want those little \n                         paint-happy bastards caught and hung \n                         up by their baby Buster Browns!\n\n<b>                                     HOOPER\n</b>                              (who has followed \n                              them around)\n                         That's it! I'm standing here arguing \n                         with a guy who can't wait to be a \n                         hot lunch. Goodbye.\n\n<b>                                     BRODY\n</b>                         Wait a minute! I need you.\n\n<b>                                     HOOPER\n</b>                         Out there is a Perfect Engine, an \n                         Eating Machine that is a miracle of \n                         evolution -- it swims and eats and \n                         that's all. Look at that! Those \n                         proportions are correct.\n                              (indicates fin)\n                         I know sharks.\n\n<b>                                     VAUGHN\n</b>                         You'd love to prove that. Getting \n                         your name in the National Geographic.\n\n<b>                                     BRODY\n</b>                         Larry, we can re-open the beaches in \n                         August.\n\n<b>                                     VAUGHN\n</b>                         August! Tomorrow is the 4th of July, \n                         and we are going to open for business.  \n                         It's going to be our best summer in \n                         years. If you're so concerned about \n                         the beaches, you two, you do whatever \n                         you have to to keep them safe, but \n                         with you or without you, the beaches \n                         stay open this weekend.\n\n<b>               INT. FERRY BOAT - DAY\n</b>\n               Two cavernous iron doors. Then a crack of vertical light as \n               six burly crewmen muscle them apart. The Amity ferry landing \n               is approaching, people in colorful outfits waiting dockside \n               for the first filled-to-capacity shuttle of the summer season \n               and --\n\n               Bach's Little Fugue is the musical accompaniment to this \n               wholly visual montage of disembarkation. The next two minutes \n               should be treated like a \"short film\" taking into account \n               all of the colors, episodes, faces and behavior of a variety \n               of Americans who colonize Eastern resort communities for the \n               ninety-day season.\n\n               Intercut with this montage is Brody's home, where Ellen, \n               Hooper and Brody are in sweaty, gritty all-out effort to \n               enlist some support. Elements in this montage include:\n\n               A.  A train of cars trundling down the ramp, bumper to bumper.\n\n               B.  Young Beautiful People from Princeton, Yale, NYU, wearing \n               knapsacks, toting luggage, babies riding in papoose rigs, \n               energized children, senior citizens holding hands on the \n               pedestrian ramp, a few wheelchairs.\n\n               C.  Hooper, bent over the phone: \"I know it's a long weekend, \n               could you get me his home phone number?\n\n               D.  Sidewalk vendors hawking \"Shark Killed\" souvenirs, big \n               photo \"Personality Posters\" of the dead tiger shark hung on \n               the dock.\n\n               E.  Brody: \"You're acting senior officer? Where's Chief Petty \n               Officer Feldman? Where's the Coast Guard Executive Officer?\"\n\n               F.  Souvenir stands selling Genuine Sharks Teeth from The \n               Amity Killer Shark, Captured This Week.\n\n               G.  Amity Cab Company, small blue Toyotas lined up with their \n               college student drivers like a bomber wing.\n\n               H.  Hooper:  \"Well then, operator, could you try him in the \n               dining room?\"\n\n               I.  Brody: \"All I get is a recording. Is there some other \n               number I could try...?\"\n\n               J.  Station wagons with pale winter faces pressed anxiously \n               to the window. Cadillacs with Rear Admirals at the helm, \n               their wives with blue hair remembering the way from years \n               before.\n\n               K.  Hooper: \"When did he check out? Did he leave another \n               phone number?\"\n\n               L.  Brody: \"How can I reach him in Chambers if he's not in \n               Chambers?\"\n\n               M.  Little Karate Hands breaking picket fences.\n\n               N.  Some local delinquents about 10 or 12 years old, towing \n               behind their bicycles a little dead sand shark with signs: \n               \"Amity Monster Shark.\" \"Killed Here.\" 5 Cents a Hit.\" Etc.\n\n               Then six blonde and tanned Coney Island meatballs descend \n               the ramp. They all wear Men's Club Lifeguard patches and \n               matching collegiate windbreakers. They scour the landing, \n               looking for someone to save.\n\n               The boat is empty. Everybody heading inland, anticipating \n               the best Fourth of July ever. Already there is debris on the \n               docks and the cleaning crew works away at it.\n\n<b>               INSIDE THE FERRY\n</b>\n               As Bach's Little Fugue ends, the six burly crewmen lean their \n               combined weight against the Cathedral doors, closing out the \n               light and locking in the trade. The doors latch shut with a \n               resounding clang!\n\n<b>               ANGLE ON BRODY, NERVOUSLY WATCHING THE BEACH\n</b>\n               He is studying everything, trying to make sure he has it \n               covered as well as possible. He almost doesn't hear the \n               approaching roar of a small helicopter until it settles down \n               behind him, and a Flying Officer gets out, starched, pressed \n               fatigues, a flawless fatigue baseball cap, and slick dark \n               aviator's sunglasses. The Steve Canyon of Amity. He presents \n               Brody with a clipboard.\n\n<b>                                     OFFICER\n</b>                         Martin Brody?\n                              (Brody nods)\n                         I'll need your signature here... \n                         here... and here.\n\n<b>                                     BRODY\n</b>                         What is this?\n\n<b>                                     OFFICER\n</b>                         Authorization for direct payment of \n                         flight expenses not directly connected \n                         to a normal mission of this command.\n                              (Brody doesn't \n                              understand)\n                         You pay for the gas.\n\n               Brody signs. The Officer shakes his head as Brody makes an \n               error.\n\n<b>                                     BRODY\n</b>                         I signed on the wrong line...\n\n<b>                                     OFFICER\n</b>                         Just erase your signature and initial \n                         your erasure.\n\n               Brody complies, shaking his head. The Officer snaps him a \n               salute, jogs lightly back to his idling copter, buckles in, \n               and gives Brody a \"thumbs up\" as he lifts off in a flurry of \n               sand and ice-cream wrappers.\n\n<b>               EXT. BEACH PARKING LOT - EARLY MORNING\n</b>\n               And this is it -- the Dawn Patrol, the only forces that the \n               frantic phone calling produced. Hendricks, and the regular \n               summer extra deputies. The lifeguards. Half a dozen state \n               troopers. Some deputies from neighboring towns, and a Coast \n               Guard ensign with a handful of regulars in work dungarees.\n\n               Some of Hooper's friends from the institute.\n\n               Brody and Hooper, badly in need of sleep, are watching the \n               crew straggle in. Already the first of the holiday beach-\n               goers are piling out of their cars in a brightly colored \n               cascade of beach balls, umbrellas, blankets, portable bar-b-\n               ques, radios, sun visors, reflectors, rafts, balls, tubes, \n               and newspapers.\n\n               Hooper watches one such group: A Family of Ten getting out \n               of a camper-van. He watches in dismay as the family bumbles \n               onto the beach for a day of fun in the sun.\n\n               Brody addresses his troops, such as they are.\n\n<b>                                     BRODY\n</b>                         I want to thank you guys from local \n                         agencies for cooperating, and I hope \n                         we won't actually be needing your \n                         services. But I'm glad to have you \n                         here.\n\n               The Men ad lib responses: \"Happy to do it,\" \"Any time,\" \n               \"When's lunch?\" \"I hate holidays,\" etc.\n\n<b>                                     ENSIGN\n</b>                         I want to get our lines and repellent \n                         out, so we better shove off.\n\n               He nods to his men, who head for some Boston Whalers (or \n               similar boat with surf-riding capability) and push off into \n               the surf to patrol the swimming areas.\n\n<b>                                     BRODY\n</b>                              (a last caution)\n                         We're all on one channel, so let's \n                         keep radio traffic to a minimum, \n                         okay?\n\n               Everyone kind of nods acknowledgment.\n\n<b>                                     HOOPER\n</b>                         I hope we get some more help.\n\n<b>                                     BRODY\n</b>                         I wish it would rain...\n\n<b>               EXT. BEACH - AMUSEMENT AREA - CLOSE OF SHARK MACHINE\n</b>\n               In a shed near the bandstand, a half-dozen pinball and arcade \n               machines sucking quarters from holiday beach-goers. A \n               mechanical shark traverses the screen, is hit with an electric \n               harpoon and red \"blood\" blossoms from its side, indicating a \n               hit.\n\n               Sounds of electronic gadgetry, people having fun. Meadows is \n               there writing it all up for the paper. A move away from the \n               screen of this particular machine reveals the arcade, the \n               parking lot, and, finally, the beginnings of the panorama of \n               the beach that July 4th has created.\n\n<b>               EXT. SOUTH BEACH - THE FOURTH OF JULY\n</b>\n               four foot surfer's swell curls and crashes on shore, \n               riderless. The broad sandy beach is a mosaic of summer color \n               as one thousand vacationers practice fun in the sun, but not \n               in the water. Hot dog stands and ice cream vendors are \n               everywhere.\n\n<b>               ANGLE - LIFEGUARD STATIONS\n</b>\n               A half-dozen lookout lofts. As many handsome lifeguards with \n               Walkie-Talkies strapped to their trunks and loud-hailers at \n               arm's reach. Bored, two of the hot dogs train their binoculars \n               on some local color.\n\n<b>               ANGLE ON TV MOBILE UNIT\n</b>\n               A TV Mobile Unit Van is setting up: cables snaking to cameras, \n               a camera with a big sports zoom sitting on the platform atop \n               the truck, a spiffy announcer-type in a blazer with his \n               station's call letters on the pocket. Inside the darkened \n               control room, we can see the pale blue squares of monitors \n               in a mosaic against one wall, facing the switcher.\n\n<b>               AT SEA\n</b>\n               Hooper is methodically patrolling in his boat. Tactically \n               flanking a three-hundred-yard apron of black repellent are \n               four small watch-boats. A tiny pleasure boat darts around \n               the repellent line. Farther out, crossing back and forth, \n               are patrol boats. To top it all off, a Coast Guard helicopter \n               hovers and patrols three hundred feet above.\n\n<b>               INT. TELEVISION MOBILE UNIT\n</b>\n               At least eight monitors, reflecting the outputs of three \n               cameras and two tape machines, as well as line, preview, and \n               effects monitors.\n\n               MONITOR: CAMERA 1: Holding on a group of happy citizen-bathers \n               as they unpack their gear, wave to camera, run into the water.\n\n               MONITOR: CAMERA 2: The Repellent Line, set in place by Coast \n               Guardsmen in small boats, setting out floats, dumping \n               repellent into the ocean.\n\n               MONITOR: CAMERA 3: Close on the Bandstand, where Amity's \n               band is playing lilting patriotic airs.\n\n               After we've seen this activity, we can take a look at what's \n               going on: the preparation of the tape segment for the six \n               o'clock news.\n\n<b>                                     TV DIRECTOR\n</b>                         Put 1 on the line. In five. 4. 3. 2. \n                         1. Roll.\n\n               On the \"Tape 1\" and \"Line\" monitors, we see Vaughn being \n               interviewed by the Announcer in the blazer.\n\n<b>                                     ANNOUNCER\n</b>                         ...and with me is the Mayor of Amity, \n                         Lawrence Vaughn. Mr. Vaughn, how \n                         about those rumors?\n\n<b>                                     VAUGHN\n</b>                         How about them indeed. I'm pleased \n                         and happy to repeat the news that we \n                         have, in fact, caught and killed a \n                         large predator that supposedly injured \n                         some bathers here. As you can see, \n                         it's a beautiful day, the beaches \n                         are open, and the folks here are \n                         having a wonderful time. Amity, \n                         y'know, means 'Friendship.'\n\n               MONITOR: CAMERA 1: As Vaughn speaks to us on the monitors, \n               the monitor for Camera 1 pans over to show a Sightseeing Bus \n               pull up in the parking area, and a horde of media vultures \n               spilling out, carrying cameras with long lenses and tripods, \n               telescopes, sunshades and parasols, all the equipment of the \n               curious and none of the equipment of the holiday bather or \n               swimmer.\n\n               TAPE 1 AND LINE MONITORS: Close on the Announcer, Vaughn out \n               of the picture.\n\n<b>                                     ANNOUNCER\n</b>                         Also here today is a Marine Biologist \n                         and Research Fellow from the \n                         Oceanographic Institute, Matthew \n                         Hooper. Mr. Hooper, what've you heard?\n\n<b>                                     HOOPER\n</b>                         What I've heard and what I've seen \n                         are two different things. I believe \n                         there is a large Great White Shark -- \n                         Carcharodon Cacharias - in the waters \n                         off this very beach, that he has \n                         killed and that he will kill again...\n\n               Hooper's voice fades off as someone at the mixer panel dials \n               his mike off, and brings up the Announcer's lavalier.\n\n<b>                                     ANNOUNCER\n</b>                              (moving into center \n                              frame)\n                         And there you have it -- two different \n                         opinions, by men of good will. The \n                         holiday crowd here at Amity seems to \n                         be making up its own mind...\n\n               The camera pans off him to a happy family headed for the \n               beach.\n\n               MONITOR: CAMERA 3: Zooms in on the puffing face of the tuba \n               player.\n\n               MONITOR: CAMERA 2: Brody and the Announcer.\n\n               MONITOR: TAPE 1 and LINE: Back on the Announcer, his lips \n               moving, but his sound turned off. We hear, instead, the sound \n               from Monitor Camera 2, Brody and the same Announcer.\n\n<b>                                     BRODY\n</b>                         I'm sorry, I just don't have the \n                         time.\n\n<b>                                     TV DIRECTOR\n</b>                         Recue the machines. 2, pan off the \n                         Chief and show me some tits and ass. \n                         1, get me some cute kids. 3... see \n                         if you got a shot at the water.\n\n               MONITORS: CAMERAS 1, 2 and 3: The cameras seek out the \n               appropriate activity as the Director calls for it.\n\n<b>                                     ASSISTANT DIRECTOR\n</b>                              (holds up stopwatch)\n                         Mayor, 43 seconds, Biologist 45 \n                         seconds. That's equal time, right?\n\n<b>                                     DIRECTOR\n</b>                         Right.\n                              (he presses \"Talkback\" \n                              button to his \n                              announcer)\n                         Jerry, come on in and look at this.\n                              (to his headset)\n                         Roll 2. In five, 4. 3. 2. 1.\n\n<b>               TAPE 2 - MONITOR:\n</b>\n               Starts showing us the assembled interview segment we've just \n               seen, starting with the Announcer's opening remarks.\n\n<b>                                     ANNOUNCER (V.O. MONITOR)\n</b>                         Amity Island is famed for its clear \n                         air and white sand beaches. But a \n                         cloud appeared...\n\n               His voice is dialed under as the Announcer himself appears \n               in the control room to watch himself on the monitors.\n\n<b>                                     ANNOUNCER (LIVE)\n</b>                         Look at that shine on my nose. It's \n                         a beacon.\n\n<b>                                     DIRECTOR\n</b>                         Close enough for remote.\n\n               As Vaughn begins his spiel again, the other monitors show us \n               the action on the beach.\n\n<b>                                     VAUGHN (V.O.)\n</b>                         ...I'm pleased and happy...\n\n<b>                                     DIRECTOR\n</b>                         Think we ought to stick around?\n\n<b>                                     ANNOUNCER\n</b>                         What else you got?\n\n<b>                                     ASSISTANT DIRECTOR\n</b>                         Teachers' strike downtown.\n\n<b>                                     CAMERAMAN'S VOICE (O.S.)\n</b>                         Christenson, this is Al. Union says \n                         time for Engineering Five.\n\n<b>                                     DIRECTOR\n</b>                         That's five minutes, guys. Coffee.\n\n<b>               ANGLE ON THE BEACH\n</b>\n               Vaughn is in his shirtsleeves, having slipped out of his \n               jacket.\n\n               He mops his brow, and surveys the beachfront. At this moment, \n               there's nobody swimming. He approaches a familiar Selectman, \n               nods hello, and squats beside him on the sand.\n\n<b>                                     VAUGHN\n</b>                         Why don't you get in the water?\n\n<b>                                     SELECTMAN\n</b>                         I don't want to wash off my suntan \n                         lotion. I'll get a burn...\n\n<b>                                     VAUGHN\n</b>                              (some urgency)\n                         Nobody's going in!\n\n               On an adjoining blanket, a spirited Ruth Gordon type is \n               sitting, watching brightly as her manservant, a polished \n               Eric Harrison type, prepares some tea from a thermos.\n\n<b>                                     WOMAN\n</b>                         Is there nobody going in? What a \n                         shame. Arthur, should I be going in?\n\n<b>                                     ARTHUR (THE BUTLER)\n</b>                              (pouring tea)\n                         If you'd like.\n\n               He puts down the tea service, and leads her towards the water.\n\n               At the edge of the sea, she stops, and he walks in.\n\n<b>                                     ARTHUR\n</b>                              (as he enters the \n                              waves)\n                         It's very nice. Not too cold... Quite \n                         refreshing... Very pleasant....\n\n               He ducks his head under for a final look around. His dripping \n               head rises triumphantly from the surf.\n\n<b>                                     ARTHUR\n</b>                         No sharks, m'lady.\n\n               She starts into the water, he takes her parasol, escorting \n               her the rest of the way into the ocean.\n\n<b>                                     WOMAN\n</b>                         This is marvelous! Arthur, I want to \n                         come back to this very spot. Will \n                         you make a note of where we are?\n\n<b>               WIDE - ON THE BEACH\n</b>\n               Encouraged by the sight of the Woman and Arthur, and Vaughn's \n               quiet urgings, people begin to wander into the surf, a few \n               at first, and then a rush, as people plunge in and begin \n               enjoying the pleasures of ocean bathing. The Selectman goes \n               in, his family follows, Vaughn watches it all, beaming.\n\n<b>               BOAT #7\n</b>\n               Hendricks is on the radio while a Coast Guard spotter works \n               the sonar.\n\n<b>                                     HENDRICKS\n</b>                         Anything? Thought I saw a shadow. \n                         Over.\n\n               Pan to the water.\n\n<b>               UNDERWATER\n</b>\n               As before, 400 pairs of enticing, yummy swimmers' legs, \n               kicking like animated hors d'oeuvres.\n\n<b>               INT. HELICOPTER - AERIAL VIEW\n</b>\n               A breathtaking view. The copter spotter looks down with naked \n               eye and binoculars.\n\n<b>                                     COPTER SPOTTER\n</b>                         Nothing from up here, Daisy. Over.\n\n<b>               CLOSE - HENDRICKS\n</b>\n<b>                                     HENDRICKS\n</b>                              (into walkie-talkie)\n                         False alarm. Must be this glare.\n\n<b>               ANGLE - BEACH - CLOSE ON BRODY\n</b>\n               He is walking down the beach, threading his way through the \n               happy hordes. Meadows nods \"hello.\"\n\n<b>                                     VOICES\n</b>                         Who's scared to go in! I was in! Up \n                         to your knees, yeah -- So come with \n                         me -- I'll go again.\n\n<b>                                     MEADOWS\n</b>                         Beautiful day, Chief!\n\n               A group of youngsters playing with Michael Brody's dinghy.\n\n               They are hauling it toward the surf.\n\n<b>                                     BRODY\n</b>                         Hey Mikey -- !\n\n               Michael turns as Brody trots toward him.\n\n<b>                                     BRODY\n</b>                         You're not going to the ocean with \n                         that, are you son?\n\n<b>                                     MICHAEL\n</b>                         I'm all checked out for light surf \n                         and look at it.\n\n<b>                                     BRODY\n</b>                         Do me this favor just once. Use the \n                         ponds.\n\n<b>                                     MICHAEL\n</b>                         Dad, the ponds are for old ladies.\n\n<b>                                     BRODY\n</b>                         Just a favor for your old man.\n\n<b>                                     MICHAEL\n</b>                              (confused)\n                         Sure, Dad.\n\n<b>               TV CREW - NEAR WATER\n</b>\n               TV cameramen are packing up their gear. For them it's a wrap\n\n<b>               REPELLENT LINE - COUNTY POLICEMAN\n</b>\n               Suddenly his Walkie-Talkie fizzes, and the Copter Spotter's \n               voice overloads the speaker.\n\n<b>                                     COPTER SPOTTER\n</b>                         Copter to Daisy! Red Four, Red Four!\n\n<b>               BOAT #7 - HENDRICKS\n</b>\n               Guns are up, heads turning everywhere.\n\n<b>                                     HENDRICKS\n</b>                              (into walkie-talkie)\n                         Where -- ?\n\n<b>                                     COPTER SPOTTER\n</b>                         Went under your -- There!\n\n               The Coast Guard sonar operator spots it and pales. A slick \n               black dorsal fin is slicing a wake toward the swimming area.\n\n<b>                                     SONAR OPERATOR\n</b>                         Jesus Christ -- Shark!\n\n<b>               BEACH - BRODY\n</b>\n               Rigid and choked, he almost breaks the \"send\" button trying \n               to transmit.\n\n<b>                                     BRODY\n</b>                         Everybody out! Out of the water, \n                         please -- leave the water, please --\n\n               A lifeguard in a loft behind him begins blowing on his \n               whistle.\n\n<b>               CLOSE - BRODY\n</b>\n               shouting hysterically.\n\n<b>                                     BRODY\n</b>                         No whistles! No whistles!\n\n<b>               THE BEACH\n</b>\n               Dozens of bathers halfway out of the water, turn to see. \n               More whistles, and they start toward shore. We hear panicky \n               voices ad-libbing; \"Shark,\" \"Look Out,\" etc. The loudhailers \n               sounding more urgent now, and a contagious dread seizes one \n               person after another. Entire groups of people begin pulling \n               toward shore, some of them obviously trying to control a \n               growing hysteria in others.\n\n<b>               BOATS #6 AND #7\n</b>\n               are converging, heading toward the repellent line as if \n               tracking an underwater shadow. The fin is beyond the repellent \n               cordons and heading into the crowds.\n\n<b>               HOOPER'S BOAT\n</b>\n               Caught on the other end of the line, he is wheeling in a \n               broad, hot-dogger's circle turn, headed back.\n\n<b>               THE WATER - BATHERS\n</b>\n               People begin screaming. Kids are suddenly separated from \n               their parents. Others seem to forget how to swim. One myopic \n               little girl has her glasses bumped off and she begins to cry \n               in blinded panic. Ellen Brody looks around frantic.\n\n<b>               BOATS #2, #3, #4\n</b>\n               The riflemen in the boats are trying to get a bead, but too \n               many civilians create a hazard. The Coast Guardsmen attempt \n               to sever the repellent cord to gain access to the bathing \n               area and the heaving fin.\n\n<b>               THE WATER - BATHERS\n</b>\n               This is a confirmation of our worst dread -- a full-blown \n               headlong water panic. Screaming vacationers claw their way \n               over the bodies of the less able. Some literally attempt to \n               walk over the bobbing heads and glistening backs of others \n               pulling for dry land.\n\n<b>               CLOSEUPS - PANIC\n</b>\n               Horrified faces. Some are stunned and wandering in slow, \n               tentative circles, while others are helped out by friends.\n\n               Five people try to mount a rubber raft.\n\n               Ugly reminders that each of us is Number One.\n\n               Brody enters shot, yelling into his walkie-talkie, someone \n               charges past him to help an old man out of the water.\n\n<b>               EXT. THE BEACH\n</b>\n               Dragging the helpless from the surf. Tears well in Brody's \n               eyes. The screaming is deafening. The TV unit is hopping up \n               and down in rage and frustration.\n\n<b>                                     TV DIRECTOR\n</b>                         Why did we wrap? Get that! Somebody \n                         get that!\n\n               One thousand survivors pack the beach, standing absolutely \n               still. A numbing cold sets in, and people shiver against \n               each other.\n\n               Muted sobs, whimpering, coughing.\n\n               The six burly lifeguards huddle together like Cub Scouts.\n\n<b>               ANGLE - BATHING AREA\n</b>\n               The monstrous black fin turns a slow circle as two Coast \n               Guardsmen manage to cut their own repellent line. All boats \n               converge on the dynamic fin. Men raise their guns to fire. \n               Others adlib nautical commands in a uniquely calculated \n               fashion.\n\n<b>               CLOSE - FIN\n</b>\n               It slips sideways, revealing for the first time a tiny blue \n               snorkel. Then appears the faces of two youngsters whom we \n               will recall from the coven behind the dune. The fin bobs \n               back, a beaverboard replica attached to a partially submerged \n               surfboard. One youngster looks up and is greeted by:\n\n<b>               YOUNGSTER'S POINT OF VIEW\n</b>\n               Twenty rifles and shotguns pointed directly at him. \n               Surrounding him on three sides. Some of the policemen start \n               to lower their guns -- struck dumb.\n\n<b>               HOOPER IN HIS BOAT\n</b>\n               He throttles back suddenly, subsiding into his own wake, his \n               eyes still restlessly searching.\n\n<b>               CLOSE - YOUNGSTER\n</b>\n               his only defense, he begins to cry -- and feebly raises his \n               hands in unconditional surrender.\n\n<b>               ANGLE - ESTUARY\n</b>\n               The narrow estuary leading into the half-mile is rough today.\n\n               Two children digging in the sand and unaware of the beach \n               panic one hundred yards away look up, and the little girl \n               points.\n\n<b>               BLACK DORSAL FIN\n</b>\n               is cruising through the narrows and toward the busy pond.\n\n<b>               HOOPER IN HIS BOAT AGAIN\n</b>\n               He sees it, and jams his throttle forward. He steers with \n               one hand, fumbling urgently for his walkie-talkie with the \n               other.\n\n<b>               AERIAL VIEW\n</b>\n               The circle of boats around the little pranksters, the crowds \n               huddled on the beach, Hooper's boat suddenly arrowing towards \n               the estuary, leaving a huge boiling wake.\n\n<b>               CLOSE ON VAUGHN\n</b>\n               He catches Hooper's boat out of the corner of his eye. \n               Curious, he follows its progress. It's urgency finally \n               communicates itself to Vaughn, who begins a shambling trot \n               across the dunes towards a rise overlooking the estuary.\n\n<b>               OVERLOOKING THE ESTUARY\n</b>\n               Vaughn gets there just in time to see the disaster. He \n               watches, helpless, trying to shout, out of breath. Stunned.\n\n<b>               ANGLE - POND\n</b>\n               Michael is tacking full-sail in his boat with a friend, Kit.\n\n               Kit is admiring the shark's tooth necklace around his own \n               neck while Michael rubs some water on the scratches left by \n               it.\n\n               The fin, huge, black and real, crosses behind them. They are \n               not yet aware. The fin seems to circle and return. It heads \n               toward Michael's boat when another small dinghy gets in its \n               way -- a weekend novice just finishing a thermos of coffee \n               when he is \"bumped.\" The entire boat is overturned. Michael \n               sees the fin now as it collides with him, the entire bow \n               lifting out of the water and rolling over on the port side.\n\n               Michael and Kit are thrown head first.\n\n               Three heads in the water come up sputtering, the fin between \n               them crossing back. Michael freezes. The fin comes directly \n               at him, growing into the sky, passing him so close he could \n               touch it, but ignoring him as it follows the flailing and \n               panicked weekend novice. Catches him. Michael watches. That \n               all too familiar explosion of water -- a choked off scream -- \n               the head and upper torso of the novice passing Michael swiftly \n               as though being carried off -- a current of blood trailing \n               behind.\n\n<b>                                     THE VICTIM\n</b>                              (passing a horrified \n                              Michael, who half \n                              extends one hand, as \n                              if to help)\n                         It's no good. I'm dead...\n                              (and he is)\n\n               A renewed cry of shark!\n\n<b>               CLOSE - BRODY\n</b>\n               He turns. Oh God! Running through the slogging sand.\n\n<b>               CLOSE - ELLEN\n</b>\n               A sudden turn. She runs.\n\n<b>               CLOSE - HOOPER IN BOAT\n</b>\n               He's got the walkie-talkie to his mouth.\n\n<b>                                     HOOPER\n</b>                         Block the estuary! The estuary!\n\n               Three boats racing to carry out the orders. The black fin re-\n               passing the two children, racing to get out. Hooper reaches \n               the mouth before the others. The fin won't veer off. It smacks \n               into the little vessel, bumping it aside. The fin is left \n               racing into open water. Blood leavings. Hooper leaping over \n               the side, slogging towards Michael.\n\n<b>               WIDE ON WATER\n</b>\n               Copter roars in buzzing the shark, but too late.\n\n<b>               CLOSE - BRODY AND ELLEN\n</b>\n               They are pulling Michael out of the water as Hooper splashes \n               up. Michael is conscious but in shock -- his eyes staring at \n               nothing.\n\n<b>                                     BRODY\n</b>                              (feeling his face)\n                         He's in shock. Get blankets!\n\n               People gather and Brody snatches beach towels out of their \n               hands. They cover Michael and carry him off the beach, feet \n               raised above his head.\n\n<b>               INT. HOSPITAL - DAY\n</b>\n               Michael is wheeled out in the bed. Brody and Ellen are there.\n\n               Sean is sleepy in Brody's arms. Vaughn is waiting in the \n               hall.\n\n<b>                                     NURSE\n</b>                         The doctor said it's okay -- mild \n                         shock. He can come home in the \n                         morning.\n\n<b>                                     ELLEN\n</b>                              (to Michael)\n                         Hey, big guy -- you want anything \n                         from home?\n\n<b>                                     MICHAEL\n</b>                         My cars. And a comic book.\n\n<b>                                     BRODY\n</b>                              (sees Vaughn)\n                         Here --\n                              (gives baby to Ellen)\n                         Take him home.\n\n<b>                                     ELLEN\n</b>                         Home... New York?\n\n<b>                                     BRODY\n</b>                         No. Home here.\n\n               Ellen exits.\n\n<b>                                     BRODY\n</b>                              (crossing to Vaughn)\n                         Got a pen on you?\n\n<b>                                     VAUGHN\n</b>                         Why?\n\n<b>                                     BRODY\n</b>                         There's only one thing you're good \n                         for anymore -- signing a damn voucher. \n                         Here. It's an authorization to employ \n                         a contractor.\n\n<b>                                     VAUGHN\n</b>                         I don't know if I can do that without \n                         a...\n\n<b>                                     BRODY\n</b>                              (interrupting)\n                         I'm going to hire Quint to kill the \n                         fish. I want to see that shark dead.\n\n<b>                                     VAUGHN\n</b>                         Maybe we can save August...\n\n<b>                                     BRODY\n</b>                         Forget it. This summer's had it.\n                         Next summer's had it. You're the \n                         mayor of Shark City. You wanted to \n                         keep the beaches open. What happens \n                         when the town finds out about that?\n\n<b>                                     VAUGHN\n</b>                         I was acting in the town's best \n                         interests...\n\n<b>                                     BRODY\n</b>                         The best interest in this town would \n                         be to see that fish belly-up in the \n                         water with a hole in his head. You \n                         do the right thing. You authorize \n                         me.\n                              (indicates paper)\n                         Right there. Whatever it costs.\n\n<b>                                     VAUGHN\n</b>                         My kids were on that beach...\n\n<b>                                     BRODY\n</b>                         Just sign it, Larry.\n\n               Vaughn signs, and Brody takes the paper and exits.\n\n<b>               QUINT'S HOUSE - DAY\n</b>\n               Brody and Hooper are approaching Quint's house. They enter \n               through the big wooden doors, into another circle of Hell.\n\n               Smoke and steam from two big oil drums sitting over fires \n               fills the air. Quint and his mate, Herschel, are grinding \n               pieces of pilot whale into chum. The whale lies bloody on \n               the floor, its ruined carcass adding to the stench of other \n               sharks being boiled in the drums, their tails suspended in \n               the air.\n\n               Diesel fumes and decay fill the air, and tools, ropes, broken \n               bits of iron and engine parts litter the floor. Wall hangings \n               of rope and floats, and buoys, barrels, tackle and gear all \n               conspire to frame the killing floor.\n\n               Brody and Hooper navigate the obstacle course.\n\n<b>                                     BRODY\n</b>                         This has got to be one big \n                         violation...\n\n<b>                                     HOOPER\n</b>                              (handling some gear)\n                         This is quite a place.\n\n<b>                                     QUINT'S VOICE\n</b>                         Keep your hands off my stuff.\n\n               He emerges from the steam and smoke.\n\n<b>                                     QUINT\n</b>                         Did you bring a check?\n\n<b>                                     BRODY\n</b>                         What?\n\n<b>                                     QUINT\n</b>                         Cash? Or do we do this on a handshake \n                         and a promise?\n\n<b>                                     BRODY\n</b>                         I'm authorized by the township of \n                         Amity to hire you as an independent \n                         contractor. We'll meet your price. \n<b>                         $10,000.\n</b>\n<b>                                     QUINT\n</b>                         And my regular daily rate -- $200, \n                         whether we catch him or not.\n\n<b>                                     BRODY\n</b>                         You got it.\n\n<b>                                     QUINT\n</b>                         And incidental damages, if any...\n\n<b>                                     BRODY\n</b>                         You got it.\n\n<b>                                     QUINT\n</b>                         And you get the Mayor off my back \n                         with this zoning crap. Nobody tells \n                         me how to run my property.\n\n<b>                                     BRODY\n</b>                         You got it.\n\n<b>                                     QUINT\n</b>                         And, uh, a case of apricot brandy \n                         and you buy the lunch.\n\n<b>                                     BRODY\n</b>                         Two cases. And dinner when you land.\n\n<b>                                     QUINT\n</b>                              (pours drink)\n                         Try some of this. I made it myself.\n\n               Brody tastes.\n\n<b>                                     QUINT\n</b>                         Here's to swimmin' with bowlegged \n                         women.\n\n               Herschel interrupts. He's stopped working, and is wiping his \n               hands on a bloody rag.\n\n<b>                                     HERSCHEL\n</b>                         Mr. Quint...\n\n               Quint wheels to face him.\n\n<b>                                     HERSCHEL\n</b>                         I'm not goin'. No sir.\n\n<b>                                     QUINT\n</b>                         You want to get paid, you go.\n\n<b>                                     HERSCHEL\n</b>                         Forget the money. You can't pay me \n                         enough. I ain't crazy. I worked some \n                         big mean fish with you, but I ain't \n                         goin' on this one.\n\n<b>                                     QUINT\n</b>                         This is the last time I hear from \n                         you. I don't want anyone with piss \n                         for blood on my vessel. Put that \n                         blackfish on board, pump the bilges, \n                         and top off the fuel tanks, and finish \n                         up in the morning. Then you're on \n                         the beach.\n\n<b>                                     HOOPER\n</b>                         You're going to need an extra hand...\n\n               Quint turns to see this new voice, and starts walking towards \n               him.\n\n<b>                                     BRODY\n</b>                         This is Matt Hooper...\n\n<b>                                     QUINT\n</b>                         I know who he is...\n\n<b>                                     BRODY\n</b>                         He's from the Oceanographic Institute.\n\n<b>                                     HOOPER\n</b>                         I've been to sea since I was 12. \n                         I've crewed three Trans-pacs --\n\n<b>                                     QUINT\n</b>                         Transplants?\n\n<b>                                     HOOPER\n</b>                         -- and an America's Cup Trials...\n\n<b>                                     QUINT\n</b>                         I'm not talking about day sailing or \n                         pleasure boating. I'm talking about \n                         working for a living. Sharking.\n\n<b>                                     HOOPER\n</b>                         And I'm not talking about hooking \n                         some poor dogfish or sand shark. I'm \n                         talking about a Great White.\n\n<b>                                     QUINT\n</b>                         Are you now. I know about porkers in \n                         the water --\n                              (throws him some rope)\n                         Here. Tie me a sheepshank.\n\n               Hooper ties the knot effortlessly.\n\n<b>                                     HOOPER\n</b>                         I don't need to pass basic seamanship.\n\n<b>                                     QUINT\n</b>                         Let me see your hands...\n\n               He takes Hooper's hands in his own big bloody fists, and \n               feels them as he talks.\n\n<b>                                     QUINT\n</b>                         Ha. City hands. You been counting \n                         money. If you had a $5000 net and \n                         $2000 worth of fish in it, and along \n                         comes Mr. White, and makes it look \n                         like a kiddy scissors class has gone \n                         to work on it and made paper dolls. \n                         If you'd ever worked for a living, \n                         you'd know what that means.\n\n<b>                                     HOOPER\n</b>                         Look, I don't need to hear any of \n                         this working class hero crap. Some \n                         party boat skipper who's killed a \n                         few sharks...\n\n<b>                                     BRODY\n</b>                              (interrupting)\n                         Hey. Knock it off. I don't want to \n                         have to listen to this while we're \n                         out there...\n\n<b>                                     QUINT\n</b>                         What do you mean 'We...?'\n\n<b>                                     BRODY\n</b>                         It's my charter. My party.\n\n<b>                                     QUINT\n</b>                         All right, Commissioner. But when \n                         we're on my ship, I am Master, Mate \n                         and Pilot. And I want him...\n                              (indicates Hooper)\n                         ...along for ballast.\n\n<b>                                     BRODY\n</b>                         You got it.\n\n<b>               EXT. QUINT'S DOCK - MORNING\n</b>\n               The Mate is loading. He hands Quint the items on his check \n               list as Quint takes them aboard.\n\n<b>                                     QUINT\n</b>                         5 lengths of 1/2-inch, 20 number \n                         14's, straight gaff, flying gaffs, \n                         tail rope, eye splice, M-1, 20 clips, \n                         pliers, irons...\n\n               As he talks, we see Hooper coming down to the dock. Wheeling \n               a wagon behind him are two long-haired Research Assistants \n               from the Institute. On the wagon, among other things, is a \n               big shark cage. At dockside, Hooper checks his list, as he \n               signs for his issue.\n\n<b>                                     HOOPER\n</b>                         Powerhead, CO2 darts, hypo, regulator, \n                         tanks, depth gauge, camera, extra \n                         magazines, cage...\n\n<b>               CLOSE - ON HOOPER AND RESEARCH ASSISTANT\n</b>\n<b>                                     ASSISTANT\n</b>                         You got everything you asked for?\n\n<b>                                     HOOPER\n</b>                         All of it. And thank Dr. Miro for \n                         me. And tell Borack I'll catch up \n                         with them in New Zealand.\n\n<b>                                     ASSISTANT\n</b>                         This is actually a killing expedition?\n\n<b>                                     HOOPER\n</b>                         An eye for an eye, you know.\n\n<b>                                     QUINT\n</b>                         Hey, Squirt! You want to stow this \n                         gear or you want me to use it for \n                         ballast? It ain't good for much but \n                         bait.\n\n<b>                                     HOOPER\n</b>                              (to Assistant)\n                         I'll see ya. Tell Dorothy hello.\n\n               Hooper sees his gear approaching.\n\n<b>               ANGLE ON DOCK AND ORCA\n</b>\n               Quint sees Hooper approaching with the large cage.\n\n<b>                                     QUINT\n</b>                         Hello, Junior. What are you? Some \n                         kind of half-assed astronaut?\n                              (to himself)\n                         Jesus Christ, when I was a kid, every \n                         little squirt wanted to be a harpooner \n                         or a sword fisherman. What d'ya have \n                         there -- a portable shower?\n\n<b>                                     HOOPER\n</b>                         Anti-Shark cage.\n\n<b>                                     QUINT\n</b>                         Who's inside, you or the shark?\n\n               Hooper indicates \"me.\"\n\n<b>                                     QUINT\n</b>                         You're in the cage?\n                              (Hooper nods)\n                         The cage is in the water?\n                              (Hooper nods)\n                         The shark is in the water too?\n                              (Hooper nods)\n                         You're in the water with the shark.\n\n               Hooper nods. Quint sings \"Spanish Ladies\" half to himself.\n\n<b>                                     HOOPER\n</b>                         Comin' aboard...\n\n<b>               ANGLE ON DOCK, BRODY AND ELLEN APPROACHING\n</b>\n               She's carrying a little plastic shopping bag, he's wearing \n               shiny new foul weather gear, bundled up, sweaty, \n               uncomfortable.\n\n               She gives him as good a hug as she can manage under the \n               circumstances.\n\n<b>                                     ELLEN\n</b>                         Did you take your dramamine?\n                              (Brody nods)\n                         Here.\n\n               She straightens his coat, and gives him a shaving kit to \n               carry aboard with his toiletries. From the deck, Quint \n               whistles derisively.\n\n<b>                                     QUINT\n</b>                         Hurry up, Chief, daylight's a wastin'.\n\n<b>                                     ELLEN\n</b>                         Is that him?\n\n<b>                                     BRODY\n</b>                              (to Ellen)\n                         Colorful, isn't he?\n\n<b>                                     ELLEN\n</b>                         You going to be all right?\n\n<b>                                     BRODY\n</b>                         Nothing to worry about -- I'll survive \n                         this.\n\n<b>                                     ELLEN\n</b>                         I'll see you back soon. There's an \n                         extra pair of glasses in your black \n                         socks, and there's some suntan lotion \n                         and blistex in your kit.\n\n               Brody nods, and holds her hand for a wordless moment.\n\n<b>                                     QUINT (O.S.)\n</b>                              (sings)\n                         'Here is the body of Mary Lee. For \n                         15 years she kept her virginity. Not \n                         a bad record for this vicinity.'\n\n               There is a sputter and roar as the Orca's diesels kick on.\n\n<b>                                     BRODY\n</b>                         Yo-ho-ho and a bottle of rum.\n\n<b>                                     ELLEN\n</b>                              (hugging him)\n                         What'll I tell the kids?\n\n<b>                                     BRODY\n</b>                         Tell 'em I went fishin'!\n\n               They laugh together, and exchange a short, fierce kiss.\n\n<b>                                     QUINT\n</b>                         Cast off the bow line! Now your stern!\n\n               Its diesels chugging, the Orca pulls away from the pier.\n\n               Ellen has already resolutely turned her back on it, and is \n               walking off the dock back onto dry land.\n\n<b>               ABOARD THE ORCA\n</b>\n               Quint has set a course out towards the open sea. He lashes \n               the wheel, and jumps down to address Hooper and Brody, who \n               are standing together in the stern.\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Front-Bow, Back-Stern, Port, \n                         Starboard. Aloft, Below. It's not a \n                         staircase, it's a ladder, it's not a \n                         rope, it's a line, and if you don't \n                         get it right...\n                              (indicates porthole)\n                         I'll throw your ass through that \n                         little round window.\n\n               He laughs at his joke. This is probably something he tells \n               all his charters.\n\n<b>                                     QUINT\n</b>                         Now hear this. You're aboard the \n                         fishing vessel 'Orca,' and I'm her \n                         Captain, Master, Mate, and Owner. \n                         You'll jump when I holler. We're \n                         doin' a job here, and Christ, I ain't \n                         got time to watch you birds get hooks \n                         in your ass and fall overboard. Ship \n                         with me, and you'll do all right. \n                         Cross me, and I'll slap you upside \n                         your heads. Now -- if you boys are \n                         ready -- let's go fishin'.\n\n               He starts moving gear around, preparing chum barrels, setting \n               hooks, Hooper gives him a hand, Brody stays out of the way.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. THE OCEAN - NOON\n</b>\n               It is quiet as the Orca drifts along in the current, a wide \n               chum slick spreading behind it. A couple of flag buoys spread \n               along our perspective show us the miles the boat has gone.\n\n               Quint spots something in the water -- a small blue shark \n               attracted by the chum. He rigs a small pole with a piece of \n               bait, and throws it over the side.\n\n<b>                                     QUINT\n</b>                         Here's something for you...\n\n               The shark takes the bait, Quint brutally and efficiently \n               sets the hook, and reels the shark alongside. He hauls it \n               part way out of the water, and sticks it with a gaff. Hooper \n               and Brody watch.\n\n<b>               INSERT - SHARK WRIGGLING ON HOOK\n</b>\n               Tailrope dropping on him. Gaffed and bleeding, the shark is \n               immobilized by Quint's practiced hands. He takes one of his \n               big knives and poses for a moment beside the struggling fish.\n\n<b>                                     QUINT\n</b>                         These greedy sons-a-bitches will eat \n                         their own guts.\n\n               He slices into the shark's underbelly. We hear the sound of \n               entrails plopping into the water. Brody is almost retching, \n               and Hooper is just displeased.\n\n<b>               ANGLE ON THE WATER\n</b>\n               The gutted shark swimming in circles biting at its own \n               entrails.\n\n<b>               ANOTHER ANGLE\n</b>\n               Fins closing in on the wounded shark.\n\n<b>                                     QUINT\n</b>                         Go ahead, you cannibals. Tell 'em \n                         where you got it!\n\n<b>               SHARK FRENZY\n</b>\n               A boil of water and the flash of fins and teeth as the local \n               sharks erupt in a feeding frenzy, jaws snapping, blood \n               spewing, a sudden display of the fury and blind predatory \n               drive of the fearsome species.\n\n<b>                                     HOOPER\n</b>                         What's that supposed to prove?\n\n<b>                                     QUINT\n</b>                         Just a little appetizer. I want our \n                         porker to know we're serving. I want \n                         to put some iron into that big yap...\n\n<b>               HOOPER AND BRODY REACT AS WE\n</b>\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. THE OCEAN - AFTERNOON\n</b>\n               The Orca is drifting in neutral. The ocean is like gelatin, \n               the sun sucking heat waves from its surface. Brody at the \n               stern, handkerchief on his head to protect from further \n               sunburn, has been handed the slimiest job on a shark hunt:  \n               the ladling out of chum. There are several empty chum barrels. \n               A flag buoy bobs in the wake of the boat, another waits to \n               be tossed over the side. Brody is reeling with nausea. He \n               opens his overnight kit and takes out a handkerchief and \n               some Old Spice after-shave. He pours the after-shave into \n               the cloth, presses it to his nose. Hooper is also in the \n               stern.\n\n<b>                                     QUINT\n</b>                         Keep that chum line going -- we've \n                         got five good miles. Don't break it.\n\n<b>                                     BRODY\n</b>                         Who's driving the boat?\n\n<b>                                     QUINT\n</b>                         Nobody. We're drifting with the \n                         current.\n\n<b>                                     HOOPER\n</b>                              (using the fish finder)\n                         Nothing. Nothing, nothing, nothing.\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         Hell, in the old days we went out \n                         with good charts, good sounding lead, \n                         and a damn good compass. Nowadays, \n                         these kids are afraid to go out \n                         without depth finders, radar, radio, \n                         electric toothbrush, every stupid \n                         thing...\n\n               Quint opens a can of beer and drains it in one long pull, \n               crushing the empty and throwing it over the side. Hooper \n               drains his coffee from a styrofoam cup, and cracks it in his \n               hand with a silly \"plup.\" He stows the pieces in an empty \n               chum barrel.\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Get a fresh barrel.\n\n               Brody goes to unlash a fresh barrel, but can't figure out \n               the knots. He finally tugs on a piece of rope, and it all \n               comes loose... barrel, shark cage, and, most important, \n               Hooper's tanks, clattering and rolling on the deck.\n\n<b>                                     HOOPER\n</b>                              (jumping up)\n                         Watch it! Compressed air -- you screw \n                         around with one of those and Boom! \n                         Careful, huh?\n\n<b>                                     QUINT\n</b>                              (mutters)\n                         Real fine stuff but it won't mean a \n                         thing to Mr. Whitey, of course... he \n                         didn't go to schools in electronics. \n                         He was born with what he does best. \n                         Eat. He's a swimming appetite. 'Course \n                         he might eat this stuff, but then \n                         I've seen him eat a rocking chair, \n                         too.\n                              (to Brody)\n                         Next time, ask me.\n\n<b>                                                              DISSOLVE TO: \n</b>\n<b>               LATER\n</b>\n               The men are in different positions on the boat. Hooper on \n               the flying bridge. Quint in the stern, Brody hanging over \n               the rail, puking.\n\n               Quint takes a wide red strip of whale meat and a gnarled \n               squid from the garbage pail, and searches for a No. 2 hook \n               rig. He holds up a strip of whale.\n\n<b>                                     HOOPER\n</b>                              (eyeing bait)\n                         That's pilot whale, isn't it?\n\n<b>                                     QUINT\n</b>                         It ain't a Big Mac.\n                              (to Brody)\n                         The expert don't approve. What do \n                         you thing? You're closer to the \n                         situation.\n                              (laughs)\n\n               Brody shades his eyes from the white sun as Quint baits up.\n\n<b>                                     BRODY\n</b>                              (croaky)\n                         Why are we way out here, when the \n                         shark's back there?\n\n<b>                                     QUINT\n</b>                              (snapping bait to his \n                              leader)\n                         ...'cause this is where he lives. \n                         You gotta think like they do.\n\n<b>                                     HOOPER\n</b>                              (to himself)\n                         Easy for you -- they got a brain the \n                         size of a radish.\n\n               Quint sits in the fighting chair. He casts off, murmuring as \n               the line feeds out.\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Now if he weren't around, we'd of \n                         hooked something else by now, wouldn't \n                         we? But he scared 'em all away. Big \n                         lonesome son of a bitch...\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               LATER\n</b>\n               Quint at ease in his chair, Brody near him, practicing tying \n               knots. The line starts to move, a few feet at a time; both \n               men watch. Then the line whizzes off the reel. Brody jumps \n               up. Hooper springs to the deck. Quint puts his hand on the \n               drag and addresses the situation softly.\n\n<b>                                     QUINT\n</b>                         -- he'll gulp it down now...\n                              (making gulping noises)\n                         Hooooooo!\n\n               Quint tightens drag and strikes. The line goes whizzing out.\n\n               Brody runs to Quint's side. Hooper springs up to the flying \n               bridge.\n\n<b>                                     BRODY\n</b>                         You got it?\n\n<b>                                     QUINT\n</b>                              (turning with the \n                              pull)\n                         Get behind me, dummy!\n                              (shouts to Hooper)\n                         Reverse her and turn -- he's taking \n                         too much line!\n                              (to Brody)\n                         Wet my reel, quick!\n\n               Brody goes to get water, the boat surges, he staggers. Brody \n               pours water on the screaming reel, nearly unspooled now.\n\n               Hooper is turning the boat around and the line changes \n               direction.\n\n<b>                                     QUINT\n</b>                              (straining, muscles \n                              popping)\n                         Starboard, for Chris'sake --\n\n               Hooper steers it sharply.\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         Hey, you! Farmer! Half-speed there...\n\n<b>                                     HOOPER\n</b>                              (almost to himself)\n                         Aye, Aye SIR. Stand by to repel \n                         boarders. Poop the mainsail. Argh, \n                         Jim Boy.\n\n               Again the line changes direction, down this time.\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         Neutral!\n                              (to himself)\n                         Where the hell is he going?\n\n               Quint reeling in like mad.\n\n<b>                                     QUINT\n</b>                         Oh, this ain't foolin' me --\n                              (rod arcs down with a \n                              surge)\n                         Sure -- try it!\n\n               He ad libs brief instructions to Brody as the line rushes \n               out and there is less tension. Quint is horsing up and down, \n               reeling in.\n\n<b>                                     QUINT\n</b>                         Makin' believe it's easy now.\n\n               The line is almost vertical, and Quint shows a hint of \n               bafflement. He reels in suspiciously.\n\n<b>                                     QUINT\n</b>                         Gettin' ready to run again -- no? \n                         No?\n                              (suspicious)\n                         What's he playin' here?\n                              (reels in furiously, \n                              to Brody)\n                         Put the gloves on!\n                              (to fish)\n                         Let's see who's gonna tease who now!\n\n<b>                                     HOOPER\n</b>                         Let it go, don't waste your time.\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         Down here, Hooper!\n\n               Hooper is rushing down.\n\n<b>                                     HOOPER\n</b>                         I don't know what it is, but it's \n                         not a shark.\n\n<b>                                     QUINT\n</b>                              (bathed in sweat; \n                              hauling, reeling)\n                         Look -- you may be a big Yahoo in \n                         the lab, but out here you're just \n                         supercargo, and you'll do as I say, \n                         or you can take your gear and \n                         backstroke home. Now get down here!\n\n               The leaders show above the water line. Brody is wide-eyed, \n               waiting for that first look.\n\n<b>                                     BRODY\n</b>                         The wire's showing!\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Unbuckle me -- fast!\n                              (to Hooper)\n                         Grab the leader. He ain't normal, \n                         this one... they never --\n\n<b>                                     HOOPER\n</b>                         It's too wild, too erratic. It's a \n                         marlin or a stingray. It's a gamefish.\n\n               Hooper snaps the rope onto the leader and holds on.\n\n<b>                                     QUINT\n</b>                         Watch your hands --\n                              (suddenly to Brody)\n                         Grab onto this!\n\n               Before he realizes what's happening, Brody is clumsily \n               clutching at the big rod, appalled. Quint skips away for a \n               flying gaff. He picks one, turns...\n\n               That's when the leader lashes free, sending Hooper crashing \n               backward in a serious fall, and the rod whips at Brody's \n               forehead, drawing blood. Quint snatches up the rod and reels \n               in.\n\n               The wires have been bitten through.\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         A marlin, or a stingray. Huh. Don't \n                         ever tell me my business again. Get \n                         back up on the bridge.\n\n<b>                                     HOOPER\n</b>                              (stunned)\n                         I'm okay...\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Fasten the pole.\n\n<b>                                     BRODY\n</b>                         What's the point with hooks and Lines? --\n\n<b>                                     QUINT\n</b>                         Don't tell me my business!\n                              (to Hooper, points)\n                         Quarter-mile, that way. Full throttle.\n\n               Hooper shakes off his dizziness and obeys. Brody watches \n               Quint rig up a new leader, hook up the same bait.\n\n<b>                                     BRODY\n</b>                              (nursing forehead, \n                              gesturing at rod and \n                              reel)\n                         How -- if they're gonna keep on \n                         breaking?\n\n<b>                                     QUINT\n</b>                         What I do is trick him to the surface, \n                         got that? Then I can jab him, \n                         understand?\n                              (goes to flybridge, \n                              muttering)\n                         Think I'm gonna haul it in as if \n                         he's a catfish, like everyone else \n                         does?\n\n               Brody goes inside to inspect his forehead.\n\n<b>               ON BRIDGE - HOOPER AND QUINT\n</b>\n<b>                                     QUINT\n</b>                              (suddenly, pointing)\n                         Over there!\n\n<b>                                     HOOPER\n</b>                         What do you see?\n\n<b>                                     QUINT\n</b>                              (still looking)\n                         At least you handle the boat all \n                         right. Stop. Here... Cut the engine.\n\n               Hooper cuts the engines as Quint swings nimbly down. He stands \n               stock still on the main deck, motioning Brody to be silent.\n\n               Then picking up the newly rigged rod, Quint softshoes it \n               over to the chair. About to sit down, he freezes.\n\n<b>               CLOSE - QUINT\n</b>\n               looking hard at something.\n\n<b>               CLOSE - BRODY\n</b>\n               staring, eyes widening.\n\n<b>               CLOSE - HOOPER\n</b>\n               moving in, surprised, interested, fascinated.\n\n<b>               THEIR COMBINED POINT OF VIEW\n</b>\n               We see the shark. First the fin... then the head and upper \n               jaws, ten or twenty yards off the side of the boat. It finally \n               submerges, its tail giving a final slap.\n\n<b>               ANGLE ON QUINT\n</b>\n               He puts his rod away and stares at it. And stares. And stares.\n\n               Hooper is the first to break the silence.\n\n<b>                                     HOOPER\n</b>                         20 feet, if it's an inch...\n\n<b>                                     QUINT\n</b>                         25 feet. And three tons of him there.\n\n               Hooper is nearly beside himself with a strange ecstasy. He \n               leaps toward his gear.\n\n<b>                                     QUINT\n</b>                              (quietly, to Brody)\n                         I never saw one that big.\n\n<b>                                     BRODY\n</b>                         What do we do? Get some help? Radio \n                         in?\n\n               Quint ignores him and moves off into the pilot house, where \n               he swiftly takes out his green case, and opens it to begin \n               to assemble something inside it. Brody is alone on the deck \n               with Hooper.\n\n<b>                                     BRODY\n</b>                         How're we gonna handle this?\n\n               Hooper is contained in his own excitement. He has finally \n               come up with what he was looking for -- an expensive Nikon \n               through which he peers intently at the shark alongside. He \n               is talking half to himself as he fine-tunes the range finder \n               and focus.\n\n               He is squeaking and bubbling in an unsuppressed emotional \n               boil.\n\n<b>                                     HOOPER\n</b>                              (very, very high)\n                         There's a formula! Girth, about 150 \n                         inches, squared, divide by 800 -- \n                         son of a bitch, they are not going \n                         to believe this! -- divide by 2000... \n                         three tons!\n                              (after Quint)\n                         You're right, you old fart! Three \n                         tons!\n                              (ad libs ecstasy)\n\n<b>               CLOSE ON QUINT IN THE PILOT HOUSE\n</b>\n               He is assembling the Greener harpoon gun, deftly screwing on \n               the long wooden stock, the heavy steel barrel, and big shaft \n               with the wicked barbs, the frame all rigged with line. Past \n               him, on the deck, we can still see Hooper. As Quint is working \n               with the gun, the radio suddenly squawks into life.\n\n<b>                                     RADIO VOICE (V.O.)\n</b>                         Amity Point Light Station to Orca. \n                         This is Amity Point Light Station, \n                         to Orca...\n\n               Quint snaps the mouthpiece to his lips.\n\n<b>                                     QUINT\n</b>                         Orca here.\n\n<b>                                     RADIO VOICE (V.O.)\n</b>                         I have Mrs. Martin Brody here...\n\n<b>                                     QUINT\n</b>                         Put her on.\n\n<b>                                     ELLEN'S VOICE\n</b>                         ...push this? Oh. It's working. Hello, \n                         Martin?\n\n<b>                                     QUINT\n</b>                         This is Quint, Missus.\n\n<b>                                     ELLEN'S VOICE\n</b>                         I just wanted to know if you were \n                         all right... the Coast Guard let me \n                         use their radio. Is Chief Brody there?\n\n<b>                                     QUINT\n</b>                         He's busy.\n\n<b>                                     ELLEN'S VOICE\n</b>                         Well... is everything all right?\n\n<b>                                     QUINT\n</b>                         Just fine, Missus. We'll be back \n                         soon. Everything's fine. We haven't \n                         seen anything yet. Orca out.\n\n               He snaps off the radio, and, for good measure, pulls the \n               plug from the power source.\n\n<b>               ANGLE FROM DECK\n</b>\n               The big shark is slicing through the water just below the \n               surface, its fin high, the big gray back glistening, the \n               teeth gleaming.\n\n<b>               ANGLE - INCLUDING FOREDECK\n</b>\n<b>                                     HOOPER\n</b>                              (on deck)\n                         Damn it! I need something in the \n                         foreground to give it some scale. \n                         Martin! Stand here! No, to your left!\n\n               He is positioning Martin frantically, trying to include Brody, \n               the shark, and the Orca in the same frame. Quint finishes \n               with the gun, and as a final gesture, snaps an explosive \n               cartridge into the breech. He empties the box of cartridges \n               onto the table, snatches up a big handful, and drops them \n               into a pocket, and heads out on deck, bound for the bow \n               pulpit.\n\n<b>               ON DECK\n</b>\n               Quint appears with the harpoon gun. He throws one end of the \n               line to Hooper.\n\n<b>                                     QUINT\n</b>                         Here. Rig this to the forward keg up \n                         there.\n\n               He indicates the barrels on the foredeck.\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Get up there and steer her. Follow \n                         my hand, and hold 'er steady. I've \n                         got to get a clean shot at that \n                         porker's head.\n\n               Quint moves up toward the bow, Brody goes up to the flying \n               bridge to take the wheel, Hooper starts for the foredeck, \n               but stops to rummage in his kit, throwing gear around as he \n               desperately hunts for something.\n\n<b>                                     QUINT\n</b>                         Hurry up, rig the line!\n\n<b>               ANGLE ON HOOPER\n</b>\n               He finds what he's looking for. A small, powerful strobe \n               unit, waterproofed, a miniature signal beacon. He triggers \n               it, and it begins to pulse with a light we can see even in \n               the sun.\n\n               Hooper scampers to the foredeck and begins to rig the light \n               to the first barrel, as the shark begins to surface near the \n               bow.\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Come to port. Watch my hand. Steady \n                         now...\n\n               He guides Brody with hand signals. Brody tries urgently to \n               get it right, not to oversteer, to try to hold the big boat \n               with its throbbing diesels on the course that Quint is \n               indicating.\n\n<b>                                     QUINT\n</b>                         The line, man, the line!\n\n               Hooper is rigging like crazy.\n\n<b>               FROM THE FLYING BRIDGE\n</b>\n               Brody steering f.g., Hooper on the foredeck with the barrels, \n               Quint leaning out over the pulpit, the gun at the ready, the \n               shark crossing inexorably in front of them.\n\n<b>               CLOSE ON QUINT\n</b>\n               Agonizing over his shot as the shark approaches, glancing \n               back to see if the line is properly rigged and Hooper is \n               clear of it.\n\n<b>                                     QUINT\n</b>                         Get clear, damn you!\n\n               The shark is in position, Hooper shouts, a moment too late.\n\n<b>                                     HOOPER\n</b>                         Clear!\n\n               Quint fires. The harpoon slams into the shark behind his \n               head, half-way along the back in front of the big dorsal \n               fin.\n\n<b>                                     QUINT\n</b>                         Jesus H. Christ On a Crutch!\n\n<b>               INSERT - COILED ROPE AND BARREL\n</b>\n               The rope snaps out in a blur of violent motion, Hooper jumps \n               back, and the barrel leaps out of its rack, pulled by the \n               line rigged to the harpoon. It bounds forward and into the \n               sea, past Quint, who is already reloading, mounting another \n               steel shaft. In the distance, the barrel bobs and skips \n               violently in the water, dragged by the shark in his merciless \n               moves.\n\n<b>               THE FOREDECK - QUINT\n</b>\n<b>                                     QUINT\n</b>                         Now you've done it, you piss-ant. \n                         Stop and rig a goddam tinker toy to \n                         my gear. Let the bastard fight the \n                         keg for a while. He can't stay down \n                         with that on.\n\n               Hooper, furious with himself, runs for the flying bridge to \n               take the helm from Brody.\n\n<b>               THE FLYING BRIDGE, BRODY AND HOOPER\n</b>\n               Hooper has snatched the wheel, and is ramming the throttle \n               forward as he spins the wheel in a frantic 180 degree turn.\n\n<b>                                     HOOPER\n</b>                              (to Quint)\n                         Rig another keg! I'm bringing her \n                         around!\n\n               His eyes dart about the ocean, looking for the barrel, as he \n               hot-dogs the ship around in a violent expression of his own \n               disgust with himself.\n\n<b>                                     HOOPER\n</b>                              (to himself)\n                         God damn it! We had him!\n                              (to Quint)\n                         I'm coming about!\n\n               He spins the wheel again, trying to make the big boat handle \n               like a formula speedster. The decks tip and the rigging sways \n               under the sudden strain. Brody is caught unaware, and tumbles \n               off his feet, sliding across the deck to fetch up against a \n               wall. the M1 Rifle is close to his hand. He stares at it.\n\n<b>               FROM THE FLYING BRIDGE\n</b>\n               Hooper is anguished, intense, trying to find the shark, \n               spinning the wheel, compounding his error, tipping the boat \n               in rolling turns as he crosses his own wake. Quint has turned \n               his back to the sea, and is in the pulpit looking up at \n               Hooper, staring at him, excluding everything else.\n\n               As Quint folds his arms and stares at Hooper, we realize the \n               sun is going down, and it's getting dark.\n\n<b>                                     BRODY\n</b>                         Why don't we go in? Get another crack \n                         at him tomorrow.\n\n<b>                                     QUINT\n</b>                         We got a barrel on him. We can't \n                         lose him. We stay out here until we \n                         find him.\n\n               Hooper throttles back, and the roar of the diesels subsides \n               and the boat resumes an even keel, slowly circling the ocean.\n\n<b>                                     BRODY\n</b>                         Let's call in -- we can radio and \n                         have a big boat here in an hour...\n\n<b>                                     QUINT\n</b>                              (grim)\n                         You hired me, remember? It's my \n                         $10,000. It's my shark...\n\n<b>               EXT. ORCA - OPEN SEA - NIGHT\n</b>\n               Throttled back to slow ahead, the boat circles the water \n               endlessly, staying over the shark like an avenging angel. \n               Its running lights gleam in the night, and a glow lights the \n               interior of the pilot house. A bright strobe glints on the \n               water winking once like a firefly.\n\n<b>               INT. PILOT HOUSE - NIGHT\n</b>\n               Brody and Hooper at the table, Quint at the wheel, keeping \n               his eye on the light.\n\n<b>                                     QUINT\n</b>                         He's up again.\n\n               He corrects course slightly to keep the barrel buoy in sight.\n\n               Hooper is sitting at the table, morose. Brody is staring at \n               a couple of open cans of beans or beef stew, or some other \n               crappy rations Quint has on board. Dirty spoons stuck in the \n               open cans show us this has not been a formal dinner. Quint \n               fumbles on the chart shelf and produces some of his home \n               brew.\n\n               He takes a pull, and hands it to Hooper, who takes a double.\n\n               Brody touches the fresh abrasion on his forehead, where the \n               fishing rod caught him.\n\n               Quint bends forward and pulls his hair aside to show something \n               near the crown.\n\n<b>                                     QUINT\n</b>                         That's not so bad. Look at this: \n                         ...St. Paddy's Day in Knocko Nolans, \n                         in Boston, where some sunovabitch \n                         winged me upside the head with a \n                         spittoon.\n\n               Brody looks politely. Hooper stirs himself.\n\n<b>                                     HOOPER\n</b>                         Look here.\n                              (extends a forearm)\n                         Steve Kaplan bit me during recess.\n\n               Quint is amused. He presents his own formidable forearm.\n\n<b>                                     QUINT\n</b>                         Wire burn. Trying to stop a backstay \n                         from taking my head off.\n\n<b>                                     HOOPER\n</b>                              (rolling up a sleeve)\n                         Moray Eel. Bit right through a wet \n                         suit.\n\n               Brody is fascinated. Quint and Hooper take a long pull from \n               the bottle.\n\n<b>                                     QUINT\n</b>                         Face and head scars come from amateur \n                         amusements in the bar room. This \n                         love line here...\n                              (he bends an ear \n                              forward)\n                         ...that's from some crazy Frenchie \n                         come after me with a knife. I caught \n                         him with a good right hand right in \n                         the snot locker and laid him amongst \n                         the sweetpeas.\n\n<b>                                     HOOPER\n</b>                         Ever see one like this?\n\n               He hauls up his pants leg, revealing a wicked white scar.\n\n<b>                                     HOOPER\n</b>                         Bull shark scraped me while I was \n                         taking samples...\n\n<b>                                     QUINT\n</b>                         Nothing! A pleasure scar. Look here --\n\n               He starts rolling up his own dirty pants leg.\n\n<b>                                     QUINT\n</b>                         Slammed with a thresher's tail. Look \n                         just like somebody caressed me with \n                         a nutmeg grater...\n\n               Brody is drawn into their boasting comparisons. He secretly \n               checks his own appendix scar, decides not to enter the \n               contest.\n\n<b>                                     HOOPER\n</b>                         I'll drink to your leg.\n\n<b>                                     QUINT\n</b>                         And I'll drink to yours.\n\n               They toast each other. Brody looks around, sees the strobe \n               blink once through the darkened window.\n\n<b>                                     QUINT\n</b>                         Wait a minute, young fella. Look. \n                         Just look. Don't touch...\n\n               He starts lowering his pants to reveal a place on one hip \n               where the tissue is scarred and irregular.\n\n<b>                                     QUINT\n</b>                         ...Mako. Fell out of the tail rope \n                         and onto the deck. You don't get \n                         bitten by one of those bastards but \n                         twice -- your first and your last.\n\n<b>                                     HOOPER\n</b>                              (considerably drunker)\n                         I think I can top that, Mister...\n\n               Hooper is pulling at his shirt, trying to get it off, but \n               it's tangling its sleeves, and won't come undone.\n\n<b>                                     HOOPER\n</b>                         Gimme a hand, here. I got something \n                         to show you --\n\n               Brody lends a hand. The shirt slips part way off.\n\n<b>                                     HOOPER\n</b>                              (indicating his chest)\n                         There. Right there. Mary Ellen Moffit \n                         broke my heart. Let's drink to Mary \n                         Ellen.\n\n               The two men raise their mugs in a toast.\n\n<b>                                     QUINT\n</b>                         And here's to the ladies. And here's \n                         to their sisters; I'd rather one \n                         Miss than a shipload of Misters.\n\n               He drinks, Hooper follows.\n\n<b>                                     QUINT\n</b>                              (shows belly)\n                         Look a' that -- Bayonet Iwo Jima.\n\n<b>                                     BRODY\n</b>                              (aside)\n                         C'mon. Middle appendix --\n\n<b>                                     QUINT\n</b>                              (aside)\n                         I almost had 'im.\n\n               Brody is looking at a small white patch on Quint's other \n               forearm.\n\n<b>                                     BRODY\n</b>                              (pointing)\n                         What's that one, there?\n\n<b>                                     QUINT\n</b>                              (changing)\n                         Tattoo. Had it taken off.\n\n<b>                                     HOOPER\n</b>                         Don't tell me -- 'Death Before \n                         Dishonor.' 'Mother.' 'Semper Fi.' \n                         Uhhh... 'Don't Tread on Me.' C'mon -- \n                         what?\n\n<b>                                     QUINT\n</b>                         'U.S.S Indianapolis.' 1944.\n\n<b>                                     BRODY\n</b>                         What's that, a ship?\n\n<b>                                     HOOPER\n</b>                              (incredulous)\n                         You were on the Indianapolis? In \n                         '45? Jesus...\n\n               Quint remembering.\n\n<b>               CLOSE ON QUINT\n</b>\n<b>                                     QUINT\n</b>                         Yeah. The U.S.S. Indianapolis.\n                         June 29th, 1945, three and a half \n                         minutes past midnight, two torpedoes \n                         from a Japanese submarine slammed \n                         into our side. Two or three. We was \n                         still under sealed orders after \n                         deliverin' the bomb...the Hiroshima \n                         bomb...we was goin' back across the \n                         Pacific from Tinian to Leyte. Damn \n                         near eleven hundred men went over \n                         the side. The life boats was lashed \n                         down so tight to make the bomb run \n                         we couldn't cut a single one adrift. \n                         Not one. And there was no rafts. \n                         None. That vessel sank in twelve \n                         minutes. Yes, that's all she took. \n                         We didn't see the first shark till \n                         we'd been in the water about an hour. \n                         A thirteen-footer near enough. A \n                         blue. You measure that by judgin' \n                         the dorsal to the tail. What we didn't \n                         know... of course the Captain knew...I \n                         guess some officers knew... was the \n                         bomb mission had been so secret, no \n                         distress signals was sent. What the \n                         men didn't know was that they wouldn't \n                         even list us as overdue for a week. \n                         Well, I didn't know that -- I wasn't \n                         an officer -- just as well perhaps. \n                         So some of us were dead already -- \n                         in the water -- just hangin' limp in \n                         our lifejackets. And several already \n                         bleedin'. And the three hundred or \n                         so laying on the bottom of the ocean. \n                         As the light went, the sharks came \n                         crusin'. We formed tight groups -- \n                         somewhat like squares in an old battle -- \n                         You know what I mean -- so that when \n                         one come close, the man nearest would \n                         yell and shout and pound the water \n                         and sometimes it worked and the fish \n                         turned away, but other times that \n                         shark would seem to look right at a \n                         man -- right into his eyes -- and in \n                         spite of all shoutin' and poundin' \n                         you'd hear that terrible high \n                         screamin' and the ocean would go \n                         red, then churn up as they ripped \n                         him.  Then we'd reform our little \n                         squares. By the first dawn the sharks \n                         had taken more than a hundred. Hard \n                         for me to count but more than a \n                         hundred. I don't know how many sharks. \n                         Maybe a thousand. I do know they \n                         averaged six men an hour. All kinds -- \n                         blues, makos, tigers. All kinds.\n                              (Pause)\n                         In the middle of the second day, \n                         some of us started to go crazy from \n                         the thirst. One fella cried out he \n                         saw a river, another claimed he saw \n                         a waterfall, some started to drink \n                         the ocean and choked on it, and some \n                         left our little groups -- our little \n                         squares -- and swam off alone lookin' \n                         for islands and the sharks always \n                         took them right away. It was mainly \n                         the young fellas that did that -- \n                         the older ones stayed where they \n                         was. That second day -- my life jacket \n                         rubbed me raw and that was more blood \n                         in the water. Oh my. On Thursday \n                         morning I bumped up against a friend \n                         of mine -- Herbie Robinson from \n                         Cleveland -- a bosun's mate -- it \n                         seemed he was asleep but when I \n                         reached over to waken him, he bobbed \n                         in the water and I saw his body upend \n                         because he'd been bitten in half \n                         beneath the waist. Well Chief, so it \n                         went on -- bombers high overhead but \n                         nobody noticin' us. Yes -- suicides, \n                         sharks, and all this goin' crazy and \n                         dyin' of thirst. Noon the fifth day, \n                         Mr. Hooper, a Lockheed Ventura swung \n                         around and came in low. Yes. He did \n                         that. Yes, that pilot saw us. And \n                         early evenin', a big fat PBY come \n                         down out of the sky and began the \n                         pickup.  That was when I was most \n                         frightened of all -- while I was \n                         waitin' for my turn. Just two and a \n                         half hours short of five days and \n                         five nights when they got to me and \n                         took me up. Eleven hundred of us \n                         went into that ocean -- three hundred \n                         and sixteen got out. Yeah. Nineteen \n                         hundred and forty five. June the \n                         29th.\n                              (pause)\n                         Anyway, we delivered the bomb.\n\n<b>               EXT. OCEAN - NIGHT\n</b>\n               Quint has just finished his story, and we are looking across \n               the quiet night sea to the Orca slowly circling in the night, \n               the warm light in the pilot house barely revealing the figures \n               of the three men inside, the red and green running lights \n               winking along the ship's flanks. We hear the distant boom \n               and drawn-out hoot of a whale.\n\n<b>               INT. ORCA PILOT HOUSE - NIGHT\n</b>\n<b>                                     BRODY\n</b>                         What the hell?\n\n<b>                                     HOOPER\n</b>                         It's a whale out there.\n\n               There's a brief, eerie pause. Quint breaks the silence by \n               muttering into song, which he slowly swells.\n\n<b>                                     QUINT\n</b>                              (singing)\n                         Show me the way to go home... I'm \n                         tired and I want to go to bed. I had \n                         a little drink about an hour ago, \n                         and it went right to my head.\n                              (etc.)\n\n               Gradually, Hooper and Brody join in, and the pilothouse \n               becomes a warm cozy place.\n\n<b>               EXT. OCEAN\n</b>\n               The Orca and its song in the night. In the foreground, the \n               barrel and strobe light flash up into view, and behind them, \n               the big dorsal fin surfaces, and glides ominously towards \n               the ship.\n\n<b>               INT. PILOT HOUSE\n</b>\n               The song is continuing, and we hear the barest hint of a \n               scraping sound from the hull deep beneath the men. Quint's \n               eyes abruptly narrow as his sensitive ears are the first to \n               hear the abrasion of his ship. Things vibrate on the shelves.\n\n               Quint stops singing, Hooper and Brody continue a duet. The \n               scraping repeats, and Hooper now senses it. He drops out of \n               the song, leaving Brody singing solo.\n\n<b>                                     QUINT\n</b>                              (quietly, to Hooper)\n                         Start the engines.\n\n               As Brody hears this and is about to stop singing, the boat \n               is suddenly bumped from below, and the gentle scraping turns \n               to a violent assault somewhere on the understructure of the \n               vessel. Water bubbles up into the hold. Brody starts, and \n               looks at the radio. He is about to move towards it when \n               Quint's urgent instructions stop him.\n\n<b>                                     QUINT\n</b>                         He's busting the shaft! Start the \n                         pump!\n\n<b>                                     BRODY\n</b>                         Where...?\n\n<b>                                     QUINT\n</b>                         The bilge pumps. There --\n\n               He leaves Brody in the pilot house, and runs onto the deck, \n               grabbing his M-1 rifle as he goes. Brody hits a switch and \n               we hear the pumps starting.\n\n<b>               ANGLE ON THE ORCA\n</b>\n               Hooper is on the flybridge, starting the engines, but the \n               diesels sound wrong.\n\n<b>                                     QUINT\n</b>                         Cut the engines!\n\n               Hooper does.\n\n<b>                                     HOOPER\n</b>                         Rudder bearings?\n\n               The boat is assaulted again. Quint fires over the stern, \n               emptying a clip into the water.\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         Get up forward! Watch for him!\n\n               Brody moves cautiously up to the bow.\n\n<b>                                     QUINT\n</b>                         Keep your eyes open, Mr. Hooper!\n\n               Hooper stands ready on the bridge, Quint pacing the stern \n               deck.\n\n<b>                                     QUINT\n</b>                         Nobody sleeps! Nobody.\n\n               He jams a fresh clip into the M-1. The men scan the seas \n               around them. Quint resumes their song, louder this time, \n               more defiant.\n\n<b>                                     QUINT\n</b>                              (sings)\n                         Show me the way to go home... I'm \n                         tired and I want to go to bed.\n                              (etc.)\n\n               Hooper and Brody join in from their respective positions.\n\n<b>               EXT. OCEAN, WIDE ON THE ORCA\n</b>\n               The men in place, singing, the water sparkling towards the \n               horizon, the stars twinkling above. The sound of a distant \n               whale in distant counterpoint.\n\n<b>               EXT. THE ORCA - DAWN\n</b>\n               Brody is at the wheel on the flying bridge, while Hooper and \n               Quint have a hatch up on the stern, and are working together \n               to repair the damaged rudder controls torn loose by the shark. \n               Hooper is bucking the steel rod, while Quint is hammering \n               away at the joint, trying to drive a new pin.\n\n               The engine is idling. Bits of iron clutter the deck, along \n               with a few rough, outsized tools and greasy rags and gaskets.\n\n<b>                                     QUINT\n</b>                         More left rudder! More! Left hand \n                         down now, Chief.\n\n               Brody tries to comply.\n\n<b>                                     HOOPER\n</b>                              (shifting his grip)\n                         Lemme get a better angle on it. Now.\n\n               Quint hammers again.\n\n<b>                                     QUINT\n</b>                         He's bent the housing. You can hear \n                         it.\n\n               And we can. The Orca's diesels are no longer smooth. Brody \n               suddenly sees something, and points.\n\n<b>               BRODY'S POINT OF VIEW - THE WATER\n</b>\n               The barrel is surfaced directly ahead of them, just off the \n               port side. They are drifting up to it.\n\n<b>                                     BRODY\n</b>                         The barrel!\n\n               The strobe light winks at them. Quint holds up a hand:  \n               \"Quiet!\"\n\n               Everything stops as they watch the barrel coming slowly up \n               on them.\n\n<b>                                     QUINT\n</b>                         It's him.\n\n               He takes a killing lance from the rack. Hooper gets a \n               boathook.\n\n<b>                                     QUINT\n</b>                         He's under the keg. Careful --\n\n               Hooper leans out gingerly, snagging the barrel with the hook.\n\n               It bobs lightly in the water, an innocent bystander. Hooper \n               shifts his pole, takes hold of the rope, poling it in.\n\n<b>                                     QUINT\n</b>                              (suspicious)\n                         Easy -- just want to goose him up. \n                         The minute he runs, drop it or you'll \n                         lose your hands.\n\n               Hooper gets the line and starts hauling it up. No resistance.\n\n               It comes easily over the transom into a coil on the deck.  \n               He and Quint exchange looks.\n\n<b>                                     QUINT\n</b>                         Here -- gimme. I don't see what he's \n                         been doin'.\n\n<b>               WATER - ANGLE\n</b>\n               Both men are draped over the side, their chins almost touching \n               the water on the aft side. From the opposite starboard \n               direction, fully unfastened from the barrel, comes the Great \n               White. First the fin, then the conical nose and the upper \n               border of wide, grinning teeth. It knifes through the water \n               in absolute silence, propelling itself with tremendous speed \n               toward the unsuspecting men.\n\n<b>               CLOSE - BRODY\n</b>\n               His instincts shine -- as does his newly-acquired sense of \n               direction.\n\n<b>                                     BRODY\n</b>                              (top of his lungs)\n                         Shark! Starboard!\n\n<b>               CLOSE - HOOPER AND QUINT\n</b>\n               They turn just in time, and a long spine-stretch saves them \n               from instant decapitation. The Great White passes the transom, \n               the harpoon still in its side and trailing five feet of chewed-\n               off cable. It rolls on its side and looks at them as it \n               passes.\n\n               Past the stern the huge tail lashes out, ripping the rope \n               out of Quint's hands, shearing a huge swath through the paint, \n               peeling it off like a plane, taking one of the bronze letters \n               out of \"Orca.\" The shark begins an arc to sea, its fin cutting \n               the water, and starts circling the boat. Quint notices his \n               cut hand, palm bleeding, realizing how close he came to losing \n               it.\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         Haul in that rope -- it'll foul us!\n                              (then to Brody on the \n                              bridge)\n                         Start the engine!\n\n               The diesels start with a terrible grinding.\n\n<b>                                     QUINT\n</b>                         Easy! It'll tear right out!\n\n<b>                                     HOOPER\n</b>                              (hauling)\n                         The shaft is giving.\n\n               Hooper slams the hatch, kicks the tools to one side, clearing \n               the deck for action once again.\n\n<b>                                     BRODY\n</b>                              (on bridge)\n                         That's it! Radio in for help!\n\n<b>                                     QUINT\n</b>                         Shut up! Just pump her out!\n\n<b>                                     BRODY\n</b>                              (coming down off the \n                              bridge)\n                         Yeah, Captain, as soon as I make a \n                         call.\n\n               Brody heads for the radio in the pilot house.\n\n<b>               QUINT - CLOSE\n</b>\n               A perfectly terrible look comes over him. He raises up and \n               starts after Brody. Brody disappears into the cabin. Quint \n               pauses outside and sees:\n\n<b>               INSERT - QUINT'S LEAD-CENTERED BASEBALL BAT\n</b>\n               his calloused hand grabs it up fiercely.\n\n<b>               INT. RADIO SHACK\n</b>\n               Brody picks up the radio, flicking on knobs and lights on \n               the complex console.\n\n<b>                                     QUINT (O.S.)\n</b>                         Beg your pardon --\n\n<b>               ANGLE - DOORWAY\n</b>\n               Quint appears, silhouetted in the hot light of the door, \n               raising his bat.\n\n<b>                                     QUINT\n</b>                         Duty first and pleasure after --\n\n<b>               CLOSE - BRODY\n</b>\n               looking up in horror, covering his face.\n\n<b>               CLOSE - QUINT\n</b>\n               Quint brings down the bat with all the strength he can summon.\n\n               Crash!\n\n               Sparks fly, lights blink and go out, plastic and sections of \n               metal ricochet all over the cabin as Quint demolishes the \n               ship-to-shore radio.\n\n               Quint takes a happy breath, winks at Brody and hands him the \n               bat.\n\n<b>                                     QUINT\n</b>                         Excuse me!\n\n               Brody's adrenaline turns his fear into rage. His glasses are \n               cracked or broken by flying pieces of radio. He seizes the \n               bat, and pound the shattered radio for emphasis.\n\n<b>                                     BRODY\n</b>                         Some great idea! Now where are we?  \n                         Some goddamn skipper you are. You're \n                         certifiable, y'know that? You're a \n                         real treat! Certifiable! Bananas!\n\n               His tirade is interrupted by an urgent bellow from Hooper.\n\n<b>               CLOSE - HOOPER\n</b>\n               Pointing at the fin.\n\n<b>                                     HOOPER\n</b>                         Coming right to us!\n\n<b>                                     QUINT\n</b>                         No -- comin' right at us! Slow ahead, \n                         he'll hit us head on --\n                              (the engine clanks)\n                         Slower! Throttle back ---\n\n<b>               ANGLE - OVER THE BOW\n</b>\n<b>                                     QUINT\n</b>                              (raising harpoon)\n                         Hard to port!\n\n               Hooper pulls the boat into a tight turn and Quint has a shot \n               at the upward rolling flank. He sinks it with careful \n               precision.\n\n<b>                                     QUINT\n</b>                         Try shakin' that out!\n\n               Brody emerges from the cabin as the rope zips overboard, and \n               the barrel, changing over, catapults into the air before \n               plunging into the ocean in a cloudy splash.\n\n<b>                                     BRODY\n</b>                              (shouting to Quint)\n                         Did you get him in the head?\n\n<b>                                     QUINT\n</b>                              (to Brody)\n                         No! No! No!\n                              (to Hooper)\n                         Swing around! After him!\n\n<b>               ON THE FLYBRIDGE\n</b>\n               Hooper can see the fin racing ahead of the barrel. Diving \n               down. Up again -- Quint prepares another iron. Brody is \n               digging in his bag. He comes up with his 2\" .357 service \n               revolver.\n\n<b>                                     QUINT\n</b>                         More gas... go to half! Get me right \n                         alongside him --\n\n               The engine thuds and knocks.\n\n<b>                                     HOOPER\n</b>                              (shouting down)\n                         We can't rev it up this high --\n\n               Suddenly the barrel gongs into the side of the Orca.\n\n<b>                                     QUINT\n</b>                         Watch it!\n\n               Hooper skillfully avoids the speeding rope.\n\n<b>                                     QUINT\n</b>                         Atta boy!\n\n               Quint leans to one side, harpoon over his head. The Great \n               White breaks water and...\n\n<b>                                     QUINT\n</b>                         Take two, they're small!\n\n               He sinks it deep. We hear shots. As the new rope whips out, \n               Brody can be seen standing on the gunwale, in regulation \n               police combat pistol stance, holding his .357 in both hands, \n               firing at the shark's head.\n\n               Quint shakes his head in amused disbelief at this, as the \n               barrel goes over.\n\n<b>                                     HOOPER\n</b>                              (shouting at Brody)\n                         Don't shoot him any more! He's crazy \n                         on his own blood already!\n\n<b>                                     BRODY\n</b>                         I can't stand here doing nothing!\n\n<b>                                     QUINT\n</b>                         Order in the court!\n\n<b>               WATER LEVEL ANGLE\n</b>\n               He has seen the two barrels pop to the surface.\n\n<b>                                     QUINT\n</b>                              (racing over)\n                         Three'll do it! He's havin' trouble \n                         with two!\n\n               He yells to Hooper and Brody as he swings behind the controls.\n\n<b>                                     QUINT\n</b>                         Grab yourselves a couple of poles!\n\n               Quint steers \"Slow Ahead,\" engine protesting, as he maneuvers \n               toward the moving barrels. Quint peers down, steering closer \n               and closer.\n\n<b>                                     QUINT\n</b>                         Get ready! Now snag 'em!\n\n               Together Brody and Hooper hook a barrel-rope and hold on for \n               dear life as the shark changes course.\n\n<b>                                     QUINT\n</b>                         Pull in the ropes and tie 'em onto \n                         the transom -- free ride.\n\n               Brody and Hooper pull in with all they are worth as Quint \n               helps out by wheeling in a circle. He laughs to himself, \n               enjoying the spectacle.\n\n<b>               CLOSE - HOOPER\n</b>\n               securing the rope to a cleat but allowing the barrel to hang \n               overboard. Brody ties his now-perfect bowline adjacent cleat.\n\n<b>               WIDE ANGLE - ORCA\n</b>\n               The boat is jarred violently from side to side as the \n               underwater force of the Great White jerks and heaves them to \n               and fro, up and down, side to side...\n\n<b>               ANGLE - HOOPER AND BRODY\n</b>\n               are both torn off their feet as the boat is thrust forward.\n\n<b>               FLYBRIDGE - QUINT\n</b>\n               sees the fin ahead. It is pulling the boat.\n\n<b>                                     QUINT\n</b>                         Get tired! That's the idea! Here's a \n                         little reverse for you!\n\n               The shark leaps partially out of the water, and the sight is \n               both horrifying and awesome. Its jaws break water, snapping \n               at the ropes that have him snarled and frustrated.\n\n               Quint throws the Orca into neutral and shouts down:\n\n<b>                                     QUINT\n</b>                         Haul in -- watch the prop!\n\n               With that, Quint slides down to the prow, putting another \n               shaft onto his gun, finding satisfaction in its heft and \n               balance. The shark can be seen directly ahead, threshing \n               closer.\n\n<b>                                     QUINT\n</b>                         Now! Untie 'em! Quick! He'll tear us \n                         to pieces.\n\n               He fires the iron, and the shark veers downward in a gushing \n               shower of spray.\n\n<b>               HOOPER AND BRODY\n</b>\n               They are trying to untie from the cleats, but both ropes are \n               stretched too taut. They jump out of the way, falling flat\n\n               on the deck as the ropes sweep over them, knocking over \n               objects, skeetering across the deck. A tight jerking motion, \n               and the Orca is dragged through the water -- backwards. And \n               much too fast. Water is splashing up over the transom in its \n               backward wake. The engines groan and complain.\n\n<b>                                     QUINT\n</b>                         Damn head is too far away. He's too \n                         big.\n\n               Wrenched to one side, Quint is knocked from his feet.\n\n<b>               CLOSE - THE TWO CLEATS\n</b>\n               A moment of slackness, and then a great surge of raw strength.\n\n               The rope snaps the cleats off, screws and splintered wood \n               spraying -- and the barrels fly over the water. They disappear \n               beneath the turbulent grey surface.\n\n               The three men, breathing heavily, bruised and pouring sweat, \n               look out at the blank water.\n\n<b>               ANGLE - OCEAN\n</b>\n               Pop -- pop -- pop. One, two, three, the barrels surface -- \n               ready for more.\n\n<b>                                     QUINT\n</b>                              (amazed at the shark's \n                              strength)\n                         He can't go so deep. Not with all \n                         those on him.\n\n               Brody looks down at his feet. There is salt water up to their \n               shoe tops.\n\n<b>                                     BRODY\n</b>                         What about us?\n\n<b>                                     QUINT\n</b>                              (mentally assessing \n                              the damage)\n                         Have to pump her steady, s'all.\n\n               The barrels start a wide circle, each cuts through the water, \n               pushing a wave before it and leaving a wake behind.\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         Follow him --\n                              (to Brody)\n                         You start pumpin' out here.\n\n               Quint tosses Brody the hand pump, then picks up his M-1, and \n               checks the load.\n\n<b>                                     HOOPER (O.S.)\n</b>                              (on bridge)\n                         He's heading under -- !\n\n<b>                                     QUINT\n</b>                              (incredulously)\n                         No way! He can't!\n\n<b>               ANGLE - OCEAN\n</b>\n               The barrels approaching the Orca dip below the surface, one -- \n               two -- three.\n\n<b>                                     BRODY\n</b>                         Where'd he go?\n\n               Brody looks around. Hooper on the flying bridge searching in \n               all directions. Quint is looking more appalled every second.\n\n<b>                                     QUINT\n</b>                              (helplessly)\n                         He can't stay down with three barrels \n                         on him! Where is he?!\n\n<b>                                     BRODY\n</b>                         Have you ever had one do this?\n\n<b>                                     QUINT\n</b>                              (and he means this)\n                         No!\n\n               Booming thud at the keel. Brody slides on the wet deck and \n               Quint loses his footing, falling into Brody's arms.\n\n<b>               WITH HOOPER ON THE FLY BRIDGE\n</b>\n               It seems the only place out of reach of the shark. Quint \n               climbs up, Brody following him, reloading his pistol.\n\n               Just then, the barrels pop up ahead, veer left, and duck \n               under.\n\n<b>                                     QUINT\n</b>                         Follow him!\n\n<b>                                     HOOPER\n</b>                         He's under!\n\n<b>               BRODY AND HIS POINT OF VIEW\n</b>\n<b>                                     BRODY\n</b>                         There!\n                              (points wildly)\n\n               The barrels have surfaced and we see the monster shadow \n               sliding under the Orca, seemingly endless. Violent scraping \n               sounds.\n\n<b>                                     BRODY\n</b>                         He's trying to sink us!\n\n<b>                                     QUINT\n</b>                              (to Hooper)\n                         Dead astern! Zig-zag!\n\n               Quint is grimly silent. Brody senses that Quint is in the \n               fight of (and for) his life.\n\n               The Orca taking evasive action. But the three barrels are \n               closing the gap, the engines coughing and missing, destroying \n               themselves with every rotation of the damaged shaft.\n\n<b>                         BRODY\n</b>                 He's chasing us! I \n                 don't believe it. \n\n<b>                                                       QUINT\n</b>                                               Full throttle! To port!\n\n<b>               ANGLE ON THE BRIDGE\n</b>\n               Hooper is jamming the throttle forward, but the engine is \n               pounding and knocking wildly. The barrels circle and move \n               in. Quint has his rifle ready.\n\n<b>                                     HOOPER\n</b>                              (suddenly giving Quint \n                              the wheel)\n                         Hold her.\n\n               He leaps to his gear, trying desperately to get his dart \n               gun.\n\n               Just then, the shark attacks, breaking water and rising over \n               the boat like a rocket; snout, jaws, pectoral fins, belly, \n               falling sideways. A vast spray drenches the men. Quint fires \n               into the belly, the bullets pocking the smooth whiteness.\n\n<b>                                     HOOPER\n</b>                              (loading)\n                         Keep him there! Keep him!\n\n               The Orca shudders from side to side. From Hooper's point of \n               view we can the shark gripping the transom in his jaws, \n               shaking the boat as he saws his massive head from side to \n               side, trying to tear a chunk out of the very hull. Quint has \n               reloaded and is firing into the fish. Brody has a wicked \n               pointed gaff, and is swinging wildly at the snout, gashing \n               and gouging it, trying for the eyes. The killing lust is on \n               all three men.\n\n<b>                                     QUINT\n</b>                         Throttling back!\n\n               The boat surges, the shark gives a final unbalances wrench, \n               and disengages. The dorsal fin circles off, beginning a wide \n               loop around the boat.\n\n               The engine quivers and dies, the boat without power, rolling \n               half awash, a wounded victim.\n\n               The fin dips, the barrels follow, the shark disappears beneath \n               the waves. There is complete silence.\n\n<b>               THE THREE MEN ON DECK\n</b>\n               In the dead quiet, we can hear the lap of waves against the \n               hull, the hoarse panting breathing of the men, the pings and \n               pops of the cooling, dying engines.\n\n<b>               QUINT AND THE TRANSOM\n</b>\n               He eyes the stern. Huge cracks and broken timber testify to \n               the fury of the attack.\n\n<b>                                     QUINT\n</b>                              (very quietly, to \n                              Hooper)\n                         What can that gun of yours do?\n\n<b>                                     HOOPER\n</b>                         Power head with 20 ccs of strychnine \n                         nitrate. If I can hit him. I can \n                         kill him. But I gotta be close.  \n                         Very close.\n\n<b>                                     BRODY\n</b>                              (the awful realization)\n                         You gotta go in the water...\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ON DECK, LATER\n</b>\n               Quint and Hooper are assembling the shark cage, its shiny \n               bars the only undamaged things on deck. Brody is working \n               too, bolting the sections together.\n\n<b>                                     HOOPER\n</b>                              (in command now)\n                         Rig the cable to the roof eyebolts.\n\n               The men are speaking in near whispers, quiet in the silence \n               that surrounds them. Hooper is in his wet suit, adjusting \n               weights, mask, tanks, etc. The cage is standing in the stern.\n\n               Quint runs a line from the gin pole to the roof section.\n\n               Hooper climbs in though the top.\n\n<b>                                     HOOPER\n</b>                         Take me up.\n\n               Brody cranks the winch, hoisting cage and Hooper into the \n               air. Quint balances the gin pole lines, Hooper crouching in \n               the cage, examining it for stresses; satisfied, he holds out \n               his hand. Quint puts the spear gun into it.\n\n<b>               CLOSE ON HOOPER IN THE CAGE\n</b>\n               He examines his weapon, checking the power load, with the \n               big wicked-looking syringe head uncapped to reveal its razor \n               point.\n\n<b>                                     HOOPER\n</b>                         Lower away, Chief.\n                              (then, to Quint)\n                         Try and keep him off me till I'm \n                         under.\n\n               Hooper inside, looking out the bars of the cage, gives Brody \n               a reassuring smile, then pops his mouthpiece between his \n               teeth and checks his regulator. Brody steps back, and with \n               Quint guiding the cage, begins lowering it off the gin pole \n               boom arm into the sea alongside the boat.\n\n               Brody and Hooper stare at each another as their faces pass, \n               Hooper sliding down into the cold grey ocean.\n\n               As Hooper disappears beneath the surface, Quint and Brody \n               exchange a long look between them.\n\n<b>               UNDERWATER - CAGE\n</b>\n<b>               HOOPER'S POINT OF VIEW\n</b>\n               Submerging. The sky, horizon, water line, clean fresh sea \n               air then... the magnificent innerspaces, with bubbles \n               sparkling in front of us.\n\n<b>               ANGLE - HOOPER IN THE CAGE\n</b>\n               as he floats to twenty feet Hooper never stops looking around \n               360 degrees. He removes the rubber guard from the needle and \n               waits.\n\n<b>               EXT. THE SURFACE - BRODY AND QUINT\n</b>\n               Their turning heads tell us that the barrels are still \n               circling.\n\n               Suddenly, both heads stop turning.\n\n<b>               THE SEA\n</b>\n               The barrels have come to a stop. Delicately, they change \n               course and meander toward the lowered cage.\n\n<b>               UNDERWATER - HOOPER\n</b>\n               His back is to us. He is just now completing a visual sweep \n               and turns, eyes front into closeup and: fixes wildly on \n               something monstrous... and fascinating.\n\n<b>               HOOPER'S POINT OF VIEW\n</b>\n               The water is clear and shafts of sunlight streak downward in \n               the blue. From the deep gloom -- diving slowly, smoothly -- \n               comes the shark. It moves with no apparent effort, sinuous \n               beyond comparison. As it nears the cage, it turns, and its \n               ghastly length passes right in front of him: first the snout, \n               then the jaw, slack and smiling, then the black eye.\n\n               Hooper tentatively reaches out. It is too far for the \n               strychnine pole. The vinyl flesh is pocked with bullet holes, \n               iron scars, gaffing hooks and strange open wounds that tinge \n               the passing currents with pink.\n\n<b>               SURFACE\n</b>\n               The trailing barrels gong and scratch the keel of the Orca \n               above. Brody and Quint leap back.\n\n<b>               HOOPER - CLOSE\n</b>\n               The shark has vanished into a cloud of rising silt. Hooper, \n               expecting the shark to attack out of that same general \n               direction, braces himself, pole extended through the bars, \n               breathing faster, straining his eyes into the gloom and... \n               we see that the shark attacking from behind him.\n\n               The cage is sent careening. Hooper grabs the bars for dear \n               life. The shark has grabbed the steel struts in its brutal \n               jaws, shaking the cage relentlessly from side to side, bending \n               the bars like clothes hangers. Hooper can't turn the pointed \n               end of the pole around, his body jammed as far away from the \n               non-rational attacker as possible.\n\n               Hooper is trapped.\n\n               The shark withdraws to get some running room then charges \n               again. The bleeding snout thrust deeper into the yawing bars, \n               the jaws snapping and twisting, two feet from Hooper's torso, \n               the tail thrusting it forward. Hooper drops the strychnine \n               pole between the bars and it tumbles slowly toward rapture \n               depth.\n\n               All the shark needs is one more good thrust before separating \n               Hooper at the waistline. Through frantic bubbles Hooper \n               fumbles with the overhead hatch cover, kicking up and out of \n               the cage. The shark backpedals with its tail, but the broad \n               head won't shake loose.\n\n               Hooper rushes downwards, after the strychnine pole.\n\n<b>               ANGLE - SHARK\n</b>\n               The shark twists free of the cage and arrows downward after \n               Hooper.\n\n               Hooper nearly recovers the pole. Again it slips from his \n               frightened grasp and this time disappears into a narrow abyss.  \n               Hooper turns and looks up.\n\n               The Great White is lunging at him, twenty feet above.\n\n<b>               SURFACE\n</b>\n               One of the barrel ropes snakes around the cage rope and pulls \n               taut.\n\n<b>               HOOPER - DEEP\n</b>\n               Turning to meet the monster which -- though held back for a \n               moment by the snarled rope -- now surges forward.\n\n<b>               SURFACE - BRODY AND QUINT\n</b>\n               The Orca is listing dangerously aft, the ginpole bent almost \n               to the breaking point. Brody is in a frenzy trying to haul \n               up the cage. Quint attaches the end of Brody's rope to a \n               hand-winch. The ginpole is splitting.\n\n<b>                                     QUINT\n</b>                         Let go of it!\n\n               The pole gives way, the rope whipping down on the gunwale... \n               the pulling of the tonnage below is tipping the Orca, dragging \n               it, but Quint won't give up the winch. Brody hauls on the \n               rope barehanded.\n\n<b>               UNDERWATER - HOOPER\n</b>\n               maneuvering downward, away from the jaws... Suddenly the \n               crazed shark veers upward for the surface.\n\n<b>               SURFACE - QUINT\n</b>\n               The winch is working faster now, Quint demonically winding \n               it in. The crushed cage bangs against the hull then breaks \n               water.\n\n               Brody is horrified. The cage is empty!\n\n<b>                         QUINT\n</b>                    (a horrible scream)\n                 He's comin' up -- !\n\n<b>                                                       BRODY\n</b>                                               He's taken him!\n\n<b>               MASTER ANGLE\n</b>\n               The shark breaks water right beside the Orca, rising with a \n               great whooshing noise. It rises vertically, towering overhead, \n               blocking out the sun. The pectoral fins seem to reach forward.  \n               The shark, in all of its monstrous glory, falls onto the \n               stern of the boat with a shattering crash, narrowly missing \n               Quint and Brody. It drives the stern underwater, the ocean \n               pours in over the transom. The jaws snap from side to side.  \n               Brody flounders backwards away from it.\n\n<b>               CLOSE - BRODY\n</b>\n               He is clinging to the mast for dear life, as the ship begins \n               to tilt to stern, and everything starts to break loose around \n               him.\n\n<b>               NIGHTMARE ANGLE - DECK OF THE ORCA\n</b>\n               The giant jaws are snapping irresistibly at everything: great \n               chunks of wood torn out of the deck and superstructure.\n\n               Deck chair, irons, rope, gear, beercans, bottles, Brody's \n               bag, all are food for the insatiable maw blindly churning \n               away.\n\n               Quint is clinging next to a rack of lances: he is enraged at \n               this ultimate violation of his territory. He snatches up a \n               lance and hurls himself at the shark with a wordless bellow.\n\n               The great head weaves side to side, the deck is at a \n               treacherous incline, slippery with blood and seawater. Quint's \n               footing falters and slips, he stumbles at the Mouth of Hell, \n               the big teeth seize him and snap.\n\n               Quint's roar of rage and pain is choked off as his body is \n               clamped between the grinding, sawing teeth, and his head and \n               legs suddenly contort as the shark's teeth meet across his \n               torso. Blood gushes onto the deck. The remnants of his body \n               tumble from the shark's mouth.\n\n               Brody sees the horror, hears the screams -- in his \n               desperation, he tears loose one of Hooper's remaining air \n               tanks, and hurls it at the monster. It tumbles into the bloody \n               well, wedging across the back of the mouth, the thick steel \n               blocking the cruel jaws.\n\n               The shark's head shakes even more violently, trying to clear \n               the cold iron, but the tank is in to stay.\n\n<b>               DECK OF THE ORCA, LISTING BADLY\n</b>\n               To avoid sliding into the jaws, Brody scrambles on the titling \n               deck, bracing himself in the cabin door to avoid pitching \n               down into the bloody mouth. He fights his way into the cabin, \n               already a shambles.\n\n               Below him, on the deck, the shark lunges again, shifting \n               weight so that the boat in now stern down, and listing to \n               the side. Water from the sea pours into the cabin.\n\n               Another lunge by the shark. The huge snout and jaws slam up \n               against the doorframe, blocking escape, bloody, gnashing.\n\n               More seawater. To stay in the cabin is to go down with the \n               ship.\n\n               Brody clambers as far from the shark as he can, against the \n               forward wall of the pilothouse. He sees the window Hooper \n               used before. It's blocked by barrels and debris. He breaks \n               the side window highest above the water, edges out onto the \n               battered bridge.\n\n               The shark rolls around, now half in the water. The ship is \n               sinking, the sea is not a viable alternative. Brody climbs \n               up into the flying bridge.\n\n               The shark is still lunging and snapping. Brody is forced to \n               climb higher and higher as the ship slowly sinks beneath \n               him.\n\n<b>               CLOSE - BRODY\n</b>\n               He scrambles for his life onto the flying bridge, sees the M-\n               1 stuck there, seizes it.\n\n<b>               OVER BRODY, LOOKING DOWN AT THE STERN\n</b>\n               He is bracing himself, aiming the rifle, taking a bead on \n               the steel tanks, silver gleaming in the bloody shark's mouth.  \n               He fires. And fires. Bullets shatter the shark's teeth, \n               punching holes in the dripping snout.\n\n<b>               WIDE ON THE ORCA \u0096 EXPLOSION\n</b>\n               With a muffled boom, the perfect symmetry of the shark is \n               suddenly blown apart in a geyser of steel and blood as Brody's \n               shot hits the pressurized tank. A 30-foot cloud of water, \n               steel, shark and debris covers the sky.\n\n               A gigantic convulsion hurls the Great White's mangled body \n               into the sea. The Orca slowly begins to turn over in its \n               death roll.\n\n<b>               UNDERWATER\n</b>\n               The shark's carcass floating down in a cloud of blood and \n               debris.\n\n               A shadow clouds the waters, and the Orca's mass begins to \n               slip into the frame.\n\n<b>               CLOSE - HOOPER\n</b>\n               Emerging from beneath the surface, he raises his mask, spits \n               out his mouthpiece and kicks toward Brody.\n\n<b>               SURFACE - BRODY AND HOOPER\n</b>\n               Brody is holding onto a cushion, barely afloat, relieved the \n               shark is dead, yet stunned to see Hooper is still alive. The \n               two men share weak laughter, which soon trails off.\n\n<b>                                     HOOPER\n</b>                         Quint...?\n\n<b>                                     BRODY\n</b>                         No...\n                              (notices something \n<b>                              O.S.)\n</b>                         You think we can get back with those?\n\n<b>               SURFACE - BRODY AND HOOPER - ANOTHER ANGLE\n</b>\n               They swim through the debris, using two barrels as floats, \n               as dozens of seagulls feast on shark remains on the surface.\n\n<b>                                     BRODY\n</b>                         What day is this?\n\n<b>                                     HOOPER\n</b>                         Wednesday... No, it's Tuesday, I \n                         think.\n\n<b>                                     BRODY\n</b>                         Think the tide's with us?\n\n<b>                                     HOOPER\n</b>                         Just keep kicking.\n\n<b>                                     BRODY\n</b>                         Y'know, I used to hate the water...\n\n<b>                                     HOOPER\n</b>                         I can't imagine why.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               HIGH SHOT FROM SHORE\n</b>\n               The two tiny, miserable heroes swim ashore as the credits \n               roll.\n\n<b>                                                                  FADE OUT:\n</b>\n<b>                                         THE END\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Jaws</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Peter Benchley\" title=\"Scripts by Peter Benchley\">Peter Benchley</a>  <a href=\"/writer.php?w=Carl Gottlieb\" title=\"Scripts by Carl Gottlieb\">Carl Gottlieb</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Jaws Script.html#comments\" title=\"Jaws comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:08:44.457747"}