{"title": "Jeux Interdits", "film_link": "/Movie Scripts/Jeux Interdits Script.html", "script_link": "/scripts/Jeux-Interdits.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Jeux Interdits Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Jeux-Interdits.jpg\" title=\"Jeux Interdits Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Jean Aurenche\" title=\"Scripts by Jean Aurenche\">Jean Aurenche</a><br/>  <a href=\"/writer.php?w=Pierre Bost\" title=\"Scripts by Pierre Bost\">Pierre Bost</a><br/>  <a href=\"/writer.php?w=François Boyer\" title=\"Scripts by François Boyer\">François Boyer</a><br/>  <a href=\"/writer.php?w=René Clément\" title=\"Scripts by René Clément\">René Clément</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/War\" title=\"War Scripts\">War</a><br/><br/>\n<b>Movie Release Date</b> : December 1952<br/>\n<b>Submitted by</b>: Dominique<br/>\n<br/>\n<a href=\"/scripts/Jeux-Interdits.html\">Read \"Jeux Interdits\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n<b>                                JEUX INTERDITS (1951)\r\n</b>                         \r\n\r\n\r\n           Scénario : François BOYER\r\n           Adaptation : Jean AURENCHE, Pierre BOST, René CLÉMENT\r\n\r\n\r\n                         \r\n          Un écran noir sur lequel on entend la célèbre musique du film.\r\n                         \r\n          Puis apparaît, sur l'écran, une représentation stylisée du Lion de\r\n          Saint-Marc, avec ailes et auréole, regardant vers la gauche et la\r\n          patte avant droite posée sur un évangile ouvert.\r\n                         \r\n          Sur cette image, une inscription en lettres blanches :\r\n                         \r\n           Ce Film a obtenu\r\n<b>           LE LION DE ST-MARC\r\n</b>                         \r\n          Puis, toujours en lettres blanches sur la même image :\r\n                         \r\n           Suprême récompense de\r\n<b>                                    LA\r\n</b><b>                             BIENNALE DE VENISE\r\n</b>                                  avec la\r\n                        Mention spéciale suivante :\r\n                         \r\n<b>           PUIS :\r\n</b>                         \r\n           « Pour avoir su élever à une singulière\r\n           pureté lyrique et une exceptionnelle\r\n           force d'expression, l'innocence de\r\n           l'enfance au-dessus de la tragédie\r\n           et de la désolation de la guerre. »\r\n                         \r\n<b>                         NOTE\r\n</b>          La scène suivante, présente dans la version originale du film, a\r\n          été coupée dans de nombreuses copies diffusées, de nos jours,\r\n          aussi bien au cinéma qu'à la télévision.\r\n                         \r\n<b>          ILOT BOISÉ - EXTÉRIEUR JOUR\r\n</b>\r\n          C'est un paysage romantique, un peu irréel, semblant sortir d'un\r\n          conte de fées.\r\n                         \r\n          Une petite île, où sont plantés de nombreux arbres. Nous sommes\r\n          face à l'île, comme si la caméra était située sur l'eau, ou bien\r\n          sur la rive en face de l'île.\r\n                         \r\n          Un peu sur la droite, on aperçoit une coquette petite maison au\r\n          milieu des arbres. Devant la maison, un arbre est tombé dans\r\n          l'eau, mais l'extrémité inférieure du tronc repose toujours sur la\r\n          rive de l'île.\r\n                         \r\n          Une petite fille de cinq ou six ans, vêtue d'une belle robe\r\n          blanche, monte sur le tronc d'arbre, suivie d'un jeune garçon\r\n          d'une dizaine d'années, vêtue très élégamment comme un petit\r\n          écolier anglais. Le petit garçon jette une branche dans l'eau,\r\n          puis vient s'asseoir à côté de la petite fille. Elle a un panier\r\n          d'osier à la main, et lui un gros livre sous le bras. Les deux\r\n          enfants se sourient. Il pose le livre sur ses genoux. Elle se\r\n          penche vers lui.\r\n\r\n          La petite fille ressemble étrangement à celle qui sera Paulette\r\n          dans la suite du film, et le petit garçon à celui qui sera Michel\r\n          Dollé.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est l'histoire d'une petite fille...\r\n                         \r\n<b>                          PAULETTE\r\n</b>           D'une petite fille comment ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           D'une petite fille comme toi, et d'un petit garçon...\r\n                         \r\n<b>                          PAULETTE\r\n</b>           D'un petit garçon comme toi ?\r\n                         \r\n          Michel relève sa casquette, déboutonne sa veste, et ouvre le\r\n          livre.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Écoute...\r\n                         \r\n          Il remet sa casquette en place. Paulette ouvre son panier et tend\r\n          une sucette à Michel.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Tu veux une sucette ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Après.\r\n                         \r\n          Gros plan de la couverture en maroquin du livre, et qui représente\r\n          les deux enfants se tenant par la main. Michel ouvre le livre à la\r\n          première page.\r\n                         \r\n          Le générique est inscrit sur les pages du livre, et il défile au\r\n          fur et à mesure que Michel tourne les pages. La page qui suit la\r\n          fin du générique raconte le début de l'histoire.\r\n          Les doigts de Michel suivent le texte pendant qu'il lit.\r\n                         \r\n           MICHEL DOLLÉ (voix off)\r\n           « Jamais le mois de juin n'avait été aussi beau que cette\r\n           année-là. »\r\n                         \r\n          Paulette écoute Michel avec beaucoup d'attention tout en suçant sa\r\n          sucette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tout éclatait de joie. Les blés, à travers la France,\r\n           commençaient à jaunir et préparaient du pain... »\r\n                         \r\n          Michel tourne la page du livre.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           « ... pour quarante millions d'hommes... Et puis le soir,\r\n           quand les hommes avaient bien fait leur travail, le chant\r\n           du rossignol ruisselait dans les bois. » Parce qu'au mois\r\n           de juin, les rossignols chantent.\r\n          Gros plan sur le livre et le doigt de Michel qui suit le texte.\r\n                         \r\n           MICHEL DOLLÉ (voix off)\r\n           « Et les rossignols de cette année-là chantaient comme\r\n           d'habitude et ne savaient pas ce qui se passait en\r\n           France. »\r\n                         \r\n          Michel tourne la page. La page suivante occupe tout l'écran, et\r\n          représente un plan général d'une rivière traversée par un pont.\r\n                         \r\n<b>                         NOTE\r\n</b>          Retour à la version normale, telle qu'elle est présentée dans\r\n          toutes les copies du film. Dans les copies, où la scène précédente\r\n          a été coupée, le générique est toujours présenté sur un livre dont\r\n          on tourne les pages, sauf que le fond, en arrière-plan du livre,\r\n          n'est plus la rivière, mais un tissu à motif de fleurs, et que la\r\n          main, qui tourne les pages, n'est plus celle de Michel, mais celle\r\n          d'une femme. Après la fin du générique, on passe directement sur\r\n          une vue plus rapprochée du pont enjambant la rivière. Sur cette\r\n          image apparaît, en lettres blanches, le texte suivant :\r\n                         \r\n<b>                          JUIN\r\n</b><b>                          1940\r\n</b>                         \r\n<b>          ROUTE DE CAMPAGNE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Plan d'ensemble du pont. Ce pont est la continuation d'une route\r\n          de campagne, sur laquelle marche un grand nombre de personnes,\r\n          portant des sacs et des valises, trainant des enfants. Certains\r\n          poussent ou tirent des charrettes, sur lesquelles sont empilés des\r\n          objets hétéroclites. Certaines de ces charrettes sont tirées par\r\n          un cheval. Il y a même quelques vélos, des voitures et des\r\n          camionnettes.\r\n                         \r\n          Plans sur la route, puis de nouveau le pont, et plans rapprochés\r\n          sur les gens en exode.\r\n                         \r\n          Nous reconnaissons cette scène comment étant celle du\r\n          malheureusement célèbre exode de 1940.\r\n                         \r\n          Tout à coup, on entend un bruit de moteur d'avion. Un plan du ciel\r\n          nous montre un groupe d'avions allemands. (La plupart des photos\r\n          d'avions allemands dans le ciel proviennent de films d'archive de\r\n          la guerre.)\r\n                         \r\n          La foule des gens en exode fuit dans tous les sens pour éviter les\r\n          bombes lâchées par les avions, abandonnant, sur la route, leur\r\n          charrettes, leurs voitures, leurs vélos, et même leurs baluchons.\r\n          Les gens se précipitent sur les bas-côtés de la route, se cachant\r\n          derrière les talus. Le bruit des moteurs d'avion augmente et une\r\n          femme se met à hurler.\r\n                         \r\n          Plan du ciel. Un avion bascule sur l'aile pour descendre en piqué\r\n          sur la foule.\r\n                         \r\n          Retour sur la foule des réfugiés qui court pour s'abriter des\r\n          avions.\r\n                         \r\n          Un avion lâche des bombes.\r\n          Des bombes éclatent près du pont, soulevant des nuages de\r\n          poussière. Plan rapproché sur une femme qui hurle.\r\n                         \r\n          Les bruits des avions s'éloignent et les gens aplatis à terre\r\n          commencent à relever la tête. Puis ils se précipitent vers la\r\n          route en se bousculant pour récupérer leurs affaires et reprendre\r\n          leur exode.\r\n                         \r\n          Parmi ces gens, un jeune couple avec une petite fille blonde de\r\n          cinq ou six ans. Il s'agit de Paulette et de ses parents. Paulette\r\n          tient un petit chien noir et blanc dans ses bras. La famille\r\n          s'installe dans sa voiture (une Peugeot 202 décapotable et\r\n          décapotée), le père au volant, la mère à côté de lui avec la\r\n          fillette sur ses genoux. Le père actionne le démarreur, le moteur\r\n          tousse, mais ne veut pas démarrer. Il recommence l'opération deux\r\n          fois, toujours sans succès. On entend une autre voiture qui\r\n          klaxonne derrière lui. Le père lève les bras en signe\r\n          d'impuissance et essaie, encore une fois, de démarrer... sans\r\n          succès. Cette fois-ci, ce ne sont plus des coups de klaxon, mais\r\n          des cris qui retentissent.\r\n                         \r\n<b>           DES VOIX DIVERSES\r\n</b>           Alors quoi ?... Dégagez !... Dégagez !...\r\n                         \r\n<b>                          PÈRE PAULETTE\r\n</b>           Mais je fais ce que je peux !\r\n                         \r\n          La mère, qui semble gênée, se retourne. Le père, lui, sort de la\r\n          voiture et soulève le capot du moteur. Si les piétons continuent à\r\n          marcher, en jetant un regard rapide et indifférent à la voiture,\r\n          les automobilistes, qui sont bloquées par la voiture en panne,\r\n          vocifèrent des propos inintelligibles. Puis ils se rapprochent de\r\n          la voiture, bouscule le père, et commencent à pousser la voiture\r\n          vers le bas-côté. La mère, affolée, sort de la voiture, avec sa\r\n          fille.\r\n                         \r\n          La voiture dévale le bas-côté de la route et s'immobilise dans une\r\n          prairie. Le père court derrière sa voiture.\r\n<b>                          PÈRE PAULETTE\r\n</b>           Ah, les salauds !...\r\n                         \r\n          Il s'approche de la voiture.\r\n                         \r\n<b>                          PÈRE PAULETTE\r\n</b>           Elle est foutue !...\r\n                         \r\n          Paulette se précipite sur la voiture immobilisée, ouvre la\r\n          portière et récupère son petit chien. Elle le cajole et\r\n          pleurnichant.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Mon petit Jock, mon petit chien...\r\n                         \r\n          Ses parents sortent des paquets et des valises de la voiture.\r\n                         \r\n<b>                          MÈRE PAULETTE\r\n</b>           Qu'est-ce qu'on fait ?\r\n                         \r\n<b>                          PÈRE PAULETTE\r\n</b>           Mais ne t'énerve pas, il faut passer le pont.\r\n                         \r\n          La mère voudrait emporter tous leurs bagages. Le père s'interpose.\r\n                         \r\n<b>                          PÈRE PAULETTE\r\n</b>           On peut pas tout prendre. On va pas continuer avec trois\r\n           valises !...\r\n                         \r\n          Paulette, indifférente aux problèmes de ses parents, continue à\r\n          cajoler son chien, en marmonnant, d'une voix un peu\r\n          pleurnicharde : « Mon petit chien... Mon petit chien... »\r\n                         \r\n          La mère ramasse ses baluchons et entraîne sa fille vers la route.\r\n          Le père, chargé lui aussi, les suit, mais marque un temps d'arrêt,\r\n          se retourne, et regarde sa voiture une dernière fois.\r\n                         \r\n          Paulette et ses parents arrivent sur la route où tout le monde\r\n          court. On entend, de nouveau, les bruits d'avion qui se\r\n          rapprochent.\r\n                         \r\n          Dans le ciel, arrivée d'une imposante escadrille d'avions. Les\r\n          avions lâchent de nouveau leurs bombes. On voit les bombes qui\r\n          éclatent au milieu des pauvres « exodiens ».\r\n                         \r\n          Les gens courent dans tous les sens. Une vieille femme se cache\r\n          derrière un arbre.\r\n                         \r\n          Le père, la mère et Paulette, comme d'autres personnes qui les\r\n          entourent, se jettent à terre, entourés de leurs paquets.\r\n                         \r\n          Un cheval, attelé à une charrette, se cabre. Une roue de la\r\n          charrette surchargée casse. Le cheval hennit.\r\n                         \r\n          Sur la route, les bombes soulèvent des nuages de poussière. Le\r\n          bruit effraie le petit chien, qui se libère des bras de Paulette\r\n          et s'enfuit vers le pont.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Jock !... Jock !...\r\n                         \r\n          Paulette l'appelle, puis part à sa poursuite. Sa mère la regarde,\r\n          affolée.\r\n                         \r\n<b>                          MÈRE PAULETTE\r\n</b>           Paulette !... Paulette !...\r\n                         \r\n<b>                          PÈRE PAULETTE\r\n</b>           Paulette !...\r\n                         \r\n          Criant « Paulette !... Paulette !... », la mère, suivie du père,\r\n          se lancent, en courant, à la poursuite de Paulette, qui,\r\n          finalement, rattrape son chien au milieu du pont. Les parents\r\n          rejoignent leur fille, qui cajole son chien dans ses bras.\r\n                         \r\n          Un avion fonce vers eux.\r\n                         \r\n          Le père entraîne sa femme et sa fille à se coucher à côté de lui,\r\n          dans une alcôve ménagée dans le parapet du pont.\r\n                         \r\n          Juste au-dessus d'eux, une affiche est collée sur le parapet, et\r\n          sur laquelle est écrit : « Samedi prochain, au Café des Amis, les\r\n          Maîtres du Mystère : le professeur Olaf et son médium Mlle\r\n          Givrialda. ». L'affiche comporte aussi des portraits des deux\r\n          « artistes ».\r\n                         \r\n          Sur le pont, on peut suivre l'avancée du mitraillage effectué par\r\n          l'avion. A chaque impact correspond une petite giclée de\r\n          poussière. Cette ligne de mitraille atteint la petite famille,\r\n          passe sur le corps du père et de la mère, mais évite Paulette,\r\n          plus petite qu'eux. Le père et la mère pousse un cri. Le père\r\n          retombe, inanimé. La mère a un soubresaut puis se retourne sur le\r\n          côté. Paulette relève la tête et regarde sa mère, ne semblant pas\r\n          comprendre ce qui vient de se passer. Elle lui caresse la joue,\r\n          puis caresse sa propre joue. Elle répétera souvent ce dernier\r\n          geste au cours du film. Elle se redresse lentement, puis se\r\n          recouche à côté de sa mère, la tête appuyée sur son chien, qui est\r\n          agité de légers tremblements. Il a donc, lui aussi, été touché par\r\n          la mitraille. Elle reste un long moment à regarder le visage de sa\r\n          mère, puis elle se redresse de nouveau. Elle ramasse son chien et\r\n          se relève complètement. Le chien n'a plus que quelques\r\n          tremblements convulsifs des pattes arrière. Paulette le cajole et\r\n          l'embrasse.\r\n                         \r\n          Autour de Paulette, les bombes continuent à tomber, sans que cela\r\n          semble la perturber.\r\n                         \r\n          Le cheval fou, effrayé par l'une des dernières bombes tirées par\r\n          les avions qui, maintenant, s'éloignent, se met à trotter en\r\n          traînant sa charrette à une roue derrière lui. Il traverse le\r\n          pont. Paulette fait un écart pour l'éviter. Il est suivi par la\r\n          foule des gens qui ont repris leur exode. Paulette se fait\r\n          bousculer sans ménagement. Un homme d'une cinquantaine d'années,\r\n          tirant une charrette à bras, s'arrête à la hauteur de Paulette.\r\n          Sur la charrette, assise sur un amas de colis hétéroclites, une\r\n          vieille femme au visage revêche.\r\n                         \r\n<b>                          L'HOMME\r\n</b>           Ben, qu'est-ce que tu fais là, toi ? Tu veux te faire\r\n           écraser... Allez, viens ! Allez, grimpe !\r\n                         \r\n          L'homme aide Paulette à monter sur la charrette, puis se\r\n          repositionne entre les brancards de sa charrette et se remet en\r\n          marche. Paulette s'assoit sur les paquets à côté de la vieille,\r\n          qui la regarde d'un air peu aimable et dit en grognant à l'homme :\r\n                         \r\n<b>           LA VEILLE FEMME\r\n</b>           On n'est pas assez chargé comme ça ?\r\n                         \r\n          Elle regarde le chien que Paulette tient dans ses bras. Elle\r\n          cherche à le lui prendre et Paulette résiste.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non !\r\n                         \r\n<b>           LA VEILLE FEMME\r\n</b>           Tu vois pas qu'il est mort !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ah ?... Il est mort ?\r\n          La vieille finit par lui prendre le chien des mains.\r\n                         \r\n<b>           LA VEILLE FEMME\r\n</b>           Mais oui, voyons !\r\n                         \r\n          Elle le jette par-dessus le parapet, dans la rivière.\r\n                         \r\n          Paulette regarde son chien flotter au fil du courant.\r\n                         \r\n          L'homme s'arrête à l'extrémité du pont, gênant un peu le passage\r\n          des automobilistes, qui klaxonnent. Le conducteur d'une\r\n          camionnette est plus insistant que les autres.\r\n                         \r\n<b>                          L'HOMME\r\n</b>           Casse-la moi, ma charrette, et je te fous le feu à ton\r\n           camion.\r\n                         \r\n<b>           LA VEILLE FEMME\r\n</b>           Oh, toi, si tu veux te battre, c'est pas par là, la guerre.\r\n                         \r\n          L'homme se tourne vers elle.\r\n                         \r\n<b>                          L'HOMME\r\n</b>           Et toi, garde ton souffle pour péter !\r\n                         \r\n<b>           LA VEILLE FEMME\r\n</b>           T'occupe pas de mes fesses !\r\n                         \r\n<b>                          L'HOMME\r\n</b>           T'es encore bien contente que je m'en occupe !\r\n                         \r\n          Profitant de la dispute, Paulette descend de la charrette. Elle se\r\n          faufile sous la charrette, puis elle se penche par-dessus le\r\n          parapet, et elle voit son chien qui dérive au fil de l'eau. Elle\r\n          file vers l'extrémité du pont.\r\n                         \r\n<b>          CHEMIN LONGEANT RIVIÈRE - EXTÉRIEUR JOUR\r\n</b>          Le cheval fou, traînant toujours son attelage cassé, galope le\r\n          long de la rivière.\r\n                         \r\n          Paulette descend sur la berge, et commence à trottiner le long de\r\n          la rivière, suivant la progression de son chien, qui flotte dans\r\n          l'eau.\r\n                         \r\n          Un avion passe dans le ciel.\r\n                         \r\n          Le cheval trotte maintenant plus lentement le long de la berge.\r\n                         \r\n          Paulette trottine toujours le long de la rivière en surveillant\r\n          son chien.\r\n                         \r\n          L'avion repasse dans le ciel, et le cheval s'emballe un peu.\r\n                         \r\n          Le chien se rapproche de la berge.\r\n                         \r\n          Le cheval s'éloigne de la rivière et galope à travers champs.\r\n                         \r\n          Paulette se penche pour récupérer son chien, qui est maintenant\r\n          tout près de la berge.\r\n          Le cheval trotte maintenant sur un chemin, mais ralentit son\r\n          allure. Le moyeu de la roue cassée roule sur le bord du chemin.\r\n          Derrière le cheval et sa charrette cassée, Paulette trottine avec\r\n          son chien dans les bras.\r\n                         \r\n<b>          PRÉ DES DOLLÉ - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Un jeune garçon d'une dizaine d'années tire une vache derrière\r\n          lui, pour l'amener dans le pré, où il y a déjà une dizaine\r\n          d'autres vaches. C'est visiblement un petit paysan, culotte de\r\n          velours côtelée à mi-genoux, chemisette rapiécée, béret et\r\n          galoches sans chaussettes. Il tient un bâton à la main. Il s'agit\r\n          de Michel Dollé. Michel s'arrête net en voyant le cheval s'avancer\r\n          dans le champ.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Un cheval !... Qu'est-ce que c'est que ce cheval ?\r\n                         \r\n          Michel court vers le pré voisin, où l'on aperçoit deux paysans et\r\n          une paysanne en pleine fenaison. Les deux hommes sont le père de\r\n          Michel et son fils aîné Georges, et la femme est la mère de\r\n          Georges et Michel. Près d'eux, un mulet attelé à une charrette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Y a un cheval !...\r\n                         \r\n          Les trois paysans lèvent la tête aux cris de Michel, et regardent\r\n          dans la direction qu'il indique.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben oui... Qu'est-ce que c'est que ce... ?\r\n                         \r\n          Le cheval s'est arrêté au milieu des vaches. Georges court vers\r\n          lui. Au loin, on aperçoit un autre fils Dollé, Raymond, qui arrive\r\n          de la ferme.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Attention ! Georges, c'est un cheval de la guerre !\r\n           Touches-y pas !\r\n                         \r\n          Dans le ciel, un avion passe, presque en rase-motte. Georges\r\n          s'arrête de courir et regarde l'avion. Puis il reprend sa course\r\n          vers le cheval. Il s'approche de l'animal et lui tapote\r\n          l'encolure. L'avion revient, et le cheval, affolé, s'emballe et\r\n          renverse Georges. Georges gémit en se tenant le ventre. Ses\r\n          parents et Raymond accourent vers lui.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Ahhh !...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ils t'ont tiré dessus ?\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Et non ! C'est ce putain de cheval !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Je t'avais bien dit, de ne pas y toucher.\r\n          Les parents et Raymond soulèvent Georges pour le transporter à la\r\n          ferme.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Ah !... Ah !... Doucement, bon Dieu !... Vous me faites\r\n           mal... Vous me faites mal !\r\n                         \r\n          Michel les regarde s'éloigner, puis se retourne vers les vaches.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Y'a la Titine qui a foutu le camp !\r\n                         \r\n          En effet, l'une d'entre des vaches se sauve au galop. Michel court\r\n          derrière la vache qui galope vers la rivière.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b><b>           Hé !... Hé !...\r\n</b>                         \r\n<b>          CHEMIN LONGEANT RUISSEAU - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Paulette marche le long d'un ruisseau, qui doit être un affluent\r\n          de la la rivière qui passe sous le pont de la route. Elle serre\r\n          toujours son chien mort contre elle.\r\n                         \r\n          La vache descend vers le ruisseau... et Paulette, qui se met à\r\n          pleurer. La vache s'arrête un instant près de Paulette, puis elle\r\n          s'éloigne. Michel arrive alors que la vache part en trottant dans\r\n          le ruisseau.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b><b>           Hé ! Hé !\r\n</b>                         \r\n          Il s'arrête près de Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Alors, quoi ? Tu pouvais pas l'arrêter ?\r\n                         \r\n          Paulette secoue la tête.\r\n<b>                          PAULETTE\r\n</b>           Non.\r\n                         \r\n          Les deux enfants se regardent, un peu intimidés l'un par l'autre.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'as peur ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'ai pas peur, c'est pas méchant, une vache.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Alors quoi ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je pouvais pas, j'ai mon chien.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Qu'est-ce qu'il a, ton chien ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Il est mort.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           D'où tu viens, toi ?\r\n                         \r\n          Paulette montre une direction assez vague.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Par là.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'es pas d'ici, toi ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non. Et toi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Moi, oui... Où elle est, ta mère ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Elle est morte.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et ton père ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Il est mort.\r\n                         \r\n          Un silence. Michel regarde Paulette, sans savoir trop quoi dire.\r\n          Puis il se dirige vers le ruisseau.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et bien, moi, mon père, il est pas mort ! Et il va me fiche\r\n           une raclée si je ramène pas la vache.\r\n                         \r\n          Il s'arrête au bord de la rive et se tourne vers Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Allez ! Viens ! Aide-moi à la ramener.\r\n                         \r\n          Paulette hésite.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Mais mon chien ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Laisse-le, ton chien, je t'en donnerai un autre.\r\n                         \r\n          Paulette pose le chien au pied d'un fourré, puis elle se dirige\r\n          vers Michel.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Un beau ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Un pas mal.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Où est-ce qu'il est ?\r\n<b>                          MICHEL DOLLÉ\r\n</b>           A la maison.\r\n                         \r\n          Il lui tend la main pour l'aider à traverser le ruisseau. Derrière\r\n          eux, la vache broute tranquillement. Les deux enfants, se tenant\r\n          par la main, courent vers la vache, qui se met à courir devant eux\r\n                         \r\n<b>          FERME DES DOLLÉ - CHEMIN - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Le chemin qui mène à la ferme des Dollé.\r\n                         \r\n          Un chien trottine sur le chemin vers la vache et les enfants.\r\n                         \r\n          La vache marche devant les enfants. Michel tient son bâton d'une\r\n          main et la chaîne de la vache de l'autre.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           C'est ce chien-là que tu vas me donner ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non, celui-là, c'est aux voisins.\r\n                         \r\n          Le chien dépasse les enfants et se retourne. Il grogne un peu.\r\n          Michel lui donne un coup de pied.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Il sait nager ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je sais pas. On est fâchés avec les voisins.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Comment c'est, son nom ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Nous, on l'appelle Gouard. C'est le nom des voisins.\r\n<b>                          PAULETTE\r\n</b>           Et vous, c'est comment, votre nom ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Dollé.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et toi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Michel... Et toi ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'es parisienne, toi ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oui. Et toi ?\r\n                         \r\n          Michel répond d'un ton moins enjoué, visiblement déçu de ne pas\r\n          être Parisien.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Moi, non.\r\n                         \r\n          La vache accélère le pas, obligeant les enfants à accélérer le\r\n          leur.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Les deux enfants, suivant la vache, traversent la cour de la\r\n          ferme.\r\n                         \r\n<b>          FERME DES DOLLÉ - ÉTABLE - INTÉRIEUR JOUR\r\n</b>                         \r\n          La vache entre dans l'étable, où se trouvent déjà d'autres vaches.\r\n          Les enfants entrent derrière elle. Paulette a l'air un peu\r\n          soucieuse.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ton père... le chien, il voudra que je le garde ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je sais pas.\r\n                         \r\n          On entend aboyer un chien. Les enfants ressortent pour regarder.\r\n          Le père Dollé les bouscule pour prendre une fourche.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Le père Dollé, sa fourche à la main, poursuit le chien des Gouard\r\n          à travers la cour. Le chien traverse en courant la passerelle qui\r\n          sépare les deux fermes.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Qu'est-ce que tu viens foutre encore chez moi, chien de\r\n           cocu ?\r\n          Les deux enfants se rapprochent du père Dollé. On aperçoit le père\r\n          Gouard, un seau à la main, dans la cour de sa ferme.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Je t'apprendrai à écouter aux portes !\r\n                         \r\n<b>          FERME DES DOLLÉ ET DES GOUARDS - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Plan sur les cours des deux fermes, avec une passerelle de bois\r\n          entre les deux. Le père Gouard regarde son voisin d'un air\r\n          furieux.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Qu'est-ce qu'il t'a fait, mon chien ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Il m'a fait qu'il vient gueuler chez moi. Et j'ai un\r\n           blessé !\r\n                         \r\n          Le père Gouard ricane.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Tu soignes les blessés, maintenant ? Pour qu'ils crèvent\r\n           plus vite ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           C'est bon pour toi, de faire crever les gens !\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Je fais crever les gens, moi ? Et qui c'est qui te l'a\r\n           tirée de l'eau, ta grand-mère ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Elle était déjà noyée, la grand-mère, quand tu l'as\r\n           sortie !\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Preuve que non, c'est qu'on me l'a donnée, la médaille de\r\n           sauvetage.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Je t'avais rien demandé... Et puis, tu me les casses, avec\r\n           ta médaille de sauvetage.\r\n                         \r\n          Il semble furieux, mais il renonce à discuter plus longtemps. Il\r\n          se retourne et découvre Paulette donnant la main à son fils.\r\n          Paulette semble assez inquiète sous le regard perçant du paysan.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Qu'est-ce que c'est encore, ça ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Elle vient de la route... Son père a été tué, et puis sa\r\n           mère...\r\n                         \r\n          Le père Dollé se rapproche de Paulette, puis il se tourne, un peu\r\n          gêné, vers Michel.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben... Qu'est-ce que tu veux que j'y fasse ?\r\n          Il s'éloigne d'eux. Michel tire Paulette par la main.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           On pourrait peut-être la garder...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           T'es pas fou ? Avec ton frère qui est blessé.\r\n                         \r\n          Michel prend un air hypocritement résigné.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben tant pis... Elle va aller chez les Gouard.\r\n                         \r\n          Dollé sursaute. Il regarde Michel d'un air furieux.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Chez les Gouard ? T'as pas honte ? Pour qu'il demande\r\n           encore une autre médaille ?\r\n                         \r\n          Il pose sa fourche et regarde Paulette en souriant.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Allez, viens, tu vas nous raconter ça...\r\n                         \r\n          Il pousse les deux enfants vers l'entrée de la ferme. Avant\r\n          d'entrer dans la maison, Il se retourne un instant vers la ferme\r\n          des Gouard.\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Michel tient une Paulette un peu apeurée par la main. Elle regarde\r\n          vers le lit où l'on entend Georges qui crie.\r\n                         \r\n           GEORGES DOLLÉ (voix off)\r\n           Et doucement !... Bon Dieu !... Vous me faites mal...\r\n                         \r\n          Les deux enfants, qui se tiennent toujours par la main, s'approche\r\n          du lit, sur lequel on a couché Georges. Son frère Raymond et sa\r\n          soeur Berthe sont en train, assez maladroitement, de lui retirer\r\n          son pantalon. Paulette a l'air assez intriguée par la scène.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Oh, la vache de cheval !... Oh, doucement !...\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ben, aide un peu !...\r\n                         \r\n          Berthe viens enfin de retirer le pantalon de son frère. Elle le\r\n          retourne pour le plier et de la monnaie tombe des poches.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Mes sous !... Faut qu'on ramasse mes sous.\r\n                         \r\n          Georges s'installe dans le lit, aidé par son frère. Berthe se\r\n          penche pour ramasser l'argent tombé de la poche du malade. La mère\r\n          s'approche, un verre à la main.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Un peu de lait, ça ne te fera pas de mal.\r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Il aimerait peut-être mieux de la goutte !\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Oh oui, j'aime mieux !\r\n                         \r\n          Raymond est visiblement le moins brillant, intellectuellement, de\r\n          tous les enfants Dollé. Il borde le lit. La mère se penche vers\r\n          son fils.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Bois, mon pauvre Georges.\r\n                         \r\n          Georges découvre Paulette.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Qui c'est qu'est là... là ?\r\n                         \r\n          Raymond, Berthe et leur mère se tourne vers Paulette.\r\n                         \r\n          Le père repose le verre de vin qu'il venait de boire et s'approche\r\n          de Paulette.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben oui... Ben je vais te dire... Elle vient de la route...\r\n                         \r\n          Il prend Paulette par les épaules. Mais Michel la reprend pour la\r\n          plaquer contre lui.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est moi qui l'ai trouvée.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oh ! Toi !...\r\n                         \r\n          La mère repose le verre de lait, toujours plein, sur la table afin\r\n          de mieux examiner Paulette. Elle s'assoit en face d'elle, pendant\r\n          que le père se coupe une tranche de pain.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ben, qui que c'est ?... Mais elle est habillée en\r\n           dimanche...\r\n                         \r\n          Berthe s'approche de Paulette et tâte le tissu de sa robe.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est du tissu comme ça que je voulais pour ma robe.\r\n                         \r\n          Elle soulève la robe de Paulette, qui lui dégage la main.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non !\r\n                         \r\n          Le père continue à couper des tranches de pain.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ses parents ont été tués sur la route. Alors... elle va\r\n           nous raconter ça.\r\n          Le père tend une tranche de pain à Paulette, mais Michel la saisit\r\n          au passage.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est moi qui lui donne.\r\n                         \r\n          Les autres enfants Dollé entourent Paulette.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est vrai, ça ? Tu vas nous raconter la guerre ?\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           T'as vu des bombardements ?\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           D'où tu viens ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Comment qu'on t'appelles ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Quel âge que t'as ?...\r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Oh ! Ben, tu veux rien nous dire.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'as pas soif ?\r\n                         \r\n          Michel prend le verre de lait sur la table et le tend à Paulette,\r\n          qui le regarde d'un air un peu dégoûté.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tiens !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           C'est sale !\r\n                         \r\n          La mère prend le verre des mains de Michel, et plonge son doigt\r\n          dans le lait.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Oh ! Ben forcément, tiens ! Regarde ton verre, y a une\r\n           mouche.\r\n                         \r\n          La mère retire la mouche du verre et tend le verre à Paulette, qui\r\n          ne le prend pas.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Tiens. Bois... Mais t'as pas soif ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non !\r\n                         \r\n          Paulette semble encore plus dégoûtée.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Elle en veut pas !...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Vous lui faites peur à tourner autour. C'est pas une bête\r\n           curieuse. Allez, faut faire un peu semblant de ne pas\r\n           s'occuper d'elle.\r\n                         \r\n          Tous s'éloignent de Paulette, sauf Michel. Paulette, qui a\r\n          toujours sa tranche de pain à la main, se tourne vers Michel.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel, je suis fatiguée.\r\n                         \r\n          Michel soulève Paulette, un peu difficilement, mais avec beaucoup\r\n          de tendresse, et la dépose sur un lit voisin.\r\n                         \r\n          Fondu au noir\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>                         \r\n          Un peu plus tard.\r\n                         \r\n          Le père est assis sur l'un des deux bancs qui longent la grande\r\n          table, avec Paulette endormie sur les genoux. En face de lui, sur\r\n          l'autre banc, Michel fait ses devoirs. Raymond, assis dans un\r\n          fauteuil, bricole un morceau de bois. Le père lit le journal\r\n          déplié devant lui, et en appui sur une bouteille. Une lampe à\r\n          pétrole, posée sur la table, éclaire la scène.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           « La situation militaire s'était brusquement aggravée sur\r\n           tous les fronts au cours de la journée d'hier. Les\r\n           ministres ont siégé en permanence. »\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ah ! Tu vois !\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ouais...\r\n                         \r\n          Paulette, toujours dans les bras du père Dollé, ouvre un oeil et\r\n          regarde Michel. Celui-ci fait le pitre en calant un crayon sous\r\n          son nez, comme une moustache. Pendant que le père reprend sa\r\n          lecture, Paulette fait semblant de se rendormir en fermant les\r\n          yeux. Michel pose le crayon, fait une petite boulette de papier et\r\n          l'envoie en direction de Paulette.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           « A Bucarest, le Cabinet Tata...res, ou... ». Ça, je m'en\r\n           fous... « La résistance de nos troupes reste souple et\r\n           efficace... L'archevêque de Westminter (il prononce à la\r\n           française : veste-munster) ordonne... »\r\n                         \r\n          Le père s'arrête net de lire, car il vient de recevoir, dans la\r\n          figure, le projectile destiné à Paulette. Il se frotte le nez et\r\n          se tourne vers Michel.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Fais ton problème\r\n                         \r\n          Par-dessus l'épaule du père, on peut lire le journal qu'il lit. Il\r\n          s'agit de « La Montagne ». A la une du journal, le gros titre\r\n          suivant : « Reynaud démissionne. Pétain lui succède. » Michel a\r\n          repris son problème, dont il fait profiter tout le monde.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Un rôti de veau de deux kilos cinq a coûté cent quarante-\r\n           deux francs.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           « Alerte sur Malte... » Tiens !...\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Combien coûterait, à ce prix, une escalope de veau de cent\r\n           cinquante grammes.\r\n                         \r\n          Berthe, qui descend l'escalier du grenier, un oreiller sous le\r\n          bras, arrive derrière Michel et regarde le dos du journal,\r\n          toujours appuyé sur la bouteille.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ah ! Dis donc !\r\n                         \r\n          Le père regarde Paulette.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           La réveille pas.\r\n                         \r\n          Berthe relève la tête.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Le fils Gouard...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Le fils Gouard ?\r\n                         \r\n          Le père retourne le journal. Et sur la dernière page, on voit la\r\n          photo d'un soldat, entre les rubriques « Echos » et Faits\r\n          Divers ». Raymond s'approche du journal\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           T'es folle, ben pourquoi il serait sur le journal, le fils\r\n           Gouard ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Et pourquoi pas ? Si on l'a décoré !\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Décoré ? Le Francis ? Et bien, ça me ferait bien mal.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           En tous cas, il y est, lui, à la guerre !\r\n                         \r\n          Le père replie son journal et regarde sa fille d'un air\r\n          visiblement énervé.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           T'as pas à parler du fils Gouard... Qu'est-ce que tu veux ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Une couverture pour la gosse.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Prends-la... Ben prends-la à Raymond.\r\n                         \r\n          Raymond se précipite vers son lit et s'assoit dessus. Derrière la\r\n          mère Dollé, on aperçoit Renée, la fille cadette, qui essuie la\r\n          vaisselle.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Oh ! Pardon !... Moi, j'en ai pas de trop...\r\n                         \r\n          Michel se tourne vers Berthe.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Prends la mienne...\r\n                         \r\n          Raymond se lève du lit.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           C'est pareil, on a le même lit !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Alors, j'ai le droit de la donner.\r\n          Raymond regarde, d'un air penaud, sa soeur prendre la couverture.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Oh !... Ben non alors !\r\n                         \r\n          Michel retourne vers ses devoirs. Le père regarde Paulette\r\n          endormie avec une certaine tendresse.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Pauvre gosse !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           A cet âge-là, ça se rend pas compte.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Dix-sept, il en est mort, rien qu'aujourd'hui sur le pont,\r\n           et à côté... Ils n'ont même plus de cercueil pour les\r\n           enterrer.\r\n                         \r\n          Le père se tourne vers Georges.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tu vois, c'est pas le moment de mourir, t'auras même pas de\r\n           boîte !\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Qu'est-ce qu'on en fait, des morts ?\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           On fait un trou, et hop !... comme des chiens.\r\n                         \r\n          Le père se penche sur Paulette, qui semble toujours endormie sur\r\n          ses genoux.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Chut !... C'est pas des choses à raconter.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Mais elle dort...\r\n                         \r\n          Le père regarde tendrement Paulette, qu'il tend délicatement à la\r\n          mère.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Allez...\r\n                         \r\n          Celle-ci la prend dans ses bras, et commence à monter l'escalier,\r\n          suivie par Renée et Michel, qui sourit. Le père ramasse son\r\n          journal, se lève, et se dirige vers Georges.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           T'as vu ?\r\n                         \r\n          Il s'assoit sur bord du lit. Georges semble souffrir tellement\r\n          qu'il ne s'aperçoit même pas de sa présence.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           « Un side-car allemand tombé aux mains de nos troupes... »\r\n           Regarde.\r\n          Il tend le journal à Georges, qui soupire sans le regarder.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           T'as mal ?\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Ouais !... Oh ! Je sais pas.\r\n                         \r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR NUIT\r\n</b>                         \r\n          Berthe prépare le lit de Paulette, pendant que la mère la\r\n          déshabille. Paulette, debout, se frotte les yeux. Michel regarde\r\n          la scène.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ce qu'elle est propre !...\r\n                         \r\n          Renée lui sent la chevelure\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           On dirait du parfum.\r\n                         \r\n          Berthe la sent à son tour.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ben non, c'est qui sont propres.\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           Elle ne s'habituera jamais ici.\r\n                         \r\n          La mère couche Paulette sur le lit.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pourquoi qu'elle s'habituerait pas ?\r\n                         \r\n          La mère borde le lit, aidée par Berthe.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Tu voudrais bien la garder, toi, hein ?\r\n                         \r\n          Elle se tourne vers ses enfants.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Allez, hop ! Descendez !\r\n                         \r\n          Elle prend la lampe à pétrole et descend l'escalier, en poussant\r\n          ses filles devant elle. Michel ferme la marche. Paulette se\r\n          retourne dans son lit.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'ai peur... Je ne veux pas rester dans le noir.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'auras qu'à crier Michel. Je reviendrais.\r\n                         \r\n          Il continue à descendre. Paulette chuchote :\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel !...\r\n          Michel tourne la tête avant de disparaître complètement dans\r\n          l'escalier.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Plus fort...\r\n                         \r\n          Paulette hausse la voix.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel !...\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Comme ça !\r\n                         \r\n          Michel descend l'escalier.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel !...\r\n                         \r\n          Paulette a maintenant des larmes dans la voix.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel !... Michel !...\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>                         \r\n          Michel s'approche du lit de son frère, sur lequel le père est\r\n          toujours assis. On entend Paulette appeler du grenier.\r\n                         \r\n           PAULETTE (voix off)\r\n           Michel !... Michel !...\r\n                         \r\n          Le père se tourne vers Michel.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Qu'est-ce qu'elle veut ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je sais pas, elle m'appelle.\r\n                         \r\n           PAULETTE (voix off)\r\n           Michel !...\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Ah ! Faites-la taire, Bon Dieu !\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Allez, fais-la taire !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et mon problème ?\r\n                         \r\n           PAULETTE (voix off)\r\n           Michel !...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Fais ce qu'on te dit.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Bon... je ferai pas mon problème.\r\n          Michel remonte l'escalier.\r\n                         \r\n           PAULETTE (voix off)\r\n           Michel !... Michel !...\r\n                         \r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR NUIT\r\n</b>                         \r\n          Dans la pénombre, Michel s'approche du lit et se penche vers\r\n          Paulette.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'y vois rien.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ferme les yeux, compte jusqu'à dix et tu verras... Combien\r\n           j'ai de doigts ?\r\n                         \r\n          Michel met sa main sous le nez de Paulette, qui s'est légèrement\r\n          redressée, appuyant sa joue sur son poing fermé.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je te dis que je n'y vois rien.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Alors, tu sais pas compter.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Trois !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu vois bien qu'on y voit.\r\n                         \r\n          Paulette tire la langue à Michel.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pourquoi tu me tires la langue ?\r\n<b>                          PAULETTE\r\n</b>           Pour voir si tu y vois.\r\n                         \r\n          La pièce est brusquement éclairée d'une vive lumière, suivie du\r\n          bruit d'un bombardement. Michel se lève et se précipite vers la\r\n          lucarne.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oh ! Une fusée... Viens voir.\r\n                         \r\n          Paulette se cache sous la couverture.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'ai peur, il faut se coucher par terre.\r\n                         \r\n          Michel se tourne vers Paulette, toujours cachée sous sa\r\n          couverture.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu as peur quand il fait noir, et puis tu as peur quand ça\r\n           éclaire !\r\n          Paulette sort la tête de sa couverture.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ça éclaire encore ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non.\r\n                         \r\n          Une vive lumière sort de la lucarne. Paulette se recache.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Menteur !...\r\n                         \r\n          Michel ferme le volet intérieur de la lucarne.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Bon... Voilà...\r\n                         \r\n          La pièce est très sombre tout à coup. Michel se dirige vers le lit\r\n          et soulève la couverture, découvrant le visage apeuré de Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est fini, je te jure.\r\n                         \r\n          Paulette se redresse légèrement, et s'appuie la joue sur la main.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je veux pas rester ici.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'es bien forcée. Où tu veux aller ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je veux retrouver ma maman et mon papa... sur le pont.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ils y sont plus sur le pont.\r\n<b>                          PAULETTE\r\n</b>           Pourquoi ?.. Où ils sont ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Dans un trou.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Dans un trou ?\r\n                         \r\n          Michel semble gêné.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et hop ! Comme des chiens ?\r\n                         \r\n          Michel semble surpris : il ne savait pas que Paulette, qu'il\r\n          croyait endormie, avait entendu les réflexions stupides de son\r\n          frère.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben... oui...\r\n                         \r\n          Paulette s'allonge sur son lit.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           A cause de la pluie... Dans un trou... Pour pas qu'ils\r\n           soient mouillés ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ça doit être pour ça...\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Mais alors, mon chien... Michel... Il va être mouillé.\r\n                         \r\n          Paulette ferme les yeux et s'endort.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu dors ?... Tu n'as plus peur ?... Je peux m'en aller ?...\r\n                         \r\n          Il se lève lentement et se dirige vers l'escalier, qu'il descend\r\n          sur la pointe des pieds.\r\n                         \r\n<b>                         FONDU ENCHAÎNÉ\r\n</b>                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>                         \r\n          Nous sommes au milieu de la nuit. Toute la famille Dollé dort...\r\n          et ronfle ! Michel et Raymond dorment dans le même lit.\r\n                         \r\n          Un papillon vole dans la pièce. On suit son ombre projetée sur le\r\n          mur par la lampe qui est restée allumée sur la table de nuit de\r\n          Georges qui, lui, ne dort pas. Le papillon, attiré par la lumière,\r\n          finit par tomber dans le verre de la lampe à pétrole, où il meurt\r\n          instantanément. On entend Paulette crier : elle a certainement\r\n          fait un cauchemar. Georges sursaute, et se tourne vers le lit de\r\n          ses frères.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Michel !... Michel, je te dis !...\r\n                         \r\n           PAULETTE (pleurnichant en voix off)\r\n           Papa !... Maman !... Maman !... Maman !...\r\n                         \r\n          Comme Michel ne semble entendre, ni son frère, ni Paulette,\r\n          Georges attrape un paquet de petits beurres posé au milieu des\r\n          médicaments sur la table de nuit et le lance en direction de\r\n          Michel.\r\n                         \r\n          Michel reçoit le paquet sur la tête et se réveille en sursaut en\r\n          se frottant les yeux. Il semble un peu affolé. Il porte une longue\r\n          chemise de nuit rapiécée.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Qu'est-ce qu'il y a ?\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Tu l'entend pas ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Qui ça ?\r\n           GEORGES DOLLÉ (d'une voix furieuse)\r\n           Je veux pas qu'elle crie !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Gueule pas comme ça.\r\n                         \r\n          Il se lève, prend la lampe sur la table de nuit de son frère et\r\n          monte l'escalier. On entend Paulette gémir.\r\n                         \r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR NUIT\r\n</b>                         \r\n          Michel s'assied sur le bord du lit, près de la tête de Paulette.\r\n          Il lui caresse le front.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pourquoi que tu cries ? T'as peur ?\r\n                         \r\n          Paulette semble un peu absente. Elle n'est visiblement qu'à moitié\r\n          réveillée.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Alors, faut pas crier comme ça.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je crie pas.\r\n                         \r\n          Paulette ferme les yeux. Michel recouvre soigneusement Paulette,\r\n          qui s'est rendormie, le visage serein. Puis il redescend sans\r\n          bruit.\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>                         \r\n          Michel s'approche du lit de Georges et repose la lampe sur la\r\n          table de nuit.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ça y est, je lui ai expliqué. Elle dort.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Et moi, je dors pas.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Si tu veux, moi non plus, je dormirai pas... Tu veux que je\r\n           te lise le journal ?\r\n                         \r\n          Georges hoche à peine la tête. Michel rapproche une chaise du lit,\r\n          prend le journal que le père a laissé sur le lit, et demande :\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Qu'est-ce que je te lis ?... La guerre ?...\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Ah non ! Pas la guerre ! Le feuilleton.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           « Il était encore trop tôt pour donner le signal du départ.\r\n           Néanmoins, ceux des compagnons qui devaient faire la route\r\n           à cheval... »\r\n                         \r\n          Georges lève la main.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Parle pas de cheval.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Bon, je te lis après... « Et pourtant, toutes les\r\n           précautions avaient été prises à l'extérieur de l'ha...\r\n           l'ha...cienda... »\r\n                         \r\n          Les deux frères font une petite moue, car ni l'un, ni l'autre, ne\r\n          semble comprendre ce mot étranger.\r\n                         \r\n          Fondu au noir\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le lendemain matin.\r\n                         \r\n          Michel est assis à table et boit son bol de lait. En face de lui,\r\n          Berthe coupe des morceaux de pain et les dépose dans un bol.\r\n          Derrière Michel, la mère est en train de refaire son lit. Le coq\r\n          chante et Georges gémit faiblement dans son lit. Michel se lève et\r\n          contourne la table.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette !...\r\n                         \r\n          Il s'essuie la bouche sur un torchon posé sur la table et se\r\n          dirige vers l'escalier, devant lequel il s'arrête. Il lève la\r\n          tête.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'es pas encore levée ?\r\n           PAULETTE (voix off provenant du grenier)\r\n           Je m'habille.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Dépêche-toi.\r\n                         \r\n           LA MÈRE DOLLÉ (voix off du fond de la pièce)\r\n           Criez pas si fort.. Vous voyez bien qu'il y a un malade.\r\n                         \r\n          Paulette descend l'escalier en enfilant sa robe, et accompagnée du\r\n          chien. Arrivée en bas, elle se dirige vers le lit de Georges, qui\r\n          toussote.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oh !... Qu'est-ce qu'il a, le monsieur ?\r\n                         \r\n          Georges caresse doucement la joue de Paulette qui continue à\r\n          s'habiller.\r\n                         \r\n           LA MÈRE DOLLÉ (voix off)\r\n           Il a reçu un coup de pied de cheval.\r\n          Paulette pointe le doigt vers le crucifix accroché au mur au-\r\n          dessus du lit.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Qu'est-ce que c'est, ça ?\r\n                         \r\n           LA MÈRE DOLLÉ (voix off)\r\n           C'est le Bon Dieu.\r\n                         \r\n          La mère semble choquée par la question de la fillette et\r\n          s'approche d'elle.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           T'en as jamais vu ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Si, mais je savais pas ce que c'était.\r\n                         \r\n          La mère s'approche de Paulette et la pousse vers la table.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Viens boire ton lait.\r\n                         \r\n          Michel, qui s'est rassis à table devant son bol, sourit à\r\n          Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Bonjour.\r\n                         \r\n          La mère assoit Paulette à côté de Berthe, qui verse du lait dans\r\n          le bol de la fillette, qui sourit à Michel.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Elle sait pas ce que c'est que le Bon Dieu.\r\n                         \r\n          Georges se redresse de son oreiller, et dit, d'une voix peu\r\n<b>                         AIMABLE :\r\n</b><b>                          GEORGES DOLLÉ\r\n</b>           J'ai soif.\r\n                         \r\n          La mère est en train de coiffer Paulette. Berthe regarde sa mère.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est à se demander d'où elle sort.\r\n<b>                          (A PAULETTE)\r\n</b>           D'où tu viens ?\r\n                         \r\n          Michel baisse son bol pour répondre.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est une parisienne.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Pauvre gosse !\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Faudra la faire baptiser.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ben, en attendant, faut la déclarer au maire.. Ils nous\r\n           accuseraient bien de l'avoir volée.\r\n                         \r\n          Elle verse du vin dans un verre.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est pas au maire qu'il faut aller. C'est aux gendarmes.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           « Mairerie » ou gendarmerie, y faut leur dire.\r\n                         \r\n          Elle repose la bouteille sur la table et se dirige vers le lit de\r\n          Georges.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           J'irai, moi, aux gendarmes.\r\n                         \r\n           LA MÈRE DOLLÉ (voix off)\r\n           Toi, occupe-toi de tes vaches.\r\n                         \r\n          Berthe finit de coiffer Paulette, qui sourit à Michel.\r\n                         \r\n          Michel se lève et se tourne vers Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu viens avec moi ?\r\n                         \r\n          Paulette récupère les morceaux de pain dans son bol et les mange.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Attends, j'ai pas fini.\r\n                         \r\n          Michel ouvre la porte et sort.\r\n                         \r\n          Paulette continue à manger tranquillement.\r\n                         \r\n          Raymond entre, poussant un vieux vélo, qu'il dépose contre le mur.\r\n          Il a, sur la tête, un chapeau feutre gris. Il tient quelque chose\r\n          caché derrière son dos. Il s'approche du lit de Georges.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Regarde !...\r\n                         \r\n          Georges se redresse sur son lit.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Regarde ce qu'ils lâchent sur la route, les Parisiens.\r\n                         \r\n          Il enlève le feutre, et, à la place, pose sur sa tête un élégant\r\n          chapeau noir à bords roulés, celui qu'il cachait derrière son dos.\r\n          Il fait le pitre.\r\n                         \r\n          Georges rit malgré sa douleur, surtout lorsque son frère met le\r\n          chapeau de travers, en singeant Napoléon, une main glissée dans\r\n          l'échancrure de sa chemise.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Me fais pas rire... Me fait pas rire... ça me fait mal.\r\n                         \r\n          Raymond met le chapeau sur la tête de Georges, qui ne peut\r\n          s'empêcher de continuer à rire, malgré la douleur qui lui tiraille\r\n          le ventre.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Tiens !... Comme ça, tu le verras pas.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Me fait pas rire... Oh ! Bon Dieu, j'ai mal !\r\n                         \r\n          Il se recouche. La mère s'approche du lit.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et le docteur ?\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ah oui, le docteur. Mobilisé à l'hôpital. C'est la cause au\r\n           bombardements.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Ce que j'ai besoin, c'est pas le docteur, c'est les pompes\r\n           funèbres.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           T'en fais pas... Y a toujours le vieux corbillard... En le\r\n           reclouant un peu.\r\n                         \r\n          Les deux frères rient ensemble, et Georges plus fort que Raymond.\r\n                         \r\n<b>                         FONDU ENCHAINÉ\r\n</b>                         \r\n<b>          CHEMIN LONGEANT RUISSEAU - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Paulette se dirige vers l'endroit où elle a, la veille, déposé le\r\n          cadavre de son chien, une petite binette à la main.\r\n                         \r\n<b>                         NOTE\r\n</b>          La scène suivante, présente dans la toute première version\r\n          originale du film, a été coupée dans toutes les copies présentées\r\n          ultérieurement. Peut-être a-t-on estimé que de montrer Paulette en\r\n          train de faire danser le cadavre de son chien était un peu trop\r\n          macabre.\r\n                         \r\n          Paulette tient son chien par les pattes de devant, pour le faire\r\n          tenir debout sur les pattes arrière. La binette est posée à côté\r\n          d'elle.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Fais le beau !\r\n                         \r\n          Elle essaie de le faire danser, puis, tout à coup, elle le laisse\r\n          retomber par terre. Elle soulève sa robe et regarde un insecte qui\r\n          grimpe sur sa jambe. L'insecte s'envole et va se poser sur une\r\n          fleur de liseron. Elle veut cueillir la fleur, mais tirant un peu\r\n          trop fort, c'est toute une guirlande de liseron qu'elle arrache.\r\n          Elle se tourne vers le chien, puis, après un instant d'hésitation,\r\n          elle lui entoure le cou avec la guirlande de liseron. Elle le\r\n          soulève de nouveau par les pattes de devant.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Fais le beau ! Danse !\r\n          Elle danse avec le chien en chantonnant. Puis, lassé par ce jeu,\r\n          elle s'arrête, repose le chien, prend la binette et commence à\r\n          creuser.\r\n                         \r\n<b>                         NOTE\r\n</b>          Retour à la version normale du film, telle qu'elle est présentée\r\n          dans toutes les copies existantes.\r\n                         \r\n          Paulette s'agenouille près du cadavre de son chien, posé sur\r\n          l'herbe. Elle pose la binette à côte du chien et le caresse\r\n          délicatement. Puis elle se caresse la joue, comme elle l'avait\r\n          fait après avoir caressé la joue de sa mère décédée. Elle déplace\r\n          légèrement le chien, prend la binette et commence à creuser. Tout\r\n          à coup, elle tourne la tête, car elle vient d'entendre un bruit de\r\n          sonnette.\r\n                         \r\n          Le curé du village arrive sur sa bicyclette, et se dirige vers la\r\n          rivière, et vers Paulette.\r\n                         \r\n          Paulette pose sa binette et ramasse son chien.\r\n                         \r\n          Le curé descend de vélo, terminant à pied, le vélo à la main, le\r\n          petit raidillon qui descend vers le ruisseau.\r\n                         \r\n          Paulette met le chien derrière son dos et le maintient en place\r\n          avec ses deux mains.\r\n                         \r\n          Le curé porte son vélo pour traverser le ruisseau. Puis, arrivé\r\n          sur l'autre rive, il le repose et s'approche de Paulette.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Je ne te connais pas, moi ?... Tu n'es pas d'ici ?\r\n                         \r\n          Paulette recule de façon à se plaquer le dos contre un arbre,\r\n          tenant toujours, à deux mains, le chien caché derrière elle. Elle\r\n          regarde le curé d'un air inquiet et méfiant. Ce dernier sourit, et\r\n          se penche vers Paulette, appuyé sur son vélo.\r\n<b>                          LE CURÉ\r\n</b>           Tu as perdu ta langue ?\r\n                         \r\n          Paulette fait « non » de la tête.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Où habites-tu ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Chez Monsieur Dollé. Papa est mort, et maman aussi.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Pauvre enfant... Leur as-tu dis une prière, au moins ?\r\n                         \r\n          Paulette fait « non » de la tête.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Tu ne veux pas en dire une ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je sais pas quoi dire.\r\n<b>                          LE CURÉ\r\n</b>           Il faut apprendre... Mets tes mains comme ceci.\r\n                         \r\n          Le curé joint les mains. Paulette regarde les mains du curé, mais\r\n          ne bouge pas.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Non ?... Alors, répète : « Que le Bon Dieu les reçoive dans\r\n           son Paradis. »\r\n                         \r\n<b>                          PAULETTE\r\n</b>           « Que le Bon Dieu les reçoive dans son Paradis. »\r\n                         \r\n          Le curé fait le signe de la croix.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Au nom du Père, du Fils et du Saint-Esprit. Ainsi soit-il.\r\n                         \r\n          Paulette répète la phrase du curé, mais sans se signer.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Au nom du Père, du Fils et du Saint-Esprit. Ainsi soit-il.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Fais comme moi.\r\n                         \r\n          Le curé refait un signe de croix.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Tu ne veux pas ? Michel t'apprendra... Il apprend bien son\r\n           catéchisme, Michel.\r\n                         \r\n          Au nom de Michel, Paulette esquisse un sourire. Le curé s'éloigne\r\n          en poussant sa bicyclette. Paulette le regarde partir, tenant\r\n          toujours son chien caché derrière son dos. Lorsqu'elle estime que\r\n          la voix est libre, elle se dégage de l'arbre.\r\n           MICHEL DOLLÉ (criant en voix off)\r\n           Paulette !...\r\n                         \r\n          Michel s'avance à travers bois, mais il ne voit pas Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette !...\r\n                         \r\n          Paulette ne lui répond pas. Elle prend son chien dans ses bras,\r\n          ramasse sa binette, et s'éloigne du ruisseau.\r\n                         \r\n           MICHEL DOLLÉ (criant en voix off)\r\n           Paulette !...\r\n                         \r\n          Michel continue à chercher dans la forêt.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette !...\r\n                         \r\n          Paulette traverse le ruisseau et marche le long de la berge.\r\n                         \r\n          Michel continue à chercher.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette !...\r\n                         \r\n<b>          MOULIN - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Paulette se dirige vers un vieux moulin à eau désaffecté, mais\r\n          dont la bâtisse semble encore solide. Elle entre à l'intérieur du\r\n          moulin.\r\n                         \r\n           MICHEL DOLLÉ (criant en voix off)\r\n           Paulette !...\r\n                         \r\n<b>          MOULIN - INTÉRIEUR JOUR\r\n</b>                         \r\n          Paulette entre dans le moulin. Au fond du moulin, la grande roue,\r\n          totalement immobile. Paulette cherche un endroit pour enterrer son\r\n          chien.\r\n                         \r\n<b>          CHEMIN LONGEANT RIVIÈRE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel se dirige vers le moulin. On aperçoit une autre roue, elle\r\n          aussi immobile, à l'extérieur du moulin.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette !...\r\n                         \r\n<b>          MOULIN - INTÉRIEUR JOUR\r\n</b>                         \r\n          Paulette pose son chien et commence à creuser le sol en terre\r\n          battue. Derrière elle, Michel entre dans le moulin.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette !...\r\n                         \r\n          Michel s'approche de Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ah ! Dis... Qu'est-ce que tu fais là ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ça ne te regarde pas.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je te cherche partout... Tu fais un trou ?\r\n                         \r\n          Elle ne lui répond pas et continue à creuser.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ah !... C'est pour ton chien. Donne...\r\n                         \r\n          Il cherche à lui prendre la binette des mains, mais elle résiste\r\n          un peu.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Donne... c'est trop dur...\r\n                         \r\n          Elle finit par céder, et Michel se met à creuser un peu plus\r\n          énergiquement que Paulette. Après quelques coups de binette, il\r\n          s'arrête de creuser et regarde Paulette.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ça, c'est une idée... On va faire un beau petit cimetière.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Qu'est-ce que c'est qu'un cimetière ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est là qu'on met les morts pour qu'ils soient tous\r\n           ensemble.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi on les met ensemble ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pour pas qu'ils s'embêtent.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Mais alors, mon chien, il va s'embêter, tout seul ?\r\n                         \r\n          Michel réfléchit une seconde et hausse les épaules.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben... oui...\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Faudra lui en trouver un autre !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Un autre chien... ça, c'est difficile.\r\n                         \r\n          Un bruissement d'ailes fait lever la tête de Michel. Paulette\r\n          regarde dans la direction où regarde Michel.\r\n                         \r\n          Dans la charpente du moulin, un hibou, posé sur une poutre, semble\r\n          observer les enfants.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Qu'est-ce que c'est ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est Monsieur le Maire.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est son nom... c'est un hibou.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           C'est méchant ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non, ça roupille tout le temps... Tu vas voir.\r\n                         \r\n          Michel se dirige vers une échelle qui permet d'accéder au hibou.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Faut pas le tuer.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Penses-tu ! Ça serait même pas la peine, ça vit cent ans.\r\n                         \r\n          Paulette fait une petite moue, semblant incapable de réaliser ce\r\n          que représente cent ans.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Cent ans !...\r\n                         \r\n          Michel grimpe vers le hibou.\r\n                         \r\n          Paulette dépose son chien dans le trou creusé par Michel, puis\r\n          commence à le recouvrir de terre. Tout en travaillant, elle récite\r\n          la prière que lui a apprise le curé. A chaque fois qu'elle dit\r\n          « Au nom du Père, du Fils et du Saint-Esprit », elle fait un\r\n          rapide signe de croix.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Que le Bon Dieu le reçoive dans son Paradis. Au nom du\r\n           Père, du Fils et du Saint-Esprit. Ainsi soit-il... Que le\r\n           Bon Dieu le reçoive dans son Paradis. Au nom du Père, du\r\n           Fils et du Saint-Esprit. Ainsi soit-il... Que le Bon Dieu\r\n           le reçoive dans son Paradis. Au nom du Père, du Fils et du\r\n           Saint-Esprit. Ainsi soit-il...\r\n                         \r\n          Michel atteint le nid du hibou sur la poutre. On entend, de loin,\r\n          Paulette qui continue à psalmodier ses « Que le Bon Dieu... etc. »\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Toi, ne bouge pas...\r\n                         \r\n          Michel glisse la main derrière le hibou, dans son nid. Il sort une\r\n          taupe morte qu'il tient par la queue.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je t'en donnerai une autre.\r\n                         \r\n          Michel redescend vers Paulette, en tenant la taupe par la queue.\r\n          Il a maintenant atteint le bas de l'échelle. Il s'approche de\r\n          Paulette, tenant toujours la taupe par la queue. Paulette continue\r\n          à psalmodier ses prières tout en comblant la tombe de son chien.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           J'ai une taupe !... Une belle !...\r\n                         \r\n          Paulette se redresse et regarde la taupe.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Il en faudra d'autres.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est pas ce qui manque, les taupes.\r\n                         \r\n          La voix de Paulette se fait presque geignante lorsqu'elle dit :\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Des chats...\r\n                         \r\n          Michel, lui, énumère, sur un timbre de voix nettement plus posé :\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Des hérissons, des lézards...\r\n                         \r\n          Paulette n'est visiblement plus dans son état normal.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Des chevaux, des vaches...\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Des serpents à sonnette.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Des lions.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Des tigres.\r\n                         \r\n          Paulette a presque des sanglots dans la voix lorsqu'elle dit :\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Des gens !...\r\n                         \r\n          Paulette a le souffle un peu court. Michel a l'air un peu surpris\r\n          par les derniers mots de Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Si tu veux... Et puis on leur mettra des croix.\r\n                         \r\n          Michel reprend la binette, et creuse un autre trou pour la taupe.\r\n          Paulette s'est accroupie pour le regarder creuser.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi des croix ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben dis donc !... Qu'est-ce qu'ils t'ont appris, tes\r\n           parents ?... Tu vas voir.\r\n          Il pose la binette, prend un morceau de bois, qu'il casse en deux,\r\n          et en fait une croix, qu'il lie avec du fil de fer.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Regarde... Tiens... Regarde... Là... C'est ça, une croix.\r\n                         \r\n          Il plante la croix sur la tombe du chien.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           C'est le Bon Dieu.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben oui... C'est le Bon Dieu.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Attends.\r\n                         \r\n          Elle sort un collier de sa poche.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Il est joli, ton collier.\r\n<b>                          PAULETTE\r\n</b>           Il est cassé.\r\n                         \r\n          Elle entoure la croix de son collier. Michel semble ravi.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est mieux.\r\n                         \r\n          Il arrange le collier autour de la croix.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oui... mais il y en a une plus belle au-dessus de ton\r\n           frère.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu la trouves belle, toi ?\r\n                         \r\n          Paulette fait « oui » de la tête.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je t'en ferai des encore mieux, moi. Avec des clous et un\r\n           marteau.\r\n                         \r\n          D'un grand geste des bras, il désigne toute la pièce.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et on en foutra partout !\r\n                         \r\n<b>                         FONDU ENCHAÎNÉ\r\n</b>                         \r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR JOUR\r\n</b>                         \r\n          Michel est assis par terre les jambes écartées. Ils cloue deux\r\n          lattes de bois ensemble en forme de croix. Paulette, assise sous\r\n          la table, inspecte les potirons entreposés dans le grenier. Elle\r\n          rit de la forme étrange du fruit qu'elle tient dans ses mains\r\n<b>                          PAULETTE\r\n</b>           Oh !... Regarde celle-là.\r\n                         \r\n          Michel détache la croix clouée sur le plancher, mais l'une des\r\n          lattes se fend en deux.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Zut !... Faut que je recommence... Recommence aussi, tu les\r\n           sais pas bien.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je vous salue, Marie pleine de grâce...\r\n                         \r\n          Michel cloue une autre croix.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Le Seigneur est avec vous.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Vous êtes bénie entre toutes les femmes, et Jésus, le fruit\r\n           de vos... de vos...\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Entrailles est béni !\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le Père Dollé, assis à table, où il coupe des tranches de pain,\r\n          lève des yeux agacés vers le plafond, et le grenier, où l'on\r\n          entend les coups de marteau de Michel. La Mère Dollé s'affaire\r\n          devant la cheminée. Les filles mettent le couvert. Raymond est\r\n          assis sur un escabeau près du lit de Georges.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Des prières !... Il en a de bonnes, le curé.\r\n<b>                          (A RAYMOND)\r\n</b>           Tu les sais, toi, tes prières ?\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Comment qu'on y disait déjà à la grand-mère ?... « Notre\r\n           Père qui êtes aux Cieux... »\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           A la grand-mère, on y disait : « Marie... je vous salue,\r\n           Marie... »\r\n                         \r\n          Georges, immobile dans son lit, les mains croisées sur le ventre,\r\n          réagit d'une voix affaiblie.\r\n                         \r\n<b>                          GEORGES DOLLÉ\r\n</b>           Je ne veux pas qu'on me dise Marie !\r\n                         \r\n          Les coups de marteau continuent de plus belle. Le père lève les\r\n          yeux vers le plafond.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Qu'est-ce qu'ils foutent là-haut ?\r\n                         \r\n          Toute la famille, sauf Georges, lève les yeux vers le plafond.\r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Le curé, il a dit : du calme !\r\n                         \r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR\r\n</b>                         \r\n          Les enfants n'ont pas changé de position.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Dis, Michel, qu'est-ce que c'est, les entrailles ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Les entrailles ?... Ça doit être là où Georges est\r\n           blessé... Continue.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et Jésus, le fruit de vos entrailles, est blessé...\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Est béni !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Est béni... Après ?\r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est fini. Dis « Amen ».\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Amen. Pourquoi qu'elles finissent toutes pareilles.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ça veut dire que c'est fini. Recommence.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ameeeen !...\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Recommence tout.\r\n                         \r\n          Michel inspecte la croix qu'il vient de terminer. Derrière lui, on\r\n          voit le Père Dollé apparaître en haut de l'escalier, sans que les\r\n          enfants le remarquent.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Notre Père, qui êtes aux Cieux, que votre nom soit\r\n           sanctifié... sanctifié...\r\n                         \r\n          Michel, qui a recommencé à clouer, dit d'une voix un peu énervé :\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Que votre règne arrive.\r\n                         \r\n          Le Père Dollé balance, à Michel, une baffe qui l'envoie valdinguer\r\n          sur le plancher.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tiens, le v'là ! Je t'apprendrai à cogner avec un marteau.\r\n           Tu sais pas qu'il lui faut du calme.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Mais je lui apprenais ses prières... Oh ben, zut alors !\r\n          Paulette semble affolée par cette scène de violence physique.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je les sais pas !... Je les sais pas !...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ses prières ?\r\n                         \r\n          Le Père ramasse une croix.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Et ça, c'est des prières ? Tu fais des croix dans la maison\r\n           d'un malade ? Tu veux le faire mourir ?\r\n                         \r\n          Il prend Paulette par la main et l'entraîne vers l'escalier.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Et puis, je veux plus vous voir ensemble.\r\n                         \r\n          Michel se relève en se tenant la joue et suit son père, qui, déjà\r\n          engagé dans l'escalier, se tourne vers lui.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Toi, reste là. Tu es puni. Tu te coucheras sans manger.\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>                         \r\n          Berthe apporte une marmite fumante sur la table. La Mère Dollé\r\n          prend la louche et sert la soupe à Raymond. Renée est assise à\r\n          côté de lui. On entend Georges qui râle dans son lit. Berthe\r\n          s'assoit entre Raymond et Renée, en face de sa mère.\r\n                         \r\n           LA MÈRE DOLLÉ (à Georges)\r\n           Ben alors, qu'est-ce que t'as donc ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Tu réponds pas à ta mère ?\r\n                         \r\n          Elle tend son assiette à sa mère, qui la sert. Georges continue à\r\n          râler.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ça va pas ?\r\n                         \r\n          Il se lève et s'approche du lit. Il se penche sur son frère.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Tu craches ?\r\n                         \r\n          Il se tourne vers les autres.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Il crache un peu de sang.\r\n                         \r\n          La mère, qui se servait la soupe après avoir servi Renée, se lève\r\n          et rejoint Raymond auprès du lit.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Et puis, je comprends plus ce qu'il dit... Hé !... Il\r\n           crache encore.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ben, qu'est-ce que t'as ?\r\n                         \r\n          Le père Dollé arrive en bas de l'escalier, tenant Paulette par la\r\n          main. Il tourne la tête vers le grenier.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tu boufferas pas !\r\n                         \r\n          Les deux filles rejoignent leur mère près du lit. Le père Dollé\r\n          lâche Paulette et s'approche à son tour du lit. Toute la famille,\r\n          sauf Michel et Paulette, entoure maintenant le lit\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Qu'est-ce que t'as ?\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Y réponds pas.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           C'est la première fois que je vois cracher du sang.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Faudra nettoyer les draps.\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           Donnes-y un mouchoir.\r\n                         \r\n          Le père Dollé contourne ses filles et rejoint sa femme et son fils\r\n          Raymond à la tête du lit.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Alors, ça va mieux ?\r\n                         \r\n          La mère essuie la bouche de Georges, qui râle de plus en plus\r\n          faiblement.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Tape-lui dans le dos.\r\n                         \r\n          Raymond tapote le dos de son frère.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Un peu de tisane ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ça doit être le coeur.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           C'est quand même malheureux qu'avec tant de monde, on\r\n           n'arrive pas à lui trouver un bout de prière.\r\n                         \r\n          Paulette s'est assise à table et mange sa soupe.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel, il les sait.\r\n                         \r\n          Toute la famille se tourne vers elle, comme si, tout à coup, ils\r\n          avaient oublié sa présence. Le père est le premier à réagir.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           T'as raison.\r\n                         \r\n          Le Père Dollé se dirige vers l'escalier et lève la tête vers le\r\n          grenier.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Michel !\r\n                         \r\n          Michel est assis sur les dernières marches en haut de l'escalier.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je suis puni.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Je te dis de descendre.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Alors, je suis plus puni ?\r\n          Michel descend l'escalier en faisant claquer ses galoches.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Mets-toi dans le coin et dis tes prières.\r\n                         \r\n          Michel se dirige vers le coin indiqué par son père, puis il se\r\n          rapproche de la table et s'assoit sur le banc à côté d'une grosse\r\n          miche de pain.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Et à genoux !\r\n                         \r\n          Michel fait semblant de ne pas entendre le dernier ordre de son\r\n          père, et reste assis sur le banc, ne quittant pas la miche de pain\r\n          des yeux. Il commence à réciter ses prières, mais s'amuse à\r\n          mélanger les paroles du « Notre Père » et du « Je vous salue,\r\n          Marie ».\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Notre Père qui êtes aux Cieux. Vous êtes bénie entre toutes\r\n           les femmes, donnez-nous aujourd'hui notre pain quotidien,\r\n           et Jésus, le fruit de vos entrailles, est béni. Priez pour\r\n           nous, pauvres pécheurs, que votre nom soit sanctifié, que\r\n           votre volonté soit pleine de grâce. Notre Père, Sainte Mère\r\n           de Dieu, donnez-moi du pain... donnez-moi du pain...\r\n                         \r\n          Il a prononcé les deux dernières phrases d'une voix rageuse. Il\r\n          arrache un morceau de mie à la boule de pain, et le porte à sa\r\n          bouche.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           ...quotidien !...\r\n                         \r\n          Puis, baissant les yeux, il continue à marmonner d'une voix plus\r\n          faible, et donc inintelligible pour les autres membres de la\r\n          famille, trop occupés par Georges.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Crotte alors, crotte, crotte, crotte, crotte, crotte,\r\n           crotte...\r\n                         \r\n          Il jette un regard furtif vers sa famille assemblée autour du lit\r\n          de Georges. Personne ne semble s'occuper de lui. Et il continue à\r\n          marmonner, d'une voix encore plus faible, et quasiment\r\n<b>                         INCOMPRÉHENSIBLE :\r\n</b>                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Marie mère de, Marie mère de, Marie mère de... merde\r\n           alors !\r\n                         \r\n          Ne voulant certainement pas abuser de sa bonne étoile, il décide\r\n          de reprendre, à voix plus intelligible, une prière à peu près\r\n          normale.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Sur la terre comme au ciel...\r\n                         \r\n          Autour du lit, la famille est toujours assemblée.\r\n                         \r\n           MICHEL DOLLÉ (voix off)\r\n           Notre Père, qui êtes au cieux, que Votre Nom soit\r\n           sanctifié...\r\n                         \r\n          Michel a repris sa contemplation gourmande de la miche de pain.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Que Votre Volonté soit pleine de grâce.\r\n                         \r\n          Il s'arrête de prier, fasciné par le spectacle d'une petite souris\r\n          qui vient de grimper sur la table. La souris se promène\r\n          tranquillement, et vient renifler le contenu d'une cuiller.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Dis pas ça, tu vas lui faire peur.\r\n                         \r\n           RAYMOND DOLLÉ (voix off)\r\n           Tout à l'heure, il parlait de clouer la planche du\r\n           corbillard.\r\n                         \r\n          La famille chuchote autour du lit. Raymond dit d'une voix plus\r\n<b>                         AUTORITAIRE :\r\n</b>                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Faudrait une purge.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Y a de l'huile de ricin.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben. Donnes-y une goutte.\r\n                         \r\n          La mère s'éloigne du lit.\r\n                         \r\n          Michel observe toujours la souris sur la table.\r\n                         \r\n          La mère revient vers le lit de Georges, portant, d'une main, un\r\n          petit flacon ouvert, et de l'autre, une cuiller dans laquelle elle\r\n          a versé un peu du contenu du flacon. Elle marche doucement pour ne\r\n          pas renverser la cuiller.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Si ça fais pas de bien, ça fera pas de mal !\r\n                         \r\n          La mère approche la cuiller de la bouche de Georges.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ben quoi, t'ouvres plus la bouche ?\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           Il fait les mêmes yeux que la grand-mère.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Il faut le prendre par la douceur.\r\n                         \r\n          Il prend la cuiller des mains de sa femme.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Raisonne-toi, Georges.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ben... ouvre les yeux, au moins.\r\n                         \r\n          Le père approche la cuiller de la bouche de Georges.\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           Il ferme les yeux maintenant.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est peut-être qu'il dort.\r\n                         \r\n          Georges, les mains croisées sur la poitrine, a les yeux fermés et\r\n          ne bouge plus. Lorsque son père lui pose la cuiller sur les\r\n          lèvres, il ne réagit pas.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Allez, bois ça.\r\n                         \r\n          Il rend la cuiller à sa femme.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ah, donne-lui, la mère.\r\n                         \r\n          A son tour, elle approche la cuiller de la bouche de Georges.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Il serre les dents.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           C'est peut-être qu'il est mort.\r\n                         \r\n          Michel relève la tête et regarde vers le lit, le visage soudain\r\n          inquiet. Il se lève et s'approche du lit en récitant, de façon\r\n          correcte cette fois-ci, ses prières.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Notre Père, qui êtes aux Cieux, que Votre Nom soit\r\n           sanctifié, que Votre Règne arrive, que Votre Volonté soit\r\n           faite sur la terre comme au ciel. Donnez-nous aujourd'hui\r\n           notre pain de chaque jour. Pardonnez-nous nos offenses,\r\n           comme nous pardonnons à ceux qui nous ont offensés. Mais ne\r\n           nous laissez pas succomber à la tentation, mais délivrez-\r\n           nous du mal. Ainsi soit-il.\r\n                         \r\n          Paulette se lève de table et s'approche du lit. Michel vient de\r\n          recommencer, à voix plus basse, le « Notre Père ». Arrivée au pied\r\n          du lit, Paulette regarde le défunt.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Que le Bon Dieu les reçoive dans son Paradis.\r\n                         \r\n          Toute la famille regarde Georges, semblant ne pas vouloir admettre\r\n          la réalité. Raymond se penche vers lui et lui touche la main.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Hé !... Hé !... Pour moi, il est mort.\r\n           (A son père)\r\n           Tâte-le voir.\r\n                         \r\n          Le père pose sa main sur la poitrine de Georges.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Je crois bien qu'oui... qu'il est mort.\r\n           (A sa femme)\r\n           Qu'est-ce t'en dis, la mère ?\r\n                         \r\n          Michel se met à genoux au pied du lit et continue à réciter, à\r\n          voix très basse, ses prières.\r\n                         \r\n          La mère passe le flacon dans la main qui tient la cuiller, et de\r\n          sa main maintenant libre, touche la joue de son fils.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Pour sûr qu'il est mort.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Il est mort !\r\n                         \r\n          Ils ont tous deux la voix rauque de sanglots retenus. La famille\r\n          regarde Georges avec des yeux où la peine, la stupéfaction et même\r\n          une certaine incrédulité se mêlent. Le père enlève sa casquette et\r\n          se mouche dedans.\r\n                         \r\n          Paulette s'approche de Michel.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Il est mort, ton frère ?\r\n                         \r\n          Michel ne lui répond pas et continue à prier à voix basse.\r\n          Paulette s'agenouille à côté de lui.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Tu vas lui faire un trou ?\r\n                         \r\n          Michel se tourne vers elle, visiblement choqué par cette\r\n          proposition.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'es folle ? C'est mon frère.\r\n          Toute la famille est en larmes.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Mon pauv' Georges... Mon pauv' Georges... Te v'là qui pars\r\n           sans rien dire.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           On pouvait pas savoir... On se méfiait pas.\r\n                         \r\n          Renée s'écroule par terre en pleurant. La mère, tout en pleurant,\r\n          reverse, un peu maladroitement, le contenu de la cuiller dans le\r\n          flacon d'huile de ricin.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Si j'y avais donné plus tôt...\r\n                         \r\n          Le père se rapproche de sa femme.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           On sait même pas si c'est ça qu'il lui fallait...\r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Oh... Tu dis ça...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oui, bien sûr... Je dis ça...\r\n                         \r\n          Fondu au noir\r\n                         \r\n<b>          FERME DES DOLLÉ - HANGAR - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le Père Dollé est en train de réparer le plancher du vieux\r\n          corbillard. L'arrière du corbillard est surmonté de la lettre\r\n          « D », et au milieu de chacun des quatre côtés du corbillard, une\r\n          petite croix de bois noir est plantée sur le toit du corbillard.\r\n          Le Père Dollé, qui, à quatre pattes, plante des clous dans le\r\n          plancher, se redresse et se tourne vers Michel, assis sur la boîte\r\n          à clous posée à côté du corbillard, et visiblement rêveur.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oh !... Donne-moi un clou... un grand.\r\n                         \r\n          Michel semble sortir de sa rêverie éveillée, se lève et tend la\r\n          boîte à clous à son père, qui prend le clou dont il a besoin.\r\n          Michel pose la boîte et examine le corbillard avec plus\r\n          d'attention. Il monte sur une roue pour atteindre le toit du\r\n          corbillard, où il examine, avec beaucoup d'intérêt, l'un des\r\n          petits crucifix. Il le touche rêveusement.\r\n                         \r\n          Le père, toujours occupé à clouer, tourne la tête vers son fils,\r\n          dont il ne voit plus que les jambes.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Qu'est-ce que tu fabriques ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Rien.\r\n                         \r\n          Michel tourne la vis qui tient le crucifix en place, et constate\r\n          qu'elle se dévisse facilement. Il secoue la croix pour la\r\n          détacher, mais n'y arrive pas.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est pas bête... c'est pas mal... bien inventé, un\r\n           corbillard..\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Regarde donc les croix là-haut. C'est-y la peine de les\r\n           reclouer ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oh, non !... Elles tiennent... T'as plus besoin de moi ?\r\n                         \r\n          Michel saute par terre.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Donne-moi deux clous et ça ira.\r\n                         \r\n          Michel, qui allait partir, revient en arrière, prend la boîte à\r\n          clous et la pose sur le plancher du corbillard, devant le nez de\r\n          son père. Il sort en courant de la grange, pendant que son père\r\n          continue à clouer.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Paulette tient sa robe relevée devant elle, car elle a mis du\r\n          grain à l'intérieur. Elle donne les grains, un par un, aux\r\n          poussins qui l'entourent.\r\n                         \r\n          Par la porte ouverte d'une grange, on voit Michel qui verse par\r\n          terre l'eau que contenait un gros bidon à lait. Il remet le\r\n          couvercle en place, pose le bidon et sort de la grange. Il\r\n          s'approche de Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pas comme ça, idiote !\r\n                         \r\n          Il prend une poignée de grain dans la robe de Paulette, et la\r\n          lance à la volée sur les poussins. Puis il se penche vers Paulette\r\n<b>                         ET CHUCHOTE :\r\n</b>                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu sais, j'ai des croix... Trois, que j'en ai.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi trois ? Il y a que mon chien et la taupe.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'as raison.\r\n                         \r\n          Paulette s'accroupit et continue à distribuer le grain aux\r\n          poussins. Michel s'accroupit à côté d'elle. Elle repousse un\r\n          poussin.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non ! Toi, t'en as déjà eu !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'aimes les poussins ?\r\n          Paulette hausse les épaules et continue à distribuer son grain.\r\n                         \r\n          Fondu au noir\r\n                         \r\n<b>          FERME DES GOUARD - CHEMIN - EXTÉRIEUR JOUR\r\n</b>                         \r\n          A la qualité de la lumière ambiante, on devine que le jour s'est\r\n          levé il y a peu de temps. On entend un coq chanter.\r\n                         \r\n          Un soldat s'avance sur le chemin qui mène à la ferme des Gouard.\r\n          Il porte un calot, une capote, deux musettes entrecroisées en\r\n          travers de la poitrine, et, dans le dos, une trompette suspendue\r\n          par un cordon. Il s'agit de Francis Gouard, le fils du Père\r\n          Gouard.\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Toute la famille, sauf Michel et Paulette, est assemblée autour de\r\n          la table du petit-déjeuner. Renée, la seule à ne pas être assise,\r\n          pose les bols sur la table. La mère beurre les tartines.\r\n<b>          FERME DES GOUARD - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Francis s'approche de la ferme familiale. Il s'arrête pour\r\n          attraper sa trompette derrière son dos. Il saute la barrière, et\r\n          s'arrête devant la porte en se mettant au garde-à-vous. Il fait\r\n          tournoyer sa trompette, d'un geste un peu maladroit, puis la porte\r\n          à sa bouche. On entend un affreux « couac ». Francis recommence\r\n          mais refait un autre « couac ».\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Toute la famille tourne la tête dans la direction de la ferme des\r\n          Gouard... et le son de la trompette.\r\n                         \r\n<b>          FERME DES GOUARD - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Francis refait un essai, mais il ne sort aucun son de la\r\n          trompette, juste un bruit de soufflerie. Il crache quelque chose\r\n          qui, visiblement, lui encombrait la bouche et remet l'embouchure\r\n          sur ses lèvres. Cette fois-ci, il arrive à jouer, à peu près\r\n          correctement, la sonnerie dite du « Réveil ».\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          En fond sonore, on entend Francis jouer de la trompette.\r\n                         \r\n          Georges repose, mains croisées, sur son lit, un crucifix sur la\r\n          poitrine. Sur sa table de nuit, une bougie allumée et un rameau de\r\n          buis dans une soucoupe.\r\n                         \r\n          Michel saute sur son lit. Il a déjà mis sa culotte et s'apprête à\r\n          mettre ses chaussures. Il descend de son lit pour mettre sa\r\n          deuxième chaussure.\r\n                         \r\n<b>          FERME DES GOUARD - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Francis vient de s'arrêter de jouer et, la trompette à la main, il\r\n          ouvre la porte d'un coup de pied. Francis crie vers l'intérieur de\r\n          la ferme.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Debout là-dedans !\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          La famille n'a pas bougé de la table. Renée ne s'est même pas\r\n          assise.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Qu'est-ce que c'est ?\r\n                         \r\n          On entend de nouveau la trompette de Francis, dont la courte\r\n          prestation se termine sur un « couac ». Raymond et son père se\r\n          lèvent en même temps.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben, alors !\r\n                         \r\n          Les deux hommes se dirigent vers la porte d'entrée.\r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel est déjà sur le pas de la porte, en train de mettre sa\r\n          deuxième chaussure. Le père arrive derrière lui, suivi de Raymond,\r\n          puis de la mère, de Berthe et de Renée. Ils regardent tous en\r\n          direction de la ferme des voisins.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ce serait-y pas le fils Gouard ?\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et pourquoi ? La guerre, elle est pas finie ?\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Avec des feignants comme lui, ça serait pas étonnant.\r\n                         \r\n          Le père tape sur l'épaule de Michel.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Vas-y voir par derrière. Tu me diras si c'est le Francis.\r\n                         \r\n          Michel se tourne vers Raymond.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je vais te couper de l'herbe aux lapins.\r\n                         \r\n          Le père décroche une serpette du mur, et la donne à Michel, qui\r\n          ramasse un panier par terre, traverse rapidement la cour de la\r\n          ferme puis s'engage sur la passerelle qui sépare les deux fermes.\r\n                         \r\n          Toute la famille, massée devant la porte de la ferme, le suit des\r\n          yeux.\r\n                         \r\n<b>          FERME DES GOUARD - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel longe le mur de la ferme en s'accroupissant pour ne pas\r\n          être vu des fenêtres. Il passe devant le chien, attaché à une\r\n          chaîne, et qui semble totalement indifférent à sa présence. Il\r\n          s'approche de la fenêtre de la salle commune.\r\n                         \r\n          A travers cette fenêtre, on aperçoit Francis attablé qui raconte\r\n          ses aventures guerrières, mais on ne l'entend pas. Il mime un\r\n          avion en piqué, puis une explosion, puis un tir de mitrailleuse.\r\n                         \r\n          Michel, accroupi sur un carré d'herbe en face de la ferme, coupe\r\n          de l'herbe, tout en essayant de voir ce qui se passe à l'intérieur\r\n          de la ferme.\r\n                         \r\n<b>          FERME DES GOUARD - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Francis est à table en train de manger, le calot sur la tête, et\r\n          la vareuse ouverte. Sa trompette est posés à côté de lui, reposant\r\n          sur son pavillon. Son père l'écoute, visiblement passionné, tout\r\n          en mangeant lui aussi. Le cadette de ses soeurs, Marcelle, est\r\n          debout derrière lui, en train de beurrer une tartine. Son autre\r\n          soeur, Marcelle, descend du grenier par une échelle.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Y a plus de chefs... Y a plus d'Anglais... Y a plus rien..\r\n           Alors quoi, que je me suis dit... C'est pas la peine de\r\n           marcher comme ça jusqu'à perpette.\r\n                         \r\n          Marcelle lui donne la tartine beurrée, pendant que Jeanne s'active\r\n          près de la cheminée. Marcelle prend la trompette pour l'examiner.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Touche pas à ça...\r\n                         \r\n          Marcelle repose la trompette.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Alors, j'ai foutu le camp... Et me v'là.\r\n                         \r\n          Marcelle touche les glands qui pendent du cordon de la trompette.\r\n          Francis boit son café, pendant que son père le regarde, un peu\r\n          surpris.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Mais les Prussiens ? Où qu'y sont, les Prussiens ?\r\n                         \r\n          Francis repose son bol et réfléchit un peu avant de répondre.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Probable qu'ils sont pas loin.\r\n                         \r\n<b>          FERME DES GOUARD - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel s'approche d'une cage en osier dans laquelle il y a des\r\n          poussins.\r\n                         \r\n<b>          FERME DES GOUARD - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le Père Gouard hoche la tête.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Dans la cavalerie, on avait des chevaux.\r\n                         \r\n          Jeanne sourit et s'assoit à côté de son père. Marcelle les écoute,\r\n          penchée sur la table, la tête reposant sur sa main.\r\n                         \r\n<b>                          JEANNE GOUARD\r\n</b>           Les chenillettes, ça va plus vite.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           En dix-huit, on foutait pas le camp. On n'avais pas besoin\r\n           d'aller si vite\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Si tu avais eu des Messerschmidt au cul toute la journée,\r\n           on t'aurait vu... tiens !\r\n                         \r\n<b>          FERME DES GOUARD - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel prend des poussins dans la cage et les cache dans sa\r\n          chemise, tout en regardant vers la fenêtre\r\n                         \r\n          La père Gouard tourne la tête vers la fenêtre et aperçoit Michel.\r\n          Il se lève et s'approche de la fenêtre. On entend sa voix, un peu\r\n          étouffée par le carreau.\r\n<b>           LE PÈRE GOUARD\r\n</b>           Tu veux que j't'aide ? Qu'est-ce que tu fous là ?\r\n                         \r\n          Michel se lève et essaie de bien cacher les poussins qu'il a\r\n          volés.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je coupe de l'herbe\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Elle est pas à toi, mon herbe !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est papa qui me l'a dit !\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Quoi ?\r\n                         \r\n          Michel ramasse son panier, et part en courant, tout en tenant sa\r\n          chemise pleine de poussins de l'autre main.\r\n                         \r\n          Il traverse la passerelle.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel arrive de l'autre côté de la passerelle, traverse la cour\r\n          en courant, pose son panier près de la porte, et écarte ses\r\n          parents pour se faufiler à l'intérieur de la maison.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est bien le Francis qui est là !\r\n                         \r\n          Le Père Dollé hoche la tête.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Et on se demande pourquoi on a perdu la guerre !\r\n                         \r\n          Il se retourne vers Berthe.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Et toi... Attention que je te voie pas tourner autour de\r\n           lui.\r\n                         \r\n          Berthe semble - hypocritement ! - blessée par cette accusation.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Moi ?\r\n                         \r\n          Elle entre dans la ferme, suivie par son frère et sa soeur. Le père\r\n          sourit à sa femme.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           T'as vu ?\r\n                         \r\n          Sa femme entre la première et le père Dollé lui donne une grande\r\n          claque sur les fesses.\r\n                         \r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR JOUR\r\n</b>                         \r\n          Michel arrive en courant par l'escalier et se précipite vers\r\n          Paulette, qui dort toujours, enveloppée dans ses couvertures. Il\r\n          lui tapote l'épaule en chuchotant :\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b><b>           Hé !...\r\n</b>                         \r\n          Paulette se réveille doucement en souriant à Michel.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Bonjour.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ça va ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oui.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu dors ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non.\r\n                         \r\n          Il montre à Paulette le poussin qu'il tient dans ses mains.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Regarde.\r\n                         \r\n          Paulette prend le poussin des mains de Michel.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oh... il est tout chaud.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu es contente ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oh, oui !... C'est pas toi qui l'a tué ? Tu me jures.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non, c'est pas moi. Moi, j'ai voulu leur donner à boire et\r\n           ils avaient les yeux fermés. Alors j'ai dit : c'est peut-\r\n           être bien qu'ils dorment.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je leur mettrai une guirlande.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et puis aussi, il serraient les dents. Alors j'ai dit :\r\n           c'est peut-être bien qu'ils sont morts.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben, c'est comme ça... T'es contente ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oh, oui !\r\n<b>                         FONDU ENCHAÎNÉ\r\n</b>                         \r\n<b>          PETIT PRÉ - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Un pré, dans lequel broutent des vaches.\r\n                         \r\n          Paulette cueille des fleurs. En courant de-ci, de-là, pour trouver\r\n          ses fleurs, elle tombe sur Francis et Berthe, couchés, côte à\r\n          côte, dans l'herbe. Berthe se relève brusquement, imité par\r\n          Francis, qui regarde Paulette avec surprise. Paulette les regarde\r\n          un instant, hausse les épaules, puis s'éloigne en courant.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           T'es caporal ?\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Oui, j'ai été nommé au feu.\r\n                         \r\n          Elle lui passe les mains autour du cou.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Qui c'est qui t'as dit que je menais les vaches ?\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           C'est le Michel... Il est malin, le Michel.\r\n                         \r\n          Ils se recouchent dans l'herbe. Francis l'embrasse dans le cou, et\r\n          elle glousse un peu, puis se redresse légèrement.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Fais attention, y a la gosse.\r\n                         \r\n          Elle s'assoit. Francis s'assoit à son tour.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Qui c'est, cette gosse ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est la Paulette, la bonne amie à Michel.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Il est malin, le Michel.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Oh, oui ! Il est malin !\r\n                         \r\n          On entend, dans le lointain, des bruits d'explosion. Francis et\r\n          Berthe s'arrête de flirter pour écouter les explosions.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Cinq... Six...\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est pas loin, c'est le pont.\r\n                         \r\n          Les explosions continuent. Francis soupire.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           J'ai pas de veine, ils me suivent !\r\n          Michel apparaît au sommet de la colline, portant quelque chose\r\n          grossièrement emballé dans du journal.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Alors ? Y a plus d'amour ?... Elle est là, Paulette ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Tu parles si elle est là !\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Allez ! Barrez-vous, les gosses !\r\n                         \r\n          Michel se dirige vers Paulette, assise dans l'herbe au pied d'un\r\n          buisson. Paulette se relève.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu les as, les poussins ?\r\n                         \r\n          Paulette tâte les poussins, sous sa robe.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oui. Là.\r\n                         \r\n          Ils se mettent en marche, s'éloignant de Francis et Berthe.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Regarde ce que j'ai, moi.\r\n                         \r\n          Il déballe son journal et montre à Paulette les trois croix du\r\n          corbillard. Paulette examine une des croix. Michel semble très\r\n          fier de lui. Mais Paulette, elle, semble déçue.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oh !... Elles sont vilaines.\r\n                         \r\n          Elle rend la croix à Michel, qui la remballe, l'air déçu.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'es jamais contente.\r\n                         \r\n          Fondu au noir.\r\n                         \r\n<b>          PLACE DE L'ÉGLISE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Le corbillard s'approche de l'église, où les cloches sont en train\r\n          de sonner. Devant le corbillard, un enfant de choeur portant un\r\n          grand crucifix de métal, et derrière lui, le curé en chasuble\r\n          noire, flanqué de deux autres enfants de choeur. Derrière eux, le\r\n          corbillard, tiré par un cheval, guidé par un homme à pied.\r\n          Derrière le corbillard, la famille Dollé, leurs proches et leurs\r\n          amis, tous en deuil. Le curé et les enfants de choeur s'arrêtent\r\n          devant la porte l'église, mais le corbillard roule encore deux ou\r\n          trois mètres avant de s'arrêter à son tour, de façon à ce que\r\n          l'arrière du corbillard soit au niveau du curé.\r\n                         \r\n          Raymond rejoint le curé et les enfants de choeur à l'arrière du\r\n          corbillard pour sortir le cercueil, mais son père l'arrête et se\r\n          tourne vers le curé.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           C'est-y bien la peine de le faire entrer ?\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Ben, voyons !\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           C'est à cause de la planche du fond. Ce que j'ai bricolé,\r\n           vous savez, c'est pas bien solide... Alors, si on est tout\r\n           le temps à le mettre, à le sortir, et à le remettre...\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           C'est indispensable.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Bon.\r\n                         \r\n          Le curé fait passer les enfants de choeur devant lui et entre dans\r\n          l'église. Raymond relève le drap noir qui recouvre le cercueil, de\r\n          façon à dégager les poignées... sous l'oeil inquiet de son père !\r\n          Un autre homme vient l'aider à tirer le cercueil. Un troisième\r\n          homme et une femme prennent les deux autres poignées du cercueil\r\n          et ils se dirigent tous les quatre vers l'intérieur de l'église.\r\n          Tout le monde les suit, sauf le père Dollé qui s'approche du\r\n          corbillard vide et en inspecte le plancher.\r\n                         \r\n          Sur la route qui mène à la place de l'église, une cousine de la\r\n          famille Dollé, en grand habit de deuil, pédale sur sa bicyclette,\r\n          son voile flottant au vent. Une couronne mortuaire est accrochée\r\n          sur le guidon de son vélo.\r\n                         \r\n          La cousine arrive devant l'église et descend de sa bicyclette,\r\n          qu'elle appuie sur la mur de l'église. Elle échange deux bises\r\n          bien sonores avec le Père Dollé.\r\n                         \r\n<b>                          COUSINE DOLLÉ\r\n</b>           Oh !... En voilà bien une affaire.\r\n                         \r\n          Le Père Dollé hausse légèrement les épaules et regarde la\r\n          couronne.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oh... Fallait pas... fallait pas...\r\n                         \r\n          Elle essaie de détacher la couronne du guidon de son vélo.\r\n                         \r\n<b>                          COUSINE DOLLÉ\r\n</b>           C'était la dernière. Alors, il y a écrit « cousine ».\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ça fait rien... ça fait rien.\r\n                         \r\n          Il l'aide à détacher la couronne.\r\n                         \r\n<b>                          COUSINE DOLLÉ\r\n</b>           Si ! Ça fait... Si, ça fait...\r\n                         \r\n          A deux, ils finissent par détacher la couronne, mais manquent de\r\n          flanquer le vélo par terre.\r\n                         \r\n<b>                          COUSINE DOLLÉ\r\n</b>           Attendez...\r\n                         \r\n          Sur le ruban de la couronne, il est inscrit : « A notre chère\r\n          cousine ». La cousine arrache le « e » final de « cousine ». Elle\r\n          donne la lettre arrachée au père Dollé, qui la met dans sa poche.\r\n          Elle a l'air satisfaite du « A notre chère cousin » !\r\n                         \r\n<b>                          COUSINE DOLLÉ\r\n</b>           On ne dirait pas qu'il y a la guerre ici... Lui, au moins,\r\n           il aura un enterrement de chrétien.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Avec une messe !\r\n                         \r\n          La cousine entre dans l'église avec sa couronne à la main.\r\n                         \r\n<b>                          COUSINE DOLLÉ\r\n</b>           Et vous, Joseph ? Vous n'y allez pas ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tout de suite... Tout de suite...\r\n                         \r\n          Il revient vers le corbillard et ramasse son marteau sur le\r\n          plancher.\r\n                         \r\n<b>                         FONDU ENCHAÎNÉ\r\n</b>                         \r\n<b>          ÉGLISE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le curé, tournant le dos aux fidèles, est en train de dire la\r\n          messe, entouré de ses deux enfants de choeur, dont l'un agite une\r\n          clochette.\r\n                         \r\n          Sur la galerie qui surplombe la nef, un homme joue de l'harmonium.\r\n          Autour de lui, cinq femmes chantent le « Sanctus ».\r\n                         \r\n          Plan d'ensemble de la nef de la petite église, qui est bien\r\n          remplie.\r\n          Paulette est assise à côté de Michel, qui a un brassard noir sur\r\n          le bras. Ils chantent tous les deux - ou font semblant de chanter.\r\n                         \r\n          La mère Dollé et sa fille Berthe sont assises côte à côte, chacune\r\n          avec un voile noir sur le visage.\r\n                         \r\n          Les deux hommes, assez âgés, qui portaient le cercueil, ont l'air\r\n          très émus. L'un d'eux écrase même une larme, puis s'essuie les\r\n          yeux avec son mouchoir.\r\n                         \r\n          Plan sur deux autres hommes en deuil, puis sur Renée, qui est tout\r\n          habillée en noir, mais sans voile. Elle a l'air tellement absorbée\r\n          par ses pensées, qu'elle ne songe même pas à chasser une mouche\r\n          qui s'est posée sur son nez.\r\n                         \r\n          Raymond, lui aussi, est au bord des larmes.\r\n                         \r\n          Paulette et Michel se regardent avec tendresse. Puis ils tournent\r\n          leur regard vers le chemin de croix, dont chaque tableau est\r\n          surmonté d'une croix. Paulette les montre du doigt.\r\n           PAULETTE &amp; MICHEL DOLLÉ (ensembles)\r\n           Dix... Onze... Douze...\r\n                         \r\n          La mère Dollé se tourne vers eux.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Chut !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Treize... Quatorze. Seulement, celles-là, elles ne se\r\n           dévissent pas.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et puis, elles sont pas belles.\r\n                         \r\n          Raymond, qui est assis devant eux, se retourne.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           C'est fini, oui ?\r\n                         \r\n          Une clochette retentit. Michel se met à genoux et baisse la tête.\r\n          Paulette l'imite, mais sans baisser la tête. Elle lui tape sur\r\n          l'épaule et lui montre quelque chose du doigt.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Regarde...\r\n                         \r\n          Il s'agit de la petite croix qui pend au bout d'un chapelet que\r\n          tient un fidèle devant eux.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ça irait bien pour une abeille.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui, mais ça pique.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ça pique, mais, dans le fond, c'est pas méchant.\r\n<b>          PLACE DE L'ÉGLISE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          A travers les montants du corbillard, que le père Dollé est\r\n          toujours en train de réparer, on aperçoit un troupeau de vaches,\r\n          conduites par Marcelle et Jeanne Gouard. Jeanne éclate de rire et\r\n          le père Dollé relève la tête.\r\n                         \r\n<b>                          JEANNE GOUARD\r\n</b>           C'est le corbillard qu'est en panne... comme la chenillette\r\n           au Francis.\r\n                         \r\n<b>                          MARCELLE GOUARD\r\n</b>           Rigole pas.\r\n                         \r\n<b>                          JEANNE GOUARD\r\n</b>           Pourquoi je rigolerais pas ?\r\n                         \r\n          Le père Dollé regarde les filles Gouard d'un air mécontent. On\r\n          entend les cloches des vaches qui s'éloignent. Le père Dollé\r\n          descend du corbillard et prend un peu de recul pour inspecter son\r\n          corbillard. Et il s'aperçoit de la disparition des croix.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben, ça alors !...\r\n                         \r\n          Il grimpe sur une roue pour atteindre le toit du corbillard, et\r\n          manipule la tige qui tenait la croix en place. Il redescend et se\r\n          met les mains sur les hanches.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben ça, c'est pas banal.\r\n                         \r\n          Il réfléchit un instant, puis se dirige vers la porte de l'église.\r\n                         \r\n<b>          ÉGLISE - INTÉRIEUR JOUR\r\n</b>                         \r\n          La porte s'ouvre, et le père Dollé apparaît sur le seuil. Il\r\n          enlève son chapeau. Il appelle, à voix haute :\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Michel !...\r\n                         \r\n          Michel, en grande conversation muette avec Paulette, ne semble\r\n          même pas l'entendre.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Michel !... Arrive !...\r\n                         \r\n          Le curé, l'air choqué par cette intrusion intempestive, se\r\n          retourne vers la porte.\r\n                         \r\n          La mère Dollé se tourne vers Michel et lui chuchote d'une vois\r\n          néanmoins assez forte :\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ben quoi... fais ce que dit ton père !\r\n                         \r\n          Michel de lève et se dirige vers la porte. Le bruit de ses\r\n          galoches résonne sur les dalles du sol de l'église. Il trébuche\r\n          sur une dalle mal jointe. Arrivé à la porte, il se retourne\r\n          brièvement vers l'autel et fait une rapide génuflexion et un signe\r\n          de croix. La porte claque derrière lui.\r\n                         \r\n<b>          PLACE DE L'ÉGLISE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel s'avance vers son père, qui, les mains sur les hanches,\r\n          regarde le corbillard.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Je t'avais dit de regarder si les croix tenaient bien.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben oui, elles tenaient.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Elles ont foutu le camp. Va voir sur le chemin, si on les a\r\n           pas perdues.\r\n                         \r\n          Michel semble un peu embarrassé.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oh non ! On les a pas perdues. J'aurais bien vu.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Si on les a pas perdues, c'est quelqu'un qui les a\r\n           enlevées... Qui que c'est ?... Hmm !...\r\n                         \r\n          Michel baisse la tête.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben, je sais pas, moi. C'est peut-être les Gouard...\r\n                         \r\n          On entend le son d'une clochette provenant de l'intérieur de\r\n          l'église.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Papa, ça sonne. Faut rentrer pour baisser la tête.\r\n                         \r\n          Michel rentre dans l'église. Le père Dollé reste immobile à\r\n          regarder longuement son corbillard.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben oui... c'est peut-être bien les Gouard.\r\n                         \r\n          Il se dirige, à son tour, vers la porte de l'église.\r\n                         \r\n<b>          ÉGLISE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Michel entre dans l'église, en gardant la tête baissée. Derrière\r\n          lui, son père entre à son tour et enlève son chapeau. On entend le\r\n          son de la clochette agitée par l'enfant de choeur. Toute\r\n          l'assemblée est agenouillée, têtes baissées, même Paulette. Michel\r\n          va s'agenouiller près de Paulette, se penche vers elle et\r\n<b>                         CHUCHOTE :\r\n</b>                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Il a vu qu'il y avait plus de croix. Alors, j'ai dit que\r\n           c'était les Gouard.\r\n          Paulette relève la tête et regarde la grande croix au-dessus de\r\n          l'autel. Elle chuchote.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oh ! Regarde celle-là !\r\n                         \r\n          Michel suit le regarde de Paulette, et affiche un air inquiet.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui, mais c'est celle du curé !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Elle est belle !\r\n                         \r\n<b>          FERME DES GOUARDS - REMISE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Remise à bois, encombrée de morceaux de bois de toutes tailles.\r\n                         \r\n          Le père et le fils Gouard sont en train de scier un tronc d'arbre.\r\n          Le père s'arrête et prend, dans sa poche, une feuille de papier à\r\n          cigarettes.\r\n<b>           LE PÈRE GOUARD\r\n</b>           J'y serais allé, moi, à l'enterrement, si j'avais su que\r\n           leur fils était mort.\r\n                         \r\n          Il prend du tabac directement dans la poche de sa veste et le\r\n          dépose sur la feuille de papier.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Avec ça, que tu le savais pas !\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Ben, ils me l'ont pas dit. C'est égal, ils ont eu du\r\n           malheur... Avec qui ils vont rester maintenant ? Le\r\n           Raymond, qu'est bon-à-rien.\r\n                         \r\n          On entend, dans le lointain, les cloches de l'église qui sonnent\r\n          la fin de la messe de funérailles.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Il y a la Berthe. Elle est bonne travailleuse, la Berthe.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Une pute.\r\n                         \r\n          Francis sursaute.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Ben quoi !... Ben sois poli !\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Qu'est-ce qui te prend ? Tu la défends ?\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Oui, je la défends.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           T'aurais bien mieux fait de défendre la France, avec tes\r\n           chevaux mécaniques.\r\n<b>                          FRANCIS GOUARD\r\n</b>           Oh, la France !... Je peux pas l'épouser, non ?\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Tu vas peut-être bien épouser la Berthe Dollé, hein ?\r\n                         \r\n          Il roule lentement sa cigarette.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Ben, peut-être bien, oui...\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Faut être dans la cavalerie à moteur pour être aussi\r\n           bouché.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Oui, et bien si tous les chevaux de la cavalerie à moteur,\r\n           ils te bottaient le train, c'est peut-être bien toi que ça\r\n           déboucherait !\r\n                         \r\n          Le père Gouard hausse la voix.\r\n<b>           LE PÈRE GOUARD\r\n</b>           C'est comme ça que tu parles à ton père ?\r\n                         \r\n          Le père lâche sa cigarette et balance, à son fils, une beigne qui\r\n          l'envoie valdinguer par terre. Francis se relève aussitôt.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Parfaitement !... Et pis c'est pas fini... Et pis, la\r\n           Berthe, je l'épouserai... T'entends ?\r\n                         \r\n<b>          CIMETIÈRE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Le cimetière est situé juste à côté de l'église.\r\n                         \r\n          Le corbillard entre dans le cimetière, précédé par l'enfant de\r\n          choeur porteur de la grande croix, du curé et des deux autres\r\n          enfants de choeur. Derrière le corbillard, la famille Dollé et\r\n          leurs proches.\r\n                         \r\n          Délaissant le cortège, Paulette et Michel circulent dans les\r\n          allées du cimetière. Ils observent les croix.\r\n                         \r\n          Les porteurs posent le cercueil à côté de la fosse destinée à\r\n          Georges. Les cloches de l'église sonnent à la volée.\r\n                         \r\n          Michel et Paulette continuent à se promener dans les allées du\r\n          cimetière.\r\n                         \r\n          Le cercueil a maintenant été descendu dans la fosse. Raymond et un\r\n          autre homme récupère les cordes qui ont servi à le descendre.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben, v'là tout...\r\n                         \r\n          Le curé jette une poignée de terre sur le cercueil.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Et maintenant, mes amis, permettez-moi d'adresser quelques\r\n           mots à une famille particulièrement éprouvée... A tous,\r\n           petits et grands, j'adresse l'expression de ma\r\n           douloureuse...\r\n                         \r\n          Michel et Paulette inspectent les croix.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Celle-là, ça irait pour une jument.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et là pour un pigeon.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Un chat.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Un gros, alors !\r\n                         \r\n          Paulette montre du doigt la très haute croix, plantée à côté de\r\n          l'église, près de l'entrée du cimetière.\r\n<b>                          PAULETTE\r\n</b>           Et là, pour une « girafle » !\r\n                         \r\n          Raymond finit de rouler la corde qui a servi à descendre le\r\n          cercueil. Son père, en manche de chemise et une pelle à la main,\r\n          remet la terre dans la tombe, tout en parlant au curé\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Alors, j'ai dit : forcément, c'est un coup des Gouard.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Vous avez des preuves ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Il nous en veut.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Il dit que je suis déserteur.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Pourquoi vous en veut-il ?\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Il est jaloux.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           C'est tout de même pas une raison pour avoir volé les croix\r\n           du corbillard.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ouais ! Quand je le réparais tout à l'heure, le corbillard,\r\n           il y a ses garces de filles qui sont passées. Et bien,\r\n           elles ricanaient.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Le Francis, et ben, il est plus déserteur que moi.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           J'y crèverai la paillasse, s'il continue. Parce que moi, je\r\n           les respecte, les morts.\r\n                         \r\n          Plan rapproché sur la terre, pelletée par le père Dollé, qui finit\r\n          de combler la tombe. Posée à plat sur le sol, une croix, avec une\r\n          plaque, sur laquelle est inscrit : « Georges DOLLÉ, décédé le 15\r\n          juin 1940 ». Du pied, Michel fait bouger légèrement la croix.\r\n          Paulette et Michel ont l'air fasciné par cette croix.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Et eux, Monsieur le Curé, il les respectent pas.\r\n                         \r\n          Le père Dollé pose sa pelle, prend la croix et la plante dans le\r\n          sol à l'arrière de la tombe. La mère accroche un petit crucifix\r\n          blanc sur la croix.\r\n                         \r\n          Fondu au noir.\r\n                         \r\n<b>          ÉGLISE - INTÉRIEUR JOUR\r\n</b>                         \r\n          La nef de l'église. Elle est vide, sauf pour Berthe, à genoux sur\r\n          un prie-dieu, et qui égrène son chapelet.\r\n          Derrière elle, le confessionnal, dans lequel Michel est à genoux.\r\n                         \r\n          Dans le confessionnal. Le curé, derrière sa grille, confesse\r\n          Michel.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           C'était toi, les croix du corbillard ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui, Monsieur le Curé.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Mais pourquoi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pour faire un cadeau.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           A qui ?\r\n                         \r\n          Michel hésite.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je peux pas le dire.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Bon. Et bien, tu me les rapporteras. Et puis tu vas me\r\n           dire, en sortant d'ici, cinq Pater et cinq Ave. Dis ton\r\n           acte de contrition.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Mon Dieu, j'ai un très grand regret de vous avoir offensé,\r\n           car vous êtes infiniment bon, infiniment aimable, et que le\r\n           péché vous déplait. Je prends la ferme résolution, par\r\n           votre Sainte Grâce, de ne plus vous offenser et de faire\r\n           pénitence.\r\n          Retour dans Dans l'église. Michel sort du confessionnal, fait un\r\n          signe de croix et se dirige, tête baissée, vers un prie-dieu sur\r\n          lequel il s'agenouille. Berthe fait un signe de croix, se lève et\r\n          va s'agenouiller dans le confessionnal.\r\n                         \r\n          Michel commence à réciter son « Notre Père ».\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Notre Père, qui êtes aux cieux, que Votre Nom soit\r\n           sanctifié, que Votre Règne arrive, que Votre Volonté soit\r\n           faite sur la terre comme au ciel. Donnez-nous aujourd'hui\r\n           notre pain quotidien.\r\n                         \r\n          Il relève la tête et regarde la grande croix de métal doré au-\r\n          dessus de l'autel.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pardonnez-nous nos offenses, comme nous pardonnons à ceux\r\n           qui nous ont offensés.\r\n                         \r\n          Il jette un coup d'oeil vers le confessionnal, puis regarde de\r\n          nouveau la grande croix.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Mais ne nous laissez pas succomber à la tentation.\r\n                         \r\n          Il regarde de nouveau vers le confessionnal.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Mais délivrez-nous du mal. Ainsi soit-il.\r\n                         \r\n          Discrètement, il enlève ses galoches et les pose à côté du prie-\r\n          dieu. Puis, pieds nus, il se dirige vers l'autel. Au passage, il\r\n          ramasse une chaise dans la nef. Il ouvre la petite porte qui\r\n          permet d'accéder à l'arrière de l'autel, jette un dernier coup\r\n          d'oeil vers le confessionnal et disparaît derrière l'autel.\r\n                         \r\n          Dans le confessionnal, Berthe est en train de se confesser.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Deux fois, Monsieur le Curé.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Ah ! Vous êtes bien toutes les mêmes !\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Mais c'est pour le bon motif.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Bien sûr... Bien sûr... Mais vous avez un peu mis la\r\n           charrue avant les boeufs.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Mais puisqu'on va se marier. Seulement voilà. On n'ose pas\r\n           leur dire... Avec les parents qu'on a !\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Ben oui !\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ben oui... Alors on a pensé que vous pourriez peut-être...\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Les réconcilier ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Comme vous dites...\r\n                         \r\n          Retour dans l'église. Michel est maintenant debout sur la chaise\r\n          derrière l'autel. Il fait un signe de croix rapide et avance la\r\n          main vers la croix posée sur le tabernacle.\r\n                         \r\n          Retour dans le confessionnal.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Mais puisqu'on va se marier...\r\n                         \r\n          On entend un bruit de chute provenant de l'église. Le curé\r\n          écarquille les yeux.\r\n                         \r\n          Retour dans l'église. La croix tombe par terre, entraînant l'un\r\n          des candélabres dans sa chute.\r\n          Le curé surgit du confessionnal\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Michel !... Je t'ai vu !\r\n                         \r\n          Il avance, à pas rapides, vers l'autel, où il récupère la croix\r\n          tombée à terre et la pose sur l'autel. Il a l'air très en colère.\r\n          Il contourne l'autel, entre par la petite porte et ressort, tenant\r\n          d'une main une chaise cassée et de l'autre l'oreille de Michel. Il\r\n          jette la chaise cassée dans un coin.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           La croix du maître-autel ! T'avais même pas fini ta\r\n           pénitence que tu recommençais encore pire !\r\n                         \r\n          Il gifle Michel à plusieurs reprises.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Prends tes souliers, et fiche-moi le camp !\r\n                         \r\n          Berthe est sortie du confessionnal.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Qu'est-ce qu'il a encore fait ?\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Ça te regarde pas.\r\n                         \r\n          Michel ramasse ses galoches et sort de l'église en courant. Le\r\n          curé pousse Berthe dans le confessionnal.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Allez, rentre ! On n'a pas fini !\r\n                         \r\n          Fondu au noir.\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>          La mère Dollé a un bout de journal enflammé à la main. Elle prend\r\n          une lampe à pétrole sur la cheminée, la pose au milieu de la table\r\n          et l'allume. Puis elle souffle sur son papier pour l'éteindre.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Alors, tu lui as parlé, au Gouard ?\r\n                         \r\n          Berthe est occupée à coudre et Raymond taille un morceau de bois\r\n          avec un grand couteau. Le père Dollé est en train de rouler une\r\n          cigarette.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oui, je lui ai parlé.\r\n                         \r\n          Il tend la cigarette à Raymond.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tiens...\r\n                         \r\n          Tout en parlant, il craque une allumette pour allumer la cigarette\r\n          de Raymond.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oui, j'y ai dit : « Alors, tu voles les croix de corbillard\r\n           maintenant ?» Y m'a dit : « Quelles croix de\r\n           corbillard ? » Alors j'y ai dit : « Fais pas le malin. »\r\n                         \r\n          La mère rit en écoutant son mari.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Alors y m'a dit : « Dollé, pour les croix de corbillard, je\r\n           te jure sur la tombe de ma femme. »\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ben, elle est belle à voir, la tombe de sa femme !\r\n                         \r\n          Le père commence à rouler une autre cigarette.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ben, laisse-moi faire. C'est ce que j'y ai dit... J'y ai\r\n           dit : « La tombe de ta femme, t'as pas le droit d'en\r\n           parler. C'est pas une tombe, c'est un taudis... Tu peux\r\n           bien jurer tout ce que tu veux sur la tombe de ta femme, tu\r\n           ferais mieux de la nettoyer. »\r\n                         \r\n          La mère continue à rire.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Et toc !...\r\n                         \r\n          La sculpture, sur laquelle Raymond est en train de travailler,\r\n          représente, de façon assez grossière, le fuselage d'un avion.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et d'abord, pourquoi ils sont pas venus à l'enterrement ?\r\n           C'est une preuve, ça !\r\n                         \r\n          Elle s'assoit. Derrière elle, Renée essuie des assiettes avant de\r\n          les ranger. Le père se sert un verre de vin, puis allume sa\r\n          cigarette.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           On leur avait pas dit.\r\n                         \r\n          On entend Francis qui joue de la trompette.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ils le savaient pas, peut-être ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ils le savaient peut-être, mais on leur avait pas dit.\r\n                         \r\n          Après plusieurs essais infructueux, Francis joue « l'extinction\r\n          des feux ». Tous se sont arrêtés pour écouter la musique, mais\r\n          seule Berthe semble l'apprécier : elle bouge doucement la tête en\r\n          mesure. Francis s'arrête de jouer.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Mais, il nous fait suer... avec son clairon.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           C'est pas un clairon, c'est une trompette.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Trompette ou clairon, c'est quand même un déserteur.\r\n                         \r\n          Dans un coin isolé de la salle, en contrebas de deux petites\r\n          marches, Michel et Paulette sont allongés par terre. Michel tient\r\n          un porte-plume dans sa main, et un encrier est posé à côté de lui.\r\n          Il lit le mot qu'il est en train d'écrire sur une petite fiche en\r\n          carton.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Pou... ssin..\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Moi, j'ai décidé. Les Gouard, ça existe plus.\r\n                         \r\n          Michel a découpé d'autres morceaux de carton, sur lesquels il a\r\n          inscrit des noms d'animaux. Il tend à Paulette la fiche qu'il\r\n          vient de terminer.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Il en faut deux, puisqu'il y a deux tombes.\r\n                         \r\n          Gros plan sur les fiches déjà remplies. On peut lire : « Jock,\r\n          chien », « Verre de terre », « Grillon », « Tope »\r\n                         \r\n           BERTHE DOLLÉ (voix off)\r\n           Qu'est que ça veut dire que les Gouard existent plus ?\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Parce que j'ai décidé comme ça.\r\n                         \r\n           LA MÈRE DOLLÉ (voix off)\r\n           Réponds pas à ton père !\r\n                         \r\n          Paulette regarde, sur le plancher, la progression d'un cafard.\r\n<b>                          PAULETTE\r\n</b>           Oh !... Comment ça s'appelle ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Un cafard.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Je te dis : Y a plus de Gouard. Et... et... va te\r\n           coucher !...\r\n                         \r\n          Paulette essaie d'attraper le cafard.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ça pique ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non, mais ça pue !\r\n                         \r\n          Michel lève son porte-plume au-dessus du cafard. Avec le porte-\r\n          plume levé, plume vers le bas, il dessine des spirales autour du\r\n          cafard, en imitant le bruit d'un avion. Il l'abat finalement sur\r\n          le cafard, qu'il transperce.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Bahoum !...\r\n                         \r\n          Paulette semble très choquée par ce que vient de faire Michel.\r\n          Elle se met à pleurnicher.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Faut pas les tuer !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est pas moi, c'est une bombe... T'es folle ?\r\n                         \r\n          Paulette se cache la tête dans les bras et se met à pleurer.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Faut pas les tuer ! Faut pas les tuer ! Faut pas les tuer !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Faut bien qu'ils soient morts pour qu'on les enterre.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je te parle plus.\r\n                         \r\n          Michel a un sourire très doux vers Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Andouille !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et puis d'abord, tu m'avais promis la croix du curé.\r\n                         \r\n          Michel ne sourit plus.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oh ben, t'es pas juste !\r\n                         \r\n          Michel prend, dans sa poche, une main de poupée et chatouille le\r\n          bras de Paulette avec. Elle relève la tête.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'en veux pas...\r\n                         \r\n          Elle remet la tête dans ses bras. Puis, un court instant après,\r\n          elle la relève.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Qu'est-ce que c'est ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Une main de poupée.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'en veux pas.\r\n                         \r\n          Elle remet la tête dans ses bras. On entend de nouveau la\r\n          trompette de Francis.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Si c'est pour des croix que tu fais la tête... Oh là là !\r\n          Au son de la trompette, Raymond lève la tête.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ce con-là ! Il nous ferait bien repérer par les avions !\r\n                         \r\n          Le père lève les yeux, réfléchit un instant, puis se lève et se\r\n          dirige vers les enfants.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Allez, les gosses, au lit.\r\n                         \r\n          Il ouvre la fenêtre et ferme les volets.\r\n                         \r\n          Les enfants se lèvent. Michel ramasse son matériel. Paulette\r\n          brosse sa robe et se dirige vers le père Dollé. Elle lui met les\r\n          bras autour du cou et l'embrasse sur la joue.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Bonsoir, Monsieur Dollé.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Bonsoir, mon lapin.\r\n                         \r\n          Elle s'approche de Raymond et l'embrasse.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Bonsoir, Monsieur Raymond.\r\n                         \r\n          Il sourit et, par les cheveux, la ramène vers lui pour\r\n          l'embrasser.\r\n                         \r\n          Michel met les petits cartons dans sa poche, et pose la bouteille\r\n          d'encre sur la table.\r\n                         \r\n          Paulette se dirige vers la mère Dollé.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Bonsoir, Madame Dollé.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Bonsoir, mon Jésus.\r\n                         \r\n          Paulette embrasse la mère Dollé.\r\n                         \r\n          Michel prend la lampe et commence à monter l'escalier. Il semble\r\n          être jaloux de toutes ces effusions.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Bonsoir, Madame Berthe.\r\n                         \r\n          Elle embrasse Berthe.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Bonsoir.\r\n                         \r\n          Elle monte l'escalier. Michel l'attend, assis sur une marche en\r\n          haut de l'escalier, la lampe à la main.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Qu'est-ce que tu fais ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je t'attends. T'as fini d'embrasser tout le monde ?\r\n                         \r\n          Elle s'assoit à côté de lui sur la marche de l'escalier.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Tu veux que je t'embrasse ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'es pas gentille.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ce que tu m'as dit pour la croix du curé.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ben, tu me l'as pas donnée.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           J'ai essayé. J'ai reçu des tartes.\r\n                         \r\n          Il montre sa joue du doigt.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ici, les tartes... Embrasse-moi dessus.\r\n                         \r\n          Paulette l'embrasse sur la joue.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Mieux que ça !\r\n                         \r\n          Elle l'embrasse de nouveau.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           J'ai dit au lit ! Fini de se sucer la pomme !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je viens.\r\n                         \r\n          Les deux enfants se lèvent et finissent de monter l'escalier.\r\n                         \r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR NUIT\r\n</b>                         \r\n          Paulette s'assoit sur le lit et enlève ses chaussures.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Moi, je connais un endroit où il y en a, des croix.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Où ça ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Au cimetière.\r\n                         \r\n          Michel semble abasourdi par la réponse de Paulette.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oh ben ! T'as pas peur !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et si les morts, ils me tirent par les pieds ?\r\n                         \r\n          Paulette se cache sous sa couverture.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je ne veux pas.\r\n                         \r\n          On entend la voix furieuse du père qui appelle Michel.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Tu veux que je monte ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je descends.\r\n                         \r\n          Michel soulève la couverture et dit, très gentiment.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'était pour rire... Les morts, c'est pas méchant.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ah !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui.\r\n                         \r\n          Fondu enchaîné.\r\n                         \r\n<b>          FERME DES DOLLÉ - GRANGE À FOIN - INTÉRIEUR NUIT\r\n</b>                         \r\n          Berthe et Francis sont couchés dans le foin. Francis a la tête\r\n          posée sur le ventre de Berthe.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Dis donc... Qu'est-ce que ça veut dire, ça : « La charrue\r\n           avant les boeufs » ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ben, c'est ce qu'on faisait maintenant.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Ah, je savais pas que ça s'appelait comme ça.\r\n                         \r\n          Elle se recouche dans le foin, l'air satisfait. Tout à coup, on\r\n          entend un bruit insolite.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Chut !...\r\n                         \r\n          Berthe se redresse et regarde vers le haut de la grange.\r\n                         \r\n          En haut de la grange, une petite porte s'ouvre, laissant\r\n          apparaître Michel et Paulette.\r\n          Francis se cache dans le foin. Berthe le recouvre complètement,\r\n          faisant aussi tomber pas mal de foin sur elle-même.\r\n                         \r\n          Michel et Paulette sont près de l'échelle, prêts à descendre en\r\n          bas de la grange.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           On va prendre la brouette.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Des croix ?... Plein une brouette, je te dis.\r\n                         \r\n          Il commence à descendre, suivi de Paulette. On entend des avions\r\n          qui se rapprochent. Une lueur illumine la grange. Les enfants\r\n          continuent néanmoins à descendre.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'ai peur.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est une fusée. Ferme les yeux.\r\n                         \r\n          Paulette ferme les yeux.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'y vois rien pour descendre si je ferme les yeux.\r\n                         \r\n          Berthe est à moitié cachée dans le foin. Elle reboutonne le devant\r\n          de sa robe. Michel arrive en bas de l'échelle. Berthe semble aussi\r\n          étonnée de voir Michel que Michel de voir Berthe.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Qu'est-ce que vous faites là ?\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben... et toi ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ça te regarde ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je peux prendre la brouette ?\r\n                         \r\n          Michel passe devant sa soeur, et, en se penchant pour prendre la\r\n          brouette, il aperçoit les pieds de Francis qui dépassent du foin.\r\n          Il en attrape un, qui se rétracte aussitôt dans le foin.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ah bon !...\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Quoi... Bon ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Rien.\r\n          Michel prend la brouette et se dirige vers la porte de la grange,\r\n          suivi de Paulette, qui se tourne, un court instant, vers Berthe.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           En voilà une heure pour une brouette\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           On va aux escargots !\r\n                         \r\n          Fondu au noir.\r\n                         \r\n<b>          CHEMIN CIMETIÈRE - EXTÉRIEUR NUIT\r\n</b>                         \r\n          On entend encore des avions, et la scène est régulièrement\r\n          éclairée par des lueurs venant du ciel.\r\n                         \r\n          Michel avance le plus vite qu'il peut en poussant la brouette\r\n          lourdement chargée. Paulette trottine à ses côtés. Dans la\r\n          brouette, il y a plein de croix, avec, sur le dessus, la croix de\r\n          Georges Dollé, ainsi que la petite croix blanche que la mère Dollé\r\n          avait fixé dessus. Paulette semble inquiète.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           T'as pas peur ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non. Et toi ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non. Tu veux que je te chante ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Si tu veux.\r\n                         \r\n          Le ciel est constellé de lumières provenant des fusées envoyées\r\n          par les avions. Paulette chante en tenant le bras de Michel. Elle\r\n          est visiblement effrayée, mais, ne voulant pas montrer sa peur,\r\n          elle chante avec d'autant plus d'ardeur.\r\n<b>                          PAULETTE\r\n</b>           Compère Guilleri, te laisseras-tu mourir ? On lui banda la\r\n           jambe, et le bras lui remit, Carabi ! Les dames de\r\n           l'hôpital sont arrivées au bruit, Carabi, toto Carabo.\r\n           Compère Guilleri, te laisseras-tu mourir ?\r\n                         \r\n          Les bruits de bombes se rapprochent. Paulette lâche le bras de\r\n          Michel et s'accroupit par terre.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Faut se coucher par terre.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Penses-tu ? Ils peuvent pas nous voir ! Allez, vite !\r\n                         \r\n          Il accélère le pas.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           On a perdu une croix.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ça fait rien, on en avait de trop !\r\n                         \r\n          Les enfants se mettent à courir, sous la lumière blafarde des\r\n          fusées éclairantes.\r\n                         \r\n          Fondu au noir.\r\n                         \r\n<b>          FERME DES GOUARD - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le père Gouard verse de l'eau chaude d'une casserole dans un bol,\r\n          puis il se dirige vers un meuble près de la fenêtre. Il pose le\r\n          bol sur le meuble, trempe son blaireau dans l'eau et le frotte sur\r\n          un pain de savon à barbe. Il se rapproche de la fenêtre, et va\r\n          pour appliquer la mousse sur sa joue, lorsqu'il est interpelé par\r\n          les aboiements du chien. Il regarde par la fenêtre.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Renée, tout habillée de noir, sort de la ferme en attachant un\r\n          ruban dans les cheveux de Paulette. Puis Raymond sort, suivi de sa\r\n          mère. Ils sont, tous deux, aussi, habillés de noir. La mère porte\r\n          un bouquet de fleur et une binette. Raymond ramasse, au passage,\r\n          un arrosoir et un râteau.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Il les aimait bien, les marguerites.\r\n                         \r\n          Berthe sort à son tour, elle aussi en grand deuil et les bras\r\n          chargés de fleurs. Puis vient Michel et enfin, le père, en costume\r\n          noir, qui sort le dernier et ferme la porte à clef. Il tient une\r\n          petite binette à la main.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           On va lui faire un beau petit jardin, sur sa tombe.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           C'est le premier dimanche qu'on va à la messe sans lui.\r\n          Le père envoie valdinguer le chapeau que Raymond porte sur la\r\n          tête. Il s'agit du chapeau que Raymond avait récupéré après\r\n          l'exode. Raymond rattrape le chapeau au vol.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Enlève ça. Allez, en route !\r\n                         \r\n          Ils font quelques pas, puis Michel s'arrête brusquement, et dit,\r\n          d'une voix très décidée.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je veux pas y aller, moi, au cimetière !\r\n                         \r\n          Son père lui donne une gifle.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Prends toujours ça !\r\n                         \r\n          Berthe lui colle dans les main un pot de fleurs, fait d'une boîte\r\n          de conserve.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Et ça !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et filez !\r\n                         \r\n          Michel se met en marche à contre-coeur. Paulette lui court après et\r\n          lui donne le bras. Ils traversent la cour de la ferme.\r\n                         \r\n<b>          FERME DES GOUARD - CUISINE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le père Gouard a suivi toute la scène précédente de sa fenêtre. Il\r\n          se retourne.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Jeanne !\r\n                         \r\n           JEANNE GOUARD (voix off)\r\n           Quoi ?\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Va couper des fleurs.\r\n                         \r\n           JEANNE GOUARD (voix off)\r\n           Pourquoi ?\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Fais ce que je te dis : va couper des fleurs ! Et\r\n           grouille !\r\n                         \r\n          Il revient vers son miroir pour étaler la mousse sur son visage.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Ils sont pas les seuls à avoir un défunt.\r\n                         \r\n<b>          CHEMIN CIMETIÈRE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          On entend la cloche de l'église qui appelle les fidèles à la\r\n          messe.\r\n          Gros plan sur une petite croix d'ivoire posée sur le chemin. Il\r\n          s'agit de la petite croix que la mère Dollé avait accrochée sur la\r\n          grande croix de la tombe de son fils, et aussi de la croix qui\r\n          était tombée de la brouette des enfants.\r\n                         \r\n          La famille Dollé s'approche de la croix. Le père la regarde, très\r\n          surpris.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Bon Dieu ! Mais c'est la croix de Georges !\r\n                         \r\n          Il la ramasse pour l'examiner, mais la mère la lui prend des main.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Bien sûr que c'est elle ! Y a encore le prix derrière.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ça, c'est pas banal !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Elle est pas venue ici toute seule !\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ça, c'est signé !\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Quoi, signé ?\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ça, c'est une preuve !\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Une preuve de quoi ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Elle a raison : c'est une preuve !\r\n                         \r\n          Le père Dollé se remet en marche en accélérant le pas, suivi par\r\n          toute sa famille.\r\n                         \r\n          Michel suit un peu en retrait avec Paulette. Il baisse la tête.\r\n          D'un seul coup, il s'arrête net.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           J'y vais pas.\r\n                         \r\n          Il se retourne, prêt à rebrousser chemin, lorsqu'il aperçoit la\r\n          famille Gouard, qui arrive à grands pas derrière lui. Michel prend\r\n          la main de Paulette et se remet rapidement en marche.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Vite, v'là les Gouard !\r\n                         \r\n          Les Gouards marchent, eux aussi, très vite. Le père Gouard porte\r\n          une binette sur l'épaule, Jeanne un arrosoir et des fleurs,\r\n          Marcelle un pot de fleurs. Francis, en bretelles, porte son veston\r\n          sur le bras.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Un taudis, qu'il a dit !\r\n                         \r\n<b>                          JEANNE GOUARD\r\n</b>           Elle sera plus belle que la leur.\r\n                         \r\n<b>          CIMETIÈRE - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Les Dollé traversent le cimetière à grandes enjambées vers la\r\n          tombe de Georges. La croix n'est plus là.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Oh !... Y a plus de croix !\r\n                         \r\n          Michel pose le pot de fleurs par terre. Paulette s'accroupit et\r\n          met sa main dans le trou marquant l'emplacement de la croix\r\n          manquante.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Y a un trou ! Elle y est plus !\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Nom de Dieu !... Regarde !...\r\n          Il bondit vers une tombe sur laquelle est plantée une croix de\r\n          bois avec l'inscription : « Ici repose Amélie GOUARD - 1898-\r\n          1938 ». Il pose son chapeau sur une croix voisine, puis il saisit\r\n          la croix à deux mains, et la casse en deux au ras du sol. La\r\n          partie supérieure tombe à terre. Tourné vers sa famille, il ne\r\n          voit pas les Gouard arriver derrière lui. Il ramasse la croix,\r\n          déplante la partie encore en terre, puis, sur son genou, il se met\r\n          en devoir de casser la croix en plusieurs morceaux. La croix se\r\n          brise et la plaque métallique, qui l'ornait, vole en l'air.\r\n          Derrière lui, la famille Gouard est restée pétrifiée, seul le père\r\n          Gouard vient vers lui.\r\n                         \r\n          La mère Dollé, qui, elle, voit le père Gouard juste derrière son\r\n          mari maintenant, tente de lui faire des signes muets pour\r\n          l'avertir.\r\n                         \r\n          D'un coup de pied, le père Dollé envoie la croix voler dans les\r\n          airs.\r\n                         \r\n          Berthe, ses fleurs à la main, part en courant vers l'église. Sa\r\n          mère essaie toujours, par des signes muets, de prévenir son mari\r\n          de la présence du père Gouard dans son dos.\r\n                         \r\n          Le père Dollé se retourne et voit enfin son voisin, le chapeau à\r\n          la main. Il ramasse le sien et le remet sur sa tête, le père\r\n          Gouard en fait autant. Ce dernier donne une violente bourrade au\r\n          père Dollé, qui manque perdre l'équilibre et perd son chapeau. Le\r\n          père Dollé donne une violent bourrade à son voisin, qui perd son\r\n          chapeau. Le père Gouard revient vers le père Dollé, le prend par\r\n          le col, et le fait reculer lentement.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Salaud !... Vampire !... Salaud !...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Landru !...\r\n          Sous la poussée du père Gouard, le père Dollé recule de plus en\r\n          plus vite.\r\n                         \r\n          La famille Gouard est toujours pétrifiée à l'entrée du cimetière.\r\n          Francis mord le bord de son chapeau.\r\n                         \r\n          Le père Gouard continue à pousser son adversaire devant lui. Ils\r\n          finissent par tomber, tous les deux, dans une fosse fraîchement\r\n          creusée. Les deux familles accourent, et s'alignent, chacune d'un\r\n          côté de la fosse.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Ah !... vous avez bonne mine, tous les deux !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Tu t'es-t'y fait mal ?\r\n                         \r\n<b>                          JEANNE GOUARD\r\n</b>           Et toi, le père ?\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et ben, répondez, quoi !\r\n          On entend les coups et les grognements des deux combattants.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Oui !... Tiens !...\r\n                         \r\n           LE PÈRE GOUARD (voix off)\r\n           Houlà ! La vache !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Joseph ! Méfie-toi, il est mauvais !\r\n                         \r\n<b>                          JEANNE GOUARD\r\n</b>           Le lâche pas !\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Allez, c'est pas un endroit pour se battre !\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Je voudrais bien savoir où tu t'es battu, toi, déserteur !\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           Oh, mais... déserteur, toi même !\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Je suis pas déserteur, je suis réformé... Moi, j'ai\r\n           l'albumine.\r\n                         \r\n<b>                          FRANCIS GOUARD\r\n</b>           L'albumine !...\r\n                         \r\n          Francis, d'un coup de main, fait voler le chapeau de Raymond.\r\n                         \r\n          Berthe, tenant toujours ses fleurs à la main, arrive en courant,\r\n          suivie du curé, qui porte encore son aube et son étole.\r\n                         \r\n          Les deux familles se retournent vers le curé.\r\n          Au fond du trou, les deux hommes continuent à se battre.\r\n                         \r\n          Les familles s'écartent légèrement pour laisser passer le curé,\r\n          qui se penche, l'air très mécontent.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           C'est fini, non ?\r\n                         \r\n          Les bruits de bagarre continuent. Comme le curé est penché, le bas\r\n          de son étole est au niveau des yeux de Paulette accroupie. Elle\r\n          semble fascinée par les deux belles croix brodées qui ornent\r\n          l'étole, qu'elle touche délicatement.\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Des pères de famille ! Vous n'avez pas honte ?\r\n                         \r\n          Dans le trou, les deux hommes se tiennent toujours par le col.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Monsieur le Curé, il m'a cassé la croix d'Amélie !\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Monsieur le Curé, il m'a volé les deux croix de Georges !\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           C'est pas vrai : je vole pas les morts, moi !\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Si c'est pas toi, qui c'est, alors, ?\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Vous n'avez pas honte !... Non, Dollé, c'est pas lui. Je le\r\n           connais, celui qui s'amuse à voler les croix.\r\n                         \r\n          Derrière le curé, Michel s'éloigne le plus discrètement possible.\r\n          Paulette le regarde partir en hochant la main, avec un air de\r\n          « Ben dis donc, qu'est-ce que vas prendre ! »\r\n                         \r\n<b>                          LE CURÉ\r\n</b>           Il a déjà essayé de voler la croix du maître-autel !\r\n                         \r\n          Michel se sauve en courant à travers les tombes\r\n                         \r\n           LE CURÉ (voix off)\r\n           Michel !... Michel !... Viens ici !\r\n                         \r\n          Michel court de plus en plus vite.\r\n                         \r\n          Les têtes des deux combattants, soudain calmés, émergent du haut\r\n          de la fosse. Ils sont échevelés et ils ont le col en bataille.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Michel !... Michel !...\r\n                         \r\n           LE PÈRE DOLLÉ (hurlant)\r\n           Michel !...\r\n                         \r\n          Michel sort du cimetière en courant. Les membres des deux\r\n          familles, accompagnés du curé, se lancent à sa poursuite. Sauf les\r\n          deux pères, coincés dans la fosse, et Paulette, qui regarde toute\r\n          cette agitation avec une certaine indifférence.\r\n                         \r\n<b>                          VOIX DIVERSES\r\n</b>           Michel !... Michel !... Michel !... Viens ici !...\r\n           Michel !...\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Michel !... Viens ici !... Qu'est-ce que tu as fais ?...\r\n           Regarde ce que tu nous fais, hein !...\r\n                         \r\n          Le père Gouard fait la courte échelle à son voisin, qui sort de la\r\n          fosse et rejoint, en courant, les poursuivants de Michel.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Ben !... Et moi !...\r\n                         \r\n          Il essaie désespérément de sortir de la fosse.\r\n                         \r\n<b>           LE PÈRE GOUARD\r\n</b>           Bande de fumiers !\r\n                         \r\n          Paulette continue à regarder, sans bouger, les gens qui sortent en\r\n          courant du cimetière.\r\n                         \r\n<b>                         FONDU ENCHAÎNÉ\r\n</b>                         \r\n<b>          MOULIN - INTÉRIEUR JOUR\r\n</b>                         \r\n          Les croix du cimetière sont plantées dans le sol de terre battue\r\n          du vieux moulin. Certaines croix sont décorées de fleurs. Sur\r\n          chaque croix, soit fixées sur croix, soit posées au pied de la\r\n          croix, l'une des « étiquettes » rédigées par Michel et portant le\r\n          nom du « défunt » : « Jock, chien », « Tope », « Poussin »,\r\n          « Verre de terre », « Papillon », « Rouge-gorge », etc. Michel,\r\n          assis par terre, face à « son cimetière », contemple son oeuvre\r\n          avec un certain orgueil. Il s'essuie les mains avec des feuilles,\r\n          prend une pomme et mord dedans.\r\n                         \r\n          Fondu au noir\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>                         \r\n          La mère Dollé est en train de se déshabiller. Elle jette son jupon\r\n          sur le lit de Georges, sur lequel il n'y a plus ni drap, ni\r\n          couverture, et se retrouve en combinaison. Assis à table, et\r\n          éclairés par une lampe à pétrole, le père en train d'écrire et\r\n          Renée est en train de lire.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           S'il est pas rentré, c'est qu'il a peur de toi.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Il a pas tort.\r\n                         \r\n          La mère Dollé s'est assise sur son lit et enlève ses bas.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Fais-y pas de mal.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Je ne peux pas lui en faire du mal, je ne sais pas où il\r\n           est !\r\n                         \r\n          Le père se cure les dents avec un morceau d'allumette, puis\r\n          crachote un coup.\r\n                         \r\n          Raymond, déjà couché, joue avec l'avion qu'il s'est fabriqué. Il\r\n          finit de clouer l'hélice.\r\n                         \r\n          Renée tourne une page de son livre, et, très absorbée par sa\r\n          lecture, ne se rend plus compte de ce qu'il se passe autour\r\n          d'elle. Elle se bouche même les oreilles pour être certaine de\r\n          bien s'isoler de sa famille.\r\n                         \r\n          Le père se verse un verre de vin, et le regarde pensivement avant\r\n          de le boire.\r\n                         \r\n          Raymond souffle sur l'hélice de son avion, mais celle-ci ne bouge\r\n          pas.\r\n                         \r\n          Le père boit la moitié de son verre.\r\n          Raymond fait tourner l'hélice avec le morceau de métal qui lui a\r\n          servi à la clouer.\r\n                         \r\n          Le père fait naviguer un peu le vin dans sa bouche avant de\r\n          l'avaler. Il hoche la tête, conscient de la faiblesse\r\n          intellectuelle de son fils. Il finit son verre de vin, se lève un\r\n          peu brusquement, et immédiatement porte les mains sur ses reins.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ouh !...\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           T'as toujours mal ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Mais, Bon Dieu... mais qu'est-ce qu'il a bien pu foutre de\r\n           quatorze croix ? Je comprends pas.\r\n                         \r\n          La mère se glisse dans son lit. Le père Dollé s'approche de Renée.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Allez, toi, va te coucher.\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           Oh, laisse-moi finir.\r\n                         \r\n          Le père Dollé regarde le livre, qui n'est pas en très bon état, et\r\n          dont les pages ont tendance à se détacher.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Qu'est-ce que c'est ?\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           Je sais pas, mais c'est beau !... Ah !...\r\n                         \r\n          Elle râle parce que le père, en lui rendant le livre, l'a quelque\r\n          peu malmené. Le père remet sa casquette sur sa tête. Il prend la\r\n          lampe-tempête pour sortir.\r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Quatorze ?... Quatorze ?...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Quatorze. J'ai refait le compte avec le curé... Et encore,\r\n           je dis même pas celle du Georges.\r\n                         \r\n          Il pose la lampe sur la table et compte sur ses doigts.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tiens... Il y a les Galuchet, un... les Brillon, deux... la\r\n           veuve Contrat, trois...\r\n                         \r\n          Raymond imite son père et compte aussi sur ses doigts.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Celle des Gouard.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oui, celle des...\r\n          Il se tourne vers Raymond.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ta gueule !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Qu'est-ce ça va nous coûter ?\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Oh, c'est pas compliqué... Celle de Georges faisait deux\r\n           cent cinquante francs... Deux cent cinquante multiplié par\r\n           quatorze...\r\n                         \r\n          Derrière la fenêtre, on distingue le visage de Michel qui regarde\r\n          à l'intérieur de la ferme.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Je pose quatorze et je retiens...\r\n                         \r\n          Dans son lit, Raymond essaie de calculer mentalement, mais n'y\r\n          arrive visiblement pas.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           T'as jamais su... Attends seulement que je le retrouve.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR NUIT\r\n</b>                         \r\n          Michel, derrière la fenêtre, regarde ce qui se passe dans la\r\n          ferme, et voit son père se diriger vers la porte. Entendant la\r\n          porte s'ouvrir, Michel s'éloigne en courant. Le père sort de la\r\n          ferme et regarde autour de lui. Mais il ne voit rien et n'entend\r\n          que le chant des grenouilles.\r\n                         \r\n<b>          FERME DES DOLLÉ - GRANGE À FOIN - INTÉRIEUR NUIT\r\n</b>                         \r\n          Michel entre précipitamment dans la grange, et grimpe rapidement à\r\n          l'échelle. Arrivé en haut de l'échelle, il ouvre la petite porte\r\n          qui communique avec le grenier.\r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR NUIT\r\n</b>                         \r\n          Par la grange, Michel entre dans la « chambre de Paulette ». Il\r\n          chuchote.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette !... Paulette !...\r\n                         \r\n          Michel s'aperçoit que le lit est vide. Il tend l'oreille, et\r\n          entendant des voix, il descend quelques marches de l'escalier.\r\n                         \r\n          A travers les barreaux verticaux qui longe l'escalier, il aperçoit\r\n          Renée toujours assise à table en train de lire. Il entend aussi la\r\n          voix de Berthe venant de juste en-dessous de l'escalier. Il tourne\r\n          la tête, puis se rapproche des barreaux.\r\n                         \r\n           BERTHE DOLLÉ (voix off)\r\n           Pourquoi tu veux pas ?... Tu vas me le dire... Hein ?...\r\n                         \r\n          A travers les barreaux, Michel voit Berthe qui embrasse Paulette\r\n          et l'assoit sur un lit.\r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR NUIT\r\n</b>                         \r\n          Michel se colle le visage entre les barreaux pour mieux suivre ce\r\n          qui se passe.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Et puisque tu le sais, dis-le moi.\r\n                         \r\n          Paulette regarde Berthe en pleurnichant.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non ! Je le sais pas.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Mais si, tu le sais, ton nez remue.\r\n                         \r\n          Paulette se prend le nez entre les doigts.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Pourquoi ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Quand il remue, c'est qu'on a menti.\r\n                         \r\n          Paulette semble un peu inquiète.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Ah ?...\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Tu te rends compte de ce qu'il a fait, Michel ? Voler la\r\n           croix de son frère !... Tu crois que c'est beau, ça ?\r\n                         \r\n          Berthe s'agenouille au pied du lit. Paulette se met à pleurer,\r\n          tout en continuant à se tripoter le nez.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Je te demande pas de pleurer, je te demande où elles\r\n           sont... Mais à quoi ça vous sert, des croix ? C'est pas des\r\n           jouets !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non, c'est pas des jouets...\r\n                         \r\n          Berthe lui pousse la main avec laquelle elle tient son nez.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Écoute... Tiens pas ton nez... Monsieur Dollé, il te tapera\r\n           dessus jusqu'à ce que tu aies le derrière tout noir. Alors,\r\n           t'as qu'à me le dire à moi... J'irai les chercher et\r\n           personne ne vous dira rien... C'est pas mieux comme ça ?\r\n                         \r\n          A travers les barreaux, Michel mime le mot « Non ».\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oui.\r\n<b>                          BERTHE DOLLÉ\r\n</b>           Tu vois... Où elles sont ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je ne sais pas.\r\n                         \r\n          Le ton de Berthe se durcit.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ben alors, pourquoi vous êtes venus prendre la brouette\r\n           dans la grange ?... Je vais lui dire, moi, à Monsieur\r\n           Dollé.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu lui diras quoi, à Monsieur Dollé ?\r\n                         \r\n          Berthe et Paulette lève la tête vers le haut de l'escalier.\r\n          Paulette sourit, mais Berthe semble un peu surprise.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Ah ! Te voilà, toi !\r\n                         \r\n          Elle se lève.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et moi aussi je vais lui dire.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Tu lui diras quoi ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Avec qui que t'étais dans la grange.\r\n                         \r\n          Berthe semble un peu mal à son aise, tout à coup.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Menteur.\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Menteuse.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Je l'appelle ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Vas-y !\r\n                         \r\n          Le père Dollé rentre dans la pièce et tire le verrou de la porte.\r\n          Berthe se tourne vers Michel, et prend un ton doucereux pour\r\n<b>                         DIRE :\r\n</b>                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Fais pas le malin.\r\n                         \r\n          Michel grimpe rapidement en haut de l'escalier.\r\n                         \r\n          Le père Dollé pose sa lampe sur une petite table.\r\n                         \r\n           LE PÈRE DOLLÉ (à Renée)\r\n           J'ai dit : « Au lit ! »\r\n                         \r\n          Renée se lève précipitamment de la table, son livre à la main. Son\r\n          père la pousse vers son lit. A la lumière de la bougie posée près\r\n          du lit, Renée continue à lire, tout en se déshabillant. Le père se\r\n          tourne vers Berthe qui tient Paulette dans ses bras.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           J'ai tout bouclé. Si jamais il vient taper cette nuit, mine\r\n           de rien, tu le fais rentrer et tu m'appelles... Compris ?\r\n                         \r\n          On voit furtivement Michel qui observe la scène entre deux\r\n          barreaux de l'escalier. Berthe, qui se sait observée et écoutée,\r\n          prend un ton faussement enjoué pour répondre\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Oui, papa.\r\n                         \r\n          Le père Dollé regarde Paulette dans les bras de Berthe.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Elle n'a rien dit ?\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Non.\r\n                         \r\n          Berthe pose Paulette par terre. Celle-ci ne quitte pas le père\r\n          Dollé des yeux. Berthe embrasse Paulette.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Bonsoir, mon Jésus.\r\n                         \r\n          Berthe pousse Paulette à s'éloigner d'elle. Le père s'approche de\r\n          la bougie qui éclaire le livre de Renée, et la souffle.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           La lumière, c'est pas fait pour lire.\r\n          La scène est tout à coup plongée dans l'obscurité complète.\r\n                         \r\n<b>                          RENÉE DOLLÉ\r\n</b>           J'y vois rien à me déshabiller.\r\n                         \r\n          Le père Dollé ricane.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oh, pour ce que t'as à montrer.\r\n                         \r\n          Paulette commence à monter deux marches de l'escalier et s'arrête\r\n          pour regarder Raymond, allongé dans son lit au pied de l'escalier.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Bonsoir, Monsieur Raymond.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Je te dirai bonsoir quand vous aurez rendu les croix.\r\n                         \r\n          Paulette regarde un instant autour d'elle, puis, comprenant\r\n          qu'elle n'est plus aussi aimée qu'auparavant, elle reprend sa\r\n          marche dans l'escalier.\r\n<b>          FERME DES DOLLÉ - GRENIER - INTÉRIEUR NUIT\r\n</b>                         \r\n          Michel attend Paulette, qui gravit les dernières marches.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tu viens... On y va.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Où ça ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Au cimetière.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oh non ! Pas maintenant, il fait noir.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et puis d'abord, il a tout bouclé. On ira demain.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Il est beau ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ah !... S'il est beau ! Y a toutes les croix... et les\r\n           étiquettes.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Raconte-moi.\r\n                         \r\n          Michel entraîne Paulette loin de l'escalier, de peur qu'on les\r\n          entende.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           J'ai mis des cailloux. Y a toutes les bêtes... et puis des\r\n           fleurs... Y a des assiettes cassées... des escargots.\r\n                         \r\n          Paulette rit. On entend du bruit venant d'en bas. Michel se\r\n          précipite vers la petite porte qui mène à la grange. Mais avant de\r\n          sortir, il lui chuchote :\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je vais me coucher dans la grange.\r\n                         \r\n          Michel referme la porte. Paulette semble très heureuse et elle se\r\n          jette toute habillée sur son lit. Elle se glisse sous la\r\n          couverture sans même enlever ses chaussures.\r\n                         \r\n          Fondu au noir\r\n                         \r\n<b>          FERME DES DOLLÉ - GRANGE À FOIN - INTÉRIEUR JOUR\r\n</b>                         \r\n          On entend le chant du coq. Michel dort dans le foin, enveloppé\r\n          dans un sac à blé. Paulette s'approche de lui et lui chatouille\r\n          l'oreille avec une paille. Il se réveille et se frotte les yeux.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tiens, tu es là ?\r\n                         \r\n          Il se lève, et s'assoit dans le foin à côté de Paulette.\r\n<b>                          PAULETTE\r\n</b>           Bonjour.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Bonjour... Allez... on y va.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Où ça ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Ben, voir le cimetière.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'ai faim.\r\n                         \r\n          Michel sort une pomme de sa poche et la tend à Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tiens.\r\n                         \r\n          Paulette prend la pomme et la sent. Puis elle la remet dans la\r\n          main de Michel.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           J'aime pas les pommes.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           J'ai pas autre chose.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je veux du café au lait.\r\n                         \r\n          Michel se lève, l'air un peu agacé.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oh, ben, t'es pas commode !\r\n<b>          FERME DES DOLLÉ ET DES GOUARDS - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          On voit les deux fermes voisines, et, au loin, une voiture qui\r\n          s'approche et finit pas s'arrêter.\r\n                         \r\n          Dans la cour des Gouard, Francis regarde la voiture et semble très\r\n          inquiet. Il entre rapidement chez lui.\r\n                         \r\n          Près du ruisseau, Raymond est en train de puiser de l'eau. Lui\r\n          aussi voit la voiture s'arrêter, et il semble un peu intrigué.\r\n                         \r\n          Sur le chemin qui mène aux deux fermes, deux gendarmes marchent\r\n          vers les bâtiments.\r\n                         \r\n          Raymond, son broc à la main court vers la ferme.\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Le père, debout près de la table, est en train d'essuyer un verre.\r\n          La mère essuie autre chose derrière lui. Berthe est assise à\r\n          table, et Renée est debout derrière elle\r\n          La porte vers l'extérieur est grande ouverte, et Raymond entre en\r\n<b>                         RIGOLANT :\r\n</b>                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           Ça y est, les Gouard ont porté plainte !\r\n                         \r\n          Le père se tourne vers lui.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ça te fait rigoler, toi ? Et les croix, hein ?... C'est toi\r\n           qui les paieras ?\r\n                         \r\n          Il donne une gifle à Raymond, puis sort sur le pas de la porte. La\r\n          mère et Renée le rejoignent. Le père se tourne vers sa femme.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Et ce cochon qui est même pas rentré !\r\n                         \r\n          Berthe est maintenant debout près de la table.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Il est pas loin.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tu pouvais pas le dire.\r\n                         \r\n<b>                          BERTHE DOLLÉ\r\n</b>           Tu me l'as pas demandé.\r\n                         \r\n          Le père se met à crier :\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Michel !... Michel !...\r\n                         \r\n          Il s'éloigne dans la cour.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>          Les deux gendarmes traversent la passerelle et s'approchent de la\r\n          ferme Dollé.\r\n                         \r\n<b>          FERME DES DOLLÉ - SALLE COMMUNE - INTÉRIEUR JOUR\r\n</b>                         \r\n          La mère Dollé rentre dans la pièce, suivie de Renée.\r\n                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Michel !...\r\n                         \r\n          La mère arrange sa coiffure. Elle semble très nerveuse.\r\n                         \r\n<b>          FERME DES DOLLÉ - GRANGE À FOIN - INTÉRIEUR JOUR\r\n</b>                         \r\n           LE PÈRE DOLLÉ (voix off)\r\n           Michel !...\r\n                         \r\n          Michel regarde par la lucarne et revient vers Paulette.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Merde, v'là les gendarmes !\r\n<b>                          PAULETTE\r\n</b>           Qu'est-ce qu'ils vont nous faire ?\r\n                         \r\n          Paulette prend un sac a blé, et se le met sur le dos en\r\n          frissonnant.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je sais pas... Y a qu'à rien leur dire... Tu jures ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Oui.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non. Dis : « Je jure » !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je jure.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Bon, moi aussi, je dis « Je jure ». Croix en bois, croix en\r\n           fer, celui qui ment, y va en Enfer.\r\n                         \r\n          Il tend la main et crache par terre, puis se retourne vers la\r\n          lucarne.\r\n                         \r\n          Le père Dollé ouvre la porte de la grange.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Michel !...\r\n                         \r\n          Il se dirige vers son fils.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Saligaud, t'as gagné, v'là les gendarmes.\r\n                         \r\n          Il grimpe sur le tas de foin, sur lequel Michel et Paulette sont\r\n          serrés l'un contre l'autre, près de la lucarne.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tu vas dire où elles sont, ces croix ?\r\n                         \r\n          Il trébuche sur un manche de fourche caché dans le foin et s'étale\r\n          dans le foin. Il se relève, jette la fourche loin de lui et se\r\n          dirige vers Michel.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tu le diras, hein ?\r\n                         \r\n          Il essaie d'attraper Michel, qui lui échappe. Paulette se met à\r\n          pleurer.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tête de cochon, tu vas le dire où elles sont, ces croix,\r\n           hein ?\r\n                         \r\n          Il réussit à attraper Michel et le secoue.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Hein ?...\r\n<b>                          MICHEL DOLLÉ\r\n</b>           Non, je le dirai pas.\r\n                         \r\n          Le père jette son fils dans le foin.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Alors, tu finiras en prison !\r\n                         \r\n          Michel se relève.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui, j'aime mieux !\r\n                         \r\n          Alors que Michel essaie de se sauver, le père l'attrape par un\r\n          pied et le fait trébucher. Il le secoue dans tous les sens et lui\r\n          donne des baffes.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Quatorze croix ! Mais, Bon Dieu de Bon Dieu, mais qu'est-ce\r\n           que t'avais à foutre de quatorze croix, hein ?\r\n                         \r\n          Il le soulève comme s'il s'agissait d'une plume et le jette par\r\n          terre.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Oh !... Quatorze croix !... Quatorze milles coups de pied\r\n           au cul, oui ! Hein ?...\r\n                         \r\n          Michel commence à grimper à l'échelle, et son père lui donne un\r\n          grand coup de pied dans le derrière. Puis il l'attrape par une\r\n          jambe et le jette par terre, où il le frappe.\r\n                         \r\n          Paulette se caresse la joue, comme elle le fait chaque fois\r\n          qu'elle est perturbée.\r\n                         \r\n           MICHEL DOLLÉ (voix off)\r\n           Aïe !... Aïe !... Aïe !...\r\n          On entend les bruits de la raclée que prend Michel. Paulette\r\n          pleure doucement, tout en se frottant la joue.\r\n                         \r\n           MICHEL DOLLÉ (voix off)\r\n           Aïe !... Aïe !... Aïe !... Aïe !...\r\n                         \r\n          Paulette suit la punition des yeux et se met à pleurnicher.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel !... Michel !... Michel !...\r\n                         \r\n          La porte s'ouvre et la mère apparaît. Elle semble apaisée, et même\r\n          joyeuse.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Joseph !... Joseph !... Hé, laisse-le !\r\n                         \r\n          Michel saute du haut du la grange, pendant que son père descend\r\n          plus prudemment par l'échelle.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tu vois bien que je suis occupé.\r\n          Comme sa mère est devant la porte, Michel ne peut pas se sauver\r\n          comme il l'escomptait et son père le rattrape.\r\n                         \r\n          La mère s'approche de son mari.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Hé, laisse-le. C'est pas pour ça qu'ils sont venus.\r\n                         \r\n          La mère détache Michel des mains de son père.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           C'est pour Paulette.\r\n                         \r\n          Elle se dirige pour Paulette, toujours pleurnichant contre le mur\r\n          avec son sac sur les épaules.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Paulette ?\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Mais oui, ils viennent la chercher.\r\n                         \r\n          Elle prend Paulette pour l'emmener avec elle. Paulette résiste.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je veux pas !... Je veux pas !... Je veux pas y aller !...\r\n                         \r\n          La mère emmène Paulette avec elle.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Allez, viens, toi !\r\n                         \r\n          Paulette continue à pleurnicher et à pleurer, pendant que la mère\r\n          l'entraîne vers la porte de la grange.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je veux pas y aller ! Je veux pas y aller ! Je veux pas y\r\n           aller !\r\n                         \r\n          Michel réalise, tout à coup, ce qui se passe.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Je veux pas qu'on l'emmène.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           On te demande rien.\r\n                         \r\n          Il repousse son fils\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Mais ils vont pas lui faire du mal. C'est pour l'amener à\r\n           l'orphelinat avec les petites filles.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je veux pas y aller.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Elle ira pas à l'orphelinat.\r\n<b>           LA MÈRE DOLLÉ\r\n</b>           On ne peut tout de même pas la garder.\r\n                         \r\n          Le père, toujours en colère contre son fils, le foudroie du\r\n          regard.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Parce que c'est toi qui commandes, oui ?\r\n                         \r\n          Il se tourne vers Paulette et sa voix se fait plus douce.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Faut pas avoir peur, va... Ils sont gentils.\r\n                         \r\n          Alors que son père, sa mère et Paulette sont à la porte de la\r\n          grange, Michel se rapproche d'eux, et dit, d'une voix plus calme :\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et si je te dis où elles sont, tu la gardes ?\r\n                         \r\n          Son père et sa mère s'arrêtent et se tournent vers lui.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ça n'a rien à voir.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et ben, tu le sauras jamais. T'entends ? Jamais.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Je m'occuperai de toi après.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           C'est pas comme ça que tu les auras !\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et comment alors ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Y a qu'à la garder... Si elle reste, on rendra les croix,\r\n           et puis on demandera pardon à tout le monde. Et puis elle\r\n           ira au catéchisme, et puis à l'école, et elle aidera à la\r\n           maison.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et puis, à la fin, vous vous marierez !\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Alors dis-le où elles sont.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'as pas promis.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Bon... Ben... Ça va, dis-le... Alors, dis-le où elles sont.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Dis-le, Michel.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Elles sont au moulin.\r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Au moulin ?\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Mais pourquoi au moulin ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'as qu'à venir avec moi.\r\n                         \r\n          Michel ouvre la porte pour sortir, mais il bute dans son frère\r\n          Raymond, qui entre suivi des deux gendarmes, qui saluent le père\r\n          Dollé. Le père leur rend un vague salut. Michel recule. Un des\r\n          gendarmes se penche vers Paulette.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Ben... la voilà, ce pauvre petit chou.\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Bonjour, ma petite fille.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non !\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Comment t'appelles-tu ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non !\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Comment elle s'appelle ?\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Nous, on l'appelle Paulette, tout simplement.\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Ah !...\r\n<b>                          (A PAULETTE)\r\n</b>           Ton papa et ta maman, ils ont été tués par les\r\n           bombardements ?\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Non !\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Ben, alors, quoi ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           C'est elle qui nous l'a dit.\r\n                         \r\n          La mère se penche vers Paulette.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Comment non ? Mais rappelle-toi bien, mon poulet.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ayez pas peur, ça va lui revenir.\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Elle a peut-être été commotionnée.\r\n                         \r\n          Le gendarme essaie de prendre Paulette par le menton. Dans un\r\n          premier temps, elle tend le menton, puis elle se recule.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Comme vous dites, oui.\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           On n'a même pas son nom.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           A moi, elle va le dire.\r\n                         \r\n          Elle se penche vers Paulette.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Tu t'appelles Paulette comment ?... Hein ?... Paulette\r\n           comment ?...\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Dollé.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Dollé !... Ben, elle dit qu'elle s'appelle Dollé\r\n           maintenant !\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Je veux m'appeler comme Michel.\r\n                         \r\n<b>                          RAYMOND DOLLÉ\r\n</b>           C'est bien ça, les gosses.\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Ça manque d'éléments.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Mais vous allez la prendre quand même ?\r\n<b>                          UN GENDARME\r\n</b>           On la passera à la Croix-Rouge.\r\n                         \r\n          Le père Dollé se penche vers Paulette.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ah, tu vois, tu vas faire une belle promenade avec ces\r\n           messieurs.\r\n                         \r\n<b>           LA MÈRE DOLLÉ\r\n</b>           Et en automobile encore...\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Ah !...\r\n                         \r\n          Un gendarme sort un livret de sa poche et le pose sur un tonneau.\r\n          Michel semble ne pas vouloir croire ce qu'il voit.\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Allez... vous signez là, Monsieur Dollé.\r\n          Il tend son crayon au père Dollé. Ce dernier, machinalement, le\r\n          mouille avec sa bouche avant d'écrire. Au moment où son père va\r\n          signer, Michel explose.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           T'as pas le droit, t'as promis.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           D'abord, j'ai pas promis... Et puis d'abord, ta gueule !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Menteur !\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           C'est comme ça que tu parles à ton père ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui, il m'avait dit qu'on la garderait si je lui disais\r\n           où... où sont les croix.\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Tu vas te taire ?\r\n                         \r\n          Michel lève machinalement le bras, comme pour éviter la baffe\r\n          qu'il sent imminente.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Et ben, tu les auras pas, tes croix !\r\n                         \r\n          Michel sort en courant de la grange. Le gendarme le regarde\r\n          partir, un peu intrigué.\r\n                         \r\n<b>                          UN GENDARME\r\n</b>           Quelles croix ?\r\n                         \r\n<b>           LE PÈRE DOLLÉ\r\n</b>           Des croix ?... Pfff !...\r\n          Il hausse les épaules et signe.\r\n                         \r\n<b>          FERME DES DOLLÉ - COUR - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel saute une barrière à l'extrémité de la cour, et part en\r\n          courant à travers champs.\r\n                         \r\n<b>          MOULIN - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Michel entre en courant dans le moulin.\r\n                         \r\n<b>          MOULIN - INTÉRIEUR JOUR\r\n</b>                         \r\n          Michel commence à arracher les croix, qu'il jette dans un coin\r\n          près de la fenêtre, qui donne sur la rivière.\r\n                         \r\n          Installé sur sa poutre, près de son nid, le hibou le regarde, un\r\n          peu indifférent.\r\n                         \r\n          Michel continue à arracher les croix et à les empiler près de la\r\n          fenêtre. Arrivé à la tombe du chien de Paulette, il décroche une\r\n          croix plus belle que les autres, attachée sur la croix\r\n          rudimentaire que Michel avait fabriqué avec un bout de bois et du\r\n          fil de fer. Cette croix ouvragée a été réalisée avec du fil de fer\r\n          torsadé sur lequel des petites perles ont été enfilées. Puis il\r\n          décroche aussi, très délicatement, le bracelet cassé de Paulette,\r\n          qui, lui aussi, orne la croix rudimentaire. Il le regarde un\r\n          instant, puis le met dans sa poche. Il s'approche de la la\r\n          fenêtre, qui est en fait un grand trou dans la maçonnerie du\r\n          bâtiment, la véritable fenêtre ayant disparu depuis longtemps. Il\r\n          prend toutes les croix empilées et les jette dans la rivière, où\r\n          elle s'éloignent, emportées pas le courant. Puis, tenant toujours\r\n          la croix ouvragée dans sa main, il court vers l'échelle qui monte\r\n          vers la charpente du moulin. Il grimpe à toute vitesse.\r\n                         \r\n          Arrivée dans la charpente, il s'arrête, car il vient d'entendre le\r\n          bruit d'un moteur de voiture. Il a les larmes aux yeux. Par la\r\n          fenêtre, on aperçoit le nuage de poussière laissée par ce que l'on\r\n          devine être la voiture des gendarmes qui emmènent Paulette. Il\r\n          regarde, une dernière fois, la croix ouvragée, et la jette\r\n          rageusement dans la rivière avec les autres. Il ne lui reste plus\r\n          que le bracelet.\r\n                         \r\n          Il s'approche du hibou, et lui montre le bracelet.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Tiens, garde-le cent ans.\r\n                         \r\n          Le hibou cligne des yeux. Puis Michel suspend le bracelet sur une\r\n          cheville qui dépasse d'une poutre, au-dessus de la tête du hibou,\r\n          qui regarde, un peu intrigué, cet objet brillant. Michel le\r\n          caresse et le hibou ferme les yeux.\r\n                         \r\n<b>          HALL DE LA CROIX-ROUGE - INTÉRIEUR JOUR\r\n</b>                         \r\n          Une femme assez âgée fait boire un petit chat dans un bol. La\r\n          femme se retourne pour prendre un autre bol que lui tend une\r\n          religieuse (qui porte l'uniforme d'époque des soeurs de Saint-\r\n          Vincent de Paul). La femme boit dans un bol et le chat dans\r\n          l'autre.\r\n          Autour de la vieille femme, on aperçoit la foule des réfugiés,\r\n          ainsi que les bénévoles civils ou religieux. Le décor, avec les\r\n          piliers qui supportent des croisées d'ogive, nous indique que nous\r\n          sommes dans un établissement religieux, église ou cloître.\r\n                         \r\n          Une religieuse marche à travers la foule, une étiquette à la main,\r\n          et un dossier sous l'autre bras. Elle cherche visiblement\r\n          quelqu'un. Elle finit par s'approcher de Paulette, assise sur un\r\n          banc. La petite fille a l'air totalement absente. La religieuse\r\n          lui accroche l'étiquette autour du cou, à l'aide d'un cordon.\r\n                         \r\n<b>                          LA RELIGIEUSE\r\n</b>           Voilà ! Il faudra bien la garder.\r\n                         \r\n          Paulette ne regarde même pas la religieuse. Elle a le regard\r\n          absent, fixé dans le vide. La religieuse sort de sa poche une\r\n          petite barre de chocolat, qu'elle donne à Paulette, qui la prend\r\n          machinalement, mais ne cherche même pas à la manger.\r\n                         \r\n<b>                          LA RELIGIEUSE\r\n</b>           Tiens.\r\n          Arrive une femme très distinguée, tailleur élégant et collier de\r\n          perles. C'est visiblement une femme du monde, qui oeuvre en tant\r\n          que bénévole pour la Croix-Rouge.\r\n                         \r\n<b>           DAME BÉNÉVOLE CROIX-ROUGE\r\n</b>           Ah ! Elle a fini par vous dire son nom, ma soeur ?\r\n                         \r\n          Gros plan sur l'étiquette pendue autour du cou de Paulette. Il y\r\n<b>                         EST INSCRIT :\r\n</b>                         \r\n<b>                          CROIX-ROUGE FRANÇAISE\r\n</b><b>           CONVOIS DE MALADES\r\n</b><b>           OU D'ENFANTS ISOLÉS\r\n</b>           Date : 20 juin - N° d'ordre : 2608\r\n           Centre départ : Mérimont ?? (mot illisible)\r\n<b>                          NOM : DOLLÉ\r\n</b>           Prénom : Paulette - Age : 5 ans\r\n           Destination : Clermont Ferrand\r\n                         \r\n                         \r\n<b>                          LA RELIGIEUSE\r\n</b>           Et puis tu verras, ma petite...\r\n                         \r\n          La religieuse lit le nom écrit sur l'étiquette.\r\n                         \r\n<b>                          LA RELIGIEUSE\r\n</b>           ...Paulette... tu verras comme tu seras bien... Tu seras\r\n           avec tout plein de petites filles comme toi, qui ont eu\r\n           beaucoup de malheur, mais, toutes ensembles, vous serez\r\n           quand même bien contentes...\r\n                         \r\n          Paulette, le regard toujours fixé dans le vide, ne semble pas\r\n          écouter la religieuse qui lui parle, ne cherchant même pas à\r\n          comprendre ce qu'elle lui dit.\r\n                         \r\n          La religieuse ramasse son dossier et se relève pour partir\r\n          s'occuper d'autres réfugiés.\r\n<b>                          LA RELIGIEUSE\r\n</b>           Surtout, ne bouge pas... Sois sage...\r\n                         \r\n          La religieuse s'éloigne. Paulette regarde, d'un air absent, les\r\n          gens qui l'entourent. Tout à coup, on entend une voix de femme,\r\n          plus forte que le brouhaha ambiant.\r\n                         \r\n           UNE FEMME (voix off)\r\n           Michel !... Michel !...\r\n                         \r\n          Paulette tourne la tête vers la voix.\r\n                         \r\n          Au milieu de la foule, on voit une femme, qui était assise, se\r\n          lever et appeler :\r\n                         \r\n<b>                          UNE FEMME\r\n</b>           Michel !...\r\n                         \r\n          Paulette se lève, tenant toujours sa barre de chocolat à la main.\r\n          Elle dit, d'une voix de plus en plus sanglotante :\r\n<b>                          PAULETTE\r\n</b>           Michel !... Michel !... Michel !... Michel !... Michel !...\r\n           Michel !...\r\n                         \r\n          Elle se faufile au milieu des réfugiés et se dirige vers l'endroit\r\n          d'où provenait la voix.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Michel !... Michel !...\r\n                         \r\n          Elle finit par retrouver la femme, en train de serrer dans ses\r\n          bras le « Michel » qu'elle cherchait.\r\n                         \r\n          Paulette murmure alors :\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Maman !... Maman !...\r\n                         \r\n          Elle part en courant à travers le hall de la Croix-Rouge, tenant\r\n          toujours sa barre de chocolat à la main, et se faufilant au milieu\r\n          de la foule des réfugiés, vers une destination inconnue, tout en\r\n<b>                         CRIANT :\r\n</b>                         \r\n<b>                          PAULETTE\r\n</b>           Michel !... Michel !... Michel !...\r\n                         \r\n          Le mot « FIN » apparaît en lettre blanches sur la foule des\r\n          réfugiés, filmée en plongée.\r\n                         \r\n          Fondu au noir et musique du film.\r\n                         \r\n<b>                         NOTE\r\n</b>          Ceci marque la fin de la version la plus courante du film. La\r\n          scène qui suit, comme l'était déjà la première scène du film, a\r\n          été coupée dans de nombreuses copies projetées de nos jours. Cette\r\n          scène se déroule d'ailleurs dans le même décor, et avec les mêmes\r\n          personnages que dans la première scène, dont elle est, en fait, la\r\n          suite. Dans cette version « originale », Le mot « FIN » ne\r\n          s'inscrit pas sur l'écran, et on passe directement à la scène\r\n          suivante.\r\n                         \r\n<b>          ILOT BOISÉ - EXTÉRIEUR JOUR\r\n</b>                         \r\n          Le petit garçon, qui ressemble à Michel, referme le livre, pendant\r\n          que la petite fille, qui ressemble à Paulette, pleure à chaudes\r\n          larmes. Les deux enfants sont toujours assis sur le même tronc\r\n          d'arbre que pendant la première scène du film. Michel essaie de\r\n          rouvrir le livre, mais Paulette l'en empêche.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Faut pas pleurer comme ça, c'est une histoire, c'est pas\r\n           vrai.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Mais les histoires aussi c'est vrai !\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Mais c'est pas fini, attends que je te lise la fin...\r\n                         \r\n          Michel rouvre le livre à la dernière page, qu'il cache pour que\r\n          Paulette ne voit pas qu'il s'agit, en fait, d'une page blanche. Il\r\n          improvise donc le texte qu'il fait semblant de lire, tout en\r\n          suivant une ligne imaginaire avec son doigt.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Paulette a retrouvé Michel, ils se sont sauvés tous les\r\n           deux, il se sont cachés et on ne les a pas retrouvés.\r\n                         \r\n          Il ferme prestement le livre et constate, avec satisfaction, que\r\n          Paulette ne pleure plus. Elle s'essuie les yeux.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et si on leur disait de venir avec nous... ici, dans notre\r\n           île.\r\n                         \r\n          Michel balaie du regard le paysage qui l'entoure.\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui... Elle est assez grande pour quatre : elle a mille\r\n           kilomètres.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Et puis on les aimera, tu veux bien ?\r\n                         \r\n<b>                          MICHEL DOLLÉ\r\n</b>           Oui, je veux bien. Je vais leur écrire.\r\n                         \r\n<b>                          PAULETTE\r\n</b>           Dis leur le chemin pour venir. Ils n'ont qu'à suivre la\r\n           mère canard et les canetons. Dis-leur qu'ici, personne\r\n           pourra leur faire de mal... Dis-leur qu'on les attend...\r\n           Dis-leur qu'ils viennent...\r\n                         \r\n          Michel sourit à Paulette, se penche sur elle, l'embrasse sur la\r\n          joue et lui caresse les cheveux. Puis il se lève. Paulette ramasse\r\n          son panier, et se lève à son tour, aidée par Michel, qui la tient\r\n          par la main.\r\n          La caméra s'éloigne des enfants, découvrant la rivière, sur\r\n          laquelle nage une famille de canards. Paulette prend du pain dans\r\n          son panier et le jette aux canards. Puis elle se tourne vers\r\n          Michel.\r\n                         \r\n          Les deux enfants marchent sur le tronc d'arbre, se dirigeant vers\r\n          la rive, Michel tenant Paulette par la main, et la guidant pour\r\n          lui éviter de tomber. Une fois arrivés sur la rive, ils\r\n          s'éloignent en courant.\r\n                         \r\n          Le mot « FIN » s'inscrit sur la rivière et le tronc d'arbre\r\n          couché.\r\n                         \r\n          Fondu au noir et musique du film.\r\n                         \r\n<b>                         NOTE\r\n</b>          Ceci marque la fin de la version « originale » du film.\r\n<b>                          \r\n</b>\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Jeux-Interdits.jpg\"/>\n</td><td><h1>Jeux Interdits</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Jean Aurenche\" title=\"Scripts by Jean Aurenche\">Jean Aurenche</a>  <a href=\"/writer.php?w=Pierre Bost\" title=\"Scripts by Pierre Bost\">Pierre Bost</a>  <a href=\"/writer.php?w=François Boyer\" title=\"Scripts by François Boyer\">François Boyer</a>  <a href=\"/writer.php?w=René Clément\" title=\"Scripts by René Clément\">René Clément</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/War\" title=\"War Scripts\">War</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Jeux Interdits Script.html#comments\" title=\"Jeux Interdits comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:08:50.482367"}