{"title": "Jimmy and Judy", "film_link": "/Movie Scripts/Jimmy and Judy Script.html", "script_link": "/scripts/Jimmy-and-Judy.html", "info_raw": "\n\nJimmy and Judy Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Randall Rubin  Jon Schroder\nGenres  Action\nScript Date : August 2004\n\nRead \"Jimmy and Judy\" Script\n\n\n", "script": "\n\n\n\n                                JIMMY AND JUDY\n          \n          \n                                 Written by          \n          \n                       Randall K. Rubin & Jon Schroder\n          \n          \n          \n\n          \n                                                          CAMERA ON:\n          \n          I/E. BACKYARD - SUBURBAN HOUSE - JUDY'S BEDROOM - NIGHT\n          \n          POV of a HOME VIDEO CAMERA shooting into the window of\n          teenage girl's bedroom.\n          \n          The door inside opens. In walks JUDY OAKS-KELLEN (18), a\n          blond haired, mousy girl, wearing only a T-shirt and panties.\n          As she heads to the mirror we hear...\n          \n          Sound of skin smacking against skin and heavy breathing.\n          Whoever operates the camera is definitely CHOAKIN' THE\n          GOPHER.\n          \n          Judy combs her hair in the mirror, oblivious.\n          \n          The camera operator is in a whack off frenzy as he...\n          \n                                CAMERA OPERATOR (O.C.)\n                    Oh, mmph.\n          \n          He's climaxed.\n          \n          The sounds have stopped, but the tape keeps rolling.    Judy\n          stops combing her hair as...\n          \n          Camera shuts down.\n          \n                                                          CAMERA ON:\n          \n          EXT. HIGH SCHOOL - THE TRACK - DAY\n          \n          Camera shoots from inside a car hidden camera style as Judy\n          runs laps during her gym class. Judy, again, has no idea\n          that she is being filmed as camera zooms in tight.\n          \n          She's tired, sweating profusely, and looks completely\n          miserable. She stops running, exhausted, as the other kids\n          pass her.\n          \n          Suddenly, a very Butch looking female GYM TEACHER (40) walks\n          over and begins BERATING Judy. The Gym Teacher's face turns\n          red as she spews insults inches away from Judy's face.\n          \n          We can't hear what she's saying, but whatever it is, it's\n          cruel, harsh, and very intense. Exhausted and humiliated,\n          Judy holds back tears as...\n          \n          Camera shuts down.\n          \n                                                          CAMERA ON:\n          \n                                                                      2.\n          \n          \n          \n          I/E. JIMMY'S HOUSE - BACKYARD/KITCHEN/LIVING ROOM - DUSK\n          \n          Late summer evening. Camera Operator wipes dirt from the\n          lens with his shirt revealing his face for the first time as\n          he looks at camera. This is the first time we get even a\n          glimpse of JIMMY WRIGHT (21). His looks are striking, even a\n          bit awkward, but not at all unappealing.\n          \n          He throws a mischievously evil look at the lens, then settles\n          his face back to normal. He spins the camera away, pointing\n          it at the back of his house.\n          \n          Through the kitchen window, Jimmy zooms in on his mother\n          (JIMMY'S MOM) (40's) idyllic version of a mom in new\n          millennium suburban housewife clothes. She's on the phone,\n          preparing dinner.\n          \n                              JIMMY (O.C.)\n                    Hey Mom, heard you and Dad doing\n                    the nasty last night. Thanks for\n                    that one. By the way, who the fuck\n                    is Nancy?\n          \n          Camera whips over to JIMMY'S DAD in the LIVING ROOM, well\n          dressed, rich looking and fat in his late 40's, watching\n          baseball on TV, tired after a long day's work. He drinks\n          from a tumbler of expensive scotch neat with an ice cube,\n          munching on mixed nuts from a crystal bowl.\n          \n                              JIMMY (O.C.)\n                    Hey Dad, Mom's on the phone telling\n                    her friends that you're hung like a\n                    light switch.\n          \n          Dad reaches into his pants to give his balls a good scratch.\n          Jimmy gives the play by play like a baseball announcer.\n          \n                              JIMMY (O.C.)\n                    Oh Daddy, there he goes. He makes\n                    the reach and... yes! Both balls\n                    at the same time! One heck of a\n                    double play!\n          \n          Eyes on the TV, Dad takes his hands out of his pants and\n          sniffs them.\n          \n                              JIMMY (O.C.)\n                    And the sniff to finish it off.\n          \n          Satisfied, Dad reaches in and grabs a handful of nuts as he\n          continues to watch TV. We zoom out to see both Mom and Dad,\n          each through different windows.\n          \n                                                                     3.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Fucking freak show.\n          \n                                                           CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - NIGHT\n          \n          Dark and in silhouette, Jimmy flips on the camera by remote.\n          It's too dark to see faces or bodies with any detail, but\n          Jimmy's clearly having sex with a PROSTITUTE in his bed. She\n          is young, black, and looks very much like a prostitute.\n          \n          As he pounds into her...\n          \n                              JIMMY\n                    Do you like that nigger?   Come on\n                    nigger, do you like it?\n          \n                              PROSTITUTE\n                        (humors him)\n                    Oh yeah baby, I like it.\n          \n          By remote, Jimmy shuts down the camera.\n          \n                                                           CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - NIGHT\n          \n          Jimmy's behind   the camera interviewing the Prostitute who\n          sits up in his   bed holding the sheets to cover herself. With\n          the lights on,   we can see that she's clearly unattractive.\n          Jimmy asks his   questions with a gentle confidence.\n          \n                              JIMMY (O.C.)\n                    Okay, so. What was going through\n                    your mind when I called you a\n                    nigger?\n          \n                              PROSTITUTE\n                    This costs you an extra fifty.\n          \n                                JIMMY (O.C.)\n                    I know.\n          \n          She pauses. You can tell she just wants to leave, but is\n          toughing it out for the extra fifty bucks.\n          \n                              JIMMY (O.C.)\n                    Well, what did it feel like?\n          \n          Long pause.\n          \n                                                                      4.\n          \n          \n          \n                                 PROSTITUTE\n                       It felt like nothing.\n          \n                                 JIMMY (O.C.)\n                       What do you mean?\n          \n                                 PROSTITUTE\n                       You ain't the first person to call\n                       me a nigger when we was fucking.\n          \n                                   JIMMY (O.C.)\n                             (not surprised)\n                       Oh.\n          \n                                 PROSTITUTE\n                       Johns call me nigger all the time.\n                       Especially white guys. Nothing\n                       new. Just dirty talk.\n          \n          Long, awkward pause.      Jimmy Doesn't know what to say.\n          \n                                   PROSTITUTE\n                       That it?\n          \n          No reply from Jimmy.\n          \n                                 PROSTITUTE\n                       What about you? You like calling\n                       me nigger? You get your nut off?\n          \n                                   JIMMY (O.C.)\n                             (calmly)\n                       No.\n          \n                                 PROSTITUTE\n                       Then why'd ya call me that?\n          \n                                 JIMMY (O.C.) (O.C.)\n                       Have you ever wondered what it was\n                       like to treat someone so completely\n                       cruel that it was unthinkable?\n          \n          No answer.\n          \n                                 JIMMY (O.C.)\n                       I was trying to do the unthinkable\n                       and unimaginable when I called you\n                       that. I wanted to see if was even\n                       possible for me to do that.\n          \n          They pause.\n          \n                                                           5.\n          \n          \n          \n                                PROSTITUTE\n                    Yeah, so?\n          \n          Jimmy speaks softly and confidently.\n          \n                              JIMMY (O.C.)\n                    I think I want to die. Like I\n                    don't deserve to live anymore.   And\n                    that I will never want to do\n                    something like that to someone\n                    again.\n          \n          The prostitute finds Jimmy's answer endearing.\n          \n                              PROSTITUTE\n                    Why ya wanna die?\n          \n                              JIMMY (O.C.)\n                    Because everyone hates me.\n          \n          Pause.\n          \n                              JIMMY (O.C.)\n                    They hate me because I seek beauty\n                    and appreciate destruction. They\n                    hate my mind, my thoughts, my\n                    imagination. They hate everything\n                    about me. And I hate them.\n          \n                              PROSTITUTE\n                        (trying not to care)\n                    Really?\n          \n                              JIMMY (O.C.)\n                    Yep. Everyone. Everyone that\n                    knows or who has ever met me.\n          \n                              PROSTITUTE\n                    Your parents don't hate you. Look\n                    at this room in this big 'ole house\n                    you got.\n          \n                              JIMMY (O.C.)\n                    My parents provide me with food and\n                    shelter because they have been\n                    conditioned by society into\n                    thinking it's the appropriate thing\n                    to do. In reality they can't stand\n                    to be in the same room with me.\n                    They're fascists, brainwashed, and\n                    unforgiving.\n                              (MORE)\n          \n                                                                    6.\n          \n                              JIMMY (O.C.) (cont'd)\n                    They dismiss my feelings of ill\n                    regard towards them on simple\n                    rebelliousness of youth, but that's\n                    only because they are patently and\n                    intentionally unaware of their own\n                    hypocrisies.\n          \n          Prostitute looks bored/frustrated again.\n          \n                              JIMMY (O.C.)\n                        (accidental condescension)\n                    Do you understand me?\n          \n                              PROSTITUTE\n                    You wanna know what I think?\n          \n                              JIMMY\n                    Yes, I really do.\n          \n                              PROSTITUTE\n                    I think you're a spoiled ass white\n                    boy, thinks you everything, but you\n                    don't know shit. All you do is\n                    bullshit complain and there's folks\n                    out there that'd kill for all this.\n          \n          Jimmy doesn't react.\n          \n                              PROSTITUTE\n                    I don't feel sorry for you.\n          \n                              JIMMY (O.C.)\n                        (calmly)\n                    No one is asking you to.   Thank you\n                    for letting me film you.\n          \n          Camera turns off.\n          \n                                                           CAMERA ON:\n          \n          I/E. HIGH SCHOOL - PARKING LOT/JIMMY'S CAR - DAY\n          \n          Jimmy hides hidden camera style inside his car in the high\n          school parking lot, bleachers in the distance. School is\n          letting out as he zooms in on Judy.\n          \n          She's looking at the ground as she's taunted by a group of\n          Other Harassing Teenagers, a tear streaming down the side of\n          her cheek.\n          \n          Suddenly, Judy is bashed in the face with a school bag. She\n          falls to the ground, then picks up her broken glasses as\n          camera zooms out to catch the Girl who hit her (Mean Girl).\n          \n                                                                   7.\n          \n          \n          \n          Nearby, a big, Dumb Looking Bully Type (18) taunts her as she\n          cries. His taunts are biting and as excessive as the Mean\n          Girl's, then he dumps a cup of soda on Judy's head as she's\n          crying.\n          \n          Judy screams at the top of her lungs. The group runs off\n          laughing. Jimmy whip pans to the Mean Girl as she laughs\n          with her friends, then whips pans back to Judy, now on her\n          feet, blood running from her nose and onto her white shirt.\n          \n          Camera shuts down.\n          \n                                                         CAMERA ON:\n          \n          I/E. JUDY'S HOUSE - JUDY'S BEDROOM - NIGHT\n          \n          A scene we've seen before. Jimmy is off camera videotaping\n          Judy through her bedroom window. We hear him FLOGGIN' THE\n          DOLPHIN off screen while Judy combs her hair in the mirror.\n          She stops when she hears...\n          \n          A Grown Man, (45), walks into the doorway of her bedroom.\n          This is JUDY'S DAD. He comes in and doesn't say a thing to\n          her. Judy doesn't acknowledge him at all and continues\n          combing her hair as though he's not even there.\n          \n          He comes up behind her, then wraps his arms around her,\n          giving her a warm hug from behind. Something's not right.\n          The masturbation sounds STOP.\n          \n          Judy's noticeably uncomfortable but doesn't resist as her\n          Father begins kissing her neck. His hand slowly creeps down\n          to her pelvic area, his other hand turning out the bedroom\n          light. The room goes dark.\n          \n          Camera flips down, then OFF...\n          \n          Then COMES BACK ON AGAIN\n          \n          Once again we're looking through the camera pointing at the\n          window, but now it's the distorted, grainy, black and white\n          of \"Nite Shot\" mode. Though we see the Judy's mirror and her\n          dresser, she and her Father are nowhere to be found.\n          \n          Whatever's going on between them, it's going on out of frame,\n          away from the view of the window. Camera shuts down.\n          \n                                                         CAMERA ON:\n          \n                                                                       8.\n          \n          \n          \n          INT. JIMMY'S HOUSE - DINING ROOM - NIGHT\n          \n          Jimmy films once again, hidden camera style, long lens from\n          far away. Frame is close on Judy sitting at the dining room\n          table.\n          \n          As camera pulls back, we HEAR but don't see Judy's Parents\n          talking to Jimmy's Mom and Dad at the table. Judy is bored,\n          completely uninterested in their conversation.\n          \n                              JIMMY'S MOM (O.C.)\n                    So Melissa talked Gary into the SL\n                    instead of the seven series. I\n                    couldn't believe it.\n          \n          Judy looks over at camera, catching the fact that she's being\n          videotaped. Jimmy keeps filming.\n          \n                              JIMMY'S DAD (O.C.)\n                    They paid way too much.\n          \n          As Jimmy zooms in, she clandestinely flips off the camera.\n          \n                              JUDY'S DAD\n                    I strictly buy American anyway.\n          \n          Judy gets up.   Her mom stops her.\n          \n                              JUDY'S MOM (O.C.)\n                    Where you going honey?\n          \n                                JUDY\n                    Bathroom.\n          \n          As Judy leaves the table she walks towards camera as it shuts\n          down.\n          \n                                                         CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - NIGHT\n          \n          Judy sits on Jimmy's bed, staring into the camera.   She's\n          uncomfortable sitting there. It's poorly framed.\n          \n                              JUDY\n                    Can we start already?\n          \n                              JIMMY (O.C.)\n                    One second.\n          \n          Camera shuts off.\n          \n                                                                       9.\n          \n          \n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - DAY\n          \n          Jimmy films Judy again, better framing this time.      Judy looks\n          annoyed and uncomfortable in front of the camera.\n          \n                              JIMMY (O.C.)\n                    Who do you hate most in the world\n                    and why?\n          \n                              JUDY\n                        (kind of bitchy)\n                    Why? Who cares?\n          \n                              JIMMY (O.C.)\n                    I do.\n          \n                              JUDY\n                    God, I just wanted to come up here\n                    to say \"hi\" and get away from my\n                    parents' bullshit for like two\n                    seconds and you have to put the\n                    stupid camera in my face.\n          \n          Jimmy takes delight in Judy's displeasure of being filmed.\n          \n                              JIMMY (O.C.)\n                    Now we're onto something.\n          \n          Judy wants to go and then doesn't.\n          \n                              JUDY\n                    You're weird Jimmy. You were weird\n                    when we were kids and now you're\n                    just getting weirder.\n          \n                              JIMMY (O.C.)\n                    Is that why you had a crush on me?\n          \n                              JUDY\n                        (scoffs)\n                    Yeah right.\n          \n                              JIMMY (O.C.)\n                    You didn't have a crush on me?\n          \n          Judy fidgets, he's got her.\n          \n                              JUDY\n                    You're a loser. You're twenty one\n                    and you're still living with your\n                    parents.\n          \n          She's waiting for a response.    Jimmy doesn't bite.\n          \n                                                             10.\n          \n          \n          \n                              JUDY\n                    I heard that you got kicked out of\n                    college because you tried to talk\n                    your roommate into killing himself.\n          \n                              JIMMY (O.C.)\n                    Where'd you hear that?\n          \n                              JUDY\n                    From everyone.\n          \n          Jimmy waits.   Judy's curious how he'll respond.\n          \n                              JIMMY (O.C.)\n                    You wanna know the truth?\n          \n                               JUDY\n                    Yeah.\n          \n                              JIMMY (O.C.)\n                    He asked me if he should kill\n                    himself. I told him to look inside\n                    himself for the answer. I didn't\n                    tell him to. I didn't tell him not\n                    to. I said he shouldn't be afraid\n                    of the unknown. If he was going to\n                    kill himself, I wanted him to do it\n                    for the right reasons.\n          \n                              JUDY\n                    I swear to God, you're a fucking\n                    psycho.\n          \n                              JIMMY (O.C.)\n                    Like you're normal.\n          \n                              JUDY\n                    More than you.\n          \n                              JIMMY (O.C.)\n                    If I'm such a freak, what are you\n                    doing in my room?\n          \n                              JUDY\n                    I was bored.\n          \n          Jimmy waits, assessing the situation.\n          \n                              JIMMY (O.C.)\n                    I wanna show you something?\n          \n                                                                   11.\n          \n          \n          \n          Judy looks up at the camera.   Before she can answer, camera\n          shuts down.\n          \n                                                          CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - NIGHT\n          \n          Judy sits on the edge of Jimmy's bed facing a television set.\n          Jimmy films from behind her so he gets Judy's back and the\n          television in the shot. The screen is static.\n          \n                              JUDY\n                    I can't believe I'm doing this.\n          \n          Nothing's happening.   Judy's getting antsy.\n          \n                              JUDY\n                        (offended; turns to\n                         camera)\n                    Can you start the tape?\n          \n          Jimmy clicks the VCR with his remote, as Judy turns back to\n          watch. On TV, static flips to black.\n          \n                              JUDY\n                    Don't think this means I like you\n                    or anything.\n          \n          A few seconds.   Nothing on TV yet.\n          \n                              JUDY\n                    And as soon as this is over I'm\n                    going back downstairs.\n          \n          An image flips on the TV.\n          \n          BEGIN JIMMY'S REVENGE TAPE\n          \n          EXT. HIGH SCHOOL - TEACHER'S PARKING LOT - (ON JIMMY'S TV) -\n          DAY\n          \n          Someone (Jimmy) has placed the camera on the ground and is\n          facing a car in a parking lot at school.\n          \n                              JIMMY (O.C.)\n                        (in bedroom)\n                    That's Mrs. Holzclaw's car. She's\n                    your P.E. teacher, right? I hated\n                    her too.\n          \n          Jimmy enters frame and punches a Butterfly Knife into the\n          sidewall of Mrs. Holzclaw's car sending air HISSING as the\n          tire sinks.\n          \n                                                                   12.\n          \n          \n          \n                              JIMMY (O.C.)\n                    And Bill McAllister... I went to\n                    school with his brother. They're\n                    both dicks.\n          \n          Tape cuts to...\n          \n          EXT. HIGH SCHOOL - ENTRANCE (ON JIMMY'S TV) - DAY\n          \n          On TV, hidden camera style (long lens from a distance) the\n          Dumb Looking Bully Type (Bill McAllister) is taken out of\n          school in cuffs into a waiting Squad Car.\n          \n                              JIMMY (O.C.)\n                        (in bedroom)\n                    I planted an ounce of weed in his\n                    locker then sent an anonymous\n                    letter to Principal Lipsky.\n          \n          EXT. HIGH SCHOOL - ENTRANCE (ON JIMMY'S TV) - DAY\n          \n          Same location, different day. On TV, again hidden camera\n          style, a girl is being rolled out of the school on a\n          stretcher. It's the Mean Girl, the one who smacked Judy in\n          the face with her school bag.\n          \n          She's placed into an ambulance.\n          \n                              JIMMY (O.C.)\n                    I took care of her too.\n          \n          Jimmy clicks the television set off with his remote.\n          \n          END JIMMY'S REVENGE TAPE\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - DAY\n          \n          The TV is off. All we see is Judy's back. She hasn't once\n          turned around to face the camera during any of the clips.\n          \n          She sits still.\n          \n          She trembles but doesn't turn around. She collects herself\n          but still doesn't turn around. Jimmy holds the camera\n          steady.\n          \n          Still she doesn't turn around.\n          \n          She fidgets in her seat but still doesn't turn around.\n          \n          She now sits still on the edge of the bed like she is in a\n          trance, but still doesn't turn around to face the camera.\n          \n                                                                   13.\n          \n          \n          \n          No movement.\n          \n          No movement.\n          \n          No movement.\n          \n          She begins to breath heavily.\n          \n          Then no movement.\n          \n          She leans her head down towards the floor.\n          \n          Then no movement.\n          \n          Still no movement or any reaction for that matter.   It's like\n          she is in a trance and can't wake up.\n          \n          Jimmy (O.C.) continues to roll without budging.\n          \n          Still no movement.\n          \n          It looks like she's about to turn around. She moves her head\n          in the direction of the camera, then assumes her original\n          position facing the TV.\n          \n          Then... no movement.\n          \n          Still no movement.\n          \n          Then Judy collapses onto the bed. Jimmy, still rolling, gets\n          off the bed and begins filming her as she lies on the floor\n          crying hysterically.\n          \n          Judy cries and cries and cries and cries. She then lets out\n          a cry from the depths of her soul. The cry is long, hard,\n          and loud.\n          \n          Jimmy gets up, then stands above her with the camera.\n          \n          She rolls over on her back and is now facing directly into\n          the camera. She tries to collect herself.\n          \n                              JUDY\n                    Why did you do that?\n          \n                                 JIMMY (O.C.)\n                    I had to.\n          \n                                 JUDY\n                    Why?\n          \n                              JIMMY (O.C.)\n                    I did it for you.\n          \n                                                                    14.\n          \n          \n          \n                                JUDY\n                      I don't understand.\n          \n          Judy tries hard to stop, but just sobs harder and louder than\n          before.\n          \n                                JUDY\n                      Please tell me.\n          \n                                JIMMY (O.C.)\n                      I felt like if I didn't save you\n                      then no one else would.\n          \n                                JUDY\n                          (screams)\n                      Please turn off the FUCKING CAMERA!\n          \n          A muffled voice comes through the door from downstairs.\n          \n                                JIMMY'S DAD (O.C.)\n                      Jimmy! What the hell are you guys\n                      doing up there?\n          \n          Judy stops, realizing suddenly that she's been screaming.\n          \n          Camera shuts down.\n          \n                                                            CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - STAIRWAY/ENTRYWAY/LIVING ROOM - NIGHT\n          \n          Jimmy's behind the camera. He stands at the head of the\n          stairs shooting down. Sounds of a dinner party just getting\n          started come from downstairs. He walks down the steps into\n          the party.\n          \n          A generic \"Happy Twentieth Anniversary\" sign hangs above the\n          front door. Camera pans awkwardly to a lame K-Mart style\n          studio portrait on the wall. It's Jimmy's parents wearing\n          saccharine sweet smiles, Dad's hair slicked back, Mom in an\n          overdone hair-do and in way too colorful clothing.\n          \n          Gifts sit on the entry-way table. Party Guests are dressed\n          nicely and are mingling in the house, drinks in hand. Dinner\n          is yet to start. As Jimmy moves into the...\n          \n          ENTRY-WAY\n          \n          People at the party all turn to camera, a look of shock on\n          their faces as Jimmy walks through.\n          \n          More and more people react with gasps and revulsion at\n          camera, but we can't tell why. Jimmy moves camera to the...\n          \n                                                                   15.\n          \n          \n          \n          LIVING ROOM\n          \n          The place is full of More Party Guests. Frame moves across a\n          huge mirror on the wall over a cocktail bar. We catch a\n          glimpse of Jimmy's image and realize...\n          \n          Jimmy is completely NAKED and has PAINTED HIS ENTIRE BODY\n          SILVER.\n          \n          Camera quickly turns away from the mirror as some people run\n          from the room.\n          \n          One of the Female Party Guests (#1) SCREAMS.\n          \n                               FEMALE PARTY GUEST #1\n                        (covers her mouth)\n                    Oh my God!\n          \n          Jimmy keeps filming, catching people's reactions.\n          \n          He points the camera at a Female Party Guest #2.\n          \n                              JIMMY (O.C.)\n                    Hey, great party, huh? I'm making\n                    a tape for my parents. Want to say\n                    something to them?\n          \n          Female Party Guest #2 is just too stunned to speak.\n          \n                              JIMMY'S MOM (O.C.)\n                    Jimmy!\n          \n          Jimmy turns the camera at his mother who is completely\n          shocked to see him like this.\n          \n                              JIMMY (O.C.)\n                    Hey Mom. Happy anniversary. You\n                    want to say anything to yourself?\n          \n                              JIMMY'S DAD\n                    That's enough.\n          \n          Jimmy's Dad runs into the room and throws a blanket over\n          Jimmy's head, body and the camera. All we see is black and\n          flashes of light from under the blanket.\n          \n                              JIMMY'S DAD (O.C.)\n                        (muffled)\n                    Get out! Now!\n          \n                                                                  16.\n          \n          \n          \n          Camera's under the blanket as we hear Jimmy's Dad pushes him\n          from the room. Camera shuts down.\n          \n                                                         CAMERA ON:\n          \n          INT. THERAPIST'S OFFICE - DAY\n          \n          Camera is being removed from the camera bag. As the lens\n          pans quickly, we catch a glimpse of Jimmy smirking, holding\n          the camera. He's way too close to the lens.\n          \n          He flips it around until it locks on DR. WALTERS, MFCC (40),\n          Jimmy's not very accomplished therapist. Walters seems to\n          have a very gentle and nonthreatening aura that suggests he's\n          the type of person you would feel comfortable talking to. He\n          sits by the window in his relatively uninteresting office.\n          Jimmy has turned on the camera in the middle of their first\n          session together.\n          \n                              DR. WALTERS\n                    Jimmy, we discussed this. You\n                    can't tape our sessions. It's not\n                    allowed.\n          \n          The camera doesn't move.\n          \n                              DR. WALTERS\n                    You know, you can't film someone\n                    who doesn't want their image and\n                    voice recorded. Technically,\n                    you're actually breaking the law.\n          \n          Jimmy (O.C.) doesn't respond.\n          \n                              DR. WALTERS\n                    Does your defiance make you feel\n                    more powerful?\n          \n          Still no answer.\n          \n                              DR. WALTERS\n                    Filming people makes you feel like\n                    you're in control of the situation\n                    doesn't it?\n          \n          Still no answer.\n          \n                              DR. WALTERS\n                    I can sit here as long as you can.\n                    You're not going to be able to\n                    force me to participate in your\n                    little game here.\n          \n                                                                    17.\n          \n          \n          \n          No movement from the camera.\n          \n                               DR. WALTERS\n                     Jimmy, this isn't something that\n                     friends do to each other is it?\n          \n          Dr. Walters sits in front of the camera, trying to stay\n          perfectly still and calm.\n          \n          Dr. Walters is so nice and so calm, that we start to feel\n          sorry for him.\n          \n          No movement.\n          \n          No movement.\n          \n          Dr. Walters fidgets.\n          \n          Then holds still.\n          \n          Then fidgets, trying to stay calm.\n          \n                               DR. WALTERS\n                     Jimmy, put the camera away, please.\n          \n          No movement.\n          \n                               DR. WALTERS\n                     You're wasting your time and mine,\n                     Jimmy. We could be doing something\n                     productive.\n          \n          The camera shakes a bit.     Jimmy's laughing.\n          \n          Dr. Walters is doing his best to stay calm.\n          \n                               DR. WALTERS\n                     That's enough.\n          \n          No movement.\n          \n                               DR. WALTERS\n                     Put it away.\n          \n          Nothing.\n          \n                                  DR. WALTERS\n                     Now Jimmy!\n          \n          Dr. Walters gets up and comes towards the camera.   He grabs\n          it just above the lens and tries to take it away.\n          \n                                                                      18.\n          \n          \n          \n                              DR. WALTERS\n                    Come on Jimmy.\n          \n          A fierce battle of tug of war breaks out.      We see Dr. Walters\n          becoming increasingly pissed off.\n          \n          The back and forth is suddenly getting violent, until...\n          \n                              DR. WALTERS\n                    Gimme the Goddamn fucking camera!\n          \n          Dr. Walters finally gets the camera free from Jimmy.     Camera\n          shuts off.\n          \n                                                             CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM/UPSTAIRS HALLWAY - DAY\n          \n          Jimmy's behind the camera, moving quickly down the hall to...\n          \n          JIMMY'S BEDROOM\n          \n          Judy is sitting on his bed.   She sees Jimmy come in with the\n          camera and freaks out.\n          \n                             JUDY\n                    No. No filming.     I'm leaving, I\n                    swear.\n          \n          Judy gets up to go.\n          \n                              JIMMY\n                    Okay, okay. Wait.\n          \n          As Jimmy gets up to stop her, camera shuts off.\n          \n                                                             CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - DAY\n          \n          Jimmy is filming Judy, who is sitting on his bed. Her face\n          is red, her eyes have watered up, and her nose is snotty and\n          running from after an intense session of crying. Jimmy is\n          catching her seconds after she's has finally composed\n          herself.\n          \n                              JIMMY (O.C.)\n                    Say what you said to me before.\n          \n                              JUDY\n                    I don't know how I said it.\n          \n                                                        19.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Paraphrase it then.\n          \n                                 JUDY\n                    Do what?\n          \n                              JIMMY (O.C.)\n                    Say it like you did before but it\n                    doesn't have to be exactly the\n                    same.\n          \n                              JUDY\n                    You mean paraphrase it.\n          \n                              JIMMY (O.C.)\n                    That's what I said.\n          \n                              JUDY\n                    I didn't hear you.\n          \n          Judy stares off camera.\n          \n                              JIMMY (O.C.)\n                    Are you ready?\n          \n                              JUDY\n                    I'm waiting for you.\n          \n                                 JIMMY (O.C.)\n                    OK.\n          \n                              JUDY\n                    Tell me when.\n          \n                                 JIMMY (O.C.)\n                    Now.\n          \n                              JUDY\n                    You want me to paraphrase it?\n          \n                                 JIMMY (O.C.)\n                           (impatient)\n                    Yes!\n          \n          Judy thinks for a beat.\n          \n                              JUDY\n                    I can't remember what I said.\n          \n                              JIMMY (O.C.)\n                    Then just ad-lib.\n          \n                                                                  20.\n          \n          \n          \n                                JUDY\n                    Ad-lib?\n          \n                                JIMMY (O.C.)\n                    Yes.\n          \n          Judy thinks for a beat.\n          \n                              JUDY\n                    I don't know what that means.\n          \n                              JIMMY (O.C.)\n                        (getting frustrated)\n                    It means make it up.\n          \n                              JUDY\n                        (confused)\n                    Do you want me to make something up\n                    or paraphrase what I did the first\n                    time?\n          \n          This isn't working.   The camera drops from Judy.\n          \n                              JIMMY (O.C.)\n                    Let's take a break.\n          \n          Camera shuts down.\n          \n                                                          CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - DAY\n          \n          Camera's on a tripod. Jimmy sits in a chair, the back of his\n          shoulder foregrounds Judy.\n          \n                              JUDY\n                    I'm not good on camera.    It makes\n                    me nervous.\n          \n                              JIMMY\n                    Forget about the camera.   Talk to\n                    me.\n          \n                                JUDY\n                    OK.\n          \n                              JIMMY\n                    Tell me what you said earlier.\n                    About me about how you felt when\n                    you saw the video.\n          \n                                                                       21.\n          \n          \n          \n                                 JUDY\n                           (relaxes)\n                       It felt like someone had been\n                       reading my mind.\n          \n          She stops.\n          \n                                 JIMMY\n                       Go on.\n          \n                                  JUDY\n                       It was like someone had jumped into\n                       my head and watched what was being\n                       projected.\n          \n          Now Judy completely has forgotten that the camera is there.\n          \n                                 JIMMY\n                       And earlier, what you said about\n                       God.\n          \n          Jimmy zooms in the camera by remote.    Judy's distracted.\n          \n                                 JIMMY\n                           (off her look)\n                       Tell me.\n          \n          Judy refocuses.\n          \n                                 JUDY\n                       I said that it felt like God had\n                       sent someone to protect me, and to\n                       look out for me.\n          \n          She looks at Jimmy as if he is an angel.\n          \n                                 JUDY\n                       And I said that you are the only\n                       person in my life who has ever\n                       looked after me like that.\n          \n          Judy tries to stifle tears, but they're starting to flow\n          again. As camera zooms in further, Judy catches sight of\n          Jimmy's finger on the remote and BLOWS HER FUCKING TOP,\n          leaping from her chair.\n          \n                                 JUDY\n                       God, I hate it when you film me\n                       crying!\n          \n          Judy goes for the camera, struggling to get it off the\n          tripod, she finally frees it and points it at Jimmy.\n          \n                                                                      22.\n          \n          \n          \n                              JUDY (O.C.)\n                    How do you like it, huh? How do\n                    you like having a camera shoved\n                    right up your ass?\n          \n          Camera's framed poorly, moves around a lot, goes in and out\n          of focus, etc.\n          \n                              JUDY (O.C.)\n                    Do you like it? Do you?\n          \n                              JIMMY\n                    I don't like it or dislike.   I'm\n                    used to it.\n          \n          Judy moves the camera directly in his face. The lens is\n          millimeters away from his nose. We see an extreme close up\n          of his nostrils.\n          \n                              JIMMY\n                    Generally I'd place the camera\n                    further away from my nose, but if\n                    this is your preferred shooting\n                    style then I guess I'll have to\n                    adjust to it.\n          \n          Jimmy leans in and rests his nose on the lens.\n          \n                              JIMMY\n                    How's this work for you?\n          \n          Judy pulls back and continues filming him.\n          \n                              JUDY (O.C.)\n                    Give me a break.\n          \n                              JIMMY\n                    OK.\n          \n          Now Judy's the interviewer.   Her framing is not quite as\n          adept as Jimmy's.\n          \n                              JUDY (O.C.)\n                    So... why do you have to film\n                    everything?\n          \n                              JIMMY\n                    I don't film everything.\n          \n                              JUDY (O.C.)\n                    Why do you like to film me crying?\n          \n                                                                    23.\n          \n          \n          \n                                JIMMY\n                    I don't.\n          \n                              JUDY (O.C.)\n                    Then why do you?\n          \n                              JIMMY\n                    Because it's rare that I get to\n                    find someone that lets their\n                    emotions go. When a person is\n                    crying, I mean truly crying, or\n                    truly laughing or smiling or\n                    frowning or gasping. For a few\n                    seconds or minutes I get a chance\n                    to see that person's soul. And\n                    really, now that you've forced me\n                    to think about it. I think it's a\n                    very rare and beautiful thing to be\n                    afforded that opportunity.\n          \n          Judy is shaken and speechless.\n          \n                              JIMMY\n                    Anything else?\n          \n          Judy's moved and forgets herself.   Camera drops from Jimmy.\n          \n                                JUDY (O.C.)\n                    Why me?\n          \n          Jimmy helps her put the camera back up on him.\n          \n                                JIMMY\n                    Because.\n          \n          Jimmy sits still.    Judy doesn't know what to do with that.\n          \n                              JIMMY\n                    Why do you think?\n          \n          Judy doesn't have an answer.\n          \n          Jimmy reaches forward and takes the camera away from her and\n          turns the interview around.\n          \n                              JIMMY (O.C.)\n                    Why you and why me? Why are we\n                    together right now?\n          \n          Judy doesn't know what to say.\n          \n                                                                    24.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Go ahead say it. I want you to.     I\n                    know what you're going to say so\n                    just say it.\n          \n                                 JUDY\n                    Stop.\n          \n                                 JIMMY (O.C.)\n                        (soft)\n                    Tell me.\n          \n          Judy fidgets.\n          \n                              JIMMY (O.C.)\n                        (bullies her)\n                    Tell me!\n          \n          Judy fidgets again, then...\n          \n                              JUDY\n                        (blows her top)\n                    Because we're both fucking weird!\n          \n          Judy pauses. The pressure of the camera from Jimmy makes her\n          feel like she has to give him more.\n          \n                              JUDY\n                    Because we're the two weirdest kids\n                    in the world. And God made us for\n                    each other and I fucking love you,\n                    and you did all this because you\n                    love me too, and fuck everyone and\n                    everything that doesn't get it!\n          \n          Judy's out of breath.    Camera still points at her.\n          \n                              JUDY\n                    That's right, right?\n          \n          Judy stares back at the camera, longing for an answer from\n          Jimmy. She told him she loved him. Camera shuts down.\n          \n                                                            CAMERA ON:\n          \n          I/E. HIGHWAY FIRST-KISS-SMILEY-FACE/JIMMY'S CAR - DAY\n          \n          Jimmy is driving in his car with Judy in the passenger seat.\n          Judy has the camera and she is interviewing Jimmy as he\n          drives.\n          \n                              JUDY (O.C.)\n                    Where are you taking me?\n          \n                                                          25.\n          \n          \n          \n                              JIMMY\n                    To a beautiful place.\n          \n                                 JUDY (O.C.)\n                    Where?\n          \n                              JIMMY\n                    Chuck E. Cheese.\n          \n          Judy and Jimmy laugh together.\n          \n                              JUDY (O.C.)\n                    No seriously.\n          \n                              JIMMY\n                    I can't tell you.    It'll ruin it.\n          \n                                 JUDY (O.C.)\n                    Fine.\n          \n          Judy sulks for a second.\n          \n                              JUDY (O.C.)\n                    Jimmy, can I ask you something?\n          \n                                 JIMMY\n                    Anything.\n          \n                              JUDY (O.C.)\n                    Do you hate your parents?\n          \n                              JIMMY\n                    Yes, but I understand them.\n          \n                              JUDY (O.C.)\n                    What's to understand?\n          \n                              JIMMY\n                    Lots of things.\n          \n                                 JUDY (O.C.)\n                    Like what?\n          \n                              JIMMY\n                    I understand that my ascension into\n                    young adulthood triggered their\n                    descent into mid-life crisis.\n                    Generally when an only child leaves\n                    the nest, the parents begin\n                    reassessing their own lives. They\n                    see us as a younger, better version\n                    of themselves.\n                              (MORE)\n          \n                                                          26.\n          \n                              JIMMY (cont'd)\n                    They feel abandoned by our need for\n                    privacy and insecure because we no\n                    longer seek their approval. They\n                    used to take us to baseball games\n                    and cover our scrapes with\n                    bandages, but once we no longer\n                    need Mom to nurture our bruises or\n                    Dad to be our hero it puts their\n                    roles and subsequent sense of self\n                    worth into question.\n          \n                              JUDY (O.C.)\n                    How do you know all these things?\n          \n                              JIMMY\n                    When you don't have any friends,\n                    don't play sports, don't go out,\n                    have no one talk to, nowhere to go,\n                    no one to listen to you, or no one\n                    to help you figure things out, you\n                    sort of have to figure things out\n                    by yourself. And without any of\n                    those things I have nothing but\n                    time to think about stuff.\n          \n                              JUDY (O.C.)\n                    You are SO smart.\n          \n                              JIMMY\n                    You are so beautiful.\n          \n          Long pause.   Judy doesn't know how to react.\n          \n                              JUDY (O.C.)\n                    You think I'm pretty?\n          \n                              JIMMY\n                    I think you're the most beautiful\n                    person I have ever met. The most\n                    beautiful person in the universe.\n          \n                              JUDY (O.C.)\n                    No one has ever told me that.\n          \n                              JIMMY\n                    Get used to hearing it.\n          \n                              JUDY (O.C.)\n                    Do you think I'm smart?\n          \n                               JIMMY\n                    Yes.\n          \n                                                                  27.\n          \n          \n          \n                              JUDY (O.C.)\n                    Do you think I'm fat?\n          \n                                JIMMY\n                    Yes.\n          \n                              JUDY (O.C.)\n                    How could you say that? I only way\n                    a hundred and ten pounds.\n          \n                              JIMMY\n                    Oh, I'm sorry. I thought you said\n                    flat. As in flat chested.\n          \n                              JUDY (O.C.)\n                    I am not FLAT!\n          \n          Judy smacks him.\n          \n                                JIMMY\n                    Prove it.\n          \n                              JUDY (O.C.)\n                    I don't have to prove it.   Here\n                    look.\n          \n          O.C., Judy is sticking her chest out for Jimmy. He looks\n          away from the road to stare, her breasts filling out her top\n          nicely.\n          \n                              JIMMY\n                    I still can't tell.\n          \n                              JUDY (O.C.)\n                    I wear a full B cup.\n          \n                                JIMMY\n                    Show me.    Take em out.\n          \n                              JUDY (O.C.)\n                    I am not going to take them out!\n                    You take yours out.\n          \n                              JIMMY\n                    It's already out.\n          \n          Judy tilts the camera down.\n          \n          IN A FLASH we see a lifelike dildo sticking out of Jimmy's\n          fly, a smiley face sticker covers the head. The camera\n          quickly shakes and spins off the image as Judy screams bloody\n          fucking murder.\n          \n                                                                    28.\n          \n          \n          \n          Jimmy laughs. Judy forgets the camera is on. She drops it\n          into her lap, fabric from her clothes covers the frame.\n          \n          We can hear Jimmy and Judy laughing hysterically.\n          \n                              JUDY (O.C.)\n                    I can't believe you did that.\n          \n                              JIMMY (O.C.)\n                    That's why I did it. Now come on.\n                    I showed you mine, let me see\n                    yours.\n          \n          We hear the rustling of Judy's clothing. Camera falls to her\n          feet on the floor of the car. There's silence. Off camera,\n          Judy's nervously showing Jimmy her breasts.\n          \n                                JIMMY (O.C.)\n                    Wow.    Give me the camera.\n          \n                                JUDY (O.C.)\n                    No.\n          \n                              JIMMY (O.C.)\n                    Please, pretty, pretty please with\n                    sugar on top.\n          \n          Judy grabs the camera. It's pointing in Jimmy's direction,\n          but she still doesn't realize it's on.\n          \n                              JIMMY (O.C.)\n                    Here, I'll pull over.\n          \n          Jimmy pulls over to the side of the road then takes the\n          camera. Jimmy frames up Judy.\n          \n                              JIMMY (O.C.)\n                    Let me see 'em.\n          \n          Judy has a naughty and flirtatious smile.\n          \n          In the blink of an eye she suddenly lifts up her shirt and\n          exposes her bra, then pulls her shirt back down.\n          \n          Jimmy protests.\n          \n                              JIMMY (O.C.)\n                    That doesn't count. Come on, for\n                    real this time.\n          \n                              JUDY\n                    I'm embarrassed.\n          \n                                                                    29.\n          \n          \n          \n                                JIMMY (O.C.)\n                    Don't be.    You can trust me.\n          \n          Judy's not sure.   Jimmy looks into her eyes, pouring it on.\n          \n                               JIMMY (O.C.)\n                    You can. You can trust me with\n                    your life.\n          \n          Judy looks at him with a sense of admiration then hope.\n          \n                              JIMMY (O.C.)\n                        (gently)\n                    Please.\n          \n          Judy gets the same sexy, naughty smile and lifts up her shirt\n          exposing the bra, keeping it there.\n          \n                              JIMMY (O.C.)\n                    Will you take off your bra?\n          \n          Judy looks nervous but gives in. She unhooks her bra from\n          the front and exposes her naked breasts for as long as she\n          can. Jimmy focusses the camera's attention on them. It's\n          too much for her. She quickly pulls her shirt back down.\n          \n          Jimmy tilts up to a close up of Judy's face.\n          \n                              JUDY\n                        (struggling)\n                    I just realized something.\n          \n          Judy's eyes are starting to well up as she tries not to cry.\n          \n                              JIMMY (O.C.)\n                    What's the matter?\n          \n                              JUDY\n                    I just showed you my breasts and I\n                    saw your penis and we haven't even\n                    kissed.\n          \n          She starts tearing up.\n          \n                              JUDY\n                    You haven't even asked me to be\n                    your girlfriend and I did that.\n                    I'm a slut.\n                        (wiping her eyes)\n                    I don't want to be a slut.\n          \n          Jimmy sees she's crying.\n          \n                                                                   30.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Will you be my girlfriend?\n          \n                              JUDY\n                    Yes.\n          \n                              JIMMY (O.C.)\n                    Can I kiss you?\n          \n                              JUDY\n                        (sniffling)\n                    Yes. Will you turn off the camera?\n          \n                              JIMMY (O.C.)\n                    I want this moment to be captured\n                    forever. I'd rather not kiss you\n                    at all than waste the opportunity\n                    to document the most beautiful\n                    moment of my life.\n          \n          Judy leans towards Jimmy, then suddenly attacks him and\n          shoves the camera to the side. They are making out\n          exuberantly. The camera shakes and wobbles. We can hear\n          heavy breathing and the two of them smashing up against the\n          interior of the car.\n          \n          Jimmy finally has the camera in position. He has one of his\n          arms extended and now we can see the two of them kissing.\n          \n          Judy's devouring him in that raging teenage hormone sort of\n          way.\n          \n                              JUDY\n                        (whispers)\n                    I wanna see your smiley face again.\n          \n          We see and hear Judy whispering, her lips placed gently on\n          the inside of Jimmy's ear.\n          \n                              JUDY\n                        (whispering)\n                    Turn the camera off. Turn the\n                    camera off. Turn it off.\n          \n          Camera goes off.\n          \n                                                          CAMERA ON:\n          \n          I/E. HIGHWAY FIRST-KISS-SMILEY-FACE/JIMMY'S CAR - DAY\n          \n          Judy films Jimmy driving the car.   He has a huge shit eating\n          grin on his face.\n          \n                                                                   31.\n          \n          \n          \n                              JUDY (O.C.)\n                    How do you feel?\n          \n                              JIMMY\n                    Relaxed, happy, confident, studly,\n                    excited, relieved, delighted... I\n                    love you Judy.\n          \n                               JUDY (O.C.)\n                    You do?\n          \n                              JIMMY\n                    Very much so. I always have.\n          \n                               JUDY (O.C.)\n                    Me too.\n          \n          Long pause filled with sexual tension takes over.\n          \n                              JUDY (O.C.)\n                    Do you want to pull over again?\n          \n          Jimmy smiles.   Of course he does.   Camera goes off.\n          \n                                                           CAMERA ON:\n          \n          EXT. BEAUTIFUL FARM - SHOTGUN SCENE - DAY\n          \n          Judy films Jimmy as he FIRES a twelve gage pump action shot\n          gun off into the distance. After each shot he pumps then\n          FIRES again.\n          \n                              JIMMY\n                    Are you getting this?\n          \n          No response.\n          \n          Jimmy FIRES another shot. His muscles are flexing as he\n          pumps the gage. He looks extremely violent and determined.\n          \n                               JIMMY\n                    Come on.   Are you getting this?\n          \n          A very turned off Judy replies.\n          \n                              JUDY (O.C.)\n                    This is where you wanted to take\n                    me?\n          \n                              JIMMY\n                    Yeah, what's the matter?\n          \n          We can hear Judy crying.   The camera shakes out of control.\n          \n                                                                     32.\n          \n          \n          \n                              JUDY (O.C.)\n                    I wanna go home.\n          \n          Jimmy looks over towards the camera/Judy. He knows that he's\n          fucked up and he feels like complete shit.\n          \n          Jimmy walks over to her, takes the camera and shuts it off.\n          \n                                                             CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BATHROOM - NIGHT\n          \n          Jimmy is standing in front of a mirror and is videotaping his\n          own reflection.\n          \n          He is talking to himself and into the camera.\n          \n                              JIMMY\n                    Don't fuck this up.    Please don't\n                    fuck this up.\n          \n          Now he is pleading with himself.\n          \n                              JIMMY\n                    Just try to be normal.\n                        (screaming)\n                    Just be normal! God damn it why do\n                    you have to fuck everything up?\n          \n          He hasn't convinced himself.\n          \n                                 JIMMY\n                    Be normal.     Be normal.   Be normal!\n          \n          Jimmy takes a breath, then shuts the camera down.\n          \n                                                             CAMERA ON:\n          \n          INT. JIMMY'S HOUSE - JIMMY'S BEDROOM - NIGHT\n          \n          Jimmy films Judy who lies next to him in the bed. Her face\n          is sweaty and red and he is still a tad out of breath. Jimmy\n          is capturing her literally seconds after they had sex.\n          \n          She's somewhat bewildered, then she notices the camera.\n          She's starting to get used to it.\n          \n                                JUDY\n                          (big smile)\n                    Hi.\n          \n                                                                   33.\n          \n          \n          \n                              JIMMY (O.C.)\n                    So how do you feel now, right at\n                    this moment?\n          \n          Judy just sighs, basking in the afterglow.\n          \n                              JUDY\n                    I don't know.\n                        (trying)\n                    That was soooo good.\n          \n                              JIMMY (O.C.)\n                    You were good. What got into you?\n          \n                              JUDY\n                    I don't know. I've just really\n                    been wanting you lately. Really\n                    bad.\n          \n                              JIMMY (O.C.)\n                    Why's that?\n          \n          Judy chuckles.\n          \n                              JUDY\n                    I'm embarrassed.    I can't say.\n          \n                              JIMMY (O.C.)\n                    Now you have to tell me.\n          \n                              JUDY\n                    It was after yesterday.\n          \n          Jimmy is more than surprised.\n          \n                                 JIMMY (O.C.)\n                    Yesterday?\n          \n          Judy speaks as if she is going to reveal a big secret.   Very\n          quiet and cute in her mannerisms.\n          \n                              JUDY\n                    Yeah, it was after I saw you shoot\n                    that gun.\n          \n                               JIMMY (O.C.)\n                    You were crying. I wanted to kill\n                    myself after I did that. You were\n                    scared and you were shaking. It\n                    was the most awful thing I ever\n                    did. I didn't think I'd ever see\n                    you again.\n          \n                                                                      34.\n          \n          \n          \n          Judy thinks.\n          \n                              JUDY\n                    I was scared at first. Really\n                    scared. I didn't expect it to be\n                    so loud and you looked so mean.\n                    But then I got home and started\n                    thinking about it. About how your\n                    muscles looked and how dangerous it\n                    all seemed. It made me like... all\n                    excited, and like...\n          \n          Judy looks for the right word.\n          \n                                JIMMY (O.C.)\n                    Horny?\n          \n          Judy laughs with embarrassment.      Camera shakes as Jimmy hands\n          it to her.\n          \n                                JIMMY (O.C.)\n                    Here.    Hold this.\n          \n          Judy turns the camera back on Jimmy as he leaps out of bed.\n          \n                              JUDY (O.C.)\n                    Where you going?\n          \n                                JIMMY\n                    One sec!\n          \n          Jimmy's bare ass flashes us as he heads out the bedroom door.\n          \n          Judy holds the camera as we hear Jimmy in the hallway. He\n          opens a closet door, fumbles through it, then busts back into\n          the bedroom, holding the shotgun he used out on the lake.\n          \n          Jimmy zooms in on Jimmy's naked upper body as he stands in\n          front of her and begins pumping the gun and pulling the\n          trigger. Obviously the gun is not loaded.\n          \n                              JUDY (O.C.)\n                    That is so hot!\n          \n                              JIMMY\n                    My dad keeps it in his closet.\n                    Here.\n          \n          Jimmy gives Judy the gun.     Now she's holding the gun and the\n          camera.\n          \n                              JUDY (O.C.)\n                    It's heavy.\n          \n                                                                    35.\n          \n          \n          \n          Judy points the gun at Jimmy.   She lowers it, aiming right at\n          his crotch just below frame.\n          \n                              JIMMY\n                    Now I see the appeal.     Give me the\n                    camera.\n          \n          Judy hands Jimmy the camera.    Camera moves and shakes as she\n          hands it over.\n          \n          Jimmy frames her up nicely. Now we see Judy topless,\n          pointing the gun directly at the lens of the camera.\n          \n                              JUDY\n                    What do you think of this?\n          \n          She brings the gun down, then takes the barrel of the gun and\n          places it between her breasts, squishing them together,\n          covering her nipples as she rubs the barrel between her\n          breasts.\n          \n                              JUDY\n                    Do you like that?\n          \n                               JIMMY (O.C.)\n                    Yes.\n          \n          Judy takes the barrel of the gun from her breasts and near\n          her mouth. She starts rolling her tongue over the top of the\n          barrel slowly and seductively, then stops. It looks as if\n          she's about to perform full mock oral sex on the barrel of\n          the gun.\n          \n                              JIMMY (O.C.)\n                    That is SO hot.\n          \n          As she is about to start to move her mouth and lips over the\n          gun, then suddenly we hear a garage door open.\n          \n          Jimmy throws the camera sideways down on the bed.\n          \n                               JIMMY (O.C.)\n                    Fuck!   It's my parents!\n          \n          We are now seeing sideways rotated images of Jimmy and Judy\n          panicking, throwing on their clothes as fast as humanly\n          possible.\n          \n          Jimmy grabs the camera off the bed and turns it off.\n          \n                                                            CAMERA ON:\n          \n                                                                    36.\n          \n          \n          \n          INT. JIMMY'S HOUSE - PARENTS' BEDROOM - DAY\n          \n          Jimmy is hiding in the closet of his parents' bedroom. He\n          has the door of the closet cracked and puts the lens of the\n          camera through the crack.\n          \n          Jimmy's Dad enters the room. He has no idea that he is being\n          filmed and that Jimmy is in the closet.\n          \n          Jimmy's Dad walks over to the dresser, opens up the top\n          drawer and pulls something out. It's too dark in the room to\n          tell exactly what he's pulled out, but it appears to resemble\n          some sort of undergarment.\n          \n          Jimmy's Dad begins undressing, then steps out of frame.\n          \n          After a beat, he reappears. Now he's wearing nothing but a\n          sequined teddy. He's totally fat, hairy, and nasty looking.\n          He sits on the side of the bed, his back to us. Now we see\n          that what he grabbed out of the drawer was actually a pair of\n          fishnet stockings. He begins putting them on.\n          \n          When he is finished putting on his panty hose, he gets up off\n          the bed and begins admiring his legs in a mirror. He begins\n          to gently stroke the sides of his legs, relishing the feel of\n          the hose over his hands and fingertips.\n          \n          He seems to be lip syncing the words to a song and begins to\n          get all worked up. He shakes his hips and dances around the\n          room for a few seconds.\n          \n          Now Jimmy's Dad goes to the dresser and pulls out a long\n          brunette wig from the back of his top drawer. Putting it on,\n          with the fishnet stockings, sequined teddy and long wig, he\n          has transformed himself into the world's fattest, ugliest,\n          hairiest, Cher look-a-like.\n          \n          Someone else enters the room.\n          \n                                 JIMMY'S DAD\n                    Hi sweety.\n          \n          Holy shit. It's Jimmy's Mom, and she's wearing a leather\n          dominatrix outfit!\n          \n                              JIMMY'S MOM\n                    Are you ready for me, you fucking\n                    slut?\n          \n                                 JIMMY'S DAD\n                    Not quite.\n          \n                                                                  37.\n          \n          \n          \n                              JIMMY'S MOM\n                    I don't feel like waiting. Hurry\n                    up bitch. What do you have left to\n                    do?\n          \n                              JIMMY'S DAD\n                    I just need to put on my makeup.\n          \n          As Jimmy's Mom exits frame, we see Jimmy's Dad go to the\n          mirror. He opens up the top drawer again and pulls out a\n          little makeup bag.\n          \n          Jimmy's Mom re-enters, now wearing a mini leather biker's\n          hat, carrying a riding switch.\n          \n                              JIMMY'S MOM\n                    Come on slut.\n          \n          Jimmy's Dad finishes applying his lipstick and moves over to\n          the bed. By the way Jimmy's parents are behaving, it's as if\n          they've gone through this routine a thousand times.\n          \n          Jimmy's Mom drifts off screen as Jimmy's Dad gets up on all\n          fours. Suddenly, we hear a SMACK as Jimmy's Mom hits Jimmy's\n          Dad on his ass with the switch.\n          \n          He lets out deep pleasured groans as she continues SMACKING\n          him with the whip harder and harder. He yelps, squeals, and\n          gyrates his hips back and forth, then starts dry humping the\n          air until she stops.\n          \n          Jimmy's Mom comes back through and out of frame. Jimmy's Dad\n          pushes his belly into the bed, groaning from the pain while\n          he waits for her return.\n          \n          She comes back, moving quickly across the screen wearing an\n          enormous strap on dildo.\n          \n          Disappearing out of frame again, Jimmy's Dad gets himself\n          ready for her one more time, ass up, on all fours on the bed.\n          \n          From behind, we can see her hand as she hikes her husband's\n          dress up his back, then we see his face and hear him grunt as\n          she rips his fishnets off screen.\n          \n          There's a pause. Nothing seems to be happening, but Jimmy's\n          Dad is bracing himself for something. His face tightens up.\n          Off screen, Jimmy's Mom has started mounting him from behind.\n          \n          Jimmy can't take it any longer. As he slowly emerges from\n          the closet, his Mom notices Jimmy almost immediately. She\n          jumps off her husband, screaming bloody murder.\n          \n                                                                  38.\n          \n          \n          \n          Camera's shaky but it's easy to guess what's been happening.\n          Mom's just started doing Dad from behind with the strap on.\n          \n                                 JIMMY\n                    Hi mom.     Hi dad.   What are you guys\n                    up to?\n          \n          Jimmy's Dad leaps from the bed and begins shouting. He looks\n          completely absurd screaming at Jimmy wearing his sequined\n          dress and wig.\n          \n                              JIMMY'S DAD\n                    What the fuck are you doing here?\n          \n          Jimmy's Mom goes hysterical and begins screaming at Jimmy's\n          Dad.\n          \n                              JIMMY'S MOM\n                        (to his dad)\n                    I told you he would find out you\n                    fucking freak! No wonder he's a\n                    fucking psycho. Look a his father.\n          \n          Jimmy's Dad is beside himself with fury and throws off his\n          wig.\n          \n                              JIMMY'S DAD\n                    Turn off the that fucking camera!\n                    Turn off that fucking camera right\n                    fucking now god damn it!\n          \n          Jimmy is loving it.\n          \n                              JIMMY\n                    Gee dad, what do you say the two of\n                    us go out to the front yard and\n                    throw some ball together? We'll\n                    have a nice friendly game of catch.\n          \n          Jimmy's Dad attacks Jimmy. He swings at the lens. He's one\n          angry drag queen daddy. He begins strangling Jimmy.\n          \n                              JIMMY'S DAD\n                    You little mother fucker.     Turn off\n                    that fucking camera!\n          \n          Jimmy's Mom rips off her strap on dildo and begins beating\n          Jimmy's Dad with it.\n          \n          Judging from the punishment she's inflicting upon her drag\n          queen husband, the dildo apparently is made from the finest\n          and heaviest of materials.\n          \n                                                                     39.\n          \n          \n          \n                                 JIMMY'S MOM\n                    Stop it!     You're going to kill him.\n          \n          Jimmy's Dad lets go.    The dildo's doing the trick.\n          \n                                 JIMMY'S DAD\n                    Bitch!\n          \n          Jimmy's Mom keeps swinging the dildo at Jimmy's Dad even\n          though he's let go.\n          \n                              JIMMY'S MOM\n                    Fuck you! You think you know me?\n                    You don't know me! You piece of\n                    shit!\n          \n                                 JIMMY\n                           (laughing)\n                    Mom!\n          \n          Jimmy's Mom now directs her attention on Jimmy. She screams\n          at him as she swings her gigantic strap on towards the\n          camera.\n          \n                              JIMMY'S MOM\n                    You little beast! You want to film\n                    something? Film this!\n          \n          She continues to swing the strap on as she walks closer and\n          closer to the lens.\n          \n          The camera goes crazy. Loud sounds are heard throughout the\n          room. Evidently Jimmy has been tackled. We hear wrestling\n          and grunting. It seems that Jimmy's Dad has tackled Jimmy,\n          or maybe his Mom, or both, but the camera is too shaky to\n          tell just what has happened.\n          \n          Jimmy's Dad is still fighting. He seems to have them all\n          pinned against the floor. He's crushing his mother.\n          \n                              JIMMY'S DAD (O.C.)\n                    Nancy, Nancy, Nancy, Nancy! Please\n                    someone call me Nancy. My name is\n                    Nancy.\n          \n                              JIMMY'S MOM (O.C.)\n                        (crying hysterically)\n                    Nancy, Nancy, Nancy... Jimmy\n                    please call him \"Nancy\" for the\n                    love of God. Call your daddy\n                    Nancy. Call him Nancy...!\n          \n                                                                     40.\n          \n          \n          \n          We hear Jimmy's Mom screaming/repeating herself. We see a\n          hand go over the lens. Jimmy and his mother and father are\n          all in a wrestling match on the floor.\n          \n          Jimmy with great enthusiasm begins to sing as the camera\n          shakes.\n          \n                              JIMMY (O.C.)\n                    Take me out to the ball game, take\n                    me out to the crowd, buy me some\n                    peanuts and crackerjacks...\n          \n          The wrestling match continues as we see more hands come\n          towards the lens. Jimmy's Mom suddenly stops screaming, as\n          if she's been knocked out.\n          \n                              JIMMY'S DAD (O.C.)\n                    Give me that fucking tape!\n          \n                              JIMMY (O.C.)\n                    I don't think so Nancy.   Nancy,\n                    Nancy, Nancy...\n          \n          After some very intense fighting, someone is finally able to\n          shut the camera off.\n          \n                                                         CAMERA ON:\n          \n          EXT. FOREST/MEADOW - RUNNING NAKED - DAY\n          \n          Jimmy has the camera and is chasing a naked (just from\n          behind) Judy through the woods. The camera shakes and\n          rattles, but we can definitely tell this is all in good fun.\n          \n          Judy screams as she is being chased through the woods.   She\n          couldn't feel more free.\n          \n          She begins to tire and slows down. She can no longer run and\n          turns towards the camera. As she turns around, camera shows\n          her from the waist up. She has a beer can in her hand and\n          she is a little drunk.\n          \n          For the first time, she's completely at ease with her own\n          body and looks perfectly natural being naked in the\n          wilderness. She walks towards the camera smoothly and\n          seductively. Her long hair blond hair blows gently in the\n          wind.\n          \n                              JUDY\n                    I'm so glad you're out. Next time\n                    your dad wants to take it in the\n                    ass, DON'T FILM HIM!\n          \n                                                                     41.\n          \n          \n          \n                              JIMMY (O.C.)\n                    I know. Ironic that I was the one\n                    sent to the nut house.\n          \n                              JUDY\n                    I thought I was going to die\n                    without you. What if you and I\n                    could live here together? Forever.\n          \n                              JIMMY (O.C.)\n                    Right here?\n          \n                              JUDY\n                    I'm serious. Maybe not here, but\n                    eventually we'll buy some land, and\n                    we can live together on it, and be\n                    naked whenever we want.\n          \n          She takes a big swig of her beer.    Then burps.\n          \n                                 JUDY\n                    Excuse me.     What do you think?\n          \n                              JIMMY (O.C.)\n                    I think you're drunk.\n          \n          Judy walks towards the camera.    She puts her mouth inches\n          away from the lens.\n          \n                              JUDY\n                    I think you're right mister.\n          \n          Judy giggles, then dances around playfully in the woods.      She\n          has never felt so alive.\n          \n                              JUDY\n                    I don't want this to ever end. I\n                    want to be here forever. I want to\n                    dance and be naked and be free, and\n                    I want us to ball our brains out\n                    everyday, and I want to feel the\n                    air on my body and I want to get\n                    drunk and not care about anything\n                    in the world. I just want us to be\n                    together in this moment.\n          \n                              JIMMY (O.C.)\n                    I know a place like that.\n          \n                                 JUDY\n                    You do?\n          \n                                                                     42.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Yep. We can go there one day if\n                    you want.\n          \n                                JUDY\n                    We can?    Where is it?\n          \n                                JIMMY (O.C.)\n                    Erlanger.\n          \n                              JUDY\n                        (doesn't buy it)\n                    Erlanger!\n          \n                              JIMMY (O.C.)\n                    Yeah Erlanger. Everybody was\n                    talking about it in the nut house.\n                    That's ALL anybody fucking talked\n                    about was this dude who lives up\n                    there named Uncle Rodney. He\n                    supposedly has a commune where we\n                    can do this kind of thing every\n                    day.\n          \n                              JUDY\n                    Uncle Rodney's commune?\n          \n          Judy smiles, almost laughing. It all sounds pretty\n          ridiculous to her, but plays along anyway.\n          \n                              JUDY\n                    That's funny.\n          \n                              JIMMY (O.C.)\n                        (playfully)\n                    No, I'm serious.\n          \n          Judy walks back towards the camera and grabs it away from\n          Jimmy, surprising him.\n          \n                                JIMMY\n                    Hey!\n          \n                              JUDY (O.C.)\n                    Okay, now it's your turn.\n          \n          Shot from the waist up, we now see that Jimmy's naked as\n          well. He's at a loss as to what he should say.\n          \n                              JUDY (O.C.)\n                    How does it feel to be a free man?\n          \n          Jimmy thinks.    A drunk Judy is losing her patience.\n          \n                                                                   43.\n          \n          \n          \n                              JUDY (O.C.)\n                    Come on, come on, come on...\n          \n                              JIMMY\n                    I'm thinking.\n          \n                              JUDY (O.C.)\n                    Just let it go, be free.\n          \n                              JIMMY\n                        (adoringly)\n                    You're such a hippie all of sudden.\n          \n                                JUDY (O.C.)\n                    Come on.\n          \n                                JIMMY\n                    No.\n          \n          Judy's not getting what she wants from him.   Camera shuts\n          down.\n          \n                                                          CAMERA ON:\n          \n          EXT. FOREST/MEADOW - RUNNING NAKED - DAY\n          \n          Judy films Jimmy. The camera is close and intimate as they\n          lie on their sides staring into each other's eyes. Judy is\n          still naked, but is being shot in an extreme close up.\n          \n                                JUDY (O.C.)\n                    Okay, go.\n          \n          Jimmy's still not up for it.   Judy grabs the camera and turns\n          it on him.\n          \n                                JUDY (O.C.)\n                    Come on!\n          \n          Jimmy's turns the tables.\n          \n                               JIMMY\n                    Okay, you really wanna hear\n                    something?\n          \n                                JUDY (O.C.)\n                    Yeah.\n          \n          Jimmy takes a deep breath, a touch of intensity flashes in\n          his eye, then...\n          \n                                                          44.\n          \n          \n          \n                              JIMMY\n                    I want to go one day without\n                    masturbating. I want to liberate\n                    my penis. I want to clone you so\n                    we could have a three way and\n                    neither of us would be cheating. I\n                    want you to scrape my balls with a\n                    cheese grater...\n          \n          Judy starts laughing.   The camera's shaking.\n          \n                              JUDY (O.C.)\n                    That's gross!\n          \n          Jimmy suddenly gets serious.\n          \n                              JIMMY\n                    And I love you. I love you so much\n                    it hurts.\n          \n                                JUDY (O.C.)\n                    It hurts?\n          \n                              JIMMY\n                    Like God is stabbing me in heart\n                    with a thousand knives at the same\n                    time and you're the only one who\n                    can make the pain go away. Do you\n                    love me that much?\n          \n                              JUDY (O.C.)\n                    I love you so much, I'd rather die\n                    than be without you.\n          \n                                JIMMY\n                    Here.\n          \n          Jimmy grabs the camera and points it at Judy.\n          \n                              JIMMY (O.C.)\n                    Make me a promise... the way a\n                    husband and wife make a promise...\n                    that we will be together always and\n                    forever.\n          \n                              JUDY\n                    You mean get married?\n          \n                              JIMMY (O.C.)\n                    Something more powerful than\n                    marriage. It's a bond. It's our\n                    bond. It's transcendental.\n          \n                                                                  45.\n          \n          \n          \n                              JUDY\n                    What?\n          \n                              JIMMY (O.C.)\n                    Transcendental.\n                        (grabs the camera)\n                    Here.\n          \n          Jimmy hands Judy the camera as she starts to frame him up,\n          but they're really engaging each other's eyes over the top of\n          the eyepiece.\n          \n                              JIMMY\n                    It's transcendental because it\n                    transcends everything. Life, love,\n                    law, people, things... A bond so\n                    strong that our souls will become\n                    one and it can never end, even in\n                    death. If you swear on the bond,\n                    it means you'd rather die than\n                    break your promise.\n          \n          Judy is moved.\n          \n                              JUDY (O.C.)\n                    That's so beautiful.\n          \n                              JIMMY\n                    You're so beautiful.    I want to\n                    love you forever.\n          \n                              JUDY (O.C.)\n                    Swear on the bond. Swear we'll be\n                    together forever, that you'd rather\n                    die than be apart.\n          \n                              JIMMY\n                    I swear on the bond.\n          \n                              JUDY (O.C.)\n                    And we'll never let anything come\n                    between us, not even death.\n          \n                              JIMMY\n                    Not even death. I swear. Nothing\n                    will come between us, ever.\n          \n          Jimmy stares at her, then slowly leans in for a kiss... a\n          long, wet, toe curling kiss. Jimmy finds a way to point the\n          camera at the kiss.\n          \n                                                                  46.\n          \n          \n          \n          They break apart. Judy sighs, staring into Jimmy's eyes,\n          then leans into him, his lips touching her forehead, their\n          eyes closing as they feel the energy of true love.\n          \n                              JUDY\n                    We'll be together forever.\n          \n                              JIMMY\n                        (whispers)\n                    Together forever.\n          \n          Camera shuts down.\n          \n                                                          CAMERA ON:\n          \n          I/E. GROCERY STORE PARKING LOT/JIMMY'S CAR - DAY\n          \n          Jimmy and Judy sit in a parked car outside of a huge grocery\n          store.\n          \n          Jimmy and Judy sit outside a small grocery store. Jimmy\n          films himself. Judy's in the passenger seat. He does his\n          best news announcer impersonation.\n          \n                              JIMMY\n                    This is action ten news reporter\n                    Jimmy Van Muffmuncher reporting to\n                    you live from the parking lot of\n                    Dick's grocery store where we're\n                    going to witness the beautiful, the\n                    talented, the amazing Judy, commit\n                    her first crime.\n          \n          Jimmy flips the camera around onto Judy.\n          \n                              JIMMY (O.C.)\n                    Is there anything you would like to\n                    say to the public and your adoring\n                    fans before you go through with\n                    this?\n          \n          Judy gleefully plays along.\n          \n                              JUDY\n                    Well Mr. Van Muffmuncher. I just\n                    want to say that I look forward to\n                    losing, my, um...\n          \n          Judy pauses to think.\n          \n                              JUDY\n                    What did you call it before?\n          \n                                                                    47.\n          \n          \n          \n                               JIMMY (O.C.)\n                    Your conformist crimeless\n                    virginity.\n          \n          Judy snaps back into her role as interviewee.\n          \n                              JUDY\n                    Yes, I am very much looking forward\n                    to losing my conformist crimeless\n                    virginity. I would also like to\n                    share with my fans these.\n          \n          Judy lifts up her shirt and exposes her bra to the camera.\n          \n                              JIMMY (V.O.)\n                        (in his reporter voice)\n                    Thank you and thank your tits for\n                    this rare, behind the scenes look\n                    at your first crime slash moment of\n                    truth.\n          \n          Judy leans in pops a quick kiss at the lens of the camera.\n          Jimmy shuts it down.\n          \n                                                          CAMERA ON:\n          \n          INT. GROCERY STORE - DAY\n          \n          Jimmy is in a grocery store aisle filming Judy from way far\n          away. We can barely make out that it is her until Jimmy\n          zooms in tighter. She couldn't look more nervous or obvious.\n          \n          She is in the beer section. She quickly takes a six pack of\n          canned beer and struggles to put it in her school bag. She\n          walks quickly towards the exit. Jimmy follows her and\n          catches up.\n          \n          Jimmy is standing next to her and he continues to film.   Judy\n          looks so nervous.\n          \n                              JUDY\n                    Jimmy, turn it off.    We're gonna\n                    get busted.\n          \n                              JIMMY (O.C.)\n                    No way, this is the best part.\n          \n          A man is yelling at them off camera.\n          \n                              MAN (O.C.)\n                    Hey you two. Stop.\n          \n                                                                    48.\n          \n          \n          \n          Jimmy pans over and a store manager is standing in front of\n          them.\n          \n                              STORE MANAGER\n                    What the hell do you think you're\n                    doing?\n          \n          Jimmy and Judy have no reply.   The store manager gives them\n          his best intimidating stare.\n          \n          There is an extremely long pause.\n          \n                              STORE MANAGER\n                    Turn that damn thing off. You\n                    can't be running around the store\n                    playing with a camera. It's\n                    against the store policy. Now get\n                    out of here.\n          \n          Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          EXT. GROCERY STORE - PARKING LOT - DAY\n          \n          Judy is looking at the lens of the camera.    She's shaking and\n          screaming.\n          \n                              JUDY\n                    What is the matter with you Jimmy?\n                    You almost got us caught. You're\n                    so worried about that camera. What\n                    is it? What is it!\n          \n          Jimmy calmly and quietly explains.\n          \n                              JIMMY (O.C.)\n                    Twenty years from now, when we're\n                    together watching these tapes\n                    you'll realize how special this\n                    moment is. I owe it to you. And I\n                    owe it to us to capture everything\n                    and anything we do together.\n          \n          Judy is calmed but still is pissed.\n          \n                               JUDY\n                    Well you freak me out sometimes.\n                    Why do you have to tape everything?\n                    It's like you have a problem or\n                    something.\n          \n          Judy's case isn't sticking.   She treads lightly.\n          \n                                                                   49.\n          \n          \n          \n                              JUDY\n                    You know, most of the reason kids\n                    think you're so weird is because of\n                    it. Why do you think everybody\n                    makes fun of you? And then I have\n                    to hear it and I have to deal with\n                    it.\n          \n                              JIMMY (O.C.)\n                    So everybody makes fun of me, huh?\n          \n                              JUDY\n                    Yeah. Can't you give the thing a\n                    fucking rest?\n          \n          Jimmy's fuming.\n          \n                              JIMMY (O.C.)\n                    And you don't want to deal with it?\n                    Well fuck them and fuck you too if\n                    you think that. I couldn't give a\n                    fuck what people say. This is my\n                    life and I want to document it.\n                    And right now me filming you\n                    happens to be the only reason I\n                    manage to get out of my fucking bed\n                    every morning! You can't take this\n                    away from me!\n          \n          Jimmy starts crying.\n          \n          Judy takes the camera. She tapes Jimmy who is sobbing. Now\n          she is the one who speaks gently. She's trying to give him a\n          taste of his own medicine.\n          \n                              JUDY (O.C.)\n                    How does it feel Jimmy? How does\n                    it feel to have someone taping you\n                    while you're crying?\n          \n          Jimmy doesn't answer.   He tries to compose himself enough to\n          speak.\n          \n          Judy pushes harder.\n          \n                              JUDY (O.C.)\n                    Tell me. Look at the camera and\n                    tell me how it feels!\n          \n                              JIMMY\n                    You're not getting it. It doesn't\n                    matter how it feels right now.\n                              (MORE)\n          \n                                                                       50.\n          \n                              JIMMY (cont'd)\n                    What matters is that you're seeing\n                    what's inside of me and your taping\n                    it. Can you understand that?\n          \n          Judy doesn't know how to respond.\n          \n                                JIMMY\n                    Can you?\n          \n                              JUDY (O.C.)\n                    I don't know.\n          \n                              JIMMY\n                    Well can you at least try?\n          \n          Jimmy is still crying.   This weighs on her.\n          \n                                JUDY (O.C.)\n                    Yes.    I can most definitely try.\n          \n                              JIMMY\n                    And you can never, ever, ever ask\n                    me to not film you or anything we\n                    do. That's the only thing I'll\n                    ever ask of you. Agreed?\n          \n                               JUDY (O.C.)\n                    Okay.   I'm sorry.\n          \n                              JIMMY\n                    Will you swear to it?     On camera,\n                    will you swear to it?\n          \n          Jimmy has talked himself into a good mood.       Before we hear\n          Judy's response, we...\n          \n                                                            JUMP CUT TO:\n          \n          I/E. GROCERY STORE PARKING LOT/JIMMY'S CAR - DAY\n          \n          Moments later, Jimmy is now taping Judy. She has her right\n          hand up, like a witness about to be sworn into the stand.\n          She's all smiles as Jimmy gives her the oath to repeat back\n          to him.\n          \n                              JAMES (O.C.)\n                    Please raise your right hand.\n          \n          Judy raises her right hand.\n          \n                              JIMMY (O.C.)\n                    Please repeat after me.    I Judy...\n          \n                                                                    51.\n          \n          \n          \n                                JUDY\n                    I Judy...\n          \n                              JIMMY (O.C.)\n                    Do hereby solemnly swear...\n          \n                              JUDY\n                    Do hereby solemnly swear...\n          \n                              JIMMY (O.C.)\n                    That I will never ask, request, or\n                    even insinuate to Jimmy to cease\n                    filming, no matter the situation.\n          \n                              JUDY\n                    That I will never ask, request, or\n                    even insinuate to Jimmy to cease\n                    filming, no matter the situation.\n          \n                              JIMMY (O.C.)\n                    And furthermore, I do hereby\n                    solemnly swear to commit myself to\n                    giving Jimmy his daily blowjob and\n                    will continue to perform various\n                    sex acts with the skill and\n                    enthusiasm that he has become\n                    accustomed to.\n          \n          Judy laughs, then screams with embarrassed excitement.    Her\n          laughter and happiness is infectious.\n          \n          She pounds her fists on the dashboard and laughs again.\n          \n          We can hear Jimmy laughing off camera as well.\n          \n                              JIMMY (O.C.)\n                    Keep your right hand up.\n          \n          Judy lifts her right hand back up.   She looks at the camera\n          with a huge smile.\n          \n                              JUDY\n                    I do hereby solemnly swear to g...\n          \n          THWACK! Someone has thrown a full soda can on the hood of\n          Jimmy's car. He pans and zooms the camera over and sees a\n          car full of Three Teenagers laughing at them.\n          \n                              JIMMY (O.C.)\n                    Mother fuckers.\n          \n          Suddenly the TEENAGE DRIVER of the car appears, as if out of\n          nowhere, running to the passenger side. Jimmy zooms out.\n          \n                                                                   52.\n          \n          \n          The frame catches up to him just as he spits a huge LOOGIE\n          into the car, hitting Judy right in the face.\n          \n          Judy screams. The car full of Three Teenagers laugh\n          hysterically at her expense.\n          \n          Jimmy hands Judy the camera.\n          \n                              JIMMY\n                    Here, you're definitely going to\n                    want to tape this.\n          \n          Jimmy calmly gets out of his car as Judy tapes him through\n          the window. We can hear her breathing heavily as she tries\n          not to cry softly off camera.\n          \n          Jimmy has gone to the rear of the car. We hear the trunk\n          open while Judy films through the windshield at the car full\n          of laughing teens. Jimmy enters the frame carrying a\n          baseball bat.\n          \n          We see him talking calmly to the driver of the car, the Kid\n          who spat in Judy's face. Then...\n          \n          WHAM!\n          \n          Jimmy reels back and clocks the kid right in the face with\n          the bat. The Kid falls over into the front seat of the car.\n          \n          Jimmy calmly walks over to the front of the car and begins\n          bashing in the windshield.\n          \n                               JUDY (O.C.)\n                        (to herself)\n                    Oh my God.\n          \n          Now rage has taken over Jimmy over entirely.   He's bashing in\n          the windshield with all of his might.\n          \n          The teenagers all go running from the car.   A crowd starts to\n          form in the parking lot.\n          \n                              JUDY (O.C.)\n                        (to herself)\n                    Oh, God Jimmy...\n          \n          Jimmy has now completely bashed in the windshield and moves\n          to the front of the car. He now begins smashing the other\n          windows.\n          \n          Now a sizeable crowd is formed. Jimmy is seemingly oblivious\n          to them and continues bashing the car.\n          \n                                                                  53.\n          \n          \n          \n                              JUDY (O.C.)\n                        (to herself)\n                    I love you Jimmy.\n          \n          Now it's to the point of overkill. But Jimmy won't stop.\n          It's as if the rage he's been carrying inside of him his\n          entire life is now coming to the surface.\n          \n          We hear sirens in the distance as Jimmy continues to bash the\n          car. The car is in near shambles as we hear police sirens in\n          the distance.\n          \n          Judy begins screaming.\n          \n                              JUDY (O.C.)\n                    Jimmy stop, please stop. Jimmy...\n                    oh god, Jimmy stop. God damn it,\n                    fucking stop!\n          \n          Jimmy doesn't. He pounds the car harder as a police cruiser\n          pulls up. Two policemen get out of the car. They are\n          temporarily paralyzed with indecision.\n          \n          We see one of the officers trying to speak with Jimmy. He\n          just ignores them. The policemen are oblivious to the fact\n          they are being filmed.\n          \n          One of the officers gets out a can of mace and sprays it in\n          Jimmy's face.\n          \n          Now Jimmy is completely freaking out. We hear him scream,\n          but he continues to bash the car with his eyes closed. One\n          of the cops draws his gun as Jimmy swings aimlessly towards\n          them. He gets sprayed again with the mace and is now\n          completely blinded. A huge crowd has now amassed outside of\n          the grocery store.\n          \n                              JUDY (O.C.)\n                    Oh, God Jimmy, oh God...\n          \n          Now the entire parking lot is filled with cop cars. Lights\n          are flashing all around Jimmy. He is surrounded but sill\n          continues to swing the bat.\n          \n                               JUDY (O.C.)\n                    Jimmy...\n          \n          Three cops tackle Jimmy from behind. Judy throws down the\n          camera and runs out the door. The camera is face down on the\n          seat.\n          \n                                                                   54.\n          \n          \n          \n          We hear Judy get out of the car, leaving the door open so we\n          can hear the entire scene with much more intensity. The\n          sounds of police sirens and radios is overwhelming.\n          \n          We hear a woman screaming and more sirens and cars are\n          pulling up. More screaming and sounds on the radio is heard.\n          We hear police chatter:\n          \n                              POLICE CHATTER (O.C.)\n                        (over the police radios)\n                    We're going to need an ambulance\n                    stat at the parking lot of the\n                    grocery store on Route 18...\n          \n          More screaming and chatter is heard until someone enters the\n          car. We don't know who it is. They turn off the camera.\n          \n                                                          CAMERA ON:\n          \n          I/E. SANITARIUM PARKING LOT/JUDY'S CAR - DAY\n          \n          Judy is filming. She sits behind the wheel pointing the\n          camera at the front door of a HIDDEN VALLEY Mental Hospital.\n          She zooms in on a sign.\n          \n          Judy flips the camera around to herself.\n          \n                               JUDY\n                    Hi baby. I miss you.\n                         (blowing a kiss)\n                    Mwaa! I'll be waiting for you when\n                    you get out. Be good and don't\n                    wait too long. Look what I did for\n                    you!\n          \n          Judy opens her mouth wide.   She's got a tongue stud on her\n          tongue.\n          \n                              JUDY\n                    I can't wait to use it on you!\n          \n          Camera shuts down.\n          \n                                                          CAMERA ON:\n          \n          I/E. FAST FOOD RESTAURANT DRIVE THRU/JIMMY'S CAR - DAY\n          \n          Jimmy's pulled forward to the drive thru while Judy tapes\n          from passenger seat. A voice squawks at Jimmy, asking for\n          his order.\n          \n                                                                  55.\n          \n          \n          \n                              JIMMY\n                    Can I get a double cheese burger,\n                    no pickles, large fries and a coke?\n          \n          Jimmy looks at the camera.\n          \n                              JIMMY\n                    That's what I fucking missed more\n                    than anything. Fast food.\n          \n          He turns back to order more.\n          \n                              JIMMY\n                    And a number two.\n          \n          The Drive Thru window voice rattles off a price and tells him\n          to pull up. Jimmy continues to camera.\n          \n                              JUDY (O.C.)\n                    What did you do in there all day?\n          \n                              JIMMY\n                    Masturbated mostly.\n          \n                              JUDY (O.C.)\n                        (jokingly)\n                    You cheated on me! I want to be\n                    the only person responsible for\n                    making you cum.\n          \n                              JIMMY\n                    I hope you're willing to be on call\n                    twenty four hours a day.\n          \n                              JUDY (O.C.)\n                    Seriously, what did you do? What\n                    was a day in the life of Jimmy in\n                    the nut house?\n          \n                              JIMMY\n                    Well, besides masturbating, I\n                    talked and talked and talked and\n                    fucking talked until they were\n                    satisfied. But basically I told\n                    them what they wanted to hear. I\n                    said shit like...\n          \n          Jimmy does an over the top mock sincerity speech.\n          \n                                                                      56.\n          \n          \n          \n                              JIMMY\n                    \"Now that I'm finally able to talk\n                    about my problems, I now realize\n                    that my behavior was inappropriate\n                    and harmful to others.\"\n          \n          Judy laughs.\n          \n                              JIMMY\n                    Then I figured it out. I had to\n                    cry as much as possible. Whenever\n                    someone would cry they'd call it a\n                    \"break through.\" So I'd be like.\n          \n          Jimmy does an imitation of himself in therapy.   He looks\n          directly into the lens.\n          \n                              JIMMY\n                    You start out slow, then you build\n                    it up like this... \"Now I know\n                    that using violence is not the\n                    answer.\"\n          \n          Jimmy is getting progressively sappier and more over the top\n          with his self impersonation.\n          \n                              JIMMY\n                    Then you go like this:\n                        (snaps back into the\n                         impersonation)\n                    I was wrong, I know I was wrong and\n                    I'll never do it again. I don't\n                    want to hurt people or myself.\n          \n          Jimmy does an obnoxious fake cry.\n          \n                              JIMMY\n                    Boo hoo, waaaaaa, boo-hoo-hoo,\n                    waaaaaaa.\n                        (snaps out of it)\n                    Then you always give them the\n                    obligatory hug at the end. After a\n                    couple of weeks, then they\n                    officially diagnose you with\n                    something, give you a prescription,\n                    then you're done.\n          \n                              JUDY (O.C.)\n                    God, you're a genius.\n          \n          Jimmy pulls up to the drive through window and pays the\n          Cashier who hands him the a paper bag of food.\n          \n                                                                  57.\n          \n          \n          \n          Jimmy pulls away and parks. Judy continues to question him\n          as he goes through his bag of food.\n          \n                              JUDY (O.C.)\n                    So what did they say you have?\n          \n          Jimmy munches on some fries.\n          \n                              JIMMY\n                    ODD. Oppositional Defiance\n                    Disorder.\n          \n                              JUDY (O.C.)\n                    You're so lucky. I wish I was\n                    diagnosed with something. What\n                    does it mean?\n          \n          Jimmy pretends he is reading from a text book 50's industrial\n          spoof style.\n          \n                              JIMMY\n                    ODD is a disorder characterized by\n                    an overwhelming pattern of\n                    negative, hostile, and defiant\n                    behavior which causes severe\n                    delusions where the patient can no\n                    longer distinguish fantasy from\n                    reality.\n          \n                               JUDY (O.C.)\n                    Wow.   I love that!\n          \n          Jimmy smiles as he gets his burger out of the paper bag. He\n          then opens the top bun of the burger to examine if they got\n          his order correct. They didn't.\n          \n          Jimmy playfully begins to act crazy.\n          \n                              JIMMY\n                    You see. They fucked up my order.\n                    I specifically asked for no\n                    pickles.\n          \n                              JUDY (O.C.)\n                        (playing along)\n                    Oh, no! How will ODD Boy handle\n                    this? Will his ODD brain be able\n                    to withstand a pickle screw up at\n                    the drive thru?\n          \n          Jimmy goes into a cartoonish like crazy person character.\n          \n                                                                  58.\n          \n          \n          \n          He begins by taking the pickles off of his burger. He puts\n          the burger down, quickly lifts his shirt, holding it up with\n          his chin while he places two pickles over top of his nipples.\n          \n          Jimmy yells.\n          \n                              JIMMY\n                    Ooow, jeez, they're hot! I burnt\n                    my nipples with the pickles.\n          \n          Judy cracks up laughing. Jimmy takes a pickle off of his\n          left nipple and dangles it directly in front of the lens.\n          \n          He then feeds it to Judy. We hear Judy chomping on the\n          pickle and giggling off camera. The camera shakes then shuts\n          down.\n          \n                                                         CAMERA ON:\n          \n          I/E. GHETTO/JUDY'S CAR - NIGHT\n          \n          Judy is driving through the ghetto as Jimmy shoots out of the\n          window. On the sidewalk, he catches glimpses Drug Dealers, a\n          Crack Whore, a Drunk stumbling along, and Other Pretty\n          Sketchy Characters.\n          \n                              JIMMY (O.C.)\n                    I love the ghetto. I don't know\n                    what it is about it. I fucking\n                    love it. It's always the first\n                    place I go to when I get out.\n          \n                              JUDY\n                    I love it when you're out of the\n                    looney bin. Do you think you might\n                    be able to try to avoid the place\n                    for a while?\n          \n                              JIMMY (O.C.)\n                        (joking)\n                    If they don't send me to the bin,\n                    maybe they'll send me to jail.\n          \n          This upsets Judy.\n          \n                              JUDY\n                    I'm serious. You act like it's no\n                    big deal when you go away!\n          \n                               JIMMY (O.C.)\n                        (tired of it)\n                    All right.\n          \n                                                                      59.\n          \n          \n          \n                              JUDY\n                    No it's not all right! When you're\n                    in there I have to be out in the\n                    real world alone, by myself Jimmy.\n                    You go away and come back like it's\n                    no big deal. Well it is a big\n                    deal. I don't want to spend\n                    another day without you. Do you\n                    understand me? I'd rather die.\n          \n          Judy's holding back tears.\n          \n                              JIMMY (O.C.)\n                    I'm not going back.\n          \n          She doesn't believe him. She's really starting to cry\n          despite herself. He pulls his eye from the lens to look at\n          her.\n          \n                               JIMMY (O.C.)\n                    Judy.\n          \n          Judy looks over at him.\n          \n                              JIMMY (O.C.)\n                    I promise. I swear on my life and\n                    I swear on our bond, I'll never go\n                    back.\n          \n          Her freak out subsides.\n          \n                              JUDY\n                    If you swear on our bond, then I\n                    believe you.\n          \n          Judy lets out half cry and half yelp.   Her emotions are a bit\n          out of control.\n          \n                              JUDY\n                    I love you so fucking much.\n          \n                              JIMMY    (O.C.)\n                    I love you too.\n          \n          Awkward silence.   Judy looks like she wants to ask Jimmy\n          something.\n          \n                              JIMMY (O.C.)\n                    What's the matter?\n          \n                                                                     60.\n          \n          \n          \n                              JUDY\n                    I was thinking, the last time you\n                    got out we did it like five times,\n                    like as soon as we saw each other,\n                    we got naked and started doing it.\n                    And today, my parents weren't even\n                    home and I tried to do some stuff\n                    to you, but you were acting like\n                    you weren't interested.\n          \n                              JIMMY (O.C.)\n                    I didn't mean to.\n          \n                              JUDY\n                    Was it because you jerked off so\n                    much while you were locked up?\n          \n          Jimmy hands her a small bottle of whiskey. She takes a\n          sizable gulp, makes a face, then hands it back to Jimmy.\n          \n                              JIMMY (O.C.)\n                    No.\n          \n          Judy is getting upset again.\n          \n                              JUDY\n                        (voice cracking)\n                    Then why don't you want to have sex\n                    with me Jimmy? You don't think I'm\n                    pretty anymore?\n          \n                              JIMMY (O.C.)\n                    No, no, no! That has nothing to do\n                    with it. After I saw my dad being\n                    rammed in the ass by my mother, I\n                    kind of blocked it out, but when I\n                    was in there they kept talking to\n                    me and talking to me about it. Now\n                    I can't stop it from coming into my\n                    head. Every time I get wood, the\n                    instant replay machine in my brain\n                    projects this image of my Mom\n                    pounding into my Dad.\n          \n                              JUDY\n                    God, that's awful.   I didn't know.\n          \n                              JIMMY (O.C.)\n                    Yeah well, you know you didn't give\n                    too much of an effort to get in my\n                    pants anyhow. You just sort of\n                    made your sex face and grabbed my\n                    crotch.\n          \n                                                                    61.\n          \n          \n          \n          Judy takes another drink off the bottle of whiskey and\n          smiles.\n          \n                              JUDY\n                    How do you like this?\n          \n          While she is driving she pulls down her tank top and quickly\n          exposes her breasts through the top of her shirt.\n          \n                              JIMMY (O.C.)\n                    Now we're talking.\n          \n          Judy tries to position her body so her breasts are in frame.\n          She begins pushing one up, then sticks out her tongue,\n          teasing.\n          \n                              JIMMY (O.C.)\n                    That is so hot.\n          \n          Judy smiles and looks over at the camera. One hand on the\n          steering wheel and one on her breast, when...\n          \n                                 JIMMY (O.C.)\n                    Watch out!\n          \n          BOOM!\n          \n          A loud THUMP hits the car, shaking the camera.\n          \n                              JIMMY (O.C.)\n                    I think you hit someone.\n          \n          Judy's in shock. Jimmy puts the camera on the floor of the\n          car by the passenger seat. He forgets to turn it off.\n          \n          All we see is a close up of the floor and Jimmy's feet.\n          \n                                 JIMMY (O.C.)\n                    Stay here.\n          \n          Jimmy gets out of the car.    We hear the car door open then\n          close.\n          \n          Judy sounds like she is having a complete nervous breakdown.\n          She's crying, but in an extremely nervous and frantic way.\n          \n                              JUDY (O.C.)\n                        (calls to him)\n                    Oh my God, what are you doing?\n          \n          We have no clue what Jimmy is doing outside of the car.\n          \n                                                                  62.\n          \n          \n          \n                               JUDY (O.C.)\n                     Oh fuck, oh fuck. Oh my god.\n                     Jimmy?\n          \n          We hear a car door open and some struggling sounds coming\n          from Jimmy.\n          \n                               JUDY (O.C.)\n                     Don't put him in here!\n          \n                               JIMMY (O.C.)\n                     We're taking him to the hospital.\n          \n                               JUDY (O.C.)\n                     No, we'll get busted.\n          \n          Long pause, we hear Jimmy struggling off camera.\n          \n                               JUDY (O.C.)\n                     What... what are you doing?\n          \n                               JIMMY (O.C.)\n                     He's not breathing. He's not\n                     fucking breathing!\n          \n          Silence.   You can feel them thinking.\n          \n                               JUDY (O.C.)\n                     Is he dead?\n          \n                               JIMMY (O.C.)\n                         (has decided)\n                     Pop the trunk for me.\n          \n                               JUDY (O.C.)\n                     No.\n          \n                               JIMMY (O.C.)\n                     Judy.\n          \n                               JUDY (O.C.)\n                     What are we gonna do?\n          \n                               JIMMY (O.C.)\n                     I don't know right now, but we're\n                     not driving around with a dead guy\n                     in our back seat.\n          \n                               JUDY (O.C.)\n                     I just want to go home. Jimmy,\n                     let's leave him. He's dead. We\n                     should just go.\n          \n                                                                  63.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Pop the fucking trunk already\n                    before someone sees us!\n          \n          We hear Judy pop the trunk.\n          \n          We hear Jimmy struggling.\n          \n          The camera is still on the floor of the car.\n          \n          More struggling as Jimmy is clearly outside putting the body\n          into the trunk.\n          \n                              JUDY (O.C.)\n                        (to self)\n                    I want to go home.\n          \n          We hear Jimmy slam the trunk.\n          \n                              JIMMY (O.C.)\n                        (screams; frustrated)\n                    Fuck!\n          \n          We hear Jimmy come around to the driver's seat and open the\n          door.\n          \n                              JUDY (O.C.)\n                    Jimmy, I...\n          \n                              JIMMY (O.C.)\n                    I'm driving.\n          \n          We hear Judy get out of the car and walk around to the\n          passenger side and open the door, but she doesn't get in.\n          \n                                JIMMY (O.C.)\n                    Get in.\n          \n          Judy doesn't respond.\n          \n                              JIMMY (O.C.)\n                    Are you gonna fucking get in!\n          \n          Judy is hysterical.\n          \n                              JUDY (O.C.)\n                    We should just leave him here.\n          \n                              JIMMY (O.C.)\n                    We can't leave him in the middle of\n                    the fucking ghetto. Get in before\n                    someone sees us!\n          \n                                                                    64.\n          \n          \n          \n          Judy's losing it.\n          \n                              JUDY (O.C.)\n                    I don't want him in my fucking car!\n                    I want him out!\n          \n          Before Jimmy can respond, we see the reflection of police\n          lights. Red and blue lights flicker against the lens.\n          \n                               JUDY (O.C.)\n                    Oh shit!\n          \n          We hear Judy get in the car and close the door.\n          \n                              JUDY (O.C.)\n                    It's the fucking cops.\n          \n                              JIMMY (O.C.)\n                    Just shut up.\n          \n          She's hysterical.\n          \n                              JUDY (O.C.)\n                    It's the cops. It's the cops.\n                    It's the...\n          \n                               JIMMY (O.C.)\n                    Shhhhhh!\n          \n          Jimmy kicks the camera. We still can't see any of this.     We\n          can only hear what's happening.\n          \n                              JIMMY (O.C.)\n                    You gotta play it cool, okay?\n          \n          Judy's crying gets louder.\n          \n                              JIMMY (O.C.)\n                    Stop fucking crying. Please, I'm\n                    begging you. Stop it.\n          \n          We hear the cop open and shut his patrol car door.\n          \n                              JUDY (O.C.)\n                    Oh God. He's getting out of the\n                    car. We've got a dead homeless guy\n                    in our trunk and he's...\n          \n                              JIMMY (O.C.)\n                    SSSHHHHHHHHHHHHHHHH!\n          \n                                                                     65.\n          \n          \n          \n                              JUDY (O.C.)\n                    Oh, my god Jimmy, he's walking\n                    towards us.\n          \n                              JIMMY (O.C.)\n                    SSSHHHHHHHHHHHHHHHH! Just be cool.\n          \n          The Cop is close, we can feel his footsteps coming towards\n          the car. Judy collects herself as best as she can.\n          \n          The cop taps his flashlight against the window.\n          \n          We hear Judy roll down her power window and we hear the voice\n          of the Cop.\n          \n                              COP (O.C.)\n                    Good evening. License and\n                    registration please.\n          \n                              JIMMY (O.C.)\n                    Certainly, sir.\n          \n          The light from the Cop's flashlight reflects off the floor of\n          the car and into the lens of the camera.\n          \n          The reflections stop.   The wait is unbearable.\n          \n                              COP (O.C.)\n                    Could you please step out of the\n                    vehicle?\n          \n          Jimmy gets out of the car as Judy trembles in the passengers\n          seat.\n          \n          We only hear the sounds of Judy sniffling and repressing\n          herself from crying and idle chatter of the Cop's radio.\n          \n          It seems like forever, then...\n          \n          THUMP!\n          \n          The car is shaking, we hear intense struggling going on\n          outside.\n          \n          Judy unleashes a piercing, high pitched scream.\n          \n                              JUDY (O.C.)\n                    Jimmy!\n          \n          More violent struggling is heard as Judy begins to\n          hyperventilate.\n          \n          POP\n          \n                                                                     66.\n          \n          \n          \n          A gunshot is fired.\n          \n          Judy screams.\n          \n                               JUDY (O.C.)\n                     AAAAAHHHHHHH!\n          \n          POP.   Another shot is fired.\n          \n          The car door opens, Jimmy gets in. We hear the sounds of\n          tires squealing and the engine roaring.\n          \n                               JUDY (O.C.)\n                     What happened?\n          \n                                JIMMY (O.C.)\n                     Shut up!\n          \n          Judy's now totally freaked.\n          \n                               JUDY (O.C.)\n                     What happened!\n          \n                               JIMMY (O.C.)\n                     Just shut the fuck up! I don't\n                     fucking want to talk about it!\n          \n          Jimmy can't bully her into silence.    She continues to freak\n          out. The camera is kicked.\n          \n                               JUDY (O.C.)\n                     I JUST WANT TO KNOW WHAT FUCKING\n                     HAPPENED! I WANNA KNOW. I WANNA\n                     KNOW. I JUST WANNA FUCKING...!\n          \n          Camera is kicked off and shuts down.\n          \n                                                           CAMERA ON:\n          \n          EXT. REST STOP - SECLUDED AREA - TRUNK OF THE CAR - NIGHT\n          \n          A weird, digital, black and white image plays on the camera.\n          There's no light and Jimmy's got the camera back in \"Nite\n          Shot\" mode. He's standing outside of the car filming the\n          Homeless Man who is lying dead inside of the trunk. Judy\n          stands next to him as he films.\n          \n          The Homeless Man is twisted and contorted in order to fit in\n          the small confines of the trunk.\n          \n          Jimmy pans back and forth and up and down his dead body.\n          \n                                                             67.\n          \n          \n          \n                              JUDY (O.C.)\n                    What are you doing?\n          \n                              JIMMY (O.C.)\n                        (it's obvious)\n                    I'm filming.\n          \n                                 JUDY (O.C.)\n                    It's dark.     You can't see anything.\n          \n                              JIMMY (O.C.)\n                    It's on infra-red. Do you wanna\n                    see?\n          \n                              JUDY (O.C.)\n                    No, I don't wanna see.\n          \n                              JIMMY (O.C.)\n                    He's beautiful. He really is.\n                    There's a certain serenity to death\n                    I appreciate.\n          \n                              JUDY (O.C.)\n                    He's dead. He's in my car, Jimmy,\n                    and he stinks. I wanna go home.\n          \n          Jimmy keeps filming.\n          \n                              JUDY (O.C.)\n                    I don't think I can do this.\n          \n          Jimmy ignores her.\n          \n                              JUDY (O.C.)\n                    I'm not like you. I can't do this.\n                        (holds back a sob)\n                    I wanna fucking go home.\n          \n                              JIMMY (O.C.)\n                    Yeah, well you can't fucking go\n                    home. And you will do this. You\n                    did do this. You killed him. You\n                    didn't get in the car until the\n                    cops showed up. Now we don't have\n                    a choice. You want me to go to\n                    jail? You want that?\n          \n                                JUDY (O.C.)\n                          (softer)\n                    No.\n          \n          Judy settles.   Jimmy is out of breath.\n          \n                                                                  68.\n          \n          \n          \n          The sun is beginning to rise. The light of a new day\n          cascades upon the dead body in the trunk.\n          \n                              JUDY (O.C.)\n                        (half crying)\n                    What are we going to do?\n          \n                              JIMMY (O.C.)\n                    We just need to make intelligent\n                    decisions. That's all. We'll find\n                    a way to take care of it. Then\n                    we'll go away. We'll fix it.\n                    It'll be okay. I promise.\n          \n                              JUDY (O.C.)\n                    You promise?\n          \n                               JIMMY (O.C.)\n                    Yeah.   Come here.\n          \n          Jimmy has dropped the camera away from the Homeless Man.\n          He's still rolling while he wraps his arms around her and\n          holds her.\n          \n          We hear him kissing her softly.\n          \n                              JIMMY (O.C.)\n                    It's gonna be okay. I'm gonna take\n                    care of everything. I promise.\n          \n          Camera shuts down.\n          \n                                                         CAMERA ON:\n          \n          INT. WOODS IN NOWHERE - HOMELESS MAN ROAST - NIGHT\n          \n          We see and hear a huge roaring fire. Jimmy has zoomed the\n          lens in so close that we can't tell what it is that's\n          burning.\n          \n          As he pulls out, it's revealed that the dead homeless guy is\n          roasting in the fire.\n          \n                              JUDY (O.C.)\n                        (coughing)\n                    Oh, my god. The hair burning is\n                    making me nauseous.\n          \n          Judy coughs more violently before.\n          \n                                                                  69.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Yeah, God damn. Burning bodies\n                    fucking stinks. That bum's body\n                    odor is being cooked right off him.\n          \n          Jimmy pokes the flaming skull with his stick.\n          \n                                JUDY (O.C.)\n                    Jimmy!\n          \n          Jimmy pokes some more at the body, then flips the camera up\n          at Judy.\n          \n                                JUDY\n                    What?    I'm not in the mood.\n          \n                              JIMMY (O.C.)\n                        (making light)\n                    Don't have to be in the mood.\n                    Doesn't matter. The camera's on,\n                    it's on.\n                        (changes the subject)\n                    You wanna know where we're gonna\n                    go?\n          \n                              JUDY\n                    Okay, where are we gonna go?\n          \n                              JIMMY (O.C.)\n                    We're going to Lincoln to visit\n                    Dinko.\n          \n                              JUDY\n                    Who's Dinko, Jimmy?\n          \n                              JIMMY (O.C.)\n                    He's cool. And he's got his own\n                    place, and he said I could stay\n                    there whenever ever I wanted. Plus\n                    he knows about you and he wants to\n                    meet you. And he doesn't like\n                    cops, so he's not gonna call 'em.\n                    Okay? Now gimme a smile.\n          \n                                JUDY\n                    No.\n          \n                              JIMMY (O.C.)\n                    Gimme a smile, and I'll let you see\n                    my smiley face again.\n          \n          Judy begins coughing.\n          \n                                                                  70.\n          \n          \n          \n                              JUDY\n                    I can't get sexy with that smell.\n                    I just can't.\n          \n          Camera shuts down.\n          \n                                                          CAMERA ON:\n          \n          INT. DINKO'S TRAILER - NIGHT\n          \n          Music is playing extremely loud in a funky ass trailer as\n          Judy dances with DINKO (late 20s) a completely drunk trailer\n          trash dude wearing a pizza delivery outfit.\n          \n          Empty whiskey and beer bottles are scattered throughout the\n          tiny living room as cigarette smoke hovers around them due to\n          a ridiculously low ceiling.\n          \n          Judy is dancing in a very sexy manner with Dinko who is\n          dancing like a complete dork. Dinko has no moves, rhythm, or\n          beat whatsoever, but dances with as much vigor as a dog on\n          crack.\n          \n          Jimmy is sitting on the couch filming them dancing in front\n          of him. Dinko is forced to scream over top of the music to\n          be heard. He looks directly at Jimmy noticing that Jimmy's\n          turned on the camera.\n          \n                              DINKO\n                    Hey! The video-man. I remember\n                    that shit when we was in together.\n                    Said you video-ed everything.\n          \n                               JIMMY (O.C.)\n                    Yep.\n          \n                              DINKO\n                    Hey man, it's cool if you guys stay\n                    here for a while, but I have a\n                    small business to run man. There's\n                    going to be some people knocking on\n                    the door and shit. I can't have\n                    you guys answering the door or the\n                    phone. That's the only rule.\n                    Other than that man, we're going to\n                    getting fucked up together all the\n                    time. I got a shit load of crank\n                    dude, that shit is off the fucking\n                    hook. Here, take a hit.\n          \n          Dinko tries to hand off some crank to Jimmy.\n          \n                                                                    71.\n          \n          \n          \n                              JIMMY (O.C.)\n                    No thanks, I just want to film Judy\n                    dancing.\n          \n          Jimmy pans the camera over towards Judy.    She's doing her\n          best sexy dance into the camera.\n          \n          We can still hear Dinko talking to Jimmy.\n          \n                              DINKO (O.C.)\n                    Right man. That's cool. Hey um...\n                    If I tell you to stop taping\n                    though, man, you gotta stop. I got\n                    some hard core junkies coming over\n                    here. Sometimes, if they see shit\n                    like that, they fucking flip.\n                    Crank junkies are a whole different\n                    kind of breed man. They're fucking\n                    hard core mother fuckers. You\n                    don't know what they're gonna\n                    fucking do. This one guy got\n                    paranoid about something. He used\n                    to climb on his roof to take a\n                    dump. That's the only place he\n                    would shit! How fucked up is that?\n          \n          Dinko laughs at his own joke.\n          \n                              JUDY\n                    You're not even paying attention to\n                    me Jimmy.\n          \n          Judy takes her dancing up a notch to get Jimmy's attention.\n          \n                              JUDY\n                    Don't I look sexy?\n          \n          Jimmy doesn't get a chance to respond.\n          \n                               DINKO (O.C.)\n                    Yeah, you look real sexy baby.\n                    Real nice.\n          \n          Dinko starts in with Jimmy again.\n          \n                              DINKO (O.C.)\n                    Hey, I may have some work for you\n                    if you're cool with that.\n          \n          Jimmy turns the camera back to Dinko while he goes to the\n          kitchen to get a beer.\n          \n                                                                  72.\n          \n          \n          \n                              JIMMY (O.C.)\n                    What kind of work?\n          \n                               DINKO\n                    You know some hustling, some good\n                    money. I'll teach you how to mix\n                    the shit. Your girlfriend too if\n                    she wants.\n          \n                              JIMMY (O.C.)\n                        (sarcasm)\n                    Yeah. That's what I've always\n                    wanted to do. Learn to make and\n                    sell crystal methamphetamine.\n                    You're a fucking genius Dinko.\n          \n          Dinko is too stupid to recognize sarcasm.\n          \n                              DINKO\n                        (big smile)\n                    Yeah, man! Fuckin' high five.\n          \n          Dinko high five's Jimmy and laughs again.\n          \n                              DINKO\n                        (re: Judy)\n                    So is she, like, your girlfriend or\n                    are you guys just fucking?\n          \n                              JIMMY (O.C.)\n                    She's my girlfriend, my best\n                    friend, and yes we fuck. And don't\n                    ever, ever fucking touch her.\n                    That's MY only rule Dinko.\n          \n          Judy is frustrated with Jimmy's lack of attention.\n          \n                              JUDY (O.C.)\n                    Jimmy!\n          \n          Jimmy turns the camera to her. She's starting to do her best\n          impression of a stripper dance.\n          \n                              DINKO\n                    It's all good man. I ain't gonna\n                    touch your old lady. Shit man,\n                    she's so into you anyway.\n          \n          Dinko gets up and moves into the kitchen area, crossing the\n          frame. Jimmy focusses the camera's attention on various\n          items in the kitchen while Dinko talks.\n          \n                                                                    73.\n          \n          \n          \n          There's ripped open small electronics and appliances\n          everywhere, as if Dinko's been taking everything apart and\n          trying to put it back together.\n          \n                              DINKO\n                    So there's this dude. Fucker\n                    taught me everything I know about\n                    meth and shit. He'd fucking flip\n                    for your girl, man. You should go\n                    up and see him. He's in Erlanger.\n          \n                              JIMMY (O.C.)\n                    Uncle Rodney?\n          \n          Camera drifts across several messy piles of papers and\n          cardboard boxes with bags of drugs in them.\n          \n                              DINKO (O.C.)\n                    Right, right! I forgot.     Yeah,\n                    Uncle Rodney!\n          \n                              JUDY (O.C.)\n                    You have an Uncle Rodney baby?\n          \n          Judy is too stoned to realize that Jimmy has already told her\n          about Uncle Rodney.\n          \n          Jimmy pulls out to include Judy in the shot. She's in the\n          kitchen doing another line of crank off a counter top.\n          \n                              JUDY\n                    I want to meet your uncle.\n          \n                              JIMMY (O.C.)\n                    He's not my uncle. He's not\n                    anybody's uncle. People just call\n                    him that. He's the one I told you\n                    about from the nut house.\n          \n          As Judy bends down to snort her line, camera drifts over to\n          Dinko who's holding a HUGE HILLBILLY WAD OF CASH in his hand\n          and stuffs it into a box of cereal. Jimmy zooms in on the\n          cereal box. There's a whole bunch more cash in there.\n          \n                              JIMMY (O.C.)\n                    I said one day I'd take you up to\n                    Erlanger one day, remember?\n          \n                              JUDY (O.C.)\n                    When was that?\n          \n          Dinko throws the cash on the table.    Jimmy ZOOMS OUT catching\n          Judy in the frame.\n          \n                                                                  74.\n          \n          \n          \n                              JIMMY (O.C.)\n                    When we were naked.\n          \n                              JUDY\n                    We're always naked, Jimmy.\n          \n          Judy wipes powder from her nose, then goes foggy for a split\n          second, losing then catching her balance.\n          \n                              JUDY\n                        (re: crank)\n                    Fuck... Woah, that's cool.\n          \n                              DINKO (O.C.)\n                    That's some good shit, huh?\n          \n                              JUDY\n                        (disoriented)\n                    Uh huh...\n          \n          Jimmy turns the camera onto Dinko.\n          \n                              DINKO\n                    So you guys should like, totally go\n                    see him, man. I don't fuckin' go\n                    up there no more, 'cuz like, I got\n                    all the shit I need right here man,\n                    'cuz my place is cool and all, but\n                    there's no fucking room here, ya\n                    know? So like you should go see\n                    him and shit.\n          \n          Judy steps into frame. At this point, she's in her bra and\n          is dancing like a stripper directly in front of the camera.\n          \n                              JUDY\n                    You like this, Jimmy?\n          \n          THERE'S A KNOCK at the door.\n          \n                                DINKO (O.C.)\n                          (calls out to door)\n                    Yo!\n                        (to Jimmy)\n                    Customers call.\n          \n          Judy keeps on dancing in her own little world while Dinko\n          goes to the door. Judy finishes her bottle of beer. She's\n          pretty drunk and cranked out at this point.\n          \n                                                                     75.\n          \n          \n          \n          Dinko is at the front door dealing with a customer. We can't\n          see her and we can barely hear what they're talking about,\n          but it seems Dinko is engaged in a heated conversation with\n          her. He yells back into the living room from the front door.\n          \n                                 DINKO (O.C.)\n                    Yo, Jimmy.     Is your girl into\n                    chicks?\n          \n                              JIMMY (O.C.)\n                    I don't know.\n                        (to Judy)\n                    Are you into chicks?\n          \n                              JUDY\n                    Do you want me to be into chicks?\n          \n                              JIMMY (O.C.)\n                        (calls to her)\n                    Sure Dinko. Bring her in.\n          \n          Dinko brings in HAZEL,(40), a frightfully thin crank addict.\n          She's scared, nervous, and completely strung out, and she\n          looks like death. They stand off to the side of the room\n          watching Judy dance.\n          \n          Judy realizes the woman is in the room and stops dancing.\n          \n          Jimmy zooms in on the woman. Looking closer we see that\n          Hazel is in the final stages of her life/addiction. She's\n          sweating and her eyes are bugging out of her skull.\n          \n          Dinko turns the music down so they don't have to scream.\n          \n                              JIMMY (O.C.)\n                    You know what, never mind Dink.    I\n                    don't think Judy's into chicks.\n          \n                              JUDY\n                    Yeah, I'm not into chicks.\n          \n                              DINKO\n                    Well Hazel here will do anything we\n                    want. Ain't that right Hazel?\n          \n          Hazel nods her head yes.\n          \n                              DINKO\n                    You're into chicks aren't you\n                    Hazel?\n          \n                                                                      76.\n          \n          \n          \n                              HAZEL\n                    Um, I really just want to get some\n                    stuff and get out of here.\n          \n          Hazel is trembling.    The party atmosphere has come to a\n          complete halt.\n          \n                              DINKO\n                    Shut up you fat fucking junkie and\n                    take your clothes off or you ain't\n                    getting shit.\n          \n          Hazel's not moving.    She's reluctant.\n          \n                                 DINKO\n                    Come on!\n          \n                                 HAZEL\n                    I don't...\n          \n          Dinko smacks her square in the face.\n          \n                              DINKO\n                        (screaming)\n                    Just do it, you fucking whore!\n          \n          Hazel starts to take her clothes off reluctantly.\n          \n                                 JUDY\n                    Jimmy.\n          \n          Jimmy doesn't do anything.     He just keeps filming.\n          \n                              JUDY\n                    Jimmy, stop him!\n          \n                              JIMMY (O.C.)\n                    He's a big boy, he can do what he\n                    wants.\n          \n          This gives Dinko an added boost of confidence. Hazel is now\n          in her bra and panties and is standing in front of them.\n          \n                              DINKO\n                    Ever made a porno?\n          \n                              JIMMY (O.C.)\n                    Not with you.\n          \n                                                                  77.\n          \n          \n          \n                              DINKO\n                    Well all right! Keep filming\n                    mother fucker, I'm gonna fuck this\n                    junkie for you. You guys are free\n                    to join in whenever you like.\n          \n          Judy is now borderline hysterical.\n          \n                              JUDY\n                    I swear to God Jimmy if you let him\n                    go through with this I'll never\n                    talk to you again!\n          \n          Jimmy ignores her.\n          \n                                 DINKO\n                    You ready?     You filming?\n          \n                              JIMMY (O.C.)\n                    I'm filming. Are you going to fuck\n                    her or are you just gonna talk\n                    about it?\n          \n                              JUDY\n                        (screaming)\n                    Jimmy!\n          \n          Dinko unbuckles his belt as fast as he can. Hazel begins to\n          cry as Dinko pushes her into position on all fours.\n          \n                              DINKO\n                        (to Jimmy)\n                    How's this? You getting good\n                    camera angles and shit?\n          \n                              JIMMY (O.C.)\n                    Turn her ass towards the camera.\n          \n                              DINKO\n                        (laughing it up)\n                    Take off them panties bitch...   Oh\n                    yeah! Come on bitch. Move.\n          \n          Judy is crying profusely in the background as Dinko pushes\n          Hazel to the ground. Jimmy zooms in on Dinko, framing out\n          Hazel as Dinko gets himself ready to take her from behind.\n          \n                                 DINKO\n                    That's it.     Just like that.\n          \n          Dinko looks directly at the lens of the camera.\n          \n                                                                      78.\n          \n          \n          \n                              DINKO\n                    We're going to be doing this shit\n                    all the time brother.\n          \n                              JIMMY (O.C.)\n                    You think so?\n          \n                                 DINKO\n                    Fuck yeah!\n          \n          Dinko sees something O.C. from Jimmy, we can't see that\n          surprises him.\n          \n                              DINKO\n                    You don't have to hold a gun to her\n                    head man. There's plenty of other\n                    chicks we can do that to. If\n                    that's what you're into, then fuck\n                    it, I'll...\n          \n          BAM!!!\n          \n          Dinko takes a shot in the throat and falls onto Hazel.\n          Jimmy's shot him.\n          \n          Judy has stopped screaming. Hazel on the other hand is\n          freaking out, trapped under a squirming Dinko.\n          \n          Jimmy sets the camera on top of something, stands up and\n          brings the gun to Judy.\n          \n                                 JIMMY\n                    Take it!\n          \n          Judy doesn't know what to do.   Jimmy puts the gun in her\n          hand.\n          \n                              JIMMY\n                    Finish him off! He deserves a\n                    bullet right in the fucking face,\n                    doesn't he?\n          \n          Judy's in a weird cranked out place.\n          \n                              JUDY\n                        (nervous, cranked out)\n                    Yeah. Yeah. He does.\n          \n                              JIMMY\n                    Then do it.\n          \n          Judy points the gun at a still squirming Dinko.   She can't\n          bring herself to pull the trigger.\n          \n                                                                   79.\n          \n          \n          \n          We can hear Dinko choking on his own blood.   He struggles to\n          move towards Judy.\n          \n          Jimmy's now standing behind Judy. He wraps his hand around\n          hers, helps her point the gun and...\n          \n          BAM\n          \n          Shoots Dinko right between the eyes.   Jimmy helps her again.\n          \n          BAM-BAM\n          \n          Two more shots into his chest, Jimmy's hand still wrapped\n          around Judy's over the gun.\n          \n          Jimmy lets go of her hand and the gun drops to the floor.\n          She's stunned.\n          \n          Jimmy comes towards camera and shuts it down.\n          \n                                                          CAMERA ON:\n          \n          I/E. ROAD LEAVING TRAILER/DINKO'S CAR - NIGHT\n          \n          A rip roaring fire burns from the trailer. Jimmy is shooting\n          out of the back of the Dinko's Car, a beat up old station\n          wagon, as they drive away down the gravel road.\n          \n                              JIMMY (O.C.)\n                    Good bye Dinko, mother fucker.\n                    Thanks for letting us borrow your\n                    car, and for the cash.\n          \n                              JUDY (O.C.)\n                    And for the crank!\n          \n          Jimmy sits back into his seat and turns the camera on Judy.\n          She's got a big smile on her face.\n          \n                              JIMMY (O.C.)\n                    You feeling good baby?\n          \n                              JUDY\n                    I feel calm. I don't care about\n                    anything.\n          \n          Jimmy keeps filming.\n          \n                               JUDY\n                    What are we going to do with the\n                    car Jimmy?\n          \n                                                                    80.\n          \n          \n          \n                                 JIMMY (O.C.)\n                    Ditch it.\n          \n                                 JUDY\n                    The crank?\n          \n                                 JIMMY (O.C.)\n                    Snort it.     Give some of it away.\n          \n                                 JUDY\n                    The cash.\n          \n                              JIMMY (O.C.)\n                    Vacation baby. Anywhere we want to\n                    go.\n          \n          Judy smiles. She turns and blows a kiss towards the camera,\n          oddly serene from the drugs despite everything that's\n          happened. To her, it's as if all is right with the world.\n          \n          Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          INT. LAS VEGAS - WEDDING CHAPEL - NIGHT\n          \n          Jimmy is standing on the altar waiting for his bride to be.\n          He is wearing a white tuxedo with black tie and ruffle shirt\n          like Ricardo Montalban from Fantasy Island.\n          \n          They are being married by an Elvis impersonator and the\n          witnesses/groomsmen are Siegfried and Roy look-a-likes.\n          \n          Jimmy waves to the person who is working the camera.   The\n          Elvis impersonator talks to Jimmy.\n          \n                              ELVIS\n                    You know the video's gonna cost you\n                    twenty extra, right?\n          \n                                 JIMMY\n                    Yeah.\n          \n                              ELVIS\n                    Well alright then.    Let's get this\n                    sum bitch started!\n          \n          Elvis reaches down and gets a guitar and breaks into an Elvis\n          version of \"Here Comes the Bride\" but to the song \"You ain't\n          Nothing But A Hound Dog.\"\n          \n                                                                  81.\n          \n          \n          \n                              ELVIS\n                    Weeeeeelllll, you ain't nothing but\n                    a young bride... walking down the\n                    aisle.\n          \n          The Elvis impersonator goes all out with the dance and the\n          gyrating Elvis hips as he jams on his acoustic guitar.\n          \n          Jimmy motions to the camera to turn around.\n          \n                              JIMMY\n                    Here she comes.\n          \n                              ELVIS (O.C.)\n                    You ain't nothing but a young\n                    bride... walking down the aisle.\n          \n          The camera whips around and we see Judy walking down the\n          aisle. Tears of joy run down Judy's heavily made up face as\n          she walks.\n          \n                              ELVIS\n                    Well, if you don't marry Jimmy,\n                    then you ain't no friend of mine.\n          \n          Judy makes her way over to her side of the altar next to her\n          bridesmaids (two Cher look-a-likes).\n          \n                                ELVIS\n                    Do you...\n          \n          Elvis is looking for Judy's name that's been scribbled on\n          paper.\n          \n                              JIMMY\n                        (helping)\n                    Judy. And here, we wrote our own\n                    vows.\n          \n          He hands Elvis a small piece of paper who skims it. He kind\n          of shakes his head, smirking at what he reads, then decides\n          to go for it.\n          \n          Elvis gives a quick windmill strum to his guitar and starts.\n          \n                              ELVIS\n                    Do you Judy promise to always\n                    swallow, to never cut your hair, or\n                    have another man's penis injected\n                    into any part of your body for as\n                    long as you both shall live?\n          \n          The Cher bridesmaids giggle.\n          \n                                                                     82.\n          \n          \n          \n                               JUDY\n                    I do.\n          \n                              ELVIS\n                    Do you Jimmy promise to always fuck\n                    Judy with enthusiasm, to take a\n                    shower once a day, and promise not\n                    to inject your penis into any part\n                    of another person's body as long as\n                    you both shall live?\n          \n                               JIMMY\n                    I do.\n          \n                              ELVIS\n                    Can I get the rings?\n          \n          Siegfried gives the rings to Jimmy who places one on Judy's\n          finger and vice versa.\n          \n                              ELVIS\n                    With the power vested in me by the\n                    great state of Nevada... I do\n                    herby pronounce you husband and\n                    wife. You may kiss the bride.\n          \n          Jimmy and Judy grab each other by the ass and begin making\n          out.\n          \n          The freak show audience claps while they are making out. The\n          applauding dies down but Jimmy and Judy continue to make out.\n          Jimmy puts his hand up her dress as she begins unbuckling his\n          pants. It looks like they may start fucking on the alter.\n          \n          Elvis jumps in to break it up.\n          \n                              ELVIS\n                    All right you two.     We got a\n                    schedule to keep.\n          \n          Camera shuts down.\n          \n                                                            CAMERA ON:\n          \n          INT. LAS VEGAS - LAS VEGAS MOTEL ROOM - NIGHT\n          \n          Jimmy is running through    the motel room with the camera.\n          Flashes of snorted lines    of crank dust and rolled up bills\n          are in the background as    Jimmy moves through the room. We\n          hear Judy screaming with    excitement about something on the\n          TV.\n          \n                                                                  83.\n          \n          \n          \n                              JUDY (O.C.)\n                    Hurry up Jimmy, hurry, hurry,\n                    hurry, shit Jimmy. You're going to\n                    miss it.\n          \n          Jimmy settles camera on the television.\n          \n          BEGIN TV NEWS REPORT\n          \n          On TV, Jimmy and Judy's high school year book pictures are on\n          the screen.\n          \n          INT. TV NEWS STUDIO - (FOR VEGAS MOTEL TV) - NIGHT\n          \n          An ANCHORMAN is mid-sentence, talking about Jimmy and Judy.\n          \n                              ANCHORMAN\n                    ...press conference in a few\n                    moments. The suspect's names are\n                    James Wright and Judy Elizabeth\n                    Oaks-Kellen...\n          \n                               JUDY (O.C.)\n                    No it's not! I'm Judy Wright now!\n                        (sing songy, like a little\n                         girl)\n                    I'm Judy Wright now!\n          \n                                 JIMMY (O.C.)\n                    Shhhh...     Shut up!\n          \n                              ANCHORMAN\n                    ...from Burlington, Kentucky are\n                    wanted for questioning in the\n                    alleged murder of a Hamilton County\n                    Sheriff's Deputy that was killed\n                    two nights ago while on Patrol in\n                    the Over the Rhine section of\n                    Cincinnati. On a very serious\n                    note, the producers here at KPX-TV\n                    4 would like to warn you that the\n                    images we are about to show are\n                    violent and graphic in nature and\n                    may not be suitable for young\n                    children. Once again, these are\n                    the images that were taken from a\n                    video camera that was mounted on\n                    board the patrol car. Viewer\n                    discretion is advised.\n          \n          Judy gasps involuntarily as...\n          \n                                                                      84.\n          \n          \n          \n          INT. LAS VEGAS - LAS VEGAS MOTEL ROOM - NIGHT\n          \n          Jimmy pulls the camera from the screen and points it at Judy\n          to get her reaction. Her eyes are locked on the screen.\n          \n          Judy's face drops. We, on the other hand, are dying to see\n          what she's looking at.\n          \n          Jimmy swish pans back to the TV and zooms in tight.   The\n          television fills the frame.\n          \n          EXT. GHETTO - COP CAR CAM (FOR VEGAS MOTEL) - NIGHT\n          \n          (From Sc. 37, p. 64) On screen we see something completely\n          new. It's a black and white security cam style video image.\n          Just as the announcer described, this is the kind of image\n          that comes from a video camera that's mounted on the inside\n          of a Cop Car. It's static and covered with date/time text,\n          etc.\n          \n          On TV, we finally get a chance to see what transpired when\n          Jimmy and Judy were pulled over. Judy is standing outside\n          the cop car. The moment she sees it approach, we see her\n          freak just a bit and get into the car quickly and\n          suspiciously. The cop gets up, gets out of the car and goes\n          over to the driver side to talk to Jimmy. After a few\n          moments, he summons Jimmy out of the car while Judy waits.\n          \n          The Cop asks Jimmy to open the trunk. He doesn't have his\n          gun drawn, but he is being cautious, one hand on his gun\n          holster, the other shining on Jimmy's face with a flashlight.\n          \n                              COP\n                        (on TV)\n                    Go ahead and open it.\n          \n          Jimmy stands by the trunk of the car, but he's not really\n          obeying the Cop's commands. He's stalling. The Cop is\n          getting suspicious. We can barely hear what they're saying\n          to each other over the noise of traffic that whizzes by.\n          \n          There's an unintelligible exchange, then... the cop steps\n          forward, raising his voice.\n          \n                              COP\n                        (on TV)\n                    Put your hands on the vehicle.\n          \n          Jimmy's reluctant.\n          \n                              COP\n                        (on TV)\n                    On the vehicle, now!\n          \n                                                                     85.\n          \n          \n          \n          The Cop and Jimmy are sort of at a standoff.    Jimmy finally\n          leans over and puts his hands on the trunk.\n          \n          The Cop comes in close to Jimmy, pulling his hand from his\n          gun holster and shifting it to pull his cuffs off his belt.\n          \n          At that exact moment, Jimmy makes his move, LEAPING for the\n          Cop.\n          \n          He takes the Cop to the ground and off screen.\n          \n          All we see is a barely decipherable image of Judy freaking\n          out in the passenger seat because she can't see what's going\n          on and neither can we.\n          \n          About 5 seconds go by.\n          \n          BOOM!\n          \n          A gunshot is fired.\n          \n          It feels like an eternity, then...\n          \n          Jimmy pops up off the ground. He's got the Cop's gun! He\n          hesitates, not knowing what to do. He pauses, hesitant, then\n          shoots down towards the ground, where the cop is lying out of\n          frame.\n          \n          He runs around the front of the car and into the driver seat.\n          \n          There's a moment of hesitation as Jimmy and Judy seem to be\n          screaming at each other in the car, then...\n          \n          Jimmy slams on the gas and the car takes off into the\n          distance.\n          \n          The image on the TV cuts away and back to the Anchorman.\n          \n          INT. TV NEWS STUDIO (FOR VEGAS MOTEL TV) - NIGHT\n          \n          The Anchorman speaks to camera as...\n          \n          INT. LAS VEGAS - LAS VEGAS MOTEL ROOM - NIGHT\n          \n          Jimmy pans up to Judy, hoping to record a reaction. She's\n          locked on the TV, her hand over her mouth, frozen, not\n          knowing how to react.\n          \n          She turns and looks up at him.\n          \n                              JIMMY (O.C.)\n                    I didn't want us to be apart.\n          \n                                                                    86.\n          \n          \n          \n          Judy's starting to tear up. She's emotional, conflicted.\n          She can't believe he did that for her, but she's also just\n          come to the sober realization that he killed a cop in cold\n          blood for her.\n          \n                              JIMMY (O.C.)\n                    They know who we are now.\n                        (making light)\n                    Actually, we're famous now.\n          \n          Judy kind of half smiles. She hadn't thought of it, but\n          she's still trying to digest the images until...\n          \n                              JUDY\n                    That's the most romantic thing I've\n                    ever even heard of.\n          \n          A voice catches Judy's attention from the TV. It's an\n          ATTORNEY type at a press conference being held by Jimmy's\n          parents.\n          \n                              ATTORNEY (O.C.)\n                        (on TV)\n                    ...have a few words and then we'll\n                    be taking questions.\n          \n          Judy looks back at the TV.\n          \n                              JUDY\n                    Oh my God, that's my parents!   And\n                    your parents!\n          \n          Jimmy pans back and we see...\n          \n          EXT. COURTHOUSE - PODIUM PRESS CONF. (FOR VEAGS TV) - DAY\n          \n          Jimmy's Mom and Dad with a chiron at the bottom of frame.\n          They're at a podium with Judy's parents standing stoically in\n          the background. Jimmy's Mom starts reading a prepared\n          statement.\n          \n                              JIMMY'S MOM\n                        (on TV)\n                    We are very shocked about recent\n                    events. Our son has always been a\n                    dear sweet boy who is sometimes\n                    confused, but we want him to know\n                    that we love him very, very much\n                    and just want this whole thing to\n                    be over.\n          \n                              JIMMY (O.C.)\n                    Bitch.\n          \n                                                                   87.\n          \n          \n          \n                               JUDY (O.C.)\n                    Shhhh...\n          \n          Judy's Dad steps up to the microphone.   Despite the truth, he\n          sounds genuinely concerned.\n          \n                              JUDY'S DAD\n                    Jimmy if you're out there, we know\n                    you're scared, but you're only\n                    making it worse. Please bring Judy\n                    back to us. We really miss her\n                    terribly.\n          \n          Jim walks over to the TV and...\n          \n          INT. LAS VEGAS - LAS VEGAS MOTEL ROOM - NIGHT\n          \n          Jimmy proceeds to kick the living fuck out of the TV.   It\n          smashes against the wall and falls to the floor.\n          \n          END TV NEWS REPORT\n          \n          Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          INT. BUN BOY MOTEL ROOM - BATHROOM - DAY\n          \n          Jimmy is filming the both of them in the mirror. Judy stands\n          above him with noticeably different hair. She has obviously\n          given herself a homemade dye job, complete with blonde, black\n          and punk pink streaks.\n          \n          Judy has an electric clipper and is about to shave Jimmy's\n          head, who is sitting in a chair below her. She's really\n          getting off on this and chuckles as she starts to lower the\n          shaver to his head.\n          \n                              JIMMY\n                    Wait a second.\n          \n                               JUDY\n                    What?\n          \n                              JIMMY\n                    I just want to look at myself one\n                    last time with hair.\n          \n          Judy is smiling and can't wait to get started.\n          \n                              JUDY\n                    OK, that's enough.\n          \n                                                                  88.\n          \n          \n          \n          She starts in again.\n          \n                                 JIMMY\n                    Stop.\n          \n                              JUDY\n                    What's the matter?\n          \n                              JIMMY\n                    I'm not sure about this.\n          \n                                 JUDY\n                    Come on.     I changed mine.\n          \n                              JIMMY\n                    Yeah, but you look fucking great.\n          \n                              JUDY\n                    This was your idea Jimmy.\n          \n          Jimmy thinks.\n          \n                                 JIMMY\n                    Fuck it.     Let's do this thing.\n          \n          Judy starts the shaver back up and proceeds to shave Jimmy's\n          head. She starts right down the middle.\n          \n          Hair falls into Jimmy's face as Judy slides the buzzer from\n          front to back. Jimmy now has a reverse Mohawk. He laughs at\n          himself along with Judy.\n          \n                              JIMMY\n                    This is the look.\n          \n          Judy then shaves the entire top of Jimmy's head, giving him\n          the quintessential male pattern baldness look.\n          \n          He looks ridiculous.\n          \n                              JIMMY\n                        (joking)\n                    Let's just leave it like this.\n          \n          Judy laughs.\n          \n                              JUDY\n                    Don't be stupid.\n          \n          Judy shaves the rest of his head and now Jimmy is completely\n          bald.\n          \n          Jimmy checks himself out in the mirror.\n          \n                                                                   89.\n          \n          \n          \n                              JIMMY\n                    I am one ugly mother fucker.\n          \n          Judy is stroking the top of his head with her hands.\n          \n                              JUDY\n                    It feels funny.\n          \n          Jimmy gives it a feel for himself.   He sticks his pinky in\n          the side of his mouth.\n          \n                              JIMMY\n                    I look like Dr. Evil.\n          \n          Judy laughs, then kisses the top of Jimmy's head.\n          \n                              JIMMY\n                    Come on. Let's go across the\n                    street and get a shit burger.\n          \n          Jimmy shuts down the camera.\n          \n                                                          CAMERA ON:\n          \n          I/E. BUN BOY - DINER/PARKING LOT/DINKO'S CAR - HIGHWAY - DAY\n          \n          In a booth at the motel diner, Judy is filming Jimmy while he\n          stuffs a burger into his face.\n          \n                              JUDY (O.C.)\n                    You're such a fucking pig when you\n                    eat.\n          \n          Jimmy opens his mouth full of food and comes towards camera.\n          \n                              JIMMY\n                    Aaaaaaaaaahhh!\n          \n                              JUDY (O.C.)\n                    Gross. That's it. I'm not taking\n                    you to the country club, ever!\n          \n          That didn't quite sit right with him, but he covers it up\n          with a mock pout while he chews.\n          \n                              JUDY (O.C.)\n                        (mocking)\n                    Awww... I'm sorry. Did I hurt your\n                    feelings?\n          \n          Jimmy won't respond, playful.\n          \n                                                                    90.\n          \n          \n          \n                               JUDY (O.C.)\n                    I'll take you to the country club.\n                    I promise.\n          \n          Jimmy looks up smiling.\n          \n                                 JIMMY\n                    When?\n          \n                              JUDY (O.C.)\n                    I don't know.\n          \n          Judy pauses.   Jimmy keeps chewing.\n          \n                              JUDY (O.C.)\n                    Thanks for marrying me. You're my\n                    prince charming that came and\n                    swooped me off me feet.\n          \n          The irony is thick. Bald, lanky, 21 year old Jimmy with a\n          mouth full of food looks like anything but Prince Charming.\n          \n                              JUDY (O.C.)\n                    And one day, we're gonna have a\n                    house and a white picket fence and\n                    a baby. Tell me what you think we\n                    should name the baby.\n          \n          Jimmy stops smiling.    She really believes that's going to\n          happen one day.\n          \n                              JUDY (O.C.)\n                    What's wrong?\n          \n          Jimmy doesn't want to answer.    While he thinks...\n          \n          Something out the window distracts him.\n          \n                                 JUDY (O.C.)\n                    What?\n          \n                              JIMMY\n                    Shhhh. Shut up.\n                        (grabbing camera)\n                    Give it to me.\n          \n          Jimmy whips the camera around to zoom in on what he's looking\n          through the window. Finally, we see...\n          \n          Two Florence County Sheriff's Cars with their lights flashing\n          are parked in the parking lot of the cheap motel.\n          \n          Jimmy zooms in on the cops as they get out of their cars.\n          \n                                                                     91.\n          \n          \n          \n                              JUDY (O.C.)\n                    What are they doing?\n          \n                              JIMMY (O.C.)\n                    Shhh.\n          \n          The cops walk up to one of the doors to the motel room.\n          \n                              JIMMY (O.C.)\n                    Shit.\n          \n          Four Florence Deputies stand outside the motel room door,\n          ready to bust it in and raid the room.\n          \n                              JUDY (O.C.)\n                    What?\n          \n          Jimmy speaks in hushed tones so that others in the diner\n          won't hear them.\n          \n                              JIMMY (O.C.)\n                    They're outside our room.\n          \n                              JUDY (O.C.)\n                    Oh God, Jimmy! They know where we\n                    are. We're going to get caught!\n          \n          Florence Deputy #1 knocks on the door, waits a beat, then\n          busts it down. Three Florence Deputies move in with their\n          guns drawn.\n          \n                              JUDY (O.C.)\n                    Jimmy!\n          \n                              JIMMY (O.C.)\n                        (to self)\n                    Let's go.\n          \n          Jimmy forgets to shut the camera down. He holds it by his\n          waist as the two quickly struggle to get the hell out of the\n          diner.\n          \n          Follow along with them, camera by Jimmy's side, mostly\n          pointing randomly at the floor of the diner or out the\n          window.\n          \n          They head out the door to the...\n          \n          PARKING LOT\n          \n          Action continues, the camera still rolling without Jimmy\n          realizing it. They run at a fast clip along the parking lot\n          as they head toward...\n          \n                                                                    92.\n          \n          \n          \n          DINKO'S CAR\n          \n                                JIMMY (O.C.)\n                    Get in.\n          \n           Jimmy slides into   the driver seat and throws the camera onto\n          the dashboard. We    see Jimmy behind the wheel as they drive\n          out of the parking   lot. He's in freak-out mode, afraid as\n          hell they're going   to be caught by the cops.\n          \n                              JUDY (O.C.)\n                    They don't see us.\n          \n                                JIMMY\n                    I know.    Just shut up!   Let me\n                    think.\n          \n          Jimmy keeps driving, his eyes darting back and forth between\n          the road, the rear view mirror and Judy.\n          \n                              JIMMY\n                    Are they coming?\n          \n                              JUDY (O.C.)\n                    I don't know. I don't think so.\n          \n          Jimmy looks back up into the rear view mirror, still not 100%\n          satisfied that they're not being chased.\n          \n                               JUDY (O.C.)\n                    No.   I don't think they're coming.\n          \n          Jimmy's still not certain. He looks for a while. Then he\n          sighs. It seems that he knows they're not coming.\n          \n                              JIMMY\n                        (relief)\n                    Oh, fuck.\n                        (to Judy)\n                    That was close.\n          \n          Jimmy drives for a bit, then notices that the camera is on\n          and pointing at him. He reaches forward and...\n          \n          Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          I/E. PARKING AREA BY RIVER AFTER BUN BOY ESCAPE/DINKO'S CAR -\n          DAY\n          \n          Jimmy films Judy, who is sleeping in the front seat of the\n          car.\n          \n                                                                      93.\n          \n          \n          \n          Jimmy gently wakes her.\n          \n                              JIMMY (O.C.)\n                    Hey baby, wake up baby. Time to\n                    get up little fuck nugget.\n          \n          Judy opens her eyes.    The first thing she sees is Jimmy\n          filming her.\n          \n          Judy smiles like an infant who sees her daddy for the first\n          time after a night's sleep. Judy, very childlike, opens her\n          arms for Jimmy to hug her.\n          \n          Jimmy leans over, camera in hand, and gives her a hug. The\n          camera shakes and goes out of focus as he's hugging her.\n          \n                              JIMMY (O.C.)\n                    Good morning Mrs. Wright. And how\n                    are we feeling this afternoon?\n          \n          Judy looks around and is a bit disoriented.\n          \n                              JUDY\n                    Where are we?\n          \n                              JIMMY (O.C.)\n                    It's a surprise. Come on. I want\n                    you to drive us in. I want to film\n                    you when we get there.\n          \n                              JUDY\n                        (big smile)\n                    Okay.\n          \n          Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          I/E. RODNEY'S WUNDERLAND - BACKROAD ENTRY/PARKING\n          AREA/DINKO'S CAR - DAY\n          \n          Judy drives up a gravel road as Jimmy films.    They travel\n          through the back roads in Northern Kentucky.    It's nothing\n          but woods outside the window.\n          \n                              JUDY\n                    What am I gonna see?\n          \n          Jimmy doesn't answer.\n          \n                              JUDY\n                    I hate it when you do that.    Tell\n                    me!\n          \n                                                                    94.\n          \n          \n          \n                                JIMMY (O.C.)\n                    Nope.    Keep looking.\n          \n          Judy drives some more.    The camera is bouncing as they drive\n          across dirt roads.\n          \n          Judy tries to maintain her composure, but she can't contain\n          herself.\n          \n                              JUDY\n                    How much further!    Aaa!\n          \n                                JIMMY (O.C.)\n                    Shhh.    Just drive.\n          \n          Judy bites her lip and drives.    Slowly, she comes around a\n          bend as they arrive at...\n          \n          UNCLE RODNEY'S WUNDERLAND/PARKING AREA\n          \n          Judy's eyes go wide.\n          \n                                 JUDY\n                    Oh my God.     Is that it?\n          \n          Jimmy doesn't say anything. He just keeps the camera trained\n          on Judy. By the look on her face, what she's seeing looks\n          pretty cool.\n          \n                              JUDY\n                    Is this where your friend lives?\n          \n          Jimmy points the camera through the front windshield. Now we\n          see what Judy was seeing... about thirty trailers, all along\n          the water's edge.\n          \n          It looks like a commune for run-away teenagers with crank\n          addictions and budding/wannabe drug dealers. The kids are\n          throwing a combination party, barbecue, and drug festival.\n          \n                              JIMMY (O.C.)\n                    This is where we live.\n          \n                                 JUDY\n                    We do?\n          \n                              JIMMY (O.C.)\n                    Maybe. If you want to.       For a\n                    little while.\n          \n          Judy doesn't respond. She just drives. Her eyes are\n          starting to well up a little bit. She's getting emotional.\n          \n                                                                      95.\n          \n          \n          \n                              JUDY\n                    This is sooo amazing.       It's like a\n                    dream.\n          \n          Judy's on cloud nine.    The place has exceeded her\n          expectations.\n          \n          Judy keeps driving as we see young people, all more or less\n          the same age as Jimmy and Judy. Some live in trailers, some\n          in tents. They watch as Jimmy and Judy drive in. Clearly\n          new faces are of interest to them.\n          \n                              JIMMY (O.C.)\n                    Go over here.\n          \n          Out the window, they approach another trailer.      Clearly this\n          trailer is more important than the others.\n          \n          Outside, a dorky looking douche bag type, BUDDY (20's) talks\n          to some of the Younger People in intense language. They all\n          look over to see Jimmy and Judy approaching.\n          \n                                 JIMMY (O.C.)\n                    Stop here.\n          \n          You can hear the excitement in Jimmy's voice as Judy stops\n          the car.\n          \n                                 JIMMY (O.C.)\n                    Take it.\n          \n          Jimmy hands off the camera to Judy, who retrains it on the\n          Buddy and the Wunderland Teenagers he talks to.\n          \n          Jimmy gets out of Dinko's car and heads up to him while Judy\n          films. We don't hear the conversation between Jimmy and\n          Buddy man, but clearly he's happy to see Jimmy.\n          \n          Buddy gives Jimmy a big hug like he was a missed relative or\n          an old friend. It's all smiles between the two of them.\n          \n          Jimmy comes running back over to the car.\n          \n                              JUDY (O.C.)\n                    Is that Uncle Rodney?\n          \n                              JIMMY\n                    No, that's Buddy. He said Rodney's\n                    been expecting us. We're, like,\n                    celebrities or something Judy.\n          \n                                 JUDY (O.C.)\n                    Really?\n          \n                                                                     96.\n          \n          \n          \n                               JIMMY\n                    Yeah!   He wants to meet you.\n          \n                               JUDY\n                    Wow.\n          \n          Camera shakes as Judy starts out of the car.    Camera shuts\n          down.\n          \n                                                           CAMERA ON:\n          \n          EXT. RODNEY'S WUNDERLAND - OUTSIDE RODNEY'S TRAILER - DAY\n          \n          Buddy is standing outside of a Piece Of Shit Trailer. He's\n          the douche bag type that we saw from a distance give Jimmy a\n          hug in the previous scene.\n          \n          He's surprisingly charismatic and gracious and does his best\n          to make Jimmy and Judy feel at home.\n          \n          Jimmy films as Buddy gives them a walking tour of the group\n          of trailers by the river. Judy's with them as well.\n          \n                              BUDDY\n                    We got like thirty five trailers\n                    here. Long as we've got some\n                    that's empty you can stay in one.\n                    Sometimes people come in and we got\n                    get you a tent or-- fuck,\n                    everybody's friendly--- you can\n                    always find a bed to crash in.\n          \n          Jimmy's panning around the landscape. People are watching\n          them walk with Buddy. It's almost as if they've got some\n          kind of celebrity status because they're with him.\n          \n                              BUDDY\n                    It don't look like much but we do\n                    some pretty good partying around\n                    here. Ya'll are welcome to stay as\n                    long as ya like. Fuck it, you can\n                    stay forever. There's only two\n                    rules. Don't mess around with the\n                    labs which are down back there...\n          \n          Jimmy's panning again, but BUDDY grabs hold of the lens.\n          \n                              BUDDY\n                    Woah... No filming that shit.\n                    Seriously. That's part of rule\n                    number one.\n                              (MORE)\n          \n                                                                  97.\n          \n                              BUDDY (cont'd)\n                    Don't even go near there with the\n                    camera, and two is no cops, but\n                    fuck, seeing what kinda shit you\n                    guys got into, I don't think we\n                    gotta worry about you calling 'em\n                    up for a visit.\n          \n          BUDDY laughs at his own joke.\n          \n                              BUDDY\n                    Other than that, ya'll can do\n                    whatever the hell you want,\n                    whenever the hell you want. You\n                    wanna do some of the stash at the\n                    parties, that's cool too. We'd\n                    like it if you do it, normally we'd\n                    say you gotta sell some too, but\n                    Rodney says y'all's is a special\n                    case 'cuz you ain't leaving 'til\n                    the heat's off for sure, that could\n                    be months or... shit, years for you\n                    guys. But no one up here's in a\n                    fucking hurry.\n          \n          Jimmy pans around capturing the natural beauty and\n          picturesque scenery of the camp.\n          \n                              BUDDY\n                    Look at you. Little bitch from the\n                    nut house, and you got yourself one\n                    sweet looking bride! I still can't\n                    get over the tits on this girl.\n                        (to Judy)\n                    Come here sweetheart.\n          \n          Jimmy pans back and catches an image of Buddy as he grabs\n          Judy and puts his arm around her.\n          \n                              BUDDY\n                    We're gonna have a party for y'all\n                    tonight. You know that? We have\n                    parties damn near every night, but\n                    this one's gonna be special just\n                    for you guys.\n                        (to Judy)\n                    You like that sweety?\n          \n          Buddy's squeezing Judy just a bit too tight.\n          \n                              JUDY\n                    Sure Buddy.\n          \n                                                                    98.\n          \n          \n          \n                              BUDDY\n                        (to Jimmy)\n                    Nice piece of ass you got here.\n                    Best you keep an eye on it so it\n                    don't wander off on ya.\n          \n          They've arrived at a trailer.\n          \n                              BUDDY\n                    We're here!\n          \n          Jimmy pans back up at the trailer that's going to be theirs.\n          From the outside, it's a disaster, peeling paint and cracked\n          windows.\n          \n          Buddy gets in front of the camera, reaching for it.\n          \n                              BUDDY\n                    Shit! Y'all's on your honeymoon.\n                    Ain't gonna film it yourselves.\n          \n          Buddy pulls the camera from Jimmy's hand and points it at\n          Jimmy and Judy. Judy waves. Jimmy looks a bit uncomfortable\n          though he tries not to show it.\n          \n                              BUDDY (O.C.)\n                    That's nice.\n          \n          Shaky amateur camera style as Buddy zooms in on Judy's chest,\n          closing Jimmy out of frame.\n          \n                              JIMMY (O.C.)\n                    Let's go inside.\n          \n          Judy turns.\n          \n                              BUDDY (O.C.)\n                        (shouting)\n                    Hold on! Hold on!\n          \n          Camera shuts down.\n          \n                                                         CAMERA ON:\n          \n          INT. RODNEY'S WUNDERLAND - JIMMY & JUDY'S TRAILER - DAY\n          \n          Buddy films from the inside their completely destroyed\n          trailer. Jimmy stands at the entrance with Judy in his arms,\n          about to carry her over the threshold. They're waiting for\n          BUDDY's cue.\n          \n                              BUDDY (O.C.)\n                    And, three, two, one... Now!\n          \n                                                                   99.\n          \n          \n          \n          Jimmy walks in through the doorway with Judy in his arms.\n          \n          Buddy is exuberant.   He hums the bridal march, badly, as they\n          come in.\n          \n                              BUDDY (O.C.)\n                    All right! Look at the happy couple\n                    coming into their new home.\n                        (wedding march)\n                    Da, da, da, dum...\n          \n          Buddy looks down at the camera, right into the lens.\n          \n                              BUDDY\n                    How do you turn this thing off?\n          \n          After a beat, camera goes off.\n          \n          EXT. RODNEY'S WUNDERLAND - PARTY AND BARBECUE - SALLY'S SPOT -\n          DAY\n          \n          Jimmy is filming SALLY, a very sexy and very stoned 18 year\n          old girl wearing sunglasses and cowboy hat.\n          \n          She speaks with a heavy southern accent.\n          \n                              SALLY\n                    Just give your love to Uncle Rodney\n                    and you'll get it back ten times.\n                    Don't be afraid to love him and\n                    you'll learn to love yourself in\n                    return. He'll teach you the cycle,\n                    how we're all connected. If you\n                    give yourself freely and completely\n                    to him, you'll have nothing to\n                    worry about. That's what I did.\n          \n          Camera shuts down.\n          \n                                                          CAMERA ON:\n          \n          EXT. RODNEY'S WUNDERLAND - PARTY AND BARBECUE - SAM'S SPOT -\n          DAY\n          \n          Jimmy is filming Random Teens at a barbecue. Jimmy is\n          interviewing SAM, a long greasy haired, nineteen year old\n          wearing a heavy metal T-shirt. We see people partying and\n          hanging out in the background.\n          \n          SAM is drinking beer from a can, smoking a cigarette, and\n          looks like he hasn't showered for a couple of days. He's\n          happy to be Jimmy's video subject.\n          \n                                                                     100.\n          \n          \n          \n          \n                              SAM\n                    Ya'll are going to love it here\n                    man. See this?\n          \n          Sam motions behind him at the people partying.\n          \n                              SAM\n                    This shit goes on every day. I\n                    been here for six months man and I\n                    love it. Thank God my parents\n                    kicked me out... All you got do is\n                    listen to Uncle Rodney and you'll\n                    have the best fucking time of your\n                    life. Oh, yeah.\n                        (big dopey grin)\n                    And don't fuck with him, 'cuz he'll\n                    kick your ass!\n          \n          Sam laughs at his own dumb joke.     Jimmy shuts off the camera.\n          \n                                                              CAMERA ON:\n          \n          EXT. RODNEY'S WUNDERLAND - DOE RUN CREEK - DAY\n          \n          Jimmy films a naked Judy swimming in the river the\n          reflections of the water obscuring her body. She's free,\n          cleansed, relaxed, enjoying the sun, and having the time of\n          her life. She suddenly notices the camera.\n          \n                              JUDY\n                    Jimmy, come swimming.      The water's\n                    warm.\n          \n                                JIMMY (O.C.)\n                    Is it?\n          \n          Judy smiles, then slips her head under the water, coming back\n          up with a smile. She looks up at him.\n          \n                                JUDY\n                    Come on.\n          \n                                JIMMY (O.C.)\n                    Later.    I just want to look at you\n                    now.\n          \n                                JUDY\n                    Why?\n          \n          Jimmy thinks.    She smiles an oh so sweet smile.\n          \n                                                                 101.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Because you look happy, happier\n                    than you've looked in a long time.\n          \n          Judy smiles even wider. She floats towards camera while\n          Jimmy zooms in on her smiling face.\n          \n          As she comes closer...\n          \n          SHE SPLASHES towards the camera, trying to get Jimmy wet.\n          \n          Camera shakes as Jimmy hops up to avoid be splashed.\n          \n                                 JIMMY (O.C.)\n                    Hey!\n          \n          Judy LAUGHS.   Camera goes off.\n          \n                                                         CAMERA ON:\n          \n          INT. RODNEY'S WUNDERLAND - JIMMY & JUDY'S TRAILER - NIGHT\n          \n          Faint moonlight comes into the trailer from outside. Jimmy\n          is filming Judy as she's just gotten into bed. She sees the\n          camera's on.\n          \n                                 JUDY\n                    Hey again.\n          \n                              JIMMY (O.C.)\n                    So you like it here?\n          \n          Judy smiles again.   Then...\n          \n                              JUDY\n                    How long will they let us stay?\n          \n                              JIMMY (O.C.)\n                    It's up to Uncle Rodney.\n          \n          Judy smiles at the thought of Rodney.\n          \n                              JUDY\n                    What's he like?\n          \n                              JIMMY (O.C.)\n                    I never met him. He's supposed to\n                    be cool, though... and weird.\n                    Weird as hell.\n          \n                              JUDY\n                    Well if he's weird, he's great\n                    weird, whatever he is.\n                              (MORE)\n          \n                                                                  102.\n          \n                              JUDY (cont'd)\n                    If we could stay here forever, like\n                    Buddy said, I wouldn't need\n                    anything else.\n          \n          Judy's looking right over the lens into Jimmy's eyes.\n          Then...\n          \n                              JUDY\n                    The cops won't come will they?\n          \n                              JIMMY (O.C.)\n                    Buddy said Rodney's cousin's the\n                    Sheriff or something. Do you want\n                    to meet him?\n          \n                              JUDY\n                        (surprised)\n                    The Sheriff?\n          \n                               JIMMY (O.C.)\n                    No!   Rodney.\n          \n                              JUDY\n                        (lights up)\n                    Can I?\n          \n                              JIMMY (O.C.)\n                    I'm gonna see him tomorrow. Buddy\n                    says he wants to talk to me. Maybe\n                    he wants to talk to you too.\n          \n                                 JUDY\n                    He does?\n          \n                              JIMMY (O.C.)\n                    I don't know. Buddy said he\n                    thought you were pretty.\n          \n                                 JUDY\n                    Oh my God!\n          \n          Judy puts her hand over her mouth.   She can't believe it.\n          \n                              JIMMY (O.C.)\n                    I told you you were. You're the\n                    prettiest girl in the world.\n          \n          Judy's on such a cloud nine high, she's almost in tears. She\n          wraps her arms around him and SQUEALS with delight, pushing\n          the camera into an awkward position as she smothers him with\n          kisses, then squeezes him tight, like she's going to squeeze\n          the life out of him.\n          \n          She whispers in his ear.\n          \n                                                                 103.\n          \n          \n          \n                              JUDY\n                        (whispers)\n                    I love you Jimmy.\n          \n                                JIMMY\n                    Me too.\n          \n          Camera off.\n          \n                                                          CAMERA ON:\n          \n          EXT. RODNEY'S WUNDERLAND - OUTSIDE RODNEY'S TRAILER - DAY\n          \n          Head to toe shot on Jimmy. Buddy, we'll find out in a\n          second, is behind the camera. Jimmy looks at a trailer off\n          screen. He's excited, a little off center and a little\n          nervous.\n          \n          Buddy tries to film Jimmy as he's walking towards Rodney's\n          trailer.\n          \n                              BUDDY (O.C.)\n                    You nervous?\n          \n                                JIMMY\n                          (lying)\n                    No.\n          \n                              BUDDY (O.C.)\n                    I would be.\n          \n                              JIMMY\n                    He's suppose to be cool.\n          \n                              BUDDY (O.C.)\n                    He's more than cool man. God, you\n                    really don't have a clue do you?\n          \n          Jimmy stops for a second.\n          \n                              JIMMY\n                    Um... Judy wants to meet him.   I\n                    don't know if I can ask.\n          \n                              BUDDY (O.C.)\n                    Shit man. Don't have to. She's\n                    one of his girls, man. She'll meet\n                    him.\n          \n          Jimmy stops in his tracks and looks at Buddy.\n          \n                              JIMMY\n                    What the fuck does that mean?\n          \n                                                                    104.\n          \n          \n          \n                              BUDDY (O.C.)\n                    Relax dude... Just like you're one\n                    of his boys. Shit man, I'll give\n                    you two weeks and you'll WANT her\n                    to experience him. You may even\n                    want to, too.\n          \n          Jimmy looks at Buddy, not quite sure what to do with any of\n          it. Buddy senses the tension.\n          \n                              BUDDY (O.C.)\n                    Just go see him. Here, take your\n                    camera.\n          \n          Buddy extends the camera, lens forward.   We can see Jimmy's\n          puzzled look.\n          \n                              BUDDY (O.C.)\n                    He wants you to film him, man.\n                    With the camera. He'll tell you\n                    when to turn it on, then you video.\n          \n          Jimmy's puzzled, but he reaches forward and takes the camera,\n          shutting it down.\n          \n                                                          CAMERA ON:\n          \n          INT. RODNEY'S WUNDERLAND - UNCLE RODNEY'S TRAILER - DAY\n          \n          Images of UNCLE RODNEY (50) going in and out of focus as he\n          sits on the side of a king sized bed. Scars and tatoos\n          litter his arms and neck. His eyes are bit maniacal like\n          Charles Manson, but he's able to maintain a stoic, but\n          nonetheless dangerous demeanor as Jimmy begins setting up the\n          camera.\n          \n          Like a prison inmate or rabid dog, you get the feeling that\n          Uncle Rodney could EXPLODE on you at any second.\n          \n          Jimmy moves the camera around the room so we briefly see the\n          interior of the trailer. It's an ELABORATE triple\n          combination of a middle eastern harem, sixties psychedelic\n          motif, and white trash/junk-yard memorabilia.\n          \n          JUST OUT OF FRAME we hear a female voice crying softly,\n          whimpering. The voice is close, in the room with us, but we\n          can't see who's making the sounds. Uncle Rodney ignores it\n          completely.\n          \n          Camera shakes, indicating that Jimmy is exceptionally\n          nervous.\n          \n                                                                 105.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Just one second.\n          \n                              UNCLE RODNEY\n                    Take your time man. I want you to\n                    feel comfortable. More\n                    importantly, I want you to get this\n                    right.\n          \n          Finally, the camera stops shaking. Jimmy zooms out to a\n          medium shot revealing that Uncle Rodney has HAZEL lying next\n          to him on the bed with her head on his lap.\n          \n          Uncle Rodney gently strokes her hair like he's petting a dog.\n          Hazel, in the midst of EXTREME withdrawals, cries and\n          whimpers like a child, oblivious to Jimmy, the camera, and\n          everything else in the world except for Uncle Rodney.\n          \n          She is so strung out and her cravings are so intense that she\n          can barely speak.\n          \n                              JIMMY (O.C.)\n                    I'm ready whenever you are.\n          \n          Uncle Rodney looks down upon Hazel.\n          \n                              UNCLE RODNEY\n                    Just a second. I have to take care\n                    of my baby.\n          \n          Uncle Rodney admires his work.\n          \n                              UNCLE RODNEY\n                    She's beautiful isn't she?\n          \n                              HAZEL\n                        (begging, pleading)\n                    Please...\n          \n          Hazel, entrenched in a crystal methamphetamine psychotic\n          episode, can only gasp in unintelligible spurts.\n          \n                              UNCLE RODNEY\n                    Some people come here too far gone.\n                    Like Hazel here. The only thing I\n                    can do for her is ease her pain.\n          \n          Hazel rolls her body back and forth on the bed, all the while\n          keeping her head in Uncle Rodney's lap.\n          \n                                HAZEL\n                    Please...\n          \n                                                                  106.\n          \n          \n          \n                              UNCLE RODNEY\n                        (to Hazel)\n                    Shhhhh... How about a baby one?\n          \n          Uncle Rodney's tenderness in dealing with Hazel calms her.\n          He's having way too much fun treating her like a baby.\n          \n                              HAZEL\n                    Yes.\n          \n          Uncle Rodney takes his pinky and dips it into a small plastic\n          bag of powder. He then places it to Hazel's nostril.\n          \n          She quickly snorts the tiny bit off his finger.\n          \n                              UNCLE RODNEY\n                        (to Hazel)\n                    There you go...\n          \n          Hazel begins whimpering again.   It wasn't nearly enough to\n          satisfy her.\n          \n                              UNCLE RODNEY\n                    There's something about addiction\n                    that brings out something beautiful\n                    in a person. Addiction is pure.\n                    Addiction reduces a person to an\n                    infant. And there's nothing more\n                    pure and beautiful in the world\n                    than an infant.\n          \n          He puts his finger to Hazel's nostril again, but this time,\n          without any meth on the tip. She snorts with all of her\n          might then starts crying. Uncle Rodney is toying with her.\n          \n                              UNCLE RODNEY\n                    Hazel is no longer an adult. She's\n                    an infant and I'm the surrogate\n                    mother who provides her with much\n                    needed breast milk. It's a role\n                    that both of us have accepted and\n                    embrace.\n          \n          He leans over and grabs a syringe, already filled, then\n          gently holds Hazel's arm and expertly injects the liquid into\n          her vein.\n          \n          Nothing happens for several seconds.\n          \n          Hazel's breathing accelerates. Suddenly she sits up, her\n          eyes go wide. Hazel clinches the bed as if she were riding a\n          roller coaster.\n          \n                                                                    107.\n          \n          \n          \n                              UNCLE RODNEY\n                        (proudly)\n                    That's my girl!\n          \n          Then, she makes eye contact with Jimmy.\n          \n          A curious, frightened look comes over her face.   Clearly, she\n          recognizes him.\n          \n          She suddenly JUMPS from the bed and runs out of the room.\n          \n                              UNCLE RODNEY\n                    She's a little jumpy.\n          \n          Uncle Rodney smiles, amusing himself with his own joke.\n          \n                              UNCLE RODNEY\n                    Let's begin shall we? And\n                    please... I'm going to use this\n                    tape for my fans, so let's try to\n                    get this right.\n          \n                              JIMMY (O.C.)\n                    OK.\n          \n                              UNCLE RODNEY\n                    I apologize if any of this\n                    frightens you or makes you\n                    uncomfortable.\n          \n                              JIMMY (O.C.)\n                    I'll be fine.\n          \n                              UNCLE RODNEY\n                    No. You won't be fine. What I'm\n                    going to teach you will be\n                    frightening. The truth is an\n                    acquired taste but once you get to\n                    it, it's all you'll ever want.\n          \n          Uncle Rodney starts in on his mantra.   It's obvious that he's\n          well versed in his meandering rant.\n          \n                               UNCLE RODNEY\n                    Those kids out there... we, the so\n                    called \"undesirables\" - you and me,\n                    we know the truth. You know that\n                    society doesn't want you, your\n                    parents don't want you, corporate\n                    America sure as fuck doesn't want\n                    you... You wouldn't be here\n                    otherwise.\n                               (MORE)\n          \n                                                          108.\n          \n                              UNCLE RODNEY (cont'd)\n                    If this government had a choice,\n                    they'd gas us all in a heartbeat,\n                    exterminate us like the Jews,\n                    enslave us like niggers, cuz don't\n                    kid yourself, WE ARE the new\n                    niggers in this country. No one\n                    respects us... No one sees what we\n                    have to offer... No one has\n                    compassion for us.... They don't\n                    care, or they're too naive to see\n                    that we're a by-product of a\n                    wasteful society that has failed to\n                    educate, embrace, influence, or\n                    inspire any of us. We're societal\n                    garbage. The counter culture no\n                    longer exists. It's dead... It's\n                    been replaced by us--\n          \n          Long pause.\n          \n                              UNCLE RODNEY\n                    The garbage culture... thrown\n                    aside, imprisoned,\n                    institutionalized, systematically\n                    abused, executed, and enlisted into\n                    wars started by government ass-\n                    fuckers just to kill us off. JUST\n                    TO KILL US OFF. And every week one\n                    of you shows up here,\n                    disillusioned, addicted, angry,\n                    pissed 'cuz they tossed you\n                    aside... into the garbage. Every\n                    time someone like you shows up here\n                    the garbage culture gets a little\n                    bit stronger and they get a little\n                    bit weaker. Until the \"them\" and\n                    the \"they\" of this country run out\n                    of places to put us, to put its\n                    garbage, and the garbage OVER-FLOWS\n                    into their cities from out of the\n                    confines of the spaces that they\n                    have set aside for us.\n          \n          A pause, then...\n          \n                              UNCLE RODNEY\n                        (biblical)\n                    And we will SET FIRE to their\n                    world! And we will burn it, until\n                    a living HELL REIGNS over what was\n                    their former world, and we will\n                    fornicate in their ashes!\n          \n          Rodney stops, almost out of breath.\n          \n                                                                   109.\n          \n          \n          \n                               UNCLE RODNEY\n                     That's what's here for you.   That's\n                     what's here...\n          \n          Rodney settles himself down and takes a few deep breaths as\n          Jimmy begins zooming out. Uncle Rodney lights a cigarette to\n          calm himself.\n          \n          Jimmy keeps filming, not knowing whether Rodney is finished\n          or just taking a break.\n          \n          Camera shuts down.\n          \n                                                            CAMERA ON:\n          \n          EXT. RODNEY'S WUNDERLAND - FIRE PIT - NIGHT\n          \n          Someone (Buddy) is filming a raging party consisting of a lot\n          of strung out young white trash junkies just like the ones\n          Jimmy was interviewing before. It's certainly a weird bunch.\n          They all look alike, dress similar, and have the same type of\n          crystal methamphetamine induced facial expressions.\n          \n          Most of them are smoking weed and drinking forty ounce beers\n          while dancing around a campfire and playing the bongo drums.\n          They all seem to be having more fun than anyone should be\n          allowed.\n          \n          Camera pans to Jimmy, so we realize that he's not filming.\n          Our best guess would be that it's Buddy who's filming. Jimmy\n          screams at the camera over the noise of the Bongo drums.\n          \n                               JIMMY\n                     Where's Judy?\n          \n          Buddy's hand comes into frame as he points by the fire pit.\n          We now see Jimmy see Judy.\n          \n          She dances fervently drinking a forty surrounded by tons of\n          other drunk, happily intoxicated teenagers. Say what you\n          might about the attendees to the event, this party is a\n          FUCKING RAGER and Judy is happy to be the center of\n          everyone's attention.\n          \n          Everyone dances faster and faster as the rhythm of drums beat\n          faster and become more intense. It's an all out jam session.\n          \n          Jimmy heads to the center of the circle of people dancing\n          around Judy. Camera follows him with a zoom as he does.\n          \n          JUMP CUT\n          \n                                                                    110.\n          \n          \n          \n          Who knows how much later. Minutes or hours, the party rages\n          forward. The camera spins around. The party has reached a\n          new level of drunken absurdity. Most of those who are\n          dancing are drunk, stoned or both.\n          \n          In the background, while it's too dark and hectic see\n          anything explicit, some of the teenagers are engaged in a\n          variety of sexual activity. Some have threesomes. Some are\n          probably having oral sex. Still others dance around them in\n          the foreground.\n          \n          Camera zooms in on Uncle Rodney.\n          \n          Standing just behind him, we see of flash of someone\n          recognizable. It's a skinny woman, she looks vaguely\n          familiar, but it's hard to get a fix with all the craziness\n          going on.\n          \n          She turns her head to look over at Rodney.\n          \n          Now we can clearly see that this person is...\n          \n          HAZEL - with her eyes wide and clearly in the height of\n          rolling on crank.\n          \n          AND she's saying something to Uncle Rodney that's definitely\n          pissing him off.\n          \n          Bodies wipe the frame.\n          \n          JUMP CUT\n          \n          Moments later. Camera catches Judy who hasn't missed a step\n          along the way to being a high, drunken mess. The rhythm of\n          the drum beats is ever present.\n          \n          Uncle Rodney comes up behind her and wraps his arms around\n          her shoulder, saying something to her, but we can't hear it\n          over the noise. Jimmy approaches and they start talking.\n          \n          Jimmy doesn't notice, but there are about four or five of the\n          kids, especially a couple of Rodney's Bigger Guys standing\n          not too far behind Uncle Rodney watching the conversation\n          intensely.\n          \n          It's really difficult to put your finger on it exactly, but\n          something doesn't seem right here.\n          \n          Uncle Rodney lets go of Judy and puts his arm around Jimmy.\n          With the noise of the drums and the fact that we're zoomed in\n          from a distance, we can't hear anything they're saying.\n          \n                                                                 111.\n          \n          \n          \n          Now Uncle Rodney and Jimmy are having a conversation as they\n          move towards the camera. Though Jimmy can't see it, we can\n          see that Rodney's Bigger Guys, the ones that were standing\n          behind Uncle Rodney are now pushing Judy along behind Jimmy\n          and Rodney. Though Uncle Rodney seems to be having a very\n          light and friendly conversation with Jimmy, we continue to\n          get the feeling that something ominous is afoot.\n          \n          Finally, they approach camera and we can hear them.\n          \n                               UNCLE RODNEY\n                     I'm so glad you guys came down\n                     here. We never would have guessed\n                     you'd come and see us.\n          \n                               JIMMY\n                     You've been awesome.   Judy loves it\n                     here.\n          \n          Uncle Rodney's got Jimmy in an incredibly friendly one armed\n          side hug.\n          \n                               UNCLE RODNEY\n                     I knew she would. By the way.\n          \n          Rodney's face drops.\n          \n                               UNCLE RODNEY\n                     I know what you did to Dinko.\n          \n          This hits Jimmy like a lead weight. Before he can react at\n          all, and before he realizes that anything is happening, Jimmy\n          is suddenly thrown into a headlock by Uncle Rodney.\n          \n          Off camera, something similar is happening to Judy.\n          \n                               JUDY (O.C.)\n                         (screaming)\n                     What the fuck are you doing?!\n                     Jimmy, Jimmy!\n          \n          Judy screams his name over and over.\n          \n                                JUDY\n                     Jimmy!   Jimmy!\n          \n                               BUDDY (O.C.)\n                         (laughing)\n                     Shut it, bitch!\n          \n          SMACK!   Judy's been hit by Buddy off screen.\n          \n                                                                  112.\n          \n          \n          \n          Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          EXT. RODNEY'S WUNDERLAND - DARK WOODS - NIGHT\n          \n          We hear intense struggling and laughter. By the sounds we\n          hear, we gather that Jimmy and Judy are being dragged off\n          into the woods against their will by Buddy and Rodney's\n          Bigger Guys, but it's too dark to tell if that is what in\n          fact is happening.\n          \n          Someone unidentified is running the show and operates the\n          camera. It's impossible to see, but it's definitely Buddy's\n          voice.\n          \n                              BUDDY (O.C.)\n                    Here, here, here. Right here.\n          \n          Judy is screaming and crying.\n          \n                               JUDY (O.C.)\n                    Jimmy!\n          \n                               JIMMY (O.C.)\n                    Judy?\n          \n          Two or three guys, it's too dark to tell, start laughing.\n          \n                              JUDY (O.C.)\n                        (screams)\n                    Please somebody help us!\n          \n          Jimmy grunts, trying to break free.\n          \n                               JIMMY\n                    Judy!\n          \n                              RODNEY'S BIG GUY #1 (O.C.)\n                    Shut up, asshole! You wanna\n                    fucking talk!\n          \n          MUNCH. Somewhere in the darkness Jimmy's been kicked in the\n          gut. The camera hits the ground. It lands right in front of\n          Jimmy. We can still barely see what's going on, but we're\n          close enough and there's enough flashes of light from\n          flashlights to see that Jimmy is face down and bloody.\n          \n                              JIMMY\n                        (defiant)\n                    Fuck you!\n          \n                                                                  113.\n          \n          \n          \n          Jimmy gets kicked again just once. Then suddenly, a barrage\n          of kicks come at Jimmy one after the other after the other.\n          \n          Leaves and grass and dirt and flying feet shoot at Jimmy's\n          face as he is kicked and beaten repeatedly.\n          \n          The process goes on for about thirty excruciating seconds.\n          \n          We can't tell how much damage has been sustained, but Jimmy's\n          not moving. He's either unconscious or dead.\n          \n          With one last kick, the camera is knocked aside and we don't\n          see Jimmy's face anymore.\n          \n                              RODNEY'S BIG GUY #1 (O.C.)\n                    Is he fucking dead?\n          \n                               JUDY (O.C.)\n                    Jimmy!   Jimmy say something!\n          \n          They mock her in a high pitched wining voice.\n          \n                              BUDDY (O.C.)\n                        (mocking)\n                    Jimmy. Jimmy say something.\n          \n                              RODNEY'S BIG GUY #2 (O.C.)\n                    Get her clothes off.\n          \n                              JUDY (O.C.)\n                        (screaming)\n                    Noooooo! Noooooo!\n          \n          Judy screams at the top of her lungs over and over again as\n          we hear them tearing at her clothes. Then they pick her up\n          and start pulling her away from camera.\n          \n          Her screams get quieter and quieter... fainter and fainter.\n          \n                              JUDY (O.C.)\n                        (extremely faint)\n                    Jimmy!\n          \n          Finally there's silence. The camera isn't moving.    It's on\n          the ground and in the dark. Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          EXT. RODNEY'S WUNDERLAND - PARKING AREA - DINKO'S CAR - NIGHT\n          \n          It's completely pitch black dark. We can see nothing.    We\n          can only hear the sound of Jimmy fumbling around and\n          breathing heavily and nervously.\n          \n                                                                   114.\n          \n          \n          \n          BEGIN NITE SHOT\n          \n          Suddenly, we see everything, albeit in a weird black and\n          white grainy fashion. Jimmy's flipped the camera into Nite\n          Shot, using the fuzzy black and white mode as a tool to see\n          in the complete darkness. He's strapped the camera to his\n          wrist.\n          \n          The image is Jimmy's POV as he searches through his trunk for\n          something. Pulling aside a duffle bag, we see the 9mm pistol\n          that Jimmy stole from the Cop. He grabs it as camera shuts\n          down.\n          \n                                                         CAMERA ON:\n          \n          I/E. RODNEY'S WUNDERLAND - FIRE PIT/OUTSIDE RODNEY'S\n          TRAIER/INSIDE RODNEYS TRAILER/PARKING AREA/DINKO'S CAR -\n          NIGHT\n          \n          By the fire pit, the site where the teenage drunken of orgy\n          took place, the bonfire has been put out and there are dozens\n          of drunken/passed out teenagers lying on the ground in\n          sleeping bags and in tents.\n          \n          Jimmy begins looking for Judy with his night vision camera.\n          \n          He sees a girl lying on the ground in a sleeping bag   with her\n          back turned to the camera. Her hair is identical to    Judy's,\n          but we can't see her face. Jimmy quietly steps over    passed\n          out teenagers, being extremely careful not to awaken   anyone.\n          \n          Jimmy accidently kicks a forty ounce beer bottle that causes\n          a loud clanking sound of glass on glass.\n          \n          Jimmy stops in his tracks in anticipation of someone waking\n          up. No one does.\n          \n          Jimmy continues to walk towards the GIRL WHO LOOKS LIKE JUDY.\n          \n          Kneeling directly in front of her, Jimmy puts his hands on\n          her shoulder and pulls the girl's front region towards the\n          camera. The girl flips over.\n          \n          It's not Judy. And luckily, the girl is so severely\n          intoxicated that she doesn't wake up.\n          \n          Jimmy now makes his way over to a tent. He quietly unzips\n          the mesh entrance and extends his arm out to video tape the\n          inside. Turns out, the person in the tent is just another\n          passed out flunky loser. Jimmy quickly takes his arm out of\n          the tent.\n          \n                                                                    115.\n          \n          \n          \n          Jimmy gives it one last go and continues to look for Judy\n          among the sea of passed out bodies lying on the ground.\n          \n          No luck.\n          \n          Jimmy's not too far from Uncle Rodney's trailer.   He decides\n          to make his way up.\n          \n          He walks, using his Nite Shot to see, through the sea of\n          bodies until he gets up to the entrance...\n          \n          OUTSIDE RODNEY'S TRAILER\n          \n          There's a cracked glass door leaning up against the woodpile\n          by the entrance. Jimmy steps around it, turning the lens at\n          the glass. He briefly catches his reflection. He looks like\n          hell warmed over, freshly bruised and cut from the recent\n          beating.\n          \n          Moving forward, Jimmy makes it to the front door of Uncle\n          Rodney's trailer. We hear music coming from inside. Very\n          slowly and very carefully, Jimmy cracks the front door.\n          \n          INSIDE RODNEY'S TRAILER\n          \n          It's even darker inside of the trailer, but Jimmy presses\n          forward in spite of that fact, still using his Nite Shot to\n          see. A boom box sits by the bed, still on, playing music.\n          \n          Jimmy is scared shitless.\n          \n          In the corner of the room, in a make shift bunk, is Uncle\n          Rodney sleeping with his arms wrapped around a girl in a\n          spooning position. There's no doubt this time.\n          \n          It's definitely JUDY!\n          \n          They are both sound asleep and actually look very cozy lying\n          together. Jimmy slowly walks over towards them. Each step\n          is slower and slower, being extra careful not to wake them.\n          \n          Once Jimmy is within arm's length of the two of them he\n          stops. He hesitates for a moment. He hasn't prepared\n          himself for this particular situation and doesn't know\n          exactly what to do.\n          \n          He continues filming them until he finally musters the\n          courage to extend his non-filming arm out to tap Judy on the\n          face. Judy remains unconscious/sleeping as Jimmy gently taps\n          the side of her cheek. Jimmy slowly begins tapping harder\n          and harder until the tap evolves into a poke. Still nothing.\n          \n                                                                    116.\n          \n          \n          \n          THWACK! An arm comes out of nowhere and grabs Jimmy's poking\n          hand. Jimmy has woken up Uncle Rodney!\n          \n          The camera shakes out of control.   Uncle Rodney screams at\n          the top of his lungs:\n          \n                              UNCLE RODNEY\n                    Who the fuck...!\n          \n          Intense and furious wrestling ensues as Uncle Rodney flies\n          out of frame then, in a split second:\n          \n          BAM!\n          \n          A gunshot goes off. We hear a Uncle Rodney collapse,\n          followed by more gun shots. The camera has fallen from\n          Jimmy's hand and dangles by the wrist strap. Camera comes to\n          rest on...\n          \n          UNCLE RODNEY'S BLOODY FACE\n          \n          Jimmy's shot and killed him.\n          \n          Outside, footsteps hit the deck.    Buddy opens the door of the\n          trailer.\n          \n                              BUDDY\n                    Hey!\n          \n          BAM, BAM, BAM!\n          \n          Three more rounds are fired, hitting Buddy square in the\n          chest, knocking him down. Jimmy points the camera at a dead\n          Buddy on his back then whip pans it back to Judy in the bed.\n          Finally we hear Jimmy speak.\n          \n                              JIMMY (O.C.)\n                    Judy, Judy, wake up. Fucking wake\n                    up!\n          \n          Outside we hear voices of some of Rodney's Other Teens.\n          \n          Jimmy acts fast. Judy has been drugged and is mostly\n          unconscious and groggy, but Jimmy picks her up and gets her\n          on her feet, shouldering her out the door. Shot continues\n          to...\n          \n          OUTSIDE RODNEY'S TRAILER\n          \n          We hear faint voices...\n          \n                                                                   117.\n          \n          \n          \n                               RODNEY'S BIG GUY #3\n                         (faint)\n                     Hey! Hey!\n          \n          A DISTANT GUNSHOT FIRES, but we can't see what is going on.\n          It's too dark and the camera is too shaky as they go to...\n          \n          PARKING AREA\n          \n          Another DISTANT SHOT, then Jimmy gasps in pain. He's been\n          shot, but decides to run, trying to carry a groggy Judy\n          anyway. Their car is in sight as we hear guns going off and\n          bullets whizzing by them. One hits Dinko's car.\n          \n          Jimmy opens the door, then places the passed out Judy and the\n          camera in the passenger seat, climbs over her, throwing the\n          camera into Judy's lap.\n          \n          We see him scramble to get the key in the ignition as we hear\n          a BULLET HIT the driver's door. The car starts, and Jimmy\n          throws it into gear, flooring the gas as he speeds away.\n          \n                                JIMMY\n                     Judy?   Judy?\n          \n          Nothing.\n          \n                               JIMMY\n                     Judy wake up.\n          \n          Jimmy's voice begins to crack as he talks to/tries to wake up\n          Judy.\n          \n                               JIMMY (O.C.)\n                     Are you all right baby?   Please\n                     wake up Judy. Judy?\n          \n          We don't know if Judy is dead or alive.\n          \n          Jimmy swerves to avoid something in the road sending the\n          camera to the floor as camera shuts down.\n          \n                                                            CAMERA ON:\n          \n          INT. ROAD TO BORDER MOTEL - CHEAP MOTEL ROOM - DAY\n          \n          Close on Judy. The afternoon light strikes a shadow across\n          her face. Her hair's a mess. No makeup.\n          \n                               JIMMY (O.C.)\n                     Judy, sweetie. Come on honey.      I\n                     saw you waking up.\n          \n                                                                   118.\n          \n          \n          \n          Judy's eyes flutter.\n          \n                              JIMMY (O.C.)\n                    There ya go.\n          \n          Judy opens her eyes.    She smiles when she sees Jimmy behind\n          the lens.\n          \n                                 JUDY\n                    Hi, baby.\n          \n                                 JIMMY (O.C.)\n                    You okay?\n          \n                              JUDY\n                    Am I with you?\n          \n                              JIMMY (O.C.)\n                    You're with me.\n          \n          She smiles wider.\n          \n                              JUDY\n                    Then I'm okay.\n          \n          Camera shuts down.\n          \n                                                           CAMERA ON:\n          \n          I/E. HIGHWAY TO BORDER/DINKO'S CAR - NIGHT\n          \n          Judy's got the camera trained on herself.    She talks like a\n          child.\n          \n                              JUDY\n                    Mexicooooooh....\n          \n          Judy points the camera up at Jimmy. This is the first time\n          we've seen him at all since he was beaten up by Uncle\n          Rodney's group. He's a wreck. His face is puffy. His lip\n          is cut up. His eye is swollen. He looks like a flyweight\n          boxer who just went fifteen rounds with a heavyweight.\n          \n          He drives with one arm because the other one is in a bandage.\n          \n                                 JUDY (O.C.)\n                    Hey baby.\n          \n          Jimmy looks like a beaten man, both physically and\n          emotionally. His bad ass attitude and rebellious charisma\n          are seemingly non-existent.\n          \n                                                                 119.\n          \n          \n          \n          For the first time, we are seeing Jimmy without his armor.\n          He looks like any other 21 year old kid who is down,\n          vulnerable, and confused. Not to mention the fact that he\n          has a fucking bullet lodged in his shoulder.\n          \n                                 JUDY (O.C.)\n                    Baby?\n          \n                                 JIMMY\n                    Come on.     Not the camera.\n          \n                              JUDY (O.C.)\n                    Nooooo. It reminds me of when we\n                    first met. Just you, me, and the\n                    camera. God, do you remember how\n                    you used to freak me out?\n          \n                              JIMMY\n                    Yeah, those were the good old days.\n                    How much money do we have?\n          \n                              JUDY (O.C.)\n                    I don't know, why?\n          \n                              JIMMY\n                    How do you feel about Canada?   It's\n                    closer.\n          \n                              JUDY (O.C.)\n                    Are we going together?\n          \n          Jimmy looks over at her.\n          \n                              JIMMY\n                    I think I should take you home.\n          \n          Judy doesn't answer.\n          \n                              JIMMY\n                    I could write you a letter. Or I\n                    could make a video saying I made\n                    you do everything. They'd believe\n                    you. You could tell them it was\n                    all my fault. You could tell them\n                    I was going to Mexico and I'd\n                    really go to Canada.\n          \n          Jimmy swallows.\n          \n                              JIMMY\n                    We swore on the bond we'd never be\n                    apart... but...\n                              (MORE)\n          \n                                                                 120.\n          \n                              JIMMY (cont'd)\n                    I'll let you out of it... If you\n                    want to be out of it, I'll let you\n                    out.\n          \n                              JUDY (O.C.)\n                    You're never leaving me, and I'm\n                    never leaving you. That's all\n                    there is to it.\n          \n                               JIMMY\n                    Okay.\n          \n          Judy leans in and kisses him.\n          \n                               JIMMY\n                    Owww.\n          \n          Judy comes back into the passenger seat and just films him.\n          She likes looking at him through the lens.\n          \n                              JUDY (O.C.)\n                    You're so handsome, you know that?\n          \n          Jimmy smiles as best he can with his face all messed up.\n          Then his eyes get droopy and close.\n          \n          He's not responding. He's as punch drunk as you can get.\n          \n                               JUDY (O.C.)\n                    Jimmy?\n          \n          Jimmy's obviously in a concussion induced daze. The car\n          starts to drift. Judy drops the camera on the seat as we\n          hear her leap forward to take control of the car.\n          \n                               JUDY (O.C.)\n                    Jimmy!\n          \n                              JIMMY (O.C.)\n                        (snaps to)\n                    What?\n          \n                              JUDY (O.C.)\n                    Jimmy, stop the car. You're too\n                    fucked up to drive.\n          \n                              JIMMY (O.C.)\n                        (groggy)\n                    Huh? Oh... okay.\n          \n          Camera shuts down.\n          \n                                                         CAMERA ON:\n          \n                                                                121.\n          \n          \n          \n          I/E. HIGHWAY FINAL-SCENE/DINKO'S CAR - DAY\n          \n          Judy drives.   There isn't much talking going on.\n          \n                              JUDY\n                    You wanted to ask me something?\n          \n                              JIMMY (O.C.)\n                    Do you love me?\n          \n                              JUDY\n                    You know I do.\n          \n                                 JIMMY (O.C.)\n                    I do.\n          \n          The car drives. Judy just cruises along, music playing on\n          the radio. Jimmy (O.C.) looks in the mirror but keeps the\n          camera trained on her.\n          \n                              JIMMY (O.C.)\n                    You know I love you, right?\n          \n                                 JUDY\n                    Yup.\n          \n                                 JIMMY (O.C.)\n                    Judy?\n          \n                                 JUDY\n                    Yes?\n          \n                              JIMMY (O.C.)\n                    We're fucked.\n          \n                              JUDY\n                    What do you mean?\n          \n                              JIMMY (O.C.)\n                    Look in the rearview mirror.\n          \n          Judy looks up immediately.    Her face drops.\n          \n          Jimmy flips the camera around out the back window. There's a\n          Ohio State Trooper with its lights flashing tailing them. A\n          lone trooper is on his radio.\n          \n                              JIMMY (O.C.)\n                    That's it baby. We're done.\n          \n          Judy doesn't answer.    She's short circuited.\n          \n                                                                  122.\n          \n          \n          \n                              JIMMY (O.C.)\n                    Just pull over. It's not worth it.\n          \n          Judy holds still for a second, not saying a word.\n          \n          The cop car CHIRPS its siren.\n          \n          Judy looks up.\n          \n                               JIMMY (O.C.)\n                    Judy, what are you doing?      You know\n                    this is...\n          \n                              JUDY\n                    Don't do this.\n          \n          Judy looks up into the rearview mirror. Her eyes are welling\n          up. She looks out the front windshield.\n          \n          Jimmy senses that she sees something. He flips the camera\n          around through the front only to see a row of cop cars\n          blocking the highway up ahead.\n          \n          He flips the camera back at her.\n          \n                                    JIMMY (O.C.)\n                    Judy?\n          \n                              JUDY\n                        (freaks)\n                    Shut up!\n          \n          Judy looks straight ahead, determination on her face.\n          \n          She won't answer.    Then...\n          \n          She turns the wheel hard to the right, almost carrying Jimmy\n          into her, and takes the car onto a side road.\n          \n                              JIMMY (O.C.)\n                    I love you.\n          \n                              JUDY\n                    I love you too.\n          \n          Judy is on her own mission.\n          \n                                    JIMMY (O.C.)\n                    It's over.\n          \n                                    JUDY\n                           (soft)\n                    No.\n          \n                                                                   123.\n          \n          \n          \n                                 JIMMY (O.C.)\n                    It is.\n          \n                                 JUDY\n                    No.\n          \n          The car stops short. Jimmy turns the camera to point out the\n          windshield. They're stuck. The road has come to a dead end.\n          \n                              JIMMY (O.C.)\n                    It's a dead end.\n          \n          Judy ignores Jimmy. She throws the car into reverse and\n          tries to turn it around and head back the way she came.\n          \n          A faint sound of a helicopter fades up slowly from the\n          background.\n          \n                              JIMMY (O.C.)\n                    Do you hear that?\n          \n          Judy doesn't respond.    She's determined.\n          \n                                JUDY\n                          (lying)\n                    No.\n          \n                              JIMMY (O.C.)\n                    Come on, it's over. I'll do what I\n                    said before. I'll tell them I made\n                    you do it. It'll be okay.\n          \n                               JUDY\n                    No.   I want us to be together.\n          \n                               JIMMY (O.C.)\n                        (screams)\n                    Well we fucking can't, so pull the\n                    fuck over!\n          \n                              JUDY\n                    Yes we can. I won't give you up.\n                    I won't let you go. No way.\n          \n          Jimmy pans the camera out the front windshield. In the\n          distance, we catch sight of a road block that's been set up\n          at the end of the dirt trail. They're screwed. There's\n          nowhere to go.\n          \n                                 JIMMY (O.C.)\n                    Come on.\n          \n          Judy doesn't answer.\n          \n                                                                    124.\n          \n          \n          \n                                 JIMMY (O.C.)\n                    Judy?\n          \n          She still doesn't answer.\n          \n          Then the car thrusts itself forward.\n          \n                                 JIMMY (O.C.)\n                    Judy!     Stop it.\n          \n          Judy's got a look of determination in her eye.\n          \n                              JIMMY (O.C.)\n                    Judy, what are you doing?\n          \n          Judy doesn't respond. O.C., she's murmuring something to\n          herself that Jimmy can't hear or understand while she has the\n          throttle to the floor as they barrel toward the roadblock.\n          \n                                 JIMMY (O.C.)\n                    Judy!\n          \n          Judy keeps going.    Jimmy flips the back camera towards her.\n          \n                                 JIMMY (O.C.)\n                    Judy!     Stop!\n          \n          Judy's murmurs grow louder.\n          \n                                 JIMMY (O.C.)\n                    Judy!\n          \n          Jimmy braces himself as the car continues toward the\n          roadblock.\n          \n          Suddenly, Judy's murmurs get loud enough or us to hear.\n          \n                              JUDY\n                        (murmurs)\n                    We'll be together. We'll be\n                    together. We'll be together.\n                    We'll be together...\n          \n          They head straight in between two cars that form the\n          roadblock. Cops jump out of the way as the car hits head on\n          into...\n          \n          THE ROADBLOCK\n          \n          Impact sends the camera flying against the windshield,\n          CRACKING IT.\n          \n                                                                   125.\n          \n          \n          \n          Sounds of metal twisting and glass shattering is all\n          encompassing as the camera shakes in a violent frenzy!\n          \n          Camera settles on Judy's face, bloody, unconscious against\n          the steering wheel, her neck snapped, eyes open in a death\n          stare.\n          \n          Camera stays focussed on Judy for the longest time as she\n          leans against the steering wheel. Music plays on the radio.\n          It's JOHNNY CASH's cover of Tom Petty's \"I won't Back Down\".\n          \n          OVERHEAD SHOT of a news helicopter flying above the final\n          scene.\n          \n          Looking down from above, we see what the helicopter sees:\n          \n          A scene of about twelve State Trooper cars, lights flashing,\n          with Jimmy and Judy's car wrecked. Ambulances are there.\n          Jimmy and Judy's lifeless bodies are pulled from their car as\n          Johnny Cash's song shifts from background to score.\n          \n          The helicopter continues its circular pattern as the song\n          continues and we...\n          \n                                                     FADE TO BLACK.\n          \n \n\n\n\n\n\nJimmy and Judy\nWriters :   Randall Rubin  Jon Schroder\nGenres :   Action\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:28:26.658745"}