{"title": "Kate & Leopold", "film_link": "/Movie Scripts/Kate & Leopold Script.html", "script_link": "/scripts/Kate-&-Leopold.html", "info_raw": "\n\nKate & Leopold Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.75 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  James Mangold  Steven Rogers\nGenres  Romance  Fantasy  Comedy\nScript Date : December 2001\n\nRead \"Kate & Leopold\" Script\n\n\n", "script": "\n                                    \"KATE AND LEOPOLD\"\n\n                                      Screenplay by\n\n                             James Mangold and Steven Rogers\n\n                                   Based on a story by\n\n                                      Steven Rogers\n\n                \n\n               FADE IN:\n\n               INT. VICTORIAN ESTATE - 1895 - DAY\n\n               CLOSE UP: Ornate antique GRANDFATHER CLOCK strikes 2:15.\n\n               The credits begin to roll.\n\n               Calligraphy place cards are painstakingly hand-written in \n               preparation for a formal reception.\n\n               Servants meticulously clean an elaborate crystal chandelier.\n\n               Hands rapidly shine silver cutlery.\n\n               Fresh flowers arranged in several enormous vases.\n\n               INT. KITCHEN - DAY\n\n               Kitchen clock strikes 2:15.\n\n               Poultry plucked. Feathers everywhere.\n\n               Steaming copper pots boiling over. Platters prepared with \n               decorative garnish.\n\n               Extravagant tiered cake is lavishly iced. A glob of frosting \n               enters a pair of puckered lips. The perpetrator, a fey, \n               pompous, HEAD VALET, seriously considers the texture and \n               flavor of the icing, then gives the PASTRY CHEF a withering, \n               sour look.\n\n               The valet, oblivious to the chef's fury, gathers a prepared \n               silver breakfast tray and checks his pocket watch. 2:15.\n\n               INT. BEDROOM - DAY\n\n               Antique bedside table clock -- just past 2:15. The valet \n               throws open velvet drapes, sunlight FLOODS the room revealing \n               a figure sleeping soundly in a massive oak framed bed. The \n               valet puts down the tray, pulls back the quilt.\n\n               The dozing figure gives the valet a deliberate, angry KICK.\n\n               Flinching infinitesimally, the valet crosses to the closet, \n               selects three suits and holds them up for inspection. From \n               beneath the puffiest of pillows, AN EYE reluctantly opens. A \n               weary arm points decisively to the riding outfit.\n\n               EXT. ESTATE - DAY\n\n               The riding outfit is adorned by LEOPOLD, Duke of Albany, a \n               dashing, virile man in his 30's. GALLOPING with great abandon, \n               he expertly leads his horse up hills and over hedges. He \n               sends gardeners shaping the grounds fleeing from his path.\n\n               In the background, lanterns are being strung throughout the \n               estate. Rugs are beaten out of open windows.\n\n               INT. HALLWAY - EVENING\n\n               Large hallway clock -- 6:15. A pair of boots track a freshly \n               scrubbed floor as Leopold heads carelessly up the stairway. \n               Three steps behind, the valet snaps his fingers signaling \n               the staff to clean up the mess.\n\n               SERIES OF CLOSE UPS\n\n               Gaudily framed portraits of somber relations.\n\n               A bird sits listless in a gilded cage.\n\n               Hot water is poured into a bath.\n\n               Carriages begin to arrive.\n\n               Orchestra leader signals the musicians to play.\n\n               Guests fill the ballroom in formal attire.\n\n               INT. BEDROOM - NIGHT\n\n               Leopold stares haughtily into a full length mirror.\n\n               He wears only dotted linen drawers and a black silk top hat \n               of the period. He flexes slightly. The valet hastily fastens \n               a corset around his mid-section from behind.\n\n               Leopold eyes his reflection seductively. He becomes bored.\n\n               He turns to his right. The valet spoons sorbet from a silver \n               saucer into his mouth. He turns back to the mirror to watch \n               himself eat. The valet pats his mouth dry.\n\n               He affects a pampered STRUT, crossing the room as the valet \n               sprays a mixture of perfume and powder into the air. Leopold \n               thrusts out his arms walking through the mist, turns and \n               saunters back to his favorite place, in front of the mirror.\n\n               Finally, as if weighing a great decision, Leopold hands his \n               hat to his valet and nods firmly into the mirror.\n\n               CLOSE UP\n\n               Fine linen undervest slides over his head.\n\n               Black twilled worsted trousers pulled up to his waist.\n\n               The buttoning of his hard, white, roll collar.\n\n               A cream suede glove stitched in black slides over his hand.\n\n               A perfect tight bow tie is tied around his neck.\n\n               An elegant black tuxedo jacket with silk facings and tails \n               to the knees is fitted to his torso.\n\n               His hair is sleeked with oil and centrally parted.\n\n               His eyebrows are brushed with a tiny silver comb.\n\n               His cheeks are pinched.\n\n               A red silk handkerchief is placed in the bosom of his lapel.\n\n               Leopold stares into the mirror. The effect is DAZZLING. He \n               raises one eyebrow. Then, in a voice you could pour over a \n               waffle:\n\n                                     LEOPOLD\n                         You dance like a herd of cattle, \n                         Miss Fairchild. You are a rare woman \n                         who lights up the room... simply by \n                         leaving it.\n\n               He bows. As he rises, the reflection of Leopold's UNCLE OTTO, \n               a pampered, effectual man in his 60's, appears behind Leopold \n               in the looking glass.\n\n                                     UNCLE OTTO\n                         Tell me Leopold, do you plan to join \n                         us downstairs after completing this \n                         one-sided flash of wit?\n\n                                     LEOPOLD\n                         I despise affairs of this sort, Uncle \n                         Otto. No one really listens to anyone \n                         else. If you attempt it, you will \n                         see why.\n\n                                     UNCLE OTTO\n                         You judge everything too severely. I \n                         wonder what would happen if you were \n                         to cast that critical eye inward?\n\n                                     LEOPOLD\n                         You do not wonder at all. You merely \n                         ask in order to state your own \n                         opinion.\n\n                                     UNCLE OTTO\n                         We are all concerned about you.\n\n                                     LEOPOLD\n                         Ahh, here it comes.\n\n                                     UNCLE OTTO\n                         Your life does not seem to have any \n                         direction. At the age of 25 a man is \n                         too young to do anything well. At 35 \n                         he is too old. Now is your time to \n                         take action. Tell me, what is it you \n                         want to DO with your life?\n\n                                     LEOPOLD\n                              (wearily)\n                         I do not know.\n\n                                     UNCLE OTTO\n                              (just as weary)\n                         Your ignorance cramps my conversation.\n                              (he slaps Leopold's \n                              face twice rather \n                              quickly)\n                         Wake up! This is your one and only \n                         life. Every man has the chance to \n                         make a difference. DO something!\n\n               Leopold, stung, takes a moment to compose himself.\n\n                                     LEOPOLD\n                         I am most grateful for your \n                         surveillance and for your sympathy. \n                         I assure you there is no need for \n                         concern. I am as effectual and \n                         attentive... as my position allows.\n\n                                     UNCLE OTTO\n                         Life is not position, Leopold. It is \n                         action.\n                              (he straightens \n                              Leopold's tie)\n                         I will see you downstairs promptly. \n                         In the appropriate frame of mind.\n\n               He leaves. Leopold stares into the mirror, snaps his fingers. \n               The valet hands him a glass and pours a small shot of brandy. \n               Leopold shoots him a look. The valet fills the glass higher.\n\n               Leopold drains the glass and heads to the doorway. He \n               hesitates, taking a deep breath and a long pause. Finally...\n\n                                     THE VALET\n                              (grandly)\n                         Go spread joy.\n\n               Without looking back, Leopold leaves the room.\n\n               INT. BALLROOM - NIGHT\n\n               Music fills the air as the creme de la creme of Victorian \n               society gather inside. Leopold holds a prearranged dance \n               card. He looks at the names and finds his first partner is \n               MISS TREE. Leopold looks upward helplessly at an unrelenting \n               God.\n\n               INT. BALLROOM DANCE FLOOR - NIGHT\n\n               A profoundly self-conscious Leopold dances energetically \n               into frame with MISS TREE, an ancient, elfin, yet amazingly \n               SPRY woman who gapes up at him searchingly, unblinking.\n\n               Leopold opens his mouth to speak, can think of nothing \n               suitable to say, and clamps his mouth shut. They dance out \n               of frame.\n\n               INT. BALLROOM DANCE FLOOR - NIGHT\n\n               Leopold dances into frame with CLARA, a BEAUTIFUL girl of \n               19. He glances at her and smiles. She titters, turning away \n               shyly. They whirl around the dance floor. His smile grows \n               into a broad grin. Caught up in the excitement, Clara beams \n               up at him... happily revealing a mouth full of missing, inky \n               teeth.\n\n               Leopold, face frozen in a formal smile, dances on.\n\n               INT. BALLROOM DANCE FLOOR - NIGHT\n\n               Leopold lumbers into frame with MISS FAIRCHILD, a woman of \n               immense girth. With great dignity and extreme difficulty he \n               maneuvers her around the floor, looking everywhere except \n               her enormous bosom.\n\n                                     LEOPOLD\n                         You dance like an angel, Miss \n                         Fairchild. You light up the room. I \n                         thank you.\n\n               Miss Fairchild curtseys heavily. Leopold glances at his card, \n               sees the name Miss Serena Clacket and shudders.\n\n               He spots a VERY LOVELY WOMAN hidden amongst the guests. She \n               scribbles in a small note pad, occasionally glancing around. \n               Hiding his dance card, he saunters over.\n\n                                     LEOPOLD\n                         Good evening. I do not believe I \n                         have had the pleasure.\n\n               The young woman stares vacantly at Leopold until she realizes \n               he is addressing her. She puts her pad away.\n\n                                     CARLSON\n                         ...Julia Carlson.\n\n               Leopold takes her hand and kisses it gently.\n\n                                     CARLSON\n                         I'm sorry. Will you excuse me?\n\n                                     LEOPOLD\n                              (slightly tipsy)\n                         You are not from the area, are you?\n\n                                     CARLSON\n                              (smiles and shakes \n                              her head \"No\")\n                         Are you?\n\n                                     LEOPOLD\n                         This is my estate.\n\n                                     CARLSON\n                         Really?\n                              (looking around the \n                              room)\n                         Well it's not home but it's much...\n\n               Leopold regards her curiously. The orchestra starts up. There \n               is a hubbub amongst the guests.\n\n                                     LEOPOLD\n                         Shocking! The TA-RA-RA-BOOM-DE-AY.\n\n                                     CARLSON\n                         The? Oh, that's from Paris, isn't \n                         it?\n\n                                     LEOPOLD\n                         It is a scandal nonetheless.\n\n               Leopold spots Uncle Otto observing him from across the room.\n\n                                     LEOPOLD\n                         Miss Carlson, do me the honor?\n\n                                     CARLSON\n                         I'm afraid I'm not much of a dancer.\n\n                                     LEOPOLD\n                              (smiling seductively)\n                         Truly I would be in your debt. Any \n                         admonition would be erased simply by \n                         presenting a partner as lovely as \n                         yourself.\n\n                                     CARLSON\n                         No, no. Really, I...\n\n               Leopold stiffly holds out his arm. A beat. Carlson, stuck, \n               takes it WITH HESITATION and is escorted to the dance floor.\n\n               They dance. ALL but Leopold and Carlson gaily sing \"TA-RA-RA-\n               BOOM-DE-AY.\" Leopold, flushed, looks quite smitten. Carlson, \n               shy at first, eventually smiles brightly.\n\n                                     LEOPOLD\n                         I suppose we really ought to sing \n                         along.\n\n                                     CARLSON\n                              (embarrassed)\n                         Oh, golly.\n\n               They half sing, half speak the TA-RA-RA-BOOM-DE-AY, their \n               emphasis on \"BOOM.\" Laughing giddily, their dancing becomes \n               freer, picking up speed. The room SPINS. Finally:\n\n                                     CARLSON\n                              (breathless)\n                         Thank you for the dance. It was \n                         lovely. I hope it wasn't too awful \n                         for you.\n\n                                     LEOPOLD\n                         Not at all. It was most enlightening.\n\n               There is a slight pause. The Grandfather CLOCK strikes \n               midnight.\n\n                                     CARLSON\n                         I really must be going.\n\n                                     LEOPOLD\n                         I won't hear of it.\n\n                                     CARLSON\n                              (moving away from him)\n                         No, I'm quite late as it is.\n\n                                     LEOPOLD\n                         I shall see you to the door...\n\n                                     CARLSON\n                              (stopping him \n                              resolutely)\n                         You're very sweet. I had a wonderful \n                         time.\n                              (she watches him, \n                              memorizing his face. \n                              Then firmly)\n                         Goodbye.\n\n               Leopold takes a glass of champagne from a passing waiter. He \n               watches Carlson pass through the crowd and out the courtyard \n               door. He surveys the room. After a moment he follows her.\n\n               EXT. GARDEN - NIGHT\n\n               Leopold makes his way through the manicured garden in the \n               dark. He hears an EERIE METALLIC SOUND. He slows down, brushes \n               back the thicket. The silhouette of a woman is revealed. She \n               is once again writing in her notebook.\n\n                                     LEOPOLD\n                         Miss Carlson?\n\n               Carlson spins around quickly, panicked. Leopold STOPS. \n               Partially hidden in the brush, a sleek, oddly shaped, \n               MECHANICAL device. It's door open, lit from within, casting \n               a weird glow.\n\n                                     LEOPOLD\n                         Good God...\n\n                                     CARLSON\n                         What are you...? You frightened me.\n\n               Leopold moves toward the contraption and is about to touch \n               it...\n\n                                     LEOPOLD\n                         What sort of mechanism is this?\n\n               Carlson shakes her head, unsure of how to proceed.\n\n                                     LEOPOLD\n                         Answer me!\n\n                                     CARLSON\n                         It's perfectly all right. It's...\n\n               Leopold carefully examines the apparatus, stepping inside. \n               Carlson FREEZES.\n\n                                     CARLSON\n                              (carefully, \n                              deliberately)\n                         Listen to me. Please. Move very \n                         slowly. Step out of the machine. \n                         Step out and I'll explain whatever \n                         you want to know.\n\n                                     LEOPOLD\n                         What is this? Who are you?\n\n               His hand comes to rest on a glowing red lever.\n\n                                     CARLSON\n                         Oh, God.\n\n               She YANKS on his arm. Instinctively he pulls away, \n               accidentally thrusting the lever into action. Carlson falls \n               from the machine.\n\n                                     CARLSON\n                              (suddenly frantic)\n                         Get out of there! Get out now!\n\n               The machine LIGHTS UP.\n\n                                     LEOPOLD\n                         Miss Carlson... I...\n\n                                     CARLSON\n                         No!!!\n\n               The compartment door snaps shut.\n\n                                     CARLSON\n                         Shit!!\n\n               There is a BRIGHT WHITE FLASH. Blackness fills the screen.\n\n                                                                    CUT TO:\n\n               INT. N.Y.C. LABORATORY - 1995 DAY\n\n               The compartment door slides OPEN revealing DR. KAU, 30's, an \n               Asian doctor with a THICK BROOKLYN ACCENT. Her face full of \n               enthusiasm drops as she sees the unconscious Leopold.\n\n                                     DR. KAU\n                         Shit!!\n\n               She turns to her co-workers, warning them.\n\n                                     DR. KAU\n                         Shit!!\n\n               She looks back at Leopold.\n\n                                     DR. KAU\n                         Shit!!\n\n               Her co-workers, DR. PLODDER, austere, authoritative, DR. \n               DRAKE, muddled and timid, peer inside the compartment door.\n\n                                     DR. DRAKE\n                         Good God!\n\n                                     DR. PLODDER\n                         Everybody stay calm... Lock the front \n                         door.\n\n               Dr. Drake and Kau make a move to inspect an unconscious \n               Leopold.\n\n                                     DR. PLODDER\n                         No, no, no. You mustn't touch him. \n                         The consequences could be \n                         catastrophic.\n\n                                     DR. KAU\n                         He could be hurt, or even dead.\n\n                                     DR. PLODDER\n                         ...All right. Touch him.\n\n               They approach Leopold. Dr. Kau finds Carlson's note pad on \n               the ground next to Leopold. She reads the last entry.\n\n                                     DR. KAU\n                         ...But I'm stuck and it's only a \n                         dance and he IS the seventh Duke of \n                         Albany...\n\n               They all look at one another, then back at Leopold.\n\n                                     DR. DRAKE\n                         Carlson...!\n\n                                     DR. PLODDER\n                              (racing from the room)\n                         Give me a minute...\n\n                                     DR. KAU\n                         Shit!\n\n               INT. LAB - KATE'S OFFICE - DAY\n\n               KATHERINE COLES, a radiant workaholic, types frenetically \n               into the computer while talking on the phone, trying hard \n               not to sound upset.\n\n                                     KATE\n                         Who's upset? People fall in love, \n                         they have to climb back out.\n                              (she laughs but she \n                              is not smiling)\n                         So, what? We'll just be friends now, \n                         Right?\n\n               She stops typing and listens for a while. She runs her hand \n               through her hair.\n\n                                     KATE\n                         I see. Well I appreciate your honesty.\n                              (using her middle \n                              finger she pushes up \n                              her glasses)\n                         No. I'll just think of this as \n                         surviving another dating accident. \n                         Take care or good luck or whatever \n                         I'm supposed to...\n\n               The line goes dead.\n\n                                     KATE\n                         ...say... Goodbye.\n\n               Dr. Plodder bursts in. Kate sees his distress and instantly \n               becomes very centered.\n\n                                     DR. PLODDER\n                         She's back.\n\n                                     KATE\n                              (rising)\n                         That's impossible! She wasn't supposed \n                         to return until...\n\n                                     DR. PLODDER\n                         Kate. It's Carlson. Something went \n                         wrong.\n\n               He hands her Carlson's note pad. Slowly, she sits down.\n\n                                     KATE\n                         ...The 7th Duke...\n\n               INT. LAB - DAY\n\n                                     KATE\n                              (all business, reading \n                              from a printout)\n                         ...of Albany. He was the... IS the \n                         son of Emery and Eliza. He was of no \n                         actual importance until he vanished \n                         at the turn of the century without a \n                         trace. It was a sensation. In the \n                         30's they even made a movie about \n                         him. \"The Tenuous Duke\" with Ronald \n                         Coleman.\n\n                                     DR. DRAKE\n                              (absently)\n                         I love Ronald Coleman.\n\n                                     KATE\n                         Despite much speculation and a nation \n                         wide investigation, a body was never \n                         found. He was never heard from again.\n\n                                     DR. KAU\n                         Until now.\n\n               There is a stunned silence. They stare at Leopold in awe.\n\n                                     DR. DRAKE\n                         We've altered the course of history.\n\n                                     DR. KAU\n                         We never should have started this...\n\n                                     KATE\n                         Calm down.\n\n                                     DR. PLODDER\n                         What are we going to do? We can't \n                         keep him here. Imagine if anyone \n                         found out!\n\n                                     KATE\n                         Think. Just, think. Rationally. Now, \n                         no one would believe such a stupid \n                         mistake could be made because no one \n                         would believe any of this is possible. \n                         So. We fix this. We keep this to \n                         ourselves and we fix it. Fast.\n\n               They all nod in agreement.\n\n                                     KATE\n                         Dr. Kau, research all our data. 1st \n                         priority: Locate Carlson. Drake, \n                         determine the reciprocal correlation's \n                         connected to the 19th century. Work \n                         24 hours a day if necessary. In the \n                         meantime... one of us will have to \n                         take charge of him.\n\n               She forces back panic. Only the tremor in her voice gives \n               her away.\n\n                                     KATE\n                         This is a major scientific \n                         opportunity. It doesn't get any better \n                         than this. Imagine. Researching the \n                         behavior, the physical and emotional \n                         characteristics of a century ago! \n                         Utilizing technology available to us \n                         today... He's a gold mine!\n\n                                     DR. PLODDER\n                         He's a man, Kate. Not a guinea pig.\n\n                                     KATE\n                         And while he's here, he's ours. Any \n                         volunteers?\n\n               No one moves.\n\n                                     DR. DRAKE\n                         We'll draw names. Whoever is is picked \n                         will be responsible. Agreed?\n\n               They nod reluctantly. Drake writes out names and throws them \n               in a cup. The silence becomes deafening. Finally:\n\n                                     DR. KAU\n                         I'll do it.\n\n               All the scientists face her.\n\n                                     DR. PLODDER\n                         You'll look after him?\n\n                                     DR. KAU\n                         No, I meant I'll pick the name.\n\n               She reaches in. They wait with mounting suspense. Finally \n               SHE TURNS TO KATE. The scientists follow her gaze. A beat.\n\n                                     KATE\n                         Fine.\n\n               Leopold stirs. He blinks at the group.\n\n                                     LEOPOLD\n                         Where...? What has happened?!\n\n               The doctors, caught off guard, SMILE BENIGNLY. They surround \n               Leopold as a group, not knowing where to begin. Finally:\n\n                                     KATE\n                         Your Grace... Um... Hello... Weee \n                         aaare a smaaall part of a laaarge \n                         research team. A project funded by \n                         the government of the United States.\n\n                                     LEOPOLD\n                              (regarding their \n                              appearance with \n                              distaste)\n                         Oh. Americans. I see...\n\n                                     KATE\n                         Yes, um... For the past six and a \n                         half years we've been conducting \n                         scientific experiments on density \n                         and flexibility in the dimensions of \n                         time and space.\n\n                                     DR. DRAKE\n                         Yes, uh... Quite by accident we came \n                         upon a formula utilizing Tachyons... \n                         particles traveling faster than the \n                         speed of light, which allowed us \n                         to... fold time so to speak.\n\n                                     DR. PLODDER\n                         Yes. Bend it between the cracks of \n                         the dimensions.\n\n                                     DR. KAU\n                         Yes.\n\n               They all laugh nervously. Leopold does not.\n\n                                     DR. DRAKE\n                         Now, while that wasn't the original \n                         purpose of our experiment, we opted \n                         to pursue it, well, privately, on \n                         our own.\n\n                                     DR. KAU\n                         Borrowing funds already provided.\n\n                                     KATE\n                         We journeyed to your time because it \n                         was the quickest path to follow. We \n                         debated long and hard whether we \n                         should use this knowledge at all. \n                         Believe me, it was never our intent \n                         to disturb the past...\n\n                                     DR. DRAKE\n                         Merely to discover if the expedition \n                         were possible. As your presence here \n                         confirms... we are very disturbed.\n\n               Leopold nods at them as if they are insane.\n\n                                     DR. PLODDER\n                         The problem facing us is not only \n                         HOW to get you back, but WHEN, you \n                         see?\n\n                                     KATE\n                         We certainly don't want to \n                         miscalculate. Send you to a different \n                         era entirely.\n\n               Leopold starts to speak.\n\n                                     DR. PLODDER\n                         Rest assured, no harm will come to \n                         you. You'll be well looked after by \n                         Dr. Coles.\n\n                                     LEOPOLD\n                         Dr. Coles...? I do not follow. What \n                         do you mean, get me back home?... \n                         Where am I?\n\n               Awkward pause. Leopold looks carefully around the room for \n               the first time: modern mechanical equipment, data shifting \n               and changing, giant cooling devices, bright neon lighting. \n               The doctors are silent.\n\n                                     LEOPOLD\n                         Answer me!...\n                              (slowly)\n                         Would you have me believe... I am \n                         being detained, at present in the \n                         HEREAFTER?... The time to come?\n\n                                     DR. PLODDER\n                              (carefully)\n                         It is the year nineteen hundred and \n                         ninety-five.\n\n                                     LEOPOLD\n                         ...19...?\n\n               Leopold leaps up. The doctors follow him around the room.\n\n                                     LEOPOLD\n                         You're insane! All of you! This is \n                         impossible!\n\n                                     DR. PLODDER\n                         Leopold, calm down!\n\n                                     LEOPOLD\n                         A voyage through time! What do you \n                         take me for? Did you bring me here \n                         by force?\n\n                                     DR. DRAKE\n                         We're scientist, not seditionists.\n\n                                     LEOPOLD\n                              (truly panicked)\n                         Let me out of here! I won't stand \n                         for this another moment!\n\n               He's out the door.\n\n               INT. UNDERGROUND HALLWAY - DAY\n\n               Leopold moves quickly, fearfully through the darkly lit \n               hallway, the doctors close behind.\n\n                                     KATE\n                         Leopold, wait!\n\n                                     DR. KAU\n                         You don't know what you're doing.\n\n                                     DR. PLODDER\n                         Just listen to what we have to say!\n\n               It is too late. Leopold throws open the door and runs \n               upstairs.\n\n               EXT. STREET - DAY\n\n               Blinding sunlight. Skyscrapers. Automobiles. Traffic lights. \n               Road construction. Modern day pedestrians. Helicopters. Car \n               alarms. Leopold stands frozen, overwhelmed, taking it all \n               in.\n\n                                     LEOPOLD\n                         19...?\n\n               The doctors reach him. He collapses to the ground.\n\n                                                                    CUT TO:\n\n               INT. CAR - DAY\n\n               Kate and Dr. Kau talk quietly. Leopold, tightly holding onto \n               his seat and the back door, gazes out the window in utter \n               disbelief.\n\n                                     KATE\n                         Squab.\n\n                                     DR. KAU\n                         Squab?\n\n                                     KATE\n                         I remember reading they ate a lot of \n                         squab.\n\n                                     DR. KAU\n                         Squab... Do you have a squab?\n\n                                     KATE\n                              (quietly. On the verge \n                              of panic)\n                         I don't know!\n\n                                     DR. KAU\n                         Pull yourself together!\n                              (turning to Leopold)\n                         Are you all right back there?\n\n               Leopold, trembling, gapes at the sights, every day sounds, \n               magnified. Perspiration runs down the side of his face. Kate \n               watches him in her rear view mirror.\n\n                                     KATE\n                         You're going to be fine you know. \n                         There's nothing to worry about. I \n                         have everything under control.\n\n               Dr. Kau stares at Kate in concerned silence.\n\n                                     KATE\n                              (quietly to Dr. Kau)\n                         We'll never get away with this.\n\n               INT. BEDROOM - THE NEXT MORNING\n\n               Leopold awakens alone in his room. He sits up with a jolt. \n               His stomach sinks as he realizes THIS IS NO DREAM. He slowly \n               rises to his full stature, moving to the window he looks out \n               on the modern day city, shaking his head in awe. He makes \n               his way to the bedroom door and tentatively touches the knob.\n\n               There is a KNOCK on the door.\n\n               Leopold JUMPS back and runs to the bed: The picture of \n               dignity.\n\n                                     KATE\n                         How are you feeling?\n                              (no response)\n                         I thought you might like some tea.\n\n                                     LEOPOLD\n                         I insist on being returned home \n                         immediately.\n\n                                     KATE\n                         I understand. We're doing our best.\n\n                                     LEOPOLD\n                         I wish to speak with your employer, \n                         Dr. Coles.\n\n                                     KATE\n                         You're speaking to him.\n\n                                     LEOPOLD\n                         You are not suggesting that you are \n                         Dr. Coles?\n\n               She smiles.\n\n                                     LEOPOLD\n                         Miss... uh?\n\n                                     KATE\n                         Dr. Coles. If you like, you could \n                         call me Miss Dr. Coles or if that's \n                         too much, how about just plain Kate?\n\n                                     LEOPOLD\n                              (coldly)\n                         A WOMAN of science?\n\n                                     KATE\n                         Hard to believe?\n\n                                     LEOPOLD\n                         But a woman's brain cannot obtain \n                         enough knowledge to posses a truly \n                         scientific mind.\n\n                                     KATE\n                              (jotting this down)\n                         Interesting. Nevertheless, we've \n                         come a long way baby.\n\n                                     LEOPOLD\n                              (confused)\n                         Are you attempting to be humorous?\n\n                                     KATE\n                         I'm attempting to be informative \n                         it's just coming out humorous.\n\n               Leopold regards her dubiously.\n\n                                     KATE\n                              (clinically)\n                         Look, modern social science clearly \n                         states that a woman's place in society \n                         marks the level of that civilization. \n                         A science career for a woman is now \n                         almost as acceptable as being a... \n                         a... waitress. Cream and sugar?\n\n                                     LEOPOLD\n                         Young lady, I... Surely it is not \n                         expected that I remain here with you \n                         indefinitely... Unchaperoned?\n\n                                     KATE\n                              (pen poised)\n                         Does that make you nervous?\n\n                                     LEOPOLD\n                         Certainly not!\n\n                                     KATE\n                              (writing)\n                         Then what are you getting so red \n                         about? It's a very large apartment... \n                         with locks on all the doors.\n\n                                     LEOPOLD\n                         The idea! My dear Miss Coles...\n\n                                     KATE\n                         Dr. Coles.\n\n                                     LEOPOLD\n                         Honey...\n\n                                     KATE\n                              (she puts the pad \n                              down)\n                         Let's get one thing straight right \n                         now. My name is Kate or Katherine or \n                         if you insist Dr. Coles.\n                              (she rises)\n                         Take a good long look, Leopold. I am \n                         a 20th century American woman with a \n                         Doctorate and a commission and \n                         independence. I am not your \"young \n                         lady\" or your \"pretty Miss\" or your \n                         \"honey.\" Is that clear?\n\n               Leopold watches her with great interest. Finally:\n\n                                     LEOPOLD\n                         Honey... For the tea.\n\n                                     KATE\n                         ...I'll get it for you.\n\n               Kate grabs the teacup grandly and leaves the room.\n\n               INT. KITCHEN - MORNING\n\n               Kate rummages through every drawer, shelf and cupboard \n               searching for the honey. Finally, she spots the honeybear \n               and squeezes honey A TAD TO VIOLENTLY into the tea. She tries \n               posing \"confidently\" then checks her reflection in the \n               toaster.\n\n               INT. BEDROOM - MORNING\n\n               Kate returns \"confidently\" with the tea and a plastic smile.\n\n                                     LEOPOLD\n                         Thank you... Has it been decided \n                         what it is I am to do while I am \n                         being held here?\n\n                                     KATE\n                         Oh, just some laundry, the cooking, \n                         a little light housework...\n\n               Leopold doesn't react.\n\n                                     KATE\n                              (clearing her throat)\n                         I took the liberty of preparing a \n                         simple schedule to efficiently utilize \n                         your time while incorporating you \n                         into my routine.\n                              (she hands him a \n                              schedule)\n                         As you can see, my day begins with \n                         meditation and yoga from 6:30 to \n                         7:00.\n\n               She moves in close to him, making Leopold uncomfortable.\n\n                                     KATE\n                         YOU will arise at 6:45, shower and \n                         change and at 7:15, we breakfast \n                         together. 7:45 we begin the days \n                         work. At 10:45 Dr. Kau arrives to \n                         observe you in your natural routine \n                         as I research the data that will \n                         enable you to return home. At 1:15 \n                         we lunch together. 2:15 you answer a \n                         daily questionnaire, I type up my \n                         notes. At precisely 6:15 you will \n                         enjoy 15 minutes of FREE TIME, then, \n                         at 6:30, I listen to Tom Brokaw while \n                         making dinner as YOU write down any \n                         questions that come up during your \n                         day. At 7:00, we dine together. If \n                         you need me at any time you may ring \n                         this bell.\n\n               She rings a tiny dinner bell. He is about to speak.\n\n                                     KATE\n                         Now, Mondays and Wednesdays I have \n                         computer science class, Tuesdays I \n                         have therapy. IF I have a date, I'm \n                         usually home by 9:15. During these \n                         periods you may read any of the books \n                         I've picked out for you in your room. \n                         I organize my next days work at 10:30, \n                         11:35, David Letterman, 12:40 I'm in \n                         bed.\n                              (she takes a breath, \n                              smiles at him)\n                         Next day we begin again. Simple?\n\n                                     LEOPOLD\n                              (after a beat, with \n                              great dignity)\n                         ...At what time shall I WEE and POOH?\n\n               Kate is forced into a stunned silence.\n\n                                     CHARLIE'S VOICE\n                         Kate? I'm home.\n\n                                     KATE\n                         Oh. Yes. Our chaperone is here.\n\n                                     LEOPOLD\n                         Your father?\n\n                                     KATE\n                         Sort of. My brother.\n\n                                     LEOPOLD\n                         Visiting?\n\n                                     KATE\n                         For the past two years. Charlie can \n                         never know about this project. We'll \n                         tell him you are a... overly \n                         distinguished colleague staying here \n                         as our guest. From Canada. Which \n                         would explain your lack of familiarity \n                         with our customs and so forth\n\n                                     LEOPOLD\n                              (aghast)\n                         A CANADIAN?\n\n                                     KATE\n                         Make yourself comfortable. I'll check \n                         in on you later. I think this is \n                         going very well, don't you?\n\n               Leopold looks at her blankly.\n\n                                     KATE\n                         Okay. If you need anything, just \n                         ring.\n\n               Kate tinkles the bell, fumbles for the knob and heads out. \n               P.O.V. still on Leopold.\n\n                                     KATE (V.O.)\n                              (shouting)\n                         Charlie!\n\n               Leopold reacts.\n\n                                     CHARLIE (V.O.)\n                              (screaming just as \n                              loud)\n                         What?\n\n                                     KATE\n                              (still shouting)\n                         Come here I wanna talk to you.\n\n               Leopold listens at the door. He slowly opens it, takes two \n               steps out, peers around the corner, then quickly steps back \n               in. He takes a DEEP FRIGHTENED BREATH and slowly deflates.\n\n               INT. CHARLIE'S STUDIO - MORNING\n\n               Charlie sits on the couch smoking a cigarette surrounded by \n               his paintings. He is a likable twentysomething with a big \n               mouth.\n\n                                     CHARLIE\n                         What did I do?\n\n                                     KATE\n                              (removing his coffee \n                              from the table, \n                              setting it on a \n                              coaster)\n                         RINGS! And what did I say about you \n                         smoking in the house?\n\n                                     CHARLIE\n                         You were against it.\n\n                                     KATE\n                         Correct. You're back early.\n                              (She takes away his \n                              cigarette)\n\n                                     CHARLIE\n                         Hey!... Are you all right? You look \n                         funny.\n\n                                     KATE\n                         Funny ha ha or funny odd?\n\n                                     CHARLIE\n                         Both.\n\n                                     KATE\n                         That all depends. How was your trip?\n\n                                     CHARLIE\n                         Why?\n\n                                     KATE\n                         If it was good I'll tell you the \n                         truth. If it was rotten I'll have to \n                         butter you up first.\n\n                                     CHARLIE\n                         Butter me up.\n\n                                     KATE\n                         Have you been working out? No, I'm \n                         really starting to see results. Are \n                         you comfortable there on the couch?\n\n                                     CHARLIE\n                         Very.\n\n                                     KATE\n                         Good. Cause you'll be sleeping there \n                         the next few nights.\n\n                                     CHARLIE\n                         Kate!\n\n                                     KATE\n                         You have to be out of here by 8 and \n                         you can't be back before 6. We have \n                         an important man working with us \n                         with very unusual needs. The company \n                         is insisting he stay here.\n\n                                     CHARLIE\n                         What about a hotel?\n\n                                     KATE\n                         This man requires around the clock \n                         attention.\n\n                                     CHARLIE\n                         I meant for me.\n\n                                     KATE\n                         Thank you, Charlie.\n                              (she kisses his \n                              forehead)\n                         I owe you one.\n\n                                     CHARLIE\n                         You owe me nine. What am I supposed \n                         to do all day?\n\n                                     KATE\n                              (as if having an \n                              epiphany)\n                         You could get a job!\n\n                                     CHARLIE\n                         Kate, the entire point of being an \n                         artist is that I don't have to work. \n                         Who is this guy?\n\n                                     KATE\n                         Well, I can't tell you much because...\n\n                                     KATE AND CHARLIE\n                         I'm not allowed to discuss what goes \n                         on at the office.\n\n                                     KATE\n                         Well I'm not. Anyway, it might be \n                         interesting to have someone else to \n                         talk to. It gets so quiet around \n                         here sometimes I feel like I've gone \n                         deaf.\n\n                                     CHARLIE\n                         Does he have a label?\n\n                                     KATE\n                         Leopold.\n\n                                     CHARLIE\n                         LEOPOLD? Is he anything like his \n                         name?\n\n                                     KATE\n                         He's exactly like his name.\n\n                                     CHARLIE\n                         Then you owe me ten.\n\n               INT. LIVING ROOM - DAY\n\n               Leopold PEEKS around the entrance to the living room. \n               Confident it's unoccupied, he majestically walks inside: Up \n               to date gadgetry, Charlie's modern art work, bright \n               fashionable furniture. Leopold recoils. His eyes come to \n               rest on the television set. The ON OFF buttons loom large. \n               He looks around the room then brazenly presses the button \n               ON.\n\n               Instantly, REGIS and KATHY LEE loudly berate each other before \n               an excited crowd.\n\n               Leopold jumps back several feet, hands flailing in front of \n               him as if shooing away a bee. He quickly, yet cautiously, \n               slams the power OFF.\n\n                                     LEOPOLD\n                         Horrible!\n\n               He quickly scurries out the hallway.\n\n               He stops abruptly. He remains very still. Composing himself, \n               he turns and deliberately faces the room. After a moment, he \n               purposefully steps back inside.\n\n               He makes a large ARC around the television set, is confronted \n               by one of Charlie's sculptures and makes an ARC around that. \n               He finds himself in front of a light switch and gingerly \n               examines it. As he does, track lighting ILLUMINATES the room.\n\n               He looks at the lights then back at the switch. He flicks \n               the lights ON and OFF, trying to figure out the precise moment \n               in the transfer of power, laughing in spite of himself.\n\n               Kate and Charlie enter. They watch Leopold flicking the \n               lights, laughing like a madman. Charlie gives Kate a look.\n\n                                     KATE\n                              (explaining)\n                         He's from Canada...\n\n               INT. DINING ROOM - NIGHT\n\n               Leopold sits at the head of the table, Kate and Charlie \n               banished to either side. Leopold chews his dinner incessantly.\n\n                                     LEOPOLD\n                              (finally)\n                         What is this?\n\n                                     KATE\n                         It's called Hamburger Helper.\n\n                                     LEOPOLD\n                         It is beyond help. Please serve the \n                         next course.\n\n               He pushes his plate away.\n\n                                     KATE\n                         I'm afraid there is no next course. \n                         If you make a list of the foods you \n                         like, I'll pick them up at the store \n                         for you.\n\n                                     LEOPOLD\n                         Is all food here this... textured?\n\n                                     CHARLIE\n                         Mine's good.\n\n                                     LEOPOLD\n                         Please understand, I am used to a \n                         different sort of preparation. Where \n                         I come from a proper meal is the \n                         result of reflection and study. A \n                         recipe is merely a theme which an \n                         intelligent cook can plan each time \n                         with variation.\n\n               Charlie gives Kate a look.\n\n                                     LEOPOLD\n                         Several courses are served. Menus \n                         are often prepared days in advance, \n                         timed to perfection. It is said, \n                         without the culinary art, the \n                         crudeness of reality would make life \n                         unbearable.\n\n                                     CHARLIE\n                         In Canada?\n\n                                     LEOPOLD\n                              (after a beat. Firmly)\n                         In Canada.\n\n                                     CHARLIE\n                         We have a saying here. \"Shake and \n                         shake the catsup bottle, none will \n                         come and then a lot'll.\"\n\n               He pours catsup on his dinner.\n\n                                     LEOPOLD\n                         How interesting.\n\n                                     CHARLIE\n                         Since you're such an expert on fine \n                         cuisine, why don't you make dinner \n                         tomorrow night?\n\n                                     LEOPOLD\n                         It should be obvious to you that I \n                         am NOT a domestic. You may take my \n                         plate.\n\n                                     CHARLIE\n                         I have my own, thank you.\n\n                                     KATE\n                         Charlie...\n\n                                     CHARLIE\n                         Who died and made me Cinderella?\n\n                                     LEOPOLD\n                         Young man, there is a distinct \n                         impertinence to your voice.\n\n                                     CHARLIE\n                         It's part of my charm.\n\n                                     LEOPOLD\n                         Suppress it.\n\n                                     KATE\n                              (changing the subject)\n                         Leopold... Since you're our guest \n                         here, there are several cultural \n                         events you might enjoy seeing. Charlie \n                         has season tickets to the ball game. \n                         Perhaps you'd like to take that in?\n\n                                     LEOPOLD\n                         What is it?\n\n                                     CHARLIE\n                         What is it??\n\n                                     KATE\n                         Or the Opera or the Ballet?\n\n                                     CHARLIE\n                         What is it??\n\n                                     KATE\n                         Charlie, there's no rule that says \n                         everyone has to be interested in \n                         baseball.\n\n                                     CHARLIE\n                         No, but I believe there is a rule \n                         that says everyone has to have HEARD \n                         of it.\n\n                                     LEOPOLD\n                         Dr. Coles, your brother Charles \n                         attitude and demeanor are \n                         unacceptable. If I am to stay on \n                         here you must have a serious talk \n                         with him regarding respect and \n                         civility.\n\n                                     KATE\n                         CHARLES, could you help me with the \n                         dessert in the kitchen?\n\n                                     CHARLIE\n                         In the kitchen?\n\n                                     KATE\n                         IN the kitchen. Excuse us.\n\n               Kate and Charlie leave. The camera remains on Leopold, sitting \n               alone, calmly sipping his wine. VOICE OVER FROM THE KITCHEN:\n\n                                     CHARLIE\n                         I don't believe this guy!\n\n                                     KATE\n                         Try to be nice to him.\n\n                                     CHARLIE\n                         I'm always NICE!\n\n                                     KATE\n                         Please Charlie, as a favor to me.\n\n                                     CHARLIE\n                         He gives me the creeps.\n\n               Leopold reacts. He listens self-consciously.\n\n                                     KATE\n                         He's different that's all.\n\n                                     CHARLIE\n                         What was that crack about domestics?\n\n                                     KATE\n                         Charlie, this is important to me.\n\n                                     CHARLIE\n                         You're not going out with him, are \n                         you?\n\n                                     KATE\n                         Eeuuu! I may be desperate but I'm \n                         not a lost cause.\n\n                                     CHARLIE\n                         Kate, this is me. I've seen the guys \n                         you bring home.\n\n                                     KATE\n                         I've done countless favors for you! \n                         Now I'm asking for just one little \n                         thing...\n\n                                     CHARLIE\n                              (overlapping)\n                         Oh, all right! All right! All right!\n\n               They emerge from the kitchen, beaming.\n\n                                     KATE\n                              (after a beat)\n                         We forgot the dessert.\n\n                                     CHARLIE\n                         You know,... I don't know if I \n                         mentioned it... but that is one fine \n                         looking suit.\n\n               INT. KATE'S BEDROOM - 6:30 A. M.\n\n               Radio alarm clock -- 7:45 a.m. Louis Armstrong begins to \n               sing, \"Let's Call the Whole Thing Off.\" Dressed in yoga \n               clothes Kate sits on her bed in the lotus position. She bangs \n               the gong and closes her eyes. A bell rings. Kate flinches \n               but does not open her eyes.\n\n                                     KATE\n                              (too sweetly)\n                         What is it, Leopold?\n\n               The bell rings louder, interrupting Kate's routine.\n\n                                     KATE\n                              (eyes closed, screaming \n                              like a fishwife)\n                         WHAT IS IT, LEOPOLD?!\n\n               Leopold's bell rings with determination. Kate is off the bed \n               and out of the room.\n\n               INT. KITCHEN - MORNING\n\n               Kate enters and stops short. Leopold sits at the table ringing \n               a BELL. The dishwasher is open and SPRAYING WILDLY, the \n               blender has spread breakfast shake EVERYWHERE, water is \n               BOILING OVER on the stove, refrigerator, freezer, and every \n               cupboard door is OPEN. Garbage disposal runs FULL BLAST.\n\n                                     LEOPOLD\n                              (calmly amidst the \n                              chaos)\n                         I cannot seem to find the tea...\n\n               CLOSE UP: Leopold's hand rings a bell with irritation.\n\n               INT. CHARLIE'S BEDROOM - EVENING\n\n               Leopold, Kate, and Charlie stand in front of Charlie's open \n               closet. Leopold selects clothes from Charlie's wardrobe.\n\n                                     LEOPOLD\n                         No... No... No. Good God, no!... \n                         Perhaps...\n\n               He tosses them aside carelessly as Charlie seethes.\n\n               CLOSE UP: Leopold rings his bell.\n\n               INT. HALLWAY - EARLY MORNING\n\n               Kate and Charlie form a line to the bathroom. Kate checks \n               her schedule and bangs on the door.\n\n                                     KATE\n                         Leopold, your time is up! What's he \n                         got, a girl in there?\n\n               INT. BATHROOM - EARLY MORNING\n\n               Leopold Luxuriates in the bathtub wearing a \"Whitecap\" \n               marveling at the whirlpool and the instant hot water. He \n               picks up a can of shaving cream and inspects it in wonder. \n               It SPRAYS.\n\n               CLOSE UP: Leopold rings his bell. Nothing happens. He \n               discovers the clapper has been stolen.\n\n               INT. KATE'S STUDY - AFTERNOON\n\n               Kate types, talks and researches simultaneously. She looks \n               up and stops suddenly.\n\n               Leopold appears wearing MANY oddly assorted layers of \n               Charlie's clothes, a bandanna bow tie, Irish woolen cap, \n               bicycle gloves, aluminum baseball bat walking stick. He poses \n               foppishly.\n\n                                     LEOPOLD\n                         I should like to read about modern \n                         currency during my bath tonight. See \n                         that the tub and basin are scrubbed \n                         up. Remnants remain of this afternoons \n                         shave.\n\n               Kate nods at him stupefied. Due to the many layers of \n               clothing, he imperiously leaves the room walking as if wearing \n               skis.\n\n               INT. BEDROOM - NIGHT\n\n               Leopold rings a BIG NEW COWBELL. No one responds.\n\n               INT. CHARLIE'S WORKROOM - NIGHT (CONTINUOUS)\n\n               He discovers Kate at her computer, Charlie reading a book. \n               Each are wearing a walkman.\n\n               He stands in front of them and rings his cowbell furiously \n               until they look up.\n\n               INT. STUDY - DAY\n\n               Leopold studies his questionnaire, Kate researches Victorian \n               customs. They simultaneously look up and gaze at the other. \n               A beat.\n\n               Embarrassed, Kate dons her glasses and Leopold shuffles \n               papers. They look up again. Then down. Then get back to work.\n\n               INT. KATE'S BEDROOM - NIGHT\n\n               Kate sits on her bed with her laptop watching David Letterman. \n               She glances up, laughs out loud. She looks at the dark empty \n               room. No one is there to share it with. Closing her computer, \n               she holds her pillow close to her. She slowly moves to the \n               window and looks out.\n\n               INT. LEOPOLD'S BEDROOM - NIGHT\n\n               A text book with Leopold's picture inside. Leopold reads the \n               brief summary of his life with heartbreaking astonishment. \n               He moves to the window and looks out.\n\n               EXT. N.Y.C. APARTMENT BUILDING - NIGHT\n\n               Kate and Leopold gaze out of their windows. The camera slowly \n               pulls back until they are swallowed up by the city.\n\n               INT. KATE'S STUDY - AFTERNOON\n\n               Kate scans her notes as Leopold paces dully about the room.\n\n                                     KATE\n                         In our last session you intimated \n                         there was a symmetrical system \n                         regulating the social order of \n                         conformity spanning your era. I found \n                         this particularly intriguing If I \n                         can just find it in my notes...\n\n               A fire engine races by. Leopold dashes to the window then \n               turns back, excited.\n\n                                     LEOPOLD\n                         The fire brigade!\n\n               Kate stares at him blankly. She munches RICE CAKES and drinks \n               water FROM THE BOTTLE. A beat. She returns to her notes.\n\n                                     LEOPOLD\n                         This is insufferable! I refuse to be \n                         spied upon, skipped over, or shuffled \n                         about any longer. I have yet to \n                         venture outside this cell. Before I \n                         go mad a more suitable arrangement \n                         must be found.\n\n                                     KATE\n                         Found it.\n\n                                     LEOPOLD\n                              (startled)\n                         A resolution?\n\n                                     KATE\n                         No I meant I found my notes.\n\n                                     LEOPOLD\n                         Dr. Coles! Changes are in order.\n\n                                     KATE\n                         I can hear you.\n\n                                     LEOPOLD\n                              (under control now)\n                         Miss Coles, as we are to remain here \n                         together, there are certain conditions \n                         I insist are met and maintained. I \n                         no longer wish to be peeped at, \n                         mocked...\n\n                                     KATE\n                         I never...\n\n                                     LEOPOLD\n                              (calmly)\n                         Or interrupted. Jot this down. \n                         Breakfast at 12. Luncheon at 4. Diner \n                         at 8. A horse should be made available \n                         from 1 to 3.\n\n                                     KATE\n                         A horse? In New York City?\n\n                                     LEOPOLD\n                         Yes. Also, I feel very strongly about \n                         your style of dress. I do not care \n                         for it.\n                              (Kate looks up)\n                         I cannot believe it is the prevailing \n                         taste for women to appear masculine \n                         and unkempt. If this is the fashion, \n                         have it altered.\n\n               Kate rises.\n\n                                     LEOPOLD\n                         That is all for the present.\n\n               He grandly hands her a napkin.\n\n                                     LEOPOLD\n                         CRUMBS, my dear!\n\n                                     KATE\n                              (infuriated)\n                         Thank you!\n\n               Brushing herself off, she heads to the door.\n\n                                     LEOPOLD\n                         Dr. Coles. I have been acquainted \n                         with many women in my time, yet I am \n                         compelled to say that the modern \n                         woman is by far the least attractive \n                         I have ever encountered.\n\n                                     KATE\n                              (rising to the occasion)\n                         And I have a news flash of my own.\n\n               Leopold waits.\n\n                                     KATE\n                         You sir, are no Ronald Coleman!\n\n               She storms out.\n\n               INT. LAB - EARLY MORNING\n\n               Dr. Drake enters Dr. Kau's office with two pints of Haagen \n               Dazs.\n\n                                     DR. DRAKE\n                         Chocolate Peanut Butter Cookie Dough \n                         Swirl or Peach?\n\n                                     DR. KAU\n                         Peach.\n\n               They dig in.\n\n                                     DR. DRAKE\n                         Any luck?\n\n                                     DR. KAU\n                         Yea. Lots of luck. All bad. No \n                         information exists detailing what \n                         happened to Carlson. I've been working \n                         for weeks and I'm not any closer \n                         than when I began... How are you \n                         doing?\n\n                                     DR. DRAKE\n                         My cholesterol level is up 70 points.\n\n               Kate enters, exhausted, deposits an armful of papers on Dr. \n               Drake's desk. Kate has pencils tucked behind her ear, through \n               her hair, and in her mouth.\n\n                                     DR. DRAKE\n                         Thank you, Kate... How're you managing \n                         with Leopold?\n\n                                     KATE\n                         Fine. Fine... Why? What did you hear?\n\n                                     DR. DRAKE\n                         Nothing. I was just asking.\n\n                                     KATE\n                         Oh. Well, it's fine. He's a delight. \n                         Everything's under control.\n\n                                     DR. KAU\n                         Keep up the good work.\n                              (after she's gone)\n                         She seemed a little scattered. Do \n                         you think everything's all right?\n\n                                     DR. DRAKE\n                         Katherine Coles is the most capable \n                         person we have on this project. If \n                         anyone can handle the delicacy of \n                         this situation, Kate can.\n\n                                     DR. KAU\n                         So there's nothing to worry about?\n\n                                     DR. DRAKE\n                         Absolutely not.\n\n               INT. CHARLIE'S STUDIO - EARLY EVENING\n\n                                     KATE\n                         GONE? GONE WHERE?!\n                              (Charlie shrugs)\n                         Charlie we've got to find him!\n\n                                     CHARLIE\n                              (working on a VERY \n                              STERN portrait of \n                              Kate at her computer)\n                         Are you crazy? This is the first \n                         time all week my eyes aren't darting \n                         to the top of my sockets every five \n                         minutes.\n\n                                     KATE\n                         When did he leave?\n\n                                     CHARLIE\n                         I don't know. An hour ago? He said \n                         he wanted to take a walk.\n\n                                     KATE\n                         And you let him?? He's not allowed \n                         to go outside!\n\n                                     CHARLIE\n                         Is he being punished?\n\n                                     KATE\n                         We've got to find him! You stay here \n                         in case he finds his way back. And \n                         while you wait you'd better pray \n                         he's all right. If anything happens \n                         to him, anything at all, EVERYTHING \n                         we've worked for will have been \n                         destroyed.\n\n               She heads out the door. Charlie follows.\n\n               INT. LIVING ROOM - EARLY EVENING\n\n                                     CHARLIE\n                         Kate, calm down.\n\n                                     KATE\n                         And YOU'LL be responsible. Understand?\n                              (she grabs her coat \n                              and purse)\n\n                                     CHARLIE\n                         What's the big deal? Who is this \n                         guy?\n\n               Kate takes a LONG pause.\n\n                                     KATE\n                         Leopold... is not really from Canada.\n\n               EXT. KATE'S APARTMENT BUILDING - LATE AFTERNOON\n\n               Peaceful. The sun sets. Pigeons rest on window sills. \n               Suddenly:\n\n                                     CHARLIE (V.O.)\n                         OH MY GOD!!!\n\n               The pigeons take flight.\n\n               EXT. CENTRAL PARK - EVENING\n\n               Leopold leaves Central Park profoundly lost. Looking both \n               ways in the wrong direction, he crosses the street. SCREECHING \n               brakes, HONKING horns, FURIOUS shouts with Leopold, horrified, \n               caught in the middle. He makes it across shaking and dazed. \n               A motorist pulls along side of him.\n\n                                     WOMAN MOTORIST\n                         You stupid fucking son of a bitch. \n                         Next time I'll hit ya. Fucking moron.\n\n               Leopold GAPES, appalled. A Hansom carriage slowly treads \n               into Central Park. Leopold watches until it disappears.\n\n               INT. KATE'S GREEN A.M.C. PACER - NIGHT\n\n               Kate drives slowly, searching for Leopold. Cars honk with \n               mounting anger.\n\n                                     CABBY\n                         What're ya waiting for lady? An \n                         invitation?\n\n                                     KATE\n                         I'm sorry! I'm sorry!\n\n               She continues searching, trying hard to remain calm.\n\n               EXT. TIMES SQUARE - NIGHT\n\n               Huge buildings. Neon lights flashing. Garbage in bundles. \n               Calvin Klein Ads. In the center of it all, Leopold, jostled \n               BADLY by the crowd, tipping his hat to all the ladies. He \n               enters a deli.\n\n               INT. DELI - NIGHT\n\n               Leopold, appalled by the prices searches for money. He has \n               none.\n\n                                     LEOPOLD\n                              (to the counter man)\n                         $7.95 for a sandwich? Is that correct?\n\n                                     COUNTER MAN\n                         You gotta problem with that?\n\n                                     LEOPOLD\n                         It seems rather pricey to me.\n\n                                     COUNTER MAN\n                         So don't buy one.\n\n                                     LEOPOLD\n                         I shan't.\n\n                                     COUNTER MAN\n                         So shan't!\n\n               He moves on.\n\n                                     LEOPOLD\n                         Yes, I... I would be happy to sample \n                         one however I'm afraid I haven't the \n                         finance with me just now. If I could \n                         establish a credit with you, I will \n                         have someone come round with the \n                         funds tomorrow.\n\n                                     COUNTER MAN\n                         You will gladly pay me Tuesday for a \n                         hamburger today, is that it?\n\n                                     LEOPOLD\n                              (a little confused)\n                         I believe so. Yes.\n\n                                     COUNTER MAN\n                         Get the fuck outta here.\n\n                                     LEOPOLD\n                         I beg your pardon?\n\n                                     COUNTER MAN\n                         Get out. Fuckin' Wimpys piss me off.\n\n                                     LEOPOLD\n                         May I remind you, merchant, that I \n                         am the customer in this establishment \n                         and as such require your attention \n                         and the utmost respect. I do not \n                         accept this modern convention of \n                         desecrating one's patrons with such \n                         contemptuous disregard.\n\n                                     YUPPIE WOMAN\n                         You tell him.\n\n                                     LEOPOLD\n                         Need I add that without our patronage \n                         you would not own that unwashed \n                         counter behind which you spew your \n                         filthy mouth?\n\n                                     COUNTER MAN\n                         Where do you get off? You don't even \n                         have any money.\n\n                                     LEOPOLD\n                         Don't be irrelevant... I'm browsing.\n\n                                     COUNTER MAN\n                         Not in my store you're not.\n\n               He comes out from behind the counter. He's big.\n\n                                     LEOPOLD\n                              (very superior)\n                         Do you intend to physically escort \n                         me out...?\n\n               EXT. STREET - NIGHT\n\n               Leopold is thrown out of the store and on to the street.\n\n                                     LEOPOLD\n                         Did you see what he did? Did you see \n                         that?\n\n               No one responds. Leopold is left sprawled on the street. \n               Thunder is heard.\n\n               EXT. N.Y.C. - NIGHT\n\n               Gargoyles at New York City Library, The Dakota, the Bowery, \n               Alphabet City.\n\n               EXT. CLAIRMOUNT STABLES - 4 A.M.\n\n               Pouring rain. Leopold stands in front of the stables beaten \n               and drenched. A car drives by, screeches to a stop, and \n               hastily backs up along side Leopold.\n\n                                     KATE\n                         Leopold! Leopold, get in.\n\n               Leopold stares at the car. Kate runs out, opens the door and \n               helps him in. She dashes back into the drivers seat.\n\n               INT. CAR - 4 A.M.\n\n                                     KATE\n                              (nearly in tears, \n                              trying to dry him \n                              off)\n                         Leopold! Oh, Leopold thank God you're \n                         all right. I didn't think I'd ever \n                         find you. You had us all so worried. \n                         Oh, Leopold!\n\n               She hits him hard.\n\n                                     KATE\n                         Don't you ever go out again without \n                         my permission, do you hear me? I was \n                         frantic. You could have been killed \n                         a hundred times over. I never would \n                         have known.\n\n               She rests her head on the steering wheel, exhausted. She \n               pulls herself together and looks at him.\n\n                                     KATE\n                         Leopold, are you all right?\n\n                                     LEOPOLD\n                              (looking deep into \n                              her eyes for the \n                              first time)\n                         I wish to go home.\n\n                                     KATE\n                         Okay. I'll get you home in a jiffy.\n\n                                     LEOPOLD\n                              (badly shaken)\n                         No... I wish to go home.\n\n               Kate gently observes Leopold who stares rigidly straight \n               ahead.\n\n               INT. LIVING ROOM - NIGHT\n\n                                     CHARLIE\n                              (on the phone)\n                         I don't know. It's just Leopold. \n                         Like Cher. Or Goofy.\n\n               Kate and Leopold walk in wet and exhausted.\n\n                                     CHARLIE\n                         Never mind they just walked in. Jesus. \n                         You look horrible.\n\n                                     KATE\n                         Charlie, don't start. I haven't been \n                         this angry at you since you got me \n                         into that pyramid thing last year. \n                         If you make a wisecrack I'm going to \n                         burst into flame.\n\n                                     CHARLIE\n                         It wasn't a wisecrack. You do look \n                         horrible.\n\n                                     KATE\n                         I'm too tired for this now. I'll \n                         just save it up and kill you tomorrow. \n                         Help Leopold out of his things and \n                         lets get him to bed.\n\n                                     LEOPOLD\n                         I've something to say. To the both \n                         of you. I... Nothing is what it seems. \n                         After witnessing mere weeks of this \n                         age it is painfully apparent I am \n                         outside of my acquaintance... I don't \n                         know how to proceed. I frankly... am \n                         in need of assistance. I'm sorry. \n                         I'm not very good at this. In the \n                         event you have missed it, I am \n                         apologizing.\n\n               There is a long pause.\n\n                                     CHARLIE\n                         About time.\n                              (he shakes Leopold's \n                              hand reluctantly)\n                         Welcome back.\n                              (he leaves)\n\n                                     KATE\n                         Don't mind him. His heart would be \n                         in the right place if he had a heart. \n                         Surliness runs in my family.\n\n                                     LEOPOLD\n                         I understand. It practically races \n                         through mine.\n\n                                     KATE\n                              (shocked)\n                         Leopold, you made a joke. I mean one \n                         that's not at my expense. That's \n                         good.\n\n               They look at each other just a second too long.\n\n                                     LEOPOLD\n                         We'd better get to bed... That is...\n\n                                     KATE\n                         Yes... I start work...\n                              (she looks at her \n                              watch)\n                         in three and a half hours.\n\n                                     LEOPOLD\n                         Oh, dear.\n\n               They self-consciously head to their respective rooms.\n\n                                     KATE\n                         It's fine. I'm used to it.\n\n                                     LEOPOLD\n                         You mustn't get too used to it. You'll \n                         find life passes you by awfully \n                         quickly.\n\n               Kate is struck by his vulnerability for the first time and \n               is moved. She catches herself quickly however.\n\n                                     LEOPOLD\n                         Thank you for...\n\n                                     KATE\n                              (waving it away)\n                         Oh!\n\n               They stand at their bedroom doors.\n\n                                     LEOPOLD\n                         Well, goodnight then.\n\n                                     KATE\n                         Leopold?... I don't have a clear \n                         handle on this. Perhaps I was wrong \n                         keeping you confined to the apartment \n                         all this time. I don't know when \n                         you'll be able return home... Tomorrow \n                         I'll start preparing you for the \n                         outside world. And... We'll find \n                         your way back. I promise.\n\n               Leopold smiles, still shaken. A beat. They slowly close the \n               doors to their respective rooms.\n\n               INT. HALLWAY - BRIGHT SUNNY MORNING\n\n               Leopold, dressed for an outing knocks on Kate's bedroom door.\n\n                                     KATE (V.O.)\n                         Yes?\n\n               Leopold enters. Kate stands in a slip calmly looking at \n               Leopold. Leopold immediately turns, facing the door.\n\n                                     LEOPOLD\n                         Oh! I beg your pardon. I, I, I, was \n                         merely... I didn't...\n\n                                     KATE\n                         Is there something you want, Leopold?\n\n                                     LEOPOLD\n                         I merely wanted to see... that is, \n                         inquire, on your availability, for \n                         an outing... My assimilation and so \n                         forth.\n\n                                     KATE\n                         Yes, we have a lot of work ahead of \n                         us. I'll be out in a minute.\n\n                                     LEOPOLD\n                         Yes, of course. Splendid.\n\n               He reaches around behind his back and fumbles for the knob. \n               He finally finds it and goes out.\n\n               Kate smiles.\n\n                                                                    CUT TO:\n\n               EXT. N.Y.C. - DAY\n\n               the Brooklyn Bridge, the Chrysler Building, Rockefeller \n               Center, 5th Avenue.\n\n               EXT. 5TH AVENUE - DAY\n\n               Kate and Leopold exit The Gap. Leopold awkwardly wears hip \n               Gap casual clothes, a baseball cap on his head.\n\n                                     LEOPOLD\n                         Are you certain this is correct?\n\n               Kate places the cap backwards on his head. She nods \n               approvingly.\n\n                                     KATE\n                         Certainly I'm certain.\n\n               Leopold watches himself in store windows. He CAN'T comprehend \n               it. Kate leads him into Barney's.\n\n               INT. BARNEY'S - DAY\n\n               Leopold stands before the mirror wearing a classic dark suit. \n               He looks FANTASTIC. A fact that is not lost on Kate.\n\n                                     LEOPOLD\n                         Now really. Isn't this better?\n\n               Kate nods back begrudgingly, her breath taken away.\n\n               EXT. N.Y.C. - DAY\n\n               Lincoln Center, Columbus Circle, Gristedes.\n\n               INT. GRISTEDES MARKET - DAY\n\n               Kate selects a shopping cart, begins to push it.\n\n                                     LEOPOLD\n                         Allow me.\n\n               Kate walks ahead. Leopold, maneuvering a cart with a broken \n               wheel, hasn't the knack and bangs into everyone and everything \n               in the aisle.\n\n                                     LEOPOLD\n                         Sorry. Oops! Careful there. So sorry.\n\n                                                                    CUT TO:\n\n               CLOSE UPS: Leopold scrutinizing vegetables in cans, cereals \n               for kids, bottled water, instant soup, feminine hygiene \n               supplies.\n\n                                                                    CUT TO:\n\n               The check out line. As their groceries are being rung up, \n               Leopold spots The Sun, a newspaper with the headline: Woman \n               Sees Satan in her Microwave Oven. Leopold eagerly shows Kate.\n\n                                     LEOPOLD\n                         Have you seen today's paper?\n\n                                     KATE\n                         Put it back.\n\n                                     LEOPOLD\n                         But...\n\n                                     KATE\n                         Back!\n\n               Leopold reads the paper totally enthralled.\n\n               EXT. STREET - DAY\n\n               Kate and Leopold walk down the street, a bag in each arm. \n               Leopold eyes Kate suspiciously.\n\n                                     LEOPOLD\n                         Dr. Coles, why is it you are not \n                         married?\n\n                                     KATE\n                         Women are longer defined by the men \n                         they're married to, Leopold. I have \n                         a career. I haven't found a man who \n                         fits in with that yet.\n\n                                     LEOPOLD\n                         Yet people still marry?\n\n                                     KATE\n                              (defensively)\n                         I've heard of cases.\n\n               They continue to walk, Leopold noticeably studies Kate. \n               Finally:\n\n                                     LEOPOLD\n                         I suspect there is something wrong \n                         with you.\n\n                                     KATE\n                         There's nothing wrong with me!\n\n                                     LEOPOLD\n                         Perhaps it is the way you present \n                         yourself.\n\n                                     KATE\n                         I don't know what you're talking \n                         about.\n\n                                     LEOPOLD\n                         There is some sort of problem when a \n                         woman reaches thirty and insists on \n                         remaining single.\n\n                                     KATE\n                         You think I'm THIRTY?!\n\n                                     LEOPOLD\n                         What?\n\n                                     KATE\n                         Do I look THIRTY to you?\n\n                                     LEOPOLD\n                         It was an arbitrary number.\n\n                                     KATE\n                         You chose it specifically opposed to \n                         a lower number.\n\n                                     LEOPOLD\n                         I didn't mean it.\n\n                                     KATE\n                         ...Thirty!\n\n                                     LEOPOLD\n                         I apologize... How old are you?\n\n                                     KATE\n                              (sharply)\n                         I'm thirty! But you're the first \n                         person whoever told me I looked it!\n\n                                     LEOPOLD\n                         I'm sorry.\n\n               Leopold spots a formal dress in a store window. He takes a \n               good long look at Kate, smiles, then quickly walks inside. \n               Kate continues down the block.\n\n                                     KATE\n                         And it's not that I insist on \n                         remaining single. Believe me. Everyone \n                         dreams of finding somebody to share \n                         their life with. To give someone all \n                         the love they've been hoarding since \n                         they were a kid. I'm no different. \n                         But one has to be sensible. I have a \n                         career and a life that's filled \n                         with...\n\n               She looks around. Leopold is gone.\n\n                                     KATE\n                         Not again...\n\n               She starts off down the street, stops, and enters ROBERTA'S, \n               an upscale boutique.\n\n               INT. ROBERTA'S - DAY\n\n               Kate races in. Leopold talks with a saleslady.\n\n                                     KATE\n                         What do I have to do? Put a leash \n                         around your neck?\n\n                                     LEOPOLD\n                              (to the saleslady)\n                         She is the woman to whom I was \n                         referring. You see the problem?\n\n                                     SALESLADY\n                              (giving Kate the once \n                              over)\n                         Yep.\n\n                                     KATE\n                              (staring down at her \n                              clothes then back at \n                              the two of them)\n                         What?... What?\n\n               INT. ROBERTA'S - DAY\n\n               From behind the dressing room door, Kate shouts to the others \n               with irritation.\n\n                                     KATE\n                         This is ridiculous. I don't have \n                         time to...\n                              (she shrieks)\n                         Do you know what this dress costs? \n                         Let's get this over with. I'm coming \n                         out. Nobody laugh.\n\n               Kate leaves the dressing room in a huff COMPLETELY UNAWARE \n               that she is STUNNING.\n\n                                     KATE\n                         Satisfied?\n\n               Leopold and the saleslady stare at her with pleasure.\n\n                                     KATE\n                         ...What?\n\n               She turns and looks at herself in the mirror. Leopold stands \n               behind her, pulls back her hair, brushes away her bangs.\n\n                                     LEOPOLD\n                         You have a lovely face.\n\n               Even Kate cannot deny that she is lovely. She stares at \n               herself for a long while.\n\n                                     LEOPOLD\n                              (quietly)\n                         We'll take the dress.\n\n               They become aware of their close proximity. They nervously \n               part.\n\n               INT. LIVING ROOM - LATE AFTERNOON\n\n               Kate sits Leopold down on the sofa. She turns on the TV and \n               hands him the remote control.\n\n                                     LEOPOLD\n                         What is this?\n\n                                     KATE\n                         The drug of the 20th century.\n\n               She aims the remote at the TV, changing channels. He's \n               spellbound.\n\n               INT. DINING ROOM - EARLY EVENING\n\n               Dinner is served. Kate waits patiently for Leopold who sits \n               on the sofa watching the TV.\n\n                                     KATE\n                         Leopold, your dinner's getting cold.\n\n                                     LEOPOLD\n                         I'm coming.\n\n               He does not move a muscle.\n\n               INT. LIVING ROOM - NIGHT\n\n               Kate and Leopold sit on the sofa eating their dinner and \n               watching TV. On the screen, a Looney Tune. Leopold enjoys \n               this especially. Kate reaches for the remote but Leopold \n               grabs it territorially, refusing to relinquish it.\n\n                                     KATE\n                              (making notes)\n                         It's a guy thing.\n\n               INT. LIVING ROOM - NIGHT\n\n               Leopold asleep on the sofa still clutching the remote control. \n               Kate comes in with a blanket and settles it over Leopold. \n               She glances around the room, then slowly bends down close to \n               capture a better look at his face.\n\n               After a moment she catches herself, takes herself in hand \n               and sits down at her computer. She opens her notes and types. \n               Her fingers slow down to a crawl and come to a stop. She \n               looks up at Leopold lost in thought. She smiles.\n\n               Reaching for a soda, she accidentally knocks a picture to \n               the floor. In a SMASHED frame, Kate and CARLSON drunkenly \n               mug for the camera. Kate pales noticeably.\n\n               She looks from the picture to Leopold. Slowly, she begins \n               pecking away at the keys. She does not look up again.\n\n               INT. LAB - LATE AFTERNOON\n\n               Kate gives Leopold a tour of the lab stopping by Dr. Drakes \n               area. Hidden behind chalk boards, calculator paper, and \n               several empty Haagen Dazs containers, Dr. Drake searches for \n               solutions.\n\n                                     KATE\n                         ...Now within that astronomical \n                         structure, Dr. Drake here is searching \n                         for a pathway between your time and \n                         the present. He'll find it too if \n                         his arteries don't harden first.\n\n                                     LEOPOLD\n                         Astounding.\n\n                                     KATE\n                         Once that is discovered, the search \n                         begins for the exact time and date \n                         travel will be possible.\n\n               They move to Dr. Kau's area.\n\n                                     LEOPOLD\n                              (to Dr. Kau)\n                         How are you proceeding?\n\n               Dr. Kau merely grunts. Leopold looks at Kate.\n\n                                     KATE\n                         Don't take it personally. Once Dr. \n                         Kau starts working, you just have to \n                         wait until her batteries run down. \n                         We're all pretty much like that.\n\n               They head into Kate's office.\n\n               INT. KATE'S OFFICE - DAY\n\n               Kate gathers her belongings, Leopold snoops at her notes.\n\n                                     LEOPOLD\n                         The complexity of this equation is \n                         astonishing? Can you really comprehend \n                         all that?\n\n                                     KATE\n                              (simply. Almost \n                              apologetically)\n                         I'm a genius.\n\n                                     LEOPOLD\n                         You're quite exceptional Dr. Coles.\n                              (a beat)\n                         That is to say, you all are.\n\n                                     KATE\n                         Thank you. And may I say that \n                         sometimes, in DIM light, you're not \n                         so bad yourself.\n\n               They stand together, Leopold grinning sheepishly.\n\n                                     KATE\n                         Oh my God! Is that the time? I'm \n                         late. Therapy. Every Tuesday night.\n\n                                     LEOPOLD\n                         May I accompany you?\n\n                                     KATE\n                         You mayn't.\n\n                                     LEOPOLD\n                         I am not certain I understand therapy.\n\n                                     KATE\n                         No one does. That's why therapists \n                         can charge so much.\n\n               As she gathers her belongings, Leopold spots a very high \n               heeled red shoe in Kate's bag.\n\n                                     LEOPOLD\n                         What exactly transpires during \n                         therapy?\n\n                                     KATE\n                         Leopold. A gentleman does not ask \n                         those questions. Come on, we'll get \n                         you home.\n\n                                     LEOPOLD\n                         I am perfectly able to travel homeward \n                         myself.\n\n               Kate looks at him skeptically.\n\n                                     LEOPOLD\n                         Really! I have finance and our \n                         address. I shall take a cabbie.\n\n               Kate hesitates.\n\n                                     LEOPOLD\n                         You are late. I insist. I am NOT a \n                         child. Dr. Coles.\n\n                                     KATE\n                         All right. Don't bite my head off.\n\n               She shakes her head and walks out the door.\n\n               EXT. N.Y.C. STREET - LATE AFTERNOON\n\n               Kate heads down the stairs of a subway station. A few feet \n               behind, Leopold cautiously follows.\n\n               INT. SUBWAY STATION - RUSH HOUR\n\n               Kate waits in line at the turnstile. Leopold, a ways back, \n               grimaces noticeably at the smell.\n\n               Kate heads through. Leopold follows banging painfully into \n               the bar. A NUN hurriedly bumps into him from behind.\n\n               He tries pushing the bar but it doesn't budge. He turns around \n               to step out of line but it is already too long. He stands \n               NOSE to NOSE with the nun.\n\n                                     LEOPOLD\n                         I can't seem to...\n\n                                     NUN\n                              (impatiently)\n                         Oh, for heaven's sake...\n\n               The nun deposits her token and SQUEEZES them both through as \n               the train arrives at a deafening pitch, startling Leopold.\n\n               He spots Kate entering the train and jumps into the car in \n               the nick of time. The train departs, Leopold pressed awkwardly \n               against the glass.\n\n               EXT. N.Y.C. STREET - EARLY EVENING\n\n               Kate races from the subway station, entering the Arthur Murray \n               Dance Studio. Leopold, thoroughly disheveled, follows at a \n               distance.\n\n               INT. DANCE STUDIO - EVENING\n\n               Elderly Blue haired couples chat amongst themselves, men on \n               the right, women on the left. Kate, in dance clothes, out of \n               breath, stumbles in, making a b-line for the women's side.\n\n                                     MRS. PINCUS\n                         I was worried. I thought you weren't \n                         going to make it.\n\n                                     KATE\n                              (smiling happily)\n                         Miss my lesson? This is the only \n                         thing I have to look forward to all \n                         week. Is that a new dress Mrs. Pincus?\n\n               Mrs. Pincus executes a fancy spin, proudly showing off her \n               purchase. Across the room, MR. Pincus beams in anticipation.\n\n               An elderly, overly made up dance instructor enters. She claps \n               her hands together loudly.\n\n                                     INSTRUCTOR\n                         All right, kids. Pair up!\n\n               The men slick back their hair. The women straighten their \n               gowns. Kate stands to the side, self-consciously studying \n               the floor.\n\n               The men take their places on the dance floor. They flick \n               their hand twice, inviting their women to dance. Cooly, \n               elegantly, the women approach their partners. After a while \n               Kate looks up, relieved. She stands alone. Ballroom music \n               plays.\n\n               The couples effortlessly shift between steps and turns. Kate \n               dances with an imaginary partner, stumbling, more than a \n               beat behind, counting, animated, a concentrated YEARNING \n               look spread across her face.\n\n               The instructor approaches with a look of resignation.\n\n                                     INSTRUCTOR\n                         Don't think so much, Katie. FEEL the \n                         music.\n\n                                     KATE\n                              (sweating)\n                         I am!\n\n                                     INSTRUCTOR\n                         Dancing should not be work. It should \n                         be a vacation the body takes from \n                         the mind. Let the music wash over \n                         you.\n\n                                     KATE\n                              (frustrated)\n                         It is!\n\n                                     INSTRUCTOR\n                         Repeat after me: I've got the muusic \n                         in me.\n\n                                     KATE\n                         I've got the muusic in me.\n\n                                     INSTRUCTOR & KATE\n                              (overlapping)\n                         I've got the muusic in me!\n\n                                     INSTRUCTOR\n                         Keep telling yourself that.\n\n               Kate does. Her instructor shakes her head and moves away.\n\n               Across the room, through the window, Leopold watches, moved.\n\n               LEOPOLD'S P.O.V. -- Over the music, beyond the swirling \n               couples, Kate remains in the corner, dancing with her \n               imaginary partner, fighting valiantly for the right steps, \n               muttering to herself, dancing alone.\n\n               INT. LAB - MORNING\n\n               Dr. Kau SLAMS a large book on Dr. Plodder's desk startling \n               him.\n\n                                     DR. KAU\n                         I've located her.\n\n                                     DR. PLODDER\n                         You didn't! Is she all right?\n\n                                     DR. KAU\n                         No. She's really not.\n\n               Photograph of a SWEATSHOP 1896. The conditions are APPALLING. \n               Positioned among the workers, Julia Carlson, thin, ragged, \n               worn out, stares helplessly into the camera.\n\n                                     DR. KAU\n                         It was taken a year after she arrived. \n                         Look at her face! We have to get her \n                         back.\n\n                                     DR. PLODDER\n                         Christine, this morning I spoke with \n                         the head of funding. They're talking \n                         about canceling the project.\n\n                                     DR. KAU\n                         What?! They can't do that!\n\n                                     DR. PLODDER\n                         There's still time. Nothing has \n                         happened yet that can't be undone. \n                         We'll get her back. We'll put this \n                         behind us and we'll get her back.\n\n               The doctors stare at the photograph. Powerless.\n\n                                                                    CUT TO:\n\n               INT. CHARLIE'S STUDIO - DAY\n\n               Charlie and Leopold work at their easels. Leopold sighs \n               HEAVILY.\n\n                                     CHARLIE\n                         Is there something on your mind?\n\n               There is a pause.\n\n                                     LEOPOLD\n                         This is rather difficult for me.\n\n                                     CHARLIE\n                         ...Uh huh...?\n\n                                     LEOPOLD\n                         I have been in the salon contemplating \n                         the reception I have received by the \n                         various tradesmen I have visited. \n                         I've determined I am lacking the \n                         dexterity of modern intercourse.\n\n                                     CHARLIE\n                         Of what??\n\n                                     LEOPOLD\n                         Social skills.\n\n                                     CHARLIE\n                         Oh.\n\n                                     LEOPOLD\n                         I realize our association has been \n                         rather distant and I bear you no ill \n                         will.\n\n                                     CHARLIE\n                         You can imagine my relief.\n\n                                     LEOPOLD\n                         The fact is... I need help.\n\n                                     CHARLIE\n                         Why not ask Kate?\n\n                                     LEOPOLD\n                         I would appreciate the masculine \n                         point of view.\n\n                                     CHARLIE\n                         Why not ask Kate?... That was a joke.\n\n               Leopold looks worried. Charlie puts down his brush.\n\n                                     CHARLIE\n                         Well? Let's see... I guess we could \n                         start by removing that great big \n                         stick from up your... Let's start \n                         with your walk.\n\n                                     LEOPOLD\n                         My walk?\n\n                                     CHARLIE\n                         You don't walk right.\n                              (gently)\n                         You strut.\n\n                                     LEOPOLD\n                              (very defensive)\n                         STRUT?\n\n                                     CHARLIE\n                         Strut strut strut. You walk into the \n                         bathroom it's like I'm watching a \n                         parade. Walk across the room.\n\n                                     LEOPOLD\n                         I will not.\n\n                                     CHARLIE\n                         I know you won't. You'll STRUT. You \n                         asked for my help. Trust me on this.\n\n               As Leopold struts across the room Charlie shakes his head \n               and spontaneously begins to hum Sousa's Stars and Stripes \n               March. Leopold becomes more and more agitated. As the song \n               crescendos:\n\n                                     LEOPOLD\n                         That's enough! Really! You walk.\n\n               Charlie hops up, casually walks around the room and begins \n               to hum a more relaxed version of Stars and Stripes.\n\n                                     CHARLIE\n                              (between choruses)\n                         See? Easy. Relaxed. You try.\n\n               Leopold begins humming the more casual version of the song \n               and mimics Charlie.\n\n                                     CHARLIE\n                         That's better. Now, try to enjoy \n                         your walk. It's a beautiful day. The \n                         sun is shining, the peasants are \n                         singing.\n\n               INT. LIVING ROOM - DAY\n\n               VOICE OVER: Charlie and Leopold joyously singing The Stars \n               and Stripes. As the song builds:\n\n               Charlie enters leading Leopold throughout the room. Leopold \n               matches Charlie EXACTLY step by step so tightly they appear \n               to be one person marching happily about.\n\n                                                                    CUT TO:\n\n               EXT. N.Y.C. - DAY\n\n               Chinatown, Little Italy, chess in Washington Square Park.\n\n               EXT. WASHINGTON SQUARE PARK - DAY\n\n               Leopold and Charlie explore the city. Leopold works diligently \n               on his walk. A beautiful woman walks by in a revealing outfit. \n               Charlie catches Leopold watching her and smiles broadly.\n\n                                     CHARLIE\n                         Interesting?\n\n               Leopold, caught leering, turns away sheepishly and smiles. \n               Charlie pats Leopold on the back. Stops. Pats his back again.\n\n                                     CHARLIE\n                         What the hell is that?\n\n                                     LEOPOLD\n                         What?\n\n                                     CHARLIE\n                         Leopold, are you wearing a corset?\n\n                                     LEOPOLD\n                         Naturally.\n\n               Cracking up, Charlie good-naturedly puts an arm around \n               Leopold's shoulder. Leopold attempts the same pulls away.\n\n               INT. BLOCKBUSTER RECORDS - NIGHT\n\n               With a headset on, Charlie listens to music. Leopold watches.\n\n                                     CHARLIE\n                         What'd ya say was the name of this \n                         number?\n\n                                     LEOPOLD\n                         Tchaikovsky. Waltz of the Flowers.\n\n                                     CHARLIE\n                              (deadpan)\n                         Pretty.\n\n               Charlie stops the music and places a headset over Leopold's \n               ears. Leopold watches calmly. Charlie selects a song. \n               Instantly, Leopold's shoulders rise up to his ears. His mouth \n               opens wide.\n\n                                     CHARLIE\n                         Megadeath. High Speed Dirt.\n\n               After a bit, Charlie turns the music off. Leopold's shoulders \n               go down but his mouth stays wide open. Astonished.\n\n               EXT. CENTRAL PARK - DAY\n\n               Charlie and Leopold walk through the park. A rubber softball \n               hits Leopold squarely on the head.\n\n                                     LEOPOLD\n                         What in the world...?\n\n               A couple race over. The man is BLACK. The woman is WHITE. \n               Their child, ELIZABETH, 7, follows wide eyed and apprehensive.\n\n                                     MAN\n                         Sorry! We're so sorry. Are you hurt?\n\n                                     WOMAN\n                         She's another Babe Ruth. We had no \n                         idea. Are you okay?\n\n               Leopold regards them curiously.\n\n                                     WOMAN\n                         What do you have to say for yourself, \n                         Elizabeth?\n\n                                     ELIZABETH\n                         I'm sorry!\n\n               Leopold stares hard at the modern familial scene. He doesn't \n               speak. After a long moment:\n\n                                     LEOPOLD\n                         Is this your child?\n\n                                     MAN\n                         Yes.\n\n               Charlie braces for the worst. The little girl stares at \n               Leopold.\n\n                                     LEOPOLD\n                         I see.\n\n                                     WOMAN\n                         C'mon honey, lets go.\n\n                                     ELIZABETH\n                         I want my ball.\n\n                                     LEOPOLD\n                         Just a moment!\n                              (bending down to \n                              Elizabeth, firmly)\n                         Pick a hand.\n\n               She picks his right hand. Nothing. She picks his left. \n               Nothing. Leopold looks surprised then pulls the ball from \n               his ear. She takes the ball and smiles at him.\n\n                                     LEOPOLD\n                         My mother's name was Elizabeth.\n                              (then to her parents)\n                         She's a beautiful child. You're very \n                         lucky.\n\n                                     MAN\n                         What do you say, Elizabeth?\n\n               Elizabeth makes an embarrassed face.\n\n                                     MAN\n                         Thank you.\n\n               Charlie and Leopold continue through the park, Leopold lost \n               in thought. Charlie watches him in surprise. They walk on.\n\n               INT. DINING ROOM - NIGHT\n\n               Leopold talks animatedly. On the table -- Pumpkin pies, pizza \n               pies, and pot pies.\n\n                                     LEOPOLD\n                         I understand pumpkin pies, pizza \n                         pies, and pot pies. But I wish someone \n                         would explain Eskimo pies.\n\n               He eats a large spoonful of pudding. Kate and Charlie exchange \n               a worried look.\n\n                                     LEOPOLD\n                         You smoke Camel's, you wear Old \n                         Spices, and you drink Mountains Dew. \n                         It's revolting.\n                              (to Kate)\n                         The pudding tonight is excellent. \n                         Another thing I've noticed, everyone \n                         is in a great rush today. Instant \n                         Oatmeal, Instant Coffee, Speed Stick, \n                         Minute Maid. You'll find there's \n                         much to be said for moderation and \n                         languor.\n\n               He eats another spoonful.\n\n                                     LEOPOLD\n                         Mmmm. Is it tapioca?\n\n                                     KATE\n                         It's margarine.\n\n                                     LEOPOLD\n                              (taking the spoon out \n                              of his mouth)\n                         It's marvelous.\n\n                                     CHARLIE\n                         Well, I'm off.\n\n                                     KATE\n                         Me too. Work to do. Where are you \n                         going?\n\n                                     CHARLIE\n                         I'm meeting everyone over at Caffeine. \n                         It's this coffee house we go to.\n\n                                     KATE\n                         Say hello to Dennis for me.\n\n                                     LEOPOLD\n                         Who is that?\n\n                                     CHARLIE\n                         Dennis is this really good looking \n                         friend of mine who doesn't know Kate's \n                         alive because SHE doesn't know how \n                         to flirt.\n\n                                     KATE\n                         As a rule I don't like to associate \n                         with really good looking people. It \n                         makes me feel really... I don't \n                         know... Smart. But Dennis is a nice \n                         guy.\n\n                                     CHARLIE\n                         And he always picks up the check.\n\n                                     LEOPOLD\n                         Sounds enjoyable. I shall join you.\n\n                                     CHARLIE\n                         What?\n\n                                     KATE\n                         That's a wonderful idea! Leopold \n                         mentioned how he wanted to meet... \n                         People of quality was it?\n\n                                     CHARLIE\n                         Ahhhhh?\n\n                                     LEOPOLD\n                         If you'd rather I didn't go...\n\n                                     KATE\n                         Nonsense! Charlie, you don't want to \n                         hurt Leopold's feelings. He's going \n                         to think you don't want him to go.\n\n                                     CHARLIE\n                         Oh it's not that. It's just that \n                         it's sort of a vulgar crowd, is all. \n                         I'm not sure you'd have such a good \n                         time.\n\n                                     LEOPOLD\n                         A little ribald humor? I'm not as \n                         big a stick in the mud as you might \n                         think! I'd enjoy a gay night out, \n                         kicking up my heels.\n\n               There is an awkward pause. Leopold is so enthusiastic and \n               sincere that despite a feeling of disaster Charlie relents.\n\n                                     CHARLIE\n                         Finish off your Parquet and we'll \n                         go.\n\n               Charlie gives Kate a look of death as we:\n\n                                                                    CUT TO:\n\n               EXT. CAFFEINE - NIGHT\n\n               Charlie and Leopold approach Caffeine, a trendy coffee house. \n               Charlie looks in the window.\n\n                                     CHARLIE\n                         There they all are. Now one more \n                         thing. Throw the words \"like\" and \n                         \"you know\" into a sentence whenever \n                         possible. It's how people talk today.\n\n                                     LEOPOLD\n                         Proper speech does not cease to exist \n                         simply because it is ignored.\n\n                                     CHARLIE\n                         Please?\n\n                                     LEOPOLD\n                         Charles, you needn't fret. I have \n                         the walk down pat. I will not give \n                         myself away. Like.\n\n                                     CHARLIE\n                              (looking in the window)\n                         Oh shit!\n                              (correcting himself)\n                         Shoot.\n\n                                     LEOPOLD\n                         What is it?\n\n                                     CHARLIE\n                         Patrice. See that girl? The blonde \n                         one? She's so inconceivably hot.\n\n               INT. CAFFEINE - NIGHT\n\n               Patrice, a tall blonde sits at a large round table, talking. \n               She is very beautiful.\n\n               EXT. CAFFEINE - NIGHT\n\n                                     LEOPOLD\n                         She's very pretty.\n\n                                     CHARLIE\n                         She's mine.\n\n                                     LEOPOLD\n                         Congratulations.\n\n                                     CHARLIE\n                         Ok not exactly mine. But I saw her \n                         first.\n\n                                     LEOPOLD\n                         I understand.\n\n                                     CHARLIE\n                         Okay. I guess we should go in. I \n                         don't suppose we could tell everyone \n                         you don't speak English?\n\n                                     LEOPOLD\n                         Of course not. Let's go inside.\n\n               Leopold walks his casual walk inside, followed by a very \n               reluctant Charlie.\n\n               INT. CAFFEINE - NIGHT\n\n               Charlie's friends are sitting at a table talking. They are a \n               relaxed and friendly group. Charlie and Leopold approach.\n\n                                     ALL\n                              (ad lib greetings)\n                         Charlie! Where've you been? etc.\n\n                                     CHARLIE\n                         Hi. Uh everyone, this is my friend, \n                         Leo.\n\n                                     BILL\n                         Hey.\n\n                                     LEOPOLD\n                         Hey.\n\n                                     DENNIS\n                         Waz up?\n\n                                     LEOPOLD\n                         Waz up?\n\n                                     PATRICE\n                         How are ya?\n\n                                     LEOPOLD\n                         How are ya?\n\n                                     CHARLIE\n                              (after a beat)\n                         Leo's staying with us for a while.\n\n               Charlie pulls out a chair for Leopold but Leopold sits next \n               to Patrice instead. Patrice takes out her cigarettes.\n\n                                     LEOPOLD\n                         May I?\n\n                                     PATRICE\n                         Help yourself.\n\n               Leopold takes a cigarette, lights one for Patrice, then his \n               own.\n\n                                     LEOPOLD\n                         Thank you, my dear.\n\n                                     CHARLIE\n                              (at a loss)\n                         Um?...\n                              (all look at Charlie)\n                         ...I have nothing to say.\n\n                                     LEOPOLD\n                         You did not tell the truth about \n                         Patrice, Charles.\n\n                                     DENNIS AND BILL\n                         CHARLES??\n\n                                     CHARLIE\n                         What did I tell you, LEO?\n\n                                     LEOPOLD\n                         He informed me you were inconceivably \n                         HOT, but I think you're lovely. \n                         Exceptionally lovely.\n\n                                     PATRICE\n                         Thank you, Leo.\n\n                                     CHARLIE\n                              (to the waitress)\n                         Check please.\n\n               INT. SUBWAY - NIGHT\n\n               The subway car is inhabited solely by Leopold, Charlie, and \n               the oldest Ukrainian woman in New York City. Despite the \n               fact that the train is empty, they are all seated on the \n               same bench.\n\n               Charlie stares straight ahead refusing to even look at \n               Leopold. The Ukrainian woman hangs on every word.\n\n                                     CHARLIE\n                         Just drop it Leopold.\n\n                                     LEOPOLD\n                         But Charles, it is so ridiculous. I \n                         am not interested in her.\n\n                                     CHARLIE\n                         Hah!\n\n                                     LEOPOLD\n                         In any case the problem is not with \n                         me but with you.\n                              (quietly)\n                         You have no idea what it takes to go \n                         about courting a woman. From what \n                         I've witnessed tonight, it is \n                         symptomatic of your entire generation.\n\n                                     CHARLIE\n                              (almost speechless)\n                         You are some piece of work, Leopold.\n\n                                     LEOPOLD\n                         Now I do not wish to get personal...\n\n               Charlie bursts into ironic laughter and looks at the old \n               woman. She rolls her eyes.\n\n                                     LEOPOLD\n                         But you have been of great assistance \n                         to me and I feel this is one area \n                         where I can be of some real help.\n\n                                     CHARLIE\n                         I'm fascinated. Go on.\n\n                                     LEOPOLD\n                         Now, why was I successful with this \n                         young lady and why did you so \n                         miserably fail?\n\n                                     CHARLIE\n                         What makes you think she likes you?\n\n                                     LEOPOLD\n                         Well she gave me the number of her \n                         telephone and I assumed it meant...\n\n                                     CHARLIE\n                         Go on.\n\n                                     LEOPOLD\n                         As I see it, the girl hasn't an \n                         inkling of your intentions. And it's \n                         no wonder. You, Charles, are a Merry \n                         Andrew.\n\n                                     CHARLIE\n                         A what?\n\n                                     LEOPOLD\n                         A Merry Andrew.\n\n                                     CHARLIE\n                         I am not!!\n\n                                     LEOPOLD\n                         Everything plays like a farce to \n                         you. The more wit, the less courage. \n                         I believe the modern woman desires \n                         passion, protection, sensitivity. No \n                         woman wants to be romanced by a \n                         buffoon.\n                              (the old woman shakes \n                              her head)\n                         Banter and repartee are fine but you \n                         must add to that a different sort of \n                         playfulness.\n\n                                     CHARLIE\n                         You think I should pounce?\n\n                                     LEOPOLD\n                         I'm saying you must treat her with \n                         respect. Any oaf can attempt a crude \n                         pass. A woman of Kate's stature would \n                         never respond to an artificial tactic.\n\n                                     CHARLIE\n                         Kate?\n\n                                     LEOPOLD\n                         What?\n\n                                     CHARLIE\n                         You said Kate.\n\n                                     LEOPOLD\n                         I did not.\n\n                                     CHARLIE\n                         Yes you did. Didn't he say Kate?\n\n               The old woman nods.\n\n                                     LEOPOLD\n                         We are discussing your problem.\n\n                                     CHARLIE\n                         Not anymore. You like my sister.\n\n                                     LEOPOLD\n                         Charles...\n\n                                     CHARLIE\n                         She has trouble with men, you know.\n\n                                     LEOPOLD\n                         Perhaps she has not met the right \n                         one.\n\n                                     CHARLIE\n                         She has met the right one. HUNDREDS \n                         of times. But she pulls back. She \n                         cuts herself off. You turn around \n                         and suddenly you're dating a Sphinx.\n\n                                     LEOPOLD\n                         One never can tell.\n\n                                     CHARLIE\n                         Does Kate know how you feel?\n\n                                     LEOPOLD\n                         No...\n\n                                     CHARLIE\n                         Have you made your intentions known \n                         to her?\n\n                                     LEOPOLD\n                         No...\n\n                                     CHARLIE\n                         Who's the Merry Andrew now?! I think \n                         you're all talk and no action. What \n                         are you waiting for?\n\n                                     LEOPOLD\n                         I do not know if there is a future \n                         in it.\n\n                                     CHARLIE\n                         Well Leopold, no one ever does...\n\n                                                                    CUT TO:\n\n               INT. LEOPOLD'S BEDROOM - NIGHT\n\n               Kate enters with an arm load of Leopold's discarded clothes. \n               She drops them on his bed and begins to hang them in his \n               closet.\n\n               A notebook falls from his pants pocket. She puts it on the \n               bureau. A beat. She quickly picks it up, sits on the edge of \n               the bed and starts to read.\n\n                                     KATE\n                              (reading out loud)\n                         Royal family -- Uncouth. Making Out -- \n                         slow soulful kissing... Woman as \n                         equals??\n\n               She flips a page.\n\n                                     KATE\n                         Who drove the Chevy to the levy and \n                         why was it dry?\n\n               Kate smiles. She flips the page.\n\n                                     KATE\n                         Eyes shine when she talks about... \n                         science. Raises her voice when she \n                         knows she's wrong. BOSSY, BOSSY, \n                         BOSSY. Lose my train of thought when \n                         I see her smile. Most beautiful when \n                         she's angry. Honorable heart... \n                         Peasant feet.\n\n               The front door is heard slamming. Kate, alarmed, stuffs the \n               notebook back in Leopold's pocket. She races to the door; \n               glances back at the notebook, turns off the light and scurries \n               from the room.\n\n               INT. HALLWAY - LATER THAT NIGHT\n\n               The corridor is darkly lit. Kate leaves the bathroom as \n               Leopold enters. They collide and separate but remain close \n               together. Both are dressed in pajamas and speak softly.\n\n                                     KATE\n                         Ooops. Bread and butter.\n\n                                     LEOPOLD\n                         What's that?\n\n                                     KATE\n                         Bread and butter. It's an old \n                         saying... Well not to you I guess. \n                         You say it when you pass someone in \n                         a cramped space. As close as bread \n                         and butter.\n\n                                     LEOPOLD\n                         I see.\n\n                                     KATE\n                         So. Did you have a good time last \n                         night?\n\n                                     LEOPOLD\n                         It was very interesting.\n\n                                     KATE\n                         Did you find that person of quality?\n\n               Leopold looks at her a moment.\n\n                                     LEOPOLD\n                         Yes. I did.\n\n                                     KATE\n                         Well... fine.\n                              (there is a pause)\n                         I guess it's time to turn in.\n\n                                     LEOPOLD\n                         Yes.\n\n                                     KATE\n                         Goodnight.\n\n               She reaches her door. Leopold stops her.\n\n                                     LEOPOLD\n                         Kate?\n\n               She turns. Leopold grasps for the words but the habit of \n               inaction returns.\n\n                                     LEOPOLD\n                         Goodnight.\n                              (he slowly closes the \n                              door)\n\n               INT. PATRICE'S APARTMENT BUILDING - DAY\n\n               Charlie stands at Patrice's door with a large painting. He \n               looks over at Leopold hiding the next doorway over. Charlie \n               knocks. She opens the door.\n\n                                     CHARLIE\n                         Hi. I brought you some flowers.\n\n               He hands her the flower filled painting.\n\n                                     PATRICE\n                         Charlie!\n\n                                     CHARLIE\n                         Miss Wochuchowski? I was wondering \n                         if you would do me the great honor \n                         of accompanying me to the cinema \n                         tonight. And allowing me the privilege \n                         of escorting you to dinner afterwards.\n\n               Patrice shyly studies the painting.\n\n                                     PATRICE\n                         It's beautiful.\n\n               Charlie quickly looks at Leopold pleadingly. He really does \n               not want to say this next part. Leopold, however, is adamant.\n\n                                     CHARLIE\n                              (deadpan)\n                         Gracing me with your conversation \n                         and company would mean the world to \n                         me.\n\n               There is a long pause. Patrice watches Charlie in disbelief.\n\n                                     PATRICE\n                         Um... 7:00?\n\n                                     CHARLIE\n                         7:00 is fine. I'll call for you then.\n\n               They smile at each other for a long moment.\n\n                                     LEOPOLD\n                              (silently mouthing)\n                         Goodbye.\n\n                                     CHARLIE\n                         Goodbye.\n                              (she closes the door)\n                         It worked!\n\n                                     LEOPOLD\n                         Of course it did.\n\n                                     CHARLIE\n                         Leopold, I... I'm... I have no idea \n                         what to do next!\n\n                                     LEOPOLD\n                         Charles. Leave everything to me.\n\n                                     CHARLIE\n                         Not so fast, buddy. You're next.\n\n               INT. LIVING ROOM - DAY\n\n               Kate is by the bookshelf gathering reference books on time \n               and space. Leopold enters. He is suddenly embarrassed and \n               doesn't know how to proceed.\n\n                                     LEOPOLD\n                         Good morning.\n\n                                     KATE\n                         Good morning. You're up early.\n\n               She moves to her computer on the other side of the room. \n               Leopold follows. Before she can sit down, Leopold pulls out \n               her chair. She falls to the ground. He rushes to her side \n               immediately.\n\n                                     LEOPOLD\n                         I'm terribly sorry!!\n\n                                     KATE\n                         Happens all the time...\n\n               She opens a reference book and slowly begins typing at her \n               computer. There is a pause.\n\n                                     LEOPOLD\n                         Dr. Coles?... ah, Kate? I was \n                         wondering...\n\n               She stops working and looks at Leopold.\n\n                                     LEOPOLD\n                         What it is you're working on.\n\n                                     KATE\n                         Oh. It's my computer.\n\n               She resumes her work.\n\n                                     LEOPOLD\n                         I see. Actually I meant the work \n                         itself.\n\n                                     KATE\n                         I'm researching the correlations \n                         between your time and the present.\n\n               Leopold stares blankly.\n\n                                     KATE\n                         I'm TRYING to get you home, Leopold.\n\n                                     LEOPOLD\n                         Oh.\n\n               Charlie peaks in, signaling Leopold, spurring him on.\n\n                                     LEOPOLD\n                         I have never seen a woman work as \n                         diligently and extensively before.\n\n                                     KATE\n                         It's made me the man I am today.\n\n                                     LEOPOLD\n                         It's quite a beautiful day, have you \n                         noticed? Perhaps you would permit \n                         yourself some time off and grant me \n                         the privilege of escorting you around \n                         the city this fine Spring afternoon.\n\n                                     KATE\n                         Oh, I'd love to but I can't. I've \n                         got too much work to do. Ask Charlie \n                         though. He'll go with you.\n\n                                     LEOPOLD\n                         I'm afraid it really wouldn't be the \n                         same. It is YOUR company I am seeking.\n\n               Surprised, Kate turns around and looks at Leopold.\n\n                                     KATE\n                              (gently)\n                         Oh, Leopold. I'm so sorry. I can't.\n\n                                     LEOPOLD\n                         I see. Some other time then.\n\n                                     KATE\n                         Yes... Thank you.\n\n               Leopold sits at the far end of the room. Kate takes a moment \n               then resumes typing. She STOPS and sits back in her chair. \n               After a long moment, she subtly unplugs the computer with \n               her foot and starts banging on the top of it.\n\n                                     KATE\n                         Oh for crying out loud. Would you \n                         look at this? Leopold? The computer's \n                         on the blink again.\n                              (she bangs harder)\n                         Cheap piece of equipment. I can't...\n\n                                     LEOPOLD\n                         Maybe if you...\n\n                                     KATE\n                         NO, no, it does this all the time. \n                         Just have to wait it out.\n\n                                     LEOPOLD\n                         I see.\n\n                                     KATE\n                         Darn.\n\n                                     LEOPOLD\n                         ...Perhaps it is a sign?\n\n                                     KATE\n                         Oh, you think?\n                              (she smiles at Leopold)\n\n               EXT. CENTRAL PARK - DAY\n\n               Leopold trots his horse expertly along the horse path. Kate \n               follows, clutching the horses neck, bouncing like a clown.\n\n                                     KATE\n                         I... I must have gotten a funny \n                         horse...\n\n               Leopold turns and rides around Kate.\n\n                                     LEOPOLD\n                         Allow me.\n\n               EXT. CENTRAL PARK - DAY\n\n               Bethesda fountain. Boats on Central Park Lake. Couples in \n               Sheeps Meadow.\n\n               Holding the reins of Kate's horse in one hand, Leopold grasps \n               Kate's waist with the other as they ride a single horse \n               through the greenery of Central Park.\n\n               EXT. MOVIE THEATRE - THE THALIA - DAY\n\n               A revival house. On the Marquee: \"The Tenuous Duke\" starring \n               Ronald Coleman.\n\n               INT. MOVIE THEATER - DAY\n\n               Kate and Leopold eat popcorn, Milk Duds, M & M's, and large \n               drinks. The lights go down and the movie begins.\n\n               The enormity of the medium strikes Leopold at once. He \n               involuntarily leans back in his chair grabbing Kate's \n               shoulder, watching attentively. After a bit:\n\n                                     LEOPOLD\n                         Is that supposed to be my hair? Do \n                         you see how they think my hair looks?\n\n               Kate looks over at Leopold and nods. Through his eyes, she \n               too experiences movies for the first time. She moves close \n               to him.\n\n               EXT. N.Y.C. - DAY\n\n               Grammercy Park, The Guggenheim Museum, Central Park Plaza, \n               The Metropolitan Museum.\n\n               EXT. METROPOLITAN MUSEUM - DAY\n\n               Kate and Leopold bound up the steps, entering the museum.\n\n               INT. MUSEUM - DAY\n\n               Modern art exhibit. Leopold stares blankly at an empty white \n               canvas. He turns to Kate questioningly.\n\n                                     KATE\n                         That's simplicity in it's purest \n                         form. It speaks volumes in it's \n                         nothingness. Whiteness representing \n                         emptiness. Hopelessness. It's bleak. \n                         Bleak!\n\n               Leopold eyes the painting skeptically. They move to the next \n               object d'art. A toilet.\n\n                                     LEOPOLD\n                         Aaand this represents...?\n\n               They burst into giddy laughter.\n\n                                     KATE\n                         Absolutely nothing.\n\n               They round the corner, moving to the next room. Leopold's \n               smile fades.\n\n               CLOSE UP: A painting of privileged Victorian society.\n\n               Shaken, he gazes at a painting in a dream-like state.\n\n                                     LEOPOLD\n                              (very quietly)\n                         I'd almost forgotten how beautiful \n                         it was. Truly. Beautiful.\n\n               Kate smiles sadly at Leopold. They slowly walk out.\n\n               INT. LIVING ROOM - NIGHT\n\n               We hear keys in the lock and laughter outside as Kate and \n               Leopold enter.\n\n                                     LEOPOLD\n                              (laughing)\n                         M & M's, CBS, FBI.\n\n                                     KATE\n                         VIP, VHS, VCR.\n\n               They collapse on the couch.\n\n                                     LEOPOLD\n                         Ah, JFK, PDQ, XYZ.\n\n                                     KATE\n                         I don't know. K.D. Lang.\n\n                                     LEOPOLD\n                         I don't know how you keep up with \n                         it. I'm exhausted.\n\n                                     KATE\n                         So am I.\n\n                                     LEOPOLD\n                         I'll tell you what. Why don't I \n                         prepare dinner tomorrow night? I \n                         never have before. I mean even before \n                         I hit town. \"Hit town\" How's that? I \n                         can't imagine what it'll taste like, \n                         but I don't think it will be any \n                         worse than your cooking.\n\n                                     KATE\n                         Leopold, I have a date tomorrow night.\n\n                                     LEOPOLD\n                         I see.\n\n                                     KATE\n                         A blind date.\n\n                                     LEOPOLD\n                         Oh, I'm so sorry.\n\n                                     KATE\n                         No, that just means I haven't met \n                         him before. It was set up through \n                         friends.\n\n                                     LEOPOLD\n                         Ah!\n\n                                     KATE\n                         A hazard of single life... I'm turning \n                         in.\n\n               Kate gets up. Leopold automatically stands.\n\n                                     LEOPOLD\n                         Another time then.\n\n                                     KATE\n                         I'm sorry.\n\n                                     LEOPOLD\n                         It's quite all right.\n\n               As she gets to the door, she stops.\n\n                                     KATE\n                         Leopold? I had a wonderful time today. \n                         I can't remember the last time I \n                         took the day off and just played. \n                         I'd forgotten how beautiful this \n                         city can be... I want to thank you \n                         for that.\n\n                                     LEOPOLD\n                         The pleasure was mine.\n\n               Kate smiles at Leopold and goes out.\n\n               INT. LIVING ROOM - NIGHT\n\n               Charlie, in a tie, is standing with Leopold at the dining \n               room table. Kate wearing too much makeup for her date, runs \n               into the bathroom in a BRIGHT RED DRESS.\n\n                                     CHARLIE\n                         It's a very fancy restaurant, Leopold. \n                         Are you sure you can teach me \n                         everything there is to know?\n\n                                     KATE\n                              (from the bathroom)\n                         Just don't swipe the silverware and \n                         give yourself away.\n\n                                     CHARLIE\n                         Nobody's talking to you.\n\n                                     LEOPOLD\n                         It is very simple. I will be your \n                         date. Just behave as you normally \n                         would and I'll correct you along the \n                         way. Now, escort me in.\n\n               Charlie and Leopold move across the room. After a beat, \n               Charlie magnanimously gestures for Leopold to go first. \n               Leopold gives his approval. Kate rushes out of the bathroom \n               in a tight BLACK dress.\n\n               Leopold and Charlie elegantly walk to the table. Charlie \n               sits down, pleased. Leopold remains standing, incensed.\n\n                                     CHARLIE\n                         Now what?\n\n               Leopold takes a cloth napkin, hits Charlie upside the head. \n               Hard.\n\n                                     LEOPOLD\n                         Pull the chair for a lady! Clod.\n\n                                     KATE (V.O.)\n                         No name calling.\n\n                                     LEOPOLD\n                              (to Kate)\n                         Well, really!\n\n               Charlie stands up and pulls out the chair. As Leopold sits, \n               Charlie pushes the chair in to hard.\n\n                                     LEOPOLD\n                         You're not shoveling coal into a \n                         furnace, Charles. Glide the chair in \n                         gently. Gently. Try it again.\n\n               Charlie gently glides Leopold to the table. He remains \n               standing, not sure what to do next.\n\n                                     LEOPOLD\n                         Well, sit down!\n\n                                     CHARLIE\n                         Now don't burst a vein or anything, \n                         but there are quite a few knives and \n                         forks here. How do I know what each \n                         one's for?\n\n                                     LEOPOLD\n                         Merely start from the outside and \n                         work your way in.\n\n                                     CHARLIE\n                         What kind of beer should I order?\n\n                                     LEOPOLD\n                         Beer!\n\n                                     CHARLIE\n                         I WAS KIDDING!\n\n                                     KATE\n                         How do I look?\n\n               Leopold and Charlie stand. Kate poses in the gown picked out \n               by Leopold. Leopold smiles brightly.\n\n                                     LEOPOLD\n                         You look exquisite, Katherine.\n\n                                     KATE\n                              (almost sadly)\n                         Thank you, Leopold.\n\n               She looks at Leopold not knowing what to say. Finally\n\n                                     CHARLIE\n                         This is a tie I'm wearing.\n\n                                     KATE\n                         You look very nice, Charlie.\n\n                                     CHARLIE\n                         Yes. I know.\n\n               The doorbell rings.\n\n                                     KATE\n                         That must be him.\n\n                                     LEOPOLD\n                         Your bland date?\n\n                                     KATE\n                         Blind date.\n\n                                     CHARLIE\n                         Remember to breathe, Kate. And don't \n                         use to many big words. You'll scare \n                         the poor slob away.\n\n                                     KATE\n                              (moving to the door)\n                         This is always the scary part.\n                              (she sings)\n                         \"Open the door to my, Mystery Date.\"\n\n               She opens the door and looks straight up. Leopold and Charlie \n               peer in closer to get a better look. In the doorway stands \n               LARRY, great looking, very tall, a winner.\n\n                                     LARRY\n                         Hi. Kate?\n\n                                     KATE\n                         Larry?\n\n               Kate turns back to the others with a frozen smile.\n\n                                     KATE\n                         Well, I'm off.\n\n                                     LEOPOLD\n                              (giving Larry the \n                              once over)\n                         Kate, may I have a word with you?\n\n                                     KATE\n                         Now?\n\n                                     LEOPOLD\n                         Yes.\n                              (as they cross the \n                              room)\n                         I DON'T like the look of him.\n\n                                     KATE\n                         What are you talking about?\n\n                                     LEOPOLD\n                         Cad. I can spot one a mile away.\n                              (he helps her with \n                              her coat)\n                         I shall escort you out myself. I \n                         will act as your chaperone.\n\n                                     KATE\n                         That isn't necessary. I'll be fine.\n\n                                     LEOPOLD\n                         It is no trouble.\n\n                                     KATE\n                         Goodnight, Leopold.\n\n                                     LEOPOLD\n                         But...\n\n                                     KATE\n                         Goodnight.\n\n               She is gone. Leopold stares after her, dejected.\n\n               INT. SPORTS BAR - NIGHT\n\n               Kate and Larry are led to their table. Larry sits down. Kate \n               remains standing.\n\n                                     LARRY\n                              (friendly)\n                         Sit down.\n\n                                     KATE\n                              (sighs)\n                         Thank you.\n                              (she sits)\n\n                                     LARRY\n                         So. How am I doing?\n\n                                     KATE\n                         I beg your pardon?\n\n                                     LARRY\n                         How am I doing? First date. You \n                         pleased? You disappointed?\n\n                                     KATE\n                         Undecided.\n\n                                     LARRY\n                         I see.\n\n               He snaps his fingers to get the waiters attention startling \n               Kate. She laughs nervously.\n\n                                     LARRY\n                         So. What did Jeannie say about me?\n\n                                     KATE\n                         About you? Ah, she said you were \n                         tall.\n\n                                     LARRY\n                         6'3.\n\n                                     KATE\n                         And nice looking.\n\n                                     LARRY\n                         Thank you.\n\n                                     KATE\n                         Thank her. And that you persevere \n                         ardently on Wall Street.\n\n                                     LARRY\n                         Well, I work there...\n\n                                     KATE\n                              (after a beat)\n                         That must be very interesting.\n\n                                     LARRY\n                              (laughing)\n                         You've obviously never worked on \n                         Wall Street.\n\n                                     KATE\n                              (laughing along for \n                              the hell of it)\n                         No.\n\n               Their laughter subsides. After a beat:\n\n                                     LARRY\n                         What else did Jeannie say about me?\n\n               INT. THE FOUR SEASONS - NIGHT\n\n               The Maitre d' of this very fancy restaurant shows Charlie \n               and Patrice to their seats. Charlie motions Patrice to go \n               first just as Leopold has instructed.\n\n               The Maitre de pulls out Patrice's chair. Charlie gives him a \n               look to back off. Charlie effortlessly glides Patrice to the \n               table and takes his seat.\n\n                                     PATRICE\n                         Have I told you how much I liked \n                         your painting?\n\n                                     CHARLIE\n                              (beaming)\n                         Twice.\n\n                                     PATRICE\n                         If you get tired of hearing about \n                         it, let me know. I have to admit I \n                         was sort of surprised when you called. \n                         I didn't think you liked me, Charlie.\n\n                                     CHARLIE\n                         When I first saw you, I thought...\n                              (he makes his jaw \n                              drop down to the \n                              floor)\n\n                                     PATRICE\n                         What do you think now?\n\n               Charlie smiles and places her hand over his heart. Then he \n               makes his jaw drop again. Patrice laughs happily.\n\n               INT. SPORTS BAR - NIGHT\n\n               Kate and Larry are eating their dinner.\n\n                                     KATE\n                         Aaand that's about all Jeannie said. \n                         What did Jeannie say about me?\n\n                                     LARRY\n                              (smiling)\n                         She said you were enormously sexy, \n                         had a great body, but you don't put \n                         out.\n\n                                     KATE\n                         Quite a compelling portrait.\n\n                                     LARRY\n                              (turning on the charm)\n                         Would you say it's an accurate \n                         portrait?\n\n                                     KATE\n                              (leaning into Larry)\n                         A masterpiece.\n\n               INT. LIVING ROOM - NIGHT\n\n               Leopold slowly carries a dinner tray to the dinning room \n               table. He moves to the window and looks out. After a while \n               he pours a glass of wine.\n\n               INT. SPORTS BAR - NIGHT\n\n               As they eat their dinner Larry drones on.\n\n                                     LARRY\n                         So this guy wants to invest $50,000 \n                         in a stock that's no good. Here's \n                         what I do...\n\n               Kate stares absentmindedly at Larry, her mind somewhere else. \n               She looks down at the fork in her hand. She switches to the \n               proper one, reflecting on Leopold's etiquette. She notices \n               her napkin lying flat on the table. She reaches for it.\n\n               INT. LIVING ROOM - NIGHT\n\n               Leopold unfolds his napkin and puts it on his lap. He begins \n               to eat his dinner. Slowly. Elegantly. Alone.\n\n               INT. SPORTS BAR - NIGHT\n\n               Kate places the napkin on her lap. She stares at it a long \n               while. Finally she looks up at Larry.\n\n               EXTREME CLOSE UP OF LARRY\n\n                                     LARRY\n                         I'm telling you the guy was a DICK! \n                         A total ASSHOLE!\n\n                                     KATE\n                              (jarred awake)\n                         Who?\n\n                                     LARRY\n                         Jeff Murray. The guy I've been talking \n                         about. Hello?\n\n                                     KATE\n                              (realizing her feelings \n                              for Leopold, smiling \n                              radiantly at Larry)\n                         Goodbye.\n\n               Then as she leaves, a parting shot.\n\n                                     KATE\n                         Don't get up.\n\n               INT. LIVING ROOM - NIGHT\n\n               Sound of keys in the lock, then Kate bursts through the door.\n\n                                     KATE\n                         Leopold?\n\n               The living room is dark and empty. She goes through the living \n               room, past the hallway, into the bedroom.\n\n                                     KATE\n                         Leopold?\n\n               His bedroom is empty. He is not there.\n\n                                     KATE\n                         Oh, Leopold...\n\n               She runs into Charlie's studio and stops short.\n\n               Next to Charlie's stern paintings, Leopold's portrait of \n               Kate shines in the moonlight. She wears an antique dress. \n               She is lovely. Kate sees herself as Leopold sees her and is \n               touched. She turns and collides head on with Leopold.\n\n                                     KATE\n                         Oh!\n\n                                     LEOPOLD\n                         Bread and butter.\n\n               He is wearing gloves and an apron. He rubs his bruised head, \n               inadvertently leaving a trail of suds along his face.\n\n                                     LEOPOLD\n                         You're back early. Did you enjoy \n                         your date?\n\n                                     KATE\n                              (happily)\n                         No.\n\n               She moves in close, trying to remove the soap from his face.\n\n                                     KATE\n                         Here, you've got some...\n\n               He wipes his face making it much worse.\n\n                                     LEOPOLD\n                         Is it gone?\n\n                                     KATE\n                              (laughing)\n                         No.\n\n               She uses the apron to wipe away the soap. They gaze at each \n               other and become serious.\n\n                                     KATE\n                              (softly)\n                         A funny thing happened to me on my \n                         bland date this evening, Leopold. I \n                         really can't explain it. This puffed-\n                         up, puritanical, blundering, greenhorn \n                         kept popping into my mind all night \n                         long at the most inopportune times. \n                         I couldn't get rid of him.\n\n                                     LEOPOLD\n                         How inconsiderate.\n\n                                     KATE\n                         Yeah, it was. The harder I tried, \n                         the more persistent he became. He's \n                         conceited and inflated and unseasoned \n                         and it doesn't seem to matter... \n                         He's 134 years old but I can't get \n                         him out of my head.\n\n                                     LEOPOLD\n                         Is he there right now?\n\n                                     KATE\n                         Right here. Larger than life.\n\n                                     LEOPOLD\n                         I'll protect you...\n\n               They kiss. A long romantic passionate kiss.\n\n                                     LEOPOLD\n                         Dr. Coles, would you grant me license \n                         to dine with you tomorrow evening at \n                         eight o'clock?\n\n                                     KATE\n                         Permission granted.\n\n                                     LEOPOLD\n                         Until tomorrow, then.\n\n               They separate. A beat. Leopold gestures for Kate to go first. \n               They head down the hallway together into their separate rooms.\n\n               INT. LIVING ROOM - NIGHT\n\n               The table clock chimes eight times. Leopold enters from the \n               kitchen dressed perfectly in the most UP TO DATE style. He \n               carries a casserole dish.\n\n               A second later Kate enters from the hallway. She is wearing \n               an OLD FASHIONED, ANTIQUE DRESS. She looks lovely.\n\n                                     LEOPOLD\n                              (a little startled)\n                         You look beautiful.\n\n                                     KATE\n                         YOU do. What have you got there?\n\n               Leopold opens the casserole dish.\n\n                                     KATE\n                         Hamburger Helper!\n\n                                     LEOPOLD\n                         I know you like it.\n\n               Kate smiles. She looks behind him into the kitchen. A COLOSSAL \n               MESS. Leopold lights the candles and pulls out her chair. \n               This time she's prepared. He slides her chair to the table.\n\n               INT. LIVING ROOM, LATER THAT NIGHT\n\n               The candles have burned down, casting a romantic glow \n               throughout the apartment. Louis Armstrong's \"What a Wonderful \n               World\" plays. Kate and Leopold sit on the couch sipping wine.\n\n                                     LEOPOLD\n                         Tell me more.\n\n                                     KATE\n                         Um, where was I? So after my father \n                         died I had to go to work.\n\n                                     LEOPOLD\n                         Have you had many jobs?\n\n                                     KATE\n                         Many. I got fired from all of them. \n                         I'm the most unskilled person I know. \n                         But they were just survival jobs \n                         while I was still in school. I always \n                         knew I wanted to go into science \n                         like my father. And I did.\n\n                                     LEOPOLD\n                         Do you miss him?\n\n                                     KATE\n                         I think about him every day. He was \n                         courtly, just like you.\n\n                                     LEOPOLD\n                         I think you are a remarkable woman \n                         Katherine Coles.\n\n                                     KATE\n                         You just don't get out much. You'd \n                         be surprised how remarkable I'm not.\n\n                                     LEOPOLD\n                         No, it is you who would be surprised.\n\n               They kiss. Anxiously they stare into each other's eyes. They \n               kiss again. Slowly, Kate leads him to her bedroom door. They \n               look at each other, deciding.\n\n               Deliberately, cautiously, Kate opens the door.\n\n                                     LEOPOLD\n                         Kate...\n\n               Kate puts her fingers over Leopold's lips. Gently she leads \n               him inside. They slowly embrace as the door closes.\n\n               INT. BEDROOM - THE NEXT MORNING\n\n               Sunlight floods the room. Clothes are scattered about. Two \n               figures lie curled up together sleeping in bed. One of the \n               figures rolls around. The covers are pulled back revealing:\n\n                                     CHARLIE\n                         Good morning.\n\n                                     PATRICE\n                         Morning.\n\n               They kiss.\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM - MORNING\n\n               Leopold wearing a bathrobe is pouring coffee. The table is \n               set for a huge breakfast. Kate also in a robe enters from \n               the hallway. There is a moment of awkwardness as they see \n               each other for the first time.\n\n                                     KATE\n                         Morning.\n\n                                     LEOPOLD\n                         Good morning.\n\n               They kiss shyly. Kate notices the feast.\n\n                                     KATE\n                         Look what you've done!\n\n                                     LEOPOLD\n                         It's nothing.\n\n                                     KATE\n                         Nothing? My own mother never made me \n                         a breakfast like this.\n\n                                     LEOPOLD\n                         I will have to have a talk with her.\n\n                                     KATE\n                         Leopold...\n\n                                     LEOPOLD\n                         Kate...\n\n                                     KATE\n                         About last night...\n\n                                     LEOPOLD\n                         Please sit down.\n\n               He pulls out a chair for her and kneels beside her.\n\n                                     LEOPOLD\n                         Kate, I had never before been a \n                         considerate man. I had, with \n                         astonishing complacency, squandered \n                         my life, waiting for some incentive \n                         to force me into action. You have \n                         made me see how rare our time here \n                         really is. I am most beholden to you \n                         Kate. And always will be.\n\n                                     KATE\n                         I sense the word \"BUT\" entering into \n                         this any minute now.\n\n               Leopold takes her hands in his. She looks at him defensively, \n               bracing for worst.\n\n                                     LEOPOLD\n                         Do me the honor Katherine, of becoming \n                         my wife.\n\n               Kate lets out a very girlish, high pitched scream\n\n                                     LEOPOLD\n                         Shall I take that as a \"yes\"?\n\n                                     KATE\n                         Leopold! Did you just ask me to marry \n                         you?\n\n                                     LEOPOLD\n                         I love you, Kate.\n\n                                     KATE\n                         That's entirely beside the point... \n                         You're moving way too fast here. \n                         Shouldn't we date first? I mean it's \n                         obvious the first one went well...\n\n                                     LEOPOLD\n                         Where I come from that's pretty much \n                         the way it works.\n\n                                     KATE\n                         Leopold, even though last night we... \n                         loved each other, that doesn't mean \n                         this morning we're engaged. It just \n                         doesn't work that way now.\n\n                                     LEOPOLD\n                              (taking a ring off \n                              his fingers and \n                              placing it on hers)\n                         I have loved you since I first set \n                         eyes on you. I cannot imagine my \n                         life without you beside me. I want \n                         to marry you, Kate and make an honest \n                         woman of you.\n\n                                     KATE\n                         Oh Leopold, sit down.\n\n               They switch places. Leopold sits and Kate kneels beside him.\n\n                                     KATE\n                         Relationships these days are much \n                         more complicated than that. Women \n                         today have certain freedoms that men \n                         have been taking advantage of for \n                         centuries. You must have been aware \n                         of that. If you think about it \n                         clearly, it should be obvious to you \n                         that marriage between us is out of \n                         the question.\n\n                                     LEOPOLD\n                         Do you not love me Kate?\n\n                                     KATE\n                              (almost inaudible)\n                         Don't ever think that...\n\n                                     LEOPOLD\n                         Then consider my proposal.\n\n                                     KATE\n                         I'll think it over but I can tell \n                         you now the answer is...\n\n               He kisses her. It's impressive.\n\n                                     KATE\n                              (out of breath)\n                         Possibly.\n\n                                     LEOPOLD\n                              (a knowing smile)\n                         I need you beside me. I will not \n                         give up easily.\n\n                                     KATE\n                              (smiling)\n                         Do what you have to do...\n\n               Charlie enters. Kate and Leopold become extremely \n               selfconscious.\n\n                                     CHARLIE\n                         Morning.\n\n                                     LEOPOLD AND KATE\n                              (too casual and too \n                              chipper)\n                         Morning!\n\n               Charlie is immediately aware that something is not quite \n               right. He studies the two of them and nonchalant sits at the \n               table. Kate and Leopold serve themselves breakfast.\n\n                                     LEOPOLD\n                              (to Kate)\n                         Coffee?\n\n               Kate nods. As Leopold pours, they look at each other shyly.\n\n                                     CHARLIE\n                              (after a pause)\n                         I would like some coffee.\n\n                                     KATE\n                         Of course. Say when.\n\n               She pours Charlie's coffee until it overflows.\n\n                                     CHARLIE\n                              (deadpan)\n                         When.\n\n                                     KATE\n                         Sorry.\n\n               As Kate wipes up the table, Charlie notices her ring. He \n               eyes Leopold suspiciously. Leopold concentrates on his plate.\n\n               Charlie gives Kate a questioning glance. She smiles at him, \n               looking both innocent and guilty at the same time. After a \n               beat:\n\n                                     CHARLIE\n                         Uh huh.\n\n               All smile privately and sip their coffee without another \n               word.\n\n                                                                    CUT TO:\n\n               INT. LAB - NIGHT\n\n               Buried behind open books and crumpled up paper, Kate labors \n               in earnest.\n\n               She stops suddenly, almost violently, and studies the notes \n               in front of her. The coffee cup falls from her hand and \n               breaks.\n\n                                     DR. KAY\n                              (calling from her \n                              office)\n                         Kate, are you all right?\n\n                                     KATE\n                         Fine! I'm fine.\n\n               She covers her papers and self consciously cleans up her \n               mess. She sits down slowly and peeks at her notes. She has \n               SOLVED THE PUZZLE that will send Leopold back.\n\n               She looks up in disbelief and glances through her window \n               around the lab. Everyone is hard at work. Helplessly, she \n               stares back at the paper on her desk.\n\n               She pulls open her drawer and takes out the picture of \n               Carlson. She stares at it for a long time. She opens her \n               mouth to call for the others, stops, and looks at the photo.\n\n               Slowly, with great indecision, Kate crumples up the paper. \n               She returns the picture to the drawer. After a long moment, \n               she opens a book, feigning research, her mind a million miles \n               away.\n\n               INT. KATE'S BEDROOM - NIGHT\n\n               Leopold and Kate sit on her bed watching David Lettering. \n               Kate clutches her pillow close to her. She looks over at \n               Leopold concentrating on the TV with furrowed brow. She smiles \n               sadly. She takes her pillow and flings it off her bed. She \n               snuggles up to Leopold. They watch TV. Together.\n\n               EXT. N.Y.C. - DAY\n\n               Central Park in full bloom, Botanical Gardens, The Frock \n               Museum.\n\n               INT. RESTAURANT - DAY\n\n               Leopold and Kate eat lunch. Leopold scans a newspaper. On \n               the TV over the bar, Bob Dole is speaking out against gun \n               control.\n\n                                     LEOPOLD\n                         Public office is apparently still \n                         the last refuge for the incompetent. \n                         Show me a man who does not want his \n                         gun registered and I'll show you a \n                         man who should not own a gun. What \n                         is a pee-pee girl?\n\n                                     KATE\n                         What are you reading?\n\n                                     LEOPOLD\n                         The Village Voice. After much \n                         consideration, I have decided it is \n                         time I join the work force.\n\n                                     KATE\n                         As a pee-pee girl?\n\n                                     LEOPOLD\n                         Perhaps not that, but I am determined \n                         to acquire honest employment.\n\n                                     KATE\n                         Leopold, I don't know if that's such \n                         a good idea.\n\n                                     LEOPOLD\n                         Kate, my life back home was beneficial \n                         to no one. I want my new life to \n                         have value. I won't make the same \n                         mistakes twice.\n\n                                     KATE\n                         You have to be patient.\n\n                                     LEOPOLD\n                         I could conceivably wait my whole \n                         life away.\n\n                                     KATE\n                         You're awfully cute when you get \n                         causey.\n\n                                     LEOPOLD\n                         I will not waste any more time. I \n                         must make a difference.\n\n               INT. BLOOMINGDALES - DAY\n\n               Customers fill the aisles. In the center of it all, Leopold \n               is hard at work. He holds a bottle of perfume.\n\n                                     LEOPOLD\n                         Try our fragrance? Would you like to \n                         try our new fragrance today?\n\n                                     RICH CUSTOMER\n                         What is it?\n\n                                     LEOPOLD\n                         It is called, POISON.\n\n               He squirts some at her.\n\n                                     RICH CUSTOMER\n                         Oh! I don't think so. Have you got \n                         PASSION?\n\n                                     LEOPOLD\n                         I beg your pardon?\n\n                                     RICH CUSTOMER\n                         Elizabeth Taylor's Passion?\n\n                                     LEOPOLD\n                         Next aisle over.\n\n               She leaves. Leopold looks after her.\n\n                                     LEOPOLD\n                              (after a beat)\n                         Give your mother-in-law what she \n                         really deserves this season. Give \n                         her some POISON.\n\n               INT. KATE'S LABORATORY OFFICE - MORNING\n\n               The doctors enter Kate's office and closes the door.\n\n                                     KATE\n                         Hi.\n                              (the doctors remain \n                              silent)\n                         What's the matter?\n\n               There is a long pause. Slowly Kate realizes the doctors are \n               on to her. She puts down her pen.\n\n                                     KATE\n                         So you know.\n\n                                     DR. KAU\n                         We had to go through your computer \n                         to access information. Your \n                         calculations have been verified and \n                         the final course has been set. Leopold \n                         goes back a week from Friday 1:17 \n                         a.m.\n\n                                     DR. PLODDER\n                         How long were you going to keep it a \n                         secret, Kate?\n\n                                     DR. DRAKE\n                         Were you even going to tell us at \n                         all?\n\n                                     KATE\n                         I'm not sure.\n\n                                     DR. PLODDER\n                         Not sure? What can you be thinking? \n                         You can't alter the course of history \n                         and assume everything will be okay. \n                         It won't be. He has his own destiny \n                         to fulfill in his own time.\n\n                                     KATE\n                              (quietly)\n                         You don't understand.\n\n                                     DR. DRAKE\n                              (gently)\n                         He's going back, Kate.\n\n                                     DR. PLODDER\n                         It's over.\n\n               Kate nods. The doctors slowly leave the room and close the \n               door. Just the sound of the clock ticking.\n\n               Kate sits at her desk very still.\n\n                                     KATE\n                         No... No, no, no.\n\n               INT. KATE'S BEDROOM - EARLY EVENING\n\n               Charlie knocks and enters.\n\n                                     CHARLIE\n                         There you are. I've only been \n                         hollering for the last...\n\n               He sees her face. Kate's eyes are red and swollen. She lays \n               out Leopold's belongings.\n\n                                     CHARLIE\n                         Kate? What is it? What happened?\n\n                                     KATE\n                              (very detached)\n                         It's time. Leopold's going back.\n\n                                     CHARLIE\n                         Kate...\n\n                                     KATE\n                         Yup. I'll get his things together. \n                         Tell him tonight.\n\n               He goes to her.\n\n                                     CHARLIE\n                         Are you all right?\n\n                                     KATE\n                              (pulling away)\n                         I'm fine.\n\n                                     CHARLIE\n                         You don't look so fine.\n\n                                     KATE\n                         Well I am. It was wonderful having \n                         him here, Charlie. He was of \n                         invaluable assistance to the project.\n                              (she shrugs)\n                         I'll miss him.\n\n                                     CHARLIE\n                         You'll miss him?\n\n                                     KATE\n                         I will.\n\n                                     CHARLIE\n                         Goddamnit Kate, you love the guy!\n\n               Kate remains silent.\n\n                                     CHARLIE\n                         Kate, don't do this. Please. It's \n                         not right.\n\n                                     KATE\n                         What am I supposed to DO, Charlie?? \n                         I can't go back. He can't stay. I \n                         can't let him go. I'm not equipped \n                         to deal with this, Charlie. I don't \n                         know how.\n\n                                     CHARLIE\n                         Listen to me, Kate. Don't! Don't be \n                         the ice princess.\n\n                                     KATE\n                              (beginning to tear up)\n                         I'm not!\n\n                                     CHARLIE\n                         You are. You can't live your whole \n                         life under a microscope. You've got \n                         to tell him how you feel.\n\n                                     KATE\n                              (breaking down in his \n                              arms)\n                         It's too much, Charlie. It's just \n                         too much.\n\n                                     CHARLIE\n                         You owe it to him.\n\n                                     KATE\n                         I didn't know I could feel like this. \n                         I really didn't know.\n\n               INT. FANCY FRENCH RESTAURANT - NIGHT\n\n                                     LEOPOLD\n                         So I looked him right in the eye and \n                         said, 'Ego is nature's compensation \n                         for mediocrity.' I turned and I \n                         walked. He never said a word... He \n                         probably didn't understand it... \n                         Kate?\n\n                                     KATE\n                              (cold)\n                         What?\n\n                                     LEOPOLD\n                         Are you all right? You're awfully \n                         quiet.\n\n                                     KATE\n                         I'm fine.\n\n                                     LEOPOLD\n                         How was your day?\n\n                                     KATE\n                              (taking a long pause)\n                         It's time.\n\n               Leopold looks at her.\n\n                                     KATE\n                         We're sending you back.\n\n                                     LEOPOLD\n                              (slowly pushing his \n                              plate away)\n                         When?\n\n                                     KATE\n                         A week from Friday, early morning.\n\n                                     LEOPOLD\n                         No!\n\n                                     KATE\n                         It was a mistake, Leopold. It's out \n                         of our hands. We can't POCKET people \n                         from history like stolen jewels. We \n                         haven't the right... I'm sorry. We'll \n                         miss you.\n\n                                     LEOPOLD\n                         Is that all?\n\n                                     KATE\n                         What do you want me to do, fall apart? \n                         You'd still be leaving. It wouldn't \n                         solve anything.\n\n                                     LEOPOLD\n                         Who is this woman sitting across \n                         from me?\n\n                                     KATE\n                         What do you want me to say, Leopold?\n\n                                     LEOPOLD\n                         Tell me that you love me as I love \n                         you. Let me hear you say it.\n\n               Kate remains silent. Leopold abruptly throws money on the \n               table.\n\n                                     LEOPOLD\n                         I will not do this. I'm sorry.\n\n               We starts out.\n\n                                     KATE\n                         Leopold!\n\n               EXT. STREET - NIGHT\n\n               Leopold walks out of the restaurant trying to remain calm. \n               His emotions get the best of him. Finally, exhausted, he \n               winds up walking along Central Park South.\n\n               Hansom Carriages wait to be taken out. He approaches slowly. \n               He stops along side one of the cabs and strokes the horse's \n               head.\n\n               He looks at the horse for a long time. Then he looks at the \n               skyscrapers surrounding him, deciding what to do. He lays \n               his face against the horse's head, torn.\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM - EARLY MORNING\n\n               Kate sits at the dinning room table behind empty Sara Lee \n               boxes, pints of ice cream, beer bottles, and is working her \n               way through the cookie dough. Leopold enters through the \n               front door, DISHEVELED.\n\n                                     LEOPOLD\n                         Good God. Look at you. You look awful.\n\n                                     KATE\n                         You should see what I'm looking at.\n\n                                     LEOPOLD\n                         I went back to the restaurant. They \n                         told me you went out looking for me \n                         right after I left.\n\n                                     KATE\n                         That was pound cakes ago. Where were \n                         you?\n\n                                     LEOPOLD\n                         I had a lot to think over.\n\n                                     KATE\n                         Such as?\n\n                                     LEOPOLD\n                         Just where I stand around here.\n\n               There is a long pause.\n\n                                     KATE\n                              (quietly)\n                         We should have come up with something \n                         together. I might have been spared \n                         ten or seventy pounds.\n\n                                     LEOPOLD\n                         Is that an apology?\n\n                                     KATE\n                         I'm sorry for what I said.\n\n               Leopold goes to her. He gently prys cookie dough from her \n               hands.\n\n                                     LEOPOLD\n                         I'm not going anywhere.\n\n                                     KATE\n                         Yes you are...\n\n                                     LEOPOLD\n                         I'm not going. I'm staying here with \n                         you.\n\n                                     KATE\n                         But? You can't! We have no right \n                         to...\n\n                                     LEOPOLD\n                         It is my destiny. It is my decision.\n\n                                     KATE\n                         Have you thought about what you'd be \n                         sacrificing? Your influence? Your \n                         authority?\n\n               They kiss.\n\n                                     KATE\n                         Your family, your whole way of life, \n                         everything?\n\n               They kiss.\n\n                                     KATE\n                         You're not just feeling sorry for me \n                         because I ate the contents of the \n                         refrigerator, are you?\n\n               They kiss.\n\n                                     LEOPOLD\n                         I love you, Kate. The single most \n                         miraculous event in my life was not \n                         how I arrived here, but that when I \n                         did, I found you.\n\n                                     KATE\n                              (overwhelmed)\n                         Here comes the mushy part!\n\n                                     LEOPOLD\n                         After much consideration I've come \n                         to the conclusion I no longer desire \n                         a large estate with a full staff and \n                         ornate grounds.\n\n                                     KATE\n                         That's good, because if you're staying \n                         I'll probably get fired again. What \n                         do you desire?\n\n                                     LEOPOLD\n                         A beautiful wife, a small home in \n                         the middle of nowhere, lots of \n                         children, and fine schools with PMS \n                         meetings every other Sunday.\n\n                                     KATE\n                         ...PTA?\n\n                                     LEOPOLD\n                         PTA.\n\n                                     KATE\n                         I love you too. I do, Leopold. I \n                         love you, too.\n\n               They kiss.\n\n               INT. LABORATORY - DAY\n\n               Leopold and Kate sit calm and resolute. The doctors are in \n               an uproar.\n\n                                     DR. PLODDER\n                         This is outrageous! I won't allow \n                         it!\n\n                                     LEOPOLD\n                         The decision is not yours to make.\n\n                                     DR. PLODDER\n                         Do you realize what you're saying? \n                         You're tampering with fate, \n                         preordinance, and God himself.\n\n                                     LEOPOLD\n                         We do that every day, doctor. It is \n                         called CHOICE.\n\n                                     DR. KAU\n                         Dr. Carlson is still over there. You \n                         can't simply abandon her. We have to \n                         get her back.\n\n                                     KATE\n                         Do you think I'm not aware of that? \n                         Do you think a minute goes by that I \n                         don't feel responsible for her? But \n                         SOMEONE ELSE CAN GO.\n\n                                     DR. KAU\n                         Only one person can return. The \n                         capsule accommodates only one person. \n                         Leopold has to find her.\n\n                                     LEOPOLD\n                         Perhaps she does not wish to return. \n                         Perhaps she's found greater happiness \n                         in her new life. It happened to me.\n\n                                     KATE\n                         Maybe this is her destiny. Maybe \n                         she's of more important use back \n                         there.\n\n                                     DR. KAU\n                         Julia Carlson died in the Center \n                         Factory fire of 1897, two years after \n                         she arrived. She was 37 years old.\n\n               There is a stunned silence.\n\n                                     DR. DRAKE\n                         Dear lord.\n\n                                     DR. KAU\n                         She was a friend, Kate. She was never \n                         expected to sacrifice her life for \n                         this experiment. I won't be a party \n                         to it. I know what I'm asking... \n                         There's no way we can force you to \n                         go. Just think it over.\n\n               INT. BEDROOM - 2:30 A.M.\n\n               A clock is ticking loudly. Kate and Leopold lie back to back.\n\n                                     KATE\n                         You're going back aren't you?\n\n                                     LEOPOLD\n                         I keep seeing that poor woman's face. \n                         She was terrified.\n\n                                     KATE\n                         You said you wouldn't leave me... \n                         I've never been lucky. Not one time.\n\n                                     LEOPOLD\n                         Six months ago I wouldn't have given \n                         it another thought. I wouldn't have \n                         lost a moment's sleep. You've changed \n                         me, Kate. There is no turning back.\n\n                                     KATE\n                         I wouldn't WANT you to change. That's \n                         what's tearing me up inside. Either \n                         way I lose... You've changed me too. \n                         I can't go back to my old life \n                         anymore. I can't live like that again. \n                         God my heart is pounding like a drum. \n                         I've never been so scared in my life. \n                         Take me with you, Leopold. God. Take \n                         me with you.\n\n                                     LEOPOLD\n                         You don't realize what you're saying! \n                         You don't understand the kind of \n                         life you'd lead. What you'd be giving \n                         up.\n\n                                     KATE\n                         I'd be with you.\n\n                                     LEOPOLD\n                         I can't ask that of you.\n\n                                     KATE\n                         Just ask me... Just ask.\n\n                                     LEOPOLD\n                         Come back with me.\n\n               She slowly turns. She embraces him.\n\n                                     KATE\n                         Yes!\n\n               EXT. N.Y.C. STREET - NIGHT\n\n               Dressed to the nines, Leopold leads a blindfolded Kate through \n               the street. She is clumsier than usual.\n\n                                     KATE\n                         Where are you taking me?\n\n                                     LEOPOLD\n                         This is something I've wanted to do \n                         for a long time.\n\n               She takes off her blindfold and looks up at the sign: \n               ROSELAND.\n\n                                     KATE\n                         Leopold?\n\n                                     LEOPOLD\n                         This will be very therapeutic.\n\n               He takes her arm and escorts her in.\n\n               INT. ROSELAND - NIGHT\n\n               Leopold leads Kate to the dance floor. He opens his arms and \n               Kate steps in the way she was taught in class. Leopold pulls \n               her close.\n\n               This time there is no pretending. Partnered together, they \n               shine. They move beautifully, effortlessly. It's almost more \n               than they can bear. As the music plays, they stop. Leopold \n               holds Kate tightly. They look at each other for the longest \n               time.\n\n                                                                    CUT TO:\n\n               INT. LABORATORY - EARLY MORNING\n\n               Large screen computers are working overtime. Kate, Leopold, \n               and Charlie accompany the doctors to the capsule. It is nearly \n               time.\n\n                                     DR. DRAKE\n                         The time tables have been set. Just \n                         strap yourself in and you'll be fine.\n\n                                     DR. PLODDER\n                         You have only a twenty four hour \n                         leeway before the machine is set to \n                         return to us. You must find Carlson \n                         within that time frame and get her \n                         on board or there will be little \n                         chance of her finding a way back.\n\n                                     LEOPOLD\n                         I understand.\n\n                                     DR. DRAKE\n                         It's been a real pleasure. You have \n                         a much nicer smile than Ronald \n                         Coleman.\n\n                                     LEOPOLD\n                         The privilege was mine.\n\n                                     DR. KAU\n                         Goodbye Leopold, and thank you.\n                              (she gives him a kiss)\n\n                                     LEOPOLD\n                         Oh, my.\n\n                                     DR. KAU\n                         Don't worry. We'll send Kate to you... \n                         as soon as possible. I'll see to it \n                         myself.\n\n                                     LEOPOLD\n                         See that you do.\n\n                                     DR. KAU\n                         You have my word on it.\n\n               The doctors leave.\n\n                                     DR. DRAKE\n                         Four minutes and counting.\n\n                                     CHARLIE\n                         Well? I'll make this quick. Goodbye.\n\n               He sticks out his hand.\n\n                                     LEOPOLD\n                         Goodbye.\n                              (impulsively Leopold \n                              embraces Charlie)\n                         I shall miss you Charles, more than \n                         you know.\n\n                                     CHARLIE\n                         I'll miss you too, Leopold... You're \n                         the only one who knows how to program \n                         the VCR... Take care of my sister.\n\n                                     LEOPOLD\n                         I will.\n\n                                     CARLSON\n                         You better. Take care of yourself \n                         too while you're at it... So long.\n\n                                     KATE\n                         I don't have any words for this.\n\n                                     LEOPOLD\n                         I will see you soon.\n\n                                     KATE\n                         I know.\n\n                                     LEOPOLD\n                         You'll be with me all the time.\n\n                                     KATE\n                         I know. I brought you something.\n\n               She takes out a ring and slips it on his finger.\n\n                                     KATE\n                         So you wouldn't forget me.\n\n                                     LEOPOLD\n                         Kate...\n\n                                     KATE\n                         So you wouldn't think this was all a \n                         dream.\n\n               They kiss.\n\n                                     KATE\n                         Don't forget about me.\n\n                                     LEOPOLD\n                         I love you, Kate.\n\n                                     KATE\n                         Wait for me.\n\n                                     LEOPOLD\n                         For as long as it takes.\n\n                                     KATE\n                         I will come back to you! I will!\n\n                                     LEOPOLD\n                         I'll be waiting.\n\n               They kiss again for the last time.\n\n                                     DR. DRAKE\n                         It's time Leopold.\n\n               Leopold holds Kate's face in his hands. Very slowly they \n               part.\n\n               Leopold takes his place in the machine and straps himself \n               in. He places one hand on the red lever and the other against \n               the glass pane on the door. Kate comes over and places her \n               hand over his. Wordlessly, they say goodbye.\n\n               After a moment, Dr. Kau gently moves Kate away. Dr. Plodder \n               silently raises his arm, signaling Leopold.\n\n                                     DR. PLODDER\n                         9 8 7 6 5 4...\n\n               Leopold shifts in his seat, his eyes never leaving Kate's, \n               his hand still against the glass.\n\n               Kate smiles tenderly at Leopold.\n\n                                     DR. PLODDER\n                         3 2 1!\n\n               Dr. Plodder drops his arm signaling Leopold. Leopold pulls \n               the lever, still gazing at Kate. There is a blinding FLASH \n               of light, then darkness.\n\n               INT. LAB - MONTHS LATER\n\n               Kate raises her head. She sits at her desk surrounded by the \n               doctors.\n\n                                     DR. PLODDER\n                         I cannot in good conscience let you \n                         go. It's out of the question.\n\n                                     DR. DRAKE\n                         I can't be a part of it either Kate. \n                         I'm sorry.\n\n                                     DR. KAU\n                         It's too big a risk.\n\n               Kate rises and moves to the window. She is a full NINE MONTHS \n               PREGNANT.\n\n                                     DR. PLODDER\n                         We cannot guarantee your child's \n                         safety. It's that simple.\n\n                                     KATE\n                         He's waiting for me. I can feel it. \n                         Oh, Leopold...\n\n               She gazes out the window, searching the horizon.\n\n                                                                    CUT TO:\n\n               EXT. A SMALL FARM HOUSE - EVENING\n\n               Down from the horizon, a farm house. LEO COLES, 5 years old, \n               rocks on his front porch swing. Using his bare hands as \n               puppets he carries on a conversation. JULIA CARLSON pulls up \n               in her car.\n\n                                     CARLSON\n                         Hi. Does Katherine Coles live here?\n\n                                     LEO\n                         Yeah.\n                              (yelling inside)\n                         MOM??\n\n                                     CARLSON\n                         You're Leo aren't you? You don't \n                         remember me but I knew you when you \n                         were yea big.\n                              (she holds her hands \n                              an inch apart)\n\n                                     LEO\n                         Yeah.\n\n                                     CARLSON\n                         I'm Julia. I'm an old friend of your \n                         mothers.\n\n                                     LEO\n                              (proudly)\n                         We had spaghetti at our house 4 times \n                         this week.\n\n               Kate comes out on the porch. She looks lovely.\n\n                                     KATE\n                         Leo you don't have to holler like \n                         that. I'm not deaf...\n\n                                     CARLSON\n                         Kate?\n\n                                     KATE\n                         ...Carlson?!\n\n               The two women scream, run to each other and embrace.\n\n                                     KATE\n                         Carlson, I don't believe it. It's \n                         been... I don't know how many years. \n                         What are you doing here.\n\n                                     CARLSON\n                         I came to see you, sweetie.\n\n                                     KATE\n                         You remember my son, Leo?\n\n                                     CARLSON\n                         We've just been getting acquainted.\n\n                                     KATE\n                         Well, come inside. Come inside.\n\n               INT. KATE'S HOUSE - NIGHT\n\n               Kate heads straight for the kitchen. Carlson scans the living \n               room before joining her.\n\n               Although rustic on the outside, the inside of the house is \n               furnished with antiques and is Victorian in style.\n\n                                     KATE\n                              (covering her agitation)\n                         Would you like some tea? I wish you \n                         had called before you come over. It \n                         would have given me a chance to \n                         straighten up the house... myself... \n                         my life. Tell me what you've been up \n                         to. Catch me up on everyone. I heard \n                         you received some big endowment or \n                         something. I was going to write, \n                         then call, but...\n\n               She picks up the cup and saucer but it shakes so violently \n               she has to put it down.\n\n                                     CARLSON\n                         It's all right, Kate. I understand.\n\n               There is a LONG PAUSE. Carlson gets the tea ready. Finally:\n\n                                     CARLSON\n                         You'd leave in 9 days. That's not a \n                         lot of time to get your affairs in \n                         order... And I warn you, it's nearly \n                         impossible for an intelligent woman \n                         back there.\n\n               Kate stands by the back door, looking out at Leo.\n\n                                     CARLSON\n                         He's a fine boy Kate. Leopold would \n                         be proud. We're aware of your \n                         situation but we felt when the time \n                         came, you deserved the option.\n\n               Kate nods, trembling slightly.\n\n               INT. FARM HOUSE - NIGHT\n\n               Kate stands in the doorway as Carlson drives off.\n\n                                     LEO\n                         Who was that lady?\n\n                                     KATE\n                         Just an old friend.\n\n                                     LEO\n                         What she want?\n\n                                     KATE\n                              (she looks at Leo)\n                         Nothing important. You brush your \n                         teeth?\n\n               Leo shows off his teeth.\n\n                                     KATE\n                         Then give your old mom a hug and go \n                         to bed.\n                              (Leo gives her a hug \n                              and a kiss)\n                         Good night, cookie.\n\n                                     LEO\n                         Good night.\n\n               Kate wraps herself in an old blanket and moves through the \n               house turning off the lights. It is very guiet. All we hear \n               are Kate's footsteps and the sound of the clock ticking.\n\n               She makes her way upstairs, enters her bed room. She sits \n               down by the window at her desk. She sits a long time lost in \n               thought.\n\n               She slowly pulls open a drawer and from deep inside pulls \n               out an old photo album. She opens it and begins to look \n               through.\n\n                                                                    CUT TO:\n\n               THE PHOTO ALBUM\n\n               Inside, old black and white photographs, newspaper clippings, \n               magazine articles trace Leopold throughout his life.\n\n               A photograph of Leopold looking as he did the night he \n               departed this world. He stands stiffly beside his family for \n               a formal portrait. Very discreetly, he points to a ring. It \n               is the same ring Kate gave him.\n\n               A newspaper article shows Leopold donating $100,000 to \n               establish a scientific center researching studies in time \n               and space.\n\n               A magazine picture shows Leopold, the sole male figure, \n               marching to give women the vote.\n\n               A photograph of a large formal wedding. Leopold, around FIFTY, \n               stands alone in the wedding party, surreptitiously pointing \n               to his ring.\n\n               A magazine article shows Leopold in his SIXTIES establishing \n               a scholarship program for studies in physics. He is surrounded \n               by academia and subtly points to his ring.\n\n               A photograph of Leopold around SEVENTY shaking hands with \n               Albert Einstein and smiling broadly for the cameras.\n\n               A professional photograph of Leopold at SEVENTY FIVE, sitting \n               regally in a chair. Beside him, an EMPTY chair. He rests one \n               hand on the back of the chair. The other he holds against \n               his chest, showing off the ring.\n\n               An obituary with the headline, \"Philanthropist, 80, dies in \n               bombings.\n\n               A tear falls on the page.\n\n               Kate cries silently, looking out the window. The camera \n               follows her gaze past her property...\n\n                                                                    CUT TO:\n\n               INT. BANQUET ROOM - YEARS LATER\n\n               LEO, 24 and his BRIDE take to the floor for the first time \n               as husband and wife and are greeted with applause. Kate, \n               older, beautiful, hair cut short, looks on in wonder.\n\n               Charlie, standing with Patrice and their 6 blonde children, \n               approaches Kate and leads her to the dance floor.\n\n                                     KATE\n                         He's so YOUNG, Charlie.\n\n                                     CHARLIE\n                         He's old enough.\n\n                                     KATE\n                         Look at that idiotic expression on \n                         his face.\n\n                                     CHARLIE\n                         He's happy.\n\n                                     KATE\n                         Of course he's happy. All weddings \n                         are happy. It's the living together \n                         afterwards that causes all the \n                         trouble.\n\n               Julia Carlson, under dressed, over anxious, enters the banquet \n               hall. She stands at the back of the large room, searching.\n\n               Couples fill the dance floor. Across the expansive room, \n               over the tops of heads, Charlie and Kate bob amongst the \n               guests. Leo cuts in. As they spin, in the briefest of seconds, \n               Kate spots Carlson. She pales. They TURN.\n\n               Kate peers over Leo's shoulder. Her eyes lock with Julia's. \n               Julia nods with purpose. Kate holds onto Leo tightly, not \n               wanting to let go. She buries her head in his chest.\n\n                                     KATE\n                         Oh, you're so young... I love you, \n                         Leo. Always remember that...\n\n               From behind, her shoulders shake as she cries.\n\n                                     LEO\n                         Mom, we're only moving to Denver.\n\n                                     KATE\n                         I know, cookie. I know.\n\n               INT. CONTROL BOOTH - NIGHT\n\n               From behind a glass partition, Carlson works at her console. \n               A monitor counts away the seconds. 59, 58, 57... In the \n               darkened lab, Kate, dressed in early 1920s attire, straps \n               herself in and smiles tearfully. Their voices echo in the \n               lab.\n\n                                     KATE\n                         Well...\n\n                                     CHARLIE\n                         I know. Me too.\n\n               They embrace each other for the last time.\n\n                                     KATE\n                         What will I do without you, Charlie?\n\n                                     CHARLIE\n                              (softly)\n                         Live happily ever after.\n\n                                     CARLSON\n                              (pushing the intercom \n                              button)\n                         Kate, it's time.\n\n                                     LEO\n                              (emotionally)\n                         Here. It's a letter for my father. \n                         Tell him about me and... um, tell \n                         him I love him. I want him to know \n                         me.\n\n                                     KATE\n                         Leo...\n\n                                     LEO\n                         Mom, I want you to go.\n\n                                     KATE\n                         But...\n\n               He puts his finger to her lips. He looks to his wife then \n               back at Kate. He nods his head.\n\n                                     LEO\n                         Go.\n\n               They force themselves to smile, trying to get through the \n               moment.\n\n                                     CARLSON\n                         Ready!\n\n               Charlie, Leo and his new bride stand back. Inside the craft, \n               the only light comes from the glowing red lever. Carlson \n               raises her arm, signaling Kate. Then to her staff:\n\n                                     CARLSON\n                         9, 8, 7...\n\n               Kate presses her hand against the glass as a final goodbye. \n               She grabs the lever with her other hand and turns away, \n               staring straight ahead. Charlie puts his arm around Leo.\n\n                                     CARLSON\n                         3, 2, 1!\n\n               There is a BRIGHT WHITE FLASH. Kate is gone. The others stand \n               there motionless, stunned.\n\n               The screen is BLACK.\n\n               EXT. A LARGE VICTORIAN ESTATE - 1924 - NIGHT\n\n               A FLASH of light illuminates the forest at the Albany estate. \n               A BEAT. Kate races from the forest onto a massive lawn, \n               stumbling in mud as she hurries to the mansion's entrance.\n\n               INT. BALLROOM - NIGHT\n\n               Huge double doors open to reveal -- AN ORNATE BALLROOM. The \n               creme de la creme have gathered and dance. Kate overwhelmed, \n               rushes down an elaborate staircase. Half way down she looses \n               a shoe. She hesitates briefly then continues to the dance \n               floor.\n\n               In the center of the floor, Leopold, looking very \n               distinguished and attractive, dances with a flirtatious young \n               woman. Try as she might, Leopold keeps her at a distance.\n\n                                     FLIRT\n                              (brushing his shirt \n                              front)\n                         I just love a starched white shirt. \n                         It's so elegant.\n\n                                     LEOPOLD\n                         Thank you.\n\n                                     FLIRT\n                         Skeeky.\n\n                                     LEOPOLD\n                         Yes. You dance like an angel Miss \n                         Beall. You light up the room around \n                         you. I thank you.\n\n                                     FLIRT\n                              (with a big smile)\n                         Thank YOU.\n\n               The music changes: A LIVELY CHARLESTON. Leopold heaves a \n               sigh of relief and makes his way through the crowd, up the \n               staircase.\n\n               The dancers become an intricate maze, a dead end at every \n               turn as Kate searches each male face.\n\n               In the foreground, Leopold is stopped by a woman midway up \n               the stairs. As they chat, Leopold reaches down and picks up \n               the muddy slipper, offering it to her. She turns in a huff, \n               flouncing down the stairs.\n\n               Simultaneously, in the background, Kate desperately looks \n               for Leopold.\n\n               Leopold studies the slipper as he makes his way up the stairs. \n               He slows down, hesitates and STOPS. Very slowly he turns \n               around. He becomes very still. TEARS well up in his eyes.\n\n               The ballroom clock strikes MIDNIGHT.\n\n               Kate climbs an opposite staircase to get a better view then \n               STOPS. In her heart SHE KNOWS. Slowly she turns. Leopold \n               stands quietly at the bottom of the stairs, gazing up at \n               her. He extends his arm, showing her THE RING. He offers her \n               his hand.\n\n               The crowd, the room, THE WORLD AROUND THEM, DISAPPEAR. Their \n               eyes lock. As she descends the staircase, THE YEARS MELT \n               AWAY. Kate's short hair grows long, cascading around her \n               shoulders. The fine lines around Leopold's face are gone. \n               They see themselves through each other's eyes, at the moment \n               of youth, when they fell in love.\n\n               Leopold bends down, places the slipper on Kate's foot. He \n               rises, looks down at his hands and then up at Kate. His hands \n               are caked with mud. She smiles helplessly. Not caring, he \n               wraps his arms tightly around her.\n\n               MUSIC begins to play, a slow waltz. He nods to her. She takes \n               a deep breath. Her head bobs in rhythm. She begins to count \n               silently. Leopold smiles, counting along.\n\n               THEY DANCE...\n\n               An elderly couple watch Leopold with interest.\n\n                                     LORD WHITEHEAD\n                         Who is that dancing with Leopold?\n\n                                     LADY WHITEHEAD\n                         I've never seen her before.\n\n               Kate and Leopold dance past. They are older. As they gaze \n               into each other's eyes, they twirl. THE LOOK OF YOUTH RETURNS.\n\n               At the center of the floor they stop dancing. THEY KISS. The \n               rest of the world dances around them.\n\n               Over this background... THE SCRAPBOOK PICTURES BLEED ONTO \n               SCREEN.\n\n               The old formal wedding photo becomes a photograph of Kate \n               and Leopold the perfect bride and groom, both discreetly \n               point to their rings.\n\n               Kate stands with Leopold as he establishes a scholarship for \n               studies in physics.\n\n               The old photograph of Leopold and Albert Einstein changes to \n               include Kate, waving and smiling broadly for the camera.\n\n               The professional photograph becomes a double portrait. It \n               shows the two in their 70's, sitting regally in matching \n               chairs. They hold hands and smile serenely. Staring directly \n               into the camera, they show off their rings.\n\n               SLOWLY the scrapbook closes...\n\n               Kate and Leopold dance, the music swells as they become lost \n               in the crowd. The clock CHIMES. Slowly we...\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\nKate & Leopold\nWriters :   James Mangold  Steven Rogers\nGenres :   Romance  Fantasy  Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:28:35.327751"}