{"title": "Kingdom, The", "film_link": "/Movie Scripts/Kingdom, The Script.html", "script_link": "/scripts/Kingdom,-The.html", "info_raw": "\n\nKingdom, The Script\n\n\n\n\nIMSDb opinion  Solid action movie, pretty intense.\nIMSDb rating   (7 out of 10)\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Matthew Michael Carnahan\nGenres  Action  Drama  Thriller\nScript Date : August 2006\nMovie Release Date : September 2007\n\nRead \"Kingdom, The\" Script\n\n\n", "script": "\n\n\n\n\n\n                       THE KINGDOM\n\n\n\n\n                        Written by\n\n                 MATTHEW MICHAEL CARNAHAN\n\n\n\n\n                                                        8/18/2006\n\n\n\n\n\n1   OMITTED - SEE 68A                                             1\n\n\n2   INT. WASHINGTON, DC ELEMENTARY SCHOOL - DAY                   2\n\n    We're in a kindergarten classroom of 25 SIX YEAR OLDS. All\n    sitting on the floor, legs crossed. Sitting in front of the\n    kids is Little KEVIN FLEURY, flanked by his mom LYLA FLEURY\n    and his dad RONALD FLEURY, in a dark suit.\n\n    Little Kevin has a large cardboard square with pictures from\n    different stages of his life taped to it. He's telling the\n    class about the photos.\n\n    We're TIGHT ON the pictures. TIGHT ON the young faces. TIGHT\n    ON Fleury.\n\n                         KEVIN FLEURY\n              This is my Fredricksburg house and\n              my grandma Ruth playing with my\n              skateboard ramp. It's a Tony Hawk\n              jump ramp.\n\n    A little girl, MICK raises her hand.\n\n                        KEVIN FLEURY (CONT'D)\n              Mick?\n\n    Silence from Mick\n\n                        MICK\n              I forgot what I was going to say.\n\n    Kevin points to another picture.\n\n                        KEVIN FLEURY\n              This is me at my second birthday\n              party with my mom and my dad.\n              That's my cake.\n\n    Fleury looks down sweet at his son.\n\n                        KEVIN FLEURY (CONT'D)\n              This is me with my mom at the zoo\n              and this is my dad and me and my\n              grandpa Willie.\n\n    Kevin points to another photo.\n\n                        KEVIN FLEURY (CONT'D)\n              And this is me and my dad and my\n              grandpa Willie at my dad's office.\n\n                                          KINGDOM 8/18/06   2.\n\n\n\nThe kids all lean forward and squirm as they try and get\ncloser to the pictures. MISS ROSS, the pretty twenty five\nyear old teacher watches from the side.\n\n                    MICK\n          Where's your gun?\n\n                    LITTLE BOY\n          Yeah, where is your gun?\n\nPretty much all the kids get in on this now. Everyone wants\nto see Fleury's gun. Fleury makes eyes at Miss Ross. She's\ngiving him a `no fucking way' hard eye.\n\n                    FLEURY\n          I'm assuming that there are no bad\n          guys in this room. Isn't that\n          right? I mean, are you guys good\n          guys or bad guys?\n\n                       THE WHOLE CLASS\n          GOOD GUYS!\n\n                    FLEURY\n          Right. So why would I have brought\n          my gun to a room full of good guys?\n\nThis silences the class. Miss Ross keeps things moving,\npointing to a photo.\n\n                    MISS ROSS\n          What's that picture?\n\n                    KEVIN FLEURY\n          This is me and my dad playing\n          Battleship at my dad's apartment.\n\nMick's hand goes back up.\n\n                       KEVIN FLEURY (CONT'D)\n          Mick?\n\n                    MICK\n          What is a battleship?\n\n                    KEVIN FLEURY\n              (abruptly)\n          My parents are divorced.\n\nA beat. Lyla and Ron look down at Kevin, stalled...\n\n                                             KINGDOM 8/18/06    3.\n\n\n\n                        KEVIN FLEURY (CONT'D)\n              But that's OK `cause the most\n              important thing is to know that\n              everybody loves each other.\n\n    This hits a bit hard on Lyla and Ron. Miss Ross jumps in.\n\n                        MISS ROSS\n              So, who's that in that picture up\n              on top?\n\n                        KEVIN FLEURY\n              That's my fish, his name is Jaws\n              and he's a really mean fish.\n\n                                                    CONTINUED:\n\n\n3   OMITTED - SEE 68A                                                3\n\n\n4   INT. WASHINGTON DC ELEMENTARY SCHOOL- CONTINUOUS                 4\n\n    Kevin is still going strong.\n\n                         KEVIN FLEURY\n              My mommy is a Think Tank worker and\n              she is really, really smart. She\n              went to two colleges and has three\n              computers.\n\n                                                    CONTINUED:\n\n\n5   OMITTED - SEE 78A, 87                                            5\n\n\n6   INT. WASHINGTON DC ELEMENTARY SCHOOL - DAY                       6\n\n    Kevin's pointing to a picture of Ronald holding him as a tiny\n    newborn.\n\n                        KEVIN FLEURY\n              This is the day that my daddy says\n              is the happiest day of his life.\n\n                        MISS ROSS\n              Really. His happiest day! Can you\n              tell us about that day, Mr. Fleury?\n\n    Fleury smiles, looks out at the class.\n\n                                          KINGDOM 8/18/06   4.\n\n\n\n                    RONALD FLEURY\n          I sure can. That was December 4th\n          and that was the day that we spent\n          the whole day in the hospital\n          waiting for this guy right here to\n          come out of Kevin's mom's tummy.\n          And we waited and waited but he\n          wouldn't come and we kept waiting\n          and finally the doctor said\n          `OK...he's not gonna come out on\n          his own so we got to go get him.'\n          And well,\n\nFleury stops, checks in with Miss Ross.\n\n                    RONALD FLEURY (CONT'D)\n          Can I tell this story?\n\n                       MISS ROSS\n          Go for it.\n\n                    RONALD Fleury\n          So they take her and put her on a\n          special bed and they give her some\n          medicine so she doesn't feel any\n          pain then they take out this tiny\n          little knife and make a tiny little\n          cut right here in her tummy.\n\nThe kids are mesmerized...\n\n                    MISS ROSS\n          Then what happened?\n\n                    RONALD Fleury\n          Then the doctor put her hands way\n          up into Kevin's mom's tummy. WAY\n          IN! And then you know what they\n          did?\n\nA little girl, LU LU: WIDE EYED\n\n                    LU LU\n          What did they do?\n\n                    RONALD FLEURY\n          They started to pull and pull and\n          pull... they had something in there\n          and it started coming and they were\n          pulling and the doctor all of the\n          sudden said \"STOP!\"\n\nThe class is frozen. Fleury has them.\n\n                                            KINGDOM 8/18/06   5.\n\n\n\n                        RONALD FLEURY (CONT'D)\n              They stopped pulling and the doctor\n              looked up at me and said `Hey, Mr.\n              Fleury - you ready to have your\n              world rocked?' And I just stared at\n              her and she pulled this little head\n              up out of that belly. And it was\n              him. His head. And I looked down at\n              him and screamed \"Kevin!!\" And he\n              looked down at me and screamed\n              \"Daddy!!\"\n\n    The kids are howling!\n\n                                                      CUT TO:\n\n\n7   EXT. AN UNKNOWN ROOFTOP - LATE DAY                             7\n\n    A Muslim family sits together at a table under a tented-\n    canopy: 32 year-old MAN nervously chewing on a toothpick, and\n    his 8 and 15 year-old SONS. The 8yo leans his weight into an\n    old MAN hunched and obscured by his grandson - this is his\n    Grandfather. He gently rubs the Boy's head with an ancient\n    left hand. The Boy finger-paints in Arabic script, right to\n    left, getting paint on the table. Read the translation: There\n    is no God but Allah.\n\n    The Grandfather's face is down, obscured by his shumagh: the\n    head-wrap worn by some Muslim men. Never a clear view of his\n    face. His 32 year old Son and eldest Grandson sit next to\n    them, the Son talking quietly on a cell phone, chewing that\n    toothpick, eyes set on something in the distance: A Security\n    Gate three hundred yards away, the entrance to some sort of\n    compound. The Compound looks like a walled-off subdivision,\n    most of which we can see from this high up.\n\n    The landscape is foreign. Scrub desert. Ten miles beyond, on\n    the horizon: the shimmer of a modern skyline. Surreal\n    monolithic shapes made more so by the heat.\n\n    Muted yells-claps-screams waft in from that Compound now...\n    Catches the youngest Grandson's attention. Eyes lift up from\n    his painting: the yells-claps-screams are coming from a\n    softball game mostly visible behind the Compound's reinforced\n    walls that extend a mile in each direction. Played on the\n    only stretch of green grass visible from this vantage.\n\n\n8   OMITTED                                                        8\n\n                                              KINGDOM 8/18/06   6.\n\n\n\n\n9    EXT. COMPOUND MAIN ENTRANCE - LATE DAY                          9\n\n     Sounds from the softball game much louder now, just over the\n     walls. Security perimeters two checkpoints deep before you\n     get to the main gate. A maze of concrete Jersey-barriers to\n     slow all entering vehicles: give machine-gun emplacements\n     flanking the entrance plenty of time to shred those vehicles\n     if need be. Middle-Eastern Police platoons. 500 lbs. lift-\n     gates to dissuade any vehicle that just tries to ram through.\n\n     SERGEANT HAYTHAM: a lean, 27 year-old Middle-Eastern\n     Policeman in-command of the Entrance. Sweats through his\n     uniform. A late-model Range Rover with blacked-out windows\n     queues up. All the windows roll down: just a single, portly\n     White WOMAN behind the wheel, her INFANT CHILD in a car-seat\n     in front. Two other Uniformed Officers mirror-scan the bottom\n     of the Rover.\n\n     A brief exchange, as Haytham checks his ID:\n\n                         DRIVER\n               How are you today, Sergeant?\n\n                         HAYTHAM\n               Sun is shining. Wind is blowing.\n               How bad can I be doing?\n\n                         DRIVER\n               I like that, \"Sun is shining...\"\n\n     A tight smile from Haytham.\n\n     The other Officers are checking the inside of the Rover now.\n     They nod to Haytham, Haytham hands the ID back to her.\n     Windows rolls up. Lift-gate goes up. Range Rover pulls away,\n     navigating the zig-zag jersey barriers.\n\n\n10   INT. COMPOUND - NEXT MOMENT                                 10\n\n     Stay with the Range Rover as it moves deeper into the\n     complex. Think middle-class Phoenix suburb circa 1960: stucco\n     homes sandwiched between dormitory style apartment blocks,\n     concrete and rock where grass should be.\n\n     The Range Rover passes a tank with a caged SOLDIER on top\n     sitting behind a fifty caliber GUN. A Police Land Cruiser\n     parked in the middle of the road is the last of the security.\n     Official markings, emergency lights in the grill.\n\n                                              KINGDOM 8/18/06   7.\n\n\n\n\n11   EXT. UNKNOWN ROOFTOP - SAME MOMENT                           11\n\n     The Son studies the compound through binoculars, while the\n     youngest Grandson squints to study the softball game:\n     Interest cut with jealousy. More muted cheers float. Behind\n     and above him, his Grandfather's voice, rough as sand, to his\n     32 year-old Son, in Arabic:\n\n                         GRANDFATHER (O.C.)\n               Hang up the phone. If they're not\n               ready now, no words will change it.\n\n\n12   EXT. COMPOUND SOFTBALL DIAMOND - NEXT MOMENT                 12\n\n     Another Middle-Eastern POLICEMAN takes in the motley\n     competition: half-smiling, half-smirking at a plump-pink\n     White Man cheering on his plump-pink 9 year-old Son sliding\n     into third.\n\n                            WHITE MAN\n               GET DIRTY!\n\n     Safe. Clapping and Hoots. The PITCHER: an older White Man in\n     his middle forties visibly frustrated. A 25 year-old African-\n     American Batter steps to the plate now. Pitcher turns to his\n     Fielders:\n\n                         PITCHER\n               STEP IT UP NOW!\n                   (back the Batter)\n               Ready for my knuckle-curve?\n\n     The Batter just stays focused as the Pitcher tosses a high-\n     lob. Batter smacks the ball a mile high, deep to left. The\n     teammates of the plump-pink Boy on third:\n\n                         TEAMMATES\n               TAG UP! WAIT `TIL SHE CATCHES IT-\n\n                          PITCHER\n                   (spins, points up at the\n                    ball)\n               -COMIN' HOME!\n\n     A 14 year-old Indian girl sprints underneath the fly-ball:\n     sets up, catches it, juggles it, drops it.\n\n     We pick up different families on the grass nearby: A young\n     WOMAN helps her five year old DAUGHTER untangle a yo-yo. A\n     black COUPLE doing a crossword puzzle together, the wife's\n     head on her husband's lap.\n\n                                               KINGDOM 8/18/06   8.\n\n\n\n\n13   EXT. UNKNOWN ROOF TOP - SAME MOMENT                          13\n\n     The muted reaction to the dropped ball. The whole Family,\n     save the youngest Grandson, intently focused on two Officers\n     walking up to that Police Land Cruiser parked in the middle\n     of the road, well inside the compound: no blinks now.\n\n     The youngest still enthralled by the softball game, the\n     cheers, the running, the shorts and t-shirts. We see his\n     Grandfather's left hand stop rubbing the Boy's head, and move\n     to the Boy's temple, placed like a blinder so he can't see\n     what's about to happen. In Arabic:\n\n                         GRANDFATHER\n               Don't stop watching the game.\n\n\n14   EXT. INSIDE THE COMPOUND WALLS - NEXT MOMENT                 14\n\n     Noises from the softball game close again. Track these two\n     Officers on foot walking toward the Police Land Cruiser ala\n     shift change: nonchalant but quick.\n\n\n15   INT. POLICE LAND CRUISER - SAME MOMENT                       15\n\n     The Driver eyeing the two approaching Officers: something off\n     about them. Uniforms wrinkled, one with a full beard. Driver\n     turns to his Partner, in Arabic:\n\n                         DRIVER\n               You have a copy of the duty rost-\n\n     -POP-POP-POP before the Driver finishes. The Officers on foot\n     rapid-firing 9MM pistols. The Driver and Passenger hit\n     multiple times instantly, crumble lifeless in their seats\n     before anyone has time to process the sounds, link them to an\n     attack. The two firing `Officers' move low-fast like\n     professionals: rip the fresh bodies from the Cruiser, jump\n     in. The new Passenger rips an AR-15 rifle off the center\n     console. The new Driver lays rubber into the Compound.\n\n\n16   EXT. UNKNOWN ROOF TOP - SAME MOMENT                          16\n\n     The youngest Grandson wide-eyed, startled, watches as every\n     member of the Security Details in and around the Compound go\n     prairie dog: search with necks extended, eyes wide -- what\n     the fuck was that? The Boy tries to turn his head away from\n     the game to look for himself: Grandfather just pushes his\n     head back to the game, voice harder now, in Arabic:\n\n                                               KINGDOM 8/18/06   9.\n\n\n\n                         GRANDFATHER (O.C.)\n               I said keep watching the game.\n\n\n17   EXT. COMPOUND MAIN ENTRANCE - SAME MOMENT                     17\n\n     Haytham instantly sprints toward another nearby Police Land\n     Cruiser as most everyone else ducks. In Arabic:\n\n                            SERGEANT HAYTHAM\n               LOCK DOWN!\n\n     Then points at the Officer in the Driver's seat:\n\n                            SERGEANT HAYTHAM (CONT'D)\n               MOVE!\n\n\n18   EXT. COMPOUND SOFTBALL DIAMOND - SAME MOMENT                  18\n\n     Game forgotten. Parents up, screaming for loved ones, moving\n     fast toward the parking lot. The Middle-Eastern Officer that\n     has been watching the game hustles onto the field, next to\n     the Pitcher, waves people toward him. Gathering but sporadic\n     gun-fire in very near distance.\n\n                         WATCHING OFFICER\n                   (accented English)\n               COME TO ME! FOLLOW ME!\n\n     People immediately flocking around the authority figure.\n\n                                                         CUT TO:\n\n     The 14 year-old Indian Girl running in, more puzzled than\n     scared: why is that Cop wearing a jacket in this heat?\n\n                                                        BACK TO:\n\n     The Officer rips a yellow gun-shape from his jacket pocket.\n     The Pitcher sees it, instinctively tries to rip it away from\n     him. Gets a handful of collar, pulls as violently as he can,\n     shreds the front of the Officer's coat: a white linen vest\n     with a bulge in-front underneath the jacket...\n\n\n19   EXT. UNKNOWN ROOF TOP - SAME MOMENT                           19\n\n     The youngest grandson's wide-eyed face. Then we see the\n     Grandfather's right-hand slide down the other side of his\n     youngest Grandson's face, coming to rest on his other temple:\n     making sure he's still watching the Softball diamond now. The\n     Grandfather's right hand: missing an index and middle finger.\n\n                                              KINGDOM 8/18/06   10.\n\n\n\n\n20   EXT. COMPOUND SOFTBALL DIAMOND - SAME MOMENT                 20\n\n     Panic. The Officer swings the yellow gun-shape, what we now\n     realize is an electric drill crudely modified into something\n     else, bashes the Pitcher's face with it. Those that had\n     gathered have turned, are sprint-stumbling away...\n\n     The Officer closes his eyes, depresses the drill trigger,\n     vanishes before we comprehend the massive release of blue-\n     black chaos, expanding in an ever-wider sphere. Immediate\n     surroundings dissolve: players, parents, stands, cars, the\n     light standards surrounding the field and parking lot.\n\n\n21   EXT. CINDER-BLOCK CONCESSION STAND - SAME MOMENT             21\n\n     Located behind straight-a-way center field, at the nexus of\n     four fields. We see it from profile as shock-wave and\n     shrapnel blast the structure: another Officer hiding behind\n     it staggers out now, sprawls ugly: balance fucked from a\n     blown inner-ear. He also wears a jacket, and holds a modified\n     yellow plastic power drill. Moves uneasy toward screams in\n     the nearby parking lot.\n\n\n22   EXT. SOFTBALL DIAMOND PARKING LOT - NEXT MOMENT              22\n\n     The off-balance Officer stops over a 30 year-old African-\n     American woman pinned under a Toyota. She hyperventilates,\n     her bare leg and open-toed sandal kick at air. The Officer's\n     breathing calms: the sight of exposed skin as divine\n     reassurance. CLOSE-UP: the vented rear of the drill as the\n     14.4 volt motor sparks blue. A second blue-black explosion\n     that shreds the parking lot as cars smash into one another\n     desperate to escape.\n\n\n23   EXT. ADJACENT STREET - NEXT MOMENT                           23\n\n     Panicked women walking dogs. Frozen. A Police Land Cruiser\n     with bullet-scarred windows roars around the corner. Stops\n     near the women. They smile: cavalry to the rescue. Then a man\n     with leans out the window with an AR-15: point-blank\n     staccato. Tracers exit bodies, drill asphalt. The Land\n     Cruiser rolls, spraying passing homes indiscriminate...\n\n\n24   INT. JACKED LAND CRUISER - NEXT MOMENT                       24\n\n     Tearing through the streets, Passenger firing at all signs of\n     life. Sits back for a lightning-quick re-load. Leans back out\n     -- before he can begin firing again-\n\n                                              KINGDOM 8/18/06   11.\n\n\n\n\n25   EXT. COMPOUND STREET - SAME MOMENT                            25\n\n     -another Police Land Cruiser from nowhere hammers their\n     Driver's side. Vicious. The Passenger is launched out his\n     window, head-first into the curb. Both vehicles smoke-\n     screech. Momentary pause after the a massive collision.\n\n     Then Sergeant Haytham, 9MM in-hand, falls from the Second\n     Land Cruiser. Stalks bloody to the Passenger side of the\n     jacked Land Cruiser still slowly rolling backwards, leaking\n     all it's vital fluids, it's snapped drive-shaft leaving a\n     groove in the pavement. And Sergeant Haytham empties his clip\n     into the interior while walking along side.\n\n     The Officer Haytham told to 'move,' rips himself from the\n     Passenger's side of their vehicle, bleeding profusely,\n     screaming something unintelligible into his handheld radio.\n\n\n26   EXT. UNKNOWN ROOF TOP - SAME MOMENT                           26\n\n     Just the youngest Grandson's horrified eyes: he had no choice\n     but to see it all, carnage painted permanently. His face\n     still held tight between his Grandfather's hands. In Arabic:\n\n                         GRANDFATHER (O.C.)\n               Our Time is not a peaceful one. God\n               has left it to us to make it so.\n\n     Hold on those deep, young, brown eyes.\n\n     Those young brown eyes finally blink.\n\n                                                         CUT TO:\n\n\n27   INT. WASHINGTON DC ELEMENTARY SCHOOL- LATER                   27\n\n     Everyone eats snacks that the Fleurys brought. Kevin's the\n     center of attention. Fleury's passing out juice boxes.\n\n     Fleury's cell phone vibrates. TIGHT ON THE ID: 911. Fleury's\n     mid-juice-pass, answering his phone at the same time.\n\n     Kevin looks to his Dad, already grimacing. Fleury walks away\n     from the kids.\n\n                         RONALD FLEURY\n                   (surprised)\n               Fran?\n\n                                       KINGDOM 8/18/06   12.\n\n\n\nWe hear Fran's voice as though we're on the line with him:\nraspy-ragged, like he's been crying.\n\n                    FRAN (O.S.)\n          You getting this yet?\n\n                    RONALD FLEURY\n          Hey, I'm at Kevin's school. What's\n          goin' on?\n\n                     FRAN (O.S.)\n          I'm sorry, Brother.\n              (beat)\n          Riyadh. Many Dead.\n\nFleury's demeanor shifts to HARD immediately.\n\n                    RONALD FLEURY\n          Where exactly?\n\n                    FRAN (O.S.)\n          The Al-Rahmah Western Housing\n          Compound. Oil Company employees.\n          Hit a company picnic.\n\n                    RONALD FLEURY\n          How?\n\n                    FRAN (O.S.)\n          Big. Broad daylight. Blew up a\n          softball game.\n              (tears)\n          Kids, Brother.\n\nFleury looks at the kids eating and laughing.\n\n                    KEVIN FLEURY\n          Dad?\n\nFleury smiles best he can at his Son. Into the phone:\n\n                    RONALD FLEURY\n          When?\n\n                    FRAN (O.S.)\n          Just went off -- twenty minutes\n          ago. Two bombers. A Shooter crew as\n          diversion...it's just awful.\n\n                    RONALD FLEURY\n          Fran, I'm rollin' right now. Let me\n          call you back: I gotta ring bells\n\n                                         KINGDOM 8/18/06   13.\n\n\n\n                    FRAN MANNER (O.S.)\n          Go. I'll be here.\n\nFleury hangs up, walks to Kevin, kneels down - oblivious to\neveryone watching.\n\n                    RONALD FLEURY\n          Son, I gotta go to work.\n\n                    KEVIN FLEURY\n          We're gonna do ceramics...\n\n                    RONALD FLEURY\n          I gotta go to work...\n\n                    KEVIN FLEURY\n              (points to the phone)\n          Who was that?\n\n                    RONALD FLEURY\n          Big Fran -- you remember him?\n\n                    KEVIN FLEURY\n              (beat, thinking)\n          Uncle Fran? Put peanuts in his Coke\n          so he could drink and eat all at\n          the same time?\n\n                    RONALD FLEURY\n              (smile)\n          Where he's from in South Carolina\n          that's called fine-dining, Bud.\n\n                    KEVIN FLEURY\n          What happened?\n\n                     RONALD FLEURY\n              (beat)\n          Something bad.\n\n                    KEVIN\n              (impression of his Dad)\n          `Lotta bad people out there...'\n\n                    RONALD FLEURY\n              (smiles, already homesick)\n          I love you.\n\nKisses his boy's forehead hard.\n\n                    KEVIN FLEURY\n          You gonna go see him?\n\n                                             KINGDOM 8/18/06   14.\n\n\n\n                         RONALD FLEURY\n               I'm gonna try...\n\n     Looks at Lyla who's been through this drill too many times,\n     knows this face. Ronald can only give a little shrug, which\n     Lyla gives right back.\n\n                         RONALD FLEURY (CONT'D)\n                   (to Lyla)\n               Can you get a ride?\n\n     She nods yes. Miss Ross nearby, surprised by this:\n\n                         MISS ROSS\n               Where's your husband going?\n\n                         LYLA FLEURY\n               Ex-husband, and God knows.\n\n     Then a wave of fear ripples across her face. She hesitates,\n     then calls after him:\n\n                          LYLA FLEURY (CONT'D)\n               BE SAFE.\n\n     Ronald turns, gives a little Cheshire grin, puts the phone\n     back up to his ear.\n\n\n28   EXT. AL-RAHMAH HOUSING COMPOUND BLAST SITES - EVENING         28\n\n     The shattered softball diamond and parking lot. Emergency\n     lights swirl from everywhere. Acrid smoke.\n\n     FRANCIS MANNER (FBI LEGAT, US Embassy) is giant. The kind of\n     American that only grows in tiny southern hamlets. Military\n     whitewalls, short-sleeves, khaki Dockers, a thick Casio G-\n     shock, FBI credentials visible on a chain.\n\n     Hangs up his phone. Lifts his eyes: Hell from one side of the\n     frame to the other. Saudi teams setting up portable lights\n     that bathe the horror in industrial incandescent. Columns of\n     black smoke. Fleets of emergency vehicles. 100 uniformed men.\n     Another 200 in bio-suits combing the ball field, the parking\n     lot. Fran has to do something/anything.\n\n     Move through the horror with him now. His hands shake, his\n     face already dirty with soot. Jumps in with a Saudi team\n     pulling a half-burned WOMAN out of a smoldering Range Rover.\n     She fights them, gouging Fran's face, trying to get back in.\n\n     She is the woman we met at the gate of the compound.    She\n     wants her baby.\n\n                                            KINGDOM 8/18/06   15.\n\n\n\n     Fran bloodied, just kind of steps away from the woman. Leaves\n     the Saudi emergency team to fight with her. Backs away until\n     he feels grass under his feet. The woman's screams\n     reverberate. Fran just sits in the grass. Staring at the\n     woman, her shattered soul. Forces himself to look away. Eyes\n     come to rest on a child's baseball cap: ragged holes ringed\n     with black stains: where blood dried on the blue felt.\n\n                         VOICE (O.C.)\n                   (immediately behind)\n               Fran. You gotta stand Big Man...\n\n     Fran turns to find REX BURR: 5'7\" fireplug. A long silence.\n     Fran points to the hat:\n\n                         FRANCIS MANNER\n               Rex, how old were you when your hat\n               was that small?\n\n     We watch tears well in Rex's eyes...\n\n                         REX BURR\n               You gotta stand, Big Man.\n\n     Fran does. Wipes his hands on his pants. Slack-jaw hopeless.\n     The first moments in what will be weeks of reverse-\n     engineering the murders of unknown dozens. He and Rex step to\n     a group of WALKING-WOUNDED. A NEIGHBOR doles out mugs of\n     coffee. Most everyone from the compound is out, pondering the\n     proximity. SAUDI emergency teams sprint past. Fran spits,\n     settles in:\n\n                         FRANCIS MANNER\n               We need to get everyone back, then\n               get all their-\n\n     SOMETHING HUGE EXPLODES over their shoulders, 50 yards away.\n     The Attack's coup de grace: wait for people to lift up their\n     heads, hit them again. Five times the size of the suicide\n     bombs. Shreds emergency vehicles, nearby homes and apartment\n     buildings. Kills Saudi rescuers by the bushel. Fran is\n     crushed by a flying portable light standard. Rex is blown\n     into the man handing out coffee. The walking wounded get\n     decimated.\n\n\n29   EXT. AL-RAHMAH HOUSING COMPLEX - NEXT MOMENT               29\n\n     Slowly lift up and hold on Al-Rahmah as it burns. Black smoke\n     and flame pour skyward from the site of the coup de grace\n     explosion. Massive crater. Screams. Chaos postcard.\n\n                                               KINGDOM 8/18/06   16.\n\n\n\n\n29A   EXT. WASHINGTON, DC HOUSE - DAY                             29A\n\n      Establishing shot.\n\n\n29B   INT. FRAN MANNER'S WASHINGTON, DC HOUSE - DAY               29B\n\n      Fleury sits with GLENDA MANNER... a toy remote-control robot\n      comes into the room. Little Teddy Manner (5) peeks his head\n      around the corner of a door.\n\n                          GLENDA\n                It was... I don't know what time it\n                was... the dishwasher's broken...I\n                was waiting for the dishwasher...\n                The doorbell rang - I thought it\n                was... it wasn't the dishwasher\n                guy...It wasn't. It wasn't.\n\n      Glenda breaks down, starts to completely lose it. Her little\n      boy Teddy climbs up onto his mother.\n\n\n29C   INT. FRAN MANNER'S HOUSE - TEDDY'S ROOM - LATER             29C\n\n      Fleury sits on the bed with little Teddy looking at a\n      beautiful black and white photo of Fran holding a new born\n      Teddy up over his head. Eye to eye.\n\n      Little Teddy shows Fleury his toy helicopter. His dad's\n      soldier boots.\n\n      Fleury can't take it.\n\n\n29D   INT. FRAN MANNER'S HOUSE - LIVING ROOM   - LATER            29D\n\n      Fleury stands with Glenda.\n\n                          FLEURY\n                Glenda, I want you to look at me.\n\n      A PAUSE: Fleury freezes up on a shock of raw emotion,\n      struggling to contain himself.\n\n                          FLEURY (CONT'D)\n                Please... I'm going to take care of\n                this. Whoever did this... I give\n                you my word. Whoever did this will\n                pay. I can't change this, but I can\n                promise you that I will make\n                someone pay for this.\n\n                                            KINGDOM 8/18/06    17.\n\n\n\n\n30   INT. HOOVER BUILDING, FBI HEADQUARTERS - DAY, EST           30\n\n     Startling quiet in contrast. AGENTS cluster beneath 32-inch\n     Televisions suspended from the ceiling. Tuned to Al-Jazeera,\n     CNN, BBC, etc. Most eyes focus on the double-bloody scoops\n     from CNN. Volume low:\n\n                         CNN REPORTER\n               ...1 hour ago: blasts in Saudi\n               Arabia, in or around the `Al-\n               Rahmah' western housing complex\n               near Riyadh. More than 100 feared\n               dead, including children. The Saudi\n               Foreign Minister has released a\n               statement calling this a `heinous\n               act possibly committed by\n               foreigners...'\n\n                         BBC REPORTER\n               ...homes to thousands of Westerners\n               and other non-Saudis who work in\n               the Kingdom, there have been\n               several attacks on these compounds\n               in the last five years. As such,\n               they have become very tight in\n               terms of security, with both the\n               Saudi National Guard and police\n               taking command.\n\n     Fleury walks under the televisions. A folder in-hand, heading\n     down a long hallway, subordinating his fury to tasks-at-hand.\n\n\n31   INT. COMMAND & TACTICAL OPERATIONS CENTER (CTOC) - NEXT     31\n     MOMENT\n\n     Fleury enters, steps to a podium, opens his folder. 50 Agents\n     seated lecture hall-style. Steam from fifth, sixth cups of\n     coffee. Plasma screens behind show still-images of the crime\n     cribbed from Al-Jazeera.\n\n     Throughout the scene, Fleury constantly refers to a roster of\n     his ERTs.\n\n                          RONALD FLEURY\n               Numbers so far: 100+ dead, 200+\n               injured. The target was a softball\n               game. Rumor is the Killers wore\n               Saudi police uniforms.\n                   (beat)\n               Special Agent Fran Manner was\n               killed.\n\n                                       KINGDOM 8/18/06     18.\n\n\n\nJANET MAYES, 29 years-old, stifles a sob in the front row.\nFleury steps from behind the podium, puts a hand gently on\nJanet's shoulder, leans in and whispers something no one but\nJanet hears. Whatever his words, they give back her\ncomposure. She nods.\n\n                    RONALD FLEURY (CONT'D)\n          So was Rex Burr from State.\n\nFleury lets the news absorb as he steps back to the podium.\nNo one says a thing. Fleury lifts his eyes again, real\ntrouble maintaining control...\n\n                    RONALD FLEURY (CONT'D)\n          Fran was the best among us...we'll\n          feel this loss the rest of our\n          days...\n              (beat, moment to regroup)\n          Grant, take stabs at bomb sizes.\n\nGRANT SYKES. 50 years-old. Virginia State Trooper before\njoining the FBI. Law-and-order formidable: sharp-smart\nCharlottesville accent. Studies the images for a beat...\n\n                    GRANT SYKES\n          From the craters, looks like they\n          used a High Explosive... possibly\n          military grade: can't fit that much\n          TNT into a vest. 20, 30 pounds of\n          PETN: they got it. Semtex or C-4:\n          they could get it. The third there,\n          God knows...that crater looks like\n          a plane dropped a 500-pounder...\n\n                    RONALD FLEURY\n          Obviously a secondary blast after\n          the initial devices used to lure\n          first responders to the scene.\n          Don't know anything about where or\n          what it was yet.\n\n                    GRANT SYKES\n          This is how they do it.\n\nADAM LEAVITT. 34 years-old, sought-after Investigator.\nThere's a constant, intense grind to this guy, a mind and\nmouth incapable of quiet. He paces around the room, then\neagle-eyes the bomb images... starts surge-scrawling crude\ndiagrams of the blast site on a piece of loose leaf. Feels\nmore like nervous doodling than work. Not looking up from his\ndrawing:\n\n                                        KINGDOM 8/18/06   19.\n\n\n\n                    ADAM   LEAVITT\n          I already know   the answer, but any\n          chance in Hell   we get to go over\n          there, use our   hands?\n\n                    RONALD FLEURY\n          If you already know the answer\n          Adam, why ask the question?\n\nFleury circles Leavitt's name on the roster. Leavitt never\nstops drawing.\n\n                    SYKES\n          We're not seeing this kind of\n          planning and execution anywhere\n          else...these ain't hot-wired\n          artillery shells waiting for\n          Humvees to roll by.\n              (pointing at the screens)\n          These hits are coordinated:\n          planning, timing, and big, broad-\n          daylight balls-\n\n                    JANET MAYES\n              (almost trance-studying\n               the images)\n          Yeah, So... did they all happen\n          during daylight?\n\nAnother great question. Fleury looks over to AGENT #1 on his\nimmediate right, an egg-head type with a big binder in front\nof him. Everyone's eyes follow. Agent #1 flips quickly\nthrough the binder, back-and-forth, searching. Fleury crosses\nhis name off of his roster. Then:\n\n                    AGENT #1\n          Yes. At least the first parts of\n          the attacks.\n\nEveryone smells it: that's big -- more proof these attacks\nare being carried out by one, very skilled Terror Cell.\n\n                    JANET MAYES\n          We had two others...North of Riyadh\n          and the oil thing. What was that?\n\n                    ADAM LEAVITT\n          The Refinery... Ras Tenura\n          Refinery.\n\n                    JANET MAYES\n          Yeah, south of Jeddah. Same thing:\n          daylight, suicide bombers. Right?\n                    (MORE)\n\n                                       KINGDOM 8/18/06   20.\n\n                    JANET MAYES (CONT'D)\n          Same thing. Followed by machine gun\n          crews. Collect and kill.\n\n                    ADAM LEAVITT\n          Yup.\n\n                    RONALD FLEURY\n          This is not new in concept. It is\n          new in scope. It's bigger. Very\n          sophisticated. Command and control\n          was flawless. They found the\n          largest kill zone they could and\n          they did it... they did it by being\n          patient.\n\n                    ADAM LEAVITT\n          Any rumors or confirmations of\n          uniforms being used in the other\n          two attacks?\n\nFleury circles Mayes' name on the ERT roster.\n\n                    AGENT #1\n              (from memory)\n          No. I know this is the first for\n          that.\n\n                    GRANT SYKES\n          That's `worst case scenario' if\n          you're still asking for my stab,\n          Sir. A crew who can build bombs\n          this big, with this level of eyes-\n          on control and detonation\n          coordination... has access to Saudi\n          uniforms now...I mean...Baby Jesus.\n\n                    LEAVITT\n          Anyone take credit?\n\nFleury checks from his notes.\n\n                    FLEURY\n          Abu Hamza. Saudi Al-Qaeda. Bin-\n          Laden-wanna-be. We know he was in\n          Afghanistan, then moved to Iraq.\n          Now he seems to have come home.\n          He's clearly becoming increasingly\n          active...\n\n                    ADAM LEAVITT\n          If it is Hamza, he's definitely\n          turning up the volume over there.\n                    (MORE)\n\n                                             KINGDOM 8/18/06   21.\n\n                          ADAM LEAVITT (CONT'D)\n                Not to beat a dead horse, Sir, but\n                if there was ever a time to get\n                boots on Saudi sand...\n\n      Sykes studies Leavitt with what is best described as\n      substantial skepticism. Fleury circles Sykes' name on his\n      roster.\n\n                          JANET MAYES\n                They can't afford to appear as if\n                they are losing any kind of\n                control. They lose control over\n                their country, their people...then\n                they risk losing control over the\n                oil. They won't let us in. No way.\n\n      Fleury's P.O.V.: His open folder on the podium. A memo\n      printed on Department of State letterhead. Pulls the memo,\n      reads it aloud, calm laced with rage.\n\n                           RONALD FLEURY\n                From the State Department, one hour\n                ago: `We are in agreement with the\n                Saudi security assessment that any\n                additional American presence on\n                Kingdom soil represents reckless\n                risk. Therefore it is the Secretary\n                of State's position that only after\n                the situation has been evaluated\n                and contained, should the Federal\n                Bureau of Investigation activate\n                Rapid Deployment.'\n                    (folding the memo)\n                The National Security Advisor and\n                the Attorney General agreed.\n                    (beat)\n                I'm going to get us access. Keep\n                your go bags hot. It's gonna come\n                fast.\n\n      Leavitt stares at Fleury as he moves fast out of the room.\n\n                           ADAM LEAVITT\n                    (beat)\n                Well... I guess he's gonna go get\n                us some access.\n                    (beat)\n                How's he gonna do that?\n\n      Sykes just hard-eyes Leavitt.\n\n\n31A   SEE 29A - 29D (MOVED, NOT OMITTED)                          31A\n\n                                              KINGDOM 8/18/06   22.\n\n\n\n\n32   INT. SAUDI NATIONAL GUARD PRISON - UNKNOWN TIME              32\n\n     COLONEL AL-GHAZI, Saudi Police, 45 years-old, mustache as         \n     thick as Sykes'. A firecracker-loud crack makes him flinch.\n     He stands in the back of the room, not participating in the\n     interrogation. Just observing. Clearly not happy about what\n     he's observing.\n\n     His POV: The Officer from the second Land Cruiser that rammed\n     the fake and killed those inside, Sergeant Haytham. slab-\n     cuffed and being worked over hard buy a couple of thick-\n     fisted SAUDIS.. Silent tears roll off his cheek, left ear\n     split ghastly. A MAN standing far right of him beats him: the\n     firecracker sound again.\n\n     Al-Ghazi looks away, biting his tongue. Obviously wants this\n     over.\n\n     In-charge of the interrogation: GENERAL ABDUL MALIK. He\n     doesn't appear sadistic, but very determined to get the truth\n     from Sergeant Haytham by any means necessary. Those\n     distinctions blur easily. Malik gives a `hold-up' signal. The\n     following exchange in Arabic:\n\n                         GENERAL ABDUL-MALIK\n               No falsehoods, Sergeant Haytham.\n               What was your involvement?\n\n                         SERGEANT HAYTHAM\n               Killing those I saw responsible.\n\n                         GENERAL ABDUL-MALIK\n               So none could be questioned?\n\n                         SERGEANT HAYTHAM\n                   (puzzled, angry)\n               I don't understand.\n\n     A nod from General Malik: another vicious crack.\n\n                         GENERAL ABDUL-MALIK\n               You were born and raised in Suweidi-\n\n                         SERGEANT HAYTHAM\n               -that is not a crime-\n\n                         GENERAL ABDUL-MALIK\n               -it should be.\n\n                           SERGEANT HAYTHAM\n               It's not.\n\n                                          KINGDOM 8/18/06   23.\n\n\n\n                    GENERAL ABDUL MALIK\n          Do you know Abu Hamza?\n\n                       SERGEANT HAYTHAM\n          I do not.\n\n                    GENERAL ABDUL-MALIK\n          Your brother was killed fighting\n          the Americans. True or false?\n\n                    SERGEANT HAYTHAM\n          I am not my brother.\n\n                    GENERAL ABDUL-MALIK\n          Your brother--\n\n                    SERGEANT HAYTHAM\n          I am NOT my brother!\n\n                       GENERAL ABDUL-MALIK\n          TRUE or-\n\nAl-Ghazi interrupts.\n\n                    COLONEL AL-GHAZI                              \n          He has answered the question.\n\nMalik shoots Al-Ghazi a unequivocal SHUT THE FUCK UP hard\neye. Then back on Haytham.\n\n                     GENERAL ABDUL-MALIK\n          We found six more uniforms than you\n          were assigned in your possession --\n          that is a crime: especially when\n          you consider the Attackers wore our\n          Uniform...\n\nAnother nod, another crack. Al-Ghazi, flinching, becomes more\nalert.\n\n                       SERGEANT HAYTHAM\n          Uniforms?\n\nGeneral Malik in Haytham's face:\n\n                       GENERAL ABDUL-MALIK\n          Truth!\n\n                    SERGEANT HAYTHAM\n          I sweat. I'll say it again because\n          it is true. I need more uniforms\n          because I must change during\n          shifts...look at my shirts.\n\n                                            KINGDOM 8/18/06     24.\n\n\n\n                         GENERAL ABDUL-MALIK\n               I am not interested in your sweat.\n\n                         SERGEANT HAYTHAM\n               -then look at my jackets. Please.\n               Permanent stains...no matter how\n               many times they're cleaned...\n\n     Colonel Al-Ghazi grimacing now, leaves the room.                  \n\n\n33   INT. SAUDI NATIONAL GUARD - STORAGE - NEXT MOMENT            33\n\n     We follow. Al-Ghazi hustling into an evidence storage room.\n     Searching. Finds a Locker labelled `Haytham.' Opens it. Pulls\n     out several shirts still in the plastic dry-cleaning sheaths:\n     yellowed, permanent stains on the armpits of each.\n\n\n34   INT. SAUDI NATIONAL GUARD PRISON - INTERROGATION ROOM        34\n\n     Al-Ghazi walks back into the room with the shirts, lays them\n     down on the table in front of the General -- all business.\n\n                         COLONEL AL-GHAZI                              \n               He's telling the truth.\n\n     The only sound for a long, unsettled moment: Sergeant\n     Haytham's labored breathing. Malik looks at the shirts, then\n     Al-Ghazi, hesitates, steps away.\n\n                         GENERAL ADBUL-MALIK\n               You were injured when you used your\n               vehicle to protect your country. Do\n               you understand?\n\n     Al-Ghazi moves in, begins uncuffing Haytham's bloody-raw\n     wrists, hard-eyeing Malik the whole time. These men clearly\n     don't like each other.\n\n\n35   EXT. SAUDI NATIONAL GUARD PRISON - LATER                     35\n\n     Al-Ghazi and Haytham sit alone. Al-Ghazi smokes. Haytham\n     looks down at his feet.\n\n                         COLONEL AL-GHAZI                              \n               Look at me, Haytham.\n\n     Haytham slowly looks up at Al-Ghazi.\n\n                                            KINGDOM 8/18/06   25.\n\n\n\n                         COLONEL AL-GHAZI (CONT'D)                     \n               You saved lives today. I believe\n               that. You served your country. I\n               believe that.\n\n                         HAYTHAM\n               I love my country.\n\n                         COLONEL AL-GHAZI                              \n               I believe that, Haytham...\n\n     Haytham Holds Al-Ghazi's eyes a good long beat...\n\n                         HAYTHAM\n               I love my country...\n\n     Al-Ghazi slow nods.\n\n                         COLONEL AL-GHAZI                              \n                   (beat, breaks eye-contact)\n               You will have your revenge for what\n               needed to be done to assure them\n               you weren't involved.\n\n     Haytham never blinks. Eyes hard. Stoic. Clear.\n\n\n36   EXT. WASHINGTON D.C. STREETS - NOON                          36\n\n     GRACE looks like a barrel-chested lineman. A four-man\n     security detail behind. He and Ronald Fleury walk side-by-\n     side. Janet Mayes just behind them.\n\n                          DIRECTOR GRACE\n               Everyone's terrified, so nothing\n               moves. Paralysis. You and your team\n               aren't going anywhere.\n                   (beat)\n               And this meeting is just a circle-\n               jerk, Ronnie: Attorney General\n               Young's going to go through the\n               motions because protocol says we\n               get an appeal. We'll be on record,\n               but expect nothing more.\n\n     Nothing from Fleury.\n\n                         DIRECTOR GRACE (CONT'D)\n               Can you handle this? Keep your\n               mouth shut when people way above\n               you say things you'll hate?\n\n                                            KINGDOM 8/18/06   26.\n\n\n\n                          RONALD FLEURY\n                   (beat)\n               Yeah, sure. No problem.\n\n                         DIRECTOR GRACE\n                   (re: Janet)\n               What about Agent Mayes?\n\n                          RONALD FLEURY\n               Ask her.\n\n                         DIRECTOR GRACE\n                   (to Janet)\n               What about you?\n\n                         JANET MAYES\n               I'll be fine.\n\n\n37   INT. ATTORNEY GENERAL GIDEON YOUNG'S OFFICE - NOON           37\n\n     Fleury, Grace and Mayes enter. Handsomely decorated,\n     expansive: a lifetime of notable handshakes framed in black\n     and white. The biggest is a picture of Young and Billy Graham\n     that could be titled, `lucky for you, we have all the\n     answers.'\n\n     Gideon Young sits behind his Federalist-era oak desk: a\n     marathoner's build, a smile too bright-perfect for his age.\n\n     Two others in-attendance. A pear-shaped 54 year-old man with\n     a Midwest-honest, ruddy-oval face: Ellis Leach, Assistant\n     Secretary, Bureau of Near Eastern Affairs, Department of\n     State\n\n     And a 51 year-old Hispanic woman in conservative Chanel:\n     enough femininity without diminishing toughness: Maricella\n     Canavesio, Deputy National Security Advisor, White House\n\n                         DIRECTOR GRACE\n               I apologize if we're late-\n\n                         GIDEON YOUNG\n               They were early.\n\n                         DIRECTOR GRACE\n               You know Special Agent Fleury?\n\n                          GIDEON YOUNG\n               I do.\n\n                                       KINGDOM 8/18/06    27.\n\n\n\n                    DIRECTOR GRACE\n          This is agent Janet Mayes, she's\n          one of our Arabic experts.\n\nJanet stares at Young, looking mildly in over her head.\n\n                    GIDEON YOUNG\n          OK. The latest.\n\nGrace sits, nods to Fleury: you're up...\n\n                    RONALD FLEURY\n          Two suicide bombers. Rumors they\n          were dressed as Saudi Police. We\n          believe this is the work of Saudi\n          terrorist named Abu Hamza.\n\nYoung just stares at Fleury kind of odd like a kid staring at\na mushroom flavored Popsicle.\n\n                    GIDEON YOUNG\n          Go on.\n\nFleury continues:\n\n                     RONALD FLEURY\n          A Shooter crew served as\n          distraction. After the initial\n          attack there was a lull to allow\n          Saudi Emergency Teams...and our own\n          attaches...to collect. Then a\n          secondary blast was triggered,\n          aimed at those first responders. So\n          they targeted families and rescuers\n          with one attack.\n              (mildly sarcastic:)\n          I think that's a clear signal that\n          their definition of `Enemy' is\n          expanding.\n\n                    MARICELLA CANAVESIO\n          My God.\n\n                    GIDEON YOUNG\n          Let us never forget how cheap life\n          is over there. Now...I have seven\n          minutes before my next meeting, so\n          who's talking first?\n              (to Fleury and Grace, slow\n               like a Kindergarten\n               teacher:)\n          You two digested the memo?\n\n                                       KINGDOM 8/18/06   28.\n\n\n\nStoic nods from each. Ellis Leach raises his hand, a tone\nthat's worlds away from Young's.\n\n                     ELLIS LEACH\n          I'll go first if that's okay\n          Maricella?\n              (off her `yeah, sure' nod)\n          First, I'm sorry about Fran Manner.\n\nGideon Young remembers, nods along solemnly.\n\n                    DIRECTOR GRACE\n          As we are about Rex Burr.\n\n                    ELLIS LEACH\n          I met with Prince Thamer at the\n          Saudi embassy fifteen minutes after\n          I heard this morning's news. After\n          speaking with Thamer, I advised we\n          withhold additional US personnel\n          because a big part of the religious\n          justification for these bombs is\n          the presence of current US\n          personnel. More boots on Saudi soil\n          make an already combustible\n          situation more so. I know that's\n          not the answer you want, but...\n\nMotions to Maricella: the floor is yours.\n\n                    MARICELLA CANAVESIO\n          My two cents: The Saudis haven't\n          asked for FBI help. Sounds like\n          they've done just the opposite. If\n          we force the issue, that could\n          further anger an utterly important\n          ally that shares a 1000-mile long\n          border with Iraq.\n\n                    GIDEON YOUNG\n              (to Grace and Fleury)\n          It's all rock-solid logic.\n\n                     DIRECTOR GRACE\n              (beat)\n          We would just like to be on record\n          as saying we think we should go\n          ASAP-\n\n                    GIDEON YOUNG\n          That's not going to happen\n\n                                       KINGDOM 8/18/06   29.\n\n\n\nYoung stands: we're done. Fleury's look: that's it? Young's\nalready collecting his briefcase, jacket-\n\n                    GIDEON YOUNG (CONT'D)\n              (mock sincerity to the\n               room:)\n          -so as we present this to the\n          public, let's - as best we can -\n          try to view this through an FBI\n          Agent's eyes.\n              (beat...To Grace:)\n          And please let me know if there's\n          anything else we can do for you.\n\nMeeting seems over. Not quite. Fleury can't keep his mouth\nshut.\n\n                    RONALD FLEURY\n          Sir, how would you imagine it looks\n          viewed through an FBI agents eyes?\n\n                       GIDEON YOUNG\n          Pardon me?\n\n                    RONALD FLEURY\n          I'm interested in how you think\n          this situation is viewed through\n          our eyes.\n\nYoung, eyes on a Republican-gold Rolex, instantly perturbed\nthe meeting isn't ending.\n\n                    GIDEON YOUNG\n          It's some variation on vengeance...\n          When one of your own is killed,\n          Agents lose their analytical powers\n          - kind of a greatest strength,\n          greatest weakness thing...\n\n                     RONALD FLEURY\n          If I wanted vengeance, I'd have\n          whispered `Rex Burr' into Ellis's\n          ear right when we walked in.\n              (beat)\n\nEyes migrate to Fleury --\n\n                    RONALD FLEURY (CONT'D)\n          This isn't Terrorism, ma'am. It's\n          just Serial Murder.\n\n                    MARICELLA CANAVESIO\n          What's the distinction?\n\n                                       KINGDOM 8/18/06   30.\n\n\n\n                    RONALD FLEURY\n          To call this massacre an act of\n          terrorism... that implies a\n          specific political agenda. To me,\n          these killings are so futile and\n          unbalanced that they feel utterly\n          sociopathic- more like Charles\n          Manson than Osama Bin Laden...\n\nFleury looks to Mayes. She clears her throat. Delivers the\nfollowing with utter precision.\n\n                    JANET MAYES\n              (beat, fuck it: Go)\n          Al Qaeda lost the first phase of\n          this war, so a new, zero-sum phase\n          has begun: if you won't join us,\n          we'll let loose the truly talented\n          Murderers... Abu Hamza. He will\n          kill so many of you that the\n          resulting humiliation of the Saudi\n          Royal Family will cause an exodus,\n          a rebellion, both. Because the\n          Royal Family simply cannot protect\n          you or yours any longer.\n\nFleury studies Janet with solid respect. He gives Janet a\nsubtle nod: \"Nice work.\"\n\n                    RONALD FLEURY\n          When she says talented, she's not\n          talking about the walking-bombs who\n          can sneak past any and all\n          security, nor the hi-jackers tough\n          enough to take an airliner. We're\n          talking about the Man who teaches\n          them how...\n\n                    JANET MAYES\n          --the operational commander who\n          organizes, trains, plans,\n          encourages. That is who we're\n          fighting.\n\n                    RONALD FLEURY\n          If we don't get inside Saudi Arabia\n          within 36 hours, there is no chance\n          we catch the killer responsible for\n          Al-Rahmah. None.\n\n                                            KINGDOM 8/18/06   31.\n\n\n\n                         ELLIS LEACH\n               Okay. I believe it all. So doesn't\n               your team in that country represent\n               the kind of target one of these\n               `Masters' would die for? Trade ten\n               of their own for one of you?\n\n                         RONALD FLEURY\n               To not engage these criminals out\n               of fear for our personal safety is\n               just another way of saying `uncle.'\n\n     Fleury takes another deep breath.\n\n                         RONALD FLEURY (CONT'D)\n               I'll say it another way: Evidence\n               starts to go cold after twenty four\n               hours. If we can't get in now, we\n               will not find the man or men\n               responsible for this crime. We\n               couldn't do it at Khobar; we\n               couldn't do it in Yemen; we have\n               barely scratched the surface in\n               Iraq. And we are on verge of not\n               doing it here. They are getting\n               stronger, we are getting weaker. I\n               just lost a very good friend and I\n               would very much like to go and do\n               my job.\n\n     Beat.\n\n                         GIDEON YOUNG\n                   (chuckle)\n               That was spirited... let's all\n               thank God Special Agent Fleury\n               doesn't make policy decisions. He'd\n               turn the FBI into Patton's Third\n               Army.\n\n     Young stands. Fleury contemplates career-ending violence.\n\n\n38   EXT. WASHINGTON D.C. - DAY                                  38\n\n     Janet, Fleury and Grace walking the rows of seven-foot bronze\n     soldiers. Street-cart hotdogs from foil wrappers.\n\n                         DIRECTOR GRACE\n                   (to Fleury)\n               I see the look in your eyes. That\n               look is trouble: old school, play\n               ground shit, vengeance...\n\n                                       KINGDOM 8/18/06   32.\n\n\n\n                    RONALD FLEURY\n          It's not vengeance.\n\n                    DIRECTOR GRACE\n          It ain't justice. It's stronger.\n          We've all been there. I have.\n          Vengeance is always dirty, Ronnie.\n\n                    RONALD FLEURY\n          I just can't sit this out. I can't\n          watch this not get dealt with. Not\n          again.\n              (a beat...)\n          Know what my high school football\n          coach used to say to me?\n\n                    DIRECTOR GRACE\n          What?\n\n                    RONALD FLEURY\n          \"HIT SOMETHING.\" All night long,\n          Coach Bailey would scream \"HIT\n          SOMETHING.\" Every play.\n\n                    DIRECTOR GRACE\n          That's good coaching.\n\n                    RONALD FLEURY\n          I'm fixing to go hit something,\n          boss. You with me?\n\n                    DIRECTOR GRACE\n          How you gonna do it?\n\n                    RONALD FLEURY\n          The Saudis covet good PR as much as\n          their Oil: 15 of 19 hijackers on 9-\n          11 means most Americans will never\n          stop asking if that Saudi Oil is\n          worth it. It's all about press.\n\n                    DIRECTOR GRACE\n          Few more moves and it's Total War,\n          Ronnie. The only time Treason is\n          palatable is when it's done\n          righteously and completely...\n\nFleury digesting Grace's words: moments pass. Then he looks\nto Janet.\n\n                    JANET MAYES\n          Oh, I'm in...Not a question. I'm\n          definitely going.\n\n                                              KINGDOM 8/18/06   33.\n\n\n\n\n39   INT. LOCAL COFFEE JOINT - 5:30 PM, EST                       39\n\n     Elaine Flowers, Senior Correspondent, Washington Post: Coffee\n     amp'd, deep black raccoon eyes - heavy wrinkled khakis.\n     Fleury sits across from her. We've entered mid-scene:\n\n                         RONALD FLEURY\n               What's your take?\n\n                         ELAINE FLOWERS\n               Looks like every overthrow in\n               history: once the guys with the\n               guns are no longer trustworthy, the\n               government's days are numbered.\n\n                         RONALD FLEURY\n               White House call you with a spin?\n\n                         ELAINE FLOWERS\n               You kidding? We don't talk since I\n               broke the Vice President's guy\n               cooking dirty intel on Iran. They\n               hate me. What's up, Fleury?\n\n                         RONALD FLEURY\n               How hard you gonna hit the Royal\n               Family in your column tomorrow?\n\n                         ELAINE FLOWERS\n               With a sledgehammer.\n\n                         RONALD FLEURY\n               With the bombings? Or other\n               things...\n\n                         ELAINE FLOWERS\n               What's \"other\" than the bombings?\n\n                         RONALD FLEURY\n               I know you're tracking Al Haramain.\n\n                          ELAINE FLOWERS\n               Is that what you want to talk\n               about? Saudi officials making\n               donations that end up... What?\n               Blowing up trains in Paris? Buses\n               in London?\n\n                         RONALD FLEURY\n               Sometimes. Seems that just might\n               happen.\n                         (MORE)\n\n                                       KINGDOM 8/18/06   34.\n\n                    RONALD FLEURY (CONT'D)\n          We got some other stuff: Missing\n          girls out of a Houston Four Seasons\n          Hotel that was heavily populated by\n          some \"Saudi officials.\" Little\n          things...\n\nFlowers eyes go WIDE. Smiling...\n\n                    ELAINE FLOWERS\n          Murder...Hookers...Houston? Can I\n          take some notes?\n\n                    RONALD FLEURY\n          I'm not saying that.\n\n                    ELAINE FLOWERS\n          Are you saying anything?\n\n                    RONALD FLEURY\n          I need a favor.\n\n                    ELAINE FLOWERS\n          I don't do favors, Ronnie.\n\n                     RONALD FLEURY\n          When it's real and it will be\n          real... I'll come to you with what\n          we have first. It's yours.\n          Exclusive.\n\n                      ELAINE FLOWERS\n          OK.\n\n                    RONALD FLEURY\n          You call Thamer at the Embassy.\n          Tell him that the FBI is getting\n          real close to laying out some major\n          Saudi VIP indictments relating to\n          newly uncovered charity financing\n          out of a Boston investment firm.\n          We're gonna freeze a lot of Saudi\n          cash and roll out some major\n          embarrassment.\n\n                    ELAINE FLOWERS\n          Can I mention Houston?\n\n                    RONALD FLEURY\n          It's a free world, baby. Ask him to\n          comment.\n\n                      ELAINE FLOWERS\n          He won't.\n\n                                            KINGDOM 8/18/06   35.\n\n\n\n                         RONALD FLEURY\n               Tell him that I'm running the\n               investigation.\n\n                         ELAINE FLOWERS\n               OK.\n\n                         RONALD FLEURY\n               Tell him that I'm not the nicest\n               kid on the block.\n\n                         ELAINE FLOWERS\n               That would be accurate.\n\n                         RONALD FLEURY\n               I want fifteen minutes with him\n               tonight.\n\n                         ELAINE FLOWERS\n               Wow. OK. And I get what?\n\n                         RONALD FLEURY\n               I come to you first. No one else.\n\n                         ELAINE FLOWERS\n               What's really going on here,\n               Ronnie? You going strong over Fran\n               Manner?\n\n     Fleury just stares at her.\n\n                         RONALD FLEURY\n               I'm just trying to do my job,\n               Elaine. That's it. Call Thamer.\n\n                         ELAINE FLOWERS\n               I'll see what I can do.\n\n\n40   EXT. WILLARD HOTEL - WASHINGTON DC - NIGHT                 40\n\n     Frenetic Doorman-Valet ballet. 2 black Suburbans with red-\n     blue diplomatic plates swing onto the round-about. A bald,\n     waif-like 38 year-old Saudi MAN gets out of the lead vehicle.\n\n     Fleury waiting outside, eyes on his watch. To Thamer:\n\n                         RONALD FLEURY\n               Get back in.\n\n                                            KINGDOM 8/18/06   36.\n\n\n\n\n41   INT. DIPLOMATIC SUBURBAN - MOMENTS LATER                   41\n\n     A big bodyguard sits up front. Fleury sits in back, aims the\n     AC vents his way. Prince Thamer sits next to him. Bright\n     lights from the trail suburban illuminate the interior.\n\n     Prince Thamer looks more than a bit baffled.\n\n                         RONALD FLEURY\n               Too many people we both know were\n               at the bar. It's a pleasure to meet\n               you, Your Highness.\n\n                         PRINCE THAMER\n               I had an interesting conversation\n               with a reporter from the Post.\n\n                         RONALD FLEURY\n               She can be a bit of an\n               exaggerator... I'm sure things were\n               somewhat over-stated. I see myself\n               as friend of Saudi Arabia. I just\n               need a little cooperation, that's\n               all.\n\n                         PRINCE THAMER\n               What kind of cooperation??\n\n                         RONALD FLEURY\n               Full cooperation: my Team cleared\n               to land at Prince Sultan Air Base.\n               Tomorrow. We want to help in a very\n               muscular way, quickly.\n\n                         PRINCE THAMER\n               Next month would be as soon as...\n\n     Fleury takes a beat.\n\n                         RONALD FLEURY\n               This goes one of two ways. First:\n               The FBI with the White House go on\n               the kind of aggressive PR \"Saudi\n               Royal Family Decaying Monarchy\"\n               bender that just can't help but\n               hurt. Really hurt. And I don't care\n               how many Chinese are lined up to\n               buy the oil. You know it's gonna\n               hurt.\n\n                         PRINCE THAMER\n               My family is not decaying-\n\n                                       KINGDOM 8/18/06   37.\n\n\n\n                    RONALD FLEURY\n          And then we bring the hammer down\n          hard as hell: Bust Al Haramain - we\n          got direct links from Riyadh - two\n          wives donating ten million to three\n          Arab-American cultural centers in\n          Boston. Then what gets kind of not-\n          funny is how some of that cash\n          found its way to Jakarta and some\n          Mosques that have these training\n          camps built right next to them.\n          It's kinda funny... you got little\n          kids playing over here, and some\n          not so little kids playing with\n          guns over here. That's kinda odd.\n\n                    PRINCE THAMER\n          You have no proof of this.\n\n                    RONALD FLEURY\n          We're getting there, Sir. And I\n          haven't even brought up the two\n          girls still missing out of Houston.\n          This is big. It is real. And I know\n          you only care so much about public\n          American opinion, Sir. But the\n          story will be covered... Big...\n\nThamer is clearly rattled. Fleury is starting to crack this\nman.\n\n                    RONALD FLEURY (CONT'D)\n          And this ain't the Metro section.\n          It's above the fold, just below the\n          date. Words like these get\n          syndicated to papers like the Omaha\n          World-Herald, The Terrell Tribune --\n          You ever been to Terrell, Texas?\n\n                    PRINCE THAMER\n          What is your point?\n\nFleury looks back to him.\n\n                    RONALD FLEURY\n          Last I heard, 112 people lost their\n          lives in your country. One of them\n          was a good friend of mine. I want\n          in and I want in immediately.\n\nThat's a rock solid answer.\n\n                                              KINGDOM 8/18/06   38.\n\n\n\n                         PRINCE THAMER\n               Define \"immediately.\"\n\n                         RONALD FLEURY\n               Right now immediately.\n\n     Fleury looks back at the Ambassador. A stare down.\n\n                         FLEURY\n               If your phone doesn't work\n               international, you can borrow mine.\n\n     Prince Thamer slowly reaches for his phone as Fleury opens\n     his door.\n\n                         FLEURY (CONT'D)\n               I'll just be right out here.\n\n\n42   EXT. DIPLOMATIC SUBURBAN - MOMENTS LATER                     42\n\n     Fleury waiting. Intense.\n\n     The window rolls down, Thamer looking up at Fleury.\n\n     The following is fast, tight negotiating:\n\n                         PRINCE THAMER\n                   (trying to maintain cool)\n               We cannot allow 100 agents-\n\n                         RONALD FLEURY\n               -4. With a 25-man security detail-\n\n                         PRINCE THAMER\n               -even 25 more armed Americans could\n               spark rebellion-\n\n                         RONALD FLEURY\n               That's too bad.\n\n                         PRINCE THAMER\n               Saudi Security. That's non\n               negotiable. You cannot bring guns\n               into the Kingdom.\n\n                         RONALD FLEURY\n               Men in Saudi Police uniforms are\n               why we're talking now.\n\n                         PRINCE THAMER\n               They would be hand picked.\n\n                                             KINGDOM 8/18/06   39.\n\n\n\n                          RONALD FLEURY\n                Whose hands?\n\n                            PRINCE THAMER\n                Mine.\n\n      Fleury blinks.\n\n                          PRINCE THAMER (CONT'D)\n                Trust me...that's the only hope of\n                this happening.\n\n                          FLEURY\n                If anything happens to me or my\n                team... It's on you. Understood?\n\n                          PRINCE THAMER\n                Cool it with the John Wayne, Mr.\n                Fleury.\n\n      Fleury just stares.\n\n                          PRINCE THAMER (CONT'D)\n                You can have a week-\n\n                          RONALD FLEURY\n                -seven-day or work-week?\n\n                          PRINCE THAMER\n                Work week. Five days. No guns.\n\n      Hands shake.\n\n\n42A   EXT. SAUDI SHACK - NIGHT, SAUDI TIME                      42A\n\n      No \"charm.\" Corrugated tin. A faded blue plywood door. No one\n      in sight. On the side of the house: a battered satellite\n      dish...\n\n\n43    INT. SAUDI SHACK - NIGHT, SAUDI TIME                       43\n\n      A tiny framed Saudi National flag in the middle of a wall:\n      green with a white sword underlining script that reads: There\n      is no God but Allah.\n\n      No other decoration. The none-too-muffled sounds of traffic:\n      a lone window overlooking a four-lane boulevard. Then the\n      Athan (call to prayer) for the Isha (last of the five daily\n      prayers) trumps the traffic noise.\n\n                                             KINGDOM 8/18/06   40.\n\n\n\n     Sergeant Haytham enters, bandaged, blank, then a small smile\n     crosses his face. An old man's weathered voice, in Arabic:\n\n                         OLD VOICE (O.C.)\n               Just in time.\n\n     Haytham's P.O.V.: His FATHER, glass-frail, lying in a bed, a\n     small TV nearby, on but soundless. Haytham goes into a\n     routine: rolls out two prayer mats, steps to his Father,\n     reaches down to pick him up. His Father readies himself --\n     stops everything when he sees the bandages up close, the\n     black bruises with outer rings of purple covering 1/2 of his\n     Son's cheek. Looks into his boy's eyes.\n\n                         HAYTHAM'S FATHER\n               What happened?\n\n     Haytham not returning the gaze, hoists his Father into his\n     arms -- pain shoots up his arms from his damaged wrists.\n\n                         SERGEANT HAYTHAM\n               You haven't heard about the attack?\n\n                         HAYTHAM'S FATHER\n               I choose not to listen anymore.\n               What happened to your face?\n\n                          SERGEANT HAYTHAM\n                   (beat)\n               An attack today.\n\n                         HAYTHAM'S FATHER\n               Look at me.\n\n     Haytham looks into his father's eyes now. No words. Haytham's\n     eyes well with tears. After a long silence:\n\n                         HAYTHAM'S FATHER (CONT'D)\n               Is this how they now treat the men\n               who protect them? Can you look at\n               me? You cannot, can you? Can you\n               look at yourself?\n\n     Haytham stares at his father.\n\n                         HAYTHAM'S FATHER (CONT'D)\n               You are protecting the true enemies\n               of God.\n\n\n44   INT. AL-GHAZI'S HOUSE - SAME                                 44\n\n                                              KINGDOM 8/18/06   41.\n\n\n\n\n     INTERCUT WITH THE HAYTHAM SCENE:\n\n     Al-Ghazi sits on pillows on the living room with his WIFE and\n     three DAUGHTERS. A television is on, playing \"MAN SAYARBAH AL\n     MILIOUN\" the Arabic \"Who Wants To Be A Millionaire.\" Al-\n     Ghazi's children are playing a game with peas, trying to\n     guess which one of his hands Al-Ghazi is hiding the pea. When\n     a girl guesses correctly, he eats a pea.\n\n     From outside, we hear the call to prayer. Al-Ghazi and his\n     family all move to prayer mats in his living room.\n\n\n45   INT. ONE ROOM APARTMENT - SAME                               45\n\n     Haytham continues carrying his Father to the prayer mats.\n     Gently sets him down, Kneels down himself, carefully rolls\n     his Dad to his stomach. Then stands to help tuck his Father --\n     in obvious, great arthritic pain -- into a kneeling prayer\n     position.\n\n     Kisses his father on the top of his head. And both pray.\n\n\n46   INT. AL-GHAZI'S HOUSE - SAME                                 46\n\n     Al-Ghazi praying with his family.\n\n\n47   EXT. ANDREWS AIR FORCE BASE - MIDNIGHT                       47\n\n     A Load-Master buckling down two paletts of shrink-wrapped\n     gear in the belly of a C-130. Sykes and Leavitt sit on a\n     stack of FBI paletts, their feet gently tapping on battered\n     forensic cases. Mayes approaches from the parking area.\n\n                         ADAM LEAVITT\n                   (beat, re: Janet)\n               What was Fran Manner to her?\n\n                          GRANT SYKES\n               He taught her how to shoot, she\n               taught him most everything else.\n                   (beat)\n               Celebrated graduation at the IHOP\n               in-town until some Townie called\n               Janet something...Something not\n               very nice. Townie didn't see Fran\n               coming outta the Head. But he\n               definitely felt Fran's uppercut\n               shatter his jaw.\n\n                                          KINGDOM 8/18/06   42.\n\n\n\n                    ADAM LEAVITT\n          Fran didn't get bounced for that?\n\nPoints to Fleury's dirty Jeep arriving.\n\n                    GRANT SYKES\n          SAC Fleury took care of him.\n\n                    ADAM LEAVITT\n          How?\n\n                    GRANT SYKES\n          If I knew how I'd be SAC Sykes. I\n          do know the post in Riyadh was part\n          of the deal Fleury cut to save\n          Fran's career.\n\nLeavitt looks up at Mayes as she gets within ear-shot, plops\ndown next to them.\n\n                     ADAM LEAVITT\n              (beat)\n          What did SAC Fleury whisper in your\n          ear this morning?\n\n                    JANET MAYES\n              (smart-ass smile)\n          `Grant's age is a liability.'\n\nThe three turn as Fleury approaches. Walking fast, clear          \nsense of purpose.                                                 \n\n                    FLEURY                                        \n          Thanks for volunteering.                                \n\n                    LEAVITT                                       \n          Actually, I didn't volunteer.                           \n\n                    FLEURY                                        \n          Thanks anyway.                                          \n\n                    LEAVITT                                       \n          We're going to Riyadh?                                  \n\n                    FLEURY                                        \n          Yup.                                                    \n\n                    SYKES                                         \n          State department said yes?                              \n\n                    FLEURY                                        \n          Nope.                                                   \n\n                                            KINGDOM 8/18/06   43.\n\n\n\n                         LEAVITT                                       \n               White House said yes?                                   \n\n                         FLEURY                                        \n               Nope.                                                   \n\n                         LEAVITT                                       \n               Anybody said yes?                                       \n\n                         FLEURY                                        \n               Not really.                                             \n\n                         LEAVITT                                       \n               Are we bringing security?                               \n\n                         FLEURY                                        \n               Nope.                                                   \n\n     Fleury walks onto the plane. Leaving the three on the tarmac.     \n\n                         LEAVITT                                       \n               This is going to suck so bad.                           \n\n     And the three follow Fleury onto the massive plane.               \n\n\n48   OMITTED                                                      48\n\n\n49   INT. C-130, AIRBORNE - LATER                                 49   \n\n     Silent. Just the lull of jet engines. The big, long boring is\n     just beginning.\n\n     Janet and Leavitt play Scrabble. Sykes sits nearby. Fleury\n     sits up front, wide awake.\n\n                         ADAM LEAVITT\n               What can four people do in five\n               days? Really?\n\n                         GRANT SYKES\n               Aren't you the one who demanded to\n               go this morning?\n\n                         ADAM LEAVITT\n               I meant the FBI. I didn't mean\n               \"me.\"\n\n     Small smile from Leavitt. The Scrabble continues...\n\n                                               KINGDOM 8/18/06   44.\n\n\n\n                         ADAM LEAVITT (CONT'D)\n                   (to Janet)\n               What's it like on the ground?\n\n                         GRANT SYKES\n               Mars.\n\n                         JANET MAYES\n               I'll be looked at with what I can\n               only describe as disdain, pretty\n               much the entire time we're on the\n               ground... kind of like South\n               Virginia.\n\n                         GRANT SYKES\n               Go easy on my kin.\n\n                         JANET MAYES\n               It's a very confused culture.\n               Extremely religious. Had nothing;\n               wanted nothing. Sixty years ago,\n               they hit oil. Simple religious men\n               become trillionaires... a\n               schizophrenic nation is born. The\n               royal family, who we back, and\n               everyone else.\n\n     Intercut with the Scrabble.\n\n\n50   OMITTED (SEE 42A) THRU 53                                     50\n\n\n54   EXT. PALACE GROUNDS - NIGHT, SAUDI TIME                       54\n\n     Three-Suburban convoy turns up a driveway, waved past a guard\n     post bristling with automatic weapons and into the circular\n     drive of a massive, walled palace. Impersonal wealth. Two\n     dozen SANG troops on security detail. Two Humvees equipped\n     with anti-aircraft missiles parked 100 yards apart.\n\n     Colonel Al-Ghazi out of the middle Suburban. Frisked by SANG,      \n     rough: no love lost.\n\n\n55   INT. IMPERSONAL PALACE - SAME MOMENT                          55\n\n     Al-Ghazi is passed to a silent, boundless staff holding\n     serving platters jammed with cups of mint tea. A mammoth\n     foyer.\n\n                                               KINGDOM 8/18/06   45.\n\n\n\n     PRINCE SA'AD BIN KHALED (Saudi Interior Ministry) steps out\n     from a 20-foot high doorway: nebbish, thin, bloodshot eyes\n     magnified by thick glasses. His hand over his stomach:\n     Napoleon's ulcers. A quick wave to Al-Ghazi.\n\n\n56   INT. PRINCE'S PRIVATE OFFICE - NEXT MOMENT                    56\n\n     10' X 20' gold/glass desk over a 50' X 50' rug in a 100' X\n     100' marble room. Al-Ghazi greets the Prince formally: kiss\n     the right shoulder near the clavicle. The Prince's tongue\n     chalk-white for some reason. In Arabic:\n\n                         PRINCE BIN KHALED\n               Four FBI Agents will be allowed to\n               land at Prince Sultan Air Base this\n               evening.\n\n     Al-Ghazi: more than mild shock.\n\n                         PRINCE BIN KHALED (CONT'D)\n               General Abdul-Malik, Chief of\n               Investigative Services for the\n               National Guard has been put in-\n               charge of solving this crime.\n\n     Clearly not sitting well with Al-Ghazi.\n\n                         COLONEL AL-GHAZI                               \n               I know the General. I attended his\n               interrogation of one of my men.\n                   (beat, putting it kindly:)\n               The General does not have\n               investigative experience.\n\n                         PRINCE BIN KHALED\n               Attackers wore YOUR uniform. Police\n               Uniforms. Some of your men may have\n               been involved with this Cell, may\n               still be involved. You're lucky to\n               have a role at all.\n\n     Al-Ghazi silent. The Prince pulls an anti-acid tablet, puts\n     it in his mouth: that's why his tongue is chalk-white.\n\n                         PRINCE BIN KHALED (CONT'D)\n               And your role will be critically\n               important: make sure the Americans\n               leave our country as alive as when\n               they arrive. Five days they will be\n               our guests. Understood?\n\n                                              KINGDOM 8/18/06   46.\n\n\n\n\n57   INT. C-130 - NIGHT                                           57\n\n     Final descent beginning. More stars above than lights below.\n     Landing in the middle of nowhere. Sykes sitting near Fleury,\n     getting his game-face on.\n\n                         GRANT SYKES\n               What's going on in there?\n\n                         RONALD FLEURY\n                   (getting his bearings)\n               I'm good.\n\n     Sykes puts his hand on Fleury's chest.\n\n                         GRANT SYKES\n               Feels like you got a beast in\n               there, Fleury.\n\n                            RONALD FLEURY\n                   (beat)\n               I'm good\n\n                         GRANT SYKES\n               \"Good\" is 6:00 am Sunday morning\n               when your kid climbs into your bed,\n               buries himself into you... sun's\n               creeping through the windows -\n               soft. Birds and wind-chimes...\n               that's \"good.\"\n\n     A BEAT as Fleury looks at Sykes.\n\n                         RONALD FLEURY\n               I'm OK...You don't think I'm OK?\n\n                         GRANT SYKES\n                   (small smile)\n               I think you're not entirely clear\n               right now. That's OK, but you got\n               to know that. You want to go - we\n               go. I got you, but you got to\n               check yourself.\n\n                         RONALD FLEURY\n               I'm checked.\n\n                        GRANT SYKES\n               OK. I'm just checking that you\n               checked.\n\n     Fleury stands up.\n\n                                               KINGDOM 8/18/06   47.\n\n\n\n\n57A   INT. C-130 COCKPIT - NIGHT, SAUDI TIME                      57A\n\n      Fleury pops his head into the cockpit. Two AIRFORCE PILOTS\n      sit at the controls.\n\n                          RONALD FLEURY\n                How we doing?\n\n                          PILOT #1\n                About a half hour out.\n\n                          RONALD FLEURY\n                They gonna let us land?\n\n                          PILOT #1\n                We've been talking to them about an\n                hour or so... they know we're\n                coming.\n\n                             RONALD FLEURY\n                Good.\n\n                          PILOT #1\n                You don't mind my asking, but what\n                the hell you all gonna be doing\n                down there?\n\n                             RONALD FLEURY\n                Hunting...\n\n                          PILOT #1\n                Hunting...? I think of hunting, I\n                think quail in Tennessee, deer in\n                Pennsylvania. What kind of hunting\n                you all gonna do in Saudi?\n\n                          RONALD FLEURY\n                Big Game hunting.\n\n\n58    EXT. MASSIVE, CLOSED DOWN MILITARY COMPLEX - NIGHT           58\n\n      PRINCE SULTAN AIR BASE, SAUDI ARABIA. Our C-130 touches down\n      smooth on Saudi soil.\n\n\n59    INT. C-130 CARGO HOLD - NIGHT, SAUDI TIME                    59\n\n      Engines winding down to nothing. The team standing, slinging\n      bags over their shoulders. Groggy but pumped. Fleury looks at\n      his team, last bit of advice before game-time.\n\n                                              KINGDOM 8/18/06   48.\n\n\n\n                         RONALD FLEURY\n               Heads on a swivel.\n\n\n60   EXT. PRINCE SULTAN AIRBASE - NIGHT, SAUDI TIME               60\n\n     The cargo door locks into place on Saudi tarmac. Fleury and\n     the Team outside the plane now, bags dropped at their feet.\n     90 degrees even this late. Look-up: light washing over a\n     small, formal Saudi military team in front of two caskets\n     draped in American flags, and a small convoy of bullet-proof\n     black Suburbans. Adam Leavitt will never forget this first\n     glimpse of Saudi Arabia: surreal. Tears in Janet's eyes as\n     she glimpses the caskets.\n\n     Colonel Al-Ghazi steps up, offers his hand to Fleury. Fleury      \n     and Al-Ghazi shake:\n\n                         COLONEL AL-GHAZI                              \n               Colonel Al-Ghazi.                                       \n\n                         RONALD FLEURY\n               Special Agent Ronald Fleury.\n\n                         COLONEL AL-GHAZI                              \n                   (beat: the caskets)\n               Your two fallen comrades, Mr.\n               Manner and Mr. Burr.\n\n     Three men multi-task hustle to forklifts, start them up. Into\n     the cargo hold, pulling out paletts. Things moving orderly-\n     fast now. The Americans just kind of step back, dazed.\n\n                         COLONEL AL-GHAZI (CONT'D)                     \n               Passports and credentials. Please.\n\n     Sergeant Haytham, driving one of the suburbans, steps forward\n     with kevlar vests for our crew.\n\n                         COLONEL AL-GHAZI (CONT'D)                     \n               Thank you to keep these on whenever\n               you are outside of Al-Rahmah.\n\n                         JANET MAYES\n               We brought our own.\n\n     The crew hits their bags, pulls out their vests.\n\n     Another OFFICER checks each team member's FBI badge and\n     passport. Stops at Leavitt's: an Israeli stamp on his\n     passport. Leavitt's quick:\n\n                                            KINGDOM 8/18/06    49.\n\n\n\n                         ADAM LEAVITT\n               Israeli stamp in my passport?\n\n                         COLONEL AL-GHAZI                             \n                   (in Arabic to the Officer)\n               That is not our concern.\n\n     Al-Ghazi takes the passports and badges, hands them back.\n\n                         COLONEL AL-GHAZI (CONT'D)                    \n               I'm also to collect your sidearms.\n\n     This is like handing over your first-born. Fleury goes first.\n     Haytham puts each weapon in a padded case.\n\n                         GRANT SYKES\n               And I usually just toss it on the\n               kitchen table...\n\n                         COLONEL AL-GHAZI                             \n                   (small smile)\n               If each of you would please get\n               into the middle vehicle.\n\n\n61   INT. MIDDLE SUBURBAN, RIYADH SUBURBS - NIGHT                61\n\n     The speedometer at 110 m.p.h. Haytham navigates with his left\n     hand. Prayer beads hang from the rearview mirror. Al-Ghazi in\n     the passenger seat, right hand rubbing another set of prayer\n     beads down to nubs. The team in the back rows: all staring at\n     the prayer beads on the mirror.\n\n                         JANET MAYES\n                   (whispering to Leavitt)\n               Wouldn't need the power a' prayer\n               if there were 2 hands on the wheel.\n\n                         ADAM LEAVIIT\n               110 miles per hour... How do you\n               keep so calm? I mean, really? Is\n               it breathing--\n\n                         JANET MAYES\n               --Shhhh....\n\n                         RONALD FLEURY\n               If somebody was tailing us it'd be\n               obvious. This is just standard\n               operating speed.\n\n     Al-Ghazi on the edge of his seat, no belt, scanning for\n     threats: sidewalks, traffic, rooftops.\n\n                                       KINGDOM 8/18/06    50.\n\n\nHis left hand hand wrapped around the stock of an Mp-5\nmachine gun. Fleury takes in a deep breath: let's see who\nthis guy is.\n\n                    RONALD FLEURY (CONT'D)\n          Colonel, have you ever been to the                    \n          US?\n\n                    COLONEL AL-GHAZI                            \n          I have been there only once. I\n          spent four days at Quantico... I\n          saw your Michael Jordan play for\n          the Washington Wizards.\n\nSmall laughs.\n\n                    RONALD FLEURY\n          You don't know what you missed...\n          you should have seen him play for\n          our Chicago Bulls.\n\nFleury nods to Sykes, giving him the go to start in with the\nBad Cop. Throughout the following exchange, we stay TIGHT ON\nFLEURY: in control, using Sykes to ask the questions he\n\"diplomatically\" does not want to ask.\n\n                    GRANT SYKES\n          You have portable lights on-scene?\n\n                    COLONEL AL-GHAZI                            \n              (loses his smile)\n          Yes. But your team cannot work\n          nights.\n\nJanet looks to Leavitt, then Fleury: `what did he say?'\nFleury looks to Sykes, `Keep going...'\n\n                    GRANT SYKES\n          We only have seven days: we work\n          around the clock.\n\n                    COLONEL AL-GHAZI                            \n          Five days. And you are not safe at\n          night.\n\n                    GRANT SYKES\n          We're safe during the day?\n\nFleury is about to step in when-\n\n                    COLONEL AL-GHAZI                            \n              (in Arabic, shocking)\n          WATCH IT-SLOW!\n\n                                           KINGDOM 8/18/06   51.\n\n\n\nA truck 200 yards ahead in the middle of an abrupt U-turn.\nOver the median. Dust cloud. Heading back our way. Something\nbig in the truck's bed. Our vehicle shimmies as Al-Ghazi\nflinches, drops his prayer beads. Mp-5 up to the Colonel's         \nsight-line, muzzle tracking the truck. Leavitt leans away\nfrom his window as the vehicles pass: streetlights show two\nfarmers, a camel sitting in the bed. Missed their left turn.\n\nA long, nearly comical moment.\n\n                       ADAM LEAVITT\n                 (smartass)\n             I don't like camels.                                  \n\nFleury cycling through different angles. Continues:\n\n                       RONALD FLEURY                               \n             Colonel, do you believe Abu Hamza                     \n             was responsible for this attack?                      \n\n                       COLONEL AL-GHAZI                            \n             We don't know.                                        \n\n                       RONALD FLEURY                               \n             Were Saudi Police involved in the                     \n             attack?                                               \n\n                       COLONEL AL-GHAZI                            \n             We don't know that either.                            \n\n                        RONALD FLEURY                              \n             Any word on what that third big\n             blast was?\n\nAl-Ghazi getting tired of the questions: exhausted himself.\n\n                        COLONEL AL-GHAZI                           \n             Not yet.\n\n                       GRANT SYKES\n             You interviewed witnesses?\n\n                       COLONEL AL-GHAZI                            \n                 (short-fuse burning)\n             We're trying. No one who was close\n             enough to see the things we would\n             like to know, lived.\n\n                       GRANT SYKES\n             Were any of the uniformed bombers\n             brother-officers?\n\nNo answer.\n\n                                              KINGDOM 8/18/06   52.\n\n\n\n                         GRANT SYKES (CONT'D)\n               Do you know yet?\n\n     No answer. Team feeling the tension. Fleury steps in and\n     takes charge.\n\n                         RONALD FLEURY\n               You don't know the source of the\n               blast, don't know if your own\n               Officers were involved, but you\n               won't let us work nights?\n\n     Al-Ghazi stanches an explosion. Haytham looks over at his\n     Colonel: rarely ever seen him like this. Looks in the rear-       \n     view mirror to see Sykes, the man giving the Colonel fits.        \n     Sykes catches him looking back, gives him a quick wink into\n     the mirror. TIGHT ON Haytham's face: the guilty little smile\n     you give when someone takes your boss to task.\n\n                          COLONEL AL-GHAZI                             \n               47 of my `brother-officers' were\n               blown into hundreds of pieces that\n               will take months to collect. 80,000\n               Officers total, across the country,\n               at four uniforms apiece. Thousands\n               of people who can sew forgeries.\n               Apologies that I don't have\n               definitive answers.\n                   (beat)\n               You're still not working nights.\n\n     Fleury stays quiet, studying, calculating, thinking: we got a\n     Handler that's going to be tough to handle.\n\n\n62   OMITTED                                                      62\n\n\n63   INT. GIDEON YOUNG'S OFFICE - EVENING RUSH HOUR, EST          63\n\n     Director Grace already sits in front of Young's desk.\n\n                         DIRECTOR GRACE\n               Good afternoon, Sir.\n\n     Young says nothing, just pulls a memo from his bag, clears\n     his throat -- still no eye-contact -- reads aloud like a poor\n     man's Orson Welles:\n\n                         GIDEON YOUNG\n               `Sunlight is indeed the most\n               powerful disinfectant.\n                         (MORE)\n\n                                        KINGDOM 8/18/06   53.\n\n                     GIDEON YOUNG (CONT'D)\n          In that spirit I come before this\n          Judiciary Committee with a painful\n          admission.\n              (beat)\n          Simply: I've lost all confidence in\n          the FBI, especially it's uppermost\n          echelon. Entrenched and outmoded,\n          the Leadership has shown itself\n          fearful of the pioneering thought\n          this Committee and I have tried to\n          imbue. It is thus an Agency at\n          contretemps, hindering our every\n          effort.' And by `Committee' I mean\n          the fucking SENATE SELECT COMMITTEE\n          ON TERROR...\n\nYoung finally makes eye contact: expecting something like\nfear, remorse, back-pedalling...\n\n                    DIRECTOR GRACE\n          Senators? Then I'd change\n          `outmoded' to `outdated,'\n          `echelons' to `ranks' and what in\n          God's name is `contretemps?' These\n          guys aren't the best and brightest-\n\nYoung's face flashes red, seething:\n\n                    GIDEON YOUNG\n          -never take the Lord's name in vain\n          in this office-\n\n                    DIRECTOR GRACE\n          -but you can say `Fucking?'\n\nYoung apoplectic now: ready to end the Director right there,\nwhen Grace leans in, lets the vague threat of physical\ncontact manifest.\n\n                     DIRECTOR GRACE (CONT'D)\n          You're going to the Senate Select\n          Committee, but not to the President\n          who appointed you. Why's that?\n              (beat)\n          I bet the President wasn't the\n          audience you thought he'd be: I'll\n          bet he realized you can't have\n          Voters asking why the second-\n          longest serving FBI Director gets\n          fired for doing his job, for\n          sending Agents into Saudi Arabia,\n          seven months from mid-term\n          elections-\n\n                                            KINGDOM 8/18/06    54.\n\n\n\n                         GIDEON YOUNG\n               -you really want to bet?\n\n     Grace snaps his ID badge off his lapel, puts it on the table.\n\n                         DIRECTOR GRACE\n               I do.\n\n     Young's pallor tells us his bluff has been called. Goes\n     silent. Grace smells it, finishes him now:\n\n                          DIRECTOR GRACE (CONT'D)\n               Westmoreland made all us Officers\n               write our own obituaries during\n               Tet, when it looked like the Cong\n               were going to end it all right\n               there. Once we clued-in that life\n               was finite, the loss of it no\n               longer scared us: the end comes no\n               matter what, it's just a question\n               of how you want to go out: on your\n               feet or on your knees. After that,\n               we went out and pulled triggers\n               until barrels melted. And Vietnam\n               lasted another seven years.\n                   (beat)\n               The lesson extends to this career:\n               I ACT, knowing the end of this job\n               will come, no matter what. You\n               should do the same.\n\n     Grace waits: nothing else from Young. Stands, snaps his ID\n     badge back on his lapel, walks out.\n\n                         DIRECTOR GRACE (CONT'D)\n               I'll forward Fleury's reports.\n\n\n64   EXT. OUTSIDE AL-RAHMAH HOUSING COMPLEX - NIGHT, SAUDI TIME 64\n\n     The convoy brakes impossibly close to a checkpoint. Waved\n     through perimeters staffed by SANG and Police. Fatigues,\n     automatic rifles, peering at the tinted windows.\n\n\n65   INT. MIDDLE SUBURBAN - NEXT MOMENT                           65\n\n     Crew arrives at a crime-scene that spans the immediate\n     horizon. White tents with SANG sitting under each. Industrial\n     lights outline shattered buildings, idle heavy equipment,\n     bombed-out automobiles. TIGHT ON MAYES looking out.\n\n                                            KINGDOM 8/18/06   55.\n\n\n\n                         JANET MAYES\n               That's one of the great horrors of\n               television: Crime scene\n               manipulation. They say a TV camera\n               adds pounds to actresses. Isn't\n               that what they say?\n\n                         ADAM LEAVITT\n               Who's \"they?\"\n\n                         JANET MAYES\n               That is what they say. Doesn't add\n               to crime scenes. Television cameras\n               shrink them. Misrepresent. No\n               smells. Poor sound. Limited view.\n               TV always makes them look smaller.\n               You can't feel the hatred on\n               television.\n\n     TIGHT ON FLEURY: Quiet and focused, taking everything in.\n\n                         FLEURY\n               ...heads on a swivel, people.\n\n\n66   EXT. AL-RAHMAH COMMUNITY CENTER - NEXT MOMENT               66\n\n     Two more security perimeters of SANG surround the Community\n     Center: blinding portable lights, heavy machine guns mounted\n     in the backs of Humvees track the convoy as it comes to a\n     stop: every troop on-guard. The Team tentatively exits: 100\n     pairs of glares from heavily-armed SANG.\n\n     Soldiers descend on the Teams' bags, paletts of equipment.\n     Long leers at Janet: not so much `sexual' as `wary.' Janet\n     goes for her own bag. Haytham goes for it at the same time.\n     Their hands accidently touch. Haytham pulls back fast,\n     embarrassed.\n\n                         JANET MAYES\n               EASY.\n\n     Janet notices the nasty marks around Haytham's right ear.\n\n\n67   INT. AL-RAHMAH COMMUNITY CENTER - NEXT MOMENT               67   \n\n     Florescent lights make it ugly. Haytham dumps duffel-bags by\n     their bunks, SANG stack steel travel-boxes from the paletts\n     inside. No windows, AC cranked to `coldest.' Americans sealed-\n     in - in the name of comfort.\n\n                                        KINGDOM 8/18/06   56.\n\n\n\nJanet's area made obvious with a floral partition. She\nimmediately folds it, puts it into a corner. Haytham watches\nher undo his work.\n\n                    COLONEL AL-GHAZI                            \n          The bathrooms are through that\n          door. I will be here tomorrow\n          morning so we can begin.\n\n                    FLEURY\n          What time tomorrow morning?\n\n                     COLONEL AL-GHAZI                           \n          Sunrise.\n\n                    RONALD FLEURY\n          What time is sunrise?\n\n                     COLONEL AL-GHAZI                           \n              (beat)\n          When I knock.\n\nAl-Ghazi and Haytham leave. The doors close behind them, then\nthe sound of a key turning in a lock. The Americans look on,\nhalf-disbelief, half-comedy: locking us in.\n\n                    GRANT SYKES\n          That's against fire code.\n\n                    JANET MAYES\n          They don't have fire codes. They\n          don't have codes other than codes\n          of war. They'll lock us in and dial\n          up some kind of earth movers if\n          they want to. You know that, Sykes.\n          Dig a big hole and push us in. Fill\n          it up and no one comes calling.\n          You're in the jungle now, baby.\n\nSilence as the crew digests this odd little verbal outage.\n\n                    ADAM LEAVITT\n              (smiling)\n          You alright, girl?\n\n                    JANET MAYES\n          Watch it, boy.\n\n                    ADAM LEAVITT\n          Just asking...\n\n                     JANET MAYES\n          Unpack.\n\n                                        KINGDOM 8/18/06   57.\n\n\n\nEveryone hits their own bags first.\n\n                      FLEURY\n                (to himself)\n            Saudi slow roll...\n\nFleury pulls out his laptop, wakes it up from sleep mode.\nEyes a photo of Kevin on his desktop, picks up the phone.\n\n                      LYLA FLEURY\n                (on phone)\n            Hello?\n\n                      RONALD FLEURY\n            Hey... How are you? How's my boy?\n\n                      LYLA FLEURY\n            We're just fine. How are you?\n            Where are you?\n\n                      RONALD FLEURY\n            I'm here...\n                (quick beat)\n            Lemme talk to my boy.\n\nA BEAT as Lyla passes the phone to Kevin.\n\n                      KEVIN FLEURY (O.S.)\n            Daddy?\n\n                      FLEURY\n            What you doing?\n\n                      KEVIN FLEURY (O.S.)\n            I'm talking to you. What are you\n            doing right now, Daddy? Right now?\n\n                      FLEURY\n            I'm missing you.\n\n                      KEVIN FLEURY (O.S.)\n            Where are you?\n\n                      FLEURY\n            I'm in Saudi Arabia.\n\n                      KEVIN FLEURY (O.S.)\n            Did you see Big Fran?\n\nA Beat...\n\n                                            KINGDOM 8/18/06   58.\n\n\n\n                          FLEURY\n               Yeah... I saw him...\n                   (PAUSE)\n               I saw him.\n\n                         KEVIN FLEURY (O.S.)\n               Is he still tall?\n\n                         FLEURY\n               Yeah... Yeah...he's still tall.\n\n     Silence... as Fleury takes a beat to collect himself.\n\n                         KEVIN FLEURY (O.S.)\n               Daddy? Are you still there?\n\n                         FLEURY\n               Yeah, buddy. I love you. Keep your\n               eye on your mama. Be the man.\n\n                         KEVIN FLEURY (O.S.)\n               You, too Daddy.\n\n                         FLEURY\n               I'll call you tomorrow. I love you.\n\n                         KEVIN FLEURY (O.S.)\n               Bye, Daddy.\n\n     Fleury begins unpacking.\n\n\n68   EXT. AL-RAHMAH COMMUNITY CENTER - 4:30 AM                    68\n\n     Pre-dawn: Eight black suburbans parked on the side street:\n     waiting. The doors of the first four open in-unison. 20 Arab,\n     suited SECURITY GUARDS exit.\n\n     Al-Ghazi unlocks the door to the compound: the team stands\n     dressed, waiting. CLOSE-UP: The Team steps out to see\n     massive, organized security.\n\n     From one of the vehicles exits a middle aged AMERICAN -\n     sweating a bit, hanging back, watching. This is US Deputy\n     Chief of Mission, the Embassy's second-in-command: DAMON\n     SCHMIDT.\n\n     Another 100 Security CONTRACTORS remain vigilant: SNIPERS on\n     roof-tops, in machine-gun nests.\n\n     Schmidt approaches Fleury.\n\n                                        KINGDOM 8/18/06    59.\n\n\n\n                    SCHMIDT\n              (big smile)\n          You are in so much trouble.\n\n                    FLEURY\n          Is that right?\n\n                    SCHMIDT\n          For sure. I mean, I don't know how\n          you did it. Nice work, but if you\n          live through this, which I put at\n          about fifty percent - if you do,\n          your balls are gonna get stretched\n          and beaten on. Dig that?\n\nFleury stares at this freak show. Schmidt sticks out a paw.\n\n                    SCHMIDT (CONT'D)\n          Damon Schmidt. State Department.\n          I'm in charge of getting you out of\n          here.\n\nPRINCE BIN KHALED and his INNER-CIRCLE exit a Suburban and\napproach: All in traditional dress. The Prince locks eyes\nwith Fleury.\n\nIN THE BG, forklifts rumble-hiss to life, placing Jersey\nbarriers around the community center.\n\n                    SCHMIDT (CONT'D)\n          Don't let go of his hand first.\n          Major disrespect.\n\nOne of the inner-circle, without a word, takes off the FBI-\nemblazoned windbreaker worn by Leavitt and places it on a\nshort-sleeved Janet. Careful not to touch skin.\n\nOnly then does Prince Bin Khaled approach. A lone\nPHOTOGRAPHER follows: snapping pictures. Different\ndefinitions of personal space: four inches separation as Bin\nKhaled greets each Team member in accented English. Janet\nlast: the pictures suddenly stop. The Prince gives a little\ncurtsy, no words, steps back to Fleury: the pictures re-\nstart. Bin Khaled holds Fleury's hand sixth-grade boyfriend-\nstyle.\n\n                    PRINCE BIN KHALED\n              (in Arabic)\n          This is our level of commitment to\n          bringing Terrorists to justice:\n\nMotions to the Americans. No more unflattering a portrait:\npre-coffee, post-twelve hour flight, hours unpacking...\n\n                                        KINGDOM 8/18/06   60.\n\n\n\nAs the cameras start flashing. Angle on Al-Ghazi and Haytham\nplaced to stand next to the Americans. Haytham clearly not\ncomfortable with this kind of attention.\n\n                     PRINCE BIN KHALED (CONT'D)\n          We've invited American legal\n          officials into our Kingdom despite\n          current difficulties between the US\n          and Islam. They will observe our\n          advanced investigative techniques,\n          offering helpful hints.\n               (to Fleury in English)\n          You will please honor me with your\n          presence tonight at my home.\n               (beat, a stunted nod)\n          Yes.\n\nThe Prince turns back to the convoy. Entire entourage\nfollows. One of the Security Contractors catches the jacket\nJanet hurls back at him, tosses it to Leavitt. Convoy gone.\nThe team turns: 100 glares again. Fleury blinks out the\ncamera flashes, takes in all the eyeballs.\n\nFleury looks up at a retreating Damon Schmidt.\n\n                    SCHMIDT\n          Nice pictures. You guys ready to go\n          home now?\n\nDead eyes from Fleury. He's clearly not amused.\n\n                    SCHMIDT   (CONT'D)\n          OK. If you change   your minds, I got\n          a plane fueled up   and ready to go -\n          got your name all   over it...\n\nHe points a finger gun at Fleury.\n\n                    SCHMIDT (CONT'D)\n          Strap your kevlar on tight, people.\n\nSCHMIDT takes off. Sykes by Fleury.\n\n                    GRANT SYKES\n          Slow roll... gonna be like when you\n          go deep sea fishing in Florida and\n          you pay seven hundred bucks for the\n          boat and you sit in the ocean for\n          hours and the crew jumps around and\n          screams and points and you think\n          your constantly about to bag a\n          Marlin but you never do and they\n          keep pointing and jumping and-\n\n                                        KINGDOM 8/18/06   61.\n\n\n\n                    FLEURY\n          Enough.\n\nHaytham walks off by himself, shaking off the shady Royal\nphoto vibe, looking back at the Americans. From behind him:\n\n                    POLICE OFFICER\n          You're willing to die to protect\n          your enemy?\n\nHaytham turns. An older POLICE OFFICER stands with a GROUP of\nSANG twenty feet behind him, eyeing Haytham.\n\nBack to Fleury: he looks to Al-Ghazi.\n\n                    RONALD FLEURY\n          What did the Prince say?\n\n                     COLONEL AL-GHAZI                           \n              (beat)\n          That there are more rules than just\n          not working at night.\n\n                    RONALD FLEURY\n          What rules?\n\n                    COLONEL AL-GHAZI                            \n          You are here as observers. Not\n          investigators.\n\nFleury tries to remain cool.\n\n                    RONALD FLEURY\n          That's not accurate--\n\nAl-Ghazi ignores Fleury.\n\n                     COLONEL AL-GHAZI                           \n          --I need to make sure the sites are\n          secure. Then you can begin\n          observing.\n\nLeavitt looks around at the Security as Al-Ghazi hustles off:\n\n                    ADAM LEAVITT\n              (to Fleury)\n          How could they get more secure?\n\nThe Team slowly realizes they're not going anywhere yet, dump\ntheir bags in a pile, already disgusted.\n\nIn the distance, the group of SANG stare back at our team.\n\n                                                KINGDOM 8/18/06   62.\n\n\n\n\n68A   INT. LOCATION UNKNOWN - TIME UNKNOWN                         68A\n\n      Hold on an empty 2' X 1' X 6\" balsa wood box set on a dirty\n      linoleum floor.\n\n      Ancient hands line the balsa wood box with bricks of putty-\n      gray plastic explosive. We immediately notice the right hand\n      is missing the index and middle fingers. The hands insert\n      bright-red blasting caps into the explosives, lengths of\n      detonating-wire emanating from each cap.\n\n      Another set of stronger, younger, in-tact hands gently pours\n      a mixture into the box now. Ball bearings, children's jacks,\n      marbles, razor blades, roofing nails. Everything malevolent\n      densities and angles. Some pieces bounce out, run along the\n      floor. The younger hands then start pressing/molding the\n      pieces of soon-to-be shrapnel into the putty-gray plastic\n      explosives.\n\n\n68B   EXT. AL-RAHMAH COMMUNITY CENTER - LATER                      68B\n\n      Al-Ghazi and General Malik stand outside.\n\n      The Athan sounds for Dhuhr.\n\n      100 soldiers immediately drop to their knees.\n\n\n69    INT. AL-RAHMAH COMMUNITY CENTER HOOPS COURT - 9:00 AM         69\n\n      TIGHT ON FLEURY: focused, Thinking. Sykes next to him.\n\n      O.C. The Athan sounds again for Dhuhr.\n\n                          SYKES\n                Well, this is going well...\n\n                          FLEURY\n                Saudi Slow Roll.\n\n      Sykes and Fleury lean against the locked door, staring at the\n      pathetic sight before them: Janet's truly awful jumper...\n      that somehow swishes every time. Before she lands, cocky and\n      smooth:\n\n                          JANET MAYES\n                Good.\n\n                                             KINGDOM 8/18/06   63.\n\n\n\n     Then the metallic swish of the all-weather net. Leavitt boxes\n     out air for the non-existent rebound, grabs the ball, chest-\n     passes it Great Santini-hard back to Janet who softly sucks\n     in the pass. Playing in their cargo pants and hiking boots.\n\n                         LEAVITT\n               How do you do that?\n\n     Janet gently bounce-passes it back:\n\n                         JANET MAYES\n               Check.\n\n                         LEAVITT\n               Don't say `good' again.\n\n     Janet takes the check from Leavitt: before he can react, she\n     drains a 30-footer. Same cockiness, different word:\n\n                         JANET\n               Bueno.\n\n     Fleury with Sykes still standing in the same spot. Looks up:\n     Al-Ghazi coming into the building. Fleury ready to vent until\n     something surprises him: breathless, Al-Ghazi has broken a\n     wide-sweat hustling back to the Americans. Fleury's face\n     relaxes. He pulls a bottle of water out of a cooler, hands\n     it to Al-Ghazi.\n\n                          COLONEL AL-GHAZI                            \n               I am sorry for the time.\n                   (beat)\n               You won't need you gear.\n\n     Fleury can't help a small smile.\n\n                         FLEURY\n                   (to Sykes, himself)\n               Of course we won't.\n\n\n70   EXT. AL-RAHMAH - MOMENTS LATER                              70\n\n     Hands in pockets. Soak in the aftermath: shallow but wide\n     crater, shredded backstop, nearby buildings torn, blood baked\n     into dirt. Fifteen cars.\n\n                         COLONEL AL-GHAZI (O.C.)                      \n               The remaining rules: you cannot\n               touch evidence, question anyone\n               without me present, touch Muslim\n               dead, or leave my sight at anytime:\n               your safety is my primary concern.\n\n                                       KINGDOM 8/18/06   64.\n\n\n\n                    FLEURY\n          I would have thought your primary\n          concern was investigating a crime.\n\n                    COLONEL AL-GHAZI                            \n          And you would be mistaken.\n\nSykes looks over to Fleury. Crooked smile.\n\n                    SYKES\n              (to Fleury)\n          I think it's one of those\n          \"something happens to us... his\n          head comes off\" kind of deals.\n              (to Al-Ghazi)\n          Is it one of those kind of deals,\n          Colonel?                                              \n\nAl-Ghazi ignores Sykes.\n\n                    FLEURY\n          So, if you're not running the\n          investigation...who is?\n\nAl-Ghazi motions to 50 MEN in uniforms different than his:\nSANG troops digging, bagging evidence, marking the scene with\nred-flags.\n\n                    COLONEL AL-GHAZI                            \n          The National Guard's Military\n          Police Brigade is conducting the\n          investigation. My orders begin and\n          end with your health.\n\nThe Team: so we're on Tour. Fleury still silent.\n\n                    ADAM LEAVITT\n          I thought the SANG were soldiers--\n\n                    COLONEL AL-GHAZI                            \n          --the bombers didn't wear a\n          soldier's uniform. They wore mine.\n\nFleury finally speaks, asking the most important question:\n\n                    RONALD FLEURY\n          Who is in charge of the\n          investigation then?\n\nAl-Ghazi points to a Man we've seen before, General Abdul-\nMalik. Haytham's Interrogator. He pours over a table 20 feet\naway: maps, blueprints, utility schematics spread before him.\n\n                                         KINGDOM 8/18/06   65.\n\n\n\n                    COLONEL AL-GHAZI                             \n          General Abdul-Malik. He's given us\n          permission to walk through each\n          crime-scene.\n\n                    RONALD FLEURY\n          To walk through? Are you kidding\n          me?\n\n                      COLONEL AL-GHAZI                           \n          I am not.\n\nStarting to get heated.\n\n                    RONALD FLEURY\n          Get him over here now and let's\n          clarify this situation.\n\n                    COLONEL AL-GHAZI                             \n          There is no lack of clarification.\n\n                    RONALD FLEURY\n          There sure as hell is! I don't know\n          what kind of game you're playing\n          but you got the wrong guy, Colonel                     \n          Al-Ghazi! That was not the deal-\n\n                    COLONEL AL-GHAZI                             \n              (getting hot)\n          This is not a game show, Mr.\n          Fleury! There are no deals made\n          here. There is me telling you what\n          you may or may not do and there is\n          you doing it.\n\nBeat. As Al-Ghazi stabilizes...\n\n                    COLONEL AL-GHAZI (CONT'D)                    \n          You will be permitted to walk\n          through the crime scenes. When we\n          have determined that it is safe.\n\nA stand off. Fleury eyes Al-Ghazi. Trying to figure this guy\nout.\n\nSees something that looks like a flash of embarrassment in Al-\nGhazi's eyes: unable to perform his profession, relegated to\nTour Guide. Leavitt begins taking notes. Haytham sees his\nnotebook, snaps his fingers at Al-Ghazi who looks, nods: let\nhim.\n\n                      RONALD FLEURY\n          OK.\n\n                                              KINGDOM 8/18/06   66.\n\n\n\n     Fleury tight-grins. Looks off. In one of the apartments, he\n     sees a PERSON looking down at them from behind a curtain.\n\n     He tries a new tactic.\n\n                         RONALD FLEURY (CONT'D)\n               How have you guys been doing with\n               the witnesses?\n\n                         AL-GHAZI\n               What witnesses?\n\n     Al-Ghazi just stares at Fleury.\n\n                         FLEURY\n               I'm guessing there are a bunch of\n               Americans, Brits... Australians?\n               Someone must have seen something.\n               I'm sure they're just dying to talk\n               to you guys, seeing as how the\n               killers were wearing your uniforms.\n               That must be a real confidence\n               booster for them.\n\n     Al-Ghazi silent, staring.\n\n                         FLEURY (CONT'D)\n               Let me talk to them.\n\n     Al-Ghazi looks unsure. He was not expecting this.\n\n\n71   EXT. RIPON FAMILY HOME                                       71\n\n     Fleury and Al-Ghazi walk up the front walk. Fleury noticing\n     kids bikes, hockey gear, a comfortable easy chair covered in\n     fur outside on the front porch, toy guns.\n\n\n72   INT. RIPON FAMILY HOME - MOMENTS LATER                       72\n\n     Fleury sits with the RIPONS: EARL (40s) JANINE, his wife\n     (30s), and MADDY, Earl's mother (late 60s). Earl sits on an\n     ugly couch, a plywood sheet right above their heads. Everyone\n     uneasy save the CAT in Maddy's lap. Fleury waves off a bottle\n     of water from Janine. Al-Ghazi hovers awkwardly by the front\n     door.\n\n     AWKWARD INTERVIEW:\n\n                         EARL\n               There's still a couple of hundred\n               of us living on the compound.\n\n                                       KINGDOM 8/18/06     67.\n\n\n\n                    RONALD FLEURY\n          Why Saudi Arabia?\n\nA moment as Earl and Janine get a bit defensive:\n\n                    EARL\n          Neither of us did anymore schooling\n          than Electra High, Electra Texas.\n\n                    RONALD FLEURY\n          OK.\n\nAl-Ghazi sees Janine smile, squeeze Earl's hand tighter.\n\n                    EARL\n          And the jobs here pay twice what\n          you'd make in Midland or the Gulf\n          a' Mexico. Plus the house is free.\n\nEarl's mother Maddy looks at Fleury, pets the cat.\n\n                    JANINE RIPON\n          I call it combat pay. This place\n          has gone Guns - Guns - Guns.\n\n                    RONALD FLEURY\n          So has Everyone else now.\n\n                    JANINE\n          My girlfriends in Texas spend their\n          combat pay on diamonds... I spent\n          mine on a safe room.\n\n                    RONALD FLEURY\n              (chuckles)\n          Two nights back. Can you start one\n          second before you knew anything was\n          wrong?\n\n                    JANINE\n          We didn't really see anything. Just\n          hit the ground and hustled to the\n          safe room. Closed our eyes and\n          prayed. It was so fast. So loud.\n\n                    RONALD FLEURY\n          So you really didn't see anything.\n\n                    MADDY\n          I hit the deck. Horrible.\n\n                    JANINE\n          Not `til after. Just the screams--\n\n                                            KINGDOM 8/18/06   68.\n\n\n\n                         EARL\n               -- the kids... they were screaming.\n               That got me out of the house. Those\n               kids.\n\n                         FLEURY\n               Which kids were those?\n\n                         JANINE\n               The Jackson kids. Tracy Jackson\n               next door was murdered looking out\n               her window...front of her children.\n               No safe room over there...\n                   (right at Al-Ghazi)\n               Not even the Men that did this\n               should die in front a' their\n               babies.\n\n     Fleury lets moments pass. Earl rubs his wife's leg, trying to\n     comfort her. Al-Ghazi hides emotion.\n\n                         RONALD FLEURY\n               She live with her husband?\n\n                         EARL\n               Aaron.\n\n                          RONALD FLEURY\n                   (beat)\n               If I'm facing your house, is the\n               Jackson home to the right or left?\n\n                         JANINE\n               Left.\n\n     Fleury looks out the window towards the Jackson house.\n\n\n73   EXT. JACKSON HOME - SAME MOMENT                            73\n\n     Next door to the Ripons. Fleury knocks. Door opens: a sad MAN\n     with black bags under dying eyes. Disgusted-resigned breath\n     through a half-open mouth. Silver watch and Polo insignia...\n     sees Al-Ghazi, eyes come alive, teeth grit.\n\n                         RONALD FLEURY\n               Mr. Aaron Jackson?\n\n                         AARON JACKSON\n                   (re: Al-Ghazi)\n               Get him away from me-\n\n                                        KINGDOM 8/18/06   69.\n\n\n\n                    RONALD FLEURY\n          -easy, Sir. He's a friend to us-\n\n                    AARON JACKSON\n          -I don't know either one a' you.\n\n                    RONALD FLEURY\n          I'm Special Agent Ronald Fleury of\n          the FBI. This is Colonel Al-Ghazi                     \n          with the Saudi State Police-\n\n                    AARON JACKSON\n          -the Police: they attacked.\n\nAl-Ghazi quietly backs away, walks away. Fleury looks after\nhim, turns back to Mr. Jackson who stares after Al-Ghazi:\nhate. Fleury unsure what to do next.\n\n                    AARON JACKSON (CONT'D)\n          I just put my boys down for the\n          first time in two days. I can't\n          wake `em and sure as hell can't be\n          gone if they stir on their own.\n\n                    RONALD FLEURY\n          Can I come back?\n\n                       AARON JACKSON\n                 (too loud)\n          WHY?\n\n                    RONALD FLEURY\n          Your boys...\n\nJackson remembers the warning he just spoke...\n\n                    RONALD FLEURY (CONT'D)\n          To ask about two nights ago.\n\nFresh tears re-animate his face:\n\n                    AARON JACKSON\n          When my wife's jaw was shot off in\n          front of our sons? My sons who sat\n          with her while she bled to death?\n          Couldn't speak because she didn't\n          have the bottom of her face and I\n          wasn't home and my baby boys are\n          destroyed for life and my five year-\n          old had a box of band-aids in his\n          hand when I finally got home?\n\n                                              KINGDOM 8/18/06   70.\n\n\n\n     Silence outside of Mr. Jackson's sobbing. Fleury sick to his\n     stomach. Desperate to let this man alone. No eye contact.\n\n                         RONALD FLEURY\n               ...I won't pretend to know...\n\n     Aaron Jackson settles, wipes away tears, appreciates the\n     honesty. Then bites back into his rage:\n\n                          AARON JACKSON\n               Kill everyone that had something to\n               do with this. Everyone related to\n               them. Everyone who knew them.\n                   (beat)\n               And all you'd be doing is their\n               recruiting for them... It's an\n               entire generation: not small and\n               isolated like they say. But a\n               generation that thinks what they\n               did to my wife, to my children, is\n               a \"calling\"...\n\n                         RONALD FLEURY\n               Up the street, there was a wreck,\n               did you see any-\n\n                         AARON JACKSON\n               -notice how it wouldn't take a lot\n               to disguise your friend\n                   (points to Al-Ghazi)\n               as a Mexican? Think he couldn't\n               handle crossing our deserts? Look\n               around!\n\n                         RONALD FLEURY\n               Aaron-\n\n                         AARON JACKSON\n                   (explodes)\n               -LET ME FINISH GOD DAMN YOU-\n\n     A child's scream from inside. Piercing. Scary. Jackson goes\n     red, clenched fists, steps to Fleury who takes an instinctive\n     step backward, guard-up. Jackson stops, spins back inside. A\n     door slam that rattles the plywood sheet covering the\n     shattered window. The screams become night terror shrieks.\n\n\n74   EXT. JACKSON HOME                                            74\n\n     A LONG, SAD BEAT, as Fleury and Al-Ghazi stand alone in front\n     of the Jackson house.\n\n                                             KINGDOM 8/18/06   71.\n\n\n\n                         RONALD FLEURY\n                   (to Al-Ghazi)\n               Can we tour the compound? Can we\n               please do that?\n\n     Slow nod from Al-Ghazi.\n\n\n75   EXT. BOMB SITE - LATER                                      75\n\n     The team tours the site.\n\n     As they fan out. They walk casually, but focused through the\n     first bomb site. An inquisitive Mayes, already peering into a\n     mostly in-tact car, halfway out of its parking spot. Al-Ghazi\n     and Haytham watch the Americans like mother-hens.\n\n                         JANET MAYES\n               He or she almost made it.\n\n     Fleury steps, looks inside: blood and safety glass coat the\n     seat. Janet points to keys in the ignition: still at the `on'\n     position. Then the stick-shift, pulled to the back right:\n     reverse. The shift-knob bloody...\n\n                         JANET MAYES (CONT'D)\n                   (beat, quieter)\n               Makes me think of the Trade Centers\n               -- the people on the floors above\n               the impacts -- no matter how fast\n               or strong or smart you are, if\n               you're in the wrong spot, `it' will\n               not let you get away.\n\n                         FLEURY\n               That's what makes this a War.\n\n     Sykes notices something on the ground... he picks up a\n     military detonator, discretely hands it over to Fleury.\n     Fleury quietly pockets it.\n\n\n76   EXT. THIRD BLAST SITE - MOMENTS LATER                       76\n\n     Structures 100 feet away look like they've been hit with a\n     God-sized sawed-off. The crater: 25-feet wide, 7-feet deep.\n     Blackened frames and bits of vehicles circle the crater. The\n     bottom of the crater filled with water. A syphon-pump works\n     overtime. No SANG Investigators around.\n\n                         COLONEL AL-GHAZI (O.C.)                      \n               About one hour into the rescue.\n\n                                            KINGDOM 8/18/06   72.\n\n\n\n                         ADAM LEAVITT\n               Hit a water main?\n\n                         COLONEL AL-GHAZI                            \n               No -- from the tanks of this fire\n               engine: that's the water that\n               didn't evaporate in the blast.\n\n     Al-Ghazi points to a mass of black metal: looks like a fire\n     truck the way a Jackson Pollock looks like the Mona Lisa.\n     Leavitt and Grant stand back. Quiet:\n\n                         GRANT SYKES\n                   (eyes on Fleury)\n               Hole is the case. See, there's\n               \"evidence\" down in that hole. You\n               understand evidence? Little things\n               that are \"clues.\" Clues can be very\n               helpful to a fella when he's trying\n               to solve a crime.\n\n                         COLONEL AL-GHAZI                            \n               I understand that.\n\n                         GRANT SYKES\n               Glad to hear it. So can we get in\n               there?\n\n                         COLONEL AL-GHAZI                            \n               No.\n\n     Sykes holds Al-Ghazi's gaze. Smiles.\n\n                         GRANT SYKES\n               OK.\n\n     Fleury is taking in the entire crime scene. He notices a four\n     story building half a mile off the perimeter.\n\n     He watches Al-Ghazi rip at a chunk of floorboard wedged into\n     the mud, bag it himself, search for someone to give it too.\n     Nobody. Sets it down. Stands, wipes his hands hard on his\n     pants. Fleury could swear the dirt stains are intentional:\n     trying to feel like he's doing something.\n\n\n77   EXT. DESERTED STREET, AL-RAHMAH - MOMENTS LATER            77\n\n     The Land Cruiser Haytham rammed - driver's side crushed,\n     bullet holes, out-of-control skid-marks, asphalt scars from\n     the snapped drive shaft...\n\n                                         KINGDOM 8/18/06   73.\n\n\n\nFleury is moving around the scene, restaging the shoot out.\nInstantly lining up the angles.\n\nLeavitt's taking digital snaps of the shattered Land Cruiser.\nThrough the viewfinder: the caved-in door. Two snaps.\n\nA SANG passes Adam, his gun aimed a touch high.\n\n                    ADAM LEAVITT\n              (to Fleury)\n          A little high...\n\n                    FLEURY\n              (to SANG, \"Lower,\" in\n               Arabic)\n          Watt-tee...\n\n                    ADAM LEAVITT\n          Watt-tee fuck (alt: \"Watt-tee\n          hell...\") is his gun doing up so\n          high?\n\n                     COLONEL AL-GHAZI                            \n              (to Fleury)\n          This vehicle was stolen. Two\n          drivers murdered. A team outside\n          the blast-radius...shooting at\n          anything. Everyone.\n              (beat)\n          Sergeant Haytham ended this part.\n\n                    ADAM LEAVITT\n              (to Al-Ghazi)\n          Are the Shooters in-custody-\n\n                    SERGEANT HAYTHAM\n          -dead.\n\nSo Sergeant Haytham speaks English...\n\n                    FLEURY\n          Were any of these shooters your\n          men?\n\n                    SERGEANT HAYTHAM\n          No.\n\nFleury's thinking, looking into the car. Searching the\nhorizon, he spots a distant apartment building providing a\nview of the crime scene.\n\n                                              KINGDOM 8/18/06    74.\n\n\n\n                           FLEURY\n                 They got into the compound.\n                 Somehow...took control of this\n                 vehicle. I'm guessing they didn't\n                 politely ask whoever was in this\n                 car if they could take it for a\n                 little ride?\n\n       Fleury gets in the car, checking out ballistic shreds in the\n       back of the passenger seat headrest.\n\n                           AL-GHAZI\n                 No, they didn't. There were two\n                 officers in the car. Both were\n                 executed.\n\n                            FLEURY\n                 I understand that. Those men were\n                 your men--\n\n                           SERGEANT HAYTHAM\n                 -- they were. They were Police.\n\n                              FLEURY\n                 I'm sorry.\n\n       Al-Ghazi offers the slightest of nods to Fleury.\n\n                           FLEURY (CONT'D)\n                 Where was this car when they hit\n                 it?\n\n\na77A   EXT. AL-RAHMAH - MAIN GATE                                a77A\n\n       Al-Ghazi leads our team to the main gate.    Sykes and Fleury\n       follow close.\n\n                           COLONEL AL-GHAZI                             \n                 Security is a combination of the\n                 police and military.\n\n       Leavitt and Mayes lag behind a bit. Leavitt makes eye\n       contact with a YOUNG SAUDI behind the .50 caliber.\n\n                           JANET MAYES\n                 Good news is that if he shoots you,\n                 he's gonna shoot you sitting on an\n                 American tank... with an American-\n                 made bullet. So, it's kind of \"all\n                 in the family.\"\n\n                                             KINGDOM 8/18/06   75.\n\n\n\n                          ADAM LEAVITT\n                How about we get into those\n                American Suburbans... with their\n                American A/C...\n\n      Al-Ghazi continues the tour as Fleury once again notes the\n      familiar apartment off in the distance.\n\n\n77A   EXT. AL-RAHMAH - SECURITY STATION CAR PARK - LATER        77A\n\n      A car port. Fleury and team moving around the area. Fleury\n      picks up some broken glass from the ground.\n\n                          FLEURY\n                The car was parked here?\n\n                             AL-GHAZI\n                Yes.\n\n                             FLEURY\n                Backed in?\n\n                             AL-GHAZI\n                Yes.\n\n      Fleury studies the scene.\n\n                          FLEURY\n                They were attacked from the front.\n                Must have assumed the killers were\n                fellow officers... Have any of\n                these men been identified?\n\n                          COLONEL AL-GHAZI                            \n                Not yet. We will check certain\n                neighborhoods. It is likely that\n                the four men prayed at the same\n                Mosque.\n\n                          JANET MAYES\n                The same Mosque is enough to\n                identify them, link them to a cell?\n\n                          COLONEL AL-GHAZI                            \n                Yes. If the Mosque is in Suweidi.\n\n                             ADAM LEAVITT\n                Suweidi?\n\n                                        KINGDOM 8/18/06   76.\n\n\n\n                    JANET MAYES\n          Suweidi is a known militant\n          stonghold. Al-Qaeda could recruit\n          from storefronts.\n\nOn Fleury: he looks back at the homes, then up and around: He\nlocks on the OBSERVATION BUILDING in the distance.\n\n                    FLEURY\n          Can we go to check out some of\n          these surrounding buildings?\n\n                    COLONEL AL-GHAZI                            \n          Why?\n\n                    FLEURY\n          Seems reasonable that the Planner\n          had to observe and based on Hamza's\n          past history, it's consistent that\n          he would want to video the attack.\n          Is that true? Is that accurate?\n\n                    COLONEL AL-GHAZI                            \n          That is true.\n\n                    RONALD FLEURY\n          Well, in order to video, in order\n          to observe, you need a view.\n\nFleury points to one particular building.\n\n                    FLEURY\n          That building sees all three crime\n          scenes.\n\nAl-Ghazi looks up to the building. Back to Fleury.\n\n                     COLONEL AL-GHAZI                           \n              (beat)\n          It's outside the walls-\n\n                    ADAM LEAVITT\n          -c'mon now. This is insane: we got\n          enough security to invade Suweidi,\n          let alone that building-\n\n                    COLONEL AL-GHAZI                            \n          -no you don't.\n\n                    FLEURY\n              (to Al-Ghazi, respectful)\n          Could you ask?\n                    (MORE)\n\n                                              KINGDOM 8/18/06   77.\n\n                         FLEURY (CONT'D)\n               We're already seeing the crime-\n               scenes individually -- why not all\n               at once?\n\n                         COLONEL AL-GHAZI                              \n               Any answer will take-\n\n                         FLEURY\n               -time. I understand.\n\n     Fleury speaks slowly and clearly now: like he's cementing his\n     words in his own head as he speaks them.\n\n                         FLEURY (CONT'D)\n               You have to ask the General, then\n               the General would ask the Prince.\n               Does it go higher or is that... is\n               the Prince the end of the chain?\n\n     Al-Ghazi hesitates, can't help but be charmed. Fleury clearly\n     knows when to step-on or lay-off the gas. He's smooth... and\n     HIGHLY EFFECTIVE: Al-Ghazi nods `yes' to the strange half-\n     question.\n\n                          FLEURY (CONT'D)\n               We'll be at the Community Center.\n                   (beat)\n               Janet, wanna play hoops?\n\n\n78   INT. AL-RAHMAH COMMUNITY CENTER HOOPS COURT - NOON           78   \n\n     We're in the big gym as our team sits and waits. Leavitt taps     \n     on a laptop.                                                      \n\n     Janet shoots free throws by herself.\n\n                         JANET MAYES\n               This is the kind of radical\n               circumstance that could have\n               seriously upped Shaq's free throw\n               percentages. Take a man. Ship him\n               off to Riyadh. No phones, constant\n               threat of death, no girls, no hip\n               hop. Nothing... just free throws.\n               Shaq, he'd be shooting at least\n               seventy percent. Lakers would still\n               be together. Kobe and Shaq lovers\n               forever.\n\n     Leavitt calls to Fleury.                                          \n\n                         LEAVITT                                       \n               Hey, Boss... check this out.                            \n\n                                             KINGDOM 8/18/06     78.\n\n\n\n      Fleury moves over to Leavitt. Checks out the screen.              \n\n                          LEAVITT (CONT'D)                              \n                Just posted half hour ago.                              \n\n      IMAGES ON THE COMPUTER: ARABIC EXTREMIST WEBSITE. Video           \n      footage shot from the rooftop of all three bombings and some      \n      of the machine gun killings.                                      \n\n                          LEAVITT (CONT'D)                              \n                So self congratulatory. Makes me                        \n                sick.                                                   \n\n      Fleury studies the footage. Backs it up plays it again and        \n      again.                                                            \n\n\n78A   INT. LOCATION UNKNOWN - TIME UNKNOWN                        78A\n\n      A set of stronger, younger, in-tact hands gently pours a\n      mixture into a box now. Ball bearings, children's jacks,\n      marbles, razor blades, roofing nails: everything malevolent\n      densities and angles. Some pieces bounce out, run along the\n      floor. The younger hands then start pressing/molding the\n      pieces of soon-to-be shrapnel into the putty.\n\n\n79    EXT. RIYADH SUBURB NEAR COMPOUND - AFTERNOON                 79\n\n      Five car convoy moving quickly through the city.\n\n\n80    EXT. SPOTTER APARTMENT- LATER                                80\n\n      Our convoy pulls up in front of the apartment. They exit the\n      vehicles. Our team stands surrounded by a 50-man security\n      detail, rifle-stocks to shoulders. Double-time it - outside\n      the walls now, hostile territory. Two-man sniper teams out\n      front. Al-Ghazi ten steps ahead.\n\n      A SANG five car security CREW pulls up, tracking Fleury and\n      company. A stand off between the two police forces.\n\n\n81    EXT. SPOTTER APARTMENT - NEXT MOMENT                         81\n\n      The SANG Officer in-charge steps to Al-Ghazi. In Arabic:\n\n                          SANG OFFICER\n                This is unacceptable.\n\n                                       KINGDOM 8/18/06   79.\n\n\n\n                    COLONEL AL-GHAZI                            \n          It's cleared with General Abdul-\n          Malik. We have five minutes here.\n\n                    SPECIAL FORCES OFFICER\n          We were told they must remain in\n          the vehicles...\n\n                    COLONEL AL-GHAZI                            \n          That is not true...\n\n                    SPECIAL FORCES OFFICER\n          They must stay in the Toyotas-\n\n                    COLONEL AL-GHAZI                            \n          -report me then when you get in-\n          touch with the General-\n\n-Officer reaches down from nowhere and hammers Al-Ghazi open-\nhanded as Al-Ghazi tries to step past. Collective shock.\n\nIn that breath, Haytham punishes the Officer with a left-\ncross: knees buckle before he comprehends what hit him.\nHaytham's kick follows, catches the Officer in the sternum as\nhe hits ground.\n\nAl-Ghazi shakes it out, trades blows with the SANG second in-\ncommand.\n\nLeavitt moves, catches a rifle butt to the shoulder after two\nsteps. Fleury aims, drills the Soldier that butted Leavitt:\ninstant night-night. Another SANG steps up. Fleury throats\nhim, knee caps him, and grabs his weapon before the dude hits\nthe ground.\n\nFleury can obviously fight... all the above happens in four\nseconds.\n\nThen, a `knock-it-off' gunshot aimed at the sky pops one-foot\nfrom Janet's head. We hear what she hears: one half-second of\nthe shot, then the big ring. On her knees immediately, hand\nover her ear. In response: heavy-caliber gunfire flies: group\nflinch-n-crouch. The warning shots from a .50-caliber mounted\non a Humvee racing this way from Al-Rahmah: dust plumes from\nthe speed. Members of the security detail and the Special\nForces go Mexican stand-off.\n\n                    JANET MAYES\n          Tell me it didn't burst-tell me it\n          didn't burst-\n\n                                               KINGDOM 8/18/06   80.\n\n\n\n     Al-Ghazi the first to her, touching her hand to pull it away\n     from the ear. A SANG nearby sees this: spits two inches from\n     Al-Ghazi. Al-Ghazi leans to Janet's non-ringing side:\n\n                            COLONEL AL-GHAZI                            \n               No blood.\n\n     The Humvee now slides to stop ten feet from the fracas.\n     General Abdul-Malik out of the passenger seat, in Arabic:\n\n                            GENERAL ABDUL-MALIK\n               WHO FIRED?\n\n     That Soldier's hand goes up sheepish. Two men out of the\n     Humvee's backseat break him down, face first in the dirt:\n     cuff him, lock him in the vehicle.\n\n                            GENERAL ABDUL-MALIK (CONT'D)\n               AND WHY?\n\n                         SPECIAL FORCES OFFICER\n                   (standing, doubled over)\n               A disagreement.\n\n     The General grabs the Officer by the back of his head: an\n     abusive Dad. Walks him to the side.\n\n                         GENERAL ABDUL-MALIK\n                   (back to Al-Ghazi)\n               FIVE MINUTES.\n\n     Al-Ghazi looks back down at Janet, at Leavitt's bruise, at\n     the man Fleury knocked out. Angry. Impressed: fought\n     alongside him. Haytham hasn't moved an inch, not even when\n     the General came, chin raised to an entire platoon: say when.\n\n                         COLONEL AL-GHAZI                               \n                   (to Fleury)\n               Five minutes.\n\n     The SANG move back. The team staggered, slowly remembering\n     why they're here in the first place, finally make their way\n     to the Roof Top.\n\n\n82   EXT. ROOF TOP - CONTINUOUS                                    82   \n\n     Fleury finds a table with a view. Tabletop: holes and finger-\n     paint stains. Al-Ghazi three feet away. Both look in the same\n     direction: two Tigers being held back.\n\n                                       KINGDOM 8/18/06   81.\n\n\n\nFleury's studying the housing compound through a video          \ncamera, comparing the images on his camera with what he saw     \nposted on the internet.                                         \n\n                    FLEURY                                      \n          You've seen the images of the                         \n          attack posted on the internet?                        \n\n                    AL-GHAZI                                    \n          Yes.                                                  \n\n                    FLEURY                                      \n          Look for yourself.                                    \n\nAl-Ghazi takes the camera from Fleury. He lines up the same     \nshots we saw posted on Leavitt's computer: clearly a match.     \nThis is where they shot the video                               \n\n                    AL-GHAZI                                    \n          He was here...                                        \n\nAnother long moment. Al-Ghazi looks at the table, discarded\ntrash: the Capri Sun containers, the candy wrappers.\n\n                     RONALD FLEURY                              \n          Formed the plan up here: saw\n          everything he could hit.\n              (beat)\n          Way too pretty a' plan to have been\n          fully hatched on just one visit. He\n          came here a couple times.\n\nAl-Ghazi quiet for a long while. Then he reciprocates:          \n\n                    COLONEL AL-GHAZI                            \n          The man who did this is a Saudi -                     \n          this place, this neighborhood... if                   \n          foreigners were up here, someone\n          would say something.\n\nFleury looks over to the two dozen LOCALS peering out with\nsuspicion at them on the rooftop.\n\n                    FLEURY\n          I see.\n\n                    COLONEL AL-GHAZI                            \n          Nobody's talking. Here, many people                   \n          love Hamza - they think of him like                   \n          Bin Laden. Like your Robin Hood.                      \n\nFleury smiles small at whatever just passed between them. Al-\nGhazi stays stoic, then looks straight at Fleury:\n\n                                         KINGDOM 8/18/06   82.\n\n\n\n                       COLONEL AL-GHAZI (CONT'D)                  \n            A man who thinks of something like\n            this ...while maybe his family\n            played around him... scares me more\n            than I have words to express.\n            Shaytan...\n\n                      RONALD FLEURY\n                (refocusing)\n            Two big answers in two small\n            minutes. Imagine if we had a couple\n            days together.\n\nAl-Ghazi pauses.\n\n                      RONALD FLEURY (CONT'D)\n            I'm sure the General is good\n            guy...and I'm just as sure he's no\n            Investigator.\n\nAl-Ghazi stands still, silent. Fleury reaches into his\npocket. Reveals the detonator to Al-Ghazi. Al-Ghazi reaches\nto take it. Fleury holds it for a BEAT...\n\n                      RONALD FLEURY (CONT'D)\n            Let me help you.\n\nHe hands the detonator to Al-Ghazi.    Al-Ghazi now pockets it.\n\nA BEAT...\n\n                      COLONEL AL-GHAZI                            \n            We break now: too hot to work\n            outdoors. Then we will leave for\n            the Palace.\n\n                      RONALD FLEURY\n            And I imagine that will run until\n            sundown?\n\n                       COLONEL AL-GHAZI                           \n                (beat)\n            I had televisions delivered to your\n            quarters to pass the downtime.\n\nFleury just nods back.\n\n                      COLONEL AL-GHAZI (CONT'D)                   \n            Miss Mayes will not attend this\n            evening. Men only.\n\nFleury looks over to Janet. Hurt, yet extremely defiant, she\nlooks ready to attack anything that comes near her.\n\n                                               KINGDOM 8/18/06   83.\n\n\n\n                         FLEURY\n               You want to tell her that?\n\n\n83   EXT. CHEVY SUBURBAN, RIYADH SUBURBS - EARLY EVENING           83\n\n     Cobra gunships covering the convoy as it blurs past police\n     checkpoint after police checkpoint. Intersections shut down.\n     Bracketed front and back by Saudi Humvees.\n\n\n84   INT. CHEVY SUBURBAN, RIYADH SUBURBS - NEXT MOMENT             84\n\n     Al-Ghazi in the passenger seat, hand on the stock of his Mp-\n     5: again searching for threats. Our team in back, freshly\n     scrubbed, collared-Polos as formal as anyone thought to pack.\n     Team frustration has evolved into angry acceptance.\n\n     The convoy zipping alongside a wall now: desert-orange in\n     color, twelve-feet high, blue ottoman tiles running the\n     length of the wall's horizontal center-line.\n\n                         COLONEL AL-GHAZI                               \n               We're here.\n\n     The helicopters peel off at steep angles, the sound of the\n     rotors reverberating in your chest. Leavitt watching them go:\n\n                            ADAM LEAVITT\n               Big wall.\n\n                         COLONEL AL-GHAZI                               \n               It's a big palace.\n\n\n85   INT. PRINCE BIN KHALED'S PALACE - DAY                         85\n\n     Majlis - a Saudi political ceremony in which Saudi citizens\n     and local politicians (most aristocratic and exclusive) are\n     permitted a brief audience with the Prince. A bizarre\n     receiving line of sorts.\n\n     Our team moves through a massive marble hallway towards the\n     ceremony.\n\n                         ADAM LEAVITT\n               How many Princes are there?\n\n                            COLONEL AL-GHAZI                            \n               Over 5000.\n\n                         RONALD FLEURY\n               They all get palaces this big?\n\n                                                KINGDOM 8/18/06   84.\n\n\n\n                          COLONEL AL-GHAZI                               \n                Some get bigger.\n\n                          ADAM LEAVITT\n                Who pays for all this?\n\n                          GRANT SYKES\n                General Motors, Ford, Chevrolet...\n\n                          ADAM LEAVITT\n                Hey, man - I drive a Hybrid.\n\n                          COLONEL AL-GHAZI                               \n                    (a beat...)\n                The Prince will ask you about your\n                flight, the accommodations...lite\n                subjects. If he offers you the\n                chance to hold his Raptors, don't\n                flinch: it's a compliment.\n\n                          ADAM LEAVITT\n                    (to Grant: genuine worry)\n                What's a Raptor?\n\n      Damon Schmidt appears.\n\n\n85A   INT. PRINCE BIN KHALED'S PALACE - LATER                      85A\n\n      The Prince sits on a sea of pillows. There are several small\n      flat screens playing business reports, CNN and Al-Jazeera.\n\n      Seen from behind the Prince: everyone but Leavitt standing\n      next to faces we've never seen. The table holds six gold\n      serving platters. Enough food to kill a famine, tended by a\n      frenzy of servants.\n\n      Sykes puts a hand over his cup to stop the constant tea re-\n      fill.\n\n      Leavitt stands to the Prince's left, thick leather glove on\n      his hand, a falcon perched on it. Leavitt holds it away from\n      the rest of his body like he's already made peace with losing\n      the arm. Servants hold three others close-by.\n\n                          PRINCE BIN KHALED\n                His talons slice bone.\n\n                          ADAM LEAVITT\n                Super.\n\n                                       KINGDOM 8/18/06   85.\n\n\n\n                    PRINCE BIN KHALED\n          That's my most prolific Hunter. I'm\n          trying to teach his friends there\n          by example, but I fear it's\n          something you're born with or not.\n          Do you agree, Mr. Ronald? Innate or\n          not at all?\n\n                    RONALD FLEURY\n          I do.\n\n                    PRINCE BIN KHALED\n              (nodding: I could tell)\n          What have you seen so far of our\n          Kingdom? -- and know I can arrange\n          tours anywhere within our borders.\n\nWhen I bull-rush our hosts you'll know it: In his quiet, calm-\namidst-the-bullets tone:\n\n                    RONALD FLEURY\n          I've seen that the man who planned\n          the worst crime in your Kingdom's\n          history is without a doubt Saudi...\n\nPin-drop silence in response to Fleury murdering the Prince's\n\"lite subjects,\" his attempt to extend the gilded circle-jerk\nby offering tours. Bin Khaled's face sinks to gray again\nafter the excited pink of talking about his Falcons. His hand\nslowly moves back over his stomach: Napoleon's ulcers. As\nFleury speaks, people unconsciously put their tea-cups down,\nlook up at him with wide-eyes.\n\n                     RONALD FLEURY (CONT'D)\n          ..and that if you walk 300\n          kilometers from the compound, you\n          will find a rooftop where the\n          attacks were planned. I've seen\n          that the person in this room \"born\n          with it\" is right there...\n              (points at a gawking Al-\n               Ghazi)\n          Everything I just said came from\n          Colonel Al-Ghazi: his observations                     \n          of the scene while he was\n          protecting us. And I think you're\n          absolutely right Sir: that kind of\n          instinct can't be taught: not to\n          Falcons. Definitely not to SANG\n          Generals. Innate or not at all.\n              (beat)\n          You want the murder to stop as much\n          as I do. Let us help.\n\n                                        KINGDOM 8/18/06   86.\n\n\n\nThe Prince stares at Fleury, cataloguing everything Fleury\njust said. Stands. In Arabic:\n\n                    PRINCE BIN KHALED\n          Colonel Al-Ghazi, a word.                             \n\nAs the Prince walks out with Al-Ghazi, he signals another\ncorps of servants to serve another round of cups: coffee.\nDinner over. A servant takes the Falcon from Leavitt just as\nhe was starting to smile at it.\n\nFleury sips his coffee. Schmidt and Sykes approach.\n\n                    GRANT SYKES\n          That was impressive.\n\n                    RONALD FLEURY\n          Think it will work?\n\n                    GRANT SYKES\n          Yeah. Maybe. I mean, you can only\n          play the \"I'm going to the press\n          card\" like three more times. So,\n          maybe.\n\n                    RONALD FLEURY\n          They're paranoid and overly self-\n          protective.\n\n                    DAMON SCHMIDT\n          They aren't protecting anyone.\n          There's no conspiracy. They're just\n          terrified. Finally. The Saudis have\n          finally seen the Monsters they\n          helped create, because those\n          Monsters have come home. And if\n          Saudis don't catch Saudi Monsters,\n          that's the end.\n\nFleury opens his mouth to interrupt.\n\n                    DAMON SCHMIDT (CONT'D)\n              (right through Fleury's\n               attempt to speak)\n          And that end could come double-\n          quick if they let the US \"Shaytan\"\n          catch those Monsters for them.\n              (Fleury silent, gets it)\n          Because that's what the Saudi on\n          the street suspects: the only thing\n          keeping the Royal Family upright is\n          American evil.\n\n                            KINGDOM 8/18/06   87.\n\n\n\n          GRANT SYKES\nThat's dead on accurate. Very\nimpressive. That's why they're\nmaking it hard on us, and that's\nwhy he wants to help `em turn the\nscrews.\n\n          RONALD FLEURY\nThey can have every shred of credit-\n\n          DAMON SCHMIDT\n-you see the slums on the way in?\n\n          RONALD FLEURY\nYeah.\n\n          DAMON SCHMIDT\nSee that even though their homes\nare falling down, they had\nsatellite dishes bolted on?\n\n          RONALD FLEURY\nYeah...\n\n          DAMON SCHMIDT\nEveryone already knows you're here.\nCredit? If the Saudis cracked this\nCell while these servants were\npouring coffee, Al-Jazeera still\nleads the story with your Team.\n\n          RONALD FLEURY\nHave you been to the crime-scene?\n\n          DAMON SCHMIDT\nNo-\n\n          RONALD FLEURY\n-if you had, you'd see the evil\nwork of real Talent. The kind that\ndoesn't stop until it's forced.\n\n          DAMON SCHMIDT\nAnd the path to Hell is paved with\ngood intentions.\n\n          RONALD FLEURY\nYou having fun?\n\n          DAMON SCHMIDT\n    (genuine smile)\nBeats hell outta visa-stamping.\n    (smile vanishing)\n          (MORE)\n\n                                             KINGDOM 8/18/06   88.\n\n                         DAMON SCHMIDT (CONT'D)\n               You're on an island. I hope you\n               know how to get off.\n\n                         RONALD FLEURY\n               By catching Abu Hamza.\n\n     Raising his coffee, toasting Fleury's cup:\n\n                         DAMON SCHMIDT\n               Then here's to you. Let's bet: when\n               this Colonel Al-Ghazi comes out,                       \n               he's in-charge of the investigation\n               -if so, you set me up on a date\n               with Janet Mayes.\n\n\n86   INT. CHEVY SUBURBAN, RIYADH SUBURBS - NIGHT                 86\n\n     100 m.p.h. Semi-grins from the Team: how the fuck did he do\n     that? Al-Ghazi on a cell, rattling orders in excited Arabic:\n\n                         COLONEL AL-GHAZI                             \n               ... every investigator on-scene by\n               midnight, 50 more portable lights,\n               three more pumps-\n\n                           RONALD FLEURY\n                   (to   Leavitt)\n               Do me a   favor and tell Janet that\n               she and   Damon Schmidt got a date\n               when he   gets back to the States.\n\n     Al-Ghazi points into darkness...\n\n                          COLONEL AL-GHAZI                            \n               The rules still stand.\n                   (beat)\n               But tomorrow will be a new day.\n\n\n87   INT. UNKNOWN LOCATION - SAME MOMENT                         87\n\n     TIGHT ON blasting caps, military detonators, nails, wing-\n     nuts, bolts, jacks, marbles... young hands feed lengths of\n     detonating wire through pre-drilled holes on a wooden cover.\n     The cover is attached to the box with nails and a rubber\n     mallet: no sparks. The wires are braided into one, clipped to\n     a lead on a servo-motor attached to the box-top.\n\n     A vehicle is being fitted with tire guards and heavy-duty\n     crash bumpers - all as a man quietly talks.\n\n                                            KINGDOM 8/18/06   89.\n\n\n\n     WIDEN to reveal the MAN, being VIDEOTAPED: foretelling of new\n     threats, face obscured by his head wrap. Several other MEN\n     watch and listen.\n\n     TIGHT ON the man's eyes. REVEAL PHOTOS on a nearby table: the\n     Al-Rahmah compound, Fleury with Al-Ghazi, Leavitt and Mayes,\n     Sykes and Haytham.\n\n                                                       CUT TO:\n\n\n88   EXT. AL-RAHMAH COMMUNITY CENTER - MORNING, SECOND DAY       88\n\n     Half-assed gardening party. Al-Ghazi worked through the\n     night, hasn't slept since we last saw him. Looks like it.\n\n                         COLONEL AL-GHAZI                             \n               From now on, any evidence you find\n               you hand over.\n\n     Al-Ghazi smiles...\n\n                         COLONEL AL-GHAZI (CONT'D)                    \n               I'm \"all ears,\" Special Agent\n               Fleury.\n\n                         RONALD FLEURY\n               We should start with the dead\n               shooters.\n\n                         COLONEL AL-GHAZI                             \n               They had no identification on them.\n               Fingerprints and dental have come\n               up empty.\n\n                         RONALD FLEURY\n               Can we photograph all three of\n               them? Couple hundred copies each...\n\n                         COLONEL AL-GHAZI                             \n               No problem.\n\n                          RONALD FLEURY\n               Good. If it's OK with you, I'd like\n               to suggest we split up as\n               follows...\n\n     Sykes and Leavitt can't help small smiles. Finally getting to\n     work.\n\n                                             KINGDOM 8/18/06   89A.\n\n\n\n\na89   EXT. BLAST SITE - MORNING                                  a89   \n\n      Sykes climbs down into the mud hole.                             \n\n                          GRANT SYKES                                  \n                    (from the crater)                                  \n                Fellas, what we want to do is get                      \n                this water out of here... see                          \n                what's really going on. Understand?                    \n\n      No reaction from Saudi police                                    \n\n                          GRANT SYKES (CONT'D)                         \n                C-VIN hunting--Data Plates--                           \n                Something drivable blew up. That's                     \n                pretty obvious. Feels like ANFO to                     \n                me, boys--Ammonium Nitrate Fuel                        \n                Oil. Let's dry this hole and see                       \n                if we can't figure what she was.                       \n                Gotta pump?                                            \n\n                                            KINGDOM 8/18/06   90.\n\n\n\n\n89   EXT. BLAST SITE - LATER                                      89   \n\n     Grant at the Crater. Three brand-new industrial-sized pumps       \n     draining it. 30 Police INVESTIGATORS watch Sykes.\n\n                         GRANT SYKES\n                   (to the Saudis)\n               Got to get a little dirty, people.\n               Crawl up in it. Make deep contact.\n               You get that?\n\n     Dead, confused stares from the Saudis into the mud hole...        \n     Sykes happy as a pig in shit.                                     \n\n                         GRANT SYKES (CONT'D)\n               Get nasty, dirty, filthy.\n\n     He smiles, watches another Officer write Saudi translations\n     on the stainless-steel paint cans into which you load\n     evidence: shrapnel, soil, DNA, shells, etc.\n\n\n90   EXT. DEATH SQUAD SCENE, AL-RAHMAH - SAME MOMENT              90\n\n     A JUNIOR OFFICER double-times it to Al-Ghazi with a stack of\n     photos: Rough head-shots of the three dead SHOOTERS. Fleury\n     takes some, hands the rest back to Al-Ghazi.\n\n                         RONALD FLEURY\n               Have him pass these out to the\n               compound security. See if anybody\n               knows them.\n\n     Fleury, Leavitt, and Al-Ghazi walk past the Land Cruiser\n     Haytham took out. 15 Police INVESTIGATORS on-scene: Leavitt\n     stops, drops his bag. Al-Ghazi introduces him to the Officer\n     in-charge.\n\n     Leavitt opens his evidence kit. A couple of Police can't help\n     but sneak a peek, checking out what the American's got\n     inside.\n\n\n91   INT. RIPON HOME - LATER                                      91\n\n     Fleury stands with Al-Ghazi back in the Ripon home.\n\n                         RONALD FLEURY\n               Would you mind doing one more thing\n               for me?\n\n                                         KINGDOM 8/18/06   91.\n\n\n\n                       EARL\n          No, Sir.\n\nFleury pulls out the photographs.\n\n                    RONALD FLEURY\n          Could you tell me if you recognize\n          any of these men?\n\nFleury puts the three photographs down on the dining room\ntable: not pretty pictures. Earl and Janine study the photos.\n\n                    JANINE\n          ...Horrible.\n\nA few moments, then:\n\n                    EARL\n          I don't know any of them.\n\nFleury thinks a minute. Looks outside.\n\n                    FLEURY\n          I'm just wondering. That chair out\n          side. Looks like it gets a lot of\n          wear. Looks comfortable.\n\n                    EARL\n          That my mom's chair.\n\n                    FLEURY\n          See, that's exactly what I was\n          thinking. I'm guessing she spends a\n          lot of time sitting outside?\n\n                       EARL\n          All day.\n\n                    FLEURY\n          She must pretty much see it all.\n          Right?\n\n                       EARL\n          She does.\n\n                    FLEURY\n          Where is she?\n\n                    EARL\n          She's sleeping.\n\nPause: Fleury slow nods, then...\n\n                                        KINGDOM 8/18/06   92.\n\n\n\n                      FLEURY\n            Let's wake her up.\n\n\nTIME CUT:\n\nMaddy up at the dinning room table, looking down at the\nphotos.\n\n                      MADDY\n            I've seen him.\n\n                      RONALD FLEURY\n            Where?\n\nMaddy thinking...\n\n                      MADDY\n            Like, a week ago. Twice I've seen\n            him. Watering...With the garden\n            crews. I remember he was wearing a\n            Liza Minnelli T-shirt. I thought\n            that was funny.\n\n                      RONALD FLEURY\n            What about the others?\n\n                      MADDY\n                (closer examination)\n            No. Just him. I remember the T-\n            shirt. I remember thinking it was\n            odd...?\n\n                      RONALD FLEURY\n            What, the Liza Minelli shirt?\n\n                      MADDY\n            No. I do think Liza Minelli's gone\n            odd, but that wasn't it.\n\n                      RONALD FLEURY\n            What was odd?\n\n                      MADDY\n            He was a Saudi. The gardener.\n\n                      RONALD FLEURY\n            Yeah.\n\n                      MADDY\n            Saudis, like Americans, don't do\n            manual labor. Blowing leaves is\n            beneath them.\n\n                                                 KINGDOM 8/18/06   93.\n\n\n\n      Fleury looks to Al-Ghazi for confirmation. Al-Ghazi nods.\n\n                           RONALD FLEURY\n                    (to Maddy)\n                Thank you.\n\n      Fleury and Al-Ghazi start to leave.\n\n                             EARL\n                Who is he?\n\n      Fleury looks back to Earl.\n\n                          RONALD FLEURY\n                That's one of the many things we're\n                trying to find out...\n\n\n92    EXT. RIPON FAMILY HOME - NEXT MOMENT                           92\n\n      Al-Ghazi gives the photo of the IDENTIFIED SHOOTER to an AIDE\n      waiting outside.\n\n                           AL-GHAZI\n                Find out if he worked with the\n                gardeners.\n\n      The aide takes the photo, starts walking away.\n\n                             AL-GHAZI (CONT'D)\n                RUN!\n\n      Freaked, the aide about jumps out of his skin...starts\n      running.\n\n\n92A   EXT. BLAST SIGHT - DAY                                        92A\n\n      Sykes has a SAUDI WORK CREW digging in the hole, pulling out\n      pieces of charred metal. He is slowly laying out the pieces\n      and studying them like a puzzle, trying to figure out what\n      the hell blew up.\n\n\n93    EXT. MOBILE FIELD MORGUE - SAME MOMENT                         93\n\n      Janet and Haytham approach a 2000 square-foot M.A.S.H. Tent\n      attached to refrigeration units.\n\n                                              KINGDOM 8/18/06   94.\n\n\n\n\n     FROM VARIOUS ANGLES:\n\n     SANG OFFICERS look down at the Americans, dead eyed, watching\n     them work.\n\n\n94   INT. MOBILE FIELD MORGUE - NEXT MOMENT                       94\n\n     The Muslim dead wrapped in white linen according to the\n     Sunna. Western bodies lie separated from Arabs. A Saudi\n     TECHNICIAN blankly hands Janet and Haytham lab coats to cut\n     the cold. Three Police OFFICERS in the tent with them:\n     Watching Janet.\n\n     Haytham is looking uncomfortable as if he is embarrassed to\n     be seen with the American woman.\n\n\n95   EXT. JACKSON HOME - LATER                                    95\n\n     Fleury knocks at Aaron Jackson's door. A pause, the peep hole\n     darkens. A longer pause, then the door opens. Aaron Jackson\n     doesn't look any better. Same shirt.\n\n     Packed boxes. Suit cases. Jackson is clearly getting out of\n     Dodge.\n\n                          RONALD FLEURY\n                   (beat)\n               How are your Sons?\n\n     Jackson's eyes shrink-wrapped in tears. After a long silence\n     with no answer, Fleury hands him a sheet of paper:\n\n                         RONALD FLEURY (CONT'D)\n               That's the name of a clinical\n               psychologist. Works with Embassy\n               kids...apparently very good at\n               explaining violence-\n\n                         AARON JACKSON\n               -what do you know about what my\n               kids need? What they saw? What the\n               rest of their lives might be like?\n\n                          RONALD FLEURY\n                   (beat)\n               I thought maybe your Boys...without\n               their Mom anymore...might ask you\n               why sometime...\n\n                                         KINGDOM 8/18/06   95.\n\n\n\nAaron Jackson begins shaking his head yes. Tears flow free:\nsorrow and gratitude. He hangs on to Fleury's hand for a very\nlong time. Silent apologies.\n\n                    RONALD FLEURY (CONT'D)\n          I will find the man responsible for\n          the death of your wife. We're\n          close.\n\n                     AARON JACKSON\n              (beat)\n          Tomorrow it'll be somebody else's\n          wife.\n\nFleury quiet.\n\n                    RONALD FLEURY\n          Then tomorrow I'll come back.\n\nFleury turns his head: Al-Ghazi approaches on the next lawn\ndown with three JUNIOR OFFICERS. Fleury nods goodbye to\nJackson.\n\nFleury approaches Al-Ghazi, holds up the Shooter's photo.\n\n                    COLONEL AL-GHAZI                             \n          The gardener. We know who he is.\n          He's on several watch lists.\n\nFleury - a slight nod of satisfaction.\n\n                    RONALD FLEURY\n          We know where he lives?\n\n                    COLONEL AL-GHAZI                             \n          We will very soon.\n\n                    RONALD FLEURY\n          You don't seem very excited.\n\n                     COLONEL AL-GHAZI                            \n          These are always the easy ones to\n          catch. Rarely does it lead to the\n          planners.\n              (beat)\n          I want to take you somewhere.\n\n                    RONALD FLEURY\n          Where?\n\n                    COLONEL AL-GHAZI                             \n          To someone who may be able to help\n          us catch Hamza.\n\n                                              KINGDOM 8/18/06   96.\n\n\n\n\n96   EXT. BLAST SITE - DAY                                        96\n\n     Ten Police Investigators in the crater with Grant. Outside\n     the crater: pieces of vehicles laid out outside: 1/2 of a\n     door, 1/4 of a front axle, bits of engine. Five feet away\n     from that: stacks of bagged evidence, two dozen evidence\n     containers.\n\n     Sykes clambers out of the hole, streaks of re-animated mud\n     where sweat streams out of his hairline, mad-dashing for his\n     chin. A chunk of metal in one hand, something small in the\n     other: a marble. He drops it in the appropriate cannister\n     then steps to a chunk of metal: one half of an alternator.\n\n     Sykes stares down at the pieces of completely mangled metal.\n     He studies a piece of twisted, half-melted iron. Thinking...\n\n     He walks over to a second larger piece of twisted metal.\n     Starts trying to fit the two pieces...like a puzzle.\n\n\n97   INT. MOBILE FIELD MORGUE, PRESENT DAY - NOON                 97\n\n     The dead, oblong faces of the dog-walkers. Janet uses forceps\n     to pull a wing-nut from one of the dog-walkers. Places it on\n     a sanitary table littered with shrapnel: tiny bits of colored\n     glass, ball-bearings, parts of razor blades, spent slugs, and\n     scraps of unidentified metal.\n\n\n98   EXT. BLAST SITE - CRATER                                     98\n\n     Sykes still works the two large pieces of trashed iron. Until\n     something clicks. The fit. Sykes looks down at the connected\n     metal.\n\n                         SYKES\n               It's a gurney.\n\n     Sykes looks down at the mud colored DIGGERS.\n\n                         SYKES (CONT'D)\n               Who's missing an ambulance?\n\n     Just stares from the Saudis.\n\n                         SYKES (CONT'D)\n               Could somebody please go get\n               Sergeant Haytham?\n\n     Confused stares from the Saudis.\n\n                                               KINGDOM 8/18/06   97.\n\n\n\n                           SYKES (CONT'D)\n                    (loud)\n                Sergeant Haytham!\n\n      Inside the crater: water-level down to the ankles. Three\n      Saudis dig around what looks to be one of the dualie-style\n      back tires. Re-positioning to get a better grip, Sykes\n      notices the top of what looks to be a sizeable, ragged hole,\n      still mostly submerged. Pointing:\n\n                             GRANT SYKES\n                Here.\n\n      Sykes slogs over. He drops to his knees, reaches his hand in,\n      all the way to his shoulder, the side of his face to the\n      water: void. Out of the crater, Sykes points to a Bobcat\n      earth-mover, in Arabic:\n\n                          GRANT SYKES (CONT'D)\n                Who has the keys?\n\n\n99    INT. / EXT. MOBILE FIELD MORGUE - SAME                       99\n\n      Janet stands with the Saudi Pathologist. She prepares to take\n      a fingerprint from a body. As the moves in to touch the Arab\n      hand, one of the GUARDS unloads in her direction - a full\n      guttural Arabic assault. No idea what he's saying, but it's\n      obvious he's furious. Haytham starts firing back. This is an\n      un-translated argument. We sense that the guard is doing more\n      than expressing his displeasure regarding Janet. This seems\n      to be personal. Janet's getting very nervous. A frightening\n      display. Then, Haytham turns:\n\n                          HAYTHAM\n                You cannot touch any Muslims.\n\n      Janet takes a breath as the Police hard-eye her.\n\n                           JANET\n                No problem. Can I still touch\n                Americans?\n\n                             HAYTHAM\n                Of course.\n\n      Janet moves back to the American dead, as the Saudi Tech\n      continues with the Muslims. She pulls another shard of\n      COLORED GLASS from a wound.\n\n\n100   INT./ EXT. SUBURBAN - DOWNTOWN RIYADH                       100   \n\n                                       KINGDOM 8/18/06   98.\n\n\n\n\nSERIES OF SHOTS:\n\nA two car convoy drives deep into the city.                    \n\nThe Convoy is forced to stop across the street from a gas\nstation as a construction crane backs into a drive way.\nAl-Ghazi and Fleury stare across the street as a large gas\ntruck fills up the heavy tanks of a Saudi gas station.\n\n                    FLEURY\n          What's gas running a gallon out\n          here, Al-Ghazi? Penny gallon?\n\nAl-Ghazi smiles.\n\n                    COLONEL AL-GHAZI                           \n          It was an American. An engineer\n          named Karl Twitchell. Hired by\n          Saudi Arabia to find water. He\n          didn't find so much as a dried\n          oasis, but he found this. Enough\n          oil to turn the earth.\n\nFleury stares out as the oil spills out overflowing from the\nstation tank.\n\n                    COLONEL AL-GHAZI (CONT'D)                  \n          They say my country sits on over 1\n          trillion more barrels of\n          recoverable oil.\n\n                    RONALD FLEURY\n          A trillion reasons for our Leaders\n          to hold hands another one hundred\n          years.\n\n                      COLONEL AL-GHAZI                         \n          A trillion reasons to keep\n          fighting. For both sides of this\n          War.\n               (beat)\n          I think our oil has begun\n          destroying more than it creates.\n\n                    RONALD FLEURY\n          Agreed.\n\n                                               KINGDOM 8/18/06   99.\n\n\n\n                           COLONEL AL-GHAZI                              \n                 I'm 46 years-old.\n                     (beat, tired)\n                 I have three daughters. And I find\n                 myself in a place where I no longer\n                 care about `why' we are attacked. I\n                 only care that 100 people woke up a\n                 few mornings ago had no idea it was\n                 their last. When we catch the Man\n                 who murdered these people, I don't\n                 care to ask even one question...I\n                 just want to kill him...stop him.\n                     (beat, a bit embarrassed)\n                 Do you understand?\n\n                              RONALD FLEURY\n                 Yes, I do.\n\n       A long moment. Just road noise. We see two men, as different\n       from each other as they could be, yet made from the same\n       things.\n\n                           RONALD FLEURY (CONT'D)\n                 Is your first name `Colonel?'                           \n\n                           COLONEL AL-GHAZI                              \n                     (a small smile)\n                 Faris.\n\n\n100A   INT. MOBILE FIELD MORGUE - CONTINUOUS                     100A\n\n       A glazed Haytham works with a Pathologist on the Muslim\n       bodies. Their own collection of foreign objects. Janet pulls\n       free 1/2 of a marble from a burrowed hole: explains the\n       shards of colored glass. Cleans it in saline, holds it up to\n       the light. We stare at it with her.\n\n       Janet begins piecing together glass shards - reconstructing a\n       MARBLE.\n\n\n101    EXT. DEATH SQUAD SCENE - DAY                                101\n\n       Police Investigators eat lunch under a tent 50 yards away\n       with Leavitt.\n\n       Then a red laser-sight moves across him: Three MEMBERS of his\n       Police security-detail: smirking, pretending to fidget with\n       an AR-15's aperture.\n\n       Leavitt stares. Subtle defiance. Nobody blinks. Silent\n       moments pass.\n\n                                               KINGDOM 8/18/06   100.\n\n\n      The smallest of the detail reaches over, pulls the cocking\n      device of the rifle: round in the chamber, so stop looking at\n      us.\n\n\n102   INT. BOMB SITE - CRATER                                      102\n\n      Sykes, covered in mud, digging, searching for any signs of\n      identification amongst the charred, mangled metal.\n\n\n103   EXT. INTERNET CAFE - LATER                                   103\n\n      The small convoy pulls up next to a run down, late seventies\n      chunk of architecture which looks like a combination bombed\n      dentist office/ accounting firm. Weird. Two TEENAGERS in Tu-\n      pac T-shirts smoke in front.\n\n      Fleury, Al-Ghazi and a couple of Police head for the blacked\n      out front door.\n\n\n104   INT. INTERNET CAFE - CONTINUOUS                              104\n\n      Moving up two flights of stairs. Dark, rundown shredded\n      carpet. Old hip hop - cheap bass, thin speakers. Smoke.\n      Everything grows in intensity as they move up the stairs. Two\n      more TEENAGERS skulk past.\n\n                          FLEURY\n                    (half joking to Al-Ghazi)\n                Feel like I'm back home in Detroit.\n\n      Al-Ghazi keeps moving up and into what is definitely on\n      Fleury's top ten list of the most bizarre places he's ever\n      been.\n\n\n      FLEURY'S POV:\n\n      Two rooms: First is some kind of snack/smoke/TV lounge.\n      FILIPINOS serve drinks. Packs of young Saudi MEN drink Cokes,\n      tea, coffee, and smoke.\n\n      Odd Saudi talk shows mix with hip hop.\n\n      Behind, another room: bigger, overflowing with stacks of mis-\n      matched computers. Dozens of them. Dozens of Saudi TEENAGERS\n      plugged in. Head-phoned and mic'd. All chain smoking, all\n      fully plugged in to CALL OF DUTY (an American war game) on\n      line. These kids play with rabid intensity, smoking and\n      screaming and killing.\n\n                                              KINGDOM 8/18/06   101.\n\n\n\n      Al-Ghazi moves through the crowd. A small middle aged SAUDI\n      spots Al-Ghazi. They exchange words. Al-Ghazi waves Fleury to\n      follow.\n\n      Fleury does and follows Al-Ghazi through the computer room,\n      into a back office.\n\n\n105   INT. INTERNET CAFE - BACK OFFICE - CONTINUOUS               105\n\n      A middle aged Saudi: TALAL. He sits behind a cluttered desk.\n      Art books and computers everywhere. He gets up and embraces\n      Al-Ghazi.\n\n      Al-Ghazi then turns to face Fleury.\n\n                          COLONEL AL-GHAZI                              \n                At one time, Talal was Arafat's\n                senior bomb-maker and planner in\n                the occupied territories. He joined\n                Bin-Laden when Al Qaeda brought the\n                fight to the Royal Family.\n\n                           RONALD FLEURY\n                    (beat)\n                OK. Shouldn't we arrest him or\n                shoot him or something?\n\n      Small smile from Al-Ghazi.\n\n                          COLONEL AL-GHAZI                              \n                He turned himself in last year\n                during an amnesty. He's now part of\n                a new government effort to balance\n                the experience of Saudi Youth.\n\n                          RONALD FLEURY\n                This place is community service?\n\n                          COLONEL AL-GHAZI                              \n                If America figures out a way of\n                keeping their kids off the\n                computers please let us know.\n\n                          RONALD FLEURY\n                Why did he turn himself in?\n\n      Before Al-Ghazi can answer, Talal begins talking to him in\n      Arabic. Al-Ghazi translates:\n\n                          COLONEL AL-GHAZI                              \n                `You only come after I see there\n                were bombs.\n                          (MORE)\n\n                                      KINGDOM 8/18/06   102.\n\n                    COLONEL AL-GHAZI (CONT'D)\n          Did you know Bin Laden put 5\n          million-dollars on my head? Why\n          shouldn't it be 10?'\n\nSubdued laughter. Then Talal becomes quiet, grave. Al-Ghazi\ncontinues the translation:\n\n                    COLONEL AL-GHAZI (CONT'D)                   \n          The Man who made War on Al-Rahmah\n          is someone my age -- this kind of\n          skill is learned over decades.\n\nTalal looks at Fleury now, speaking directly to him through\nAl-Ghazi:\n\n                    COLONEL AL-GHAZI (O.C.) (CONT'D)            \n          A Man who can plan the mass-murder\n          of women and children, then go home\n          at night to his own and sleep\n          soundly...? That kind of Man is\n          supremely difficult to catch.\n\n                    RONALD FLEURY\n              (through Al-Ghazi)\n          How does he know he slept soundly?\n\nColonel Al-Ghazi hesitates, then relays Fleury's question.      \nTalal stares: eyes touched by war-blood-atrocities committed.\nSomeone who believes he's going to Hell.\n\n                    COLONEL AL-GHAZI (O.C.)                     \n              (translating)\n          Because he hasn't stopped. You stop\n          when their faces don't let you\n          close your eyes...\n\n                    RONALD FLEURY\n              (through Al-Ghazi)\n          Is that why you quit?\n\n                    COLONEL AL-GHAZI (O.C.)                     \n              (translating)\n          17 days without sleep will make you\n          quit anything.\n\nTwo TEENAGERS stick their heads into the office. They're mad\nabout the sharing of a computer. Talal puts a fast stop to\nit. It's obvious he's good with these young boys. He smiles\nas he speaks to Al-Ghazi.\n\nAl-Ghazi translates to Fleury.\n\n                                        KINGDOM 8/18/06   103.\n\n\n\n                    COLONEL AL-GHAZI (CONT'D)                    \n          He says he makes my job easier.\n          Here, at least they only fight and\n          kill on computers.\n\nAl-Ghazi shows Talal the detonator. The old man studies it.      \nAl-Ghazi and Talal speak in Arabic about the detonator.          \n\nAl-Ghazi looks to Fleury, translates.                            \n\n                    COLONEL AL-GHAZI (CONT'D)                    \n          He says that there are several ways                    \n          to get American military equipment                     \n          like this detonator but not many                       \n          men in Saudi Arabia that know how                      \n          to get them.                                           \n\n                    FLEURY                                       \n          How do they get them?                                  \n\n                     COLONEL AL-GHAZI                            \n          Usually smuggled from Iraq by                          \n          corrupt soldiers working with the                      \n          Americans.                                             \n\n                    FLEURY                                       \n          Could Hamza get this equipment?                        \n\nAl-Ghazi asks Talal.                                             \n\n                    COLONEL AL-GHAZI                             \n          Without question. Yes, he could.                       \n\n                    RONALD FLEURY                                \n              (through Al-Ghazi)\n          How do we find him?\n\nHe thinks for a moment, then speaks. The boys chuckle as Al-\nGhazi continues translating:\n\n                    COLONEL AL-GHAZI                             \n          Prayer. Luck. Handshakes.\n\nFleury looks at Al-Ghazi, doesn't quite get it...\n\n                    RONALD FLEURY\n              (to Al-Ghazi)\n          Well, I think I get the `prayer'\n          and `luck' parts...\n\nTalal slowly stands, Al-Ghazi helping him up, moves to\nFleury. Reaches his hand out to him, quietly:\n\n                                              KINGDOM 8/18/06   104.\n\n\n\n                          COLONEL AL-GHAZI (O.C.)                       \n                    (translating)\n                His hands will feel like this.\n\n      Fleury shakes Talal's hand, turns it over: index finger gone.\n\n                          COLONEL AL-GHAZI (O.C.) (CONT'D)              \n                    (translating)\n                Every Amir at some point gets\n                bitten by his work.\n\n\n106   EXT. BLAST SITE - DAY                                       106\n\n      The Bobcat digs   into the crater, over the unknown hole.\n      Already a large   pile of dirt. Another sizeable scoop down\n      about two feet:   nothing. Haytham now stands over the crater\n      watching Sykes.   Leavitt has joined him.\n\n                           GRANT SYKES\n                Whatever this is, it blasted-off\n                like NASA.\n\n      Haytham yells to the Machine Operator in Arabic:\n\n                          SERGEANT HAYTHAM\n                Driven in at an angle... go\n                deeper...\n\n      Another gouge of earth: 4 feet. Nothing. Grant sits back.\n\n                          GRANT SYKES\n                `High-order explosion' doesn't do\n                it justice: what's left a' this\n                looks like it was put through a\n                wood-chipper.\n\n      Leavitt rubs his eyes: adrenaline long gone. Looks at his\n      watch: time passing fast. Sykes drops to his stomach, reaches\n      in with the TRENCHING TOOL to see how much farther the hole\n      goes: a metallic `clink.\n\n      An oxygen tank. The kind used in ambulances. Nozzle assembly\n      gone, burst in the explosion with a force that drove it\n      several feet into solid ground. Haytham takes a razor blade,\n      scratches off samples of the soil and carbon for explosive\n      residue into a fresh cannister. Then takes a wet rag, begins\n      cleaning the tank to reveal Arabic script...\n\n                          SERGEANT HAYTHAM\n                    (to Sykes)\n                Hospital Identification...\n                Ambulance identification.\n\n                                             KINGDOM 8/18/06   105.\n\n\n\n                          GRANT SYKES\n                Do you know this hospital?\n\n                          SERGEANT HAYTHAM\n                Yes.\n\n                          GRANT SYKES\n                Call it in.\n\n\n107   INT. AL-RAHMAH COMMUNITY CENTER                            107\n\n      Now a mini command post. Al-Ghazi works phones with Fleury\n      and Mayes by his side. Sykes and Leavitt muddy, sitting on\n      their cots. Leavitt tags evidence from the shootout.\n\n      Al-Ghazi hangs up, looks to Fleury.\n\n                          COLONEL AL-GHAZI                             \n                The ambulance was reported stolen\n                from King Fahd Hospital last\n                Wednesday, three days before the\n                bombing.\n\n                          RONALD FLEURY\n                OK.\n\n                          COLONEL AL-GHAZI                             \n                There's more: I told you it\n                wouldn't be hard to find the\n                soldiers.\n\n                          RONALD FLEURY\n                    (focused; to Al-Ghazi)\n                What you got?\n\n                          COLONEL AL-GHAZI                             \n                The stolen ambulance had a twenty\n                man crew that rotated shifts on it.\n                We checked all twenty men. One of\n                them, Muaath Hazmi is now of\n                interest to us.\n\n                          RONALD FLEURY\n                Why?\n\n      Al-Ghazi reaches for the photo of the dead shooter/attacker.\n\n                          COLONEL AL-GHAZI                             \n                Because this gentleman is Fathi\n                Hazmi, Muaath's brother.\n\n                                             KINGDOM 8/18/06   106.\n\n\n\n                          RONALD FLEURY\n                Where's Muaath?\n\n                          COLONEL AL-GHAZI                             \n                I'm going to show you.\n\n\n108   EXT. SUBURBAN RIYADH STREET - AFTERNOON                    108\n\n      A five block radius has been sealed off by Police Vehicles.\n      Fleury and his team are at the outer perimeter, crouched\n      behind barricades at the entrance of a cul-de-sac. They're\n      not allowed anywhere near the line of fire.\n\n      They sport bullet-proof vests and helmets: look like\n      reporters in a war-zone. Police turn away cars, neighbors.\n      Snipers stand posted on near-by rooftops. Helicopters audible\n      overhead. Street deserted.\n\n                          GRANT SYKES\n                We never get to do anything fun.\n\n                          JANET MAYES\n                Sykes, I'm guessing you don't even\n                remember how to load your gun.\n\n                          GRANT SYKES\n                That's not funny.\n\n                          ADAM LEAVITT\n                She's not trying to be funny.\n\n                          GRANT SYKES\n                I'm a very good shot.\n\n                            JANET MAYES\n                I'm sure.\n\n      Haytham hands Al-Ghazi a walkie-talkie, in Arabic:\n\n                          COLONEL AL-GHAZI                             \n                Neighbors clear?\n\n                            VOICE (O.S.)\n                Yes.\n\n                          COLONEL AL-GHAZI                             \n                Activity or communication?\n\n                          VOICE (O.S.)\n                Snipers have seen nothing. No\n                telephone line into the house.\n\n                                              KINGDOM 8/18/06   107.\n\n\n\n                           COLONEL AL-GHAZI                             \n                    (beat)\n                Allahuakbar. Go.\n\n      Two black Suburbans roll around the corner: out-fitted with\n      running boards and hand rails upon which a 12-man SWAT team\n      rides: 3 on each rail, 2 vehicles. SWAT team: military\n      fatigues, black hoods, Mp-5 close-quarter sub-machine guns.\n      Flying down the cul-de-sac: Half-way down the street, one of\n      the Snipers open fire: BOOM-BOOM-BOOM. That moment an RPG\n      fires wide of the lead Suburban. Over Al-Ghazi's walkie-\n      talkie, in Arabic:\n\n                          VOICE (O.S.)\n                ONE DOWN! RPG!\n\n      The two SWAT-Teamers at the front of the running boards open\n      up with their MP-5s one-handed: the front of the house puffs,\n      bursts, disintegrates. Suburbans rip to a stop. SWAT off,\n      move fast. Three toss flash grenades into and around the\n      house. Massive flash-bangs. Six through the front door. Six\n      sprinting around back. Loud AK-47 bursts from inside\n      now...screams. Then an RPG fired inside: the rushing sound\n      and yellow-white flash past two windows. A section of the far\n      left wall of the house detonates from the inside out.\n\n      More mechanical, silenced thwacks from the SWAT Mp-5s.\n      Silence. Then voices from Al-Ghazi's walkie-talkie.\n      Ambulances round the corner, fly toward the house:\n\n                          VOICE (O.S.) (CONT'D)\n                CLEAR.\n\n\n109   INT. TARGETED HOUSE - MOMENTS LATER                         109\n\n      The team enters, wide-eyed. Four men in civilian garb, all\n      dead: multiple bullet wounds. An Officer with four 8 X 10 mug-\n      shots, matching them to the dead faces, dropping mug-shots on\n      respective chests. Once he's finished, a police photographer\n      takes new pictures of each. At the far side of the House:\n      engineers use 2x4s to support the wall hit with the RPG. All\n      of it has the feel of standard Saudi operation procedure.\n\n      Al-Ghazi appears from the back of the house. Bends over each\n      of the four dead men: lifting each of their hands, examining\n      the backs of the hands quickly.\n\n                          GRANT SYKES\n                Prints are on the other side...\n\n                                             KINGDOM 8/18/06   108.\n\n\n\n                          COLONEL AL-GHAZI                             \n                I'm not looking for prints. I'm\n                looking for fingers.\n\n      Stands after the last: a look of controlled frustration that\n      Fleury files. Then Al-Ghazi motions to Sykes and Fleury.\n\n\n110   INT. REAR OF THE HOUSE - NEXT MOMENT                       110\n\n      Back to the rear of the house: stacks of plastic explosives,\n      buckets of shrapnel, two Paramedics working feverishly on a\n      SWAT Officer hit multiple times. Fleury goes about his\n      business like a man isn't dying six feet away.\n\n      Sykes is a kid in a candy store: rummaging through\n      explosives, blasting caps, shrapnel.\n\n                             RONALD FLEURY\n                JANET...\n\n      Janet makes her way back. Immediately moves to the wounded\n      SWAT Officer.\n\n                          RONALD FLEURY (CONT'D)\n                He's gone... This shrapnel look\n                like the stuff you pulled at the\n                morgue?\n\n                          JANET MAYES\n                    (distracted)\n                Yeah... I pulled so much it's hard\n                to remember it all.\n\n                             RONALD FLEURY\n                Bolts?\n\n                             JANET MAYES\n                Yes.\n\n                             RONALD FLEURY\n                Wing nuts?\n\n                             JANET MAYES\n                Yeah.\n\n                          RONALD FLEURY\n                Razor blades?\n\n                             JANET MAYES\n                Sure.\n\n                                      KINGDOM 8/18/06   109.\n\n\n\nAl-Ghazi begins tossing the room, motions to Fleury: help.\nFleury moves to him.\n\n                    RONALD FLEURY\n              (calling back)\n          ADAM...\n\n                    GRANT SYKES\n          C-4...\n\nAl-Ghazi dumps desk drawers: pictures of government-looking\nbuildings, walled-compounds. Lays them out in rows, studying\neach. Leavitt appears, focuses on the C-4 immediately.\n\n                    COLONEL AL-GHAZI (O.C.)                    \n          -the front gates of every other\n          western housing compound in Riyadh.\n\nEverybody looks at the Colonel, pointing at the pictures:      \n\n                    COLONEL AL-GHAZI (CONT'D)                  \n          And Embassies: Italy, Japan, Korea,\n          Norway, England...\n\n                     ADAM LEAVITT\n              (beat)\n          The Coalition...\n\nLeavitt steps, scans the pictures, picks up two in\nparticular: buildings with scaffolding and heavy equipment.\n\n                    ADAM LEAVITT (CONT'D)\n          These are all countries with Troops\n          in Iraq -- Japanese and Italian\n          embassies are under construction?\n\n                    COLONEL AL-GHAZI                           \n          The entire Diplomatic Quarter is\n          being retro-fitted to sustain\n          bigger bomb blasts.\n\nJanet pops her head in:\n\n                    JANET MAYES\n          -the Prince's Convoy just showed.\n\nAl-Ghazi's face: fear.\n\n                    RONALD FLEURY\n          This is bullshit. You know it.\n          Meaningless. There's no leader\n          here. These are kids. That's it.\n\n                                                KINGDOM 8/18/06   110.\n\n\n\n      Al-Ghazi says nothing.\n\n                          JANET MAYES\n                We're out of here.\n\n                          RONALD FLEURY\n                Yes, that's it. Smile for the\n                cameras, body-bag some children.\n                Wrap it up, but us -- out. I get\n                it.\n\n                             COLONEL AL-GHAZI                             \n                I'm sorry.\n\n\n111   EXT. FRONT OF TARGETED HOME - MOMENTS LATER                   111\n\n      Prince Bin Khaled touring the scene: reporters,\n      photographers, his personal top-line security detail: the\n      business suits and boots, the special ops M-4s. All on edge\n      to be in a Saudi neighborhood. Rahman, looking like he needs\n      sleep and vitamins. Lecturing in Arabic:\n\n                          PRINCE BIN KHALED\n                Only in death will our enemies\n                realize Allah never permits\n                defiance of his almighty will.\n\n      Damon Schmidt trailing behind the Prince's detail. The Prince\n      locks Al-Ghazi with a mad-dog stare in-between lesson points.\n      One of the Prince's inner-circle heads straight for Al-Ghazi,\n      in Arabic:\n\n                          INNER-CIRCLE\n                Take the Americans inside now and\n                keep them out of sight. You will be\n                spoken to about their presence\n                here.\n\n\n112   INT. TARGETED HOUSE - NEXT MOMENT                             112\n\n      The Team sitting on the floor, below the window sills, away\n      from the holes and doors. Al-Ghazi standing, looking out the\n      window at the spectacle. Damon Schmidt steps in: sees dead\n      bodies and goes ghost, almost collapses. Leavitt pops up,\n      helps him sit.\n\n                          RONALD FLEURY\n                You need water?\n\n      A quick `no' nod: like the second before you lose lunch.\n\n                                         KINGDOM 8/18/06   111.\n\n\n\n                    ADAM LEAVITT\n          You really ought not look at this.\n\n                    DAMON SCHMIDT\n              (pointing at the dead)\n          That fella got shot right through\n          his God damn nipple...\n\n                    JANET MAYES\n          Don't stare too long. It'll start\n          living in your dreams.\n\nJanet's voice causes Schmidt to immediately force composure.\n\n                    DAMON SCHMIDT\n          No -- I know.\n\n                     RONALD FLEURY\n          You do?\n              (beat)\n          How did you know we were here?\n\n                    DAMON SCHMIDT\n          The Prince has Men at Al-Rahmah.\n\n                      COLONEL AL-GHAZI                            \n          What Men?\n\n                     DAMON SCHMIDT\n          Ask him.\n              (beat)\n          3 vehicles will stay behind when\n          the Prince and Press leave. You'll\n          convoy straight to BA flights into\n          Dulles -- last minute fares come\n          out of your budget, by-the-by.\n          Tried to swing upgrades, but check\n          at the counter.\n\nPissed, reproachful head-shakes.\n\n                    DAMON SCHMIDT (CONT'D)\n              (beat; color returning)\n          Turn those frowns upside down,\n          people. This will be pitched as a\n          stunning Saudi-only counter-punch\n          that killed those responsible for\n          Al-Rahmah. Al-Jazeera will play up\n          an FBI presence, we'll play up\n          their ties to Terror as checkmate.\n          And everyone that was so\n          righteously pissed back home is\n          gonna eat crow.\n                    (MORE)\n\n                                      KINGDOM 8/18/06   112.\n\n                    DAMON SCHMIDT (CONT'D)\n          Already a rumor that the guy who\n          wrote our State Department memo-\n\n                    RONALD FLEURY\n          -Ellis Leach?\n\n                    DAMON SCHMIDT\n          You know him? He's gonna be put out\n          to pasture: made an example of by\n          the President to ensure all levels\n          of government get tough on Terror.\n              (right at Fleury)\n          You won the hand on the River card.\n\n                    RONALD FLEURY\n          We didn't win shit, Schmidt. These\n          are teenagers... children with\n          pictures that someone far senior\n          has provided them.\n\n                     DAMON SCHMIDT\n          -kidding me? You mean those are\n          Terrorist targets? Holy Wow.\n          Momma, don't let your children grow\n          up to be cowboys.\n              (beat)\n          Just get ready to go home and revel\n          in the fact that for the next few\n          weeks your shit won't stink.\n\nThe phone rings that instant. Leavitt hands it up to Fleury.\nSchmidt holds his hand up to Janet: high-five -- she gives it\nup slowly, warily, semi-charmed:\n\n                    DAMON SCHMIDT (CONT'D)\n              (to Janet)\n          Double or nothing that's a\n          congratulatory call.\n\n                     RONALD FLEURY\n          Hello?\n              (beat)\n          Yes, Sir. We're all here and\n          healthy. I'm sitting next to their\n          corpses but this may not be over.\n          These don't feel like anything\n          resembling senior leadership-\n              (beat)\n          -thank you Sir. I do.\n                     (MORE)\n\n                                              KINGDOM 8/18/06   113.\n\n                          RONALD FLEURY (CONT'D)\n                Please do me one favor before we\n                board: warn every `Coalition-of-the-\n                Willing' or whatever the hell we're\n                calling our Iraq allies now, that\n                pictures of their Riyadh embassies\n                were found in this Cell's safe-\n                house.\n\n\n113   INT. SUBURBAN - LATER                                       113\n\n      Flying down a highway. Haytham driving. Sykes up front. The\n      rest of the team crammed in back: Fleury next to Al-Ghazi;\n      Mayes and Leavitt on the back bench. Everyone spent. Grant\n      stares up at a distant jet climbing-out. The police radio\n      belching calm codes and calls every few seconds.\n\n                          RONALD FLEURY\n                    (to Al-Gahzi)\n                What do you think?\n\n      Al-Ghazi looks up at Fleury, slowly shakes his head.\n\n                          AL-GHAZI\n                Amateurs. It's a small win.\n\n                            RONALD FLEURY\n                Yeah.\n\n      A beat.\n\n                          RONALD FLEURY (CONT'D)\n                I'm thinking about New York -\n                February 26, 1993. The first time\n                they tried to hit the Trade Towers.\n\n                          GRANT SYKES\n                I'm thinking about going straight\n                to Dan's, gonna order six PBRs-\n\n                            JANET MAYES\n                -Pabst?\n\n                          ADAM LEAVITT\n                Keep it real. You ever drink PBR,\n                Haytham?\n\n                            HAYTHAM\n                No.\n\n                            GRANT SYKES\n                Any beer?\n\n                                       KINGDOM 8/18/06   114.\n\n\n\n                      HAYTHAM\n                (small smile)\n          No.\n\n                    GRANT SYKES\n          Now...that's just unreasonable.\n          Good Police work and problem\n          drinking are like a chicken and egg\n          thing: which enables the other?\n\nIn the back, Al-Ghazi can't help a small smile either.\nFleury's not into it. All business, pissed, clearly does not\nwant Pabst.\n\n                    RONALD FLEURY\n              (to Al-Ghazi)\n          Remember how we caught that cell?\n\n                    AL-GHAZI\n          Yes. Car bomb. He went back to pick\n          up his deposit on the rental car.\n\n                    RONALD FLEURY\n          Four hundred dollars. For four\n          hundred dollars, he was caught.\n          Stupidity. Catching the cell was\n          easy. Just like this. The cell came\n          back.\n\nFleury looks at Al-Ghazi. He knows the win is small. Also\nknows that's all she wrote, for now.\n\n                    RONALD FLEURY (CONT'D)\n          I'll be back.\n\n                    COLONEL AL-GHAZI                            \n          Yes, you will.\n\nThe POLICE BAND suddenly squelches loud with excited Arabic.\nEveryone perks, leans up to listen to the urgency.\n\n                    COLONEL AL-GHAZI (CONT'D)                   \n              (translating radio\n               chatter)\n          Religious demonstration in\n          progress. Back near the City\n          Center.\n\nA small collective smirk, sigh of relief. Fleury turns in his\nseat.\n\n                                            KINGDOM 8/18/06    115.\n\n\n\n                          GRANT SYKES\n                I'm serious. Beer will open up your\n                subconscious. Canned beer\n                especially. Give you instincts they\n                can't teach-\n\n      Fleury notices the Suburban bringing up the rear has dropped\n      back.\n\n                          RONALD FLEURY\n                    (looking back)\n                Is he responding to the call?\n                Dropped back...\n\n                          COLONEL AL-GHAZI (O.C.)                      \n                    (turning)\n                What?\n\n      Al-Ghazi and Fleury both looking back to the following\n      Suburban now. Dropped back, sunglasses and blank faces\n      staring back at them.\n\n      Fleury looks to the overpass above - he sees a YOUNG MAN on a\n      cell phone. As they pass, the kid runs to watch them from the\n      other side.\n\n      Al-Ghazi gets to the CB radio, in Arabic:\n\n                          COLONEL AL-GHAZI (CONT'D)                    \n                Tighten up-\n\n      -the trailing Suburban doesn't `tighten up.' It falls further\n      back. Fleury instinctively turns, wide-eyed -- out the\n      window: a small brown truck swerves out of the opposing\n      lanes, flying across the desert median, aimed at the Convoy.\n      Without hesitation Fleury reaches over Haytham, rips the\n      steering-wheel right, nosing away from the approach...\n\n\n114   114 THRU 116 OMITTED                                       114\n\n\n117   EXT. SAUDI HIGHWAY - SAME MOMENT                           117\n\n      Our Suburban on two wheels: The lead Suburban turns the same\n      direction a twitch too late. The small brown truck detonates.\n      The lead Suburban takes a massive fraction of the explosion\n      broadside, essentially shielding our vehicle. Flame spits\n      through the lead vehicle as it spins, flips onto its roof.\n\n                                             KINGDOM 8/18/06   116.\n\n\n\n\n118   INT. OUR SUBURBAN - NEXT MOMENT                             118\n\n      Off-road now, violent impacts on bare rims shedding rubber.\n\n\n119   EXT. HIGHWAY ATTACK AFTERMATH - NEXT MOMENT                 119\n\n      The lead Suburban: tortoise on its back, engulfed, still\n      sliding. Fleury's Suburban fish-tailing.\n\n      The Lead Suburban blows in-half now as the gas tank ruptures.\n      A football-sized shard of metal explodes through our\n      windshield-\n\n\n120   INT. OUR SUBURBAN - SAME MOMENT                             120\n\n      - and smashes straight out the back, taking the rear cargo\n      door with it.\n\n      The shock of it causes Haytham to lose control in earnest\n      now. The Suburban flips, barrel rolls. Violent pounding\n      inside the vehicle. Motion stops: upside down, just the roar\n      of the big Detroit V-8 red-lining, wheels spinning in air.\n      Everyone dazed, border-line unconscious. Fleury's bell rung\n      the worst, trying to function, get his bearings.\n\n      Fleury touches Leavitt's face, can barely see through the\n      gathering smoke that smells like oil.\n\n                             RONALD FLEURY\n                You whole?\n\n                             ADAM LEAVITT\n                Think so-\n\n      Leavitt unbuckles his seat belt and smashes head first into\n      the ceiling -- running FOOTFALLS approach, quick yell-yips in\n      Arabic: commands?\n\n      The Driver and three other Police Officers from the trailing\n      Suburban. Smoke fills the interior now: thank God these\n      Police Officers have ripped open a door: saviors. They grip\n      Leavitt by his hair because it's the only thing they can\n      grab.\n\n      Alarmed, Al-Ghazi begins to scramble for Leavitt.\n\n                          COLONEL AL-GHAZI                              \n                This is not right!\n\n                                              KINGDOM 8/18/06   117.\n\n\n\n      Haytham gets a good look at the driver, recognizes him as the\n      officer who shamed him at the compound on day one. Haytham\n      moves to unbuckle.\n\n      Fleury's trying to claw towards Leavitt. Throwing upside down\n      punches at the air. Unbuckles himself now.\n\n                            RONALD FLEURY\n                WHAT THE-\n\n                          JANET MAYES\n                    (panicked)\n                ADAM! WHAT -- WHAT ARE THEY DOING?\n\n      Alarm rising, everyone else unbuckles and smashes into the\n      ceiling as horizons go flip-flop confusion.\n\n\n121   EXT. HIGHWAY ATTACK AFTERMATH - NEXT MOMENT                 121\n\n      Leavitt's throwing punches as he's dragged with velocity to\n      the trail Suburban, idling. Pistol-whipped viciously,\n      repeatedly until they're able to kick him inside. Another\n      Officer from the trailing vehicle steps up with an AK-47,\n      pulls back the cocking mechanism, ready to spray the dazed\n      occupants of our Suburban-\n\n      -the Officer's ankles and shins detonate. POP-POP-POP-POP\n      from the driver's seat: Haytham. Screams from the would-be\n      shooter at double volume. Haytham keeps firing as the\n      Officer, hit multiple times, falls hard.\n\n      The trailing Suburban hesitates,   slams into our Suburban just\n      as Fleury is getting out of the    wreckage. Everybody else\n      still inside, knocked silly. The   trailing Suburban backs up\n      quick. Fleury instinctively goes   for his holster: empty for\n      days now.\n\n                            RONALD FLEURY\n                GUN!\n\n      Trailing Suburban accelerates away now, as Janet struggles\n      out. Haytham's 9 MM in-hand racked open: empty. Fleury steps\n      away from the now black smoke pouring from the vehicle -- in\n      the passenger seat of the trail Suburban, he sees the Officer\n      that checked passports at Prince Sultan Air Base.\n\n                          GRANT SYKES\n                -DOOR HELP-\n\n      Fleury rips Grant's door open. Trapped smoke billows, clears:\n      Grant's arm closest to the outside of the vehicle dangles at\n      an unnatural angle, bleeding badly.\n\n                                      KINGDOM 8/18/06   118.\n\n\n\n                    GRANT SYKES (CONT'D)\n          Can't release-\n\nFleury begins sawing Grant's seat-belt with a jagged piece of\nmetal.\n\n                    RONALD FLEURY\n          Hands up -- you're gonna fall-\n\nSykes still does, ugly. Fleury and Janet rip him free of the\nSuburban.\n\nHaytham's pulling shotguns, handguns, ammo from the flipped\nvehicle. Haytham pointing ahead, to the fading roster-tail.\nIn Arabic:\n\n                    SERGEANT HAYTHAM\n          They're going to disappear...\n\nDesperate, Fleury looks in the direction of the fleeing\nSuburban: the rooster-tail it leaves getting smaller. Al-\nGhazi nods, swings his head to thesnarled/wrecked highway\ntraffic. PEOPLE hesitantly step toward uniforms they trust on\ninstinct. Haytham dumps the pile of weapons at the Team's\nfeet, re-loads his 9MM. Janet ties a half-assed tourniquet\naround Sykes' reminder of an arm.\n\nAl-Ghazi steps toward the approaching crowd: they see his\nstate, his gun, and turn back: panic starts to infect the\nlarger mass, then the topper-\n\n-AUTOMATIC GUNFIRE from somewhere. Glass-dirt-metal bursts\naround us: this attack is still going.\n\nFleury looks up: just the roof of an old Mercedes on the\nmedian, dirt kicked up behind them, running behind lines of\nstopped-wrecked traffic now. The barrel of a rifle held high\nout the window like a taunt. Accelerating for another opening\nto finish the job.\n\nScared motorists devolve into terrified motorists. Many have\nabandoned their vehicles to sprint into the desert, the rest\ngo smash-'em-up derby-folly: 50 panicked drivers aiming for\nthe same spots. Fleury snatches an M4A1 from the stack\ndropped by Haytham, up to his shoulder, hustling toward the\nnext break in traffic. The Mercedes is approaching at 80 MPH.\n\n                    RONALD FLEURY\n              (back to his crew)\n          GET DOWN!\n\n                                       KINGDOM 8/18/06   119.\n\n\n\nAl-Ghazi starts screaming in Arabic, motioning frantically to\nthe CITIZENS who have turned back, running toward them, in\nArabic:\n\n                    COLONEL AL-GHAZI                            \n          DOWN!\n\nFleury's view blocked by fleeing Saudis: just intermittent\nflashes of the Mercedes braking hard, massive dust cloud\nbehind them, sliding toward the opening Fleury pre-sighted.\nIntermittent wild shots fired from the SUV, vaguely in our\ndirection.\n\nFleury flips a switch on the left side of the rifle, just\nforward of the handle: full-auto. Takes a deep, measured\nSniper's breath, eases the stock snug aimpoint up to his\nright eye, and without hesitation lets loose the entire clip\nperfectly: one heartbeat before the Mercedes hits the gap.\nThe right side of the Mercedes shreds just as it appears.\nFleury's clip gone in a flash, yet more rounds still hit the\nMercedes: Al-Ghazi four feet away, firing his own salvo from\na knee. Something bright red pops against the driver's side\nwindow now, the Mercedes rip-slides to a stop. Commotion\ninside. Wild, half-aimed shots back at us.\n\nThen it starts up again. Al-Ghazi bolts toward the line of\nstopped traffic. Searching for something big, empty, still\nrunning. Fleury right on his heels.\n\n                    COLONEL AL-GHAZI (CONT'D)                   \n          WE MOVE NOW OR WE LOSE HIM.\n\nEarly 90's Land Rover. Desert tough. Driver long-gone,\nexhaust plumes pumping out. Al-Ghazi dives into the Driver's\nseat, Fleury shotgun. Guns it to the rest of the Survivors,\nan eye on the rooster-tail of the Mercedes he and Fleury just\nshredded, heading the same direction as Leavitt's kidnappers.\n\nAl-Ghazi jumps out, ushers Haytham into the Driver's seat. In\nArabic:\n\n                    COLONEL AL-GHAZI (CONT'D)                   \n          You know Suweidi -- you know how to\n          go fast.\n\nFleury helps Sykes into the rear. Janet loads the weapons.\nJump in.\n\nThe Land Rover spits it's own tell-tale plume as it sprints\naway down the median, dodging traffic, in desperate pursuit.\n\nStartling silence comes sudden now as the fight moves\nelsewhere. Receding engines. Petering screams/shouts.\n\n                                            KINGDOM 8/18/06   120.\n\n\n      Hold on the flipped, still burning/still smoking Suburbans.\n      Surreal in the sun/smoke/haze.\n\n\n122   INT. TRAIL SUBURBAN - SAME MOMENT                         122\n\n      Driving as fast-hard as possible. No regard for anyone/thing.\n      Passport Officer up front pulls a cell-phone. A THIRD AND\n      FOURTH in the back still beating and zip-cuffing Leavitt.\n\n\n123   INT. LAND ROVER - NEXT MOMENT                             123\n\n      Janet's sitting with Sykes in the rear, readying weapons and\n      ammo. She hands him twin Berettas - Sykes' double-fisting\n      despite his wound, looking forward to a fight.\n\n                          SYKES\n                Nobody's gonna hurt Leavitt but me.\n\n      Driver's Seat P.O.V.: on the median, 95 MPH, dodging\n      abandoned and escaping cars. High-beams flashed on-off-on-\n      off, constant horn, gaining on the Mercedes' rooster-tail\n      ahead of them.\n\n\n124   INT. TRAIL SUBURBAN - SAME MOMENT                         124\n\n      Powering deep into the Suweidi neighborhood. Skid-stopping\n      and backing into an alley between broken down three story\n      buildings.\n\n\n125   INT. LAND ROVER - SAME MOMENT                             125\n\n      Haytham scanning as he drives: straining to see the plume\n      from the second attacking vehicle way ahead, blending with\n      other fleeing, scared motorists. We watch as the distant\n      plume cuts hard left, at a high rate of speed... then\n      DISAPPEARS.\n\n\n126   INT. UNKNOWN ROOM - SAME MOMENT                           126\n\n      Quiet. The 32 year-old son we met on the rooftop is on his\n      cell phone again, speed-assembling an ancient VHS camera atop\n      a tri-pod.\n\n                          THE SON\n                    (in Arabic, frantic)\n                DO NOT COME HERE!\n\n      Intercut with the Mercedes Driver yelling frantic into his\n      cell phone:\n\n                                             KINGDOM 8/18/06   121.\n\n\n\n                          MERCEDES DRIVER\n                    (Arabic)\n                He's been shot! BE READY.\n\n      Back in the room, A HUGE MAN dressed in paramilitary black,\n      face wrapped in his shumagh, so only the eyes are visible,\n      stands in front of a sheet hung from the ceiling, quietly\n      practicing/reading a speech for an imaginary audience. Lots\n      of gesticulating and head movement.\n\n      The handle of large knife sticks from his waste band.\n\n      Door BURSTS open, bottom hinge rips from the jamb. Leavitt is\n      slammed to the ground. Passport Officer shoves the practicing\n      Speaker out of the way- Turns to the wide-eyed 32 year-old.\n\n                          PASSPORT OFFICER\n                NOW. HURRY.\n\n      Leavitt's face already swollen-black-bleeding, scanning the\n      room with terrified fury in his eyes. He sees the handle of\n      the knife sticking from the Huge Man's waistband. His tears\n      leak all at once.\n\n      The Officer takes the knife, turns to Leavitt: dirty 11-inch\n      blade...\n\n\n127   INT. LAND ROVER - NEXT MOMENT                              127\n\n      Haytham searching for the turn-off: where the rooster-tail\n      they were following cut left, died. At the last minute, he\n      sees tire marks headed down an embankment into a decrepit,\n      decaying apartment block neighborhood. Haytham cuts hard,\n      fish-tails. Sykes' head SMASHES into the rear-side window,\n      starring it.\n\n      They're being lead into Riyadh's most hostile neighborhood.\n\n                          AL-GHAZI\n                We should not be here...\n\n      JANET'S POV: scanning for the trail Suburban and the Mercedes\n      - she can't help but notice the neighborhood. Halfway past an\n      intersection, Fleury yells:\n\n                          RONALD FLEURY\n                BRAKES-REVERSE-TO THE RIGHT...\n\n      Haytham brakes, reverses: the Suburban.\n\n                                            KINGDOM 8/18/06   122.\n\n\n\n\n128   INT. LAND CRUISER / EXT. SUWEIDI - NEXT MOMENT            128\n\n      Without hesitation Haytham pulls across the cramped street,\n      surrounded by the same decaying buildings. Ahead: CIVILIANS\n      huddled behind cars, poking heads out from behind shacks.\n\n      A second passes: these people know where the attackers went.\n      Al-Ghazi locks eyes with a little boy... he quickly-quietly\n      just shakes his head no. In the back, Sykes has fallen on his\n      back. He looks up through the window: sees a shape jet past\n      on the top of the closest building -- three stories up: the\n      little boy was nodding a warning-\n\n      What follows is fast, chaotic, eyes-closed combat:\n\n                          GRANT SYKES\n                -GET OUT OF-\n\n      -big BOOM of close-in shells. As Haytham throws it in reverse\n      and punches, the front of the Rover shreds. The windshield\n      bursts. Engine dies: tachometer and speedometer needles\n      bottom out instantly. Haytham and Al-Ghazi tuck into the\n      dash. Fleury tries to get as close to the backseat floor\n      panels as possible. Janet covers Sykes.\n\n      A Thump-Thump-Thump can be heard on the roof: A GRENADE\n      thrown with too much arm by the guy Sykes spotted bounces off\n      the roof and into the Land Cruiser.\n\n      Frantic, Fleury swats it out.\n\n      The blast releases a massive airburst and bits of shrapnel\n      into the vehicle, starring windows, rocking it: creak of\n      shocks and struts. Fleury lifts up now, grabs the M-4:\n      returns fire indiscriminately through the windows at any and\n      all surrounding rooftops. That provides cover and reminds\n      everyone in the car they're armed. Janet exits with a rifle:\n      firing out the back door, more covering fire. Civilians who\n      were ready to see a massacre scurry now that it's a fight.\n\n\n129   EXT. ROOF TOP - NEXT MOMENT                               129\n\n      A SHOOTER: black-hood, black T-shirt, old-school red-white-\n      black Air Jordans, snub-stock AK, an open, filthy North Face\n      backpack at his feet holding spare clips, God knows what\n      else.\n\n      Shots from below keep him two feet away from the ledge,\n      firing down in random sweeps, head turned like he's lighting\n      a fire-cracker.\n\n                                            KINGDOM 8/18/06   123.\n\n\n      We see things from above, three stories down, a sweep of\n      blindly-fired shells pop the asphalt inches from Fleury's\n      head, soiling his face in black-top debris. But Fleury never\n      stops firing back, his own head slightly turned, flinching on\n      reflex. Air Jordan grabs another grenade just before he\n      disintegrates: Fleury's three-feet away with the riot gun.\n      Another rack and blast to make sure A.J. stays down for\n      eternity.\n\n      Fleury spots and bull-charges a second SHOOTER: Ballistic\n      Chicken, Fleury wins. A sound... Fleury spins, racking the\n      riot gun, aims and FREEZES: 2 six year old BOYS stare from\n      the doorway.\n\n\n130   EXT. SUWEIDI STREET - NEXT MOMENT                           130\n\n      Haytham crouches in front of the Land Cruiser. Rocks thrown\n      now from somewhere: KIDS peeking from behind shacks\n      Palestinian-style. He's pelted in the side of the head.\n\n      Janet and Sykes move to a stopped vehicle and take cover.\n\n      From the rooftop, Fleury yells down to the men on the ground.\n\n                          FLEURY (O.C.)\n                I CAN SEE THE MERCEDES... BLOOD-\n                TRAILS RIGHT UP TO AN APARTMENT IN\n                THE NEXT BUILDING-\n\n\n131   EXT. ROOF TOP - SAME MOMENT                                 131\n\n      Fleury's P.O.V.: an Apartment complex that looks like a\n      roadside motel: exposed stairwells, walkways, entrances. A\n      puddle in front of one of the front doors on the third floor.\n      Then we look right, one street over: civilian FIGURES, some\n      in traditional dress, starting to mass.\n\n                          FLEURY\n                MOB FORMING NEXT BLOCK!\n\n      He drops the riot gun, picks up the AK from the man he just\n      killed, pops a new clip from the backpack, slings the\n      backpack over her shoulders. Starts to hustle down.\n\n\n132   INT. UNKNOWN ROOM - SAME MOMENT                             132\n\n      Gunshots reverberating from outside. Echoes. The 32 year-old,\n      hands shaking with nerves, screwing the camera into the tri-\n      pod: set-up almost complete. The Passport Officer is posted\n      at the door: head poking out, weapon up and ready.\n\n                                            KINGDOM 8/18/06   124.\n\n\n      We can hear Arabic yells down what sounds like a hallway.\n      Passport Officer barks something back.\n\n      The Driver of the Trail Suburban squats, pinning Leavitt's\n      head down with his knee, knife near a long, white expanse of\n      neck. The Huge Man sits on Leavitt's stomach, keeping him in\n      place. Leavitt trying to gasp for breath: eyes-wide panic.\n\n                          DRIVER\n                READY?\n\n      Just as the 32 year-old nods yes, Leavitt explodes with his\n      last bit of effort: kicks just enough to nudge the Camera,\n      trying to knock it over. The 32 year-old gets his hands on it\n      as it falls, almost catches it, slips out, smacks the ground,\n      battery pops off. The Driver and Huge Man both begin\n      hammering Adam.\n\n                          PASSPORT OFFICER (O.C.)\n                    (in Arabic)\n                GOD DAMN HIM!\n\n      32 year-old picks the camera up again, trying to re-attach\n      the battery as Adam fights for his life. Spit and claws and\n      snot and blood rage.\n\n\n133   EXT. CINDER-BLOCK APARTMENTS - NEXT MOMENT                  133\n\n      Running down side stairs, Fleury spots a grenade launcher\n      poking from a door, next-door to the apartment with blood-\n      pool in front.\n\n                          RONALD FLEURY\n                RPG!\n\n      Empties his clip into that vicinity: windows shatter, wood\n      splinters. The grenade launcher recedes. Janet and Al-Ghazi\n      start to run. The launcher fires from its new position...The\n      trail suburban DETONATES. Al-Ghazi and Janet knocked flat on\n      their asses for second and third times: dazed.\n\n      Fleury searching: I know that Fuck with the RPG is reloading,\n      how do I kill him. Drops the bag off his shoulders, pulls a\n      grenade out, fires it as hard as he can: 40 yards on the fly.\n      Bounces just on the third floor landing-\n\n\n134   INT. ENEMY APARTMENT - SAME MOMENT                          134\n\n      -RPG Soldier just locking the new rocket tube in, brings the\n      reticle up to his eye. Grenade blast splits through what's\n      left of the front window.\n\n                                              KINGDOM 8/18/06   125.\n\n\n      Big flinch-tense on his part: rocket fires inside, roars down\n      the hall, hits two feet in-front of the door Passport Officer\n      has been peaking out of.\n\n      Massive, contained detonation.   Passport Officer vanishes. The\n      32 year-old and his camera are   blown through the Driver\n      waiting to saw Leavitt's neck.   Because Leavitt was held so\n      tight to the floor, he escapes   the worst of the blast. Still\n      fucked up.\n\n      Leavitt's P.O.V.: ears roar with the ring, no sounds. 32 year-\n      old and Driver lay in a heap on the floor. Huge Man's on his\n      back, trying to get up. Leavitt breathes, rolls to the Driver\n      and the boy: grabs driver's blade. Hand to hand war as\n      Leavitt gets his payback. He does not stop.\n\n\n135   EXT. CINDER-BLOCK APARTMENTS - SAME MOMENT                  135\n\n      Sykes takes cover between two cars, holding down the rear,\n      firing warning shots and screaming football plays to freak\n      out the LOCALS.\n\n                          SYKES\n                THIRTY EIGHT RAZOR MAD DOG!!!\n\n      He fires above the crowd, as Janet heads into the building.\n      Two LITTLE KIDS slowly approach carrying water, obviously\n      terrified at the sight of the wounded American.\n\n      Sirens and helicopters sound in the distance.\n\n\n136   EXT./INT. CINDER-BLOCK APARTMENTS - NEXT MOMENT.            136\n\n      Base of the stairs: Mayes joins Fleury and a dazed Al-Ghazi &\n      Haytham.\n\n                          COLONEL AL-GHAZI                              \n                A tunnel networks through all these                     \n                places... they use attached                             \n                civilian Apartments, innocent                           \n                families.                                               \n\n                          JANET MAYES                                   \n                I do not like these people.                             \n\n                          RONALD FLEURY                                 \n                We go in the front door. Haytham -                      \n                cover the stairs. Janet - hallway.                      \n                Watch the side doors. Watch your                        \n                backs.                                                  \n\n      Silent nods. Bracing for war...                                   \n\n                                             KINGDOM 8/18/06   125A.\n\n\n\n      They move 3 levels up the stairs into the building, following\n      the blood-trail from the SUV to the Apartment. PEOPLE step\n      out of their doors. Al-Ghazi aiming at them:\n\n                          COLONEL AL-GHAZI                              \n                    (in Arabic)\n                INSIDE!\n\n\n137   INT. / EXT. APARTMENT 303 - NEXT MOMENT                     137   \n\n      The puddle of blood, a trail leading under the door. The\n      front wall/window/entrance of the next apartment down, still\n      smoldering from Fleury's grenade. No sounds, words. Our team:\n      fingers on triggers, weapons to shoulders, sights-aligned.\n      Ten feet back. Shoulders already flexed with tension,\n      expecting a suicidal blast at any moment. Janet grabs another\n      grenade, moves to secure the hallway.                             \n\n                                            KINGDOM 8/18/06   126.\n\n\n\n                                                                      \n\n      Intercut Sykes outside. Haytham on the stairs.                  \n\n                          RONALD FLEURY                               \n                    (beat, to Al-Ghazi)\n                Is Allah on the other side of that\n                door?\n\n      Al-Ghazi raises his prayer beads to Fleury.\n\n                           AL-GHAZI\n                    (beat)\n                I think were about to find out, my                    \n                friend.                                               \n\n      Fleury moves forward: I'm primary through the door. Al-         \n      Ghazi's right with him. Fleury gets three-point-stance low,\n      hits the door like Jim Brown. Scattered gunfire. Fleury opens\n      up in response.\n\n      Fleury never stops forward motion. Stumbling headlong into a\n      kitchenette, hard into a refrigerator and cabinets, firing\n      the whole time. Al-Ghazi blasting anything that looks like a\n      body. Straight mop-up operation.\n\n\n138   INT. CINDER BLOCK APTS - HALLWAY - SAME MOMENT            138\n\n      Securing the hallway, Mayes steps into a charred apartment\n      through doors blown off hinges. She heads in deeper, towards\n      the bedroom. Finds the closet - it tunnels into the\n      apartment below. She peers into the hole--\n\n                          JANET MAYES\n                ADAM?!\n\n                                            KINGDOM 8/18/06   127.\n\n\n\n      -- sees a bloody knife below thrown by an unseen hand. Janet:\n      wide-eyed horror, about to pull back, when she is YANKED into\n      the hole by her hair.\n\n\n139   INT. UNKNOWN ROOM - NEXT MOMENT                           139\n\n      Huge Man ATTACKS Janet. Vicious hand to hand blows. Still\n      tied, Leavitt does what he can, kicking at the attacker.\n      Adrenaline morphs Janet from scared and out-sized to\n      desperate and equally vicious. This is SAVING PRIVATE RYAN\n      shit with Leavitt as the observer. He's no coward - he's\n      doing everything he can.\n\n      Huge Man overtakes Janet, slow-choking her... she's gasping,\n      dying... Janet has a knife out and is shredding the big man's   \n      back right thigh and ass. BOTH SCREAMING. From nowhere,         \n      Fleury ends the fight with a butt-end baseball-swing of the\n      shot gun to Huge Man's head.\n\n      Janet: fucked up, but alive.\n\n                          JANET MAYES\n                    (to Leavitt)\n                Sykes is going to kick your ass.                      \n\n      Al-Ghazi follows Fleury into the room. Leaning to Janet,\n      Fleury sees Leavitt, puts his hand on his head. Leavitt's\n      somewhere else, tears in his eyes, just taking deep, measured\n      breaths.\n\n                          RONALD FLEURY\n                Everybody OK?                                         \n\n      Slow nods from Leavitt and Janet as Fleury cuts Adam's ties.\n\n                          FLEURY\n                There's at least three more of\n                them.\n\n      As Janet's eyes catch on something: a sheet/half-assed\n      backdrop hung from the ceiling has been nearly pulled down -\n      exposing a crude square cut out of the wall - a path into\n      another Apartment.\n\n      Janet points to the hole in the wall. This isn't over: a\n      seven-year old GIRL peers out at her, shaking, tears in her\n      eyes. Janet tries her best Motherly smile.\n\n                          JANET MAYES\n                It's okay Little One.\n\n                                              KINGDOM 8/18/06   128.\n\n\n\n      The little girl backs away. Janet gets up, steers Leavitt\n      outside. Sits him down. Hands him a Glock.\n\n      Fleury and Al-Ghazi step through the hole. Janet follows. A\n      blood trail snakes through Little One's room, out her door,\n      and deeper into another apartment. Little girl long gone into\n      the main part of the Apartment. Then, Arabic SCREAMS, the\n      metal-crashing sound of automatic GUNFIRE.\n\n      Sirens overheard outside now.\n\n\n140   INT. ATTACHED APARTMENT - NEXT MOMENT                       140\n\n      Hustle cautious into the apartment. Haytham stands in the\n      room already: the muzzle of his AK still smoking, held on a\n      man down. The other occupants of the room are a cowering\n      FAMILY: KIDS and a couple of real OLD FOLKS, all terrified. A\n      little boy cries by himself, huddled in a corner. The\n      collateral damage of random violence. Janet quick scans the\n      room. LOCKS EYES on the traumatized little boy, his innocence\n      draining as she watches. Can't take her eyes away.\n\n\n      TIGHT ON HAYTHAM:\n\n      Taking this all in: The violence. The terror of this family,\n      the defiance on the faces of these young souls.\n\n      Al-Ghazi, post-game shakes, a tear running down his cheeks,\n      spattered in blood, stares at Fleury. The man Haytham shot is\n      not dead: ragged gasps. Fleury and Al-Ghazi lock eyes, then\n      take in the tragedy of the room -- kids their children's age,\n      never to be the same. Al-Ghazi to the room, In arabic:\n\n                          COLONEL AL-GHAZI                              \n                Is everyone alright?\n\n      Silent stares from the Saudis. The little girl Janet saw\n      earlier, eyes still on Janet, moves to her brother - he holds\n      her tight, his eyes down. Janet kneels, heart-breaking, holds\n      her hand out: I can help you little one.\n\n      The Little Girl holds a fist out to Janet, tears in her eyes:\n      okay. Janet slowly crouches over to her, the older women's\n      eyes on her, piercing.\n\n                           COLONEL AL-GHAZI (CONT'D)                    \n                    (to the little girl, in\n                     Arabic)\n                It's okay.\n\n                                      KINGDOM 8/18/06   129.\n\n\n\nLittle One trembles. One of the women in the corner calls to\nher in Arabic, sharp. Janet just strokes the back of her\nlittle bloody fist. Her little hand opens, shaking: this is a\ngift for you.\n\nJanet's face ghost white: Little One is trying to give her a\nmarble...\n\nAl-Ghazi steps closer, sees the marble. Processes things.\nImmediately looks over at the huddled mass: THE GRANDFATHER\nstaring right back at him. We now see the old man clearly. Al-\nGhazi shaking, slowly steps to him, hands out...\n\n                    COLONEL AL-GHAZI (CONT'D)                    \n              (in Arabic)\n          Let me help you up, Old Man...\n\nThe old man nods a `no.'\n\n                    COLONEL AL-GHAZI (CONT'D)                    \n              (in Arabic)\n          GIVE ME YOUR HANDS!\n\nAl-Ghazi rips Grandfather up now. The family screams. Al-\nGhazi pulls the old man's hands from under his thobe: missing\nfingers. Bends at the knees to look the Old Man right in his\neyes, lifts his chin with his hand.\n\n                    COLONEL AL-GHAZI (CONT'D)                    \n              (dazed, starting to                                \n               realize)                                          \n          ...Hamza.                                              \n\nThe old man looks up at Al-Ghazi: rage and defiance.             \n\n                    COLONEL AL-GHAZI (CONT'D)                    \n          I got you. Abu Hamza, you are under\n          arrest.\n\nABU HAMZA stares, hatred burning into Al-Ghazi.\n\n                    NASSAR\n          You are a traitor to your\n          country... a traitor to your God.\n\n                    COLONEL AL-GHAZI                             \n          I am no traitor to my God. You are.\n\nAl-Ghazi's chest explodes before we hear the booms: the 15\nyear-old Grandson, firing a cheap, nickel-plated 9MM.\nEverybody drops. The family huddles that much closer to the\nfloor. Al-Ghazi falls back to the floor, pulling Grandfather\nwith him.\n\n                                             KINGDOM 8/18/06   130.\n\n\n      Fleury's standing stock still, out-of-body now: He can only\n      see a teenager built like a river-reed, like his own Son...\n      not a Murderer who just shot his friend. Quiet-sick:\n\n                          RONALD FLEURY\n                ...Don't...\n\n      The 15 year-old steps to the doorway, pulls the trigger\n      again: the cheap 9MM jams. Janet lifts up with her AK, aims\n      it at the boy's chest.\n\n                          RONALD FLEURY (CONT'D)\n                ...drop it, Son...please...\n\n      ...The teenager wiping his tears: so he can see clear enough\n      to clear his jammed weapon. Half young boy, the other half\n      something much more dangerous...Expert movements from his\n      hands, racking back the slide, thumbing the still smoking\n      shell from the ejector, letting the slide go, racking another\n      round into the chamber.\n\n      Then... Fleury finally pulls his trigger.\n\n      Utter Distortion as the old man reaches for the teenager's\n      fallen hand gun. Janet, screaming, raises her gun towards the\n      old man as Al-Ghazi shoots the old man in the chest. Sobbing,\n      the little boy runs to his fallen grandfather. Janet, still\n      screaming, covers the family. The Grandfather whispers\n      something we cannot hear in the Little Boy's ear.                \n\n      TIGHT ON HAYTHAM taking it all in: the bleeding, dying           \n      teenager; his hysterical sister; Hamza choking, clutching for    \n      his grandson. CHAOS, CONFUSION, CONFLICT swirling in             \n      Haytham's eyes.                                                  \n\n      A platoon of SAUDI POLICE slowly enter the room.\n\n      Janet goes to the shot 15 year old, starts trying to stop the\n      bleeding...\n\n      Fleury reaching for the dying Al-Ghazi, cradling him. Tears\n      spill as his eyes move from the dying boy to the old man,\n      back down to Al-Ghazi.\n\n      Fleury grasps Al-Ghazi's hand, as a Saudi man would.\n\n                          RONALD FLEURY (CONT'D)\n                You got him. You got him... You got\n                him.\n\n\n141   EXT. CINDER BLOCK APARTMENTS - LATER                       141\n\n                                             KINGDOM 8/18/06   131.\n\n\n\n\n       WIDE ON THE CRIME SCENE.\n\n       From the air as choppers hover and SOLDIERS swarm.\n\n                                                       SMASH TO:\n\n\n142    INT. CONVOY - SAUDI ARABIA                                142\n\n       One last convoy heading out of town. Fleury, Leavitt, Janet,     \n       and Sykes: battered war scars, million mile stares.              \n\n\n143    EXT. PRINCE SULTAN AIRBASE - LATER                        143    \n\n       Our crew watch from a deserted terminal as a C-130 touches\n       down.\n\n       Haytham enters: came to say good-bye. The team's first smiles    \n       -- collective. Fleury stares at Haytham...thinks about what\n       he's seen the past few days...how he has come to admire this\n       Kid. Haytham smiling, bandaged himself. Halting and awkward,     \n       he shakes Janet's hand.                                          \n\n                            HAYTHAM                                     \n                     (in Arabic)                                        \n                 Thank you.                                             \n\n                           JANET MAYES                                  \n                 Thank you, Lieutenant Haytham.                         \n\n       Haytham says good bye to Leavitt and Sykes. Comes to Fleury.     \n       Hands him a beautiful wooden prayer bead necklace.               \n\n                           HAYTHAM                                      \n                 May peace be with you.                                 \n\n                           FLEURY                                       \n                 May peace be with all of us,   my                      \n                 friend.                                                \n\n       The two men shake hands.                                         \n\n\n143alt OMITTED                                                 143alt   \n\n                                 KINGDOM 8/18/06   132.\n\n\n\n\n144    OMITTED                                       144   \n\n\n145    OMITTED - SEE SCENE 150                       145   \n\n\nA146   OMITTED                                      A146   \n\n\nB146   OMITTED                                      B146   \n\n                                              KINGDOM 8/18/06   133.\n\n\n\n\n146   INT. WASHINGTON FIELD OFFICE - CUBICLE - DAY                146   \n\n      Fleury, Sykes, Leavitt and Janet sit around Janet's cubicle.      \n      Bandages, awkward silences, and 1000-yard stares. Subpoenas       \n      stacked on the corner of Janet's desk. Leavitt quiet,             \n      obviously fucked up.\n\n      Grace approaches.                                                 \n\n                           DIRECTOR GRACE                               \n                We're going to testify next                             \n                Tuesday. Fleury's going first. I'm                      \n                gonna go through it with each of                        \n                you one on one in advance - make                        \n                sure we're all on the same page. If                     \n                they ask if we've talked about                          \n                this, the answer is unequivocally                       \n                \"No.\" OK?                                               \n                    (beat)                                              \n                You did outstanding work over                           \n                there. I'm proud of you. You hold                       \n                your heads high.                                        \n\n      SILENCE from the team.                                            \n\n                          DIRECTOR GRACE (CONT'D)                       \n                Ronnie, you ready?                                      \n\n                           RONALD FLEURY                                \n                Yeah.                                                   \n\n      Grace turns to leave. Fleury gets up to follow. They head         \n      down the hallway.                                                 \n\n                          ADAM LEAVITT                                  \n                Janet... my dreams are...                               \n                    (beat, intent)                                      \n                What did he whisper to you?                             \n\n      Confusion from Janet.                                             \n\n                          ADAM LEAVITT (CONT'D)                         \n                In the briefing ... to get you to                       \n                stop crying about Fran... before                        \n                any of this... before we even got                       \n                Airborne? What did he say to you?                       \n\n      Janet looks up:   Leavitt waiting...                              \n\n                                                        FLASH TO:\n\n                                           KINGDOM 8/18/06   133A.\n\n\n\n\n147   EXT. SUWEIDI GRAVEYARD - DAY                              147\n\n      The eight year-old Grandson. Tears in his eyes, standing in\n      front of fresh graves. His AUNT kneels down next to him,        \n      tears flowing, in Arabic:\n\n                          AUNT\n                Will you tell me what Grandfather\n                whispered to you before they took\n                him?\n\n      He turns to his Aunt...\n\n                                                       BACK TO:\n\n                                              KINGDOM 8/18/06   134.\n\n\n\n\n148    INT. WASHINGTON FIELD OFFICE - CONTINUOUS                  148   \n\n       Leavitt still waiting:                                           \n\n                           ADAM LEAVITT                                 \n                 Do you remember?                                       \n\n       Janet looks at Leavitt, PAUSES...                                \n\n                           JANET MAYES (ALT: RONALD FLEURY)             \n                     (reluctantly)                                      \n                 He said... \"We'll kill them all.\"                      \n                 (alts: \"We will win this.\" \"We                         \n                 will end this.\" \"We will finish                        \n                 this.\")                                                \n\n                                                        FLASH TO:\n\n\n149    EXT. SUWEIDI GRAVEYARD - SAME MOMENT                       149\n\n       The boy quietly answers, in Arabic:\n\n                           GRANDSON\n                 \"Don't worry: we'll kill them all.\"                    \n\n       And in his saucer-wide brown eyes, shrink-wrapped in angry\n       tears, we see the parts of the future that will burn.\n\n\n149A   OMITTED                                                   149A   \n\n                                              KINGDOM 8/18/06   135.\n\n\n\n\n150   EXT. WASHINGTON, DC PARK - TIME LAPSE                       150   \n\n      Sunlight shines TIGHT ON Fleury's face: stitches the length\n      of his cheek remain. PULL OUT: Fleury and his son throwing a\n      baseball. Lyla watches, standing by a tree.\n\n                                       KINGDOM 8/18/06   136.\n\n\n\nFather and son throwing the ball back and forth.\n\n                    KEVIN FLEURY\n          You stop the people that hurt Uncle\n          Fran?\n\nFleury stops, just staring at his little son. Tosses back the\nball.\n\n                    KEVIN FLEURY (CONT'D)\n          Did you get the bad guys, Daddy?\n\nFleury catches the ball, stares at his son.\n\nTIGHT ON FLEURY: He reaches and pulls his son close, holding\nhim for what might just be forever... (alt: He hands Kevin Al- \nGhazi's prayer beads.)                                         \n\n                    KEVIN FLEURY (CONT'D)\n          There's a lot of bad people out                       \n          there... aren't there, Daddy?                         \n\n                    RONALD FLEURY                               \n          Yeah, there are...                                    \n              (a beat)                                          \n          But you want to know something?                       \n\n                    KEVIN FLEURY                                \n          What?                                                 \n\n                    RONALD FLEURY                               \n          You're not one of them. (alt:                         \n          There's a lot of good guys, too)                      \n\nKevin smiles up at his dad.   For the first time in a long      \nwhile, Fleury smiles back.                                      \n\n\n\nBLACK.\n\n\n\n\n\nKingdom, The\nWriters :   Matthew Michael Carnahan\nGenres :   Action  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:28:44.053066"}