{"title": "Kramer vs Kramer", "film_link": "/Movie Scripts/Kramer vs Kramer Script.html", "script_link": "/scripts/Kramer-vs-Kramer.html", "info_raw": "\n\nKramer vs Kramer Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.80 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Robert Benton\nGenres  Drama\nScript Date :  1979\n\nRead \"Kramer vs Kramer\" Script\n\n\n", "script": "\n                                   \"KRAMER VS. KRAMER\"\n\n                                            by\n\n                                      Robert Benton\n\n                \n\n               FADE IN:\n\n               INT. OFFICE \u0096 ADVERTISING AGENCY \u0096 MIDTOWN \u0096 EVENING\n\n               WIDE SHOT\n\n               A large and very comfortable office over-looking St. Patrick's \n               Cathedral. At the moment the office is filled to bursting \n               with men and women, slumped in chairs, sitting on desks, all \n               of them very tense. Among the crowd of people we note: MURRAY \n               FISHER, a young and very ambitious junior executive and \n               PHYLLIS BERNARD, an attractive woman in her early thirties. \n               She is a lawyer with the agency.\n\n               At the moment, TED KRAMER, nice-looking without being what \n               you would call a matinee idol, paces back and forth. His tie \n               is loosened, he checks his watch every fifteen seconds. \n               Clearly he is very distraught.\n\n                                     TED\n                              (predicting the worst)\n                         They're not gonna call... I tell you \n                         they're not gonna call. I blew it. I \n                         don't know what I did wrong, but I \u0096\n\n               REVERSE ON JIM O'CONNOR\n\n               Ted's boss and good friend. He is in his middle fifties, \n               nattily dressed with the slightly bleary look of a heavy \n               drinker. He sits back in his chair with his feet propped on \n               the desk and a drink in one hand.\n\n                                     O'CONNOR\n                              (not unfriendly)\n                         Ted, will you take it easy? Revlon's \n                         not about to drop an account that \n                         represents more than two million in \n                         gross billing receipts in a small \n                         agency like this, without making us \n                         sweat. Now just relax, okay? \n                         Everything's gonna be fine.\n\n                                     TED\n                              (at this stage, nothing \n                              will help)\n                         I don't think so, Jim. Maybe I \n                         shouldn't have \u0096\n\n               Sound-effect: The phone rings. Everyone freezes. As O'Connor \n               reaches for the phone,\n\n                                                                    CUT TO:\n\n               INT. CHILD'S ROOM, KRAMER APT. \u0096 EVENING\n\n               The room is dark, the only light coming from a small night \n               light.\n\n               We SEE a beautiful five year old boy (BILLY KRAMER). He lies \n               in bed, half asleep. HOLD FOR A BEAT as a beautiful woman \n               (JOANNA KRAMER) leans over, kisses the child and hugs him \n               tightly to her.\n\n                                     JOANNA\n                              (intense)\n                         I love you, Billy...\n\n                                     BILLY\n                              (drowsy)\n                         I love you too, mommy... Good-night...\n\n               ON JOANNA\n\n               She gets up from the bed and starts toward the door of the \n               child's room.\n\n                                     JOANNA\n                         Sleep tight...\n\n                                     BILLY\n                         Don't let the bedbugs bite...\n\n               Joanna stops in the doorway, silhouetted against the light. \n               She turns, takes a last look at her son, then steps outside.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY \u0096 EVENING\n\n               ON JOANNA\n\n               Now that the light is brighter, we can SEE her more clearly. \n               In her mid-thirties, she is beautiful, dressed in a style \n               that can best be described as Bloomingdale's. HOLD FOR A \n               BEAT as she leans against the door. It is clear from her \n               expression that she is terribly upset. Then, making up her \n               mind, she crosses to a closet and takes out a suitcase.\n\n               THE CAMERA TRACKS WITH HER as she carries it into the bedroom, \n               lays it out on the bed and opens it.\n\n               PAN WITH HER as she crosses to a closet, grabs an armload of \n               clothes and dumps them helter-skelter into the suitcase.\n\n                                                                    CUT TO:\n\n               INT. O'CONNOR'S OFFICE \u0096 EVENING\n\n               It is a few minutes later, the news has obviously been good \n               because there is a general celebration in progress.\n\n               Jim O'Connor, now standing, raises one hand for silence, \n               then making a toast.\n\n                                     O'CONNOR\n                         Here's to Ted Kramer.\n\n               Cheers and good-natured jokes.\n\n                                     O'CONNOR\n                              (putting an arm around \n                              Ted squeezing him \n                              tight)\n                         I wanna tell you something about \n                         this little runt. He went out there \n                         and sold the shit out of Revlon and \n                         that's why we got the account. It \n                         was his idea, it was his concept, \n                         right down the line...\n\n               More hoots and cheers. People start to yell \"Speech.\"\n\n                                     TED\n                              (embarrassed, but \n                              cannot stop grinning)\n                         All I can say... All I can say is \n                         this is maybe one of the five best \n                         days of my whole life...\n\n                                                                    CUT TO:\n\n               INT. BATHROOM \u0096 KRAMER APT. \u0096 EVENING\n\n               Joanna stands at the medicine cabinet, going through it, \n               packing things in a travel kit: rollers, deodorant, makeup, \n               birth control pills. She starts to take a small bottle of \n               perfume that has only an eighth of an inch of fluid left \n               inside, hesitates, then puts it back.\n\n                                                                    CUT TO:\n\n               INT. O'CONNOR'S OFFICE \u0096 EVENING\n\n               Now some time has passed, most of the crowd has gone and \n               only the regulars are left.\n\n                                     TED\n                              (in the middle of a \n                              story)\n                         So anyway Jim and I are making the \n                         pitch, right? And all of a sudden \n                         this old guy starts to cough and I \n                         keep on going and he keeps on coughing \n                         and I keep on going and he keeps on \n                         coughing and \u0096\n\n               Murray Fisher leans over, shakes Ted's hand.\n\n                                     MURRAY\n                              (interrupting)\n                         Congratulations, Ted. That was a \n                         hell of a job.\n\n                                     TED\n                              (surprised)\n                         Where you goin' Murray, it's early?\n\n                                     MURRAY\n                         Got to get home.\n\n                                     TED\n                              (glancing at his watch)\n                         Oh, Christ, I'm late... I gotta get \n                         out of here.\n                              (however, instead of \n                              going, he settles \n                              back and resumes his \n                              story)\n                         So anyway, I look over and this old \n                         geezer is starting to turn blue and \n                         I swear to God the only thing I can \n                         think about is that this poor \n                         sonofabitch is gonna die on me and \n                         screw up the pitch.\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 KRAMER APT. \u0096 EVENING\n\n               INSERT: A long and meticulous list that Joanna is making out \n               of the phone numbers and addresses of doctors and hospitals, \n               of what the various medicines are for, and of the foods that \n               Billy is and isn't permitted to eat.\n\n               WIDER ANGLE\n\n               As Joanna puts the finishing touches on the list and carefully \n               arranges it on top of the kitchen counter next to a box of \n               unsweetened, whole grain cereal and a jar of honey.\n\n               Note: It is this same set of notes that Ted will later \n               unthinkingly throw away.\n\n                                                                    CUT TO:\n\n               EXT. OFFICE BUILDING \u0096 MIDTOWN \u0096 NIGHT\n\n               WIDE SHOT\n\n               As the doors to the outer lobby open and Ted and O'Connor \n               appear.\n\n               Ted starts to hail a cab, O'Connor stops him.\n\n                                     O'CONNOR\n                         Hey, what's the rush? C'mon, walk me \n                         a couple of blocks.\n\n                                     TED\n                         Jim, I've got to go. I'm already \n                         late \u0096\n\n                                     O'CONNOR\n                         Listen, Ted... I just want to tell \n                         you, when old man Schmidt retires \n                         next year, I've got a pretty good \n                         feeling they'll kick me upstairs...\n\n               He turns and starts to walk off down the street, Ted, of \n               course, follows.\n\n                                     O'CONNOR\n                         ...and when they do, I just want you \n                         to know I'm takin' you along with \n                         me.\n\n                                                                    CUT TO:\n\n               INT. BEDROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               CLOSE ON JOANNA\n\n               As she goes through her jewelry case, taking some things, \n               leaving others. In the B.G. we SEE a framed photograph of \n               Billy, smiling, looking into the camera.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 NIGHT\n\n               ON TED AND O'CONNOR\n\n               Tracking with them as they walk.\n\n                                     O'CONNOR\n                              (feeling no pain)\n                         Y'know, Ted, I mean what I said back \n                         there. You did a hell of a job on \n                         this and I want you to know I'm \n                         turning the whole show over to you.\n\n                                     TED\n                              (thrilled)\n                         Wow!\n\n                                     O'CONNOR\n                         I mean it Ted, you're running this \n                         one.\n\n                                                                    CUT TO:\n\n               INT. BEDROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               WIDE SHOT\n\n               The suitcase is now full. Joanna zips it shut and looks around \n               to make sure that she hasn't forgotten anything.\n\n               Then, she hefts her suitcase and starts out of the room.\n\n                                                                    CUT TO:\n\n               INT. FOYER \u0096 NIGHT\n\n               WIDE SHOT\n\n               Joanna carries in the suitcase, sets it by the front door, \n               then she crosses to the living room and sits down at the \n               dining table.\n\n               CLOSER IN ON HER\n\n               She takes out a list made on the back of an old envelope. As \n               she begins to review it, checking off some items:\n\n               OFF SCREEN Sound: A key turning in the lock.\n\n               As Joanna looks up...\n\n                                                                    CUT TO:\n\n               HER POV\n\n               As the door swings open to reveal Ted Kramer, an enormous \n               grin on his face, a bottle of champagne in his hand. He is \n               so full of himself that he doesn't notice there is anything \n               wrong.\n\n               Note: Throughout the entire scene he carries the bottle of \n               champagne, never putting it down.\n\n                                     TED\n                         I thought you might just like to \n                         know that at five-fifteen this \n                         afternoon we were officially handed \n                         the Fire and Ice account by Revlon.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     JOANNA\n                              (she takes a deep \n                              breath, then:)\n                         Ted, I'm leaving you.\n\n                                     TED\n                         That represents a gross billing in \n                         excess of two million \u0096\n                              (hearing her)\n                         What?!\n\n               Joanna opens her purse, takes out her keys and wallet.\n\n                                     JOANNA\n                         Here are my keys. I won't be needing \n                         them any more.\n\n               Note: Ted does not for a moment believe that his wife will \n               really leave him. All he can think of right now is that he \n               will have to spend the rest of the evening coping with one \n               of her moods.\n\n                                     TED\n                              (sardonic)\n                         I'm sorry I'm late, all right? I'm \n                         sorry I didn't call \u0096 I was busy \n                         making a living.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n               Joanna doesn't even bother to look up at him. She opens her \n               purse, takes out her wallet and begins removing credit cards.\n\n                                     JOANNA\n                         My American Express... My \n                         Bloomingdale's Credit Card... My \n                         check book \u0096\n\n                                     TED\n                              (the martyr)\n                         Okay, okay... What is it this time? \n                         What did I do now?...\n\n                                     JOANNA\n                              (ignoring this)\n                         I took two thousand out of the savings \n                         account. That was what I had in the \n                         bank when we got married.\n\n                                     TED\n                         Joanna, whatever it is, believe me, \n                         I'm sorry.\n\n                                     JOANNA\n                         Here are the slips for the laundry \n                         and the cleaning. They'll be ready \n                         on Saturday.\n\n                                     TED\n                              (hard lining it)\n                         Now listen, before you do something \n                         you'll really regret you'd better \n                         stop and think -\n\n                                     JOANNA\n                              (not bothering to \n                              look up)\n                         I've paid the rent, the Con-Ed and \n                         the phone bill, so you don't have to \n                         worry about them.\n\n               She checks off the last item on her list as her husband \n               watches, dumbfounded.\n\n                                     JOANNA\n                         There, that's everything.\n\n               Joanna gets to her feet and starts toward the front door. In \n               an instant Ted is after her.\n\n                                     TED\n                              (panic starting)\n                         For God's sake, Joanna, would you at \n                         least tell me what I did that's so \n                         terrible! Would you do me that little \n                         favor?\n\n               ON JOANNA\n\n               At the door.\n\n                                     JOANNA\n                         Look, it's not your fault, okay? \n                         It's me. It's my fault \u0096 you just \n                         married the wrong person.\n\n                                     TED\n                              (placating her)\n                         So we've got problems. Everybody's \n                         got problems \u0096 that's normal \u0096\n\n               Joanna opens the door and they step out into the hallway.\n\n               INT. HALLWAY OUTSIDE KRAMER APT. \u0096 EVENING\n\n                                     JOANNA\n                         Ted, you're not listening to me. \n                         It's over, finished.\n\n                                     TED\n                         I'm listening, Joanna \u0096 believe me, \n                         I'm listening. My wife is walking \n                         out on me after eight years of \u0096\n\n                                     JOANNA\n                              (bitter)\n                         You just don't get it, do you?\n                              (as though to a child)\n                         I \u0096 am \u0096 really \u0096 and \u0096 truly \u0096 \n                         leaving \u0096 you.\n\n                                     TED\n                         I heard you, Joanna. I promise I \n                         heard you.\n\n                                     JOANNA\n                         No you didn't.\n                              (quietly)\n                         You didn't even ask about Billy.\n\n                                     TED\n                              (stiffening)\n                         What about Billy?\n\n                                     JOANNA\n                         I'm not taking him with me.\n\n                                     TED\n                         What?\n\n                                     JOANNA\n                              (tears start)\n                         Ted, I can't... I tried... I really \n                         tried but... I just can't hack it \n                         anymore...\n\n                                     TED\n                         C'mon, Joanna, you don't mean that. \n                         You're a terrific mother \u0096\n\n                                     JOANNA\n                              (from her gut)\n                         I am not! I'm a terrible mother! I'm \n                         an awful mother. I yell at him all \n                         the time. I have no patience. No... \n                         No. He's better off without me.\n                              (unable to look at \n                              Ted)\n                         Ted, I've got to go... I've got to \n                         go.\n\n                                     TED\n                              (desperate)\n                         Okay, I understand and I promise I \n                         won't try and stop you, but you can't \n                         just go... Look, come inside and \n                         talk... Just for a few minutes.\n\n                                     JOANNA\n                              (pleading)\n                         NO!... Please... Please don't make \n                         me stay... I swear... If you do, \n                         sooner or later... maybe tomorrow, \n                         maybe next week... maybe a year from \n                         now...\n                              (looking directly at \n                              him)\n                         I'll go right out the window.\n\n               Sound-effect: The elevator approaching.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n               There is nothing more that can be done, this is the last \n               moment of intimacy.\n\n                                     TED\n                              (quiet)\n                         Where are you going?\n\n                                     JOANNA\n                         I don't know...\n\n               The elevator door opens, Joanna steps inside.\n\n                                     TED\n                         Do you want me to help you get a \n                         cab?\n\n               Joanna shakes her head. The elevator door closes behind her \n               and it starts to descend.\n\n               ON TED KRAMER\n\n               He stands for a moment, stunned, unable to move. Then he \n               turns and races back into the apartment.\n\n               THE CAMERA TRACKS WITH HIM as he rushes across to one of the \n               living room windows, throws it open and leans out.\n\n               HIS POV\n\n               Looking down to the street from the eighth floor. We SEE \n               Joanna step off the curb and hail a passing taxi.\n\n                                     TED\n                              (calling out)\n                         Joanna!?... Joanna?!\n\n               Either she doesn't hear him or else she pays no attention. \n               She gets into the cab, closes the door behind her and it \n               drives away.\n\n                                                                    CUT TO:\n\n               INT. APT. \u0096 NIGHT\n\n               ON TED\n\n               As he stands for a moment watching the taxi as it disappears.\n\n               Then, slowly, he closes the window, turns, and AS THE CAMERA \n               TRACKS WITH HIM, walks into the bedroom.\n\n               The bedroom is a mess: the closet door stands open, inside \n               Joanna's section is empty except for some shoe-boxes and a \n               few dresses that are scattered across the floor. Several \n               dresser drawers have been pulled out and their contents \n               emptied.\n\n               HOLD IN A WIDE SHOT as Ted wearily picks up one of the dresses \n               and hangs it back on its hanger in its proper place, ready \n               for Joanna's return. As he continues straightening up the \n               room,\n\n               THE CAMERA SLOWLY FADES TO BLACK.\n\n               FADE IN:\n\n               INT. LIVING ROOM \u0096 VERY LATE AT NIGHT\n\n               WIDE SHOT\n\n               Ted Kramer paces back and forth, eyeing the phone. Then, \n               coming to a decision, he crosses to it, picks up the receiver \n               and starts to dial.\n\n                                                                    CUT TO:\n\n               EXT. APT. BLDG. \u0096 LATE AT NIGHT\n\n               WIDE SHOT\n\n               The building is dark except for the Kramer apartment which \n               is ablaze with lights. HOLD as we HEAR:\n\n               Sound: The phone ringing. Then:\n\n                                     WOMAN'S VOICE\n                              (obviously asleep)\n                         Huh... Hello?\n\n                                     TED\n                              (righteous)\n                         All right, Thelma... That's it. I've \n                         had it. You can call your good friend \n                         Joanna Kramer and tell her enough is \n                         enough, okay? I mean, I don't know \n                         what I did, but you can tell her \n                         she's made her point.\n\n                                     WOMAN'S VOICE\n                         Ted, what are you talking about?!\n\n                                     TED\n                         Don't play innocent with me, Thelma. \n                         You know perfectly well what's going \n                         on.\n\n                                     WOMAN'S VOICE\n                              (exasperated)\n                         Ted, I don't understand a word you're \n                         saying. Where's Joanna?\n\n                                     TED\n                         Ha! You tell me.\n\n               Sound-effect, as Ted slams down the receiver.\n\n               Instantly a light is turned on two floors below.\n\n                                                                    CUT TO:\n\n               INT. FOYER \u0096 KRAMER APT. \u0096 NIGHT\n\n               ON THE FRONT DOOR\n\n               As we HEAR:\n\n               Sound-effect: the doorbell rings.\n\n               A moment later Ted opens the door and THELMA PHILLIPS enters. \n               She is a neighbor (Apt. 6-B) and Joanna Kramer's best friend. \n               About four months ago Thelma and her husband Charley were \n               divorced.\n\n               Until then the two families had been very close, the Kramer's \n               son\n\n               (Billy) being about the same age as the Phillips' daughter \n               (Kim).\n\n               With the divorce, however, the Kramers tried to remain friends \n               with both Thelma and Charley and that has caused a certain \n               amount of friction.\n\n               Thelma is an attractive woman in her mid-thirties. She dresses \n               well, works out religiously at Jack LaLanne's and goes to a \n               therapist twice a week. She is also given to acting the lay \n               analyst with her friends. Thelma is generous with her advice, \n               sharing the wealth so to speak. With all of this she is kind, \n               loyal and a loving friend. At the moment, however, she is \n               all business.\n\n                                     THELMA\n                              (looking around, \n                              suspiciously)\n                         All right. What's going on?\n\n               ON TED\n\n               From his attitude it is clear that there is no love lost \n               between them.\n\n                                     TED\n                         All right, Thelma, you want to know \n                         what's going on? I'll tell you what's \n                         going on. I'll tell you exactly what's \n                         going on.\n\n                                     THELMA\n                         Look, Ted, all I \u0096\n\n                                     TED\n                              (starting to really \n                              roll)\n                         I came home tonight. We just got the \n                         Fire and Ice account at the agency. \n                         Do you know what that means?! Do you \n                         understand what that means? It means \n                         that it was maybe one of the five \n                         best days in my whole life.\n\n                                     THELMA\n                         Ted, all I wanted to know was where \n                         \u0096\n\n                                     TED\n                              (not letting her get \n                              a word in edgewise)\n                         I walk in the house and before I can \n                         say \"How are you?\", \"Did you have a \n                         nice day?\" before I can say anything. \n                         Pow she's out the door.\n\n                                     THELMA\n                         OhmyGod. Didn't she say anything? \n                         She must've said something.\n\n                                     TED\n                              (sarcastic)\n                         Yeah, she said it wasn't any use \n                         talking anymore.\n\n                                     THELMA\n                         Ted, don't be so hostile.\n\n               Ted draws himself upright with the dignity of the Ambassador \n               to the Court of St. James. However, during the following, he \n               begins pounding the pillows on the couch into shape with \n               real vehemence.\n\n                                     TED\n                         Hostile?\n                              (pow)\n                         Me?\n                              (whack)\n                         Thelma, I'm not hostile.\n                              (thud)\n                         I am anything but hostile.\n                              (sock)\n                         But if you want to know what I am. \n                         I'll tell you what I am. What I am \n                         is, I am hurt. I am very hurt. And I \n                         just want to know one thing, okay? \n                         Just one thing... Why? That's all I \n                         want to know... Why?\n\n                                     THELMA\n                              (how to say this)\n                         Ted, Joanna and I used to talk a lot \n                         and... well, she told me a lot of... \n                         ah, things about the two of you.\n\n                                     TED\n                              (instantly nervous)\n                         Things? What kind of things?\n\n                                     THELMA\n                              (clearly she knows \n                              more than she's \n                              willing to say)\n                         I mean... things. Ted, Joanna's very \n                         unhappy and \u0096\n\n                                     TED\n                              (flash of anger)\n                         Listen, Joanna Kramer's got a goddamn \n                         good life. She's got a husband that \n                         loves her. She's got a terrific kid. \n                         She's got a wonderful home \u0096\n\n                                     THELMA\n                              (getting mad herself)\n                         What d'you know about how Joanna \n                         felt? You went off to an office every \n                         morning and you'd come dragging home \n                         at seven or eight every night and as \n                         long as dinner was on the table you \n                         thought everything was swell.\n\n                                     TED\n                         Did it ever occur to you guys that \n                         Joanna Kramer's not the easiest person \n                         in the world to live with?! Did it?! \n                         For one thing she's always thirty \n                         minutes late. You can set your watch \n                         by it \u0096\n\n                                     THELMA\n                              (exasperated)\n                         So she's late. What's the big deal. \n                         That's just a way of saying, \"Pay \n                         attention to me.\"\n\n                                     TED\n                              (not listening)\n                         Two. She is getting to be a real \n                         hermit or recluse or whatever it is \n                         you call it. Thelma, do you know \n                         where I could be in this business if \n                         I had a wife that entertained or \n                         went out socially \u0096\n\n                                     THELMA\n                         Oh for shit's sake, Ted, you are the \n                         most selfish human being I have ever \n                         met. No wonder she said you came \n                         first, then Billy, then, if there \n                         was anything left over, she got the \n                         scraps.\n\n                                     TED\n                         Joanna said that?\n\n               Thelma nods.\n\n                                     TED\n                         Then how come she never said anything \n                         like that to me?\n\n                                     THELMA\n                         Maybe she didn't feel like she should \n                         have to. Maybe she felt like if you'd \n                         been paying any real attention to \n                         her to start with, maybe you would've \n                         noticed.\n\n                                     TED\n                              (stung)\n                         Boy, you guys are really something, \n                         y'know? I'd like to know one thing, \n                         okay \u0096 just one little thing. Did \n                         you tell Joanna she should leave me?\n\n                                     THELMA\n                              (stiffly)\n                         No.\n\n               She turns and starts toward the front door, Ted at her heel.\n\n                                     TED\n                         Y'know something Thelma \u0096 you are \n                         the typhoid Mary of divorce. I mean \n                         it. Joanna and I never had any trouble \n                         until you and Charley split up.\n\n                                     THELMA\n                         Ted, divorce is a terrible thing. I \n                         know, I went through it. You've got \n                         to believe I did everything I could \n                         to get Joanna to stay.\n                              (pause)\n                         But I'll tell you something. You may \n                         not want to hear it, but it took a \n                         lot of courage for Joanna to do what \n                         she just did.\n\n                                     TED\n                         I'd like to know what the hell kind \n                         of courage it takes to walk out on \n                         your husband and your child?\n\n               CLOSE ON THELMA\n\n               That stops her dead in her tracks. She had always assumed \n               that Joanna took Billy with her when she left.\n\n                                     THELMA\n                         Joanna left Billy? She didn't take \n                         him with her?\n\n               Ted shakes his head. There is a long beat of silence.\n\n                                     THELMA\n                              (stunned, quiet)\n                         Oh Shit.\n\n                                                                    CUT TO:\n\n               FADE IN:\n\n               EXT. KRAMER APT. BLDG. \u0096 EARLY MORNING\n\n               WIDE SHOT\n\n               It is a beautiful sunny morning and the super stands in front \n               of the building hosing down the sidewalk. HOLD as a garbage \n               truck enters FRAME and the garbage men begin loading sacks \n               of trash into the back of the truck. As it begins to grind \n               up the garbage with an ungodly sound, THE CAMERA PANS UP TO \n               THE EIGHTH FLOOR WINDOWS.\n\n                                                                    CUT TO:\n\n               INT. BILLY KRAMER'S BEDROOM \u0096 EARLY MORNING\n\n               MEDIUM SHOT\n\n               Billy Kramer lies in his bed, fast asleep.\n\n               HOLD FOR A BEAT as we HEAR:\n\n               OFF SCREEN Sound: From the street below, the garbage truck \n               grinding up garbage.\n\n               A moment later, Billy opens his eyes, struggles to his feet \n               and,\n\n               AS THE CAMERA TRACKS WITH HIM, trudges sleepily out of his \n               room, across the hall and into the bathroom.\n\n               INT. BATHROOM \u0096 EARLY MORNING\n\n               As the child stands in front of the toilet, eyes closed, we \n               HEAR:\n\n               OFF SCREEN Sound-effect: as the child pees noisily.\n\n               Then, when he is finished, he turns and, without bothering \n               to flush the toilet, shuffles down the hall and into his \n               parents' bedroom.\n\n               HIS POV\n\n               The bed is empty, there is no sign that anyone has slept in \n               it.\n\n               ON BILLY\n\n               A look of suspicion on his face, he turns and starts back \n               down the hall toward the living room.\n\n               INT. LIVING ROOM \u0096 EARLY MORNING\n\n               As Billy enters, looks around.\n\n               HIS POV\n\n               Ted Kramer, still fully dressed, looking like the wrath of \n               God is asleep in the chair.\n\n               ON BILLY\n\n               As he marches across to his father.\n\n                                     BILLY\n                         Where's mommy?\n\n               ON TED\n\n               His eyes open, he looks around startled.\n\n                                     TED\n                         Huh?... Oh God... What time is it?\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     BILLY\n                              (suspicious)\n                         The little hand is on the six and \n                         the big hand is on the nine. Where \n                         is mommy?\n\n                                     TED\n                              (trying to pull himself \n                              together)\n                         Oh, Christ... Ah, yeah... you want \n                         to know why mom's not here, right?\n\n               Billy nods.\n\n                                     TED\n                              (bullshit)\n                         Okay, I'm going to tell you... It's \n                         like this. Mommy and daddy had a \n                         little argument and mommy decided \n                         she wanted to go off by herself for \n                         a little while. You know how sometimes \n                         you get mad and want to go off and \n                         be by yourself? Well, it's like that, \n                         okay? Okay.\n                              (subject closed)\n                         Now how about some breakfast?\n\n               Ted struggles to his feet and THE CAMERA TRACKS WITH THEM as \n               they start toward the kitchen.\n\n                                     BILLY\n                         When is mommy coming back?\n\n                                     TED\n                              (lying)\n                         Soon. Very soon.\n\n               By now they are inside the kitchen, Ted looks around.\n\n               HIS POV\n\n               There, on the kitchen cabinet is a box of \"natural grain\" \n               cereal, a jar of honey, some wheat germ, and a banana, with \n               carefully written instructions from Joanna underneath.\n\n               ON TED\n\n               He takes one look at the note, crumples it up and tosses it \n               in the wastebasket.\n\n                                     TED\n                              (the camp counselor)\n                         I'll tell you what, kiddo \u0096 why don't \n                         I fix us some French toast?\n\n                                     BILLY\n                              (impressed)\n                         Wow! French toast, really?\n\n                                     TED\n                              (the camp counselor)\n                         Sure. Didn't I ever tell you French \n                         toast was my specialty? I'll bet I \n                         never told you that. Now then, the \n                         first thing we need is...\n                              (trying desperately \n                              to remember)\n                         ...eggs! Right?\n\n               Billy nods. Ted opens the refrigerator and takes some eggs.\n\n                                     TED\n                         This is terrific... isn't this \n                         terrific?\n\n               As Ted begins the process of making French toast, it soon \n               becomes obvious that he has no idea of what he is doing. \n               What follows is a symphony in incompetence on Ted's part. He \n               breaks the eggs into a bowl and ends up with most of the \n               shell mixed up with the egg.\n\n               Then he takes a piece of bread and drops it into bowl.\n\n                                     TED\n                              (saying it will make \n                              it so)\n                         I'm having a good time... Are you \n                         having a good time?\n\n               ON BILLY\n\n               Watching all of this with increasing apprehension.\n\n                                     BILLY\n                         You forgot the milk.\n\n                                     TED\n                              (still the camp \n                              counselor)\n                         That's right. You're absolutely \n                         right... It's been a long time since \n                         I made French toast.\n\n               Ted takes a container of milk, pours it into the bowl so \n               that it is filled to the brim. Then he sloshes the bread \n               around until it is half-dissolved.\n\n                                     TED\n                         Look at this, isn't this something?!\n\n               He lops off a huge hunk of butter, drops it into an omelet \n               pan and turns up the flame.\n\n               ON BILLY\n\n               Watching. He looks as though he is about to throw up.\n\n                                     BILLY\n                         What about my orange juice?\n\n                                     TED\n                              (the counterman)\n                         Right. One O.J. coming up.\n\n               He opens the refrigerator and starts to get the orange juice. \n               As he does, black smoke begins to billow ominously from the \n               frying pan.\n\n                                     BILLY\n                              (scared)\n                         Daddy!!!\n\n               Ted turns, spots the smoke.\n\n                                     TED\n                         Don't worry... Everything's fine...\n\n               He lunges for the handle of the frying pan, which by now is \n               very hot. He grabs it, lets out a howl of pain and the whole \n               mess, frying pan, butter, bread, goes crashing to the floor.\n\n               CLOSE ON TED\n\n               Suddenly all the rage comes pouring out.\n\n                                     TED\n                         Goddam! Son of a bitch!\n\n               REACTION \u0096 BILLY\n\n               Terrified.\n\n               WIDE SHOT\n\n               As Ted kneels down and begins to clean up the mess.\n\n                                     TED\n                              (to himself as much \n                              as to Billy)\n                         It's okay. It's gonna be okay...\n\n               Everything's going to be all right.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON A BUS\n\n               As it pulls to a stop. The doors open and a stream of mothers \n               and children get off. Among them we spot Ted Kramer with \n               Billy. As they start across the street, Ted reaches down and \n               takes hold of Billy's hand. The moment they get to the far \n               side, Billy takes his hand away from Ted's and wipes it on \n               his pants. Clearly Ted's hands are very sweaty.\n\n               CLOSER IN ON THEM\n\n               As they start down the block toward Billy's school.\n\n               CLOSER IN ON THEM\n\n                                     BILLY\n                         When is mommy coming back?\n\n                                     TED\n                         Soon. I told you before, very soon.\n\n                                     BILLY\n                              (nervous)\n                         Will she pick me up after school?\n\n                                     TED\n                         No. If I'm not here, you go home \n                         with Thelma and Kim.\n\n                                     BILLY\n                         What if she forgets?\n\n                                     TED\n                              (weary)\n                         I'll call Thelma and remind her, \n                         okay? Don't worry.\n\n               They walk in silence for a few steps, then:\n\n                                     BILLY\n                         But what happens if she's on her way \n                         to school and she gets runned over \n                         by a truck and killed? What happens \n                         them?\n\n               Ted looks at Billy in amazement.\n\n               WIDE SHOT\n\n               As the two of them enter the school and disappear from view.\n\n                                                                    CUT TO:\n\n               INT. OFFICE, TED'S AGENCY \u0096 DAY\n\n               ON THE ELEVATOR DOORS\n\n               As they open and Ted steps out looking like the wrath of \n               God. THE CAMERA TRACKS WITH HIM as he crosses the waiting \n               room toward the inner offices.\n\n               ON THE RECEPTIONIST\n\n               Glancing up as he passes.\n\n                                     RECEPTIONIST\n                              (cheerful)\n                         Congratulations, Mr. Kramer.\n\n               ON TED\n\n               Looking at her like she has lost her mind. Nevertheless he \n               continues on, passing through swinging doors into a long \n               corridor lined with secretaries' desks and offices leading \n               off of it.\n\n               Suddenly a younger man rushes up, grabs Ted's hand and starts \n               to pump it vigorously.\n\n                                     YOUNG MAN\n                         Terrific news, Ted.\n\n               Another nut. Ted smiles at the man, humoring him and continues \n               toward his office. O'Connor appears, throwing his arm around \n               Ted, squeezing him in a bear hug.\n\n                                     O'CONNOR\n                         Hey... Look who was out celebrating \n                         last night.\n\n               Suddenly Ted realizes that all these people are congratulating \n               him for getting the Fire and Ice account.\n\n                                     TED\n                              (trying to appear \n                              nonchalant)\n                         Uh, Jim... Can I talk to you?\n\n                                                                    CUT TO:\n\n               INT. O'CONNOR'S OFFICE \u0096 DAY\n\n               Ted and O'Connor sitting across from one another. O'Connor \n               has just heard the news.\n\n                                     O'CONNOR\n                         Jesus Christ. That's a real \n                         blockbuster.\n                              (shakes his head)\n                         I always figured you guys had it \n                         made.\n\n                                     TED\n                              (morose)\n                         You want to know the real kicker? \n                         The real kicker is, for the first \n                         time in my life \u0096 the first time \u0096 I \n                         feel like a loser.\n\n               O'Connor nods sympathetically. Actually he is praying that \n               Ted won't start to cry.\n\n                                     O'CONNOR\n                              (stiff upper lip)\n                         Listen, don't let it get you down.\n                              (doesn't believe it \n                              for a second)\n                         You're going to be fine.\n\n                                     TED\n                              (toujour gai)\n                         Me? I've never been better. I mean \n                         having my wife walk out on me after \n                         seven years of marriage agrees with \n                         me just fine.\n\n                                     O'CONNOR\n                         Look, Ted, I'm the oldest whore on \n                         the beat, okay? Three marriages, two \n                         divorces... You're gonna be okay.\n\n                                     TED\n                              (wishful thinking)\n                         I'm going to be okay. The way I see \n                         it, Joanna'll come home, it's just a \n                         matter of time.\n\n                                     O'CONNOR\n                              (emphatically)\n                         She'll be back...\n\n               Ted nods in agreement. There is a beat of silence as both \n               men consider Joanna's imminent return. Then:\n\n                                     O'CONNOR\n                              (trying to be tactful)\n                         But... just in case... I mean, just \n                         on the off chance she doesn't. What \n                         are you going to do about the kid?\n\n                                     TED\n                              (the wind goes out of \n                              him)\n                         I don't know, Jim. This whole thing \n                         has happened so... Pow \u0096 like that.\n\n                                     O'CONNOR\n                              (a friend having to \n                              say something very \n                              difficult)\n                         Look, it's none of my business, so \n                         you can tell me to butt out, okay? \n                         But if you want my advice, you'll \n                         send Billy away to stay with relatives \n                         for a while. Just until you get \n                         yourself straightened out.\n\n                                     TED\n                              (doubtfully)\n                         I don't know, Jim...\n\n                                     O'CONNOR\n                              (the Dutch uncle)\n                         Ted, this may sound a little rough, \n                         but we've just landed the biggest \n                         account in the history of this agency, \n                         right? And now it's up to us \u0096 that's \n                         you and me \u0096 to deliver the goods. \n                         Ted, you're my main man, and if I \n                         can't depend on you a hundred and \n                         ten percent, twenty-four hours a \n                         day, because you're worried about a \n                         kid with a runny nose \u0096\n\n                                     TED\n                         Jim, I appreciate what you're saying. \n                         I mean it, but I really think Joanna's \n                         coming back.\n\n               ON O'CONNOR\n\n               Clearly he doesn't believe this.\n\n                                     O'CONNOR\n                         I hope you're right, Ted... I really \n                         hope you're right.\n\n                                                                    CUT TO:\n\n               INT. FOYER \u0096 KRAMER APT. \u0096 DAY\n\n               INSERT: TIGHT ON AN ENVELOPE\n\n               It is postmarked Denver, Colorado. The letter is addressed \n               to Billy Kramer and it is from Joanna.\n\n               ON TED\n\n               As he rips open the letter.\n\n                                     TED\n                         Billy!\n\n               ON BILLY\n\n               He sits in the living room watching television, a chocolate \n               doughnut in one hand and a remote control device for watching \n               television in the other.\n\n               Off-screen Sound: a Saturday morning kiddie program from the \n               television set.\n\n                                     BILLY\n                              (focused on T.V.)\n                         Uh, huh...\n\n                                     TED\n                         You got a letter from mom.\n\n               Instantly, Billy turns down the volume of the television.\n\n                                     BILLY\n                              (excited)\n                         When is she coming home?!\n\n               ON TED\n\n               As he starts to read, slowly, carefully, so that Billy can \n               absorb it.\n\n                                     TED\n                         \"My dear, sweet Billy: Mommy has \n                         gone away. Sometimes in the world \n                         daddies go away and mommies bring up \n                         their little boys. But sometimes a \n                         mommy can go away too, and you have \n                         your daddy to bring you up.\"\n\n               As Ted continues to read, Billy starts turning up the sound \n               on the television, using the remote control device.\n\n                                     TED\n                              (raising his voice so \n                              he can be heard)\n                         \"I have gone away because I must \n                         find some interesting things to do \n                         for myself in the world. Everybody \n                         has to, and so do I. Being your mommy \n                         was one thing, but there are other \n                         things and this is what I have to \n                         do. I did not get a chance to tell \n                         you this, and that is why I am writing \n                         you now.\"\n\n               By now the volume from the television is so loud that Ted \n               has to shout to make himself heard over it.\n\n                                     TED\n                         \"I will always be your mommy and I \n                         will always love you. I just won't \n                         be your mommy in the house. But I \n                         will be your mommy of the heart. And \n                         I... \"\n                              (he looks up, about \n                              to tell the child to \n                              lower the volume)\n                         Billy.\n\n               HIS POV\n\n               Billy sits, watching television with an almost ferocious \n               intensity on his face, doing his best to block out Ted's \n               voice.\n\n               ON TED\n\n               He watches his son for a second, then carefully refolds the \n               letter, puts it away.\n\n                                     TED\n                              (as he reaches across, \n                              turns down the sound \n                              on the T.V.)\n                         It's okay... It's okay. We'll talk \n                         about it some other time.\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 KRAMER APT. \u0096 LATER THAT DAY\n\n               CLOSE ON THELMA\n\n               Reading Joanna's letter.\n\n                                     THELMA\n                         Oh, God... OhmyGod...\n\n               She finishes the letter, looks up at Ted.\n\n                                     THELMA\n                         What are you going to do?\n\n                                     TED\n                         I don't know, Thel... This whole \n                         thing has happened so... Pow, like \n                         that.\n\n                                     THELMA\n                         I mean, what are you going to do \n                         about Billy?\n\n                                     TED\n                              (stiff)\n                         I'm gonna keep him, why?\n\n                                     THELMA\n                         Look, this is nothing personal, but \n                         I don't think you can do it.\n\n                                     TED\n                         Thelma, I've lost my wife, I'm not \n                         losing my child.\n\n                                     THELMA\n                              (backing off)\n                         All right... Okay... But let's get \n                         something straight, right now. I \n                         mean, I'm sorry about what happened \n                         between you and Joanna, but it's not \n                         my problem, understand?\n\n               REVERSE ON TED\n\n               He nods.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     THELMA\n                         I'm not going to have you calling \n                         every fifteen minutes just because \n                         you can't find a hot water bottle, \n                         understand?\n\n               Ted nods.\n\n                                     THELMA\n                         I've got enough trouble raising my \n                         own kid. I don't need another one. \n                         Got it?\n\n                                     TED\n                         Got it.\n\n                                     THELMA\n                         You're on your own, understand?\n\n                                     TED\n                         I understand.\n\n                                     THELMA\n                         You're sure?\n\n                                     TED\n                         I'm sure.\n\n               ON THELMA\n\n               A long pause, she looks at him with all the warmth of a top \n               sergeant facing a raw recruit. Then:\n\n                                     THELMA\n                         All right. Who's Billy's pediatrician?\n\n               ON TED\n\n               He hasn't the foggiest idea.\n\n                                     THELMA\n                              (machine-gun delivery)\n                         Ed Davies. 230 East 76th Street. 472-\n                         8227. Fifty bucks a house call, thirty \n                         for an office visit. Write this down: \n                         I'm not telling you twice. What's \n                         the nearest hospital?\n\n               ON TED\n\n               As he grabs a piece of paper and starts writing frantically.\n\n                                     TED\n                         Wait a minute! Wait a minute!\n\n                                     THELMA\n                              (not waiting)\n                         Lenox Hill. 77th Street between Park \n                         and Lex. The emergency number is 327-\n                         0800.\n\n                                     TED\n                         Slow down... Slow down...\n\n                                                                    CUT TO:\n\n               INT. TED'S BEDROOM \u0096 DAY\n\n               WIDE SHOT\n\n               Ted stands in the middle of the room, sorting out a huge \n               pile of dirty clothes. Thelma sits on the edge of the bed, \n               watching.\n\n                                     THELMA\n                         Colors in one pile, white things in \n                         another and shirts in a third.\n\n               In the BACKGROUND we SEE the bathroom door as it opens and \n               Billy Kramer steps out, freshly bathed and wearing clean \n               clothes.\n\n                                     THELMA\n                              (without looking around)\n                         Brush the teeth. Hang up the towel \n                         and flush the toilet.\n\n               Billy immediately turns on his heels and heads back into the \n               bathroom.\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 DAY\n\n               CLOSE ON A SILVER CIGARETTE BOX\n\n               That is inscribed, \"Ted and Joanna Kramer, Married April 4, \n               1970.\"\n\n               HOLD FOR A BEAT then Ted's hand reaches into FRAME and picks \n               it up.\n\n               MEDIUM SHOT TED\n\n               As he takes the cigarette box and balances it on a stack of \n               scrap books, photographs, ash trays, etc., etc., that he is \n               carrying. He crosses to another table, picks up a framed \n               photograph of Joanna and Billy and piles that on top of \n               everything. We realize that Ted is going through the apartment \n               from top to bottom and methodically cleaning out every trace \n               of Joanna that he can find.\n\n                                                                    CUT TO:\n\n               EXT. APARTMENT BUILDING \u0096 NIGHT\n\n               ESTABLISHING SHOT\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               WIDE SHOT\n\n               As Ted goes through the room, picking up Billy's clothes \n               which have been strewn every which way.\n\n               THE CAMERA TRACKS WITH HIM as he carries them into Billy's \n               room.\n\n               INT. BILLY'S ROOM \u0096 NIGHT\n\n               Billy is fast asleep, the only light coming from the night \n               lamp on the dresser. Ted dumps the soiled clothing in a \n               hamper, hangs up Billy's jacket, then he neatly folds the \n               boy's sweater and crosses to the dresser.\n\n               CLOSER IN ON THE DRESSER\n\n               As Ted opens a drawer and starts to put the sweater away. \n               Suddenly he spots something.\n\n                                                                    CUT TO:\n\n               HIS POV\n\n               There, in the drawer, sitting on top of a pile of clothing \n               is one of the photographs of Joanna that Ted put away this \n               afternoon.\n\n               Billy has retrieved it and hidden it here, hoping that Ted \n               wouldn't find it.\n\n               CLOSE ON TED\n\n               As he takes a long look at the photograph, then turns to his \n               son.\n\n               HIS POV\n\n               Billy asleep, tangled up in the covers.\n\n               ON TED\n\n               He removes the photograph from the drawer, crosses to the \n               bed and places it on the nightstand nearby so that Billy \n               will be able to see the picture of Joanna when he wakes up \n               in the morning. He sits for a moment longer on the side of \n               the bed and reaches across and smooths down his son's rumpled \n               hair.\n\n                                                             FADE TO BLACK:\n\n               INT. TED'S OFFICE \u0096 LATE AFTERNOON\n\n               ON TED\n\n               Clearly in a rush, loading his briefcase with work to do \n               that evening. He starts for the door and THE CAMERA TRACKS \n               WITH HIM as he walks along the outer office corridor, heading \n               for the elevator. As he passes the door to O'Connor's office:\n\n                                     TED\n                              (calling out)\n                         'Night, Jim.\n\n                                     O'CONNOR (O.S.)\n                              (calling out)\n                         Hey, Ted. C'mon in. I wanna' talk to \n                         you.\n\n               Reluctantly Ted stops, turns around and walks back to the \n               door to O'Connor's office.\n\n                                                                    CUT TO:\n\n               INT. O'CONNOR'S OFFICE \u0096 LATE AFTERNOON\n\n               O'Connor sits back in his chair, his feet propped on the \n               desk a drink in one hand.\n\n                                     O'CONNOR\n                              (jovial)\n                         What's the big rush. C'mon in, put \n                         your feet up, have a drink.\n\n               REVERSE ON TED\n\n               Hanging in the doorway, clearly anxious to leave.\n\n                                     TED\n                         Can't do it tonight. Gotta pick up \n                         Billy. I'm late.\n\n                                     O'CONNOR\n                              (paying no attention \n                              to that)\n                         Listen, I heard a terrific joke today. \n                         There's this Polish skydiver \u0096\n\n                                     TED\n                              (urgent)\n                         Sorry, Jim I've got to go. I'll talk \n                         to you tomorrow.\n\n               And before O'Connor can say anything he is gone.\n\n               REVERSE ON O'CONNOR\n\n               Obviously displeased. He sits for a moment, drumming his \n               fingers on the desk top, then reaches for the phone and starts \n               to dial. A moment later:\n\n                                     O'CONNOR\n                         Murray? Jim O'Connor, why don't you \n                         drop by and have a drink...\n\n                                                                    CUT TO:\n\n               EXT. OFFICE BUILDING \u0096 LATE AFTERNOON\n\n               WIDE SHOT\n\n               As Ted emerges from the building, starts to hail a cab.\n\n                                                                    CUT TO:\n\n               EXT. APARTMENT HOUSE, EAST EIGHTIES \u0096 LATE AFTERNOON\n\n               WIDE SHOT\n\n               As the cab pulls to a stop. Ted leaps out and rushes inside.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY \u0096 APARTMENT BLDG. \u0096 LATE AFTERNOON\n\n               The elevator doors open and Ted steps out.\n\n               THE CAMERA PANS WITH HIM as he crosses to the doorway of an \n               apartment, rings the bell.\n\n               CLOSER IN\n\n               As the door is opened by a pleasant-looking woman in her \n               thirties.\n\n               This is MRS. KLINE. She has the slightly haggard look of \n               someone who has just survived a birthday party with eight \n               five-year-olds.\n\n               In fact, behind her we SEE an abundance of crepe paper and \n               balloons.\n\n                                     TED\n                              (apologetic)\n                         Mrs. Kline, I'm sorry I'm late, but \n                         \u0096\n\n                                     MRS. KLINE\n                         That's all right, but I'm afraid \n                         Billy was a little nervous...\n                              (she glances off screen)\n\n               THEIR POV\n\n               Billy, his coat on, his goody bag in his lap sits alone on a \n               bench in the foyer.\n\n               The moment he sees his father, he gets up and starts for the \n               door.\n\n                                     BILLY\n                              (to Ted, accusingly)\n                         You're late.\n\n                                     TED\n                         I'm sorry, pal, but I had a meeting \n                         and \u0096\n\n                                     BILLY\n                              (to Mrs. Kline anxious \n                              to get away)\n                         Goodbye.\n\n                                     MRS. KLINE\n                         Goodbye, Bill. Thank you for coming.\n                              (calling out to her \n                              son in the next room)\n                         Mark. Say goodbye to Bill.\n\n                                     MARK (O.S.)\n                              (preoccupied)\n                         Bye.\n\n                                     BILLY\n                         Bye.\n\n               And he hustles his father out into the hallway. Once door is \n               shut behind them:\n\n                                     BILLY\n                              (sullen)\n                         I was waiting a long time.\n\n               By now they have crossed to the elevator. Ted rings the bell.\n\n                                     TED\n                              (this ain't exactly \n                              the greeting he's \n                              expected)\n                         It wasn't so long, I'm only...\n                              (checking his watch)\n                         ...twenty minutes late.\n\n               The elevator doors open.\n\n                                     BILLY\n                         All the other mothers got here a \n                         long time ago...\n\n               And the doors close, blocking them from view.\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               WIDE SHOT\n\n               Ted and Billy sit at the dining table, a large pizza between \n               them.\n\n               Ted is working hard, trying to establish some kind of rapport \n               with his son. Billy is silent, he picks at the slice of pizza \n               in front of him.\n\n                                     TED\n                              (more of the camp \n                              counselor)\n                         How was school today?\n\n                                     BILLY\n                         Okay... Same as usual...\n\n                                     TED\n                         Billy, don't eat with your fingers.\n\n                                     BILLY\n                              (morose)\n                         Sorry.\n\n               There is a long beat of silence.\n\n                                     TED\n                              (like pulling teeth)\n                         Well, I see the Yankees finally won \n                         a game.\n\n                                     BILLY\n                         Mom, I mean dad?\n\n                                     TED\n                         Yeah?\n\n                                     BILLY\n                         Can I be excused? I'm not hungry. I \n                         think I'll go to bed.\n\n                                     TED\n                         Sure. Too much birthday cake, right?\n\n                                     BILLY\n                              (as he gets up from \n                              the table)\n                         I guess...\n\n               WIDE SHOT\n\n               As Billy shuffles off toward his room. Ted sits for a beat \n               picking at the food on his plate.\n\n               THE CAMERA TRACKS WITH BILLY as he gets up from the table \n               and walks into his room. HOLD IN THE DOORWAY as he takes off \n               his shirt and pants and leaves them lying on the floor. The \n               boy crosses to the closet, gets his pajamas and puts them \n               on.\n\n               REVERSE ON TED\n\n               Standing in the doorway, watching.\n\n                                     TED\n                         Goodnight.\n\n               ON BILLY\n\n               He starts to crawl into bed.\n\n                                     BILLY\n                              (aloof)\n                         'Night.\n\n               ON TED\n\n               THE CAMERA PANS WITH HIM as he crosses to where Billy dropped \n               his clothes on the floor, picks them up.\n\n                                     TED\n                         Listen, pal, I'm sorry, okay?\n\n               Silence.\n\n                                     TED\n                         I know how you feel.\n\n               Silence.\n\n               Ted crosses, sits on the edge of the bed.\n\n                                     TED\n                         Look, I remember one time when. I \n                         was a couple of years younger than \n                         you are now and... I was staying \n                         with this cousin of mine and my \n                         parents were supposed to come and \n                         pick me up by three, but it got later \n                         and later and they didn't and they \n                         didn't show up and I remember I got \n                         really scared that something had \n                         happened to them and I remember when \n                         they finally came instead of being \n                         happy to see them I was very angry \n                         and... Billy, I promise I'll never \n                         do that to you again, okay?...\n\n               Silence.\n\n                                     TED\n                         Billy? Okay?\n\n               CLOSEUP BILLY\n\n               His face is turned to the wall. HOLD FOR A BEAT as we SEE \n               him nod.\n\n               INT. LIVING ROOM \u0096 TED KRAMER'S APT. \u0096 NIGHT\n\n               Note: The following scene, which is written as one, is \n               actually to be played so that each time we cut back to the \n               woman who is being interviewed as housekeeper, it is a \n               different woman: sometimes nervous and excited, sometimes \n               large and lugubrious, with six shopping bags, sometimes \n               looking like a headmistress at Dachau.\n\n               They are uniformly (until the last) unappetizing.\n\n               Throughout this, we SEE Ted becoming increasingly desperate.\n\n                                     WOMAN\n                              (looking around nervous)\n                         It's very big... They didn't tell me \n                         it was this big.\n\n                                     TED\n                              (apologetically)\n                         No... No, actually it's only two \n                         bedrooms.\n\n                                     SECOND WOMAN\n                              (sniffing)\n                         Phew... This place is a real pig \n                         sty.\n\n                                     TED\n                              (defensively)\n                         Look, my wife just walked out on me. \n                         Okay? It's been a tough week.\n\n                                     THIRD WOMAN\n                         Don't tell me your troubles, mister. \n                         I got enough of my own.\n\n               Note: With the FOURTH WOMAN we begin on a CLOSEUP and PULL \n               BACK to REVEAL that we are in Ted's office and it is the \n               middle of the afternoon.\n\n               INT. TED KRAMER'S OFFICE \u0096 DAY\n\n                                     FOURTH WOMAN\n                         The first thing is, I don't do floors.\n\n               At that point the door behind her opens and O'Connor pokes \n               his head in.\n\n                                     O'CONNOR\n                         Ted.\n\n                                     FOURTH WOMAN\n                              (ignoring him)\n                         Or windows. I come in at ten and I \n                         get Wednesdays off.\n\n                                     O'CONNOR\n                         Ted.\n\n                                     TED\n                              (brisk)\n                         I'll be with you in a minute, Jim.\n                              (back to the woman)\n                         You couldn't make that Saturday, \n                         could you?\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               ON THE FIFTH WOMAN (MRS. WILLEWSKA)\n\n               She is a slightly built attractive woman in her early sixties.\n\n               There is a long pause as she looks around.\n\n                                     MRS. WILLEWSKA\n                         What kind of boy is your son?\n\n               REACTION \u0096 TED\n\n               This is the first person that ever asked about Billy.\n\n                                     TED\n                              (taken aback)\n                         Well, he's... ah, he's a good kid. \n                         He's shy and... I think he's probably \n                         very creative and...\n\n                                     MRS. WILLEWSKA\n                         Could I see him?\n\n                                     TED\n                         Sure. He's right in here.\n\n               As they start toward the child's room.\n\n                                                                    CUT TO:\n\n               INT. BILLY'S ROOM \u0096 NIGHT\n\n               In the darkness we can SEE Billy, all scrunched up in the \n               covers.\n\n               HOLD FOR A BEAT as the door opens and the light from the \n               hall falls across the sleeping boy.\n\n               ON THE DOOR\n\n               Ted and Mrs. Willewska stand silhouetted against the light.\n\n                                     MRS. WILLEWSKA\n                         Oh... He's very beautiful.\n\n               ON BILLY\n\n               As he stirs, in his sleep.\n\n                                     MRS. WILLEWSKA (O.S.)\n                         Mr. Kramer, you are a very lucky \n                         man.\n\n               REACTION, TED\n\n               This is the first time since Joanna left that this has \n               occurred to him.\n\n                                     TED\n                         Mrs. Willewska, could you start on \n                         Monday?\n\n                                                                    CUT TO:\n\n               INT. SUPERMARKET \u0096 DAY\n\n               ON BILLY AND TED\n\n               TRACKING JUST IN FRONT OF THEM as they wheel a shopping cart \n               along the aisle. Ted has a shopping list in his hand.\n\n               Ted stops, takes a box of detergent off of the shelf, starts \n               to put it in the shopping cart, when:\n\n                                     BILLY\n                              (worried)\n                         Mom, I mean dad...\n\n                                     TED\n                              (his mind elsewhere)\n                         Uh huh...\n\n                                     BILLY\n                         That's not the right soap. We use \n                         the kind in the green and yellow \n                         box.\n\n                                     TED\n                         C'mon, there's not much difference \u0096\n\n                                     BILLY\n                              (firmly)\n                         We use the green and yellow.\n\n               Ted looks at his son for a moment, then carefully replaces \n               the detergent that he had originally picked and reaches for \n               the green and yellow kind. They continue on for several steps \n               and Ted stops again, this time looking for a dishwashing \n               liquid. He starts to reach for one, stops, looks around at \n               Billy.\n\n               Billy shakes his head.\n\n               Ted points to another.\n\n                                     BILLY\n                              (shaking his head \n                              again)\n                         The pink stuff.\n\n               Ted takes a bottle of the pink stuff, puts it in the shopping \n               cart and consults his shopping list.\n\n                                     TED\n                         Okay, what color cereal do we get?\n\n                                                                    CUT TO:\n\n               EXT. PLAYGROUND, CENTRAL PARK \u0096 DAY\n\n               WIDE SHOT\n\n               It is that same afternoon and Billy (his clothes are much \n               dirtier by now) is running back and forth with a group of \n               other children.\n\n                                     MAN'S VOICE (O.S.)\n                         Walk him over to Bethesda Fountain \n                         and buy him an ice.\n\n               ON TED\n\n               He sits on one of the playground benches, the work he took \n               from the office stacked beside him on the bench. Sitting \n               next to him is a personable-looking man of about Ted's age. \n               He is nattily dressed in a suit complete with vest, tie and \n               polished Gucci loafers. We will call him THE SATURDAY FATHER.\n\n               Note: The Saturday Father and his daughter (a pretty young \n               girl of about ten) will appear from time to time throughout \n               the film. He is a divorced father, putting in his time, not \n               giving a shit about the child. The Saturday Father insists \n               on treating Ted as though they were members of the same secret \n               fraternity. And he comes to represent Ted's nightmare of \n               what might happen to him.\n\n                                     TED\n                              (looking in the \n                              direction of the \n                              voice)\n                         What?\n\n                                     SATURDAY FATHER\n                         Walk him over to Bethesda Fountain, \n                         buy him an ice. It'll kill twenty \n                         minutes.\n\n                                     TED\n                         I've got a lot more than twenty \n                         minutes to kill.\n\n                                     SATURDAY FATHER\n                         Tough...\n                              (checking his watch)\n                         ...I get off duty at five-thirty.\n                              (bored, anxious to \n                              make conversation)\n                         How long you been divorced?\n\n                                     TED\n                              (surprised)\n                         Three months. How can you tell?\n\n                                     SATURDAY FATHER\n                         You've got that look. My lady and I \n                         split two years ago in August and \n                         I'm an old pro at this shit. First \n                         thing, stay away from the Children's \n                         Zoo. It's pure hell \u0096 if I never see \n                         another chicken, I'll be happy.\n                              (calling out to his \n                              daughter OFF SCREEN)\n                         I'm here, darling. Don't worry...\n\n               CLOSER ON TED\n\n               Finding this distinctly unpleasant. He glances around, looking \n               for Billy.\n\n               HIS POV\n\n               The sprinkler area. Other children are running around, but \n               there is no sign of Billy.\n\n                                     TED\n                              (calling out)\n                         Billy?\n\n               HIS POV\n\n               Another area of the playground. Billy is nowhere in sight.\n\n               WIDER ON TED\n\n               As he grabs his stuff and starts toward the exit of the \n               playground.\n\n                                     TED\n                              (louder)\n                         Billy?\n\n               HIS POV\n\n               Looking in another direction. Nothing.\n\n               WIDE ON TED\n\n               Standing among a crowd of people just outside the entrance \n               to the playground. He is looking around wildly.\n\n                                     TED\n                         Billy?!\n\n               HIS POV\n\n               There in the distance is Billy Kramer, running as hard as he \n               can away from Ted.\n\n               ON TED\n\n               TRACKING IN FRONT OF HIM as he starts to chase after Billy.\n\n               HIS POV \u0096 TRACKING FORWARD\n\n               It is clear that Billy is running with a purpose.\n\n                                     TED (V.O.)\n                         Billy!\n\n               Billy pays no attention to him.\n\n               ON TED\n\n               TRACKING IN FRONT OF HIM as he continues to chase his son.\n\n               HIS POV \u0096 TRACKING FORWARD\n\n               Closer now, we can SEE that ahead of Billy is a woman that, \n               from behind, looks remarkably like Joanna.\n\n               CLOSER ON TED\n\n               As he realizes what is about to happen.\n\n               CLOSER ON BILLY\n\n               Catching up to the woman.\n\n                                     BILLY\n                         Mommy! Mommy!\n\n               A moment later he gets close enough to grab onto her skirt. \n               As the woman turns around:\n\n               CLOSEUP WOMAN\n\n               Quite clearly it is not Joanna.\n\n               CLOSEUP BILLY\n\n               His face becomes impassive again. All the excitement vanishes.\n\n                                     BILLY\n                         Oh. I thought you were my mommy.\n\n               CLOSEUP TED\n\n               His face reveals all of the pain that Billy's can't.\n\n                                                                    CUT TO:\n\n               INT. CLASSROOM, NURSERY SCHOOL \u0096 DAY\n\n               CLOSE ON A HOMEMADE CURTAIN\n\n               As it opens and Billy Kramer, wearing an outsized moustache, \n               a makeshift cape and a stovepipe hat made from construction \n               paper.\n\n               He stands for a moment, looking around, finally he spots \n               someone, grins and begins waving.\n\n               HIS POV\n\n               Across the room eighteen to twenty mothers (Ted Kramer is \n               the only man present) are gathered, sitting on tiny chairs \n               and at work tables watching as their children put on a show.\n\n               ON BILLY\n\n               Suddenly he forgets his lines, looks around nervously. A \n               moment later a very pretty young teacher leans over, whispers \n               in his ear.\n\n                                     TEACHER\n                         Ladies and gentlemen...\n\n                                     BILLY\n                         Ladies and gentlemen...\n\n                                     TEACHER\n                         Welcome to the greatest show on earth.\n\n                                     BILLY\n                         Welcome to the...\n                              (he forgets again)\n\n               REVERSE ON TED\n\n               He leans forward mouthing the words as the teacher prompts \n               Billy.\n\n                                     TEACHER\n                         Greatest.\n\n                                     BILLY\n                         Greatest...\n\n                                     TEACHER\n                         Show.\n\n                                     BILLY\n                         Show...\n\n                                     TEACHER\n                         On earth.\n\n                                     BILLY\n                         On earth.\n\n               Ted breathes a sigh of relief, his son having gotten through \n               it.\n\n               CROSS-CUTTING BETWEEN THE CHILDREN PUTTING ON THE SHOW AND \n               TED KRAMER SITTING IN THE AUDIENCE WATCHING:\n\n               A look of total pleasure on his face. From time to time when \n               Billy does something particularly difficult, Ted nudges the \n               woman next to him.\n\n               Note: In all of the shots of Billy we SEE the teacher there \n               guiding, helping, over and over and over we cannot help but \n               notice how attractive she is. Toward the end of the show \n               Ted's POV occasionally follows the teacher rather than the \n               child.\n\n                                                               DISSOLVE TO:\n\n               WIDE SHOT\n\n               The show is over and the parents and children mill around \n               eating popcorn, drinking lemonade from paper cups. Ted stands \n               off to one side, talking to the teacher as Billy runs around.\n\n               CLOSER IN ON THEM\n\n                                     TEACHER\n                         Mr. Kramer, I just wanted to tell \n                         you what a wonderful boy your son \n                         is.\n\n                                     TED\n                              (clearly attracted to \n                              her)\n                         I don't know... I've been worried...\n                              (glancing around, \n                              making sure Billy is \n                              out of earshot)\n                         I mean, with what he's been through \n                         and everything. I \u0096\n\n                                     TEACHER\n                              (solicitously)\n                         No... No... Billy is doing just fine.\n\n                                     TED\n                              (giving himself a few \n                              points)\n                         Well, you know it's not easy raising \n                         a kid on your own and I thought if \n                         we could get together and, uh, discuss \n                         \u0096\n\n               At that moment one of the class mothers interrupts, reaches \n               across Ted and takes hold of the teacher's hand.\n\n                                     WOMAN\n                              (effusive)\n                         Barbara! Congratulations! When is \n                         the baby due?\n\n                                     TEACHER (BARBARA)\n                         Oh, God. Not 'til August.\n\n               CLOSE ON TED\n\n               Inadvertently glancing at the teacher's stomach, nothing \n               shows.\n\n               ON THE TEACHER\n\n               As she turns back to Ted.\n\n                                     TEACHER\n                         Excuse me. You said you wanted to \n                         talk, Mr. Kramer.\n\n                                     TED\n                              (embarrassed)\n                         Yes, but... ah, not now...\n                              (checking his watch)\n                         I've got an appointment... I forgot \n                         all about it...\n\n               As Ted begins beating a hasty retreat,\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON TED\n\n               TRACKING IN FRONT OF HIM as he walks down the street carrying \n               a large and elaborate papier-mâché art thing that Billy made \n               in school.\n\n               CROSS-CUTTING BETWEEN TED AND HIS POV:\n\n               As he manages to notice every single pretty girl that passes, \n               thread his way through the crowd and still balance Billy's \n               enormous work of art.\n\n                                                                    CUT TO:\n\n               INT. AGENCY \u0096 DAY\n\n               ON THE ELEVATOR DOORS\n\n               As they open, Ted squeezes off and AS THE CAMERA TRACKS WITH \n               HIM, he crosses the waiting room and enters the offices \n               proper. He pauses at his secretary's desk and deposits Billy's \n               papier-mâché thing. She jumps up from her desk, takes the \n               papier-mâché thing and her notebook in hand, and follows Ted \n               as he walks down the corridor towards O'Connor's office.\n\n                                     SECRETARY\n                         Mr. O'Connor called. There's a meeting \n                         with the Revlon people in the board \n                         room and you're fifteen minutes late.\n\n                                     TED\n                              (in a rush)\n                         I know... I know.\n\n                                     SECRETARY\n                         Mr. Schmidt can't have the figures \n                         on the television buy until Monday.\n\n                                     TED\n                         No. Uh, uh. Tell him I asked for it \n                         Friday. I want it Friday. Period.\n\n                                     SECRETARY\n                         Mr. Lombardo from packaging wants to \n                         meet on Friday.\n\n                                     TED\n                         Fine.\n\n               By now they have reached the board room. He enters without \n               knocking, his secretary still in tow.\n\n                                     SECRETARY\n                         And Mrs. Kelsey called to ask if \n                         Billy can come to Stephanie's birthday \n                         party on Tuesday.\n\n                                                                    CUT TO:\n\n               INT. BOARD ROOM \u0096 DAY\n\n               The room is filled with executives in three piece suits and \n               O'Connor who is doing a lot of backing and filling.\n\n                                     TED\n                              (as he enters)\n                         Yes. Remind me to pick up a \"Crying \n                         Chrissie\" doll at lunch on Tuesday.\n\n               ON O'CONNOR\n\n               Clearly he is very irritated at this.\n\n                                     O'CONNOR\n                              (sardonic)\n                         If it's all right with you, Mother \n                         Kramer, can we get down to work now?\n\n                                                                    CUT TO:\n\n               INT. PHYLLIS BERNARD'S OFFICE \u0096 DAY\n\n               It is a real mess, legal files and law books scattered \n               everywhere.\n\n               In the midst of all this chaos sits PHYLLIS BERNARD, as we \n               said before, she is about thirty, very pretty in spite of \n               her glasses.\n\n               ON PHYLLIS\n\n               She looks up as Ted enters. It is clear from their attitude \n               that they have known one another for a long time and are \n               very relaxed together.\n\n                                     PHYLLIS\n                         Hello, Kramer.\n\n               ON TED\n\n               He drops into a chair and shoves a stack of papers across \n               the desk to her.\n\n                                     TED\n                         Hiya, Phyllis. These are the Revlon \n                         contracts. I thought you ought to \n                         check them out.\n\n                                     PHYLLIS\n                         Sure.\n\n               She takes the papers and starts to rifle through them, \n               stopping every so often and making a note in the margin. As \n               she does, we notice that the second and third buttons of her \n               blouse have come undone and that she is not wearing a bra.\n\n               CLOSER ON TED\n\n               As he realizes this.\n\n               ON PHYLLIS\n\n               She glances up to ask Ted a question about some point or \n               other, notices the direction of his gaze and, unself-\n               consciously buttons up her blouse.\n\n               She goes back to her papers as Ted continues to watch her.\n\n               ON PHYLLIS\n\n               Not looking up from her papers.\n\n                                     PHYLLIS\n                         Yes.\n\n                                     TED\n                              (baffled)\n                         Yes, what?\n\n                                     PHYLLIS\n                              (looks up, serious)\n                         Yes, I'll have dinner with you.\n\n                                                                    CUT TO:\n\n               INT. TED KRAMER'S BEDROOM \u0096 LATE AT NIGHT\n\n               ON THE BED\n\n               Although the room is dimly lit, we can SEE quite clearly \n               that Ted and Phyllis are in bed together. They have finished \n               making love and Ted lies back, half asleep. Phyllis reaches \n               across to the nightstand, puts on her glasses and checks her \n               watch.\n\n                                     PHYLLIS\n                         Kramer, I've got to go. I've got an \n                         eight o'clock closing tomorrow down \n                         on Centre Street.\n\n                                     TED\n                              (half asleep)\n                         Mmmmnph... I'll get you a cab...\n\n               But he makes no move to get up.\n\n               Phyllis gets to her feet and in the dim light we can SEE \n               that, except for her glasses, she is naked.\n\n                                     PHYLLIS\n                              (as she crosses the \n                              hall on the way to \n                              the bathroom)\n                         That's okay. It's just that I've got \n                         these clients that are \u0096\n\n                                                                    CUT TO:\n\n               INT. BATHROOM \u0096 NIGHT\n\n               There is Billy Kramer, standing by the toilet, buttoning his \n               pajamas. He looks up at Phyllis.\n\n               HIS POV\n\n               There stands Phyllis, naked as the day she was born, a look \n               of stunned amazement on her face.\n\n                                     PHYLLIS\n                              (softly to herself)\n                         Oh, God.\n\n               Too startled to cover herself.\n\n               ON BILLY\n\n               He looks her up and down, then:\n\n                                     BILLY\n                              (very serious)\n                         Do you like fried chicken?\n\n               ON PHYLLIS\n\n               Suddenly remembering to cover herself.\n\n                                     PHYLLIS\n                              (hoping desperately \n                              it is the right answer)\n                         Ah... Yes.\n\n               SHOT \u0096 PHYLLIS AND BILLY\n\n                                     BILLY\n                         So do I...\n\n               And he shuffles off to bed. Phyllis waits, frozen until he \n               disappears into his room. Then, she turns and flees back \n               into the bedroom.\n\n                                                                    CUT TO:\n\n               INT. BEDROOM \u0096 NIGHT\n\n               ON PHYLLIS\n\n               As she bursts into the room, closes the door behind her, \n               leans against it.\n\n                                     PHYLLIS\n                              (eyes wide)\n                         I just met your son.\n\n               ON TED\n\n               Who has leapt out of bed and is scrambling into his pants.\n\n                                     TED\n                         Like that?!\n\n               Phyllis nods.\n\n                                     TED\n                         And?\n\n                                     PHYLLIS\n                         He wanted to know if I liked fried \n                         chicken.\n\n                                     TED\n                         Do you?\n\n               Phyllis nods rather frantically.\n\n                                     TED\n                              (grinning)\n                         So what's your problem?\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 KRAMER APT. \u0096 EVENING\n\n               ON TED AND THELMA\n\n               Stand side by side. He is cutting, chopping, making some \n               kind of stew. Thelma stands nearby watching, sipping a glass \n               of white wine.\n\n               FROM OFF SCREEN we can hear Billy and Kim running around, \n               playing.\n\n                                     TED\n                         You ever think about getting married \n                         again?\n\n                                     THELMA\n                         No, not really...\n                              (she thinks for a \n                              moment, then:)\n                         I guess it's different if you don't \n                         have children, but... I dunno, even \n                         if Charley and I don't live together, \n                         even if we're sleeping with other \n                         people, even if Charley was to marry \n                         again... He'd still be my husband. \n                         That stuff about \"Till death do you \n                         part?\" That's really true.\n\n                                     TED\n                              (nodding toward a \n                              cookbook that is \n                              propped open nearby)\n                         How many onions does it say to use?\n\n                                     THELMA\n                              (without bothering to \n                              look in the book)\n                         Three. And add some basil.\n\n                                     TED\n                              (as he does)\n                         D'you think you and Charley'll ever \n                         get back together again?\n\n                                     THELMA\n                         No. I don't think so.\n\n                                     TED\n                         C'mon, Thel. So Charley had a little \n                         fling. So what? All in all he was a \n                         pretty good husband.\n\n                                     THELMA\n                         Look, I know this isn't gonna make \n                         any sense, okay? I mean forget the \n                         logic part... But I keep thinking if \n                         Charley really loved me, he wouldn't \n                         have let me divorce him.\n\n                                                                    CUT TO:\n\n               EXT. CENTRAL PARK \u0096 DAY\n\n               WIDE SHOT\n\n               The Saturday Father and his daughter, clearly with nothing \n               to say to one another, stand eating ices from a nearby vendor. \n               THE CAMERA PANS AWAY FROM THEM across to Billy, Ted and \n               Phyllis. She is dressed in a very nice suit, silk blouse, \n               high heeled shoes and looks distinctly out of place in Central \n               Park on a Saturday afternoon.\n\n               At the moment, Ted is trying to teach Billy how to bat.\n\n                                     TED\n                         Now look, you hold it like this...\n                              (he places Billy's \n                              hands on the bat \n                              just so)\n                         ...and you swing like this...\n                              (taking him through \n                              the motions)\n\n               ON PHYLLIS\n\n               Watching. She can't believe what she's seeing. Finally, she \n               can't stand it any longer.\n\n                                     PHYLLIS\n                              (impatient)\n                         No, no, no, Kramer. That's not how \n                         you do it. Look...\n\n               She crosses to Billy, gently takes the bat from him and \n               demonstrates.\n\n                                     PHYLLIS\n                         ...you hold it like this...\n                              (showing him her grip)\n                         Farther down the bat. And you swing \n                         like this...\n                              (to Ted)\n                         Throw me one.\n\n               ON TED\n\n               As he gives Billy a look that says, we have to humor her. He \n               throws a ball.\n\n               ON PHYLLIS\n\n               As she swings, connects and slams a ball in a long, looping \n               fly that goes at least two hundred feet.\n\n               ON TED\n\n               Watching the ball disappear in the distance, he turns back \n               to Phyllis, open-mouthed.\n\n               CLOSE ON PHYLLIS\n\n               Embarrassed, she grins, shrugs and hands the bat back to \n               Billy.\n\n                                                                    CUT TO:\n\n               INT. O'CONNOR'S OFFICE \u0096 DAY\n\n               WIDE SHOT\n\n               O'Connor, Murray and the Art Director are in O'Connor's office \n               as the door opens and Ted enters, carrying a pile of papers, \n               charts, graphs, etc., etc.\n\n                                     TED\n                         Okay, Jim. Here's the report on...\n\n               He stops in mid-sentence, looks around.\n\n               HIS POV\n\n               On the walls are a series of mock-ups of the various Fire \n               and Ice ads, none of which are what Ted and O'Connor had \n               agreed upon.\n\n                                     TED\n                              (surprised)\n                         What the hell is this?\n\n                                     O'CONNOR\n                              (innocent)\n                         Murray had some ideas about the Fire \n                         and Ice campaign and he had the art \n                         department make up a few roughs...\n                              (weakly)\n                         I think they're kind of interesting.\n\n                                     TED\n                              (bugged)\n                         I don't. Jim, this isn't anything \n                         like what we talked about. It's not \n                         even close.\n\n                                     MURRAY\n                              (oily)\n                         Ted, basically it's still your \n                         concept.\n\n                                     O'CONNOR\n                              (chiming in)\n                         Murray just added a few things, that's \n                         all.\n\n                                     TED\n                         Now hold it right there, I'm the one \n                         that went in and sold Revlon on this \n                         idea to start with, remember? You \n                         said I was going to be \u0096\n\n               Sound-effect: The phone rings.\n\n               O'Connor picks it up.\n\n               ON TED\n\n                                     O'CONNOR\n                         Yeah?\n\n               He listens for a moment, then hands the phone to Ted.\n\n                                     O'CONNOR\n                         It's for you.\n\n               ON TED\n\n               As he takes the receiver.\n\n                                     TED\n                              (puzzled)\n                         Yes?\n\n               Then, embarrassed, he turns his back and lowers his voice.\n\n                                     TED\n                         Look, Billy, I told you before, one \n                         hour of T.V. a day, that's the rule... \n                         No...\n                              (clearly, Billy is \n                              giving him an argument)\n                         I don't care what the other mothers \n                         do... Listen, I can't talk now, I'm \n                         in a meeting...\n                              (firm)\n                         Billy, I'll talk to you later, good-\n                         bye.\n\n               Note: During the phone call, the CAMERA PANS AWAY to Murray \n               & O'connor, looks of bored Condescension and smug superiority \n               on their faces.\n\n               Ted hangs up the phone and turns back around.\n\n                                     MURRAY\n                              (smooth)\n                         Ted, I appreciate what you're saying, \n                         but I really think you're just too \n                         close to it right now.\n\n                                     O'CONNOR\n                              (quickly)\n                         Murray's right.\n                              (reassuring)\n                         Look it's just some ideas, okay? I \n                         mean nothing's locked in cement. I \n                         promise you this is your show...\n\n               ON TED\n\n               Not very reassured.\n\n                                     O'CONNOR\n                         Trust me on this one, Ted...\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               Ted is sitting at the dining room table, working. Spread out \n               all across the table are layouts, rate sheets, etc., etc. \n               Billy sits across from him drawing on a pad with felt-tipped \n               pens. HOLD FOR A BEAT, then:\n\n                                     BILLY\n                              (worried about \n                              something)\n                         Mom, I mean dad...\n\n                                     TED\n                              (busy)\n                         In a minute...\n\n               beat of silence then:\n\n                                     BILLY\n                         What do you do when an elephant sits \n                         on your fence?\n\n               Silence.\n\n                                     BILLY\n                         You get a new fence.\n\n                                     TED\n                              (he hasn't heard a \n                              word)\n                         C'mon, Billy. I'm trying to work for \n                         God's sake...\n\n               Another beat of silence, then Billy reaches for his glass of \n               Hawaiian Punch and accidentally tips it over, spilling purple \n               liquid across all of Ted's papers.\n\n               Instantly, Ted is on his feet, yelling.\n\n                                     TED\n                         Goddamnit, can't you watch what you're \n                         doing!\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     BILLY\n                              (quiet)\n                         I'm sorry.\n\n                                     TED\n                         Je-sus Christ! I catch all kind of \n                         shit at the office because I'm not \n                         pulling my weight because I'm busting \n                         my butt trying to be a decent goddamn \n                         father and \u0096\n\n                                     BILLY\n                         I'm sorry.\n\n                                     TED\n                              (sardonic)\n                         That's terrific. That's really \n                         terrific, but I notice I'm the one \n                         that's cleaning up this \u0096\n                              (noticing an important \n                              paper covered with \n                              grape juice)\n                         Oh, crap, I'll have to do this one \n                         over.\n\n                                     BILLY\n                              (starting to help)\n                         I'm sorry.\n\n               By now there is nothing the boy can do right.\n\n                                     TED\n                         Look, it's after your bedtime, okay? \n                         Just do me a favor and go to bed, \n                         okay?\n\n               Billy gets to his feet, collects his stuff and walks into \n               his bedroom. HOLD ON TED who sits for a moment, then gets \n               wearily to his feet and as THE CAMERA TRACKS WITH HIM crosses \n               to the door of Billy's room. He stops in the doorway, looks \n               OFF SCREEN.\n\n               HIS POV\n\n               Billy struggling to get his pajamas on, having a hard time.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     TED\n                         Look, I'm sorry I yelled, okay?\n\n                                     BILLY\n                              (quiet)\n                         That's okay.\n\n                                     TED\n                         It's just... I've been catching a \n                         lot of flack at the office...\n\n                                     BILLY\n                         That's okay...\n\n               INT. OFFICE \u0096 DAY\n\n               ON THE DOOR TO O'CONNOR'S OFFICE\n\n               As it opens and Phyllis comes out. In the background in \n               O'Connor's office we SEE O'Connor and Murray, talking, \n               laughing.\n\n               THE CAMERA TRACKS ALONGSIDE Phyllis as she walks to Ted \n               Kramer's office and opens the door without knocking.\n\n                                     PHYLLIS\n                         How about lunch, Kramer. I'm buying.\n\n                                                                    CUT TO:\n\n               INT. RESTAURANT, MIDTOWN \u0096 DAY\n\n               ON TED AND PHYLLIS\n\n               As they sit across from one another. A waiter stands over \n               them, setting drinks in front of them.\n\n                                     WAITER\n                         Perrier and lime...\n                              (placing a drink in \n                              front of Phyllis)\n                         ...and scotch with soda.\n                              (putting Ted's drink \n                              in front of him)\n\n               The waiter bustles away.\n\n                                     TED\n                         Okay, Phyllis, what's up?\n\n                                     PHYLLIS\n                         Kramer...\n\n               She breaks off, uncertain whether or not to go on. Then, \n               making up her mind, she reaches across, takes Ted's scotch \n               and soda and drinks half of it down in one gulp.\n\n                                     PHYLLIS\n                              (in a rush)\n                         O'Connor's out to get you. He's going \n                         to take the Fire and Ice account \n                         away from you.\n\n                                     TED\n                              (stunned)\n                         What?!?\n\n               Phyllis nods.\n\n                                     TED\n                              (angry)\n                         I don't believe it! That's crazy! \n                         Why would Jim do something like that?\n\n               Phyllis polishes off the rest of Ted's drink.\n\n                                     PHYLLIS\n                              (angry herself)\n                         You want to know why? I'll tell you \n                         why...\n                              (signaling to the \n                              waiter)\n                         Another scotch and soda for the \n                         gentleman.\n                              (back to Ted)\n                         I'll tell you exactly why. Because \n                         you're not his buddy anymore. Because \n                         he can't count on you to sit around \n                         the office every night until eight \n                         or nine and shoot the shit with him.\n\n                                     TED\n                         I can't. I've got Billy to take care \n                         of.\n\n                                     PHYLLIS\n                              (exasperated)\n                         You dope. O'Connor doesn't give a \n                         damn about Billy. All he wants is \n                         somebody that'll hang around with \n                         him every night so he won't have to \n                         go home.\n\n                                     TED\n                              (stiff)\n                         I don't believe you.\n\n               The waiter sets Ted's drink on the table in front of him. He \n               starts to reach for it, but Phyllis is quicker.\n\n                                     PHYLLIS\n                              (taking a stiff drink)\n                         All right. Okay. But tell me \n                         something, Kramer. Who do you think \n                         is palling around with O'Connor these \n                         days?\n\n               Ted shrugs.\n\n                                     TED\n                         How should I know?\n\n                                     PHYLLIS\n                         Murray.\n\n               REACTION, TED\n\n               Stunned, but trying to be nonchalant.\n\n                                     TED\n                         So... what's so terrible about that?\n\n                                     PHYLLIS\n                              (would like to take \n                              him by the shoulders \n                              and shake him until \n                              his teeth rattle)\n                         Oh, for God's sake, Kramer. You have \n                         got to be the world's most naive \n                         human being.\n                              (leaning forward)\n                         Murray has gone in and changed every \n                         single ad you've done on the entire \n                         Fire and Ice campaign. Every layout... \n                         Every idea... Every single thing, \n                         right down the line.\n\n                                     TED\n                         No. No, I don't believe it. Jim \n                         O'Connor would never let anything \n                         like that happen. He gave me my shot \n                         in this business. If it wasn't for \n                         Jim O'Connor I'd be \u0096 I don't know \n                         where I'd be. He's a wonderful man...\n\n                                     PHYLLIS\n                              (apologetic for having \n                              upset Ted)\n                         Kramer, I'm sorry. All I was trying \n                         to do was \u0096\n\n                                     TED\n                              (cutting her off)\n                         I don't want to hear another word \n                         against him. Not another word. He's \n                         a wonderful man... a wonderful man...\n\n                                                                    CUT TO:\n\n               INT. TED KRAMER'S OFFICE \u0096 DAY\n\n               INSERT: The finished proof of the ad that Murray had done, \n               that Ted had seen in O'Connor's office.\n\n               ON TED\n\n               TRACKING WITH HIM as he steams out of his door and marches \n               along the corridor to O'Connor's office.\n\n                                     SECRETARY\n                              (as Ted brushes past \n                              her)\n                         I'm sorry, Mr. O'Connor is in \n                         conference.\n\n               But it is too late. Ted barrels into O'Connor's office without \n               bothering to knock.\n\n                                                                    CUT TO:\n\n               INT. O'CONNOR'S OFFICE \u0096 DAY\n\n               O'Connor is alone in the office. He looks up startled as Ted \n               comes barging in.\n\n                                     TED\n                              (furious)\n                         All right, Jim. You said I was running \n                         this show, right? You said no \n                         decisions without my approval, right?\n                              (brandishing the ad)\n                         Well what the hell is this? What's \n                         going on, Jim?\n\n                                     O'CONNOR\n                              (embarrassed)\n                         Well, ah... I thought it over and I \n                         decided we're doing it Murray's way.\n\n                                     TED\n                         Jim, this is garbage. This isn't \n                         anything like what we talked to Revlon \n                         about. None of it. You can't \u0096\n\n                                     O'CONNOR\n                              (tough)\n                         That's my decision, Ted and that's \n                         final.\n\n                                                                    CUT TO:\n\n               INT. DINING AREA \u0096 KRAMER APT. \u0096 NIGHT\n\n               ON BILLY\n\n               Who sits looking down at the plate of food in front of him \n               as though it was a coiled rattlesnake about to strike.\n\n                                     BILLY\n                         What is it?\n\n               ON TED\n\n               Preoccupied, jumpy. He is eating, but he doesn't taste a \n               thing.\n\n                                     TED\n                         Salisbury steak.\n\n                                     BILLY\n                         I hate it.\n\n                                     TED\n                         You don't hate it. We had Salisbury \n                         steak last week and you liked it \n                         fine.\n\n                                     BILLY\n                              (stubborn)\n                         No I didn't. I hate the brown stuff. \n                         It's gross.\n\n                                     TED\n                              (strained patience)\n                         All it is is onions and gravy.\n\n                                     BILLY\n                         I'm allergic to onions.\n\n                                     TED\n                         You are not allergic of onions. You've \n                         had them lots of times.\n\n                                     BILLY\n                              (sullen)\n                         I want a pizza.\n\n                                     TED\n                              (trying not to lose \n                              patience)\n                         No. This is fine. Just take a bite, \n                         you'll like it fine.\n\n               Reluctantly, Billy takes a tiny bite. He barely puts it in \n               his mouth before he spits it out with a great show of being \n               physically ill.\n\n                                     BILLY\n                         I think I'm going to throw up.\n\n                                     TED\n                              (getting pissed off)\n                         Oh, for God's sake... Here.\n\n               He reaches across and scrapes most of the sauce off of the \n               meat.\n\n                                     TED\n                         There, okay? Now that's just plain \n                         old hamburger.\n\n                                     BILLY\n                         Some of the brown stuff is still \n                         there.\n\n                                     TED\n                              (through clenched \n                              teeth)\n                         Then eat around it.\n\n                                     BILLY\n                         No.\n\n                                     TED\n                              (anger building)\n                         Now listen to me, young man. Do you \n                         know what I had to go through to put \n                         this goddamn food on the goddamn \n                         table?\n\n                                     BILLY\n                              (obstinate)\n                         I don't care. I hate it. I want pizza.\n\n                                     TED\n                              (blowing up)\n                         Not on your life. That's it. I've \n                         had it with crap around this house. \n                         From now on, no more pizza! Get it? \n                         Starting right now you can eat real \n                         food like a normal human being!\n\n                                     BILLY\n                         No!\n\n               By now both of them are out of control.\n\n                                     TED\n                         You want to know something?! You are \n                         a spoiled selfish little brat! Now \n                         eat \u0096\n\n               Billy takes his plate and looking his father straight in the \n               eye deliberately overturns it, spilling food everywhere.\n\n               ON TED\n\n               He is out of his chair like a shot, crosses to Billy and \n               jerks him to his feet.\n\n                                     TED\n                              (yelling)\n                         Goddamnit! Go to your room!\n\n               He half-carries, half-drags the child kicking and screaming \n               into his room. THE CAMERA TRACKS ALONGSIDE THEM.\n\n                                     BILLY\n                              (at the top of his \n                              voice)\n                         Owwww... You're hurting me... You're \n                         hurting me... I hate you... I hate \n                         you...\n\n                                     TED\n                              (seething)\n                         You're no bargain either, pal.\n\n                                     BILLY\n                         I want my mommy... I want my mommy..\n\n               By now they have reached Billy's room. Ted dumps him on the \n               bed unceremoniously and starts out of the room.\n\n                                     BILLY\n                              (sobbing)\n                         I want my... mm... ommy... I want \n                         mmmy... mommy...\n\n                                     TED\n                              (at the door)\n                         Tough shit. You're stuck with me.\n\n               And he slams the door behind him.\n\n                                                                    CUT TO:\n\n               WIDE SHOT\n\n               The dining area. Ted sits down and tries to resume his meal \n               alone.\n\n                                     BILLY (O.S.)\n                              (sobbing, fighting to \n                              catch his breath)\n                         I want my... mmmo... mmmy. I want \n                         mmmy mmo... mmy...\n\n               CLOSER IN ON TED\n\n               As he lifts his glass to take a drink and we can SEE that he \n               is shaking like a leaf.\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 NIGHT\n\n               ON TED\n\n               As he finishes doing the last of the dishes, dries his hands \n               and looks around to make sure that everything has been put \n               away. He flips off the light and, as THE CAMERA TRACKS WITH \n               HIM, he walks from room to room, turning off the lights, \n               until he reaches the door to Billy's room which is still \n               closed. Ted hesitates for a moment, then eases open the door \n               and steps inside.\n\n                                                                    CUT TO:\n\n               INT. BILLY'S ROOM \u0096 NIGHT\n\n               TED'S POV\n\n               Billy lies sprawled across the bed, all tangled up in the \n               covers.\n\n               ON TED\n\n               As he crosses to the sleeping child and starts to straighten \n               the covers.\n\n                                     BILLY\n                              (tentatively)\n                         Daddy?\n\n                                     TED\n                              (all anger gone)\n                         Yeah?\n\n                                     BILLY\n                         I'm sorry...\n\n                                     TED\n                              (kisses him)\n                         That's okay, pal. Go back to sleep. \n                         It's very late.\n\n               He starts to get up, when:\n\n                                     BILLY\n                         Daddy?\n\n                                     TED\n                         Uh huh?\n\n                                     BILLY\n                              (very quiet)\n                         Are you... gonna go... away?\n\n               ON TED\n\n               Stunned at the question.\n\n                                     TED\n                         Of course I'm not going away. I love \n                         you very much. I'll be right here.\n\n               There is a beat of silence, then:\n\n                                     BILLY\n                              (it comes pouring out)\n                         That's why mommy left... isn't it? \n                         'Cause I was bad...\n\n               The boy begins to weep.\n\n                                     TED\n                              (he puts his arm around \n                              Billy and holds him \n                              close)\n                         Oh, Christ... Oh, Christ...\n                              (he thinks for a \n                              moment, then:)\n                         No, pal. Your mom loves you very \n                         much. The reason she left didn't \n                         have anything to do with you.\n                              (pause, this is very \n                              painful)\n                         Look, I don't know if this will make \n                         any sense to you, okay? But I'll try \n                         and explain. You see the reason your \n                         mom left was because... Well, I guess \n                         it was because I kept trying to make \n                         her into a certain kind of person... \n                         Make her be the way I thought a wife \n                         was supposed to be. Only she wasn't \n                         like that. She was...\n                              (smiles to himself)\n                         Well, she wasn't like that. And now, \n                         when I think about it, I can see she \n                         tried very hard to be like I wanted \n                         \u0096 very hard. And when she couldn't, \n                         then she tried to tell me about it. \n                         Only I wouldn't listen. I guess I \n                         thought that if I was happy, that \n                         meant she was happy too. Only she \n                         wasn't. The truth is, the only reason \n                         she didn't leave a lot sooner was \n                         because she loves you so much. Joanna \n                         stayed until she couldn't stand me \n                         any longer and then she left... But \n                         it wasn't you, pal. It wasn't you.\n\n               There is a long beat of silence as Billy thinks about this.\n\n               Clearly an enormous burden has been lifted from his shoulders.\n\n               Finally:\n\n                                     BILLY\n                         Is mom ever coming back?\n\n                                     TED\n                         You mean for good?\n\n               Billy nods.\n\n                                     TED\n                         I don't think so.\n\n                                     BILLY\n                              (thoughtfully)\n                         Oh...\n\n               Ted gets to his feet, starts for the door.\n\n                                     TED\n                         Now go to sleep. It's very late.\n\n                                     BILLY\n                         Good night.\n\n                                     TED\n                         Sleep tight.\n\n                                     BILLY\n                         Don't let the bedbugs bite.\n\n                                     TED\n                         See you in the morning light.\n\n                                     BILLY\n                         Dad?\n\n               Ted pauses in the doorway, smiles.\n\n                                     TED\n                         Yes?\n\n                                     BILLY\n                         I love you...\n\n                                                                    CUT TO:\n\n               EXT. CENTRAL PARK \u0096 DAY\n\n               SERIES OF TRACKING SHOTS\n\n               As Ted runs along beside Billy, who is learning to ride a \n               bike.\n\n               Then, in the last shot, Ted lets go of the bike and runs \n               along just behind. Slowly as Billy gains confidence he speeds \n               up, leaving Ted farther and farther behind. Finally, as Billy \n               glances over his shoulders.\n\n                                                                    CUT TO:\n\n               TED'S POV\n\n               As the boy, by now a considerable distance away, turns and \n               waves.\n\n               ON TED\n\n               Waving back, a grin of enormous pride on his face. He glances \n               around, embarrassed to make sure no one is watching and wipes \n               tears from his eyes.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON A BUS\n\n               As it pulls to a stop and a mob of mothers and children get \n               off.\n\n               Among them we spot Billy and Ted Kramer. THE CAMERA PANS \n               WITH THEM as they cross the street and enter the school \n               building. THE CAMERA CONTINUES IT'S PAN across the street, \n               to a Coffee Shop with large plate glass windows facing the \n               school. There, standing in the window, watching, is Joanna \n               Kramer. HOLD AS THE CAMERA SLOWLY ZOOMS IN ON HER and we SEE \n               a look of overwhelming pain on her face.\n\n                                                                    CUT TO:\n\n               EXT. PLAYGROUND, CENTRAL PARK \u0096 AFTERNOON\n\n               ON TED AND THELMA\n\n               Sitting on a bench, the area around them is stacked high \n               with toys that the kids have brought with them to the park.\n\n               OFF SCREEN we can HEAR Billy and Kim racing around, playing.\n\n                                     TED\n                              (a little too casual)\n                         Thel, you ever hear from Joanna?\n\n                                     THELMA\n                              (also with deliberate \n                              nonchalance)\n                         Not for a couple of months. The last \n                         time I heard from her she was living \n                         in San Francisco.\n\n                                     TED\n                              (surprised)\n                         California?\n\n                                     THELMA\n                              (watching him)\n                         Uh, huh... She said she had a good \n                         job, was playing a lot of tennis. \n                         She wanted to know all about Billy.\n\n               There is a beat of silence, then:\n\n                                     TED\n                              (the real question)\n                         She ever ask about me?\n\n                                     THELMA\n                              (lying)\n                         Uh, huh... Yeah...\n\n                                     TED\n                         What d'you tell her?\n\n                                     THELMA\n                         I told her you're doing a pretty \n                         good job.\n\n                                     BILLY (O.S.)\n                         Daddy! Daddy!\n\n               Ted glances around:\n\n               HIS POV\n\n               Billy and Kim are standing near the jungle Jim. Billy has a \n               toy airplane in his hand.\n\n                                     BILLY\n                         Daddy, look! Presenting Billy Kramer's \n                         Fantastic Superjet!\n\n               And he begins to race around the area, making jet noises and \n               holding the airplane in his hand.\n\n               REVERSE ON TED\n\n               Watching him, smiling.\n\n               ON BILLY\n\n               Weaving in and around the benches. He turns and starts back \n               towards Ted. As he does:\n\n               QUICK CUT: INSERT:\n\n               Billy's foot, as he trips.\n\n               ON BILLY\n\n               As he starts to fall, still holding onto the airplane.\n\n               QUICK CUT: TED\n\n               Watching, horrified.\n\n               ON BILLY\n\n               As he hits the concrete.\n\n               ON TED\n\n               He leaps to his feet, starts toward the boy.\n\n               ON BILLY\n\n               As he looks up.\n\n               JUMP CUT IN TO EXTREME CLOSEUP\n\n               There is a terrible-looking gash running from his cheek into \n               his hairline.\n\n               Kim screams at the sight of the blood.\n\n                                     BILLY\n                              (terrified)\n                         Daddy!\n\n                                                                    CUT TO:\n\n               EXT. ENTRANCE TO CENTRAL PARK \u0096 AFTERNOON\n\n               ON THE ENTRANCE\n\n               As Ted, carrying Billy, wrapped in his coat, comes barreling \n               out of the park, nearly knocking over several people with \n               shopping bags, and begins running like hell WITH THE CAMERA \n               TRACKING JUST IN FRONT OF HIM. In the BACKGROUND we SEE Thelma \n               and Kim chasing after him. THE LENGTH OF THE TRACKING SHOT \n               SHOULD BE MUCH LONGER THAN WE EXPECT. IT SHOULD, IN FACT, \n               COVER THE THREE CITY BLOCKS BETWEEN THE KRAMER APARTMENT AND \n               THE HOSPITAL, ACROSS STREETS WITHOUT STOPPING FOR THE LIGHT, \n               ALONG CROWDED SIDEWALKS WITHOUT STOPPING, ENDING FINALLY ON \n               THE EMERGENCY ENTRANCE TO THE HOSPITAL. IT MUST BE GENUINELY \n               SUPERHUMAN, GENUINELY HEROIC.\n\n                                                                    CUT TO:\n\n               INT. EXAMINATION ROOM, EMERGENCY SECTION, HOSPITAL \u0096 DAY\n\n               ON TED KRAMER\n\n               He is covered with Billy's blood, it is on his face, his \n               shirt, his trousers. At the moment 'he stands helpless, \n               watching as, Off-Screen, a surgeon examines Billy's wound.\n\n                                     SURGEON (O.S.)\n                              (calm, reassuring)\n                         That's good, Billy... That's a brave \n                         boy... Now then, how's that? Now \n                         we've cleaned it out...\n\n               WIDER SHOT\n\n               Billy lies on the examining table with the doctor bending \n               over him.\n\n                                     SURGEON\n                         There. That wasn't so bad, was it?\n\n               Billy doesn't say anything.\n\n                                     SURGEON\n                         Now then, you just wait here, Billy. \n                         I want to talk to your dad for a \n                         minute.\n\n               The doctor motions for Thelma to wait with Billy and he \n               crosses to Ted who stands in the doorway.\n\n               CLOSER IN ON THEN\n\n                                     SURGEON\n                              (low voice, again \n                              calm and reassuring)\n                         Your boy is very lucky, Mr. Kramer. \n                         One inch over and it would have caught \n                         the eye.\n\n               REACTION TED\n\n                                     SURGEON\n                         But I'm going to have to take some \n                         stitches.\n\n                                     TED\n                              (flat)\n                         How many?\n\n                                     SURGEON\n                         Ten.\n\n               Ted closes his eyes, there is a sharp intake of breath.\n\n                                     SURGEON\n                         Because of the position of the wound \n                         and your son's age, I don't think \n                         there will be much of a scar. \n                         Otherwise I'd call in a plastic \n                         surgeon.\n\n               Ted nods.\n\n                                     SURGEON\n                         Now, I'd advise you to wait outside. \n                         It'll be eas \u0096\n\n                                     TED\n                              (like a shot)\n                         No.\n\n                                     SURGEON\n                              (reasonable)\n                         Mr. Kramer, there's \u0096\n\n                                     TED\n                              (softly, but with \n                              real vehemence)\n                         Fuck you. He's my son. I'm staying \n                         with him.\n\n                                                                    CUT TO:\n\n               CLOSE ON TED\n\n               He holds his son tightly while the doctor stitches up the \n               boy's wound. From THIS CAMERA ANGLE we can SEE Ted's face, \n               but only the back of Billy's head. Although we do not see \n               the stitches being made, we do SEE the doctor's hand, with \n               the needle and surgical thread as it moves into and out of \n               view with a slow, steady rhythm. Billy's hand clutches Ted's \n               so tightly that the knuckles are white.\n\n                                     BILLY\n                              (softly, as each stitch \n                              is taken)\n                         Ohhh... Ohhhh... Ohhhhh...\n\n                                     TED\n                              (whispering to his \n                              child)\n                         It's okay, son... I'm here... Just a \n                         little more to go... Don't worry, \n                         son... I'm here...\n\n                                                             FADE TO BLACK:\n\n               EXT. KRAMER APT. BLDG. \u0096 NIGHT\n\n               WIDE SHOT\n\n               It is late, only a few lights are still on.\n\n                                                                    CUT TO:\n\n               INT. BILLY'S ROOM \u0096 NIGHT\n\n               ON BILLY\n\n               He lies in bed, fast asleep, his head swathed in bandages. \n               THE CAMERA PANS AWAY FROM HIM across to Ted, who sits in a \n               nearby rocking chair, watching his son. HOLD FOR A BEAT, \n               then Ted gets to his feet, walks quietly to the door and \n               steps out into the hall, closing the door behind him.\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 NIGHT\n\n               WIDE SHOT\n\n               Thelma having washed and dried the dishes is now wiping off \n               the top of the counter top, more to keep busy than anything \n               else. She looks around as Ted enters.\n\n                                     THELMA\n                         How is he?\n\n               REVERSE ON TED\n\n               Standing in the doorway. He hasn't changed his clothes and \n               he is still covered with blood.\n\n                                     TED\n                              (nods)\n                         He's okay... Thel, can I ask you a \n                         favor?\n\n                                     THELMA\n                         Sure.\n\n                                     TED\n                         I don't mean a little favor. I mean \n                         a big F favor.\n\n               Thelma nods. She watches Ted closely. He doesn't look at \n               her.\n\n                                     TED\n                         Thelma, if I die \u0096\n\n                                     THELMA\n                              (aghast)\n                         What?\n\n                                     TED\n                              (quickly)\n                         I didn't say I'm going to die, but \n                         if I should \u0096\n\n                                     THELMA\n                              (deeply upset)\n                         Don't say that! I don't want to hear \n                         you say that!\n\n                                     TED\n                              (firmly)\n                         Thel, listen to me. If, on the million \n                         to one shot that I should \u0096\n                              (correcting himself)\n                         That anything should happen to me. \n                         Would you take care of Billy?\n\n                                     THELMA\n                              (amazed)\n                         Me?! You want me to take care of \n                         Billy?!\n\n                                     TED\n                         I thought about it a lot and you're \n                         the only person I know that I trust \n                         with him. I mean, if anything happened \n                         to me, he'd be okay with you. You're \n                         a good mother.\n\n               Silence. Thelma looks away from him.\n\n                                     TED\n                              (hastily)\n                         I know it's not an easy thing to \n                         answer.\n\n               Silence. She still cannot look at him.\n\n                                     TED\n                         Look, if it's too much responsibility \n                         \u0096\n\n               Thelma nods, unable to speak.\n\n                                     TED\n                         You're sure?\n\n               She nods again.\n\n                                     TED\n                         Thank you, Thel. Thank you very much.\n\n                                                                    CUT TO:\n\n               INT. BILLY'S ROOM \u0096 EARLY MORNING\n\n               MEDIUM SHOT ON BILLY\n\n               As he lies in bed asleep. Some time has passed and Billy's \n               bandage is much smaller. HOLD ON HIM as we HEAR OFF SCREEN \n               Sound: From the street below, the regular six-forty-five \n               garbage truck that serves as Billy's alarm clock.\n\n               HOLD ON BILLY\n\n               As he wakes up, struggles to his feet.\n\n               THE CAMERA TRACKS WITH HIM as, eyes closed, he stumbles into \n               the bathroom, pees, and still not remembering to flush the \n               toilet walks into the bedroom and wakes his father. As the \n               child turns and walks toward the kitchen, THE CAMERA HOLDS \n               ON TED. He heaves himself to his feet and, eyes closed, in \n               much the same manner as his son, stumbles into the bathroom. \n               He automatically flushes the toilet without bothering to \n               look, walks into the living room, opens the front door and \n               picks up the paper. As he starts into the kitchen, he meets \n               Billy coming the other way carrying two plates, a doughnut \n               on each.\n\n               THE CAMERA NOW TRACKS WITH BILLY as he walks into the living \n               room, carefully sets the plates on the dining table, crosses \n               to the television set, and turns it on. He returns to the \n               table, and sits down as Ted appears carrying two glasses of \n               orange juice and vitamins. He takes a seat in the chair \n               opposite Billy and opens his paper and starts to read.\n\n               HOLD ON THEM as they sit without talking, eating their \n               breakfast \u0096 the only sound, a children's cartoon program \n               coming from the T.V.\n\n               From time to time Ted glances up from his paper to look across \n               at the cartoon.\n\n               HOLD ON THEM as we SEE that they have become roommates in \n               the best sense of the word.\n\n               EXT. TED'S OFFICE BLDG. \u0096 MIDTOWN \u0096 DAY\n\n               WIDE SHOT\n\n               It is a gray, cloudy day in mid-November. Snow is falling.\n\n               Sound-effect: a telephone ringing. Then:\n\n                                     TED'S VOICE\n                         Hello?\n\n                                     JOANNA'S VOICE\n                         Ted?\n\n                                     TED'S VOICE\n                         Joanna?\n\n                                                                    CUT TO:\n\n               INT. RESTAURANT, ISLE OF CAPRI \u0096 NIGHT\n\n               ON THE DOOR\n\n               As Ted enters, looks around. The Maitre d'hotel approaches. \n               From his attitude, it is clear that Ted and Joanna were \n               regular customers.\n\n                                     MAITRE D'HOTEL\n                         Good evening, Mr. Kramer. We haven't \n                         seen you for a long time. Mrs. Kramer, \n                         she waits for you in the back.\n\n                                     TED\n                         Thank you, John.\n\n               THE CAMERA TRACKS WITH TED as he walks toward the back room \n               of the restaurant. Several waiters approach and say hello, \n               the piano player looks up and smiles. As he reaches the door \n               to the back room.\n\n                                                                    CUT TO:\n\n               INT. BACK ROOM\n\n               TED'S POV \u0096 JOANNA\n\n               She sits against the wall, a glass of white wine in front of \n               her.\n\n               She is dressed simply and no longer has a tan. Nevertheless, \n               Joanna is still stunningly beautiful. HOLD ON HER FOR A BEAT \n               as she looks up, smiles.\n\n               ON TED\n\n               He stands watching her, his knees weak. It is impossible not \n               to fall in love with her all over again.\n\n               TWO SHOT\n\n               As he crosses to her table, sits down.\n\n                                     JOANNA\n                         Hello, Ted. You look well.\n\n                                     TED\n                         So do you.\n\n               The waiter appears, carrying a scotch and soda. He sets it \n               down on the table in front of Ted.\n\n                                     WAITER\n                         The usual, Mr. Kramer.\n\n                                     TED\n                              (not taking his eyes \n                              off Joanna)\n                         Thanks, Gino.\n\n               The waiter nods and promptly disappears.\n\n                                     JOANNA\n                         How's the new job?\n\n                                     TED\n                         Fine.\n\n               There is a self-conscious pause. From the bar, the piano \n               player begins playing a new song. From Ted and Joanna's \n               reaction, it is clearly a song that has meant a great deal \n               to them in the past.\n\n               They listen for a moment, then:\n\n                                     TED\n                         Look at us, Joanna. Just like any \n                         old married couple having dinner. \n                         Who would believe it.\n\n                                     JOANNA\n                         Yes... How's Billy?\n\n               ON TED\n\n               The question he has been dreading.\n\n                                     TED\n                         He's great... except...\n                              (not looking at her)\n                         ...Except he had... he fell and he \n                         cut his face. He... He has a scar, \n                         Joanna, from about here to here.\n                              (indicating where and \n                              how big)\n\n               There is a beat of silence. A moment of shared feeling.\n\n                                     TED\n                              (he has to say it to \n                              someone)\n                         I can't help but feel somehow... \n                         it's my fault. I keep thinking I \n                         could've done something \u0096 stopped \n                         it...\n\n                                     JOANNA\n                         You can't tell it from a distance, \n                         Ted.\n\n               For the first time he looks up at her.\n\n                                     TED\n                         What?\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     JOANNA\n                         I've seen him.\n\n                                     TED\n                         You have?\n\n                                     JOANNA\n                         A few times. Sometimes I sit in that \n                         coffee shop across the street and \n                         watch when you take him to school.\n\n               ON TED\n\n               Speechless.\n\n                                     JOANNA\n                         He looks like a terrific kid.\n\n                                     TED\n                         He is...\n                              (he still can't get \n                              over it)\n                         You sat in that coffee shop across \n                         from school \u0096\n\n                                     JOANNA\n                              (completing the \n                              sentence)\n                         Watching my son... Ted, I've been \n                         living in New York for the past two \n                         months.\n\n                                     TED\n                              (amazed)\n                         You've been living here, in the city?\n\n                                     JOANNA\n                              (a deep breath)\n                         Ted... The reason I wanted to see \n                         you... I want Billy back.\n\n                                     TED\n                         You want what?!\n\n                                     JOANNA\n                              (firm)\n                         I want my son. I'm through sitting \n                         in coffee shops looking at him from \n                         across the street. I want my son.\n\n                                     TED\n                         Are you out of your mind?! You're \n                         the one that walked out on him, \n                         remember?\n\n                                     JOANNA\n                              (trying to explain)\n                         Ted, listen to me... You and I, we \n                         had a really crappy marriage \u0096\n                              (hastily)\n                         Look, don't get so defensive, okay? \n                         It was probably as much my fault as \n                         it was yours... Anyway when I left I \n                         was really screwed up \u0096\n\n                                     TED\n                         Joanna, I don't give a \u0096\n\n                                     JOANNA\n                              (she will be heard)\n                         Ted, all my life I'd either been \n                         somebody's daughter or somebody's \n                         wife, or somebody else's mother. \n                         Then all of a sudden, I was a thirty-\n                         two-year-old, highly neurotic woman \n                         who had just walked out on her husband \n                         and child. I went to California \n                         because that was about as far away \n                         as I could get. Only... I guess it \n                         wasn't far enough. So I started going \n                         to a shrink.\n                              (leaning forward, \n                              very sincere)\n                         Ted, I've had time to think. I've \n                         been through some changes. I've \n                         learned a lot about myself.\n\n                                     TED\n                              (like a shot)\n                         Such as?\n\n               Silence.\n\n                                     TED\n                              (boring in)\n                         Come on, Joanna, what did you learn? \n                         I'd really like to know.\n\n               Silence.\n\n                                     TED\n                              (relentless)\n                         One thing, okay? Just tell me one \n                         goddam thing you've learned.\n\n               There is a beat of silence, then:\n\n                                     JOANNA\n                              (quiet, determined)\n                         I've learned that I want my son.\n\n               ON TED\n\n               He reacts as though he has been slapped.\n\n                                     TED\n                         Joanna, go be a mother. Get married, \n                         have kids. Don't get married, have \n                         kids. Do whatever you want. I don't \n                         give a damn. Just leave me out of it \n                         \u0096 and leave my baby out of it.\n\n                                     JOANNA\n                         Ted, if you can't discuss this \n                         rationally -\n\n                                     TED\n                              (getting to his feet)\n                         Joanna, go fuck yourself!\n\n               And with that he turns on his heels and stalks out of the \n               restaurant.\n\n                                                                    CUT TO:\n\n               INT. LAWYER'S OFFICE \u0096 DAY\n\n               WIDE SHOT\n\n               A large, very plush office: lots of antiques, beautiful \n               nineteenth century paintings on the wall along with \n               autographed photographs of at least three ex-Presidents of \n               the United States. Sitting behind a large and imposing desk \n               is JOHN SHAUNESSY, a handsome, formidable man in his early \n               sixties. He is well-dressed, a cornflower in his buttonhole, \n               that sort of thing. At the moment, Shaunessy leans back in \n               his chair as Ted finishes his story.\n\n                                     TED\n                              (leaning forward, \n                              intense)\n                         Look, she walked out on her own child, \n                         right? That's desertion, right? Mr. \n                         Shaunessy, I'm telling you it's an \n                         open and shut case.\n\n                                     SHAUNESSY\n                         First, there's no such thing as an \n                         open and shut case. Especially where \n                         custody is involved. Got it?\n\n               Ted nods.\n\n                                     SHAUNESSY\n                         Second, the burden is on us to prove \n                         your ex-wife is an unfit mother. \n                         That means I'm going to have to play \n                         rough and, if I play rough, you can \n                         bet they will too. Can you take that, \n                         Mr. Kramer?\n\n               Ted nods.\n\n                                     SHAUNESSY\n                         Third, it'll cost you five thousand \n                         dollars.\n\n               REACTION TED\n\n               That's an astronomical amount of money to him.\n\n                                     SHAUNESSY\n                         That's if we win. If we lose, you \n                         could end up having to pay your wife's \n                         court costs as well.\n\n                                     TED\n                              (determined)\n                         Fine.\n\n                                     SHAUNESSY\n                         Good. You've hired yourself a hell \n                         of a lawyer, Mr. Kramer.\n                              (down to business)\n                         How old is the child?\n\n                                     TED\n                         Six.\n\n               ON SHAUNESSY\n\n               He shakes his head.\n\n                                     SHAUNESSY\n                         That's tough. In most cases involving \n                         a child that young, the court tends \n                         to side with the mother.\n\n               ON TED\n\n               Agitated. This is not what he wanted to hear.\n\n                                     TED\n                         But she signed over custody. Here...\n\n               He digs in his pockets, pulls out a piece of paper and thrusts \n               it at the lawyer.\n\n                                     SHAUNESSY\n                              (glancing at it)\n                         I'm not saying we don't have a shot, \n                         but it won't be easy...\n                              (thinks for a moment)\n                         Mr. Kramer, do me a favor. There is \n                         something I find very helpful in \n                         matters like this. I sit down and \n                         make a list of all the pros and cons \n                         on an issue. I actually write them \n                         down and look at them. I want you to \n                         do that, okay? Then, after that, if \n                         you're really sure you want to retain \n                         custody of your child \u0096 then we'll \n                         go in there and whip their asses.\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 LATE AT NIGHT\n\n               WIDE SHOT\n\n               Ted sits at the dining table, the supper dishes have been \n               pushed aside. He has a legal pad in front of him and is \n               writing. THE CAMERA DOLLIES IN CLOSER.\n\n               INSERT \u0096 TED'S POV\n\n               The legal pad. On one side Ted has written \"Pro\" and on the \n               other, \"Con.\" Underneath \"Con\" Ted has written a long list \n               of the drawbacks involved in keeping Billy: Sex Life, Money, \n               Possibility of Remarriage, Sleep, Emotional Dependence. The \n               \"Pro\" side of the list is empty.\n\n               ON TED\n\n               He sits for a moment, staring at the list, then he crumples \n               the paper, gets to his feet.\n\n                                                                    CUT TO:\n\n               INT. BILLY'S ROOM \u0096 NIGHT\n\n               ON THE DOOR\n\n               As Ted enters. He crosses to Billy's bed where the child is \n               fast asleep, sits down on the edge, and starts to rub the \n               child's back.\n\n                                     TED\n                         I love you Billy Kramer.\n\n                                     BILLY\n                              (half-asleep)\n                         I love you too daddy.\n\n               Ted kisses the child, gets to his feet and starts toward the \n               door.\n\n                                     TED\n                         Sleep tight. Don't let the bedbugs \n                         bite...\n\n                                     BILLY\n                              (almost asleep again)\n                         See you in the morning light...\n\n                                                                    CUT TO:\n\n               INT. O'CONNOR'S OFFICE \u0096 DAY\n\n               WIDE SHOT\n\n               O'Connor stands with his back to Ted, looking out the window. \n               From the beginning this is clearly an awkward and unpleasant \n               moment.\n\n                                     O'CONNOR\n                              (scared to do what he \n                              is about to do)\n                         Look, ah... Ted. I just got word \n                         from the guys at Revlon and... ah \n                         they did some marketing tests on our \n                         campaign and the results were...\n\n               CLOSE ON TED\n\n               Hold on him listening as it slowly dawns on him that he is \n               being fired.\n\n                                     O'CONNOR\n                              (stiff)\n                         Disappointing. It only pulled a \n                         fourteen share and they were hoping \n                         for a twenty five minimum, and... \n                         ah... they're not very happy and... \n                         Well, the guys have decided they \n                         want to... ah, re-think the entire \n                         concept and... Look, I don't like \n                         having to do this, okay?... But... I \n                         mean, what I mean is... ah, I'm going \n                         to have to... ah, let you go \u0096\n\n                                     TED\n                              (not really sure he \n                              heard right)\n                         Are you firing me, Jim?\n\n               ON O'CONNOR\n\n               He still has his back to Ted.\n\n                                     O'CONNOR\n                         C'mon, Ted, don't get emotional. \n                         Okay?\n                              (whining)\n                         Look, this isn't exactly an easy \n                         thing for me to do, y'know? I swear \n                         Murray and I did everything we could, \n                         but those sons of bitches were out \n                         for blood. I mean it was all I could \n                         do to keep the account inside the \n                         shop... Look, I promise, if I hear \n                         of anything I'll let you know first \n                         thing.\n\n               Ted, I want \u0096 O'Connor looks around.\n\n                                     O'CONNOR\n                         Ted?...\n\n               HIS POV\n\n               The room is empty, the door stands open and Ted is gone.\n\n                                     O'CONNOR'S VOICE\n                         Ted?...\n\n                                                                    CUT TO:\n\n               INT. TED'S OFFICE \u0096 DAY\n\n               WIDE SHOT\n\n               As Ted grabs a picture of Billy from his desk, takes his \n               jacket and coat and stalks out the door.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               TRACKING ALONGSIDE TED\n\n               As he walks along the street in a state of total shock. Behind \n               him, in the windows of expensive stores we note Christmas \n               decorations.\n\n                                                                    CUT TO:\n\n               INT. INTERVIEW ROOM, EMPLOYMENT AGENCY \u0096 DAY\n\n               WIDE SHOT\n\n               Ted sits across from the interviewer, a polished young man \n               in his middle twenties, very efficient, he sounds a bit like \n               a tape recording.\n\n                                     INTERVIEWER\n                              (glancing at a form \n                              Ted has filled out)\n                         Ummm, hmmm... umm, hmmm...\n                              (the good news)\n                         Well, this looks very good.. Of course\n                              (the bad news)\n                         ...you understand this is the worst \n                         time of the year to look for a job.\n\n                                     TED\n                              (panic)\n                         What?! What do you mean, I don't \n                         understand.\n\n                                     INTERVIEWER\n                              (patronizing)\n                         Mr. Kramer, nobody even thinks about \n                         leaving their job until after they \n                         get their Christmas bonus.\n\n                                     TED\n                         Look, you don't understand. I need a \n                         job. I've got a kid and \u0096\n\n                                     INTERVIEWER\n                              (smooth)\n                         I understand and I'm absolutely sure \n                         something wonderful will turn up...\n                              (ending any further \n                              discussion)\n                         ...after the first of the year.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON A TELEPHONE BOOTH\n\n               Ted stands inside, talking on the phone. AS THE CAMERA DOLLIES \n               IN CLOSER, he hangs up the receiver and takes the employment \n               section of the New York Times which is filled with listings \n               he has circled and crosses off one. He goes on to the next, \n               takes a dime from the stack on the shelf in front of him and \n               starts to dial.\n\n                                                                    CUT TO:\n\n               EXT. TED KRAMER'S APT. HOUSE \u0096 EVENING\n\n               ESTABLISHING SHOT\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 NIGHT\n\n               ON TED\n\n               Who stands at the sink doing the last of the dishes. A \n               dishtowel is tucked into his belt, serving as an apron. HOLD \n               ON HIM as we HEAR:\n\n               Sound-effect: The phone ringing.\n\n               Ted wipes his hands, picks up the phone.\n\n                                     TED\n                         Uh, huh?\n\n                                     SECRETARY'S VOICE\n                              (from the phone)\n                         Mr. Kramer? Please hold for Mr. \n                         Shaunessy...\n\n               Then, a moment later:\n\n                                     SHAUNESSY'S VOICE\n                         Ted? They've set the court date. I \n                         just heard today... It's...\n                              (checking his notes)\n                         January sixth.\n\n                                     TED\n                              (despair)\n                         Oh, Christ.. .John, there's some- \n                         thing I ought to tell you. My... ah, \n                         situation has... changed. I lost my \n                         job.\n\n               There is a long pause, too long.\n\n                                     TED\n                         John?\n\n                                     SHAUNESSY'S VOICE\n                              (thoughtfully)\n                         Ted, I won't lie to you, we don't \n                         have a hope in hell of winning a \n                         custody hearing if you're out of \n                         work.\n\n               Ted doubles over the phone like he has been hit in the \n               stomach.\n\n                                     TED\n                              (softly, but with \n                              real feeling)\n                         Good Christ, Joanna, just get the \n                         hell out of my life.\n\n                                     SHAUNESSY'S VOICE\n                         Ted? Are you there?\n\n                                     TED\n                         Yeah.\n\n                                     SHAUNESSY'S VOICE\n                         Any prospects?\n\n                                     TED\n                              (trying to make himself \n                              believe it)\n                         Don't worry. I plan to have something \n                         within twenty-four hours, John.\n\n                                     SHAUNESSY'S VOICE\n                              (amazed)\n                         How the hell are you going to do \n                         that?\n\n                                     TED\n                              (grim)\n                         I don't know.\n\n               INT. INTERVIEW ROOM \u0096 EMPLOYMENT AGENCY \u0096 DAY\n\n               WIDE SHOT\n\n               The same young man sits across the desk from Ted.\n\n                                     INTERVIEWER\n                              (smirk)\n                         Mis-ter Kramer, as I mentioned \n                         yesterday, this is a very bad time \n                         of year to look for work. Now I'm \n                         sure we'll have something for you by \n                         mid-February, March at the latest.\n\n               CLOSE ON TED\n\n               Leaning forward, impatient.\n\n                                     TED\n                         I need a job, now.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n               The interviewer gives Ted a weary look. Then he starts to \n               flip through the card file.\n\n                                     INTERVIEWER\n                              (going through the \n                              motions)\n                         No... No... No...\n\n               Finally he pauses at one card, pulls it out.\n\n                                     INTERVIEWER\n                              (doubtfully)\n                         There might be something at J. Walter \n                         Thompson. But...\n                              (shaking his head)\n                         ...I don't think they're really \n                         serious. The position's been open \n                         for two months and...\n                              (shrugs)\n                         They may just be on a fishing \n                         expedition.\n                              (cheerful)\n                         I'm sure you'll be much happier if \n                         you wait until after the first \u0096\n\n                                     TED\n                              (checking his watch)\n                         Call up the people at J. Walter \n                         Thompson. Set up an appointment at \n                         four.\n\n                                     INTERVIEWER\n                              (politeness strained \n                              almost to the breaking \n                              point)\n                         Mis-ter Kramer, it's...\n                              (checking his watch)\n                         ...almost four now. It's the Friday \n                         before Christmas. Nobody is going to \n                         want to \u0096\n\n                                     TED\n                              (leaning forward, \n                              tough as nails)\n                         Either you call and set up the \n                         appointment, or I'll call. And if I \n                         call, you lose the commission.\n\n                                     INTERVIEWER\n                              (arch)\n                         My, we are a hot shot aren't we?\n\n               Ted is already on his feet and halfway out the door.\n\n                                     TED\n                         You bet your ass.\n\n                                                                    CUT TO:\n\n               INT. OFFICE ADVERTISING MANAGER, J. WALTER THOMPSON \u0096 LATE \n               AFTERNOON\n\n               It is dark outside and the lights are on in the office. From \n               beyond the door, we can hear the sounds of a Christmas office \n               party in full swing.\n\n               ON JACK ACKERMAN\n\n               The advertising manager. A balding man in his mid-forties, \n               he wears a suit, complete with vest. At the moment he sits \n               behind his desk listening to Ted's spiel, from time to time \n               he glances at the resume on the desk in front of him.\n\n                                     TED (O.S.)\n                         So, Mr. Ackerman, as you can see \n                         from my resume, my experience in \n                         setting up the leisure package concept \n                         means that I've spent a lot of time \n                         working along the same lines as your \n                         multiple buys and your regional \n                         advertising ideas. I know the \n                         pitfalls, but \u0096 and this is more \n                         important \u0096 I know the potential \n                         revenue for the company inherent in \n                         these programs.\n\n               ON TED\n\n               As he finishes. He sits back, pleased with himself.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     ACKERMAN\n                         Well, Mr. Kramer, I must say this \n                         has been very impressive. I'd like \n                         to think about it and get back to \n                         you.\n\n                                     TED\n                              (leaning forward)\n                         Mr. Ackerman, is there anyone else \n                         that I should see before you come to \n                         a decision.\n\n                                     ACKERMAN\n                         Mr. Spencer, our Advertising Director.\n\n                                     TED\n                              (no time to waste)\n                         Could I see him right away?\n\n                                     ACKERMAN\n                              (taken aback)\n                         I'm sorry, but he's leaving this \n                         evening for a two-week vacation. \n                         I'll set up something the moment he \n                         gets back.\n\n               He gets to his feet, starts to shake Ted's hand, ready to \n               end the interview.\n\n                                     TED\n                         I'd like to see him now \u0096 before he \n                         leaves.\n\n                                     ACKERMAN\n                         Mr. Kramer, I don't think \u0096\n\n                                     TED\n                              (means it)\n                         I want this position very much.\n\n               Ackerman gives Ted a long, considered look, then:\n\n                                     ACKERMAN\n                         Wait here.\n\n               He turns and goes out the door.\n\n                                                                    CUT TO:\n\n               INT. OUTER OFFICE, J. WALTER THOMPSON \u0096 LATE AFTERNOON\n\n               The large room is crowded with secretaries, junior executives, \n               researchers, editors, ad-men, etc., etc. They all have drinks \n               in their hands and there is a good deal of kissing and general \n               conviviality going on.\n\n               THE CAMERA TRACKS WITH ACKERMAN as he steps out of his office, \n               closes the door behind him and makes his way across the room \n               to MR. SPENCER, the Advertising Director. At the moment, \n               Spencer stands with his coat over one arm and a drink in his \n               hand talking to a very pretty young woman. Ackerman approaches \n               him, whispers something in his ear. Spencer shakes his head \n               and points to his watch. Ackerman says something else and \n               finally, with a look of weary resignation, Spencer excuses \n               himself from the pretty young woman and follows Ackerman \n               back to his office. THE CAMERA FOLLOWS THEM. As Ackerman \n               opens the door to his office, THE CAMERA IS ANGLED so that \n               we can SEE past them, into the office where Ted stands \n               waiting.\n\n                                     ACKERMAN\n                              (as they enter)\n                         Mr. Spencer, Mr. Kramer.\n\n                                     SPENCER\n                              (not wasting any time)\n                         So you're the go-getter. All right, \n                         you've got ten minutes.\n\n               As the door closes behind them, blocking our view, THE CAMERA \n               PANS UP to a clock over the door. It reads five-fifteen.\n\n                                                         MATCH DISSOLVE TO:\n\n               INT. ACKERMAN'S OFFICE \u0096 LATE AFTERNOON\n\n               ON A CLOCK\n\n               Which now reads five twenty-two. THE CAMERA PULLS BACK TO \n               REVEAL Spencer, now sitting in Ackerman's chair, his feet on \n               Ackerman's desk. Ted has just finished his pitch.\n\n                                     SPENCER\n                              (sipping his drink)\n                         That's very interesting, Mr. Kramer. \n                         I must say, it's very interesting. \n                         Let me think about it. I'll let \n                         Jack...\n                              (indicating Ackerman)\n                         ...know and he'll get in touch with \n                         you.\n\n               Spencer gets to his feet, starts to retrieve his coat.\n\n               ON TED\n\n               As he decides to take a gamble.\n\n                                     TED\n                         Excuse me, I believe you said I had \n                         ten minutes.\n\n               ON SPENCER\n\n               Almost at the door, looking around.\n\n                                     SPENCER\n                         Well?\n\n               ON TED\n\n               Checking his watch.\n\n                                     TED\n                         That means I've got two minutes left. \n                         I understand you're paying twenty-\n                         five.\n\n               Spencer nods.\n\n                                     TED\n                              (a deep breath, then \n                              a real huckster)\n                         All right, I'll tell you what I'm \n                         gonna do \u0096 I'll take the job at twenty-\n                         two-five. Now, that's twenty-five \n                         hundred less than you're offering. \n                         The only thing is, you have to say \n                         yes right now. Not tomorrow. Not \n                         next week. Not after the holidays. \n                         It's worth it to me for a yes right \n                         now and I'll take twenty-five hundred \n                         less.\n\n               There is a long beat of silence as Spencer and Ackerman look \n               at one another. They were clearly not prepared for this.\n\n                                     TED\n                              (watching them)\n                         Today only. One day only. Twenty-two \n                         five.\n\n                                     SPENCER\n                         Mr. Kramer, can we talk privately \n                         for a moment?\n\n                                     TED\n                         Certainly.\n\n                                                                    CUT TO:\n\n               OUTER OFFICE \u0096 LATE AFTERNOON\n\n               ON TED\n\n               As he steps out of Ackerman's office, sits down. Now, all of \n               the fear, all of the anxiety that he has been fighting down \n               comes welling up. What if he pushed too hard? What will he \n               do if he doesn't get a job? If Ted Kramer could fall to his \n               knees and pray, he would.\n\n               CROSS-CUT WITH THE CHRISTMAS PARTY\n\n               That swirls around him. We notice in particular, one very \n               pretty young woman flirting with a number of men. She is \n               wearing a dress with straps, one of them has broken and she \n               has patched it with a piece of masking tape.\n\n               Finally the door to Ackerman's office opens and he steps \n               out.\n\n                                     ACKERMAN\n                         Mr. Kramer?\n\n               Ted jumps to his feet, starts into the office.\n\n                                                                    CUT TO:\n\n               INT. ACKERMAN'S OFFICE \u0096 LATE AFTERNOON\n\n               ON SPENCER\n\n               He looks at Ted carefully for a long time, then:\n\n                                     SPENCER\n                              (grins)\n                         Welcome aboard, Mr. Kramer.\n\n               CLOSEUP TED\n\n               There is an instant of relief, then, with astounding cool:\n\n                                     TED\n                         Well, gentlemen, I'm pleased to be \n                         with you.\n\n               ANOTHER ANGLE\n\n               As they shake hands, say their good-byes. THE CAMERA TRACKS \n               WITH TED as he makes his way through the Christmas party \n               that is still going strong. Then, suddenly, as he passes the \n               very pretty woman we noticed earlier, he turns and kisses \n               her.\n\n               QUICK CUTS\n\n               As a look passes between them, a sudden chemistry, something \n               we have not seen in Ted before.\n\n                                     TED\n                              (steps back from the \n                              astounded girl, grins)\n                         Merry Christmas.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON A BUS\n\n               As it pulls to a stop, the doors open and, along with the \n               usual flood of mothers and children we SEE Ted and Billy. \n               THE CAMERA TRACKS WITH THEM as they walk to school. Billy is \n               talking a mile a minute, describing in minute detail the \n               plot of an episode of \"I Dream of Jeannie.\" Ted listens \n               intently, then, almost involuntarily, he glances over his \n               shoulder in the direction of the Coffee Shop.\n\n               HIS POV\n\n               There, standing in the window, watching, is Joanna.\n\n               ON TED AND BILLY\n\n               As they continue to walk. Ted's eyes remain on Joanna. As \n               they reach the door to the school, Ted looks at his son.\n\n                                     TED\n                              (kissing Billy goodbye)\n                         You're a terrific kid, Billy Kramer.\n\n               He stands watching as Billy rushes off into the building. \n               Then he turns back and once again looks in the direction of \n               the Coffee Shop.\n\n               HIS POV\n\n               This time there is no one there.\n\n                                                                    CUT TO:\n\n               EXT. KRAMER APT. BLDG. \u0096 NIGHT\n\n               ESTABLISHING SHOT\n\n               HOLD FOR A BEAT as we HEAR:\n\n               OFF SCREEN Sound: A telephone ringing. Then, a moment later:\n\n                                     TED'S VOICE\n                         Hello?\n\n                                     SHAUNESSY'S VOICE\n                         Ted? John Shaunessy here. I just got \n                         a call from your wife's lawyer. She \n                         wants to see the kid.\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 KRAMER APT. \u0096 NIGHT\n\n               Ted Kramer, the phone cradled against his ear is cleaning up \n               the remains of one of Billy's attempts to make the perfect \n               peanut butter sandwich.\n\n               CLOSE ON TED\n\n               Horrified.\n\n                                     TED\n                         What?! She wants what?!\n\n                                     SHAUNESSY'S VOICE\n                              (he's been through \n                              this a million times)\n                         She's the mother. That means she's \n                         within her legal rights.\n\n                                     TED\n                              (agitated)\n                         John, what if she kidnaps him. I've \n                         heard all these \u0096\n\n                                     SHAUNESSY\n                              (the patience of a \n                              saint)\n                         Look, Ted, I don't honestly think \n                         she would go to the trouble of suing \n                         you for custody of the child if she \n                         was planning on kidnapping him.\n\n                                     TED\n                              (doubtful)\n                         I don't know, John... I mean, to be \n                         brutally honest, I'm not so sure \n                         what kind of mental shape Joanna's \n                         in right now. Y'know she admitted \n                         she was seeing a shrink.\n\n                                     SHAUNESSY'S VOICE\n                              (a flicker of interest)\n                         You ever see her talk to the walls?\n\n                                     TED\n                         No, but \u0096\n\n                                     SHAUNESSY'S VOICE\n                         Then you don't have a choice. Have \n                         Billy at the Seventy-Fifth Street \n                         entrance to Central Park, Saturday \n                         at ten.\n\n                                                                    CUT TO:\n\n               EXT. FIFTH AVE. SIDE OF CENTRAL PARK \u0096 DAY\n\n               ON TED AND BILLY\n\n               TRACKING IN FRONT OF THEM as they walk along the Central \n               Park side of Fifth Ave. From their attitude it is clear that \n               each of them, for their own reasons, is very nervous.\n\n               TED'S POV \u0096 TRACKING FORWARD\n\n               About half a block away Joanna paces back and forth. She \n               hasn't seen them and it is clear that she is as nervous as \n               they are.\n\n               ANOTHER ANGLE ON TED AND BILLY\n\n               Ted stops, turns to Billy and gives him a last-minute check. \n               Then, spotting a smudge he takes his handkerchief, spits on \n               it and wipes the child's chin. Now satisfied, he takes Billy's \n               hand and they continue. Suddenly:\n\n               CLOSEUP BILLY\n\n               As he spots his mother.\n\n                                     BILLY\n                         Mommy!\n\n               QUICK CUT: JOANNA\n\n               As she turns, spots Billy, starts to run.\n\n               ON BILLY\n\n               TRACKING WITH HIM as he lets go of Ted's hand and starts to \n               run flat out toward his mother. She kneels, opens her arms \n               wide for him and he goes barreling into her, almost knocking \n               her down from the impact.\n\n                                     JOANNA\n                              (somewhere between \n                              laughter and tears)\n                         Oh, Billy... Oh my Billy... Oh my \n                         son...\n\n               WIDER SHOT\n\n               Joanna gets to her feet and takes Billy's hand.\n\n                                     JOANNA\n                              (to Ted, but looking \n                              at Billy)\n                         I'll have him back at six.\n\n               And they start off in the opposite direction.\n\n               ON TED\n\n               Realizing that Billy has not said good-bye, has not looked \n               at him once.\n\n                                                               JUMP CUT TO:\n\n               WIDER SHOT\n\n               Ted stands helpless, watching them leave.\n\n                                                               JUMP CUT TO:\n\n               WIDER SHOT\n\n               Ted, now almost lost from view on the crowded street, still \n               hasn't moved.\n\n                                                             FADE TO BLACK:\n\n               WIDE SHOT\n\n               Ted and Phyllis, getting ready to go to bed. They look like \n               a couple that has been married at least five years. Ted is \n               busy talking as he takes off his tie, jacket and starts to \n               unbutton his shirt. Phyllis is getting undressed also, hanging \n               things in the closet, putting things away in drawers. But as \n               Ted continues to talk, she watches him apprehensively, it is \n               clear that something is wrong.\n\n                                     TED\n                              (he has become an \n                              armchair lawyer)\n                         So, naturally, you assume that since \n                         Joanna left, that would be a \n                         compelling point against her, right?\n\n                                     PHYLLIS\n                              (thoughtful)\n                         Right.\n\n                                     TED\n                         But it doesn't work that way. A major \n                         decision was handed down by the \n                         Appellate Court in 1969 \u0096 in the \n                         case of Haskins vs. Haskins.\n\n                                     PHYLLIS\n                         Kramer \u0096\n\n                                     TED\n                         Now in Haskins vs. Haskins the court \n                         ruled in favor of the mother, thus \n                         establishing a precedent for awarding \n                         the child to the mother even though \n                         she previously abandoned the baby.\n\n                                     PHYLLIS\n                         Kramer... There's something I ought \n                         to tell you.\n\n                                     TED\n                         Yeah?\n\n                                     PHYLLIS\n                         I've been offered a job in Washington \n                         with H.E.W.\n\n               CLOSE ON TED\n\n               He stops what he is doing, turns to her.\n\n                                     TED\n                         And?\n\n                                     PHYLLIS\n                              (a deep breath)\n                         I'm going to take it.\n\n               REACTION \u0096 TED\n\n               He sits down on the bed.\n\n                                     PHYLLIS\n                         It's a very good job \u0096 too good to \n                         pass up. I'll be handling funding \n                         for the whole...\n                              (she stops, sits beside \n                              him on the bed)\n                         Look, I...\n                              (she means love)\n                         ...\"like\" you a lot. And you...\n                              (she means love)\n                         ...\"like\" me, okay? Maybe if it was \n                         a year from now, maybe things would \n                         be different...\n\n                                     TED\n                              (quiet)\n                         But it's not a year from now, is it?\n\n               She shakes her head, then, reaches out and touches him.\n\n                                     PHYLLIS\n                         I'll miss you, Kramer...\n\n               INT. KRAMER APT. \u0096 DAY\n\n               ON THE FRONT DOOR\n\n               It is open and standing in the doorway is an attractive woman, \n               a bit overweight and very serious. This is DR. ALVAREZ, the \n               court appointed psychiatrist.\n\n                                     ALVAREZ\n                         Mr. Kramer?\n\n                                     TED\n                         Yes?\n\n                                     ALVAREZ\n                         I'm Dr. Alvarez, Judge Atkins asked \n                         me to look in on your son and prepare \n                         an evaluation sheet.\n\n                                     TED\n                         Oh, yes. Won't you come in.\n\n               Dr. Alvarez enters the apartment. Ted helps her off with her \n               coat.\n\n                                     ALVAREZ\n                         Where is the child?\n\n                                     TED\n                         He's in his room, playing.\n\n                                     ALVAREZ\n                         Good. I'll see him in there.\n\n               As Ted carries her coat to the closet, Dr. Alvarez walks \n               into the living room, looks around.\n\n                                     ALVAREZ\n                         Mr. Kramer, do you ever have sex in \n                         here with anyone?\n\n                                     TED\n                         Doctor, I attempt to conduct my social \n                         life discreetly. At the moment I am \n                         seeing no one.\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     ALVAREZ\n                         Does that distress you?\n\n                                     TED\n                         Not particularly.\n\n                                     ALVAREZ\n                         What does?\n\n                                     TED\n                         The prospect of losing my child.\n\n                                     ALVAREZ\n                              (makes some notes, \n                              then:)\n                         Very well, I'd like to see him if I \n                         may.\n\n               They cross to the door of Billy's room. Ted opens it.\n\n               INT. BILLY'S ROOM \u0096 DAY\n\n               THEIR POV\n\n               The room is a mess, blocks are stacked everywhere. Billy \n               sits in the middle playing with his toys.\n\n               ON TED AND DR. ALVAREZ\n\n               They stand in the doorway.\n\n                                     TED\n                         Billy. This is Dr. Alvarez. She would \n                         like to talk to you.\n\n                                     BILLY\n                              (looking up from his \n                              toys)\n                         Sure.\n\n               There is an awkward pause as Ted remains in the doorway.\n\n                                     DR. ALVAREZ\n                              (pointedly)\n                         I'd like to talk to Billy privately.\n\n                                     TED\n                              (embarrassed at being \n                              caught)\n                         Oh, yeah...\n\n               Reluctantly, Ted leaves, closing the door behind him.\n\n               THE CAMERA TRACKS WITH HIM as he crosses the living room to \n               the couch where he has a stack of legal books and a number \n               of note pads spread out. He is obviously continuing his legal \n               education.\n\n               THROUGH OUT THE FOLLOWING, THE CAMERA REMAINS ON HIS FACE.\n\n                                     ALVAREZ (O.S.)\n                         What do you have here, Billy?\n\n                                     BILLY (O.S.)\n                         Detroit.\n\n                                     ALVAREZ (O.S.)\n                         Have you ever been to Detroit?\n\n                                     BILLY (O.S.)\n                         No. But I've been to Brooklyn.\n\n                                     ALVAREZ (O.S.)\n                         I see you have people there. What \n                         are their names?\n\n                                     BILLY (O.S.)\n                         That's Kim... and this one's Thelma \n                         and that's Mrs. Willewska and this \n                         is daddy and that's Batman and over \n                         there is Robin.\n\n                                     ALVAREZ (O.S.)\n                         What about your mommy?\n\n                                     BILLY (O.S.)\n                         Oh, sure. Here, this can be mommy.\n\n                                     ALVAREZ (O.S.)\n                         Do you like to be with your mommy?\n\n               Ted by now has given up all pretense of working. He wags his \n               pencil in the direction of the door.\n\n                                     TED\n                              (the defense attorney)\n                         Objection. You're leading the witness.\n\n                                     BILLY (O.S.)\n                         Sure.\n\n                                     ALVAREZ (O.S.)\n                         What do you like best about her?\n\n                                     BILLY (O.S.)\n                         Lunch in a restaurant.\n\n                                     ALVAREZ (O.S.)\n                         What do you like best about your \n                         daddy?\n\n                                     BILLY (O.S.)\n                         Playing.\n\n                                     ALVAREZ (O.S.)\n                         Tell me, does your daddy ever hit \n                         you?\n\n               REACTION \u0096 TED\n\n               Eyes wide. He starts to get up.\n\n                                     TED\n                         Objection.\n\n                                     BILLY (O.S.)\n                         Sure. Lots of times.\n\n               This brings Ted all the way to his feet. He starts across \n               the living room headed for the door to Billy's room.\n\n                                     ALVAREZ (O.S.)\n                              (interested)\n                         When does he hit you?\n\n               Ted has his hand on the doorknob, about to enter.\n\n                                     BILLY (O.S.)\n                         He hits me on the planet Kriptarium, \n                         when I steal the buried treasure \n                         from the famous peanut butter factory.\n\n                                     ALVAREZ (O.S.)\n                         In real life when does he hit you?\n\n                                     BILLY (O.S.)\n                              (laughing)\n                         My daddy doesn't hit me, silly. Why \n                         would my daddy hit me?\n\n                                                                    CUT TO:\n\n               EXT. MODERN OFFICE BUILDING, MIDTOWN \u0096 DAY\n\n               WIDE SHOT\n\n               It is a Saturday afternoon. HOLD FOR A BEAT as we SEE Ted \n               Kramer and Billy approaching. Billy is talking a mile a \n               minute. Ted listens intently, absorbed in the boy's \n               description. As they turn into the entrance of the office \n               building:\n\n               INT. CORRIDOR, J. WALTER THOMPSON \u0096 DAY\n\n               WIDE SHOT\n\n               A long corridor with desks for secretaries lined up next to \n               doors leading to smaller individual offices. As they approach \n               a door in the foreground that bears a small sign reading, \n               \"Ted Kramer\":\n\n                                     TED\n                              (interrupting Billy, \n                              who is still in the \n                              middle of his story)\n                         See. That's my name.\n\n                                     BILLY\n                              (looking at the sign)\n                         It's my name too.\n\n                                     TED\n                         Right.\n\n               As he opens the door:\n\n                                                                    CUT TO:\n\n               INT. TED KRAMER'S OFFICE \u0096 DAY\n\n               It is a pleasant enough office, but nothing spectacular, \n               windows that look out over Fifty-seventh Street, simple \n               Formica furniture, that sort of thing.\n\n               ON THE DOOR\n\n               As they enter.\n\n                                     BILLY\n                              (he stops dead in his \n                              tracks at the sight \n                              of the office)\n                         Wow!\n\n                                     TED\n                              (pleased)\n                         You like it?\n\n               Billy crosses to the window, presses his nose to the glass, \n               looks out.\n\n                                     BILLY\n                         Wow! Is this really where you work?\n\n               Ted nods, walks over to the desk and begins collecting \n               paperwork to do over the weekend. As he does, Billy goes \n               through the office, sitting in every chair, looking in every \n               drawer.\n\n                                     BILLY\n                         Is this really your desk?\n\n                                     TED\n                         Yep.\n\n                                     BILLY\n                         Is that really your chair?\n\n                                     TED\n                         Uh huh...\n\n                                     BILLY\n                         Wow! That's neat. Can I sit in it?\n\n                                     TED\n                         Sure.\n\n               Billy plops himself down in Ted's chair, swivels around.\n\n                                     BILLY\n                         Did mommy ever see this?\n\n                                     TED\n                         No, she never did.\n\n                                     BILLY\n                         Are you going to get remarried?\n\n                                     TED\n                         I don't know. I hadn't thought much \n                         about it.\n\n                                     BILLY\n                         Are you going to remarried Phyllis?\n\n                                     TED\n                              (shaking his head)\n                         No.\n\n               CLOSE ON BILLY\n\n               There is a long pause, then:\n\n                                     BILLY\n                         Will you and mommy get remarried?\n\n               Ted stops what he is doing, looks across at Billy:\n\n                                     TED\n                         No, son. Daddy and mommy will never \n                         get remarried.\n\n                                     BILLY\n                              (looking around Ted's \n                              office)\n                         Boy, I bet you if mommy ever saw \n                         this she'd remarried you.\n\n                                                                    CUT TO:\n\n               INT. BEDROOM \u0096 VERY EARLY IN THE MORNING\n\n               CLOSE ON AN ALARM CLOCK THAT SITS ON A NIGHTSTAND\n\n               As it rings, THE CAMERA PANS ACROSS and we SEE Joanna sitting \n               in bed wide awake, smoking. As she puts out the cigarette \n               she has been smoking and starts to get out of bed,\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 TED KRAMER'S APT. \u0096 EARLY MORNING\n\n               ON TED\n\n               Who stands with a cup of coffee in his hands, looking out \n               the window, but not seeing anything. HOLD FOR A BEAT, then \n               he checks his watch and starts for the bedroom.\n\n                                                                    CUT TO:\n\n               INT. JOANNA'S BEDROOM \u0096 MORNING\n\n               ON JOANNA\n\n               As she selects a very conservative suit from her closet.\n\n                                                                    CUT TO:\n\n               INT. BILLY KRAMER'S BEDROOM \u0096 MORNING\n\n               WIDE SHOT\n\n               As Ted, now fully dressed, wearing a dark blue suit, white \n               shirt, conservative tie, leans over Billy and wakes him.\n\n                                                                    CUT TO:\n\n               INT. COFFEE SHOP \u0096 MORNING\n\n               Joanna sits across from her lawyer as he talks to her, \n               intently, giving her last-minute instructions.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 MORNING\n\n               ON TED KRAMER\n\n               Taking Billy to school. They stop at the entrance, Ted kisses \n               his son good-bye and stands for a moment watching as the boy \n               runs into the building.\n\n                                                                    CUT TO:\n\n               EXT. COURTHOUSE \u0096 DAY\n\n               WIDE SHOT\n\n               It is a bleak January morning, the streets around the \n               courthouse are mobbed with people on their way to work. We \n               SEE Ted Kramer, a tiny figure among hundreds, coming out of \n               the subway. He crosses the street and starts up the steps of \n               the large and forbidding courthouse.\n\n                                                                    CUT TO:\n\n               INT. COURTHOUSE \u0096 DAY\n\n               WIDE SHOT\n\n               As Ted gets off the elevator and starts down the corridor, \n               toward the courtroom. In the f.g., \u0096 standing by the door of \n               the courtroom itself is John Shaunessy, he greets Ted, they \n               shake hands and talk together for a moment. Then, as they \n               enter the courtroom:\n\n                                                                    CUT TO:\n\n               INT. COURTROOM\n\n               ON THE DOOR\n\n               As Ted enters, looks around. Mrs. Willewska sits in one of \n               the back rows, wearing her best Easter hat. Ted pauses by \n               her, thanks her for coming.\n\n               Several rows in front of her is Thelma. Ted crosses to her, \n               they talk quietly between themselves for a few moments. Then \n               Ted moves on to a table at the front of the room where John \n               Shaunessy waits.\n\n               ON THE DOORS AT THE BACK OF THE COURTROOM\n\n               As they swing open and Joanna, along with her lawyer, a MR. \n               GRESSEN. THE CAMERA PANS WITH THEM as they walk to the front \n               of the room and take their seats at the table opposite Ted \n               and his lawyer.\n\n                                     CLERK\n                         Oyez, oyez... The third Circuit Court \n                         of the State of New York, Judge Atkins \n                         presiding is now in session. All \n                         rise...\n\n               WIDE SHOT\n\n               As the judge enters, takes his seat.\n\n               Opening business of the court.\n\n               WIDE SHOT\n\n               As Gressen (Joanna's lawyer) gets to his feet.\n\n                                     GRESSEN\n                         Your honor. As our first witness I \n                         would like to call Joanna Kramer.\n\n               TWO SHOT \u0096 TED AND SHAUNESSY\n\n               The lawyer leans across to Ted.\n\n                                     SHAUNESSY\n                              (stage whisper)\n                         Real direct. Motherhood... They're \n                         going right for the throat.\n\n               WIDE SHOT\n\n               As Joanna gets to her feet, crosses to the witness stand and \n               is sworn in.\n\n               Note: Throughout the following, we continually CROSS-CUT to \n               Ted Kramer, leaning forward, listening intently. It becomes \n               evident that, in spite of himself, there are moments he feels \n               great compassion for Joanna.\n\n                                     GRESSEN\n                         Now then, Mrs. Kramer, would you \n                         tell the court how long you were \n                         married?\n\n                                     JOANNA\n                         Six years.\n\n                                     GRESSEN\n                         And would you describe those years \n                         as happy?\n\n                                     JOANNA\n                         The first couple, yes, but after \n                         that it became increasingly difficult.\n\n                                     GRESSEN\n                         Mrs. Kramer, did you ever work in a \n                         job while you were married to your \n                         ex-husband?\n\n                                     JOANNA\n                         No, I did not.\n\n                                     GRESSEN\n                         Did you wish to?\n\n                                     JOANNA\n                         Yes. I tried to talk to Ted \u0096 my ex-\n                         husband \u0096 about it, but he wouldn't \n                         listen. He refuses to discuss it in \n                         any serious way. I remember one time \n                         he said I probably couldn't get a \n                         job that would pay enough to hire a \n                         baby-sitter for Billy.\n\n                                     GRESSEN\n                         Tell me, Mrs. Kramer, are you employed \n                         at the present time?\n\n                                     JOANNA\n                         Yes, I work for Jantzen as a \n                         sportswear designer.\n\n                                     GRESSEN\n                         And what is your present salary?\n\n                                     JOANNA\n                         I make thirty-one thousand dollars a \n                         year.\n\n               REACTION \u0096 TED\n\n               Stunned.\n\n                                     GRESSEN\n                              (switching tactics)\n                         Mrs. Kramer, do you love your child?\n\n                                     JOANNA\n                              (emphatically)\n                         Yes. Very much.\n\n                                     GRESSEN\n                         And yet you chose to leave him?\n\n               There is a long pause, then:\n\n                                     JOANNA\n                              (speaking carefully, \n                              with great thought)\n                         Yes... Look, during the last five \n                         years we were married, I had... I \n                         was getting more and more... unhappy, \n                         more and more frustrated. I needed \n                         to talk to somebody. I needed to \n                         find out if it was me, if I was going \n                         crazy or what. But every time I turned \n                         to Ted \u0096 my ex-husband, he couldn't \n                         handle it. He became very... I don't \n                         know, very threatened. I mean, \n                         whenever I would bring up anything \n                         he would act like it was some kind \n                         of personal attack. Anyway, we became \n                         more and more separate... more and \n                         more isolated from one another. \n                         Finally, I had no other choice, I \n                         had to leave. And because of my ex-\n                         husband's attitude \u0096 his unwillingness \n                         to deal with my feelings, I had come \n                         to have almost no self-esteem...\n                              (with feeling)\n                         At the time I left, I sincerely \n                         believed that there was something \n                         wrong with me \u0096 that my son would be \n                         better off without me. It was only \n                         when I got to California and started \n                         into therapy I began to realize I \n                         wasn't a terrible person. And that \n                         just because I needed some creative \n                         and emotional outlet other than my \n                         child, that didn't make me unfit to \n                         be a mother.\n\n                                     GRESSEN\n                              (to the judge)\n                         Your honor, I would like to place in \n                         evidence a report on Mrs. Kramer's \n                         therapy by her therapist, Dr. Elinore \n                         Freedman of La Jolla, California.\n\n               And with that he hands both the judge and Shaunessy a thick \n               sheaf of papers. Then, turning his attention back to Joanna:\n\n                                     GRESSEN\n                         Mr. Kramer, why did you set up \n                         residence in New York?\n\n                                     JOANNA\n                         Because my son is here. And his father \n                         is here. As a mother, I don't want \n                         my child to be separated from his \n                         father.\n\n                                     GRESSEN\n                         Mrs. Kramer, can you tell the court \n                         why you are asking for custody?\n\n               There is a pause, then:\n\n                                     JOANNA\n                         Because he's my child... Because I \n                         love him. I know I left my son, I \n                         know that's a terrible thing to do. \n                         Believe me, I have to live with that \n                         every day of my life. But just because \n                         I'm a woman, don't I have a right to \n                         the same hopes and dreams as a man? \n                         Don't I have a right to a life of my \n                         own? Is that so awful? Is my pain \n                         any less just because I'm a woman? \n                         Are my feelings any cheaper? I left \n                         my child \u0096 I know there is no excuse \n                         for that. But since then, I have \n                         gotten help. I have worked hard to \n                         become a whole human being. I don't \n                         think I should be punished for that. \n                         I don't think my son should be \n                         punished for that. Billy's only six. \n                         He needs me. I'm not saying he doesn't \n                         need his father, but he needs me \n                         more. I'm his mother.\n\n               There is a beat of silence, then:\n\n                                     GRESSEN\n                         Thank you, Mrs. Kramer. I have no \n                         further questions.\n\n               ON SHAUNESSY\n\n               As he stands, collects his papers from the table and, taking \n               his own sweet time, crosses to Joanna.\n\n                                     SHAUNESSY\n                         Now then, Mrs. Kramer, you said you \n                         were married seven years. Is that \n                         correct?\n\n                                     JOANNA\n                         Yes.\n\n                                     SHAUNESSY\n                         In all that time did your husband \n                         ever strike you or abuse you \n                         physically in any way.\n\n                                     JOANNA\n                         No.\n\n                                     SHAUNESSY\n                         Did your husband strike or physically \n                         abuse his child in any way?\n\n                                     JOANNA\n                         No.\n\n                                     SHAUNESSY\n                         Would you describe your husband as \n                         an alcoholic?\n\n                                     JOANNA\n                         No.\n\n                                     SHAUNESSY\n                         A heavy drinker?\n\n                                     JOANNA\n                         No.\n\n                                     SHAUNESSY\n                         Was he unfaithful?\n\n                                     JOANNA\n                         No.\n\n                                     SHAUNESSY\n                         Did he ever fail to provide for you?\n\n                                     JOANNA\n                         No.\n\n                                     SHAUNESSY\n                              (wry smile)\n                         Well, I can certainly understand why \n                         you left him.\n\n                                     GRESSEN\n                         Objection.\n\n                                     SHAUNESSY\n                              (switching his line \n                              of questioning)\n                         How long do you plan to live in New \n                         York, Mrs. Kramer?\n\n                                     JOANNA\n                         Permanently.\n\n               Note: During the early part of Shaunessy's cross-examination, \n               Joanna has been very forthright, very sure of herself. Now, \n               as he starts getting tougher, she begins to falter.\n\n                                     SHAUNESSY\n                         Permanently?\n                              (smiles, like a shark \n                              smiles)\n                         Mrs. Kramer, how many boy friends \n                         have you had \u0096 permanently?\n\n               ON JOANNA\n\n               Her head snaps back as though she's been hit.\n\n                                     JOANNA\n                         I don't recall.\n\n                                     SHAUNESSY\n                              (boring in)\n                         How many lovers have you had \u0096 \n                         permanently?\n\n                                     JOANNA\n                              (looks toward Gressen \n                              for help)\n                         I don't recall.\n\n                                     SHAUNESSY\n                         More than three, less than thirty-\n                         three \u0096 permanently?\n\n               ON GRESSEN\n\n               He is again on his feet, outraged.\n\n                                     GRESSEN\n                         Objection!\n\n                                     JUDGE\n                         Overruled. The witness will answer, \n                         please.\n\n                                     JOANNA\n                              (almost a whisper)\n                         Somewhere in between.\n\n                                     SHAUNESSY\n                         Do you have a lover now?\n\n                                     GRESSEN\n                              (furious)\n                         Objection!\n\n                                     SHAUNESSY\n                              (to the judge)\n                         Your honor, I would request a direct \n                         answer to a direct question. Does \n                         she have a lover?\n\n                                     JUDGE\n                         I'll allow that. The witness will \n                         answer please.\n\n                                     JOANNA\n                              (in a whisper)\n                         Yes.\n\n                                     SHAUNESSY\n                         Is that... permanent?\n\n                                     JOANNA\n                              (by now she is becoming \n                              thoroughly rattled)\n                         I... I don't know...\n\n                                     SHAUNESSY\n                         Then, we don't really know, do we, \n                         when you say \"permanently\" if you're \n                         planning to remain in New York, or \n                         even to keep the child for that \n                         matter, since you've never really \n                         done anything in your life that was \n                         continuing, stable, that could be \n                         regarded as permanent.\n\n               ON THE PETITIONER'S TABLE\n\n               Gressen jumps to his feet.\n\n                                     GRESSEN\n                         Objection! I must ask that the counsel \n                         be prevented from harassing the \n                         witness.\n\n                                     JUDGE\n                         Sustained.\n\n                                     SHAUNESSY\n                              (a new attack)\n                         Mrs. Kramer, how can you consider \n                         yourself a fit mother when you have \n                         been a failure at virtually every \n                         relationship you have undertaken as \n                         an adult?\n\n                                     GRESSEN\n                              (red in the face)\n                         Objection!\n\n                                     JUDGE\n                         Sustained.\n\n                                     SHAUNESSY\n                         I'll ask it another way. What was \n                         the longest personal relationship \n                         you have had in your life \u0096 other \n                         than parents and girlfriends?\n\n                                     JOANNA\n                              (rattled)\n                         Ah... I guess I'd have to say... \n                         with my child.\n\n                                     SHAUNESSY\n                              (wonder, irony)\n                         Whom you've seen twice in a year? \n                         Mrs. Kramer, your ex-husband, wasn't \n                         he the longest personal relationship \n                         in your life?\n\n                                     JOANNA\n                              (reluctantly)\n                         I suppose...\n\n                                     SHAUNESSY\n                         Would you speak up, Mrs. Kramer? I \n                         couldn't hear you.\n\n                                     JOANNA\n                              (louder)\n                         Yes.\n\n                                     SHAUNESSY\n                         How long was that?\n\n                                     JOANNA\n                         We were married two years before the \n                         baby. And then four very difficult \n                         years.\n\n                                     SHAUNESSY\n                         So, you were a failure at the longest, \n                         most important relationship in your \n                         life.\n\n                                     GRESSEN\n                         Objection!\n\n                                     JUDGE\n                         Overruled.\n\n                                     JOANNA\n                         I was not a failure.\n\n                                     SHAUNESSY\n                              (sarcastic)\n                         Oh? What do you call it then \u0096 a \n                         success? The marriage ended in \n                         divorce.\n\n                                     JOANNA\n                              (so angry she forgets \n                              her cool)\n                         I consider it less my failure than \n                         his.\n\n                                     SHAUNESSY\n                              (seizes on this)\n                         Congratulations, Mrs. Kramer. You \n                         have just rewritten matrimonial law. \n                         You were both divorced, Mrs. Kramer.\n\n                                     GRESSEN\n                              (on his feet)\n                         Objection!\n\n                                     SHAUNESSY\n                              (to the judge)\n                         Your honor, I'd like to ask what \n                         this model of stability and \n                         respectability has ever succeeded \n                         at?\n                              (to Joanna)\n                         Mrs. Kramer, were you a failure at \n                         the longest, most important personal \n                         relationship in your life?\n\n               CLOSE ON JOANNA\n\n               Who sits silently.\n\n                                     JUDGE\n                         Please answer the question, Mrs. \n                         Kramer.\n\n                                     JOANNA\n                              (whisper)\n                         It did not succeed.\n\n                                     SHAUNESSY\n                              (suddenly fierce)\n                         Not it... Not it, Mrs. Kramer \u0096 you. \n                         Were you a failure at the most \n                         important personal relationship of \n                         your life?\n\n               CLOSER IN ON JOANNA\n\n               Silence.\n\n                                     SHAUNESSY\n                         Were you?\n\n               EXTREME CLOSEUP JOANNA\n\n                                     JOANNA\n                              (barely audible)\n                         Yes.\n\n               WIDE SHOT\n\n               Shaunessy smiles, turns his back on Joanna and walks back \n               toward the respondent's table.\n\n                                     SHAUNESSY\n                         No further questions.\n\n               CLOSER IN ON THE TABLE\n\n               As Shaunessy sits down next to Ted.\n\n                                     TED\n                              (leaning over, in a \n                              whisper)\n                         Jesus Christ. Did you have to be so \n                         rough on her?\n\n                                     SHAUNESSY\n                              (tough)\n                         Do you want the kid or don't you?\n\n               ON JOANNA\n\n               Shaken, she gets down from the witness stand, crosses to the \n               petitioner's table without looking at Ted. She sits, leans \n               across to her lawyer and whispers something in his ear. As \n               he nods...\n\n                                                                    CUT TO:\n\n               INT. COURTROOM, LATER IN THE DAY\n\n               ON JIM O'CONNOR\n\n               Who sits in the witness stand. At the moment he is being \n               examined by Gressen.\n\n                                     GRESSEN\n                         Now then, Mr. O'Connor, how long did \n                         Ted Kramer work for you?\n\n                                     O'CONNOR\n                         Eight, almost nine years.\n\n                                     GRESSEN\n                         And did you have a close personal \n                         relationship?\n\n                                     O'CONNOR\n                              (in a whisper)\n                         Yes...\n\n                                     GRESSEN\n                         And how did you find his work?\n\n                                     O'CONNOR\n                         It was good. He was a hard worker, a \n                         lot of drive, a real hustler.\n\n                                     GRESSEN\n                         And yet you fired him.\n\n               There is a long pause.\n\n                                     O'CONNOR\n                              (looking down)\n                         Ted was a good worker. But, ah... \n                         after his wife left him and he was \n                         taking care of the kid on his own, \n                         things started to change. Look, I \n                         know he had problems, I understand \n                         that. I've got problems, everybody's \n                         got problems. But I've got a shop to \n                         run, I can't let that kind of thing \n                         get in the way...\n                              (quietly)\n                         I guess I felt that Ted was letting \n                         his duties at home interfere with \n                         his responsibilities in the office.\n\n                                     GRESSEN\n                         Thank you. I have no further \n                         questions.\n\n               Shaunessy stands up.\n\n                                     SHAUNESSY\n                         Mr. O'Connor, does the agency still \n                         have the Fire and Ice account?\n\n                                     O'CONNOR\n                              (up tight)\n                         No.\n\n                                     SHAUNESSY\n                         Mr. O'Connor, can you tell me where \n                         you are employed at the moment?\n\n                                     O'CONNOR\n                              (stiff)\n                         At the moment I am unemployed.\n\n               ON THE JUDGE\n\n                                     JUDGE\n                         If the petitioner has no further \n                         witnesses, we will hear the respondent \n                         tomorrow morning at 9:30.\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               WIDE SHOT\n\n               Ted sits at the dining table poring over law books, writing \n               copious notes on a legal pad. Billy sits across from him \n               drawing in a pad with magic markers. HOLD FOR A BEAT as Billy \n               looks up at his father. It is clear that something is \n               bothering him.\n\n                                     BILLY\n                         Mom \u0096 I mean, dad?\n\n                                     TED\n                              (not looking up)\n                         Uh, huh?\n\n                                     BILLY\n                         What did you do when you were little?\n\n                                     TED\n                              (still involved in \n                              his books)\n                         I guess about the same kind of things \n                         you do.\n\n                                     BILLY\n                         Did you watch \"I Dream of Jeannie?\"\n\n                                     TED\n                              (distracted)\n                         Uh, uh... We didn't have television \n                         then.\n\n               ON BILLY\n\n               Eyes wide. He finds this hard to believe.\n\n                                     BILLY\n                         You didn't have T.V.?\n\n               ON TED\n\n               He looks up for the first time, smiles.\n\n                                     TED\n                         Nope. It hadn't been invented yet.\n\n               He starts to go back to work.\n\n                                     BILLY\n                              (this is serious \n                              business)\n                         Was there apple juice when you were \n                         little?\n\n                                     TED\n                         Yeah, there was apple juice.\n\n                                     BILLY\n                         Was there Burger King?\n\n                                     TED\n                         Uh, uh. There was no such a thing as \n                         Burger King.\n\n                                     BILLY\n                         What else wasn't there?\n\n               ON TED\n\n               He takes a long look at his son, then closes the law book, \n               puts his notes away.\n\n                                     TED\n                         Well, let's see... There wasn't \n                         McDonald's. And there wasn't \n                         astronauts... And there wasn't frozen \n                         yogurt. And there wasn't...\n\n               As he continues on about what wasn't, we\n\n                                                             FADE TO BLACK:\n\n               EXT. COURTHOUSE \u0096 DAY\n\n               ESTABLISHING SHOT\n\n               INT. COURTROOM \u0096 DAY\n\n               ON THELMA\n\n               She sits in the witness stand being examined by Shaunessy. \n               From her attitude it is clear that she is very wrought up, \n               that all of this is taking a heavy emotional toll on her.\n\n                                     SHAUNESSY\n                         Mrs. Phillips, how long have you \n                         known Ted Kramer?\n\n                                     THELMA\n                         Six years. Ever since Ted and Joanna \n                         moved into the building.\n\n                                     SHAUNESSY\n                         How often do you see Mr. Kramer and \n                         his son?\n\n                                     THELMA\n                              (to the judge, by way \n                              of explanation)\n                         Charley, my husband, and I are... \n                         divorced and Kim, that's our daughter \n                         is about Billy's age and the children \n                         play together a lot. So, I guess we \n                         see each three or four times a week.\n\n                                     SHAUNESSY\n                         Can you describe the relationship \n                         between Mr. Kramer and his son?\n\n                                     THELMA\n                         It's beautiful. It's just beautiful. \n                         They have a beautiful relationship.\n\n               ON GRESSEN\n\n               Getting wearily to his feet.\n\n                                     GRESSEN\n                              (patronizing)\n                         Objection, your honor. The answer \n                         is, to be generous, very vague.\n\n                                     SHAUNESSY\n                         Can you recall any particular incident \n                         that relates to Mr. Kramer's care of \n                         his child?\n\n                                     THELMA\n                              (fighting a losing \n                              battle with her \n                              emotions)\n                         Ted \u0096 Mr. Kramer, spends a great \n                         deal of time with his child. I don't \n                         just mean hours, I mean good time, \n                         involved time. He reads to Billy. \n                         They play together. They talk all \n                         the time...\n                              (tears start)\n                         He is a very... kind man... a very... \n                         devoted father, and... and...\n                              (she turns to Joanna)\n                         And Joanna if you ever saw them \n                         together... there wouldn't be a trial \n                         at all...\n                              (she breaks down, \n                              weeping)\n                         Oh, shit... I'm sorry... I'm sorry...\n\n               Note: during this we cross-cut to Joanna, who sits, staring \n               at her friend, shaken.\n\n                                     SHAUNESSY\n                              (gently)\n                         No further questions. Thank you Mrs. \n                         Phillips.\n\n                                     GRESSEN\n                              (without looking up \n                              from his notes)\n                         No questions.\n\n               Thelma leaves the stand and walks back to her seat.\n\n                                                                    CUT TO:\n\n               INT. COURTROOM \u0096 DAY\n\n               ON TED KRAMER\n\n               Sitting in the witness stand.\n\n                                     SHAUNESSY\n                         Mr. Kramer, would you tell the court \n                         exactly why you want to retain custody \n                         of your child.\n\n                                     TED\n                              (speaking quietly)\n                         When Joanna \u0096\n                              (to the judge, \n                              correcting himself)\n                         \u0096 my ex-wife \u0096 when she was talking \n                         before about how unhappy she was \n                         during our marriage... Well, I guess \n                         most of what she said was probably \n                         true. There were a lot of things I \n                         didn't understand \u0096 a lot of things \n                         I would do different if I could. \n                         Just like I guess there are a lot of \n                         things Joanna wishes she could \n                         change... But we can't. Some things, \n                         once they are done, can't be undone. \n                         Joanna says she loves Billy. I believe \n                         she does. So do I. But the way it \n                         was explained to me, that's not the \n                         issue. The only thing that's supposed \n                         to matter here is what's best for \n                         Billy... When Joanna said why \n                         shouldn't a woman have the same \n                         ambitions as a man, I suppose she's \n                         right. But by the same token what \n                         law is it that says a woman is a \n                         better parent simply by virtue of \n                         her sex? I guess I've had to think a \n                         lot about whatever it is that makes \n                         somebody a good parent: constancy, \n                         patience, understanding... love. \n                         Where is it written that a man has \n                         any less of those qualities than a \n                         woman? Billy has a home with me, \n                         I've tried to make it the best I \n                         could. It's not perfect. I'm not a \n                         perfect parent.\n                              (unconsciously echoing \n                              something Joanna \n                              said earlier)\n                         I don't have enough patience. \n                         Sometimes I forget he's just a little \n                         kid... But I love him... More than \n                         anything in this world I love him.\n\n                                     SHAUNESSY\n                         Thank you, Mr. Kramer. No further \n                         questions.\n\n               ON GRESSEN\n\n               As he gets up from the petitioner's table and crosses to the \n               witness stand.\n\n                                     GRESSEN\n                              (hard-lining it)\n                         Mr. Kramer, by any chance have you \n                         ever had a woman in your bed while \n                         your child was asleep in the next \n                         room?\n\n                                     TED\n                         I suppose.\n\n                                     GRESSEN\n                              (pointedly)\n                         So do I.\n\n                                     SHAUNESSY\n                         Objection!\n\n                                     JUDGE\n                         Sustained.\n\n                                     GRESSEN\n                              (switching to another \n                              line of attack)\n                         Mr. Kramer, isn't it true that you \n                         were fired from your last job not \n                         more than six weeks ago?\n\n                                     TED\n                              (not losing his cool)\n                         Technically, the agency lost a big \n                         account and seventy four people were \n                         let go. I was one of them.\n\n                                     GRESSEN\n                              (snotty)\n                         You were fired, correct?\n\n                                     TED\n                         Yes, but I'm with J. Walter Thompson \n                         now. I don't think that will happen \n                         again.\n\n                                     GRESSEN\n                              (snide)\n                         Give them time...\n\n                                     SHAUNESSY\n                         Objection, your honor! Counsel is \n                         harassing the witness.\n\n                                     GRESSEN\n                              (to the judge, pettish)\n                         Your honor, I'm only examining the \n                         man's employment record. He pretends \n                         to fitness when he cannot hold a \n                         job.\n\n                                     JUDGE\n                         Sustained.\n\n               ON GRESSEN\n\n               He is thoughtful for a moment, like a man trying to decide \n               whether or not to drop the bomb. Then, turning back to Ted:\n\n                                     GRESSEN\n                              (very tough)\n                         Mr. Kramer, did your child nearly \n                         lose an eye when he was in your care?\n\n               REACTION \u0096 TED\n\n               Stunned. He looks across at Joanna.\n\n               QUICK CUT \u0096 HIS POV\n\n               Joanna looks away.\n\n                                     GRESSEN\n                              (boring in)\n                         Mr. Kramer, did you, or did you not \n                         tell the child's mother that you \n                         were responsible for the injury that \n                         permanently disfigured your child?\n\n               Shaunessy is on his feet racing toward the bench.\n\n                                     SHAUNESSY\n                              (vehement)\n                         Objection! Your honor, counsel is \n                         raising a question that is not germane \n                         to these proceedings.\n\n                                     GRESSEN\n                              (to the judge)\n                         While the child was in the care of \n                         the witness, he cut his face badly \n                         and is now scarred.\n\n                                     JUDGE\n                              (to Gressen)\n                         Are you introducing the question of \n                         negligence here, counselor?\n\n                                     GRESSEN\n                         Yes, your honor.\n\n                                     JUDGE\n                         I see. Well, you'll have to do better \n                         than that. Do you have any affidavits \n                         to support negligence?\n\n                                     GRESSEN\n                         I do not, your honor, however \u0096\n\n                                     JUDGE\n                         This is an isolated incident, \n                         counselor, unless you can prove \n                         otherwise.\n\n                                     GRESSEN\n                              (back to Ted)\n                         Does the witness deny the injury \n                         took place?\n\n                                     JUDGE\n                              (before Ted can say \n                              anything)\n                         No, counselor, I'm going to over-\n                         rule you on this line of questioning.\n\n                                     GRESSEN\n                         Then I have concluded my questions.\n\n               ON THE PETITIONER'S TABLE\n\n               Joanna sits, still not looking at Ted. She holds her face, \n               one hand shielding her eyes.\n\n                                                                    CUT TO:\n\n               ON THE JUDGE\n\n               As he makes his closing statement.\n\n                                                                    CUT TO:\n\n               INT. MAIN LOBBY, COURTHOUSE \u0096 DAY\n\n               WIDE SHOT\n\n               Shaunessy and Ted stand talking, reviewing the case. Then \n               the two men shake hands, the lawyer waves goodbye, turns and \n               starts back into the building. THE CAMERA PANS WITH TED as \n               he walks toward the main exit.\n\n                                                                    CUT TO:\n\n               EXT. MAIN ENTRANCE, COURTHOUSE \u0096 DAY\n\n               ON TED\n\n               As he comes out of the building, starts down the steps.\n\n                                     JOANNA (O.S.)\n                         Ted.\n\n               He stops, turns:\n\n               HIS POV\n\n               There, standing waiting for him is Joanna.\n\n               CLOSE ON TED\n\n               His face a mask of cold anger. She crosses to him.\n\n                                     JOANNA\n                         I'm sorry... I just mentioned it in \n                         passing. I never thought he'd use \n                         it.\n\n                                     TED\n                              (sarcastic)\n                         Yeah, well he did, didn't he.\n\n                                     JOANNA\n                         Please, Ted. I never would have \n                         brought it up if I thought \u0096\n\n                                     TED\n                         I'm not interested, Joanna. Goodbye.\n\n               WIDE SHOT\n\n               As he turns and walks away from her, leaving her standing, \n               watching him as he disappears.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON TED AND THELMA\n\n               It is a bleak winter's day. THE CAMERA TRACKS WITH THEM as \n               they walk along, Ted carrying a bag of groceries, Thelma \n               with cleaning.\n\n               The children run around them, playing.\n\n                                     THELMA\n                         You heard anything yet?\n\n                                     TED\n                              (shakes his head)\n                         Any day.\n\n               They walk in silence for several beats, each clearly lost in \n               their own thoughts. Then:\n\n                                     THELMA\n                         Ted.\n\n                                     TED\n                              (preoccupied)\n                         Uh, huh...\n\n                                     THELMA\n                              (this is hard to say)\n                         Ah, Charley and I are... Well, we're \n                         thinking about... I mean, actually \n                         we're sort of talking about maybe \n                         getting back together.\n\n                                     TED\n                              (thunderstruck)\n                         You and Charley?\n\n               Thelma nods.\n\n                                     TED\n                         Really?\n\n               Thelma nods.\n\n                                     TED\n                              (conflicting emotions)\n                         Hey, that's terrific.\n\n                                     THELMA\n                              (hastily)\n                         Maybe. I said maybe.\n                              (apologizing for her \n                              good fortune)\n                         What I mean is, ah... I don't think \n                         it'll really work out, but Charley \n                         seems to want it, so...\n\n               She leaves the sentence unfinished. They walk in silence for \n               several more steps. Then she takes his hand.\n\n                                     THELMA\n                              (can't help grinning)\n                         Oh, God... Ted, I am really scared.\n\n               They walk in silence for a beat, then Ted looks OFF SCREEN, \n               spots something:\n\n               HIS POV\n\n               The Saturday Father, restless, bored, walking with his \n               daughter who is also bored. It is clear that they have nothing \n               to say to one another. He looks around, spots Ted, waves and \n               starts in his direction.\n\n               CLOSEUP TED\n\n               He reacts as though he has seen a vision of his own death.\n\n                                     TED\n                              (to Thelma, urgent)\n                         C'mon.\n                              (to Billy and Kim)\n                         Billy, Kim. Let's go.\n\n               WIDE SHOT\n\n               As Ted ushers them across the street, away from the Saturday \n               Father.\n\n                                                                    CUT TO:\n\n               INT. MEN'S BAR, MIDTOWN \u0096 DAY\n\n               A crowded, rather posh watering spot. Shaunessy sits alone \n               at a table for two, a drink in front of him.\n\n               REVERSE ON THE DOOR\n\n               As Ted enters, spots Shaunessy and starts in his direction.\n\n               CLOSER ON SHAUNESSY'S TABLE\n\n               As Ted sits down.\n\n                                     TED\n                         Well?\n\n               ON SHAUNESSY\n\n               As he looks up at Ted, says nothing.\n\n               ON TED\n\n               He realizes that they have lost.\n\n                                     TED\n                         Oh, Christ!\n\n               CROSS-CUTTING BETWEEN THEM:\n\n                                     SHAUNESSY\n                         The judge went for motherhood straight \n                         down the line.\n\n                                     TED\n                         I lost him? I lost him?\n\n                                     SHAUNESSY\n                         I can't tell you how sorry I am.\n\n                                     TED\n                         Oh, no..\n\n                                     SHAUNESSY\n                              (reading from a piece \n                              of paper)\n                         Ordered, adjudged and decreed that \n                         the petitioner be awarded custody of \n                         the minor child, effective Monday \n                         the 23rd of January. That the \n                         respondent pay for the maintenance \n                         and support of said child, four \n                         hundred dollars each month. That the \n                         father shall have the following rights \n                         of visitation: every other weekend, \n                         one night each week to be mutually \n                         agreed upon and one half of the \n                         child's vacation period.\n                              (looks up at Ted)\n                         That's it.\n\n                                     TED\n                              (grim)\n                         What if I fight it?\n\n                                     SHAUNESSY\n                              (matter of factly)\n                         We can appeal, but I can't guarantee \n                         anything.\n\n                                     TED\n                              (determined)\n                         I'll take my chances.\n\n                                     SHAUNESSY\n                         It's going to cost.\n\n                                     TED\n                              (his mind is made up)\n                         Don't worry. I'll get the money.\n\n               There is a beat of silence, then:\n\n                                     SHAUNESSY\n                         I've got to tell you something, Ted. \n                         This time it'll be Billy that pays. \n                         This time I'll have to put him on \n                         the stand.\n\n               CLOSE ON TED\n\n               As his last hope goes crashing to the ground.\n\n                                     TED\n                         Oh, Christ no... I can't do that. I \n                         just... can't...\n                              (he looks up at the \n                              lawyer in despair)\n                         Excuse me... I'm sorry... I just...\n\n               That is all Ted can manage to say. He gets to his feet and \n               rushes for the door.\n\n                                                                    CUT TO:\n\n               EXT. KRAMER APT. BLDG. \u0096 DAY\n\n               ON THE ENTRANCE\n\n               As Mrs. Willewska comes out. Her eyes are red from crying. \n               THE CAMERA PANS WITH HER as she turns up the street on her \n               way to pick up Billy from school. THE CAMERA HOLDS IN POSITION \n               as she meets Thelma. They stand talking for a moment, then \n               Thelma turns and starts to run toward the building.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY, OUTSIDE TED'S APT. \u0096 DAY\n\n               ON THE ELEVATOR DOORS\n\n               They open and Thelma steps out. She runs to the door, begins \n               to knock.\n\n                                     THELMA\n                              (calling out)\n                         Ted!... It's me... Ted?...\n\n               There is a beat of silence, then:\n\n                                     TED (O.S.)\n                              (very quiet)\n                         Please go away, Thel... I... I just \n                         have to be by myself for a little \n                         while...\n\n                                     THELMA\n                         Ted, I just heard...\n\n                                     TED (O.S.)\n                         Please, Thel...\n\n               Thelma leans against the door and begins to sob.\n\n                                     THELMA\n                         I'm so... sorry... Oh, Ted, I'm so \n                         sorry...\n\n                                                             FADE TO BLACK:\n\n               FADE IN:\n\n               EXT. KRAMER APT. BLDG. \u0096 DAY\n\n               WIDE SHOT\n\n               As Mrs. Willewska brings Billy back from school.\n\n                                                                    CUT TO:\n\n               INT. KRAMER APT. \u0096 DAY\n\n               ON THE FRONT DOOR\n\n               It opens and Billy and Mrs. Willewska enter. Billy sees Ted \n               and rushes across to him.\n\n                                     BILLY\n                              (excited)\n                         Daddy! You're home early. Did you \n                         get fired again?\n\n                                     TED\n                              (laughing in spite of \n                              himself)\n                         No, son, I didn't get fired.\n                              (fake cheerful)\n                         I'll tell you what we'll do, okay? \n                         How about if we go to a Burger King \n                         and then we watch a little T.V. and \n                         then we get packed to go to the \n                         country tomorrow. Just you and me... \n                         How 'bout that?\n\n                                                                    CUT TO:\n\n               EXT. KRAMER APT. BLDG. \u0096 NIGHT\n\n               ESTABLISHING SHOT\n\n               HOLD FOR A BEAT, then:\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 NIGHT\n\n               ON TED\n\n               He sits at the dining table, a typewriter in front of him. \n               As he begins to type, hunt and peck system, we:\n\n                                                                    CUT TO:\n\n               INSERT \u0096 HIS POV\n\n               The page in the typewriter. We SEE and HEAR at the same time.\n\n                                     TED (V.O.)\n                         Joanna... This is by way of \n                         introducing William Kramer. He is a \n                         sweet child, as you will see. He is \n                         allergic to grape juice, but will \n                         more than make up for the loss in \n                         apple juice. He is also allergic to \n                         peanut butter from the health food \n                         store, but not from the supermarket. \n                         Don't ask me why.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON A CORNER MAILBOX\n\n               As Ted mails the letter.\n\n                                     TED (V.O.)\n                         At times, in the night he will have \n                         nightmares, one particular monster \n                         is called The Face. The Face, as \n                         best as I can determine, looks like \n                         a circus clown without a body, and \n                         from what the pediatrician says, and \n                         what I have read, may be sexual fear \n                         of losing his penis, or a fear of \n                         his own anger, or just a circus clown \n                         he saw once.\n\n                                                                    CUT TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON THE SAME MAILBOX\n\n               As a sack of mail is loaded into a truck.\n\n                                     TED (V.O.)\n                         His doctor, by the way, is still Ed \n                         Davies. The Sundafed is for colds, \n                         one tablespoon every four hours. I \n                         will pack it in the blue suitcase.\n\n                                                                    CUT TO:\n\n               EXT. JOANNA KRAMER'S APT. BLDG. \u0096 DAY\n\n               WIDE SHOT\n\n               A POSTMAN enters the building carrying a bag of mail.\n\n                                     TED (V.O.)\n                         His best stories have been Babar and \n                         Winnie the Pooh up to now, with Batman \n                         moving up. His housekeeper has been \n                         Etta Willewska and she is the main \n                         reason for the note. She is a loving \n                         woman, conscientious, very concerned \n                         about Billy and more important, Billy \n                         cares about her.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY, JOANNA'S APT. BLDG. \u0096 DAY\n\n               ON A STACK OF MAIL\n\n               As it is dropped in front of a doorway. We SEE that the letter \n               from Ted to Joanna is on top.\n\n                                     TED (V.O.)\n                         I urge you to retain her. Her number \n                         is 722-8099, and I think she will \n                         take the job if it is offered. I'm \n                         sure other things will come up. Ask \n                         me what you need to and I guess \n                         eventually we'll talk...\n\n                                                                    CUT TO:\n\n               INT. JOANNA'S APT. \u0096 DAY\n\n               ON HER\n\n               As she finishes reading the letter.\n\n                                     TED (V.O.)\n                         That's all I can think of, except to \n                         repeat what I said before, he's a \n                         terrific kid. I'm grateful for the \n                         time we've had together and I feel I \n                         am a better man because of my son... \n                         Ted.\n\n                                                                    CUT TO:\n\n               EXT. BEACH \u0096 DAY\n\n               It is a clear, cold beautiful winter's day. Ted and Billy \n               walk\n\n               along the beach at the edge of the water. THE CAMERA TRACKS \n               WITH THEM. There are several beats of silence as Ted tries \n               to think of how to begin. Finally:\n\n                                     TED\n                         Billy, sometimes when a mother and a \n                         father are divorced, there's a \n                         discussion about who the child should \n                         live with, the mother or the father. \n                         Now there is a man who is very wise. \n                         He's called a judge. And a judge has \n                         a lot of experience with divorces \n                         and he decides who it would be best \n                         for the child to live with.\n\n                                     BILLY\n                         Why does he decide?\n\n                                     TED\n                         Because... Well, that's what he does. \n                         He's a very powerful man.\n\n                                     BILLY\n                         Like a principal?\n\n                                     TED\n                         Bigger than a principal. The judge \n                         sits in robes in a big chair... The \n                         judge has thought a lot about us, \n                         about you and me and your mom, and \n                         he has decided...\n                              (a deep breath)\n                         ...he has decided that it would be \n                         best for you to live with your mom \n                         Joanna in her apartment.\n                              (fake cheerful)\n                         And I'm very lucky. Because even \n                         though you'll live with your mom \n                         Joanna I'll get to see you once a \n                         week for dinner and a couple of \n                         weekends a month.\n\n                                     BILLY\n                         I don't understand, daddy.\n\n                                     TED\n                              (trying very hard not \n                              to cry)\n                         What don't you understand, pal?\n\n                                     BILLY\n                         Where will my bed be, where will I \n                         sleep?\n\n                                     TED\n                         At your mom's. She'll have a bed for \n                         you in your own room.\n\n                                     BILLY\n                         Where will my toys be?\n\n                                     TED\n                         I'll send your toys there and I'm \n                         sure you'll get some new ones.\n\n                                     BILLY\n                         Who will read me my stories?\n\n                                     TED\n                         Your mom.\n\n                                     BILLY\n                              (worried)\n                         Daddy, what if The Face comes when \n                         I'm at mommy's?\n\n                                     TED\n                         Your mom knows all about The Face, \n                         okay? Don't worry, she'll tell The \n                         Face to beat it.\n\n                                     BILLY\n                         Will you come and say good-night to \n                         me every night?\n\n               Suddenly Ted can't stand it any longer.\n\n                                     TED\n                         Look, it's getting cold. Why don't \n                         you go inside where it's warm. I'll \n                         be along in a minute.\n\n               Billy hangs back, watching Ted.\n\n                                     TED\n                         Go on, scoot.\n\n               The boy turns and runs back along the beach toward the house.\n\n               Then, he stops, turns back to look once more at his father.\n\n               HIS POV \u0096 LONG SHOT\n\n               Ted stands at the ocean's edge, his back to CAMERA, weeping.\n\n                                                             FADE TO BLACK:\n\n               EXT. KRAMER APT. BLDG. \u0096 DAY\n\n               WIDE SHOT\n\n               It is early Monday morning.\n\n                                                                    CUT TO:\n\n               INT. KRAMER KITCHEN \u0096 MORNING\n\n               ON TED AND BILLY\n\n               They stand side by side, like a surgeon and his assistant. \n               Spread out on the counter in front of them are the makings \n               of French toast. The following is done with great efficiency, \n               in contrast to the first time we saw them go through the \n               same ritual. They work in silence except for an occasional \n               command. Each concentrating on this last moment of closeness, \n               each doing his best to avoid thinking about Billy's departure. \n               Finally:\n\n               ON BILLY\n\n               Looking at his father, trying to memorize the older man's \n               face.\n\n               Ted turns, sees his son watching him.\n\n                                     TED\n                              (with false gaiety)\n                         Hey? What's doin' with that bread? \n                         Let's see a little hustle around \n                         here.\n\n                                                                    CUT TO:\n\n               INT. LIVING ROOM \u0096 KRAMER APT. \u0096 MORNING\n\n               WIDE SHOT\n\n               Billy's bags are packed and stacked neatly in the living \n               room.\n\n               Nearby, Billy and his father sit, silent, waiting.\n\n               Sound-effect: The intercom from the lobby buzzes.\n\n               CLOSER IN ON TED AND BILLY\n\n               Ted looks at his son, smiles. The boy smiles back.\n\n                                     TED\n                         This is it, pal.\n\n               Billy, fighting back tears, nods.\n\n               Sound-effect: The intercom buzzes again.\n\n               Ted gets to his feet and starts toward the foyer.\n\n                                                                    CUT TO:\n\n               INT. FOYER \u0096 DAY\n\n               As Ted picks up the intercom:\n\n                                     TED\n                         Yes?\n\n                                     JOANNA'S VOICE\n                         Ted, it's Joanna. Can you meet me in \n                         the lobby?... Alone?\n\n               And she hangs up before he can answer.\n\n                                     TED\n                              (to Mrs. Willewska, \n                              in the kitchen)\n                         I'll be back in a minute.\n\n                                                                    CUT TO:\n\n               INT. LOBBY \u0096 DAY\n\n               ON THE ELEVATOR DOORS\n\n               As they open, Ted steps out, looks around.\n\n               HIS POV\n\n               The lobby is dark, the only light coming from the window. \n               Joanna sits off to one side, wearing sunglasses. She looks \n               up as Ted approaches, a small smile on her face.\n\n                                     TED\n                              (abrupt)\n                         Okay, I'm here. Now why did you \u0096\n\n                                     JOANNA\n                         Ted, do you love him?\n\n                                     TED\n                         Goddamnit, Joanna. What the \u0096\n\n                                     JOANNA\n                              (insistent)\n                         Ted, do you love him?\n\n               He nods.\n\n                                     JOANNA\n                         I love him too... I don't think I \n                         ever knew how much until now.\n\n               There is a long pause as she looks at Ted, unable to speak.\n\n               Finally:\n\n                                     JOANNA\n                              (a deep breath, then:)\n                         Ted, when we got married it was \n                         because I was twenty-seven years old \n                         and I thought I should get married \n                         and... when I had Billy it was because \n                         I thought I should have a baby... \n                         and I guess all I did was mess up my \n                         life and your life and \u0096\n\n                                     TED\n                         Joanna, what the hell is \u0096\n\n                                     JOANNA\n                              (urgent)\n                         Please... Please don't stop me. This \n                         is the hardest thing I've ever had \n                         to do..\n\n               ON TED\n\n               Struck by the urgency in her voice.\n\n                                     JOANNA\n                         After I left... when I was in \n                         California, I began to think, what \n                         kind of mother was I that I could \n                         walk out on my own child. It got to \n                         where I couldn't tell anybody about \n                         Billy \u0096 I couldn't stand that look \n                         in their faces when I said he wasn't \n                         living with me. Finally it seemed \n                         like the most important thing in the \n                         world to come back here and prove to \n                         Billy and to me and to the world how \n                         much I loved him... And I did... And \n                         I won. Only... it was just another \n                         \"should.\"\n                              (she begins to break \n                              down)\n                         ...Sitting in that courtroom. Hearing \n                         everything you did, everything you \n                         went through... Something happened. \n                         I guess it doesn't matter how much I \n                         love him, or how much you love him. \n                         I guess it's like you said, the only \n                         thing that counts is what's best for \n                         Billy. I don't know, maybe that's \n                         all love is anyway... Ted, I think \n                         Billy should stay with you...\n\n                                     TED\n                              (stunned)\n                         What?\n\n                                     JOANNA\n                              (she reaches out, \n                              takes his hand)\n                         He's already got one mother, he \n                         doesn't need two... He's yours...\n                              (her last ounce of \n                              reserve crumbles)\n                         I won't fight you for him any more. \n                         He's yours...\n\n                                     TED\n                         Oh, God... Oh, my God...\n\n                                     JOANNA\n                         Only can I still see him?\n\n                                     TED\n                         No more waiting in Coffee Shops... I \n                         promise.\n\n               Joanna's last ounce of reserve crumbles, she begins to sob. \n               Ted puts his arms around her and holds her. They do not kiss. \n               Then, after a few moments she steps back.\n\n                                     JOANNA\n                              (chin high)\n                         Okay... I think I'll go talk to my \n                         son now.\n                              (wiping her eyes)\n                         How do I look?\n\n                                     TED\n                         Beautiful.\n\n               They step into the elevator and, as the doors close, blocking \n               them from view, we...\n\n                                                               DISSOLVE TO:\n\n               EXT. STREET \u0096 DAY\n\n               ON TED AND BILLY\n\n               TRACKING JUST IN FRONT OF THEM as they walk to the park. \n               They are deep in conversation, although we are too far away \n               to bear what they are saying. HOLD ON THEM and, as they reach \n               the entrance to the park, Billy first, then Ted begin to \n               run, overwhelmed with the sheer joy of being alive, of being \n               together. As they continue to run, THE CAMERA PULLS BACK AND \n               UP AND WE SEE that they are only two among thousands of \n               parents and children in Central Park on a sunny afternoon. \n               THE CAMERA CONTINUES TO PULL BACK until they are lost from \n               view and it is...\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\nKramer vs Kramer\nWriters :   Robert Benton\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:28:49.984985"}