{"title": "Labor of Love", "film_link": "/Movie Scripts/Labor of Love Script.html", "script_link": "/scripts/Labor-of-Love.html", "info_raw": "\n\nLabor of Love Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.60 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  M. Night Shyamalan\nGenres  Drama  Romance\n\nRead \"Labor of Love\" Script\n\n\n", "script": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                         LABOR OF LOVE\n\n                              by\n\n                      M. Night Shyamalan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFADE IN:\n\nEXT.  ROUTE 476 - OUTSKIRTS OF PHILADELPHIA - NIGHT\n\nA three lane highway relegated to one lane.  The serpentine\nline of cars bottlenecks as it slithers by.  An arch of\nORANGE AND RED FLARES outlines the area of shattered glass\nand twisted metal.\n\nWe are at the site of a gruesome car accident.  An ambulance\nand four police cars are on the scene.  Two cars are involved\nin the crash.  The first, a SILVER CADILLAC with its front\ncaved in a perfect semi-circle; there is no-one inside the\ncar.\n\nThe second car is a different story entirely.  A DARK GREEN\nHONDA PRELUDE crushed against the concrete median that\nseparates the South-bound lanes from the North-bound lanes.\nAll the windows have imploded.  The original seventeen foot\nlength of the car, compressed to ten.  The hood has folded\nback into the front seat.  This car is not empty!  Through\nthe sliver that used to be a window, WE SEE a female hand,\npurple, swollen and bloody.\n\nSome drivers have stopped their cars on the shoulder and have\nwalked over to the flares.  A set of cops wave them back.\n\n                    POLICE OFFICER\n          Get back in your cars and continue\n          with the traffic.  There is nothing\n          you can do.\n              (beat)\n          Get back in your cars...\n\n                                                  CUT TO:\n\nOFFICER PIERCE speaks to a female OFFICER DANA.\n\n                    OFFICER PIERCE\n          What's the story?\n\n                    OFFICER DANA\n          She's been dead about ten minutes.\n          The jaws are on the way... Ran a\n          license check.  Her name is Ellen\n          Parker.  Forty-two years old.\n\n                    OFFICER PIERCE\n          What about him?\n\nPierce gestures to a HISPANIC TEENAGER who is cuffed behind\nhis back and being led to a police car.\n\n                    OFFICER DANA\n          D.U.I.\n\n                    OFFICER PIERCE\n          Shit... How old is he?\n\n                    OFFICER DANA\n          Seventeen.  It's his grandfather's\n          car.  On his way back from drinking\n          with the 'boys'.\n\nPierce lets it sink in.\n\n                    OFFICER PIERCE\n          Who do we contact for her?\n\nDana checks the papers in her hand.\n\n                    OFFICER DANA\n          Her husband.  Maurice Parker.  They\n          live in Wynnewood.  Married\n          seventeen years.\n\nPierce looks back at what remains of the HONDA PRELUDE.\nBeat.\n\n                    OFFICER PIERCE\n          There isn't any good left in the\n          world, Dana.  Not one damn thing.\n\nCLOSE UP of the hypnotic RED AND BLUE LIGHTS that consume the\nhighway.\n\n                                             DISSOLVE TO:\n\nEXT.  ROAD - EARLY MORNING\n\n                    \"TWO WEEKS EARLIER\"\n\nJust AFTER DAWN.  A gentle mist hangs in the air.  The calm\nsuburban streets wait to be flooded with a sea of middle\nclass homeowners on their way to work...\n\nA woman's REEBOK CROSS-TRAINERS move along the sidewalk...\nlong, brisk steps, steps people have when walking with a\npurpose...\n\nThe Cross-Trainers enter the doors of a bakery store seconds\nafter a man turns a window-sign from \"CLOSED\" to \"OPEN\"...\nThis happens with precision timing, not losing a step... a\nwell practiced routine.\n\n                                                  CUT TO:\n\nINT.  ANGELO'S BAKERY - MORNING\n\nANGELO, a large man, black slicked hair -- has laid out three\nidentical loaves of RAISIN BREAD on the counter.\n\n                    ANGELO\n          Very good batch today.\n\nWe finally see the person standing in the REEBOK CROSS\nTRAINERS... MRS. ELLEN PARKER, a woman in her forties with a\nheart-warming smile and wise glint in her eyes.  The kind of\nwoman that somehow becomes more beautiful with age.\n\nShe carefully squeezes each loaf.  Her hand hovers over the\nmiddle loaf.\n\n                    ELLEN\n          That one.\n\n                                                  CUT TO:\n\nINT.  KITCHEN - MORNING\n\nTwenty minutes later.  The basket of the \"chosen\" raisin\nbread is placed on the center of a table.  Ellen covers it\nwith a cloth napkin.\n\nThe eggs sizzle in a pan.  We find Ellen cooking breakfast.\nA stunning African Grey Parrot sits proudly on Ellen's\nshoulder.  CLAUDE is a breathtaking creature with grey\nfeathers and a cherry red tail.\n\nThe DOOR BELL RINGS.\n\n                                                  CUT TO:\n\nFRONT DOOR\n\nwhere a delivery man hands over a bouquet of VIOLET ORCHIDS.\nClaude, still perched on Ellen like a clothing accessory,\nspreads his impressive wings defensively.  The delivery man\nscans the far wall to find a collection of bird photographs.\nA dazzling collection of all kinds of birds, elaborately\nframed and hung.\n\nEllen signs the release and closes the door.  She takes a\ndeep smell of the violet orchids and looks down the hall to\nthe open bedroom door with a glowing smile.  We CATCH A\nGLIMPSE of a man dressing.\n\n                                                  CUT TO:\n\nKITCHEN\n\nWhere Ellen and her husband are eating breakfast.  Claude is\nnow in a cage in the hallway.\n\nMR. MAURICE PARKER eats a buttered piece of raisin bread.  He\nis a man in his late forties, neatly combed hair, his New\nYork Times folded into a manageable rectangle.  This is a man\nwho has been seated a great deal of his life... the type of\nman who breaks into a sweat when taking out the garbage.\n\nHe feels a stare and looks up to find his wife with that\nglowing smile.  He smiles back.\n\nEllen gestures with her eyes to the violet orchids now\ndisplayed proudly on the window ledge.\n\n                    MAURICE\n          Yes?\n\n                    ELLEN\n          The flowers... they're beautiful.\n\nMaurice studies them.\n\n                    MAURICE\n          They are... who sent them?\n\nBeat.  This takes Ellen by surprise.  Maurice catches the\nexpression.\n\n                    MAURICE\n          You thought I sent them?\n\n                    ELLEN\n              (disappointed)\n          There was no card.\n\nMaurice reaches over and searches the bouquet.\n\n                    MAURICE\n          Have I forgotten something?  Is\n          this a special day?\n\n                    ELLEN\n              (flat)\n          It's just a regular day.\n\nMaurice pulls out a small bent card from between the stems.\n\n                    MAURICE\n          It's from Dan and Kate Wilkins...\n          for dinner last week...\n\nMaurice hands Ellen the card, she looks at it uninterested.\n\n                    MAURICE\n          It's a special day isn't it?\n\n                    ELLEN\n          Well, I'm sure it's not Christmas,\n          because you'd be worried about how\n          much money we don't have to spend\n          on each other... I know it's not\n          New Years, because you'd be going\n          on and on about wearing a tuxedo\n          and how much you don't like to\n          dance... and I'm sure it's not our\n          anniversary, because I didn't find\n          an envelope with a hundred dollars\n          cash on my bureau with a note that\n          says, 'Pick out something\n          pretty'... Yes -- Maurice -- I'm\n          virtually certain it's not a\n          special day today.\n\nEllen begins to eat.  Maurice stares at her...\n\n                    MAURICE\n          You're mad at me... You were\n          beaming a minute ago, but since I\n          didn't send the flowers... now\n          you're mad at me.\n\nBeat.\n\n                    MAURICE\n          Why would I send flowers?  What's\n          the occasion.\n\nEllen instantly becomes emotional.\n\n                    ELLEN\n          Occasion?  Because you love me...\n          That's the occasion.\n\nEllen returns to eating.  Maurice stares at her quietly.\n\n                                                  CUT TO:\n\nINT.  BOOKSTORE - MORNING\n\nA SHAFT OF LIGHT penetrates the darkness of a room... growing\nLARGER as the door swings open.\n\nEllen steps in first followed by Maurice.  Ellen goes\nstraight for the blinds.  BURST OF LIGHT stab the room.\n\nThe spines of the BOOKS catch the light... rows and rows of\nbooks cradled by a maze of mahogany book shelves.  This is an\nold-fashioned store with antique chairs at select places.  A\ncoffee table sits near the window with a set of deep\ncushioned sofa-chairs.  This store is a home...\n\nMaurice moves behind the counter and TURNS ON THE RADIO.\nCHOPIN FLOWS from the old speakers atop the corner shelves --\ndelicately.\n\nEllen opens the door to the store and locks it in that\nposition with a slanted piece of wood... The store is now\nopen.\n\n                                                  CUT TO:\n\nINT.  BOOKSTORE - DAY\n\nHalf a dozen people wander the isles.  Maurice's eyes drift\nto a pair of eleven year olds who have sauntered into the\nstore.  One boy disappears behind \"Philosophy\" and reappears\nmomentarily with his sweat-shirt zipped up to his neck -- a\nrectangle is outlined under his shirt.\n\n                    MAURICE\n          I see that!\n\nMaurice comes around the corner -- the boys HAUL ASS out of\nthe store.  They're long gone before Maurice reaches the\ndoor.  He yells after them.\n\n                    MAURICE\n          I'm getting a Doberman!  Two!\n\nEllen who is sitting in the back room doing the accounts,\ncomes out when she hears the commotion.\n\n                    ELLEN\n          You've been saying that for two\n          years; I think they know you're\n          bluffing.\n\nMaurice inspects the \"Philosophy\" section.\n\nMaurice looks up as a young man, early twenties, hurries in.\nKRIS REDDY walks past Maurice, his black locks of hair\npeeking out from under his Philadelphia Eagles cap.\n\n                    KRIS\n              (to Maurice)\n          Lizy Bennett?\n\n                    ELLEN\n          Hi Kris.\n\nKris waves as he removes his jacket.  He is wearing a PARKER\nBOOKS T-shirt underneath.  He pins an \"Assistant Manager\" tag\non.\n\nMaurice thinks to himself.\n\n                    MAURICE\n          Lizy, Eliza... Elizabeth Bennett...\n              (the answer comes to him)\n          Pride and Prejudice.\n\n                    KRIS\n          You're amazing.\n\n                    MAURICE\n          It has to be a full character's\n          name.\n\n                    KRIS\n          They called her 'Lizy' in the\n          book...\n              (beat)\n          Sorry I was late.  My jeep died on\n          the way over from the paper.\n\n                    MAURICE\n          They printed your article on, 'Dry\n          Verses Can Dog Food'... Very\n          enlightening.\n\n                    KRIS\n          Pulitzer, here I come.\n\nKris notices as Maurice goes back to searching the isles.\n\n                    KRIS\n          What happened?\n\n                    MAURICE\n          Never have children.  If they're\n          not a burden to you, they're a\n          burden to someone else.\n\n                    ELLEN\n              (on the end of his words)\n          Kris, go to the pharmacy.  Ask Mr.\n          Donnavan to get you a large bottle\n          of Geritol... Tell him, Maurice has\n          officially become a grumpy old man.\n\n                    KRIS\n          What'd they take this time?\n\n                    MAURICE\n          Nietzsche!... As if they're going\n          to read Nietzsche.\n\nMaurice moves back behind the counter clearly irritated.\n\n                    ELLEN\n          They pick on you because they can\n          get a rise out of you... children\n          can sense those things.\n\nKris quickly opens his black shoulder bag and pulls out a\nmini-tape recorder.  He talks into it -- dead serious.\n\n                    KRIS\n          Monday -- August 24... Juvenile\n          delinquency -- Are the victims to\n          blame?\n\nCLICK.  The tape recorder returns to the bag.  Ellen stares\nat him curiously.\n\n                    KRIS\n          Story ideas.  I'll forget them\n          otherwise.\n\nEllen nods with realization.  Ellen and Kris turn their\nattention to Maurice who is mumbling to himself angrily.  He\nlooks out the window to the street to see a familiar group of\nschool boys waving at him tauntingly.\n\n                                                  CUT TO:\n\nINT.  CHINESE RESTAURANT - NIGHT\n\nDIMLY LIT.  Red and gold paper mache lanterns are sprinkled\naround the room.  WE FIND Ellen and Maurice polishing off a\ndish of General Tso's Chicken.\n\n                    MAURICE\n          Two thousand square feet... We can\n          add a used book section.\n\nEllen is not listening.  She is staring at a young couple two\ntables over, who can't take their eyes off each other.\n\n                    MAURICE\n          Next door is a jewelry store with a\n          full-time security guard... He\n          stands outside all day.  Let's see\n          them try and take Nietzsche then...\n\nMaurice finally notices Ellen is not listening.\n\n                    MAURICE\n          Ellen?\n\n                    ELLEN\n              (snapping out of it)\n          What?\n\n                    MAURICE\n          The new store?\n\n                    ELLEN\n          Honey, I told you.  If it makes you\n          happy, we should just do it.\n\n                    MAURICE\n          It's a tremendous amount of work --\n          moving.\n\n                    ELLEN\n          We can do it together.\n\nMaurice needed the support.  His face brightens.\n\n                                                  CUT TO:\n\nLATER\n\nAn empty table.  The dishes have been cleared.  Maurice and\nEllen are opening their fortune cookies.\n\n                    MAURICE\n          What's your's say?\n\nBeat.\n\n                    ELLEN\n          ... Love is shown through actions\n          not just words.\n\n                    MAURICE\n          What's that?  That's not a\n          fortune... You will be rich...\n          That's a fortune.  What you have is\n          a statement.\n\n                    ELLEN\n          What it is -- is the truth.\n\n                    MAURICE\n          I don't follow.\n\nBeat.\n\n                    ELLEN\n          Maurice, what would you do for me?\n          What would you do for our love?\n          I'm not talking about saying, I'm\n          talking about doing.\n\nMaurice notices the STRAIN IN HER VOICE.\n\n                    MAURICE\n          Is this going to be similar to the\n          flower incident?\n\n                    ELLEN\n              (very emotional)\n          Sometimes people need to see things\n          done for them -- because sooner or\n          later they don't believe the words\n          anymore.\n\n                    MAURICE\n              (raising his voice)\n          You don't think I love you?\n\nCustomers react.\n\n                    ELLEN\n              (lowering the volume)\n          I want to be shown...\n              (beat)\n          Maurice would you do anything for\n          me?\n\n                    MAURICE\n          Yes.\n\n                    ELLEN\n          Anything?\n\n                    MAURICE\n          What do you want from me?  Would I\n          swim across an ocean for you?...\n          Would I walk across the United\n          States for you?  Yes... Yes I\n          would.  You know that.\n\n                    ELLEN\n              (soft)\n          No I don't.  I don't even know if\n          you'd walk across the street for\n          me.\n\nMaurice is getting redder by the second.  The entire\nrestaurant hangs on his response...\n\n                    MAURICE\n          So what have you done for me that's\n          so earth-shattering?\n\nThe waiter closest to the table cringes with Maurice's words.\nEllen drains of color.  She stares at him in complete and\nutter disbelief.  She drills him with this iron glare for an\neternity then grabs her purse and heads to the exit.  Maurice\nstares at the table for a moment to gather what's left of his\ndignity and follows her out.\n\nThe waiter moves to the table and clears the aftermath.  He\nsees Ellen's fortune crumpled next to her tea cup.  He\nunravels it.  The fortune reads...\n\n          \"YOU ARE A FRIENDLY AND GENEROUS PERSON.\"\n\n                                                  CUT TO:\n\nINT.  BEDROOM - DAY\n\nThe room is LIT BY ONE BEDSIDE LAMP.  Maurice is sitting in\nbed wearing a robe.  Reading glasses at the end of his nose\nas he rubs a yellow cloth over a SILVER MEDALLION.  The\nmedallion has a raised picture of a lamp, the kind Aladdin\nuses, seated on an open book and the words BOOK SOCIETY -\n1992.  Maurice meticulously rubs away the smudge marks.\n\nEllen is at the edge of the bed -- as far from Maurice as\npossible.  Her back is to him as she sleeps under the covers.\nShe speaks without turning around.\n\n                    ELLEN\n          Why do you polish that thing all\n          the time?\n\n                    MAURICE\n          You're talking to me?\n\n                    ELLEN\n          Why do you polish it?\n\nMaurice studies the impressive silver medallion.\n\n                    MAURICE\n          A Book Society Award is a very\n          prestigious thing.\n\n                    ELLEN\n          Why are you polishing it -- in bed\n          -- in your pajamas -- at 11:15 at\n          night?  Are you going to show it to\n          someone?\n\n                    MAURICE\n          No.\n\n                    ELLEN\n          Then why?\n\n                    MAURICE\n          There's no reason.\n\n                    ELLEN\n          Exactly.  No reason.  No occasion.\n          It just makes you feel good to do\n          something for it, to express your\n          pride and affection for it some\n          how...\n              (beat)\n          How come you'd do that for a piece\n          of metal and not for me?\n\nMaurice has no answer.  He just stares at his hands.\n\nELLEN'S face can be seen under the covers facing away from\nMaurice.  Her eyes are red.  The tears roll off her nose and\nland on the pillow unseen and unheard.\n\n                                                  CUT TO:\n\nINT.  KITCHEN - MORNING\n\nThe kitchen table is mockingly empty.  No bread.  Not even a\ncrumb.  Maurice, dressed for work, eyes the table with great\nresolve.  He rubs his hands together ceremoniously.\n\n                    MAURICE\n          I can do this.\n\nMaurice moves to the fridge and gets out two eggs, onions,\ngreen peppers and mushrooms.\n\nCLAUDE is chirping INCESSANTLY FROM THE HALL.\n\nThe pile teeters precariously in Maurice's arms as he moves\nto the counter.  Next the pans come out -- He tries to pull\nthe bottom pan from the cabinet --\n\n                                                  CUT TO:\n\nBEDROOM\n\nEllen is seated in bed, arms crossed -- equal resolve in her\nface.  A LARGE METALLIC CRASH OF POTS ECHOES FROM DOWNSTAIRS.\nEllen grabs her robe.\n\n                                                  CUT TO:\n\nHALLWAY\n\nEllen gently takes Claude out of his cage.  She kisses him.\nThe bird, once frantic, instantly at peace.\n\n                    ELLEN\n              (whispering)\n          You missed mommie... worried when I\n          didn't come down... my baby... so\n          sweet.\n\nEllen feeds the bird as she peeks around the corner, careful\nnot to be seen.  Maurice is desperately trying to cook an out\nof control omelette.  It spills over the sides and SIZZLES on\nthe range top.  He tries to scoop it up with the pan, tilting\nit further -- further -- the entire omelette slides onto the\nrange.  Maurice frantically tries to wrangle it back in.  Man\nvs. Egg.  Man losing.\n\nEllen has to keep herself from laughing.  Her expression\nchanges to pity as she watches the chaos unfold.\n\n                                                  CUT TO:\n\nINT.  BAKERY - MORNING\n\nEllen scrutinizes a new three loaves of raisin bread.\n\n                    ELLEN\n          That one.\n\nAngelo smiles and packages the chosen loaf.\n\n                                                  CUT TO:\n\nINT.  KITCHEN - MORNING\n\nA defeated Maurice is eating an apple.  He looks up with\nsurprise as Ellen walks into the kitchen from the back door,\na bag under her arm.  She glances at him and then moves to\nthe counter where she prepares the bread for serving.  Ellen\nlooks down into the trash to find the rebellious omelette\nsitting uneaten.\n\nThe bread gets laid out in its usual basket, in its usual\nmanner.  Maurice says nothing as Ellen pulls two eggs from\nthe fridge and cracks them on a sizzling pan with expert\nease.\n\n                    ELLEN\n          Onions?\n\nMaurice smiles warmly at his wife's back before moving to her\nand hugging her from behind.  He whispers in her ear.\n\n                    MAURICE\n          Why do you put up with me?\n\nBeat.\n\n                    ELLEN\n          Love... has something to do with\n          it.\n\nMaurice reaches over and turns off the stove.  He then turn\nEllen around and kisses her long and hard.  Ellen pulls away\ngently and stares into his eyes.  Maurice looks very\nemotional.\n\n                    MAURICE\n          I do love you... very, very much.\n\n                    ELLEN\n          Show me.\n\n                    MAURICE\n              (with all his heart)\n          I will -- I promise.\n\nEllen kisses Maurice and returns to the eggs.  Maurice\ncontinues to hug her from behind.  The MORNING SUN pours into\nthe kitchen covering Ellen and Maurice in a golden bath.\n\n                                                  CUT TO:\n\nINT.  EMPTY STORE - AFTERNOON\n\nA large black man wearing a dress shirt, sleeves rolled up to\nthe elbows TURNS ON a switch.  A SET OF TUBE LIGHTS FLICKER\nTO LIFE.\n\nCARL STONE leads Maurice out to the main room which is\npresently a cob-web infested, barren space with a few\ndiscarded packing boxes left in the corners.\n\nMaurice runs his fingertips against the wall.\n\n                    MAURICE\n          History and the arts will be\n          here...\n\nHis hand makes a grand swirl pointing to another area.  He\nsays the next two words with great awe as if he was saying\nsomething holy.\n\n                    MAURICE\n          The Classics...\n\nCarl watches curiously as Maurice walks around in a trance.\nHe moves to the bay window that over looks the street.\n\n                    MAURICE\n          We'll have a hand-painted sign...\n              (another grand swirl)\n          ... Parker Books.\n\nMaurice's already bright eyes, brighten even more as he spots\nthe security guard strolling up and down the front of the\njewelry store.  The guard catches his stare and waves.\nMaurice is aglow... He turns to Carl.\n\n                    MAURICE\n          This is my dream... it's finally\n          here.\n\nCarl has to smile -- rarely does he see someone so happy.\n\n                                                  CUT TO:\n\nINT.  OFFICE ROOM - AFTERNOON\n\nWe are in Carl's cramped upstairs office... just enough room\nto walk amongst the file cabinets.\n\nMaurice holds his pen over the documents before him.\n\n                    MAURICE\n          I wish my wife were here.  She\n          should see this...\n              (stalling)\n          She had a doctors appointment in\n          Blue Bell.  That's a one and a half\n          hour drive.  Ellen's been going to\n          that doctor since she moved to\n          Pennsylvania...\n\n                    CARL\n              (understanding)\n          We could do this tomorrow?\n\n                    MAURICE\n          Ellen gave me strict orders to sign\n          it... We invited some friends over\n          -- you see, for a celebration.\n\nCarl smiles patiently, he's seen this before.\n\nMaurice gathers his strength as he puts pen to paper... He\nscribbles his signature quickly and let's the pen drop to the\ntable top as if all the energy drained from his body.  He\nlooks up to Carl with powerful eyes.\n\n                    MAURICE\n          Every journey begins with one step\n          right?\n\nBeat.\n\n                    CARL\n          Enjoy your party Mr. Parker... Your\n          new store will be waiting for you\n          Monday morning.\n\nCarl and Maurice shake hands like best friends.\n\n                                                  CUT TO:\n\nINT.  HOUSE - NIGHT\n\nA wine chiller sits proudly on the coffee table.  The SOUNDS\nOF LIGHT CONVERSATION float through the room.  About ten\nfriends and family have gathered.\n\nMaurice sits on the sofa nearest the window.  He's listening\nto the drone of TED PRICE.\n\nEllen is not present.\n\n                    TED\n          ... So she says the \"L\" word, after\n          two dates, the \"L\" word!  She says\n          'Don't you believe in true love?\n          Love that can conquer all?'  I say,\n          'Whoa, hold on.  Just so we're\n          clear on things, I think love these\n          days is shit.  It don't mean a\n          thing and it don't stand for\n          nothing.  Shit.'... You know what\n          she says, 'Fine, but how do you\n          feel about kids?'\n\nEveryone near the SOFA LAUGHS.  A CAR LIGHT DANCES ON THE\nCURTAINS... Maurice quickly pulls the curtain aside and\nwatches as the car pulls past the house and around the\ncorner.  Maurice turns back from the window hiding his\nconcern and without missing a beat...\n\n                    MAURICE\n          It's nice to see you don't have any\n          scars from your divorce.\n\nThis brings on another ROUND OF LAUGHTER.\n\nTHE TELEPHONE RINGS.\n\nMaurice rises from his seat -- but is waved off by ADELLE\nMATLIN who picks up the phone right away.  Adelle is\nMaurice's niece, early thirties, very attractive and always\nsmiling -- except at this moment.\n\nTed begins another one of his stories -- the words are\nincoherent as Maurice watches Adelle carefully... Adelle\nturns her back to the room as she talks and then DISAPPEARS\ninto the kitchen stretching the phone cord around the\ndoorway... Something is definitely wrong.\n\nMaurice steadies his gaze at the door of the kitchen...\neternal seconds pass before Adelle appears again.  She looks\ndifferent -- ghostly.  She glances up for a fraction of a\nsecond locking eyes with her uncle -- she immediately looks\naway.\n\nMaurice watches Adelle move to her husband GERALD and\nwhispers in his ear.  Gerald changes instantly -- taking on\nthe same ghostly transformation -- his eyes dart to Maurice.\n\nTed's story is cut off as Maurice speaks LOUDLY...\n\n                    MAURICE\n          What's wrong?\n\nThe room goes SILENT as all eyes fall on Adelle and Gerald.\n\n                    GERALD\n              (shaking)\n          Maurice, can we go into the dining\n          room?\n\nBeat.\n\n                    MAURICE\n          What's happened to my wife?\n\nThis hits everyone in the room like a bomb.  A dread hangs\nover every passing second... Gerald crumbles under the\nmoment... Adelle begins to cry.\n\n                    GERALD\n          There was a car accident... Drunk\n          driver.\n\nSome of the crowd reacts.  A women covers her mouth.  The\nmoment is unbearable.\n\n                    MAURICE\n              (to himself)\n          Please God -- don't do this.\n\nGerald cracks -- the tears start to flow from his eyes.\n\n                    GERALD\n          Maurice, it was serious... I don't\n          know how to --\n\nGerald buries his face into the heels of his palms as if\ntrying to contain an explosion in his head.\n\n                    GERALD\n          Oh Jesus, please help me... She\n          didn't... Ellen didn't make it...\n          Ellen's dead Maurice.\n\nMaurice closes his eyes shut tightly... like a child scared\nof the dark.\n\nAdelle blacks out, knocking over the wine chiller on the way\nto the ground.  In less than a minute the room has\ntransformed from a celebration to a mourning.  Everyone is\nfrozen staring at Maurice for their cue... A child in her\nmother's arms begins to cry as if aware of the circumstances.\n\nEXTREME CLOSE UP.  Maurice opens his eyes slowly.  The room\nstays still as Maurice stares at Ellen's HAT sitting on the\npiano.\n\n                                             DISSOLVE TO:\n\nEXT.  PARKER HOUSE - MORNING\n\nA \"FTD\" Florist truck pulls up.  A delivery man, moves with\nan extravagant bouquet of flowers to the front door.  He\nRINGS THE DOOR BELL.  No answer.  KNOCKS.  No answer.\n\nThe delivery man looks to the ground and searches, before\nplacing the bouquet on the porch.\n\nWE NOW SEE that the porch is completely covered with flowers,\nbouquets and wreaths.  The delivery man tip-toes his way\nthrough the maze of condolences and moves to his truck.\n\n                                                  CUT TO:\n\nINT.  KITCHEN - MORNING\n\nMaurice waits, as the SOUND OF THE FLOWER TRUCK FADES AWAY,\nthen looks into Claude's cage.  Claude sits on the highest\nperch and continues to call to his mother.  Maurice stares at\nthe pile of untouched food on the floor of the cage.\n\n                    MAURICE\n          Eat the food Claude...\n\n                                                  CUT TO:\n\nLATER\n\nMaurice seated at the kitchen table.\n\nHe looks at the bouquet of flowers still seated on the window\nsill.  The violet orchids are all dead and shriveled up.\n\n                                             DISSOLVE TO:\n\nINT.  PARKER HOUSE - NIGHT\n\nThe house feels abandoned -- lifeless.\n\nTHE HOUSE IS SILENT EXCEPT FOR THE FRANTIC CHIRPING OF CLAUDE\nFROM THE HALL.  His hopeless cries punctuating the air every\nfew seconds.\n\n                                                  CUT TO:\n\nBEDROOM\n\nMaurice sits in a chair facing Ellen's wardrobe closet.  The\nLIGHTS IN THE ROOM ARE OFF.  The room is lit only by the\nLIGHT FROM THE HALLWAY STREAMING IN AT AN ANGLE.\n\nMaurice gets up and with a great deal of uncertainty, opens\nthe closet.  Maurice stares at the collection of hanging\ndresses.\n\nHe reaches out and pulls the cloth of a floral dress towards\nhim... He closes his eyes and smells the cloth... his face\ntightens in pain... both hands cling to the dress tightly...\nhe tries desperately, can't fight it -- Maurice Parker begins\nto cry.\n\nHis hands grab frantically at the rest of the dresses --\npressing them to his face and chest.\n\n                    MAURICE\n          Oh God... I'm sorry Ellen... I'm so\n          sorry...\n\nHe hugs the dresses as if they were her.  His weeping turns\nto a torturous wail of grief... all the love, all the anger\nspilling out in this one moment.\n\nHe falls to the ground yanking all the dresses down with him\n-- they collapse atop him... He buries his face in his wife's\nclothes...\n\nThe MUFFLED SOUND OF HIS CRIES ECHOES through the lonely\nhouse.\n\n                                             DISSOLVE TO:\n\nEXT.  PARK - MORNING\n\nThe neighborhood park.  The trees in full bloom.  Maurice\nwalks down a path leading to the open fields.  Only mothers\nwith strollers and the elderly are out this early.\n\n                                                  CUT TO:\n\nPARK BENCH\n\nMaurice is seated on a park bench.  Across from him is an\nELDERLY COUPLE -- in their seventies.  The OLD WOMAN is frail\nwith tiny eyes that disappear when she smiles.  The husband\nis a skinny man with a baseball hat that makes him look like\na little boy.\n\nMaurice watches them silently as they sit and hold hands...\nTheir warm laughs and whispered conversations stinging him.\nHe watches as the old man gets up.  The old woman tries to\nmake him stay, but he playfully pulls away.  She shakes her\nhead like a shy school girl as the old man walks back down\nthe path by himself.\n\nThe old woman glances Maurice's way.\n\n                    OLD WOMAN\n          Good morning.\n\n                    MAURICE\n          Good morning.\n\nThe old woman glances at the empty baby carriage standing\nnext to the bench.\n\n                    OLD WOMAN\n          Is it a boy or a girl?\n\n                    MAURICE\n          Oh, that's not mine.\n\nMaurice gestures to the woman and baby who are sitting on a\nblanket in the grass.\n\n                    MAURICE\n          I don't have kids.\n\n                    OLD WOMAN\n          You should.  Children are a\n          blessing from God.  I have four.\n\nThe old woman studies him.\n\n                    OLD WOMAN\n          Are you okay?\n\nBeat.\n\n                    MAURICE\n          Is that your husband?\n\nShe nods, \"Yes.\"\n\n                    MAURICE\n          You look so happy -- how long have\n          you been married?\n\n                    OLD WOMAN\n          Forty-seven years.\n\nThis hits Maurice hard.\n\n                    OLD WOMAN\n          Are you married?\n\nThis hits Maurice even harder.\n\n                    MAURICE\n              (this is painful)\n          Yes... Seventeen years.\n\nThe old woman looks down the path for her husband.\n\n                    MAURICE\n          Where did he go?\n\n                    OLD WOMAN\n          He's getting my sweater from the\n          car.  I said there was a breeze.\n              (shaking her head)\n          I told him not to go.\n\nBeat.\n\n                    MAURICE\n          May I ask you a question that might\n          sound strange?\n\n                    OLD WOMAN\n          Yes.\n\nBeat.\n\n                    MAURICE\n          How do you know he loves you?\n\nThe old woman looks at him oddly.\n\n                    MAURICE\n          I mean besides... time -- how did\n          you know ten years ago -- twenty\n          years ago?\n\nShe thinks hard... tough question.  No answer for a moment\nthen --\n\nThe old woman sees something out of the corner of her eye --\nher husband is walking up the path with her white lace\nsweater over his arm...\n\nShe smiles as the answer comes to her.\n\n                    OLD WOMAN\n          Because he shows me... he's not\n          much for words, but he shows me.\n\nMaurice sits back -- her answer lingers in the air like a\nhaunting voice.\n\nMaurice watches as the old man comes back and drapes his wife\nwith the sweater.  The old woman waves as they continue down\nthe path... hand in hand.\n\n                                                  CUT TO:\n\nINT.  DOCTORS OFFICE - DAY\n\nAn obese woman with a hacking cough sits to the left of\nMaurice... To the right, a man with a patch over his eye.\n\n                    NURSE\n          Parker... Maurice Parker.\n\nThe nurse sticks her head outside the glass divider till\nMaurice stands up.\n\n                                                  CUT TO:\n\nEXAMINATION ROOM\n\nDR. ROYCE checks a chart.  Maurice watches him from his perch\non the examination chair.\n\n                    DR. ROYCE\n          So what's the deal Maurice?\n\n                    MAURICE\n          Pardon?\n\n                    DR. ROYCE\n          I mean why the sudden voluntary\n          visit  -- usually it takes gun-\n          point to get you in here...\n\n                    MAURICE\n          Routine, I assure you.  I just\n          wanted to gage my health.  Am I\n          healthy?\n\n                    DR. ROYCE\n          Yes -- you are.\n\n                    MAURICE\n          I'm going to ask you a question\n          that may sound peculiar.\n\nDr. Royce folds his arms and waits... What's this all about?\n\n                    MAURICE\n          How far could an individual walk if\n          they had no athletic training --\n          you understand, just an ordinary\n          person?\n\nDr. Royce stares at him suspiciously.\n\n                    DR. ROYCE\n          I know what you're getting at.\n\n                    MAURICE\n          You do?\n\n                    DR. ROYCE\n          I've seen it before.\n\n                    MAURICE\n          You have?\n\n                    DR. ROYCE\n          You're feeling old and you want to\n          start exercising.  A lot of men\n          your age feel the need to recapture\n          their youth.  Don't feel\n          embarrassed about it.\n\n                    MAURICE\n              (playing along)\n          Okay.\n\n                    DR. ROYCE\n          You should start slow and easy --\n          fifteen minutes a day.\n\n                    MAURICE\n          No.  How far in one attempt --\n          what's the farthest someone like\n          myself could walk?\n\nThe doctor is confused again.\n\n                    MAURICE\n          Just for curiosity sake that's all?\n\n                    DR. ROYCE\n          I don't know -- maybe twenty\n          miles... Of course I'm not\n          recommending that... if someone\n          like you had to I mean... that's\n          how far they'd probably get before\n          encountering serious physical\n          walls.\n\n                    MAURICE\n          Twenty miles?  I see.\n\nMaurice thinks about it carefully as the doctor returns to\nthe chart.\n\n                                                  CUT TO:\n\nINT.  AAA AUTO CLUB - DAY\n\nA hip young woman with her forehead wrapped in a headband\nchews away on a stick of gum.  JOSELLE leans over the counter\nwith Maurice and studies a map.\n\n                    JOSELLE\n          Each inch represents 150 miles...\n\n                    MAURICE\n          Making the grand total?\n\n                    JOSELLE\n          Damn baby, relax.  I'm getting to\n          it.\n              (taking on a rehearsed\n               tone)\n          From Philadelphia following the\n          route highlighted to Pacifica\n          California -- you're traveling an\n          estimated three thousand two\n          hundred miles...\n\nMaurice is a bit pale.  He follows the yellow highlighted\nhighways winding it's way across the U.S.\n\n                    MAURICE\n          Three thousand miles?... How many\n          times does twenty go into three\n          thousand?\n\n                    JOSELLE\n          What was that?\n\n                    MAURICE\n          Perhaps there's another route?\n\n                    JOSELLE\n          This is the route approved by\n          triple A.  Even if you followed\n          back roads the entire way, you'd\n          still be looking at roughly the\n          same distance...\n\nJoselle studies his concerned expression.\n\n                    JOSELLE\n          Don't worry baby, it shouldn't take\n          you more than five days if you just\n          stop to sleep and eat.\n\n                    MAURICE\n          By car right?\n\nJoselle scrunches her face in exaggerated shock and takes a\nstep back to look Maurice up and down.\n\n                    JOSELLE\n          How else you gonna get there on the\n          ground?\n\nMaurice gives her a sad expression.  If she only knew.\n\n                                                  CUT TO:\n\nINT.  NEW STORE - DAY\n\nThe future Parker Books.  The room sits as empty and barren\nas before.\n\nMaurice sits on the floor against the far wall.  He stares at\nhis new store.  His gaze turns to the window where the guard\nstrolls by.  The guard doesn't notice him.\n\nMaurice looks terrible, his eyes red and framed by bags...\nhis skin a yellowish white.\n\nHe moves to his feet and TURNS OFF THE LIGHTS.\n\n                                                  CUT TO:\n\nINT.  BOOKSTORE - AFTERNOON\n\nKris unloads the last of a shipment of books.  He moves to\nMaurice who sits by the window to the street.  Maurice points\nto a chair across from him and Kris takes a seat.\n\n                    MAURICE\n          Why do you want to be a journalist\n          Kris?  What sparked your interest?\n\nBeat.\n\n                    KRIS\n          I want to reach people.  Nobody\n          listens to me.  This is my way to\n          reach them.\n\n                    MAURICE\n          To reach people, you have to feel\n          something first... You write about\n          the wrong things.  How can you feel\n          for dog food?  The people at the\n          Gazette don't respect it, and\n          neither do you.\n\n                    KRIS\n          This is a ghost town.  Nothing ever\n          happens.\n\n                    MAURICE\n          Write from your heart.  That's why\n          the classics are great.\n\nBeat.\n\n                    KRIS\n          Why are you telling me this Mr.\n          Parker?\n\nMaurice looks out the window and picks up an envelope from\nthe coffee table between them.  He hands it to Kris.\n\n                    MAURICE\n          Your bus is arriving.\n\nKris opens the envelope and finds money.\n\n                    MAURICE\n          It's one month's pay.\n\nKris gets up.  A shock of adrenaline hits him.\n\n                    KRIS\n          Are you firing me?\n\n                    MAURICE\n          No.  No... I won't be here for a\n          while.  The store will be closed in\n          the interim.\n\nKris grabs his coat, shifting his attention between the\nwindow and Maurice?\n\n                    KRIS\n          You going on a trip Mr. Parker?\n\n                    MAURICE\n          Yes.\n\n                    KRIS\n          Where?\n\n                    MAURICE\n          California.\n\nKris moves to the door.\n\n                    KRIS\n          That's cool.  What day are you\n          arriving?\n\nBeat.\n\n                    MAURICE\n          I'm not sure -- sometime in January\n          I think.\n\nKris stops cold.  The door to the street half-open.\n\n                    KRIS\n          When are you leaving?\n\n                    MAURICE\n          Tomorrow.\n\nKris is seriously confused now.  Maurice decides to end the\nconfusion.\n\n                    MAURICE\n          I'm walking there Kris.\n\n                    KRIS\n          Walking where?\n\n                    MAURICE\n          California.\n\nKris' jaw hits the floor as the bus pulls to a stop across\nthe street.  Kris pulls up his sleeve and glances at his\nforearm.\n\n                    KRIS\n          The hairs on my arm are standing\n          up... Something strange is\n          happening.\n\n                    MAURICE\n          I always knew you had good\n          instincts...\n              (beat)\n          Goodbye Kris.  I'll see you when I\n          get back.\n\nKris hesitates before darting out of the store, across the\nstreet and into the bus.  Kris takes a seat in the back and\ndigs into his bag and pulls out the tape recorder.  CLICK.\n\n                    KRIS\n          Thursday, September 25... 'The\n          Death Of A Spouse - Can It Drive\n          You Insane?'\n\n                                                  CUT TO:\n\nEXT.  WYNNEWOOD PENNSYLVANIA - DAWN\n\nA BRILLIANT RED HUE BLANKETS THE HORIZON.\n\nThe suburbs come to life...\nMen and women leaving for work...\nSchool buses picking up their cargo of passengers...\nStore owners opening their businesses...\n\n                                                  CUT TO:\n\nPARKER BOOKS\n\nA group of eleven year old boys including the two\nkleptomaniacs we saw earlier, are standing before a closed\ndoor staring at a sign.  They look at each other before\nheading down the block.\n\nThe sign reads:  CLOSED - OWNER OUT OF TOWN.\n\n                                                  CUT TO:\n\nINT.  HOUSE - MORNING\n\nThe house is eerily silent.\n\nThree things lay on the dining table.  A shoulder bag filled\nwith clothes.  A carrying bag with personals.  And a set of\nmaps.\n\nMaurice checks the locks on all windows... He places all the\nfood in the refrigerator into a trash bag... He pulls out a\ndrawer and loosens a side panel, a wad of money flops out.\nMaurice pockets the bills...\n\nMaurice walks through the hall with a portable cage.  He\nstops before Claude's hanging cage... no movement, no\nchirping.  Maurice stares emotionally for a moment before\nreaching in and carefully removing CLAUDE'S LIFELESS BODY\nfrom the bottom of the cage.  Maurice looks down at the lost\npet in his hands.\n\n                    MAURICE\n          I know how you feel.\n\n                                                  CUT TO:\n\nEXT.  HOUSE - MORNING\n\nMaurice buries the bird in the backyard.\n\n                                                  CUT TO:\n\nDINING ROOM\n\nMaurice sits at the table... the essentials laying before\nhim.  He clings to a wallet size photo of Ellen.\n\nMaurice stands and gathers his things.\n\n                                                  CUT TO:\n\nEXT.  PENNS LANDING - DAY\n\nMaurice stands at the edge of the water.  Recreations of\nhistorical ships are docked in the harbor.  The old fashioned\nsails and masts sway in the gentle breeze.\n\nThe SOUNDS OF A STREET VENDOR catch Maurice's ears.  He turns\nto see a funnel cake booth in a row of food stalls.\n\n                                                  CUT TO:\n\nEXT.  TWENTY YEARS EARLIER - DAY (FLASHBACK)\n\nThe harbor is jammed with people.  A street fair is in full\nswing.  The SOUNDS OF A LIVE BAND MIX WITH THE CRIES OF THE\nSTREET VENDORS...\n\nMAURICE -- EARLY TWENTIES... Skinny, dark rich hair.  He\nyells out from behind a booth of paperback books.\n\n                    YOUNG MAURICE\n          Three dollars a piece... Two for\n          four dollars!  All the classics!\n\nA young woman emerges from the crowd of browsers.  Maurice\nbegins to speak but is caught off guard by YOUNG ELLEN'S\nbeautiful features.  Maurice manages a few words.\n\n                    YOUNG MAURICE\n          Can I help you?\n\nBeat.\n\n                    YOUNG ELLEN\n          My father owns the food stall over\n          there.\n\nMaurice looks over to find an enormous man serving food.\n\n                    YOUNG ELLEN\n          You look thirsty.\n\nEllen places the soda she had at her side on the table.\nMaurice is completely flustered.\n\n                    YOUNG MAURICE\n          Hi, I'm Ellen.\n\nEllen places her hand out.  Maurice grabs it instinctively\nand shakes.\n\n                    YOUNG MAURICE\n          Maurice.\n\nEllen looks at the full table of books.\n\n                    YOUNG ELLEN\n          Not doing too good huh?\n\nMaurice nods \"no.\"\n\n                    YOUNG ELLEN\n          It'll pick up.  I've been coming to\n          these things my whole life...\n          people don't want to carry things\n          as they walk around... you'll sell\n          as the fair starts to end...\n\nEllen waits for Maurice to say something but nothing comes\nout.\n\n                    YOUNG ELLEN\n          You don't talk much do you?\n\n                    YOUNG MAURICE\n          I read a lot.\n\nEllen's father BELLOWS FOR HER OVER THE CROWD.  Maurice jumps\nat the sound.\n\n                    YOUNG MAURICE\n          I better go...\n              (Ellen starts for her\n               booth)\n          ... Come over if you get hungry.\n\nEllen disappears into a sea of people.  Maurice stands in awe\nfor a second before snapping out.  He shakes his head to\nhimself.\n\n                    YOUNG MAURICE\n          I read a lot?\n\n                                                  CUT TO:\n\nLATER - IN THE FAIR\n\nThe people are filing out of the street.  Maurice is a whirl\nwind of activity as people wave dollar bills at him calling\nout classical titles.\n\nMaurice glances over to Ellen's booth.  She is watching him\nwith a big smile.  Maurice gestures to the line with a\nshocked expression.  Ellen laughs.\n\n                                                  CUT TO:\n\nFOOD STALL\n\nThe booths are packing up.  Ellen helps pack away the\nremaining food.  A book is placed in front of her on the\ncounter.  The book is \"Romeo and Juliet.\"  Ellen looks up to\nsee a very shy Maurice standing before her.  Ellen gives him\na smile that melts him.\n\n                    MAURICE\n          Are you trying to tell me\n          something?\n\nBeat.  Maurice eyes Ellen's dad who throws him deadly\nglances.  Maurice is very intimidated.  He whispers to her.\n\n                    MAURICE\n              (barely audible)\n          Walk with me?\n\n                    ELLEN\n          You like to take walks?\n\n                    MAURICE\n          No.  But I want to take a walk with\n          you.\n\nEllen looks at him carefully... looks right through him.\n\n                    ELLEN\n          You just said something very sweet.\n\n                                                  CUT TO:\n\nEXT.  THE EDGE OF THE WATER - DUSK\n\nThe water reflects the lights from the harbor.  Maurice and\nEllen are standing very close.\n\n                    MAURICE\n          What are you thinking?\n\nEllen looks out onto the water.\n\n                    ELLEN\n          It's one of those thoughts you keep\n          to yourself.\n\n                    MAURICE\n          Please tell me.\n\nBeat.\n\n                    ELLEN\n          I was just thinking that if we\n          actually became a couple -- this\n          was a beautiful place to begin\n          things.\n\nMaurice is bright red.  Ellen giggles at his shyness.\nMaurice gathers his strength and looks her straight in the\neyes.\n\nMaurice leans forward and kisses her softly.\n\n                                                  CUT TO:\n\nEXT.  PENNS LANDING - MORNING (PRESENT)\n\nMaurice, tears in his eyes, stands in the spot they stood\nmany years before.\n\n                    MAURICE\n              (softly)\n          I love you Ellen.\n\nOn this empty dock... on this hot day in September... with no\nwitnesses and no fan-fare, Maurice Parker takes the first\nsteps of his journey.\n\nSUPERIMPOSED ON THE SCREEN:  SEPTEMBER 26, 1993\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nA topless CHERRY RED WRANGLER JEEP pulls out of a mechanic's\ngarage and moves down route 32.  Kris Reddy is at the wheel.\nA \"Daily Gazette\" sign flaps from his roll-bar.\n\nKris changes the station on the radio as his eye catches a\nman walking on the opposite side of the street... Kris turns\nback to the road -- mind racing... BRAKES SCREECH as the jeep\nslows and then RUMBLES over the island separating the\nlanes... making a U turn across a four lane highway.\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nMaurice wiping his brow with a handkerchief.  The Wrangler\njeep rolls up next to him as he walks.  Maurice doesn't stop\nwalking as Kris leans over the passenger seat.\n\n                    KRIS\n          Phileas Fogg?\n\n                    MAURICE\n              (looking ahead)\n          ... Round The World In Eighty Days.\n          ... Hello Kris.\n\n                    KRIS\n          You're amazing... What are you\n          doing Mr. Parker?\n\n                    MAURICE\n          I told you.\n\nBeat.  Cars HONK as they pull by the slow duo.\n\n                    KRIS\n          You're walking to California?\n\n                    MAURICE\n          Pacifica, California -- it's a\n          coastal city.\n\n                    KRIS\n          Oh, a coastal city.  That's good.\n\nKris looks around to see if anyone else sees the lunacy in\nthis moment.\n\n                    MAURICE\n          Ellen told me that she didn't know\n          if I loved her.\n\n                    KRIS\n          She knew you loved her.\n\n                    MAURICE\n          She wasn't certain... I never\n          really showed her.\n\nBeat.\n\n                    KRIS\n          I'm really lost.  What does this\n          have to do with walking?\n\n                    MAURICE\n          I said, 'I would do anything for\n          her'... and she didn't believe me.\n          I said, 'I'd walk across the\n          country for her'... she didn't\n          believe me.\n\nMaurice looks to Kris rolling along beside him.  He sees the\nworried expression on his face.\n\n                    MAURICE\n          I need to show her how much I love\n          her Kris.\n\n                    KRIS\n          Why know?\n\n                    MAURICE\n          Because I should have shown her\n          before... Everyday, I should have\n          shown her.\n\nBeat.\n\n                    KRIS\n          Pacifica, California... that's a\n          long ways away.\n\n                    MAURICE\n          So I've been informed.\n\nKris tries to act calm, but it doesn't last long.\n\n                    KRIS\n          Shit Mr. Parker.  You can't walk\n          across the United States -- it's\n          over three thousand miles.\n\nMaurice takes his time with the response.  Kris waves more\ncars to pass them.\n\n                    MAURICE\n          Ellen got up every morning and went\n          to the corner store to get me my\n          bread for breakfast... Everyday.\n          Now that's about a quarter mile\n          each way... 17 years... that comes\n          to about three thousand miles...\n              (he smiles to himself)\n          And you know what Kris?\n\n                    KRIS\n          What Mr. Parker?\n\n                    MAURICE\n          She never ate a slice.\n\nMaurice picks up speed -- surer with every step... Kris slows\nthe jeep to a stop and reaches into his bag.  The mini tape\nrecorder goes on with a CLICK.\n\n                    KRIS\n          Thursday, September 26... 'The\n          Question We Never Ask - What Would\n          We Do For Love?'\n\nKris watches through the windshield as Mr. Parker disappears\ndown Route 32.\n\n                                                  CUT TO:\n\nEXT.  PARKER HOUSE - AFTERNOON\n\nThe wreaths, flowers and bouquet have now tripled in number.\nThey spill onto the lawn and walkway.  A neighborhood dog\nrummages through the more colorful bouquets.\n\n                                                  CUT TO:\n\nINSIDE\n\nThe abandoned house.  A TELEPHONE RINGS CONTINUOUSLY.  It\nstops after a string of rings.  It BEGINS AGAIN AFTER A FEW\nSECONDS.\n\n                                                  CUT TO:\n\nINT.  BOOKSTORE - AFTERNOON\n\nThe dark bookcases echo the RINGS OF THE TELEPHONE.  The\nanswering machine finally picks up.\n\n                    MACHINE (ELLEN'S VOICE)\n          Hello you've reached Parker Books --\n          our store hours are eight to six...\n\n                                                  CUT TO:\n\nINT.  ADELLE'S HOUSE - AFTERNOON\n\nA center-city Town house.  Wall to wall books, \"Cognitive\nPsychology\", \"Physiology of Behavior\", \"Abnormal Psychology\",\n\"Clinical Psychology\", the titles cover every shelf and every\ntabletop.\n\nAdelle Matlin hangs up the phone, and moves to the living\nroom where her husband is reading a paper in his recliner.\n\n                    ADELLE\n          Something's wrong.  I'm worried.\n\nGerald looks on with an assuring smile.\n\n                    GERALD\n          He probably just went somewhere.\n\n                    ADELLE\n          Where?\n\n                    GERALD\n          For a walk.  I don't know.\n\nBeat.\n\n                    ADELLE\n          Uncle Maurice?  Are you kidding?\n          He hates walking.\n\n                                                  CUT TO:\n\nEXT.  MOTEL - NIGHT\n\nNighttime.  The empty street ECHOES with the TIRED SHUFFLE OF\nMAURICE'S FEET.\n\nMaurice stops in this tracks and picks up a CRUSHED COKE CAN\nFROM THE SIDE OF THE ROAD.  He places it upright at the place\nwhere he stands.  Maurice immediately walks off the highway\ninto a small MOTEL PARKING LOT.\n\n                                                  CUT TO:\n\nINT.  MOTEL - NIGHT\n\nA motel clerk checks his wooden keys.\n\n                    CLERK\n          Pool times are 11 am to 5 pm,\n          there's cable in every room with\n          two premium channels.  HBO and\n          CINEMAX.  Pay Per View Channels can\n          be --\n\n                    MAURICE\n          I need a bed and I need Tylenol...\n          that's all.\n\n                    CLERK\n          The room comes with two twin Sealy\n          Posturepedics... but the Tylenol\n          will be extra.\n\nMaurice stares at him with exhausted eyes.\n\n                                                  CUT TO:\n\nTHE INSIDE OF A FLORAL PRINTED ROOM\n\nMaurice's shoulder bags are on the bed... The WATER IS\nRUNNING IN THE BATHROOM.\n\nMaurice gently moves his hands under the bathtub head,\nchecking the temperature.  He sits on the edge of the tub.\n\nMaurice peels off his shoes with great pain.  They slide\nacross the dull white tiles into the corner.  The once well\nkept English Loafers could be mistaken for trash now.\n\nMaurice rubs his barefeet with both hands -- grimacing from\nthe pain.  The tub is almost filled.  Maurice stops the tap.\nThe steam from the water fills the room.\n\nMaurice raises his legs with great effort and submerges each\nleg into the steaming water.  His eyes close with great\nrelief as his body melts into the tub.  Maurice lays his head\non the side of the tub... It only takes ten seconds before\nMaurice's SNORING fills the bathroom.\n\n                                                  CUT TO:\n\nTHE OUTSIDE OF THE QUAKER MOTEL ON ROUTE 32\n\nThe neon MOTEL SIGN THROBS RED.\n\nSUPERIMPOSED across this image are the words:\n\n           PHILADELPHIA, PENNSYLVANIA... MILE 26\n\n                                                  CUT TO:\n\nEXT.  MOTEL - MORNING\n\nMaurice looks down the highway... eyes squinting to block out\nthe sun.  The road winds and dissolves into the horizon...\nMaurice looks back the way he came -- a second of\nindecision... the moment passes.\n\nMaurice takes a deep breath before moving to the CRUSHED COKE\nCAN.  He moves to the exact spot where he left the road the\nnight before and begins walking again...\n\n                                                  CUT TO:\n\nINT.  NEWSPAPER BUILDING - MORNING\n\nThe elevator BELL dings, letting off a cargo of newspaper\npersonnel.  FRANK AND SETH are two of them.  They make their\nway to the desks... a sea of desks pressed against each other\n-- each desk has a computer.\n\nFrank and Seth come to their corner and stop before a young\nman, Phillies cap turned backwards, sitting behind an IBM 486\nDX... fingers flying over the keyboard.\n\n                    FRANK\n          Someone's got a hot story.\n\n                    SETH\n          What time did you get in?\n\nKris Reddy keeps typing.  He spits out the answer after a few\nseconds.\n\n                    KRIS\n          Five... Couldn't sleep.\n\n                    FRANK\n          What's this one about Kris?\n          'Blinds or Curtains - The Eternal\n          Question?'\n\n                    SETH\n          No, no... 'Boxers Verses Tight\n          Undies - The Battle Continues.'\n\nFrank and Seth crack up laughing.  Frank reaches for the\nprintouts... Kris immediately covers them with his hand.  He\nstares up with a smile.\n\n                    KRIS\n          Read about it on Sunday.\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nMaurice exits an athletic store in a small town.  On his feet\na new pair of sneakers.\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nMaurice as he walks down a winding highway.  His new sneakers\nshuffling slowly.\n\nA SHARP PAIN SHOOTS UP MAURICE'S LEG.  His knees buckle.  The\nshoulder bags tumble to the ground followed by Maurice\nhimself.  From a distance it looks like he's been shot.\n\nMaurice grabs the back of his thigh and tries to straighten\nhis leg out... His face frozen in a painful expression.\nMaurice rubs his legs slowly -- working the cramp out.  He\nrelaxes a bit as he finally straightens his leg.  Maurice\nsits there motionless -- eyes glazed... defeated.\n\nThe SOUNDS OF A BIRD snap him out of his trance.  He looks up\nto see a PAINTED BUNTING, a bird about six inches in height\nFLY DOWN from a tree and land on a rock next to him.  Maurice\nstares at the beautiful bird curiously.  Its body splashed\nwith brilliant blues, reds and greens.  It looks out of place\nin these mundane surroundings.  Maurice looks around the\nskies to see no other birds.  The Painted Bunting chirps a\nfew times before taking flight into the air.  It circles over\nMaurice before disappearing behind the trees.\n\nMaurice smiles.  He pulls himself to his feet with great\neffort.\n\nMaurice opens all of his bags and begins emptying the\nessentials -- the maps, food, a canister of water.\n\nMaurice reloads one bag and pulls it over his shoulder with\ngreat effort.  At his feet, are the rest of his belonging --\npiled on the side of the road.\n\nMaurice painfully begins walking again.\n\nWE PULL BACK on Maurice's figure walking on the highway...\nthe pile of disregarded things laying by the side... The\nhighway is endless... winding it's way for miles and miles\ninto a fixed dot in the distance.\n\n                                                  CUT TO:\n\nINT.  ADELLE'S HOUSE - MORNING\n\nSunrise on Pennsylvania.  Gerald picks the Philadelphia\nGazette off the front porch.\n\n                                                  CUT TO:\n\nDINING ROOM\n\nGerald flips open the paper as he waits before an empty\nplate.\n\n                    GERALD\n          Smells good, honey.\n\n                                                  CUT TO:\n\nKITCHEN\n\nAdelle puts the finishing touches on a stack of pancakes.\nShe sets up two plates and brings them into the\n\nDINING ROOM\n\nGerald's eyes remain glued to the paper.  Adelle comes to the\ntable, holding the golden pancakes over the table.  She\nnotices the strange look on his face.\n\n                    ADELLE\n          What is it?\n\n                    GERALD\n          Adelle... Maurice is in the paper.\n\nShe stares silently at the paper laid out on the table.  The\nheadline beams at her:\n\n           A PHILADELPHIA NATIVE'S LABOR OF LOVE\n\nAdelle is shocked.  She gazes at an old picture of her uncle\nprinted underneath the headline.\n\n                    ADELLE\n          Oh my God.\n\nShe STORMS off into the kitchen with the golden pancakes.\nGerald looks down at his empty plate longingly.\n\n                    GERALD\n          Honey.\n\n                                                  CUT TO:\n\nINT.  POLICE STATION - DAY\n\nSERGEANT DALLY pretends to be concerned.\n\n                    DALLY\n          What would you like us to do?\n\n                    ADELLE\n          Put out a P.B.S.... Or whatever\n          it's called.\n\n                    DALLY\n          A.P.B.... He isn't breaking any\n          law.  He's a grown man... He can\n          crawl on his hands and knees to\n          China if that's what he wants to\n          do.\n\n                    ADELLE\n          Sergeant, I'm a psychologist and I\n          know the difference between normal\n          whims people have and actions that\n          clearly display psychological\n          problems... My uncle lost his wife\n          and it devastated him.\n\n                    DALLY\n          We're very sorry about that.  Some\n          of our men were on the scene of the\n          accident.\n\n                    ADELLE\n          I think my uncle is suffering from\n          a condition called Mania which is\n          linked with depression.  It is a\n          time when an individual will act\n          over-confident, and will act out\n          impractical, grandiose plans.\n          Sometimes these plans can be\n          dangerous.\n\n                    DALLY\n          How long does this... Mania last?\n\n                    ADELLE\n          A couple days to a few months if\n          untreated.\n\nDally digests this information.\n\n                    DALLY\n          Look, I'll see if anyone has\n          spotted him recently.  If I get any\n          information, I'll call you.\n\n                    ADELLE\n          Thank you.\n\n                    DALLY\n          Don't wait by the phone.  If he's\n          really been walking this whole\n          time, he's out of our\n          jurisdiction...\n\nAdelle looks very emotional... on the verge of tears.\n\n                    DALLY\n          Don't worry he'll be back.  He's in\n          his forties.  He's had no physical\n          training... He'll be back by the\n          end of the week.\n\n                                                  CUT TO:\n\nEXT.  HIGHWAYS - DAY\n\nA floating DOT moves along a flat stretch of road...\n\n                                             DISSOLVE TO:\n\nEVENING\n\nThe sun drops behind rolling hills.  The DOT has become\nLARGER, sprouting arms and legs...\n\n                                             DISSOLVE TO:\n\nNIGHT\n\nDarkness has fallen.  The DOT has materializes into MAURICE.\n\n                                                  CUT TO:\n\nMOTEL\n\nA clerk hands over a set of keys in exchange for money.\n\n                                             DISSOLVE TO:\n\nROAD - MORNING\n\nMaurice walks back onto the highway and steps next to an old\nboot that has been used as today's MARKER.  Maurice starts\nwalking from that point.\n\n                                             DISSOLVE TO:\n\nDRUGSTORE\n\nMaurice grabs two handfuls of small green boxes.  He places\nthem on the table.  The cashier stares down at the eight\nboxes of Ben-Gay and rings it up.\n\n                                             DISSOLVE TO:\n\nROAD\n\nMaurice standing at the entrance to a tunnel that pierces the\nside of a mountain side.  Maurice makes \"The sign of the\ncross\" and walks into the darkness...\n\n                                             DISSOLVE TO:\n\nEXIT OF TUNNEL\n\nMaurice appears on the other side with a smile of relief.\nHe's awed at the beauty of the landscape.  Tiny clusters of\nbuildings far in the distance wrapped in a blanket of green\nfor miles on every side.\n\n                                             DISSOLVE TO:\n\nMOTEL\n\nMaurice asleep in the bathtub.\n\n                                             DISSOLVE TO:\n\nROAD - DUSK\n\nIt's raining hard like gun-fire from the sky.  Maurice sits\non the edge of a road rubbing his legs.  His hair matted to\nhis head.  The rain pelts the ground in forceful waves.\n\n                                             DISSOLVE TO:\n\nSUPPLY STORE\n\nAt a cash register, Maurice slaps ten more boxes of Ben-Gay\ndown on the counter.  A teenage girl with braces looks at him\nlike he's Charles Manson.\n\n                                             DISSOLVE TO:\n\nMOTEL\n\nMaurice sleeps.  His barefeet are propped up on his bag.  His\nfeet are swollen and red with fresh blisters.  A pack of ice\nis wrapped around his knee with an old shirt... The picture\nof Ellen clutched in his hand.\n\n                                             DISSOLVE TO:\n\nROAD\n\nTwo joggers pass Maurice as he sees a flashing school sign.\nIt is a suburban town.  The fallen red and orange leaves\ncover every flat surface.\n\nSUPERIMPOSE:  ELKHART, INDIANA... MILE 598\n\n                                                  CUT TO:\n\nEXT.  SCHOOL - DAY\n\nA line of cars pulls around a semi-circle driveway.  Maurice\nwatches as parents drop off their children.  A couple of ten\nyear old boys walk by.\n\n                    BOY\n          Nice sneaks.\n\nMaurice realizes they're talking to him.\n\n                    MAURICE\n          They are?\n\n                    BOY 2\n          Sure man, High-Top Nike Cross\n          Trainers with heel supports and air\n          cushioned soles -- They're nasty.\n\nThe boys keep walking.  Maurice looks down at his sneakers\nwith new-found pride.\n\nAfter a while, Maurice's attention switches back to the cars.\nOne car in question catches Maurice's eye.  A woman consoles\na small child who doesn't want to leave the car.  She wipes\nhis tiny tears with her hand and hugs him tenderly.  The\nlittle boy's head cradled in her arms.\n\n                                                  CUT TO:\n\nEXT.  FIFTEEN YEARS AGO - NIGHT (FLASHBACK)\n\nThe Parker house many years ago.  The house semi-furnished.\nEllen carefully hangs her first bird photographs on the wall;\na striking aerial photo of a GOLDEN EAGLE.  Wings spread,\nsoaring high over a mountain range.\n\n                    MAURICE\n          I thought we both wanted the same\n          things.\n\n                    ELLEN\n          I've changed my mind.\n\n                    MAURICE\n          You can't change your mind.\n\nBeat.  Ellen takes a seat on the only sofa.\n\n                    ELLEN\n          I want children.\n\n                    MAURICE\n          You've just decided, is that right?\n\n                    ELLEN\n          Yes.\n\nYoung Maurice is visibly upset.\n\n                    MAURICE\n          Ellen, there are two kinds of\n          people in the world --\n\n                    ELLEN\n          Please not, 'The two kinds of\n          people' speech.\n\n                    MAURICE\n          ... People that were made to be\n          parents, and people who were not\n          made to be parents... My parents,\n          were people who were not made to be\n          parents but had kids anyway.  I\n          don't want us to be that way Ellen.\n\n                    ELLEN\n          You can change.\n\n                    MAURICE\n          Face it Ellen, I'm not the type of\n          person who reads bedtime stories.\n          But you love me anyway.\n\n                    ELLEN\n              (upset)\n          Don't be so sure.\n\nEllen fiddles with her dress.  She bites her bottom lip as\nshe tries not to cry.\n\n                    ELLEN\n              (shaky voice)\n          What if something happens to one of\n          us?  We'll be all alone.\n\nMaurice loses his hard demeanor and moves next to her.  He\nlays his hand across her shoulder.\n\n                    MAURICE\n          Nothing will happen to us.  It's a\n          bleak picture, I know, but we're\n          going to be together till were old\n          and grey and you don't remember my\n          name anymore.\n\nMaurice lifts her chin with his hand gently.  She blinks her\neyes and a tear rolls down her cheek.  He takes a deep\nbreath.\n\n                    MAURICE\n          Let me think about it okay.\n\nEllen brightens up immediately.\n\n                    MAURICE\n          I'm not saying anytime soon.  I'm\n          just saying that maybe we can\n          consider it down the road sometime.\n\nEllen gives her patented glowing smile.  She hugs him with\nall her strength.  She whispers in his ear.\n\n                    ELLEN\n          I love you Maurice Parker.\n\n                                                  CUT TO:\n\nEXT.  INDIANA GRADE SCHOOL - DAY (PRESENT)\n\nMaurice walks away from the school, shuffling through the\npiles of leaves that block the walkways.\n\nA child and her father walk down the path towards him.\nMaurice looks away painfully.  THE CHILD'S SOFT LAUGHTER\nPOUNDING IN HIS EARS as he quickens his pace.\n\n                                                  CUT TO:\n\nINT.  LIQUOR STORE - DAY\n\nJACKSON LIQUOR WHOLESALERS.  For the kind of people who buy\nwhiskey by the crate.\n\nMaurice has his map unfolded over the cash register.\n\n                    CASHIER\n          I can show you the main roads, but\n          that'll add ten miles to your trip.\n          Do you mind ten miles?\n\n                    MAURICE\n          I mind.\n\n                                                  CUT TO:\n\nOUTSIDE OF LIQUOR STORE\n\nThe parking lot of the store looks like a used truck lot.\nEvery kind of supped-up truck one could possibly imagine is\non display here.\n\nMaurice passes a CANARY YELLOW FLATBED PICK-UP with a group\nof men drinking a newly purchased case of beer.  Maurice gets\nabout ten feet past them when he stops, hesitates and then\nheads back to them.\n\n                    MAURICE\n          Excuse me, who's truck is this?\n\nThe man sitting on the hood of the truck, has dark hair and\nhasn't shaven in days.  This unfortunate gentleman is named\nDENNY.\n\n                    DENNY\n          Mine.\n\n                    MAURICE\n          Are you and your friends planning\n          on driving soon?\n\nDenny gives Maurice a greasy curious look.  He squints his\nglazed eyes.\n\n                    DENNY\n          Yes we are.  Who the fuck are you?\n\nMaurice, doesn't look scared, in fact he looks angered.\n\n                    MAURICE\n          You don't know me from Adam, but I\n          want you to do something for me.  I\n          want you to wait until you sobered\n          up before you get behind the wheel.\n          I know this is out of the ordinary,\n          but one man to another, would you\n          do me that favor?\n\nSilence.  Then everyone in the group BURSTS OUT IN DRUNKEN\nLAUGHTER.\n\n                    DENNY\n          Are you a preacher?\n\n                    MAURICE\n              (seething with anger)\n          No, I just don't want anybody dying\n          because I didn't say something when\n          I had the chance.\n\nDenny's face goes blank.  No emotion.  His steady gaze almost\nterrifying.\n\n                    DENNY\n          I'll drive my truck shit-faced if I\n          want to.  You better turn around\n          and walk away preacher.  You don't\n          know who you're talking to.\n\nMaurice looks around at the hostile faces and decides on a\nretreat.  Denny watches Maurice with predatory eyes.\n\n                                                  CUT TO:\n\nEXT.  ROAD - DUSK\n\nMaurice practically hobbles his way down a road lined by\ntowering pines.  He stops to take a drink from his canister\nand keeps walking.  The SOUNDS OF A CAR GROW IN THE DISTANCE.\nMaurice doesn't turn his back.\n\nThe CANARY YELLOW TRUCK pulls over the ridge with a load full\nof passengers.  It gains distance on Maurice.\n\nMaurice hears the ENGINE and waves HIS ARM IN THE AIR --\nsignaling for it to pass him.  Maurice walks ten more feet\nbefore turning around.\n\nMaurice's face instantly changes when he sees the demented\ngrins through the windshield of the truck.  Maurice turns and\nquickens his pace... The truck picks up pace... Maurice\nbreaks into a run... The truck speeds up, passes Maurice and\nstops in front of him.\n\nPanic fills Maurice as he watches the truck unload it's\ndrunken passengers.  Eyes scan the forest on either side for\na way out.  Maurice decides to stand his ground.\n\n                    MAURICE\n              (to himself)\n          This is Indiana -- nothing's going\n          to happen to you.\n\n                    DENNY\n          You need a ride, Preacher?\n\nThe men walk up to Maurice.\n\n                    MAURICE\n          No thank you I'll walk.\n\nA tall lanky gentleman gestures to Maurice's shoulder bag\nwith his beer can.  Some beer sprays Maurice's feet with the\ngesture.\n\n                    WIL\n          Where you coming from?\n\n                    MAURICE\n          Look gentlemen, I'm late, I need\n          to --\n\n                    DENNY\n          I've been thinking -- who the hell\n          is this preacher guy?  Coming up to\n          me and my friends?  Looking like he\n          wanted to kick my ass for drinking?\n\nDenny gives Maurice that inhuman stare.  Maurice is clearly\nfrightened.\n\n                    DENNY\n          Then I figured it.  You're angry.\n          You lost somebody, because some\n          asshole was drinking.\n\nMaurice is frozen.\n\n                    DENNY\n          Maybe you lost a son?  A sister?  A\n          wife?\n\nMaurice looks up for a millisecond.  Denny doesn't miss it.\n\n                    DENNY\n              (stepping closer)\n          A wife?... Did someone piss drunk\n          run into your wife?  Crushed her\n          like a bug.  Snapped her bones?\n\n                    MAURICE\n          That's enough.\n\nMaurice is red with anger.  Denny loves it.\n\n                    DENNY\n          Oh the preacher's getting angry\n          again...\n              (Denny goes ice cold)\n          Tell me something.  Did she die\n          instantly or did she feel every\n          torn muscle and shattered bone?\n          Were you there to help her?  Or\n          were you safe at home when the\n          windshield sliced into her face --\n\n                    MAURICE\n          I'll kill you!\n\nMaurice swings.  Denny easily avoids it.  Maurice doesn't see\nthe first BLOW COMING, IT HITS HIM IN THE CHEST -- Maurice\ngasps for air as he buckles to the dirt.  Hands grab --\nrestrain.  A POWERFUL KICK IN THE RIBS -- ANOTHER...\nLAUGHTER... ANOTHER SET OF VICIOUS KICKS... The road and\nforest begin to spin... A PAINFUL SLASH ACROSS HIS FACE...\n\nMaurice prepares for the next blow... it never comes.  RED\nAND BLUE lights swirl... Maurice looks up, barely focusing --\na man leans over a car door... The image becomes clearer -- a\nPOLICEMAN stands poised -- gun aimed directly at the men\nhovering over him.\n\n                    POLICE OFFICER\n              (distorted and slowed)\n          Step away from him now!\n\n                                                  CUT TO:\n\nINT.  INDIANA POLICE STATION - EVENING\n\nOFFICER MERRIL GREY -- balances a phone on his shoulder as he\nspreads a new coat of mayonnaise on his hoagie.\n\n                    OFFICER GREY\n          Need an I.D. check on a Maurice A.\n          Parker...\n\nGrey reads Maurice's license.\n\n                    OFFICER GREY\n          Driver's number 22 184 877...\n              (listening)\n          He was assaulted by a group of men\n          just outside Elkhart, Indiana...\n\n                                                  CUT TO:\n\nINT.  PHILADELPHIA POLICE STATION - EVENING\n\nSergeant Dally, the officer Adelle spoke to earlier, listens\non the other end of the phone his mouth agape.\n\n                    DALLY\n          How is he?... That's good.\n\nGesturing to a young officer at another desk to come over.\nDally, cups the phone.\n\n                    DALLY\n          Call Adelle Matlin... tell her we\n          found her uncle.\n\n                                                  CUT TO:\n\nINT.  PHILADELPHIA GAZETTE BUILDING - EVENING\n\nThe sea of desks are empty.  One empty desk is lit -- Kris\nReddy's desk.  THE CRACKLE OF A SHORTWAVE/C.B. UNIT FLOATS\nTHROUGH THE LARGE UNOCCUPIED ROOM from an adjacent room.  The\nVOICES OF DALLY AND OFFICER GREY ARE DISTORTED BUT AUDIBLE.\n\nWE MOVE TO the back room to find Kris writing furiously in\nfront of an elaborate C.B. setup.\n\nHe jots down the words as fast as they're said:\n\n  \"Maurice Parker... Elkhart... Route 80... Precinct 18...\"\n\nThe transmission gets cut as the phone conversation ends.\nKris quickly rolls the chair across the room and grabs a map\noff the shelf.\n\nThe map gets pinned under two coffee cups and a ceramic frog\nas Kris traces the route from Philadelphia to Indiana... He\nsits up straight in astonishment as his eyes hit the KEY of\nthe map.\n\n                    KRIS\n          Jesus -- he's walked six hundred\n          miles.\n\nKris glances at the hairs on his arm and smiles.\n\n                                                  CUT TO:\n\nLATER\n\nKris at his computer and in the 'zone.'  Fingers flying over\nthe keys passionately.  On his desk is a cardboard box filled\nwith letters all shapes and sizes on the verge of overflowing\nthe top of the box.  One the side of the box are the words,\n\"Labor of Love - Fan Mail.\"\n\n                                                  CUT TO:\n\nINT.  INDIANA POLICE STATION - MORNING\n\nDAWN IN INDIANA -- the sun spills over the horizon.\n\n                                                  CUT TO:\n\nEXT.  INDIANA POLICE STATION - MORNING\n\nMaurice and Officer Grey are seated on the front stairs of\nthe precinct drinking coffee when ADELLE MATLIN DRIVES UP.\n\nAdelle steps out of a RENTED TOYOTA CELICA.  Her tense --\nfrightened eyes betray her mental state for the past ten\nhours.  She walks to the stairs.\n\n                    GREY\n          Mrs. Matlin... good morning.\n\nMaurice slowly gets up.  Adelle is in shock as she looks at\nthe stranger before her.\n\nMaurice stands in a 'COLTS' football T-shirt, faded jeans and\nsneakers.  His left cheek is black and blue, and his arm and\nside are bandaged.\n\n                    ADELLE\n          Uncle Maurice, you're wearing\n          sneakers?\n\n                    MAURICE\n          High-top Nike Cross-Trainers with\n          heel support and air-cushioned\n          soles.  They're nasty.\n\nAdelle wasn't sure what that meant.  She shakes it off and\nhugs Maurice.  She is visibly relieved to have him in her\narms.\n\n                    GREY\n          My shift ended an hour ago.\n\nAdelle notices the ROSE in Grey's hand.  Grey catches her\nglance.\n\n                    GREY\n          It's for my wife.\n\n                    ADELLE\n          What's the occasion?\n\nGrey looks to Maurice -- they exchange a knowing smile.\n\n                    GREY\n          No occasion.\n\nAdelle notices the WINK exchanged between Grey and Maurice.\n\n                    GREY\n          You can use the conference room, if\n          you want to talk.\n\n                    ADELLE\n          That won't be necessary.\n\n                    GREY\n          Fine.\n\n                    ADELLE\n          We can talk on the way back -- I\n          rented a car.\n\nBeat.\n\n                    MAURICE\n          It'll be kind of hard to talk,\n          since you'll be in the car and I\n          won't.\n\nAdelle gives Maurice an angry glare -- Maurice holds his\nground.\n\n                    GREY\n          The conference room is down the\n          hall on your right.\n\n                                                  CUT TO:\n\nINT.  POLICE CONFERENCE ROOM - MORNING\n\nFile cabinets in the corners.  A small rectangle table takes\nup ninety percent of the space in the room.\n\nMaurice is seated -- his legs extended straight on another\nchair.  Adelle paces the front of the room.\n\n                    ADELLE\n          And your store?  What about your\n          new store?  What about all your\n          dreams?\n\n                    MAURICE\n          I have new dreams now.\n\n                    ADELLE\n          I don't accept that.\n\n                    MAURICE\n          Maybe one day -- after you've been\n          married twenty years you'll\n          understand.\n\n                    ADELLE\n          Uncle Maurice -- I spent all our\n          frequent flyer miles on a one way\n          ticket here... I have a rented car\n          outside, just listen to me.\n              (beat)\n          Come back with me now, and if you\n          still want to do something like\n          this in a year -- maybe we'll plan\n          a car trip across the country --\n          Gerald and I will come along --\n\n                    MAURICE\n          I have to walk -- by myself -- all\n          the way -- every inch.\n\n                    ADELLE\n          It's impossible.\n\n                    MAURICE\n          It's what she asked for... It's\n          what I'm going to do.\n\n                    ADELLE\n          She was being symbolic.  What if\n          she asked you to fly to the moon?\n\n                    MAURICE\n          You'd be visiting me at Nasa.\n\nAdelle changes gears.  She takes a seat next to Maurice and\nstudies his legs and tired face carefully before uttering the\nwords.\n\n                    ADELLE\n              (whispering)\n          What if you don't make it?\n\n                    MAURICE\n          I'll make it.\n\n                    ADELLE\n          If you really want to do this...\n          plan it out.  Rest up.  Train for\n          it.  Build up your body.  Plan\n          every stop along the way.  How much\n          money?  Time?  Really do it\n          properly.  This is all so -- by the\n          seat of your pants.\n\n                    MAURICE\n          No it's not.\n\n                    ADELLE\n          Why did you take the back roads\n          here?  They're not safe.  You'd\n          know that if you'd planned.\n\nBeat.\n\n                    MAURICE\n          I've all ready gone six hundred\n          miles... I can't do it again.\n\n                    ADELLE\n          If you can't redo these six hundred\n          miles when you're rested and ready,\n          how are you possible going to walk\n          another two thousand-five hundred\n          miles in your present condition?\n\nMaurice is stumped.  He looks unsure.  He instantly looks on\nthe verge of tears.\n\n                    MAURICE\n          Nothing's going to happen.\n\n                    ADELLE\n          Uncle, the way I was told, if that\n          police car didn't happen down that\n          road, you would be dead right now.\n          That guy Denny, had jumped bail in\n          another state, he's dangerous...\n          They'll be other Dennys, if you\n          don't plan.\n\nMaurice stares down at the table -- the life draining from\nhim with every word she says.\n\n                    ADELLE\n          Ellen, deserves you to do this\n          right.  Really make it -- if you're\n          going to do it.  She deserves it.\n\n                                                  CUT TO:\n\nINT.  CAR - DAY\n\nThe RENTED TOYOTA CELICA turns out of the police station onto\nthe main road.\n\nAdelle holds a cushion in the air as she looks in the\nrearview mirror.\n\n                    ADELLE\n          Do you want this?  It's a long\n          ride.\n\nMaurice is stretched out in the back -- his legs propped up\non a blanket.  Maurice shakes his head \"no\" silently.\n\nHis sad eyes watching the passing scenery.  The speeding car\nswallows up the miles effortlessly.  Maurice watches the\nJackson Liquor Wholesalers whiz by... The painful hills he\nclimbed, gone, in an instant... The school where he watched\nthe children being dropped off, swishes by in a blink... all\nthose miles lost.\n\nMaurice shuts his eyes in pain.\n\n                                                  CUT TO:\n\nEXT.  GAS STATION/REST STOP - DAY\n\nThe rented Toyota Celica is parked at the convenience store.\nMaurice is seated in the back staring out at the eighteen\nwheelers that come in and out of the parking lot.  He glances\nin to Adelle who is gathering food.\n\nMaurice's dull eyes are about to shut when something catches\nhis attention.  He sits up and stares out the window with\ngreat intensity.  Maurice watches as a large truck pulls into\nthe parking lot, across it's side in blazing red --\n\n          \"Jackson Liquor Wholesalers - Since 1945\"\n\nMaurice scans the area... gas station ATTENDANTS... A BEARDED\nHOMELESS MAN laying next to a heating unit... KIDS eating\nfast food on old picnic tables...\n\nMaurice's gaze steadies on the TRUCK, as the driver fills the\ntank with gas.\n\n                                                  CUT TO:\n\nA PHONE BOOTH INSIDE THE CONVENIENCE STORE\n\nAdelle is on the phone.\n\n                    ADELLE\n          We'll figure everything out when we\n          get there... Oh, he's going to need\n          a lot of help with this... He\n          wasn't even going to come with me,\n          I had to tell him that he could do\n          the walk later if he plans well...\n          I know, but by that time I'll have\n          gotten him some treatment... I just\n          want to get back home before he\n          changes his mind.\n\n                                                  CUT TO:\n\nCAR - LATER\n\nAdelle gets in the front seat of the car keeping the bag of\nfood on the passenger seat.  She starts the car as she talks\ninto the rearview mirror.\n\n                    ADELLE\n          You want something to eat?\n\nShe stares at Maurice covered in a blanket with his back to\nher... an unresponsive blob.\n\n                    ADELLE\n          I know you're feeling a lot of\n          emotions right now.  It's okay to\n          be mad.  It's okay to feel\n          helpless.  It's part of the healing\n          process.  I understand.  I do.\n\nAdelle puts the Celica into drive and pulls out onto the\nhighway.\n\n                                             DISSOLVE TO:\n\nEXT.  ADELLE'S HOUSE - EVENING\n\nEvening in Philadelphia.  The rented Toyota Celica pulls into\nthe driveway.  The front door of the house opens.  Gerald\nwalks out to greet them.\n\nA tired Adelle slips out of the car and hugs Gerald.\n\n                    ADELLE\n          He was exhausted -- slept the whole\n          way.\n\nAdelle and Gerald move to the back door of the Celica.  They\nopen it and stare at Maurice covered by the blanket.  Adelle\nshakes the blanket.\n\n                    ADELLE\n          Uncle Maurice we're home... Uncle\n          Maurice.\n\nAdelle shakes Maurice, who stirs a little as he wakes.  His\nfeet slide out from under the blanket -- Adelle stares\ncuriously at the ARMY COMBAT BOOTS that dangle out.\n\n                    ADELLE\n          Uncle Maurice?\n\nAdelle pulls aside the covers... THE HOMELESS MAN, from the\ngas station, sits up.  ADELLE'S SHRILL SCREAM BLASTS THROUGH\nTHE AIR.  Gerald and Adelle stumble back as the large,\nbearded man struggles out of the car and looks around the\nquiet neighborhood.\n\n                    HOMELESS MAN\n          So this is the City of Brotherly\n          Love.\n\nThe homeless man raises his hand.  He holds up MAURICE'S WELL\nPOLISHED BOOK SOCIETY MEDALLION and kisses it lovingly.\n\nAdelle and Gerald stare back speechless.\n\n                                             DISSOLVE TO:\n\nEXT.  ROAD - MORNING\n\nJACKSON WHOLESALER'S PARKING LOT.  The truck from the gas\nstation, the only vehicle parked before the store.\n\n                                                  CUT TO:\n\nEXT.  ROAD - MORNING\n\nMaurice back on the road.  His limp only slightly visible at\nthis point in the day.  The bandages rubbing him with every\nstep.\n\nThe highway takes him around a beautiful bend of trees.  THE\nAIR IS FILLED WITH THE SOUNDS OF BIRDS.  Maurice spots a\nYELLOW WARBLER, a striking bird about eight inches long with\nvivid yellow feathers.  It sits elegantly on a nearby branch.\nHe walks towards it -- it stays in position.  Closer.  The\nbird chirps back at him.  Maurice is within arms reach of the\nbird.\n\n                    MAURICE\n          Ellen would have loved you.\n\nMaurice looks closer -- and notices it's wings.  The feathers\nbend back -- a dark area at the center.\n\n                    MAURICE\n          How did that happen?\n\nMaurice watches the bird hop around the branch -- unable to\nfly.\n\n                                                  CUT TO:\n\nINT.  PARKER KITCHEN - FIFTEEN YEARS EARLIER (FLASHBACK)\n\nThe kitchen is a different color.  The refrigerator and\nappliances are brand new.  Ellen walks in -- something\ncradled in her hand.  Maurice looks up from his paper to see\nEllen move to the sink and lay a motionless bird on the\ncounter.\n\n                    ELLEN\n              (shaky voice)\n          It must've hit the window... I\n          think its neck is broken.\n\n                    MAURICE\n          Don't bring it in here -- it\n          probably has all kinds of diseases.\n\nEllen finds an eye dropper from the table and fills it with\nwater -- she lets a few drops fall into the birds mouth.\n\n                                                  CUT TO:\n\nBEDROOM\n\nEvening, just before bed.  Maurice is reading.  Ellen is\nmonitoring the bird closely.  It lays on the bedside table --\nwrapped gently with a hand towel.  A morsel of food is\nlowered into its mouth with a pair of tweezers.  The bird\nstares blankly at the ceiling.\n\n                    MAURICE\n          It isn't going to make it Ellen.\n          Let the poor thing go quietly.\n\n                    ELLEN\n          It'll make it.\n\nHer delicate hand rubs the bird's stomach.\n\n                                                  CUT TO:\n\nLIVING ROOM\n\nThe GRAPHIC IMAGES of the TV FLICKER on Maurice's face.  He\nglances back to Ellen who talks to the bird cradled in her\narms.\n\n                    ELLEN\n              (softly)\n          You must miss flying.  Being way up\n          there in the clouds looking down at\n          all of us.  You miss that don't\n          you?  You miss playing with your\n          friends and talking with them...\n\nIn the SOFT LIGHT of the lamp -- Ellen has transformed into a\nmother rocking her child to sleep.\n\n                                                  CUT TO:\n\nKITCHEN\n\nMaurice is reading his paper.\n\n                    ELLEN\n          Maurice!  Maurice!  Come out here.\n\nMaurice looks through the window to see Ellen waving to him\nfrantically.\n\n                                                  CUT TO:\n\nBACKYARD\n\nEllen points to the ground.  The little bird awkwardly walks\naround the porch.\n\nThe bird's wings BURST into motion -- flapping hard --\ncatching the wind.  Ellen jumps up and down, bursting with\npride, as her little child takes flight.\n\n                    MAURICE\n          I don't believe it.\n\nEllen hugs Maurice.\n\n                    ELLEN\n          All he needed was love.  Once you\n          have that, you can do anything.\n\nYoung Maurice and Ellen watch the bird soar into the blue\nsky.\n\n                                                  CUT TO:\n\nEXT.  STREAM - DAY (PRESENT)\n\nMaurice is kneeling at a stream by the side of the road.  He\ngently clears away the dirt from the Yellow Warbler's\nfeathers.\n\n                    MAURICE\n          You'll be all right.  A couple days\n          and you'll be up there again.\n\nMaurice carries the bird back to the trees.  He lays it back\non the branch.  He stares at it's beautiful coat with a\nsmile.\n\n                    MAURICE\n          Ellen would have loved you.\n\n                                                  CUT TO:\n\nINT.  ADELLE'S KITCHEN - DAY\n\nAdelle is on the cordless.  Her fingers tapping on the\nkitchen table angrily.  Gerald moves around her as he sets\ntwo plates at the table.\n\n                    ADELLE\n          Yes I understand, it does sound\n          humorous, but this is a very\n          serious situation.\n\nGerald is cooking.  He gently flips the chicken breast in a\nbutter and garlic sauce.\n\n                    GERALD\n          This smells good.\n\n                    ADELLE\n          Why am I such an authority?\n\n                    GERALD\n              (under his breath)\n          Here comes the resume.\n\n                    ADELLE\n          I received my B.S. from the\n          University of Pennsylvania, my\n          P.H.D. from Bryn Mawr College.  I\n          worked three years at the Boston\n          University School of Medicine,\n          during which time I had articles\n          printed in the \"Journal of\n          Educational Psychology\", \"American\n          Journal of Psychology\", \"Psychology\n          Review\" and \"Science\"... So I think\n          it's safe to say my opinion is\n          valid.\n\nGerald brings the sizzling pan over and divides the steaming\ndish into both plates.\n\n                    ADELLE\n          Look, please find him for me...\n          Officer, I tried... but I brought\n          back the wrong person.\n\nGerald quickly scoops some rice onto both plates.  His mouth\nis watering as he goes for the utensils.\n\nAdelle abruptly stands at her place.\n\n                    ADELLE\n          Stop laughing!\n\nGerald gets into his seat at the table just in time to see\nAdelle angrily hang up the phone.  She stares off into space\nbefore unconsciously cleaning the table.  Adelle picks up\nboth plates of food...\n\n                    GERALD\n          Adelle --\n\nGerald's heart sinks as Adelle pops open the trash can with a\ntap of her foot and dumps the picture perfect meal into the\ngarbage.  She goes to the sink and rinses the plates\ncompletely preoccupied with her thoughts.  She mumbles to\nherself as she shuts off the water.\n\n                    ADELLE\n          He says he admires him.\n\nAdelle storms out of the kitchen.  Gerald sits at the empty\ntable with a fork in his hands.  He shakes his head in\ndisbelief.\n\n                                                  CUT TO:\n\nEXT.  MIDWEST HIGHWAYS - DAY\n\nThe land is flat.  From the roads one can see endless fields\nin all directions.  When the wind blows, the crops bend in\nunison, changing the shape and texture of the land for a\nmoment and instantly changing back with a snap of the wind.\n\nMaurice takes in the beauty of the land through a painful\ngrimace.  Occasionally clutching his right leg in moments of\nextreme pain.\n\nMaurice rests on an abandoned tractor by the side of the road\nand watches the wind change the fields.  He closes his jacket\nas the gusts become stronger.\n\n                                             DISSOLVE TO:\n\nHOTEL\n\nThe clock clicks past 11:30 am.  Maurice is still in bed --\nthe curtains drawn.  He crawls out from under the sheets and\ndowns two pills with a glass of water.  He looks bad.  His\nface pale, his eyes at half-mast.  He wipes unnatural sweat\nfrom his brow and melts into the bed again.\n\n                                             DISSOLVE TO:\n\nSTREET\n\nJust after dusk.  A small town's main road.  Maurice quietly\npasses under the street lights.\n\nHe stares up and tightens the hood on his parka as the first\nSNOWFLAKE falls into the SHAFT OF THE STREET LIGHT.  Soon\nthousands of flakes fall into the light...\n\n                                             DISSOLVE TO:\n\nGAZETTE BUILDING\n\nKris fields calls frantically as the LIGHTS BLINK ANXIOUSLY\non his phone.  The front page of the Gazette is posted on his\npin up board.  It reads... \"HE MARCHES ON...\"  Underneath is\nA PICTURE of Maurice standing outside his bookstore holding\nup THE BOOK SOCIETY MEDALLION proudly.\n\nA teenage boy gets off the elevator and maneuvers an enormous\nbag over his shoulder... emblazoned across his back are the\nwords \"MAIL ROOM.\"  The boy comes to Kris and empties the bag\non Kris' desk without a word.  Hundreds of letters cascade\ndown swallowing the table top and covering Kris who stares in\nawe as the letters keep coming.\n\n                                             DISSOLVE TO:\n\nMOTEL\n\nMaurice is COUGHING PAINFULLY.  He crouches over the edge of\nthe bed and holds his side with every strain.\n\nMaurice looks worse than ever.  His hair and shirt are soaked\nwith sweat.  The coughing attack stops.  Maurice take a\ncouple deep breaths before laying back down.\n\nHis feet are visible -- sticking out from beneath the sheets.\nThey look like someone has beaten them with a stick, swollen\nand bruised.  They disappear under the sheets.\n\n                                             DISSOLVE TO:\n\nSNOW COVERED ROADS\n\nthat stretch into a white oblivion.\n\nSUPERIMPOSE:  ELM CREEK, NEBRASKA... MILE 1,564\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nEarly morning.  The branches of the trees are encapsulated in\nice.  The snow piled ten inches on every surface.  Maurice,\nburied deep beneath three layers of clothes, looks around.\nHis breath materializes with every step.  He forces a weak\nsmile at the magical landscape before him.  White.  Pure.\nPeaceful.\n\nThe SOUNDS OF A VOLVO STATION WAGON urges Maurice to the side\nof the road.  As it passes a little girl waves from the\npassenger window.  Maurice puts on a brave face and waves\nback.\n\nAnother CAR ENTERS the picture -- A DARK BLUE FIREBIRD rises\nover the hill in the opposite lane moving fast, too fast.\n\nSLOW-MOTION as the Firebird skids over the ice and the snow\n-- the driver desperately trying to gain control... The\nmother in the Volvo hits the BRAKES as the Firebird spins\ninto her lane... Maurice yells out.\n\n                    MAURICE\n          No!\n\nThe cars IMPACT with a sickening CRUNCH -- BACK TO REAL TIME:\n\nThe Firebird spins into a guardrail, breaking through it and\ncoming to a stop in a bank of snow.\n\nThe Volvo isn't so lucky.  It flips from the impact...\nsliding on its roof, driving through the snow, down the\nroad... It comes to a rest a hundred feet away.\n\nSILENCE.  STILLNESS.  The entire event took only seconds.\n\nMaurice runs frantically after the Volvo.  The windows are\nSHATTERED.  Snow has packed into the over-turned car.  No one\ncan be seen inside the vehicle.\n\nMaurice kneels down and punctures the wall of snow with his\nhand.  His arm disappears up to the shoulder.  His face\ngrimacing with the strain.  His arm comes out slowly...\n\nA few MUFFLED SOBS ARE HEARD BEFORE the little girl breaks\nthrough the wall of snow and slides out of the window.  She\nlets out a DESPERATE GASP for air as Maurice pulls her out by\nthe wrist.\n\nMaurice clears her mouth and face and watches as she coughs.\n\n                    MAURICE\n              (panting)\n          It's okay.  It's all over.\n\nMaurice lays her gently against a snow bank, before moving to\nthe other side of the car.\n\n                    DRIVER (O.S.)\n          Is she okay?\n\nMaurice looks up to see the driver of the Firebird walking\ntowards him.  He looks dazed.\n\nMaurice doesn't waste another second and plunges his arm in\nthe snow... deeper than before.  His cheek pressed against\nthe snow, almost laying flat on the ground.\n\n                    MAURICE\n              (frantic)\n          Oh no... she's wearing a seat-belt.\n\nMaurice fishes around... his teeth clenched... He lets out a\nPOWERFUL GRUNT as he pulls back with all his strength -- a\nwoman's WRIST appears first, then the tangled hair and then\nthe body spills out onto the road next to Maurice.\n\nThe driver appears over the Woman and Maurice and loses it\nwhen he sees them.\n\n                    DRIVER\n          It wasn't my fault.  It wasn't my\n          fault.\n\nMaurice, out of breath, clears the woman's face and mouth --\nno movement.  No sound.\n\n                    MAURICE\n          Come on... please...\n\nMaurice holds her nose and breaths into her mouth...\n\n                    MAURICE\n          Please...\n\nShe doesn't respond.\n\n                                                  CUT TO:\n\nA FRIGHTENING FLASH\n\nThe mother's UNCONSCIOUS face turns into ELLEN.  Her lifeless\neyes -- her bruised cheek and forehead.  Her neck at an\nawkward angle.  Maurice stares down at his wife in horror.\n\n                    MAURICE\n          No Ellen... don't die...\n\n                                                  CUT TO:\n\nTHE MOTHER\n\nbeing revived by Maurice.  He pushes her chest in counting...\npush, count, breath... push, count, breath...\n\nThe mother's BODY TWITCHES, slightly at first -- then\nobviously... The mother let's out a FEW PAINFUL COUGHS.\n\nShe takes a breath.  Life quickly returns to her body.\nMaurice places her head in his lap and hugs her, lightly\nrocking back and forth.  The tears streaming down his red\nface.\n\n                    MAURICE\n          Everything's going to be fine\n          Ellen.  I won't let anything happen\n          to you.  I love you sweetie.\n          Everything's going to be different\n          now.\n\nThe SCENE BACKS OUT as Maurice comforts this stranger in his\narms.\n\n                                                  CUT TO:\n\nEXT.  ROAD - AFTERNOON\n\nThe police have descended on the scene.  Traffic has been\nblocked off in both directions.  The LIGHT thrown by the\nambulances tints the snow and fields a THROBBING RED.\n\nMaurice's face can be seen in the shadows of the backseat of\na police car.\n\nOUTSIDE THE CAR\n\nOFFICER HANSEN AND OFFICER TANDY converse.\n\n                    HANSEN\n          What's his story?\n\n                    TANDY\n          His name is Maurice.  He's dancing\n          around everything else.\n\n                    HANSEN\n          Red flag, man.\n\n                    TANDY\n          If he's in trouble with the law --\n          fine.  Not our problem.  He yanked\n          two people from a car wreck, let's\n          give him some space.\n\nHansen looks in at the drawn, exhausted face of Maurice\nthrough the window.  Hansen opens the back door.\n\n                    HANSEN\n          Maurice, you need anything?  Which\n          way were you headed?  We can drive\n          you.\n\n                    MAURICE\n          No thank you officer.  I'll walk.\n\nHansen throws a sharp glance to Tandy.  Hansen turns back to\nMaurice.\n\n                    HANSEN\n          Grub?  Food?  How about food?  Our\n          dime at the local diner...\n\nMaurice mulls this offer.\n\n                    HANSEN\n          Come on man, you're a hero.  In\n          Nebraska we don't let hero's walk\n          around with empty stomachs.\n\nBeat.\n\n                    MAURICE\n          ... I need to be brought back here.\n\n                    HANSEN\n          Deal.\n\n                                                  CUT TO:\n\nINT.  DINER - EVENING\n\nThe end of the meal.  Maurice sits in a booth across from\nHansen and Tandy.  They watch as Maurice coughs violently\ninto his napkin.\n\n                    HANSEN\n          You look like shit Maurice.\n\nMaurice takes a couple strained breaths.\n\n                    MAURICE\n          Getting old.\n\n                    TANDY\n          How long have you been footing it\n          Maurice?\n\nBeat.\n\n                    MAURICE\n          Too long...\n              (looks around)\n          Excuse me gentlemen.\n\nMaurice gets up and heads to the bathroom.  Hansen and Tandy\nstare at Maurice's shoulder bag laying on his seat.\n\n                    HANSEN\n          Red flags man.\n\n                    TANDY\n          Not our problem.\n\n                    HANSEN\n          Why so vague?  Why so evasive?  He\n          could be somebody hot.\n\n                    TANDY\n          Not our problem.\n\n                    HANSEN\n          It's going to look beautiful when\n          he turns out to be that animal who\n          paid a visit to the Steadman's\n          house.\n\n                    TANDY\n          This guy's not a murderer.\n\n                    HANSEN\n          If he is, half the town has seen us\n          take him out for dinner like a\n          couple of jack-asses.\n\nThat makes Tandy think.\n\n                    HANSEN\n          If he's clean, he'll never know\n          about it.\n\nTandy looks to the men's bathroom door.\n\n                    TANDY\n          Do it quick.\n\nHansen instantly reaches over and begins rummaging through\nthe shoulder bag.  Hansen pulls out a little folder.  He\nopens the folder to reveal an old certificate.  Hansen shows\nTandy the worn piece of paper.\n\n                    HANSEN\n          A marriage certificate?  Who the\n          hell carries their marriage\n          certificate around?\n\n                    TANDY\n          Maurice and Ellen Parker... it was\n          issued in Philly... Mr. Maurice\n          Parker has come a long way from\n          home.  Why?\n\nHansen returns the certificate and folder to the bag and\nleaves the booth quickly.\n\n                                                  CUT TO:\n\nLATER\n\nMaurice returns to the table to find only Tandy seated.\nMaurice sees Hansen in the phone booth at the far end of the\ndiner.\n\n                    TANDY\n          Hansen's whipped.  Has to call his\n          wife every two hours or she'll go\n          ballistic when he gets home.\n\n                                                  CUT TO:\n\nPHONE BOOTH\n\n                    HANSEN\n          P-A-R-K-E-R.  Right.  Get on the\n          horn with Philly.  Call me here.\n\n                                                  CUT TO:\n\nINT.  PHILADELPHIA POLICE STATION - EVENING\n\nSergeant Dally packs his things to leave.  He sees the light\non LINE 1 LIGHT UP on his phone.  He ignores it.  The clerk\nsticks her head around the corner.\n\n                    CLERK\n          Line one Sarg.\n\n                    DALLY\n          I'm not here.\n\nDally zips his coat.\n\n                    CLERK\n          It's the Nebraska state police.\n\n                    DALLY\n          Nebraska?\n\n                    CLERK\n          You know somebody named -- Maurice\n          Parker?\n\nDally freezes.  He shakes his head as he unzips his jacket.\n\n                    DALLY\n              (smiles)\n          That son of a bitch made it to\n          Nebraska.\n\nDally grabs the phone.\n\n                                                  CUT TO:\n\nINT.  GAZETTE BUILDING - EVENING\n\nThe C.B. CRACKLES WITH THE VOICE OF SERGEANT DALLY AND THE\nNEBRASKA POLICE.\n\nMICHELLE, a very introverted intern, stares at the radio\nastonished.\n\n                                                  CUT TO:\n\nA SMALL SIDE OFFICE\n\nIt now has \"KRIS REDDY\" etched on it's door.  Kris looks up\nfrom his desk at Michelle who stands in the doorway bright\nred.\n\n                    KRIS\n          What is it?\n\nMichelle just points down the hall.\n\n                                                  CUT TO:\n\nOFFICE\n\nMichelle scribbles down notes.\n\n                    C.B./NEBRASKA POLICE\n          ... He saved a little girl, and her\n          mother.  Pulled them right out of\n          the car...\n\nKris stands, jaw hanging wide open.\n\n                    KRIS\n          Where is he?\n\nMichelle checks her notes.\n\n                    MICHELLE\n              (very soft voice)\n          Umm, Elm Creek, Nebraska.\n\nKris practically falls over.  Michelle scribbles down more\nquotes.\n\n                    MICHELLE\n          This story is big huh?\n\n                    KRIS\n          Mammoth.\n\n                    MICHELLE\n          The Gazette's small huh?\n\nBeat.\n\n                    KRIS\n          What are you saying?  This story is\n          too big for this paper?\n\n                    MICHELLE\n              (flustered again)\n          Umm, no.  It's just that --\n\n                    KRIS\n          God damn, you're right... You don't\n          say much Michelle, but what you say\n          is golden.\n\nKris' mind is racing as the C.B. conversation continues.\n\n                                                  CUT TO:\n\nINT.  DINER - NIGHT\n\nHansen scoffs down his third dessert.  Maurice stares at him\noddly.\n\nThe PAY PHONE RINGS.  Hansen jumps to his feet too quickly.\nHe tries to recover.\n\n                    HANSEN\n              (too excited)\n          I was expecting a call.\n\nHansen moves to the phone.\n\nTandy winks at Maurice with a smile.\n\n                    TANDY\n          Whipped.\n\n                                                  CUT TO:\n\nPHONE BOOTH\n\nHansen listens carefully to the officer on the line.\n\n                    OFFICER (ON PHONE)\n          ... I'm on first name basis with\n          half the city of Philadelphia...\n          Hansen, apparently this guy Parker\n          lost his wife and went a little\n          fruity.  I spoke with his niece,\n          Adelle Matlin and she says to\n          restrain him.  That he's dangerous\n          to himself.  She says to call when\n          we have him in the station.\n\n                    HANSEN\n          Good work.\n\n                                                  CUT TO:\n\nEXT.  POLICE CAR - NIGHT\n\nThe ride progresses in silence.  Hansen and Tandy in the\nfront seat.  Maurice's head is pressed against the back-seat\nwindow.  His eyes begin to shut slightly as sleep overcomes\nhim.  The car goes over a BUMP.  Maurice jars awake.  He\nglances out the window to see a highway sign swish by in the\nHEADLIGHTS.  'ROUTE 80 EAST'.\n\nEast?  Maurice looks around quickly at the passing scenery.\n\n                    MAURICE\n          Where are you taking me?\n\nHansen and Tandy exchange looks.\n\n                    HANSEN\n          I'm going to drop off Tandy at the\n          station and then drop you back.\n\n                    TANDY\n          That's all right isn't it?\n\n                    MAURICE\n          Sure.\n\nHansen looks back to the road.  The drive continues in\nsilence.  Tandy checks his watch just when a CLICK -- A HARD\nWIND -- AND A METALLIC SLAM in quick succession shakes the\ncar.\n\n                    HANSEN\n          What the hell was that?\n\nTandy looks back -- Maurice is GONE.  The back seat empty.\nTandy stares out the blackness of the back window.\n\n                    TANDY\n          Shit!  He jumped!\n\n                    HANSEN\n          Jumped where?\n\n                    TANDY\n          Out of the car.  He jumped out of\n          the god damn car!\n\n                                                  CUT TO:\n\nEXT.  FOREST - NIGHT\n\nMaurice staggers through the naked trees.  Thin trees every\nfew feet with no branches.  The snow ankle deep.\n\nMaurice braces himself against a trunk, checking his hands.\nHis vision blurs as he stares down at his scraped bloody\npalms.\n\nThe forest clears quickly into an open field.  Far in the\ndistance across the field of white is a small pointed\nbuilding standing alone.  The glow of a LIGHT can be seen\nthrough the windows.\n\nMaurice trudges through the deeper snow.  Stumbling many\ntimes.  The frigid wind pushing him to his knees.  Maurice\nkeeps moving -- the field seems endless...\n\n                                                  CUT TO:\n\nDRIVEWAY\n\nMaurice's feet hit the snow of the driveway, just as his legs\nbuckle -- his face HITS the snow hard.  He manages to roll\nover on his back with great effort.  He stares up at the\npointed building -- the dull light becoming duller...\nsomething blocks the light.  A man.  Maurice feels himself\nrise into the air as two powerful arms scoop him off the ice.\n\nA PRIEST carries him into the doors of a CHURCH.\n\n                                                  CUT TO:\n\nINT.  BACK ROOM OF CHURCH - NIGHT\n\nA dimly lit cathedral.  Six foot six, FATHER BERCHMAN walks\ndown the center isle of the cathedral, through a cloth\ncurtain and into a\n\nBACK ROOM\n\nwhere Maurice is sitting in a chair wrapped in a blanket.\n\n                    MAURICE\n          What did they ask?\n\n                    FATHER\n          If I had seen you.  By the way I'm\n          sorry about your wife.  They told\n          me.\n\n                    MAURICE\n          Thank you... I'm sorry you had to\n          lie.  It must have been difficult.\n\n                    FATHER\n          I asked the officers if you had\n          committed some crime... If they had\n          said 'yes', you would be speaking\n          with them right now.\n\nThis is the father's own room.  Very sparse as one would\nexpect.  He moves to his bureau and retrieves some pills.\n\n                    FATHER\n          Take these, and if you're up to it,\n          try to explain how it is you came\n          to be sitting here.\n\nMaurice follows the father's instructions and tightens the\nblanket around his shoulders.\n\n                    MAURICE\n          I'm walking for my wife.\n\nBeat.\n\n                    FATHER\n          To where?\n\n                    MAURICE\n          Pacifica, California.\n\n                    FATHER\n          From where?\n\n                    MAURICE\n          Philadelphia, Pennsylvania.\n\n                    FATHER\n          I see.\n\nBeat.  The father nods as if this is not shocking news.\n\n                    FATHER\n          Why?\n\n                    MAURICE\n          Do you believe a person's soul\n          lives on after their death?\n\n                    FATHER\n          Most certainly.\n\n                    MAURICE\n          And that that soul takes part of\n          the person they were on this earth\n          with them.\n\n                    FATHER\n          That's a reasonable assumption.\n\n                    MAURICE\n          I don't want my wife's soul having\n          any doubts.\n\n                    FATHER\n          Doubts?  About what?\n\n                    MAURICE\n          About my love for her.\n\nThe father nods with understanding as if everything became\nvery clear with that statement.\n\n                    FATHER\n          You don't have to prove anything to\n          her.\n\n                    MAURICE\n          I'm not proving to her.  I'm\n          showing her.  And I know I don't\n          have to.  I want to.  I've\n          realized, love is about giving.\n          I'm alive, I can still give to her.\n          I want to give her everything I\n          can.\n\nThe father studies this stranger before him with great\nadmiration.\n\n                    MAURICE\n          There are some people, including\n          those officers, that are trying to\n          stop me.  They mean well.  But they\n          don't understand.  I wouldn't\n          either if I were them.\n\nMaurice struggles with the last words.  He slumps back --\nphysically drained.\n\nThe father gets up and takes the empty glass of water from\nMaurice's hands.\n\n                    FATHER\n          I want you to stay here a few days\n          until you're better.  You're no use\n          to your wife in this condition.\n\nThe father moves for the curtain.\n\n                    MAURICE\n          You think I'm crazy too.\n\nThe father turns and smiles warmly.\n\n                    FATHER\n          I have spent my life dedicated to\n          love.  Love of God.  Love of\n          humanity.  And here you are living\n          through love.  Bathing in it.\n          Using its strength, its magic, its\n          ability to overcome any barrier...\n          If you are crazy, I hope my\n          insanity is not far off.\n\nMaurice's eyes well up instantly.\n\n                                                  CUT TO:\n\nEXT.  CHURCH - WESTERN HIGHWAY - DAY\n\nFather Berchman wraps one powerful hand around a tiny silver\ncross dangling from his neck.  The other hand waves high into\nthe air at the shrinking figure of Maurice Parker walking\nthrough the snow.\n\n                                             DISSOLVE TO:\n\nHIGHWAY\n\nThe long trek continues.  The black tar of the roads peek out\nin spots as the SUN BEATS down on the flatlands.  Maurice\ndrapes his worn scarf around a melting snowman.\n\n                                             DISSOLVE TO:\n\nRESTAURANT\n\nWe are looking inside a fancy Center-City Philadelphia\nrestaurant.  Adelle and Gerald are seated by an enormous bay\nwindow.  A waiter comes to their table with their main\ncourse.  Gerald watches the food being served with great\nanticipation.\n\nGerald's eyes drift out the window to the magazine stand on\nthe sidewalk... He squints to see better.  Realization hits\nhard... His eyes light up.  He looks to Adelle and back to\nthe magazine stand.\n\nIn a mad race for time, Gerald begins to devour the food on\nhis plate.  The waiter and Adelle watch him in shock.  Adelle\nglances out the window.  Her eyes squint... then light up.\nShe jumps to her feet and grabs Gerald by the arm, a fork\nfull of food drops to his plate.  Gerald looks back at his\nfull plate longingly as Adelle pulls him out of the\nrestaurant.\n\nThe waiter looks out the window to the magazine stand.  He\nsquints.\n\n                                                  CUT TO:\n\nMAGAZINE STAND\n\nThe NEW YORK TIMES are hung like stockings around the border\nof the stand.  On the front pages, a singular headline stands\nout among the others:\n\n                  \"A JOURNEY OF THE HEART\"\n\nA large PHOTO OF MAURICE is next to the headline.\n\n                                             DISSOLVE TO:\n\nDINER\n\nA red-headed waitress slices a credit card through the\nmachine and waits... Green computer letters blink - \"This\naccount has been closed.\"\n\nThe waitress returns with the card -- she shakes her head\n\"No\" at Maurice who digs into his wallet for cash.\n\n                                             DISSOLVE TO:\n\nMOTEL\n\nMaurice slides two twenties across the counter to the motel\nmanager.  Maurice checks the remaining bills in his wallet...\nonly a few bills left.\n\nIn the motel room we find Maurice sitting over the edge of a\nbed buckled over in a coughing attack.  It finally stops.\nMaurice flops back to the pillows, completely drained.\n\n                                             DISSOLVE TO:\n\nROADS\n\nThe flatlands have vanished.  The roads now serpentine\nthrough mountain ranges.\n\nVIEW FROM THE MOUNTAIN RANGE; Maurice moves like a grain of\ndust over the black line of the road.\n\nMaurice rests every half mile.  He labors up every incline\nwith ultimate effort.  He braces himself with a branch\nserving as a make due crutch.\n\nMaurice spots a small town nestled in the arms of the\nmountain range.  He begins the journey to rest.\n\n                                             DISSOLVE TO:\n\nGROCERIES\n\nMaurice pays for his food with the last few bills in his\nwallet.\n\n                                             DISSOLVE TO:\n\nROAD\n\nAnother stick serves as a walking cane.  The multi layers of\nclothes have been shed for a short-sleeve shirt.  Maurice\nfollows a dirt road that breaks free of the mountains and\ninto the open country again.\n\nSUPERIMPOSE:  COALVILLE, UTAH... MILE 2,472\n\n                                                  CUT TO:\n\nEXT.  DRIVEWAY - DUSK\n\nA dust covered mailbox at the end of a long dirt driveway.\nMaurice wipes the mailbox clean with his hand.  The name\nemerges like an ancient inscription from beneath the mud...\n\"CALDWELLS.\"\n\n                                                  CUT TO:\n\nFRONT DOOR\n\nMaurice tentatively moving to the front door.  His hand\ninstinctively clutches his empty stomach.\n\nThe wind blows gently.  Maurice shuts his eyes and takes a\ndeep breath.  He opens his eyes slowly to see a dinner table\nbeing set.  Potatoes, gravy, fresh baked bread... floating\nthrough the half open window to Maurice's thankful smile.\nTHE SOUNDS OF CHILDREN AND ADULTS CAN BE HEARD INSIDE.\n\nThe first LIGHT KNOCKS go unheard with all the commotion.\nHARDER.  The door squeaks open.  Maurice puts on his best\nsmile... the door opens wider -- no one stands before him.\n\n                    BOY (O.S.)\n          Hi.\n\nMaurice looks down to find an adorable little boy, black\nhair, big eyes and an even bigger grin.  This is three year\nold ISAAC CALDWELL.\n\n                    MAURICE\n          Well, hello.\n\n                    ISAAC\n          I'm Isaac... I'm three.\n\n                    MAURICE\n          I'm Maurice Parker... I'm much\n          older than three.  Are your parents\n          home?\n\nBeat.  Isaac thinks.\n\n                    ISAAC\n          You know what, I can play baseball\n          with my brothers when I'm bigger.\n\n                    MAURICE\n          Is that right?\n\n                    ISAAC\n          You know what... I'm just little\n          now, but I'll be big soon.\n\n                    MAURICE\n          You'll probably be bigger than your\n          brothers.\n\n                    ISAAC\n          Yeah!\n\nIsaac is happy with this thought.\n\nMaurice looks up as MRS. CALDWELL comes to the door.\n\n                    MRS. CALDWELL\n          Who are you talking to Isaac?\n\nMrs. Caldwell stops as she stares at Maurice.\n\n                    MAURICE\n          Hello, I'm Maurice Parker.  I'm\n          just passing through and I need to\n          conserve what little funds I\n          have... I need some food and a roof\n          to sleep under for one night... Now\n          I don't look like much, but if\n          there are any things that need to\n          get done around the house --\n\nMrs. Caldwell doesn't listen, but instead yells behind the\ndoor.\n\n                    MRS. CALDWELL\n          Dave... you're not going to believe\n          who's here.\n\nMaurice looks at her oddly.  MR. CALDWELL comes to the door;\nhis face lights up.\n\n                    MRS. CALDWELL\n          This is Maurice Parker -- the one\n          walking for his wife.\n\nMr. Caldwell is completely floored.  So, for that matter is\nMaurice.  Mr. Caldwell puts out his hand with awe.\n\n                    MR. CALDWELL\n          If that ain't fate?... Hi, I'm Dave\n          Caldwell.  I do the copy for the\n          anchor on the evening news down\n          here.\n\n                    MAURICE\n          Evening News?\n\n                    MR. CALDWELL\n          We did a piece after your story ran\n          in the New York Times.\n\nMaurice is truly surprised.\n\n                    MAURICE\n          New York Times?\n\nMrs. Caldwell ushers Maurice in the doorway by the elbow.\n\n                    MRS. CALDWELL\n          Someone said they spotted you in\n          town... Mr. Parker, you're a\n          celebrity.\n\n                                                  CUT TO:\n\nINT.  CALDWELL KITCHEN - NIGHT\n\nThe Caldwell family dinner... all twelve of them.  Ten\nchildren talk and reach for food.  Maurice sits at the end\ntalking, enjoying and sharing.  Isaac sits next to him\nproudly.  Maurice has blended in as another member of this\nfamily.\n\n                                                  CUT TO:\n\nINT.  CALDWELL GUEST BEDROOM - NIGHT\n\nAn inviting room.  The kind prepared for visiting\ngrandmothers and grandfathers to stay in.\n\nMaurice checks himself out in the mirror... his borrowed\npajamas fit nicely.\n\nHe moves to the window and stares at the moon lit\nlandscape... enormous, endless, dwarfing.\n\nThe rocking chair CREAKS as Maurice melts into it.  He rubs\nhis calves slowly, the pain evident in his face.  His head\nleans back after a moment... on the verge of sleep.\n\nThe SOUND OF TINY FOOTSTEPS stirs him.  He looks to the\ndoorway to find Isaac standing quietly at the door in his\nbaseball P.J.s.\n\n                    MAURICE\n          I thought you were asleep.\n\n                    ISAAC\n          You know what... I remembered you\n          were here and I woke up.\n\nIsaac walks silently to Maurice... Tip-toeing all the way.\n\n                    MAURICE\n          Your parents would want you to be\n          in bed.\n\n                    ISAAC\n          You tell stories?\n\n                    MAURICE\n          Oh no... I'm not good at that.\n          Very bad in fact...\n\nToo late.  Isaac climbs up into Maurice's lap with great\neffort.  Maurice looks down at Isaac who waits patiently for\nhim to begin.\n\n                    MAURICE\n          I would be exceedingly boring.\n\nIsaac waits.\n\n                    MAURICE\n          I don't do these type of things.\n\nIsaac -- still waiting.\n\n                    MAURICE\n          See there are two kinds of people\n          in this world.\n              (beat)\n          ... Just a short one okay?\n\nIsaac gets in position, cradled in Maurice's arms.  Maurice\nsearches for something to say.\n\n                    MAURICE\n          There was a boy named Isaac who\n          wanted to play baseball, but he was\n          too small and no one would let him\n          play... but he kept practicing by\n          himself -- waiting... He went to\n          every game and sat in the stands\n          with his glove.\n\n                    ISAAC\n          You know what... maybe I ran onto\n          the field and hit a home run.\n\n                    MAURICE\n          Who's telling this story?\n\nIsaac points to Maurice.\n\n                    MAURICE\n          Good, now the team had this great\n          big player -- Big Billy.  He was\n          the best.  He had them in the World\n          Super-Bowl-Championship of little\n          kids baseball.  But right before\n          the game, the second best player on\n          the team was suspended because he\n          played a prank on a nice man who\n          owned a book store... When that boy\n          grew up he was convicted on\n          burglary charges and spent fifteen\n          years in prison -- where he\n          belongs.\n\nIsaac didn't understand that last part.\n\n                    MAURICE\n          Anyway, Big Billy needed another\n          player so he yelled into the\n          stands.  'Who can play baseball?'\n          And there was a little voice that\n          yelled out, 'Me, I can play.'\n          Everyone turned to see a little boy\n          standing with a glove.\n\n                    ISAAC\n              (beaming)\n          That's me.\n\n                    MAURICE\n          Right.  But everyone saw how small\n          Isaac was and laughed... but not\n          Big Billy.  He stared at Isaac\n          carefully and then told him to join\n          the game.  It came to the end of\n          the game.  It was the eleventh or\n          twelfth inning or whatever is the\n          last inning of a game...\n\n                    ISAAC\n          Nine.\n\n                    MAURICE\n          Okay nine.  Big Billy's team was\n          losing and he was on base.  That's\n          when Isaac came up.  He could\n          barely hold the bat... Big Billy\n          winked at Isaac... The ball was\n          pitched -- Isaac hit the ball hard.\n          It soared up and out over the\n          stadium.  Everyone cheered.  Isaac\n          hit a home run and won the game.\n          After the game, Isaac asked Big\n          Billy why he let he play.  Big\n          Billy smiled and said, I wasn't\n          always Big Billy, I was Little\n          Billy first... Isaac and Big Billy\n          went off after the game and read a\n          classic book together.  The end.\n\n                    ISAAC\n          You know what -- that was a really\n          good story... Tell it again.\n\nMaurice has to smile as Isaac looks up anxiously.\n\n                    MAURICE\n          There was a boy named Isaac who\n          liked to play baseball...\n\nWE BACK OUT as Maurice rocks back and forth in his chair.\nIsaac falling asleep in his arms.\n\n                                                  CUT TO:\n\nEXT.  CALDWELL DRIVEWAY - MORNING\n\nThe family dog \"Max\", scurries up and down with great\nexcitement.  Max can sense something big is happening.\n\nThe Caldwell clan, one and all has gathered at the end of\ntheir driveway.  Maurice is escorted out by Isaac who clings\ntightly to his hand.  Mr. Caldwell meets Maurice halfway and\npulls him aside.\n\n                    MR. CALDWELL\n          That's a nice watch.\n\nMaurice looks down at his beat-up Seiko.\n\n                    MR. CALDWELL\n          I've always wanted a watch like\n          that.\n\n                    MAURICE\n              (unstrapping it)\n          It's yours.\n\n                    MR. CALDWELL\n          No.  I won't take it unless I pay\n          for it... Let's see, that's a\n          pretty nice watch -- I can see\n          that.\n\nMaurice watches him suspiciously as he pulls out an envelope\nfrom his jacket pocket.\n\n                    MR. CALDWELL\n          Let's say I give you what's in this\n          envelope for that beautiful watch.\n\nMaurice is handed the envelope.  He opens it to find a thick\nPILE OF CASH, TENS AND TWENTIES.\n\n                    MR. CALDWELL\n          I really want that watch.\n\n                    MAURICE\n          This isn't right.\n\n                    MR. CALDWELL\n          This is my only chance to get a\n          watch like that.  It would mean a\n          lot to me and my family.  Please\n          take it.  It really isn't that\n          much.\n\nMaurice stares into the envelope emotionally and hands over\nthe watch tentatively.\n\n                    MAURICE\n          This is a loan.\n\nMr. Caldwell straps on the watch and then hugs Maurice.\n\nThe rest of the family say their good-byes.\n\nIsaac won't let go of Maurice's hand as he walks out into the\nstreet.\n\n                    MR. CALDWELL\n          Isaac, come back here.\n\nIsaac just holds on tighter.  After Maurice and Isaac have\nwalked a few steps out into the street, Maurice kneels down.\n\n                    MAURICE\n          I have to go now.\n\nIsaac's bottom lip protrudes as he tries not to cry.  Maurice\nhas to hold back a few tears himself.  He hugs Isaac tightly.\n\n                    MAURICE\n              (whispers)\n          Why didn't I meet you fifteen years\n          ago?\n\nMaurice pulls away from Isaac slowly.  Isaac runs to his\nmother's arms.  Maurice waves good-bye to the Caldwells as he\nheads down the road.\n\n                                                  CUT TO:\n\nEXT.  ROAD - DAY\n\nMaurice stops, bends down to the road and picks up a TORN\nWHITE PAPER STREAMER that spiraled its way to his feet.\n\nHe looks ahead and finds both sides of the street lined with\nparked cars.  Some of the cars are decorated with white\nstreamers.\n\n                                                  CUT TO:\n\nOUTDOOR WEDDING\n\nA beautiful canopy of flowers sits at the end of ten rows of\nlawn chairs.  Maurice watches from near the cars.  He smiles\nas the young bride and groom nervously say their vows.\nEveryone LAUGHS warmly as the groom stumbles over his lines.\n\n                                                  CUT TO:\n\nINT.  CHAPEL - DAY (FLASHBACK)\n\nMoments before the ceremony.  The guests are seated.  The\nORGAN is PLAYING.\n\n                                                  CUT TO:\n\nSIDE ROOM\n\nYoung Maurice sits on a chair in a tuxedo staring out the\nhalf-open door to an OLD MAN who tries to gain his balance by\nholding onto the wall.  Maurice is upset.  He runs his\nfingers through his hair.\n\nTHE DOOR OPENS wide as Young Ellen comes in.  She is wearing\nher WEDDING GOWN.  White lace, tight at the arms and waist --\nshe looks stunning.\n\n                    ELLEN\n          What's wrong?  They said something\n          was wrong?\n\nMaurice stares at his rented shoes.\n\n                    MAURICE\n          I'm fine.\n\nEllen moves to him and kneels before him.  She lifts his\nchin.\n\n                    ELLEN\n          Everyone's here.  Everything looks\n          beautiful.  They even got the white\n          dove I wanted for the cake -- so\n          what's wrong?  What is it?\n\nMaurice moves his gaze from her to the half open door.\n\n                    MAURICE\n          It's him.\n\nEllen looks back.\n\n                    ELLEN\n          Your father?\n\n                    MAURICE\n          He's plastered.\n\n                    ELLEN\n          That's okay -- really it is.\n\n                    MAURICE\n          No it's not.  He should be here\n          with me now, not trying to find\n          some fucking bottle of Johnny\n          Walker.  He's never been there for\n          me.  I've always been alone.\n\nMaurice looks like he may cry.\n\n                    MAURICE\n          I'm afraid Ellen... I'm scared of\n          being alone again.  What if one day\n          you realize how boring I am?  What\n          if one day you realize you're not\n          happy?\n              (beat)\n          I could have been alone before, but\n          now you've changed things.  I can't\n          be alone anymore Ellen.  I'm scared\n          what's going to happen to me.\n\nEllen takes both his hands and squeezes them between hers.\n\n                    ELLEN\n          The day I met you, I gave you my\n          heart.  Today, I give you my soul.\n          Where ever you are, where ever you\n          go, I will be with you.  Maurice\n          Parker, I promise --\n              (she shakes him with\n               emphasis)\n          I promise, you will never be alone\n          again.\n\n                                                  CUT TO:\n\nEXT.  OUTDOOR MARRIAGE - DAY (PRESENT)\n\nThe bride and groom run through a shower of rice into their\nlimousine.\n\n                                                  CUT TO:\n\nINSIDE LIMOUSINE\n\nThey wave through the window as the car pulls away.  They\nsettle in and look to the seat across from them.  On the seat\nis a fresh flower.  Next to the flower is a note.  The groom\npicks it up and shows it to the bride.  It reads:\n\n                \"CHERISH EVERYDAY TOGETHER\"\n\nIt is signed \"M.P.\"\n\nThe bride and groom look at each other curiously.\n\n                                                  CUT TO:\n\nROAD\n\nThe limousine passes Maurice on the road as he walks.\n\n                                                  CUT TO:\n\nINT.  GAZETTE BUILDING - DAY\n\nA fax machine rolls out a tongue of information.  Michelle,\nthe intern, snatches it and jogs through the maze of desks.\n\n                                                  CUT TO:\n\nKRIS'S OFFICE\n\nMichelle catches the tail end of a telephone conversation.\n\n                    KRIS\n          -- Come on Pete, this is important,\n          this is racism in our backyard...\n          Aw, that's bull... just think about\n          it, okay?\n\nKris hangs up.\n\n                    KRIS\n          They're pushing my Jewish temple\n          vandalism story to the Metro\n          section...\n\nKris notices Michelle's familiar bright red face.\n\n                    KRIS\n          What?\n\nMichelle is completely flustered as usual.\n\n                    KRIS\n          Michelle, breathe... that's it,\n          what is it, talk to me.\n\n                    MICHELLE\n              (hands the fax over)\n          Umm, Coalville Utah.\n\nKris studies the fax before jumping up from his desk and\nmoving to the wall.  An enormous U.S. MAP covers three\nquarters of the wall.  RED TACKS mark a trail across the\nUnited States, beginning with Philadelphia.  Kris puts a red\ntack at the top right corner of Utah.\n\nKris notices through the open officer door that Frank and\nSeth are listening in.  Kris nods to Michelle.  Who\nimmediately shuts the door on their view.  Kris waves bye\nbefore it closes.\n\n                    KRIS\n          He's taking highway 80 all the way.\n\nKris paces the room -- charged with excitement -- eyes\noccasionally stopping on the map.  Michelle watches Kris'\nanimated expressions.\n\n                    KRIS\n          You know what this is, don't you?\n          It's a miracle.  Not like... 'It\n          was a miracle little Johnny passed\n          his math test.'  No!  This is a\n          real miracle... Turning water to\n          wine kind of miracle.  People\n          should know about this, everyone,\n          every single person... It's time\n          for a blitz.  Let's see what kind\n          of TV interest we can generate.\n\nMichelle enjoys watching Kris when he's like this.\n\n                    MICHELLE\n          Umm, he's going to make it isn't\n          he?\n\n                    KRIS\n          Maybe.\n\nKris studies the map.\n\n                    KRIS\n          But he hasn't hit the toughest\n          miles yet.\n\n                                                  CUT TO:\n\nINT.  ADELLE'S LIVING ROOM - NIGHT\n\nThe lights are out.  The FLICKER FROM THE TV dances over\nAdelle and Gerald.  Adelle is fast asleep.  Gerald is having\na late night sandwich.  NIGHTLINE comes on the TV.\n\n                    TV ANCHOR\n          What would you do for love?  This\n          is the question Americans are\n          starting to ask themselves.  The\n          incredible tale of Maurice Parker's\n          walk across the country has caught\n          the imaginations of young and old.\n\nGerald sighs.  He puts the sandwich on the plate and hands it\nto his left -- obediently.  PAN TO LEFT to find Adelle wide\nawake now.  She glares at the TV screen silently as she takes\nthe sandwich and dumps it in the waste basket releasing some\nof her frustration.\n\nA COMPUTER MAP OF THE U.S. trails Maurice's walk on the\nscreen.\n\n                    TV ANCHOR\n          At 44, this bookstore owner from\n          Wynnewood Pennsylvania has tallied\n          an estimated 2,400 miles.  His\n          latest appearance in Coalville Utah\n          brought the spotlight of the\n          country to that small town.\n\n                    GERALD\n          Coalville Utah?\n\n                    ADELLE\n          I can't believe it.\n\n                    TV ANCHOR\n          Whatever has carried Mr. Parker\n          through snow and rain and thousands\n          of miles of this countryside, will\n          have to carry him through the most\n          dangerous part of his trek... The\n          three hundred miles through the\n          sweltering roads of Nevada...\n\n                    ADELLE\n          My God.\n\n                                                  CUT TO:\n\nEXT.  HIGHWAY - DAY\n\nA merciless sun beats down on a long stretch of highway.  The\nblack tar from the road melting slightly.\n\nNo sign of Maurice.  WE SEE into the distance, not a soul in\nsight.  WE LOOK to a hillside a hundred meters from the road.\nThere we see a figure lying still in the shade of an\noverhanging rock formation.\n\nMaurice has a towel over his eyes and his feet propped up on\nhis shoulder bag.  He is fast asleep.\n\n                                             DISSOLVE TO:\n\nDUSK\n\nThe SUN TURNS RED for one brilliant moment before hiding\nbehind the horizon.  Like an alarm went off, Maurice wakes up\nand packs his things.\n\n                                                  CUT TO:\n\nROAD\n\nThe MOONLIGHT outlines a line figure hobbling his way step by\nstep with a walking stick.\n\nThe air fills with a POWERFUL RUMBLE.  Maurice turns to see a\nwave of rocks and sand slide down a hillside to the road.\nThey CAUSE A GREAT THUNDER that settles to dust.  Maurice\nwalks down the center of the highway away from the hillside.\n\n                                             DISSOLVE TO:\n\nEXT.  HIGHWAY - DAWN\n\nTHE FIERY NEVADA SUN BEGINS ITS ASCENT INTO THE SKY.  Maurice\nlooks bad.  He's breathing heavy as he moves up a steep\nincline by the side of the road.  His feet slide on the loose\ndirt.  Maurice looks like he could collapse at any moment.\n\nHe makes it to the indentation in the hillside -- just enough\nroom to lay down in the shade.  Maurice lays out slowly.  He\npries off his sneakers, band-aids and blisters cover every\ninch of his feet.  Maurice dumps the sand out of his sneakers\nand painfully pulls them back on.  His eyes close as he tries\nto unbutton his jacket... too late he's asleep.\n\nMaurice's bed is a rock that juts from the side of the\nhill... First WE SEE nothing, then some grains of sand escape\nfrom the crack where the rock meets the hillside.  The CRACK\nBECOMES SLIGHTLY LARGER -- PULLING AWAY FROM THE HILL BY A\nFRACTION OF AN INCH.  It stabilizes there.\n\nMaurice unaware of his precarious situation sleeps twenty\nfive feet above the ground.\n\n                                                  CUT TO:\n\nMID-DAY\n\nAnother sizzler.  Temperatures in the nineties.  The sun is\ndirectly overhead.\n\nMaurice stirs in his sleep, moving closer to the edge of the\nrock.\n\nA STEADY STREAM OF SAND POURS FROM THE CRACK...\nA SLIGHT TREMOR...\nTHEN THE FRIGHTENING SOUND OF ROCK MOVING AGAINST ROCK...\n\nMaurice wakes up as he begins to slide off... Hands scraping\nat the dirt... He SLIDES OFF THE ROCK... Feet and hands\ndesperately trying to cling to the hillside... He picks up\nspeed as he tumbles down... Maurice looks down in time to see\na small jut in the rock hurtling towards him... no time for\npanic... SLAM!  A SICKENING CRACK OF BONE as Maurice HITS the\nrock square in the ribs... Maurice flops down the rest of the\nslope like a rag doll... he comes to rest in the dirt,\nclutching his ribs.  The sun beats down on his stunned eyes.\n\nMaurice stares up at the dizzying slope.  Sand still\ntrickling down to a stop.  He doesn't try to move for the\nfirst few seconds.  His breathing increasingly erratic.\n\nMaurice drags himself to sit upright.  The sharp pains\ncausing a distorted grimace on his face.  A short rest,\nbefore working his way to his feet.\n\n                                                  CUT TO:\n\nHIGHWAY\n\nMaurice uses a highway guardrail as a backrest.  He takes a\nseat in the dirt.  Maurice's hair is damp with sweat.  His\nbreathing relegated to slow gasps.  His left hand covering\nhis rib cage protectively.  Blood begins to trickle through\nthe spaces between his fingers.\n\nMaurice closes his eyes for a moment, before his bent leg\ngoes into spasms... Maurice is forced to straighten the leg\ninstantly... jarring his tender rib cafe... Maurice clings to\nthe back of his thigh... Maurice is defeated... On the verge\nof tears.\n\nHe glances way down the road and spots a TINY CLOUD OF SMOKE\nmiles away in the distance.  A car is moving in his\ndirection.\n\nMaurice looks up into the DAZZLING WHITE SKY.  Drops of sweat\nfalling into his eyes.\n\n                    MAURICE\n              (whisper)\n          It's over Ellen... I failed you\n          again.\n\nMaurice looks down the road at the cloud of dust growing\nlarger.\n\n                    MAURICE\n          I tried Ellen, I really tried... I\n          don't have the strength.\n\nThe cloud is now clearly a car... Maurice stares up into the\nsky again... The tears racing the sweat down his cheeks.\nMaurice YELLS TO THE HEAVENS.\n\n                    MAURICE\n          You said I would never be alone!...\n          You promised...\n              (his yelling turns to\n               sobs)\n          ... You promised.\n\nMaurice's is interrupted by A SLIGHT RUSTLING BEHIND HIS\nHEAD.  Maurice turns and looks through his tears...\n\nThere, a few feet from him, perched quietly and majestically\non the guardrail is a GOLDEN EAGLE.  It stands two and half\nfeet tall.  It spreads it's great wings.  The feathers expand\nlike a blanket, spanning six feet, and throwing a gentle\nshade on Maurice's face.\n\nMaurice is frozen in wonder.  The MAGIC of the moment glows\nin his eyes.  Maurice's face gains life... The dark feathered\neagle stands like a god before Maurice.  The moment is\nbreathtaking.\n\n                                                  CUT TO:\n\nROAD\n\nThe car on the road, takes the last quarter mile in\nseconds... SCREECHING IT'S BRAKES at the sight of Maurice on\nthe side of the road.\n\nMaurice turns away from the bird as the car pulls up.  The\ndriver gets out and calls over the hood.\n\n                    DRIVER\n          Hey, man are you okay?\n\nMaurice's face filled with strength.  He grins through the\npain.\n\n                    MAURICE\n          I'm fine.\n\n                    DRIVER\n          What the hell are you doing out\n          here?  You need a ride somewhere?\n\n                    MAURICE\n          No thank you.\n\nThe driver is concerned.  He opens the driver door.\n\n                    DRIVER\n          You by yourself?\n\nBeat.\n\n                    MAURICE\n          No.\n\nThis pacifies the driver somewhat.  He nods and gets in the\ncar.  Maurice watches as the car pulls away.\n\nHe turns back to the guardrail -- the eagle is gone.  Maurice\nlooks up into the sky.  The Golden Eagle is flying\noverhead... a tiny dot against the blazing sun.\n\nMaurice struggles to his feet using the guardrail as support.\nMaurice takes his first step...\n\n                                             DISSOLVE TO:\n\nEXT.  SUBURBAN STREET - DAY\n\nSuburbia.  Rows of similar houses with small lawns and custom\nmailboxes.  Beautiful trees line the streets creating a\ncanopy over the roadway.\n\nTwo women sit on a swing on the front porch of a small\nsuburban home.  JANIS AND AMMIE'S conversation is cut in mid\nsentence.\n\n                    JANIS\n          Who is that?\n\n                    AMMIE\n          I don't know.  What's the matter\n          with him?\n\nJanis and Ammie stare to the street where a sunburnt MAURICE\nstaggers in a daze.\n\nMAURICE'S POV\n\nMaurice is on the edge of darkness... the trees and faces\nswimming -- mixed with the colors of red and blue cloth\nwaving in the wind... Images come in and out of focus... two\nwomen walking towards him... Maurice clutches his head as the\ntrees start to swim faster -- color, lights, houses...\n\n                                     DISSOLVING TO BLACK:\n\nMaurice collapses in the middle of this suburban street.\nJanis and Ammie run to his side.\n\nSUPERIMPOSED:  \"ROSEVILLE, CALIFORNIA... MILE 3,205\"\n\n                                             DISSOLVE TO:\n\nINT.  HOSPITAL ROOM - DAY\n\nMaurice lays still on a hospital bed.  His eyes slowly force\nthemselves open.\n\n                    NURSE (O.S.)\n          Good morning Mr. Parker.\n\nMaurice turns his head to the side.  A pretty woman in her\nlate twenties, with LARGE LOCKS OF BROWN HAIR smiles back.\nThis is STEPHANIE.\n\n                    STEPHANIE\n          There are a lot of people worried\n          about you.\n\n                    MAURICE\n              (softly)\n          Where am I?\n\n                    STEPHANIE\n          In a hospital.\n\n                    MAURICE\n          Which hospital?  Did you take me\n          back?\n\nStephanie understands his worry.\n\n                    STEPHANIE\n          You are in St. Vincent's Hospital\n          in Roseville California.  You've\n          been here three days.\n\nMaurice closes his eyes in relief.\n\n                    MAURICE\n          Thank God.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL - AFTERNOON\n\nThe room is crowded.  Maurice is now propped up in a seated\nposition.  He tries to digest a set of fish sticks on a tray.\n\n                    MAURICE\n          I can't believe you're here.  I'm\n          touched.\n\nMaurice looks across to ADELLE AND GERALD.\n\n                    MAURICE\n          Are you two planning kids?\n\n                    ADELLE\n          Maybe later.\n\n                    MAURICE\n          You should definitely have\n          children.  They're really special.\n\nAdelle and Gerald are in shock.  Maurice forks another fish\nstick with a smile.\n\n                    ADELLE\n          I don't think you realize how\n          serious this is Uncle.\n\n                    MAURICE\n          How serious is it?\n\nDR. RAY, who has been standing by the window listening, steps\nforward.\n\n                    DR. RAY\n          You have two broken ribs, a\n          punctured spleen and Acute\n          Rheumatoid Arthritis.\n\nMaurice gives a comforting smile to Adelle.\n\n                    DR. RAY\n          The normal amount of build up in\n          your arteries has been aggravated\n          by over exertion.  This is called,\n          \"Claudication,\"  As a result, there\n          isn't enough circulation to your\n          body.  That accounts for the\n          discoloration in your extremities\n          and the muscle spasms I'm sure\n          you've encountered.\n\n                    MAURICE\n          Can it kill me?\n\n                    DR. RAY\n          It can, but it'll have to wait in\n          line.\n\nThis surprises Maurice.\n\n                    DR. RAY\n          We ran a C.T. and an M.R.I.  We\n          found bleeding in your brain.  Your\n          collapse was caused by \"Transient\n          Cerebral-Ischemia\"... a sudden loss\n          of blood circulation to the brain.\n          In other words, Mr. Parker, you had\n          a mild stroke.\n\nThere is dead silence in the room.\n\n                    MAURICE\n              (scared)\n          I suppose I over did it.\n\nAdelle moves over to Maurice's side and holds his hand.\n\n                    MAURICE\n          What steps do we take now?\n\n                    DR. RAY\n          We operate.  We find the artery in\n          the brain and close the bleeding...\n          I just did this procedure on a\n          Senator and he's doing fine.\n\n                    MAURICE\n          What are the odds?  Do I have a\n          fifty-fifty chance of surviving the\n          operation?\n\n                    DR. RAY\n          It's hard to say.  It's a delicate\n          surgery.  There's no getting around\n          the fact that it's a very high-risk\n          situation.\n\nAdelle strokes Maurice's hair.  Maurice stares down at his\nfood before looking up with great resolve.\n\n                    MAURICE\n          Then it'll have to wait until I\n          finish.\n\n                    ADELLE\n          What?\n\n                    MAURICE\n          I finish the walk, and then we may\n          take all the chances we want.\n\nThe room is stunned.  Adelle gets off the bed and collects\nherself.\n\n                    ADELLE\n          Listen to me very carefully,\n          because I don't want you to\n          misunderstand me... The walk is\n          over Uncle Maurice.  Done.\n          Finished.  You've made it to\n          California, it was a miracle, now\n          let's try to save your life.\n\n                    MAURICE\n              (louder)\n          I'm completing the walk.  I'm\n          almost there.\n\n                    DR. RAY\n          Okay, Maurice keep it calm...\n              (beat)\n          We can talk about this again, but\n          just so you know, we have a guard\n          on this floor who's sole job it is\n          to keep an eye on you.\n\nMaurice is crushed.\n\n                    DR. RAY\n          There are a lot of people out there\n          who would like to see you finish,\n          including me, but I'm not willing\n          to put your life in anymore risk\n          than it is... We do the operation,\n          and when you're better, you finish\n          the walk.\n\nThe room is dead again.  Maurice drowns in his thoughts.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL CHAPEL - AFTERNOON\n\nA small chapel.  Stain glass windows overlooking the parking\nlot.  Maurice sits in his wheel chair at the back of the\nroom.  A few other patients are scattered in the four small\npews.\n\nMaurice has his hands folded tightly and stares up at the\nstatue of Mary.  His concentration is broken as a man in a\nfull black suit and black shirt sits next to him.  Maurice\nnods at the priest.\n\n                    PRIEST\n          Hello, Mr. Parker.\n\n                    MAURICE\n          Hello.\n\n                    PRIEST\n          How are you feeling?\n\n                    MAURICE\n          Confused.  I'm not sure what to do\n          now.  I'm not sure what he wants\n          for me.\n\n                    PRIEST\n          He wants to reward you... That's\n          why I'm here.\n\n                    MAURICE\n              (a little confused)\n          What do you mean?\n\n                    PRIEST\n          I mean you've done a great thing.\n          You should be rewarded monetarily.\n\nMaurice is lost.\n\n                    PRIEST\n          What's your shoe size?\n\n                    MAURICE\n          What?  Who are you?\n\nThe priest reaches into his jacket -- for the first time WE\nSEE a Polo design on his shirt and a gaudy gold chain around\nhis neck.\n\n                    PRIEST\n          Clive Silver -- Marketing Executive\n          at Reebok.\n\nMaurice stares at the card in disbelief.\n\n                    CLIVE\n          We want you to do some spots for\n          us.\n\n                    MAURICE\n          What the hell is this?\n\nSome of the patients turn around.\n\n                    CLIVE\n          I'm talking six figures, pay or\n          play -- for two spots.  We want to\n          push a new line with you...\n          America's New Hero.\n\nMaurice is flustered.  He can't take this.  His eyes become\ndesperate.\n\nClive waves his hands in the air excitedly.\n\n                    CLIVE\n          Imagine grainy black and white\n          shots of long stretches of highway\n          -- quick cuts with a slow pounding\n          beat underneath... Then we see a\n          man walking up a steep incline --\n          it's you Maurice.  We see shots of\n          you walking.  Cut.  Cut.  Cut.\n          Fast... Music crescendoes -- Bham!\n          Close up -- and you say...\n          'Reebok, Because There's Nothing\n          You Can't Do.'\n\nClive finishes.  He is surprised to find Maurice in tears.\nClive is thrown totally off as Maurice stares at him angrily\nthrough streaming tears.\n\n                    MAURICE\n          My wife is dead.\n\nMaurice continues his powerful gaze until Clive looks away.\nClive gathers his things and leaves the chapel without\nanother word.  Maurice drops his head into his hands and\ncries quietly.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL ROOM - NIGHT\n\nA change of shifts.  Stephanie gathers her things.  She lifts\nher coat off the counter.  Underneath is a paper.  She spins\nthe paper to face her.  The headline reads, \"The End of a\nJourney - Parker Hospitalized.\"\n\n                                                  CUT TO:\n\nHOSPITAL ROOM\n\nStephanie peeks into the dark room.\n\n                    STEPHANIE\n              (whispers)\n          Good night Mr. Parker.  I'll see\n          you tomorrow.\n\nStephanie waits for a response from the motionless figure on\nthe bed.  She leaves the room a little disappointed.\n\nWE MOVE CLOSER TO THE BED.  We see Maurice laying still --\nthe battered photo of Ellen clutches to his chest.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL HALL - DAY\n\nStephanie is wheeling Maurice down the hall.  Maurice has a\nglint of happiness in his eye.  They move through the doors\nmarked \"Visitor's Area.\"\n\nMaurice stretches a huge grin as KRIS REDDY gets up from a\nchair.  Kris bends down and hugs Maurice emotionally.\n\n                    KRIS\n          Tom Joad?\n\n                    MAURICE\n          ... The Grapes of Wrath.\n\n                    KRIS\n          You're amazing.\n\n                                                  CUT TO:\n\nLATER\n\nMaurice and Kris seated in the corner of the room.\n\n                    MAURICE\n          I missed you Kris.\n\n                    KRIS\n          I missed you to Mr. Parker.\n\n                    MAURICE\n          Adelle told me, your writing is\n          going well.  The Crusader for\n          social issues and all.\n\n                    KRIS\n          You were right.  From the heart is\n          always better.\n\nBeat.\n\n                    KRIS\n          I drove by the bookstore -- it's\n          boarded up now.  There's a sign\n          over the wood -- \"Office space\n          available.\"\n\nThe loss is evident on Maurice's eyes.\n\n                    MAURICE\n          I haven't been too punctual with\n          the rent.\n\n                    KRIS\n          I was thinking you could open\n          another store with investors.  I'm\n          sure a lot of people would want to\n          get involved with you now.\n\nMaurice forces a smile.\n\n                    MAURICE\n          Actually, I'm not worried about my\n          career right now... I'm more\n          worried about how you're getting me\n          out of here?\n\nBeat.  Kris glances at the hair on his forearm.\n\n                    MAURICE\n          Are they standing?\n\n                    KRIS\n              (running his hand over his\n               arm)\n          Saluting.\n\nBeat.\n\n                    KRIS\n          Come on Mr. Parker.\n\n                    MAURICE\n          What, come on?\n\n                    KRIS\n          I can't do it.  I want you to\n          finish, but I want you to live\n          more.\n\nMaurice sits back straight.  He looks upset.\n\n                    MAURICE\n          We do the operation after I finish.\n          I can't risk not finishing... I\n          thought you understood what I was\n          doing.\n\n                    KRIS\n          I do.\n\n                    MAURICE\n          Why in God's name did you fly all\n          the way here then?\n\n                    KRIS\n          Don't do this.\n\n                    MAURICE\n          ... To look me in the eye and say\n          what's important to you isn't as\n          important to me?  To tell me you\n          know what's best?  To tell me life\n          is more precious than what I feel\n          for my wife?\n\nKris gets very emotional.  He rises from this chair.\n\n                    KRIS\n          Mr. Parker, you can yell at me, if\n          it'll help.  But I'm not risking\n          your life.\n\n                    MAURICE\n          It's mine to risk.\n\nMaurice turns to the window away from Kris.\n\n                    KRIS\n          Your operation is scheduled for\n          Friday.  I'll be back before then.\n\nKris walks to the door and stops.\n\n                    KRIS\n          She knows you love her Mr. Parker.\n          She knows now.\n\n                    MAURICE\n              (not looking at Kris)\n          No more words.  Until I touch the\n          ocean with my hands... it's all\n          just words.\n\nKris is tortured.  He leaves the room.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL HALL - DAY\n\nMaurice wheels himself into the hall from the waiting area.\nHe looks around.  His eyes lock on the EXIT SIGN over the\ndoor at the end of the hall.  His eyes scan the area quickly.\nHe immediately finds the guard on the floor staring at him.\nThe guard nods ever so slightly as if to say, \"I know what\nyou're thinking.\"  Maurice turns his attention to a small boy\nin a hospital gown, being scolded by a head nurse.\n\n                    HEAD NURSE\n          You cooperate with us about taking\n          your medicine and maybe we'll talk\n          about candy.\n\nThe head nurse takes a chocolate bar out of the boy's tiny\nhands.  The boy offers no response.  Maurice watches\ncuriously as STEPHANIE walks over and pats the boys head.\nMaurice catches a small exchange -- Stephanie slips another\ncandy bar into his pocket.  The boy breaks into a warm smile.\nStephanie puts her fingers against her lips and winks.\nMaurice takes this exchange in with great interest.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL ROOM - DAY\n\nStephanie steps into the room and prepares a tray of food.\nThe SILHOUETTED FIGURE of Maurice seated near the bay window\nturns to face her.\n\n                    STEPHANIE\n          You should be in bed.\n\nThe face stares back from the shadows.  She feels him\nwatching.\n\n                    MAURICE\n          What do your friends call you?\n\n                    STEPHANIE\n          Steph.\n\n                    MAURICE\n          Do you have a car, Steph?\n\nBeat.\n\n                    STEPHANIE\n          You should be in bed...\n\nStephanie moves to Maurice... She stops short when his face\ncomes into view.  His eyes are raw -- red.  His face puffy.\n\n                    STEPHANIE\n          You're in pain.\n\n                    MAURICE\n          I need your help.\n\n                    STEPHANIE\n          They told me, you might try to talk\n          me into something... You need to\n          rest Mr. Parker... It's for your\n          own good.\n              (beat)\n          I've been following your story for\n          a long while.  It's a beautiful\n          thing you did.\n\n                    MAURICE\n          You ever lose somebody Stephanie?\n\n                    STEPHANIE\n          Mr. Parker, I'm supposed to give\n          you your fish sticks.\n\nBeat.  Maurice melts her with his expression.\n\n                    STEPHANIE\n          ... My father.\n\n                    MAURICE\n          Did you tell him everything you\n          wanted to?  Did you do everything\n          you could while he was here?\n\nShe shakes her head \"No\" -- the tears welling up in her eyes.\n\n                    MAURICE\n          If I don't do this Steph, my life\n          isn't worth saving.\n\nMaurice reaches out and squeezes her soft trembling hand.\n\n                    MAURICE\n          Please, help me.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL HALLWAY - DAY\n\nStephanie throws a nervous smile to the guard as she escorts\na doctor down the hall... The doctor's oversized while lab\ncoat almost drags on the floor as he tries to hide the pain\nof being on his feet.  MAURICE PARKER studies a bogus chart\nin his hands.  His new glasses, sliding off his nose.  Beads\nof sweat -- revealing his agony.\n\n                                                  CUT TO:\n\nELEVATOR\n\nThree people in the elevator; Stephanie, Dr. Maurice Parker,\nand a female physician.  The female doctor looks at Maurice\ncuriously, studying his demeanor -- she can't place him.\n\nThe ELEVATOR DOORS OPEN on the third floor... The SOUND OF A\nTV FLOODS THE ELEVATOR COMPARTMENT.  Maurice looks up in\nhorror to see a close-up of his FACE superimposed on the TV\nscreen seated on the receptionist's desk.  A man gets on the\nelevator.\n\nThe female doctor stares at the TV as the doors close -- she\nimmediately turns to Maurice... her view is blocked by the\nnew passenger... the elevator progresses down 2... 1...\nThe female doctor leans forward trying to get a glimpse of\nMaurice... THE BELL DINGS as the doors open on the ground\nfloor.\n\nDoctor Maurice Parker and Stephanie quickly exit... the\nfemale doctor stays in the elevator and watches carefully.\n\n                    FEMALE DOCTOR\n              (yells)\n          Excuse me, doctor...\n\nDOWN THE HALL... Maurice pauses and turns around -- fear\netched across his face.  The female doctor looks around the\nbarren hall then turns back to Maurice.\n\n                    FEMALE DOCTOR\n          Good luck.\n\nThe female doctor smiles as the doors shut.  After a few\nmoments of shock -- Maurice smiles back.\n\nStephanie yanks Maurice down the hall and out the EMERGENCY\nROOM EXIT.\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nA colorful canopy of leaves... a familiar torn American flag.\nStephanie's white VW Rabbit pulls to a stop.\n\n                    MAURICE\n          This is it... This is where I fell.\n\nHe turns back to Stephanie who stares back at him\nemotionally.\n\n                    STEPHANIE\n          I never thanked my father.  He did\n          so much for me... I never thanked\n          him.\n\nMaurice holds her sad face in his scared hands.\n\n                    MAURICE\n              (whispering)\n          It's not too late.\n\nMaurice gets out of the car painfully slow.  He pulls his\nshoulder back upright with a laborious breath.  A sense of\npride returns to his face.  He turns back to Stephanie and\ncatches a horrified look.  He follows her stare...\n\nShe is staring at his shirt... He looks down to see a DARK\nCRIMSON STAIN GROWING beneath the surface.  He covers the\narea with his hand.\n\n                    MAURICE\n          You're going to have a lot of work\n          to do when I get back.\n\n                    STEPHANIE\n          Someone should be with you.\n\nBeat.\n\n                    MAURICE\n          Someone is.\n\nHe gives her his best smile and begins shuffling his feet\nover the loose gravel of the road... one step at a time.\n\n                                                  CUT TO:\n\nINT.  HOSPITAL STAIRS - AFTERNOON\n\nA black man -- grey, balding hair walks hurriedly up the\nstairs.  This is STAN NEWTON.\n\nKeeping in step with Newton is a police officer.  SERGEANT\nEMORY, jet white hair, army cut, gives him an intimidating\nappearance.\n\n                                                  CUT TO:\n\nOUTSIDE DOOR\n\nNewton stops Emory before entering.\n\n                    NEWTON\n          I'm afraid Mrs. Matlin is very\n          upset.\n\nEmory lets the warning sink in before opening the door.\nAdelle's VOICE IS BOOMING.\n\n                                                  CUT TO:\n\nHOSPITAL ROOM\n\nAdelle YELLS at Dr. Ray, a few nurses, and the guard who was\non duty.\n\n                    ADELLE\n          ... \"American Journal of\n          Psychology\", \"Psychological\n          Review\", and \"Science\", so I think\n          it's safe to say my opinion is\n          valid.\n\nShe catches her breath.\n\n                    ADELLE\n          How does a grown man who can barely\n          walk, just stroll out?... This is\n          not James Bond here, this is my\n          uncle who owns a bookstore, and\n          gets outwitted by grade school kids\n          pulling pranks!\n\nAdelle notices the new people in the room.\n\n                    NEWTON\n          Mrs. Matlin, this is Sergeant\n          Emory.  He'll help us find your\n          uncle.\n\nAdelle walks up to Emory.\n\n                    ADELLE\n          Let me tell you a story Sergeant.\n          There was a patient of mine who had\n          a Golden Retriever, Mac... She\n          loved Mac, not like a pet, but like\n          a family member.  One day, she had\n          to leave Mac with 'friends', and\n          wouldn't you know it, Mac gets away\n          and ends up falling into a sewer.\n          My patient comes back -- goes nuts\n          when she hears that Mac has been in\n          the sewer for over 48 hours.\n          Apparently the cop who found the\n          dog didn't want to get his pants\n          dirty.  And neither did anyone\n          else.  So of course, my patient\n          decides to go in after it... she\n          falls... breaks her hip and lands\n          next to her dead dog, who died of\n          toxic fumes down there...\n\nAdelle looks around at all the engrossed faces.\n\n                    ADELLE\n          The moral of the story is... She\n          sued for a lot of money!  She sued\n          the friends, the city, and the\n          officer for negligence on duty.\n          She has no Mac, no happiness, but\n          she's very rich now... That was a\n          dog.  We're talking about a human\n          being...\n              (beat)\n          I hope everyone clearly understands\n          the chain of events that will occur\n          if something should happen to my\n          uncle, whom I love more than you\n          can possibly imagine... Now\n          Sergeant I would like to know right\n          now, if you're willing to get your\n          pants dirty for my uncle?\n\nAdelle and Emory have a staring contest.  Adelle wins.\nAdelle stands alone in a room with four men, and she is\nclearly the one in charge.\n\nThe door flies open.  A police officer walks in pushing KRIS\nREDDY through the door.\n\n                    OFFICER\n          I found him sneaking up the back\n          stairs with this.\n\nThe officer holds out a long coat and hat.  Emory walks up to\nKris.\n\n                    EMORY\n          Did you help Mr. Parker leave this\n          hospital?\n\nKris looks to the empty bed and smiles... a BIG SMILE.\n\n                    KRIS\n          No... But I was going to.\n\nBeat.  Emory turns to the officer and ushers him to the door.\n\n                    EMORY\n          Forget him.  It's time to get our\n          pants dirty.\n\nAdelle smiles.\n\n                    EMORY\n          I want three black and whites from\n          here to Handley Avenue.  And no\n          communication with the station.\n          The press monitors the\n          transmissions.\n\n                    KRIS\n              (a born actor)\n          They can do that?\n\n                    EMORY\n          That goes for all of you.  Not a\n          word about this disappearance to\n          anyone.  Absolutely no press.\n\nKris smiles innocently.\n\n                                                  CUT TO:\n\nEXT.  STREET - NIGHT\n\nPolice vehicles roam the city streets -- slowing to a crawl\nat every white male over forty, walking the sidewalks.\n\n                                                  CUT TO:\n\nADELLE\n\nscanning the crowded intersections through the open window of\nher moving taxi.\n\n                                                  CUT TO:\n\nKRIS\n\npatrolling the streets on foot.  He stops at a hot dog vendor\nand flashes a picture of Maurice from his wallet.  The vendor\nshakes his head, \"No.\"\n\nA COMMOTION BREAKS OUT ONE BLOCK DOWN... Kris spins in that\ndirection... sees a crowd forming at the corner of the\nsidewalk... Starts toward them... Kris sees something through\nthe thinner parts of the crowd... something laying on the\nsidewalk... A man!  Kris' walk turns into a sprint.\n\nKris works his way through the growing crowd, puncturing the\ncenter of the circle... Kris gazes down at the man writhing\non the concrete... A black man, shaking uncontrollably.  A\nwomen standing over the fallen man waves the crowd back.\n\n                    WOMAN\n          He has Epilepsy, just give him\n          room... An ambulance is on the way.\n\nThe crowd spreads out.  Kris looks down at the unconscious\nman on the sidewalk sadly -- Kris' thoughts race.  He moves\non with newfound concern.\n\n                                                  CUT TO:\n\nINT.  HOMELESS SHELTER - EVENING\n\nA converted gymnasium.  The room is splintered into rows of\nfolding tables and chairs.  Against the wall, is the serving\nstand.  Groups of volunteers dispense sandwiches and soup.\n\nIN THE CORNER\n\nThe room is crowded with homeless men and women and a few\nchildren.  In the back we find MAURICE.  In his old clothes,\nand tired disheveled appearance -- Maurice is virtually\ninvisible in this crowd.  He presses something to his injured\nside.  His condition has worsened.\n\nHe eyes the entrance where a POLICE OFFICER walks in and\nmoves to the serving counter.  The officer asks the serving\nlady something, and shows her a picture.  She shrugs her\nshoulders and continues serving.  The cop takes one last look\naround the hundreds of hungry people leaving the room.\n\nMaurice pulls up his hand from underneath his shirt.  The\nnapkin he was holding at his side is SATURATED WITH BLOOD.\nMaurice replaces it with a clean napkin.\n\n                                             DISSOLVE TO:\n\nEXT.  POLICE STATION - MORNING\n\nSUNRISE ON SOUTHERN CALIFORNIA.\n\n                                                  CUT TO:\n\nINT.  POLICE STATION - MORNING\n\nEmory rubs his eyes as the papers pile up on his desk.\nOFFICER KLEIN lays out the newspapers one after the other.\n\n                    KLEIN\n          ... L.A. Times -- 'He's Back.'...\n          San Francisco Chronicle -- 'Have\n          You Seen Maurice?'... New York Post\n          'Unstoppable!'\n\nKlein lays the last paper on the table.\n\n                    EMORY\n          Is that all?\n\n                    KLEIN\n          No.  The Mayor sent word, that he\n          wants this thing handled quickly,\n          before anything unfortunate\n          happens.  He said he doesn't want\n          to be known as the 'Mayor of the\n          City Where Maurice Parker Died!'\n\n                    EMORY\n          Is that all?\n\n                    KLEIN\n          No.  Mrs. Matlin's waiting for\n          you.\n\nKlein opens the door.  Adelle walks in and stands at a\ndistance from Emory.  She looks beat.  Her eyes are\nbloodshot, and tired.\n\n                    ADELLE\n          What happened with the museum\n          sighting?\n\n                    EMORY\n          False alarm.\n\nAdelle is visibly dejected.\n\n                    EMORY\n          It's been a long couple of days for\n          all of us.  So let me be honest.\n          If he hasn't turned up yet, he's\n          probably --\n\n                    ADELLE\n          No... No.\n\n                    EMORY\n          I spoke with Dr. Ray this morning,\n          and he said it was highly unlikely\n          that someone in his condition could\n          survive this long without medical\n          attention, let alone walk sixty\n          miles -- in fact his exact word\n          was, 'Impossible'.\n\nAdelle fiddles with her coat.\n\n                    EMORY\n          If I knew where he was, I'd get him\n          off the street, but I think it's\n          time that you, the Mayor, and\n          everyone else be braced for the\n          inevitable.\n\n                                                  CUT TO:\n\nEXT.  JUNIPERO SERRA FREEWAY - DAY\n\nThe freeway is packed -- bumper to bumper.  Cars standing\nstill in the hot sun.\n\nA hispanic man in his late forties, JUAN is seated in his\nDodge Caravan when he sees someone in his rearview mirror.  A\nman is using a stick as a cane.  The struggling man makes his\nway along the shoulder very slowly.\n\nJuan reaches over to his passenger seat and turns over the\nL.A. Times.  Under the heading, \"He's Back!\" is Maurice's\npicture.  Juan quickly rolls down his window as Maurice\npasses by on the shoulder.\n\n                    JUAN\n              (yelling)\n          Hey, Maurice man -- keep going\n          buddy!\n\nMaurice is startled at the man's yell, but then smiles when\nthe words register.  Maurice struggles forward.\n\nJuan keeps yelling encouragements... This grabs the attention\nof other drivers who realize who is walking past them.  One\nby one, car doors open and people call to Maurice.\n\n                    OVERWEIGHT WOMAN\n          Don't stop Maurice!\n\n                    YOUNG MAN\n          Go Mr. Parker!\n\nCars start to HONK... More and more people turn to see the\ncommotion... The YELLING AND HONKING IS JOINED BY WHISTLES\nAND CHEERS --\n\nMaurice can't believe it -- he tries to smile but can't hold\nit.  His face tightens with every step.  His shirt is soiled\nwith blood.  He raises his hand and gives a weak wave to a\nwoman who holds up her little boy through the sunroof of the\ncar.\n\n                                                  CUT TO:\n\nA WCAU NEWS VAN\n\nparked in the traffic.  A NEWSREPORTER stares through\nbinoculars.\n\n                    REPORTER\n          Thank you God!\n\nThe crew quickly prepares their cameras and equipment.  They\nmove like lightning.  In seconds they are shooting the crowd\nand their hero.\n\nThe air is CHARGED... THE NOISE GROWING, MORE AND MORE PEOPLE\nJOIN IN... LOUDER... People stand on top of their cars to get\na better view...\n\n                                                  CUT TO:\n\nA POLICE CAR\n\nstuck in traffic.  OFFICER DAWSON looks around as the PARADE\nOF NOISE SURGES TOWARDS HIM.  He looks out his window and\ncatches a GLIMPSE OF MAURICE LIMPING UP THE FREEWAY.\n\n                    DAWSON\n          Sweet Jesus!\n\n                                                  CUT TO:\n\nINT.  POLICE STATION - DAY\n\nOfficer Klein busts into Emory's office just as Adelle is\nabout to leave.\n\n                    KLEIN\n          They found him.\n\nAdelle is instantly charged with life.\n\n                    KLEIN\n          Dawson's on the C.B. -- wants to\n          talk with you Sarg.\n\n                                                  CUT TO:\n\nRADIO ROOM\n\nAdelle and as many officers that will fit in the room are\nlistening to the radio conversation.\n\n                    EMORY\n          What's going on?  Where is he?\n\nEmory CLICKS TO LISTEN.  THE SPEAKERS EXPLODE WITH HONKING\nAND CHEERING -- IT SOUNDS LIKE A CARNIVAL.  DAWSON YELLS OVER\nTHE COMMOTION.\n\n                    DAWSON (V.O.)\n          He's just getting off 280.  It's\n          amazing Sarg... everybody's out of\n          their cars and cheering him on.\n\n                    EMORY\n          Shit, get him in your car and take\n          him to St. Vincents.\n\nBeat.\n\n                    DAWSON (V.O.)\n          You ever see that concert footage\n          of the Doors, Sarg?\n\nAdelle and the room of officers look confused.\n\n                    EMORY\n          What the hell are you talking\n          about?\n\n                    DAWSON (V.O.)\n          The Doors, the musical group.  I\n          saw a documentary where the police\n          stopped one of their concerts,\n          snatched Jim Morrison right off the\n          stage... the crowd went frickin\n          nuts -- they tore up the place --\n          it turned into a war.\n              (beat)\n          ... I'm not stopping this concert\n          by myself.  And there's no way\n          you're getting backup here -- it's\n          jammed up for miles.\n\nEmory is thinking fast.\n\n                    DAWSON (V.O.)\n          Why don't we just let him finish\n          Sarg?\n\nBeat.  Emory looks at Adelle's expectant face.  He talks into\nthe C.B. without taking his eyes off her.\n\n                    EMORY\n          How does he look?\n\n                    DAWSON (V.O.)\n          Like shit.  He's bleeding heavily.\n          He's having breathing problems and\n          he's as pale as stone.  If he\n          wasn't moving, I'd swear he was\n          dead.\n\nEmory thinks.  He talks to the other officers in the room.\n\n                    EMORY\n          Bring him in.  Now!  If he dies out\n          there, who the hell knows what that\n          crowd will do...\n              (to himself)\n          Let alone the Mayor.\n\nThe room empties fast.  Emory talks to Adelle.\n\n                    EMORY\n          He'll be in a hospital within a\n          half an hour.\n\nSomehow, Adelle's face doesn't convey much confidence.\n\n                                                  CUT TO:\n\nINT.  PACIFICA MALL - DAY\n\nThe shops are empty.  The food court abandoned.\n\nClose to five hundred people are huddled at the center of the\nmall.  The HI-FI HOUSE has four large screen TV's in their\nbay windows and speakers on the outside of the doors to lure\npassing shoppers in.\n\nAll four sets have the same program on -- A NEWSBREAK on\nMaurice Parker.  The crowd listening anxiously.\n\n                    TV ANCHOR\n          ... He's headed West on Sharp Park\n          Road... Witnesses describe him as\n          seriously injured.\n\nA shock of concern shoots through the crowd.\n\n                    TV ANCHOR\n          Lynn McCay and our Highway Cam --\n          has just spotted him...\n\nThe picture cuts to a HELICOPTER SHOT OF DOWNTOWN PACIFICA --\nat first it just looks like an aerial of buildings, then the\ncamera ZOOMS.  It catches a tiny figure struggling through a\nstreet intersection.\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nNewspapers spiral through the air.  Maurice stretches his\nneck up, squinting at the sun.  The SILHOUETTE OF A\nHELICOPTER hovers above him.  The NOISE is overpowering.\n\nMaurice's fatigue grows, every muscle, every ounce of energy\ngoes into each step.  Maurice clutches the side of his\nhead... the steps halted... hands trembling, teeth clenched,\neyes squeezed shut.  A surge of intense pain tries to buckle\nhim... Maurice fights it off as he moves his feet again.\n\nThe helicopter SWOOPS above as he makes his turn onto a FINAL\nSTRETCH OF ROAD adjacent to the BEACH.\n\nMaurice stops dead in his tracks as he turns the corner to\nfind a SEA OF PEOPLE WAITING FOR HIM.  A momentous sight...\npeople lined along the street for as far as the eye can see.\nAN EXPLOSION OF YELLING, CHEERING CALIFORNIAN'S ENGULFS THE\nAIR as they spot Maurice standing at the end of the street.\nThe CROWD SURGES TOWARDS HIM.\n\nMaurice is dazed... the noise, the pain, the faces swirl in\nhis head as thousands of people surround him.  Maurice is\noverwhelmed.  He is about to collapse when someone takes hold\nof his arm.  Maurice turns to see KRIS REDDY STANDING NEXT TO\nHIM.  In the midst of this chaos and growing madness.\nMaurice and Kris have an entire conversation with one\nemotional look.\n\nThe SOUNDS of SIRENS BREAK the moment.  Kris turns to see two\npolice cars turn on the street behind them.\n\nKris turns to Maurice.\n\n                    KRIS\n          Don't stop walking.\n\nKris lets go of his arm and moves like lightning.  He jumps\natop a fire-hydrant and yells to the crowd.\n\n                    KRIS\n          The police are here.  They're\n          coming to take Mr. Parker away.  He\n          needs our help.\n\nKris points to the squad cars inching their way up the\nstreet.\n\n                    KRIS\n          Help Mr. Parker!  Don't let them\n          end the walk.\n\n                                                  CUT TO:\n\nTHE SQUAD CARS\n\nAS THEY COME TO A HALT as a wall of people stand in their\nway.  The SPEAKER ON THE POLICE CAR BLARES THROUGH THE AIR.\n\n                    SPEAKER\n          Step aside now!  You are ordered to\n          step aside now!\n\nThe people don't move.  A WOMAN carrying a BABY makes the\nbaby move her little hand in a waving gesture to the officers\nbehind the wheel of the police cars.  The officers look at\neach other in disbelief.\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nThe far end of the beach road.  A POLICE CAR SCREECHES TO A\nSTOP.  Sergeant Emory and Adelle get out.\n\nAdelle is completely blown away.  She looks around at the\nPANDEMONIUM.  Thousands of men, women and children\ncelebrating with APPLAUSE AND CHEERS, HELICOPTERS IN THE AIR,\ncamera crews standing on raised platforms.  Adelle drinks in\nthe ELECTRIC ATMOSPHERE with awe.\n\nEmory yells orders into his WALKIE-TALKIE as Adelle breaks\nthe outer edge of the crowd and disappears into the field of\nspectators.\n\n                    EMORY\n              (yelling)\n          What the hell is going on?  It's\n          frickin wall to wall people and\n          they're way too emotional.  We need\n          mucho backup -- now!... Officers\n          are to bring in Mr. Parker on\n          sight, don't ask questions, don't\n          hesitate, bring him in... I want a\n          barricade placed along the entire\n          beach area... Now God damn it, now!\n\nEmory CLICKS OFF and looks around at the growing crowd -- he\nturns to see a PUBLIC BUS UNLOADING PASSENGERS -- fifty more\nspectators rush off the bus and rush toward the crowded\nstreet.\n\n                    EMORY\n          Holy shit.\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nMaurice stares down at the ground... willing each new step.\nTHE CHEERS AND WORDS OF ENCOURAGEMENT BLURRING INTO A\nUNDISTINGUISHABLE SOUND.\n\nMaurice looks up for a moment as something grabs his\nattention -- Maurice gasps for air as his eyes focus... The\nsmall faces become clearer... Maurice stands twenty feet from\nthe entire population of PACIFICA HIGH SCHOOL.  They cover\none side of the street for an entire block.  Stretched over\ntheir heads, held up by twenty students is a HUGE HAND\nPAINTED BANNER.  Maurice reads the words:\n\n                    \"ELLEN IS WATCHING!\"\n\n                                                  CUT TO:\n\nEXT.  BEACH - DAY\n\nTrucks unload dozens upon dozens of blue-wooden barricades.\nAn assembly line of officers place the barricades end to end\nat the place where the sand meets the pavement.\n\nEmory yells orders as a new truck arrives.\n\n                                                  CUT TO:\n\nINT.  NEWS MONTAGE - DAY\n\nSHOTS OF THE PULSATING CROWD... GLIMPSES OF MAURICE MOVING\nTHROUGH THE CENTER OF THIS MASS.  OVER THESE PICTURES WE HEAR\nSNIPPETS OF VOICES OF TV ANCHOR PEOPLE, RADIO PERSONALITIES\nAND ANNOUNCERS ALL OVER THE COUNTRY, DISSOLVING INTO EACH\nOTHER ONE AFTER THE OTHER...\n\n                    TV ANCHOR (V.O.)\n          ... Through ten states and over\n          three thousand miles...\n\n                    TV ANCHOR 2 (V.O.)\n          ... A bookstore owner from\n          Philadelphia Pennsylvania...\n\n                                                  CUT TO:\n\nFATHER BERCHMAN\n\nthe father that brought Maurice in out of the cold in the\nMidwest, praying intensely in his chapel.  AN OLD HAND-HELD\nRADIO IS ON THE PEW NEXT TO HIM.  He listens to the updates.\n\n                    RADIO D.J. (V.O.)\n          ... Ellen Parker killed by a drunk\n          driver September 2nd...\n\n                                                  CUT TO:\n\nMR. CALDWELL\n\nIsaac's father, sitting in a TV station watching the monitors\nas the feeds come in from California.  Mr. Caldwell watches\nwith great emotion, eyes glued to the screen.\n\n                    TV ANCHOR 3 (V.O.)\n          ... A seven month odyssey through\n          the heart of the country...\n\n                                                  CUT TO:\n\nSERGEANT DALLY\n\nthe police officer from Philadelphia who worked with Adelle.\nHe listens with the rest of the precinct to a portable stereo\non a windowsill.  The room is silent -- everyone hangs on the\nwords coming from the speakers.\n\n                    RADIO D.J. 2 (V.O.)\n          ... the power of the human\n          spirit...\n\n                                                  CUT TO:\n\nGERALD\n\nin a hotel room.  The TV FILLING THE ROOM WITH NEWS.  Gerald\nsits behind two large room-service carts of food.  He takes a\nbig bite of a sandwich with an emotional smile to the\ntelevision.\n\n                    TV ANCHOR 4 (V.O.)\n          ... A life threatening condition,\n          Transient Cerebral Ischemia...\n\n                                                  CUT TO:\n\nST. VINCENT'S HOSPITAL\n\nwhere STEPHANIE watches in the jam packed recreation room\nwith about thirty patients watching a TV screen mounted high\nin the corner of the room.  Stephanie looks a mess, she's\nbeen crying for a while.\n\n                    TV ANCHOR 5\n          ... a journey he began by himself,\n          will end with a family of millions\n          at his side...\n\n                                                  CUT TO:\n\nEXT.  STREET - DAY\n\nThe BOISTEROUS crowd parts like a ripple effect as Maurice\nwalks through.  The eyes fall emotionally on him as he stares\ndown at the ground trying to keep moving.\n\nMaurice gasps harder now, his eyes stinging with drops of\nsweat falling from his brow.  People in the crowd cover their\nmouths in shock as they get a clear view of him... His shirt\nsoaked on one side with blood, his entire body shaking with\npain, and exhaustion, his face hollow and pale -- ghostly.\n\nMaurice stops in his tracks.  He looks up at a wooden sign,\nworn from the years of salt water air.  The sign reads:\n\n                \"PACIFICA BEACH - 1/2 MILE\"\n\nMaurice's thoughts fade away from this place, this time...\n\n                                                  CUT TO:\n\nEXT.  PHILADELPHIA - FIFTEEN YEARS AGO - NIGHT (FLASHBACK)\n\nWE ARE IN THE PARKER BEDROOM.  The lights are off.  The\nMOONLIGHT FROM THE WINDOWS BLANKETS Young Maurice and Young\nEllen as they lay in bed.  Ellen is cradled in Maurice's\narms.  She is awake and watching the shadows dance on the\nceiling.  She speaks in whispers.\n\n                    ELLEN\n          What do you think heaven is like?\n\nMaurice opens his eyes and stares at his beautiful wife.\n\n                    MAURICE\n          I don't know.\n\n                    ELLEN\n          I think it's a different place for\n          each person.\n\n                    MAURICE\n          Did you have a dream?\n\nBeat.\n\n                    ELLEN\n          I know where my heaven is.\n\n                    MAURICE\n          Where?\n\n                    ELLEN\n          Pacifica, California.\n\nMaurice chuckles.\n\n                    MAURICE\n          Why there?\n\n                    ELLEN\n          When I was ten, my family lived in\n          Pacifica for a year.  I used to go\n          to the beach everyday that summer.\n          I never felt so happy, carefree.\n          It was a magic place for me...\n          That's where my heaven will be.\n\nBeat.\n\n                    ELLEN\n          Maurice?\n\n                    MAURICE\n          Yes.\n\n                    ELLEN\n          If I die, you'll know where to look\n          for me?\n\n                    MAURICE\n          Go to sleep Ellen.\n\n                    ELLEN\n          No really, if God takes us away\n          from each other, you know where to\n          look now?\n\nBeat.\n\n                    MAURICE\n              (pacifying her)\n          The beach of Pacifica, California.\n\n                    ELLEN\n          Good.\n\nBeat.\n\n                    MAURICE\n          Go to sleep Ellen.\n\nEllen smiles as she cradles deeper into Maurice's arms.\nHusband and wife fall asleep together.\n\n                                                  CUT TO:\n\nEXT.  PACIFICA BEACH SIGN - DAY (PRESENT)\n\nMaurice snaps back to the present, the PAIN AND COMMOTION\ncome back in a tidal wave of reality.\n\nMaurice wipes the tears in his eyes and tries to take a step.\nSomeone blocks his way.\n\n                    ADELLE\n          Uncle Maurice, please, we have to\n          get you to a hospital.\n\nAdelle looks at her wounded Uncle sadly.  She touches his\nshirt and her hand comes away with blood.\n\n                    MAURICE\n          I have to finish first.\n\n                    ADELLE\n          I won't let you die.\n\nThe inner circle of people bursts open, as KRIS BREAKS\nTHROUGH.\n\n                    KRIS\n          Let him finish Adelle.  He's almost\n          there.\n\n                    ADELLE\n              (yelling)\n          He's almost dead.  Can't you see\n          that!  This has nothing to do with\n          you.\n\nMaurice touches Adelle's cheek turning her attention back to\nhim.  He barely manages to get the words out.\n\n                    MAURICE\n          It has nothing to do with you\n          either... This is between Ellen and\n          me.\n\nBeat.  Maurice begins crying uncontrollably.\n\n                    MAURICE\n          I'm begging you...\n\nMaurice takes her hand and bends down putting his forehead to\nher hand as if getting blessings from her.\n\n                    MAURICE\n          Let me do this for Ellen, let me do\n          this for my wife.\n\nAdelle's heart is breaking.  She weeps openly as she\nstraightens her Uncle to an upright position.  She wipes the\ntears from his eyes with her hand gently.\n\nAT THAT MOMENT THE INNER CIRCLE BREAKS OPEN AS TWO OFFICERS\nRUSH IN.  They reach for Maurice.\n\n                    ADELLE\n          Touch him, and they'll be a riot...\n\nAdelle stands firm, the strength in her growing with each\nsecond.\n\n                    ADELLE\n          ... and I'll start it.\n\nThe officers are taken off guard.  They look around at the\ncountless sea of eyes on them.  Adelle sees they won't do\nanything and moves to Maurice's side.\n\nMaurice begins to walk again.  Adelle to one side, Kris to\nthe other and thousands of people following in step.\n\n                                                  CUT TO:\n\nEXT.  BEACH FRONT - DAY\n\nThe wave of people led by Maurice walk toward the beach.  The\nbeach is blocked off by barricades all along it's perimeter.\nPolice officers stand every ten feet along it's edge.\n\nA young officer watches fearfully as the ocean of people move\ntowards him.  OFFICER GANTZ TALKS INTO HIS WALKIE-TALKIE.\n\n                    GANTZ\n          He's coming.  What should I do?\n\n                                                  CUT TO:\n\nSERGEANT EMORY\n\nat the other end of the beach barricade, holding back\nhundreds of people trying to get to the beach.  Emory holds\nhis walkie-talkie and looks around at the sea of anxious\nfaces.  He makes eye contact with a woman in tears.\n\n                                                  CUT TO:\n\nOFFICER GANTZ\n\nclicking off his walkie-talkie as the crowd presses up to the\nbarricade.  Officer Gantz is in awe as Maurice appears from\nthe crowd -- looking like a ghost of war... a holy\napparition.  Maurice works his way painfully to Gantz.\n\nGantz looks into Maurice's pleading eyes.  Maurice tries to\nsay something, but nothing can come out...\n\nGantz turns away from Maurice and picks up one of the\nbarricades.  He makes an opening about three feet wide.\nGantz turns back to Maurice, stands at attention, and steps\naside.\n\n                    GANTZ\n              (with unspeakable\n               admiration)\n          Watch your step Mr. Parker.\n\nAdelle and Kris watch in amazement as Maurice TAKES HIS FIRST\nSTEP ONTO THE SAND.\n\n                                                  CUT TO:\n\nEXT.  BEACH - DAY\n\nAn empty beach.  ALL SOUND AND CHAOS DISAPPEARS.  THE GENTLE\nHISS OF THE OCEAN FILLS THE AIR.\n\nThe last fifty yards...\n\nThe steps in the sand, heavy, torturous.  Each step, a step\ncloser to her...\n\nMaurice picks up the pace.  His numb feet making prints in\nthe sand.  His lungs on fire...\n\nTwenty feet left... Ten... Five...\n\nThe COOL WATER engulfs his feet and ankles.  Maurice falls to\nhis knees like a man falling before God.\n\nKneeling in the water, Maurice raises his hands to his eyes.\nThe water spills between his fingers... clear, pure, magical.\n\nMaurice GASPS hard as he falls onto his back.  The water\ncomes in and washes over him... Gasping harder... He's\nstaring into the sky... Another wave of ocean gently blankets\nhim... Gasp... He spots something above him, fluttering...\nhis vision BLURS... WHITE FLUTTERING... SLOW-MOTION.  THE\nIMAGE CLEARS... Maurice smiles as he makes out the image of a\nWHITE DOVE FLYING ABOVE HIM...\n\nMaurice takes a short breath, very short.  His body goes\nstill -- his eyes stay fixes at one point... No more pain, no\nmore loss, no more words...\n\nThe water washes over Maurice A. Parker...\nOver his lifeless body...\nAnd over his smile...\n\n                                           FADE TO BLACK.\n\n\n\n\n\n\nLabor of Love\nWriters :   M. Night Shyamalan\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:28:54.783841"}