{"title": "Labyrinth", "film_link": "/Movie Scripts/Labyrinth Script.html", "script_link": "/scripts/Labyrinth.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Labyrinth Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Labyrinth Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (8.58 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Dennis Lee\" title=\"Scripts by Dennis Lee\">Dennis Lee</a><br/>  <a href=\"/writer.php?w=Jim Henson\" title=\"Scripts by Jim Henson\">Jim Henson</a><br/>  <a href=\"/writer.php?w=Terry Jones\" title=\"Scripts by Terry Jones\">Terry Jones</a><br/>  <a href=\"/writer.php?w=Elaine May\" title=\"Scripts by Elaine May\">Elaine May</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Family\" title=\"Family Scripts\">Family</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Musical\" title=\"Musical Scripts\">Musical</a><br/><br/>\n<b>Script Date</b> :  1986<br/>\n<br/>\n<a href=\"/scripts/Labyrinth.html\">Read \"Labyrinth\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n<b>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n</b>\n<b>                          L A B Y R I N T H\n</b>\n                                  by\n                            Laura Phillips\n                                 and\n                             Terry Jones\n\n                                Story\n                                  by\n                              Dennis Lee\n\n     Early movie script scanned in by Cruiser One on Dec 28, 1996\n\n      Reformatted by Zelos, 16-Apr. 2004\n<b>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n</b>\n<b>FADE IN ON:\n</b>\n<b>1\tEXT: SKY - DAY\n</b>\nA WHITE BIRD soaring. The sky is a glorious explosion of blue and\nmauve and lavender. The setting sun washes the clouds with a delicate\npink tint. The bird swoops and spirals and we are right there with\nhim. Then suddenly, below us, an extraordinary sight appears.\n\n<b>2\tEXT: LABYRINTH - DAY\n</b>\nIt is the labyrinth, an enormous maze of incredible mandala like\nintricacy. From our magnificent vantage point, WE ARE BARELY ABLE TO\nMAKE OUT its details: the twisting walls interrupted here and there\nby lush forest, the complex web of waterways, the forbidding castle\nat the core. It is vast and magical, frightening and compelling at\nthe same time. We would love to linger, perhaps fly lower and get a\nbetter look at this wondrous place, but the bird flies on\n\n<b>3\tEXT: GLADE - DAY\n</b>\nIt is an idyllic setting, warm and inviting. The late afternoon sun\nwashes everything with a pink glow. Between the water and a line of\nlush fruit trees is a flower-strewn glade. A FIGURE emerges from the\ntrees and walks toward the water. It is a YOUNG WOMAN dressed in a\nflowing white dress that swirls around her in the breeze. The pink\nlight burnishes her hair and causes a gold circlet she wears on her\nhead to glow. She is breathtaking, a vision of innocence and grace.\nShe stops to pick a flower and then turns suddenly as if she has\nheard something.\n\nGIRL: Is it you?\n\nShe takes a few hurried steps and then stops, smiling shyly\n\nGIRL: Your Highness!\n\nThe GIRL curtsies deeply and then looks up through lowered lashes,\nthe shy smile still dancing on her lips. And then WE PULL BACK TO\nREVEAL a crown perched on a head of tight curls. WE ARE LOOKING\nTHROUGH the crown at the girl as she rises slowly, then looks boldly\nat the PRINCE.\n\nGIRL: Do not be swayed by my pleasure at the sight of you, my lord.\nFor though my father, the Duke, has promised you my hand, I cannot\nconsent to be yours until the evil that stalks our land from highest\nhill to deepest dale is ...\n\nSuddenly the GIRL stops speaking, a look of stunned confusion on her\nface.\n\nGIRL: ... from highest hill to deepest dale ... (her brow furrows in\nconcentration and then) Damn!\n\nShe burrows one hand into the deep sleeve of her gown and pulls out a\nrolled-up soft-cover book. She rifles through the pages.\n\nThe PRINCE is not a prince at all, but a SHEEPDOG wearing a tin foil\ncrown. He thinks his work is over and it's time to play and he lunges\nhappily towards the GIRL who isn't a princess or even a duchess, but\n15-year-old SARAH.\n\nSARAH is knocked over by the playful DOG. Beneath the gown which WE\nCAN NOW SEE is homemade and not very grand at all, WE SEE faded jeans\nand running shoes.\n\nSARAH: Get off me, you monster!!\n\nThe DOG grabs the book out of her hand and runs away with it, hoping\nto be chased. SARAH doesn't follow, she just sits up and pulls the\ngrass out of her tangled hair and sighs with frustration. The DOG\ncomes back over to SARAH, its tail wagging hopefully.\n\nSARAH: If you value your mangy life, Merlin, you'll hand it over.\n\nThe DOG obediently drops the book.\n\n<b>THE BOOK\n</b>\nOn the cover it says, _MEANDER'S QUEEN a play in three acts by Robin\nZakar_. SARAH reaches for it and we hear a clock tower begin to chime.\n\nSARAH leaps to her feet.\n\nSARAH: Oh no, Merlin! We're really late! Why does everything have to\nhappen to me!!!?\n\nMERLIN prances around her happily, his foil crown in his mouth. SARAH\npulls it out of his mouth and throws it in a nearby trash basket. He\nrushes after it and peers into the basket, wanting to fetch.\n\nSARAH: It's all your fault, you miserable mutt!!\n\nShe hikes up her dress and runs into the trees. MERLIN whimpers and\ntags along behind her.\n\n<b>4\tEXT: THE OTHER SIDE OF THE TREES - DAY\n</b>\nSARAH comes bursting through the trees and runs down a hill toward\nthe street. WE PULL BACK and WE CAN SEE an enormous steel mill on the\nother side of the river. And now WE NOTICE that the light isn't pink\nany more but sort of dull and hazy, and the idyllic glade is barely a\nsuburban park, and this is just an ordinary day in a very ordinary\nplace.\n\n<b>5\tEXT: AN OLD RAMBLING HOUSE - DUSK\n</b>\nSARAH runs up a path to an older, rambling house. She goes through\nthe front door, MERLIN hot on her heels, and neither one of them sees\nthe beautiful SNOW-WHITE BIRD that lands in a tree beside the path.\n\n<b>6\tINT: INSIDE THE ROUSE - EVENING\n</b>\nSARAH bursts through the front door and makes a beeline for the\nstairs. She almost makes it. SARAH'S MOTHER appears in the hallway.\n\nMOTHER: _Sarah_, where have you been?!!!\n\nSARAH abruptly stops and changes to an elegantly graceful ascension\nof the stairs.\n\nSARAH (in an affected voice): I can't talk to you now. I'm in\nrehearsal.\n\nShe continues grandly on and heads for her room.\n\nMOTHER: You were supposed to be home an hour ago to baby-sit for\nFreddie! Don't we at least deserve an explanation?\n\nSARAH stops and leans over the railing. She speaks with a\nmelodramatic solemnity.\n\nSARAH: As Meander's Queen, I've been ... meandering. Dither me not\nabout explanations.\n\nWith that she turns and heads for her room. On the door is a sign\nthat says: \"Admittance by Invitation Only.\" SARAH'S FATHER comes into\nthe hall.\n\nFATHER: What's that all about?\n\nMOTHER: It's a part in a play, (raising her voice) but that's no\nreason to...\n\nSARAH turns in her doorway. She calls down.\n\nSARAH: Chasten not your Queen, _Peasant_!\n\nShe dramatically sweeps into her room.\n\n<b>7\tINT: SARAH'S ROOM - NIGHT\n</b>\nSARAH slams the door and leans against it, playing the scene.\n\nFATHER (VO): _Sarah_, that's no way to talk to your mother!\n\nSARAH (mumbles to herself): She's not my mother.\n\nSARAH takes a deep breath and closes her eyes. She can hear footsteps\nand SOMEONE comes to the other side of the door.\n\nSARAH ignores her STEPMOTHER and kicks off her running shoes.\n\nWith a practiced gesture SARAH removes her jeans while leaving her\ngown in place.\n\nSTEPMOTHER (VO): _Sarah_, when I tell you to be home at five, I\nexpect you to be home at five.\n\nSARAH quickly shifts to her STEPMOTHER's attitude -- hands on hips,\nand silently mimes her words.\n\nSARAH: Yes, Madame!\n\n<b>7A\tINT: UPSTAIRS HALLWAY\n</b>\nSTEPMOTHER: And don't \"Yes Madame\" me!\n\nFATHER: Is she all right?\n\nSTEPMOTHER (frustrated): Of course she's all right! I left the\nBernsteins' number on the kitchen table ... Freddie might be coming\ndown with a cold so call us if he seems even the least bit\nuncomfortable ...\n\nSARAH (VO) (sighs): Yes, Mother.\n\nSTEPMOTHER: Oh! I give up!\n\nShe hurries down the stairs.\n\nFATHER: We'll see you later, baby. And remember ...\n\n<b>7B\tINT: SARAH'S ROOM - NIGHT\n</b>\nSARAH speaks along with him, mimicking.\n\nSARAH &amp; FATHER (VO): Don't open the door to strangers.\n\nWe hear him leave. SARAH waits a beat and then turns and opens her\nbedroom door.\n\nSARAH: And don't call me baby! (she slams the door shut; mimicking\nher parents) Precious little Freddie might be coming down with a cold\n<b>...\n</b>\nShe sighs and looks around. This is really her world, her retreat,\nand she knows and controls every inch of it. The shelves are filled\nwith an orderly array of childhood dolls and toys. The books are\nlined up neatly in the bookcase and if we could see them up close we\nwould see that they were placed in alphabetical order -- and\naccording to the year they were acquired. She walks over to her\ndresser. She checks herself out in the mirror above the chest of\ndrawers and adjusts the golden circlet which has been knocked askew\nby her run. She then stops for a moment and looks at the photographs\non the dresser. One of her FATHER, her MOTHER and herself as a LITTLE\nGIRL. Another picture of her MOTHER in a newspaper clipping is taped\nto the mirror. The headline says, \"Linda Williams a Smash in New\nPlay.\" A cover of a Playbill is also tacked on to the mirror. It says\n_Best of Both Worlds_ starring Linda Williams. SARAH then reverently\nopens a music box -- the kind with a twirling dancer inside -- and to\nthe strains of an unbearably tinny version of \"Greensleeves\" she\nbegins to rehearse.\n\nSARAH: Do not be swayed by my pleasure at the sight of you, my Lord\n<b>...\n</b>\nSuddenly, something stops her cold.\n\nSARAH (yelling angrily): Someone has been in my room!\n\nThrough the mirror WE SEE what she sees: an empty space on one of the\nshelves. She swirls around and rushes out the door.\n\n<b>8\tINT: THE HALLWAY - NIGHT\n</b>\nSARAH bursts out of her room.\n\nSARAH: Where's Lancelot?\n\nShe stomps down the hallway.\n\nSARAH: Where's my bear?!!\n\n<b>9\tINT: NURSERY - NIGHT\n</b>\nSARAH enters FREDDIE's room. She searches the nursery.\n\nSARAH: Nobody listens to a thing I say.\n\nShe opens a toy box and rifles through it.\n\nSARAH: How many times have I told them to stay out of my room ...\n\nShe gets to the crib and looks down. FREDDIE is wide awake, gurgling\nat Lancelot, SARAH's tattered old teddy bear.\n\nSARAH: And you, you can just give me back my bear!\n\nShe yanks it out of the crib and leaves. FREDDIE looks hurt and his\nface starts to cloud up.\n\n<b>10\tINT: SARAH 'S ROOM - NIGHT\n</b>\nSARAH is curled up on her bed, cuddling her bear. MERLIN sits beside\nher. She looks at the DOG.\n\nSARAH: You're the only one who understands me, Merlin.\n\nHe licks her face. She gets up and holds the bear out in front of her.\n\nSARAH: Do not be swayed by my pleasure at the sight of you, my lord\n<b>...\n</b>\nShe is interrupted by FREDDIE's cries.\n\nSARAH: Go to sleep, Freddie!\n\nThe cries get louder. SARAH sighs and repeats her favorite litany.\n\nSARAH: Why does everything have to happen to me?\n\n<b>11\tINT: NURSERY - NIGHT\n</b>\nSARAH enters and approaches the howling INFANT.\n\nSARAH: I don't need this.\n\nShe pulls the blanket up over him and attempts to tuck him in.\n\nSARAH: There, isn't that nice ...\n\nBut FREDDIE doesn't think so. He pushes the blanket off and howls\neven louder. SARAH sees one of his toys on the floor and picks it up\nand gives it to him. She speaks through gritted teeth.\n\nSARAH: Want your nice toy?\n\nBut FREDDIE doesn't. He flings the toy across the room. SARAH bends\nover the crib and speaks softly.\n\nSARAH: You know, Freddie, I heard that the only thing to do with a\nbaby who won't stop crying is to get some goblins to come over and\nteach him a lesson ...\n\nFREDDIE lowers his screams to a whimper, but a loud whimper.\n\nSARAH: How would you like that, kid? A nasty evil goblin ...\n\nFREDDIE is quiet for a moment, almost as if he is considering. Then\nhe really howls. SARAH sighs and picks him up. She begins to pace\nback and forth, and starts to hum. FREDDIE goes back to a mere\nwhimper.\n\nSARAH: Oh, you like that, do you?\n\nShe begins to hum even louder and more melodically as she places the\nBABY back into the crib. She then begins one of the moat macabre\nlullabies you could ever imagine. She sings of how scary the dark is,\nhow \"the shadows on the wall like to eat you when you're small\" and\nhow \"a baby doesn't stand a chance when the Goblins start their\ndance.\" She throws herself into her performance; adding to it a wild\ndance that has her whirling around the room, leaping into the air,\nmaking strange shadows on the wall. Finally, the dance ends when too\nmany crazed pirouettes result in her stumbling against FREDDIE's\ndresser. She staggers a bit and then the lights blink as a crack of\nthunder is heard, followed by a flash of lightning.\n\n<b>ANOTHER ANGLE\n</b>\nLittle FREDDIE is wailing. He hasn't understood a thing that SARAH\nhas sung but he can sense that something is wrong.\n\nSARAH: Ah, c'mon, Freddie. It was just a song.\n\nThey are interrupted by the sound of the doorbell. SARAH reacts with\na gasp of surprise. FREDDIE, for some inexplicable reason, is\nsuddenly quiet.\n\n<b>12\tINT: FOYER - NIGHT\n</b>\nSARAH approaches the front door with some trepidation. She starts to\nopen it, then realizes what she is doing. She fastens the chain and\nonly then opens the door.\n\n<b>13\tEXT: HOUSE - NIGHT\n</b><b>SARAH'S POV\n</b>\nThrough the door opening SARAH can see a very elegantly dressed,\nquite good-looking MAN of an indeterminate age. He has a worldly air,\nor is it other-worldly? Before he can speak a flash of lightning\nilluminates his face. He is a mesmerizing sight and SARAH can't help\nbut gawk.\n\nMAN: Excuse me, is this the home of Sarah Williams ... Sarah\nWilliams, the actress?\n\nSARAH's jaw drops.\n\nSARAH: That's me.\n\nMAN: Allow me to introduce myself ... (he holds out his hand) I'm\nRobin Zaker.\n\nSARAH squeals with delight.\n\nSARAH: You wrote the play!\n\nHe smiles.\n\nSARAH: Just a second.\n\n<b>14\tINT: FOYER - NIGHT\n</b>\nSARAH's hand hesitates over the chain for just a moment, and then she\nunfastens it and opens the door. ZAKAR enters and extends his hand.\n\nZAKAR: It is an honour, Miss Williams. I understand you make a\ndelightful Queen Meander.\n\nSARAH: Well, we've just started rehearsal, but how did you know?\n\nZAKAR: I was passing through this part of the country and heard that\nit was going to be done here. This is the first amateur production of\nthe play, which of course is delightful for me.\n\nSARAH: You know we were supposed to open tonight, but we got delayed.\nThe firemen had to use the hall.\n\nZAKAR: Yes, I know, that's why I wanted to stop by to see you.\n\nThey are interrupted by a particularly loud crash from upstairs. And\nthen FREDDIE begins to howl.\n\nSARAH: That's my brother ...\n\nThere is another crash and SARAH starts up the stairs.\n\nSARAH: I'll be right back!\n\nZAKAR watches her run up the stairs. He glances around and then walks\nright to the liquor cabinet and takes out a bottle.\n\n<b>15\tINT: NURSERY - NIGHT\n</b>\nFREDDIE in standing in his crib crying his eyes out. SARAH rushes in\nand sees that the storm has blown open the basement window and it is\ncrashing against the wall. She rushes to close it. FREDDIE's screams\nare piteous.\n\nSARAH: Oh, Freddie ...\n\nThere is more thunder, and then lightning flashes across the darkened\nroom.\n\nZAKAR (VO): Perhaps I can soothe him ...\n\nSARAH gasps and whirls around. ZAKAR is framed in the doorway. He has\na drink in his hand. SARAH holds the BABY close.\n\nSARAH: You shouldn't be up here!\n\nZAKAR (smoothly): I just wanted to help ...\n\nSARAH rushes by him, still clutching the BABY.\n\n<b>16\tINT: HALLWAY - NIGHT\n</b>\nSARAH comes out of the nursery and hurries down the stairs. ZAKAR\nfollows. FREDDIE is still crying.\n\nSARAH: Maybe you'd better leave ...\n\nShe gets to the bottom of the stairs. FREDDIE whimpers. ZAKAR is\nmaking her very nervous.\n\nSARAH: ... I, uh, don't think I care to talk to you about the play.\n\nHe is right behind her, almost too close.\n\nZAKAR: Neither do I.\n\nSARAH is shocked and disturbed by this.\n\nSARAH: What!\n\nZAKAR reaches over and smoothes FREDDIE's hair.\n\nZAKAR: I'm more concerned about the baby, of course.\n\nSARAH pulls FREDDIE out of his reach.\n\nSARAH: Freddie's just fine.\n\nBut he isn't. He's still crying. ZAKAR reaches into his pocket and\npulls out a coin. Be runs it over his fingers right in front of\nFREDDIE's face. The BABY stops crying.\n\nZAKAR: There, isn't that better?\n\nSARAH (nervously): Uh, sure ... but you really have to leave ...\n\nZAKAR ignores her and heads into the living room.\n\nZAKAR: I'm not just a playwright, as you can see ... bring him in\nhere and I'll do some other tricks for him ...\n\nSARAH: No! You've got to ...\n\nBut he is already in the living room. She follows, still holding the\n<b>BABY.\n</b>\n<b>17\tINT: LIVING ROOM - NIGHT\n</b>\nZAKAR is sitting on the sofa, looking very comfortable. SARAH stands\nin the doorway, not sure what to do. Reluctantly, she goes and sits\ndown across from him.\n\nZAKAR: Now watch this, Freddie ...\n\nHe reaches into his breast pocket and tugs on the handkerchief there.\nIt comes out followed by many others, all different colours. SARAH\nrolls her eyes. This is not that exciting a trick. FREDDIE isn't\nimpressed, either. In fact he starts to cry again.\n\nZAKAR: So you're going to be like that, are you, Freddie? Well, you\nknow what that means?\n\nHe leans across the table and SARAH pulls the BABY closer.\n\nZAKAR: It's time to call the goblins!\n\nSARAH: What?!!\n\nSARAH is surprised to hear this, to say the least. It echoes her\nsilly threat to FREDDIE earlier.\n\nZAKAR: Yes. That's what we do with bad babies ... we send for the\ngoblins!!\n\nAnd with that he reaches into yet another pocket and pulls out a\npoorly made, very silly-looking goblin hand puppet. SARAH laughs\nwith relief. ZAKAR, his hand in the puppet, talks in a high-pitched,\nunconvincing goblin voice.\n\nZAKAR: You like goblins, don't'cha, Freddie? (singsong) but I bet\nyour sister doesn't ...\n\nSARAH rolls her eyes at this, and then gasps. Because for one very\nstrange moment, the puppet keeps bouncing, but both of ZAKAR's hands\nare visible! And then the puppet seems to move away from the table,\nand disappear! FREDDIE claps his hands with delight. SARAH jumps out\nof her chair.\n\nSARAH: Where is it?!!!\n\nZAKAR points to a large cabinet against the wall.\n\nZAKAR: It's in there.\n\nSARAH: Impossible!\n\nZAKAR: See for yourself.\n\nSARAH hesitates for a moment, and then places FREDDIE carefully on\nthe rug. She then marches over to the cabinet and throws open the\ndoor.\n\n<b>ANOTHER ANGLE\n</b>\nthe puppet, grinning wildly from inside the cabinet.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH gasps and involuntarily slams the door. She whirls around to\nface ZAKAR.\n\nSARAH: How did you do that?!!\n\nZAKAR leans back into the sofa.\n\nZAKAR: Magic.\n\nSARAH: Oh sure ...\n\nShe nods, skeptically. She can't see -- but WE CAN DEFINITELY SEE --\nthe cabinet door slowly open behind her, and out of it comes a tiny,\nfierce-looking GOBLIN! This is not a puppet, but a living creature\nthat moves quickly out of sight with an exaggerated tiptoe. SARAH is\nbusy with another problem. She doesn't see FREDDIE!\n\nSARAH: Where's Freddie?!!\n\nZAKAR shrugs. In a panic, SARAH begins to look around this room. She\ncalls for FREDDIE and, as she passes in front of the living room\ndoorway, WE CAN SEE something scurry across the hallway. SARAH stops\nand listens.\n\nSARAH: Freddie?\n\nBut it wasn't a BABY she heard. Behind her there is more scurrying as\nCREATURES begin to appear from various parts of the room. We hear\nfaint snickering. She turns to ZAKAR, terrified.\n\nSARAH: Where is he?!!\n\nZAKAR points to the chair SARAH was sitting in. She is behind the\nchair and can't see anything. But when she comes around in front of\nit she sees FREDDIE comfortably ensconced in the cushions. And he's\nplaying with the goblin puppet! SARAH reaches over and grabs the\npuppet out of his hands. She flings it across the room and scoops up\nthe BABY.\n\nSARAH: Who are you?!!!\n\nZAKAR throws back his head and laughs, then suddenly leaps off the\nsofa and lands very close to her.\n\nZAKAR: I've been known by many names ... but the one I prefer is\n_Jareth, King of the Goblins_!!!\n\nSARAH holds FREDDIE close and backs away.\n\nSARAH: I don't believe this!\n\nAmidst thunder and lightning JARETH flings his arms up into the air,\nand he is suddenly dressed in strange, medieval garb, a cloak\nswirling around him. And what's worse, much, much worse, is that\nsuddenly GOBLINS are everywhere! Popping out of drawers, from under\nchairs, swinging off the chandeliers. SARAH turns and runs out of the\nroom.\n\n<b>18\tINT: FOYER - NIGHT\n</b>\nIt's worse in here! The GOBLINS are pouring down the stairs, SOME\nslide down the bannister! SARAH tries running into another room, but\nis soon back, followed by a DOZEN MORE! She barely makes it to the\nfront door and struggles to open it with the BABY in her arms. The\nGOBLINS pull her back and laugh wildly. They fling her right into\nJARETH's arms. He scoops FREDDIE up and whirls away from her. SARAH\ntries to grab the BABY back but the GOBLINS get between them.\n\nSARAH (hysterical): Give him back, you monster! Give him back!\n\nJARETH only laughs and starts to swirl gracefully. FREDDIE laughs\nwith delight and SARAH struggles to reach him. With a superhuman\neffort she pushes through the MASS OF CREATURES and grabs onto\nJARETH's fluttering cloak. It's like being caught up in a whirlwind\nof incredible force.\n\nSARAH (screaming): I ... won't ... let ... you ... take ... him!\n\nBut it's too late. SARAH's feet leave the ground and she is pulled\nwith them and the whole MASS OF GOBLINS. JARETH and FREDDIE swirl up\nthrough where the ceiling would have been, up into the blackness.\nThere's a QUICK MONTAGE OF SHOTS: JARETH's laughing face; SARAH,\ndesperate as her fingers are losing their grip; FREDDIE, who's having\na great time; GOBLINS, ALL gleeful; then -- JARETH's garment pulls\nout of SARAH's grip. She falls OUT OF FRAME, a silent scream on her\nface.\n\n<b>19\tEXT: LABYRINTH - DAY\n</b><b>A WIDE PEACEFUL SHOT\n</b>\nThe sky is pink, and the WHITE BIRD swoops by us as WE TILT DOWN TO\nSEE the exterior wall of the labyrinth. It is a high masonry wall\nthat extends off in either direction. Along the wall are various\nornamental bushes and there is a small figure of a dwarf, his back to\nus, peeing into a tiny pond. It looks for all the world like one of\nthose ornamental garden sculptures. But it isn't. This is HOGGLE. In\na CLOSER SHOT, which is quite discreet, HOGGLE finishes peeing, and\ngoes over to a particularly lush shrub. A few butterfly-like\ncreatures, flower fairies, flit around the bushes.\n\nHOGGLE: An' how's me pride an' joy!\n\nHe leans forward to sniff one of the magnificent blossoms, sighing\nwith pleasure as he does. But before he can indulge he is stopped by\nthe whistling sound of a falling object. SARAH falls from the sky and\nlands right on his prize shrub! Incensed, he screams with fury.\n\nHOGGLE: What is this? Look what you done! You murderer!\n\nSARAH struggles out of the broken shrub.\n\nSARAH: What are you saying, you horrible little man?!\n\nHOGGLE: I ain't horrible, I'm _Hoggle_. And just look! You've\ndestroyed me prize blossoms!\n\nHe realizes the extent of the damage to his prize specimen.\n\nHOGGLE: I'll get ya for it, you big oaf!\n\nAnd he picks up a spray can and goes after SARAH. But she's had\nenough. After the nightmarish kidnapping of FREDDIE and a drop from\nthe deepest space, this guy is child's play. She reaches out and\npulls the can from HOGGLE's hands. She then grabs him by the\nshirt-front and practically lifts him off the ground.\n\nSARAH: Oh no you don't! If anyone's getting anything around here,\nit's me ... now where' my brother?!!\n\nHOGGLE: I ain't sayin' nothin' 'til ye let me go!\n\nSARAH sighs and lets go.\n\nSARAH: I'm sorry. But this just hasn't been my day.\n\nHOGGLE looks at his crushed shrub again.\n\nHOGGLE: Ye ain't the only one.\n\nSARAH ignores him and stares at the massive wall behind them.\n\nSARAH: And I don't understand any of this!\n\nHOGGLE shakes his head and sighs.\n\nHOGGLE: Now where have I heard that before.\n\nSARAH: What do you mean?\n\nHOGGLE: I mean, everyone who comes here thinkin' they can make it\nthrough the labyrinth says sumthin' like (mimicking Sarah in a whiny,\nhigh pitch) ... I don't understand this, whatever am I doing here,\nhow will I ever get home ...\n\nSARAH: What makes you think I'm here to get through a labyrinth?\n\nHOGGLE shakes his head again.\n\nHOGGLE: Can't think of any reason why you'd be standin' here in front\no' this gate if you weren't.\n\nSARAH doesn't understand what he is talking about but when she looks\nup she can't believe her eyes.\n\n<b>ANOTHER ANGLE\n</b>\nA huge gate where just a moment ago there nothing but smooth, endless\nwall. SARAH gulps in disbelief. Then the huge wooden doors fly open\nand a terrified CREATURE runs out, full speed, screaming for his\nlife. Right behind him come TWO MENACING GOBLINS riding on strange\nBEASTS. They are armed and dangerous looking. They quickly catch up\nwith the CREATURE and drag him, screaming piteously, back through the\ngate. Before the gates close SARAH can see MORE GOBLINS, what seems\nlike hundreds of them. SOME are mounted, MOST of them are armed. And\nbeyond them a walled passageway seems to go on forever. Then the\nwooden doors slam shut.\n\nSARAH: Oh, no! Not more goblins!\n\nHOGGLE: That's Jareth's goblin army, and that other poor fool musta\nbeen caught meanderin' where he had no business.\n\nSARAH: What will they do to him?\n\nHOGGLE: I don't like to think about things like that.\n\nSARAH shudders.\n\nSARAH: I wonder if things can get any worse?\n\nHOGGLE sighs knowingly.\n\nHOGGLE: He's taken sumthin' o' yours, ain't he?\n\nSARAH is clearly surprised.\n\nHOGGLE: Jareth, our high an' mighty king ...\n\nSARAH nods, excited that someone has a grasp of the situation.\n\nHOGGLE: Bet he's gone and taken sumthin' you love.\n\nSARAH (shrugging): Close. He's got my baby brother.\n\nHOGGLE laughs derisively.\n\nHOGGLE: Baby snatchin'! That's low.\n\nSARAH: So I've just got to do something!\n\nHOGGLE: Like what?\n\nSARAH: Get Freddie back, of course!\n\nHOGGLE: Then ya'd have ta make it through the labyrinth, 'cause\nJareth's castle is at its very center.\n\nSARAH looks at the gates and gulps.\n\nSARAH: Is it difficult?\n\nHOGGLE snorts with derision.\n\nHOGGLE: Is me prize shrub crushed into oblivion?\n\nSARAH is reaching the breaking point.\n\nSARAH: Look, I'm sorry about your bush! But it's not like I asked to\nhave some weirdo come and take my baby brother and then drop me out\nof the sky!\n\nHOGGLE: Well, I didn't ask for some overgrown flower fairy to drop on\nme prized possession, neither!\n\nSARAH: Oh, this is ridiculous!\n\nAnd she stalks off to the gate, mumbling all the way.\n\nSARAH (to herself): ... standing here wasting time talking to some\nweird guy who should be living under a bridge ...\n\nShe is almost at the gate when she freezes with fear. Through the\ngate she can hear the cheers and jeers of the GOBLINS, and what might\nbe the wailing of their poor CAPTIVE. There's no way she wants to\nrisk facing that horrific CREW. HOGGLE has come up behind her and as\nshe backs away from the gate she bumps into him. She shrieks and\nwhirls around.\n\nHOGGLE: That ain't the only way in, ya know!\n\nSARAH is very relieved to hear this.\n\nSARAH: It's not?!\n\nHOGGLE: Course it ain't. There's many a route in ... just only one\nway out.\n\nSARAH: Well show me one! I've got to find my brother!\n\nHOGGLE sighs impatiently. Be fingers a belt that he wears, rattling\nit in an obvious manner. It in hung with every kind of watch and\nbracelet and ring you can imagine.\n\nHOGGLE: Information like that has a price ...\n\nSARAH, taken aback by the amount of loot he's acquired.\n\nSARAH: I could give you this ...\n\nShe takes the gold circlet off her head. HOGGLE isn't interested.\n\nHOGGLE: I had sumthin' o' this caliber in mind ...\n\nHe takes her hand and WE SEE that she is wearing a beautiful ruby\nring. SARAH shakes her head vehemently.\n\nSARAH: No. My mother gave me that.\n\nHOGGLE eyes it greedily.\n\nHOGGLE: She could give ya another ...\n\nSARAH: No, she couldn't. (sadness crosses her face suddenly) She\nlives real far away ...\n\nThe sadness disappears just as suddenly. She holds out the circlet.\n\nSARAH: This is all you get.\n\nHe grabs the circlet and bites it.\n\nHOGGLE: Bah! It's paste!\n\nSomething catches SARAH's eye. It is one of the tiny FLOWER FAIRIES.\nShe leans over for a better look.\n\nSARAH: No it's not, it's plastic.\n\nHOGGLE's eyes light up at that and he grunts with satisfaction as he\nstrings the circlet onto his belt. SARAH reaches out her hand to the\n<b>FAIRY.\n</b>\nSARAH: What a beautiful little thing ...\n\nHOGGLE reaches for the spray can.\n\nHOGGLE: Let me at it!\n\nSARAH is enraged.\n\nSARAH: You murderer! How can you kill such beautiful creatures?!!\n\nJust then the FAIRY gives SARAH a vicious bite. She shakes it off her\nhand and cries out in pain.\n\nSARAH: It bit me!\n\nHOGGLE quickly sprays the offending FAIRY and it falls to the earth,\nscreaming all the way.\n\nHOGGLE: Of course it bit ya! There's nuthin' more vicious than a\nflower fairy. Any fool knows that!\n\nSARAH sucks on her wounded hand and tries not to cry.\n\nHOGGLE (sighs): But you don't know nuthin', do ya?\n\nA tear trickles down SARAH's cheek. HOGGLE sighs.\n\nHOGGLE: I got a feelin' I'm gonna regret this. (he stalks off) Come\nwith me an' I'll show ya a way in.\n\nSARAH hurries after him. As they walk along the endless wall HOGGLE\nlooks at the circlet and polishes it on his sleeve.\n\nHOGGLE (thrilled): Plastic!\n\n<b>20\tEXT: LABYRINTH - DAY\n</b>\nAnother part of the wall. HOGGLE pushes a bush aside and shows SARAH\na tiny door. She looks at it dubiously.\n\nHOGGLE: This'll take ya into the maze, that's the first part of the\nlabyrinth ...\n\nSARAH: The first part! What comes after that?\n\nHOGGLE gets down on his knees and starts to crawl through the door.\n\nHOGGLE: Then there's the Garden Maze, then the Forbidden Forest ...\n\nSARAH: That sounds inviting ...\n\nHe is through the door. He is still talking but SARAH can't hear him.\nShe quickly tries to follow.\n\nSARAH: Wait! Wait! I can't hear you ...\n\n<b>21\tINT: LABYRINTH - DAY\n</b>\nHOGGLE is through the door.\n\nHOGGLE: ... then comes the castle ...\n\nSARAH's head appears.\n\nHOGGLE: ... that's surely where Jareth's keepin' the babe ...\n\nHe looks down at SARAH, she is through the door to her waist and\nstraining to get the rest of herself through. HOGGLE sighs and grabs\nher hand. With a groan he tugs on her and pulls her through the\ndoorway. She lands flat on her face.\n\nHOGGLE: Ya don't seem ta be able ta do nuthin' without my help, do ya?\n\nHe chuckles and SARAH gives him a look that could kill as she gets up\nand dusts herself off. She looks around and the environment seems\nrather benign. The brick walls are open to the sky, here and there a\nflower peeks through a crack.\n\nSARAH: Oh, I think I can handle it. In fact, this place doesn't seem\nso bad at all.\n\nAnd with that, she jauntily heads down the nearest corridor.\n\n<b>22\tINT: CORRIDOR 1 - DAY\n</b>\nSARAH turns a corner and comes face to face with a FACE. It is huge\nand grotesque and protrudes out of the wall.\n\nFACE: Go back! Go back before it's too late!\n\nSARAH screams and backs away from it, moving further down the\ncorridor. She backs into something and whirls around. It is ANOTHER\n<b>FACE.\n</b>\nFACE 2: Turn back while you still can!!\n\nSARAH turns and runs back the way she came.\n\nSARAH: Hoggle!\n\n<b>23\tINT: LABYRINTH - DAY\n</b>\nHOGGLE is still standing by the door, an amused smile on his face.\nSARAH comes rushing toward him.\n\nSARAH: Oh, I'm so glad you're still here! They were horrible ...\n\nHOGGLE: You don't mean the False Alarms, do ya?\n\nHe shakes his head and goes off in the direction that SARAH just came\nfrom.\n\nHOGGLE: If ya gonna let a little thing like them scare ya, Missy, ya\nhaven't a hope o' makin' it to the castle.\n\nSARAH quickly follows.\n\nSARAH: False Alarms?\n\n<b>24\tINT: CORRIDOR 1 - DAY\n</b>\nThe corridor of faces. HOGGLE enters and the FACES start in on their\nroutine. SARAH comes up behind him, shuddering at the ghastly sight.\n\nFACE 1: This is the path of no return!\n\nFACE 2: Beware! Beware!\n\nHOGGLE: Just ignore 'em.\n\nSARAH: Are you sure?\n\nHOGGLE sighs and turns to the NEXT FACE.\n\nFACE 3: Abandon all hope ...\n\nHOGGLE: Oh, shut up, will ya?\n\nSARAH is wide-eyed at HOGGLE's defiance.\n\nFACE 3: But I was just getting to the best part!\n\nHOGGLE: All right. But don't expect us to pay any attention.\n\nFACE 3 (winks at Sarah): You're going to love this ... Abandon all\nhope ye who enter here, for this is the road to destruction!!!\n\nHOGGLE (bored): Very nice ...\n\nSARAH is dumbstruck. HOGGLE takes her hand and yanks her along.\n\nFACE 3: Come back any time ... I mean, you're doomed, doomed!\n\n<b>25\tINT: CORRIDOR 2 - DAY\n</b>\nHOGGLE and SARAH continuing down a similar corridor.\n\nHOGGLE: Ya see, things aren't always what they appear to be around\nhere, Missy ...\n\nSARAH (shrugging): Whatever. All I'm interested in is getting my\nbrother back from that creep.\n\nShe starts to look around for something.\n\nHOGGLE: I admire yer determination, but it takes more'n that to beat\nJareth.\n\nSARAH picks up a rock.\n\nSARAH: Well, maybe I'm beginning to get the hang of this labyrinth\nbusiness.\n\nShe takes the rock and uses it to mark an X on the floor.\n\nSARAH: See, now I'll know which way we came in case I get lost.\n\nHOGGLE (sighs): Missy, goin' back the way ya came is par fer the\ncourse around here, what ya want to do is go forward.\n\nSARAH: Look, Hoggle! I've got to find Freddie and I don't need you to\ndiscourage me!\n\nHOGGLE: And I don't need to be wastin' me time goin' around in\ncircles with you!\n\nSARAH: That's fine with me! (she starts off) I know you're only after\nmy ring, anyway!\n\nShe turns a corner and HOGGLE looks after her, hurt and pity crossing\nhis face. He takes a few steps in her direction and an officious\nlittle creature, a BRICKKEEPER, emerges from the brickwork of the\nfloor, takes out the cobblestone that SARAH marked, and replaces it\nwith the marked side hidden. It looks up at HOGGLE.\n\nBRICKKEEPER: Some people got no respect for property!\n\nHOGGLE sticks his tongue out at the CREATURE just as it goes back\ninto its hole.\n\n<b>26\tEXT: AERIAL SHOT - DAY\n</b>\nThe WHITE BIRD flies over the maze and WE SEE SARAH marching along.\nShe thinks she's going forward but she's heading right for HOGGLE.\n\n<b>27\tINT: CORRIDOR 2 - DAY\n</b>\nSARAH emerges into the corridor and comes face to face with HOGGLE.\n\nSARAH: But ...\n\nShe whirls around to look behind her, then back at HOGGLE again.\n\nSARAH: ... but you were just behind me! I'm sure of it!\n\nHOGGLE shakes his head as she runs by him and looks down at the floor.\n\nSARAH: My mark! It was right here!\n\nHOGGLE comes up beside her.\n\nHOGGLE: I told ya, Missy. Things aren't what they appear to be around\nhere ...\n\nJARETH (VO): Except when they are.\n\n<b>ANOTHER ANGLE\n</b>\nJARETH, in all his glory. SARAH and HOGGLE whirl around and BOTH gasp\nwith surprise and fear.\n\nJARETH: We meet again ... Sarah.\n\nSARAH: Where's Freddie?!! What have you done with him!?\n\nShe starts to rush toward JARETH but HOGGLE holds her back.\n\nJARETH: Nothing ... yet.\n\nHe walks toward them and they automatically step backwards. He looks\ndown at HOGGLE.\n\nJARETH: And what have we here ... Hoghead, isn't it?\n\nHOGGLE is humiliated.\n\nHOGGLE: Me name's Hoggle.\n\nJARETH: Ah, yes. Now I remember. (he moves closer to Hoggle) You're\nthe greedy little coward who lives outside the gate. Shouldn't you be\nback there minding your own business ... Hedgehog?\n\nHe chucks HOGGLE under the chin, and is quite rough about it. HOGGLE\nfumes silently. SARAH doesn't like this.\n\nSARAH: Why, why don't you pick on someone your own size?\n\nHe looks her up and down.\n\nJARETH: Whom did you have in mind?\n\nSARAH tries to brazen it out.\n\nSARAH: I don't have time for any games. I want Freddie, and I want\nhim now!\n\nJARETH throws back his head and laughs.\n\nJARETH: Ah, Freddie. An adorable little imp. I'm really growing\nrather fond of him.\n\nSARAH: Where is he?!!\n\nJARETH: He's in my castle, and seems to be enjoying himself immensely.\n\nHe ambles toward them and they can't help themselves, they BOTH step\nbackwards.\n\nJARETH: In fact, he likes being with goblins so much, I'm considering\nturning him into one.\n\nSARAH thinks this is crazy.\n\nSARAH: You can't do that!\n\nJARETH (grinning): Oh yes I can.\n\nSARAH looks down at HOGGLE and speaks under her breath.\n\nSARAH: Can he?\n\nHOGGLE nods glumly.\n\nJARETH: But let's make it interesting. I won't do it for ... thirteen\nhours. If you make it to the castle before then you might be able to\nsave him. If not, well, I think little Freddie will mike an adorable\ngoblin prince, don't you?\n\nHe laughs and holds up both hands and WE SEE that they are empty. He\nthen closes them and when he opens them again there is a gold watch\nin one hand. He throws it to SARAH, but HOGGLE intercepts it and eyes\nit greedily. Annoyed, SARAH snatches it out of his hand. She looks at\nit and sees that it has 13 hours marked on it. When she looks up\nagain, JARETH is gone.\n\nWORM (VO): Well, good riddance to bad rubbish!\n\nSARAH and HOGGLE BOTH jump and then look at where the voice is coming\nfrom. It is a little WORM, poking its head out of a hole in the\nbrickwork.\n\nWORM: That's what the missus always says, she does. Why the last time\nshe found that one around here she sent him packing.\n\nSARAH: Jareth?!\n\nWORM: She don't take to his kind of nonsense, that's for sure. Now,\nhow about a nice cup of tea? The missus has a kettle on.\n\nSARAH looks down at HOGGLE, who shrugs. She then looks up at the WORM\nand gives him a beaming smile.\n\n<b>28\tINT: CORRIDOR 2 - DAY\n</b>\nSARAH and HOGGLE are sitting on the floor.\n\nSARAH: Do you think Jareth will give Freddie back if I make it on\ntime?\n\nHOGGLE: It's hard to say, Missy. But if I were you, I'd worry 'bout\nfirst things first.\n\nSARAH: What do you mean?\n\nHOGGLE: I means ya got ta find the castle before ya can go savin' the\nbabe and I mean ta see that ya do!\n\nSARAH is thrilled and leans over and gives him a kiss on the cheek.\n\nSARAH: Oh, Hoggle! Thank you, thank you so much!\n\nHOGGLE gets all flustered and tries to act gruff.\n\nHOGGLE: Seems to me I could be gettin' that ring from ya after all if\nI plays me cards right.\n\nSARAH regards him affectionately.\n\nSARAH: I know you don't mean that. You're helping me because you're\nreally nice.\n\nHOGGLE: I ain't nice! I just likes the way ya stood up ta him is all.\n(he is thoughtful for a moment; almost to himself) Too bad more've us\nhaven't had the guts to do the same.\n\nThe WORM reappears.\n\nWORM: How about a biscuit? The missus just took a fresh batch out of\nthe oven.\n\nSARAH: Thanks, but we really don't have any time. We've got to get to\nthe castle.\n\nHOGGLE: Ya wouldn't happen to know a shortcut, would ya?\n\nWORM: Well, you might try taking that first left.\n\nSARAH and HOGGLE look down the corridor.\n\nSARAH: But there isn't any left turn.\n\nJust then a strange FIGURE seems to come through the left wall and\nwalks toward them. He is dressed in long flowing robes and wears a\nhat shaped like a bird.\n\nWORM: See, there's a left turn right there, where that Wise One just\ncame in.\n\nSARAH: A Wise One! Maybe he knows the best way to the castle!\n\nHOGGLE: I wouldn't bet on it.\n\nBut SARAH is excited about the possibility of getting more help.\n\nSARAH: Excuse me, Sir. Could you tell us the best way to get to the\ncastle?\n\nWISE ONE: The best way to the castle, hmmm. I'm glad you asked that\nquestion.\n\nTo SARAH's and HOGGLE's surprise, the HAT joins into the conversation.\n\nHAT: Now you've done it, gone and asked him a question. We'll be here\nall day!\n\nWISE ONE: A castle, or fortress, or as it is sometimes known, a\nstronghold or citadel -- or, that which has a turret and barbican,\nbut usually not a portcullis ...\n\nHAT: What did I tell you? There's no stopping him now.\n\nWISE ONE: ... often there is a rampart or bulwark, and then a parapet\n-- perchance an actual vallum or counterscarp ...\n\nHAT: Shut up down there!\n\nWISE ONE: ... and for entrenchment; a moat, drawbridge and sally-port\n<b>...\n</b>\nSARAH looks at HOGGLE.\n\nSARAH: This was not one of my better ideas.\n\nHAT: Well, I told you that, didn't I? But nobody ever listens to me!\n\nHe looks down at the still mumbling WISE ONE.\n\nHAT: Enough! Nobody cares!!\n\nThe WISE ONE blinks and looks at SARAH and HOGGLE.\n\nWISE ONE: Did one of you say something?\n\nSARAH thinks quickly.\n\nSARAH: Oh, no. We never talk to strangers.\n\nWISE ONE: That's very wise. An idea worth savoring.\n\nHOGGLE nudges him.\n\nHOGGLE: Yeah, but keep it under your hat!\n\nHOGGLE thinks this is hilarious. The HAT doesn't.\n\nHAT: Ve-ry funny!\n\nThe WISE ONE continues on his way.\n\nWISE ONE: The stranger, hmm. I'm glad you brought that up. The\nstranger; one not indigenous, also known as the alien, or one from\nbeyond the sea ...\n\nHAT (hysterical): I quit! I can't take it anymore!\n\nAnd then they are gone, passing through the righthand wall as if it\nwasn't there. SARAH watches after them, stunned.\n\nSARAH: How did he do that?!!\n\nHOGGLE: And how can we make sure he doesn't come back?\n\nSARAH gives him a look and turns to the WORM.\n\nWORM: Just go over to that bit of wall there and walk right through\nit. The important thing is to forget what you think you know. It\ndoesn't apply around here.\n\nSARAH and HOGGLE walk down to the part of the wall where the WISE ONE\nentered. Once there, they can see that a section of the wall is\nactually a passageway-width behind the rest of the wall. SARAH yells\nback to the WORM.\n\nSARAH: Thank you! And tell the missus we're sorry we missed her\nbiscuits!\n\nAnd then they walk through the wall and are gone.\n\n<b>29\tINT: CORRIDOR 3 - DAY\n</b>\nSARAH and HOGGLE appear through the wall and SARAH laughs with\ndelight. HOGGLE wasn't as pleased with the experience and feels the\nwall as if testing to see if it really happened. SARAH sees that they\nare in a corridor where the walls are crumbling and she climbs up to\nthe top of one and looks over.\n\n<b>ANOTHER ANGLE\n</b>\n<b>SARAH'S POV - THE TURRETS OF THE CASTLE\n</b>\nSARAH (excited): I can see the castle! It doesn't look far at all!\n\nHOGGLE is still feeling around the wall, trying to figure out how\nthey got there. SARAH jumps down and starts to run down the corridor.\n\nSARAH: Come on, Hoggle. Let's go!\n\nHOGGLE sees her retreating figure and hurries after her.\n\n<b>30\tINT: CASTLE - DAY\n</b>\nJARETH's great hall. He stands by a window and looks out over the\nlabyrinth -- from this vantage point he can see clear across it: the\nhovels that surround the castle walls, the arid plain that leads to\nthe dense forest, encircling that, the complex maze. He seems lost in\nthought. The WHITE BIRD enters the window and lands on his shoulder.\nBehind him FREDDIE is having a grand time. His slippery crawl is too\nmuch for the GOBLINS that scurry about, trying to mind him.\nMeanwhile, a particularly stupid looking GOBLIN begins to approach\nJARETH. He saunters across the room and is stopped short by a FEMALE\nGOBLIN. She grabs hold of his shirt and hisses a warning.\n\nFEMALE GOBLIN: Remember! It's bow and scrape ... bow and scrape ...\n\nThe STUPID GOBLIN nods and she lets him go. He then continues his\napproach to JARETH, only this time he does a little bow and then\nscrapes his foot across the floor, then repeats the action.\n\nSTUPID GOBLIN (to himself): Bow 'n scrape ... bow 'n scrape ...\n\nJARETH turns and sees the GOBLIN.\n\nJARETH: Well, what is it?\n\nThe GOBLIN can't answer and do his bow-and-scrape at the same time so\ncontinues his painfully slow approach.\n\nSTUPID GOBLIN: ... bow 'n scrape ... bow 'n scrape ...\n\nAnnoyed, JARETH walks over to the GOBLIN and lifts him up by his\nshirt front. The GOBLIN is still bowing.\n\nJARETH: I said, what is it?!!!\n\nSTUPID GOBLIN: Th ... the girl and Hoggle, sire. Th ... they're\nhalfway th .... through th ... the maze.\n\nJARETH drops the GOBLIN hard on the floor. FREDDIE sees this and\nlaughs with delight. JARETH walks over and scoops the BABY up in his\narms. He then carries him over to the window. He calls over to an\nARMED GOBLIN by the door.\n\nJARETH: I think it's time they had some company.\n\nARMED GOBLIN: Yes, Sir!\n\nBe then salutes, causing his visor to close on his face, then\nstumbles around looking for the door. JARETH shakes his head.\n\nJARETH: You'll make a much better goblin than that, won't you,\nFreddie!\n\nFREDDIE's response is to clap his sticky baby's hand on to JARETH's\nface. JARETH, pretending he doesn't mind, carefully removes it. He\nthen looks down to the courtyard below.\n\n<b>31\tEXT: CASTLE - DAY\n</b><b>JARETH'S POV\n</b>\nARMED GOBLINS are pouring out of the castle.\n\n<b>32\tEXT: CORRIDOR 4 - DAY\n</b>\nSARAH and HOGGLE are striding down a corridor. They are about to come\nto a corner.\n\nSARAH: Are you sure Jareth can turn Freddie into a goblin? I mean,\nthat's really weird ...\n\nThey turn the corner and HOGGLE stops short. SARAH becomes alarmed.\n\nSARAH: What is it?\n\nHOGGLE gestures for her to be quiet and then we can hear what he\nhears -- marching. They look back the way they came.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH'S AND HOGGLE'S POV - A BATTALION OF ARMED GOBLINS, marching\nright towards them!\n\n<b>ANOTHER ANGLE\n</b>\nThey look at each other, then turn and run. HOGGLE tries to get\nthrough the wall the way the WORM showed them.\n\nHOGGLE (quoting the worm): Just forget what you think you know and ...\n\nHe smacks headlong into the wall. He stops to rub his nose and SARAH\nflies by him.\n\nSARAH: Come on!\n\n<b>33\tINT: CASTLE - DAY\n</b>\nFREDDIE is now sitting on the lap of a GOBLIN, happily bopping it on\nthe nose. JARETH snaps his fingers and a GROUP of sleepy MUSICIANS in\nthe corner stumble over themselves to pick up their instruments. They\nbegin to play and JARETH looks out the window and begins a song. He\nsings about the labyrinth; what it is -- his domain, and what it is\nto OTHERS -- a test, a proving-ground, not for the faint of heart.\n\n<b>34\tINT: MAZE MONTAGE - DAY\n</b>\nWhile JARETH sings, SARAH and HOGGLE try to escape from the GOBLINS.\nThey get a lead on them for a while and come to another corridor with\ncrumbling walls. They scamper up to get a look at their position and\nsee dust rising from several parts of the maze. The GOBLINS are\neverywhere.\n\nIn another corridor, they are stopped in their tracks by DOZENS OF\nLITTLE FUZZY CREATURES who scurry towards them out of the way of the\noncoming GOBLINS. They turn and run back the way they came and as\nthey do WALL CREATURES chatter nervously and then disappear into the\ncracks between the bricks.\n\nIn a corridor with very short walls they are able to see the tips of\nspears on either side of them, going in the opposite direction.\n\nThey enter a corridor with several arches curving over it, forming\nsmall, intermittent bridges. Thinking they are safe, they stop for a\nbreath, and soon realize that a BATTALION is right behind them. They\nscurry up the walls, and as the song comes to an end, they each lie\nacross an arch hopefully out of sight of the GOBLINS below.\n\n<b>35\tINT: ARCHED CORRIDOR - DAY\n</b>\nSARAH and HOGGLE huddle above the corridor on their arches as TWO\nGOBLINS bring up the rear.\n\nGOBLIN 1: I can kill better than you can.\n\nGOBLIN 2: But I'm better at maiming. Everybody says so.\n\nAnd they are gone. Shaken, SARAH and HOGGLE slide down from their\nhiding places.\n\nSARAH: Do you think they're gone?\n\nHOGGLE: Sure they are. Goblins ain't known fer their intelligence, ya\nknow. They has as much trouble findin' their way through the maze as\nyou do.\n\nHe folds his arms and leans against the wall.\n\nSARAH: I'm not sure, but I think you just called me stupid ...\n\nSuddenly HOGGLE yells and disappears. He has accidentally leaned on\nanother secret wall opening. SARAH quickly follows.\n\n<b>36\tINT: CORRIDOR 5 - DAY\n</b>\nHOGGLE and SARAH are now in the long circular corridor that divides\nthe maze from the beginning of the second ring of the labyrinth --\nthe Garden Maze.\n\nHOGGLE (excited): I think I know where we are!\n\nSARAH: That'll be a nice change.\n\nHe ignores her and looks around excitedly.\n\nHOGGLE: This place is the end o' the maze! That means we're near the\nentrance ta the second ring o' the labyrinth.\n\nSARAH: The second ring? What's that?\n\nHOGGLE starts down the corridor.\n\nHOGGLE (happily): The Garden Maze!\n\nSARAH (gloomy): Sounds like a great place ... what's it like?\n\nHOGGLE: Don't know, I ain't never made it this far before.\n\nHe is skipping happily down the corridor when SARAH hears something.\nIt is a strange clanking sound.\n\nSARAH (frightened): Hoggle! What's that sound?!!\n\nHOGGLE stops skipping and sighs.\n\nHOGGLE: Now don't go gettin' all girly on me, Missy, now that we's\nfinally safe ...\n\nSARAH: So you think we're safe, do you?\n\nHOGGLE (annoyed): Didn't I just say so?!!\n\nSARAH: Then tell me what you think of that.\n\nSARAH points behind them where the clanking noise is coming from. It\nis now much louder. HOGGLE comes over to her and takes a better look.\nHe screams.\n\n<b>ANOTHER ANGLE\n</b>\nTHEIR POV - A SLASHING MACHINE is coming right towards them. (A\nslashing wall is made up of rows of furiously spinning knives, and\nchopping cleavers, and has brushes along the bottom to clean up\nwhatever it encounters in its path.) And there is no way around it\nbecause it completely fills the corridor.\n\n<b>ANOTHER ANGLE\n</b>\nHOGGLE desperately tries to walk through the wall the way they came\nin, but it is to no avail. He just keeps smashing his face. SARAH\nstarts to run for it.\n\nSARAH: Come on!\n\nHOGGLE follows, every so often trying, and failing, to get through\nthe wall.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH, who is far ahead of HOGGLE, comes to a door! And hanging on a\nhook next to it is a bunch of keys. She looks back at HOGGLE.\n\nSARAH: Hoggle, hurry!\n\n<b>ANOTHER ANGLE\n</b>\nSARAH'S POV - HOGGLE running toward her, and making slow but steady\nprogress toward them BOTH -- the slashing machine.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH fumbles with the keys, furiously trying key after key in the\ndoor but to no avail. She is terrified.\n\nSARAH: None of the keys work!\n\nDesperate, she starts banging on the door. HOGGLE is just a few yards\naway from her.\n\nHOGGLE: Why don't you just try it?\n\nHe then tries once more to walk through the wall. SARAH tries the\nknob and sure enough, it opens. She is delighted. What she doesn't\nsee is HOGGLE suddenly disappearing through the floor.\n\nSARAH: It's open! Hog ...\n\nShe turns around and he is gone! And the slashing machine is just a\nfew yards away! She screams and, in her terror, falls backwards\nthrough the door. It slams shut just as the slashing machine reaches\nit WE CAN SEE that FOUR GOBLINS in sanitation workers' uniforms have\nbeen pushing the machine all along. They grunt and strain, cranking\nthe wheels that turn the knives and pushing all at the same time.\n\n<b>37\tINT: PICTURE GALLERY - DAY\n</b>\nSARAH emerges into a large room. The walls are covered with large\npaintings in ornate gilt frames. She is a bit stunned by the clone\ncall with the slashing machine as she approaches the first painting.\n\nSARAH (to herself): What in the world ...\n\nShe stops short in front of the first painting and cannot believe her\neyes. It is a painting of the watch with 13 hours on it. The hour\nhand is on the 9. SARAH fumbles into her pocket and finds the watch\nthat Jareth gave her. It also has the hour hand on the 9.\n\nSARAH: Only 9 hours left!\n\nThe next picture is of a BABY surrounded by gruesome GOBLINS. On\ncloser inspection, the BABY is obviously FREDDIE. She chokes back a\nsob and runs over to the next one, it is a picture of a rotunda with\nstaircases going off in all different directions on different planes\nof gravity. It is an Escher room, and a closer look shows a GOBLIN\nhappily standing on the ceiling. She shakes her head and goes by the\nnext painting and gasps involuntarily. It is a compelling portrait of\nJARETH, and she moves even closer. Then she shakes herself out of it.\n\n<b>ANOTHER ANGLE\n</b>\nTHE PORTRAIT'S POV - SARAH wills herself away and moves on, and we\nhear the sound of JARETH's breathing.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH is nervous and eagerly looks for a way out. She rushes by\nanother painting, giving it merely a glance. But something makes her\ngo back for a better look. It is of a lovely, manicured hedge maze.\nIn the distance WE CAN SEE the turrets of JARETH's castle. And in the\nsky nearby flies a beautiful WHITE BIRD. And then SARAH is amazed by\nwhat she sees. A closer look at the painting reveals that the WHITE\nBIRD is flying! It moves over the hedges and WE SEE a FIGURE waving.\n\nSARAH: Hoggle!\n\nSARAH, disturbed, backs away from the painting. And then, because it\nreally is as wonderful as it is scary, she goes back for another look\nand over her shoulder WE CAN SEE HOGGLE waving and we hear his tiny\nvoice.\n\nHOGGLE: Missy! Over here! This is the way to the castle!\n\nAnd SARAH strains to hear, and leans toward the painting, stretching\nher hand out and touching the painting, which makes it turn into a\nshimmering wall that her hand goes right through. And then she\ndisappears right through the painting.\n\n<b>ANOTHER ANGLE\n</b>\nTHE GALLERY. And JARETH's portrait is now blank.\n\n<b>38\tEXT: HEDGE MAZE - DAY\n</b>\nSARAH rushes up to HOGGLE and throws her arms around him.\n\nSARAH: What happened to you? I was afraid I'd never see you again!\n\nHOGGLE: Ya know that trick with the wall? Damn, if it don't work with\nthe floor, as well!\n\nSARAH laughs and hugs him again.\n\n<b>39\tINT : HEDGE MAZE - DAY\n</b>\nSARAH and HOGGLE have been walking through the maze a long time. They\nare tired and bedraggled. SARAH pulls the watch out of her pocket and\nsighs.\n\nSARAH: An hour's gone by and I don't think we're more than four feet\nfrom where we started.\n\nHOGGLE: That's 'cause ya won't do what I tells ya. It's clear as day\nwe should be goin' this way ...\n\nHe turns a corner and walks smack into a hedge dead end. He howls in\npain and SARAH sighs and follows him.\n\n<b>ANOTHER ANGLE\n</b>\nHOGGLE disentangling himself from the hedge.\n\nSARAH: Got any more suggestions?\n\nBefore HOGGLE can answer they are interrupted by a terrible\ngut-wrenching scream. It is positively unearthly. SARAH whirls around.\n\nSARAH: It sounds like it came from over there!\n\nHOGGLE points in the opposite direction.\n\nHOGGLE: Then let's go this way.\n\nSARAH frowns at him as the scream begins again.\n\nSARAH: Hoggle! It sounds like someone's being hurt!\n\nHOGGLE: Exactly why we should be headin' in the othermost direction!\n\nSARAH shakes her head in disgust and runs off as the screams become\nmore unbearable.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH, running through the hedge maze. Driven by the sound of the\nscreams, she has an unconscious ability to find her way through.\nHOGGLE, trying to keep up with her, keeps running into dead ends.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH emerging from the maze. She is stopped in her tracks by what\nshe sees and quickly covers her mouth to prevent herself from\nscreaming. HOGGLE emerges a moment later, barely pauses before he\nheads right back into the maze.\n\n<b>40\tEXT: CLEARING - DAY\n</b>\nSARAH'S POV - FOUR GOBLINS are torturing a huge creature (LUDO) that\nthey have hung by his ankle from a tree limb. They have also taken\npains to bind the CREATURE, who it is obvious could take an most of\nthem and win in a fairer fight. He is about nine feet tall,\npowerfully built, and his screams of frustrated agony are truly\nunbearable. The GOBLINS have devised a unique method of harassing\nhim. They ALL carry long sticks which have small, fierce, biting\nCREATURES on the end of them. The GOBLINS bat their sticks at LUDO,\nwho bellows and tries to swat back. Since he is tied, the NIPPERS are\nfree to bite him whenever they get near.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH, distraught, peeking out from behind a hedge.\n\nSARAH: The poor thing!\n\nHOGGLE peeks out from behind SARAH, then quickly ducks back. SARAH\nlooks for a way to stop the torture. She picks up a rock and\ncarefully aims it at the nearest GOBLIN. It hits his head and knocks\nhis helmet visor over his eyes. Blinded, the GOBLIN lurches around,\nswinging his nipper stick at the OTHER THREE.\n\nBLINDED GOBLIN: Hey! Who turned out the lights?\n\nThe OTHER GOBLINS see a new target and poke their nipper sticks\ntowards him. He takes off and runs blindly into the hedge maze. The\nOTHER THREE chase him, carrying the nipper sticks upright no that WE\nCAN SEE their progress in the BG.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH desperately tries to untie the huge knot that holds LUDO\nsuspended upside down. She can't undo it and yells for HOGGLE\n\nSARAH: Get out here, you coward!\n\nHOGGLE appears from behind his hedge. He hesitates, then pulls a\ndagger from his belt and joins SARAH. He cuts through the rope in one\nhack, and LUDO falls to the ground with a thud.\n\n<b>ANOTHER ANGLE\n</b>\nThe nipper sticks start yammering away as they see SARAH and HOGGLE\nfreeing LUDO over the top of the hedge. The GOBLIN chase stops and\nthey head back to the clearing. HOGGLE dives for the bushes but a\ndetermined SARAH stays and pulls off the ropes. When LUDO is free, he\npicks up a huge log. As the FOUR GOBLINS come roaring back into the\nclearing, LUDO waves the log over his head. The GOBLIN charge\nimmediately shifts into a GOBLIN retreat, the nipper sticks yipping\nin fear.\n\n<b>ANOTHER ANGLE\n</b>\nLUDO puts down the log and sits, his big shaggy head hanging down. He\ntaken one hand and wipes away a tear.\n\nLUDO: Ludo ... hurt.\n\nSARAH's heart breaks. This thing is the ultimate stuffed animal.\n\nSARAH: Is that your name? Ludo?\n\nHe nods and wipes away another tear.\n\nLUDO: Goblins ... mean to Ludo.\n\nSARAH: Oh, I know! They were terribly mean to you. (she moves closer\nand pats his arm) But it's all right now.\n\nLUDO sniffs and then breaks into the most endearing big dumb smile\nyou have ever seen.\n\nLUDO: Friend!\n\nSARAH: That's right, Ludo! I'm your friend. I'm Sarah.\n\nLUDO: Sarah ... friend!\n\nHOGGLE has come out from hiding during this exchange. He finds the\nwhole scene a bit nauseating. And an unnecessary nuisance. If there's\none thing he doesn't want, it's competition for SARAH.\n\nHOGGLE: I think I'm about ta be sick.\n\nThey ignore him and LUDO grins for all he's worth as SARAH beams up\nat him. HOGGLE pulls her over to one side.\n\nHOGGLE: I hope yer not thinkin' o' lettin' the beast traipse along,\nMissy. He'll just slow us up.\n\nSARAH: Are you kidding?! He'll be a great help! The goblins are\nscared of him because he's so fierce ...\n\nJust then LUDO shyly offers SARAH a flower that he has just picked\nfor her. She takes it and smiles at him.\n\nHOGGLE (sarcastically): I sees what ya mean.\n\nSARAH shrugs and gives LUDO a pat. HOGGLE sighs with frustration.\n\nHOGGLE: I just thinks we was doin' fine on our own.\n\nSARAH: And we can do even better with Ludo. (turns to Ludo) You want\nto help me save my baby brother, don't you, Ludo?\n\nLUDO: Save ... baby. Good!\n\nSARAH nods with satisfaction and strides into the hedge maze. LUDO\nright behind her. HOGGLE follows, clearly unhappy.\n\n<b>41\tEXT: FOREST GATE - DAY\n</b>\nSARAH, HOGGLE and LUDO come out of the hedge maze and see a wall with\ntwo SARAH-sized doors in it.\n\nHOGGLE: This is it, the entrance ta the Forbidden Forest. All we\ngotta do is pick a door ...\n\nSARAH: What difference does it make? Let's just go!\n\nLUDO quickly steps between SARAH and the doors.\n\nLUDO: One door ... good. One door ... bad.\n\nHOGGLE: Well, that's great news. (to Ludo) Don't suppose ya know\nwhich is which?\n\nSARAH skirts around LUDO and goes up to the doors for a closer look\nat them.\n\nLUDO: One door ... good. One door ...\n\nHOGGLE: All right, ya walkin' mountain! Ya made ya point.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH ignores the bickering behind her and examines the doors. Each\none has a door knocker on it. Both knockers are carved into faces,\nexcept one has the ring going through its ears and the other has it\nstuck in its mouth.\n\nSARAH (to herself): I guess once you choose a door ... all you have\nto do is knock.\n\nThe KNOCKER with the ring through its ears speaks.\n\nKNOCKER 1: Are you addressing me?\n\nSARAH jumps back, stunned.\n\nSARAH: You can talk!\n\nKNOCKER 1: What? What? You'll have to speak up!!\n\nKNOCKER 2: mmffn ... grnth ... sminvl ...\n\nSARAH turns to the OTHER KNOCKER.\n\nSARAH: You too!\n\nKNOCKER 2: ... gmft ... bmble ...\n\nSARAH shakes her head in amazement.\n\n<b>ANOTHER ANGLE\n</b>\nThe BOYS are still at it.\n\nHOGGLE: If yer so smart why not show us another way inta the forest?\n\nLUDO: Ludo ... not ... know.\n\nHOGGLE: That figures, don't it? (he turns his back on Ludo, fuming)\nWhy the Missy wants an overgrown hill o' hair fer a friend is beyond\nme.\n\nLUDO tries to make HOGGLE feel better and pats him on the shoulder.\nHOGGLE shakes his hand off with a growl.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH is excited.\n\nSARAH: I love it! Talking doors!! (to Knocker 1) Are you the right\ndoor to the forest?\n\nKNOCKER 1: It doesn't do to ask me. For some reason I can't hear a\nthing.\n\nSARAH turns to KNOCKER 1.\n\nKNOCKER 1: No use asking him, either. All he does is mumble.\n\nKNOCKER 2 gets very excited.\n\nKNOCKER 2: thgt ... vrnf ... lcl ...\n\nSARAH: I get it! You can't talk with that ring in your mouth!\n\nShe removes the ring and looks at the FACE triumphantly.\n\nSARAH: Now, tell me which one of you is the right door to the forest.\n\nKNOCKER 2: Oh, I am. No question about it.\n\nSARAH: Great! How do we get you to open up?\n\nKNOCKER 2: One merely has to knock.\n\nSARAH: Of course, why didn't I think of that.\n\nShe tries to get the ring back in its mouth.\n\nKNOCKER 2: Oh no you don't, young lady! I've had just about enough of\nthat awful thing, thank you very much!\n\nSARAH: But how are we supposed to get through this door if you won't\nlet me knock on it?\n\nKNOCKER 2: Well, I really couldn't say now, could I?\n\nSARAH throws up her hands in disgust.\n\nKNOCKER 1: Oh do speak up, both of you? I can't hear a thing!\n\n<b>ANOTHER ANGLE\n</b>\nHOGGLE and LUDO are still at it.\n\nHOGGLE (conspiratorially): Ya know ... even if she does get the door\nopen, ya won't be able ta fit through. Why not make it easy on us all\nand take a hike?\n\nLUDO: Ludo ... Stay!\n\nHOGGLE is disgusted.\n\nHOGGLE: Yer quite the speechifier, ain't ya?\n\n<b>ANOTHER ANGLE\n</b>\nSARAH suddenly gives KNOCKER 2 an evil grin.\n\nSARAH: Are you sure there isn't anything I can do to change your mind?\n\nKNOCKER 2: Absolutely not! My lips are sealed!\n\nSARAH: That's what I thought!\n\nThe KNOCKER presses its lips firmly together. SARAH deftly squeezes\nits nose shut. It sputters for air and finally has to open its mouth\nbefore it suffocates. SARAH shoves the ring in with a gleeful cry of\ntriumph. She knocks, and the door swings open.\n\nSARAH: Let's go!\n\nShe goes through the door and HOGGLE and LUDO race to follow. They\nBOTH try to get through the door at the same time and get into such a\ntangle that the door closes before they can straighten themselves out.\n\nHOGGLE: Now you've done it!\n\nIn a frenzy, HOGGLE starts banging on both doors.\n\nHOGGLE: Missy! Missy, wait!\n\n<b>42\tEXT: FORBIDDEN FOREST - DAY\n</b>\nSARAH on the other side of the door. Except on this side, there is no\ndoor, just a long expanse of wall. The forest is very dark, and as\nits name suggests, very forbidding. SARAH can hear HOGGLE calling,\nbut it is very faint.\n\nSARAH (scared): Hoggle?\n\n<b>43\tEXT: FOREST GATE - DAY\n</b>\nHOGGLE is beating on the doors with such a frenzy that the other door\nswings open.\n\nHOGGLE: I'm coming ...\n\nHe rushes through the door and disappears. We can tell from his voice\nthat he is falling down a deep hole.\n\nHOGGLE (echoed): ... Miiiiiiiiissy!\n\nWe hear a huge splash. Then that door shuts and LUDO is all alone.\n\nLUDO: Sarah ... gone. Hoggle ... gone.\n\nHe is sad and confused. A FIGURE emerges from the hedge maze and\nbegins to walk along the wall, away from LUDO. It is the WISE ONE.\nLUDO brightens and chases after them.\n\nLUDO: Wait!\n\nThe WISE ONE stops and the HAT looks LUDO up and down.\n\nHAT: This ought to be a good one!\n\nLUDO: Ludo ... need ... door!\n\nWISE ONE: You have need of a door, do you? Ah, yes. A very useful\nthing, the door; also known as a portal or threshold -- and that\nwhich gives access, a gate or gangway ...\n\nHe continues walking and LUDO walks with him, listening intently.\n\nWISE ONE: ... also an entrance or entry, often accompanied by a\npropylaeum ...\n\nHAT (sighs): If only I had hands I could cover my ears ... that is,\nif I had ears ...\n\nWISE ONE: ... not to be confused with a window, or fenestration ...\n\n<b>44\tEXT: FOREST - DAY\n</b>\nSARAH has waited long enough.\n\nSARAH: Hoggle, Ludo ... where are you?\n\nShe reaches into her pocket and looks at the watch. The hour hand is\non the 7.\n\nSARAH: (whispers) Oh, Freddie! (she shoves the watch back into her\npocket) Well, you guys are going to have to catch up with me 'cause I\ncan't wait.\n\nThen determined, she strides off.\n\n<b>45.\tINT: HOLE - DAY\n</b>\nHOGGLE is in a pool at the bottom of a deep hole in the ground. There\nis a ledge just above him and he splashes violently trying to reach it.\n\nHOGGLE: Somebody help me! I can't swim!\n\n<b>46\tEXT: FOREST - DAY\n</b>\nSARAH is in a very thick, creepy part of the woods. She is clearly\nlost. She gets herself tangled in a thorn bush, and struggles with it\nto get herself free. Finally she does, and then, frustrated, sits\ndown on the ground.\n\nSARAH: Why does everything have to happen to me?\n\nBut there's no time to think about that because she hears the sound\nof a driving drum rhythm and then a wild-looking, spindly, leering\nLITTLE CREATURE comes scampering through the trees and into the\nclearing; and then ANOTHER, and ANOTHER and ANOTHER. SARAH is\nterrified as they approach her, but then not so terrified because the\nCREATURES aren't doing anything except dancing; wild, loose-limbed,\nfrenzied dancing. SARAH laughs, and can't help but be taken in by the\nwild spectacle. And then they begin to encircle her, still moving to\nthe wild rhythm.\n\nSARAH (laughing, moving): What are you?\n\nWILD THING 1: We're Wild Things, baby! Wild!\n\nWILD THING 2: Wild and free!\n\nWILD THING 3: Get down!\n\nAnd then more WILD THINGS appear, and these produce instruments. As\nand turn the drum rhythm into a frenzied upbeat number.\n\nWILD THING 1: You call that wild! I'll show you wild!\n\nAnd then he does an amazing thing, to say the least. He takes his\nhead off and rolls it along his arms from hand to hand like a\njuggler, then tosses it high in the air and deftly catches it on his\nshoulders. SARAH gasps and tries to get sway but another WILD THING\npushes her back into the middle of the melee.\n\nWILD THING 2: Cut me some slack and move on back!\n\nAnd they do, and, moving to the pounding rhythm, he takes his eyes\nout of his head and waves them at SARAH. He then tosses them on the\nground as if they were a pair of dice. They land at SARAH's feet\nlooking straight up.\n\nWILD THING 2: Snake eyes!\n\nSARAH is fascinated and repelled. And the beat gets hotter and the\nfrenzy more frenzied and she can't help getting a little wild\nherself. She begins to really dance.\n\nWILD THING 3: That's it, baby, get wild and free! But you'll never be\nas wild as me!\n\nAnd to prove it he takes his head off and begins to dribble it like a\nbasketball. WILD THING 1 leans over to SARAH and whispers\nconspiratorily.\n\nWILD THING 1: I wouldn't call that really _wild_, would you?\n\nSARAH: Well, it's ... uh ... sort of ...\n\nWILD THING 1: I'd call _this_ wild ...\n\nAnd he takes off his head, puts it on the ground as if it were a golf\nball, and then removes a leg and uses it as a golf club. The head\ngoes flying, right to SARAH. SARAH catches the head, then tries to\nget it back to its body but the body dances into the middle of all\nthe other WILD THINGS and she can't find it. So there's SARAH,\nrunning around like a chicken with two heads when suddenly the ears\nstart to flap and the head flies out of her hand. A WILD THING grabs\nher hand and turns her around.\n\nWILD THING 2: That was _wild_, baby. (he starts to dance) Now how\n'bout gettin' wild with me?\n\nBut SARAH has had enough.\n\nSARAH: I think I'll sit this one out ...\n\nWILD THING 1: Not with us you don't ...\n\nWILD THING 2: 'Cause we're _wild_!\n\nAnd then they're all over her, like a bunch of hyper puppies, and\nit's really too much.\n\nSARAH: Enough! I've got to find the castle!\n\nWILD THING 2: Well, why didn't you say so, baby!\n\nWILD THING 3: That's a _wild_ idea!\n\nAnd then his head flies off and he has to quickly grab it and put it\nback and meanwhile the OTHERS start pushing and pulling on SARAH and\npropel her into the woods.\n\nWILD THING 1: They got some wild goings on at the castle, baby!\n\n<b>47\tINT: HOLE - DAY\n</b>\nHOGGLE is holding on to the ledge with his fingertips. He doesn't\nhave the strength to hold on much longer and he looks down at the\nwater in mortal terror. He begins to slip just as a door opens in the\nsheer rock and JARETH enters, accompanied by GOBLINS.\n\nJARETH: Well, what have we here ... if it isn't little _Piggle_!\n\nHOGGLE screams and slips into the water. He tries to struggle back to\nthe ledge but the GOBLINS push at him with poles, laughing maniacally.\n\nJARETH: Did the girl decide she doesn't need you, now that she has\nthat beast?\n\nHOGGLE (angry): She wouldn't do nuthin' like that!\n\nJARETH leans over the water, laughing.\n\nJARETH: Don't you know she could never care for a repulsive thing\nlike you!\n\nHOGGLE splashes and tries to stay afloat.\n\nHOGGLE: She does care! Me 'n Sarah is friends!\n\nJARETH: Only until something better comes along ... and I've\ndefinitely got something better in mind!\n\nHOGGLE: Don't you hurt her!\n\nHOGGLE grabs on to the ledge and the gleeful GOBLINS push him back\ndown into the water.\n\nJARETH: What I do to her is my business ... and it is _inevitable_.\n\nHe grabs HOGGLE by the shirt front and lifts him out of the water.\n\nJARETH: You can be with me or against me.\n\nHOGGLE (terrified): Wh ... what do I gotta do?\n\nJARETH: I doubt if she can make it to the castle in time ...\n\nHe leans down and speaks directly into HOGGLE's face.\n\nJARETH: But just in case, I want you to deliver her to me.\n\nHOGGLE: Never! I'd rather die!\n\nJARETH sneers scornfully.\n\nJARETH: Then so you shall.\n\nHe drops HOGGLE back into the water. The GOBLINS shriek with delight.\nHOGGLE goes under and comes up sputtering.\n\nHOGGLE: Wait!\n\nJARETH was about to leave. He turns back to HOGGLE, a look of\namusement on his face.\n\nHOGGLE: I gotta know what ... what you'll do to her!\n\nHe splashes pathetically in a desperate attempt to stay above water.\n\nJARETH: I will do what ever amuses me ...\n\nHe reaches into his cloak and brings out a perfect peach.\n\nJARETH: All _you_ have to do is give her this.\n\nHe tosses HOGGLE the peach. HOGGLE catches it and immediately the\nwater starts to recede.\n\nJARETH: You've made a very wise decision.\n\nHe leaves, followed by the GOBLINS.\n\nHOGGLE: I didn't decide nuthin'!\n\nHOGGLE stares forlornly at the peach, and soon the water is gone and\nhe is sitting on cold, damp ground.\n\n<b>48\tEXT: FOREST - DAY\n</b>\nThe WILD THINGS are leading SARAH on a rocky path. She stumbles along\nbut they couldn't care less.\n\nSARAH: Are you sure this is the way to the castle?\n\nWILD THING 1: Oh, did you say \"the castle\"?\n\nWILD THING 2: I thought she said hassle!\n\nWILD THING 3: I thought she said rassle!\n\nWILD THING 1: Rassle! That's a _wild_ idea!\n\nHe leaps on SARAH and she flings him off.\n\nSARAH: OK, guys, fun's over.\n\nShe starts to leave and they pull her back.\n\nWILD THING 2: Over! It's just begun!\n\nAnd then the musicians are back and the dancing gets wilder than\never. The WILD THINGS totally surround SARAH, and though they aren't\nhurting her, they are definitely not letting her out. What they do is\nstart throwing their heads at each other and switching them.\n\nWILD THINGS 1, 2 &amp; 3: Now this is _really_ wild!\n\n<b>ANOTHER ANGLE\n</b>\nA door opens in a nearby boulder and LUDO appears. In the background\nWE CAN SEE and hear the WISE ONE as he wanders off.\n\nWISE ONE: ... very often preceded by a porch, or portico, also\nverandah, and followed by a vestibule, otherwise known as an\nantechamber or foyer ...\n\nHAT: Why me?!!\n\nThe door closes. LUDO sees SARAH in the middle of this weirdness and\nis just a bit confused. SARAH sees him amidst the flying heads and\ncries out in relief.\n\nSARAH: Ludo!\n\nLUDO: Sarah ... not ... want ... castle?\n\nSARAH: Are you kidding?!! Get me out of here!!!\n\nLUDO approaches the WILD THINGS and grabs a head before it reaches\nits target and calmly tosses it into the trees.\n\nWILD THING 3: Hey, big fella! That's a little _too_ wild ...\n\nBut there's no time to talk because LUDO calmly catches the other\nheads and tosses them away. The bodies go scurrying after their\nheads, followed by the MUSICIANS. SARAH is free.\n\nSARAH: Oh, Ludo! I'm so glad you're here!\n\nShe gives him a kiss and he beams.\n\nSARAH: Where's Hoggle?\n\nLUDO: Hoggle ... in ... bad ... door.\n\nSARAH: We've got to find him! Do you think we can?\n\nLUDO is very confident. He spent a lot of time with the WISE ONE.\n\nLUDO: Ludo ... knows ... doors ...\n\nHe ambles off with SARAH following.\n\nLUDO: also ... portal ... or entrance ...\n\n<b>49\tINT: HOLE - DAY\n</b>\nHOGGLE is more depressed than ever. The peach is nowhere to be seen.\nSuddenly LUDO's head appears above.\n\nLUDO: Hoggle ... all ... wet.\n\nHOGGLE almost jumps out of his skin and then is totally outraged.\n\nHOGGLE: Ain't that the clever observation, ya feeble excuse fer a\nthinkin' creature!\n\nSARAH appears from behind LUDO.\n\nSARAH: Be nice, Hoggle. Or we won't get you out.\n\nHOGGLE's face lights up and all thoughts of anger are forgotten.\n\nHOGGLE: Missy!\n\n<b>50\tINT: FOREST - DAY\n</b>\nSARAH, HOGGLE and LUDO march through thick, overgrown forest. They do\nnot know that they are being spied on by JARETH'S GOBLINS.\n\n<b>51\tINT: CLEARING - DAY\n</b>\nThe THREESOME emerge into a clearing and see that they have come to a\nwide fissure that goes off in either direction as far as the eye can\nsee. It is spanned by a rickety bridge held by two thick wooden posts\non either side of the gap. SARAH eyes the bridge warily.\n\nSARAH: It doesn't look too strong but we don't have much choice ...\n\nSuddenly they are interrupted by a high-pitched, but powerful voice.\n\nVOICE (VO): Halt! Halt or be slain forthwith!\n\nAt first they don't see a thing and look around for the source of the\nvoice. Then, the imposing 18 inch high figure of DIDYMUS, resplendent\nin rakish hat and swashbuckling sword, emerges from behind one of the\nposts and stands in front of the bridge. LUDO and SARAH are\ndumbstruck. HOGGLE, however, is not at a loss for words.\n\nHOGGLE: Out of our way, ya wretched little rodent ...\n\nDIDYMUS looks directly at HOGGLE.\n\nDIDYMUS: You, sir, shall be the first to feel the point of my sword!\n\nHOGGLE snorts with derision and SARAH tries a more sensible approach.\n\nSARAH: Please, we really have to cross this bridge. It's a matter of\nlife and death!\n\nDIDYMUS shrugs elegantly.\n\nDIDYMUS: Under any other circumstances I would hasten to oblige you,\nfair damsel, for your mission sounds a worthy one.\n\nSARAH: Oh, it is!\n\nDIDYMUS: But I am sworn. Without my permission, none may pass.\n\nSARAH throws up her hands and HOGGLE mumbles under his breath. It\nappears to be up to LUDO to break the deadlock. He lifts DIDYMUS up\ninto the air and moves him to one side. They then start to walk\ntoward the bridge and DIDYMUS chases them, brandishing his sword.\n\nDIDYMUS: You dishonor me, varlets! En garde!\n\nTo his chagrin they ignore him and keep walking.\n\nDIDYMUS: Rapscallions! Duel ... or _die_!\n\nThis gets their attention and they turn to look at him, annoyed.\n\nHOGGLE: What _is_ this weasel babblin' about?\n\nIt is too much for DIDYMUS. He flings himself at HOGGLE with a mighty\nwar cry. HOGGLE tries to run for it but DIDYMUS is right behind him,\nadministering more than a few pinpricks in embarrassing places.\nHOGGLE dives behind a bush and DIDYMUS sniffs at his cowardice. He\ncomes back and faces LUDO.\n\nDIDYMUS: It is you I want, rogue of rogues. You who dealt me the\ngravest affront!\n\nAnd with that he jabs LUDO in the foot! LUDO is stunned, and howling,\nbegins to hop on his good foot. DIDYMUS, his head thrown back for a\ntriumphant yell, goes after LUDO with his sword flashing and there is\nnothing for LUDO to do but pick up a branch and defend himself. It is\nthe most mismatched duel in the history of chivalrous absurdity\nDIDYMUS moving at an incredible speed, parrying the mighty swipes of\nLUDO's branch with great skill -- and no small amount of difficulty.\nAnd LUDO fending off the incessant pinpricks of the little sword,\nleaping about with surprising agility -- and at a rate that exhausts\nhim totally. Finally, the two of them, breathing heavily, lower their\nweapons. And, to everyone's surprise, DIDYMUS throws down his sword.\n\nDIDYMUS: I no longer wish to slay you, for you are a truly noble\nknight.\n\nThen DIDYMUS strides up to him and, craning his neck, attempts to\nlook LUDO in the eyes.\n\nDIDYMUS: Destroy me if you will.\n\nLUDO quickly drops his branch in response. The whole thing has upset\nhis gentle nature terribly. DIDYMUS then holds out a tiny paw.\n\nDIDYMUS: Never have I met my match in battle, yet you, noble knight,\nhave fought me to a standstill.\n\nLUDO kneels and tentatively takes DIDYMUS' paw into his own huge hand.\n\nDIDYMUS: Let us be brothers henceforth, and fight for the right as\none!\n\nSARAH cheers and HOGGLE, unimpressed, rubs his sore rear. LUDO\nsmiles from ear to ear.\n\nLUDO: Ludo ... get ... brother!\n\nThen he and DIDYMUS exchange the ritual kiss on each cheek, which in\ntheir case is not easily accomplished. SARAH then turns practical.\n\nSARAH: Well, now that that's settled let's get going.\n\nShe heads for the bridge but DIDYMUS blocks her way.\n\nDIDYMUS: You forget my sacred vow, my lady. I cannot let you pass.\n\nSARAH is incensed.\n\nSARAH: But you said Ludo was your brother! How can you refuse him?!!\n\nDIDYMUS: I have taken an oath. I must defend it to the death.\n\nHOGGLE, enraged, turns on LUDO.\n\nHOGGLE: Some brother he turned out ta be!\n\nLUDO: Brother ... good!\n\nHOGGLE: Well, if he's so good, why won't he let us get on with our\nbusiness?\n\nLUDO scratches his head. He has no idea. SARAH sits down beside the\ncrestfallen DIDYMUS.\n\nSARAH: OK, let's handle this thing logically. What exactly have you\nsworn?\n\nDIDYMUS brandishes his sword.\n\nDIDYMUS: I have sworn with my life-blood, no one shall pass this way\nwithout my permission.\n\nSARAH: Then may we ... _have your permission_?\n\nDIDYMUS is stunned. HOGGLE and LUDO barely breathe. Slowly DIDYMUS\nlooks all around and then, with a courage greater than any he has\never had to call on before, he says it.\n\nDIDYMUS: Yes.\n\nAnd the sky doesn't fall, and the earth doesn't heave, and everything\nis exactly as it should be.\n\nSARAH: Thank you.\n\nDIDYMUS breathes a sigh of relief and steps aside to let them pass.\nLUDO is the first one to go over and that is unfortunate. Because the\nrickety bridge collapses under his weight. SARAH and HOGGLE jump back\non the ground near DIDYMUS just in time and poor LUDO swings over the\ndeep fissure, hanging on to one of the ropes that held the bridge.\nWith a mighty effort he hoists himself up on to the opposite side and\nlooks forlornly over at the others.\n\nSARAH: Oh no!\n\nSARAH crumples to the ground, and stares miserably at the broken\nbridge.\n\nHOGGLE: Now see what ya done, ya mush-brained mammoth!\n\nDIDYMUS: I, Sir Didymus, take responsibility for the actions of my\nbrother, my lady. Lash out at me if you must.\n\nSARAH: I'm not mad at Ludo, Sir Didymus. I'm just upset because time\nis running out and I have to rescue my baby brother.\n\nDIDYMUS is struck to the very roots of his chivalry.\n\nDIDYMUS: You mean to rescue _a child_?!!\n\nSARAH: The goblin king took him, and I've only got ...\n\nShe takes out the watch. The hour hand is on the 5.\n\nSARAH: ... five hours to get him back.\n\nDIDYMUS yells across to LUDO.\n\nDIDYMUS: Is this your quest, too, my brother?\n\nLUDO: Save ... baby.\n\nDIDYMUS is overwhelmed.\n\nDIDYMUS: Then I shall join you, lady. I am at your service, upon my\nsword.\n\nHe bows low before SARAH and she smiles.\n\nSARAH: I happily accept your fealty, Sir Didymus.\n\nHOGGLE frowns with displeasure at this latest development.\n\nHOGGLE: This is all well an' good, Missy. But we still got one little\nproblem.\n\nThey all look across the fissure at LUDO.\n\nLUDO: Ludo ... friends.\n\nHOGGLE: Yes, yes. We're friends. Very nice. What's that got ta do\nwith us gettin' over there without a bridge?\n\nLUDO: Rocks ... friends.\n\nHOGGLE: We're wastin' our time, Missy. Let's you an' me go find\nanother ...\n\nHe is interrupted by LUDO bellowing, which is followed by a\nsympathetic rumbling. Suddenly rocks pile in from both directions\nuntil there is a pile in the fissure high enough for them to walk\nacross.\n\nLUDO: Rocks ... friends!\n\nSARAH (laughing): They sure are, Ludo!\n\nShe skips happily across followed by a sullen HOGGLE. DIDYMUS\nwhistles and is quickly joined by a tail-wagging SHEEPDOG. SARAH\ngasps, he is the spitting image of her own MERLIN.\n\nSARAH: It's ...\n\nDIDYMUS: Ambrosius! My noble steed.\n\nSARAH laughs and shrugs. Nothing surprises her in the labyrinth.\n\n<b>52\tEXT: FOREST - NIGHT\n</b>\nThe edge of the forest. From here you can see the castle in the\ndistance, just across the dry, cracked plain. The sky is full of\nstars. SARAH, HOGGLE, LUDO and DIDYMUS are sitting around a fire.\n\nDIDYMUS: What will you do after we save the child, my lady?\n\nSARAH: Take him home, of course! That is, if I can figure out how.\n\nDIDYMUS: What is your kingdom like? Do you have many knights to\ndefend your honor?\n\nSARAH: Not even one.\n\nDIDYMUS: It cannot be! What bitter place is this that does such\ndishonor to my lady?\n\nSARAH: It's a place where ... where nobody really sees me.\n\nLUDO: Ludo ... see ... Sarah!\n\nSARAH: (laughs) I know you do, Ludo. (she turns to Didymus) And\nthanks to you, Sir Didymus, I finally have a knight.\n\nHe bows graciously. HOGGLE, who has been watching this scene, feels\nrejected and miserable. He gets up and wanders away from the fire.\nAfter a moment, SARAH follows him.\n\nSARAH: Don't you feel like resting?\n\nHOGGLE: I ain't tired.\n\nSARAH: Me neither. What I am is hungry.\n\nHOGGLE winces but SARAH doesn't notice. SARAH looks back at LUDO and\nDIDYMUS. LUDO lies on his back snoring loudly. DIDYMUS dozes against\nAMBROSIUS' side.\n\nSARAH: They're both wonderful, aren't they?\n\nHOGGLE: They're alright.\n\nSARAH: They're more than that! They're loyal and strong ... and with\ntheir help I'm going to beat Jareth!\n\nHOGGLE shakes his head sadly. SARAH speaks as an afterthought.\n\nSARAH: And yours, too, of course.\n\nHOGGLE: I ain't no fighter ...\n\nShe shrugs that off and wanders away to look out at the castle.\nHOGGLE goes through agony for a moment, and then makes a decision.\n\nHOGGLE: Missy ... if you're hungry ...\n\nHe holds out the peach that JARETH gave him: the world's most\ndelicious looking peach.\n\nSARAH: Oh, great!\n\nShe happily taken the peach and bites. It takes everything HOGGLE has\nto not put his hands over his ears. She takes another bite and then\nstumbles.\n\nSARAH (laughing): Everything's dancing ...\n\nShe looks up at the sky, exhilarated.\n\nSARAH: Even the stars are dancing!\n\nHOGGLE turns and walks back to the fire. SARAH stumbles about as she\ngazes happily at the sky.\n\n<b>53\tINT: CASTLE - NIGHT\n</b>\nFREDDIE is leading the GOBLINS on a merry chase. He crawls around the\nroom, pulling things off shelves. A GOBLIN is on his hands and knees\nin front of JARETH polishing his boots. JARETH kicks the GOBLIN and\nsends him flying across the room. This makes FREDDIE laugh and he\npulls a book off the shelf and throws it. It hits a GOBLIN on the\nhead. JARETH scoops up FREDDIE and puts him in his cradle. He sits\ndown next to him.\n\nJARETH: Little goblin-to-be, I have something to amuse you.\n\nHe waves his hands in front of FREDDIE and suddenly beautiful\ncrystalline balls appear in them. He runs them over his fingers like\nso many coins, their molten light so dazzling that FREDDIE kicks up\nhis legs with excitement. And WE CAN SEE that at the end of his\npajamas are two wizened goblin feet! JARETH laughs and flings the\nballs into the air and they turn into bubbles, beautiful, mesmerizing\nbubbles.\n\nJARETH: Soon, little one. Very, very soon ...\n\nAnd they both watch the bubbles as they fly out the window and over\nthe labyrinth, coldly beautiful against the darkening sky.\n\n<b>54\tEXT: FOREST - NIGHT\n</b>\nSARAH's hand opens slowly and the half-eaten peach falls to the\nground. She stares out into the sky, mesmerized. The bubbles are\napproaching; dazzling, dancing bubbles. And then she hears music,\nhaunting, spell-casting music. The bubbles come closer and WE CAN SEE\nthat each one contains a TWIRLING DANCER, a DANCER just like the one\nin SARAH's music box. She gets up and follows them.\n\n<b>ANOTHER ANGLE\n</b>\nHOGGLE watching from the woods.\n\nHOGGLE: Damn you, Jareth! (He turns and begins to walk away) And damn\nme too!\n\n<b>ANOTHER ANGLE\n</b>\nA bubble, with SARAH inside it, floating through the sky. She appears\nenchanted, and she begins to twirl, just like the OTHER DANCERS.\n\n<b>55\tEXT: BALLROOM - NIGHT\n</b>\nA giant bubble, with a magnificent ballroom inside it. Tiny bubbles\nrush to join it. In one of them is SARAH.\n\n<b>56\tINT: BALLROOM - NIGHT\n</b>\nThe music changes and now SARAH is inside the ballroom. It is a\nmagnificent spectacle with all the beauty and decadence of an 18th\nCentury Venetian ball. Magnificently dressed DANCERS swirl to the\nmusic in an incredibly opulent setting. But when you look closer you\nsense decay just beneath the surface; things are threadbare, faded.\nThe GUESTS wear masks that are elegant parodies of goblin faces,\ngiving them all a slightly sinister look. And there is something very\nprovocative about all of them; the WOMEN have bare shoulders and\ndaring decolletage, many of the MEN have their shirts open to the\nwaist. Some of them lounge against the wall indolently and there is\nthe feeling that the party has been going on all night. In this\nsetting SARAH is the picture of innocence. TWO WOMEN snickering\nbehind their fans as SARAH approaches, and she is suddenly terribly\nself-conscious. How plain She feels amidst all this! She looks into\none of the many mirrors that line the ballroom and sighs at her\nimage. Then suddenly she sees something in the mirror that makes her\ngasp.\n\n<b>ANOTHER ANGLE\n</b>\nThe mirror, and in it the reflection of a resplendent JARETH dancing\nwith a particularly exotic-looking WOMAN. SARAH whirls around, trying\nto get another glimpse of JARETH. She is so intent on trying to see\nhim that she doesn't notice that she is being stared at brazenly by a\nYOUNG MAN leaning against the wall. He moves next to her and whispers\nsomething into her ear. She hurries away, shocked; and the YOUNG MAN\nthrows back his head and laughs. And JARETH sees the whole thing.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH is approached by a MIDDLE-AGED MAN who has a box hanging at\nwaist height from a ribbon around his neck. It looks like SARAH's\nmusic box. She looks down at it with interest and he throws open the\ncover. But there is no dancer inside, instead there is a stick carved\nlike a snake. It shoots out at SARAH and she cries out and backs\naway. ALL THE PEOPLE around her laugh and she moves hurriedly on.\nJARETH, who is dancing with an even more beautiful WOMAN than before,\nwatches SARAH.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH is looking for JARETH. She spots him and sees him whisper\nsomething to his partner who smiles knowingly from beneath her mask\nand licks her lips. SARAH blushes and turns away and finds herself\nlooking into another mirror. But in the reflection, JARETH isn't with\na partner. He is standing alone, the DANCERS a whirling blur around\nhim, and he is looking straight at her. SARAH, whirling around to\nface the crowd and she sees JARETH with yet a third BEAUTY. And then\nshe realizes that it is herself! In a trance-like state she moves\nthrough the CROWD to get a better look.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH'S POV - She is whirling in JARETH's arms, and she is the most\nbeautiful woman at the ball. JARETH smiles down at her and the\nattraction between them is palpable.\n\nJARETH: You look like a queen.\n\nSARAH looks up at him, thrilled by his words.\n\nSARAH: I ... I feel like ... I ... don't know what I feel ...\n\nJARETH (smiling): Don't you?\n\nAnd he whirls her around dizzyingly, so dizzyingly that she swoons in\nhis arms. He catches her before she can fall very far, tightening his\ngrip around her waist.\n\nSARAH: Are we ... are we in a bubble?\n\nJARETH: Yes, we are. A dream bubble ... where your dreams can come\ntrue.\n\n<b>ANOTHER ANGLE\n</b>\nOUR SARAH is being jostled by the crowd. She stumbles and almost\nfalls on top of a COUPLE on a bench. The WOMAN is sprawled across the\nlap of the MAN who wears a mask with a very phallic nose. SARAH backs\naway from them, frightened.\n\n<b>ANOTHER ANGLE\n</b>\nJARETH and SARAH, dancing. She is smiling up at him, he has never\nlooked more handsome. There is something more open about him, as if\nhe, too, is caught up in the moment. He nuzzles her hair with his\nlips and whispers in her ear.\n\nJARETH (whispering): My Queen!\n\nThen he begins a song. A song that tells SARAH he will give her\neverything she wants, even things she doesn't know she wants. A song\nthat says forget it all; all the restrictions, all the powerlessness.\nForget and stay in the dream.\n\n<b>ANOTHER ANGLE\n</b>\nOUR SARAH watches, mesmerized. But every time she tries to get closer\nto JARETH and SARAH she in jostled by a lascivious ADMIRER, pushed\nout of the way by WOMEN laughingly being chased by MEN. She stumbles\nagainst a wall and a door opens. Inside, pillow feathers are flying\nand she can't make out what the SEVERAL PEOPLE are doing. A WOMAN\ncomes up to the doorway, winks at SARAH, and closes the door.\n\n<b>ANOTHER ANGLE\n</b>\nJARETH finishes the song and SARAH looks up at him, smiling. He moves\nhis face closer to hers and she closes her eyes. His face comes\ncloser, and closer.\n\n<b>ANOTHER ANGLE\n</b>\nOUR SARAH shrinks back from what she is seeing. She turns and runs,\npushing herself though the languid CROWD, right into the bubble\nitself.\n\n<b>57\tEXT: BALL - NIGHT\n</b>\nSARAH comes crashing through the bubble and the whole ballroom\ncrumbles. In seconds it resembles nothing so much as a junkyard.\n\n<b>58\tEXT JUNK CITY - NIGHT\n</b>\nSARAH runs through the streets of a part-market, part-junkyard. There\nare piles of rubble and junk everywhere, and between them are tents\nfrom which PEOPLE hawk objects of all kinds. Some of them approach\nSARAH and she pushes them away, sobbing.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH'S POV - A RED TENT, and standing in front of it is an OLD WOMAN\nstooped over from the objects piled high on her back. She beckons to\nSARAH and pulls the tent flap aside.\n\nJUNK WOMAN: 'Ere it is, Dearie. All the fings you want, all the fings\nyou need.\n\n<b>ANOTHER ANGLE\n</b>\nThe flap opens wider and inside the tent WE CAN SEE SARAH's room!\n\n<b>ANOTHER ANGLE\n</b>\nSARAH gasps at the sight and runs headlong into the tent. She trips\nover the threshold and lands face down on her bed.\n\n<b>59\tINT: SARAH'S ROOM - NIGHT\n</b>\nSARAH sits up on the bed and looks around the room. She shakes her\nhead and laughs.\n\nSARAH: What a dream!\n\nShe gets up and stretches, then walks over to the mirror. She smiles\nat her reflection.\n\nSARAH: Yep, you've got quite an imagination, kid, Just what a great\nactress needs.\n\nShe walks over to the bed and picks up Lancelot the bear.\n\nSARAH: How about a midnight snack, Sir Lance ...\n\nShe goes over to the door and opens it.\n\n<b>60\tEXT: JUNK CITY - NIGHT\n</b>\n<b>SARAH'S POV - THE MARKET/JUNKYARD TEEMING WITH ACTIVITY.\n</b>The JUNK WOMAN peers in.\n\nJUNK WOMAN: 'Aven't you got everythin' you need, Dearie?\n\n<b>61\tINT: SARAH'S ROOM - NIGHT\n</b>\nSARAH screams and slams the door. She buries her face in the bear.\n\nSARAH: It _is_ just a dream!\n\nShe takes a deep breath and goes to the door again. She opens it very\nslowly.\n\n<b>62\tEXT: JUNK CITY - NIGHT\n</b>\nSARAH'S POV - THE SAME TEEMING ACTIVITY. The JUNK WOMAN peers in\nagain.\n\nJUNK WOMAN: Best to stay in there, where it's safe, Dearie. Don't\nknow what might 'appen to you out 'ere.\n\n<b>63\tINT: SARAH'S ROOM - NIGHT\n</b>\nSARAH clams the door again and rushes over to the window. A GROUP OF\nREVELLERS peer in at her and laugh. She quickly pulls the curtains\nclosed and walks back to the center of the room. She stands clutching\nthe bear, then looks up at her reflection in the mirror.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH'S reflection. Herself as a very old woman, clutching a teddy\nbear.\n\nOLD SARAH: Best to stay in here where it's safe. Don't know what\nmight happen to you out there.\n\nSARAH steps back from the mirror and suddenly the floor becomes a sea\nof mud and all the objects in the room come falling down on her. As\nshe tries to rise out of the muck more objects land on and around her\nand pull her down.\n\nSARAH: Help! Somebody help me!\n\n<b>64\tEXT: JUNK CITY - NIGHT\n</b>\nLUDO and DIDYMUS desperately searching for SARAH, DIDYMUS riding his\n<b>DOG.\n</b>\n<b>65\tINT: TAVERN TENT - NIGHT\n</b>\nHOGGLE sits at a bar, drowning his sorrows. A JUNK MAN/BARTENDER\nworks behind the bar. HOGGLE slams his cup down.\n\nHOGGLE: Another!\n\nThe BARTENDER holds out his hand greedily. HOGGLE pulls a treasure\noff his belt and slams it on the bar. The BARTENDER pours.\n\n<b>66\tEXT: JUNK CITY - NIGHT\n</b>\nDIDYMUS and LUDO approach the red tent. They spy the JUNK WOMAN.\n\nDIDYMUS: Did you see a noble maiden pass this way?\n\nJUNK WOMAN: A noble maiden, eh? What would she be doin' in a place\nlike this?\n\nDIDYMUS: She's on a rescue mission ...\n\nThe JUNK WOMAN finds this hilarious.\n\nJUNK WOMAN: A rescue mission, ha! You're in the wrong place, for\nsure! The only fings we cares about rescuin' around 'ere is our\nworldly goods!\n\nShe takes an oil lamp off her back and shines it on her sleeve for\nemphasis.\n\n<b>67\tINT: SARAH'S ROOM - NIGHT\n</b>\nSARAH is drowning in a sea of junk. She hears DIDYMUS and cries out\nhopefully.\n\nSARAH: Didymus, in here! Help me!\n\nThe door opens and the JUNK WOMAN peers inside.\n\nJUNK WOMAN: Don't worry, Dearie. I sent 'im away!\n\nSARAH groans.\n\nJUNK WOMAN: Knew you wouldn't want to be leavin' your nice fings for\nno rescue mission.\n\nSARAH: Oh my god! Freddie!\n\nJUNK WOMAN: Freddie? Is that one of them dolls over there ... or that\nnice teddy?\n\nSARAH struggles for the door in the sea of junk.\n\nSARAH: No! He's my brother! And I've got to save him!\n\nShe continues pushing through the junk.\n\nJUNK WOMAN: No you don't, Dearie. You can stay right 'ere with all\nyour pretty fings ...\n\nSARAH knows what her choice has to be.\n\nSARAH: I know I can. (joyous) But I don't want to!\n\nShe lifts herself out of the junk with a mighty heave and stands in\nthe doorway. She looks down at the JUNK WOMAN triumphantly.\n\nSARAH: Now get out of my way!\n\n<b>68\tEXT: JUNK CITY - NIGHT\n</b>\nSARAH runs out of the tent, a look of triumph on her face.\n\nThe JUNK WOMAN pulls something off her own pile and holds it out to\n<b>SARAH.\n</b>\nJUNK WOMAN: Wait, Dearie! Look at this!\n\nShe holds out SARAH's music box, opens it, and the little DANCER\ntwirls inside.\n\nSARAH (grinning): Keep it!\n\nAnd she is off. As SARAH goes the CAMERA LINGERS on the JUNK WOMAN.\nAnd we begin to move around to her other side and even though we had\njust seen her from all sides, we now see something very, very\ndifferent. Where the other side of the woman should be WE SEE a\ncross-section of her, with JARETH inside. His head is beneath the\npile of junk and his hand is inside her head making it laugh. He is\nthe puppeteer operating the JUNK LADY, as indeed, she has been\noperated. JARETH is mad.\n\nJARETH: Damn.\n\n<b>69\tEXT: CASTLE GATE - NIGHT\n</b>\nLUDO and DIDYMUS sit forlornly at the gate. SARAH appears out of the\nnight.\n\nDIDYMUS: My lady!\n\nLUDO leaps to his feet.\n\nLUDO: Sarah ... safe!\n\nSARAH rushes into his arms.\n\nDIDYMUS: Is Hoggle not with you?\n\nSARAH pulls away from LUDO.\n\nSARAH: Hoggle made his choice, he's ... not part of the mission\nanymore.\n\nDIDYMUS (angry): The coward!\n\nLUDO: Hoggle ... good!\n\nSARAH shrugs, and smiles at him.\n\nSARAH: Maybe. But there's no time to discuss it. We've got a baby to\nrescue, remember!\n\nShe leads them through the gates.\n\n<b>70\tEXT: GOBLIN TOWN - NIGHT\n</b>\nStreets full of hovels encircle the castle. This is where the GOBLINS\nlive. As SARAH, LUDO and HOGGLE walk through the dark, eerie streets\nthey are met by the slamming of shutters and the extinguishing of\nlights.\n\nDIDYMUS: Methinks they are expecting us, my lady.\n\nA CHILD GOBLIN peers at them from an open doorway. A FEMALE GOBLIN\nsees him and drags him inside and slams the door.\n\nSARAH (grimly): Methinks you're right!\n\n<b>71\tINT: TAVERN - NIGHT\n</b>\nHOGGLE is still at it. He pulls his belt off his body and WE SEE that\nthe only treasure left is SARAH's plastic circlet. He slowly pulls it\noff and stares at it. The BARTENDER approaches, his eyes lighting up\nat the eight of this treasure.\n\nBARTENDER: Another?\n\nHOGGLE hesitates, then hands the circlet over. The BARTENDER bites it\nand his face lights up with glee.\n\nBARTENDER: Plastic!\n\nHe goes to get the drink and HOGGLE puts his face down on the bar and\nsobs.\n\n<b>ANOTHER ANGLE\n</b>\nAt the other end of the bar sits the WISE ONE. The HAT looks over at\nHOGGLE and shakes his head knowingly.\n\nHAT: Drinkin' to forget, eh, buddy?\n\nHOGGLE looks up.\n\nWISE ONE: To forget, ah yes. To suffer a mental lapse, to obliterate\nfrom one's consciousness, to suffer amnesia, a blank or fugue, to\ndrink the waters of Lethe ...\n\nHOGGLE (drunkenly): What's Lethe ...\n\nWISE ONE: The waters of forgetfulness. They remove from our minds\nwhat is too painful to remember ...\n\nHOGGLE looks thoughtfully at the drink in his hand.\n\nWISE ONE: ... but with the memory goes our wisdom, or knowledge, that\nwhich brings us understanding, also enlightenment ...\n\nBut there is no one to continue benefitting from the WISE ONE's\npearls. HOGGLE is gone.\n\nHAT: You can cool it down there ... he's gone ...\n\nWISE ONE: ... a grasp of things, a depth or profundity of thought ...\n\nThe HAT sighs and looks over at the BARTENDER who is still admiring\nhis plastic treasure.\n\nHAT: Another one over here ... and make it a double ...\n\n<b>72\tEXT: GOBLIN TOWN - NIGHT\n</b>\nSARAH, LUDO and DIDYMUS emerge into the vast courtyard outside the\ncastle. It in eerily quiet. Too quiet.\n\nSARAH: We're going to make it!\n\nDIDYMUS sniffs the air.\n\nDIDYMUS: I am less than sure ...\n\nThey are interrupted by a high-pitched shriek as a GOBLIN jumps on\nLUDO's back. Then the courtyard is filled with GOBLINS, what seems\nlike the whole army, coming right at them. DIDYMUS fends off the\nVANGUARD PARTY with his sword and LUDO punches out the ones that get\nby him. DIDYMUS unswords a GOBLIN and his weapon goes flying. SARAH\npicks it up and does some parrying of her own. But there are too many\nof them. The threesome turn and run.\n\n<b>73\tINT: CASTLE - NIGHT\n</b>\nJARETH stands by the window, watching the battle. The WHITE BIRD sits\non his shoulder. JARETH looks over at FREDDIE who stands holding on\nto the side of the cradle. JARETH smiles and turns back to the melee\nbelow. The BIRD flies out the window.\n\n<b>74\tEXT: GOBLIN TOWN - NIGHT\n</b>\nSARAH, LUDO and DIDYMUS race down the streets. The GOBLINS are in hot\npursuit.\n\n<b>75\tEXT: STREET - NIGHT\n</b>\nThey come careening around a corner and it seems that they have\nescaped their pursuers. The sound of the GOBLINS seems to be getting\nfarther away.\n\nSARAH: I think we lost them.\n\nThey turn and see that, unfortunately they have come full circle and\nare right back in the courtyard. LUDO climbs part way up a wall and\nlooks over the streets.\n\nDIDYMUS: What do you see, my brother?\n\nLUDO gulps. What he sees is the GOBLIN ARMY coming down every street\nright towards them.\n\nLUDO: Ludo ... see ... trouble!\n\nAnd then the trouble arrives and SARAH and DIDYMUS are heavily into\nswordplay. LUDO tries clumsily to get down and is tormented by\nGOBLINS who prick at him with their spears. SARAH looks up and sees\nhis predicament. She gets an idea.\n\nSARAH: Call the rocks, Ludo! Call the rocks!\n\nLUDO makes a heroic effort and gets to the top of the wall.\n\nHe then throws his head back and bellows.\n\n<b>76\tEXT: GOBLIN TOWN - NIGHT\n</b>\nAn enormous rumbling is heard and soon the streets are filled with\nboulders, all careening towards LUDO. They knock GOBLINS out of their\npath like so many bowling pins.\n\n<b>77\tEXT: COURTYARD - NIGHT\n</b>\nSARAH and DIDYMUS fight bravely. LUDO keeps bellowing and throwing\noff the occasional GOBLIN that is stupid enough to jump on him. Soon\nthe rocks reach the courtyard and form a barrier between the\nTHREESOME and their ATTACKERS. LUDO reaches down and lifts SARAH and\nDIDYMUS on to the wall. They jump and disappear into the castle\nenclave.\n\n<b>78\tINT: CASTLE - NIGHT\n</b>\nA door opens in a dark part of the castle. LUDO, SARAH and DIDYMUS\nenter. They look around and quickly tip-toe down a dark corridor.\nThey turn a corner and see some GOBLINS marching their way. They duck\nout of sight.\n\n<b>79\tEXT: CASTLE - NIGHT\n</b>\nThe main entrance to the castle. TWO-GOBLIN GUARDS stand outside the\nlarge wooden doors. The results of the THREESOME's escape can be\nheard in the distance. A FIGURE staggers out of the dark, singing\ndrunkenly. It is HOGGLE.\n\nHOGGLE: \" ... it's so cold in the night with no gold to keep me warm\n<b>... \"\n</b>\nHe trips over his feet as he approaches the GUARD.\n\nGUARD: Who goes there?\n\nHOGGLE \" ... so cold, oh so cold ... \"\n\nGUARD 2: Don't worry about him. He's on Jareth's payroll now.\n\nHOGGLE falls to the ground, then picks himself up.\n\nHOGGLE: Thash right. Jareth owes me sumthin' ... an' I'm here ta\ncollect ...\n\nThey laugh at him, then step aside and let him enter.\n\n<b>80\tINT: CASTLE - NIGHT\n</b>\nA GROUP OF GOBLINS stand in a circle in a corridor. They torment a\ntiny, fuzzy yapping CREATURE with their nipper sticks. The CREATURE\ngets away from them and goes scurrying down the corridor. The GOBLINS\nlaugh. It turns a corner and starts yapping for all it's worth.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH, LUDO and DIDYMUS pressed against the wall, trying to not be\nnoticed. Unfortunately the little CREATURE has no sympathy for their\nplight. It stands at their feet, making a ruckus.\n\nSARAH (whispering): Shut up, you little monster!\n\nLUDO bends down to pet it in the hopes of quieting it.\n\nLUDO: Nice ... thing ...\n\nBut the CREATURE doesn't want a pet. It sinks its teeth into LUDO's\nhand. LUDO howls.\n\nDIDYMUS: I fear that this means trouble.\n\nThe GOBLINS yell and start running down the corridor.\n\nSARAH: Run for it!\n\nThey are off, the CREATURE and the GOBLINS at their heels.\n\n<b>81\tINT: CORRIDOR - NIGHT\n</b>\nThe THREE are running for all they're worth. SARAH pulls the watch\nout of her pocket. It is on the 12:30.\n\nSARAH: Only a half hour left! We've got to find Freddie!\n\n<b>ANOTHER ANGLE\n</b>\nYet another GROUP OF GOBLINS running right toward them. They stop in\ntheir tracks and start running in the opposite direction.\n\n<b>82\tINT: INNER COURTYARD - NIGHT\n</b>\nThe THREE come careening into the long narrow inner courtyard.\nBalconies look down on it from the floor above. Opposite them is a\nlarge ornate door. They have a lead on the GOBLINS chasing them, but\nnot for long.\n\n<b>ANOTHER ANGLE\n</b>\nOn one of the balconies a particularly repulsive little GOBLIN laughs\nsadistically. The THREE look up and see the GOBLIN with his hands on\na huge lever. He pushes it down gleefully and the floor opens up in\nfront of the THREESOME. It appears to be a bottomless pit, too wide\nto leap across. Horrified they look behind them and see the GOBLINS\ngaining on them. And they're throwing spears! Suddenly there is a\ntriumphant yell from the balcony opposite the repulsive GOBLIN, and\nthen a FIGURE leaps off it swinging on a rope.\n\nSARAH: Hoggle!\n\nIt certainly is! He wrestles with the hideous GOBLIN and in the\nstruggle it falls screaming into the pit. HOGGLE then grabs the lever\nand it is not a second too soon. The pursuing GOBLINS are entering\nthe courtyard.\n\n<b>ANOTHER ANGLE\n</b>\nThe floor closes and the THREE run to the door. An enraged PURSUER\naims a spear at HOGGLE. He is hit. SARAH screams as LUDO struggles\nwith the door. It won't budge and he begins to smash his body against\nit.\n\n<b>ANOTHER ANGLE\n</b>\nA seemingly half-dead HOGGLE staggers to his feet and throws his body\non the lever. He appears to faint from the strain but the weight of\nhis body pushes the lever and the floor opens again.\n\n<b>ANOTHER ANGLE\n</b>\nThe enraged GOBLINS are stopped in their tracks by the yawning pit.\nThey hurl spears at the THREESOME but it is to no avail. LUDO smashes\ndown the door and they run in.\n\n<b>83\tINT: JARETH'S QUARTERS - NIGHT\n</b>\nSARAH, DIDYMUS, and LUDO carrying HOGGLE enter the room where we have\nseen JARETH and FREDDIE. They lock the door behind them. No one is\nthere and FREDDIE's cradle is rocking, as if someone had removed him\nonly moments before. LUDO places HOGGLE down and SARAH looks\nfeverishly around the room. She spots a door.\n\nSARAH: That's the only way he could have gone!\n\nShe runs to the door and LUDO and DIDYMUS follow.\n\nSARAH: No. I have to face him alone!\n\nDIDYMUS: But, my lady ...\n\nHe is interrupted by the sound of GOBLINS in pursuit. They start\ntrying to smash down the door. LUDO runs to it and presses his body\nagainst it. HOGGLE moans and DIDYMUS and SARAH run to his side.\n\nHOGGLE: I don't expect ya to fergive me, Missy, but ...\n\nShe puts her finger to his lips.\n\nSARAH: Forgive you for what? Saving our lives?\n\nHOGGLE: But, I betrayed ya, I gave ya that damned peach ...\n\nSARAH: Ssh! You did the only thing you could do ...\n\nShe looks down at his empty belt.\n\nSARAH: ... and I see you lost all your treasures in the process.\n\nHOGGLE: I don't care if I never sees another treasure again!\n\nSARAH (smiles): Here. Just in case you change your mind.\n\nShe slips off her mother's ring and presses it into HOGGLE's hand. He\nis overwhelmed and SARAH smiles at his pleasure.\n\nHOGGLE: And Jareth said ya could never love me.\n\nSARAH: Jareth doesn't know everything.\n\nShe leaps to her feet and HOGGLE moans.\n\nSARAH: Take care of him, Didymus.\n\nDIDYMUS: I'll guard the valiant Hoggle with my life!\n\nThe GOBLINS give the door a particularly loud smash and LUDO presses\nagainst the door even harder.\n\nLUDO: Ludo ... too!\n\nShe runs to the other door and stops to look back at them.\n\nSARAH: No maiden could have wished for nobler knights.\n\nAnd she is gone.\n\n<b>84\tESCHER ROTUNDA - NIGHT\n</b>\nSARAH enters an overwhelming room with many staircases, balconies and\ndoorways at different heights and at all kinds of strange angles that\nobviously have no relation to what we know as gravity. Her knees\nbuckling from vertigo. Then she gasps.\n\n<b>ANOTHER ANGLE\n</b>\nJARETH is sitting on the wall with all the ease of a fly.\n\nJARETH: I've been expecting you.\n\nSARAH stumbles and falls into the room, ending up on the ceiling. She\ntries to adjust to being upside down.\n\nSARAH: Where's Freddie?!!!\n\nShe has to look down and sideways to see JARETH and it is clearly\ngrueling.\n\nJARETH: He's right there.\n\nAnd he points to one of the stairways that juts out at a right angle\nfrom the wall. FREDDIE is climbing up the stairs happily, but from\nSARAH's point of view it looks like he will fall when he gets to the\ntop.\n\nSARAH (screaming): Freddie! No!!!\n\nFREDDIE gets to the top but doesn't fall, instead he ends up crawling\nup the wall. SARAH sighs with relief and closes her eyes. This sends\nher reeling and she ends up in one of the archways. She tries to\norient herself but there is no up, no down, no sideways. And the BABY\nis about to crawl off a balcony! SARAH screams and JARETH laughs. He\nbegins a song that tells SARAH she never really understood what was\ngain on. Nothing is what it appears to be, not even things like \"up\"\nand \"down.\"\n\n<b>ANOTHER ANGLE\n</b>\nFREDDIE in the most precarious-looking situation yet, at the top of a\nstaircase. He hesitates to crawl down, and to lure him, JARETH\ncreates a ball out of thin air and throws it to the BABY. Of course,\nit bounces up. And all the while his song is taunting SARAH. She\nturns away from him and looks into the large mirror framed in the\narchway. She sees endless SARAHS. And while she's looking, the first\nreflection runs to the left, the reflection behind that to the right,\nand so on all the way down the line. And SARAH's still standing\nthere! She falls backwards and ends up standing on the floor,\nwatching FREDDIE chase his ball across the ceiling. JARETH dances on\nthe wall now as he is about to finish his song. And there is FREDDIE\non one of the balconies facing out of the rotunda. If he falls off\nthat, he'll really fall! SARAH runs up the opposite wall and finds\nthat there is sheer space between her and the BABY. The only way to\nreach him is to jump. She looks at JARETH who grins at her, then at\nFREDDIE who is teetering on the edge. As JARETH comes to the end of\nthe song there is nothing to do but jump. She looks at JARETH and\ncan't repress a grin of her own.\n\nSARAH: Like the man said, \"nothing is what it appears to be!\"\n\nShe jumps.\n\n<b>85\tINT: JARETH'S CHAMBERS - NIGHT\n</b>\nSARAH falls right on to a magnificent huge bed. Opposite her JARETH\nsits in a chair. FREDDIE, wrapped in a blanket, is gurgling on his\nlap. SARAH reaches into her pocket and pulls out the watch. It is a\nfew minutes before 13. JARETH stands up.\n\nJARETH: There's still time.\n\nHe gestures to a clock on the wall that shows the same time as her\nwatch. He places FREDDIE into a cradle and comes over to the bed. He\nlooks down at her.\n\nJARETH: Besides, I'm no longer interested in having a little goblin\nprince. I've decided I'd much rather have a queen.\n\nHe looks into her eyes for a moment. SARAH doesn't look away.\nInstead, she slowly eases herself off the bed and stands facing him.\n\nSARAH (archly): A queen? Have you chosen anyone I know.\n\nShe glides by him and walks to the window. JARETH chuckles\nappreciatively.\n\nJARETH: You've come a long way, little girl.\n\nSARAH looks out at the labyrinth.\n\nSARAH: I certainly have.\n\nShe turns to face him.\n\nJARETH: Yes, I can see it in your eyes. (he moves closer to her) No\none else has ever made it this far in the labyrinth, no one else has\never been worthy ...\n\nHe takes her hand and brings it to his lips. She smiles\ndown at him.\n\nSARAH: What's your offer.\n\nJARETH stands quickly and looks at her. She certainly has come a long\nway!\n\nJARETH: Why, everything ... you'll rule by my side.\n\nSARAH: Everything? The chance to spend my life surrounded by\nrepulsive goblins ... the chance to torment innocent creatures ...\n\nJARETH (shaking his head): ... the chance to never have a care in the\nworld, to never have to do anything that you don't want to do.\n\nSARAH looks at him.\n\nSARAH: Anything else?\n\nJARETH (smiling): Why, me. Of course.\n\nSARAH surreptitiously eyes the clock. There is about a minute left.\nShe glides away from the window and tries to position herself closer\nto FREDDIE.\n\nSARAH: And what if I'm not interested?\n\nJARETH reacts with surprise for a moment, then shakes his head.\n\nJARETH: Impossible. I know you, I know what you want ...\n\nSARAH: Well, I've got news for you, Jareth.\n\nShe makes a beeline for the cradle.\n\nSARAH: I don't want _you_!\n\nShe's almost at the cradle but JARETH grabs her arm and stops her.\n\nSARAH (shocked, enraged): Why, you miserable creep!\n\nJARETH has hold of her arms but she breaks away and hauls off and\npunches him in the jaw. JARETH steps back, stunned. SARAH scoops up\nthe screaming FREDDIE.\n\nSARAH: How could you do this to an innocent baby?!!\n\nJARETH stands rubbing his jaw, snivelling, stunned.\n\nJARETH: You hit me!\n\nSARAH, FREDDIE in her arms, goes right up to him.\n\nSARAH: And I'd like to do more ... you, you ... !\n\nShe is furious and wants to hit him again badly. Since she has the\nBABY in her arms she makes do with kicking him hard in the shin.\nJARETH howls and grabs his leg.\n\nSARAH: I wouldn't want you if you were the last ... _goblin_ on earth!\n\nThe WHITE BIRD flies through the window and lands on SARAH's\nshoulder. JARETH puts his hands on his ears.\n\nJARETH: Don't say that!\n\nBut it is too late, he starts shrinking.\n\nJARETH: Look at me! (whining) How could you do this to me!\n\nBefore SARAH's eyes JARETH turns into an undersized, ineffective,\nsnivelling little GOBLIN. The features are those of a goblin, but\nstill recognizably JARETH.\n\n<b>86\tINT: CASTLE - NIGHT\n</b>\nJARETH's quarters, where DIDYMUS tends HOGGLE and LUDO still blocks\nthe door.\n\nJARETH (VO) (whiney scream): Why does everything have to happen to me!\n\nThey look at each other and suddenly LUDO realizes that the GOBLINS\nare no longer trying to break down the door. The THREE start to laugh.\n\nHOGGLE (proudly): She did it!\n\nThey cheer.\n\n<b>87\tINT: JARETH'S CHAMBERS - NIGHT\n</b>\nJARETH, the bratty little GOBLIN, is throwing a tantrum.\n\nJARETH: Nobody ever cares about what I want!\n\nThe walls and floor shake so from his pounding fists and feet that a\ncrack opens up right in front of SARAH's feet. She looks at the clock\nand the minute hand moves to the 13. She looks at FREDDIE. There's\nnothing to do but jump into the void. The clock begins to strike.\n\nSARAH: OK, Freddie. Time to go bye-bye!\n\nShe jumps.\n\n<b>88\tEXT: SKY - NIGHT\n</b>\nSARAH and FREDDIE spinning through the dark, starry sky. The striking\nof the clock continues.\n\n<b>ANOTHER ANGLE\n</b>\nCLOSE ON SARAH AND FREDDIE. SARAH pulls him closer, lovingly. And\nthey go on spinning.\n\n<b>89\tINT: NURSERY - NIGHT\n</b>\nSARAH is lying face down on the floor. She comes to slowly and tries\nto sit up. Groaning, she rubs her head where it bumped on the corner\nof the open drawer. She tries to focus, blinking her eyes.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH'S POV - Her eyes slowly focus on FREDDIE's crib. When she can\nsee, she gasps. FREDDIE's not there! The side of the crib is down and\nthe BABY is nowhere to be seen.\n\nSARAH: Freddie!\n\nShe leaps to her feet woozily. Still rubbing her head she staggers\nout into the hallway.\n\n<b>90\tINT: RAILWAY - NIGHT\n</b>\nSARAH looks down the hallway and suddenly her face breaks out into a\ndelighted grin.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH'S POV - LITTLE FREDDIE is crawling slowly, but determinedly,\ninto SARAH's room. When he gets to her bed he uses all his strength\nto pull himself up on to his feet by holding on to the bedspread. Be\nthen holds his hand out, trying to reach something.\n\n<b>ANOTHER ANGLE\n</b>\nSARAH makes her way toward her room, delight and wonder on her face.\n\n<b>91\tINT: SARAH'S ROOM - NIGHT\n</b>\nSARAH stands in the doorway looking down at FREDDIE.\n\nSARAH (softly): That's quite a journey you took, Freddie.\n\nFREDDIE looks up at her and makes a sound. He continues straining,\nand WE SEE that what he is reaching for is Lancelot, SARAH's bear.\nSARAH smiles, and lifts FREDDIE up. She sits on the bed, FREDDIE on\nher lap, and hands him the bear.\n\nSARAH: Here. It's yours.\n\nFREDDIE takes it happily.\n\nSARAH (smiling): You earned it.\n\nShe kisses his head and rocks him gently. Then she gazes out the\nwindow at the stars.\n\n<b>92\tEXT: HOUSE - NIGHT\n</b>\nThe light shines from SARAH's window. The WHITE BIRD flutters down\nfrom the starry sky. It perches in the tree beside the path.\n\n<b>THE END\n</b>\n<b>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Labyrinth</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Dennis Lee\" title=\"Scripts by Dennis Lee\">Dennis Lee</a>  <a href=\"/writer.php?w=Jim Henson\" title=\"Scripts by Jim Henson\">Jim Henson</a>  <a href=\"/writer.php?w=Terry Jones\" title=\"Scripts by Terry Jones\">Terry Jones</a>  <a href=\"/writer.php?w=Elaine May\" title=\"Scripts by Elaine May\">Elaine May</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Family\" title=\"Family Scripts\">Family</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Musical\" title=\"Musical Scripts\">Musical</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Labyrinth Script.html#comments\" title=\"Labyrinth comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:09:24.809064"}