{"title": "Last Samurai, The", "film_link": "/Movie Scripts/Last Samurai, The Script.html", "script_link": "/scripts/Last-Samurai,-The.html", "info_raw": "\n\nLast Samurai, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.36 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Logan  Edward Zwick  Marshall Herskovitz\nGenres  Action  Adventure  Drama  War\n\nRead \"Last Samurai, The\" Script\n\n\n", "script": "\nfor educational use only                                        for educational use only\n\n                                    www.script-fix.com\n\n\n\n\n                                 THE LAST SAMURAI\n\n                                           by\n\n                                      John Logan\n\n\n\n                                     Revisions by\n                           Edward Zwick & Marshall Herskovitz\n\n                                                                                  1.\nFade In:\n\nA BRIGHT BLUE TIGER\n\nSurrounded by a pack of dogs, ten of them snarling and gnashing their teeth.\nThe TIGER'S, eyes burn with fury as he wheels in a circle, lunging at one\ndog clawing at another, keeping them all at bay.\n\nSuddenly, the TIGER leaps over the dogs and transforms into a WHITE\nBIRD, soaring majestically into the sky.\n\n\nTHE FACE OF A JAPANESE MAN\n\n\nSits up into frame, sweating, waking from a dream. He is KATSUMOTO.\nWe will come to know him later.\n\nFade to black. CREDITS OVER.\n\nThe faint SOUND of a BRASS BAND.\n\n                                               WINCHESTER REP (V.O.)\n                           the leader in all forms of armament used by the\n                           United States Army. When you need a friend,\n                           Winchester is by your side.         .\n\nTHE FACE OF AN AMERICAN MAN\n\nAs he smokes a cigar, barely listening. CAPTAIN _NATHAN ALGREN,\nU.S. Army, ret, 36 years old and looking every da y of it. His eyes are lined\nand saddened. He takes a swig from a flask. He is BACKSTAGE at:\n\nINT. CONVENTION HALL              SAN FRANCISCO          DAY\n\nWhere a trade show is in progress. Scantily clad lovelies in red-white-and-\nblue undies demonstrate the nation's most important new export: arms.\nEvery weapon imaginable is on display: rifles, pistols, even howitzers. Banners\ndeclaim the virtues of Winchester and Springfield. Of Colt and Remington\nand Smith & Wesson. Crowds mill around a stage. where:\n\n                                             WINCHESTER REP\n                           Ladies and Gentlemen ... the Winchester\n                           Corporation is proud to bring to you... a true\n                           American hero. A patriot who has proven his\n                           gallantry time and again on the field of battle.\n\nLITTLE TIN SOLDIERS are all lined up. A mass of grey. Rebel troops\nsurrounding a band of blue Union cavalry. A large, metal diorama.\n\n                                             WINCHESTER REP\n                           I hope you will join us in welcoming ...Late of\n                           the U.S. Cavalry. The Savior of Sutter Hill ...\n                           Captain Nathan Algren!\n\nA last swig. Algren steels himself, then strides onstage as we reveal a banner:\n\n                                                                                     2.\nWINCHESTER PRESENTS: THE MIRACLE AT SUTTER'S HILL!\n\nGarish limelight from a row of foot lights illuminates Algren.\n\n                                            ALGREN\n                            My thanks, Mr. McCabe... Ladies and Gents.\n\nHe looks down at the little metal soldiers and begins to tell the story of the\nbattle that made him famous. His narration is halting, unsteady:\n\n                                                ALGREN\n                            ... On that fateful day, Johnny Reb had us in a\n                            spot, perched on the lonely top of Sutter's Hill,\n                            nothing but grey as far as the eye could see:\n                            Unhorsed and out of ammunition, I gazed down\n                            into the, um, mael... mael...\n                                      (squints to see better)\n                            -maelstrom below us, and saw them moving up.\n\nWe realize he is reading from cue cards. The little Rebel soldiers begin sliding\nup the metal hill.\n\n                                                ALGREN\n                            I knew it was fight or die. Into the teeth of the\n                            enemy or we would all be buried... buried ...\n                                      (loses his place, under his breath)\n                            Shit...\n                                      (finds it again)\n                            ...on the same hill with our comrades a1ready\n                            gone to Merciful Heaven...\n\nA sudden flash:\n\nAlgren's mind. The real battle of Sutter's Hill. The grim reality is ver y\ndifferent from the dashing tale. Union soldiers scream in agony. Those\nhorses still alive buck and froth at their tether.                      .\n\nAlgren, a lieutenant then, moves among the panicked, bloody men. He stops beside a\nPRIVATE, his brother, DAVID ALGREN, 19, blonde, not much more than a boy.\n\n                                             DAVEY\n                            They're coming, Nate.\n\nHe looks over the wall. Rebel troops are moving up the hill.\n\n                                            ALGREN\n                            Keep your head down.\n\n                                              DAVEY\n                                    (smiling)\n                            Papa alwa ys said we should've joined the navy.\n\n                                             ALGREN\n                            What'd he know?\n                                    (looks fondly at his brother)\n                            You watch me now. Do whatever I say. .\n\n                                                                                   3.\n\n                                             DAVEY\n                           Aye-a ye, lieutenant.\n\nAlgren punches his shoulder and moves on down the line. Nearby, Algren's\nfriend, SERGEANT ZEBULAH GANT, though severel y wounded, reloads\nhis revolver with the last of his ammunition.\n\n                                            GANT\n                           How're the horses?\n\n                                              ALGREN\n                           Better than you. Smell better, too.\n                                    (looks at him)\n                           Can you hold on, Zeb?\n\n                                              GANT\n                                     (fighting the pain)\n                           I got I choice?\n\nAlgren smiles sadly. His mend will die loon without medical attention.\n\nAlgren moves down the line, bullets whizzing overhead. He kneels beside\nCOLONEL BAGLEY, his commanding officer.\n\n                                            BAGLEY\n                                  (panicking)\n                           We need a flag. Find me a goddamn white flag!\n\n                                            ALGREN\n                           What are you talking about?!\n\n                                            BAGLEY\n                           Surrender, damn it! That's an order!\n\nBack to the convention hall:\n\n\n                                                ALGREN\n                           No thought of surrender among those boy.\n                           Better to die as God made us, we thought, as\n                           soldiers... So I gave the order. Mister Bugler,\n                           sound mount up. Mister Bugler, sound prepare\n                           arms. There were only thirty of us, but we had\n                           fire in us yet. I looked down the hill at the destiny\n                           ordained for us. And gave the order. Mister\n                                                             .\n                           Bugler, charge!\n\nThe little Union cavalry soldiers begin moving down slots in the hill.\n\nOn Sutter's Hill:\n\nAlgren leads a chaotic cavalry charge down the hill toward the advancing rebel\ninfantry -- artillery explosi ons - bullets snapping, trees shattering.\n\nAlgren's brother, Davey, rides beside him.\n\n                                                                                      4.\n\nThe wounded Sergeant Gant pulls himself up, waves his cap and yells.\n\nBagley remains cowering behind the stone wall.\n\n\nBack to the convention hall:\n\n                                              ALGREN\n                           And straight into them we went...\n\nOn Sutter's Hill :\n\nCarnage. Union and Confederate soldiers slam together, falling, drowning in mud\nand blood, stepped on by panicked hones.\n\nAlgren wields his saber in one hand and his revolver in the other, serving\ndeath on all sides.\n\n\nA soldier riding next to Davey is shot. A horse falls into a shellhole.\n\nBack to the convention hall:\n\n                                              ALGREN\n                           \"Hip-hip hurray\" we shouted, for we\n                           had spirit in us yet--\n\nMore flashes:\n\nAlgren slices right and left with his saber. He is a truly gifted swordsman.\n\nA tree branch knocks Davey from his horse. He sits, dazed, on the ground.\nAlgren kills a rebel soldier just as be is about to fire on him.\n\nSingle-handedly, be rallies his men, screaming orders, then lifts his wounded\nbrother onto the saddle beside him.\n\nHe leads them downhill toward safel y, Davey clinging to him for dear life.\n\nBack to the convention hall:\n\n                                             ALGREN\n                           Before they knew what hit them, we had broken\n                           through into the rear of the rebel army.\n\nOn Sutter's Hill:\n\nAlgren and his men gather in a copse of trees. They are giddy with the exhilaration\nof having survived.\n\n                                             DAVEY\n                           We did it, bro', WE DID IT! Whoeeeee!!\n\nAlgren's smile is shortlived, though.\n\n                                                                                   5.\n\nSUDDENLY, the woods ERUPT with gunfire. Trees are shredded.\n\n\nAlgren's men are literally cut to pieces-\n\nDavey is riddled with bullets, his dead body shielding Algren from harm until\nhe slides, lifeless, to the mud.\n\n                                                ALGREN\n                            Davey---!!!!\n\nMen and horses are torn apart -- they contort and writhe in agony ­ jerking\ngrotesquely as the bullets rip into them. Algren frantica1ly tries to locate the\nsource of this firepower. Then he sees:\n\nA Gatling Gun.\n\nSix barrels glisten like steel teeth. This early machine gun is the pinnacle of\ncurrent military might -- 60 rounds a second -- a triumph in engineering.\n\n                                        ALGREN\n                            AHHHHHHH--!!!!!\n\nWith insane courage, he wheels and charges the gun.\n\nBullets rip into horse and rider alike. Algren falls, lifeless, into the mud.\n\nBack to the convention hall:\n\n                                             ALGREN\n                            And the 23rd rode on to glory.\n\nApplause.\n\nAt the back of the hall three elegantly dressed JAPANESE MEN watch\nAlgren's performance. They wear Western frock coats and top hats\n\n                                               ALGREN\n                            Now let me: tell you, gentlemen, if there's one\n                            thing on earth I could have had with me on that\n                            glorious day, it would have been this beauty...\n\nAlgren holds up a Winchester repeating rifle.\n\nAt the back of the audience we note someone else watching Algren.\nSERGEANT ZEBULON GANT, whom we last saw on Sutter's Hill.\n\n                                               ALGREN\n                            The Winchester Model '73 lever-action rifle.\n                            15 shot capacity, one round-per-second,\n                            accurate at 400 yards. You'll note the\n                            patented loading port just beneath the\n                            cartridge chamber and the smooth\n                            cocking action. ...Lets' just see here--\n\n                                                                                          6.\n\nHe peers into the ejection port as he cocks the weapon and sights out over the\ncrowd.\n\nKA-BOOM!!! The report echoes among the screams of the ladies. Dust and\nglass fall from a rear chandelier.\n\n                                            ALGREN\n                           Smooth trigger action, too.\n\nAudience-members murmur nervousl y.\n\n                                             ALGREN\n                           This is, gentlemen, The Gun That Is Winning The\n                           West... Step on up and take a look. Mr. McCabe is\n                           here to answer any question and take orders. I thank\n                           you.\n\nLater...\n\n\nA Winchester representative is handing Algren an envelope.\n\n                                            WINCHESTER REP\n                           What the hell was that?\n\n                                              ALGREN\n                           Got their attention, didn't I?\n\n                                            WINCHESTER REP\n                           Boston in three weeks. And sober this time.\n\nHe goes. Algren immediately starts counting the cash.\n\nINT.           SEEDY HOTEL ROOM                      NIGHT\n\nAlgren sits alone on the bed. He takes out a leather-bound journal and begins to write.\n\n                                             ALGREN (V.O.)\n                           June 17th, 1876. The dead are with me tonight.\n                           They return each time I am obliged to tell their\n                           story.\n\nINT.            SQUALID BAR                NIGHT\n\nAlgren sips absinthe. He stares at the milky, green liquid before him.\n\n                                                 ALGREN (V.O.)\n                           I can almost see them in the shadows, their\n                           bodies whole and beautiful once more. Sometimes\n                           it's as if they call to me in a sweet invitation --\n\n                                                                                    7.\nEXT.                   GAS-LIT STREET              NIGHT\n\n\nAlgren walks in the fog. Sputtering gas lamps give an unearthly glow.\n\n\n                                             ALGREN (V.O.)\n                            \"We are dead,\" they whisper, \"and we are happy.\"\n\n\nINT.           SEEDY HOTEL ROOM                     NIGHT\n\nAlgren is back in the hotel room. From his small suitcase, he takes the\nMedal of Honor, looks at it for a long moment.\n\n                                              ALGREN (V.O.)\n                            \"Do not be afraid,\" they whisper. \"You have been\n                            dead, too.\"\n\nA sudden flash:\n\nWe are back on Sutter's Hill. Algren's slaughtered cavalry litter the bloody\nground, dead to the last man. A rebel army surgeon gives a cursory look at\neach body before it is loaded onto a wagon.\n\nAlgren's turn is no different than the others. He is declared dead and hoisted\nunceremoniously onto the pile of corpses.\n\nBack in the. hotel room.:\n\nAlgren sits, staring into the middle distance.\n\n                                              ALGREN (V.O.)\n                            Is this why they gave their lives? So that I might\n                            disgrace their memory?\n\nHe reaches into the suitcase and takes out a Colt revol ver. Stares at it, cracks\nthe cylinder to make sure it's loaded. His finger wraps around the trigger,\nthe barrel makes its wa y toward his head.\n\nAnd then, unaccountabl y, he is laughing.\n\n                                             ALGREN (V.O.)\n                            And why, after taking so many lives, do I find\n                            myself incapable of taking just one more?\n\nA KNOCK on the door. Algren shuts his eyes, then calls out.\n\n                                                 ALGREN\n                            Go awa y.\n\n                                              GANT (V .O.)\n                            Not exactly the greeting I imagined.\n\n                                                                                                                  8.\nAlgren looks up. He knows that voice. He carefully puts the revolver back into the suitcase and shuts it before\nopening the door.\n\n\n                                            GANT\n                           Thought you'd seen the last of me, I expect.\n\nAlgren is filled with emotion, which he tries to hide.\n\n\n                                              ALGREN\n                           Zeb...\n\nThey embrace.\n\n                                              ALGREN\n\n                           Sit. Please.\n\n\nGant moves to the proffered chair with a pronounced limp.\n\n                                               GANT\n                           ... Saw your little melodrama         toda y.\n                           Very inspiring... .\n\n                                            ALGREN\n                           Given up soldiering to become a critic?\n\nGant smiles and shakes his head.\n\n                                             GANT\n                           Got a job for you, unless you're running for\n                           office...\n\n                                              ALGREN\n                           I have I job.\n\n                                              GANT\n                           I mean a real job. Back in uniform.\n\n                                              ALGREN\n                           I' m retired.\n\n                                             GANT\n                           I don't mean a U.S. uniform.\n\nAlgren looks at him. Curious despite himself.\n\n\nINT.           RESTAURANT                  NIGHT\n\nGant leads Algren into a lush San Francisco restaurant. Flickering gaslight\nand trays of lobster. COLONEL BENJAMIN BAGLEY (whom we saw in\nflashback) sits with the three Japanese men. Bagley's hair has greyed. He\n\n                                                                                  9.\nhas his eye on a political future.\n\n                                             BAGLEY\n                            Nathan, good to see you.\n\n                                              ALGREN\n                                    (stunned)\n                            Colonel Bagley...\n\n                                              BAGLEY\n                            Sit down. This is Mr. Omura, from Japan, and\n                            his two associates who, so far as I can tell, don't\n                            have names...\n\nOMURA 40, is a handsome and intelligent man. He watches Algren closel y\nas Algren pours a glass or whiskey from a decanter.\n\n                                                BAGLEY\n                            They're looking to hire real American soldiers to\n                            create the first Japanese Imperial Army.\n\nAlgren looks at him.\n\n                                               BAGLEY\n                            Japan's got it in mind to become a civilized\n                            country and they're willing to spend what it takes\n                            to hire white experts to do the job right.\n\nAlgren takes a slow lip of whiskey.\n\n                                             BAGLEY\n                            Sergeant Gant has already agreed to serve. You\n                            would be m y second-in-command.\n\n                                             ALGREN.\n                            With approval from Washington, of course.\n\n                                               BAGLEY\n                            Both governments prefer to consider our mission\n                            unofficial. We'd be there as non-combatants\n                                               BAGLEY\n                                               (MORE)\n                            only, advisors to the Japanese officers. Help\n                            them with training, ordinance and the like.\n\n                                              GANT\n                            You ought to think about it., Captain. Unless\n                            you intend to take up a career in the theater.\n\n                                              ALGREN\n                            I have an agreement with the Winchester\n                            Corporation -- I'm sure these people have some\n                            concept of what an agreement is.\n\n                                                                               10.\n\nOmura suddenly speaks. His English is flawless.\n\n                                             OMURA\n                            You are paid seven dollars for each performance.\n                            You do, on average, fourteen performances a\n                            year. We will pay you 400 dollars.\n\n                                               ALGREN\n                            A year?\n\n                                               OMURA\n\n                            A month.\n\nAlgren looks at him. The figure, in 1876, is staggering.\n\n\nEXT              SHIP--OCEAN                     DAY\n\nA steamship chums its wa y across the great Pacific. Algren leans on the\nship's rail and looks out into an endless processi on of wa ves.\n\n                                               ALGREN (V.O.)\n                            June 23, 1876. It is impossible, standing here,\n                            not to appreciate one's, own insignificance.\n\nA dolphin crests the surface, arcing into the air.\n\n                                               ALGREN (V.O.)\n                            Here there is neither past, nor future. Only an\n                            oblivion of water.\n\nIn his tiny cabin, Algren finishes writing in his journal and takes out a\ndaguerreot ype of a HAUNTINGLY BEAUTIFUL BLOND WOMAN.\n\n                                              ALGREN (V.O.)\n                            And yet I ask myself, will the dead follow me\n                            across the ocean to this strange new land?\n\nHe stares at the woman in the picture.\n\n\nINT.            SHIP ­ CABIN                 DAY\n\n\nIn the main cabin, Algren sits with Gant and Omura. Algren is drinking.\n\n\n                                              OMURA\n                            ...After the Shogun gave up power, the daimyos ­\n                            you would call them warlords --knew that Japan\n                            needed a centralized government. So they asked\n\n                                                                                      11.\n                                            OMURA (CONT'D)\n                           the hereditary Emperor, His Highness the\n                           Enlightened Meiji, to lead the country.\n\n                                            ALGREN\n                           And these warlords just ... gave up hundreds of\n                           years of power?\n\n                                             OMURA\n                           Economic incentives were offered. Most\n                           provincial leaders saw the financial benefits of\n                           modernization.\n\n                                            ALGREN\n                           What about those that didn't?\n\n                                             OMURA\n                           To deal with those who have resisted, the\n                           Emperor has decided to create an Army with\n                           allegiance only to him... We considered hiring\n                           advisors from Germany, but your Ambassador\n                           reminded us of your experience in suppressing rebellious\n                           elements in your Civil War.\n\nThis evocation of the Civil War is not lost on Algren.\n\n                                          ALGREN\n                           Who are we supposed to be fighting against?\n\n                                            OMURA\n                           His name is Mori Katsumoto. He is samurai.\n\n                                             ALGREN\n                           Samurai?\n\n                                              OMURA\n                           The word you might use it \"warrior\". But that\n                           does not quite capture it ... Katsumoto once served\n                           the Emperor but he is now a traitor who leads a\n                           band of traitors. He must be punished.\n\nAlgren looks pointedly at Bagley.\n\n                                               ALGREN\n                           You told them about our experiences together\n                           on Sutter's Hill, did you, Colonel?\n\n                                           BAGLEY\n                           They know I was your commanding officer.\n                           Yes.\n\nAlgren glares at Bagley, then stands.\n\n                                                                                 12.\n\n\n\n                                             ALGREN\n                           Excuse me, gentlemen. I need some air.\n                                    (to Omura)\n                           I'm sure Colonel Bagley can amuse you with\n                           more stories of patriotic gore.\n\nHe walks away.\n\n                                                 OMURA\n                           He is insolent.\n\n                                             BAGLEY\n                           Get him in front of the troops, you'll see. Top\n                           of his class at West Point. Brilliant tactician.\n                           Even wrote a book.\n\n                                            OMURA\n                           Why did he leave your army?\n\n                                             BAGLEY\n                           What's a hero to do when there's no more great\n                           battles?\n\n                                              OMURA\n                           Is that an evasive answer?\n\n                                               BAGLEY\n                           Sir, this man was left for dead at Sutter's Hill.\n                           Doct ors swore his heart had stopped beating,\n                           but before they could bury him, he came back to\n                           life. After the war he fought the Sioux, the Cree,\n                           and the Blackfoot.\n                                   (leans closer)      .\n                           Point him at the enemy. He was born for it.\n\nINT.                SHIP -- ALGREN'S BERTH                      NIGHT\n\nAlgren lies in his cramped berth. Can't sleep.\n\nA sudden flash:\n\nOn the wagon of dead bodies, Algren's eyes open to stare into the unblinking\neyes of his brother, Davey, half his face shot off. He tries to move but be is\nburied beneath the weight of those piled on top of him. Blood drips down\ninto his eyes and mouth, blinding and choking him.\n\nBack to the ship:\n\nAlgren awakens, bathed in sweat. Terror. A silhouette in the doorwa y.\n\n                                                                                 13.\nColonel Bagley stands looking down at him.\n\n                                                BAGLEY\n                            I hope you realize the kind of second chance\n                            this is for you. I won't tolerate insubordination.\n\nAlgren reaches for a nearby glass, drains it.\n                                                ALGREN\n                            Court-martial me.\n\n                                              BAGLEY\n                            Would you rather I hadn't recommended you\n                            for the medal. Nathan? Is that it?\n\n                                             ALGREN\n                            We both know why you helped me, Colonel.\n                            Don't expect me to go all weepy with gratitude.\n\n                                              BAGLEY\n                            I expect you to do your job. Save the self-pity\n                            for your own time.\n\nHe turns and walks out, leaving Algren to stare at the empty glass.\n\n\nEXT.                 SHIP                       DAY\n\nAlgren and Gant stand at the rail.\n\n                                               GANT\n                            Hate boats. If the Lord bad wanted man to sail\n                            he wouldn't have created infantry.\n\n                                           ALGREN\n                            How many rimes you puke today?\n\n                                                GANT\n                            I'm down to two.\n\nOmura comes up next to them.\n                                                OMURA\n                            I understand you are a scholar, Captain Algren.\n                                     (to Gant)\n                            Have you read his book., Mr. Gant?\n\n                                                GANT\n                            Can't say I have.\n\n                                              OMURA\n                            An analysis of the triumph of weapons technology\n                            over antiquated military tactics.\n\n                                                                               14.\n                                              ALGREN\n                                    (wr y)\n                           A real page-turner. Sold twelve copies.\n\n                                               OMURA\n                           Nonetheless, I was impressed. I enjoy reading\n                           military history. I spent two years studying\n                           English at Princeton University.\n\n                                           ALGREN\n                           And where did you learn to speak Japanese?\n\n\nOmura is perplexed by Algren's remark, then realizes he is being kidded. He\nlaughs heartily. Algren laughs with him. A connection is made.\n\n                                              OMURA\n                           Yes, and in Japanese there are twenty-seven\n                           words for \"war.\" I will be impressed if you learn\n                           only half of them. .\n\nHe walks away. Algren watches him go. His face darkens.\n\n                                             ALGREN\n                           I got twenty-seven words too - Reb, Sioux,\n                           Pawnee, Blackfoot, Jappo. Only one language\n                           when it comes to war.\n\nEXT.               YOKOHAMA HARBOR                           DAY\n\nLike all Japan, Yokohama is at the cusp of a new era.\n\nAncient sampans and wooden schooners beside freighters and steamships.\n\nEXT.                YOKOHAMA ­ DOCK                            DAY\n\nAfter 23 days at sea, they are all glad to climb down the gangplank. The\nYokohama docks are a frenzy of languages and looks and smells and sounds.\nJapanese competes with German and English and French and Russian.\nWarehouses fl y the flags of a dozen countries.\n\nOne striking Japanese character dominates: the symbol for, Omura. It is seen\non buildings, warehouses, and the headbands of scores of laborers.\n\nA series of palanquins, litters carried by bearers, await our voyagers.\n\nAs does SIMON GRAHAM, a dissipated Englishman who has lived in Japan\nfor many yean. Slender and pale, with an occasional consumptive cough, in\nhis 50's, he wears a white linen suit, a bit worse for wear.\n\n                                              OMURA\n                           Captain Algren, this is Mr. Simon Graham. He\n                           will be your translator.\n\n                                                                                   15.\n                                            GRAHAM\n                          Pleasure, Captain.\n\n                                            BAGLEY\n                          You'll be quartered at the Embassy for now.\n\n                                          OMURA\n                          The Emperor will summon you at his pleasure.\n\nGraham ushers Algren and Gant into their own less-ornate version.\n\n                                            GRAHAM\n                          If you please, Captain...\n\n                                           ALGREN\n                           They're gonna carry us?\n\n                                            GRAHAM\n                          You're guests of the Emperor. You cannot walk.\n\nAlgren notes the hoods covering the faces of the palanquin bearers.\n\n                                            ALGREN\n                          Why the hoods?\n\n                                             GRAHAM\n                          So you won't have to burden your eyes by looking\n                          at slaves. Oh, excuse me, they're servants now.\n                                    (coughs, wipes a bit of blood)\n                          This wa y, gentlemen...\n\nINT /EXT            PALANQUIN - YOKOHAMA STREETS                             DAY\n\nTheir bearers maneuver them through the bustling streets of Yokohama.\nWhite face painted geishas walk alongside bearded Russians. Traditional\nJapanese kimonos alongside European suits and hats, schizophrenic world\nof ancient Japan versus modern commercialism.\n\n                                            GRAHAM\n                          Twenty years ago Yokohama was a lovel y little\n                          port. Then your Commodore Perry arrived and\n                          changed all that.\n\n                                             ALGREN\n                          All this in twenty years?\n\n                                             GRAHAM\n                          Japan has...embraced... Western wa ys. Hired\n                          lawyers from France, doctors from Germany,\n                          naval architects from Britain, civil engineers,\n                          railway designers, scientists, teachers. And, of\n                          course, warriors from the United States.\n\n                                                                                      16.\n                                             ALGREN\n                           Buying the future.\n\n                                              GRAHAM\n                           Or selling the past...\n\n\nINT.            GUEST QUARTERS                       DAY\n\nA shoji screen is opened by a bowing servant to reveal the clean, classic lines\nof a Japanese room. Algren is about to enter when Graham stops him,\nindicating for Algren to remove his boots.\n\nAlgren scowls, confused, and struggles to pull off the high, filthy boots. He takes\nin the foreigness of the room, an arrangement of fl owers on a low table.\n\n                                             ALGREN\n                           No chairs? . .\n\n                                               GRAHAM\n                           Correct. And this--\n                                     (points to a mat)\n                           ..is your bed.\n\n                                             ALGREN\n                           And this?\n\n\nHe points to a block of wood.\n\n                                             GRAHAM\n                           Your pillow.\n\n                                            ALGREN\n                           You mean to say there are no real beds in Japan?\n\n                                               GRAHAM\n                           For its entire history Japan his been completely\n                           aakoku, I \"closed country.\" Thirty years ago, if\n                           you had washed up on Japanese soil... you would\n                           have been beheaded on sight. Now, they let you\n                           keep your head... and give you a wooden pillow.\n\nEXT.           AMERICAN EMBASSY-. GARDEN                     DAYS LATER\n\nIn the pristine grounds of the Embassy, a garden party is in progress.\nIncongruous lilting Yankee tunes are heard from the Japanese band.\n\nAlgren and Gant, now in their dress uniforms wander through the party with Graham.\nLiveried servants pall trays of canapés.\n\nElsewhere we see diplomats representing all the powers currently trying to devour\nJapan: Russia; England; Germany; France; Spain; etc.\n\n                                                                                                     17.\n                                           GRAHAM\n                          I remember when it was just America and the\n                          Dutch. Now ever ybody' s getting into the game.\n\nThey pass two German diplomats. The Germans glance to Algren and Gant with suspicion, bow tersely.\nGraham greets them in German.\n\n                                          GRAHAM\n                          The Germans are particularly eager.\n\n                                          ALGREN\n                          What do they want?\n\n                                           GRAHAM\n                          Same thing your country wants. Most favored\n                          nation status.\n\n                                          ALGREN\n                          How long have you been in Japan?\n\n                                               GRAHAM\n                          Oh, western time quickly loses its meaning here\n                          ... I first came as part of the British legation in 1857.\n                          But I was soon relieved of m y position, as a result\n                          of various...disagreements with the\n                          Crown's attitude toward the locals.\n\n\nOmura separates himself from his entourage and approaches.\n\n\n                                             OMURA\n                          Gentlemen. I hope you are enjoying a taste of\n                          home.\n\n                                           ALGREN\n                          I've done with worse, believe me.\n\n                                             OMURA\n                          America has much to offer us, though. Its'\n                          industry and ingenuity are without peer.\n                                   (ingratiating)\n                          I have spoken to the Emperor about you. He is\n                          interested in the most modem theories of warfare.\n\n                                             ALGREN\n                          I look forward to the opportunity of meeting\n                          him someday.\n\n                                           OMURA\n                          You will have that chance sooner than you think.\n                          He has requested an audience.\n\nGraham is open-mouthed at this turn of events.\n\n                                                                                       18.\n\nEXT.                  IMPERIAL PALACE                          DAY\n\nAlgren and Bagley sit with Graham in an ornate carriage as they cross the\nmoat and enter the ancestral palace of the Shoguns.\n\nINT.                   IMPERIAL PALACE ­ ANTECHAMBER                            DAY\n\n\nAlgren waits with Bagley and Graham outside the throne room.\n\n\n                                            GRAHAM\n                          Remember that he is arahitogami. A god in\n                          human form. During the last two hundred years\n                          no emperor was even seen by commoner. You\n                          may look at him, with deference, but do not speak\n                          unless you are spoken to.\n\nEXT.          IMPERIAL COURT -- THRONE ROOM                      DAY\n\nAlgren and Gant are surprised to discover the living god is barely in his\ntwenties. The divine EMPEROR MEIJI is an intelligent and curious young man,\nyet there is a tentativeness about him.\n\nHis throne is surrounded by ADVISORS, principal among them is Omura.\nNearby, the American AMBASSADOR SWANBECK a cagey diplomat\n\nThe throne room itself is sweeping, beautiful, and extremely restrained. Everywhere,\ntasteful displays of the traditional flower of the monarchy: chrysanthemums.\nThe vibrant yellow bl ossoms haunt the chamber.\n\nAs the Emperor considers his guests, Omura whispers into his ear. Then:\n\n                                              OMURA\n                          The Emperor bids you welcome. He wishes you\n                          to know that he is most grateful for the assistance\n                          your country offers ours, in order to rid ourselves\n                          of the brutality of the provincial warlords - and\n                          to accomplish the same national harmony which\n                          you enjoy in your homeland.\n\nThe Emperor speaks in Japanese. The advisors are non-plussed, and Omura leans down\nfor a moment to confer with him, then smiles indulgently:\n\n                                           OMURA\n                          The Emperor is most interested in your American\n                          Indians, and wishes to know if you have seen\n                          them firsthand.\n\nAlgren looks at Graham, who nods. He may speak.\n\n                                                                                   19.\n                                             ALGREN\n                           I have seen many of them, and have fought them,\n                           too. They are very brave.\n\nGraham translates. The Emperor nods and smiles.\n\n                                              EMPEROR\n                                    (accented English)\n                           Thank... you... very ...much.\n\nHe stands. Everyone else hurries to follow suit. The audience is over.\n\n\nEXT.               PALACE GARDEN                       DAY\n\nA1gren, Graham, and Bagley walk through the palace grounds.\n\n                                            BAGLEY\n                           That young pup runs this country?\n\n                                             GRAHAM\n                           That \"pup\" runs the country no more than I do.\n                           He was installed as a figurehead at age twelve\n                           when the warlords realized Japan needed a central\n                           government. But don't be fooled -- he may be a\n                           powerless god, but to these people he's a god\n                           nonetheless.\n\nGENERAL YOSHITAKA appears. He is a seasoned soldier in his 40's. A\ndecent man. He stops before them, bows quickly.\n\n                                             GRAHAM\n                           Gentlemen, may I present General Yoshitaka.\n                           He will assist you in training the army.\n\n                                             ALGREN\n                           General.\n\nAlgren offers his hand. General Yoshitaka does not take it. He bowl his head and\nspeaks a few words. Graham translates:\n\n                                             YOSHITAKA/GRAHAM\n                           He greets you with extreme courtesy and asks if\n                           you are ready to meet the Imperial Army.\n\n\nEXT.           PARADE GROUND                            DAY\n\nAbout a thousand Japanese soldiers in baggy uniforms are milling around a large\nparade ground. Each has an old single shot rifle. Algren, Gant, and Yoshitaka\nlook down on them from a reviewing stand.\n\n\n                                             GANT\n                           Jesus....\n\n                                                                                          20.\n\n                                             ALGREN\n                            Ask the General what training they' ve had.\n\nGraham speaks to General Yoshitaka, then translates his response.\n\n                                                YOSHITAKA/ GRAHAM\n                            He sa ys... We have trained them not to shoot\n                            their ...asses off.\n\nAlgren glances to General Yoshitaka, who looks back wr yl y.\n\n\n                                               ALGREN\n                            Sergeant Gant, have the men stand to attention.\n\n                                            GANT\n                            Imperial Army, Atten-tion!\n\nGraham translates, rather mildly.\n\n                                              ALGREN\n                            For God's sake, let's not keep it a secret who's in\n                            charge here ... Mr. Gant.\n\n                                           GANT\n                                   (roars)\n                            ALL RIGHT YOU SLANTY-EYED LITTLE\n                            BASTARDS STAND UP STRAIGHT OR I\n                            WILL SHIT-KICK EVERY ONE OF YOU\n                            COCKSUCKERS!!\n\nAs the soldiers immediately stand to attention, we begin a montage of the training\nof the first Imperial Army:\n\nWe see Gant drilling the men. Shouting at his translator. Trying to get them to march\nin formation. Algren is nearby, watching.\n\n                                               ALGREN (V.O.)\n                            August 4,1876. As I watch this new army train,\n                            I cannot help but think of those who rode with\n                            me in me 23rd cavalry.\n\nAlgren sits in his tent, writing in his journal. Outside, the Japanese are being taught\nthe basics of firing tactics.\n\n                                              ALGREN (V.O.)\n                            For four years they had survived, never once\n                            shrinking from the fire. And so, when given my\n                            order to charge the advancing rebel infantry,\n                            they never hesitated. ...And they all died.\n\nWe see Algren showing the Japanese how to fire in formation. The old single-shot\nrifles they carry make reloading a painfully slow process.\n\n                                                                                    21.\n\n\n                                            ALGREN (V .O.)\n                           Now I am training another army. In another\n                           civil war.\n\nAlgren and Gant spar with sabers - Algren's expertise far exceeds Gant's, a\nfact which Gant accepts with good humor.\n\n                                             ALGREN (V.O.)\n                           Is this why I was spared? Once again to lead\n                           men to their death?\n\nIt is sunset Algren, Graham, and General Yoshitaka watch the training.\nGeneral Yoshitaka speaks.\n\n                                               YOSHlTAKA/ GRAHAM\n                           ... the problem is they're peasants. They have\n                           never had this sort of responsibility or power.\n\nAlgren watches Gant march beside the Japanese. They are illuminated by the\nmajestic red sunset\n\n                                            ALGREN\n                                   (to Graham)\n                           Ask him if they have a flag.\n\nGraham translates. Genera1 Yoshitaka responds.\n\n                                               GRAHAM\n                           No flag.\n\n                                               ALGREN\n                           They need a flag.\n\nEXT.                TOKYO ­ STREET                           EVENING\n\nTokyo is a city in chaos. Everything seems out of balance. Dystopic. A\ncollision of Eastern and Western. Algren and Gant watch as Graham prepares\nto take a photograph of an old merchant in front of his store.\n\n                                                GRAHAM\n                           ... I've been doing this for years. Trying to capture\n                           it before it's all gone. Afraid I'm losing the battle.\n\nAlgren silently watches the passers-by. Something draws his attention:\n\nAcross the street. a man is striding down the crowded sidewalk. His martial\nbearings, two swords, traditional dress and unique top knot of hair instantly\nidentify him to us as a samurai.                                       .\n\nWe will meet him again later, he is UJIO. A terse, grim man in his 40's. His\nproud gait and rigid, imperious manner intrigue Algren.\n\n                                                                                                        22.\nMost of the people on the sidewalk instantly step out of the wa y, bowing in deference. But two young\nJapanese in Western dress do not.\n\nUjio stands before them, waiting for them to move. They don't.\nTense words are exchanged. Ujio glares at them. Algren watches.\n\n                                              ALGREN\n                           Mr. Graham...\n\n                                             GRAHAM\n                           Ah... now this should be interesting... He's\n                           waiting for them to show deference.\n\nAcross the street, Uji o barks out some harsh commands to the two\nJapanese men. They laugh in response. Then one of the men raises a hand\nand barks some clearly disrespectful words back--\n\nLike lightning-- Ujio pulls out his long samurai sword - it flashes --\n\nCleanly beheading the disrespectful Japanese man --\n\n\nThe beheaded corpse begins to fall--\n\nIn one smooth motion, Ujio wipes his blade clean of the corpse as it falls\nand sweeps it back into its scabbard. The other man immediately drops to\nhis belly, prostrating himself.\n\nWithout another glance, Ujio walks awa y. His face is completely impassive.\n\n                                            GANT\n                           What the hell was that?\n\n                                              GRAHAM\n                            That...is a samurai.\n\nINT.          RESTAURANT                         NIGHT\n\nSergeant Gant gazes unhappily at his dinner: glistening raw fish; tepid\nbeancurds; boiled rice. Algren, Gant, Graham, and General Yoshitaka sit\ncross-legged on the floor. Gant finds this extremely uncomfortable.\n\n                                              GRAHAM\n                           ... Before the edicts ever y citizen had to prostrate\n                           himself in the presence of a samurai.\n\n                                             ALGREN\n                           What edicts are those?\n\n                                            GRAHAM\n                           The Council of State has been passing a series\n                           of laws designed to eliminate the samurai.\n\n\n                                              GANT\n                           Why?\n\n                                                                               23.\n\n                                             GRAHAM\n                           Because you are here now, Sergeant... For the\n                           last 800 years guarding Japan and fighting her\n                           wars was the exclusive occupation of the samurai.\n\nThe next course arrives. Thick, black eel. Gant groans.\n\n                                              GRAHAM\n                           Men like Mori Katsumoto were the most elite\n                           caste in Japanese societ y until the Council of\n                           State -- led by your friend Omura - decided the\n                           whole class had to go ...\n                                     (munching eel)\n                           ... Most of the samurai accepted the new laws.\n                           But some didn't. Or couldn't. Like Katsumoto.\n\nGeneral Yoshitaka speaks up. Graham translates:\n\n                                             GRAHAM\n                           General Yoshitaka bids you to remember that\n                           the word samurai means \"one who serves.\" Their\n                           whole existence is based on serving their\n                           country as warriors.\n\nGraham finishes translating, then continues on his own:\n\n                                              GRAHAM .\n                           Your Imperial Army is taking awa y their only\n                           reason for being ... So what are they to do now?\n\nAlgren considers this as he pours another cup of sake.\n                 .\n                                             ALGREN\n                           This is sake?\n\n                                              GRAHAM\n                           Sake. Rice wine.\n\n                                              YOSHITAKA\n                           Hie! Sake.\n\n                                              ALGREN\n                           Sake..\n                                    (to Yoshitaka)\n                           Good.\n\nYoshitaka nods. Enthusiastically tries an English word.\n\n                                              YOSHITAKA\n                           Good!\n\n                                                                               24.\n                                              GRAHAM\n                           Vexing people, the samurai. Blood-thirsty,\n                           honorable, cruel, fabulousl y artistic. Wanted to\n                           write a book about them for years, but no\n                           Westerner can get close enough.\n\n                                            ALGREN\n                           Ask him if he ever saw a samurai in battle.\n\nGraham looks at A1gren.\n\n                                               GRAHAM\n                           He is samurai.\n\n\nAlgren looks at Yoshitaka with new eyes.\n\nEXT.                TOKYO ­ STREET                 NIGHT\n\nLater that night.\n\nAlgren and Gant, a little drunk by now, wander Tokyo's bustling red light\ndistrict. Like Amsterdam, the geishas sit in windows facing the street.\n\nINT.                 GEISHA HOUSE                    NIGHT\n\nThis is certainly not the whorehouse they expected. Elegant Japanese\nfurnishings. Lovel y flute music. The MADAM lowers her head and speaks\nquietly in greeting.\n\n                                            GANT\n                           My friend and I were looking for some\n                           companionship...\n\nThe Madam speaks no English. Gant speaks louder, as if to a deaf person.\n\n\n                                             GANT\n                           Ladies of the evening? Hootchie-contchie?\n                           Boom-Boom?\n\n                                            ALGREN\n                                    ( embarrassed)\n                           Zeb.\n                                     (tries a bow to the madam)\n                           ...so sorry.\n\nGant flashes a fistful of Japanese currency.\n\n                                            GANT\n                           Universal language. boyo.\n\nThe Madam nods and bows. Almost magically, two beautifully-dressed\nGEISHAS appear, their faces are painted pure white.\n\n                                                                                     25.\nOne of the Geishas smile. Her teeth are blackened, to better set off the\nwhiteness of her face paint\n\n                                                GANT\n                            That one's yours.\n\nINT.             GEISHA HOUSE ­ ROOM                        NIGHT\n\nAlgren and Gant are led into an elegant room with paper screens, and a table\nset for the Japanese tea ceremony.                                               .\n\nGant tries to take the arm of one of the geishas - but she moves awa y,\ngesturing for him to sit The other begins the tea ceremony.\n\n                                                ALGREN\n                            No tea... Sake.\n\nA musician plays a traditional lute. The geisha begins a graceful fan dance.\n\n                                             GANT\n                            Fan dance. Saw this once in Chicago.\n\nAlgren smiles at the Geisha preparing the. She smiles back. Algren pours\nhimself a cup of sake.\n\nLater...\n\nThe sake bottle is empty. The interminable lute music continues.\n\nGant is increasingly agitated as the geisha continues her dance. Algren can't\nhelp but laugh at his frustration. Finally Gant has had enough. He rises, a\nbit unsteady from the sake.\n\n                                              GANT\n                            Okay, darlin' time to get down to business:\n\nHe shoos the musician out of the room, then approaches the geisha, who\nshrinks from his intention.\n\n                                               ALGREN\n                            Zeb. I don't think she --\n\n                                               GANT\n                            She's just shy. Who knows what we white devils\n                            have got in our trousers, eh, darlin'?\n\nHe takes her arm. She resists - her voice rising.\n\n                                                GANT\n                            Come on, now.\n\nHe tries to pull her along. Her kimono tears. She calls out in terror. Two men\n\nappear, bouncers presumably, but alight of build.\n\n                                                                                    26.\n\n                                             ALGREN\n                           Oh, shit.\n\nThe Madam yells angrily at Gant in Japanese. Pushing him out roughly.\n\n                                            GANT\n                           Now, hold on there, sister. I paid good money.\n\nOne of the bouncers puts his hand, politely, on Gant's arm.\n\n                                             GANT\n                           Back off, short-stuff.\n\nThis time, the bouncer is more insistent. Gant takes a swing at him. Wrong\nmove. Before Gant knows what hit him, the little man uses Gant's\nmomentum in an akido move to flip him to the mat, hard.\n\nAlgren can only stare, in awe, at the lethal move. As the second bouncer moves\nto confront him, bowing apologetically, Algren speaks in English, smiling,\nknowing they can't understand a word he's saying.\n\n                                            ALGREN\n                           Obviousl y you can kick the shit out of people\n                           much larger than you, so we'll be leaving now...\n\nEXT.               _PARADE GROUND                             DAY\n\nThe training continues. We see Gant, now sporting a black eye. Algren\nwalks with General Yoshitaka and Graham. Graham translates:\n\n                                           YOSHITAKA/ GRAHAM\n                           The General wishes to know if you bad a pleasant\n                           evening?\n\nAlgren looks at Yoshitaka, who gives him. wry look..\n\n                                              ALGREN\n                           It was... educational\n                                     (Yoshitaka nods)\n                           Would the General mind telling me more about\n                           our common enemy?\n\nYoshitaka looks at him. Has Algren deliberately used the word, \"enemy,\"\nknowing that Yoshitaka, too, is a samurai? Algren gives nothing awa y.\n\n                                              YOSHITAKA/GRAHAM\n                           ... Mori Katsumoto is an extremely charismatic leader.\n                           To those who honor the old ways, he's a hero. His\n                           force is estimated at about five hundred and growing\n                           by the day. All samurai.\n\n                                           ALGREN\n                           What kind of man is be?\n\nGraham translates. General Yoshitaka considers his words.\n\n                                                                              27.\n\n                                              YOSHITAKA/GRAHAM\n                           Katsumoto has no fear. He has no pity. He is\n                           kotsutai-- the soul of old Japan ... He is my\n                           honored kinsman.\n\n                                             ALGREN\n                           Kinsman?\n\n                                             YOSHITAKA/GRAHAM\n                           We grew up together in Yoshino. Marched\n                           together and fought together. He is Kaishaku\n                           the brother of my spirit.\n\nAlgren considers this as they observe rifle practice. Erratic but\nimproving. Algren notes Yoshitaka's reaction. The rifles seem to make\nhim unhappy.\n\n                                           ALGREN\n                           Ask him what kind of guns Katsumoto has.\n\n\n                                            GRAHAM\n                           The samurai don't use guns.\n\n                                            ALGREN\n                           No, ask him what kind of firearms they have.\n\nGraham obliges. Yoshitaka responds, with disdain:\n\n                                            YOSHITAKA/GRAHAM\n                           The samurai no longer dishonor themselves by\n                           touching firearms.\n\nAlgren is surprised at this bit of information. A servant approaches, bows.\n\n                                            GRAHAM\n                           Colonel Bagley requires you.\n\nINT.               TENT              DAY\n\n\nColonel Bagley and Algren stand at a map. Omura sits.\n\n                                             ALGREN\n                           They're not a fighting unit yet\n\n                                               BAGLEY\n                           We have no choice.\n                                (refers to the map)\n                           --the railroad has been stopped here. Just as it\n                           entered Yoshino, Katsumoto's province.\n\n                                                                                   28.\n                                                  OMURA\n                           Captain, we     cannot govern a country in which\n                           we cannot tr    avel freel y. ... Katsumoto's\n                           provocation     is strategic. His defeat will\n                           demonstrate     to the other disloyal samurai that\n                           resistance is   an act devoid of honor.\n\n                                             BAGLEY\n                           The rebels don't have a single rifle. They're\n                           savages with bows and arrows. You get up there\n                           and show 'em how it', done.\n\n                                              ALGREN\n                           With respect, sir, I need more time.\n\n                                             OMURA\n                           With all due respect. this railroad cannot wait.\n\n         He bows and leaves them alone. Bagley spins on A1gren.\n\n                                             BAGLEY\n                           You think we're the only country interested in\n                           Japan?! You don't think the Germans and the\n                           French would like to oversee the new army?\n\n                                                ALGREN\n                           Colonel--\n\n                                              BAGLEY\n                                     (brutally)\n                           Why do you think we're here, Captain? Because\n                           Remington and Colt and Winchester have\n                           powerful allies in Washington. We're here to\n                           sell a shitload of American guns...and steel...and\n                           timber. That shouldn't be bud for a Winchester\n                           whore like you to understand.\n\nAlgren looks at him, murderously.\n\n                                                ALGREN\n                           Yes, air.\n\n\n\nEXT.                    RUINED VILLAGE                               DAY\n\nA STEAM ENGINE lends plumes of smoke into the air as it waits. Algren,\nBagley, and General Yoshitaka ride along the railroad line.\n\nThe Imperial Army follows, with Sergeant Gant, on foot.\n\nA traditional Japanese village is being torn aside to make room for the railroad\nline. Houses are being leveled and black smoke drifts up. The displaced\nvillagers gather belongings. Omura guards herd them about rather bruta1ly.\n\n                                                                                 29.\nRailroad workers are laying a new spur, building a brick station. A1gren notes\nthe by now familiar Omura symbol on the new water tower and on the\nheadbands of the guards and workers.\n\n                                            ALGREN\n                          What is that sign?\n\n                                             GRAHAM\n                          It's the symbol for the Omura Zaibatsu.\n\n                                            ALGREN\n                          Zaibatsu?\n\n                                            GRAHAM\n                          Old family businesses that own ever ything worth\n                          owning. The molt powerful is the Omura\n                          Zaibatsu. That's your friend, Omura.\n\n                                            ALGREN\n                          They own all of this?\n\n                                            GRAHAM\n                          They do now.\n\nSEVERED HEADS on pikes line the road, a warning to those who continue\nto resist\n\n                                           ALGREN (V.O.)\n                          October 24,1876. Today we entered Kansai\n                          province. Here the local warlords have all been\n                          convinced to accept the emperor's rule.\n\nThey pass a particularly wrenching sight. Villagers kneeling outside what\nused to be a Shinto temple. The railroad tracks cut straight through it.\n\n                                            ALGREN (V.O.)\n                          Our destination is Yoshino, home of the rebel\n                          Katsumoto. Protected by high mountain passes,\n                          it can be reached only during the summer\n                          months, and even then with great difficulty.\n\nThe Army moves on. Ahead are towering mountains.\n\n\nEXT.                    MOUNTAIN PASS                          DAY\n\n\nThe Imperial Army winds its way up I steep mountain pass.\n\n                                             ALGREN (V.O.)\n                          A long march. And then a battle. A new enemy,\n                          but the same feeling I had in my guts at twenty-one,\n                          in the cornfield at Antietam -- men will die\n                          here, today, and will I be among them?\n\n                                                                                  30.\n\nEXT.                    MOUNTAIN PLAIN                        MORNING\n\nFog. Obscuring everything.\n\nAlgren and Bagley, on horseback, wait with Graham. General Yoshitaka and\na few Japanese Commanders are mounted as well. The thousand strong\nJapanese Army is on foot They stand, rifles ready.                            ,\n\n                                        ALGREN\n                                   (to Graham)\n                           Ask him how they'll come at us.\n\nGraham speaks to General Yoshitaka. Yoshitaka responds:\n\n                                             YOSHITAKA/ GRAHAM\n                           They'll come straight on. They will push forward\n                           and keep on attacking... And he adds that there\n                           is no samurai word for \"retreat.\"\n\nAlgren prepares himself.\n\nThey wait.\n\nGeneral Yoshitaka is suddenly alert. He speaks quietly to Graham.\n\n                                              YOSHITAKA/GRAHAM\n                           He sa ys they're coming...\n\nAlgren gazes into the thick fog ahead, sees nothing. Bagley looks worried.\n\n                                             BAGLEY\n                           Captain Algren, have you posted a rear guard to\n                           protect our supply train?\n\n                                             ALGREN\n                           Yes.\n\n                                           BAGLEY\n                           Who is overseeing their deployment?\n\nAlgren is somewhat confused by the question.\n\n                                             ALGREN\n                           No one.\n\n                                              BAGLEY\n                           Mr. Graham, you will accompany me to the rear.\n                           I want to be certain we are protected from any\n                           surprise assault.\n\n                                             GRAHAM\n                           Yes. Of course.\n\nBefore Algren can respond, Bagley has left the front lines with Graham in\n\n                                                                                    31.\ntow. Gant watches as they head out of harm's wa y.                      .\n\n                                               GANT\n                            Son of a bitch.\n\n                                                ALGREN\n                                      (almost to himself)\n                            ...I'm going to kill him.\n\n                                            GANT\n                            Waste of good ammo.\n\nGant checks his two revol vers. The methodical clicking of the chambers as\nhe checks his rounds is the only sound.                                         .\n\nThen absolute silence. A light SNOW begins to fall.\n\nAlgren continues to peer into the fog. Nothing.\n\nThen a sound ... distant ... building through the fog...\n\nThe steady rumble of horses. Slowl y approaching. Closer and closer...\n\nAlgren notes some of the Japanese soldiers are literally shaking in fear.\n\nAlgren peers again into the fog. Nothing. But the sound is closer.\n\nThen the sound abruptly stops.\n\nSilence broken only by the murmured prayers of some of the soldiers.\n\n                                              ALGREN\n                            Sergeant Gant, order the troops to assume\n                            staggered firing positions.\n\n                                             GANT\n                            Imperial Army, assume staggered firing positions.\n\nHis order is translated. The Japanese soldiers prepare to fire, one\nrow kneeling, the other standing behind them.\n\nOne of the Japanese soldiers faints from sheer tension.\n\nAlgren can see nothing through the dense fog. The tension is unbearable.\n\nThen a form on horseback... ghostly... like lame sort of medieval\nmonster. An elaborate, horned helmet. Sweeping samurai armor.\n\nAll we can see it the eerie silhouette in the fog.\n\n\nLike something from a nightmare.\n\nAnd then another figure... and another ... as 500 mounted samurai warriors\nslowl y move into position.\n\n                                                                                     32.\nThe Japanese troops are terrified\n\n\n                                              GANT\n                                   (quickly)\n                           Hold the line ... hold the line...\n\nThe order is translated.\n\nA terrible, beautiful moment of absolute stasis.\n\nNothing moves.\n\nThe Japanese soldiers wait.\n\nThe ghostly silhouettes wait.\n\nSilence.\n\nThen -- as if a silent signal were given -- the samurai suddenly CHARGE,\nemerging from the fog in a great wave--! The force of a tsunami.\n\nThe silence is shattered as the charging samurai roar out ancient war-\ncries that chill the blood -- sweeping forward on their hones like\nlightning -swords and spears flashing\n\n                                               ALGREN\n                           FIRE!\n\nThe Japanese troops fire then quickly begin trying to reload their single shot\nrifles -- others fumble at the ask and then break and run--\n\nPanic and chaos--\n\n                                               ALGREN\n                           Hold the line!\n\nToo late-- the samurai are on them--\n\nThey attack with an intensity few have ever seen -- many of the Japanese\nsoldiers try to escape, turning and running in blind panic -- they are butchered--\nrun through by the ashigaru, cut inhalf by the naginata.\n\nThose soldiers who laboriousl y try to reload their rifles are quickly\nmowed down by ferocious clouds of samurai arrows, fired by mounted\nSamurai.\n\n                                             ALGREN\n                           Sound fall back! Sound fall back!\n\nA bugler sounds the order. The Army begins to retreat.\n\nBut suddenly they are attacked from behind as well! Arrows shoot from the\nfog and more mounted samurai appear.\n\n                                                                                     33.\n\nThey are surrounded.\n\nAlgren, Gant, and the Japanese Offi cers call out orders but all discipline\nsoon breaks down -- it is every man for himself--\n\nThe battle swirls ever ywhere around us. Fleeing soldiers are run through by\nlances, run down and trampled by horses.\n\nEach samurai wears individual, vibrantly col ored armor. Various battle\nflags sweep through the fog.\n\nGant uses his two cavalry revolvers -- firing constantly -- finally out of\nammo he drops from his horse in the cavalry st yle and pulls a Winchester\nrepeating rifle, crouching and quickly firing--\n\nAlgren uses his revol ver first -- firing as he turns on his horse -- when\nthe revol ver is empty he pulls his cavalry saber. He manages to parry\nthe lethal blows as the Samurai hurtle past --\n\nBut one Samurai, his armor all in black, comes at him on a collision course\nand SLAMS INTO HIM, sending both horse and rider to the ground.\n\nAlgren scrambles to his feet, his saber nowhere to be found as another\nrider heads toward him carrying a lance.\n\nAlgren manages to grab it and throw the rider to the ground, wrestling the\nlance from his grip and running him through.\n\nIn the midst of the battle we notice a peculiar thing. One samurai is just sitting\non his horse. Watching Algren. This samurai wears a BLACK MASK.\n\nThe MASKED SAMUARI watches Algren fight.\n\nAlgren now wields the lance to battle the horsemen as they sweep past. He\nspears one and then unseats another. When a third samurai cuts his lance in\nhalf, Algren uses the remaining half as a club to take him down.\n\nThe Masked Samurai continues to watch Algren. Algren's tenacity is amazing.\nHe continues to fight with heroic passion, refusing to give an inch, long after\nThose around him have fled.\n\nThen a blaze of bright yellow ­ a samurai in yellow armor galloping past, firing\narrows steadily from horseback. His control and speed are astounding.\n\nWe will come to know him as YORITOMO, a handsome young samurai.\n\nYoritomo fires arrow upon arrow ­ the speed is breathtaking ­ Two arrows\nslam into Gant, knocking him to the ground.\n\nThe battle, meanwhile, has become a rout. Those Imperial soldiers who fight\nare easily cut down. Those who flee are run down like prey.\n\nLeft alone, Algren finds himself confronted by ashigaru ­ samurai foot\nsoldiers carrying pikes. He turns to discover his retreat cut off by other\n\n                                                                                                         34.\nsamurai wielding katana ­ the lethal long sword.\n\nBut rather than give any quarter, Algren launches an attack. He kills one\nsamurai before he is RUN THROUGH, at the shoulder, by a lance.\n\nIn agony, Algren SNAPS OFF the hilt of the lance, leaving its tip buried\ndeep in his chest, and fights on.\n\nHe manages to parry a blow ­ which SLICES into his side. The next blow\ntakes off a piece of his scalp. Blood fl ows down his faces and into his eyes.\n\nAlgren is now surrounded by ten samurai. A man's heroic stand against\ncertain death is of great interest to them. As they begin to close in, Algren\nwhirls the lance around, a tattered battle-flag with TIGER INSIGNIA still\ndangling from the end.\n\nThe MASKED SAMURAI removes his mask. It is the JAPANESE MAN,\nwhose dream of the tiger we glimpsed at the beginning of the story. His\neyes wide in surprise, he watches his dream come to life--the blue tiger\nholding the dogs at bay.\n\nIn SLOW MOTION Algren whirls the lance, as one samurai, wearing\nBLOOD-RED ARMOR, advances. With a murderous smile, he draws his\nkatana.\nAlgren seems spent ­ he drops to one knee, swaying, on the brink of losing\nconsciousness.\n                                                                      .\nBut as the RED SAMURAI, lets out a battle cry and propels himself forward for the death blow - Algren\nsuddenly LEAPS UP and propels the jagged wooden end of the broken lance into the unprotected throat of his\nattacker.\n\nAs the samurai falls, the rest of his comrades close in to cut Algren off.\n\nA harsh COMMAND stops them in their tracks.\n\nThe Masked Samurai leaps from his horse. Everyone steps aside deferentially\nso that be might pass by without being jostled.                    .\n\nHe looks down at Algren, then removes his battle helmet.\n\nAnd we meet _MORI KATSUMOTO, the leader of the samurai. He it an\nimposing man of about Algren's years.\n\nSensing that he is about to be killed, Algren pulls himself t o his knees, and SWINGS his saber at Katsumoto.\nWith blinding speed, Katsumoto pulls his katana from its scabbard.\n\nAlgren's saber is SNAPPED CLEANLY IN TWO.\n\nKatsumoto looks down at Algren.\n\nThen Gant appears behind Katsumoto -- limping toward him, cocking his\nrifle, urgently trying to save Algren--\n\nUjio, (the Samurai we saw earlier on the streets of Tokyo) leaps to\nprotect his Lord. His sword flashes--\n\n                                                                                                      35.\nGant is eviscerated. Algren watches in horror.\n\nA dreadful beat as Gant stands, pathetically trying to hold his guts in. Then he\nsinks to his knees.\n\nKatsumoto turns, leaps back onto his horse and trots off.\n\nAlgren finally wrenches himself from under his horse. He crawls to Gant,\nblood pouring from his own injured back and shoulder.\n\nGant is dead.\n\nAlgren looks up to see the battle is lost. The Japanese soldiers have fled.\nOr are surrendering, injured or dead.\n\nAnd he sees one other thing. General Yoshitaka is still on his horse,\nhead down. He has not pulled his sword. He has not been hurt.\n\nKatsumoto rides to Yoshitaka. A few serious words are exchanged. Katsumoto bows his bead in respect, seems\nto agree to something.\n\nBoth men climb from their horses. General Yoshitaka pulls out a small b1ade and hands it to Katsumoto, who\nholds it out firmly.\n\nGeneral Yoshitaka quickly and calmly pulls himself on to the blade, plunging\nit into his stomach, embracing Katsumoto.\n\nIt is seppuku -- the traditional form of samurai suicide.\n\nAlgren watches, stunned.\n\nThen a terrible scream cuts through the battlefield.\n\nAlgren sees samurai calmly walking among the injured and captured Imperial\nsoldiers .. killing them one by one with a single stroke.\n\nAlgren looks over the slaughter.\n\nAnd then passes out, bill wounds overcoming him.\n\nFade to...\n\nEXT.                    MOUNTAIN PASS                               DAY\n\nAlgren is unconscious, tied to a horse.\n\nThe mounted samurai move up a treacherous mountain pass, disappearing\ninto the soaring mountains of Yoshino.\n\nEXT.              VILLAGE                                    SUNSET\n\nKatsumoto's village is the other Japan. The Japan we have not yet seen.\n\nThe gorgeous mountain scenery of Yoshino envelopes the village. Snow-\ncapped mountains soar in the distance. A valley below with rice fields.\n\n                                                                                    36.\n\nAfter the turmoil of Tokyo, this place seems a bucolic paradise. Traditional,\nwooden Japanese architecture. Farming. The sense of harmony so markedly\nabsent from the cities.\n\nAlgren, barely conscious, hunches over his horse. He has lost a lot of blood.\n\nKatsumoto leads his samurai into the village. As he passes, ever y person in\nthe village touches his or her forehead to the ground to show respect.\n\nMost of these villagers have never seen a white face and gaze at Algren with\ncuriosity. And suspicion.\n\nKatsumoto dismounts in a large square, the rest of his men follow suit. A samurai\nhelps Algren painfully slide from his horse.\n\nKatsumoto moves to the steps of the largest house. His officers fall\ninto formation around him. Algren notes Ujio - the grim samurai who killed\nGant -- in jet black armor, glaring at him coldl y.\n\nUjio walks forward and SCREAMS at Algren in Japanese. Algren doesn't\nmove. This only makes Ujio more angry. He paces back and forth like a\ncaged panther spitting invective at Algren.\n\nAlgren doesn't move. He watches Uji o evenly. This takes incredible will.\nHis wounds are so bad that- he can barely stand.\n\nSUDDENLY - Ujio draws his long sword -- it slashes through the air - the\nblade singing -- and stops an inch away from Algren's face!\nAlgren doesn't move.\n\nUjio brings the cutting edge' into contact with Algren's check. Blood runs\nwhere even this feather-light touch cuts Algren's skin. Algren doesn't move.\n\nUjio glares at him. Then sheathes his sword and walks away.\n\nKatsumoto looks at Algren deepl y, gauging him. Then be speaks. In English.\nAlgren is surprised.\n\n                                            KATSUMOTO\n                           You cannot escape. We are deep in the mountains\n                           and winter is coming.\n\nKatsumoto turns and walks into his house. Uji o follows him. Algren collapses.\n\nFade to black.\n\nAs Algren begins his time at the heart of the samurai world.\n\n\nINT.                        YORITOMO'S HOUSE                           NIGHT\n\nAlgren'. eyes open...\n\nA WOMAN is leaning close, her eyes intent on the task of sewing up his\nwound. She is beautiful, but he is not really conscious enough to notice, or\n\n                                                                                      37.\neven feel the pain. He blacks out again.\n\nINT.                    YORITOMO'S HOUSE                      NIGHT\n\nAlgren wakes again. He is lying on a simple mat. His injuries are such that\nhe can barely move his head. He takes in the traditional Japanese furnishings.\n\nA red ball rolls across the floor. And after it... TOSHIIE, a little boy. around\nfour. The boy l ooks at Algren. offers him the ball. Smiles.\n\n\nA1gren blacks out...\n\n\nINT                      YORITOMO'S HOUSE                       ANOTHER DAY\n\nAlgren's eyes open...\n\nThrough the archway he can see Toshiie and his older brother HIGEN, around\nten. Also the beautiful WOMAN who earlier was stitching his wound.\n\nFrom his recumbent position, Algren watches as she ministers to the boys,\nwho are dearly her sons. Algren is fascinated by her grace and the sweet\nattention she gives them.\n\nShe seems to sense him. Her eyes raise, meet bit. She speaks to someone,\nand YORITOMO appears. He is twenty-one, too young to be the woman's\nhusband. Yoritomo comes into Algren's room. Speaks to him.\n\n\nAlgren shakes his head. Doesn't understand\n\n\nYoritomo speaks to the woman, who approaches and places bowl of soup\nin front of Algren. He ignores it\n\nThe boys stand in the doorwa y. Yoritomo shoos them awa y.\n\n\nAlgren glances up at the: woman. Her eyes avoid his, her expression is opaque.\n\n\nINT.                      YORITOMO'S HOUSE                              ANOTHER DAY\n\nAlgren now sits in the main room. The woman is changing the dressing on\nhis wounded right shoulder and arm.\n\nYoritomo kneels across from Algren. He is impressed at the many battle\nwounds on Algren's body; the old bullet wounds and scars. In Japanese, he\nindicates his admiration.\n\nAlgren his no idea what Yoritomo is saying. Finally he interrupts with the\nonly Japanese word he has bothered to learn:\n\n                                               ALGREN\n                            Sake.\n\n                                                                                 38.\n\nYoritomo's face breaks into a wide smile.\n\n                                             YORITOMO\n                           Sake?\n\n                                             ALGREN\n                           Sake.\n\nYoritomo glances to the woman. She nods, and brings A1gren a saucer of\nsake. He drinks it down. Holds out the saucer for a refill\n\nSmiling, Yoritomo indicates for the woman to comply, but before she can\npour another saucer, Algren takes the jug out of her other hand. Yoritomo\nlaughs as Algren drinks it down.\n\nEXT.                       VILLAGE                               NIGHT\n\nAutumn leaves fall to the ground. In a tiny hut, the village swordsmith begins\nwork on a samurai blade.\n\nINT.                   YORITOMO'S HOUSE                        NIGHT\n\nAlgren writhes on his mat. Trapped in his recurrent nightmare.\n\nA sudden flash:\n\nThe wagonload of the dead. Davey's bl oody corpse closes in on Algren\nsuffocating him.\n\nBack in the house\n\nYoritomo and the woman are asleep in separate rooms.\n\n\nA piercing SCREAM shatters the night\n\n\nEXT.                 VILLAGE                        FOLLOWING\n\nThe screaming continues. Lamps are lit around the village...\n\n\nINT.                YORITOMO'S HOUSE                   FOLLOWING\n\nYoritomo and the woman hurry to Algren's room --\n\nAlgren in the throes of his recurring nightmare - awakens, disoriented.\n\n\n                                             ALGREN\n                           Sake.\n\nYoritomo and the woman confer. Yoritomo looks It Algren and shakes his\nhead, no.\n\n                                                                                      39.\n\n                                              ALGREN\n                           SAKE!\n\nYoritomo refuses -- Algren roars and tries to rise. Laughing at Algren's\nferocit y in his weakened condition, Yoritomo easily pushes him back down.\n\nAlgren folds in on himself, rocking like a feral animal.\n\n\nEXT.                  YORITOMO'S HOUSE                              NIGHT\n\nKatsumoto stands outside the house, drawn by the commotion. Ujio stands\nwith him, shaking his bead.\n\n                                             UJIO\n                                   (subtitles)\n                           My lord, why do you spare the barbarian? He is\n                           shamed in defeat, be should kill himse1f.\n\n                                             KATSUMOTO\n                                   (subtitles)\n                           The barbarian doesn't know hit shame.\n\n                                              UJIO\n                                   (subtitles)\n                           Then I will kill him.\n\n                                             KATSUMOTO\n                                   (pats him; subtitles)\n                           Ujio-San, he will still be shamed tomorrow or in\n                           a month. For now there are things I wish to learn.\n\nEXT.                      VILLAGE                      DAY\n\nA glimpse of village life -- fish are hung on lines to dry, children chase each\nOther, clothes are washed in the river, and in the rice fields below, farmers\nsquat as they have for thousands of years. In his hut, the swordsmith\ncontinues to hammer and fold the blade.\n\nINT.                YORITOMO'S HOUSE                       NIGHT\n\nAlgren sits hunched in a dark corner. His body is convulsed with shivering.\nHis withdrawal from alcohol, his wounds, his isolation and his imagined sins\nare devouring him.                                                                .\n\nThen we see he is not alone. The woman stands in the doorway, watching\nhim closel y. Finally she enters with a bowl of soup.\n\nHe glances up, something like panic in his eyes.\n\nShe kneels and attempts to hand him the soup, but be knocks it out of the\nwa y and grabs her by the throat.\n\n                                                                                     40.\n                                               ALGREN\n                            Sake!\n\nShe stares at him, the breath being squeezed out of her, but there is not even\na whisper of fear in her eyes. She is utterly impassive. Shaken, he lets her\ngo, and crumples to the floor.                         .\n\n                                             ALGREN\n                                      (mumbling to himself)\n                            Sake...\n\nThe woman leaves the soup and wa1ks away.\n\n\nINT.                    YORITOMO'S HOUSE                           DAYS LATER\n\nDaylight streams in, finding Algren lying on his back. The worst of the detox\nis past. As be lies there, these first moments of repose lead to:\n\nA sudden flash of memory:\n\nThe beautiful blond WOMAN from the picture laughs merrily, and falls\nback languorousl y in a grassy fi eld.\n\nBack in the room\n\nAlgren shakes off the memory as harsh SOUNDS from outside draw him to\nthe window.                  .\n\nEXT.                    YORITOMO'S HOUSE                      MORNING\n\nAlgren watches from the window as the samurai train. It is like nothing else\nin the world. Part sacred ritual, part martial preparation, samurai training\ncom bines athletic prowess and graceful artistry into one effortless whole.\n\nFinally well enough to walk, Algren comes out onto the porch to watch the\nspectacle. In front of him, is a Kendo (The Way of the Sword) master\npractice with their long and short swords. They have incredible control.\n\nNAKAO, a mountain of a man, is a Karate master. He stands unarmed,\nfour samurai facing him. They attack with wooden swords. He effortlessly\ndefeats them -- the agility of the huge man is shocking.\n\nKyudo (\"The Way of the Bow\") masters use their bows for target practice.\nYoritomo holds a bundle of arrows. In the distance, a line of plums.\n\nAlgren watches. Yoritomo just seems to stand there, his eyes hall-open.\n\nAnd then -- in a stunning blaze of movement -- Yoritomo fires the arrows --\none after another, amazingly fast -- cleanly hitting each plum. The final arrow\nsplits the previous one as it buries itself in the tree.\n\nA wooden sword leans against the porch.\n\nAlgren idly picks it up, feeling its balance. In a flash, Uji o has raced over and\ngrabbed it from him. Algren stands motionless as Ujio screams at him.\n\n                                                                                  41.\n\n\nThe training stops, as everyone watches Uji o berate Algren.\n\nEven as Ujio continues screaming. Algren simply shakes his head, turns\nawa y, and walk back into the house.\n\nINT.               YORITOMO'S HOUSE                         DAY\n\nAs the sounds of training resume outside, Algren explores the house.\n\nHe comes upon Higen and Toshiie playing with the red ball. They are\nembarrassed to encounter him alone. There's a moment of suspension, and\nthen Higen throws the ball to Algren.\n\nAlgren looks back and forth between the two boys, fixes his gaze on Higen\nbut throw the ball to Toshiie, causing both boys to laugh and run awa y.\n\nAlgren walks on.\n\nINT.                SMALL ROOM                           DAY\n\n\nAlgren opens a sliding shojii screen and discovers a small room that has been\nmade into a kind of shrine.\n\nCand1es and incense burn, a small Buddha sits on a dais, and Algren's eyes\nare drawn to what seems like an apparition standing in the corner.\n\nThe BRIGHT RED ARMOR of the warrior Algren killed in the fog, is held\nupright by an unseen stand. It is almost as if the dead warrior himself is\nswing back at him.\n\nAlgren senses someone behind him and turns. The woman is standing across\nthe hall. Their eyes meet. She turn, and walks away.\n\nEXT.               VILLAGE                            NIGHT\n\nA first, light snowfall has covered the ground. A1gren walks out into the still\nnight. He turns a corner and confronts curious sight:\n\nTen warriors kneel, motionless in the snow, their eyes closed in concentration.\n\nAs Algren puzzles over this, he becomes aware that Katsumoto is now\nstanding next to him.\n\n                                                   KATSUMOTO\n                              They are training.\n\n                                                   ALGREN\n                              Training what?\n\n                                                 KATSUMOTO\n                              Their minds. It is called bushido...\n\n                                                                                   42.\n\nAlgren looks at him. He has never heard the word.\n\n\n                                           KATSUMOTO\n                       The wa y of the warrior. We study from when\n                       we are young. Are my words correct?\n\nAlgren does not respond.\n\n                                              KATSUMOTO\n                            I will practice my Eng1ish with you.\n\n                                            ALGREN\n                            Why do you learn English?\n\n                                            KATSUMOTO\n                            To know m y enemy.\n\n                                             ALGREN\n                            If I am your enemy, why have you not killed\n                            me?\n\nKatsumoto doesn't answer.\n\n                                           ALGREN\n                            Was General Yoshitaka your enemy?\n\n                                             KATSUMOTO\n                            No, I honor his memory as my kinsman.\n\n                                            ALGREN\n                            That why you helped him kill himself?\n\n                                                KATSUMOTO\n                            If a samurai is defeated in battle, he must take\n                            his own life to spare himse1f the shame of capture.\n                            It is required that his kaishaku his trusted friend,\n                            help him. I was honored to by his kaishaku.\n\n                                                ALGREN\n                            Hell of an honor.\n\n                                               KATSUMOTO\n                            It was his destiny. He knew it, he died at peace.\n\n                                            ALGREN\n                            Who was the warrior in the red armor?\n\n                                            KATSUMOTO\n                            My son-in-law. His name was Hiroshi.\n\n                                           ALGREN\n                            And the woman who cares for me?\n\n                                                                               43.\n                                           KATSUMOTO\n                           My daughter, Hiroshi's wife. Her name is Taka.\n\n         Algren is incredulous.\n\n                                             ALGREN\n                           I killed her husband?\n\n                                            KATSUMOTO\n                           It was an honorable death.\n\nKatsumoto walks awa y.\n\n\nINT.             YORITOMO'S HOUSE                       DAY\n\nAlgren it now well enough to kneel at the table with the others. Taka treats\nhim with utter politeness and dignity. He watches her intently, seeking any\nsign of the animosity he's certain she must feel.\n\nShe hands him a bowl of rice.\n\n                                           ALGREN\n                                  (smiling politely)\n                           You hope I choke on it, don't you?\n\nShe bows, uncomprehending.\n\n                                             ALGREN\n                           You want to poison it and watch me fall over\n                           the table and foam at the mouth.\nYoritomo bows in response to Algren's new willingness to communicate.\n\n                                             YORITOMO\n                                   (to Taka, subtitles)\n                           I promise I'll make him take a bath.\n\n                                             TAKA\n                                   (subtitles)\n                           Soon. Please.\n\n.EXT.             VILLAGE -- BATHING TUB                            DAY\n\nYoritomo leads Algren to a large, wooden bathing tub in I secluded part of\nthe village. A banked fire smolders beneath it.\n\nEmbarrassed, Yoritomo indicates to Algren that be needs to bathe. Algren\nstrips off his filthy uniform then lowers himself into the steaming water.\n\nYoritomo begins taking off hit own kimono. A1gren is taken aback. Used to\nWestern privacy, he is a bit disquieted about bathing with another man.\n\nYoritomo, unconcerned, climbs into the tub. He chats pleasantly as they\nbathe, showing off his old battle wounds.\n\n                                                                                      44.\nAlgren's discomfort turns to outright alarm when a toothless old grandmother\nappears. .She happily strips and joins them in the tub!\n\nAlgren sinks a little lower into the water. The old grandmother smiles at\nhim with her toothless grin.\n\nEXT.            VILLAGE                          DAY\n\nAlgren. feeling self-conscious in the clean kimono he's wearing for the first\ntime, walks back with Yoritomo. Kids start walking with them, pointing at\nhis Japanese garb, laughing as he stumbles in his wooden clogs. They pass\nby Ujio training a group of samurai using wooden kendo swords.\n\nNearby, Higen and Toshiie are imitating the grown-ups, sparring with wooden\nswords that are much too big for them. Yoritomo watches his nephews proudly,\nmurmuring details of their prowess to Algren, who has no idea what he's talking\nabout.\n\nHigen charges his little brother, but goes careening past, right toward Algren,\nwho deftl y dodges out of the wa y. This causes gales of laughter from the\nboys, one of whom takes Toshiie's sword and offers it to Algren.\n\nAlgren looks at the sword in his hand and unthinkingly twirls if with a f1ourish --\ncausing the boys to applaud. Yoritomo bows, and encourages A1gren in\nHigen's direction. Algren shakes his head politely, but Higen is already on\nthe attack.\n\nAlgren dodges one thrust, then parries another, as the boys begin to cheer.\n\nSuddenly, ever yone goes silent. Algren turns.\n\nUjio is standing behind him, arms folded.\n\nUjio barks a command in Japanese. He wants Algren to drop the sword.\nIt is obvious to Algren what it must mean, but he does nothing.\n\nUjio approaches Algren slowl y. Algren holds the wooden sword casually,\nonly his eyes betraying the tension of the moment.\n\nUjio's wooden sword FLASHES, quicker than the eye can follow. Algren's\nsword is knocked from his hands, then, somehow in the same fluid\nmovement, Ujio brings the sword around and cracks Algren across the\nchest hard enough to knock the breath from his body and lend him to his\nkneels.\n\nSatisfied with himself, Uji o starts to walk away, but the expressions of the\nbystanders cause him to turn back: .\n\nAlgren is standing again, and again holding the sword.\n\nWith grim purpose, Uji o returns to Algren, who has assumed a ready pose.\n\nAgain Ujio's SWORD FLASHES. Algren manages to parry one blow, before\nhe is cracked across the face, and blood begins to flow free1y from his nose.\n\n                                                                                          45.\n Ujio knocks Algren's legs out from under him, and while Algren is sprawling\non the ground, Ujio kicks Algren's sword out of his hand, and starts away.\n\nAgain, Algren manages to stand up, and before Ujio can turn, charges him.\n\nBut Uji o doesn't need to turn. In a sliding move, he dodges and cracks Algren\nin the side, then the legs, then the neck. Gasping for breath, at least one rib broken,\nAlgren writhes on the ground. Ujio digs the point of his sword into\nAlgren's hand until he releases his grip. Again Ujio kicks the sword away.\n\nThe ever-enlarging crowd gasps as Algren once again struggles to his feet.\nThis time without hesitation, Uji o runs back and rains blows upon Algren's\nnow defenseless body. First the wrist, then the back, then the stomach, then\nfinally the head.\n\nAlgren hits the ground, unconscious, his fingers still clutching the sword.\nUjio reaches down, pries it from his fingers, and breaks it across his knee.\n\nINT.              YORITOMO'S HOUSE                                   EVENING\n\nAlgren lies painfully on a mat, his eyes unfocused.\n\n\nA sudden flash of memory:\n\nThe lovel y blond woman, tears in her eyes, looks up to Algren's shining face,\nthe epaulets on his crisp officer's, uniform gleaming gold in the sun.\n\nThe reverie is broken.\n\nAs Taka kneels to swab the cuts on his face. He stares at her darkly.\n\n                                            ALGREN\n                         Who are you people anywa y?\n\nShe makes no attempt to understand or respond.\n\n                                               ALGREN\n                         You have no God, you have no mercy, you don't\n                         even have any fucking walls. Your walls are\n                         made of paper, what's the matter with you?\n\nShe pushes his head aside so she can attend to his neck.\n\n                                                 ALGREN\n                         This man tries to kill me and I've done nothing\n                         to him, and you, I kill your husband and you act\n                         like, what? Like I'm a guest in your house.\n                         What is wrong with you?\n\nThis last said so intensely that she glances at him before picking up a bowl\nof soup she had brought for him, and bringing it to his lips...\n\n                                               ALGREN\n                         Do you have a soul at all?\n\n                                                                                  46.\n\nHe stares at her for a moment, then knocks the soup out of her blinds.\n\nHer eyes FLASH for one moment, before resuming their usual mildness.\nBut that flash is enough to satisfy him, and he calms down. She walks away.\nHe sighs, exhausted, only to see her approach again with a new bowl. Their\neyes meet, and hold for a moment. She does have a soul. He takes a sip.\n\nINT.                 SHINTO SHRINE                        DAY\n\nAlgren is led past baldheaded monks into an ancient shrine. Katsumoto\nkneels before a small altar. He doesn't seem aware that Algren is present.\n\n                                             KATSUMOTO\n                           Ujio is teaching you the wa y of the Japanese sword.\n\n                                              ALGREN\n                           Is that what he's doing?\n\n                                            KATSUMOTO\n                           At what age did you become I soldier?\n\n                                              ALGREN\n                           Nineteen.\n\n                                             KA TSUMOTO\n                           To fight in your American civil war.\n\n                                              ALGREN\n                           Yes.\n\n                                             KA TSUMOTO\n                           Tell me about that war'.\n\n                                              ALGREN\n                           What about it?\n\n                                              KATSUMOTO\n                           Everything.\n\n                                            ALGREN\n                           Everything about the civil war?\n\n\nKatsumoto sits impassively, staring at the altar.\n\n                                            ALGREN\n                           That would take a year.\n\n                                           KATSUMOTO\n                           You have pressing business elsewhere?\n\nShaking his head, Algren sits down.\n\n                                                                                             47.\n\n\n                                              ALGREN\n                           The civil war began on April 12. 1861 when the\n                           rebs attacked Fort Sumter. Well, actually, it\n                           probabl y began three years earlier when the\n                           Supreme Court decided a runaway slave had to\n                           be returned to his master\n\n                                                                               DISOLVE TO:\n\nThe TWO OF THEM, hours later--\n\n                                              ALGREN\n                           --and Pickett says he wants to do it, over\n                           Longstreet's objections and Lee doesn't know\n                           what to think, but he lets him. So 15,000 men\n                           go up that hill. And most of them die.\n\n                                                KATSUMOTO\n                           Was that wise?\n\n                                                ALGREN\n                           No, it was stupid.\n\n                                                KATSUMOTO\n                           Why?\n\n                                             ALGREN\n                           The point of a battle is to win, or at least have\n                           enough men survive to fight another day.\n\n                                             KATSUMOTO\n                           You did not try to survive when we took you\n                           prisoner.\n\nAlgren eyes him, frustrated.\n\n                                          ALGREN\n                           What do you want from me?\n\n                                          KATSUMOTO\n                           What do you want for yourself?\n\n                                           ALGREN\n                           You know they're not going to ransom me.\n\n                                             KATSUMOTO\n                           We have little use for money.\n\n                                                                                   48.\n                                              ALGREN\n                                     (mounting fury)\n                            Then what are you doing, why are you asking me\n                            these questions, what is going on here?\n\n                                               KATSUMOTO\n                            The snows will melt in May, and the passes will\n                            open, and the events of the world will unfold.\n                            Until that time, you are here.\n                                     (smiles)\n                            I enjoyed this conversation in your English. I\n                            hope you will honor me with more tomorrow.\n\nKatsumoto stands, bows, and leaves.\n\n\nINT.                  YORITOMO'S HOUSE                             DAY\n\nYoung Toshiie sits near Algren. He labors over a scroll with a brush, the\ngentle brush strokes are hypnotic as they sweep across the rice paper.\n\nAlgren tries to indicate that he would like pen and paper for himself. Toshiie\ngives him what he asks. Algren begins to write:\n\n                                              ALGREN (V.O.)\n                       Day unknown, month unknown, 1876. I continue\n                       to live among these strange people.\n\nEXT.                        VILLAGE                            DAY\n\nKatsumoto watches Ujio bark orders to the men he is training. A sudden\nMovement of their eyes, causes Uji o to stop. He turns to find:\n\nAlgren standing at the end of the line, holding I wooden sword.\n\nAn almost imperceptible look passes bet ween Ujio and Katsumoto, but Ujio's\nResentment is over-ruled. Without a word, he continues.\n\n\nAlgren does his best to follow the exercise.\n\n\nKatsumoto, the slightest hint of a smile on his face, walks away.\n\n                                              ALGREN (V.O.)\n                            Each day I am confounded by their strange customs\n                            and contradictions, savagery followed by\n                            mildness.\n\nINT.            YORITOMO'S HOUSE                          NIGHT\n\nAlgren now kneels at the table with the rest of the family as they eat. He is\nin considerable pain from the rigors of training. He tries to roll the stiffness\nout of his neck, when be notices that Higen it imitating him. Toshiie laughs.\n\n                                                                                                     49.\n                                               ALGREN (V.O.)\n                            They seem to value nothing more than their\n                            families, and yet they kill defenseless wounded\n                            men without a shade of remorse..\n\nYoritomo sternly tells Higen not to make fun of their guest. Yoritomo\napologizes to Algren, who shakes his head unnecessary.\n\n                                               ALGREN\n.                           Raisu? [Rice?]\n\nThey stop, shocked. He has spoken!\n\nYoritomo calls for Taka to serve him more rice, then begins yammering\nenthusiastically in Japanese. Algren holds up his hand.\n\n                                              ALGREN\n                            Not so fast Ko...toba? [Words?]\n                                     (bolds up chopsticks)\n                            What is this?\n\n                                               YORITOMO\n                            Hashi.\n\n                                               ALGREN\n                            Hashi.\n\nYoritomo is hysterical with glee now.\n\n                                               YORITOMO\n                            Hail!\n\nThe boys are suddenly dervishes, pulling various objects from the table and around the room, shouting the\nJapanese words for each.\n\nAlgren shakes his head, and smiles for the first time in this stor y.\n\nYoritomo manages to quiet the boys. He points to himself.\n\n                                               YORITOMO\n                            Yoritomo.\n\n                                                ALGREN\n                                      (points to himself)\n                            Algren.\n\n                                               YORITOMO\n                            All-gren.\nAlgren nods, and the boys start screaming \"All-gren!\"\n\n                                              YORITOMO\n                                    (points to each in rum)\n                            Higen. Toshiie. Taka.\n\n                                                                               50.\n\n                                            ALGREN\n                                  (bowing)\n                          Higen. Toshiie.\n                                  (turns to Taka)\n                          Taka.\nShe meets his eyes for the slightest moment, then looks down and walks away.\n\n\nINT.              KATSUMOTO'S HOUSE                            NIGHT\n\nKatsumoto is arranging flowers. Algren watches in confusion, as this\npowerful lord goes about doing something so feminine and delicate. Finally:\n\n                                           KATSUMOTO\n                          The parliament of your country has two houses.\n                          Why is that?\n\n                                           ALGREN\n                          To keep either one from being too powerful.\n\n                                           KATSUMOTO\n                          Does not a people need a powerful ruler to\n                          protect them?\n\n                                           ALGREN\n                          We believe the opposite.\n\nKatsumoto thinks about this.\n\n                                             ALGREN\n                          I have a question. How do you come to speak\n                          English?\n\n                                               KATSUMOTO\n                          Members of the Council were required to study\n............              it. ........Yes, I was a member of the government.\n                          I helped restore the Emperor to the throne.\n\n                                            ALGREN\n                          So that Japan could have a powerful ruler to\n                          protect it.\n\nKatsumoto understands Algren's irony, but doesn't smile.\n\n\n                                         ALGREN\n                          And now you must hate him for what he's done.\n\n                                            KATSUMOTO\n                          He is my blood. I serve him with my life.\n\n                                            ALGREN\n                          By fighting his army?\n\nKatsumoto looks at A1gren.\n\n                                                                                                             51.\n\n                                              KATSUMOTO\n                           I do not fight the emperor. I fight those who\n                           seek to influence him, those who betray the soul\n                           of my country.\n\nHe slowl y draws his long samurai sword, and places it next to the flowers on the table in front of him.\n\n                                              KA TSUMOTO\n                           The Emperor gave this blade to my ancestors\n                           400 years ago. It has been used only to defend his\n                           sacred honor.\n\nKatsumoto hands the sword to Algren. Algren studies it.\n\n                                             KATSMUOTO\n                           It takes many years to make a sword. It is a holy\n                           Act. A samurai's sword is his soul.\n\n                                             ALGREN\n                           This sword is flawed. What is this uneven line\n                           near the edge?\n\nKatsumoto smiles at Algren's ignorance.\n\n                                              KATSUMOTO\n                           One man is flexible and compromises too much\n                           to avoid conflict. Another man is so fierce he\n                           wins ever y battle, but so rigid he can never know\n                           peace. A man who knows both is the perfect\n                           warrior. The lame is true of a blade .. one steel\n                           bends, and the other cuts. And where they\n                           meet is never perfect Hold the blade up. .\n\nAlgren holds the sword, cutting edge up. Katsumoto takes a silk cloth and drops it. It gently billows down -- and\nsplits evenly on the edge.\n\n                                            KATSUMOTO\n                           Some believe a blade is thirsty until it tastes the\n                           blood of its enemy.\n\nAlgren hands the sword back. Suddenly, Katsumoto swings the sword, cleanly splitting the table in two.\nSilence.\n\n                                           ALGREN\n                           The crew at Winchester can produce one rifle ever y\n                           seven minutes.\n\n                                            KA TSUMOTO\n                           We gave up firearms two hundred years ago. It\n                           takes no courage to kill. A man from half a mile\n                           awa y. You must look into the eyes of your enemy\n                           to know who you have killed.\n\n                                                                                                       52.\n                                             ALGREN\n                          I'm not sure an artillery officer would agree.\n\n                                             KATSUMOTO\n                          Do you?\n\n                                              ALGREN\n                          I think all killing's a filthy business.\n\n                                              KATSUMO\n                          TO Taking a man's life is\n                          nothing. It is his honor you\n                          can never take awa y.\n\n                                           ALGREN\n                          In other words you have no respect for human life.\n\n                                              KA TSUMOTO\n                                   (fierce) .\n                          What do you know of human life? You come here to kill for\n                          money Where is your family? Where is your wife, your sons?\n                          What is your legacy?\n\n                                             ALGREN\n                                   (undaunted)\n                          And what is yours? To rebel against the future? I fought the\n                          South in our civil war. Their leaders believed they were fighting\n                          for \"honor\" just as you do. And their people died by the thousands!\n\nKatsumoto simply looks at him.\n\n                                           ALGREN\n                          And my wife is dead.\n\n                                             KATSUMOTO\n                          Mine, too.\n\n\nThey look at each other. Some unexpected recognition has taken place.\n\n                                            KATSUMOTO\n                          Tomorrow we will discuss your country's wish for\n                          dominance in the...\"Far East.\"\n\n                                             ALGREN\n                          ...I look forward to it.\n\n\nAlgren turns to go.\n\n\nEXT.VILLAGE SQUARE DAY\n\nWe see the village swordsmith at work. He has been forging the same long samurai blade for months... Algren\nwatches him as he works.\n\n                                                                                                               53.\n                                            ALGREN (V.O.)\n                          March 9. 1877. I have never known such a disciplined\n                          people.\n\nEXT. VILLAGE DAY\n\nAlgren trains with the other men. He attempts an attack, which is easily brushed aside by Nakao. Algren ends\nup in the dirt again.\n\n                                             ALGREN (V.O.)\n                          From the moment they wake, they devote themselves\n                          to the perfection of whatever they pursue--\n\nEXT. VILLAGEDAY\n\n\nAlgren walking with Katsumoto -- they are deep in conversation.\n\n                                           ALGREN (V.O.)\n                          And yet the more time I spend here, the less I understand them.\n\nEXT.               VILLAGE                      DAY\nTwo women are bowing repeatedly, chattering in smiling, earnest argument.\n\n                                            ALGREN (V.O.)\n                          Everyone is polite, every nuance of behavior seems to\n                          have a great meaning, and increasingly I am convinced\n                          that the lower they bow, the leas they mean it.\n\nEXT.              YORITOMO'S                         HOUSE\n\nAlgren, holding the wooden sword in 1870'5 baseball manner, is coaxing Higen to throw the ball at him. The\nchildren laugh as Algren hits it onto the next porch.\n\nTaka watches her sons impassively. It is dear how much they like Algren.\n\n                                           ALGREN (V.O.)\n                          And I am sure they regard my wa ys to be as confounding\n                          and unfathomable as I find theirs.\n\nAN ICE CRYSTAL ON THE END OF A BRANCH\n\n\nStarts to drip. SPRING bas begun.\n\nBXT.                 VILLAGE                         DAY\n\nVillagers laugh as they go about the business of life. A man throws a sack of rice to another. Two women hurry\nawa y from a farmer who is teasing them.\n\nAlgren is once again among the training warriors. He and another man face off, each waiting for the other to\nattack with his wooden sword.\n\n                                                                                                                54.\nAlgren moves first, but his opponent counters, and strikes him easily. They wheel around and engage again,\nand again Algren is bested. Furious, he throws himself at his opponent, reverting to classic saber technique.\n\nIn a flurry of movement, his opponent manages to deflect the blows and also knock Algren to his knees.\nYoritomo approaches and bows.\n\n                                            YORITOMO\n                           A1gren -San. Please forgive. Too many mind.\n\n                                             ALGREN\n                           What?\n\n                                           YORITOMO\n                                  (pointing as he explains)\n                           Mind sword, mind face, mind people watch, too many mind.\n                                  (on Algren's confused expression)\n                           No mind.\n\n                                             ALGREN\n                           No mind?\n\n                                           YORITOMO\n                           Hai! No mind. You try.\n\nAlgren nods, uncertainly, and picks himself up. Again he faces the opponent, shaking off the tension and trying\nto stay calm.\n\nThis time the opponent charges first, and Algren manages to parry one blow, before he is again bested.\n\nYoritomo bows happily and begins yammering in Japanese, clearly taking credit for Algren's progress.\n\nAcross the square, Katsumoto watches.\n\n\nEXT.                     IMPERIAL PALACE GARDEN                                   DAY\n\nThe cherry blossoms have emerged, creating a scene of intense col or, beauty,\nand serenity. The Emperor sits cross-legged next to a shrine. He is approached by Omura and two other\nadvisors.                                                                        .\n\n                                             OMURA\n                           Your majest y, beg permission to approach.\n                                    (the Emperor nods)\n                           Your humble servants are most anxious to know if his\n                           Majest y has signed the order regarding the railroad progress.\n\n                                               EMPEROR\n                                   (after a long moment)\n                           I am most impressed at the wa y the blossoms float\n                           upon the air, as if held by unseen hands.\n\n                                             OMURA\n                           Yes, they represent the highest form of gyoko.\n                           About the order, your Majest y.\n\n                                                                                                                 55.\n                                              EMPEROR\n                            This railroad must go through Yoshino Province?\n\n                                               OMURA\n                            It is absolutely necessar y your Highness.\n\n                                                EMPEROR\n                            If you sa y so, I shall sign.\n\nEXT.                                VILLAGE                          DAY\n\nAlgren walks through the village, past the swordsmith who is now honing the blade, carefully sharpening it.\n\n.EXT.                    CHERRY TREE FOREST                              DAY\n\nAlgren makes his way through a stunning cherry forest near the village. The pink and red blossoms are dazzling\nand abundant. Other villagers can be seen gathering cherry bl ossoms.\n\nIt is a place of otherworldly beaut y.\n\nIt is all so beautiful that Algren just stops. Takes it in for a moment. He reaches out and touches a blossom.\n\n                                             KATSUMOTO (O.S.)\n                            A perfect blossom is a rare thing...\n\nAlgren turns. Katsumoto is kneeling nearby, meditating.\n\n                                             KA TSUMOTO\n                            You could spend your life looking for one.\n                            And it would not be a wasted life.\n\n                                            ALGREN\n                            Were you praying?\n\n                                                KATSUMOTO\n                            Just sitting... I do not think I have the word.\n                            Satori it means, maybe, awareness.\n\n                                               ALGREN\n                            Of what?\n\n                                              KATSUMOTO\n                            This moment alone, apart from all others ... You\n                            know this?\n                                     (Algren shakes his head)\n                            I am writing a poem about this time we hive spent.\n                            I have only written one line on \"His eyes were like my\n                            own but seen through a deep and troubled ocean.\"\n                            Can you suggest a second line?\n\n                                             ALGREN\n                            I'm not much of a writer.\n\n                                              KA TSUMOTO\n                            Is this why you spend so much time with your journal?\n\n                                                                                     56.\n\n                        .                     ALGREN\n                             How do you know that?\n                                      (no answer)\n                             She told you.\n\nKatsumoto appraises Algren.\n\n                                              ALGREN\n                             Did you love her husband as your own son?\n\n                                             KA TSUMOTO\n                             You have sent men to their deaths, just as I have.\n\n                                                ALGREN\n                             The difference is, you feel nothing.\n\n                                              KA TSUMOTO\n                             Before you were a soldier, you were a farmer.\n\n                                              ALGREN\n                             What does that have to do with anything?\n\n                                               KA TSUMOTO\n                             You lived on a farm. Or in a forest of trees.\n\n                                            ALGREN\n                             How do you know?\n\n                                              KA TSUMOTO\n                             The wa y you look at the cherry blossoms.\n\n                                               ALGREN\n                                      (reluctantly)\n                             We lived in a place called Connecticut. My...brother\n                             and I climbed the maple trees.\n\n                                              KA TSUMOTO\n                             Were they beautiful?\n\n                                               ALGREN\n                             Yes.\n\n\n                                              KATSUMOTO\n                            And you were sad to see them die in the winter.\n\nA beat. Something flickers in Algren's eyes.\n\n                                             KATSUMOTO\n                             You were something before you were a soldier. You\n                             were a boy who was sad to see the leaves fall and the\n                             trees die.\n\nKatsumoto looks at him deepl y.\n\n                                                                                              57.\n                                                KA TSUMOTO\n                             Like those trees, we are all dying. The future is\n                             an illusion, our plans are an illusion, our fears an illusion.\n                             We live life in every breath. Eat, drink, fuck. Now. Every cup\n                             of tea. Every word we write... Every blossom we hold.\n\nHe smiles sadly.\n\n\n                                               KA TSUMOTO\n                             Every life we take.\n\nA beat. He stands, takes in the beautiful cherry orchard.\n\n\n                                               KATSUMOTO\n                             Life in every breath. That is bushido. The wa y of the\n                             samurai.\n\nHe goes. Algren stands for a moment deep in thought\n\nINT.                      YORITOMO'S HOUSE                               NIGHT\n\nAlgren is asleep. And then we note that the ground is vibrating .. he slides\nacross his mat .- wakes with a start\n\nAn unholy rumbling-\n\nAlgren bolts up ... just as a paper wall rips open, the wooden framework to the room splits\nand the roof collapses--\n\nAn earthquake. Common for this part of Japan.\n\nEXT.                     VILLAGE                            NIGHT\n\nYoritomo appears. He and Algren crawl out of the house just as the ground lurches\nviolently-\n\nPart of the house contorts and caves in\n\nAround the village, the wooden frame houses are swa ying and lurching they have some\ntorque, but not enough\n\nUjio directs the villagers as they battle a fire-\n\nTaka appears, calling frantically for Toshiie.\n\nThen an even larger seismic tremor suddenly TEARS THROUGH THE\nVILLAGE\n\nHouses are ripped apart -- the whole world shifting.\n\nThough the smoke, Algren sees Toshiie cowering under an eave\n\n                                                                                               58.\n\nA heavy ceiling beam breaks loose, threatens to crush Toshiie\n\nAlgren dives forward, grabs Toshiie and pulls him out of the wa y... the front\nof the house collapses, the beams smashing to the ground..\n\nTaka and Higen race to Algren and Toshiie. The boy is safe.\n\nTaka grabs the child and cradles him. Her look to Algren is fierce, protective,\nalmost feral -- as if he were the threat instead of the rescuer.\n\nEXT.                       VILLAGE                               DAY\n\nAlgren watches the villagers rebuild. Yoritomo and Higen strugg1e with a large\nwooden framework.\n\n                                                   ALGREN (V.O.)\n                            I am str    uck by these people and their acceptance of Fate\n                            in a1l it   s variations. At a time like this, they seem utterly\n                            without      sentiment. Even the children have a gravity\n                            beyond      their years.\n\nAlgren goes to them. Silently begins to help them.\n\n\nINT.                 YORITOMO'S HOUSE                                    DAYS LATER\n\nAlgren works with Yoritomo, binding the wooden framework. Higen prepares\nthe paper walls nearby. He does this with considerable skill.\n\nTaka is getting water from a rain barrel she observes Algren helping\nrebuild her home. Yoritomo is working nearby.\nAlgren's Japanese is rough but improving:\n\n                                             ALGREN\n                                    (in Japanese, subtitles)\n                            Would last longer ... if stone.\n\n                                             YORITOMO\n                                   (subtitles)\n                            No. House fall. House go back easy with wood.\n\nAlgren shakes his head. Taka appears with cups of water. Algren looks at her\nFor the first rime, she holds his gaze.\n\n\nEXT.                  YORITOMO'S HOUSE                               EVENING\n\nTorches illuminate a small stage in the center of the village square. Several\nsamurai perform a ritualistic Noh drama. (A form which, by the wa y, the\nsamurai invented.) Others play flutes and large steel drums.\n\n                                               ALGREN (V.O.)\n                            And yet I have never seen a people with more capacity\n                            for the joy found in the simplest things of life.\n\n                                                                                                59.\n\nKatsumoto himself plays the lead role. An enthusiastic actor, he plays to the children in\nthe audience. They are delighted with his broad theatrics.\n\nINT. YORITOMO'S HOUSE\n\nTaka is carrying in a huge lack of rice. Algren goes to help her.\n\n                                               TAKA\n                                     (subtitles)\n                             No, please.\n\n                                                    ALGREN\n                                        (insistent)\n                            Hai.\nHe carries the rice for her into the pantry area.\n\n                                              TAKA\n                                    (subtitles)\n                            Japanese men do not help with this.\n\n                                                  ALGREN\n                                        (subtitles)\n                            I know.\n\nShe looks at him, a little surprised.\n\n                                               ALGREN\n                                     (subtitles)\n                            I am not Japanese.\n\nIn spite of herself, she smiles a little. There is an awkward moment.\n\n\n                                                ALGREN\n                                      (subtitles)\n                            1... didn't know he was your husband.\n\n                                              TAKA\n                                    (struck; subtitles)\n                            He did his duty. You did your duty.\n\n                                              ALGREN\n                                    (subtitles)\n                            And you do yours.\n\n                                                    TAKA\n                                        (softl y)\n                            Hai.\n\nThey look at each other for a long moment. She starts to move, but he stops\nher. They are close enough to smell each other's hair, to feel the warmth of\nthe other's breath. She looks up at him, pleading with her eyes not to take this any further.\n\n                                                                                                  60.\n\nHe lets her go.\n\nEXT.                 VILLAGE                   DAY\n\nAlgren stands across from Ujio, ready again for the ken-jutso.\n\nThey stand frozen for a long time, hands on the hilts of their wooden swords.\nOther samurai watch.\n\nAlgren and Ujio stare at each other.\n\nBut there is something different about Algren's expression. Not as much\nfury and competition, more a sense of balance and alertness. He studies Ujio's eyes, his hands,\nthe folds of his kimono, the attitude of his body.\n\nWe watch A1gren closel y.\n\nGradually all SOUND drains away. We hear only Algren's steady breathing. He is\naware of everything. A bird in a tree. A woman grinding rice. A plum about to fall.\nA gently swa ying battle flag,\n\nSlow-motion as:\n\nAlgren attacks -- no fury, just control-- Ujio tries to deflect the blow, Algren\nanticipates - he swings his sword elegantly - -Ujio blocks it -- Algren counters --\n\nAlgren presses forward, his sword slashing masterfully, forcing Ujio back\nUjio counters with complex moves as he retreats --Algren keeps moving\nforward, calm -- finally Ujio's sword is swept aside in one clean\nmovement. Algren ends with the edge of his wooden sword It Ujio's throat.\n\nThe other samurai watch. Amazed.\n\nAlgren twirls his sword in a fancy cavalry \"fl ourish.\" The pride he has alwa ys taken in his\nswordsmanship has been restored. He bows to Uji o.\n\nUjio nods his head, slightly, in respect\n\n\nThe other samurai, led by the hearty Nakao, congratulate Algren.\n\nEXT. MEADOW                            DAY\n\nAlgren carries water from the river through a riot of spring wild-flowers. Something\nmakes him stop, and see the sunlit clouds in the deep blue sky, the colors around him, hear the\nbuzzing of the bees, feel the kill of the air.\n\nA sudden flash of memory\n\nHis beautiful wife, in green field not unlike this one, laughing, tossing her hair, falling\nback into the long grass.\n\nBack to Algren\n\n                                                                                                  61.\n\nThe force of the memory causes him to link to the ground.\n\nAnother flash of memory, longer this time:\n\nHis wi fe leans over and kisses his mouth, and his cheek, and his forehead. He holds\nher al tightly as be can.\n\nBack to Algren\n\nAs tears begin to course down his face, and he sinks down into the flowers and the grass,\nlooking up into the impossibl y beautiful sky. He gives in to the sobs wracking his body.\n\nEXT.          VILLAGE                              DAY\n\nAs Algren returns with the water, he sees Katsumoto approaching with Ujio and several warriors.\n\n                                           KATSUMOTO\n                           The Emperor has requested my presence.\n                           We leave tomorrow. You will be released in Tokyo.\n\nHe goes. Algren stands, not sure how to react.\n\nINT.             YORITOMO'S HOUSE                         NIGHT\n\nAlgren writes on parchment by the light of an oil lamp.\n\n                                             ALGREN (V.O.)\n                           April 13, 1877. Tomorrow we return to\n                           civilization. As eager as I am to be among my\n                           own kind, I confess to a curious reluctance.\n\nEXT.         KATDUMOTO'S VILLAGE                     DAWN\n\nAlgren stands overlooking the village as the sun rises over the misty peaks.\n\n                                           ALGREN (V.O.)\n                           These months have marked me, and I don't fully\n                           know yet wh y.\n\nEXT.                 YORITOMO'S HOUSE                     DAY\n\nAlgren prepares to mount up. Yoritomo says goodbye to his family.\n\n                                              ALGREN (V.O.)\n                           I do know it is here that I have known my first\n                           untroubled sleep in many years.\n\nTaka comes to Algren, bows her head.\n\n                                             TAKA\n                                   (subtitles)\n                           You are alwa ys welcome in our home.\n\n                                             ALGREN\n                           Domo Arrigato.\n\nHe glances at the unfinished house.\n\n                                                                                        62.\n                                              ALGREN\n                                   (subtitles)\n                           ...You will finish it soon.\n\n                                                TAKA\n                                      (subtitles)\n                           If that is my destiny.\n\nShe bows her head again. Toshiie hands him a scroll: it is a picture of the\nFamily. Algren is included. Japanese characters list all their names.\n\nToshiie bows. Algren bows and tucks the scroll into his coat.\n\nAlgren and Yoritomo move out with Katsumoto, Ujio, Nakao and his bodyguard of several\ndozen Samurai.\n\nThe villagers bow and honor the warrior as they pass.\n\n\nEXT.                    MOUNTAINOUS LANDSCAPE                             DAY\n\n\nAlgren trots alongside Katsumoto.\n\n                                             ALGREN\n                           ... The Emperor sends a message for you to return\n                           to Tokyo, and you go?\n\n                                             KATSUMOTO\n                           Yes.\n\n                                            ALGREN\n                           Even though you're in rebellion against him.\n\n                                             KATSUMOTO\n                           Against the Emperor? Never. I serve him. As\n                           I have alwa ys done.    .\n\n                                             ALGREN\n                           I don't understand.\n\n                                            KATSUMOTO\n                           Our Emperor is young, and there are things I must\n                           sa y to him.\n\n                                             ALGREN\n                           But ever yone around him wants you dead.\n\n                                           KA TSUMOTO\n                           And if the Emperor desires, I will take my own life at his\n                           command.\n\nHe spurs his horse and rides on. A1gren watches him.\n\n                                                                                                       63.\nEXT.         MOUNTAIN VALLEY                               SUNSET\n\nThey approach a large inn.\n\nA boy working in the fields see Katsumoto approaching. He doesn't believe\nit -- the Great Katsumoto. He drops his hoe and races awa y, calling out.\n\n                                              KATSUMOTO\n                             We will stop here for the night.\n\nEXT.                      MOUNTAIN VALLEY                              SUNSET\n\nSamurai guards have been posted around the perimeter.\n\n\nINT.         KATSUMOTO'S RQOM                              NIGHT\n\nAlgren is escorted in. Katsumoto kneels at a table. Preparing the traditional Japanese tea ceremony.\n\n                                                KATSUMOTO\n                             Sit, Captain.\n\nAlgren sits. By now he has learned how to sit on the ground. Katsumoto begins the exacting, delicate and\nprecise tea ceremony.\n\n                                              KATSUMOTO\n                             Do you drink tea?\n\n                                                  ALGREN\n                             I've had little else for some time...\n\nKatsumoto continues with the tea ceremony.\n\n                                            ALGREN\n                             How's your poem coming?\n\n                                              KATSUMOTO\n                             I am having trouble. The truth is I am not a very\n                             good poet.\n                                     (Algren smiles)\n                             Do you know wh y you were sent here? To\n                             Yoshino.\n\n                                                ALGREN\n                             To protect the railroad.\n\n                .                              KATSUMOTO\n                             Why is the railroad here?\n\n                                             ALGREN\n                             So Tokyo can control the whole country.\n\n                                                                                                       64.\n                                           KATSUMOTO\n                           You have seen my province. All mountains.\n                           Far from Tokyo. Yet the rail line must come\n                           here?\n\nKatsumoto tosses a tiny bit of coal on the simmering brazier on the table. Algren watches carefully.\n\n                                           ALGREN\n                           You have something they want\n\n                                           KATSUMOTO\n                           What do they want in my mountains?\n\n                                                ALGREN\n                           Minerals ... Gold.\n\n                                                KA TSUMOTO\n                                    (smiles)\n                           There is no gold in Japan.\n\nKatsumoto gently blows on the coal brazier. The coal flares a bit.\n\n                                                ALGREN\n                           Coal?\n                                    (Katsumoto looks at him)\n                           For steamships.\n\n                                          KA TSUMOTO\n                           And why would steamships be so important?\n\n                                                ALGREN\n                           ...China.\n\nKatsumoto looks up at him. Impressed.\n\n                                            KATSUMOTO\n                           Japan has nothing. China has ever ything.\n\n                                              ALGREN\n                           Mine the coal to create a way station for the trip to\n                           China ... Freeze the Europeans out and Japan and\n                           America have a monopol y on the China trade.\n\n                                            KATSUMOTO\n                           Add to this the Omura Zaibatsu. You know the\n                           Zaibatus?\n\n                                           ALGREN\n                           The wealthy families.\n\n                                                                                                       65.\n\n\n                                              KATSUMOTO\n                           As patron of the railroad, Omura owns all land within\n                            four hundred feet of ever y new rail line. As my country\n                           grows, so will his wealth.\n                                    (looks at him)\n                           This is why you are fighting.\n\nKatsumoto completes the tea ceremony. He pours a cup for Algren. Bows his head and offers it to him.\n\n                                              ALGREN\n                           And you will tell the emperor to stop them?\n\n                                              KATSUMOTO\n                           I do not tell the emperor what to do.\n\n                                           ALGREN\n                           Then what do you hope to accomplish?\n\nKatsumoto looks at Algren, the slightest gleam in his eye.\n\n                                             KATSUMOTO\n                           Will you return to America?\n\nAlgren watches him -- why didn't Katsumoto answer?\n\n                                              ALGREN\n                           ...I have a job here.\n\n                                            KATSUMOTO\n                           You should return to your home.\n\n                                             ALGREN\n                           Why?\n\n                                            KATSUMOTO\n                           Because I do not wish you to be m y enemy again.\n\nKatsumoto returns to his poem, he does not look up.\n\n                                           KATSUMOTO\n                           Go home Captain ... Anshinritsumai. I wish you peace.\n\nAlgren waits but Katsumoto just continues to work on his poem.\n\nEXT.                      AROUND THE INN                                 NIGHT\n\nThe samurai guards are alert, their senses heightened to almost superhuman proportions.\n\nBut there is another way. Another way of learning combat. A wa y without the\nbeaut y, the philosophy and the moral code.\n\nThey are almost imperceptible at first... their head-to-toe black clothes a perfect\ncamouflage... their silence and stealth are otherworldly.\n\n                                                                                                     66.\n\nThey were then known as Shinobi, masters of stealth and spying.\n\nWe know them as Ninjas.\n\nThey float across the ground ... creeping an inch ever y hour... complete\nphysica1 control. One black-gloved finger moves. Then the next...\n\nThey crawl and then wait\n\n\nPoised on their fingertips and toes.\n\nThere is no sound as they strike.\n\nThe samurai guards are garroted in an instant. Other Ninjas catch the\nsamurai's weapons as they fall. No sound disturbs the peaceful night.\n\nEXT.                  INN -- FRONT DOORWAY                                  NIGHT\n\nSilence.\n\nTwo samurai guards are in position.\n\nOne of them glances up at the stars.\n\nA Ninja throwing star instantly slices into his jugular-- blood sprays -- the other\nguard turns ­ a series of Ninja slice into him...\n\nEXT.                    INN--WALLS                                  NIGHT\n\nSilence.\n\nThe Ninjas use mew claws to crawl up the walls like spiders.\n\nEXT.               INN ­ ROOF                               NIGHT\n\nSilence.\n\nA samurai guard stands at the edge of the roof. A Ninja silently moves\ntoward him. Stops. Ten feet awa y.\n\nHe pulls out a shuriken -- a small needle-shaped projectile, dips it into a sack of\npoison. Places it carefully into the palm of his hand. And with the flick of his\nwrist--\n\nThe needle flies -- stabbing into the samurai -- he crumples.\n\nOther Ninjas immediately pour over the edge of the roof -- catching the samurai before he falls...\n\nINT.                          INN -- KATSUMOTO'S ROOM                         NIGHT\n\nSilence.\n\n                                                                                                        67.\nKatsumoto cannot sleep. He stares out the window at a nightingale.\n\n\nINT.                       INN--UJIO'S ROOM                   NIGHT\n\nSilence.\n\nUjio sits in his room. He is unblinking. Alert. Swords at the ready.\n\nINT.                           INN ­ ALGREN'S ROOM                       NIGHT\n\nSilence.\nAlgren cannot sleep either. He sits leaning against a wall. Thinking.\n\nINT.                       INN -- MAIN HALL                     NIGHT\n\nSilence.\n\nYoritomo drinks tea with Nakao, the huge martial arts master.\n\n\nINT.                         OUTSIDE KATSUMOTO'S ROOM                         NIGHT\n\nA guard stands sentinel. Above his head, unbeknownst to him, two Ninjas descend on ropes.\nOne of them swings a long chain - to which I barbed-knife is attached.\n\nAs it lodges in the guard's chest, the second Ninja swings down just in time to catch the dead guard,\nsilently, before his body hits the ground.\n\nINT.                          INN -- KATSUMQTO'S ROOM                      NIGHT\n\nSilence.\n\nKatsumoto lies in bed listening to the night bird. It stops singing. Katsumoto smiles sadly. He\ndecides to give up on sleep, leans forward to rise.\n\nThis act saves his life.\n\n\nFor when the Ninjas come, they come all at once--\n\nA Ninja suddenly comes TEARING STRAIGHT THROUGH THE PAPER WALL, his sword\nslashing down .- just missing Katsumoto.\n\nKatsumoto calls out an alarm, diving and rolling across the floor for his sword. He instantly\nkills one Ninja using his steel-tipped \"war fan\" to slash his attackers throat. Another smashes\nin through the window.\n\nINT.                  INN -- MAIN H ALL                      NIGHT\n\nNinjas EXPLODE into the main hall. Samurai who come out of their rooms are cut down by a\nvariety of weapons -- one takes a throwing star in the face, others are felled by the traditional\nninja-to, short swords ideal for fighting in confined spaces, chain-knives, nun-chaka and others.\n\n                                                                                                         68.\nMore Ninjas drop from the rafters on ropes.\n\n\nINT.                          INN -- ALGREN'S ROOM                              NIGHT\n\nA Ninja SMASHES through the paper wall -- Algren grabs the nearest object, a low tea table.\nand swings it at his head. The Ninja dodges the blow and slices at Algren with short-sword.\n\nAlgren barely avoids the blow by ducking behind a post as the sword LODGES\ndeep in the wood. Algren flings himself, bodily, at his attacker.\n\nINT.                      INN-- MAIN HALL                           NIGHT\n\nNinja throwing stars spin across the room, killing a samurai.\n\nYoritomo emerges from his room, readying his bow, but the dead samurai falls back\nblocking his wa y. From behind the rice wall, Yoritomo lets fly an arrow without even\nlooking.\n\nIt passes THROUGH the wall, killing the Ninja on the opposite balcony.\n\n\nINT.                         INN-- FIRST FLOOR                    NIGHT\n\nUjio screams a war cry and begins to battle his way up the stairs. With breathtaking moves, he slashes\nhands and limbs, forcing the Ninja back.\n\nNakao fights his wa y up beside him, desperately trying to reach Katsumoto's room. Using\nonly his bare hands he catches a Ninja's wrist and hurls him over the railing.\n\nINT.                         INN -- ALGREN'S ROOM                      NIGHT\n\nAlgren and the Ninja are in a death struggle, kneeing, gouging, butting. They awkwardly smash\nthrough a paper wall into the next room.\n\nINT.                     INN -- KATSUMOTO'S ROOM                      NIGHT\n\nKatsumoto wields his long sword in one hand and his short sword in the other. It is the first time\nwe have seen him in action and his movements are both beautiful and deadly.\n\nBut more Ninjas are pouring in through the window, threatening to overwhelm him.\n\nINT.                            INN -- ALGREN'S ROOM                    NIGHT\n\nRolling on the ground, Algren manages to grab a chopstick and STAB his adversary through the eye.\nHe picks up the fallen short sword and steps out into the hall.\n\nARROWS whiz past, thudding into the wall beside his head.\n\nINT.                     INN-- KATSUMOTO'S ROOM                          NIGHT\n\nKatsumoto, breathing heavily, his kimono shredded and bloody, is fending off the Ninjas' increasingly\nsavage attacks as Algren enters.\n\nAlgren SCREAMS, distracting them just long enough for Katsumoto to take advantage and kill one.\n\n                                                                                                               69.\nThen, just as a Ninja it about to kill Algren, Katsumoto FLINGS his short sword ... it pin-wheels across the\nroom, hitting Algren's attacker in the chest.\n\nWithout missing a beat, Algren pulls the short sword from the dying Ninja's chest and uses it to stab\nanother Ninja who, thinking Algren defenseless, has launched an attack.\n\nINT.                         INN -- MAIN HALL                       NIGHT\n\nUjio and Nakao are back to back, a perfect fighting machine as they fight their wa y to\nKatsumoto's rescue. They battle Ninjas wielding lethal kusarigamas, the Ninjas swing chains,\nthe attached blades slice the air--Nakao catches the chains and flinging the Ninja\nover the balcony.\n\nINT.               YORITOMO'S ROOM                           NIGHT\n\nYoritomo is pinned down. Darts and throwing stars shred the rice paper wall above him. He\npicks off another Ninja before changing his position.\n\nINT.                   INN-- KATSUMOTO'S ROOM                          NIGHT\n\nThe blazing sword battle continues.\n\nAlgren throws a beautiful painted standing-screen in front of an attacking Ninja,\nmomentarily confusing him. Then he stabs THROUGH THE SCREEN -as a blood-\nstain SPREADS across the pastoral painting.\n\nBut another Ninja catches Algren off-guard and slices at him with his short sword. As\nAlgren lifts his sword to parry the blow, HIS LITILE FINGER IS CHOPPED OFF.\n\nHe drops the sword, momentarily defenseless.\n\nAcross the hallway\n\nYoritomo has been watching the shadowpla y on the rice-paper walls.\nAlgren's attacker raises his blade to deliver the death blow.\n\nIn Katsumoto's room\n\nAlgren flinches involuntarily beneath the raised blade. Suddenly the Ninja JACKKNIFES\nas if punched by an unseen hand. As he spins, dead, to the ground, we SEE an ARROW\nlodged bet ween his shoulder blades. Yoritomo has FIRED blindly, through the wall ­\nkilling Algren's attacker.\n\nNearby, a Ninja hurls a throwing star at Katsumoto. With blind instinct Katsumoto\nturns and takes the blade in the meat of his arm.\n\nAlgren, meanwhile, has ripped the sleeve of his kimono into a tourniquet for his maimed hand.\nHe uses the rest of the fabric TO TIE HIS HAND TO HIS SWORD before launching himself\nback into the fray -- slicing an attacker just as he is about to impale Katsumoto.\n\nTogether, he and Katsumoto force the last two Ninjas through a paper wall to the next room.\nThey fight all the wa y through that room and BLAST through another paper wall to the next.\n\n                                                                                                    70.\nINT.                  INN ­ STAIRWAY                           NIGHT\n\nThe battle continues unabated on the stairs -- the Ninjas spring for position with\nincredible grace --perching and fighting on banisters, leaping from one level to the next.\n\n\nIt is a mayhem of flashing swords and flailing limbs and flyi ng arrows and spinning Ninja stars.\n\nSprays of blood splatter against the white rice paper walls.\n\nSome of the fighting is less than elegant. Men bite and wrestle and gouge to\nsurvive in close quarters.\n\nAll of them arc bloody and sweat y and dirty and tired, heaving for breath, their skin flayed\nopen, their kimonos ripped, their hands and arms and faces blood-stained.\n\nBut more samurai reinforcements follow Ujio up the stairs: Together with Yoritomo\nand Nakao, they have begun to gain the upper hand.\n\nUjio flings both his swords through the air -- killing two Ninjas -- and dives to\nfight others - his martial arts skills are dazzling.\n\nAlgren and Katsumoto are fighting sidc by side\n\nAnd we cut to --\n\nEXT.                INN                             NIGHT\n\nOutside of the inn, we slowl y pull away...\n\nThe sounds of the battle gradually fade...\n\n\nSoon it is nothing more than a lovel y rustic inn nestled in the mountains.\n\nINT.                          INN ­ STAIRWAY                        NIGHT\n\nLater. The battle is over.\n\nNinja and samurai corpses litter the inn.\n\nWe slowl y move up the long stairwa y from the bottom...\n\nYoritomo pulls a Ninja star from Nakao's_shou1der. Then one from his own.\n\nWe move up another level, past more bodies...\n\nUjio moves through the Ninjas. Making sure they are dead. Before sheathing\nhis sword, he angrily FLICKS it at the rice paper wall, spattering it with the bloody spray.\n\nKatsumoto wipes his sword on a nearby corpse, replaces it in its sheath. He sits beside\nAlgren on a stair. Both men are exhausted. Bloodied. Alive.\n\nA long beat as we watch the two warriors.\n\nSlow fade to...\n\n                                                                                        71.\n\nEXT.                TOKYO -- IMPERIAL PALACE                     DAY\n\nAlgren, Katsumoto and the others are nearing the palace. Algren slows to a\nstop -- his path is toward the city. Katsumoto stops, looks at him, then does\nsomething absolutel y extraordinary.\n\n\nHe kneels and bows before Algren. Quickly touching his head to the dirt.\n\n\nThen he rises, turns and walks toward the palace.\n\n\nAlgren stands, stunned.\n\nEXT.                  PARADE GROUND                              DAY\n\nAlgren walks onto the parade ground. The change he sees could not be more remarkable.\nThousands of new Japanese troops are drilling with new bolt-action Mausers. They\nare precise, exact and frighteningly mechanistic, their uniforms new and crisp.\n\nNew German advisors are barking commands. Colonel Bagley sees him.\n\n                                          BAGLEY\n                           Algren? My God, you never cease to astonish.\n\nBagley runs over, hand extended, but Algren turns to look at the troops.\n\n                                          ALGREN\n                           They have new weapons.\n\n                                              BAGLEY\n                           The Kaiser was only too happy to help. Along\n                           with his friends at Mauser and Krupp. Thank God we\n                           Americans still have a few teeth in our head.\n\nAnd they come to the \"teeth.\" Howitzer cannons. A row of them. Artillery\nofficers in US Army uniforms arc instructing Japanese offi cers.\n\n                                             BAGLEY\n                           The ambassador and I have spent eight months\n                           kissing Omura's ass so he'll sign the damn trade\n                           pact with us. You spent all this time living with\n                           those savages?\n                                    (A1gren looks at him)\n                           He's going to want to talk to you...\n\n                                              ALGREN\n                           I need a bath.\n\n                                           BAGLEY\n                           And your back pay, I imagine.\n\nAlgren starts walking away.\n\n                                                                                                    72.\n\n                                             BAGLEY\n                           They got their flag. ...See?\n\nAnd we see it... snapping on I flagpole high above the parade ground.\n\n\nIt is immediately familiar. A red circle on a white field. The Rising Sun.\n\nThe Howitzers fire in sequence. Thundering blasts that shake the heavens.\n\n\nEXT,               ROYAL TEMPLE                               DAY\n\n\nOmura stands above Emperor Meiji respectful but persistent.\n\nThe Emperor is kneeling, tending to his iris garden. It is one of the wonders of the Palace: a\nsea of white, pink, blue, and purple blossoms.\n\nRetainers and servants stand at a distance. One holds a standard with the Imperial seal: a yellow\nchrysanthemum.\n\nOmura sees Katsumoto making his way toward them. He talks a bit more quickly to the Emperor.\n\nKatsumoto begins to prostrate himself before the Emperor, the usual sign of extreme\nrespect -- but the Emperor stops him:\n\n                                             EMPEROR\n                                   (subtitles)\n                           No, Mori-san. We arc \"civilized\" now.\n\nKatsumoto stops prostrating himself. The Emperor offers his hand.\n\n                                              KATSUMOTO\n                                    (subtitles)\n                           I cannot touch the Sacred One.\n\n                                             EMPEROR\n                                   (subtitles)\n                           You can.\n\nIt is a difficult moment for Katsumoto. He simply cannot do It.\n\n                                             OMURA\n                                   (subtitles)\n                           Did you have a pleasant journey, Minister Katsumoto?\n\n                                              KATSUMOTO\n                                    (subtitles)\n                           It was uneventful.\n\nOmura appreciates Katsumoto's droll response. He assumes that Katsumoto is aware of\nhis part in the assassination attempt.\n\n                                                                                          73.\n\n                                              EMPEROR\n                                    (subtitles)\n                         If it is not a great imposition. I desire a moment alone with\n                         Minister Katsumoto. Omura-San.\n\n                                           OMURA\n\n                                   (subtitles)\n                         Enlightened One, perhaps I can be of service in a conversation\n                         of state.\n\n                                            EMPEROR\n                                  (subtitles)\n                         So kind of you, but I fear my old teacher wishes to upbraid\n                         me in private for neglecting my studies.\n\nOmura bows his head quickly and goes.\n\n\nSilence. The Emperor gazes at Katsumoto. Then:\n\n                                           EMPEROR\n                                 (subtitles)\n                         You rise against me, my teacher.\n\n                                           KATSUMOTO\n                                 (subtitles)\n                         No, Highness, I rise against your enemies.\n\n                                           EMPEROR\n                                 (subtitles)\n                         They are my teacher, my advisers, like you.\n\n                                           KATSUMOTO\n                                 (subtitles)\n                         They advise in their own interest.\n\n                                             EMPEROR\n                                   (subtitles)\n                         The world is changing, Mori -- you have not seen what\n                         goes on beyond our borders, the inventions, the science.\n                          I need men who can look outward, or soon we will be\n                         left behind, and defenseless.\n\n                                           KATSUM OTO\n                                 (subtitles)\n                         I am sworn to defend you even to my last breath.\n\n                                            EMPEROR\n                                   (subtit1es)\n                         The samurai live in the past. You cannot defend against\n                         a future you don't understand.\n\n                                                                                         74.\n                                            KATSUMOTO\n                                  (subtitles)\n                         If I am no use, then I will happily end my life,\n\n                                            EMPEROR\n                                  (subtitles)\n                         No, Mori. It is my wish that you rejoin the Council of State.\n                         I need your voice.\n\n                                             KATSUMOTO\n                                   (subtitles)\n                         It is your voice that needs to be heard, Highness. You\n                         are a living God, you can do what ever you\n                         think is right.\n\nThe young emperor is silent a moment.\n\n                                             EMPEROR\n                                   (subtitles)\n                         I am a living God only as long as I do what they\n                         think is right.\n\n                                            KATSUMOTO\n                                  (subtitle)\n                         Your Highness, may I beg forgiveness for saying\n                         what a teacher must, that such a statement is pathetic\n                         drivel not worthy of an ignorant stable boy, let alone\n                         a young man I know to have some modest intelligence.\n\nThe emperor laughs warmly, almost happy to be scolded as he once was.\n\n                                              EMPEROR\n                                   (subtitles)\n                         Is it possible a living God can be too afraid to make\n                         his voice heard?\n                                   (Katsumoto's look is not unkind)\n                         Tell me what to do, Mori-San?\n\n                                           KATSUMOTO\n                                 (subtitles)\n                         You are emperor, my Lord, not me. You must find\n                         the wisdom for all of us.\n\nEXT.                YOKOHAMA WHARF                             DAY\n\nA series of warehouses, beyond which we see warships in the harbor. A1gren walks\nwith Bagley and two other OFFICERS.\n\nINT.                      WAREHOUSE                            DAY\n\n\nThe cavernous warehouse piled high with huge crates.\n\n                                                                                             75.\n                                                BAGLEY\n                             As soon as they sign the agreement, they're obligated\n                             to buy the entire weapons package, from Colt revol vers\n                             to Ha1liwell twelve-pounders. Plus this particular item\n                             you might recognize.\n\nA few stevedores tear open one of the crates. Algren hides his astonishment:\nA Gatling Gun is revealed.\n\n                                              BAGLEY\n                             They've been calibrated to fire 200 rounds a minute,\n                             The new copper cartridges cut down on jamming.\n\nAlgren closes his eyes, trying to keep his memories at bay.\n\nEXT.                           TOKYO STREETS                          DAY\n\nAlgren fights the crowds with Colonel Bagley And Ambassador Swanbeck..\n\n                                             ALGREN (V.O.)\n                             May 15, 1877. The city I return to is immeasurabl y\n                             changed\n\nNew construction ever ywhere. Telegraph wires strung next to an ancient\ntemple. A modern European hotel is going up, dwarfing the traditional Japanese\nbuildings. Huge billboards advertising Western goods. A new invention, the rickshaw,\nhas replaced many of the palanquins.\n\n                                             ALGREN (V.O.)\n                             As though Tokyo were determined to become\n                             another New York or Chicago .- all in one\n                             headlong rush.\n\nSpider's web of telegraph cables spread from a tall new brick building.\nIt is like a New York office building stabbing into the heart of old\nJapan.\n\nThe familiar Omura character is emblazoned on the side.\n\n.INT.             OFFICES OF THE OMURA ZAIBATSU                                        DAY\n\nAside from the occasional bit of Japanese decor, this could be a buzzing Wall Street firm.\n\nTelegraph operators click away. Accountants use adding machines. Secretaries\nuse pneumatic tubes to send documents back and forth. Engineers plot out\nrailway lines. All are dressed in Western clothes.\n\nAlgren, Colonel Bagley, and Ambassador Swanbeck enter.\n\n                                               AMBASSADOR SWANBECK\n                                      (to Algren)\n                             If he asks, you can talk about ordnance and tactics.\n                             But remember, this has to do with a lot more than\n                             just weapons.\n\n                                                                                                        76.\n\nAn anteroom holds waiting delegations from the various European powers.\nA babel of language. ... French ...Dutch ...Russian ...German.\n\nA pretty American secretary looks up from her desk.\n\n                                         SECRETARY\n                           Ambassador Swanbeck, if you'll follow me.\n\nSome of the delegates arc craning forward, watching Algren and the others hungrily\nas they head into the final office.\n\nINT.             OMURA'S OFFICE                            DAY\n\nOmura stands like an industrial titan before large picture windows offering a dramatic view of Tokyo.\nThe only decoration in the room is an enormous Caravaggio.\n\n                                             OMURA\n                           Please, sit down, gentlemen.\n\nOmura removes a gold cigarette case and lights up. Cigarettes are the newest Western fad\nSweeping Japan.\n\n                                               OMURA\n                                     (re: cigarette case)\n                           A gift from Czar Alexander... Captain Algren,. it seems\n                           you have endured your captivity with little ill-effect.\n\n                                             ALGREN\n                           Yes, sir.\n\n                                             OMURA\n                           He's an extraordinary man, isn't he?\n\n                                             ALGREN\n                           He is samurai.\n\nOmura gazes at him. Slowl y takes I puff from his cigarette.\n\n                                             AMBASSADOR SWANBECK\n                           Mr. Omura, my people have been drawing up the documents\n                           we discussed. I have a draft--\n\n                                             OMURA\n                           We're not quite ready to announce the treaty, Ambassador.\n\n                                             AMBASSADOR SWANBECK\n                           Excuse me?\n\n                                              OMURA\n                           The Emperor is...sentimental. Katsumoto was his old mentor--\n                           he is not eager to offend him. It will take I few more days.\n\n                                                                                      77.\n                                         AMBASSJ\\DOR SW ANBECK\n                         How many da ys is \" a few?\"\n\n                                           OMURA\n                         I assure you the Samurai will not stand in the\n                         wa y of our agreement. You are prepared to make deliver y?\n\n                                        AMBASSADOR SWANBECK\n                         Soon as your emperor signs on the dotted line.\n\n                                           OMURA\n                         Captain Algren you are the expert. Will this array of\n                         ordnance be sufficient?\n\n                                         ALGREN\n                         Depends on what you're trying to accomplish.\n\n                                          OMURA\n                         I want my country to take its place as a modern power.\n\n                                           ALGREN\n                         Then they will set you well on your way.\n\n                                           OMURA\n                         I am pleased.\n\n\n\n                                          AMDASSADOR SW ANBECK\n                         Mr. Omura, you assured us you had the influence\n                         with your emperor to make this deal come to\n                         pass. With all due respect perhaps there is someone\n                         else we should be speaking to.\n\n                                           OMURA\n                         With all due respect, Ambassador, perhaps there is\n                         someone else we should be speaking to, for instance the\n                         French. Or the English. Or any of the legations waiting\n                         in the next room.\n\nAmbassador Swan beck stands swallowing his rage.\n\n                                          AMBASSADOR SWANBECK\n                         Yes, we1l, we look forward to hearing from you.\n\n                                          OMURA\n                         Good afternoon, gentlemen.\n\nThey start to go.\n\n                                          OMURA\n                         Captain Algren, perhaps you can stay a moment\n                         And tell me of your experiences in our rebellious\n                         provinces.\n\nBagley looks at Algren. Do as he asks. He leaves A1gren alone with Omura.\n\n                                                                                       78.\n\n                                            OMURA\n                          Cigarette?\n\n                                            ALGREN\n                          Thank you.\n\n\nOmura lights his cigarette. A moment as he takes Algren's measure.\n\n                                             OMURA\n                          You fought bravely on behalf of our army--\n                          against the rebel Katsumoto.\n\nAlgren says nothing.                            .\n\n                                           OMURA\n                          And yet you helped save his life when attacked\n                          by the Ninja.\n\n                                         ALGREN\n                          My role was much less significant than you may have heard.\n\n                                           OMURA\n                          Tell me about your role in Katsumoto's plans.\n\n                                            ALGREN\n                          I have none.\n\n                                         OMURA\n                          And your sympathies?\n\n                                            ALGREN\n                          Again, I have none.\n\n\n                                           OMURA\n                          I know you have little sympathy for Colonel Bagley.\n\n                                           ALGREN\n                          He is.... unsympathetic.\n\nOmura smiles.\n\n                                            OMURA\n                          I thought it was we who are inscrutable.\n\nNow it is Algren who smiles.\n\n                                           OMURA\n                          You have gained important knowledge of Katsumoto's\n                          province, his army, and his rebellion. This is extremely\n                          valuable to me.\n\nHe watches Algren to see how this lands.\n\n                                                                                           79.\n\n                                            OMURA\n                           You also possess significant knowledge of m y army, my\n                           weaponry, and my plans. This is extremely va1uable to\n                           Katsumoto.\n\n                                             ALGREN\n                           Again, you flatter me.\n\n                                               OMURA\n                           No. I am a businessman. I recognize what is valuable.\n                           And I buy it.\n                                     (looks at him)\n                           In this case, I value your loyalt y.\n\nAlgren considers the implications of what Omura is saying.\n\n                                             ALGREN\n                           I didn't know loyalt y was something that could be sold.\n\n                                             OMURA\n                           Then perhaps you will give it, as a token of future\n                           friendship - for which, as a friend, I would be in your debt.\n\n                                             ALGREN\n                                   (stands)\n                           Then I will consider it.\n\n                                             OMURA\n                           And I will be grateful.\n\nINT.                    SHIPPING OFFICE                      DAY\n\n\nAlgren is in a shipping office. A clerk consults his schedule of departure.\n\n                                              CLERK\n                           All righteee, the ANDREW JACKSON leaves tomorrow ­\n                           if you want a steamship you'll have to wait six weeks.\n                                    (Algren is silent)\n                           Gets ya to Frisco by the 28th. 14 dollars for a\n                           private cabin, 8 for a shared or 3 for a lower berth.\n                           What can I put you down for?\n\nAlgren is silent, concentrating on a calendar hanging behind the clerk. It\nfeatures a beautiful Hiroshigi watercolor of mountains.\n\n                                              CLERK\n                           Sir..?\n\n                                              ALGREN\n                                    (after a moment)\n                           Private cabin.\n\n                                                                                                  80.\nEXT.                   TOKYO ­ STREET                             DAY\n\n\nGraham walks with Algren.\n\n                                             GRAHAM\n                            Leave? Wh y would you leave now? No white\n                            man has ever been in your position. Do you\n                            have any idea what it will mean to have Omura\n                            as your friend? You want land, you want women,\n                            you want boys?\n\nAlgren starts to walk faster, but Graham Stops him.\n\n                                                GRAHAM\n                            Nathan. I wanted to leave, too. For three years.\n                            You must believe me there is a majest y about\n                            these people -- can you imagine what your own\n                            country would be if it had half the drive and the\n                            discipline and the belief and the bravery of these\n                            ridiculous little people?\n\nThen raised voices from across the street stop them.\n\nThey see Yoritomo surrounded by four Imperial Army soldiers. The soldiers\nare rough and imperious, drunk with power. They carry gleaming rifle..\n\nThe soldiers bark orders. Yoritomo stands proudly, responding calmly.\n\n                                               ALGREN\n\n                            Whit is this?\n\n                                              GRAHAM\n                            My God, it's the edicts...\n\n                                               ALGREN\n                            What edicts?\n\nAlgren arrives as the situation is clearly growing volatile - the soldiers are\npointing to Yoritomo's head, screaming\n\n\nAlgren steps toward the soldiers--\n\n                                               ALGREN\n                            That's enough--\n\nOne of the soldiers SCREAMS at him -- raises his rifle -- all the soldiers raise their rifles ­\nYoritomo reaches for his sword -- Algren tries to push through -\n\n                                                                                              81.\n                                           ALGREN\n                                 (subtitles)\n                           YORITOMO, WAIT!\n\nOne of the soldiers smacks Algren in the chin with a rifle butt. Algren reels,\nand by the time he stands straight again, four others are pointing their\nba yonets at his face.\n\nGraham takes hold of Algren's arm.\n\n                                              GRAHAM\n                           Don't be stupid.\n\nAlgren makes eye contact with Yoritomo, who -- in deference to his friend --\nputs his sword away.\n\nThe Japanese soldiers continue to scream at Yoritomo. They force him to his knees.\nRifles pressed to his head.\n\nYoritomo bows his bead, speaking quietly, as if praying.\n\nAlgren witches in horror all one of the soldiers removes his bayonet -- another grab.\nYoritomo's hair, jerks his head back and begins hacking off Yoritomo's traditional top-knot\nof hair. Brutally. Blood.\n\nYoritomo remains kneeling, head down, blood flowing down his face.\n\nThe soldiers laugh and move off.\n\nAlgren kneels by Yoritomo. Yoritomo looks up at him. There are tears in\nhis eyes.\n\nEXT.                  KATSUMOTO'S HOUSE                                    DUSK\n\nKatsumoto's house on the outskirts of Tokyo is spacious and\nharmonious. Utterly Japanese. Samurai guards in full regalia, stand\nmenacingly outside.\n\nINT.                   KATSUMOTO'S HOUSE                                   DUSK\n\nUjio kneels with Yoritomo, dressing the wounds on his head.\n\nGraham sits across the room talking quietly to the mammoth Nakao, taking\nnotes in a small notebook. Nakao has been brutally shorn of his top knot\nas well. His shame is apparent.\n\nINT.                     KATSUMOTO'S CHAMBER                          DUSK\n\nServants he1p dress Katsumoto in his exacting samurai wardrobe as Algren is ushered in.\n\n                                             KATSUMOTO\n                           Captain, I had not thought to see you again.\n\n                                                                                      82.\n                                             ALGREN\n                          I'm leaving tomorrow. But before I go I need to\n                          tell you what's going on here.\n\n                                            KATSUMOTO\n                          You mean the Gatling Guns and the howitzers,\n                          is that how you sa y it?\n\n                                             ALGREN\n                          They're about to close a trade agreement that\n                          will bring this country more weapons than\n                          you can imagine.\n\n                                            KATSUMOTO\n                          Yes, if the emperor agrees - but Omura knows\n                          the Emperor must be convinced there is cause to\n                          need those weapons before be will sign.\n\n                                           ALGREN\n                                  (realizing)\n                          And you are to be the cause...\n\n                                              KATSUMOTO\n                          Elegant, isn't it? Omura passes laws sure to cause\n                          a samurai revolt, creating a need for the weapons.\n                          The Emperor sees that the weapons are needed\n                          so he agrees to the entire treaty, giving your\n                          country what it wants and the Omura Zaibatsu\n                          what it wants. And my country is sold to yours.\n\nAs Katsumoto dresses, Algren notes that Katsumoto's body it at battleground\nof old scars, so like his own.\n\n                                            KA TSUMOTO\n                          Today the Council passed two edicts. The first called for\n                          the elimination of our traditional topknots.\n\n                                             ALGREN\n                          I know.\n\n                                          KATSUMOTO\n                          The second banned the wearing of sword.\n\nAlgren stops. He knows what swords mean to the samurai.\n\n\n                                            KATSUMOTO\n                                  (re: his swords)\n                          Hand them to me, will you?\n\nAlgren picks up Katsumoto's two swords. Looks at him deeply.\n\n                                             ALGREN\n                          If you do this, they will kill you.\n\n                                                                                                         83.\n                                                KA TSUMOTO\n                           I am hard to kill.\n\n                                           ALGREN\n                           You don't know what their weapons can do. All\n                           your men butchered ... Just for pride.\n\n                                             KATSUMOTO\n                           Not for pride. For the emperor.\n\n                                            ALGREN\n                           But the emperor is the one signing the agreement.\n\n                                            KATSUMOTO\n                           He has not signed it yet.\n\nHe holds out Katsumoto's two samurai swords.\n\n                                                 ALGREN\n                           Is it worth it? ... just for these,\n\n                                             KATSUMOTO\n                           I cannot live without my soul ... Can you?\n\nThey regard each other.\n\n\nEXT.                      OUTSIDE KATSUMOTO'S HOUSE                           NIGHT\n\nAlgren leaves Katsumoto's gate and sets off on foot.\n\n\nEXT.                        TOKYO STREETS                               NIGHT\n\nAs Algren walks, he becomes aware that he is being followed. Two dark figures\nlurk some distance behind him. After a few moments, he whips around to face\nthem. They stand for a moment, then melt away into the shadows.\n\nINT.                      COUNCIL OF STATE CHAMBER                          NIGHT\n\nThe Council of State meets in an august chamber. Many of the Council\nmembers wear Western clothes. Cigarette smoke billows.\n\nThe young Emperor sits on a dais off to the side, as befits his\nceremonial role in the proceedings.\n\nOmura is speaking ... be stops ... looking at something ... all the Council members turn ... and gape.\n\n\nKatsumoto strides into the chamber, his swords proudly displayed.\n\n                                              OMURA\n                                    (subtitled)\n                           Minister Katsumoto, you honor us.\n\n                                                                                            84.\n                                              KATSUMOTO\n                                    (subtitled)\n                          It is my honor to join again the men who are leading\n                          Japan into her glorious future.\n\n                                            OMURA\n                                  (subtitled)\n                          You arc perhaps unaware of this Council's edict\n                          regarding the wearing of swords?\n\n                                              KATSUMOTO\n                                   (subtitled)\n                          I read ever y edict with singular attention.\n\n                                            OMURA\n                                  (subtitled)\n                          Yet you would bring weapons into this chamber?\n\n                                            KATSUMOTO\n                                  (subtitled)\n                          This chamber was protected by m y sword for four hundred\n                          years--\n\n                                          OMURA\n                                 (interrupting, subtitled)\n                          We need no protection... We are a nation of laws now.\n\n                                             KATSUMOTO\n                                    (calm, subtitled) .\n                          We are a nation of whores. Selling ourselves to our Western\n                          \"allies.\"\n\nKatsumoto slowl y looks around at the Members of the Council, but his words are addressed\nto the Emperor.\n\n                                            KATSUMOTO\n                                  (subtitled)\n                          Does Japan no longer need its patriots?\n\nOmura speaks with quiet conviction and honesty.\n\n                                             OMURA\n                                   (subtitled)\n                          Who is the patriot? The man who would keep his\n                          country trapped in the past, or the man who would help\n                          his people into the future?\n\n                                             KATSUMOTO\n                                   (subtitled)\n                          A future with no honor,\n\n                                             OMURA\n                                   (subtitled)\n                          Honor means less to me than feeding our children. And\n                          teaching them. And giving them modern medicine so\n                          they will live.    .\n\n                                                                                     85.\n\n                                            KATSUMOTO\n                           And lining your own pockets in the process.\n\nThey stare at one another with barely concealed hostility.\n\n                                               OMURA\n                                     (subtitled)\n                           Minister Katsumoto, it is with great regret that I ask\n                           you to remove your sword, as this body has declared\n                           in its edict.\n\nKatsumoto's hand closes on his sword hilt\n\n                                            KATSUMOTO\n                           This sword serves the emperor, and only he can\n                           command me to remove it.\n\n\nKatsumoto looks to the Emperor, as murmurs fill the room.\n\n                                               OMURA\n                                    (quickly)\n                           Ah, but it is our tradition that the Emperor's voice is\n                           too pure and great to be heard in such worldly\n                           circumstance as the Council of State.\n\nOne last time, Katsumoto meets the Emperor's eye.\n\n                                             KATSUMOTO\n                           Then, with great regret, I must refuse to give up my\n                           sword.\n\nOmura looks to his associates, and a silent decision is made.\n\n                                             OMURA\n                           Minister Katsumoto, I must invite you to\n                           accompany our soldiers to Himeji Castle, where\n                           you will be our honored guest. I think you will\n                           find the surroundings there quite harmonious.\n\nGuards with Mauser rifles move into position around Katsumoto. He turns to\nthe other Council members. Looks at them.\n\n                                              KA TSUMOTO\n                                    (subtitled)\n                           Brothers ... One day you will know what you have done\n                           and feel what I never will ... shame.\n\nOmura nods to the guards. The guards lead Katsumoto out.\n\n                                                                                                  86.\nEXT.                            LIVING QUARTERS                       AFTERNOON\n\nA BEARER is loading the last of Algren's luggage on the back of a rickshaw.\nAlgren emerges from the building, sees the same two disreputable MEN\nwho followed him earlier lurking nearby.\n\nHe resists the temptation to confront them. Instead he climbs into the\nrickshaw and it starts off.\nBut a moment later, Graham has jogged alongside, huffing and puffing.\n\n                                                      GRAHAM\n                                     Thought I'd missed you. Were you going to leave\n                                     without even saying goodbye?\n\n                                                        ALGREN\n                                     I have a fear of sentimental Englishmen.\n\n                                                       GRAHAM\n                                     You sod.\n                                              (trying to keep up)\n                                     Christ, give us. . second here\n\nAlgren indicates for the bearer to stop. Graham tries to catch his breath.\n\n                                                       GRAHAM\n                                     You're making a mistake, I promise you.\n                                     Katsumoto's under house arrest, Omura's made\n                                     his move -- he'll need you more than ever --\n\nGraham stops, sees the look on Algren's face, realizes.\n\n                                                        GRAHAM\n                                     Oh, my goodness. How silly of me.. All that\n                                     time you were with him, up in those mountains,\n..................................   ...I told you they were a remarkable people...\n\nAlgren doesn't answer, but isn't denying it either.\n\n                                                     GRAHAM\n                                     Then you should get out. Because Omura will\n                                     become rather impatient with anyone who isn't on the team.\n\nGraham notices Algren staring at his followers.\n\n                                                       GRAHAM\n                                     Case in point.\n\n                                                       ALGREN\n                                     Who are they?\n\n                                                       GRAHAM\n                                     Ronin would be m y guess. Disgraced samurai\n                                     doing odd jobs for his Nibs.\n\n                                                                                 87.\n\n                                           ALGREN\n                           What do they want from me?\n\n                                            GRAHAM\n                           To make sure you're on the side of God and\n                           Country, or to make sure you get the hell out.\n\n                                            ALGREN\n                           You've been a great help, Graham. I thank you.\n\n                                            GRAHAM\n                           Look who's getting sentimental now.\n\nA look bet ween them, then Algren nods for the bearer to continue.\n\n\nEXT.                  HARBOR                             SUNSET\n\nAlgren stands at the gangplank. Porters wait with his luggage. Algren looks\nback into the crowd and sees the ronin. They glare back, no longer trying to\nkeep out of sight.\n\nA BLAST from the steam whistle.\n\nAlgren looks from the ship, to the ronin, to the bustling, chaotic city behind\nthem. Finally, he looks out at the harbor and the ocean, beyond which\nused to lie his home.\n\nHe turns to the bearer.\n\n                                             ALGREN\n                                   (subtitles)\n                           Take back to quarters. I walk.\n\nAnd Algren starts back into the city.\n\nEXT.             TOKYO STREETS               EVENING\n\nDown a shadowy street, lit only by t orches. Slowl y we realize he is being\nfollowed and that he knows it.\n\nUp ahead, the street appears to dead-end.\n\nThe two Ronin step out from the shadows and face him, their hands on\ntheir swords.\n\nBehind him, Another dangerous looking Ronin joins the one who has been\nfollowing him.\n\nThey begin to close in.\n\nAlgren stands completely still. They grow closer.\n\nAlgren appears to close his eyes. And the sound of the approaching footsteps\nfades as We HEAR ONLY the sound of his breathing.\n\n                                                                                                             88.\n\nThe Ronin draw their swords.\n\nAlgren gently opens his eyes. Ever ything has SLOWED DOWN: a sign in\nthe breeze, a piece of rubbish on the street, the flame of a nearby torch.\n\nA BLUR OF MOTION.\n\nEverything happens so fast it is hard to tell just what has taken place. In the\nstrobing shadows, all we really know is that Algren has leapt to the attack.\n\nWithin seconds, four bodies lie in the street\n\nAlgren holds bloody sword.\n\nHis face is cut and a sleeve of his jacket is ripped, but other than that he is\nunharmed. Ujio has taught him welt\n\nAs he stands, catching his breath, we HOLD on his face in CLOSE-UP.\n\nA sudden flash:\n\nWe see Algren grab one of the torches and smash it across the ronin's face.\n\nIt is the attack ­ replayed in real-time.\n\nRolling to avoid a death-blow, he grabs the fallen man's sword and eviscerates attacker #2.\n\nThe two remaining Ronin strike.\n\nHe parries the blow of attacker #3, whirls to slice the legs of attacker #4,\nwhirls again to cut off the hand of attacker #1, who has returned to the attack.\n\nMeanwhile, attacker #3 serums and charges -- just lit attacker #4 is trying to stand.\n\nAlgren steps back as attacker #3 impales attacker #4. Algren steps forward and cuts off the head of attacker #3.\n\n\nEven now, it has happened too fast to be truly appreciated.\n\nBACK TO THE STREET\n\nWe move, closer-still on Algren's face.\n\nA sudden flash:\n\nAnd so we watch the attack again. in super-slow motion now, so we can fully\nappreciate it's terrible beauty.\n\nA torch smashes across a face.\n\nA sword slices the sleeve of a coat.\n\nSparks fly as two swords meet.\n\n                                                                               89.\nA severed hand falls in the dirt.\n\nBlood sprays from a decapitated head.\n\nA sword is wiped clean.\n\nBACK TO THE STREET\n\nIn real time, Algren kneels to examine one of the dead Ronin. On his arm is\ntattooed a familiar emblem:\nThe sign of the Omura Zaibatsu\n\n\nEXT.                OMURA CASTLE                       NIGHT\n\nOmura lives in a huge medieval castle on a promontory directly above Tokyo\nBa y. A testament to Japan's martial past.\n\nINT.                  CASTLE ­ TOWER                       NIGHT\n\nTwo guards arc: standing at attention in a dank corridor high in one of the\ntowers of the castle. Cell doors line the corridor.\n\nKatsumoto's samurai swords lean against the wall next to them.\n\nINT.                       CASTLE ­ CELL                           NIGHT\n\nKatsumoto kneels in a cramped cell. A sound draws his attention. He rises\nand looks out a barred window.\n\nBel ow he sees two rickshaws moving up the twisting road to the castle.\n\n\nINT.                       RICKSHAW                     NIGHT\n\nAlgren and Bagley, in formal dress uniforms, sit in one of the rickshaws.\nBagley looks him over.\n\n                                            BAGLEY\n                            Oughtta shave more often, Algren. Becomes you.\n\n                                             ALGREN\n                            Thought I would follow the Japanese fashion.\n\n                                             BAGLEY\n                            ...Heard you were leaving, actually?\n\n                                            ALGREN\n                            Why would I do that? Omura wants me to train his\n                            personal guard.\n\n                                             BAGLEY\n                            Certainly seems obsessed by you. Why do you\n                            think that is?\n\n                                                                                               90.\n                                           ALGREN\n                          Could it be my nose isn't permanently lodged up\n                          his ass?\n\nBagley shakes his bead, turns away. Algren stares up at the looming aide.\n\n\nEXT.                       CASTLE- MAIN GATES                               NIGHT\n\nThe two rickshaws stop by the heavily-guarded main gates. Guards check the occupants. Motion\nto other guards atop the gates.\n\nThe main gates slowl y swing open.\n\n\nEXT.                   CASTLE - COURT YARD                 NIGHT\n\nThe bearers lower the rickshaws. Algren and Bagley climb from one.\nAmbassador Swanbeck climbs from the other.\n\nEXT.              CASTLE -- RECEPTION CHAMBE R                         NIGHT\n\nOmura waits in elegant evening clothes. A woman plays a harp. The interior\nof Omura's castle is heavy, oppressive. Old Masters paintings dot the walls.\nLeather-bound boob. Chippendale furniture.\n\n                                             OMURA\n                          Gentlemen...\n\n                                          AMBASSADOR SWANBECK\n                          Omura, you have a lovel y home. It must be very old.\n\n                                             OMURA\n                          Nothing is \"old\" in Japan, ever ything is \"ancient.\"\n                          ... But the views are pleasant. Sit down...\n\nThey move to chairs by the roaring fireplace as Omura turns to Algren,\nnoticing the cut on his face, but saying nothing.\n\n                                             OMURA\n                          Do you know your Wagner, Captain? This is\n                          the 'Leibestod' from Tristan and Isolde.\n\n                                             ALGREN\n                          I'm surprised you enjoy it. Literally translated it\n                          means `love/death. '\n                                   (looks at him)         .\n                          A samurai concept, don't you think?\n\nThe two men take each other's measures. Servants appear with trays..\n\n\n                                        OMURA\n                          Champagne? And cigars, of course.\n\n                                                                                       91.\n\nServants light their cigars.\n\n                                                   BAGLEY\n                                         (re: cigar)\n                               A gift from President Grant?\n\n                                                 OMURA\n                                      (smiles)\n                               Queen Victoria.\n\n                                               ALGREN\n                               Mr. Omura, may I use the necessit y?\n\n                                                 OMURA\n                               Certainly.\n\n\nOmura summons a servant. The servant escorts Algren out.\n\n                                                 OMURA\n                               Now, Mr. Swanbeck, regarding our agreement, I noticed\n                               a discrepancy in paragraph seven in reference to the\n                               investment protocols for coal.\n\nINT.                           CASTLE ­ CORRIDOR                          NIGHT\n\nThe servant leads Algren through a corridor, head bowed.\n\nThen, stil1 puffing on his cigar, Algren taps the servant on the back, and as\nthe man turns, decks him. The servant falls.\n\nAlgren flicks hit cigar out onto the sloping roof. We FOLLOW the\nBURNING EMBER as it rolls off the roof and lands at the feet of TWO\nCURIOUS GUARDS.\n\nEXT.                     CASTLE COURTYARD                        NIGHT\n\nThe guards look up, trying to determine where the cigar butt has come from.\nBut their curiosity lasts only a moment: ARROWS pierce their necks,\nstrangling any sound.\n\nWe REVERSE to discover that one of the rickshaw-bearers has fired the\narrows. As he peels back his hood, we SEE it is Yoritomo.\n\nWe realize the other bearers are Ujio, Nakao, and Simon Graham. They\nhurry past the dead guards and up the stairs.\n\nINT.                 CASTLE APPROACH                            NIGHT\n\nThe three samurai and Graham race up the winding parapets.\n\nThree GUARDS round a corner. Swords flash as Ujio and Nakao dispatch\nthem without even slowing. They race on, Graham laboring to keep up.\n\n                                                                                  92.\nINT.                    CASTLE KEEP                     NIGHT\n\nAlgren rounds a corner--\n\nUjio, Yoritomo, Nakao, and Graham are moving toward him.\n\n                                              ALGREN\n                           This wa y...\n\nClearly, this has all been Algren's plan. They move up a stairwa y.\n\nINT.                CASTLE KEEP (SECOND FLOOR)                           NIGHT\n\nThe three guards are still standing at attention outside Katsumoto's cell.\nHis swords are next to them.\n\nAlgren keeps the others out of sight and lowers his head to whisper with\nUjio. Ujio nods, then walks into sight and calmly approaches the guards.\n\nStill hidden, Algren gestures for the others remain to silent. After a\nmoment, he gestures that they can proceed.\n\nAlgren and the others round the comer to discover the bloody remains of\nthe three guards - whom Ujio has dispatched in absolute silence. They unlock\nthe cell.\n\nINT.                   CASTLE ­ CELL                         FOLLOWING\n\nKatsumoto is shocked to see Algren enter. Algren tosses him his swords.\n\n                                           ALGREN\n                           How's the poem coming?\n\n                                            KATSUMOTO\n                           The ending is proving difficult.\n\nINT.                      CASTLE -- RECEPTION CHAMBER                     NIGHT\n\n\nOmura glances up from the documents.\n\n                                            OMURA\n                                What has become of Captain Algren?\n\nINT.                       CASTLE ­ CORRIDOR                          NIGHT\n\nAlgren, Katsumoto, and the others race through an upper corridor.\n\n                                           KATSUMOTO\n                                   (re:Graham)\n                           Who is this?\n\n                                          ALGREN\n                           Name's Simon Graham. Wants to write a book\n                           about you.\n\n                                                                                   93.\n\n                                                GRAHAM\n                           An honor. I have followed your activities with\n                           great interest. I think the European public\n                           would be fascinated by a book about your\n                           adventures.\n\n                                            KATSUMOTO\n                           Not a book. A play!\n\nSuddenly, from below, the raised voices of guards. They hurry a wa y.\n\nINT.               CASTLE ­ STAIRS                     NIGHT\n\nGuards carrying pikes race up the stairs--\n\n\nINT.                CASTLE ­ CORRIDOR                  NIGHT\n\nAlgren and the others are moving swiftl y down a stone corridor.\n\nThe sound of the approaching guards is growing louder.\n\nA silent WILD BUNCH moment of preparation as they stride down the\ncorridor, five abreast.\n\nAlgren pulls the cavalry saber from his dress uniform. Katsumoto prepares\nhis swords. Nakao stretches his huge arms. Yoritomo and Uji o draw their bows.\n\nEXT.                   CASTLE - UPPER COURTYARD                        FOLLOWING\n\nTen guards with rifles patrol the upper battlements.\n\nYoritomo and Uji o crouch and fire. Arrow a fter arrow a fter arrow, as\nfast as a repeating rifle, the arrows streak through the night.\nCompletely silent.\n\nIt is a dazzling display. They time shots to sail over walls, shoot through\ntiny windows, shoot out torches. Multiple arrows. Perfect aim.\n\nIn a matter of seconds all ten guards are dead.\n\nThey continue across the courtyard, up some steps --\n\nINT.             CASTLE--TIGHT CORRIDOR                         FOLLOWING\n\nThey stride through a tight, dark stone corridor.\n\nSuddenly, a cadre of Omura guards emerge from the shadows.\n\nWithout hesitation, they launch into battle. Algren and Katsumoto wield\ntheir swords. Yoritomo and Ujio fire arrows.\n\nNakao fights with his hands, dramatic martial arts from the huge man.\n\n                                                                                                                 94.\nBut this corridor is just too tight -- it is a sea of combat.. the guards and\nour warriors are slammed together --the swords and pikes sending up sparks\nin the darkness as they strike the stone walls.\n\nThe right corridor echoes with samurai war cries and clanging swords.\n\nThen...\n\nMore guards appear.\n\nThese guards have rifles.\n\nRifle blasts thunder --startling strobe-like bursts of light in the darkness --\n\nAlgren dives in front of Katsumoto to protect him-\n\nYoritomo is hit-\n\nHe jerks back -- blood--\n\nUjio fires arrows at the guards with rifles, hitting two -- but more guards with rifles are appearing, bullets\nsending showers of debris and ricochets--\n\nAlgren sees a stairway leading to a higher 1evel, barks out a command. As Nakao drags\nYoritomo toward the stairs-- the others bolt a heavy SIEGE DOOR ­\ndesigned to keep attackers at bay.\n\nINT.                        CASTLE SIEGE ROOM                           NIGHT\n\nUjio fires arrows through the siege ports -- momentarily delaying the guards\nas Algren leads them toward a rear stairs.\n\nINT.                       REAR STAIRS                      NIGHT\n\nAlgren starts down -- only to discover MORE GUARDS blocking this means\nof escape. He backs out of the wa y just in time as rifle blasts SPLINTER\nthe wooden stairwe11.\n\nMeanwhile, an EXPLOSION from behind them indicates that the guards\nhave blown the siege door.\n\nAlgren, Graham, and Ujio have no choice but to continue upwards into the\ncastle keep. Nakao helps the wounded Yoritomo as they climb.\n\nINT.                UPPER KEEP                    NIGHT\n\nA narrow ladder leads to the final redoubt. They start to climb but Yoritomo\nleans against the wall. He is gravely wounded.\n\n                                                ALGREN\n                            Come on.\n\n                                              YORITOMO\n                                    (subtitled)\n                            You go, Algren-san. I will stop them.\n\n                                                                                   95.\n\n                                             ALGREN\n                           No--\n\n                                             YORITOMO\n                           ...Please.\n\nYoritomo's determination is absolute. Finally, Algren nods.\n\nKatsumoto moves to Yoritomo, leans in for a few final words, taking his\nhead and pressing his forehead to Yoritomo's.\n\nBullets begin ricocheting around them -- Yoritomo looks to Algren:\n\n                                              YORITOMO\n                                    (subtitled)\n                           Tell my family.\n\nAlgren bows his bead in respect.\n\nThen Algren leads them up the stairs. Ujio fires a final volley, nods with\nrespect to Yoritomo, then follows the others.\n\n\nYoritomo pulls himself erect. Draws his two samurai swords.\n\nA beat. He closes his eyes. Smiles.\n\nThen he opens his eyes and hurls himself down the stairs--\n\nThe guards fire hitting Yoritomo - but still he comes -- wading into them\nswords flashing -- he is hit again and again -- but still he comes.\n\nIt is a glorious death.\n\nEXT.                      SIEGE ROOM                     NIGHT\n\nAlgren leads them into the highest room of the castle, the siege room. The\nechoes Yoritomo's death rings in their ears.                                   .\n\nKatsumoto glances at Ujio and Nakao. Without a word, they kneel on the\nfloor, open their kimonos and unsheathe their short-swords, preparing to\ncommit seppuku.\n\n                                             ALGREN\n                           No. Wait...!\n\nKatsumoto glares at him harshly, furious to have his concentration disturbed\nat such a moment.\n\n                                              ALGREN\n                           There's a wa y out. Look--!\n\nReluctantly, Katsumoto joins him at the window.\n\n                                                                                                        96.\n                                                ALGREN\n                             This place is designed to keep people from getting\n                             in, not from getting out. We can make it\n\n                                              KA TSUMOTO\n                             This was your plan?\n\n                                              ALGREN\n                             Do you have a better one?\n\nNakao and Ujio look at Katsumoto, awaiting his response. He turns to Algren.\n\n                                                 ALGREN\n                             I may die. But I'll die trying.\n\nAnd without another word he LAUNCHES himself out the window, onto the sloping roof.\n\nEXT.                   CASTLE ROOF TOPS                          NIGHT\n\nLike his cigar butt earlier in the sequence, he rolls, then falls, hits another\nroof, rolls, slides, falls, hits again.\n\nINT.                  UPPER KEEP                          CONTINUOUS\n\nKatsumoto and the others share a look. Has he survived?\n\nGUNFIRE begins to pepper the floorboards, bullets whistling past them.\n\n\nEXT.                 CASTLE ROQF TOPS                          CONTINUOUS\n\nAlgren slides, bumps, rolls, falls, hits, then slides again. Until he finally plummets into the moat.\n\nAs his head rises above water, he lets out a scream of absolute joy.\n\nINT.                  UPPER KEEP                    CONTINUOUS\n\nKatsumoto hears the scream. A look of disbelief spreads over his face.\nThen the beginnings of a smile. Without a second look, be leaps out the\nwindow. Ujio follows.\n\nGraham shrinks away in fear. Nakao lifts him bodily, throws him out, and then follows.\n\nINT.                      CASTLE -- RECEPTION CHAMBER                        LATER\n\nOmura stands, very calm, smoking a cigarette, listening to the report of his guards.\nColonel Bagley tries to apologize.\n\n                                               BAGLEY\n                             ... 1 don't know what to say, sir. I never would\n                             have thought him capable of treason.\n\n                                              OMURA\n                             I would say Captain Algren's acts tonight have\n                             assured our success.\n\n                                                                                 97.\n                                          AMBASSADOR SWANBECK\n                           What do you mean?\n\n                                             OMURA\n                           Katsumoto will rejoin his kinsmen. They will fight.\n                           We will destroy them with your new weapons.\n\n                                             BAGLEY\n                           What if he just goes off to the mountains and\n                           becomes a damn sheep-herder or some such?\n\n                                             OMURA\n                           You still do not understand us ... Katsumoto can\n                           do nothing but fight. It is his role in the drama.\n                           He must act out his destiny. He knows it.\n\n                                              AMBASSADOR SWANBECK\n                           You trust a lot in destiny.\n\n                                               OMURA\n                           This story was written years ago. From the first\n                           sight of your warships in our harbor...\n                                      (stares out the window)\n                           It is a1l inevitable.\n\nEXT.             HILLS                           SUNSET\n\nAlgren, Katsumoto, and the others ride over rocky ground.\n\n                                            ALGREN (V.O.)\n                           June 1, 1877. Yesterday, I passed the field where\n                           Zebulon Gant was killed by the man with whom\n                           I now ride.\nIn the distance a steam train chugs along. Inevitable. Progress.\n\n\nEXT.                 FOREST ­ MOUNTAINS                     DAY\n\nThey climb a steep trail. Beyond, the glaciers glow pink.\n\n\n                                             ALGREN (V.O.)\n                           I am beset by ironies -- trained to fight rebels\n                           now I am one. And yet 1 ask mysel f... can a man\n                           be reborn?:\n\nAlgren, Katsumoto, and the others ride through a dense forest Katsumoto\nreins his horse. The others follow suit. They wait\n\n                                            ALGREN (V.O.)\n                           And if so, what would he make of it?\n\nMounted samurai emerge from the thick forest As it they were invisible.\n\n                                                                                98.\nThe leader leaps from his horse and bows, touching his head to the dirt.\nAll the other samurai follow suit.\n\nEXT.    CHERRY TREE FOREST--NEAR THE VILLAGE                       EVENING\n\nKatsumoto rides at the head of his samurai as they pass through the cherry\norchard. Then he reins his horse and falls in beside Algren.\n\n                                              KATSUMOTO\n                                    (his voice troubled)\n                           I was prepared to die in Omura's castle. And\n                           yet here I am. I cannot help but ask why were\n                           you sent into my life. What is the lesson you\n                           were meant to give me?\n\n                                            ALGREN\n                           Maybe that neither of us is as smart as we\n                           thought...\n\nKatsumoto laugh. And then in a surprisingly deft imitation of Algren\n\n\n                                              KATSUMOTO\n                           You...ain't whistlin' Dixie...\n\n\nHe spurs his horse and heads off. Algren shakes his head and follows.\n\nEXT.               VILLAGE                     EVENING\n\nThe returning warriors are warmly welcomed by the villagers.\n\n\nAlgren rides directly to Yoritomo's house, dismounts.\n\nTaka and Toshiie are waiting.\n\nHe goes to them. His expression tells them all they need to know.\n\nINT.          YORITOMO'S HOUSE                           NIGHT\n\n\nAlgren sits with the family. The boys sit next to their mother.\n\n\n                                               ALGREN\n                                     (subtitles)\n                           ... he gave his life to save us. He died bravel y.\n\n                                             TAKA\n                                   (subtitles)\n                           Thank you, Algren-San.\n\n                                                                                    99.\n                                             HIGEN\n                                   (subtitles)\n                           Will you fight the white men?\n\n                                               ALGREN\n                                     (subtitles)\n                           If they come here, yes.\n\n                                               HIGEN\n                                     (subtitles)\n                           Why?\n\n\n                                             ALGREN\n                                   (subtitles)\n                           Because they come to destroy what I have come to love.\n\nTaka looks at him, moved and surprised. Suddenly, Higen jumps up and\nbolts... out of the room. Algren looks to Taka.\n\n                                              TAKA\n                                    (subtitles)\n                           The wa y of Samurai is difficult for children. He\n                           misses his father.\n\n                                            ALGREN\n                           And he is angry because I am the cause of that.\n\nShe smiles ever so slightly at his obliviousness.\n\n                                             TAKA\n                           No. He it angry because he fears you will die as well.\n\nEXT.             VILLAGE                    NIGHT\n\nHigen stands, looking up at the stars.\n\n                                              ALGREN\n                           Higen.\n\n                                             HIGEN\n                                   (subtitles)\n                           My father taught me it is glorious to die in battle.\n\n                                              ALGREN\n                                    (subtitles)\n                           That is what he believed.\n\n                                              HIGEN\n                                    (subtitles)\n                           I would be afraid to die in battle.\n\n                                             ALGREN\n                                   (subtitles)\n                           So would I.\n\n                                                                                  100.\n\n                                              HIGEN\n                                    (subtitles)\n                            But you have been in many battles.\n\n                                              ALGREN\n                                    (subtitles)\n                            And I was always afraid.\n\nHigen looks at him, tears welling in his eyes.\n\n                                               HIGEN\n                                     (subtitles)\n                            I don't want you to go.\n\nAlgren has no answer. He can only gather the boy up in his arms and hold\nhim.\n\nEXT VILLAGE DAY\n\nNakao is standing proudly, his massive arms folded across his chest. We\npull back: Graham is bunched behind his photographic equipment. A flash\nof phosphorous and the moment is immortalized.\n\nMeanwhile, Algren is working with Higen on the house.\n\nKatsumoto silently watches Algren working with the boy.\n\n                                                 KATSUMOTO\n                            Algren-san.\n\nAlgren turns.\n\n                                                 KATSUMOTO\n                            They are corning.\n\nEXT      MOUNTAINS          DAY\n\nAlgren and Katsumoto perch on a precipice, looking down into a valley.\n\nIt is a beautiful setting. Towering peaks and peaceful valleys. It is here that\nthe final act of the inevitable drama will play out.\n\nBel ow they see the Imperial Army, thousands strong, marching across the\nvalley toward them. Terrifying martial columns in strict formation.\n\n                                                ALGREN\n                            I call it five thousand troops. They'll come in\n                            waves of about a thousand, a few minutes between\n                            each wave.\n\nKatsumoto listens carefully to Algren's expertise.\n\n                                                                                101.\n                                              ALGREN\n                           German formations have the infantry staggered\n                           with on1y light flanking. They'll come straight on\n                           with rifles and fixed bayonets. Mausers are only\n                           accurate to about 150 yards. They'll look to\n                           overthrow us.\n\nKatsumoto takes this in.\n\nEXT.                  VALLEY                             DAY\n\nColonel Bagley, Omura, several German advisors and Japanese officers ride\nat the head of the Imperial Army.                                         .\n\nBagley sees something, raises a hand. The troops halt.\n\nAlgren and Katsumoto ride up to them. Stop.\n\n                                             ALGREN\n                           Colonel.\n\n                                              BAGLEY\n                           Captain... (to Katsumoto)... Sir, the Imperial\n                           Army of Japan demands your surrender. If you\n                           and your fellows lay down your arms you will\n                           not be harmed.\n\n                                             KATSUMOTO\n                           That is not possible. As Omura knows.\n\nOmura meets Katsumoto's look, nods. Bagley turns to Algren.\n\n                                             BAGLEY\n                           Captain Algren, we will show no quarter. You\n                           ride against us and you are the same as they are.\n\n                                               ALGREN\n                           I take that as a compliment, Colonel.\n                                      (a deadly calm)\n                           I'll look for you on the field.\n\nAlgren and Katsumoto wheel their horses and go.\n\nEXT.                 MOUNTAIN RIDGE                      DAY\n\n\nAlgren and Katsumoto ride.\n\n                                           ALGREN\n                           They have the howitzers.\n\n                                             KATSUMOTO\n                           How many?\n\n                                             ALGREN\n                           About a dozen.\n\n                                                                                              102.\n\nKatsumoto considers this. Algren looks up into the mountains.\n\n                                              ALGREN\n                            A man could get lost up there ... Build an army.\n                            Hold out a very long time.\n\n                                              KATSUMOTO\n                            Algren-san...Have you seen what happens to the\n                            villages that stand In the way of the railroad?\n\nAlgren nods. He remembers.\n\n                                               KATSUMOTO\n                            That is what will happen to my village if we do\n                            not stand and fight.\n                                     (looks at him)\n                            No. We serve the Emperor here.\n\n                                               ALGREN\n                            By dying?\n\n                                               KATSUMOTO\n                            Perhaps.\n\n                                              ALGREN\n                            At least make it battle, not a suicide.\n\n                                            KATSUMOTO\n                            And what would that accomplish?\n\nAlgren lifts his head, enjoying the feeling of the sun and wind on his face.\n\n                                                ALGREN\n                            It might give you one more day ... One more\n                            fine day like this.\n\nKatsumoto stares at him for a long moment, then smiles and spurs his horse. Algren follows.\n\nThey ride together, side by aide, the wind billowing their cloaks -- We enjoy the\nride as they do, the trees strobing by, the sun slanting through the leaves.\n\nEXT.                      VILLAGE                       NIGHT\nIt is the eve of battle. And the samurai rejoice.\n\nKatsumoto is on stage at the center of the village square, enthusiastically\nperforming a Noh drama. Algren sits with Toshiie and Taka in the audience,\nenjoying Katsumoto's theatrics.\n\nOther samurai can be seen around the village, eating, singing, and playing\ninstruments. Tonight is for celebrating life.\n\nElsewhere, a flash as Graham takes a photograph of some children.\n\n                                                                                            103.\nOn the stage, Katsumoto spots Algren in the audience, points to him and\nencourages him to join him. Algren resists. Toshiie prods him. Algren\nsurrenders and joins Katsumoto on the stage. The villagers are delighted.\n\nKatsumoto embroils Algren in the performance. Algren does his best,\nlaughing at Katsumoto's antics.\n\nIt is the freest and happiest we have ever seen Algren. Time\nSLOWS as we Savor his simple enjoyment\n\nToshiie is highly amused. Taka has a deeper response, she is moved as she\nwatches Algren give himself over to the part.\n\nEXT.            VILLAGE                      LATER THAT NIGHT\n\nA somber mood has descended. Algren sits and writes in his journal.\n\n                                              ALGREN (V.O.)\n                            July 14, 1877. For so long now, I have managed\n                            to convince myself that there was nothing worth\n                            believing in.\n\nA samurai plays a melancholy bamboo flute. The gentle sound floats through the village...\n\n                                              ALGREN (V.O.)\n                            Certainly nothing worth dying for.\n\nWe see samurai preparing for the final battle. Some check\ntheir armor... Others meditate...\n\n                                             ALGREN (V.O.)\n                            Now I am not so sure.\n\nSome make up their faces so they will look handsome when they greet death.\nSome methodically polish their swords. Some sit with their families.\n\n                                               ALGREN (V.O.)\n                            And so, for the first time in my life, I am truly\n                            afraid. Not of dying. But of losing something\n                            worth living for.\n\nUjio is performing a graceful, ritualistic sword-dance to the song of the flute.\nAlgren Joins Graham to watch him.\n\n                                                GRAHAM\n                            What is it:? .\n\n                                              ALGREN\n                            The kenbu,.. his dance of death.\n\nTaka comes to them.\n\n                                              TAKA\n                                    (subtitles)\n                            Algren-san, will you come with me?\n\n                                                                                   104.\n\nAlgren leaves Graham and accompanies Taka toward the house.\n\nThey pass Higen and Toshiie, who sit with other children at the feet of the\nmassive Nakao, listening to a quiet story he tells,\n\nINT.                   YORITOMO'S HOUSE                     FOLLOWING\n\nThe gentle flute music from outside drifts in.\n\nOne of Yoritomo's beautiful kimonos is elegantly spread on a mat.\n\n                                               TAKA\n                                     (subtitles)\n                            If you wear this, it will honor us.\n\nHe nods.\n\nShe steps to him.\n\nA moment. She gently reaches forward and unbuttons his collar.\n\nA tender, silent scene as she undresses him and carefully wraps him in the\n kimono. Her hands move gracefull y around his body, never quite touching\nhim. His movements are gentle in response.\n\nWhen he is fully dressed, then are tears in his eyes.\n\nSuddenly, fiercely, they are holding each other.\n\nEXT.             KATSUMOTO'S HOUSE -- PORCH                  LATER THAT NIGHT\nThe quiet evening continues.\n\nAlgren, now dressed in the kimono, finds Katsumoto carefully dropping little\nleaves of incense into a small flame that simmers inside his battle helmet.\n\n                                               KATSUMOTO\n                            So m y hair will have a pleasing scent when I\n                            meet my ancestors ... (dry) ... You do not do this ?\n\nAlgren smiles, sits.\n                                                 ALGREN\n                            I studied war at a place called West Point. They\n                            taught us about a battle called Thermopylae.\n                            Three hundred brave warriors held off the king\n                            of Persia's army of a million men. For two da ys\n                            they made them pay so dearly that the king lost\n                            all appetite for further invasion\n                                       (looks at him)\n                            ... I have some thoughts about the battle tomorrow.\n\n                                              KATSUMOTO\n                                    (bemused)\n                            Do you really think we can defeat them?\n\n                                                                                         105.\n\n                                               ALGREN\n                            I sure as hell want to find out.\n\n                                            KATSUMOTO\n                            You believe a man can change his destiny?\n\n                                              ALGREN\n                            No ... But I think a man cannot know his destiny.\n                            He can only do what he can, until his destiny is\n                            revealed.\n\nA si1ent beat.\n\nThen Katsumoto picks up a long bundle wrapped in cloth. He unwraps it.\nA beautilu1 long samurai sword.\n\nHe bows his head and offers it to Algren.\n\nThere are Japanese characters etched on the blade.\n\n                                                ALGREN\n                            What does it say?\n\n                                              KATSUMOTO\n                            \"I belong to the warrior in whom the old ways\n                            have joined the new.\"\n\nAlgren is moved beyond words. He bows.\n\nAs the CAMERA pulls away, Algren and Katsumoto squat side by side,\ndrawing in the dirt with a stick, planning the next day's battle strategy.\n\nAcross the square, Ujio continues his elegant dance of death, his graceful\nform illuminated in silhouette by a fire.\n\nINT.          YORITOMO'S HOUSE                   MORNING\n\nIt is the day of the battle. Algren is buttoning the long coat of his cavalry uniform.\n\nHe looks up to see Higen standing in the doorwa y, holding the breast-plate\nof his father's armor.\n\nEXT.             YORITOMO'S HOUSE                 DAY\n\nAlgren emerges from the house, wearing the breast-plate over his coat.\nTaka is at his horse, tying a bag of food to the saddle. She turns and sees her\nhusband's armor on this man. And her breath stops.\n\nAlgren approaches her. They stand very cl ose.\n\n\n\n                                                TAKA\n                                      (subtitles)\n                            Return.\n\n                                                                                         106.\n\n                                                 ALGREN\n                                       (subtitles)\n                            If that is my destiny ... Anshinritsumai. [I\n                            wish you peace.]\n\n                                               TAKA\n                            Anshinritsumai.\n\nHe bows his head to her, she responds. The boys stand on the porch,\nwatching. He mounts his horse and trots off. They watch him go.                      .\n\nAlgren joins the line of samurai leaving the village. It is the first time we have\nseen them in their full battle armor since the battle in the fog.\n\nKatsumoto in his black armor, Ujio in his jet black. And Algren in the blood-red\nbreast-plate. It is dazzling.\n\nEXT.      BATTLEFIELD           DAWN\n\nWe move along the line of waiting samurai. The faces are stoic. Prepared.\nTheir horses are corralled well behind them.\n\nAlgren stands with Katsumoto and Ujio. Graham is nearby. They peer into the\nplain beyond.\n\nThey have chosen a strong defensive position. A steep mountain pass. Slopes on either\nside create a funnel ahead of them. The Imperial Army will have to pass through the\nfunnel to reach them.\n\nOn a hill above them\n\nHigen is revealed. He looks down first at the five hundred Samurai, then\nsees, beyond, the overwhelming mass of the IMPERIAL ARMY.\n\nBack on the battlefield\n\nA distant thud followed by a high-pitched whine. A MASSIVE EXPLOSION\nahead of the Samurai. Artillery.\n\nAlgren finds Graham cowering at the base of a straw barricade.\n\n                                               ALGREN\n                            Mr. Graham....\n\n                                               GRAHAM\n                            Captain?\n\n                                            ALGREN\n                            Would you please stay with the horses?\n\nGraham would like to be brave enough to remain, but he is not a soldier.\n\n                                               GRAHAM\n                            As you suggest.\n\n                                                                                    107.\n\nGraham starts to go --\n\n                                             ALGREN\n                            Mr. Graham ... Take this.\n\nFrom his coat, Algren takes his journal, hands it to Graham.\n\n                                            ALGREN\n                            Maybe you can use it for your book.\n\n                                               GRAHAM\n                            I will.\n\nHe heads back to the relative safet y of the horse corral.\n\nMeanwhile, the samurai remain impassive as artillery is stepped in closer, the\nrange bracketed. Then artillery rounds begin to fall among them.\n\nSamurai are blown to pieces as they bravel y stand and await\ndeath. Katsumoto BARKS a command to Ujio.\n\nSuddenly, the Samurai break ranks and trot into a new defense\nalignment. The artillery rounds now fall ineffectually where once\nthey stood.\n\nBagley directs the artillery to be re-targeted, It is a laborious, clumsy\nprocess. They fire again. Another command. The Samurai change\nposition again.\n\nBagley is furious. Their fluid tactics have rendered his field artillery useless.\n\nKatsumoto and Algren share a look of grim satisfaction. They are leveling\nthe playing field.\n\nBugle calls are heard from the Imperial Army.\n\n                                              ALGREN\n                            The call to advance.\n\nThe rattle of the snare drums. The sound of marching boots.\n\nAnd then they appear. Thousands upon thousands of them. The Imperial\nArmy marching relentlessly forward in strict formation. The Rising Sun displayed.\n\nKatsumoto gazes at the awe-inspiring sight. His 500 samurai face a staggering\n5,000 soldiers.\n\n                                              KATSUMOTO\n                            Tell me ... what happened to those three hundred\n                            warriors at Thermopylae?\n\n                                                                                 108.\n                                               ALGREN\n                                      (a grim smile)\n                             Dead to the last man.\n\nKatsumoto glances to him, smiles.\n\n\nEXT.                THE SAMURAI POSITION                     CONTINUOUS\n\nThe First Division of the Imperial Army moves into the funnel, their numbers\nreduced by the size of the access, and head toward the barricade.\n\nKatsumoto and Algren watch as they move closer and closer. We\nare expecting the samurai to open fire, but they do not. They just\nwait.\n\nFinally the Imperial soldiers are in rifle range. They stop to fi re a volley.\n\nBullets begin hitting among the samurai. Many fall.\n\nAlgren nods to Katsumoto, Katsumoto then calls out a command and the\nsamurai retreat.\n\nThey race back toward the rear of the funnel.\n\nThe Imperial Army soldiers climb awkwardly over the first barricade and\npursue--\n\nThe samurai, meanwhile, have taken cover behind a second barricade that\nhad been hidden from the Imperial soldiers' view. Now safel y behind\nthe second barricade, Katsumoto calls out a command and--\n\nThe samurai fire!\n\n500 arrows explode -- almost instantly followed by 500 more --\n\nLike an image from Agincourt, the clouds of arrows sweep across the sky --\n\nImperial Soldiers fall, the attack falters--\n\nFrom behind the new barricades, archers fire FLAMING ARROWS, that\nHit the old barricade. It EXPLODES INTO FLAMES, trapping the Imperia1\nArmy bet ween the two barricades.\n\nAnd from the second barricade, two large CA TAPULTS send balls of flaming\npitch into the already panicking soldiers.\n\nEXT.                        OPPOSING HILL TOP                    DAY\n\nColonel Bagley, Omura, several German advisers and Japanese Officers\nwatch through binoculars. Stunned. As the First Wave is routed.\n\n                                                HAGLEY\n                             What the hell?\n\n                                                                                          109.\n                                               OMURA\n                             It seems Katsumoto will resist his destiny.\n                                      (snaps an order)\n                             Send in the second wave. Two divisions.\n\nEXT.                  BARRICADES                          DAY\n\nAlgren and Katsumoto wait behind the second barricade. We note that this\nbarricade is the real thing.\n\nKatsumoto removes a piece of shattered armor from his left forearm, a\nbullet wound beneath. Algren looks over the barricade.\n\nThey see Imperial soldiers using semaphore flags to communicate with their commanders\non the opposing hilltop.\n\n                                                KATSUMOTO\n                             How long?\n\n                                                ALGREN\n                             They need to regroup and report our position. Then\n                             they'll come hard.\n\nKatsumoto considers the bodies of the dead Imperia1soldiers.\n\n                                                 KA TSUMOTO\n                             It is sad to see brave men die without faces... You cannot\n                             tell one warrior from another.\n\n                                               ALGREN\n                             They're not warriors. They're soldiers. It's a\n                             modern army.\n\n                                             KATSUMOTO\n                             Not my world anymore.\n\nEXT.            BATTLE FIELD                   DAY\n\nBugles. The attack is reforming. Ranks now bolstered by reinforcements.\n\nThey come at a trot, through the narrow defile, skirting the first barricade,\ncontinuing at a trot toward the second barricade.\n\nEXT.              2ND BARRICADE                      DAY\n\nKatsumoto pulls his long sword. Algren does the same.\n\nKatsumoto calls out an order -- the archers fire another round.\n\nThe Imperial soldiers are being annihilated but still they come in great waves --\nfor ever y one who falls it seems there are ten to take his place.\n\nThey race forward, stepping over their fallen comrades, bayonets poised --\n\nThe Mauser rifles flash --\n\n                                                                                           110.\n\nBullets explode around the samurai, many are hit.\n\nThe Imperial Army has been trained to keep firing on the run. The waiting\nSamurai will be decimated, except --\n\nFrom the hills on either side\n\nFully half of the Samurai force -- who have been kept hidden until this moment...\ncharge, screaming into the flank of the attacking Army. Even rifles cannot fire in\nthree directions at once.\n\nAlgren and Katsumoto lead the charge over the second barricade. Some are cut down,\nbut in moments swords engage ba yonets in brutal hand-to-band combat.\n\nAlgren And Katsumoto fight back to back, as if one person, slashing with their\nswords, shattering bayonet, dealing death on all sides.\n\nUjio crouches, his back leg straight and planted, his front leg bent. Still using\nhis bow, firing off arrows with Stunning speed, refusing to budge--\n\nOn the opposing hillside\n\nBagley and Omura watch the battle through binoculars.\n\n                                                  BAGLEY\n                                A classic \"V\" ambush. Sonofabitcb is using\n                                Welt Point tactics.\n\nIn the midst of the battle\n\nA charging soldier thrust     s his bayonet into Katsumoto's arm - Katsumoto kills,\nthe soldier with his short    sword but is awkwardly tangled with his body, a second\nsoldier races toward him      for the kill - Algren spins and attacks killing the second\nsoldier - but a third races    toward Algren, bayonet f1ashing\n\nHe dodges -- but the bayonet slices into his side --\n\nAlgren kicks the soldier away -- tries to use his sword but the soldier springs\nback ath1etically .. Ujio appears like a black spectral figure to deliver the\ncoup de grace.\n\nAll SOUND gradually fades and is replaced by the elegaic sound of a bamboo\nflute... the images of combat become fragmented and impressionistic.\n\nBur no matter how bravel y the samurai fight, they are simply outnumbered...\n\nNakao is like a cornered bear, arcing his two swords wildly around him. He\nis shot in the chest, and staggers a moment before continuing. Another\nsoldier shoots him in the arm at point blank range. Nakao', sword goes fl ying,\nso the giant Samurai leaps forward and picks up the shooter bodily, twirling\nhim around like a wrestler, throwing him finally onto the upraised pike of a\nfellow Imperial soldier. But now three more soldiers have levelled their\nweapons, and a ruthless volley staggers him again. Shots rain on him as he\ntries to continue fighting, but his strength leaves him. Finally, with one last\nlunge, he manages to pull an Imperial soldier with him, crushing him as he falls.\n\n                                                                                   111.\nMore and more fall as Algren, Katsumoto, and their comrades fight desperately...\n\nThe mournful flute is the appropriate accompaniment as Ujio is mortally\nwounded. The grim award master is cut through with bullets. Still he fights.\nAn Imperial soldier holds up a rifle to protect himself, and Ujio's blade cuts\nthrough the barrel. The soldier just has time to look at the gun in amazement\nbefore a second sweep of Uji o's sword beheads him. But there are too many\nto take the man's place, and finally fi ve men run Uji o through with bayonets,\nand he is pinned against the barricade, still upright in death.\n\nAt last, what is left of this second wave of the Imperial Army, retreats.\n\nEXT.             PLAIN                            ALMOST SUNSET\n\nThe plain before the barricade is littered with Imperial Army dead.\n\nAlgren and Katsumoto sit exhausted, leaning against the barricade. They are\nboth wounded.\n\nOnly about. hundred samurai are still alive.\n\nAlgren looks over the decimated warriors for a moment. Even those still\nalive are in bad shape as they wait for the next wave of Imperial soldiers.\n\nKatsumoto is looking at Ujio's body nearby.\n\n                                           KATSUMOTO\n                           He was Kaishaku ... my trusted friend.\n\n                                            ALGREN\n                           We won't be able to hold them back this time.\n\n                                             KATSUMOTO\n                           This is not your battle. You do not have to die\n                           here.\n\n A long beat.\n\n                                              ALGREN\n                           I died a long time ago.\n\n                                            KATSUMOTO\n                           But now you live again.\n\n                                               ALGREN\n                           Yes.\n\n                                             KATSUMOTO\n                           It was not your time.\n\n                                            ALGREN\n                           No. Maybe I survived just to live this one last day.\n\nAlgren looks at him.\n\n                                                                                      112.\n                                               ALGREN\n                            I'll stay.\n\nHe slowl y pulls himself up. He and Katsumoto gaze at the plain before them.\n\nAt the infantry troops massing on the opposing hilltop.\n\nAlgren looks at Katsumoto. He reaches into the pocket of his old uniform\nand takes out the Medal of Honor he received, long ago, at Sutter's Hill.\n\nHe affixes it to his old cavalry tunic.\n\nKatsumoto looks at Algren. They are both thinking the same thing.\n\nSilent agreement.\n\n\nEXT.                    PLAIN                                  SUNSET\n\nThe hundred mounted samurai are a beautiful sight.\n\nThey wait in formation in front of the barricade, the long plain through the\nfunnel to the opposing hilltop before them.\n\nKatsumoto draws his long samurai sword.\n\nAlgren draws his.\n\nAnd they slowl y begin to trot forward...\n\nAnd then to canter...\n\nBEHIND THE IMPERIAL ARMY\n\nColonel Bagley and Omura watch, transfixed. There is something\napproaching admiration on Omura's face. On Bagley's, there is only malice.\n\n                                              BAGLEY\n                            The gatling guns. Quickly.\n\nEXT.                     PLAIN                             SUNSET\n\n\nKatsumoto points his sword and screams out his war cry. .\n\nAnd they charge. It is suicidal\n\nIt is glorious.\n\nIt is the end of the samurai.\n\nThey charge forward, their war cries echoing in the canyon.\n\nThe Imperial troops fire rifles -- samurai fall .. but still they come: -- pounding\nover the earth like something from an ancient dream\n\n                                                                                        113.\nAlgren and Katsumoto charge side by side. Alive. Warriors.\n\nBEHIND THE IMPERIAL ARMY\n\nBagley and Omura watch as the samurai fall, one by one.\n\nWITH THE CHARGE\n\nFifteen or twenty of the samurai -- including Algren and Katsumoto--\nsomehow manage to fight their way through the lines.\n\nThey break into the open.\n\nAnd continue riding straight toward the rear.\n\nALGREN AND KATSUMOTO\n\nAre both wounded, yet still they charge. They have only one thought in\nmind -- death to their enemies. They gallop forward toward Bagley and Omura.\n\nBAGLEY\n\nLooks around in abject terror. He screams out an order.\n\nTWO WAGONS\n\nAre moving into position. Their rear gates fall open ... revealing the GATILING GUNS.\n\nALGREN AND KATSUMOTO\n\nAre near enough to see them. Yet they will not be deterred.\n\nThey charge on.\n\n\nUp ahead.\n\nTHE GATLING GUNS\n\nAre not yet ready to fire. Japanese soldiers slam ammo belts into the chambers.\n\nALGREN, KATSUMOTO AND THE REMAINING SAMURAI\n\n\nHave almost reached their goal.\n\nBAGLEY\n\nCowers in fear, looks around, but there is nowhere to hide.\n\nTHE SAMURAI CHARGE\n\nEven while riding at I full gallop, they have fixed arrows into their long\n\n                                                                                                       114.\nbows. They let loose a lethal volley.\n\nBAGLEY\n\n                                             BAGLEY\n                            Fire! Fire, dammit!!!!!\n\nBut before the guns can open up, he is IMPALED BY ARROW AFTER\nARROW, a human pincushion. The final arrow pierces his forehead.\n\nThen...\n\nThe Gatling Guns finally fire. Ripping into the samurai-\n\n\nDestroying them-\n\nOne after another is hit -- and still they come -- their voices raised in glorious cries of triumph-\n\nGraham watches from a hilltop, tears in his eyes.\n\nKatsumoto is hit, blood explodes .- his horse falls -- he spi1ls off--\n\nThen Algren is hit -- he falls--\n\nAlgren drags himself to Katsumoto, bullets exploding ever ywhere ­\n\nAlgren looks up to see...\n\nThe remaining samurai still charging-\n\nAnd still the Gatling Guns tear through them--\n\nAnd still they charge ­\n\nUntil they are all down.\n\nEXT.             OPPOSING HILLTOP                           SUNSET\n\nA Japanese Officer shouts out an order -- the Gatling Guns stop.\n\nOmura screams at him to continue firing!\n\nThe Japanese officer barks out response. Refusing.\n\nOmura sees all the samurai are dead or dying.\n\nBut he also sees Algren kneeling by Katsumoto, dragging him awa y. He\nscreams at the Japanese officer to resume fire!\n\nThe Japanese officer refuses.\n\nHe just looks over the plain of dying samurai for a moment. Then he does\nthe most remarkable thing.\n\nHe slowl y kneels and touches his head to the dirt.\n\n                                                                                    115.\nThen a soldier near him does the same thing. Then another and another.\nAnd then by the thousands.\n\nThey kneel and touch their heads to the dirt.\n\nHonoring the last samurai.\n\n\nEXT.                PLAIN                    SUNSET\n\nA1gren drags the dying Katsumoto to a8 copse of cherry trees nearby...\n\n\nEXT.                           CHERRY TREES                                SUNSET\n\nBoth men are bleeding profusel y.\n\n                                                   KATSUMOTO\n                             Help me up...\n\n                                                   ALGREN\n                             Just -- stay there.\n\n                                                   KATSUMOTO\n                             Help me up.\n\nAlgren helps him to stand. Without Algren's support, he would fall.\n\n                                                   KATSUMOTO\n                             My sword...\n\n                                                   ALGREN\n                             No.\n\n                                              KA TSUMOTO\n                             You have your honor again. Let me die with\n                             mine ... Kaishaku.\n\nAlgren looks at him, deeply moved. Katsumoto manages to pull out his short sword.\n\n                                             KATSUMOTO\n                             You must help me. Hold it firmly...\n\nAlgren supports Katsumoto as he holds the sword's point firmly to his stomach.\n\n                                                   KA TSUMOTO\n                             Are you ready?\n\n                                                   ALGREN\n                             No, Kaishaku.\n\n                                                                                     116.\n Katsumoto looks at him deepl y, warmly.\n\n                                                 KATSUMOTO\n                               We will ride together again.\n\nKatsumoto embraces Algren firmly -- the sma1l sword impales him\n\nAlgren holds him tightly. Katsumoto is looking over Algren's shoulder as he dies.\n\nKatsumoto sees something. A look of joy and absolute peace comes to his features.\n\n                                                   KATSUMOTO\n                                         (whispers)\n                               It is perfect... They are all perfect.\n\nHis eyes cl ose. He is dead.\n\nAlgren gently kneels with Katsumoto's body\n\nHe holds him for a moment and then turns to see what Katsumoto was looking at.\n\nCherry blossoms.\n\n\nA display of perfect beauty.\n\n\nWe slowl y fade to...\n\n\nINT.               IMPERIAL PALACE -- THRONE                            ROOM DAY\n\n\nAmbassador Swanbeck, Omura, and a retinue of advisors are presenting the\ntreaty documents for the Emperor's signature. The Emperor sits restively\non his throne.\n\n\n                                                  AMBASSADOR SWANBECK\n                               ...will usher in an era of unprecedented prosperity\n                               and cooperation between our two great nations.\nA servant comes and whispers into the Emperor's ear.\n\n                                                   OMURA\n                                         (subtitles)\n                               Highness, if we could just conclude the matter\n                               at hand...\n\nThe Emperor ignores Omura, and gestures that the doors to the chamber be opened.\n\nAlgren enters with Graham. Algren carries something wrapped in a blanket.\nHe approaches the Emperor. Kneels and sets the bundle at the Emperor's feet.\nAlgren remains kneeling with his head bowed. He unwraps the bundle.\n\n                                                                                    117.\nIt is Katsumoto's long samurai sword.\n\n\n'The Emperor looks at it.\n\n                                               OMURA\n                                     (subtitled)\n                            All your enemies are dead, Enlightened One.\n\nThe Emperor continues to look at the sword. He does not look up.\n\n                                            EMPEROR/TRANSLATOR\n                                   (to Algren)\n                            You were with him at the end.\n\n                                              ALGREN/TRANSLA TOR\n                            Yes. He asked that I bring you this -- that the\n                            strength of the samurai will be with you alwa ys.\n\nThe Emperor rises from his chair and sits on the floor, in the traditional\nJapanese fashion, before the sword.\n\n                                               OMURA\n                                     (after a moment)\n                            En1ightcned One, we all weep for his loss, but\n                            the future of our country lies in-\n\n\nThe Emperor interrupts him, speaking in English -- to ever yone's surprise.\n\n                                               EMPEROR\n                            My ancestors have ruled Japan for 2,000 years.\n                            And for all that time we have slept. During my\n                            sleep I have dreamed. I dreamed of a unified\n                            Japan. Of a country strong and independent and\n                            modern...\n                                     (touches the sword lovingly)\n                            And now we are awake. We have railroads and\n                            cannon and Western clothing. But we cannot\n                            forget who we are. Or where we come from.\n\nThe Emperor looks up at the gathered dignitaries.\n               .\n                                              EMPEROR\n                          Ambassador Swanbeck I have concluded that your treaty\n                          is not in the best interests of my people.\n\n                                              AMBASSADOR SWANDECK\n                            Sir, if I may--\n\n                                              EMPEROR\n                            You may not. From this moment on, economic investment\n                            from ever y nation will be considered equally.\n\n                                                                                      118.\n\nAmbassador Swanbeck is stunned.\n\n                                            AMBASSADOR SWANBECK\n                          This is an outrage--\n\nThe Emperor gestures. A servant escorts Swanbeck to the exit. Omura takes a step\ncloser to the Emperor.\n\n                                            OMURA\n                                  (subtitled)\n                          Enlightened One, we should discuss this\n\n                                            EMPEROR\n                                  (subtitled)\n                          Omura, do you know our northern island?\n\nOmura is confused.\n\n                                              EMPEROR\n                                    (subtitled)\n                          There is a small one called Taraku. A rock in the sea.\n                          There is nothing there but crabs who have been known\n                          to tear a sleeping man apart ... I have had a small house\n                          constructed on the island. You will go there now and\n                          await our summons.\n\n                                             OMURA\n                                    (subtitled)\n                          Sir...?\n\n\n                                             EMPEROR\n                                   (subtitled)\n                          I hereby seize your family's assets and present them\n                          as my gift to the people.\n\nOmura looks at him, stunned.\n\n                                             EMPEROR\n                                   (subtitled)\n                          Further, I have decided to stop the railroad cxpansion\n                          into Yoshino.\n\n                                            OMURA\n                                  (subtitled)\n                          Enlightened One\n\n                                             EMPEROR\n                                   (subtitled)\n                          You have served your function. I have no more\n                          need of you ... You can conspire with the crabs\n                          now. Remove yourself.\n\n                                                                                         119.\n                                                OMURA\n                                      (protests, subtitled)\n                             Honored Emperor, I do not know wh y you\n                             disgrace me.\n\nThe Emperor finally looks up from the sword.\n\n                                                EMPEROR\n                                      (subtitled)\n                             If your shame is too unbearable ... I offer you\n                             this sword.\n\nOmura looks at him for a moment. Then bows tersely and goes.\n\nThe Emperor looks at Algren, still kneeling before him.\n\n                                              EMPEROR\n                                     (in English again)\n                             The samurai is not a man now. He is an idea.\n                                     (a beat)\n                             Tell me how he died.\n\nAlgren looks At the Emperor.\n\n                                                ALGREN\n                             I will tell you how he lived.\n\nWe slowl y fade as Algren begins to speak...\n\nEXT.                     VILLAGE                   DAY\n\nSpring. A few years later.\n\nThere are no samurai training in the square, but otherwise the village is\nbustling with life. We HEAR Graham's voice:\n\n                                               GRAHAM (V.O.)\n                             ...And so the days of the samurai had ended.\n\nINT.                  LECTURE HALL (ENGLAND)                           DAY\n\nGraham stands at a lectern on a book tour. A well-dressed audience listens\nattentivel y. A banner proclaims, \"The Last Samurai,\" by Simon Graham.\n\n                                                GRAHAM (V.O.)\n                             And in the years to come the Rising Sun of Imperial Japan\n                             would fl y in triumph over Korea, over Russia, even over\n                             China. Nations, like men, it is sometimes said, have\n                             their own destiny\n\nEXT.                               VILLAGE                             DAY\n\nWe see that Yoritomo's house has finally been completed.. Toshiie sits on the porch,\nInstructing a group of younger children in calligraphy.\n\n                                                                                    120.\n                                            GRAHAM (V.O.)\n                           As for the American Captain, no one knows\n                           what became of him. All that is left is his journal\n                           which I have published, according to his last request.\n\nTaka steps from the house and passes Toshiie, she carries a basket. We\nmove through the village with her...\n\n                                             GRAHAM (V.O.)\n                           Some lay he died of his wounds, others that he\n                           returned to his own country...\n\nShe passes an old man teaching the Noh drama to a group of teenagers.\n\nShe passes Higen, working on a new building. Apparently he has found a\ngood life as a carpenter. He seems content.\n\nWe go with Taka as she leaves the village...\n\nEXT.                     CHERRY TREES                                DAY\n\n\nTaka moves through the cherry orchard.\n\n                                              GRAHAM (V.O.)\n                           But I like to think he may have found at last\n                           some small measure of the peace we all seek,\n                           but few of us ever find.\n\nTaka stops. Watching. We follow her gaze to discover:\n\nAlgren, sitting alone. Gazing peacefully sat the cherry bl ossoms.\n\n\nWaiting for the perfect one. He turns to her, a smile of quiet joy spreads\nacross his face.\n\n                                             GRAHAM (V.O.)\n                           Anshinritsumai. [I wish you peace.]\n\nFade out.\n\n\n\n\n\nLast Samurai, The\nWriters :   John Logan  Edward Zwick  Marshall Herskovitz\nGenres :   Action  Adventure  Drama  War\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:29:04.264121"}