{"title": "Leviathan", "film_link": "/Movie Scripts/Leviathan Script.html", "script_link": "/scripts/Leviathan.html", "info_raw": "\n\nLeviathan Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Peoples  Jeb Stuart\nGenres  Horror  Sci-Fi  Thriller\nScript Date : September 1987\n\nRead \"Leviathan\" Script\n\n\n", "script": "\n\n\n\n   \"Leviathan\", shooting draft, revised by Jeb Stuart\n\n\n\n   \n\n\n\n\n\n\n\n\n\n\n                              LEVIATHAN\n\n\n\n                            Screenplay by\n\n\n                          David Webb Peoples\n\n                                 and\n\n                              Jeb Stuart\n\n\n\n\n\n\n\n\n\n\n                                           Revised Draft\n\n                                           September 8, 1987\n\n\n\n\n\n\n\n\n\n\n     FACE IN ON\n\n     THE SURFACE OF THE OCEAN\n\n     sunny and placid then slowly WE BEGIN DESCENDING UNDERWATER\n\n     Moving down from the bright surface waters, through layers\n     of fish and marine life...\n\n     A school of vibrantly colored fish move with the current,\n     their numbers are enormous, their movements in unison.\n     Suddenly out of the darkness a barracuda cuts through the\n     school, taking out four or five before disappearing into the\n     shadows.  The school moves on as if nothing happened,\n     quickly closing ranks where the missing ones swam only\n     seconds before.\n\n     WE MOVE DEEPER AND DEEPER\n\n     Fish disappear, darkness envelopes us.  Cold and lifeless\n     where light has never penetrated...Five thousand feet, ten\n     thousand.  Deeper, where only strange, self-illuminating\n     echoniderms move eerily through the currents.  Then suddenly\n     WE HEAR STATIC from RADIO TRANSMISSION.  THEN VOICES...\n\n                                JONES\n                   Burritos...Enchiladas...\n\n                                DEJESUS\n                                (hispanic voice)\n                   Oh, gag, man, how can you eat that\n                   stuff?...\n\n                                BOWMAN\n                                (female)\n                   I can't wait for fresh vegetables...\n\n     Several voices suddenly break into argument...\"vegetables?\"\n     \"shit,\" \"burgers\"...Suddenly another voice rises above the\n     others.\n\n                                BECK'S VOICE/ RADIO\n                   Okay, cut the chatter.  You're\n                   not out of here, yet.  Who's the\n                   hook?  Seven?...You got a hook on\n                   container 22?\n\n     A pause, then more voices.\n\n                                SIXPACK'S VOICE/ RADIO\n                                (redneck drawl)\n                   The man's asking if you're hooked\n                   on 22, you dumb shit.\n\n                                JONES' VOICE/ RADIO\n                   Watch your mouth, Sixpack.  Hello,\n                   Shack, Seven, here.  I ain't the hook,\n                   over.\n\n     A light flares out of the darkness, suddenly illuminating an\n     IMMENSE SHAPE--fifteen hundred pounds of hardened metal\n     nearly seven feet tall.  It is a motorized diving suit and\n     we see the stenciled name, WILLIE across the front\n     breastplate.  As it pivots we see the stationary worklights\n     around the base of a large underwater mining operation, THE\n     SHACK.  Then a woman's voice.\n\n                                WILLIE'S VOICE\n                                (woman's voice)\n                   Six to Shack.  I'm the hook.\n\n     INSIDE THE SHACK/ CONTROL ROOM\n\n     littered with papers, half-full coffee cups, and a confusion\n     of wires and very low-tech, high-tech equipment BECK sits at\n     the monitor controls.  He is younger than we expected,\n     twenties, clean cut good looks.  He'll be a hell of a good-\n     looking man at thirty-five, he just needs to be hardened.\n     From the looks of the coffee cups around him he's on his\n     way.\n\n                                BECK'S VOICE/ RADIO\n                   Okay, Six, let's wrap this container\n                   and call it a day.\n\n     Above him a bank of monitor screens.  Each one labeled with\n     a crew member's name and providing a video picture from a\n     camera mounted on their helmet.  Beck reaches above him and\n     throws a console switch which activates another monitor\n     labeled ROV.  With a joystick he manipulates an outside\n     camera(the ROV), its picture we see on the monitor.  It is\n     moving.\n\n     UNDERWATER\n\n     WILLIE'S POV  The inside of her helmet is a grid of LED\n     gauges monitoring air reserve, body temperature,\n     atmospheres, heart rate, blood pressure.\n\n     She stops next to a pair of railroad-like tracks and removes\n     the tool attached to the end of her arm.  The move is\n     practiced and professional, like a cook changing the tool on\n     a set of egg beaters.  First, she inserts the existing tool\n     into a lock on her opposite arm which holds it while she\n     disengages the tool.  Next, she selects the next tool from\n     the storage compartment at her waist and punches it into\n     position.  Sixpack's voice comes over the radio.\n\n                                SIXPACK'S VOICE\n                   Hey, Willie, you trip on a\n                   tit or something?  We're all\n                   waiting on you, honey.\n\n                                WILLIE\n                                (under control)\n                   Keep your pants on Sixpack.\n                   I promise you'll be inside before\n                   \"Mr. Rogers' Neighborhood\" comes on.\n\n     OVER THE RADIO WE HEAR other men's voices laughing.  They\n     like Willie and cheer her on.  \"Tell him, Willie,\" \"Atta\n     girl,\" etc...\n\n     Willie CLICKS in her last tool and turns.  Expertly she\n     hooks a large dumpster-like container, the container to what\n     looks like an underwater parachute--A CONTAINER\n     TRANSPORTER--which when filled with oxygen it lifts the\n     massive container onto the tracks where it can be hauled-in\n     by a winch.\n\n                                WILLIE'S VOICE\n                   Six to Shack...Hook's on.  Ready\n                   to winch.\n\n     UNDERWATER MACHINERY\n\n     Halogen lights illuminate bits and pieces of dredges and\n     dumpsters squatting in the gloom.  A winch begins grinding\n     and the big, newly hooked container lurches down the tracks.\n     It comes to the end where a winch fits it into place with\n     several others to complete a set.  We hear BECK'S VOICE.\n\n                                BECK/ RADIO\n                   Ok, that's it.  Come on in.\n\n     More motor suited DIVERS appear, their helmet lights\n     glaring.  Their breastplate names catch in the dim lights:\n     COBS, BOWMAN, WILLIE.\n\n     As they approach the UNDERWATER LOCK, where an elevator will\n     transport them up into the Shack, we see signs of human\n     life:  a basketball goal attached to the side of the\n     building; stickers and signs:  \"No Bozos,\" etc.  A formal sign\n     towers over the entrance.  It says: TRANSOCEAN CORP. SHACK 6.\n\n     ON ONE OF THE CREW\n\n     He moves behind the others.  Suddenly he freezes in his\n     tracks and slowly rotates his helmet--on his shoulder in the\n     glare of his helmet beam WE SEE the a hideous looking SEA\n     SPIDER.  It's thick legs moving eerily down his arm.\n\n     Carefully, so as not to disturb the creature, a mechanical\n     motor hand moves into position below it, and in one quick\n     movement, snares it.\n\n     CLOSE ON METAL WAIST POCKET.  The latch opens and the\n     writhing sea spider is shoved inside.  From the pocket WE\n     MOVE UP the diver's suit until we see the name SIXPACK on\n     the breastplate.  He looks around to see if anyone has\n     noticed then continues on toward the shack.\n\n     ON TWO DIVERS(JONES AND DEJESUS)\n\n     They walk together to the Shack.  A Latino VOICE, DEJESUS,\n     comes over the radio singing an old Miller Beer jingle in an\n     exaggerated accent.\n\n                                DEJESUS\n                   When it's time to relax....\n                   One thing stands clear...\n\n     INSIDE ON BECK\n\n     As he listens to the singing over the tinny speaker, we see\n     he aches to be a part of their comaraderie, but is alienated\n     by age and rank.  He is the shack boss, management.  He\n     listens as a BOOMING BLACK VOICE joins in off-key.\n\n                                JONES' VOICE(O.C.)\n                   Mil-ler's tastes too good to\n                   hurry through...\n\n     As the singing continues, Beck looks over at an empty chair\n     in front of a bank of equipment monitors.  The vital signs\n     of each miner and his equipment are registered on this\n     console.  The chair in front of them sits conspicuously\n     empty.  This doesn't please Beck, neither does a hand\n     written sign under the console which states:  THE DOCTOR IS\n     OUT.\n\n     DEJESUS' POV\n\n     Inside his helmet we see the grid of LED gauges monitoring\n     vital signs.\n\n                                DEJESUS\n                   ...beer after beer...\n\n     Suddenly a red warning light begins blinking in the bottom\n     corner inside DeJesus' helmet.  The words to the song freeze\n     in his mouth.  His voice becomes edged with panic.\n\n                                DEJESUS(cont'd)\n                   Oh, shit...\n\n                                JONES/ RADIO\n                                (to DeJesus)\n                   Hey, Hazy, I'm not that bad, man.\n\n                                DEJESUS\n                                (rising terror)\n                   Jonesy!  I'm losing compression...\n                   I'm going to blow my suit, man!\n                   Beck!  Doc!  Help me!...\n\n     INSIDE\n\n     Beck grabs his microphone.  He tries to remain calm but\n     there is a definite tremble in his voice.\n\n                                BECK\n                   Give me a readout, DeJesus.\n\n                                DEJESUS(ON RADIO)\n                                (gripped with panic)\n                   Ahhhh!\n\n     OUTSIDE\n\n     The other divers move quickly to DeJesus.\n\n                                BECK (ON RADIO)\n                   DeJesus!  A readout!\n\n                                JONES\n                   He don't need a readout,\n                   man, he needs help!\n\n                                BECK(RADIO)\n                                (anything but calm)\n                   Stay calm!\n\n                                BOWMAN\n                   Calm!?  Where's Doc?\n\n     INSIDE\n\n     Beck stands in front of the equipment monitors, lost.\n\n                                BECK\n                                (trying to\n                                keep control)\n                   The internal monitors read\n                   normal.\n\n     ON THE MINERS, PANICKED\n\n                                COBB\n                   Where's Doc?!\n\n                                BECK(RADIO)\n                   He's not at his station.\n\n                                DEJESUS\n                                (panicked)\n                   Oh, mother of Jesus, forgive\n                   me of my--\n\n                                BECK'S VOICE\n                                (making a decision)\n                   Get him into the Shack.\n\n     DeJesus' gauges begins a countdown to implosion.  \"15, 14,\n     13...\"  DeJesus is grabbed by his co-workers and hurried the\n     last few yards to the SHACK.\n\n     INSIDE/SHACK - SAME\n\n     ON BECK  sweating bullets, turns a dial on the instruments\n     and suddenly, DeJesus' gauges jump to life.  We see the same\n     countdown in progress on the Shack's gauges!..10, 9, 8...\n\n     OUTSIDE\n\n     ON DEJESUS  He is forced into the LOCK, the underwater\n     elevator room is eerily lit.  His readout continues inside\n     his helmet...5, 4, 3...DeJesus screams.\n\n     ON BECK\n\n     DeJesus' scream comes over his radio in the control room.\n     Beck hits the elevator switch--nothing happens.  He hits it\n     again harder and suddenly DeJesus voice is drowned out by\n     the SCREAMING VACUUM PUMPS of the elevator.  It's moving!\n     Beck looks up at the monitor of the interior Lift Lock.\n\n     INSIDE/LIFT LOCK\n\n     WE SEE DeJESUS'S SUIT dripping wet.  It stands inside the\n     Lift Lock, ankle deep in greasy bilge water.\n\n     CLOSE ON HIS EYES, for a moment they remain closed, then\n     suddenly they flutter.  He's alive!\n\n     THE MESS - LATER\n\n     The blackboard prominently displayed on the wall of the Mess\n     features neatly stenciled letters that say:  \"DAYS TILL\n     PICKUP\".  The number scrawled on the chalk-smudged board\n     obviously changes daily.  Right now, it's a \"3\"...\n\n     A CLUNK, CLUNK and a Coke can rolls out of a compact COKE\n     MACHINE.  A big, sandy-haired man, SIXPACK, takes the soft\n     drink, pops the top and downs it in one long pull while he\n     looks over an arguing group of deep sea miners:  JONES,\n     Black, athletic, 30's;  COBB, 50's, a career miner with a\n     mouthful of gum;  BOWMAN, 35, attractive, hardened woman, she\n     has seen more of the world than any of them;  WILLIE,\n     twenties, fresh good looks, master electrician, optimist.\n     DEJESUS, Latino, wiry muscles, he keeps his head down, still\n     shaken from his experience.\n\n     The strain of a month of working two miles beneath the\n     ocean's surface has drawn nerves tight.\n\n                                BOWMAN\n                   I'm telling you, it's the suits!\n\n                                JONES\n                   Fuck the suits, it's the people\n                   monitoring them.  It Doc had been\n                   there like he's supposed to it never\n                   would've happened!\n\n                                SIXPACK\n                   And just what the fuck would he\n                   have done to stop it, huh?\n\n     Sixpack looks over the group, then suddenly crushes the\n     empty Coke can in his hand, punctuating the action with a\n     huge belch.\n\n                                SIXPACK(cont'd)\n                   That would have been you, DeJesus...\n\n     DeJesus keeps his head down.\n\n                                SIXPACK(cont'd)\n                   Yeah...I was standing next to a guy\n                   who blew a suit once in the\n                   Indian Ocean...little tiny hole\n                   in the fucking toe of his suit\n                   ...ocean came in and the\n                   pressure crammed his whole\n                   fucking body up into his helmet.\n                   They just buried his helmet.\n\n                                DEJESUS\n                                (coldly)\n                   I know all about implosion, man.\n\n                                SIXPACK\n                   Yeah, I bet you do.\n                                (laughs)\n                   I bet you were imploding in\n                   your pants.\n                                (laughs then imitates\n                                a hysterical DeJesus)\n                   Jonesy!  Doc!...Help me!  Help me!\n\n     DeJesus springs for Sixpack's throat AS WE CUT TO\n\n     BECK - SAME\n\n     Beck's eyes are blazing with cold authority as he speaks.\n\n                                BECK\n                   Knock it off, Sixpack!  I know\n                   it's been a long month for every-\n                   one, but we can't let something\n                   like this tear us apart...\n\n     Beck glares, ready for an argument, but as WE PULL BACK we\n     see he's talking to the mirror, in his tiny quarters.\n\n     Apparently he fails to convince himself because his hard\n     look fades and he mutters unhappily as he turns away.\n\n                                BECK\n                   Shit...\n\n     He turns around to face a smiling picture of himself at\n     college graduation with his Eastern establishment looking\n     father.  Leadership \"how-to\" books like The One Minute\n     Manager, etc. line his bookshelf with technical manuals on\n     underwater mining.\n\n     He opens his door to leave when SUDDENLY A LOUD METALLIC\n     GROANING NOISE stops him cold.  The entire Shack seems\n     shifting, like a giant waking from a nap.\n\n     MESS\n\n     The NOISE stops the fight between DeJesus and Sixpack cold.\n     All eyes go to the ceiling and walls.\n\n                                JONES\n                   Fuck the suits man...this\n                   place is going to kill us first.\n\n     Just as suddenly as it began the GROANING NOISE STOPS and in\n     its place WE HEAR an intermittent RATTLE in the air system.\n     Only Cobb seems undisturbed by this sound.\n\n                                DEJESUS\n                                (listening)\n                   There it is again...\n                                (sitting down again)\n                   Two more days.  I tell myself\n                   'you can make it two more days--'\n\n                                BOWMAN\n                   What's the weather like up top?\n\n                                WILLIE\n                   Clear for pickup.\n\n                                JONES\n                   Let's hope it holds.\n\n     Cobb looks up disgustingly.\n\n                                COBB\n                   Then what?  Huh?\n                                (to everyone)\n                   Then what?  You folks think\n                   going up top's the answer to\n                   all your problems.  Well, it ain't.\n\n                                BOWMAN\n                   Give us a break, Cobb...\n\n                                COBB\n                   A break?  You folks don't need a break,\n                   you need psychiatrists.  'Know what\n                   you'd be doing if you were up there,\n                   right now?\n\n                                SIXPACK\n                                (a boorish leer)\n                   Eating pussy and drinking brew...\n\n                                COBB\n                   Eating pussy my ass.  What about\n                   lines at the bank:  What about\n                   getting stuck in traffic?\n\n                                SIXPACK\n                                (grinning)\n                   Wherever I can find it.\n\n     Everyone laughs but Cobb, WE SEE he's serious.\n\n                                COBB\n                   Bullshit!  I'll tell you\n                   what you'd be doing!  You'd\n                   be watching news on TV\n                   that's so fucking bad it\n                   makes you nauseous.  So you\n                   go out and get in your car\n                   to get some fresh air and\n                   after you've been driving for\n                   five minutes you realize the\n                   air's so damn dirty you don't dare\n                   breath it!  That's what you've\n                   got to look forward to...\n\n     LOWER RING CORRIDOR\n\n     Beck approaches the Mess and as he nears it we hear Cobb\n     ranting inside.\n\n                                COBB'S VOICE(O.S.)\n                   ...And if you're lucky\n                   enough to make it back home\n                   to your house that looks the\n                   fucking same as everyone else's,\n                   you'll find your wife's just as\n                   fat as she was when you left and\n                   the only reason your kids ain't\n                   strung out on the drugs they were\n                   using when you left is that\n                   they've found some new drugs\n                   which fuck 'em up even more!...\n                   You people just don't appreciate\n                   how good you've got down here...\n\n     BECK hesitates at the door to the Mess, as though screwing\n     up his courage, then takes a deep breath and enters as we\n\n                                                        CUT TO\n\n     INSIDE THE MESS\n\n     Everyone looks up as Beck enters and the room goes quiet.\n     Beck notices Doc's empty chair.\n\n                                BECK\n                   Doc eat already?\n\n                                JONES\n                   The good doctor hasn't showed yet.\n\n     Looks are exchanged.  Sixpack smirks knowingly.\n\n                                BECK\n                                (to DeJesus)\n                   How do you feel, DeJesus?\n\n                                DEJESUS\n                                (obviously embarrassed\n                                to be singled out)\n                   Okay.\n\n                                BECK\n                   Better let the Doc take a\n                   look at you, after dinner.\n\n                                SIXPACK\n                   Yeah, since he was busy earlier\n                   when you needed him.\n\n     He cracks up and Beck turns on him.\n\n                                BECK\n                   Cut it, Sixpack.\n\n     Sixpack shuts up, but Beck notices the others feel the\n     seriousness of Doc's absence during the emergency.\n\n                                BECK(cont'd)\n                   Leave the Doc to me.  I'm\n                   going to talk to him.\n\n                                SIXPACK\n                                (sarcastically, under his\n                                breath to Bowman)\n                   'Makes me feel better already...\n\n     Beck gets his tray but it is clear he is thinking about\n     something else.  He clears his throat.\n\n                                 BECK\n                   I've been looking at the duty\n                   roster...at the shack hours\n                   outstanding...\n\n                                 JONES\n                   Uh, oh...I see where this\n                   is going...\n\n                                 BECK\n                                 (ignoring Jones)\n                   ...all of you owe time and I\n                   thought tonight would be a good\n                   time to---\n\n                                 COBB\n                                 (erupting)\n                   No way, Mister Beck!  No\n                   fucking way!  We just did a\n                   full shift, you can't call\n                   Shack duty on top of a full\n                   shift.  It's a contract violation!\n\n                                 JONES\n                   Whooo!  Right on, Cobb!  Let's\n                   hear it for our shop Steward!\n\n                                 SIXPACK\n                   Hear that Becky, er, Mr. Beck?\n                   Company got to abide by the rules.\n\n     FIVE FACES STARE AT BECK.  THEY'RE LOOKING FOR WEAKNESS.\n     THIS IS A CHALLENGE TO HIS AUTHORITY.\n\n                                BECK\n                   I know all about the contract.\n                   The point is you can follow the\n                   goddamn contract to the letter and pull\n                   your shack duty tomorrow...or you\n                   can get it done tonight and call\n                   tomorrow a down day.  It's up to you.\n\n     This leaves the group momentarily speechless.  Even DeJesus\n     comes out of his stupor.\n\n                                DEJESUS\n                   You giving us a day off?\n\n     Beck nods.  Cobb eyes him suspiciously.\n\n                                COBB\n                   What about our quota?\n\n                                BECK\n                   You're only twenty-five\n                   tons off quota.  Barring an\n                   unforeseen problem you should\n                   reach it easily on the last day.\n                                (he looks at the group)\n                   It's just a day off.  You don't\n                   have to take it, I just thought it\n                   might help.\n\n     The others look around for agreement but Jones doesn't need\n     anyone else's approval, he's already made up his mind.\n\n                                JONES\n                   Count me in.\n\n     Bowman nods her head also and the others unanimously agree.\n     Buoyed, Beck moves ahead, businesslike...\n\n                                BECK\n                   Cobb, Jones, I want you to do\n                   something about that damn rattle\n                   in the air system...\n                                (to Bowman and Sixpack)\n                   Bowman and Sixpack...living quarters...\n\n                                SIXPACK\n                                (disgustedly)\n                   Shit...\n\n                                BECK\n                   Williams...get DeJesus' suit on\n                   the \"sick rack\" and do a diagnostics.\n                                (to group)\n                   Any other suit problems she should\n                   know about?\n\n     Sixpack suddenly looks up as the group disperses.\n\n                                SIXPACK\n                                (to Willie)\n                   My pocket.  Check my pocket,\n                   will ya, honey?\n\n                                WILLIE\n                                (annoyed)\n                   Your pocket?\n\n                                SIXPACK\n                   The latch is screwed up.  Or\n                   the hinge.\n\n                                WILLIE\n                                (disgusted)\n                   Right.\n\n     LOWER RING CORRIDOR - SAME\n\n     ON BECK  He starts out of the Mess and by chance finds\n     himself walking with Willie.  Beck is obviously\n     uncomfortable with the crew, even after 28 days together.\n     She smiles, friendly, at ease.\n\n                                WILLIE\n                   You did good...\n\n                                BECK\n                                (a little surprised)\n                   What?\n\n                                WILLIE\n                   Today...with DeJesus.  That\n                   was smart thinking to get him\n                   inside...\n\n                                BECK\n                   There probably wasn't anything\n                   wrong with his suit...\n\n                                WILLIE\n                   Still...you did the right thing.\n\n     She turns off toward the Swamp, leaving Beck with the tiny,\n     but honest compliment.  He savors it.\n\n     THE SWAMP - LATER\n\n     The \"Swamp\" (where DeJesus came up), is ankle deep in greasy\n     bilgewater.  The door slides open, Willie enters, and\n     switches on a bank of fluorescent lights.  The room is\n     spooky even with the lights.  The giant machine suits, we\n     saw earlier outside, hang from racks like sleeping monsters.\n\n     Willie straps on a utility belt and checks her tools--a\n     motorized screwdriver, a power wrench, a long-necked,\n     laser-tipped soldering iron(looks like a long-necked\n     screwdriver)--then splashes through the bilge water to the\n     control switch and hits the START button.\n\n     NNNNNNNNNN.  A motor moves one of the suits along the track\n     toward Willie.  As it turns the corner toward us we see it\n     says:  DEJESUS.\n\n     DOC'S OFFICE - SAME\n\n     Beck opens the door to Doc's quarters and we see Doc putting\n     on a fresh shirt.  A man in his 50's, he must have once been\n     quite handsome and intelligent, but has now gone to seed.\n\n                                DOC\n                   I must have dozed off.\n\n     Beck looks on the cabinet and sees a bottle of Old Granddad\n     Whiskey.  He picks it up.\n\n                                DOC(cont'd)\n                   Snakebite medicine...Never\n                   pack my bag without it.\n\n     Beck doesn't smile.  He puts the bottle back down and Doc\n     watches him in the mirror.\n\n                                BECK\n                   Are you planning on working tomorrow?\n\n                                DOC\n                   Well, I'll be on the golf course\n                   in the morning.  Then, if I don't\n                   have any babies to deliver--\n\n                                BECK\n                                (cutting him off)\n                   We almost had an accident today.\n                   DeJesus' suit...\n\n     The Doc stops buttoning his shirt and locks eyes with Beck.\n\n                                DOC\n                   You got something to say to me, son?...\n\n     Beck definitely has something to say, but confronted, he\n     falters.\n\n                                BECK\n                   I...I think it's important to\n                   have the second officer on deck.\n\n     Doc smiles, and goes back to buttoning his shirt.\n\n                                DOC\n                   I'll keep it to nine holes\n                   in the morning.\n\n     THE DORMITORY - SAME\n\n     Small but functional.  The bunks can be closed-off with a\n     privacy door.  Photographs and bumper stickers on the walls\n     of the bunks provide the only personal touches in an\n     otherwise sterile environment.\n\n     Willie's bunk is wallpapered in detailed interplanetary\n     maps;  Sixpack's privacy door has a bumper sticker which\n     proclaims:  \"I MAY BE FAT, BUT YOU'RE UGLY AND I CAN DIET.\"\n     DeJesus' has posters of the Alps, and the Rockies;  Bowman's\n     has clipped pages from \"Gourmet\" of meals she dreams for;\n     Cobb's has nothing, as if perfectly content to be where he\n     is instead of somewhere else.  Inside Jones' bunk is an\n     indoor basketball goal.\n\n     Bowman and Sixpack scrub down the walls of the dorm with a\n     sponge and pail.  Sixpack pauses and smirks, his eyes on\n     Bowman's chest.\n\n                                SIXPACK\n                   Christ...what a pair...\n\n                                BOWMAN\n                                (sharply)\n                   What was that?  What'd you say?\n\n                                SIXPACK\n                   I said, \"What a pair\" the\n                   boy wonder Shack Boss and his\n                   drunken doctor buddy make...\n                                (innocently)\n                   Why?  What did ya think I said?\n\n     CORRIDOR \"A\" - SAME\n\n     Jones and Cobb are kneeling in a corridor, unfastening a big\n     plate on the floor with a power wrench.  Overhead a huge\n     plexiglass conduit flows with water from the desalinization\n     system.  The interior wall of the corridor is meshed wire\n     exposing the throbbing machine floor of the Shack.\n\n     Cobb removes the last bolt and Jones lifts off the\n     floorplate exposing the guts of the shack--the BILGE--dark\n     and wet.  Without the plate the RATTLE in the air system is\n     much louder and sinister.\n\n                                JONES\n                   Listen to it for Christsake.\n\n                                COBB\n                   Ah, it's just old, like me.\n                   You don't see the Doc opening\n                   me up every time I get a new creak\n                   in my joints...I say, as long as\n                   it's recycling the air let\n                   the next shift deal with it.\n                   But, 'long as we're here...\n\n     He pulls a retractable ladder from inside the hole and drops\n     it down into the wet darkness, without hesitating he climbs\n     down, stopping at the bottom to look up at Jones.  Jones\n     seems in no hurry to accompany him.\n\n                                COBB(cont'd)\n                   You gonna sit there on your\n                   butt or give me a hand?\n\n     Jones reluctantly starts down after him.\n\n     BECK'S QUARTERS - SAME\n\n     Beck in his quarters.  He seems to be talking to himself but\n     as we move around him we see he is talking to a video\n     monitor.  On screen we see MARTIN, 30's, a slick\n     bureaucratic executive with TransOcean Corp. whose face is\n     all we see on the video monitor.\n\n                                BECK\n                   Two hundred and fifty-two\n                   tons of Magnesium and 15 tons\n                   of Sodium.\n\n                                MARTIN\n                                (taking notes)\n                   Sounds like a good week, Beck.\n                   In fact...I put your folder\n                   in front of the Vice President\n                   of District Operations last night...\n\n     Beck stops.  Martin notices his concern.\n\n                                MARTIN(cont'd)\n                   You're good executive timber,\n                   Beck.  A lot of management trainees\n                   wash out when they have to go under\n                   for their first tour.  But you've done well.\n\n                                BECK\n                                (smiles, relieved)\n                   Thank you, Martin.\n\n                                MARTIN\n                   Don't thank me, yet, but it is\n                   important to know where you're\n                   going and who your friends are...\n                   'Know what I mean?\n\n     He stares hard at Beck, but doesn't wait for an answer.\n\n                                MARTIN(cont'd)\n                   The one thing I've learned in\n                   this company is you can't have\n                   enough friends.  It's the only\n                   way to survive.\n\n     CLOSE ON A BOOM BOX/ LOWER RING CORRIDOR - SAME\n\n     The boom box sitting on a wall pipe is blaring John Denver's\n     Rocky Mountain High.\n\n     DeJesus is singing along loudly in his thick accent as he\n     works on the intercom system.  He finishes, closing a metal\n     box which says:  ONBOARD COMMUNICATIONS.\n\n     SWAMP - SAME\n\n     ON WILLIE  She has connected DeJesus' suit to the diagnostic\n     computer and is going through the computerized\n     checkpoints--an electronic list of literally hundreds of\n     possible problems.\n\n                                WILLIE\n                                (to herself)\n                   Probably a short.\n\n     Suddenly, the computer pauses on one:  It says:  Electrical\n     Short.\n\n                                WILLIE(cont'd)\n                   Good guess, Williams.\n\n     She types in a \"help\" command and the computer screen\n     displays an electrical circuit pattern that would leave most\n     Electrical Engineers baffled.  Willie hardly bats an eye.\n\n                                WILLIE(cont'd)\n                   Piece of cake.\n\n     She immediately opens the circuit panel on DeJesus' suit and\n     pulls the laser soldering iron out of her tool belt.  With\n     two quick spot welds she repairs the short, then replaces\n     the panel.  Finished, Willie presses the control switch and\n     the suits begin to move along the track.  A new suit rounds\n     the corner toward us.  It says SIXPACK.\n\n     THE BILGE - SAME\n\n     The walls are dark and moist.  Water drips from the pipes.\n     The rattle in the air system continues loudly as Jones leans\n     over and hands Cobb another tool.  Crouched in the humming\n     machinery, Cobb spits his wad of chewing gum into a greasy\n     hand, kneads it a couple of times, then grins at Jones.\n\n                                COBB\n                   Okay, watch this..\n\n     THE SWAMP - SAME\n\n     The monotonous clatter of the air system is the only sound\n     in the gloomy SWAMP as the huge suit labeled SIXPACK stops\n     directly in front of Willie.  She reaches up to open the\n     pocket latch when she stops...listening.  THE NOISE IN THE\n     AIR SYSTEM HAS STOPPED.\n\n     THE BILGE - SAME\n\n     Jones looks incredulously at Cobb.  He can't believe that's\n     all it took.  Cobb starts gathering up the tools.\n\n                                JONES\n                   So that's all you do?...\n\n                                COBB\n                   Shhhh...don't tell no one.\n                                (winks)\n                   Job security.\n\n     THE SWAMP - SAME\n\n     In the gloomy silence, Willie reaches for the hinged pocket\n     in the waist of Sixpack's suit.  Some water drips out.  She\n     pushes the spring a second time.  The pocket opens.\n     Nothing.\n\n                                WILLIE\n                                (miffed)\n                   Nothing wrong with this...\n\n     SUDDENLY THE HIDEOUS SEA SPIDER SPRINGS OUT onto the\n     workbench where it wriggles grotesquely toward Willie.  She\n     backs away and it drops into the water at her feet.\n\n     THE DORMITORY\n\n     Bowman looks at DeJesus who comes to the door, then to\n     Sixpack who convulses with laughter against the bulkhead.\n\n                                WILLIE'S VOICE(O.C.)\n                                (over intercom)\n                   Fuck you, Sixpack!  You think\n                   you're funny?  You're not funny!\n\n     ON BECK\n\n     He hesitates then presses the TALK button on the intercom.\n\n                                BECK\n                   This is Beck.  Is there a\n                   problem, Williams?\n\n     SWAMP\n\n     Willie watches the Sea Spider move in the water toward her\n     as Beck's words come over the P.A.  Ignoring Beck she\n     watches the spider right as it moves to her feet then brings\n     the soldering iron down into the water with a LOUD HISS\n     skewering it.  She presses the intercom button and lifts the\n     skewered sea spider out of the water.\n\n                                WILLIE\n                                (to Beck)\n                   A little problem, sir...but I've\n                   got a handle on it now.\n\n                                           TIME CUT TO:\n\n     THE MESS - LATER\n\n     BOWMAN sits at a portable computer terminal and watches\n     stock prices scroll across the screen.  Every so often she\n     freezes a stock and types the command:  INFO.  The screen\n     immediately changes to a financial report of the company in\n     question as if prepared by a broker.  In a matter of seconds\n     Bowman can learn all the major aspects of the company.\n\n     Across the room from her, Willie exercises with dumbbells\n     while she studies an astronaut training manual.  She looks up\n     at Bowman.\n\n                                WILLIE\n                   Made your million, yet?\n\n                                BOWMAN\n                                (studying the screen)\n                   Not yet.\n\n                                WILLIE\n                   How's TransOcean doing?\n\n     This causes Bowman to turn and look at Willie.\n\n                                BOWMAN\n                   You got money in this tub?\n\n                                WILLIE\n                   I signed-up for the stock option.\n\n     Bowman shakes her head and goes back to the computer and\n     types in TransOcean Corp.\n\n     DORMITORY\n\n     ON COBB  He lies on his bunk under a sunlamp, but wears a\n     T-shirt and long pants.  DeJesus does a jigsaw puzzle of a\n     snow covered Swiss mountain scene.\n\n                                DEJESUS\n                   Hey, man, you know that in\n                   Switzerland--and this country's\n                   the size of East L.A., okay?--they\n                   speak 54 different dialects?\n                   Fifty-four!\n\n                                COBB\n                   Who cares?\n\n                                DEJESUS\n                   I do, man.  That's a beautiful\n                   place.  When I get out of here\n                   I'm going there.  Find a nice\n                   little snow covered chalet, warm\n                   little woman, crackling fire--\n\n     He looks up and sees Cobb's sunbathing attire and laughs.\n\n                                DEJESUS\n                   Hey, Cobb...Man, why don't you\n                   take off your shirt and pants,\n                   man?  You should do that wearing\n                   what you're going to wear at the\n                   beach.\n\n                                COBB\n                                (sharply)\n                   This is what I wear at the\n                   beach, goddamnit.\n\n     MESS - SAME\n\n     COMPUTER SCREEN  The report appears on screen with a\n     capsulized history of the TransOcean company, its philosophy\n     and growth plans and most current financial report.  A final\n     column called \"insider tips\" says:\n\n                                BOWMAN\n                                (reading)\n                   \"Major development in\n                   South Indian Ocean set for\n                   fall of 2010...\"\n                                (to Willie)\n                   That sounds interesting, but they're\n                   too tied to their holdings.  Remember\n                   a year ago when they lost that tanker?...\n                   The bottom fell out of their stock and\n                   I lost a bloody fortune.  That's\n                   when I decided to diversify.\n\n     Willie looks at Bowman a moment, then keeps exercising.\n\n                                WILLIE\n                   You take your money, too\n                   seriously, Bo.\n\n                                BOWMAN\n                                (sharply)\n                   You're damn right I do.  Five\n                   years down here and I'll pull\n                   in more than 15 topside.  I'm not\n                   down here for the fun, I'll tell\n                   you that.\n\n                                SIXPACK'S VOICE(O.S.)\n                   \"Fun?\"  Somebody talking fun?\n\n     They look up to see Sixpack at the door to the Mess wearing\n     only a robe.  With a leer he stares at Willie exercising.\n\n                                SIXPACK(cont'd)\n                                (saccharine sweet)\n                   Hey, Willie, honey...Sorry about that\n                   little incident tonight...Everyone's\n                   been so tight lately, I thought\n                   a little humor'd loosen us all up,\n                   you know?\n\n     Willie doesn't bite, she looks hard at Sixpack.\n\n                                WILLIE\n                   Get out of here, Sixpack.\n\n     Sixpack smirks.  He waves a copy of Penthouse opened to the\n     Pet of the Month and sings cheerfully.\n\n                                SIXPACK\n                                (leaving)\n                   I got a date with an angel...\n\n     CLANK, BANK, CLUNK.  A coke can tumbles noisily from the\n     Coke machine.  Jones retrieves two cans of Coke and comes\n     out of the Galley with a snack.  He stops in front of\n     Bowman and the computer.\n\n                                JONES\n                   Hey, Bo...when're you going to\n                   be off that thing?  I want to\n                   find out tonight's NBA scores\n                   and check the weather.\n\n                                BOWMAN\n                                (not taking her eyes off\n                                 the screen, answers him)\n                   The weather's good, I already\n                   checked, but I'll be off in a minute.\n\n                                WILLIE\n                                (to Jones)\n                   Hey, Jonesy, who's the best power\n                   forward in the NBA...Jameson?\n\n                                JONES\n                   Jameson?  Who're you trying to\n                   con?\n\n     They grin at each other--a standing joke and Jones leaves.\n\n     DORMITORY\n\n     Jones enters the Dorm with his snack and tosses a can of\n     Coke across the room to DeJesus.\n\n                                JONES\n                   Hey, Hazy!  We got a day off\n                   tomorrow, Kemosabi!  Let's get\n                   shit-faced!\n\n     DEJESUS catches the can and pops the top sending a shower of\n     carbonation all over Cobb under the sunlamp.\n\n                                JONES(cont'd)\n                   How about you, brother Cobb?\n                   Little Wild Turkey?\n\n     Cobb wipes the Coke from his sunglasses and shakes his head.\n\n                                DEJESUS\n                   No, man, Cobb is a Chivas drinker,\n                   from way back.  Ain't that right\n                   Cobbie?\n\n     Jones and DeJesus laugh and take long pulls on their Cokes.\n     Cobb turns and watches them.  This is obviously a nightly\n     ritual.\n\n                                COBB\n                   You guys are crazy.  What\n                   the hell you play that stupid\n                   game for?\n\n                                DEJESUS\n                                (acting drunk)\n                   What game, Cobb?...I'm on\n                   my way to Nirvana...\n\n                                COBB\n                   You're on your way somewhere\n                   all right...the looney bin.\n\n                                DEJESUS\n                                (laughing)\n                   I'm on the way to the looney\n                   bin?  Hey, man, I'm not the dude\n                   sun bathing in his clothes.\n\n     INT. SIXPACK'S BUNK - SAME\n\n     CLOSE ON  The Pet of the Month as she smirks coyly from the\n     centerfold, her body twisted into an awkward position\n     representing mad desire.\n\n     Sixpack closes his privacy door then smirks back at the\n     photo.\n\n                                SIXPACK\n                   Oh, Darlin'...come sit on\n                   my face...\n\n     He stirs in the bed and adjusts his pillow and SCREAMS!  The\n     SEA SPIDER is suddenly right there on his shoulder, dead.\n\n     Sixpack sits bolt upright in his bunk and slams his head\n     against the roof of the bunk, then stumbles out screaming.\n     He hits the floor and rams his foot into a table and screams\n     in more pain.\n\n     The whole dorm looks up amazed, Cobb takes off his\n     sunglasses, even Jones and DeJesus temporarily \"sober up\" to\n     stare.\n\n                                SIXPACK\n                   That bitch!\n\n     MESS\n\n     Sixpack storms into the Mess with the dead Sea Spider.  He\n     points angrily at his bleeding foot.  Jones and DeJesus move\n     up to watch.\n\n                                SIXPACK\n                                (moving into room)\n                   Bitch!  Look what you did!\n\n                                WILLIE\n                                (imitating Sixpack)\n                   Sorry, darling...Just thought a\n                   little humor would loosen us all\n                   up...you know?...\n\n     Everyone laughs, but Sixpack.  He has revenge in his eyes.\n     He holds out the ugly, limp creature and advances toward\n     Willie.\n\n                                SIXPACK\n                   You think you're so funny?\n                   Wait till you taste this!\n\n     As he pushes the dead creature into her face BECK'S VOICE\n     behind him makes him freeze.\n\n                                BECK'S VOICE(O.S.)\n                   That's enough!\n\n     Everybody turns to see Beck standing in the doorway.\n\n                                SIXPACK\n                   Look at my foot, sir!  This\n                   bitch put a goddamn sea\n                   monster in my bunk!\n\n                                BECK\n                                (cold as ice)\n                   How do you know it was Williams?\n\n                                SIXPACK\n                                (trapped)\n                   Huh?  I...uh...uh...\n\n                                BECK\n                   All right, Sixpack, you and\n                   Williams are gonna pull water\n                   duty tomorrow--\n\n                                SIXPACK AND WILLIE\n                                (protesting)\n                   Bullshit!  What?!  She...He...\n\n                                BECK\n                                (cutting them off)\n                   At ease!  You both have a half\n                   day...Anymore shit and its a full\n                   one.\n\n     CLOSE ON BLACKBOARD/ MESS - MORNING\n\n     SCREECH!  Chalk on the blackboard as Bowman writes \"2\" in\n     place of yesterday's \"3\" over the neatly lettered words\n     \"Days Till Pickup.\"\n\n     Jones, sitting next to Cobb, looks up from his tray of\n     cereal and holds his head in mock misery.\n\n                                JONES\n                   Oooooh.  Damn!  Not so loud.\n                   Turn down the music.\n\n                                COBB\n                   What music?  There ain't no\n                   music.\n\n     DeJesus enters holding his head and sits on the other side\n     of Cobb.\n\n                                DEJESUS\n                   Oooooh.\n\n     Cobb looks from one man to the other, realizing what they're\n     doing.\n\n                                COBB\n                   You know it's really crazy to\n                   pretend to be drunk, but it's\n                   fucking insane to pretend\n                   to have a hangover.\n\n                                BOWMAN\n                                (to Jones and DeJesus)\n                   Your \"hangovers\" made you miss\n                   the Sixpack Good Morning Show.\n                                (imitating Sixpack)\n                   \"No goddamn boy is going to make\n                   me go out on a down day.\"\n\n                                JONES\n                                (grinning)\n                   Yeah?  How'd the kid hold up?\n\n                                COBB\n                                (pleased)\n                   Pretty good.  He sent them\n                   out videotaping outcrop.\n\n     UNDERWATER - SAME\n\n     CLOSE ON  A whirling cylinder tool we see is attached to the\n     end of Willie's mechanical suit arm.  Like a drill its\n     diamond bits cut into the rock outcrop to take a core\n     sample.  It's a sinister hand-attachment, something Captain\n     Hook would have loved.\n\n     Above her the ROV maneuvers into position for a better view.\n\n     INSIDE THE SHACK CONTROL - SAME\n\n     Beck is in the control station, staring at the video\n     monitors--the image from the ROV.  Willie removes a slender\n     instrument, like a bicycle pump and with a quick pump\n     motion, CHUNK, CHUNK...activates an explosive charge.  She\n     puts it into the hole she made with the drill and backs off.\n\n                                BECK\n                   Charge set?\n\n                                WILLIE'S VOICE(RADIO)\n                   Charge set.  Backing off.\n                                (to the ROV)\n                   C'mon Rover let's get out\n                   of here.\n\n     Like a good dog, the ROV follows her to a safe position.\n\n     ON MONITOR  THE CAMERA HOLDS ON THE SPOT.  SUDDENLY THE\n     GROUND SHAKES VIOLENTLY ON THE MONITOR SCREEN--A MINI\n     EARTHQUAKE CHARGE.\n\n     WILLIE RETURNS TO THE SITE OF THE CHARGE AND REINSERTS HER\n     DRILL, EASILY REMOVING A TEST SAMPLE.\n\n     Willie holds out the sample to the ROV so Beck can see\n     inside.\n\n     INT. CONTROL ROOM/ CLOSE ON BECK'S ROV MONITOR\n\n     He stares at the image on the screen.\n\n                                BECK\n                   I need more light on that, Four.\n\n     OUTSIDE\n\n                                WILLIE\n                                (to Beck)\n                   Roger...\n                                (to Sixpack)\n                   More light, Sixpack...\n\n     There is no answer.  Willie turns around.  Her helmet lamp\n     eerily illuminating the darkness around her.  Sixpack is\n     nowhere to be seen.\n\n                                WILLIE(cont'd)\n                   Sixpack?\n\n     She turns in the other direction and suddenly blinding\n     lights are turned on.\n\n                                SIXPACK\n                   Boo!\n\n     Sixpack laughs.  His lights now on, he stands right behind\n     her.\n\n                                WILLIE\n                   You shit....\n\n                                BECK'S VOICE\n                   What's going on, Four?  What's\n                   happening?\n\n                                WILLIE\n                   We're fine, Shack.  His lights\n                   malfunctioned for a minute.  How's\n                   this?\n\n     She again holds out her hand to the ROV.\n\n     INSIDE SHACK\n\n     Beck looks at the monitor and presses a red button to start\n     the tape, then after five seconds releases the button.\n\n                                BECK\n                   That's great.  Now let's move\n                   35 degrees southwest.\n\n     WILLIE AND SIXPACK MOVING\n\n                                WILLIE\n                                (to Sixpack)\n                   You screw around like that again and--\n\n                                SIXPACK\n                   What's wrong, did you miss me?\n\n                                WILLIE\n                   Hardly.\n\n                                SIXPACK\n                   Don't worry, darlin, I'm...\n\n     Suddenly Sixpack's foot hits some loose rock and slides.\n\n     Willie turns in his direction and sees his headlight\n     turning, becoming smaller, then disappearing as his radio\n     goes dead.\n\n     INSIDE ON BECK\n\n                                BECK\n                   What's wrong?!  What happened?\n\n     UNDERWATER\n\n     ON WILLIE  She has stopped in her tracks.  All around her is\n     blackness.  Her helmet light hardly penetrates the darkness.\n\n                                WILLIE\n                   Sixpack?!  Sixpack...\n\n     Then she looks down--a cliff right in front of her feet.\n     The drop is thirty feet into a waving sea of tubers.\n\n     BECK'S VOICE brings Willie back.\n\n                                BECK'S VOICE(RADIO)\n                   Willie?  What's going on?\n\n                                WILLIE\n                   He's gone.  I think he's\n                   fallen.  I'm going down after him.\n\n     MESS\n\n     Jones is bench pressing 200 pounds on a fold-down compact\n     gym, while DeJesus huffs and puffs on an exercise bike.\n\n                                DEJESUS\n                   That's it Jonesy...Sweat it\n                   out, man...Got to get the poison\n                   out of our blood.\n\n     Jones grits his teeth and struggles against the weight,\n     suddenly Bowman throws open the door and sticks her head in.\n\n                                BOWMAN\n                   Sixpack is lost.\n\n     CORRIDOR - MOMENTS LATER\n\n     Bowman, Jones and DeJesus are heading for the control room\n     where they are joined by Cobb.\n\n                                COBB\n                   Weren't they tied?  They're\n                   supposed to be tied.\n\n     They all enter the\n\n     CONTROL ROOM\n\n     Beck is at the console with Doc in his chair.\n\n                                JONES\n                   How far away is she?\n\n                                DOC\n                   Two hundred meters.\n\n     WILLIE'S VOICE silences them.\n\n                                WILLIE'S VOICE(RADIO)\n                   Four to Shack...nearing the\n                   bottom.  Look at this...\n\n     They all stare at the monitor.  The screen is filled with\n     huge waving tubers.\n\n                                DOC\n                   My God, look at the size of\n                   those tubers....\n\n                                DEJESUS\n                   Nine, ten feet high...\n\n                                BOWMAN\n                   If he had his blinkers on--\n\n                                JONES\n                   It wouldn't make any difference in\n                   there...He could be two feet away and\n                   on fire and she'd still not see him!\n\n     UNDERWATER\n\n     ON WILLIE  She moves through the dense waving forest of\n     giant tubers, parting them with her hands as she moves\n     slowly.\n\n                                WILLIE\n                   Sixpack?\n\n     CONTROL ROOM\n\n                                BECK\n                   Why can't we pick up his signal?\n\n                                DEJESUS\n                                (a joke)\n                   Maybe he got eaten?\n\n                                BOWMAN\n                                (dryly)\n                   What would be dumb enough to\n                   eat Sixpack?\n\n     ON WILLIE\n\n     She moves aside the last of the tubers and freezes at the\n     sight in front of her.\n\n                                WILLIE'S VOICE(RADIO)\n                   Four to Shack...you picking\n                   this up?\n\n     INSIDE\n\n     All eyes suddenly go to the monitor.  A huge dark maw fills\n     the screen.\n\n                                BECK\n                   Affirmative...Widening picture.\n\n     The image on the screen widens and we see the opening is a\n     huge gash in the side of a sunken ship.\n\n                                BECK(cont'd)\n                                (to DOC)\n                   Tighten the picture on the\n                   upper righthand corner.\n\n     CLOSE ON THE MONITOR:  The picture zooms in on the corner\n     and Willie's added light suddenly brings the letter \"M\" into\n     focus.\n\n     Beck presses the red record button and pans the ROV slowly\n     across the bulkhead of the ship.  The next letter is an \"A\".\n     Then suddenly a Cyrillic letter appears, then others.\n\n                                COBB\n                   What the?...\n\n                                DOC\n                   Russian.\n\n                                WILLIE'S VOICE(RADIO)\n                   I'm going inside.\n\n                                BECK\n                   What's your air reading?\n\n                                WILLIE'S VOICE\n                   Twenty minutes...\n\n                                BECK\n                   Twenty minutes!...Who had\n                   tank duty?\n\n                                BOWMAN\n                   Who else...Sixpack.\n\n                                JONES\n                   The man is unbelievable...\n                   I say, leave him in there.\n\n                                BOWMAN\n                                (dryly)\n                   What about his suit?  That's\n                   a million five the company's\n                   got to replace.  They'll make\n                   somebody go get it.\n\n                                BECK\n                                (to Willie)\n                   Willie, we're giving you five\n                   minutes...after that we're coming in.\n\n     WILLIE'S POV\n\n     Her life-support gauges move eerily around the perimeter of\n     her mask.  She moves along steadily down darkened corridors.\n     She opens a door and it drops from its corroded hinges--a\n     cloud of sludge rises off the bottom.  The room looks empty.\n\n                                WILLIE\n                   Sixpack?...Answer me.\n\n     She throws open another door.  It also looks empty, then\n     WHAM! a grotesque ECHONODERM slams into her helmet.  Willie\n     bats it aside and as soon as she recovers shines her light\n     into the room.\n\n     WHAT SHE SEES:  The ship's infirmary.  Broken glass,\n     stainless steel...the light does strange things, reflecting,\n     sparkling...\n\n                                WILLIE(ON RADIO)\n                   The infirmary...\n\n                                BECK'S VOICE(RADIO)\n                   Three minutes...\n\n     Her helmet-mounted camera pans the room one more time, then\n     as she turns to leave it captures a strange gleam of white\n     in the corner--A LARGE HUMAN-LIKE SKELETON.  Willie doesn't\n     see it.\n\n     INT. THE CONTROL ROOM\n\n     CLOSE ON DOC  He stares at the monitor screen.  Did he see\n     something or were his eyes playing tricks?  He looks across\n     the console and sees the videotape is recording.\n\n     UNDERWATER\n\n     ON WILLIE  She moves to the end of the hall.  It ends with\n     two doors.\n\n                                BECK'S VOICE(RADIO)\n                   One minute.\n\n     Willie hesitates at the junction and PUSHES OPEN the door on\n     her left, SOMETHING HUGE BEHIND IT MOVES--IT'S SIXPACK.  His\n     mechanical arms suddenly rise and in their grasp we see the\n     ship's huge safe.\n\n                                SIXPACK\n                                (laughing)\n                   I'm rich, honey.  Rich!\n\n     THE SWAMP - LATER\n\n     The door to the Russian ship's safe stands open.  BANG!\n     BANG!  Jones and DeJesus hammer safety deposit boxes with a\n     chisel.  While the others watch, Sixpack pleads his case\n     with Beck.\n\n                                SIXPACK\n                   It's all mine if I'm on report.\n                   Otherwise you gotta take me off\n                   report before you look at any more...\n                   Ain't that right, Cobbie?\n\n                                COBB\n                   You're on your own, Sixpack, you\n                   fucked up everybody's day off...\n\n     DeJesus pries off the top from the first safety deposit box\n     and dumps the contents on the workbench...several wallets,\n     wristwatches, a pocket watch, a wedding ring...Bowman who\n     stands with a clipboard begins taking inventory.\n\n                                BOWMAN\n                   Personal effects...\n\n                                WILLIE\n                                (considering\n                                a watch)\n                   Timex...\n\n     She picks up something else, a pack of soggy chewing gum and\n     tosses it to Cobb.\n\n                                WILLIE(cont'd)\n                   Here's something for you, Cobbie.\n\n                                JONES\n                                (checking a wallet)\n                   Russian money...Don't look like much.\n\n     Jones opens the next box and dumps it out onto the\n     table...Life Savers candy, a postcard of a fat Russian woman\n     in a bathing suit.  Bowman looks at it.\n\n                                BOWMAN\n                                (grinning to\n                                Sixpack)\n                   Yeah, I'd say you can retire\n                   with all this loot.\n\n                                SIXPACK\n                   Shut up.\n\n     Everyone chuckles.  More papers and a small, book-shaped\n     object wrapped in plastic.  Jones unwraps it.  It's a video\n     tape.  He looks at the label.\n\n                                WILLIE\n                   What is it?\n\n                                JONES\n                                (reading)\n                   \"Debbie Does Dallas\"...\n                                (looks up and\n                                grins)\n                   Hell, it's in Russian.  I can't\n                   read it...\n\n                                DOC\n                   May I see it?\n\n     Jones hands it to Doc who looks at it.\n\n                                DOC (cont'd)\n                   It's a log of some sort.\n\n     Jones pries the lid off another box and dumps it\n     out--Papers, more cheap watches.\n\n     ON SIXPACK  He notices something silver, the size of a\n     paperback book, under a stack of papers.  Discreetly he\n     covers the object with a piece of paper and slides it off\n     the table out of sight.\n\n     Jones opens the last box, and something rolls across the\n     table toward the edge and starts to drop when it is caught\n     by DeJesus.  He holds it up and we see--a clear liquor\n     bottle.\n\n                                WILLIE\n                   Vodka.\n\n                                COBB\n                   What assholes, they lock booze\n                   in the safe.\n\n                                DEJESUS\n                   Probably confiscated.  No\n                   booze on board, same as us.\n\n     Doc turns the bottle around in DeJesus' hand so he can read\n     the label.\n\n                                DOC\n                                (eyeing the bottle)\n                   Stolichnaya.\n\n     Everyone looks at Doc.\n\n                                COBB\n                   You read Russian?\n\n                                DOC\n                   Russian, French, Italian, Spanish,\n                   Greek, German, a little Hindu, some\n                   Serbo Croat and a smattering of\n                   Swahili...standard pre-med background...\n\n     Cobb stares at him a second then:\n\n                                COBB\n                   Bullshit.\n\n                                DOC\n                                (grins)\n                   ...and a Russian grandmother...\n\n     Beck ignores them and addresses Bowman.\n\n                                BECK\n                   I want all this stuff impounded\n                   in the supply safe.\n\n     He lifts the bottle of Stolie out of DeJesus' hands.\n\n                                BECK(cont'd)\n                   ...except this...it goes in my\n                   safe.\n\n     A disappointed crew watches Beck leave with the bottle.  Doc\n     stops him.\n\n                                DOC\n                                (to Beck,\n                                holding up the videotape)\n                   You mind if I take a look at\n                   this?\n\n                                BECK\n                                (leaving)\n                   Be my guest.\n\n     RING CORRIDOR - LATER\n\n     The gloomy corridor outside the Infirmary.  It is empty,\n     silent.  Suddenly the door to the Infirmary opens slightly\n     and Bowman peeks out.  Seeing the corridor is empty she\n     slips out with a a manila folder.\n\n     DORMITORY - SAME\n\n     Bowman hands the envelope to DeJesus, who's grinning\n     delightedly.\n\n                                DEJESUS\n                   You got 'em!\n\n     Sixpack and Jones are there too.  Sixpack scowls.\n\n                                SIXPACK\n                   What good's the kid's med\n                   records anyway!\n\n                                DEJESUS\n                   Watch and learn, amigo...\n\n     CONTROL ROOM - LATER\n\n     CLOSE ON MONITOR SCREEN\n\n     We see a thin, bearded man in his late fifties, a RUSSIAN\n     SHIP'S CAPTAIN talking to the camera in Russian.  The tape\n     is of poor quality and water spotted.\n\n                                DOC'S VOICE(O.S.)\n                                (translating)\n                   Another party last night.  More\n                   Vodka.  The infirmary is filled\n                   as it is.  I confiscate what\n                   I can, but I know the Government\n                   Observers have more...\n\n     Suddenly, the captain hears a noise off-screen and goes to\n     the camera and turns it off.  The tape goes blank.\n\n     ON DOC\n\n     He stops the tape and presses another button on the console.\n     WILLIE'S VIDEO of the huge hole in the hull of the ship\n     appears on another screen.\n\n                                DOC(cont'd)\n                   See that gash?  The way the\n                   edges protrude inward is like\n                   from a torpedo explosion.  It\n                   couldn't have come from within.\n                   Like an accident.\n\n     He looks back at Beck who we see is sitting behind him, and\n     has also been watching the tape.  Beck looks at Doc and\n     shrugs.\n\n                                BECK\n                   What do you want me to say?\n                   That it all sounds mysterious?\n\n                                DOC\n                   These observers were doing something.\n                   A test...I think they sank that ship\n                   on purpose to cover up their mistakes.\n\n                                BECK\n                   What mistakes?\n                                (he shakes his\n                                head wearily)\n                   Look, I think it's no big deal but\n                   if you want to find out why this\n                   ship sank have Maritime run a check.\n\n     He gets up and goes to the door.  Doc watches him.\n\n                                DOC\n                   I did.  They have no record of\n                   the wreck.\n                                (beat)\n                   The Marshal Goloviev is now on\n                   a tour in the Baltic Sea.\n\n     Beck stops.  This is a mystery.\n\n     CLOSE ON COMBINATION LOCK/ BECK'S QUARTERS - SAME\n\n     Fingers fiddle with the combination.  He pulls on the\n     handle.  The safe doesn't budge.\n\n                                DEJESUS\n                                (whisper)\n                   It's not the phone number...\n\n     We pull back to see that DeJesus is alone in Beck's darkened\n     quarters, he talks to the P.A.  Suddenly we hear BOWMAN'S\n     VOICE over the intercom.\n\n                                BOWMAN'S VOICE\n                                (on intercom)\n                   Okay, try the social security\n                   number...\n\n     DeJesus puts his fingers back, on the safe dial.\n\n                                DEJESUS\n                   Okay, give it to me...\n\n     INTERCUT WITH BOWMAN IN DORM.\n\n                                BOWMAN\n                                (reading off of Beck's\n                                forms)\n                   Two...twelve...ninety-six.\n\n                                SIXPACK\n                                (scoffingly)\n                   You guys are so full of shit...\n                   Who's going to use their\n                   birthday...\n\n                                DEJESUS VOICE\n                                (over intercom)\n                   BINGO!\n\n                                SIXPACK\n                                (suddenly sitting up)\n                   Like I said, that bottle's mine!\n\n     CONTROL ROOM - SAME\n\n     ON Beck at the door and Doc.\n\n                                DOC\n                   I want your permission to\n                   check that vodka.\n\n     Beck looks at him.  It is obvious that he doesn't trust Doc,\n     with the vodka, but he's diplomatic.\n\n                                BECK\n                   This is a mining shack, not\n                   a lab, Doc.  If there's something\n                   strange with the vodka it's safe\n                   till we get back.\n\n     UPPER RING CORRIDOR\n\n     ON COBB  Standing watch for DeJesus.  Suddenly the door to\n     the Control room opens and Beck walks out.  Cobb grabs a\n     walkie-talkie.\n\n                                COBB\n                   Beck's coming.\n\n     BECK'S QUARTERS/ ON DEJESUS\n\n     He hears Cobb and freezes.  He looks around--the cramped\n     quarters don't offer much in the way of hiding places.\n\n     INTERCUT WITH BOWMAN AND OTHERS IN DORMATORY\n\n     They react similarly to the sound of Cobb on the P.A.\n\n     ON COBB AND BECK/ CORRIDOR\n\n     Beck stops outside his door and sees Cobb.\n\n                                BECK\n                   Something wrong, Cobb?\n\n                                COBB\n                                (struggling)\n                   Uh..Excuse me sir, it's the air\n                   recirculating system, sir...\n\n                                BECK\n                   What's wrong with it?\n\n                                COBB\n                                (thinking fast)\n                   ...I'd really have to show it to\n                   you.\n\n                                BECK\n                                (beat)\n                   All right...\n\n     Cobb smiles, he can't believe his luck, then Beck holds up\n     the videotape.\n\n                                BECK(cont'd)\n                   ...Just let me put this in\n                   my safe...\n\n     Before Cobb can react Beck opens the door to his quarters\n     and steps inside.\n\n     BECK'S QUARTERS  WE SEE no sign of DeJesus.  Cobb follows\n     into the room, looking carefully around for sign of DeJesus.\n\n     In the mirror to Beck's bathroom, Cobb spots DeJesus\n     pressing against the wall.  Cobb suddenly starts to sweat\n     bullets.  Beck quickly unlocks the safe, opens it, and puts\n     the videotape right next to the bottle of Vodka.\n\n     We see Cobb's reaction.  Beck turns.\n\n                                BECK\n                   Something wrong?\n\n     Cobb shakes his head weakly and starts to follow Beck out,\n     he sneaks a look back at DeJesus in the shadows who gives\n     him a thumbs up.\n\n     MESS - LATER\n\n     Five specimen cups filled with vodka.  Bowman takes hers and\n     looks at it questioningly.  Cobb watches the door for signs\n     of the officers.\n\n                                BOWMAN\n                   Cute, DeJesus...Specimen cups?\n\n                                JONES\n                   Aw, loosen up, Bowman...\n                                (he looks over and\n                                notices Willie)\n                   Hey, Willie, I got one served\n                   up for you.\n\n     Willie shakes her head.\n\n                                WILLIE\n                   No, thanks.  I've got my\n                   blood tests in three days.\n\n                                DEJESUS\n                   That's all you do is exercise.\n                   You got to learn to live a little.\n\n                                WILLIE\n                   After my astronaut training physical,\n                   then I'll tie one on.\n\n                                SIXPACK\n                   Forget space cadet, I'll drink hers.\n\n                                COBB\n                   Hey what happens it he goes\n                   back and finds the bottle missing?\n\n                                DEJESUS\n                   He won't...\n\n     He holds up a plastic IV bag filled with clear liquid.\n\n                                DEJESUS(cont'd)\n                   I poured the vodka in here.\n\n     Cobb, Jones, DeJesus, Bowman, and Sixpack grin and clink\n     glasses, then knock back their vodka.  Afterwards we get\n     their reactions.\n\n     JONES:  Looks concerned.\n     BOWMAN:  Shakes her head, something's wrong.\n     DEJESUS:  Can't get the taste off his tongue.\n     COBB:  Seems totally satisfied.\n     SIXPACK:  who has held the liquid in his mouth savoring it,\n     suddenly spits the vodka out.\n\n                                SIXPACK\n                   Shit!  It's water!\n\n                                JONES\n                   Beck switched it!\n\n                                DEJESUS\n                   Can you beat that?  The sonof-\n                   abitch doesn't trust us!\n\n     Willie grins at her co-workers and Beck's move and jogs out\n     into the corridor.  Sixpack disgustedly tosses his shot\n     glass away and leaves.\n\n                                SIXPACK\n                   That little turd.  If I\n                   ever get the chance I'll\n                   fix his ass.\n\n     The others put down their glasses disappointedly except\n     Bowman.  She watches Sixpack.\n\n     DORMITORY\n\n     SIXPACK'S BUNK  He closes his privacy door and hesitates as\n     if listening for the others, then he removes a silver flask\n     with Cyrillic lettering--the silver object he palmed in the\n     Swamp--and smiles as he takes a long pull.  Suddenly WHAM!\n\n     The Privacy door to Sixpack's bunk is slammed open.\n     Startled he turns startled to see--BOWMAN.\n\n                                BOWMAN\n                   Didn't I ever tell you vodka\n                   was my favorite drink?\n\n     She holds out her glass.  Sixpack looks around the Dorm,\n     it's empty, then grins sheepishly and pours her a shot.\n\n     CORRIDOR \"B\"\n\n     ON WILLIE  She is jogging through the corridors.  Suddenly\n     there is a GREAT GROANING NOISE.  Willie stops and looks\n     through the steel mesh wall into the machine floor.  The\n     dark shapes of the machines move monstrously in the dim\n     light.  The GROANING ends and she jogs on to the Swamp.\n\n     As she passes the door she notices the light and stops.  Beck\n     stands with a clipboard by an equipment cabinet filled with\n     the parachute-like Container Transporters we saw outside.\n     He sees her.\n\n                                BECK\n                   That was a loud one wasn't it?\n\n                                WILLIE\n                   After a month of it you'd think\n                   I'd be used to it.\n\n     She moves into the Swamp and goes to the Lift Lock, stopping\n     under one of the ladders she leaps up and grabs a metal rung\n     above her and begins doing her chin-ups as Beck watches her\n     lean body easily doing the exercises.\n\n                                BECK\n                                (watching her)\n                   How's astronaut training?\n\n                                WILLIE\n                   Why?  You going to give me hard\n                   time like the others?\n\n                                BECK\n                   No.  I'm just being friendly.\n\n                                WILLIE\n                                (beat)\n                   Good...It's going good.\n\n     Beck tries to concentrate on his inventory, but continues to\n     watch Willie's sexy, athletic body.\n\n                                BECK\n                   Whatever made you want to\n                   do a tour down here?\n\n                                WILLIE\n                   I need electrical field\n                   experience on my resume.\n                   Everything helps...\n                                (she watches him)\n                   Why are you here?\n\n                                BECK\n                   Everybody in corporate training\n                   serves a tour on the line.  Sup-\n                   posed to hone leadership skills\n                   or something.\n\n                                WILLIE\n                   Has it helped?\n\n     Beck shrugs.\n\n                                WILLIE\n                   I guess there's not a lot of\n                   adventure in the Control Room.\n\n     Beck looks up and they lock eyes.\n\n                                BECK\n                   You think I should hang around\n                   more with the crew?\n\n                                WILLIE\n                   Well, I always heard you don't\n                   \"learn\" leadership, you earn it.\n                                (beat)\n                   How did you know they'd get\n                   into the vodka?\n\n     Beck looks up from his clipboard and smiles.\n\n                                BECK\n                   I guess I figured if I was in\n                   their shoes that's what I would've\n                   done.\n\n                                WILLIE\n                                (smiles)\n                   Maybe you're more one of us\n                   than you think...sir.\n\n     INT. MESS/ BLACKBOARD - MORNING\n\n     SCREECH!  The chalk shrieks across the blackboard, making a\n     \"1\" over the words \"Days Till Pickup.\"\n\n     Jones looks up from his cereal at Bowman, the culprit with\n     the chalk.\n\n                                JONES\n                   Puuleeeeze...\n\n     INT. DORMITORY - SAME\n\n     DeJesus puts on his wet suit which goes under his large\n     mechanical suit and gets ready to join the others in the\n     mess.  He notices Sixpack's privacy door is still closed and\n     bangs on it.\n\n                                DEJESUS\n                   Hey, Sixpack...Rise and shine\n                   amigo...\n\n     There is no answer.  Carefully he opens the door and is\n     surprised to find it empty.\n\n     INT. INFIRMARY - SAME\n\n     CLOSE ON Sixpack's eye.  We pull back to see it is being\n     examined by Doc who frowns.\n\n                                DOC\n                   Let's see your tongue.\n\n     Sixpack obliges as Beck enters.\n\n                                BECK\n                   What's wrong?\n\n                                DOC\n                   Pretty good imitation of\n                   a hangover and I ought to know.\n\n                                SIXPACK\n                   Well, it ain't!  It feels a\n                   thousand times worse.\n\n                                DOC\n                   Where?\n\n                                SIXPACK\n                   I...I dunno.  I just feel...\n                   wrong.\n\n                                DOC\n                   Take off your shirt.\n\n     Sixpack pulls off his shirt.  Doc frowns in surprise.\n\n     WHAT HE SEES:  SIXPACK'S TORSO  There are strange black\n     areas, each of them an inch in diameter.\n\n                                DOC (cont'd)\n                                (concerned)\n                   How long...how long have you\n                   had these?\n\n                                SIXPACK\n                                (surprised, scared)\n                   Shit, Doc...I didn't know I\n                   had them.\n\n     Doc peers closely at the skin where it's discolored.  It's a\n     different texture.  Beck watches as Doc touches a spot and\n     Sixpack screams in agony.  Doc and Beck lock eyes.\n\n     BECK'S QUARTERS - SAME\n\n     CLOSE ON MARTIN on Beck's video monitor.  He is drinking a\n     cup of coffee.\n\n                                MARTIN\n                   ...as long as you know it's\n                   not in your contract.\n\n                                BECK\n                   I know that.\n\n                                MARTIN\n                   Well, suit yourself, then...its\n                   your decision...\n                                (he chuckles)\n                   Ha ha...a little joke...suit\n                   yourself...\n\n     Beck interrupts impatiently.\n\n                                BECK\n                   How's the weather for pickup\n                   tomorrow?\n\n                                MARTIN\n                                (looking at a report,\n                                then up at Beck)\n                   Beautiful.\n\n     THE SWAMP - MORNING\n\n     The crew members climb into their suits.\n\n                                COBB\n                   Bad as he is there's no way\n                   we can make our quota with-\n                   out his sad self out there.\n                   You just can't do it.\n\n                                DEJESUS\n                                (angrily)\n                   He's tanking on us...\n\n                                WILLIE\n                   No...he's really sick.  I heard him\n                   last night.  The company will take\n                   that into consideration...\n\n                                JONES\n                   Honey, the company don't give\n                   a flying fuck about \"whys,\" they\n                   just look at the numbers and\n                   the contract says if we miss our\n                   quota they only got to pay us\n                   half-pay for the entire month.\n\n                                DEJESUS\n                                (convinced)\n                   'Cocksucker's tanking on us...\n\n     Suddenly all eyes go to the door, Beck enters.\n\n                                BECK\n                                (to DeJesus)\n                   No, he's really sick...He won't\n                   be going out today.\n\n     The crew increases its bitching...\n\n                                COBB\n                   There goes our quota...\n\n                                BOWMAN\n                   Thirty days, right down the toilet...\n\n     Beck ignores them and goes to the control rack which sends\n     the suits around the room and pushes number 8--his suit.\n     DeJesus and Jones share a look.  Bowman and Willie watch him\n     carefully.  As Beck's suit stops in front of him the room is\n     quiet, they can't believe their eyes.  Awkwardly, Beck\n     tries to get into his suit.  Cobb breaks the silence.\n\n                                COBB\n                   Excuse me, sir...\n\n                                BECK\n                   Is this a contract violation,\n                   Mr. Cobb?\n\n                                COBB\n                   No sir...I just wanted to know\n                   if you needed a hand?\n\n     Beck sees he's sincere, then looks at the others and Willie.\n     She nods slightly.  Beck turns back to Cobb.\n\n                                BECK\n                                (beat)\n                   Thanks...\n\n     INT. THE INFIRMARY - SAME\n\n     Doc and Sixpack.  Doc takes a blood sample, seals it and\n     opens a cabinet under the sink where a supply of blood is\n     stored in a refrigerated unit.  The plastic bags of blood\n     are labeled with the various crew members' names.\n\n     Sixpack watches him from the examination table.  He is\n     shivering violently and scared.\n\n                                SIXPACK\n                                (he's losing it)\n                   Please, Doc...I'm cold...I hurt...\n\n     We see a change in Doc's demeanor.  He is suddenly needed\n     and it has touched something in him and we see him rising to\n     the challenge.\n\n                                DOC\n                   I'm just going to take a tiny\n                   piece of skin to look at under\n                   the microscope...Afterwards I'll\n                   give you a sedative.\n\n     Skillfully Doc takes a skin sample.  Sixpack screams.\n\n     VIEW THROUGH THE MICROSCOPE\n\n     An enlarged view of the cells in alarmingly hyperactivity.\n     We see it literally spreading before our eyes.\n\n     ON DOC\n\n     He leans back from the microscope.  There is awe on his face\n     for the first time since first year medical studies--and\n     there is fear of the unknown.  He looks over his shoulder at\n     Sixpack, his shivering has stopped, he lies still on the\n     table.\n\n     UNDERWATER\n\n     Lights move in the blackness, but there is an order to the\n     actions and a crispness to the voices.  People doing work\n     that is moving sharply.  Pride in what they're doing.\n\n                                DEJESUS\n                   Okay, number 23's full.\n\n                                BECK\n                   Let's get it out of here and\n                   bring in a new one.\n\n                                JONES\n                   Yes sir...\n\n                                BOWMAN\n                   Hook's on 24...\n\n                                BECK\n                   Let's have her...\n\n     The Container transporters fill with compressed air and lift\n     the container as the miners guide it to the track...\n\n     INT. INFIRMARY/ SHACK - SAME\n\n     Doc is at the console of his computer.  As words appear on\n     the screen, obviously in response to his query...\n\n     \"...would appear to indicate a virus of unknown origin...\"\n\n     Doc shakes his head disgustedly.\n\n                                DOC\n                                (to himself)\n                   No kidding?  \"A virus of\n                   unknown origin.\"  Come on and\n                   tell me something I don't know...\n                   like what's going on...\n\n     ON SCREEN\n\n     More words come up.  \"...no idea...\"\n\n                                DOC(cont'd)\n                                (typing, angrily)\n                   Then take a guess, goddamnit!\n\n     He finishes typing and waits for an answer.  The cursor\n     flashes the word \"PROCESSING\".  Then an answer comes up.\n     \"Genetic Alteration?\"  The words send a chill down Doc's\n     spine.\n\n     SWAMP ROOM - LATER\n\n     The mood is happy.  Like a high school football locker room\n     after a winning game.  DeJesus climbs out of his suit and\n     slaps Beck on the shoulder.\n\n                                DEJESUS\n                   Good work out there, Mr. Becky.\n\n     Beck, obviously pleased, looks at the others.  Jones sums up\n     the feelings of the entire group.\n\n                                JONES\n                   Thank you, sir.\n\n     Beck's grin suddenly disappears at the sight of a flashing\n     red light over the intercom.\n\n     INFIRMARY - LATER\n\n     Beck is standing in the doorway of the Infirmary, glaring at\n     Doc, who sits with his bottle of Old Granddad.\n\n                                BECK\n                   Dead?  This morning you said\n                   he had some skin disorder.\n\n                                DOC\n                   He did.\n\n                                BECK\n                   Well, how the hell does a\n                   skin rash kill you in eight\n                   hours?!\n\n     Doc looks at Beck wearily and hands him a mask.\n\n                                DOC\n                   Here.  Put this on.  You examine\n                   him.\n\n                                BECK\n                   I'm not a doctor.\n\n                                DOC\n                   For this...you don't need to be.\n\n     Beck hesitates, then puts on the mask.\n\n     SICK ROOM\n\n     As Beck enters, masked, Sixpack's back is to him under the\n     sheets.  Slowly he pulls back the sheet and recoils from the\n     sight.  The black splotches have nearly all grown together.\n     His fingers have lengthened and become more webbed.  Most\n     dramatically the sores on the sides of his neck have become\n     flared and elongated.  Though not bleeding, the open veins\n     are visible.\n\n     INFIRMARY\n\n     Doc pours some bourbon in a glass, and takes a sip.  Beck\n     enters dazed from the sick room and their eyes meet.\n\n                                BECK\n                   The mask is because you think\n                   it might be...catching?\n\n                                DOC\n                   I don't know.  I've been back\n                   and forth with Narragansett Naval\n                   all day, consulting with the best\n                   people in maritime medicine, the\n                   best people in viruses...\n\n                                BECK\n                                (impatiently)\n                   And?\n\n                                DOC\n                   And they didn't believe the\n                   symptoms I described...\n\n                                BECK\n                                (beat)\n                   Why Sixpack?\n\n                                DOC\n                   It could be a million things,\n                   something in the air, food....\n                                (he looks up and\n                                locks eyes with Beck)\n                   But he went on that ship and so\n                   did Williams...\n                                (beat)\n                   I want to examine the crew.\n\n                                BECK\n                                (still in shock)\n                   Yeah...right...\n\n     He starts to the door and Doc watches him.\n\n                                DOC\n                   I've reported the death to\n                   the company.\n\n     INT. THE MESS - SAME\n\n     The mess is quiet.  All eyes are down.  Sixpack's absence is\n     noticeable.\n\n                                JONES\n                   \"Routine,\" my ass!  Ain't nothin'\n                   \"routine\" about no physical check-\n                   up 10,000 feet down...especially\n                   when we're getting picked up the\n                   next day!\n\n                                COBB\n                   He didn't say it was a \"routine\n                   check-up,\" he said it was a \"routine\n                   precaution.\"\n\n                                WILLIE\n                   Must be bad.  Even sick\n                   Sixpack never missed a meal.\n\n                                DEJESUS\n                   It's this fucking air system....\n\n                                COBB\n                   Ain't the food or the\n                   air system, he's just sick...\n                   Everybody gets sick every\n                   now and then.  It's all\n                   part of being human!\n\n     Bowman suddenly becomes pale.\n\n                                BOWMAN\n                   Well, I must be human because\n                   I'm sure as hell sick.\n\n     She gets up from the table and dashes for the toilet.\n\n     INT. SHOWER ROOM - LATER\n\n     EXAMINATION SEQUENCE\n\n     CLOSE ON WHITE SKIN/(COBB)\n\n     Pale skin, fishbelly white with white hairs, seen closely...\n\n                                COBB'S VOICE(O.S.)\n                   I guess I'm kinda...outta shape...\n                                (a pause, no answer)\n                   This skin condition...what is it?\n                   Like herpes, or measles, or what?\n\n                                DOC'S VOICE(O.S.)\n                   It's difficult to describe.\n\n     Doc is scrutinizing Cobb's flabby body closely.  They're\n     alone in the shower room.  Stainless steel, and mirrors.  Doc\n     stops and checks a place on Cobb more closely.\n\n                                COBB\n                                (watching, nervous)\n                   Christ, it'd be a hell of a thing\n                   if I went back to the roof with\n                   some kind of herpes thing.  My\n                   wife wouldn't understand that at all...\n\n     Doc peers closely, satisfies himself that it's nothing.\n\n                                DOC\n                   You seem all right.\n\n                                COBS\n                                (relieved)\n                   She wouldn't understand.  She'd\n                   think I was down here fucking\n                   my head off.\n\n     DARK SKIN/ PORES  Black skin, seen very close, the pores\n     appearing like craters.\n\n     We're looking at Jones' naked body...rippling muscles.\n\n                                JONES\n                                (grumbling)\n                   This whole thing's unnecessary, Doc.\n                   Only \"skin problem\" I got is\n                   white people...\n                                (beat, suspiciously)\n                   How come you're wearing those\n                   gloves?\n\n     INT. SHOWER ROOM/ SMOOTH SKIN - LATER\n\n     Firm, lovely breasts, smooth skin...\n\n                                WILLIE'S VOICE(O.S.)\n                   This disease...do you know\n                   what causes it?\n\n     Doc turns Willie around and examines her firm naked\n     buttocks.\n\n                                DOC\n                   Not yet.  You got any ideas?\n\n                                WILLIE\n                                (suddenly)\n                   You don't think it was from going\n                   on that ship do you?\n\n                                DOC\n                   That's a possibility.  But if\n                   it was that simple why haven't\n                   the symptoms begun on you?\n\n     Doc turns away to let her dress.\n\n                                WILLIE\n                   You mean I'm okay?\n\n                                DOC\n                   You're fine.\n\n     SHOWER ROOM/ TAN SKIN\n\n     DeJesus' body is being examined...tan skin, wiry muscles\n     seen very close.  As we move along the skin, it seems every\n     moment as if the next instant will reveal a dread blemish...\n\n                                DEJESUS' VOICE(O.S.)\n                   What do you mean, \"a skin problem\"...\n                   your skin changes?\n\n     DeJesus, naked, with his back to us.  Doc examines him.\n\n                                DOC\n                   It blackens...becomes scaly.\n\n                                DEJESUS\n                                (joking)\n                   You mean like a fish?\n\n     DeJesus chuckles, but something about the thought stops Doc.\n\n                                DOC\n                                (almost to himself)\n                   Yes...like a fish...\n\n                                DEJESUS\n                                (smiles)\n                   I was just joking, Doc.\n\n     CONTROL ROOM - SAME\n\n     Beck sits in his chair reading the TRANSOCEAN OFFICERS\n     INSTRUCTIONAL MANUAL.\n\n     INSERT:  The chapter he's on says:  BODY DISPOSAL AT SEA.\n\n     The face of Martin stares back at us.\n\n                                MARTIN\n                   Well, according to Maritime law,\n                   you, as commander of the Shack\n                   have the authority to dispose of\n                   the body.  However, the company\n                   doesn't want you to do that.\n\n                                BECK\n                   What you don't understand is that\n                   my crew is in jeopardy.\n\n                                MARTIN\n                   But you don't have any proof\n                   at this point to assume that\n                   this disease is contagious, do\n                   you?\n\n                                BECK\n                   I'm not anxious to find out, either.\n\n                                MARTIN\n                   Beck, trust me.  If the company\n                   felt that you or your crew were\n                   in any danger we would authorize\n                   an immediate emergency pickup.\n                   We could be there in a few hours.\n\n                                BECK\n                   Do it.\n\n                                MARTIN\n                                (beat)\n                   Unfortunately.  We can't.\n\n     He picks up a sheet of computer paper.\n\n                                MARTIN(cont'd)\n                   There is a typhoon about 600\n                   miles off the coast of Baja.\n                   It's not coming your way but the\n                   Company doesn't want to lose\n                   you folks or an emergency ship\n                   should it veer your way.\n\n                                BECK\n                   What're you saying?  That we're\n                   not even going to be picked up\n                   tomorrow?\n\n                                MARTIN\n                   It shouldn't be a long delay.\n\n                                BECK\n                   But it's a delay!  How long?\n                   A day?  Two days?!\n\n                                MARTIN\n                   Twelve hours, no big deal.  We\n                   should know something first\n                   thing in the morning.  Don't\n                   worry.\n\n     WASHROOM - SAME\n\n     Willie enters the room with several sinks and a couple of\n     toilet stalls.  She approaches one of the sinks and pulls a\n     toothbrush from the pocket of her robe.\n\n                                WILLIE\n                   Bo?  Doc says you're next.\n\n     Just then she hears a retching sound from one of the stalls.\n\n                                WILLIE(cont'd)\n                   Bo?...You okay?\n\n     INFIRMARY - SAME\n\n     Willie and Jones help Bowman into the Infirmary.  She is\n     weak from nausea.  They help her onto the examination table\n     and look around for Doc.  Jones sees a light on in the Sick\n     Room.\n\n     SICK ROOK - SAME\n\n     Sixpack's body lies under a sheet in the Sick room.  The\n     door opens and Jones looks in, sees Sixpack but in the dim\n     light, doesn't realize the sheet covering him, covers the\n     body totally.  Jones smiles.\n\n                                JONES\n                                (whispers)\n                   Hey, Sixpack...Hey, my man...\n                   How you feeling?\n\n     There is no answer and Jones slowly approaches the body.\n\n                                JONES\n                   Hey, man, we made quota to-\n                   day.  No thanks to you, you\n                   dog, but we made it...Beck\n                   helped us...We just dropped\n                   Bowman off.  I hope what you've\n                   got ain't catching...\n\n     He is almost to the table and reaches out to touch Sixpack\n     when suddenly the body stirs.  Sixpack's foot moves slightly\n     under the sheet as if shifting in his sleep.  Jones stops.\n\n                                JONES(cont'd)\n                   Oh, man, sorry...you go back\n                   to sleep.\n\n     INFIRMARY - SAME\n\n     Jones returns to the examination room.  Bowman is now\n     undressed and under the blankets on the examination table.\n\n                                WILLIE\n                   Who were you talking to?\n\n                                JONES\n                   Sixpack...\n\n                                WILLIE\n                   How is he?\n\n                                JONES\n                   Sleeping.  No sign of Doc,\n                   though.  I'll check the\n                   control room.  You look\n                   in the shower room...\n\n     They leave Bowman GROANING on the examination table and head\n     back to the main corridor.  As they leave WE HOLD ON the\n     door to the sick room behind Bowman.\n\n     Bowman writhes on the examination table in pain.  Carefully\n     she climbs off the table and goes behind a partition to\n     throw up.\n\n     CLOSE ON BOWMAN\n\n     At the sink in the infirmary.  She rinses her face in the\n     sink and pulls back her hair, suddenly she stops and brings\n     her hands in front of her face.\n\n     INSERT HER HANDS.  Huge clumps of hair have come out in her\n     hands.  And then she sees her hands themselves.  Scaly.\n\n                                BOWMAN\n                   Oh, God...what's going on?\n\n     She turns and looks at the light on in the Sick Room.  Slowly\n     she goes to the door and enters.\n\n     SICK ROOM\n\n     Bowman approaches the body of Sixpack.\n\n                                BOWMAN\n                                (panicked)\n                   Sixpack...what's going on?\n\n     No answer.  She pulls back the sheet and gasps.\n\n     CONTROL ROOM - SAME\n\n     ON BECK AND DOC.\n\n                                DOC\n                                (panicky)\n                   You have to call them back.\n                   Explain that this is an emergency.\n\n     Jones enters.\n\n                                JONES\n                   Excuse me, sir...Bowman's\n                   sick.  She's downstairs in\n                   the infirmary.\n\n                                DOC\n                                (concerned)\n                   The infirmary?...\n\n                                JONES\n                   Yes sir, ain't that where we\n                   usually go when we're sick?\n\n                                DOC\n                   We're simply concerned about\n                   her...proximity to...\n\n                                BECK\n                                (to Jones)\n                   Sixpack's dead.\n\n     Jones looks from one officer to the other then grins.\n\n                                JONES\n                   Bullshit...I was just talking\n                   to him.  I saw him move.\n\n                                BECK\n                   What?...\n\n     LOWER RING CORRIDOR - SAME\n\n     Beck hits the floor off the ladder and rushes to the\n     Infirmary with Jones.  He opens the door and freezes.\n\n     WHAT HE SEES:  The examination table where Jones left her is\n     empty.  The room deserted.\n\n                                JONES\n                                (pointing to\n                                examination table)\n                   I left her here.\n\n     DOC comes up behind them, then turns.  He hears to a HISSING\n     SOUND down the ring corridor.  He turns from the others and\n     moves slowly toward the noise.\n\n     SHOWER ROOM\n\n     Doc enters the shower room, full of steam and the SOUND OF\n     WATER.\n\n                                DOC\n                   Bowman?\n\n     There is no answer and he moves toward the shower.\n\n                                DOC\n                   Bowman.  It's Doc.  I'm here\n                   to help you.\n\n     The water continues to run.  No answer.  Carefully, Doc\n     opens the shower door.\n\n     WHAT HE SEES:  Bowman.  Dead.  Her wrists have been cut and\n     blood swirls down the drain.\n\n     Doc sadly squats down beside her.  The death effects him\n     greatly.  He feels helpless, then suddenly his eyes widen\n     and he carefully reaches out and takes Bowman's limp arm,\n     turning it supine.  There, running the length of the arm, WE\n     SEE the black scales.\n\n     INFIRMARY\n\n     Jones and Beck lay Bowman's body carefully onto the\n     examination table in the infirmary.  Through the Sick Room\n     door we see the sheet shrouded body of Sixpack.  Doc covers\n     Bowman with a sheet as\n\n                                                      WE CUT TO\n\n     THE MESS - LATER\n\n     The remaining crew, Doc, and Beck assembled in the Mess.\n     Doc sits quietly, almost in a daze.\n\n                                BECK\n                   I can't tell you much about\n                   it, except that none of you\n                   show any symptoms.\n\n                                DEJESUS\n                   And it killed Bo?\n\n                                BECK\n                   No...she killed herself.\n\n     ON WILLIE  the news hits her hard.\n\n                                JONES\n                   We're getting out of here just\n                   in time.\n\n                                BECK\n                   There's now a problem with the\n                   weather for pickup.  There's a\n                   typhoon in our sector...\n                   ...We're going to be delayed\n                   twelve hours...\n\n                                DEJESUS\n                   Typhoon?!\n\n                                JONES\n                   Twelve hours!\n\n                                COBB\n                   At least we get time and\n                   a half.  That's in the contract.\n\n                                JONES\n                   Fuck double pay, man!  I\n                   want out of here!\n\n     Their argument is suddenly cut short by a NOISE from the\n     corridor.  A THUMP!  The crew stops their grumbling and\n     listens.  A moment later we hear another THUMP!  Beck looks\n     at Jones.\n\n                                BECK\n                                (motions for Jones\n                                to come with him)\n                   Jones...\n                                (to the others)\n                   Stay here.\n\n     RING CORRIDOR\n\n     Beck leads the way slowly toward the Infirmary where the\n     sound is coming from.  Outside the door they hear it once\n     more.  THUMP!\n\n     Carefully he enters the Infirmary and WE SEE the\n     examination table is empty!  Beck goes to the Sick room and\n     stops in the doorway.  Jones moves behind him and his eyes\n     suddenly widen.\n\n     WHAT THEY SEE:  Both bodies now are in a motionless, hideous\n     conglomeration on the the table.\n\n                                                  SLAM CUT TO\n\n     CLOSE ON HEAVY ZIPPER\n\n     ZZZZZZZZZZZZZZ.  It is quickly pulled shut, running the\n     length of a heavy plastic bag, closing both bodies inside.\n\n     INT. CORRIDOR \"B\" - LATER\n\n     Dressed in their rubber latex suits Cobb, Jones, DeJesus,\n     Beck, and Willie carry the body of Sixpack and Bowman in the\n     zippered bodybag.  Now, well over three hundred pounds, the\n     bodies strange shape and dead weight make it difficult to\n     transport.\n\n                                DEJESUS\n                   C'mon, Cobb...you're slacking...\n\n                                COBB\n                                (angrily)\n                   I ain't, goddamnit...It's\n                   Jones!..\n\n     Before Jones can argue, Beck cuts them off.\n\n                                BECK\n                   Shut up, all of you.\n\n                                COBB\n                   Mr. Beck, the contract states that\n                   no body can be disposed of without\n                   authorization of---\n\n                                JONES\n                   Fuck the contract, man!\n\n     The group turns into the Swamp where Doc waits for them by\n     the Lift Lock.  Rounding the corner Cobb bangs into the side\n     of a bulkhead and drops his corner of the \"package.\"  Like\n     dominoes, Willie also looses her grip, then DeJesus.  The\n     bodybag splashes into the grimy bilge water making it even\n     harder for everyone to get a handhold.\n\n                                BECK(cont'd)\n                   C'mon...Lift!\n\n     The group struggles to raise the bodybag and just get it to\n     their shoulder when suddenly we go tight on DeJesus's face.\n\n                                DEJESUS\n                   Hey!...I feel something.\n                   It's moving!  He's alive!\n\n                                COBB\n                   I feel it, too...Someone's trying\n                   to get out.\n\n     Cobb drops his end intentionally and he kneels looking for\n     the zipper.\n\n                                JONES\n                   Cobb, what're you doing!\n\n                                COBS\n                   But he ain't dead!  He ain't\n                   dead.\n\n                                BECK\n                   Cobb!  Stop!\n\n     But Cobb grabs the zipper and starts to unzip the heavy bag.\n     Beck tries to stop him when suddenly, WHAM!  a DARK\n     APPENDAGE RIPS through the zipper and flails like a\n     pressurized firehose.  It beats wildly for several second,\n     then lashes out at Cobb--ripping a gash on his forearm.\n\n     While Cobb screams in pain, Beck yanks the appendage off\n     Cobb's arm revealing a mouth full of needlesharp teeth and a\n     sharp tongue-like proboscis which has stabbed Cobb like a\n     dagger.\n\n                                COBB\n                   It bit me!  It bit me!\n\n     While Beck and Willie wrestle the strong flopping appendage,\n     Doc rushes to the Lift Lock.\n\n     DeJesus and Jones struggle to force the lurching bodybag\n     into the Lift Lock.\n\n                                JONES\n                   Push Hazy!\n\n     The bodybag shudders like a huge cocoon about to lose its\n     occupant.  Jones digs his shoulder down into the task just\n     as the bag suddenly RIPS in several places.  A tear RIPS\n     OPEN next to Jones' head revealing the head of BOWMAN, her\n     vacant eyes only inches from Jones' face.\n\n                                JONES\n                   Oh, Jesus Christ!  I ain't\n                   never gonna sleep again!\n\n     Suddenly a WHINING NOISE sounds behind them.  Beck looks\n     back to see Cobb approaching with a battery operated\n     underwater chain saw.  He's clearly intending to cut the\n     Creature with the whirring blade.\n\n                                BECK\n                   No!\n\n                                COBB\n                   It bit me!\n\n                                DEJESUS\n                   It's Sixpack!\n\n                                COBB\n                   I'm going to kill it!\n\n     DeJesus turns to block Cobb while the others continue to\n     wrestle the bodybag into the Lift Lock.  The bag suddenly\n     splits and a scaly arm protrudes.  It reaches out grabbing\n     DeJesus.  Beck pulls him free and yells.\n\n                                BECK\n                   Close the Lock!  Now!\n\n     Doc hits the lever.  The elevator doesn't move!\n\n     RRRRRRIIIIIPPP!  A scaly leg rips out of the body bag!\n\n                                BECK(cont'd)\n                   Hit it again!\n\n     Doc hits the elevator switch again, harder.\n\n     NNNNNNN!  The Lift Lock door whines closed and a horrifying\n     SCREAM rises from the Lock.\n\n     CLOSE ON THE LIFT LOCK\n\n     The end of the appendage is severed in the closing door,\n     disappearing unseen into the greasy bilge water.\n\n                                BECK(cont'd)\n                   Flush it!\n\n     Doc flips a switch and the SCREAM OF THE VACUUM PUMPS drown\n     out the SCREAM in the Lift Lock, the wails of Cobb, and the\n     splashing sounds of the severed three-foot section of gory\n     muscle which slip silently and undetected under the\n     workbench.\n\n     A second later the elevator returns empty, silent,\n     bloodstained.\n\n     Beck turns on the video monitor of the exterior Lock.  The\n     exterior worklights illuminate millions of bubbles from the\n     flush and the struggling movements of the bodybag before it\n     grows still once again and disappears beyond the range of\n     the Shack lights...into the darkness.\n\n     Beck turns and looks at his savaged crew.  Willie, Jones,\n     DeJesus, Doc look like wet-suited butchers.  Splattered in\n     blood, numbed by the experience, they are brought together\n     by having simply survived.  Jones holds up Willie.  DeJesus\n     leans against the bulkhead.  In the far corner Cobb sobs\n     quietly.\n\n     SHOWERS - LATER\n\n     Clouds of steam.  Vaguely seen through the steam, Willie is\n     scrubbing herself almost desperately, as though the\n     spattered blood of the creature had penetrated into her\n     skin.  Finally she gives up almost in tears and rests her\n     head against the wall of the shower stall.\n\n     DORMITORY - SAME\n\n     Beck and Jones open the privacy door to Sixpack's bunk.\n     After some digging which produces five month's supply of\n     pornography, the empty flask clatters to the floor.  Beck\n     picks it up.\n\n                                BECK\n                   I think we just found our\n                   problem.\n\n     MESS - LATER\n\n     Cobb pours himself a cup of coffee with a shaky hand.  Jones,\n     and DeJesus sit at a table and Willie laces up her shoes for\n     a run.  There is a feeling of anger among them.\n\n                                DEJESUS\n                   Serves his ass right to get\n                   it.  Motherfucker brings that\n                   shit onboard.  I hope his\n                   fucking ass rots in the sea and\n                   is shit upon by the fish.\n\n                                JONES\n                   'Fucker could have gotten us\n                   all killed.\n\n                                COBB\n                   He knew better than that.\n\n     Willie finishes tying up her shoes and looks at them all\n     coldly.\n\n                                WILLIE\n                   You guys sure weren't so holy\n                   when you were shooting that\n                   vodka...It could have been you.\n\n     She gets up and walks out into the Ring corridor.\n\n     THE RUSSIAN SHIP\n\n     WE ARE MOVING along the ship's corridor that Willie walked\n     looking for Sixpack.\n\n     WE PULL BACK TO REVEAL WE ARE WATCHING A VIDEO SCREEN IN THE\n     CONTROL ROOM\n\n     Doc and Beck replay the tape of Willie's search for Sixpack\n     on the Russian ship.  On the monitor screen we see Willie's\n     POV of the infirmary.  The light dances off the broken glass\n     as she turns, then the flash of white we saw before as the\n     light moves out into the corridor.\n\n                                DOC\n                   Hold it!  Rewind it.\n\n     Beck rewinds it.\n\n     ON SCREEN  we see the scene again.  Light dancing off the\n     cabinets.  As the light starts to turn--\n\n                                DOC\n                   Stop it.\n\n     Beck pauses the tape.  We see nothing. Doc is confused.\n\n                                DOC\n                   Back it up slowly.\n\n     Beck does and we watch Doc's face as he stares intently at\n     the screen.  Suddenly he sees it.\n\n                                DOC\n                   There.\n\n     ON SCREEN  We see it.  Caught in the turn of the camera, now\n     frozen on the screen is the clear gleaming skeletal remains\n     of a man.  Only it is clear that this is no ordinary man.\n     Fingers and appendages are lengthened and broader than\n     normal.  But it is the large head and long sharp teeth that\n     especially catches our attention.\n\n     MESS - SAME\n\n     ON A BEAUTIFUL BAVARIAN SETTING\n\n     as a hand suddenly moves into frame and we see the scene is\n     actually one of DeJesus' jigsaw puzzles.  He takes a piece\n     of blue sky from the hundreds of pieces on the table and\n     places it perfectly into position on the puzzle.  Jones\n     watches him amazed.\n\n                                DEJESUS\n                   You know that Innsbruck\n                   has 64 square miles of ski\n                   slopes, man?  Think about that.\n                   Sixty-four square miles.\n\n     He picks up another piece of blue sky and effortlessly fits\n     it into place as Jones watches.  It's blowing Jones' mind.\n\n                                JONES\n                   How'd you do that?\n\n                                DEJESUS\n                   What?  That?...I've done this\n                   one before.  You hungry?  I'm\n                   hungry.\n\n     He gets up to go into the mess and Jones looks at him in\n     amazement.\n\n                                JONES\n                   Hungry?  After what we just\n                   went through I may never\n                   eat again.\n\n     ON WILLIE\n\n     She jogs down the corridors toward the Swamp.  The Shack\n     CREAKS and Willie looks down through the grating passing\n     below her feet.  It is dark down there.  Her feet pound off\n     the metal grating.\n\n     LOW ANGLE  We watch Willie from below as she jogs past.  THEN\n     WE TILT DOWN to the dark, still water of the bilge.  Suddenly\n     something stirs in the water--a ripple like a trout in a\n     stream.\n\n     CONTROL ROOM - SAME\n\n     Using a computer plotting program to measure the dimensions\n     of the skull on the videotape, Doc enters these measurements\n     as they are read off to him by Beck.  As each of the\n     measurements go into the computer an image of a skull begins\n     to appear on the computer screen, followed by a name:\n     DANAKIL MAN.\n\n                                BECK\n                   They found this?\n\n                                DOC\n                   No.  I think they isolated\n                   him in genetic engineering.\n                   Homo aquaticus...\n\n                                BECK\n                   Was there such a thing?\n\n                                DOC\n                   Danakil man?...one of our\n                   ancestors.  Named for the\n                   Danakil Alps in Ethiopia.\n\n                                BECK\n                   Not exactly a big ocean\n                   country.\n\n                                DOC\n                   It was when it counted a couple\n                   of million years ago when the\n                   seas came in and drove us into\n                   the water.  Most homo sapiens\n                   didn't make it...Danakil man...\n                   adapted.\n\n     ON WILLIE\n\n     running.  She jogs past the machine room.  Looking in, the\n     machines seem alive, pulsing, the beating heart of the\n     Shack.  There is something else though.  We feel something\n     in there watching her.\n\n     CONTROL ROOM\n\n     On Doc.\n\n                                DOC\n                   Some say that's why we're\n                   basically hairless, for less\n                   water resistance, faster swimming\n                   speeds...\n\n                                BECK\n                   But what about those scales...\n                   or that leech-like thing that\n                   bit Cobb?\n\n                                DOC\n                   Why stop with just one aspect\n                   of marine life?  Why not incorporate\n                   the best genetic components the\n                   ocean has to offer?...\n\n                                BECK\n                                (pointing to screen)\n                   Well, if they were perfecting an\n                   aquaman, then why's there a dead\n                   one onboard that Russian ship?  Why\n                   isn't he out swimming around?\n\n     Doc looks up at the image on the screen.  The huge skull\n     stares back hauntingly.\n\n                                DOC\n                                (beat)\n                   He obviously lacked something\n                   in his environment.\n\n     DORMITORY - SAME\n\n     ON COBB  He sits on his bunk and peers under his bandage.\n     He turns on an overhead reading light and looks again.\n     Suddenly a voice startles him.\n\n                                JONES' VOICE\n                   Turned black yet?\n\n     At first startled, Cobb recovers and answers sharply.\n\n                                COBS\n                   That ain't funny.\n\n                                JONES\n                   Relax, Cobb.  If it was\n                   going to turn, it would have\n                   done its trick by now.\n\n                                COBB\n                   That's easy for you to say.\n                   You ain't the one that got bit.\n\n     Jones starts to leave when he suddenly notices something on\n     Cobb's bunk.  He picks it up and we see a photo of Cobb's\n     family.\n\n                                JONES\n                   Don't tell me you're getting\n                   soft on us, Cobbie?  You're\n                   the fellow who always said--\n\n     Cobb snatches the photo back from Jones and glares at him\n     with the same old, hard \"Cobb look.\"\n\n                                COBB\n                   Nothing's changed, goddamnit!\n\n     Jones leaves, and Cobb waits till he is gone then looks back\n     at his photo.  His look changes, softening.  Absently he\n     scratches his bandage.\n\n     SWAMP\n\n     Willie enters and checks her running time on her watch.  She\n     bends over to catch her breath then straightens suddenly.\n\n     OVERHEAD SHOT\n\n     WE are watching her from above.  For a moment she is quiet\n     as if listening for a noise somewhere in the Swamp.  She\n     looks around slowly and her eyes come to rest on the\n     Workbench.\n\n     MESS - SAME\n\n     DeJesus looking for food.  In the gloom of fluorescent\n     lighting he opens and closes various cabinets looking for a\n     snack.\n\n     He notices that the floor's wet near the sink.  He frowns\n     and hears a SMALL NOISE, like something shifting slightly.\n     He moves to investigate, crouching low, peeking into the\n     shadows under the sink, into a litter of cleanser bottles,\n     pails, rags...All he can see are shadows.  He looks more\n     closely, actually sticking his head under the sink when\n\n     SUDDENLY SOMETHING TOUCHES HIS SHOULDER FROM BEHIND!  DEJESUS\n     JUMPS, BUMPING HIS HEAD ON THE SINK AS HE WHIRLS TO SEE.\n\n     JONES, looming over his shoulder, looking down at him.\n\n                                JONES\n                   Man, everybody is jumpy...\n                   What are you doing?\n\n     Not fully recovered from the start, DeJesus rubs his bruised\n     head.\n\n                                DEJESUS\n                   Getting some food.\n\n                                JONES\n                   Under there?\n\n     DeJesus gets to his feet, points at the water under the\n     sink.\n\n                                DEJESUS\n                   Look.  Water.\n\n                                JONES\n                   Probably the plumbing.  You\n                   gonna make me finish that puzzle\n                   by myself, or what?\n\n     DeJesus continues to scrutinize the water then looks back at\n     Jones.\n\n                                DEJESUS\n                   No, I'll be right there.\n\n     He looks down at his sandwich as Jones starts out of the\n     galley.  Something is missing.\n\n                                DEJESUS\n                                (to himself)\n                   Mustard.  Need mustard...\n\n     He opens the refrigerator and finds the mustard jar empty.\n\n                                DEJESUS\n                                (muttering to himself)\n                   Sixpack...\n\n     He throws the jar in the trash then opens the cabinet next\n     to the refrigerator for a new jar, and reaches inside.\n\n     SUDDENLY, LIKE A SNAKE, A TWO FOOT CHUNK OF MUSCLE ATTACHES\n     TO DEJESUS'S WRIST!  WITH HIS FREE HAND DEJESUS TRIES TO RIP\n     THE TWISTING, WRITHING THING OFF.  PULLING AT IT HE REVEALS\n     PART OF SIXPACK'S FACE--ONE EYE AND PART OF HIS\n     MOUTH--UNDERNEATH THE SURFACE.\n\n     DeJesus falls against the side cabinets screaming and\n     causing an avalanche of pots and pans.\n\n                                DEJESUS\n                                (in pain)\n                   Ahhh!\n\n     INSIDE THE MESS\n\n     Jones is now putting a piece of the puzzle into place when\n     he hears THE CLATTER OF POTS AND PANS.\n\n                                JONES\n                   Hey, Hazy...what're you doing\n                   now...cooking?\n\n     There is no answer and Jones looks up.\n\n                                JONES(cont'd)\n                                (concerned)\n                   Hazy?...\n\n     He goes to the door and looks in.  His eyes widen at the\n     sight of DeJesus staggering toward him with the squeezing\n     hunk of muscle.\n\n                                JONES(cont'd)\n                   Holy shit!\n\n                                DEJESUS\n                   Help me, Jonesy.  Oh, God,\n                   help me!  It's getting inside\n                   me, I can feel it!\n\n     He keeps coming at Jones who backs away slowly from his\n     friend.\n\n                                JONES\n                   Hazy, please...I'm going to\n                   get you some help, man...just\n                   don't touch me...\n\n     Jones finds himself backing away until he is by the door to\n     the Galley.  He closes it, rushing through into the Mess to\n     the Ring corridor where he runs into Cobb.\n\n                                COBB\n                   What's going on?\n\n                                JONES\n                   It's Hazy...It's got him!\n                   Stay here and don't let him\n                   out.  I'm going to get the Doc.\n\n     Jones runs out and leaves Cobb by the door.  Cobb watches\n     him go.  As the noise in the Mess intensifies, we hear\n     banging on the door, then DeJesus' anguished cries.\n\n                                DEJESUS\n                   Help me!  Help me!\n\n     Cobb backs slowly down the corridor toward the dorm.\n\n     UPPER RING CORRIDOR - SAME\n\n     Jones meets Beck and Doc leaving the control room.\n\n                                JONES\n                   It's got Hazy!\n\n                                BECK\n                   What has?\n\n                                JONES\n                   One of those chunks of\n                   Sixpack!  Like a big leech,\n                   with those teeth!...\n\n                                DOC\n                   We've got to get him to the\n                   infirmary.\n\n                                JONES\n                   What are you going to do to\n                   him?\n\n                                DOC\n                   I'm going to try to remove it.\n\n                                JONES\n                   I've got Cobbie downstairs\n                   watching the door.\n\n     INT. LOWER RING CORRIDOR - SAME\n\n     Deserted.  There is no sign of Cobb and the door to the mess\n     stands open.  The mess is empty.  Beck is the first one down\n     the ladder followed by Jones.\n\n                                JONES\n                   Cobb?  Hazy?  Oh, shit...He's\n                   gone...\n\n     Cobb returns with a mining tool.\n\n                                JONES\n                   You let him get away!\n\n                                COBB\n                   I ain't doing nothing for that\n                   thing without something to\n                   defend myself.\n\n                                JONES\n                   That thing happens to be\n                   my friend.\n\n                                BECK\n                   Shut up, both of you!  We've\n                   got to find it.\n\n     Beck suddenly looks around noticing something.\n\n                                BECK(cont'd)\n                   Where's Willie?\n\n                                COBB\n                   Oh, God, she's out there...\n\n                                BECK\n                   Jones...come with me.  Cobb,\n                   you and Doc check the rooms.\n\n     INT. THE LOWER \"B\" CORRIDOR - SAME\n\n     Jones and Beck move down the spooky corridor toward the\n     Swamp.  Overhead, water moves through the desalinization\n     conduit.  Jones eyes it warily.\n\n     SWAMP\n\n     They enter the quiet Swamp.  The suits hang silently like\n     sleeping monsters.  Beck steps into the equipment room.\n\n     Jones walks along the suits which hang in front of him.\n     Their empty masks stare at him hauntingly.  He reaches the\n     end and stands in front of the ladder where we earlier saw\n     Willie doing chin-ups.  He looks down and sees her headband\n     floating in the bilgewater.\n\n                                JONES\n                   Willie...\n\n     Suddenly Willie lowers herself from the bar behind him.\n\n                                WILLIE\n                   Yeah?\n\n     The sudden sight of her nearly gives Jones heart failure, he\n     stumbles backwards into the ankle deep water and Willie\n     drops from the bar laughing.\n\n                                WILLIE\n                                (grinning)\n                   What on earth's the matter\n                   with you?\n\n                                JONES\n                   I ought to smack your face!\n\n     Willie picks up the strain in Jones' voice, her smile fades.\n\n                                WILLIE\n                   What's wrong?\n\n                                JONES\n                   DeJesus...It's got him.\n\n     THE EQUIPMENT ROOM - SAME\n\n     Jones, Willie and Beck move quickly.  Beck pulls a portable\n     laser drill which fits into the arm of the mechanical suits\n     and attaches a portable power unit to the back.  Turning it\n     on it becomes a sinister close-range weapon.\n\n     Willie opens an equipment cabinet and reveals deflated\n     container transporters.  Beck notices and then looks up at\n     Jones who opens a locked cabinet and takes out the bicycle\n     pump/earthquake device we saw Willie use earlier.\n\n                                BECK\n                   I thought they were your friends?\n\n                                JONES\n                   Were, Doss were.\n\n     Beck reaches out and takes the powerful weapon away from\n     him.\n\n                                BECK\n                   You fire that in here and\n                   you'll bring the whole place\n                   down.\n\n     Jones thinks about it for a moment, then reaches for one of\n     the Acetylene tanks.  He lights the end of it and a long\n     blue tongue of flame whips out the door into the Swamp.\n     Jones grins.\n\n     INFIRMARY - SAME\n\n     Doc and Cobb move into the Infirmary.  Doc goes into his\n     office.  He takes three scalpels out of an equipment drawer\n     and then looks up, through the levolor blinds into the\n     infirmary.  What he sees upsets him.\n\n     INT. SWAMP - SAME\n\n     Jones working the intercom.\n\n                                JONES\n                                (to intercom)\n                   Jones to Doc.  Doc?...Cobb?\n\n     He looks back to Beck, concerned.\n\n                                JONES(cont'd)\n                                (to Beck)\n                   Think it got 'em?\n\n                                BECK\n                   No, it's not going through.\n                   The intercom's busted.  I thought\n                   DeJesus fixed that?\n\n                                JONES\n                                (beat, realizing)\n                   He did.\n\n     INFIRMARY - SAME\n\n     Doc leaves his office and slowly goes into the Infirmary to\n     the storage counter across the room--where the blood is\n     stored.  WE SEE what disturbed him...the door to the\n     refrigeration unit is ajar.  Doc opens the door to the\n     cabinet.  The plastic bags are now empty.  Each one has been\n     drained.\n\n     LOWER RING CORRIDOR - SAME\n\n     Cobb moves out of the Infirmary, carefully down the eerie\n     corridor, his mining tool in front of him for security.\n     There is a sinister feel to the place.  Each step only\n     reveals a little bit of space ahead of him.  Suddenly he\n     stops.  In front of him across the hall a cabinet which\n     says:  ONBOARD COMMUNICATIONS, is torn open.  It is where\n     DeJesus fixed the intercom the day before.\n\n     CLOSE ON THE CABINET\n\n     The door is shattered.  Carefully, Cobb opens the door and\n     WE SEE the guts of the wiring have been torn out--the entire\n     system has been disabled.\n\n     Cobb carefully examines the damage WHEN SUDDENLY A SCALY\n     HAND-LIKE APPENDAGE slams into the cabinet door trapping\n     COBB and sending his weapon to the floor.  Cobb turns\n     directly into\n\n     THE LEECH-LIKE MOUTH!  It's sharp teeth shine in the light,\n     poised to strike.\n\n     Cobb's eyes closed, screams like a maniac, waiting for the\n     tentacle to attack.  Then suddenly an UNGODLY SCREAM echoes\n     in the corridor.\n\n     COBB opens his eyes to see the tentacle gone.  Doc is\n     holding the smoking mining drill, his eyes glazed, as if he\n     has seen the devil itself.\n\n                                COBB\n                   What happened?\n\n                                DOC\n                                (absently)\n                   It...almost got you.\n\n                                COBB\n                   What was it?\n\n     Doc shakes his head dumbly.  He is in total shock.\n\n     THE MESS\n\n     The remaining group is assembled around the table.  Jones\n     watches the door with one of the homemade flamethrowers.  He\n     listens.\n\n                                COBS\n                                (excitedly)\n                   I saw it!  It's big!\n\n                                BECK\n                   Big?\n\n                                JONES\n                   Bigger than DeJesus?  How?\n\n                                DOC\n                   It's had a meal.\n\n     He holds out the empty blood bags.  A change has come over\n     Doc since Bowman's death.  The experience has slightly\n     deadened him.\n\n                                WILLIE\n                   It needs blood?\n\n                                JONES\n                   Fucking great...You telling\n                   me we got a fucking dracula\n                   in here with us?\n\n                                DOC\n                   It would explain the suction-\n                   like appendages.\n\n                                JONES\n                   Like a leech.\n\n                                BECK\n                   That's why there's a dead one\n                   on the ship.  It ran out of blood.\n\n                                JONES\n                   What dead one on the ship?\n\n     He looks from Doc to Beck.\n\n                                JONES(cont'd)\n                                (sharply)\n                   Someone want to let the rank\n                   and file in on your little\n                   secret?\n\n     Doc looks at Beck, then Jones.\n\n                                DOC\n                   The monster appears to be\n                   a genetic aberration...\n\n                                JONES\n                   No fuckin' lie...\n\n                                DOC\n                   ...It has many traits of deep\n                   sea marine life...regeneration,\n                   scales, gills, even a period\n                   of dormancy...\n                                (more to Beck)\n                   but the fact that it remembered\n                   where the plasma was stored, or\n                   where the communication wiring was,\n                   may imply that it has some other\n                   quality...\n\n                                COBB\n                                (panicky)\n                   What?...What?\n\n     Beck locks eyes with Doc.\n\n                                BECK\n                                (to Doc)\n                   That it acquires intelligence\n                   from its victims?\n\n                                DOC\n                   Intelligence may not be the right\n                   word...\n\n                                JONES\n                   Fuck semantics, Doc!\n                   You saying its like part\n                   DeJesus, part Sixpack, part\n                   Bowman?!\n\n                                DOC\n                                (tiredly)\n                   I don't know.  I'm guessing.\n\n                                COBB\n                                (losing it)\n                   I say we should go get in the\n                   escape bubbles and get the hell\n                   out of here!\n\n                                JONES\n                   And hit the surface in the\n                   middle of a typhoon?...No, thank you.\n                   I'll take my chance down here.\n\n     Willie looks at Beck.\n\n                                WILLIE\n                   What can we do?\n\n                                BECK\n                   Our only chance is to lure\n                   it to the Swamp and flush it\n                   like we did the other.\n\n                                COBB\n                   And how're we going to do that?\n\n     Beck checks his flamethrower and looks at Jones.\n\n                                                     TIME CUT TO\n\n     THE MESS - LATER\n\n     ON BECK  He flexes his arm as a needle is taken from it.  WE\n     SEE a half-pint of blood in a bag, held by Doc.  He secures\n     it and hands it back to Beck.\n\n                                DOC\n                   Be careful with it.\n\n                                BECK\n                   Don't worry, I don't want to\n                   give up any more.\n\n     He looks over at Jones who watches the door.  Jones looks\n     back and nods.  The coast is clear.\n\n     LOWER RING CORRIDOR - SAME\n\n     The door to the Mess opens and Beck slips into the shadows\n     of the hall.  A second later Jones follows.  In the dim\n     light they begin moving toward the Lower \"B\" corridor to the\n     Swamp.\n\n     MESS - SAME\n\n     Cobb, Doc and Willie alone in the Mess.  Cobb scratches his\n     bandage.  Doc notices.\n\n                                DOC\n                   Still bothering you?\n\n                                COBB\n                   Itches like hell.\n\n                                DOC\n                   Take it off and let me have\n                   a look.\n\n     Cobb pulls back the bandage and looks at the gash.\n\n     INSERT COBB'S WOUND  Pink and healing.\n\n                                DOC\n                   Looks good to me.  I'll re-bandage\n                   it, though.\n\n     He looks at Willie.\n\n                                DOC(cont'd)\n                   Willie, would you clean it\n                   for me.  I'm going to the\n                   infirmary for supplies.\n\n     He turns and Willie stops him with a firm grip.\n\n                                WILLIE\n                   You can't go out there alone.\n\n                                DOC\n                   I'm the Doctor.  I have to\n                   do what's best for this crew.\n                                (he pulls away)\n                   I need my bag.\n\n     THE LOWER RING CORRIDOR - SAME\n\n     The door opens and carefully Doc steps out into the\n     corridor.  He looks toward the Infirmary then starts up the\n     ladder to the Upper Level instead.\n\n     CLOSE ON DROPS OF BLOOD INTO A SMALL POOL\n\n     a grisly sight.\n\n     WE PULL BACK TO REVEAL the drops coming from the plasma bag\n     of Beck's blood.  Beck stops the drip and moves on into the\n     darkness of the corridor.\n\n     CONTROL ROOM\n\n     Doc moves behind the computer keyboard in the dim light of\n     the Control room.  His face lit by the computer monitor.  He\n     types furiously.\n\n     COMPUTER SCREEN\n\n     \"Emergency Escape Bubbles...ready for activation...\"\n\n     DOC pauses looking at the message, then moves his hand to\n     the SEND command and presses it.\n\n     THE MESS - LATER\n\n     Willie prepares a clean bandage as Doc examines the cut.  He\n     smiles at Cobb like a friendly country doctor.  The tired look\n     now gone from his eyes.  He seems revitalized.\n\n                                DOC\n                   There, good as new.  Just\n                   keep your paws off of it.\n                                (to Willie)\n                   Do you have the new bandage ready?\n\n     She nods.  Doc turns back to the sink and Cobb holds out his\n     arm to let Willie put the new bandage on.  As Cobb's arm\n     comes up we suddenly notice a slight movement under his\n     shirt.  Willie stops just before applying the bandage.  The\n     movement intensifies--like snakes moving wildly beneath the\n     cloth.  Cobb whitens...breaks out in a sweat.  Willie backs\n     off.\n\n                                WILLIE\n                   Doc?...Doc!\n\n     She steps back and Doc moves into her place as suddenly a\n     leech-mouthed tentacle erupts from Cobb's waist.  It's razor\n     sharp proboscis punctures Doc's chest right at the heart and\n     the leach mouth with it's hundreds of teeth attaches with\n     vacuum-like suction.\n\n                                DOC\n                   No!\n\n     But it is too late.  Willie falls back screaming as Cobb's\n     gash RRRRRRRIPS OPEN!  THE FLESH OPENING GROTESQUELY FROM\n     THE INSIDE AND INVERTS SCALY--SPREADING OVER COBB'S BODY\n     LIKE A BUSHFIRE!\n\n     CORRIDOR \"B\"\n\n     CLOSE ON THE POOL OF BLOOD\n\n     A huge shadow falls over the pool left by Beck.  A scaly\n     tentacle suddenly whips across the floor.  The DEJESUS\n     CREATURE!  WE SEE THE FLASH OF ITS APPENDAGES.  IT'S HEAD.\n     AN EYE OPENS AND LOOKS UP.\n\n     WHAT IT SEES  The outline of Beck lying \"hurt\" fifty feet\n     away.\n\n     It starts down the corridor toward it's prey--Beck.\n\n     ON BECK\n\n     A little behind him with the homemade flamethrower, Jones\n     waits in the shadows.  Suddenly Beck hears something.\n\n                                BECK\n                                (whispers)\n                   I hear something. Don't fire\n                   until we're both in the Swamp.\n\n     Jones moves a little farther back.\n\n                                BECK(cont'd)\n                   Don't let him see you.\n\n                                JONES\n                   Don't worry...\n\n     As the Creature approaches WE SEE Beck stand up like a\n     wounded animal.  He begins dragging his \"injured\" leg behind\n     him as he retreats toward the Swamp.  THE FOOTSTEPS MOVE\n     FASTER.  IT'S CLOSING!\n\n     INT. RING CORRIDOR - SAME\n\n     ON WILLIE  She bursts out the door to the MESS and heads\n     toward Corridor \"B.\"\n\n     DOOR TO THE SWAMP\n\n     Beck moves through the door to the Swamp and positions\n     himself by the door.  He looks back and WE SEE Jones for the\n     first time, flamethrower poised, ready to fire.\n\n                                JONES\n                   C'mon baby c'mon...\n\n     ON THE SHADOW OF THE CREATURE\n\n     It moves steadily toward the door, moving right to the\n     doorway.  Carefully it moves a dark, horrible hand-like\n     appendage inside the doorframe.\n\n     ON BECK AND JONES\n\n     poised to kill when suddenly both men hear the same thing.\n\n                                WILLIE'S VOICE(O.S.)\n                   Beck?  Jones!?\n\n     ON WILLIE\n\n     She turns the corner and freezes.  There, less than ten feet\n     away is the Creature.  A tentacle whips excitedly like a\n     tail!\n\n                                WILLIE\n                   Oh God...\n\n     AS THE CREATURE starts to turn for Willie, Beck suddenly\n     closes the vault-like door to the swamp on Creature's hand,\n     trapping it vise-like in the door.\n\n                                BECK\n                   Run Willie!  Run!\n\n     The Creature throws back its head and SCREAMS in pain as the\n     heavy door severs its appendage.\n\n     ON BECK AND JONES\n\n     As the writhing hand-like appendage squirms in front of them\n     Jones blasts it with his flamethrower until the hand curls\n     like a piece of bacon and it ceases to move.\n\n                                JONES\n                   Well done.  Just like\n                   momma makes 'em.\n\n     Beck opens the door--the corridor is empty.  Willie and the\n     creature are gone.\n\n     ON WILLIE RUNNING\n\n     She heads back toward the Ring corridor around the inner\n     path toward Corridor \"A\".  In a full run now, every panel\n     and instrument looks even more sinister--where is Cobb/Doc\n     CREATURE?---\n\n     ON THE DEJESUS CREATURE'S SEVERED APPENDAGE\n\n     As the Creature moves after Willie we see its bloody stump\n     suddenly sprout a new appendage!  Like a starfish it grows\n     another leech like tentacle to replace the one it lost.\n\n     ON WILLIE\n\n     She turns down Corridor \"A\".  A NOISE overhead in the water\n     conduit causes her to look up WHEN SUDDENLY A BLACK ARM\n     REACHES OUT FROM THE SHADOWS, AND PULLS HER INTO THE DARK\n     DOORWAY TO THE MACHINE FLOOR----IT IS JONES!  He pulls her\n     between him and Beck in the shadows.\n\n                                BECK\n                                (whispered)\n                   Where's Cobb and Doc?\n\n                                WILLIE\n                                (recovering)\n                   Cobb's cut...It was in him!\n                   It got Doc...\n\n                                JONES\n                   Oh man, that's just great...\n\n                                BECK\n                   C'mon.\n\n     CONTROL ROOM\n\n     Beck is followed inside by Jones and Willie.  It is empty.\n\n                                BECK\n                   Lock the door.\n\n     Jones rolls the large vault-like door closed and locks them.\n     Beck goes to the console and checks the instruments.\n     Suddenly he sees something that causes him to freeze in his\n     tracks.  A red light blinks ominously on the console.\n\n                                BECK\n                   Shit!  He sent them all.\n\n                                WILLIE\n                   The escape bubbles?\n\n     She and Jones stop in front of Doc's console.\n\n                                JONES\n                                (gravely)\n                   Look at this.\n\n     Beck looks at Doc's computer screen.\n\n     ON SCREEN WE SEE DOC'S MESSAGE:  \"...hope that our sacrifice\n     will mean that the human race will never know this awful\n     mutation...\"\n\n                                WILLIE\n                   What is it?\n\n                                JONES\n                   The good doctor signed our\n                   death warrant.\n\n     SUDDENLY THERE IS A TREMENDOUS BANGING ON THE DOOR!  LIKE A\n     HUNDRED SLEDGEHAMMERS POUNDING THE HEAVY STEEL DOOR TRYING\n     TO BREAK IT DOWN.  Jones readies his weapon but just as\n     suddenly, the BANGING STOPS.  Beck, Willie and Jones all\n     nervously exchange looks.\n\n                                WILLIE\n                   Well, at least we're safe inside\n                   here.\n\n                                JONES\n                   For how long?\n\n     Beck slides behind the Console and quickly types in a\n     message.  WE SEE IT ON THE SCREEN.  \"SHACK SIX REPORTING.\n     PLEASE DISREGARD PREVIOUS MESSAGE---\"\n\n     SUDDENLY MARTIN'S FACE APPEARS ON THE VIDEO SCREEN.\n\n                                MARTIN\n                   Thank goodness, you're still\n                   alive!\n\n                                JONES\n                                (yells nervously\n                                at the screen)\n                   Hey, man, you better get\n                   your ass out here right now\n                   and get us.  You hear me,\n                   motherfucker?  Right now!\n\n     Martin smiles calmly back at the three of them.\n\n                                MARTIN\n                   Please relax, Mr. Jones.  Every-\n                   thing is under control.  Naturally,\n                   when we received Dr. Warren's\n                   message we were concerned but\n                   would never have deserted you.\n\n     Jones lets out a breath.  Willie stares straight at the\n     screen.\n\n                                WILLIE\n                   When are you coming for us?\n\n                                MARTIN\n                                (smiles nervously)\n                   Well, that's the bad news.\n                   The typhoon did turn your way.\n                                (he looks at weather\n                                printout)\n                   Right now it is on a course--\n\n                                JONES\n                   Just answer the question, man!\n                   When are you coming?!\n\n                                MARTIN\n                                (beat)\n                   Hopefully in the next 48 hours.\n\n                                BECK\n                   Forty-eight hours!\n\n                                MARTIN\n                   I realize you must have gone\n                   through hell--\n\n                                JONES\n                   Gone?  Man, we're still here!\n\n                                MARTIN\n                                (firmly)\n                   I can't change the weather.\n                   Try to get some rest.  I'll\n                   keep you posted.\n\n     He turns off his screen and the picture in front of Beck,\n     Jones and Willie goes blank.\n\n                                BECK\n                   He's right.  Why don't you get some\n                   rest.  I'll stand the first watch.\n\n                                             TIME CUT TO\n\n     CONTROL ROOM - LATER\n\n     Jones sits near the vent sound asleep, his weapon across\n     his stomach.  Near him Willie lies still, eyes open.  She\n     watches Beck across the room, standing at the window.\n\n     He stares outside into the darkness for a moment, then\n     as if a thought suddenly occurs to him he looks at the\n     blank computer screen.\n\n     CLOSE ON COMPUTER SCREEN\n\n     \"Request weather summaries January 14-21.\"  The cursor\n     blinks back ominously then races across the screen.  \"FILE\n     CLOSED.\"\n\n                                BECK\n                                (to himself)\n                   Martin, you asshole...\n\n     Suddenly he hears a voice behind him.\n\n                                WILLIE\n                   They know, don't they?\n\n                                BECK\n                                (quietly)\n                   Yeah...I think they're just\n                   deciding what to do with us.\n\n                                WILLIE\n                   Maybe they already have.\n\n     She moves into Doc's seat in front of the console and calls\n     up the stock market program that Bowman was monitoring\n     earlier.\n\n     ON SCREEN  WE SEE:  Stock prices.\n\n     Willie types in a series of commands.\n\n                                BECK\n                   What are you doing?\n\n                                WILLIE\n                   Seeing how my stock's doing...\n\n     ON SCREEN:  The words TransOcean Corp.  The capsulized report\n     comes up on screen:  \"TransOcean Corp. took a bath on world\n     markets today when news of a tragic mining accident was\n     revealed to investors.  The Board of Directors....\"\n\n                                WILLIE\n                                (impatiently)\n                   Where?....\n\n     She scrolls forward in the report and suddenly freezes the\n     words.\n\n     THE SCREEN:  \"...accident took place in Shack Six, Southeast\n     Sector of Pacific Zone 10...Seven dead.  All bodies\n     missing.\"  Their names follow.\n\n     ON WILLIE  as her name comes up she shivers.\n\n                                BECK\n                   I can't believe they'd\n                   just leave us.\n\n     A voice behind them causes them to turn.\n\n                                JONES\n                   Welcome to the union, boss.\n                   We're all expendable.\n\n     He is now awake.  He sits up against the air vent.  Suddenly,\n     Beck listens, the room is deathly silent.  He looks over to\n     the air vent.  Jones is listening also.\n\n                                WILLIE\n                   What is it?\n\n                                JONES\n                   The air's stopped.\n\n     WHOOP!  WHOOP!  Suddenly a KLAXON HORN sounds hysterically.\n     A blue light on the console blinks on and off.  It says\n     \"AIR.\"  Beck turns to the instruments.\n\n                                BECK\n                   We're on backup air.\n\n                                WILLIE\n                   How much time does that give\n                   us?\n\n                                BECK\n                   Less than an hour.  It's ruptured\n                   an air duct.\n\n                                WILLIE\n                   Can't we fix it?\n\n                                JONES\n                   There're twenty miles of\n                   pipe in the bilge, they\n                   could have tapped-in anywhere.\n\n     SUDDENLY WE HEAR A SOUND WE HAVEN'T HEARD IN A LONG TIME.\n     The RATTLE THAT JONES AND COBB FIXED.  Jones and Beck home\n     in on the tell-tale noise.\n\n                                JONES\n                                (almost to himself)\n                   Cobb...Job security...\n\n     He locks eyes with Beck.\n\n                                BECK\n                   They're drawing us out.\n\n     He leaves his seat and Jones checks his weapon as Willie\n     watches.\n\n                                WILLIE\n                   You can't go out there, that's\n                   what they want.\n\n     Beck checks his make-shift flamethrower.\n\n                                BECK\n                   We don't have much choice...\n                   without air, the internal\n                   pressure will fall and--\n\n                                JONES\n                   Crunch...Implosion.\n\n     Willie watches them a moment then picks up one of the mining\n     tools, the laser-drill, she powers-it up to check it.  Her\n     action stops both men and she catches their looks.\n\n                                WILLIE\n                   You don't think I'm sitting\n                   in here, do you?\n\n     INT. CORRIDOR \"A\" - SAME\n\n     Carefully the three move into the Lower Ring Corridor.  As\n     they move we suddenly hear a new sound, DEEP, LIKE DISTANT\n     THUNDER.  The sides of the shack tremble slightly.\n\n                                WILLIE\n                                (low)\n                   The shack...\n\n                                JONES\n                   She's wondering what's\n                   happening.  We're losing\n                   air faster than I thought.\n\n                                BECK\n                                (to Jones)\n                   Which way?\n\n     Jones moves to the lead and turns down Corridor \"A.\"\n\n     INT. CORRIDOR \"A\"\n\n     The SOUND of the power-wrench removing the bolts from the\n     flooring.  The cover is removed and Beck and Jones peer down\n     into the darkness.  Willie stands guard with the flame-\n     thrower.\n\n     ON JONES  He peers into the darkness below.  He wasn't a big\n     fan of the bilge even before the Creature, now he's scared\n     shitless.\n\n                                BECK\n                   I'll go first.\n\n     Before Jones can protest Beck drops the ladder and climbs\n     down into the dark bilge.  Jones waits till he's at the\n     bottom, then starts down behind him.  Willie looks back.\n\n                                WILLIE\n                   Don't spend all day down\n                   there.\n\n                                JONES\n                   Don't fuckin' worry, I\n                   ain't.\n\n     BILGE\n\n     From somewhere in the darkness we hear the HISSING SOUND OF\n     ESCAPING OXYGEN and the FAMILIAR RATTLE OF THE AIR SYSTEM.\n     As soon as Jones reaches the bottom rung Beck shines a light\n     into the eerie underground area.\n\n     Pipes run overhead and on the walls.  A broken electrical\n     conduit sparks over their heads.  The floor is ankle deep in\n     greasy water.  They start toward the noise.\n\n     ON WILLIE\n\n     Her back is to the solid wall(outside wall).  Her eyes move\n     from one end of the corridor to the other, not lingering\n     long enough to distract her.  Sweat runs down her face and\n     we hear another tremor in the Shack.\n\n                                WILLIE\n                                (to herself,\n                                calming herself)\n                   Okay, Williams...let's hear a\n                   tune.\n                                (beat, quietly\n                                at first)\n                   \"Off we go...into the wild\n                   blue yonder...\"\n\n     ANOTHER RUMBLE FROM THE SHACK causes her to pause.  She\n     catches her breath and starts again.\n\n                                WILLIE(cont'd)\n                   \"...flying high into the sky...\"\n\n     She suddenly looks into the Main machine area (behind the\n     wire mesh of the other wall).  Was it something moving?\n\n     BILGE\n\n     ON BECK  He moves around a corner we recognize from before\n     with Jones' and Cobb's repair.  Beck floods the area with\n     light and the break in the line is visible.  The pipe has\n     been torn from the wall, it is totally unreparable.  What's\n     worse, electrical wires hang down, showering sparks into the\n     water.\n\n                                JONES\n                   Jesus Christ...\n\n                                BECK\n                   Can you fix it?\n\n                                JONES\n                   No way...\n\n                                BECK\n                   Think!  Can we stop it?!\n                   Block it up?!  Shut down\n                   the line somewhere?!  Think!\n\n                                JONES\n                   I am thinking, man!  You\n                   think I want to die!  I am\n                   thinking!  I--\n\n     Suddenly his eyes widen.  Beck sees this and turns.  In his\n     light WE SEE THE GLINT OF LONG TEETH AND THE HUGE BLACK\n     FRAME OF THE COBB/DOC CREATURE!  It's leech-like appendage\n     whipping in front of it like an excited cat's tail.  Before\n     it can strike, Jones pushes Beck out of the way and fires a\n     blast of flame from his flamethrower.  The CREATURE SCREAMS\n     and disappears.\n\n     As Beck falls his light lands in the bilge water and goes\n     out sending the bilge into greater darkness.\n\n                                JONES\n                   I hit it.  But I can't see\n                   it!  Can you see it?!\n\n                                BECK\n                                (standing)\n                   No.\n\n     Jones looks back at the ruptured pipe and suddenly has a\n     thought.\n\n                                JONES\n                   The Swamp.  There's an over-\n                   ride switch in the Swamp.\n\n     They start for the ladder when WWWWHHHHHHHHIP! out of the\n     darkness the appendage wraps like a bullwhip around Jones'\n     arm.  The deadly proboscis, which stabbed Cobb, is poised\n     like a dagger about to be plunged into the black man's\n     thigh.\n\n                                JONES\n                                (screams)\n                   Ahhh!\n\n     Instinctively Beck whips out the mining saw and severs the\n     tentacle.  The unseen Creature's SCREAM echoes through the\n     Bilge.  Beck grabs Jones by the arm and pulls him toward the\n     ladder.\n\n                                BECK\n                   Hurry...Get out!\n\n     Quickly they slosh toward the ladder and hole in the floor\n     fifteen feet away, moving closer...ten...eight....then\n     suddenly ANOTHER APPENDAGE thrusts between the rungs of the\n     ladder at them.  Beck ducks and leaps to the side.  He is\n     less than six feet from the Creature.  In the dim light WE\n     SEE it wickedly bare its teeth.\n\n     Beck's eyes go to the walls from one side to the other and\n     spot the exposed power cable.  The Creature steps forward\n     directly under the hole in the floor.  It is about to lunge\n     when a voice from above distracts it.\n\n                                WILLIE'S VOICE(O.C.)\n                   Hey, you?\n\n     The Creature looks up and sees:\n\n     ON WILLIE STANDING OVER THE OPENING, HER FLAMETHROWER\n     POINTED STRAIGHT DOWN.  SHE FIRES, SENDING A SEARING BLUE\n     FLAME INTO THE BILGE.\n\n     BECK watches the flame roar down on the monster and it gives\n     him the moment of distraction he needs.  He leaps out of the\n     bilge water and onto a pipe on the wall then rips the broken\n     power cable from the wall.\n\n                                BECK\n                   Jones!  Get your feet out\n                   of the water!\n\n     Jones jumps up and grabs a pipe running overhead as Beck\n     thrusts the sparking cable into the water at the Creature's\n     feet.\n\n     IN A BLINDING FLASH OF ELECTRICITY\n\n     The current surges through the Cobb/Doc Creature sending it\n     instantly rigid.  A second later it crashes forward into the\n     water.\n\n     Moving hand over hand toward the ladder Jones quickly climbs\n     out, followed by Beck.\n\n     THE SHACK CONTINUES TO SHAKE, EACH JOLT STRONGER THAN THE\n     LAST.  As they emerge Willie helps them.\n\n                                BECK\n                   C'mon, the Swamp!\n\n     They start for the Swamp down Corridor \"A\" when an enormous\n     shudder goes through the Shack, causing the lights to blink\n     and the floor to open beneath Beck.  The jolt knocks him\n     back into the bilge.  Only grabbing onto the pipes just\n     above the water stops him from falling back in.\n\n     JONES stops and looks back over the missing grating.\n\n                                JONES\n                   Beck!\n\n     Jones moves instinctively back for him, but another jolt\n     only widens the gap.  Beck yells to be heard over the din of\n     the collapsing Shack.\n\n                                BECK\n                   Go on!\n\n                                JONES\n                   No!\n\n                                BECK\n                   That's an order!\n\n                                JONES\n                   Fuck your orders!\n\n     He leaps across the gap onto a remaining grating and thrusts\n     his hand down into the darkness.  Beck lets go of one hand,\n     then the other, to grab Jones' extended arm.  In one\n     Herculean effort Jones pulls him out of the bilge.  Together\n     they leap across the chasm as the Desalinization Conduit\n     collapses over their heads and water floods into Corridor \"A\"\n     behind them.  They have to go around the other way!\n\n     AS THEY RUN\n\n     KLAXON HORNS SOUND and a RECORDED FEMALE VOICE warns:  \"Five\n     minutes until implosion...\"\n\n     FLASH CUTS OF:\n\n     THE LIGHTS FLICKER AND FAIL, CAUSING THE EMERGENCY LIGHTING\n     TO GO ON, AND CASTING AN EERIE STROBE EFFECT ON THE ESCAPING\n     THREE CREW MEMBERS\n\n     FALLING CEILING BEAMS CRASH DOWN IN FRONT AND BEHIND...\n\n     SEAMS BEND UNDER THE STRAIN, RIVETS POP...\n\n     STRAINING MACHINES SEND SCALDING GEYSERS OF STEAM INTO THE\n     CORRIDORS...AND SUDDENLY THE FLOOR GIVES WAY BENEATH WILLIE!\n     She leaps up and grabs an overhanging pipe and swings to the\n     firm ground.\n\n     JONES LEADS THE WAY TOWARD THE SWAMP, WITH WILLIE BEHIND\n     HIM, AND BECK COVERING THE REAR.\n\n     THEY reach the end of the corridor and Willie and Jones turn\n     into the Swamp Annex.  Willie hits the door opener.  RRRRRR\n     IT DOESN'T BUDGE.  The pressure has bent the door frame.\n\n     BECK ARRIVES\n\n                                WILLIE\n                   It's jammed!\n\n     Immediately Beck backtracks to the corridor and pulls a hand\n     held spreader--like a \"Jaws of Life\"--from the wall.  He\n     turns back to the Swamp when a BLACK SCALY ARM SUDDENLY\n     BURSTS THROUGH THE WIRE MESH OF THE MACHINE FLOOR AND PULLS\n     BECK AGAINST THE WIRE!  IT IS THE DEJESUS CREATURE.\n\n     His head held in place by the powerful arm, Beck looks\n     almost directly into the dark eyes of the Creature.  Its\n     gill-like slits flare.  Its mouth opens and we see a flash\n     of its razor sharp teeth.\n\n     Before Beck can move the leech-like appendage ruptures the\n     steel mesh and its razor-sharp proboscis plunges like a\n     knife for Beck's face.  At the last instant Beck move his\n     head and the proboscis slams into the steel mesh.  The mesh\n     loosens the creature's grip and Beck manages to reach a\n     mining drill from the tools on the wall.  As the appendage\n     starts to strike again Beck buries the whining tool into the\n     Creature's tentacle and breaks free.\n\n     Scooping up the spreader Beck rushes to the Swamp door where\n     Jones and Willie are trying vainly to hand crank the door\n     open.\n\n                                JONES\n                   Where the hell've you been?\n\n                                BECK\n                   I got hung up!  Try this!\n\n     Willie stands back and Beck thrusts the Spreader into the\n     tiny crack in the door the hand crank had made.  With Jones'\n     help the two men force open the door and all three rush\n     inside the SWAMP.  Beck closes the door behind them.\n\n     THE RECORDED FEMALE VOICE INTONES:  \"Five minutes to\n     implosion.\"  And we feel it happening:\n\n     THE BILGE WATER ON THE FLOOR OF THE SWAMP RIPPLES WITH THE\n     VIBRATIONS\n\n     THE WALLS SHAKE\n\n     THE HUGE METAL SUITS ROCK LIKE CLOTHES ON A CLOTHES LINE.\n     ONE FALLS AND CRASHES INTO THE WATER\n\n     JONES throws open the control panel and grabs the red\n     handled emergency air switch, but he can only move it half\n     way!  It is jammed by the pressure.\n\n                                JONES\n                   It won't go!\n\n     Willie grabs it with him, but even together it is not\n     enough.  THE HANDLE BREAKS OFF IN THEIR HANDS!\n\n     STEAM JETS WHIP DOWN ON THEM FROM ABOVE!\n\n     THE WATER AT THEIR FEET NOW BOILS FROM VIBRATION!\n\n     THE FEMALE VOICE INTONES:  \"Four minutes...\"\n\n     BECK TURNS AND SEES THE SUITS IN THE LOCK\n\n     He grabs Willie and pushes her toward the Lock where her\n     suit hangs.\n\n                                BECK\n                   The suits!  Get in them!\n\n     Willie moves quickly but Jones doesn't.\n\n                                JONES\n                   The suits!  Are you crazy!\n                   How're we going to get to\n                   the surface?\n\n     Beck yanks open the equipment locker revealing TANKS OF\n     COMPRESSED AIR AND DEFLATED CONTAINER TRANSPORTERS.\n\n                                BECK\n                   Like this.\n\n     He looks up at Jones who grins with renewed hope and they\n     begin pulling the equipment out.\n\n                                BECK(cont'd)\n                   Get them in the Lock!\n\n     Jones and Beck drag the tanks and the parachute-like\n     Container transporters to the lock.\n\n     ON WILLIE  She climbs into her suit and activates her\n     generator.  Instantly her Vital Signs spring to life around\n     the perimeter of her helmet.\n\n     THE FEMALE VOICE TREMBLES FROM THE VIBRATIONS...\"Three\n     minutes...to...implosion...\"\n\n     Beck and Jones throw the last of the supplies onto the\n     elevator and Beck holds out the SEISMIC TOOL Jones tried to\n     arm himself with earlier.  He takes the tool from Beck and\n     sticks it in the vest of his wet suit.\n\n     Then suddenly he sees that there are only two suits in the\n     Lock.  Beck will have to wait on his to move along the track\n     to the Lock.\n\n                                JONES\n                   Your suit, Becky!\n\n                                BECK\n                   Just get in yours!\n\n     Jones climbs onto the Lock platform and slides into his\n     suit.\n\n     Beck hits the Suit track button and his suit begins moving\n     along the track toward the Lock.  A suit turns the corner\n     from the storage room followed by one labeled BECK.\n\n     Beck looks at the walls, they're shaking harder.  He moves\n     along the suit rack when suddenly THE CREATURE BURSTS FROM\n     BEHIND THE SUITS SHATTERING THEM LIKE AN EXPLOSION!  A HUGE\n     TENTACLE HURLS TOWARD BECK LIKE A SPEAR.\n\n     BECK ducks just in time, grabbing a fire ax and chopping off\n     the appendage.  Another tentacle jabs for Beck.\n\n                                WILLIE\n                                (screams)\n                   Look out!\n\n     But it is too late.  It knocks the ax from Beck's hand and\n     sends him to the floor.  Beck looks up at the Lock in time to\n     see Jones seal himself into his suit.\n\n                                JONES/RADIO\n                   I'm in.\n\n                                BECK\n                                (to the others)\n                   Go!\n\n                                WILLIE/RADIO\n                   No!\n\n     THE CREATURE APPROACHES BECK\n\n     Beck looks at the others one last time.\n\n                                BECK\n                   Go, now!  That's an order!\n\n     Jones hits the elevator button and the Lock closes as the\n     elevator sends them down without Beck.\n\n     BECK stands and arms himself with a mining drill, which he\n     swings at the Creature driving it back.  As Beck gets the\n     upper hand, the Creature turns its hideous face and Beck\n     freezes.  There attached to the back of the Creature's head\n     is the grotesque face of DeJesus!\n\n     DeJesus' eyes suddenly blink.  He's still alive!  His lips\n     tremble in agony.\n\n                                DEJESUS\n                   Kill me...Kill me!\n\n     Beck, momentarily stopped by the face, lunges forward with\n     the drill and embeds it in the side of the Creature.\n\n     As the Creature falls back hurt, Beck looks up at the lock\n     elevator as it returns--IT IS EMPTY--The others have made it\n     out!  His suit continues down the track and stops in the\n     Lock.  He still has to make it, if he can just get there!\n\n     THE RECORDED FEMALE VOICE SOUNDS:  \"One minute to\n     implosion...\"\n\n     Beck races to the Lock and starts to climb into the suit.\n     His arms slide into place, his legs drop into the heavy\n     metal shell and as he seals up the back he activates the\n     generator.\n\n     BECK'S POV.  His vital signs light up around the perimeter\n     of his helmet, but he sees something else--the Creature\n     charges toward the Lock--its arm reaches out to yank Beck\n     out of the elevator!  Instinctively, Beck swings his\n     motorized leg into the Creature's snarling mouth, knocking\n     it backwards and stunning it long enough for Beck to hit the\n     elevator button.  BUT IT DOESN'T WORK!\n\n                                BECK\n                   No!\n\n     He hits again, still nothing!\n\n     THE RECORDED FEMALE VOICE...\"Nineteen, eighteen...\"  Her\n     voice begins to quiver.\n\n     BECK POUNDS ON THE BUTTON AND LOOKS UP JUST AS THE CREATURE\n     DIVES FOR HIM, ITS HUGE SCALY HAND GRABBING HIM AROUND\n     BECK'S LEG!\n\n     CLOSE ON THE ELVATOR BUTTON  Beck pounds it one last time\n     and NNNNNNNNNNNN!\n\n     THE LOCK CLOSES, CRUSHING THE CREATURE AS IT FLUSHES BECK\n     OUTSIDE SECONDS BEFORE THE ENTIRE STRUCTURE COLLAPSES WITH\n     IMPLOSION AND SUDDENLY EXPLODES IN A HUGE SHUDDER OF ENERGY!\n\n     UNDERWATER - LATER\n\n     WHOOSH!  A parachute-like Container Transporter zoom toward\n     the surface.  A heavy-suited crew member flashes past us.\n     Its helmet light pierces the darkness, then disappears.  A\n     moment later another Transporter follows, racing out of the\n     darkness after the first.\n\n     BECK'S POV  We see the vital signs lit in a ring around his\n     helmet.  The depth gauge races past with blinding speed as\n     he moves closer to the surface.\n\n     WILLIE'S POV  She tilts her head upwards.  She snaps off her\n     light and sees instead of black, a lighter gray, then\n     suddenly faint traces of light in the water above her.  At\n     first it seems like her eyes are playing tricks on her, then\n     we see it again--a glimmer of light.\n\n                                WILLIE(RADIO)\n                   Light.  Beck, I see light!\n\n     ON BECK\n\n     He follows her look.  Light is coming fast, brightening as\n     they rise.  The LED numbers inside their helmets click\n     off...\"125, 100, 75...\"\n\n                                BECK(RADIO)\n                   Wait till you reach thirty-\n                   five before you blow your suit...\n\n                                WILLIE'S VOICE(RADIO)\n                   Roger.\n\n     WILLIE'S POV  Her numbers count down \"....70, 60, 50, 40...\"\n\n                                WILLIE(RADIO)\n                   Ejecting.\n\n     She yanks at the handle on the chest plate and WHOOSH!  The\n     plate bursts open and reveals a second interior handle.  Her\n     hand gropes for it.\n\n     SUNLIGHT IS STREAMING DOWN THROUGH THE WATER AS SHE RUSHES\n     UPWARD.\n\n     WHOOSH!  The helmet and torso of the suit are blown open as\n     she pulls the second lever detaching her from the balloons.\n\n     No longer oxygen supported or being pulled upward, Willie\n     frees herself from the heavy suit and swims to the surface.\n\n     SUDDENLY SHE BREAKS THE SURFACE AND CATCHES A GLIMPSE OF THE\n     SUN, DAZZLING THROUGH A MILLION DROPLETS OF WATER AS A HUGE\n     SWELL CARRIES HER UP EVEN HIGHER.\n\n     Then she's underwater again, struggling desperately to pull\n     the tab on the life jacket around her neck.  Suddenly a MALE\n     HAND GRABS THE TAB FOR HER AND PULLS.  She looks up at Beck.\n\n                                WILLIE\n                   We made it!\n\n                                BECK\n                   Where's Jones?\n\n     Holding onto each other Willie and Beck ride a swell.  At\n     the crest WE SEE JONES in the trough below, face down.  Beck\n     breaks away from Willie and swims through the waves to reach\n     Jones.  Reaching him Beck pulls his face out of the water\n     and inflates his life jacket.\n\n                                WILLIE\n                   Is he okay?\n\n     Beck lays Jones head back against the life jacket.  For a\n     moment.  Jones seems lifeless, then his eyes blink and squint\n     against the sunlight.  Beck turns back to Willie and as he\n     and Jones ride the next crest he gives her the \"thumbs-up.\"\n\n                                WILLIE(cont'd)\n                                (jubilant)\n                   The sun!  The sun!\n\n     Jones looks at Beck and grins.\n\n                                JONES\n                   What happened to that typhoon?\n\n     CALM SEA - LATER\n\n     BECK, WILLIE AND JONES cling to each other as they search\n     the horizon.\n\n                                WILLIE\n                   Are you sure you saw something?\n\n                                JONES\n                   How many times I got to tell\n                   you.  I saw a ship.\n\n                                WILLIE\n                   Well, why haven't they answered\n                   our flares?\n\n                                BECK\n                   We'll fire one more, that\n                   leaves us one last one.\n\n     BECK pulls the flare off his latex wet suit and fires it\n     into the sky casting a comforting yellow glow over the dark\n     water.  The light fades, Willie looks at Jones.\n\n                                WILLIE\n                   Are you okay, Jonesy?\n\n                                JONES\n                                (weakly)\n                   Tip top, Willie...tip top.\n\n                                WILLIE\n                                (testing him)\n                   Who's the best power forward\n                   in the NBA...Jameson?\n\n                                JONES\n                                (tired, but\n                                with fight)\n                   Jameson?  Who are you trying\n                   to con...?\n\n     They both manage a weak laugh, then Beck sees something.\n\n                                BECK\n                   I'll be damned.  Look!...A flare!\n\n     As a small swell lifts them up we can see a tiny flare just\n     fading against the sky.\n\n                                WILLIE\n                   It saw us!\n\n                                JONES\n                   Answer them and quit kicking me!\n\n                                WILLIE\n                   I'm not touching you!\n\n     WHOOOOOOOOSH!  Beck fires another flare into the sky.  As the\n     flare arcs downward, Willie feels another bump and for the\n     first time sees the SHARKS CIRCLING THEM.\n\n                                WILLIE\n                   No...no, no, no.\n\n     The SHARKS tighten the circle as the flare fades.\n\n     EXT. U.S. COASTGUARD SHIP'S BRIDGE - SAME\n\n     A CAPTAIN watches the flare fade through his binoculars and\n     speaks to someone O.S.\n\n                                CAPTAIN\n                   I thought you said you'd\n                   combed this area?\n\n     He lowers his binoculars AS WE WIDEN TO REVEAL MARTIN\n     standing on the bridge.  He also lowers his binoculars and\n     smiles coolly as he lies.\n\n                                MARTIN\n                   We did....Many times.\n\n                                CAPTAIN\n                                (looks at Martin\n                                then to a Lieutenant)\n                   Initiate rescue.\n\n     We hold on Martin's face as from\n\n     THE FORE DECK OF THE SHIP\n\n     A rescue chopper with pontoons lifts off the deck and banks\n     off toward the fading flare.\n\n     OCEAN - SAME\n\n     Jones, Willie and Beck stay bunched close together.\n     Suddenly Willie feels another bump.\n\n                                WILLIE\n                                (panicky)\n                   It hit me!  Where are they?!\n\n                                BECK\n                   I can't see them!\n\n     Suddenly he is bumped by a shark.  Willie sees one only two\n     feet away.  They are surrounded.  Suddenly Jones stare to\n     taunt the sharks aggressively.\n\n                                JONES\n                   All right!  I've had enough\n                   of this shit!  You want meat,\n                   motherfucker?  Come on, eat\n                   me, sucker, try some dark meat!\n\n     He pushes away from the group despite Beck's attempt to stop\n     him.\n\n                                JONES(cont'd)\n                                (taunting sharks)\n                   What's wrong you snout-nosed\n                   bastards?  My meat too tough\n                   for you?!\n\n     Amazingly the sharks begin to disappear.  Willie and Beck\n     watch stunned.  Even Jones is surprised.\n\n                                JONES(cont'd)\n                                (to Willie and Beck)\n                   Whoa!  Did you see those fools\n                   run?  They know whose boss.\n\n     He jabs his arm upward in triumph and for the first time WE\n     SEE a gash across his forearm.\n\n     UNDERWATER POV\n\n     As Jones crows triumphantly, WE SUDDENLY SEE HIS WET SUIT\n     RIPPING ALONG HIS THIGHS!\n\n     SURFACE/OCEAN\n\n     Jones is chortling, suddenly his smile vanishes, something\n     is happening...\n\n     WE hear the DRONE OF THE APPROACHING HELICOPTER...THUMP,\n     THUMP, THUMP...The blades of the helicopter sound out over\n     the waves.  It's lights are visible.  Willie and Beck wave\n     frantically as Jones drifts closer to them!\n\n     UNDERWATER\n\n     JONES' LEGS  His wet suit is now completely split open and\n     WE SEE THE BLACK SCALES SPREADING!\n\n     THE HELICOPTER\n\n     hovers over the group below and lands on the water.  Its\n     blades beat the surface into waves.  The WINCH OPERATOR\n     hurls out a rescue harness and Beck helps Willie into the\n     ring.  He CLICKS the fastener and suddenly they both lock\n     eyes.  Before Willie can say anything Beck falls back and\n     signals the Winch operator who begins hauling her to safety.\n     Immediately Beck locks back at Jones and extends his arm.\n\n                                BECK\n                   Jonesy...Give me your hand!\n\n     WILLIE reaches the helicopter and quickly climbs out of the\n     harness.  The Winch operator throws it back across the water\n     where\n\n     BECK grabs the harness.\n\n                                BECK\n                   C'mon, Jones!\n\n     Jones reaches out his hand.  He is almost there WHEN\n     SUDDENLY RISING OUT OF THE WATER BEHIND THEM IS THE\n     SIXPACK/BOWMAN CREATURE IN ALL ITS HIDEOUS GLORY!  HUGE AND\n     GRUESOME, ITS LONG TEETH GLIMMER IN THE LIGHT.  IT GOES FOR\n     BECK BUT JONES MOVES BETWEEN THEM.\n\n                                BECK\n                   Jonesy, No!\n\n                                JONES\n                   Get out of here, Becky!\n\n     The Creature grabs Jones and pulls him violently under.\n     Beck watches horrified as his friend disappears.  Numbed he\n     clips the rescue harness around him when suddenly, WE SEE a\n     boiling of water where Jones disappeared...bubbles\n     rising...and then Jones' bloody and tattered life vest bobs\n     to the surface several feet away from Beck.\n\n     Beck reaches out for it just as the Creature appears again!\n     It turns and focuses on Beck.  Beck keeps going for the life\n     vest as the Creature starts for him.\n\n     ON HELICOPTER\n\n     The Winch operator and Willie watch in horror as the\n     Creature bears down on Beck.\n\n                                WINCH OPERATOR\n                   Is he in the harness!\n\n     CLOSE ON JONES' TATTERED VEST  Beck reaches it.  His fingers\n     wrap around the bicycle pump-like, seismic tool in Jones'\n     vest pocket.  The Creature is right on top of him!\n\n     CHUNK, CHUNK, Beck cocks it like a pump shotgun as tentacles\n     rise wickedly out of the water and wrap around Beck's body\n     in a death grip.  It's horrible mouth starts to open.\n\n                                BECK\n                   C'mon, motherfucker open up!\n\n     The Creature's mouth widens and as it starts to strike Beck\n     thrusts the seismic tool into its gaping maw and is suddenly\n     pulled from behind--out of the creature's grasp!  The rescue\n     cable is taut!  The helicopter is taking off!\n\n     BECK'S POV/ RISING SHOT.  Beck rises suddenly out of the\n     water, the Creature growing instantly smaller below him\n     until BOOM! the Seismic device explodes in the\n     Sixpack/Bowman Creature, blowing it to bits across the ocean\n     surface!  The shock wave sends the helicopter banking off\n     toward the ship with Beck safely attached by cable below it.\n     The winch operator pulls him in.\n\n     EXT. COAST GUARD SHIP - LATER\n\n     Beck, dressed now in crisp white clothes, stands on deck of\n     the ship.  He glances occasionally at a door nearby marked\n     INFIRMARY, then looks up as the Captain approaches and\n     shakes his hand.\n\n                                CAPTAIN\n                   Mr. Beck, I understand\n                   you passed your physical with\n                   flying colors.  And Ms. Williams?\n\n                                BECK\n                                (worried)\n                   I don't know yet, she's still\n                   in there.\n\n                                CAPTAIN\n                   Well, you'll be glad to know\n                   you have a friend onboard.\n\n     Beck looks up surprised as suddenly Martin joins them.\n\n                                MARTIN\n                                (excitedly)\n                   Beck!  I told them you'd\n                   make it.  No one back at\n                   TransOcean believed me, but\n                   I never gave up on you once.\n                                (smiling)\n                   So, how are you feeling?\n\n     Beck looks at Martin for an instant then hauls off and in\n     one incredibly smooth punch knocks Martin on his can across\n     the deck.\n\n                                BECK\n                   Better...A lot better.\n\n     Just then the door to the infirmary opens and Willie appears\n     with a new outfit on.  Smiles at Beck.\n\n                                WILLIE\n                   I'm fine!\n\n     Beck lets out a slight sigh of relief as a STEWARD\n     approaches with a tray of WHOLE COOKED FISH, HIDEOUS LOOKING\n     THINGS LIKE ANGLERS, LOBSTERS, CRABS...MINIATURE LEVIATHAN.\n     The sight is almost too intense for Beck and Willie.  The\n     Captain notices.\n\n                                CAPTAIN\n                   I thought we might have some\n                   wonderful seafood.  But, if there's\n                   something else you'd rather have...\n\n     Willie stares at the tray of seafood uneasily then looks at\n     the Captain and smiles.\n\n                                WILLIE\n                   How about a burger and fries?\n\n     She and Beck laugh as they sit at a finely set table on the\n     deck with the Captain.\n\n     AS WE PULL BACK the ship becomes smaller and smaller in the\n     distance and WE ARE AT THE\n\n     SURFACE OF THE OCEAN\n\n     riding the swells, rising and falling before slipping\n     beneath the waves and descending again into the cold\n     depths.\n\n\n\n\n\n                                THE END\n\n\n   \n\n\n\n\n\n\n\nLeviathan\nWriters :   David Peoples  Jeb Stuart\nGenres :   Horror  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:29:19.938039"}