{"title": "Life As A House", "film_link": "/Movie Scripts/Life As A House Script.html", "script_link": "/scripts/Life-As-A-House.html", "info_raw": "\n\nLife As A House Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Mark Andrus\nGenres  Comedy  Drama\n\nRead \"Life As A House\" Script\n\n\n", "script": "\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\nLife as a House - By Mark Andrus\n\n\t\tLIFE AS A HOUSE\n\t\tWRITTEN BY MARK ANDRUS\n\n\t\tFADE IN:\n\n            A clock alarm SOUNDS over TITLES on BLACK.  We HEAR someone\n            clearing congested lungs, coughing up phlegm; a slight crash\n            STOPS both the cough and the alarm.\n\n            EXT. GEORGE'S BEACH SHACK - MORNING\n\n            The cottage is a tiny, peeling paint rat-trap set dead center\n            on a small ocean front cul-de-sac, surrounded by four massive\n            post-modern mansions.\n\n            INT. GEORGE'S BEACH SHACK BEDROOM - MORNING\n\n            GEORGE NELSON, 42, squints and shivers as the spotty morning\n            light and ocean breeze enter through an open window.  Bold\n            waves crash against the cliffs outside the room.  A five-foot\n            wide stack of hand hewed beams are piled pyramid style,\n            making movement in the room next to impossible.  George\n            stands shirtless in underwear and coughs again.  He steps\n            over a pile of tools and stands at the window, facing the\n            sea.  A happy sounding tune by Guster, \"WHAT YOU WISH FOR,\"\n            begins with the lyrics: 'Woke up today, to everything gray\n            and all that I saw just keeps going on and on...'\n\n            EXT. WEBBER'S HOUSE - MORNING\n\n            The post-modern house is three-levels of concrete and glass.\n\n            INT. SAM WEBBER'S BEDROOM - MORNING\n\n            SAM is sixteen with spiky black hair, a nose ring, two\n            earrings and painted black nails.  The song continues with:\n            '...sweep all the pieces under the bed, close all the\n            curtains and cover my head.'  Sam looks wasted as he climbs\n            out of bed and rummages through his dresser, retrieving an\n            empty bottle of prescription drugs; he tosses the bottle.  He\n            walks to a desk where a half-built model of a house sits\n            unfinished and squeezes glue into a plastic bag and sniffs\n            it.  Sam enters the closet and digs into a pile of dirty\n            clothes, pulling out the tie to a robe; he knots it around\n            the closet pole and then twists it once to form a noose.  He\n            slips his neck through the noose and lowers his body; though\n            we don't see exactly what he's doing below his neck, it's\n            evident through his jerking arm that he's masturbating.\n\n            EXT. BECK'S OCEAN FRONT MANSION - MORNING\n\n            COLLEEN BECK, George's next-door neighbor, is a well\n            maintained blonde in her late thirties.  She walks out of the\n            angular concrete mansion, grabs the paper and walks back in.\n\n            INT. BECK'S KITCHEN - MORNING\n\n            This is a minimalist kitchen, with pored concrete walls and\n            stainless steel cabinets. \n            Colleen drops the paper on the table and walks to the sink to\n            wash her hands.  The SONG CONTINUES: '...If this serenade is\n            not what you want, it's just how it is...'  Colleen appears\n            distracted for a moment.  She walks outside onto the terrace\n            with wet hands, then bolts back in, breezing through the\n            kitchen with purpose.\n\n            INT. ALYSSA BECK'S BATHROOM - MORNING\n\n            ALYSSA is sixteen and perfect with strawberry blonde hair and\n            white teeth; her head is partially out the bathroom window. \n            Colleen bursts in, eases Alyssa aside and with effort, sticks\n            her head out of the same high open window.\n\n                                COLLEEN\n                      This is ridiculous!\n\n            We must not see exactly what they see, but out the window and\n            almost beyond view, a stream of urine arks out from George\n            Nelson's beach house bedroom, into the pacific ocean some\n            twenty-feet below.  The piss stops.  Colleen bangs her head\n            trying to get it back inside the house.\n\n            INT. WEBBER'S UPSTAIRS HALLWAY - MORNING\n\n            ROBIN WEBBER is George's ex-wife, still beautiful at forty. \n            She herds two boys, RYAN (8) and ADAM (7), down the hall.\n\n                                ROBIN\n                      Run downstairs and give your dad a hug.\n\n                                RYAN\n                      Why?\n\n                                ROBIN\n                      He'll be gone for his birthday.\n\n                                ADAM\n                      Can we have a party for him while he's\n                      gone?\n\n            Robin stops and KNOCKS on a bedroom door.\n\n                                ROBIN\n                      I hope you're showered and ready for\n                      school!\n\n            A loud CRASH stops Ryan and Adam at the top of the stairs.\n\n            INT. SAM'S ROOM - MORNING\n\n            Robin rushes in and glances around the room for her son.\n\n                                ROBIN\n                      Sam?!\n\n            INT. SAM'S WEBBER'S CLOSET - MORNING\n\n            The closet pole and a long line of clothes have been felled\n            by Sam's dangerous whack-off technique; he's on the floor\n            with the robe tie still around his neck and a pile of shirts\n            sprawled over him.  The song continues: '...come out come\n            out, wherever you are, would you do it all over right from\n            the start, and what you wish for won't come true, you aren't\n            surprised to love, are you?' \n\n            Robin stops at the door, trying to figure out why her son is\n            sitting in a pile of his own clothes.  Ryan and Adam join\n            her, looking equally perplexed.\n\n            EXT. GEORGE NELSON'S CUL-DE-SAC - MORNING\n\n            George's dog, GUSTER, is doing his business on the lawn of a\n            modern day robber baron, DAVID DOKOS, who exits his house\n            with a briefcase.  He hops into his Mercedes and proceeds to\n            chase Guster straight across his well-manicured grass. \n            Guster easily escapes death and runs off.  George walks out\n            of his shack as David hops the curb, flips him off and drives\n            away.  George waves goodbye.\n\n                                GEORGE\n                      Stick it up your ass!  Have a nice day.  \n                          (glancing around)\n                      Guster!\n\n            Guster runs to his side as Colleen rushes out of her house.\n\n                                COLLEEN\n                      This has got to stop!\n\n                                GEORGE\n                      He escaped.  He's going back in.\n\n                                COLLEEN\n                      Does it give you some sort of perverse\n                      pleasure to expose your...penis in plain\n                      view of my sixteen year-old daughter?\n\n                                GEORGE\n                      There are no windows facing\n                      my...exposure.\n\n                                COLLEEN\n                      George, this is the third time.\n\n                                GEORGE\n                      The plumber's due out on Friday.\n\n                                COLLEEN\n                      You'll have to explain that to the\n                      police.\n\n                                GEORGE\n                      You were the only neighbor I could\n                      tolerate.\n\n                                COLLEEN\n                      I did warn you.\n\n                                GEORGE\n                      My life is a warning.  I just can't\n                      figure out for what.\n\n            Colleen shies away from George's stare; he finally turns and\n            walks toward the house but stops short as he turns back.\n\n                                GEORGE (CONT'D)\n                      Colleen, how hard was it for you to get\n                      your head outside that window far enough\n                      to see my dick?\n\n            This stops Colleen for a moment; it was difficult.  George\n            walks back to the cottage and locks Guster in before stepping\n            into an old Ford truck and driving off.  Colleen watches him\n            drive off, then turns to her house and stares.\n\n            INT. WEBBER'S DINING ROOM - MORNING\n\n            PETER WEBBER, Robin's husband, is a distinguished,\n            intimidating man with silver hair and an expensive suit. \n            LOIS, the maid, serves French toast to Ryan and Adam as Robin\n            sips tea.\n\n                                ADAM\n                      Sam broke his closet.\n\n            Peter glances at Robin, who shrugs.\n\n                                ROBIN\n                      I don't have a clue anymore.  I wish\n                      you'd talk to him.  He needs a man.\n\n                                PETER\n                      His father is a man.\n\n                                ROBIN\n                      A man he respects.\n\n            Sam walks into the room from the hall, outfitted in all black\n            with kick ass boots.\n\n                                SAM\n                      Thanks for talking about me behind my\n                      back...useful in court.\n\n                                PETER\n                      Are you wearing eye shadow?\n\n            Adam, Ryan and Robin check out the eye shadow.\n\n                                SAM\n                      No.\n\n                                PETER\n                      Take it off.\n\n            Sam flutters his eyelids in defiance of his stepfather.\n\n                                PETER (CONT'D)\n                      Do it now!\n\n                                SAM\n                      If I walk out the door, who's gonna be\n                      here tonight for the follow through?\n\n            Peter hesitates for just a second.\n\n                                SAM (CONT'D)\n                      Have a nice flight.\n\n            Sam's out the door with his eye shadow intact.\n\n                                RYAN\n                      Queer.\n\n                                ROBIN\n                      What did you say?\n\n                                RYAN\n                      Dad said it first.\n\n            Robin focuses on Peter, who simply shrugs.  Adam stands up,\n            walks over to his father and gives him a hug.\n\n                                ADAM\n                      I get chocolate cake for your birthday.\n\n                                PETER\n                      Are your hands clean?\n\n            Adam is quick to back away from his father and lick the\n            fingers of one hand.\n\n            INT. COMMUTER TRAIN - MORNING\n\n            George is resting his head against the glass window as he\n            stares out at the blighted landscape leading to downtown Los\n            Angeles.  A sudden pang tightens his face; he presses his\n            hand against his stomach and closes his eyes.\n\n            EXT. LAGUNA BEACH HIGH SCHOOL - MORNING\n\n            Sam is alone at the back of the parking lot, sitting on the\n            hood of an old Saab, smoking as two boys, JOSH and MAREK,\n            both seventeen, park a Porsche and pull Alyssa Beck (George's\n            peeping neighbor) and another girl out of the backseat.\n\n                                MAREK\n                      Dude, nice look.\n\n            Sam simply nods as Marek and the other girl laugh at his all\n            black garb, earrings and eye shadow.\n\n                                ALYSSA\n                      I saw your dad this morning.\n\n            Sam drops his cigarette and stomps it out as he stands; his\n            face lightens as Alyssa waves before walking away.\n\n                                JOSH\n                      Been thinking?\n\n                                SAM\n                      No.\n\n                                MAREK\n                      Forget him!\n\n                                JOSH\n                      Two hours a week for three-hundred cash. \n                      The whole summer.  Do the math.\n                          (as a dig)\n                      They consider that a hatchback or a\n                      station wagon?  Oh, that isn't yours\n                      anyway, is it?\n\n            Josh raises his eyebrows and smiles before walking away.  Sam\n            faces the Saab and kicks the bumper as hard as he can. \n            Suddenly, a boy (COREY) bolts up from the back seat.\n\n                                COREY\n                      I was in total REM, man!\n\n            INT. DOWNTOWN LOS ANGELES HIGHRISE - LATE MORNING\n\n            The architectural firm of Benson and Feinsilber occupies the\n            entire fortieth floor; George Nelson is their sole model\n            maker.  Rather than offices, most of the space is open,\n            segmented only by portable low walls.  Along the outer walls,\n            below the long line of windows, is a shelf filled with\n            amazingly intricate models.  George is alone in a cubicle of\n            his own, cutting polystyrene with a hot wire.  STEVEN GARDNER\n            rounds a corner with a velocity that makes George flinch.\n\n                                STEVEN\n                      Done...close to done?\n\n                                GEORGE\n                      I'm doing the grass.\n\n                                STEVEN\n                      Fuck the grass.  Who said grass?\n\n            Steven exits as quickly as he entered, but as soon as George\n            goes back to work, Steven pops his head back in.\n\n                                STEVEN (CONT'D)\n                      Burke bided out the Berlin Plaza.  Did he\n                      tell you?\n\n                                GEORGE\n                      I was going to start Monday.\n\n                                STEVEN\n                      He likes the look of the computer models,\n                      anyway.  You take too long.\n                          (beat)\n                      After you mow the grass, would you mind\n                      bringing the house to my office?  I have\n                      a presentation to make.\n\n            George simply stares as Steven nods and leaves.\n\n            EXT. HIGH SCHOOL CAFETERIA ATRIUM - LUNCHTIME\n\n            Sam is by himself, his eyes closed, listening to music\n            through headphones as Alyssa stops to stare; she visually\n            scans him head to foot, appearing slightly perplexed as a\n            friend passes.\n\n                                FRIEND\n                      I wouldn't make a habit of it.\n\n                                ALYSSA\n                      Okay.\n\n            The friend walks on; after a beat, Alyssa does too.\n\n            EXT. TOP OF THE WORLD PARK - EVENING\n\n            In the distance, the sun colors the sky a blinding orange as\n            it sets.  A Range Rover with blackened windows is parked\n            behind a Porsche.  'TINTED WINDOWS,' an up-tempo tune with a\n            hand clapping by the Pansy Division, begins: 'A bed would be\n            a treat/But all we've got is this backseat/Tinted windows are\n            a beautiful thing.'\n\n            Through the front windshield, we can see Marek sitting in the\n            passenger's seat with his eyes closed.\n\n            ANOTHER VIEW\n\n            Josh, Marek's friend, is sitting on a bench in the park\n            behind the cars. 'A dark secluded spot/In a deserted parking\n            lot/Tinted windows are a wonderful thing.'  \n\n            Suddenly, the passenger door on the Rover opens and Marek\n            climbs out, brushing his hair with his hands before casually\n            checking his zipper.  He closes the door and the car speeds\n            away.  Josh walks to Marek and wordlessly they climb into the\n            Porsche and drive off.\n\n            EXT. GEORGE NELSON'S BEACH SHACK - DAY\n\n            George is shirtless in his front yard, hand hewing a twenty\n            foot beam.  One strong, long pull and a thin shaving flutters\n            to the ground; Guster nabs it and starts to chew.\n\n                                GEORGE\n                      You'll crap real logs if you keep eating\n                      wood.\n\n            Guster appears unconcerned as he awaits a new shaving.\n\n                                ALYSSA (O.S.)\n                      Hi, Mr. Nelson.\n\n            George glances up, wipes the sweat from his forehead as\n            Alyssa walks toward him in white shorts and a tee shirt.\n\n                                ALYSSA (CONT'D)\n                      Sorry I got you into trouble.\n\n                                GEORGE\n                      I'll survive.\n\n            George goes back to works and Guster taste tests shavings as\n            Alyssa searches for something else to say.\n\n                                ALYSSA\n                      Does Sam have any friends?\n\n            George stops and looks up; he has no idea how to answer.\n\n                                GEORGE\n                      He must.\n\n                                ALYSSA\n                      He seems lonely.\n\n                                GEORGE\n                      Are you his friend?\n\n                                ALYSSA\n                      No.\n\n                                GEORGE\n                      Why?\n\n                                ALYSSA\n                      Marilyn Manson...and I guess he's into\n                      guys.  I hate nose rings.  And the blue\n                      eye shadow thing really isn't working.\n\n            George is totally confused, unsure most of the answer, but\n            before he can question her, a police car pulls to a stop;\n            OFFICER KURT WALKER steps out.\n\n                                KURT\n                      Thought I'd run over the list.\n\n            Officer Walker removes a pad from his pocket and flips\n            through to find his place.\n\n                                ALYSSA\n                      This is such a street of whiners.\n\n                                KURT\n                      From Tuesday to yesterday, not including\n                      Monday or today.  Okay...Mrs. Dokos is\n                      repeatedly running over her lawn.  The\n                      Corliss' have attributed the increase in\n                      rat population in their environs to the\n                      state of your...structure.\n\n                                ALYSSA\n                      IPO's caused the rat population on this\n                      street.\n\n            Officer Walker focuses on Alyssa.\n\n                                KURT\n                      And of course the Beck's, with the...\n\n                                ALYSSA\n                      It could have been a squirt gun.\n\n                                KURT\n                          (to George)\n                      You've been good this week.\n\n                                GEORGE\n                      You forgot David Dokos and Tom and\n                      Barbara.\n\n            Kurt stuffs his pad back into his pocket.\n\n                                KURT\n                      Mr. Dokos calls animal control for Guster\n                      and I was out here on the other.\n                          (pointing to the plane)\n                      Do you mind?\n\n            George hands him the plane and Kurt begins to work the wood.\n\n                                ALYSSA\n                      Are you guys' friends?\n\n                                KURT\n                      We've known each other since grade\n                      school.\n\n                                ALYSSA\n                      I mean, but did you both go camping on\n                      weekends?  Listen to music?  Masturbate\n                      together?  Talk on the phone?\n\n            George doesn't answer and Kurt keeps working.\n\n                                KURT\n                      Hunted rabbit in the hills.\n\n            Alyssa stares at George, disappointed.\n\n                                GEORGE\n                      I aimed high.\n\n                                KURT\n                      We just weren't very much alike, I guess. \n                      I don't know.\n                          (casually; to George)\n                      I liked your dad more than I liked you.\n\n                                ALYSSA\n                      I wouldn't want you as a friend.\n\n                                KURT\n                      George just never really...aimed that\n                      high.  Even with not hitting a rabbit.  I \n                      knew you were doing that, by the way. \n                      That's why I stopped doing it with you. \n                      You were no fun.  It was always like you\n                      were frightened.  Quiet and boring.\n\n            Kurt is beginning to perspire as he shaves food off the beam\n            for Guster.\n\n                                ALYSSA\n                      Funny how he's the architect and you're\n                      just a loud mouth cop.\n\n                                KURT\n                      He builds models for architects.  His\n                      dad, on the other hand, was the real\n                      deal.  Designed and built the coolest\n                      houses I've ever seen.\n\n                                GEORGE\n                      Was bankrupt and dead before I was\n                      twenty.\n\n                                KURT\n                      Left you this place.\n\n                                GEORGE\n                      It was in my name so he wouldn't lose it. \n                      He stole it from everyone that deserved\n                      it by putting me on title.\n\n                                KURT\n                      Do you know what I'd give to have this! \n                      Forget how I got it!  I can't afford dirt\n                      in this town.  I live in Riverside,\n                      Goddammitt  And you get to piss in the\n                      ocean.\n\n            Kurt stops working and steps back.\n\n                                KURT (CONT'D)\n                      Your kid was down around Diver's Cover\n                      again, smoking pot.  I didn't write him\n                      up...told him I wouldn't tell you...\n\n                                GEORGE\n                      Thanks for telling me.\n\n                                KURT\n                      At least your father tried, George.\n\n            Kurt walks to his car and drives off.  There's a moment of\n            awkwardness with Alyssa.  George walks into his house leaving\n            Alyssa with Guster.\n\n            INT. WEBBER'S KITCHEN - AFTERNOON\n\n            Robin is sitting at the kitchen counter, cutting carrots;\n            through the French doors, she's able to watch Ryan and Adam,\n            along with a few friends, play in the pool.\n\n                                GEORGE (O.S.)\n                      I could be anyone.\n\n            Robin jerks with fright as half the carrots roll to the\n            floor.\n\n                                ROBIN\n                      Then why do you stay you?\n\n            George picks up the carrots and washes them in the sink.\n\n                                GEORGE\n                      You should lock your doors. \n\n                                ROBIN\n                      Ring the bell before you try the door.\n\n            George bites into a carrot as Robin starts chopping again.\n\n                                ROBIN (CONT'D)\n                      Did Sam call to tell you he wouldn't be\n                      over this weekend?\n\n                                GEORGE\n                      You let him pierce his nose?\n\n            Robin snatches the carrot from George's hand and chops it up.\n\n                                ROBIN\n                      Lock the door behind you.\n\n                                GEORGE\n                      Where is he?\n\n                                ROBIN\n                      Where he always is.\n\n            George takes Robin's hand and removes the knife.\n\n                                GEORGE\n                      Not that I don't trust you.\n\n            As George lets go, Robin holds on; he appears surprised by\n            her grip of his wrist.  Robin's eyes well with tears.\n\n                                GEORGE (CONT'D)\n                      I should have knocked.\n\n            George is clearly not comfortable with his ex-wife's hold of\n            him, with her tears.\n\n                                ROBIN\n                      What kind of a mother can't stand her\n                      son?\n\n            George jerks his arm away from her grip.\n\n                                GEORGE\n                      I don't know.\n\n            INT. WEBBER'S UPSTAIRS HALL - AFTERNOON\n\n            George is tense and he walks to Sam's door and KNOCKS.\n\n                                GEORGE\n                      Why aren't you coming in for the weekend?\n                          (beat)\n                      Sam?!\n\n            Nothing.  George tries the door - it's locked.  Frustrated,\n            he walks back down the hall and down the stairs.\n\n            INT. WEBBER'S KITCHEN - AFTERNOON\n\n            Outside, the boys are engaged in a raucous version of Marco\n            Polo.  Robin is at the sink; she holds her hair back with one\n            hand and splashes water on her face with the other.  George\n            walks by outside, carrying a ladder.\n\n            EXT. WEBBER'S BACKYARD - AFTERNOON\n\n            Ryan is the first to notice  George.\n\n                                ADAM\n                      Marco!\n\n                                RYAN\n                      What are you doing?\n\n                                ADAM\n                      I'm not cheating!  I'm not looking!\n\n            Robin wipes her face with a hand towel as she rushes out.\n\n                                ROBIN\n                      What are you doing?\n\n                                GEORGE\n                      He doesn't answer.\n\n            The boys have stopped playing; Adam opens his eyes.\n\n                                ROBIN\n                      He never answers.\n\n                                GEORGE\n                      Why does he have a lock on his door?\n\n                                ROBIN\n                      Because he put the lock on!  Do you think\n                      I told him he could have a nose ring?! \n                      Why do you ask me everything you should\n                      ask him!?  I don't know anything,\n                      anymore!\n\n            The boys line up against the edge of the pool and watch\n            George extend the ladder against the house and climb.\n\n                                ROBIN (CONT'D)\n                      You climb up there and tell him what he\n                      can and can't do.  Take him for the\n                      summer, okay?  Whip him into shape.  Cut\n                      his hair.  Make him smile.  Let him hate\n                      you for a while!\n                          (sadly)\n                      You're too late for heroics, George.\n\n            George lops a leg over the railing and steps onto the bedroom\n            balcony.  He peers into the room through the sliding glass\n            door and tries to open it (locked) before removing the screen\n            to the small open window beside it.  He climbs in.\n\n            INT. SAM'S ROOM - AFTERNOON\n\n            Sam is asleep on his bed in his underwear, wearing\n            headphones.  On the floor is an aerosol can of whipping\n            cream.  George picks up the can and tosses it in the trash. \n            He focuses back on his son with his nose ring, earrings, blue\n            eyeshadow and thin, pale white body.  Sam is soundly asleep. \n            George gently removes the headphones from his son's head;\n            drum heavy music surges from the small, padded speakers.\n\n                                GEORGE\n                      You need every brain cell you've got.\n\n            A KNOCK on the door stirs Sam more than his father's voice.\n\n                                SAM\n                          (half-asleep)\n                      Leave me alone!\n\n            Sam's eyes are still closed as he shifts onto his side. \n            George opens the door; Robin is weak and weepy.\n\n                                ROBIN\n                      I don't know what to do, anymore.  Take\n                      him.  You take him.\n                          (hostile)\n                      You're such a good father.\n\n            George walks out of the room, around Robin and down the\n            stairs without a word.  Sam stirs at the sound and sits up to\n            confront his mother.\n\n                                SAM\n                      What are you doing in my room?\n\n                                ROBIN\n                      I didn't go in your room.\n\n                                SAM\n                      I locked the door!  Get out!  I locked\n                      the door!  Get out!\n\n            EXT. WEBBER'S UPSTAIRS HALLWAY - AFTERNOON\n\n            Robin grabs the door and closes it quickly, but doesn't move.\n\n                                SAM (O.S.)\n                      Stupid bitch!  Liar!  I locked the door! \n                      I don't sneak around your room!  Liar!\n\n            INT. SAM'S ROOM - AFTERNOON\n\n            Sam rushes over to the window and stares down at the screen\n            and ladder.  Ryan, Adam and their friends are still in the\n            pool, holding onto the coping, staring up at Sam.  Sam slams\n            the window shut and searches for the can of whipping cream. \n            He gets down on his knees to search under the bed.  Standing\n            and making one more pass of the room, he notices the can in\n            the trash.  He instantly focuses all his rage at the closed\n            door.\n\n                                SAM\n                      This is my room!  You have no right in\n                      here!  This is mine!\n\n            INT. WEBBER'S UPSTAIRS HALLWAY - AFTERNOON\n\n            Robin is sitting on the floor at the top of the stairs,\n            staring blankly down at the foyer of this modernist mansion.\n\n                                SAM (O.S.)\n                      Why can't you all just die and leave me\n                      alone!\n\n            EXT. DOWNTOWN LOS ANGELES - MORNING\n\n            The traffic is thick and loud and the sky is a blanket of\n            brown as George makes his way down a sidewalk mixed with\n            professionals and panhandlers.  Suddenly sick, George rushes\n            to the side of a building and vomits.\n\n            INT. BENSON, KIDDLER, FEINSILBER AND ASSOICATES - MORNING\n\n            George wipes a clump of wet paper towel against the vomit\n            stain on his cuff as he walks through the pockets of cubicles\n            to a large enclosed office.  A SECRETARY smiles as she stands\n            up from her desk and opens the door.\n\n                                SECRETARY\n                      Good morning.\n\n                                GEORGE\n                      Is there a...\n\n            He holds out the wad of wet paper towels, but before he can\n            say trashcan, BRYAN BURKE stands up from behind his desk.\n\n                                BRYAN\n                      George, have a seat!  I've got juice.\n\n            INT. BRYAN BURKE'S OFFICE - MORNING\n\n            George steps in and the secretary closes the door to the\n            office.  Bryan approaches with his arm outstretched, but\n            George can only raise the paper towels.\n\n                                GEORGE\n                      A bird caught me.\n\n            Bryan grabs a trashcan and holds it up; George tosses the\n            ball into the trash and sits down.\n\n                                BRYAN\n                      Orange juice...croissant?\n\n            Bryan motions with his hand as he sits.\n\n                                GEORGE\n                      I'm good, thanks.\n\n                                BRYAN\n                      What are you on?\n\n                                GEORGE\n                      Pardon me?\n\n                                BRYAN\n                      how much weight have you lost?\n\n                                GEORGE\n                      Oh...nothing.  Thirty pounds.  I just\n                      haven't been very hungry.\n\n                                BRYAN\n                      How's your wife?\n\n                                GEORGE\n                      When we divorce a decade ago, she was\n                      very, very angry.\n                          (beat)\n                      Now she's just hostile.\n\n            Bryan nods and laughs as he takes a chunk of croissant and\n            chews as he talks.\n\n                                BRYAN\n                      Right...she married...what was he?\n\n                                GEORGE\n                      He buys and sells the world.\n\n                                BRYAN\n                      Peter Webber!  Right.  Quite the\n                      spotlight on that guy.\n\n                                GEORGE\n                      I did tell you, didn't I?  That I'd be\n                      ready to start the Berlin model today?\n\n                                BRYAN\n                      Well, that's sort of...you're sure you're\n                      not hungry?\n\n            Bryan is anxious as he holds up the rest of the croissant. \n            George shakes his head \"no\".  Bryan tosses his croissant into\n            the trash can and leans forward.\n\n                                BRYAN (CONT'D)\n                      This isn't me.\n                          (beat)\n                      We can show clients endless options,\n                      change anything in a matter of hours on\n                      the computer.  But you won't change.\n\n                                GEORGE\n                      Typing and clicking myself to renderings\n                      isn't why I started building models.\n\n                                BRYAN\n                      All of us are typing and clicking,\n                      George.  Whether we want to, or not.\n\n                                GEORGE\n                      I'm not.\n\n                                BRYAN\n                      Which is why we bid out a quarter of our\n                      projects.  It doesn't make a lot of sense\n                      anymore to want what we don't have and\n                      don't want what we do.\n\n            George glances around the office, angered by the thought he's\n            being fired.\n\n                                GEORGE\n                      I've been here twenty years.\n\n                                BRYAN\n                      Maybe that's too long.\n\n                                GEORGE\n                          (hopeful)\n                      Maybe...?\n\n                                BRYAN\n                      That's too long.\n\n            George nods as he stares at Bryan.\n\n                                BRYAN (CONT'D)\n                      Listen, they decided on a week a year\n                      severance, but I got them to twenty-six. \n                      That's six months salary, George. \n                      Medical and everything for six months. \n                      You can learn all you need to on the\n                      computer long before that.  Maybe find a\n                      job closer to home.\n\n            Bryan is rattled by George's blank stare.  He takes his glass\n            of orange juice and sits back in his chair, taking a sip, all\n            the while keeping an eye on George.\n\n                                GEORGE\n                      My wife left me because I wasn't...very\n                      emotional.  I kept trying to explain that\n                      my father sucked all the emotion from me. \n                      Drunks do that, sometimes.  Make their\n                      kids afraid.  Make them unwilling to\n                      express themselves.\n\n            Bryan knows he's supposed to say something, he just can't\n            seem to figure out what.\n\n                                BRYAN\n                      Oh.\n\n                                GEORGE\n                      How old are you?\n\n                                BRYAN\n                      Forty.\n\n                                GEORGE\n                      We were probably in school together.  You\n                      went to Berkley?\n\n            Bryan lights up at the sound of his Alma matter.\n\n                                BRYAN\n                      Class of eighty-six!  I didn't know you\n                      were there.\n\n                                GEORGE\n                      I was a sophomore when I got the call my\n                      parents were dead.\n\n            This is not the direction Bryan had hoped the conversation\n            was headed.\n\n                                GEORGE (CONT'D)\n                      My dad had a blood alcohol level of .18. \n                      A little high.  Drove right into oncoming\n                      traffic.  Killed my mother with him.  A\n                      lady in another car.  Hurt her daughter. \n                      A five-year old girl.  I think about her\n                      still.\n\n            Bryan wants this to end.  He leans forward with a whisper.\n\n                                BRYAN\n                      Listen...maybe I can get you a year.\n\n                                GEORGE\n                      I hate this job.\n\n                                BRYAN\n                      What are you talking about?  You love\n                      your job.\n\n                                GEORGE\n                      From the day I started...to today.  Can't\n                      stand it.\n\n            Bryan is perplexed as George stands.\n\n                                BRYAN\n                      Then it sounds like I'm doing you a\n                      favor.\n\n                                GEORGE\n                      It may sound that way, but I react out of\n                      fear.  My life has nothing to do with\n                      what I like or don't like.  You haven't\n                      been listening, have you?\n\n                                BRYAN\n                      I didn't know there would be a quiz,\n                      George.\n\n                                GEORGE\n                      For everything.\n\n                                BRYAN\n                      Well, I feel better about this now.\n\n                                GEORGE\n                      Good.  I was hoping for that.\n\n            Relieved and not understanding anything about irony, Bryan\n            stands and extends his hand.  George shakes Bryan's hand\n            without malice.\n\n                                GEORGE (CONT'D)\n                      I've got one favor to ask.\n\n                                BRYAN\n                      What can I do for you, George?\n\n                                GEORGE\n                      I built my first model here when I was\n                      twenty.  There are hundreds of them on\n                      shelves around the office.  Twenty years\n                      of my life.  I was wondering if I might\n                      be able to pick a few to keep, to take\n                      home?  Only the ones that really mean\n                      something to me.\n\n            Bryan recoils slightly from the request.\n\n                                BRYAN\n                      Oh, well...those are...I mean, we don't\n                      get to keep our work.  I could maybe ask\n                      them if you could choose one.  But, you\n                      know, frankly George, you were the best. \n                      Computer models can't begin to match the\n                      beauty you gave yours.  They're a part of\n                      this firm.  They inspire me.  I go out\n                      there and sometimes just stare at\n                      something I've designed.  It amazes me. \n                      I would miss that too much.\n                          (beat)\n                      Look, I may be going out on a limb, but\n                      you go out there and look them over,\n                      every single one of them and pick the one\n                      you like the best and take it with you. \n                      Just run it by me first, just in case,\n                      you know...but I'm sure it'll be okay.\n\n                                GEORGE\n                      Thank you.\n\n                                BRYAN\n                      Well, it's the least I can do.\n\n                                GEORGE\n                      Yes, it is.\n\n            George nods and leaves.  Bryan looks lost and guilty again.\n\n            INT. BENSON, KIDDLER, FEINSILBER AND ASSOICATES - MORNING\n\n            George walks around the maze of cubicles back to his own.  He\n            finds an empty box and starts to pack.  Against a wall, a\n            large rack is filled with spools of architectural plans. \n            George pulls one of the plans down, rolls it out and detaches\n            the wooden spool.  Without warning and with a fury hard to\n            fathom, he proceeds to bat and smash a shelf of beautifully\n            rendered models.  Heads pop up in other cubicles as George\n            walks out of his own and armed with a frightening rage,\n            methodically attacks model after model resting on shelves\n            just below massive plate glass windows that frame downtown\n            Los Angeles.  Steven Gardner, who asked for his model without\n            grass, rushes to within feet of George as he witness his\n            creation deconstruct into shards of cardboard and plastic.\n\n                                STEVEN\n                      Mother of God!  Not my house!\n\n            George stops for a second to focus on Steven, but Steven is\n            smart enough to run.  George continues on with the business\n            of disassembling his work.\n\n                                VOICE\n                      Oh, please, please, no!\n\n            The plea is instantly followed by a pathetic low whine. \n            George works up a sweat as he whacks model after model;\n            portions of plastic walls or window splatter the office as\n            though bombed in war.  Bryan Burke's secretary inches as\n            close as she dares.\n\n                                SECRETARY\n                      Uh...Mr. Burke would like a word with\n                      you, George.\n\n            George lowers his stick as he faces her.\n\n                                GEORGE\n                      Oh...okay.\n\n                                SECRETARY\n                      In his office.  When you're able.\n\n                                GEORGE\n                      Thank you.\n\n            With that, George finishes what he began only minutes prior:\n            the complete and utter destruction of every model displayed\n            on every shelf in the office, save one.  Workers huddle\n            together, collectively moaning and moving en mass from the\n            mayhem.  George picks up the sole surviving model in his arms\n            and cradles it carefully as he walks into Bryan Burke's\n            office.\n\n            INT. BRYAN BURKE'S OFFICE - MORNING\n\n            Bryan cowers behind his desk as George enters with his model\n            in one hand and the long wooden stick in the other.\n\n                                GEORGE\n                      I'll take this one, if that's okay?\n\n            It takes Bryan a few aborted attempts to answer before he\n            simply nods.\n\n                                GEORGE (CONT'D)\n                      Thank you for going out on a limb and\n                      allowing me one.\n\n            Bryan nods again, then quivers as George steps forward, leans\n            the stick against the desk and extends his hand.\n\n                                GEORGE (CONT'D)\n                      You're a great architect and a miserable\n                      human being.\n\n            Bryan winces as he extends his hand.  They shake hands and\n            George grabs hold of the stick again.\n\n                                BRYAN\n                      Thank you.\n\n            George walks around the desk and bashes in a model hidden on\n            the floor, one that Bryan had obviously wanted to save.\n\n                                BRYAN (CONT'D)\n                      Oh, fuck!\n\n            George drops the wooden spool and walks out of the office as\n            Bryan garners the courage to stand.\n\n                                BRYAN (CONT'D)\n                      You're not even an architect and you're a\n                      miserable human being.\n\n            George turns around only long enough to answer.\n\n                                GEORGE\n                      You're right.  You win.\n\n            George closes the door behind him.  Bryan stares down at the\n            remains of the model; he gets down on his knees and carefully\n            gathers up the pieces.\n\n            EXT. DOWNTOWN LOS ANGELES - MORNING\n\n            George is sweating as he walks with his box of personal items\n            under one arm and the model under the other.  Dizzy, he stops\n            for a moment and tires to orient himself, glancing one way,\n            then the other before staggering back and pressing himself\n            against the building for support.  Sweat beads and drops from\n            his nose and chin as the song, 'ACROSS THE UNIVERSE' begins\n            by The Beatles.  George sets the box down but clings tightly\n            to the model as he closes his eyes.  \n\n            'Pools of sorrow, waves of joy are drifting through my open\n            mind, possessing them, caressing me...'\n\n            George drops face first to the cement, crushing the model\n            beneath him.\n\n            MONTAGE AS THE SONG CONTINUES\n\n            George is probed and poked by doctor after doctor.  An\n            ultrasound test followed by a CT scan, followed by a MRI\n            results in more tests.\n\n            A flexible tube is slid down George's throat as dye is shot\n            into his body.  'Sounds of laughter, shades of life are\n            ringing through my open view, inciting them, inviting me...' \n\n            A long blunt needle is shoved into George's side for a biopsy\n            of his pancreas.  X-rays are lit and highlighted as doctors\n            ponder the specks, the disease.  \n\n            Finally, George is opened up; nearly bloodless slice through\n            skin, muscle and fat reveals death. 'Limitless undying love,\n            which shines around me like a million suns, which calls me on\n            and on across the universe...' \n\n            George is wheeled down a long hall to the critical care unit. \n            'Nothing's going to change my world, nothing's gonna change\n            my world...'\n\n            INT. HOSPITAL ROOM - EVENING\n\n            George tries to sit up, but falls back as he closes his eyes,\n            opens his eyes, closes his eyes.\n\n                                FEMALE VOICE (O.S.)\n                      That took care of the pain?\n\n            George opens his eyes again as an attractive NURSE enters\n            with a tray of food.\n\n                                GEORGE\n                      I could kiss you.\n\n            The nurse smiles as she lifts the cover off the dinner.\n\n                                GEORGE (CONT'D)\n                      No food.  I'm painless.\n\n            She raises George's bed.\n\n                                GEORGE (CONT'D)\n                      What would you do if you had three or\n                      four months to live?\n\n            The nurse glances over at the other patient in the room,\n            who's sleeping, before answering in a soft voice.\n\n                                NURSE\n                      I'd eat a lot of red meat.\n\n                                GEORGE\n                      Good for you.\n\n            The nurse smiles as she sits down beside the bed.  She fills\n            a spoon with corn and aims it for George's mouth; he accepts\n            the good will, chews and swallows.\n\n                                NURSE\n                      What would you do?\n\n                                GEORGE\n                      I'd build a house.\n\n            George takes another spoonful of food.\n\n                                NURSE\n                      What kind of house?\n\n                                GEORGE\n                      You know what mortise and tenon is?\n\n            The nurse shakes her head \"no\".\n\n                                GEORGE (CONT'D)\n                      I've got every part of it ready.  It's\n                      like a jig saw puzzle...all in pieces\n                      now, just waiting to make sense.  I've\n                      been through design and review...the\n                      planning commission, city council.\n\n            She feeds George another small spoonful of food.\n\n                                NURSE\n                      No one's really said four months is all\n                      you have, have they?\n\n                                GEORGE\n                      Stage four pancreatic cancer.  They\n                      haven't even pretended to offer\n                      treatment.  You tell me, when would you\n                      start eating red meat?\n\n                                NURSE\n                      Can you build a house in four months?\n\n                                GEORGE\n                      I can die trying.\n\n            The nurse rests her hand for a moment on George's cheek.\n\n                                NURSE\n                      Good for you.\n\n                                GEORGE\n                      I haven't been touched in years.\n\n            Suddenly alarmed by her emotion, the nurse removes her hand\n            and stands back away from George.\n\n                                NURSE\n                      I'm sorry, I don't know what that was.\n\n                                GEORGE\n                      A handshake, or you know, someone pats\n                      you on your back through clothes. \n                      Doctors, people who have to touch you. \n                      But not by people who want to.\n\n                                NURSE\n                      No.  A friend... your mother?  Everybody\n                      gets touched by someone they love.\n\n                                GEORGE\n                      Isn't that weird?  I mean, I dated a\n                      little bit after my divorce, for four or\n                      five years.  Six years.  I know when my\n                      son was younger...maybe when he was ten\n                      or eleven even, he'd run up and wrap his\n                      arms around me.\n\n            George suddenly stops to catch his emotion.  The nurse checks\n            the door before walking back to George; she brushes back his\n            hair with both hands, then fingers the curves of his ears,\n            finally resting her thumbs on his lips.\n\n                                NURSE\n                      Oh God, I'm married.\n\n            Feeling guilty, she flees the room, waking the other PATIENT.\n\n                                PATIENT\n                      I'm hungry.\n\n                                GEORGE\n                      I'm touched.\n\n            EXT. SAN JUAN CAPISTRANO TRAIN STATION - AFTERNOON\n\n            George is resting, eyes closed, sitting on a bench with his\n            box and the remnants of the model beside him.  A black Range\n            Rover pulls to a stop with a HONK.  George stands to gather\n            his things as Robin steps out of the car, yelling.\n\n                                ROBIN\n                      I called everyone, everywhere!  You just\n                      vanished!  You could be dead!\n\n                                GEORGE\n                      Thanks for waking me up.  Picking me up. \n                      You're loud today.\n\n                                ROBIN\n                      You're inconsiderate and absolutely\n                      devoid of emotion!\n\n                                GEORGE\n                      You're the most beautiful woman I have\n                      ever known in my life.\n\n            Robin is stumped for a second, confused by the words.\n\n                                ROBIN\n                      What?\n\n                                GEORGE\n                      I'm not talking just physically.  Even\n                      your anger is perfect.\n\n            Robin climbs back in the car and slams her door shut.\n\n            INT. ROBIN'S RANGE ROVER - AFTERNOON\n\n            George sets his box in back and climbs into the front seat as\n            Robin takes off.  He closes his door as she runs a stoplight.\n\n                                GEORGE\n                      I didn't think you'd know I went missing.\n\n                                ROBIN\n                      You didn't think someone from your office\n                      would call and tell me you wrecked the\n                      entire building and threatened people\n                      with a baseball bat?!\n\n                                GEORGE\n                      A blueprint spool.\n\n                                ROBIN\n                      Where have you been for a week?!\n\n                                GEORGE\n                      Four days.  I left to think.\n\n                                ROBIN\n                      What did you do with your dog?\n\n                                GEORGE\n                      Kurt's been feeding him.\n\n                                ROBIN\n                      But you can't call me while you think?\n\n                                GEORGE\n                      I wasn't thinking.  Look, I'm sorry I\n                      didn't think to call you while I\n                      thought...I think.\n\n            George raises his eyebrows, wanting just the slightest give\n            from Robin.  She glances at him, but won't yield.\n\n                                GEORGE (CONT'D)\n                      I need to talk to you.\n\n                                ROBIN\n                      Why would they tow your truck?\n\n                                GEORGE\n                      I was parked in day parking.\n\n                                ROBIN\n                      Why call me?\n\n                                GEORGE\n                      I'm going to tear down the shack and\n                      build my house.\n\n                                ROBIN\n                      You've been saying that for twenty years. \n                      While we were dating, you said it.\n\n                                GEORGE\n                      There's nothing anymore to stop me.\n\n                                ROBIN\n                      Money?\n\n                                GEORGE\n                      Severance pay.  And I'm going to cash in\n                      my life insurance policy.\n\n                                ROBIN\n                      How many years did I live with your beams\n                      and boards?  First in the garage, then in\n                      the living room.  We're going to do it,\n                      Robin.  Next year.  Next year.  Salvaged\n                      floorboards from a house in Pasadena. \n                      Doors from a church in New Hampshire...\n\n                                GEORGE\n                      I love those doors.\n\n                                ROBIN\n                      Where will you live?\n\n                                GEORGE\n                      The garage.\n\n                                ROBIN\n                      Look, I wasn't serious about you taking\n                      Sam, so you don't have to get into any\n                      actual construction to get out of it.\n\n                                GEORGE\n                      When's school over?\n\n                                ROBIN\n                      Friday...God, I hate the thought of him\n                      home all day.\n\n                                GEORGE\n                      I'll be by Saturday to pick him up.\n\n                                ROBIN\n                      He doesn't want to spend the weekends\n                      with you anymore.\n\n                                GEORGE\n                      Not for the weekend.  For the summer.\n\n            Robin scoffs.\n\n                                ROBIN\n                      You and Sam are going to live in a garage\n                      without plumbing for the summer?\n\n                                GEORGE\n                      The garage is plumbed.  I'll put in a\n                      toilet.  We'll survive.\n\n                                ROBIN\n                      Thank you for at least sounding sincere.\n\n                                GEORGE\n                      Sounding?  I need help.  He's cheap\n                      labor.\n\n                                ROBIN\n                      One of you would end up dead.\n\n                                GEORGE\n                      At least we'll have a house to show for\n                      it.\n\n                                ROBIN\n                      Forget it, really.  I'll survive.\n\n                                GEORGE\n                      I want him with me.\n\n                                ROBIN\n                      No, you don't.  Trust me.\n\n            George rests a hand on the back of her neck.\n\n                                GEORGE\n                      I want Sam for the summer.\n\n            Robin furrows her brow for a moment and glances at George. \n            It takes a while for her to answer.\n\n                                ROBIN\n                      Okay.\n\n            George rests his hand on Robin's cheek for a moment, as the\n            nurse had done with him.  Robin turns her head and bites his\n            finger.\n\n                                GEORGE\n                      Hey, hey!\n\n                                ROBIN\n                      I'm married.\n\n            George nods as he mock nurses his finger.\n\n            INT. HIGH SCHOOL HALL - AFTERNOON\n\n            Sam is walking with Corey, who's wiry and wan with a red\n            nose.\n\n                                COREY\n                      The whole summer, man.  Party in Tahoe.\n\n                                SAM\n                      I don't know.\n\n                                COREY\n                      It'll just be my brother the dweeb on\n                      weekends.  All we gotta do is sand and\n                      paint the cabin, dude.\n                          (boasting)\n                      My dad's gonna let me use the boat and my\n                      charm is gonna let me use my rod.  Income\n                      village is the place to hook up with\n                      hump.\n\n                                SAM\n                      I'll ask.\n\n                                COREY\n                      Hey, it beats letting town folk go down\n                      on you for the summer.\n\n            Sam stops which stops Corey.  Sam glances around to make sure\n            no one's listening.\n\n                                SAM\n                      I never said anything.  I haven't done\n                      anything.\n\n                                COREY\n                      I know what the deal is.  Josh is a pimp. \n                      I'm not stupid.\n\n                                SAM\n                      You don't know what the deal is.  There\n                      is no fucking deal.\n\n            Sam walks away pissed that Corey knows what the deal is.\n\n            EXT. GEORGE'S SHACK - MORNING\n\n            George is shirtless, the stitches still fresh on his side; he\n            carries/drags his mattress into the garage.  Alyssa walks\n            from her house to the garage and peeks in.\n\n            INT. GEORGE'S GARAGE - MORNING\n\n            George is making his bed, which is not easy because Guster is\n            curled up on it.  The one car garage is not dry-walled and\n            the cement floor is clean but stained.\n\n                                ALYSSA\n                      Hi, Mr. Nelson.\n\n            George steps away from the bed, slightly rattled by Alyssa.\n\n                                GEORGE\n                      Alyssa.\n\n                                ALYSSA\n                      Why have you put a toilet and a bed in\n                      your garage?\n\n                                GEORGE\n                      I'm living here while I build another\n                      house.\n\n                                ALYSSA\n                      Is that legal?\n\n            Alyssa sits down on the bed beside Guster and starts to\n            bounce up and down.  George takes another step back.\n\n                                GEORGE\n                      Don't you have school?\n\n                                ALYSSA\n                      Nope.\n\n            Alyssa lies down on the bed, lifting the sheet to her nose.\n\n                                ALYSSA (CONT'D)\n                      Are these clean?\n\n            George is alarmed.  Guster licks Alyssa's ear.\n\n                                GEORGE\n                      What's today?\n\n                                ALYSSA\n                      Monday.\n\n            George bangs his head with his hand and starts to search the\n            room.\n\n                                GEORGE\n                      My keys.\n\n                                ALYSSA\n                      What's that?\n\n            Alyssa reaches out and slides a finger down his scar.\n\n                                GEORGE\n                      Nothing.  I cut myself.\n\n            George pats down his pockets.\n\n                                GEORGE (CONT'D)\n                      I had them in my pocket.\n\n                                ALYSSA\n                      I'm not shaving my legs or pits this\n                      summer, I've decided.\n\n            George opens the drawers of a small desk and a chest, not\n            paying attention to Alyssa as she raises her leg and runs her\n            hands down the stubby skin.\n\n                                ALYSSA (CONT'D)\n                      Paula Cole isn't a vertical kisser.\n\n            George dabs his keys from the floor beside the chest.\n\n                                GEORGE\n                      Make the bed for me, would you?  I gotta\n                      run.\n\n            George turns around to Alyssa's leg up and a great view of\n            her underwear.\n\n                                COLLEEN (O.S.)\n                      What are you, forty?\n\n            George whirls around to face Colleen as Alyssa lowers her\n            leg.\n\n                                GEORGE\n                      I forgot where I put my keys.\n\n                                COLLEEN\n                      And you thought they might be under her\n                      dress?\n\n                                ALYSSA\n                      I was just showing him my hair.\n\n            Alyssa miffed as she stands.\n\n                                ALYSSA (CONT'D)\n                      I think you need to rethink what you\n                      think of me.\n\n            Alyssa walks around her mother and out of the garage. \n            Colleen stares at George.\n\n                                GEORGE\n                      Her leg hair.\n\n            Colleen turns and walks out.\n\n            INT. GEORGE'S TRUCK - LATE MORNING\n\n            George drives the four miles North to Robin's house listening\n            to Paula Cole.  He turns into Emerald Bay, a guard-gated\n            community and a Guard waves him in.\n\n            EXT. WEBBER'S HOME - LATE MORNING\n\n            George rushes from his car and tries the front door, but it's\n            locked.  He rings the bell and LOIS, the maid, answers.\n\n                                LOIS\n                      Mrs. Webber is in the backyard.\n\n                                GEORGE\n                      And Sam?\n\n                                LOIS\n                      In his room, packing.\n\n                                GEORGE\n                      Oh...Good.\n\n            INT. SAM'S ROOM - LATE MORNING\n\n            Sam has a CD by MARYLIN MANSON on loud as he packs a suitcase\n            on his bed.  The KNOCK on the door is barely heard.  ANOTHER\n            KNOCK draws his disapproval.\n\n                                GEORGE (O.S.)\n                      Sam!\n\n            Sam's face turns sour as he yanks the door open.\n\n                                GEORGE (CONT'D)\n                      Ready?\n\n            Sam shrugs and returns to finish his packing.\n\n                                GEORGE (CONT'D)\n                      I think you'll have fun this summer.\n\n            It's nearly impossible to hear George over the music.\n\n                                GEORGE (CONT'D)\n                      Don't forget your headphones.\n\n            The music is quickly driving George crazy.\n\n                                GEORGE (CONT'D)\n                      Would you mind turning it down?\n\n            This doesn't register with Sam.\n\n                                GEORGE (CONT'D)\n                      It won't all be work, you know?\n\n            George is once again, seemingly unheard.  He walks to within\n            inches of Sam and grabs his head and yells into Sam's ear.\n\n                                GEORGE (CONT'D)\n                      It won't be all work, you know!\n\n            Sam pulls away from the touch and turns the music off.\n\n                                SAM\n                      I heard you already!\n\n            George walks to the sliding glass door and stares down at the\n            boys and Robin in the pool.\n\n                                GEORGE\n                      Your mom and the boys can drop by\n                      anytime.\n\n                                SAM\n                      To check up on me?\n\n                                GEORGE\n                      I'll be around to check up on you.\n\n                                SAM\n                      Why would you be there?\n\n                                GEORGE\n                      Because I live there.\n\n                                SAM\n                      You live in Cory's parents' cabin?\n\n            EXT. WEBBER'S BACKYARD - LATE MORNING\n\n            Ryan and Adam are on their backs on rafts as Robin swims laps\n            between them.  Suddenly, like a UFO crashing to Earth, Sam's\n            suitcase spirals downward straight into the pool, barely\n            missing both Adam and Ryan.\n\n                                SAM\n                      No fucking way!!!\n\n            The boys are knocked off their rafts as Robin takes off her\n            goggles and focuses on Sam up on his balcony.\n\n                                SAM (CONT'D)\n                      You liar!  You stupid liar!  I hate you!\n\n            George bursts out of the kitchen, onto the patio.\n\n                                GEORGE\n                      Did you tell him he's spending the summer\n                      with me?\n\n                                SAM (O.S.)\n                      No I'm not!\n\n            Sam storms off the balcony, back into his room.\n\n                                ROBIN\n                      What was I supposed to do?  When you\n                      didn't show up Saturday, I tried to call. \n                      Your phone isn't working.\n\n                                GEORGE\n                      I don't have a phone.\n\n                                ROBIN\n                      I drove over and you were gone.\n\n                                GEORGE\n                      I can't leave the house?\n\n                                ROBIN\n                      Last time you were gone for a week!\n\n                                GEORGE\n                      Did you tell him he was spending the\n                      summer with me?\n\n                                ROBIN\n                      No.  I was going to let you do that.\n\n                                GEORGE\n                      He's not spending the summer in Tahoe.\n\n            Sam walks out of the kitchen to confront his father.\n\n                                SAM\n                      Who are you, anyway?  I don't even know\n                      you.\n\n                                GEORGE\n                      You'll know me by the time we're through.  \n\n                                SAM\n                      I'm not going!\n\n                                GEORGE\n                      I'll get your bag.\n\n            George walks to the edge of the pool and scoops up the\n            suitcase, holding it out as it drains.\n\n                                SAM\n                      Mom, tell him I'm not going.  You already\n                      promised me!\n\n                                GEORGE\n                      You have everything?\n\n            Robin is in an uncomfortable position as she glances at Sam\n            before focusing on George.\n\n                                ROBIN\n                      I did say he could go.\n\n                                GEORGE\n                      Let's go.\n\n                                SAM\n                      I'm not going!\n\n                                GEORGE\n                      You don't have a choice.\n\n                                SAM\n                      Mom...please.\n\n            Sam's eyes well with tears as his voice cracks.  Robin is\n            ready to concede.\n\n                                ROBIN\n                      George --\n\n                                GEORGE\n                          (adamant)\n                      He's not spending the entire summer with\n                      another kid in Tahoe.  If he leaves, I\n                      will follow him up there and I will drag\n                      him home by his nose ring.  He can hate\n                      me.  You can hate me.  He can try to kill\n                      me while I sleep.  You can call the\n                      police.  You can call your husband or\n                      your attorney, but Sam is spending the\n                      summer with me.  He's my son.  He's\n                      sixteen.  That's it.\n\n            Sam is crying now -- snot's running down his nose.  Robin is\n            shocked by George's forcefulness.\n\n                                ADAM\n                      Can we hate you?\n\n                                GEORGE\n                      You can do anything you want.\n\n            George walks to Sam and touches his arm.\n\n                                GEORGE (CONT'D)\n                      Go get in the truck, Sam.\n\n            Sam jerks away from his dad as dramatically as he can manage.\n\n                                SAM\n                      Go fuck yourself!\n\n            George drops the suitcase and grabs Sam by the arms.  As much\n            as Sam tries to resist, he's clearly no match for his father.\n\n                                GEORGE\n                      Your nose ring comes out of your nose. \n                      If you've got them in your nipples, they\n                      come out, too.  And there's no make-up at\n                      my house.  No glue sniffing.  Huffing. \n                      No pills, no grass.\n\n                                SAM\n                      If you hit me, I'll call the police.\n\n                                GEORGE\n                      You've worn out your welcome at this\n                      house, Sam.  I won't ever hit you. \n                          (beat)\n                      This may well be the worst three months\n                      of your life, but you've earned it.  So,\n                      pick up your suitcase and go get in the\n                      truck.  Now.\n\n                                SAM\n                      I'll hate you forever.\n\n                                GEORGE\n                      You can't even begins to know how much I\n                      hate my father.\n                          (upbeat)\n                      Think of it as a family tradition.\n\n            Sam glares at his mother before grabbing his soggy suitcase\n            and stomping out of the backyard.  Robin is stunned silent by\n            George's decisiveness.\n\n            INT. GEORGE'S TRUCK - LATE MORNING\n\n            Sam is pressed against the passenger side door.  George walks\n            from the backyard and opens the truck door to climb in but is\n            stopped by Sam's suitcase.  He lifts it out and sets it in\n            the bed, then slides into the cab, sitting on the soaked\n            seat.  George rises up and turns to Sam, who is sullen and\n            silent.\n\n            EXT. GEORGE'S SHACK - AFTERNOON\n\n            Sam is shirtless on his back on the roof of the shack,\n            sunning himself as George struggles to extricate a sofa from\n            a doorjamb.  Guster is asleep on the grass, under a tree.\n\n                                GEORGE\n                      Sam?  I'm...for like three minutes?\n\n            After another bout of trying, George drops the sofa and steps\n            back to glance up at Sam.\n\n                                GEORGE (CONT'D)\n                      That's okay.  If I break my back, daddy's\n                      gonna buy you a naval ring.\n\n            No reaction from Sam.\n\n                                GEORGE (CONT'D)\n                      And if that naval ring don't fit, daddy's\n                      gonna rub you down with the sun screen.\n\n            Sam glances down at his father, puzzled by the verse.\n\n                                GEORGE (O.S.) (CONT'D)\n                      I want you wearing sun block.  And I want\n                      you down here to help me.  Now.\n\n            Sam dismisses his father without a word - he simply adjusts\n            his face back to the sun.  George walks away.  A sudden spray\n            of water drenches Sam, forcing him to his feet in a cold\n            panic.  George stops the hose water pelting.\n\n                                GEORGE (CONT'D)\n                      It works on Guster.\n\n            MOMENTS LATER\n\n            George is still struggling with the sofa stuck in the door. \n            Frustrated, he steps away from the sofa.\n\n                                GEORGE (CONT'D)\n                      You're in there not helping at all,\n                      aren't you?\n\n            INT. BEACH SHACK ENTRY - CONTINUOUS\n\n            Sam is leaning against a wall with his arms folded across his\n            chest.\n\n                                GEORGE (O.S.)\n                      You know what else helped Guster? \n                      Neutering.\n\n            The slightest alarm crosses Sam's face.\n\n            INT. GEORGE'S GARAGE - EVENING\n\n            George is shirtless in shorts, boiling pasta on a portable\n            stove as he heats a sauce in the microwave.  A dresser topped\n            with plyboard serves as a countertop; other than a sink being\n            across the garage near the toilet, this is a fairly well\n            equipped makeshift kitchen.\n\n                                GEORGE\n                      Do you want garlic bread?!\n\n            George waits a bit to make sure no response is no response. \n            Then stuffs a hunk of garlic bread into the toaster oven.\n\n            EXT. GEORGE'S GARAGE - EVENING\n\n            Sam is sitting on the edge of a cliff that drops twenty feet\n            to the ocean; Guster is whining for attention behind Sam.\n\n                                SAM\n                      Well, get over here, then, stupid.\n\n            Guster inches forward on his belly, which makes Sam smile.\n\n                                SAM (CONT'D)\n                      Are you afraid of heights, Guster?\n\n            Sam drops to his belly and stretches out to pet Guster.\n\n                                SAM (CONT'D)\n                      The fall probably wouldn't kill me,\n                      anyway.\n\n            Guster inches closer and licks Sam's face.  George walks out\n            with a tray filled with spaghetti, garlic bread and a Coke.\n\n                                GEORGE\n                      Thinking of jumping?\n\n            George sets the tray on the ground beside Sam.\n\n                                SAM\n                      Pushing.\n\n            George walks to the edge of the cliff.\n\n                                GEORGE\n                      Only jump after you hear the wave crash\n                      against the rock.  The water will take\n                      you out.  Let it.  Swim a little North\n                      and you'll see the sand.\n\n            Sam sits up and faces his father with a trace of alarm.\n\n                                GEORGE (CONT'D)\n                      First time I did it, younger than you, I\n                      thought I'd break my neck and just sort\n                      of float to Catalina.\n                          (beat)\n                      You don't always get what you wish for,\n                      Sam.\n\n            George suddenly leaps forward and disappears into the sea as\n            a wave crashes against the rocks below.\n\n                                SAM\n                      Oh, shit!\n\n            Sam scurries to his feet and scans the ocean for his father;\n            the only thing visible is darkness.\n\n                                SAM (CONT'D)\n                      Hello?\n\n            Guster is lapping up the dinner, bread and all as Sam calls\n            out again.  In a bit of a panic, Sam runs from the cliff.\n\n            EXT. PACIFIC COAST HIGHWAY - EVENING\n\n            The traffic is heavy as Sam runs against it.  Without a\n            sidewalk and with parked cars blocking a reasonable path,\n            this is a dangerous trek North.\n\n            EXT. ALISO CREEK BEACH - EVENING\n\n            Sam runs to the edge of the water and anxiously waits for his\n            father to emerge from the sea.  A jogger startles Sam - he\n            steps into a wave that soaks his shoes.  George floats on a\n            wave into view and stands in waist high water, only to be\n            knocked way back down.  He rises and falls and rises before\n            making his way to the sand and Sam.\n\n                                SAM\n                      Are you totally insane?!\n\n                                GEORGE\n                      I almost saw Catalina.\n\n            George coughs and drops onto the sand exhausted.  Sam storms\n            off, angry that he cared enough to get angry.\n\n            EXT. GEORGE'S SHACK - EVENING\n\n            Sam is winded as he walks off the street to the middle of the\n            yard.  He glances around for Guster.\n\n                                SAM\n                      Guster!\n\n            Guster bounces out of the garage with spaghetti sauce\n            covering his muzzle.\n\n                                SAM (CONT'D)\n                      You're so busted, dude.\n\n            Sam sits down on the grass and plays with Guster, who yaps\n            with joy as he breaks away and closes the distance with the\n            abandon of a puppy.\n\n                                SAM (CONT'D)\n                      Where's my dinner, huh?\n\n            Sam manages to pin Guster on his back.  He looms over the dog\n            as he kisses him on the nose.\n\n                                SAM (CONT'D)\n                      I'm hungry!  Where's my dinner?  Who ate\n                      my dinner?  Huh?  Who's in trouble now?\n\n                                ALYSSA (O.S.)\n                      Hi.\n\n            Sam rolls over Guster and stands, nearly stumbling in the\n            process - way uncool.\n\n                                SAM\n                      Hey.\n\n                                ALYSSA\n                      What are you doing here?\n\n            Guster bumps against Alyssa for her attention; she kneels\n            down to pet him.\n\n                                SAM\n                      They're trying to make me spend the\n                      summer here.  I'm leaving in the morning.\n\n                                ALYSSA\n                      Where to?\n\n                                SAM\n                      I'm supposed to be in Tahoe.\n\n                                ALYSSA\n                      Your dad's really gonna build his house?\n\n                                SAM\n                      I don't know.\n\n                                ALYSSA\n                      Well, if you don't go, I guess I'll see\n                      you.\n\n            Alyssa stands.  Sam is clearly shy around her.\n\n                                ALYSSA (CONT'D)\n                      You should stay.\n\n                                SAM\n                      I don't know.\n\n                                ALYSSA\n                      Where's your dad?\n\n                                SAM\n                      He jumped into the ocean.\n\n                                ALYSSA\n                      Tell him I said \"hi\".\n\n            Alyssa pets Guster again before walking away.  Sam is\n            smitten.\n\n            INT. GEORGE'S GARAGE - NIGHT\n\n            Sam's curled up in a tattered lazy-boy near the toilet,\n            watching television as George sits on the bed, brushing his\n            teeth.  Suddenly, Sam turns to face his dad.\n\n                                SAM\n                      I'm not taking a dump with you in here.\n\n            George nods as he continues brushing.\n\n                                SAM (CONT'D)\n                      My brothers say it's the worst smell\n                      they've ever smelled.\n\n            George nods again, which appears only to irritate Sam.\n\n                                SAM (CONT'D)\n                      I think you have to have a door between\n                      where you cook and where you crap.  Like\n                      even in the bush, tribal people and like\n                      that have a place for both.  It's like a\n                      law.\n\n            George walks around Sam to the sink and spits, rinses and\n            wipes his mouth with a towel.  He faces Sam.\n\n                                GEORGE\n                      Which side of the bed do you want?\n\n            Sam's jaw drops as he glances at the double-bed.\n\n                                GEORGE (CONT'D)\n                      Just kidding.  The sofa's a pullout.\n\n            George smiles and pats Sam on the shoulder before walking to\n            the sofa and pulling it out to make a bed.\n\n                                SAM\n                      Probably in the bible.\n\n                                GEORGE\n                      Goodnight.\n\n            George drops his pants and climbs into bed.  He pulls the\n            sheet up and fluffs the pillow before resting his head.\n\n                                SAM\n                      I have to take a dump.\n\n            George twists around in bed to face Sam.  After a beat, he\n            tosses the sheet back, climbs out of bed, pulls back on his\n            pants, slips on his shoes and walks out of the garage.\n\n            EXT. GEORGE'S SHACK - MORNING\n\n            George is up on the roof, hacking through the shingles and\n            beams with a chain saw.  A huge dumpster set on the lawn\n            receives only about half the throws George makes.  Sam is\n            near the ocean in a chaise lounge, listening to music through\n            his portable CD player.\n\n                                GEORGE\n                      Have you got sunscreen on?\n\n            There's no chance he's been heard.  TOM and BARBARA, two\n            older neighbors of George's nearing home from a walk, stop on\n            the driveway - both look pleased.\n\n                                BARBARA\n                      It's about time this shack is torn down.\n\n            Barbara appears surprised as George turns to face them - she\n            obviously didn't realize he was the one up on the roof doing\n            the demolition.\n\n                                TOM\n                      Oh, hello George.\n\n                                GEORGE\n                      Guess how many low-income apartments the\n                      city approved for this lot?\n\n            Tom and Barbara react by trying not to react.\n\n                                GEORGE (CONT'D)\n                      Come on...ballpark figure.\n\n            Tom and Barbara step back and walk away.  George heads to the\n            ladder and climbs down.\n\n            ANOTHER VIEW\n\n            Sam is grooving to the music with his eyes closed as George's\n            hand, filled with a gob of sunscreen, plops onto Sam's\n            stomach.  Sam bolts up from the chaise lounge in a rage.\n\n                                SAM\n                      What are you doing?!\n\n                                GEORGE\n                      I warned you yesterday.\n\n                                SAM\n                      Don't touch me!  You can't touch me!\n\n                                ALYSSA (O.S.)\n                      Hey, you stayed.\n\n            Alyssa walks across her lawn to the feuding family.  George\n            holds out the bottle of sun lotion to Alyssa.\n\n                                GEORGE\n                      Rub him down, please.\n\n            George walks back to the ladder and up onto the roof as\n            Alyssa and Sam stare at one another.\n\n                                SAM\n                      He's a freak.\n\n                                ALYSSA\n                      You look better without make-up.\n\n                                SAM\n                      I can't even take a shower here.\n\n                                ALYSSA\n                      Come over to my house whenever you want. \n                      I'll tell my mom.\n\n                                SAM\n                      I might not stay, anyway.\n\n                                ALYSSA\n                      I'll get your back.\n\n                                SAM\n                      No.  That's okay.\n\n            Sam reaches out for the lotion, but Alyssa hides the bottle.\n\n                                ALYSSA\n                      Have you ever had anyone but your mom or\n                      dad put it on for you?\n\n            Sam thinks about it for a second before shaking his head no.\n\n                                ALYSSA (CONT'D)\n                      It's weird how different it is.  Lay\n                      down.\n\n            George is back with the chain saw, hacking away at the roof. \n            Sam is hesitant as he lies down on his stomach.  Alyssa\n            kneels and squeezes lotion on his back.  She works it in,\n            starting at his neck, working her way down to his pants.  She\n            squirts Sam's arm and as she rubs close to his pit, he\n            squirms.\n\n                                ALYSSA (CONT'D)\n                      Do you remember me from when you lived\n                      here?\n\n                                SAM\n                      Yeah.\n\n                                ALYSSA\n                      Your dad dated my mom after her divorce.\n\n                                SAM\n                      Really?\n\n                                ALYSSA\n                      I wanted him to marry her.\n\n                                SAM\n                      Why?\n\n                                ALYSSA\n                      Turn over.\n\n            Alyssa grabs under his armpits and tickles him.  Sam yelps\n            and rises onto his elbows as Josh roars by the shack in his\n            Porsche.\n\n                                ALYSSA (CONT'D)\n                      Josh and I are going to South Coast. \n                      Wanna ride?  Maybe see a movie?\n\n                                SAM\n                      No thanks.\n\n            Sam is disappointed as Alyssa stands to leave.\n\n                                ALYSSA\n                      Don't forget your front.\n\n            Alyssa walks to the shack and waves goodbye to George. \n            George waves her off.  Sam curls onto his side as he watches\n            Alyssa run across the lawn to Josh.\n\n                                GEORGE\n                      She's pretty...for a girl.\n\n            Sam appears irritated as he stands and walks into the garage.\n\n            INT. GEORGE'S GARAGE - MORNING\n\n            Sam glances out the window to check on his father, then\n            quickly rummages through every drawer and cabinet looking for\n            what he finds: a prescription bottle.  It's Vicodin.  He\n            checks on his dad through the window again, then opens the\n            bottle and takes out five pills.  He fills a glass with water\n            and swallows two, saving three for later.  He sets the bottle\n            back where he found it before he drops on the bed with a\n            grin.\n\n            EXT. GEORGE'S GARAGE - AFTERNOON\n\n            Guster is in a full out run for a rubber ball.  Sam is\n            shirted, sitting at the patio table.  With the ball gladly\n            returned, Sam tosses it again.  George walks out juggling two\n            plates of sandwiches and two Cokes and sits down.\n\n                                GEORGE\n                      Do you ever get like the slightest\n                      inkling that you might want to help me\n                      instead of doing absolutely nothing?\n\n                                SAM\n                      No.\n\n                                GEORGE\n                      Get the inkling, Sam.  I'm getting tired\n                      of your attitude.\n\n            Sam picks up the sandwich, examines it and sets it back down\n            on the plate.\n\n                                SAM\n                      I hate turkey.\n\n                                GEORGE\n                      No you don't.\n\n            George takes a bite of his sandwich before responding.\n\n                                GEORGE (CONT'D)\n                      I want you to take out your nose ring and\n                      leave it out.\n\n                                SAM\n                      Why?\n\n                                GEORGE\n                      It bugs me.\n\n                                SAM\n                      You snore at night.  That bugs me.  Can I\n                      take you out?\n\n                                GEORGE\n                      Your brothers are right.  It was the most\n                      god-awful smell I've ever had my nose\n                      around.\n\n            George tightens his face and waves his hand in front of his\n            nose.  Sam stares at his father.  A black Range Rover pulls\n            to a stop and Robin steps out with a pizza box in her hands.\n\n                                ROBIN\n                      Thought you guys might be hungry.\n\n            As Robin walks up the drive, Sam picks up the turkey sandwich\n            and starts eating.  George glances at Sam as Robin sets the\n            box on the table and sits down.\n\n                                GEORGE\n                      We're fine.  Turkey sandwiches.\n\n                                ROBIN\n                      Well, for later then.\n\n            Robin focuses on the nearly roofless shack.  Guster walks to\n            the table and sits down by Robin, ready to beg.\n\n                                ROBIN (CONT'D)\n                      It makes me sad.\n\n                                GEORGE\n                      What?\n\n                                ROBIN\n                      I used to live here.\n\n                                GEORGE\n                      But you hated four out of the five you\n                      did.\n\n                                ROBIN\n                      I was here six years.  And I only hated\n                      two.\n\n                                GEORGE\n                      Which?\n\n                                ROBIN\n                      The first and the last.\n\n            George sets his sandwich down.\n\n                                GEORGE\n                      I don't even like turkey sandwiches. \n                      What kind of pizza?\n\n                                ROBIN\n                      Sam's favorite.\n\n            George opens the box and pulls out a slice.  Sam appears\n            disinterested as George starts in on the slice of pizza.\n\n                                ROBIN (CONT'D)\n                          (to Sam)\n                      Sure you don't want any?\n\n            Sam shrugs off his mother, looking away.  Robin nods and\n            grabs a piece for herself.\n\n                                ROBIN (CONT'D)\n                      You're too thin, George.  From what you\n                      used to be, anyway.\n\n            George responds with a pleasant face; he's not going to\n            explain his weight loss right now.\n\n                                GEORGE\n                      Why the first and the last?\n\n            Robin sets her slice of pizza down as she studies George.\n\n                                ROBIN\n                      The first because I wasn't sure you\n                      really loved me...the last because I\n                      wasn't sure I really loved you.\n\n            George nods.  Though it may appear that Sam isn't interested\n            in the conversation, his ears are perked.\n\n                                GEORGE\n                      I was up on the roof this morning,\n                      tearing it down and it struck me as\n                      strong as anything ever has.  That I'm\n                      happy today.\n\n                                ROBIN\n                      What have you been before today?\n\n                                GEORGE\n                      It was just that, maybe the way the sun\n                      struck the ocean, the sound of the waves. \n                      It was simple, whatever it was.  Then I\n                      started thinking about the last time I\n                      felt this good.\n                          (beat)\n                      It's been a long time.\n\n                                ROBIN\n                      Do you remember?\n\n                                GEORGE\n                      The only time I can think of for sure, I\n                      was holding onto Sam in the ocean, saving\n                      him from the waves.\n\n            George turns to Sam, who's caught staring at his father.\n\n                                GEORGE (CONT'D)\n                      You head was pressed against my chest.  I\n                      could feel your heart racing.  And I\n                      remember I kissed your hair.\n\n                                ROBIN\n                      We have it on video!  Was that when?  My\n                      parents were down for his sixth birthday! \n                      I remember that.\n\n            Robin inexplicably starts to cry.  She instantly tries to\n            take it back, pressing her hand to her mouth, wiping her\n            eyes, but whatever emotion has her, has her good.  Both\n            George and Sam are confused and concerned.\n\n                                SAM\n                      I have to go.\n\n            She stands and backs away from the table.\n\n                                GEORGE\n                      What is it?  \n\n                                ROBIN\n                      I'm fine.  Nothing.\n                          (beat)\n                      I'll drop by your lunch tomorrow.\n\n            Robin wipes her eyes again as she climbs into her car and\n            drives off.  Sam and George face one another.\n\n                                GEORGE\n                      I don't know.\n\n                                SAM\n                      I'm gonna take a walk.  I need some\n                      money.\n\n                                GEORGE\n                      You'll have money when you work.\n\n                                SAM\n                      You're so predictable.\n\n            Sam sets his sandwich down and grabs a slice of pizza as he\n            stands.  He walks for a few feet, stops and turns around.\n\n                                SAM (CONT'D)\n                      You haven't been happy in ten years?\n\n            He doesn't wait for an answer; as he walks away, Guster\n            follows.  George takes Robin's slice of pizza and drops it on\n            the cement; that's all it takes to turn Guster around.\n\n            INT. ROBIN'S KITCHEN - EVENING\n\n            Robin is sitting alone at the table, doing nothing.  The TV\n            is on loud in another room.  Adam walks into the room in his\n            pajamas.  He sits down across from his mother at the table. \n            Robin smiles at him.  He smiles back as he scoots his chair\n            closer to the table and extends his arms straight out across\n            the top.  Robin extends her arms and they lock hands near the\n            middle.  Without a word, they hold hands.  Adam lets go and\n            climbs on top of the table, scoots across it with a kiss for\n            his mother before he's gone, sliding off the table on his\n            rear and running back to the TV.\n\n            EXT. GEORGE'S GARAGE - EVENING\n\n            George is on the patio, bending a thin piece of copper\n            tubing.  Sam storms out of the garage, fuming.\n\n                                SAM\n                      No one would blame me if I left!\n\n                                GEORGE\n                      I'd blame you.  I want you here.\n\n                                SAM\n                      I'm not doing it!\n\n                                GEORGE\n                      It'll be fine.\n\n                                SAM\n                      Why don't you just beg some money off my\n                      dad and move into something decent with a\n                      real kitchen and a real bathroom?\n\n                                GEORGE\n                      I'd rather sell my nuts to a castrati.\n\n            Sam screws his face down - huh?\n\n                                GEORGE (CONT'D)\n                      I don't beg.\n\n                                SAM\n                      And I don't take a shower in the middle\n                      of the yard.\n\n                                GEORGE\n                      I can promise you complete privacy.\n\n                                SAM\n                      You can't promise me anything!  You don't\n                      have anything to promise!  You live in a\n                      garage!  You don't have cable!  You're\n                      not hooked up to the internet because you\n                      don't even own a computer!  You don't\n                      have a job!\n\n            George finishes bending the copper into a circle.  He stands\n            and holds the copper circle out for proof of privacy.\n\n                                GEORGE\n                      This will save you from prying eyes.\n\n            Sam dismisses his father with a shake of his head.  He heads\n            back into the garage.\n\n            INT. GEORGE'S GARAGE - EVENING\n\n            Sam quickly heads to where George's prescription bottle was\n            hidden under a pile of underwear.  He steals two more pills\n            and swallows them before grabbing a towel and walking out.\n\n            EXT. GEORGE'S GARAGE - EVENING\n\n                                SAM\n                      If you had a stupid phone or I could use\n                      your truck, mom would give me some money.\n\n                                GEORGE\n                      You'll have money when you work for it.\n\n            Sam stomps down the driveway and across the grass to Alyssa's\n            house.  George walks around to the back of his garage with\n            the rounded copper tubing.\n\n            EXT. ALYSSA'S HOUSE - EVENING\n\n            Sam is standing on the porch with his towel and clean\n            clothes.  Colleen answers the door.\n\n                                SAM\n                      Is Alyssa home?\n\n                                COLLEEN\n                      She's out with a friend.\n\n                                SAM\n                      Oh...do you know when she'll be home?\n\n                                COLLEEN\n                      She didn't really say.\n\n                                SAM\n                      Oh...okay.\n\n            Sam nods and steps back as he prepares to leave.\n\n                                COLLEEN\n                      Sam?\n\n                                SAM\n                      Uh huh.\n\n                                COLLEEN\n                      I didn't recognize you!\n\n                                SAM\n                      I'm sorry.\n\n                                COLLEEN\n                      Alyssa said you don't even have plumbing\n                      over there.\n\n                                SAM\n                      Not a shower.\n\n            Colleen takes Sam by the arm and nudges him into the house.\n\n            INT. ALYSSA'S ROOM - EVENING\n\n            Sam is slowly making his way around the room, taking note of\n            everything: some dried flowers; a yearbook; a cabinet full of\n            CD's; dirty clothes stuffed in a hamper.  He walks into the\n            bathroom before walking back out and making one more round.\n\n            INT. ROBIN'S FAMILY ROOM - EVENING\n\n            Robin is sitting between her sons on the sofa, watching a\n            movie.  Peter enters the room, carrying his jacket.\n\n                                PETER\n                      The goddamn traffic.  Were we going out\n                      to dinner?\n\n            Robin focuses on her husband, but the boys are riveted to the\n            television.\n\n                                ROBIN\n                      We've eaten.\n\n                                PETER\n                      Is Lois still here?  I'm starved.\n\n                                ROBIN\n                      I'll make you something.\n\n            Robin stands as Adam and Ryan try to hold her down.\n\n                                PETER\n                      Did someone call to tell you I'd be late?\n\n            Robin walks into the kitchen without responding.\n\n            INT. ALYSSA'S BATHROOM - EVENING\n\n            Sam's in the shower, obscured by the sandblasted glass.\n\n                                JOSH (O.S.)\n                      Bro, I need you tonight.\n\n            Sam bumps an elbow against the glass as he opens the shower\n            door enough to look out.  Josh is sitting up on the marble\n            countertop.\n\n                                SAM\n                      I locked the door.\n\n            Josh holds up a tiny screwdriver.\n\n                                JOSH\n                      It'll take you like twenty, thirty\n                      minutes.\n\n                                SAM\n                      Does Alyssa know?\n\n                                JOSH\n                      Nothing.\n\n                                SAM\n                      You got any weed?\n\n                                JOSH\n                      You got the money?\n\n            Sam waits a beat before closing the shower door.\n\n                                JOSH (CONT'D)\n                      Alyssa sent me up to see if you wanted to\n                      hang around and watch a movie with her\n                      and her mom.\n\n            EXT. GEORGE'S GARAGE - EVENING\n\n            The round copper tube is braced and nailed to the side of the\n            garage; on it hangs a shower curtain.  George is making\n            noises inside the curtain as he showers.\n\n                                GEORGE\n                      Ah!  Oh....\n\n                                KURT (O.S.)\n                      I know there's an explanation.\n\n            George pulls back the shower curtains just enough to see Kurt\n            standing by in his police uniform.\n\n                                GEORGE\n                      No hot water.\n\n            George is shivering as he closes the curtain back up.\n\n                                KURT\n                      Mr. Dokos called to complain that you and\n                      a boy are squatting illegally in the\n                      garage of your house.\n\n                                GEORGE\n                      Check the permits.  It was built as a\n                      guesthouse.  It's a legally rentable unit\n                      grandfathered when South Laguna was\n                      incorporated.\n\n            Without warning, the copper tubing holding the hanging\n            curtain falls to the ground.  George turns the water off and\n            grabs a towel.  Unfortunately, his ass is not what the towel\n            covers.\n\n                                KURT\n                      Now that should be illegal.\n\n            INT. ALYSSA'S FAMILY ROOM - EVENING\n\n            Alyssa and Colleen are curled up on the sofa as Josh and Sam\n            stick their heads in to say goodbye.\n\n                                SAM\n                      Thanks for the shower.\n\n                                COLLEEN\n                      I want you both to stay.\n\n                                ALYSSA\n                      And candy too.\n\n            Alyssa holds up a huge bowl of popcorn and the DVD case.\n\n                                JOSH\n                      I'm gonna give him a ride in my car.\n\n                                ALYSSA\n                      I'll see you tomorrow.\n\n                                COLLEEN\n                      Come over anytime you need to, Sam.\n\n                                SAM\n                      Thanks, I'd like that.  Thank you.\n\n            The only thing keeping Sam from staying is Josh, who jerks\n            him out by the shirt.\n\n            INT. GEORGE'S GARAGE - EVENING\n\n            With Kurt in the only chair, George hands him a cup of coffee\n            and sits down on the pullout sofa, which is pulled out.\n\n                                KURT\n                      I'm surprised he hasn't left.\n\n                                GEORGE\n                      I haven't forced him to work.  I only wet\n                      him down once.  Why would he leave?\n\n            Sam rushes in and grabs a sweater before starting out.\n\n                                SAM\n                      I'm leaving.\n\n                                GEORGE\n                      Hey...hey!\n\n            Sam stops at the door and waits impatiently.\n\n                                GEORGE (CONT'D)\n                      Where are you going?\n\n                                SAM\n                      I don't know.\n\n                                GEORGE\n                      When are you going to be back?\n\n                                SAM\n                      I don't know.\n\n                                GEORGE\n                      Well, until you know, you can't go.\n\n                                SAM\n                      Oh, okay.\n\n            Sam is gone in a flash.  Kurt studies George for a second.\n\n                                GEORGE\n                      I'm not very good at it.  Parenting.\n\n            Kurt nods; agreed, he's not.\n\n            INT. ROBIN'S KITCHEN - EVENING\n\n            Robin arranges an attractive plate of food, which she sticks\n            in the microwave.  Peter walks in wearing different clothes\n            but the same personality.\n\n                                PETER\n                      I hope your ex-husband is equipped for\n                      the havoc of Sam, because it seems\n                      absolutely blissful here tonight.\n\n            He sits down at the table, opening up a newspaper as Robin\n            stares at him.\n\n                                ROBIN\n                      Do you think it's odd your kids don't hug\n                      you?\n\n                                PETER\n                      Should I?\n\n                                ROBIN\n                      It would worry me.\n\n            Peter glances up from the paper, focusing on Robin.\n\n                                PETER\n                      If I let everything that should worry me,\n                      worry me, I'd be dead from worry.\n\n                                ROBIN\n                      What would you be if you asked Adam and\n                      Ryan to run in now and hug you?\n\n                                PETER\n                      I'd be you.\n\n            The answer bothers Robin enough that Peter can't concentrate\n            back on the paper.\n\n                                PETER (CONT'D)\n                      I'll do it if that's what you want.\n\n            Robin walks out of the kitchen.  Peter folds the paper and\n            shoves it across the granite counter.\n\n            INT. JOSH'S PORSCHE - NIGHT\n\n            Sam and Josh are parked on a street that overlooks the Valley\n            East of Laguna Beach.  They share a joint as Josh explains\n            the specifics of the job.\n\n                                JOSH\n                      You don't have to do a thing.  Just get\n                      in and get out.  As quick as you can. \n                      Close your eyes and think of whatever.\n\n            Sam hands the joint to Josh.\n\n                                SAM\n                      What's your deal with Alyssa?\n\n                                JOSH\n                      Don't even...I'm there.\n\n                                SAM\n                      I wasn't sure.\n\n                                JOSH\n                      She wouldn't even fucking go out with\n                      until she was sixteen.  I mean, that's\n                      not even a rule, just her own thing.  She\n                      like figures things out on her own and\n                      then that's it.\n\n            A black Mercedes Benz pulls to a stop a ways down the street. \n            Josh hands Sam a cell phone.\n\n                                JOSH (CONT'D)\n                      If this rings, run.\n\n            Sam is scared and it shows.\n\n                                JOSH (CONT'D)\n                      He already knows everything about what he\n                      can't do.  You can tell him not to even\n                      look at you, if you want.\n\n                                SAM\n                      I'm thinking it's too weird now.\n\n            Josh pulls a baggie of grass and holds it out for Sam, who\n            takes it and stuffs it in his pants pocket.\n\n                                JOSH\n                      It beats working.\n\n            Josh hands Sam the joint.\n\n                                JOSH (CONT'D)\n                      Inhale and get out.\n\n            Sam is quick to inhale, but slow to get out.  Josh takes the\n            joint and Sam steps out.  He walks slowly to the Mercedes,\n            opens the door and climbs in.  Josh turns the CD on to\n            Guster's \"ALL THE WAY UP TO HEAVEN.\"  Sam closes the door to\n            the Mercedes.  'He said to only look up, he said to never\n            look down, down is where we came from...' It's an odd song\n            sung in a happy tempo; a whistling refrain overtakes the\n            lyrics as Josh inhales.  'He said to hope for the best and\n            take a load off my chest.  Soon, I could be happy, and go all\n            the way up to heaven and go all the way back home.' \n\n            With the music loud, Josh misses the police car as it stops\n            behind him without the lights.  Too late for a getaway, he\n            fumbles for his cell phone and tosses the joint out the open\n            window.  The OFFICER approaches the Porsche with his hand on\n            his gun. \n\n                                OFFICER\n                      What did you toss into the brush?\n\n            Josh furtively presses send on his cell phone as he faces the\n            officer with a guilty face.\n\n                                JOSH\n                      Nothing.\n\n            'He said I might need his help, no one gets high on\n            themselves.  I just seem so lonely; he's just trying to be\n            nice and spread around his advice.  I could be happy...'\n\n                                OFFICER\n                      Turn off the music!\n\n            As the music stops, the door to the Mercedes opens and Sam\n            hops out with his pants around his ankles.  The officer\n            notices and walks towards the Mercedes.  The parking lights\n            flash red as the car starts and flees the scene.  Sam yanks\n            up his pants and leaps down the hillside, falling and rolling\n            in the brush as the officer yells for him to stop.  Josh\n            starts his car, but the officer dissuades him from leaving by\n            removing his gun.  Josh turns off the engine.\n\n                                JOSH\n                      Oh, it's working now.\n\n                                OFFICER\n                      What did you toss into the brush?\n\n            Before Josh can feign innocence again, the brush starts to\n            smolder.  Busted.\n\n            EXT. HILLSIDE - NIGHT\n\n            Sam is spotted with weeds and dirt as he continues his way\n            down the steep hillside holding up his pants.  After he's\n            sure he's safe, he sits down and rests his head in his hands. \n            He starts to shake, frightened by his actions.  He drops onto\n            his back, buttons and zips his pants as he starts to cry. \n            Slowly, he stops crying, but keeps staring up at the sky,\n            which is loaded with stars and a full moon.  Mesmerized by\n            the brilliant night, Sam can't stop staring.\n\n            EXT. GEORGE'S SHACK - MORNING\n\n            George is removing the last of the windows, carefully prying\n            it out of the casement as Robin pulls up in her Range Rover. \n            She steps out dressed in Levi's, boots and a t-shirt,\n            carrying a large bag.\n\n                                ROBIN\n                      Lunch.\n\n            She smiles and walks toward George, dropping the food sack on\n            the patio table.\n\n                                GEORGE\n                      It's not breakfast yet.\n\n                                ROBIN\n                      I dreamed about your house last night.\n\n                                GEORGE\n                      Finished or unfinished?\n\n                                ROBIN\n                      It was perfect, George.  Amazing.  It was\n                      so real.\n\n                                GEORGE\n                      Didn't you once dream you could lick\n                      people well, though?\n\n                                ROBIN\n                      That wasn't a dream.  That was Sam.\n\n                                GEORGE\n                      Oh...with his ear infection!\n\n                                ROBIN\n                      My tongue around the edge of his ear is\n                      what cured him.\n\n            George isn't quite sure how to take her comment.  Finally, he\n            points to the Garage.\n\n                                GEORGE\n                      Go in there and lick his attitude.\n\n                                ROBIN\n                      The antibiotics weren't working.\n                          (beat)\n                      It's what I believe, George.\n\n            George stares at Robin for a second before he nods.\n\n                                GEORGE\n                      You were wrong about the first year, you\n                      know?\n\n            It takes Robin a second to understand he's saying he loved\n            her when they married.\n\n                                ROBIN\n                      I've been wrong a lot in my life.\n\n                                GEORGE\n                      Hindsight.  It's like foresight without a\n                      future.\n\n            Robin almost smiles; George confessing love ten years dead.\n\n                                ROBIN\n                      I have three hours before I pick up Adam\n                      and Ryan.\n                          (beat)\n                      Where will I be most useful?\n\n            Robin glances around, assessing the best use of her time.\n\n                                GEORGE\n                      With your hands or your tongue?\n\n                                ROBIN\n                      You're not well.\n\n            Robin picks up a pile of splintered board and tosses them in\n            the garbage bin.  George nods...he's not.\n\n            LATER\n\n            Robin and George carry a twelve-foot beam from inside the\n            shack and set it down on cinder blocks.  Both look exhausted\n            as they head back in for another beam.  Sam saunters out of\n            the garage in shorts, sits down on the patio chair and opens\n            the sack his mother had packed for lunch.  He pulls out a\n            peanut butter and jelly sandwich and starts eating as George\n            and Robin emerge from the shack with another beam.\n\n                                GEORGE\n                      Good morning.\n\n            Robin and George set the beam down and turn to Sam as they\n            both wipe sweat off their faces.  Sam chews his sandwich,\n            ignoring them both.\n\n                                ROBIN\n                      I'm late.\n\n            Robin walks close to Sam, trying to capture his attention.\n\n                                ROBIN (CONT'D)\n                      Ryan has a game later.  He asked if you'd\n                      come and watch.\n\n            Sam glances up at his mother, just long enough to let her\n            know he hates her, then drops the sandwich and walks back\n            into the garage.  A city inspector's car pulls to a stop on\n            the street and BOB LARSON steps out with a clipboard.  Robin\n            passes him as she walks back to her Range Rover.\n\n                                BOB\n                      Mr. Stevens?\n\n                                GEORGE\n                      I've been dreading you.\n\n            Bob and George shake hands as Robin drives off.\n\n                                BOB\n                      Bob Larson.  Do you happen to have an\n                      unenclosed toilet in close proximity to a\n                      kitchen?\n\n                                GEORGE\n                      A violation?\n\n                                BOB\n                      Oh, yes.\n\n                                GEORGE\n                      And if I enclosed it?\n\n                                BOB\n                      An exhaust system or a window is code.\n\n                                GEORGE\n                      A sink?\n\n                                BOB\n                      Allowed outside the enclosed area.\n\n            Sam walks out of the garage in long pants and a shirt.\n\n                                SAM\n                      Where is it?\n\n                                GEORGE\n                      A friend of yours is here.\n\n                                SAM\n                      Did you got through my pants?\n\n                                GEORGE\n                      I might have a solution.\n\n            George grabs his chain saw and walks to the garage with Sam\n            and Bob in tow.\n\n                                SAM\n                      Where'd you put it?!\n\n            INT. GARAGE - AFTERNOON\n\n            George walks to an armoire and empties it.  He grabs a hammer\n            and bangs, pries and pulls the back off, then dumps the\n            cabinet onto the floor.\n\n                                SAM\n                      I know you took it.  I want it now!\n\n            George yanks the chain saw to a roar and fashions an oval cut\n            a few feet deep on the cabinet base.  He kills the saw, lifts\n            the armoire and scoots it in front of the toilet.\n\n                                GEORGE\n                      Doors.\n\n            Bob grimaces as George opens the armoire, revealing the\n            toilet inside.\n\n                                BOB\n                      I hate to ask about a window.\n\n                                GEORGE\n                          (to Sam)\n                      I flushed it down the toilet.\n\n                                SAM\n                      No!  Oh my God!\n\n            George jerk starts the chain saw again and fashions a small\n            opening above the toilet, ripping through the studs, wire\n            mesh, tar paper and stucco - fine dust invades the space like\n            a storm.  Bob coughs as he writes in his book.  George kills\n            the chain saw and sets it down as he surveys his work.\n\n                                SAM (CONT'D)\n                      If I had a gun, I'd kill you.\n\n            Bob seems fairly anxious to conclude his business.\n\n                                BOB\n                      I assume you'll fill the...uh, window,\n                      with glass?\n\n                                GEORGE\n                      If that's what it takes.\n\n                                SAM\n                      What's in my pants is none of your\n                      fucking business!\n\n                                BOB\n                          (a little rattled)\n                      I would say you're in compliance.\n\n                                GEORGE\n                      I hope that makes the pain in the ass\n                      that called you happy.\n\n            George is staring at Sam.  Bob backs out of the garage.\n\n                                BOB\n                      You and me both.\n\n            With Bob gone, George walks to Sam and gets in his face.\n\n                                GEORGE\n                      Everything about you is my business. \n                      What you smoke, what you swallow, what\n                      you sniff, it's all my business.\n\n            Sam slams his fists against his own chest, maddened.\n\n                                SAM\n                      I've been using since I was twelve! \n                      You're all so unbelievably stupid.  You\n                      didn't give a shit about anything I did\n                      until now!\n\n                                GEORGE\n                      I'll apologize for everything but\n                      today...Today I give a shit.\n\n                                SAM\n                      You're too fucking late.\n\n                                GEORGE\n                      The gloves on the table are for you.\n\n                                SAM\n                      You can't make me do a thing.\n\n                                GEORGE\n                      Sit down for a second.\n\n                                SAM\n                      No.\n\n            George gently guides Sam back onto the bed.  Sam hops up mad.\n\n                                SAM (CONT'D)\n                      I'll call the cops if you touch me again!\n\n            George sets Sam back onto the bed, not so gently this time. \n            Sam is less eager to hop up in defiance.\n\n                                SAM (CONT'D)\n                      Oh, so you're in the big shit now!  Child\n                      abuse.  People go to prison for what you\n                      just did to me.\n\n                                GEORGE\n                      My dad used to play a game.  I never\n                      really understood what it was until after\n                      he was gone.\n\n            Sam appears immensely disinterested.\n\n                                SAM\n                      I was holding for someone.  That wasn't\n                      even mine.\n\n                                GEORGE\n                      The game was to make me smaller than he\n                      was.  No matter what.  He could be almost\n                      invisible as a human being, but I had to\n                      be smaller.  So if I got good grades, I\n                      was a pussy for not playing football.  If\n                      I cut my hair for him, it wasn't short\n                      enough.  If I shaved it, I looked like a\n                      psycho.  I never won the game.  Not once. \n                      And if he couldn't make me smaller with\n                      words...\n\n            Tears well in George's eyes.  Sam is caught up enough in what\n            his father has to say that he has to feign his lack of\n            interest.\n\n                                SAM\n                      I'll have to pay him back.\n\n                                GEORGE\n                      I won't ever hit you.\n                          (beat)\n                      I don't want you smaller.  I want you to\n                      be happy.  You're not.  Not here with me. \n                      Not home with your mother.  Not up in\n                      Tahoe.  Not alone.  Not anywhere.\n                          (beat)\n                      You're what I was most of my life, Sam. \n                      I see it in your eyes.  In your sleep. \n                      In your answer to everything.  You're\n                      barely alive.\n\n                                SAM\n                      I'm not even listening.\n\n                                GEORGE\n                      You know that great thing, though?  Is\n                      that change can be so constant you don't\n                      even feel the difference until there is\n                      one.  It can be so slow that you don't\n                      even notice that your life is better or\n                      worse, until it is.\n                          (beat)\n                      Or it can just blow you away.  Make you\n                      something different in an instant.  It\n                      happened to me.\n\n            George walks to the garage door as he wipes his eyes.  He\n            stops and turns back around to face Sam.\n\n                                GEORGE (CONT'D)\n                      Build this house with me.\n\n            George walks out leaving Sam on the bed to think.\n\n            EXT. GEORGE'S BEACH SHACK - AFTERNOON\n\n            George gathers a pile of splintered boards and tosses them\n            into the dumpster.  He works while Guster sleeps.\n\n            LATER\n\n            The sun is fierce, low on the horizon with a heat that\n            distorts the distance.  George is sweating and shirtless as\n            Sam walks out of the garage with the gloves on and stands\n            staring at his father.  After a beat, George notices him.\n\n                                SAM\n                      I have to pay back what you flushed down\n                      the toilet.\n                          (beat)\n                      I want ten dollars an hour...then I'm\n                      done.\n\n            George nods.  He points out the roofless shell of a shack.\n\n                                GEORGE\n                      It all has to come down before we can\n                      start again.\n                          (beat)\n                      Knock it down.\n\n            George picks up a sledghammer and hands it to Sam.  Sam\n            hoists the hefty hammer and with some true effort, slams it\n            on a sideboard.  He slams again and again as George picks up\n            a slightly smaller sledgehammer.\n\n                                GEORGE (CONT'D)\n                      I hated this house from the second my\n                      father cheated everyone and put it in my\n                      name.\n\n            George takes a good hard whack at the wall, knocking a huge\n            hunk of it down.  Sam stops to watch.\n\n                                GEORGE (CONT'D)\n                      Twenty years of hating what you live\n                      in...what you are.  This is the end of\n                      it, Sam.  I'm gonna build something of me\n                      here that I can be proud to give to you.\n\n                                SAM\n                      Don't.  I don't want it.\n\n            George YELLS as he lands the hammer into the wall again.  Sam\n            is alarmed by his father's blatant rage.\n\n                                GEORGE\n                      Do whatever you want with it.  I don't\n                      care.  All I want from you is for you to\n                      remember we built this house together.\n\n                                SAM\n                      We haven't build shit.  You're just\n                      tearing down your father.\n\n                                GEORGE\n                      Try it.  It feels good.\n\n            George strikes another blow to the house joined with a MAD\n            WAIL.  Sam starts low, a whisper of a scream, but quickly \n            builds, soon rivaling George in volume as he pounds away. \n            This soul letting, cleansing ritual is both impelling and\n            frightening to watch.  Tom and Barbara, Colleen and her maid\n            step out of their houses, drawn and perplexed by the guttural\n            noise.\n\n            INT. RYAN AND ADAM'S ROOM - MORNING\n\n            Both boys are asleep as Robin enters and wakes them with the\n            drop-and-bounce-back-to-your-feet-from-the-mattress method.\n\n                                ROBIN\n                      It's morning, sleepyheads!\n\n            They both wake with a groan.  Robin leaps onto Adam and\n            tickles him to life.\n\n            INT. ROBIN'S KITCHEN - MORNING\n\n            Robin is quickly finishing a breakfast of oatmeal and fresh\n            fruit with Adam and Ryan, who are still dressed in pajamas.\n\n                                RYAN\n                      Why do we have to get up and eat with you\n                      this early?\n\n                                ROBIN\n                      I just thought it would be nice.\n\n                                ADAM\n                      Are you going to see Sam again?\n\n                                ROBIN\n                      I thought I might stop by.\n\n                                RYAN\n                      All day again?\n\n                                ROBIN\n                      Not all day.  I'll be home after lunch.\n\n            Robin stands and dumps her dishes in the sink.\n\n                                ROBIN (CONT'D)\n                      You can go back to bed...or Lois might\n                      let you go swimming.\n\n                                ADAM\n                      I wanna be with you today.\n\n                                ROBIN\n                      Oh, honey.  There's not much to do there. \n                      I mean, it's all work.\n\n                                ADAM\n                      We can work.\n\n            Robin focuses on her sons, both of whom seem willing to work.\n\n                                ROBIN\n                      Ryan, would you rather swim or work?\n\n                                RYAN\n                      Can we really help build a house?\n\n            Peter walks in, surprised by everyone being up.\n\n                                PETER\n                      Why is everyone up so early?\n\n            EXT. GEORGE'S SHACK - MORNING\n\n            George is knocking away the forms used to pour the\n            foundation.  Sam walks out of the garage with a towel; he\n            shields his eyes from the morning sun as he watches his\n            father work.  Without make-up or a nose ring and with the\n            black dye gone from his hair and the polish from his nails,\n            Sam is a handsome kid. \n            George looks happy, laying bare the foundation that will hold\n            his home.  Sam walks to Alyssa's house, unseen by his father.\n\n            INT. ALYSSA'S ENTRY - MORNING\n\n            Colleen is walking with Sam toward the stairs.\n\n                                COLLEEN\n                      If she's not up, you can use my shower.\n\n                                SAM\n                      Thank you.\n\n                                COLLEEN\n                      You're here early today.\n\n                                SAM\n                      We're getting out of the ground today.\n\n            Sam looks fairly excited as he rushes up the stairs.\n\n            INT. ALYSSA'S HALLWAY - MORNING\n\n            Sam stops at the door and KNOCKS.\n\n                                ALYSSA (O.S.)\n                      Huh?\n\n                                SAM\n                      I can use your mom's.\n\n                                ALYSSA (O.S.)\n                      I'm okay.\n\n            INT. ALYSSA'S ROOM - MORNING\n\n            Alyssa is curled up in bed, cuddling a stuffed bear as Sam\n            walks in and closes the bedroom door behind him.\n\n                                ALYSSA\n                      Were you with Josh when the cops arrested\n                      him?\n\n            Alyssa sits up in bed, holding the sheet to her chest.\n\n                                SAM\n                          (nervously)\n                      Not really.  No.  Kinda.  He got busted?\n\n                                ALYSSA\n                      His parents took his car.  They're making\n                      him ride a bicycle the rest of the\n                      summer.\n\n            Sam can't help but like that.\n\n                                SAM\n                      Really?\n\n                                ALYSSA\n                      He asked me to tell you that you owe him\n                      a hundred dollars.\n\n                                SAM\n                      He can peddle over anytime he wants to\n                      for it.\n\n            Sam breaks into a full-on smile.\n\n                                ALYSSA\n                      This is serious!  I don't have my\n                      license.  He was my ride.\n\n                                SAM\n                      I'm sorry.  I'm just here to shower.\n\n            Sam walks into the bathroom; before he closes the door, he\n            faces Alyssa with another smile - she tosses her bear at him.\n\n            EXT. GEORGE'S SHACK - MORNING\n\n            George is prying off the last of the boards when he's hit\n            with a pain that takes him to his knees.  He drops the\n            crowbar and sits down in the dirt as Guster walks over to\n            comfort him.  George takes deep breaths and closes his eyes\n            as he tries to gain control over the pain.\n\n            INT. ALYSSA'S BATHROOM - MORNING\n\n            The doorknob jiggles, jiggles and turns; Alyssa opens the\n            door and walks in dressed in a t-shirt and panties.  Once\n            again Sam jumps and jams his elbow to the frosted glass as he\n            partially opens the shower door.\n\n                                SAM\n                      Is this like a past time with people?  Go\n                      away!\n\n            Alyssa sets a tiny screwdriver on the vanity.\n\n                                ALYSSA\n                      I've seen lots of people.  It's not a big\n                      thing for me.\n\n                                SAM\n                      Hand me a towel.  I'm getting out.\n\n                                ALYSSA\n                      I'm coming in.\n\n                                SAM\n                      I don't want you to!\n\n                                ALYSSA\n                      We're not gonna do anything.\n\n                                SAM\n                      Why are you so stupid?\n\n                                ALYSSA\n                      Why are you so uptight?\n\n                                SAM\n                      I don't even...what do you mean?  I don't\n                      even know what that means.\n\n                                ALYSSA\n                      It means I'm gonna shampoo my hair and\n                      stay out of your way.\n\n                                SAM\n                      Hand me a towel.  Hand me a towel.\n\n            Sam is anxious.  Alyssa takes off her t-shirt and pulls down\n            her panties before grabbing a towel; she hands it to Sam as\n            she forces her way into the shower.  Barely visible through\n            the frosted glass, Alyssa wets her hair as Sam stares in her\n            direction.  The towel drops to the tiled floor.\n\n            INT. GEORGE'S GARAGE - MORNING\n\n            George is curled up in bed, the prescription bottle and a\n            glass resting on a table.  He's holding onto his side, still\n            in some pain.  A HONK gets Guster BARKING outside.\n\n            EXT. GEORGE'S GARAGE - MORNING\n\n            Ryan and Adam run to Guster with glee as Robin steps out of\n            the Range Rover with a large covered basket and a boom box. \n            She sets the basket and radio on the patio table and searches\n            for George, ending up at the entrance to the garage.\n\n            INT. GEORGE'S GARAGE - MORNING\n\n            George has hidden the prescription bottle and is sitting on\n            the bed as Robin walks in.\n\n                                ROBIN\n                      I thought you'd be up with the sun.\n\n                                GEORGE\n                      My stupid back.\n\n            Robin sits down on the bed next to George, concerned.\n\n                                ROBIN\n                      Do you need anything?  I'll go to the\n                      pharmacy.  I have some Demerol at home.\n\n                                GEORGE\n                      No, I'm...thanks.  I took something.\n\n            Robin runs her hand down George's spine.\n\n                                ROBIN\n                      Where's Sam? \n\n                                GEORGE\n                      He won't use my shower.  I don't get it.\n\n            Outside, Adam and Ryan are each calling Guster.\n\n                                GEORGE (CONT'D)\n                      You brought your kids?\n\n                                ROBIN\n                      I kind of said that maybe they could do\n                      something.  Help.  I'm sorry.  They\n                      really wanted to come.  I really wanted\n                      to come and they wanted to be with me.  I\n                      don't think they'll be too much trouble.\n\n                                GEORGE\n                      I'll find something that won't kill them.\n\n                                ROBIN\n                      Or wound.  Let them keep their eyes and\n                      fingers.\n\n                                GEORGE\n                      You're a good mother.\n\n            Robin smiles.  With some effort, George stands.\n\n                                ROBIN\n                      Do you need help?\n\n                                GEORGE\n                      I think so.\n\n            Robin stands and wraps her arm around his waist and he drapes\n            his arms over her shoulder as they walk out of the garage.\n\n                                ROBIN\n                      I woke up this morning at three and\n                      couldn't fall back asleep.  Everyday I\n                      think I see more of Sam than I've seen in\n                      years.\n\n                                ADAM (O.S.)\n                      Sam!\n\n            EXT. GEORGE'S GARAGE - MORNING\n\n            Adam runs with abandon to Sam and Alyssa as Robin helps\n            George to a patio chair.\n\n                                SAM\n                      Hey.\n\n            Adam runs into Sam with a hug, then steps back.\n\n                                SAM (CONT'D)\n                      What's that for?\n\n                                ADAM\n                      Mom said I should.\n\n                                SAM\n                      Oh.\n\n                                ADAM\n                      I would have anyway.\n\n            Sam appears awkward as he rests his hand for a second on\n            Adam's shoulder.\n\n                                ADAM (CONT'D)\n                      Who are you?\n\n                                ALYSSA\n                      Who are you?\n\n                                ADAM\n                      I'm his brother.\n\n                                ALYSSA\n                      I'm his friend.\n\n            Adam views her suspiciously as they walk across Alyssa's\n            grass to the patio.\n\n                                ADAM\n                      Mom says we can build a house.\n\n                                ALYSSA\n                      Hi, Mr. Nelson.\n\n                                GEORGE\n                      Hi, Alyssa.\n\n                                SAM\n                      Hi, Mom.\n\n                                ROBIN\n                      Good morning.\n\n            It's clear that Robin is falling in love with her son again.\n\n                                ALYSSA\n                      Hello.\n\n            Alyssa extends her hand to Robin and they shake.\n\n                                ROBIN\n                      You're so nice to let Sam use your\n                      shower.\n\n                                ALYSSA\n                      He's got a standing invitation.\n\n            Sam instantly flushes red.\n\n                                SAM\n                      Hey, Ryan.\n\n            Sam walks to Ryan, who's been standing back from the group.\n\n                                RYAN\n                      Hey.\n\n            Sam drapes his arm over Ryan's shoulder and together they\n            walk to the foundation.\n\n                                SAM\n                      So, you wanna build a house?\n\n                                RYAN\n                      If we do, will it stay up?\n\n            MONTAGE\n\n            A BLINK 182 SONG BLASTS from the boom box on the patio table. \n            Ryan and Adam slather paint remover on five old painted\n            doors.  They work with gloves and brushes and appear\n            meticulous in their application.  Alyssa and Sam nail and\n            bolt the corner posts to the rim joist as Robin and George\n            work on the stick framed door deck. \n            While George is moving a little slower than usual, it appears\n            that the pain is nearly gone.  As the song ends, Robin rushes\n            toward the radio.\n\n                                ROBIN\n                      I brought a few of my own.\n\n                                RYAN\n                      Someone stop her!\n\n            Robin runs to her car and retrieves a few CD's.  She slips\n            the CD in and we HEAR John Hiat's \"DISTANCE.\"  It's a slow,\n            soft song that brings a smile to George's face.\n\n                                GEORGE\n                      It's been a while.\n\n                                ROBIN\n                      This was my very first slow dance.\n\n                                ADAM\n                      Did you know him before you knew Dad?\n\n                                ROBIN\n                      Since seventh grade.\n\n                                GEORGE\n                      Tell him how you made me fall in love\n                      with you.\n\n                                ROBIN\n                      I smiled at him.\n\n                                GEORGE\n                      Watch out for the smile, boys.\n\n            Robin's body moves slightly to the music as she smiles. \n            George grins.  The boys aren't sure what to make of the\n            advice.  'You are the beautiful love (my lover), I am the\n            distant shore (so far away).  There is so much to uncover\n            (love's hiding).  What is this distance for?  What is it for?\n\n                                ROBIN\n                      Who's up for a dance?\n\n            Robin glances around for any takers, finally focusing on\n            George.\n\n                                ADAM (O.S.)\n                      Just don't hug me too tight.\n\n            Adam walks to his mother and they hold hands as they dance. \n            Sam sits down to watch.  George wears a smile that wipes the\n            last of the pain from his face.\n\n                                ADAM (CONT'D)\n                      That's all you get.  I'm busy today.\n\n            Adam backs away and grabs his paintbrush.  Robin stops\n            dancing as she focuses on George.\n\n                                ROBIN\n                      Let's see if you've gotten any better.\n\n                                GEORGE\n                      Oh, I'm worse.  Much, much worse.\n\n            Robin waits to see how worse.  George finally walks to her\n            and takes her in his arms.  He must have been better than\n            this.  The waltz smooths out as they dance closer, holding\n            tighter.  \"We fill the air with silent stares.  But still, no\n            one there, we are strangers.\"  Alyssa decides it's time to\n            go.\n\n                                ALYSSA\n                      I'll see you tomorrow.\n\n            Sam watches Alyssa walk away, but he's quickly drawn back to\n            his mother and father dancing.  Ryan appears anxious, unsure\n            of the music and George.\n\n                                RYAN\n                      When did you fall in love with my dad?\n\n            The dance stops.  George lets go of Robin as she focuses on\n            Ryan.\n\n                                ROBIN\n                      When I found out I was pregnant with you.\n\n            INT. GEORGE'S GARAGE - NIGHT\n\n            Sam is on the pull out bed, listening to music through head\n            phones.  We HEAR a flush, the armoire doors open and George\n            walks out of the cabinet, washes his hands, turns off the\n            light and drops into bed.  A nightlight stuck in a socket\n            above the bed casts a dull blue light over the room.  Sam\n            takes the headphones off.  After a long silence:\n\n                                SAM\n                      I took some of your Vicodin.\n\n                                GEORGE\n                      I know.\n                          (beat)\n                      Why?\n\n                                SAM\n                      I like how it feels not to feel.\n\n            George turns onto his side to face his son.\n\n                                GEORGE\n                      I know the feeling.\n\n                                SAM\n                      How do you become something you're not?\n\n                                GEORGE\n                      What would you like to be?\n\n                                SAM\n                      What I'm not.\n\n                                GEORGE\n                      What are you now?\n\n                                SAM\n                      Nothing.\n\n                                GEORGE\n                      That's not true.\n\n                                SAM\n                      See, that's the thing...I am what I say I\n                      am.\n\n                                GEORGE\n                      I know parts of who you are.\n\n                                SAM\n                      What do you know about me?\n\n            George drops back onto his back.  He takes his time to\n            answer.\n\n                                GEORGE\n                      When you started first grade and your mom\n                      went to work, it was so she could save\n                      for an apartment.  But then she met Peter\n                      and skipped the idea of renting.\n\n                                SAM\n                      He's got nothing to do with me.\n\n                                GEORGE\n                      I couldn't imagine how I could compete\n                      with him for any part of you.  So, I\n                      didn't.  He wanted you to have his last\n                      name...I let him even take that.\n\n                                SAM\n                      He was a prick when I was six, and he's a\n                      prick today.\n\n            George turns onto his side to face Sam again.\n\n                                GEORGE\n                      I wish you had told me then.\n\n                                SAM\n                      I'm telling you now.\n\n                                GEORGE\n                      I gave up on you.\n\n                                SAM\n                      I'd be in Tahoe having fun if you had\n                      given up.\n\n                                GEORGE\n                      What would you be doing now?\n\n                                SAM\n                      Getting high, I guess.\n\n                                GEORGE\n                      If I asked you to stop, would you?\n\n                                SAM\n                      I haven't used anything for two days. \n                      I'm trying.\n\n                                GEORGE\n                      I'm proud of you, Sam.\n\n                                SAM\n                      Don't be.  And hide whatever that new\n                      drug is you have.  I like it.\n\n            Sam turns away from his father and puts his headphones on. \n            The music bleeds through the headphones in a muffled rumble.\n\n                                GEORGE\n                      I put a gun to my father's head once.\n\n            George's voice is soft - there's no chance Sam can hear.\n\n                                GEORGE (CONT'D)\n                      Have you ever thought like that?  I've\n                      been thinking...watching you work.  How\n                      much do you hate me?\n                          (beat)\n                      He was passed out. \n                      Just screaming at my mother before. \n                      About nothing.  Under-cooked meat.  I\n                      went back to my room... put the barrel\n                      close to his ear and chickened out again. \n                      Not my dad.  Hid in my room.  Not even\n                      me.\n                          (beat)\n                      Of course it was a BB gun.  But it still\n                      would have hurt like hell.\n\n            Sam notices his father's mouth moving and takes off the\n            headphones.\n\n                                SAM\n                      Are you talking?\n\n                                GEORGE\n                      I was just thinking about my mom.  She\n                      wouldn't leave him.  I remember one time\n                      she made us dinner wearing sunglasses.  I\n                      mean it was dark outside and in.  But we\n                      never talked about it.\n\n                                SAM\n                      Sun glasses?\n\n                                GEORGE\n                      To hide a black eye.\n\n                                SAM\n                      Why wouldn't she leave?\n\n                                GEORGE\n                      I think she was terrified of living with\n                      him...but maybe even more terrified of\n                      life without him.\n\n                                SAM\n                      I would have killed him.\n\n                                GEORGE\n                      Everything would have been better if you\n                      had.  You'd have liked your grandmother. \n                      And there'd be a girl out there that'd\n                      have her mother.  I remember reading\n                      about her in the paper.  They couldn't\n                      find her father and her mother was dead. \n                      I still feel guilty about that.\n\n                                SAM\n                      Do you ever wish you had done it?\n\n            George thinks about that for a second.\n\n                                GEORGE\n                      I loved him too much.\n\n                                SAM\n                      After everything he did to you and your\n                      mom?\n\n                                GEORGE\n                      After everything.\n\n                                SAM\n                      That's so weird...\n\n            Sam slips his headphones back on.  George nods...it is.\n\n            EXT. DAVID DOKOS' HOUSE - MORNING\n\n            Guster is squatting on the lush lawn of the mansion taking a\n            dump.  David bursts out from his house, rushes to his black\n            Mercedes and tries once again to run over Guster.  No such\n            luck.  Guster moves on to another lawn as Mr. Dokos drops\n            over the curb and drives off down the street.\n\n            EXT. GEORGE'S BEACH SHACK - AFTERNOON\n\n            In the late June afternoon, with a clotted cloud sky, Robin,\n            Adam, Ryan, Sam, Alyssa and George work at building a house. \n            Adam and Ryan are staining the interior doors they stripped\n            days earlier.  George and Sam carry large wood beam to the\n            foundation and slip it into the pocket mortise of the\n            laminated beam that spans from pier post to pier post.  Robin\n            grabs a drill and screws the cast-in tie down to the wood\n            beam.  Alyssa is sawing a rafter in half as her mother walks\n            across the grass with a huge basket of food.\n\n                                COLLEEN\n                      Is anyone hungry?\n\n            LATER\n\n            With MUSIC playing in the background, everyone is packed\n            around the patio table eating pasta and drinking lemonade.\n\n                                ADAM\n                      I like the color I'm making the doors.\n\n                                GEORGE\n                      The absolute best color I've ever seen in\n                      my life.\n\n            Adam lights up, pleased to be praised.\n\n                                RYAN\n                      How many bedrooms will your house have?\n\n                                GEORGE\n                      Three.\n\n                                ADAM\n                      Will Sam live with you or us?\n\n                                GEORGE\n                      With you.\n\n            It's a quick response that draws Robin's attention.  Sam\n            lightly bops Adam on the head.\n\n                                SAM\n                      So put your plans of my room in the\n                      trash.\n\n                                ADAM\n                      I don't think Dad wants you home.\n\n                                ROBIN\n                      Adam, that's not true!\n\n                                RYAN\n                      Yes, it is.\n\n                                ROBIN\n                      Would you stop being ridiculous?  Your\n                      father wants Sam home as much as I do.\n\n            Sam starts laughing.  George smiles.  Sam can't stop\n            laughing.\n\n                                ROBIN (CONT'D)\n                      It wasn't meant to be...\n\n            Sam and George stand at exactly the same time and walk back\n            to the house.  Without a word, they work together as they\n            continue to frame the house.  Suddenly George turns back to\n            the pack of people at the table and loudly proclaims:\n\n                                GEORGE\n                      I love you!\n\n            That's it.  He goes back to work as Sam glances at him,\n            amused.  Adam and Ryan are surprised and it shows on their\n            faces.  Robin smiles.\n\n            INT. ROBIN'S BEDROOM - NIGHT\n\n            Robin's in bed reading as Peter emerges from the bathroom in\n            pajama bottoms.\n\n                                PETER\n                      You know what I've decided?\n\n            Robin glances up from her book to Peter's hairy chest.\n\n                                ROBIN\n                      To shave your chest?\n\n                                PETER\n                      We should take a vacation.\n\n            Peter grabs his pajama top and slips it on as he climbs into\n            bed.  Robin sets her book down.\n\n                                ROBIN\n                      The biggest waste of time since\n                      television.\n\n                                PETER\n                      Do you remember anything I've said that\n                      wasn't negative?\n\n            Robin takes long enough to think that Peter forges on.\n\n                                PETER (CONT'D)\n                      Just the two of us.\n\n            It takes Robin a few seconds to answer.\n\n                                ROBIN\n                      I'd love to drive through New England in\n                      the Fall.\n\n                                PETER\n                      Sooner than the Fall.\n\n            He closes in on her, kisses her cheek.\n\n                                ROBIN\n                      After the kids are back in school.\n\n                                PETER\n                      Lois will stay with them.  Or we can pawn\n                      them off on your parents.\n\n            Out of reasonable excuses, Robin opts for the truth.\n\n                                ROBIN\n                      I'm helping George build his house.\n\n                                PETER\n                      What?  \n\n                                ROBIN\n                      I've been helping for the last few days. \n                      Weeks.  Sam's working.  I told you Sam\n                      was working.  I mean, he really is.\n\n                                PETER\n                      Good.  That was the plan.  We couldn't\n                      stand him and George needed help.\n\n            As true as it is, this still irritates Robin.\n\n                                ROBIN\n                      I can't go right now.\n\n                                PETER\n                      You can't go because of Sam?\n\n                                ROBIN\n                      We haven't been away together for three\n                      years.  What difference does a few months\n                      make?\n\n                                PETER\n                      You can't go with me because of Sam?\n\n                                ROBIN\n                      Sam is working at something for the first\n                      time in his life.  Once in a while he\n                      even talks to me.  I want to be around\n                      for that.\n\n                                PETER\n                      So am I, Robin.  I'm working at\n                      something, too.  I'm even talking.  Do\n                      you want to be around for it?\n\n            Peter is intense, close up, not giving her breathing room.\n\n                                ROBIN\n                      I don't know.\n\n            Robin whispers her answer.  Peter pulls away and settles down\n            on his back.  Robin doesn't move for the longest time. \n            Finally, she eases onto her back and turns out the light.\n\n                                PETER\n                      I was talking about our marriage.\n\n                                ROBIN\n                      I know.\n\n            Silence finishes the conversation.\n\n            EXT. GEORGE'S HOUSE - MORNING\n\n            With an extended plate and overhung rafters, the frame takes\n            its form; rooms are roughed in; windows are framed; two gable\n            dormers distinguish the common-rafter roof in the front and a\n            frame for a balcony juts out over the ocean in back.  Robin\n            and Adam are locking in and hoisting the sheets of plywood on\n            a pulley system up to Ryan and George, who are stripped down\n            to shorts - George is thinner than ever.\n\n            INT. ALYSSA'S BATHROOM - MORNING\n\n            Sam is showering as Alyssa walks in from the bedroom and\n            joins him; no protest is voiced this time around.\n\n            INT. SHOWER - CONTINUOUS\n\n            Alyssa smiles at Sam as she grabs a wash cloth and slathers\n            it with liquid soap.\n\n                                SAM\n                      What's the point of this?\n\n                                ALYSSA\n                      Does everything have to have a point?\n\n                                SAM\n                      It's freakish.  I don't get it.  I'm not\n                      really supposed to touch you, but I can\n                      look.\n\n            Alyssa faces Sam as she washes her body with the cloth.\n\n                                ALYSSA\n                      Are you sure you're totally into guys?\n\n                                SAM\n                      What are you talking about?\n\n                                ALYSSA\n                      Josh said...\n\n                                SAM\n                      I'm not gay.\n\n            Sam glances down at himself; Alyssa looks too.\n\n                                SAM (CONT'D)\n                      I mean, hello!\n\n            They both look up.\n\n                                ALYSSA\n                      I was wondering.\n\n                                SAM\n                      You're driving me crazy!  Do you know\n                      what it's like trying to jack-off in an\n                      armoire?\n\n                                ALYSSA\n                      Not really.\n\n                                SAM\n                      You're off, you know?  You're way, way\n                      off.\n\n                                ALYSSA\n                      I thought I was helping you.\n\n                                SAM\n                      It would help me if I could kiss you.\n\n                                ALYSSA\n                      No, I don't...NO.  I thought we were just\n                      friends.\n\n                                SAM\n                      What you think, you know, doesn't have\n                      much to do with reality.  I mean, I hope\n                      I'm not the first to say that about you.\n\n                                ALYSSA\n                      Okay, but then we'll just be friends. \n                      Okay?\n\n                                SAM\n                      Okay.  I guess.\n\n            Sam stands still, unsure of his next move.\n\n                                ALYSSA\n                      Have you ever even kissed a girl?\n\n            Sam appears shocked she would even ask; he hasn't, but she's\n            not supposed to know that.  Alyssa makes the move, closes the\n            distance and kisses him.  Apart, it appears to be something\n            they enjoyed.  Sam wraps his arms around her, presses himself\n            against her and kisses her again. \n            After a few seconds of making out, Sam jerks once, then again\n            as he backs away.  Alyssa grimaces as she glances down.\n\n                                ALYSSA (CONT'D)\n                      Oh, yuck!\n\n            Alyssa steps into a corner of the shower as Sam turns around\n            and rests his forehead on the tile.\n\n                                ALYSSA (CONT'D)\n                      You're scrubbing the shower down.\n\n            EXT. GEORGE'S BEACH SHACK - AFTERNOON\n\n            George and Sam are on ladders, reinforcing a window opening\n            on the second floor with a 2x4 spline.  Ryan and Adam are\n            flat on their backs on the grass with Guster between them,\n            dog-tired.  Robin is at the grill with hamburgers as Alyssa\n            prepares the table for dinner.\n\n                                ALYSSA\n                      You must have a really great husband.\n\n            Robin glances up at Alyssa.\n\n                                ROBIN\n                      Why is that?\n\n                                ALYSSA\n                      Just, I mean, well, you're here every\n                      single day.\n\n                                ROBIN\n                      He's at work while I'm here.\n\n                                ALYSSA\n                      I guess I'd just be jealous if I were\n                      him.\n\n                                ROBIN\n                      Well, he doesn't need to worry.\n\n                                ALYSSA\n                      If my kids and my wife were always at an\n                      ex-husband's house, I'd worry.\n\n                                ROBIN\n                      He's not the type to worry.\n\n            Robin is slightly pissed at Alyssa grilling her; she flips\n            the hamburgers and calls out:\n\n                                ROBIN (CONT'D)\n                      Let's eat!\n\n            INT. WEBBER'S LIVING ROOM - AFTERNOON\n\n            Music is playing softly in the background.  Peter is sitting\n            alone in a chair with a drink in hand.  After a bit, Lois\n            walks in holding a can of Pledge and a rag.\n\n                                LOIS\n                      I'd be glad to fix you something.\n\n                                PETER\n                      No, I'm fine.\n\n            Lois nods and walks away.  For all the presence of the room,\n            Peter looks small and frayed in it - lost in his own house.\n\n            EXT. GEORGE'S BEACH SHACK - AFTERNOON\n\n            Lunch is over.  Adam is wrestling with Guster on the lawn. \n            Robin is taking money from her purse as George hands Sam the\n            keys to his truck.\n\n                                ROBIN\n                      Nothing R, okay?\n\n                                RYAN\n                      Enough for drinks, popcorn and candy!\n\n                                ADAM\n                      And video games after!\n\n                                ROBIN\n                      Home after.\n                          (to Sam)\n                      Will you come in and say \"hi\"?\n\n            Sam shrugs, takes the money and keys as Ryan and Adam rush\n            close to him.\n\n                                ADAM\n                      Do we have to take her?\n\n            The three boys turn to watch as Alyssa, now dressed in a\n            dress, walks across the lawn to join them.\n\n                                SAM\n                      Definitely.\n\n            It's literally frightening how beautiful Alyssa can look;\n            with her tan and white dress, Sam shutters.\n\n            EXT. PACIFIC COAST HIGHWAY - LATE AFTERNOON\n\n            Josh is peddling down the highway on his bike, sweating in\n            the full afternoon sun.\n\n            EXT. GEORGE'S HOUSE - LATE AFTERNOON\n\n            George is hewing a beam as Robin watches from a chair.\n\n                                ROBIN\n                      I should go.\n\n            George stops and wipes the sweat from his forehead.\n\n                                GEORGE\n                      Maybe you shouldn't come everyday.\n\n                                ROBIN\n                      No.  Why?  I like to be with Sam.\n\n                                GEORGE\n                      It's just that there's less that Adam and\n                      Ryan can do anymore.\n                          (beat)\n                      I'd hate to have them bored.\n\n            Robin stands and walks to George.\n\n                                ROBIN\n                      I know they're not much help, but they\n                      love coming here, George.\n\n                                GEORGE\n                      How much time do they get to spend with\n                      their dad?\n\n                                ROBIN\n                      What is it with this?  They wouldn't\n                      spend less time with Peter if they lived\n                      here!  He has no time!\n\n            Robin walks away, then back - she's frustrated.\n\n                                ROBIN (CONT'D)\n                      Do you know Alyssa thinks something is up\n                      with us?  She's giving me crap about\n                      being away from Peter and now you're\n                      trying to do the same thing!  What no one\n                      seems to realize is that Peter isn't\n                      there!  He's not there!  And when he is,\n                      he isn't!\n                          (beat)\n                      So, if you don't want me here, or you\n                      don't want my kids here, just tell me,\n                      George.  I'll stop coming.  But it won't\n                      be because of Peter.  It'll be because\n                      you asked me to stop.  Say what you need\n                      to say, because I'm not leaving until I\n                      hear it.\n\n                                GEORGE\n                      I'd rather you not be here.\n\n            In the distance, on the street, Josh peddles past on his\n            bike.\n\n                                ROBIN\n                      I thought we were helping.\n\n                                GEORGE\n                      I can hire workers to help me.\n\n            Robin nods, gathers her things, walks to her car, climbs in\n            and drives off.\n\n            EXT. COLLEEN'S HOUSE - LATE AFTERNOON\n\n            Colleen is standing in the entry, talking to Josh.\n\n                                COLLEEN\n                      You can come in and wait if you'd like.\n\n                                JOSH\n                      What friends did she go with?\n\n            EXT. GEORGE'S HOUSE - LATE AFTERNOON\n\n            Robin pulls right back to where she was parked and parks\n            again.  She steps out of the car talking.\n\n                                ROBIN\n                      Nothing is going on with us, is it?\n\n                                GEORGE\n                      Going on?\n\n                                ROBIN\n                      When I picked you up from the train\n                      station...what you said.\n\n                                GEORGE\n                      What did I say?\n\n                                ROBIN\n                      That thing about I was the most, you\n                      know, beautiful person you had ever\n                      known.  What was that?\n\n                                GEORGE\n                      That was the truth.\n\n                                ROBIN\n                      You've never said that before.\n\n                                GEORGE\n                      I'll say a lot of things I've never said\n                      before.  It's habit.\n\n                                ROBIN\n                      It sounded like a pick-up line.\n\n                                GEORGE\n                      I can't pick you up.\n\n            Robin sits down, weighted by the reason.\n\n                                ROBIN\n                      I'm married.\n\n                                GEORGE\n                      You bit my finger.\n\n                                ROBIN\n                      If I weren't married?\n\n            George wants to answer quickly, dismiss the impossible and\n            move on, but emotion catches him off-guard.  He forces a\n            smile.\n\n                                GEORGE\n                      Let's not do this, okay?\n\n                                ROBIN\n                      I need to know.\n\n                                GEORGE\n                      You need to know what?  Do I still love\n                      you?\n\n            Robin is surprised by the question.  She nods her head.\n\n                                GEORGE (CONT'D)\n                      Absolutely.  There's not a doubt in my\n                      mind that through all my anger...my ego,\n                      I was faithful in my love for you.  From\n                      seventh grade on.\n\n            Robin raises her eyebrows - what a revelation.\n\n                                GEORGE (CONT'D)\n                      That I made you doubt it, that I withheld\n                      it...that's the greatest mistake of a\n                      life full of mistakes.\n                          (beat)\n                      But the truth doesn't set us free, Robin. \n                      I can say it as many times as you can\n                      stand to hear it.  And all that does, the\n                      only thing, is remind us that love isn't\n                      enough.  Not even close.\n\n            Tears well in Robin's eyes as she stands.\n\n                                ROBIN\n                      I should go.\n\n            George nods - she should.  Robin walks to her car, opens the\n            door; she faces George before climbing in.  George walks into\n            the garage.\n\n            INT. GEORGE'S GARAGE - LATE AFTERNOON\n\n            George rummages through his sock drawer.  Pulls out a folded\n            sock and opens it - the prescription bottle drops to the\n            floor.  He fills a glass and swallows three pills.\n\n            INT. ROBIN'S ENTRY - LATE AFTERNOON\n\n            Robin opens the door and heads straight for the kitchen.\n\n                                PETER (O.S.)\n                      All I am is what I have.\n\n            Robin jumps and searches for the voice.  Peter's sitting\n            alone in the living room.\n\n                                PETER (CONT'D)\n                      That sounds pathetic, doesn't it?\n\n                                ROBIN\n                      What are you doing home?\n\n                                PETER\n                      I always felt I could never marry you\n                      without first showing you what a fabulous\n                      life you cloud live despite me.\n\n            Robin takes a few steps into the room.\n\n                                ROBIN\n                      You never really trusted me.\n\n                                PETER\n                      You live a fabulous life, Robin.\n\n                                ROBIN\n                      Despite you.\n\n                                PETER\n                      I never asked for more.\n\n                                ROBIN\n                      That's the problem.\n\n                                PETER\n                      Please don't leave me.\n\n            Peter stands and walks to her.  Robin doesn't respond.\n\n                                PETER (CONT'D)\n                      Where are the kids?\n\n                                ROBIN\n                      Sam took them to a movie.\n\n                                PETER\n                      I'll be in the bedroom.\n\n            Peter takes her hand and kisses her cheek before walking down\n            the hall.  Robin stands still, trying to assess the exchange.\n\n            INT. BEDROOM - EVENING\n\n            In a bedroom we don't quite recognize, two people are in the\n            throes of making love under a silk white sheet.\n\n                                WOMAN (O.S.)\n                      Oh God!\n\n            It's hard to tell whose voice that is - Robin's?\n\n            INT. GEORGE'S GARAGE - EVENING\n\n            George is in bed, awakened by a KNOCK.\n\n                                GEORGE\n                      I fell asleep!\n\n            Alyssa walks in, closing the door behind her.\n\n                                ALYSSA\n                      Sam's dropping Adam and Ryan off.\n\n            George is slightly out of it with oral morphine; he tires to\n            sit up, but settles for propping up his head.\n\n                                GEORGE\n                      Can you keep Sam straight?\n\n                                ALYSSA\n                      He's not gay.  I found out purely by\n                      accident, believe me.\n\n                                GEORGE\n                      I mean drugs.\n                          (catching up)\n                      I thought you said he was?\n\n                                ALYSSA\n                      He wouldn't use around me.  I don't like\n                      any of it.\n\n                                GEORGE\n                      You're a good girl.\n\n                                ALYSSA\n                      I need to ask you something, Mr. Nelson.\n\n            Alyssa walks over and lies on the bed beside George.\n\n                                GEORGE\n                      You have to ask like that?\n\n                                ALYSSA\n                      I want you to try something with me,\n                      okay?\n\n                                GEORGE\n                      I've taken a lot of morphine.  Oral\n                      morphine...for my back.  Can I wait till\n                      I can say no and sound convincing?\n\n            Alyssa leans forward and kisses him; it's a real kiss that\n            lasts a lot longer than it should.  And when it's over:\n\n                                ALYSSA\n                      Did you feel anything?\n\n                                GEORGE\n                      Maybe your tongue...I don't know, my\n                      mouth is numb.  Why did you do that?\n\n            They both stare up at the ceiling.\n\n                                ALYSSA\n                      When you dated my mom, I saw you kiss her\n                      once.  You looked like such a good\n                      kisser.\n\n            INT. BEDROOM - EVENING\n\n            It's the couple making love again; this time we're close\n            enough to make out Colleen's face underneath Josh, who is\n            working with speed, if not exact precision.\n\n                                ALYSSA (V.O.)\n                      My mother would die.\n\n                                GEORGE (V.O.)\n                      Let's shut up and not kill her.\n\n                                COLLEEN\n                      Oh my God!\n\n            INT. ROBIN'S BEDROOM - EVENING\n\n            Peter has changed and is on the bed; his head propped up by\n            pillows; he stairs blankly at the door.\n\n            INT. ROBIN'S LIVING ROOM - EVENING\n\n            Robin is sitting alone in the living room, in the same spot\n            Peter had been sitting earlier.\n\n            INT. GEORGE'S GARAGE - EVENING\n\n            Alyssa and George are still beside each other in bed.\n\n                                ALYSSA\n                      It's not what I was expecting.\n\n                                GEORGE\n                      What did you think it would be?\n\n                                ALYSSA\n                      I don't know...\n                          (realizing)\n                      More like when I kissed Sam.\n\n            Alyssa sits up in bed.\n\n                                ALYSSA (CONT'D)\n                      More like that.\n\n            She stands and grabs his big toe.\n\n                                ALYSSA (CONT'D)\n                      Thanks for your time.\n\n            Alyssa waves goodbye and leaves.  George is confused by it\n            all.\n\n            INT. COLLEEN'S BEDROOM - EVENING\n\n            Josh looks as though he's been struck by a hammer as he lay\n            on his back with his mouth slack.  Under the sheet, low down,\n            Colleen is swallowing her pride and showing off her\n            technique.  A sudden blaring noise, AN ALARM, pierces Josh's\n            throaty groan.  Colleen jumps off the bed, the sheet still\n            haunting her head.\n\n                                COLLEEN\n                      Oh my God!  Get dressed!  Get dressed!\n\n            INT. COLLEEN'S KITCHEN - EVENING\n\n            Alyssa closes the French door she entered through and rushes\n            to the alarm panel as the siren blares.\n\n            INT. COLLEEN'S BEDROOM - EVENING\n\n            Colleen and Josh are frantically pulling on clothes as the\n            noise throws them off balance.\n\n            INT. COLLEEN'S KITCHEN - EVENING\n\n            With the ALARM OFF, Alyssa walks to the entry.\n\n                                ALYSSA\n                      Mom!?\n\n            INT. COLLEEN'S BEDROOM - EVENING\n\n            Josh has pulled on his underwear backwards; only speed\n            counts. \n\n            INT. COLLEEN'S ENTRY - EVENING\n\n            Alyssa glances around before heading up the stairs.\n\n                                ALYSSA\n                      Hello?\n\n            INT. COLLEEN'S BEDROOM - EVENING\n\n            Without a knock, Alyssa opens the door.  The room is empty,\n            but the bed is messed.\n\n                                ALYSSA\n                      Mom?\n\n                                COLLEEN (O.S.)\n                      Here, honey!\n\n            Alyssa walks to the master bath, following the voice.\n\n            INT. COLLEEN'S BATHROOM - EVENING\n\n            Colleen is standing above Josh, who is bent over on his\n            knees, with a plunger in the bath.\n\n                                ALYSSA\n                      I completely forgot.  I'm so sorry, Josh.\n                          (beat)\n                      What are you doing?\n\n            Josh's face is flushed red and beaded with sweat.\n\n                                COLLEEN\n                      I put him to work.\n\n                                ALYSSA\n                      What's wrong?\n\n            It takes a second for Colleen to realize that Alyssa is\n            talking about the plumbing.\n\n                                COLLEEN\n                      I couldn't get it to go down.\n\n                                ALYSSA\n                      And why was the alarm on?\n\n                                COLLEEN\n                      Oh...I set it to see if it would work.\n\n                                ALYSSA\n                      You'd better call and cancel.\n\n                                COLLEEN\n                      Oh God, we don't want the police!\n\n            Colleen is anxious as she rushes out.  Josh stands and wipes\n            the sweat from his forehead.\n\n                                ALYSSA\n                      What's going on?\n\n            Josh fumbles and fidgets, finally finding a way out.\n\n                                JOSH\n                      What's the deal with you and Sam?\n\n            INT. ROBIN'S KITCHEN - EVENING\n\n            Robin is fixing dinner as we hear the front door open.  Adam\n            is talking as he rushes into the kitchen.\n\n                                ADAM\n                      I got to play one video game for three\n                      hours straight!\n\n            Ryan enters right behind him.\n\n                                RYAN\n                      Wouldn't you move to another one if the\n                      one you were playing made you look\n                      stupid?\n\n            Robin checks the entry to the kitchen - no Sam.\n\n                                ADAM\n                      That's how you get things right is to\n                      always try and never give up.  Huh, Mom?\n\n                                ROBIN\n                      I guess it depends on what you give up\n                      on.\n\n            Robin's face lights up as Sam walks into the kitchen.\n\n                                SAM\n                      There were no PG's.  So I just gave them\n                      money to play games.\n\n                                ROBIN\n                      Can you stay for dinner?\n\n                                SAM\n                      Depends on what I'd give up on.\n\n            Robin opens the oven and shows Sam a platter of lasagna.\n\n                                SAM (CONT'D)\n                      It looks like a trap.\n\n            Robin turns to Adam, excited at having Sam stay for dinner.\n\n                                ROBIN\n                      Go tell your father we're eating.\n\n                                RYAN\n                      Dad's home, already?\n\n                                ROBIN\n                      In the bedroom.\n\n            Adam takes off in a run as Sam walks to the sink and washes\n            his hands before grabbing a stack of plates for dinner.  He\n            arranges the five on the table and then heads back for\n            utensils as Adam runs back in.\n\n                                ADAM\n                      He's not there.\n\n                                ROBIN\n                      He's here.  Check the bathroom.\n\n                                ADAM\n                      I checked everywhere.  He's not there.\n\n            INT. GEORGE'S GARAGE - MORNING\n\n            Guster's at the door, whining.  George and Sam are asleep.\n\n            INT. COLLEEN'S KITCHEN - MORNING\n\n            Colleen is sitting alone at the kitchen table, drinking\n            coffee as Alyssa walks in.\n\n                                ALYSSA\n                      What are you doing up so early?\n\n                                COLLEEN\n                      I couldn't sleep last night.\n\n                                ALYSSA\n                      I'm supposed to be mad at you, but I'm\n                      not.\n\n            Colleen is trembling as Alyssa pours herself a big bowl of\n            Lucky Charms.\n\n                                COLLEEN\n                      Why?  What do you mean?\n\n                                ALYSSA\n                      Uh...using Josh like that.\n\n            Alyssa eats her cereal as Colleen bursts into a confession.\n\n                                COLLEEN\n                      I will never forgive myself.  Never,\n                      Alyssa.  I know I took advantage.  It's\n                      inexcusable.  Oh, God.  I should have my\n                      head examined.\n\n            Alyssa looks confused as she swallows her Lucky Charms.\n\n                                ALYSSA\n                      He said you asked him to tighten your\n                      toilet seat, too.  That's so uncool.\n\n            Colleen quickly nods.\n\n                                COLLEEN\n                      I won't do it again.  I swear.\n\n            Alyssa keeps an eye on her mother as she continues on with\n            her cereal.\n\n            EXT. DOKOS HOUSE - MORNING\n\n            Guster is taking a dump on the immaculate lawn.  David Dokos\n            rushes from the house dressed in a suit and picks up the shit\n            with a gloved hand and heaves it at Guster as the dog trots\n            back to safety.  Tom and Barbara, the old early walkers of\n            the street, stop and watch as David picks up more crap and\n            tosses it onto George's driveway.  He notices Tom and\n            Barbara.\n\n                                DAVID\n                      Mind your own fucking business!\n\n            Tom and Barbara stay silent as David Dokos walks back into\n            his house and slams the front door shut.\n\n            EXT. PACIFIC COAST HIGHWAY - LATE MORNING\n\n            Josh is in eleventh gear on his ten speed peddling like a\n            demon for the Beck's house.\n\n            EXT. GEORGE'S HOUSE - LATE MORNING\n\n            Robin pulls to a stop and Ryan and Adam run from the Range\n            Rover to Sam and Alyssa, who are helping an ELECTRICIAN\n            (DALE) install the outside boxes and sockets.\n\n                                ADAM\n                      Dad's disappeared!\n\n                                RYAN\n                      He was there and then he wasn't!\n\n            Sam faces his mother as she walks toward the house.\n\n                                SAM\n                      He hasn't called?\n\n                                ADAM\n                      Who are you?\n\n            Robin shakes her head \"no\" to Sam.  Dale turns to face Adam.\n\n                                DALE\n                      I'm the electrician.\n\n                                ADAM\n                      I'm the builder!\n\n            Sam turns back to finish what he was working on as Alyssa\n            grabs Adam with a hug.\n\n            INT. GEORGE'S GARAGE - MORNING\n\n            George is swallowing two pills as Robin knocks on the half\n            open door, opening it all the way in the process.\n\n                                ROBIN\n                      Is your back still killing you?\n\n                                GEORGE\n                      I didn't think you'd come today.\n\n                                ROBIN\n                      I kept thinking about it, what you\n                      said... I hope you were trying to keep me\n                      away fro the sake of me.\n\n                                GEORGE\n                      No.  Mostly me.\n\n                                ROBIN\n                      Peter left me yesterday.\n\n                                GEORGE\n                      Left you?\n\n                                ROBIN\n                      No goodbye.  No fuck you.  No 'Are you in\n                      love with George?'\n\n                                GEORGE\n                      What did he say?\n\n                                ROBIN\n                      'I'll be in the bedroom.'\n\n            Robin walks to George and holds on to his shirt.\n\n                                ROBIN (CONT'D)\n                      I couldn't walk in there.\n                          (beat)\n                      So he left.\n\n            She rests the side of her head against his chest.  He kisses\n            her hair.  Outside, a hammer beats a reminder that they're\n            not alone.  The ocean drowns the sound long enough for Robin\n            to kiss George's chin;\n            and in that instant, the instant where everything but the\n            touch washes away, George kisses Robin with such punch that\n            it knocks them onto the bed.  They continue to forget\n            everything as they roll with the punch.\n\n                                SAM (O.S.)\n                      Dad, Dale needs to know..\n\n            Sam stops at the jamb of the open door as his mother and\n            father scramble to their feet from the bed.\n\n                                GEORGE\n                      I had a kink in my...\n\n            As George falters, Robin feels compelled to complete the lie.\n\n                                ROBIN\n                      Back.  Neck.  Back.\n\n                                GEORGE\n                      What?\n\n                                SAM\n                      The door was open.\n\n                                ROBIN\n                          (a quick confession)\n                      I don't know what I'm doing.\n\n                                SAM\n                      I wouldn't let Adam or Ryan see you doing\n                      it.\n\n                                GEORGE\n                      It won't happen again.\n\n            George and Robin are flustered, embarrassed by being caught,\n            something Sam clearly relishes.\n\n                                SAM\n                      Dale wants to know if we should run an\n                      outside outlet for Christmas lights with\n                      a switch inside?\n\n                                GEORGE\n                      Absolutely.\n                          (beat)\n                      Have him put it on a separate line.  At\n                      Christmas, we'll pact it so full of\n                      lights, we'll make God wear sunglasses.\n\n            Sam laughs, grabs the door and closes it on his parents. \n            Robin slumps, truly embarrassed.\n\n                                ROBIN\n                      I could die.\n\n                                GEORGE\n                      So could I.\n\n            George touches Robin's chin, draws her head up.  He stares at\n            her, afraid to say what he needs to say.\n\n                                ROBIN\n                      Are you going to kiss me?\n\n                                GEORGE\n                      It's not my back that's killing me.\n\n            Robin furrows her brow, not understanding.  George surrounds\n            her head with his hands and kisses her forehead.\n\n            EXT. GEORGE'S HOUSE - MORNING\n\n            Adam and Ryan are helping Dale run the electrical lines;\n            Alyssa and Sam drill screws into the second story\n            floorboards.  MUSIC is playing loud on the radio.\n\n            ANOTHER VIEW\n\n            Josh stops peddling quite a distance from George's house and\n            gets off to search for Alyssa.  Only seeing Adam, Ryan and\n            Dale, Josh pulls out his cell and dials.\n\n            INT. COLLEEN'S BEDROOM - MORNING\n\n            Frustrated and anxious, Colleen slips off the dress she's\n            wearing and tries another one as the phone RINGS.\n\n            EXT. GEORGE'S STREET - MORNING\n\n            Josh is standing behind a tree, talking on his cell phone as\n            he stares at George's house.\n\n                                JOSH\n                      I don't see her.\n                          (beat)\n                      Please just open the door when I knock.\n\n            He slips the phone back in his pocket, hops back on the bike\n            and makes a beeline toward Colleen's house.\n\n                                ALYSSA (O.S.)\n                      Josh?\n\n            Busted, Josh has no choice but to join Alyssa.\n\n                                JOSH\n                      I was hoping...you could..you know.  Go\n                      for a ride?\n\n            Alyssa and Sam are leaning out the framed second story\n            window.\n\n                                SAM\n                      On the handlebars or your shoulders?\n\n                                ALYSSA\n                      Are you afraid of heights?\n\n            Sam walks away from the window and goes back to work.\n\n                                JOSH\n                      Not really.\n\n                                ALYSSA\n                      Can you help us out?\n\n                                JOSH\n                      My parents cut my allowance off.  Without\n                      a car, I'm totally screwed.\n\n                                ALYSSA\n                      George is paying Sam ten dollars an hour.\n\n            Sam sticks his head back out the window.\n\n                                SAM\n                      Hey, I can get you three hundred cash for\n                      two hours.\n\n                                ALYSSA\n                      What?\n\n            Josh is fuming as he stares at Sam.\n\n                                SAM\n                      It's just a joke.  A stupid joke.\n\n                                JOSH\n                      I could use the money.\n\n            Sam turns away from Josh.  George walks out the garage as he\n            wipes his eyes.\n\n                                ALYSSA\n                      Hey, George!  I recruited some help for\n                      the roof!\n\n            George walks to Josh and extends his hand.\n\n                                GEORGE\n                      George Nelson.\n\n                                JOSH\n                      Josh.\n\n            Adam races to George with a hug - something unexpected.  Adam\n            rushes back to work as George breaks into a smile.  Alyssa\n            rushes down the stairs and straight into George's arms.\n\n                                ALYSSA\n                      Me too!\n\n            George is still smiling as he tucks a strand of Alyssa's hair\n            behind her ear.  Ryan sort of saunters over to George with\n            his hands sunk deep in his pockets.  Without asking, George\n            wraps his arms around Ryan with a hug.  Afterward:\n\n                                RYAN\n                      I just wanted to know where Mom was?\n\n                                GEORGE\n                      Oh.  Sorry.\n\n                                RYAN\n                      It's okay.\n\n                                GEORGE\n                      She needs to be alone, I think.\n\n                                RYAN\n                      Because Dad left?\n\n                                GEORGE\n                      She's a little sad, is all.\n\n                                RYAN\n                      I don't even care if he ever comes back.\n\n            Ryan walks back to Adam, who's been standing still,\n            listening.\n\n                                GEORGE\n                      Josh, you look like you could use a hug.\n\n                                JOSH\n                      No...I'm okay.  I'm okay.\n\n            George is too quick with his hug.  Josh is stiff as a board. \n            Sam looks pissed as he walks away from the second story\n            window and resumes screwing the floorboards.  George sets his\n            eyes on Dale as he opens his arms wide.\n\n                                DALE\n                      Don't even think about it.\n\n            George walks toward Dale with his arms still extended.\n\n                                GEORGE\n                      Well, they got me started.\n\n                                DALE\n                      I swear to God, I'll use these wires and\n                      shock you so bad your tongue will turn\n                      black.\n\n            Adam and Ryan are excited as George closes the distance. \n            Finally, Dale drops the harmless wire and takes off in a run.\n\n            INT. COLLEEN'S KITCHEN - LATE MORNING\n\n            Colleen is pacing the kitchen in a silky dress we haven't\n            seen before.  Finally, she grabs the phone.\n\n            EXT. GEORGE'S HOUSE - LATE MORNING\n\n            George is propped up on the chaise lounge next to the patio\n            table where everyone has dropped their crap.  Sam and Josh\n            are sheeting the roof with tarpaper.  Robin is still in the\n            garage.  One of two cell phones on the table begins to RING.\n\n                                DALE\n                      Would you get it for me?\n\n            Dale is in the middle of wiring a box.\n\n                                JOSH (O.S.)\n                      Just let mine ring!\n\n                                GEORGE\n                      I guess... I don't know.\n\n            George picks up the offender, unsure whose phone it is.\n\n                                GEORGE (CONT'D)\n                          (into phone)\n                      Hello?\n\n            INT. COLLEEN'S KITCHEN - CONTINUOUS\n\n                                COLLEEN\n                          (into phone)\n                      Where are you?  You're driving me crazy,\n                      waiting like this.  I want you in me now!\n\n            EXT. GEORGE'S HOUSE - CONTINUOUS\n\n            George nearly drops the phone; he sits up straight.\n\n                                GEORGE\n                          (into phone)\n                      Colleen?!\n\n            INT. COLLEEN'S KITCHEN - CONTINUOUS\n\n            Colleen sits down, panicked.\n\n                                COLLEEN\n                          (into phone)\n                      I..I..I.. George?!\n\n            EXT. GEORGE'S HOUSE - CONTINUOUS\n\n            George holds the phone out and examines it for a second.\n\n                                JOSH (O.S.)\n                      Is it mine?!\n\n                                GEORGE\n                      God, I hope not.\n\n                                DALE (O.S.)\n                      That's not mine.\n\n                                JOSH (O.S.)\n                      Oh, shit!\n\n            Josh trips, slips and slides off the roof to the ground below\n            as Alyssa lets out a loud SCREAM.\n\n            INT. COLLEEN'S KITCHEN - LATE MORNING\n\n            Colleen tosses the receiver as though it were a ball on fire.\n\n            EXT. GEORGE'S HOUSE - MINUTES LATER\n\n            Everyone, including Robin, is circled around Josh, who is\n            sprawled on the ground.\n\n                                JOSH\n                      I'm okay.  I'm fine.  Maybe I'll go home.\n\n                                ADAM\n                      Is that bone sticking out?\n\n                                ROBIN\n                      Don't move!\n\n                                GEORGE\n                      I'm an idiot to have you up there.\n\n                                JOSH\n                      No.  It's my fault.\n\n            An ambulance is HEARD approaching.  Colleen runs from her\n            house - she's now dressed more appropriately in Levi's and a\n            blouse.\n\n                                COLLEEN\n                      I heard a scream!\n\n                                JOSH\n                      If I could just stand up.\n\n                                ALYSSA\n                      Josh fell.\n\n            Colleen stops a few feet short and covers her mouth with a\n            trembling hand.\n\n                                GEORGE\n                      I think he might have broken a leg.\n\n            The ambulance silences the siren as it turns onto the cul-de\n            sac and stops in front of George's house.\n\n            EXT. GEORGE'S HOUSE - EARLY AFTERNOON\n\n            Robin, George and Sam are sitting at the patio table as Ryan\n            and Adam play catch with Guster.\n\n                                GEORGE\n                      Two ribs, a finger, a leg, a bruised\n                      kidney and a mild concussion aren't bad\n                      considering he landed on brick.\n\n            Neither Robin nor Sam attempts a response.  Finally:\n\n                                ROBIN\n                      I better get the kids home.\n\n                                GEORGE\n                      Not a perfect day.\n\n            Robin stands.  George stands because Robin's standing. \n            Without warning, Robin begins to cry again.  Ryan and Adam\n            stop playing ball.  Sam studies her before finally lowering\n            his eyes.  With her kids looking on, George stands still,\n            hesitant to comfort her.  There's a moment where all that\n            there is, where the only thing seen or heard is Robin's pain. \n            After an awkward amount of time, she wipes her eyes, wipes\n            her nose, crosses around the table to Sam and kisses the top\n            of his head, then his cheek.  Without a word, she walks to\n            her car and climbs in; Ryan and Adam quickly join her in the\n            car.\n\t\t\t\n            INT. GEORGE'S GARAGE - NIGHT\n\n            George is brushing his teeth, dribbling and foaming over the\n            only sink in the garage.  Sam is propped up in bed with\n            Guster, dressed on top of the sheets, fingering through a\n            stack of CD's.  He glances over at his father twice before\n            speaking.\n\n                                SAM\n                      You look like shit, lately.\n\n            George spits and rinses, facing Sam as he wipes his mouth.\n\n                                GEORGE\n                      You look better than ever.\n\n                                SAM\n                      I don't think Mom cares that much that\n                      my...that Peter left.\n\n                                GEORGE\n                      She seemed upset.\n\n                                SAM\n                      What's wrong with your back?\n\n            Sam tries to look slightly less interested than he is by\n            continuing to flip through the CD's.  George sits down.\n\n                                SAM (CONT'D)\n                      I mean, do you need to have surgery on it\n                      or what?  Because those pills you're\n                      taking are for a lot of pain.  And you're\n                      going through them quick.\n\n                                GEORGE\n                      Are you taking them still?\n\n                                SAM\n                      No, but I count them.  In a sock isn't\n                      new, you know?\n\n            This is not easy for George; he fumbles a bit before\n            answering.\n\n                                GEORGE\n                      I'm having a problem with cancer.\n\n            Sam stops flipping though the CD's.\n\n                                SAM\n                      I don't know what that means.  What kind\n                      of problem?\n\n                                GEORGE\n                      The kind where there isn't really an\n                      answer.\n\n                                SAM\n                      I still don't know what that means.\n\n                                GEORGE\n                      I wanted you here so we could have a few\n                      months together.  Maybe everything\n                      happens for a reason.  Something bad to\n                      force something good.\n\n            Sam looks somewhat panicked.\n\n                                SAM\n                      What?  Are you dying?\n\n            This is not easy for George; he fumbles a bit before\n            answering.\n\n                                GEORGE\n                      I'm having a problem with cancer.\n\n            Sam stops flipping through the CD's.\n\n                                SAM\n                      I don't know what that means.  What kind\n                      of problem?\n\n                                GEORGE\n                      The kind where there isn't really an\n                      answer.\n\n                                SAM\n                      I still don't know what that means.\n\n                                GEORGE\n                      I wanted you here so we could have a few\n                      months together.  Maybe everything\n                      happens for a reason.  Something bad to\n                      force something good.\n\n            Sam looks somewhat panicked.\n\n                                SAM\n                      What?  Are you dying?\n\n            George nods his head.\n\n                                SAM (CONT'D)\n                      And you told Mom today?\n\n                                GEORGE\n                      Yes.\n\n            Sam whacks the CD's off his stomach; they scatter across the\n            floor.  Guster scoots off the bed in a panic.\n\n                                SAM\n                      Fuck you!  You knew you were dying from\n                      the start!\n\n            Sam bounds out of bed in a rage.\n\n                                GEORGE\n                      We're all dying from the start.\n                          (beat)\n                      I just got picked for Advanced Placement.\n\n                                SAM\n                      You lied to me!\n\n                                GEORGE\n                      I would have lied to me if I thought I'd\n                      believe it.\n\n                                SAM\n                      This was all for your sake, wasn't it? \n                      Having me here?  Trying to get me to like\n                      you.\n\n                                GEORGE\n                      I never tried to get you to like me.\n                          (beat)\n                      I tried to get you to love me.\n\n                                SAM\n                      Well, congratulations!  You fucking\n                      pulled it off!\n\n            Sam storms out of the garage.\n\n            INT. COLLEEN'S ENTRY - NIGHT\n\n            Colleen pulls a robe around her nightgown as the doorbell\n            RINGS again and again.  She flips on a light and opens the\n            door.  Sam backs away from the door as he talks.\n\n                                SAM\n                      Is Alyssa here?\n\n                                COLLEEN\n                      It's midnight.  What's the matter, Sam?\n\n                                SAM\n                      Nothing.  My dad's dying.  I really need\n                      to talk to Alyssa.\n\n                                ALYSSA (O.S.)\n                      Sam?\n\n            Alyssa is leaning over the upstairs railing.  Sam walks up\n            the stairs as Colleen closes the door.\n\n            EXT. BEACH - EARLY MORNING\n\n            Sea lions romp on a rock offshore as gulls circle above.  The\n            sun sheets the morning on the water that's blinding.\n\n            INT. ALYSSA'S ROOM - EARLY MORNING\n\n            Alyssa is under the covers holding onto Sam, who is still\n            dressed.  Both are asleep.\n\n            INT. GEORGE'S GARAGE - EARLY MORNING\n\n            George is in bed in pain.  A prescription bottle is open\n            beside him and pills are scattered on the sheet.  A KNOCK on\n            the door forces George to gather the pills and hide the\n            bottle.\n\n                                GEORGE\n                      It's open.\n\n            Kurt the cop opens the door dressed in civilian clothes.\n\n                                KURT\n                      It's my day off.  I thought I'd help with\n                      the plumbing.\n\n                                GEORGE\n                      I need you to do me a favor.\n\n                                KURT\n                          (concerned)\n                      God, you look like crap, George.\n\n                                GEORGE\n                      I want you to find someone for me.\n\n            EXT. COLLEEN'S HOUSE - EARLY MORNING\n\n            Colleen walks out her front door straight to her neighbor's\n            house.  After a bit of RINGING and a bit of waiting, Tom (of\n            the walking Tom and Barbara) answers the door in a bathrobe.\n\n                                COLLEEN\n                      Does your son still own a company that\n                      builds houses?\n\n            EXT. GEORGE'S HOUSE - LATE MORNING\n\n            Dale is wiring with Adam and Ryan helping.  Kurt, Robin and\n            Colleen are setting up and sealing the plastic plumbing\n            pipes.  Two new men (GREG and MIGUEL) are on the roof,\n            finishing up where Josh fell down.  MUSIC is playing on the\n            radio.  George is asleep on the chaise lounge.  Alyssa walks\n            across the grass and stops to stare at George.  Tears well in\n            her eyes.  Alyssa continues on to the house and walks up the\n            stairs.\n\n                                COLLEEN\n                      He's been asleep for hours.\n\n                                ROBIN\n                      Is Sam okay?\n\n                                ALYSSA\n                      He won't leave my room.\n\n                                ROBIN\n                      Will he talk to me?\n\n                                ALYSSA\n                      No.\n\n            Robin accepts the answer.  Slowly, they all return to work.\n\n            MONTAGE\n\n            The day is productive as we see the black drainpipes and the\n            copper water runs coming together like a maze.  The roof is\n            shingled and the wiring is nearly complete.  Whether awake or\n            asleep, George spends the day in the chaise lounge.\n\n            EXT. GEORGE'S HOUSE - LATER\n\n            A city inspector's truck pulls to a stop and Bob Larsen steps\n            out with a clipboard and a concerned look on his face. \n            George is dozing on drugs.\n\n                                BOB\n                      You're not a plumber, Kurt.\n\n            Kurt finishes hooking in a plugged tee at a turn and stands.\n\n                                KURT\n                      I worked every summer with my dad.  Check\n                      out what I've done.\n\n                                BOB\n                      It's not whether it's good or bad.  You\n                      know that.  It's whether your licensed.\n\n            Frustrated, Kurt glances around at all his good work before\n            answering.\n\n                                KURT\n                      Are you still renting that illegal non\n                      conforming studio under your house for a\n                      thousand a month?\n\n            Bob opens his clipboard and checks a number of items off.\n\n                                BOB\n                      Okay.  Looks good to me.\n\n                                KURT\n                      Oh, that's embarrassing.  That was too\n                      easy.  At least look around.  I really\n                      did do it right.\n\n                                BOB\n                      That isn't why I'm here, anyway.\n\n            George wakes up and quickly hones in on Bob.\n\n                                GEORGE\n                      I've been dreading you.\n\n            Bob walks toward George as he talks.\n\n                                BOB\n                      Mr. Stevens.  One of your neighbors is\n                      adamant your home has exceeded its\n                      approved height.  He's filed to have\n                      construction stopped immediately.\n\n                                GEORGE\n                      It's thirty feet.\n\n                                BOB\n                      Well, if it is, we have a problem.\n\n            George stands, he appears slightly shaky.\n\n                                GEORGE\n                      I have the permit.\n\n                                BOB\n                      After your last extension request and\n                      with Design Review and the Board of\n                      Adjustment and the appeals to the city\n                      council, was there an amended permit?\n\n                                GEORGE\n                      To the patio and one north-facing\n                      window...\n                          (suddenly realizing)\n                      And six inches to the height.\n\n            George sits back down.  Everyone emerges from the house to\n            join George and Bob.\n\n                                GEORGE (CONT'D)\n                      David Dokos?\n\n            Bob nods.\n\n                                KURT\n                      Why do you let your dog crap on his lawn,\n                      day after day?\n\n                                GEORGE\n                      I don't let him.  He just loves to.\n\n                                COLLEEN\n                      He'll make you tear the entire roof off\n                      rather than give you any satisfaction.\n\n                                BOB\n                      I'm afraid you won't be able to continue\n                      until this is settled.  You can always go\n                      back and file an appeal.\n\n                                GEORGE\n                      That would take weeks.\n\n                                BOB\n                      Months.\n\n                                ROBIN\n                      Just so you know, we'll be here working\n                      tomorrow and every day after until this\n                      house is finished.\n\n                                BOB\n                      He'll call us again and then he'll call\n                      the police.  He has an attorney on\n                      retainer.\n\n                                ROBIN\n                      Just so you know.\n\n            Robin turns and walks back into the house.  Colleen, Alyssa,\n            Adam and Ryan soon follow.\n\n                                BOB\n                      If he hears a hammer, he'll have you\n                      arrested.\n\n            Robin picks up the hammer and pounds a nail into a piece of\n            wallboard.  Dale, Miguel, Greg and Kurt walk back to the\n            house and go back to work.  Bob glances at George who shrugs.\n\n            INT. COLLEEN'S FAMILY ROOM - NIGHT\n\n            Colleen is watching the news as Alyssa walks in to say\n            goodnight.\n\n                                ALYSSA\n                      I'm going to bed.\n\n                                COLLEEN\n                      Has he eaten anything at all?\n\n            Alyssa shakes her head \"no\" as Colleen flips on the TV.\n\n                                COLLEEN (CONT'D)\n                      I'd be more comfortable if he slept in\n                      the guestroom.\n\n                                ALYSSA\n                      I'd be more comfortable if you hadn't\n                      slept with Josh.  And George would be\n                      more comfortable if he weren't dying.\n\n            Colleen is embarrassed Alyssa knows the truth.\n\n                                ALYSSA (CONT'D)\n                      Comfort doesn't mean that much when just\n                      getting through the night is the goal,\n                      Mom.\n\n            Alyssa walks out.  Colleen curls up and hides clutching\n            pillows on the couch.\n\n            INT. GEORGE'S GARAGE - NIGHT\n\n            George is shaking and sweating as he tries to crawl off the\n            bed to his sock drawer.  Guster wakes up and hops off Sam's\n            bed to lick George on the face.\n\n                                GEORGE\n                      Please...I can't.\n\n            George is in real pain as he drops to the floor on his back. \n            He winces and cries out as he pushes himself forward with his\n            legs toward the dresser.  George suddenly stops pushing; his\n            legs slump flat on the concrete floor.  His eyes flutter shut\n            as Guster continues to lick his face.\n\n            INT. ALYSSA'S BATHROOM - MORNING\n\n            Alyssa is dressed, combing through wet hair when the sound of\n            construction distracts her.  She opens her window and sticks\n            her head out.  Suddenly excited, she pulls her head back in.\n\n            INT. ALYSSA'S BEDROOM - MORNING\n\n            Sam is in bed as Alyssa speeds out of the bathroom.\n\n                                ALYSSA\n                      There are like twenty people working on\n                      your dad's house!\n\n            Alyssa bolts for the door, but stops short as she faces Sam.\n\n                                ALYSSA (CONT'D)\n                      If it were my father, I'd wanna spend\n                      every second with him I had left.\n\n            Sam doesn't face her, doesn't even attempt to look up.\n\n                                SAM\n                      You hate your father.\n\n                                ALYSSA\n                      If he tricked me into loving him, is what\n                      I meant.\n\n                                SAM\n                      You'd hate him for the trick.\n\n                                ALYSSA\n                      Not if what he left me was real.\n\n            Alyssa leaves, closing the door behind her.  Sam stays put.\n\n            EXT. GEORGE'S HOUSE - MORNING\n\n            Colleen is talking to Tom and Barbara as they stand to the\n            side of the house where a throng of men assemble the house.\n\n                                TOM\n                      He pulled this crew off a tract in\n                      Newport.  They're the best.\n\n            Robin pulls to a stop on the street and Adam and Ryan run out\n            to gawk at all the workers.\n\n                                ROBIN\n                      What's going on?\n\n                                COLLEEN\n                      I hired some help.\n\n                                ROBIN\n                      Why?\n\n                                ALYSSA (O.S.)\n                      Mom?!\n\n            Colleen glances back as Alyssa runs to join the group.\n\n                                COLLEEN\n                      Atonement.\n\n                                ALYSSA\n                      Who are all these people?\n\n                                ROBIN\n                      Where's George?\n\n                                COLLEEN\n                      I think he's still sleeping.\n\n            ANOTHER VIEW\n\n            Robin walks to the garage door and KNOCKS.  Guster barks. \n            Robin KNOCKS again before opening the door.\n\n            INT. GEORGE'S GARAGE - MORNING\n\n            Guster is beside George on the floor.  Robin rushes in and\n            kneels down.\n\n                                ROBIN\n                      George!?\n\n            She presses her hand against George's cheek.\n\n                                ROBIN (CONT'D)\n                      Wake up...You're still warm.\n\n            George's eyes flutter open.  Robin leans down and kisses him\n            on the cheek.  George focuses on Robin; he tries to speak,\n            stops, and tries again.  Finally, in a weak voice, we hear:\n\n                                GEORGE\n                      Stop licking me.\n\n            INT. COLLEEN'S ENTRY - MORNING\n\n            Alyssa bursts into the house and rushes up the stairs.\n\n            INT. ALYSSA'S ROOM - MORNING\n\n            Sam is sitting on the edge of the bed as Alyssa enters.\n\n                                ALYSSA\n                      Your dad's going to the hospital!\n\n            Sam doesn't respond.\n\n                                ALYSSA (CONT'D)\n                      Come on!\n\n            Alyssa holds out her hand as we HEAR the ambulance approach.\n\n                                SAM\n                      I don't wanna go.\n\n                                ALYSSA\n                      He asked where you were!  He wants you\n                      with him.\n\n                                SAM\n                      I don't wanna go.\n\n            Sam is nearly pleading, frightened to move.  Alyssa walks\n            out.  The siren stops.  The front door closes.  Sam sits\n            still.\n\n            EXT. GEORGE'S HOUSE - AFTERNOON\n\n            The house is coming together incredibly fast with all the\n            workers.  Tom and Barbara are supervising the crew.  David\n            Dokos whips around the corner in his black Mercedes and parks\n            in his driveway, rushing over as he yells.\n\n                                DAVID\n                      Nothing is built until the Board of\n                      Adjustment hears the appeal!\n\n            David is searching for George, finally settling for Tom.\n\n                                DAVID (CONT'D)\n                      Where is he?\n\n                                TOM\n                      I should have reported you for tossing\n                      that piece of dog doo.\n\n            Tom's face is flushed; Barbara calms him by grabbing his arm.\n\n                                BARBARA\n                      Tom, let's not overreact now.\n\n            David Dokos stomps his feet and thrusts his fist into the\n            air, as a child might if he were overreacting.\n\n                                DAVID\n                      I want this fucking piece of shit\n                      construction stopped now and I want that\n                      goddamn roof ripped off and lowered and I\n                      don't care if I have to spend a shit load\n                      of money to get it done!!  I will do\n                      it!!!\n\n            Tom and Barbara simply stare at him in disbelief.  David\n            walks back to his house.  Tom turns to his wife.\n\n                                TOM\n                      I want this house finished before he can\n                      stop it.\n\n            Tom rolls up his sleeves and walks toward the house to help.\n\n            INT. COLLEEN'S ENTRY - EVENING\n\n            Colleen and Alyssa walk into the house listless - both look\n            tired and sad.\n\n            INT. ALYSSA'S BEDROOM - EVENING\n\n            Alyssa enters the room, walks into the bathroom.  Sam is\n            gone.\n\n                                ALYSSA\n                      Sam?\n\n            INT. ROBIN'S FAMILY ROOM - EVENING\n\n            Adam and Ryan are sitting next to each other on the floor\n            subdued, tossing a ball to Guster.  The kitchen door opens\n            and Peter walks into the family room.  Adam is the first to\n            notice but the last to react.  Ryan stands as Guster barks.\n\n                                RYAN\n                      Guster, be quiet.\n\n            Peter has a growth of beard and is dressed in Levi's and a\n            knit shirt - he doesn't look like himself.\n\n                                PETER\n                      Hey.\n\n                                RYAN\n                      Hey.\n\n                                PETER\n                      You got a dog?\n\n                                RYAN\n                      It's not ours.  It's George's.\n\n            Peter nods.\n\n                                PETER\n                      I've missed you guys.\n\n                                RYAN\n                      Why?\n\n            Ryan is tough - not giving an inch.  Peter stares at his\n            sons, ashamed that the question could be asked.  Adam stands\n            and walks to this father, takes his hand.\n\n                                RYAN (CONT'D)\n                      I'll tell Mom you're here.\n\n            INT. HOSPITAL ROOM - EVENING\n\n            George is asleep, looking dead with tubes in his arms.  We\n            HEAR a bit of the song by Warren Zevon, \"MY SHIT'S FUCKED\n            UP.\"  'Well, I went to the doctor/I said 'I'm feeling kind of\n            rough'/He said, 'I'll break it to you, son, your shit's\n            fucked up.'\n\n            EXT. GEORGE'S HOUSE - EVENING\n\n            Sam is alone on the roof in the fading light, stringing party\n            lights over the shingles and under the eves.\n\n            INT. ROBIN'S FAMILY ROOM - EVENING\n\n            Robin couldn't look worse as she walks down the hall to the\n            family room with Ryan.  Peter is standing alone.  Ryan joins\n            Adam on the floor with Guster.  Robin stops and stands ten\n            feet from Peter.\n\n                                PETER\n                      I thought maybe... I know it's late...but\n                      if you're hungry...\n\n            EXT. GEORGE'S HOUSE - EVENING\n\n            The sun has set as Sam stands at the edge of the cliff trying\n            to garner the courage to jump.  After the sound of a wave\n            crashing against the cliff, Sam closes his eyes and leaps off\n            the edge of the earth.\n\n            INT. ALYSSA'S ROOM - EVENING\n\n            Alyssa is sitting on the edge of her bed as Colleen stops\n            beside the open door.\n\n                                COLLEEN\n                      Are you doing okay?\n\n            Alyssa shakes her head \"no\".  Colleen walks into the room and\n            sits down beside her daughter.  Alyssa rests her head on her\n            mother's shoulder.\n\n            INT. RESTAURANT - EVENING\n\n            Robin, Peter, Ryan and Adam are in the middle of dinner as\n            Adam excitedly tries to explain all that he and his brother\n            have accomplished.\n\n                                ADAM\n                      And we got to take all the old paint off\n                      all the doors and then George taught us\n                      how to stain everything and he even let\n                      me choose the color I liked best!  And he\n                      said he loved me!\n\n                                RYAN\n                      We did a lot of the wiring too.\n\n                                ADAM\n                      With Dale.  Oh, and I got to drill a hole\n                      into a board to put the wire through!\n\n                                PETER\n                      I've never heard you so excited about\n                      anything.\n\n                                ADAM\n                      Maybe you can come help us too?!\n\n                                PETER\n                      I'd like that.\n\n            Peter glances at Robin.\n\n            INT. HOSPITAL CORRIDOR - NIGHT\n\n            Sam is still wet as he walks down the hall.  We HEAR more of\n            the Warren Zevon song. 'I had a dream/Ah, shucks, oh,\n            well/Now it's all fucked up/It's shot to hell.'\n\n            INT. GEORGE'S HOSPITAL ROOM - NIGHT\n\n            Sam enters the room as a NURSE scurries to catch up.\n\n                                NUR\n                      I'm afraid no one's allowed in here now.\n\n                                SAM\n                      He's my dad.\n\n            Sam is staring at George, who is either asleep or\n            unconscious.  The nurse finally relents and walks out.  Sam\n            sits in a chair beside the bed and begins to cry.  Slowly,\n            George's arm slides out beyond the railing of the bed, his\n            hand open.  Sam does his best to stop crying.\n\n                                SAM (CONT'D)\n                      I brought you something.\n\n            Sam pulls out a pair of sunglasses from his shirt pocket. \n            George shakes death and drugs away as he manages to open his\n            eyes.\n\n                                GEORGE\n                          (weakly)\n                      I don't wanna go, Sam.\n\n                                SAM\n                      Here.\n\n            Sam gently slides the sunglasses over his father's eyes; he\n            rushes to the window and pulls the curtains back.\n\n                                SAM (CONT'D)\n                      Can you see?\n\n            Sam walks back to the bed and pulls it toward the window,\n            stretching the cords and tubes to their limit.  He grabs the\n            remote and raises George's head.  Off in the distance,\n            against the backdrop of an endless black ocean, George's\n            house is seemingly on fire with lights.  Pain can't stop a\n            smile.\n\n                                SAM (CONT'D)\n                      It's almost done.\n\n            George takes hold of Sam's hand with his own.  They continue\n            to stare at the lit house holding hands.\n\n            INT. ROBIN'S ENTRY - NIGHT\n\n            The door opens and Robin, Adam, Ryan and Peter are greeted by\n            Guster, who bounces around like a wired rabbit.\n\n                                ROBIN\n                      Go brush your teeth and get right into\n                      bed.  It's late.\n\n            Adam runs to Robin for a kiss, then grabs Peter with a hug.\n\n                                ADAM\n                      Goodnight.\n\n                                PETER\n                      Goodnight.\n\n            Adam runs up the stairs, Guster right on his heels.  Ryan is\n            staring at his father.\n\n                                RYAN\n                      Do you know anything about building a\n                      house?\n\n                                PETER\n                      No.\n\n                                RYAN\n                      I guess I could teach you some things.\n\n                                PETER\n                      Okay.\n\n            Robin sneaks a quick kiss on Ryan's cheek as he heads for the\n            stairs.  After he's gone, Robin turns back to Peter.\n\n                                ROBIN\n                      I hardly recognize you with a beard.\n\n                                PETER\n                      That was my plan...to be hardly\n                      recognizable to you as me.\n\n                                ROBIN\n                      I feel in love with George again.\n\n            Peter nods, something he already knows.\n\n                                PETER\n                      I'll see you tomorrow.\n\n            Robin nods.  There's a moment where it's clear that Peter\n            doesn't want to leave and Robin doesn't want him to leave,\n            but after the moment passes, Peter walks out and Robin sits\n            down at the base of the stairs.\n\n            INT. ALYSSA'S BEDROOM - NIGHT\n\n            Colleen and Alyssa are asleep together on the bed.\n\n            EXT. GEORGE'S HOUSE - EARLY MORNING\n\n            Sam is up on a ladder, pounding copper nails into cedar\n            shingles that face the house.  Alyssa runs across the grass.\n\n                                ALYSSA\n                      Where are you?!\n\n                                SAM\n                      Floating to Catalina.\n\n                                ALYSSA\n                      What?\n\n            Sam steps off the ladder.  Alyssa wraps her arms around him. \n            Sam removes sleepy bugs from Alyssa's eyes before he kisses\n            her.  A police car stops in front of the house and Kurt steps\n            out.  Alyssa and Sam turn to face him.\n\n                                KURT\n                      He said he heard hammering.\n\n                                SAM\n                      Who?\n\n            Before Kurt can answer, David Dokos storms out of his house\n            and trudges toward them talking.\n\n                                DAVID\n                      My attorney is driving down from Newport\n                      Beach.  If I hear one more nail being\n                      hammered, I swear to God before this is\n                      all over I'll end up owing this house!\n\n            As Sam is staring at David Dokos, a hint of recognition\n            crosses his face.\n\n                                KURT\n                      Mr. Dokos says that your father missed\n                      his height envelope by six inches.\n\n                                ALYSSA\n                      He wants the entire roof taken off and\n                      lowered.\n\n                                SAM\n                      Wait a minute.\n\n            A wave of fear rushes through David Dokos that's instantly\n            visible.\n\n                                SAM (CONT'D)\n                      Do you drive a black Mercedes?\n\n                                DAVID\n                      No.\n\n            Sam figures out why we knows David Dokos - from the aborted\n            blowjob in the black Mercedes.\n\n                                DAVID (CONT'D)\n                      I'm going back to my house to wait for my\n                      lawyer.\n\n            David starts to leave, but Sam stops him with:\n\n                                SAM\n                      Are you sure we need lawyers?\n\n            David's face is sheet white as he forces himself back around.\n\n                                SAM (CONT'D)\n                      Because all we're really talking about is\n                      six inches, right?\n\n                                DAVID\n                      Are you threatening me?\n\n                                KURT\n                      What are you talking about?\n\n                                SAM\n                      I'm sixteen years old.  I'm underage. \n                      How could I possibly threaten you?\n\n            David Dokos stares at Sam for a long time before glancing at\n            Kurt and his police uniform for just a second.\n\n                                SAM (CONT'D)\n                      Would you like to help us finish the\n                      house, Mr. Dokos?\n\n                                DAVID\n                      Yes, I would.\n\n                                KURT\n                      What the fuck?\n\n                                SAM\n                      Everything happens for a reason.  That's\n                      what my dad said.\n\n                                KURT\n                      Then you tell me, what just happened?\n\n                                SAM\n                      The payoff.\n\n            Sam walks back to the ladder and hammer, leaving Kurt and\n            Alyssa confounded.  David takes a step back.\n\n                                DAVID\n                      I'll just...change clothes.\n\n            Sam pounds in another shingle as David walks quickly back to\n            his house.\n\n            INT. GEORGE'S HOSPITAL ROOM - MORNING\n\n            George is unconscious as Robin enters and sits down beside\n            him with a video camera.\n\n                                ROBIN\n                      I found the last time you were happy.\n\n            Robin adjusts the viewfinder and presses play on the camera. \n            George doesn't wake up.  On the tiny screen, we see a younger\n            George in the ocean, his arms wrapped around six-year old\n            Sam; he shields Sam from the waves and kisses his son's hair. \n            Robin rests the camera on the bed as the video continues to\n            play.  She takes hold of George's hand and begins to weep as\n            she presses her head on his chest.  An envelope with Robin\n            and Sam's name on it rests on the nightstand beside the bed.\n\n            INT. GEORGE'S HOUSE - MORNING\n\n            Twenty men along with Tom and Barbara, Alyssa and Colleen,\n            Sam and David Dokos are painting; installing windows, floors\n            or cabinets as the house begins to take its final shape.\n\n            EXT. GEORGE'S HOUSE - MORNING\n\n            Peter stops and steps out of his car as Adam and Ryan race\n            for the house.\n\n                                ADAM\n                      It's almost done!\n\n            Sam walks out the front door.\n\n                                SAM\n                      Do you guys feel like painting?\n\n                                ADAM\n                      What color?\n\n                                SAM\n                      Red.\n\n                                ADAM\n                      I love red!  That's my favorite color!\n\n            Adam and Ryan walk into the house as Sam focuses on Peter,\n            who keeps his distance.\n\n                                PETER\n                      You don't look like you.\n\n                                SAM\n                      Either do you.\n\n            Peter glances down at his work clothes.\n\n                                PETER\n                      I thought I might be able to help, but it\n                      looks like you have all you can handle.\n\n                                SAM\n                      Do you like red?\n\n            Peter nods, hesitates for a moment before walking up the\n            driveway to Sam.\n\n            INT. GEORGE'S HOSPITAL ROOM - AFTERNOON\n\n            George's bed is empty, stripped of everything.  Robin is\n            still sitting in a chair beside the bed, a letter resting on\n            her lap.  A NURSE stops at the door.\n\n                                NURSE\n                      Are you sure we can't call anyone?\n\n            Robin shakes her head \"no\".  The nurse moves on.\n\n            EXT. GEORGE'S HOUSE - LATE AFTERNOON\n\n            From the outside, the house is finished: windows in, doors\n            on, roof shingled.  The sun drops behind the house, causing a\n            halo of bright light to envelop it.\n\n            INT. GEORGE'S HOUSE - LATE AFTERNOON\n\n            Most of the workers have gone home, because most of the work\n            is done.  All the floor are hand-scrapped cherry; huge beams\n            and wood planks lend a strength to the ceiling.  The kitchen\n            cabinets are in; the bathrooms are complete.  Sam, Ryan,\n            Alyssa, Adam and Peter are the only ones left.  Outside, we\n            hear a car pull to a stop.\n\n                                ADAM\n                      Mom!\n\n            Adam and Ryan run down the stairs.  Peter stops cleaning a\n            brush and walks to the window as Sam stands still.\n\n            EXT. GEORGE'S HOUSE - LATE AFTERNOON\n\n            Adam runs to Robin and meets her mid-yard with a hug.\n\n                                ADAM\n                      When does George get to come see his\n                      house?\n\n                                ROBIN\n                      It's so beautiful.\n\n            Adam and Robin are staring at the house.  Ryan can see the\n            strain on his mother's face.\n\n                                RYAN\n                      Is George okay?\n\n            All Robin can do is shake her head \"no\".\n\n            INT. GEORGE'S HOUSE - LATE AFTERNOON\n\n            Sam backs away from the window.  Peter turns to face him. \n            Standing straight as he can, being as brave as he can, tears\n            well in Sam's eyes as he softly shakes.  Peter walks to Sam\n            and wraps his arms around him.\n\n                                GEORGE (V.O.)\n                      I always thought of myself as a house.  I\n                      was always what I lived in.  It didn't\n                      need to be big.  It didn't even need to\n                      be beautiful.  I just needed to be mine. \n                      I became what I was meant to be.  I built\n                      myself a life.  I built myself a house.\n\n            Sam clings to Peter, completely lost in sorrow.\n\n            EXT. GEORGE'S HOUSE - LATE AFTERNOON\n\n            Adam and Ryan have their arms wrapped around their mother as\n            we pull back and watch the sun set the sky off in dazzling\n            hues of orange and red.\n\n            INT. RANGE ROVER - ONE WEEK LATER\n\n            Robin is driving with Sam beside her in a low-middle income\n            neighborhood in Santa Ana.  Sam is holding the letter.\n\n                                ROBIN\n                      You're sure about this?\n\n                                SAM\n                      Yeah.\n\n                                ROBIN\n                      You could keep it and rent it out?\n\n                                SAM\n                      This is what he wants.\n\n                                ROBIN\n                      I read the letter.  You read the will. \n                      He wants you to keep it.  To live in it\n                      some day.\n\n                                SAM\n                      Then maybe this isn't what he wants, but\n                      this what he was hoping for.\n                          (beat)\n                      Maybe it's what I want.\n\n            It's clear to see that Robin's proud of Sam's decision.  She\n            checks an address on a piece of paper and pulls to a stop.  \n            Sam steps out of the car, holding the letter.\n\n            EXT. SANTA ANA APARTMENT BUILDING - MORNING\n\n            Sam is shaking slightly as he walks up the cracked concrete\n            walk to the door.  He RINGS the bell.\n\n                                GEORGE (V.O.)\n                      Twenty-one years ago, my father crossed a\n                      double-line.  He changed my life and the\n                      life of a little girl forever with that\n                      mistake.  I just can't stop thinking\n                      about her.\n\n            A WOMAN in her mid-twenties opens the door in her wheelchair.\n\n                                WOMAN\n                      Hello.\n\n            Sam is very nervous as he reaches in his pocket and pulls out\n            a set of keys.\n\n                                SAM\n                      My father built you a house...\n\n            The woman is confused as Sam holds out the keys.\n\n            EXT. GEORGE'S HOUSE - MORNING\n\n            The house is majestic in its setting among the trees and\n            grass, on the jagged just of rock that accepts the constant\n            crash of ocean against it with a solid permanence.  This is\n            where, if you were a house, you would want to be built.\n\t\t\t                                                                THE END.\n\n\n\n\n\nLife As A House\nWriters :   Mark Andrus\nGenres :   Comedy  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:29:22.846269"}