{"title": "Limey, The", "film_link": "/Movie Scripts/Limey, The Script.html", "script_link": "/scripts/Limey,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Limey, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Limey, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Lem Dobbs\" title=\"Scripts by Lem Dobbs\">Lem Dobbs</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> : August 1998<br/>\n<br/>\n<a href=\"/scripts/Limey,-The.html\">Read \"Limey, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n   <title>\"The Limey,\" production draft, by Lem Dobbs</title>\n\n\n\n   <pre>\n\n\n\n\n\n\n\n\n\n\n\n                               <u>THE LIMEY</u>\n\n\n                                   by\n\n\n<b>                               LEM DOBBS\n</b>\n\n\n\n\n\n\n\n\n\n                                                     draft 08/03/98\n\n\n\n\n\n\n\n\n\n<b>     NOTE:  THE HARD COPY OF THIS SCRIPT CONTAINED SCENE NUMBERS.\n</b><b>     THEY HAVE BEEN REMOVED FROM THIS SOFT COPY.\n</b>\n\n\n\n\n\n\n\n\n\n     Wilson's first impression of Los Angeles was blue.  He was in\n     the sky at the time, so it was a curious reversal, looking\n     down rather than up at the color he had always felt was\n     nature's finest.\n\n     Swimming pools.  Hundreds of them.  Pockmarking the landscape\n     like miniature lakes.  A flat landscape of straight streets\n     and square blocks and sparse grass that didn't look quite\n     green enough.\n\n     As far as Wilson could remember, he had only ever seen seven\n     or eight swimming pools in his entire life and they had been\n     public ones.  Here everyone had their own.  Marvellous.\n\n     There was the one at the Butlin's holiday camp where he had\n     enjoyed his last legitimate employment -- as driver of a tour\n     bus.  And there was the one at Crystal Palace he had gone to\n     once or twice when he was younger.  He was most familiar,\n     though, with the Chelsea Baths as he had lived for some time\n     in a flat nearby in what he now thought of as his good years\n     -- before he'd gone grey, went to prison, and found himself in\n     a plane over a foreign town arriving to avenge the death of\n     his daughter.\n\n\n\n\n\n\n\n\n\n\n     WHOOSH!  The sound of automatic doors opening and --\n\n     <u>EXT. ARRIVALS TERMINAL.  L.A. AIRPORT.  AFTERNOON.</u>\n\n     WILSON steps out into the late sunlight and the heat of the\n     day.  A slow-motion moment while he gets acclimatized.  He\n     wouldn't have ever felt quite this kind of heat before.\n     After such a rigorously air-conditioned interior.  Or seen\n     cops wearing guns on their belts.  Or black cops, for that\n     matter, with guns on their belts.  Or seen people as fat as\n     Americans on their home turf.  Things someone from England\n     notices immediately, whether consciously at first or not.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. MOTEL.  EVENING.</u>\n\n     Wilson's not here for comfort.  Shown to a shitty room, round\n     the corner of a typical 2nd-level outside walkway.  Airport\n     close by.\n\n     <u>INT. MOTEL ROOM.  EVENING.</u>\n\n     He draws a curtain open across a window in one strong easy\n     glide.  His moves are neat.  His expressions just as\n     economical, not giving much away.  Outside the planes are\n     practically on top of us. The sunset colors strange and\n     chemical.\n\n     He's only got one light bag.  Unzips, unpacks a few things.\n     Change of clothes, a travel kit, and some familiar items\n     (shaving foam/toothpaste/deodorant} bearing unfamiliar\n     British brand names.\n\n     Goes into the bathroom.  Turns on the shower in there.\n\n     Comes back to sit on the bed.  Takes an envelope out of his\n     jacket.\n\n<b>     ENVELOPE\n</b>\n     Turns it over to see the return address on the back.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. TAXI.  NIGHT.</u>\n\n     Wilson in the back.  Stares at the impenetrable name on the\n     driver's posted ID. Glances at the driver.\n\n     DRIVER glances back at his quiet passenger in the rearview\n     mirror.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. SMALL HOUSE.  NIGHT.</u>\n\n     Wilson walks up a cracked little path to the front door.\n     Lower middle-class street.  Two cars in the driveway, one\n     behind the other.  Lights on inside the house -- as he rings\n     the bell.\n\n<b>     ED RAMA\n</b>\n     Answers it.  Hispanic.  Late 30's.  Chairman Mao on his T-\n     shirt notwithstanding, an easygoing sort of fellow.  Not\n     looking for any trouble -- anymore.  But once did, and able\n     to handle himself if any shows up.  Which it has.\n\n<b>                         WILSON\n</b>               Edward Rama?\n\n<b>                         ED\n</b>               Eduardo.\n                   (rolling the R)\n               Rama.\n\n<b>                         WILSON\n</b>               You're home, then.\n\n     He turns, waves away the taxi he's kept waiting.  While\n     Eduardo Rama waits for an introduction.\n\n<b>                         WILSON\n</b>               My name's Wilson.\n\n     Accent speaks for itself.  Hard, working-class.\n\n<b>                         ED\n</b>               Wilson?\n\n     Knows the name.  But just now it's unexpected.  He's holding\n     a hot TV dinner, hand protected by a dish towel.\n\n<b>                         WILSON\n</b>               You wrote to me about my daughter.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. ED'S HOUSE.  NIGHT.</u>\n\n     Ed takes Wilson inside.\n\n<b>                         ED\n</b>               I didn't expect anyone.\n\n<b>                         WILSON\n</b>               No reason.\n\n<b>                         ED\n</b>               I mean, what has it been -- six months?\n\n<b>                         WILSON\n</b>               Round about, yeah.\n\n     They've entered a cauldron of family life.  TV blaring\n     (SHOWBIZ TONIGHT!).  A couple of younger KIDS yelling \"Mama\".\n     Their MOTHER shouting back at them from the kitchen (in\n     Spanish) that she only has two hands.  A sullen TEENAGER\n     walking by.\n\n<b>                         ED\n</b>               I didn't even know who I was writing to --\n               just someone with the same last name.\n               She never talked about any family.\n\n<b>                         WILSON\n</b>               It was better than a telegram.\n\n     Ed opens a screen door to the backyard.\n\n     <u>EXT. ED'S BACKYARD.  NIGHT.</u>\n\n     They sit at an outdoor table.  Wilson with a TV dinner in\n     front of him now too.  Sounds from inside MUTED.  Even this\n     little house has a little pool.\n\n<b>                         WILSON\n</b>               Who done it, then?\n\n<b>                         ED\n</b>               Huh?\n\n<b>                         WILSON\n</b>               Snuffed her.\n\n     Ed surprised at Wilson's directness.  Ed stands nervously.\n\n<b>                         ED\n</b>               Now, wait up a second, man.\n\n     And paces back and forth.\n\n<b>                         ED\n</b>               I never said nothin' about nothin' like\n               that.  No, no, no.  That's not what I\n               wrote to you.\n\n<b>                         WILSON\n</b>               No, but between the lines, eh?\n               Mysterious circumstances, and that.\n\n     Ed stops pacing.\n\n<b>                         ED\n</b>               Look, I sent you that newspaper clipping,\n               all right?  I told you what I know.  It\n               was an accident.  I didn't say anything\n               about anybody being \"snuffed.\"\n\n     Beat.\n\n<b>                         WILSON\n</b>               This bloke she was bunked up with.  This\n               Terry what'sit.\n\n<b>                         ED\n</b>               Terry Valentine.\n\n<b>                         WILSON\n</b>               Valentine.  What's he got to say for\n               himself?\n\n<b>                         ED\n</b>               I dunno.  What's he gonna say?  They had\n               a fight that night, she drove away, she\n               was upset?  I don't even know the guy.\n               Don't get me wrong, Jenny and me were\n               friends, but we didn't travel in the same\n               social circles.  She had her life, I had\n               mine.\n\n     Makes a kind of scoffing gesture:  and you can see what my\n     life is.\n\n<b>                         ED\n</b>               Valentine came into the restaurant where\n               I work with Jenny a couple times.  He's a\n               money guy.  Jenny would say, hey, here's\n               my friend Eddie and he would shake my\n               hand and everything, but he wouldn't even\n               see me, you know what I mean.\n\n     Wilson gazes up at the sky.  Clear night.  Stars.\n\n<b>                         WILSON\n</b>               How long had she been in the States?\n                   (as if to himself, somewhat\n                    wistful)\n               Near on ten years, wasn't it?  Long\n               enough to know her way about, I reckon.\n\n     Ed leans down, palms on the tabletop, facing Wilson.\n\n<b>                         ED\n</b>               There was an investigation, okay?  The\n               car was totalled.  Jennifer was ... Her\n               neck was broken.  On impact, they said.\n               So she wouldn't have ... felt the effects\n               of the fire.\n                   (helpless shrug)\n               It happens up there.  Happens a lot.\n               What more can I tell you.\n\n     Wilson taps out a cigarette from a pack of \"Silk Cut\" he's\n     produced from his pocket.\n\n<b>                         WILSON\n</b>               What more is there.\n\n<b>                         ED\n</b>               I'm just sayin' -- it was a steep\n               hillside.  There was no moon that\n               night ...\n\n     Wilson's quiet stillness is getting to him.\n\n<b>                         ED\n</b>               Coulda happened to anyone, man.  I never\n               knew her to be reckless.  I mean, sure,\n               she would smoke a little grass, or\n               something, have a few drinks.  But that's\n               it, nothing more than that.\n\n<b>                         WILSON\n</b>               No, not my girl.  Self-control, she had.\n               Point of pride.\n                   (smokes)\n               And people don't change, do they.\n\n<b>                         ED\n</b>               I dunno ... Maybe they do.\n\n     Wilson notes the tattoos on Ed's forearms.\n\n<b>                         WILSON\n</b>               Going straight, are ya.\n\n     Ed looks at him.  Sits down again.  Keeping his forearms under\n     the table.\n\n<b>                         ED\n</b>                   (looks away)\n               Boomerang.\n\n<b>                         WILSON\n</b>               Y'what?\n\n<b>                         ED\n</b>               I knew when I was droppin' that letter\n               into the mail slot it was gonna come back\n               and smack me in the face.\n                   (looks at Wilson again)\n               I did my time, okay?  My sister, her ol'\n               man's up in Chino right now doin' eight\n               years.\n\n<b>                         WILSON\n</b>                   (re the family inside)\n               This ain't your lot?\n\n<b>                         ED\n</b>               You kiddin', man?  I don't need a wife\n               and screamin' kids.  I still got my\n               youth.\n\n     And yet -- he lives here.  Wilson declines to pursue the\n     matter.\n\n<b>                         ED\n</b>               I go to work, try to keep my life\n               together, put all that shit behind me,\n               man.  What d'you want from me.\n\n<b>                         WILSON\n</b>                   (calmly smoking)\n               I only asked.\n\n     Ed sighs.  Reaches for one of Wilson's cigarettes.\n\n<b>                         ED\n</b>               Couple weeks before she died, Jennifer\n               asked me to drive her downtown.  Said she\n               was meeting -- her boyfriend --\n               Valentine.  But I think she was looking\n               for him.\n\n     <i>FLASH CUTS:\n\n     ED AND JENNIFER. In a car, downtown. She has the same steely\n     intensity as her father. Ed looks a little worried.</i>\n\n<b>                         WILSON\n</b>                   (lighting Ed's cigarette)\n               What, tryin' to catch him with another\n               bird?\n\n<b>                         ED\n</b>               That's what I thought, man.  But it was\n               not a hotel or nothin' that we went to.\n               It was someplace else.\n\n<b>                         WILSON\n</b>               Where abouts?\n\n     <i>FLASH CUTS:\n\n     JENNIFER. Talking to a beefy SUPERVISOR. Or talking at him.\n     Either way, he isn't happy.\n\n     MEAT PUPPETS. Watch instead of working.\n\n     ED. Taking all this in.</i>\n\n<b>                         ED\n</b>               Bad place, man.  Bad people.  Some guys\n               loading some trucks.  Some kinda deal\n               goin' down.\n                   (anticipating Wilson's next\n                    question)\n               I don't know and I don't care.  Maybe\n               they're shipping fava beans to Eskimos.\n\n<b>                         WILSON\n</b>               Did Jenny know?\n\n<b>                         ED\n</b>                   (shrugs)\n               Valentine wasn't even there.  If he was\n               into something, if she was involved --\n               who can say.\n                   (stands up again)\n               But I'll tell you something.  She stood\n               in front of these dudes, man.  Eyeballing\n               <u>them</u>.  Checking <u>them</u> out.\n                   (beat)\n               I felt like she was covering <u>my</u> ass that\n               day.\n\n     Unconsciously rubbing his arms where his tattoos are.\n\n<b>                         ED\n</b>               I drove her back to Valentine's house.\n\n     <i>FLASH CUT:\n\n     VALENTINE. Standing in front of his house. His expression\n     says: We have something to discuss.</i>\n\n<b>                         ED\n</b>               He was standing outside waiting for her.\n               That's the only other time I ever saw\n               him.\n                   (a short sad note)\n               Last time I saw her.\n\n     He meets Wilson's gaze.  As hard and pointed as a drill\n     through his skull.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. ED'S CAR.  NIGHT.</u>\n\n     Ed drives Wilson back to his motel.  Wilson silent.  Ed still\n     not quite sure who he's dealing with.  Is this really or\n     merely a grieving dad?\n\n<b>                         ED\n</b>               What you gonna do, man?  You gonna go to\n               the cops?\n\n<b>                         WILSON\n</b>               Nah, coppers don't do nothing, do they.\n\n<b>                         ED\n</b>               Those streets up in the hills, man.\n               Gotta be real careful, keep your eye on\n               the ball.  Two o'clock in the morning,\n               it's dark, your mind is all agitated,\n               you're drivin' a little too fast ...\n                   (beat)\n               Those curves don't kid around.\n\n     Could be talking about the girl.  Wilson doesn't move.  But\n     touch him, he'll explode.  Out the window lights are passing,\n     but no landmarks.  He might as well be on the moon.\n\n<b>                         ED\n</b>               You should talk to Elaine.  That was her\n               best friend.\n\n<b>                         WILSON\n</b>               She didn't write to me, did she.\n\n<b>                         ED\n</b>               She didn't know what to say.\n                   (shrugs)\n               I thought someone should say something.\n               To someone.  With me it was, I don't know\n               -- Jenny liked me for some reason.  I\n               felt like I owed her.\n\n<b>                         WILSON\n</b>               Who'd Jenny get it off of -- this grass\n               or whatever?\n\n<b>                         ED\n</b>                   (self-conscious again)\n               Not me, man.  I'm no drug dealer, what\n               you think.\n\n<b>                         WILSON\n</b>                   (re Ed's tattoos)\n               I think you didn't get that lot in the\n               Navy, doing your National Service.\n\n<b>                         ED\n</b>               I already told you, man.  Corcoran.  Know\n               what that is?  State prison.\n\n<b>                         WILSON\n</b>               Nick's a nick, n' it?  No matter what\n               state you're in.  State of remorse, most\n               likely -- for gettin' caught.\n\n<b>                         ED\n</b>               But that's not me anymore.  That's when I\n               was into the gang lifestyle.  That's not\n               who I am now.  Five years in the joint --\n               that's it for me, man.\n\n     Now Wilson drops the clanger.\n\n<b>                         WILSON\n</b>               Just got out meself, didn't I.\n\n     And Ed turns.  Looks at Wilson.  Fellow ex-con.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. WILSON'S MOTEL.  NIGHT.</u>\n\n     Wilson out of the car, shuts the passenger door.  Ed on the\n     other side, looks over the roof at him.\n\n<b>                         ED\n</b>               Go home, man.\n                   (plane taking off in\n                    background)\n               Get on a plane.\n\n     Wilson has other plans.\n\n<b>                         WILSON\n</b>               I'll be needing a shooter.\n\n     Makes his fingers like a gun.  And a clicking sound.\n\n<b>                         ED\n</b>                   (comes quickly over)\n               You're kiddin' me, right?\n\n<b>                         WILSON\n</b>               What do I do, then, look in the bleedin'\n               Yellow Pages?\n\n<b>                         ED\n</b>                   (an urgent whisper)\n               These are not guys you can just go run a\n               number on, man.\n\n<b>                         WILSON\n</b>                   (looking around)\n               Thought perhaps there'd be dispensing\n               machines, you know.  Bung in your coins,\n               come out with a .44 Magnum, fully-loaded.\n\n     Ed throws up his hands, walks back to his driver's side door.\n\n<b>                         ED\n</b>               Are you a resident of California?\n               You gonna fill out forms, man?  Do the\n               background check?  Go through a three-day\n               waiting period?\n\n<b>                         WILSON\n</b>               Sod that.  Gotta get back before my\n               probation officer wonders where I've\n               skived off to.\n\n<b>                         ED\n</b>               Probation?  Man, you crazy.  They\n               shouldn't've let you outta your country,\n               much less prison.\n\n<b>                         WILSON\n</b>               Travelling on a dodgy passport, n' all.\n\n     Walks round to come face to face with Ed once more.\n\n<b>                         WILSON\n</b>               Which is why I thought, save some time,\n               get what I need under the table, like.\n\n<b>     ED\n</b>\n     As if resigned and mulling the problem over:\n\n<b>                         ED\n</b>               Under the table?\n\n<b>                                                               CUT.\n</b>\n     <u>INT. GUN SHOW.  DAY.</u>\n\n     Hundreds of tables.  Under bright lights.  Displaying every\n     kind of firearm.  Handguns, rifles, shotguns, parts to make\n     machine guns.  A weapons bazaar.\n\n<b>     WILSON AND ED\n</b>\n     Walking around.  Even a cool customer like Wilson can't help\n     but be impressed by America's loving embrace of senseless\n     mayhem.\n\n<b>     DEALERS\n</b>\n     Touting their wares.\n\n<b>     VISITORS\n</b>\n     Trying out pistol grips -- or pushing baby carriages.  Guys\n     in fatigue jackets with toddlers on their shoulders.  Women\n     in stretch pants looking for a little something in personal\n     protection.\n\n<b>     WILSON\n</b>\n     Doesn't know where to look.  At the booth featuring \"Classic\n     Cowboy Collectibles\" -- or the most OBESE COUPLE he's ever\n     seen who just walked by.\n\n<b>                         PA SYSTEM\n</b>               Attention:  the long-range vermin-\n               shooting panel is due to commence in two\n               minutes in the blue room at the rear of\n               the Convention Center.\n\n     ... and other anomalous oddball ANNOUNCEMENTS in the\n     background as long as we're here.\n\n<b>     DEMONSTRATION\n</b>\n     At a booth selling laser attachments.\n\n<b>                         BEAM SALESMAN\n</b>               BeamSight II is easily mountable on any\n               shotgun, rifle, or sidearm and will\n               project a small, bright red dot directly\n               onto the point where your weapon is\n               aimed ...\n\n     For purposes of display, a smiling YOUNG WOMAN is the\n     \"target.\"\n\n<b>     WILSON\n</b>\n     Walking past, almost subliminally noting the Young Woman with\n     the symbol of death on her.\n\n<b>     TABLE\n</b>\n     A .45 passed from a DEALER's hand to Wilson's.\n\n<b>                         DEALER\n</b>               Man knows what he likes.\n\n<b>                         ED\n</b>                   (he'll talk if Wilson won't)\n               Lookin' good.\n\n<b>                         DEALER\n</b>                   (while Wilson checks)\n               That's a high-end item.  Total\n               reliability.\n\n<b>                         ED\n</b>               What'd you call that -- the Protector?\n\n<b>                         DEALER\n</b>               Yes, sir.  Won't find a better CQC on the\n               market.\n\n     Wilson's eyes glance up -- but Ed asks the question.\n\n<b>                         ED\n</b>               CQ what?\n\n<b>                         DEALER\n</b>               Close Quarters Combat.  Keep one in my\n               own home.\n\n<b>                         WILSON\n</b>               Trouble is, I'm not at home, see.\n               Fancied a bit of target shooting, y'know,\n               while I'm here -- with me mate.\n\n     Nods at Ed.\n\n<b>                         DEALER\n</b>               Oh really?  Where you from?\n\n<b>                         WILSON\n</b>               England.\n                   (sighting the weapon)\n               Only, we saw there was a show on, thought\n               I might pick something up for a price,\n               type of thing.\n\n<b>                         DEALER\n</b>               You came to the right place, sir.  My\n               wife's second cousin is English.  Well,\n               Scotch-Irish.  Can I interest you in a\n               holster?\n\n<b>                         WILSON\n</b>               Just luck, this, really.  Never been to\n               one of these before.\n\n<b>                         DEALER\n</b>               You're in gun country now, my friend.\n\n<b>                         WILSON\n</b>                   (picks up another, checks it\n                    out)\n               Been to the Boat Show.\n\n<b>                         DEALER\n</b>                   (re Wilson's new selection)\n               Packs a punch, but it's compact, has\n               accessible features -- makes a nice\n               concealed-carry piece.\n\n<b>                         ED\n</b>                   (playing the reluctant buyer)\n               He don't have a concealed weapons permit.\n\n<b>                         WILSON\n</b>               Don't have time for a lot of paperwork,\n               y'know.  Just popped over on a quick\n               visit.\n\n<b>                         DEALER\n</b>               I can take care of the paperwork.\n\n<b>                         WILSON\n</b>               Yeah?\n\n<b>                         DEALER\n</b>               No problem.  If <u>you</u> don't have a problem\n               with me reporting this gun stolen.\n\n     A look of understanding between them.\n\n<b>                         WILSON\n</b>               No.  Not at all.\n                   (to Ed)\n               Do we?\n\n<b>                         ED\n</b>               Not me, man.\n\n<b>                         WILSON\n</b>               I mean, it's already a steal, n'it -- what\n               you said -- four hundred for this one?\n\n<b>                         DEALERS\n</b>               Well, I'll have to add another two\n               hundred on top of that.\n\n<b>                         WILSON\n</b>               Oh, aye?\n\n<b>                         DEALER\n</b>                   (another look)\n               ... for the paperwork.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. ED'S CAR.  DAY.</u>\n\n     Ed drives.  Nervous at Wilson handling his new gun purchase\n     beside him.\n\n<b>                         WILSON\n</b>               Violation of my parole, this.\n                   (a perfect pause)\n               -- Goin' abroad.\n\n     Ed shakes his head at Wilson's sense of humor.\n\n<b>                         ED\n</b>               You hadda show up on a weekend.  This\n               weekend.  Wouldn't've even been a gun\n               show ... for another month.\n\n<b>                         WILSON\n</b>               Fucking out of order, that.  Shouldn't be\n               allowed.\n\n     As he puts away a box of ammo.\n\n<b>                         ED\n</b>               Now what.  You gonna take your new\n               arsenal, go visit Terry Valentine, just\n               like that?  Boom bam boom.\n\n<b>                         WILSON\n</b>               It's only insurance.  Can't be too\n               careful.  This Terry Valentine, he's\n               probably a wonderful fella.  They were\n               together how long?\n\n<b>                         ED\n</b>               Five years, I think.  Long time.\n\n<b>                         WILSON\n</b>               Well, there you are.  Jen must've liked\n               him.\n\n     Doesn't make Ed feel any better.  Nor does the way Wilson\n     seems now to be studying Ed's driving techniques.  Paying\n     attention to the way traffic lights and left-turn lanes and\n     cars without clutches work over here.\n\n<b>                         ED\n</b>                   (remembering)\n               Jenny told me she met him at the beach.\n               Got blinded by his smile.\n                   (beat)\n               You believe that shit?  Son of a bitch\n               never smiled at me.  Buried her at a\n               \"private\" service.  Private for who.\n               Him?\n\n<b>                         WILSON\n</b>                   (confused)\n               Hang about.  I thought you said he come\n               into the restaurant where you worked with\n               Jenny.\n\n<b>                         ED\n</b>               He came in with Jenny to the restaurant\n               where I work.  That's not where they met.\n\n<b>                         WILSON\n</b>               And that's where you met Jenny.\n\n<b>                         ED\n</b>               No, no -- Jenny used to work as a\n               waitress.  Before she met him.  But\n               that's not where she met me.  Not in my\n               restaurant.\n\n<b>                         WILSON\n</b>               How'd the two of you hook up, then?\n\n<b>                         ED\n</b>               Oh, Jenny was in my acting class.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. RENTAL CAR.  DAY.</u>\n\n     Wilson at the wheel himself.  Getting the hang of L.A.\n     Driving downtown.  Along one of the major boulevards.\n\n     Glances at a street sign as he goes by.  Picks up the map\n     book on the seat beside him to check his route.\n\n     <u>EXT. BOULEVARD.  DAY.</u>\n\n     Wilson makes a sudden lane change to avoid getting fed in the\n     wrong direction.  Gets HONKED by another driver.\n\n     <u>EXT. A STREET DOWNTOWN.  DAY.</u>\n\n     Wilson cruises past a particular building.  We don't have to\n     really clearly see it just yet (we saw it in the flash cuts) --\n     more important we see him seeing it.  Casing it with the eyes\n     of a professional.  Sniffing it out; the instinct of a\n     predator after prey.\n\n     <u>INT. CAR.  DAY.</u>\n\n     Parks it.  Produces the little leather travel kit we saw him\n     unpack at his motel.  Unzips it.  Under the usual assortment\n     of clippers, razors, etc., is a hidden layer -- storing still\n     more personalized items:  a set of select slim\n     lockpicking/cutting tools.\n\n     <u>EXT. SIDE STREET.  DAY.</u>\n\n     Wilson locks the car.  Walks away.  STAY with him.\n\n<b>     AROUND THE CORNER\n</b>\n     He walks down the block.  A nice long walk.  What we get out\n     of it besides a sense of Wilson -- cool cat; ambling along;\n     loner; sun beating down; not bothered; his shadow doubling\n     him -- is this:\n\n     The building approaching.  The one he has his eye on.  The\n     target.  It's across the street.  A kind of flat windowless\n     warehouse with adjoining loading yard.  Loading yard\n     surrounded by a chain-link fence -- topped with barbed wire.\n\n     The actual geography of where he left his car in relation to\n     this building.  Safely around the corner.  And how he might\n     practically get back to it, either this same way or via a\n     more circuitous route round another block.\n\n     The sense you get in downtown L.A. on a lazy Saturday\n     afternoon that you're in a ghost town.  Particularly in this\n     shabby kind of industrial section.\n\n     <u>EXT. THE BUILDING.</u>\n\n     Wilson crosses over to it now.  From sunny to shade.\n\n     Walks past the chain-link fence.  The padlocked gate, big\n     enough to accommodate the (couple of) trucks parked within\n     the compound.\n\n     Walks past the closed security door which would appear to be\n     the building's main entrance.\n\n     Round the next corner -- SEES there's a steel back door as\n     well.\n\n     Comes around this block again.  Looking surreptitiously around\n     now.  Streets here utterly deserted.  Not even a passing car.\n     Crappy residential building on an opposite corner, SPANISH\n     MUSIC blaring from one of the open windows, but not with a\n     direct view on the loading yard fence on this side.  Wilson\n     nearing it now -- taking something out of his pocket.  One of\n     the mysterious metallic tools from his travel kit.  Snaps his\n     wrist, unfolding the tool with a CRACK.  Wire cutters.\n\n     He doesn't go for the gate, the padlock, like we might have\n     thought.  He suddenly drops to one knee, in shadow where the\n     fence meets the adjoining building.  SNAP, SNAP, SNAP, SNAP,\n     SNAP -- so quick, with great dexterity, though his face\n     grimaces with the strength he has to exert with each\n     application of pressure -- he cuts just as many links as he\n     knows he needs to push in a little flap of fence and roll\n     under.  Whole thing accomplished in seconds.\n\n<b>     LOADING YARD\n</b>\n     Walks fast to the cover of the trucks.  Passes.  Looks\n     around.  Cement loading docks and bays.  Shuttered doors.  He\n     jumps up to one, puts his ear to the metal.  Listens awhile.\n\n<b>     WILSON\n</b>\n     Scans the wall for any sign of an alarm box or anything.\n     Then cocks an ear upwards... CAMERA CRANING UP to show us\n     what he hears:  an air-conditioning unit HUMMING away.  Which\n     means someone must be inside.\n\n     Wilson looks back at his entry options.  Not the loading\n     doors -- but a conventional door at one end, with a\n     conventional lock his eye zeroes in on.  Gets out his tools,\n     going over.\n\n     <u>INT. WAREHOUSE HALLWAY.</u>\n\n     A SCRATCHING at the door.  It opens.  He's in.\n\n     Waits.  Cautious.  Nothing.  He starts along the hallway.\n\n     <u>INT. WAREHOUSE.</u>\n\n     A SUPERVISOR (the one from the flash cuts) does a double take\n     as Wilson passes.\n\n<b>                         SUPERVISOR\n</b>               Hey!\n\n     Wilson stops and turns.  Says nothing.\n\n<b>                         SUPERVISOR\n</b>               How'd you get in here.\n\n<b>                         WILSON\n</b>               Walked.\n\n<b>                         SUPERVISOR\n</b>               You walked.\n                   (coming over)\n               What the hell are you doing here.\n\n<b>                         WILSON\n</b>               Looking for a bloke named Valentine.\n               Know him?\n\n     MEAT PUPPETS (who we saw before as well) who work here\n     gathering.  The Supervisor and the Meat Puppets exchange\n     glances.\n\n<b>                         SUPERVISOR\n</b>               He's expecting you?\n\n<b>                         WILSON\n</b>                   (beat)\n               I doubt it.\n\n     The Supervisor moves toward Wilson.\n\n<b>                         SUPERVISOR\n</b>               So why would he want to see you.\n\n<b>                         WILSON\n</b>               I have a message for him.  About Jennifer\n               Wilson.\n\n<b>                         SUPERVISOR\n</b>               Jennifer Wilson.\n\n     More looks are exchanged.\n\n<b>                         WILSON\n</b>               You know her?\n\n<b>                         SUPERVISOR\n</b>               Yeah.  I know her, all right.  She came\n               down here once, stirred up a shitstorm.\n               We lost a full day's work, took me weeks\n               to get back on schedule.  If she hadn't\n               a' been Terry's woman I would've broke\n               her jaw.  'Course, she's nobody's problem\n               now.\n\n     Wilson stares at him.\n\n<b>                         WILSON\n</b>               Is Valentine here?\n\n<b>                         SUPERVISOR\n</b>               What do you think?\n\n     Wilson looks at the Meat Puppets, the loading area.\n\n<b>                         WILSON\n</b>               Where is he, then?\n\n<b>                         SUPERVISOR\n</b>               Listen, get the fuck out of here before\n               you get hurt.  Who the fuck do you think\n               you are, waltzing in here, asking\n               questions?\n\n     Wilson just looks at him.\n\n<b>                         SUPERVISOR\n</b>               Do you hear me, asshole?\n\n     The Supervisor shoves him.  The Meat Puppets move a little in\n     anticipation.  Wilson isn't giving any indication that he's\n     going to leave.\n\n<b>                         SUPERVISOR\n</b>               Jesus, you really want your ass kicked,\n               don't you?\n\n     He pushes Wilson again, hard.\n\n<b>                         SUPERVISOR\n</b>               Go on, get outta here.\n\n     He pushes Wilson again.  Still, Wilson won't leave.\n\n<b>                         SUPERVISOR\n</b>               Fuckin' nut.  Go on.\n\n     This time he tries to slap Wilson.  Wilson blocks the\n     Supervisor's hand and then punches him, hard.  The Supervisor\n     stumbles back and falls to the floor.\n\n<b>     THE MEAT PUPPETS\n</b>\n     Move to Wilson.  He tries to fend them off, but there are too\n     many.  They beat him.  When they find that he's armed, they\n     beat him harder.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. BUILDING.  DAY.</u>\n\n     Wilson is taken outside and dumped.  After a moment, he gets\n     to his feet.  Dusting himself.  Reaches for ANOTHER GUN tucked\n     in his lower back.  He re-enters the building.\n\n     A beat.  We hear several SHOTS.\n\n     Seconds later, one of the Meat Puppets comes stumbling out of\n     the door, terrified.  He runs past us, fast.\n\n     A moment later, Wilson emerges, gun in hand.\n\n<b>                         WILSON\n</b>               You tell him.  You tell him I'm coming!!\n\n<b>                                                               CUT.\n</b>\n     <u>INT./EXT. VALENTINE'S HOUSE.  DUSK.</u>\n\n     A series of images that prove Valentine (whoever he is) has\n     taste, wealth, and influence, stretching back a good three\n     decades at least.\n\n     Walking through some of these shots is a young beauty in a\n     bathing suit named ADHARA.  She advances slowly, not entirely\n     sure of herself, and stops to look at things just like we do.\n     At one point she looks to see a BEEFY GUY (GORDON) sitting at\n     the kitchen counter, flipping through a magazine.  He looks\n     her up and down, more from reflex than anything.\n\n     She continues on.  Eventually she emerges through sliding\n     glass doors and on to a patio.\n\n<b>     HER POV\n</b>\n     A figure by the pool, talking on the phone.  His back to us.\n     The pool is spectacular, mosaic tile bottomed.\n\n<b>     ADHARA\n</b>\n     Approaches, then sits beside him.  His voice is soothing, but\n     with the tiniest hint of exasperation that comes with being\n     slightly ahead of everyone.\n\n<b>                         VALENTINE\n</b>                   (into phone)\n               Not before.  Not <u>before</u>.  Think about it.\n               What does it mean?  What -- no, I'm not.\n               Think.  Yes.  See?  You figured it out\n               all by yourself.  I know.  Are we done?\n               Okay.\n\n     He hangs up, stands, still doesn't turn.\n\n<b>                         VALENTINE\n</b>               Adhara.  I told your father, if you're\n               looking for a name, you can't go wrong\n               with a constellation.\n\n<b>                         ADHARA\n</b>               I used to hate it.  Now I like it.\n\n<b>                         VALENTINE\n</b>               Could be worse, he could've named you\n               Reticulum.\n\n     He turns and we see him for the first time.\n\n<b>     VALENTINE\n</b>\n     Polished.  Handsome.  Charismatic.  Especially when he's\n     smiling like he is now.  He leans over and kisses her.\n\n<b>                         VALENTINE\n</b>               Is there anything in the world that you\n               want or need?\n\n<b>                         ADHARA\n</b>               I <u>want</u> to know why you <u>need</u> that scary\n               guy in your house.\n\n<b>                         VALENTINE\n</b>               Gordon?  He's been with me for years.\n               He's not as tough as he looks.\n\n<b>                         ADHARA\n</b>               Then what good is he?\n\n<b>                         VALENTINE\n</b>               Is it possible that you're too young to\n               be acquainted with the idea of loyalty?\n\n<b>                         ADHARA\n</b>               Is that a problem?\n\n<b>                         VALENTINE\n</b>               Not for you, clearly.\n\n<b>                         ADHARA\n</b>               I'm loyal to things that make me happy.\n\n<b>                         VALENTINE\n</b>               Am I a thing?\n\n<b>                         ADHARA\n</b>               Well, you're certainly not a person.\n\n<b>                         VALENTINE\n</b>               I'm not.\n\n<b>                         ADHARA\n</b>               No.  You're not specific enough to be a\n               person.  You're more like a vibe.\n\n<b>                         VALENTINE\n</b>               I'm so glad we're having this chat.\n\n<b>                         ADHARA\n</b>               It's not a knock.\n\n<b>                         VALENTINE\n</b>               It's not a compliment.\n\n<b>                         ADHARA\n</b>               It's an observation.  Like:  I'm hungry.\n               When are we eating?\n\n<b>                         VALENTINE\n</b>               As soon as you get dressed.\n\n<b>                         ADHARA\n</b>               What kind of food?\n\n<b>                         VALENTINE\n</b>               Anything but Japanese.\n\n<b>                         ADHARA\n</b>               Why?\n\n<b>                         VALENTINE\n</b>               I'm not into finger foods.  Too fussy.\n\n<b>                         ADHARA\n</b>               Like you.\n\n<b>                         VALENTINE\n</b>               I don't like do-it-yourself cuisine.\n               Buffets.  Salad bars.\n\n<b>                         ADHARA\n</b>               You demand to be served.  A fork\n               fetishist.\n\n<b>                         VALENTINE\n</b>               It's just fuel to me.  I'm not there for\n               distractions.\n\n<b>                         ADHARA\n</b>               For some, eating is a sensual experience.\n               <u>The</u> sensual experience.\n\n<b>                         VALENTINE\n</b>               That's what Gordon's always saying.\n\n<b>                         ADHARA\n</b>               Oh, god.\n\n     His cell phone rings.\n\n<b>                         VALENTINE\n</b>                   (into phone)\n               Yes.\n\n     He listens, then looks up at his balcony, where a MAN (AVERY)\n     stands holding a phone, obviously talking to Valentine.\n\n<b>                         VALENTINE\n</b>                   (into phone)\n               I'll be there as soon as I can.\n\n     He hangs up.\n\n                         VALENTINE (cont'd)\n               We can leave as soon as you're ready.\n\n<b>                         ADHARA\n</b>               Okay.\n\n     <u>EXT. BALCONY.  EVENING.</u>\n\n     Valentine approaches Avery.\n\n<b>                         VALENTINE\n</b>               What.\n\n<b>                         AVERY\n</b>               There's been some trouble downtown.\n\n<b>                         VALENTINE\n</b>               What kind?\n\n<b>                         AVERY\n</b>               What the papers used to call a \"gangland\n               slaying.\"\n\n<b>                         VALENTINE\n</b>               Our black friends?\n\n<b>                         AVERY\n</b>               No, Terry.  They don't work like that.\n               Jenny Wilson's father paid a little\n               visit, left a message.\n\n<b>                         VALENTINE\n</b>               I thought he was in prison, in England.\n\n<b>                         AVERY\n</b>               Well, either they have a very liberal\n               work-release program, or he's out,\n               because he's here in L.A., looking for\n               you.\n\n     Valentine is a little ruffled.  Maybe Avery likes that.\n\n<b>                         VALENTINE\n</b>               What do we do?\n\n     Beat.\n\n<b>                         AVERY\n</b>               We wait, and we watch.\n\n     Valentine just looks at him.\n\n     <u>EXT. VALENTINE'S HOUSE.  POOLSIDE.  EVENING.</u>\n\n     Adhara approaches Valentine, who stands staring at the pool.\n\n<b>                         ADHARA\n</b>               Italian?\n\n<b>                         VALENTINE\n</b>               I'm sorry.\n\n<b>                         ADHARA\n</b>               Italian.\n\n<b>                         VALENTINE\n</b>               Who?\n\n<b>                         ADHARA\n</b>               Not who, food.  Should we get Italian.\n\n<b>                         VALENTINE\n</b>               Sure.\n\n     Turns to her.\n\n                         VALENTINE (cont'd)\n               Yes.  Are you ready?\n\n<b>                         ADHARA\n</b>               As long as I don't have to pass Gordon\n               again.  I'm never ready for that.\n\n     He smiles, rises, and offers her his hand.\n\n<b>                         VALENTINE\n</b>               No.  I know another way out.\n\n     She takes it.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. APARTMENT BUILDING.  EVENING.</u>\n\n     ELAINE on her way in.  Handsome woman.  Intelligent, capable-\n     looking.  Passes Wilson who's leaning somewhere smoking.\n\n<b>     ELAINE\n</b>\n     Aware as a wary woman will be of a strange man's presence\n     without necessarily having looked at him.  Well aware too\n     that he stayed where he was -- so she unworriedly unlocks the\n     building's security gate and goes through to the inner --\n\n<b>     COURTYARD\n</b>\n     -- and closes the gate behind her, now seeing him amble up,\n     arriving as it CLICKS shut between them.  He's looking at her\n     a certain way.  She looks back.  And knows.\n\n<b>                         ELAINE\n</b>               You're Jenny's father.\n\n     And the recognition on his part:\n\n<b>                         WILSON\n</b>               Had a feeling it was you.\n\n<b>                         ELAINE\n</b>               You look alike.\n\n<b>                         WILSON\n</b>                   (cigarette in hand)\n               Perhaps it was the smoke.\n\n<b>                         ELAINE\n</b>               Not her brand.\n\n<b>                         WILSON\n</b>               She used to pinch 'em off me.\n                   (trying to defuse Elaine's cold\n                    stare)\n               Funny that.  One thing she never tried to\n               get me to stop.\n\n     Elaine doesn't soften.\n\n<b>                         ELAINE\n</b>               Why did you come here?\n\n<b>                         WILSON\n</b>               Wanted to talk to you, didn't I?\n\n<b>                         ELAINE\n</b>               No, why did you come here?\n\n     America.\n\n<b>                         WILSON\n</b>               Sort a few things out.\n\n<b>                         ELAINE\n</b>               Been busy, have you.\n\n<b>                         WILSON\n</b>               How d'you mean?\n\n<b>                         ELAINE\n</b>               It's been a while.\n\n<b>                         WILSON\n</b>               I was skint -- didn't have no money to\n               get here.\n\n<b>                         ELAINE\n</b>               That's not what I heard.\n\n<b>                         WILSON\n</b>               What was that, then?\n\n<b>                         ELAINE\n</b>               I heard you were -- what's that adorable\n               phrase? -- \"at Her Majesty's pleasure.\"\n\n<b>                         WILSON\n</b>               It was the bars, then.\n\n     Indicating his face, viewed by Elaine through the barred\n     security gate that divides them.\n\n<b>                         ELAINE\n</b>               In any case, I don't suppose the salary\n               you make sewing mailbags is really\n               commensurate with international airline\n               travel.\n\n<b>                         WILSON\n</b>               Sewing mailbags?  Me?  Never did an\n               honest day's work in my life, dear.\n               Wasn't about to start when I was in stir --\n               not with all that leisure time on my\n               hands.\n\n<b>                         ELAINE\n</b>               And not with all that buried loot you had\n               waiting for you when you got out.  From\n               the Wembley Staduim job, wasn't it?  Pink\n               Floyd concert receipts.  Jenny would've\n               been ... fourteen at the time?\n\n<b>                         WILSON\n</b>                   (trying to conceal his\n                    surprise)\n               Hardly buried.  Earning interest, love.\n               Earning interest in an offshore account.\n               Tidy little premium per annum, that.\n\n<b>                         ELAINE\n</b>               Well, that kind of security can't be\n               bought.  Must be more comforting than a\n               daughter to greet you.\n\n     She turns to walk away.\n\n<b>                         WILSON\n</b>               Here, aren't you gonna let me in.\n\n<b>                         ELAINE\n</b>                   (without looking back)\n               Try calling me again.\n\n     <u>INT. ELAINE'S APARTMENT.  EVENING.</u>\n\n     She comes in.  A modest studio apartment.  Puts her bag on\n     the kitchenette countertop.  Glances at her answer machine to\n     see if she has any messages.  The phone RINGS.  She sits down\n     glumly on her couch, holds her head in her hands.\n\n     <u>EXT. ELAINE'S APARTMENT BUILDING.  EVENING.</u>\n\n     Wilson gives up, starts to walk away.  The gate BUZZES.\n\n     <u>INT. ELAINE'S APARTMENT.  EVENING.</u>\n\n     Elaine opens the door.  Wilson in the hall.\n\n<b>                         ELAINE\n</b>               I was just going to toss some vegetable\n               rolls in the microwave, open a can of\n               diet soda.\n                   (beat)\n               Want to take me out?\n\n<b>                                                               CUT.\n</b>\n     <u>INT. RESTAURANT.  NIGHT.</u>\n\n     Wilson and Elaine at a table.\n\n<b>                         WILSON\n</b>               ... No, I went in for more improving\n               pastimes.  Philosophy classes, language\n               courses, European history, all that lark.\n               Did you know that in Paris in the\n               Eighteenth Century there were more rats\n               in people's houses than there were people\n               in people's houses.\n\n<b>                         ELAINE\n</b>               Sounds like Beverly Hills.\n\n<b>                         WILSON\n</b>               Here, are you always this sarky?\n\n<b>                         ELAINE\n</b>               Sarcastic, moi?  Maybe I'll mellow when\n               my ship comes in.  It's expected any day\n               now.  I'm all packed and ready to go.\n\n<b>                         WILSON\n</b>               Weren't you on a television series?\n\n<b>                         ELAINE\n</b>                   (has he seen it?)\n               If it played in England somebody owes me\n               money.  Who told you that -- Eddie?\n\n<b>                         WILSON\n</b>                   (yes)\n               Said it went on for donkey's years.\n\n<b>                         ELAINE\n</b>               Three seasons.  They found that's the\n               limit of human tolerance when it comes to\n               following the adventures of a family of\n               Mormons on the Chisum Trail.\n                   (blinks coquettishly)\n               I was wife number three -- the ingenue.\n\n<b>                         WILSON\n</b>               Oh, it just ended, then.\n\n<b>                         ELAINE\n</b>               Now who's being sarcastic?\n\n<b>                         WILSON\n</b>               When you've lost as many years as I have,\n               love, puts things in perspective, know\n               what I mean.\n\n<b>                         ELAINE\n</b>               I'm sorry.  I guess the rest of us have\n               no excuse for wondering where the time\n               went.\n                   (raises her drink)\n               It must've been the bars.\n\n     Their food arrives.\n\n<b>                         ELAINE\n</b>               It's a kind of prison, doing a series.\n               Early to bed, early to rise, no time off\n               for good behavior, you grab the boodle\n               for as long as it lasts.\n                   (the kicker)\n               Only difference is you can't get arrested\n               afterwards.\n\n     Wilson appears fascinated by the cold glasses of water on the\n     table.  Ice cubes CLINKING as he holds his.  A BUSBOY\n     bringing them to other people, too, just like that, without\n     anyone even asking.\n\n<b>                         WILSON\n</b>               I can't believe Jenny told you all that.\n               About me.  She was always so embarrassed.\n\n<b>                         ELAINE\n</b>               Not embarrassed.\n\n<b>                         WILSON\n</b>                   (correcting)\n               Ashamed.\n\n<b>                         ELAINE\n</b>               Not ashamed.\n\n     Wilson looks at her.  Okay.  What then.\n\n<b>                         ELAINE\n</b>               Disappointed.\n\n<b>                         WILSON\n</b>               She never told Eddie, though.\n\n<b>                         ELAINE\n</b>               She never told anyone else.\n                   (making light now)\n               About the convict strain -- or is it\n               stain?  No, I was privileged.  I was\n               someone who helped Jenny efface her past.\n\n<b>                         WILSON\n</b>               How'd you manage that, then.\n\n<b>                         ELAINE\n</b>               When I'm not honing my craft in episodic\n               television I do double-duty as a voice\n               coach.  Not that her accent would have\n               hobbled her progress.  Not with that\n               look.\n\n<b>                         WILSON\n</b>               Yeah, well, she started all that in\n               London.\n\n<b>                         ELAINE\n</b>               Modelling.\n\n<b>                         WILSON\n</b>               Learnin' 'ow to speak proper.\n                   (putting it on a bit there.\n                    Then, upper crust:)\n               Central School of Speech and Drama.\n               It's no doddle gettin' in there, y'know.\n               At seventeen.  They offered her a place\n               at RADA n' all, only she'd've had to wait\n               till the next session and she was always\n               in hurry to get on, was Jenny.  She could\n               talk posh without any training, when she\n               was knee-high to a grasshopper.\n                   (indicating himself)\n               Show up the old man, you know.\n\n     Elaine smiles slightly.  None of this information new to her.\n     But warming to this man.\n\n<b>                         ELAINE\n</b>               You weren't disappointed in her, then.\n\n<b>                         WILSON\n</b>               In Jenny?  'Course not.  How could I be.\n               'Course I wasn't.\n\n<b>                         ELAINE\n</b>               She was twenty-one when she came to me.\n                   (looks at him)\n               ... Straight from leaving you.\n\n<b>                         WILSON\n</b>               Footloose and fancy free.\n\n<b>                         ELAINE\n</b>               She was happy here.  However the two of\n               you might have parted.  Don't think she\n               wasn't.\n\n     It's because Wilson thinks the opposite that he's here.\n     Looks at Elaine.\n\n<b>                         WILSON\n</b>               That's the trouble, n' it.\n                   (hard as nails again)\n               She enjoyed life.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. OCEANFRONT.  NIGHT.</u>\n\n     They walk along the seafront.  We HEAR the ocean but can't\n     see it.\n\n<b>                         ELAINE\n</b>               When did you get in?\n\n<b>                         WILSON\n</b>               Yesterday.  Afternoon.\n\n<b>                         ELAINE\n</b>                   (occurs to her)\n               You haven't been lurking outside my\n               building all day.\n\n<b>                         WILSON\n</b>               No, I had -- some other matters to attend\n               to, you know.  Getting a car sorted ...\n\n<b>                         ELAINE\n</b>               I might've been away for the weekend.\n\n<b>                         WILSON\n</b>               Well, I reckoned, Saturday night, if you\n               were goin' out, you'd probably have to\n               come home first.\n\n<b>                         ELAINE\n</b>               And you've seen Eddie Rama.\n\n<b>                         WILSON\n</b>               Yeah, saw Eddie, yeah.  Me and him are\n               muckers.\n\n     Mates.  Friends.  Makes a kind of bonding gesture.\n\n<b>                         ELAINE\n</b>               I should really give him a call.  He's a\n               character, isn't he.  Well, not to you.\n               I meant to us squares in the outside\n               world.\n\n<b>                         WILSON\n</b>               He give me your address.\n\n<b>                         ELAINE\n</b>               I gave him yours.  Said, here, you want\n               to write, I think this is a relative.  I\n               guess I thought I was being true to\n               Jenny.  Who told me she didn't have a\n               father -- before proceeding of course to\n               tell me why.\n\n<b>                         WILSON\n</b>               Well, don't suppose she did, really, most\n               of her life.  On her own after her mum\n               died.  Aunts and uncles for a time -- and\n               then the bright lights beckoned.\n\n<b>                         ELAINE\n</b>               Were you still married at the time -- to\n               Jenny's mother, I mean?\n\n<b>                         WILSON\n</b>               Nah, we split up when Jenny was six.  Her\n               second husband done a runner after she\n               got sick.  They give me compassionate\n               leave from Parkhurst to go visit her in\n               hospital.  We were always mates, me and\n               Jenny's mum.  I like to think they're\n               together again now.  Y'know.  Heavenly\n               choir.\n\n     Beat.\n\n<b>                         ELAINE\n</b>               The address Jenny gave me, that wasn't a\n               prison, was it?\n\n<b>                         WILSON\n</b>               Nah, accommodation address.\n\n<b>                         ELAINE\n</b>               What's that, like a P.O. box.\n\n<b>                         WILSON\n</b>               Something like that, yeah.\n\n<b>                         ELAINE\n</b>               Where you get your bank statements.\n\n     Wilson gives a laugh.\n\n<b>                         WILSON\n</b>               Well, you gotta have something permanent,\n               don'tcha.  Even if it's a hole in the\n               wall.  No matter which jug I might be\n               transferred to, I always got someone on\n               the out checks up on it for me, see.\n               Anything I need to know, comes round on\n               visitor's day -- word in my ear.\n\n     Elaine pauses.\n\n<b>                         ELAINE\n</b>               Some word.\n\n     Wilson leans on the wall overlooking the black ocean.  Sound\n     of WAVES gently lapping the beach.\n\n<b>                         WILSON\n</b>               I already knew.  Knew beforehand.  When\n               was it supposed to have happened? -- two\n               o'clock in the morning, Eddie said.\n\n<b>                         ELAINE\n</b>                   (watching him)\n               That's what was estimated.\n\n<b>                         WILSON\n</b>               Eight hours difference between here and\n               London.  Would've been, what, ten in the\n               morning, my time.  I was just coming out\n               on the yard.  Now, I was in the habit of\n               saving my newspaper till then.  Bit of\n               fresh air, stretch me legs -- well,\n               stretch the day out, really, that's what\n               you wanna do.  And I'll tell ya:  I\n               couldn't open the paper.  Could not pry\n               the pages apart -- it was like they was\n               glued together.  That's how weak my hands\n               went.  Thought I was having heart attack,\n               only I knew I wasn't.  Bloke come up to\n               me, he says, Dave, he says, you've gone\n               all white.  I said, fuck me, I've been in\n               prison half my life, what d'ya expect.\n               But he was dead on, 'cause I could feel\n               the blood drain right out of me head.\n               And I knew ...\n                   (beat)\n               Something had happened to Jen.\n\n     They stand here a while.  Listening to the BREAKERS hit the\n     shore.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. ELAINE'S APARTMENT.  NIGHT.</u>\n\n     They come in.\n\n<b>                         ELAINE\n</b>               Make yourself at home.  Steal something.\n\n     That gets her a look.\n\n<b>                         ELAINE\n</b>               There's nothing I can't afford to lose.\n\n     She goes to make coffee.  Wilson looks around.\n\n<b>                         ELAINE\n</b>               Do you even know who Terry Valentine is?\n\n<b>                         WILSON\n</b>               Well, I gathered something from the\n               article what Eddie sent me.  Some sort of\n               pop music producer, wasn't it.\n\n     Maybe a smile from Elaine at the quaintness of \"pop\" music.\n\n<b>                         ELAINE\n</b>               Rock n' roll, is what we called it.  He's\n               sort of a forgotten figure now, but back\n               when the West Coast was the grooviest\n               place on earth, Terry Valentine was where\n               all the happenings happened.  More of a\n               kind of promoter, I guess, whatever that\n               means.  Just took that whole Southern\n               California Sixties Zeitgeist and ran with\n               it.  Packaged and sold it.  Made out like\n               a bandit.\n\n     <i>FLASH CUTS:\n\n     VALENTINE. At home. Watching as Adhara undresses, either\n     deliberately for him, or just casually. She smiles as she\n     notices he's looking.</i>\n\n<b>                         WILSON\n</b>               What's he done lately.\n\n     That line pregnant with meaning.  Elaine looks at him.\n     Avoids answering the question actually implied there.\n\n<b>                         ELAINE\n</b>                   (brings a tray over)\n               Lives high off the hog and waits for the\n               next big thing.  Like me -- but on a\n               grander scale of failure.\n\n<b>                         WILSON\n</b>               Now, you shouldn't run yourself down.  My\n               employer, Mr. Lindgren --\n\n<b>                         ELAINE\n</b>               -- Your employer?\n\n<b>                         WILSON\n</b>               -- Mr. Lindgren.\n\n<b>                         ELAINE\n</b>               Who's Mr. Lindgren?\n\n<b>                         WILSON\n</b>               My employer.\n\n<b>                         ELAINE\n</b>               What line is he in.\n\n<b>                         WILSON\n</b>               Proprietor of a London firm.  Of\n               longstanding.\n\n<b>                         ELAINE\n</b>               I see.\n\n<b>                         WILSON\n</b>               Based in London, but with international\n               concerns.\n\n<b>                         ELAINE\n</b>               I bet.\n\n<b>                         WILSON\n</b>               Various enterprises, style of thing.\n\n<b>                         ELAINE\n</b>               I thought you said you never did an\n               honest day's work in your life.\n\n<b>                         WILSON\n</b>               Well, not to say Mr. Lindgren is\n               dishonest, exactly.\n\n<b>                         ELAINE\n</b>                   (she gets the picture)\n               Right.\n\n<b>                         WILSON\n</b>               Anyhow, he's always saying to me, Dave,\n               never run yourself down, son -- 'cause\n               there'll always be plenty of people\n               willing to do it for you.\n\n<b>                         ELAINE\n</b>               In what capacity are you employed by this\n               Mr. Lindgren?\n\n<b>                         WILSON\n</b>               This and that.  Y'know.  Ways and means.\n\n<b>                         ELAINE\n</b>               -- When he wants someone run down, you're\n               willing to do it for him.\n\n     They sort of come together -- in mutual understanding -- and\n     sit down.  Coffee steaming.\n\n<b>                         ELAINE\n</b>               So what's the deal.  You and Terry\n               Valentine at twenty paces.  Is that what\n               this is about.\n\n<b>                         WILSON\n</b>               Why not.\n\n<b>                         ELAINE\n</b>               Are you serious.\n\n<b>                         WILSON\n</b>               Have you ever known me not to be.\n\n     Elaine looks away:\n\n<b>                         ELAINE\n</b>               You fuckin' guys and your dicks.\n\n<b>                         WILSON\n</b>               What'd you want me to do.  Stay at home,\n               twiddlin' me thumbs.  Doing sweet F.A.\n               [Fuck All].\n\n<b>                         ELAINE\n</b>               You don't believe it was a car accident.\n\n<b>                         WILSON\n</b>               What do you think.\n\n<b>                         ELAINE\n</b>               Terry's never going to give you\n               satisfaction.  Not the type.\n\n<b>                         WILSON\n</b>               Depends, don' it.\n\n<b>                         ELAINE\n</b>               On what.  What makes you so certain.\n\n<b>                         WILSON\n</b>               I'll bloody well ask him.\n\n<b>                         ELAINE\n</b>               There's the phone.  You want his number.\n\n<b>     WILSON\n</b>\n     That look again.\n\n<b>                         WILSON\n</b>               I got his number.\n\n<b>     ELAINE\n</b>\n     Past caring.\n\n<b>                         ELAINE\n</b>               I'm not going to help you.\n\n     She goes into a bathroom.  Shutting the door behind her.\n\n<b>     WILSON\n</b>\n     Sips coffee.  Bites into a cookie.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. HILLSIDE.  UNDERBRUSH.  LATE AFTERNOON.</u>\n\n     Thickets part and we SEE Wilson scrambling up a rather steep\n     hill.  Coming to a ridge where he settles down to look at\n     something O.S.  His expression changes by degrees from\n     curiosity to dawning realization to a kind of frustrated\n     disappointment.\n\n     <u>INT. WILSON'S CAR (ON THE ROAD BELOW).  LATE AFTERNOON.</u>\n\n     Ed sits in here, RADIO on.  Wilson appears out of the brush,\n     gets in.  Ed turns the radio down.\n\n<b>                         ED\n</b>                   (mindful of the odd car driving\n                    past)\n               Told you you wouldn't be able to see\n               through that gate.\n\n<b>                         WILSON\n</b>               Gate's open.  I had a butcher's at the\n               house.\n\n<b>                         ED\n</b>                   (alarmed)\n               Who'd you butcher at the house?\n\n<b>                         WILSON\n</b>               Butcher's hook.  Look.\n                   (doesn't anyone speak English\n                    in this fucking country?)\n               I don't much reckon those minders of his.\n\n<b>                         ED\n</b>               Huh?\n\n<b>                         WILSON\n</b>               He's brought in the heavy mob.\n\n<b>                         ED\n</b>               What?\n\n<b>                         WILSON\n</b>               Extra muscle.  Bodyguards.\n\n<b>                         ED\n</b>               Has he?\n\n<b>                         WILSON\n</b>               They look a right load of wallies.\n               Patrolling back and forth outside the\n               gate, all ponced up like the fuckin'\n               Household Cavalry.\n                   (ducks suddenly)\n               Watch it.\n\n     As one of the \"bodyguards\" runs by, only fleetingly glimpsed\n     by us.\n\n<b>                         ED\n</b>               That was one of them?\n\n<b>                         WILSON\n</b>                   (sits up again)\n               See what I mean?  Wearing bloomin'\n               uniforms n' all.\n\n     Off Ed's perplexed look ...\n\n     <u>EXT. HILLSIDE UNDERBRUSH.  LATE AFTERNOON.</u>\n\n     Wilson settles into position again, this time with Ed.\n\n<b>                         WILSON\n</b>               Look at that.\n\n     Ed just laughs.\n\n<b>                         WILSON\n</b>               What's so fucking funny?\n\n<b>                         ED\n</b>               Those aren't guards.  They're valets.\n\n<b>     POV\n</b>\n     Now we SEE what Wilson had mistaken for Valentine's private\n     army.  Half a dozen VALETS outside Valentine's hilltop home.\n     Dressed in matching attire, a couple of them wielding walkie-\n     talkies.\n\n<b>     RESUME WILSON AND ED\n</b>\n     Ed's still laughing.\n\n<b>                         WILSON\n</b>               Valets.  What d'ya mean valets.  What is\n               he, then, the Earl of fucking Doncaster?\n\n<b>                         ED\n</b>               <u>Valets</u>.  They park cars.  He's having a\n               party.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. VALENTINE'S HOUSE.  LATE AFTERNOON.</u>\n\n     Wilson's car pulls up.  He and Ed get out.  Wilson engages in\n     a mini tug-of-war with a Valet over his car key, it so rubs\n     him the wrong way having to give it up.\n\n<b>                         WILSON\n</b>               Keep it handy, mate, all right?  We're\n               not stopping long.\n\n     He gestures, apparently getting the message across that he\n     wants the car kept close by.\n\n<b>                         VALET\n</b>               Yes, sir.\n\n<b>                         WILSON\n</b>               Cheers.\n\n     Exchanges the key for a card -- which he turns over in his\n     hand and studies curiously as they head inside.\n\n<b>                         WILSON\n</b>               Valets, eh?  Aren't we all la-de-da.\n\n<b>                         ED\n</b>                   (nervous being here)\n               I thought you just wanted to check out\n               the house, man.\n\n<b>                         WILSON\n</b>               Well, that's what we're doin', n' it.\n\n<b>                         ED\n</b>               No one else is even here yet.\n\n<b>                         WILSON\n</b>               First in, first out, that's me.\n\n     Looking over to note the multi-car GARAGE off the main house.\n\n     <u>INT. VALENTINE'S HOUSE.  AFTERNOON.</u>\n\n     Wilson and Ed are among the first to arrive.  A smattering of\n     other GUESTS.  Elaborate catered cuisine.  They mosey over to\n     the wet bar.\n\n<b>                         BARTENDER\n</b>               Gentlemen.  What can I get you.\n\n<b>                         WILSON\n</b>                   (suggesting Ed take first\n                    crack)\n               Dubonnet with a twist?  Baby sham?\n               Tomato juice and Tabasco sauce?\n\n     By now his whole dynamic with Ed is a verbal tease.\n\n<b>                         ED\n</b>                   (to Bartender)\n               Got a Coke?\n\n     <u>INT. VALENTINE'S BEDROOM.  AFTERNOON.</u>\n\n     Valentine is checking himself in a full-length mirror.  TV on\n     in background, sound low (ENTERTAINMENT WEEK!).  Not quite\n     satisfied, Valentine crosses to the bathroom.\n\n<b>     BATHROOM\n</b>\n     Valentine takes one more closer look.\n\n<b>                         ADHARA (O.S.)\n</b>               You have the same posters.\n\n     Valentine turns.\n\n<b>                         VALENTINE\n</b>               Hmm?\n\n<b>     ADHARA\n</b>\n     Is lounging in the large tub.  Staring dreamily at a couple\n     of framed posters on the walls:  more 60's psychedelia.\n\n<b>                         ADHARA\n</b>               That you have down at your office.\n\n     Valentine sits on the edge of the tub.  With a nostalgic air\n     as he looks at her:  the embodiment of youth.\n\n<b>                         VALENTINE\n</b>               Different ones.\n\n     He strokes her wet skin.  They kiss lightly.\n\n<b>                         ADHARA\n</b>               I like the colors.\n\n<b>                         VALENTINE\n</b>               We all did.\n\n<b>                         ADHARA\n</b>               It must've been a time.  A golden moment.\n\n     Beat.\n\n<b>                         VALENTINE\n</b>               Have you ever dreamed of a place ... you\n               don't really recall ever having been\n               to ... a place that probably doesn't even\n               exist except in your imagination ...\n               somewhere far away, half-remembered when\n               you wake up ... but when you were there you\n               spoke the language, you knew your way\n               around ...\n                   (significant pause)\n               That was the 60's.\n\n     With that exit line (practiced?), he starts to go.\n\n     Then pauses, turns again.\n\n<b>                         VALENTINE\n</b>               No, it wasn't.  Wasn't either.\n\n     Comes back to her.  Faraway look in his eyes.\n\n<b>                         VALENTINE\n</b>               It was '66 ... early '67.\n                   (comes back to now)\n               That was all.\n\n     He goes.\n\n     <u>INT. VALENTINE'S HOUSE.  DOWNSTAIRS HALLWAY.  AFTERNOON.</u>\n\n     Wilson wanders around, exploring the house.  Comes to a wall\n     of photographes.  Casually scanning them as he passes slowly\n     by, he's caught up short by one.\n\n<b>     POV\n</b>\n     A framed photo of JENNY, his daughter.\n\n<b>     WILSON\n</b>\n     A series of emotions play over his face.  He turns -- SEES\n     Valentine coming down the stairs.  Valentine joins the party\n     without noticing him.\n\n<b>     BY THE BUFFET TABLE\n</b>\n     Ed peruses the available food.  Valentine comes over to check\n     it out.  Glances at Ed without recognizing him.\n\n<b>                         VALENTINE\n</b>               Hi.\n\n     And goes away.  Leaving Ed more nervous than ever.\n\n     <u>INT. VALENTINE'S HOUSE.  UPSTAIRS HALLWAY.  AFTERNOON.</u>\n\n     Wilson has come up here.  Peeks into one room.  Moves along to\n     another:  the master bedroom.  Opens the door gently.\n\n     <u>INT. MASTER BATHROOM.</u>\n\n     Adhara is still enjoying her bath.\n\n     <u>INT. MASTER BEDROOM.</u>\n\n     Wilson enters.  Careful.  Aware that someone's in the adjoining\n     bathroom.  The soft RIPPLE of WATER from in there.  Perhaps he\n     even glimpses her through the door as he boldly looks around.\n     He notices a video camera on a tripod, a cord running to the\n     television.  Suddenly we hear the CHIRP of a cellular phone.\n\n<b>     BATHROOM\n</b>\n     Adhara reacts.\n\n<b>                         ADHARA\n</b>               Shit.\n\n     She gets out of the tub and goes for the nearest towel.\n     Quickly wrapping herself, she exits.\n\n<b>     BEDROOM\n</b>\n     Adhara enters and goes for her purse.  She pulls the RINGING\n     phone out and answers it.\n\n<b>                         ADHARA\n</b>               Hello?  Hey!  Great.  You got my message?\n               Yeah.  No, Crestview Terrace, not\n               Crestview Place.  Yeah, there's like three\n               different ways up the hill; the quick way\n               is to bear to the right.  Sure.  Okay.\n               Okay.  'Bye!\n\n     She hangs up and begins toweling her hair.  After a moment\n     she stops.  Something isn't right.  She looks around the\n     room, and her eyes stop on the TV.  Her brow furrows, trying\n     to place the familiar image on the screen:  a girl towel-\n     drying her hair by the bed.\n\n<b>                         ADHARA\n</b>               That's me.\n\n     She looks over to see the video camera, which has been turned\n     on and pointed toward the bed.  She's not sure if it's funny\n     or creepy.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. VALENTINE'S HOUSE.  DOWNSTAIRS.  AFTERNOON.</u>\n\n     Valentine mingling, all smiles and movement.\n\n<b>     WILSON\n</b>\n     At the foot of the stairs.  Watches him, all stillness and\n     intensity.\n\n<b>     VALENTINE\n</b>\n     Catches Wilson's eye for a nanosecond, does a subtle double\n     take, then moves on.\n\n     <u>INT. VALENTINE'S HOUSE.  UPSTAIRS HALLWAY.  AFTERNOON.</u>\n\n     Adhara, dressed, looking great, exits the bedroom and heads\n     for the stairwell.\n\n     <u>INT. VALENTINE'S HOUSE.  DOWNSTAIRS.  AFTERNOON.</u>\n\n     Adhara descends the stairs.\n\n<b>     WILSON\n</b>\n     Turning to SEE her as she comes down.\n\n<b>     ADHARA\n</b>\n     Makes her way across the room to Valentine.\n\n<b>                         ADHARA\n</b>               Hey, I thought you weren't a buffet\n               person.\n\n<b>                         VALENTINE\n</b>               I'm a gracious host.\n\n<b>     WILSON\n</b>\n     Watching them, when --\n\n<b>                         GUY\n</b>               Excuse me?\n\n     Wilson looks at him.  Reluctantly.\n\n<b>                         GUY\n</b>               Don't you work with Ian?\n\n<b>                         WILSON\n</b>               Ian?\n\n<b>                         GUY\n</b>               I could swear I met you with Ian at the\n               EMI offices in London.\n\n<b>                         WILSON\n</b>               Sorry.  Wasn't me.\n\n<b>                         GUY\n</b>               You sure?\n\n<b>                         WILSON\n</b>               Unless I'm not who I think I am.\n\n<b>                         GUY\n</b>               That's too bad.  Ian's got a good thing\n               going over there.\n\n<b>                         WILSON\n</b>               Yeah?\n\n<b>                         GUY\n</b>               Turned that place completely around.  180\n               degrees.\n\n<b>                         WILSON\n</b>               No kidding.\n\n<b>                         GUY\n</b>               What I like about Ian, he believes in a\n               chain of command, but not a chain of\n               respect, you understand what I'm saying?\n\n<b>                         WILSON\n</b>               Right.  Chain of respect.  That's good,\n               that.\n\n<b>                         GUY\n</b>               Yeah.  I really admire the guy.  Well.\n               Good to meet you.\n\n<b>                         WILSON\n</b>               Yeah.  Cheers, mate.\n\n     The Guy leaves.  Wilson sees that Adhara is now on the other\n     side of the room, separated from Valentine.  He heads for\n     her.\n\n<b>     VALENTINE\n</b>\n     Still dealing with people desperate to be the focus of his\n     attention.  He notices:\n\n<b>     WILSON AND ADHARA\n</b>\n     Talking in a corner.  She seems attentive.\n\n<b>     VALENTINE\n</b>\n     In a SERIES OF CUTS, still being the gracious host, still\n     keeping his eyes on:\n\n<b>     WILSON AND ADHARA\n</b>\n     Who, in a SERIES OF CUTS, continue to talk.  Finally, they\n     separate, Wilson heading outside onto a deck.\n\n<b>     VALENTINE\n</b>\n     Excuses himself from a group of sycophants and goes to her.\n\n<b>     ADHARA\n</b>\n     Valentine approaches and begins talking to her, low.  After a\n     few moments of conversation, they both look toward:\n\n<b>     WILSON\n</b>\n     On the deck outside.  Joining Ed, who's taken refuge out here\n     with a plate of food.  What Wilson can't belleve when he SEES\n     it -- is that behind Valentine's house, which is on top of a\n     high hill, is nothing but desolate scrub canyon.  On the other\n     side of the railing around the deck, which is surely less\n     than regulation height, is a sheer drop into an abyss.\n\n                         WILSON (cont'd)\n                   (jumps back with only slightly\n                    affected vertigo)\n               Flipping heck.\n\n     Ed, a little more accustomed to L.A. architecture, nods in\n     agreement.\n\n<b>                         ED\n</b>               If you could afford a house like this you\n               would buy a house like this.\n\n     Wilson edges forward to the rail again.\n\n<b>                         WILSON\n</b>               What are we standing on?\n\n<b>                         ED\n</b>               Faith.\n\n     They stand there looking out.  Quite a view once you get used\n     to it.  Breeze.\n\n                         ED (cont'd)\n                   (nods to the hazy distance)\n               You could see the sea from here if you\n               could see it.\n\n<b>                         WILSON\n</b>               Could you?\n\n     But now Ed gives Wilson a nudge -- SEEING that Valentine\n     inside the house is making his way out here.\n\n<b>                         WILSON\n</b>               Why don't you go nick one of those little\n               cooker what's its warming up the sausages\n               cocktail and meet me in the garage.  Look\n               about for a toolbox while you're at it.\n\n     Ed considers.  His is not to reason why.\n\n<b>                         ED\n</b>               Okay.\n\n     Ed moves off.  Valentine steps up, smile fully loaded.\n\n<b>                         VALENTINE\n</b>               Hi.  Terry Valentine.\n\n     He extends his hand.  Wilson shakes it.\n\n<b>                         WILSON\n</b>               Pleasure.\n\n<b>                         VALENTINE\n</b>               Have we met?  There's something I can't\n               quite --\n\n<b>                         WILSON\n</b>               EMI in London.  I work with Ian.\n\n<b>                         VALENTINE\n</b>               Ah.\n\n<b>                         WILSON\n</b>               You must know Ian.\n\n<b>                         VALENTINE\n</b>               I don't.\n\n<b>                         WILSON\n</b>               Great bloke.  Really turned things around\n               there.  180 degrees.\n\n<b>                         VALENTINE\n</b>               I suppose that's good, unless things were\n               fine the way they were.\n\n<b>                         WILSON\n</b>               Oh, I think a shake-up was in order.\n               Definitely.  Otherwise, people get lazy,\n               don't they?  Forgetful.  Start thinking\n               they can get away with things.  Gotta\n               shake 'em up now and again, make 'em pay\n               attention.\n\n     Wilson looks at him.  Valentine looks back.  Something about\n     those eyes ...\n\n<b>                         EXCITED GUY\n</b>               Terry, Terry ...\n\n     The Excited Guy appears, tugging at Valentine.\n\n<b>                         WILSON\n</b>               Glad I got to meet you.\n\n<b>                         EXCITED GUY\n</b>               Ter ... Ter ... you gotta ...\n\n<b>                         VALENTINE\n</b>               Thanks.  You, too.\n\n<b>                         WILSON\n</b>               Be seein' you.\n\n     The Excited Guy ushers Valentine away.  Wilson watches him\n     go.\n\n<b>                         EXCITED GUY\n</b>               Charles Grodin is here.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. VALENTINE'S GARAGE.  AFTERNOON.</u>\n\n     Ed, waiting.  Wilson enters.\n\n<b>                         WILSON\n</b>               Got it?\n\n     Ed displays the Sterno.\n\n<b>                         WILSON\n</b>               Toolbox?\n\n     Ed points to a table, where a toolbox sits.  Wilson crosses\n     to it, begins going through the contents.\n\n<b>                         WILSON\n</b>               Put the Sterno on the ground, near the\n               center of the garage.\n\n     Ed does.  Wilson pulls a brace-and-bit from the toolbox and\n     crosses to the rear of one of the cars.  Dropping to the\n     ground, he bores a hole in the gas tank.  Ed raises his\n     eyebrows and moves toward the door.  Wilson crosses to the\n     other car and puts a hole in that gas tank as well.  Then he\n     puts the brace-and-bit back in the toolbox and heads for the\n     exit, Ed right behind him, giving a quick backward glance.\n\n<b>     THE GASOLINE\n</b>\n     Spills out, slowly but steadily, and slithers toward the\n     garage door.\n\n     <u>EXT. BETWEEN VALENTINE'S HOUSE AND GARAGE.  AFTERNOON.</u>\n\n     Wilson and Ed walk briskly along the path.\n\n<b>                         WILSON\n</b>                   (gives Ed parking ticket)\n               Bring the motor around.  Bang out in\n               front, right?\n\n<b>                         ED\n</b>               You goin' back inside?\n\n<b>                         WILSON\n</b>               One thing I need.\n\n     <u>INT. VALENTINE'S HOUSE.  DOWNSTAIRS.  AFTERNOON.</u>\n\n     Valentine is talking to Gordon, his beefy bodyguard, and\n     looking around.  He stops as he sees Wilson once again\n     stepping onto the deck.  He points Wilson out to Gordon, who\n     nods and heads for the deck.\n\n     <u>EXT. VALENTINE'S HOUSE.  AFTERNOON.</u>\n\n     Ed hands the ticket to a Valet.  He exchanges looks with a\n     couple of the other Valets.\n\n     <u>INT. VALENTINE'S HOUSE.  DOWNSTAIRS.  AFTERNOON.</u>\n\n     Valentine is talking to Adhara, who is introducing her\n     Girlfriend.  As Valentine greets her, he glances outside\n     where Gordon is approaching Wilson on the deck.\n\n     <u>EXT. DECK.</u>\n\n     Wilson SEES Gordon approaching.  Gets ready to greet him.\n     Removes cigarette from mouth, drops it to floor of deck,\n     presses it out under his shoe.  Limbers up his shoulders in a\n     subtle way.\n\n     Gordon coming towards him.  As if to challenge Wilson's\n     legitimacy as an invited guest.  Closer.  About to speak.\n\n     But Wilson doesn't even give him a chance to do that.  In\n     quick succession:  Wilson HEAD BUTTS Gordon, splintering his\n     nose; KNEES him in the groin; then, using the knee for\n     leverage, grabs Gordon by the lapels -- and heaves him over\n     the railing!\n\n     It happened so fast that if anyone else is nearby they\n     probably didn't even notice -- or didn't readily grasp what\n     they saw.\n\n     <u>INT. VALENTINE'S HOUSE.</u>\n\n     Valentine had turned his attention back to Adhara and her\n     Girlfriend.  When he glances back to the deck he's a little\n     concerned not to see Gordon anywhere out there anymore --\n     just Wilson coming back in.\n\n<b>     WILSON\n</b>\n     Adjusting his jacket, walking back through the house.  Behind\n     him, people are rushing to the railing and looking over.  A\n     few yells of \"Call an ambulance!\" etc. are heard.\n\n<b>     VALENTINE\n</b>\n     Moves that way.\n\n<b>     WILSON\n</b>\n     Moving across the room towards the front door.  They are\n     heading right toward each other.\n\n<b>     WILSON AND VALENTINE\n</b>\n     Pass each other, eyes locked, almost dream-like.  Wilson's\n     eyes cold, though with the hint of a smile.  Valentine throws\n     a last look back before reaching the deck.\n\n     <u>EXT. DECK.</u>\n\n     Valentine pushes through to look over the railing.\n\n<b>     HIS POV\n</b>\n     Gordon -- a crumpled, inert heap way down the hill below.\n\n<b>     VALENTINE\n</b>\n     Turns to look toward the front door.  Wilson not to be seen.\n     Valentine pushes through the crowd toward the door.\n\n     <u>EXT. VALENTINE'S HOUSE.  AFTERNOON.</u>\n\n     Valentine emerges in time to see Ed and Wilson pulling away.\n     Wilson looks at him, impassive, through the passenger window.\n\n<b>     AVERY\n</b>\n     Is just arriving in his car.  Valentine gestures at him.\n     Suddenly we HEAR a loud, bass-heavy WHHUUUMMMPPP.\n\n     Valentine (and a few others) turn toward the sound, which\n     came from:\n\n<b>     THE GARAGE\n</b>\n     There is smoke coming from under the door.\n\n     <u>EXT. CANYON ROAD.  AFTERNOON.</u>\n\n     Wilson's car practically tobogganing back down the hill.\n     BOOM!  We hear an explosion from back UP the hill.\n\n     <u>INT. WILSON'S CAR.</u>\n\n     Ed jumps -- though he's driving.  The gas pedal his most\n     pressing concern.  Negotiating the dangerously winding road\n     comes second.  Exhilaration mixed with panic.\n\n<b>                         WILSON\n</b>               Steady on.\n\n<b>                         ED\n</b>               You steady on, man.  What the fuck else\n               did you do back there.\n\n     <u>EXT. ROAD.</u>\n\n     An especially sharp curve looms ahead.\n\n<b>     WILSON\n</b>\n     Flinches, grabs a handhold.\n\n<b>     CURVE\n</b>\n     Car makes it around on two side wheels.\n\n<b>     WILSON\n</b>\n     Gulps.\n\n<b>                         WILSON\n</b>               Bloody hell.\n\n     Ed regains control.\n\n<b>     AVERY\n</b>\n     In his car, takes a different turn.\n\n     <u>EXT. ROAD.  CAR.</u>\n\n     Swerves some more curves.  Should be some sense here that a\n     similar skyline route would have been taken by Wilson's\n     daughter on her final drive.\n\n     <u>INT. WILSON'S CAR.</u>\n\n<b>                         ED\n</b>               Why didn't you just kill him, you had the\n               chance.\n\n<b>                         WILSON\n</b>               That would be too easy.\n\n<b>                         ED\n</b>               Too easy?\n\n<b>                         WILSON\n</b>               He's gotta know why.\n\n<b>                         ED\n</b>               You think a fuckin' guy like that ever\n               will?  What more do you want, man?\n\n     Suddenly out of nowhere -- (a side street) -- BAM! -- another\n     car shoots out to cut them off, sideswiping them.\n\n     <u>EXT. ROAD.</u>\n\n     Wilson's car SKIDS into a spin from the impact.\n\n<b>     THE OTHER CAR\n</b>\n     It's Avery.  Chased them via a shortcut down the mountain.\n     Now jumps out of his car, levels a shotgun at them and pumps\n     off a BLAST.\n\n<b>     WILSON'S CAR\n</b>\n     BAM! -- the trunk pops open as the car rights itself.  Avery\n     FIRES again, but the upended trunk is a kind of shield,\n     deflecting the shot.\n\n     <u>INT. WILSON'S CAR.</u>\n\n     Despite the fact that Ed is still in the driver's seat (and\n     managed rather skillfully to avoid crashing) -- Wilson acts\n     like he's not there, grabs the steering wheel, jams the car\n     into reverse, virtually sitting on Ed as he pounds his own\n     foot onto the gas pedal -- and with his ferocious eyes\n     monitoring the door-mirror, steamrolls the car backwards\n     towards Avery.\n\n     <u>EXT. ROAD.</u>\n\n     Wilson reverses his car like a speeding tank:  SMASHING into\n     Avery's car.  Pushing it right off the edge of the road.\n\n<b>     AVERY\n</b>\n     Falls backwards to the ground as he gets the hell out of the\n     way.\n\n<b>     WILSON\n</b>\n     Jumps out of his car.  Gun drawn.  Advancing on Avery with it\n     pointed.\n\n<b>     AVERY'S CAR\n</b>\n     CRASHING through underbrush down the steep bank of the\n     hillside.\n\n<b>     WILSON'S FACE\n</b>\n     SOUND of the divebombing car OVER.  Another pointed echo of\n     his daughter's fate.\n\n<b>     AVERY\n</b>\n     Their eyes meet momentarily.  And before Wilson can shoot,\n     Avery rolls over the edge of the road himself.\n\n<b>     ED\n</b>\n     Calls frantically to Wilson from their car.\n\n<b>                         ED\n</b>               C'mon, man!  C'mon!\n\n     SIRENS in the distance.\n\n<b>     WILSON\n</b>\n     That consuming rage overtaken him again for a second.  But\n     the exigencies of the moment snap him out of it.\n\n<b>     WILSON\n</b>\n     Turns on a dime, goes back to the car.  Before he's halfway\n     in, Ed's driving them away again.  Trunk at the back BANGING\n     up and down, up and down.\n\n<b>     AVERY\n</b>\n     Pulls himself back up to the road.  Brushing himself off.\n     Looking the way they went.\n\n     He gently tosses his shotgun down into some thick brush where\n     maybe he'll retrieve it later.\n\n     <u>EXT. VALENTINE'S HOUSE.  AFTERNOON.</u>\n\n     Avery returns, sweating, walking back up the road to where\n     all the action is.  Party guests milling outside, waiting for\n     their cars so they can leave.  A fire truck, a police car.\n     SMOKE pouring out of Valentine's garage.\n\n     Valentine finishes talking to a couple of COPS.  Walks over to\n     Avery.\n\n<b>                         AVERY\n</b>               You should have let me do the talking.\n\n<b>                         VALENTINE\n</b>               Why, because you're my security\n               consultant?\n                   (insecure)\n               This cocksucker nearly burnt my house\n               down.\n\n<b>                         AVERY\n</b>                   (more concerned about police\n                    presence)\n               What did you tell them.\n\n     Valentine blows air, runs a hand through his hair.\n\n<b>                         VALENTINE\n</b>               I told them a long-time employee flipped\n               out.  Had a drug problem, refused\n               counselling.  Set the garage on fire,\n               then committed suicide.  One of my\n               \"guests\" tried to stop him -- <u>but how do</u>\n               <u>you stop Gordon</u>.\n\n     In this context meaning how did that rangy Englishman do it.\n\n<b>                         VALENTINE\n</b>               I mean, Gordon must weigh a good four\n               hundred pounds.\n\n<b>                         AVERY\n</b>               Heavier than that now.  But are there any\n               drugs in that stomach to back up your\n               story.\n\n<b>                         VALENTINE\n</b>               As it happens.  I didn't make that part\n               up.\n\n<b>                         AVERY\n</b>               And where is this guest?  Don't they want\n               to interview him.\n\n<b>                         VALENTINE\n</b>               I don't know everyone here.  He was so\n               traumatized he split.\n                   (another notion)\n               Maybe he was Gordon's <u>pusher</u>.\n\n     Avery stares at Valentine.  Impressed at him thinking on his\n     feet.\n\n<b>                         VALENTINE\n</b>               Where do <u>you</u> think he is, Mike.\n\n<b>                         AVERY\n</b>                   (already turning)\n               We'll find him.\n\n<b>                         VALENTINE\n</b>                   (stops him)\n               No.  I mean.  Not even your people should\n               be involved.  Right?  It's too close now.\n\n<b>                         AVERY\n</b>               You could use a few of my prime\n               shitkickers up here.\n\n<b>                         VALENTINE\n</b>               You think I'm staying?\n\n<b>                         AVERY\n</b>               There's already gonna be talk about how\n               people close to you keep falling into\n               canyons.\n\n<b>                         VALENTINE\n</b>               Well, can we make it one more.  Nowhere\n               the fuck near me.\n\n     He's being glib, but he's being serious.  His open-handed\n     gesture inquiring of Avery:  are you up to the task?\n\n<b>                         AVERY\n</b>               I have other resources.\n\n     He turns to go.\n\n     <u>EXT. VALENTINE'S HOUSE.  CANYON.  AFTERNOON.</u>\n\n     The huge dead bulk of Gordon hoisted back up to the deck by a\n     paramedic team.\n\n     <u>INT. VALENTINE'S HOUSE.</u>\n\n     Valentine comes back in.  In the living room beyond, Adhara\n     stands anxiously, where she's been waiting for him.  Cops\n     visible outside on the deck, peering over the edge.\n\n<b>     VALENTINE\n</b>\n     Heading that way.  Then stops.  Backtracks.  Something\n     peripherally had caught his eye and he returns to it.  His\n     wall of photographs.\n\n<b>     AN EMPTY FRAME\n</b>\n     The one that had contained the picture of Jenny.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. WILSON'S CAR.  AFTERNOON.</u>\n\n     Safely down the hill.  Driving away in traffic, Ed calmer\n     now.\n\n<b>     WILSON\n</b>\n     Pulls the rolled-up photograph of his daughter out of his\n     jacket and looks at it.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. POOL HALL.  NIGHT.</u>\n\n     Two characters stand, leaning, against a back wall.  Staring\n     ahead, without purpose.  Halfheartedly watching a game of\n     pool in progress.  Just hanging out.  Strange, threatening\n     characters.  One of them is young.  Lean, hungry-looking.\n     STACY is his name.  A shrewd, scheming kid.  But definitely a\n     little unhinged.  Weirder is his companion.  UNCLE JOHN.  The\n     title isn't one of courtesy.  He's an actual blood relative.\n     Maybe 25 years older than Stacy.  But intellectually younger.\n     Physically, much bigger.  The man is huge.  Nevertheless, the\n     safer of the two -- until Stacy tells him otherwise.  Way\n     they're standing next to each other suggests the ease they\n     feel in each other's company.  Tight bond.  They're good\n     buddies.\n\n<b>     AVERY\n</b>\n     Walks in.  Stops to look around.  Spots his two freaks.\n     Walks toward them.\n\n<b>     DOORWAY\n</b>\n     A mysterious black man has followed Avery in.  THOMPSON is\n     his name.  He hangs back and watches.\n\n<b>     AVERY\n</b>\n     Makes contact.\n\n<b>                         AVERY\n</b>               Stacy.\n\n     Stacy turns to see him.  Uncle John looks vacantly.\n\n<b>                         STACY\n</b>                   (bored)\n               Hey.\n\n<b>                         AVERY\n</b>               Come over here.\n\n     That was in the way of an order.  He nods around the corner\n     where it's less crowded.  Stacy stops Uncle John from\n     following, and goes after Avery.\n\n<b>     THOMPSON\n</b>\n     At the bar.  Keeping his eye on them.\n\n<b>     AVERY\n</b>\n     Speaks softly.  Alone with Stacy.\n\n<b>                         AVERY\n</b>               How they goin', kid?\n\n<b>                         STACY\n</b>               Not bad.\n\n<b>                         AVERY\n</b>               How'd you like to kill someone for me?\n\n<b>                         STACY\n</b>               Okay.\n\n     Avery gives him an envelope.\n\n<b>                         AVERY\n</b>               Same as last time -- the rest after.\n\n<b>                         STACY\n</b>                   (pockets it)\n               Where do we go?\n\n<b>                         AVERY\n</b>               When you find the guy, you'll know.\n\n<b>                         STACY\n</b>               What shit is this.  I just do it.  I\n               don't prepare it.\n\n<b>                         AVERY\n</b>               I'll point you in the right direction,\n               but you'll have to take it to the end-\n               zone.  He's a hit-and-run gunman -- I\n               figure he's not cruising the Polo Lounge.\n\n<b>                         STACY\n</b>               This is un-fucking professional.\n\n<b>                         AVERY\n</b>               See, a successful man like me has\n               limitations -- I lose touch at a street\n               level.  So I have to depend on a smart\n               boy like you who's closer to the nitty\n               and the gritty than I am.\n\n<b>                         STACY\n</b>               Fuck you, Mr. whatever-your-name is.\n               This is a lifestyle I embrace.\n\n<b>                         AVERY\n</b>               That's why I'm letting you take care of\n               this.  I'm the one with appearances to\n               maintain.  But who gives a shit about\n               you?  Not even God.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. WILSON'S MOTEL.  NIGHT.</u>\n\n     Wilson on the bed.  Watching TV (ACCESS HOLLYWOOD!).  KNOCK\n     at door.  He turns down the TV.  Takes a .45 from the springs\n     under the bed.  Looks carefully through the peephole in the\n     door.\n\n     Opens it.  Elaine has come to visit.  Lets her in.  After\n     closing the door resumes his position on the bed.\n\n     Elaine looks around.\n\n<b>                         ELAINE\n</b>               I was in the neighborhood.  I come down\n               here quite a bit.  Watch the planes\n               taking off.\n                   (re this motel)\n               Study the architecture of early David\n               Lynch.\n\n     But she doesn't really have it in her to be ironic right now.\n     Leans back against the door.\n\n     Wilson remains silent.  He's done the same to Elaine now that\n     he did to Ed.  Almost magically induced her to a confessional\n     verge.\n\n     Elaine, too, isn't sure she wants to be complicit in this\n     revenge tragedy.  But here goes:\n\n<b>                         ELAINE\n</b>               Jenny was supposed to come to my place\n               that night.  She called me, asked if she\n               could come over.  She and Terry had been\n               -- having some trouble.  Lately.  I don't\n               know about what.  On this occasion, it\n               reached some sort of crisis point.\n\n<b>                         WILSON\n</b>               She told you all about my details but not\n               about his.  Lovely.\n\n<b>                         ELAINE\n</b>               She'd never called me like that before.\n               She sounded more ... pissed off -- angry --\n               than upset or afraid.  But she never\n               turned up.  I called the house but only\n               got the answer machine.  When they found\n               her ... she'd been going the wrong way.\n               Not the direction she'd have gone if\n               she'd been coming to see me.  Or coming\n               <u>straight</u> to see me.  Who knows.  Maybe she\n               just wanted to drive.\n\n     She looks at Wilson.  Shrugs.  That's it.  That's all.  Isn't\n     it?\n\n<b>                         WILSON\n</b>                   (measured)\n               How did you come to have my address?\n               Found it, did you.  Among her things.\n\n<b>                         ELAINE\n</b>               You think Terry gave me access to her\n               things?  Probably sold her clothes.\n\n<b>                         WILSON\n</b>                   (gently urging)\n               And how did you get it?\n\n     Elaine looks at him.\n\n<b>                         ELAINE\n</b>               <u>She</u> gave me your address.\n\n     Wilson nods.\n\n                         ELAINE (cont'd)\n                   (starting to realize)\n               Not long before ...\n                   (realizing)\n               She said if anything ever happened ...\n                   (realizes)\n               That's how you know.  That's why you're\n               so sure.\n                   (realization)\n               Jenny's telling you.\n\n     She's sitting on the bed now.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. MEAN STREET.  NIGHT.</u>\n\n     Stacy, putting on a jacket that says \"Bomb Hanoi\" comes out\n     of the pool hall.  Uncle John in tow.\n\n<b>                         UNCLE JOHN\n</b>               How much.\n\n<b>                         STACY\n</b>               Five thousand.\n\n<b>                         UNCLE JOHN\n</b>                   (impressed)\n               Hey.\n\n<b>                         STACY\n</b>                   (taps pocket)\n               I got half.\n\n<b>                         UNCLE JOHN\n</b>               Makin' trouble for someone?\n\n<b>                         STACY\n</b>               Yeah.\n\n<b>                         UNCLE JOHN\n</b>               Which kind?\n\n<b>                         STACY\n</b>               The forever kind.\n\n<b>     BEHIND THEM\n</b>\n     Thompson, the mysterious black man, watches them from the\n     hall doorway.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. WILSON'S MOTEL.  MORNING.</u>\n\n     Early.\n\n     <u>INT. WILSON'S ROOM.</u>\n\n     Wilson and Elaine.  Getting dressed.  She's in pantyhose.\n     Fastening a bra.  He's got trousers on, reaching for a shirt.\n\n<b>                         WILSON\n</b>               How long've you lived here?\n\n     Elaine sits on the bed, fastening her skirt.  Her bra strap\n     cuts across her bare back.\n\n<b>                         ELAINE\n</b>               This town's been chewing my flesh\n               since ... what we now refer to as \"the\n               early 70's.\"\n                   (thinks back)\n               Christ, my past became nostalgia and no\n               one even asked me.\n\n<b>                         WILSON\n</b>               Early 70's.  I was away.\n                   (tries to remember)\n               Maidstone.  Possibly Brixton.\n\n<b>                         ELAINE\n</b>               These more highlights from the Zagat\n               prison guide?\n\n     Wilson looks at her:  she's the one who goes to bed with ex-\n     cons.\n\n<b>                         WILSON\n</b>               You don't seem bothered.\n\n<b>                         ELAINE\n</b>               You don't know how I've compromised my\n               standards.\n\n<b>                         WILSON\n</b>               Tell us about it.\n\n<b>                         ELAINE\n</b>               It's too involved; a lifetime of non-\n               involvement.  Anywhere else I'd be an\n               interesting little number, here I'm just\n               SAG number forty-eight thousand and one.\n                   (quickly)\n               SAG meaning Screen Actor's Guild.\n\n<b>                         WILSON\n</b>               Oh, I was gonna say ...\n\n<b>                         ELAINE\n</b>               Still, there have been rewards.  It's\n               sunny.  And some of the producers who\n               call even have credits.\n\n<b>                         WILSON\n</b>               I can see the attraction.\n\n     She glances up at him to try and see how he means that.  Is\n     he looking at her or out the window?\n\n<b>                         ELAINE\n</b>               What did you do?  To make them take the\n               early 70's away from you.\n\n<b>                         WILSON\n</b>               A jeweller's up the West End.  We\n               tunnelled our way under the shop floor\n               from the public lavatory down the road.\n               Filthy work.  Trouble was, the bloody\n               thing collapsed -- <u>after</u> we'd made the\n               grab, 'n all.  Would you Adam n' Eve it.\n\n<b>                         ELAINE\n</b>               You mean if they'd nabbed you before you\n               actually broke and entered you would only\n               have been charged with making a mess.\n\n<b>                         WILSON\n</b>               We were <u>lucky</u> to be nicked.  Me and the\n               lads went down there Sunday evening, we\n               weren't discovered till the Monday.  Good\n               job we were still breathing.\n\n<b>                         ELAINE\n</b>               It didn't discourage you, though.\n\n<b>                         WILSON\n</b>               Hey?\n\n<b>                         ELAINE\n</b>               From pursuing your chosen profession.\n\n<b>                         WILSON\n</b>               I'll tell ya something:  it made me a\n               model prisoner.  Put me right off any\n               escape attempts.  Tunnel my way to\n               freedom after that experience?  Not\n               bloody likely.\n\n<b>                         ELAINE\n</b>               I was inside once.  I punched a cop at a\n               demo.\n\n<b>                         WILSON\n</b>               Did you.  What was that in aid of?\n\n<b>                         ELAINE\n</b>               Who remembers.\n\n<b>                         WILSON\n</b>               Get seven years, did you?\n\n<b>                         ELAINE\n</b>               Overnight.  What about just now?\n\n<b>                         WILSON\n</b>               Just now?\n                   (playful, goes over, ready for\n                    more)\n               Overnight?\n\n<b>                         ELAINE\n</b>               You <u>have</u> been away.\n                   (lies back, regards him\n                    carefully)\n               Or is all this just new to you?\n\n<b>                         WILSON\n</b>               It's true.  Has to be said.  I got off to\n               a slow start.\n\n<b>                         ELAINE\n</b>               I don't believe it.\n\n<b>                         WILSON\n</b>               Honest.  Didn't know where to look till I\n               was 21.\n\n<b>                         ELAINE\n</b>               Pushing the legal limit even then.\n\n     He stands again, vaguely disappointing her.\n\n<b>                         WILSON\n</b>               Me mate introduced me to a woman up the\n               street.  Funnily enough, she was married\n               to a milkman.  Straight up.  I said,\n               \"Good is she?  Been around?\"  He said,\n               \"<u>Good</u>?  Listen, mush, it's not that she's\n               been around, it's that she's been around\n               hell of a long time.\"\n\n     He laughs uproariously at that.  But the point is:  he's sort\n     of complimenting both Elaine and himself.  They've been\n     around, had their knocks, they've lasted.  Elaine remains\n     unsmiling.\n\n     Still leaning back on her elbows on the bed, in bra, skirt,\n     hose, no shoes.  She asks again the question Wilson avoided\n     answering.\n\n<b>                         ELAINE\n</b>               Your most recent incarceration.  What was\n               that for?\n\n     And again he evades the answer she wants.\n\n<b>                         WILSON\n</b>               It was for nine years.\n                   (buttoning his shirt)\n               The last nine years.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. PACIFIC COAST HIGHWAY.  MORNING.</u>\n\n     For the first time, we see the Pacific coastline.  Impressive.\n\n     And a sleek Italian sports car.  Heading north.\n\n     <u>INT. SPORTS CAR.</u>\n\n     Valentine at the wheel.  Adhara besides him.\n\n<b>                         ADHARA\n</b>               I've lived in L.A. all my life, I've\n               never done this drive.\n\n<b>                         VALENTINE\n</b>               All your life.  That happened while I\n               swam the length of my pool.\n\n     Adhara looks back over her shoulder.  Checking the road\n     behind.\n\n<b>                         VALENTINE\n</b>               What's the matter?\n\n<b>                         ADHARA\n</b>               Nothing.  I guess it's hard to pass on\n               this road.\n\n<b>                         VALENTINE\n</b>               The freeway's faster, but lacks a certain\n               majesty.\n\n<b>                         ADHARA\n</b>               Just feels like the car behind has been\n               following us the longest time.\n\n<b>                         VALENTINE\n</b>               I sure hope so.\n\n     <u>INT. THE CAR BEHIND.</u>\n\n     A big utility vehicle.  With Avery in the front passenger\n     seat.  And three bodyguards he's brought along to protect\n     Valentine.  RICK driving, TOM and LARRY in the back.\n\n<b>                         TOM\n</b>               All I'm sayin' is travel time shouldn't\n               be the same rate.  Travel time is down\n               time, right?  I mean, we're not even in\n               the same car as the client.\n                   (to Avery)\n               You told me the job was at the house.\n               When we get to it.  Well, are we shadowing\n               the client right now or are we just going\n               the same way?  The company I was with in\n               Seattle, these distinctions were made.\n               Now, I don't dispute <u>him</u> getting the full\n               whack.\n                   (he means Rick, who's older)\n               Seniority and all that.  But if I'm\n               getting paid the same hourly rate when\n               we're at the <u>house</u> as I am in this car,\n               that doesn't sit well with me and I feel\n               obliged to say so.  'Cause in Seattle\n               what you're paying <u>now</u> for so-called\n               travel time was half what we got for\n               actual clock-time with the client.  So I\n               just feel we should get more when the job\n               actually <u>commences</u>.\n\n     After this spineless whining weak-willed sob story, Larry\n     just turns to him and says:\n\n<b>                         LARRY\n</b>               ... I'd really like to eat your pussy.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. ELAINE'S NEIGHBORHOOD.  DAY.</u>\n\n     Stacy and Uncle John sitting on a bench in a beach setting\n     (though we still don't see the ocean).  Or on some grass,\n     maybe, in a little park -- opposite Elaine's building.\n\n     People-watching.  In their own unique way.  Stacy commenting\n     on fellow humanity all around them.  TIME CUTS between each\n     comment:\n\n<b>                         STACY\n</b>                   (after laughing loudly at a\n                    handicapped person)\n               I believe in mocking the afflicted.  Good\n               for 'em.  Makes 'em stronger.\n\n     Uncle John picks at the grass or sand.  As they kill the day.\n\n<b>                         STACY\n</b>                   (spotting a woman with a dog)\n               Ever take a look at the women who work in\n               pet stores?  Wow.\n\n<b>                         STACY\n</b>                   (as a fat jogger passes)\n               Good luck.\n\n<b>                         STACY\n</b>                   (watching someone else go by)\n               Jesus, are you gay enough or what.\n\n<b>                         STACY\n</b>                   (barely out of earshot of a\n                    black woman with dyed blonde\n                    hair)\n               Very attractive.  Good idea.  Now I\n               <u>really</u> want to fuck you.\n\n<b>                         STACY\n</b>                   (after a long time in silence,\n                    just staring at someone)\n               ... you can always tell the ones who'll do\n               anal.\n\n<b>                         STACY\n</b>                   (regarding some other\n                    beachgoers)\n               Kinda makes you wonder why more people\n               don't put a bullet through their fuckin'\n               skulls, doesn't it.\n\n<b>                         STACY\n</b>                   (reading a newspaper)\n               Looks like they just airbrushed the dick\n               out of his mouth.\n\n<b>                         STACY\n</b>                   (leaning back on his elbows)\n               Why don't they have TV shows about people\n               whose daily lives you'd be interested in\n               watching.  Y'know.  Like SKINNY LITTLE\n               WEAKLING.  Or BIG FAT GUY.  SICK OLD MAN.\n               FAMILY OF LOSERS.  Wouldn't that be good?\n\n<b>                         STACY\n</b>                   (sitting up)\n               Two blacks and a Mexican in a car.  Who's\n               driving?\n\n<b>                         UNCLE JOHN\n</b>               I don't know.\n\n<b>                         STACY\n</b>               The L.A.P.D.\n\n<b>                         STACY\n</b>                   (observing a \"fast-walker\")\n               Oh yeah, keep doing that.  That's really\n               healthy.\n\n<b>                         STACY\n</b>                   (his gaze following another\n                    unfortunate)\n               Can't you do something about your ass?\n\n<b>                         STACY\n</b>                   (his head turning after someone\n                    else)\n               Other people's lives scare the shit out\n               of me.\n\n<b>                         STACY\n</b>                   (watching some guy rooting in a\n                    trash bin)\n               \"Homeless\" people.  Fuck them.  Remember\n               when they were just bums?  Everyone with\n               an axe to grind.  Like to grind in their\n               face.  Pretty soon there'll be shit-in-\n               your-pants rights groups.  Stupidity\n               activists.\n\n<b>                         STACY\n</b>                   (glad he's who he is and not\n                    who he's looking at)\n               Wonder what it's like being a dumb guy in\n               a dumb suit trying to cross the street.\n\n<b>                         STACY\n</b>                   (staring at another sad couple)\n               Life sure is a minefield.\n\n<b>                         STACY\n</b>                   (clocking another female)\n               Look at that one.  She's really been\n               used.\n\n<b>                         STACY\n</b>                   (in a contemplative mode)\n               I'd love to be famous so I could snub\n               ordinary people.  Imagine, you're famous,\n               you're sitting in a restaurant, some fool\n               comes up to you, wants you to sign your\n               name on his napkin, his wife is there, it\n               would be something these poor saps would\n               cherish the rest of their lives, talk\n               about to their cretin friends.  Bam!  You\n               tell 'em to FUCK OFF!  God, I'd love\n               that.\n\n     Suddenly Uncle John speaks.\n\n<b>                         UNCLE JOHN\n</b>               Is that her?  I bet that's her.\n\n     Stacy turns.\n\n<b>     POV\n</b>\n     Across the street, Elaine comes out of her building.  (We're\n     supposing this is an apartment building somewhat worth living\n     in that has outdoor parking of some kind, visible from the\n     street, or only street parking.)\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. SOME STREET.  DAY.</u>\n\n     Elaine's car on the move.  Stacy and Uncle John in a car\n     following.\n\n     <u>INT. ELAINE'S CAR.</u>\n\n     Going somewhere.  Unaware of the creeps in her wake.\n\n     <u>INT. STACY/UNCLE JOHN'S CAR.</u>\n\n     An \"8x10\" of Elaine on their back seat.  Another picture of\n     her on a page torn from a \"Player's Directory.\"\n\n<b>                         UNCLE JOHN\n</b>               Maybe she doesn't even know the English\n               guy.\n\n<b>                         STACY\n</b>                   (driving)\n               Avery said she was tight with his\n               daughter.\n\n<b>                         UNCLE JOHN\n</b>               That don't mean nothin'.\n\n     Stacy knows better than to argue with a moron.\n\n<b>                         UNCLE JOHN\n</b>               She's nice lookin'.\n\n<b>                         STACY\n</b>               So what.\n\n<b>                         UNCLE JOHN\n</b>               I dunno.  I just said she's nice lookin'.\n\n<b>                         STACY\n</b>               And I said so what.  You think she's any\n               happier?\n\n<b>                         UNCLE JOHN\n</b>               What d'you mean, any happier?\n\n<b>                         STACY\n</b>               Any happier than any other asshole in\n               life.\n\n     Pause.\n\n<b>                         UNCLE JOHN\n</b>               I dunno.  I never met her.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. SOUND STUDIO.  DAY.</u>\n\n     On screen:  A BEAUTIFUL MODEL -- but speaking in ELAINE'S\n<b>     VOICE.\n</b>\n<b>     ELAINE\n</b>\n     At a mic.  Wearing headphones.  Matching her voice to the\n     model's lip movements.  Looping this commercial or whatever\n     it is.\n\n     <u>INT. HALLWAY.</u>\n\n     Wilson.  Comes to a window where he can see Elaine inside in\n     the sound-proofed studio.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. SOUND STUDIO.  DAY.</u>\n\n     Wilson and Elaine talk while technicians change reels.\n\n<b>                         ELAINE\n</b>               -- they want Southern, I do Southern,\n               they want Midwest, I do Midwest, they\n               want tall, blonde, and twenty-two, I'm\n               shit out of luck.\n                   (pauses)\n               One thing I can't do is English.\n               Americans can't.  Shouldn't even try.\n               And Laurence Olivier couldn't do us.\n\n<b>                         WILSON\n</b>               You ever been to London?\n\n<b>                         ELAINE\n</b>               Only in the movies.\n\n<b>                         WILSON\n</b>               I've 'ardly ever left it.\n\n<b>                         ELAINE\n</b>               Yeah, well, you're here now --\n                   (re Wilson's accent)\n               -- where <u>h</u>urricanes <u>h</u>ardly ever <u>h</u>appen.\n\n<b>                         WILSON\n</b>               I've got the hang of the driving.  Found\n               this place all right.\n\n<b>                         ELAINE\n</b>               Stick with me, kid.  Looks big when you\n               get here but you can cover it in five\n               minutes.\n\n     Beat.\n\n                         ELAINE (cont'd)\n               So, is there anybody in your family who's\n               not a criminal?\n\n<b>                         WILSON\n</b>               Not that I recall.\n\n<b>                         ELAINE\n</b>               What about your grandmother?\n\n<b>                         WILSON\n</b>               Nah -- she was married to me grandad --\n               he was as bent as a boomerang -- used to\n               make knuckle-dusters down the shop.\n               Crafty old sod.\n\n<b>                         ELAINE\n</b>               He alive to see this?\n\n<b>                         WILSON\n</b>                   (shakes head)\n               Dropped dead in the stalls in the Odeon,\n               Muswell Hill.  Watching Doris Day.\n\n<b>                         ELAINE\n</b>               What'd your father do?\n\n<b>                         WILSON\n</b>               Black market during the war.\n\n     Elaine shakes her head.\n\n<b>                         ELAINE\n</b>               I guess you're just habitual.\n\n<b>                         WILSON\n</b>               You sound like my fucking probation\n               officer.\n\n<b>                         ELAINE\n</b>               Won't he be looking for you about now?\n\n<b>                         WILSON\n</b>               Good luck to him.  He couldn't find his\n               prick if he didn't wear Y-fronts.\n\n<b>                         ELAINE\n</b>               Minor officials bother you, don't they?\n\n<b>                         WILSON\n</b>               Do us a favor.  Can't even go have a\n               slash without 'em saying, what're you\n               going in there for?\n\n     <u>EXT. ELAINE'S BUILDING.  DAY.</u>\n\n     Elaine and Wilson enter.  Stacy not far behind.  Catches\n     outside gate before it slams shut.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. ELAINE'S BUILDING.  DAY.</u>\n\n     Wilson and Elaine turn the corner into the corridor\n     approaching her apartment door.  Pause to kiss.  Walk closer.\n\n     And Stacy appears at the other end of the hall.  Both arms\n     stretched out with the .38 at the end of them.\n\n<b>                         STACY\n</b>               Hi, kids.\n\n     Starts to squeeze off a shot.  As Wilson pushes Elaine to the\n     floor.  As <u>another</u> SHOT rings out from further along the hall\n     behind Stacy.  Catching him across the cheek.  Only skimming\n     him.  But knocking him down.  Bullet chipping the wall.\n\n<b>     UNCLE JOHN\n</b>\n     Across from Stacy.  Freezes, his own gun in hand.\n\n<b>     AT THE STAIRS\n</b>\n     Three BLACK GUYS.  Including Thompson.  They approach.  Guns\n     pointed at Stacy and Uncle John.\n\n<b>     WILSON\n</b>\n     Hand on his .45 now.  But a fourth Black Guy coming up behind\n     him.  Wilson lowers the .45.\n\n<b>     ELAINE\n</b>\n     Flattened herself back against a wall.  Petrified.\n\n<b>     STACY\n</b>\n     Sits on the floor.  Holds his hurt face.  Thompson walks over\n     and picks up Stacy's gun.  One of the other blacks relieves a\n     reluctant Uncle John of his.\n\n<b>                         THOMPSON\n</b>                   (stops at Wilson)\n               Come with us.\n\n     If there's any doubt whether Wilson will -- one of the blacks\n     gently puts the muzzle of a gun to Elaine's head.  Cocks the\n     hammer.\n\n     They all go off down the stairwell.  Except Stacy and Uncle\n     John.\n\n     Hit men wondering what hit them.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. ROOM.  DAY.</u>\n\n     Like Wilson's motel room, another version of a cell.\n\n     A small window, high up.  Bricks and debris around the floor.\n     And Wilson and Elaine.  Sitting, leaning against opposite\n     stone walls.\n\n<b>                         ELAINE\n</b>               Tell me you wouldn't prefer a steady\n               income.\n\n     Wilson takes a cigarette pack from a pocket.  Lights himself\n     one.  Then tosses the stuff over to Elaine.\n\n<b>                         WILSON\n</b>               I got a steady income -- I'm on the dole.\n\n<b>                         ELAINE\n</b>                   (lights up)\n               A leech on the welfare state in addition.\n               You don't miss a trick.\n\n<b>                         WILSON\n</b>               I fiddle it.  They got me down as an\n               immigrant with five kids.\n\n     Elaine sort of shares a laugh at that.\n\n<b>                         ELAINE\n</b>               Yeah ... Jenny spoke fondly of her\n               imaginary siblings.\n\n     Though real ones might have been nice.  This an unspoken\n     thought between them.\n\n                         ELAINE (cont'd)\n               Do you remember the last time you saw\n               her?\n\n<b>                         WILSON\n</b>               Last time might as well've been the\n               first.  I remember all the times, don't\n               I.  Watching her grow up --\n                   (finding the word)\n               in increments.\n\n<b>                         ELAINE\n</b>               She told me you were a ghost in her life.\n               Daddy the friendly ghost.  Coming back to\n               haunt her.\n\n<b>                         WILSON\n</b>               Well, she twigged by the time she was\n               eight or nine that daddy wasn't in the\n               Royal Marines or doing scientific\n               research in the jungles of Borneo or\n               playing Iago in a worldwide tour of\n<b>               OTHELLO.\n</b>\n<b>                         ELAINE\n</b>               Still, you could never ... do what she\n               wanted.\n\n     Wilson shakes his head.\n\n<b>                         WILSON\n</b>               She used to tell me she'd turn me in.\n                   (tries to laugh about it)\n               Little kid.  Ten year old.  \"If you're\n               naughty, Dad, I'll tell on ya.\"  She\n               didn't want me sent down again, see.\n               When I was planning some job.  \"I'll tell\n               'em, Dad, I promise I will.  Here, look,\n               I'm calling the Old Bill right now\" --\n               picking up the telephone.  I can see her,\n               the phone in her hand.  Became a sort of\n               joke between us.  Only it wasn't a joke.\n\n<b>                         ELAINE\n</b>               She never would have turned you in, not\n               in a million years.\n\n<b>                         WILSON\n</b>               I know that.  But as time went on ...\n               well, it <u>wasn't</u> a joke, was it?  She had\n               a feeling about it -- about the last job\n               -- how long I'd get the hook for.  Said\n               she wouldn't be there this time when I\n               got out.\n\n     DOOR opens.  Thompson.  Gun in hand.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. HALLWAY.  DAY.</u>\n\n     Thompson leads Wilson past a row of windows.  Dockyards,\n     harbor activity outside.  Toward a door with things\n     stencilled on it.  One of them:  US DEPT. OF CUSTOMS.\n\n     <u>INT. OFFICE.</u>\n\n     A man named FEATHER.  Black.  Half sitting on the edge of a\n     table.  Wilson is shown in.\n\n     Wilson at the door.  Sizes Feather up at a glance.\n\n<b>                         WILSON\n</b>               This is where I come in.\n\n     He walks confidently in.  Outside, through the window, an\n     image of a foreign sports car being hoisted in the air by a\n     crane.\n\n     There's a chair.  Wilson sits in it.\n\n     Feather squints a little.  Seems ready to listen to whatever\n     Wilson has to say.\n\n                         WILSON (cont'd)\n               How's it going, squire, all right?  Now\n               listen -- when I was in the nick --\n               second time, it was -- no, third.  Third\n               stretch, yeah.  There was this screw had\n               it in for me.  That geezer was top of my\n               list.  Two years after I was slung, I saw\n               him.  He was sitting on a bench in\n               Holland Park.  There was no one else\n               about.  I coulda gone up behind him and\n               snapped his fucking neck.  But I left it.\n               Coulda nobbled him, but I didn't.  'Cos\n               what I thought I wanted wasn't what I\n               wanted.  What I thought I was thinking\n               about was something else.  This berk on\n               the bench wasn't worth my time.  See what\n               I mean?  It didn't matter.  It meant sod\n               all in the end.\n\n     Feather has been listening to this, expressionless.  Now he\n     raises a finger as if there's a point he wants clarified.\n\n<b>                         FEATHER\n</b>               There's one thing I don't understand.\n                   (wants to make this clear)\n               The thing I don't understand ... is every\n               motherfucking thing you're saying.\n\n<b>                         WILSON\n</b>               Look, mush, you're the guv'nor here, I\n               can see that, I'm on your manor now,\n               right.  So there's no need to get out of\n               your pram.  I'm Johnny-come-lately to all\n               this.  Whatever the bollocks between you\n               and this slag Valentine, it's got nothing\n               to do with me.  I don't wanna know.\n\n<b>                         FEATHER\n</b>               Well, I'll tell you.  I believe this\n               Valentine screwed me out of a fair sum of\n               money.\n\n<b>                         WILSON\n</b>               I can well believe it.  I'm sure he has\n               done, son.  He's about as straight as a\n               dog's hind leg.\n\n<b>                         FEATHER\n</b>               But I can't be sure.  I don't even know\n               who he is.  He's too insulated.  Too many\n               layers around him.\n\n<b>                         WILSON\n</b>               Your guess is as good as mine, mate.  I'm\n               here on another matter entirely.\n\n<b>                         FEATHER\n</b>                   (moves to window)\n               Yeah, I guess you are.\n\n<b>                         WILSON\n</b>               Good job your lot showed up when they did\n               or it would've been <u>me</u> for the high jump.\n\n<b>                         FEATHER\n</b>               That dude who works for Valentine.  He's\n               the one sent those guys after you.  You\n               know that.\n\n<b>                         WILSON\n</b>               Yeah.  Shouldn't wonder.  Must've done.\n\n<b>                         FEATHER\n</b>               So what's your beef, pal?\n\n<b>                         WILSON\n</b>               Nothing financial.  Strictly personal.\n                   (moves to window)\n               I can see how all this import-export\n               malarkey might give rise to confusion\n               where I'm concerned.  A foreigner,\n               showing up unexpectedly, like.\n\n<b>                         FEATHER\n</b>                   (looks at him)\n               It was you.  Downtown.\n\n<b>                         WILSON\n</b>                   (all innocent)\n               Eh?\n\n<b>                         FEATHER\n</b>               Because that wasn't anything to do with\n               me.  And suspicion has been cast in my\n               direction.\n                   (pondering)\n               Didn't make any sense.  Choosing those\n               shitheads over me, cutting me out of the\n               deal, then screwing them over too.\n\n<b>                         WILSON\n</b>               No, I can reassure you on that point.\n               Valentine was just as surprised by that\n               turn of events as you.\n\n<b>                         FEATHER\n</b>               He'd already grabbed more than his\n               allotted cut.  Didn't think he'd be so\n               bold as to take all of it.\n\n<b>                         WILSON\n</b>               All of what?\n\n<b>                         FEATHER\n</b>               Of the deal, man.\n\n<b>                         WILSON\n</b>               Oh, yeah, right.  The deal.\n\n<b>                         FEATHER\n</b>               But if you're mad at him too and he's mad\n               at you ... that must make us pals.\n\n<b>                         WILSON\n</b>               As you prefer, squire.  As you prefer.\n\n<b>                         FEATHER\n</b>                   (weary of his life)\n               In which case I'll just do what I usually\n               do.\n\n<b>                         WILSON\n</b>               And that is?\n\n<b>                         FEATHER\n</b>               What am I doing?\n\n     He's standing at the window, staring out.  As if Wilson isn't\n     even in the room any more.  A ship being loaded out there.\n     Inspectors with clipboards.  Trucks like the ones we saw at\n     that warehouse downtown.\n\n<b>                         WILSON\n</b>               Looking the other way.\n                   (turns to go)\n               Gotcha.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. INN.  DAY.</u>\n\n     Along the way up the coast.\n\n     Through a window we SEE Valentine and Adhara enjoying a\n     pleasant lunch.\n\n     The bodyguards hang out by the cars outside with fast food\n     bags and drinks.\n\n<b>                         TOM\n</b>                   (to Rick)\n               I mean, how much are you getting?  Just\n               as a point of interest.  See, I didn't\n               realize there was a sliding scale.\n\n<b>     AVERY\n</b>\n     At a payphone.  His idiots in the background.  Dials a\n     number.\n\n     <u>INT. POOL HALL.  DAY.</u>\n\n     Stacy.  Nasty bruise on his cheek.  Takes a cue off the rack.\n     Chalks up.\n\n<b>                         STACY\n</b>               Straight rotation, no shit, call your\n               shot.\n\n<b>                         UNCLE JOHN\n</b>               Lemme break.\n\n     They're playing against a couple of other creeps.\n\n<b>                         CREEP\n</b>               You broke last time.\n\n<b>                         STACY\n</b>               Let him break - he likes to break.\n\n<b>                         CREEP\n</b>               Fuck you.\n\n<b>                         STACY\n</b>               I wouldn't talk.\n\n<b>                         CREEP\n</b>               Huh?\n\n<b>                         STACY\n</b>               I saw your mother on the Strip last\n               night.  She went up to three guys, said\n               she'd like 'em to stick one in each,\n               know what I mean?\n\n     Creep rushes Stacy.  But doesn't get past Uncle John.  Who\n     drops him with one punch.  Flooring him between two pool\n     tables.  Stacy then goes over.  Supports himself with a hand\n     on each table, swings his boot into the thug's face.\n\n<b>                         BARTENDER\n</b>                   (calls)\n               Stacy.\n\n     Stacy looks.  Bartender holds up phone.  Stacy goes over.\n\n                         BARTENDER (cont'd)\n               I can do without you inhibiting my\n               business.\n\n     Stacy just scowls, takes the phone.\n\n<b>                         STACY\n</b>                   (into phone)\n               Yeah.\n\n<b>     UNCLE JOHN\n</b>\n     Breaks.\n\n<b>     STACY\n</b>\n     Hangs up.  Goes back to Uncle John.  Picks up his cue again.\n\n                         STACY (cont'd)\n               We've been fired.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. VALENTINE'S HOUSE.  L.A.  DAY</u>\n\n     Someone we've never seen before and will never see again\n     stands in Valentine's driveway.  His name is FIELDING.\n\n     A car comes up.  Another guy, GRAMMS, sits in it.  He waits.\n     Eventually Fielding walks over.\n\n<b>                         GRAMMS\n</b>                   (re:  the burnt garage)\n               Valentine had himself a party, I hear.\n\n<b>                         FIELDING\n</b>                   (by rote)\n               My client has already given a statement\n               regarding yesterday's events.\n\n<b>                         GRAMMS\n</b>               A <u>statement</u>?  I wouldn't mind getting a\n               statement.  You see, <u>my</u> client -- the\n               United States Government -- would love to\n               get a statement about a few of the deals\n               going down with your client.\n\n<b>                         FIELDING\n</b>               Deals?  My client is involved in any\n               number of deals at any given moment.\n               You'd have to be more specific.\n\n<b>                         GRAMMS\n</b>               Your client have a deal in Long Beach?\n               How about downtown?  There's some folks\n               there -- oh, wait, they're all dead.  Any\n               of this ring a bell?\n\n<b>                         FIELDING\n</b>               My client is an entrepreneur.  I am his\n               lawyer, not his business manager.\n\n<b>                         GRAMMS\n</b>               So you wouldn't have any idea how your\n               client continues to make so much fucking\n               money.\n\n<b>                         FIELDING\n</b>               He's always been very forward-thinking.\n               He invested wisely.\n\n<b>                         GRAMMS\n</b>               Where is he now?\n\n<b>                         FIELDING\n</b>               He had urgent business in the north.\n\n     Gramms just laughs.  Just laughs and laughs.  And we leave him\n     laughing.  And Fielding not.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. RESTAURANT.  KITCHEN.  DAY.</u>\n\n     Ed takes off an apron, heads out the door.  It's clear that\n     he's not the head chef here -- because the HEAD CHEF, an\n     Anglo, turns, wondering where he's going.  Over this we hear:\n\n<b>                         WILSON\n</b>                   (over)\n               Where's Big Sur?\n\n<b>                         ELAINE\n</b>                   (over)\n               Up the coast.\n\n<b>                         WILSON\n</b>                   (over)\n               How far?\n\n<b>                         ELAINE\n</b>                   (over)\n               I don't know -- few hours, I guess.\n\n<b>                         WILSON\n</b>                   (over)\n               Fancy it?\n\n<b>                         ELAINE\n</b>                   (over)\n               I could use a vacation.  Of course, I\n               keep forgetting, for you this <u>is</u> a\n               vacation.\n\n<b>                         WILSON\n</b>                   (over)\n               Never thought of that.\n                   (grunt of laughter)\n               Busman's holiday.\n\n<b>                         ELAINE\n</b>                   (over)\n               What's in Big Sur?\n\n<b>                         WILSON\n</b>                   (over)\n               That's where Valentine's scarpered.\n\n<b>                         ELAINE\n</b>                   (over)\n               How do you know?\n\n<b>                         WILSON\n</b>                   (over)\n               Bloke told me.\n\n     Beat.\n\n                         WILSON (cont'd)\n                   (over)\n               You shouldn't go back to your place.  Not\n               till ... this is resolved.\n\n     Another beat.\n\n<b>                         ELAINE\n</b>                   (over)\n               I hear it's a nice drive.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. RESTAURANT.  BACK ALLEY.</u>\n\n     Ed gets into Wilson's car.  Elaine in there too.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. COAST HIGHWAY.  DAY.</u>\n\n     Wilson's rented car.  Heading for Big Sur.\n\n     <u>INT. CAR.</u>\n\n     Ed drives.  Wilson beside him.  Elaine in the back.\n\n<b>                         ED\n</b>               What d'you say, Elaine?\n\n<b>                         ELAINE\n</b>               Not much -- you?\n\n<b>                         ED\n</b>               Same.\n\n<b>                         ELAINE\n</b>               Uh-huh.\n\n<b>                         ED\n</b>               Last time I saw you, weren't you up for\n               some equity-waiver thing?\n\n<b>                         ELAINE\n</b>               Probably.\n\n<b>                         ED\n</b>               I was gonna be in that Michael Mann\n               movie, you know -- with Pacino and\n               DeNiro.  Got three callbacks.\n\n<b>                         ELAINE\n</b>               Really.\n\n<b>                         ED\n</b>               Didn't get it.\n\n<b>                         ELAINE\n</b>               Well, those are the breaks.\n\n<b>                         ED\n</b>               Not no more, they ain't.  I quit that\n               acting shit, man.\n\n<b>                         ELAINE\n</b>               You just cooking then?\n\n<b>                         ED\n</b>               Hell, no.  I started writing.\n\n     Elaine and Wilson exchange glances.\n\n     <u>EXT. HIGHWAY.  DAY.</u>\n\n     Onwards.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. BAR.  DAY.</u>\n\n     Stacy and Uncle John sit and drink.  Uncle John lamenting\n     their monetary loss.  Stacy thinking to himself.\n\n<b>                         UNCLE JOHN\n</b>               We coulda used the other two-and-a-half\n               grand.\n\n<b>                         STACY\n</b>               There's more than a measly few grand in\n               this.\n\n<b>                         UNCLE JOHN\n</b>               There is?\n\n<b>                         STACY\n</b>               Something's on.\n\n<b>                         UNCLE JOHN\n</b>               What?\n\n<b>                         STACY\n</b>               I happen to know more about Mr. Whatever-\n               his-name-is than he thinks I know about\n               him and his operation.\n\n<b>                         UNCLE JOHN\n</b>               You do?\n\n<b>                         STACY\n</b>               You bet.\n\n<b>                         UNCLE JOHN\n</b>               Like what.\n\n<b>                         STACY\n</b>               Like he'd never hire me for real.  Not\n               week-to-week.  I don't have the\n               credentials.  He thinks I'm just a\n               sociopath, someone he can turn to when he\n               needs \"plausible denial.\"\n\n<b>                         UNCLE JOHN\n</b>               Well, we blew it, didn't we?  He ain't\n               wrong.\n\n<b>                         STACY\n</b>                   (savage mimicry)\n               \"He ain't wrong.\"  Listen, I know this\n               asshole who <u>did</u> just go to work for him.\n               Full-time.  And this dickhead's parents\n               just told me he took a road trip up the\n               coast.  <u>That's</u> the type of individual gets\n               hired, someone who'll shoot his mouth off\n               to his family while on the job.\n\n<b>                         UNCLE JOHN\n</b>               I don't get it.\n\n<b>                         STACY\n</b>               I don't know who that English guy is.\n               Some kind of --\n                   (finding the word)\n               -- courier or something.  Maybe a seller.\n               Maybe a buyer.  But Mr. <u>Avery</u> wanted him,\n               those jigs wanted him -- and I betcha\n               there's a briefcase somewhere.\n\n<b>                         UNCLE JOHN\n</b>               What's in it?\n\n<b>                         STACY\n</b>                   (shrugs)\n               Drugs?  Cash?  Both if we're lucky.\n\n<b>                         UNCLE JOHN\n</b>               How we gonna get that lucky?\n\n<b>                         STACY\n</b>               While they're all fucking each other\n               over ... couple of parties like us could\n               move right in.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. HIGHWAY.  DAY.</u>\n\n     Wilson's car.\n\n     Closer to Big Sur.  Scenery more magnificent.\n\n     <u>INT. WILSON'S CAR.</u>\n\n     Ed still driving.  Wilson next to him.  Opening a new\n     cigarette pack.\n\n<b>                         ED\n</b>               I've been wondering something.\n\n<b>                         WILSON\n</b>               Again?\n\n<b>                         ED\n</b>               Do you have any friends, man?\n\n<b>                         WILSON\n</b>               Yeah, I suppose.  Call 'em that, yeah.\n               Down the boozer Saturday night.  Meet\n               some of the lads.\n\n<b>                         ELAINE\n</b>                   (a little more pointed)\n               Friends and <u>colleagues</u>.\n\n<b>                         WILSON\n</b>               You can't count on very many people,\n               that's the trouble.  Number of times a\n               decent job's been cocked up ...\n\n<b>                         ELAINE\n</b>               Poor baby.\n\n     Little back-seat sarcasm there.  Wilson looks kind of bitter.\n\n<b>                         WILSON\n</b>               Useless gits.  I was gonna do the Post\n               Office once.\n\n<b>                         ED\n</b>               What post office?\n\n<b>                         WILSON\n</b>               The lot.  The whole British bloody Post\n               Office.  I had a brilliant plan -- all\n               worked out -- work of genius, it was.\n               Could I get anybody interested?  No --\n               they're too busy pinching orange squash\n               from the milkman.  Lazy sods.  Jumble\n               sale on in Watford, they'll be up at the\n               crack of dawn.\n\n<b>                         ELAINE\n</b>               You're just on a higher plane, Wilson.\n\n<b>                         WILSON\n</b>               Too bleeding true, 'n' it.\n\n     Flicks some cigarette pack paper out the window.\n\n     <u>EXT. HIGHWAY.</u>\n\n     The car speeds along.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. HOUSE.  BIG SUR.  DAY.</u>\n\n     An impressive clifftop dwelling.  Isolated on a winding road.\n     On a beautiful promontory overlooking the sea.  Valentine\n     RINGS the DOORBELL (actually CHIME).  It's opened by his ex-\n     wife.  SUSAN.  Very well-maintained.  50-something.\n     Surprised to see him.  But not overjoyed.\n\n<b>                         VALENTINE\n</b>               Hello there.\n\n<b>                         SUSAN\n</b>               What are you doing here?\n\n<b>                         VALENTINE\n</b>               Exercising my visitation rights.\n\n<b>                         SUSAN\n</b>               Since when?\n\n<b>                         VALENTINE\n</b>               I miss my kids.\n\n<b>                         SUSAN\n</b>               They're at college.  Or doesn't your\n               accountant even tell you where the money\n               goes anymore.\n\n     Valentine goes inside.\n\n     <u>INT. HOUSE.</u>\n\n     He looks around.  She doesn't shut the door.\n\n<b>                         VALENTINE\n</b>               You've made it ... brighter.\n\n<b>                         SUSAN\n</b>               I don't want you here, Terry.\n\n<b>                         VALENTINE\n</b>               Sure you do.\n\n     He turns to look at her.  Smiles.  Somehow it doesn't work on\n     her.  One of the reasons she divorced him.  Just one.  She\n     sighs.  Resigned to his presence.  Starts to close the door.\n\n                         VALENTINE (cont'd)\n               Don't shut the door -- I have people with\n               me.\n\n     Now she gets it.\n\n<b>                         SUSAN\n</b>               What kind of trouble are you in?\n\n<b>                         VALENTINE\n</b>               No trouble.\n\n     Susan SEES Adhara get out of the sporty car parked in the\n     drive and stand against it in a posture of younger chick\n     defiance.\n\n<b>                         SUSAN\n</b>               Surely you can think of somewhere else to\n               take one of your chippies for a quick\n               getaway.\n\n<b>                         VALENTINE\n</b>               Susan.\n\n     He actually puts his hands on her arms.  To hold her firm\n     while he locks onto her eyes.  And doesn't smile.\n\n                         VALENTINE (cont'd)\n               I just need ... somewhere remote.  Away\n               from L.A.  For a couple of days.\n                   (now the kicker)\n               I pay for this house too.\n\n     Susan reads him.  He's not claiming ownership rights.  He's\n     telling her this house, because of the connection to him, is\n     a target of some kind.\n\n<b>                         SUSAN\n</b>               What have you done?\n\n     The Land Cruiser pulls up outside.  Avery emerges, comes\n     over, comes in.  Susan notes the bodyguards out there as well.\n\n<b>                         AVERY\n</b>                   (to Valentine)\n               We weren't followed.\n                   (to Susan)\n               Susan.\n\n     Valentine lets Susan go.  Knowing she's now speechless at\n     what's turned into, as far as she's concerned, a home\n     invasion.\n\n<b>                         VALENTINE\n</b>                   (moving, looking around)\n               Where's ... what's-his-name -- Fred --\n\n<b>                         SUSAN\n</b>               -- You know his name is Frank.\n\n<b>                         VALENTINE\n</b>               Is he here?\n\n<b>                         SUSAN\n</b>               You know I don't live with him.\n\n<b>                         VALENTINE\n</b>               Go to him.  Go to his studio, or writers\n               workshop or artists colony, Esselin\n               retreat, nudist camp --\n\n<b>                         SUSAN\n</b>               Are you finished?\n\n<b>                         VALENTINE\n</b>               In a couple of days this whole thing --\n\n<b>                         SUSAN\n</b>               Who's looking for you?\n\n<b>                         VALENTINE\n</b>               Go now.\n\n     Encouraging, if not in fact ushering, her towards a bedroom.\n\n<b>                         SUSAN\n</b>               It's been five minutes and I'm packing to\n               leave again.  I can't believe this.\n\n<b>                         VALENTINE\n</b>               That's right, your life is Shit, and I'm\n               to blame.  It's that simple.\n\n     That does it.  Susan turns on him.\n\n<b>                         SUSAN\n</b>               It <u>is</u> that simple.  I blame you for\n               <u>everything</u>.  Losing inhibitions and\n               chicks without bras didn't <u>have</u> to lead\n               to hardcore porno in every American\n               household:  that was <u>you</u>.  The first on\n               your block to turn on a camera in a hot\n               tub and peddle it to your friends.  A\n               little recreational pot didn't <u>inevitably</u>\n               have to lead to the eventual devastation\n               of the inner cities:  <u>you</u> made that\n               happen, the first time you bought a\n               bigger stash than you yourself meant to\n               smoke.  It happened when you made your\n               first buck hyping some so-called \"event\"\n               that was over before it began or marketed\n               some \"product\" whose only value was its\n               instant disposability.  You were the\n               first person to see there was a lot of\n               money to be made selling <u>Navajo rugs</u> --\n               you've even stolen from the fucking\n               Indians!  You looked at Charlie Manson\n               when all he had to show for himself was a\n               guitar instead of a knife and saw another\n               merry prankster, the freedom of the\n               frontier.  Your pal here --\n                   (Avery)\n               -- He saw gated communities.  Rich people\n               coming to him with their money, terrified\n               of what people like you had <u>left</u> of this\n               society.  Why invest in a marriage and\n               children when you had <u>him</u>?  <u>He's</u> your\n               oracle.  But you couldn't even trust in\n               friendship, could you?  Still he's the\n               dog you call for its dinner.  Because\n               everything that might once have been fun\n               or nice or sweet you had to turn mean and\n               cold and sour.  That was your \"genius,\"\n               Terry.  Haven't you read your own press?\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. MOTEL.  EVENING.</u>\n\n     Wilson and his friends pull in.  Get out of the car.\n     Stretch.\n\n<b>                         ELAINE\n</b>                   (finding herself at another\n                    shithole)\n               What is it, you just like the reassuring\n               smell of disinfectant?\n\n     Wilson just heads for the motel office.  Elaine and Ed follow\n     a little distance behind.\n\n<b>                         ED\n</b>               Hey, Elaine.  You even know what he's\n               saying half the time?\n\n<b>                         ELAINE\n</b>               No, but I know what he means.\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. DECK.  BIG SUR HOUSE.  NIGHT.</u>\n\n     Adhara sways in a hammock.  Staring at Valentine.  Wanting to\n     know what the hell is going on.\n\n     Valentine stands smoking at the rail, looking out over the\n     dark sea.  Ignoring Adhara.  Avery sits at a table.\n     Bodyguards visible inside the house.\n\n<b>                         VALENTINE\n</b>                   (finally, to Avery)\n               Do any of these guys cook?\n\n<b>                                                               CUT.\n</b>\n     <u>EXT. MOTEL PORCH.  EVENING.</u>\n\n     Wilson at the car.  Elaine and Ed watching.\n\n     Ed has gathered that something has developed between Wilson\n     and Elaine.  The way she's looking at Wilson.\n\n<b>                         ED\n</b>               ... Reminds me of Jennifer.\n\n<b>                         ELAINE\n</b>                   (barely perceptible nod)\n               Hard to miss.\n\n     Ed sighs.  Awkward.\n\n<b>                         ED\n</b>               I thought maybe you just came for the\n               ride.\n\n<b>                         ELAINE\n</b>               I'd rather be with him than without him.\n               I don't want to be found dead in L.A.\n\n     Wilson walks back to them.  Looking at Ed as if to say, ready\n     to go?  At her as if to say ... maybe farewell.\n\n     <u>EXT. VALENTINE HOUSE.  NIGHT.</u>\n\n     Tableau.  Evening has descended.  Surfaces glisten from a\n     light drizzling rain.\n\n     <u>INT. VALENTINE HOUSE, BEDROOM.  NIGHT.</u>\n\n     Adhara, dressing.  Behind her, outside, way out of focus, a\n     figure slithers by.\n\n     <u>INT. VALENTINE HOUSE, LIVING ROOM.  NIGHT.</u>\n\n     Valentine and Avery sit watching TV (CELEBRITY REPORT!).  Tom\n     is behind them in the kitchen, flipping through <i>Marie Claire</i>\n     magazine.\n\n<b>     VALENTINE\n</b>\n     Turns to look through the sliding glass doors.\n\n<b>     HIS POV\n</b>\n     Beyond the deck stands Larry, his back to us, facing the\n     ocean.\n\n     <u>EXT. VALENTINE HOUSE.  BACK YARD.  NIGHT.</u>\n\n     Looking toward the house, Larry in the foreground, facing us.\n     He takes a bite from a cinnamon granola bar, then looks at it\n     unhappily as he chews.\n\n<b>                         LARRY\n</b>               Fuck.\n\n     <u>EXT. VALENTINE HOUSE, ANOTHER ANGLE.  NIGHT.</u>\n\n     Looking at the house from the top of the hill.  Rick stands\n     in the driveway next to Valentine's car, smoking a cigarette.\n\n<b>     REVERSE ANGLE\n</b>\n     Wilson and Ed watching him.  Wilson nods his head to the\n     left, and Ed moves in that direction.  Wilson moves quietly\n     off to the right.\n\n     <u>INT. VALENTINE HOUSE.  LIVING ROOM.  NIGHT.</u>\n\n     Valentine and Avery, still watching TV.\n\n<b>                         VALENTINE\n</b>                   (re:  the channel)\n               Check the news.\n\n     Avery starts looking around.\n\n<b>                         AVERY\n</b>               Where's the remote?\n\n     Suddenly, we hear a CAR ALARM.  Tom looks up from his\n     magazine.  Valentine looks to Avery, who shakes his head:\n     It's nothing.\n\n     <u>EXT. BIG SUR HOUSE.  DRIVEWAY.  NIGHT.</u>\n\n     Rick turns and looks up the driveway toward the sound.  He\n     puts his cigarette out.\n\n     <u>EXT. BIG SUR HOUSE.  BACK YARD.  NIGHT.</u>\n\n     Larry has turned toward the sound as well.  Through a\n     partially obscured side entrance, he sees Rick walking up the\n     driveway.\n\n     <u>EXT. BIG SUR HOUSE.  DRIVEWAY.  NIGHT.</u>\n\n     Rick walks away from us, toward the vehicle (the Land Cruiser\n     they drove here) parked up the driveway.  We lose sight of\n     him as he crosses to the driver's side.  The alarm goes off.\n     We hold for several beats.  He doesn't emerge.\n\n     <u>INT. BIG SUR HOUSE.  LIVING ROOM.  NIGHT.</u>\n\n     Valentine and Avery are still looking for the remote.  Avery\n     stops, his attention drawn to the fact that he hasn't heard\n     anything from Larry.  He crosses to the window.\n\n<b>     HIS POV\n</b>\n     The driveway, car at the top partially visible.  No sign of\n     Rick.\n\n<b>     AVERY\n</b>\n     His brow furrows.\n\n<b>     VALENTINE\n</b>\n     Notices this, looks out toward the backyard.\n\n<b>     HIS POV\n</b>\n     Same as before, except Larry isn't there.\n\n<b>     VALENTINE\n</b>\n     Moves to the sliding glass door to get a better look at the\n     deck and back yard.  Still no Larry.\n\n<b>                         VALENTINE\n</b>               Where's Larry?\n\n<b>     AVERY\n</b>\n     Leaves the window and moves to Valentine.  Tom has joined\n     them.  After a beat:\n\n<b>                         AVERY\n</b>               Turn all the lights out.  I'll get Adhara.\n\n     Tom begins looking for the light switches.\n\n<b>                         VALENTINE\n</b>               What's happening?\n\n     Avery is already heading for the bedroom.\n\n<b>                         AVERY\n</b>               Stay away from the windows.\n\n     <u>EXT. BIG SUR HOUSE.  BACK YARD.  NIGHT.</u>\n\n     Tableau.  Avery exits the kitchen and takes the surrounding\n     porch to the bedroom.  Are we seeing this from someone's POV?\n\n     <u>INT. BIG SUR HOUSE.  BEDROOM.  NIGHT.</u>\n\n     Adhara, finished dressing, looking at herself in the mirror.\n     The lights behind her go off.  She turns to see Avery coming\n     toward her to turn off the lights by the mirror.\n\n<b>                         ADHARA\n</b>               Uh, you've heard of knocking?\n\n<b>                         AVERY\n</b>               I need you to come with me.\n\n<b>                         ADHARA\n</b>               Why, what --\n\n     He takes her by the arm.  Firmly, but not roughly.\n\n<b>                         AVERY\n</b>               Please.\n\n     She sees in his expression that something is up.\n\n<b>                         ADHARA\n</b>               Okay.\n\n     <u>INT. BIG SUR HOUSE.  LIVING ROOM.  NIGHT.</u>\n\n     Tom and Valentine have finally found the light switches, and\n     the room is dark.  Valentine moves slowly to the window,\n     takes a tentative peek.\n\n<b>     HIS POV\n</b>\n     The driveway.  Hard to see.  Is there something moving out by\n     the shed?\n\n<b>                         AVERY\n</b>                   (off)\n               I thought I said stay away from the\n               window.\n\n<b>     AVERY\n</b>\n     Entering the kitchen with Adhara in tow.  He brings her\n     around behind the counter.\n\n<b>                         AVERY\n</b>               Everybody in the kitchen.\n\n     Valentine and Tom move to join Avery and Adhara.\n\n<b>                         AVERY\n</b>               Behind the counter.\n\n     Everyone moves behind the large counter in the center of the\n     kitchen and crouches down.  They have a wall behind them and\n     all the windows in front of them.\n\n<b>                         ADHARA\n</b>                   (scared)\n               What's going on?\n\n     Avery and Tom have drawn their guns.\n\n<b>                         VALENTINE\n</b>               We think someone is here.\n\n<b>                         ADHARA\n</b>               We think?\n\n<b>                         VALENTINE\n</b>               We can't find ...\n                   (what are their names?)\n               ... two of our guys.\n\n<b>                         TOM\n</b>                   (fucking typical)\n               Larry and Rick.\n\n<b>                         ADHARA\n</b>               Did somebody call the cops?\n\n     Tom snorts.  Avery looks at Valentine:  Haven't you told this\n     girl anything?\n\n<b>                         VALENTINE\n</b>               No.\n\n<b>                         ADHARA\n</b>               Why not?\n\n<b>                         VALENTINE\n</b>               Because --\n\n<b>                         AVERY\n</b>               Because I'm taking care of it.\n\n<b>                         ADHARA\n</b>               You guys are fucking nuts, I'm calling --\n\n     She starts to stand.  Valentine pulls her down.\n\n<b>                         ADHARA\n</b>               Hey.\n\n<b>                         TOM\n</b>               Mr. Avery.\n\n     Avery looks to Tom, who nods toward the back porch.\n\n<b>     THEIR POV\n</b>\n     A silhouetted figure is tentatively making its way along the\n     porch, trying not to be seen.  We don't get a very clear\n     glimpse.\n\n<b>     AVERY\n</b>\n     Draws his gun and takes aim.\n\n<b>     THE FIGURE\n</b>\n     Careful not to become fully visible, but growing more\n     courageous with each step.\n\n<b>     AVERY\n</b>\n     Locked on him, waiting.\n\n<b>     VALENTINE\n</b>\n     Puts Adhara's hand to her ears.\n\n<b>     THE FIGURE\n</b>\n     We see a little more now than we have before.\n\n<b>     AVERY\n</b>\n     He sees enough.  Squeezes off a series of SHOTS, the muzzle\n     flash strobing the kitchen area like a flashbulb, Adhara and\n     Valentine flinching.\n\n<b>     THE FIGURE\n</b>\n     Hit.  Spinning and collapsing to the ground.\n\n<b>     AVERY\n</b>\n     Lowers his gun.  Turns to Tom.\n\n<b>                         AVERY\n</b>               Watch my back.\n\n     Avery moves out from behind the counter and heads for the\n     body.\n\n     <u>EXT. BIG SUR HOUSE.  BACK PORCH.  NIGHT.</u>\n\n     Avery makes his way to the figure, which is on its stomach\n     and writhing slightly.\n\n<b>     AVERY\n</b>\n     Careful.  Takes the gun and turns the body over.\n\n<b>     STACY\n</b>\n     Stares up at him, choking on his last few breaths.\n\n<b>     AVERY\n</b>\n     Puzzled.  What the hell is this guy doing here?  He starts\n     feeling around Stacy's jacket for anything useful, but is\n     interrupted when his hand EXPLODES, accompanied by the sound\n     of a gunshot.  He screams in pain.\n\n     <u>INT. BIG SUR HOUSE.  KITCHEN.  NIGHT.</u>\n\n     Valentine and Adhara drop to the floor.  Tom, gun raised and\n     pointing, tries to see who shot Avery.\n\n     <u>EXT. BIG SUR HOUSE.  BACK PORCH.  NIGHT.</u>\n\n     Avery is turning toward his assailant, but not fast enough.\n     A shot rings out and part of his neck disappears in a blossom\n     of blood.  Stunned, he falls on his side, gasping.\n\n<b>     AVERY'S POV\n</b>\n     Uncle John.  Close by, huddled by the lip of the cliff.  He\n     starts to move cautiously toward Avery and Stacy.\n\n     <u>INT. BIG SUR HOUSE.  KITCHEN.  NIGHT.</u>\n\n     Tom squints, trying to see.\n\n<b>                         TOM\n</b>               Fuck.\n\n<b>                         VALENTINE\n</b>               What?\n\n<b>                         TOM\n</b>               Avery's down.\n\n<b>     TOM'S POV\n</b>\n     A piece of Uncle John's silhouette appears.\n\n<b>     TOM\n</b>\n     Fires at it.  Didn't hit anything.\n\n<b>                         TOM\n</b>               Fuck this.\n\n     Tom jumps up and runs for the living room, firing his gun in\n     front of him toward where he last saw Uncle John's\n     silhouette.\n\n<b>     LIVING AREA\n</b>\n     Tom runs through and reaches the sliding doors to the back\n     porch.  A portion of the frame SPLINTERS from a gun shot as\n     he gains access to the other side of the back porch.\n\n     <u>EXT. BIG SUR HOUSE.  BACK PORCH.  NIGHT.</u>\n\n     Tom is through the sliding doors and trying to make his way\n     around to the driveway.\n\n<b>     UNCLE JOHN\n</b>\n     Crouched behind the opposite end of the porch, sticks his\n     head up.\n\n<b>     HIS POV\n</b>\n     Tom crossing to the steps, slips on the damp wood, tries to\n     right himself.\n\n<b>     UNCLE JOHN\n</b>\n     Squeezes off two shots.\n\n<b>     TOM\n</b>\n     Is shot in the ankle as he is about to reach the steps.  He\n     yelps in pain, tries to raise his gun.\n\n<b>     UNCLE JOHN\n</b>\n     Crouched down.  A shot flies over his head.\n\n<b>     TOM\n</b>\n     Stops shooting.  Tries dragging his shattered ankle to the\n     steps.\n\n<b>     UNCLE JOHN\n</b>\n     Looks over the edge of the porch.\n\n<b>     HIS POV\n</b>\n     Tom turning toward the steps.\n\n<b>     UNCLE JOHN\n</b>\n     Fires at him.\n\n<b>     TOM\n</b>\n     Screams again as his elbow of his gun hand disintegrates.  He\n     slips on the first step and tumbles down, the gun bouncing\n     beside him.\n\n<b>     UNCLE JOHN\n</b>\n     Sees this.  Stands up to cross the back porch.  Takes a step\n     forward but is stopped by a bullet in the chest (about the\n     only clean shot anybody makes).  He looks down at himself.\n\n<b>                         UNCLE JOHN\n</b>               Shit.\n\n     He looks up to SEE:\n\n<b>     AVERY\n</b>\n     Near death.  Gun in his good hand.  He squeezes the trigger\n     again.\n\n<b>     UNCLE JOHN\n</b>\n     A small black hole appears in his cheek.  He blinks, begins\n     to raise his hand to his face, and collapses.\n\n<b>     AVERY\n</b>\n     Exhales and rolls over.\n\n<b>     TOM\n</b>\n     Still trying to get to his feet.  He gives up and just lies\n     there, panting.\n\n<b>     A HAND\n</b>\n     Reaches for the gun beside Tom.  Tilt up with it to reveal:\n\n<b>     ED\n</b>\n     He puts the gun in his jacket and slides away.\n\n     <u>INT. BIG SUR HOUSE.  KITCHEN.  NIGHT.</u>\n\n     Valentine and Adhara are still stuck behind the counter.\n     Valentine sees the shadowy shape of Ed slipping behind the\n     back porch.\n\n<b>     VALENTINE\n</b>\n     Decides to make a run for it, following Tom's route, away\n     from Ed.\n\n<b>                         ADHARA\n</b>               Where are you going?\n\n<b>     LIVING ROOM\n</b>\n     Valentine runs to the sliding door, smack into:\n\n<b>     WILSON\n</b>\n     Standing there.  Wet.  Mad.  He grabs Valentine by the shirt\n     and pushes him back into the room.\n\n<b>     VALENTINE\n</b>\n     Bounces off the couch and onto the floor.\n\n<b>     WILSON\n</b>\n     Comes toward him.\n\n<b>     VALENTINE\n</b>\n     Grabs a lamp off an end table and hurls it at Wilson.  It\n     careens off Wilson's arm and shatters.\n\n<b>     WILSON\n</b>\n     Is almost on him now.\n\n<b>     VALENTINE\n</b>\n     Tries to scramble away.  Throwing anything he can get his\n     hands on at.\n\n<b>     WILSON\n</b>\n     Who keeps coming.  He grabs Valentine, pulls him up, then\n     throws him into the television.\n\n<b>     VALENTINE\n</b>\n     Crashes into the TV face first and bounces to the floor.\n\n<b>     WILSON\n</b>\n     Goes to him, grabs him by the neck with one hand and pulls\n     out his gun with the other.  He seems about to speak when\n     suddenly he screams instead.\n\n<b>                         WILSON\n</b><b>               AAAAGGGGHHHH!\n</b>\n<b>     ADHARA\n</b>\n     Has just stuck a kitchen knife into Wilson's back.\n\n<b>     WILSON\n</b>\n     Turns instinctively and whips the pistol around, smashing\n     Adhara in the mouth.\n\n<b>     ADHARA\n</b>\n     Hits the ground.  She won't be retaliating.\n\n<b>     WILSON\n</b>\n     In agony, spinning, trying to reach the knife in his back,\n     but IT'S JUST BEYOND HIS REACH.\n\n<b>     VALENTINE\n</b>\n     Scrambles through the sliding glass door.\n\n     <u>EXT. BIG SUR HOUSE.  BACK PORCH.  NIGHT.</u>\n\n     Valentine stumbles out.  Notices Avery slumped on the deck,\n     mortally wounded.  Goes to him -- as if concerned -- but\n     actually just to take the gun.  Then runs off the porch\n     toward the STEPS that lead down to the sea.\n\n<b>     WILSON\n</b>\n     Comes out after him, the knife still in his back.  So intent\n     on catching Valentine he fails at first to notice Avery lying\n     in the shadows.\n\n<b>     AVERY\n</b>\n     Has just barely managed to reach Stacy's pistol.  Raises it\n     weakly.  Points it at Wilson.\n\n<b>     WILSON\n</b>\n     Seems to feel it.  Turns.  Locks eyes with Avery.  Avery\n     could already have shot him.  But there's a momentary sense of\n     recognition:  both of them just foot soldiers for fat cats --\n     and Avery's is not worth saving.\n\n<b>     AVERY\n</b>\n     Lowers the gun.  Nods in the direction Valentine went.\n\n<b>                         AVERY\n</b>               ... that way ...\n\n     Wilson moves on.  Avery just lies there, presumably to die.\n\n     <u>EXT. BIG SUR HOUSE.  STEPS.  NIGHT.</u>\n\n     Valentine hurries down the rickety steps.  Trying not to slip\n     in the darkness, though there are tiny Malibu lights\n     illuminating the steep and winding wooden framework.\n\n     <u>EXT. BEACH.  NIGHT.</u>\n\n     A rocky cove.  Valentine looks back up the way he came,\n     HEARING the FOOTSTEPS coming down after him.  Backs away a\n     few paces on the slippery rocks.  Falls.\n\n     Lands on the crumpled, dead body of LARRY, the bodyguard, who\n     was thrown off the cliff.  Valentine recoils.  When Wilson\n     appears, Valentine FIRES at him.  A wild shot that only makes\n     Wilson duck momentarily.  Valentine scrambles to his feet,\n     runs on.\n\n<b>     WILSON\n</b>\n     Jumps down from the steps.  Stops for a moment and leans his\n     back against the railing.  Bends at the knees slightly.\n\n<b>     THE KNIFE\n</b>\n     The handle is forced upward just enough to be reachable now.\n\n<b>     WILSON\n</b>\n     Grimacing, pulls the knife out and discards it.\n\n<b>     FURTHER DOWN THE BEACH\n</b>\n     Valentine runs.  Or tries to.  It's dark and the ground is\n     treacherous.  The beach runs out pretty soon.  Now just\n     rocks.  Maybe he thought he could get around the rocks on the\n     point at the other end.  But he can't see very far ahead.\n     And the tide is in, water making any escape extremely\n     difficult.  He tries to scramble over some rocks.  They're\n     wet, slippery.  He falls, cries out as he literally breaks an\n     ankle.\n\n<b>     WILSON\n</b>\n     A dark figure.  Coming into focus.  Walking inexorably this\n     way.\n\n<b>     VALENTINE\n</b>\n     Painfully rights himself.  A small bone protrudes from his\n     broken ankle.  He FIRES at Wilson, gun in one hand, other\n     hand gripping his wrist to try and steady it.  Doing his best\n     to aim.  But the SHOTS miss their mark.\n\n<b>     WILSON\n</b>\n     Steadily coming.\n\n<b>     VALENTINE\n</b>\n     Out of bullets now.  Gun CLICKING crazily on empty.  He\n     simply drops it.\n\n<b>     WILSON\n</b>\n     Now stands before him.\n\n<b>     THE TWO OF THEM\n</b>\n     Both breathing hard.\n\n<b>                         WILSON\n</b>               Tell me.\n\n     This is not what Valentine expected.\n\n<b>                         VALENTINE\n</b>               What.\n\n<b>                         WILSON\n</b>               Tell me.\n\n<b>                         VALENTINE\n</b>               Tell you ...\n\n<b>                         WILSON\n</b>               About Jenny.\n                   (closer)\n               Tell me about Jenny.\n                   (closer)\n               About the <u>deal</u>.  Whatever fucking deal\n               you had to kill my daughter for when she\n               found out about it, you bastard.\n\n     Wilson drops to the ground too, in a passionate fury, starts\n     strangling Valentine.\n\n<b>                         WILSON\n</b>               Tell me.  Tell me about it, you fucking\n               bastard.\n\n     Easing up just enough for Valentine to sputter out a\n     response.\n\n<b>                         VALENTINE\n</b>               She could've had the deal!  I would've\n               handed it to her if she wanted.  I would\n               have given her everything.\n\n<b>                         WILSON\n</b>               <u>Why</u> then.  Why did you do it!\n\n     They're locked in a kind of embrace.  Sprayed by the waves\n     crashing into the rocks.  Sweating and gasping and exhausted\n     and hurt and furious.\n\n<b>                         VALENTINE\n</b>               She didn't want to share it, she wanted\n               to stop it.  To stop me.  <u>She said she'd</u>\n               <u>turn me in</u>.\n\n<b>     WILSON\n</b>\n     Shock of recognition on his face.  At those words.\n\n<b>                         VALENTINE\n</b>               She said, \"You go ahead with this, I'll\n               turn you in, Terry.\"\n\n     Wilson sits back.  Panting.  Totally spent.  The two of them.\n     Both on the ground now.  Whatever energy they had left drained\n     -- Valentine from his confession, Wilson from hearing it.\n     Valentine shaking, sobbing.  Still not realizing the pathetic\n     folly of his actions.\n\n<b>                         VALENTINE\n</b>               She was serious.  She would have done it.\n               She had the phone in her hand.  She was\n               going to do it.\n\n<b>     WILSON\n</b>\n     Knows that the girl he loved ... loved Valentine, too.  Having\n     heard the truth, the last vestige of revenge has vanished.\n     He gets up and walks away.  Leaving the quivering shell of\n     Valentine behind.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. BIG SUR HOUSE.  LIVING ROOM.  NIGHT.</u>\n\n     Adhara wakes up.  Hand to her smashed cheek and mouth.  But\n     it's not her hand.  It's Valentine's.  She sort of shuffles\n     away from him along the floor.  Sits against a wall holding\n     her face.  Valentine sits back against an opposite wall.\n     They stare at each other.\n\n<b>                                                               CUT.\n</b>\n     <u>INT. PLANE.  DAY.</u>\n\n     Wilson, lost in thought.  Accepts a drink from a FLIGHT\n     ATTENDANT.  We can see it pains him to reach for it.\n\n<b>                         WILSON\n</b>               Ta.\n\n     After setting the glass down, his other hand goes to the\n     shoulder where his stab wound was no doubt only temporarily\n     dealt with.\n\n     <i>FLASH CUTS:\n\n     WILSON. At the roadside hotel, grimacing.\n\n     ELAINE. Cleaning his wound.</i>\n\n     Wilson rubs his shoulder.  The AMERICAN LADY in the seat\n     beside him heard the way he said thanks to the Flight\n     Attendant.\n\n<b>                         LADY\n</b>               You're English.\n\n     A small beat (which he takes each time he responds).\n\n<b>                         WILSON\n</b>               Yeah, that's right.\n\n<b>                         LADY\n</b>               I can never decide what I like better.\n               Leaving home, or coming back.\n\n<b>     WILSON\n</b>\n     Takes this in.\n\n     <i>FLASH CUTS:\n\n     WILSON. Shaving in the mirror at his L.A. motel. He stops.\n\n     WILSON. In the car leaving Valentine's house. Fingering the\n     picture of Jenny.</i>\n\n<b>                         WILSON\n</b>               I would have preferred staying home, me.\n\n<b>                         LADY\n</b>               You're a reluctant traveller, then.\n\n     Wilson nods.\n\n     <i>FLASH CUTS:\n\n     WILSON. In the car with Elaine and Ed, driving back from Big\n     Sur. Everyone in their own world.\n\n     WILSON. At Ed's house. Saying goodbye.\n\n     WILSON AND ED. Shake hands.\n\n     ED. Watching him get into Elaine's car.</i>\n\n<b>                         WILSON\n</b>               Got called out to L.A., unexpected like,\n               to do a job of work.\n\n     <i>FLASH CUTS:\n\n     WILSON. At the airport, staring at Elaine.\n\n     ELAINE. Staring back.\n\n     WILSON AND ELAINE. She embraces him.\n\n     ELAINE. She watches him leave.\n\n     WILSON. Disappearing into the terminal.</i>\n\n<b>                         LADY\n</b>               You'll be looking forward to getting\n               back, then.\n\n<b>                         WILSON\n</b>               Yeah.  Another little matter needs\n               attending to soon as I return.\n\n<b>                         LADY\n</b>               No rest for the wicked.\n\n     Wilson nods, exhales.\n\n     <i>FLASH CUT:\n\n     WILSON. In the cab on the way to Ed's, at the beginning of\n     the film. Watching the lights go by.</i>\n\n<b>                         WILSON\n</b>               Been away a lot.\n\n<b>                         LADY\n</b>               Where else?\n\n     Longer beat.  He actually turns to look at her now.  Takes\n     her in, then looks forward again.\n\n<b>                         WILSON\n</b>               Out on a oil rig.  In the North Sea.\n               Nine years.\n\n<b>                         LADY\n</b>               Nine years?\n                   (laughs)\n               Is that legal?\n\n<b>                         WILSON\n</b>               Well, time off for good behavior, you\n               know.  I shouldn't have even been there\n               -- it was these other blokes who shoulda\n               gone in my place.  I got lumbered with\n               the job they were responsible for.  I\n               don't mind pulling me own cart, but not\n               someone else's, know what I mean.\n\n<b>                         LADY\n</b>               But you stuck it out, anyway, all that\n               time.\n\n<b>                         WILSON\n</b>               I had to, didn't I.  Nothing else for it.\n               Then just when I'd finished my nine years\n               -- my contract -- wallop, I had to bugger\n               off to the States.\n\n<b>                         LADY\n</b>                   (reacting slightly to his\n                    \"colorful\" language)\n               Sounds like you need a rest.\n\n<b>                         WILSON\n</b>               Could do, yeah.\n\n     Another beat.\n\n<b>                         WILSON\n</b>               But first I gotta give these lads a\n               talking to, these geezers what sent me up\n               the river, in a manner of speaking.\n\n<b>                         LADY\n</b>               The ones whose burden you took upon your\n               own shoulders.\n\n<b>                         WILSON\n</b>               Yeah.\n\n     And he turns away, to the window.  Looks at the blue sky.\n     Sips his drink.  Then, hard:\n\n<b>                         WILSON\n</b>               Them next.\n\n<b>                                                     CUT TO BLACK.\n</b>\n<b>     THE END.\n</b>\n\n\n\n\n   </pre>\n\n\n\n<b></b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Limey, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Lem Dobbs\" title=\"Scripts by Lem Dobbs\">Lem Dobbs</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Limey, The Script.html#comments\" title=\"Limey, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:09:54.380735"}