{"title": "Lord of Illusions", "film_link": "/Movie Scripts/Lord of Illusions Script.html", "script_link": "/scripts/Lord-of-Illusions.html", "info_raw": "\n\nLord of Illusions Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Clive Barker\nGenres  Fantasy  Horror  Thriller\nScript Date : February 1994\n\nRead \"Lord of Illusions\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\"Lord of Illusions\" -- by Clive Barker\n\n\n\n\tTITLE SEQUENCE\n\n\n\tAs the credits run, we INTERCUT the following two sequences:\n\n\n\tEXT. NEVADA DESERT - IDOLS - DAY\n\n\n\tA SLOW DRIFT through a collection of crudely constructed,\n\tsurreal, six-foot tall \"IDOLS.\"  Like modern demons. \n\tGrotesque.  Disturbing. WE LAP DISSOLVE between details of\n\ttheir twisted anatomies:  headlamp eyes, bright metal claws,\n\tbroken glass teeth.\n\n\tEXT. NEVADA ROADS - DESERT - DAY\n\n\tTwo vehicles, one a Volkswagen \"bus\" decorated with stylized\n\tflames, the other a '66 Thunderbird, speeding along a series\n\tof eerily empty desert roads, somewhere in a wilderness of\n\tsand and heat.\n\n\tEND CREDITS.\n\n\t\t\t\tCUT WIDE TO;\n\n\tEXT. NEVADA DESERT - DAY\n\n\tA violent WIND HOWLS around, but through the sand we-can just\n\tmake out a large, ominous building:  the HOUSE of William\n\tNix.  Its walls are white-washed and scrawled with GRAFFITI. \n\tThe \"family\" of IDOLS surrounds the doorway, guarding it. ON\n\tSCREEN, the words:  '\"Nevada - Thirteen Years Ago\"\n\n\tEXT. NIX'S HOUSE - DAY\n\n\tWe're at the front door now, which stands open.  Leaning\n\tagainst the door-frame is a scrawny, wild-eyed YOUTH, about\n\tsixteen.  His name is BUTTERFIELD.  He's got a brooding,\n\talmost sultry look on his face.  One of his eyes is black,\n\tthe other milky blue.  He's whittling something with a\n\tscalpel. Distantly, the sound of CAR ENGINES.  Butterfield\n\tnarrows his eyes.\n\n\tBUTTERFIELD'S P.O.V.\n\n\tThe Volkswagen \"bus\" and Thunderbird are approaching the\n\thouse.\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(softly)\n\t\tSwann...?\n\n\tHe turns from the door.  In his haste he drops the WOOD he's\n\twhittling.  He's been carving a DEATH'S HEAD.\n\n\tINT. NIX'S HOUSE - ROOMS AND CORRIDORS - DAY\n\n\tThe house no longer serves any domestic function.  It has\n\tbecome the temple and dormitory of Nix's small apocalyptic\n\tcult.  As we go through the house with Butterfield we glimpse\n\ta little of what life here is like. \n\n\tThe rooms are murky, and chaotic.  The walls, PAINTED with\n\tscenes of cities and landscapes BURNING, and creatures from\n\tsome unspeakable nightmare ATTACKING, RAPING, and DEVOURING\n\thelpless humanity.  The atmosphere is joyless, and\n\toppressive. \n\n\tThe passages become progressively darker as the boy makes his\n\tway to the heart of the house.  Only OIL LAMPS, set on the\n\tfloor, light these claustrophobic corridors.\n\n\t\t\t\tBUTTERFIELD\n\t\tMaster?\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - DAY\n\n\tA dozen CULTISTS sit cross-legged on the floor in front of\n\ttheir leader, WILLIAM NIX.  His black hair grows to his\n\tshoulders.  His eyes are deep and glittering, his voice\n\tseductive.  A terrifying yet charismatic presence. \n\n\tAll the Cultists - who are a cross-section of obsessives -\n\twear the same simple T-shirts, painted with the cult's SIGIL. \n\tThey watch Nix in adoration. \n\n\tAs Nix speaks, he juggles a FLAME, passing it from hand to\n\thand with casual ease...\n\n\t\t\t\tNIX\n\t\tAnd the fire said to me:  Nix, Nix,\n\t\tyou're my instrument. From now on,\n\t\tyou'll be called the Puritan...\n\n\t\t\t\tCULTISTS\n\t\t\t(murmuring)\n\t\tPuritan...\n\n\tNIX You will find a few good men and women, and together,\n\ttogether you will cleanse the world.\n\n\t\t\t\tCULTISTS\n\t\tYes...\n\n\tButterfield enters. \n\n\t\t\t\tBUTTERFIELD\n\t\tMaster?\n\n\tNix looks up.\n\n\t\t\t\tBUTTERFIELD\n\t\tSwann's here. \n\n\tNix rises, smiling.\n\n\t\t\t\tNIX\n\t\t\t(to Cultists)\n\t\tWe'll come back to this. Get about\n\t\tyour business. \n\n\tAs the Cultists disperse, Nix and Butterfield exit into\n\n\tINT. NIX'S HOUSE - SANCTUM - DAY\n\n\tA place of nightmares. Hanging from the middle of the ceiling\n\tis another grotesque SCULPTURE, three times the bulk of a\n\tlarge man, and made of metal, fly-blown animal parts and\n\tknotted rope.  It is vaguely cruciform, but its swaying,\n\tcreaking bulk is not even faintly Christian.  It is a\n\tperverse, sickening image, evoking insanity and agony.\n\n\tFrom the shadows in the corner, we hear a young girl's soft\n\tSOBBING.\n\n\t\t\t\tNIX\n\t\tHush...\n\n\tNix goes to the GIRL.  She is twelve; beautiful, blonde, and\n\tpresently in a state of mortal fear.  She sits, bound, in a\n\tfetal position, her face soaked with SWEAT and TEARS, her\n\tmouth BLOODIED, her cheek BRUISED.\n\n\t\t\t\tNIX\n\t\tI said hush.\n\n\t\t\t\tGIRL\n\t\tPlease.  Let me go.\n\n\tFrom the opposite corner the SCREECH of Nix's pet BABOON. \n\tNix goes to it.  The animal is large and lethal.\n\n\t\t\t\tNIX\n\t\t\t(to Baboon)\n\t\tWhat is it?\n\n\tThe Baboon pulls on its chain, staring at the Girl and baring\n\tits teeth as it screeches.\n\n\t\t\t\tNIX\n\t\t\t(to Girl)\n\t\tI think he's in love.\n\n\tHe unshackles the Baboon.  The animal pads toward the Girl,\n\ttrailing its chain.\n\n\t\t\t\tGIRL\n\t\tKeep it away from me.\n\n\tNix catches hold of its chain.  Holds it back.  The Baboon\n\tstarts screeching again, scrabbling at the Girl, its NAILS\n\tcatching her arms and legs, drawing BLOOD.\n\n\t\t\t\tGIRL\n\t\tPlease... please...\n\n\tNix watches her terror dispassionately.\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(also watching, wide-\n\t\teyed)\n\t\tWant me to shoot Swann?\n\n\t\t\t\tNIX\n\t\tYou don't like him, do you?\n\n\t\t\t\tBUTTERFIELD\n\t\tHe wants your magic.\n\n\t\t\t\tNIX\n\t\tMaybe.  Go fetch him.\n\n\tButterfield exits.  Nix advances on the Girl.\n\n\t\t\t\tGIRL\n\t\tWhat are you going to do?\n\n\t\t\t\tCUT TO:\n\n\tEXT. NIX'S HOUSE - DESERT - DAY\n\n\tThe two vehicles come to a halt outside Nix's house.\n\n\tFrom the Thunderbird steps PHILIP SWANN, a nineteen- year-old\n\twith shoulder-length hair and brilliant blue eyes.  He's not\n\tconventionally handsome, but he's certainly striking. \n\n\tFrom the passenger seat steps CASPAR QUAID, a black man,\n\tstudious and intense.  From the bus emerges MURRAY PIMM,\n\tskinny and jittery, and JENNIFER DESIDERIO, a woman with a\n\tsteely gaze.\n\n\t\t\t\tSWANN\n\t\t\t(to all three)\n\t\tAre we ready?\n\n\t\t\t\tJENNIFER\n\t\t\t(cool)\n\t\tSay the word.\n\n\t\t\t\tPIMM\n\t\t\t(very nervous)\n\t\tLook, maybe we should think this over.\n\n\tOn Swann, as he brings from his car three very bizarre pieces\n\tof METALWORK.  We get only a tantalizing glimpse of them, as\n\the slips them into his pocket.\n\n\t\t\t\tSWANN\n\t\tNo.  He's gone too far.\n\n\t\t\t\tPIMM\n\t\tSo he took a child.\n\n\t\t\t\tJENNIFER\n\t\tHe'll kill her.\n\n\t\t\t\tPIMM\n\t\tNo he won't.\n\n\t\t\t\tSWANN\n\t\t\t(determined)\n\t\tHe's not going to get the chance.\n\n\tQuaid checks a gun, then slips it into his belt.\n\n\t\t\t\tQUAID\n\t\tIf he gets in our fucking heads he'll drive us crazy.\n\n\t\t\t\tSWANN\n\t\tSo stay out here.\n\n\tSwann starts towards the House.  Jennifer is the first to\n\tfollow, with the other two on her heels.\n\n\tINT. NIX'S HOUSE - HALLWAY - DAY\n\n\tButterfield comes to the door, as Swann steps inside.\n\n\t\t\t\tBUTTERFIELD\n\t\tHe's expecting you.\n\n\tBehind Swann, Quaid and Pimm exchange nervous looks.\n\n\t\t\t\tSWANN\n\t\t\t(to others)\n\t\tLook around.  If you find 'the\n\t\tchild, yell.  She's got blonde\n\t\thair, that's all I know.\n\n\tButterfield turns away, smiling to himself.  Swann follows\n\thim.\n\n\tINT. NIX'S HOUSE - \"MEDITATION\" ROOM - DAY\n\n\tQuaid looks into a large circular room where FIVE CULTISTS\n\t(three men and two women) still sit.  One of the women is\n\tbreast-feeding a baby.\n\n\t\t\t\t1ST MAN\n\t\tHey, Quaid.  I thought you said you\n\t\tweren't coming back.\n\n\t\t\t\tQUAID\n\t\tI changed my mind.\n\n\t\t\t\t1ST WOMAN\n\t\tCome and join us.\n\n\tShe smiles a crazy smile.  Reaches out for Quaid.  A SNAKE\n\tappears from around the back of her neck.  Quaid recoils. \n\n\tAnd now we see that there are snakes everywhere.  In the\n\tCultists' clothes and hair.  Even on the baby.  Quaid turns\n\taway.  And - shock! - there's a SNAKE on the door frame,\n\twinding around his hand.  He strikes it to the ground, and\n\tdrives his heel down on its head.\n\n\t\t\t\tSNAKE-HANDLER CULTIST\n\t\t\t(angry)\n\t\tDon't do that!\n\n\tThe Snake-Handler gets up.  Quaid retreats from the door. \n\tSnake-Handler picks up the dead snake and, lifting it above\n\this head, dribbles its BLOOD onto his face.\n\n\tINT.   NIX'S  HOUSE  -   \"BEDROOM\"   -  DAY\n\n\tJennifer enters a gloomy room.  She goes to a mattress where\n\ta BLONDE GIRL lies with her bare back to us.\n\n\t\t\t\tJENNIFER\n\t\tDon't be afraid.\n\n\tThe Blonde Girl, BARBARA, turns over.  She has a dirty cloth\n\tpressed to a wound between her breasts.  It is not the Girl,\n\tof course.  She stares up at Jennifer, clearly drugged.\n\n\t\t\t\tBARBARA\n\t\tI'm not... want to see?\n\n\tShe pulls the cloth away.  She has carved the cult SIGIL into\n\ther FLESH.  The BLOODY KNIFE lies beside her. Jennifer\n\tretreats to the door, and exits back out into --\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - DAY\n\n\tPimm is standing against the wall, clutching a CRUCIFIX. He\n\tis ashen with terror.  Jennifer snatches the crucifix from\n\this white-knuckled fingers.\n\n\t\t\t\tPIMM\n\t\tHe's going to kill us all...\n\n\t\t\t\tJENNIFER\n\t\tWhere did Swann go?\n\n\tPimm points down the passageway towards Nix's room.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY OUTSIDE NIX'S SANCTUM - DAY\n\n\tSwann wipes sweat from his upper lip, then reaches down to\n\this belt, to check the GUN tucked out of sight at his side. \n\tHe turns the door handle.\n\n\tINT. NIX'S HOUSE - SANCTUM - DAY\n\n\tSwann steps inside.  Nix's chair has its back to him. The\n\tfolds of Nix's robe are visible, however.  Swann hears a\n\tmuffled SOBBING from the far side of the room. \n\n\tOn the Girl, now gagged and lying amongst bones and filth.\n\n\tSwann starts towards her, his footsteps barely audible.  As\n\the approaches the chair - the Baboon leaps at him screeching!\n\n\tHe reaches for his gun.  The chair topples.  The Baboon, half\n\tdressed in Nix's robes, bounds towards Swann. \n\n\tSwann FIRES at it.  The bullet blasts off half its head.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - DAY\n\n\tOn Quaid, who draws his GUN as three CULTISTS appear in the\n\tpassageway that leads to Nix's Sanctum.\n\n\t\t\t\tQUAID\n\t\tStay the fuck away!\n\t\t\t(yells)\n\t\tPimm!  Get over here!\n\n\tINT. NIX'S HOUSE - SANCTUM - DAY\n\n\tPAN UP from the twitching Baboon corpse to Swann as he\n\tstruggles with the Girl's gag.  He has laid his gun on the\n\tground beside her.\n\n\t\t\t\tSWANN\n\t\tYou're going to be okay.\n\n\tOut of focus, behind him, the cruciform sculpture swings\n\tround.  Nix is hanging on it, like an idol on a grotesque\n\taltarpiece. \n\n\tThe Girl sees Nix over Swann's shoulder.  Terror crosses her\n\tface.  Swann turns.\n\n\t\t\t\tNIX\n\t\tI knew you'd come. \n\n\tHe reaches down to Swann.\n\n\t\t\t\tNIX\n\t\tI've got so much power to give\n\t\tyou, Swann.  All you have to do\n\t\tis...beg.\n\n\t\t\t\tSWANN\n\t\tFuck you.\n\n\t\t\t\tNIX\n\t\tYou don't think I've got it to\n\t\tgive?\n\n\t\t\t\tSWANN\n\t\tNo!\n\n\tSuddenly. Nix swoops down on Swann. apparently defying\n\tgravity.\n\n\t\t\t\tNIX\n\t\tYou're wrong.\n\n\tHe catches hold of Swann with one hand and drives him back\n\tagainst the wall.\n\n\t\t\t\tNIX\n\t\tI could eat your fucking soul,\n\t\tSwann.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - DAY\n\n\tJennifer, reaches the door of the Sanctum.  Butterfield steps\n\tfrom the shadows.  His KNIFE flashes as it strikes Jennifer's\n\thand.  BLOOD SPURTS.\n\n\t\t\t\tJENNIFER\n\t\tFuck!\n\n\tShe retreats, staunching her bleeding hand.\n\n\tINT. NIX'S HOUSE - SANCTUM - DAY\n\n\tNix has Swann trapped against the wall and is working his\n\tfingers against Swann's temples.  Working, working, like a\n\tpsychic surgeon plying against the belly of a patient.\n\n\t\t\t\tNIX\n\t\tYou want to know what the world\n\t\treally looks like?\n\n\tSwann struggles, but he can't get free of Nix's hold. \n\n\tAnd now -- horribly -- Nix's fingers slide beneath the skin\n\tof Swann's temples, without a drop of blood being spilt.\n\n\t\t\t\tNIX\n\t\tWant to see flesh with a god's\n\t\teyes?\n\n\tSwann SCREAMS as Nix's mind-hold seizes him.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - DAY\n\n\tQuaid levels his gun at Butterfield, who is guarding the\n\tSanctum door.  Jennifer is at Quaid's side.\n\n\t\t\t\tSWANN (V.O.)\n\t\tAah!\n\n\t\t\t\tQUAID\n\t\tGet away from the door!\n\n\tButterfield shakes his head.  Quaid FIRES.  The bullet.\n\tstrikes the wall beside Butterfield's head.  He retreats,\n\tgrowling like a rabid animal.  Quaid kicks the Sanctum door\n\topen, and enters.\n\n\tINT. NIX'S HOUSE - SANCTUM - DAY\n\n\t\t\t\tQUAID\n\t\tSwann?\n\n\t\t\t\tNIX\n\t\t\t(to Quaid)\n\t\tHere he is.\n\n\tSwann stumbles into the middle of the room, the whites of his\n\teyes blood-red.\n\n\t\t\t\tNIX\n\t\tTake a look, Swann!  These are your\n\t\tfriends.\n\n\tOn Swann, reeling like a drunkard as he looks up at Quaid and\n\tJennifer.\n\n\t\t\t\tJENNIFER (V.O.)\n\t\tWhat have you done to him? \n\nSWANN'S P.O.V.\n\n\tof Quaid and Jennifer.  To Swann's eyes, their faces seem to\n\tbe MORPHING.  Their humanity is MELTING AWAY. What's left is\n\tlike a jellyfish with black, soulless eyes:  PRIMEVAL MUCK.\n\n\t\t\t\tQUAID (V.O.)\n\t\tSwann.  It's okay.\n\n\tQuaid reaches for Swann, who retreats in horror, shaking his\n\thead violently.\n\n\t\t\t\tSWANN\n\t\tDon't touch me.  He's got... got\n\t\tinto my head.\n\n\t\t\t\tNIX\n\t\tYou want to be like that, Swann? \n\t\tMud and shit?\n\n\tSwann turns away from Quaid and Jennifer in disgust.\n\n\tSWANN'S P.O.V. \n\n\tof Nix, his arms outstretched in welcome.  His face has an\n\taura of pulsing light.\n\n\t\t\t\tNIX\n\t\tCome here.  Share the power.\n\n\tON a GUN, leveled. .We don't see by whom.  The trigger is\n\tpulled. \n\n\tThe bullet strikes Nix's back and explodes out of his chest.\n\n\tON SWANN, staring at Nix. \n\n\tSWANN'S P.O.V. of Nix, as the aura of light dies. \n\n\tJust for a moment - a terrible moment - Swann glimpses\n\tsomething else. MORPHING out of Nix's features.  A NIGHTMARE\n\tFACE with waves of DARKNESS emanating from the middle of its\n\tforehead. \n\n\tSwann covers his eyes.\n\n\t\t\t\tNIX\n\t\t\t(raging, terrifying)\n\t\tSwann!  Swann!\n\n\tNix staggers, letting out an ungodly HOWL, and drops to his\n\tknees, clutching the WOUND.  As he falls, he reveals the\n\tashen Girl, who is still holding Swann's smoking GUN.\n\n\t\t\t\tNIX\n\t\t\t(a roar)\n\t\tHelp me!\n\n\tSwann shakes his head, ridding himself of Nix's mind-\n\tcontrol.\n\n\t\t\t\tSWANN\n\t\tJesus-\n\n\tINT. NIX'S HOUSE - PASSAGEWAY OUTSIDE SANCTUM - DAY\n\n\tPinon stands guard, his gun pointed on several cultists.\n\n\t\t\t\t1ST CULTIST\n\t\t\t(with distressing\n\t\tconfidence)\n\t\tYou can't kill him.\n\n\t\t\t\t2ND CULTIST\n\t\tHe'll just rise up again!\n\n\tINT. NIX'S HOUSE - SANCTUM - DAY\n\n\tOn Nix, doing just that:  rising up.  Right hand clamped to\n\this bloody chest, left hand reaching for Swann.\n\n\t\t\t\tNIX\n\t\tHelp me!\n\n\tQuaid FIRES at him again. Strikes his shoulder.  And again. \n\tStrikes his leg.  Nix collapses to the ground,\n\n\t\t\t\tJENNIFER\n\t\tQuickly!\n\n\tThey have come prepared for this.  Swann now takes from his\n\tjacket the three strange pieces of METALWORK.  There are\n\tSCREWS in then all.\n\n\t\t\t\tNIX\n\t\t\t(seeing)\n\t\tSwann?  What are you doing?\n\n\t\t\t\tSWANN\n\t\tBinding you.\n\n\tHe clamps one of the pieces over Nix's EYES.  It fits like an\n\teyeless mask.  Nix thrashes and SCREAMS.  Swann lays his\n\thands on the side of the mask, and \u0097 LIKE MAGIC -- his touch\n\tmakes the screws tighten of their own accord, grinding into\n\tNix's flesh and bone with a gut- wrenching SOUND.  BLOOD runs\n\tfrom the screw-holes.\n\n\t\t\t\tNIX\n\t\tFuck you, Swann!  Fuck you!\n\n\tNow the second piece, over his MOUTH.\n\n\t\t\t\tNIX\n\t\tSw\u0097\n\n\tHe's silenced.  The piece screws itself into-his head, like\n\tthe first.  And now comes the third and final piece:  over\n\tthe nose and into the ears.  Again, it screws itself into\n\tplace. \n\n\tSwann has done all he can.  He retreats from Nix's body, as\n\tit continues to convulse.  We go from face to ashen face, as\n\teach man and woman watches and waits.  Why won't he die? \n\n\tAnd now, at last  the violence of Nix's death-throes\n\tdiminishes.  Nix's body bends like a bow, arching off the\n\tground, and with one last, terrible spasm, he dies.\n\n\t\t\t\tGIRL\n\t\t\t(quietly)\n\t\tIs it finished?\n\n\t\t\t\tSWANN\n\t\tIt's finished.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - DAY\n\n\tThe Cultists' faces slacken, as though some mental hold Nix\n\thad upon them has disappeared.  Then they start to retreat,\n\ttheir confidence and courage gone. \n\n\tPimm steps into the Sanctum.\n\n\tINT. NIX'S HOUSE - SANCTUM - DAY\n\n\tThe five assassins, including the Girl, stand around Nix's\n\tbody.  Swann has his arm around the Girl.\n\n\t\t\t\tPIMM\n\t\tDead?\n\n\t\t\t\tQUAID\n\t\tDead.\n\n\t\t\t\tPIMM\n\t\tWhat now?\n\n\t\t\t\tSWANN\n\t\tWe bury him so deep no one will\n\t\tever find him.\n\n\t\t\t\tCUT TO:\n\n\tEXT. NIX'S .HOUSE - WIDE SHOT - DUSK\n\n\tThe wind has died away.  It's eerily calm.  Butterfield\n\tdashes towards camera, then halts. \n\n\tHE LOOKS BACK, as Nix's killers load his huge, limp CORPSE\n\tinto the back of Murray Pimm's bus. \n\n\tON Butterfield.  He watches, with a feral look on his face.\n\n\t\t\t\tFADE OUT\n\n\t\t\t\tFADE IN\n\n\tEXT. LOS ANGELES - MONTAGE - DAY\n\n\tThe city looks magical in the spring light, its palms and\n\tgleaming towers, its rivers of sun-baked traffic, evoking\n\tsome fantastical metropolis.  This, for all its smog and\n\tcongestion, is a city of exoticism and enchantments.\n\n\tON SCREEN, the words:  \"LOS ANGELES - THIRTEEN YEARS LATER\"\n\n\tEXT. STARDUST HOTEL - DAY\n\n\tThe facade of this small HOTEL off Hollywood Boulevard needs\n\ta lick of paint, and the neon sign is blinking fitfully, but\n\tit has a certain charm.\n\n\tINT. STARDUST HOTEL - LOBBY - DAY\n\n\tA large deteriorating mural of Hollywoodland, depicting a\n\thost of 50's movie stars, dominates the lobby. \n\tAt the front desk - with his back to us at present - stands\n\tHARRY D'AMOUR.  He is having difficulty getting the pretty\n\tbut vacant BLONDE at the reception desk to comprehend his\n\tname.\n\n\t\t\t\tBLONDE GIRL\n\t\tHow'd you spell that again?\n\n\t\t\t\tHARRY\n\t\tD.A.M.O.U.R.  D'Amour.  Harry\n\t\tD'Amour.\n\n\t\t\t\tBLONDE GIRL\n\t\tD'Amour.\n\n\t\t\t\tHARRY\n\t\tRight.\n\n\t\t\t\tBLONDE GIRL\n\t\tIsn't that French for something?\n\n\tON THE BELLBOY, approaching Harry from the front door.\n\n\t\t\t\tBELLBOY\n\t\tMister D'Amour?\n\n\t\t\t\tHARRY\n\t\t\t(to Blonde)\n\t\tYeah.  It's French.\n\n\t\t\t\tBLONDE GIRL\n\t\tFor love, right?\n\n\t\t\t\tBELLBOY\n\t\tMister D'Amour?\n\n\t\t\t\tHARRY\n\t\t\t(to Blonde)\n\t\tRight.\n\n\t\t\t\tBLONDE GIRL\n\t\t\t(grinning)\n\t\tThat's so cool.\n\n\t\t\t\tBELLBOY\n\t\tMister D'Amour?\n\n\tHarry turns.  He's wearing a washed-out Grateful Dead t-\n\tshirt, an Italian cut linen suit, and glasses.  He's\n\thandsome, unshaven, 35-ish, with an open easy smile.\n\n\t\t\t\tHARRY\n\t\tYeah?\n\n\t\t\t\tBELLBOY\n\t\tYou haven't paid the cab.  He won't\n\t\tgive us your bags 'til you pay him.\n\n\t\t\t\tHARRY\n\t\tHow much?\n\n\t\t\t\tBELLBOY\n\t\tThirty-five bucks.\n\n\t\t\t\tHARRY\n\t\tTell him he can keep them. The\n\t\tBellboy looks puzzled.\n\n\t\t\t\tHARRY\n\t\tJust kidding.\n\n\tHarry gets out his wallet and hands over four ten-dollar\n\tbills.\n\n\t\t\t\tHARRY\n\t\tI've got my life in there.\n\n\tINT. HARRY'S HOTEL ROOM - DAY\n\n\tOn the suit-case, which is now on the bed.  Harry flings it\n\topen.  Inside, mingled with the clothes, a bizarre collection\n\tof items, which he tosses out onto the coverlet.  A GUN.  A\n\tCRUCIFIX.  A STATUE of Shiva, the Hindu Lord of creation and\n\tdestruction. \n\n\tON HARRY, as he heads into the bathroom.  Turns on the\n\tshower.  Starts to undress.\n\n\tEXT. STARDUST HOTEL - DUSK\n\n\tHarry, his hair still wet from his shower, steps out into the\n\tsun.  Squints.  Puts on sunglasses.\n\n\t\t\t\tHARRY\n\t\tHello, L.A.\n\n\t\t\t\tBELLBOY\n\t\tHave a nice evening, Mr. D'Amour.\n\n\t\t\t\tHARRY\n\t\tYou bet.\n\n\tEXT. MELROSE RESTAURANT - NIGHT\n\n\tHarry stands, in a shabby doorway across the street from a\n\tclassy restaurant.  It's RAINING.\n\tON TAPERT, a middle-aged, balding man with a very pretty\n\tWOMAN opposite him, sitting at a table close to the window. \n\tTapert makes a joke (unheard).  The woman laughs. \n\n\tON HARRY, chewing on a hamburger, as he speaks into his tape\n\trecorder.\n\n\t\t\t\tHARRY\n\t\tNine-eighteen p.m.  Tapert's either\n\t\tgot a great sense of humour or he's\n\t\tpaying her to laugh.\n\t\t\t(looks at hamburger in\n\t\tdisgust)\n\t\tJesus.\n\n\tOn Tapert, as he rises from the table.\n\n\t\t\t\tHARRY\n\t\t\t(into tape recorder)\n\t\tHe's finished.\n\n\tTapert exits the restaurant, and crosses the street. Harry\n\ttosses his half-eaten hamburger away, and goes to his car.\n\n\tEXT. HARRY'S CAR - MELROSE - NIGHT\n\n\tHarry pulls the parking ticket off the windshield, screws it\n\tup and gets in.\n\n\tINT. HARRY'S CAR - MELROSE - NIGHT\n\n\t\t\t\tHARRY\n\t\t\t(into tape)\n\t\tNine twenty-six p.m.  He's off\n\t\tagain.\n\n\tHe turns the key in the ignition.\n\n\t\t\t\tCUT  TO:\n\n\tEXT. QUAID'S OFFICES - SILVERLAKE - NIGHT\n\n\tIn neon blue and purple, a sign blazes in a store window.  It\n\treads:  TAROT CARD AND CRYSTAL READINGS - $15 SPECIAL\n\n\tON TAPERT, as he hurries across the street, and through the\n\tdoor beside the store window. \n\n\tWE PAN OFF the door as Harry's car comes to a halt on the far\n\tside of the street. \n\n\tHarry gets out of the car.  Stares at the sign in the window,\n\tpuzzled.\n\n\t\t\t\tHARRY\n\t\tSuperstitious?\n\n\tHe starts across the street.  Suddenly:\n\n\t\t\t\tTAPERT (V.O.)\n\t\tOh my God!\n\n\tTapert emerges, his face white with terror.  He stumbles to\n\this car, and he's away.  Harry freezes, caught between the\n\tneed to follow Tapert and sheer curiosity. He gives in to the\n\tlatter, and steps inside.\n\n\tINT. QUAID'S OFFICES - STAIRWELL - NIGHT\n\n\tAn illuminated ARROW points up the stairs.  Harry ascends,\n\tpast faded PHOTOGRAPHS of Caspar Quaid with famous faces.\n\n\tAt the landing, the passageway turns ninety degrees. Harry\n\thalts, and takes out his GUN. \n\n\tThere's a strange RUMBLING SOUND approaching from round the\n\tcorner.  Harry chances a look.  There's a short length of\n\tpassageway, leading to an open door.  From the threshold a\n\tCRYSTAL BALL rolls towards Harry, BLOOD- SMEARED.  This is\n\tthe source of the rumbling.  Harry stops the ball before it\n\tfalls down the stairs. \n\n\tDead silence.  After a beat, Harry creeps towards the open\n\tdoor.  He pushes it open.  Inside, chaos.  The fake antique\n\tFURNITURE is splintered, the ASTRAL CHARTS slashed.\n\n\tINT. QUAID'S OFFICES - WAITING ROOM - NIGHT\n\n\tThere are two offices.  In the front, a Waiting Room, into\n\twhich Harry now steps.  Beyond it, through a door that stands\n\tnarrowly ajar, the Fortune Telling Room. \n\n\tFrom out of the Fortune Telling Room, a MOAN.\n\n\t\t\t\tQUAID (V.O.)\n\t\tAhh. . .\n\n\tHarry crosses the Waiting Room, reaching into his jacket for\n\this gun.  Suddenly, a nightmarish FIGURE leaps from the\n\tshadows. \n\n\tHis name is RAY MILLER.  He's as crazy as a rabid dog, teeth\n\tsharpened, eyes wild.  Nix's SIGIL is tattooed on the middle\n\tof his forehead.  He STRIKES the GUN from Harry's hand and\n\tgoes for his throat. \n\n\tHarry reaches out behind him, picks up a phrenologist's BUST\n\tand SMASHES it on Miller's skull. \n\n\tMiller reels back.  Harry makes a dash for the door to the\n\tFortune Telling Room.\n\n\t\t\t\tMILLER\n\t\tFuckhead.\n\n\tINT. QUAID'S OFFICES - FORTUNE-TELLING ROOM - NIGHT\n\n\tA mysterious, candle-lit space.  In the middle of the room, a\n\ttable.  At it sits Quaid. thirteen years older. He has been\n\ttortured close to death.  Several small SCALPELS protrude\n\tfrom his chest and neck.  His life is ebbing away.  On the\n\ttable in front of him, a fan of TAROT CARDS, BLOOD-SPATTERED.\n\n\tHarry races in through the open door from the Waiting Room.\n\n\t\t\t\tHARRY\n\t\tWhat the fuck!?\n\n\tHarry picks up the PHONE.  It's dead.  Miller charges at the\n\tdoor.\n\n\t\t\t\tHARRY\n\t\tShit!\n\n\tHarry SLAMS the door in Miller's face, and locks it. \n\n\tAs he does so, the candles FLICKER.  Harry looks up.  A\n\tFIGURE looms from the darkness behind Quaid.  He's in his\n\tlate twenties:  an androgynous, disturbing sight. His long\n\thair is drawn back into a pony-tail.  His mismatched eyes -\n\tone black, one milky blue, tell us that he is Butterfield. \n\tHis hands are BLOODY, and he carries one last SCALPEL.\n\n\t\t\t\tHARRY\n\t\t\t(to Butterfield)\n\t\tDon't touch him.\"\n\n\tButterfield strokes the wounds on Quaid's cheek.  Quaid sobs\n\tin pain. \n\n\t\t\t\tBUTTERFIELD\n\t\tWhat are you going to do about it? \n\n\tMiller's hand tears at the wood around the lock from the\n\tother side.  His fingers appear, scrabbling to tear the lock\n\tout.  Harry doesn't move, or Miller will be through.\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(to Harry)\n\t\tEver watched a man die?  If you\n\t\twatch very closely, you can\n\t\tsometimes see the soul escaping. \n\t\tAnd if you're very quick, you can\n\t\tcatch it.\n\n\t\t\t\tQUAID\n\t\tPlease... Butterfield... I wasn't\n\t\tthere.  Ask Pimm.\n\n\t\t\t\tBUTTERFIELD\n\t\tPimm's dead.  Jennifer Desiderio's\n\t\tdisappeared.  They knew the Puritan\n\t\twas coming home. \n\n\tAs this exchange goes on, Miller pulls the lock out of the\n\tdoor and starts to THROW HIMSELF against it from the other\n\tside.  It's all Harry can do to keep himself from being\n\tpitched across the room.  He looks around for some means of\n\tdefense.  There's a crack in the drapes to the left of the\n\ttable.  Behind it a WINDOW.\n\n\t\t\t\tBUTTERFIELD\n\t\tSo do you.  You've seen the future. \n\t\tHaven't you?\n\n\t\t\t\tQUAID\n\t\tYes.\n\n\t\t\t\tBUTTERFIELD\n\t\tAnd are you afraid?\n\n\t\t\t\tQUAID\n\t\tYes.\n\n\tSuddenly, Harry steps aside.  The door's flung open. Miller\n\tCHARGES in.  Harry catches hold of his arm, and THROWS him\n\tagainst the drape.  The window CRACKS; the drape comes down\n\taround Miller.  Amber STREETLIGHT floods in. \n\n\tButterfield is momentarily distracted.  Harry STRIKES the\n\tscalpel from his hands. \n\n\tMiller, meanwhile, is struggling to free himself from the\n\tfolds of the drapes.  Harry lands a solid KICK to the man's\n\tbelly.  Miller is THROWN back against the cracked window,\n\twhich SHATTERS.  Still wrapped in the drape, he FALLS OUT. \n\n\tHarry turns back to arrest Butterfield, but he's already\n\tmaking his escape.  Harry starts after him.\n\n\t\t\t\tQUAID\n\t\t\t(to Harry)\n\t\tDon't leave me.\n\n\tHe turns back.  TEARS are pouring down the man's face. Harry\n\tgoes back to comfort Quaid, as Butterfield escapes down the\n\tstairs.\n\n\n\t\t\t\tHARRY\n\t\tYou need an ambulance.\n\n\t\t\t\tQUAID\n\t\t\t(in pain)\n\t\tToo late.  Why are you here? Did\n\t\tyou cone... up here for a reading? \n\n\tQuaid takes hold of Harry's hand.\n\n\t\t\t\tHARRY\n\t\tNO ... I...\n\n\tQuaid stares at Harry's HAND.  Fascinated, he momentarily\n\tforgets his pain.  He traces the lines with bloody fingers.\n\n\t\t\t\tQUAID\n\t\t\t(quietly)\n\t\tMy God.\n\n\t\t\t\tHARRY\n\t\tWhat?\n\n\t\t\t\tQUAID\n\t\tYou've taken some strange\n\t\tjourneys in your life.\n\n\t\t\t\tHARRY\n\t\tYeah.  You could say that.\n\n\t\t\t\tQUAID\n\t\tYou're drawn to the dark side, over\n\t\tand over.  And it's drawn to you.\n\t\t\t(looks at Harry)\n\t\tYou don't like that.\n\n\t\t\t\tHARRY\n\t\tNot much.\n\n\t\t\t\tQUAID\n\t\tYou can't change it.  You have to\n\t\twalk...\n\t\t\t(coughs)\n\t\t...walk the line between Heaven and\n\t\tHell.  It's your destiny.  Accept\n\t\tit.\n\n\tHarry takes his hand from Quaid's grip.  Quaid winces in\n\tpain.\n\n\t\t\t\tHARRY\n\t\tHold on.\n\n\t\t\t\tQUAID\n\t\tI'm not afraid to die.  There's\n\t\tsomething terrible... coming\n\t\thome...\n\n\t\t\t\tHARRY\n\t\tThe Puritan?\n\n\t\t\t\tQUAID\n\t\tYes...\n\n\t\t\t\tHARRY\n\t\tWho is he? \n\n\tQuaid shudders, and dies.\n\n\t\t\t\tHARRY\n\t\t\t(softly; sadly)\n\t\tShit.\n\n\tHe looks away, down at the CARDS.  All have been turned over\n\tbut ONE.  He turns it.  The card is the Ten of Swords which\n\tpictures a prostrate man against a thunderous sky, pierced by\n\tall ten swords.  An image of death and desolation.\n\n\tEXT. QUAID'S OFFICES - ALLEY BEHIND BUILDING - NIGHT\n\n\tThe flashing LIGHTS of two patrol cars illuminate the scene. \n\tDETECTIVE EDDISON, a surfer-turned-policeman with buzz-cut\n\tblond hair, heads along the alley with Harry.  He's midway\n\tthrough taking Harry's statement. There are already two\n\tOFFICERS examining the drapes.  We can't yet see the body.\n\n\t\t\t\tEDDISON\n\t\t\t(to Harry)\n\t\tWhat were you doing up there?\n\n\t\t\t\tHARRY\n\t\tI'm a private detective.  I was\n\t\thired to follow somebody for a few\n\t\tdays.  A guy called Tapert.\n\t\tInsurance fraud.\n\n\t\t\t\tEDDISON\n\t\t\t(writing)\n\t\tTapert.  So, now I've got Tapert,\n\t\tButterfield.\n\n\t\t\t\tHARRY\n\t\tTapert's got nothing to do with\n\t\tthis.  He came here to get his palm\n\t\tread.\n\n\t\t\t\tEDDISON\n\t\tWhat makes you so sure?\n\n\t\t\t\tHARRY\n\t\t\t(shrugs)\n\t\tI got a file on him two inches\n\t\tthick.  He's a petty fraudster.\n\t\tThis is something else.  Ever heard\n\t\tof someone called the Puritan?\n\n\t\t\t\tEDDISON\n\t\tNew one on me.\n\t\t\t(to Officer)\n\t\tOkay.  Let's see him.\n\n\tOFFICER #l shakes his head, and opens up the drape. Broken\n\tGLASS drops from the folds, but that's all. Miller has gone.\n\n\t\t\t\tEDDISON\n\t\tWhere the fuck is he?\n\n\t\t\t\tHARRY\n\t\tHe got up and walked.\n\n\t\t\t\tEDDISON\n\t\t\t(looking up at window)\n\t\tAfter that fall?. He must have\n\t\tbroken half his bones.\n\n\tWE MOVE IN ON HARRY, as he stares down at the drape.\n\n\t\t\t\tHARRY\n\t\tI don't think he'd have given a\n\t\tshit.\n\n\t\t\t\tCUT TO:\n\n\tINT. BUTTERFIELD'S APARTMENT - NIGHT\n\n\tThe rooms are spartan.  Nothing on the walls.  Nothing on the\n\tfloors.  Very little furniture. \n\n\tButterfield sits beside the window, obsessively combing his\n\tlong hair.  There is something feminine about him now:  his\n\tvoice a whisper, his stare distracted.  If we didn't guess it\n\talready, we're in the presence of a madman. \n\n\tMiller is squatting against the wall, picking shards of GLASS\n\tout of his torso.  It hurts, but he's enjoying himself.\n\n\t\t\t\tBUTTERFIELD\n\t\tD'Amour... D'Amour... Why do I know\n\t\tthat name?\n\n\t\t\t\tMILLER\n\t\tI know him.  I saw him.\n\n\tHe stops to pull out a particularly large piece of glass,\n\tsighing with pleasure.\n\n\t\t\t\tMILLER\n\t\tI saw him on T.V.  Some kid got\n\t\tpossessed and he saved the little\n\t\tbastard's life.\n\n\t\t\t\tBUTTERFIELD\n\t\tHe's a priest?\n\n\t\t\t\tMILLER\n\t\tNo.  He's just a guy who's got a\n\t\tnose for this shit.\n\t\t\t(a beat.  A smirk)\n\t\tLike you.\n\n\tA long beat of silence.  Butterfield combs.  Miller digs for\n\tglass.\n\n\t\t\t\tBUTTERFIELD \n\t\tI don't want him getting in the\n\t\tway.\n\n\t\t\t\tMILLER\n\t\tHe won't. \n\n\tAnother silence.\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(dreamily)\n\t\tWe've all of us waited too long to\n\t\thave the homecoming spoiled.\n\n\t\t\t\tMILLER\n\t\tWhat do you mean, \"all of us?\"\n\n\t\t\t\tBUTTERFIELD\n\t\tYou didn't think it was just going\n\t\tto be you and me?  A lot of people\n\t\tbelieved in Nix. They haven't\n\t\tforgotten his promise.\n\n\t\t\t\tMILLER\n\t\tAbout?\n\n\t\t\t\tBUTTERFIELD\n\t\tDeath.\n\n\t\t\t\tMILLER\n\t\tWhat about death?\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(a beat)\n\t\tIt's an illusion.\n\n\t\t\t\tCUT TO:\n\n\tEXT. PHILADELPHIA STREET - MORNING\n\n\tOn screen:  Philadelphia \n\n\tA suburban street.  Early morning light.\n\n\tINT. SUBURBAN HOUSE - PHILADELPHIA - MORNING\n\n\tCLOSE-UP of a PHOTOGRAPH of the Cultist with the Painted\n\tFace, from the opening scene, standing outside Nix's house in\n\tNevada.  His name is Norman Sanders. \n\n\tON NORMAN, thirteen years older, looking down at the\n\tphotograph.  He lays it down, beside a letter, on which two\n\twords are written: \"Homecoming Time.\"\n\n\tNorman smiles to himself.  Goes to the wardrobe.  Gets out a\n\tsmall suitcase.  His WIFE'S BODY is slumped in the wardrobe,\n\tglassy-eyed. \n\n\tCLOSE UP of letter -\u0097\n\n\t\t\t\tCUT TO:\n\n\tINT. KITCHEN IN MIAMI HOUSE - DAY\n\n\t\u0097- and DRAW OUT from the letter to a different interior, a\n\tdifferent domestic circumstance. \n\n\tOn the screen:  Miami. \n\n\tBARBARA - the blonde girl who carved the cult's sigil into\n\ther chest - is washing her hands.  She casually dries them,\n\tand picks up the letter, walking past her HUSBAND and SON,\n\tboth DEAD at the breakfast table, BLOOD spreading around\n\ttheir heads.  When she gets to the door she steps over the\n\tbody of her DAUGHTER, who has also been shot trying to escape\n\ther mother's murder spree. \n\n\tON THE RADIO, George Harrison sings \"My Sweet Lord.\"\n\n\t\t\t\tRADIO\n\t\t\"I really want to see you, Lord,\n\t\tAnd it won't take long, my Lord, My\n\t\tsweet Lord...\"\n\n\t\t\t\tCUT TO:\n\n\tEXT. SAN ANTONIO 200 - REPTILE HOUSE - DAY\n\n\tOn screen:  San Antonio. \n\n\tA ZOO-KEEPER wanders into the darkened interior of the\n\tReptile House.\n\n\tINT. REPTILE HOUSE - DAY\n\n\tThe Zoo-keeper's benign expression changes at the sight of\n\tthe chaos inside.  The glass cases have been SMASHED. Another\n\tKEEPER lies on the ground, his face pulped.  A few SNAKES\n\tslither around his body, but most of them have gone.\n\n\t\t\t\tCUT TO:\n\n\tEXT. SNAKE-HANDLER CULTIST'S CAR - DAY\n\n\tThe Snake-Handler Cultist drives at speed.\n\n\tINT. SNAKE-HANDLER CULTIST'S CAR - DAY\n\n\tPAN UP from another letter'- with the same message - on the\n\tdashboard, to the crazed face of the Snake-Handler. PAN TO\n\tthe back of the car.  IT SEETHES WITH HUNDREDS OF SNAKES.\n\n\tEXT. SWANN'S MANSION - DAY\n\n\tIt's early morning in Bel-Air.  The sun shines down on a\n\tmillionaire's paradise:  a huge house surrounded by a jungle\n\tof trees and blossoms.\n\n\tEXT. SWANN'S MANSION - POOLSIDE - DAY\n\n\tThe blue water glitters in the noon-day sun.  And a WOMAN --\n\ther body perfectly proportioned -- glides under the surface,\n\temerging at the shallow end, where the housekeeper CLEMENZIA\n\tis setting a tray on a table.\n\n\t\t\t\tCLEMENZIA\n\t\tCoffee, Mrs. Swann?\n\n\tMrs. Swann's name is DOROTHEA.  She is a beautiful and\n\tsensual woman.\n\n\t\t\t\tDOROTHEA\n\t\tThank you. \n\n\tShe dries off.\n\n\t\t\t\tDOROTHEA\n\t\tWhere's Mr. Swann?\n\n\t\t\t\tCLEMENZIA\n\t\tIn his study.\n\t\t\t(a beat)\n\t\tHe got something on his mind?\n\n\t\t\t\tDOROTHEA\n\t\tWhy?\n\n\t\t\t\tCLEMENZIA\n\t\tBad mood today.\n\n\tINT. SWANN'S MANSION - STUDY - DAY\n\n\tVenetian blinds shut out most of the sunlight, but a lamp\n\tburns on the desk (huge), showing us the furniture (leather),\n\tthe books (innumerable), and the figure of SWANN, sitting\n\tbehind the desk smoking a CIGAR.  He's lost some hair and\n\tsome colour over the years, but he still has the same\n\thypnotic eyes.\n\n\tHe studies the L.A. TIMES in front of him.\n\n\tON THE OPEN PAGE\n\n\t\"Fortune Teller Brutally Murdered,\" the headline announces. \n\tUnderneath, a PHOTOGRAPH of Quaid's wrecked room.  WE CLOSE\n\tIN on the photograph, and catch a glimpse of Harry, standing\n\tlooking at the chaos.  CAMERA. MOVES DOWN to the text\n\tbeneath, and on to the name \"Harry D'Amour.\" \n\n\tON SWANN, pensive as he studies the paper.\n\n\t\t\t\tDOROTHEA (V.O.)\n\t\t\t(softly)\n\t\tHey... \n\n\tHe looks up, startled.\n\n\tDOROTHEA The sun's shining out there. Dorothea is dressed in\n\ta white robe now.  She literally brings light into this\n\tgloomy room.  On the shelves behind Swann are a number of art\n\tbrut figurines, vaguely recalling the idols outside Nix's\n\t\"temple.\"\n\n\t\t\t\tDOROTHEA\n\t\tBad show last night?\n\n\t\t\t\tSWANN\n\t\t\t(wearily)\n\t\tThe usual.  Full house. Standing\n\t\tovation.  I tell them it's magic...\n\n\t\t\t\tDOROTHEA\n\t\t\t(distastefully)\n\t\t... they believe you.\n\n\t\t\t\tSWANN\n\t\tYeah.\n\t\t\t(a beat)\n\t\tRemember Quaid?\n\n\t\t\t\tDOROTHEA\n\t\tSure.\n\n\t\t\t\tSWANN\n\t\tSomebody killed him.\n\n\t\t\t\tDOROTHEA\n\t\tOh God.\n\n\t\t\t\tSWANN\n\t\t\t(disturbed)\n\t\tI just saw him.\n\n\tA difficult silence.  Then Swann crosses to the door.\n\n\t\t\t\tSWANN\n\t\tI'm putting in a new illusion\n\t\ttonight.  Will you be there?\n\n\t\t\t\tDOROTHEA\n\t\tSure.  You want me to find out\n\t\tabout Quaid?  I mean, the funeral?\n\n\t\t\t\tSWANN\n\t\tNo.\n\t\t\t(superstitiously)\n\t\tI'm not going near him.\n\n\tINT. SWANN'S MANSION - LOBBY - DAY\n\n\tVALENTIN is overseeing the hanging of a new piece in Swann's\n\tcollection:  a huge, framed POSTER from a late nineteenth\n\tcentury magic spectacular.  Valentin is fifty or so, his gray\n\thair combed back close to his scalp. Immaculately dressed in\n\ta distinctively European fashion.  Precise.  Cautious. \n\tElegant. \n\n\tHe orders the TWO PICTURE-HANGERS in a clipped fashion.\n\n\t\t\t\tVALENTIN\n\t\tHigher.  Another inch.  The left\n\t\thand side's too low.\n\n\tDorothea descends the stairs, dressed for the day.\n\n\t\t\t\tDOROTHEA\n\t\tValentin?\n\n\t\t\t\tVALENTIN\n\t\t\t(to Hangers)\n\t\tGood.  There.\n\t\t\t(to Dorothea)\n\t\tYes?\n\n\t\t\t\tDOROTHEA\n\t\t\t(gives him the newspaper)\n\t\tYou saw this?\n\n\tValentin nods.  They walk back through the house together,\n\twhile the picture-hanging goes on behind them.\n\n\t\t\t\tDOROTHEA\n\t\tI want you to find this man D'Amour\n\t\tfor me.\n\n\tShe passes the newspaper to Valentin.  He looks down at it.\n\tON NEWSPAPER.  \n\n\tC.U. of Harry's blurred PICTURE.\n\n\tINT. HARRY'S HOTEL ROOM - DAY\n\n\tHarry is sprawled on the bed, in his under shorts.  A shaft of\n\tsun darts between the drapes, missing his face by inches. \n\n\tSomebody is knocking on the door, hard.\n\n\t\t\t\tHARRY\n\t\t\t(waking)\n\t\tWhat...?\n\n\tHe rolls over.  The sun strikes his eyes.  He winces.\n\n\t\t\t\tHARRY\n\t\tShit.\n\n\t\t\t\tVALENTIN (V.O.)\n\t\tMr. D'Amour?\n\n\t\t\t\tHARRY\n\t\tGo away.\n\n\t\t\t\tVALENTIN (V.O.)\n\t\tIt's one in the afternoon.\n\n\t\t\t\tHARRY\n\t\tWhat are you, my mother?\n\n\t\t\t\tVALENTIN (V.O.)\n\t\tI need to speak to you, Mr.\n\t\tD'Amour.  About last night.\n\n\tHarry gets up and stumbles to the door.  He opens it a\n\tlittle.  The face of VALENTIN is visible through the crack.\n\n\t\t\t\tHARRY\n\t\tWhatever I said, I didn't mean it,\n\t\tokay?  I get a few drinks inside me --\n\n\t\t\t\tVALENTIN\n\t\tWe've never met.\n\n\t\t\t\tHARRY\n\t\tThen what do you want?\n\n\t\t\t\tVALENTIN\n\t\tI'm here to offer you a job.\n\n\t\t\t\tHARRY\n\t\tI'm going back to New York in--\n\t\t\t(consults his watch)\n\t\tShit!  I'm outta here.\n\n\t\t\t\tVALENTIN\n\t\tHave you got a job that'll pay you\n\t\tfive thousand a day?\n\n\tA beat.  Then Harry takes the chain off the door.\n\n\t\t\t\tHARRY\n\t\tDo I get lunch?\n\n\t\t\t\tCUT TO:\n\n\tEXT. SANTA MONICA BLVD. - DAY\n\n\tA white SEDAN glides along the boulevard.  At the wheel,\n\tValentin.  Beside him, Harry.\n\n\tINT. SEDAN - DAY\n\n\tHarry is eating a burrito and sipping coffee.\n\n\t\t\t\tHARRY\n\t\tWhose is the car?\n\n\t\t\t\tVALENTIN\n\t\tMine.\n\n\t\t\t\tHARRY\n\t\tNah.  You're driving it too\n\t\tcarefully.\n\n\t\t\t\tVALENTIN\n\t\t\t(sparring)\n\t\tMaybe I just bought it.\n\n\t\t\t\tHARRY\n\t\tSomebody's been smoking in here for\n\t\tmonths.\n\n\tHe pulls open the ashtray. Pulls out a cigar-butt.\n\n\t\t\t\tHARRY\n\t\tHavanas.  You're not the\n\t\tsmoker.  So who is?\n\n\t\t\t\tVALENTIN\n\t\t\t(laughs)\n\t\tYou could almost pass for a\n\t\tdetective, D'Amour.\n\t\t\t(a beat)\n\t\tI work for the best illusionist in\n\t\tthe world.\n\n\t\t\t\tHARRY\n\t\tPhilip Swann?\n\n\t\t\t\tVALENTIN\n\t\tYou know of him?\n\n\t\t\t\tHARRY\n\t\tI saw him in Vegas once.\n\n\t\t\t\tVALENTIN\n\t\tAre you a gambling man?\n\n\t\t\t\tHARRY\n\t\tWhen I can afford to lose. Swann's\n\t\tquite a magician.\n\n\t\t\t\tVALENTIN\n\t\tNever call him that.  He's strictly\n\t\tan illusionist.\n\n\t\t\t\tHARRY\n\t\tWhat's the difference?\n\n\t\t\t\tVALENTIN\n\t\tIllusions are trickery. Magicians\n\t\tdo it for real.\n\n\tEXT. HOLLYWOOD CEMETERY - GATES - DAY\n\n\tThe sedan turns into a driveway.\n\n\tEXT. HOLLYWOOD CEMETERY - DAY\n\n\tThe sun beats down on a pristine panorama of palms and white\n\tmarble tombs.  Harry and Valentin walk towards a large\n\tmausoleum.\n\n\t\t\t\tHARRY\n\t\tAny movie stars buried here?\n\n\t\t\t\tVALENTIN\n\t\tProbably.\n\n\t\t\t\tHARRY\n\t\tIt's not a bad place.  Warm.\n\t\tGreat view.\n\n\t\t\t\tVALENTIN\n\t\tI don't think the dead much care.\n\n\t\t\t\tHARRY\n\t\tAre you sure?\n\n\t\t\t\tVALENTIN\n\t\tAre you a believer, then?\n\n\tValentin gives him an inquisitive look.\n\n\t\t\t\tHARRY\n\t\tI've signed on for them all in my\n\t\ttime.  Hindu.  Catholic. You can't\n\t\thave too many saviours.\n\n\tHarry's gaze is on the mausoleum now; or rather on the woman\n\tin white standing in its cool shadows:  Dorothea Swann.  She\n\twears a wide-brimmed hat.\n\n\t\t\t\tHARRY\n\t\tWho is she?\n\n\t\t\t\tVALENTIN\n\t\tSwann's wife.\n\n\t\t\t\tCUT TO:\n\n\tVALENTIN sitting on the mausoleum steps reading a book.  He\n\tglances up. \n\n\tHarry and Dorothea are wandering between the graves, deep in\n\tconversation.\n\n\t\t\t\tDOROTHEA\n\t\tI want you to help me help my\n\t\thusband.  I know he's in some kind\n\t\tof trouble.  And it's something to\n\t\tdo with the man you saw murdered.\n\n\t\t\t\tHARRY\n\t\tDid your husband know Quaid?\n\n\t\t\t\tDOROTHEA\n\t\tYes.  They weren't close, but they\n\t\tsaw each other once in a while.  I\n\t\tthink Philip believes all that\n\t\tstuff with the tarot cards.\n\n\t\t\t\tHARRY\n\t\tYou don't?\n\n\t\t\t\tDOROTHEA\n\t\tI think we make our own futures.\n\n\tHarry makes an approving MURMUR.\n\n\t\t\t\tHARRY\n\t\tWhat's the connection?\n\n\t\t\t\tDOROTHEA\n\t\t\t(covering now, but well)\n\t\tI don't exactly know. \n\t\tPhilip doesn't like to talk about\n\t\tthe past.\n\n\t\t\t\tHARRY\n\t\tWhy not?\n\n\tDorothea stops talking.  Takes off her sunglasses.  Her gaze\n\tis troubled, but direct.  There is an attraction between the\n\ttwo of them that simmers beneath the dialogue.\n\n\t\t\t\tDOROTHEA\n\t\tHe's a secretive man.\n\n\t\t\t\tHARRY\n\t\tAnd you don't ask questions?\n\n\t\t\t\tDOROTHEA\n\t\tWe don't share our lives the way a\n\t\tlot of people do.\n\n\t\t\t\tHARRY\n\t\tDoes that mean...?\n\n\t\t\t\tDOROTHEA\n\t\tWe haven't slept in the same bed\n\t\tfor years.\n\n\t\t\t\tHARRY\n\t\tBut obviously you still care what\n\t\thappens to him.\n\n\t\t\t\tDOROTHEA\n\t\tWe wouldn't be having this\n\t\tconversation if I didn't. Swann's\n\t\tone of the most remarkable men\n\t\talive.\n\n\tHarry, frowns.\n\n\t\t\t\tDOROTHEA\n\t\tYou don't believe me.\n\n\t\t\t\tHARRY\n\t\tHe's an illusionist.  It's not\n\t\texactly brain surgery. \n\n\tDorothea stares at him. \n\n\t\t\t\tHARRY\n\t\tSorry.  You asked.\n\n\t\t\t\tDOROTHEA\n\t\tNo.  You're right.  He could have\n\t\tbeen something more. Maybe a lot\n\t\tmore.  But people get lost.  Even\n\t\tgood people. Too much fame.  Too\n\t\tmuch money,\n\n\t\t\t\tHARRY\n\t\tWhere do I sign? \n\n\tDorothea LAUGHS lightly.\n\n\t\t\t\tDOROTHEA\n\t\tWill you take the job, Mr. D'Amour?\n\n\t\t\t\tHARRY\n\t\tHarry.\n\n\t\t\t\tDOROTHEA\n\t\tHarry.\n\n\t\t\t\tHARRY\n\t\tI'm no bodyguard.\n\n\t\t\t\tDOROTHEA\n\t\tThat's not what I'm asking for. I\n\t\twant somebody who can find out what\n\t\tPhilip saw in those damn cards. \n\t\tAnd stop it from happening.\n\n\t\t\t\tHARRY\n\t\tWhen do you want me to start?\n\n\t\t\t\tDOROTHEA\n\t\tCome to the show with me. Tonight I\n\t\twant you to see him with an\n\t\taudience.  They love him.\n\n\t\t\t\tHARRY\n\t\tDo you?\n\n\tThe question catches Dorothea off guard.\n\n\t\t\t\tDOROTHEA\n\t\tI didn't marry him for love, Mr.\n\t\tD'Amour.  Tonight?\n\n\t\t\t\tHARRY\n\t\tSure.\n\n\tDorothea makes a little smile, and walks away.  Harry watches\n\ther go, exhaling an appreciative breath at the sight of her\n\tdeparting figure.\n\nCUT TO:\n\n\tINT. HARRY'S HOTEL ROOM - DUSK\n\n\tHarry's talking on the phone while he dresses for the\n\ttheatre.\n\n\t\t\t\tHARRY\n\t\tYou're not listening to me, Loomis.\n\n\t\t\t\tCUT TO:\n\n\tINT. LOOMIS' OFFICE - MEW YORK - NIGHT\n\n\tLOOMIS, a slob of a man, is in his office, eating pizza.\n\n\tINTERCUT PHONE CONVERSATION\n\n\t\t\t\tLOOMIS\n\t\tThe case is closed. Harry. Tapert's\n\t\tgiven us a full confession.  Get\n\t\tyour ass back to Mew York.\n\n\t\t\t\tHARRY\n\t\tNo.  I'm taking a couple of weeks'\n\t\tvacation.\n\n\t\t\t\tLOOMIS\n\t\tYou never took a fucking vacation\n\t\tin your life, Harry. What's going\n\t\ton?\n\n\t\t\t\tHARRY\n\t\tI got to go.  I'm late.\n\n\t\t\t\tLOOMIS\n\t\tCall me tomorrow.\n\n\t\t\t\tHARRY\n\t\tThere's other guys as good as me,\n\t\tLoomis.\n\n\t\t\t\tLOOMIS\n\t\tYeah.  But not as cheap.  Call me.\n\n\t\t\t\tHARRY\n\t\tA couple of weeks.\n\n\t\t\t\tLOOMIS\n\t\tOne question.\n\n\t\t\t\tHARRY\n\t\tWhat?\n\n\t\t\t\tLOOMIS\n\t\tWho is she?\n\n\tHarry can't help but smile to himself.\n\n\t\t\t\tLOOMIS\n\t\tI thought so.  'Night, Harry.\n\n\tClick.  Harry puts down the phone.  Glances at himself in the\n\tmirror.  Raises a rueful eyebrow.\n\n\t\t\t\tCUT TO:\n\n\tEXT. WILTERN THEATRE - NIGHT\n\n\tCRANE DOWN from a looming STANDEE of Swann, perched above the\n\ttheatre marquee.  SPOTLIGHTS rake the skies. The sidewalk\n\tbelow is jammed with AUDIENCE MEMBERS, STAR-SPOTTERS and\n\tPHOTOGRAPHERS.  This is a flashy, prestigious event.  LIMOS\n\tare disgorging scantily- dressed STARLETS and smiling MONEY\n\tMEN; a NEWS TEAM is interviewing audience members as they\n\tfile in. \n\n\tThe atmosphere is noisy and excited.  Amid the throng, Harry. \n\tHe makes his way inside.\n\n\tINT. WILTERN THEATRE - AUDITORIUM - NIGHT\n\n\tThe atmosphere, is closer to a rock concert than a\n\tconventional stage show.  Security people with walkie-\n\ttalkies roam the aisles; the audience buzzes with barely\n\tcontrolled hysteria. \n\n\tHarry heads down the aisle, eyes on the stage.  A star-lit\n\tCURTAIN covers it.  Six rows from the stage is Dorothea,\n\talready in her seat.  She smiles lavishly, happy to see him.\n\n\t\t\t\tDOROTHEA\n\t\tI'm glad you could make it. \n\n\tHarry takes a seat beside her.\n\n\t\t\t\tHARRY\n\t\tHey, this is a big deal for me. You\n\t\tknow what seats like this cost in\n\t\tNew York?\n\n\tINT. WILTERN THEATRE - STAGE - NIGHT\n\n\tCenter-stage, behind the closed curtains, Swann is ready for\n\tthe opening of the show.  TECHNICIANS buzz around him like\n\tflies.\n\n\t\t\t\tSWANN\n\t\tValentin!\n\n\tValentin emerges from the wings, patting the PANTHER that is\n\twaiting there.\n\n\t\t\t\tSWANN\n\t\t\t(irritated)\n\t\tValentin!\n\n\t\t\t\tVALENTIN\n\t\tI'm here.\n\n\t\t\t\tSWANN\n\t\tThe guy with Dorothea.  Is that who\n\t\tI think it is? \n\n\tValentin nods.\n\n\tON SWANN, his expression unreadable.\n\n\t\t\t\tSWANN\n\t\tHe's young.\n\n\tMUSIC strikes up.  A dramatic, Wagnerian chord. Valentin\n\thurries away.  Swann's expression becomes very focused.\n\n\t\t\t\t1ST TECHNICIAN\n\t\t\t(to Swann)\n\t\tReady?\n\n\t\t\t\tSWANN\n\t\tReady.\n\n\tSwann rises up into the flies.\n\n\t\t\t\t1ST TECHNICIAN\n\t\tHow the fuck does he do that?\n\n\t\t\t\t2ND TECHNICIAN\n\t\tIt's wires, man.\n\n\t\t\t\t1ST TECHNICIAN\n\t\tI never seen no wires.\n\n\t\t\t\t2ND TECHNICIAN\n\t\t\t(sarcastic)\n\t\tSo what is it?  Magic?\n\n\tINT. WILTERN THEATRE - AUDITORIUM AND STAGE - NIGHT\n\n\tThe LIGHTS are DIMMING.  Harry glances across at Dorothea,\n\twhose gaze is intent. \n\n\tThe LIGHTS go OUT.  The MUSIC SWELLS, and the CURTAINS fly\n\tapart.  A spectacle worthy of Seigfried and Roy is about to\n\tblast our senses!  Magic for the 90's:  a wild, erotic ride\n\tinto mystery.\n\n\t\t\t\tSWANN (V.O.)\n\t\tLadies and gentlemen.  You are\n\t\tstanding on the threshold of a\n\t\tmiracle...\n\n\tA vortex of SMOKE and LIGHT swirls in the middle of the\n\tstage. \n\n\tThe vortex BLAZES -- \n\n\tAnd suddenly Swann SWEEPS DOWN out of the flies, as the floor\n\tof the stage opens and the head of a glittering, razor\n\ttoothed DRAGON emerges in a cloud of CRIMSON SMOKE. \n\n\tSwann raises his hands above his head and a SPEAR\n\tmiraculously appears in his grasp.  He descends on the\n\tdragon.  It's a classic image:  St. Michael smiting the\n\tDevil.  Swann drives the spear down the throat of the dragon. \n\tThe theatre SHAKES at its dying ROARS.  Then the head cracks\n\topen, and out of the dragon's mouth emerge a dozen scantily\n\tdressed DANCERS, male and female.  Swann throws down the\n\tspear, and where it strikes the stage his PANTHER appears. \n\n\tA ROAR of APPLAUSE from the audience.  Swann's plain white\n\ttunic falls away from him as he descends.  By the time his\n\tfeet touch the stage he is dressed in a star- shot TUXEDO. \n\tThe PANTHER licks his hand in welcome. The MUSIC comes to a\n\tcrescendo.  The DANCERS freeze in their erotic dance.  In the\n\tsudden hush, Swann speaks in a whisper.\n\n\t\t\t\tSWANN\n\t\tMy friends ... come with me...into\n\t\tthe Great Beyond.\n\n\tA barrage of LIGHTS and MUSIC erupt. \n\n\tThe AUDIENCE APPLAUDS wildly. \n\n\tON HARRY and Dorothea.\n\n\t\t\t\tHARRY\n\t\tHe's good.\n\n\t\t\t\tDOROTHEA\n\t\tYou haven't seen anything yet.\n\n\tINT. WILTERN THEATRE - LOBBY - NIGHT\n\n\tThe doors SQUEAK as a gust of WIND blows through them. \n\n\tButterfield stands in the lobby, listening to the muted\n\tSOUNDS of MUSIC and APPLAUSE.  Then he offers his ticket to\n\tthe TICKET-COLLECTOR and steps inside.\n\n\tINT. WILTERN THEATRE - AUDITORIUM AND STAGE - NIGHT\n\n\tA new musical motif hangs in the air:  MUSIC announcing\n\tdanger. \n\n\tThe AUDIENCE watches intently, nervously. \n\n\tON HARRY and DOROTHEA.\n\n\t\t\t\tDOROTHEA\n\t\t\t(a whisper)\n\t\tThis is the new illusion.\n\n\tON STAGE, Swann is bound to a spinning WHEEL, while the\n\tDANCERS, dressed like Boschian DEMONS, cavort around him,\n\tsomersaulting and leaping over eruptions of yellow FLAME. \n\tIt's a scene from Daniels Inferno.  Above him. a dozen\n\tglittering SWORDS - six feet long - are descending.  He\n\tstruggles to free himself.  The MUSIC gets more exciting as\n\tthe wheel spins faster and faster. \n\n\tSuddenly, a sword DROPS.  It falls between Swann's\n\toutstretched legs, skewering the wheel.  Then ANOTHER, close\n\tto his head. \n\n\tON HARRY.  He's tense.  Excited. \n\n\tBACK TO STAGE.  Swann is free I  He throws off the last\n\tshackle and uses it to thrust into the mechanism of the\n\twheel.  There's a theatrical BLAZE of white-hot SPARKS.\n\n\tThe wheel slows.  He starts to step off it, as another of the\n\tthe swords DROPS. \n\n\tThe AUDIENCE GASPS.  Swann smiles, and TRIPS. \n\n\tAs he FALLS, the sword runs through the middle of his back,\n\tcarrying him down to the still-spinning wheel, and pinning\n\thim there.  Some of the DANCERS continue to cavort.  Some\n\tstop. \n\n\tMore GASPS from the audience. \n\n\tON HARRY, having a -- \n\n\tFLASHBACK:  Harry's hand turns over the final tar of card. \n\tThe scene on the stage is that image coming to life. \n\n\t\t\t\tHARRY \n\t\tThere's something wrong... \n\n\tON Swann, as a second sword FALLS, skewering his thigh, and a\n\tthird, running through his buttock, and a fourth and fifth,\n\tuntil TEN SWORDS have entered his body. \n\n\tON THE AUDIENCE, not certain whether this is a trick or not.\n\n\tThe MUSIC has stopped.  In the silence, somebody GIGGLES\n\tnervously.  A couple of PEOPLE break into APPLAUSE, but it\n\tdies away in a matter of moments.\n\n\tON DOROTHEA AND HARRY\n\n\t\t\t\tDOROTHEA\n\t\tNo. . .\n\n\tON THE STAGE, Swann raises his head and looks out at his\n\twife, his eyes already glassy with imminent death.  He\n\treaches out towards her, and then sags on the wheel, dead. \n\n\tThere are GASPS now from the audience.  Murmurs of disgust;\n\tsobs of horror.\n\n\t\t\t\t1ST AUDIENCE MEMBER\n\t\tWhat happened?\n\n\t\t\t\t2ND AUDIENCE MEMBER\n\t\tIt's a trick.\n\n\t\t\t\t3RD AUDIENCE MEMBER\n\t\tSomebody help him.\n\n\tThe curtains start to close.\n\n\tON Dorothea, tears of shock filling her eyes.\n\n\t\t\t\tDOROTHEA\n\t\t\t(to Harry)\n\t\tI've got to get to him!\n\n\tThe AUDIENCE is rising now, as the horror of what they've\n\tseen sinks in.  There is panic.  A few people have fainted. \n\tOne or two are even praying. \n\n\tHarry carves out a path down to the stage for Dorothea\n\tagainst the flood of the exiting crowd.\n\n\t\t\t\tHARRY\n\t\tOut of the way!  Out of the way!\n\n\tHe helps Dorothea onto the stage, and lifts the curtain so\n\tshe can duck beneath it.\n\n\tINT. WILTERN THEATRE - STAGE - NIGHT\n\n\tChaos.  PEOPLE running, sobbing, puking; some simply standing\n\twatching.  Valentin is already at the body, with the STAGE\n\tMANAGER at his side.\n\n\t\t\t\tVALENTIN\n\t\t\t(to Stage Manager)\n\t\tGet then out of here, for God's\n\t\tsake --\n\n\t\t\t\tSTAGE MANAGER\n\t\tYou heard him!  It's not a fucking\n\t\tshow!\n\n\tHe starts to physically push the crowd back.  Harry grabs his\n\tarm.\n\n\t\t\t\tSTAGE MANAGER\n\t\tWho are you?\n\n\tHarry uses his grip to gently but efficiently move the STAGE\n\tMANAGER out of Dorothea's way.  She goes to Swann's body,\n\twhich has been removed from the wheel.\n\n\tINT. WILTERN THEATRE - AUDITORIUM - NIGHT\n\n\tThe audience is clearing now.  But Butterfield is coming\n\ttowards the stage, with an ambiguous look on his face. Is he\n\tenraged?  Or puzzled?  Or both?\n\n\t\t\t\tMILLER\n\t\tPsst!\n\n\tMiller stands at an open door, leading below the stage.\n\n\tButterfield enters.\n\n\tINT. WILTERN THEATRE - STAGE - NIGHT\n\n\tDorothea kneels at Swann's side.  A few yards from her, Harry\n\texamines the mechanism of the wheel.\n\n\t\t\t\tDOROTHEA\n\t\t\t(softly)\n\t\tSwann... \n\n\tA DOCTOR appears.\n\n\t\t\t\tDOCTOR \n\t\tI'm a doctor.  Let me through. \n\n\tThe Doctor checks Swann's body.\n\n\t\t\t\tDOCTOR\n\t\t\t(to Dorothea)\n\t\tI'm sorry...\n\n\tHarry has discovered a CABLE snaking down beside the device. \n\tHe's suspicious.  He slips round to the back of the\n\tmechanism, and climbs down beneath the stage, tracing the\n\tcable as he goes.\n\n\tWILTERN THEATRE - BELOW STAGE - NIGHT\n\n\tIt's an eerie, shadowy space, filled with the PROPS that are\n\tused in the show, including the DRAGON we saw at the\n\tbeginning.  From above we hear FOOTSTEPS and VOICES, muted\n\tand echoing. \n\n\tThe cable ends in bare wires.  Whatever was here has been\n\ttaken. \n\n\tA NOISE, behind Harry.  He swings round.  Sees a shadowy\n\tFIGURE ducking away.\n\n\t\t\t\tHARRY\n\t\tHey!\n\n\tHe gives chase.  Loses the man in the shadows.  Stops and\n\tlistens for movement. \n\n\tSuddenly, Miller steps out of the shadows with a plank of\n\twood and smashes it into Harry's face!\n\n\tHarry reels back.  Falls to his knees, BLOOD running from his\n\tnose.  Miller pulls Harry's GUN out of his jacket.\n\n\t\t\t\tMILLER\n\t\tGot you, fucker!\n\n\tHarry is facing the dragon's head, dazed.  And now, out of\n\tthe dragon's mouth, comes Butterfield. \n\n\t\t\t\tBUTTERFIELD\n\t\tWho did this, D'Amour?  Who killed\n\t\tSwann? \n\n\tHarry is barely holding on to consciousness.\n\n\t\t\t\tHARRY\n\t\tYou did.\n\t\t\t(a beat)\n\t\tDidn't you?\n\n\t\t\t\tBUTTERFIELD\n\t\tWhy would I do that?\n\n\t\t\t\tHARRY\n\t\tBeats me.\n\n\tButterfield is a foot from Harry now.\n\n\t\t\t\tBUTTERFIELD\n\t\tYou don't have a clue what you're\n\t\tinto, do you?\n\n\t\t\t\tHARRY\n\t\tDeep shit? \n\n\tButterfield hits him.\n\n\t\t\t\tBUTTERFIELD\n\t\tWho did this?\n\n\t\t\t\tHARRY\n\t\tI told you --\n\n\tButterfield hits him again.\n\n\t\t\t\tBUTTERFIELD\n\t\tWho did this?\n\n\t\t\t\tHARRY\n\t\t\t(raises his hand)\n\t\tAll right.  It was...\n\n\tButterfield comes a little closer.\n\n\t\t\t\tHARRY\n\t\t\t(feigning a near collapse)\n\t\t... it was...\n\n\tButterfield leans in.  And Harry grabs him by the balls --\n\tliterally -- rising as he does so.\n\n\t\t\t\tBUTTERFIELD\n\t\tAah!\n\n\tHarry THROWS Butterfield aside. Butterfield hits the ground\n\tin agony, and Harry swings round to protect himself from\n\tMiller, who's leveling Harry's gun. \n\n\tHe FIRES once, missing Harry by inches.  Harry catches hold\n\tof a ROPE underfoot and pulls it, tripping Miller, who\n\tTOPPLES backwards into the mouth of the dragon.  The GUN GOES\n\tOFF again, the bullet BLOWING APART the dragon's JAW\n\tMECHANISM. \n\n\tMiller starts to sit up, his body splayed between the\n\tdragon's steel teeth.  He has Harry in his sights. \n\n\t-- something CREAKS.  He looks up.  The dragon's jaw is\n\tclosing, FAST.  He starts to scramble to his feet.  Too late! \n\tThe teeth SLAM CLOSED on his body.  Sudden death. \n\n\tHarry looks round to see Butterfield retreating into the\n\tshadows.  Then he's gone.  Harry looks down at Miller's\n\tBLOOD, which is pooling around his feet.\n\n\t\t\t\tHARRY\n\t\tDeep shit...\n\n\t\t\t\tFADE OUT\n\n\t\t\t\tFADE IN\n\n\tINT. POLICE STATION - EDDISON'S OFFICE - NIGHT\n\n\tHarry sits at Eddison's desk, looking exhausted and bruised. \n\tEddison has just finished taking his statement.\n\n\t\t\t\tEDDISON\n\t\tAnd this Butterfield guy--\n\n\t\t\t\tHARRY\n\t\t--vanished.\n\n\t\t\t\tEDDISON\n\t\t\t(frustrated sigh)\n\t\tAnother fucking magician. Jesus.\n\n\tHarry looks past Eddison and sees an ashen, tearful Dorothea\n\tbeing taken into another office.\n\n\t\t\t\tHARRY\n\t\tAre you finished with me?\n\n\t\t\t\tEDDISON\n\t\tFor now.  Are you planning to go\n\t\tback to New York?\n\n\t\t\t\tHARRY\n\t\t\t(watching Dorothea)\n\t\tNo.  Not yet...\n\n\tINT. POLICE STATION - OTHER OFFICE - NIGHT\n\n\tDorothea sits alone, staring at the wall.  Harry enters.\n\n\t\t\t\tHARRY\n\t\tAre they treating you okay?\n\n\t\t\t\tDOROTHEA\n\t\t\t(nods)\n\t\tI heard what happened.  It looks\n\t\tlike somebody murdered him.\n\n\t\t\t\tHARRY\n\t\tI'm sorry I got into this too late. \n\t\tBut if you want me to stick around,\n\t\tmaybe dig where the cops don't\n\t\tlook...\n\n\t\t\t\tDOROTHEA\n\t\tI don't know where you'd start.\n\n\t\t\t\tHARRY\n\t\tWell... how about some of the other\n\t\tillusionists?\n\n\t\t\t\tDOROTHEA\n\t\tThey won't tell you anything.\n\n\t\t\t\tHARRY\n\t\tI can be very persuasive.\n\n\t\t\t\tDOROTHEA\n\t\t\t(a beat)\n\t\tYes.  I think you probably can.\n\t\t\t(another beat)\n\t\tWe'd need to talk about your fee.\n\n\t\t\t\tHARRY\n\t\tForget the fee.  If I find\n\t\tButterfield, maybe we'll talk about\n\t\tmoney.  If I don't...\n\t\t\t(he shrugs)\n\t\t...my gamble.  Either way... I\n\t\tget to spend some time... here.\n\n\tThe way he says this, it's plain \"here\" doesn't mean L.A., it\n\tmeans near -Dorothea.  And by the tiny smile on her face,\n\tit's also plain she knows it.\n\n\t\t\t\tCUT TO:\n\n\tEXT. MAGIC SHOP - HOLLYWOOD BLVD. - DAY\n\n\tNoon.  Bright sun.  Busy street.  Harry, now wearing a\n\tbandage on his cut face, enters.\n\n\tINT. MAGIC SHOP - DAY\n\n\tA wonderland for illusionists.  Books, props, masks, tricks,\n\tetc.  Two or three CUSTOMERS browse.  Harry glances at them\n\tall, then targets a MAN in late middle age, who is browsing\n\tthrough books, one-handed.  His other hand constantly\n\tmanipulates a card, concealing and revealing it in a dozen\n\tways.  He doesn't even look at his hand.  His name is WALTER\n\tWILDER. \n\n\tHarry stands beside him.  Scans the shelf.\n\n\t\t\t\tHARRY\n\t\tWhere'd you learn that?\n\n\t\t\t\tWILDER\n\t\tWhat?\n\n\t\t\t\tHARRY\n\t\t\t(points)\n\t\tThat.\n\n\t\t\t\tWILDER\n\t\tAt birth.  I don't know you --\n\n\t\t\t\tHARRY\n\t\tHarry D'Amour.\n\n\t\t\t\tWILDER\n\t\tI know all the kids coming up. Got\n\t\tto stay ahead of the game. But I\n\t\tdon't know you.\n\n\t\t\t\tHARRY\n\t\tI'm in from New York.  I came to\n\t\tsee Swann.\n\n\t\t\t\tWILDER\n\t\tWhat a tragedy.  It was just a\n\t\tmatter of time, of course, but it's\n\t\tnot good for the business.\n\n\t\t\t\tHARRY\n\t\tWas he taking a lot of risks?\n\n\t\t\t\tWILDER\n\t\tYou don't know the half of it. I'm\n\t\tWalter Wilder, by the way.\n\n\t\t\t\tHARRY\n\t\tNot the Walter Wilder? \n\n\tWalter beams.\n\n\t\t\t\tWILDER\n\t\tThe one and only. \n\n\tHe hands Harry a card.\n\n\t\t\t\tWILDER\n\t\tWant to try?\n\n\tHarry tries to emulate Wilder's card manipulation through the\n\trest of this conversation.\n\n\t\t\t\tWILDER\n\t\tYou know Vinovich?\n\n\t\t\t\tHARRY\n\t\t\t(not a clue)\n\t\tSure.  Vivovich.\n\n\t\t\t\tWILDER\n\t\tHe knew Swann way back.  He says\n\t\tthere were a lot of drugs, a lot of\n\t\tcrazy shit.\n\n\t\t\t\tHARRY\n\t\tI'd love to... you know... hang\n\t\twith some of you guys.\n\n\t\t\t\tWILDER\n\t\tPeople are pretty cagey.  Who do\n\t\tyou know?\n\n\t\t\t\tHARRY\n\t\tFor what?\n\n\t\t\t\tWILDER\n\t\tFor an introduction.\n\n\t\t\t\tHARRY\n\t\tWell... nobody.\n\n\tWilder takes a moment to assess Harry, who is attempting to\n\tmanipulate the card he's been given with charming ineptitude.\n\n\t\t\t\tWILDER\n\t\t\t(magnanimously)\n\t\tYou do now.\n\n\tEXT. MAGIC CASTLE - DUSK\n\n\tThe castle is faux, of course, but it has a Gothic charm. \n\n\tHarry and Walter wander towards the front door.  Harry is\n\tknotting a newly-bought tie.\n\n\t\t\t\tHARRY\n\t\tI only wear ties for funerals.\n\n\t\t\t\tWILDER\n\t\tYou don't get in without one. It's\n\t\tlike a gentlemen's club for\n\t\tillusionists.  Except most of us\n\t\taren't gentlemen.\n\n\tINT. MAGIC CASTLE - CORRIDORS - NIGHT\n\n\tThe interior is murky and atmospheric, the walls covered with\n\tillusionists' posters. \n\n\tWalter leads the way through the long corridors, past rooms\n\twhere illusionists are performing close-up magic for\n\taudiences of well-heeled patrons.  Walter nods and waves to\n\thalf a dozen people on their way through the house, up the\n\tstairs and towards the bar.\n\nHARRY\n\t\tAre they all in the business?\n\n\t\t\t\tWILDER\n\t\tIt's not a business. Harry. It's a\n\t\tvocation. \n\n\tWilder points to a locked door.\n\n\t\t\t\tWILDER\n\t\tThat's what they call the\n\t\tRepository.  Every magic secret\n\t\tknown to man's locked up in that\n\t\troom.\n\n\t\t\t\tHARRY\n\t\tHave you been in?\n\n\t\t\t\tWILDER\n\t\tNo.  There's only three keys.\n\t\tVinovich has got one, of\n\t\tcourse.\n\t\t\t(beat)\n\t\tHe's a little crazy, by the way. \n\t\tAnd he's a mean drunk. Otherwise,\n\t\the's a real charmer.\n\n\t\t\t\tCUT TO\n\n\tINT. MAGIC CASTLE - BAR - NIGHT\n\n\tLater.  A drunken VINOVICH is holding court.  He's in his\n\t40's:  a flamboyant and loquacious man with a heavy (and\n\tfake) middle-European accent.  At the table - besides Harry\n\tand Walter - are:  Vinovich's starlet/nymphet girlfriend\n\tLAURA; an Asian-American illusionist called BILLY WHO; and\n\ttwo of Vinovich's adoring courtiers, an overblown,\n\toverdressed female illusionist - DEBRA DEVINE - and a thin,\n\twaspish fellow in a spangly suit:  the AMAZING QUENTIN. \n\n\tIn the conversation that follows we go back to Harry\n\trepeatedly as he studies this extraordinary group.\n\n\t\t\t\tVINOVICH\n\t\tIt's more than entertainment. We're\n\t\topening people's heads up.  Putting\n\t\tmiracles back into their boring\n\t\tlittle lives.\n\n\t\t\t\tBILLY\n\t\tBut they're fake miracles.\n\n\t\t\t\tVINOVICH\n\t\tHoudini believed he had spirit\n\t\tguides.\n\n\t\t\t\tHARRY\n\t\tYou believe that?\n\n\t\t\t\tVINOVICH\n\t\tI think we walk a narrow path,\n\t\tbetween... between...\n\n\t\t\t\tHARRY\n\t\tHeaven and Hell?\n\n\tVinovich stares hard at Harry, trying to figure out whether\n\the's being sarcastic or not.\n\n\t\t\t\tVINOVICH\n\t\tTrickery and divinity.\n\n\t\t\t\tHARRY\n\t\tAre you saying that sometimes\n\t\tthe miracles are real?\n\n\t\t\t\tVINOVICH\n\t\tNo.  I'm saying they were always\n\t\tfake.  The saints, the messiahs,\n\t\tthey were just illusionists.\n\n\t\t\t\tHARRY\n\t\tSo could you walk on water?\n\n\t\t\t\tVINOVICH\n\t\t\t(deadly serious)\n\t\tI could reproduce any miracle\n\t\tthat's ever been performed, with a\n\t\tlittle preparation.\n\n\t\t\t\tHARRY\n\t\tWhat about Swann's miracles?\n\n\tThe smug smile on Vinovich's face dies.  Furtive glances are\n\texchanged around the table.  Only Billy Who makes a tiny\n\tsmile.\n\n\t\t\t\tVINOVICH\n\t\tThey weren't worth a damn.\n\n\t\t\t\tHARRY\n\t\t\t(goading)\n\t\tI heard he was the best.\n\n\t\t\t\tVINOVICH\n\t\tIf he was so good why's he so dead?\n\n\tVinovich begins to look suspicious.\n\n\t\t\t\tHARRY\n\t\tYou tell me.  No?  I thought you'd\n\t\tmaybe have a theory.\n\n\t\t\t\tVINOVICH\n\t\tOh, I've got plenty.\n\n\t\t\t\tHARRY\n\t\tI'd like to hear them. \n\n\tVinovich rises.\n\n\t\t\t\tVINOVICH\n\t\tI'm not saying another word.\n\t\t\t(to Wilder)\n\t\tYou damn fool.  He's a\n\t\tjournalist.\n\n\t\t\t\tHARRY\n\t\tJust tell me about Swann.  Or are\n\t\tyou too scared?\n\n\t\t\t\tVINOVICH\n\t\tHe was a freak.  Everything he did\n\t\twas tainted.\n\n\tHarry rises.  Looks straight at Vinovich, unintimidated.\n\n\t\t\t\tHARRY\n\t\tWith what?\n\n\t\t\t\tVINOVICH\n\t\tEvil.  He was evil.\n\t\t\t(to Laura)\n\t\tCome on.\n\n\tShe rises.\n\n\t\t\t\tVINOVICH\n\t\t\t(to the rest)\n\t\tSay nothing to this man if you wish\n\t\tto keep my company.\n\n\tHe stalks away.  Harry calls after him, across a now-\n\tsilenced bar.\n\n\t\t\t\tHARRY\n\t\tGreat accent, by the way.  Is it\n\t\tBrooklyn?\n\n\t\t\t\tVINOVICH\n\t\t\t(pure Brooklyn)\n\t\tFuck you.\n\n\tEXT. MAGIC CASTLE - PARKING LOT - NIGHT\n\n\tHarry heads to the car.\n\n\t\t\t\tBILLY (V.O.)\n\t\tHarry!\n\n\tHarry turns.  Billy approaches, glancing behind him to see\n\tthat he's not being watched.\n\n\t\t\t\tBILLY\n\t\tI gotta be careful.  If Vinovich\n\t\tsees me talking to you.  He's an\n\t\tasshole, but he's a powerful\n\t\tasshole.\n\n\t\t\t\tHARRY\n\t\tThey go together.\n\n\t\t\t\tBILLY\n\t\t\t(lowered voice)\n\t\tI've heard a name.  Someone they\n\t\ttalk about in whispers.\n\n\t\t\t\tHARRY\n\t\tWho?\n\n\t\t\t\tBILLY\n\t\tNix.\n\n\t\t\t\tHARRY\n\t\tNix?\n\n\t\t\t\tBILLY\n\t\tLike in nothing.  Nobody.  Nix.\n\n\t\t\t\tHARRY\n\t\tWho is he?\n\n\t\t\t\tBILLY\n\t\tI think maybe he taught Swann.\n\t\t\t(hands Harry a card)\n\t\tThis is me.  See ya around. \n\n\tBilly hurries away.\n\n\t\t\t\tCUT TO:\n\n\tINT. HARRY'S HOTEL ROOM - NIGHT\n\n\tHarry lies on his bed, dozing.  The CAMERA CREEPS IN on him.\n\n\t\t\t\tDOROTHEA (V.O.)\n\t\t... I want somebody who can find\n\t\tout what Philip saw in those damn\n\t\tcards... \n\n\tHarry frowns in his semi-doze.\n\n\t\t\t\tDISSOLVE TO:\n\n\tFLASHBACK - QUAID'S ROOM\n\n\t\t\t\tBUTTERFIELD\n\t\tEver watched a man die?\n\n\tThe image darkens, and fades up a beat later on Quaid.\n\n\t\t\t\tQUAID\n\t\tPlease... I wasn't there... Ask\n\t\tPimm.\n\n\t\t\t\tBUTTERFIELD\n\t\tPimm's dead.  Jennifer Desiderio's\n\t\tdisappeared...\n\n\t\t\t\tBACK TO:\n\n\tINT. HARRY'S HOTEL ROOM - NIGHT\n\n\tHarry is still asleep.\n\n\t\t\t\tCUT TO:\n\n\tFLASHBACK - QUAID'S ROOM\n\n\t\t\t\tQUAID\n\t\tI'm not afraid to die.  There's\n\t\tsomething terrible... coming\n\t\thome...\n\n\tA long silence. \n\n\tSUDDENLY, a telephone RINGS.\n\n\t\t\t\tBACK TO:\n\n\tINT. HARRY'S HOTEL ROOM - NIGHT\n\n\tHARRY sits up, shocked awake.\n\n\t\t\t\tHARRY\n\t\tShit!\n\n\tHe picks up the receiver.\n\n\t\t\t\tHARRY\n\t\tThis is D'Amour.\n \n           \n\t\t\tCUT TO:\n\n\tINT. SWANN'S MANSION - DOROTHEA'S BEDROOM - NIGHT\n\n\tShe sits up on her bed, dressed in a silk robe, and nothing\n\telse, drinking a SCOTCH, talking on the phone. The primary\n\tsource of illumination is the massive T.V. set in the wall\n\topposite the bed.\n\n\t\t\t\tDOROTHEA\n\t\tHarry... I know it's late.\n\n\tINTERCUT PHONE CONVERSATION\n\n\tThere should be a subtle eroticism pervading this exchange. \n\tBoth of them on beds, in different bedrooms. Each aroused by\n\tthe other's voice, and frustrated not to be able to see and\n\ttouch them.\n\n\t\t\t\tHARRY\n\t\tThat's okay.\n\n\tAs he speaks, Harry scrawls Jennifer Desiderio on the title\n\tpage of the Gideon's Bible beside the bed.\n\n\t\t\t\tDOROTHEA\n\t\tHow did it go today?\n\n\t\t\t\tHARRY\n\t\tI went up to the Magic Castle. You\n\t\twere right.  He didn't have a lot\n\t\tof fans up there.\n\n\t\t\t\tCUT TO:\n\n\tINT. SWANN'S MANSION - KITCHEN - NIGHT\n\n\tValentin, on the kitchen PHONE, is listening in.\n\n\t\t\t\tDOROTHEA (V.O.)\n\t\tThey were jealous of him.\n\n\t\t\t\tHARRY (V.O.)\n\t\tWhy?  Because he had you?\n\n\t\t\t\tBACK TO:\n\n\tINTERCUTTING: HARRY - DOROTHEA - VALENTIN\n\n\t\t\t\tDOROTHEA\n\t\tHe... didn't have me..  I told you-\n\n\t\t\t\tHARRY\n\t\tYou didn't marry him for love.\n\n\tDOROTHEA'S BEDROOM\n\n\tShe's a little uncomfortable now.\n\n\t\t\t\tHARRY\n\t\tSo why did you marry him?\n\n\t\t\t\tDOROTHEA\n\t\tThat's my business. Harry.\n\n\t\t\t\tHARRY\n\t\tJust curious.\n\t\t\t(a beat)\n\t\tBack to business.  Ever heard of a\n\t\tman called Nix?\n\t\t\t(silence)\n\t\tDorothea?\n\n\t\t\t\tDOROTHEA\n\t\tYes... I'm here.  And no.  I don't\n\t\tknow the name.\n\n\t\t\t\tHARRY\n\t\tWhat about Jennifer Desiderio?\n\n\t\t\t\tDOROTHEA\n\t\tIt doesn't ring a bell.  I have to\n\t\tgo.\n\n\t\t\t\tHARRY\n\t\tOkay.  I'll keep digging.\n\n\t\t\t\tDOROTHEA\n\t\t\t(uneasy)\n\t\tYes.  You do that.\n\n\tShe puts down the phone, and swallows a mouthful of scotch. \n\tShe's shaking.  She gets up.  Paces the room. Then she picks\n\tup the phone again.\n\n\tINT. HARRY'S HOTEL ROOM - NIGHT\n\n\tOn the pad beside the bed, Jennifer's name, surrounded by\n\tHarry's doodles.  The phone RINGS. \n\n\tCUT WIDE:  The room is empty.\n\n\tEXT./INT. QUAID'S OFFICES - STAIRWELL - NIGHT\n\n\tThe Tarot Card and Crystal Readings sign is dark now. Harry\n\theads up the stairs, past the PHOTOGRAPHS, to the door of\n\tQuaid's Waiting Room. \n\tIt has been locked and taped by the police.  Harry has come\n\tprepared.  He takes out a small crowbar and levers off the\n\tlocks.\n\n\tINT. QUAID'S OFFICES - WAITING/FORTUNE TELLING ROOMS - NIGHT  \n\n\tHarry enters, FLASHLIGHT on.  He crosses the Waiting Room and\n\tenters the Fortune-Telling Room where Quaid died.  On the\n\tTRACK -- a remote, eerie presence -- we hear Quaid's SOBS,\n\tMiller's SHOUTS, and, as Harry's flashlight illuminates the\n\tblood-spattered table:\n\n\t\t\t\tBUTTERFIELD (V.O.)\n\t\tIf you watch very closely, you can\n\t\tsometimes see the soul escaping.\n\n\tHarry is spooked.  He starts to search the room, opening\n\tcabinets and drawers.  Quaid's hordes of mystical bric-a-brac\n\tare stashed everywhere.  Boxes of crystals, religious\n\tstatues, elaborate cards, incense, etc.\n\n\tHe pulls open a drawer, and notices that a rosary is wedged\n\tin a niche at the base of the drawer.  He pulls the drawer\n\tout, empties its contents on the table, and examines it. \n\n\tUsing the crowbar, he forces the drawer apart.  It has a\n\tfalse bottom.\n\n\t\t\t\tHARRY\n\t\t\t(smiles)\n\t\tYes...\n\n\tIn the secret compartment, some papers and an address book. \n\tHe flicks to \"D.\"\n\n\t\t\t\tHARRY (CONT'D)\n\t\tDesiderio...\n\n\tThere it is.  Jennifer Desiderio, and an address.  He pockets\n\tthe book.  Then, sensing a presence behind him, he pulls out\n\this gun and whirls around, his flashlight beam revealing --\n\n\t-- Valentin!\n\n\t\t\t\tHARRY (CONT'D)\n\t\tWhat the fuck are you doing here?\n\n\t\t\t\tVALENTIN\n\t\tLooking for you.  I tried the\n\t\thotel.\n\n\t\t\t\tHARRY\n\t\tWhy'd you come here?\n\n\t\t\t\tVALENTIN\n\t\tYou're a detective, with no clues. \n\t\tWhere else are you going to look? \n\t\tI'm going to keep this brief.\n\t\t\t(he takes out an envelope)\n\t\tHere's thirty thousand dollars.\n\n\t\t\t\tHARRY\n\t\tWhat for?\n\n\t\t\t\tVALENTIN\n\t\tA ticket home,\n\n\t\t\t\tHARRY\n\t\tYou didn't hire me.  She did.\n\t\tIf she wants me off the job, I\n\t\twant to hear it from her.\n\n\t\t\t\tVALENTIN\n\t\tShe doesn't want to see you. She's\n\t\thad enough pain.  Enough churning\n\t\tover the past.  She wants it all\n\t\tleft alone.\n\n\t\t\t\tHARRY\n\t\tLeft alone?  Somebody's been\n\t\tmurdered.\n\n\t\t\t\tVALENTIN\n\t\tYes.  It's regrettable\n\n\t\t\t\tHARRY\n\t\tFuck regrettable!  I want to know\n\t\twhy.\n\n\t\t\t\tVALENTIN\n\t\tWhat for?  You need to stay busy?\n\n\t\t\t\tHARRY\n\t\t\t(a confession)\n\t\tI like to know why things happen.\n\n\t\t\t\tVALENTIN\n\t\tWhy people die?\n\t\t\t(shakes his head)\n\t\tGive it up, D'Amour.  Go home.\n\n\t\t\t\tHARRY\n\t\tNo.\n\n\tHarry crosses to the door, brushing past Valentin.\n\n\t\t\t\tVALENTIN\n\t\tDon't try and see her, D'Amour.\n\t\tJust leave her alone.  Let her\n\t\theal.\n\n\tHe glances back at Valentin.\n\n\t\t\t\tHARRY\n\t\tLock up, will you?\n\n\t\t\t\tCUT TO:\n\n\tEXT. ST. LUKE'S SANITORIUM, PASADENA - DAY\n\n\tON THE ADDRESS BOOK, in Harry's hands.\n\n\tHarry looks up - with some surprise - not at a house but at a\n\tbuilding, the sign on which reads, \"St. Luke's Sanitorium\".\n\n\tINT. ST. LUKE'S SANITORIUM - DAY\n\n\tThe place is bland and functional throughout, the walls\n\tdecorated with sun-faded reproductions of great paintings. \n\tNothing disturbing.  Harry is talking to D.A. TOFFLER -\n\tblack, fortyish, softly spoken - and a Nurse.\n\n\t\t\t\tTOFFLER\n\t\tJennifer's only ever had one\n\t\tvisitor.\n\n\t\t\t\tHARRY\n\t\tA Mister Quaid?\n\n\t\t\t\tTOFFLER\n\t\tRight.  And he's dead, isn't he?  I\n\t\tsaw it on the news. Jennifer\n\t\tdoesn't know.  And frankly, this\n\t\tisn't the best tine for her to be\n\t\ttold.\n\n\t\t\t\tHARRY\n\t\tI won't say anything.\n\n\tINT. ST. LUKE'S SANITORIUM - CORRIDORS AND WARD - DAY\n\n\tToffler excorts Harry through -the place.  There are\n\tdistressing scenes on every side.  Nothing melodramatic no\n\tscreaming, no fits.  Just a subtle, pervasive air of despair. \n\tBlank, empty FACES in blank, empty rooms.\n\n\t\t\t\tTOFFLER\n\t\tJennifer's been with us four years. \n\t\tShe was coming on nicely. \n\t\tBut just the last month or so,\n\t\tshe's worse than ever.\n\n\t\t\t\tHARRY\n\t\tWhat's her problem?\n\n\t\t\t\tTOFFLER\n\t\tShe has no real grip on reality.\n\n\t\t\t\tHARRY\n\t\t\t(a joke)\n\t\tDoes anybody?\n\n\t\t\t\tTOFFLER\n\t\t\t(deadly serious)\n\t\tOh yes.  We have to agree what's\n\t\treal and what's not. That's what\n\t\tholds us together.\n\n\t\t\t\tHARRY\n\t\tAnd what does Jennifer think's\n\t\treal?\n\n\tThey've come to french windows, which are wide open. Sitting\n\toutside in the sun is Jennifer, with her back to us.\n\n\t\t\t\tTOFFLER\n\t\t\t(quietly)\n\t\tJennifer thinks the Devil's coming\n\t\tfor her.\n\t\t\t(louder)\n\t\tJennifer?\n\n\tJennifer turns.  She looks terrible.\n\n\tEXT. ST. LUKE'S SANITORIUM - GROUNDS - CITY STREET - DAY\n\n\tHarry and Jennifer walk amongst the flower-beds, with the\n\tNurse keeping a watch from a discreet distance. Throughout\n\tthe scene we HEAR the SOUND of earth being dug, which\n\tsteadily gets louder as they walk.\n\n\t\t\t\tJENNIFER\n\t\tHave we met before?\n\n\t\t\t\tHARRY\n\t\tNo.\n\n\t\t\t\tJENNIFER\n\t\tOnly I forget.  They give me pills,\n\t\tyou know, to keep me... even...\n\t\tand... I forget things,\n\n\t\t\t\tHARRY\n\t\tWell, you didn't forget me.  I just\n\t\tcame because I wanted to know if\n\t\tyou knew a man called Butterfield.\n\n\t\t\t\tJENNIFER\n\t\tMaybe... I... don't...\n\n\t\t\t\tHARRY\n\t\tWhat about Philip Swann?\n\n\t\t\t\tJENNIFER\n\t\tI knew Swann.\n\t\t\t(sudden vehemence)\n\t\tHe's a fucking liar.\n\n\tA WORKMAN saunters past, carrying pipes.\n\n\t\t\t\tHARRY\n\t\tWhy's that?\n\n\t\t\t\tJENNIFER\n\t\tHe said he knew how to protect us. \n\t\tBut he didn't know anything.  He\n\t\tmade us think it was over and done\n\t\twith.\n\n\t\t\t\tHARRY\n\t\tWhat is?\n\n\t\t\t\tJENNIFER\n\t\t\t(tears nearing)\n\t\tI don't want to think about it. If\n\t\tI think about it he'll hear me. \n\t\tHe'll find me.\n\n\t\t\t\tHARRY\n\t\tSwann?\n\n\tAhead now, the site where the workmen are digging a hole,\n\tlaying pipes.  The CAMERA doesn't focus on this action, but\n\twe're aware of it.\n\n\t\t\t\tJENNIFER\n\t\tI told you.  I don't --\n\n\tShe stops.  Looks ahead of her.  Her face is suddenly ashen\n\tand clammy.  Harry follows her gaze to: \n\n\tThe hole.  Somebody is in it, digging.  Earth emerges in\n\tshovelfuls, piling up beside the hole.\n\n\t\t\t\tJENNIFER (CONT'D)\n\t\t\t(screaming)\n\t\tGod no!  Oh God no!\n\n\tShe backs away from the hole.  The Nurse grabs hold of her.\n\n\t\t\t\tNURSE\n\t\tCalm down!\n\n\tShe delivers the Nurse a backhand SWIPE.  The Nurse is flung\n\tback.\n\n\t\t\t\tJENNIFER\n\t\tHe's not going to get me!\n\n\tShe races down towards the street.  Harry goes after her.\n\n\t\t\t\tJENNIFER (CONT'D)\n\t\tHe's not!  He's not!\n\n\t\t\t\tHARRY\n\t\tWho's not? \n\n\tHe catches up with her.\n\n\t\t\t\tJENNIFER\n\t\tNix! Nix!\n\n\t\t\t\tHARRY\n\t\tIs he the Puritan?\n\n\t\t\t\tJENNIFER\n\t\tYes! Yes!\n\n\t\t\t\tHARRY\n\t\tAnd he's dead?\n\n\t\t\t\tJENNIFER\n\t\tNo.  He's coming back.  He's\n\t\tdigging his way out!\n\n\tThe Nurse appears behind Harry.\n\n\t\t\t\tNURSE\n\t\tI'll take care of her now.\n\n\tJennifer struggles in Harry's grip.\n\n\t\t\t\tNURSE\n\t\tLet go of her, Mr. D'Amour!\n\n\tThe Nurse breaks Harry's hold on Jennifer, who slips away\n\tinstantly, racing towards the street.\n\n\t\t\t\tHARRY\n\t\tJennifer!\n\n\tShe scrambles up over a wall, and flings herself from the\n\ttop.  There's a SCREECH of brakes, then the smashing of\n\tmetalwork and glass.  Harry gets to the wall before the\n\tNurse.  Hoists himself up onto it.  Looks down.\n\n\tHARRY'S P.O.V. OF STREET\n\n\tJennifer is dead in the middle of the street, beneath the\n\twheels of a car.  The DRIVER is out, and yelling\n\tincoherently. \n\n\t\t\t\tHARRY\n\t\tJesus.\n\n\tHe slips back down the wall, and leans against it.\n\n\tHe looks towards the hole.  The Workman has stopped digging. \n\tHis mud-encrusted hands emerge, and for a moment, before his\n\thead appears, the image is eerily like somebody climbing from\n\ta grave.  Harry closes his eyes.\n\n\t\t\t\tHARRY\n\t\t\t(very quietly)\n\t\tJesus.\n\n\tEXT. LOS ANGELES - DUSK\n\n\tThe sun is setting, the city giving way to night.\n\n\tINT. HARRY'S HOTEL ROOM - DUSK\n\n\tHarry's on the phone.\n\n\n\n\t\t\t\tHARRY\n\t\tI want to speak to Dorothea.\n\n\t\t\t\tVALENTIN (V.O.)\n\t\tI'm afraid she's not in.\n\n\t\t\t\tHARRY\n\t\tWhen will she be in?\n\n\tINT. SWANN'S MANSION - STUDY - NIGHT\n\n\tValentin on the phone in the study.\n\n\t\t\t\tDOROTHEA\n\t\tWho is it?\n\n\tValentin puts the phone down.\n\n\t\t\t\tVALENTIN\n\t\tCrank call.  I'll get the number\n\t\tchanged.\n\n\t\t\t\tDOROTHEA\n\t\tNo word from D'Amour?\t\t\t    \n\n\tValentin shakes his head.\n\n\t\t\t\tVALENTIN\n\t\tIt's better he's gone.  He would\n\t\thave done more harm than good.\n\n\t\t\t\tDOROTHEA\n\t\tHarm to whom?  Me?  I don't think,\n\t\tso.  Try him again at the hotel.\n\n\t\t\t\tVALENTIN\n\t\tI left three messages already.\n\n\tDorothea nods, plainly sad at Harry's desertion.  She turns\n\tand leaves the room.\n\n\tINT. HARRY'S HOTEL ROOM - NIGHT\n\n\tON BILLY WHO'S CARD, in Harry's hand.\n\n\t\t\t\tHARRY\n\t\t\t(on phone)\n\t\tBilly?  It's Harry.  Suppose I\n\t\twanted to get into the repository\n\t\tat the Magic Castle?\n\n\t\t\t\tCUT TO:\n\n\tINT. MAGIC CASTLE - SKYLIGHT ROOM - NIGHT        \n\n\tTHE PLACE IS EERIE BY NIGHT:  ALL MASKS AND SHADOWS. \n\n\tPAN UP TO THE SKYLIGHT.  HARRY IS CUTTING AWAY A PANE OF\n\tGLASS.  BILLY'S BEHIND HIM.  THE PANE STARTS TO FALL. WITH\n\tLIGHTNING REFLEXES, BILLY REACHES THROUGH AND CATCHES IT.\n\n\t\t\t\tHARRY\n\t\tYou've done this before.\n\n\t\t\t\tBILLY\n\t\tI've had my moments.\n\n\tINT. MAGIC CASTLE - HALLWAY OUTSIDE REPOSITORY - NIGHT\n\n\tHarry's manipulating the lock.\n\n\t\t\t\tBILLY\n\t\tI'm sure they'll have this place\n\t\trigged.\n\n\t\t\t\tHARRY\n\t\tHow?\n\n\t\t\t\tBILLY\n\t\tIt'll be something hokey. \n\n\tCLICK! The door opens.\n\n\t\t\t\tBILLY\n\t\tHoudini'd been proud of you.\n\n\tINT. MAGIC CASTLE - REPOSITORY - NIGHT\n\n\tUndusted shelves piled high with manuscripts, old books, and\n\tposters in every direction.\n\n\t\t\t\tBILLY\n\t\t\t(impressed)\n\t\tWhoa...\n\n\tOn the wall, plaster LIFE-MASKS.  In glass cases, the tools\n\tof the great magicians:  KNIVES, KEYS, GUNS, WANDS, even an\n\tIRON MAIDEN.  Billy is in awe.  He wanders around wide-eyed\n\twhile Harry scans the shelves. The dialogue runs as they\n\tinvestigate.\n\n\t\t\t\tBILLY\n\t\tI hear Mrs. Swann's quite a babe.\n\n\t\t\t\tHARRY\n\t\tYou heard right.\n\n\t\t\t\tBILLY\n\t\tYou ever been married?\n\n\t\t\t\tHARRY\n\t\tYeah.  She was killed in a car\n\t\tcrash.  Her lawyer was driving. She\n\t\twas filing for divorce.\n\n\t\t\t\tBILLY\n\t\tWhy?\n\n\t\t\t\tHARRY\n\t\tMy life was too weird for her.\n\n\t\t\t\tBILLY\n\t\t\t(grinning)\n\t\tI love weird.\n\n\tHarry has seen a small SIGIL carved onto one of the shelves.\n\n\t\t\t\tHARRY\n\t\tBilly?  This was on Miller's\n\t\tforehead.  Any idea what it is?\n\n\t\t\t\tBILLY\n\t\tNope.\n\n\tHarry presses it.  The entire bookcase opens up, CREAKING.\n\n\t\t\t\tBILLY\n\t\tWhat did I tell you?  So fucking\n\t\thokey.\n\n\tInside, there is a small shelf.  On it, FILES and PAPERS.\n\n\t\t\t\tHARRY\n\t\tWhat have we got here?\n\n\tEver-eager, Billy steps into the recess.  And -- \n\n\ttwo spiked, latticed gates close on his arm! \n\n\tHarry grabs the gates before they snap closed, inches from\n\tskewering Billy's flesh and bone!  He keeps them open, his\n\tsinews straining.\n\n\t\t\t\tHARRY\n\t\tGrab the files!\n\n\tBilly reaches in and pulls out a handful of the files. As he\n\tsteps out of range. Harry lets go and the gates close with a\n\tCLANG!\n\n\t\t\t\tBILLY\n\t\tJesus!\n\n\tHe slams the files down.  He's trembling.\n\n\t\t\t\tBILLY\n\t\tI could have lost my fucking hands.\n\n\t\t\t\tHARRY\n\t\tThat would have kept you out of the\n\t\tMagic Circle.\n\t\t\t(he studies the files)\n\t\tWhich was presumably the idea.\n\t\t\t(a beat)\n\t\tThese are about Nix.\n\n\tHarry takes a sheaf of papers, and hands them to Billy.\n\n\t\t\t\tHARRY\n\t\tYou go through these.  Go on!\n\n\tReluctantly, Billy does so.  Harry picks up a faded\n\tPHOTOGRAPH of the doorway to Nix's HOUSE (with the sigil\n\tpainted on it) and BUTTERFIELD the child standing in the sun. \n\tThere are other CULTISTS standing around.  And in the DOORWAY\n\t-- a barely visible figure (and all the more intimidating for\n\tthat) - is NIX.\n\n\t\t\t\tHARRY\n\t\tWait a minute...\n\n\tHe stares at the boy's face.  The eyes are clearly different\n\tcolours.\n\n\t\t\t\tHARRY\n\t\tThat's Butterfield...\n\n\t\t\t\tBILLY\n\t\t\t(points to nan in)\n\t\tdoorway)\n\t\tAnd who's that?\n\n\tON HARRY, staring at the ambiguous presence. \n\n\tON THE PHOTOGRAPH of the shadowy figure.\n\n\t\t\t\tHARRY\n\t\tAt a guess?  The Puritan.  Nix.\n\n\tBilly picks up an ETCHING, water-stained and dirty.  It shows\n\ta horror we recognize:  a man's HAND pressed into the FLESH\n\tof another man's HEAD.\n\n\t\t\t\tBILLY\n\t\tTake a look at this.\n\n\t\t\t\tHARRY\n\t\t\t(looking at it)\n\t\tA Nix specialty?\n\n\tBilly is getting subtly spooked now.  He puts the etching\n\tdown and starts to go through others in the series.  We\n\tglimpse them as he does so.  In one, a MAN regurgitates a\n\tserpentine form made of FLAME.  In another, a MAN stares at\n\this own HAND which is STRIPPED OF FLESH.  There is no bone\n\tbeneath.  Only a form of solid blackness.  In a third, we see\n\ta HEAD with a slit in the middle of the brow, emanating\n\tDARKNESS.\n\n\t\t\t\tBILLY\n\t\tI don't know any of these tricks...\n\n\tHarry studies the etchings.\n\n\t\t\t\tHARRY\n\t\t\t(a slow burn)\n\t\tMaybe they're not tricks.\n\n\t\t\t\tBILLY\n\t\t\t(mystified)\n\t\tI mean, there's no instructions--\n\t\t\t(realizes what Harry said)\n\t\tWhat do you mean, they're not\n\t\ttricks?\n\n\t\t\t\tHARRY\n\t\tWhat did Vinovich say? Something\n\t\tabout walking a path between --\n\n\t\t\t\tBILLY\n\t\tTrickery and divinity.  Yeah, he\n\t\tsays that all the time.\n\n\t\t\t\tHARRY\n\t\tThat's because he knew.  He'd seen\n\t\tthese files and knew.\n\n\t\t\t\tBILLY\n\t\tKnew what?\n\n\tOut of the corner of his eye. Harry sees a motion between the\n\tbook-stacks.  Billy frowns.  Harry puts his fingers to his\n\tlips.  Gestures for Billy to take cover. Billy backs away. \n\tHarry slowly turns in the direction of the motion. \n\n\tSomething eerily sepulchral is gliding between the stacks.  A\n\tfigure in a straight-jacket with his head bowed.\n\n\tHarry takes out his gun. \n\n\tBilly disappears around the back of one of the stacks. Harry\n\tgoes after the apparition. \n\n\tThe TRACK is completely silent. \n\n\tSuddenly, the creature appears behind Billy!  It looks up,\n\tits face that of a psychotic:  burning eyes, manic smile. \n\n\tIt tears open its straight-jacket and reaches for Billy, who\n\tbacks away.\n\n\t\t\t\tBILLY\n\t\tHarry!\n\n\tBooks tumble on top of Billy as he stumbles against the\n\tshelves.\n\n\t\t\t\tBILLY\n\t\tWhere the fuck are you?\n\n\tHarry appears, and puts his gun to the PSYCHO'S head.\n\n\t\t\t\tHARRY\n\t\tOkay.  Hold it right there.\n\n\tThe gun goes through the Psycho's skull, as though it's made\n\tof smoke. \n\n\tHarry waves his hands through it.  It's completely ethereal. \n\n\tBut it's still terrorizing Billy.\n\n\t\t\t\tBILLY\n\t\t\t(in mortal terror)\n\t\tGet it off me!\n\n\tHarry glances around.  Sees a LIGHT flickering between some\n\tbooks.  FIRES at it.  The light goes out.  The \"Psycho\"\n\tvanishes.  Billy is left hyper-ventilating on the ground.\n\n\t\t\t\tHARRY\n\t\tHokey enough for you?\n\n\t\t\t\tBILLY\n\t\tI'm out of here, man!  Are you\n\t\tcoming?\n\n\tHarry picks up a handful of papers from the Nix file.\n\n\t\t\t\tHARRY\n\t\tI'm coming.\n\n\tBilly is already out of the room.  For a moment. Harry pauses\n\tto look back at the other files, sealed behind the spiked\n\tgates. \n\n\tAs he does so --\n\n\t-- the proiector sparks into life one last time, and the\n\t\"Psycho\" appears --ROARING - at Harry's shoulder.\n\n\t\t\t\tHARRY\n\t\tAh, shaddup!\n\n\tHe FIRES at the projector a second time.\n\n\tOn the GUN SHOT --\n\n\t\t\t\tCUT TO:\n\n\tEXT. MAGIC CASTLE - NIGHT\n\n\tBilly and Harry are parting.\n\n\t\t\t\tHARRY\n\t\tThanks, Billy.\n\n\t\t\t\tBILLY\n\t\tHey, anytime.\n\t\t\t(a beat)\n\t\tActually, no.  This was enough. \n\n\tThey shake, and part.\n\n\tEXT. SWANN'S MANSION - FRONT DOOR - NIGHT\n\n\tHarry waits on the doorstep.  Valentin opens the door.\n\n\t\t\t\tVALENTIN\n\t\t\t(quietly)\n\t\tI can't let you in.\n\n\t\t\t\tHARRY\n\t\t\t(stepping in)\n\t\tYeah, I know.\n\n\t\t\t\tVALENTIN\n\t\tYou want more money, is that it?\n\n\tHarry pushes him aside.\n\n\tINT. SWANN'S MANSION - VARIOUS - NIGHT\n\n\tHarry starts to go through the house, opening doors.\n\n\t\t\t\tHARRY\n\t\tDorothea?\n\n\tHe sees candle-light through a partially open door. Starts\n\ttowards it.\n\n\t\t\t\tVALENTIN\n\t\tLeave her alone --\n\n\t\t\t\tHARRY\n\t\tShut up!\n\n\tHe pushes open the door.\n\n\tINT. SWANN'S MANSION - CASKET ROOM - NIGHT\n\n\tThe room is a museum of Swarm's career.  Posters, and\n\tmemorabilia everywhere.  And in the middle of the room,\n\tSwann's sealed CASKET, surrounded by flowers and candles. \n\tDorothea is standing beside it, head bowed.\n\n\t\t\t\tDOROTHEA\n\t\tThis is the way he wanted it... no\n\t\tautopsy, no embalming. Nobody\n\t\tmeddling with his body...\n\n\tHarry approaches, slowly.\n\n\t\t\t\tDOROTHEA\n\t\tFlesh is a trap.  That's what he\n\t\tused to say.  Flesh is a trap and\n\t\tmagic sets us free.\n\t\t\t(a beat)\n\t\tWhy did you come back?\n\n\t\t\t\tHARRY\n\t\tI didn't leave.  I was just digging\n\t\taround.\n\n\tDorothea looks up at him.\n\n\t\t\t\tDOROTHEA\n\t\t\t(uneasy)\n\t\tWhat did you find?\n\n\t\t\t\tHARRY\n\t\tJennifer Desiderio, for one.\n\t\t\t(he watches her for a\n\t\tresponse)\n\t\tShe threw herself in front of a car\n\t\tthis afternoon.\n\n\tDorothea can't disguise her distress.\n\n\t\t\t\tDOROTHEA\n\t\tOh Christ.\n\n\t\t\t\tHARRY\n\t\t\t(a beat)\n\t\tWhy don't you tell me the truth?\n\n\tINT. SWANN'S MANSION- STUDY-- NIGHT-\n\n\tDorothea pours herself a drink, while Harry spreads the\n\tPHOTOS and the PAPERS from the repository on the table.\n\n\t\t\t\tHARRY\n\t\tNix ran some kind of cult, right? \n\t\tSome kind of Charlie Manson deal?\n\n\t\t\t\tDOROTHEA\n\t\tIt was more than that, I think.\n\n\t\t\t\tHARRY\n\t\tHe was the real thing, right?\n\n\t\t\t\tDOROTHEA\n\t\tSwann said he could do stuff, yes.\n\n\t\t\t\tHARRY\n\t\tStuff?\n\n\t\t\t\tDOROTHEA\n\t\tHe could get into people's heads. \n\t\tMake them see things. Terrible\n\t\tthings.  And he could levitate. \n\t\tJuggle fire.\n\n\t\t\t\tHARRY\n\t\tHe taught all this to Swann?\n\n\t\t\t\tDOROTHEA\n\t\tSome or it.\n\n\tINT. SWANN'S MANSION - HALLWAY OUTSIDE STUDY - NIGHT\n\n\tValentin is listening at the door.\n\n\tINT. SWANN'S MANSION- STUDY-- NIGHT-\n\n\t\t\t\tHARRY\n\t\tSo Swann was performing magic. not\n\t\tillusions?\n\t\t\t(Dorothea nods)\n\t\tAnd what?  You thought he should be\n\t\tusing it to cure cancer, not making\n\t\tmillions.\n\n\t\t\t\tDOROTHEA\n\t\tI told you --\n\n\t\t\t\tHARRY\n\t\tToo much fame.  Yeah, I guess\n\t\tthat'd turn anybody's head.\n\t\tIncluding yours.\n\n\t\t\t\tDOROTHEA\n\t\tNo.\n\n\t\t\t\tHARRY\n\t\tYou said you weren't with him for\n\t\tlove.\n\n\t\t\t\tDOROTHEA\n\t\tI wasn't.\n\n\t\t\t\tHARRY\n\t\t What then?\n\n\t\t\t\tDOROTHEA\n\t\tI was grateful to him.  I owed him\n\t\tmy life.  And he loved me. He\n\t\tcouldn't always show it, but he\n\t\tfelt it.\n\n\t\t\t\tHARRY\n\t\tHe thought Nix was coming back,\n\t\tdidn't he?\n\n\tDorothea is pouring herself another drink.  The glass slips\n\tfrom her hand.  It SHATTERS.  Harry goes to help her.  They\n\tstoop together, very close.  The sexual attraction is almost\n\tpalpable. Dorothea cuts herself on a shard of glass.\n\n\t\t\t\tDOROTHEA\n\t\tShit!\n\n\tThey are very close to each other.\n\n\t\t\t\tHARRY\n\t\t\t(reassuring)\n\t\tIt's okay.\n\n\t\t\t\tDOROTHEA\n\t\tNo it isn't.  You can't help me.\n\n\t\t\t\tHARRY\n\t\t\t(tenderly)\n\t\tI'm here, aren't I?\n\n\tHe kisses her.  She kisses him back, hard.\n\n\t\t\t\tHARRY\n\t\tNothing's going to happen to you.  \n\n\t\t\t\tDOROTHEA\n\t\t\t(seductive)\n\t\tNothing?\n\n\t\t\t\tHARRY\n\t\t\t(smiles)\n\t\tNothing you don't want. \n\n\tThey kiss again, passionately.\n\n\tINT. SWANN'S MANSION - LOBBY - NIGHT\n\n\tValentin breaks into the shadows, as Harry and Dorothea cross\n\tthe darkened lobby and head upstairs.  Then Valentin crosses\n\tto the phone and dials.\n\n\tINT. SWANN'S MANSION - DOROTHEA'S BEDROOM - NIGHT\n\n\tA room of illusions.  Walls lined with mirrors, and warm,\n\tflattering lighting, bathing the naked forms of Dorothea and\n\tHarry as they make love, sitting on the floor.\n\n\tIt is a deeply passionate, but slow, sensual coupling.\n\n\tINT./EXT. SWANN'S MANSION - LOBBY - NIGHT\n\n\tValentin opens the front door.  There's a wind blowing. The\n\tpalms churn against the night sky...\n\n\tINTERCUT\n\n\tRoiling, wind-filled pains with the glistening, urgent bodies\n\tof Harry and Dorothea.\n\n\tINT. SWANN'S MANSION - DOROTHEA'S BEDROOM - NIGHT\n\n\tHarry cradles Dorothea in post-coital languor.\n\n\t\t\t\tDOROTHEA\n\t\t\t(whispers)\n\t\tI was so afraid.\n\n\t\t\t\tHARRY\n\t\tDon't be.  Nix can't hurt you now.\n\n\t\t\t\tDOROTHEA\n\t\tAre you sure?\n\n\t\t\t\tHARRY\n\t\tI'm sure.\n\t\t\t(kisses her)\n\t\tHe's dead.\n\n\t\t\t\tDOROTHEA\n\t\tI know.  I'm the one who shot\n\t\thim.\n\n\tON HARRY. He's startled, to say the least.\n\n\t\t\t\tDOROTHEA\n\t\tI was twelve.  Nix took me hostage,\n\t\tto get Swann to come to him.\n\n\t\t\t\tHARRY\n\t\t\t(realizing)\n\t\tAnd they all came...\n\n\t\t\t\tDOROTHEA\n\t\tYes.\n\n\t\t\t\tHARRY\n\t\tQuaid and Jennifer--\n\n\t\t\t\tDOROTHEA\n\t\tAnd Pimm and Swann.  Only Nix was\n\t\tready for them.\n\n\tThere's a NOISE downstairs.\n\n\t\t\t\tDOROTHEA\n\t\t\t(nervous)\n\t\tWhat was that?\n\n\t\t\t\tHARRY\n\t\tIt's okay. \n\n\tHarry slips out of bed.\n\n\tINT. SWANN'S MANSION - STAIRS - LOBBY - NIGHT\n\n\tHarry descends the stairs, buttoning up his trousers (which\n\tis all he wears).  He has his gun.\n\n\t\t\t\tHARRY\n\t\tValentin? \n\n\tDorothea appears behind him.\n\n\t\t\t\tDOROTHEA\n\t\tHarry?  Wait!\n\n\tHarry's at the bottom of the stairs now.  Across the hall, in\n\ta passageway, an eerie SILHOUETTE.  We can make out no detail\n\tof clothing or face.\n\n\t\t\t\tHARRY\n\t\tWhat the hell-?\n\n\tSuddenly, the shadowy FIGURE comes at Harry.  A BLAST of\n\tENERGY bursts against Harry's face.  As it breaks against his\n\tskin, we see (for three frames or so) a glimpse of Harry's\n\tskull.\n\n\t\t\t\tHARRY\n\t\t\t(in pain)\n\t\tAah!\n\n\tHarry FIRES at the figure.  The shadows fold up around the\n\tStranger like an origami puzzle.  He's gone.\n\n\t\t\t\tDOROTHEA\n\t\tIt's him!  It's Nix!\n\n\tHarry goes out into the passageway.\n\n\t\t\t\tHARRY\n\t\tValentin!  Get some lights on!\n\n\tAs if in reply to the command, a burst of vivid white FIRE\n\terupts behind Harry.  He swings round to see the Stranger\n\t\"unfolding\" out of the shadows again, defying physics and\n\tphysiology to do so.  The FIRE is at his feet, like a serpent\n\twrithing on the ground.  It comes at Harry.  Harry FIRES at\n\tit, but it comes at him faster still, rising to burn Harry's\n\tleg.  He retreats, the FIRE racing after him. He makes for a\n\tdoor, and flings it open.  He's in -- \n\n\tINT. SWANN'S MANSION - CASKET ROOM - NIGHT     \n\n\tThe FIRE follows him across the ground and STRIKES his hand. \n\tHarry drops the GUN.  Looks up to see the Stranger in the\n\tdoorway, arm raised to will the fire-serpent on.  But then,\n\the hesitates.  Harry glances round, and sees that the\n\tStranger - whose face is still a dark smear - is staring at\n\tthe CASKET.\n\n\t\t\t\tHARRY\n\t\tSomebody you know?\n\n\tDorothea appears behind the Stranger.  Sees Harry, burned and\n\tsweating, cornered against the casket.\n\n\t\t\t\tDOROTHEA\n\t\tOh my God!\n\n\tThe Stranger looks round.  Harry snatches up the GUN,\n\tsupporting his burned hand with -his good hand.  Levels the\n\tgun at the Stranger.  The FIRE raises its head, like a cobra.\n\n\t\t\t\tHARRY\n\t\tWhich goes first?  My face or\n\t\tyour heart?\n\n\tThe Stranger draws a deep breath.  The Fire-Serpent withers\n\tand dies.\n\n\t\t\t\tDOROTHEA\n\t\tWho in God's name are you?\n\n\tShe reaches for the Stranger, who simply folds up again; gone\n\tinto darkness.  The WIND blows through the house, masking his\n\texit.\n\n\t\t\t\tDOROTHEA\n\t\tAre you all right?\n\n\t\t\t\tHARRY\n\t\tFind Valentin!  Find him!  Get him\n\t\tin here!\n\n\tDorothea disappears.  Harry takes one of the candle-holders\n\tand jams it under the casket lid.  Wood splinters.  He starts\n\tto force off the lid. \n\n\tValentin and Dorothea enter.\n\n\t\t\t\tVALENTIN\n\t\tWhat are you doing?  This is\n\t\tsacrilege.\n\n\tHe starts towards Harry.  Dorothea goes after him and catches\n\thold of his arm.  Her expression is a mingling of fascination\n\tand dread, as Harry gets his fingers under the casket lid and\n\tpulls. \n\n\tInside, Swann's corpse.\n\n\t\t\t\tVALENTIN\n\t\tAre you satisfied now?\n\n\t\t\t\tHARRY\n\t\tNo.\n\n\tHarry holds Valentin back with one hand, and puts his finger\n\tinto the corpse's mouth.\n\n\t\t\t\tDOROTHEA\n\t\tHarry?\n\n\t\t\t\tHARRY\n\t\tIt's all right.  It's not\n\t\thurting...\n\n\tHe now has four fingers in Swann's mouth and seizes hold of\n\this lower jaw.  It cracks -- \n\n\t-- and comes away in a little rain of plaster and latex.\n\n\t\t\t\tHARRY\n\t\t...plaster doesn't bleed.\n\n\tHe tosses the jaw to Valentin.\n\n\t\t\t\tHARRY\n\t\t\t(to Dorothea)\n\t\tIt looks like you're not a widow\n\t\tafter all.\n\n\tINT. SWANN'S MANSION - STUDY - NIGHT\n\n\tHarry interrogates Valentin in a white fury, while Dorothea\n\tbinds Harry's hand.\n\n\t\t\t\tHARRY\n\t\tYou rigged the illusion to fail,\n\t\tright?\n\n\t\t\t\tVALENTIN\n\t\tYes.\n\n\t\t\t\tHARRY\n\t\tYou paid off the doctor.  You set\n\t\tup the fake body.  Yes?\n\n\t\t\t\tVALENTIN\n\t\tYes.\n\n\t\t\t\tHARRY\n\t\tAnd then... because I was\n\t\tgetting too close to something --\n\t\t\t(at Dorothea)\n\t\t--or someone, you called Swann\n\n\t\t\t\tVALENTIN\n\t\tI tried to pay you off.\n\n\t\t\t\tHARRY\n\t\tWas that Swann's idea?\n\n\t\t\t\tVALENTIN\n\t\tNo.  It was mine.  I didn't want\n\t\tany more bloodshed. That's why we\n\t\twent to all this trouble, so\n\t\tthere'd be no one for Nix to come\n\t\tafter.\n\n\t\t\t\tHARRY\n\t\tNix is dead and buried, for\n\t\tfuck's sake.\n\n\t\t\t\tVALENTIN\n\t\tHaven't you seen enough to know\n\t\tthat doesn't matter?\n\n\tON HARRY.  He looks as though he's beginning to think maybe\n\tNix's resurrection is plausible.\n\n\t\t\t\tHARRY\n\t\tI want to see Swann face to face.\n\n\t\t\t\tVALENTIN\n\t\tWhy don't you leave this alone? Let\n\t\teverybody think it's over?\n\n\t\t\t\tDOROTHEA\n\t\tWhat about me?\n\n\t\t\t\tVALENTIN\n\t\tNix was never interested in you. \n\t\tIt was always Swann. \n\n\tA beat.\n\n\t\t\t\tHARRY\n\t\t\t(to Dorothea)\n\t\tMaybe Valentin's right.  We should\n\t\tlet it alone. \n\n\tA BELL starts to TOLL-\n\n\t\t\t\tHARRY\n\t\t\t(con't.)\n\t\tHe went to all that trouble to be\n\t\tdead.  Maybe we should let him stay\n\t\tthat way.\n\n\tThe TOLLING carries over into\n\n\tEXT. HOLLYWOOD CEMETERY - DAY\n\n\tWE CRANE DOWN from a high angle on a GRAVE, surrounded by\n\tMOURNERS.  The graveside service has just ended, and the\n\tMourners are beginning to disperse.  Dorothea is there\n\tamongst them, of course.  So are several faces we recognize: \n\tVinovich, Wilder, Billy Who, Swann's Stage Manager, his\n\tDancers, his Technicians.  There are also several members of\n\tthe PRESS, and thirty or fourty other Mourners, some of whom,\n\tto judge by their dress and manner, are also illusionists. \n\n\tHarry stands some distance from the crowd, watching (hidden)\n\tfrom the doorway of a mausoleum.  His eyes are on Dorothea as\n\tshe goes amongst the Mourners, receiving unheard words of\n\tcondolesence.\n\n\tEXT. WILTERN THEATRE - DAY\n\n\tThe standee of Swann is being demolished by two WORKERS. They\n\tare taking hammers to it, smashing it to pieces.\n\n\tINT. WILTERN THEATRE - STAGE - DAY\n\n\tThe stage is starkly lit with working lights, the auditorium\n\tin darkness.  Swann's equipment - including the partially\n\tdismantled Dragon's head - is heaped on the stage. \n\n\tValentin wanders through the boxes to the place where Swann\n\t\"died.\"  He stares down at the BLOOD on the stage.\n\n\tEXT. WILTERN THEATRE - DAY\n\n\tTHE 1st WORKER throws the cut-out head of Swann's standee\n\tdown into the street.\n\n\t\t\t\t1ST WORKER\n\t\tWatch out!\n\n\tOn the HEAD, as it strikes the sidewalk at somebody's feet. \n\tWe don't see who.\n\n\tEXT. HOLLYWOOD CEMETERY - DAY\n\n\tHarry catches sight of somebody close to the gates of the\n\tcemetery.  Dark glasses, a beard, an anonymous black suit. \n\n\tHarry smiles slightly, and slips off between the mausoleums.\n\n\tEXT. HOLLYWOOD CEMETERY - PARKING LOT - DAY\n\n\tThe BLACK-COATED MOURNER gets into his car. \n\n\tOn Harry, as he gets into his.\n\n\tINT. WILTERN THEATRE - STAGE - DAY\n\n\tValentin hears something in the auditorium.  Looks up.\n\n\t\t\t\tVALENTIN\n\t\tWho's there?\n\n\tHe reaches into his jacket to draw a GUN. There's a NOISE. \n\tHe swings round.  Too late.\n\n\tButterfield has a scalpel at his throat.  He kicks Valentin\n\tto the ground.\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(conversationally)\n\t\tI've sometimes thought, if I'd had\n\t\tanother profession, I would have\n\t\tbeen a surgeon.\n\n\tOn Valentin, staring up in terror. \n\n\tValentin's P.O.V.- of Butterfield, upside down, above him,\n\tthe scalpel glittering.\n\n\t\t\t\tBUTTERFIELD\n\t\tTo be able to heal with one little\n\t\tcut.\n\n\tOn Valentin again, as Butterfield's blade touches his cheek,\n\tjust beneath his eye.\n\n\t\t\t\tVALEMTIN\n\t\tNo. . .\n\n\t\t\t\tBUTTERFIELD\n\t\tLet's say those eyes of yours were\n\t\tgiving you trouble.\n\n\t\t\t\tVALENTIN\n\t\tPlease.\n\n\t\t\t\tBUTTERFIELD\n\t\tI could scoop them out.\n\n\t\t\t\tVALENTIN\n\t\tDon't.\n\n\t\t\t\tBUTTERFIELD\n\t\tSo tell me where Nix is buried.\n\n\t\t\t\tVALENTIN\n\t\tI don't know.\n\n\tButterfield pushes the blade into Valentin's skin. \n\n\tCUT WIDE, as Valentin thrashes, his face obscured by\n\tButterfield's body.\n\n\t\t\t\tVALENTIN\n\t\tWait!\n\n\tOn Valentin again.  There is a small cut beneath his eye, but\n\tthat's all.\n\n\t\t\t\tVALENTIN\n\t\tI'll tell you.\n\n\t\t\t\tBUTTERFIELD\n\t\tYou'll do more.than that.\n\n\tEXT. L.A. STREET - SEMI-DERELICT BUILDING - DAY\n\n\tA bad neighborhood, to judge by the state of the streets. \n\tHarry gets out of his car and crosses to a gate, topped with\n\tbarbed wire.  He peers through the bars. \n\n\tHarry's P.O.V. of the STRANGER from the funeral disappearing\n\tinto the building.  He glances back towards the street.  We\n\tget a glimpse of a bearded face beneath the brim of his hat. \n\n\tHarry slides out of sight.  Waits until the Stranger has gone\n\tinside.  Then he's up, over the gate, braving the barbed\n\twire.\n\n\tINT. -SEMI-DERELICT BUILDING - DAY\t\t   \n\n\tIt's been a hospital.  Now the echoing corridors and wards\n\tare deserted, littered with reminders of old suffering. \n\tRotting mattresses; spilled boxes of surgical supplies. \n\n\tHarry explores this tiled labyrinth, looking for some sign of\n\tthe Stranger. \n\n\tHe enters a shadowy room.  Birds fly UP into his face! \n\n\tAs he retreats, another SOUND, a little distance from him. \n\tGUN in hand, he heads towards it, and steps into\n\n\tINT. SEMI-DERELICT BUILDING - OPERATING THEATRE - DAY\n\n\tNarrow shafts of light through the circular viewing window\n\tfall on an operating table, and looming pieces of discarded\n\tequipment.  Eerie.  Disturbing. \n\n\tHarry scans the shadows as he advances into the room.\n\n\t\t\t\tHARRY\n\t\tI knew you wouldn't be able tn stay\n\t\taway.\n\n\tSilence.  Harry notices the beard and glasses on the\n\toperating table.\n\n\t\t\t\tHARRY\n\t\tYou had to see who wept for you the\n\t\tmost.\n\n\tSilence.\n\n\t\t\t\tHARRY\n\t\tA lot of people are going to be\n\t\treally pissed off when they\n\t\tdiscover you're still alive.\n\n\t\t\t\tSWANN (V.O.)\n\t\tThey'll never find out. \n\n\tHarry looks up.\n\n\tSvanrt is hovering in the air above him.  The veins in his\n\ttemples bulge and throb.  This trick requires a lot of\n\tconcentration.\n\n\t\t\t\tHARRY\n\t\tLook, Ma, no wires.\n\n\t\t\t\tSWANN\n\t\tYou shouldn't have followed me,\n\t\tD'Amour.\n\n\t\t\t\tHARRY\n\t\tHow the fuck do you do that?\n\n\t\t\t\tSWANN\n\t\tNow I'm going to have to kill you.\n\n\t\t\t\tHARRY\n\t\tI don't think so.  You need me\n\t\talive.\n\n\t\t\t\tSWANN\n\t\tWhy?  So you can fuck my wife?\n\n\tSwann swoops down towards Harry, who levels his gun.\n\n\t\t\t\tHARRY\n\t\tBe careful.  Funerals make me\n\t\ttrigger-happy.\n\n\tSwann stops, inches from the ground.\n\n\t\t\t\tHARRY\n\t\tYou know, it's such a fucking\n\t\twaste.  You can do shit most of us\n\t\tcan only dream about, and you go\n\t\taround pretending it's some trick.\n\n\t\t\t\tSWANN\n\t\tIllusionists get. Las Vegas\n\t\tcontracts, D'Amour.  Magicians get\n\t\tburned.\n\n\t\t\t\tHARRY\n\t\tOr murdered, like Nix.\n\n\t\t\t\tSWANN\n\t\tHe deserved it.\n\n\t\t\t\tHARRY\n\t\tMaybe he doesn't see it that way. \n\t\tMaybe he's digging his\n\t\tway out of the hole you put him\n\t\tright now.  That's what you're\n\t\thiding away from, isn't it?\n\n\t\t\t\tSWANN\n\t\tI did it for Dorothea.\n\n\t\t\t\tHARRY\n\t\tOh yeah?\n\n\t\t\t\tSWANN\n\t\tNow that I'm dead, the spotlight's\n\t\toff her.\n\n\tHarry grabs Swann, literally pulling him down to earth. Now\n\tthey're face to face.  Eye to eye.  Swann, for all his\n\tposturing, is afraid.\n\n\t\t\t\tHARRY\n\t\tSo Nix won't come looking for her?\n\n\t\t\t\tSWANN\n\t\tIt's me betrayed him.\n\n\t\t\t\tHARRY\n\t\tAnd she shot him I  I think that'd\n\t\tpiss me off if I were Nix.\n\n\t\t\t\tSWANN\n\t\t\t(despairing)\n\t\tI don't know what else to do.\n\n\t\t\t\tHARRY\n\t\tHelp me.\n\n\tOn Swann, his face a churning mass of rage and fear.\n\n\t\t\t\tHARRY\n\t\tListen.  If he's back from the\n\t\tdead, then he is some kind of god. \n\t\tAnd he'll find you, wherever the\n\t\tfuck you are. \n\t\tAnd if he's just another phony\n\t\tMessiah, then you can stage the\n\t\tgreatest come-back in history.\n\n\tON Swann.  This doesn't sound like such a terrible idea.\n\n\tEXT. NIX'S HOUSE - LATE AFTERNOON\n\n\tA car comes to a halt outside the house, where six vehicles\n\tare already gathered.  The SNAKE-HANDLING Cultist gets out. \n\tSNAKES seethe out of the open car door.\n\n\tINT. NIX'S HOUSE - VARIOUS - LATE AFTERNOON\n\n\tWe MOVE THROUGH the shadowy interior, catching sight of\n\tseveral CULTISTS as we go.  They all have looks of barely\n\tsuppressed ecstasy on their faces. \n\n\tWe are moving towards the Sanctum, and it's getting darker. \n\tA MATCH is struck, and an OIL-FLAME sputters into life.  We\n\tsee NORMAN'S gleaming face. On the wall is a PICTURE of Nix,\n\tfloating over a scene of apocalyptic destruction. \n\n\tNorman brushes away thirteen years' accrual of DIRT. Beneath,\n\tNix's expression is as rabid and terrifying as ever.  Norman\n\tgrins.\n\n\t\t\t\tCUT TO:\n\n\tEXT. LIQUOR STORE - LATE AFTERNOON\n\n\tA small, garishly-lit liquor store.  Harry's car pulls into\n\tthe lot.  Swann gets out, his disguise back on. Heads into\n\tthe store.  Harry, agitated and impatient, follows him.\n\n\tINT. LIQUOR STORE - LATE AFTERNOON\n\n\tSwann is at the cashier's desk, with a bottle of cheap\n\tbrandy.\n\n\t\t\t\tSWANN\n\t\tIs this the best brandy you've\n\t\tgot?\n\n\t\t\t\tCASHIER\n\t\tIf that's what's on the shelves.\n\n\tSwann produces a thousand dollar bill out of thin air.\n\n\t\t\t\tSWANN\n\t\tCan you change a thousand for me?\n\n\t\t\t\tCASHIER\n\t\t\t(amazed)\n\t\tYou're shittin' me.\n\n\t\t\t\tHARRY\n\t\tCan we go?\n\n\tSwann starts to COUGH.  A QUARTER falls from his mouth.\n\n\t\t\t\tHARRY\n\t\tOh Jeez.\n\n\t\t\t\tSWANN\n\t\tWill that do?  No?\n\n\tSwann coughs again.  Puts his hand to his mouth.  A DELUGE of\n\tQUARTERS runs between his fingers.\n\n\t\t\t\tSWANN\n\t\tThat better? \n\n\tThe Cashier gapes.\n\n\t\t\t\tCUT TO:\n\n\tEXT. SWANN'S MANSION - POOLSIDE - GROUNDS - DUSK\n\n\tThe house could not look more reassuringly calm.  A SWAN\n\tstruts beside the pool.  A long, HUSHED MOMENT...\n\n\t\t\t\tSHOCK CUT TO:\n\n\tDOROTHEA'S DREAM\n\n\tA BABOON SHRIEKS, its mouth filling the frame. \n\n\tCUT WIDE, to reveal the Baboon, racing around Nix's Sanctum,\n\tcrazed. \n\n\tHanging on the sculpture that swings from the roof is a\n\tshadowy figure.  Is it Nix?  We can't quite see.  Black BLOOD\n\truns from the figure and splashes on the ground.\n\n\tNOW WE SEE DOROTHEA, being pulled by the Cultists towards the\n\tfalling gouts of dark fluid --\n\n\t-- she struggles, SOBBING --\n\t\t\t CUT TO:\n\n\tINT. SWANN'S MANSION - DOROTHEA'S BEDROOM - NIGHT\n\n\tShe tosses around on the bed\n\n\t\t\t\tBACK TO:\n\n\tDOROTHEA'S DREAM\n\n\t-- Dorothea has a GUN in her hand.  The Cultists shake it\n\tfrom her grip, and pull her directly under the BLOOD -- as it\n\tSPLASHES on her upturned face --\n\n\tINT. SWANN'S MANSION - DOROTHEA'S BEDROOM - NIGHT\n\n\tA SOUND. Dorothea wakes, distressed by the dream.  She gets\n\tup and goes out onto --\n\n\tINT. SWANN'S MANSION - LANDING - DUSK\n\n\tLooks down the stairs.\n\n\t\t\t\tDOROTHEA\n\t\tWho's there?\n\n\tSilence.  Then, Valentin speaks behind her.  She jumps.\n\n\t\t\t\tVALENTIN\n\t\tI'm sorry.\n\n\tBLOOD runs from his cut face.\n\n\t\t\t\tDOROTHEA\n\t\tJesus.  Valentin.  What did you do\n\t\tto your face?\n\n\t\t\t\tBUTTERFIELD (V.O.)\n\t\tIt was me.\n\n\tShe turns.  He's on her in a heartbeat, pressing her back\n\tagainst the wail.\n\n\t\t\t\tBUTTERFIELD\n\t\tGuess who we're going to see?\n\n\tINT. HARRY'S CAR - DUSK\n\n\tHarry drives.  Swann takes a throatful of brandy.  Then he\n\tstares at Harry.\n\n\t\t\t\tSWANN\n\t\tYou think I'm an asshole.\n\n\t\t\t\tHARRY\n\t\tDidn't know you read minds.\n\n\t\t\t\tSWANN\n\t\t\t(a warning)\n\t\tI can do a lot of shit, D'Amour. \n\t\tBut you know that.\n\t\t\t(an apology)\n\t\tSo I like playing games with\n\t\tpeople.  Gives them something to\n\t\twonder about...\n\n\t\t\t\tHARRY\n\t\tIs that all?\n\n\t\t\t\tSWANN\n\t\tI distract them from their banality\n\t\tfor a few minutes. It's like a\n\t\tpublic service.  It doesn't mean\n\t\tmuch in the end. They're all going\n\t\tto die.\n\n\t\t\t\tHARRY\n\t\tAnd you're not? \n\n\tSilence for a moment.\n\n\t\t\t\tSWANN\n\t\tOh, I was going to discover the\n\t\tsecret of the universe.  That's why\n\t\tI liked Nix.  He promised me all\n\t\tthese explanations.\n\n\t\t\t\tHARRY\n\t\tAnd he didn't have them?\n\n\t\t\t\tSWANN\n\t\tHe had something.  He showed me how\n\t\tto bend the rules.  A little\n\t\tlevitation.  A few fireworks.\n\n\t\t\t\tHARRY\n\t\tIs that all?\n\n\t\t\t\tSWANN\n\t\tNo.\n\t\t\t(a beat)\n\t\tAt the end... when we had him\n\t\tcornered, he got into my head. He\n\t\tshowed me what we really look like,\n\t\twhen the veneer's gone.  Jelly. \n\t\tShit...\n\n\t\t\t\tHARRY\n\t\tAnd you believed him?\n\n\t\t\t\tSWANN\n\t\tI saw it with my own fucking eyes! \n\t\tSee, that's his best trick.  No\n\t\tillusions.  Just the truth.\n\t\t\t(he looks at Harry)\n\t\tAre you ready for that? \n\n\tHarry grabs the brandy bottle from Swann.\n\n\t\t\t\tSWANN\n\t\tHey!\n\n\tHarry drinks.\n\n\t\t\t\tSWANN\n\t\tThought not.\n\n\tEXT. SWANN'S MANSION - NIGHT\n\n\tPAN DOWN from the palms to Harry's car, outside the front\n\tdoor.\n\n\tINT. SWANN'S MANSION - VARIOUS - NIGHT\n\n\tHarry puts his head in the study, the library, the bedroom.\n\n\t\t\t\tHARRY\n\t\tDorothea?\n\n\tNow he's on the landing.  Swann's below.\n\n\t\t\t\tSWANN\n\t\tShe's not here.\n\n\tHarry spots Valentin's BLOOD on the carpet.\n\n\t\t\t\tHARRY\n\t\tDid she know where Nix was buried?\n\n\t\t\t\tSWANN\n\t\tNo.\n\n\t\t\t\tHARRY\n\t\tWho else did?  Did Valentin?\n\n\t\t\t\tSWANN\n\t\tYes.\n\n\t\t\t\tHARRY\n\t\tJesus!\n\n\tEXT. DESERT HIGHWAY - NIGHT\t \n\n\tButterfield's SEDAN crosses the desert, under a sky full of\n\tstars.\n\n\tINT. BUTTERFIELD'S SEDAN - NIGHT       \n\n\tValentin drives.  Butterfield and Dorothea are in the back. \n\tDorothea is handcuffed. \n\n\tHe has a bag open at his feet.  One by one he takes out a\n\tseries of extraordinary instruments.  Dorothea looks on,\n\tconfounded.\n\n\t\t\t\tBUTTERFIELD\n\t\tLike the look of these?  I made\n\t\tthem myself, to set him free.\n\n\t\t\t\tDOROTHEA\n\t\tWhy did you wait so long?\n\n\t\t\t\tBUTTERFIELD\n\t\tI didn't have the skill to\n\t\tresurrect him.  I had to teach\n\t\tmyself.  And that took time.\n\n\t\t\t\tDOROTHEA\n\t\tAnd you think he'll be in a fit\n\t\tstate to resurrect, after thirteen\n\t\tyears?\n\n\t\t\t\tBUTTERFIELD\n\t\tIf he was just a man like me, then\n\t\tno.  But he's not.\n\n\t\t\t\tDOROTHEA\n\t\tWhat is he?\n\n\t\t\t\tBUTTERFIELD\n\t\tMaybe he'll show you.\n\n\tON DOROTHEA, terror in her eyes.\n\n\tEXT. NIX'S HOUSE - NIGHT\n\n\tNow there are a dozen vehicles parked around the house.\n\tThrough the windows, the flickering of oil-lamp FLAMES.\n\n\tThere is a low, ominous CHANT floating from the house.\n\n\tIt has no words, but it is steadily BUILDING in intensity. \n\tWe DRIFT towards the front door.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - MEDITATION ROOM - NIGHT\n\n\tNow we move down the passageway to the Meditation Room.\n\n\tInside, SEVENTEEN CULTISTS kneel in a circle.  They are all\n\tCUTTING OFF THEIR HAIR, and throwing it into the FIRE that\n\tblazes in the centre of the circle.  They hack\n\tindiscriminately, with KNIVES, SCISSORS and RAZORS, their\n\teyes wild.  BLOOD runs down their faces and necks from nicked\n\tears and scalps.\n\n\tAnd still the CHANT BUILDS, and BUILDS...\n\n\t\t\t\tNORMAN\n\t\tHe will come!  He will come! He\n\t\twill come!\n\n\tEXT. DESERT - NIX'S GRAVE - NIGHT\n\n\tWide.  A few rocks, and emptiness. \n\n\tThe headlamps of Butterfield's sedan burn in the darkness,\n\tilluminating the dig.  Valentin is in the grave, digging. \n\n\tON Butterfield, as he stands at the edge of the hole,\n\twatching the work.  Dorothea stands a yard or two behind him.\n\n\t\t\t\tBUTTERFIELD\n\t\tAnything?\n\n\t\t\t\tVALENTIN (V.0.)\n\t\tNot yet.\n\n\tButterfield squats at the edge of the hole and suddenly\n\treaches out for Valentin, hauling him close.\n\n\t\t\t\tBUTTERFIELD\n\t\tIf you've lied to me to me --\n\n\t\t\t\tVALENTIN\n\t\tI swear... this is the place Swann\n\t\ttold me about.  The rocks...\n\n\tOn Dorothea, who uses Butterfield's distraction to take a few\n\tsteps back towards the open car door. \n\n\tDorothea's P.O.V. of Butterfield, back to her, interrogating\n\tValentin.\n\n\t\t\t\tBUTTERFIELD\n\t\tFive more minutes.  Hear me? And\n\t\tyou'd better not --\n\n\tA SOUND behind him.  Butterfield wheels round.  On the ground\n\tbeside the open car door, the instruments.\n\n\t\t\t\tBUTTERFIELD\n\t\tWhat the fuck are you playing at?\n\n\tHe goes to pick them up.  Dorothea steps from behind the\n\tdoor, with the sharpest in her hand.  She slashes at him. \n\tOpens a WOUND across his arm.\n\n\t\t\t\tBUTTERFIELD\n\t\tAah!\n\n\tHe comes at her suddenly, striking the instrument from her\n\thand, and slamming her against the car.  He hits her.  Once.\n\tTwice.  Then --\n\n\t\t\t\tVALENTIN (V.O.)\n\t\tButterfield!\n\n\tButterfield goes to the edge of the grave, picks up the\n\tflashlight and trains the beam on Valentin.\n\n\t\t\t\tVALENTIN\n\t\t\t(blinded)\n\t\tIn the corner...\n\n\tThe beam goes to the corner of the grave. \n\n\tA mummified HAND is sticking out of one of the walls.\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(to Valentin)\n\t\tKeep away from it.\n\n\tButterfield jumps down into the grave, and goes to the hand. \n\tThe TRACK is silent, but for Butterfield's shallow breath. \n\tHe reaches out to touch Nix^s fingers...\n\n\tCloser... \n\n\tCloser... \n\n\tHe touches the hand - and the wall of sand comes down with a\n\tROAR!\n\n\tHe jumps back as Nix's corpse, his head still sealed by the\n\tmask rolls into view.\n\n\t\t\t\tVALENTIN\n\t\tOh Christ!  Oh Christ!\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(reverentially)\n\t\tIt's him... it's him.\n\n\tOn Dorothea, sliding down the car in despair.\n\n\t\t\t\tCUT TO:\n\n\tINT. HARRY'S CAR - NIGHT\n\n\tThe car is static; the engine still running.\n\n\t\t\t\tHARRY\n\t\tThey got here before us.\n\n\t\t\t\tSWANN\n\t\tLooks that way.\n\n\tEXT. NIX'S GRAVE - NIGHT\n\n\tHarry gets out of the car and starts towards the open grave.\n\n\tHARRY'S MOVING P.O.V. OF THE GRAVE\n\n\tHarry reaches the grave's-edge.  It's totally dark.  He peers\n\tin.  On his heel, as the ground CRUMBLES beneath his weight. \n\tHarry slides into the grave.\n\n\t\t\t\tHARRY\n\t\tShit!\n\n\tHe's in darkness now.  He gets to his feet, and starts to try\n\tand scramble out.\n\n\t\t\t\tHARRY\n\t\tSwann?  Swann!\n\n\tSilence.\n\n\tSuddenly, a hand is laid on his shoulder!  Harry swings\n\tround.  It's Valentin.  He has been badly cut up. \n\n\t\t\t\tVALENTIN\n\t\tD'Amour --\n\n\t\t\t\tHARRY\n\t\tShit...\n\n\t\t\t\tVALENTIN\n\t\tHelp me.\n\n\tHe collapses into Harry's arms.\n\n\t\t\t\tHARRY\n\t\tSwann!\n\n\tINT. HARRY'S CAR - NIGHT\n\n\tIndecision is written all over Swann's face:  to help or not\n\tto help?\n\n\t\t\t\tHARRY (V.O.)\n\t\tSwann!\n\n\tHe decides.  Gets out.\n\n\tEXT. NIX'S GRAVE - MIGHT\n\n\tSwann goes to the graveside, terrified.\n\n\t\t\t\tHARRY\n\t\tGive me a hand.  I got Valentin.\n\n\tTogether, Harry and Swann lift Valentin out of the grave and\n\tlay him in the blaze of the headlamps.\n\n\t\t\t\tVALENTIM\n\t\tHe's got Dorothea. \n\n\t\t\t\tSWANN\n\t\tAnd Nix?\n\n\t\t\t\tVALENTIN\n\t\tHim too.\n\n\t\t\t\tHARRY\n\t\tWe've got to get you to a hospital.\n\n\t\t\t\tVALENTIN\n\t\tDon't bother.\n\n\t\t\t\tHARRY\n\t\tShut up.  We've lost enough lives\n\t\talready.\n\n\t\t\t\tVALENTIN\n\t\tI'm sorry, D'Amour...\n\n\t\t\t\tHARRY\n\t\tWhat about?\n\n\t\t\t\tVALENTIN\n\t\t... Looks like you're going...\n\t\tto lose... one more.\n\n\tValentin dies.\n\n\t\t\t\tHARRY\n\t\t\t(despairing)\n\t\t... no...\n\n\t\t\t\tSWANN\n\t\tHe's better off this way.\n\n\t\t\t\tHARRY\n\t\t\t(furious)\n\t\tNobody's better off this wav!\n\n\t\t\t\tSWANN\n\t\tYou don't get it, do you? We're\n\t\tshit. D'Amour.\n\n\tHe puts his foot beneath Valentin's body.  It rolls back into\n\tNix's grave.\n\n\t\t\t\tSWANN\n\t\tThat's where we're all going.\n\n\t\t\t\tHARRY\n\t\tIn my time, and nobody else's.\n\n\tON THE EMPTY GRAVE, as we HEAR the SOUND of Harry and Swann\n\tgetting into the car.  The doors SLAM.  The CAR LIGHTS\n\tretreat.  The grave is left to DARKNESS.\n\n\tEXT. NIX'S HOUSE - NIGHT\n\n\tThe house is silent now.\n\n\tINT. NIX'S HOUSE - PASSAGEWAYS - NIGHT\n\n\tWe TRACK through the house.  The CULTISTS, all Seventeen of\n\tthem, stand in the passageways, looking toward Nix's sanctum.\n\n\tON THE SANCTUM DOOR.  Butterfield emerges.  He is wearing\n\tWHITE now.\n\n\t\t\t\tBUTTERFIELD\n\t\tDo you wish him to be amongst us?\n\n\t\t\t\tCULTISTS\n\t\tYes...\n\n\t\t\t\tBUTTERFIELD\n\t\tWill you come to him on your\n\t\tknees?\n\n\t\t\t\tCULTISTS\n\t\tYes...\n\n\t\t\t\tBUTTERFIELD\n\t\tBe ready.\n\n\tNow we see that the Cultists have BOTTLES in their hands. \n\tWith looks of ecstatic fervour on their faces, they SMASH the\n\tbottles to the ground at their bare feet. Then they pick up\n\tMORE BOTTLES, and SMASH them, littering the ground with razor\n\tsharp pieces of GLASS. \n\n\tON Butterfield, smiling.  He steps back into the Sanctum.\n\n\tINT. NIX'S HOUSE - SANCTUM - NIGHT\n\n\tHIGH, WIDE SHOT of the room, as Butterfield approaches the\n\tBODY of Nix.  It lies on a table, surrounded by bowls of OIL. \n\tBandages, soaked in oil, are laid over its limbs.  Beside its\n\thead, Butterfield's INSTRUMENTS are laid out. \n\n\tON Dorothea, crouched in the corner of the room, terrified as\n\tshe watches Butterfield remove the multi- part MASK screwed\n\tinto Nix's face.  He works with surgical precision.\n\n\t\t\t\tDOROTHEA\n\t\tListen.  You've got everything you\n\t\twant.  You don't need me. .. \n\n\tA piece of the mask comes away from the cheek.  A subtle\n\tPOWER plucks at dust around the room, disturbing it minutely. \n\tWe CUT CLOSE to Dorothea's face throughout this sequence (on\n\toccasion her eyeball fills the screen) as she sees these\n\tsigns of disturbance in the ether, growing in magnitude.\n\n\t\t\t\tBUTTERFIELD\n\t\tNo, but he will.  After what you\n\t\tdid to him.\n\n\tHe pulls a piece of the mask from Nix's mouth.\n\n\t\t\t\tBUTTERFIELD\n\t\tHe'll want vengeance.  Simple PS\n\t\tthat.\n\n\tINT. NIX'S HOUSE - PASSAGEWAYS - NIGHT\n\n\tThe bottle-breaking has ceased.  The Cultists stand,\n\tbreathless with anticipation.\n\n\tINT. NIX'S HOUSE - SANCTUM - NIGHT\n\n\tOn Nix's emaciated mouth.  The lips TWITCH. \n\n\tOn Dorothea.  The DUST moves around her. \n\n\tAnd Nix DRAWS BREATH. \n\n\tOn Butterfield, TEARS in his eyes.\n\n\t\t\t\tBUTTERFIELD\n\t\tOh my Lord.  He's coming home...\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\tThe whisper runs through the congregation:\n\n\t\t\t\tCULTISTS\n\t\tHe's coming home... he/s coming\n\t\thome...\n\n\tINT. NIX'S HOUSE - SANCTUM - NIGHT\n\n\tON Dorothea, eyes wide.\n\n\t\t\t\tDOROTHEA\n\t\tChrist in Heaven.\n\n\tON Nix, as his body starts to thirstily soak up the oils. \n\tHis withered flesh starts to REHYDRATE; his veins start to\n\tTHROB. \n\n\tButterfield is watching the process in amazement. Nix's HANDS\n\tmove up to his face, where the last portion of the mask is\n\tstill screwed over his eyes.\n\n\t\t\t\tBUTTERFIELD\n\t\tHe's with us...\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\t\t\t\tCULTISTS\n\t\tHe's with us... He's with us...\n\n\tINT. NIX'S HOUSE - SANCTUM - NIGHT\n\n\tUnnoticed by Butterfield, who has his eyes on Nix, Dorothea\n\tgets to her feet and creeps away to the door. Very quiet\n\tTRACK. \n\n\tSuddenly, the snake-handling Cultist steps into view, snakes\n\tcoiled around his face and fingers!\n\n\t\t\t\tDOROTHEA\n\t\tOh God!\n\n\tButterfield looks up. \n\n\t\t\t\tBUTTERFIELD\n\t\tHold her!\n\n\tOn Nix, as he starts to pull at the mask on his face.  It\n\tcomes away with a moist, WRENCHING SOUND.  At last, we see\n\this eyes.\n\n\tNIX'S P.O.V.\n\n\tThe candle-lights blaze, BLINDING his sensitive eyes.\n\n\t\t\t\tNIX\n\t\t\t(fury to agony)\n\t\tAaarrrgh!\n\n\tHe gets up and flings himself around the room, knocking over\n\tall the lights but two.  Then he strikes Butterfield to the\n\tground, and slams his foot on Butterfield's neck, knocking\n\thim unconscious.  It's a terrifying, almost demoniacal\n\tdisplay of instant physical superiority.  Throughout, he\n\tliterally ROARS in rage.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\tThe Cultists SCREAM in sympathy, letting out years of\n\trepressed frustration.  Many of them are dancing on the\n\tshards of glass now, crazed.\n\n\t\t\t\tCUT TO:\n\n\tEXT. DESERT NEAR NIX'S HOUSE - NIGHT\n\n\tHarry's car is parked a quarter mile from Nix's house. He is\n\tgetting out.  Swann stays put. \n\n\tThe SOUND of SCREAMING is carried towards them on the wind.\n\n\t\t\t\tHARRY\n\t\t\t(spooked)\n\t\tJesus... what the hell's going on\n\t\tin there?\n\n\t\t\t\tSWANN\n\t\tAt a guess... they just resurrected\n\t\thim.\n\n\t\t\t\tHARRY\n\t\tFuck.\n\n\tHarry starts towards the house. After a beat, Swann gets out\n\tof the car and follows.\n\n\tINT. NIX'S HOUSE - SANCTUM- - NIGHT\n\n\tOn Butterfield, as Nix removes his foot.  Butterfield is out\n\tfor the count. \n\n\tOn Nix, as he stops screaming.  His face is grotesquely\n\tdisfigured by the mask, the flesh stained and corrupted. \n\n\tThe SCREAMING of the Cultists is dying away.\n\n\t\t\t\tNIX\n\t\tChildren...\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\tThe Cultists all face the Sanctum door, awaiting instruction.\n\n\t\t\t\tNIX\n\t\tWill you suffer to come unto me?\n\n\tOne by one, the Cultists fall to their knees.  We never see\n\tflesh pierced by broken glass.  But we HEAR IT, and see the\n\tagony on the Cultist's faces.  They start to sob.\n\n\tThen, Nix appears in the doorway, mostly hidden by shadow.\n\n\t\t\t\tNIX\n\t\tI've come back to share the wisdom\n\t\tof the grave.  Will you hear it?\n\n\t\t\t\tCULTISTS\n\t\tYes... yes...\n\n\t\t\t\tNIX\n\t\tFollow me then.\n\n\tHe steps out of the doorway.  The Cultists let out sobs of\n\tadoration.  Nix locks at Dorothea.\n\n\t\t\t\tNIX\n\t\tDo I know you, child?\n\n\tHe reaches for her.  Pulls her close to his body. Dorothea\n\tkeeps her self-possession; but only just.\n\n\t\t\t\tNIX\n\t\tOh yes... I do, don't I?  No gun\n\t\tthis time, child?\n\t\t\t(a beat)\n\t\tWhere's Swann?\n\n\t\t\t\tDOROTHEA\n\t\tI don't know where he is.\n\n\tNix picks her up, so that her feet are inches off the ground.\n\n\n\t\t\t\tNIX\n\t\tHe'll come.  We've got unfinished\n\t\tbusiness, he and I.\n\n\tThen he carries her down the passageway to the Meditation\n\tRoom, walking on the glass, apparently indifferent to the\n\twounds he's receiving. \n\n\tThe Cultists follow.\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\tNix strides into the middle of the room.\n\n\t\t\t\tNIX\n\t\t\t(whispered to Dorothea)\n\t\tSomething terrible's going to\n\t\thappen.  But if you hold on to me,\n\t\tvery tight, you may live a little\n\t\tlonger.\n\n\tThe Cultists enter the room, knees and hands BLOODY.\n\n\t\t\t\tNIX\n\t\t\t(to Cultists)\n\t\tAre you ready for my wisdom?\n\n\t\t\t\tCULTISTS\n\t\tTell us... tell us...\n\n\tINT. NIX'S HOUSE - SANCTUM - NIGHT\n\n\tHarry pushes open the window, and climbs in.  Swann follows. \n\tHe is frozen by the memory of what happened here. \n\n\tON SWANN, as the TRACK fills with eerie ECHOES of that\n\tterrible event.  Nix's SCREAMS.  The GUN-SHOTS.  The sound of\n\tthe SCREWS GRINDING into Nix's flesh.\n\n\t\t\t\tSWANN\n\t\t\t(in terrified awe)\n\t\tThis is where we killed him.\n\n\t\t\t\tHARRY\n\t\t\t(looking at table)\n\t\tYou didn't try hard enough.\n\n\t\t\t\tSWANN\n\t\tI can't... I can't go any\n\t\tfurther...\n\n\tHarry nods, and gently detaches his arm from Swann's panicked\n\tgrip.  He crosses to the door. \n\n\tSuddenly. Butterfield reaches out of the darkness, and\n\tcatches hold of Harry's leg. throwing him to the ground. \n\n\tHe has one of the INSTRUMENTS in his hand.  He STABS at\n\tHarry, striking the ground between Harry's legs.\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\t\t\t\tNIX\n\t\tHere is my wisdom.\n\n\tHe stamps on the ground.  CRACKS spread from his foot in all\n\tdirections. ON THE CULTISTS, amazed by this manifestation of\n\tpower.\n\n\t\t\t\tBARBARA\n\t\tShow us. Puritan.\n\n\t\t\t\tNORMAN\n\t\tYes, show us!\n\n\t\t\t\tALL\n\t\tShow us!  Show us!\n\n\tWith a ROAR, a PIT four or five feet across opens up beneath\n\tNix and Dorothea.  Nix HOVERS over it.  It's utterly dark;\n\tperhaps bottomless. \n\n\tDorothea SCREAMS!\n\n\tINT. NIX'S HOUSE - SANCTUM- - NIGHT\n\n\tHearing Dorothea's CRY, Harry looks back towards the\n\tpassageway.  Butterfield pulls the instrument out of the\n\tground and stabs at Harry a second time.  But Swann catches\n\thold of his arm.\n\n\t\t\t\tSWANN\n\t\t\t(to Harry)\n\t\tWhatever he's doing to her, stop\n\t\thim!\n\n\tAnd Harry's up and away --\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\t-- he dashes over the glass --\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\tOn Nix, Dorothea clasped close to him.  He REVOLVES as he\n\tfloats over the chasm below then.\n\n\t\t\t\tNIX\n\t\t\t(to unseen Cultists)\n\t\tYou see, I escaped the grave. So I\n\t\thave to give something to the grave\n\t\tin return.\n\n\tOn the Cultists, listening to their lord with love in their\n\teyes. \n\n\tA SLIT OPENS in the middle of Nix's forehead, above the\n\tbridge of his nose (this is an image we saw in the prints in\n\tthe library), and from it comes a WAVE OF DARKNESS.  As Nix\n\tREVOLVES, the darkness STRIKES the GROUND around the\n\tCultists.\n\n\tAt first they don't realize what's going on.  They think this\n\tis some kind of bizarre blessing. \n\n\tThen the ground starts to LIQUIFY beneath them.\n\n\t\t\t\tNORMAN\n\t\tWhat's happening?\n\n\t\t\t\tNIX\n\t\tI have to give something back. So\n\t\tI'm giving you.\n\n\tThey're starting to SCREAM now as they sink into the ground. \n\tThey struggle, of course, but the earth seems to be hungry\n\tfor them.  They are dragged down, THRASHING as they SINK.\n\n\t\t\t\tBARBARA\n\t\t\t(sobbing)\n\t\tWhy?  Why?\n\n\t\t\t\tNIX\n\t\tYou're not worthy.  None of you. \n\t\tOnly Swann was worthy. You just\n\t\twaited like lambs.\n\n\tHarry appears in the doorway.  Nix, still swinging round, has\n\this back to Harry.\n\n\t\t\t\tNIX\n\t\tWell I'm not your shepherd.\n\n\tHarry surveys the horrific scene in front of him.  The ground\n\tis now re-solidifying around the Cultists, some of whom have\n\tdisappeared from view completely, some of whom still reach up\n\tout of the dirt.  The scene has a surreal beauty to it\n\tdespite its horror.  SCREAMING FACES locked in the solid\n\tground.  TWITCHING HANDS the same. Harry starts towards Nix\n\tand Dorothea, GUN levelled.  So far, he has avoided Nix's\n\tgaze.\n\n\tINT. NIX'S HOUSE - SANCTUM - NIGHT\n\n\tButterfield and Swann are locked in a life-or-death struggle. \n\tThey tumble back against the table upon which Nix was\n\tresurrected.  It collapses under them, and for a moment Swann\n\tis stunned.  Butterfield snatches up one of the instruments\n\tand STABS at Swann, who rolls out of the way in the nick of\n\ttime. \n\n\tThe BLADE catches him in the arm, however.\n\n\t\t\t\tSWANN\n\t\tAah!\n\n\t\t\t\tBUTTERFIELD\n\t\tGo on, bleed.\n\t\t\t(he slashes at Swann\n\t\tagain)\n\t\tGo on!  Go on!\n\n\tButterfield comes after him, and Swann backs off against a\n\twall.  He SPITS out a serpentine FLAME, which races across\n\tthe floor and leaps at Butterfield's face!\n\n\t\t\t\tBUTTERFIELD\n\t\t\t(screaming)\n\t\tNo!\n\n\tHe falls backwards, his face ON FIRE.  Swann doesn't wait to\n\twatch him die, but races out into the passageway, BLOOD\n\trunning from his wound.\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\tHarry is staring up at Dorothea as he very gingerly crosses\n\tthe still-sticky ground.  He's a yard from the edge of the\n\tpit now. \n\n\tNix swings round.\n\n\t\t\t\tNIX\n\t\tYou're not Swann.  Who are you?\n\t\t\t(a beat) )\n\t\tOh... I know what you want. He lets\n\t\tDorothea slip from his arms.  \n\n\tHarry flings himself towards the hole and CATCHES HOLD of\n\tDorothea's arm before she falls away into the abyss.  His GUN\n\tgoes spinning across the ground, back towards the door\n\tleading to the passageway.\n\n\t\t\t\tDOROTHEA\n\t\tOh God!\n\n\t\t\t\tHARRY\n\t\tHang on!\n\n\tNix reaches down to torment Harry.  But before he can make\n\tcontact\n\n\t\t\t\tSWANN (V.O.)\n\t\tNix!\n\n\tNix looks up.\n\n\t\t\t\tNIX\n\t\tThere you are. \n\n\tSuddenly, Nix isn't interested in Harry and Dorothea. He\n\tsteps onto solid ground, and walks towards Swann, his tone\n\tsuddenly conversational.\n\n\t\t\t\tNIX\n\t\tI've had a lot of time to think\n\t\tabout you.  Where I went wrong...\n\n\tWith Nix's back turned, Harry pulls Dorothea back out of the\n\tchasm.\n\n\t\t\t\tSWANN\n\t\tAnd?\n\n\t\t\t\tNIX\n\t\tI should have been honest with you,\n\t\tright from the start.  I wasn't\n\t\tborn to show people the error of\n\t\ttheir ways.  I was born to murder\n\t\tthe world.\n\n\tON HARRY, as he leads Dorothea to the door.  Harry glances\n\tback into the room.\n\n\t\t\t\tNIX\n\t\tYou could still help me do that.\n\n\t\t\t\tSWANN\n\t\tWhy would I want to?\n\n\t\t\t\tNIX\n\t\tBecause you've got nothing else to\n\t\tlive for.\n\n\t\t\t\tSWANN\n\t\tNot true.\n\n\t\t\t\tNIX\n\t\tThe woman has a new love in her\n\t\tlife.  Your friends are dead.\n\t\tNobody's left to save you, but me\n\n\tHe lays his hands on Swann.  Draws him into an embrace.\n\n\tON HARRY and Dorothea.\n\n\t\t\t\tHARRY\n\t\t\t(to Dorothea)\n\t\tI've got to help him.\n\n\t\t\t\tDOROTHEA\n\t\tYou can't.\n\n\t\t\t\tHARRY\n\t\tNix has got to have a weak spot. \n\t\tEverybody's got a fucking weak\n\t\tspot.\n\n\tA NOISE. He turns, and suddenly --\n\n\tButterfield is there!  His face is horribly burned, but he's\n\tstill very much alive.\n\n\t\t\t\tBUTTERFIELD\n\t\tBastard!\n\n\tHe launches himself at Harry, driving them both back into the\n\tBROKEN GLASS.  A FIGHT ensues, carrying them out into the\n\tPassageway. \n\n\tNix has Swann in a bear-hug.\n\n\t\t\t\tNIX\n\t\tWill you help me? \n\n\tA beat.  Then Swann nods.\n\n\t\t\t\tSWANN\n\t\tYes.\n\n\tNix lets him go.\n\n\t\t\t\tNIX\n\t\tYou know I'll kill you when we're\n\t\tdone.  I have to.\n\n\t\t\t\tSWANN\n\t\tYes.\n\n\t\t\t\tNIX\n\t\tBut until then... it's you and\n\t\tme... the way it always was.\n\n\t\t\t\tSWANN\n\t\tYes.\n\n\tDorothea, at the doorway, watches this bizarre exchange.\n\tSwann's eyes flicker towards her.  Nix turns.\n\n\t\t\t\tNIX\n\t\tWait... you still feel something\n\t\tfor that bitch?\n\n\t\t\t\tSWANN\n\t\tNo!\n\n\t\t\t\tNIX\n\t\tLiar!\n\n\tNix makes a gesture, and Swann is flung against the wall,\n\tpinned there like a fly, legs off the ground.\n\n\t\t\t\tNIX\n\t\tWill!  You!  Never!  Learn!?\n\n\tWith each word, Nix almost casually throws a gesture in\n\tSwann's direction, and though there is six feet between them,\n\tthey have the force of terrible blows.  One to the ribs. \n\tThey CRACK.  One to the face.  It BLEEDS.  One to the legs,\n\tone to the arms.  They all BREAK.  Then Nix turns towards\n\tDorothea.\n\n\t\t\t\tNIX\n\t\tShe's just flesh, Swannnie-boy.\n\t\tI'll show you!\n\n\tHe moves towards Dorothea.  Swann falls to the ground,\n\tbroken.\n\n\t\t\t\tSWANN\n\t\tHarry!\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\tThe fight between Butterfield and Harry continues.\n\n\t\t\t\tSWANN (V.O.)\n\t\tHarry!  Stop him!\n\n\tHarry looks up.  Sees Dorothea retreating from the door, and\n\trunning off into the darkness. \n\n\tButterfield comes at Harry again.  Harry's got no more time\n\tfor this creep.  He delivers Butterfield a backhand swipe,\n\tand Butterfield lands face down in the glass.  We don't see\n\tthe impact.  HEARING it's enough. \n\n\tHarry looks down at the body.  Then --\n\n\t\t\t\tNIX (V.O.)\n\t\tWhere is she? \n\n\tHarry turns.\n\n\tNix is on him like a luoaernaut. treading on Butterfield's\n\tbody as he comes at Harry!\n\n\t\t\t\tNIX\n\t\tWhere did she go?\n\n\tNix GRABS hold of Harry's head with one hand and PRESSES the\n\tfingers of -the other hand against Harry's TEMPLES. He\n\tstruggles to get free, but Nix is simply too powerful.\n\n\tNix's fingers slowly SLIDE BENEATH the skin of Harry's\n\ttemples.  As before, there's no blood.\n\n\t\t\t\tNIX\n\t\tYou've got Swann's disease. You\n\t\tthink a little courage, a little\n\t\tlove, and it'll all be all right. \n\t\tWrong!\n\n\tHis fingers slide all the way in!\n\n\t\t\t\tHARRY\n\t\tOh God!\n\n\tHarry wrests himself free of Nix, and stumbles away. His eyes\n\tare BLOOD-RED.  Nix is a few yards behind him.\n\n\t\t\t\tNIX\n\t\tTell me where she is... and I'll\n\t\tmake it go away...\n\n\tHarry is reeling around in the grip of a nightmare.\n\n\tHARRY'S P.O.V.\n\n\tThe apocalyptic images on the walls seem to move!  A face\n\tSCREAMS!  FIRE blossoms! \n\n\tON HARRY, verging on insanity.\n\n\t\t\t\tHARRY\n\t\tOh God... oh God...\n\n\tHARRY'S P.O.V.\n\n\tHarry sees a WOMAN, wrapped in the sickly-sensual embrace of\n\tsome glistening, barely visible OBSCENITY.  We can't see her\n\tface.  Only her mouth is visible in the coils of her\n\tdevourer.\n\n\tON HARRY\n\n\tas he approaches the wall, on which this woman is painted. \n\tReaching out for the image.\n\n\tHARRY'S P.O.V.\n\n\tThe Woman reaches for Harry.\n\n\t\t\t\tWOMAN           \n\t\tHelp me.\n\n\tON HARRY\n\n\tas he touches the wall.\n\n\t\t\t\tHARRY\n\t\tDorothea!\n\n\tHe starts to SCRATCH out the plaster on which the image is\n\tpainted.\n\n\t\t\t\tHARRY\n\t\tDorothea!  Dorothea!\n\n\tHARRY'S P.O.V.\n\n\tDarkness swallows the image of the woman.  She is still\n\tscreaming when she disappears.\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\tON SWANN, dragging his broken body to the door.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\tON HARRY \n\n\tliterally beating his head against the wall!\n\n\t\t\t\tHARRY\n\t\tNo!  No!  No!\n\n\t\t\t\tDOROTHEA (V.O.)\n\t\tHarry...\n\n\tHarry stops.  Dare he believe this is truly her voice?\n\n\t\t\t\tDOROTHEA\n\t\tIt's not real, Harry-\n\n\tHarry turns around.  Dorothea is there.\n\n\tHARRY'S P.O.V.\n\n\tFor a moment, he sees Dorothea as she is.\n\n\tON HARRY, relief flooding his face.  Then --\n\n\tHARRY'S P.O.V.\n\n\t-- the image MORPHS.  Dorothea's beauty is replaced by\n\tprimeval muck. \n\n\tON HARRY, appalled.  Dorothea grabs hold of him.\n\n\t\t\t\tDOROTHEA\n\t\tHarry.  Listen to me. Whatever's\n\t\tgood between us, believe it.\n\n\tHarry's face is deathly white, and pouring SWEAT.  He's\n\tfighting the delirium.  Or doing his best.\n\n\n\t\t\t\tHARRY\n\t\t... oh... God...\n\n\t\t\t\tDOROTHEA\n\t\tI'm here, Harry.\n\n\t\t\t\tHARRY\n\t\t...yes?\n\n\t\t\t\tDOROTHEA\n\t\tYes.\n\n\tNix steps from the shadows of the doorway behind Harry.\n\n\t\t\t\tNIX\n\t\t\t(to Dorothea)\n\t\tThere you are, child. \n\n\tHarry starts to look round.\n\n\t\t\t\tDOROTHEA\n\t\tDon't look.\n\n\t\t\t\tHARRY\n\t\tI... have... to.\n\n\t\t\t\tNIX\n\t\tCome on, child.  I want Swann to\n\t\tsee you die. \n\n\tHarry turns and looks at Nix.\n\n\tHARRY'S P.O.V.\n\n\tNix's face darkens as it MORPHS.  And the flesh in the middle\n\tof his brow UNFOLDS, revealing a dark, pulsating THIRD EYE.\n\n\t\t\t\tNIX\n\t\t\t(to Harry)\n\t\tWhat are you looking at?\n\n\tON DOROTHEA, who has gone to the door of the Meditation Room\n\tand now slips inside. \n\n\tON HARRY, staring up at Nix.\n\n\tON DOROTHEA, re-emerging from the Meditation Room.  In her\n\thand, Harry's GUN.  Harry looks round at her.\n\n\t\t\t\tHARRY\n\t\t\t(points to his brow)\n\t\tThere... there!\n\n\tON NIX, as he looks up at Dorothea. \n\n\tON DOROTHEA, as she raises the GUN.  She FIRES. \n\n\tThe bullet STRIKES Nix's FOREHEAD.  He sinks to his knees,\n\tBLOOD pouring down his face from the hole where his third EYE\n\tused to be.\n\n\tON HARRY, as Nix's mind-hold falters.  He leans against the\n\twall, shaking.\n\n\t\t\t\tDOROTHEA\n\t\tHarry?\n\n\t\t\t\tHARRY\n\t\tI'm okay.  I'm okay.\n\n\tHarry opens his eyes.  Looks up at her.\n\n\tHARRY'S P.O.V.\n\n\tThe last of the MORPHING fades.  He sees Dorothea as she\n\tactually is.  Dorothea goes down to comfort him, and they\n\tembrace. \n\n\tSuddenly, a ROAR from Nix.  They look towards him --\n\n\t-- it isn't over. \n\n\tOne last, terrifying transformation is overtaking Nix as he\n\tkneels in the GLASS.  His sallow flesh is running in STREAMS\n\tup his body towards the DARK HOLE in the middle of his\n\tforehead --\n\n\t\t\t\tNIX\n\t\tOne... last... illusion...\n\n\t-- his humanity is disappearing, vanishing into the vortex of\n\tthe bullet wound.\n\n\t\t\t\tDOROTHEA\n\t\tOh my God.\n\n\tHarry and Dorothea start to get up... \n\n\tNix is no longer human.  He is a shape of gleaming DARKNESS,\n\tstripped of features.  He opens his mouth, the only visible\n\telement on his body is his toothed maw, which looses an\n\tutterly inhuman SHRIEK!\n\n\t\t\t\tSWANN (V.O.)\n\t\t... D'Amour...\n\n\tHarry glances through the door into the Meditation Room.\n\tSwann is on the threshold. \n\n\tNix RISES now.  He is a terrifying spectacle, his bulk\n\tsomehow more intimidating than ever in this simplified form. \n\n\tHe comes at Dorothea, who has no choice but to back away into\n\tthe Meditation Room.\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\tThe pit still yawns in the middle of the floor. Dorothea is\n\tbacked towards it by Nix. \n\n\tWhen Nix SPEAKS, his voice is not remotely human.  It is\n\tDEMONIACAL.\n\n\t\t\t\tNIX\n\t\tI am the purest of the pure.  I am\n\t\tthe darkest of the dark...\n\n\tHarry is at the door now, starting towards Nix.\n\n\t\t\t\tSWANN\n\t\tHarry.  You can't kill him. \n\n\tHarry crouches beside Swann.\n\n\t\t\t\tHARRY\n\t\t\t(whispers)\n\t\tHe did something with the ground.\n\n\t\t\t\tSWANN\n\t\tYes?\n\n\t\t\t\tHARRY\n\t\tCan you do it?\n\n\t\t\t\tSWANN\n\t\tI don't know.\n\n\t\t\t\tHARRY\n\t\tTry.\n\n\tON DOROTHEA.  She's a couple of yards from the pit now.\n\n\t\t\t\tNIX (V.O.)\n\t\tI'm beyond Heaven.  I'm beyond\n\t\tHell.\n\n\tSuddenly, Harry lunges at Nix, grabbing hold of his legs. \n\tNix topples.\n\n\tON SWANN, who puts his hands on the ground.  Closes his eyes. \n\n\tA wave of LIQUIFICATION runs through the ground from Swann's\n\tbroken fingers -- \n\n\t-- the Cultists' bodies MOVE in the softening ground, like\n\tcorpses in surf, and ROLL towards the pit, their dead faces\n\tresurfacing --\n\n\tBarbara's body floats past Nix, and disappears over       \n\tthe edge of the pit.\n\n\t\t\t\tHARRY\n\t\t\t(to Dorothea)\n\t\tGet out of here!\n\n\tThe ground is very liquid now, and the corpses are lodging\n\taround Nix as they're all carried towards the pit.  So's\n\tHarry, of course. \n\n\tNix tries to get up, but he's too late.  The corpses weigh\n\thim down, the ground is too fluid for him to get a proper\n\thold, and Harry still clings to his legs.\n\n\t\t\t\tNIX\n\t\tNo!  No!  No!\n\n\tHe's at the edge of the pit.\n\n\t\t\t\tDOROTHEA (V.O.)\n\t\tHarry!\n\n\tHarry looks round.  Dorothea's behind him, risking the\n\tflowing ground to offer him a hand. \n\n\tNix starts to fall into the pit.  At the last minute, he\n\treaches for Harry, as -- \n\n\t-- Harry is pulled out of reach bv Dorothea. \n\n\tTogether they stumble to THE DOOR, where Swann still lies. \n\tThey look back to see \n\n\tNIX, as he goes over the edge of the pit and FALLS SCREAMING. \n\n\tAt the door, Dorothea lifts up Swann's head.  He's dead. She\n\tcloses his eyes.\n\n\t\t\t\tCUT TO:\n\n\tINT. THE PIT\n\n\tWhat we are about to witness is the longest fall-to-his-\n\tdeath by any villain in the history of cinema... \n\n\tNix is falling through rock.  Still SCREAMING.  He CRASHES\n\tagainst a layer of stone, which his body smashes to\n\tsmithereens.  And as he falls --\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\t\t\t\tDOROTHEA\n\t\tIs it finished?\n\n\t\t\t\tHARRY\n\t\tI think so.\n\n\tNo it's not.  Nix keeps falling, breaking through another\n\tlayer of rock as he descends deeper and deeper into the\n\tearth. \n\n\tAnd now... there's a hint of FIERY LIGHT below.  He's\n\tapproaching MAGMA.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\t\t\t\tDOROTHEA\n\t\tCome on...\n\n\tShe puts her arms around him.  Kisses him, sobbing with\n\trelief.\n\n\tINT. THE PIT\n\n\tNix hits a layer of molten rock, and, SCREAMING, he\n\tdisappears.  A BURST of dark, roiling ENERGY erupts from the\n\tspot where he sank, and starts up the pit --\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\tThe room TREMBLES.  There's a ROAR in the earth.\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\t\t\t\tHARRY\n\t\tWhat the fuck? \n\n\t\t\t\tDOROTHEA\n\t\tHarry-?\n\n\t\t\t\tHARRY\n\t\tOut!  Out! \n\n\tThey race for the front door --\n\n\tINT. THE PIT\n\n\t-- the wave of ENERGY, like a howling, dark WIND, ascends at\n\ta breath-taking rate\n\n\tINT. NIX'S HOUSE - PASSAGEWAY - NIGHT\n\n\tHarry and Dorothea race for the open air, as\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - NIGHT\n\n\tThe ENERGY ERUPTS from the pit.\n\n\tEXT. NIX'S HOUSE - FRONT DOOR - NIGHT\n\n\tHarry and Dorothea stumble out, into the night --\n\n\tINT. NIX'S HOUSE - VARIOUS - NIGHT\n\n\tThe ENERGY howls from room to room, ERODING the images off\n\tthe walls, BLOWING out the doors, DESTROYING all the\n\tresurrection equipment in the Sanctum --\n\n\tEXT. NIX'S HOUSE - DESERT - DAWN\n\n\tHarry and Dorothea stumble to the car.  They look back at the\n\thouse, as the cacophony of destruction dies down. \n\n\tON THE RIM OF THE SUN, as it peeps over the desert horizon.\n\n\tINT. NIX'S HOUSE - VARIOUS - DAWN\n\n\tThe SUNLIGHT creeps through the rooms as the DUST settles.\n\n\tINT. NIX'S HOUSE - MEDITATION ROOM - DAWN\n\n\tThe hole in the floor CLOSES UP, and is SEALED... SILENCE\n\treigns.\n\n\tEXT. NIX'S HOUSE - DESERT - DAWN\n\n\tHarry and Dorothea get into the car.  Harry glances back at\n\tthe house.  Nothing.\n\n\t\t\t\tHARRY\n\t\t\t(quietly)\n\t\tIt's finished.\n\n\tEXT. NIX'S HOUSE - FRONT DOOR - IDOLS - DAWN\n\n\tON THE IDOLS and the FRONT DOOR, virtually destroyed by tine.\n\n\tWE DRIFT THROUGH THEM, INTERCUTTING WITH:\n\n\tEXT. HARRY'S CAR - DESERT ROAD - DAWN\t\t\t   \n\n\tHarry's car speeds away, leaving a plume of dust as\n\n\tTHE CREDITS ROLL\n\n\n\n\n\n\n\n\nLord of Illusions\nWriters :   Clive Barker\nGenres :   Fantasy  Horror  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:30:07.610785"}