{"title": "Lost Highway", "film_link": "/Movie Scripts/Lost Highway Script.html", "script_link": "/scripts/Lost-Highway.html", "info_raw": "\n\nLost Highway Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Lynch  Barry Gifford\nGenres  Drama  Mystery  Thriller  Horror\nScript Date : June 1995\n\nRead \"Lost Highway\" Script\n\n\n", "script": "\nLost Highway\n\n\n\t\t\tA 21st Century Noir Horror Film.\n\n\t\t\tA graphic investigation into parallel \n\t\t\tidentity crises.\n\n\t\t\tA world where time is dangerously out \n\t\t\tof control.\n\n\t\t\tA terrifying ride down the lost highway.\n\n\n\n\n\t\t\t\t\t\t\tDavid Lynch\n\t\t\t\t\t\t\t21 June 1995\n\n\n\n\nAS CREDITS ROLL\n\nEXT. TWO-LANE HIGHWAY - NIGHT\n\nWe see a clean moving POV illuminated by headlights.  We're \nfloating down an old two-lane highway through a desolate, \ndesert landscape.  This gliding, eerie POV continues as \ncredits roll. when the credits end, the headlights seem to \ndim and soon we're moving through BLACKNESS.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT. THE MADISON HOUSE - BEDROOM - DAY\n\nin the blackness, a man, FRED, is sitting on a bed smoking a \ncigarette. we see his back, but with each glow of the \ncigarette ash, we see his face reflected in a mirror on the \nwall across from him.  In the darkness, there starts the \nsound of a motor which draws curtains back across a large \npicture window just off screen.  As the curtain moves, hard-edged \nlight begins crawling across the room, and we see \neverything clearly.  Fred is wearing a robe and pajamas, it's \nearly morning.\n\nCLOSE UP ON FRED'S FACE IN THE MIRROR - Blank expression - \nface somewhat obscured or distorted by smoke from the \ncigarette.\n\nCLOSE UP 0N FRED'S ACTUAL FACE - Unshaven, haggard look, eyes \nseem empty, glazed over.  Fred is 32 years old, with dark\nhair.\n\nTHE DOORBELL RINGS.  Fred looks up, startled by the noise.  \nHe looks at the digital clock: 5:30 a.m.\n\nFRED STANDS, goes to an INTERCOM on the wall next to the \nmirror.  He pushes a button.\n\nA VOICE comes over the intercom.\n\n\t\t\t\tVOICE OVER\n\t\t\t\tINTERCOM\n\t\tDick Laurent is dead.\n\nFred leaves the bedroom and goes through the house.  He is on \nthe upstairs level.  He looks through a narrow slot window, \nbut can't see the front door below.  He goes further in the \nhouse to a picture window that overlooks the street below.  \nThere is NOBODY there.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\n\nEXT. THE MADISON HOUSE - DAY\n\nWe can see Fred standing at the picture window, looking out.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT.  THE MADISON HOUSE - LIVING ROOM - NIGHT\n\nFred is dressed to go out: Black sport coat and slacks, \nbuttoned up white shirt.  He picks up a music case.  A woman \ncomes into the room.  This is Fred's wife, RENEE, 30 years \nold, dark hair, dressed smartly, a drink in her hand.\n\n\t\t\t\tRENEE\n\t\tYou don't mind that I'm not coming\n\t\ttonight?\n\n\t\t\t\tFRED\n\t\tWhat are you going to do?\n\n\t\t\t\tRENEE\n\t\tI thought I'd stay home and read.\n\nFred looks her over, she's sexy without trying.\n\n\t\t\t\tFRED\n\t\tRead?... Read what, Renee?\n\nRenee sits down on a couch and sips her drink.  Fred comes \nover to her, kisses her on the neck, which makes her laugh.\n\n\t\t\t\tFRED\n\t\tIt's nice to know I can still make you\n\t\tlaugh.\n\n\t\t\t\tRENEE\n\t\tI like to laugh, Fred.\n\n\t\t\t\tFRED\n\t\tThat's why I married you.\n\n\t\t\t\tRENEE\n\t\tWake me up when you get home.\n\nFred brushes her cheek with his fingers, allowing them to \nlinger for a moment on her face.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\n\nEXT.  CITY STREET - NIGHT\n\nA blue neon sign reads: LUNA LOUNGE.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT.  LUNA LOUNGE - NIGHT\n\nFred is on the bandstand.  He takes a solo on his saxophone.  \nFred plays hot, hard, neo-bop.  The BAND wails madly behind \nhim.  The PATRONS explode onto the dance floor, making it a \nwild scene.  Fred Is a lion now, roaring away on his tenor, \ndriving everyone nuts.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT.  LUNA LOUNGE - LATER\n\nAfter the band quits to take a break, FEMALE FANS come onto \nFred, but he moves away, refusing their attentions.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT.  LUNA LOUNGE - BACKSTAGE - LATER\n\nFred dials a pay phone. \n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. The MADISON HOUSE - NIGHT\n\nWe move through the empty living room - empty bedroom, etc.  \nThe ringing telephone goes unanswered.\n\nCUT TO:\n\nINT. LUNA LOUNGE - BACKSTAGE - NIGHT\n\n\nLOSE UP 0N FPED'S FACE as he listens to the ringing.  \nSweat is still rolling off his face.  His eyes are blank.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. THE MADISON HOUSE - NIGHT\n\nFred's car pulls up in the driveway in front of his house.\nFred gets out, and goes into the house carrying his music\ncase.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\nINT. THE MADISON HOUSE - NIGHT\n\nFred puts down his music case, goes to the bedroom, and sees \nRenee sleeping soundly.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nEXT. THE MADISON HOUSE - DOORSTEPS - DAY\n\nRenee in a bathrobe, opens the front door to collect the \nmail.  She sees a plain, clean, manila envelope lying on the \nstep.  She picks it up.\n\nCLOSE UP ON THE ENVELOPE - No stamp, no writing, blank.  She \ntakes the mail from the box, and goes back into the house.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - DAY\n\nRenee opens the manila envelope. She's noticeably nervous \nwhen she sees a videotape inside.  She stares at it.\n\nFred enters, also wearing a bathrobe.  He sees Renee staring \nat the videotape - before she hears him enter.  When she does \nhear him, her eyes jerk away from the tape.\n\n\t\t\t\tFRED\n\t\tWhat's that?\n\n\t\t\t\tRENEE\n\t\tA videotape.\n\n\t\t\t\tFRED\n\t\tWho's it from?\n\n\t\t\t\tRENEE\n\t\tI don't know... There's no return address \n\t\ton the envelope... In fact, there's no \n\t\taddress on it.\n\n\t\t\t\tFRED\n\t\tDoes it say anything on the tape?\n\n\t\t\t\tRENEE\n\t\t\t(looking it over)\n\t\tNo, nothing.\n\nFred walks over and picks up the tape.\n\n\t\t\t\tFRED\n\t\tWell, let's see what's on it.\n\nFred takes the tape to the VCR.  He inserts it into the\nmachine, and turns it on.  Fred goes toward the couch.\n\n\t\t\t\tFRED (CON'T)\n\t\t\t(to Renee)\n\t\tCome on.\n\nThey sit on the couch in front of the television.\n\nThe TV monitor: We begin on the TV, then the videotape fills \nthe entire frame.  The videotape shows the front of THE \nMADISON HOUSE, the camera panning slowly over it.  The \npicture is accompanied by an eerie DRONING SOUND.  After the \ncamera pans back to the front door, the tape image turns to snow.\n\nFred and Renee stare at the snow for a few moments.  Renee \nlooks relieved.\n\n\t\t\t\tRENEE\n\t\tIt must be from a real estate agent.\n\n\t\t\t\tFRED\n\t\tMaybe.\n\nWe see a WIDE SHOT encompassing Fred, Renee, and the snowy \nimage on the TV.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT. THE MADISON HOUSE - DINING ROOM - DAY\n\nRenee is seated at the dining room table - coffee cup and \ngrapefruit in front of her.  She is wearing glasses, reading \na book.  Fred enters, and sees Renee, who does not look up or \nacknowledge him.  Fred goes into the kitchen, which is just \noff the dining room.  He comes back into the dining room with \na cup of coffee, and sits down with it opposite Renee.  He \nlights up a cigarette, sips his coffee, and looks at her.\n\n\t\t\t\tFRED\n\t\tGood book, huh?\n\n\t\t\t\tRENEE\n\t\t\t(she looks up)\n\t\tHuh?... oh, yeah, it is.\n\n\t\t\t\tFRED\n\t\tSame one you were reading the other\n\t\tnight?\n\n\t\t\t\tRENEE\n\t\tWhat night?\n\n\t\t\t\tFRED\n\t\tWhen you didn't come to the club.\n\n\t\t\t\tRENEE\n\t\tOh. Oh, yeah.  No. This is a different\n\t\tone.\n\n\t\t\t\tFRED\n\t\tI called, you know.\n\n\t\t\t\tRENEE\n\t\tCalled?  When?\n\n\t\t\t\tFRED\n\t\tFrom the club.  You didn't answer.\n\n\t\t\t\tRENEE\n\t\tI must have fallen asleep.  I was asleep\n\t\twhen you got home, wasn't I?\n\n\t\t\t\tFRED\n\t\tYou were asleep when I got home, yes.\n\nRenee goes back to her book.  Fred sips his coffee and \nsmokes.\n\n\t\t\t\tRENEE\n\t\t\t(without looking up)\n\t\tI told you you could wake me up if you\n\t\twanted to.\n\nRenee looks up at him now, takes off her glasses, and stares \nat him.\n\nCLOSE UP OF FRED'S FACE - a disturbed expression.\n\nRenee seems about to say something more, but stops, puts her \nglasses back on and resumes reading.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\n\nINT. THE MADISON HOUSE - BEDROOM - NIGHT\n\nFred is in bed waiting for Renee.  He hears noises from the \nbathroom - bottles clinking, drawers opening and closing.  \nRenee comes out wearing a robe, which she sheds just before \ngetting into bed.  Naked under the covers, she switches out \nher bedside lamp.  The only light in the room comes from the \noutside, through the windows.  Fred moves closer to Renee, \nputs his lips to her cheek, a hand on her breast.  She does \nnot respond.  Fred pulls Renee to him, and kisses her \npassionately.  Renee accedes to his demands, but does not \nparticipate willingly.  He makes love to her voraciously, but \nher lack of passion disturbs him.  Fred can't stop, however, \nand when he comes she acts consolingly, stroking him \nmaternally while he calms down.  He climbs off of her and \nretreats to his side of the bed.\n\nCLOSE UP ON FRED'S EYES - which express his horror and \nhumiliation.\n\nThey lie there in the dark silence for a while.\n\nFred turns back toward Renee in the darkness.\n\n\t\t\t\tFRED\n\t\tI had a dream about you last night...\n\n\t\t\t\tRENEE\n\t\tYeah?\n\n\t\t\t\tFRED\n\t\tYou were in the house... calling my\n\t\tname... but I couldn't find you.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - NIGHT\n\nFRED'S DREAM\n\nFred is walking slowly across the living room.\n\nFred's POV: moving - searching.\n\nFred stops and listens.\n\n\t\t\t\tRENEE\n\t\t\t(tentatively - distant and off\n\t\t\tscreen)\n\t\tFred?  Fred, where are you?\n\nThe camera turns slowly back toward the hallway, and as it \ndrifts it RISES UP following along the hall and turning \nslowly into the bedroom.  Renee is lying below in the bed.\n\n\n\t\t\t\tFRED V.0.\n\t\tThen there you were... lying in bed... \n\t\tbut it wasn't you... It looked like \n\t\tyou... but it wasn't.\n\nThe camera suddenly dives violently at Renee - into a TIGHT \nCLOSE UP.  Her face registers TOTAL FEAR.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT.  THE MADISON HOUSE - BEDROOM - NIGHT\n\nFred is lying in bed with Renee, who is now backlit by her \nbedside lamp.  Fred looks at her shadowed face, but it's not \nRenee's face.  It's a face Fred has never seen before.  Fred \nquickly turns and switches on his bedside lamp, and looks \nquickly back at Renee, whose face is now her own.\n\n\t\t\t\tRENEE\n\t\tFred, are you all right?\n\nFred reaches out a hand and tenderly touches her face.  Renee \ncovers his hand with her own, and closes her eyes.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nEXT. THE MADISON HOUSE - DAY\n\nRenee finds another envelope on the doorstep.  She opens it, \npulls out a videotape.  A large dog is BARKING incessantly \nsomewhere in the neighborhood.  Renee looks around to see if \nshe can see the dog.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADIS0N HOUSE - LIVING ROOM - DAY\n\nRenee brings the videotape upstairs with the rest of the \nmail.  She is a bit puzzled and unsettled.  She puts the tape \ndown on a table.  She stares at it.  Fred comes in.\n\n\t\t\t\tFRED\n\t\tYou're up early.\n\n\t\t\t\tRENEE\n\t\tThat dog woke me.  I lay there for a\n\t\twhile, then decided to get up.\n\n\t\t\t\tFRED\n\t\tWho the hell owns that dog?\n\nFred notices the tape and manila envelope on the table.\n\n\t\t\t\tFRED\n\t\tWhat's that?  Another tape?\n\n\t\t\t\tRENEE\n\t\tYes, I just found it on the step.\n\nFred picks it up.\n\t\n\t\t\t\tFRED\n\t\tDon't you want to watch it?\n\n\t\t\t\tRENEE\n\t\tI guess so.\n\nFred goes to the VCR and inserts the tape.  He turns the \ntelevision on.  He is about to start the tape - he looks up \nfor Renee.  She's hanging back.\n\n\t\t\t\tFRED\n\t\tWell, do you wanna watch it?\n\nAgain, Renee seems to be nervous about what could be on the \ntape, but she hides this from Fred and walks toward the \ncouch.\n\n\t\t\t\tRENEE\n\t\tYeah.\n\nRenee sits on the couch.  Fred starts the VCR and joins her.\n\nAs before, we first see it on the TV, then the videotape \nfills the frame.  This tape shows the front of the house, as \nbefore, then shows the INTERIOR of Fred and Renee's house -\nAT NIGHT.\n\nThe eerie DRONING SOUND goes throughout.\n\nThe camera glides at a very high angle near the ceilings \nlooking down as it travels along a hallway and turns into \ntheir bedroom, where we see Fred and Renee sleeping.  The \ntape image then goes to snow.\n\nFred and Renee stare at the snowy TV picture.  After a few \nmoments of silence, Renee gets up and switches off the set.  \nShe is visibly shaken, trembling.  She stares fearfully at \nFred who seems less disturbed.\n\n\t\t\t\tRENEE\n\t\tWe've got to call the police.\n\n\t\t\t\tFRED\n\t\tAll right.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - DAY\n\nRenee is on the telephone.  Fred is pacing, smoking, behind \nher.\n\n\t\t\t\tRENEE\n\t\t...yes, I've been on hold for ten\n\t\tminutes... I can't... All right, thanks.\n\nRenee looks around anxiously.  Fred gives her his cigarette, \nwhich she puffs on.  He lights another and continues pacing.\n\n\t\t\t\tRENEE\n\t\tHello, yes... Good... My name is Renee\n\t\tMadison... My husband is Fred Madison,\n\t\tthe jazz musician... we\tlive at 442\n\t\tHollis Street... Right... 442 Hollis...\n\t\tnear the observatory... Someone's been in\n\t\tthe house... at night... while we were\n\t\tsleeping... I know because they sent, \n\t\tdropped off a videotape... two \n\t\tvideotapes... to show us... That's \n\t\tright... Yes... it... the second one... \n\t\tshows us asleep... Someone broke in and \n\t\ttaped us while we slept!... Isn't that \n\t\tenough?... Okay, sure... We will... 442 \n\t\tHollis... Yes, we'll be here.\n\nRenee hangs up.\n\n\t\t\t\tFRED \n\t\tSo?\n\n\t\t\t\tRENEE\n\t\tTwo detectives are coming out.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - DAY\n\nTwo men in suits - the Detectives, ED and AL, are seated on \nthe couch, watching the last part of the second videotape.  \nThe screen goes to snow and stays that way for several \nmoments, until Fred shuts it off.\n\n\n\t\t\t\tFRED\n\t\tThat's it.\n\n\t\t\t\tED\n\t\tLet's have a look at the hallway outside\n\t\tthe bedroom.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - HALLWAY - DAY\n\nAll four of them go to the hallway, where Ed and Al look \naround, especially up toward the ceiling.\n\n\t\t\t\tAL\n\t\tVery strange.\n\n\t\t\t\tRENEE\n\t\tWhat is?\n\n\t\t\t\tAL\n\t\tThe angle.  The high angle shot on the\n\t\ttape.\n\n\t\t\t\tED\n\t\tHow'd the camera get so high like that?\n\n\t\t\t\tAL\n\t\tAnd smooth... Almost no movement - back\n\t\tand forth, I mean.\n\n\t\t\t\tED\n\t\tLike you'd get if it was hand held.\n\n\t\t\t\tAL\n\t\tRight ... This just glided along.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - BEDROOM - DAY\n\nThe Detectives enter the bedroom.  Fred and Renee follow.\n\n\t\t\t\tED\n\t\tThis is the bedroom.\n\nThe Detectives look around without touching anything.\n\n\t\t\t\tAL\n\t\tDo you always sleep here?... In this\n\t\troom?... Both of you?\n\n\n\t\t\t\tFRED\n\t\tThis is our bedroom.\n\n\t\t\t\tED\n\t\tThere's no other bedroom?\n\n\t\t\t\tFRED\n\t\tNo... There is, I mean, I use it as a\n\t\tpractice room... it's soundproofed.\n\n\t\t\t\tAL\n\t\tYou're a musician?\n\n\t\t\t\tFRED\n\t\tYes, I thought my wife ...\n\n\t\t\t\tED\n\t\tWhat's your axe?\n\n\t\t\t\tFRED\n\t\tTenor... Tenor saxophone.  Do you...\n\n\t\t\t\tED\n\t\t\t(shakes his head)\n\t\tTone deaf.\n\n\t\t\t\tAL\n\t\t\t(to Renee)\n\t\tDo you own a video camera?\n\n\t\t\t\tRENEE\n\t\tNo. Fred hates them.\n\nThe Detectives both look at Fred.\n\n\t\t\t\tFRED\n\t\tI like to remember things my own way.\n\n\t\t\t\tAL\n\t\tWhat do you mean by that?\n\n\t\t\t\tFRED\n\t\tHow I remember them.  Not necessarily the\n\t\tway they happened.\n\n\t\t\t\tED\n\t\tDo you have an alarm system?\n\n\t\t\t\tRENEE\n\t\tYes, actually we do... but we haven't\n\t\tbeen using it.\n\n\t\t\t\tAL\n\t\tWhy not?\n\n\t\t\t\tFRED\n\t\tIt kept going off for some reason.  False\n\t\talarms.\n\n\t\t\t\tED\n\t\tMight be a good time to try using it\n\t\tagain.\n\n\t\t\t\tAL\n\t\tAnybody else have a key to the house.\n\n\t\t\t\tRENEE\n\t\tNo.\n\n\t\t\t\tAL\n\t\tMaid?  Relative?\n\n\t\t\t\tRENEE\n\t\tNo, one of us is always here to let the \n\t\tmaid in.  Nobody else has a key.\n\n\t\t\t\tED\n\t\t\t(to Al)\n\t\tLet's check the doors and windows... See\n\t\tif there's been a break-in.\n\nThey all leave the bedroom.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT THE MADISON HOUSE FRONT DOOR - DAY\n\nEd is checking the door for marks.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT.  THE MADISON HOUSE    LIVING ROOM - DAY\n\nFred's POV: He's watching Ed and Al with Renee who are \noutside the house, walking around the property, checking \nit out.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT.  THE MADISON HOUSE - DRIVEWAY - DAY\n\nEd and Al are standing by an unmarked police car with Fred \nand Renee.  The Detectives are about to depart.\n\n\t\t\t\tAL\n\n\t\tWe'll keep a watch on the house.\n\n\t\t\t\tED\n\t\tAs best we can.\n\n\t\t\t\tAL\n\t\tIf anything else happens, you'll call us.\n\t\tAl hands Fred a card.  Ed hands Renee a card.\n\n\t\t\t\tRENEE\n\t\tWe will.\n\n\t\t\t\tFRED\n\t\tThanks, guys.\n\n\t\t\t\tED\n\t\tIt's what we do.\n\nEd and Al get into the car and drive off.  Renee and Fred \nlook at each other, warily, then go back into the house.  THE \nCAMERA SLOWLY PANS OVER THE FRONT OF THE HOUSE AS IN THE\nVIDEOTAPE.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nINT. LUNA LOUNGE - NIGHT\n\nFred is on the bandstand, sweating, and honking his\nsaxophone.  He handles the horn roughly, braying like a beast \nas the CROWD gathered in front of the stage gyrates as one \nswept away in the madness of the moment.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT.  LUNA LOUNGE - SAME\n\nAt the back, near the side door, Renee can be seen with TWO \nMEN, only one of whose faces we see.  The trio are going out \nthe side door led by one of the men; we see only the back of \nhis head.  Renee glances briefly at the bandstand before she \nexits with the two men.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. LUNA LOUNGE - BANDSTAND - SAME\n\nCLOSE UP OF\tFRED as he plays, seemingly oblivious to his\nsurroundings. His eyes open and shut as he clamps down on\nthe horn.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. LUNA LOUNGE - SAME\n\nIn the back of the club, the side door slowly closes.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nINT.  THE MADISON HOUSE - STAIRWELL / LIVING ROOM - DAY\n\nFred is standing in the living room looking in the direction \nof the stairwell.  We HEAR someone's steps coming up the \nstairs.  It's Renee, who eventually comes into view.  She is \nholding another manila envelope.  She arrives at the top \nstep.\n\nShe and Fred lock eyes.\n\nFred takes the envelope, opens it, and pulls out a third \nvideotape. without saying anything, Fred takes the tape to \nthe VCR.  He inserts it very carefully, slowly.  He hits \nplay, turns on the television and he and Renee sit down on \nthe couch together and begin to watch with great \napprehension.\n\nAgain we begin with a WIDE SHOT and then the TV monitor fills \nthe screen: We see the interior of the house at night.  The \ncamera glides looking down from a high angle along the \nhallway and into the bedroom, where Fred and Renee are \nsleeping.\n\nAgain, the DRONING SOUND plays throughout.\n\nin the bedroom where Fred and Renee are seen sleeping, \nSUDDENLY, Fred, on the tape, slowly awakens as the camera \nholds on him.  He rises and turns unnaturally in the bed, as \nif drawn up by his awareness of some strange presence in the \nroom.  He comes to a sitting position, his head straining \nupwards, looking in the direction of the camera.  At this \npoint, the videotape image turns to snow.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - DAY\n\nFred and Renee are on the couch.  The TV remains on, showing \nsnow.\n\nRenee is very upset, crying.\n\n\t\t\t\tRENEE\n\t\tWhat the hell is going on?!\n\n\t\t\t\tFRED\n\t\t\t(equally horrified -\n\t\t\tfrightened)\n\t\tI wish I knew.\n\nFred reaches over and tentatively takes Renee's hand in his.  \nShe trembles, allows him to touch her, but otherwise does not \nrespond.  Suddenly, she jumps with fright.\n\n\t\t\t\tRENEE\n\t\tWhat was that?!!!\n\n\t\t\t\tFRED\n\t\tWhat?\n\n\t\t\t\tRENEE\n\t\tOn the tape!  There was something else on\n\t\tthe tape.\n\nFred gets up and rewinds it, passing an image.\n\n\t\t\t\tRENEE (CON'T)\n\t\tThere!  Play it!\n\nFred runs the tape forward.\n\nWe see snow - then a half-second long MEDIUM SHOT of Fred on \nhis knees near the bedroom wall on Renee's side of the bed.  \nHe is looking directly at the camera - his face a ghastly \ngrimace, contorted.  His eyes are WIDE WITH HORROR.\n\nFred runs it back again and FREEZES the tape there on his \ntormented image.  This image fills the screen.  He and Renee \nstare at it.\n\nDISSOLVE TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - DAY\n\nThe Detectives, with Fred and Renee are seated on chairs and \nthe couch.  The three videotapes in their manila envelopes \nare stacked on a coffee table in the center.\n\n\t\t\t\tAL\n\t\tYou don't remember being awakened?  It\n\t\tlooks like you were aware of someone.\n\n\t\t\t\tED\n\t\tOr something.\n\n\t\t\t\tFRED\n\t\tNo, I don't remember anything. it looks\n\t\tlike I... but... I don't remember.\n\n\t\t\t\tRENEE\n\t\tWhy would anyone do something like this?\n\n\t\t\t\tAL\n\t\tHas anyone made any threats to either of\n\t\tyou recently?\n\n\t\t\t\tED\n\t\tOr not so recently?\n\n\t\t\t\tFRED\n\t\tNo, not to me.\n\nAl, Ed and Fred all look at Renee.\n\n\t\t\t\tRENEE\n\t\tI...\tno. No. No threats.\n\n\t\t\t\tED\n\t\tWe'll take the tapes with us, if that's\n\t\tall right with you?\n\nEd looks at Fred, then Renee, both of whom nod their \nagreement.\n\n\t\t\t\tAL\n\t\tWe'll see that the patrol of the house is\n\t\tdoubled.\n\n\t\t\t\tRENEE\n\t\tI don't know if I want to stay here.  I\n\t\tdon't feel safe.\n\n\t\t\t\tFRED\n\t\tWhere would you feel safe?\n\n\t\t\t\tRENEE\n\t\tI don't know. maybe a hotel.\n\nEd and Al are watching this exchange between Fred and Renee \nwith keen interest.\n\nThere is a strained silence between them.\n\n\t\t\t\tED\n\t\tDid you use the alarm system since we\n\t\twere here last?\n\n\t\t\t\tFRED\n\t\tThe first night ... Not the last two.\n\n\t\t\t\tAL\n\t\tWhy not?\n\n\t\t\t\tFRED\n\t\t\t(shrugs)\n\t\tI forgot.  Anyway, I hate the idea of\n\t\tacting paranoid.\n\n\t\t\t\tRENEE\n\t\tActing paranoid?!!! Someone is in our \n\t\thouse while we're sleeping, filming us, \n\t\tand you don't want to act paranoid?!!! I \n\t\tthought you set the alarm!\n\nFred gets up, lights a cigarette, paces.\n\n\t\t\t\tFRED\n\t\tI'll make sure the alarm is set from now\n\t\ton.\n\n\t\t\t\tRENEE\n\t\tBut that doesn't solve the problem.  Who\n\t\tis doing this?  And why?\n\nEd and Al rise from their chairs.  Ed picks up the envelopes.\n\n\t\t\t\tAL\n\t\tWe'll find out, Mrs. Madison.\n\nRenee stands with the Detectives.  Fred stands apart - his \nexpression, pained and bewildered.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. ANDY'S HOUSE - NIGHT\n\nA swinging party is in progress at Andy's house - the man\nwhose face we saw at the Luna Lounge with Renee.  ANDY, 37 \nyears old, a slick guy, is seen moving through the crowd, \nmaking small talk, kissing and being kissed.  The PEOPLE here \nare wannabe players, the men mostly shady, gold-chain-\nwearing, slightly unsavory types; the women dressed \nprovocatively, big hair and skin-tight dresses.  Through \nsliding glass doors we see nude and semi-nude people \ncavorting in a swimming pool.  Everyone has a drink in his or \nher hand.  Renee finishes her drinkt and hands the empty\nglass to Fred who walks away with it.  Andy grabs Renee, and \ndances with her.  They laugh and talk.  Renee appears to be a \nbit intoxicated.\n\nFred, who appears less than thrilled with the carryings on, \nmakes his way to the open bar where he orders two drinks. \nWhen the drinks arrive he drains one of them completely, then \nsets the empty glass down on the bar.  Then he swallows the \nother drink, too, and sets down the glass.\n\nA MYSTERY MAN, tall, well-dressed and groomed, older than \nFred, approaches him.\n\n\t\t\t\tMYSTERY MAN\n\t\tWe've met before, haven't we?\n\n\t\t\t\tFRED\n\t\tI don't think so.  Where was it that you\n\t\tthink we've met?\n\n\t\t\t\tMYSTERY MAN\n\t\tAt your house.  Don't you remember?\n\n\t\t\t\tFRED\n\t\t\t(surprised)\n\t\tNo, no I don't.  Are you sure?\n\n\t\t\t\tMYSTERY MAN\n\t\tOf course.  In fact, I'm there right now.\n\n\t\t\t\tFRED\n\t\t\t(incredulous)\n\t\tWhat do you mean?  You're where right\n\t\tnow?\n\n\t\t\t\tMYSTERY MAN\n\t\tAt your house.\n\n\t\t\t\tFRED\n\t\tThat's absurd.\n\nThe Mystery Man reaches into his coat pocket, takes out a \ncellular phone and holds it out to Fred.\n\n\t\t\t\tMYSTERY MAN\n\t\tCall me.\n\nFred snickers, like this is a bad joke.  The Mystery Man puts \nthe phone into Fred's hand.\n\n\t\t\t\tMYSTERY MAN\n\t\t\t\t(CON-T)\n\t\tDial your number.\n\nFred hesitates, puzzled.\n\n\t\t\t\tMYSTERY MAN\n\t\t\t\t(CON-T)\n\t\tGo ahead.\n\nFred shrugs, laughs, dials his number. We HEAR a pick up as \nwe stay on FRED'S FACE.\n\n\t\t\t\tPHONE VOICE OF \n\t\t\t\tMYSTERY MAN\n\t\tI told you I was here.\n\nFred, still holding the phone, stares at the man standing in \nfront of him.\n\n\t\t\t\tFRED\n\t\tHow did you do that?\n\nThe Mystery Man points to the phone.\n\n\t\t\t\tMYSTERY MAN\n\t\t\t\tAsk me.\n\nFred, mirthful at first, as if it is a party trick of some \nkind, suddenly turns serious - it's obvious he's thinking now \nof the videotapes.  He speaks into the phone.\n\n\t\t\t\tFRED\n\t\t\t(angrily)\n\t\tHow did you get into my house?\n\n\t\t\t\tPHONE VOICE OF\n\t\t\t\tMYSTERY MAN\n\t\tYou invited me.  It's not my habit to go\n\t\twhere I'm not wanted.\n\nFred looks at the man in front of him, but speaks again into \nthe phone.\n\n\t\t\t\tFRED\n\t\tWho are you?\n\nThe man laughs - identical laughs - both over the phone and in person.\n\n\t\t\t\tPHONE VOICE OF\n\t\t\t\tMYSTERY MAN\n\t\tGive me my phone back.\n\nThe man in front of Fred reaches out his hand for the phone.  \nFred hears the line go dead, and he slowly passes the phone \nback to the Mystery Man who takes it, folds it, and puts it in his pocket.\n\n\t\t\t\tMYSTERY MAN\n\t\tIt's been a pleasure talking to you.\n\nThe man walks away from Fred.  Renee appears and comes up to Fred.\n\n\t\t\t\tRENEE\n\t\tI thought you were getting me a drink?\n\n\t\t\t\tFRED\n\t\tJust a minute.\n\nHe takes Renee by the arm and goes over to the host of the \nparty, Andy.  He grabs Andy and points across the room toward \nthe Mystery Man, who is engaged in conversation with OTHER \nGUESTS.\n\n\t\t\t\tFRED\n\t\tAndy, who is that guy?\n\n\t\t\t\tANDY\n\t\t\t(looking at the Mystery Man)\n\t\tI don't know his name.  He's a friend of\n\t\tDick Laurent's, I think.\n\n\t\t\t\tFRED\n\t\tDick Laurent?\n\n\t\t\t\tANDY\n\t\tYes, I believe so.\n\n\t\t\t\tFRED\n\t\t\t(remembering something)\n\t\tBut Dick Laurent is dead, isn't he?\n\n\t\t\t\tANDY\n\t\tHe is?  I didn't think you knew Dick.\n\t\tHow do you know he's dead?\n\nAndy and Renee exchange a worried look, which Fred does not notice.\n\n\t\t\t\tFRED\n\t\tI don't.  I don't know him.\n\n\t\t\t\tANDY\n\t\t\t(angrily)\n\t\tDick can't be dead.  Who told you he was\n\t\tdead?\n\n\t\t\t\tRENEE\n\t\tHoney, who?... Who's dead?\n\nFred takes Renee by the arm away from Andy.\n\n\t\t\t\tFRED\n\t\tLet's go home.\n\n\t\t\t\tRENEE\n\t\tBut...\n\n\t\t\t\tFRED\n\t\tNow!  We're leaving now! I didn't want\n\t\tto come here in the first place.\n\nFred drags the reluctant Renee out of Andy's house.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. CAR - NIGHT\n\nFred is driving fast and recklessly.  Renee is drunk and is \nsmiling at him.\n\n\t\t\t\tFRED\n\t\tHow'd you meet that asshole, Andy,\n\t\tanyway?\n\nRenee stares out the front window - thinks back.\n\n\t\t\t\tRENEE\n\t\tIt was a long time ago... I met him at \n\t\tthis place called Moke's... We... became \n\t\tfriends... He told me about a job...\n\n\t\t\t\tFRED\n\t\tWhat job?\n\n\t\t\t\tRENEE\n\t\tI don't remember... Anyway, Andy's \n\t\tokay...\n\n\t\t\t\tFRED\n\t\tHe's got some fucked up friends.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. THE MADISON HOUSE - DRIVEWAY - NIGHT\n\nFred and Renee's car pulls up in front of their house.  Fred \njumps out of the car.\n\n\t\t\t\tFRED\n\t\tStay in the car!\n\nFred enters the house, careful to turn off the alarm first.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - NIGHT\n\nThere are only a couple of dim lights on, the house is mostly \ndark.  Fred moves slowly and carefully through his house -\nsearching each room for a possible intruder.\n\nFred's POV - moving creepily room by room through the dark \nhouse - past the telephone - down the hall to the bedroom.\n\nThere is NO ONE there.\n\nHe goes back outside for Renee.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. THE MADISON HOUSE - DRIVEWAY - NIGHT\n\nRenee is standing next to the car, shivering.\n\n\t\t\t\tFRED\n\t\tI told you to stay in the car!\n\n\t\t\t\tRENEE\n\t\tWhy? what is it?  Why did you make me\n\t\twait out here?\n\n\t\t\t\tFRED\n\t\tI thought there might be somebody inside.\n\n\t\t\t\tRENEE\n\t\tWas there?\n\n\t\t\t\tFRED\n\t\tNo... of course not.\n\nThey enter the house.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - NIGHT \n\nFred switches on more lights.\n\n\t\t\t\tRENEE\n\t\tIt's so odd... Waiting out there, I had \n\t\tthe strangest feeling... Like this had \n\t\thappened before.  I mean, your telling me \n\t\tto stay outside while you went in like \n\t\tthat.\n\nFred looks at Renee, then continues to look around the house, \ndisturbed, seriously disquieted.  Renee, still tipsy, follows \nhim, moving from room to room.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - BEDROOM, ETC. - NIGHT\n\nFred and Renee are preparing to go to bed. Renee goes\tinto\nthe bathroom off the bedroom. Fred takes another look\tout\ninto the hallway.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - HALLWAY - NIGHT\n\nFred walks down the hallway.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - NIGHT\n\nFred looks around the dark living room.  Then absentmindedly, \nhe begins to inspect objects.  He picks up an ashtray and \nstudies it - lost in thought.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - BATHROOM - NIGHT\n\nRenee is washing her face, standing at the sink in her slip.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - NIGHT \n\nFred is staring at himself in a mirror.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - BEDROOM - NIGHT\n\nRenee comes in.  Fred is not there.  She goes to the door and \npeeks down the hallway.\n\n\t\t\t\tRENEE\n\t\t\t(tentatively)\n\t\tFred?  Fred, where are you?\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - NIGHT\n\nNo one is in the living room now - but a SHADOW moves slowly \nacross a wall.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - HALLWAY - NIGHT\nRenee's POV - down the hallway.  There is just darkness at \nthe end of the hall.  It is EERIE.  After a moment, Fred \nslowly walks out of the darkness toward Renee.  He walks out \nof the shot and the camera remains on the rectangle of \ndarkness at the end of the hall.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT. THE MADISON HOUSE - LIVING ROOM - DAY\nFootsteps can be heard on the stairs.  Fred's head appears at \nthe top of the stairway.  He comes up into the living room \ncarrying a manila envelope, like the ones previously \nreceived.  His expression is strained.  He is alone.  Fred \npulls a videotape out of the envelope and inserts it in the \nVCR, turns it on.  He sits on the couch and watches.  We go \nfrom a WIDE SHOT to a FULL FRAME SHOT of the video.\n\nOn the tape is the same nighttime interior of the house, \naccompanied by the DRONING SOUND.  The camera moves eerily \ndown the hall toward the bedroom, sliding at a high angle.  \nThe camera turns slowly into the bedroom - looking down.\n\nBLOOD is splattered over the floor, bed, walls.  The camera \ndrifts.  THE DEAD BODY OF RENEE lies on the floor at the foot\nof the bed.  She is badly mutilated.  Fred is hovering over \nher on the tape, ON HIS KNEES, A HORRIFIED, UNBELIEVING \nEXPRESSION ON HIS FACE.  On the tape, Fred turns away from \nRenee - his hands raised, dripping blood - her blood.  His \nmovements are almost mechanical, constricted, as he strains \nstrangely upwards seemingly against his will, as if feeling \nsome enormous pressure.  He looks directly at the camera, his \nface a ghastly grimace, contorted, just before the taped \nimage goes to snow.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. THE MADISON HOUSE - LIVING ROOM - DAY\n\nFred, sitting in front of the TV, shudders as the tape ends.  \nHe sits trembling, attempts to speak, almost chokes, and \nfinally releases a tortured, warbly cry.\n\n\t\t\t\tFRED\n\t\tRenee!\n\nFred looks up as if seeing something, he starts to stand, \n-staggering, partially paralyzed.\n\n\t\t\t\tFRED (CON'T)\n\t\t\t(Shouting)\n\t\tRENEE!\n\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. POLICE STATION - INTERROGATION ROOM - NIGHT\nFred's POV: A BIG FIST slams into Fred's face, knocking him \nback in a chair.  Ed and Al are standing in front of Fred.\n\n\t\t\t\tED\n\t\tStay put, killer!\n\nThe Detectives' POV: Fred's face is a bloody mask.  He is \ncrying, whimpering.\n\n\t\t\t\tFRED\n\t\tI didn't kill her! Tell me I didn't kill\n\t\ther!\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. JAIL CELL - DAY\n\nFred, his lips and eyes swollen, sits on a cot, dressed in \njail clothes.  He studies his hands, which appear crippled.  \nHe flexes the fingers, slowly, painfully.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. THE MADISON HOUSE - DAY\n\nWe are in back of the house tracking slowly past the bedroom \nand living room windows. Inside the house, INVESTIGATORS and \nFORENSIC EXPERTS are moving around, measuring, scraping \nsamples of carpet, searching for fingerprints on furniture.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. CITY MORGUE - NIGHT\n\nRenee's CORPSE on a slab is rolled into an examining room by \nan ATTENDANT.  The entrance of the body is shown reflected in \na chrome-framed mirror that juts out from a tile wall.  The \nAttendant prepares for the impending autopsy, laying out a \nrack of instruments, positioning the corpse.  As he is doing \nthese things, the MEDICAL EXAMINER enters, accompanied by his \nGIRLFRIEND.  The M.E. is dressed formally, in a tuxedo.  The \nyoung woman is wearing a slinky dress with a fur wrap, \npearls, spike heels.  The couple are close; she has an arm \nthrough his, and she laughs, nervously.  He is smoking a \ncigarette.\n\n\t\t\t\tATTENDANT\n\t\tHi, doc. Workin' late tonight, huh?\n\n\t\t\t\tM.E.\n\t\tParty at the mayor's house, George.  This\n\t\tis his daughter, Joyce.\n\n\t\t\t\tATTENDANT\n\t\tHowdy, Joyce.\n\n\t\t\t\tJOYCE\n\t\tHowdy, George.\n\nThe Attendant uncovers the body - individual parts are \nwrapped like packages from a butcher's shop, and labeled: L. \nARM, HEAD, R. BREST (misspelled).\n\n\t\t\t\tM.E.\n\t\t\t(looking at the packages)\n\t\tJust like Christmas.\n\nHe begins to unwrap them.\n\n\t\t\t\tJOYCE\n\t\tI don't know if I can watch this.\n\nThe M.E. tosses his cigarette down on the floor.  The camera \ngoes down on the smoking cigarette butt on the floor drain; \nsmoldering there among hair and flesh gristle on the drain's \nfilter screen.\n\n\t\t\t\tM.E.\n\t\t\t(Voice-over)\n\t\tLeave any time you want, lover.  I won't\n\t\ttake it personally.\n\nThe camera stays on the drain as we HEAR the M.E. unwrapping \nthe packaged body parts.  Joyce's high heels enter the frame \naround the drain.  She is stepping nervously, like a spooked \nhorse.  The clatter of her heels is very loud.  We hear the \nM.E. chuckle.\n\n\t\t\t\tM.E.\n\t\t\t(Voice-over)\n\t\tEasy, girl, easy.\n\n\t\t\t\tJOYCE\n\t\tYou talking to me or... her?\n\n\t\t\t\tM.E.\n\t\t\t(laughs)\n\t\tA corpse can tell you plenty, Joyce.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. COURTROOM - DAY\n\nThe camera is behind a female FOREMAN in the jury box.  The \nshot begins on her shoes and travels up her body as she\nstands.  Over her left shoulder we see Fred standing at the\ndefense table. Over her right shoulder the JUDGE is seated.\n\n\t\t\t\tJUDGE\n\t\tHave you reached a verdict?\n\n\t\t\t\tFOREMAN\n\t\tYes, we have, your honor.\n\n\t\t\t\tJUDGE\n\t\tPlease hand it to the bailiff.\n\nThe BAILIFF goes to the Foreman, takes the paper from her, \nthen takes it to the Judge.  The Judge opens it and reads it \nto himself, then hands it back to the Bailiff, who returns it \nto the Foreman.\n\n\t\t\t\tJUDGE\n\t\tAnd what is your verdict?\n\nThe camera moves to Fred, registering his tension.  The \ncamera goes to the Foreman's face.\n\n\t\t\t\tFOREMAN\n\t\tWe the jury find the defendant guilty of\n\t\tmurder in the first degree.\n\nFred faints.  Fe is lifted up by his ATTORNEY and GUARDS in \nattendance.  Fred revives slightly.\n\n\t\t\t\tJUDGE\n\t\tFred Madison, the jury having found you \n\t\tguilty of murder in the first degree, it \n\t\tis my order that on a date to be \n\t\tdetermined, you be put to death in the \n\t\telectric chair.\n\nWe see Fred's eyes roll open as he cranes his neck around and \nupwards, looking at the video camera high on the wall of the \ncourtroom, pointing down on him.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. LINGERIE SHOP - DAY\n\nMARIAN and RAQUEL, two exquisite young women, are looking \nover the merchandise.\n\n\t\t\t\tRAQUEL\n\t\tDid you see that about the guy who \n\t\tchopped up his wife into a million \n\t\tpieces?\n\n\t\t\t\tMARIAN\n\t\tHow could I miss it?  The TV won't quit\n\t\twith that stuff.\n\n\t\t\t\tRAQUEL\n\t\tThey're gonna cook him.\n\n\t\t\t\tMARIAN\n\t\tAndy's from Utah.  He says there you have \n\t\ta choice... You can die by hanging or by \n\t\tfiring squad.\n\n\t\t\t\tRAQUEL\n\t\tWhich would you choose?\n\nMarian holds up a black teddy to her body.\n\n\t\t\t\tMARIAN\n\t\tAndy would go for this, don't you \n\t\tthink?... Firing squad, definitely.\n\n\t\t\t\tRAQUEL\n\t\tDo they aim for the head or for the\n\t\theart?\n\n\t\t\t\tMARIAN\n\t\tThe heart, I guess.\n\n\t\t\t\tRAQUEL\n\t\tI wouldn't... The brain would know what's \n\t\tgoing on.  Your heart would be ripped \n\t\topen trying to pump blood, blood pouring \n\t\tinto the chest cavity.  Savage pain, \n\t\tMarian.\n\nRaquel takes a red teddy and holds it up to her chest.\n\n\t\t\t\tMARIAN\n\t\tOh, that's hot... So you'd rather be\n\t\thung, huh?\n\nThey both giggle at the obvious joke.\n\n\t\t\t\tRAQUEL\n\t\tAbsolutely... Soon as your neck snaps, \n\t\tyou black out.  It might take a while for \n\t\tthe body to die, but you wouldn't feel \n\t\tit.\n\nMarian reaches for a pair of panties with a hole in the crotch.\n\n\t\t\t\tMARIAN\n\t\tYou might be right, Raquel.\n\nMarian sticks a finger through the hole in the panties and \nwiggles it.  The girls giggle.  Raquel sees Andy walking into \nthe store.  He is sneaking up behind Marian, and motions with \na finger to his lips to Raquel not to say anything.  When \nAndy gets directly behind Marian, he puts his hands over her \neyes.\n\n\t\t\t\tANDY\n\t\tGuess who?\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - DEATH ROW - DAY\n\nFred, in the custody of GUARDS, wearing handcuffs and leg \nirons, is being escorted to his cell.  He appears zombie-like \nas the guards open the cell door, unlock and remove his \nshackles, and lock him in.\n\n\t\t\t\tGUARD\n\t\tMake yourself to home, fella.\n\nThe guards leave.  Fred stands near the cell door, begins to \nlook around at the four walls, the single cot, the wash \nbasin, and the toilet bowl without a seat.  He hears the \nmuffled, DISTORTED NOISES - VOICES from the surrounding \ncells.  Lost voices - the voices of death row.  Fred \nrealizes where he is now.  He walks over to the cot and \nslowly sinks down and sits on the edge.  Fred perched on the \ncot in his cell resembles a man adrift on a tiny raft in the \nmiddle of an ocean.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT. PRISON - DEATH ROW - DAY\n\nA TRUSTEE is pushing a meal cart along the row.  At each \ndoor, the Trustee stops and takes a tray off the cart.  He \nshoves the meal tray through a slot in the door.  We watch \nhim distribute the trays down the long row of cells.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. PRIS0N - DEATH ROW HALLWAY - NIGHT\n\nThe hallway is quiet - distant sounds reverberate.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\nINT. PRISON - FRED'S CELL - DAY\n\nFred sits on the edge of his bed, a tray of prison food sits \non the floor - uneaten.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. PRISON - FRED'S CELL   NIGHT\n\nFred lies awake on his cot   he stares at the ceiling.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. PRISON - DEATH ROW HALLWAY - NIGHT\n\nThe hallway is quiet - distant sounds reverberate.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. PRISON - EXERCISE YARD - DAY\n\nThis is a small narrow yard, not the large exercise yard for \npopulation.  This yard is for use by death row prisoners \nonly, to exercise in one hour each day, by himself.  Fred is \nreleased into the area, which is more like a dog run.  The \nGuards watch Fred as he walks slowly up and down the exercise \nyard.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - DEATH ROW - NIGHT\n\nThere is more activity on the row tonight than usual.  A \nCOUPLE of MEN in suits walk through with an air of authority.\n\nThere is a building murmur among the prisoners.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - FRED'S CELL - NIGHT\n\nFred sits on the edge of his bed, listening as sound of \nthe prisoners builds.  He's shaking.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRIS0N - DEATH ROW - NIGHT\n\nTWO GUARDS are standing at the guard station.\n\n\t\t\t\tGUARD #1\n\t\t\t(very quietly - solemnly)\n\t\tHere he comes.\n\nSeveral of the men in suits, along with several GUARDS, and a \nCLERGYMAN, a PRISONER in the middle of the group, enter the \nhallway.  They proceed past the guard station down the hall.  \nAs the procession files by, DEATH ROW INMATES come to their \ndoors and talk to the prisoner.\n\n\t\t\t\tINMATE #1\n\t\tSee you soon, Sammy.  Don't think takin' \n\t\ta jolt is gonna get you outta payin' me \n\t\tback the twenty you owe me.\n\n\t\t\t\tINMATE #2\n\t\tDon't take it personal, pal.\n\n\t\t\t\tINMATE #3\n\t\tUn fuerte abrazo, amigo!\n\nAs the men march down the hallway, they pass Fred's cell.  \nHis window panel is empty.  The camera stops on Fred's cell \ndoor, as we HEAR other prisoners talking to the inmate on his \nway to the ELECTRIC CHAIR.\n\n\t\t\t\tINMATE #4\n\t\tHang in there, honey.\n\n\t\t\t\tINMATE #5\n\t\tKeep an eye out for me, Sammy G.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - FRED'S CELL - NIGHT\n\nFred sits on his bed, listening fearfully.  The camera stays \non Fred as we HEAR:\n\n\t\t\t\tINMATE #6\n\t\tShow 'em you got big stones, bro.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - DEATH CHAMBER - NIGHT\n\nThe prisoner is strapped into the electric chair.  Behind a \nglass partition WITNESSES are seated. One of the men in \nsuits, the WARDEN, goes to a telephone on the wall and stands \nwith his hand on the receiver.  He picks it up.\n\n\t\t\t\tWARDEN\n\t\t\t(into phone)\n\t\tLine check.\n\t\t\t(pause)\n\t\tOkay.\n\nThe Warden hangs up the telephone and stays next to it.\n\nWe see one of the condemned man's WRISTS being clamped with \nan electrical device.  The other wrist is clamped.\n\nA metal halo is placed around the condemned man's head.  A \nlarge electrical cable leads off from the halo.\n\nElectrically conductive ointment is smeared around the areas \nwhere the clamps have been placed.\n\nThe Clergyman moves close to the condemned man continuing to \ngive the man his last rites.  When he is finished, he nods to \nthe Warden.  The Warden approaches the condemned man.\n\n\t\t\t\tWARDEN\n\t\tAny final words, Sam?\n\nThe condemned man shakes his head \"no\".\n\nThe Warden and the others clear the room and the doors are \nlocked.\n\nThe EXECUTIONER steps into place near a huge lever.  He looks \nto the Warden.\n\nThe Witnesses sit in silent anticipation.\n\nThe hands of the clock on the wall have moved past midnight.\n\nThe Warden takes one last look through a window at the \ncondemned man - then nods to the Executioner.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - FRED'S CELL - NIGHT\n\nFred sits frozen at the edge on his bed.\n\nA distant but LOUD ELECTRICAL HUM begins.\n\nFred's head jerks upward to the light on his ceiling.  It has \ndimmed to almost nothing.\n\nFred sits in the humming darkness.\n\n\t\t\t\t\t\t\tSLOW DISSOLVE TO:\n\nINT. PRIS0N - EXERCISE YARD - DAY\n\nThe Guards release Fred into the yard for his exercise.  At \nfirst the sunlight is blinding, and Fred covers his eyes.  He \nmoves along the wall, tentative, his fingers feeling the way.  \nFnally he slumps down on his haunches, back leaned \nagainst the wall, eyes closed, letting the sun hit his face.  Very \nsoon, however, the sun passes behind a cloud and Fred is \nbathed in shade.  Fred stands up, but is almost immediately \nhit by a searing pain in his head.  Fred holds his head with \nhis hands, sinks down to his knees.  The Guard, who has been \nobserving Fred from the doorway, comes over to him.\n\n\t\t\t\tGUARD\n\t\tSomething wrong?\n\n\t\t\t\tFRED\n\t\tMy... My head.\n\n\t\t\t\tGUARD\n\t\tHeadache, huh?  Too much sun, I guess.  \n\t\tYou want to come in?  Still got forty-\n\t\tfive minutes outside if you want it.\n\n\t\t\t\tFRED\n\t\tNo, no.  I want to go in.\n\nThe guard assists Fred back inside the building.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - FRED'S CELL - DAY\n\nFred is on his cot, holding his head.  He is obviously in \npain.  He gets up and staggers to the cell door.  Fred pushes \na CALL button next to the door to summon a guard.  The GUARD \ncomes and speaks to Fred through a double mesh opening.\n\n\t\t\t\tGUARD\n\t\tWhat's botbering you, Madison?\n\n\t\t\t\tFRED\n\t\tThe pain is getting worse.  I need more\n\t\taspirin.\n\n\t\t\t\tGUARD\n\t\tI can't give you anymore.  I'll talk to\n\t\tthe doctor.\n\nThe guard leaves. Fred collapses to the floor of the cell,\nwrithing in pain.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - INFIRMARY   DAY\n\nFred is brought in wearing handcuffs and leg irons, a GUARD \non either arm.  He is placed on a chair in the middle of the \nroom.  The guards stand one on each side of him.  A DOCTOR \nenters.  He is in late-middle age, with serious eyebrows.  \nFred's head is hanging down, chin on chest.  The Doctor lifts \nFred's head and we see dark circles under Fred's eyes; his \nface is pale, teeth clenched, eyes tearing.  The Doctor takes \na light utensil from his pocket, and inspects each of Fred's \neyes.  He feels Fred's forehead.  After this, he allows \nFred's head to drop down again.  The Doctor takes Fred's \npulse.  He drops Fred's wrist.  He next takes Fred's blood \npressure.\n\n\t\t\t\tDOCTOR\n\t\tYou sleeping okay?\n\n\t\t\t\tFRED\n\t\t\t(strained whisper)\n\t\tI can't sleep.\n\nThe Doctor goes over to a cabinet, unlocks a drawer, and \nremoves a large blue pill.  He fills a paper cup with water \nfrom a dispenser, goes back to Fred and places the pill in \nFred's mouth.  The Doctor tilts Fred's head up and pours the \nwater down his throat, some of it dribbling down the front of \nFred's shirt.  The Doctor looks into Fred's mouth to make \nsure he swallowed the pill.\n\n\t\t\t\tDOCTOR\n\t\tYou'll sleep now.\n\t\t\t(to Guards)\n\t\tTake him back to his cell.\n\nThe guards lift Fred by his arms, and shuffle march him out \nof the infirmary.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - FRED'S CELL - NIGHT\n\nFred awakens on his cot.  He turns and sits up in the \ndarkness.  A stream of light through the slot window \nillumines Fred's head, the forehead of which is swollen and \ndiscolored.  He staggers up and shuffles over to the call \nbutton, which he leans on.  A few moments later, a GUARD \nappears on the other side of the mesh.\n\n\t\t\t\tGUARD\n\t\tWhat is it?\n\n\t\t\t\tFRED\n\t\tAspirin... fly head.  I gotta have more\n\t\taspirin.\n\n\t\t\t\tGUARD\n\t\tThe doctor said not to give you anything.\n\t\tYou can see him in the morning.\n\n\t\t\t\tFRED\n\t\tBut my head...\n\nThe guard looks at Fred through the window, and what he sees \ndisturbs him.  The guard makes a strange face.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - DEATH ROW HALLWAY - NIGHT\n\nThe guard walks away from Fred's door to the guard station, \nwhere another GUARD is sitting at a table, reading a \nmagazine.\n\n\t\t\t\tGUARD #1\n\t\tShit, that wife killer's lookin' pretty\n\t\tfucked up.\n\n\t\t\t\tGUARD #2\n\t\t\t(not looking up from his\n\t\t\tmagazine)\n\t\tWhich one?\n\nThey both laugh.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRIS0N - FRED'S CELL - SAME - NIGHT\n\nFred is on the floor lying on back. The camera comes \nslowly down at him from the ceiling, like a weight pressing \non his head.  Fred's pain is demonstrably overwhelming him \nnow.  He moans and rolls from side to side in the dimness, \nmaking grotesque, otherworldly sounds.  As the camera moves \ninto a CLOSE UP, the last image of Fred's head shows the \ndiscolored swelling has increased.  Fred looks up, sensing \nsomething.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. THE MADIS0N HOUSE - NIGHT\n\nThere is a \"For Sale\" sign posted in front.  The camera pans \nslowly as in the videotape across the front of the house.  \nThe interior of the house is dark, but fleetingly we are \naware of movement, shadows inside.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. ANDY'S HOUSE - NIGHT\n\nMarian and Raquel are in the living room, attired in the \nundergarments they purchased at the lingerie store.  HOT \nMUSIC is BLARING from a stereo.  Marian and Raquel are \ndancing, as sexy and wild as it is possible for them to be.  \nAndy is lying on his back on the rug, dressed only in \nundershorts and socks, the girls stomping feet stepping \nfuriously around his head and body.  His eyes are closed at \nfirst, but when he opens them, he sees their feet in a blur.  \nHe tries to get up, but he is too strung out, and he \ncollapses again.  Marian and Raquel take him by his hands and\nfeet and begin pulling him around the room as they dance.  \nAndy is blitzed, smiling moronically.  The girls' breasts \ntumble out of their teddies.  Raquel drops her end of Andy, \nturns up the music even louder, and dances into a frenzy.  \nMarian drops to her knees, Andy's feet on either side of her, \nshaking her shoulders and whipping her hair around.  Andy \nmakes another attempt to sit up - he looks at Marian, reaches \nfor her but falls back, dead to the world.  Raquel and Marian \ndon't quit.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - FRED'S CELL - NIGHT\n\nFred is still curled on the floor, but spasms begin to rock \nhis body.  He goes into convulsions, blood gushes from his \nnostrils.  His head is badly swollen.  Fred vomits repeatedly, \nand drags around in his mess.  Fred turns, straining upwards \nas we've seen him do before.  His face and head are hideously \ndeformed.\n\nFred brings his shaking, tortured hand to his forehead.  He \npulls his hand down across his face squeezing it as it goes.  \nAs his hand passes over his face, Fred's features are removed \nleaving a blank, white mass with eye sockets.\n\nWe move into the eye sockets and beyond.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. TWO-LANE HIGHWAY - NIGHT\n\nWe see a clean moving POV illuminated by headlights.  We are \nfloating down an old two-lane highway through a desolate, \ndesert landscape.  This gliding, eerie POV continues until the \nheadlights illuminate a figure standing at the side of the \nroad.  This figure is a man, PETE DAYTON.  Pete turns, \nunsettled, as he looks directly at us as we move closer to \nhim.  The ghost image of a house appears behind Pete.  There \nis a girl, SHEILA, standing on the lawn in front of the \nhouse.  She is afraid and is trying to communicate with Pete.  \nPete doesn't seem to hear her and continues to stare directly \nat us.  Now Pete seems to move toward us as we move toward \nhim.  His head fills the screen.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. PRISON - FRED'S CELL - NIGHT\n\nFred's blank face begins to contort and take on the \nappearance, feature by feature, of Pete Dayton.\n\nFred Madison is becoming Pete Dayton.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nEXT. PRISON - DAWN\n\nWe watch the sun rise outside the prison, ascending over the \nstrands of barbed-wire above the wall.\n\n\t\t\t\t\t\t\t\t CUT TO:\n\nINT. PRISON - DEATH ROW - MORNING\n\nA GUARD is making his early morning rounds.  He stops at each \ncell and looks in, making a mark with a pencil on a piece of \npaper on a clipboard. when he comes to Fred's cell, he is \nabout to make a check-mark, but looks in again and appears \nconfused.  THE MAN INSIDE IS NOT FRED.\n\n\t\t\t\tGUARD\n\t\tWho are you?  What are you doing in this\n\t\tcell?\n\nThe MAN in the cell sits still on the cot, staring straight \nahead.  The man is thin, younger than Fred.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - DEATH ROW HALLWAY - MORNING\n\nThe guard hurries over to the guard station.  He picks up the\ntelephone and dials.  He begins to sweat.\n\n\t\t\t\tGUARD\n\t\tThis is Johnny Mack at station 8. Yeah, \n\t\tlook, somethin' crazy's happened.  No, I \n\t\tmean, Madison ain't in his cell.  No, \n\t\tthere's somebody in there, but it ain't \n\t\tMadison! Right, right.  Okay... Captain \n\t\tHenderson's comin''?... Right.\n\nJohnny Mack hangs up.  He sweats.  He walks back down the row \nand looks in again at Fred's cell.\n\n\t\t\t\tJOHNNY MACK\n\t\tF-u-u-u-ck me!\n\nHe walks back to the station.  A supervisor arrives, CAPTAIN \nHENDERSON.\n\t\n\t\t\t\tCAPTAIN HENDERSON\n\t\tNow, Mack, what's the situation?\n\n\t\t\t\tJOHNNY MACK\n\t\tI'm not entirely certain, Captain.\n\t\tYou'll have to see for yourself.\n\nTogether they walk quickly to Fred's cell and look in.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tThat's not Fred Madison?\n\n\t\t\t\tJOHNNY MACK\n\t\tNo, sir, it's not.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tWho is it?\n\n\t\t\t\tJOHNNY MACK\n\t\tI couldn't say, sir... Captain Henderson?\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tYeah, Mack?\n\n\t\t\t\tJ0HNNY MACK\n\t\tCaptain... this is some spooky shit we\n\t\tgot here.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - WARDEN'S OFFICE - DAY\n\nCaptain Henderson is standing in front of a desk, behind \nwhich the Warden is seated.  A nameplate on the desk reads: \nWARDEN MARSHALL R. CLEMENTS.\n\n\t\t\t\tWARDEN\n\t\tRepeat that, Bill.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tWarden, it's not him.  It .was not Fred\n\t\tMadison in that cell.\n\n\t\t\t\tWARDEN\n\t\tOf course, it's Madison!!! Who else\n\t\tcould it be?\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tI don't know.  The guards say they've\n\t\tnever seen him before.\n\n\t\t\t\tWARDEN\n\t\tWhere is he now?\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tHe's in the infirmary, being examined.\n\n\t\t\t\tWARDEN\n\t\tDid you ask him who he is?\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tHe... He can't talk. it appears as if he\n\t\tcan't talk, anyway.\n\n\t\t\t\tWARDEN\n\t\tIf he's not Madison, then where's\n\t\tMadison?\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tI've got men searching the building and\n\t\tthe grounds now.\n\nThe Warden stands up and comes around the desk.\n\n\t\t\t\tWARDEN\n\t\tI want to take a look at this man myself.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - INFIRMARY - DAY\n\nThe man from Fred's cell is just finishing being \nfingerprinted.\n\nThe doctor with serious eyebrows - DR. ROGOFF - is inspecting \nthe man's face.  The Warden enters with Captain Henderson.\nGUARDS are standing by the door and at strategic spots in the\nroom.\n\n\t\t\t\tWARDEN\n\t\tWhat is this, Rogoff?\n\n\t\t\t\tDR. ROGOFF\n\t\tI don't know yet.\n\nDr. Rogoff begins to draw blood from the man's arm. He takes\nseveral vials.  The man watches the blood coming out of his\narm, but doesn't seem to understand where he is or what is \nhappening to him.\n\n\t\t\t\tWARDEN\n\t\tWho is this man?\n\n\t\t\t\tDR. ROGOFF\n\t\tHe's just been fingerprinted, and I'll \n\t\trun these blood tests right away.  We'll \n\t\tfind out soon enough.\n\nDr. Rogoff opens the man's mouth and peers in with a pencil \nlight.\n\n\t\t\t\tWARDEN\n\t\tHe's not Madison?\n\n\t\t\t\tDR. ROGOFF\n\t\t\t(slowly, deliberately\n\t\tNot even close.\n\nDr. Rogoff stands up, puts the light in his breast pocket.\n\n\t\t\t\tDR. ROGOFF (CON'T)\n\t\tI examined Madison last night, Marshall.\n\t\tHe had a headache.\n\n\t\t\t\tWARDEN\n\t\tA headache?\n\n\t\t\t\tDR. ROGOFF\n\t\tI did a routine once-over, and gave him a \n\t\tsleeping pill.  I've never seen this man \n\t\tbefore.  Neither have the guards.  I \n\t\tdon't think he's in the system.\n\nThe Warden moves closer to the man - he looks closely at him.\n\n\t\t\t\tWARDEN\n\t\tWhere the hell did you come from, mister?\n\nCLOSE UP OF THE MAN - he's staring straight up.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - WARDEN'S OFFICE - DAY\n\nPresent are the Warden, Captain Henderson and TWO other \nPRISON OFFICIALS.  The Warden is looking at a computer next \nto his desk.\n\n\t\t\t\tWARDEN\n\t\tWell, gentlemen, we know who the stranger\n\t\tis. His name is Peter Raymond Dayton.\n\t\tHe's twenty-four years old.  His birthday\n\t\tis April 21st.  He was born and raised\n\t\tright here.  He lives with his parents,\n\t\tWilliam and Claire Dayton at 814 Garland\n\t\tAvenue.  Pete Dayton was arrested five\n\t\t\t\t(MORE)\n\n\t\t\t\tWARDEN (cont'd)\n\t\tyears ago for auto theft, for which he \n\t\twas put on probation for one year.  That \n\t\twas his first and only offense.  No \n\t\trecord since then.\n\nWarden Clements looks up, takes a deep breath and stares at \nthe men in front of him.\n\n\t\t\t\tWARDEN (CON-T)\n\t\tHow about Madison?  Have we had even a\n\t\thint of his whereabouts?\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tNothing, Marsh.  Vanished.  There's an \n\t\tAPB out on him.  His photo's been faxed \n\t\tnationwide.\n\n\t\t\t\tPRISON OFFICIAL #1\n\t\tI had a call from the governor's office\n\t\tabout this.\n\n\t\t\t\tWARDEN\n\t\tHow the hell does she know?\n\n\t\t\t\tPRISON OFFICIAL #1\n\t\tThere's press outside right now.\n\n\t\t\t\tWARDEN\n\t\tHow the hell... 7\n\n\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tOne of the guards must have leaked it.\n\n\t\t\t\tWARDEN\n\t\tWhat's the word on the street?\n\n\t\t\t\tPRISON OFFICIAL #2\n\t\tOnly that Madison has apparently escaped.\n\t\tNothing about the other guy.\n\n\t\t\t\tWARDEN\n\t\tGood, let's keep it that way.  Keep a lid\n\t\ton Dayton.  Nothing gets out about him.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - DEATH ROW - DAY\n\nJohnny Mack walks down the row and enters Fred's cell.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - FRED'S CELL - DAY\n\nJohnny Mack looks around, up and down the walls, half peers \nunder the cot, then - checking first to see no other guard is \nwatching him - he looks inside the toilet bowl, then gets \ndown on his knees and really looks under the cot.  He gets up \nand sits down on the bed.  He rubs a hand over his face.  \nJohnny Mack is clearly perplexed.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - MEDIA ROOM - DAY\n\nA press conference is being held.  Present are REPORTERS, TV \ncameras, et al.  The Warden and Captain Henderson represent \nthe prison.\n\n\t\t\t\tWARDEN\n\t\tI have a statement to read... Fred \n\t\tMadison, an inmate being held on death \n\t\trow has, apparently... has escaped.  An \n\t\tall-points bulletin has been issued to \n\t\tauthorities not only statewide, but \n\t\tnationwide.  We are confindent that he \n\t\twill be apprehended very soon.  No \n\t\tfurther details are available at this \n\t\ttime.  Thank you very much.\n\n\t\t\t\tREPORTER\n\t\tWarden, nobody's ever escaped from death\n\t\trow before.  How did he get out?\n\nThe Warden and Captain Henderson leave the room without \nanswering.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - LONG CORRIDOR - DAY\n\nPete's parents, BILL and CLAIRE DAYTON, escorted by a PRISON \nGUARD, are approaching the Warden's office.  It is a long \nwalk along the corridor and the camera examines them in \ndetail as they get closer and closer to the office.  The \nDaytons are a middle-aged, San Fernando Valley couple.  Bill \nDayton is wearing a sport shirt with the short-sleeves rolled \nup. His skin is leathery, tanned and his thinning hair is \nslicked back in a duck-tail.  He's working-class, ex-biker.  \nClaire Dayton was obviously a good looking \"chick\" who's gone \nto seed from too much sun, cigarettes and booze.  She retains \nthe remnants of a good figure, but it's going fast.  Claire \nis wearing sunglasses.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PRISON - WARDEN'S OFFICE - DAY\n\nThe Daytons are ushered in by the guard.  The Warden is \nstanding behind his desk.  Dr. Rogoff is standing to one \nside, and next to him is Captain Henderson.  The Daytons \nstand just inside the room for a moment before the Warden \nextends his right hand.\n\n\t\t\t\tWARDEN\n\t\tI'm Warden Clements.  This is Captain \n\t\tHenderson and Dr. Rogoff.  Please, sit \n\t\tdown.\n\nBill and Claire move to the chairs in front of the desk and \nsit down.  The Warden, Dr. Rogoff and Captain Henderson all \nsit down.\n\n\t\t\t\tWARDEN (CON'T)\n\t\tMr. and Mrs. Dayton, as you were told \n\t\tover the phone, your son, Peter, is here.\n\nClaire Dayton removes her sunglasses.  She and Bill wait -\nthe warden is searching for words.\n\n\t\t\t\tWARDEN (CON'T)\n\t\tHe... He was discovered this morning... \n\t\tin a cell on death row.\n\nBill and Claire look at each other - bewildered.\n\n\t\t\t\tWARDEN (CON'T)\n\t\tA cell that was supposed to be\n\t\toccupied by an inmate named Fred Madison.\n\n\t\t\t\tBILL\n\t\tThe wife killer?\n\n\t\t\t\tWARDEN\n\t\tYes.\n\n\t\t\t\tCLAIRE\n\t\tHow is this possible, Warden?\n\nThe warden shakes his head.\n\n\t\t\t\tWARDEN\n\t\t...Tell me, what was Peter's condition \n\t\tthe last time you saw him?\n\nBill and Claire look at each other again - briefly.\n\n\t\t\t\tBILL\n\t\tHis condition?  What do you mean?\n\n\t\t\t\tWARDEN\n\t\tHis physical condition.\n\n\t\t\t\tBILL\n\t\t\t(hesitates)\n\t\tSame as always.  Pete takes care of\n\t\thimself.\n\nBill and Claire look at each other once again.\n\n\t\t\t\tCLAIRE\n\t\tI saw him before he went to the garage \n\t\tday before yesterday.  He's a mechanic. \n\t\tLook, is he okay?  Can we see him?\n\nThe Warden looks at Dr. Rogoff.\n\n\t\t\t\tDR. ROGOFF\n\t\tHe has a hematoma on his forehead and a \n\t\tcondition called blepharitis... that's \n\t\tredness and swelling around the eyes.\n\n\t\t\t\tBILL\n\t\tWas he in a fight?\n\n\t\t\t\tDR. ROGOFF\n\t\tThese conditions don't indicate a fight.\n\n\t\t\t\tCLAIRE\n\t\tBut what is the cause then? ... And how\n\t\tdid he get in that cell?\n\n\t\t\t\tDR. ROGOFF\n\t\tHe can't talk.  Or won't.\n\n\t\t\t\tBILL\n\t\tThat doesn't sound like Pete.\n\n\t\t\t\tDR. ROGOFF\n\t\tYour son has experienced some sort of \n\t\ttrauma, I'm afraid.  We were hoping that \n\t\tthe two of you could help explain the \n\t\tcause of the trauma and how he came to be \n\t\there.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tYou don't know Fred Madison?\n\n\t\t\t\tBILL\n\t\tNo... Only what was in the news.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tDo you think Pete knows him?\n\n\t\t\t\tCLAIRE\n\t\tI wouldn't know how.\n\n\t\t\t\tWARDEN\n\t\t\t(to Claire)\n\t\tYou say you haven't seen your son since\n\t\tthe day before yesterday?\n\n\t\t\t\tCLAIRE\n\t\tWhen he went to work, right.\n\n\t\t\t\tWARDEN\n\t\tWhat about yesterday?\n\n\t\t\t\tCLAIRE\n\t\tHe didn't come home.\n\n\t\t\t\tBILL\n\t\tSometimes he stays at a friend's.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tAny particular friends?\n\n\t\t\t\tBILL\n\t\tA girl's, a buddy's.  I don't know.  He's \n\t\this own man; he comes and goes as he \n\t\tpleases.\n\n\t\t\t\tCLAIRE\n\t\tI want to see him.\n\n\t\t\t\tWARDEN\n\t\tYes, and we need to talk to him... if we\n\t\tcan.\n\t\t\t(to Dr. Rogoff)\n\t\tMel, let's get Peter in here.\n\nDr. Rogoff leaves the room.  While he's gone, nobody talks, \nincreasing the tension.  Dr. Rogoff returns with Pete Dayton, \ndressed in his own clothes: jeans, boots, sport shirt.  \nPete's forehead is lumpy and his eyes are red and swollen.  \nHe can walk, but unsteadily.\n\nPete looks around the room - sees his parents.\n\nClaire jumps up.\n\n\t\t\t\tCLAIRE\n\t\t\t(tenderly)\n\t\tPete...\n\nShe and Dr. Rogoff help get Pete settled in a chair.  Bill is \ntaken aback at the sight of his son, but says nothing.\n\n\t\t\t\tWARDEN (CON'T)\n\t\tPete, can you tell us now, anything about\n\t\tthis?\n\n\t\t\t\tCLAIRE\n\t\tPete, what happened to you?\n\nPete has a dazed look on his face.  He starts to speak, then \nstops.\n\n\t\t\t\tCLAIRE (CON'T)\n\t\tIt's okay.  Take your time, honey.\n\nPete's gaze drifts from his mother's face around the room and \nback to her face.\n\n\t\t\t\tPETE\n\t\t\t(afraid - quiet)\n\t\tWhere ... am I?\n\nThe Warden and Captain Henderson look to Dr. Rogoff.\n\n\t\t\t\tDR. ROGOFF\n\t\tYou're in the state penitentiary.  You\n\t\twere found in a cell on death row.\n\n\t\t\t\tPETE\n\t\tMy head hurts.\n\nPete rubs his head like it's about to explode with pain.\n\n\t\t\t\tWARDEN\n\t\tA man named Fred Madison was occupying \n\t\tthat cell.  He's missing. we're trying \n\t\tto find out how it is you were in there \n\t\tand not him.\n\n\t\t\t\tPETE\n\t\tI... I don't know.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tDo you know Fred Madison?\n\n\t\t\t\tPETE\n\t\t\t(straining)\n\t\tNo.\n\nThere is a silence in the room, as Pete massages his \nthrobbing temples.\n\n\t\t\t\tCLAIRE\n\t\t\t(worried)\n\t\tWarden, can we take him home?\n\nThe Warden looks at Dr. Rogoff.\n\n\t\t\t\tDR. ROGOFF\n\t\t\t(to Warden)\n\t\tFrom a medical standpoint, I don't see\n\t\twhy not.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\tWe need to find out what happened here.\n\n\t\t\t\tBILL\n\t\t\t(standing up)\n\t\tHave you made any charges against him?\n\n\t\t\t\tWARDEN\n\t\tNo.\n\n\t\t\t\tBILL\n\t\tThen he's coming home with his mother and\n\t\tme.\n\n\t\t\t\tWARDEN\n\t\tAll right... but you see our \n\t\tpredicament... Legally we can't hold \n\t\thim, but he may be able to help us... \n\t\tperhaps later.  For now, he's free to \n\t\tleave.\n\nBill and Claire help Pete up and carefully escort him out of \nthe warden's office. With a nod from the Warden, the guard \naccompanies them out of the room.  The Warden, Captain \nHenderson and Dr. Rogoff stand but remain in the office.\n\n\t\t\t\tCAPTAIN HENDERSON\n\t\t\t(to warden)\n\t\tYou just gonna let him go?\n\n\t\t\t\tWARDEN\n\t\tWe'll get a tail put on him.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. DAYTON HOUSE - SAN FERNANDO VALLEY - DAY\n\nBill, Claire and Pete pull into the driveway of a bleached \nout, 60's ranch-style house on a street lined with many more \nof the same.\n\nBill and Claire get out of the car first, then help Pete out \nand up into the house.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. DAYTON HOUSE - DAY\n\nBill and Claire take Pete to his room, which has a bed, desk, \ntwo chairs and a sea of disassembled motorcycle parts \nbelonging to a classic Indian motorbike which Pete is \nrebuilding.  Each part is shiny and clean.\n\nPete sits down on his bed and looks up at his parents -\nshaking his head with confusion and embarrassment.\n\n\t\t\t\tBILL\n\t\tJust rest easy, Pete. You're gonna be\n\t\tokay.\n\n\t\t\t\tCLAIRE\n\t\tAre you hungry, honey?  I'll fix you\n\t\tsomething.\n\n\t\t\t\tPETE\n\t\tNo... I don't feel so good.  I would \n\t\tlike some aspirin.\n\n\t\t\t\tCLAIRE\n\t\tComing up.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. DAYTON HOUSE - NIGHT \n\nPete sleeps.\n\nIn the living room, Bill is drinking a beer and watching \ntelevision.\n\nIn the kitchen, Claire is finishing the dishes.  She goes \ninto the living room and leans down and whispers something in \nBill's ear.  Bill nods and Claire walks quietly down the \nhallway and opens Pete's door.\n\nShe looks in on him sleeping.  \n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. DAYTON HOUSE - DAY\n\nAn unmarked police car pulls up across the street from the \nDayton house.  In the front seat are the Detectives, Ed and \nAl. Al, who is on the passenger side, is holding two \nstyrofoam cups filled with coffee.  Ed removes from his \ninside jacket pocket a 5\" x 7\" photo of Pete Dayton, which he \nprops up on the dashboard so that it is visible for both \nhimself and Al.  Al hands one of the cups to Ed.\n\n\t\t\t\tED\n\t\tThanks, Al.\n\nAl studies Pete Dayton's face in the photo.\n\n\t\t\t\tAL\n\t\tNow we'll see what this son of a bitch is\n\t\tup to.\n\n\t\t\t\tED\n\t\tYeah.\n\n\nEd and Al sip their coffee and stare at the house.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nEXT. DAYTON HOUSE - BACKYARD - DAY\n\nPete Dayton is lying on a chaise lounge.  His forehead is \nstill swollen, but his eyes are less red.  He stares up into \nthe sky - a hot breeze blows over him.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nINT. DAYTON HOUSE - DAY\n\nThe camera moves slowly through the interior of the empty \nhouse cast with shadows.  The refrigerator running is the \nonly sound.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nEXT. DAYTON HOUSE - BACKYARD - DAY\n\nPete slowly moves up to a sitting position, then stands.  He \nstretches and walks around the yard feeling the dry, \nunwatered lawn on his bare feet.\n\nHe walks over and leans over the neighbor's fence.  His eyes \nfall on a plastic toy boat floating in b child's plastic\nswimming pool.  He watches the boat as the warm breeze blows \nit lazily in a circle.\n\nA small plane drones overhead.\n\nIn the distance, a WOMAN finishes hanging out some wash and \ngoes in the back door of her house.  The slamming of her \nscreen door sounds a thousand miles away.\n\nPete continues to observe these seemingly peaceful \nsurroundings - but something doesn't feel right to him.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. DAYTON HOUSE - NIGHT\n\nPete is eating a sandwich - he is looking much better.\nClaire opens a bag of chips and sets them in front of Pete as \nBill comes in the front door.\n\n\t\t\t\tCLAIRE\n\t\tI'm in the kitchen.\n\nBill comes in and pops a beer - looks around.\n\n\t\t\t\tBILL\n\t\tWhere's Pete?\n\n\t\t\t\tCLAIRE\n\t\tOut in back.\n\n\t\t\t\tBILL\n\t\tYou talk to him?\n\n\t\t\t\tCLAIRE\n\t\t\t(urgent)\n\t\tNo... Here he comes.\n\nTheir gazes follow a path from the backyard into where Pete \nhas been sitting all the time.\n\n\t\t\t\tBILL\n\t\tHow're you feelin'?\n\nPete looks at his parents - he can't figure out what has just \nhappened.\n\n\t\t\t\tPETE\n\t\t\t(unsure - brow furrowed)\n\t\tBetter.\n\n\t\t\t\tBILL\n\t\tArnie called this morning while you were \n\t\tsleepin'.  They miss you pretty bad down \n\t\tat the garage.  I told 'im you still had \n\t\ta \"fever\".\n\n\t\t\t\tPETE\n\t\tOkay.  Thanks.\n\n\t\t\t\tBILL\n\t\tNice to know they can't seem to get along\n\t\twithout ya.\n\n\t\t\t\tPETE\n\t\tYeah.\n\n\t\t\t\tBILL\n\t\tYou really don't remember the other\n\t\tnight, do you?\n\n\t\t\t\tPETE\n\t\tWhat night is that?\n\n\t\t\t\tBILL\n\t\tThe night before you showed up in the\n\t\tslammer...\n\n\t\t\t\tCLAIRE\n\t\tDo you remember?\n\n\t\t\t\tPETE\n\t\tNo... I don't.  Why?\n\nBill and Claire just stare at him.  Pete shakes his head and \ntakes another bite of his sandwich - but inside the worrisome \nfeeling returns.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. DAYTON HOUSE - PETE'S BEDROOM - NIGHT\n\nPete is stretched out on his bed watching television.  He \nhears the front door bell ring - footsteps, and a moment or \ntwo later the door to his bedroom opens and three of his \nfriends, CARL, LANIE and STEVE (\"V\") saunter in.\n\n\t\t\t\t\"V\"\n\t\tWhere the fuck have you been?\n\nPete pulls himself up to a sitting position.\n\n\t\t\t\tPETE\n\t\tHey.\n\n\t\t\t\tCARL\n\t\tYou look like shit.\n\n\t\t\t\tLANIE\n\t\tWhat happened?\n\n\t\t\t\tPETE\n\t\tJust haven't been feelin' well.\n\n\t\t\t\t\"V\"\n\t\tYou're not contagious are you?\n\n\t\t\t\tPETE\n\t\tI don't think so.\n\n\t\t\t\t\"V\"\n\t\tGood... You up for a drive?\n\n\t\t\t\tPETE\n\t\tWhere to?  Hey, Lanie, I heard you were\n\t\tout of it for a while, too.\n\n\t\t\t\tLANIE\n\t\tThey found a cyst on my god damn ovary.  \n\t\tHad to cut it out.  You wanna see the \n\t\tscar?\n\nLanie pulls up her shirt and pulls down her pants a ways\nrevealing a fresh scar about three inches long.\n\n\t\t\t\tCARL\n\t\t\t(winking)\n\t\tHadn't slowed her down none.\n\n\t\t\t\tLANIE\n\t\t\t(smacking him)\n\t\tShut up, bone-head.\n\nThen Lanie laughs good-naturedly.\n\n\t\t\t\t\"V\"\n\t\tJust goin' up'ta \"Tops\"... Maybe the \"Ten\n\t\tPin\".\n\n\t\t\t\tPETE\n\t\tSheila'll be at \"Tops\".\n\n\t\t\t\t\"V\"\n\t\tSure, what's wrong with that?\n\n\t\t\t\tPETE\n\t\tOkay.\n\nPete hauls himself up off the bed and throws on a black\nleather jacket.\n\nThe four of them go through the living room where Bill and \nClaire are drinking and watching TV.\n\n\t\t\t\tPETE\n\t\t\t(to Bill and Claire)\n\t\tGoin' out with these clowns for a while.\n\n\t\t\t\tBILL\n\t\tDo ya good.\n\nAfter Pete leaves with his friends, Bill and Claire look at \neach other.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. \"V'S\" CAR - VAN NUYS BOULEVARD - NIGHT\n\n\"V\" drives a black, beat-up '66 Grand Prix.  Carl and Lanie \nare in the back seat, and Pete rides shotgun.  The four of \nthem., are cruising down Van Nuys Boulevard along with many \nother MUSCLE CARS and LOW-RIDERS filled with KIDS looking for\naction. \"V's\" car is making a hell of a noise.\n\n\t\t\t\tPETE\n\t\tI hate ridin' in this fuckin' car.\n\n\t\t\t\tCARL\n\t\tTake it easy, Pete, \"V\" loves this rod.\n\n\t\t\t\t\"V\"\n\t\tLook at that goin' my way.\n\n\"V\" has seen a couple. of GIRLS in short, tight dresses \nwalking up the boulevard.\n\n\t\t\t\t\"V\" (CON'T)\n\t\tOh my, oh my.\n\n\t\t\t\tLANIE\n\t\tKeep it in your pants, \"V\".\n\nSome big cars nearby rev their engines.  \"V\" guns his car and \nit lurches roughly forward.  The sound of the rough running \nengine reverberates in Pete's brain.\n\n\t\t\t\tPETE\n\t\tThis rod is a fuckin, embarrassment,\n\t\tCarl.  Whatiya burn in this thing, \"V\"?\n\n\t\t\t\t\"V\"\n\t\tTexaco... What's wrong with that?\n\n\t\t\t\tPETE\n\t\tListen.\n\n\t\t\t\t\"V\"\n\t\tYou gotta be kiddin'... This is the \n\t\tboulevard... You can't hear yourself \n\t\tthink.\n\nPete shakes his bead with disgust.\n\n\"V\" pulls the car off the boulevard into \"Tops\" drive-in.  \nCars are lined up at the \"to go\" window and all along the \nside of the building where people are hanging out under a \nlong metal awning.  MUSIC is playing LOUD.\n\n\"V\" pulls into a parking spot by the awning.  The headlights \nilluminate a group of HIPSTERS - some dancing, some just \nhanging out.  THREE or FOUR GIRLS hanging out together turn \ntoward \"V's\" car.  They see Pete in the front seat, and one \nof the girls, Sheila, smiles and walks toward him.\n\n\t\t\t\tSHEILA\n\t\tHey.  Where have you been?\n\nPete talks to her through the open window while \"V\", Carl and \nLanie climb out through \"V's\" door.  \"V\" leans back in.\n\n\t\t\t\t\"V\"\n\t\t\t(to Pete)\n\t\tYou want somethin'?\n\n\t\t\t\tPETE\n\t\tNo, I'm okay.\n\n\"V\" walks off with the others to the \"take out\" window.\nSheila leans in closer to Pete.\n\n\t\t\t\tSHEILA\n\t\tI missed you.\n\n\t\t\t\tPETE\n\t\tYeah?...\n\n\t\t\t\tSHEILA\n\t\tYeah.\n\nSheila's girlfriends saunter over and lean on the car around \nher - looking in at Pete.\n\n\t\t\t\tGIRL #1\n\t\tWhat happened to your face?\n\n\t\t\t\tPETE\n\t\tNothin'.\n\n\t\t\t\tSHEILA\n\t\tWhat are you guys doin'?\n\n\t\t\t\tPETE\n\t\tGuess we're goin' over to the \"Ten Pin\".\n\n\t\t\t\tSHEILA\n\t\tYou want some company?\n\n\t\t\t\tPETE\n\t\tSure.\n\n\"V\", Carl and Lanie return with burgers and drinks.  \"V's\" \ngot a mouthful of burger.\n\n\t\t\t\t\"V\"\n\t\t\t(muffled)\n\t\tWhat's happenin'?\n\n\t\t\t\tPETE\n\t\tThey're comin' with us.\n\n\t\t\t\t\"V\"\n\t\t\t(muffled and spitting)\n\t\tPile in.\n\nSheila and her girlfriends jump in the car with \"V\", Carl, \nLanie and Pete.  \"V\" fires up the rough-running engine and \npulls out - leaving behind a cloud of smoke.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. TEN PIN BOWLING ALLEY - NIGHT\n\nThe bowling alley is divided into a game room area, a bar/ \nrestaurant area and a bowling area.\n\nPete and the group stroll into the bar and take a large \nbooth.  MUSIC is playing LOUD.\n\nA WAITRESS takes orders for drinks.\n\nBowling pins clatter loudly in the distance.\n\n\"V\" takes one of Sheila's friends and dances with her.\n\nSheila takes Pete by the arm and pulls him up to dance.  The \nmusic is fast, but they dance slow.\n\n\t\t\t\tSHEILA\n\t\tWhy haven't you called me?\n\n\t\t\t\tPETE\n\t\tSorry... I...\n\nSheila looks around and moves closer to Pete.  She whispers \nurgently, worried.\n\n\t\t\t\tSHEILA\n\t\t\t(whispering)\n\t\tWhat's happening to you?  What happened\n\t\tto your face?\n\n\t\t\t\tPETE\n\t\tI don't know.\n\n\t\t\t\tSHEILA\n\t\t\t(whispering)\n\t\tWhat do you mean? ... You've been acting\n\t\tstrange lately ... Like the other night.\n\n\t\t\t\tPETE\n\t\tWhat night?\n\n\t\t\t\tSHEILA\n\t\tLast time I saw you.\n\n\t\t\t\tPETE\n\t\tI don't remember... What happened that\n\t\tnight?\n\n\t\t\t\tSHEILA\n\t\tYou sure weren't acting like the Pete\n\t\tDayton I've always known.\n\n\t\t\t\tPETE\n\t\tWhatiya mean?\n\n\t\t\t\tSHEILA\n\t\tYou were acting like a different person.\n\nPete laughs, but Sheila doesn't.\n\n\t\t\t\tPETE\n\t\tWho else could I be7\n\nSheila stares seriously at Pete, but then laughs too.\n\n\t\t\t\tSHEILA\n\t\tI don't know.\n\nSheila leans in very close to Pete and whispers in his ear.\n\n\t\t\t\tSHEILA (CON'T)\n\t\tYou still care about me?\n\n\t\t\t\tPETE\n\t\tSure.  Sure I do.\n\nSheila pushes her mouth on Pete's and they kiss., Pete breaks \naway - looks at Sheila - serious.\n\n\t\t\t\tPETE (CON'T)\n\t\tWhat else about that night?... Did\n\t\tanything happen?\n\n\t\t\t\tSHEILA\n\t\tYou really don't remember?\n\n\t\t\t\tPETE\n\t\tNo... I told you.\n\n\t\t\t\tSHEILA\n\t\tIt was weird...\n\n\t\t\t\tPETE\n\t\tWhatiya mean, Sheila?\n\n\t\t\t\tSHEILA\n\t\tI don't want to talk about it...\n\n\t\t\t\tPETE\n\t\tSheila?!\n\n\t\t\t\tSHEILA\n\t\tNo... I really don't want to talk about\n\t\tit.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. TEN PIN BOWLING ALLEY - NIGHT\n\nEd and Al sit in their unmarked police car watching the \nbowling alley entrance and \"V's\" car.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nEXT. DAYTON HOUSE - MORNING\n\nPete fires up his souped up Camaro and listens happily to the \nengine purring.  He eases the big Camaro out of the driveway \nand blasts off down the street.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nEXT. ARNIE'S GARAGE - MORNING\n\nPete cruises into his parking place and cuts the engine.  \nARNIE comes rushing toward him, sporting a big smile.\n\n\t\t\t\tARNIE\n\t\tWonderful!!... Wonderful to see you,\n\t\tPete.  How are you?\n\n\t\t\t\tPETE\n\t\t\t(climbing out of the Camaro)\n\t\tFeeling good, Arnie.  Ready to get to \n\t\twork.\n\n\t\t\t\tARNIE\n\t\tWonderful, Pete.  Really wonderful.  \n\t\tAlotta people Pete... alotta people are \n\t\tgonna be very happy.\n\nArnie takes Pete by the arm and they go inside the garage.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. ARNIE'S GARAGE - MORNING\n\nOther MECHANICS give Pete the \"hi\" sign and yell their \ngreetings over the din.  Arnie pulls Pete closer and shouts.\n\n\t\t\t\tARNIE\n\t\tMr. Smith has been waiting for you and\n\t\tMrs. Trueworthy.  Can you take care of\n\t\tMr. Smith now?\n\n\t\t\t\tPETE\n\t\tSure.\n\n\t\t\t\tARNIE\n\t\tMr. Eddy's called every day... Can I call\n\t\thim to come in?\n\n\t\t\t\tPETE\n\t\tSure, Arnie.  Bring 'em on, I'm ready.\n\nPete walks over to a Ford Station wagon and pops the hood.  A \nhappy MR. SMITH comes out of the office to join Pete at his \ncar.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nEXT. ARNIE'S GARAGE - MORNING\n\nEd and Al pull to a stop down the street from the garage.  Ed \nkills the engine and they stare at Arnie's.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. ARNIE'S GARAGE - DAY\n\nPete is leaning down into the engine well of a Chevy Caprice \nworking hard for Mrs. Trueworthy.\n\nArnie's Garage is busy.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nEXT. ARNIE'S GARAGE - DAY\n\nA large black Mercedes 600 Pullman pulls into the garage.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nINT. ARNIE'S GARAGE - DAY\n\nThe Mercedes pulls to a stop and MR. EDDY and TWO of his \nASSISTANTS climb out.\n\nArnie waves to Mr. Eddy from the office.\n\n\t\t\t\tMR. EDDY\n\t\tPETE!!! WHERE'S PETE?!!\n\nPete comes up out of the well and turns.  When he sees Mr. \nEddy, he heads across ihe garage to greet him.  Mr. Eddy \nopens his arms wide and embraces Pete.  When he pulls away, \nhe sees Pete's face.\n\n\t\t\t\tMR. EDDY (CON'T)\n\t\tWhat happened?  Somebody givin' you\n\t\ttrouble?\n\n\t\t\t\tPETE\n\t\tNo, it's nothin'... I'm all right.\n\n\t\t\t\tMR. EDDY\n\t\tBecause if anybody's givin' you trouble, \n\t\tPete, I can take care of the problem... \n\t\tlike that.\n\t\t\t(snaps his finger - loud)\n\n\t\t\t\tPETE\n\t\tNo, no... It's okay, Mr. Eddy.\n\n\t\t\t\tMR. EDDY\n\t\tI mean it, Pete... Like THAT!!\n\t\t\t(snaps his finger - loud)\n\n\t\t\t\tPETE\n\t\tThanks, Mr. Eddy ... whatiya need?  Just\n\t\tthe regular tune-up?\n\n\t\t\t\tMR. EDDY\n\t\tI want you to ride with me.  Somethin'\n\t\tdoesn't sound right.\n\n\t\t\t\tPETE\n\t\tOkay... Lemme clear it with...\n\n\t\t\t\tMR. EDDY\n\t\tIt's okay with Arnie... Come on, let's\n\t\tgo.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. ARNIE'S GARAGE - DAY\n\nEd and Al don't notice that Pete is in the big black \nMercedes, as it cruises past them.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. MR. EDDY'S 600 PULLMAN - DAY\nMr. Eddy drives.  Pete is in the passenger seat up front, and \nthe two, stone-faced assistants ride in back.\n\n\t\t\t\tMR. EDDY\n\t\tNow listen... It only happens when I'm \n\t\taccelerating.  I think it's the \n\t\tcarburetors.\n\nMr. Eddy pulls out after a light turns green and gives the \ncar a stab forward.\n\n\t\t\t\tPETE\n\t\tNo, it's not the carburetors.  Pull over,\n\t\tbut keep it runnin'.\n\nMr. Eddy smiles as he pulls over.\n\n\t\t\t\tMR. EDDY\n\t\tBest god damn ears in town.\n\t\t\t(to the guys in back)\n\t\tYou guys are lookin' at him.  The man\n\t\twith the best god damn ears in town.\n\nWhen the car stops, Pete gets out, pops the hood and \ndisappears down by the engine.\n\nMr. Eddy sits, smiling at Pete as he works.\n\nPete pops up and gives Mr. Eddy the \"thumbs up\" and gets back \ninto the car.\n\n\t\t\t\tPETE\n\t\tGive that a try.\n\n\t\t\t\tMR. EDDY\n\t\tAll right!\n\nMr. Eddy carefully pulls out into traffic and accelerates \nwhen he gets the chance.\n\n\t\t\t\tMR. EDDY (CON'T)\n\t\tBeautifull Smooth as shit from a duck's\n\t\tass.  Let's take a ride.\n\n\t\t\t\tPETE\n\t\tWhatever you say, Mr. Eddy.\n\nMr. Eddy hangs a right turn and heads up into the hills.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. MULHOLLAND DRIVE - DAY\n\nMr. Eddy takes the big Pullman along the scenic Mulholland \nDrive - cruising smoothly.  A silver-gray Infiniti is moving \nup fast behind the Mercedes.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nINT. MR. EDDY'S 600 PULLMAN - DAY\n\nMr. Eddy looks into his rearview mirror.\n\n\t\t\t\tMR. EDDY\n\t\tOh, shit... Is that what I think it is?\n\nPete turns and looks back.  A car is TAILGATING them, the \nsilver-gray Infiniti.  The two assistants in the backseat \nturn nonchalantly to take a look - then they return their \nlook to Mr. Eddy.\n\nMr. Eddy starts to take a slow burn - keeps looking at the \nInfiniti in the rearview mirror.\n\nThe assistants look to one another take a deep breath.\n\nMr. Eddy slows slightly and then keeps the Pullman steady at \n32 m.p.h. The Infiniti moves up ten feet behind the Pullman, \nand blows its horn.\n\nMr. Eddy rolls down his window.\n\nThe assistants are paying close attention - they buckle their \nseatbelts.\n\nPete notices a tension in the car.  He watches Mr. Eddy's \nface.\n\nMr. Eddy pulls slightly to the right of the road, pastes a \npolite, courteous smile on his face, puts his left arm out \nthe window and waves the Infiniti by.\n\nThe Infiniti jets forward and swerves around the Pullman.  \nWhen the cars are side by side, the irate DRIVER in the \nInfiniti gives Mr. Eddy \"the bird\" and flies past.\n\nCLOSE ON MR. EDDY'S RIGHT FOOT as it slams down on the gas \npedal.\n\nThe Pullman catapults forward toward the Infiniti.\n\nPete is thrown back - he grabs on to the door handle and the \nseat for support.\n\nThe Pullman gains on the Infiniti in a flash.  The Infiniti \ntries to go faster, but Mr. Eddy's Pullman has much more \npower.\n\n\t\t\t\tMR. EDDY\n\t\t\t(clenched teeth)\n\t\tThis is where power and mechanical\n\t\texcellence pays off.\n\nMr. Eddy jams the Pullman into the back of the Infiniti and \npushes it faster and faster along Mulholland.  The Driver of \nthe Infiniti tries to brake and blue-gray smoke streams out \nfrom beneath the Infiniti with a scream of burning rubber.\n\nAt a turn, Mr. Eddy steers his massive Mercedes and the \nInfiniti ahead on a gut-wrenching path off the road, up a \nmountain and into a little glade of trees.  Dust and brush \nfly everywhere.\n\nMr. Eddy and his assistants leap from the Pullman and make \nfor the Driver's side of the Infiniti.\n\nMr. Eddy throws open the Infiniti's door and pulls the \ntrembling and screaming Driver out like a rag doll.\n\nMr. Eddy pulls out his .44 Ruger Blackhawk and pistol whips \nthe Driver to the ground.  He smashes the butt of his gun \nacross the man's face, tearing a gash which starts to gush \nwith blood.\n\nMr. Eddy's assistants each draw .45's and point them at the \nDriver.\n\nMr. Eddy, red-faced with anger, leans close to the man.\n\n\t\t\t\tMR. EDDY\n\t\tDON'T YOU EVER FUCKIN' TAILGATE.\n\nMr. Eddy hits the Driver in the side of the head with his \ngun.\n\n\t\t\t\tMR. EDDY (CON'T)\n\t\tWHAT DID YOU SAY?\n\n\t\t\t\tDRIVER\n\t\t\t(scared shitless)\n\t\tI...\tI didn't say anything...\n\n\t\t\t\tASSISTANT #1\n\t\tTell him you won't tailgate.\n\n\t\t\t\tMR. EDDY\n\t\tEVER!!!!\n\n\t\t\t\tDRIVER\n\t\tI won't ever tailgate.\n\n\t\t\t\tMR. EDDY\n\t\tDO YOU KNOW HOW MANY FUCKIN' CAR LENGTHS\n\t\tIT TAKES TO STOP A CAR AT 35 M.P.H.?\n\n\t\t\t\tDRIVER\n\t\tNo.\n\n\t\t\t\tMR. EDDY\n\t\tSIX FUCKIN' CAR LENGTHS... THAT'S ABOUT A \n\t\tHUNDRED AND SIX FUCKIN' FEET, MISTER! \n\t\tYOU WERE FOLLOWING TEN FEET BEHIND ME... \n\t\tIF I'D HAD TO STOP SUDDENLY, YOU WOULD \n\t\tHAVE HIT ME.  I WANT YOU TO GET A \n\t\tDRIVER'S MANUAL, AND I WANT YOU TO STUDY \n\t\tTHAT MOTHERFUCKER... AND I WANT YOU TO \n\t\tOBEY THE GOD DAMN RULES.  FIFTY FUCKIN' \n\t\tTHOUSAND PEOPLE WERE KILLED ON THE ROAD \n\t\tLAST YEAR.\n\t\t\t(hitting the driver once again\n\t\t\t- hard)\n\t\tCAUSE OF FUCKIN' ASSHOLES LIKE YOU.\n\t\tTELL ME YOU'RE GONNA GET A MANUAL.\n\n\t\t\t\tDRIVER\n\t\tI'll get a manual.\n\t\t\t(almost a whisper)\n\t\tand study it.\n\n\t\t\t\tMR. EDDY\n\t\t\t(kicking the man)\n\t\tFUCKIN' \"A\".\n\nMr. Eddy and his assistants return to the Pullman - get in \nand slam their doors.\n\nMr. Eddy throws the Pullman into reverse and pulls back off \nthe hill onto Mulholland Drive.  He eases the car into \n\"drive\" and leaves the crying and beaten tailgater behind.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. MR. EDDY'S 600 PULLMAN - DAY\n\nMr. Eddy rotates his neck - shaking out some adrenaline \nremnants.  Pete is visibly shaken by what he has seen.\n\n\t\t\t\tMR. EDDY\n\t\tSorry about that, Pete, but tailgating is\n\t\tone thing I can't tolerate.\n\n\t\t\t\tPETE\n\t\tI can see that.\n\n\t\t\t\tMR. EDDY\n\t\tI'll bet you know how many car lengths it\n\t\ttakes to stop at... say 45 m.p.h.\n\n\t\t\t\tPETE\n\t\tEight, nine car lengths.  A hundred and\n\t\tsixty-two feet.\n\n\t\t\t\tMR. EDDY\n\t\tAt sixty?\n\n\t\t\t\tPETE\n\t\tFifteen car lengths.  About two hundred\n\t\tand seventy feet.\n\n\t\t\t\tMR. EDDY \n\t\t\t(to his companions in the \n\t\t\treariew)\n\t\tWhat'd I tell ya.\n\nMr. Eddy smiles and they continue along their way.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT./INT. ARNIE'S GARAGE - DAY\n\nThe Pullman pulls off the street into Arnie's.  Mr. Eddy and\nhis assistants stay in the car.  Pete opens his door.\n\n\t\t\t\tMR. EDDY\n\t\tWait a minute ...\n\nMr. Eddy takes out a couple of one hundred dollar bills and \nputs them into Pete's hand.\n\n\t\t\t\tPETE\n\t\tThanks, Mr. Eddy.\n\n\t\t\t\tMR. EDDY\n\t\tNo... Thank you!... I'll be bringin' the\n\t\t\"Caddy\" by tomorrow.\n\nMr. Eddy reaches into the glove compartment and takes out a \nvideotape.  He holds it out to Pete.\n\n\t\t\t\tMR. EDDY (CON'T)\n\t\tYou like pornos?\n\n\t\t\t\tPETE\n\t\tPornos?\n\n\t\t\t\tMR. EDDY\n\t\tYeah.  Give ya a boner.\n\n\t\t\t\tPETE\n\t\tNo thanks, Mr. Eddy.\n\nMr. Eddy tosses the tape back in the glove compartment.\n\n\t\t\t\tMR. EDDY\n\t\tSuit yourself, champ.\n\n\t\t\t\tPETE\n\t\tOkay... Well, I'll see ya then.\n\n\t\t\t\tMR. EDDY\n\t\tYou will.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. ARNIE'S GARAGE - DAY\n\nEd and Al are staring at the Pullman.  They see Pete get out. \nThey notice the man driving the Pullman.\n\n\t\t\t\tED\n\t\tYou recognize that guy?\n\n\t\t\t\tAL\n\t\tYeah... Laurent.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nEXT. DAYTON HOUSE - MORNING\n\nPete walks out his front door with a lunch box and jumps in \nthe Camaro.\n\nHe fires up the big engine and heads off for work.\n\nEd and Al follow.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. ARNIE'S GARAGE - DAY\n\nPete is on a skate - working under a car.  The radio is on \nand a tune comes on that begins to drive Pete crazy - it \ngives him a headache.  The tune is one of Fred Madison's be-\nbop saxophone pieces.  Pete gets out from under the car and \ngoes to the radio.  He changes the station.  PHIL, another \nmechanic working nearby, looks at Pete.\n\n\t\t\t\tPHIL\n\t\tWhy'd you change it?  I liked that.\n\n\t\t\t\tPETE\n\t\tWell, I didn't.\n\nPete rubs his throbbing head and when he gets back under the \ncar, he lays on the skate - unable to work.\n\nA car horn honks and the sound reverberates inside the \ngarage.\n\nPete looks up - from under the car he sees the wheels of a \nCadillac roll up just outside the open garage doors.  He sees\na car door open and Mr. Eddy's feet appear and walk in his \ndirection.\n\nPete winces and wheels himself out from under the car.  He \nstands as Mr. Eddy walks up to him, then freezes as he sees -\nback behind Mr. Eddy, sitting in the passenger seat of the\ncar - a beautiful blonde-haired GIRL, who looks exactly like \nRenee.\n\nCLOSE UP BEAUTIFUL GIRL - she looks exactly like Renee except\nshe is about eight years younger.  The girl is staring right \ninto Pete's eyes.\n\nMr. Eddy steps between Pete and the girl - blocking her from \nPete.  Mr. Eddy smiles at Pete - not noticing or not letting \non that he notices the serious eye contact going on between \nPete and the girl.\n\n\t\t\t\tMR. EDDY\n\t\tI'm leavin' the Caddy, like I told you. \n\t\tThink you'll get a chance to give her a \n\t\tonce over today?\n\n\t\t\t\tPETE\n\t\t\t(regaining his composure)\n\t\tSure... Sure, Mr. Eddy.  You gonna pick\n\t\tit up later, or tomorrow?\n\n\t\t\t\tMR. EDDY\n\t\tIf you think you can finish it, I'll be\n\t\tback later today.\n\n\t\t\t\tPETE\n\t\tIt'll be ready.\n\n\t\t\t\tMR. EDDY\n\t\tYou're my man, Pete.\n\n\nMr Eddy pinches Pete's cheek - which Pete doesn't like, but \naliows.  Mr. Eddy gives Pete a big smile then turns, goes \nback to his car, escorts the beautiful girl outside where the \nPullman is waiting.\n\nPete watches her walk and move.  He watches her until Mr. \nEddy drives her away.  She steals one last glance back at \nPete before she disappears.\n\nWhen she is gone, Pete replays the scene of seeing this \nbeautiful girl over again in his mind.  The scene is \naccompanied by Lou Reed's version of \"This Magic Moment\".\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT. DAYTON HOUSE - NIGHT\n\nPete is sitting perched unsteadily on the very edge of his \nbed.  He HEARS a succession of highly-amplified SOUNDS at \nintervals with eerie stretches of silence: CRICKETS in \nfractured cadence a distant TELEVISION - a FLY buzzing \nslowly in the room a MOTH'S wings beating against light \nbulbs in the ceiling fixture - the washing of DISHES.\n\nPete's reaction to these sounds is one of petrified \nconfusion.  Underlying these sounds is a kind of unearthly, \nsteady DRONE.\n\nPete gets up off the bed, unsteadily.  He moves toward his \nbedroom door.  As he moves the amplified SOUNDS shift.\n\nHe can hear laughter.  The laughter seems to be LOUD, but at \nthe same time coming from people who are trying to contain \nthe laughter - to hide it.\n\nPete opens his door and peers out.\n\nPete's POV down the hall toward the living room - his mother \nand father have stopped laughing and are turned with guilty \nsmiles in his direction.  They are smoking a joint, passing \nit back and forth.  They are not looking directly at him.  \nThey seem to be looking, but not seeing.\n\nPete's parents POV down the hall toward Pete's room.  There \nis no one there - just an empty hallway.\n\nPete's parents continue to stare, but then turn away toward \neach other - they start to laugh quietly again.\n\nPete's Pov - the hallway and the living room - there is no \none in the living room. It's empty.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. DAYTON HOUSE - PETE'S BEDROOM - NIGHT\n\nPete turns from the hallway and comes back in his room - \nunsettled and confused.\n\nHe can hear laughter coming from the living room.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. DAYTON HOUSE - NIGHT\n\nEd is behind the wheel.  Al is in the passenger seat.  Ed is \nlooking at the Dayton house.  Al's head is bent, looking \ndown.  At first we hear nothing, then the sound of Al's piss \nstreaming into an empty coffee cup.  The camera stays on the \ntop of Al's head until he has completed the last few spurts \nof his micturition.  Al's head comes up and he opens the \npassenger side door and dumps the urine into the street.  He \ncloses the door and zips up his trousers.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. DAYTON HOUSE - PETE'S BEDROOM - NIGHT\nPete paces the room.  Finally he stops himself, throws on his \nblack leather jacket and opens his bedroom door.  He looks \ndown the hall.  No one is in the living room.  He walks out \nof the house.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. DAYTON HOUSE - NIGHT\n\nEd and Al watch Pete get in his Camaro and drive off.  They \nfollow.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. STREETS - NIGHT\n\nPete drives through the night - up Ventura Boulevard with the\n\"Cruisers\".  He looks in the other cars and looks at the\nGIRLS on the street.\n\nHe drives past \"Tops\", but doesn't see anyone he knows.\n\nHe turns off the boulevard and drives through San Fernando \nvalley neighborhood streets.\n\nHe pulls up in front of Sheila's house and honks his horn.\n\nHe lights a cigarette while he waits.\n\nIn a few minutes Sheila comes out and leans in the passenger \nside window.\n\n\t\t\t\tSHEILA\n\t\tWhat do you want?\n\n\t\t\t\tPETE\n\t\tNothin'... You want to go for a drive?\n\n\t\t\t\tSHEILA\n\t\tI don't know.\n\n\t\t\t\tPETE\n\t\tCome on... get in.\n\nSheila hesitates for a moment, then gets in.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. STREETS - NIGHT\n\nPete and Sheila drive along dark streets.\n\n\t\t\t\tPETE\n\t\tCome here.\n\nSheila slides across and sits close to Pete.  Pete puts his \narm around her.  She takes a drag from his cigarette and puts \nher head on his shoulder.\n\nPete pulls over into a dark shadow under a tree and stops the \ncar.\n\nHe cuts the engine, turns to Sheila and kisses her.  She \nbreaks away.\n\n\t\t\t\tSHEILA\n\t\tWhy don't you like me?\n\n\t\t\t\tPETE\n\t\tI do like you, Sheila.\n\nSheila puts her lips up' close to his and whispers.\n\n\t\t\t\tSHEILA\n\t\tHow much?\n\nPete kisses her and she kisses him back.  They start to feel \neach other and Sheila takes off her tight sweater.  She's \nwearing no bra and Pete begins to feel her breasts while she \nunbuttons his shirt.  They continue to kiss hard throughout.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. STREET - NIGHT\n\nEd and Al are stopped a half a block behind Pete and Sheila.  \nThey're watching the couple as they make love in the front \nseat of Pete's car.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. STREET - NIGHT\n\nPete and Sheila are naked in the front seat.  Sheila clings \nto Pete as they make love.  She's hopelessly in love with \nhim.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\t\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT. ARNIE'S GARAGE - LATE AFTERNOON\n\nPete and the other MECHANICS are working in the garage.  The \nclock on the wall reads: 4:45 p.m.\n\nSome of the guys are cleaning up - washing their hands - \nputting tools away.\n\nPete is ragging off some grease from his hands when he \nnotices a CAB pull up to the front of the garage.  The \nbeautiful blonde steps out of the cab and comes up to him.\n\nPete's heart races - she smiles at him.\n\n\t\t\t\tBEAUTIFUL BLONDE\n\t\t\t\t(ALICE)\n\t\tHi. I'm Alice Wyatt.\n\n\t\t\t\tPETE\n\t\tPete Dayton.\n\n\t\t\t\tALICE\n\t\tI was here yesterday.\n\n\t\t\t\tPETE\n\t\tYeah, I remember.\n\n\t\t\t\tALICE\n\t\tHow would you like to take me to dinner?\n\n\t\t\t\tPETE\n\t\t\t(laughs uncomfortably)\n\t\tI don't know.\n\n\t\t\t\tALICE\n\t\tOkay, then, I'll take you to dinner.\n\nPete hesitates - thinks.\n\n\t\t\t\tPETE\n\t\tLook, I don't think it's a good idea.\n\nAlice looks hard at him, then smiles.\n\n\t\t\t\tALICE\n\t\tWhere's your phone?  I have to call\n\t\tanother taxi.\n\n\t\t\t\tPETE\n\t\t\t(pointing)\n\t\tOver there.\n\nAlice walks to the office inside the garage - picks up the \nphone and dials information.\n\n\t\t\t\tALICE\n\t\t\t(into phone)\n\t\tCan you give me the number for United\n\t\tCab?\n\nShe turns and looks at Pete while she's speaking, then \nlistening.\n\n\t\t\t\tALICE (CON'T)\n\t\t\t(into phone)\n\t\tThanks.\n\nAlice dials the number.\n\n\t\t\t\tALICE (CON'T)\n\t\t\t(into phone)\n\t\tYes, I need a taxi at Arnie's Auto \n\t\tRepair, the corner of Fifth and...\n\nPete has walked over.  He takes the telephone out of her \nhand.\n\n\t\t\t\tPETE\n\t\t\t(into phone)\n\t\tWe won't be needing a cab, thanks anyway.\n\nHe hangs up the phone.\n\n\t\t\t\tALICE\n\t\tWhy don't we just skip dinner7\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. ARTHUR'S HIDEAWAY MOTEL - NIGHT\n\nPete and Alice pull up to the cheap motel in Pete's Camaro.  \nPete gets out and leaves Alice in the car.\n\nShe waits and watches him go into the office.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. ARTHUR'S HIDEAWAY MOTEL - ACROSS THE STREET - NIGHT\n\nEd and Al are watching Pete and Alice.  They watch Pete come \nout of the office and take Alice into one of the motel rooms.\n\n\t\t\t\tED\n\t\t'Fucker gets more pussy than a toilet\n\t\tseat.\n\nAl shakes his head with anger mixed with a lot of envy.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. ARTHUR'S HIDEAWAY MOTEL - A ROOM - NIGHT\n\nPete and Alice enter the room. There is a double bed, a \nlittle desk, two bedside tables with lamps, a floor lamp, and \na bathroom.  They don't notice any of this.\n\nJust inside the room Alice takes Pete's hand and they turn to \neach other.  Alice puts Pete's hand between her legs.  She \nmoves up close to him and closes her eyes.\n\nThey kiss tenderly at first - then hotter.\n\n\t\t\t\tALICE\n\t\t\t(whispers)\n\t\tTake off my clothes.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. ARTHUR'S HIDEAWAY MOTEL - THE ROOM - NIGHT\n\nPete and Alice are naked on the double bed in just the glow \nof the motel's neon lights coming in between the window \ncurtains.\n\nThey're up on their knees - right next to each other.  They \nlook in each other's eyes as their hands move and touch.\n\nAlice smiles with a wild, dreamy look in her eyes.\n\nPete puts his hand between her legs and Alice kisses him with \na frenzy.\n\nThey fall back on the bed.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. ARTHUR'S HIDEAWAY MOTEL - THE ROOM - NIGHT\n\nPete and Alice make violent love on the bed.  Alice is \nhungry.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. ARTHUR'S HIDEAWAY MOTEL - THE ROOM - NIGHT\n\nAlice and Pete are dressed.  Alice is still breathing hard.\n\nShe moves up close to Pete by the motel room door.  Her hand \nis shaking as she touches his cheek.\n\n\t\t\t\tALICE\n\t\t\t(whispers)\n\t\tI want more.\n\n\t\t\t\tPETE\n\t\tMe, too.\n\n\t\t\t\tALICE\n\t\tCan I call you?\n\n\t\t\t\tPETE\n\t\tYeah... Call me at home.  I'll give you\n\t\tthe number.\n\n\t\t\t\tALICE\n\t\t\t(kissing him)\n\t\tOkay, baby.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. ARTHUR'S HIDEAWAY MOTEL - ACROSS THE STREET - NIGHT\n\nEd and Al watch Pete and Alice leave the motel room, get in \nthe car and drive off.\n\nEd starts his car and he and Al follow them.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. PETE'S CAMARO - NIGHT\n\nPete and Alice are riding side by side - Alice's head is on \nhis shoulder.\n\nAlice looks up at Pete as he drives - she smiles.\n\nThe light from headlights behind them catch Alice's\nattention.  Her eyes dart back to a car that could be \nfollowing them.\n\n\t\t\t\tALICE\n\t\t\t(fear)\n\t\tIs that car following us?\n\nPete glances in the rearview mirror - sees the headlights.\n\nAt the last moment he pulls a hard right and accelerates down \nthe street.  The car follows - they both see it.\n\n\t\t\t\tPETE\n\t\tI'll lose 'em at the light.\n\nAlice steals a look back.\n\n\t\t\t\tALICE\n\t\tI don't recognize the car...\n\nAt a tralfic light, Pete revs up the big Camaro and expertly \npeels out between on-coming cross traffic.  He swerves \nbetween two cars going in opposite directions - blasts up a \nblock and hangs a hard right - disappearing from view.\n\nEd and Al go out into the traffic after them, but the \nswerving, screeching cars braking around them form a barrier \nand trap them.  ANGRY DRIVERS lean on their horns.\n\nPete and Alice have lost them.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nEXT. DAYTON HOUSE - NIGHT\n\nEstablish.\n\n\t\t\t\t\t\t\t\t  CUT TO:\n\nINT. DAYTON HOUSE - NIGHT\n\nCLOSE UP ON TELEPHONE - it starts to ring.\n\n\t\t\t\tPETE\n\t\t\t(voiceover)\n\t\tI'll get it!\n\nPete enters the kitchen where his mother goes for the \nringing phone and gets to it before she does.\n\n\t\t\t\tPETE\n\t\t\t(into phone)\n\t\tHello.\n\n\t\t\t\tALICE\n\t\t\t(phone voice)\n\t\tIt's me...\n\n\t\t\t\tPETE\n\t\tHi.\n\n\t\t\t\tALICE\n\t\tI can't see you tonight.\n\n\t\t\t\tPETE\n\t\t\t(disappointed)\n\t\tOkay ...\n\n\t\t\t\tALICE\n\t\tI have to go somewhere with Mr. Eddy.\n\n\t\t\t\tPETE\n\t\tSure.\n\n\t\t\t\tALICE\n\t\tI think he suspects something...\n\t\tWe have to be careful... I miss you.\n\nPete is silent.\n\n\t\t\t\tALICE (CON'T)\n\t\tPete?\n\n\t\t\t\tPETE\n\t\tMe, too.\n\n\t\t\t\tALICE\n\t\tI'll call you again.\n\nAlice hangs up.\n\nPete throws the phone back down on the cradle.  It bounces \noff and he has to hang it up again.  He slams it down.\n\n\t\t\t\tCLAIRE\n\t\tWhat's the matter?\n\n\t\t\t\tPETE\n\t\tNothin'.    \n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. DAYTON HOUSE - NIGHT\n\nPete kick-starts his big Harley and roars angrily out of the \ndriveway.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. STREETS - NIGHT\n\nPete rides his cycle fast through neighborhoods.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. VAN NUYS BOULEVARD - NIGHT\n\nPete rides up the boulevard with the \"Cruisers\".  He spots \n\"V's\" car parked at \"Tops\".\n\nHe pulls in beside \"V's\" car and shuts down the engine.  The \nusual crowd is at the drive-in, including Sheila.\n\nPete goes up to \"V\" and Carl and says hello.  He lights a \ncigarette and leans up against a steel pole supporting the \nawning above.  \"V\" and Carl both notice that Pete is in a bad \nmood.\n\nSheila is over with her girlfriends.  She hasn't seen Pete \narrive.\n\nSuddenly Sheila looks over in Pete's direction.  She looks \nlike she's seeing something, yet not seeing anything.  She \nkeeps looking - staring.\n\nSheila's POV she sees \"V\", Carl and a lot of PEOPLE, but \nPete is not there.\n\nPete looks at Sheila.  He's unsettled and confused by her \nstaring, but not seeming to see him.  He watches her turn \naway and take one of her girlfriend's hands - leading her out \nto dance to the LOUD music.\n\nPete watches her dance.  Suddenly, he can't see her.  He \nthinks maybe she may be dancing on the other side of the \nbuilding - out of view.  He moves to look and his head is \nstruck by a violent pain.  He grabs his head with his hand \nand leans forward.  \"V\" grabs his arm.\n\n\t\t\t\t\"V\"\n\t\tYou okay, man?\n\n\t\t\t\tPETE\n\t\tWhat?\n\n\t\t\t\t\"V\"\n\t\tYou okay?... What's wrong7\n\nPete looks up at \"V\".  He doesn't seem to recognize him -\n\"V's\" head is a featureless blur.  Pete shakes his head \ntrying to drive out the pain.\n\nHe looks over again for Sheila.  He sees her there dancing \nwith her girlfriend.\n\n\t\t\t\t\"V\"\n\t\tPete... You okay?\n\n\t\t\t\tPETE\n\t\tYeah.\n\nPete stands back up against the post - turns to \"V\" -\nrecognizing him.\n\n\t\t\t\tPETE (CON'T) \n\t\tI'm, okay... You okay?\n\n\t\t\t\t\"V\"\n\t\tSure, I'm okay.\n\nSome drunk GUYS move over to Sheila and her girlfriend.  They \ncut in on the girls.  The guy with Sheila puts his hand \naround her waist and pulls her against her will into a grind.  \nShe tries to push him away, but he holds on tighter -\nlaughing with his buddy.\n\n\"V\" and Carl look at Pete as he pushes off the post.  Pete \ncrosses quickly to the man dancing with Sheila.  He slams his \nfist into the man's nose - almost snapping the man's neck in \nthe process.  The man goes down bleeding.\n\nPete attacks the other man who is turning toward him ready \nfor a fight.  He hits the man in the gut - the man's head \ngoes down and Pete brings his knee up cracking the man's \nface.  The man's torso flies up with Pete's knee - then \ncontinues on as the man falls to the floor.  Pete picks him \nup, ready to hit him again, but the crowd pulls him off.\n\nPete stands and turns - pulsating with anger.  Sheila is \nthere beside him.\n\n\t\t\t\tSHEILA\n\t\tWhere'd you come from?\n\n\t\t\t\tPETE\n\t\tI've been here.  You were lookin, right\n\t\tat me.\n\n\t\t\t\tSHEILA\n\t\tI was?\n\n\t\t\t\tPETE\n\t\tYeah.\n\nSheila sinks into his arms.\n\n\t\t\t\tSHEILA\n\t\tI didn't know you cared.\n\n\t\t\t\tPETE\n\t\tCome on.\n\nPete takes her to the Harley and they blast off.\n\t\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. ARTHUR'S HIDEAWAY MOTEL - THE ROOM - NIGHT\n\nPete is making desperate love to Sheila in the same room - \nthe same bed, as with Alice.\n\n\t\t\t\tSHEILA\n\t\t\t(whispered pain)\n\t\tPete... Pete...\n\nPete keeps on - harder - obsessed. When he comes, he crashes \ndown on Sheila, who wraps her arms around him tight.  She \ndoesn't know what is going on with him.  Her eyes are open \nwide as she listens to his frantic breathing.\n\nShe doesn't know what to say - or what questions to ask.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. ARTHUR'S HIDEAWAY MOTEL - NIGHT\n\nEd and Al are staring silently at the motel and the Harley \nparked out in front.\n\n\t\t\t\tAL\n\t\tWhat a fuckin' job.\n\n\t\t\t\tED\n\t\tHis or ours?\n\n\t\t\t\tAL\n\t\tOurs, Ed.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. DAYTON HOUSE - NIGHT\n\nPete enters through the front door.  His parents are sitting \nas if they have been waiting for him.\n\n\t\t\t\tPETE\n\t\tHey.\n\n\t\t\t\tBILL\n\t\tSit down a minute.\n\n\t\t\t\tPETE\n\t\tWhat's up?\n\n\t\t\t\tBILL\n\t\tSit down.\n\nPete sits in a chair opposite Bill and Claire.\n\n\t\t\t\tBILL (CON'T)\n\t\tYou don't look so good.\n\n\t\t\t\tPETE\n\t\tI gotta headache... What's goin' on?\n\n\t\t\t\tBILL\n\t\tThe police called us.\n\n\t\t\t\tPETE\n\t\tYeah? what did they want?\n\n\t\t\t\tBILL\n\t\tThey wanted to know if we'd had a chance \n\t\tto find out what happened to you the \n\t\tother night.  They wanted to know if you \n\t\tremembered anything.\n\n\t\t\t\tPETE\n\t\tBut I don't remember anything.  What did\n\t\tyou tell 'em?\n\n\t\t\t\tCLAIRE\n\t\t\t(whispers)\n\t\tWe saw you that night, Pete.\n\n\t\t\t\tBILL\n\t\tYou came home.  Your friend Sheila\n\t\tbrought you here.\n\n\t\t\t\tPETE\n\t\tSheila?\n\n\t\t\t\tBILL\n\t\tYes, there was a man with you... She \n\t\tbrought you here... She didn't know what \n\t\telse to do.\n\n\t\t\t\tPETE\n\t\tWhat is this? Why didn't you tell me?\n\t\tWhat?... I don't remember any of this.\n\n\t\t\t\tCLAIRE\n\t\tWe know that.\n\n\t\t\t\tPETE\n\t\tWho was the man?\n\n\t\t\t\tBILL\n\t\tNever saw him before in my life.\n\n\t\t\t\tPETE\n\t\tDid you tell the police this?\n\n\t\t\t\tBILL\n\t\tWe're not saying anything about that \n\t\tnight to the police. We should all \n\t\tforget that night.\n\n\t\t\t\tPETE\n\t\tWhat happened to me?\n\nBill and Claire just stare at Pete.\n\n\t\t\t\tPETE (CON'T)\n\t\tPlease tell me.\n\n\t\t\t\tBILL \n\t\tNo.\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN: \n\nINT. DAYTON HOUSE - NIGHT\n\nThe clock on the wall reads: 1:30 a.m. The house is \ncompletely quiet, except for the refrigerator motor.\n\nPete is on the phone in the kitchen talking quietly.\n\n\t\t\t\tPETE\n\t\tWhy didn't you tell me you brought me\n\t\there that night?\n\t\t\t(he listens)\n\t\tTo my house... my parents told me.  What\n\t\tare you tryin' to hide?\n\t\t\t(he listens)\n\t\tSheila... Tell me... Who was with me?... \n\t\tWho was the man?...\n\t\t\t(he listens)\n\t\t...When you brought me home! \n\t\t\t(he listens)\n\t\tWhat was he doin' there?\n\t\t\t(he listens)\n\t\tWhat are you cryin' about?...  Sheila?\n\n\t\t\t\t\t\t\t\tFADE OUT:\n\n\t\t\t\t\t\t\t\t FADE IN:\n\nINT. ARNIE'S GARAGE - DAY\n\nPete is working on a car.  The Mercedes Pullman pulls into \nthe shop.  Mr. Eddy gets out with his two assistants.  They \nstay by the car while Mr. Eddy walks over to Pete. Mr. Eddy \nsmiles.\n\n\n\t\t\t\tMR. EDDY\n\t\tHow ya doin', Pete?\n\n\t\t\t\tPETE\n\t\tOkay.\n\n\t\t\t\tMR. EDDY\n\t\tI'm sure you noticed that girl that was \n\t\twith me the other day... Good lookin' \n\t\tblonde?  She stayed in the car?...\n\nPete just stares at Mr. Eddy.  His heart begins to race.\n\n\t\t\t\tMR. EDDY (CON'T)\n\t\tHer name is Alice.  You know I love that \n\t\tgirl to death. If I ever found out \n\t\tsomebody was makin' out with her, I'd \n\t\ttake this ...\n\t\t\t(he opens his coat and pulls \n\t\t\tout his .44 Ruger Blackhawk \n\t\t\tand holds it up in front of \n\t\t\tPete's face)\n\t\t...and shove it so far up his ass it \n\t\twould come out his mouth... Then you \n\t\tknow what?...\n\n\t\t\t\tPETE\n\t\t\t(very quietly)\n\t\tWhat?\n\n\t\t\t\tMR. EDDY\n\t\tI'd pull the trigger and shoot him right\n\t\tbetween the eyes.\n\nAbruptly, Mr. Eddy becomes cool - he holsters his pistol and \nsmiles at Pete.\n\n\t\t\t\tMR. EDDY (CON'T)\n\t\tSo, Pete, you're lookin, better.  What\n\t\thave you been up to?\n\nCLOSE UP ON PETE'S FACE - staring at Mr. Eddy.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nINT. DAYTON HOUSE - NIGHT\n\nThe phone rings in the kitchen.\n\n\t\t\t\tPETE\n\t\t\t(voiceover)\n\t\tI'll get it.\n\nPete moves into the kitchen and picks up the phone.\n\n\t\t\t\tPETE\n\t\tHello.\n\n\t\t\t\tALICE\n\t\tMeet me at the Starlight Motel on \n\t\tSycamore... I'll be there in twenty \n\t\tminutes.\n\n\t\t\t\tPETE\n\t\t\t(hesitates)\n\t\tOkay.\n\nAlice hangs up.  Pete stares at the phone for a moment, then \nhangs it up slowly.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. STARLIGHT MOTEL - NIGHT\n\nPete pulls his Camaro into the parking lot.  When he gets out \nof the car, he hears a voice and looks.up.\n\n\t\t\t\tALICE\n\t\tUp here... Come on.\n\nPete takes a stairway past a \"Coke\" machine and meets Alice \nin front of a second floor room where the door stands open.\n\n\t\t\t\tALICE (CON'T)\n\t\tI already got the room.\n\nPete follows Alice into the motel room and she shuts the \ndoor.\n\n\t\t\t\t\t\t\t \t      CUT TO:\n\nEXT. STARLIGHT MOTEL - NIGHT\n\nEd and Al are parked across the street - watching.\n\n\t\t\t\t\t\t\t\t DISSOLVE TO:\n\nINT. STARLIGHT MOTEL - ROOM - NIGHT\n\nPete and Alice are sitting on the bed - dressed. A bedside\ntable lamp is on.\n\n\t\t\t\tALICE\n\t\tHe'll kill us.\n\n\t\t\t\tPETE\n\t\tAre you positive he knows?\n\n\t\t\t\tALICE\n\t\tI'm not positive... but... he knows.\n\n\t\t\t\tPETE\n\t\tSo what do we do?\n\n\t\t\t\tALICE\n\t\tI don't know.\n\n\t\t\t\tPETE\n\t\tWe should stop seeing each other.\n\n\t\t\t\tALICE\n\t\tNo... no.\n\nAlice moves closer to Pete and melts into him.  She places \nhis hand on her breast and looks in his eyes.\n\n\t\t\t\tALICE (CON'T)\n\t\tI don't want to live without you.\n\nShe kisses Pete and pulls up her sweater to let him feel her \nbare breasts.  Pete kisses her back - lost in his longing for \nher.\n\nAlice breaks away.\n\n\t\t\t\tALICE (CON'T)\n\t\tWe have to get away... We have to get\n\t\tsome money.\n\nPete just stares at her.\n\n\t\t\t\tALICE (CON'T)\n\t\tI know a guy... He pays girls to party\n\t\twith him... He always has alotta cash...\n\nAlice puts her band up to Pete's cbeek and lets it drift \naround.\n\n\t\t\t\tALICE (CON'T)\n\t\tHe'd be easy to rob... Then we'd have the \n\t\tmoney... and we could get away ... We'd be \n\t\ttogether.\n\nAlice kisses Pete's lips over and over - looking in his eyes.\n\n\t\t\t\tPETE\n\t\tHave you partied with him?\n\n\t\t\t\tALICE\n\t\tI used to.\n\nInside, Pete goes crazy with jealousy.\n\n\t\t\t\tPETE\n\t\tYou like it?\n\n\t\t\t\tALICE\n\t\tNo, honey... It was part of the deal.\n\n\t\t\t\tPETE\n\t\tWhat deal?\n\n\t\t\t\tALICE\n\t\tHe works for Mr. Eddy.\n\n\t\t\t\tPETE\n\t\tWhat's he do?\n\n\t\t\t\tALICE\n\t\tHe makes films for Mr. Eddy.\n\n\t\t\t\tPETE\n\t\tPornos.\n\n\t\t\t\tALICE\n\t\tYeah.\n\n\t\t\t\tPETE\n\t\tHow'd you get in with these fuckin'\n\t\tpeople?\n\n\t\t\t\tALICE\n\t\tPete... Don't...\n\n\t\t\t\tPETE\n\t\tHow'd it happen, Alice?\n\n\t\t\t\tALICE\n\t\tIt was a long time ago... I met someone \n\t\tat this place called Moke's... we became \n\t\tfriends.  He told me about a job...\n\n\t\t\t\tPETE\n\t\tIn pornos?\n\n\t\t\t\tALICE\n\t\tNo... A job... I didn't know what.  He \n\t\tset up an appointment for me to see a \n\t\tman.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nALICE'S STORY\n\nWe see Alice wearing a sexy tight dress in a plain room. It \nfeels like we are inside of a large building - maybe an \noffice building.\n\nAlice is waiting nervously.\n\nA SLICKSTER in shiny shirt and pants is leaning against a \nclosed door.\n\nThere is another door off the room which is open onto a room \nwhere a MUSCLE MAN in tiny briefs is doing bench presses.\n\nNo one is saying anything.\n\n\t\t\t\tALICE\n\t\t\t(voiceover)\n\t\tI went to this place... They made me wait \n\t\tforever.  There was some guy guardin' the \n\t\tdoor... I started gettin' nervous... In \n\t\tanother room I could see some guy liftin'\n\t\t\t\t(MORE)\n\n\t\t\t\tALICE (cont'd)\n\t\tweights... Both these guys gave me the\n\t\tcreeps... They never said anything to\n\t\tme... So I just smoked cigarettes and\n\t\twaited.\n\nWe move in on a nervous EXHALE OF SMOKE to a CLOSE UP of \nAlice waiting.\n\nWe see a CLOSE UP of the man guarding the door.\n\nWe see a CLOSE SHOT of the man bench pressing a lot of \nweight.\n\nSuddenly, there are two knocks on the other side of the \nclosed door.  The Slickster moves off the door and opens it a \ncrack.  He talks quietly to someone Alice can't see, then he \nturns, opens the door and gestures for Alice to go through.\n\nAlice puts out her cigarette - her hand is shaking.\n\nShe walks over past the Slickster and enters a much larger \nroom.  There are about FIFTEEN MEN in the room - all leaning \ncomfortably at different points on the walls.  There is only \none chair in the room - Mr. Eddy is sitting in it.\n\nNo one says anything to her, but one man nods his head and \nfrom this nod, Alice feels she should walk to the center of \nthe room.  She does, and she instinctively turns to the man \nsitting in the chair.\n\nThey all just stare at her silently.  She looks around \nnervously - her eyes return to Mr. Eddy's.\n\nSuddenly, a man steps quickly up to her - draws a pistol and \ncocks it against her head.\n\nAlice goes weak in the knees.  Her eyes fill with fear.\n\nThe men continue to stare.\n\nMr. Eddy gives Alice a small gesture as if to say \"well?\".\n\nSomehow she knows what they want, even though they haven't \nasked for it with words.\n\nAlice starts to undress - slowly - in as sexy a way as she \nknows how.\n\nThe men just stare without expression.\n\nWhen she is completely naked, Mr. Eddy gestures her over to \nhim.  Soon she is on her knees in front of him - making \nherself available for whatever he wants.\n\nMr. Eddy's POV - Alice looks in his eyes.  She reaches her \nhand up to stroke his cheek...\n\n\t\t\t\t\t\t\t\t CUT TO:\n\nINT. STARLIGHT MOTEL - ROOM - NIGHT\n\nAlice's hand reaches up and strokes Pete's cheek.\n\n\t\t\t\tPETE\n\t\tWhy didn't you just leave?\n\nAlice doesn't say anything.  She drops her hand - looks down.\n\n\t\t\t\tPETE (CON'T)\n\t\tYou liked it.\n\n\t\t\t\tALICE\n\t\tIf you want me to go away, I'll go away.\n\nThe feelings shift inside Pete.  Alice looks in his eyes.\n\n\t\t\t\tPETE\n\t\tI don't want you to go away.\n\nAlice smiles a little - leans in and they kiss.\n\n\t\t\t\tALICE\n\t\t\t(whispers)\n\t\tI love you, Pete.\n\nThey kiss some more.\n\n\t\t\t\tPETE\n\t\t\t(desperate whisper)\n\t\tI love you, Alice.\n\nThey start to make love - undressing each other and kissing \nall the while.  Alice stops.\n\n\t\t\t\tALICE\n\t\tSo, should I call Andy?\n\n\t\t\t\tPETE\n\t\tAndy?\n\n\t\t\t\tALICE\n\t\tThat's his name...Andy.  Our ticket out\n\t\tof here.\n\n\t\t\t\tPETE\n\t\tYeah.  Call him.\n\nAlice gets serious.\n\n\t\t\t\tALICE\n\t\tI'll set it up for tomorrow night.  \n\t\tYou'll meet me at his place at eleven \n\t\to'clock... Don't drive there... Take a \n\t\tbus ... Make sure no one follows you...\n\t\tHis address is easy to remember... It's \n\t\t2224 Deep Dell Place... It's a white \n\t\tstucco job on the south side of the \n\t\tstreet... I'll be upstairs with Andy... \n\t\tThe back door will be open... That leads \n\t\tinto the kitchen - go through the kitchen \n\t\tto the living room - there's a bar \n\t\tthere... At eleven fifteen, I'll ask Andy \n\t\tto fix me a drink... When he does, you \n\t\tcan crack him in the head... Okay?\n\n\t\t\t\tPETE\n\t\tOkay...\n\n\t\t\t\tALICE\n\t\tLemme call him now.  Make sure he's not\n\t\talready busy tomorrow night.\n\n\t\t\t\tPETE\n\t\tOkay.\n\nStill entwined with each other, Alice reaches for the phone\nand dials a number. It starts to ring and she smiles at Pete\nwhen she hears it being answered.\n\n\t\t\t\tALICE\n\t\tAndy?... It's me, Alice.  How ya doin?...\n\t\t\t(whispers)\n\t\tAndy... I can get away tomorrow night...\n\t\tI could come to your house... That sounds\n\t\tgood... Around nine... Yeah, me too,\n\t\tAndy... Great... See ya then.\n\nShe hangs up the phone.\n\n\t\t\t\tALICE (CON'T)\n\t\tSet.\n\n\t\t\t\tPETE\n\t\tWhy are ya goin' so early?\n\n\t\t\t\tALICE\n\t\t'Cause that's how long it's gonna take,\n\t\tbaby.\n\n\t\t\t\tPETE\n\t\tWhat if Andy tips off Mr. Eddy?\n\n\t\t\t\tALICE\n\t\tAre you kidding?... I've got so much on\n\t\tAndy, it isn't funny.\n\n\t\t\t\tPETE\n\t\tWhat about tonight?... Whatiya gonna do\n\t\tabout Mr. Eddy tonight?\n\n\t\t\t\tALICE\n\t\tI'm not goin' home tonight ... I'm goin'\n\t\tsomewhere else..\n\t\t\t(off his look)\n\t\tTo a girlfriend's house.\n\t\t\t(she smiles)\n\t\tBut, we still have a coupla things to\n\t\ttake care of...\n\n\t\t\t\tPETE\n\t\tOh, yeah?... What else?\n\nAlice reaches down between their legs.  Pete smiles.\n\n\t\t\t\tALICE\n\t\tThis... and this.\n\nThey start to go at it again - at first slowly and tenderly -\nthen wildly.  Alice tears herself away and looks up at Pete.\n\n\t\t\t\tALICE (CON'T)\n\t\tAre you my man?\n\n\t\t\t\tPETE\n\t\t\t(getting hotter)\n\t\tYes.\n\n\t\t\t\tALICE\n\t\tAre you gonna be a man about this, Pete?\n\nPete looks at her - starting to understand what she means.\n\n\t\t\t\tALICE (CON'T)\n\t\tAre you?\n\nPete stares at her - then nods.\n\n\t\t\t\t\t\t\t\t DISSOLVE TO:\n\nEXT. DAYTON HOUSE - NIGHT\n\nPete drives up and parks his Camaro in the driveway.  When he \ngets out of the car, he sees Sheila standing by the front \nstep.  She is looking in his direction, but doesn't seem to \nsee him.  She SUDDENLY turns and looks up the street - she \nYELLS.\n\n\t\t\t\tSHEILA\n\t\t\t(total horror)\n\t\tTHERE'S SOMEONE WITH HIM!!\n\nAs she yells, she starts to look around wildly - then her \neyes follow the path the Camaro took into the driveway - then \nthe path Pete took to where he has been standing all this \ntime.  Her eyes find Pete and she stands by the front step.\n\n\t\t\t\tPETE\n\t\t\t(frightened)\n\t\tSheila?\n\nShe heads toward him.\n\n\t\t\t\tPETE\n\t\tSheila, what is it?... What are you doin'\n\t\there?\n\n\t\t\t\tSHEILA\n\t\tYou've been fucking somebody else haven't\n\t\tyou?\n\n\t\t\t\tPETE\n\t\tSheila...\n\n\t\t\t\tSHEILA\n\t\tYou fuck me whenever you want... You\n\t\tdon't call... Tell me who she is.\n\nSheila has come up and is grabbing Pete by the front of his \nshirt.\n\n\t\t\t\tPETE\n\t\tHey... Sheila.\n\n\t\t\t\tSHEILA\n\t\tWhat's the BITCH'S name?!\n\n\t\t\t\tPETE\n\t\tLook Sheila... I'm sorry...\n\n\t\t\t\tSHEILA\n\t\tYOU'RE SORRY!!\n\n\t\t\t\tPETE\n\t\tGo home, Sheila.\n\nSheila starts beating him in the face and chest.\n\n\t\t\t\tSHEILA\n\t\tYOU'RE SORRY!! YOU PIECE OF SHIT!!\n\t\tYOU'RE SORRY!!\n\nShe starts crying and hitting him harder.\n\n\t\t\t\tSHEILA (CON'T)\n\t\tFUCK YOU!!\n\nSheila's screaming is reverberating around the neighborhood.  \nINSIDE PETE'S MIND the SOUNDS are even LOUDER.\n\nBill comes out of the house.  Claire is behind him waiting on \nthe front porch.\n\nSheila beats Pete and trips him to the ground.  She is \nsobbing as she tears at him.\n\n\t\t\t\tPETE\n\t\tSheila... Stop...\n\n\t\t\t\tSHEILA\n\t\tFUCK YOU!! FUCK YOU!!\n\nBill comes up to Sheila and takes her gently by the \nshoulders.\n\nSheila jerks around and looks up at Bill.\n\n\t\t\t\tBILL\n\t\tWhy don't you two come inside and talk \n\t\tthings over quietly... Come on... Come on \n\t\tin, Sheila.\n\nSheila gets to her feet - crying.  She looks down at Pete, \nwho remains lying on the front lawn.\n\nFor Pete, every word and every sound is LOUD and DISTORTED.  \nThe DRONING SOUND returns.\n\n\t\t\t\tSHEILA\n\t\t\t(to Pete)\n\t\tYou are different.\n\n\t\t\t\tBILL\n\t\tSheila... \n\n\t\t\t\tSHEILA\n\t\t\t(to Bill)\n\t\tTELL HIM!\n\nThe phone inside the house starts to ring.  Claire turns in \nthe doorway and goes to answer it.\n\n\t\t\t\tBILL\n\t\tSheila... Don't.\n\n\t\t\t\tSHEILA\n\t\tI don't care anyway... I'm sorry, Mr. \n\t\tDayton... I won't bother you or any \n\t\tmember of your family again.\n\nSheila runs off crying.  Pete and Bill watch her go.\n\nClaire comes to the door.\n\n\t\t\t\tCLAIRE\n\t\tPete... There's a man on the phone.  He's\n\t\tcalled a couple of times tonight.\n\nPete pulls himself up.\n\n\t\t\t\tPETE\n\t\tWho is it?\n\n\t\t\t\tCLAIRE\n\t\tHe won't give his name.\n\nPete walks slowly inside - stares at the phone and picks it \nup.\n\n\t\t\t\tPETE\n\t\tHello.\n\n\t\t\t\tMR. EDDY\n\t\t\t(phone voice)\n\t\tHey, Pete... How ya doin'?\n\n\t\t\t\tPETE\n\t\tWho is this?\n\n\t\t\t\tMR. EDDY\n\t\tYou know who it is.\n\nBill and Claire have stopped in the living room - watching \nPete.  Pete is going crazy with Mr. Eddy on one end, and his \nparents staring at him on the other.  He waves his parents \naway, but they leave slowly and reluctantly.\n\n\t\t\t\tPETE\n\t\tMr. Eddy?\n\n\t\t\t\tMR. EDDY\n\t\tYeah... How ya doin', Pete?\n\n\t\t\t\tPETE\n\t\tOkay.\n\n\t\t\t\tMR. EDDY\n\t\tYou're doin, okay?  That's good, Pete.\n\n\t\t\t\tPETE\n\t\tLook... It's late, Mr. Eddy... I ...\n\n\t\t\t\tMR. EDDY\n\t\tI'm really glad you're doin' okay, Pete.\n\nPete doesn't know what to say.\n\n\t\t\t\tMR. EDDY\n\t\tYou sure you're doin' okay? Everything\n\t\tall right?\n\n\t\t\t\tPETE\n\t\tYeah.\n\n\t\t\t\tMR. EDDY\n\t\tThat's good, Pete.  Hey... I want you to\n\t\ttalk to a friend of mine.\n\nPete can hear the phone being handed over to someone.  There \nis a long silence.  Pete can hear breathing.\n\n\t\t\t\tVOICE\n\t\tWe've met before, haven't we?\n\nPete freezes.  His mind is scrambling.\n\n\t\t\t\tPETE\n\t\tI don't think so.  Where was it that you\n\t\tthink we've met?\n\n\t\t\t\tVOICE\n\t\tAt your house.  Don't you remember?\n\n\t\t\t\tPETE\n\t\tNo. No, I don't.\n\n\t\t\t\tVOICE\n\t\tWe just killed a couple of people...\n\n\t\t\t\tPETE\n\t\tWhat?\n\nPete can hear Mr. Eddy laugh in the background.\n\n\t\t\t\tVOICE\n\t\tYou heard me... We thought we'd come over\n\t\tand tell you about it.\n\nPete is getting pale with fear.\n\n\t\t\t\tPETE\n\t\tWhat's goin' on?\n\n\t\t\t\tVOICE\n\t\tGreat question!! In the east ... the far \n\t\teast... when a person is sentenced to \n\t\tdeath... they're sent to a place where \n\t\tthey can't escape... never knowing when \n\t\tan executioner will step up behind them \n\t\tand fire a bullet into the back of their \n\t\thead... it could be days... weeks... or \n\t\teven years after the death sentence has \n\t\tbeen pronounced... This uncertainty adds \n\t\tan exquisite element of torture to the \n\t\tsituation, don't you think?  It's been a \n\t\tpleasure talking to you.\n\nPete can hear the phone being passed again.\n\n\t\t\t\tMR. EDDY\n\t\tPete... I just wanted to jump on and tell\n\t\tyou I'm really glad you're doin' okay.\n\nThe phone goes dead and Pete sits - fearfully pondering his \nfate.  He hears a NOISE and turns.\n\nDown at the far end of the hall he sees his parents staring \nat him.\n\nCLOSE UP ON PARENTS staring in the direction of the living \nroom as if sensing something, but not seeing.\n\nPARENTS POV - The hall and living room beyond.  There is no \none there.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. STREET - BUS STOP - NIGHT\n\nA City Bus pulls up to the stop.  The doors open and Pete \nclimbs on.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nINT. BUS - NIGHT\n\nPete rides along in the empty bus.  He stares at his \nreflection in the dark window.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nEXT. STREET - BUS STOP - NIGHT\n\nThe bus stops and Pete gets out.  He starts walking.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nEXT. DEEP DELL PLACE - NIGHT\n\nWe see a street sign saying \"Deep Dell Place\".  Pete walks up \nthe street looking at numbers.\n\nHe finds 2224 Deep Dell Place - Andy's House.\n\nHe stares at the house from the sidewalk.\n\nLights are on upstairs and down.  The hot wind moves big \nshadows of trees over the front of the house.\n\nPete looks at his watch.  It reads: 11:05 p.m.\n\nHe walks down the driveway, crosses through some bushes and \ncomes to a fence separating the front yard from the back.\n\nHe stops and listens.  He pulls himself up and over the \nfence, but crashes on something on the other side.\n\nHe freezes - listening. He hears the wind blowing through \nthe trees, and distant music from inside - a slow jazz piece.  \nHe hears echoing sounds of love making.\n\nHe makes his way around back - goes up the stairs and tries \nthe back door.  It opens.\n\n\t\t\t\t\t\t\t\t     CUT TO:\nINT. ANDY'S HOUSE - NIGHT\n\nPete sneaks through the kitchen and comes into the living \nroom.  Pete stops short and stares.  A movie projector is \nrunning in the living room.  A porno film is being projected \non a huge screen at the far end.  Alice is in the porno film.  \nA man is fucking her from behind - with LOUD SLAPPING SOUNDS \nof flesh banging flesh.  Her face is in the foreground.  Her \neyes look out directly at Pete.  She is loving every minute \nof it.  Inside Pete, jealousy starts to rage out of control.  \nHe looks around.  He sees clothes scattered about.  He picks \nup a girl's sweater and smells it.  He looks up the stairs.\n\nFeet appear at the top of the stairs.  They start down.\n\nPete runs for the bar.\n\nAlong the way, he grabs a heavy, bronze figurine of a well-\nstacked woman off a rectangular glass-topped coffee table, \nand ducks behind the bar.\n\nHe can hear Andy approaching.  He can hear Andy gather two \nglasses.  He can hear Alice being fucked harder in the porno \nfilm.  He clenches his teeth with rage.\n\nSuddenly, Andy moves right in front of him.  They see each \nother.  Andy's eyes widen - Pete leaps up, and thwacks the \nbronze figurine down on the top of Andy's head.  Andy falls.  \nThe breasts of the figurine have made two bloody holes in his \nforehead.\n\nPete turns.\n\nAlice is coming quickly down the stairway - naked, except for \na pair of panties.  Lipstick is smeared around her mouth.  \nShe is carrying a half-filled pillowcase.  Her porno film is \nplaying on the wall \nbehind her.\n\nThese images jump and spin in Pete's mind.  He moves \nunsteadily toward her.\n\n\t\t\t\tALICE\n\t\tYou got him.\n\n\t\t\t\tPETE\n\t\t\t(still holding the figurine)\n\t\tAlice, I...\n\nPete starts to tremble.  He drops the figurine.  He tries to \nembrace her.\n\nThere is a crashing noise behind him.\n\nPete turns and sees Andy staggering, blood streaming from the \nwound in his head, THEN CHARGING FULL SPEED AT PETE.\n\nAndy hits him hard, and Pete goes down.  When Pete hits the \nground, he pushes Andy up and throws out his arms.  This, and \nAndy's momentum, catapult Andy into the corner of the \nrectangular glass-topped coffee table.  There is a sound like a\nhammer going through a bucket of eggs as the glass corner \nembeds about eight inches into Andy's forehead.\n\nCLOSE UP OF ANDY'S HEAD - impaled on the sharp corner of the \ntable, his chest area suspended, his legs and stomach \ntouching the floor.\n\n\t\t\t\tALICE\n\t\t\t(amazement - no feeling)\n\t\tWow!\n\nPete pulls himself off the floor.\n\nPete moves close to Alice, they drift to the glass coffee \ntable, staring for a few moments at Andy's dead body.\n\nWhile Pete stares, unbelieving, at Andy - Alice hurriedly \npicks up her sweater and puts it on. On the sofa next to it \nlay Andy's trousers.  She goes through the pockets, finds a \nroll of cash bound by a rubber band.  Alice hands the roll to \nPete.\n\n\t\t\t\tALICE (CON'T)\n\t\tPut this in your pocket.\n\nAlice kneels next to Andy's body and quickly removes his \nRolex wristwatch, a couple of rings and the gold chain \ndangling from his neck.  These items she puts inside the \nempty pillowcase.\n\nAlice finds the rest of her clothes scattered about the \nliving room and puts them on.  Pete watches her, trembling, \nunable to say anything.\n\nShe comes back to Pete, who starts breathing irregularly, \nhyperventilating.\n\n\t\t\t\tALICE (CON'T)\n\t\tYou all right?\n\n\t\t\t\tPETE,\n\t\tWe killed him.\n\n\t\t\t\tALICE\n\t\tYou killed him.\n\n\t\t\t\tPETE\n\t\tAlice?\n\nAlice slides up close to Pete.\n\n\t\t\t\tALICE\n\t\tIt was an accident... Accidents happen\n\t\tevery day.\n\nPete clutches her, eyes squeezed tight, as if he is holding \non for dear life.\n\n\t\t\t\tPETE\n\t\tAlice...\n\n\t\t\t\tALICE\n\t\t\t(pushing back)\n\t\tWe gotta get the stuff and get out of\n\t\there.\n\nAlice starts off across the living room with the pillowcase.\n\nPete opens his eyes, he sees Alice move as a blur.  He looks \naround the room, which spins in and out of focus.  His eyes \nland on, a PHOTOGRAPH in a frame on the wall.  This photo \ntroubles him.  Pete squints, then points to the photograph.\n\n\t\t\t\tPETE\n\t\tIs that you?  Are both of them you?\n\nCLOSE UP OF THE PHOTOGRAPH - Four people appear in the frame: \nAndy, Renee, Alice and Mr. Eddy.\n\nAlice stops and comes back.  She looks at the photo, walks \ncloser to it, and points at herself.\n\n\t\t\t\tALICE\n\t\tThat's me.\n\nShe turns to Pete.  Pete is staring at the photograph - at \nAlice and Renee in the photograph.  His nose is bleeding\nprofusely.\n\n\t\t\t\tALICE (CON'T)\n\t\tPete?...\n\nPete starts to reel - blood from his nose soaking his shirt.\n\n\t\t\t\tPETE\n\t\tWhere's the bathroom?\n\n\t\t\t\tALICE\n\t\tUp the stairs - down the hall.\n\nPete runs up the stairs\t- about to get sicker. Alice watches\nhim go with a nuance of\tdisdain.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nINT. ANDY'S HOUSE - UPSTAIRS - NIGHT\n\nPete staggers toward the bathroom at the rear right of the \nhallway.  THE HALLWAY SUDDENLY BECOMES HAZY, DIFFERENT AND \nLONGER THAN IT APPEARED TO BE.\n\nPete wanders down this \"changed\" hall.  On his left, he \nidentifies a door with the number 25 on it.  He pauses for a \nmoment in front of it, then goes on until, on his right, he \ncomes to a door with the number 26 on it.  He enters through \nthis door.\n\nInside is a WOMAN in front of a mirror with a MAN.  Her arms \nare resting on a shelf under the mirror as the man takes her \nfrom behind.  The man's face is blank, featureless, and is \nburied in the woman's back - we can't see it.\n\nPete now sees that the woman is an extremely whorish version \nof Alice - she's looking at Pete's reflection in the mirror.  \nHe's looking at her reflection in the mirror.  Pete's head is \npounding.\n\n\t\t\t\tWOMAN/ALICE\n\t\t\t(to Pete)\n\t\tDid you want to talk to me?\n\nPete rubs his head - the pain is severe.\n\n\t\t\t\tWOMAN/ALICE\n\t\t\t\t(CON'T)\n\t\t\t(laughs)\n\t\tDid you want to ask me \"why\"?\n\nPete staggers out of the room.\n\nHe closes the door.  The hallway has \"changed\" back to Andy's \nhallway.  The doors no longer have numbers.\n\nPete walks, unsteadily, back down the hall - faltering.  He \nstarts down the stairs.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nINT. ANDY'S HOUSE - LIVING ROOM - NIGHT\n\nPete comes downstairs to the living room and sees Alice at \nthe desk in the corner, filling the pillowcase with cash and \njewelry.\n\nShe has a PISTOL in her hand.\n\nAlice turns when she hears Pete and they study each other's \nface as Pete makes his way to her.  His head is still \nthrobbing with pain.  His focus goes from her face to the gun \n- which is pointing right at him - back to her.  Alice \nsmiles.\n\n\t\t\t\tALICE\n\t\tDon't you trust me, Pete?...\n\nShe laughs and hands him the pistol.\n\n\t\t\t\tALICE (CON'T)\n\t\tStick that in your belt.\n\nShe shows him the pillowcase filled with loot.\n\n\t\t\t\tALICE (CON'T)\n\t\t\t(going through the loot)\n\t\tLook at all this shit... I know a \n\t\tfence... he'll give us money and get us \n\t\tpassports in exchange for this and the \n\t\tcar...\n\t\t\t(looks up at him)\n\t\tWe can go anywhere.\n\n\t\t\t\tPETE\n\t\tAlice?\n\nAlice grabs Pete's arm and hurries him toward the door.\n\n\t\t\t\tALICE\n\t\tCome on, baby.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nEXT. ANDY'S HOUSE - DRIVEWAY - NIGHT\n\nAlice takes Pete to Andy's car and throws him the keys.\n\n\t\t\t\tALICE\n\t\tYou drive.\n\nAlice jumps in Andy's car and tosses the bulging pillowcase \nin the back.  Pete takes the revolver out of his belt.  He \nopens the driver's side door of Andy's car and slowly sits \ninside.  He sets the pistol on the seat between them.  He \nlooks up at her.  She smiles wildly.  Pete slalms the door -\nstarts the car and they drive off.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nEXT. RESIDENTIAL STREET - EDGE OF THE DESERT - NIGHT\n\nAlice and Pete pull up into the driveway of a house at the \nend of a street at the edge of a desert.  Alice gets out into \na hot wind.  Pete stays in the car as she goes up to the \nhouse.\n\nPete's POV: He watches Alice ring the doorbell.  She waits \nin front of the door for a few moments, her hair blowing in \nthe wind.\n\nA HOUSEBOY opens the door.  Alice says something to him -\nPete cannot bear anything that is said, even though his \ndriver's side window is down.  All he can hear is the hot \nwind blowing.\n\nThe Houseboy moves out to where he can see Pete, waiting in \nthe car.  The Houseboy and Alice exchange information.  The \nHouseboy points out toward the desert.  Alice turns back to \nthe car. The Houseboy watches her.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nINT. ANDY'S CAR - NIGHT \n\nAlice gets into the car.\n\n\t\t\t\tALICE\n\t\tCome on.\n\nPete starts the car and begins backing it out the drive.  The \nHouseboy is still standing - watching them.\n\n\t\t\t\tALICE (CON'T)\n\t\tWe have to go to the desert.  He's at his\n\t\tcabin.\n\nPete and Alice drive off.  The Houseboy continues to watch \nthem.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. DESERT - TWO-LANE HIGHWAY - NIGHT\n\nWe see the clean moving POV illuminated by headlights.  We're \nfloating down an old two-lane highway through a desolate, \ndesert landscape.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. DESERT - NIGHT\n\nPete and Alice pull off the two-lane highway onto a barely \ndiscernible dirt road that cuts through the dark desert.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. DESERT - NIGHT\n\nPete and Alice drive up to a ONE ROOM CABIN built on stilts \nnext to a dry lakebed.  They both get out and go up the \nstairs to a porch where Alice knocks on the door.  There is \nno answer.\n\nAlice opens the door, but there is NOBODY INSIDE.\n\n\t\t\t\tALICE\n\t\tWe'll have to wait.\n\nThe hot wind continues to blow.\n\nAlice and Pete walk back down to the car.\n\nThe HEADLIGHTS are on and Alice reaches in through the window \nand switches on the RADIO.  She can't get anything in but \nstatic, with bits and pieces of old tunes fading in and out.  \nShe hits the \"seek\" button.  The radio starts to search.\n\nPete is standing in the glare of the headlights watching her.  \nAlice walks slowly to him.\n\nThe camera captures this from a back seat perspective - then \ndrifts toward them.\n\n\t\t\t\tPETE\n\t\tWhy me, Alice?  Why choose me?\n\nThe radio sticks on a particular tune - a tune filled with\nlonging. Alice begins to dance.  She takes Pete's hand and\npulls him close to her.\n\n\t\t\t\tALICE\n\t\tSo we can be together... You still want\n\t\tto be with me, don't you Pete?\n\nAlice gives Pete that wild smile.\n\n\t\t\t\tALICE (CON'T)\n\t\tMore than ever?\n\nShe kisses Pete over and over.  He begins to kiss her back.  \nShe starts to move him in a dance to the music in the glare \nof the headlights, the hot wind caressing them.\n\nThe scene is out of a dream.  Alice and Pete help each other \nundress as they dance in and out of the light, and the wind \nwhips at their bodies.\n\nThey sink down on the soft ground and start making love.\n\nThe lights from the headlights combine with the starlight, \nbathing them in a pristine glow.\n\nThe music fades and the radio begins to \"seek\" through static \nfor another station.  The music it finds now is LOUD and \nINTENSE.\n\nAlice - her hunger appearing, now becomes carnivorous in her \napproach to love making with Pete.  She is the aggressor, \nhighly-charged - she wants more and more - taking, not \ngiving, insatiable.\n\nThe headlights flare their bodies in blinding light.  They \nbecome amorphous, glowing shapes burning in the light.\n\nPete is trying desperately to please her - to have her.\n\nThe driving music fills with cracks of piercing static.  The \nradio strains to hold the station.\n\nPete's white-hot body clings to Alice.  He chokes with \nemotion.\n\n\t\t\t\tPETE\n\t\tI want you... I want you...\n\nWith a burning smile, Alice rolls them out of the beams of \nlight into the darkness.  The wind billows a black cloud of \ndust around them.\n\nAlice pulls away from Pete and brings her dark mouth to his \near.\n\n\t\t\t\tALICE\n\t\tYou'll never have me.\n\nAlice glides away from Pete and stands up looking down at him \nfrom above.\n\nShe turns and walks, naked, to the cabin where she disappears \nwithin it.\n\nPete turns, face down on the ground in the darkness.  He's \nholding his head and shaking.\n\nAs he starts to stand - he turns into the glare of the\nheadlights and we see that it is NOT PETE - BUT FRED.\n\nAs Fred stands up, the car's LIGHTS DIM and the RADIO FADES.\n\nFred looks at the car.  He sees some movement inside.  Fred \nlooks closer and sees the figure of a man in the back seat.\n\nCLOSE UP OF THE MAN - it's the Mystery Man from Andy's party.\n\n\t\t\t\tVOICE FROM BEHIND\n\t\t\t\tFRED\n\t\tHello.\n\nFred turns toward the cabin and sees the Mystery Man now \nstanding in the doorway.\n\nFred turns again to the car, but this time it's empty.  He \nlooks back at the cabin and sees the Mystery Man still in the \ndoorway.\n\n\t\t\t\tMYSTERY MAN\n\t\tHere I am.\n\nFred is dizzy with fear and confusion.\n\nHe pulls on his trousers and shoes and walks up the steps to \nthe cabin toward the Mystery Man, who goes inside.  Fred \nstops in the doorway.  He looks around.\n\n\t\t\t\tFRED\n\t\tWhere's Alice?\n\n\t\t\t\tMYSTERY MAN\n\t\tAlice who?\n\nFred looks around again but there is no one there except the \nMystery Man - standing in the center of the room.  Fred \nstares at him.\n\n\t\t\t\tMYSTERY MAN\n\t\t\t\t(CON'T)\n\t\tHer name is Renee.  If she's told you her\n\t\tname is Alice, she's lying.\n\t\t\t(filled now with anger)\n\t\tAND YOUR NAME, WHAT THE FUCK IS YOUR\n\t\tNAME?!\n\nFred freaks, scared to death. He bolts down the stairs to \nthe car, stumbling more than once. \n\nFred attempts to start the car which is drained of electrical \ncharge by the use of the headlights and radio.\n\nThe Mystery Man appears in the doorway of the cabin.  He \nstarts toward Fred.\n\nThe starter motor moans as Fred twists the key frantically.\n\nThe smiling Mystery Man is almost at the car,\n\nThe engine catches.  Fred revs it - throws the car in reverse \nand peels out away from the Mystery Man, whose hand is\nreaching for him.\n\nFred swerves the car around - throws it in drive, and takes \noff across the dark desert.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. DESERT HIGHWAY - NIGHT\n\nFred pulls up onto the two-lane highway.  An old, rusted \nroadsign is posted there.  It reads: \"LOST HIGHWAY\".\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nFred is driving along the two-lane desert \"lost highway\".  \nThe wind is picking up even stronger than before.  A big \nstorm is blowing in.\n\nFred sees a sign glowing just ahead that reads: LOST HIGHWAY \nHOTEL.  The sign is swaying and blinking as the gusts hit it.\n\nFred pulls in and stops under the sign and stares at it.\n\nHe gets out of the car, tucks the pistol in his belt under \nhis shirt and enters the hotel, which is an old two-story \nbuilding.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nINT. LOST HIGHWAY HOTEL - OFFICE - NIGHT\n\nFred walks up to the registration desk, where a CLERK is \nsmiling at him in a half-baked way.\n\n\t\t\t\tCLERK\n\t\tYou just got in before the big storm\n\t\thits.\n\nFred pulls the roll of bills from his pocket.\n\n\t\t\t\tFRED\n\t\tI need a room.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nINT. LOST HIGHWAY HOTEL - UPSTAIRS HALLWAY - NIGHT\n\nThe hallway is strangely similar to Pete's vision upstairs at \nAndy's.  Fred comes to the door numbered 25, looks at his key \nwhich says \"25\" and unlocks the door and enters.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nINT. LOST HIGHWAY HOTEL - ROOM 25 - NIGHT\n\nFred takes the revolver out of his shirt and puts it under \nthe pillow on the bed.\n\nHe sits on the edge of the bed.  He takes a cigarette from a \npack in his shirt pocket and lights it with a match from a \nbook of \"Lost Highway Hotel\" matches.\n\nFred smokes the cigarette, listening to the wind blow.  \nLightning cracks outside the window.\n\nFred crushes the cigarette out in the ashtray on the bedside \ntable.  As the last of the blue smoke drifts away, Fred falls \nback on the bed.\n\nFred closes his eyes.\n\n\t\t\t\t\t\t\t\t    FADE OUT:\n\n\t\t\t\t\t\t\t\t     FADE IN:\n\nINT. LOST HIGHWAY HOTEL - CORRIDOR - NIGHT\n\nThe camera moves in on the door numbered 26.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nINT. LOST HIGHWAY HOTEL - ROOM 26 - NIGHT\n\nRenee is in bed with Mr. Eddy/Laurent.  He and Renee are \nfeverishly making love as the storm rages outside.\n\n\t\t\t\t\t\t\t\t DISSOLVE TO:\n\nINT. ANDY'S HOUSE - NIGHT\n\nA criminal investigation is under way.  Ed and Al are \npresent, among a fleet of LAW ENFORCEMENT PERSONNEL who are \nbusy dusting for fingerprints and examining the murder site.\n\n\t\t\t\tED\n\t\tHey, Al, look at this.\n\nAl walks over to where Ed is looking at the photo on the \nwall.  Al looks at it.\n\n\t\t\t\tAL\n\t\tIt's her, all right.  Fred Madison's \n\t\twife ... with Dick Laurent and Mr. Dent-\n\t\thead over there.\n\nCLOSE UP ON THE PHOTOGRAPH - that shows RENEE AS THE ONLY \nWOMAN IN THE PICTURE, standing between Andy and Mr. Eddy/ \nLaurent.\n\n\t\t\t\tAL\n\t\tWe've got Pete Dayton's prints all over\n\t\tthis place.\n\n\t\t\t\tED\n\t\tYou know what I think?\n\n\t\t\t\tAL\n\t\tWhat's that, Ed?\n\n\t\t\t\tED\n\t\tThere's no such thing as a bad\n\t\tcoincidence.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nINT. LOST HIGHWAY HOTEL - ROOM 26 - PRE-DAWN\n\nRenee is sitting half dressed on the edge of the bed, pulling \non her stockings.  Mr. Eddy/Laurent is asleep next to her.  \nRenee stands up, finishes dressing, then leans down and \nkisses her lover while he sleeps.  Renee leaves the room, \nclosing the door as quietly as possible behind her.\n\nAs the door CLICKS, Mr. Eddy/Laurent wakes up.  He sits up \nand gets a pack of cigarettes from the bedside table, shakes \none out, lights it with a book of \"Lost Highway Hotel\" \nmatches, and smokes it while seated on the edge of the bed.\n\n\t\t\t\t\t\t\t\t     CUT TO:\n\nINT. LOST HIGHWAY HOTEL - ROOM 25 - PRE-DAWN\n\nFred, still fully dressed, is waking up, AS IF IN A TRANCE -\nthe same attitude he had on the videotape.  He strains \nupwards and looks eerily around the room.  He gets up and \ncrosses slowly to a window.  He takes the edge of the window \ncurtain and pulls it back.\n\nThe view is of the gravel parking lot of the hotel.\n\nFred's POV: He sees Renee, down below, walk over to a car, \nget in and drive away.\n\nFred walks back to his bed, picks up his revolver from under \nthe pillow, crosses the room to the door and walks out.\n\n\t\t\t\t\t\t\t\t    CUT TO:\n\nINT. LOST HIGHWAY HOTEL - CORRIDOR - PRE-DAWN\n\nFred crosses over to Room 26 and knocks softly on the door.\n\n\t\t\t\t\t\t\t\t    CUT TO:\n\nINT. LOST HIGHWAY HOTEL - ROOM 26 - PRE-DAWN\n\nMr. Eddy/Laurent is standing - almost dressed, when he hears \nthe knock.\n\n\t\t\t\tMR. EDDY/LAURENT\n\t\tRenee?\n\nHe goes to the door and opens it a crack.\n\nAs the door opens, Fred smashes the gun into Mr. Eddy/ \nLaurent's face and pushes his way inside the room.\n\nFred hits Mr. Eddy/Laurent viciously again with the gun \nbarrel.\n\nMr. Eddy/Laurent is bleeding profusely from gashes on his \nforehead and nose.\n\n\t\t\t\tMR. EDDY/LAURENT\n\t\tWhat the fuck? What's going on?\n\n\t\t\t\tFRED\n\t\t\t(pointing the gun at him)\n\t\tYou're coming with me.\n\nFred puts the pistol up against Mr. Eddy/Laurent's head and \nmarches him out of the room - past the camera's eye.\n\nThe camera stays in the room and moves slowly toward the \nwindow, through which we see Fred and Mr. Eddy/Laurent appear \ndown below in the back lot.\n\nStill watching out the window, the camera sees Fred knock Mr. \nEddy/Laurent over the head with the gun butt and put him into \nthe trunk of a car.  Fred slams the trunk lid and climbs into \nthe driver's side of what is obviously Mr. Eddy/Laurent's car \n- the Mercedes 600 Pullman.\n\nAs Fred drives away, a HAND appears in our window foreground. \nThe hand moves the window curtain further to one side.  The \ncamera pulls back to reveal it as the hand of the Mystery \nMan.  The Mystery Man leans fully into the frame and watches \nFred drive off down the Lost Highway as day breaks.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. DESERT HIGHWAY - DAYBREAK\n\nFred is driving along the road.  Suddenly he pulls the car \noff the road and drives over the dirt and brush to a deserted \nspot, stops and gets out.\n\nFred opens the trunk. When he does ...\n\nSuddenly, Mr. Eddy/Laurent charges up and attacks Fred -\nknocking them both to the ground.  Mr. Eddy/Laurent tries to \nstrangle Fred, but Fred's anger is too great.  Fred tears \nloose and gets Mr. Eddy/Laurent in a hold bending his head \nback.  Fred's hand reaches out behind him - feeling, \nsearching.\n\nA KNIFE appears.\n\nit comes into Fred's hand from another.\n\nFred slices Mr. Eddy/Laurent's throat, and throws him down.\n\nMr. Eddy/Laurent squirms on the ground - his hand grasped \naround his throat - trying to hold his neck together.  Blood \nis flowing rapidly through his fingers and over the front of \nhim as be turns and opens his mouth with a gurgling sound.\n\nFred stands, facing him, his pistol out now - pointing right \nat Mr. Eddy/Laurent's forehead.\n\nCLOSE UP ON MR. EDDY/LAURENT - he lifts his head and stares \nat Fred.  Blood is rushing out of him.\n\n\t\t\t\tMR. EDDY/LAURENT\n\t\t\t(wet and jagged)\n\t\tWhat do you guys want?\n\nThe camera pans around to Fred - we see that the Mystery Man \nis standing beside Fred, and it is the Mystery Man who is \nholding the gun, not Fred.\n\nThe Mystery Man reaches into his pocket and pulls out a \nlittle watchman TV.  He turns it on and hands it over to Mr. \nEddy/Laurent, who manages to take it.\n\nMr. Eddy/Laurent looks down at the small television screen.\n\nMr. Eddy/Laurent's POV: As he watches the TV screen, we move \nin until the screen fills the frame - as with the former \nvideotapes.  The full frame of the TV screen reveals -\n\nINT. ANDY'S HOUSE - LIVING ROOM - NIGHT\n\nWe see the movie screen on a wall in Andy's living room.  \nMarian, Raquel and RENEE'S images are being projected on this \nscreen, simultaneously involved in pornographic acts with two \nmen. Watching this movie in Andy's living room are several \npeople in shadows behind the light of the projector.  Among \nthem we see RENEE and MR. EDDY/LAURENT standing next to ANDY.\nMr. Eddy/Laurent and Renee are hot - kissing - his hand is up \nunder her skirt.  They are watching the porno film.  They are \nwatching murky images of sex turning to violence.\n\nIn a CLOSE UP we see Renee and Mr. Eddy/Laurent in the \nshadows looking out at the film, both half-smiling, stoned, \naroused.\n\nThe image on the Watchman changes now.\n\nEXT. DESERT - DAYBREAK\n\nOn the Watchman TV screen Mr. Eddy/Laurent sees an image of \nFred and the Mystery Man staring at him.  The Mystery Man's \nimage speaks.\n\n\t\t\t\tMYSTERY MAN\n\t\t\t(on TV screen)\n\t\tNow you can hand it back to me.\n\nMr. Eddy/Laurent sees the Mystery Man's image reach out a \nhand.\n\nMr. Eddy/Laurent looks up.  The Mystery Man has his arm \noutstretched just as it was on the video image.  Mr. Eddy/ \nLaurent hands the Watchman back, and locks eyes with the \nMystery Man.\n\n\t\t\t\tMR. EDDY/LAURENT\n\t\t\t(wet and jagged)\n\t\tYou and me, mister, we can really out-\n\t\tugly the sumbitches, can't we?\n\nThe mystery Man unloads the pistol into Mr. Eddy/Laurent, who \njerks and dies in the dust.\n\nThe Mystery Man then leans close to Fred and whispers in his \near.\n\nThe camera moves in, past the Mystery Man to a CLOSE UP OF \nFRED'S EYES as he listens.\n\nThe camera cuts back wide to reveal Fred holding the gun.  He \nis standing alone - there is no Mystery Man.  Fred turns to \ngo back to the car.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. THE MADISON HOUSE - DRIVEWAY - EARLY MORNING\n\nFred drives up to his house in Mr. Eddy/Laurent's Mercedes \n600 Pullman and stops in front.  He gets out of the car, goes \nto the front door and RINGS THE DOORBELL.  There is a BEEP sound.\n\n\t\t\t\tFRED\n\t\t\t(into intercom)\n\t\tDick Laurent is dead.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. THE MADISON HOUSE - STREET - EARLY MORNING\n\nAs Fred finishes this sentence we see the cop car containing \nEd and Al pull in to the curb just up the street from Fred \nand Renee's house.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. THE MADISON HOUSE - DRIVEWAY - EARLY MORNING\n\nFred turns and sees the cop car.  He jumps in his car, fires \nit up, and peels out.  The cops give chase.\n\n\t\t\t\t\t\t\t\t      CUT TO:\n\nEXT. DESERT HIGHWAY - DAY\n\nFred is behind the wheel of his car.  Behind him are the \ncops.\n\nCLOSE UP ON FRED'S FACE - through the front windshield.  The \nshot is wide enough to reveal the cop car in hot pursuit.\n\nFred's face begins to change again, grotesquely contorting as \nhe races into the vortex.  His tormented SCREAM blends with \nthe howling SIREN of the police car gaining on him.\n\n\n\n\t\t\t\tTHE END\n\n\n\n\n\nLost Highway\nWriters :   David Lynch  Barry Gifford\nGenres :   Drama  Mystery  Thriller  Horror\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:30:14.424993"}