{"title": "Love and Basketball", "film_link": "/Movie Scripts/Love and Basketball Script.html", "script_link": "/scripts/Love-and-Basketball.html", "info_raw": "\n\nLove and Basketball Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.88 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gina Prince-Bythewood\nGenres  Drama  Romance\n\nRead \"Love and Basketball\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nLOVE AND BASKETBALL\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLOVE AND BASKETBALL\n\nBY\n\nGINA PRINCE-BYTHEWOOD\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tOPENING TITLES\n\n\tSLOW MOTION.  STYLIZED.  TIGHT.\n\n\tThe silhouette of a man and woman.  They are on a blacktop\n\tbasketball court, playing a sexually-charged game of one-one-\n\tone.\n\n\tSweat glistens.  Hands pull at clothes.  Hips bump and\n\tcollide.  Eyes lock...\n\n\t\t\t\t\t\t\t\tFADE TO:\n\n\tBLACK.\n\n\tFADE IN:\n\n\tTITLE CARD: \"FIRST QUARTER\" then \"1981\"\n\n\tBALDWIN HILLS\n\n\tEXT. MCCALL HOUSE - LATE MORNING\n\n\tAn upper middle-class neighborhood, known as the Black\n\tBeverly Hills.  Big houses, green grass and Caddies in every\n\tother driveway.  The street is quiet, until --\n\n\t\t\t\tYOUNG VOICE (O.S.)\n\t\tYou wanna be Kareem?\n\n\tCAMERA REVEALS: QUINCY MCCALL, eleven years old, dribbling a\n\tbasketball in front of KELVIN and JAMAL, also eleven.  He\n\tsports a fro, a \"Clippers\" jersey, and a serious swagger.\n\n\t\t\t\tQUINCY (CONT'D)\n\t\tAll his big butt do is stand by the\n\t\tbasket.\n\n\t\t\t\tJAMAL\n\t\tShoot, I'll be blocking your stuff.\n\n\t\t\t\tKELVIN\n\t\tI'm gonna be like Dr. J.\n\n\t\t\t\tQUINCY\n\t\tI'ma be like my Dad.\n\n\t\t\t\tJAMAL\n\t\tHe ain't a star or nothing.\n\n\t\t\t\tQUINCY\n\t\tI don't see none of your sorry daddies in\n\t\tthe NBA.\n\n\t\t\t\tKELVIN\n\t\tHey, look, Q.\n\n\tQuincy follows Kelvin's eyes, to a beat-up pair of Converse\n\tAll-Stars approaching from next door.  Walking in the kicks\n\tis a YOUNG KID in a T-shirt and Tuff-skins, and a LAKERS cap\n\tpulled low.  A moving van is parked in the driveway.\n\n\t\t\t\tKELVIN (cont'd)\n\t\tThought only girls were moving in.\n\n\t\t\t\tQUINCY\n\t\tThat's what my Moms said.\n\n\t\t\t\tKELVIN\n\t\tI hope he can ball.\n\n\t\t\t\tJAMAL\n\t\tBet he's a scrub.\n\n\tThe Kid stops at the edge of Quincy's driveway.\n\n\t\t\t\tKID\n\t\tHey.\n\n\t\t\t\tQUINCY\n\t\tHey.\n\n\t\t\t\tKID\n\t\tCan I play?\n\n\t\t\t\tQUINCY\n\t\tYou nice?\n\n\t\t\t\tKID\n\t\tYeah, I'm nice.\n\n\tQuincy looks the Kid up and down, then --\n\n\t\t\t\tQUINCY\n\t\tYou and Kelvin gainst me and Jamal.\n\n\tQuincy tosses the Kid the ball.  The Kid pulls off the\n\tbaseball cap.  Brown hair tumbles down, framing a soft brown\n\tface and bright eyes.  She is MONICA WRIGHT, eleven years\n\told.\n\n\t\t\t\tJAMAL\n\t\tAh man, he is a girl.\n\n\t\t\t\tQUINCY\n\t\tGirls can't play no ball.\n\n\t\t\t\tMONICA\n\t\tBall better than you.\n\n\tQuincy laughs derisively as Monica walks to the top of the\n\tdriveway.\n\n\t\t\t\tQUINCY\n\t\t\t(whispering)\n\t\tWhat a dog.\n\n\tMonica shoots him a glare.\n\n\t\t\t\tJAMAL\n\t\tShe heard you.\n\n\t\t\t\tQUINCY\n\t\tNuh uh, they could only hear dog\n\t\twhistles.\n\n\tMonica starts to dribble.  Jamal whistles as he walks\n\tbackwards, guarding her.  She throws up a shot.  IT'S AN\n\tAIRBALL.  Quincy and Jamal crack up.  Kelvin rolls his eyes.\n\n\tQuincy grabs the rebound and shoots.  Swish.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tOne, zip.\n\n\tHe rolls the ball to Monica.  She starts dribbling and again,\n\tJamal just backs up with her.  She passes to Kelvin.  Jamal\n\tand Quincy collapse on him, leaving Monica open under the\n\tbasket.  Trapped Kelvin has no choice but to pass it back.\n\n\tMonica catches the ball and throws up a shot.  It banks off\n\tthe backboard...AND DROPS THROUGH THE NET.  The boys look at\n\ther in shock.  Monica tosses the ball back to Quincy.\n\n\t\t\t\tMONICA\n\t\tOne, up.\n\n\t\t\t\tQUINCY\n\t\tLucky.\n\n\tQuincy easily dribbles by Kelvin and lays up the ball.  He\n\tthrows the ball back to Monica.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tTwo, one.\n\n\tMonica dribbles.  Jamal plays her a little tighter.  Monica\n\tbounces the ball through his open legs and lays up the ball.\n\n\t\t\t\tMONICA\n\t\tTwo, up.\n\n\tQuincy can't believe it.  Kelvin cracks up.\n\n\t\t\t\tKELVIN\n\t\tAaah, she dogged you.\n\n\t\t\t\tJAMAL\n\t\tShut up.\n\n\tThe game continues, with Quincy and Monica trading baskets\n\tfor their teams.  Quincy grows agitated with Jamal, who is\n\tunable to stop her.  The score hits nine, nine.\n\n\tQuincy stands at the top of the driveway, ball in hand.\n\n\t\t\t\tQUINCY\n\t\tPoint.\n\n\tQuincy dribbles through his legs, then pops an outside shot.\n\tThe ball bounces on the rim...and rolls off.\n\n\tQuincy curses as Monica grabs the rebound and clears the\n\tball.  Jamal moves to guard her, but Quincy shoves him off.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tI got her.\n\n\tQuincy defends.  Monica smiles back at him.\n\n\t\t\t\tMONICA\n\t\tTold you I was nice.  I'm going to be\n\t\tthe first girl in the NBA.\n\n\t\t\t\tQUINCY\n\t\tI'ma be in the NBA.  You're gonna be my\n\t\tcheerleader.\n\n\tMonica suddenly passes to Kelvin, sprints for the basket.\n\tQuincy stumbles, giving her a step.  Kelvin throws it back.\n\n\tQuincy knows he's beat as Monica goes for the winning lay-up.\n\tIn desperation, he swings at her for the hard foul, shoving\n\ther off balance.\n\n\tTHE BALL FLIES FROM HER HAND AS SHE CRASHES TO THE GROUND,\n\tFACE-FIRST.  SHE GRABS HER CHEEK.  BLOOD SLIPS THROUGH HER\n\tFINGERS.\n\n\tThe boys stand frozen.  Quincy stares down at her, his eyes\n\twide with fear...and regret.\n\n\tINT. WRIGHT HOUSE - BATHROOM - LATE MORNING\n\n\tMonica leans over the sink as her mother, CAMILLE, 36, wipes\n\tthe blood from her face with a washcloth.\n\n\t\t\t\tGIRL'S VOICE (O.S.)\n\t\tEeew.\n\n\tHer sister, LENA, 14, leans in the doorway, making a face.\n\tShe is a mirror of their mother, with relaxed hair and\n\tpainted nails.\n\n\tHer father, NATHAN, 39, moves behind Lena, holding a box.\n\n\t\t\t\tNATHAN\n\t\tHow are you feeling, munchkin?\n\n\tMonica nods.  He smiles.\n\n\t\t\t\tNATHAN (cont'd)\n\t\tYeah, you're through.\n\n\t\t\t\tCAMILLE\n\t\tShe needs to stop running around like a\n\t\tlittle boy.\n\n\t\t\t\tNATHAN\n\t\tShe's alright.\n\n\t\t\t\tCAMILLE\n\t\tHow is she alright looking the way she\n\t\tdoes?\n\n\t\t\t\tNATHAN\n\t\tCamille, she'll be fine.\n\n\tHe gives Monica a wink, crosses away.  Monica pulls the\n\twashcloth away from her Mom and starts wiping the blood\n\therself.\n\n\t\t\t\tCAMILLE\n\t\tI'll get some ice.\n\n\tShe exits.  Lena shakes her head, follows.\n\n\tMonica pulls the washcloth from her face and stares into the\n\tmirror.  TORN SKIN SURROUNDS A SMALL DEEP GASH IN HER CHEEK.\n\tSeeing her latest battle scar, there's only one thing left\n\tfor this little girl to do.  She smiles.\n\n\tINT. MCCALL HOUSE - KITCHEN - DAY\n\n\tQuincy sits at the kitchen table, writing \"I AM SORRY\" in\n\tblock letters across a homemade card.  His face is tight with\n\tconcentration as he tries to write in a straight line.\n\n\tAt the counter, his mom, NONA, moves a cake from its store\n\tbox to a cake dish.  She is 30, beautiful, with effort.  She\n\tsmooths the frosting with a spoon.\n\n\tZEKE, 32, with the height and ego of an NBA ballplayer,\n\tenters.  He laughs.\n\n\t\t\t\tZEKE\n\t\tGirl, who you trying to fool?\n\n\tQuincy looks up, smiles.  He quickly grabs a piece of\n\tcrumpled paper, and tosses it to Zeke.\n\n\t\t\t\tQUINCY\n\t\tAlley-oop, Dad.\n\n\tNona intercepts his pass.\n\n\t\t\t\tNONA\n\t\tBoy...\n\n\tShe points him back to his card.  Quincy scowls, starts\n\twriting again.  Nona scoops some frosting on her finger,\n\tholds it up.\n\n\t\t\t\tNONA (cont'd)\n\t\tNew neighbors.\n\n\tZeke wraps his lips around her finger, sucks the frosting\n\toff.\n\n\t\t\t\tZEKE\n\t\tSee, Quincy, this is how your Moms caught\n\t\tme, with the old fake and bake.  Had me\n\t\tthinking I was getting a sister who could\n\t\tburn.\n\n\tNona laughs, pulls him down for a kiss.  Quincy suddenly\n\tthrows down his pencil in frustration.\n\n\t\t\t\tQUINCY\n\t\tI can't do this shit.\n\n\tZeke and Nona pull away, stare at Quincy in shock.\n\n\t\t\t\tZEKE\n\t\tBoy, what'd I tell you about using that\n\t\tword?\n\n\t\t\t\tQUINCY\n\t\t\t(sighs, then)\n\t\t\"Can't\" should never be in a man's\n\t\tvocabulary.\n\n\t\t\t\tZEKE\n\t\tWhy not?\n\n\t\t\t\tQUINCY\n\t\tCause when you say can't, you ain't a\n\t\tman.\n\n\t\t\t\tZEKE\n\t\tThat's right.\n\n\t\t\t\tNONA\n\t\tZeke.\n\n\t\t\t\tZEKE\n\t\tWhat?\n\t\t\t(then)\n\t\tOh, and, uh, don't say \"shit.\"\n\n\tNona just shakes her head.\n\n\t\t\t\tNONA\n\t\tWe should head over.\n\n\t\t\t\tZEKE\n\t\tJust you and Quincy, baby.  I got a\n\t\tmeeting.\n\n\t\t\t\tNONA\n\t\tWith who?\n\n\t\t\t\tZEKE\n\t\tBusiness folks.\n\n\t\t\t\tNONA\n\t\tYou just got back from a four game road\n\t\ttrip.\n\n\t\t\t\tZEKE\n\t\tNona, don't start bitching.  I got maybe\n\t\ttwo years left to play.  I'm just trying\n\t\tto put some things together for us.\n\n\tZeke grabs his keys.\n\n\t\t\t\tZEKE (cont'd)\n\t\tLater, Quincy.\n\n\t\t\t\tQUINCY\n\t\tLater, Dad.\n\n\tZeke exits.  Nona leans against the counter, concerned.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tMom?\n\n\t\t\t\tNONA\n\t\tWhat?\n\n\t\t\t\tQUINCY\n\t\tWe still have to go?\n\n\t\t\t\tNONA\n\t\t\t(beat)\n\t\tYeah.\n\n\t  INT. WRIGHT HOUSE - LIVING ROOM - DAY\n\n\n\n\tCamille and Nona stand among the piles of boxes.  Monica and\n\tQuincy stand at their mothers' sides, stealing glances at\n\teach other.  A large bandage covers Monica's cheek.  Monica\n\tholds her card, Camille holds the cake.\n\n\t\t\t\tNONA\n\t\t...we moved back here when Quincy was\n\t\tabout five, after Zeke was traded.\n\t\tNeighborhood was a little more mixed\n\t\tback then...\n\n\t\t\t\tCAMILLE\n\t\tUntil the Black family down the street\n\t\tbecame the Black family next door.\n\n\t\t\t\tNONA\n\t\t\t(nods)\n\t\tOkay?\n\n\tCamille tries to smooth down Monica's unruly hair.  Monica\n\tmoves her head.\n\n\t\t\t\tCAMILLE\n\t\tWell, thanks again.  This was really nice\n\t\tof you.\n\n\t\t\t\tNONA\n\t\tIt was the least we could do.  And I love\n\t\tto cook.\n\n\tQuincy looks up at his Mom, surprised.  She quickly hugs his\n\tface into her stomach.  Camille lights up.\n\n\t\t\t\tCAMILLE\n\t\tOh, me too.  I used to cook for my\n\t\tfriends' parties and things back in\n\t\tAtlanta.\n\n\t\t\t\tNONA\n\t\tYou're a caterer?\n\n\t\t\t\tCAMILLE\n\t\tWell, no, but once Nathan gets settled\n\t\tand the girls get a little older, it's\n\t\tdefinitely something I want to do.\n\t\t\t(then)\n\t\tSince you love to cook, maybe it's\n\t\tsomething we can talk about.\n\n\tQuincy snickers.  Nona quickly changes the subject.\n\n\t\t\t\tNONA\n\t\tYou know, girl, long as I've lived next\n\t\tdoor, I've never seen the inside of this\n\t\thouse.\n\n\t\t\t\tCAMILLE\n\t\tReally?  Well, come on, then.\n\n\tCamille hands Monica the cake.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tHoney, put this in the kitchen.\n\n\t\t\t\tNONA\n\t\tHelp her, Quincy.\n\n\tCamille and Nona head down the hall, leaving Monica and\n\tQuincy alone.  The two just stand there.\n\n\tQuincy reaches out, scoops a finger of frosting, and pops it\n\tin his mouth.  Beat, then Monica takes a bigger scoop.\n\n\t\t\t\tQUINCY\n\t\tSo...does it hurt?\n\n\t\t\t\tMONICA\n\t\tIt's this big hole.  You could almost see\n\t\tbone.\n\n\t\t\t\tQUINCY\n\t\tFor real?\n\n\t\t\t\tMONICA\n\t\tUh huh.\n\n\tQuincy is impressed.\n\n\t\t\t\tQUINCY\n\t\tSo how come you could play basketball?\n\n\t\t\t\tMONICA\n\t\tI just can.\n\n\t\t\t\tQUINCY\n\t\tI never knew a girl that could play.\n\n\t\t\t\tMONICA\n\t\tMy Mom says she doesn't know where I come\n\t\tfrom 'cause I act different.\n\n\t\t\t\tQUINCY\n\t\tYour Dad play?\n\n\t\t\t\tMONICA\n\t\tHe works at a bank.\n\n\t\t\t\tQUINCY\n\t\tMy Dad plays for the \"Clippers.\"  He says\n\t\tI'ma be a doctor or a lawyer, but I'ma\n\t\tplay for them, too.  Same number and\n\t\teverything.\n\n\t\t\t\tMONICA\n\t\tI'm going to be number thirty-two, like\n\t\tMagic.\n\n\t\t\t\tQUINCY\n\t\tHe's alright, but my Dad can take him.\n\n\t\t\t\tMONICA\n\t\tWhat was the most points your Daddy ever\n\t\tgot in Junior High?\n\n\t\t\t\tQUINCY\n\t\tI don't know.  A lot.\n\n\t\t\t\tMONICA\n\t\tOne time Magic scored forty-eight points,\n\t\tand they only had six minute quarters and\n\t\the sat out the whole fourth.\n\n\t\t\t\tQUINCY\n\t\tYou do act different.\n\n\t\t\t\tMONICA\n\t\tI don't care.\n\n\t\t\t\tQUINCY\n\t\tWell, if anybody bothers you, you could\n\t\tjust tell me cause I run this street.\n\n\t\t\t\tMONICA\n\t\tI'd just tell my sister, Lena.\n\n\t\t\t\tQUINCY\n\t\tShe don't know how to box, I bet.  My dad\n\t\tshowed me how to fight like Ali.\n\n\tHe shows off a flurry of punches.\n\n\t\t\t\tMONICA\n\t\tSo, I know karate from \"Almighty Isis.\"\n\n\tMonica puts the cake down on a box, does a couple of kicks\n\tand hand movements.  Quincy is impressed.\n\n\t\t\t\tQUINCY\n\t\tBet you can't do this though.\n\n\tQuincy does a jump kick.  Monica does the same.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tOkay, how bout this?\n\n\tQuincy takes a couple steps back, then does a cartwheel.  It\n\tlooks great, until he crashes into the box with the cake.\n\tThe cake falls onto his head and shoulder.\n\n\tMonica doubles over, laughing.  Quincy is embarrassed.\n\tCamille and Nona rush back into the living room.\n\n\t\t\t\tCAMILLE\n\t\tMonica, what did you do?\n\n\t\t\t\tMONICA\n\t\tNothing.\n\n\t\t\t\tCAMILLE\n\t\t\t(to Nona)\n\t\tOh, all that work.\n\n\t\t\t\tNONA\n\t\tIt's...it's okay.  Can I get a towel?\n\n\tCamille quickly crosses into the kitchen.  Quincy stares at\n\tthe floor.\n\n\t\t\t\tQUINCY\n\t\tSorry.\n\n\tNona bends down, whispers in his ear.\n\n\t\t\t\tNONA\n\t\tNo.  Good boy.\n\n\tINT. WRIGHT HOUSE - MONICA'S ROOM - NIGHT\n\n\tMonica sits between Lena's legs, grimacing, as Lena works a\n\tcomb through her freshly washed, kinky hair.  Monica's head\n\tflops like a rag doll.  Her eyes are wet.\n\n\t\t\t\tMONICA\n\t\tOw!\n\n\tLena keeps tugging.\n\n\t\t\t\tMONICA (cont'd)\n\t\tOw, Lena!!!\n\n\tMonica punches her in the leg.\n\n\t\t\t\tLENA\n\t\tOw!\n\n\tLena yanks Monica's head back as Camille enters, carrying a\n\tyellow dress on a hanger.  Monica sees it and her face falls.\n\n\t\t\t\tMONICA\n\t\tAh, Mom.\n\n\t\t\t\tCAMILLE\n\t\tI'm lucky I found it.  Someone put your\n\t\tbox of dresses under a pile of rags in\n\t\tthe garbage.\n\n\tMonica sulks.  Lena cackles in her ear.  Camille has to\n\tlaugh.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tChild, pick up your lip.\n\n\t\t\t\tMONICA\n\t\tI hate it.\n\n\t\t\t\tCAMILLE\n\t\tFine, you don't like this one, which one\n\t\twould you rather wear?\n\n\t\t\t\tMONICA\n\t\tPants.\n\n\tCamille rubs her temples, then hangs the dress on the door.\n\n\t\t\t\tCAMILLE\n\t\t\t(to Lena)\n\t\tWhen you're done can you make sure she\n\t\tbrushes her teeth?\n\n\t\t\t\tLENA\n\t\tAre you okay?\n\n\t\t\t\tCAMILLE\n\t\tI just need to lay down.  I've been\n\t\trunning around all day.\n\n\tJust then, Nathan enters.  He holds up two dress shirts as if\n\tit were a matter of life and death.\n\n\t\t\t\tNATHAN\n\t\tWhich one for tomorrow?\n\n\t\t\t\tCAMILLE\n\t\tThe blue.\n\n\t\t\t\tNATHAN\n\t\tYou sure?\n\n\tCamille nods.  Nathan looks at both of them, then:\n\n\t\t\t\tNATHAN (cont'd)\n\t\tCan you iron both tonight just in case?\n\n\t\t\t\tCAMILLE\n\t\t\t(beat)\n\t\tOkay.\n\n\t\t\t\tNATHAN\n\t\tThanks, sweetheart.\n\n\tHe kisses her on the cheek, hands her the two shirts and\n\tcrosses out.  Monica just watches.  Beat, then Camile turns\n\tback to her daughters.\n\n\t\t\t\tCAMILLE\n\t\tThe boy next door is riding with you to\n\t\tschool so you'll know somebody your first\n\t\tday.\n\t\t\t(to Lena)\n\t\tHurry so she can go to sleep.\n\n\tMonica reacts, surprised.  Camille leaves.  Lena puts the\n\tcomb back to Monica's hair.  Beat, then:\n\n\t\t\t\tMONICA\n\t\tMake it look nice, kay.\n\n\tINT. MCCALL HOUSE - QUINCY'S ROOM - NIGHT\n\n\tBasketball posters, \"Clippers\" and USC memorabilia, a\n\tbasketball globe light.\n\n\tQuincy lays tucked in bed, eyes wide open, listening to his\n\tparents MAKING LOVE.  The sounds bring a smile to his face.\n\n\tQuincy climbs out of bed, wearing underwear.  He moves to his\n\twindow, sees Monica through her window directly across from\n\this.  Her eyes are closed as Lena braids her hair.  Quincy\n\tkneels down, rests his arms on the window sill, and watches.\n\t\n\t\n\t  EXT. MCCALL AND WRIGHT HOUSES - MORNING\n\n\n\n\tQuincy sits atop his BMX bike in front of Monica's house.  A\n\tbasketball is tucked under his arm.\n\n\tMonica emerges, walking her banana-seater.  She is looking\n\tcute in her yellow dress and braids tied with ribbons.  A\n\tbasketball sits in her back basket.\n\n\tQuincy is taken aback, stares at her.\n\n\t\t\t\tQUINCY\n\t\tYou wanna be my girl?\n\n\tMonica blinks in surprise.  She thinks for a moment.\n\n\t\t\t\tMONICA\n\t\tWhat do I have to do?\n\n\t\t\t\tQUINCY\n\t\tI guess, you know, we play ball and we\n\t\tride to school together.  And if you get\n\t\tmad at me, I gotta give you flowers.\n\n\t\t\t\tMONICA\n\t\tI don't like flowers.\n\n\t\t\t\tQUINCY\n\t\tOh.\n\n\t\t\t\tMONICA\n\t\tHow bout Twinkies?  My mom won't ever\n\t\tbuy them.\n\n\t\t\t\tQUINCY\n\t\tKay.\n\n\t\t\t\tMONICA\n\t\tOkay.\n\n\tAn awkward beat between the new couple.  Finally --\n\n\t\t\t\tQUINCY\n\t\tI think we gotta kiss now.\n\n\t\t\t\tMONICA\n\t\tFor how long?\n\n\t\t\t\tQUINCY\n\t\tFive seconds.\n\n\tThe two glance around, then climb off their bikes and walk to\n\tthe secluded area between their two houses.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tReady?\n\n\tMonica nods.  They lean in, eyes wide open, and touch lips.\n\tQuincy counts to five with his fingers.  They pull away,\n\tembarrassed, and walk back to the driveway.\n\n\tMonica lifts her bike from the ground and climbs on.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tWait.  Cause you're my girl now you\n\t\tgotta ride my bike.\n\n\t\t\t\tMONICA\n\t\tI want to ride my own bike.\n\n\t\t\t\tQUINCY\n\t\tMy Dad always drives my Mom.\n\n\t\t\t\tMONICA\n\t\tSo?\n\n\t\t\t\tQUINCY\n\t\t\t(impatient)\n\t\tSo that means I have to ride with you.\n\n\tMonica doesn't move.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tCome on.\n\n\t\t\t\tMONICA\n\t\tI don't have to do what you say.\n\n\t\t\t\tQUINCY\n\t\tMan, forget you then, stupid.\n\n\t\t\t\tMONICA\n\t\tYou're stupid.  And your Daddy plays for\n\t\tthe worst team in the NBA.\n\n\tQuincy's face instantly clouds.\n\n\t\t\t\tQUINCY\n\t\tWhat?\n\n\t\t\t\tMONICA\n\t\t\t(laughs)\n\t\tLast time they won, Dr. J. was a nurse.\n\n\t\t\t\tQUINCY\n\t\tShut up!\n\n\tHe shoves her, knocking her off her bike.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tI don't wanna be your boyfriend, you ugly\n\t\tdog!\n\n\tMonica leaps up, her dress now dirty.  She shoves him back.\n\n\t\t\t\tMONICA\n\t\tI don't want to be your girlfriend, big\n\t\thead!\n\n\tThey grapple, then fall to the ground swinging...\n\n\t\t\t\t\t\t\t\tFADE TO:\n\n\tBLACK.\n\n\tFOOTAGE.  Men's NCAA Finals.  Michigan State against Indiana\n\tState.  Magic Johnson against Larry Bird.  Magic drives on\n\tBird, hits a beautiful scoop shot.  He celebrates as he jogs\n\tback down court...\n\t\n\t  FADE IN:\n\n\n\n\tTITLE CARD: \"SECOND QUARTER\" then \"1988\"\n\n\n\n\tINT. CRENSHAW HIGH SCHOOL GYM - DAY\n\n\n\n\tA snarling Black cougar glares down from a large mural.  On\n\n\tthe court below, a girl's basketball play-off game.\n\n\tThe bleachers are almost half-full with a hyped crowd.  In\n\tthe crowd are Monica's parents.  Her father is excited and\n\tvocal.  Her mom reads a book.  Also in the stands, the HEAD\n\tCOACH OF THE TENNESSEE LADY VOLS, PAT SUMMIT.\n\n\tA fine-ass BROTHER leans in the doorway, sporting a letter\n\tjacket with an embroidered \"Q\" on the chest.  He gets as much\n\tattention as the game.  A couple of JUNIOR VARSITY\n\tCHEERLEADERS smile his way.\n\n\t\t\t\tCHEERLEADERS\n\t\t\"U\", \"G\", \"L\", \"Y\", you ain't got no\n\t\talibi, you ugly, yeah, yeah, you ugly.\n\t\t\"M\", \"A\", \"M\", \"A\", how you think you got\n\t\tthat way, your Mama, yeah, yeah, your\n\t\tMama.\n\n\tOn the floor, MONICA, dribbles down court.  Just EIGHTEEN,\n\ther athletic figure has a few curves, but her loose jersey\n\tdoes little to show it off.  Her hair is a mess and her knees\n\tare dark with bruises.  A small scar is visible on her cheek.\n\n\tShe whips a no-look, around the back pass to a cutting\n\tTEAMMATE under the basket, who scores.  The crowd cheers.\n\n\tMonica defends the opposing point guard like a gnat.  She\n\tknocks the ball loose and grabs it up.  She goes for a lay-up\n\tand the opposing guard steps in front of her.  Monica crashes\n\tinto her, knocking both to the floor.\n\n\tA WHISTLE.\n\n\t\t\t\tREFEREE\n\t\tNo basket!  Offensive foul, number thirty-\n\t\ttwo.\n\n\tMonica leaps up.\n\n\t\t\t\tMONICA\n\t\tWhat?  She wasn't set!\n\n\tThe referee ignores her.\n\n\t\t\t\tMONICA (cont'd)\n\t\tShe was still moving!\n\n\tFrom the sideline, COACH HISERMAN waves frantically.\n\n\t\t\t\tCOACH HISERMAN\n\t\tMonica!  Let it go!\n\n\tMonica stares down the ref as she jogs back on defense.\n\n\tThe opposing guard drives the lane and puts up a shot.\n\tMonica leaps and blocks it with a taunting scream.  A\n\tWHISTLE.\n\n\t\t\t\tREFEREE\n\t\tTechnical foul!  Number thirty-two.\n\n\tCoach Hiserman slams down his clipboard.  Monica charges the\n\treferee.  A teammate grabs at her but she pushes her off.\n\n\t\t\t\tMONICA\n\t\tFor what?\n\n\t\t\t\tREFEREE\n\t\tTaunting.\n\n\t\t\t\tMONICA\n\t\tTaunting?!\n\n\t\t\t\tCOACH HISERMAN\n\t\tSub!\n\n\t\t\t\tMONICA\n\t\tMan, you suck!\n\n\tThe referee whips back around, whistle in mouth.  Coach\n\tHiserman grabs her arm and pulls her off the court.\n\n\t\t\t\tCOACH HISERMAN\n\t\tSit down and shut up.\n\n\tMonica slams down in a chair, sweat pouring, hands clenched.\n\tHer mom watches from the stands, completely embarrassed.  The\n\tbrother in the doorway turns, leaves.\n\n\tMonica looks up at the clock.  SIX MINUTES LEFT IN THE THIRD\n\tQUARTER.\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\n\tINT. CRENSHAW HIGH SCHOOL GYM - LATE DAY\n\n\tMonica, still benched, sits slumped in her chair, her sweats\n\ton, her face dry.  She glances up at the clock.  TWENTY\n\tSECONDS LEFT IN THE FOURTH QUARTER.  Her team's up by SIX.\n\n\tHer teammates dribble out the clock.  The BUZZER SOUNDS and\n\tthey dance across the floor.  Monica looks up in the stands.\n\tCOACH SUMMIT IS GONE.\n\n\tINT. WRIGHT HOUSE - KITCHEN - DUSK\n\n\tCamille, now forty-three, stands at the stove stirring a pot\n\tof gumbo.  Lena, 21, and pretty, stands next to her, holding\n\ta handful of plates and silverware.\n\n\t\t\t\tCAMILLE\n\t\t...and if you want a thicker base, you\n\t\tcan cut in a potato or just use a little\n\t\tflour.\n\n\t\t\t\tLENA\n\t\tBut you use potato?\n\n\tCamille nods as they cross into:\n\n\tINT. DINING ROOM - CONTINUOUS\n\n\tAt the table, Monica is in mid-conversation with her dad.\n\tCamille and Lena start setting the table.\n\n\t\t\t\tMONICA\n\t\tDad, you have to talk to Coach for me.\n\n\t\t\t\tNATHAN\n\t\tAnd what am I supposed to say to the man?\n\n\t\t\t\tMONICA\n\t\tThe coach from Tennessee was there and he\n\t\thas me riding the bench.\n\n\t\t\t\tNATHAN\n\t\tYou lost your head.\n\n\t\t\t\tMONICA\n\t\tI was just showing emotion.\n\n\t\t\t\tCAMILLE\n\t\tSo that means it's alright for you to act\n\t\tlike that?\n\n\t\t\t\tLENA\n\t\t\t(to Monica)\n\t\tWhat'd you do?\n\n\t\t\t\tMONICA\n\t\t\t(dismissive)\n\t\tnothing.\n\n\t\t\t\tCAMILLE\n\t\tI don't know why I keep hoping you'll\n\t\tgrow out of this tomboy thing.\n\n\t\t\t\tMONICA\n\t\tI won't.  I'm a lesbian.\n\n\tLena chokes on her drink, cracks up.\n\n\t\t\t\tCAMILLE\n\t\tThat's not funny\n\n\t\t\t\tMONICA\n\t\tWell, that's what you think, isn't it?\n\t\tCause I'd rather wear a jersey than an\n\t\tapron...\n\n\t\t\t\tCAMILLE\n\t\tWatch your mouth.\n\n\tNathan quickly jumps in, tries to clean things up.\n\n\t\t\t\tNATHAN\n\t\tMonica, I think her point is...maybe it's\n\t\ttime to start thinking about other things\n\t\tbesides basketball.\n\n\t\t\t\tMONICA\n\t\t\t(taken aback)\n\t\tWhat?\n\n\t\t\t\tNATHAN\n\t\tYou only have one game left and you\n\t\thaven't been recruited.  Munchkin, I\n\t\twanted it as bad as you did, but we have\n\t\tto face reality.\n\n\t\t\t\tMONICA\n\t\tThe coach from USC is going to be at the\n\t\tchampionship.\n\n\t\t\t\tNATHAN\n\t\tI know.  But chances are...\n\n\t\t\t\tMONICA\n\t\tChances are there's still a chance.\n\n\tNathan nods.  She can always soften her dad, but not her mom.\n\n\t\t\t\tCAMILLE\n\t\tIf you'd just listen for once, you'd\n\t\trealize you have a lot more going for\n\t\tyourself.  You're smart, you'd be pretty\n\t\tif you put a comb to your head.  I mean,\n\t\twhy walk around with your hair looking\n\t\tlike \"whodunit\"...?\n\n\tAs her mom nags on, Monica looks out the window.\n\n\tOUTSIDE, QUINCY and a GIRL lean against a car parked at the\n\tcurb, slobbing each other down.\n\n\tJust shy of 18, with a magnetic face and muscular body, he is\n\ta brother who drank his chocolate milk.  HE IS ALSO THE\n\tBROTHER WHO WAS WATCHING MONICA'S GAME FROM THE GYM DOORWAY.\n\n\tMonica watches and her mom's droning voice disappears...\n\n\tEXT. MCCALL HOUSE - SAME TIME\n\n\tFELICIA, 17, can't get enough of Quincy's lips.\n\n\t\t\t\tQUINCY\n\t\tYo, Felicia, I gotta get to my game.\n\n\tShe keeps kissing him.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tAnd my mom's about to be home.\n\n\t\t\t\tFELICIA\n\t\tSo I'm not good enough to meet your mom?\n\n\t\t\t\tQUINCY\n\t\tGirl, she knew I had a hottie like you\n\t\tup inhere, she'd beat the black off me.\n\n\t\t\t\tFELICIA\n\t\t\t(kissing him again)\n\t\tThat's a lot of beating.\n\n\tShe finally lets go, and slides into her car.  Quincy watches\n\ther go with a cocky-ass smile.\n\t\n\n\t  INT. CRENSHAW HIGH SCHOOL GYM - NIGHT\n\n\n\n\tA frenzied crowd from floor to ceiling watches Quincy explode\n\n\tacross the court.  He is the complete point guard - hitting\n\tfrom the outside, driving to the hoop, no-look passes,\n\tplaying tight D.'\n\n\tHis father, Zeke, now 39, stands on the sideline.  His muscle\n\thas softened a little over the last five years of retirement.\n\n\tMonica sits alone in the bottom row, holding a basketball.\n\tShe wears jeans and a T-shirt and her hair is pulled back in\n\ta simple pony-tail.\n\n\tQuincy does a killer cross-over move and his Defender falls\n\tdown.  He lays up the ball, then taunts the player he just\n\tposter-ized.  Behind Monica, TWO GIRLS smack each other\n\texcitedly.  One of them, SHAWNEE, 17, pretty, big chest,\n\tslides down into the empty seat next to her.\n\n\t\t\t\tSHAWNEE\n\t\tHey, girl.\n\n\t\t\t\tMONICA\n\t\tHey.\n\n\t\t\t\tSHAWNEE\n\t\tYour hair looks so cute like that.\n\n\tMonica knows she's full of shit, doesn't respond.\n\n\t\t\t\tSHAWNEE (cont'd)\n\t\tSo...you know who Q's asking to the\n\t\tSpring Dance?\n\n\t\t\t\tMONICA\n\t\tNo.\n\n\t\t\t\tSHAWNEE\n\t\tC'mon, girl, you live next door.  Who's\n\t\tbeen creeping?\n\n\t\t\t\tMONICA\n\t\tThere's so many I just can't keep track.\n\n\t\t\t\tSHAWNEE\n\t\tWell, can you give him this for me?\n\n\tShawnee holds out a folded note.  Monica doesn't take it.\n\n\t\t\t\tMONICA\n\t\tGive it yourself.\n\n\t\t\t\tSHAWNEE\n\t\tI don't wanna look fast.\n\t\t\t(drops it in Monica's lap)\n\t\tThanks, girl.\n\n\tShe slides back to her seat.  Monica shakes her head, turns\n\tback to the game.\n\n\tQuincy dives for a loose ball.  Shawnee clutches her friend.\n\n\t\t\t\tSHAWNEE (cont'd)\n\t\tGood Lord, look at that ass.  I just want\n\t\tto lick the sweat off it.\n\n\tMonica takes in his tight body.  He does look good.  Quincy\n\tjogs back down court and flashbulbs go off...\n\n\t\t\t\t\t\t\t\t  MATCH CUT TO:\n\n\tINT. CRENSHAW HIGH SCHOOL GYM - NIGHT\n\n\tFlashbulbs.  Quincy stands with his dad, his sweat still\n\tfresh, talking to a reporter named JIM.\n\n\t\t\t\tJIM\n\t\tQuincy, word has it you might make the\n\t\tjump the NBA.\n\n\t\t\t\tZEKE\n\t\tDon't go starting rumors, Jim.  My son's\n\t\tcollege bound with or without basketball.\n\n\t\t\t\tJIM\n\t\tYou could make a career by telling me\n\t\twhere.\n\n\t\t\t\tZEKE\n\t\tGotta wait til the press conference.\n\n\t\t\t\tJIM\n\t\tBut you'd love for him to play at USC,\n\t\tlike you did.\n\n\t\t\t\tZEKE\n\t\tI'd love for him to get a good education.\n\t\t\t(then)\n\t\tThat's it.\n\n\tJim crosses away.  Zeke puts an affectionate arm around his\n\tson as they walk toward the locker room.\n\n\t\t\t\tZEKE (cont'd)\n\t\tWe should have another talk with Coach\n\t\tCarril at Princeton.\n\n\t\t\t\tQUINCY\n\t\tPop, there's no way an Ivy League Team is\n\t\tgoing all the way.\n\n\t\t\t\tZEKE\n\t\tI don't care about the team.  I care\n\t\tabout the school.\n\n\t\t\t\tQUINCY\n\t\tDidn't we already have this conversation?\n\n\tZeke sighs, then:\n\n\t\t\t\tZEKE\n\t\tYou played good.  I was proud of you.\n\n\tQuincy smiles wide.\n\n\t\t\t\tQUINCY\n\t\tYeah?\n\t\t\t(then)\n\t\tSo you up for a game later?\n\n\t\t\t\tZEKE\n\t\tI don't wanna hurt your feelings.\n\n\t\t\t\tQUINCY\n\t\tYou don't wanna hurt your back.\n\n\t\t\t\tZEKE\n\t\t\t(smiles)\n\t\tAnyway, I gotta get to this meeting.\n\t\tTell your Mom I'm gonna be late.\n\n\t\t\t\tQUINCY\n\t\tYou work too hard, Pop.\n\n\t\t\t\tZEKE\n\t\tLet's hope I can say the same about you\n\t\tone day.\n\n\tQuincy watches his dad move toward the doors, stopping once\n\tto give an autograph.  Zeke passes Monica, entering.\n\n\t\t\t\tMONICA\n\t\tHey, Mr. M.\n\n\t\t\t\tZEKE\n\t\tHey, Miss Baller.\n\n\tHe exits.  Monica approaches Quincy.\n\n\t\t\t\tMONICA\n\t\tWay to hoop.\n\n\t\t\t\tQUINCY\n\t\tI know this.  What do you want?\n\n\t\t\t\tMONICA\n\t\tA ride home.\n\n\t\t\t\tQUINCY\n\t\tYour legs don't look broke.\n\n\t\t\t\tMONICA\n\t\tLook, big head, I'll be at your car.\n\n\t\t\t\tQUINCY\n\t\tGuess \"please\" would be a stretch.\n\n\t\t\t\tMONICA\n\t\t\t(dryly)\n\t\tPlease.\n\n\t  INT. QUINCY'S JEEP - NIGHT\n\n\n\n\tSilence as Quincy wheels his Jeep Wrangler toward home.\n\tMonica sits in the passenger seat, basketball in lap.  She\n\tpulls Shawnee's note from her pocket.  Quincy glances it\n\tover.\n\n\n\t\t\t\tQUINCY\n\t\tWhat's that?\n\n\t\t\t\tMONICA\n\t\tSome note Shawnee Easton told me to give\n\t\tto you.\n\n\t\t\t\tQUINCY\n\t\t\t(thinks)\n\t\tBig-ass titties?\n\n\tMonica shoots him a disgusted look.  Quincy reaches out.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tGive it here.\n\n\tMonica leans away, reads aloud.\n\n\t\t\t\tMONICA\n\t\t\"Q.  I think you are so fine and I've\n\t\tbeen wanting to get with you.  Let me\n\t\ttake you to the Spring Dance and I\n\t\tpromise I'll leave you satisfied.\"\n\n\tMonica laughs in disbelief.\n\n\t\t\t\tMONICA (cont'd)\n\t\tWhat a ho.\n\n\t\t\t\tQUINCY\n\t\tWhy she gotta be a ho, just cause she\n\t\twants to get with me.\n\n\t\t\t\tMONICA\n\t\tShe's a ho cause she's sending her\n\t\tcoochie through the mail.\n\n\t\t\t\tQUINCY\n\t\tAnd?\n\n\t\t\t\tMONICA\n\t\tAnd?  She's not saying, \"I think you're a\n\t\tnice guy and I wanna get to know you\n\t\tbetter,\" she's saying, \"I wanna bone.\"\n\n\t\t\t\tQUINCY\n\t\tSo she's honest.\n\n\t\t\t\tMONICA\n\t\tYeah, an honest tramp-ass ho.  But I\n\t\tguess you'll stick your dick in anything.\n\n\t\t\t\tQUINCY\n\t\tDidn't know you cared so much.\n\n\t\t\t\tMONICA\n\t\tI don't.\n\n\t\t\t\tQUINCY\n\t\tSo who you going to the dance with,\n\t\tSpalding?\n\n\t\t\t\tMONICA\n\t\tWho's Spalding?\n\n\tQuincy looks down at the SPALDING BASKETBALL in her lap and\n\tcracks up.  Monica glares.\n\n\t\t\t\tMONICA (cont'd)\n\t\tFuck you, Quincy.\n\n\t\t\t\tQUINCY\n\t\tSee, that's why you ain't getting\n\t\trecruited.\n\n\t\t\t\tMONICA\n\t\tWho said I'm not getting recruited?\n\n\t\t\t\tQUINCY\n\t\tYour hot-ass temper.\n\n\tMonica points to the scar on her cheek.\n\n\t\t\t\tMONICA\n\t\tI'm not the one who put this scar here.\n\n\t\t\t\tQUINCY\n\t\tGod, here we go.\n\n\t\t\t\tMONICA\n\t\tWhen we were eleven years old cause he\n\t\twas about to lose.\n\n\tQuincy turns, faces her.\n\n\t\t\t\tQUINCY\n\t\tThat's it, give it your best shot.\n\n\t\t\t\tMONICA\n\t\tWould you watch the damn road?\n\n\t\t\t\tQUINCY\n\t\tI mean it, give it your best shot, cause\n\t\tI'm tired of you holding that over my\n\t\thead.\n\n\t\t\t\tMONICA\n\t\tI'm warning you, don't tempt me.\n\n\t\t\t\tQUINCY\n\t\tI'm warning you.  You don't stall that\n\t\tbad attitude, no one's gonna recruit you.\n\n\tQuincy pulls his Jeep into his driveway.\n\n\t\t\t\tMONICA\n\t\tPlease, you jump in some guy's face, talk\n\t\tsmack and you get a pat on your ass.  But\n\t\tbecause I'm a female, I get told to calm\n\t\tdown and act like a \"lady\".  I'm a\n\t\tballplayer, okay.  A ball player.\n\n\t\t\t\tQUINCY\n\t\tWith a jacked-up attitude.\n\n\t\t\t\tMONICA\n\t\tDidn't know you cared so much.\n\n\t\t\t\tQUINCY\n\t\tI don't.\n\n\t\t\t\tMONICA\n\t\tGood.\n\n\tMonica slams out of the Jeep and walks across the lawn to her\n\thouse.  Quincy exits his ride.\n\t\n\t  INT. MCCALL HOUSE - ENTRY WAY - SHORT TIME LATER\n\n\n\n\tQuincy steps inside, drops his bag on the floor.  His mom,\n\tNona, approaches from the dining room.\n\n\t\t\t\tQUINCY\n\t\tWhat's up, Moms.\n\n\tNona holds up a large hoop earring.\n\n\t\t\t\tNONA\n\t\tWhat is this?\n\n\t\t\t\tQUINCY\n\t\tUh, your earring?\n\n\t\t\t\tNONA\n\t\tI look like some hoochie to you?  I\n\t\tfound it on your floor.\n\n\t\t\t\tQUINCY\n\t\tWhat are you doing in my room?\n\n\tQuincy crosses into:\n\n\tINT. KITCHEN - CONTINUOUS\n\n\tNona follows.  Quincy pulls open the fridge, grabs a couple\n\tof slices of cold pizza.\n\n\t\t\t\tNONA\n\t\tQuincy, I told you about these fat-ass\n\t\tgirls.\n\n\t\t\t\tQUINCY\n\t\tWe were just studying.\n\n\t\t\t\tNONA\n\t\tI'm not playing with you, these girls are\n\t\tlooking to get you caught.  They see you,\n\t\tthey see dollar signs.\n\n\t\t\t\tQUINCY\n\t\tOkay.\n\n\t\t\t\tNONA\n\t\tYou hearing me?\n\n\t\t\t\tQUINCY\n\t\tI've been hearing you.\n\n\tNona eyes her son, then lets up.  She gives him a kiss.\n\n\t\t\t\tNONA\n\t\tHow was your game?\n\n\t\t\t\tQUINCY\n\t\tTwenty-seven points, eleven assists and\n\t\tstill undefeated.\n\n\t\t\t\tNONA\n\t\tStill the man.\n\n\t\t\t\tQUINCY\n\t\tYup.\n\n\tNona smiles, starts back the kitchen.\n\n\t\t\t\tNONA\n\t\tWhere's your dad?\n\n\t\t\t\tQUINCY\n\t\tSaid he'd be home later.\n\n\t\t\t\tNONA\n\t\tLater when?\n\n\t\t\t\tQUINCY\n\t\tI don't know, he had a meeting or\n\t\tsomething.\n\n\tQuincy exits to his room.\n\n\tINT. MCCALL HOUSE - ZEKE AND NONA'S ROOM - LATE NIGHT\n\n\tNona angrily rolls her hair as Zeke undresses.\n\n\t\t\t\tZEKE\n\t\tI had some players to see and hands to\n\t\tshake.\n\n\t\t\t\tNONA\n\t\tAt one in the morning?\n\n\t\t\t\tZEKE\n\t\tI'm not gonna get anywhere punching a\n\t\tclock just so my wife doesn't get an\n\t\tattitude.\n\n\t\t\t\tNONA\n\t\tI came second to the NBA.  I'm not about\n\t\tto come second to this bullshit scouting\n\t\tjob.\n\n\tZeke looks at her, offended.\n\n\t\t\t\tNONA (cont'd)\n\t\tI didn't mean it like that.\n\n\t\t\t\tZEKE\n\t\tYeah.\n\n\t\t\t\tNONA\n\t\tI'm just saying it'd be nice if you found\n\t\ttime for your family.\n\t\tYou should see the tramps coming after\n\t\tQuincy.  If you don't talk to him...\n\n\t\t\t\tZEKE\n\t\tI have.\n\n\tA beat.\n\n\t\t\t\tNONA\n\t\tYou said you'd think about going back to\n\t\tget your degree.\n\n\t\t\t\tZEKE\n\t\tNo, you said I should get my degree.  I\n\t\tlike my \"bullshit\" job, okay, and it's\n\t\tgonna lead to a spot in the front office.\n\t\tTil then, don't worry, there's just\n\t\tenough savings to keep your ass in Gucci\n\t\tand gold.\n\n\tLivid, Nona pulls off her gold bracelet, throws it at him.\n\n\t\t\t\tNONA\n\t\tFine, then how many nights home is that?\n\n\t\t\t\tZEKE\n\t\tKeep your voice down.\n\n\tShe grabs a pair of gold earrings from her jewelry box, nails\n\thim.\n\n\t\t\t\tNONA\n\t\tHow about now?  I got a week yet?\n\n\tINT. MCCALL HOUSE - QUINCY'S ROOM - CONTINUOUS\n\n\tQuincy lies in bed, staring at the ceiling, as his parents\n\tcontinue to have it out.\n\n\tHe rolls out of bed, pulls on a pair of shorts and a T-shirt.\n\tHe moves to his window, pulls it open and climbs out...\n\n\tEXT. MCCALL AND WRIGHT HOUSES - CONTINUOUS\n\n\tQuincy crosses the grass to Monica's window, knocks quietly.\n\n\tLong beat, then Monica sleepily stumbles to her window,\n\twearing boxers and a tank top.  She pushes it open and Quincy\n\tpulls himself through...\n\n\tINT. WRIGHT HOUSE - MONICA'S ROOM - CONTINUOUS\n\n\tNow a routine, Monica tosses Quincy one of her pillows and\n\tblankets, then crawls back into bed.\n\tHe lays out on the floor and closes his eyes.  Monica casts a\n\tlong, sleepy glance at him, then drifts back to sleep.\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\t\t\t\t\t\t\t\t\n\t  INT. WRIGHT HOUSE - MONICA'S ROOM - LATE DAY\n\n\n\n\tPosters of Magic line three walls.  A hand-made collage of\n\n\tfemale college and Olympic ball-players fills the fourth.\n\tThe only real \"soft\" touch is the teddy bear laying on the\n\tpillow.\n\n\tMonica sits on the floor between Lena's legs, as Lena puts\n\tMonica's hair in cornrows.\n\n\t\t\t\tLENA\n\t\tThat too tight?\n\n\t\t\t\tMONICA\n\t\tNo.\n\n\t\t\t\tLENA\n\t\tMom's going to hate it.\n\n\t\t\t\tMONICA\n\t\tAlways on my ass, anyway.\n\n\t\t\t\tLENA\n\t\tLike you don't give her a hard time.\n\n\t\t\t\tMONICA\n\t\tJust cause I don't kiss her booty like\n\t\tyou...\n\n\tLena yanks Monica's head back.\n\n\t\t\t\tMONICA (cont'd)\n\t\tOw!!!\n\n\t\t\t\tLENA\n\t\tYou need to.  She's alone in this house\n\t\tall day, taking care of Dad and your\n\t\tungrateful behind.\n\n\t\t\t\tMONICA\n\t\tNo one's forcing her.\n\n\t\t\t\tLENA\n\t\tJust try and chill a little bit, alright.\n\n\tMonica doesn't answer.  Lena yanks her head back again.\n\n\t\t\t\tMONICA\n\t\tOw!!!  Okay!\n\n\tThey crack up.\n\n\t\t\t\tLENA\n\t\tSo what's going on with the Spring Dance?\n\t\tYou have a date yet?\n\n\t\t\t\tMONICA\n\t\t\t(sarcastically)\n\t\tYeah, brothers are lined up at my locker.\n\n\t\t\t\tLENA\n\t\tI found you someone.\n\n\t\t\t\tMONICA\n\t\tFound?  I'm not some charity case.\n\n\t\t\t\tLENA\n\t\tI know...\n\n\t\t\t\tMONICA\n\t\tMom tell you to do this?\n\n\t\t\t\tLENA\n\t\tNo.\n\n\t\t\t\tMONICA\n\t\tDamn, Lena...\n\t\t\t(then)\n\t\tWho is he?\n\n\t\t\t\tLENA\n\t\tThis brother from my college.\n\n\t\t\t\tMONICA\n\t\tHe's in college?\n\n\t\t\t\tLENA\n\t\tAnd he's fine, girl.\n\n\t\t\t\tMONICA\n\t\tHow'd you get him to say yes?\n\n\t\t\t\tLENA\n\t\tI told him you looked like me.\n\n\t\t\t\tMONICA\n\t\tOh, great.\n\n\t\t\t\tLENA\n\t\tYou do.\n\n\t\t\t\tMONICA\n\t\tYeah, right.\n\n\t\t\t\tLENA\n\t\tIf you were tore up I would not be\n\t\tclaiming you.  Trust.\n\n\tMonica is not convinced.\n\n\t\t\t\tLENA (cont'd)\n\t\tWe'll do something cute with your hair,\n\t\tget you a dress, get you some heels...\n\n\t\t\t\tMONICA\n\t\tI don't know how to walk in heels.\n\n\t\t\t\tLENA\n\t\tHey.  You just worry about playing your\n\t\tbehind off for that recruiter tonight.\n\t\tLet me worry about your date.\n\n\tLena starts to braid Monica's hair again.  Beat, then...\n\n\t\t\t\tMONICA\n\t\tYou ever been in love?\n\n\t\t\t\tLENA\n\t\tToo many times.\n\n\t\t\t\tMONICA\n\t\tThey ever love you back?\n\n\t\t\t\tLENA\n\t\tYeah, once I cut them off.  Why?\n\n\tMonica just shrugs.  Lena continues braiding.\n\t\n\t\n\t  EXT. MCCALL HOUSE - DRIVEWAY - LATE DAY\n\n\tQuincy and Zeke sweat through a playfully intense game of one-\n\ton-one.\n\n\tQuincy almost breaks Zeke's ankles with a cross-over dribble,\n\tand leaves him in the dust.  He stops under the basket, waves\n\tfor his Dad to come on before laying it up.\n\n\tZeke smiles, tells Quincy to bring that shit on again.\n\tQuincy tries his cross-over again and this time Zeke picks\n\thim clean.\n\n\tZeke taunts him as he easily backs in on him to the basket.\n\n\tINT. WRIGHT HOUSE - KITCHEN - DUSK\n\n\tCamille stands at the stove, cooking up some yams.  Monica\n\tenters with a gym bag over her shoulder, dribbling her ball.\n\tTHE HOOD OF HER SWEATSHIRT COVERS HER HAIR.\n\n\t\t\t\tCAMILLE\n\t\tMonica, please.\n\n\tMonica stops.\n\n\t\t\t\tMONICA\n\t\tSorry.\n\t\t\t(then)\n\t\tI'm leaving.\n\n\tCamille fills a spoon from the pot, holds it out.\n\n\t\t\t\tCAMILLE\n\t\tTaste this.\n\n\t\t\t\tMONICA\n\t\tI can't eat before a game.\n\n\t\t\t\tCAMILLE\n\t\tChild, take a bite.\n\n\tMonica sighs, takes a bite.  It's good.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tI found some apricot chutney and mixed it\n\t\twith the yams.\n\n\t\t\t\tMONICA\n\t\tYou really should be a caterer or\n\t\tsomething like you used to say.\n\n\t\t\t\tCAMILLE\n\t\tSure.  In between all the other things I\n\t\thave to do.\n\n\tShe pulls off Monica's hood, then stops when she sees her\n\tbraids.  Monica looks back defiantly.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\t\t\t\tCAMILLE\n\t\tNothing.  So good luck.\n\n\tShe forces a smile, turns back to her cooking.  Monica just\n\tnods, and crosses out.\n\n\tINT. CRENSHAW HIGH SCHOOL GYM - NIGHT\n\n\tThe championship game.  The bleachers are almost filled.\n\tNathan and Lena sit, dead center.  ALSO IN ATTENDANCE, COACH\n\tCHERYL MILLER - THE COACH OF USC.\n\n\tQuincy sits in the back row with a couple of teammates.  As\n\talways, he's the focus of much attention.\n\n\tMonica and her teammates are crouched in a tight huddle,\n\tsurrounding Coach Hiserman.\n\n\t\t\t\tCOACH HISERMAN\n\t\tI don't have to tell you girls how big\n\t\tthis game is.  We worked too damn hard\n\t\tall season to leave without this\n\t\tchampionship.  So let's play smart...\n\t\t\t(looks at Monica)\n\t\t...let's play in control, and let's kick\n\t\tsome butt.  Cougars on three.\n\t\tOnce...two...three.\n\n\t\t\t\tTEAM\n\t\tCougars!\n\n\tAs Monica moves to center court, she glances up at the USC\n\tCoach, then at Quincy.\n\n\tMonica takes a deep breath as she lines up for the opening\n\ttip.  An opposing player suddenly bumps her out of position.\n\tMonica glares at her, but just moves over.\n\n\tThe ball is tossed up...\n\n\t\t\t\t\t\t\t\t  SMASH CUT TO:\n\n\tINT. CRENSHAW GYM - NIGHT\n\n\tFourth quarter.  One minute left.  Cougars down three.\n\n\tMonica dribbles down court, bouncing with confidence as her\n\topponent plays her tight.\n\n\tMonica zips a no-look pass to a teammate, who lays it up.\n\tQuincy punches one of his friends - \"Oh shit!\"  She is having\n\tthe game of her life.\n\n\tOn the defensive end, Monica steals the ball.  She drives the\n\tlength of the court, lays it up between two defenders.  The\n\tcrowd is hyped.\n\n\tTwenty seconds left, up by one.  Monica hounds the opposing\n\tguard as she brings up the ball.\n\tMonica suddenly reaches in and knocks the ball loose.  As she\n\tgoes for the ball, a WHISTLE.\n\n\t\t\t\tREFEREE\n\t\tReaching in, number thirty-two.  One-and-\n\t\tone.\n\n\tBoos fill the gym.  Monica's eyes widen.\n\n\t\t\t\tMONICA\n\t\tNo!\n\n\tAnger rushes through her as she starts for the ref.\n\n\t\t\t\tMONICA (cont'd)\n\t\tThat's bullsh--!\n\n\t\t\t\tCOACH HISERMAN\n\t\tMonica!\n\n\tMonica catches herself, turns the word \"shit\" into a\n\tfrustrated yell as she quickly moves away from the ref.\n\n\tMonica lines up for the free-throw, clenching her fists.  The\n\tgirl hits the first one.  Then, she hits the second.\n\n\tWith ten seconds left, down by one, Monica drives down court\n\tand throws up a prayer.  EVERYONE IS ON THEIR FEET AS THE\n\tBALL SPINS AROUND THE RIM.  AND THEN...IT POPS OUT.  An\n\topposing player grabs the rebound and Monica has no choice\n\tbut to foul her.\n\n\tMonica has just fouled out.  She walks to her bench and drops\n\tdown.  She buries her face in a towel and sobs.\n\n\tThe buzzer goes off.  Cougars lose.\n\n\tQuincy stares at Monica, feeling almost as bad as she does.\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t  INT. WRIGHT HOUSE - MONICA'S ROOM - NIGHT\n\n\n\n\tMonica sits slumped on her bed in a bathrobe, as Lena stands\n\n\tin front of her, putting the finishing touches on Monica's\n\n\tmake-up.\n\n\n\n\t\t\t\tLENA\n\n\t\tMight help if you didn't look so evil.\n\n\t\t\t\tMONICA\n\t\tI don't even want to go.\n\n\tShe steps back, looks at her work.\n  \n\t\t\t\tLENA\n\t\tMom!\n\n\tBeat, then Camille enters.\n  \n\t\t\t\tLENA (cont'd)\n\t\tTalk to me.\n\n\tCamille stares at her daughter, taken aback by how great she\n\tlooks.\n\n\t\t\t\tCAMILLE\n\t\tGo in my top drawer and get my pearls.\n\n\tLena exits.  Monica still looks miserable.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tYou okay?\n\n\tMonica shrugs.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tWell, can you promise me one thing?\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\t\t\t\tCAMILLE\n\t\tTonight, don't worry about yesterday's\n\t\tgame, the recruiters, or anything else.\n\t\tI just want you to enjoy being beautiful.\n\t\tWill you do that?\n\n\tMonica takes this in as Lena returns with Camille's pearls.\n\n\t\t\t\tLENA\n\t\tHere.\n\n\tCamille puts them around Monica's neck.  Monica looks back at\n\ther.\n\n\t\t\t\tMONICA\n\t\tYou really think I look beautiful?\n\n\tCamille smiles at her daughter, nods.  Monica touches the\n\tpearls.\n\n\tINT. CRENSHAW GYM - NIGHT\n\n\tAn R&B song jams through the speakers, filling the dance\n\tfloor with high school kids in suits and dresses.\n\n\tIn the middle of the floor, Quincy gets his groove on with\n\this date, Shawnee.  She dances so provocatively, there is no\n\tmistaking what she has in mind for later.\n\n\tOver at the doors, Monica enters with her college date,\n\tJASON, 21, and fine.  Heads turn in surprise.  Monica feels\n\tthe stares, shifts nervously.\n\n\t\t\t\tJASON\n\t\tCan I take your coat?\n\n\t\t\t\tMONICA\n\t\tYou're cold?\n\n\tMonica starts to pull it off.\n\n\t\t\t\tJASON\n\t\tNo, I mean I can check it for you.\n\n\t\t\t\tMONICA\n\t\t\t(embarrassed)\n\t\tOh, sorry.\n\n\tJason pulls off her coat, revealing a dress that shows off\n\teverything Monica has been hiding.  He checks out her frame,\n\tsmiles.\n\n\t\t\t\tJASON\n\t\tYour sister wasn't lying.\n\n\tHe crosses to the coat check, leaving her alone.\n\n\tANGLE ON\n\n\tQuincy, who glances over from the middle of the dance floor,\n\tand abruptly stops.  He stares at Monica in shock.\n\n\t\t\t\tQUINCY\n\t\tOh...shit.\n\n\tQuincy starts off the floor as a new song kicks in.\n\n\t\t\t\tSHAWNEE\n\t\tQ, I like this song...\n\n\tANGLE ON\n\n\tMonica, sees Quincy approaching in his suit.  She quickly\n\tsteadies herself on her heels, brushes a curl from her face.\n\n\t\t\t\tQUINCY\n\t\tSee you made it.\n\n\t\t\t\tMONICA\n\t\tYeah.\n\n\t\t\t\tQUINCY\n\t\tYou don't look half-bad.\n\n\t\t\t\tMONICA\n\t\tYou either.\n\n\tJason returns.  Quincy looks at him, surprised.\n\n\t\t\t\tJASON\n\t\tWhat's up, Black.  I'm Jason.\n\n\t\t\t\tQUINCY\n\t\tQ.\n\n\tShawnee suddenly steps up, slides her arms around Quincy.\n\n\t\t\t\tSHAWNEE\n\t\tDang, girl, I didn't know Nike made\n\t\tdresses.\n\n\tMonica looks at Shawnee, wrapped around Quincy.  She can't\n\tbelieve it.\n\n\t\t\t\tMONICA\n\t\tGuess we'll see you later.\n\n\tMonica heads into the crowd with her college man.  Quincy\n\twatches her go.\n\n\tINT. CRENSHAW HIGH SCHOOL GYM - LATER\n\n\tMonica sits at a table with Jason.  His arm lays casually\n\tacross the back of her chair.  Monica sits upright, stiff.\n\n\t\t\t\tJASON\n\t\tSo, you like school?\n\n\tMonica smiles nervously, nods.\n\n\t\t\t\tJASON (cont'd)\n\t\tYeah, high school was cool.  I don't\n\t\tremember sisters being as fine as you,\n\t\tthough.\n\n\tMonica just holds that nervous smile.\n\n\t\t\t\tJASON (cont'd)\n\t\tSo what do you like studying?\n\n\t\t\t\tMONICA\n\t\tGym.\n\n\tHe waits for more, but nothing comes.\n\n\t\t\t\tJASON\n\t\tI'm an English major.  You like English?\n\n\t\t\t\tMONICA\n\t\tSort of.\n\n\t\t\t\tJASON\n\t\tCareful.\n\n\t\t\t\tMONICA\n\t\tHuh?\n\n\t\t\t\tJASON\n\t\tThat was two words.\n\n\tMonica ducks her head, embarrassed.  Jason laughs.\n\n\t\t\t\tJASON (cont'd)\n\t\tGirl, how come you're so stressed?\n\n\t\t\t\tMONICA\n\t\tSorry.\n\n\t\t\t\tJASON\n\t\tI mean, I'm having a good time with\n\t\tyou...\n\n\tHis arm slides off the back of her chair and onto her\n\tshoulders.\n\n\t\t\t\tJASON (cont'd)\n\t\tSo tell me what I have to do to make you\n\t\thave a good time with me.\n\n\t\t\t\tMONICA\n\t\tMy mouth is kinda dry.\n\n\t\t\t\tJASON\n\t\tThen I'll get you some punch.\n\n\tHe stands, then.\n\n\t\t\t\tJASON (cont'd)\n\t\tJust don't jet while I'm gone and leave a\n\t\tglass slipper behind.\n\n\tMonica's face lights up.  Jason smiles.\n\n\t\t\t\tJASON (cont'd)\n\t\tThere we go.\n\n\tHe crosses away to the refreshment table.  Monica smiles\n\twider, leans back in her chair with her legs splayed.  She\n\tcatches herself and quickly crosses them.\n\n\tA couple of guys pass by and check her out.  Monica smiles\n\twider.  Quincy steps up, holding two cups of punch.\n\n\t\t\t\tQUINCY\n\t\tHey.\n\n\t\t\t\tMONICA\n\t\tHey.\n\n\t\t\t\tQUINCY\n\t\tYou having fun?\n\n\t\t\t\tMONICA\n\t\tYeah.\n\n\t\t\t\tQUINCY\n\t\tYeah, the DJ's kinda whack, though.\n\t\t\t(beat)\n\t\tSo who is this clown?\n\n\t\t\t\tMONICA\n\t\tHe ain't Spalding.\n\n\t\t\t\tQUINCY\n\t\tGuess not.\n\n\t\t\t\tMONICA\n\t\tSo you took Shawnee, huh?\n\n\tThe DJ puts on \"Make It Last Forever\" by Keith Sweat.\n\tCouples move to the dance floor.\n\n\t\t\t\tQUINCY\n\t\t\t(embarrassed)\n\t\tYou know, it was late and she asked...\n\n\t\t\t\tJASON\n\t\tYou want to dance?\n\n\tJason stands behind her chair.  Monica smiles shyly.\n\n\t\t\t\tMONICA\n\t\tSure.\n\n\tJason puts down her cup of punch, takes her hand, leads her\n\tto the dance floor.\n\n\tQuincy just shakes his head, then crosses to his table, grabs\n\tShawnee's hand.\n\n\t\t\t\tQUINCY\n\t\tC'mon.\n\n\tHe pulls Shawnee to the middle of the floor.\n\n\tANGLE ON\n\n\tMonica, nervous at first, a little awkward, but Jason gently\n\tguides her in a slow circle and she starts to relax.\n\n\tJason moves his hands down Monica's back, pulling her in\n\tcloser.  Shawnee snuggles into Quincy's chest, runs her hands\n\tdown his neck.  The heat from bodies grows.\n\n\tMonica and Quincy glance up at the same time and catch each\n\tother's eyes.  They start to look away but find they can't.\n\tEyes locked as they dance, they move together, almost feel\n\teach other.  Finally, as their bodies turn, they lose sight.\n\n\tMonica puts her head to Jason's chest, Quincy slides his\n\thands lower down Shawnee's back.  The music continues...\n\n\tINT. JASON'S CAR - NIGHT\n\n\tJason and Monica are parked up on Mulholland Drive.  LL Cool\n\tJ's \"I Need Love\" plays on the tape deck.\n\n\tJason has his arm around Monica, ready to make his move.\n\n\t\t\t\tMONICA\n\t\t\t(rattling)\n\t\tFreshman year, my free throw percentage\n\t\twas fifty-one percent, cause I was\n\t\tshooting it like a jump shot.\n\n\tJason leans in, kisses her bare shoulder.\n\n\t\t\t\tMONICA (cont'd)\n\t\tUm...but then sophomore year I was\n\t\tshooting seventy-five percent from the\n\t\tline.\n\n\tJason kisses her neck.\n\n\t\t\t\tMONICA (cont'd)\n\t\t...uh, by keeping my feet set and really\n\t\tfollowing through.\n\n\tJason goes in for the slam dunk.  Kisses Monica on the lips.\n\tIt's the first time she's really been kissed.  Jason pulls\n\taway, smiles.\n\n\t\t\t\tJASON\n\t\tThat was nice.\n\n\t\t\t\tMONICA\n\t\tUh-huh.\n\n\t\t\t\tJASON\n\t\tYour sister told me hands off, but I\n\t\tcan't help myself...\n\n\tJason leans in.  Monica closes her eyes, and they kiss some\n\tmore.  Monica tries to follow his practiced lips.\n\n\tJason's tongue slides in and their bodies slide down.  His\n\thand moves across her breast.  Monica's eyes pop open.\n\n\t\t\t\tMONICA\n\t\tWait...\n\n\t\t\t\tJASON\n\t\tShh.  It's okay.\n\n\tNaive and inexperienced, Monica shuts her eyes tight.\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t  E WRIGHT HOUSE -NIGHT\n\n\n\n\tJason's car pulls off, Monica slowly moves to her front door.\n\n\tShe looks in the living room window.  Her mom is asleep in a\n\tchair, trying to wait up.\n\n\tMonica catches her reflection in the window.  She glares at\n\ther made-up face, then wipes at her mouth with her hand.\n\n\tShe steps back , walks to her bedroom window.  She pulls it\n\topen, kicks off her heels and climbs through.\n\n\tINT. WRIGHT HOUSE - MONICA'S ROOM - CONTINUOUS\n\n\tMonica moves to her bed and drops down.  She sits motionless\n\tfor a beat, then suddenly feels something beneath her.  She\n\treaches for it.  IT'S A LETTER FROM THE USC ATHLETIC\n\tDEPARTMENT.  Monica stares at it in her hands...\n\n\tLight suddenly cuts through the darkness.  Monica turns and\n\tis surprised to see Quincy standing in the middle of his\n\troom, pulling off his jacket.  Monica moves to her window,\n\tpulls it open.\n\n\t\t\t\tMONICA\n\t\tPsst.\n\n\tQuincy looks over.  Beat.  Then he climbs out of his window,\n\tdrops down.\n\n\tEXT. WRIGHT AND MCCALL HOUSES - CONTINUOUS\n\n\t\t\t\tMONICA\n\t\tEarly night for you, isn't it?\n\n\t\t\t\tQUINCY\n\t\tI was about to ask you the same thing,\n\t\tgoing out with a college boy and all.\n\n\tMonica doesn't respond.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tSo where'd you go after?\n\n\t\t\t\tMONICA\n\t\t\t(beat)\n\t\tMulholland Drive.\n\n\t\t\t\tQUINCY\n\t\tFigures.\n\n\t\t\t\tMONICA\n\t\tSo what dead-end street did you and\n\t\tShawnee hit?\n\n\t\t\t\tQUINCY\n\t\tNone of your business.\n\n\t\t\t\tMONICA\n\t\tWell, I'm sure she kept her word and left\n\t\tyou satisfied.\n\n\t\t\t\tQUINCY\n\t\tThat what you think?\n\n\tMonica shrugs.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tLittle after you left, I told Shawnee it\n\t\twas time to go and I drove her ass\n\t\tstraight home.  And after she told me I\n\t\twas the dumbest brother in the world, I\n\t\ttook off.\n\n\t\t\t\tMONICA\n\t\tWhy?\n\n\t\t\t\tQUINCY\n\t\tCause I don't just stick my dick in\n\t\tanything.\n\n\tMonica takes this in.\n\n\t\t\t\tMONICA\n\t\tI was sitting in Jason's ride with him\n\t\tkissing on me and feeling on me and it\n\t\twas really bugging me cause I couldn't\n\t\tremember how many offensive boards I had\n\t\tin the championship.  And then I guess\n\t\tshe got tired of me sort of accidentally\n\t\tkneeing him in the balls.\n\n\tBeat, then Quincy cracks up.  Monica laughs with him.\n\n\t\t\t\tQUINCY\n\t\tFour.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\t\t\t\tQUINCY\n\t\tYou had four offensive rebounds.\n\n\tMonica stares at him, surprised.  She thinks.\n\n\t\t\t\tMONICA\n\t\tHold up for a second.\n\n\tMonica disappears back inside.  Beat, then she re-appears.\n\tShe climbs out her window, drops down.  Quincy looks at her.\n\n\tShe holds out the envelope from USC.\n\n\t\t\t\tQUINCY\n\t\tWhen'd you get this?\n\n\t\t\t\tMONICA\n\t\tIt was on my bed when I came in.\n\t\t\t(then)\n\t\tCan you just...?\n\n\t\t\t\tQUINCY\n\t\t\t(beat)\n\t\tYou sure?\n\n\tMonica nods.  Quincy takes the envelope, sits down on the\n\tgrass.  Monica sits down beside him.  He tears open the\n\tenvelope and pulls out the letter.\n\n\tMonica stares at him as he reads, trying to see an answer in\n\this face.  Quincy finally looks up.  Expressionless.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tDamn girl...\n\n\tMonica's face falls.  And then, a slow smile spreads across\n\tQuincy's face.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tThey want you.\n\n\tMonica grabs the letter, reads.  Her head just drops as a\n\ttidal wave of relief washes over her.\n\n\tQuincy smiles.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tCongratulations.\n\n\tMonica looks up, cheesing.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tI'm gonna be there, too.  I'm announcing\n\t\ttomorrow.\n\n\t\t\t\tMONICA\n\t\tI knew it.\n\n\tMonica can't contain her excitement.  Without thinking, she\n\tgives Quincy a kiss.  They pull away, then break into nervous\n\tlaughter.\n\n\t\t\t\tQUINCY\n\t\tWhat was that about?\n\n\t\t\t\tMONICA\n\t\tI know, right?\n\n\tBut they both want more.  They lean in, kiss deeply.  They\n\tfall back on the grass.  And kiss.  And kiss.\n\n\tSuddenly, Monica pulls away, sits up.  Quincy follows,\n\tinstantly apologetic.  Monica stares at him, then to his\n\tsurprise, she reaches over, gives his shirt a small tug with\n\ther finger.\n\n\tQuincy stares at her, then slowly pulls off his tie.  He\n\tnervously unbuttons his shirt.  He fumbles with the last two\n\tbuttons.\n\n\tMonica slowly pulls down the straps of her dress, self-\n\tconscious.  Quincy can't keep his eyes off her.\n\n\tHe pulls off his pants.  Monica glances down and her eyes\n\twiden.  She looks scared to death.  Quincy smiles softly,\n\tleans in and gently kisses her.  She relaxes.  They lay down.\n\n\tQuincy reaches into his pants for a condom.  His hands shake\n\tas he puts it on.  They stare at each other as he moves on\n\ttop of her.\n\n\tQuincy pushes inside her.  She flinches back in pain.  Quincy\n\timmediately stops as tears spring to her eyes.\n\n\t\t\t\tQUINCY\n\t\t\t(softly)\n\t\tYou want to stop?\n\n\tMonica shakes her head.  Quincy pushes inside again.  He\n\tlooks down at her with tenderness, moves gently, kisses her\n\ttears...\n\n\t\t\t\t\t\t\t\t FADE TO BLACK.\n\n\tFADE IN:\n\n\tFOOTAGE.  1988-89 NBA Finals.  Game SEVEN.  The Lakers\n\tagainst the Pistons.  With seconds left, up by three, Magic\n\tguards Isiah Thomas.  They collide, no foul is called and the\n\tLakers win their second championship.\n\t\n\t\n\t FADE IN:\n\n\n\n\tTITLE CARD: \"THIRD QUARTER\"\n\n\tINT. USC - CAMPUS GYM - MORNING\n\n\tChampionship banners hang from the ceiling.\n\n\tTWELVE YOUNG WOMEN sit on the first two rows of bleachers.\n\tThe eight upperclassmen kick back in the second row,\n\tcomfortable, confident.  Monica and the three other freshmen\n\tsit in front of them, jiggling nervously.\n\n\tCOACH MILLER stands in front of the team.\n\n\t\t\t\tCOACH MILLER\n\t\tI don't know some of you very well yet,\n\t\tand you don't know me because I'm still\n\t\tbeing nice to you.\n\n\tLaughter from the upperclassmen.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tBut my philosophy is simple. Hard work\n\t\tand sacrifice.\n\t\tThere's a lot of basketball history and\n\t\tpride here at USC, but just putting on\n\t\tthe cardinal and gold doesn't make you a\n\t\tgreat player.  Hard work and sacrifice\n\t\tmakes you a great player.  What you were\n\t\tdoesn't matter anymore.  For the first\n\t\ttime in your life, you won't be the best.\n\t\tYou'll be going up against women that are\n\t\tbigger and stronger and better than you\n\t\tever imagined.  So the question is, how\n\t\twill you respond?  Well, your answer\n\t\tbetter be hard work and sacrifice because\n\t\tthat's the only way you're gonna make it\n\t\tthrough.  Vince Lombardi preached it and\n\t\tI teach it, \"There is only one way to\n\t\tsucceed at anything and that is to give\n\t\teverything.\"\n\n\tCoach Miller pauses a moment to let her words sink in.\n\tMonica glances at her fellow freshman for their reactions.\n\tLike her, a lot of cockiness, a lot of fear.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tA few simple rules.  Eleven o'clock\n\t\tcurfew, no exceptions.  Always be on\n\t\ttime, no exceptions.  Attend every class,\n\t\tno exceptions.  No drugs, no alcohol, no\n\t\tgetting pregnant.  And finally, respect\n\t\tyourselves, respect your coaches and\n\t\trespect your teammates, right Sidra?\n\n\tSIDRA, senior point guard, nods from the second row.\n\n\t\t\t\tSIDRA\n\t\tThat's right, Coach.\n\n\t\t\t\tCOACH MILLER\n\t\tBy the end of this year some of you will\n\t\thate me...\n\n\tThe upperclassmen crack up.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tSome of you will want to go home...\n\n\t\t\t\tUPPERCLASSMEN\n\t\t\t(cat-calling)\n\t\tCree!\n\n\tCREE, junior forward, ducks her head sheepishly.  Coach\n\tMiller smiles.\n\n\t\t\t\tCOACH MILLER\n\t\tBut I guarantee you, if you work hard and\n\t\tsacrifice, all of you will be better\n\t\tbasketball players and better people.\n\n\tMonica nods, accepting the challenge.\n\n\tEXT. TRACK - EARLY MORNING\n\n\tIt's cold, it's dark.  It's six a.m.\n\n\tThe team pounds down the track, pushing through a two-mile\n\trun.  Monica and her freshman teammate/roommate SHAYLA, 18,\n\tbreathe heavily from the back of the pack.\n\n\tFrom the sideline.\n\n\t\t\t\tCOACH MILLER\n\t\tLet's go, freshmen, you're getting\n\t\tspanked!\n\n\tMonica sucks it up, runs faster.  She reaches the middle of\n\tthe pack, then runs out of gas.  She drops back to the rear.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tMonica, I'm putting you on my Wizard of\n\t\tOz team.  No brains, no courage and no\n\t\theart!\n\n\tINT. CAMPUS GYM - MORNING\n\n\tDefensive drills.  One by one, players crouch low and move\n\tbackwards down the sideline.  ZVETTE, a junior guard, hustles\n\tthrough the drill.\n\n\t\t\t\tCOACH MILLER\n\t\tWay to work, Zvette.\n\n\tMonica starts the drill.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tGet lower, Monica, move your feet.\n\n\tMonica grimaces as she squats lower.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tI said lower!\n\n\tCoach Miller stops her, squats down low beside her.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tThis is low, got it?  Offense sells\n\t\ttickets, defense wins games!\n\n\tMonica starts again.\n\n\tINT. CAMPUS GYM - MORNING\n\n\tThe team stands along the baseline.  Monica stands right\n\tbelow the free throw line.\n\n\tTONI, 6'4\", 200 pound senior, drives the lane.  Monica steps\n\tin front of her, and is slammed to the floor.  She lays still\n\tfor a moment, stunned by the impact.  Laughter from the\n\tbaseline.\n\n\t\t\t\tSIDRA\n\t\tDag, you took her out, T.\n\n\tTeammates SANDRA and LISA crack up.\n\n\t\t\t\tSANDRA\n\t\tI think she just said \"Mommy.\"\n\n\t\t\t\tLISA\n\t\tNo, she said \"mammary.\"\n\n\t\t\t\tCOACH MILLER\n\t\tMonica, you trying to tell me you can't\n\t\ttake a little challenge?\n\n\tMonica crawls to her feet.\n\n\t\t\t\tMONICA\n\t\tI can take it.\n\n\t\t\t\tCOACH MILLER\n\t\tThis time get your feet set.\n\n\tMonica moves back into position.  Toni drives at her again.\n\tMonica steps in front of her, braces herself.  Toni slams\n\tinto her and she hits the floor.  Monica blinks back the pain\n\tas she pops back up.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tNext!\n\n\tMonica wobbles back to the sideline.\n\n\tINT. WEIGHT ROOM - LATE DAY\n\n\tThe team is spread out, lifting weights.  Monica lies on a\n\tweight bench, her arms shaking as she struggles to bench\n\tpress fifty-pounds.  Sidra stands behind her, spotting.\n\n\t\t\t\tSIDRA\n\t\tYou got it, c'mon, lift!\n\n\tMonica lifts it with Sidra's help.\n\n\t\t\t\tSIDRA (cont'd)\n\t\tThat's it.\n\n\t\t\t\tMONICA\n\t\tCoach hates me, doesn't she?\n\n\t\t\t\tSIDRA\n\t\tShe hates all freshmen.\n\n\tMonica scowls, discouraged.\n\n\t\t\t\tMONICA\n\t\tWhat's up with that?\n\n\t\t\t\tSIDRA\n\t\tHey, don't take it personal.  And don't\n\t\tthink just cause we play the same\n\t\tposition we have to compete with each\n\t\tother.  We're teammates, okay?\n\n\t\t\t\tMONICA\n\t\tThanks, Sidra.\n\n\t\t\t\tSIDRA\n\t\tBesides.  I've been starting point the\n\t\tlast two years.  Ain't no way some dumb-\n\t\tass freshman is taking my spot.\n\n\tSidra walks off, leaving Monica with the bar on her chest.\n\tFinally, she has to drop the weight to the floor.\n\n\tEXT. USC CAMPUS - LATE MORNING\n\n\tMonica and Quincy walk to class, his arm draped casually\n\tacross her shoulders.  Quincy gets looks and smiles.  Monica\n\tjust looks exhausted.\n\n\t\t\t\tMONICA\n\t\tYou finish the reading for E-con?\n\n\t\t\t\tQUINCY\n\t\tYeah.\n\n\t\t\t\tMONICA\n\t\tWhat'd it say?\n\n\t\t\t\tQUINCY\n\t\tBasically broke down how I'm gonna make\n\t\tmad loot in the NBA, me being such a\n\t\tlimited commodity and all.\n\n\t\t\t\tMONICA\n\t\tWhatever, big head.\n\n\tQuincy laughs.  TWO GIRLS pass by, smile.\n\n\t\t\t\tGIRL #1\n\t\tHey, Q-man, you gonna take us to the\n\t\tFinal Four?\n\n\t\t\t\tQUINCY\n\t\tWe'll see.\n\n\t\t\t\tGIRL #2\n\t\tWe'll be watching.\n\n\tThe girls continue on.  Monica looks at Quincy.\n\n\t\t\t\tQUINCY\n\t\tWhat?\n\n\t\t\t\tMONICA\n\t\tYou do see me standing here, right?\n\n\t\t\t\tQUINCY\n\t\tI can't be nice to a fan?\n\n\t\t\t\tMONICA\n\t\tFine, Quincy.\n\n\t\t\t\tQUINCY\n\t\tI can't help girls coming up to me.\n\n\t\t\t\tMONICA\n\t\tI said fine.\n\n\tQuincy looks at her sulking.  He suddenly pulls her down onto\n\tthe nearby lawn, and cradles her.\n\n\t\t\t\tQUINCY\n\t\tIt's okay, little baby.\n\n\t\t\t\tMONICA\n\t\t\t(struggling)\n\t\tQuit.\n\n\tQuincy grips her tighter, rocks her.  Students pass by,\n\tlaugh.\n\n\t\t\t\tQUINCY\n\t\tShhh.  Daddy's here.\n\n\tMonica finally cracks up.\n\n\t\t\t\tMONICA\n\t\tYou're such a punk.\n\n\tHe gives her a kiss.\n\n\t\t\t\tQUINCY\n\t\tAll these girls...you're the only one I\n\t\tknow who's for real.\n\n\tMonica smiles, kisses him back.\n\n\t\t\t\tMONICA\n\t\tAlways.\n\n\t INT. CAMPUS GYM - MORNING\n\n\n\n\tA heated scrimmage between the women's \"A\" team (the starting\n\tfive) and \"B\" team (five who want to be starting).  Monica\n\truns point for the \"B\" team, playing opposite Sidra.\n\n\n\tSidra is all over Monica, slipping in cheap shots, but Monica\n\tstarts to come on.  She does a quick cross-over and loses\n\tSidra.  She dishes off to Shayla, who scores.\n\n\t\t\t\tCOACH MILLER\n\t\tSidra!  You feel like playing any \"D\"?\n\n\tSidra scowls as she runs down court.  She gets a pass in the\n\tcorner, tires to make a move but Monica slaps the ball loose.\n\n\tMonica grabs it, drives to the three-point line, puts up the\n\tshot.  SWISH!  Monica stays posed, with her arm up.\n\n\tSidra takes advantage, sprints back down court.  She get the\n\tlong pass, lays it up.  Coach Miller blows her whistle.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tMonica!  Get over here.\n\n\tMonica jogs over, sheepish.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tWhile you're so busy posing, your man\n\t\tjust scored!\n\n\tMonica drops her head.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tShow me again.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\t\t\t\tCOACH MILLER\n\t\tYou love to pose so much, let's see it\n\t\tagain.\n\n\tBeat, then Monica holds up her arm like she just shot the\n\tball.  Snickers from her teammates.\n\n\t\t\t\tCOACH MILLER (cont'd)\n\t\tI want you to stand like that for the\n\t\trest of practice.\n\n\t\t\t\tMONICA\n\t\tCoach...\n\n\t\t\t\tCOACH MILLER\n\t\tI want you to stand like that until\n\t\tyou're sick of it because I don't ever\n\t\twant to see it again, you hear me?\n\t\t\t(then)\n\t\tDora, take her spot.\n\n\tDORA, freshman, jogs onto the court.  Coach Miller blows her\n\twhistle and the scrimmage resumes.\n\n\tMonica stands alone on the sideline, posing, and feeling like\n\tan asshole.\n\n\tINT. LOCKER ROOM - LATE MORNING\n\n\tMonica sits on the bench in front of her locker, dressing\n\tafter the shower.  Shayla sits next to her.\n\n\tNearby, Lisa and Sandra apply make-up in the mirror.  Zvette\n\tpasses by, already dressed.  Lisa turns.\n\n\t\t\t\tLISA\n\t\tZ, I know you're gonna shower first.\n\n\t\t\t\tZVETTE\n\t\tI don't smell bad.\n\n\t\t\t\tSANDRA\n\t\tAnd you wonder why your ass sits alone on\n\t\tthe bus.\n\n\tCree glances over from another sink, as she snaps the chain\n\ton her CROSS NECKLACE.\n\n\t\t\t\tCREE\n\t\tYou guys curse too much.\n\n\t\t\t\tSANDRA\n\t\tSince when is \"ass\" a curse?\n\n\tMAEYEN walks past.\n\n\t\t\t\tMAEYEN\n\t\tWhoa, it's as big as yours.\n\n\tThey crack up.  Cree just shakes her head.  Two TEAMMATES\n\tpass by Monica with their arms raised, mimicking her pose.\n\tMonica shakes her head.\n\n\tSidra glances at Monica from her spot on the bench.\n\n\t\t\t\tSIDRA\n\t\tThat's what you get for trying to show\n\t\tout, freshman.\n\n\t\t\t\tMONICA\n\t\tI was just playing ball.\n\n\t\t\t\tSIDRA\n\t\tYou were trying to make me look bad.\n\n\t\t\t\tMONICA\n\t\tDidn't have to try very hard.\n\n\tEars prick up around the locker room.  Sidra stands.\n\n\t\t\t\tSIDRA\n\t\tGirl, don't you know you're just sloppy\n\t\tseconds?\n\n\tMonica rises.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\tToni tries to step in.\n\n\t\t\t\tTONI\n\t\tSidra, let it go.\n\n\t\t\t\tSIDRA\n\t\tOnly reason you're here is cause Tonya\n\t\tRandall got pregnant and decided not to\n\t\tcome.  They were done recruiting.\n\n\tKELLI, senior forward, shakes her head.\n\n\t\t\t\tKELLI\n\t\tThat's cold, Sid.\n\n\t\t\t\tSIDRA\n\t\tJust thought the girl should know.\n\n\tMonica is stunned.  Sidra saunters to the showers.  Shayla\n\tnudges her with her shoulder.\n\n\t\t\t\tSHAYLA\n\t\tDon't even trip.  She's just mad cause\n\t\tshe's bow-legged.\n\n\t  INT. USC SUITES - QUINCY'S ROOM - NIGHT\n\n\n\n\tMonica and Quincy lay feet to face on Quincy's twin bed.\n\n\tMonica's hand holds an ice bag on Quincy's hip.  Quincy's arm\n\trests across an ice bag on Monica's ankle.\n\n\t\t\t\tQUINCY\n\t\tForget Tonya Randall.\n\n\t\t\t\tMONICA\n\t\tI'm telling you, Coach wishes she was\n\t\there instead of me.\n\n\t\t\t\tQUINCY\n\t\tThen prove her wrong.\n\n\t\t\t\tMONICA\n\t\tI don't have it easy like you, alright.\n\t\tThere's no red carpet laid out for me.\n\n\t\t\t\tQUINCY\n\t\tSo you're gonna act salty all night?\n\n\tQuincy's roommate/teammate REGGIE, 18, suddenly pops his head\n\tinto the room.\n\n\t\t\t\tREGGIE\n\t\tYo, dog, we're about to order some wings.\n\n\t\t\t\tQUINCY\n\t\tNah, thanks.\n\n\tReggie shrugs, closes the door.  Quincy looks at Monica,\n\tstill brooding.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tFine.  Don't worry about proving\n\t\teverybody wrong, okay?  You can't handle\n\t\tthe pressure, I'll understand.\n\n\t\t\t\tMONICA\n\t\tThat was so weak.\n\n\t\t\t\tQUINCY\n\t\tWho cares if you're never known as the\n\t\tfirst girl in the NBA.  You'll get more\n\t\tplay behind Quincy McCall's woman anyway.\n\n\tMonica shoves Quincy's ice bag down his sweat pants.  He\n\tleaps up.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tAaaah!  Damn, girl!\n\n\t\t\t\tMONICA\n\t\tThat's what you get.\n\n\tHe smiles as he pulls the ice.  Then looks her up and down.\n\n\t\t\t\tQUINCY\n\t\tSo how about a little one-on-one?\n\n\t\t\t\tMONICA\n\t\tWhat are we playing for?\n\n\t\t\t\tQUINCY\n\t\tClothes.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\tQuincy locks the door, sets up his indoor hoop.\n\n\t\t\t\tQUINCY\n\t\tI score, you strip.  You score, I drop\n\t\tsomething.\n\n\tMonica looks at him, then cracks up.\n\n\t\t\t\tMONICA\n\t\tGive me the ball.\n\n\t\t\t\tQUINCY\n\t\tMy court, I go first.\n\n\tQuincy grips the ball.  Monica crouches low on defense.\n\tQuincy drives past her and slams down a vicious dunk.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tStrip.\n\n\tMonica makes a face, then pulls off her sweatshirt.  Quincy\n\tskips back.  Monica drops low again.  Quincy fakes her out\n\tand slams down another vicious dunk.  He laughs.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tWhere's the \"D\"?\n\n\t\t\t\tMONICA\n\t\tKiss my booty.\n\n\t\t\t\tQUINCY\n\t\tPlan to.\n\n\tMonica glares through her smile, then pulls off her T-shirt,\n\tleaving her in a bra and shorts.\n\n\tQuincy goes for another dunk, but this time, Monica reaches\n\tout, GRABS HIS DICK.  Quincy drops the ball.  Monica picks it\n\tup and lays it in.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tHold up...\n\n\t\t\t\tMONICA\n\t\tAll's fair in love and basketball.\n\t\tStrip.\n\n\tQuincy pulls off his shirt.  Monica moves back into position.\n\tQuincy drops down low.  Monica fakes, gets him to leave his\n\tfeet.  She slips under him and scores.  She laughs.\n\n\t\t\t\tMONICA (cont'd)\n\t\tToo bad you got your mama's height, huh.\n\n\tQuincy pulls off his sweats, leaving him in just drawers.\n\tMonica takes in the view as she moves back into position.\n\n\tShe holds the ball out, taunting.  Quincy pretends to reach\n\tfor it, but grabs her breast instead.\n\n\t\t\t\tQUINCY\n\t\tOh, my bad.\n\n\tShe drives.  Quincy just steps out of the way and lets her\n\tscore.  Monica snatches the ball off the floor.\n\n\t\t\t\tMONICA\n\t\tYo, where's the \"D\"?\n\n\t\t\t\tQUINCY\n\t\tRight here.\n\n\tMonica turns, finds Quincy butt-naked.  He moves her against\n\tthe wall and kisses her.  Monica drops the ball, wraps her\n\tarms around him.  She smiles.\n\n\t\t\t\tMONICA\n\t\tI won.\n\n\t\t\t\tQUINCY\n\t\tI wanted you to.\n\n\tGame over.  They hit it.\n\t\n\t\n\t  INT. ESPN STUDIOS\n\n\n\n\tSportscaster DICK VITALE talks animatedly about the upcoming\n\tseason.\n\n\t\t\t\tDICK VITALE\n\t\tIt's the start of the new college season\n\t\tand I'm like a kid in a candy store.  Too\n\t\tmany great teams to choose from.  You\n\t\thave your Dukes', Kentuckys', Arkansas',\n\t\tbut my surprise treat this season...\n\n\tINT. BASKETBALL COURT\n\n\tSportscaster ROBIN ROBERTS reports on the upcoming women's\n\tseason.\n\n\t\t\t\tROBIN ROBERTS\n\t\t...USC.  The women of Troy made it to the\n\t\tSweet Sixteen last year and are returning\n\t\tfour starters from that squad.  And many\n\t\tconsider their recruiting class one of\n\t\tthe best in the nation.  The highlight of\n\t\tthat class,...\n\n\tINT. ESPN STUDIOS\n\n\t\t\t\tDICK VITALE\n\t\t...is Quincy McCall, one of my diaper\n\t\tdandies.  He's a real P.T.P., a prime-\n\t\ttime player.  Every college in the\n\t\tcountry wanted him but he chose to follow\n\t\tin his father's footsteps and become a\n\t\tTrojan.  He's gonna have a lot on his\n\t\tshoulders this season...\n\n\tINT. BASKETBALL COURT\n\n\t\t\t\tROBIN ROBERTS\n\t\t...but Coach Cheryl Miller feels that if\n\t\tjust one of her freshmen has a breakout\n\t\tyear, they can go all the way.  It's a\n\t\tlong season, anything can happen, but one\n\t\tthing is for sure...\n\n\tINT. ESPN STUDIOS\n\n\t\t\t\tDICK VITALE\n\t\tIt's gonna be awesome, baby!\n\n\tMONTAGE:\n\n\tINT. SPORTS ARENA - NIGHT\n\n\tA hundred flashbulbs pop as Quincy jogs out to center court.\n\tThe crowd goes crazy as...\n\n\tINT. CAMPUS GYM - NIGHT\n\n\tMonica sits on the bench, watching Sidra run the floor\n\tagainst UNLV, as...\n\n\tINT. SPORTS ARENA - NIGHT\n\n\tQuincy drives to the three-point line against Cal and puts it\n\tup.  It drops through the net.  He pounds his fist against\n\tthe number twenty-two on his chest, nods to Zeke standing\n\tbehind the bench, as...\n\n\tINT. CAMPUS GYM - NIGHT\n\n\tCoach Miller motions to Monica.  She jumps up, pulls off her\n\tsweats.  She jogs past Arizona bench and onto the floor,\n\tas...\n\n\tINT. SPORTS ARENA - NIGHT\n\n\tQuincy goes up for a dunk against North Carolina.  He jams it\n\tdown, grips the rim, and pulls his legs up high, as...\n\n\tINT. KAISER ARENA - NIGHT\n\n\tMonica catches a long outlet pass.  She drops a no-look\n\tbounce pass between two Berkeley defenders, to a teammate who\n\tscores.  She jogs back, as...\n\n\tINT. SPORTS ARENA - NIGHT\n\n\tZeke grips Quincy's head proudly, affectionately, as they\n\twalk off the floor after a game against Washington, as...\n\n\tINT. UNIVERSITY OF CONNECTICUT - GAMPEL PAVILION - NIGHT\n\n\tSidra crashes to the floor, immediately grabs at her ankle.\n\tMonica rises off the bench...\n\n\t\t\t\t\t\t\t\t CUT TO:\n\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t \n\t  INT. SPORTS BAR - NIGHT\n\n\tTelevisions hang from every corner, broadcasting various\n\tgames.\n\n\tZeke and Quincy sit at a bar.  Quincy is still hyped from his\n\tgame.\n\n\t\t\t\tQUINCY\n\t\t...up and under between two defenders,\n\t\twith the left hand.  That's gotta make\n\t\tSportsCenter.\n\n\tZeke just nods as the Bartender/Owner crosses over.  He is an\n\tex-ballplayer named TERRY.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tThey can't stop me, Pop...\n\n\t\t\t\tTERRY\n\t\tWhat are you having, Zeke?\n\n\t\t\t\tZEKE\n\t\tGenuine Draft.  And an orange juice for\n\t\tmy kid.\n\n\t\t\t\tTERRY\n\t\tCross-over's looking good, Quincy.  I\n\t\tknow your old man didn't teach you that.\n\n\t\t\t\tZEKE\n\t\tDidn't need a cross-over to post you up.\n\n\tTerry laughs as he moves off to fix the drinks.  Something is\n\ton Zeke's mind, but before he can speak on it...\n\n\t\t\t\tQUINCY\n\t\tYou know, the numbers I'm putting up are\n\t\tbetter than any freshman.  Some people\n\t\tare saying I'm a definite lottery pick.\n\n\tZeke suddenly focuses.\n\n\t\t\t\tZEKE\n\t\tWhat people?\n\n\t\t\t\tQUINCY\n\t\tYou know, people.\n\n\t\t\t\tZEKE\n\t\tWell, tell them to mind their damn\n\t\tbusiness.  You're smart enough to get a\n\t\tdegree.\n\n\t\t\t\tQUINCY\n\t\tI'm also good enough to go pro.\n\n\t\t\t\tZEKE\n\t\tYou know how much higher the play level\n\t\tis in the NBA?  Give yourself time to\n\t\tdevelop, Quincy.  Get an education.  The\n\t\tNBA ain't going nowhere.\n\n\t\t\t\tQUINCY\n\t\tYou came out early.\n\n\t\t\t\tZEKE\n\t\tYour mom got pregnant and I had to make\n\t\tchoices.  You don't have a choice.\n\n\t\t\t\tQUINCY\n\t\tOkay...\n\n\tSilence, then.\n\n\t\t\t\tZEKE\n\t\tBesides, the sooner you go pro, the\n\t\tsooner you'll have to deal with the mess\n\t\tI'm dealing with.\n\n\t\t\t\tQUINCY\n\t\tWhat mess?\n\n\t\t\t\tZEKE\n\t\tthere's this thing out there.  This\n\t\tpaternity suit.\n\n\t\t\t\tQUINCY\n\t\tWhat?\n\n\t\t\t\tZEKE\n\t\tSome girl that's been hanging on at every\n\t\tparty.  now I'm supposed to be her baby's\n\t\tDaddy.\n\t\t\t(then)\n\t\tAnyway, I told your mom I wanted to be\n\t\tthe one who told you.\n\n\t\t\t\tQUINCY\n\t\tTell me what?\n\n\t\t\t\tZEKE\n\t\tI just told you.\n\n\t\t\t\tQUINCY\n\t\tI mean, it's not true, is it?\n\n\tZeke stares at his son.\n\n\t\t\t\tZEKE\n\t\tYou got the balls to ask me that?\n\n\tQuincy can't hold his father's look.  Zeke shakes his head,\n\thurt.\n\n\t\t\t\tQUINCY\n\t\tSorry.\n\n\t\t\t\tZEKE\n\t\tNo, you need to hear me say it, I'll say\n\t\tit.  It's not true.\n\n\tQuincy looks in his father's eyes, knows he's telling the\n\ttruth.\n\n\t\t\t\tQUINCY\n\t\tSo what are you gonna do?\n\n\t\t\t\tZEKE\n\t\tI want this thing to go to court, but my\n\t\tlawyer's telling me to settle.\n\n\t\t\t\tQUINCY\n\t\tWhy?\n\n\t\t\t\tZEKE\n\t\tA case like this could hang around for\n\t\tmonths and I'm up for this player\n\t\trelations job with the \"Clips.\"  This\n\t\tgets out, false or not, no one'll touch\n\t\tme.\n\n\t\t\t\tQUINCY\n\t\tWhat's Mom think?\n\n\t\t\t\tZEKE\n\t\tWe haven't exactly been living the fairy-\n\t\ttale life the past few years.  Something\n\t\tlike this happens, it either brings a\n\t\tfamily closer or pushes them further\n\t\tapart.  We'll just have to see how it\n\t\tplays out.\n\t\t\t(then)\n\t\tI'm giving her some space, couple\n\t\tdays...\n\n\tJust then, a COLLEGE STUDENT approaches.\n\n\t\t\t\tCOLLEGE STUDENT\n\t\tYo, Q-man, great game.\n\n\t\t\t\tQUINCY\n\t\tThanks.\n\n\tThe student holds out a piece of paper, without even a glance\n\tto Zeke.\n\n\t\t\t\tCOLLEGE STUDENT\n\t\tCan I get an autograph?\n\n\tQuincy nods, signs the guy's paper.  Zeke watches his son,\n\tthe rising star.\n\n\tEXT. MCCALL HOUSE - NIGHT\n\n\tThrough the windows, we see Quincy enter the house.  He\n\tglances around, then walks to the living room.  He sees his\n\tmom sitting outside by the pool, drink in hand, looking torn\n\tup.  He pulls open the sliding glass door.  Nona jumps, then\n\tsees Quincy.  She quickly puts her drink down.\n\n\t\t\t\tNONA\n\t\tYou scared me.\n\n\t\t\t\tQUINCY\n\t\tSorry.  You okay?\n\n\t\t\t\tNONA\n\t\tI'm fine.\n\n\tQuincy glances at her half-hidden glass.\n\n\t\t\t\tQUINCY\n\t\tLast time I remember you drinking was\n\t\twhen Marvin Gaye died.\n\n\tNo response from Nona.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tThis about Dad?\n\n\t\t\t\tNONA\n\t\tGuess he talked to you.\n\n\t\t\t\tQUINCY\n\t\tDon't sweat it, okay.  Sooner or later\n\t\tthe truth'll come out.\n\n\t\t\t\tNONA\n\t\t\t(beat)\n\t\tWhose truth are you talking about?\n\n\t\t\t\tQUINCY\n\t\tMom, we can't let something like this\n\t\tmess up the family.\n\n\tShe doesn't respond.  Quincy studies her.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tI mean, you believe him, right?\n\n\tNona sits silent, humiliated.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tMom?\n\n\t\t\t\tNONA\n\t\tJust...leave it alone.\n\n\t\t\t\tQUINCY\n\t\tThis is just about money, you know that.\n\n\t\t\t\tNONA\n\t\tQuincy, please...\n\n\t\t\t\tQUINCY\n\t\tI mean, how many times have you told me\n\t\tyourself to watch out for these ho's?\n\n\t\t\t\tNONA\n\t\tGuess I should have been telling your\n\t\tfather.\n\n\t\t\t\tQUINCY\n\t\tSo you're gonna take the word of some\n\t\ttrick over Pop's?  He wouldn't lie.\n\n\tNona grabs an envelope beside her and throws it at him.\n\n\tConfused, Quincy opens it.  HE PULLS OUT A COUPLE OF PHOTOS:\n\n\tZeke outside a party.  IN ONE PHOTO, his arm is around a\n\tyoung woman.  IN ANOTHER PHOTO, they KISS.  AND YET ANOTHER,\n\tthey climb into his car.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tWhat...what's this?\n\n\t\t\t\tNONA\n\t\tI hired somebody.  How pathetic is that?\n\t\tAfter all his late nights and \"meetings\"\n\t\tand I still needed proof.\n\n\tQuincy just stares at the photos.\n\n\t\t\t\tNONA (cont'd)\n\t\tI used to think I was lucky just to be\n\t\tmarried to Zeke McCall, but I'm too\n\t\ttired.\n\n\tQuincy looks stricken, but he moves to Nona, comforts her as\n\tshe cries...\n\t\n\t\n\t  EXT. TRACK - NIGHT\n\n\n\n\tMonica sits with a devastated Quincy, high up in the\n\tbleachers.  In the distance, the clock-tower glows 10:50.\n\n\t\t\t\tQUINCY\n\t\tDon't put your hands in your pockets,\n\t\thold your head up, always look a man in\n\t\tthe eye, and all the time I'm hanging on\n\t\this every word like he's God or\n\t\tsomething...\n\n\t\t\t\tMONICA\n\t\tI know he messed up, but that doesn't\n\t\tchange what he's been to you.\n\n\t\t\t\tQUINCY\n\t\tWhat has he been to me?  I mean, he\n\t\tlooked me in my face and lied like it was\n\t\tnothing.  Like it was easy.\n\t\t\t(then)\n\t\tAnd I'm standing there getting loud on my\n\t\tmom like she's the one with no sense...\n\n\t\t\t\tMONICA\n\t\tShe understands.\n\n\t\t\t\tQUINCY\n\t\tHe even had me wanting to play for the\n\t\t\"Clippers.\"  Man, how stupid am I.\n\n\t\t\t\tMONICA\n\t\tYou're not stupid.\n\n\t\t\t\tQUINCY\n\t\tI know a lot of brothers dog their wives,\n\t\tI just never thought my pops would do\n\t\tsome shit like this...\n\n\tMonica puts her arms around him.  They sit there, quiet.\n\tMonica glances up at the clock tower.  She reacts.  Quincy\n\tnotices.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tWhat?\n\n\t\t\t\tMONICA\n\t\tNothing.\n\t\t\t(beat)\n\t\tWhy don't we walk to my dorm?\n\n\t\t\t\tQUINCY\n\t\tI'm not up for running into anybody.\n\t\tLet's just kick it here, alright?\n\n\t\t\t\tMONICA\n\t\tI...can't.\n\n\t\t\t\tQUINCY\n\t\tWhy not?\n\n\t\t\t\tMONICA\n\t\tCoach has us on eleven o'clock curfew.\n\t\tIf I'm late, I don't suit up.\n\n\tQuincy looks at her, almost in shock.\n\n\t\t\t\tQUINCY\n\t\tDidn't realize you were watching the\n\t\tclock.\n\n\t\t\t\tMONICA\n\t\tI mean, I can stay a few more minutes.\n\n\t\t\t\tQUINCY\n\t\tNah.  Don't sweat it.\n\n\t\t\t\tMONICA\n\t\tQuincy...\n\n\t\t\t\tQUINCY\n\t\tFor real.  I should be alone, anyway.\n\n\tMonica reluctantly stands.\n\n\t\t\t\tMONICA\n\t\tWill you call me when you get in?\n\n\tQuincy nods.  Monica gives him a kiss.  Then she turns and\n\tcrosses away.\n\n\tINT. MONICA/SHAYLA'S DORM - NIGHT\n\n\tThe lights are off but Monica sits up in bed.  SHE WEARS\n\tBOXERS AND ONE OF QUINCY'S PRACTICE SHIRTS.\n\n\tShayla lies under her covers across the room.\n\n\t\t\t\tMONICA\n\t\tI shouldn't have left.\n\n\t\t\t\tSHAYLA\n\t\tGo to sleep.\n\n\t\t\t\tMONICA\n\t\tYou should have seen him, Shay...\n\n\t\t\t\tSHAYLA\n\t\tMon, Sidra's out for one game, and you\n\t\tgot the start.  But you get caught\n\t\tbreaking curfew and Coach is gonna send\n\t\tyour ass back to the bench.  You'll see\n\t\tyour man tomorrow.\n\n\tShayla's warning slowly sinks in.  Finally, Monica lays down.\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\n\tEXT. TRACK - NIGHT\n\n\tThe clock tower glows 12:30.  Quincy still sits in the\n\tbleachers.  Alone.  Tears fill his eyes as his world comes\n\tcrashing down...\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t  INT. CAMPUS GYM - LATE DAY\n\n\n\n\tUSC vs. Louisiana Tech.  The packed crowd is hyped.  Nathan\n\n\tsits by himself in the stands, excited.\n\n\n\n\tMonica sits on the bench with four of her teammates.  The\n\trest of the team is lined up in front of them, including\n\tSidra in street clothes.\n\n\t\t\t\tANNOUNCER\n\t\tAnd now the starting line-up for your\n\t\tWomen of Troy!  At center, a senior, Toni\n\t\tNoise!\n\n\tToni rises, jogs through the line of teammates to the court.\n\n\t\t\t\tANNOUNCER (cont'd)\n\t\tAt forward, a senior, Lisa Mason!\n\n\tLisa stands, skips through the line.\n\n\t\t\t\tANNOUNCER (cont'd)\n\t\tAt forward, a junior, Zvette Mitchell!\n\n\tZvette jumps up, bumps into each teammate as she moves down\n\tthe line.\n\n\t\t\t\tANNOUNCER (cont'd)\n\t\tAt guard, a freshman, Monica Wright!\n\n\tMonica takes a deep breath, then jogs through the line.  She\n\tgets to the middle of the floor and looks around with her\n\tgame face on.\n\n\t\t\t\tANNOUNCER (cont'd)\n\t\tAnd at guard, a sophomore, Sandra Perez!\n\n\tSandra jogs out and the rest of the team follows.  Everyone\n\tgathers in a tight circle with their arms around each other.\n\n\t\t\t\tTONI\n\t\tLook y'all, we got all these people here\n\t\tto see big-bad, La Tech.  We need to let\n\t\tthem know that this is our house.  So\n\t\teverybody better leave everything out on\n\t\tthat floor, you got that?  Ready?  One,\n\t\ttwo, three....\n\n\t\t\t\tTEAM\n\t\tTeam!\n\n\t\t\t\t\t\t\t\t  SMASH CUT TO:\n\n\tINT. SPORTS ARENA - LATE DAY\n\n\tA sellout crowd for the men's SC/Temple game.  And Quincy is\n\thaving the worst game of his life.\n\n\tHe drives down court on a fast break.  He ignores his two\n\topen teammates and puts up a three-pointer.  It hits nothing\n\tbut air.  The crowd boos.\n\n\tHumiliated, Quincy tries to steal the ball back and commits a\n\tstupid foul.  His teammates glare at him as they line up for\n\tfree throws.\n\n\tINT. CAMPUS GYM - CONTINUOUS\n\n\tMonica's game.  Late second half.  SC down two.\n\n\tMonica drives the lane, drawing two defenders.  She looks\n\tlike she's about to force up a shot, then suddenly whips up a\n\tpass to a wide-open Sandra at the three-point line.  Nothing\n\tbut net.  SC up one.\n\n\tCoach Miller claps intensely on the sideline.\n\n\t\t\t\tCOACH MILLER\n\t\tThat's it, that's it!\n\n\tTen seconds left.  Game on the line.  Monica tries to lob a\n\tpass inside to Toni.  The pass is knocked away and grabbed up\n\tby the opposing point guard.\n\n\tIt is a one-on-one between Monica and the guard.  The girl\n\tdrives hard for the winning hoop.  Monica races to the key\n\tand slides in front of her.  The guard goes up and slams into\n\tMonica.  Both crash to the floor as the ball drops through\n\tthe net and the buzzer goes off.\n\n\tA WHISTLE.  The two women stare up at the REFEREE from the\n\tfloor.  And then --\n\n\t\t\t\tREFEREE\n\t\tOffensive foul!  Charging!  No basket!\n\n\tMonica leaps up as the crowd goes crazy.  Toni grabs up\n\tMonica in a hug as their teammates celebrate around them.\n\n\tINT. SPORTS ARENA - CONTINUOUS\n\n\tQuincy drags himself to his bench, slumps down dejectedly, as\n\tthe Temple Owls celebrate their win around him.\n\n\tINT. LOCKER ROOM - DUSK\n\n\tThe female players continue to celebrate as they undress.\n\n\t\t\t\tMAEYEN\n\t\tShoot, you see that crowd?  We need to be\n\t\tplaying in the Sports Arena.\n\n\t\t\t\tKELLI\n\t\tHell yeah.\n\n\tThey give each other a pound.\n\n\tLisa looks at Monica, standing in her shorts and sports bra.\n\n\t\t\t\tLISA\n\t\tOh damn, Mon.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\t\t\t\tLISA\n\t\tI think ol' girl took out your chi-chis\n\t\twith that charge.\n\n\tThe women break into laughter.  Monica smiles.\n\n\t\t\t\tMONICA\n\t\tKiss my ass.\n\n\t\t\t\tSANDRA\n\t\tNah, I think she took that too.\n\n\t\t\t\tMONICA\n\t\tSandra, please, last time you chest-\n\t\tbumped me, it took you three tries.\n\n\tMore laughter.  Monica looks over at Toni, sitting quietly at\n\tthe bench.\n\n\t\t\t\tMONICA (cont'd)\n\t\tYo, T, why you so quiet?\n\n\t\t\t\tTONI\n\t\t\t(beat)\n\t\tI don't want to go play overseas.\n\n\t\t\t\tDORA\n\t\tI thought you were hyped about going to\n\t\tPortugal next year.\n\n\t\t\t\tTONI\n\t\tIt's never gonna be like this.  Playing\n\t\tin front of my family, hanging out with\n\t\tmy girls.  Probably not even a\n\t\tMcDonald's.\n\n\t\t\t\tSANDRA\n\t\tNah, there's always a McDonald's.\n\n\t\t\t\tSIDRA\n\t\tLeast you got an offer.  My agent's\n\t\tstill looking.\n\n\t\t\t\tCREE\n\t\t\t(to Lisa)\n\t\tWhat about you?\n\n\t\t\t\tLISA\n\t\t\t(beat)\n\t\tMaybe it'd be worth it if I knew some day\n\t\tI could come back here and play.  But for\n\t\tright now, it's law school.\n\n\t\t\t\tCOACH MILLER (O.S.)\n\t\tMonica.\n\n\tMonica turns, sees Coach Miller standing in her office\n\tdoorway.  She motions for her.  Monica heads over.  Sidra\n\twatches.\n\n\tINT. COACH MILLER'S OFFICE - SHORT TIME LATER\n\n\tTrophies, plaques and photos fill every empty space.\n\n\tCoach Miller sits behind her desk.  Monica stands before her.\n\n\t\t\t\tCOACH MILLER\n\t\tYou could've given up after you threw\n\t\tthat ball away.  But you kept your head\n\t\tand you showed real heart.\n\n\t\t\t\tMONICA\n\t\tThanks.\n\n\t\t\t\tCOACH MILLER\n\t\tWe've got our final games against Oregon\n\t\tand Oregon State and I want to shake\n\t\tthings up a bit, so I'm starting you at\n\t\tpoint again.\n\n\t\t\t\tMONICA\n\t\t\t(confused)\n\t\tI thought Sidra's ankle was okay for next\n\t\tgame.\n\n\t\t\t\tCOACH MILLER\n\t\tYou want the job or not?\n\n\tRealization finally hits.\n\n\t\t\t\tMONICA\n\t\tYeah.  Yes.\n\n\tMonica looks at Coach Miller completely thrown.\n\n\t\t\t\tCOACH MILLER\n\t\tWhat?\n\n\t\t\t\tMONICA\n\t\tIt's just...it seems like you're always\n\t\tyelling at me.\n\n\t\t\t\tCOACH MILLER\n\t\tYou think I'd go hoarse for a player with\n\t\tno potential?   When I ignore you, that's\n\t\twhen you worry.\n\t\t\t(then)\n\t\tGo get dressed.\n\n\tMonica nods, crosses out.\n\n\tINT. LOCKER ROOM - CONTINUOUS\n\n\tAs Monica walks back to her teammates, Coach Miller steps\n\tinto the doorway.\n\n\t\t\t\tCOACH MILLER\n\t\tSidra.\n\n\tSidra looks at Monica as she rises, crosses over.  Monica\n\tavoids her eyes as they pass.  Sidra enters the office and\n\tthe door closes.\n\n\t\t\t\tSHAYLA\n\t\tYo sis, what's going on?\n\n\tBeat, then Monica smiles.\n\n\t\t\t\t\t\t\t\t  SMASH CUT TO:\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t  INT. APARTMENT - NIGHT\n\n\n\n\tBlack folks pack the cramped houseparty, bumping to a phat\n\n\thip hop joint.\n\n\n\n\tMonica bounces through the throng.  A GIRL grabs her arm.\n\n\t\t\t\tGIRL'S VOICE\n\t\tYo, great game.\n\n\t\t\t\tMONICA\n\t\tThanks.\n\n\tAnother PARTY-GOER grabs her arm.\n\n\t\t\t\tPARTY-GOER\n\t\tGirl, you can play.\n\n\tMonica smiles wider.  She spots Reggie dancing in the crowd,\n\tmoves to him.\n\n\t\t\t\tMONICA\n\t\tReg.  You seen Quincy?\n\n\t\t\t\tREGGIE\n\t\tWhat's up, girl.\n\n\t\t\t\tMONICA\n\t\t\t(louder)\n\t\tDerek said Q was here.\n\n\t\t\t\tREGGIE\n\t\tWe'll roll through.\n\n\tMonica is suddenly pulled into a dance routine by Sandra and\n\tLisa.\n\n\tShe laughs, tires to move away, but they won't let her go.\n\tMonica gives in, grooves with them.\n\n\tANGLE ON:\n\n\tQuincy walks through the door with a half-empty forty in his\n\thand.  Girls immediately try to grab his attention from the\n\tdance floor, or stare him down from the sidelines.\n\n\tQuincy sees Monica on the dance floor.  He stands, watching\n\ther.  Takes a drink.  Monica finally looks over, sees him.\n\tShe smiles, crosses to him.\n\n\t\t\t\tMONICA\n\t\tHey.\n\n\t\t\t\tQUINCY\n\t\tWhat's up?\n\n\t\t\t\tMONICA\n\t\tI've been trying to find you all day.\n\n\t\t\t\tQUINCY\n\t\tHere I am.\n\n\tShe glances at the forty in his hand.\n\n\t\t\t\tMONICA\n\t\tSorry about your game.\n\n\t\t\t\tQUINCY\n\t\tIt happens, right...\n\n\tShayla suddenly grabs Monica from behind.\n\n\t\t\t\tSHAYLA\n\t\t\t(to Monica)\n\t\tWhat's up, superstar.\n\t\t\t(then, to Quincy)\n\t\tYour girl was on tonight.  She tell you?\n\n\t\t\t\tQUINCY\n\t\t\t(beat)\n\t\tI heard.\n\n\t\t\t\tSHAYLA\n\t\tShe also tell you she ganked the starting\n\t\tspot from Sidra?\n\n\tMonica looks at him for a reaction.\n\n\t\t\t\tQUINCY\n\t\tNah.\n\n\tHe downs the last of his forty.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tWhere's the keg at?\n\n\t\t\t\tSHAYLA\n\t\tBalcony.\n\n\tHe heads for the glass doors.  Monica and Shayla follow.\n\n\tEXT. BALCONY - CONTINUOUS\n\n\tReggie approaches the group.  Gives Quincy a nod.\n\n\t\t\t\tREGGIE\n\t\tWhat's up, dog?\n\t\t\t(to Shayla)\n\t\tHey, flyness.\n\n\t\t\t\tSHAYLA\n\t\tGet off the bra strap, Reggie, you're a\n\t\tho.\n\n\tHe laughs, then turns back to Quincy.\n\n\t\t\t\tREGGIE\n\t\tCoach is gonna kill us in practice\n\t\ttomorrow.  Might even pull his lips off\n\t\tyour dick, limp as your game was tonight.\n\n\tQuincy just looks at him.\n\n\t\t\t\tQUINCY\n\t\tThat's funny.\n\n\tMonica leans against Quincy, affectionately.\n\n\t\t\t\tMONICA\n\t\the's just playing, Q...\n\n\t\t\t\tQUINCY\n\t\tYou think for once we could talk about\n\t\tsomething besides basketball?\n\n\t\t\t\tSHAYLA\n\t\tSure.\n\n\t\t\t\tREGGIE\n\t\tWhatever's clever.\n\n\tSilence.  Reggie and Shayla crack up.  Quincy shakes his\n\thead, moves to the keg line.\n\n\t\t\t\tMONICA\n\t\tY'all need to quit.\n\n\tShe starts for Quincy\n\n\t\t\t\tSIDRA (O.S.)\n\t\tMonica.\n\n\tMonica looks over, sees Sidra standing in the doorway.  There\n\tis no escaping this confrontation.  She glances at Quincy,\n\tthen crosses over.  Quincy turns, sees her disappear back\n\tinside.\n\n\tINT. HOUSEPARTY - CONTINUOUS\n\n\t\t\t\tMONICA\n\t\tWhat's up?\n\n\t\t\t\tSIDRA\n\t\tJust wanted to say good game.\n\n\t\t\t\tMONICA\n\t\tBut?\n\n\t\t\t\tSIDRA\n\t\tNo buts.  Took a lot of heart to take\n\t\tthat charge.\n\n\t\t\t\tMONICA\n\t\tThanks.\n\n\t\t\t\tSIDRA\n\t\tBut that was a dumb-ass pass to Toni.\n\t\tTen seconds left, you run out the clock.\n\n\tMonica shakes her head.  An awkward silence.\n\n\t\t\t\tSIDRA (cont'd)\n\t\tI'd be lying if I said I wasn't pissed.\n\n\t\t\t\tMONICA\n\t\tI know.\n\n\t\t\t\tSIDRA\n\t\tJust one word of advice for next season.\n\n\t\t\t\tMONICA\n\t\tWhat's that?\n\n\t\t\t\tSIDRA\n\t\tNever let a freshman take your spot.\n\n\tSidra turns and walks away.\n\n\tEXT. BALCONY - CONTINUOUS\n\n\tQuincy takes one long drink from his cup.  KERRY, 20, and\n\tspandexed, stands directly in front of him, flirtatiously.\n\n\t\t\t\tKERRY\n\t\tExcuse me.\n\n\t\t\t\tQUINCY\n\t\tExcuse me.\n\n\tHe steps aside as she tries to work the keg.  Nothing comes\n\tout.  She nods at his cup, smiles.\n\n\t\t\t\tKERRY\n\t\tIf that's the last beer, you and I are\n\t\tsharing.\n\n\tShayla glances over as Quincy pumps the keg a couple of\n\ttimes.  Kerry hands him her cup and he starts filling it up.\n\n\t\t\t\tKERRY (cont'd)\n\t\tI like watching you play.  Number twenty-\n\t\ttwo.\n\n\t\t\t\tQUINCY\n\t\tGuess you didn't see the game.\n\n\tQuincy knows he should blow her off, but he's digging the\n\tattention.  He hands her back her cup.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tWhat's your name?\n\n\t\t\t\tKERRY\n\t\tKerry.\n\n\t\t\t\tQUINCY\n\t\tQ.\n\n\t\t\t\tKERRY\n\t\tI know.\n\n\tANGLE ON\n\n\tMonica looks over at Quincy and sees him talking to the\n\thoochie.  The girl looks too damn comfortable.  Monica moves\n\tback outside.\n\n\t\t\t\tKERRY (cont'd)\n\t\tI'll see you.  Q-man.\n\n\tShe swishes past Monica.  Shayla \"accidentally\" bumps her.\n\tKerry glares.\n\n\t\t\t\tMONICA\n\t\tWho was that?\n\n\t\t\t\tQUINCY\n\t\tNobody.\n\n\t\t\t\tMONICA\n\t\tWho's nobody?\n\n\t\t\t\tQUINCY\n\t\tLook, this party's whack.  You ready to\n\t\tgo?\n\n\t\t\t\tMONICA\n\t\tYou want to go talk?\n\n\t\t\t\tQUINCY\n\t\tNot really.\n\n\tHe leans in, kisses her drunkenly.  She pulls away.\n\n\t\t\t\tMONICA\n\t\tWe could finish what we were talking\n\t\tabout last night.\n\n\tQuincy kisses her again.\n\n\t\t\t\tMONICA (cont'd)\n\t\tQ...\n\t\t\t(pushing him off)\n\t\tQuincy, quit.  You're drunk.\n\n\tThey fall silent.\n\n\t\t\t\tQUINCY\n\t\tYou know what, I'm just gonna crash.\n\n\t\t\t\tMONICA\n\t\t\t(agitated)\n\t\tFine...Maybe I'll come by later.\n\n\t\t\t\tQUINCY\n\t\tNah.  I have curfew.\n\n\tHe starts to walk away, then stops.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tOh, by the way.  Congratulations.\n\n\tHe goes.  Monica stares after him.\n\t\n\t\n\t  INT. QUINCY/REGGIE'S SUITE - LIVING ROOM - LATER\n\n\tQuincy pushes through his front door, then stops short in his\n\tdoorway.  Zeke sits on the couch.\n\n\t\t\t\tQUINCY\n\t\tWhat are you doing here?\n\n\t\t\t\tZEKE\n\t\tYour door was unlocked.\n\n\t\t\t\tQUINCY\n\t\tStill is, so let yourself out.\n\n\t\t\t\tZEKE\n\t\tWe need to talk.\n\n\t\t\t\tQUINCY\n\t\tWe ain't got nothing to talk about.\n\n\t\t\t\tZEKE\n\t\tI messed up, okay, I know that.  But I\n\t\tain't that kid's father.\n\n\t\t\t\tQUINCY\n\t\tLucky kid.\n\n\t\t\t\tZEKE\n\t\tLook, I ain't saying it was right, but\n\t\tsometimes things happen.\n\n\t\t\t\tQUINCY\n\t\tAnd some things should never fucking\n\t\thappen!\n\n\t\t\t\tZEKE\n\t\tBoy, you're so perfect you can look down\n\t\ton me?\n\n\t\t\t\tQUINCY\n\t\tI ain't a damn liar.\n\n\t\t\t\tZEKE\n\t\tYour mom was real quick to show you those\n\t\tpictures, wasn't she?\n\t\tWell, she was nineteen when she got\n\t\tpregnant and don't get me wrong, you're\n\t\tthe best thing in my life, but she knew I\n\t\twasn't ready for no marriage.\n\n\t\t\t\tQUINCY\n\t\tSo now you're saying my mother trapped\n\t\tyou?\n\n\t\t\t\tZEKE\n\t\tI'm saying I handled my responsibilities\n\t\tlike a man.  But when you're in the NBA,\n\t\tyou pull into a city and there's a\n\t\thundred women waiting at the hotel.  And\n\t\tanother twenty that made it past security\n\t\ton your floor.  And the boldest one is\n\t\tstanding right at your door.  And after\n\t\tawhile, it just becomes part of the game.\n\t\t\t(then)\n\t\tI'm sorry I lied to you, I shouldn't\n\t\thave.  But I did it cause I love you.\n\n\tZeke looks at his son, meaning every word.  Quincy stares\n\tback, long and hard.\n\n\t\t\t\tQUINCY\n\t\tSince we're being honest, guess I should\n\t\ttell you.  I'm dropping out of school and\n\t\tgoing pro.\n\n\t\t\t\tZEKE\n\t\tWhat?\n\n\tQuincy just stares back.\n\n\t\t\t\tZEKE (cont'd)\n\t\tQuincy, you'd be making the biggest\n\t\tmistake of your life.\n\n\t\t\t\tQUINCY\n\t\t\t(sarcastic)\n\t\tFrom your mouth.\n\n\t\t\t\tZEKE\n\t\t\t(desperate)\n\t\tI know your mad at me, okay, but I can't\n\t\tlet you do this.\n\n\t\t\t\tQUINCY\n\t\tAlways thought \"can't\" wasn't in a man's\n\t\tvocabulary.\n\n\tZeke is taken aback by the hatred in his son's eyes.  He\n\tturns and without another word, exits.\n\n\tEXT. STREET - LATE NIGHT\n\n\tQuincy stands across the street from the houseparty, staring\n\tup at the balcony.  Monica leans against the railing,\n\tlaughing with a couple of teammates.  Quincy watches her,\n\tthen turns and walks away...\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t  EXT. CAMPUS GYM - LATE DAY\n\n\n\n\tSLOW MOTION.  Monica's eyes are on fire as she races an\n\n\tOregon player for a loose ball.  Both dive for it, slide\n\n\tacross the floor.  Monica grabs it up, screams for a time-out\n\tas her opponent tries to wrestle away the ball...\n\n\tEXT. QUINCY/REGGIE'S SUITE - DUSK\n\n\tMonica walks down the hall to Quincy's suite.  The window is\n\topen.  The sounds of Nintendo are heard.  She walks in\n\twithout knocking.\n\n\tINT. QUINCY/REGGIE'S SUITE - LIVING ROOM - CONTINUOUS\n\n\tReggie sits on the couch with a TEAMMATE, playing Nintendo's\n\t\"Duck Hunt\".\n\n\t\t\t\tMONICA\n\t\tHey, y'all.\n\n\tThey barely give her a nod.  Monica crosses into\n\n\tINT. QUINCY/REGGIE'S ROOM - CONTINUOUS\n\n\tQuincy stands at an ironing board, ironing a T-shirt.\n\n\t\t\t\tMONICA\n\t\tHey.\n\n\t\t\t\tQUINCY\n\t\tHey, what's up.\n\n\t\t\t\tMONICA\n\t\tYou weren't at my game.\n\n\t\t\t\tQUINCY\n\t\tYeah, sorry about that.  I had this\n\t\tmeeting with this guy.\n\n\tQuincy pulls on the T-shirt.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tYou win?\n\n\t\t\t\tMONICA\n\t\tYeah, I hit a three at the buzzer.\n\n\t\t\t\tQUINCY\n\t\tThe \"man\" again.\n\n\t\t\t\tMONICA\n\t\t\t(smiles)\n\t\tWoman...\n\n\tA knock at the front door.  Quincy exits.\n\n\tINT. LIVING ROOM - CONTINUOUS\n\n\tMonica follows, then stops short.  Kerry, the spandexed girl\n\tfrom the party, stands in the doorway.\n\n\t\t\t\tQUINCY\n\t\tHey, you.\n\n\t\t\t\tKERRY\n\t\tHi.\n\n\tQuincy gives her a hug.  Monica stares at him in disbelief.\n\tReggie and his teammate smack each other, \"Oh shit!\"\n\n\t\t\t\tQUINCY\n\t\tOh, Kerry, this is Monica.  Monica,\n\t\tKerry.\n\n\t\t\t\tMONICA\n\t\tWhat the hell's going on?\n\n\t\t\t\tQUINCY\n\t\tWe're going to get some food.\n\n\t\t\t\tMONICA\n\t\tAre you out of your mind?\n\n\t\t\t\tKERRY\n\t\tMaybe I should come back?\n\n\t\t\t\tMONICA\n\t\tNo.  You stay, I'll leave.\n\n\tShe storms out.\n\n\tEXT. WRIGHT HOUSE - DRIVEWAY - DUSK\n\n\tBAM!  Monica slams her car door.  Her face is a mask of anger\n\tand confusion.\n\n\tCamille exits the house, car keys in hand.  She sees her.\n\n\t\t\t\tCAMILLE\n\t\tMonica.  What are you doing here?\n\n\t\t\t\tMONICA\n\t\tDidn't know I needed a reason to come\n\t\thome.\n\n\t\t\t\tCAMILLE\n\t\tDon't be defensive.  I'm just surprised\n\t\tto see you.\n\n\t\t\t\tMONICA\n\t\tDad around?\n\n\t\t\t\tCAMILLE\n\t\tHe's still at the bank.\n\n\tMonica glowers.  Camille looks at her.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tEverything okay?\n\n\t\t\t\tMONICA\n\t\t\t(clearly not)\n\t\tYeah.\n\n\tCamille just nods, doesn't bother asking again.\n\n\t\t\t\tCAMILLE\n\t\tWell, I'm going to get dinner.\n\n\tShe pulls open her car door.  Beat, then...\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tIt's just a game.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\t\t\t\tCAMILLE\n\t\tWhenever you lose, you get this attitude.\n\t\tBut it's just a game.\n\n\tMonica rolls her eyes, as her mom leaves.\n\n\tEXT. DORMS - NIGHT\n\n\tQuincy sits on the wall outside of Monica's dorm, as Monica\n\tslowly makes her way up the walk.  She sees him, stops.\n\n\t\t\t\tQUINCY\n\t\tCan we talk?\n\n\t\t\t\tMONICA\n\t\tTalk to your new girlfriend.\n\n\t\t\t\tQUINCY\n\t\tI just took the ho to Burger King,\n\t\talright.\n\n\t\t\t\tMONICA\n\t\tCheap date.\n\n\t\t\t\tQUINCY\n\t\tLeast she had time for me.\n\n\t\t\t\tMONICA\n\t\tSo you fucked around to prove a point!\n\n\t\t\t\tQUINCY\n\t\tI just said I didn't fuck around.  But\n\t\tyou got your head so far up your ass it\n\t\ttook a cheap date for you to notice me.\n\n\t\t\t\tMONICA\n\t\tWhat, \"Q-man\", did I forget to kiss your\n\t\tass like everybody else?\n\n\t\t\t\tQUINCY\n\t\tYou forgot to be there.\n\n\t\t\t\tMONICA\n\t\tThat night you wanted to talk about your\n\t\tDad I had a curfew.  What was I supposed\n\t\tto do?\n\n\t\t\t\tQUINCY\n\t\tStay!\n\n\t\t\t\tMONICA\n\t\tIf I stayed, I wouldn't be starting!\n\n\t\t\t\tQUINCY\n\t\tLeast you got your priorities straight.\n\n\t\t\t\tMONICA\n\t\tI never asked you to choose.\n\n\t\t\t\tQUINCY\n\t\tNever had to.\n\n\t\t\t\tMONICA\n\t\tI'm a ballplayer.  If anyone knows what\n\t\tthat means it should be you.\n\n\t\t\t\tQUINCY\n\t\tWell, if all you care about is\n\t\tbasketball, why you fucking me?  Go fuck\n\t\tDick Vitale.\n\n\tMonica punches the shit out of Quincy, then pushes past him.\n\tQuincy grabs her arm, stopping her.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tHold up.  I'm sorry, alright.\n\n\tThey stand, silent.  Trying to come down from their anger.\n\n\t\t\t\tMONICA\n\t\tHow do I know next time you're feeling\n\t\tneglected or whatever, you're not going\n\t\tto run around on me?  If we're going to\n\t\tbe together I have to be able to trust\n\t\tyou.\n\n\t\t\t\tQUINCY\n\t\tI'm not asking for us to be together.\n\n\tMonica flinches in shock.\n\n\t\t\t\tMONICA\n\t\tWhat?\n\n\t\t\t\tQUINCY\n\t\tI'm going through a lot of shit right\n\t\tnow, more than you have time for.\n\n\t\t\t\tMONICA\n\t\tHow are you going to tell me what I have\n\t\ttime for?  I mean, whatever I did...we\n\t\tcan fix this.\n\n\t\t\t\tQUINCY\n\t\tI don't think so.\n\n\t\t\t\tMONICA\n\t\tYou don't think so?\n\n\t\t\t\tQUINCY\n\t\tLook, I'm entering the draft.\n\n\t\t\t\tMONICA\n\t\tYou're what?\n\n\t\t\t\tQUINCY\n\t\tI decided to go pro.  And who knows where\n\t\tI'll end up, you know?\n\n\tMonica's heart is sinking fast.\n\n\t\t\t\tMONICA\n\t\tWhen did you decide all this?\n\n\t\t\t\tQUINCY\n\t\tFew days ago.\n\n\t\t\t\tMONICA\n\t\tSo that's it, just forget about us?\n\n\t\t\t\tQUINCY\n\t\tDamnitt, Monica.  This ain't about us\n\t\tanymore, it's about me.\n\n\tMonica is crushed.  Beat as, Quincy struggles to stay cold.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tBut, you know, I'd still like us to be\n\t\tfriends.\n\n\t\t\t\tMONICA\n\t\tFriends.\n\n\tShe fights back tears.  Quincy has to look away.  Monica\n\tcan't respond.\n\n\t\t\t\tQUINCY\n\t\tSo...I guess I'll see you around.\n\n\t\t\t\tMONICA\n\t\tUh huh.\n\n\tBeat, then Quincy turns and walks away.  Monica tries to\n\tfight her tears but her pain, hurt and confusion are too\n\tmuch.  Finally, she gives in, and the tears fall.\n\n\t\t\t\t\t\t\t\t FADE TO BLACK.\n\n\tFOOTAGE.  Press conference.  Magic sits beside his wife\n\tCookie.  He shocks the world as he announces his retirement\n\tfrom basketball.\n\t\n\t  FADE IN:\n\n\n\n\tTITLE CARD: \"FOURTH QUARTER\" then \"1993\"\n\n\n\n\tESTABLISHING SHOTS OF SPAIN\n\n\n\n\tMadrid, Pampolona, the running of the bulls, old-world\n\tarchitecture.\n\n\tFinally, we rest on a large billboard, a photo of Monica in a\n\tbasketball uniform, drinking a Spanish soft-drink.\n\n\tEXT. STREETS OF SPAIN - LATE DAY\n\n\tMonica jogs down the congested cobble-stone street, a sports\n\tbag over her shoulder.  She is TWENTY-THREE.  Half-assed\n\tbraids frame her matured features.\n\n\tShe passes store fronts, street vendors, and dodges\n\tpedestrians, as she makes her way toward a large, older\n\tarena.\n\n\tEXT. ARENA - CONTINUOUS\n\n\tAn excited crowd jockeys for position at the front doors.\n\tAbove them, a huge banner reads \"Campeonato de Europeo\".\n\t(European Championships\".)\n\n\tAs Monica heads for the back entrance, a cheer goes up from a\n\tlarge contingent in the crowd.  Monica smiles, waves back.\n\tTWO LITTLE GIRLS break from line, run to her.\n\n\t\t\t\tLITTLE GIRLS\n\t\tBaloncesto!  Balencesto!  (Basketball!\n\t\tBasketball!)\n\n\t\t\t\tMONICA\n\t\tOye.\n\n\tThey giggle, hold out a piece of paper and a pencil.\n\n\t\t\t\tLITTLE GIRLS\n\t\tAutografo.\n\n\tAs Monica signs her autograph, a tall woman carrying a\n\tmatching sports bag approaches.  She is LUISA, Spanish, 33.\n\n\t\t\t\tLUISA\n\t\t\t(thick Spanish accent)\n\t\tMonica.  What is up?\n\n\t\t\t\tMONICA\n\t\tOye, Luisa.\n\n\tMonica hands the girls her autograph and they run off.\n\n\t\t\t\tLUISA\n\t\tLarge game, no?\n\n\t\t\t\tMONICA\n\t\tSi.  Large game.\n\n\tThey duck into the arena.\n\n\tINT. ARENA - LOCKER ROOM - LATE DAY\n\n\tPaint peels off the walls.  Windows are broken overhead.\n\n\tMonica sits alone at her locker, taping her own ankles.  Her\n\tTEN TEAMMATES, all from Spain, sit on the surrounding\n\tbenches, talking and joking among themselves in Spanish.\n\tMonica is clearly an outsider.\n\n\tCOACH PARRA, Spanish, late 40's, enters.\n\n\t\t\t\tCOACH PARRA\n\t\tSilenco!\n\n\tThe women immediately stop talking.  COACH PARRA gives an\n\tanimated, impassioned speech in Spanish.  Monica doesn't\n\tunderstand a word, just continues taping her ankles.\n\n\tCoach Parra finishes and the women clap, pumped up. Monica\n\tturns to Luisa, seated next to her on the bench.\n\n\t\t\t\tMONICA\n\t\tWhat did he say?\n\n\t\t\t\tLUISA\n\t\tHe say to give the ball to you.\n\n\tINT. ARENA - NIGHT\n\n\tThe arena is PACKED with a raucous European crowd, chanting\n\tand waving signs - the love their women's basketball.\n\n\tMonica walks onto the floor, tucking her jersey into her\n\tshorts.  The uniforms are old-style - polyester and tight.\n\tHer club's name is stitched on the front, \"GODELLA\".\n\n\tAs she hits center court, a smile suddenly breaks through her\n\tgame face.  Standing opposite her, playing for the opposing\n\tItalian club is Sidra, HER RIVAL FROM USC.\n\n\t\t\t\tSIDRA\n\t\tWell, what do you know.\n\n\t\t\t\tMONICA\n\t\tWhat's up, Sidra.\n\n\t\t\t\tSIDRA\n\t\tI'm gonna love winning this championship\n\t\tin your house.\n\n\t\t\t\tMONICA\n\t\tHow do you say \"you're dreaming\" in\n\t\tItalian?\n\n\tThey move into position.  The ball is tossed up.  Italy winds\n\tthe tip and the ball is passed to Sidra.\n\n\tMonica hounds her as she brings up the ball.  Sidra shoves\n\ther off and to the floor, and scores.  No whistle.  Women's\n\tpro ball is at a whole other level.  Bigger, better, tougher.\n\n\tThe ball is passed in to Monica.  She drives down court, goes\n\tup for a lay up.  An Italian player shoves Monica in mid-air,\n\ttaking out her legs.  Monica crashes on the hardwood.\n\n\tA whistle.  Monica lays still for a moment, then pushes\n\therself up and walks to the free-throw line without a word.\n\tWithout emotion.\n\n\tINT. SPAIN - NIGHTCLUB - LATE NIGHT\n\n\tA huge crowd dances fervently to the live Spanish music.  In\n\tthe middle of the floor, the Spanish players are the life of\n\tthe party.\n\n\tIn a corner, Monica sits with Sidra, drinking and watching\n\tthe festivities.  A large trophy sits on the table.\n\n\t\t\t\tSIDRA\n\t\tCan you take that damn thing off the\n\t\ttable.\n\n\t\t\t\tMONICA\n\t\tYou mean my championship trophy?  My bad.\n\n\tMonica sets it down in the seat next to her, puts an arm\n\taround it.  Sidra shakes her head.\n\n\t\t\t\tSIDRA\n\t\tStill a cocky bitch.\n\n\tMonica laughs.  She downs her drink, motions to the waiter.\n\n\t\t\t\tMONICA\n\t\tUno mas, por favor.\n\n\tThe waiter nods.\n\n\t\t\t\tMONICA (cont'd)\n\t\tLast I heard, you were playing in Sweden.\n\n\t\t\t\tSIDRA\n\t\tYeah, four years ago.  They had me\n\t\tstaying in this tiny-ass town with like\n\t\tfifty people.  I'm not playing, there was\n\t\tabout a thousand goats running around,\n\t\tand it gets dark at four o'clock.  Then\n\t\tthe whack club I'm on loses three games\n\t\tin a row and I get blamed.  So they fire\n\t\tme.\n\n\t\t\t\tMONICA\n\t\tJust like that?\n\n\t\t\t\tSIDRA\n\t\tYup.  So I've been playing with this\n\t\tItalian club the last three years.\n\n\t\t\t\tMONICA\n\t\tHow's that been?\n\n\t\t\t\tSIDRA\n\t\tIt's better.  Even though the whole first\n\t\tseason my teammates didn't pass to me\n\t\tcause they were mad \"The American\" was\n\t\tmaking more money.\n\t\t\t(smiles)\n\t\tI led the team in rebounds cause it was\n\t\tthe only way I could touch the damn ball.\n\n\tMonica laughs as the waiter brings her drink.  She tries to\n\tpay, but he just shakes his head, crosses away.\n\n\t\t\t\tSIDRA (cont'd)\n\t\tMost of us don't win championships our\n\t\tfirst year overseas.\n\n\t\t\t\tMONICA\n\t\tPlease, I went through the same drama as\n\t\teverybody else.  I mean, the first four\n\t\tmonths, only person I could talk to was\n\t\tthis chick Luisa, who knew like ten words\n\t\tof English from watching old \"Dif'rent\n\t\tStrokes\" reruns.  Swear to God, I had to\n\t\ttell her if she said, \"What you talking\n\t\tbout, Willis?\" one more time, I was\n\t\tgonna kick her ass.\n\n\tSidra laughs.  They watch the madness out on the dance floor.\n\n\t\t\t\tSIDRA\n\t\tSo what are these Spanish guys like?\n\n\t\t\t\tMONICA\n\t\tI wouldn't know.\n\n\t\t\t\tSIDRA\n\t\tWhat?  You've been over here seven months\n\t\tand you ain't tapped anything?\n\n\t\t\t\tMONICA\n\t\tJust not my type, I guess.\n\n\t\t\t\tSIDRA\n\t\tShoot, Italian boys love them some black\n\t\twomen.  They can't get enough of me.\n\n\tMonica smiles.\n\n\t\t\t\tMONICA\n\t\tYou ever think about going back?\n\n\t\t\t\tSIDRA\n\t\tSometimes.  But what's the alternative,\n\t\tnot playing?  You remember big Toni?\n\t\t\t(off Monica's nod)\n\t\tShe quit last year, now she's working at\n\t\tsome bookstore.  I mean, look at us.\n\t\tThey treat us like we're Hollywood stars\n\t\tover here.  We just played in the\n\t\tchampionship game.  It doesn't get much\n\t\tsweeter than this.\n\n\tMonica takes this in.  Her eyes do not reflect someone on top\n\tof the world.  She takes a long drink.\n\n\tINT. SPAIN - MONICA'S APARTMENT - LATE NIGHT\n\n\tA small, sparse, one-bedroom.  Sam, Diane and the rest of the\n\tgang from \"Cheers\" fill the small TV screen that flickers in\n\tthe darkness.  Their dialogue is dubbed in Spanish.\n\n\tMonica sits on the floor, braiding her hair.\n\n\tSHE WEARS BOXERS AND QUINCY'S OLD PRACTICE SHIRT.  AFTER FIVE\n\tYEARS, IT IS WELL-WORN.\n\n\tFeelings of loneliness threaten to swallow her whole.  She\n\tlooks out her window and sees her billboard, looming in the\n\tdistance.  She just stares.\n\t\n\t\n\t  INT. LOS ANGELES FORUM - NIGHT\n\n\n\n\tThe crowd erupts as a Laker player dunks the ball on a fast\n\n\tbreak.\n\n\n\n\tANGLE ON\n\n\n\n\tLaker announcers CHICK HEARN and STU LANTZ.\n\n\n\n\t\t\t\tCHICK HEARN\n\n\t\tStu, this game is in the refrigerator.\n\t\tThe door is closed, the lights are out,\n\t\tthe butter's hard and the Jell-Oooooo's\n\t\tjigglin'.\n\n\t\t\t\tSTU LANTZ\n\t\tAnd here come the subs.\n\n\tANGLE ON\n\n\tQuincy pulls off his sweats and jogs onto the court with the\n\trest of the subs.  He is twenty-three, a man.  His goatee and\n\ttired eyes make him look older.  HE NOW WEARS NUMBER TWENTY-\n\tONE.\n\n\t\t\t\tSTU LANTZ (cont'd) (V.O.)\n\t\tIt's good to see these guys get a little\n\t\tplaying time.  And the fans love it.\n\n\tQuincy immediately gets a pass in the corner.  He puts up a\n\tquick three and it banks hard off the rim.\n\n\tANGLE ON\n\n\tChick and Stu.\n\n\t\t\t\tCHICK HEARN\n\t\tThree-pointer is off for the kid from\n\t\tSC.  Came out after his freshman year,\n\t\tnow in his fifth year with the league.\n\n\t\t\t\tSTU LANTZ\n\t\tThe son of Zeke McCall, played twelve\n\t\tyears with the Clippers.\n\n\t\t\t\tCHICK HEARN\n\t\t\t(nods)\n\t\tPretty good player.  The kid's moved\n\t\taround quite a bit, but he's hoping to\n\t\tfinally have a home with the Lakers.\n\n\tANGLE ON\n\n\tQuincy steals the ball, has nothing but open court ahead of\n\thim.\n\n\t\t\t\tCHICK HEARN (cont'd) (V.O.)\n\t\tWatch out, folks, it's showtime.\n\n\tQuincy takes off from the hash-mark and throws down a monster\n\tjam.  He swings high off the rim.  Too high.  His hand slips\n\tand he crashes to the floor.  His knee twists at a sickening\n\tangle.\n\n\tThe dwindling crowd gasps as Quincy clutches his left knee,\n\twrithing in pain.\n\n\tINT. DANIEL FREEMAN HOSPITAL - HALLWAY - LATE NIGHT\n\n\tZeke walks down the corridor, checking room numbers.  He is\n\tforty-five now.  His slight paunch as become a roll.\n\n\tHe sees Nona exiting a room, with an empty water pitcher in\n\thand.  Her hair is in locks.\n\n\t\t\t\tZEKE\n\t\tNona.\n\n\tNona looks over.  Her eyes narrow.\n\n\t\t\t\tZEKE (cont'd)\n\t\tHow's he doing?\n\n\t\t\t\tNONA\n\t\tNot great.\n\n\t\t\t\tZEKE\n\t\tWhat's that, not great?\n\n\t\t\t\tNONA\n\t\tThe doctor'll be back in a minute.\n\n\t\t\t\tZEKE\n\t\tNona, please.\n\n\t\t\t\tNONA\n\t\tHe tore his ACL.\n\n\tZeke's shoulders slump.  Then he looks back at her.\n\n\t\t\t\tZEKE\n\t\tAlmost didn't recognize you with your\n\t\thair like that.  How you been?\n\n\t\t\t\tNONA\n\t\tHappy.  And he won't want to see you.\n\n\tNona walks over to a MAN standing nearby.  He puts an arm\n\taround her and they move down the hall.  Zeke watches for a\n\tbeat, then pulls open Quincy's door, steps inside.\n\n\tINT. QUINCY'S HOSPITAL ROOM - CONTINUOUS\n\n\tQuincy lays in the bed.  His knee is bandaged and propped up\n\tby pillows.  He stares out the window.\n\n\t\t\t\tZEKE\n\t\tHey, son.\n\n\tQuincy turns, sees his father.  He turns back to the window.\n\n\t\t\t\tZEKE (cont'd)\n\t\tWell, you made SportsCenter.\n\n\t\t\t\tQUINCY\n\t\tWhat do you want?\n\n\t\t\t\tZEKE\n\t\tCame by to check on you.\n\n\t\t\t\tQUINCY\n\t\tAfter five years.\n\n\t\t\t\tZEKE\n\t\tDon't remember that being my fault.\n\t\tSeems like you divorced me same time as\n\t\tyour mom.\n\n\t\t\t\tQUINCY\n\t\tLook, I'm busy.\n\n\t\t\t\tZEKE\n\t\tI can see that.  I know things look\n\t\tpretty bleak right now, but you can't get\n\t\tdown on yourself.\n\n\t\t\t\tQUINCY\n\t\tI stopped taking your advice a long time\n\t\tago, or did you forget?\n\n\t\t\t\tZEKE\n\t\tNo.\n\n\t\t\t\tQUINCY\n\t\tGood.\n\n\t\t\t\tZEKE\n\t\tQuincy.  I know you left school early to\n\t\tthrow your middle finger up at me.\n\n\t\t\t\tQUINCY\n\t\tAnd now I'm paying for it, right?  That\n\t\twhat this is about?  \"I told you so?\"\n\n\t\t\t\tZEKE\n\t\tYou want me to fuck off?\n\n\t\t\t\tQUINCY\n\t\tYeah.\n\n\t\t\t\tZEKE\n\t\tFine, I'll fuck off, but not til I say\n\t\tsomething.\n\n\tSilence.  Then.\n\n\t\t\t\tZEKE (cont'd)\n\t\tYou're a better ballplayer than I ever\n\t\twas.  But you got a lot of other things\n\t\tgoing for you.  You're smart.  I always\n\t\tfelt...I always knew that you could do\n\t\tanything you wanted.  You want to be a\n\t\tballplayer, be a ballplayer.  Just know\n\t\tyou ain't like everybody else on that\n\t\tcourt.  You ain't like I was.  You got\n\t\toptions.  That's all I ever tried to show\n\t\tyou.\n\n\t\t\t\tQUINCY\n\t\tYou're still trying to tell me what I\n\t\tshould and shouldn't do.  How come you\n\t\tcouldn't be the man you kept trying to\n\t\tmake me?\n\n\tZeke stares at his son, wishing he could satisfy him with an\n\tanswer.\n\n\t\t\t\tZEKE\n\t\tI just couldn't\n\n\tWith nothing left to say, Zeke pulls open the door and\n\tleaves.  Quincy stares at the door long after it closes.\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t  INT. QUINCY'S HOSPITAL ROOM - DAY\n\n\n\n\tA NURSE enters, carrying a bouquet of flowers.  She moves\n\n\tpast the empty bed, puts them on a table already overflowing\n\n\twith flowers.  She pulls open the blinds and light floods the\n\troom.  She crosses back out.\n\n\tA toilet flush.  Beat, then Quincy slowly hops out of the\n\tbathroom, scratching his bare ass through the opening of his\n\tgown.\n\n\t\t\t\tVOICE (O.S.)\n\t\tAnd I thought this was gonna be awkward.\n\n\tQuincy whips around and is shocked to see Monica standing\n\tthere, laughing.  She has clearly made an effort with her\n\tappearance.\n\n\t\t\t\tQUINCY\n\t\tMonica?\n\n\tHe stumbles.  Monica quickly goes to him, catches his arm\n\tbefore he falls.\n\n\t\t\t\tMONICA\n\t\tI'm sorry.\n\n\tQuincy stares at her, completely thrown.  It's been five\n\tyears.  An awkward beat.\n\n\t\t\t\tMONICA (cont'd)\n\t\tSo, how you doing?\n\n\t\t\t\tQUINCY\n\t\tAlright.  I heard you were in Spain.\n\n\t\t\t\tMONICA\n\t\tI was.\n\t\t\t(smiling)\n\t\tI see your peach fuzz finally grew in.\n\n\tQuincy rubs his goatee self-consciously.\n\n\t\t\t\tQUINCY\n\t\tJust something I'm trying.\n\n\t\t\t\tMONICA\n\t\tNo, it looks good.  I mean, it's cool.\n\n\t\t\t\tQUINCY\n\t\tThanks.\n\n\tQuincy tries to adjust his footing and flinches in pain.\n\n\t\t\t\tMONICA\n\t\tShouldn't you be lying down, or...\n\n\t\t\t\tQUINCY\n\t\tI'm alright.  But you can sit.\n\n\t\t\t\tMONICA\n\t\tI'm fine.  My dad said you tore your ACL.\n\n\t\t\t\tQUINCY\n\t\tYup.\n\n\t\t\t\tMONICA\n\t\tWhat are the doctors saying?\n\n\t\t\t\tQUINCY\n\t\t\t(shrugs)\n\t\tA lot of things.  All I know is I'll be\n\t\tback in six months.\n\n\t\t\t\tMONICA\n\t\tI thought a torn ACL was ten to twelve.\n\n\t\t\t\tQUINCY\n\t\tNot for Quincy McCall.\n\n\t\t\t\tMONICA\n\t\tI forgot, \"Q-man.\"\n\n\tAn awkward beat.\n\n\t\t\t\tQUINCY\n\t\tSo, how's pro-ball, Europe?\n\n\t\t\t\tMONICA\n\t\tWe won the championship.\n\n\t\t\t\tQUINCY\n\t\tStill working on being the first girl in\n\t\tthe NBA?\n\n\t\t\t\tMONICA\n\t\tWell, I tried sneaking in after college,\n\t\tbut they found breasts during my\n\t\tphysical.\n\n\t\t\t\tQUINCY\n\t\tFunny.  I never did.\n\n\t\t\t\tMONICA\n\t\tKiss my ass.\n\n\tMonica cracks up.  Quincy laughs with her.\n\n\t\t\t\tMONICA (cont'd)\n\t\tI can't believe it's been five years.\n\n\tQuincy nods.\n\n\t\t\t\tQUINCY\n\t\tTried calling you a couple times.\n\n\t\t\t\tMONICA\n\t\tOh yeah?\n\n\t\t\t\tQUINCY\n\t\tWanted to give you props on making First\n\t\tTeam All-American.  And then when Magic\n\t\tretired, I tried calling you again.\n\n\t\t\t\tMONICA\n\t\t\t(lying)\n\t\tMust have been my cheap-ass answering\n\t\tmachine.  It was always messing up.\n\n\t\t\t\tQUINCY\n\t\tFigured it was something like that.\n\n\tThey look at each other.  The moment is building.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tSo, when do you go back?\n\n\t\t\t\tMONICA\n\t\tActually, I don't...\n\n\t\t\t\tQUINCY\n\t\tWhat do you mean?\n\n\t\t\t\tMONICA\n\t\tI'm tired of playing overseas.  Thinking\n\t\tabout giving it a rest for awhile.\n\n\t\t\t\tQUINCY\n\t\t\t(completely thrown)\n\t\tA rest?\n\n\t\t\t\tMONICA\n\t\tYeah.  Basketball just, isn't fun\n\t\tanymore.  You know?\n\n\t\t\t\tQUINCY\n\t\tNo.\n\n\tHe stares at her.  Into her.\n\n\t\t\t\tFEMALE VOICE (O.S.)\n\t\tQuincy!\n\n\tQuincy and Monica turn, as KYRA KESSLER, black, 26 and\n\tbeautiful, rushes into the room.  She wears a flight\n\tattendant's uniform.  She goes to Quincy, gives him a kiss.\n\tMonica reacts.\n\n\t\t\t\tKYRA\n\t\tI'm so sorry.  No one would switch\n\t\tflights with me.\n\n\t\t\t\tQUINCY\n\t\tIt's okay.\n\n\t\t\t\tKYRA\n\t\tWhy are you up?  Get in bed.\n\n\tShe takes Quincy's arm, moves him to the bed.  Monica\n\twatches.\n\n\t\t\t\tKYRA (cont'd)\n\t\tTell me you're going to be okay.\n\n\t\t\t\tQUINCY\n\t\tI'm gonna be okay.\n\n\tKyra relaxes.  Then she glances over at Monica.\n\n\t\t\t\tKYRA\n\t\tHello.\n\n\t\t\t\tQUINCY\n\t\tKyra, this is Monica.  She, uh...\n\n\t\t\t\tKYRA\n\t\t\t(recognizing)\n\t\tMonica.  You grew up together, right?\n\t\tQuincy's told me about you.\n\n\tMonica smiles awkwardly.\n\n\t\t\t\tQUINCY\n\t\tThis is Kyra.  My fiance.\n\n\tThe shock hits too quick to cover.  But Monica tries.\n\n\t\t\t\tMONICA\n\t\tFiance.  Wow.  Congratulations.\n\n\t\t\t\tKYRA\n\t\tThank you.\n\n\t\t\t\tMONICA\n\t\tI didn't know.  Wow.  That's great.\n\t\t\t(then)\n\t\tWell...I should go.\n\n\t\t\t\tQUINCY\n\t\tIt means a lot that you came by.\n\n\t\t\t\tKYRA\n\t\tYes, we appreciate that.\n\n\t\t\t\tMONICA\n\t\tYeah, and Quincy, good luck with your\n\t\tknee, and everything.\n\n\t\t\t\tQUINCY\n\t\tThanks.\n\n\tMonica forces one last smile, pulls open the door and leaves.\n\n\tINT. HALLWAY - MOMENTS LATER\n\n\tMonica walks down the hall, shell-shocked.\n\t\n\t\n\t  INT. WRIGHT HOUSE - KITCHEN - LATE DAY\n\n\n\n\tCamille moves between the counter and the stove, whipping up\n\n\ta couple pecan pies.  Monica enters.\n\n\n\n\t\t\t\tMONICA\n\n\t\tHey.\n\n\n\n\t\t\t\tCAMILLE\n\t\tHi.\n\n\t\t\t\tMONICA\n\t\tNeed any help?\n\n\t\t\t\tCAMILLE\n\t\tI can manage.\n\n\tMonica nods and moves to the barstool.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tYour sister's bringing the baby over.\n\t\tYou should try to be here.\n\n\t\t\t\tMONICA\n\t\tYeah.  Can't wait to see him\n\t\t\t(she falls silent, then)\n\t\tI just saw Quincy.\n\n\t\t\t\tCAMILLE\n\t\tHow is he?\n\n\t\t\t\tMONICA\n\t\tEngaged.\n\n\t\t\t\tCAMILLE\n\t\tTo that stewardess?\n\n\t\t\t\tMONICA\n\t\tYeah, you met her?\n\n\t\t\t\tCAMILLE\n\t\tHis mother had a cookout a few weeks ago.\n\t\tHe could do a lot better if you ask me.\n\n\t\t\t\tMONICA\n\t\tMaybe she is.\n\n\tCamille looks up, studies Monica for a moment.\n\n\t\t\t\tCAMILLE\n\t\tI thought you were over him.\n\n\tMonica shrugs.\n\n\t\t\t\tMONICA\n\t\tSo what do I do?\n\n\t\t\t\tCAMILLE\n\t\tFind out where they're registered and\n\t\tsend them a gift.\n\n\t\t\t\tMONICA\n\t\t\t(disgusted)\n\t\tWhatever.\n\n\t\t\t\tCAMILLE\n\t\tYou didn't want my opinion in the first\n\t\tplace, so why even ask?\n\n\t\t\t\tMONICA\n\t\tI asked but why does it always have to be\n\t\tso damn prissy.\n\n\t\t\t\tCAMILLE\n\t\tDon't curse.\n\n\t\t\t\tMONICA\n\t\tThere you go.\n\n\t\t\t\tCAMILLE\n\t\tWhat do you want me to tell you, Monica,\n\t\tto go beat that girl up?  To go have sex\n\t\twith him?  I'm not going to do that.\n\t\tYes, I believe thinking of other people\n\t\tis important and yes I'd rather bake a\n\t\tpie than shoot a dumb jump shot.  If that\n\t\tmakes me too \"prissy\" for you, too bad.\n\n\tMonica stares at her mother.  There's no going back.\n\n\t\t\t\tMONICA\n\t\tSo that's why we can't get along?\n\t\tBecause I'd rather shoot a \"dumb\" jump\n\t\tshot?\n\n\t\t\t\tCAMILLE\n\t\tYou're the one always turning your nose\n\t\tup at me.\n\n\t\t\t\tMONICA\n\t\tNo I don't.\n\n\t\t\t\tCAMILLE\n\t\tChild, please.  Ever since you were\n\t\tlittle you thought you were too good for\n\t\tanything I had to say.\n\n\t\t\t\tMONICA\n\t\tI wasn't Lena.  I didn't care about nail\n\t\tpolish or lip gloss or sneaking a spray\n\t\tof your perfume.\n\n\t\t\t\tCAMILLE\n\t\tWhat was so wrong with wanting to teach\n\t\tyou the things I knew could help you?\n\n\t\t\t\tMONICA\n\t\tBecause you're pushing me to be something\n\t\tI'm not.\n\n\t\t\t\tCAMILLE\n\t\tSo you're angry with me because you're\n\t\tstanding here with your hair combed and\n\t\twearing perfume?\n\n\tMonica is busted.  It takes her a moment to come back.\n\n\t\t\t\tMONICA\n\t\tI'm angry because I want a mother, not\n\t\tMartha Stewart.\n\n\t\t\t\tCAMILLE\n\t\tOh, yes.  The superstar female athlete\n\t\twhose mother is nothing but a housewife.\n\n\t\t\t\tMONICA\n\t\tThat's not it.\n\n\t\t\t\tCAMILLE\n\t\tDon't tell me you aren't ashamed of that\n\t\tbecause I know.\n\n\tMonica stares at her mother.\n\n\t\t\t\tMONICA\n\t\tI remember when I was eight years old,\n\t\tyou spent like four hours cooking up this\n\t\tfancy meal.  All you'd let me and Lena do\n\t\twas set the table.  And I guess you and\n\t\tDad got your wires crossed or something\n\t\tbecause he walks in with a couple of\n\t\tpizzas.  And you didn't say anything.\n\t\tYou just threw the whole meal into some\n\t\ttupper-ware and tossed it in the fridge.\n\n\t\t\t\tCAMILLE\n\t\tI don't remember that.\n\n\t\t\t\tMONICA\n\t\tI do.  You never stood up for yourself.\n\t\tEver.  If I was ashamed, it was because\n\t\tof that.\n\n\t\t\t\tCAMILLE\n\t\tThat's ridiculous.\n\n\t\t\t\tMONICA\n\t\tWhat's ridiculous is not being a caterer\n\t\tso your husband can feel like a man\n\t\tknowing his woman's home cooking and\n\t\tironing his drawers.\n\n\tWHAP!  Camille's humiliation is immediate and she cuts off\n\tMonica with a SLAP.  Camille curses herself for losing it.\n\n\t\t\t\tCAMILLE\n\t\tDammitt, Monica!\n\n\tMonica is stunned, hurt.\n\n\t\t\t\tMONICA\n\t\tI'm sorry.\n\n\tCamille stares at her daughter, devastated.\n\n\t\t\t\tCAMILLE\n\t\tIs that really all you think of me?\n\n\tMonica can't answer.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tWhen I married your father, all I wanted\n\t\twas a nice house with a big kitchen so I\n\t\tcould start my catering business.  And\n\t\tthen I got pregnant with Lena, and then I\n\t\tgot pregnant with you.  And I put it out\n\t\tof my mind because that's what you did.\n\n\tMonica stares at her mother.\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tBut you want to know what day I remember?\n\t\tIn high school, you getting ready for the\n\t\tSpring Dance.  I put my pearls around\n\t\tyour neck, told you you were beautiful\n\t\tand you looked like you were going to\n\t\tcry.  That day I was happy I didn't have\n\t\ta catering business to run off to.  My\n\t\tfamily had three meals a day, had someone\n\t\tto pick up after them, and when my\n\t\tdaughters went to a dance, I helped them\n\t\tget ready.  That's what I came to care\n\t\tabout.\n\n\t\t\t\tMONICA\n\t\t\t(softly)\n\t\tThat's all you cared about.  I must have\n\t\tplayed in a thousand games and I can only\n\t\tremember you being to two.\n\n\t\t\t\tCAMILLE\n\t\tYou had your coaches and your father for\n\t\tthat stuff.  It never mattered one way or\n\t\tthe other if I went to your games.\n\n\t\t\t\tMONICA\n\t\tIt mattered, Mom.\n\n\tCamille looks at her daughter and is struck by the need in\n\ther eyes.  Monica moves off the barstool and leaves.\n\t\n\t\n\t  INT. WRIGHT HOUSE - MONICA'S ROOM - DAY\n\n\n\n\tThe room looks exactly the same.  Trophies, medals, plaques.\n\tBasketball posters and her \"strong women\" wall.\n\n\tMonica sits on her bed, staring up at a photo of her and\n\tQuincy, tacked up to her bulletin board, amid other photos of\n\ther childhood.  THEY ARE EIGHTEEN, PLAYFULLY WRESTLING OVER A\n\tBASKETBALL.\n\n\tMonica slowly rises, starts taking her posters down.\n\n\tINT. REHAB CENTER - DAY\n\n\tQuincy sits on a leg extension machine, with his left leg\n\ttucked under the padded bar.  A TRAINER stands behind him.\n\n\tSweat and pain coat Quincy's face and scarred knee as he\n\tslowly lifts the light weight again, and again, and again.\n\n\tINT. BANK - DAY\n\n\tA long line of customers shift impatiently during the noon-\n\ttime rush.\n\n\tMonica sits with a BANK MANAGER at the \"New Accounts\" desk,\n\tlearning the ropes.  Her hair is done, she wears a simple\n\tdress.  Behind her, hanging on the wall, are three framed\n\tphotos of the bank presidents.  ONE OF THEM IS HER FATHER,\n\tNATHAN.\n\n\tINT. WRIGHT HOUSE - MONICA'S ROOM - NIGHT\n\n\tMonica stands in her room, staring out at Quincy's window.\n\tShe watches as Quincy and Kyra pack up some of Quincy's\n\tstuff.  Quincy tries to take his basketball globe light. She\n\tlaughs, \"Hell no.\"\n\n\tINT. WRIGHT HOUSE - MONICA'S ROOM - DAY\n\n\tCamille enters, moves to Monica's garbage can, dumps the\n\tcontents into her larger bag.  Suddenly, she stops.  She\n\treaches into the garbage and pulls out a crumpled picture.\n\n\tCamille smooths it.  It is the photo of Monica and Quincy at\n\teighteen, wrestling over a basketball.\n\n\tCAMILLE STARES AT IT, TAKEN IN BY THE PURE JOY IN HER\n\tDAUGHTER'S FACE.  She sits down on Monica's bed, still\n\tstaring.\n\n\tINT. FORUM - DAY\n\n\tIn the empty gym, Quincy jogs up and down the court.  He is\n\tstill tentative on his knee, but he keeps jogging.\n\n\tAnd then, slowly, the determination melts from his face.  His\n\tjog turns into a walk, and then he just...stops.\n\n\tINT. MCCALL HOUSE - QUINCY'S ROOM - NIGHT\n\n\tQuincy stands in the middle of his room, taking in his life.\n\tOld, worn basketball posters still line the walls.  Trophies\n\tand awards.  USC memorabilia.  His basketball globe light.\n\n\tHe walks to his window, looks out at Monica's window.  Her\n\troom is dark.\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\n\tINT. QUINCY'S APARTMENT - BATHROOM - MORNING\n\n\tQuincy tilts his face up to the shower head and rinses the\n\tsoap from his face.  He hears the bathroom door open.  He\n\tshuts off the water and opens the curtain.\n\n\tKyra sits on the toilet, taking a pee.  Quincy slams the\n\tcurtain closed.\n\n\t\t\t\tQUINCY\n\t\tDamn, girl.\n\n\t\t\t\tKYRA\n\t\tWhat?\n\n\t\t\t\tQUINCY\n\t\tI don't wanna see that.\n\n\t\t\t\tKYRA\n\t\tGet used to it, babe.\n\n\tShe flushes.  Quincy steps out, grabs a towel.  A long scar\n\truns across his knee cap.\n\n\t\t\t\tQUINCY\n\t\tBrother's gonna have to start locking\n\t\tdoors.\n\n\tKyra laughs as she buttons up her flight attendant's uniform.\n\tThey cross into:\n\n\tINT. QUINCY'S APARTMENT - BEDROOM - CONTINUOUS\n\n\tKyra packs up a suitcase.\n\n\t\t\t\tQUINCY\n\t\tSo how long is this trip?\n\n\t\t\t\tKYRA\n\t\tFour days.\n\n\tQuincy nods.\n\n\t\t\t\tKYRA (cont'd)\n\t\tSo are you going to be the kind of\n\t\thusband who won't let his wife work?\n\n\t\t\t\tQUINCY\n\t\tNah.\n\n\t\t\t\tKYRA\n\t\t\t(playfully)\n\t\tWhy not?\n\n\t\t\t\tQUINCY\n\t\tYou might be the only one with a job.\n\n\t\t\t\tKYRA\n\t\tBaby, don't talk like that.  Your rehab's\n\t\tgoing well.  You'll be back before you\n\t\tknow it.\n\n\t\t\t\tQUINCY\n\t\tSometimes I wonder if it's worth it.\n\t\tBusting my ass, for what?\n\n\t\t\t\tKYRA\n\t\tTo do what you love.\n\n\t\t\t\tQUINCY\n\t\tI don't know sometimes.\n\n\t\t\t\tKYRA\n\t\tYou're just scared.  I know rehab is\n\t\thard, and you have to worry about whether\n\t\tyou'll be as good as you were but you\n\t\twill be.  I believe in you.  You just\n\t\thave to get back on the court.  Like\n\t\tyou'd get back on a horse.\n\n\t\t\t\tQUINCY\n\t\t\t(beat)\n\t\tA horse?\n\n\t\t\t\tKYRA\n\t\tDon't make fun of me when I'm being\n\t\twonderful and supportive.\n\t\t\t(then)\n\t\tYou belong on the court.  Just like I\n\t\tbelong in the stands, looking cute and\n\t\tcheering you on.\n\n\tShe smiles, gives him a kiss, moves back to her packing.  Off\n\tQuincy:\n\n\tINT. BANK - DAY\n\n\tMonica sits at her desk in a blouse and skirt, punching\n\tnumbers into the computer.  A man sits down in the chair\n\topposite her.  Monica glances up.  It's her father.\n\n\t\t\t\tNATHAN\n\t\tHey, munchkin.\n\n\t\t\t\tMONICA\n\t\tDad.  What are you doing here?\n\n\t\t\t\tNATHAN\n\t\tI was upstairs for a meeting.  I've been\n\t\thearing good things about you.\n\n\t\t\t\tMONICA\n\t\tThat tends to happen when you're the\n\t\tboss's daughter.\n\n\t\t\t\tNATHAN\n\t\tSo how's the job going?\n\n\tMonica forces a smile.\n\n\t\t\t\tMONICA\n\t\tYou know.\n\n\tNathan looks at her, nods.\n\n\t\t\t\tNATHAN\n\t\tI think I know what the problem is.\n\n\tHe pulls a GARBAGE CAN HOOP from a plastic shopping bag.\n\tMonica smiles.  He attaches it to her garbage can.\n\n\t\t\t\tNATHAN (cont'd)\n\t\tThere.\n\n\tHe shoots an ugly, imaginary shot.  She laughs.\n\n\t\t\t\tMONICA\n\t\tYou shoot like a girl.\n\n\t\t\t\tNATHAN\n\t\tI'll take that as a compliment.\n\n\tHe gives her a smile, and exits.  Monica looks at the hoop,\n\tthen crumples a piece of paper.\n\n\t\t\t\tMONICA\n\t\t\t(whispering)\n\t\tAnd she gets the steal.  Monica goes one-\n\t\ton-one against Jordan, she stops, pops...\n\n\tMonica shoots.  The paper drops through the net.\n\n\t\t\t\tMONICA (cont'd)\n\t\t\t(still whispering)\n\t\tIt's good!  It's good!\n\n\tShe glances up, notices a few patrons watching her.  Monica\n\tquickly composes herself and goes back to her work.\n\n\tEXT. WRIGHT AND MCCALL HOUSES - DUSK\n\n\tMonica exits her car, after a long day at work.  She wears\n\tvery low heels.  But she still stumbles.  She curses, then\n\thears a laugh.\n\n\tShe looks up - Quincy sits on the grassy hill above her\n\thouse.\n\n\t\t\t\tQUINCY\n\t\tI remember when your mom had to beat you\n\t\tinto a dress.\n\n\tMonica smiles.\n\n\t\t\t\tMONICA\n\t\tYou visiting?\n\n\t\t\t\tQUINCY\n\t\t\t(nods)\n\t\tKyra's gone for a couple days.  Figured\n\t\tI'd keep Mom company.\n\n\t\t\t\tMONICA\n\t\tWho's this guy I always see her around?\n\n\t\t\t\tQUINCY\n\t\tDarryl.  He's alright, kinda corny.\n\n\t\t\t\tMONICA\n\t\tSo...how's the knee?\n\n\t\t\t\tQUINCY\n\t\tGetting there.\n\n\t\t\t\tMONICA\n\t\tStrong enough to get you down the aisle?\n\n\t\t\t\tQUINCY\n\t\tYeah.  Two weeks.\n\t\t\t(then)\n\t\tI didn't get to send you an invitation,\n\t\tbut if you...\n\n\t\t\t\tMONICA\n\t\tThat's okay.  I'm probably, you know,\n\t\tbusy.\n\n\tQuincy nods.  Awkward beat.\n\n\t\t\t\tQUINCY\n\t\tCan I ask you something?\n\n\tMonica looks at him.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tYou never told me why ball isn't fun\n\t\tanymore.\n\n\t\t\t\tMONICA\n\t\tIt just isn't.\n\n\t\t\t\tQUINCY\n\t\tBecause I'm kinda feeling that way, too.\n\n\t\t\t\tMONICA\n\t\tYou had a rough couple years, that's all.\n\n\t\t\t\tQUINCY\n\t\tThat a nice way of saying I rode the\n\t\tbench?\n\n\t\t\t\tMONICA\n\t\tAnd you tore up your knee.  Rehab is\n\t\ttough.\n\n\t\t\t\tQUINCY\n\t\tNah.  I haven't dribbled a ball in four\n\t\tand a half months.  Maybe I miss some of\n\t\tthe attention, but besides that...\n\n\t\t\t\tMONICA\n\t\tYou're serious.\n\n\t\t\t\tQUINCY\n\t\tSeems like I needed a ball when I was\n\t\ttrying to be like my pops...or trying to\n\t\tbe better than him.  Now, I kinda think I\n\t\tneed to try something else.\n\n\t\t\t\tMONICA\n\t\tLike what?\n\n\t\t\t\tQUINCY\n\t\tMaybe go back to school.\n\n\t\t\t\tMONICA\n\t\tWow.\n\n\tMonica stares at him, seeing a man in the boy she grew up\n\twith.  Quincy looks away, self-conscious.\n\n\t\t\t\tQUINCY\n\t\tI mean, Kyra hasn't heard the school\n\t\tthing yet.\n\t\t\t(then)\n\t\tShe'll probably say it's the painkillers\n\t\ttalking.\n\n\t\t\t\tMONICA\n\t\tIt's a trip, you know?  When you're a\n\t\tkid, you see the life you want, and it\n\t\tnever crosses your mind that it's not\n\t\tgonna turn out that way.\n\n\t\t\t\tQUINCY\n\t\tSo why'd you give up ball?\n\n\t\t\t\tMONICA\n\t\tWhy do you keep asking me that?\n\n\t\t\t\tQUINCY\n\t\tCause I don't get it.\n\n\t\t\t\tMONICA\n\t\tSomething was just missing.\n\n\t\t\t\tQUINCY\n\t\tWhat?\n\n\tMonica is too hurt, too scared to tell him the truth.\n\n\t\t\t\tMONICA\n\t\tIt doesn't matter, alright.  Just leave\n\t\tit alone.\n\n\t\t\t\tQUINCY\n\t\tFind.\n\n\tMonica turns, crosses to her house.  She stumbles on her\n\theels, kicks them off in frustration, and exits inside.\n\tQuincy walks back to his curb.\n\n\tANGLE ON\n\n\tCamille watches from the kitchen window\n\n\t\t\t\t\t\t\t\t   DISSOLVE TO:\n\n\tEXT. WRIGHT HOUSE - PATIO - DUSK\n\n\tLena sits next to Camille.  Her one year old son, L.P., sits\n\ton the ground at her feet.  Monica sits quietly nearby,\n\twatching.\n\n\t\t\t\tCAMILLE\n\t\tSo you're still breast-feeding?\n\n\t\t\t\tLENA\n\t\tThe doctor said it was okay.  Anyway, I'm\n\t\tstill trying to lose some of this baby\n\t\tfat.\n\n\tShe quickly looks over at Monica.\n\n\t\t\t\tLENA (cont'd)\n\t\tShut up.\n\n\tMonica gives her a small smile.  Camille looks down at L.P.\n\n\t\t\t\tCAMILLE\n\t\tYou might want to put a jacket on him,\n\t\tit's getting cold.\n\n\t\t\t\tLENA\n\t\tHe's fine.\n\n\t\t\t\tCAMILLE\n\t\t\t(warning)\n\t\tOkay.\n\n\tLena sighs, rolls her eyes.  She picks up her son.\n\n\t\t\t\tLENA\n\t\tCome on, L.P.  Grandma says it's too\n\t\tcold.\n\n\tShe exits inside.  Camille makes a face.\n\n\t\t\t\tCAMILLE\n\t\tGod.  \"Grandma.\"\n\n\tMonica smiles.  And then silence.  There is still so much\n\tdistance between them, so many misunderstanding.  Camille\n\tstares at her daughter.  And then...\n\n\t\t\t\tCAMILLE (cont'd)\n\t\tYou know, I'd probably be a lot more\n\t\t\"prissy\" in the situation than you'd\n\t\tlike, but the thing I always admired that\n\t\tdrove me crazy, was the fight you had in\n\t\tyou.\n\n\t\t\t\tMONICA\n\t\tWhat are you talking about?\n\n\t\t\t\tCAMILLE\n\t\tWhen I said Quincy could do better, I was\n\t\tthinking about you.\n\n\tMonica stares at her mom.  Camille stands and leaves.\n\t\n\t\n\t  INT. WRIGHT HOUSE - MONICA'S ROOM - NIGHT\n\n\n\n\tMonica lies in her bed, staring up at the ceiling, unable to\n\n\tsleep.  Her mind races with thoughts of her past, her\n\n\tchoices, her future...\n\n\n\n\tSuddenly, she climbs out of bed.  She wears a tank-top and\n\tpajama bottoms.  She crosses to her window, pulls it open and\n\tclimbs out.\n\n\tEXT. WRIGHT AND MCCALL HOUSES - CONTINUOUS\n\n\tMonica drops down.  She moves to Quincy's window and knocks\n\tquietly.  Beat, then Quincy appears.  Bare-chested and in a\n\tpair of shorts.  He looks at her, then pulls open the window.\n\n\t\t\t\tQUINCY\n\t\t\t(half-asleep)\n\t\tWhat's going on?\n\n\t\t\t\tMONICA\n\t\tWe need to talk.\n\n\tQuincy just looks at her.\n\n\t\t\t\tMONICA (cont'd)\n\t\tPlease.\n\n\t\t\t\tQUINCY\n\t\tHold on.\n\n\tQuincy disappears for a moment, then returns, pulling on a T-\n\tshirt.  He climbs out of his window, drops to the ground.\n\n\tQuincy looks at her.\n\n\t\t\t\tMONICA\n\t\tYou asked me what was missing.\n\n\t\t\t\tQUINCY\n\t\tWhat?\n\n\t\t\t\tMONICA\n\t\tFrom basketball.\n\n\t\t\t\tQUINCY\n\t\tyou woke me up to tell me that?\n\n\t\t\t\tMONICA\n\t\tIt's not fun for me anymore because\n\t\tyou're missing.\n\n\tQuincy stares at her.\n\n\t\t\t\tMONICA (cont'd)\n\t\tWhat I'm trying to say is --\n\n\t\t\t\tQUINCY\n\t\tI heard enough.\n\n\t\t\t\tMONICA\n\t\tWhat I'm trying to say is, I've loved you\n\t\tsince I was eleven and the shit won't go\n\t\taway.\n\n\t\t\t\tQUINCY\n\t\tWe haven't talked since college and now\n\t\tyou wait two weeks before my wedding to\n\t\tsay something like this?\n\n\t\t\t\tMONICA\n\t\tI know, I probably should have said it\n\t\ttwo weeks ago.\n\n\tQuincy doesn't even crack a smile.  In fact, he glares.\n\n\t\t\t\tQUINCY\n\t\tYou haven't changed.  You still think the\n\t\tsun rises and sets on your ass.  Well,\n\t\tguess what, it doesn't.\n\n\t\t\t\tMONICA\n\t\tThen why are you so upset?\n\n\t\t\t\tQUINCY\n\t\tBecause you don't pull this on someone\n\t\twho's about to get married.\n\n\t\t\t\tMONICA\n\t\tBetter late than never, right?\n\n\t\t\t\tQUINCY\n\t\tWrong.\n\n\tQuincy starts back toward the window.\n\n\t\t\t\tMONICA\n\t\tI'll play you.\n\n\t\t\t\tQUINCY\n\t\tWhat?\n\n\t\t\t\tMONICA\n\t\tOne game.  One-on-one.\n\n\t\t\t\tQUINCY\n\t\tFor what?\n\n\t\t\t\tMONICA\n\t\tYour heart.\n\n\tQuincy looks at her in disbelief, then laughs at the\n\tabsurdity.\n\n\t\t\t\tQUINCY\n\t\tYou're out of your mind.\n\n\t\t\t\tMONICA\n\t\tSo you're gonna bitch up?\n\n\t\t\t\tQUINCY\n\t\tWhat's that supposed to be, psychology?\n\n\t\t\t\tMONICA\n\t\tI know why you broke up with me in\n\t\tcollege.  And not that what you did\n\t\twasn't messed up, but what I did was,\n\t\ttoo.  So if you forgive me, I'll forgive\n\t\tyou.\n\n\t\t\t\tQUINCY\n\t\tMonica, after that stuff with my dad, I\n\t\tcouldn't trust anybody, okay.  I mean, I\n\t\twas lost.  So you are forgiven.  But that\n\t\twas five years ago.  I moved on.\n\n\tMonica moves past him, reaches through his window.  She drops\n\tback down, holding his basketball.\n\n\t\t\t\tMONICA\n\t\tProve it.\n\n\tShe throws him the ball.\n\n\t\t\t\tQUINCY\n\t\tWhat will this prove?\n\n\t\t\t\tMONICA\n\t\tYou once said the reason I beat you was\n\t\tbecause you wanted me to.\n\n\t\t\t\tQUINCY\n\t\tSo?\n\n\t\t\t\tMONICA\n\t\tSo, if I win it's because deep down you\n\t\tknow you're about to make the biggest\n\t\tmistake of your life, and deep down your\n\t\twant me to stop you.\n\n\t\t\t\tQUINCY\n\t\tAnd what happens when you lose?\n\n\t\t\t\tMONICA\n\t\tIf I lose, I'll buy you a wedding\n\t\tpresent.\n\n\tQuincy stares at her.\n\t\n\t  EXT. MCCALL HOUSE - DRIVEWAY - SHORT TIME LATER\n\n\n\n\tMonica stands opposite Quincy.  Both are suited up in\n\n\tbasketball gear.\n\n\n\n\tThey stare at each other, ready to go to war. Monica tosses\n\thim the ball.\n\n\t\t\t\tMONICA\n\t\tCheck.\n\n\tQuincy tosses the ball back.  Monica drives.  Quincy's knee\n\tis maybe at sixty percent and he can't keep up.  She scores\n\teasily.\n\n\tShe walks to the top of the driveway, tosses him the ball.\n\n\t\t\t\tMONICA (cont'd)\n\t\tOne, zip.  Check.\n\n\tQuincy rubs his scarred knee, then passes it back.\n\n\tThe game continues.  Monica owns the first five points easily\n\tby exploiting Quincy's injury.\n\n\tMonica drives for another lay-up.  Quincy suddenly lets go of\n\this fear, leaps and swats her shot.\n\n\tHe grabs the rebound and lays it up.  He nods intensely, as\n\the grabs the ball and walks back to the top of the key.\n\n\t\t\t\tQUINCY\n\t\tOne, five.  Check.\n\n\tThe game continues and now Quincy has the upper-hand, using\n\this size and strength.  He scores seven straight points.\n\n\tThe score stays close.  It is a sexually-charged battle of\n\twills -- Quincy pulls off his sweat-soaked shirt.  Their\n\tbodies collide as they wrestle for the ball.  Monica yanks\n\toff her jersey in frustration.  Her ass bumps into his hips\n\tas she backs him in.  Her hands slide across his chest as she\n\tguards him...\n\n\tFinally, the score hits nine, nine.  Monica slowly walks to\n\tthe top of the key.\n\n\t\t\t\tMONICA\n\t\tNine, up.  Point.\n\n\tShe tosses Quincy the ball.\n\n\t\t\t\tMONICA (cont'd)\n\t\tCheck.\n\n\tQuincy tosses the ball back, drops low on defense.  Monica\n\tfakes an outside shot and Quincy bites.  Monica drives around\n\thim.  SHE HAS A WIDE-OPEN LAY-UP.  SHE PUTS IT UP..AND IT\n\tROLLS OFF THE RIM.  Monica can't believe it.\n\n\tQuincy grabs the loose ball and clears it.  He stares at\n\tMonica as he dribbles in front of her.  She stares back.\n\n\tHe breaks for the basket.  Monica stays with him.  He goes\n\tup.  Monica jumps, desperately tries to block his shot.\n\tQuincy dunks on her, knocking her to the ground.  He lets go\n\tof the rim, and tumbles to the ground also.  GAME OVER.\n\n\tSilence.  Quincy stares at her.  Monica looks back.  Then:\n\n\t\t\t\tQUINCY\n\t\t\t(pointed)\n\t\tAll's fair in love and basketball, right?\n\n\tMonica struggles to fight back her tears as she picks herself up.\n\tShe slowly walks back toward her house.  And then:\n\n\t\t\t\tQUINCY (cont'd)\n\t\tHey.\n\n\tMonica slowly stops, turns.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tDouble or nothing.\n\n\tMonica stares at him, wonders if she heard right.  Quincy\n\tlimps to his feet, picks up the ball and holds it out to her.\n\n\tMonica slowly walks back to him.  They stare at each other.\n\tNo more egos, no more bullshit.  Just love.\n\n\tIn the moonlight, on the blacktop, they kiss...\n\n\t\t\t\t\t\t\t\tFADE TO BLACK.\n\t\t\t\t\t\t\t\t\n\t  FADE IN:\n\n\n\n\tINT. LOS ANGELES FORUM - NIGHT\n\n\n\n\tMusic is blasting, banners are waving, crowd is screaming.\n\n\n\n\tMagic Johnson sits in a floor seat, watching the game.  A\n\n\tREPORTER interviews him.\n\n\t\t\t\tSPORTS REPORTER\n\t\tSo, Magic, are you contemplating another\n\t\tcomeback?\n\n\t\t\t\tMAGIC\n\t\t\t(laughs)\n\t\tNo more comebacks.  Tonight I'm just\n\t\tenjoying being a spectator.\n\n\tBehind him, in a second row seat, a ONE YEAR BLACK GIRL sits\n\tin a lap, bouncing, watching feet and legs ballin' on the\n\tcourt.\n\n\tQuincy leans down, gives the little girl a kiss, then looks\n\tout at the court.  It's the Los Angeles Sparks and the New\n\tYork Liberty.  The WNBA.\n\n\tOn the court, the women line up for a free-throw.\n\n\t\t\t\tQUINCY\n\t\tLet's go, McCall!\n\n\tMonica, sporting a uniform with Wright-McCall on the back and\n\tthe number thirty-two, looks over.  Quincy takes their\n\tdaughter's hand and waves it.\n\n\t\t\t\tQUINCY (cont'd)\n\t\tGo Mommy.\n\n\tMonica smiles back, then steps to the line.  The referee\n\ttosses her the ball.  Monica stares at the basket, then\n\tbounces the ball twice, licks her lips and shoots.\n\n\t\t\t\t\t\t\t\t FADE TO BLACK.\n\n\t\t\t\t    \"THAT'S GAME\"\n\t END CREDITS\n\n\n\n\n\n\n\n\n\n\nLove and Basketball\nWriters :   Gina Prince-Bythewood\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:30:18.012423"}