{"title": "Malcolm X", "film_link": "/Movie Scripts/Malcolm X Script.html", "script_link": "/scripts/Malcolm-X.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Malcolm X Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Malcolm X Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Spike Lee\" title=\"Scripts by Spike Lee\">Spike Lee</a><br/>  <a href=\"/writer.php?w=Arnold Perl\" title=\"Scripts by Arnold Perl\">Arnold Perl</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> :  1991<br/>\n<br/>\n<a href=\"/scripts/Malcolm-X.html\">Read \"Malcolm X\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>Malcom X\n\n\n Fourth draft (1991)\n Screenplay by James Baldwin, Arnold Perl and Spike Lee\n Based on The Autobiography of Malcolm X as told to Alex Haley\n\n\n<b>\tFADE IN:\n</b><b> \n</b><b>1  \tEXT. ROXBURY STREET - THE WAR YEARS - DAY \n</b>\n\tIt is a bright sunny day on a crowded street on the black side of \n\tBoston. PEOPLE and KIDS are busy with their own things. \n\n\tSHORTY bops his way down the street. He is a runty, very dark \n\tyoung man of 21 with a mission and a smile on his face. He wears \n\tthe flamboyant style of the time: the whole zoot-suit, pegged legs \n\tand a wide brim hat with a white feather stuck in the hat band.\n<b> \n</b><b>2 \tOMIT \n</b>\n<b>3 \tOMIT \n</b>\n<b>4 \tOMIT\n</b><b> \n</b><b>5 \tEXT. STREET - DAY \n</b>\n\tFOLLOW SHOT. Shorty dodges through the crowd with his packages. \n\tHis smile is one of anticipation. He nods to a PAL without \n\tstopping; eyes a COUPLE OF CHICKS dancing on the street, but is \n\tnot dissuaded.\n<b> \n</b><b>6\tINT. BARBER SHOP - DAY \n</b>\n\tShorty has his jacket and hat off, his sleeves rolled up. He is like a \n\tsurgeon preparing for an operation. His equipment is spread out on \n\ta table: can of lye, large mason jar, wooden stirring spoon, knife, \n\tthe eggs. His actions have the character of a ritual: each thing \n\tbeing done just so, in time-honored fashion.\n\n\tHe slices the potatoes and drops the thin slices into the mason jar.\n\tHe adds water and makes a paste of the starch.\n\n\tBehind Shorty is a spirited barbershop conversation. ONE MAN is\n \tgetting a haircut; TWO OTHERS are watching (TOOMER, JASON)\n\tone of them from behind a newspaper. A middle-aged barber, \n\tCHOLLY, is doing most of the talking.\n<b> \n</b><b>\t\t\t\tCHOLLY \n</b>\t\tAfter I hit the number that woman wasn't no good \n\t\tto me at all.\n<b> \n</b>\tThe men laugh.\n<b> \n</b>\tANGLE - Shorty pries open the can of lye, whiffs it. It's good and \n\tstrong. He pours some in the mason jar, stirring with the wooden \n\tspoon. He cracks the eggs into the mixture and stirs. He waits as \n\tfumes rise and feels the outside of the jar as it gets hot.\n<b> \n</b>\tANOTHER ANGLE - The barbershop SEEN from a door, slightly \n\tajar. A woolly head, entirely in shadow, peers out. \n\n<b>\t\t\t\tCHOLLY'S VOICE \n</b>\t\tShe says I'm cheap cuz I won't cop her a diamond \n\t\tring. Had the indignation to call me a cheap \n\t\tblack sunovabitch to boot.\n\n<b>\t\t\t\tTOOMER \n</b>\t\tAnd when a black woman call you a cheap black \n\t\tsunovabitch you've been called a cheap black \n\t\tsunovabitch.\n<b> \n</b>\tCholly is annoyed. It's _his_ story. \n\n<b>\t\t\t\tCHOLLY \n</b>\t\tWill you let me tell it?\n\n\tON SHORTY - He opens the bulky package he has been carrying, \n\tunfolds a large rubber apron and gets into it. Now he dons a pair of\n \trubber gloves.\n\n<b>\t\t\t\tSHORTY \n</b>\t\tWhere's Homeboy?\n\n\tHe is all ready; one of his hands is filled with a huge glob of \n\tVaseline. His manner is indignant as if he were asking the whereabouts \n\tof an exasperating child.\n<b> \n</b><b>\t\t\t\tCHOLLY \n</b>\t\tRed's in the head, man.\n<b> \n</b><b>\t\t\t\tTOOMER \n</b>\t\tYou mean hiding in the head.\n<b> \n</b><b>\t\t\t\tCHOLLY \n</b>\t\tHey, Red. Your man's here and waiting on you. \n\n\tHis hands full, Cholly opens the door with his feet and MALCOLM comes \n\tout, a big, gawky, bright-faced country boy, wearing downhome clothes \n\tand an expression of apprehension.\n<b> \n</b><b>\t\t\t\tTOOMER \n</b>\t\tGonna get that first conk laid on, hunh, \n\t\tHomeboy?\n<b> \n</b><b>\t\t\t\tCHOLLY \n</b>\t\tMan, don't scare him more than he's scared \n\t\talready. Ain't too bad...\n<b> \n</b>\tMalcolm allows himself to be led to an empty chair, where Cholly drapes \n\thim with a double sheet, tucking it tightly around his neck and adding \n\ta protective collar of paper.\n<b> \n</b><b>\t\t\t\tCHOLLY\n</b>\t...Like anything else. First time a chick gets her \n\tcherry popped, she might put up a little fight. But \n\tpretty soon you can't give her enough. Right, \n\tHomeboy?\n<b> \n</b><b>\tCLOSE - MALCOLM \n</b>\n\tMalcolm gulps, his eyes on the fuming mason jar. \n\n\tShorty starts massaging a great quantity of Vaseline into Malcolm's \n\tscalp, covering his neck and ears as well. All the men have gathered\n \taround, involved in the ritual. For Malcolm it is closer to being a \n\tkind of execution.\n<b> \n</b><b>\t\t\t\tCHOLLY \n</b>\t\tGit his forehead and eyebrows.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tI know what I'm doing.\n<b> \n</b>\tShorty applies the Vaseline to that area.  Now he brings over the\n\tsteaming jar and places it nearby.\n\n\t\t\t\tSHORTY (contd)\n \t\tListen. You pull my coat if it's still stinging \n\t\twhen I get through 'cause this shit can burn a \n\t\thole through cement.\n<b> \n</b><b>\t\t\t\tCHOLLY \n</b>\t\tHold tight, baby, and keep your eyes shut.\n<b> \n</b>\tMalcolm nods his head, clenches his eyes and grits his teeth. Shorty \n\tapplies the congolene with a comb, working it into Malcolm's hair.\n\n<b>\tCLOSE - MALCOLM \n</b>\n<b>\t\t\t\tMALCOLM\n</b>\t\tI thought you said it was gonna sting... this \n\t\tain't nothin'.\n<b> \n</b>\tFor a moment nothing happens, then the heat hits him. He yells, tries \n\tto catch his breath: his head is on fire.\n<b> \n</b>                    MALCOLM (contd)\n\t\tYou motherfucker.  You're killing me. I'm \n\t\tburning up. My damn head is on fire.\n\n\tHe nearly leaps out of the chair, but the barber restrains him.\n\n\tShorty, utterly unmoved by the outburst, continues working the \n\tcongolene into his hair. \n\n\tMalcolm breaks out of the chair wildly. But the three men drag him to a \n\tbasin where Shorty has attached the shower spray. His cries filling the \n\troom, Malcolm is ducked under the spray. Shorty starts rinsing out his \n\thair.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tDon't fight me, man. Let me git it out.\n<b> \n</b>\tMalcolm is a little relieved, he tentatively opens his eyes, then he \n\tfeels the congolene again and there is another outburst. Shorty forces \n\this head under the spray, spurts the water all over his head, wetting \n\tMalcolm and the shop in the process.\n<b> \n</b><b>7\tOMIT \n</b>\n<b>8 \tOMIT\n</b><b> \n</b><b>9  \tINT. CLOTHING STORE - DAY\n</b><b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tWell, Homeboy, you almost there. Turn around.\n<b> \n</b>\tShorty is supervising as Malcolm tries on a zoot suit. He slips into \n\tthe jacket...\n<b> \n</b>\tShoes-off, Malcolm steps into the tight-fltting peg-legged pants ......\n \tdons a wide-brimmed hat with a bright blue feather.... Finally, fully \n\toutfitted, he leans forward toward his new image in the full-length \n\tmirror, twirling a long, dangling key chain.\n<b> \n</b><b>     \t\t\t\tSHORTY \n</b>\t\tWell, all right, then.\n<b> \n</b><b>   \t\t\t\tMALCOLM \n</b>\t\tWell, all reet, then.\n<b> \n</b>\tThe transformation is complete. The two laugh and slap hands. \n\n<b>10\tEXT. ROXBURY STREET - DAY\n</b><b> \n</b>\tMalcolm and Shorty come strutting down the street: two conked,\n\tzoot-suited sharpies. Hometown boy has departed. And the CHICKS on the \n\tstreet notice them, especially Malcolm, the taller of the two, the \n\tlighter-skinned, the more dominant. They walk imperiously past, fully \n\taware of their impact.\n<b> \n</b><b>\tCLOSE SHOT - MALCOLM\n</b><b> \n</b>\tFREEZE FRAME. He becomes a STILL.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tWhen my mother was pregnant with me, she told \n\t\tme later, a party of Klansmen on horseback \n\t\tsurrounded our house in Omaha.\n\n10A \tANGLE. KLAN on horses in front of house.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\tThey brandished guns and shouted for my father \n\t\tto come out. My mother went to the door where \n\t\tthey could see her pregnant condition... \n\n\tANGLE. A pregnant Louise Little on porch.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\t...and told them my father was in Milwaukee, \n\t\tpreaching. \n\n\tANGLE. The Klan breaks all the windows in the house then rides off into \n\tthe glorious D.W. Griffith _Birth of a Nation_ moonlit night. \n\n<b>\tCLOSE - LOUISE LITTLE\n</b><b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd)\n\t\tThe hooded Klansman said the good, white \n\t\tChristians would not stand for his \n\t\ttroublemaking, and to get out of town.\n<b> \n</b>\tANGLE. The terrified Little children look out a broken window at their \n\tmother.\n<b> \n</b><b>\tANGLE. AN OLD FRAME HOUSE IN OMAHA\n</b><b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd)\n\t\tThey broke every window with their rifle butts \n\t\tbefore riding off into the night, their torches \n\t\tflaming.\n\n<b>\tANGLE. FRONT PORCH OF THE LITTLE HOUSE - AN EMPTY ROCKER ON IT\n</b><b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd)\n \t\tMy father was not a frightened Negro as most \n\t\twere then and as many still are today. He was \n\t\tsix feet four and very black...\n<b> \n</b><b>10B \tCLOSE - EARL LITTLE\n</b>\n\tHe looks directly into the camera, wearing a Baptist Minister's robe.\n<b> \n</b> \t\t\t\tVOICE OF MALCOLM X (contd) \n\t\t...and had a glass eye. He believed, as did \n\t\tMarcus Garvey, that freedom, independence and \n\t\tself-respect could never be achieved by the \n\t\tNegro in America . . .\n<b>  \n</b><b>10C \tCLOSE - EARL LITTLE\n</b><b> \n</b>\tHe wears a Garvey hat, ornate with gold braid.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\t...that, therefore, black men should leave \n\t\tAmerica and return to the land of their origin.\n<b> \n</b>10D \tANGLE. Earl Little, in a wagon with little Malcolm.\n<b> \n</b><b>\tCLOSE - EARL LITTLE:\n</b><b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\tMy father dedicated his life to his beliefs \n\t\tbecause he had seen four of his six brothers \n\t\tdie violently...\n<b> \n</b>10E \tWIDER ANGLE. WE SEE Earl in front of a podium in church. He is\n\tpreaching.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\t...three killed by white men and one lynched. \n\t\tThere are nine children in our family.\n<b> \n</b>\tANGLE. The nine Little children. \n\n<b>\tCLOSE - LOUISE LITTLE \n</b>\n\tShe is a pretty, mature woman and white-looking.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\tMy mother was an attractive woman, an educated \n\t\twoman, a strong woman.\n<b> \n</b><b>10F CLOSE - LOUISE AND EARL\n</b><b> \n</b>\tA posed wedding picture, serious but sweet.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\tShe was very light, her mama was raped by a \n\t\twhite man. One of the reasons she married my \n\t\tfather was because he was so black, she \n\t\tdisliked her complexion and wanted her children \n\t\tto have some color.\n<b> \n</b><b>\tCLOSE SHOT\n</b><b> \n</b>\tFlash bulb of camera flashes. \n\n<b>11\tOMIT\n</b><b> \n</b><b>12 \tOMIT \n</b>\n<b>13 \tOMIT \n</b>\n<b>14 \tOMIT\n</b>\n<b>15 \tINT. ROSELAND STATE BALLROOM - NIGHT\n</b><b> \n</b><b>\tCLOSE - MALCOLM AND SHORTY\n</b><b> \n</b>\tThey both were posed for a picture. The music \"FLYING HOME\" is blaring \n\tas LIONEL HAMPTON and his band is killing. The music is WILD, the\n \tdancing is frantic, the clothes are OUT, and the crowd is predominately \n\tBLACK, although there is a peppering of WHITES, especially white chicks.\n \tAnd Malcolm is a little bug-eyed as he nudges Shorty, watching mixed \n\tcouples on the floor. \n\n\tA BOY in extreme zoot-suit flips him; a WHITE GIRL in long blond\n\thair wigs him. Malcolm is a little open-mouthed.\n<b> \n</b><b>\t\t\t\tA VOICE \n</b><b>\t\tSHOWTIME, SHOWTIME!\n</b><b> \n</b><b>\tANGLE - THE BALLROOM - NIGHT \n</b>\n\tPeople start moving off the floor, making room for the dancers. The \n\tmusic begins to get faster and more furious. \n\n<b>\tCLOSE - HAMPTON'S BAND - NIGHT \n</b>\n\tIt is a fast Lindy. People start clapping to the beat as they form a U \n\taround the DANCERS, with the band at the open end.\n<b> \n</b><b>16 \tINT. THE DANCE FLOOR\n</b><b> \n</b>\tTWO COUPLES are on the floor, dancing wildly. They are quickly joined \n\tby a half dozen OTHERS. These are the best dancers and constitute the \n\tmain event of a Saturday night black dance. People crowd and push to \n\tget better vantage points and the competition is under way.\n<b> \n</b><b>\tANGLE ON THE CROWD \n</b>\n\tIt is dominantly black, but there are some whites in the audience, \n\tmostly women. One is SOPHIA, a spectacular blonde with a degree of\n \trefinement, something of a thrill-seeker. Many of the men try to catch \n\ther eye, but for the moment Sophia is just watching, looking for no one \n\tin particular, but nonetheless looking.\n<b> \n</b><b>\tANGLE: - COUPLE ON THE DANCE FLOOR\n</b><b> \n</b>\tGetting ready to enter the fray, the GIRL takes off her shoes and \n\tbounces out on the floor barefoot with her partner. Their advent is \n\tgreeted with cheers and ad libs. Clearly the crowd has its favorites. \n\n<b>\tWIDER SHOT\n</b>\n\tThe music gets faster and the dancing takes on a more frantic and more \n\tremarkable quality. \n\n<b>\tFOLLOW SHOT - MALCOLM \n</b>\n\tHe is looking for his partner, the girl he brought and now he sees her. \n\tHe makes his way through the watching audience. \n\n<b>\tCLOSE - LAURA \n</b>\n\tShe is a fine chick, cool and beautiful. She smiles as she sees Malcolm \n\tapproaching.\n\n\tTWO-SHOT. Laura and Malcolm stand together, delighted to be with one \n\tanother, starting to move to the music, as they watch the dancers.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCome on, baby, let's show 'em how.\n<b> \n</b>\tLaura smiles shyly; she's willing.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tYou better get out of them shoes, girl.\n<b> \n</b>\tLaura laughs, goes quickly to a bench and changes into a pair of \n\tsneakers.\n<b> \n</b><b>17 \tINT. THE DANCE FLOOR\n</b><b> \n</b>\tBecause of the competition, Laura and Malcolm begin at high speed. In a \n\tmoment they are executing the most intricate steps of the \"flapping \n\teagle\" and the \"kangaroo.\" Malcolm starts boosting her over and around \n\this hips, then boosting her over his shoulders. Laura is the perfect \n\tpartner. She loves it.\n<b> \n</b><b>\tANGLE WITH THE CROWD\n</b><b> \n</b>\tSo does the crowd, who loves new stars. There are ad lib remarks: \"Go,\n \tman, go.\" \"Hey, Red.\" \"Mmmmmm ummm.\"\n<b> \n</b><b>\tANGLE: - SHORTY\n</b><b> \n</b>\tA big, fat, hefty BLACK WOMAN takes Shorty out to the dance floor, and \n\tshe takes the lead. As they do the Lindy she is slinging Shorty around \n\tlike a rag doll. This woman slides him through her legs and Shorty has \n\thad enough, he runs off the dance floor, and hides.\n<b> \n</b>\tTWO-SHOT. Laura and Malcolm are, in the phrase, cooking on all burners \n\tnow; and when they execute an especially intricate step, even Hamp \n\twaves over.\n<b> \n</b>\tMalcolm is sweating and flushed and enormously elated. He sees that \n\tpeople are watching him, goading him on. He notices that Sophia, in \n\tparticular, has not taken her eyes off him; she is clapping in time to \n\this steps.\n<b> \n</b>\tSeeing new stars in the making, the other dancers move to the side of \n\tthe floor, marking time, yielding the dance floor to them. Laura and \n\tMalcolm go into a solo.\n<b> \n</b><b>\tANGLES\n</b><b> \n</b>\tThe crowd loves it. Malcolm and Sophia are very aware of each other. \n\tThe finale is the classic drag, with Laura hanging limp around \n\tMalcolm's neck as he capers off the dance floor to the spontaneous \n\tapplause of the audience. \n\n<b>\tCLOSE SHOT - SOPHIA (SLO-MO) \n</b>\n\tClapping enthusiastically -- in open admiration. \n\n<b>\tCLOSE SHOT - SHORTY\n</b><b> \n</b>\tWaiting to catch them as they come off. Shorty is whistling and shaking \n\this hand appreciatively. He is also looking out for his dance partner.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tHey, man, gimme some skin.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tShorty, this is Laura.\n<b> \n</b>Laura is flushed and out of breath and joyous.\n<b> \n</b><b>\t\t\t\tLAURA\n</b>\t\t'Lo. I've got to freshen up.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNow you come back.\n<b>  \n</b>\tLaura laughs as she goes. She surely will be back.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tThat's a fine chick.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tFine as May wine.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tExcept she live on the hill and got a grandma.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMake it too easy and it ain't no fun.\n<b> \n</b>\tThen his vision catches Sophia, who is approaching him. She makes a \n\tsimple, direct gesture, \"Want to dance?\" Malcolm eyes Shorty and \n\twordlessly glides into Sophia's arms.\n<b> \n</b><b>\tANGLE - THE DANCE FLOOR\n</b><b> \n</b>\tImmediately from the glances of the other men at the dance, he is the \n\tcynosure of all eyes. He has new status. It's a heady feeling because \n\tshe is the first white girl he has ever been with socially who is not \n\tan obvious whore. He begins to show off a little, cuts a few fine \n\tsteps.\n<b> \n</b>\tTWO-SHOT. They are dancing closer than before. Sophia begins to rock \n\this black world. \n\n<b>\tCLOSE - MALCOLM \n</b>\n\tTrying to play it cool -- but he is beginning to pant. Not from the \n\tdancing, but from the situation: a gorgeous white chick asking for\n \tit.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tWhy don't you take your little girl home, Red, \n\t\tand come on back?\n<b> \n</b>\tHe stops in his tracks. He can't believe it.\n<b> \n</b>\t\t\t\tSOPHIA (contd) \n\t\tJust walk. Don't run. It'll be here when you \n\t\tget back. \n\n\tHe can only grin.\n\n<b>18\tEXT. LAURA'S HOUSE - ROXBURY - NIGHT \n</b>\n\tThe porch of a respectable house. Malcolm with Laura; he anxious to get \n\taway.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI better not come in.\n<b>  \n</b><b>\t\t\t\tLAURA\n</b>\t\tI ain't stupid.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI mean it's late, baby.\n<b> \n</b><b>\t\t\t\tLAURA\n</b>\t\tI know where you're going.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm going to bed. I gotta work tomorrow, need \n\t\tmy rest.\n<b> \n</b>\tLaura walks to the door.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tBaby, I'll call you tomorrow.\n<b> \n</b><b>\t\t\t\tLAURA\n</b>\t\tWhat for? I ain't white and I don't put out. \n\n\tThe front door opens, it's Laura's grandmother, MRS. JOHNSON.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t'Night, Mrs. Johnson.\n<b> \n</b>\tHe runs down the porch steps.\n<b> \n</b><b>19\tINT. SOPHIA'S CAR - NIGHT\n</b><b> \n</b>\tThe lone light emits from the car radio which plays The Inkspots' \"IF I\n<b> \tDIDN'T CARE.\"\n</b><b> \n</b><b>\tANGLE - SOPHIA\n</b><b> \n</b>\tSophia pulls her tight sweater over her head to expose two full ripe \n\twhite breasts. Malcolm's eyes are popping out of his head. NOTE: It's \n\tvery unusual for women not to wear a bra back in that day but you might \n\tsay Sophia was way ahead of her time.\n<b> \n</b><b>\t\t\t\tSOPHIA\n</b>\t\tMalcolm, look at them. Have you ever seen white \n\t\tbreasts like these?\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tHe shakes his head.\n<b> \n</b>\t\t\t\tSOPHIA (contd) \n\t\tPut your black hands on them.\n<b> \n</b>\tHe is paralyzed.\n\n\t\t\t\tSOPHIA (contd) \n\t\tPlease do as I say.\n<b> \n</b>\tMalcolm mumbles something. He then kisses Sophia as if his black life \n\tdepended on it and he commences to kill it.\n<b> \n</b>\t\t\t\tSOPHIA (contd) \n\t\tHey, baby.\n<b> \n</b> \tShe stops him for a moment, but he buries his head in her long neck.\n<b> \n</b>\t\t\t\tSOPHIA (contd) \n\t\tAm I the first white woman you've been with? \n\n\tShe already knows the answer. He laughs.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSheeet, you ain't. I had aplenty.\n<b> \n</b><b>\t\t\t\tSOPHIA\n</b>\t\t...That isn't a whore?\n\n\tKnowing she's right, Sophia becomes the aggressor. \n\n\tA beat -- both panting -- then Malcolm stops abruptly. He raises his \n\thand to his face, then to Sophia's hand which is still caressing him.\n<b> \n</b><b>\t\t\t\tSOPHIA\n</b>\t\tThat's alright. Baby, take your time. Sophia's \n\t\tnot going anywhere. I told you to walk, don't \n\t\trun.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tShhhh! I don't like women that talk.\n<b> \n</b><b>\tCLOSE - SOPHIA\n</b>\n\tShe shrugs, then moves to embrace him.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tWho wants to talk? \n\n\tThe couple starts at it again. \n\n<b>19A\tINT. MOVIE THEATRE - DAY\n</b><b> \n</b>\tOn the screen, Bogart and Cagney are blasting away the dirty, flat-\n\tfooted coppers with machine guns. It's one of those great Warner \n\tBrothers gangster B movies, maybe _The Roaring Twenties_.\n<b> \n</b><b>\tANGLE - MALCOLM AND SHORTY\n</b><b>  \n</b>\tMalcolm and Shorty sit, transfixed in their seats.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDon't you know, you can't hump the Bogart.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tEat lead, coppers.\n<b> \n</b><b>80 \tEXT. BOSTON COMMONS - DAY\n</b><b> \n</b>\tA bright, sunny day, long shadows in the park. The Commons is almost \n\tempty. Two improbable zoot-suited blacks race past trees, and run over \n\tthe grass. Malcolm and Shorty are playing Cops and Robbers while \n\tPASSERSBY stare.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tBang, bang. You're dead.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNaw, you missed me, copper. Try this on for \n\t\tsize. \n\n\tMalcolm fires an imaginary tommy machine gun at Shorty.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tI forgot to tell you I'm wearing a bulletproof \n\t\tvest.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThe hell you are.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tI'm tired of always playing the cops. I wanna \n\t\tbe Bogart sometimes.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou're too small to be Bogart.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tI'm not too short to be Cagney.\n<b> \n</b>\tShorty shoots Malcolm from behind.\n<b> \n</b>\t\t\t\tSHORTY (contd) \n\t\tPow. Take that.\n<b> \n</b>\tMalcolm acts as if he's been hit.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAhhh! You got me, you dirty, filthy, rotten, \n\t\tstinking copper, only a low-down yellow rat \n\t\tbastard would shoot a man in the back.\n<b> \n</b>\tMalcolm starts to stagger, this is a long drawn out Hollywood drawn-out \n\tdeath a la Cagney death in _Public Enemy_. \n\n<b>\tLOW ANGLE - MALCOLM\n</b><b> \n</b>\tMalcolm falls directly into the camera, face first, and Shorty stands \n\tover him.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tHe use to be a big shot.\n<b> \n</b><b>21\tOMIT \n</b>\n<b>22\tOMIT\n</b>\n<b>23 \tOMIT \n</b>\n<b>24 \tOMIT \n</b>\n<b>25 \tOMIT \n</b>\n<b>26 \tEXT. THE TROLLEY TRACKS - NIGHT (REMEMBERED TIME)\n</b><b> \n</b><b>\tMATCH CUT\n</b>\n<b>\tCLOSE EARL LITTLE \n</b>\n\tEarl Little's face is in the same exact position as Malcolm's from the \n\tprevious scene. His mouth opens in terror as the moving trolley comes \n\tcloser and closer to the black man lying on the tracks.\n<b> \n</b><b>27 \tINT. A HEARING ROOM - DAY\n</b><b> \n</b>\tA room, clinically empty; table, chair, and MR. HOLWAY. He is putting \n\tpapers into his briefcase; the hearing is concluded.\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tWhat you mean took his own life?!\n<b> \n</b><b>\t\t\t\tHOLWAY \n</b>\t\tI'm sorry, ma'am. You heard the verdict. A man \n\t\tbash in the back of his head with a hammer, lay \n\t\tdown on the tracks and kill himself! We merely \n\t\tact on the verdict. We don't make them.\n<b> \n</b>\tHe is nearly out the door.\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tDo you pay or don't you?\n<b> \n</b><b>\t\t\t\tHOLWAY \n</b>\t\tRead the policy, ma'am. It clearly states.\n<b> \n</b><b>28\tOMIT\n</b><b> \n</b><b>29 \tINT. SOPHIA'S APARTMENT - MORNING\n</b><b> \n</b>\tMalcolm lies in bed, naked under the sheet. A half-empty whiskey bottle \n\tand an ashtray full of butts are on the night table: last night's \n\tpartying.\n<b> \n</b><b>\t\t\t\tSOPHIA\n</b>\t\tYou like 'em scrambled soft or hard, sweetie?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tC'mere.\n<b> \n</b>\tWIDEN TO SHOW SOPHIA at the stove fixing eggs. She wears an apron and \n\tnothing else. It's a nicely furnished middle-class apartment.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tSweetie, they're almost ready.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou hear me, girl?\n\n\tShe shrugs, shuts off the burner, smiles and ambles toward him. \n\n<b>\t\t\t\tSOPHIA \n</b>\t\tYou the man. \n\n<b>\t\t\t\tMALCOLM \n</b>\t\tYou better believe it. \n\n\tShe starts to sit down on the bed next to him. \n\n\t\t\t\tMALCOLM (contd) \n\t\tSit over there.\n\n\tHe points to a nearby chair. Sophia makes an amiable hand-shrug and \n\tcomplacently goes.\n\n<b>\t\t\t\tSOPHIA \n</b>\t\tYou evil this morning. \n\n<b>\t\t\t\tMALCOLM \n</b>\t\tWhat's your story, baby?\n<b> \n</b>\tHe doesn't want to hear her; he wants to talk. He goes right on: \n\n\t\t\t\tMALCOLM (contd) \n\t\tYou one of them white bitches can't get enough \n\t\tblack dick. Is that what you are?\n\n\tSophia smiles. She aims to please. Malcolm smacks the bed next to him. \n\tShe gets up and comes over.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tTake it off.\n<b> \n</b>\tShe takes off the apron.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tNow kiss my feet. Kiss 'em!\n<b> \n</b><b>\tCLOSE - SOPHIA \n</b>\n\tAs Sophia bends to do so.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tFeed me.\n<b> \n</b>\tANGLE. Sophia now has the scrambled eggs on a plate at Malcolm's side. \n\tShe spoons some into his mouth. He chews and swallows slowly, then \n\tgrabs her head and brings it to his. A long, brutal kiss. Then he pulls \n\ther head away by the hair. She looks at him: anything he wants.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYeah, girl; that's your story. When you gonna \n\t\tholler \"rape,\" sister?\n<b> \n</b><b>\t\t\t\tSOPHIA\n</b>\t\tMe?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou will, baby -- if the time come.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tLemme feed you, sweetie, while they hot. \n\n\tMalcolm lays back on the pillow and she holds out the eggs to him.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSure wish your mama and papa could see you now. \n\t\tAnd that ofay you gonna marry. \n\n<b>30\tEXT. A BEACH - BRIGHT SUNLIGHT - DAY\n</b><b> \n</b>\tMalcolm and Laura are on a deserted Cape beach. They are dressed but \n\thave their shoes and socks off, and he has his trousers rolled up. They \n\twalk, like birds, avoiding getting their feet wet as the waves roll in.\n<b> \n</b><b>\t\t\t\tLAURA\n</b>\t\tMalcolm, you can be anything you want. You got \n\t\tclass and you're smart.\n<b> \n</b><b> \t\t\t\tMALCOLM \n</b>\t\tAll them books you read and you still don't \n\t\tknow nuthin.\n<b> \n</b><b>\t\t\t\tLAURA\n</b>\t\tI do know I love you.\n\n\tLaura stops him and moves to him. Her kiss is a tender one, exploratory. \n\tThen Malcolm responds, embracing her fully. Her arms go around him as \n\tthey both drop into the sand. \n\n<b>\tCLOSE - MALCOLM AND LAURA\n</b><b> \n</b><b>\t\t\t\tLAURA\n</b>\t\tOh, Malcolm, I love you. Please, there's no one \n\t\taround. Now?\n<b> \n</b>\tMalcolm turns his head from her, he gets up.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet's go.\n<b> \n</b><b>\t\t\t\tLAURA\n</b>\t\tWhy? Is it because of your white gal? Folks say \n\t\tyou're running around town with her.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSave it, baby. Save it for Mr. Right, 'cause \n\t\tyour grandma's smarter than ya think.\n<b> \n</b>\tShe looks at him.\n<b> \n</b><b>\t\t\t\tLAURA\n</b>\t\tShe raised me, my mother died when I was six. \n\t\tIs your mother alive?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYeah, she's alive.\n<b> \n</b><b>31 \tOMIT\n</b>\n<b>32\tOMIT\n</b>\n\n<b>33\tINT. DRUGSTORE - EVENING \n</b>\n\tLaura is eating a banana split. Malcolm is smoking and drinking coffee.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou know how dumb I was? I used to think that \n\t\t\"Not For Sale\" was a brand name.\n<b> \n</b>\tLaura looks over. She doesn't understand.\n<b> \n</b><b>34\tINT. LITTLE KITCHEN - DAY\n</b><b> \n</b>\tLouise's hand reaches for a small sack of flour stamped \"Not For Sale.\" \n\tShe brings it down on the table with a hard, controlled whap.\n<b> \n</b><b>\t\t\t\tMISS DUNNE'S VOICE \n</b>\t\tI did knock.\n<b> \n</b>\tLouise doesn't look up.\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tDid you hear me say come in?\n<b> \n</b>\tWIDEN TO SHOW Louise with a WHITE SOCIAL WORKER, MISS DUNNE complete \n\twith pad, pencil and goodwill. Huddled out of sight, but nonetheless \n\tvisible, are five small BLACK CHILDREN.\n<b> \n</b><b>\t\t\t\tMISS DUNNE\n</b>\t\tThere's no point in fighting about it. I'm \n\t\tsorry. May I sit down?\n<b> \n</b>\tLouise is very aware of the children and struggling for self-possession.\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tAs you nice enough to ask, we'll git you one. \n\n\tOne of the children brings over a chair. Miss Dunne sets out her papers.\n<b> \n</b><b>\t\t\t\tMISS DUNNE\n</b>\t\tIt's the same questions, Mrs. Little. Since the \n\t\tdeath of your husband--\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tMurder.\n<b> \n</b><b>\t\t\t\tMISS DUNNE\n</b>\t\t-- there is a serious question as to whether --\n<b> \n</b><b>                         LOUISE\n</b>\t\tThese  are  my  children. Mine. And they ain't \n\t\tno question. None.\n<b> \n</b><b>\t\t\t\tMISS DUNNE\n</b>\t\tI think sometimes, Mrs. Little, candor is the \n\t\tonly kindness.\n<b>  \n</b><b>\tPAN THE CHILDREN'S FACES\n</b><b> \n</b>\t\t\t\tMISS DUNNE (contd) \n\t\tAll of your children are delinquent, Mrs. \n\t\tLittle, and one, at least, Malcolm is a thief.\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tGet out.\n<b> \n</b><b>\t\t\t\tMISS DUNNE\n</b>\t\t\t(still sitting) \n\t\tYour control over your children, therefore--\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tDid you hear me?!\n<b> \n</b><b>\t\t\t\tMISS DUNNE\n</b>\t\tYou'll regret this, Mrs. Little.\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tIf you don't move out through that door, you're \n\t\tgoing to be past all regretting.\n<b> \n</b>\tThe terror-stricken children huddle together.\n<b> \n</b>\tFREEZE FRAME. It becomes a still.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tWe were parceled out, all five of us. I went to \n\t\tthis reform school and lived at this woman's \n\t\thouse. She was in charge.\n<b> \n</b><b>34A \tA SMALL CLEAN ROOM WITH A COT, A CHAIR AND A BUREAU.\n</b><b> \n</b><b>\t\t\t\tMRS. SWERLIN \n</b>\t\t\t(motherly, friendly) \n\t\tThis is your room, Malcolm. I know you'll keep \n\t\tit clean.\n\n<b>34B \tA DINING ROOM TABLE. FIVE WHITE BOYS AROUND IT.\n</b><b> \n</b><b>\t\t\t\tMRS. SWERLIN \n</b>\t\tThis is Malcolm, our new guest. We'll treat him \n\t\tlike a brother.\n<b> \n</b><b>34C \tA CLASSROOM.\n</b><b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tI was special. The only colored kid in class. I \n\t\tbecame a sort of mascot. Like a pink poodle.\n<b> \n</b><b>34D\tKIDS PLAYING IN THE SCHOOL YARD.\n</b><b> \n</b><b>\t\t\t\tMALCOLM'S VOICE \n</b>\t\tI didn't know then that I was a nigger.\n<b> \n</b><b>\tMALCOLM PLAYING BASKETBALL.\n</b>\n<b>34E\tMALCOLM SPEAKING BEFORE HIS CLASS. \n</b>\n<b>34F\tMALCOLM DOING HOMEWORK. \n</b>\n<b>34G\tA HORSE HAVING ITS TEETH EXAMINED.\n</b><b> \n</b><b>\t\t\t\tMRS SWERLIN \n</b>\t\tHe's bright.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE \n</b>\t\tThey talked about me like\n<b> \n</b><b>34G\tCONTD\n</b><b> \n</b>\t\tMRS SWERLIN (contd) \t\tMALCOLM'S VOICE (contd)\n\tGood grades. \t\t\tI wasn't there. Like I was some\n\tFine athlete.\t\t\tkind of pedigreed dog or a horse.\n\tPresident of his class.\t\tLike I was invisible.\n<b> \n</b><b>      \n</b><b>36 \tINT. OSTROWSKI'S CLASSROOM - DAY\n</b><b> \n</b>\tOSTROWSKI is talking to Malcolm, it's after school, the classroom is \n\tempty.\n<b> \n</b><b>\t\t\t\tOSTROWSKI \n</b>\t\tThe important thing is to be realistic. We all \n\t\tlike you. You know that. But you're a nigger \n\t\tand a lawyer is no realistic goal for a \n\t\tnigger...\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBut why, Mr. Ostrowski? I get the best grades. \n\t\tI'm the class president. I want to be a lawyer.\n<b> \n</b><b>36\tINT. THE DRUGSTORE - P.M.\n</b><b> \n</b>\tLaura and Malcolm. Neither is talking. She is simply watching him as he \n\tsips his coffee and puffs on a cigarette. \n\n<b>36A \tINT. OSTROWSKI'S CLASSROOM - DAY\n</b><b> \n</b><b>\t\t\t\tOSTROWSKI \n</b>\t\t...Think about something you can be. You're \n\t\tgood with your hands. People would give you \n\t\twork. I would myself. Why don't you become a \n\t\tcarpenter? That's a good profession for a \n\t\tnigra. Wasn't your pa a carpenter?\n<b> \n</b>\tMalcolm is silent.\n<b> \n</b>\t\t\t\tOSTROWSKI (contd) \n\t\tJesus was a carpenter.\n<b> \n</b><b>36B \tINT. THE DRUGSTORE - P.M.\n</b><b> \n</b><b>\tCLOSE - LAURA\n</b><b> \n</b><b>\t\t\t\tLAURA \n</b>\t\tIt's not the end of the world, Malcolm.\n<b> \n</b><b>37 \tOMIT \n</b>\n<b>38 \tEXT. A SIGN - BLINDING SUNLIGHT - DAY\n</b><b> \n</b>\tIt reads \"KALAMAZOO STATE HOSPITAL FOR THE MENTALLY INSANE\"\n<b> \n</b><b>39 \tINT. A ROOM IN THE HOSPITAL - DAY\n</b><b> \n</b>\tThe room is totally white and Louise sits in a white smock at a window \n\tin a rocking chair. \n\n<b>\tCLOSE LOUISE \n</b>\n\tAs she rocks.\n<b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tI said it just as plain, I said, don't let them \n\t\tfeed that boy no pig, because he got enough of \n\t\tthe devil in him already. I told her she ain't \n\t\tgot no reason talk to me that way cuz' my hair \n\t\tblow in the wind. You want my skin. All right, \n\t\tI'll give it to you. I'll scrape it off. See \n\t\thow you like it.\n<b> \n</b>\tANGLE - Louise starts to sing a Negro spiritual. \n\n<b>\tCLOSE - MALCOLM \n</b>\n\tHe has been standing there in deep pain all along. \n\n<b>\tTHE SOUND OF A SPEEDING TRAIN IS HEARD.\n</b><b> \n</b><b>40 \tEXT. THE YANKEE CLIPPER - DAY\n</b><b> \n</b>\tThe crack train of the New York, New Haven &amp; Hartford speeds through \n\tthe New England countryside.\n<b> \n</b><b>41\tINT. GALLEY OF TRAIN - NIGHT\n</b><b> \n</b>\tTHREE ELDERLY BLACK WAITERS and Malcolm wearing a sandwichman's uniform \n\tare crowded around a portable radio in the galley where food is \n\tprepared. The four stand around TULLY, a bland-faced personification of \n\tfine Pullman service. They are all listening to the JOE LOUIS-BILLY \n\tCONN heavyweight championship fight.\n<b> \n</b><b>\t\t\t\tTULLY\n</b>\t\tNigger, shut up so we can hear.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tC'mon, Joe.\n<b> \n</b><b>\t\t\t\tWAITER #1 \n</b>\t\tTurn it up, Tully.\n<b> \n</b><b>\t\t\t\tTULLY \n</b>\t\tIt is up. Fool be quiet.\n<b> \n</b><b>\t\t\t\tWAITER #2\n</b>\t\tTully, move the antenna. . . .\n<b> \n</b>\tTully turns some knobs.\n<b> \n</b><b>\t\t\t\tWAITER #3\n</b>\t\tThis Mick is tough.\n<b> \n</b><b>\t\t\t\tTULLY \n</b>\t\tJoe is just playing possum. He's waiting for an \n\t\topening. \n\n\tThe waiters are acting as if they are at ringside.\n<b> \n</b><b>\t\t\t\tRADIO ANNOUNCER \n</b>\t\tA left jab to the jaw and a right cross, scored \n\t\tby Louis and Conn is hurt, as Louis rips a \n\t\tright to the jaw. Conn is staggering, but he \n\t\twon't go down. Conn bops a left hook, he's \n\t\treeling around the ring. Louis hooks a left and \n\t\ta right to the jaw and Conn is down. \n\n\tThe waiters are going crazy.\n<b> \n</b><b>\t\t\t\tRADIO ANNOUNCER \n</b>\t\tHe's taking the count, four, five, six, seven, \n\t\the's on his back, eight, nine, he's getting up, \n\t\tno! The referee says it's over. The bout has \n\t\tstopped.\n\n\tThe waiters are all jumping up and down when the galley door opens. MR.\n \tCOOPER, the white man in charge of the kitchen, pops his head in.\n<b>  \n</b><b>\t\t\t\tCOOPER \n</b>\t\tWhat in hell's going on?\n<b> \n</b>\tIn a moment's notice Tully and the others have resumed their customary \n\tservient roles.\n<b> \n</b><b>\t\t\t\tTULLY \n</b>\t\tNothing, Mr. Cooper.\n<b> \n</b><b>\t\t\t\tCOOPER \n</b>\t\tGot a lot of hungry customers out there.\n<b> \n</b><b>\t\t\t\tTULLY \n</b>\t\tYes sir, Mr. Cooper, soup done finished.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tOn my way, Mr. Charlie.\n<b> \n</b>\tCooper eyes him narrowly.\n<b> \n</b><b>\t\t\t\tCOOPER \n</b>\t\tThe name is Mr. Cooper and don't you forget it. \n\t\tMr. Cooper.\n<b> \n</b><b>\t\t\t\tRADIO ANNOUNCER \n</b>\t\tThe winner and still champion, Joe Louis, but \n\t\twhat a fight Billy Conn gave.\n<b> \n</b><b>42 \tOMIT \n</b>\n<b>43\tOMIT\n</b>\n<b>44\tOMIT\n</b>\n<b>45\tINT. A PASSENGER TRAIN - DAY \n</b>\n\tAs Malcolm hefts his sandwich basket and a large container of coffee \n\tdown the aisle, hawking as he goes.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tGet your good haaaam and cheeeeese sandwiches. \n\t\tI got coffee, I got cake and I got ice cream \n\t\ttoo. Right chere.\n<b> \n</b><b>\tANGLE FAVORING A WHITE CUSTOMER, BLADES.\n</b>\n<b>\t\t\t\tBLADES \n</b>\t\tHey, boy. Gimme a cheese on white and coffee.\n<b> \n</b>\tMalcolm's mood is exuberant: the fight is still in his ears. He makes \n\tthe delivery with a flourish and a smile.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYes, sir. Best in the house.\n<b> \n</b><b>\t\t\t\tBLADES \n</b>\t\tYou mighty pleased with yourself, boy.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYes, sir. I aims to please.\n<b> \n</b><b>\t\t\t\tBLADES \n</b>\t\tI like you, boy.\n<b> \n</b>45A\tINSERT - FANTASY PROJECTION. Malcolm picks up a slab of cream pie and \n\tpushes it in Blades' face. \n\n<b>45B\tBACK TO THE PASSENGER CAR \n</b>\n\tNormality again: Malcolm finishes serving him with complete servility. \n\tHe pulls out a bill.\n<b> \n</b><b>\t\t\t\tBLADES \n</b>\t\tKeep the change.\n<b> \n</b>\tAnd takes a satisfying bite out of his thin sandwich. \n\n<b>46\tEXT. THE RAILROAD TRACKS IN HARLEM - P.M. \n</b>\n\tAs the Clipper surfaces in Harlem, pulls up to the 125th Street \n\tstation.\n<b> \n</b><b>47\tEXT. 125TH STREET STATION - P.M.\n</b><b> \n</b>\tMalcolm, out of uniform and dressed in his zoot suit, comes down from \n\tthe Park Avenue station in Harlem. He is hit with the sights and sounds. \n\tEverything delights him: the noise, the lights, the women, the pimps, \n\tthe signs, the windows, the crowds, the laughter, the music.\n<b> \n</b><b>48\tOMIT\n</b><b> \n</b><b>49\tOMIT\n</b>\n<b>50\tOMIT\n</b>\n<b>51\tANGLE - CROWD \n</b>\n\tA CROWD OF PEOPLE run by Malcolm yelling and screaming.\n<b> \n</b><b>\t\t\t\tCROWD\n</b>\t\tThe Brown Bomber, The Brown Bomber, Joe Louis, \n\t\tthe heavyweight champion of the world. Joe got \n\t\tthe belt back. Lawd have mercy. Great day in \n\t\tthe morning.\n<b>  \n</b><b>50A\tCLOSE - MALCOLM\n</b>\n\tHe runs after them.\n\n<b>50B \tEXT. 125TH AND LENOX AVENUE\n</b><b> \n</b>\tAll traffic has stopped, there is a huge spontaneous celebration going \n\ton. Black folks are everywhere, it seems as if all of Harlem is out on \n\tthe streets. The citizens of Harlem are hugging, kissing, drinking, \n\tdancing, folks are hanging from street lamps, yelling out their \n\twindows, holding up hand-made JOE LOUIS banners, everyone has great \n\treason to be joyous. The heavyweight champion of the world is a BLACK \n\tMAN -- JOE LOUIS, THE BROWN BOMBER, he has regained his championship.\n<b> \n</b><b>\tCLOSE: - MALCOLM\n</b><b> \n</b>\tMalcolm quickly looks at his watch, he's running late for his train, as \n\the fights his way through the crowd like a salmon going upstream, the \n\tCAMERA CRANES up to see him eventually get lost in a sea of BLACK \n\tHUMANITY \"cutting loose.\" \n\n<b>\t\t\t\t\t\t\t\tFADE OUT.\n</b><b> \n</b><b>51-\tOMIT\n</b>\n<b>56-\tOMIT \n</b><b> \n</b><b>FADE IN:\n</b><b> \n</b><b>57\tEXT. SEVENTH AVENUE - NIGHT\n</b><b> \n</b>\tMalcolm, newly conked and sharp as a tack (zoot suit, trouser crease \n\tlike a knife's edge, orange knob-toed shoes) walks toward his goal: \n\tSmall's Paradise.\n<b> \n</b>\tThe street is crowded with PEOPLE, KIDS and HUSTLERS.\n<b> \n</b><b>\t\t\t\tYOUNG HOOKER \n</b>\t\tSlow down, daddy, what's your hurry? Lemme show \n\t\tyou somepin brand new.\n<b> \n</b>\tMalcolm smiles \"No thanks\" keeps moving.\n<b> \n</b><b>\t\t\t\tHUSTLER \n</b>\t\tHey, man, hundred-dollar ring -- diamond; and a \n\t\tninety dollar watch. Take the both of them for \n\t\ta quarter; twenty-five bucks.\n\n \tMalcolm waves; he's not having any. Goes on.\n\n<b>58\tEXT. SMALL'S PARADISE - NIGHT\n</b><b> \n</b>\tBefore entering, Malcolm sharps himself a bit, picking off some lint,\n\tcocking his hat. And enters.\n\n<b>59\tINT. SMALL'S PARADISE - NIGHT\n</b><b> \n</b>\tThe restaurant is crowded, both at the bar and at the tables beyond.\n\tThe immediate impression is of subdued well-being, of decorum, of easy \n\taffluence. This is the world Malcolm wants into. He digs it, drinking \n\tin its details.\n<b> \n</b><b>\tANGLE - BAR\n</b>\n\tA big man, FOX, accidentally bumps into Malcolm almost knocking over.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThe word is excuse me.\n<b> \n</b><b>\t\t\t\tFOX \n</b>\t\tLook, country boy, you shouldn't have been in \n\t\tmy way.\n<b> \n</b>\tEveryone becomes quiet in the bar.\n<b> \n</b>\t\t\t\tFOX (contd) \n\t\tSo what are you gonna do? Go run home to your \n\t\tMama.\n<b> \n</b>\tMalcolm grabs a bottle off the bar counter and with lightning speed\n\tbrings it crashing down on Fox's head. As he lays on the floor with \n\thead bleeding, Malcolm kicks him in the stomach _two times_. It's done,\n \tthe fight is over and people pull him off of Fox.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDon't ever again in life step on my Florsheims \n\t\tagain, and never talk-bout my mother.\n<b> \n</b><b>\tANGLE WITH MALCOLM AND THE BARTENDER\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tGimme a whiskey.\n<b> \n</b>\tBARTENDER pours him a double.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI ordered a single, Jack.\n<b> \n</b><b>\t\t\t\tBARTENDER\n</b>\t\tThe double's on that gentleman. Jack!\n<b> \n</b>\tHe points.\n\n<b>\tARCHIE AT THE TABLE - FROM MALCOLM'S POV\n</b><b>  \n</b>\tThe elderly man nods. He is big, he is very black. The same color as \n\tMalcolm's father. \n\n<b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tHe raises his glass, toasts Archie and downs it. Then leaning into the \n\tbar, asks:\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWho is he, man?\n<b> \n</b><b>\t\t\t\tBARTENDER\n</b>\t\tThat's West Indian Archie.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhut's he do?\n<b> \n</b>\tThe bartender would not normally answer this, but Malcolm is the man of \n\tthe moment, so the bartender speaks:\n<b> \n</b><b>\t\t\t\tBARTENDER\n</b>\t\tThis and that.\n<b> \n</b>\tMalcolm nods, then looks over again at Archie -- in appreciation. \n\tArchie wiggles a finger for him to come over.\n<b> \n</b><b>59A \tAT ARCHIE'S TABLE\n</b><b> \n</b>\tMalcolm is standing.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tSit down. We ain't fixing to eat you. You look \n\t\tbrand new in town. Pretty handy with a bottle.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHe had it coming.\n<b> \n</b>\tMalcolm sits. There are no introductions. He just nods at SAMMY and \n<b>\tCADILLAC.\n</b><b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tWhat they call you?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tRed, and I ain't no punk.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYou better not be. Cause if a cat toe you down \n\t\tin this town, you better stand up or make \n\t\ttracks.\n<b> \n</b><b>\t\t\t\tSAMMY\n</b>\t\tMan live by his rep.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tThat's a fact. What you do, boy?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm working trains. Selling.\n<b> \n</b><b>\t\t\t\tARCHIE\n</b>\t\tBet you like that shit.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tKeeps me out of the army.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tWhen they want your ass, won't nothing keep you \n\t\tout.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNot this boy... I ain't fighting their war. I \n\t\tgot my own. Right chere. Heard tell you're a \n\t\tgood man to know.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tHeard where?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhere I come from. Boston.\n<b> \n</b>\tSammy and Cadillac are watching a little skeptically. Archie is \n\tflattered.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tSombitch and I ain't never been to Beantown.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan's rep travels.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tHow 'bout that?\n<b> \n</b>\tThen seeing Sammy and Cadillac's dubious visages, Archie adds:\n<b> \n</b>\t\t\t\tARCHIE (contd) \n\t\tYou ain't bullshitting me, is you, boy?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMy papa taught me one thing: don't never \n\t\tbullshit a West Indian bullshit artist.\n\n\tArchie laughs. Even Sammy smiles. Cadillac still holds his judgment.\n<b>  \n</b><b>\t\t\t\tARCHIE \n</b>\t\tIs your papa West Indian?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNo, my mama. She's from Grenada.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tI like you, country.\n<b> \n</b><b>\t\t\t\tSAMMY\n</b>\t\tOnly where'd you get them goddam vines.\n<b> \n</b><b>\t\t\t\tCADILLAC \n</b>\t\tAnd them shoes. Oh, my.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYeah, got to do something about you.\n<b> \n</b><b>\t\t\t\tSAMMY\n</b>\t\tYou putting a hurtin' on my vision.\n<b> \n</b>\tSammy covers his eyes. Malcolm plays off the insults.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhere can I get a hold of you?\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYOU can't. I'll get a hold of you.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLemme write it down for you.\n<b> \n</b>\tMalcolm reaches for a pencil.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tDon't never write nothing down. File it up \n\t\there, like I do.\n\t\t\t(touching his head) \n\t\t'Cause if they can't find no paper they ain't \n\t\tgot no proof. Ya dig?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYes, sir.\n<b> \n</b>\tArchie looks at him sharply.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tBoy, look me in the face.\n<b> \n</b>\tMalcolm does so.\n\n\t\t\t\tARCHIE (contd) \n\t\tDid you just now con me?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYes, sir.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tWhy?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t'Cause I want in. And it don't take a lot to \n\t\tknow you there, daddy.\n\n\tArchie and Sammy laugh at his directness. Cadillac smiles. Archie \n\tpushes back his chair, about to get up. \n\n<b>\t\t\t\tARCHIE \n</b>\t\tI got me a little run to make.\n<b> \n</b>\tMalcolm has suddenly been excluded and he wants desperately back in.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCan I run with you, Mr. Archie?\n<b> \n</b>\tArchie eyes him, weighing him seriously.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tI like your heart and I like your style. You \n\t\tmight just do, Little. Lessen you got to git \n\t\tback to that train job.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI done told the man what he could do with his \n\t\ttrain.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tWhen?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tJust now.\n<b> \n</b>\tThe three established hustlers smile at the newcomer in their midst.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tCome on, baby. We going shopping...\n\n<b>60\tOMIT\n</b>\n<b>61\tOMIT\n</b>\n<b>62\tOMIT\n</b><b> \n</b><b>63 \tINT. ARCHIE'S ROOM - NIGHT\n</b><b> \n</b>\tMalcolm is looking at himself in a mirror in Archie's room. He has on \n\tthe full outfit now, together with a new white on white shirt and a \n\tSulka tie. Looks great.\n<b> \n</b><b>\t\t\t\tARCHIE\n</b>\t\tJust the middle button, baby. Just the middle \n\t\tone.\n<b> \n</b>\tMalcolm buttons the jacket and turns around, demonstrating for Archie's \n\tinspection.\n<b> \n</b>\t\t\t\tARCHIE (contd) \n\t\tYou looking good, Little. Real clean. Clean as \n\t\tthe Board of Health. But you missing something.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat?\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tFrisk me, baby. Give me a real pat down.\n<b> \n</b>\tMalcolm doesn't understand, but he senses something -- and becomes \n\texcited. Archie has walked over to him.\n<b> \n</b>\t\t\t\tARCHIE (contd) \n\t\tGo ahead. Do me.\n<b> \n</b>\tMalcolm frisks him carefully: pats his sides, his pockets, under his \n\tarms, his legs. Archie is clean to the touch.\n<b> \n</b>\t\t\t\tARCHIE (contd) \n\t\t\t(triumphantly) \n\t\tAnd I'm still carrying.\n\n\tHe smacks the small of his back. Then, reaching under his coat, he \n\ttakes a revolver out from the middle of his back. And hands it to \n\tMalcolm.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tHolding the deadly instrument, fascinated by it, hefting it, feeling \n\tits power.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tIt's yours, baby. Put it on.\n\n\tMalcolm slips it carefully into the small of his back, behind his \n\ttrouser belt. His first gun: the feeling shines in his eyes, Bogart has \n\tbecome a black man.\n\n\t\t\t\tARCHIE (contd) \n\t\tHow's it feel?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSolid, daddy.\n<b> \n</b><b>\t\t\t\tARCHIE\n</b>\t\tOkay, baby. Now you outfitted. You ready to \n\t\ttackle the street?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet 'em come. I'm ready.\n\n<b>64\tINT/EXT. VARIOUS LOCATIONS - SERIES OF CLOSE SHOTS \n</b>\n\tA FIVE DOLLAR BILL. CAMERA GOES IN for the last three digits. \n\n64A\tSTOCK MARKET BOARD at the end of a day's trading. GO IN for the last \n\tthree numbers.\n<b> \n</b>64B\tPREACHER in a pulpit, reading from the Bible.\n<b> \n</b><b>\t\t\t\tPREACHER \n</b>\t\tLet us turn to the Gospel according to St. \n\t\tJohn. Chapter 3, Verse  83.\n<b> \n</b><b>\t\t\t\tA VOICE \n</b><b>\t\t3, 8, 3.\n</b><b> \n</b>\tMalcolm scribbles the number onto a piece of paper.\n<b> \n</b><b>64C\tA CASH REGISTER\n</b><b> \n</b>\tRinging up an amount: $2.98.\n<b> \n</b><b>\t\t\t\tA VOICE \n</b><b>\t\t2, 9, 8.\n</b><b>  \n</b>\tMalcolm's hand writes out the number.\n<b> \n</b><b>64D\tCLOSE - TRAIN TERMINAL SIGN\n</b><b> \n</b>\tIt reads \"New York to Chicago.\" PAN DOWN TO SHOW \"Train arrives 1:05.\"\n<b> \n</b><b>\t\t\t\tVOICE\n</b><b>\t\t1, 0, 5.\n</b>\n\tArchie with Malcolm as the latter writes down \"1, 0, 5.\"\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tI told you less paper, less trouble. \n\n<b>\t\t\t\tMALCOLM \n</b>\t\tI'm working on it.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tI keep all my numbers in my head. I've never \n\t\twritten any down.\n<b> \n</b>\tHe taps his head.  \n\n<b>64E \tCLOSE - FACE OF AN ELDERLY WOMAN\n</b><b> \n</b><b>\t\t\t\tELDERLY WOMAN \n</b>\t\tI saw it in my dream. 5, 5, 5. And last week my \n\t\tsister had a dream and she hit.\n<b> \n</b><b>64F \tCLOSE - FACE OF AN ELDERLY BARBER\n</b><b> \n</b><b>\t\t\t\tBARBER \n</b>\t\tI got it from Ching Chow. It got to be 2, 5, 1.\n<b> \n</b><b>65 \tOMIT \n</b>\n<b>66 \tOMIT \n</b>\n<b>67 \tOMIT \n</b>\n<b>68 \tOMIT \n</b>\n<b>68A \tINT. MOVIE THEATRE - NIGHT\n</b><b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tWE ARE TIGHT ON Malcolm's intense face, he is pulling on a fat joint. \n\tWe hear BOGART blasting his way out of a police blockade. \n\n\tA phone rings.\n<b> \n</b><b>69 \tOMIT \n</b>\n<b>70 \tOMIT\n</b><b> \n</b><b>71 \tINT. ARCHIE'S ROOM - NIGHT\n</b><b> \n</b> \tThere is music playing. Wordlessly, Archie sprinkles a few grains of \n\tfine crystal onto a round shaving mirror. He slides it across a table \n\tto Malcolm and hands him a short straw. Sophia sits next to Malcolm; \n\tshe and Archie are already high. Malcolm leans over the mirror, placing \n\tthe straw in his nostril.\n<b> \n</b><b>\tTIGHT CLOSE SHOT - MALCOLM'S FACE\n</b><b> \n</b>\tIn the mirror (something satanic about him) -- as he sniffs the cocaine \n\twell into his nose.\n\n\tA beat as he leans back waiting for the drug to take hold, Malcolm \n\tlooks into dressing mirror.\n\n<b>\t\t\t\tARCHIE \n</b>\t\tIt hit?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNnnnnnn!\n\n\tMalcolm with gun in hand does his Bogart gangster imitation.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tAin't nuthin' in the world to give you that \n\t\treal deep cool. Like girl. You there?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm there, daddy. Wheww. I'm cool enough to \n\t\tkill.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tBet you are.\n<b> \n</b><b>\tCLOSE - MALCOLM \n</b>\n<b>\tFREEZE FRAME\n</b><b> \n</b><b>\t\t\t\tSOPHIA'S VOICE \n</b>\t\tMalcolm, you're so funny.\n<b> \n</b>\tShe continues to laugh. \n\n<b>\tBACK TO REAL TIME.\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou got any money.\n\n\tBefore Sophia can answer he grabs her pocketbook, dumping all the \n\tcontents on the floor but the dough.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tBaby, I was gonna give it to you.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWell, bitch you move too slow.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tSometimes you got a big ugly mouth.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYeah, and I'm putting my money where my ugly \n\t\tmouth is. I'm putting you back in the numbers \n\t\tright now.\n\t\t\t(to Sophia) \n\t\tBaby, what's today?\n<b> \n</b>\tSophia is not sure of this, or anything else.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tAugust 2nd. I think. Yeah.\n<b> \n</b>\tShe laughs at her achievement.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDaddy, put me down for a combination. Combinate \n\t\tme, daddy: 8, 2, 1. You got me? 8, 1, 2; 1, 8, \n<b>\t\t2...\n</b><b> \n</b>\tWith each number he throws a bill at Archie.\n<b> \n</b>\t\t\t\tMALCOLM (contd)\n \t\t1, 2, 8; 2, 8, 1.  I git 'em all?\n\n<b>\t\t\t\tARCHIE \n</b>\t\t\t(angrily taking the money) \n\t\tI'll take your goddam bet.\n<b> \n</b>\tMalcolm slides his tongue down Sophia's throat. \n\n<b>72\tOMIT\n</b>\n<b>73 \tOMIT\n</b>\n<b>74\tOMIT\n</b>\n<b>75\tEXT. SMALL'S PARADISE - NIGHT \n</b>\n\tA miserable night, raining and cold. Malcolm turns into the bar.\n<b> \n</b><b>76 \tINT. THE BAR - NIGHT\n</b><b> \n</b>\tShaking off the rain as Malcolm walks through. He is now a familiar \n\tfigure to the bar's DENIZENS. He is met with ad lib cries: \"Hey, \n\tLittle,\" \"Have a taste,\" from the men; and from the women: \"Come here, \n\tsugar,\" \"Where you been?\"\n<b> \n</b>\tMalcolm acknowledges the greetings, strolls down in the bar. It's \n\timmediately clear that a subtle change has come over him. He is no \n\tlonger the neophyte but a well-groomed, smooth, fully polished hustler.\n\n<b>\tANGLE - BOOTH \n</b>\n\tMalcolm sits into the booth and motions for the waitress.\n<b> \n</b><b>\tANGLE - HONEY\n</b><b> \n</b>\tA fine copper tan waitress comes to him.\n<b> \n</b><b>\t\t\t\tHONEY\n</b>\t\tI thought you said we were going to the movies \n\t\tlast night.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI say a lot of things.\n<b> \n</b><b>\t\t\t\tHONEY\n</b>\t\tAnd like a fool I believe it.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDo your job, Get me a bourbon on the rocks and \n\t\ta pack of Lucky's.\n<b> \n</b>\tHoney stares at him.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tI said now.\n<b> \n</b>\tShe leaves. He leans his head back against the booth --\n<b> \n</b><b>\t\t\t\tA FEMALE VOICE \n</b>\t\tDaniel come in yet, Honey?\n<b> \n</b>\tMalcolm turns his head sharply at the sound of the voice. It's \n\tfamiliar, a sound from the seemingly distant past. He looks toward the \n\tbar and sees the women who asked the question.\n<b> \n</b><b>\tLAURA - MALCOLM'S POV\n</b><b> \n</b>\tIt's Laura, but not the Laura we last saw. She is still young, still \n\tvulnerable, but she is bolder, more self-assured, more vividly dressed.\n\tShe is unaware of Malcolm.\n<b> \n</b><b>\t\t\t\tHONEY\n</b>\t\tAin't that him now?\n<b> \n</b>\tANGLE FAVORING DANIEL. He is a young, cocky, nervous, gingerbread \n\tcolored boy who comes over to her quickly. He goes to the corner of the \n\tbar and quickly grabs Laura's neck and kisses her hungrily.\n<b> \n</b><b>\t\t\t\tDANIEL \n</b>\t\tHey, gorgeous, how you been? Waiting long? \n\t\tLemme see you. Wow!\n\n\tIt's obvious he's a junkie. And in need of a fix. QUICK!\n<b> \n</b><b>\tSHOT - MALCOLM\n</b><b> \n</b>\tHoney places his drink and cigarettes before him. He's watching, taking \n\tit all in immediately. Laura is clearly crazy about Daniel. \n\n<b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tHe looks, then belts down his drink. \n\n<b>\tCLOSER - LAURA AND DANIEL \n</b>\n\tDaniel motions to her pocketbook and she takes out a five-dollar bill. \n\tHe grabs it, and bolts for the door. \n\n<b>\tWITH MALCOLM AND HONEY \n</b>\n\tShe has been watching Malcolm.\n<b> \n</b><b>\t\t\t\tHONEY\n</b>\t\tYou know that gal?\n\n<b>\t\t\t\tMALCOLM \n</b>\t\tMind your own goddamn business ... She comes in \n\t\ta lot?\n<b> \n</b><b>\t\t\t\tHONEY\n</b>\t\t'Bout every other night, Red.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWith him?\n\n\tHoney nods.\n<b>  \n</b> \t\t\t\tMALCOLM (contd) \n\t\tShe know?\n<b> \n</b><b>\t\t\t\tHONEY\n</b>\t\tIf she got eyes, she do.\n<b> \n</b><b>\tANGLE - LAURA\n</b>\n\tWalking toward the door, looking for Daniel. She leaves the bar. \n\n<b>\tCLOSE - MALCOLM AND HONEY\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIs she hooking?\n<b> \n</b><b>\t\t\t\tHONEY\n</b>\t\tNot yet. But the way things going, that boy \n\t\tgonna turn her out any day.\n<b> \n</b>\tMalcolm smacks the table in frustration.\n<b> \n</b>\t\t\t\tHONEY (contd) \n\t\tYou stuck on her?\n<b> \n</b><b>\tCLOSE - GLASS\n</b>\n\tMalcolm's glass on the table is trembling. \n\n<b>\t\t\t\tMALCOLM \n</b>\t\tShut up, bitch.\n\n\tHe raises his arm to hit her and it is held back before it can find its\n\tmark.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tDon't do that.\n<b> \n</b>\tArchie is standing above him. Malcolm nods, and Archie lets his arm go; \n\tstanding next to him is Sophia.\n<b> \n</b>\t\t\t\tARCHIE (contd) \n\t\tHoney, he didn't mean it.\n\n\tArchie wiggles his fingers and Honey goes, but not before throwing \n\tdaggers at Malcolm and Sophia. Archie sits down, takes out a cigar. For \n\ta good beat there is a coolness between them. Then Malcolm reaches over \n\tand lights Archie's cigar. Sophia stares at her man, he then motions \n\tfor her to sit down beside him.\n<b> \n</b>\t\t\t\tARCHIE (contd) \n\t\tThanks. You got it. Who's beating on you, Red? \n\t\tYou looking a little up tight.\n\n\tThe father-son thing is back, but Malcolm will never again be the \n\tstudent.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDaddy, where's my money?\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tWhat you talking?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou owe me six big ones.\n<b> \n</b>\tArchie looks at him, non-comprehending.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t1, 2, 8 hit, didn't it?\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYou din't have no 1, 2, 8.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWas you that high? Old man, I threw the slats at\n\t\tyou. I said to combinate me.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYou never had it.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThe bitch was there.\n<b> \n</b>\tArchie doesn't even look at Sophia.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tShit, what else she gonna say?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThen skip it, man. But you slipping, baby. You \n\t\tdone slipped.\n<b> \n</b>\tArchie is controlling himself. Everyone in Small's is all ears, a\n \tfalling out between Malcolm and Archie -- their reps are at stake.\n<b> \n</b>\tANGLE. Archie looks at Sammy. Sammy is neutral. Archie digs in his \n\tpockets, comes up with a roll. He peels off six $100 bills and throws \n\tthem on the table in front of himself, as he gets up.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tOh, sit down, man. What you tasting? I'm buying.\n<b> \n</b><b>\t\t\t\tARCHIE\n</b>\t\tI ain't drinking hot piss with you. Come on, Sam.\n<b> \n</b><b>\t\t\t\tSAMMY\n</b>\t\tBe right there.\n<b> \n</b>\tArchie goes.\n\n\t\t\t\tSAMMY (contd) \n\t\tTwenty-two years he didn't never forget no \n\t\tnumber.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tGot to be a first time, daddy-o.\n<b> \n</b><b>\t\t\t\tSAMMY\n</b>\t\tHe gonna, check the collector he turn into. His \n\t\trep is on the line, boy, and so's yours. If you \n\t\tlying, one of you is dead.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAin't gonna be this mother.\n<b> \n</b>\tSammy goes.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tCome on, sweetlips, I got us some g-i-r-l, \n\t\tgirl. Let's you and me fly.\n<b> \n</b><b>77\tOMIT\n</b><b> \n</b><b>78 \tOMIT \n</b>\n<b>78A\tOMIT \n</b>\n<b>79\tOMIT \n</b>\n<b>80\tOMIT \n</b>\n<b>81\tOMIT\n</b>\n<b>82\tOMIT \n</b>\n<b>83\tOMIT\n</b>\n<b>84\tOMIT \n</b>\n<b>85\tEXT. ONYX CLUB - NIGHT \n</b>\n\tThe well-known 52nd Street nightspot features Billie Holiday. A \n\tstand-up cutout of her is outside.\n<b> \n</b><b>86 \tINT. ONYX CLUB - NIGHT\n</b><b> \n</b>\tThis is a plush nightclub, with a mixed black and white AUDIENCE. Some\n \tof the hustlers from Small's are in evidence. \n\n<b>\tCLOSE - BILLIE\n</b>\n\tLady Day starts into \"YOU DON'T KNOW WHAT LOVE IS.\"\n\n<b>\tANGLE - TABLE\n</b>\n\tMalcolm and Sophia high as a kite and on the town. \n\n<b>\tCLOSE - ARCHIE\n</b>\n\tHe makes his way toward Malcolm's table. There is murder in his eyes.\n\n<b>\tANGLE - TABLE\n</b><b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYou're a damn liar.\n<b> \n</b><b>\tCLOSE - ARCHIE\n</b><b> \n</b>\t\t\t\tARCHIE (contd) \n\t\tYou _took_ me, you bastard, and now I'm taking \n\t\tyou.\n<b> \n</b><b>\tANGLE - TABLE\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIt's me or you, ain't it, Pops?\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYou know it.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'll give you back the 600.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tI don't want your money.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm wearing, Archie.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tThere's two guns on you.\n<b> \n</b>\tHis eyes gesture. Malcolm looks: \n\n<b>\tMALCOLM'S P0V \n</b>\n\tSammy at the nearby bar: his hand in his coat pocket.\n\n<b>\tCLOSE - ARCHIE\n</b><b> \n</b>\tHis hand is also in his pocket.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAnd every cat's watching, ain't they? It's a \n\t\ttoe-down.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tThat's what it is. Walk on out.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet Billie finish.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tNow.\n<b> \n</b>\tArchie backs away from the table, his gun on Malcolm. \n\n\tANGLE. As Sammy moves a step toward Malcolm, Malcolm rises in his seat.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tYou had the number.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBaby, I got to let this old man win. Keep the \n\t\tfaith, and tell Billie I'll see her later.\n<b> \n</b><b>\tCLOSE - BILLIE\n</b><b> \n</b>\tShe knows what's going on.\n<b> \n</b>\tANGLE - Sammy and Archie are walking behind Malcolm, when he pushes a \n\twaitress into their path with drinks flying everywhere, Malcolm darts \n\taway.\n\n<b>87\tINT. ENTRANCE TO THE TOILET \n</b>\n \tHe races into the men's room.\n\n\tANGLE. Archie and Sammy run after him.\n<b> \n</b><b>88\tINT. MEN'S ROOM - NIGHT \n</b>\n\tThere is an open window. Archie is leaning out, looking both ways. \n\n<b>89\tEXT. OUTSIDE THE MEN'S ROOM WINDOW - NIGHT FROM ARCHIE'S POV\n</b><b> \n</b>\tA tiny alleyway. No one is visible.\n\n<b>\t\t\t\tARCHIE \n</b>\t\tThe dirty yellow rat bastard.\n<b> \n</b><b>90\tINT. MEN~S ROOM - NIGHT\n</b><b> \n</b><b>\t\t\t\tSAMMY\n</b>\t\tDon't push it. You way ahead. You back on top. \n\t\tThat boy loves you, man.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tWhat you say?\n<b> \n</b><b>\t\t\t\tSAMMY\n</b>\t\tHe gave it to you, Archie. He did.\n<b> \n</b><b>91  \tEXT. THE STREET - NIGHT\n</b><b> \n</b>\tMalcolm comes running out of an alleyway and onto the street. He stops \n\tto catch his breath, to regain his composure. He is shook up, \n\tfrustrated, but mostly saddened. He then runs down the block and into a \n<b>\tCLOSEUP.\n</b><b> \n</b><b>91A \tINT. LITTLE HOUSE - LANSING MICHIGAN - NIGHT (REMEMBERED TIME) - \n</b><b>\tFINAL FLASHBACK\n</b>\n<b>\tCLOSE - EARL\n</b>\n\tEarl is sitting up in bed, he wakes his sleeping wife Louise, next to \n\ther is a baby in a crib, another child. Malcolm sleeps between Earl and \n\ther.\n<b> \n</b><b>91AA\tANGLE - HOUSE\n</b>\n\tOutside the house are 5 members of THE BLACK LEGION. They are dressed \n\tin the style of the KKK, but in black sheets rather than white. WE SEE \n\tgasoline cans being passed around.\n<b> \n</b><b>\t\t\t\tEARL \n</b>\t\tSomebody out there. Wake the children. \n\n\tEarl starts to put on his overalls and reaches for his gun which sits \n\ton a nearby chair when an explosion of flames greets the house.\n<b> \n</b>\t\t\t\tEARL (contd) \n\t\tEverybody out. OUT! OUT! Get the kids. \n\n<b>\tANGLE - CHILDREN'S BEDROOM \n</b>\n\tFlames roar through the room and the Little kids are hysterical. Louise \n\trushes in and pushes them past the fire, she has infant in hand covered \n\tin a blanket.\n<b> \n</b><b>\tCLOSE - EARL\n</b>\n<b>91C \tEXT. HOUSE - NIGHT\n</b><b> \n</b>\tThe entire house is in flames. The Little family stands in front of it, \n\tjust out of harm's way. \n\n<b>\tANGLE - BLACK LEGION \n</b>\n\tThey sit on their horses watching the results of their work. \n\n<b>\tCLOSE - BLACK LEGION LEADER\n</b><b> \n</b><b>\t\t\t\tBLACK LEGION LEADER \n</b>\t\tBoy, good thing we're good Christians. Nigger, \n\t\tit's time for you to leave this town.\n<b> \n</b><b>\tCLOSE - EARL\n</b><b> \n</b><b>\t\t\t\tEARL \n</b>\t\tThis here is 'pose to be a free country.\n<b> \n</b><b>CLOSE - BLACK LEGION LEADER\n</b><b> \n</b><b>\t\t\t\tBLACK LEGION LEADER \n</b>\t\tRev, we warned you 'bout that Garvey preaching, \n\t\tstirring up the good nigras here. Boy, next \n\t\ttime you're a dead nigger.\n\n<b>\tCLOSE - EARL\n</b>\n<b>\t\t\t\tEARL \n</b>\t\tI ain't a boy. I'm a man, and a real man don't \n\t\thide behind no bedsheets.\n<b> \n</b>\tEarl takes his pistol out from behind his back and fires above their \n\theads.\n<b> \n</b>\t\t\t\tEARL (contd) \n\t\tTake these here bullets for dem sheets.\n<b> \n</b><b>\tANGLE - BLACK LEGION\n</b><b> \n</b>\tThe bullets send the Black Legion flying into the glorious D.W. Griffith\n \tmoonlit night. \n\n<b>\tANGLE - HOUSE \n</b>\n\tThe burning house collapses behind the Little family. \n\n<b>\tANGLE - EARL AND LOUISE\n</b><b> \n</b><b>\t\t\t\tLOUISE \n</b>\t\tEarl, I know you a better shot than that. You \n\t\tshoulda killed 'em all, shot 'em dead.\n<b> \n</b><b>\t\t\t\tEARL\n</b>\t\tJust wanted to scare 'em, they won't be \n\tbothering us no more.\n<b> \n</b><b>\tCLOSE - YOUNG MALCOLM\n</b><b> \n</b>\tYoung Malcolm stares at his father while the house still burns behind \n\thim, no doubt drawing on the great courage displayed by his father.\n<b> \n</b><b>\t\t\t\tEARL \n</b>\t\tThey won't be here no time soon. I'm a MAN! \n\n<b>91D\tEXT. STREET - LANSING - NIGHT (REMEMBERED TIME)\n</b><b> \n</b>\tIt's raining cats and dogs and it's foggy. We hear a big thud, then a \n\tgrunt and Earl Little falls across the trolley tracks, the sound of men \n\trunning away is heard in the distance. \n\n<b>\tANGLE - A STREETCAR APPROACHES\n</b><b> \n</b><b>\tANGLE - EARL ON TRACKS \n</b>\n\tHe has been beaten to a bloody pulp.\n<b> \n</b><b>\tANGLE - CLOSER SHOT OF STREETCAR APPROACHING\n</b><b> \n</b><b>\tCLOSE - EARL \n</b>\n\tHe opens his one good eye. \n\n<b>\tCLOSE - STREETCAR MOTORMAN \n</b>\n\tHe sees something ahead in the fog and rain. \n\n<b>\tANGLE - MOTORMAN'S POV \n</b>\n<b>\tCLOSE - HAND REACHES BRAKE LEVER \n</b>\n<b>\tCLOSE - STREETCAR WHEELS STOPPING, SPARKS FLY \n</b>\n<b>\tCLOSE - MOTORMAN \n</b>\n\tWinces and then makes the Sign of the Cross. \n\n<b>\tANGLE - LONG SHOT OF PASSENGERS \n</b>\n\tJumping out of the streetcar to attend to Earl.\n<b> \n</b><b>\t\t\t\tPASSENGER'S VOICE \n</b>\t\tSomebody get a doctor.\n<b> \n</b><b>\t\t\t\tMOTORMAN'S VOICE \n</b>\t\tNo doctor, get him a priest.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tMy father's skull, on one side was crushed in, \n\t\tand then laid across some tracks, for a \n\t\tstreetcar to run him over. His body was cut \n\t\talmost in half. My father, Earl Little lived \n\t\ttwo and a half hours in that condition. Negroes \n\t\twere stronger than they are now.\n<b> \n</b><b>92\tINT. A CAR - NIGHT\n</b><b> \n</b>\tShorty is driving with Sophia in the front seat. Malcolm is in the \n\tback. They are in the country -- outside New York.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tMan, I'm glad we got you out of there. With \n\t\tWest Indian Archie on your ass, your name on \n\t\tthe wire -- Boston the best goddam place in the \n\t\tworld for you -- things are too hot and it's \n\t\tnot even summer.\n<b> \n</b>\tMalcolm has withdrawn within himself. He takes out a packet of cocaine \n\tand sniffs it.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tWe'll take it easy. I got a place fixed up on \n\t\tHarvard Square. How's that sound?\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tYeah. Cool it and lay dead for a while, Homeboy. \n\t\tAnd don't worry none.\n<b> \n</b>\tThe drug takes hold. Malcolm is out of it.\n<b> \n</b>\t\t\t\tSHORTY (contd) \n\t\tI'll stake you, baby. I got my band. I'm \n\t\tblowing great sax. Hell, you ain't even heard \n\t\tus--\n<b> \n</b>\tHe and Sophia keep talking it up, trying to bolster Malcolm. \n\n<b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tStoned, his nose running, Malcolm stares out of the window at the\n\treceding landscape. FREEZE FRAME.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tLike every hustler I was trapped. Cats that \n\t\thung together trying to find a little security, \n\t\tto find an answer -- found nothing. Cats that \n\t\tmight have probed space or cured cancer -- \n\t\t(Hell, Archie might have been a mathematical \n\t\tgenius) -- all victims of whitey's social order.\n<b> \n</b>\tMusic of a dance combo heard in BG.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\tThree things I was always scared of: a job, a \n\t\tbust and jail. I realized then I wasn't afraid \n\t\tof anything. I didn't care.\n<b> \n</b><b>93\tOMIT\n</b><b> \n</b><b>94\tINT. HARVARD SQUARE APARTMENT - DAY\n</b><b> \n</b>\tShorty, Sophia and PEG face Malcolm -- stoned in a chair. PEG is 17,\n \tSophia's kid sister and Shorty's date.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tYou got to eat somethin', Red.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tYou want eggs, baby?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYeah and get a slave, too, huh, baby?\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tI ain't doing bad.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, the name musicians ain't got shit. How you \n\t\tgonna have something? I need a stake, a bundle, \n\t\ta grand. My woman can't afford it; my homey \n\t\tain't got it. How about you baby? What you got?\n<b> \n</b>\tPeg smiles, afraid of Malcolm.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tJesus, Red, she's just a kid.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tJesus ain't got nothin' to do with this. \n\n\tShorty eyes him with amazement. The degree of Malcolm's depravity \n\tsurprises even him.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSurprise you, baby? Well, that's the way it is. \n\t\tWhat kind of scratch you got on you? Turn out. \n\t\tLet me have it. All of you--\n<b> \n</b>\tGlances exchanged among Shorty, Sophia and Peg. Shorty reaches into his \n\tpocket.\n<b> \n</b><b>95 \tINT. HARVARD SQUARE APARTMENT - NIGHT \n</b>\n\tMalcolm with Sophia, Shorty and Peg around him.\n\n<b>\t\t\t\tMALCOLM \n</b>\t\tWe gone rob this town blind. Anybody want out \n\t\tsay so. \n\n\tNobody answers; they'll go with Malcolm.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tOkay. I got the stake and I got a fence. I need \n\t\ta driver.\n<b> \n</b><b>\t\t\t\tPEG \n</b>\t\tHow about Rudy?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWho's Rudy? \n\n<b>\t\t\t\tSHORTY \n</b>\t\tYeah, Rudy.\n\n<b>\t\t\t\t\t\t\t\tJUMP CUT:\n</b>\n<b>95A \tSAME LOCATION - LATER\n</b><b> \n</b>\tRUDY is with them. He is a good-looking, very-light skinned black, \n\ttough as they come.\n<b> \n</b><b>\t\t\t\tRUDY\n</b>\t\tI'm half wop, half nigger and ain't afraid of \n\t\tno one.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat can you do?\n<b> \n</b>\tThey are in the process of appraising each other, seeing which one has \n\tthe bigger penis.\n<b> \n</b><b>\t\t\t\tRUDY\n</b>\t\tYou name it, feller.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tRudy does catering. Rich joints on Beacon Hill.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThat ain't bad.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tTell him about Baldy.\n<b>  \n</b><b>\t\t\t\tRUDY\n</b>\t\tYeah. This rich ofay, like he's 60. I give him \n\t\ta bath on Friday.\n<b> \n</b>\tPeg and Sophia are listening, a little horrified.\n<b> \n</b>\t\t\t\tRUDY (contd) \n\t\tThen I put him to bed and pour talcum powder on \n\t\thim like a baby. He gets his jollies off.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSo what about him?\n<b> \n</b><b>\t\t\t\tRUDY\n</b>\t\tSo? The man got silver, china, rugs--\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMight be all right.\n<b> \n</b><b>\t\t\t\tRUDY\n</b>\t\tMight be, shit. Man, I know this town. I got my \n\t\town fences. Who the hell are you? Who put you \n\t\tin charge?\n<b> \n</b>\tMalcolm smiles easily.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou want to be the head man?\n<b> \n</b><b>\t\t\t\tRUDY\n</b>\t\tThat's right.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHead nigger in charge?\n<b> \n</b><b>\t\t\t\tRUDY\n</b>\t\tI'm the man.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tOkay, baby. Let's flip for it. Flip this.\n<b> \n</b>\tHe takes out his gun, a .38 revolver. He dumps the shells on the table, \n\tthen reinserts one shell and twirls the barrel.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tI'll flip first.\n<b> \n</b>\tHe puts the revolver to his own head.\n<b> \n</b><b>\t\t\t\tPEG \n</b>\t\tDon't.\n<b> \n</b>\tMalcolm squeezes the trigger. It clicks. Now he twirls the barrel again \n\tand hands the gun to Rudy.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYour flip, baby.\n\n\tRudy is staring at him; so are they all. Malcolm puts the gun to his \n\ttemple again.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tRed, for God's sake-- \n\n\tHe pulls the trigger a second time. Click. Now he twirls it again.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tChrist, Red, no--\n\n<b>\t\t\t\tPEG \n</b>\t\tI can't stand it. \n\n\tMalcolm puts the gun to Rudy's head.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYour turn, Rudy. You want me to flip for you?\n<b> \n</b><b>\t\t\t\tRUDY\n</b>\t\tJesus Christ, no. Okay, okay. You got it, you \n\t\tgot it! You're the boss. \n\n\tA beat.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDon't never try to cross someone who ain't \n\t\tafraid to die.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tYou the man!\n<b> \n</b>\tNodding accord from Rudy and Shorty. Sophia can hardly stand.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAll right. We'll start with Old Talcum Powder. \n\t\tYou draw the house, where everything is. You \n\t\tand Peg go out and buy them tools like I told \n\t\tyou. We hit tonight on account of in the \n\t\tdaytime some of us got that high visibility. \n\t\tYa dig?\n<b> \n</b>\tRudy is at a table drawing a diagram; the girls have left. Shorty and \n\tMalcolm alone at a window.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tWhat did you do, Homey, palm it?\n<b> \n</b><b>\t\t\t\tMALCOLM\n</b>\t\tYeah.\n\n\tHe breaks open the gun -- the bullet is in the next slot to be fired. \n\n\t\t\t\tMALCOLM (contd) \n\t\tPalmed it right in the goddam chamber. \n\n<b>\t\t\t\tSHORTY \n</b>\t\tJesus Christ, Homey, you are nuts. \n\n\tMalcolm starts laughing: a silent, hysterical laugh. \n\n<b>96\tEXT/INT. A BEACON HILL HOUSE - NIGHT\n</b><b> \n</b>\tThe robbery, IN QUICK CUTS: \n\n\t--A door lock is picked by Sophia.\n\n96A\t--Pencil flashlight passes an upstairs window. \n\n96B\t--Rudy in the car.\n\n96C\t--Silver removed from a drawer by Shorty. \n\n96D\t--Peg walking down the street, as lookout. \n\n96E\t--Malcolm takes off his shoes.\n<b> \n</b>96F\t--The sleeping OLD MAN, OLD TALCUM POWDER, as Malcolm takes a watch, a \n\twallet from within inches of his pillow. Then, more boldly, picks up \n\tthe man's hand and removes a ring from one of his fingers. Shorty \n\twatching with bated breath, he's about to have a heart attack.\n<b> \n</b><b>97\tINT. MANSION - DAY\n</b><b> \n</b>\tA Boston matron, MRS. CRAWFORD, is showing the girls her collection of \n\tU.S. silver. In a fine New England home.\n<b> \n</b><b>\t\t\t\tPEG \n</b>\t\tBeacon Hill survey.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tWe're doing a survey for the Athenaeum Society \n\t\t-- We wondered if you'd permit us to include \n\t\tyour collection in the catalog of Great New \n\t\tEngland Antiques--?\n<b> \n</b><b>\t\t\t\tMRS. CRAWFORD \n</b>\t\tNow these are my prizes. My Paul Revere silver \n\t\tcoffee service.\n<b> \n</b><b>\tSHOT -- AN ARRANGEMENT OF MUSEUM-QUALITY PIECES\n</b><b> \n</b><b>\t\t\t\tPEG \n</b>\t\tLovely, just lovely.\n<b> \n</b>\tSophia is casing the room carefully as the matron continues.\n<b> \n</b><b>\t\t\t\tMRS.CRAWFORD \n</b>\t\tAnd my husband's collection of scrimshaw should \n\t\tbe included.\n<b> \n</b><b>\t\t\t\tSOPHIA \n</b>\t\tMay we see it?\n<b> \n</b><b>\t\t\t\tMRS. CRAWFORD \n</b>\t\tWon't you step this way?\n<b> \n</b><b>97A\tOMIT \n</b>\n<b>98\tOMIT \n</b>\n<b>98A\tOMIT\n</b>\n<b>101\tINT. A COURTROOM - DAY \n</b>\n\tThe prisoners face the bench: Peg, Sophia, Shorty, Rudy and Malcolm.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tThe average first offender gets two years for \n\t\tburglary. We were all first offenders. That's \n\t\twhat Sophia and Peg drew--\n<b> \n</b><b>\t\t\t\tJUDGE\n</b>\t\tTwo years in the Women's Reformatory at \n\t\tFramingham.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tBut our crime wasn't burglary. It was balling \n\t\twhite girls. They gave us the book.\n<b> \n</b><b>\t\t\t\tJUDGE\n</b>\t\tBurglary, count one -- 8 to 10 years; count two, \n\t\t8 to 10 years; count three, 8 to 10 years...\n<b> \n</b>\tHe continues giving them 8 to 10 years, behind Malcolm's comment: \n\n<b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tFourteen counts of 8 to 10 years.\n<b> \n</b><b>\t\t\t\tJUDGE\n</b>\t\tThe sentences to run concurrently.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tShorty thought he hit us with 114 years till I \n\t\texplained what concurrently meant. It meant a \n\t\tminimum sentence of 10 years hard labor at the \n\t\tCharlestown State Prison. The date was February \n\t\t1946. I wasn't quite 21. I had not yet begun to \n\t\tshave.\n<b> \n</b>\tCAMERA HAS GONE IN for a TIGHT CLOSE SHOT of Malcolm's face: a hardened \n\thustler, pimp, dope peddler and now jailbird at the ripe old age of 20.  \n<b>\tFREEZE FRAME.\n</b>\n<b>\t\t\t\t\t\t\t\tCUT TO BLACK.\n</b><b> \n</b><b>FADE IN:\n</b><b> \n</b><b>102\tINT. THE CELL CORRIDOR - DAY\n</b><b> \n</b>\tIt is the afternoon lockup: about 3:30 P.M. The line of PRISONERS \n\tstands in front of their cells, as two guards, WILKINS and BARNES, one \n\twhite, one black, slowly walk past the P.M. check. \n\n\tThe procedure is routine, done without emotion, as it is done three \n\ttimes a day: the black guard calls out the prisoner's name, the \n\tprisoner answers with his number, then steps into his cell. Whereupon \n\tthe white guard slams the door shut and locks it.\n<b> \n</b><b>\t\t\t\tGUARD WILKINS \n</b>\t\tJackson.\n<b> \n</b><b>\t\t\t\tPRISONER \n</b><b>\t\tA 231549.\n</b><b> \n</b>\tDoor is slammed and gate locked. \n\n<b>\tCLOSE - MALCOLM \n</b>\n\tEach time a gate is locked his tension increases. His face is a mask \n\thiding his fury, violence and the hunger of an advanced junkie who has \n\tnot had a fix in over a week.\n<b> \n</b><b>\t\t\t\tGUARD WILKINS \n</b>\t\tCrichlow.\n<b> \n</b><b>\t\t\t\tSECOND PRISONER\n</b><b>\t\tA 5991301.\n</b><b> \n</b>\tSame procedure.\n<b> \n</b>\tANGLE. SHOOTING PAST MALCOLM, FAVORING TWO OTHER PRISONERS. The guards \n\tare approaching Malcolm's cell. Past Malcolm are two experienced \n\tPRISONERS who have been watching Malcolm during the scene. They whisper \n\tsurreptitiously without moving their bodies, and barely moving their \n\tlips. One of the prisoners is PETE, a huge barrel of a man, a lifer --\n\tbeaten by the system and a lifetime of incarceration. The other is \n\tBEMBRY, a man of no great physicality, but who possesses immediately \n\tthe gift of leadership. It is clear that Pete and others look up to him \n\twith great respect.\n<b> \n</b><b>\t\t\t\tPETE\n</b>\t\tLooka Satan.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI see him.\n<b> \n</b>\tBembry's language is very unhip. He speaks carefully. He respects words \n\tand he respects himself, something which sets him apart from all the \n\tother prisoners.\n<b> \n</b><b>\t\t\t\tPETE\n</b>\t\tHe bout to bust.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tNo, he's not gonna bust. But he's not gonna fix \n\t\this face to please them, neither.\n\n\tANGLE. The check-in has reached the man next to Malcolm.\n\n<b>\t\t\t\tGUARD WILKINS \n</b>\t\tHarrington.\n<b> \n</b><b>\t\t\t\tTHIRD PRISONER \n</b><b>\t\tB 775717.\n</b><b> \n</b><b>\t\t\t\tGUARD BARNES \n</b>\t\tYeah. Lucky Seven.\n<b> \n</b>\tDoor slammed and locked. \n\n<b>\tCLOSE SHOT - MALCOLM \n</b>\n\tThe guards are now in front of him.\n<b> \n</b><b>\t\t\t\tGUARD WILKINS \n</b>\t\tLittle.\n<b> \n</b>\tMalcolm doesn't move.\n<b> \n</b><b>\t\t\t\tGUARD BARNES \n</b>\t\tState your number.\n<b> \n</b>\tMalcolm doesn't answer, doesn't blink.\n<b> \n</b><b>\t\t\t\tGUARD WILKINS \n</b>\t\tLittle.\n<b> \n</b>\tANGLE. Bembry in the FG of the scene. \n\n<b>\t\t\t\tBEMBRY \n</b>\t\tHe's a new fish, Mr. Barnes. Give him a break.\n<b> \n</b>\tIt's a bold step by Bembry and the prisoners look over at him with\n\tadmiration. Barnes accepts the irregularity and calls over to Bembry.\n\n<b>\t\t\t\tGUARD BARNES \n</b>\t\t0kay, I'll give him a break. Now state your \n\t\tnumber, Little.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI forgot it.\n<b> \n</b><b> \tCLOSE SHOT - BEMBRY\n</b>\n\tShaking his head in anguish. He knows what's coming. \n\n\tANGLE. Barnes makes a small gesture and Wilkins seizes Malcolm, \n\tgrabbing his head and uniform at the same time. Stenciled on the chest \n\tof his faded dungarees is Malcolm's number. The guard bends Malcolm's \n\thead to the number, shoving the material in Malcolm's face.\n<b> \n</b><b>\t\t\t\tGUARD WILKINS \n</b>\t\tCan you read, boy? Thass your number.\n<b> \n</b><b>\t\t\t\tGUARD BARNES \n</b>\t\tNow say it.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm Malcolm Little, not no goddam number.\n<b> \n</b><b>\t\t\t\tGUARD WILKINS \n</b>\t\tOh, yes you is, baby; thass all you is.\n<b> \n</b>\tAnd slams Malcolm hard. He slumps to the floor.\n<b> \n</b><b>\t\t\t\tGUARD BARNES \n</b>\t\tTwo days in the hole. Take him.\n<b> \n</b>\tWilkins drags Malcolm off as Barnes resumes the roll call.\n<b> \n</b>\t\t\t\tGUARD BARNES (contd) \n\t\tBurnham.\n<b> \n</b><b>\t\t\t\tFOURTH PRISONER\n</b>\t\tA 551613, sir.\n<b> \n</b><b>\t\t\t\t\t\t\t\tJUMP CUT:\n</b><b> \n</b><b>103 \tINT. A SOLITARY CELL - DAY\n</b><b> \n</b>\tOnly the faintest light comes into the hideous room, which consists of \n\ta mattress and a slop bucket. If Malcolm were to stretch out his arms, \n\the could touch both walls. He lies half on the stone floor, half on the\n \tmattress.\n<b> \n</b>\tA clang as the heavy door is opened.\n<b> \n</b><b>\t\t\t\tGUARD CONE\n</b>\t\tTime's up. Get on your feet.\n<b> \n</b>\tMalcolm stands.\n<b> \n</b>\t\t\t\tGUARD CONE (contd) \n\t\tLittle, state your number.\n<b> \n</b>\tA beat as Malcolm stares at the man, refusing to answer.\n<b> \n</b>\t\t\t\tGUARD CONE (contd) \n\t\tYou just drew two more days.\n<b> \n</b>\tAnd slams the door shut. \n\n<b>104\tINT. SOLITARY - NIGHT\n</b><b> \n</b>\tIt is almost pitch black. We can almost smell the stench of the room. \n\tMalcolm sits stony-faced, his back against a wall. \n\n<b>\t\t\t\tTRUSTEE'S VOICE\n</b>\t\tWater.\n<b> \n</b>\tThe long spigot of a watering can is pushed through an opening in \n\tthe cell door. Malcolm, animal-like, leaps at it and bends the spout, \n\twrenching it off in his fury.\n<b> \n</b><b>105\tOMIT\n</b>\n<b>106\tINT. SOLITARY CELL - DAY \n</b>\n<b>\tTWO-SHOT - A WHITE CHAPLAIN AND MALCOLM \n</b>\n<b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tDo you know what a friend you have in Jesus, \n\t\tson?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tPreacher, take your tin Jesus and the Virgin \n\t\tMary, both, and shove 'em.\n<b> \n</b>\tDoor slam.\n<b> \n</b><b>107\tINT. SOLITARY - NIGHT \n</b>\n\tMalcolm is alone at the bars: the hope of freedom filling his mind.\n<b> \n</b>\tMalcolm pulls at the bars, tries to shake them in impotent fury. He \n\tpounds the walls. Empty, sick, defeated, his nails scratching the \n\twalls, he slides to the floor of the cell.\n\n\tIt is the low point of his life: nowhere to turn, nothing to hope for.\n<b> \n</b><b>108  INT. SOLITARY - LATER\n</b><b> \n</b>\tGuard Cone is shaking him into consciousness.\n<b> \n</b><b>\t\t\t\tGUARD CONE\n</b>\t\tAll right, Little. Get up.\n<b> \n</b>\tMalcolm just about makes it. The guard is in half-focus. \n\n\t\t\t\tGUARD CONE (contd) \n\t\tState your number.\n<b> \n</b>\tHe is beaten.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b><b>\t\tA 859912.\n</b><b> \n</b>\tA shower is heard.\n\n<b>109 \tINT. SHOWER ROOM - DAY\n</b><b> \n</b>\tMalcolm stands with bowed head as the hot water cascades over his \n\tbroken body. He lets it run and run, but it cannot really touch his \n\tproblems. On a nearby bench are his clothes, his towel and the makings \n\tfor a conk: lye, Vaseline, comb, etc.\n<b> \n</b>\tHe turns for a moment as he sees he is being watched by someone. It's \n\tBembry standing nearby. Malcolm turns away, trying to find solace in \n\tthe water. He wants no part of the world or anyone, just to be left \n\talone.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI know how you feel. Like you want to lay down \n\t\tand die.\n<b> \n</b>\tMalcolm shows no flicker of interest or understanding.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tI brought you something.\n<b> \n</b>\tHe puts down a small matchbox on the bench next to Malcolm's things. \n\tMalcolm eyes him like a snake -- but the punishment has reduced him to \n\tdeep insecurity and his belligerence is more cautious than angry.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWho the hell are you?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tPut it in a cup of water. It's nutmeg.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, what do you want?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tYou need something. It's not a reefer, but \n\t\tit'll help some.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, get outa my face. I ain't nobody's punk.\n<b> \n</b>\tBut he steps out of the shower, fills a tin cup with water and empties \n\tthe contents of the matchbox into it. And drinks it down quickly.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tSit down or it might knock you down.\n<b> \n</b>\tMalcolm sits, toweling himself as the spice hits him. For the first, he \n\tsmiles; this is the first relief he has tasted in prison. He at Bembry \n\twonderingly, unable to figure him out.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIf you ain't trying to punk me, what's your \n\t\thype?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI can show you how to get out of prison. And \n\t\tit's no hype.\n<b> \n</b><b>\t\t\t\tMALCOLM\n</b>\t\tTalk, daddy, I'm listening. Hey that ain't bad. \n\t\tYou got some more?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tThat's the last stuff you'll ever get from me.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat did you give it to me for then?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\t'Cause you needed it. 'Cause you couldn't hear \n\t\tme without it.\n<b> \n</b>\tThis is a new breed of cat; Malcolm has never met anyone like him. He \n\teyes him closely, as he slips into his clothes.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat in the hell are you talking about?\n<b> \n</b>\tHe begins to conk his hair, but is paying attention to what Bembry is \n\tsaying.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI think you got more sense than any cat in this \n\t\tprison. How come you are such a fool?\n<b> \n</b>\tMalcolm looks over, piqued.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tNobody can bust out like Bogart does it, in the\n\t\t movies. Because even if you get out, you are \n\t\tstill in prison.\n<b> \n</b>\tMalcolm is putting the conk into his hair now.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou ain't lying.\n\n<b>\t\t\t\tBEMBRY \n</b>\t\tWhen you go busting your fists against a stone \n\t\twall, you're not using your brains. Cause \n\t\tthat's what the white man wants you to do. Look \n\t\tat you.\n<b> \n</b>\tThese last words are spoken sharply with disgust. Malcolm turns his \n\thands massaging the conk into his hair.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tPutting all that poison in your hair.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, you been locked up too long, everybody \n\t\tconks. All the cats.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tWhy? Why does everybody conk?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCause I don't want to walk around with my head \n\t\tall nappy, looking like--\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tLike what? Looking like me? Like a nigger?! \n\t\tWhy don't you want to look like what you are? \n\t\tWhat makes you ashamed of being black?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI ain't said I'm ashamed.\n<b> \n</b>\tHe turns the water on to wash out the conk -- which has begun to burn. \n\tBembry restrains him, holding his arm.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLeggo. I got to wash it out.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tLet it burn. Maybe you'll hear me then.\n<b> \n</b>\tBut it is burning now.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, you better get off me.\n<b> \n</b>\tHe wrenches away from Bembry and puts his head in the water.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tSure, burn yourself, pain yourself, put all \n\t\tthat poison into your hair, into your body -- \n\t\ttrying to be white.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, I don't want to hear all that.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI thought you was smart. But you just another \n\t\tone of them cats strutting down the avenue in \n\t\tyour clown suit with all that mess on you. Like \n\t\ta monkey. And the white man sees you and he \n\t\tlaughs. He laughs because he knows you ain't \n\t\twhite.\n<b> \n</b>\tMalcolm is drying his hair, finishing his conk. But some of what Bembry \n\thas said disturbs him.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWho are you?\n<b> \n</b>\tMalcolm is completely humiliated. Bembry sees this and stops the \n\tbarrage.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tThe question is, who are you? You are in the \n\t\tdarkness, but it's not your fault. Elijah \n\t\tMuhammad can bring you into the light.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tElijah who?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tElijah Muhammad can get you out of prison. Out \n\t\tof the prison of your mind. Maybe all you want \n\t\tis another fix. I thought you were smart.\n<b> \n</b>\tAnd he is gone. Malcolm stands looking after him, a long thoughtful \n\tmoment. He is pulling the comb through his hair.\n<b> \n</b><b>110 \tINT. PRISON LICENSE SHOP - DAY\n</b><b> \n</b>\tPRISONERS are working on a beltline that stamps out and finishes \n\tlicense plates. Bembry is on the stamping machines, working as he talks \n\tto the other prisoners. Malcolm is painting the plates, a little \n\tremoved from Bembry, but listening with interest. Barnes, with rifle, \n\tidles by a window.\n<b> \n</b>\tA whistle sounds, ending the work shift. The inmates quickly file out \n\tinto the yard. Bembry stays. Malcolm is half decided.\n<b> \n</b><b>\t\t\t\tGUARD BARNES \n</b>\t\tYou taking the yard?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI'm staying.\n<b> \n</b>\tBarnes gestures to Malcolm.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMe too.\n\n\tHe goes.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tWhat you sniffing around for? I told you I gave \n\t\tyou your last fix.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI ain't never seen a cat like you. Ain't you \n\t\tscared talking like that in front of an ofay?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tWhat's he gonna do to me he ain't already done?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou the only cat don't come on with that \n\t\t\"Whatcha know, daddy\" jive; and you don't cuss \n\t\tnone.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI respect myself. A man cuss because he hasn't \n\t\tgot the words to say what's on his mind.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tTell you this: you ain't no fool.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tDon't con me. Don't try...\n\n<b>\t\t\t\tMALCOLM \n</b>\t\tOkay, okay.\n\n<b>\t\t\t\tBEMBRY \n</b>\t\tDon't con me. \n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat do you do with your time?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI read. I study. Because the first thing a \n\t\tblack man has to do is respect himself. Respect \n\t\this body and his mind. Quit taking the white \n\t\tman's poison into your body: his cigarettes, \n\t\this dope, his liquor, his white woman, his \n\t\tpork.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThat's what Mama used to say.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tYour mama had sense because the pig is a filthy \n\t\tbeast: part rat, part cat, and the rest is dog.\n<b> \n</b>\tMalcolm has been pondering all this and now grows animated as he thinks \n\the has come to the essence of a hustle.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCome on, daddy, pull my coat. What happens if \n\t\tyou give all that up? You get sick or somethin'? \n\t\tI pulled a hustle once and got out of the draft.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI'm telling you God's words, not no hustle. I'm \n\t\ttalking the words of Elijah, the black man's \n\t\tGod. I'm telling you, boy, that God is black.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat? Everybody knows God is White.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tBut everything the white man taught you, you \n\t\tlearned. He told you you were a black heathen \n\t\tand you believed him. He told you how he took \n\t\tyou out of darkness and brought you to the \n\t\tlight. And you believed him. He taught you to \n\t\tworship a blond, blue-eyed God with white skin\n\t\t-- and you believed him. He told you black was \n\t\ta curse, you believed him. Did you ever look \n\t\tup the word black in the dictionary?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat for?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tDid you ever study anything wasn't part of \n\t\tsome con?\n<b> \n</b><b>\t\t\t\tMALCOLM\n</b>\t\tWhat the hell for, man?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tGo on, fool; the marble shooters are waiting \n\t\tfor you.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tOkay, okay. Show me, man.\n<b> \n</b><b>110A \tCLOSE SHOT - A DICTIONARY\n</b><b> \n</b>\tWE CAN READ the fine print of the definition:\n<b> \n</b><b>\t\t\t\tDICTIONARY\n</b>\t\tBlack, (blak), adj. Destitute of light, devoid \n\t\tof color, enveloped in darkness. Hence, utterly \n\t\tdismal or gloomy, as \"the future looked black.\"\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tYou understand them words?\n<b> \n</b><b>\t\t\t\tBEMBRY'S VOICE \n</b>\t\tRead it.\n<b> \n</b>\tPULLBACK TO SHOW Bembry and Malcolm in a small PRISON LIBRARY. No one \n\telse is in the book-lined room.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI can't make out that shit.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tSoiled with dirt, foul; sullen, hostile, \n\t\tforbidding -- as a black day. Foully or \n\t\toutrageously wicked, as black cruelty. \n\t\tIndicating disgrace, dishonor or culpability.\n<b> \n</b><b>\t\t\t\tDICTIONARY\n</b>\t\tSee also blackmail, blackball, blackguard.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHey, they's some shit, all right.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tNow look up \"white.\"\n<b> \n</b>\tBembry turns the pages of the dictionary to \"w.\"\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tRead it.\n<b> \n</b><b>\tCLOSE SHOT - DICTIONARY DEFINITION OF \"WHITE\"\n</b><b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tWhite (whit), adj. Of the color of pure snow; \n\t\treflecting all the rays of the spectrum. The \n\t\topposite of black, hence free from spot or \n\t\tblemish; innocent, pure, without evil intent, \n\t\tharmless. Honest, square-dealing, honorable.\n<b> \n</b>\tMalcolm stumbles through the definition as well as he can. Bembry takes \n\tover the reading, giving it ironic emphasis.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThat's bullshit. That's a white man's book. \n\t\tAin't all these white man's books?\n<b> \n</b><b>\tSHOT - THE SHELVES OF BOOKS\n</b><b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tThey sure ain't no black man's books in here.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThen what you telling me to study in them for?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tYou got to learn everything the white man says \n\t\tand use it against him. The truth is laying \n\t\tthere if you smart and read behind their words. \n\t\tIt's buried there. You got to dig it out.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, how'm I gonna know the ones worth looking \n\t\tat?\n<b> \n</b>\tBembry smiles at Malcolm. He is a remarkable man who always takes \n\tcareful measure of his listener. He never talks down to his audience; \n\the talks to them. (A manner Malcolm later will adopt.) Bembry can talk\n \tfunky or salty or, as we will see, in the cadence and eloquence of the \n\tBible. Right now he goes into street talk.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI'll pull your coat, daddy. Cause lots of these \n\t\tcan't nobody read, be he black or white or a \n\t\tPh.D. with their suspenders dragging the ground \n\t\twith degrees.\n<b> \n</b>\tMalcolm laughs. He likes and admires the man. Then caught by a passage \n\the does not understand:\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMan, I'm studying in the man's book. I don't dig \n\t\thalf the words.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tLook 'em up and and out what they mean.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhere am I gonna start?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tStart at the beginning. Page one, the first \n\t\tone. Here--\n<b> \n</b><b>\tCLOSE SHOT\n</b><b> \n</b>\tAs Bembry's hand opens the book to page one.\n\n<b>\tCLOSE IN ON A PICTURE OF AN AARDVARK WITH ITS DEFINITION\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAardvark, noun. An earth pig; an ant-eating \n\t\tAfrican mammal. Man, that sounds like the \n\t\tdozens.\n<b> \n</b><b>\tANGLE - TWO-SHOT\n</b><b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tRead it and keep on reading. \n\n\tMalcolm's finger runs down to the next definition:\n<b> \n</b><b>\t\t\t\tDICTIONARY\n</b>\t\tAbacus, noun. An ancient and primitive Chinese \n\t\tcounting device.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tIf you take one step toward Allah, He will take \n\t\ttwo steps toward you.\n<b> \n</b><b>111\tOMIT \n</b>\n<b>112\tOMIT\n</b>\n<b>113\tINT. MALCOLM'S CELL - NIGHT \n</b>\n\tHe is reading on his bunk as Barnes walks by. The lights in the cell go \n\tout. Malcolm looks up, annoyed at being interrupted. He shifts his \n\tposition to the floor of the cell so that he can catch the dim light \n\tcoming from the corridor and goes on with his reading. \n\n<b>\tCLOSE SHOT - THE BOOK \n</b>\n\tMalcolm is studying the dictionary, the last of the \"a's\": the words\n\tazimuth, Azores, Aztec, azure, etc. He reads a word, then holds his \n\thand over the printed definition to test himself, half-mouthing its \n\tmeaning. Malcolm is also copying the dictionary in a school book word \n\tfor word.\n<b> \n</b><b>114 \tINT. LIBRARY - DAY\n</b><b> \n</b>\tThere are several books on the desk before Malcolm. WE SEE their \n\ttitles: W.E.B. DuBois's _The Soul of Black Folks_, Carter G. Woodson's \n\t_Journal of Negro History_, Durant's _Story of Philosophy_, H.G. \n\tWells's _Outline of History_, Spinoza, Thoreau, etc.\n<b> \n</b><b>\t\t\t\tGUARD BARNES'S VOICE\n</b>\t\tClosing. Knock it off.\n<b> \n</b>\tMalcolm is surprised the time has gone so fast. He gathers up his books \n\twith care. He cherishes them, putting them back on the shelf carefully.\n<b> \n</b><b>\t\t\t\tGUARD BARNES\n</b>\t\tYou studying to be the first colored \n\t\tPresident of the States?\n<b> \n</b><b>115\tINT. LICENSE SHOP - DAY\n</b><b> \n</b>\tThe machines are idle; no one is in the room but Malcolm. He starts \n\tto reach inside his jacket when Barnes sticks his head in.\n<b> \n</b><b>\t\t\t\tGUARD BARNES \n</b>\t\tYou taking the yard or not?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm staying.\n<b> \n</b><b>\t\t\t\tGUARD BARNES \n</b>\t\tThen give me a butt.\n<b> \n</b>\tMalcolm takes out a half-filled pack of cigarettes, about to offer one, \n\tthen pauses. Malcolm hands him the pack of cigarettes.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tTake 'em. I don't smoke no more.\n<b> \n</b>\tHe takes the pack happily and goes. Malcolm reaches into his jacket \n\tagain, takes out a book. WE SEE its title: Mahatma Gandhi's _My \n\tStruggle_. He sits next to the license press to read.\n<b> \n</b><b>116\tEXT. THE PRISON YARD - DAY \n</b>\n\tA baseball game is in progress. A BLACK TEAM is playing a WHITE ONE. \n\tMost of the CONVICTS are watching the game; partisanship at every \n\tpitch. A base hit gets a big reaction. \n\n<b>\tANGLE - MALCOLM AND BEMBRY \n</b>\n\tThey are out along the right field wall. They walk throughout the scene.\n\n\tANGLE - The ball is hit over the fence for a home run. There is a big \n\tcheer from the black prisoners. Pete, the batter, trots proudly around \n\tthe bases.\n<b>  \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tOle Pete ain't much in the head, but he can lay \n\t\tin there with the wood.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tLemme tell you about history: black history. \n\t\tYou listening?\n<b> \n</b>\tTWO-SHOT - Malcolm still watching the game.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou pitch, baby; I'll ketch.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tThe first men on earth were black. They ruled \n\t\tand there was not one white face anywhere. But \n\t\tthey teach us that we lived in caves and swung \n\t\tfrom trees. Black men were never like that.\n<b> \n</b>\tMalcolm is listening to Bembry's intent statement.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tWe were a race of kings when the white men went \n\t\taround on all fours.\n<b> \n</b>\tThere is a crack of the bat and Malcolm turns to watch another base \n\thit, by a black convict, stir the crowd.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThis a helluva game. Somethin's going on.\n<b> \n</b>\tHe sees a black convict, CHUCK, nearby and calls over:\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tHey, whatsa score?\n<b> \n</b><b>\t\t\t\tCHUCK\n</b>\t\t10 to 1; we murdering them, Din't you hear?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat?\n<b> \n</b><b>\t\t\t\tCHUCK\n</b>\t\tThe Brooklyn Dodgers brought up Jackie Robinson \n\t\tand we pounding the hell out of them, \n\t\tcelebrating.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHow bout that?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tSure, white man throw us a bone and that's \n\t\tsupposed to make us forget 400 years.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tA black man playing big league ball is \n\t\tsomething.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI told you to go behind the words and dig out \n\t\tthe truth. They let us sing and dance and \n\t\tsmile -- and now they let one black man in the \n\t\tmajors. That don't cancel out the greatest \n\t\tcrime in history. When that blue-eyed devil \n\t\tlocked us in chains -- 100,000,000 of us -- \n\t\tbroke up our families, tortured us, cut us off \n\t\tfrom our language, our religion, our history.\n\n<b>\tSHOTS OF THE FACES OF THE BLACK BALL PLAYERS AND THE CONVICTS\n</b><b> \n</b>\tIn the stands, cheering and joyous.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tDo they know who they are? Do you know where \n\t\tyou came from? We are the Original People.\n<b> \n</b>\tMalcolm is listening to him now.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tWhat's your name, boy?\n<b> \n</b>\tMalcolm is startled; answers like a boy.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLittle.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tNo. That's the name of the slave-master who \n\t\towned your family. You don't even know who you \n\t\tare. You're nothing. Less than nothing. A zero. \n\t\tWho are you?\n<b> \n</b><b>\tCLOSE SHOT - MALCOLM \n</b>\n\tWrapped in thought. \n\n<b>\tANGLE ON MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm not Malcolm Little and I'm not Satan.\n<b>  \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tWho are you?\n<b> \n</b><b>\tCLOSE - MALCOLM \n</b>\n\tMalcolm cannot answer because he truly does not know.\n<b> \n</b>\tA ball is hit. Malcolm watches its flight but his face is fixed \n\tsomewhere between understanding and anger: it is the face of the future \n\tleader.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI told you we are a nation, the lost Tribe of \n\t\tShabazz in the wilderness of North America.\n<b> \n</b><b>117 \tINT. ANOTHER PART OF THE PRISON - LATE AFTERNOON\n</b><b> \n</b>\tThe rays of the sun come through bars that cut across Malcolm and \n\tBembry's face.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tAllah has sent us a prophet, a black man named \n\t\tElijah Muhammad. For if God is black, Malcolm--\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThen the devil is white.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI knew you'd hear me. The white man is the \n\t\tdevil. All white men are devils.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI sure met some.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tNo. Elijah Muhammad does not say \"that white \n\t\tman is a devil.\" He teaches us that the white \n\t\tman is the devil. All white men.\n<b> \n</b><b>\tCLOSE SHOT - MALCOLM\n</b><b> \n</b>\tListening.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tHave you ever known a good white man in all \n\t\tyour life? Think back, did you ever meet one \n\t\twho wasn't evil?\n<b> \n</b>\tA prison whistle is heard.\n<b> \n</b><b>119\tOMIT\n</b>\n<b>120\tINT. A NICHE IN A PRISON WALL - P.M.\n</b>\n\tMalcolm and Bembry standing close together. The feeling is of someone \n\ttaking communion: with Bembry the minister and Malcolm the communicant. \n\tTheir voices are little more than whispers.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tThe body is a holy repository.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI will not touch the white man's poison: his \n\t\tdrugs, his liquor, his carrion, his women.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tA Muslim must be strikingly upright. \n\t\tOutstanding. So those in the darkness can see \n\t\tthe power of the light.\n<b> \n</b>\tMalcolm lifts his head.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI will do it.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tBut the key to Islam is submission. That is why \n\t\ttwice daily we turn to Mecca, to the Holy of \n\t\tHolies, to pray. We bend our knees in submission.\n<b> \n</b>\tBembry kneels in a praying position. Malcolm stands.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI can't.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tFor evil to bend its knee, admit its guilt, \n\t\timplore His forgiveness, is the hardest thing \n\t\ton earth--\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI want to, Bembry, but I can't.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\t--the hardest and the greatest.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI can't.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tFor evil to bend its knee, admit its guilt, \n\t\timplore His forgiveness, is the hardest thing \n\t\ton earth--\n<b>  \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI want to, Bembry, but I can't.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\t--the hardest and the greatest.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI don't know what to say to Allah.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tHave you ever bent your knees, Malcolm?\n<b> \n</b>\tMalcolm laugh-snorts:\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYeah. When I was picking a lock to rob \n\t\tsomebody's house.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tTell Him that.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI don't know how.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tYou can grovel and crawl for sin, but not to \n\t\tsave your soul. Pick the lock, Malcolm; pick \n\t\tit.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI want to. God knows I want to.\n<b> \n</b><b>121\tINT. MALCOLM'S CELL-NIGHT\n</b>\n\tMalcolm holds a letter in his hand. He reads it carefully. He has read \n\tit several times before.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X\n</b>\t\tI received a letter that day from the Honorable \n\t\tElijah Muhammad. The Messenger of Allah wrote \n\t\tme, a nobody, a junkie, a pimp and a convict.\n<b> \n</b><b>\t\t\t\tVOICE OF ELIJAH \n</b>\t\tI have come to give you something which can \n\t\tnever be taken from you: I bring you a sense of \n\t\tyour own worth, the worth of one human being. \n\t\tThe knowledge of self.\n<b> \n</b>\tThe room becomes transformed. It is suddenly suffused with light. And \n\tstanding in the cell with Malcolm is ELIJAH MUHAMMAD. He has \n\tmaterialized, but he can be seen through. He is MALCOLM'S \n<b>\tHALLUCINATION.\n</b><b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tIt was like a blinding light and I became aware \n\t\tthat he was in the room with me. He wore a dark \n\t\tsuit and on his face I saw a pain so old and \n\t\tdeep and black I could scarcely look at him. I \n\t\tknew I was not dreaming. He was there.\n<b> \n</b><b>\t\t\t\tELIJAH \n</b>\t\tI tell you that the most dangerous creation of \n\t\tany society in the world is the man with \n\t\tnothing to lose. You do not need ten such men \n\t\tto change the world. One will do. The Earth \n\t\tbelongs to us, the Black man and whatever is \n\t\taround it, and on it and in it. Praises are \n\t\tdue to him forever for bringing to us again, \n\t\tour self and our property, the UNIVERSE OF SUN, \n<b>\t\tMOON, AND STARS.\n</b><b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tAnd suddenly as he came, he was gone.\n<b> \n</b>\tThe hallucination disappears.\n<b> \n</b>\t\t\t\tVOICE OF MALCOLM X (contd) \n\t\tAnd then I could do it.\n<b> \n</b>\tMalcolm goes down on his knees. There are tears in his eyes as he \n\tbegins praying:\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAllah Akbar: all praise to Him who is \n\t\tall-seeing, all-understanding.\n<b> \n</b>\tHe continues to pray.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tWe are told that Saul, on the road to Damascus, \n\t\theard the words of truth, he fell from his \n\t\thorse. I do not liken myself to Paul, but I \n\t\tunderstand. It happened to me.\n<b> \n</b><b>122\tINT. BEMBRY'S LIVING ROOM - NIGHT\n</b><b> \n</b>\tA poorly furnished, small, but immaculate room. There are two couches, \n\ta table set for eating, and, on the walls, a portrait of Elijah and a \n\tMuslim banner. It is dinner time in a Muslim home.\n<b> \n</b>\tSIDNEY, aged 20, a perfect specimen of the Fruit of Islam, stands \n\tbehind his chair, waiting. Their mother, LORRAINE, a woman of Bembry's \n\tage, is seated, but she, too, awaits Bembry.\n<b> \n</b><b>\tSHOT - BEMBRY\n</b><b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tIn the name of Allah, the beneficent and the \n\t\tmerciful to whom all praise is due.\n<b> \n</b>\tAt the window Bembry saying the evening prayers.\n<b> \n</b><b>\t\t\t\tBEMBRY'S VOICE \n</b>\t\tDear Brother Malcolm: I am back in the bosom of \n\t\tIslam, praise Allah...\n<b> \n</b>\tHe comes to the table, nods and sits. Sidney respectfully sits after \n\thim. Food is passed. It is simple fare: natural foods, milk, greens. \n\tThe portions are small. They eat in silence, but there is warmth and \n\tlove at this table.\n<b> \n</b>\t\t\t\tBEMBRY'S VOICE (contd) \n\t\t... We don't have much, but what we have is \n\t\tyours. Lorraine and my two sons join with me in \n\t\tsaying that when you come out, which will not \n\t\tbe too long, come straight to us.\n<b> \n</b><b>123 \tINT. PRISON BARBER SHOP - DAY\n</b><b> \n</b>\tMalcolm is reading Bembry's letter as he waits his turn. There is a \n\tWHITE CONVICT in the chair, just being finished by a WHITE BARBER - \n\tSIMMONS. A BLACK BARBER - SLIM sits by. Both are convicts. NOTE: \n\tMalcolm now wears glasses, all that reading in his badly lit cell has \n\truined his eyes.\n<b> \n</b><b>\t\t\t\tBEMBRY'S VOICE \n</b>\t\tYou write thanking me. Don't thank me. Praise \n\t\tAllah. He did it all.\n<b> \n</b><b>\t\t\t\tSIMMONS \n</b>\t\tNext.\n<b> \n</b>\tMalcolm starts for the chair. Simmons moves away to light a cigarette \n\tas Slim takes over.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tDear Bembry. Please thank the Honorable Elijah \n\t\tMuhammad for the money and tell him I have not \n\t\twritten him because I have not yet proven \n\t\tmyself.\n<b> \n</b><b>124 \tINT. SMALL'S PARADISE - NIGHT\n</b><b> \n</b>\tArchie and Cadillac are reading a letter they have received. They look \n\tat each other incredulously.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tBut I have written everyone else.\n<b> \n</b><b>125\tANOTHER PRISON - DAY\n</b><b> \n</b>\tShorty is waving a letter he has received to his CELLMATE. \n\n<b>\t\t\t\tSHORTY \n</b>\t\tLook like Homey got himself a brand new hype.\n<b> \n</b><b>126\tINT. ELIJAH'S OFFICE - DAY\n</b><b> \n</b>\tAn immaculate room, well furnished. ELIJAH sits in a chair as Bembry\n \tstands reading Malcolm's letter.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\t\"I wrote the Mayor, the Governor and the \n\t\tPresident, but for some reason I haven't heard \n\t\tfrom them\"...\n<b> \n</b>\tBembry laughs; Elijah smiles.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tTell the Messenger of Allah that I have \n\t\tdedicated my life to telling the white devil \n\t\tthe truth to his face. I greet you with the \n\t\tancient words: \"As Salaam Alikum.\"\n<b> \n</b><b>\t\t\t\tELIJAH \n</b>\t\tWa-Alaikum Salaam.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tP.S. I finally worked my way through the \n\t\t\"Z's\"...\n<b> \n</b><b>127\tINT. PRISON CHAPEL - NIGHT\n</b><b> \n</b><b>\tTITLE - 6 YEARS LATER\n</b><b> \n</b>\tA GROUP OF PRISONERS, mostly white, but with a goodly smattering of \n\tblack convicts, are listening to a lecture by CHAPLAIN GILL.\n<b> \n</b><b>  \t\t\t\tCHAPLAIN GILL \n</b>\t\tAre there any questions?\n<b> \n</b>\tANGLE. Malcolm seated next to a black convict, raises his hand. It's \n\tthe only hand up. The Chaplain searches for another questioner, but \n\tthere aren't any.\n<b> \n</b>\tPete, sitting next to Malcolm, whispers.\n<b> \n</b><b>\t\t\t\tPETE\n</b>\t\tWatch out, baby, this cat is heavy on religion.\n<b> \n</b><b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tI see this has become a struggle between good \n\t\tand evil. Satan has a question.\n<b> \n</b>\tThere is laughter from the convicts.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYes it is, Chaplain Gill. But I wouldn't want \n\t\tto say which one of us is what.\n<b> \n</b>\tLaughter, especially from the black convicts.\n<b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tWhy don't you just ask your question?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou've been talking about the disciples. What \n\t\tcolor were they?\n<b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tI don't think we know for certain.\n<b> \n</b>\tThere are reactions from the convicts. Malcolm is sharply challenging a \n\twhite man about color.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThey were Hebrew, weren't they?\n<b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tThat's right.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAs Jesus was. Jesus was also a Hebrew.\n<b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tJust what is your question?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat color were the original Hebrews?\n<b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tI told you we don't know for certain.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThen we don't know that God was white.\n<b> \n</b>\tThere is a strong reaction to this.\n<b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tNow just a moment, just a moment--\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBut we do know that the people of that region \n\t\tof Asia Minor, from the Tigris-Euphrates valley \n\t\tto the Mediterranean, are dark-skinned people. \n\t\tI've studied drawings and photographs and seen \n\t\tnewsreels. I have never seen a native of that \n\t\tarea who was not black.\n<b> \n</b><b>\t\t\t\tCHAPLAIN GILL \n</b>\t\tJust what are you saying?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm not saying anything, preacher. I'm proving \n\t\tto you that God is black.\n<b> \n</b><b>127A\tINSERT FLASH - A BLOND, BLUE-EYED JESUS ON THE CROSS \n</b>\t(Note: Try to get footage from _The Last Temptation of Christ_ [Willem \n\tDafoe])\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tGod is black.\n<b> \n</b><b>128\tINT. ELIJAH'S OFFICE - DAY\n</b><b> \n</b>\tMalcolm opens the door, the room is dark and he sees a small, slight \n\tman standing against the window, he doesn't move. This is the same man \n\twho appeared in Malcolm's cell, this is the Honorable Elijah Muhammad. \n\tMalcolm slowly moves toward him; he is completely humbled in his \n\tpresence.\n<b> \n</b><b>\tCLOSE - ELIJAH\n</b><b> \n</b>\tHe turns from the window to Malcolm.\n<b> \n</b><b>\t\t\t\tELIJAH \n</b>\t\tMy son, you've been a thief, drug dealer and a\n\t\tpimp and the world is still full of temptation. \n\t\tWhen God bragged how faithful Job was, the \n\t\tdevil argued that only God's protective hedge \n\t\taround him kept him pure, the devil said remove \n\t\tthe hedge and he will curse his maker. \n\t\tMalcolm, your hedge has been removed and I \n\t\tbelieve you will remain faithful.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tHe cannot say anything and he drops his head, he is overwhelmed with \n\theartfelt emotion.\n<b> \n</b><b>129\tINT. BEMBRY'S LIVING ROOM - P.M.\n</b><b> \n</b>\tIn contrast to the peaceful family scene, the room is a beehive of \n\tactivity. Sidney is turning out leaflets on a mimeograph machine; \n\tLorraine is busy making up a mailing list using 3 x 5 file cards; \n\tBembry is recruiting on the telephone.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHow many you turning out?\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b><b>\t\t500.\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMake it 1000. We got a lot of fishing to do.\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tBrother Malcolm, I want you to meet Brother \n\t\tEarl. He just joined the Nation.\n<b> \n</b>\tEarl moves toward Malcolm and extends his hands. Malcolm shakes it \n\twarmly.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWe can always use another good brother.\n<b> \n</b><b>\t\t\t\tEARL\n</b>\t\tI'm a willing servant for Allah.\n<b> \n</b><b>129A \tEXT. CHURCH - DAY\n</b><b> \n</b>\tSunday service has let out and Malcolm, Earl, and Sidney are \"fishing.\" \n\tThey're trying to convert the Black Christians. Malcolm speaks, while \n\tthe others hand out leaflets.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou think you are Christians, and yet you see \n\t\tyour so-called white Christian brother hanging \n\t\tblack Christians on trees. You say that white \n\t\tman loves you and yet he has done every evil \n\t\tact against you. He has everything while he is \n\t\tliving and tells you to be a good slave and \n\t\twhen you die you will have more than he has in \n\t\tBeulah's land. We so-called Negroes are in \n\t\tpitiful shape. Get off your knees praying to \n\t\ta picture of a white, pale blond, and blue-eyed \n\t\tJesus. Come out of the sky. Build heaven on \n\t\tearth. Islam is the black man's true religion.\n<b> \n</b><b>130\tEXT. STREET CORNER, 125TH AND SEVENTH AVENUE - DAY \n</b>\n\tMalcolm is talking to a CROWD from a ladder.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAnd that the white man is the devil. Yes, God \n\t\tis black and you are made in His image and \n\t\tdon't know it. That's how brainwashed you are.\n\n \tThe crowd is listening, caught up in Malcolm's intensity.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tMy brothers and sisters, they tell you you will \n\t\tsprout wings when you die and fly to heaven. \n\t\tThe Honorable Elijah Muhammad tells you that's \n\t\tpie in the sky.\n<b> \n</b><b>\tANGLE ON SIDNEY\n</b><b> \n</b>\tAmid the listeners, watching their response.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tHave you ever seen a black man who wasn't down \n\t\ton his knees begging the Lord to give him in \n\t\theaven what the white devil enjoys right here \n\t\ton earth?\n<b> \n</b><b>\tCLOSE SHOT - SEVERAL LISTENERS\n</b>\n\tThey turn from Malcolm, moving a few steps away, and now are the \n\taudience on an adjacent SPEAKER. He is a young firebrand:\n<b> \n</b><b>\t\t\t\tSPEAKER \n</b>\t\tThe Harlem Council fights for rat control, for \n\t\trent control and for community control of our \n\t\tschools.\n<b> \n</b>\tPAN CONTINUES to take in ANOTHER SPEAKER, a few feet away. WE SEE the \n\tstreet corner is Harlem's Hyde Park, with half a dozen SPEAKERS \n\tharanguing the crowd with half a dozen panaceas. That Malcolm is just \n\tone among many:\n\n<b>\t\t\t\tSECOND SPEAKER\n</b>\t\tIf the man behind the counter ain't black, \n\t\tdon't go in. Boycott the man. Be black. Think \n\t\tblack. Buy black.\n<b> \n</b><b>\tANGLE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCome to our Temple and hear the truth. Because, \n\t\tbrother and sister, you are dead. Yes you are, \n\t\tmentally dead, spiritually dead, morally dead. \n\t\tAnd we are here to resurrect the black man \n\t\tback from the dead.\n<b> \n</b><b>131\tEXT. OPEN AIR \"MAID'S MARKET\" - DAY\n</b><b> \n</b>\tA place where black women come to offer themselves for day work. \n\tSEVERAL ARE SEEN. A WHITE WOMEN comes up to one to interview her \n\t(bargain with her). Malcolm's voice is heard before he is seen, \n\tspeaking to the women from a ladder.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tMy beautiful sister, for you are beautiful. \n\t\tBeautiful because you are black. Because black \n\t\tis beautiful. You work in the white folks' \n\t\tkitchen so I don't have to tell you that \n\t\tthey're devils.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tAnd you are putting yourselves on the auction \n\t\tblock, letting them examine you like a horse, \n\t\tlike a slave. The Honorable Elijah Muhammad \n\t\tteaches that you are black and should be \n\t\tproud...\n<b> \n</b>\tFACE OF ONE BLACK WOMAN, beginning to shake her head in accord.\n<b> \n</b><b>132\tINT. TEMPLE #7 - NIGHT\n</b><b> \n</b>\tThe SAME WOMAN, now at a Muslim meeting. The faces of other listeners \n\t(from the church and from the maids' market) are scattered in Malcolm's \n\taudience.\n<b> \n</b>\tThe headquarters itself shows the progress Malcolm has made. It is \n\tbetter furnished, larger, and the chairs are filled. Bembry, Sidney, \n\tand Lorraine are in the back of the room, pleased with the growth. \n\tMalcolm stands at a podium.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWe're not American, we're Africans who happen \n\t\tto be in America. We were kidnapped and brought \n\t\there against our will from Africa. We didn't \n\t\tland on Plymouth Rock, brothers and sister. \n\t\tPlymouth Rock landed on us.\n<b> \n</b>\tReactions: laughter, interest. Ad lib \"That's the truth.\"\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tPut an end to your begging. No more \"Please, \n\t\tMr. White Man, Lawdy boss, brush me another \n\t\tcrumb from off your table, kindly, sir.\"  We \n\t\tare a nation, a great nation and don't need a \n\t\tthing from them.\n<b> \n</b>\tMalcolm scanning the faces of his audience as they react. He sees \n\tsomeone he knows and blurts out boyishly (and winningly):\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tShorty!\n<b> \n</b>\tThe crowd turns to Shorty, sitting embarrassedly in the audience.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tCome on up here, man, and give us some skin. \n\t\tHere's a man, brothers and sisters, who shot \n\t\tup with me, who robbed with me, and did time in \n\t\tthe white devil's jailhouse. Stand up, Shorty, \n\t\tand be counted--\n<b> \n</b>\tBut Shorty is trying to hide from the spotlight. Malcolm comes down \n\tfrom the platform and walks to him.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tFolks, the brother is shy and needs special \n\t\tattention. So would you excuse us, while Brothers \n\t\tSidney and Earl take up the collection.\n\n\tHe embraces Shorty as the crowd laughs appreciatively and Brothers \n\tSidney and Earl have a chuckle themselves.\n<b> \n</b><b>133\tINT. MUSLIM CAFETERIA - NIGHT\n</b><b> \n</b>\tShortly and Malcolm sit at a table. Shorty has a cup of coffee in front \n\tof him.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tI got to hand it to you, Homey. That's the best \n\t\tpreacher hype I ever did hear.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIt isn't a hype, Shorty. And I meant what I \n\t\tsaid: join us.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tCome on, baby. I don't pay that shit no mind.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThe Honorable Elijah Muhammad says you should \n\t\tpay it all your mind. If you got a mind.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tBaby, I love you. Take it easy, greasy. How \n\t\tabout a snort?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI've been clean for twelve years, Shorty.\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tYou is something, Homeboy. My trouble is -- I \n\t\tain't had enough stuff yet, I ain't et all the \n\t\tribs I want and I sure ain't had enough white \n\t\ttail yet.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHow's the rest of the gang? You seen anyone?\n<b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tWell, Sammy's dead. Yeah, fell over in the bed \n\t\twith a chick twenty years younger than him. Had \n\t\ttwenty-five grand in his pocket.\n<b> \n</b>133A \tINSERT FLASH - Sammy, he's dead on top of TEENAGE WHORE who is \n\tscreaming, trying to push that dead weight off her.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tHow about Old Cadillac?\n<b> \n</b>133B \tINSERT FLASH - Cadillac is an old junkie, past reclaiming, sitting \n\tstaring in a MENTAL WARD, twitching, nose running.\n<b> \n</b><b>\t\t\t\tSHORTY'S VOICE \n</b>\t\tHooked on horse. Been in and out of Lexington Ave times.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tYou seen Sophia?\n<b> \n</b>133C \tINSERT FLASH - Sophia is a bored housewife, she's in the kitchen \n\tcooking while her husband hides behind the Wall Street Journal.\n<b> \n</b><b>133D BACK TO THE BAR\n</b><b> \n</b><b>\t\t\t\tSHORTY \n</b>\t\tI ain't seen Archie, but the vine tells it he's \n\t\tliving somewhere's in the Bronx. If you can \n\t\tcall it living.\n<b> \n</b><b>134 \tINT. A DINGY ROOM - DAY\n</b><b> \n</b>\tA knock on the door rouses Archie, by now an old and dying man. All the \n\tvigor is gone, all the life has ebbed out.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tGit the hell away, you bitch, I'll pay you \n\t\ttomorrow.\n<b> \n</b>\tDoor opens, Malcolm enters.\n\n<b>  \t\t\t\tMALCOLM \n</b>\t\tHello, Archie.\n\n \tArchie sits up from his bed and stares. He tries to bring back some of\n\this old juice, tries to stand up.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tMy man, Red. Come on in, man. \n\t\t\t(then giving up) \n\t\tHey, I can't make it.\n<b> \n</b>\tMalcolm has to help him lie back.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tTake it easy, baby.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tThat really you, Red?\n\n\tThe contrast is shocking: Malcolm tall and straight; Archie ruined.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou saved my life, Archie. Running me out of \n\t\tHarlem. When I think how close we came to \n\t\tgunning each other down, I have to thank Allah.\n\n<b>\t\t\t\tARCHIE \n</b>\t\tI wasn't gonna shoot you, baby. It was just my \n\t\trep, that's all. And don't shit me now, but \n\t\tdid you have that number? Tell me.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI don't know. It doesn't matter. The thing is \n\t\twe got to get you back on your feet.\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tYeah. I got a couple a new angles ain't been \n\t\tfigured yet. All I need's a stake and a \n\t\tchance--\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCan you use a few bucks? I ain't got much, \n\t\tbut--\n<b> \n</b><b>\t\t\t\tARCHIE \n</b>\t\tNo, man, I'm doing okay. Thanks. \n\n<b>\t\t\t\tMALCOLM \n</b>\t\tTake it easy. Lay down and don't think about it.\n<b> \n</b><b>\t\t\t\tARCHIE\n</b>\t\tYeah.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou could of been something, Archie, but the \n\t\tdevil got to you.\n<b> \n</b>\tThe old man is asleep.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tYou know all the angles except how to live. \n\n<b>135 \tEXT. A STREET IN HARLEM - NIGHT\n</b><b> \n</b>\tMalcolm walks thoughtfully down the street; Archie is still on his \n\tmind, as he passes prostitute after prostitute. Once beautiful women \n\tnow selling their bodies. He passes Laura, she has been turned totally \n\tout and she looks the part, there is no way he can recognize her. We do \n\tthough. \n\n<b>\tCLOSE - LAURA\n</b><b> \n</b>\tShe has just gotten a white John and leads him into an alley.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tWomen who could be mothers, teachers, \n\t\tscientists...\n\n<b>\tANGLE - ALLEY\n</b><b> \n</b>\tLaura kneels down to unzip her John's pants.\n<b> \n</b>\t\t\t\tMALCOLM'S VOICE (contd) \n\t\tWho is going to raise our children?; men who \n\t\tmight have been astronauts, composers,\n\t\tengineers; Who is going to be the head of the \n\t\thouseholds?--\n<b> \n</b><b>136 \tINT. TEMPLE #7 - NIGHT\n</b><b> \n</b>\tMalcolm is addressing a HUGE AUDIENCE. His tone is more intense, more \n\tpersonal than before, because of his recent encounters. In the \n\taudience, sitting with Bembry, is BETTY, a lovely dark-skinned woman. \n\tHer interest in Malcolm (true, also, for most of the other unmarried \n\tsisters) is more than religious.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t--and what has the white devil made of them: \n\t\tdead souls. Oh, my he has no conscience. He \n\t\tshould fall on his knees and say, \"My kind \n\t\tcommits history's greatest crime against your \n\t\tkind every day of your life.\" But does he? No. \n\t\tHe scorns you, splits your head with his \n\t\tnightstick and calls you nigger. If you've had \n\t\tit, then stand up and come forward. If not us, \n\t\tthen who? If not now, then when?\n<b> \n</b><b>\tANGLE - THE AUDIENCE\n</b><b> \n</b>\tMany stand, some walk toward the podium speaking his name: \"I'm with \n\tyou, Brother Malcolm,\" \"Praise Allah,\" \"Me, Brother Malcolm.\"\n<b>  \n</b>\tThere is applause; some of the audience get to their feet -- Malcolm \n\tacknowledges their approval, trying to quiet them, but caught up in the\n \theady excitement of leadership.\n<b> \n</b><b>\tCLOSE - BETTY AND BEMBRY\n</b><b> \n</b>\tBoth are moved by Malcolm's performances.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(whispering) \n\t\tHe ought to try to make it a little easier, \n\t\tBrother Bembry.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tWhy don't you try telling him that, Sister \n\t\tBetty?\n<b> \n</b><b>137\tINT. A LARGE ANTEROOM IN TEMPLE #7 - NIGHT\n</b><b> \n</b>\tThe Muslim movement has grown enormously. The activity in this \n\tanteroom, leading to other rooms off it, shows that. Betty and Bembry \n\tstand before a Directory announcing activities in the Temple: MONDAY - \n\tFruit of Islam Meeting; TUESDAY - Unity Night; WEDNESDAY - Student \n\tEnrollment; THURSDAY - Muslim Girls Training; FRIDAY - General\n\tCivilization Class; SATURDAY - Swahili, etc.\n<b> \n</b>\tA stir of people and activity as Malcolm enters the anteroom. He \n\texcuses himself from a group of MUSLIMS, making his way toward Bembry.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t\t(little out of breath) \n\t\tBrother Bembry, can we fix it so our \n\t\tloudspeaker is heard on the street?\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tI'm sure we can. This is a new sister, Sister \n\t\tBetty.\n<b> \n</b>\tMalcolm nods at her; she nods in return.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tThe Sister lectures our Muslim women in hygiene \n\t\tand diet.\n<b> \n</b>\tMalcolm mutters \"very good,\" but his mind is clearly on a million other \n\tdetails.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tThe Sister stresses care of the body and \n\t\tregular eating habits.\n<b> \n</b>\tMalcolm is still distracted.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tThe Sister wonders if the Brother knows what \n\t\tHarriet Tubman did between taking souls to the \n\t\tPromised Land?\n<b> \n</b>\tMalcolm is stopped. He looks at Betty.\n<b> \n</b><b> \t\t\t\tMALCOLM \n</b>\t\tWhat?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tShe ate.\n<b> \n</b>\tMalcolm laughs.\n\n\t\t\t\tBETTY (contd) \n\t\tAnd the Sister suggests he put his actions \n\t\twhere his mouth is.\n<b> \n</b>\tMalcolm's laughter is heard, in response.\n\n<b>138 \tINT. MUSLIM CAFETERIA - NIGHT TWO-SHOT - BETTY AND MALCOLM\n</b><b> \n</b><b> \t\t\t\tMALCOLM \n</b>\t\tSure I'll speak to your class. But I'm a hard \n\t\tman on women. You want to know why?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tIf you want to tell me.\n<b> \n</b><b>\t\t\t\t\t\t\t\tCUT TO:\n</b><b> \n</b><b>138A \tEXT. ELIJAH'S GARDEN - DAY\n</b><b> \n</b>\tMalcolm sits next to the Honorable Elijah Muhammad. The student and the \n\tteacher.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIf you want to tell me.\n<b> \n</b><b>\t\t\t\tELIJAH\n</b>\t\tWomen are deceitful. They are untrustworthy \n\t\tflesh. I've seen too many men ruined or tied \n\t\tdown or messed up by women.\n\n<b>\t\t\t\t\t\t\t\tCUT BACK TO:\n</b><b> \n</b><b>138B \tBETTY AND MALCOLM\n</b><b> \n</b>\tBetty says nothing, she merely pushes the salad plate a little toward \n\thim. The food has thus far gone untouched. Malcolm continues.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWomen talk too much. To tell a woman not to \n\t\ttalk is like telling Jesse James not to carry a \n\t\tgun or a hen not to cackle. And Samson, the \n\t\tstrongest man that ever lived, was destroyed by \n\t\tthe woman who slept in his arms.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tShall I tell my sisters that we oppose \n\t\tmarriage?\n\n<b>\t\t\t\t\t\t\t\tCUT TO:\n</b><b> \n</b><b>\tCLOSE - ELIJAH\n</b><b> \n</b><b>\t\t\t\tELIJAH \n</b>\t\tNo. We are not Catholic priests. We do not \n\t\tpractice celibacy. If a woman is the right \n\t\theight for a man, the right complexion, if her \n\t\tage is half the man's plus seven, if she \n\t\tunderstands that man's essential nature is \n\t\tstrong and woman's weak, if she loves children, \n\t\tcan cook, sew and stay out of trouble--\n\n<b>\t\t\t\t\t\t\t\tCUT TO:\n</b><b> \n</b><b>\tCLOSE - BETTY\n</b><b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tI think you've made your points, Brother \n\t\tMalcolm.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat points?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tThat you haven't time for either marriage or \n\t\teating--\n<b> \n</b>\tMalcolm chuckles a bit.\n<b> \n</b>\t\t\t\tBETTY (contd) \n\t\t--and that women aren't the only ones who \n\t\ttalk a lot.\n<b> \n</b>\tNow he bursts out laughing.\n<b> \n</b><b>\tCLOSE - BROTHERS SIDNEY AND EARL \n</b>\n\tThey are alarmed at Brother Minister's behavior. \n\n<b>\tTWO-SHOT - BETTY AND MALCOLM\n</b><b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tIf you'll start eating, there is a question I \n\t\thave. Go ahead. Start.\n<b> \n</b>\tHe takes a forkful of the salad.\n<b> \n</b>\t\t\t\tBETTY (contd) \n\t\tConsidering today's standards of animal raising \n\t\tand curing meats, I don't fully understand the \n\t\trestriction on pork.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet me explain. No. I'll do better than that. \n\t\tI'll show it to you. Scientifically. But it's \n\t\tdemonstration purely in the interest of \n\t\tscience, you understand?\n<b> \n</b><b>\t\t\t\tBETTY'S VOICE:\n</b>\t\tYes, I understand, Brother Malcolm. Purely \n\t\tscientific.\n<b> \n</b><b>139 \tINT. MUSEUM OF NATURAL HISTORY - DAY\n</b><b> \n</b>\tBefore a comparative evolutionary display showing the skeletons of\n \tvarious animals, Malcolm is holding forth. Betty is dressed in a vivid, \n\tbecoming red dress.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNotice especially the claw, the jaw and the \n\t\tskull formation. This is the rat. This the \n\t\tmole. Here you have the aardvark and the \n\t\tboar...\n<b> \n</b><b>\tCLOSE ON THE SKELETONS\n</b><b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\t...All members of the pig-rodent family.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tI see your point.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSo it is not a matter of the breeding \n\t\tconditions or preparation of the meat. The meat \n\t\titself is foul.\n<b> \n</b>\tANGLE. As they saunter out, passing the huge skeletons of prehistoric \n\tanimals now.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tCould we sit down someplace?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm sorry. I've had you on your feet for hours.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou've been on your feet for days. And didn't \n\t\teven finish your salad.\n<b> \n</b><b>140\tINT. SODA FOUNTAIN - DAY\n</b><b> \n</b><b>\t\t\t\tWAITER \n</b>\t\tYou're the strawberry soda and you're the hot \n\t\tfudge sundae.\n\n\tHe plunks down the order before Betty and Malcolm. Malcolm takes a \n\tlong, long satisfying pull on his straw. Then he sighs: \n\n<b>\t\t\t\tMALCOLM \n</b>\t\tThat's something I haven't done in fifteen years.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSat down with a pretty girl and had an ice \n\t\tcream soda.\n<b> \n</b><b>\t\t\t\tBETTY \n</b>\t\tHow do you like it?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDelicious.\n<b> \n</b>\tShe laughs. He blushes.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tLet's talk about you for a change.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tThere's nothing to talk about.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t0h, yes, there is. I know a lot about you.\n\t\tBrother Bembry briefed me.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tOh? Purely scientific interest I'm sure.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t\t(a beat) \n\t\tYou're from Detroit, near where I come from. \n\t\tYou majored in education at Tuskegee. You're \n\t\tstudying nursing and having trouble with your \n\t\tfamily.\n<b>  \n</b><b>\t\t\t\tBETTY\n</b> \t\tI can handle it.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThey want you to quit the Muslims or they won't \n\t\tpay your tuition, isn't that it?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou have enough worries of your own.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNo, good Sisters are rare. We need every one. \n\t\tTell me something: how tall are you?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhy do you ask?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tJust an idle question.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tIf it's just idle, I won't answer it.\n<b> \n</b>\tShe takes a bite of her sundae.\n<b> \n</b>\t\t\t\tBETTY (contd) \n\t\tBut Brother Bembry says I'm tall enough for a \n\t\ttall man.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHow old are you, Betty?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tThere's a few things you don't know about \n\t\twomen, Brother Malcolm. They're possessive and \n\t\tvain.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAre you?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tAnd dogged when I set my mind to something.\n<b> \n</b><b>\t\t\t\tMALCOLM\n</b>\t\tWhat have you set your mind to?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tBeing a good Muslim, a good nurse and a good \n\t\twife.\n<b> \n</b>\tMalcolm takes a good look at the lovely woman in front of him, then a \n\tlong sip from his ice cream soda.\n<b> \n</b><b>\t\t\t\tSIDNEY'S VOICE \n</b>\t\tBrother Malcolm.\n<b> \n</b>\tBetty sees him first.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tIt's Sidney.\n<b> \n</b>\tANGLE. As Sidney runs to them at the table: \n\n<b>\t\t\t\tSIDNEY \n</b>\t\tBrother Johnson was attacked by the cops.\n<b> \n</b><b>\t\t\t\tA MAN'S VOICE \n</b>\t\tThere was a scuffle. The Brother was watching.\n<b> \n</b><b>141\tEXT. SIDE STREET IN HARLEM - P.M.\n</b>\n\tMalcolm listening as SEVERAL WITNESSES simultaneously describe the \n\tattack. A small angry CROWD has gathered. The most animated one is \n\tBENJAMIN, a very dark young black teenager, we will soon meet him \n\tlater.\n<b> \n</b><b>\t\t\t\tBENJAMIN \n</b>\t\tThe cop says, \"Move on.\"\n<b> \n</b><b>\t\t\t\tMAN \n</b>\t\tThe Brother didn't scatter fast enough for the \n\t\tofay.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tBENJAMIN \n</b>\t\tCrack. He bled like a stuck hog.\n<b> \n</b><b>\t\t\t\tMAN \n</b>\t\tWatcha gonna do?\n<b> \n</b><b>\t\t\t\tVOICE FROM THE CROWD\n</b>\t\t\t(deprecatingly) \n\t\tHe'll rap a little. He's a Muslim. And make a \n\t\tspeech.\n<b> \n</b><b>\t\t\t\tANOTHER VOICE FROM CROWD \n</b>\t\tMuslims talk a good game, but they never do \n\t\tnothing, unless somebody bothers Muslims.\n\n\tMalcolm's face goes taut. He nods sharply at Sidney, as Benjamin \n\twatches them both.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tI demand to see Brother Johnson.\n<b> \n</b><b>142 \tINT. POLICE STATION - LATE P.M.\n</b>\n\tMalcolm facing a DESK SERGEANT, TWO UNIFORMED COPS and a PLAINCLOTHESMAN\n\toff to one side.\n<b> \n</b><b>\t\t\t\tSERGEANT \n</b>\t\tWho the hell are you?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm from Muslim Temple 7.\n<b> \n</b><b>\t\t\t\tCOP \n</b>\t\tNever heard of you.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhere is he?\n<b> \n</b>\tThe police respond with a squeeze play intended to intimidate Malcolm:\n<b> \n</b><b>\t\t\t\tSERGEANT \n</b>\t\tNobody here by that name.\n<b> \n</b><b>\t\t\t\tPLAINCLOTHES \n</b>\t\tWhat's your name, feller?\n<b> \n</b>\tHe feels the power play and stiffens in resistance.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm Minister Malcolm X. Two witnesses saw him \n\t\tbrought in. He was not brought out.\n<b> \n</b><b>\t\t\t\tPLAINCLOTHES \n</b>\t\tYou heard the Sergeant. Outside.\n<b> \n</b>\tMalcolm stands his ground coolly.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tTake a look out that window. I intend to see \n\t\tBrother Johnson.\n<b> \n</b>\tThe cops eye each other. Plainclothes walks to the window. \n\n<b>143\tEXT. THE STREET OUTSIDE - LATE P.M.\n</b><b> \n</b>\tAcross from the station is a phalanx of some FIFTY MEN of the Fruit \n\tof Islam. All are dressed in dark suits with white shirts. They stand \n\tin military formation: eyes forward, every face burning. People from \n\tthe neighborhood have formed a crowd behind and around them. WE MAKE \n\tOUT Benjamin among the crowd. \n\n<b>143A\tINT. POLICE STATION - NIGHT\n</b><b> \n</b><b>\t\t\t\tPLAINCLOTHES \n</b>\t\tWho the hell are they?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBrothers of Brother Johnson.\n<b> \n</b><b>\t\t\t\tPLAINCLOTHES \n</b>\t\tEddie, let's see that blotter.\n<b> \n</b><b>\tTWO-SHOT - FAVOR MALCOLM\n</b><b> \n</b>\tAs the cops examine the police blotter.\n<b> \n</b><b>\t\t\t\tSERGEANT\n</b>\t\tYeah. We got a Muslim. The relief must of put it \n\t\tdown.\n<b> \n</b><b>\t\t\t\tPLAINCLOTHES \n</b>\t\tBut you can't see him. You ain't his lawyer.\n<b> \n</b><b>\t\t\t\tSERGEANT \n</b>\t\tNo lawyer, no see.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tUntil I'm satisfied Brother Johnson is \n\t\treceiving proper medical attention, no one will \n\t\tmove.\n<b> \n</b>\tCops eye each other. Plainclothes nods slightly, he has to give in, \n\tMalcolm is not playing.\n<b> \n</b><b>144\tINT. A LOCKUP - SAME\n</b><b> \n</b>\tThe back of Malcolm's head, as he examines Brother Johnson. As he comes \n\tup OUT OF FRAME, WE SEE that Johnson has been badly beaten.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t\t(shaking) \n\t\tOnly a pig could do a thing like that.\n<b> \n</b><b>\t\t\t\tPLAINCLOTHES \n</b>\t\tWatch your tongue, boy.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDon't you call me boy, you pig. Letting a man \n\t\tbleed like that.\n<b> \n</b>\tSergeant puts a restraining hand on Plainclothes.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tThat man belongs in a hospital. Get an ambulance. \n\t\tNow! \n\n<b>145 \tEXT. THE STREET - LATER (DARKER)\n</b><b> \n</b>\tAs Johnson's body, on a stretcher, is hurried into an ambulance. The \n\tcrowd has grown in proportions. There are ad libs: \"Goddam pigs,\" \"Damn \n\tpolice brutality,\" \"Least they got him out of the meat house.\"\n<b> \n</b>\tMalcolm with the Sergeant and a LIEUTENANT, as the ambulance pulls away.\n<b> \n</b><b>\t\t\t\tLIEUTENANT\n</b>\t\tAll right, break it up. You got what you wanted.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm not satisfied.\n<b> \n</b>\tMalcolm starts walking down the center of the street, after the \n\tambulance.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tTo the hospital.\n<b> \n</b>\tThe Fruit of Islam fall in behind him, marching slowly. It takes on the \n\tstart of a march as the neighborhood people fall in behind them. People \n\t(especially kids) race with them on the street and on the sidewalk.\n<b> \n</b><b>\tANGLE - BENJAMIN\n</b><b> \n</b>\tBenjamin fights his way through the crowd trying to walk beside Malcolm, \n\tthe Brothers in the Fruit stop him and Benjamin drops back.\n<b> \n</b><b>146 \tEXT. LENOX AVENUE - NIGHT\n</b><b> \n</b> \tNow the march has taken over the broad avenue. COPS are forced to \n\tredirect traffic, holding up crosstown cars as the group walks solemnly \n\tby. The people walking behind have swelled it to a huge demonstration. \n\tTheir faces reflect their anger and their satisfaction that, for once, \n\tsomething is being done about what has happened.\n<b> \n</b><b>147 \tEXT. HARLEM HOSPITAL - NIGHT\n</b><b> \n</b>\tLONG SHOT SHOWS the Muslim men in perfect order, calm with their arms \n\tfolded across their chests, waiting. Their eyes are on Malcolm as he \n\twalks toward the hospital entrance. \n\n<b>\tSHOTS\n</b>\n\t--of the growing crowd.\n\n\t--of the nervous cops, including some big brass.\n<b> \n</b>\t--of kids watching from a rooftop.\n\n\t--of Benjamin trying to emulate the Fruit of Islam. \n\n<b>148\tEXT. OUTSIDE HARLEM HOSPITAL - NIGHT \n</b>\n\tMalcolm is standing in front of the Fruit of Islam men, as HIGHRANKING \n\tPOLICE OFFICER GREEN comes over.\n<b> \n</b><b>\t\t\t\tCAPTAIN GREEN\n</b>\t\tAll right, that's enough. I want these people \n\t\tmoved out of here.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThey're all disciplined men. They're doing \n\t\tnothing except waiting.\n<b> \n</b><b>\tSHOT\n</b><b> \n</b>\tThe unruly crowd behind the Fruit of Islam. They are restive, milling, \n\tugly.\n<b> \n</b><b>\t\t\t\tCAPTAIN GREEN \n</b>\t\tWhat about them?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThat's your headache, Captain. And if he dies, \n\t\tI pity you.\n<b> \n</b><b>149\tEXT. OUTSIDE HARLEM HOSPITAL - NIGHT\n</b><b> \n</b><b>\t\t\t\tDOCTOR \n</b>\t\tHe'll live. He's getting the best care we can \n\t\tgive.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThank you, Doctor.\n<b> \n</b><b>\t\t\t\tDOCTOR \n</b>\t\tI had to put a plate in his head.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t\t(to Captain) \n\t\tYou bastards.\n<b> \n</b><b>\t\t\t\tCAPTAIN GREEN \n</b>\t\tAll right, okay. Now disperse this mob.\n<b> \n</b><b>\tMEDIUM SHOT - MALCOLM, FRUIT OF ISLAM AND CROWD \n</b>\n\tIt's clear the decision is in one man's hands, Malcolm's. \n\n<b>\tCLOSE SHOT - MALCOLM \n</b>\n\tHe makes a gesture with his hand, the Fruit of Islam disperse.\n<b> \n</b>\tANGLE. People moving away, going home. Only one person remains from the \n\tFruit of Islam and the crowd, it's Benjamin.\n<b> \n</b><b>\tCLOSE - CAPTAIN GREEN\n</b><b> \n</b><b>\t\t\t\tCAPTAIN GREEN \n</b>\t\tThat's too much power for one man to have.\n<b> \n</b><b>149A \tINT. MUSLIM CAFETERIA - NIGHT\n</b><b> \n</b>\tEveryone is in a somber mood over the evening's events. \n\n<b>\tANGLE - TABLE \n</b>\n\tMalcolm sits with Brothers Earl and Sidney.\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tBrother Minister, we need to strike back.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tPut fear into those devils.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI want to also, but until we are instructed by \n\t\tthe Messenger to do so, we will just wait and \n\t\tpray.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tI'm tired of praying.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThat's enough, Brother Earl.\n<b> \n</b><b>\tANGLE - ENTRANCE\n</b><b> \n</b>\tBenjamin comes into the cafeteria and everyone looks at him. He sees \n\tMalcolm sitting and moves toward his table.\n<b> \n</b><b>\tANGLE - TABLE \n</b>\n\tBrothers Sidney and Earl get up to intercept him but Malcolm waves him \n\tthrough. Benjamin stands.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSit down, son.\n<b> \n</b>\tMalcolm pours some cream into his cup of black coffee, then also some \n\twhite sugar.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tThere is only one thing I like integrated. My \n\t\tcoffee.\n<b> \n</b>\tBenjamin laughs.\n\n\t\t\t\tMALCOLM (contd) \n\t\tWhat can I do for you?\n<b> \n</b><b>\t\t\t\tBENJAMIN\n</b>\t\tMr. X, I was out there tonight. I saw what you \n\t\tdid. I want to be a Muslim. I ain't never seen \n\t\ta Negro stand up to the police like that.\n<b> \n</b><b>\tANGLE - SIDNEY AND EARL\n</b><b> \n</b>\tThey exchange dubious looks.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDo you know what it means to be a true Muslim?\n<b> \n</b>\tBenjamin hesitates.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tDo you?\n<b> \n</b><b>\t\t\t\tBENJAMIN \n</b>\t\tNot exactly, but I want to be one, like you.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI admire your enthusiasm but you should never \n\t\tjoin any organization without first checking it \n\t\tout thoroughly.\n<b> \n</b>\tBenjamin is crushed and he starts to get up.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tWe need more young warriors like yourself, \n\t\tstick around and we shall see if your heart is \n\t\ttrue.\n<b> \n</b><b>\t\t\t\tBENJAMIN \n</b>\t\tMr. X, I won't make you out a liar.\n<b> \n</b><b>180 \tINT. TEMPLE #1 - DETROIT - DAY\n</b><b> \n</b><b>\tCLOSE - NEWSPAPER HEADLINE (DAILY NEWS) \n</b>\n<b>\tMALCOLM X WINS $70,000 JUDGMENT FOR BEATEN NEGRO \n</b>\n\tAn AIDE of Elijah puts down the newspaper and shakes Malcolm's hand.\n<b> \n</b><b>\t\t\t\tAIDE\n</b>\t\tThe Honorable Elijah Muhammad would like to see \n\t\tyou now.\n<b> \n</b><b>151\tINT. ELIJAH'S OFFICE - DAY\n</b><b> \n</b>\tElijah is sweeping the floor with a plain hand broom. Malcolm enters \n\tthe room, is surprised and waits at the door. The two are alone \n\ttogether.\n<b> \n</b><b>\t\t\t\tELIJAH\n</b>\t\tIf I surprise you, let me explain. Menial work \n\t\tteaches us humility.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet me do it then.\n<b> \n</b><b>\t\t\t\tELIJAH \n</b>\t\tNo, each of us must relearn that work is the \n\t\tonly worthwhile thing. Allah has given you a \n\t\tgreat gift. Use it wisely, never forgetting \n\t\tthat we are nothing, while He is all.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAllah Akbar.\n<b> \n</b>\tThe sweeping done, they stand together near a table at a window.\n<b> \n</b><b>\t\t\t\tELIJAH\n</b>\t\tTonight I shall introduce you as my National \n\t\tRepresentative. It will be a difficult task. \n\t\tYour assignment is to build temples all over \n\t\tthis nation. More work than you have ever done \n\t\tin your life and you will be in the public eye. \n\t\tMy son, beware of those cameras, they are just \n\t\tas bad as a narcotic.\n\n\tANGLE - AIDES and OTHERS come into the room now. They are listening.\n\n\t\t\t\tELIJAH (contd) \n\t\tYes, the white devil will watch your every \n\t\tstep. Even your own Brothers will become \n\t\tjealous, and hostile, go slowly. So I offer you \n\t\ta parable -- regarding your work.\n<b> \n</b>\tElijah picks up a glass and sets it before Malcolm.\n<b> \n</b>\t\t\t\tELIJAH (contd) \n\t\tHere is a glass, dirty and its water foul. If \n\t\tyou offer it to the people and they have no \n\t\tchoice, they must drink out of it. But if you \n\t\tpresent them with this glass--\n<b> \n</b>\tHe is holding a clean glass, with clear water in it.\n<b> \n</b>\t\t\t\tELIJAH (contd) \n\t\t--and let them make their decision, they will \n\t\tchoose the pure vessel. Islam is the only \n\t\treligion which addresses the needs and problems \n\t\tof the so-called Negro, especially in the \n\t\tghettos -- Islam is the only way out from drugs, \n\t\tcrime, unemployment, prostitution, alcohol, \n\t\tgambling, fornication and adultery.\n<b> \n</b>\tElijah holds up the clear glass.\n<b> \n</b><b>\t\t\t\tVOICE OF MALCOLM X \n</b>\t\tThis sweet, gentle man gave me the truth from \n\t\this own mouth. And I adored him, in the sense \n\t\tof the Latin root of the word. Adorare, to \n\t\tworship and to fear. He was the first man I \n\t\tever feared -- not fear such as the one has of \n\t\ta gun but the fear one has of the power of the \n\t\tsun, I pledged myself to him, even if it cost \n\t\tme my life.\n<b> \n</b><b>152\tINT. A HOSPITAL WARD - DAY\n</b><b> \n</b>\tBetty is administering to a PATIENT, as a phone is heard ringing. It's \n\tanswered. ANOTHER NURSE motions Betty to the phone. She finishes with \n\ther patient and goes quickly.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tHello.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tSister Betty?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tYes.\n<b> \n</b><b>153\tEXT. A PAY PHONE AT A GAS STATION - DAY\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm in Detroit.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tI know.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAt a gas station. \n\t\t\t(a beat) \n\t\tWill you marry me?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tYes.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDid you hear what I said?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tYes I did. Did you hear my answer?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI think so. Can you catch a plane?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tYes. Did you eat?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI love you.\n<b> \n</b><b>154 \tINT. BEMBRY'S BEDROOM - NIGHT\n</b><b> \n</b>\tBetty and Malcolm sit on the floor in the dimlit room, very close.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIt won't be easy.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tJust hold me.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIt will be rough.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tHush your mouth.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'll be away a lot.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou're with me even when you're away.\n<b> \n</b>\tHe embraces her. Then Betty laughs.\n<b> \n</b>\t\t\t\tBETTY (contd) \n\t\tI never told you, but when I first saw you on \n\t\tthe podium, cleaning your glasses, I felt sorry \n\t\tfor you. Nobody as young as you should be that \n\t\tserious. But I don't think that anymore.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat do you think?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tThe simplest thing in the world: I want to have \n\t\ta lot of babies with you. Dear Heart, I love \n\t\tyou.\n\n\tFull embrace.\n\n<b>\t\t\t\tBEMBRY'S VOICE \n</b>\t\tWe're waiting on you folks. You trying to starve \n\t\tus?\n<b> \n</b><b>155\tINT. BEMBRY'S LIVING ROOM - NIGHT\n</b><b> \n</b>\tMalcolm has just cut the cake and handed a slice to Betty. Amid \n\tlaughter and great warmth, Sidney unfurls the front page of the \n\t_Messenger_, the Muslim newspaper. Headline reads: \"MALCOLM X WEDS \n\tBETTY SAUNDERS.\" Betty kisses her husband and Bembry, Lorraine, Earl, \n\tSidney, Peter and VARIOUS BROTHERS AND SISTERS applaud.\n<b> \n</b>\tWe notice the subtle change in the apartment: it is more comfortable; \n\tthere is even evidence of some small luxury: a TV set, a new settee, \n\tetc.\n\n<b>156\tEXT. RALLY - HARLEM - DAY \n</b>\n\tMalcolm is speaking to a GOOD SIZED AUDIENCE:\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI must emphasize at the outstart, that the \n\t\tHonorable Elijah Muhammad is not a politician, \n\t\tso I'm not here this afternoon as a Republican, \n\t\tnor a Democrat, not as a Mason nor an Elk, not \n\t\tas a Christian nor a Jew, not as a Catholic nor \n\t\ta Protestant, not as a Baptist nor a Methodist, \n\t\tnot even as an American. For if I was an \n\t\tAmerican the problem that confronts our people \n\t\ttoday would not exist. So I stand here as what \n\t\tI was when I was born: A BLACK MAN!\n<b> \n</b><b>\tCROWD REACTIONS\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tBefore there were any such things as Democrats \n\t\tor Republicans, we were black. Before there \n\t\twere any such things as Masons or Elks, we\n\t\twere black. Before there were any such things \n\t\tas Jews or Christians, we were black people. In \n\t\tfact long before there was ever any such place \n\t\tas America, we were black people... And after \n\t\tAmerica has long passed from the scene there \n\t\twill still be BLACK PEOPLE.\n<b> \n</b><b>\tCLOSE - BENJAMIN\n</b><b> \n</b>\tHe is neatly dressed in white shirt, jacket and tie, a fine young \n\tMuslim.\n<b> \n</b><b>\t\t\t\tBENJAMIN 2X \n</b>\t\tTake your time.\n<b> \n</b><b>157\tINT. CHICAGO TEMPLE - NIGHT\n</b><b> \n</b>\tThe Honorable Elijah Muhammad sits on the stage to the right of Malcolm.\n\tThis is a larger audience.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat kind of black people does the Honorable \n\t\tElijah Muhammad speak for? Black people who are \n\t\tjobless... the black masses who are poor, \n\t\thungry, and angry, the black masses who are \n\t\tdissatisfied with the slums and ghettos in \n\t\twhich we have been forced to live... the black \n\t\tmasses who are tired of listening to the \n\t\tpromises of white politicians to correct the \n\t\tmiserable living conditions that exist in our \n\t\tcommunity... the black masses that are sick of \n\t\tthe inhuman acts of bestial brutality practiced \n\t\tby these semi-savage white policemen that \n\t\tpatrol our community, like the occupation \n\t\tforces of a conquering enemy army... the black \n\t\tmasses who are fed up with the anemic, Uncle \n\t\tTom leadership set up by the white man to act \n\t\tas a spokesman for our people and to KEEP US \n<b>\t\tSATISFIED AND PACIFIED WITH NOTHING!\n</b><b> \n</b><b>\tCROWD - REACTIONS\n</b><b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIf the black man cannot go back to his own \n\t\tpeople and his own land, Elijah Muhammad is \n\t\tasking that a part of the United States be \n\t\tseparated and given to the Muslims so they can \n\t\tlive separately.\n<b> \n</b><b>\tCLOSE - ELIJAH\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tThe Honorable Elijah Muhammad is the only man \n\t\tthe white people can deal with in the solving \n\t\tof problems of the so-called Negro...\n<b> \n</b><b>\tCLOSE - MALCOLM \n</b>\n\t\t\t\tMALCOLM (contd) \n\t\t...as Elijah Muhammad knows his problems. \n\n<b>158 \tINT. BETTY'S BEDROOM - NIGHT \n</b>\n\tA modest room. She is rocking a cradle with her foot as she writes: \n\n<b>\t\t\t\tBETTY'S VOICE \n</b>\t\tAttallah is fine. Our firstborn is an angel and \n\t\ta beauty. And misses you as I do. But the news \n\t\tthat you've dedicated four new temples is \n\t\talmost as good as having you with us.\n<b> \n</b><b>158A\tINT. HOTEL ROOM - NIGHT \n</b>\n\tMalcolm sits in front of a television screen and watches the evening \n\tnews. The following speech will be INTERCUT with \n\n<b>\tA SERIES OF OLD NEWSREEL FOOTAGE - BLACK &amp; WHITE \n</b>\n\t(newsclips from Birmingham, Selma, Mississippi, and elsewhere): \n\n158B\t--POLICE using dogs against DEMONSTRATORS. \n\n158C\t--The Reverend Dr. Martin Luther King marching. \n\n158D\t--Cattle prods used against MEN, WOMEN and CHILDREN. \n\n158E\t--The Reverend Dr. Martin Luther King singing \"We Shall Overcome.\"\n<b> \n</b>158F\t--PREGNANT WOMAN knocked down by high-pressure water hoses.\n\n158G\t--The Reverend Dr. Martin Luther King leading a crowd in prayer.\n<b> \n</b>158H\t--Students sitting in at a counter.\n\n158I\t--The smoldering ruins of Birmingham's 16th St. Baptist church.\n<b> \n</b><b>158J\n</b><b>\t\t\t\tMALCOLM/HIS VOICE \n</b>\t\tThe white people who are guilty of white \n\t\tsupremacy try and hide their own guilt by \n\t\taccusing the Honorable Elijah Muhammad of \n\t\tteaching black supremacy when he tries to \n\t\tuplift the mentality, the social, and economic \n\t\tcondition of black people in this country. And \n\t\tthe Jews, who have been guilty of exploiting \n\t\tthe black people economically, civilly, and \n\t\totherwise, hide their guilt by accusing the \n\t\tHonorable Elijah Muhammad of being anti-Semitic \n\t\tsimply because he teaches our people to go into \n\t\tbusiness for ourselves and trying to take over \n\t\tthe economic leadership in our own community. \n\t\tThe black people in this country have been the \n\t\tvictims of violence at the hands of the white \n\t\tman for 400 years, and following the ignorant \n\t\tNegro preachers, we have thought that it was \n\t\tGod-like to turn the other cheek to the brute \n\t\tthat was brutalizing us. 100 years ago they \n\t\tuse to put on a white sheet and use a \n\t\tbloodhound against Negroes. Today they've taken\n\t\toff sheets and put on police uniforms, they've \n\t\ttraded in the bloodhounds for police dogs. And \n\t\tjust as Uncle Tom back during slavery used to \n\t\tkeep the Negroes from resisting the bloodhounds \n\t\tor resisting the Ku Klux Klan by telling them \n\t\tto love their enemy or pray for those who use \n\t\tthem as spitefully today. The Honorable Elijah \n\t\tMuhammad is showing black people that just as \n\t\tthe white man and every other person on this \n\t\tearth has God given rights, natural rights, \n\t\tcivil rights, and any other kind of rights that \n\t\tyou can think of when it comes to defending \n\t\thimself.\n<b> \n</b><b>159\n</b>\n<b>A-C\tINT. TV STUDIO \n</b>\n<b>\tCLOSE SHOT - MALCOLM'S FACE \n</b>\n\tWith a studio mike around his neck, he's on a panel show. \n\n<b>\tANGLE - MODERATOR\n</b><b> \n</b><b>\t\t\t\tMODERATOR\n</b>\t\tMr. X, before we start our discussion tonight \n\t\t-- The Black Muslims: Hate Mongers -- would you \n\t\tmind explaining for us the meaning of your \n\t\tname, which is the letter X.\n<b> \n</b><b>\tANGLE - PANEL \n</b>\n\tOpposing Malcolm is DR. PAYSON, a NAACP-type NEGRO. \n\n<b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYes sir. As you know, during slavery time, the \n\t\tslavemasters named most of the so-called \n\t\tNegroes in America after themselves. Mr. Elijah \n\t\tMuhammad teaches us once you come into the \n\t\tknowledge of Islam, you replace your slave name \n\t\twith an X. Since we've been disconnected, cut \n\t\toff from our Eastern culture for so long that \n\t\twe don't know the names we originally had, we \n\t\twill use X until we get back to the East.\n<b> \n</b><b>\tANGLE - MODERATOR\n</b><b> \n</b><b>\t\t\t\tMODERATOR\n</b>\t\tThank you. Now Dr. Payson.\n<b> \n</b><b>\tCLOSE - DR. PAYSON\n</b><b> \n</b><b>\t\t\t\tDR. PAYSON \n</b>\t\tMr. X is a demagogue. He has no place to go, so \n\t\the exaggerates. He's a disservice to every good \n\t\tlaw-abiding Negro in the country. Can I ask you \n\t\ta question?\n<b>  \n</b><b>\tCLOSE: - DR. PAYSON\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tPlease, go ahead.\n<b> \n</b><b>\t\t\t\tDR. PAYSON \n</b>\t\tMr. Malcolm X, why do you teach black \n\t\tsupremacy? Why do you teach hate?\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tFor the white man to ask the black man if he \n\t\thates him is just like the rapist asking the \n\t\traped, or the wolf asking the sheep, \"Do you \n\t\thate me!\" The white man is in no moral position \n\t\tto accuse anyone of hate.\n<b> \n</b><b>\tANGLE - PANEL\n</b><b> \n</b><b>\t\t\t\tMODERATOR\n</b>\t\tCertainly, Mr. X, you must admit there has been \n\t\tprogress.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'll talk about \"progress\" in a minute, but let \n\t\tme finish with my brother.\n\n\tMalcolm gestures to the Negro panelist.  The BLACK MEMBERS of the TV \n\taudience are lapping it up. Betty and Earl also sit in the TV studio \n\taudience.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tStop me if I'm wrong. I \"polarize the community.\" \n\t\tI \"erroneously appraise the racial picture.\"\n<b> \n</b><b>\t\t\t\tDR. PAYSON \n</b>\t\tYou put it very well.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou left one phrase out. Another educated \n\t\tKneegrew said to me and I quote: \"Brother \n\t\tMalcolm oversimplifies the dynamic interstices \n\t\tof the Negro subculture.\" Would you agree?\n<b> \n</b><b>\t\t\t\tDR. PAYSON \n</b>\t\tEntirely.\n<b> \n</b><b>\tANGLE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWell, I have this to say. Do you know what a \n\t\tNegro with a B.A., an M.A. and a Ph.D. is \n\t\tcalled -- by the white man? I'll tell you. He's \n\t\tcalled a nigger.\n<b> \n</b>\tThere is some blanching and guffawing from the audience. The moderator \n\tis totally embarrassed, Betty roars.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tAnd I'm not finished. To understand this man--\n<b> \n</b>\tHe points a sharp finger at the Negro Panelist.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\t--you must know that historically there are two \n\t\tkinds of slaves. House Negroes and Field \n\t\tNegroes. The house Negro lived in the big \n\t\thouse; he dressed pretty good; he ate pretty \n\t\tgood and he loved the master. Yeah, he loved \n\t\thim more than the master loved himself. If the \n\t\tmaster's house caught fire, he'd be the first \n\t\tto put the blaze out. If the master got sick, \n\t\the'd say: \"What's a matter, boss; we sick?\" \n\t\tWE sick! If someone said to him, \"Let's run \n\t\taway and escape. Let's separate.\" He'd say, \n\t\t\"Man, are you crazy? What's better than what I \n\t\tgot here?\" That was the House Negro. In those \n\t\tdays he was called the House Nigger. Well, \n\t\tthat's what we call them today because we still \n\t\tgot a lot of House Niggers running around.\n<b> \n</b>\tThere is applause from the blacks in the audience. Moderator tries to \n\tregain control.\n<b> \n</b><b>159D\tINT. ELIJAH'S OFFICE - DAY\n</b><b> \n</b><b>\tCLOSE - THE HONORABLE ELIJAH MUHAMMAD \n</b>\n\tHe is enjoying this display by his prize student, the CAMERA PANS to a \n\tCLOSE SHOT of BEMBRY and the same cannot be said.\n<b> \n</b><b>159E \tBACK TO STUDIO\n</b><b> \n</b><b>\t\t\t\tMODERATOR\n</b>\t\tI think, perhaps, Dr. Payson has something to--\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDon't you want to hear about the Field Nigger?\n<b> \n</b><b>\t\t\t\tDR. PAYSON \n</b>\t\tLet him finish.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThank you. Now the Negro in the field caught \n\t\thell all day long. He was beaten by the master; \n\t\the lived in a shack, wore castoff clothes and \n\t\thated his master. If the house caught fire, \n\t\the'd pray for a wind. If the master got sick, \n\t\the'd pray that he'd die. And if you said to \n\t\thim, \"Let's go, let's separate\", he'd yell, \n\t\t\"Yeah, man, any place is better than this.\" \n\t\tYou've got a lot of Field Negroes in America \n\t\ttoday. I'm one.\n<b> \n</b><b>\t\t\t\tBROTHER BENJAMIN \n</b>\t\tTell it.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t--there's another one. The majority of black \n\t\tAmericans today are Field Negroes. They don't \n\t\ttalk about OUR progress, about OUR government, \n\t\tOUR navy, OUR astronauts. Hell, they won't \n\t\teven let you near the plant.\n<b> \n</b><b>159F\tINT. ELIJAH'S OFFICE - DAY \n</b>\n\tBembry turns off the TV set and he commences to plant the seeds of \n\t\"betrayal.\"\n<b> \n</b><b>\tCLOSE - BEMBRY\n</b><b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tYour holy apostle, dear Messenger, I am your \n\t\ttrue servant and the brothers asked me to tell \n\t\tyou Malcolm is getting too much press. The \n\t\tbrothers think he thinks _he_ is the Nation of \n\t\tIslam, that he has aspirations to lead the \n\t\tNation. It was you who made Malcolm the man he\n\t\tis. You lifted him out of the darkness.\n<b> \n</b><b>\tCLOSE - ELIJAH\n</b><b> \n</b><b>\t\t\t\tELIJAH \n</b>\t\tGo and tell the brothers what Brother Minister \n\t\tis doing, has done, has been of great benefit \n\t\tto the Nation.\n<b> \n</b><b>\tCLOSER - BEMBRY\n</b><b> \n</b><b>\t\t\t\tBEMBRY\n</b>\t\tGreat benefit for himself. \n\n<b>159G\tBRIEF MONTAGE. THE RISE OF MALCOLM X\n</b><b> \n</b><b>\tEXT. STREET - HARLEM - DAY \n</b>\n\tMalcolm is walking the streets of Harlem like he is campaigning for \n\toffice. He has Brothers Sidney, Earl, and Benjamin at his side, a CROWD \n\tfollows him. Malcolm sees a WINO.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBrother Man, put that bottle down, take that \n\t\tpoison away from your lips. That's what the \n\t\tdevil wants you to do, stay high, out of your \n\t\tnatural mind. I know, I've been there.\n<b> \n</b>\tThe wino looks at Malcolm and continues to drink his wine.\n<b> \n</b>159H\t--Malcolm emerges from a doorway to be met by an army of TV REPORTERS \n\tarmed with microphones. He walks; they follow.\n<b> \n</b>159I\t--Malcolm walking in Harlem, urging people to lift themselves up, come \n\tto the meetings, etc.\n<b> \n</b><b>159J \tINT. TEMPLE #7\n</b><b> \n</b>\tMalcolm sits with Benjamin.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIt's time you received your X. But first you \n\t\tmust copy this letter, exactly as I give it to \n\t\tyou; down to the dotted \"i's,\" crossed \"t's,\" \n\t\teverything. And you must go on a fast, just \n\t\twater and juices, that's it.\n<b> \n</b><b>\tCLOSE - BENJAMIN\n</b><b> \n</b>\tHe takes the letter from Malcolm and looks at it.\n<b> \n</b><b>\t\t\t\tBENJAMIN \n</b>\t\tI'll have it tomorrow.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBrother Benjamin, do not rush, it has to be \n\t\texact.\n<b> \n</b>\t--Benjamin goes off in a corner and very quickly copies the letter, \n\the's so anxious.\n<b> \n</b>\t--Benjamin hands Malcolm his letter, Malcolm shakes his head and hands \n\tit back, it's not exact.\n<b> \n</b><b>159K\tEXT. STREET - HARLEM - DAY\n</b><b> \n</b>\tMalcolm is talking to a group of PEOPLE who are having a rent strike.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhen you live in a poor neighborhood, you're \n\t\tliving in an area where you have poor schools.\n<b> \n</b><b>159L \tCUTAWAY TO MALCOLM AND BENJAMIN\n</b><b> \n</b>\tMalcolm hands him back his letter again. The fast is getting to \n\tBenjamin.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tWhen you have poor schools you have poor \n\t\tteachers. When you have poor teachers, you get \n\t\ta poor education.\n<b> \n</b><b>159M\tCUTAWAYS TO THE DESPAIR OF HARLEM - SLUMS, TENEMENTS, GARBAGE, RATS\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tPoor education, you only work on poor paying \n\t\tjobs and that enables you to live again in a \n\t\tpoor neighborhood.\n<b> \n</b><b>159N\tCUTAWAY TO BLACK FACES\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tSo it's a very vicious cycle. We've got to \n\t\tbreak it.\n<b> \n</b><b>159O\tINT. MUSLIM CAFETERIA\n</b><b> \n</b>\tBenjamin weakly walks toward Malcolm and gives him his letter, which he \n\ttakes. The fast is wearing him out. \n\n<b>\tCLOSE - MALCOLM \n</b>\n\tMalcolm is inspecting it. \n\n<b>\tCLOSE - BENJAMIN \n</b>\n\tHis face is filled with apprehension. \n\n<b>\tANGLE - MALCOLM AND BENJAMIN\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou are now Benjamin 2X.\n<b> \n</b><b>\t\t\t\tBENJAMIN 2X \n</b>\t\tAll praises are due to Allah. Thank you, \n\t\tBrother Minister.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCome, sit with us.\n<b> \n</b><b>\tANGLE - TABLE \n</b>\n\tBenjamin 2X sits with Malcolm and Brothers Earl and Sidney.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWe are now sitting with Brother Benjamin 2X.\n<b> \n</b><b>\t\t\t\tEARL \n</b>\t\tAllah Akbar.\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tYou will be good.\n<b> \n</b><b>\t\t\t\tBENJAMIN 2X \n</b>\t\tBrother Minister, can I have something to eat?\n<b> \n</b>\tEveryone laughs.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet's get this man some food.\n<b> \n</b><b>160\tEXT. HARVARD SQUARE - DAY\n</b><b> \n</b>\tA CROWD OF STUDENTS outside the Law School. The setting is the same as \n\tthe last time we saw Malcolm and Shorty here, except now the students \n\tpart for him. Malcolm walks slowly toward the entrance, looking up at \n\tthe Latin inscription of the building when he is stopped by a WHITE \n<b>\tCOED.\n</b><b> \n</b><b>\t\t\t\tCOED\n</b>\t\tMr. X, I've read some of your speeches and I \n\t\thonestly believe a lot of what you say has \n\t\ttruth to it. I have a good heart. I'm a good \n\t\tperson despite my whiteness. What can the good \n\t\twhite people like myself, who are not \n\t\tprejudiced, or racist, what can we do to help \n\t\tthe cause?\n<b> \n</b><b>\tCLOSE - MALCOLM \n</b>\n\tHe stares at her.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNothing!\n<b> \n</b><b>\tCLOSE - COED\n</b>\n\tShe is absolutely crushed and runs away in tears. \n\n<b>161 \tINT. HARVARD LAW SCHOOL - DAY \n</b>\n\tSpeaking to a packed STUDENT AUDIENCE. \n\n<b>\t\t\t\tMALCOLM \n</b>\t\t...My high school was the black ghetto of \n\t\tRoxbury. My college was the streets of Harlem, \n\t\tand I took my masters in prison. If you look \n\t\tout the window--\n\n<b>161A \tSHOT MALCOLM'S OLD GANG HANGOUT\n</b><b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\t--you can see my burglary hangout. I lived \n\t\tlike an animal. Had it not been for the \n\t\tHonorable Elijah Muhammad I would surely be in \n\t\tan insane asylum or dead.\n<b> \n</b>\tANGLE - The audience carefully listening.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMr. Muhammad is trying to get us on God's side, \n\t\tso God will be on our side to help us fight our \n\t\tbattles. When Negroes stop getting drunk, stop \n\t\tbeing addicted to drugs, stop fornicating and\n\t\tcommitting adultery. When we get off the \n\t\twelfare, then we'll be MEN. Earn what you need \n\t\tfor your family, then your family respects you. \n\t\tThey'll be proud to say \"That's my father.\" \n\t\tShe's proud to say \"That's my husband...\" \n\t\tFather means you're taking care of those \n\t\tchildren. Just 'cause you made them that don't \n\t\tmean you're a father. Anybody can make a baby, \n\t\tbut anybody can't take care of them. Anyone can \n\t\tgo and get a woman but anybody can't take care \n\t\tof a woman. This is the type of teaching that \n\t\tthe honorable Elijah Muhammad teaches us so we \n\t\tcan build the moral fiber of our people.\n<b> \n</b><b>\tSHOT OF REPORTERS IN AUDIENCE\n</b><b> \n</b>\tBeginning to scribble furiously.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI can see the gentlemen of the press, also the \n\t\tFBI and CIA. are with us. Get it straight 'cuz \n\t\tif I said, \"Mary had a little lamb,\" they'd \n\t\twrite Malcolm X lampoons poor Mary.\n<b> \n</b>\tLoud laughter from the audience. But this response is overwhelmed by \n\tthe response of ANOTHER, LARGER AUDIENCE.\n<b> \n</b><b>162\tINT. MONSTER RALLY - NIGHT \n</b>\n\tMalcolm is talking before an all-black audience. It is the largest \n\trally yet; the hall is packed to the rafters.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWe have built temples in Boston, in Detroit, in \n\t\tAtlanta, Philadelphia, Washington -- 100 \n\t\ttemples in fifty states. From a handful we \n\t\thave grown to scores of thousands.\n<b> \n</b><b>\tVARIOUS SHOTS OF THE RALLY \n</b>\n\tHAWKERS selling _The Messenger_, faces of Fruit of Islam near the \n\tpodium; Lorraine, Sidney, Earl, Benjamin, and Bembry. For the first \n\ttime a new note is seen in Bembry's face: reserve bordering on \n\tresentment. When others around him cheer Malcolm, Bembry is cool. \n\tSidney notices this from his father, but makes no comment.\n\n<b>\t\t\t\tMALCOLM/HIS VOICE \n</b>\t\tThe Honorable Elijah Muhammad teaches us that \n\t\tGod is now about to establish a kingdom on this \n\t\tearth based on brotherhood and \n\n<b>\t\t[...]\n</b>\n\t\tagainst peace, his history on this earth has \n\t\tproved that. Nowhere in history has he been \n\t\tbrotherly toward anyone. The only time he has \n\t\tbeen brotherly toward you is when he can use \n\t\tyou, when he can exploit you, when he can \n\t\toppress you, when you will submit to him. And \n\t\tsince his own history makes him unqualified to \n\t\tbe an inhabitant or a citizen in a kingdom of \n\t\tbrotherhood, the Honorable Elijah Muhammad \n\t\tteaches us that God is about to eliminate that \n\t\tparticular race from this earth. So since they \n\t\tare due for elimination, we don't want to be \n\t\twith them.\n<b> \n</b><b>\tANGLE - CROWD\n</b><b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tIf the so-called Negro were American citizens \n\t\twe wouldn't have a race problem. If the \n\t\tEmancipation Proclamation was authentic, you \n\t\twouldn't have a race problem. If the 13th, \n\t\t14th, and 15th amendments to the Constitution \n\t\twas authentic, you wouldn't have a race \n\t\tproblem. If the Supreme Court desegregation \n\t\tdecision was authentic, you wouldn't have a \n\t\trace problem. All of this is hypocrisy. These \n\t\tNegro leaders have been telling the white man \n\t\teverything is all right, everything is under \n\t\tcontrol. And they've been telling the white man \n\t\tthat Mr. Muhammad is wrong, don't listen to \n\t\thim. But everything Mr. Muhammad has been \n\t\tsaying is going to come to pass is now coming \n\t\tto pass and now the Negro leaders are standing \n\t\tup saying that we are about to have a racial \n\t\texplosion. We're going to have a racial \n\t\texplosion and that's more dangerous than an \n\t\tatomic explosion.\n<b> \n</b><b>\tANGLE - MALCOLM\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tIt's going to explode because black people are \n\t\tdissatisfied. They're dissatisfied now not only \n\t\twith the white man, but with these Negroes who \n\t\thave been sitting around here posing as leaders \n\t\tand spokesmen for black people. Anytime you put \n\t\ttoo many sparks around a powder keg, the thing \n\t\tis going to explode and if the thing that \n\t\texplodes is still inside the house, then the \n\t\thouse will be destroyed. So the Honorable \n\t\tElijah Muhammad is telling the white man get \n\t\tthis powder keg out of your house, let the \n\t\tblack people in this country separate from him \n\t\twhile there's still time. And if the black man \n\t\tis allowed to separate and go on onto some land \n\t\tof his own, where he can solve his problems, \n\t\tthen there won't be any explosion. COMPLETE \n<b>\t\tSEPARATION IS THE ONLY SOLUTION TO THE BLACK \n</b><b>\t\tAND WHITE PROBLEM IN THIS COUNTRY!!!\n</b>\n<b>\tANGLE - CROWD\n</b><b> \n</b>\tA wave of cheers as people explode.\n<b> \n</b><b>163\t INT. AN ANTEROOM OF THE RALLY - NIGHT\n</b><b> \n</b>\tThe rally is over. A small room packed with PEOPLE congratulating \n\tMalcolm, trying to touch him. He is the hero of the hour. Sidney, Earl, \n\tand Benjamin with him, enjoying the accolades and trying to help \n\tMalcolm make his way out. Bembry stands apart, removed and silent.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThank you, Brother; Sister, how are you?\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tPlease make way, please--\n<b> \n</b>\tANGLE. A WELL-KNOWN PERSONALITY (DICK GREGORY) is at the door. He and \n\tMalcolm know each other well. Malcolm extends a palm, but Gregory \n\tdoesn't slap it.\n<b> \n</b><b>\t\t\t\tGREGORY \n</b>\t\tCan I ask you something?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSure, man.\n<b> \n</b><b>\t\t\t\tGREGORY \n</b>\t\tAre you Elijah's pimp?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat?\n<b> \n</b><b>\t\t\t\tGREGORY \n</b>\t\t\t(scornfully) \n\t\t\"His greatest greatness.\"\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSay what you're saying.\n<b> \n</b><b>\t\t\t\tGREGORY \n</b>\t\tIf you don't know, man, then I feel sorriest \n\t\tfor you.\n<b> \n</b><b>164 \tINT. MALCOLM'S HOME - NIGHT\n</b><b> \n</b>\tBetty, pregnant with child, is in a chair -- a newspaper in her lap. \n\tMalcolm is in the other room, putting his last daughter to sleep. We \n\thear him...\n<b> \n</b><b>\tANGLE - BEDROOM\n</b><b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tOkay, last hug.\n<b> \n</b>\tAs he enters, a smile on his face, but the concern of the evening \n\tclearly imprinted. He sits down heavily. Betty watches him carefully.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLong day. Long night. Long year. Long ten years.\n<b> \n</b>\tHe smiles. She doesn't.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tWhy are you looking at me like that?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tBecause you're in trouble.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHow do you know?\n<b> \n</b>\tShe smiles.\n\n<b>\t\t\t\tBETTY\n</b>\t\tDear heart, because I know you.\n<b> \n</b>\tA pause.\n\n<b>\t\t\t\tMALCOLM \n</b>\t\tI don't want to bring my troubles home. You \n\t\tknow that.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tI'm not made of glass.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI just want to sit here and be still.\n\n<b>\t\t\t\tBETTY\n</b>\t\tWe've never had a fight. Not a real one. But \n\t\twe're going to have one right now if you don't\n\t\ttalk about it.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tTalk about what?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tThe talk is everywhere!\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThere's always talk, always been talk, and \n\t\talways will be talk. Don't they say how I'm \n\t\ttrying to take over the Nation, how I'm getting \n\t\trich off the Nation?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tWe'll get to that, too, but this isn't just \n\t\ttalk any more.\n<b> \n</b>\tShe picks up the newspaper and reads from it:\n<b> \n</b>\t\t\t\tBETTY (contd) \n\t\t\"Los Angeles, UPI: Elijah Muhammad, 67-year-old \n\t\tleader of the Black Muslim Movement, today \n\t\tfaced paternity suits from two former \n\t\tsecretaries who charged he fathered their four \n\t\tchildren...\"\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThere are always slanders, always lies. You're \n\t\treading the devil's lies. Can't you see they're \n\t\ttrying to bring us down, bring down the \n\t\tMessenger.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\t\"Both women, in their 20's, charged they had \n\t\thad intimacies with Elijah Muhammad since \n<b>\t\t1957...\"\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI was going to talk to Bembry about it tonight.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tTo Bembry? Is Bembry your friend?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWoman, have you lost your mind? What's the \n\t\tmatter with you?\n<b> \n</b>\tBetty gets up, goes to him gently.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tNo, what's the matter with you? Wake up! Are \n\t\tyou so dedicated that you have blinded \n\t\tyourself? Are you so committed you cannot face \n\t\tthe truth? Bembry is the editor of the \n\t\tnewspaper you established. Ask him why your \n\t\tname hasn't been in \"Muhammad Speaks\" in over a \n\t\tyear? Ask him why you rate front page in every \n\t\tpaper in the country, but not a single sentence \n\t\tin your own.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t\t(rationalizing) \n\t\tI'm not interested in personal publicity. Our \n\t\tpeople know what I'm doing.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tDo you know what Bembry is doing? You're so \n\t\tblind, everyone can see this but you!!!\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBembry saved my Life. The Honorable Elijah \n\t\tMuhammad saved my life.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tA long time ago. You've repaid them many times \n\t\tover. Ask them why they have new cars and \n\t\thouses full of new furniture.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIs that what this is about? Material wealth?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat do we have, Malcolm. A broken-down jalopy \n\t\tand the clothes on our backs. We don't even own \n\t\tour own home. What about our children? What \n\t\tabout me? You don't even own life insurance.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThe Nation will provide for you and the \n\t\tchildren if anything happens to me.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tWill they? Are you sure? Are you sure or are \n\t\tyou blind?\n<b> \n</b>\tShe touches him very gently.\n<b> \n</b>\t\t\t\tBETTY (contd)\n\t\tDear heart, you have to help me. I'm raising \n\t\tour kids practically by myself, while you're \n\t\trunning all over the world. You don't know how \n\t\tmany times the girls ask me when is daddy \n\t\tcoming home?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat do you want me to do? Our people need me.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tWe need you too!\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat do you want me to do?\n<b> \n</b><b>\t\t\t\tBETTY \n</b>\t\tOpen your eyes, you can face death 24 hours a \n\t\tday; but the possibility of betrayal never \n\t\tenters your mind. If you won't do that for \n\t\tyourself do it for us.\n<b> \n</b><b>164A\tDETECTIVE MONTAGE \n</b>\n\tMalcolm knocks on the door of Evelyn Williams, one of the two \n\tsecretaries/wives. She opens the door and has child in her arms.\n<b> \n</b><b>\tANGLE - APARTMENT\n</b><b> \n</b><b>\t\t\t\tSISTER EVELYN \n</b>\t\tHer name is Eva Marie, she's 2 years old. \n\t\tBrother Minister, I did nothing wrong. I did \n\t\tnothing to be put in isolation. I believed in \n\t\thim. I believed in the Honorable Elijah \n\t\tMuhammad.\n<b> \n</b><b>\tCLOSE - MALCOLM \n</b>\n\tHe cannot believe what he is hearing, but he must. The truth is before \n\this eyes.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSister Evelyn, believe in Allah.\n<b> \n</b><b>\t\t\t\t\t\t\t\tCUT TO:\n</b><b> \n</b><b>164B \tINT. SISTER LUCILLE'S ROSARY APT. - DAY\n</b><b> \n</b><b>\tANGLE - MALCOLM\n</b><b> \n</b>\tMalcolm is sitting holding both of the children. Sister Lucille who is \n\tpregnant with 3rd child waddles across the room to sit down on the sofa \n\twith him. She picks up one of the kids from him.\n<b> \n</b><b>\tANGLE - SISTER LUCILLE\n</b><b> \n</b><b>\t\t\t\tSISTER LUCILLE\n</b>\t\tThis is Saudi, she's 3 and you have Lisha, \n\t\tshe's 2. Brother Minister the Honorable Elijah \n\t\tMuhammad is the father of my 3 children.\n<b>  \n</b>\tShe touches her pregnant stomach.\n<b> \n</b>\t\t\t\tSISTER LUCILLE (contd) \n\t\tBrother Minister he often talked about you. He \n\t\tloves you, loves you like his own son. Says you \n\t\tare the best, his greatest Minister but that \n\t\tsomeday you would leave him and turn against \n\t\thim.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHe told you that?\n<b> \n</b><b>\t\t\t\tSISTER LUCILLE\n</b>\t\tYes sir.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAre you sure?\n<b> \n</b><b>\t\t\t\tSISTER LUCILLE\n</b>\t\tYes, I am, Brother Minister. All I want is \n\t\tsupport for my children. He should provide for \n\t\this children. That's all I want.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAllah will provide.\n<b> \n</b><b>165 \tINT. BEMBRY'S HOUSE - NIGHT \n</b>\n<b>\tCLOSE SHOT - MALCOLM \n</b>\n\tHe has said everything on his mind and waits for Bembry's answer.\n<b> \n</b><b>\tPAN TO BEMBRY\n</b><b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tWhat are you talking about -- \"blackout\"? Some \n\t\tof the Brothers are a little jealous. Maybe \n\t\tthey think you been a little -- overpublicized. \n\t\tThat's all. Forget it. It's nothing.\n<b> \n</b>\tMalcolm is listening closely. Bembry puts an arm around him, man-to-man.\n<b> \n</b>\t\t\t\tBEMBRY (contd) \n\t\tNow about our coming up in the world a little. \n\t\tYou're not naive. You're a man of the world. \n\t\tThe Movement's grown; we've grown with it. You \n\t\tknow folks. They want their leaders to be \n\t\tprosperous. One hand washes the other.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t\t(quoting Bembry back to himself) \n\t\t\"I'm telling you God's words, not to hustle.\"\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tYou want a new car? You want a new house? Is \n\t\tthat it? It's the money, right?\n<b> \n</b>\tMalcolm has to control his rage.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWe tell the world we're moral leaders because \n\t\twe follow the personal example of the Honorable \n\t\tElijah Muhammad. It's hard to make a rooster \n\t\tstop crowing once the sun has risen. The sun is \n\t\tup.\n<b> \n</b>\tWe hear rifle shots.\n\n<b>\tDRUM CADENCE (IT WILL BE THROUGHOUT ENTIRE SCENE)\n</b>\n<b>166\tOMIT\n</b><b>167\tOMIT\n</b><b> \n</b><b>168 \tOMIT\n</b><b> \n</b><b>168A\tINT. MANHATTAN CENTER - DAY\n</b><b> \n</b>\tMalcolm, a last-minute replacement for the ailing Honorable Elijah \n\tMuhammad, speaks before a HUGE CROWD.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAnd what do I say of this so-called national \n\t\tmourning! I say... the white man's acts are \n\t\tcondemned, not only by our beliefs but by his \n\t\town.\n<b> \n</b><b>168B  SHOT - AMERICAN FLAGS AT HALF-MAST\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBoth his Bible and the Holy Koran say: \"As you \n\t\tsow, so shall you reap.\" Both say: \"Sow the \n\t\twind, reap the whirl wind.\"\n<b> \n</b><b>\tSHOT - AMERICAN FLAGS AT HALF-MAST\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tIn the soil of America the white man planted \n\t\tthe seeds of hate. He allowed the weeds that \n\t\tsprang up to choke the life out of thousands \n\t\tof black men.\n<b> \n</b><b>168C SHOT - THE KENNEDY FUNERAL CORTEGE\n</b><b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tNow they have strangled one of the gardeners. \n\t\tThis is the justice of Allah. Wa-Salaam Alaikum.\n<b> \n</b><b>168D \tSHOT - AUDIENCE\n</b><b> \n</b><b>\t\t\t\tAUDIENCE \n</b>\t\tAlaikum Wa-Salaam.\n<b> \n</b><b>168E\tSHOT - THE LONE, RIDERLESS HORSE\n</b><b> \n</b><b>169 \tINT. MALCOLM WITH REPORTERS - DAY\n</b><b> \n</b><b>\t\t\t\tREPORTER \n</b>\t\tMinister X! Don't you have even a little bit of \n\t\tremorse... saddened by President Kennedy's \n\t\tassassination?\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAssassination might be too good a word, and \n\t\tmight I add an Arabic word at that. This was a \n\t\tprime example of the devil's chickens coming \n\t\thome to roost. Being an old farm boy myself, \n\t\tchickens coming home to roost never did make \n\t\tme sad. It always made me glad.\n<b> \n</b><b>169A\tINT. ELIJAH'S OFFICE - DAY\n</b>\n\tOn his desk is the black headlines: MALCOLM X CALLS ASSASSINATION \n\t\"CHICKENS COMING HOME TO ROOST.\" Elijah's health is getting worse, his \n\tcoughing is frequent.\n<b> \n</b><b>\t\t\t\tELIJAH\n</b>\t\tDid you see the papers today?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYes, sir, I did.\n<b> \n</b><b>\t\t\t\tELIJAH \n</b>\t\tThat was a very bad statement. The country \n\t\tloved this man, and you have made it hard in \n\t\tgeneral for Muslims.\n<b> \n</b><b>\tCLOSE - MALCOLM \n</b>\n\tHe knows what is coming. \n\n<b>\tCLOSE - ELIJAH\n</b><b> \n</b>\t\t\t\tELIJAH (contd) \n\t\tWe must dissociate ourselves from your terrible \n\t\tblunder. I'll have to silence you for the next \n\t\tninety days. You are not allowed to make any \n\t\tstatements to the press nor are you to speak at \n\t\tany temples.\n<b> \n</b><b>\tCLOSER - MALCOLM\n</b><b> \n</b>\tHe looks at Elijah, his leader, his friend, his father and speaks with \n\ttotal sincerity.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI agree with you, sir. I submit 100 percent.\n<b> \n</b><b>\tANGLE - ROOM \n</b>\n\tMalcolm turns around and leaves the room. \n\n<b>\tANGLE - DOOR \n</b>\n\tAs the door is being closed, WE SEE Bembry kneeling before Elijah and \n\tkissing his hand. The door closes, the SCREEN IS BLACK. \n\n<b>\tFADE IN: \n</b>\n<b>170\tOMIT\n</b><b> \n</b><b>171\tOMIT\n</b><b> \n</b><b>172\tINT. MALCOLM'S HOUSE - NIGHT \n</b>\n\tSidney is playing on the floor with the kids. Betty scoops them up.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tC'mon girls, it's bedtime.\n\n\tThe phone rings. Malcolm answers it. From his expression we know it is \n\ta threat call. He hangs up. Betty leaves with the kids.\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tAnother one? \n\n<b>\t\t\t\tMALCOLM \n</b>\t\tHow long has this been going on?\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tAll day since you and Betty left. Brother \n\t\tMinister, I have to level with you. They gave \n\t\tme a mission. But I couldn't do it. I love \n\t\ty'all.\n\n<b>\t\t\t\tMALCOLM \n</b>\t\tWhat mission?\n\n<b>\t\t\t\tSIDNEY \n</b>\t\tTo wire your car so it would explode when you \n\t\tturned the ignition. The Ministers say you are \n\t\tspreading untruths about the Messenger. The \n\t\tMinisters say you are a great hypocrite, Judas, \n\t\tBenedict Arnold. The Ministers say your tongue \n\t\tshould be cut out and delivered to the \n\t\tMessenger's doorstep.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat does Sidney say?\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tI'm with you, Brother Minister.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNo. You'll be marked for death.\n<b> \n</b><b>\t\t\t\tSIDNEY \n</b>\t\tLet me die then.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI won't let myself come between you and your \n\t\tfather. Go home.\n<b> \n</b><b>\t\t\t\tSIDNEY\n</b>\t\tYou're my father.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAnd don't come back.\n<b> \n</b>\tSidney reluctantly leaves, walks out the door, past Betty. She looks at \n\thim, then Malcolm.\n<b> \n</b><b>173 \tINT. HOTEL THERESA - DAY\n</b><b> \n</b>\tMalcolm -- backed by Brothers Earl and Benjamin 2X -- faces a roomful \n\tof SUPPORTERS and REPORTERS.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBecause 1964 threatens to be a very explosive \n\t\tyear on the racial front, and because I myself \n\t\tintend to be very active in every phase of the \n\t\tAmerican Negro struggle for HUMAN RIGHTS, I \n\t\thave called this press conference, this \n\t\tmorning in order to clarify my own position in \n\t\tthe struggle -- especially in regards to \n\t\tpolitics and nonviolence. In the past I thought \n\t\tthe thoughts, spoke the words of the Honorable \n\t\tElijah Muhammad, that day is over. From now on \n\t\tI speak my own words, and think my own thoughts. \n\t\tInternal differences within the Nation of Islam \n\t\tforced me out of it. I did not leave of my own \n\t\tfree will. But now that it has happened, I \n\t\tintend to make the most of it. Now that I have \n\t\tmore independence of action, I intend to use a \n\t\tmore flexible approach toward working with \n\t\tothers to get a solution to this problem. I do \n\t\tnot pretend to be a divine man, but I do \n\t\tbelieve in divine guidance, divine power, and \n\t\tin the fulfillment of divine prophecy. I am not \n\t\teducated, nor am I an expert in any particular \n\t\tfield, but I am sincere, and my sincerity is my \n\t\tcredentials. I'm not out to fight other Negro \n\t\tleaders or organizations. We must find a common \n\t\tsolution, to a common problem. I am going to \n\t\torganize and head a new mosque in New York \n\t\tCity, known as the Muslim Mosque, Inc. This \n\t\tgives us a religious base, and the spiritual \n\t\tforce necessary to rid our people of the vices \n\t\tthat destroy the moral fiber of our community. \n\t\tOur political philosophy will be black \n\t\tnationalism. Our economic and social philosophy \n\t\twill be black nationalism. The Muslim Mosque, \n\t\tInc. will remain wide open for ideas and \n\t\tfinancial aid from all quarters. Whites can \n\t\thelp us, but they can't join us. There can be \n\t\tno black-white unity until there is first some \n\t\tblack unity.\n\n\tA host of questions fired all at once: How many of Elijah's followers\n\twill join you? etc, etc, etc.\n<b> \n</b>\tMalcolm calms them:\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tThere is one further preparation I need. It is \n\t\ta return to the source of our great religion. I \n\t\twill make a pilgrimage to Mecca.\n<b> \n</b><b>174 \tEXT. JFK AIRPORT - DAY\n</b><b> \n</b>\tMalcolm, at the window, as his plane takes off. He is watching Betty \n\tand the children on the Visitors' Ramp. He sees her become a tiny \n\tfigure, waving a vivid bandana.\n<b> \n</b><b>175\tEXT. VISITORS RAMP - DAY\n</b><b> \n</b>\tThe plane is out of sight. Betty gathers up her children. As they leave \n\tshe is subtly surrounded by the protecting BAND OF SUPPORTERS, led by \n\tEarl and Benjamin 2X.\n<b> \n</b><b>175A\tMECCA - THE PILGRIMAGE\n</b><b> \n</b><b>\tMALCOLM GREETED AS HE DESCENDS FROM THE PLANE IN EGYPT\n</b><b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tMy darling Betty. Everywhere I go I am welcomed \n\t\tas the representative of our people.\n<b> \n</b><b>175B \tSHOT OF CIA AGENT\n</b><b> \n</b>\tHe watches as Malcolm walks between the two pyramids.\n<b> \n</b>\t\t\t\tMALCOLM'S VOICE (contd) \n\t\tOur fight is known and respected worldwide. \n\t\tIncidentally, there's a little white man who \n\t\tfollows me wherever I go.\n<b> \n</b><b>175C \tSHOT OF MALCOLM\n</b><b> \n</b>\tOn a camel as he rides toward the Sphinx.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tI wonder who he's working for? If I was a \n\t\tbetting man, I'd say CIA. What's your guess?\n<b> \n</b><b>175D \tGROUPS OF BURNOOSED SUPPORTERS ON THE STREETS OF JEDDA, SAUDI ARABIA.\n</b><b> \n</b><b>\t\t\t\tBETTY'S VOICE \n</b>\t\tI arrived in Jedda, Saudi Arabia. I have never \n\t\twitnessed such sincere...\n<b> \n</b><b>176 \tINT. AUDUBON BALLROOM - NIGHT\n</b><b> \n</b>\tBetty is reading Malcolm's letter to a LARGE AUDIENCE.\n<b> \n</b>\t\t\t\tBETTY (contd) \n\t\t...hospitality and true brotherhood as \n\t\tpracticed here in the ancient home of Abraham, \n\t\tMohammad and the great prophets of the \n\t\tScriptures...\"\n<b> \n</b><b>177 \tINT/EXT. MECCA - DAY/NIGHT\n</b><b> \n</b>\t--Malcolm, wearing the garb of a pilgrim, walks with a VAST THRONG OF \n\tOTHERS, similarly clad, around the Great Temple. He wears two white \n\ttowels, one over his loins, the other over his neck and shoulder, \n\tleaving the right arm and shoulder bare. He wears simple sandals. The \n\tother pilgrims are of various colors: from white, to yellow, to darkest \n\tblack.\n<b> \n</b>177A \t--Malcolm and OTHER PILGRIMS kneeling together on a praying rug.\n<b> \n</b>177B\t--Malcolm and SEVERAL WHITE PILGRIMS eating Muslim-style; breaking a \n\tchicken and shaking it.\n<b> \n</b>177C\t--Malcolm and OTHERS walking around the Great Kaaba, a black stone set \n\tin the middle of the Great Mosque. He falls to his knees. WE SEE what \n\the describes:\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tToday, with thousands of others, I proclaimed \n\t\tGod's greatness in the Holy City of Mecca. \n\t\tWearing the Ihram garb I made my seven circuits \n\t\taround the Kaaba; I drank from the well of Zem \n\t\tZem; I prayed to Allah from Mt. Ararat where \n\t\tthe Ark landed. It was the only time in my life \n\t\tthat I stood before the Creator of all and felt \n\t\tlike a complete human being.\n<b> \n</b><b>178 \tINT. ELIJAH'S HOME - NIGHT\n</b><b> \n</b>\tElijah and a GROUP OF BLACK MUSLIM LEADERS. Bembry among them, it looks \n\tlike he is the number two man now that Malcolm has been jettisoned. The \n\tMessenger lies in bed, he is having a coughing fit, this is the worst \n\tcondition he's been in. A DOCTOR orders everyone out the room.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tYou may be shocked by these words, but I have \n\t\teaten from the same plate, drunk from the same \n\t\tglass and prayed to the same God with fellow \n\t\tMuslims whose eyes were blue, whose hair was \n\t\tblond and whose skin was the whitest of whites. \n\t\tAnd we are brothers, truly; people of all \n\t\tcolors and races believing in One God and one \n\t\thumanity. Once before, in prison, the truth \n\t\tcame and blinded me. It has happened again...\n<b> \n</b><b>179 \tINT. MALCOLM'S HOME - NIGHT\n</b><b> \n</b>\tBetty is with Brothers Earl, Benjamin 2X, and the children. There are \n\tnow four including another BABY - GAMILAH\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tIn the past, I have permitted myself to be used \n\t\tto make sweeping indictments of all white \n\t\tpeople, and these generalizations have caused \n\t\tinjuries to some white folks who did not \n\t\tdeserve them. Because of the spiritual rebirth \n\t\twhich I was blessed to undergo as a result of \n\t\tmy pilgrimage to the Holy City of Mecca, I no \n\t\tlonger subscribe to sweeping indictments of \n\t\tone race. I intend to be careful not to \n\t\tsentence anyone who has not been proven guilty. \n\t\tI'm not a racist and do not subscribe to any of \n\t\tthe tenets of racism. In all honesty and \n\t\tsincerity it can be stated that I wish nothing \n\t\tbut freedom, justice and equality: life, \n\t\tliberty, and the pursuit of happiness for all \n\t\tpeople.\n<b> \n</b>179A \tSHOT. Malcolm is bent over in prayer, lone figure in a huge mosque.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE\n</b>\t\tMy first concern, of course, is with the group \n\t\tto which I belong, the Afro-Americans, for we, \n\t\tmore than any other, are deprived of these \n\t\tinalienable rights.\n<b> \n</b>179B \tSHOT. Malcolm on a plane headed home.\n<b> \n</b><b>\t\t\t\tMALCOLM'S VOICE \n</b>\t\tI believe the true practice of Islam can remove \n\t\tthe cancer of racism from the hearts and souls \n\t\tof white Americans.\n<b> \n</b><b>180 \tEXT. JFK AIRPORT - DAY\n</b><b> \n</b>\tA TIGHT TWO-SHOT of Malcolm and Betty in an embrace. She breaks from \n\thim and whispers: \"Go ahead. I can wait now.\"\n<b> \n</b><b>181  INT. JFK AIRPORT - DAY\n</b><b> \n</b>\tA large PRESS CONFERENCE: mikes of every network, every newspaper and \n\twire service present. Malcolm sports a beard.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet's begin.\n<b> \n</b><b>\t\t\t\tREPORTER #1 \n</b>\t\tMalcolm, you said on your trip abroad you \n\t\tsensed a feeling of great brotherhood.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAs I recall, I pointed out that while I was in \n\t\tMecca making the pilgrimage, I spoke about the \n\t\tbrotherhood that existed at all levels among \n\t\tall people, all colors who had accepted the \n\t\treligion of Islam. I pointed out that what it \n\t\thad done, Islam, for those people despite their \n\t\tcomplexion differences, that it would probably \n\t\tdo America well to study the religion of Islam \n\t\tand perhaps it could drive some of the racism \n\t\tfrom this society. Muslims look upon themselves \n\t\tas human beings, as part of the human family \n\t\tand therefore look upon all other segments of \n\t\tthe human family as part of that same family. \n\t\tToday my friends are black, brown, red, yellow \n\t\tand white.\n<b> \n</b><b>\t\t\t\tREPORTER #8 \n</b>\t\tMalcolm, are you prepared to go to the United \n\t\tNations at this point and ask that charges be \n\t\tbrought against the United States for its \n\t\ttreatment of the American Negroes?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tOh yes.\n\n\tThe AUDIENCE applauds.\n<b> \n</b>\t\t\t\tMALCOLM (contd) \n\t\tThe audience will have to be quiet. Yes, as I \n\t\tpointed out that during my trip that nations, \n\t\tAfrican nations, Asian, Latin nations look very \n\t\thypocritical when they stand up in the UN \n\t\tcondemning South Africa and saying nothing \n\t\tabout the racist practices that are manifested \n\t\teveryday against Negroes in this society. I \n\t\twould be not a man if I didn't do so. I \n\t\twouldn't be a man.\n<b> \n</b><b>\t\t\t\tREPORTER #3 \n</b>\t\tAre you prepared to work with some of the \n\t\tleaders of some of the other civil rights\n\t\t organizations?\n<b> \n</b><b>\t\t\t\tMALCOLM\n</b>\t\tCertainly, we will work with any groups, \n\t\torganizations or leaders in any way, as long as \n\t\tit's genuinely designed to get results.\n<b> \n</b><b>\t\t\t\tREPORTER #1 \n</b>\t\tDoes the new beard have any religious \n\t\tsignificance?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNo, not particularly. But I do think that you \n\t\twill And black people in America, as they \n\t\tstrive to throw off the shackles of mental \n\t\tcolonialism, will also probably reflect an \n\t\teffort to throw off the shackles of cultural \n\t\tcolonialism. And then they'll begin to reflect \n\t\tdesires of their own with standards of their \n\t\town.\n<b> \n</b><b>                   \tREPORTER #2 \n</b>\t\tOne of your more controversial remarks was a \n\t\tcall for black people to get rifles and form \n\t\trifle clubs sometime back. Do you still favor \n\t\tthat for self-defense?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI don't see why that should be controversial. I \n\t\tthink that if white people found themselves \n\t\tvictim of the same kind of brutality that black \n\t\tpeople in this country face, and they saw that \n\t\tthe government was either unwilling or unable \n\t\tto protect them, that the intelligence on the \n\t\tpart of the whites would make them get some \n\t\trifles and protect themselves.\n<b> \n</b><b>\t\t\t\tREPORTER #2\n</b>\t\tWhat about the guns, Malcolm?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHas the white man changed since I went away? \n\t\tHave you put up your guns? The day you stop \n\t\tbeing violent against my people will be the \n\t\tday I tell folks to put away their guns.\n<b> \n</b><b>\t\t\t\tREPORTER #3 \n</b>\t\tThen you're still an extremist?\n<b> \n</b><b>\tANGLE - MUSLIM MALE\n</b><b> \n</b><b>\t\t\t\tBENJAMIN THOMAS \n</b>\t\tGit your hand out of my pocket!\n\n\tEveryone turns around to the back to see what the commotion is about. \n\tThe man who yelled out leaves quickly, we will see him later on, very \n\tsoon.\n<b> \n</b><b>182\tINT. MALCOLM'S HOUSE - NIGHT \n</b>\n\tMalcolm looks out the living room window, he has a rifle in hand. \n\t(NOTE: This is the same pose as the famous photograph of him.) He \n\tdoesn't see anyone and closes the curtain. The phone rings.\n<b> \n</b><b>\tCLOSE - PHONE \n</b>\n\tMalcolm picks up the receiver.\n<b> \n</b><b>\t\t\t\tVOICE\n</b>\t\tYou're one dead nigger.\n<b> \n</b><b>\tANGLE - BEDROOM \n</b>\n\tBetty has picked up also and she's listening.\n<b> \n</b><b>\t\t\t\tVOICE\n</b>\t\tYou're days on this earth are numbered, brother.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b>\n<b> \tCLICK!\n</b>\n \tHe hangs up.\n<b> \n</b><b>\tANGLE - BEDROOM\n</b><b> \n</b>\tMalcolm enters the room and gets into the bed with Betty, he puts his \n\tear down on his wife's pregnant stomach.\n\n\tShe kisses him.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tGet some sleep.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou have to sleep for three.\n<b> \n</b>\tMalcolm pulls Betty closer to him.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm sorry. I haven't been the best husband or \n\t\tfather.\n<b> \n</b><b>\t\t\t\tBETTY \n</b>\t\tShhh!\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tFamilies shouldn't be separated. I'll never \n\t\tmake another long trip without you and the kids. \n\t\tWe'll all be together.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tDear heart, I love you.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWe had the best organization that black people \n\t\tever had and niggers ruined it.\n<b> \n</b><b>183  \tEXT. THE HOUSE - NIGHT\n</b><b> \n</b>\tIt is a cold winter night. A Molotov cocktail is lit and hurled through \n\tthe front picture glass window.\n<b> \n</b><b>184 \tINT. THE HOUSE - NIGHT\n</b><b> \n</b>\tOne of the children screams.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>185 \tINT. MALCOLM'S BEDROOM - NIGHT\n</b><b> \n</b>\tMalcolm grabs his pistol and quickly throws a coat over Betty. She is \n\thalf-asleep, frightened, trembling and disoriented.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWalk out the back, dear. Hurry.\n<b> \n</b>\tBetty goes. Malcolm runs back for the children.\n<b> \n</b>\tANGLE. He reassuringly leads the four children, in their pajamas, \n\tthrough the smoke-filled house.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThere's nothing to be afraid of. It might be a \n\t\tlittle cold. Hang on. We'll be fine.\n<b> \n</b><b>185A \tINSERT - FLASHBACK\n</b><b> \n</b>\tWE CUT BACK TO Earl Little getting his family out of the burning house \n\tin Lansing, Michigan. It should be the same exact scene we saw before \n\tearlier in the film.\n<b> \n</b><b>\t\t\t\tEARL \n</b>\t\tEverybody out. OUT! OUT! Get the kids.\n<b> \n</b><b>\tCUT BACK TO PRESENT\n</b><b> \n</b><b>186 \tEXT. THE HOUSE - NIGHT\n</b><b> \n</b>\tNeighbors' lights have gone on. There are shouts: \"What is it?\" \"Fire!\"\n \t\"Bring those children in here.\"\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tCall the Fire Department.\n<b> \n</b><b>186A\tOMIT\n</b>\n<b>187\tEXT. THE HOUSE - NIGHT (LATER)\n</b><b> \n</b>\tA hose is playing on the fire. Police cars have arrived. There are TWO \n\tREPORTERS with the COPS. Malcolm faces them furiously.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAnd the fire hit the window and it woke up my \n\t\tsecond oldest baby, but the fire burned on the \n\t\toutside of the house. It could have fallen on \n\t\tsix-, four-, or two-year-old girls. And I'm \n\t\tgoing to tell you, if it had done it, I'd've \n\t\ttaken my rifle and gone after anybody in sight.\n<b> \n</b><b>\t\t\t\tREPORTER \n</b>\t\tAre the Muslims behind this?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIt was bombed by the Black Muslim movement upon \n\t\tthe orders of Elijah Muhammad.\n<b> \n</b><b>\t\t\t\tSECOND REPORTER\n</b>\t\tDo you know what Muslim headquarters is saying?\n<b> \n</b><b>\t\t\t\tMALCOLM\n</b>\t\t\t(with total contempt) \n\t\tI can imagine. I did it myself. For the \n\t\tpublicity.\n<b> \n</b><b>187A \tEXT. TEMPLE #1 - DETROIT - DAY\n</b><b> \n</b>\tBembry is being interviewed by a reporter.\n<b> \n</b><b>\t\t\t\tBEMBRY \n</b>\t\tWe feel this is a publicity stunt on the part \n\t\tof Malcolm X. We hope this isn't a case of \"if \n\t\the can't keep the house, we won't get it \n\t\teither.\"\n<b> \n</b><b>187B \tEXT. MALCOLM'S STREET - NIGHT\n</b><b> \n</b>\tA car comes roaring down the street with rifles sticking out the \n\twindows, and pulls right up in front of Malcolm's house. \n\n<b>\tANGLE - HOUSE \n</b>\n\tBrothers Earl and Benjamin 2X run out of the car up to Malcolm.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tWe called your house, operator said you had \n\t\trequested that your phone be turned off.\n<b> \n</b><b>\t\t\t\tBENJAMIN 2X \n</b>\t\tGive us the command, Malcolm.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI don't care about myself, my wife and four \n\t\tchildren were sleeping in their beds, they \n\t\thave nothing to do with this.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tLet's get out of this cold.\n<b> \n</b>\tBrothers Earl and Benjamin take off their coats and put it over Malcolm \n\tand lead him to a police car.\n<b> \n</b><b>187C \tINT. BASEMENT - DAY\n</b><b> \n</b>\tFIVE BLACK MEN sit around a table. They do not speak. They are Thomas \n\tHayer, Ben Thomas, Leon Davis, William X and Wilbur Kinley. All are \n\tMuslims, all are the ASSASSINS. \n\n<b>\tCLOSE - 12-GAUGE SAWED-OFF SHOTGUN ON TABLE \n</b>\n<b>\tCLOSE - 9MM GERMAN LUGER ON TABLE \n</b>\n<b>\tCLOSE - .45 AUTOMATIC\n</b>\n<b>\tANGLE - THOMAS HAYER\n</b><b> \n</b>\tHe puts a roll of exposed 35mm film into a sock. \n\n<b>\tANGLE - TABLE\n</b><b> \n</b><b>\t\t\t\tASSASSINS\n</b>\t\tAllah Akbar.\n<b> \n</b><b>187D \tEXT. NY HILTON - DAY - ESTABLISHING SHOT \n</b>\n<b>187E \tINT. NY HILTON \n</b>\n<b>\tANGLE - LOBBY\n</b><b> \n</b> \tMalcolm is checking in when he is approached by a young WHITE COED.\n<b> \n</b><b>\t\t\t\tCOED\n</b>\t\tMr. X. I have a good heart. I'm a good person \n\t\tdespite my whiteness. What can the good white \n\t\tpeople like myself who are not prejudiced do to \n\t\thelp the cause of the Negro?\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tHe looks at her. He thinks. He speaks.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet sincere white individuals find other white \n\t\tpeople who feel as they do and teach \n\t\tnon-violence to those whites who think and act \n\t\tso racist.\n<b> \n</b><b>\tCLOSE - COED\n</b>\n<b> \t\t\t\tCOED\n</b> \t\tI will, Mr. X, I will.\n\n<b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tLet's all pray without ceasing. May Allah bless \n\t\tyou.\n<b> \n</b><b>187F \tINT. HOTEL ROOM - NIGHT\n</b><b> \n</b>\tMalcolm lies on his bed, and for the first time WE SEE the strain in \n\this face, it has begun to take its toll, he's a haunted man. A doomed \n\tman.\n<b> \n</b><b>\tANGLE - MALCOLM \n</b>\n\tMalcolm dials the phone.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBrother Earl.\n\n<b>187G\tINT. HOTEL THERESA - NIGHT\n</b><b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tMalcolm, where are you? We've been calling all \n\t\tover the city.\n<b> \n</b>\tINTERCUT between Malcolm and Brother Earl.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI'm gonna try and get some work done tonight.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tLet some of us come down there.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tNo, that won't be necessary. I'll be all right.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tI wish you'd listen to us. What about the \n\t\tmeeting tomorrow? We need to frisk people.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI don't want folks to be searched, it makes \n\t\tpeople uncomfortable. If I can't be safe among \n\t\tmy own kind, where can I be? Allah will protect \n\t\tme.\n<b> \n</b>\tThere is silence on the other end.\n<b> \n</b><b>\tCLOSE - BROTHER EARL\n</b><b> \n</b><b>187K \tINT. AUDUBON BALLROOM - NIGHT\n</b><b> \n</b>\tThe five assassins are casing ballroom. They check the different \n\tentrances, the exits, the bathrooms, staircases while the jam packed \n\tcrowd continues to dance the night away.\n<b> \n</b><b>188 \tINT. A FRIEND'S HOUSE - NIGHT\n</b><b> \n</b>\tBetty is putting her four daughters to sleep when the phone rings. She \n\tpicks it up.\n<b> \n</b><b>\t\t\t\tVOICE\n</b>\t\tThat red nigger of yours is dead and so are \n\t\tyour bastard children.\n<b> \n</b><b>\tCLICK.\n</b><b>  \n</b>\tBetty hangs up the phone and it rings again.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tStop calling us. Leave us alone. Leave us alone. \n\t\tI'll kill you. I'll kill you.\n<b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBetty it's me. It's me.\n<b> \n</b>\tINTERCUT between between Malcolm and Betty.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tMalcolm, they keep calling, threatening us. \n\t\tI'm going crazy, when is this going to stop?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tDon't answer the phone. It's all right. It's \n\t\tall right. Nothing is gonna happen to anybody.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tDear heart, where are you?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tAt the Hilton. The girls asleep?\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tI just put them to bed. Can we come to the \n\t\tmeeting tomorrow?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tI don't think that's such a good idea.\n<b> \n</b><b>189\tEXT. ROAD\n</b>\n\tA blue 1968 Cadillac passes a sign that says Patterson, New Jersey.\n\n<b>\tANGLE - CAR \n</b>\n\tThe assassins are on their way to the Audubon Ballroom, Wilbur Kinley \n\tis behind the wheel, no one is talking. \n\n<b>190 \tEXT.STREET - DAY \n</b>\n\tBetty is driving to the Audubon Ballroom, her four daughters are in the \n\tbackseat making a racket. \n\n<b>190A \tEXT. STREET - DAY\n</b><b> \n</b>\tMalcolm drives to the Audubon Ballroom.\n<b> \n</b><b>191  \tINT. AUDUBON BALLROOM - DAY\n</b><b> \n</b>\tBrothers Earl and Benjamin 2X along with some others are putting the \n\tfolding chairs in place for the coming meeting. The audience has not \n\tstarted to come in yet.\n<b> \n</b><b>192 \tEXT. GEORGE WASHINGTON BRIDGE - DAY\n</b>\n\tThe assassins are driving over the George Washington Bridge.\n<b> \n</b><b>\tANGLE - CAR\n</b>\n<b>\t\t\t\tKINLEY \n</b>\t\tBrothers, the time is fast approaching, it's \n\t\tthe hour of the knife.\n<b> \n</b><b>193 \tEXT. STREET - DAY \n</b>\n<b>\tCLOSE - BETTY \n</b>\n\tBetty is trying to quiet down her daughters as she drives. \n\n<b>194 \tEXT. STREET - DAY\n</b><b> \n</b><b>\tCLOSE - MALCOLM\n</b><b> \n</b>\tMalcolm is in deep thought as he drives.\n<b> \n</b><b>194A \tINT. AUDUBON BALLROOM - DAY\n</b><b> \n</b>\tBetty and her four kids walk into the ballroom and move down the center \n\taisle. One of the girls drops her black doll and a young man picks it \n\tup. The young man is Thomas Hayer, he gives it back to her.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tSay thank you.\n<b> \n</b><b>\t\t\t\tGAMILAH \n</b>\t\tThank you.\n<b> \n</b><b>\t\t\t\tTHOMAS \n</b>\t\tYou are welcome.\n<b> \n</b>\tANGLE. The rest of the assassins come in and go to their positions \n\talong with the rest of the crowd, the place is starting to fill up.\n<b> \n</b><b>195 \tINT. BACKSTAGE - DAY\n</b><b> \n</b><b>\t\t\t\tBROTHER BENJAMIN 2X \n</b>\t\tNo sign of the minister yet.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tHe'll be here like clockwork.\n<b> \n</b><b>196 \tEXT. STREET - DAY\n</b><b> \n</b>\tMalcolm drives past the Audubon Ballroom, people are going in but no \n\tcops are present.\n<b> \n</b><b>\tANGLE - CAR\n</b>\n\tMalcolm drives by. \n\n<b>\tANGLE - STREET \n</b>\n\tMalcolm parks his car, it's four blocks away. He turns off the ignition \n\tand sits there. \n\n<b>\tCLOSE - MALCOLM \n</b>\n\tIt's as if he's frozen in his car. \n\n<b>\tANGLE - STREET\n</b>\n\tMalcolm finally gets out of the car, locks the door and walks a couple \n\tof steps, then stops. \n\n<b>\tCLOSE - MALCOLM \n</b>\n\tMalcolm has stopped in his tracks, like some unseen force has overcome \n\thim which prevents him from moving. Malcolm is paralyzed.\n\n<b>\tCLOSER - MALCOLM'S FACE \n</b>\n\tHis eyes are closed, and the street noise begins to build to a \n\tdeafening _roar_. Then all of a sudden it stops. \n\n<b>\tANGLE - OLD WOMAN\n</b><b> \n</b><b>\t\t\t\tOLD WOMAN \n</b>\t\tSon, you all right?\n<b> \n</b>\tMalcolm opens his eyes, she has brought him out of it. He looks at her \n\tbut doesn't answer.\n<b> \n</b>\t\t\t\tOLD WOMAN (contd) \n\t\tAre you okay?\n<b> \n</b>\tMalcolm looks at this old woman, who slightly resembles his own mother.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMa'am, I'm fine.\n<b> \n</b><b>\t\t\t\tOLD WOMAN \n</b>\t\tGood. We need you. I recognize you, don't pay \n\t\tthem folks no never mind, you keep on doing \n\t\twhat you doing.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMay Allah bless you.\n<b> \n</b><b>\t\t\t\tOLD WOMAN \n</b>\t\tI'll pray for you too, son. Jesus will protect \n\t\tyou.\n<b> \n</b>\tShe walks away, carrying her two shopping bags full of groceries.\n<b> \n</b><b>197 \tINT. BACKSTAGE - DAY\n</b><b> \n</b> \tMalcolm walks in. Present are Brothers Earl, Benjamin 2X and a \n\tsecretary SISTER ROBIN.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIs the program ready?\n<b> \n</b><b>\t\t\t\tBENJAMIN 2X \n</b>\t\tNo, Brother Minister.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b> \t\tWhy not? You've had ample time, you and the \n\t\tsister.\n<b> \n</b><b>\t\t\t\tSISTER ROBIN \n</b>\t\tI apologize Brother Minister, we'll have it \n\t\tnext week.\n<b> \n</b>\tHe is pissed.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tFolks are sitting out there _today_, not next \n\t\tweek, expecting to hear our program.\n<b> \n</b><b>\t\t\t\tBENJAMIN 2X \n</b>\t\tNext week, Brother Minister.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHas the Reverend called? Is he going to show?\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tReverend Chickenwing called last night and said \n\t\the wouldn't be able to attend.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSo now we have no opening speaker? Why wasn't I \n\t\tinformed last night?\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tI called Sister Betty, she didn't tell you?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSince when do you start telling Sister Betty my \n\t\tbusiness? Since when? She has nothing to do \n\t\twith this. You tell me, not her, not anybody \n\t\telse.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tI assumed...\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tWhat did I tell you about assuming?\n<b> \n</b>\tMalcolm starts pacing the room, nobody has ever seen him like this \n\tbefore.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBenjamin, you better go out there and explain \n\t\twhy the program isn't ready today.\n<b> \n</b>\tBenjamin 2X gets up to leave.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tSister, please go with the brother.\n<b> \n</b>\tThey both exit.\n\n<b>\tCLOSE - MALCOLM AND EARL\n</b><b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tBrother Minister, what is wrong?\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tThe way I feel, I ought not to go out there \n\t\ttoday. In fact, I'm going to ease some of this \n\t\ttension by telling the black man not to fight \n\t\thimself -- that's all a part of the white man's \n\t\tbig maneuver, to keep us fighting amongst \n\t\tourselves, against each other. I'm not \n\t\tfighting anyone, that's not what we're here \n\t\tfor.\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tLet's cancel.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tIs my family here yet?\n<b> \n</b><b>\t\t\t\tBROTHER EARL \n</b>\t\tDown front as always.\n<b> \n</b><b>198 \tINT. ANTEROOM - DAY\n</b><b> \n</b>\tA lone COP in uniform stands in the shadows with a walkie-talkie.\n<b> \n</b><b>198A\tINT. BACKSTAGE - DAY\n</b>\n\tMalcolm is about to go on stage when he sees Sister Robin.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tYou'll have to forgive me for raising my voice \n\t\tto you.\n<b> \n</b><b>\t\t\t\tSISTER ROBIN \n</b>\t\tBrother Minister, I understand.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\t\t(to himself) \n\t\tI wonder if anybody understands.\n<b> \n</b><b>199 \tINT. AUDUBON BALLROOM - DAY\n</b><b> \n</b>\tThe place is filled. Betty and the girls sit in a boxed-off section \n\tnear the platform. Malcolm's bodyguards stand on and around the stand. \n\tBenjamin 2X is finishing up his speech when Malcolm walks onto the \n\tstage and sits down.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tMake it plain.\n<b> \n</b><b>\t\t\t\tBENJAMIN 2X \n</b>\t\tAnd now, without further remarks, I present to \n\t\tyou one who is willing to put himself on the \n\t\tline for you--\n<b> \n</b><b>\tCLOSE - BETTY AND THE KIDS\n</b>\n<b>\tCLOSE - THOMAS HAYER\n</b>\n<b>\tCLOSE - WILBUR KINLEY \n</b>\n<b>\tCLOSE - LEON DAVIS \n</b>\n<b>\tCLOSE - BEN THOMAS \n</b>\n<b>\tCLOSE - WILLIAM X \n</b>\n<b>\tCLOSE - MALCOLM X \n</b>\n<b>\tCLOSE - BENJAMIN 2X\n</b><b> \n</b>\t\t\t\tBENJAMIN 2X (contd) \n\t\t--a man who would give his life for you. I want \n\t\tyou to hear, to listen, to understand one who \n\t\tis a Trojan for the black man.\n<b> \n</b><b>\tANGLE - STAGE\n</b><b> \n</b>\tA roar greets Malcolm's intro. He shakes hands with Benjamin 2X, then \n\tsteps toward the podium.\n<b> \n</b><b> \tCLOSE - MALCOLM\n</b><b> \n</b>\tHe starts to rearrange his 3 x 5 index cards in his hands.\n<b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tBrothers and Sisters, Wa-Salaam Alaikum.\n<b> \n</b><b>\t\t\t\tAUDIENCE \n</b>\t\tAlaikum Wa-Salaam.\n<b> \n</b><b>\tSWIFT JERKY PAN OF CAMERA \n</b>\n\tThere is a commotion in the rear of the audience. \n\n<b>\t\t\t\tBENJAMIN THOMAS \n</b>\t\tGit your hand out of my pocket. \n\n\tThe bodyguards move toward the rear. \n\n<b>\tCLOSE - MALCOLM\n</b><b> \n</b><b>\t\t\t\tMALCOLM \n</b>\t\tHold it, brothers. Don't get excited. Let's \n\t\tcool it--\n<b> \n</b><b>\tANGLE - WILLIAM X\n</b><b> \n</b>\tHe stands up from the fourth row with 12-gauge sawed-off shotgun \n\tblasting.\n\n<b>\tCLOSE - MALCOLM \n</b>\n\tThrows up his hands, grabs his chest and is knocked backward. \n\n<b>\tSHOTS - PURE PANDEMONIUM \n</b>\n\tPeople hit the floor, knock over chairs, stampede for the exits. \n\n<b>\tANGLE - BACK OF AUDITORIUM \n</b>\n\tWilbur Kinley ignites a smoke bomb. \n\n<b>\tANGLE - FIRST RUN \n</b>\n\tThomas Hayer and Leon Davis stand up, run toward the stage, and empty \n\ttheir .45's and Luger into the fallen body of Malcolm. \n\n<b>\tANGLE - BETTY \n</b>\n\tShe is on the floor covering her children. \n\n<b>\tANGLE - AISLE \n</b>\n\tHayer and Davis charge up the aisle toward the rear exit, shooting at \n\tthe crowd.\n\n<b>\tANGLE - BODYGUARD\n</b>\n\tHe stands in Hayer's way, Hayer fires, he turns, the bullet misses and \n\tthe bodyguard gets off a shot which hits Hayer in the leg.\n<b> \n</b><b>\tANGLE - HAYER\n</b><b> \n</b>\tHe stumbles momentarily, then limps on.\n<b> \n</b><b>\tANGLE - STAIRCASE\n</b><b> \n</b>\tHayer is running down the staircase when he is tripped, and goes flying \n\tthrough the air to the bottom of the landing. The crowd starts to beat \n\tthe shit out of him, kicking him in the head, etc., they're about to \n\ttear him apart from limb to limb when a PATROLMAN enters with gun drawn.\n\tHe shoots gun into air and the crowd backs off and he takes custody of \n\tHayer.\n<b> \n</b><b>\tANGLE - STAGE\n</b><b> \n</b>\tOne of Malcolm's bodyguards, BROTHER GENE, is over him, giving him \n\tmouth-to-mouth resuscitation. Brother Gene stops, Betty moves in and \n\thugs her dying husband.\n<b> \n</b><b>\t\t\t\tBETTY\n</b>\t\tSomebody call an ambulance. Somebody call an \n\t\tambulance.\n<b> \n</b><b>\tANGLE - ENTRANCE\n</b><b> \n</b>\tTHIRTY COPS walk in like it's a spring Sunday stroll in Central Park.\n\n<b>\tCLOSE - MALCOLM \n</b>\n\tHis eyes are glazed over.\n<b> \n</b><b>\t\t\t\tBETTY'S VOICE \n</b>\t\tThey killed him. They killed him. \n\n<b>200\tSHOT - BROTHERS EARL AND BENJAMIN 2X SITTING ON STAGE \n</b>\n<b>200A\tSHOT - MALCOLM IS RUSHED ON A STRETCHER TO HOSPITAL NEXT DOOR\n</b>\n<b>\tSHOT - HOSPITAL SPOKESPERSON \n</b>\n<b>\t\t\t\tHOSPITAL SPOKESPERSON \n</b>\t\tThe person you know as Malcolm is no more.\n<b> \n</b><b>200B \tTHE STUNNED FACES OF BLACK PEOPLE OUTSIDE THE AUDUBON BALLROOM...\n</b><b> \n</b><b>\t--AND IN HARLEM.\n</b><b> \n</b>\tOSSIE DAVIS speaking behind the above:\n<b> \n</b><b>\t\t\t\tOSSIE DAVIS'S VOICE \n</b>\t\tHere at this final hour, in this quiet place, \n\t\tHarlem has come to bid farewell to one of its \n\t\tbrightest hopes, extinguished now and gone from \n\t\tus forever.\n<b> \n</b>200C \tDOLLY SHOT of the long line of people outside the funeral parlor, \n\twaiting to see Malcolm's body, where it lies before burial.\n<b> \n</b>\t\t\t\tOSSIE DAVIS'S VOICE: (contd) \n\t\tFor Harlem is where he worked, and where he \n\t\tstruggled and fought. His home of homes, where \n\t\this heart was and where his people are. And it \n\t\tis therefore most fitting that we meet once \n\t\tagain in Harlem to share these last moments \n\t\twith him. For Harlem has ever been gracious to \n\t\tthose who loved her, have fought for her and \n\t\tdefended her honor even to death. It is not in \n\t\tthe memory of man that this beleaguered, \n\t\tunfortunate but nonetheless proud community has \n\t\tfound a braver, more gallant young champion \n\t\tthan this Afro-American who lies before us \n\t\tunconquered still. Many will ask what Harlem \n\t\tfinds to honor in this stormy, controversial \n\t\tand bold young captain and we will smile and we \n\t\twill answer and say unto them:\n<b> \n</b><b>2OOD  SHOTS - FACES OF HARLEM - PRESENT DAY - THE 90'S\n</b><b> \n</b>\tOrdinary PEOPLE in ordinary pursuits of life, BLACK PEOPLE still \n\tstruggling to stay afloat in a racist WHITE AMERICA that does not have \n\ttheir best interests at hand -- 8 years of Reagan and now at least 4 \n\tyears of Bush.\n<b> \n</b>\t\t\t\tOSSIE DAVIS'S VOICE (contd) \n\t\tDid you ever talk to Brother Malcolm? Did you \n\t\thave him smile at you? Did you ever listen to \n\t\thim? Did he ever really do a mean thing? Was he \n\t\tever associated with violence or any public \n\t\tdisturbance?\n<b> \n</b><b>200E\tSHOT - STREET SIGN - MALCOLM X BOULEVARD - HARLEM\n</b><b> \n</b><b>200F\tSHOT - YOUNG AFRO-CENTRIC TEENAGERS WITH MALCOLM X T-SHIRTS, HATS, \n</b><b>\tJACKETS, JEWELRY, ETC.\n</b><b> \n</b>\t\t\t\tOSSIE DAVIS'S VOICE (contd) \n\t\tFor if you did, you would know him and if you \n\t\tknew him, you would know why we must honor him.\n<b> \n</b><b>200G\tSHOT - NEWSREEL FOOTAGE OF THE _REAL_ MALCOLM X\n</b><b> \n</b>\t\t\t\tOSSIE DAVIS'S VOICE (contd) \n\t\tMalcolm was our manhood, our living black \n\t\tmanhood. That was his meaning to his people and \n\t\tin honoring him we honor the best in ourselves.\n<b> \n</b><b>200H\tFREEZE FRAME - A CLOSE-UP OF THE REAL MALCOLM X SMILING RIGHT AT US.\n</b>\n<b>\t\t\t\t\t\t\t\tCUT TO:\n</b><b> \n</b><b>200I \tSHOT - INT. CLASSROOM BULLETIN BOARD \n</b>\n\tA picture collage of Malcolm X. It reads P.S. 153 -- Harlem honors \n\tMalcolm on his birthdate May 19, 1935.\n<b> \n</b>\t\t\t\tOSSIE DAVIS'S VOICE (contd) \n\t\tAnd we will know him then for what he was and \n\t\tis. A PRINCE, A BLACK SHINING PRINCE who didn't \n\t\thesitate to die because he loved us so.\n<b> \n</b><b>\tANGLE - CLASSROOM \n</b>\n\tIt's a fourth-grade class. \n\n<b>\tCLOSE - STUDENT\n</b><b> \n</b><b>\t\t\t\t1ST STUDENT \n</b>\t\tI'm Malcolm X.\n\n<b>\tCLOSE - STUDENT\n</b>\n<b>\t\t\t\t2ND STUDENT \n</b>\t\tI'm Malcolm X.\n\n<b>\tCLOSE - STUDENT\n</b><b> \n</b><b>\t\t\t\t3RD STUDENT \n</b>\t\tI'm Malcolm X.\n\n<b>\tCLOSE - STUDENT\n</b><b> \n</b><b>\t\t\t\t4TH FEMALE STUDENT \n</b>\t\tI'm Malcolm X.\n<b> \n</b><b>201 \tINT. CLASSROOM - SOWETO, SOUTH AFRICA - DAY\n</b><b> \n</b><b>\tCLOSE - STUDENT\n</b><b> \n</b><b>\t\t\t\t1ST STUDENT \n</b>\t\tI'm Malcolm X.\n<b> \n</b><b>\tCLOSE - STUDENT\n</b><b> \n</b><b>\t\t\t\t2ND STUDENT \n</b>\t\tI'm Malcolm X.\n<b> \n</b><b>\tCLOSE - STUDENT\n</b>\n<b>\t\t\t\t3RD STUDENT \n</b>\t\tI'm Malcolm X.\n<b> \n</b><b>\tCLOSE - STUDENT\n</b>\n<b>\t\t\t\t4TH FEMALE STUDENT \n</b>\t\tI'm Malcolm X.\n<b> \n</b>\tCAMERA PANS slowly to head of class where the teacher stands, it's \n<b>\tNELSON MANDELA.\n</b><b> \n</b><b>\tCLOSE - MANDELA\n</b><b> \n</b><b>\t\t\t\tMANDELA \n</b>\t\tAs Brother Malcolm said, \"We declare our right \n\t\ton this earth to be a man, to be a human being, \n\t\tto be respected as a human being, in this \n\t\tsociety, on this earth, in this day, which we \n\t\tintend to bring into existence by any means \n\t\tnecessary.\"\n\n<script language=\"JavaScript\">\n<!--Ad Banner\nfunction popupPage() {\n var windowopts = \"location=no,scrollbars=no,menubars=no,toolbars=no,resizable=yes,left= 50,top=50,width=490,height=130\";\n\n popup21978 = open('/prohost/banner.html',\"MenuPopup\",windowopts);\n popup21978.focus();\n<b>}\n</b>\npopupPage();\n\n//  Ad Banner-->\n</script>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Malcolm X</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Spike Lee\" title=\"Scripts by Spike Lee\">Spike Lee</a>  <a href=\"/writer.php?w=Arnold Perl\" title=\"Scripts by Arnold Perl\">Arnold Perl</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Malcolm X Script.html#comments\" title=\"Malcolm X comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:10:53.238362"}