{"title": "Man in the Iron Mask", "film_link": "/Movie Scripts/Man in the Iron Mask Script.html", "script_link": "/scripts/Man-in-the-Iron-Mask.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Man in the Iron Mask Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Man in the Iron Mask Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Randall Wallace\" title=\"Scripts by Randall Wallace\">Randall Wallace</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> : September 1995<br/>\n<br/>\n<a href=\"/scripts/Man-in-the-Iron-Mask.html\">Read \"Man in the Iron Mask\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>The Man in the Iron Mask - 9/18/95 First Draft by Randall Wallace</title>\n\n<pre>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<b>                   THE MAN IN THE IRON MASK\n</b>\n                              by\n\n                        Randall Wallace\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<b>                                           FIRST DRAFT\n</b>\n                                           September 18, 1995\n\n\n\n\n\n<b>FADE IN:\n</b>\nFrom the BLACKNESS before the first images, we hear a young\nwoman's tortured SCREAM, muffled by her own will.  We see her\nmouth, open in agony; her face, beaded with sweat.  Her name\nis ANNE, and she is Queen of France.  She lies in\n\n<b>A ROYAL BEDCHAMBER\n</b>\nThe royal DOCTOR kneels at the foot of her bed; her own royal\nmother grips her hands...\n\nOn the opposite side of the huge bedchamber, and separated\nfrom the queen's bed by an artistically painted screen, are\nroyal ADVISORS sweating and anxious for any word to take to\ntheir king.  They wince as the Queen moans again in the pain\nof childbirth.\n\nHer fingers claw out for help, but her Doctor ignores her\nneed to be touched and comforted; he is concerned only for\nthe baby.  Only her PRIEST, FATHER BELLES, sits at her head,\nstroking her hair gently and rapidly whispering prayers.\n\n<b>                     DOCTOR\n</b>          The head is born!  One arm... the\n          other arm... it is a boy!\n\nThe advisors, disregarding the Queen's privacy, scurry around\nthe screen to see the doctor lift the beautiful baby, wet\nwith birth.  The mother -- the Queen -- is still in agony,\nyet she struggles to lift her head.\n\n<b>                     ADVISOR 1\n</b>          I shall tell the king!\n\n<b>                     ADVISOR 2\n</b>          I shall tell him!\n\nThey hurry for the door.  But their race to be first to bring\nthis great news to the King is interrupted as the Queen emits\nanother cry; it surprises the doctor.\n\n<b>                     DOCTOR\n</b>          M'lady...?\n\nHe kneels again to examine the Queen.\n\n<b>                     DOCTOR\n</b>          Another...?  It is another!\n\nThe joy vanishes from the faces of the advisors.  They look\ngravely at each other, as they hear a second BABY'S CRY.\n\n<b>                                                SMASH TO:\n</b>\n<b>A DARK COURTYARD - NIGHT\n</b>\nA door groans open in a hidden corner of the palace courtyard\nand into the darkness steps a dashing figure.  His face is\nhidden in shadow, but we know from the silhouette of his\ncloak and plumed hat that he is a MUSKETEER.\n\nHe carries an OBLONG BASKET.\n\nA carriage is just rattling onto the flagstones of the\ncourtyard.  The Musketeer steps into its interior, with a\nsharp word to the driver --\n\n<b>                     MUSKETEER\n</b>          Away.\n\nThe whip CRACKS and the carriage plunges into the night.\n\n<b>                                           TIME DISSOLVE:\n</b>\n<b>EXT.  ESTABLISHING THE ISLAND FORTRESS PRISON - DAY\n</b>\nOn a gash of rock thrusting upward from the sea along the\nsouthern coast of France stands an island fortress, a prison,\nlike an Alcatraz of the Mediterranean.  Just off a coastline\nrenowned for its beauty, the fortress is horrible and\nforeboding.  As we SUPERIMPOSE:\n\n<b>                            1662\n</b><b>                   TWENTY-TWO YEARS LATER\n</b>\n<b>INT.  THE FORTRESS PRISON\n</b>\nWith the camera as our moving POV, we survey the prison.  It\nis a horrible place:  dungeons where prisoners lie in their\nown filth; corners where jailers rut with unresisting captive\nwomen; long twisting corridors lined with cells, from which\nprisoners whimper, or moan in madness.  Up a long winding\nstaircase our POV moves; we push through the barred window of\na cell... It is somewhat cleaner than the rest of the places\nwe've seen, but still a prison.  We PAN the cell.\n\nAnd we see a man.  A MAN IN AN IRON MASK.  It is terrifying,\nto think of anyone imprisoned in this way.  We push in on his\neyes... They are blue, childlike.\n\nA greasy jailer -- the prisoner's KEEPER -- puts his face to\nthe barred window of the door, and speaks with bored cruelty.\n\n<b>                     KEEPER\n</b>          You dead yet?\n\n<b>                     MAN IN THE IRON MASK\n</b>          No, Keeper.\n\n<b>                                             DISSOLVE TO:\n</b>\n<b>EXT.  ESTABLISHING PARIS - DAY\n</b>\n<b>SUPERIMPOSE:\n</b>\n<b>                           PARIS\n</b>\n<b>EXT.  PARIS STREET - NIGHT\n</b>\nThrough the narrow streets of the old city gallops a dashing\nfigure, his cloak flying behind him and catching the\nmoonlight, his horse's hooves clattering along the\ncobblestones as he dodges the beggars living in the filthy\nshadows.  He is a magnetic sight, riding the horse as easily\nas if they were racing across an open field and not through a\ncluttered street, and guiding the stallion as if its grace\nand power came not from the animal but from the rider.\nSitting lightly in the saddle is\n\n<b>D'ARTAGNAN\n</b>\nfamous Musketeer, Captain of the King's Royal Bodyguard.  He\nis still handsome at mid-life, still erect, unambiguous in\nhis courage and his loyalty.\n\nHe rides past a knot of angry beggars, moving through the\nstreets breaking windows and scavenging for food.  When they\nsee d'Artagnan, some throw rocks at him.  They sail by\nd'Artagnan's head; he ducks them with the fluid grace of a\nboxer dodging punches, and keeps on riding.\n\n<b>OUTSIDE THE CATHEDRAL\n</b>\nD'Artagnan rides into the courtyard of a grand old residence\nbeside Notre Dame Cathedral.  Priests are dispensing food to\nbeggars gathered in the courtyard.  As d'Artagnan reins his\nhorse to a stop the wretched people stare with contempt at\nthe royal symbols on his uniform.  But d'Artagnan is not a\nman anyone would be quick to confront; as he dismounts and\nmoves toward the doorways the people part for him.\n\nHe pauses as he sees, parked to one side of the old\nresidence, a big rickety carriage.  D'Artagnan smiles.\n\n<b>                     D'ARTAGNAN\n</b>          Porthos too!\n\nD'Artagnan hears drunken feminine giggles echoing down the\nstaircase of the tower above him.\n\n<b>INT.  PRIESTS' RESIDENCE - A STAIRWAY - DAY\n</b>\nFour people are moving up a winding stairway; three are\nwomen, bosoms spilling from their gaudy dresses; the fourth\nis PORTHOS, the former Musketeer, now a nobleman of great\nwealth and even greater girth.  He and the women are drinking\nwine as they stagger up the stairs, the women towing Porthos\nlike rowboats tugging a ship to dock.  Porthos is not so\ndrunk that his hands fail to find pleasant places to grip\ntheir bodies as they walk and giggle.\n\n<b>                     PORTHOS\n</b>          Ah ha!  Here we are!  Aramis!\n          Porthos is here!\n\nThey reach a doorway.  Porthos kicks it open, staggers back,\nand begins shoving the women inside.\n\n<b>INT.  A PRIEST'S APARTMENT - DAY\n</b>\nThe first of the partying women tumbles inside; she stops\nshort at what she sees.  The second and third stumble in\nafter her and they too stop dead still, sobered by what they\nsee.  Then with a great roar Porthos barrels in.\n\n<b>                     PORTHOS\n</b>          Aaaaaaaramis!!  Porthos is --\n\nHe stops dead in his tracks.  From the POV OF PORTHOS AND THE\nWOMEN, we see ARAMIS.  Always the most theological of the\nMusketeers, and ruthlessly brilliant, he is still lean and\npowerful.  And still handsome, or at least he would be; but\nnow he kneels before a single candle at a private altar,\nwearing sackcloth and ashes in penitent prayer.\n\n<b>                     PORTHOS\n</b>          Sorry, my dears.  You would have\n          enjoyed it too.  He's hung like a\n          donkey.\n\n<b>                     WENCH 1\n</b>          So are you.\n\n<b>                     PORTHOS\n</b>          Really?  I haven't been able to see\n          it for fifteen years.  Go on now,\n          leave His Holiness alone.  I'll\n          bring you back tomorrow when he's in\n          a better mood.\n\nHe whacks their bottoms, herding them out, then swaggers to\nAramis, heaving himself to a seat beside his praying friend.\n\n<b>                     PORTHOS\n</b>          Please revel with me, Aramis, I need\n          my spirits lifted.  I'm old, I'm\n          weak, my strength is gone --\n\n<b>                     ARAMIS\n</b>          Be quiet, you fat fool.  Can't you\n          see I'm praying?\n\n<b>                     PORTHOS\n</b>          I just said you're praying!  Are you\n          deaf too?  I know you're blind,\n          because if you had seen the tits\n          that just walked out of here, you'd\n          have tears in your eyes.\n\n<b>                     ARAMIS\n</b>               (trying to ignore him)\n          There are more important things than\n          tits.\n\n<b>                     PORTHOS\n</b>          Really?  If you can name me one\n          thing, one single thing, that is\n          more sublime than the feel of a\n          plump pink nipple between my lips,\n          I will buy you a new cathedral.\n\nAramis is still trying to pray, but rises to the bait.\n\n<b>                     ARAMIS\n</b>          Forgiveness.\n\n<b>                     PORTHOS\n</b>          Forgiveness?\n\nAs if in reply, Porthos lets rip an enormous rolling fart.\n\n<b>                     PORTHOS\n</b>               (beat)\n          Forgive me.\n\nAramis' fingers clamp down on the rosary beads, as he tries\nto keep praying.\n\n<b>                     PORTHOS\n</b>          Am I forgiven?\n\nAramis abruptly backhands his huge friend.  Porthos reels\nbackwards, landing in a chair.\n\n<b>                     PORTHOS\n</b>          I observe your forgiveness isn't\n          sweeter than a plump nipple.\n\n<b>                     ARAMIS\n</b>          Can't you see I'm praying,\n          goddammit?!\n\nPorthos raises a foot and kicks the bishop in the balls.\nAramis staggers back and grabs a chair to throw it; Porthos\npicks up the whole table -- just as d'Artagnan enters.\n\n<b>                     PORTHOS AND ARAMIS\n</b>          D'Artagnan.\n\nPorthos tosses the table aside and bear hugs d'Artagnan.\n\n<b>                     PORTHOS\n</b>          How are you, you skinny little pup!\n\nAramis sets the chair down in embarrassment.\n\n<b>                     ARAMIS\n</b>          A simple theological discussion.\n\n<b>                     D'ARTAGNAN\n</b>          Aramis -- the King wishes to see\n          you.\n\n<b>                     ARAMIS\n</b>          Still you serve him loyally --\n          though people hurl rotten eggs at\n          his royal emblem.\n\nAramis lifts d'Artagnan's cloak as evidence:  near its hem,\nsure enough, is the remnant of a broken egg.\n\n<b>                     D'ARTAGNAN\n</b>          I see your mind is sharp as ever.\n          The King said, \"Right away.\"  Cut\n          deep and hard, my friends.\n\n<b>                     PORTHOS\n</b>          Deep and hard, D'Artagnan.\n\nD'Artagnan clasps Porthos' hand, then that of Aramis, and\nleaves, as Porthos shakes his head.\n\n<b>                     PORTHOS\n</b>          We were all Musketeers once, eh?  Oh,\n          I forgot.  For the poor, the ones\n          you were praying for.\n\nHe hands a purse to Aramis.  Surprised, even touched, Aramis\nreaches for it.  Just as he takes the money, Porthos throws a\nhaymaker; but Aramis sees the sucker punch coming and ducks.\nSuddenly the two old warriors are circling again.\n\n<b>                     PORTHOS\n</b>          I wonder how Athos is doing.\n\n<b>INT.  A SMALL HOUSE - DAY\n</b>\nATHOS stands at the dressing table in a modest room; dressed\nin a dark plain coat, he too is a former Musketeer -- gray\nhaired and handsome, intensely intelligent, with a hard crust\nof manners masking seas of emotion.  He opens a small wooden\nbox and digs through medals of heroism; he finds what he's\nlooking for just as his son RAOUL enters.  RAOUL is in his\nmid-twenties; he wears the uniform of a soldier in the French\nArmy.  He is nervous, pacing, looking at every angle in the\nmirror.\n\n<b>                     RAOUL\n</b>          Do I look all right?\n\n<b>                     ATHOS\n</b>          None of the ladies will be able to\n          take their eyes off you.\n\n<b>                     RAOUL\n</b>          I care only about Michelle.  Should\n          I ask her when we first arrive?\n          Or... or when we're leaving?  I\n          could ask her in the carriage -- but\n          it is more romantic at the palace.\n          I get so confused...\n\n<b>                     ATHOS\n</b>          Perhaps this will help.\n\nHe hands Raoul the simple gold ring he took from the box.\n\n<b>                     RAOUL\n</b>          Mother's ring.  I can't take this.\n\n<b>                     ATHOS\n</b>          She died giving you to me.  And I\n          want to die knowing it is one the\n          finger of the women my son loves.\n\nThey embrace.  Athos' eyes mist, but he smiles.\n\n<b>                     ATHOS\n</b>          Now go, and bring back your fiance.\n\n<b>ESTABLISHING - THE ROYAL PALACE - DAY\n</b>\nThe Palace glows golden in the Parisian sunshine.  Carriages\ndeposit guests for the lavish party in the royal gardens.\n\n<b>EXT.  THE ROYAL PALACE - GARDENS - DAY\n</b>\nAttractive young adults strut about in the extravagant attire\nof Louis XIV's France, the men like peacocks, the ladies in\ngowns that seem to squeeze their entire bodies up into their\nbosoms.  They laugh and smile and strike courtly poses\npretending to talk with each other -- but all eyes are on the\ndoorway, through which the king is about to come...\n\n<b>JUST BEYOND THAT PALACE DOORWAY\n</b>\nKING LOUIS the Fourteenth is having his wardrobe adjusted by\na flock of tailors.  He is twenty-two, and would be quite\nhandsome, except for the total self-absorption.  He's\nchecking himself in a full length golden mirror as two of his\nadvisors, PIERRE and CLAUDE, try to speak with him.\n\n<b>                     PIERRE\n</b>          Your Majesty, I know it is a... a\n          festive time, but before --\n\n<b>                     KING LOUIS\n</b>          The blue sash.  No, the burgundy!\n\n<b>                     PIERRE\n</b>          ... before the party begins --\n\n<b>                     KING LOUIS\n</b>          The party has already begun -- so\n          why are you delaying me?\n\n<b>                     PIERRE\n</b>          We do not wish to delay you,\n          Majesty, but... as your advisors, we\n          feel it is our -- our --\n\n<b>                     CLAUDE\n</b>          ... our duty.\n\n<b>                     PIERRE\n</b>          Yes!  It is our duty to let you\n          know... there are riots in Paris.\n\n<b>                     LOUIS\n</b>          Riots?  My people live in the\n          world's most beautiful city, their\n          king has the grandest palaces on\n          earth.  Why should they feel\n          anything but pride and contentment?\n\n<b>                     PIERRE\n</b>          Well yes, of course, Majesty, and\n          I'm sure they are content... except\n          that... well, they are starving.\n\n<b>                     LOUIS\n</b>          Sometimes the poor do grow hungry.\n          But why would they riot about it?\n\nAs he says this, a replica of the Matterhorn made of fruits\nand meringues is carried past the window by a team of chefs.\n\n<b>                     PIERRE\n</b>          Majesty... We have more than enough\n          food set aside for your birthday\n          celebration next week.  If we\n          distributed some of that, we would\n          have time to gather more before --\n\n<b>                     LOUIS\n</b>          Aramis!  I have been expecting you!\n               (to the tailors)\n          We are satisfied, that will do.\n\nThe tailors and advisors withdraw as Aramis -- still in his\nsimple priest's robe -- strides forward and bows to the kind.\n\n<b>                     ARAMIS\n</b>          Your birthday celebration, your\n          Majesty?\n\n<b>                     LOUIS\n</b>          Next week.  This is a mere garden\n          party -- and I wish to join it, so I\n          will be brief.  I am experiencing\n          resistance from the Jesuits.\n\n<b>                     ARAMIS\n</b>          Well... perhaps you should speak\n          with them, your Majesty.\n\n<b>                     LOUIS\n</b>          I have demanded it -- and common\n          priests present themselves!  Can you\n          imagine the arrogance?  Common\n          Jesuit priests try to act as my\n          equals, and they refuse to reveal\n          the names of anyone else in their\n          order!  No one can keep secrets like\n          the Jesuits can, and the identity of\n          their leader is the darkest secret\n          they hold.  Even the Pope himself\n          does not know who leads the Jesuit\n          Order in France!  He suspects the\n          Governor General of Jesuits, whoever\n          he is, is angling to become Pope\n          himself.\n\n<b>                     ARAMIS\n</b>          How can I serve you in this?\n\n<b>                     LOUIS\n</b>          Perhaps you can find out who this\n          secret leader of the Jesuits is.\n          You are now a priest, but you were\n          once a Musketeer, serving the throne\n          of France, a throne ordained of God.\n          Can you accept this mission, and\n          keep it private?\n\n<b>                     ARAMIS\n</b>          If I find out the identity of this\n          Jesuit rebel.  I will kill both him\n          and the man who told me.\n\n<b>                     LOUIS\n</b>          Once a Musketeer, always a\n          Musketeer, eh?\n\nAramis bows and Louis turns back to his mirror.  There are\nmirrors everywhere in his palace, and he loves his\nreflection, adorned as he is all in golden cloth, like fabric\nfrom the sun.  Aramis leaves and the advisors return.\n\n<b>                     LOUIS\n</b>          Ah yes, the riots.  We have food\n          stocks on the wharves right now, no?\n\n<b>                     PIERRE\n</b>          That food has spoiled.  That is why\n          it was not shipped to the army.\n\n<b>                     LOUIS\n</b>          Exactly why it should be given away.\n\n<b>                     PIERRE\n</b>          What... an excellent idea, your\n          Majesty!\n\n<b>EXT.  PALACE GARDENS - DAY\n</b>\nAmong the guests are Raoul and MICHELLE, a stunningly\nbeautiful young woman.  Michelle is awed by the richness all\naround them, while Raoul sees only her.  He holds the ring.\n\n<b>                     MICHELLE\n</b>          Isn't it glorious!\n\n<b>                     RAOUL\n</b>          Michelle...\n\nBut just as he starts to speak, trumpets blast and the King\nsteps through the doors and out into the lavish gardens; the\nparty goers give him a rousing ovation.  Raoul returns the\nring to his jacket, to wait for another moment.\n\nEveryone watches the King, who begins guzzling wine and\ntelling jokes to his sycophants, who howl at the King's\nwitticisms.  Then Louis catches sight of Raoul and Michelle,\nand lowers his voice, to his FRIENDS...\n\n<b>                     LOUIS\n</b>          Who is that?\n\n<b>                     FRIEND 1\n</b>          Raoul, son of Athos.\n\n<b>                     LOUIS\n</b>          Not the soldier, you idiot!\n\n<b>                     FRIEND 2\n</b>          Her name is Michelle.\n\nThe king is transfixed.\n\n<b>D'ARTAGNAN\n</b>\nis presiding over a huddle of fresh faced young Musketeers,\ndirecting them to their positions around the gardens, like\nsecret service agents protecting a president.  He leaves\nthem, and quickly moves to the King.\n\n<b>                     D'ARTAGNAN\n</b>          Your Majesty...\n\n<b>                     LOUIS\n</b>          What is it, d'Artagnan?  Assassins\n          falling from the sky now?\n\nThe sycophants laugh loudly.\n\n<b>                     D'ARTAGNAN\n</b>          The plans for use of the maze were\n          not disclosed to me.\n\n<b>                     LOUIS\n</b>          I decided it this morning.\n\n<b>                     D'ARTAGNAN\n</b>          Then you must allow me to stay close\n          to you so that --\n\n<b>                     LOUIS\n</b>          I am King, d'Artagnan.  I will\n          change my mind as I wish, and I will\n          enjoy my banquet as I wish!\n\n<b>                     D'ARTAGNAN\n</b>          But I deployed the Royal Guards\n          according to your previous --\n\n<b>                     LOUIS\n</b>          Let us play a game, d'Artagnan, let\n          us pretend I am King and you are\n          Captain of my Musketeers.  Let us\n          behave as if my wish is law.  And my\n          wish is to enjoy this party!\n\nD'Artagnan bows sharply as the young sycophants chuckle.\nD'Artagnan retreats, then looks back to Louis and follows his\ngaze to the tender young beauty who caught his eye.\nD'Artagnan recognizes Raoul, son of his friend Athos.\n\n<b>RAOUL AND MICHELLE\n</b>\nAs the guests mix and mingle, Raoul tries again.\n\n<b>                     RAOUL\n</b>          Michelle, I... Ever since I returned\n          I've been wanting to speak with you\n          about... about --\n\nA gaunt SERVANT interrupts, presenting a tray of delicacies.\n\n<b>                     SERVANT\n</b>          Monsieur, Mademoiselle...?\n\n<b>                     RAOUL\n</b>          No!  Thank you -- Michelle, I --\n\nThey are interrupted by the SQUEAL of a piglet, squirming in\nthe hands of the king's dwarf, who holds the fat little\nanimal above his head and runs among the startled guests.\n\n<b>                     LOUIS\n</b>          It pleases us to announce an\n          entertainment for our guests!  A\n          contest of agility and cunning!\n\nHe takes the pig from his dwarf; the pig is clean and\nperfumed, a colorful fake horn tied onto its head.\n\n<b>                     LOUIS\n</b>          Behold our unicorn!  Whichever of\n          our guests captures the unicorn\n          shall win its treasure!\n\nWith this announcement the King produces a diamond the size\nof a pecan, suspended from a ribbon; the guests gasp at its\nrichness.  The King ties the diamond around the pig's neck.\n\n<b>RAOUL AND MICHELLE\n</b>\nMichelle is amazed at this.\n\n<b>                     MICHELLE\n</b>          I have never seen a diamond so\n          large!\n\nIt almost makes Raoul ashamed of the modest ring hidden in\nhis hand.\n\n<b>                     LOUIS\n</b>          Into the maze!  All of you!\n          Disperse, I command you!\n\nThe dwarf releases the pig, poking him through a tiny break\nin the hedge; the critter skitters as only a pig can, eluding\nthe first laughing lunges of the guests.\n\nTHE PIG CHASE is a merry melee, as the maze becomes a tangle\nof confusion.  LOUIS climbs to a platform above the top of\nthe ten foot hedge that forms the maze.  From his perch he\nlooks down on all the action, and calls encouragement.\n\n<b>                     LOUIS\n</b>          Are you men or mice?!\n\nMICHELLE squeals as the pig scurries by and Raoul dives for\nit.  He almost has the pig... then it kicks free.\n\n<b>                     RAOUL\n</b>          The pendant will be yours!\n\nWith that he races after the pig.\n\nMICHELLE tries to follow, this way, that way, through the\nmaze.  Then she stops, face to face with the King, entering\nthrough a gate hidden in one of the maze's dead corners.\n\n<b>                     LOUIS\n</b>          Michelle, isn't it?\n\nSpeechless, she nods.\n\n<b>                     LOUIS\n</b>          I would have said it was impossible,\n          but I believe the excitement of the\n          chase has made you even more\n          beautiful.\n\n<b>                     MICHELLE\n</b>          Sire, I --\n\n<b>                     LOUIS\n</b>          You blush!  You do not wish to be\n          beautiful to your King?\n\nHer eyes go still; she understands what is happening.\n\nFROM BEHIND THE GATE, we see d'Artagnan, watching as Louis\ntries to seduce the young woman.  Even as d'Artagnan watches,\nthe pig comes rooting through the hedge; with a deft movement\nd'Artagnan catches the animal's leg and lifts it with the\nsureness of the farm boy he once was.  The pig is quiet and\ncomfortable in d'Artagnan's hands.\n\nD'Artagnan watches as the King approaches Michelle, and she\nallows him to touch her cheek.  The king leans to kiss her...\nMichelle does not move...\n\nWHHEEEKKKK!  The pig sails over the gate and hits the ground\nrunning, right at Louis' feet; it sets him dancing.\n\nThe spell of the king's royal attention is shattered; as the\npig scrambles away, Michelle backs away.\n\n<b>                     LOUIS\n</b>          Wait!  Michelle, I --\n\nToo late, he sees the shadow of the man looming above him,\nleaping down onto him from the observation platform.  It is\nthe servant who offered the tray to Raoul and Michelle; he\nhas armed himself with a knife from the carving table, and is\ndiving now to plunge the blade into the king's throat.\n\nThe king is helpless, frozen.  The assassin leaps, falling\ntoward the king... and is impaled on the sword of d'Artagnan,\nspringing through the gate to save his king.\n\nMichelle screams, the king gasps, and the assassin drops,\nmortally wounded.  They stare down at him now; the would-be\nassassin gurgles words through his agony...\n\n<b>                     ASSASSIN\n</b>          Feed... your... people.\n\nParty guests, having heard Michelle scream, are running in to\nfind them.  Michelle rushes off, to find Raoul; several\npeople are coming up.\n\n<b>                     ASSASSIN\n</b>          Your people starve...!  Feed --\n\nThe king snatches out his own dagger and imperiously cuts the\nthroat of the dying man, to stop these offensive words.  The\nking looks at his stunned subjects.\n\n<b>                     LOUIS\n</b>          A pitiful madman, nothing more.\n          Come, let us continue our chase!\n          Where is our unicorn?\n\nThe King prances away.  It takes the guests a moment, but\nthey know that only gaiety will please their King, and off\nthey go again, laughing as if nothing happened.\n\nD'Artagnan stands still as the young Musketeers under his\ncommand come rushing up with swords drawn.\n\n<b>                     YOUNG MUSKETEER\n</b>          Captain!\n\nSeeing the dead assassin, their eyes fill with admiration.\n\n<b>                     YOUNG MUSKETEER\n</b>          You are the best --\n\nD'Artagnan can't even listen; with a last glance at the King\nhe turns quickly and walks away.\n\n<b>INT.  FORTRESS PRISON\n</b>\nThe Man in the Iron Mask sits on the floor.  A key rattles in\nthe lock and his keeper shuffles in, carrying food.\n\n<b>                     KEEPER\n</b>          Food, moron.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Thank you, Keeper.\n\nNot watching what he's doing, the bulbous keeper trips on\nsomething and stumbles, dropping the food.  The prisoner\njumps to his feet, concerned.\n\n<b>                     KEEPER\n</b>          Look what you've done!\n\nHe picks up the tray and slings it at the prisoner.\n\n<b>                     MAN IN THE IRON MASK\n</b>          I'm sorry, Keeper...\n\nThe keeper looks for what he tripped on -- a worn Bible.  He\nsnatches it up and grabs a hunk of pages from its middle.\n\n<b>                     MAN IN THE IRON MASK\n</b>          No, Keeper, it's my only book!\n\nHearing the pleading in the prisoner's voice, the keeper\nlooks squarely at him -- and rips out the pages.\n\n<b>                     MAN IN THE IRON MASK\n</b>          What number did you tear out?\n\n<b>                     KEEPER\n</b>          Eh?\n\n<b>                     MAN IN THE IRON MASK\n</b>          What number, on the first page?\n\n<b>                     KEEPER\n</b>          ... Two-thirty-seven.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Two-thirty-seven:  \"... And the\n          descendants of Japeth are these:\n          Obediah, Zebulon, Hezekiah...\"\n\nAs the prisoner rattles off the names of Biblical genealogy,\nthe jailer gawks at the pages in his hand.\n\n<b>                     KEEPER\n</b>          You've... memorized...?\n\n<b>                     MAN IN THE IRON MASK\n</b>          What was the end page?\n\nAs the keeper is speechless, the prisoner looks for himself.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Six-two-one:  \"... Though I speak\n          with the tongues of men and angels,\n          and have not love, I am but a\n          clanging cymbal or --\"\n\nThe Keeper staggers in shock; the prisoner bubbles with joy.\n\n<b>                     MAN IN THE IRON MASK\n</b>          We're playing, Keeper!  A game!\n          Take another page, any page!  Keeper\n          and I are playing a game!\n\nAnd the prisoner takes the keeper's fat hands in his own and\nbegins to dance and sing.\n\n<b>                     MAN IN THE IRON MASK\n</b>          A game, a game, we're playing a --\n\nThe keeper's left arm goes rigid, and he clutches his chest\nwith his right hand; he drops upon the stone floor.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Keeper...?\n\nThe prisoner approaches the jailer; the man is stoned dead.\n\n<b>                     MAN IN THE IRON MASK\n</b>          No... No!  Keeper, please, you\n          cannot die!  You're my only friend!\n\nThe prisoner tries to wipe his eyes, but he can't get at\nthem, inside the mask.  He edges to the open door.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Help!  Someone!  Keeper is dead!\n\nHe slumps down beside the open door, and weeps.\n\n<b>INT.  PALACE - D'ARTAGNAN'S ROOM - EVENING\n</b>\nD'Artagnan's room is spartan:  a cot, and weapons laid on a\nplain table.  It has a single small window, and d'Artagnan\nstands at it now, looking out into the Palace garden below.\n\nThe guests have all gone home; the party pavilions have been\ncleared away.  And now in the blue dusk, a solitary lady\nwalks.  She is Anne of Austria, the Queen Mother, the lady we\nsaw in the opening.\n\nNow, twenty years later, she is a slim frail figure.  Her\nclothes are drab and simple, like the dress of mourning; she\nwalks in silence, watched at a distance by nun attendants.\n\nShe glances up, and sees d'Artagnan's form in the window.\nWhen he sees her looking, he pulls away from the window.\n\n<b>INT.  PALACE CORRIDOR - EVENING\n</b>\nD'Artagnan's room is along the same corridor as the Royal\nApartments.  D'Artagnan sits at the small table, going over\npaperwork.  Through his open door he sees that Anne and her\nattendants are filing along in the corridor, and he rivets\nhis eyes back to his work.\n\n<b>IN THE CORRIDOR\n</b>\nAnne reaches the door to her apartment, and looks back to\nwhere d'Artagnan's door is open.\n\n<b>INT.  D'ARTAGNAN'S ROOM\n</b>\nThe Queen Mother's ATTENDANT appears at d'Artagnan's door.\n\n<b>                     ATTENDANT\n</b>          She wishes a word with you.\n\n<b>INT.  THE CORRIDOR\n</b>\nD'Artagnan approaches the Queen Mother, and bows.\n\n<b>                     D'ARTAGNAN\n</b>          M'lady...?\n\n<b>                     ANNE\n</b>          I understand you saved my son's life\n          today.\n\n<b>                     D'ARTAGNAN\n</b>          God smiled upon us.\n\n<b>                     ANNE\n</b>          And you were not hurt?\n\n<b>                     D'ARTAGNAN\n</b>          No, M'lady.\n\n<b>                     ANNE\n</b>          That is good.\n\nWithout a change of expression on her still beautiful but sad\nface, she enters her room.\n\n<b>INT.  D'ARTAGNAN'S ROOM - EVENING\n</b>\nD'Artagnan returns to his room, just as a young LIEUTENANT of\nMusketeers (Andre) arrives with two of the Royal Guards.\n\n<b>                     LIEUTENANT\n</b>          Duty lists of the day, Captain!\n\n<b>                     D'ARTAGNAN\n</b>          Thank you, Andre.\n\nThey hand him the list and salute again, to leave.\n\n<b>                     D'ARTAGNAN\n</b>          Wait.  There is an entry here --\n          \"Messenger sent by King to residence\n          of Mademoiselle Michelle Beaufort.\"\n          Why was that?\n\nThe young Musketeers try not to smirk.\n\n<b>                     LIEUTENANT\n</b>          Well, Captain...\n\n<b>INT.  ATHOS' APARTMENT - NIGHT\n</b>\nAthos sits alone, playing a haunting melody on a violin.  It\nis a sad tune, played with feeling; he stops as he hears a\nKNOCK at his door, and opens it to --\n\n<b>                     ATHOS\n</b>          D'Artagnan!\n\n<b>                     D'ARTAGNAN\n</b>          Athos, my friend!\n\nThey embrace with deep affection -- friends who have shared\neach other's darkest times.\n\n<b>                     D'ARTAGNAN\n</b>          It's been too long.\n\n<b>                     ATHOS\n</b>          Life is too long.  Except when we\n          have our friends.  Look at you!\n          You're still a boy!  Sit, sit!  I'll\n          open a bottle of wine.\n\nD'Artagnan takes one of the wooden chairs, by the meager\nfire.  The whole place is modest at best.\n\n<b>                     D'ARTAGNAN\n</b>          Thanks, but not for me.\n\n<b>                     ATHOS\n</b>          You can't drink with a friend you\n          haven't seen in months?\n\n<b>                     D'ARTAGNAN\n</b>          I have ordered a drill of the Royal\n          Guard for midnight, and must be\n          clear-headed for it.\n\n<b>                     ATHOS\n</b>          Midnight!  Mon dieu!  Driving the\n          youngsters hard, eh?\n\n<b>                     D'ARTAGNAN\n</b>          They must stay sharp.  There was an\n          attempt on the King's life today.\n\n<b>                     ATHOS\n</b>          Another?  How many times have you\n          saved his life in this year alone?\n          Three?  Four?\n\n<b>                     D'ARTAGNAN\n</b>          I heard your playing.\n\n<b>                     ATHOS\n</b>          I was feeling sorry for myself.\n          Raoul is getting married, he\n          proposed today!  I love that boy\n          beyond all measure, I've spent\n          everything I own to give him\n          education and opportunity.  Now he\n          has complete happiness, and I mope.\n\nA cloud passes d'Artagnan's face; he has something to tell\nAthos.\n\n<b>                     D'ARTAGNAN\n</b>          Athos...\n\nBut whatever it is that d'Artagnan wants to say is\ninterrupted by the sound of someone climbing the stairs.  As\nAthos' face brightened with the arrival of d'Artagnan, now it\nglows as he jumps up to welcome his son.\n\n<b>                     ATHOS\n</b>          That must be Raoul!  Raoul!  Look,\n          d'Artagnan's come to visit...!\n          What's wrong?  You look awful!\n\n<b>                     RAOUL\n</b>          Michelle, she -- The king has\n          invited her to come live in the\n          palace.\n\nAthos is stunned; d'Artagnan witnesses this with agony.\n\n<b>                     ATHOS\n</b>          But -- are you sure?\n\n<b>                     RAOUL\n</b>          We were at her door.  I was just\n          taking the ring from my pocket, for\n          the third time today, when a young\n          Musketeer brought the invitation for\n          her to become a lady-in-waiting for\n          the Queen Mother.\n\n<b>                     ATHOS\n</b>          Michelle cannot possibly accept!\n\n<b>                     RAOUL\n</b>          She cannot possibly refuse.  Her\n          family is poor, they have even less\n          money than we do.  And along with\n          the invitation, the King sent the\n          diamond pendant, from the piglet.\n\n<b>                     ATHOS\n</b>          Piglet -- ?  What are you -- ?\n\n<b>                     RAOUL\n</b>          Never mind, Papa, it doesn't matter\n          now.  She loved me once.  I want to\n          die remembering that.\n\n<b>                     ATHOS\n</b>          Die?  What...?\n\n<b>                     RAOUL\n</b>          I have rejoined the army, and asked\n          to resume my commission at the head\n          of the troops of General Fromberge.\n\n<b>                     ATHOS\n</b>          Fromberge...?!  At the front?!  No.\n\n<b>                     RAOUL\n</b>          It is already done.  I have just\n          stopped at Mother's grave, to say\n          goodbye, before coming to tell you.\n\n<b>                     ATHOS\n</b>          Raoul, no... You cannot do this.  No\n          matter how your heart is broken --\n\nBut Raoul stops him, with an embrace.\n\n<b>                     RAOUL\n</b>          Goodbye, father.  I am sorry.\n\n<b>                     ATHOS\n</b>          Raoul --\n\nRaoul breaks away, and runs from the room.  Athos, so joyful\nmoments before, holds his head as if his brain might erupt.\n\n<b>                     ATHOS\n</b>          This cannot be.  Everyone knows the\n          Queen Mother is a recluse, and the\n          ladies-in-waiting are but\n          mistresses for the king!\n\n<b>                     D'ARTAGNAN\n</b>          If the young woman truly loves\n          Raoul --\n\n<b>                     ATHOS\n</b>          She's a woman, d'Artagnan!  From a\n          poor family.  You may still be young\n          enough to believe love conquers\n          everything, but I am old and hard\n          and I've seen too much.  Even when\n          kings are hunchbacks they have any\n          woman they desire, because power\n          seduces even more than love!\n\nD'Artagnan is silent, and even ashamed.  Athos realizes --\n\n<b>                     ATHOS\n</b>          You knew this was happening.  You\n          knew and that's why you came.\n\n<b>                     D'ARTAGNAN\n</b>          I fear I know our King.  I came to\n          try to bring you hope.\n\n<b>                     ATHOS\n</b>          What hope is there?  A wartime\n          commission cannot be vacated except\n          by the king, and what chance is\n          there of that?  Fromberge is on the\n          battle line, and Raoul --\n\n<b>                     D'ARTAGNAN\n</b>          I have dispatches a message to\n          Fromberge requesting that Raoul be\n          kept far from the fighting.\n\n<b>                     ATHOS\n</b>          Raoul is everything to me.\n\n<b>                     D'ARTAGNAN\n</b>          I know.\n\n<b>                     ATHOS\n</b>          Oh my friend.\n\nAthos grips d'Artagnan in gratitude and desperate hope.\n\n<b>                     D'ARTAGNAN\n</b>          I will also speak with the King, for\n          he is surely unaware of the problems\n          his invitation to Mademoiselle\n          Beaufort has caused.\n\n<b>                     ATHOS\n</b>          You trust his character more than\n          anyone else does.\n\n<b>                     D'ARTAGNAN\n</b>          Raoul is hurrying to the front, so I\n          must hurry too.\n\n<b>                     ATHOS\n</b>          Save my son, d'Artagnan.\n\nThey embrace once more, and d'Artagnan leaves.\n\n<b>EXT.  PARIS STREETS - DAY\n</b>\nMagnificent public buildings -- palaces and cathedrals --\ngrace the city's skyline, but here in central Paris all is\nsqualor.  On a narrow, filthy street, beggars bother the\nsullen city peasants who are weak with hunger themselves.\n\nBut interest perks up when two soldiers drive up in a wagon,\nand one of them, Lieutenant Andre, announces --\n\n<b>                     LIEUTENANT\n</b>          Here is food, the gift of your\n          loving King, on his birthday!  He\n          gives to himself by giving to you,\n          in that he loves you so much!\n\nSlowly at first the paupers stand and shuffle forward.  As\nthe soldiers begin handing out foodstuffs -- bread, cabbages,\ntomatoes, eggs -- those nearest the wagon begin to jostle\neach other, and a large crowd gathers quickly.\n\n<b>                     LIEUTENANT\n</b>          No need to fight, there is plenty\n          for all!\n\nIt's looking like a holiday celebration... until a RUFFIAN\nbreaks open a loaf of bread, and wrinkles his nose.\n\n<b>                     RUFFIAN\n</b>          This stuff stinks.  It is rotting!\n          The King gives us rotten food!\n\nHe hurls the moldy bread back at the soldiers.  Other paupers\nsniff the food, and its stink set off an explosion of anger:\nthey throw food at the soldiers... Then a paving stone\ncrashes through a shop window, and suddenly it's a riot, with\nthe mob overwhelming the soldiers and dragging them down the\nstreets in the direction of the palace.\n\nD'ARTAGNAN, riding toward the palace himself, turns a corner\nand sees the mob coming.  And they see him:  the elegant,\ndashing Musketeer on the prancing stallion.\n\nAnd at that moment, two more soldiers race out of a side\nstreet, fleeing a similar mob, coming from another direction.\nD'Artagnan understands everything at a glance; the second\npair of fleeing soldiers reach him in panic.\n\n<b>                     PANICKED SOLDIER\n</b>          Back, toward the palace!  We cannot\n          hold them off!  We will fire a\n          volley into them!\n\n<b>                     D'ARTAGNAN\n</b>          No!  Run to the palace and close the\n          gates.  But do not fire!\n\nThe two new soldiers race away; d'Artagnan waits calmly on\nhis horse, as the mobs from both directions converge on him.\n\nTHE MOB, seeing the dashing Musketeer wait so confidently for\nthem, slow up; but the ruffian urges them on.\n\n<b>                     RUFFIAN\n</b>          Come on!  To the palace!\n\nD'Artagnan sits calmly in their way.  He doesn't even draw\nhis sword, though members of the mob grab the reins of his\nhorse.  Some of the mob recognize him, and murmur...\n\n<b>                     MOB\n</b>          It's d'Artagnan!  Le Generale de\n          Musketeers!\n\nThe mob hesitates -- for the name d'Artagnan means heroism\nand patriotism to all of them.\n\n<b>                     RUFFIAN\n</b>          One Musketeer can't stop us!\n\n<b>                     D'ARTAGNAN\n</b>          Stop you?  You are Frenchmen, are\n          you not?  I am one of you.\n\n<b>                     RUFFIAN\n</b>          The King is a Frenchman, but he is\n          not one of us!\n\n<b>                     D'ARTAGNAN\n</b>          Citizens of Paris!  Give ear to me!\n\n<b>                     RUFFIAN\n</b>          We'll give you their ears!\n\nWith that he draws a dagger from his filthy shirt and puts it\nto the ear of the young Lieutenant who is already bloody from\nbeing dragged through the street.\n\n<b>                     D'ARTAGNAN\n</b>          Wait -- and listen!  I beg you!\n\n<b>                     RIOTER\n</b>          They give us garbage, not fit for\n          rats!  They think we are garbage!\n\nWith that one of the rioters hurls a moldy beet at\nd'Artagnan, who draws his sword in a slick liquid movement,\nhe cuts the vegetable from the air.\n\nThe display of expertise is startling.  Someone else throws a\nhead of lettuce; d'Artagnan slices it in half, and as the\npieces fly he skewers one with the point of his sword.\n\n<b>                     D'ARTAGNAN\n</b>          I'm on my way to a salad!  Doesn't\n          anybody have any endive?\n\nThe mob laughs at this panache, and the amazing display of\nswordsmanship that lies behind it.  Someone tosses more\nlettuce, and d'Artagnan divides and skewers this one as well.\nThis time the crowd applauds.\n\n<b>                     D'ARTAGNAN\n</b>          A tomato?\n\nCan he do it?  Someone fires a tomato right at his head, and\nsure enough d'Artagnan spears it.  Then, with a victorious\nflourish, he takes a bite of it.  His face contorts with the\ntaste, and he spits the pieces out; the crowd is hushed.\n\n<b>                     D'ARTAGNAN\n</b>          You are right.  It is rotten.  I\n          will speak to the King myself.  You\n          have my word.\n\nThe mob is completely won over by d'Artagnan; the ruffian,\nangry that his riot is fizzling, raises his knife again over\nthe soldiers, but now the point of d'Artagnan's sword flicks\nto the ruffian's neck.\n\n<b>                     D'ARTAGNAN\n</b>          And you will release those men --\n          for they serve France... and you.\n\n<b>                     RIOTERS\n</b>          Three cheers for d'Artagnan!\n          Hurrah...!!  Hurrah...!!\n\nThe soldiers who moments before were about to be ripped apart\nnow stand and look at d'Artagnan in gratitude and awe.  The\nmob has forgotten them; they see only d'Artagnan as he rakes\nhis blade clean, returns it to its scabbard, reins his horse\naround, and slowly rides away, escorting the soldiers back\ntoward the palace.\n\n<b>INT.  PALACE - NIGHT\n</b>\nD'Artagnan strides into the long hallway leading to the royal\napartments.  As he reaches the door to the king's rooms, he\nfinds a knot of royal advisors -- among them Pierre and\nClaude -- gathered outside the king's door.\n\n<b>                     CLAUDE\n</b>          We already know about the riots!\n\n<b>                     D'ARTAGNAN\n</b>          Does he know?\n\n<b>                     PIERRE\n</b>          We will tell him, when it is...\n\n<b>                     CLAUDE\n</b>          Convenient.\n\nBlocked by the advisors, d'Artagnan leaves them, turning down\none hallway, and then another; he reaches the Hall of Mirrors\nand touches the golden frame of one mirror at its corner; the\nmirror becomes a door, revealing a secret passage within the\nwalls.  D'Artagnan steps through and the portal closes again,\nleaving no trace of its existence.\n\n<b>INT.  PALACE - BEDROOM - NIGHT\n</b>\nWithin a bed whose tapestried posts stretch to the sixteen\nfoot ceiling, the king is making love; the YOUNG WOMAN lying\nbeneath him is doing her best to sound sincere.\n\n<b>                     YOUNG WOMAN\n</b>          Oh yes!  So good!  Ooo, wonderful,\n          Marvelous!  Fan-tas --\n\nLouis climaxes with a grunt.  She tries to sound pleased.\n\n<b>                     YOUNG WOMAN\n</b>          Oh, Louis, that was incredible.  It\n          was better than ever before.  It --\n\n<b>                     LOUIS\n</b>          I'm hungry.\n\nHe hops up, throwing on a silk robe embroidered in gold.\n\n<b>                     YOUNG WOMAN\n</b>          I will have food brought.\n\n<b>                     LOUIS\n</b>          I like to eat alone.\n\nHe moves to what appears to be a wardrobe, standing against\nthe far wall, and opens its door, revealing a secret\nstaircase hidden within the thick walls of the palace.\n\n<b>                     LOUIS\n</b>          By the way, you'll be moving\n          tomorrow.\n\nLeaving the girl without another word, he moves down the\nconcealed stairs.\n\n<b>INT.  THE KING'S BEDCHAMBER - NIGHT\n</b>\nLouis reaches the bottom of the stairs, disguised behind a\nsimilar wardrobe in his own bedroom.  He steps out -- and is\nstartled as the lifesize portrait of Louis XIII on the other\nside of the room opens to admit d'Artagnan.\n\n<b>                     LOUIS\n</b>          Aaa!  D'Artagnan!  These passages\n          were constructed for the King's\n          security, not so you could step from\n          my father's portrait and startle me\n          to death!\n\n<b>                     D'ARTAGNAN\n</b>          It is for your security that I have\n          come, your Majesty -- for the\n          security of your honor.\n\n<b>                     LOUIS\n</b>          I already know about the riots,\n          d'Artagnan, I heard them out there\n          whispering.  Some fool gave the\n          order to distribute rotten food.  I\n          will deal with it tomorrow.\n\n<b>                     D'ARTAGNAN\n</b>          Then there is one more thing, of an\n          even more personal nature.\n\n<b>                     LOUIS\n</b>          A personal nature?\n\n<b>                     D'ARTAGNAN\n</b>          Mademoiselle Michelle Beaufort.  She\n          is betrothed to Raoul, the son of\n          Athos the Musketeer, who has served\n          France through many tribulations.\n\nThe King begins to eat from the food laid out on the table.\n\n<b>                     LOUIS\n</b>          Betrothed?  I think not.\n\n<b>                     D'ARTAGNAN\n</b>          In his mind, anyway, and soon enough\n          in hers.  She had written him many\n          letters of love.\n\nThe King pokes at his food.\n\n<b>                     LOUIS\n</b>          Miss Beaufort has accepted our\n          invitation.  By this we can only\n          suppose that she wishes to come --\n          as we wish her to be here.\n\n<b>                     D'ARTAGNAN\n</b>          Your Majesty has had many women --\n\n<b>                     LOUIS\n</b>          That is my desire, and my desire is\n          what should concern you, not the\n          sentiments of some commoner!\n\n<b>                     D'ARTAGNAN\n</b>          It is not Raoul's heart alone that\n          concerns me.  It is yours.  I know\n          you find women compliant --\n          especially the poorer ones like\n          Michelle.  But do they love you?  Do\n          you love them?  What about a queen\n          to love?  A son of your own?\n\n<b>                     LOUIS\n</b>          What quaint notions, d'Artagnan!\n          But they contradict my father, who\n          picked his queen when he was old,\n          and only then to bear me.\n\n<b>                     D'ARTAGNAN\n</b>          There is more to love than he knew,\n          or that you know.\n\n<b>                     LOUIS\n</b>          You dare criticize my father?!  Or\n          lecture me?!\n\n<b>                     D'ARTAGNAN\n</b>          Not criticize -- plead.  Love.  Love\n          your people, and you will not bear\n          to see them hungry.  Love women, and\n          they will love you.  Love yourself,\n          and --\n\n<b>                     LOUIS\n</b>          That is enough!  You are a good\n          servant, d'Artagnan, but you forget\n          your place!\n\n<b>                     D'ARTAGNAN\n</b>          At least help Raoul.\n\n<b>                     LOUIS\n</b>          Silence!  I order you!\n\n<b>                     D'ARTAGNAN\n</b>          Order Fromberge to keep him in\n          safety!  It is the least you can do,\n          to protect your own honor!\n\n<b>                     LOUIS\n</b>          I will consider it.  Now leave me.\n\n<b>                     D'ARTAGNAN\n</b>          Thank you, your Majesty.\n\nD'Artagnan bows, steps to the lifesize portrait of Louis\nXIII, touches a hidden button on its frame and moves into the\nsecret passage the painting reveals as it swings open.\n\n<b>                                                  CUT TO:\n</b>\n<b>CLOSE ON PIERRE'S FACE...\n</b>\nHe is sweating, exceptionally pale, as he tries to project\nhis voice past a huge lump in his throat...\n\n<b>                     PIERRE\n</b>          ... And I only say that... the\n          rotten food was... all my fault...\n          and I take... full responsibility...\n          and beg the forgiveness of you all.\n\nHe steps back, having accomplished something terrifically\ndifficult, and glances toward\n\n<b>THE KING\n</b>\nwho steps to his advisor and shakes his hand, whispering\nquietly...\n\n<b>                     LOUIS\n</b>          Well done, Pierre.  It will be good\n          for your soul, that you have taken\n          responsibility for your errors.  And\n          don't worry, I will look after your\n          family.\n\nPierre can only nod... He takes two steps, kneels, crosses\nhimself, and places his head between two upright rails of\n\n<b>THE GUILLOTINE\n</b>\nThe King, Pierre, and other attendants are standing on a\nplatform before a crowd of Parisians.  The blade drops,\nPierre's head hits the basket, the crowd cheers.\n\nThe King raises his hands to quiet the crowd.\n\n<b>                     LOUIS\n</b>          Do not rejoice -- but know that your\n          King does not tolerate blunders that\n          hurt his beloved people.  More food\n          is on its way, and my advisors tell\n          me the new harvests are sure to be\n          bountiful!\n\nHe shoots a glance at his advisors, and they are pale from\nthe display they've just witnessed.\n\n<b>                     LOUIS\n</b>          And I have new joys to announce to\n          you!  Today we decree a fresh glory\n          for Paris, and for all of France!\n          The laying of the foundations to\n          expand Versailles, and make it truly\n          a palace of the sun!\n\nThe advisors all applaud furiously, but from the crowd there\nis almost no reaction at all; the triple ranks of soldiers\nsurrounding the square discourage any protest, and as the\nKing leaves the platform the crowd begins to melt away.\n\n<b>NEAR THE PLATFORM\n</b>\nAramis, watching the crowd disperse, hears behind him --\n\n<b>                     VOICE\n</b>          Aramis.\n\nAramis turns to see the King, who moves up alone.\n\n<b>                     ARAMIS\n</b>          Your Majesty...\n\n<b>                     LOUIS\n</b>          How goes that favor I asked of you?\n\n<b>                     ARAMIS\n</b>          I grow closer to my target, your\n          Majesty.\n\n<b>                     LOUIS\n</b>          You bring me the heart of the Jesuit\n          General, and you will have a palace\n          of your own.\n\nThe King moves away, followed by his fawning advisors.\n\n<b>INT.  THE FAVORITE MISTRESS' PALACE ROOMS - DAY\n</b>\nA young Musketeer ushers Michelle into the palace bedroom\npreviously occupied by the King's last mistress.  The\nMusketeer leaves her alone, frozen in the center of the room,\nawed by the opulence.  Her eyes play over the details:\n\n-- The handcarved, richly upholstered furniture, beneath her\n   fingertips...\n\n-- The carved figures of cherubic angels, gleaming with gold,\n   upon the posts of the bed...\n\n-- The murals on the walls and ceiling...\n\nHer reverie is interrupted by a HANDMAIDEN who bustles in\ncarrying a magnificent dress.\n\n<b>                     HANDMAIDEN\n</b>          After your bath put on this, it is\n          the King's favorite color.  That\n          letter on the desk came here for you\n          this morning.\n\nShe tosses the dress onto the bed and is gone.  Left alone,\nMichelle lifts the letter, and recognizes the writing.\n\n<b>                     MICHELLE\n</b>          Raoul!\n\nShe opens the letter and reads quickly.\n\n<b>                     MICHELLE\n</b>          The army!  Oh Raoul, don't despair!\n          I will always be faithful...\n\nShe interrupts herself as her eyes fall on the gorgeous\ndress.  She looks around at the sumptuous palace apartment,\nand gazes again at the murals painted above the bed.\n\nThey depict naked gods and goddesses, in Olympian orgies.\n\n<b>                                                  CUT TO:\n</b>\n<b>CLOSE - STEAMING WATER, POURED INTO A TUB\n</b>\nThe Handmaiden has prepared a 17th Century bathtub for\nMichelle, and now retires.\n\n<b>                     HANDMAIDEN\n</b>          If you need me further, just ring.\n\nAs the handmaiden leaves, exiting frame, we PUSH IN on one of\nthe murals on the wall.  The eye of one of the figures there\nis no longer the painted eye it was before, but is a real\nhuman eye, disguised by the mural...\n\n<b>THE KING, IN THE SECRET PASSAGEWAY\n</b>\nis spying on Michelle.\n\n<b>THE KING'S POV\n</b>\nas Michelle undresses and steps into the bath.  Louis catches\ntantalizing glimpses of her richly sensual body in the soapy\nwater, and it stokes his desire.\n\n<b>INT.  PALACE - MICHELLE'S NEW ROOM - DAY\n</b>\nMichelle stands before the mirror, staring at herself,\nbreaktakingly gorgeous in her new dress.  She stares for a\nlong time, surprised at her own beauty.\n\nShe reaches to a vase of roses and pulls one out, blotting it\naround her neck, perfuming herself with its fragrance.  She\nlooks into the mirror, at her eyes... In guilt for what she\nis already feeling, she lifts Raoul's letter to read it\nagain.  Then she gasps -- the King stands right before her.\n\n<b>                     MICHELLE\n</b>          Sire!  I -- How did you --\n\n<b>                     LOUIS\n</b>          How did I get in?  You're new here,\n          and will soon learn many secrets.\n          What is that?\n\n<b>                     MICHELLE\n</b>          ... Nothing.\n\n<b>                     LOUIS\n</b>          A letter.  May I see?\n\nHe takes the letter; she has no resistance against him.  The\nKing reads, his eyes hardening suddenly; but then he smiles.\n\n<b>                     LOUIS\n</b>          From Raoul.  He urges you to guard\n          your honor -- as if it could be in\n          any danger... from your king.\n\n<b>                     MICHELLE\n</b>          Raoul... is in love...\n\n<b>                     LOUIS\n</b>          Enough of this, our dinner waits.\n\nTossing the letter aside, he offers her his arm.  She takes\nit and allows him to escort her from the room.\n\n<b>INT.  PALACE - THE HALL OF MIRRORS\n</b>\nThe hall is alive with glorious light, fiery gold frames\nsurrounding silvery mirrors blazing with reflections.\nMusicians line the length of the hall, and when Louis and\nMichelle appear at the far doorway they begin playing for the\ncouple as they parade past.  Michelle is speechless, as Louis\nsmiles at her awed innocence.\n\n<b>INT.  ROYAL DINING ROOM - NIGHT\n</b>\nLouis leads Michelle into a towering room surrounding a\nmagnificent table, decked out with candelabra and sumptuous\ndelicacies -- set for just two.\n\n<b>THE DINNER\n</b>\nLouis and Michelle sit opposite each other, attended by a\ndozen servants.  Michelle stares at her plate.\n\n<b>                     LOUIS\n</b>          The food doesn't please you?\n\n<b>                     MICHELLE\n</b>          It's lovely.  It's just...\n\n<b>                     LOUIS\n</b>          This is more than you are used to.\n          Your mother is a seamstress, your\n          father is dead.  You have three\n          younger sisters, two of whom suffer\n          from consumption.  Don't look so\n          surprised, Kings know such things.\n\n<b>                     MICHELLE\n</b>          I... we are humble people...\n\n<b>                     LOUIS\n</b>          Wait, no!  Do not be ashamed.  The\n          straits of your family need not be\n          permanent.  It is a simple matter to\n          have them brought to one of my\n          country estates, where they may have\n          fine meals, and physicians to look\n          after them.\n\n<b>                     MICHELLE\n</b>          You would do that, your Majesty?\n\n<b>                     LOUIS\n</b>          My dear, I've already done it.\n\nShe rushes to him and throws herself at his knees, weeping in\ngratitude.  Louis smiles, as if embarrassed.\n\n<b>                     LOUIS\n</b>          Please, darling, that isn't\n          necessary.  We are friends now.\n          Mademoiselle needs wine!\n\nA servant quickly approaches with wine; the goblet at\nMichelle's place is quite large, and he pours it full.\n\n<b>INT.  MICHELLE'S BEDROOM - NIGHT\n</b>\nLouis leads Michelle back to her room; she's a bit unsteady\nfrom the wine; but she grows alert as she notices him closing\nthe door behind her.  He stares into her eyes.\n\n<b>                     LOUIS\n</b>          You are beautiful.  You know you\n          are.\n\n<b>                     MICHELLE\n</b>          Sire, I --\n\n<b>                     LOUIS\n</b>          If you don't want to be so\n          appealing, why did you touch the\n          rose to your skin?  Where was it?\n          Here?\n\nHe touches his lips to her throat.  She gasps, but then pulls\naway.  She glances at the letter on the writing table.\n\n<b>                     LOUIS\n</b>          What is it?  Raoul?  If he really\n          loved you, he would have proposed\n          marriage.  He didn't, did he?\n\nHe sees her hesitation and uncertainty.  He's smooth, gentle.\n\n<b>                     LOUIS\n</b>          You have never known love until you\n          have known the love of a king.\n\nHe kisses her; for a moment she seems frozen... and then she\nyields.  Never having doubted that she would.  Louis pulls\nthe gown from her shoulders.  She doesn't resist.\n\n<b>INT.  THE FORTRESS PRISON\n</b>\nThe old Jailer, carrying a torch that barely pushes back the\ndarkness, leads another guard up the winding stairs.\n\n<b>                     JAILER\n</b>          It's a jolt at first, so brace\n          yourself.\n\n<b>INT.  CELL OF THE MAN IN THE IRON MASK\n</b>\nThe Man in the Iron Mask lifts his head as a key rattles into\nhis door.  The door opens, admitting his old Jailer, and a\nNEW KEEPER.  The New Keeper is just a younger version of the\nold one -- greasy, fat, and cruel.\n\n<b>                     NEW KEEPER\n</b>          Ugh!  He looks 'orrible.\n\nThe Man in the Iron Mask rises and takes a step forward; the\nnew keeper recoils and raises his club threateningly.\n\n<b>                     NEW KEEPER\n</b>          Stay back!\n\n<b>                     MAN IN THE IRON MASK\n</b>          I frighten you.  It's okay.  Keeper\n          was scared of me too, at first.\n\n<b>                     NEW KEEPER\n</b>          Scared?\n\nThe New Keeper steps forward and clubs the Man in the Iron\nMask in the shoulder, then kicks him as he falls.\n\n<b>                     NEW KEEPER\n</b>          Scared of you?  Not me.  I'll kill\n          him if he gets near me.\n\nThe New Keeper strides out.  The Man in the Iron Mask pulls\nhimself to his knees; his eyes, visible through the slits of\nthe mask, look sadly at the old Jailer.\n\n<b>                     MAN IN THE IRON MASK\n</b>          I miss Keeper.  I miss him so much.\n\n<b>                     JAILER\n</b>          Moron.\n\nThe jailer leaves the cell, locking the door behind him.\n\n<b>INT.  A BATTLEFIELD COMMAND TENT\n</b>\nRaoul has just received orders from General Fromberge, who\nsits at a map table, Raoul salutes and follows a young staff\nofficer from the tent.  As Raoul leaves, the General\nwithdraws from his leather field pouch a royal letter --\nparchment, with blue and gold seals.  Fromberge touches the\nedge of the parchment to the candle, and burns the letter...\n\n<b>EXT.  TRENCH - DARKNESS\n</b>\nTwo men move along a deep trench, the siege works of 17th\ncentury siege warfare.  One of the men is Raoul, carrying a\nmusket; in his new uniform he looks out of place among the\ndirty, battle weary men they pass.  He is following the STAFF\nOFFICER who is no older than himself, but whose eyes are\nalready dead, while Raoul's are wide and wild.\n\nThe trench is deep as a grave; by crouching, both men keep\ntheir heads below the surrounding ground.  Thick smoke rolls\nover their heads; we can't tell if it is day or night.  From\nall around come sounds of battle, with the sporadic fire of\nmuskets and the rumble of cannons; officers shout orders in\nthe distance; wounded men nearby whimper for water and the\nofficer leads Raoul by them as if they did not exist.\n\nThe young Staff Officer stops at a bend in the trench.\n\n<b>                     STAFF OFFICER\n</b>          Here.\n\nWithout another word he goes back the way he came.  Raoul\ngrips his musket and looks around him; he finds himself among\nseveral dozen stark eyed men manning the forward curve of the\ntrench.  He has little time to wonder what will happen next.\nA horn trumpets close by, and with a shout, the French\nsoldiers clamber out of their breastworks.\n\nFor an instant, Raoul hesitates in pure terror, then joins\nthe charge with a shout of his own --\n\n<b>                     RAOUL\n</b>          Mi-cheeelllll!! --\n\nOn the stone wall looming above the French soldiers, orange\nblossoms of fire -- the muzzle flash of primitive cannons --\npenetrate the smoke, and the ground at Raoul's feet explodes,\nhurling him backwards.  He covered barely a few feet, and\nfalls almost exactly where he started.\n\nDead.\n\n<b>                                                  CUT TO:\n</b>\n<b>CLOSE - THE DOOR OF ATHOS' ROOMS - DAY\n</b>\nA gloved hand raps on the door.  Athos opens it to a military\nmessenger, who shoves at him a single sheet of paper, rolled\nand tied with ribbon.\n\n<b>INT.  ATHOS' ROOM - NIGHT\n</b>\nThe message slams onto the table as Athos staggers upon it,\nhis legs buckling beneath him in shock and grief.\n\n<b>INT.  D'ARTAGNAN'S ROOM - DAY\n</b>\nD'Artagnan is working at his desk, as the Lieutenant enters.\n\n<b>                     LIEUTENANT\n</b>          Sir... a casualty report came...\n\nD'Artagnan looks at the paper the Lieutenant hands him.\n\n<b>                     D'ARTAGNAN\n</b>          No, no, no...\n\nHe sags for a moment, then grabs his cloak and sword.\n\n<b>INT./ EXT.  MUSKETEER'S GATE OF THE PALACE - DAY\n</b>\nThe Musketeer's Gate is close to the stables where the\nMusketeers train and keep their horses.  D'Artagnan hurries\nfrom the Palace and snaps an order.\n\n<b>                     D'ARTAGNAN\n</b>          Saddle my horse!\n\nThe grooms jump to work; several young Musketeers nearby stop\ntheir training, noticing their Captain's agitation.\n\n<b>                     D'ARTAGNAN\n</b>          Hurry --\n\nBut then d'Artagnan sees Athos coming, riding furiously\nthrough the Musketeers' gate.  D'Artagnan steps out to meet\nhim as Athos reins in his horse and jumps from the saddle.\n\n<b>                     D'ARTAGNAN\n</b>          Athos, my friend --\n\nAthos marches to the palace door; d'Artagnan cuts him off.\n\n<b>                     D'ARTAGNAN\n</b>          Athos, please...!\n\n<b>                     ATHOS\n</b>          Get out of my way.\n\n<b>                     D'ARTAGNAN\n</b>               (grabbing him)\n          Athos, I beg you --\n\nAthos punches d'Artagnan with furious strength, knocking him\naside.  The young Musketeers reach for their weapons, but\nd'Artagnan is up quickly, throwing himself in front of Athos\nagain, blocking the doorway into the palace.\n\n<b>                     D'ARTAGNAN\n</b>          Where are you going?\n\n<b>                     ATHOS\n</b>          To kill the king.\n\nAt this, the swords of the young Musketeers sing from their\nscabbards.  Athos wears a sword, but he has not drawn it.\n\n<b>                     D'ARTAGNAN\n</b>          Athos!  I know life means nothing to\n          you at this moment, but I will not\n          let you kill yourself.\n\n<b>                     ATHOS\n</b>          The King killed my son!\n\n<b>                     D'ARTAGNAN\n</b>          The cannons killed Raoul!  The\n          cannons, and love.  But not the King.\n\nA YOUNG MUSKETEER steps up.\n\n<b>                     YOUNG MUSKETEER\n</b>          I'll kill the old man for you,\n          Captain, if you don't wish to --\n\nAthos spins, striking like a rattlesnake, his sword whipping\nfrom its scabbard and slicing off the arrogant young\nMusketeer's ear.  He flicks another's sword from his grasp,\nthen brings the the point of his own blade up beneath the\nchin of a third, shoving him back.\n\n<b>                     ATHOS\n</b>          Come on!  All of you!\n\nD'Artagnan tackles Athos from behind and pins him face down\nto the hay.  For a moment Athos bellows in rage --\n\n<b>                     ATHOS\n</b>          Coward!  Fight me!  Fight me...!\n\nEmotion spills up into Athos' throat, and he begins to sob.\n\n<b>                     ATHOS\n</b>          He killed my son, d'Artagnan!  He\n          killed my son...!\n\nD'Artagnan, dying inside, still grips Athos.  Athos grows\nquiet, and the young Musketeers drift closer.\n\n<b>                     D'ARTAGNAN\n</b>          Get back, all of you!\n\nD'Artagnan stands, and Athos rises, still holding his sword.\nHe looks at d'Artagnan a long beat, then sheathes his sword\nand turns to his horse.  The young soldiers move to him.\n\n<b>                     D'ARTAGNAN\n</b>          Let him go!\n\nAthos mounts his horse, and with a last glance back at\nd'Artagnan, he gallops away.\n\n<b>INT.  KING'S BEDCHAMBER - DAY\n</b>\nThe King has just climaxed in his lovemaking, and lies spent\nupon Michelle.  His rest is interrupted by a KNOCK at his\ndoor.  The King scowls.\n\n<b>                     LOUIS\n</b>          What?!\n\n<b>                     VOICE\n</b>          Your Majesty... it is Andre.\n\nLouis groans, and pulls on a robe.  Michelle whispers --\n\n<b>                     MICHELLE\n</b>          Shall I leave?\n\n<b>                     LOUIS\n</b>          No, you may wait behind the screen.\n\nMichelle rises and slips behind a painted dressing screen as\nLouis goes to the door and admits the young Lieutenant.\n\nBEHIND THE SCREEN, Michelle lifts a jeweled hand mirror and\nappraises her face; she begins brushing her long hair.  She\ncan hear the conversation...\n\n<b>                     LIEUTENANT\n</b>          I would not have disturbed you,\n          Majesty, but you ordered me to keep\n          you informed --\n\n<b>                     LOUIS\n</b>          Yes, yes, go on.\n\n<b>                     LIEUTENANT\n</b>          Athos, the former Musketeer, has\n          just fought with several of your\n          guard, at the Musketeers' Gate.\n\nBehind the screen, Michelle pauses at the mention of Athos.\n\n<b>                     LOUIS\n</b>          Did they kill him?\n\n<b>                     LIEUTENANT\n</b>          No.  He cut an ear from one of the\n          men, no one else was hurt.  Captain\n          d'Artagnan allowed him to leave.\n          Athos was upset about the death of\n          his son, at the front.\n\nCRASH!  From behind the screen comes the sound of the mirror,\nshattering as it drops to the floor.  It startles the\nLieutenant, but the King goes on...\n\n<b>                     LOUIS\n</b>          Who was Athos seeking?  Tell me!\n          Did he try to enter the palace?\n\n<b>                     LIEUTENANT\n</b>          ... He did -- but Captain d'Artagnan\n          blocked his way.\n\n<b>                     LOUIS\n</b>          You may go, Lieutenant.\n\nThe Lieutenant moves back to the door.\n\n<b>                     LIEUTENANT\n</b>          Do you want Athos arrested, your\n          Majesty?\n\n<b>                     LOUIS\n</b>          Not by you.  I will order d'Artagnan\n          to do it.\n\nThe Lieutenant leaves, and Louis moves behind the screen to\nsee Michelle stagger and grip the dressing table; her bare\nfeet step onto the broken glass of the mirror, yet she is\noblivious to the cuts.  Louis sees this and grabs her.\n\n<b>                     LOUIS\n</b>          My dear!  The glass -- !\n\nHe pulls her to the couch and draws a blanket about her,\ncuddling her as she begins to shake.\n\n<b>                     MICHELLE\n</b>          Did you know... about Raoul?\n\n<b>                     LOUIS\n</b>          I did not want to upset you.  It was\n          tragic.  I did everything I could\n          for him.  I ordered him positioned\n          in a spot of complete safety, far\n          from the fighting.  But he\n          disregarded my wishes and charged\n          into danger.\n\nHe cuddles her as she weeps.\n\n<b>                     LOUIS\n</b>          I will order a Mass for his soul.\n          It will guarantee his place in\n          Heaven.\n\n<b>                     MICHELLE\n</b>          Oh Louis, Louis...\n\nShe clings to him in her grief.\n\n<b>EXT.  NOTRE DAME CATHEDRAL - DAY\n</b>\nThe great cathedral rises next to the monastery where Aramis\nresides.  We PAN DOWN and PUSH IN on the cobblestones between\nthe two structures, as if penetrating to --\n\n<b>SUBTERRANEAN PASSAGES\n</b>\nAramis leads Porthos through tunnels, twisting, descending.\n\n<b>                     PORTHOS\n</b>          Aramis... is this the way to hell?\n\n<b>                     ARAMIS\n</b>          Hell may be our destination, dear\n          Porthos, but not this trip.\n\nThey reach an iron door and move through it, into\n\n<b>A GORGEOUS, SECRET CHAPEL\n</b>\nCandles illuminate masterpiece frescoes.  The place is\nbreathtaking.\n\n<b>                     PORTHOS\n</b>          Where are we?\n\n<b>                     ARAMIS\n</b>          Jesus of Nazareth found the holy\n          among the profane.  If we are to\n          have a place of private prayer,\n          where better than here, beside the\n          channels where the shit and the\n          garbage run to the river?\n\nPorthos notices niches in the walls; he looks closely and\nsees the face of a corpse, enclosed behind glass.\n\n<b>                     PORTHOS\n</b>          Mother of God!\n\n<b>                     ARAMIS\n</b>          It is also a place of burial.\n\n<b>                     PORTHOS\n</b>          A tomb?  We're in a tomb?\n\n<b>                     ARAMIS\n</b>          Catacombs.  Very holy.\n\nPorthos looks as if the bodies could resurrect at any moment\n-- then jumps out of his skin as the door opens.\n\n<b>                     PORTHOS\n</b>          Yaaaahhh!\n\nA hooded figure, looking like the Grim Reaper, enters.\n\n<b>                     ARAMIS\n</b>          Relax, you big fool, it's\n          d'Artagnan.\n\nAnd sure enough the hooded figure, whom we now see has been\nled in by a little monk, is d'Artagnan.  Aramis nods to the\nmonk, who leaves quickly.  Before d'Artagnan can ask\nanything, Porthos jumps again; the back door has opened, and\nmonks usher in Athos, who freezes as he sees d'Artagnan.\n\n<b>                     ARAMIS\n</b>          It's all right.  D'Artagnan was the\n          one who warned us that he'd been\n          given an order for your arrest.\n          Here you have sanctuary -- does he\n          not, d'Artagnan?\n\nThe escort monks disappear, closing the chapel door so that\nthe four Musketeers are left to sit at a small table the\nmonks have set up, Athos and D'Artagnan opposite each other.\n\n<b>                     ARAMIS\n</b>          Look at us.  We are old men now.  But\n          once we were young.  And when we saw\n          injustice, we fought it.\n\n<b>                     D'ARTAGNAN\n</b>          We have grown wiser with age.  Now\n          we know that some problems cannot be\n          settled with a sword.\n\n<b>                     ATHOS\n</b>          And some problems cannot be settled\n          without one.\n\n<b>                     ARAMIS\n</b>          Well here is the problem at hand:\n          the King has ordered me to discover\n          the identity of the Governor General\n          of Jesuits, and kill him.  As our\n          English rivals have left the\n          Catholic Church, Louis has struck on\n          a plan to dominate the whole of\n          Europe by uniting Church and State\n          and making himself head of both.  He\n          has already picked the Pope.  Only\n          the Jesuits, who put God above\n          throne or papacy, stand in his way.\n\n<b>                     PORTHOS\n</b>          But -- doesn't God ordain both Pope\n          and King?\n\n<b>                     ARAMIS\n</b>          So they tell us.  But what are we to\n          believe when the king is a tyrant,\n          and the Church, meant to stand for\n          all those oppressed, has become the\n          tool of oppression?  When no\n          conscience is tolerated?  No\n          dissent, no objection?\n\n<b>                     PORTHOS\n</b>          It is a weighty problem, Aramis --\n          but perhaps you should leave it to\n          this secret General of the Jesuits,\n          whoever he might be.\n\n<b>                     ARAMIS\n</b>          Easy to say, but hard to do.  For\n          what I am trying to tell you is that\n          I am the Governor General of Jesuits\n          in France.\n\nA stunned silence.\n\n<b>                     ATHOS\n</b>          What do you propose to do?\n\n<b>                     ARAMIS\n</b>          Replace the king.\n\n<b>                     D'ARTAGNAN\n</b>          I cannot hear this!\n\n<b>                     PORTHOS\n</b>          It can't be done.\n\n<b>                     ARAMIS\n</b>          It can.  I know the way.\n\n<b>                     ATHOS\n</b>          I am with you!\n\n<b>                     D'ARTAGNAN\n</b>          No!  Stop --\n\n<b>                     ARAMIS\n</b>          I will need you all.  All for one.\n          One for all.\n\n<b>                     D'ARTAGNAN\n</b>               (jumping up)\n          You -- You cannot ask me to betray\n          my king!  I have sworn to him!\n\n<b>                     ATHOS\n</b>          It is honor you serve, and when the\n          king is dishonorable you are removed\n          from your oath of honor!\n\n<b>                     D'ARTAGNAN\n</b>          An oath is an oath precisely because\n          it cannot be removed!\n\n<b>                     ATHOS\n</b>          Why do you follow him, d'Artagnan?!\n          I know you have put service above\n          your own life, but why does this\n          King deserve such loyalty?  He is a\n          monster!  He executes ministers for\n          his own blunders, with their\n          families hostage so they take the\n          blame!  He has no honor!\n\n<b>                     D'ARTAGNAN\n</b>          No man is all bad... or all good.  I\n          believe -- I must believe -- that\n          Louis can learn.  And perhaps I can\n          help him.\n\nAthos leaps up from the table, and glares at d'Artagnan.\n\n<b>                     ATHOS\n</b>          Whatever the plan... I am in it!\n          The next time we meet, one of us\n          will die.\n\nHe storms out of the rear door of the chapel.\n\n<b>                     ARAMIS\n</b>          Porthos, see to Athos, won't you?\n\nPorthos follows Athos; Aramis and d'Artagnan are left alone.\n\n<b>                     ARAMIS\n</b>          I have heard many confessions,\n          d'Artagnan.  But even if I were not\n          a priest, I could tell your heart\n          has a secret weight, and it is\n          hurting you to carry it alone.\n\n<b>                     D'ARTAGNAN\n</b>          The secret I carry I cannot share.\n          Not even with God.\n\nD'Artagnan moves to the door.\n\n<b>                     D'ARTAGNAN\n</b>          I cannot betray Louis.  I will\n          defend him with my life.\n\n<b>                     ARAMIS\n</b>          I know.  God go with you.\n\nD'Artagnan leaves Aramis alone in the secret chapel.\n\n<b>EXT.  THE MONASTERY - NIGHT\n</b>\nAramis leads Athos and Porthos out of the catacombs.\n\n<b>                     ARAMIS\n</b>          This way.\n\nThey move into a moonlit courtyard of the monastery.  A\nhooded Jesuit standing guard steps from the shadows, then\nrecognizes Aramis and admits the trio to the monastery's\nforge, where more hooded Jesuits are working in secret,\nheating iron red hot in the bellows furnace.\n\n<b>                     ATHOS\n</b>          What are they doing?\n\n<b>                     ARAMIS\n</b>          Making the key to the throne.\n\n<b>                     PORTHOS\n</b>          They are very large keys.\n\nOne of the blacksmiths uses tongs to remove something red\nfrom the fire; he hammers it in a shower of sparks and\nplunges it into water.  Aramis pulls the result from the\nwater and shows it to Athos and Porthos.\n\nIt is an iron mask.\n\n<b>EXT.  A CARRIAGE - FRENCH COUNTRYSIDE - NIGHT\n</b>\nThe carriage rolls through the long sweep of the French\ncountryside, traveling fast.\n\n<b>INT.  THE CARRIAGE - NIGHT\n</b>\nThe three Musketeers -- Aramis, Athos, and Porthos -- have\nbeen traveling for some time.  Porthos is asleep, snoring.\n\n<b>                     ATHOS\n</b>          Porthos sleeps, and you plot.  Don't\n          you think it's time you told me what\n          it is you are plotting?\n\n<b>                     ARAMIS\n</b>          Soon enough.  Here we are.\n\nKicking Porthos' feet to wake him, Aramis opens the carriage\ndoor, and they step out...\n\n<b>EXT.  FRENCH COAST - NIGHT\n</b>\nLying just off the coast is the forbidden island, where the\nimposing fortress prison rises on the promontory off shore.\n\n<b>                     ATHOS\n</b>          The Prison of Belle Sur.\n\n<b>                     ARAMIS\n</b>          Come, we have a boat waiting.\n\nAs hooded Jesuits appear from the shadows to guide them,\nAthos and Porthos glance at each other; Porthos shrugs.\n\n<b>EXT.  AMONG ROCKS AT THE BEACH - NIGHT\n</b>\nThe guides lead the Musketeers down a hilly path to a long\nboat, hidden among the large rocks that dot the coast.\nSitting next to the boat is a scrawny little man in priest's\ngarb; at his feet is a long narrow bundle, about the size of\na mummy, with a rope tied at either end.\n\nThe guides drag the boat across the sand into the surf.\nAramis throws off his cape, and strips down almost naked.\nHe's still fit and hard.  With the guides helping him, he\nlifts the bundle by its ropes and ties it around his waist.\n\n<b>                     ATHOS\n</b>          What is that?\n\n<b>                     ARAMIS\n</b>          A body.\n\n<b>                     ATHOS\n</b>          I see that is a body!  But where did\n          you get it?\n\nAramis ignores the question, and the guides dress him in\npriest's garb.  With the robes spreading over the big bundle\nadded artfully to Aramis' waist, it appears he is a very fat\npriest; the wig and false beard the assistants give him adds\nto the illusion of Aramis as a wild, reclusive monk.\n\nThe sun is beginning to come up over the mountains.\n\n<b>                     PORTHOS\n</b>          He gets one day of confession each\n          year.  Today is the day.\n\n<b>                     ATHOS\n</b>          Who does?\n\n<b>                     PORTHOS\n</b>          Best not to ask.  Shouldn't even\n          talk about it.\n\nAramis steps onto the boat.  The little priest who first\njoined them gets in too, along with a couple of rowers.\n\n<b>                     ATHOS\n</b>          What do we do now?\n\n<b>                     PORTHOS\n</b>          I don't know about you, but I plan\n          to wait here.\n\nThe rowers pull the boat toward the fortress prison.\n\n<b>INT.  FORTRESS PRISON - DAY\n</b>\nThe pink light of the new day barely penetrates the gloom of\nthe prison.  The boat carrying Aramis and the little priest\nreaches the gate of the prison, which reaches to the water\nline.  As Aramis steps out, GUARDS meet them.\n\n<b>                     HEAD GUARD\n</b>          Who is this, then?\n\nThe little priest remains in the boat, slumped over.  One\nGUARD speaks to the little priest in Italian, and the little\npriest seems barely able to left his head; Aramis answers for\nhim, in Italian, and the guard translates --\n\n<b>                     GUARD\n</b>          He says he's the replacement.\n\nAramis rattles off more Italian.\n\n<b>                     GUARD\n</b>          He says it is only one day a month\n          when the prisoner gets confession,\n          and the little one is too sick to\n          move.  The big one doesn't speak\n          French either.\n\n<b>                     HEAD GUARD\n</b>          Then let's get it done.\n\nThe head guard gestures to let them pass.\n\n<b>INT.  CELL OF THE MAN IN THE IRON MASK\n</b>\nThe prisoner has used the torn Bible to make all sorts of\namazing origami, invented from his own head.  He looks up as\nhe hears the door open, and sees Aramis, the priest.\n\n<b>                     MAN IN THE IRON MASK\n</b>          My confession day!  But where is the\n          other one?\n\nAramis says something in Latin -- the first words of the\nceremony of absolution -- as the guards lock the door behind\nhim and move off down the corridor.\n\n<b>                     MAN IN THE IRON MASK\n</b>          I know you don't speak my language\n          -- but is the other one all right?\n          Please tell me he is not dead too,\n          or I will have lost everyone.\n\nAramis goes on mumbling Latin mechanically, for the sake of\nthe retreating guards.  The Man in the Iron Mask is desperate\nfor someone to talk to.\n\n<b>                     MAN IN THE IRON MASK\n</b>          I... tore my Bible.  Or someone else\n          did.  But it was all right.  \"Let the\n          words of my mouth and the\n          meditations of my heart be\n          acceptable in Thy sight, Oh Lord our\n          God and My Redeemer.\"\n\nAramis has stopped talking, and stares transfixed at this\nsight of the prisoner, in the iron mask.\n\n<b>                     MAN IN THE IRON MASK\n</b>          I'm sorry.  You're never seen me\n          before.  I must frighten you.\n\nAramis puts his finger to his lips.\n\n<b>                     MAN IN THE IRON MASK\n</b>          What are you doing?  Why do you --\n\nAramis clamps his hand over the mouth hole, and whispers --\n\n<b>                     ARAMIS\n</b>          I am a friend, here to help you.\n\nAramis hurriedly removes his robes, revealing the bundle.\n\n<b>                     MAN IN THE IRON MASK\n</b>          What -- ?\n\n<b>                     ARAMIS\n</b>          It is an escape.  To freedom.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Freedom...?\n\nHe says it as if the concept is beyond him.  Aramis undoes\nthe bundle, revealing the limp body.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Wh-- ?  He is dead!  Who is he?\n\n<b>                     ARAMIS\n</b>          He is you.\n\nAramis uncovers the head of the body.  It is covered in a\nmask, identical to the prisoner's.\n\n<b>INT.  PRISON CORRIDOR - CELL\n</b>\nThe Guards are sharing a bottle of wine, when they hear --\n\n<b>                     ARAMIS\n</b>          Hey!  Hey!\n\n<b>                     GUARD\n</b>          What now?\n\n<b>INT.  CELL\n</b>\nThe guards enter to find the Man in the Iron Mask slumped on\nthe floor.  Aramis, looking like the fat priest again, stands\nover him spouting Italian, as one GUARD translates --\n\n<b>                     GUARD\n</b>          He says he just fell stone dead as\n          he was reading him the Mass.\n\n<b>                     HEAD GUARD\n</b>          I never thought the bugger would\n          last this long.  But how could he\n          just keel over and --\n\nAramis rattles off more Italian, and suddenly the guard who\nunderstands it stops examining the body and backs off.\n\n<b>                     GUARD\n</b>          He says the prisoner has the fever,\n          just like the little priest does.\n\n<b>                     HEAD GUARD\n</b>          Plague?  They brought plague in\n          here?  Get him out of here.  Now!\n\nAramis rattles off a protest in Italian.\n\n<b>                     GUARD\n</b>          No, no last rites!  Get away!\n\n<b>EXT.  PRISON - DAY\n</b>\nAramis climbs into the boat; as he sits down his belly stirs,\nbut the guards don't see it -- they are using poles to push\nthe boat away, into the sea.\n\n<b>EXT.  THE COASTLINE - DAY\n</b>\nAthos and Porthos stand as the boat reaches the shore, and\ntucks in among the rocks.  Sheltered from the view from the\nprison, Aramis steps from the boat and removes his robes.\n\nThe prisoner dangles, tied wrist and ankle, from around\nAramis' neck.\n\n<b>                     ATHOS\n</b>          My God...\n\nAthos, Porthos, and the others gawk at the sight of the Man\nin the Iron Mask, as Aramis loosens the ropes.  As they back\naway from him, he sees the sky.  Endless blue -- and bright.\nHe shields his eyes.\n\n<b>                     ARAMIS\n</b>          It's all right.  Take your time.\n\nAramis helps him up, and turn him slowly around, to face...\n\nThe fortress/prison, in the distance.\n\nTHE PRISONER'S POV FROM WITHIN THE MASK:  A vast vista -- the\nsky, the sea, and the prison on the island in the middle of\nit all.  The prisoner falls to his knees, and weeps.\n\n<b>                     ARAMIS\n</b>          Athos... He needs a gentle hand.\n\nAthos moves over hesitantly, and puts his hand on the\nshoulder of the Man in the Iron Mask, who holds his hands\nagainst the mask as if to further hide his shame.\n\n<b>INT.  THE PRISON - DAY\n</b>\nThe guards are standing in the cell, looking down at the body\nnow wearing the mask, the man they think was their prisoner.\nThe guards are quiet, alone.\n\n<b>                     GUARD 1\n</b>          You ever wonder who he was?\n\n<b>                     GUARD 2\n</b>          No... Yes.  But I never asked -- and\n          you better not either.\n\nThey wrap the body, still in its mask, in a weighted sack.\n\n<b>EXT.  PRISON - DAY\n</b>\nThe prison's WARDEN GENERAL stands at the wall of the\nfortress high above the sea and watches as his guards throw\noff the body, wrapped in canvas weighted with stones.  As the\ncorpse makes a long fall and crashes into the sea, the Warden\nwrites a message on a royal scroll:\n\n<b>               THE UNSEEN PRISONER IS DEAD.\n</b>\nThe Warden seals the scroll and hands it to a messenger.\n\n<b>EXT.  COUNTRY ESTATE - NIGHT\n</b>\nA carriage pulls into a country estate, isolated among vast\nwoodlands silver in the moonlight.  Mysterious servants with\nshielded lanterns converge on the carriage as it stops.\n\n<b>INT.  CARRIAGE - NIGHT\n</b>\nAthos reaches for his sword, but Aramis stops his hand.\n\n<b>                     ARAMIS\n</b>          Jesuits.\n\n<b>EXT.  MANOR HOUSE COURTYARD - NIGHT\n</b>\nAramis emerges quickly, whispering directives to the Jesuits;\nAthos helps the Man in the Iron Mask from the carriage, his\nhead shrouded by a cloak.\n\nAramis has a blacksmith waiting; almost before he realizes it\nthe Man in the Iron Mask finds his head placed on an anvil;\nbut as the hammer rises he begins to scream.\n\n<b>                     MAN IN THE IRON MASK\n</b>          No!  Please!\n\n<b>                     ARAMIS\n</b>          What is wrong?  We only mean to free\n          you from the mask!\n\nBut the prisoner is shaking, and Athos understands why.\n\n<b>                     ATHOS\n</b>          Prison was horrible but it was his\n          home.  He's been torn from it by\n          strangers.  He's frightened,\n          exhausted -- and the mask is\n          familiar.  Let him rest in it\n          tonight, and remove it tomorrow.\n\n<b>                     ARAMIS\n</b>          Excellent, Athos.  You have a keen\n          sense of this man.\n\n<b>                     ATHOS\n</b>          His plight is obvious, isn't it?\n\nAthos, angry with Aramis' arrogance and insensitivity, leads\nthe Man in the Iron Mask toward the house; then Aramis spots\nPorthos, looking downcast.\n\n<b>                     ARAMIS\n</b>          And why are you so glum?\n\n<b>                     PORTHOS\n</b>          I expected action.  There was no\n          killing, no fighting, I was useless.\n\nIn deep depression, Porthos climbs out and shuffles off.\nAramis sighs, shakes his head, and walks to the house.\n\n<b>INT.  MANOR HOUSE BEDROOM - NIGHT\n</b>\nAthos helps the Man in the Iron Mask onto the bed; the eyes\nbehind the slits in the mask are darting, frightened.\n\n<b>                     ATHOS\n</b>          Are you hungry?\n\n<b>                     MAN IN THE IRON MASK\n</b>          Just... water.\n\nAthos pours a cupful from the water pitcher on the bed table;\nbut when he tries to help the prisoner drink the liquid\nspills as the cup bumps the mouth hole.\n\n<b>                     MAN IN THE IRON MASK\n</b>          This way.\n\nThe prisoner manipulates the cup in the way he must to get a\ndrink, then falls back to the pillow.\n\n<b>                     MAN IN THE IRON MASK\n</b>          This place... I once lived in a\n          country house.  I had guardians --\n          an old man and woman.  And tutors.\n          But no friends.  Then when I was\n          twelve, they came and took me to the\n          prison.\n\n<b>                     ATHOS\n</b>          Who came?\n\n<b>                     MAN IN THE IRON MASK\n</b>          A man in black.  I never saw his\n          face.  He took me to the cell.  A\n          blacksmith came and they put me into\n          the mask.  For days I shouted, \"What\n          have I done?  Why do you do this to\n          me?\"  But no one heard, so I just\n          stopped shouting.\n\n<b>                     ATHOS\n</b>          And you never knew why?\n\n<b>                     PRISONER\n</b>          I thought... there is something\n          about my face that men do not want\n          to see.  Something that makes them\n          cruel.  But then I realized they\n          were cruel even when I was wearing\n          the mask.  I knew there must be some\n          other reason, but I could not think\n          what it was.\n\n<b>                     ATHOS\n</b>          What is your name?\n\n<b>                     MAN IN THE IRON MASK\n</b>          The old man and woman called me...\n          Phillippe.\n\n<b>                     ATHOS\n</b>          Phillippe.  Rest now.\n\nAthos moves to the door.\n\n<b>                     MAN IN THE IRON MASK\n</b>          Thank you... for your kindness.\n\nAthos nods, pauses a moment... and leaves.\n\n<b>INT.  A DARK APARTMENT IN PARIS - NIGHT\n</b>\nThe lock rattles, and the door swings open.  D'Artagnan\nenters, lifting a lantern to throw light on the dark room.\nIt is Athos' apartment, the one he visited earlier; now he\nfinds it empty, devoid of clues.  He stands there alone.\n\nHe turns to leave, then glimpses a familiar painting hanging\nbeside the door.  Lifting his light he studies the portrait:\nAthos, Aramis, Porthos and himself -- four Musketeers, beat\nfriends, in their prime.  Together then, inseparable.\n\n<b>                     D'ARTAGNAN\n</b>          My friends... Where have you gone?\n\nHe lowers the lantern, and leaves.\n\n<b>                                                  CUT TO:\n</b>\n<b>THE MESSAGE FROM THE PRISON...\n</b>\nhas reached the court.  Gloved hands pass the message from\none advisor to another, and finally to the King.\n\n<b>INT.  PALACE - KING'S STUDY - DAY\n</b>\nThe King reads the message, rerolls it, thinks a moment, and\nhands the scroll to Claude.\n\n<b>                     LOUIS\n</b>          Take this to my mother.\n\n<b>THE MESSAGE\n</b>\nis again passed, this time into the hands of the Queen\nMother's eldest nun-attendant, and then into the hands of the\nQueen Mother herself.  The Queen is in her private rooms, and\nfor the first time we see her with her hair down.  She\naccepts the scroll, opens it, and reads.\n\nHer eyes fill with pain, grief, guilt... emotions she hides,\nturning away.\n\n<b>                     NUN\n</b>          M'lady... are you...?\n\n<b>                     ANNE\n</b>          Please, just... go away.\n\n<b>INT.  D'ARTAGNAN'S ROOM - NIGHT\n</b>\nD'Artagnan returns from his ride to Athos' place.  He looks\ndown at the Queen's door.  He checks the clock on the wall;\nit is a few minutes past nine.  He enters his room, moves to\nthe window, and waits there, to catch a glimpse of her.\n\n<b>INT.  COUNTRY MANOR HOUSE - FRONT ROOM - NIGHT\n</b>\nAramis is digging into a hearty meal, while Porthos only\nstares at his plate.\n\n<b>                     ARAMIS\n</b>          See?  There is plenty of food in the\n          country.  But the King keeps it\n          going to the army instead of --\n\nAthos marches in, all business.\n\n<b>                     ATHOS\n</b>          He is sleeping.  Now see here,\n          Aramis, it's time you told us --\n\nHe breaks off as a voluptuous serving girl leans over to\nspoon food onto Porthos' plate; her breasts jiggle below his\nnose, and she gives him a smile.\n\n<b>                     PORTHOS\n</b>          I have no appetite for food, I am\n          wasting away.  Say goodbye to\n          Porthos, for he is gone.  Even women\n          don't interest me now.\n\nThe girl moves to whisper with two other serving girls, who\nseem fascinated with the roguish Porthos; their giggles and\nwinks make Porthos even more morose; he tells his friends...\n\n<b>                     PORTHOS\n</b>          I tell you a secret.  I sleep with\n          three women at once, not because my\n          appetite is so great, but because\n          now it take three to excite me.\n\nPorthos heaves himself to his feet and shuffles off; Aramis\nsighs, having heard all this before.  Athos sits down.\n\n<b>                     ATHOS\n</b>          Who is he, Aramis?\n\n<b>                     ARAMIS\n</b>          Tomorrow.\n\n<b>                     ATHOS\n</b>          Tonight!  Right now!  We steal a man\n          from a royal prison, we hide in a\n          country chateau among an assortment\n          of saints and sluts such as only you\n          could provide, and still you wish to\n          tell me nothing?!\n\n<b>                     ARAMIS\n</b>          You seek facts, when it would be\n          better to seek truth.\n\n<b>                     ATHOS\n</b>          You are not my priest, Aramis!  You\n          would not be, even if I had one.\n\n<b>                     ARAMIS\n</b>          You are bitter, Athos.  You are torn\n          by grief, not only for Raoul, but\n          for d'Artagnan, whom you love, and\n          now treat as an enemy.\n\n<b>                     ATHOS\n</b>          He who is not with us is against us.\n\n<b>                     ARAMIS\n</b>          Those are the words of a broken\n          spirit.  My spirit is whole.  I have\n          trusted d'Artagnan with my deepest\n          secrets, and I will never believe\n          he is my enemy.\n\n<b>                     ATHOS\n</b>          Then you are a fool -- a fool who\n          has never lost a son.  What gives\n          you the right to judge me, to play\n          God with the lives of others?  Is it\n          because you are so much holier than\n          everyone else?!\n\n<b>                     ARAMIS\n</b>          There is that, of course -- but\n          mainly it is because I am so much\n          smarter than everyone else.\n\nThey are interrupted by Porthos' bloodcurdling SCREAM.\n\n<b>                     ARAMIS\n</b>          Porthos?!\n\nHe draws his sword and runs for the outside.\n\n<b>EXT.  MANOR HOUSE - NIGHT\n</b>\nAramis and Athos rush through the courtyard, surrounded by\nmoonlight and trees, confused about where Porthos is.  Then\nthey hear bellowing SCREAM OF PAIN from the latrine.\n\nSwords drawn, they bang into the latrine, to find Porthos\njust finishing urinating.\n\n<b>                     PORTHOS\n</b>          Kidney rocks.  It hurts when I pee.\n          It hurts when I shit.  I'm just a\n          fat old fart with nothing to live\n          for any more.  I'm going to hang\n          myself, as soon as I'm sober.\n\nThey watch him shuffle toward the main house.\n\n<b>INT.  THE PALACE - THE QUEEN MOTHER'S ROOM - NIGHT\n</b>\nAnne paces in her room, her hands trembling, her beautiful\nlips quivering with tortured emotion.  With a sudden impulse\nshe bolts from her room, through the outer room where her\nattendants sit, and into the corridor.\n\n<b>                     NUN\n</b>          M'lady...?\n\nThe eldest nun follows her.\n\n<b>EXT.  PALACE GARDEN - NIGHT\n</b>\nAnne rushes through the evening, toward her little chapel in\nthe palace garden; she is a tragic, romantic sight, her long\nhair flying behind her as she runs.\n\n<b>IN HIS ROOM, D'ARTAGNAN\n</b>\nhas been standing at his window, for his nightly glimpse of\nAnne.  Now he sees her, not with her retinue of nuns, but\nrunning to her chapel, clearly distraught...\n\n<b>INT./ EXT.  PALACE GARDEN - GARDEN CHAPEL - NIGHT\n</b>\nAnne reaches the door, and finds a few nuns and an old priest\npraying in the little chapel.  She staggers forward to the\naltar.  and falls to her knees there.  The nuns and the old\npriest, seeing the Queen Mother so distraught, stand silently\nand file out, leaving her in solitude.\n\n<b>                     ANNE\n</b>          Oh God I -- Forgive me...\n\n<b>                     D'ARTAGNAN\n</b>          M'lady...?\n\nShe whirls to see him; the sight of her face, bursting with\nemotions she has kept buried, draws him nearer.\n\n<b>                     D'ARTAGNAN\n</b>          What -- ?\n\n<b>                     ANNE\n</b>          No, stay back!  Stay back!\n\nHe freezes in his tracks; she holds her hands out toward him\nas if warding off a blow.  He's desperate to move to her; she\nsees it on his face.\n\n<b>                     ANNE\n</b>          D'Artagnan!\n\nHer emotions break all her resolve to keep him away; she\nrushes into his arms.  They clutch each other, in an embrace\nthey have denied for many years.  They kiss hungrily.\n\n<b>                     D'ARTAGNAN\n</b>          M'lady... if anyone sees, it is\n          death...\n\n<b>                     ANNE\n</b>          If I don't kiss you, I die anyway.\n\n<b>                     D'ARTAGNAN\n</b>          I can't bear to see you cry.  What\n          is wrong?\n\n<b>                     ANNE\n</b>          Nothing... Nothing.\n\nShe draws back; he tries to hold her.  But the thoughts of\nanswering that question makes her stiffen.\n\n<b>                     ANNE\n</b>          Nothing.  This... didn't happen.  I\n          must go back now.\n\nAnd just like that, their moment is gone.\n\n<b>EXT.  GARDEN - NIGHT\n</b>\nD'Artagnan and Anne move back to the palace in a stiff\nprocession, she walking ahead, he trailing like a proper\ncommoner, several feet behind.\n\n<b>INT.  PALACE CORRIDOR - NIGHT\n</b>\nThey reach the Queen Mother's room; d'Artagnan reaches to\nopen the door for her, and she keeps her eyes lowered.  But\nbefore he can let her go, he must whisper...\n\n<b>                     D'ARTAGNAN\n</b>          Anne...!  I know... I know that to\n          love you is treason against France.\n          But not to love you... is treason\n          against my heart.\n\n<b>                     ANNE\n</b>          Then we will both die traitors,\n          d'Artagnan.\n\nWith those whispered words hanging in the air, she enters her\nroom.  And d'Artagnan moves alone, back to his.\n\n<b>INT.  MICHELLE'S BEDROOM - NIGHT\n</b>\nThe King is trying to make love with Michelle -- but she\nisn't responding.  He stops, exasperated.\n\n<b>                     LOUIS\n</b>          What is wrong?\n\nShe says nothing.  He tries kissing her again.\n\n<b>                     LOUIS\n</b>          What is wrong?!\n\nShe begins weeping uncontrollably, and turns from him.\n\n<b>                     MICHELLE\n</b>          Raoul... Oh, Raoul...\n\n<b>                     LOUIS\n</b>          Listen, my darling... Raoul was\n          a... a good friend.  And now he is\n          dead and that is very sad but --\n\n<b>                     MICHELLE\n</b>          We'll burn in hell.  Both of us.\n\nThe King stands; he's had enough of this.\n\n<b>                     LOUIS\n</b>          No, my love.  You will burn in hell,\n          for your sins.  But I will not --\n          for I am King.  My position is\n          ordained by God.\n\nHe snatches the gold coverlet from her bed to cover his naked\nbody and stalks to his stairway; the embroidered coverlet\ntrails behind him like a regal train in a royal procession.\nLeaving her weeping, he moves down into...\n\n<b>INT.  THE KING'S BEDCHAMBER - NIGHT\n</b>\nThe King angrily stalks around his bedroom, too agitated to\nsleep.  He grabs food from the table by the window, and\nstarts to pop a grape into his mouth when he stops.  He sees\nsomething out the window; it stops him dead cold.\n\nIt is a man, standing in the gardens, wearing an iron mask.\n\n<b>                     LOUIS\n</b>          D'Artagnan!  Guards!\n\n<b>EXT.  GARDENS - OUTSIDE THE KING'S WINDOW - NIGHT\n</b>\nThe apparition ducks into the shadows.\n\n<b>INT.  PALACE - D'ARTAGNAN'S ROOM - NIGHT\n</b>\nD'Artagnan is sitting on his cot thinking of all that has\njust happened when he hears the king's shouts of alarm.\n\n<b>                     LOUIS' VOICE\n</b>          Help!\n\nIn an instant d'Artagnan is reacting, snatching up his sword\nand racing out into the corridor, toward the King's room.\n\n<b>INT.  CORRIDOR - NIGHT\n</b>\nThe guards outside the King's room find the door latched from\nwithin, and they don't know what to do... D'Artagnan, running\nup, never slows down; he crashes into the doors.\n\n<b>INT.  THE KING'S BEDCHAMBER - NIGHT\n</b>\nThe King whirls as the doors explode inward and d'Artagnan\nbarrels through.\n\n<b>                     LOUIS\n</b>          Out there!  Look!  Out there!  He --\n\nThe garden is empty.\n\n<b>                     D'ARTAGNAN\n</b>          I just left the garden, it was\n          empty.  What did you see?\n\n<b>                     LOUIS\n</b>          It... was nothing.  A nightmare,\n          nothing more.  Go away, I --\n\nD'Artagnan guides his guards out, but glances back to see the\nKing, ashamed and worried.  D'Artagnan tells his men --\n\n<b>                     D'ARTAGNAN\n</b>          Check the garden.\n\n<b>EXT.  GARDEN - OUTSIDE THE KING'S WINDOW - NIGHT\n</b>\nAn old Jesuit priest slips back into the garden chapel where\nthe nuns have returned to pray.  He kneels at a back pew,\ntucking the iron mask deep within his robes.  The young\nMusketeers who move through the garden glance into the\nchapel, see only the normal piety, and move on.  The old\npriest crosses himself, bows his head, and smiles.\n\n<b>                                                  CUT TO:\n</b>\n<b>CLOSE - PHILLIPPE'S EYES, THROUGH THE SLITS OF THE MASK\n</b>\nThey are frightened.  As we PULL BACK we see the Iron Mask,\nin an OVERHEAD POV... Phillippe is lying on his back, his\nhead resting on an anvil.  Athos stands close by, lending\nsupport; Aramis and Porthos look on.  A blacksmith stands\nover Phillippe.  He positions the point of his chisel against\nthe lock of the mask.  It takes several ringing hammer blows\n-- which we experience from a POV WITHIN THE MASK -- before\nthe lock breaks.\n\nAthos, as gently as he can, pries open the iron mask.\n\n<b>PHILLIPPE'S FACE\n</b>\nis a wretched sight, overgrown with a matted tangle of hair\nand beard, and with a deathly pallor.\n\nPhillippe sits up, lifting his head out of the mask.  He\nlooks at the Musketeers, watching them for their reactions.\nAt first they are frozen; then there is recognition, awe.\n\nPhillippe sees a cooling bucket beside the forge, and looks\ndown into THE SURFACE OF THE WATER, at his REFLECTION.\n\n<b>                     PORTHOS\n</b>          Aramis!  Athos!  He looks exactly\n          like... exactly like...\n\n<b>                     ARAMIS\n</b>          I will answer all your questions.\n          But first soap, water, and a razor.\n\n<b>INT.  THE MANOR HOUSE'S MAIN DINING ROOM - DAY\n</b>\nAramis and Porthos are sitting at the table when Athos ushers\nin --\n\n<b>PHILLIPPE, CLEANED UP\n</b>\nThe change in him is remarkable, and his face so identical to\nthe King's that Porthos actually jumps.  Phillippe takes a\nseat opposite Aramis, and looks around, wary, vulnerable.\n\n<b>                     ARAMIS\n</b>          Yes.  Identical.\n\nAramis' eyes are aflame as he looks across at Phillippe.\n\n<b>                     ARAMIS\n</b>          The greatest secret of life is who\n          we truly are.  Now I must give you\n          that secret, which has been kept\n          from you your whole life.  It began\n          on the night when Louis was born.\n\n<b>                     PORTHOS\n</b>          I remember that night.  D'Artagnan\n          was drunk, the only time I've seen\n          him that way.  The three of us were\n          reveling, remember, Athos?\n\n<b>                     ARAMIS\n</b>          But I was on duty...\n\n<b>IN FLASHBACK...\n</b>\nWe see the shadowy Musketeer we saw in the opening, moving up\nthe dark steps of the palace.  We see now it was Aramis.\n\n<b>                     ARAMIS' VOICE\n</b>          I was summoned to the royal\n          apartments.  Arrange a carriage,\n          they told me, and wait by the door\n          of the stables.\n\n<b>INTERCUT FLASHBACK\n</b>\nWe see images of that night, as we saw in the opening.\n\n<b>                     ARAMIS' VOICE\n</b>          They brought a baby from the back of\n          the palace, into the black carriage\n          I had waiting.  They had given the\n          driver instructions about where it\n          was, and I was ordered to make the\n          whole journey with the blinds of the\n          carriage drawn.\n\nIn the flashback we see the young Musketeer Aramis, his face\nshielded in shadow, handing a living bundle over to someone\nat one of the back doors of a large country house.\n\n<b>                     ARAMIS' VOICE\n</b>          I carried that baby into the\n          countryside, to a chateau, like this\n          one.  And there I left him.\n\n<b>ARAMIS IN THE PRESENT\n</b>\n<b>                     ARAMIS\n</b>          I have never forgotten that night,\n          or what I carried.\n\n<b>                     PORTHOS\n</b>          I don't understand.  What does this\n          have to do with...?  You carried a\n          baby somewhere, it's unusual, but --\n\n<b>                     ARAMIS\n</b>          Not just a baby, Porthos.  I carried\n          the child of the king.\n\n<b>                     PORTHOS\n</b>          The child of the king is... the\n          king.  Louis!\n\n<b>                     ARAMIS\n</b>          No, not Louis!\n\n<b>                     PORTHOS\n</b>          Athos, do you understand this?  He\n          confuses me --\n\n<b>                     ARAMIS\n</b>          I carried the king's child!  The\n          queen had twins that night, and one\n          of them was sent away, in secret!\n\n<b>                     PORTHOS\n</b>          But why?\n\n<b>                     ARAMIS\n</b>          Because the old king had a twin as\n          well, and through his whole reign\n          his brother fought him for the\n          throne.  Then he had two heirs, not\n          just sons but twins.  So he decided\n          that one be put away, as if he never\n          existed.  You, Phillippe.\n\nPhillippe is pale... We DISSOLVE TO a flashback of\nPhillippe's early education in the country house.\n\n<b>                     ARAMIS' VOICE\n</b>          The old king ordered you be educated\n          and well treated, but your identity\n          kept from you and all those around\n          you.\n\nThe FLASHBACK moves to the palace, matching the narration --\n\n<b>                     ARAMIS' VOICE\n</b>          On his death bed, he revealed your\n          existence to Louis and your mother.\n          Your mother had been told by her own\n          priest that you had died at birth.\n          Somehow she blamed herself for ever\n          believing it, and she wished to\n          restore your birthright.  But now\n          Louis was king.\n\nWe see in FLASHBACK Louis wearing his new crown, plotting.\n\n<b>                     ARAMIS' VOICE\n</b>          A priest, even a Pope, he could kill\n          without hesitation, but he was\n          afraid to kill you, for his whole\n          claim to power rests on the sanctity\n          of royal blood.  So he had you\n          hidden in a way that only a monster\n          could devise.  I know, for it was I\n          who took you to prison, and the Iron\n          Mask.  Someday I will ask your\n          forgiveness.  But not until we have\n          restored to you what is yours.\n\nWe are in present time again.  All eyes are on Phillippe.\n\n<b>                     PHILLIPPE\n</b>          Restored...?\n\n<b>                     ARAMIS\n</b>          We will replace Louis with\n          Phillippe.  No one but the King\n          himself -- and now we -- knows\n          Phillippe even exists.  All we have\n          to do is switch them.\n\n<b>                     ATHOS\n</b>          Switch?!  That is your plan?  It is\n          ludicrous!\n\n<b>                     ARAMIS\n</b>          I have it all worked out.\n\n<b>                     ATHOS\n</b>          Physical resemblance is but one\n          small thing!  Louis has an\n          arrogance, a manner --\n\n<b>                     ARAMIS\n</b>          Those can be adopted --\n\n<b>                     ATHOS\n</b>          And people close to him, who --\n\n<b>                     ARAMIS\n</b>          Do you think I have not considered\n          that?  I have a plan -- and you may\n          rest assured that it is brilliant!\n\n<b>                     ATHOS\n</b>          It is not just our lives you risk\n          with this conceit of yours!  It is\n          Phillippe's as well!\n\n<b>                     ARAMIS\n</b>          Yes, and he has a choice!\n\nAramis stops thundering at Athos, and turns to Phillippe.\n\n<b>                     ARAMIS\n</b>          What about it, Phillippe?!  All that\n          time in prison, all that time you\n          suffered, was it for nothing?!  You\n          memorized the entire Bible, or so\n          your priest told me!  An act of\n          survival, of defiance, of courage!\n          Your years within the mask have\n          given you reserves of strength that\n          others could not imagine.  Your home\n          was a dungeon and now you may be a\n          king, if you have the heart to make\n          it so!  Do you have the heart?\n\nPhillippe stands shakily, and faces them.\n\n<b>                     PHILLIPPE\n</b>          I will try.\n\nPhillippe walks -- nearly wanders -- from the room.\n\n<b>                     ARAMIS\n</b>          You see?  A king.\n\nAthos, with a glare at Aramis, follows Phillippe.\n\n<b>EXT.  MANOR HOUSE GARDENS - DAY\n</b>\nThe gardens are sun drenched, bursting with the beauty of a\nFrench summer.  Athos finds Phillippe there, sitting alone.\n\n<b>                     ATHOS\n</b>          Recent hours have been a shock.\n\n<b>                     PHILLIPPE\n</b>          Perhaps not as much as you might\n          imagine.  When tutors answered every\n          question except those about who I\n          was.  When I was imprisoned in a way\n          no other man had ever been, I knew\n          there was something different about\n          me.  But a king...\n\n<b>                     ATHOS\n</b>          Phillippe... there is something I\n          hope you understand.  Terrible\n          cruelty has been used against you.\n          And... you must understand that you\n          did nothing to deserve it.\n\n<b>                     PHILLIPPE\n</b>          There is... wrath... in me.  I have\n          learned to hide it.  Those years in\n          the cell, I dreamed that freedom\n          would someday just happen, the way\n          the mask happened.  Now I am free.\n          And with each free breath I feel the\n          growing desire to make someone\n          suffer for all I lost.  Look at\n          this, all this that for ten years I\n          could not see!  What if I become a\n          king -- a king no different from my\n          brother?\n\n<b>                     ATHOS\n</b>          The desire for vengeance... can be a\n          poison.\n\n<b>                     PHILLIPPE\n</b>          What is its antidote?\n\n<b>                     ATHOS\n</b>          I suppose... it is to remember there\n          are many people who have never been\n          in a prison, who pass such beauty\n          every day, and never see it.\n\nPhillippe reaches to a flower, plucks it, and smells it.  He\nlooks around at the beauty of the garden, taking it all in.\nAthos looks around too; then Athos realizes Phillippe is no\nlonger looking at the garden, but at him.\n\n<b>                     PHILLIPPE\n</b>          You look so sad.  Is it something I\n          have done?\n\n<b>                     ATHOS\n</b>          It is something I have done -- or\n          did not do.\n\n<b>                     PHILLIPPE\n</b>          What is that?\n\n<b>                     ATHOS\n</b>          I did not share beauty with\n          someone... who is no longer here for\n          me to share beauty with.\n\nBefore Phillippe can pursue this, Athos turns businesslike.\n\n<b>                     ATHOS\n</b>          We have much to do, we'd best get\n          started.  Now suppose you were to\n          walk into a garden, as a king...\n\n<b>INT.  MANOR HOUSE DINING ROOM - NIGHT\n</b>\nAramis is having dinner; he calls toward the kitchen.\n\n<b>                     ARAMIS\n</b>          More wine!\n\nAthos enters and sags into a chair, his energy spent.\n\n<b>                     ARAMIS\n</b>          How is he?\n\n<b>                     ATHOS\n</b>          Resting, he's had a long day.\n          Aramis --\n\n<b>                     ARAMIS\n</b>               (calling out)\n          More wine!!\n\n<b>                     ATHOS\n</b>          You must reconsider this plan.\n          Phillippe is like a child, he --\n\n<b>                     ARAMIS\n</b>          You can do it.\n\n<b>                     ATHOS\n</b>          In a year, maybe two, I could teach\n          him enough to --\n\n<b>                     ARAMIS\n</b>          Three days.\n\n<b>                     ATHOS\n</b>          Three days??!!\n\n<b>                     ARAMIS\n</b>          The King is having a ball, a\n          masquerade ball.  It is the perfect\n          opportunity and perhaps our only\n          one.  At any time Phillippe could be\n          discovered, and what then?  Remember\n          France.  Remember the poor.\n          Remember Raoul.  More wine!!  Where\n          are those serving girls...?\n\n<b>EXT.  CHATEAU - NIGHT\n</b>\nAs Aramis and Athos are downstairs arguing, we PAN UP to the\nwindow of a candlelit bedroom...\n\n<b>INT.  CHATEAU BEDROOM - NIGHT\n</b>\nWe PAN from the window to the bed... where Porthos is making\nlove -- or trying to.  We see his huge, bare, broad back,\nblotting out all view of his partner.  He grunts, then roles\nover in despair -- revealing not one but three serving girls\nlying beneath him, jammed side-by-side like firewood, all\nnearly smothered by Porthos' bulk.\n\n<b>                     PORTHOS\n</b>          It's no use.  My sword is bent.\n\n<b>                     SERVING WOMAN\n</b>          It'll be all right.  You're just\n          taking a while to get started.\n\n<b>                     PORTHOS\n</b>          No, it's dead.  I am useless.\n\nPorthos heaves himself out of bed.\n\n<b>EXT.  CHATEAU - NIGHT\n</b>\nWhile Aramis and Athos are visible through the window,\narguing and gesturing, Porthos -- still naked -- walks across\nthe moonlit courtyard, to the barn.\n\n<b>INT.  DINING ROOM - NIGHT\n</b>\n<b>                     ATHOS\n</b>          Phillippe -- he's very bright, he's\n          perceptive, but he is in such\n          turmoil --\n\n<b>                     ARAMIS\n</b>          You grow fond of him.  That's good.\n\n<b>                     ATHOS\n</b>          Don't play God with me, Aramis I --\n\nAthos interrupts himself as he glimpses the naked Porthos\nmoving across the courtyard toward the barn.\n\n<b>                     ARAMIS\n</b>          Go on.\n\n<b>                     ATHOS\n</b>          But -- what is Porthos doing?\n\n<b>                     ARAMIS\n</b>          Going into the barn naked -- or so\n          it appears.\n\nWe INTERCUT Porthos in the barn with Aramis and Athos in the\nhouse...\n\n<b>IN THE BARN\n</b>\nPorthos, alone within the barn, finds a thick plow rope and\nfashions a noose.\n\n<b>IN THE HOUSE\n</b>\n<b>                     ARAMIS\n</b>          Now.  You were saying?\n\n<b>                     ATHOS\n</b>          But -- what is he doing?\n\n<b>                     ARAMIS\n</b>          About to hang himself, I should\n          think.\n\n<b>IN THE BARN\n</b>\nPorthos throws one end of the rope over the central beam of\nthe barn, and ties the other end off.  He shoves a milking\nstool up below the noose, climbs onto it, and fits the noose\naround his neck.  NOTE: When we see him in full view it is\nonly from behind -- and this angle is a sight to behold.\n\n<b>IN THE HOUSE\n</b>\nAramis' detachment only aggravates Athos' excitement.\n\n<b>                     ATHOS\n</b>          Hang himself?!\n\n<b>                     ARAMIS\n</b>          He's threatened to do it, it's been\n          building up in him for months.\n\n<b>                     ATHOS\n</b>          We must stop him!\n\n<b>                     ARAMIS\n</b>          Come now, Athos, if Porthos is\n          determined to end his life, then he\n          will certainly manage to find the\n          opportunity.\n\n<b>                     ATHOS\n</b>          But -- but --\n\nAthos jumps up and makes for the door -- but Aramis' hooded\nhelpers, at a signal from Aramis, bar his way.\n\n<b>IN THE BARN\n</b>\nPorthos, grave with drama, utters his last words...\n\n<b>                     PORTHOS\n</b>          A'dieu, cruel life!  Farewell to\n          useless Porthos!\n\nHe steps off the stool.\n\nHis great weight drops.  The rope snaps taught.  The beam it\nis tied to snaps like a twig -- right in the place where it\nhas been sawn nearly in half already.\n\nPorthos falls unencumbered and slams butt first into the\nfloorboards of the barn, cracking them.\n\n<b>ARAMIS AND ATHOS\n</b>\ncan hear the crack from where they're sitting.\n\n<b>                     ARAMIS\n</b>          I sawed the main beam in half.\n\n<b>IN THE BARN\n</b>\nThe chain reaction has just begun.  The broken floorboards\nbuckle, and the barn's walls, deprived of their central\nsupport, fall in on each other.\n\n<b>IN THE FRONT ROOM\n</b>\nAthos and Aramis watch wide-eyed as the whole barn completely\ncollapses around the unfortunate Porthos.  Athos gives Aramis\na look.\n\n<b>                     ARAMIS\n</b>          I'm a genius -- not an engineer!\n\nThey jump up and run out.  The commotion draws others too --\nespecially the three wenches Porthos had been trying to bed.\n\n<b>THE COLLAPSED BARN\n</b>\nIt's a tangle of debris -- and from the size and weight of\nthe pile, it looks as if no one could live through the\ncollapse.  For a moment the whole pile lies silent; then\nsuddenly it bursts apart and Porthos emerges, exploding with\nanger.\n\n<b>                     PORTHOS\n</b>          Aramis!!  You did this, didn't you!\n          You knew I would try hanging myself,\n          and you sawed the beam!  Admit it!\n          Admit it, by God!!  ADMIT IT!!!\n\nPorthos' eyes are bulging; he's terrifying in his fury.  And\nhe holds one of the broken barn's timbers like a giant club,\nready to bash in Aramis' brains.  Aramis is totally casual.\n\n<b>                     ARAMIS\n</b>          Well of course I knew it, Porthos.\n\nPorthos stands there, blinking.\n\n<b>                     ARAMIS\n</b>          You've been moping for months.  Now\n          that you've gotten the idea of\n          killing yourself out of the way, you\n          can stop boring me and start being\n          useful to me.  Now get some rest.\n\n<b>                     PORTHOS\n</b>          Well... Well... Okay.\n\nPorthos starts back toward the house.  Then one of the\nserving girls, heading back inside, sees in one of the upper\nwindows -- the face in the Iron Mask.  She SCREAMS --\n\n<b>                     WENCH\n</b><b>          AAAAAAHHHHHHH!\n</b>\nPhillippe shies back from the window now, but it's too late,\neveryone has seen him.  Aramis, with cold intellectual\ncuriosity, quietly observes the women's reaction, even as his\nhooded helpers scurry from the shadows to calm the frightened\nlocals.\n\n<b>                     ATHOS\n</b>          Poor Phillippe!\n\n<b>                     ARAMIS\n</b>          The mask is terrifying... especially\n          when unexpected.  Do you notice?\n\n<b>                     ATHOS\n</b>          All I noticed was that Phillippe\n          feels even more like an animal.\n\nAthos hurries in; Aramis looks at Porthos.\n\n<b>                     ARAMIS\n</b>          See, Porthos -- secrets are hard to\n          keep.  We don't have much time.\n\n<b>INT.  PHILLIPPE'S BEDROOM - NIGHT\n</b>\nAthos enters to find Phillippe in a corner of the bedroom,\nslumped and ashamed in the darkness, holding the mask.\n\n<b>                     PHILLIPPE\n</b>          I've worn this mask so long, I\n          couldn't sleep without it.\n\n<b>                     ATHOS\n</b>          I will sit with you.  I can't sleep\n          either.\n\nAthos settles into a chair, as Phillippe lays the mask aside\non the table and closes his eyes.  Athos looks toward the\nflames of the fireplace, and in their dancing shadows he sees\nthe face of Raoul.  Phillippe's voice interrupts --\n\n<b>                     PHILLIPPE\n</b>          Athos...?  Thank you for being my\n          guide... back into the world.\n\nAthos had not thought of it that way.  Phillippe closes his\neyes again, and falls asleep.\n\n<b>INT.  PHILLIPPE'S BEDROOM - MORNING\n</b>\nLight falls on Athos' face; it is dawn.  He hears the whinny\nof horses, and looks out the window to see a carriage about\nto leave.  Reacting quickly, he hurries out quietly.\n\n<b>EXT.  CHATEAU - MORNING\n</b>\nAramis and Porthos are already loaded into the carriage, as\nAthos runs up.\n\n<b>                     ATHOS\n</b>          Where are you going?!\n\n<b>                     ARAMIS\n</b>          Paris.  There is still much to do.\n          We'll be back soon.  Be ready.\n\n<b>                     ATHOS\n</b>          But Aramis -- !  Phillippe can learn\n          in time, but --\n\n<b>                     ARAMIS\n</b>          He can learn to be Phillippe in\n          time.  But first he must learn to be\n          Louis, and for that he has two more\n          days.\n\n<b>                     ATHOS\n</b>          What you're asking is impossible!\n\n<b>                     ARAMIS\n</b>          I offer you the perfect revolution.\n          A revolution without bloodshed,\n          without any loss of life, even\n          without treason, for he too is the\n          son of the King.\n\n<b>                     ATHOS\n</b>          But --\n\n<b>                     ARAMIS\n</b>          You said you'd do anything, Athos,\n          anything to replace this King.  So\n          do it.\n\nAramis motions to the driver, who snaps the reins and drives\nthe horses away.\n\nAthos, wide-eyed and alone, watches the carriage roll away.\nHe turns back toward the house, and see's Phillippe looking\nout the window -- without the mask.\n\n<b>INT.  MANOR HOUSE - DINING ROOM - DAY\n</b>\nAthos and Phillippe are having breakfast.\n\n<b>                     ATHOS\n</b>          No, wait, do not hold your goblet\n          that way.  With a king it is... so.\n\nHe shows him, pinching the goblet between thumb and\nforefinger, as the other three fingers extend daintily.\n\n<b>                     ATHOS\n</b>          It is not to be dainty.  Servants\n          have touched the King's goblet, so\n          he will touch it as little as\n          possible.\n\nPhillippe tries it and the goblet slips from his fingers,\ncrashing onto his plate and spilling onto everything.\n\n<b>                     PHILLIPPE\n</b>          I am so sorry!  Forgive me, I --\n\n<b>                     ATHOS\n</b>          No!  Do not be sorry!  Never be\n          sorry!  The King cares for nothing\n          and for no one!  There are no\n          mistakes when you are King!  What\n          you do is right for every person!  A\n          King has contempt for everyone!\n\n<b>                     PHILLIPPE\n</b>          Is that the king of king you wish me\n          to be?  Or do you say this because\n          of your son?\n\n<b>                     ATHOS\n</b>          How did you know -- ?\n\n<b>                     PHILLIPPE\n</b>          Porthos told me.\n\nFor a moment Athos can say nothing; then he shoves back from\nthe table and storms from the room.\n\n<b>INT.  COUNTRY MANOR HOUSE - ATHOS' ROOM - NIGHT\n</b>\nAthos is pacing in his room, all alone, rehearsing the things\nhe wants to say to Phillippe.\n\n<b>                     ATHOS\n</b>          I am not... I am not angry with you.\n          You understand?  Good.  Now, as to\n          acting like a king, we wish you to\n          be a good king.  But at first... at\n          first you must pass as Louis, and\n          Louis is cold and cruel.  So you\n          must stop looking at people with\n          such softness.  It is... not Kingly.\n          The eyes of a King say that all he\n          cares about is himself, and your\n          eyes -- how do I tell him this -- ?\n          You eyes... ask so much.  You\n          shouldn't care about me, about my --\n          about...\n\nAthos' voice breaks, his body sags.\n\n<b>                     ATHOS\n</b>          Oh Raoul, my son... my son...\n\nAthos weeps.\n\n<b>INT.  MANOR HOUSE - DAY\n</b>\nPhillippe sits alone in the parlor; he looks up as Athos --\nhis face washed, no sign of grief -- marches in.\n\n<b>                     ATHOS\n</b>          Come, we have much to do.\n\n<b>MONTAGE - ATHOS TRAINING PHILLIPPE\n</b>\n-- They practice sword fighting, Athos being sure that\n   Phillippe knows Kingly posture...\n\n-- They rehearse holding court, with Athos showing Phillippe\n   how to sit in a chair like a King on his throne, and then\n   Phillippe trying it, with Athos then playing the roll of a\n   courtesan paying homage...\n\n-- They rehearse courtly dancing; and as they stumble, both\n   of them feeling embarrassed and ridiculous, they laugh.\n\n<b>EXT.  PARIS STREET - NIGHT\n</b>\nAramis' carriage rattles to a stop, the hooves of the horses\nsounding hollow on the cobblestones.  They are near the same\narea where the riots occurred; now, at night, everything\nlooks deserted.  Aramis steps from the carriage.\n\n<b>                     ARAMIS\n</b>          Coming?\n\n<b>                     PORTHOS\n</b>          What use am I?\n\n<b>                     ARAMIS\n</b>          We go someplace dangerous.\n\n<b>                     PORTHOS\n</b>          Why didn't you say so?\n\nPorthos steps out with him, and Aramis leads the way down a\ndark, spooky alley.\n\n<b>EXT.  PARIS BACKSTREETS - NIGHT\n</b>\nThey walk through the murky darkness of Paris' backstreets.\n\n<b>                     PORTHOS\n</b>          It is good to be out on a mission\n          again... We are out on a mission,\n          aren't we?\n\nAramis grunts non-committally, lost in thought.\n\n<b>                     PORTHOS\n</b>          You're right.  Tell Porthos nothing.\n          He needs to know nothing, for he is\n          useless.\n\nJust as he says this a sinister form steps from the shadows\nand blocks their way.  He holds a knife.  Another ROBBER with\na sword rises from a doorway beside them.\n\n<b>                     ROBBER\n</b>          Your money or your life.\n\nAramis looks bored; Porthos stands blinking in surprise.\nThen a third robber steps up behind them, cocking a pistol.\n\n<b>                     THIRD ROBBER\n</b>          Make it quick, old man!\n\n<b>                     PORTHOS\n</b>          Old?  Old?!  You're all trying to\n          rob us because you think we're old?\n\nThe man with a sword steps forward to hack Porthos down, but\nPorthos spins, slapping the pistol, making it BOOM but miss;\nhe kicks the swordsman in the groin, then smashes his head\nagainst the alley wall; he backhands the gunman.  The robber\nwith the knife tries to run; Porthos snatches a barrel from\nthe street and hurls it into the fleeing robber's back; he\nfalls in a heap.\n\nPorthos' fury has just begun.  He picks the fallen gunman up\nby the throat, slams him stomach down across a broken alley\ncart, and with one sweep of his mighty hand Porthos snatches\ndown the man's pants.\n\n<b>                     PORTHOS\n</b>          Old?!  I'll show you old!!\n\nPorthos snatches the pistol from the cobblestones.  We see\nthe shock and terror on the robber's face as he feels\nsomething shocking happen behind him.\n\n<b>                     PORTHOS\n</b>          Let's see you rob somebody with your\n          pistol there!\n\n<b>                     ARAMIS\n</b>          Come on...\n\nAramis, acting as if nothing happened, leads Porthos away.\n\n<b>                     PORTHOS\n</b>          I have to tell you something.  I\n          love Paris!\n\nAramis has found what he's looking for:  a filthy brothel.\n\n<b>                     ARAMIS\n</b>          Here we are.\n\nAramis leads Porthos inside.\n\n<b>INT.  BROTHEL - NIGHT\n</b>\nSleazy whores lounge around, women at the very bottom of\nlife.  They stir and try to look more appealing as the two\nwell dressed gentlemen enter.\n\n<b>                     PORTHOS\n</b>          Aramis... These are... these are\n          whores!\n\n<b>                     ARAMIS\n</b>          So was Mary Magdalene, and our Lord\n          loved her.\n\n<b>                     PORTHOS\n</b>          Did she have tits like that?\n\nA greasy, disgusting PIMP shuffles over.\n\n<b>                     PIMP\n</b>          What do you want?  White?  Black?\n          Both?\n\n<b>                     ARAMIS\n</b>          No.  We want you, Father Belles.\n\nThe pimp reacts with fury, drawing a pistol.\n\n<b>                     PIMP\n</b>          Get out!  Now!  I will kill you\n          where you stand!\n\nAramis slowly falls to his knees, before the pimp.\n\n<b>                     ARAMIS\n</b>          Bless me, Father, for I have sinned.\n\nThe pimp -- the former Father Belles, the same man we saw as\nthe priest who prayed with the Queen at the royal birth in\nthe opening -- shoves his pistol at Aramis' face.\n\n<b>                     PIMP\n</b>          Don't!  Get out!\n\n<b>                     ARAMIS\n</b>          I have sinned.  And no other\n          priest's assurance of forgiveness\n          can mean as much as yours.  Tell me\n          that I can be forgiven, no matter\n          what I have done.\n\nAramis' eyes are hypnotic, staring deep into the fallen\npriest's soul.  Porthos is bug-eyed, certain Aramis' head is\nabout to be blown apart.\n\n<b>                     PORTHOS\n</b>          He's going to kill you, Aramis.\n\n<b>                     ARAMIS\n</b>          Then let him kill me, if all my\n          faith is wrong.\n\nHe stares at the pimp.  The pimp's finger trembles on the\ntrigger.\n\n<b>                     ARAMIS\n</b>          I have come to help you make it\n          right.  I have come to take you\n          home.\n\nThe pimp shakes convulsively; he drops to his knees, bows his\nhead, and weeps.\n\n<b>EXT.  STREETS OF PARIS - NIGHT\n</b>\nAramis' carriage rattles through the dark streets; we play\nthese secret movement sequences with an ominous, Jack-the-\nRipper quality.  The carriage pulls into...\n\n<b>INT.  CATHEDRAL COURTYARD - NIGHT\n</b>\nThe priests scurry out to meet it.  First Aramis emerges,\nthen Porthos -- but the appearance of the pimp surprises the\ncathedral priests.  They cross themselves.\n\n<b>                     PRIESTS\n</b>          Father Belles!\n\nCrossing themselves, they embrace the prodigal priest; one\nMONK kneels before Aramis.\n\n<b>                     MONK\n</b>          You have made a miracle!\n\n<b>                     ARAMIS\n</b>          God makes miracles.  You make\n          dinner.\n\nAs Aramis strides toward the dining room, a Jesuit hurries up\nto him.\n\n<b>                     JESUIT\n</b>          The ball has been rescheduled -- for\n          tomorrow.\n\nAs Aramis hears this in surprise --\n\n<b>                                                SMASH TO:\n</b>\n<b>EXT.  ROADS - NIGHT\n</b>\nThe carriage thunders through the countryside, back toward\nthe manor house.\n\n<b>EXT.  MANOR HOUSE - DAY\n</b>\nAthos and Phillippe sit at a table in the shade of a tree; on\nthe table is a model of the palace which Athos is using to\ndrill Phillippe on the palace's layout.\n\n<b>                     ATHOS\n</b>          These rooms are yours.  Up these\n          stairs -- or through this hidden\n          passage -- is the room of your\n          mistress... Michelle.\n\n<b>                     PHILLIPPE\n</b>          Whose rooms are those?\n\n<b>                     ATHOS\n</b>          Your mother's.\n\nThey are interrupted as the carriage bearing Aramis and\nPorthos clatters in.  Aramis is out immediately.\n\n<b>                     ARAMIS\n</b>          Change the horses!  Clear out\n          everything!  NOW!!\n\n<b>INT.  CARRIAGE - ROLLING - DAY\n</b>\nThe three Musketeers, plus Phillippe, are hurrying back\ntoward Paris.\n\n<b>                     ATHOS\n</b>          Aramis, this will never --\n\n<b>                     ARAMIS\n</b>          Louis is planning a visit to the\n          Vatican, then who knows where after\n          that.  If we miss him now we may not\n          get another chance.\n\n<b>                     ATHOS\n</b>          But --\n\n<b>                     ARAMIS\n</b>          It presses us but it is good for us\n          too!  Louis' whims make him more\n          vulnerable.  We are less ready, but\n          so are his guards!\n\n<b>                     PORTHOS\n</b>          D'Artagnan, unready?\n\n<b>                     ATHOS\n</b>          At a ball, everyone watches the\n          King!\n\n<b>                     ARAMIS\n</b>          But what if something extraordinary\n          happened?  Something so unusual that\n          all the attention went to someone\n          else?  Someone whose confirmation of\n          Phillippe the King would never be\n          questioned.\n\n<b>                     PORTHOS\n</b>          Who?\n\n<b>                     ARAMIS\n</b>          The Queen Mother.  Anne.\n\nAnd Aramis leans forward to tell them his plan...\n\n<b>EXT.  PALACE - DAY\n</b>\nTeams of servants are filing in and out of the palace with\nfood and flowers, decorating the ballroom for the ball that\nevening.  In contrast, Anne and her devout retinue of nuns\nmove in single file toward the garden chapel.\n\n<b>INT.  GARDEN CHAPEL - DAY\n</b>\nThe nuns kneel at the altar as Anne enters the confessional.\n\n<b>INT.  CONFESSIONAL BOOTH - DAY\n</b>\n<b>                     ANNE\n</b>          Bless me Father, for I have sinned.\n\n<b>                     FATHER BELLES\n</b>          So have I.\n\nHe slides open the partition window between them.\n\n<b>                     ANNE\n</b>          Father Belles -- ?!\n\nHe taps a silencing finger to his lips.\n\n<b>                     ANNE\n</b>          They told me you were dead.\n\n<b>                     FATHER BELLES\n</b>          I was.  I see you are still a woman\n          of faith.  I have come back to ask\n          you if you believe that one lie can\n          poison your whole life... and one\n          truth can put it back together\n          again.\n\nAnne stares at the eyes of the priest, back from hell.\n\n<b>INT.  PALACE - KING'S ROOM - DAY\n</b>\nAs Louis' tailors outfit him in a dazzling gold peacock\ncostume, complete with a jeweled mask at the end of a wand,\nhe amuses himself by looking out the window at the beautiful\nyoung women arriving early for the ball.\n\n<b>                     LOUIS\n</b>          It shall be interesting tonight.\n\nD'Artagnan enters, looking concerned.\n\n<b>                     D'ARTAGNAN\n</b>          Your Majesty.  This ball, with an\n          open invitation to the nobility of\n          Paris -- we have no way of\n          checking --\n\n<b>                     LOUIS\n</b>          You will protect me as you always\n          have, d'Artagnan.\n\nThrough the window Louis sees more beautiful young women.\n\n<b>                     LOUIS\n</b>          By the way, Claude -- inform\n          Mademoiselle Beaufort that she will\n          be moving from her rooms --\n\nHe looks up to see that Michelle has entered through the open\ndoor behind him.\n\n<b>                     LOUIS\n</b>          Never mind, it seems we have already\n          told her.\n\nBut Michelle's appearance brings him up short.  It is not the\ncruel brush-off; she is already harshly different:  her eyes\nare red from crying, her lips are tight in anger.\n\n<b>                     MICHELLE\n</b>          Murderer!  Murderer!\n\nShe holds a letter, crushed in her hand.\n\n<b>                     MICHELLE\n</b>          I wrote Fromberge!  Under your seal!\n          I wrote as you, demanding to know\n          why he disregarded my order to keep\n          Raoul from danger!  He writes back:\n          \"But your Majesty!  Your last letter\n          ordered me to put him in front of\n          the cannon!\"\n\nShe hurls the crumpled letter into his face.  Everyone is\nfrozen, silent.  She staggers toward Louis as if to attack\nhim, then falls to her knees, weeping.  No one helps her...\n\nExcept d'Artagnan.  He kneels, hugs her shoulders, helps her\nto her feet, and guides her toward her room.  But d'Artagnan\nlooks back once, toward Louis.\n\n<b>                     LOUIS\n</b>          Hysterical woman.\n\n<b>                     CLAUDE\n</b>          Sire, misuse of the royal seal -- !\n\n<b>                     LOUIS\n</b>          She'll be gone tomorrow.\n\nAs d'Artagnan and Michelle move out, they pass Anne, coming\nin.  Anne and d'Artagnan exchange a look; he remembers to\ngive her a respectful nod, but she moves past, into the\nKing's dressing room.  Louis is surprised.\n\n<b>                     LOUIS\n</b>          Mother -- ?\n\n<b>                     ANNE\n</b>          May I speak with you?  Alone?\n\n<b>                     LOUIS\n</b>          I am preparing for a ball!\n\n<b>                     ANNE\n</b>          We haven't visited in three years.\n          And we should have privacy.\n\nExasperated, Louis waves his attendants away.\n\n<b>                     LOUIS\n</b>          What is it, mother?\n\n<b>                     ANNE\n</b>          I wish to discuss your brother.\n\n<b>                     LOUIS\n</b>          He is dead!  By God's choice!  There\n          is nothing to discuss.\n\n<b>                     ANNE\n</b>          First they told me he had died at\n          birth.  Then your father admitted he\n          was alive, but well cared for, in\n          secret.  But the message that told\n          of his death said he had been a\n          prisoner.\n\n<b>                     LOUIS\n</b>          I am King, Mother!  And I do not\n          wish to discuss this with you.\n\n<b>                     ANNE\n</b>          He was my blood -- and I demand to\n          know what happened to him.\n\n<b>                     LOUIS\n</b>          Why would you ask now?  You never\n          asked before!\n\n<b>                     ANNE\n</b>          Because I have dreamed of him.  Not\n          as the baby they took away, but as a\n          man.\n\n<b>                     LOUIS\n</b>          You have prayed too much.  Your mind\n          is weak.\n\nAvoiding her stare, Louis lifts a plaster bust of his father,\nits eyes like the sightless pupils of Greek gods.\n\n<b>                     ANNE\n</b>          I believe in dreams, Louis.  They\n          are our souls speaking to us, from\n          that world beyond our eyes.  And\n          that son I never saw in daylight was\n          standing in the moonlight of my\n          dreams.  And he wore an iron mask.\n\nWe see her from a low angle, from a POV behind Louis -- and\nwe see the plaster bust burst upon the marble floor.\n\n<b>                     LOUIS\n</b>          It -- it doesn't matter, Mother!  He\n          is dead now!  Dead!\n\n<b>                     ANNE\n</b>          Yes.  Dead.  Two nights ago.  The\n          night of my dream.\n\nAnd the night of Louis' \"dream.\"  Anne begins to walk out.\n\n<b>                     LOUIS\n</b>          If... if he was wearing an iron mask\n          in your dream, then how could you\n          know he was your son?\n\nLouis smiles; he thinks he has her.\n\n<b>                     ANNE\n</b>          Then you did do it, Louis.  You did\n          put your brother in an iron mask.\n\nAll the blood is gone from Louis' face.  Anne walks from the\nroom, past Louis' waiting tailors.  He snaps at them.\n\n<b>                     LOUIS\n</b>          I have a ball to attend!\n\nThey rush in.  As they scurry about, dressing him in gold,\nLouis' composure returns; he stares at himself in the golden\nmirror, likes what he sees... and smiles.\n\n<b>EXT.  ROAD - NIGHT\n</b>\nAramis' carriage pulls off the road and into the trees.  The\nMusketeers and Phillippe pile out, to find another much\ngrander carriage there waiting.  Aramis ushers them into it.\n\n<b>                     PHILLIPPE\n</b>          Whose carriage is this?\n\n<b>                     PORTHOS\n</b>          It was mine.  But since you are\n          about to be the king, it is yours.\n\nThe new carriage lurches away.\n\n<b>INSIDE THE NEW CARRIAGE\n</b>\nare bundles of elaborate clothes.\n\n<b>                     ARAMIS\n</b>          Phillippe first.\n\nThey begin to dress Phillippe in a masquerade costume.\n\n<b>                     ARAMIS\n</b>          Remember, Phillippe... nobility is\n          born in the heart.\n\n<b>                     ATHOS\n</b>          Hold your goblet with two fingers.\n\n<b>                     PORTHOS\n</b>          And make love as if you don't care.\n          The way Kings do.  And fart whenever\n          you wish.\n\nAramis tucks a note into Phillippe's pocket.\n\n<b>                     ARAMIS\n</b>          Remember, all you have to do is get\n          through tonight.  Smile and nod a\n          lot, and if you get stuck just wave\n          and announce, \"Continue.\"  In the\n          morning you hand this note to\n          d'Artagnan, pardoning Athos and\n          instructing that he, Aramis and\n          Porthos be brought to the palace as\n          your advisors.  And all is well.\n\nPhillippe nods; everyone's nervous.  Aramis grabs more\nclothes and hands them out.\n\n<b>                     ARAMIS\n</b>          Now the rest of us.\n\n<b>EXT.  THE PALACE - NIGHT\n</b>\nCarriages disgorge guests, wildly attired for the masquerade\nball.  Porthos' carriage pulls in among them.\n\n<b>INT.  PALACE BALLROOM - NIGHT\n</b>\nA magnificent masquerade ball is in full swirl; the dazzling\nlight of chandeliers bounces off the gilt ceiling and\nsparkles on the jewels of swirling dancers, their numbers\nmultiplied in the polished mirrors that line the walls.\n\nThe King is dancing and laughing with sexy young ladies.\nD'Artagnan stands to the side of the ballroom, ever watchful,\never remote.\n\nAs the dancers swirl, each one wearing a distinctive mask in\nthe garish style favored by the French nobility of the\n1600's, we see one particular couple -- a large man, with an\nexcessively large woman.  They are dancing vigorously, and as\nthey take a break behind a huge pillar, they lift their masks\nenough for us to see that the man is Aramis, and the \"woman\"\nis Porthos.\n\nFrom the folds of their elaborate costumes they both withdraw\nreplicas of the iron mask that Phillippe once wore.\n\n<b>                     PORTHOS\n</b>          D'Artagnan watches everything.  We\n          have to be lucky.\n\n<b>                     ARAMIS\n</b>          We will make our own luck tonight...\n          if Phillippe holds up.\n\nAramis peers across the ballroom, to where Athos and\nPhillippe mix among the revelers, using thin sticks to hold\nbroad masks to their faces.  Behind the masks we see their\neyes -- Athos' intense, Phillippe's nervous and darting.\n\n<b>                     ATHOS\n</b>          Stay calm, you're doing fine.\n\nThen Phillippe's eyes go strangely still; he sees, for the\nfirst time in his life, his twin brother, the King.\n\n<b>                     PHILLIPPE\n</b>          My brother...\n\nLouis dances the minuet, prancing as if he is the center of\nthe universe; but this bliss is broken when one of the\ndancers who swirls by him -- it is Aramis -- lifts the\nbaroque outer mask he's wearing and reveals an iron mask\nbeneath.\n\nThe King staggers, stopping.  The sight stuns him, confuses\nhim; he looks around but the wearer of the mask has\ndisappeared among the weaving patterns of dancers.  Louis'\nhands dart to his eyes:  are they playing tricks on him?\n\nSeeing his reaction, Phillippe whispers --\n\n<b>                     PHILLIPPE\n</b>          He knew.  He knew what they did to\n          me.\n\nThe YOUNG BEAUTY dancing with Louis notices him falter.\n\n<b>                     YOUNG BEAUTY\n</b>          What is wrong, your majesty?\n\n<b>                     LOUIS\n</b>          Nothing, I -- continue.\n\nLouis rejoins the dancing... and then sees, on the balcony\nabove him, a different person -- a huge \"woman,\" Porthos --\nwho lifts off an outer mask to reveal an iron mask below.\n\n<b>                     LOUIS\n</b>          There!  Do you see it?\n\n<b>                     YOUNG BEAUTY\n</b>          See what, Majesty?\n\nPorthos has slipped away from the railing when the King looks\nback up; the young beauty sees nothing, and turns back to the\nKing with a look that questions his sanity.\n\nD'Artagnan notices the King's reaction -- though he did not\nsee the glimpse of the iron mask -- and is just as baffled as\neveryone else when the King turns and staggers away.\n\n<b>                     D'ARTAGNAN\n</b>          Your Majesty...?\n\n<b>                     LOUIS\n</b>          ... tired.  Must... lie down.\n\nThe music splatters to an awkward stop; Louis hurries out,\nleaving his partner abandoned in the center of the ballroom,\nwith everyone staring as if she just ruined the party.\n\n<b>                     D'ARTAGNAN\n</b>          Carry on, everyone...\n\nThe music begins again, and the party goers, not knowing what\nelse to do, politely continue.\n\nAthos draws Phillippe away from the ballroom, into a side\ncorridor.\n\n<b>AT THE FOOT OF THE STAIRS TO THE BALCONY\n</b>\nPorthos waddles down stairs, and meets Aramis.\n\n<b>                     ARAMIS\n</b>          Quick, to the passages.\n\nThey hurry in the same direction Athos and Phillippe went.\n\n<b>INT.  PALACE HALLWAY - OUTSIDE THE KING'S BEDROOM - NIGHT\n</b>\nD'Artagnan catches up to the King as he is entering the door\nof his royal apartment.\n\n<b>                     D'ARTAGNAN\n</b>          Your Majesty, is there anything -- ?\n\nThe King shuts the door in d'Artagnan's face.\n\n<b>INT.  THE KING'S BEDROOM - NIGHT\n</b>\nThe King falls upon his bed, pressing his hands to his head.\n\n<b>INT.  PALACE CORRIDOR - NIGHT\n</b>\nThe three Musketeers and Phillippe move quietly up a stairway\nand to the door of a room.  Phillippe whispers...\n\n<b>                     PHILLIPPE\n</b>          The room of the King's favorite\n          mistress?\n\n<b>                     ATHOS\n</b>          She will be at the ball.\n\n<b>INT.  MICHELLE'S APARTMENT - NIGHT\n</b>\nThe door opens and they move in; it is in fact empty, though\na mess.  They move to the wall, where Aramis, after a little\nlooking, locates the levers to open the wall/door to the\nKing's secret passageway.  Aramis enters first, the others\nfollow.  We half expect Michelle to pop up at any moment, but\nthe Musketeers enter the passage without incident.\n\n<b>INT.  SECRET PASSAGES - NIGHT\n</b>\nAramis silently leads the others through the secret passage,\nto the portal into the King's bedroom.\n\n<b>INT.  KING'S BEDCHAMBER - NIGHT\n</b>\nThe King is lying on the bed; we see him from the POV of\nsomeone approaching him slowly, silently.  When his eyes open\nin panic, it is too late... We see Aramis, Athos, Porthos\nfrom the KING'S POV as they swarm him.\n\n<b>                     ARAMIS\n</b>          It is Judgment Day.\n\nHis fist drops into frame... Louis loses consciousness.\n\n<b>LOUIS' POV\n</b>\nas consciousness returns.  He see Phillippe in Louis'\nclothes.  Aramis, Athos and Porthos bow and say...\n\n<b>                     MUSKETEERS\n</b>          Your Majesty.\n\nLOUIS, still on his bed, now wears Phillippe's clothes.\n\n<b>                     LOUIS\n</b>          Wh-- Wha--\n\n<b>                     ARAMIS\n</b>          Don't look so shocked, Phillippe.\n          Come, you're going back to prison.\n\n<b>                     LOUIS\n</b>          Phillippe?!  Why do you call me --\n\nNow Louis understands everything.  He tries to struggle, but\ninstantly Porthos shoves a rag into his mouth.\n\nAramis opens the main door a crack, and sees d'Artagnan has\nentered his room down the corridor, through whose open door\nhe can guard the approaches to the King's rooms.  Aramis\nshuts the door again and turns to the others.\n\n<b>                     ARAMIS\n</b>          D'Artagnan guards the hallway!  You\n          must go back the way we came!\n\nAthos puts his hands on Phillippe's shoulders.\n\n<b>                     ATHOS\n</b>          Now, your Majesty.  It is time.\n\nAramis and Porthos bow again to Phillippe -- now dressed and\nlooking exactly like the King.  Phillippe's mouth is dry; he\nswallows hard, and follows Athos up the hidden stairs.\n\n<b>INT.  MICHELLE'S BEDCHAMBER\n</b>\nAthos and Phillippe move to the door; they stop there, and\nAthos adjusts Phillippe's costume one more time.\n\n<b>                     ATHOS\n</b>          You know the way.\n\nPhillippe nods, tremendously nervous.\n\n<b>                     ATHOS\n</b>          You have your note?\n\nPhillippe pats his pocket, like a boy being sent off to his\nfirst day at school.  He surprises Athos, hugging him.  Then\nPhillippe opens the door and walks slowly down the hallway.\nAthos stands at the door and watches him go, all alone.\nAthos whispers, though Phillippe can't hear...\n\n<b>                     ATHOS\n</b>          You have the heart of a king.\n\nReluctantly, he shuts the door behind Phillippe.\n\n<b>IN THE HALLWAY, FOLLOWING PHILLIPPE\n</b>\nas he conducts himself through the ornate corridor, down the\ngilded staircase... and into --\n\n<b>INT.  BALLROOM - NIGHT\n</b>\nPhillippe enters the ballroom, and the reappearance of the\n\"King\" draws new attention.  Everyone in the dazzling\nballroom seems to stop and look straight at Phillippe.\n\nPhillippe freezes.  Stares, everywhere, stares!  For what\nseems an eternity, he can't move.\n\nBut then he raises his hand and says --\n\n<b>                     PHILLIPPE\n</b>          Continue.\n\nAs if by magic the music plays, the dancing resumes.\nPhillippe moves to the throne and takes his place upon it.\nHe seems to have made it; people glance -- dancing ladies,\nyoung Musketeers, old advisors -- but no one gives him a\nsecond look.  For a moment, Phillippe feels safe.\n\nAnd then he sees Michelle, her eyes glassy and riveted upon\nhim.  She wears her most beautiful gown -- the first one\nLouis gave her -- but one shoulder strap dangles sloppily.\nHer lips and cheeks are awkwardly rouged, her hair is mussed;\nshe is drunk.  She weaves her way to him and curtsies\nelaborately.\n\n<b>                     MICHELLE\n</b>          My gracious noble lord...\n\nPhillippe's heart is pounding; he looks around for help.  He\ncan only guess who this woman is.  The advisors have now\nnoticed her; Claude quickly dispatches orders to keep the\nparty going along, and waves guards over.\n\n<b>                     PHILLIPPE\n</b>          How are you... Michelle?\n\nShe doesn't react, so he must have guessed right; but\nPhillippe knows nothing of what happened just before the\nball, and he's ambushed by her anger.\n\n<b>                     MICHELLE\n</b>          How should I be?  I came to give\n          this back to you.\n\nShe starts tearing off her dress.  Claude and the guards\nreach her; the young Musketeers grabbing her.\n\n<b>                     CLAUDE\n</b>          Fret not with this, your Majesty --\n\nBut Michelle fights, slapping, clawing -- and when one of the\nyoung Musketeers grabs her from behind, his arm to her\nthroat, Phillippe jumps up.\n\n<b>                     PHILLIPPE\n</b>          Stop!  You're hurting her!\n\nPhillippe's face shows something Louis' never did:\ncompassion.  He looks into Michelle's eyes.\n\n<b>                     PHILLIPPE\n</b>          However I have wronged you I will\n          make amends.  Whatever the cost.\n\nPhillippe could not have said anything more unlike Louis;\neveryone who heard the remark -- Claude, the guards, and\nespecially Michelle -- stare at him in frozen amazement.\n\nPhillippe realizes his blunder; they've caught him.\n\nThe MUSIC STOPS.  But the attention is not directed at the\nthrone; all eyes shift to the main doorway, where Anne has\nappeared.  She is indescribably beautiful; she wears a bright\ngown, her hair is brushed and bejeweled, she radiates the\nlight of a woman who felt old at thirty and who has\ndiscovered, at forty, that she is more stunning than ever.\n\nHer arrival draws even more attention than the reappearance\nof the King; everyone watches transfixed as she approaches.\nPhillippe sees her -- his mother.  He stands on legs that\nseem to have no bones.  His mother.\n\nShe moves to him, her eyes filling with tears.  When she is\nalmost to the throne, Phillippe falls to his knees before her\nand kisses her hand.\n\nNo one can believe it, not from this King.  Yet the moment\nstrikes them as beautiful, and they applaud happily.\n\nPhillippe and the Queen Mother rise, and guide each other --\ndepending on each other for support, to a seat, he on the\nthrone, she on a seat the servants place beside him.\n\nPhillippe gives a wave.\n\n<b>                     PHILLIPPE\n</b>          Continue.\n\nThe ball continues, the music exuberant.  Michelle wanders\naway, like a blind lamb.  Phillippe and his mother sit side\nby side, holding hands, their reunion passing in private\nbetween their clasped hands, and glistening in their eyes.\n\n<b>INT.  THE PALACE CORRIDOR - NIGHT\n</b>\nMichelle, alone and forgotten, staggers down the corridor\ntoward the King's rooms; she passes d'Artagnan's open door.\n\n<b>INT.  THE KING'S BEDCHAMBER - THE THREE MUSKETEERS\n</b>\nare tidying everything up; they have Louis gagged and trussed\nup hand and foot, his eyes flashing hatred.\n\n<b>                     ATHOS\n</b>          Don't worry, your Majesty.  We have\n          a prison for you, where you can rest\n          peacefully.\n\nPorthos drapes Louis over his shoulder, and they move into\nthe passages.  Just as they close the portal behind them, the\ndoor opens and Michelle wanders in like a zombie.  Suddenly,\nd'Artagnan is at her shoulder.\n\n<b>                     D'ARTAGNAN\n</b>          Michelle --\n\nThen he sees the room is empty; he thought Louis was here.\n\n<b>                     D'ARTAGNAN\n</b>          Where is he?\n\n<b>                     MICHELLE\n</b>          In... the ballroom.  But he isn't\n          the same man.\n\n<b>INT.  BALLROOM - NIGHT\n</b>\nAs a minuet ends, Claude raises his glass in a toast.\n\n<b>                     CLAUDE\n</b>          To King Louis!  And to Anne, the\n          Queen Mother!\n\nThe guests applaud and reach for wine glasses; servants\npresent Phillippe and Anne with champagne, and they sip --\n\n<b>                     GUESTS\n</b>          To King Louis, and the Queen Mother!\n\nEveryone drinks; Phillippe suddenly remembers to hold his\nglass in his fingertips -- and it slips through his nervous\nfingers, hitting the floor with a crash.\n\nDead silence; everyone is looking.  Then Anne drops her glass\ntoo -- and everybody does it, as if to break the glass is\npart of the celebration.\n\nAs the music begins again, Anne leans to Phillippe --\n\n<b>                     ANNE\n</b>          I retire now.  Wait two waltzes,\n          then retire to your room; and spend\n          the night in safety.  We have much\n          to talk about, and have the rest of\n          our lives to do it.\n\n<b>                     PHILLIPPE\n</b>          Good night, Mother.\n\n<b>                     ANNE\n</b>          Good night... my son.\n\nShe kisses him on the cheek; it brings tears to both of them.\nShe moves to the door, everyone bowing as she leaves.\n\n<b>JUST OUTSIDE THE BALLROOM DOOR\n</b>\nAnne encounters d'Artagnan.  He stops, so taken by the sight\nof her that no one seeing them could miss that he loves her.\n\n<b>                     D'ARTAGNAN\n</b>          Anne!  You look --\n\nRemembering himself, he bows deeply.\n\n<b>                     D'ARTAGNAN\n</b>          My Queen...\n\n<b>                     ANNE\n</b>          D'Artagnan.\n\nShe takes his hand, not caring who is watching.\n\n<b>                     D'ARTAGNAN\n</b>          I have never seen a sight more\n          beautiful than you, tonight.\n\n<b>                     ANNE\n</b>          We have much to discuss.  Tomorrow.\n\nShe moves off, toward her room.  D'Artagnan enters the\nballroom.\n\n<b>INT.  BALLROOM - NIGHT\n</b>\nD'Artagnan sees \"Louis\" sitting on the throne.  More baffled\nthan alarmed, he grabs one of the Musketeer guards near him.\n\n<b>                     D'ARTAGNAN\n</b>          How long has the King been back?\n\n<b>                     GUARD\n</b>          Some while, Captain.\n\n<b>                     D'ARTAGNAN\n</b>          He didn't pass my doorway, I was in\n          my room.\n\n<b>                     GUARD\n</b>          He must've, Captain, there is no\n          other way here.\n\nD'Artagnan stands and thinks; his mind begins to spin.\n\n<b>PHILLIPPE\n</b>\nsees d'Artagnan, staring at him... then calling more guards\nover and giving them quick instructions; the guards hurry\naway.  Then d'Artagnan moves to Phillippe, and bows.  He\nlooks at him carefully, but seems to see nothing unusual.\n\n<b>                     PHILLIPPE\n</b>          Continue.\n\n<b>                     D'ARTAGNAN\n</b>          Sire, we have an emergency -- of\n          security.  I must ask you to\n          accompany me.\n\n<b>                     PHILLIPPE\n</b>          ... The ball... Continue.\n\n<b>                     D'ARTAGNAN\n</b>          I must insist, Sire.\n\nPhillippe stands, and follows d'Artagnan from the ball.\n\n<b>INT.  PASSAGES TO RIVER - NIGHT\n</b>\nAramis, Athos and Porthos -- carrying Louis -- descend the\nsecret passages to the foundations of the palace, into a\ndrainage channel leading to the river.\n\nThey have stashed a boat there; they plop Louis into it and\nclimb in themselves.  They row toward the archway that is the\nexit to the river; the moonlit waters of the Seine glow\noutside, like a beacon of safe escape.\n\nBut the steel grate of the archway slams down just before\nthey reach it, and blades point at them from every angle of\nthe darkness.  A shielded lantern rises and its wick is\nturned up, revealing\n\n<b>D'ARTAGNAN\n</b>\nhe stands with a small contingent of young Musketeers.  His\neyes are intense, his face in agony.\n\n<b>                     D'ARTAGNAN\n</b>          My friends.\n\nThe only one they can see it d'Artagnan.  They all look at\neach other, in the small circle of light from the lantern.\n\n<b>                     D'ARTAGNAN\n</b>          Only we four, the most trusted\n          Musketeers, knew about the passages,\n          meant to keep the King safe... Your\n          Majesty...\n\nPhillippe steps out of the darkness; his eyes are full of\nshame and failure as he looks at Athos, but still he holds\non, trying to maintain the charade that he is Louis.\n\n<b>                     PHILLIPPE\n</b>          Yes...?  Why do you bring me here,\n          d'Artagnan?\n\n<b>                     PORTHOS\n</b>          The King!  Look!  It's the King!\n\nHe means Phillippe.\n\n<b>                     D'ARTAGNAN\n</b>          Then who is that lying beside you?\n\nPorthos turns and looks at Louis -- then reacts as if he's\ntotally surprised at the presence of this man tied up and\ngagged beside him.\n\n<b>                     PORTHOS\n</b>          Wh-- ?  Where did he come from?\n\nAthos grabs d'Artagnan's arm.\n\n<b>                     ATHOS\n</b>          If you ever loved me -- if you ever\n          loved honor, or anything else --\n          then stand now, and let it happen.\n\n<b>                     D'ARTAGNAN\n</b>          I cannot, Athos.  Dearly as I love\n          you, I cannot.\n\nD'Artagnan takes his dagger and cuts the ropes that bind\nLouis' hands, and the gag that has kept him from talking.\nAramis suddenly backhands Louis, knocking him flat on his\nback in the boat, and pointing to him -- Louis.\n\n<b>                     ARAMIS\n</b>          This man is an impostor.  We caught\n          him trying to impersonate the King,\n          and were just getting rid of him.\n\nLouis struggles upright.\n\n<b>                     LOUIS\n</b>          D'Artagnan, arrest them all!\n\n<b>                     ARAMIS\n</b>          Shut up, knave!\n\nAramis slaps Louis again, and pleads with his eyes that\nd'Artagnan accept their ruse.  D'Artagnan is dying inside.\n\n<b>                     D'ARTAGNAN\n</b>          Before I came here, I insisted the\n          King come with me.  The real Louis\n          would never have let me insist.\n\nSeeing they are about to be arrested, the old Musketeers in\nthe boat spring into action against their younger\ncounterparts.  Athos swats one swordsman with an oar; Porthos\nseizes the guard who has grabbed a hold of the boat and\nflings the man back into two of his comrades; Aramis grabs\nLouis by the hair and puts his dagger to his throat.\n\n<b>                     ARAMIS\n</b>          Pull them back, d'Artagnan.\n\n<b>                     D'ARTAGNAN\n</b>          You can't do it.\n\n<b>                     ARAMIS\n</b>          Pull them back!\n\n<b>                     D'ARTAGNAN\n</b>          Everyone back.\n\n<b>                     ARAMIS\n</b>          Phillippe, get into the boat.  Into\n          the boat!  Now!\n\nPhillippe obeys.\n\n<b>                     ARAMIS\n</b>          Open the gate.\n\nD'Artagnan nods to his men, and they open the iron gate\nleading out to the river.\n\nThe boat makes for the opening.  Just as it is about to reach\nit, Louis forces Aramis' hand.\n\n<b>                     LOUIS\n</b>          You will not shed royal blood!\n\nHe kicks at the boat and struggles to stand, making the boat\ntip wildly and throwing everyone in it all around.  Aramis\ndraws the dagger away from Louis' throat to keep from killing\nhim, and d'Artagnan makes a grab at Louis and drags him onto\nthe stone floor of the channel.\n\nThe boat is almost through the opening -- and Louis snatches\nat his brother, Phillippe.\n\nThe current outside the gate is rushing by, and the boat is\nalready caught in the current; it's pulling away and the\nMusketeers can't stop it.  Athos seizes Phillippe's legs and\ntries to hold him, but the pressure of the current is great,\nand now not only Louis but some of the young Musketeers are\nhelping hold Phillippe.\n\nPhillippe's legs slip out of Athos' grasp, and the boat\nflashes downriver...\n\nAramis, Porthos and Athos have escaped... but Phillippe is\ncaptured, looking into the hate-filled eyes of his twin\nbrother Louis.\n\n<b>INT.  SECRET PASSAGEWAY - NIGHT\n</b>\nLouis is angrily climbing through the passageways, back up\ninto the main floors of the palace, venting his emotions at\nd'Artagnan, just behind him; the young Musketeers with\nPhillippe, their prisoner, follow along further back.\n\n<b>                     LOUIS\n</b>          I want all these passages sealed!\n          Another stupid idea of my father's!\n          Seal them all, every one!\n\n<b>                     D'ARTAGNAN\n</b>          It shall be done, your Majesty.\n\n<b>                     LOUIS\n</b>          Even the bedchamber passages!  Let\n          none remain!\n\n<b>                     D'ARTAGNAN\n</b>          Yes, your Majesty.\n\nThey reach a doorway, and the King bangs through it, into his\nown bedchamber, still spouting anger.\n\n<b>                     LOUIS\n</b>          I was told this impostor was dead!\n\n<b>                     D'ARTAGNAN\n</b>          ... You knew you had a double?\n\n<b>                     LOUIS\n</b>          He is my brother.\n\nD'Artagnan is frozen in surprise.  Phillippe and his guards\nmove into the room; seeing him in full light, wearing Louis'\nown clothes, fans Louis' anger; he jumps forward and begins\nripping the royal garments off Phillippe.\n\nD'Artagnan forces himself between Louis and Phillippe.\n\n<b>                     D'ARTAGNAN\n</b>          I -- I thought he was but... an\n          impostor who resembled --\n\n<b>                     LOUIS\n</b>          My twin.  Which has kept him alive.\n          Until now.\n\n<b>                     ANNE'S VOICE\n</b>          No!!\n\nThey whirl to see the Queen Mother, who has entered through\nthe main door.  She hurries to the space between her sons,\nhugging Phillippe, then trying to hug Louis.\n\n<b>                     ANNE\n</b>          Louis, please -- !\n\n<b>                     LOUIS\n</b>          My guards are useless!  Take her\n          from me!\n\nHe motions to the young Musketeers to restrain her;\nreluctantly they grip the arms of the Queen Mother.\n\n<b>                     LOUIS\n</b>          What had you to do with this,\n          Mother?\n\n<b>                     ANNE\n</b>          He is your brother!\n\n<b>                     LOUIS\n</b>          He is nothing now.\n\nLouis draws a sword from the scabbard of one of the young\nMusketeers -- but d'Artagnan steps between him and Phillippe.\n\n<b>                     D'ARTAGNAN\n</b>          Your Majesty... This man before\n          you... He is royal blood, the same\n          as you.  To spill it is the one\n          thing even you cannot do.  It is\n          against the laws of God, and of\n          France.\n\n<b>                     LOUIS\n</b>          Get out of my way.\n\n<b>                     D'ARTAGNAN\n</b>          Not once have I ever asked anything\n          for myself.  I ask now.  Forgive\n          this man, this prisoner... your\n          brother.\n\n<b>                     LOUIS\n</b>          Forgive?!\n\n<b>                     D'ARTAGNAN\n</b>          Aramis, Porthos and Athos too.  I\n          know what they have done was a\n          threat against you -- and yet that\n          threat has been removed, with no\n          harm coming to your Majesty.  If\n          their passions were in error, their\n          spirits have ever been noble.\n          Forgive them.\n\n<b>                     LOUIS\n</b>          They have plotted against me!  Me!\n          The embodiment of God's will!\n\nD'Artagnan sinks to his knees before the king.\n\n<b>                     D'ARTAGNAN\n</b>          Your Majesty... Every day of your\n          life, I have watched over you.  No\n          angel could have stood a more\n          faithful vigil.  I have bled for\n          you, and have prayed, every day, to\n          see you become greater than your\n          office, better than the law.  Show\n          me now what my faith and blood have\n          purchased.  Show mercy.\n\nThe words cut into everyone:  Anne, Phillippe, the young\nMusketeers.  But Louis' eyes are cold, as he responds --\n\n<b>                     LOUIS\n</b>          You take the side of traitors?\n\n<b>                     PHILLIPPE\n</b>          Please, may I speak?  M'lord... I\n          beg that you kill me.  I release\n          you, before Almighty God, from any\n          claim of sin in taking my life.  In\n          fact I will pray that God reward you\n          for your mercy to do it.  But do not\n          -- I beg you -- return me to the\n          prison, where I have lived so long.\n\nPhillippe's plea makes Louis pause... then smile.\n\n<b>                     LOUIS\n</b>          D'Artagnan, you will hunt down\n          Aramis, Porthos and Athos, and bring\n          me their heads, or I will have\n          yours.  And as for you, Phillippe...\n          Back to the prison you shall go, and\n          into the mask you hate.\n\n<b>                     ANNE\n</b>          No, Louis!  No!\n\n<b>                     LOUIS\n</b>          Wear it until you love it.  And die\n          in it!!\n\nAnne screams, and Louis waves to the guards, who draw her\nfrom the room, as d'Artagnan sags, on his knees before the\nKing he has served so faithfully.\n\nSlowly, Phillippe lowers his head.\n\n<b>INT.  D'ARTAGNAN'S ROOM\n</b>\nD'Artagnan returns to his bare room; he sits down upon the\nbed and drops his face into his hands.\n\nThen he hears the sound, like a SCREAM, but short and\nmuffled, almost like the whelp of a kicked dog.  He lifts his\nhead sharply; where did that sound come from?  He is almost\ntoo tired, too sad, to investigate.\n\nThen the King, already shaken by the night's events, hurries\ninto d'Artagnan's room.\n\n<b>                     LOUIS\n</b>          What was that sound?!  Did you hear\n          it?  It came from Michelle's room!\n\n<b>INT.  KING'S BEDCHAMBER\n</b>\nD'Artagnan enters, ahead of Louis.  They see nothing unusual,\nand d'Artagnan moves up the hidden stairs toward Michelle's\napartment.\n\n<b>MICHELLE'S APARTMENT\n</b>\nD'Artagnan enters the room, and finds it empty -- but the\nwindow is open.  He moves toward it...\n\n<b>INT.  KING'S BEDCHAMBER\n</b>\nThe King is pacing as d'Artagnan reappears.\n\n<b>                     LOUIS\n</b>          Where is Michelle?\n\n<b>                     D'ARTAGNAN\n</b>          There.\n\nHe points to the window.  Louis shoves open the drapes and\nleaps back in horror.  Michelle has hanged herself outside\nLouis' window, the golden bunting of her bed tied as a noose\naround her neck.\n\n<b>INT.  QUEEN MOTHER'S APARTMENTS - DAWN\n</b>\nAnne has changed; she is tormented, but alive with energy,\npacing.  There is a knock at her door, and the old nun opens\nit to d'Artagnan.  The old nun leaves them alone; d'Artagnan\nmoves to Anne and takes her hands, to look into her eyes.\n\n<b>                     D'ARTAGNAN\n</b>          There were two.  Not one.  But two.\n\n<b>                     ANNE\n</b>          I couldn't tell you.  You had enough\n          to carry.\n\n<b>                     D'ARTAGNAN\n</b>          Anne... The night we had together...\n          I always wanted more.  But that one,\n          it was enough.  Enough to make me\n          love you forever.  I want you to\n          remember that... and go on.  As\n          strong as you are now.  No matter\n          what happens.\n\nHe kisses her.  She drinks in his love.  Then he stands and\nmoves to the door.  He looks back, then stares out.\n\n<b>                     ANNE\n</b>          D'Artagnan -- ?\n\nHe looks back once more; he seems to want to tell her\nsomething; but whatever it is, he can't find the words, and\nwith a last loving look at her, he walks away.\n\n<b>EXT.  ESTABLISHING THE BASTILLE - NIGHT\n</b>\nA sudden visual, establishing the Bastille, the horrific\nlegendary prison of Paris.\n\n<b>INT.  BASTILLE - NIGHT\n</b>\nPhillippe, his head covered in a burlap hood, is rushed\nthrough the twisting stairways of the prison.\n\n<b>INT.  A CELL, IN THE BOWELS OF THE BASTILLE\n</b>\nThe guards remove the hood, and Phillippe sees the cell.\nThen he sees the blacksmith there, with a new iron mask, and\nhis eyes take on a fresh horror.\n\n<b>                     PHILLIPPE\n</b>          No.  Please!  No!\n\nThe guards seize him and the blacksmith places the mask over\nPhillippe's face, as he screams.  They seal the mask with a\nsmall padlock, whose key is distinctive, and jeweled.\n\n<b>INT.  BASTILLE - LATER\n</b>\nThe two guards and the blacksmith are coming downstairs after\ncompleting their work.  Far above them, in the prison tower,\nthe cries of the prisoner echo; he sounds like a raving\nmadman now.\n\nThe two guards and the blacksmith enter an office at the base\nof the tower; the BASTILLE JAILER looks up.\n\n<b>                     BLACKSMITH\n</b>          Pay me quick, I want out of here.\n\nSoldiers, swords drawn, appear in the doorway behind them.\n\n<b>                     GUARDS\n</b>          What --\n\n<b>                     BASTILLE JAILER\n</b>          You saw the prisoner's face.\n\nUnderstanding, the blacksmith raises his hammer toward the\nsoldiers; but he is stabbed in the back by the jailer, and\nthe soldiers skewer the two guards who helped him.  A soldier\nlifts the jeweled key from the hand of a dead guard.\n\n<b>THE KEY\n</b>\nis handed to the King by Andre, the young Lieutenant.  Louis\nhangs the key around his own neck, with a thin gold chain.\n\n<b>                     LOUIS\n</b>          Now.  Where is d'Artagnan?\n\n<b>                     LIEUTENANT\n</b>          Out directing the search for the\n          traitors.\n\n<b>                     LOUIS\n</b>          When he returns, watch him.  When he\n          leaves again, you tell me.\n\nThe Lieutenant bows.  Louis smiles, and fingers the key.\n\n<b>EXT.  PARIS STREETS - NIGHT\n</b>\nSquads of young Musketeers gallop along the river, and\nthrough the dark streets around it, searching...\n\nALONG THE BACK WALL OF NOTRE DAME CATHEDRAL, three forms\nscurry through the darkness:  Aramis, Porthos and Athos,\nheaving, wheezing.  They duck into a niche of the wall to\navoid capture from another patrol galloping by.  Then Aramis\nunlocks a door in the cathedral wall and they stagger in.\n\n<b>INT.  CATACOMBS\n</b>\nThe three Musketeers struggle through the catacombs, reach\nthe chapel, and fall gasping to the floor.\n\n<b>                     ARAMIS\n</b>          Bloody hell...\n\n<b>                     ATHOS\n</b>          We can't... stay here.  That traitor\n          d'Artagnan... knows about this\n          place.\n\n<b>                     PORTHOS\n</b>          Can we eat... before we go?  This\n          excitement's given me an appetite.\n\n<b>                     ARAMIS\n</b>          Bread and wine... in that cupboard.\n\nPorthos hauls himself to his feet and turns up the wick of\nthe lantern.  The rising light reveals a note, stuck to the\ncupboard with the blade of a dagger.\n\n<b>                     PORTHOS\n</b>          A note.  Pinned with a dagger, like\n          the old days.\n\nHe removes the note, and reads...\n\n<b>                     PORTHOS\n</b>          \"Phillippe has been removed to the\n          Bastille, to the lower dungeon.  At\n          midnight tonight I will order the\n          guard changed, and will delay the\n          replacements for ten minutes.  That\n          should give you ample time.  Never\n          have I needed more to say:  One for\n          all, and all for one.  D'Artagnan.\"\n\n<b>                     ATHOS\n</b>          He lures us to capture.\n\n<b>                     ARAMIS\n</b>          He seeks redemption.\n\n<b>                     ATHOS\n</b>          You're a fool!\n\n<b>                     ARAMIS\n</b>          Perhaps.  But of d'Artagnan I am\n          certain.  What he did tonight was\n          what he told us all along he would\n          do -- be faithful to his King.\n\n<b>                     ATHOS\n</b>          So what has changed?\n\n<b>                     ARAMIS\n</b>          Perhaps he serves a different king.\n\n<b>                     PORTHOS\n</b>          What choice is there?  If Phillippe\n          is in the Bastille, then to the\n          Bastille we will go.\n\n<b>                     ATHOS\n</b>          You are right.  But it is a trap.\n\n<b>                     PORTHOS\n</b>          So what?  I'd rather die covered in\n          blood, than an old man, lying in my\n          own piss.\n\n<b>                     ARAMIS\n</b>          Then to the Bastille.\n\n<b>                     ATHOS\n</b>          To the Bastille.  And death.\n\n<b>EXT.  BASTILLE - NIGHT\n</b>\nThe stone walls rising into the Paris night seem to ooze\nevil.  The building looks impossible to get into, much less\nget out of; its doors appear to be solid blocks of wood,\nencased in stone ramparts.\n\nWe hear a sharp, echoing KNOCK; Aramis, Athos, and Porthos\nstand outside the main entrance, Athos slumped between the\nother two like a beaten captive being delivered to jail.\n\nNo one answers their knock; the three Musketeers exchange\ndoubtful glance, and Porthos knocks again.  A guard inside\nslides open a view port of the massive door.\n\n<b>                     PORTHOS\n</b>          Open up!  We have a prisoner!\n\nThe port shuts, bolts rattle, and the great door heaves open.\nThe Musketeers glance at each other again, and play their\nroles, Aramis and Porthos dragging Athos inside.\n\n<b>INT.  THE BASTILLE - MAIN COURTYARD - NIGHT\n</b>\nThe prison courtyard is murky in the darkness, and ringed by\ndoors leading into mazes of corridors to its dungeons.\n\n<b>                     GUARD\n</b>          Take him down to level three.  The\n          Captain will see to the documents.\n\nAramis and Porthos drag Athos into one of the shadowy portals\nsurrounding the courtyard.\n\n<b>INT.  BASTILLE - VARIOUS SHOTS - NIGHT\n</b>\nThe three Musketeers duck into the inky shadows; Aramis cuts\nthe bonds that hold Athos' hands, and gives him the extra\nsword he had beneath his cloak.\n\n<b>                     PORTHOS\n</b>          It worked!\n\n<b>                     ATHOS\n</b>          It's a prison, you idiot!  They\n          don't expect anyone to try getting\n          in!  The problem will come when we\n          want out!\n\nAramis shushes them, and leads them into another quiet\ncorridor.  They hear the distant bells of a church, then\nsuddenly they must scramble, as a platoon of guards carrying\ntorches troop up stairs into the corridor; the Musketeers\ndart like rats into dark nooks; as the guards pass, the\nMusketeers huddle, and the bells end their tolling.\n\n<b>                     ARAMIS\n</b>          Midnight!  We have ten minutes!\n\nThey press on, deeper into the Bastille.\n\n<b>INT.  PALACE - ANNE'S ROOM - NIGHT\n</b>\nAnne moves to the window, where she starts to kneel for her\nnightly prayer; but she stops.  Outside in the garden, far\nbelow her window, is d'Artagnan on horseback, waiting.  Their\neyes connect.  He has a single rose in his hand.  Never\ntaking his eyes from her, he places the rose on the stone\nbench of the garden, and reins his horse away.\n\nThen she understands what he was trying to tell her before,\nin the hallway; it was goodbye.\n\n<b>EXT.  PALACE GARDEN - NIGHT\n</b>\nD'Artagnan rides away quickly, passing -- without seeing --\nLieutenant Andre, who has been watching him.\n\n<b>EXT.  PARIS STREETS - NIGHT\n</b>\nThrough the night d'Artagnan gallops.  We see his destination\nin the distance:  the Bastille.\n\n<b>EXT.  THE PALACE GATES - NIGHT\n</b>\nThe great gates of the palace swing slowly open, and out ride\na whole platoon of young Musketeers, surrounding Louis\nhimself, on horseback and dressed like a soldier.\n\n<b>INT.  THE BASTILLE - VARIOUS SHOTS\n</b>\nThe three Musketeers scramble down a flight of stairs,\nthrough another corridor, down another stairway.  They pass\ncells; wretched prisoners look up, but none of them is\nPhillippe.  Then the Musketeers surprise a JAILER.\n\n<b>                     JAILER\n</b>          Hey...!\n\nBut before the man can say anything else, Porthos has crushed\nhim like a bug against the wall.  They rip the huge ring of\nkeys from the jailer's waist, and take his torch.\n\n<b>PHILLIPPE'S CELL\n</b>\nHe lies on the floor; he sees the light of a torch, coming to\nhim like sunrise... and then he hears a voice --\n\n<b>                     ATHOS\n</b>          Phillippe...?\n\n<b>                     PHILLIPPE\n</b>          How did you --\n\nThey open the door and release him -- from the cell, but not\nfrom the mask.  He tries to hug Athos.\n\nThey head back the way they came.\n\n<b>EXT.  PARIS STREETS - NIGHT\n</b>\nLouis and his platoon of young Musketeers ride through the\nstreets, scattering the paupers who sleep there.\n\n<b>INT.  BASTILLE - VARIOUS SHOTS - NIGHT\n</b>\nBack up the stairs... through one corridor... they start up\nthe second flight of stairs, then stop and scramble back.\n\n<b>                     ARAMIS\n</b>               (whispering)\n          Someone's coming!\n\nThey take cover on either side of the corridor, and lift\ntheir swords.  It's a man coming down the stairs, with a\nhooded lantern... they raise their swords to strike --\n\n<b>                     PORTHOS\n</b>          D'Artagnan!\n\n<b>                     D'ARTAGNAN\n</b>          The way is blocked above.  The\n          Captain of the Bastille has turned\n          back from the mission I sent him on,\n          and is in the courtyard with a party\n          of men.\n\n<b>                     ATHOS\n</b>          He lies.  He is here to trap us.\n\n<b>                     D'ARTAGNAN\n</b>          I came to see you safely out.  Check\n          for yourself.\n\nPorthos climbs the stairs to check; D'Artagnan looks at\nPhillippe, in the mask.\n\n<b>                     D'ARTAGNAN\n</b>          All you have suffered, I would\n          gladly have borne myself, to keep it\n          from you.\n\nAthos spits on the floor, in derision.  But Porthos comes\nbarreling back down the stairway.\n\n<b>                     PORTHOS\n</b>          D'Artagnan is right, the courtyard\n          is filling with soldiers!\n\n<b>                     D'ARTAGNAN\n</b>          This way.\n\nHe leads them quickly down a side corridor; the others have\nno choice but to follow.\n\n<b>A SIDE CORRIDOR\n</b>\nD'Artagnan leads them around another corner, into a long\ncorridor; at the end of it is a massive door.  They reach it,\nand d'Artagnan produces a set of keys marked with the royal\nseal of the Musketeers; he begins unlocking the three\npadlocks that secure the door.\n\n<b>                     D'ARTAGNAN\n</b>          Once you are through, don't stop\n          until you reach the river.\n\n<b>                     ARAMIS\n</b>          They will know you helped us, if we\n          go this way.\n\n<b>                     D'ARTAGNAN\n</b>          That doesn't matter now.\n\nThey open the door... and as they do they see Louis and his\nplatoon of young Musketeers arriving outside.\n\n<b>                     LOUIS\n</b>          There!  Stop them!\n\n<b>                     ATHOS\n</b>          Betrayed!\n\nThe young Musketeers serving the King jump from their horses\nand grab for the door; but d'Artagnan leaps forward, his\nsword flashing.  After a second of surprise, Athos, Aramis\nand Porthos jump forward too, and there is a brief, bloody\nskirmish at the door.  But the young Musketeers have\noverwhelming numbers, and firearms too; protecting Phillippe,\nthe old Musketeers draw back inside and succeed at pulling\nthe door shut and latching it quickly.\n\n<b>                     ARAMIS\n</b>          Back the way we came!\n\nThey race back up the corridor -- the four Musketeers, and\nPhillippe, in the iron mask -- and turn the corner.  They\nreach another inner door, pass through it -- and see the\nsoldiers of the Bastille coming at them.\n\n<b>                     ARAMIS\n</b>          Back!\n\nThey retreat, and Porthos slams the second door.  Like all\nthe inner doors of the Bastille, it's heavy wood, a foot\nthick, and Porthos seals it with a huger iron bar.  But\nthere's nowhere else to run.\n\n<b>                     ATHOS\n</b>          Trapped.\n\nAt the far end of the corridor, the King's young Musketeers\nhave the same keys to the outer door that d'Artagnan did, and\nthey are breaking through.  Louis and two dozen of his\npersonal bodyguard pour through the door.\n\n<b>                     LOUIS\n</b>          Charge them!\n\nThe young Musketeers obediently charge down the corridor.\n\nStepping up shoulder to shoulder -- Aramis, d'Artagnan,\nAthos, Porthos -- the four veteran Musketeers meet the\ncharge, first with pistols, then with swords, a wall between\nLouis' men and Phillippe.  The battle in the cramped confines\nof the corridor is bloody and fierce; the young attackers can\nonly get a few men into the fight at any one time, and those\nwho step before the famous veterans are cut down.\n\nLouis' young Musketeers retreat, to regroup.\n\n<b>AT LOUIS' END OF THE CORRIDOR\n</b>\nLouis is furious, jumping at Lieutenant Andre, who has\ndragged a wounded comrade back from the fight.\n\n<b>                     LOUIS\n</b>          Cowards!  Twenty run from four?!\n\n<b>                     LIEUTENANT\n</b>          The corridor nullifies our number...\n          And no one has stomach to fight the\n          Captain.\n\nLouis is disgusted by this loyalty -- and he has a solution.\n\n<b>                     LOUIS\n</b>          D'Artagnan!\n\n<b>AT THE OTHER END OF THE CORRIDOR\n</b>\nLouis' voice echoes down to the veteran Musketeers and\nPhillippe, in the Iron Mask.\n\n<b>                     LOUIS' VOICE\n</b>          I am not angry with you.  I knew you\n          would lead me to them, and so you\n          have!  Lay down your sword, and I\n          will not punish you!  I will let you\n          retire in peace -- to live out your\n          days in the countryside!  And I will\n          give your friends a swift execution,\n          if you surrender now.\n\nThe words bounce down the long corridor; then silence.\nD'Artagnan stands holding his sword, staring away from his\nfriends, toward the King and his gang of young Musketeers.\n\n<b>                     ARAMIS\n</b>          D'Artagnan.  Perhaps you should\n          accept his offer, for we are dead\n          anyway.\n\n<b>                     PORTHOS\n</b>          He is right, d'Artagnan.\n\nAthos says nothing; but when d'Artagnan looks at him, he\nlowers his eyes in shame for ever having doubted d'Artagnan's\nloyalty and friendship.\n\nPhillippe speaks up, from behind the Iron Mask.\n\n<b>                     PHILLIPPE\n</b>          Wait.  Bargain me to Louis, for all\n          your lives.  You have done your\n          best.  Let me go, and let all of you\n          find peace.\n\n<b>                     D'ARTAGNAN\n</b>          No.  Even if I could give up my\n          friends, I could never give up my\n          son.\n\nThis hits them like a bombshell -- and suddenly it all makes\nsense; d'Artagnan's loyalty to Louis, his dogged hope that he\ncould somehow influence him toward goodness.  We see their\nstunned faces, each in turn:  Athos, Aramis, Porthos, and\nPhillippe.\n\n<b>                     D'ARTAGNAN\n</b>          I never had any idea you existed...\n          until they found you.  And in all\n          that time, I never had a moment's\n          pride as a father -- until now.\n\nD'Artagnan and Phillippe embrace, lost father to lost son.\n\nFrom the heavily barred door to their rear comes a powerful\npounding; the Bastille's soldiers are trying to break it\ndown.  Time is running out.\n\nAramis looks back down the corridor toward the door to the\noutside, barred now by Louis and his young guards, their long\nmuskets bristling like spikes; and yet that way is the only\npossible hope for escape to the outside.\n\n<b>                     ARAMIS\n</b>          D'Artagnan... Those are young\n          Musketeers down there.  They have\n          been weaned on our legends.  They\n          revere us -- it is an advantage.\n          Why don't we charge them?\n\n<b>                     D'ARTAGNAN\n</b>          I trained those men myself.  They\n          will stand and fight.  But if we are\n          to die, let it be this way.\n\nHe draws his sword and points it into the air.  Aramis lifts\nthe tip of his sword to join that of d'Artagnan.  Porthos\ndoes too... and then Athos joins them.\n\n<b>                     ATHOS\n</b>          One for all.  All for one.\n\n<b>                     PHILLIPPE\n</b>          If I could have a blade, then I\n          would be please to run with you.\n\nD'Artagnan gives Phillippe a dagger.  They look at each\nother.  Then d'Artagnan begins to scream.  The others take up\nthe shout.  Then they step around the corner, and charge.\n\n<b>THE LAST CHARGE OF THE MUSKETEERS\n</b>\nWe film it in all its glory, a visual feast:  the Last Charge\nof the Musketeers.  Their capes swirl about time, their hair\nflies, their legs take on new life.\n\nAt first the young Musketeers at the end of the corridor are\nfrozen in surprise; their youthful Lieutenant is awed by the\ndashing, beautiful bravery of the thing.\n\n<b>                     LIEUTENANT\n</b>          Magnificent valor...\n\n<b>                     LOUIS\n</b>          Shoot them!  Shoot them!\n\nLouis grabs a musket from one of the reluctant soldiers and\nfires:  SSSBOOM!  With the first explosion of gunfire the\nothers pull their triggers; the powder in their weapons\nflashes and crashes...\n\nThe musket balls fly down the hallway, sparking off the stone\nwalls and floor, ricocheting, punching holes through the\ncapes and flesh... but still the Musketeers charge like the\nyoung men they once were -- still are, in spirit.\n\nIn the confines of the Bastille's stone corridor the noise is\ndeafening, and the space in front of the guards is filled\nwith the dense gray smoke of the gunpowder.  None of them can\nsee anything beyond it... and all is quiet.\n\n<b>                     LIEUTENANT\n</b>          Draw blades!\n\nThe King's Guards draw their swords, and wait; are all the\nold Musketeers dead?\n\nSlowly the figures emerge from the smoke -- in SLOW MOTION,\nwalking now, no need to run.  All are wounded, but all are\nstill alive.\n\nThe Four Musketeers, along with Phillippe, move slowly and\nsteadily toward the blades of the young Guards; a fight to\nthe death?  So be it.\n\nBut the young Lieutenant will have none of it; as one of his\nmen lifts a sword to plunge it into the chest of d'Artagnan,\nthe young Lieutenant bats the sword down, with his own.\n\n<b>                     LIEUTENANT\n</b>          Stop!\n\nHe steps forward toward d'Artagnan; but instead of thrusting\nhis sword he salutes with it.\n\nHis men follow suit, saluting and bowing to the courage of\nthese men they have grown up wanting to follow.\n\nKing Louis, for the moment, is frozen.\n\nD'Artagnan looks back at Phillippe; he has bullet holes in\ntwo different places at the edges of his clothes, but he is\nunwounded.\n\nThen d'Artagnan sees Louis, with his long dagger, leaping at\nPhillippe.\n\n<b>                     D'ARTAGNAN\n</b><b>          NO!\n</b>\nD'Artagnan throws himself between the two twins and hurls\nLouis backwards, then spins to Phillippe.\n\n<b>                     D'ARTAGNAN\n</b>          Phillippe!\n\n<b>                     PHILLIPPE\n</b>          I am unhurt --\n\nLouis bounces off the wall and thrusts back again, driving\nthe blade into d'Artagnan's back.\n\nD'Artagnan's face jolts; he staggers, his legs buckle.\nD'Artagnan falls into the arms of his friends.\n\nLouis stands holding his bloody dagger, everyone staring at\nhim:  d'Artagnan, the old Musketeers, the young ones.\n\n<b>                     PHILLIPPE\n</b>          You!  Vicious... evil...!\n\nHe leaps into Louis, overwhelming him in fury, wrenching the\ndagger from his brother's hand and gripping his throat.\n\n<b>                     D'ARTAGNAN\n</b>          Phillippe...!  No... Don't... He is\n          your brother!\n\nPhillippe releases Louis, who falls, choking, gasping.\nLieutenant Andre is surprised by what he just heard.\n\n<b>                     LIEUTENANT\n</b>          Brother...?\n\nPhillippe darts to d'Artagnan, being cradled by Athos; Athos\nlifts a hand from d'Artagnan's back; it is drenched in blood.\nD'Artagnan is dying.\n\nAthos, Aramis, Porthos... none of them can speak.  They grip\nd'Artagnan, as if through their will alone they could keep\nhis life from leaking away.  The young Musketeers stand\ntransfixed, watching their legendary Captain die.  Phillippe\nsags; his voice from behind the iron mask is torn by grief.\n\n<b>                     PHILLIPPE\n</b>          All this time... I was a lost\n          secret.  But you were hiding all\n          your loyalty, all your love.  You\n          were the Man in the Iron Mask.\n\n<b>                     ATHOS\n</b>          D'Artagnan...\n\n<b>                     D'ARTAGNAN\n</b>          Shhh.  All my life, this is the\n          death I have wanted.  To die among\n          you.  One for all... and all for...\n\nHe is gone.\n\nPhillippe rises with a slow, terrible resolve, and moves to\nLouis.  When Louis tries to rise to his feet he finds the\nblade of the young Lieutenant Andre pointed at his chest.\n\n<b>                     LIEUTENANT\n</b>          All my life, all I ever wanted to\n          be... was him.\n\nHe points to d'Artagnan.  Phillippe rips away the key that\ndangles around Louis' neck.\n\n<b>                                                  CUT TO:\n</b>\n<b>AT THE OTHER DOOR\n</b>\nwhere the soldiers of the BASTILLE'S COMMANDER are finally\nbreaking through; working the massive door aside they find --\n\nTHE KING with his guards, and Aramis, Athos, Porthos, along\nwith their prisoner, in the Iron Mask.\n\n<b>                     LIEUTENANT\n</b>          We have recaptured the prisoner.\n\n<b>                     MAN IN THE IRON MASK\n</b>          No, no!  I am your --\n\nA blow in his chest from the Lieutenant stuns the prisoner\nand drops him to his knees.  The King orders the BASTILLE\n<b>GOVERNOR --\n</b>\n<b>                     KING\n</b>          You will put this madman where no\n          one can hear his insanity.  Let him\n          be fed by a deaf mute.  But feed him\n          well, and let him have a long life\n          within the Iron Mask.\n\n<b>                     BASTILLE GOVERNOR\n</b>          And them?\n\nHe means Aramis, Porthos, and Athos.\n\n<b>                     KING\n</b>          They are my loyal servants.\n\n<b>                     MAN IN THE IRON MASK\n</b>          No!  No...!\n\nBut the guards are dragging him to the deepest, darkest\ndungeon of the Bastille.\n\n<b>                                             DISSOLVE TO:\n</b>\n<b>EXT.  LANE OF ELMS - BESIDE THE PALACE - DAY\n</b>\nAt the end of a lane of elms, where the markers of king's\ngraves stand clustered, royal workmen place a mighty marble\nmonument stone above the final resting place of d'Artagnan.\n\nAthos, Aramis, Porthos, and the King -- Phillippe, known as\nKing Louis now -- stand gathered there, as Aramis in his\npriest's garments utters the funeral incantations.  Aramis'\nvoice breaks as he does so.  Porthos' eyes pour out rivers of\ntears.  Athos' grief is beyond weeping.\n\nPhillippe holds the arm of his mother.  She holds the rose\nd'Artagnan left her.\n\n<b>                     ARAMIS\n</b>          Amen.\n\nAthos moves up between Aramis and Porthos, and links them\nwith his arms.\n\n<b>                     ATHOS\n</b>          He was the best of us all.\n\nAramis and Porthos move off together, to walk the lane of\nelms; Athos remains by the grave, unable to leave.\n\nPhillippe pats Anne's arm.\n\n<b>                     PHILLIPPE\n</b>          I will be with you in a moment,\n          Mother.\n\nShe too moves down the lane of trees, touching the tip of the\nrose pedals to her lips as the tears run down her face.\n\nPhillippe moves up to Athos.\n\n<b>                     PHILLIPPE\n</b>          After all you have done, I must ask\n          you one more service to your king.\n          I have lost my father.  And you have\n          lost your son.  Let me love you like\n          a son to a father.  And I pray you\n          live for this, to love me like your\n          son.\n\nAthos can't speak; he can only nod yes.  Phillippe moves to\njoin his mother, leaving Athos to take one final look down at\nthe grave.  Then as Athos moves off to join Aramis and\nPorthos, we PAN from the name \"D'ARTAGNAN\" on the stone, to\nthe pattern chiseled beneath the name.\n\nIt is a mask, of iron.\n\n<b>                                                FADE OUT.\n</b>\n\n\n\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Man in the Iron Mask</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Randall Wallace\" title=\"Scripts by Randall Wallace\">Randall Wallace</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Man in the Iron Mask Script.html#comments\" title=\"Man in the Iron Mask comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:10:55.336523"}