{"title": "Mariachi, El", "film_link": "/Movie Scripts/Mariachi, El Script.html", "script_link": "/scripts/Mariachi,-El.html", "info_raw": "\n\nMariachi, El Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Robert Rodriguez\nGenres  Action  Crime  Thriller  Western\n\nRead \"Mariachi, El\" Script\n\n\n", "script": "\n                                                     FADE IN:\n\nEXT. A JAIL IN MEXICO - DAY\n\nIt's an early Friday morning and a patrol car drives up an\nunpaved road and parks next to a gutted police car on cinder\nblocks. The camera pans with the OFFICER as he exits his car\nand walks up to a ramp leading to the babay blue JAIL HOUSE.\nHe is carrying a greasy bag of fast food.\n\nINT. JAIL LOBBY - DAY\n\nThe Officer enters the lobby, tosses the bag of food to his\nPARTNER who is sitting at a desk. He grabs a tin cup and\nwalks over to barred entrance to Block A. Twenty or so\nCRIMINALS, from drunks to drug dealers are sleeping\npeacefully in their cell on Block A. The Officer rattles the\ntin cup between the entrance bar.\n\nINT. JAIL CELLS - DAY\n\nThe inmates stir, rubbing their dirty faces and trying to sit\nup. The camera dollies slowly down the narrow hallway of the\nblock which has three cells: Two small ones side by side, and\none bigger cell that faces the block entrance. The sound of\nscribbling and business dealing can be heard from inside the\ncell. It is AZUL jottin ginto a business ledger while\nchatting on his cellular phone. His cell is equipped with a\nsmall desk and a refridgerator. He hangs up the phone and\ncontinues writing.\n\nINT. JAIL LOBBY - DAY\n\nThe Officer with the tin cup sits in a couch across from his\npartner, who is now eating, and reads a magazine.\n\nINT. JAIL CELLS - DAY\n\nAzul picks up his phone and makes another call. He talks\nbusiness. In the other cell, prisoners are getting up and\nlooking around. Azul hangs up the phone and writes.\n\nEXT. EL MOCO'S RANCH - DAY\n\nA gorgeous, bikini-clad BABE struts slowly into a tighly\nframed glamour shot. She pauses, takes a deep breath, then\ndives a 'perfect ten' dive into a house-side moat. She swims\nlong, slow motion strokes around the moat as the camera\ntracks alonside her, lovingly admiring her tan lines and\nhydrodynamic build. She slides out of the water and walks up\na cobble stone walk, dripping as she passes a seated\nGENTLEMAN in a white suit. His face is unrevealed. As she\nenters the house, he sets his drink down by a phone. He lifts\nup the receiver and dials.\n\n                                                             2.\n\n\n\nINT. JAIL CELLS - DAY\n\nAzul's phone rings. He looks up at it, startled, as if no one\nhas ever called him before. He glances at his watch, and then\nback at the phone, hesitating to answer it. He looks around\nthe cell block as if someone might be playing a trick on him.\nFinally he answers it, pausing before saying hello. It is El\nMoco.\n\n                    MOCO (V.O.)\n          Good morning, Azul. Do you know who this\n          is?\n\n                    AZUL\n              (into phone)\n          Moco... What the hell do you want after\n          all these years?\n\nEXT. EL MOCO'S RANCH - DAY\n\nMOCO is sitting on his porch drinking tequila.\n\n                    MOCO\n              (into phone)\n          We've got a lot to talk about. I'm just a\n          few town away with a whole new gang. I\n          heard you were nearby so I thought I'd\n          give you a call, amigo.\n\n                    AZUL (V.O)\n          That's sweet of you, asshole. I don't\n          suppose you could get me out of there,\n          and then maybe hand me over my share of\n          money.\n\n                    MOCO\n              (into phone)\n          Yes, I figured you'd want your money, my\n          friend. That is why I have called you. I\n          heard you were getting out soon, and\n          figured I should deal with our situation.\n          But do you really need me to help you get\n          out? From what I hear, you're running\n          quite a business out of your cell with a\n          phone and some loyal men. It keeps you\n          well protected I hear. Not a bad idea. I\n          may try that myself sometime.\n\n                    AZUL (V.O.)\n          I could stay in here and earn peanuts\n          compared to what you owe me if I were to\n          get out. So, yes, I want you to help\n          me... my friend.\n\n                                                    (CONTINUED)\n\n                                                              3.\nCONTINUED:\n\n\n                    MOCO\n              (into phone)\n          Soon my friend, soon. I'm sending you\n          some people in a few days to get you.\n\n                    AZUL (V.O.)\n          Really? Well, that's more like it. Just\n          like the Moco I used to know.\n\nAzul is walking towards his window at the sound of a truck\nracing in.\n\n                    MOCO\n              (into phone)\n          Just hang in there my friend. I won't\n          forget that you have been a big part of\n          our success. What's wrong.\n\nEXT. JAIL - DAY\n\nA large truck drives up to the jail, parking beside the\npolice car. Two tall, well-dressed MEN step out. They reach\ninto the cab and pull out machine guns. They walk briskly\ntowards the jail.\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul walks to his toilet and stands on it to see out his\nbarred window.\n\n                    AZUL\n              (into phone)\n          There's something going on outside. Is\n          this a double surprise? Are you getting\n          me out today, Moco?\n\nThere is no response from Moco.\n\nINT. JAIL - DAY\n\nThe Guard reading the magazine stands when he sees someone\napproaching the door.\n\nEXT. JAIL - DAY\n\nClose tracking shot of guns as Tall Men open the door and\nenter the jail.\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul looks out of the jail cell suspiciously. Peering down\nthe hall, he sees the guys with the guns. He hides behind the\nwall, peering out to see what happens next.\n\n                                                              4.\n\n\n\nINT. JAIL LOBBY - DAY\n\nThe Tall Men walk right up to the guard, and hand him a huge\nwad of money. The Guard tosses the money to his partner\n(still eating), then turns to unlock the block entrance bars.\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul puts the receiver back up to his mouth.\n\n                     AZUL\n              (into phone)\n          There are two men here with guns. Did you\n          send them?\n\nEXT. EL MOCO'S RANCH - DAY\n\nMoco, glancing at his watch, hangs up.\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul hangs up the phone and kicks his Bodyguard awake. The\nBodyguard gets up and peers out the bars as Azul hides in a\ncorner.\n\nINT. TALL MEN IN HALL - DAY\n\nThe Tall Men walk steady and alert, ready to kill. They enter\nAzul's block and scope out the cells.\n\nThe Bodyguard, seeing the tall men, retrieves his shotgun\nfrom under his mattress and grabs his machete from under the\nsink. He stands ready to fight.\n\nThe Tall Men move slowly towards the big cell, somewhat\ncautious. They see the Bodyguard a second too late, for he\nsticks the shotgun between the bars, and shoots one of them\nbefore they can react. The shot one stumbles back into his\nbuddy's arms. Azul's Bodyguard, amused by all this, opens his\ncell door effortlessly, and walks out as if to greet them.\nThe Tall Men hear the sound of the other cells opening, so\nthey turn around. The other prisoners on the block begin\nexiting their cells, carrying guns and Molotov cocktails. The\nTall Man drops his gun. Finally, Azul exits his cell carrying\nhis phone. The Bodyguard forces the Tall Men into an empty\ncell, closing and locking the door.\n\nAzul presses the #-button on his phone. Moco's phone number\nis automatically redialed.\n\nMoco answers.\n\n\n\n                                                 (CONTINUED)\n\n                                                              5.\nCONTINUED:\n\n\n                     AZUL\n               (into phone)\n          I'm still here, Moco. And so are your\n          little friends. But not for long. They\n          have something they want to scream to\n          you. Listen close, because you're going\n          to repeat it to me when I come to visit\n          you.\n\nINT. TALL MEN IN CELL - DAY\n\nThe cellmates throw their Molotov cocktails into the cell.\nMoco hears the men screaming as they burn to death. Azul is\nholding the phone at arm's length into the cell.\n\nINT. JAIL LOBBY - DAY\n\nThe Guards exchange glances when they hear the screaming,\nthey smile and shrug, then go back to what they were doing.\nAs Azul and his Bodyguards exit the block, the Guard with the\nmagazine stands up as if to stop them, but Azul tosses him a\nwad of money and the guard sits back down to count it.\n\nEXT. JAIL - DAY\n\nA blue truck races towards the jail.\n\nAzul exits the jail carrying a shotgun. His Bodyguards get\ninside the Tall Men's truck and start it. Azul waits\npatiently for his blue truck.\n\nAs the blue truck pulls up, two little rat-like VATOS exit\nthe blue truck, one handing Azul a guitar case. Azul tosses\nit onto the hood. The Bodyguards wave as they drive away.\nAzul waves back. He opens the case, revealing an arsenal of\nweaponry. Azul notices one piece is missing. One Rat quickly\npulls the missing weapon from his jacket and replaces it in\nthe case. Azul is unamused. He grabs his MAC-10 machine gun\nfrom the guitar case and aims it at the thieving Rat's head.\n\nSuddenly, the Guard bolts out the jail waving the wad of\nmoney, as if complaining.\n\nAzul turns his MAC-10 onto the Guard instead. A few blasts\nlater Azul and his rats pack up and go as the Guard twitches\nhelplessly on the ground, still clutching the money in his\nbloody hand.\n\nCREDIT SEQUENCE EXT. AZUL / MARIACHI ON HIGHWAY - DAY\n\nThe blue truck barels down the highway and the camera pans\nwith the truck as it passes a hitchhiker, MARIACHI, standing\nin the sun with a thumb in the air.\n\n                                                    (CONTINUED)\n\n                                                                 6.\nCONTINUED:\n\nThe truck    passes him up so he continues walking. Mariachi is\ncarrying    a guitar case in one hand and a black jacket in the\nother. He    is wearing a white T-shirt, black pants. The camera\npans to a    sign that reads \"ACUÑA 18 miles\".\n\nEXT. MAIN STREET - DAY\n\nMariachi is walking around downtown Acuña. He notices a bar\nacross the street and, liking the way it looks, he puts on\nhis jacket and crosses over to it. He stops to read a sign on\nthe building that says \"MEMBERS AND NON-MEMBERS ONLY\". He\nprays silently to himself before confidently walking inside.\n\nINT. CORONA CLUB - DAY\n\nMariachi enters the club, greeting the PATRONS    as ge makes\nhis way to the bar. No one seems to greet him    back. He sits\non a barstool near some OTHER DRINKERS, laying    his guitar\ncase down lovingly beneath his stool. He looks    around the\nplace, as if sizing it up.\n\n                       BARTENDER\n             What do you want to drink?\n\n                          MARIACHI\n             Refresco.\n\nThe other drinkers stare at him.\n\nGlancing around the room, Mariachi notices a small, table-\nshaped object draped with a cloth in one corner of the room.\n\nSitting directly behind him are four mean-looking dudes.\nMariachi is served his drink.\n\n                       MARIACHI (CONT'D)\n             No hay musica?\n\n                          BARTENDER\n                    (cleaning a glass)\n             Why?\n\n                       MARIACHI\n             I'm a mariachi. A good one. I play\n             beautiful ballads, old classic ballads,\n             on an old-fashioned guitar.\n\n                          BARTENDER\n             So what?\n\n\n\n\n                                                       (CONTINUED)\n\n                                                              7.\nCONTINUED:\n\n\n                    MARIACHI\n          I could add a little class to this place.\n          I work for fairly cheap, I live mostly\n          off tips. But I need steady work, and I\n          can guarantee bringing in more customers.\n\n                     BARTENDER\n              (nodding)\n          Tell me, why would I need one little\n          guitar player when I've already got a\n          full band?\n\nMariachi gives him a silent \"what\" look.\n\nThe BARTENDER motions to a YOUNG MAN sitting near the small\ndraped table.\n\nThe Young Man removes the drape revealing a keyboard. Puts on\nhis mariachi hat, dips his fingers into his shot glass and\nrubs his fingers together (as if warming up for the big\nshow). He hits a few switches in EXTREME CLOSEUP as...\n\n... Mariachi adjusts himself to the seat.\n\nThe Young Men gently taps one switch and the keyboard sounds\nlike an accordion, pulsing out a beat. He then presses\nanother switch and a horn section swells to a crescendo and\nwaltzes the familiar riffs. He adds the string and horns\naccents by banging on the keys. He sounds awful.\n\nMariachi grimaces slightly then turns back to the Bartender\nwho seems to enjoy it.\n\nThe Keyboard Mariachi finishes his song, sits back down.\n\n                    BARTENDER (CONT'D)\n              (nodding with satisfaction)\n          There you see? Either I can pay one guy\n          to sound like a full mariachi band...\n\nMariachi picks up his guitar and lays some money next to his\nfull drink. He looks disappointed.\n\n                    BARTENDER (CONT'D)\n          ... or I could spend the same money only\n          get one little guitar player...\n          Understand?\n\n                    MARIACHI\n              (walking away)\n          Thank you, sir.\n\n\n\n                                                    (CONTINUED)\n\n                                                              8.\nCONTINUED: (2)\n\n\n                    BARTENDER\n          You want to earn a living? Get a real\n          musical instrument.\n\nThe Bartender picks up the bottle of soda pop Mariachis left\nbehind and offers it to the other men on the table. They say\nno, pay, and leave. The Bartender offers it to the MEAN DUDES\nat the table.\n\nThey all shake their heads no.\n\nThe Bartender shrugs and dumps it.\n\nEXT. CORONA CLUB - DAY\n\nMariachi walks out and looks up and down the street. He\ndecides to walk south.\n\nAs he walks down the sidewalk, the camera pans into a CLOSEUP\nof another guitar case that is moving towards the Corona\nClub. The camera falls back a little revealing the backside\nof Azul, dressed also in black. Azul walks into the bar.\n\nINT. CORONA CLUB - DAY\n\nAzul enters the bar, notices to his left the table with the\nfour mean-looking Dudes, drinking and eating chips and salsa.\n\nThe oldest one, with his back to Azul, takes a sip from his\nmixed drink, then stands and excuses himself to the restroom.\n\nINT. BATHROOM - OLD MEAN DUDE - DAY\n\nThe Old Mean Dude walks into the first stall and sits down.\n\nINT. CORONA CLUB - AZUL - DAY\n\nThe three remaining Dudes notice Azul's guitar case. So does\nthe Bartender. They all look at each other and laugh.\n\n                    BARTENDER\n              (laughing and rolling his eyes)\n          What the hell is this, mariachi day?\n          There is no work for you here!\n\nAzul walks the mean Dude's table. Their laughing quiets down\na bit as Azul stands before them. The Bartender stops\nsmiling.\n\n                    AZUL\n          Bartender... one beer.\n\n\n\n                                                  (CONTINUED)\n\n                                                              9.\nCONTINUED:\n\n\nThe Bartender nods and grabs a frosty glass. He begins to\nfill up at the tap.\n\n                    AZUL (CONT'D)\n              (without looking at him)\n          In a bottle, wey.\n\nBartender stops filling the beer, stares at the half-full\nglass for a moment, then drinks the beer.\n\nAzul is staring at the three Mean Dudes. They stare back.\n\nThe Bartender slaps the unopened bottle down at the counter.\n\n                    BARTENDER\n          Ready.\n\nAzul doesn't pay attention to him.\n\n                    AZUL\n          I'm looking for an old friend of mine.\n          His name is... Moco. Do you know where I\n          can find him.\n\nMAIN MEAN DUDE\n\nYou can sometimes find him here. He owns this place.\n\n                    AZUL\n          So you know him?\n\nMAIN MEAN DUDE\n\nWe work for him.\n\n                    AZUL\n          That's too bad.\n\nAzul turns to the mean Dude sitting to his left, and places\nthe guitar in his hands. The Mean Dude is confused.\n\n                    AZUL (CONT'D)\n          Hold it please.\n\nAzul opens the case and pulls out the MAC-10. The other two\nMean Dudes are already reaching for their pistols.\n\nThe Bartender ducks beneath the counter.\n\nAzul fires a million bullets into two of the Mean Dudes, (the\nother is holding the case in shock). Their chests explode,\ncausing neat little dollops of flesh and blood fly\neverywhere.\n\n                                                 (CONTINUED)\n\n                                                          10.\nCONTINUED:\n\nThe Mean Dude holding the guitar case is frozen with fear. He\nmanages to look up at Azul, who is watching the Mean Dudes\ndie a slow, bloody death. The barrel of the MAC-10 is\nsmoking. Azul turns slowly to the Mean Dude holding the case.\nAzul aims his MAC-10 in the Dude's face. Still frozen holding\nthe case, he spends his last moments looking down the gun's\nbarrel.\n\nINT. BATHROOM - DAY\n\nThe shots caused Old Mean Dude to peer out from his stall as\nthe toilet paper fell to the ground and started to roll\nacross the floor. He now watches it roll as more shots ring\nout. He pulls up his pants and and walks toward the door\nslowly. He is sweating profusely. He slowly picks up the\ntoilet paper, plotting his next move. It grows silent... He\ntakes a deep breath and rushes out the door.\n\nINT. CORONA CLUB MAIN ROOM - DAY\n\nThe Old Dude bursts into the room with a roll of toilet paper\nin his hand, and a sheet of sweat sliding down his face.\n\nThe Bartender rises up from behind the counter.\n\nThe camera dollies slowly by the dead Dudes. Their blood-\nbathed faces twisted into odd shapes and expressions. The\ncamera continues to dolly to the one dead Dude still holding\nthe guitar case. His face is a bloody pulp. The camera stops\ndollying to the old Dude's mixed drink. A hand is stirring it\nwith a straw. The camera pans up the arm to reveal Azul,\nstanding expressionless with his gun sling over his shoulder.\n\nShot at 16fps the Old Dude quickly drops the toilet paper and\nruns back inside the bathroom.\n\nAzul turns to his guitar case and carefully chooses another\nweapon. He grabs the drink and tosses a napkin over his arm\nlike a waiter, then casually follows the Old Dude into the\nbathroom.\n\nThe Bartenders glance at each other. One pours a shot glass\nfull of tequila and raises it to his lips to drink it. Shots\nring out and the Bartender spills the drink over himself.\n\nWithout warning Azul bursts from the bathroom and walks\ncalmly to his case. He replaces the weapon, picks up the case\nand leaves.\n\nA few seconds pass before the bartender grabs the phone and\nfuriously dials.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                             11.\nCONTINUED:\n\n\n                    BARTENDER\n              (into phone)\n          Get me Moco!!!\n\nThe door bursts open as Azul reenters, storming to the bar.\n\nThe Bartender is so petrified he doesn't think to drop the\nphone.\n\nAzul walks right up to the Bartender.\n\nThe Bartender shuts his eyes. The sound of the beer bottle\npopping open canbe heard, along with the sound of thirsty\nguzzling. The Bartender opens his eyes to Azul.\n\nCLOSEUP of the empty bottle slamming to the counter.\n\nThe Bartender glances down at the bottle.\n\nCLOSEUP of Azul tossing a few coins near the bottle as\npayment. Azul leaves.\n\nA few seconds pass as the Bartender is standing there. You\nhear Moco yelling into the receiver asking what's going on.\n\nEXT. MOCO'S RANCH - DAY\n\nMoco is on the porch trying to get the Bartender to answer\nhim.\n\n                    MOCO\n              (into phone)\n\nWHAT'S GOING ON OVER THERE, ANSWER ME!!!\n\nINT. CORONA CLUB - BARTENDER - DAY\n\nYou hear Moco's voice through the phone. The camera dollies\ninto the Bartender as he screams into the receiver.\n\nThe camera dollies in to the corpses...\n\nEXT. CORONA CLUB - AZUL - DAY\n\n... and finally a low outdoor frontal tracking shot of Azul\nwalking away smiling as the image fades out.\n\nEXT. HOTEL COAHUILA - DAY\n\nLow angle of Hotel Coahuila sign. MEAN DUDE #5 enters the\nframe as his beeper goes off. He runs into the Hotel\nCoahuila.\n\n                                                           12.\n\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMean Dude #5 enters the lobby where an OLD CLERK is sitting\nat the counter reading a yellowed newspaper. There is a pit\nbull on the floor beside him.\n\nMEAN DUDE #5\n\nDa me telefono.\n\n                      VIEJO CLERK\n                (without looking)\n            Take it.\n\nMean Dude #5 grabs the phone and dials Moco's number. He\nglances down at the PIT BULL lying on the floor.\n\nMEAN DUDE #5\n\nPit bull?\n\n                      VIEJO CLERK\n            Yeah, pit bull.\n\nThe line is picked up and Mean Dude talks into the phone. He\npulls out a piece of paper from his coat pocket and places it\non the counter. He begins jotting down four names. He then\nslowly crosses their names out.\n\n                      MEAN DUDE #5\n                (into phone)\n            Dead?\n\nThe Viejo Clerk glances up from his paper. The Pit Bull also\nglances up.\n\n                      MEAN DUDE #5 (CONT'D)\n                (into phone)\n            All of them? How long ago? OK, What does\n            this guy look like?\n\nClerk goes back to reading his paper. Pit Bull is still\npaying attention, though.\n\nEXT. HOTEL CAOHUILA - MARIACHI - DAY\n\nSame low-angle shot of the outdoor sign displaying the name\nHotel Coahuila. Mariachi walks into frame, and pulls out his\nwallet. Mariachi pulls out a few measly bucks then seems to\nbe considering what to do next.\n\n                                                             13.\n\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nAn inside shot looking out of the front glass reveals\nMariachi looking at his wallet as Mean Dude talks to the\nphone. No one notices him.\n\n                    MEAN DUDE #5\n              (into phone)\n          ... carries a guitar case... And what was\n          he wearing?... all black...\n\nThe Pit Bull turns and looks out of the window. Seeing\nMariachi, he gets up and walks to it.\n\nEXT. HOTEL COAHUILA - MARIACHI - DAY\n\nMariachi is putting his last few dollars back into his\nwallet. As he is walking away he notices the Pit Bull and he\nbends down for a closer look.\n\n                    MEAN DUDE #5\n              (into phone)\n          Don't worry, Moco. We'll find him, and\n          we'll mess him up real good.\n              (ad lib)\n\nEXT. HOTEL COAHUILA - DAY\n\nLow shot with long lens at full zoom of Mariachi tapping on\nglass.\n\nCLOSEUP of dog responing.\n\nCLOSEUP of Mariachi tapping.\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMean Dude hangsup the phone. He writes a few more things. He\nturns to leave.\n\n                    MEAN DUDE #5\n          Gracias señor...\n\nAs he passes the camera you can see Mariachi still playing\nwith the dog. Inside view CLOSEUP of Mariachi tapping on\nglass.\n\n                    VIEJO CLERK\n          Callate, hombre!!!\n\n                    SLOW MOTION SEQUENCE (?)\n          Mariachi looks up at the Clerk, then\n          stands.\n\n                                                   (CONTINUED)\n\n                                                             14.\nCONTINUED:\n\n\nThe Mean Dude turns around and looks and looks at the Clerk.\nClerk turns to look at Mean Dude, who is walking back to the\ncounter.\n\nMariachi picks his guitar from the ground. He is in full\nview, but no one is looking at him.\n\n                    MEAN DUDE #5\n          Viejo, if you see anyone new in town,\n          carrying a guitar case, dressed in\n          black... you can call this number, OK?\n\nMean Dude writes down a phone number and the description of\nAzul on a little card.\n\n                    VIEJO CLERK\n              (nodding sarcastically)\n          And if I don't call, you'll kill me...\n\n                    MEAN DUDE\n              (handing him the card)\n          No. I won't kill you... he will...\n\nThe sarcastic smile fades from the old man. Mean Dude walks\naway. The old man reads the card, then glances out the\nwindow. Mariachi is gone.\n\nMARIACHI / MEAN DUDE #5 OUTSIDE HOTEL\n\nMariachi is turning a corner just as Mean Dude #5 exits the\nhotel. The Mean Dude walks off in the other direction.\n\nEXT. BOYSTOWN SALOON DOMINO'S - DAY\n\nMariachi enters Domino's bar. DOMINO is waiting on a few bar\nbums that are nursing their jaws. Mariachi sits with them,\nasks for a refresco, He gets looks again. Domino serves him\nand he asks to see the owner. She says he's looking at the\nowner. He then asks her for work as a mariachi. She says she\nhas no money to pay him. He looks arund the classy joint and\nknows she's lying (it turns out to be true, she has no\nmoney). When he asks how a girl can take care of herself in a\ntown like this she stuffs a gun barrel in his mouth. He\nnurses his jaw, pays and leaves, as the others laugh.\n\nMARIACHI CHECKS IN TO HOTEL - DAY\n\nMariachi enters the run-down lobby of the motel. The Viejo\nClerk at the counter is reading his yellowed newspaper.\nMariachi sees the Pit Bull laying by the counter.\n\n                      MARIACHI\n          Pit bull.\n\n                                                   (CONTINUED)\n\n                                                             15.\nCONTINUED:\n\n\n                    VIEJO CLERK\n          Yeah, pit bull.\n\n                    MARIACHI\n          I need a cheap room for a week, and I'd\n          prefer to pay you in a few days, after\n          I've found some work.\n\n                    VIEJO CLERK\n          Sí, later...\n\n                    MARIACHI\n          Thank you...\n\nThe Old Man hands Mariachi a key for the second floor.\n\n                    MARIACHI (CONT'D)\n          Thank you, friend.\n\nAs Mariachi walks away, the Clerk notices the guitar case and\nblack clothes and he rereads the card Mean Dude left him.\n\n                    VIEJO CLERK\n              (different tone of voice)\n          Uh, excuse me señor? I forgot, I need a\n          small deposit...\n\nMariachi stops in his tracks. He turns back to the Clerk\nslowly... thinking.\n\n                    MARIACHI\n              (walking back slowly)\n          You can trust me.\n\n                    VIEJO CLERK\n          I am very sorry, señor. But... how much\n          can you spare?\n\nThe dog is watching the event.\n\n                    MARIACHI\n              (disappointed)\n          I've only got a few pesos... I plan on\n          finding work in town.\n\n                    VIEJO CLERK\n              (grabbing money)\n          Oh, that's enough for now, sir, thank you\n          and... enjoy your stay.\n\nThe Clerk deposits the money, slams the register shut, and\ncontinues reading his yellow paper. Confused, Mariachi\npockets his empty wallet and turns to find his room.\n\n                                                    (CONTINUED)\n\n                                                            16.\nCONTINUED: (2)\n\nThe Clerk peeks over his paper, eyeing the guitar case as\nMariachi goes. He hears the sound of Mariachi's footsteps\ntrailing off. The old man drops the paper and bolts silently\nto the phone as he dials El Moco's phone number...\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi opens his room, tosses his guitar onto the bed and\nhangs his jacket in the closet. He has only his white T-shirt\nunderneath. He glances above the bed to a plaque bearing a\nmace and two crossed swords. He checks out the shower and\nwashes his face in the sink. He sits down on his bed. A few\nseconds later he drops back and lays there a minute before\nkicking the door shut. He tries to sleep.\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nThe Old Clerk is talking on the phone to the bad guys. He\nhangs up the phone, then reaches into the back of his counter\nfor a gun. He places it on the counter and covers it with his\nnewspaper and continues reading.\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nTop shot of Mariachi sleeping. A shot of the mace on the\nwall.\n\n                                                      CUT TO:\n\nDREAM IN BOYSTOWN - DAY (5.7 KINOPIC LENS)\n\nMariachi is suddenly sleeping in the dirt. Same top shot as\nin the hotel. He opens his eyes, then groggily he sits up.\n\nESTABLISHING SHOT of Mariachi sitting in the middle of a\nghost town. He stands up.\n\nVARIOUS SHOTS of the empty town with nothing and nobody.\n\nMedium shot dolly into Mariachi as he stands, turns and sees\na BOY bouncing a ball in slow motion. The Boy stops short,\nholding the ball tight against the chest. Mariachi glances\naround to maybe spot more people, before concentrating on the\nBoy.\n\nThe Boy places the ball carefully on the ground, then gently\nrolls it to Mariachi.\n\nTracking shot of the ball rolling to Mariachi. The ball\nsounds like a speeding truck. Mariachi smiles at the boy.\n\nCLOSEUP of the ball rolling.\n\nCLOSEUP of the Boy smiling.\n\n                                                 (CONTINUED)\n\n                                                            17.\nCONTINUED:\n\n\nMariachi bends to get the ball which makes the sound of a\nscreeching truck as it hits Mariachi's foot. Mariachi notices\nthat it's a man's severed head.\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi bolts up in bed.\n\nEXT. HOTEL COAHUILA - MEAN DUDES #5, 6, 7, 8 & 9 - DAY\n\nThe Mean Dudes jump out of their truck and rush into the\nhotel, guns drawn.\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nThe men burst into the lobby and the old men tells them the\nroom number. They run out into the courtyard with the old man\nfollowing. The Pit Bull is uninterested in the action.\n\nEXT. COURTYARD IN HOTEL COAHUILA - DAY\n\nThe Mean Dudes run up the courtyard stairs   and kick open the\nfirst door they come to and start blasting   into the room.\nScreams are heard. The men stand back, and   finally look down\nthe steps at the Viejo Clerk who is waving   his arms\nfrantically.\n\n                    VIEJO CLERK\n          127!!! Cuarto 127, pendejos!!!\n\nThey run to the room numbered 127 and cautiously stalk\ntowards it as they reload their guns.\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi is sitting on his bed listening to all this. He\nbolts to the restroom and turns to the shower.\n\nEXT. HOTEL COURTYARD - DAY\n\nShot of men still stalking, cocking pistols.\n\nPOV shot of what men see, as camera nears the door.\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi rushes out of the bathroom towards the door.\n\n                     MARIACHI'S POV\n          As camera nears the door, doorknob starts\n          to move. Remembering that he never locked\n          the door, he jumps to the side of the\n          door as...\n\n                                                             18.\n\n\n\nEXT. HOTEL COURTYARD - DAY\n\nMen kick open the door and burst into the room.\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nLow-angle shot as men burst in. There is no one in the room.\nMean Dude #5 hears the shower and motions to keep it down and\nstalk quietly... They rush into the bathroom and start\nblasting.\n\nMariachi slips out from behind the door and runs out.\n\nEXT. HOTEL COURTYARD - DAY\n\nMariachi runs out of the room and jumps off the stairwell\nonto the courtyard in front of the Clerk.\n\n                    MARIACHI\n              (pointing to his room)\n          Cuidado, viejo!\n\nMariachi darts out into the lobby. The old man watches him go\nthen turns his attention back to Mariachi's room.\n\n                    VIEJO CLERK\n              (pointing in Mariachi's\n               direction)\n          Pendejos!!!\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nThe dog watches as Mariachi tosses his keys into the cubby\nhole where they belong. Mariachi then jumps over the counter,\nbanging keys on the register to get it open.\n\nEXT. HOTEL COURTYARD - DAY\n\nThe Mean Dudes run out of Mariachi's room, dart down the\nstairs, passing the old man who is telling them where to go.\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMariachi, unable to open the register, jumps over the\ncounter.\n\nCLOSEUP of his feet as he lands, causing the register to\nburst open.\n\nMariachi truns for a second to ponder gettin ghis money or\nrisking dying, but then he checks to turn and run. Two\nseconds later the Mean Dudes run in, one jumps over the\ncounter to see if he's there.\n\n                                                          19.\n\n\n\nEXT. HOTEL COAHUILA - DAY\n\nMariachi runs atop the Mean Dudes' parked truck then jumps\ninto the bed of a passing truck. Mean Dudes run outside. The\nDudes hve their hands up as if they don't know what to look\nfor.\n\n                    MEAN DUDE #5\n          He wears black!\n\nShots of lots of people walking around, wearing black items.\n\nEXT. DOWN THE BLOCK - DAY\n\nThe truck turns a corner and the driver halts, comes out with\na gun and tell Mariachi to get the hell out of his truck.\nMariachi leaps out. He is about to continue running, but he\nstops, clenches his fists, and turns slowly as the camera\ndollies into his face.\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nCamera dollies into the guitar case on Mariachi's bed.\n\nEXT. DOWN THE BLOCK - DAY\n\nMariachi runs back in the direction of the hotel, but as he\nturns the corner he has to slow down for the Mean Dudes are\neverywhere. Each one has his gun out and is looking around\nfor the man in black. Mariachi walks slowly, whistling and\nnodding to everyone as they pass. A few look suspiciously at\nhim but continue searching. Mariachi ducks inside the hotel.\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMariachi enters the lobby and winks at the old Clerk who is\nstanding over his open register in shock. His eyes widen when\nhe sees Mariachi. He runs out of the hotel.\n\n                    VIEJO CLERK\n              (screaming, pointing inside)\n\nPENDEJOS!!!\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi rushes in, grabs his jacket and puts it on. He grabs\nhis guitar case and squeezes it tight, his eyes shut. Slow\ndolly into him, as his eyes open.\n\nCLOSEUP of plague on wall with mace and swords. He grabs the\nmace, swining it around a few times. He feels secure, now. He\nturns to leave.\n\n                                                             20.\n\n\n\nEXT. HOTEL COURTYARD - DAY\n\nMariachi rushes out the door, he looks   down and sees the Mean\nDudes entering the courtyard. He ducks   his head back just as\nthey look up to see him. Mariachi runs   up a smal flight of\nsteps, where he then tosses his guitar   onto a balcony, which\nhe then jumps over to himself.\n\nThe men rush up the steps shooting at the balcony. Bullets\nnarrowly miss Mariachi as he climbs over the balcony to\nsafety.\n\nINT. HOTEL HALLWAY - DAY\n\nMariachi dashes down the hallway out onto a balcony. He sees\nno way down.\n\nEXT. COURTYARD BALCONY - DAY\n\nThe Mean Dudes are climbing over the balcony like spiders.\nMariachi runs back and slams his guitar into the first guy to\nmake it over the balcony. His dummy falls down the stairs and\nover the narrow railing. The Dude splats on the ground in\ngruesome CLOSEUP.\n\nThe old man looks over at him as he dies, then turns back as\nif nothing happened. Mariachi bolts back down the hill.\n\nEXT. FRONT BALCONY - HOTEL COAHUILA - DAY\n\nMariachi is looking down the balcony trying to find a way to\nescape. Mariachi looks behind him.\n\nINT. HOTEL HALLWAY - DAY\n\nMean Dudes barrel down the hallway reloading the guns.\n\nEXT. FRONT BALCONY - HOTEL COAHUILA - DAY\n\nMariachi flings his mace over an electric cable, then stands\non the balcony lip, placing his guitar between his legs.\n\nEXT. STREET SHOT OUTSIDE HOTEL - DAY\n\nMariachi is sliding down the cable and turns back to see Mean\nDudes firing guns at him. Bus stops in traffic and Mariachi\ngrabs his guitar and jumps onto the hood of the bus.\n\nEXT. STREET - DAY\n\nMariachi jumps onto another car and then down into the\nstreet.\n\n\n                                                   (CONTINUED)\n\n                                                            21.\nCONTINUED:\n\n\nMean Dudes exit the hotel and chase him on foot while a few\nget in the truck and chase him. The truck takes a short cut.\n\nMariachi is running through the sidewalks and streets in\nfront os curioso shops, jumping small carts and children and\ncars to escape the two men behind him. He enters a small\ncutoff where the truck tries to stop him by heading off. The\nbad guys stick their heads and guns out of their windows and\nlaugh as they ready to shoot him. Mariachi, though, already\nhaving built momentum, runs right up the front of the trucks\nas the guys try to shoot him but not succeed in only shooting\neach other as he runs up and over the cab, into the bed, and\nonto the street. He swings his guitar case into another guy's\ngroin and grabs is gun, reaiming it to shoot Mean Dude #5.\nMariachi shoots him in the arm, and Mean Dude #5 drops his\ngun and cowers away in pain. Mariachi then turns the guy's\ngun on him and shoots him in the chest. Mariachi grabs his\ncase and as Mean Dude #5 turns to get s look at him, all he\nsees is the case coming into his face. Mariachi heads back\nfor Domino's.\n\nINT. BOYSTOWN SALOON DOMINO'S - DAY\n\nMariachi stumbles through city streets, pausing against a\ntelephone pole as he gazes at Domino's Saloon across the\nstreet.\n\nMariachi stumbles across, almost getting hit by a few cars,\nand drags himself into the saloon.\n\nINT. AMADEUS - DAY\n\nMariachi staggers into Amadeus and washes his face in a\nfountain by the door. He makes his way to the bar as a patron\npays and leaves.\n\n                    DOMINO\n          What happened to you, Mariachi? Too much\n          refresco?\n\n                    MARIACHI\n          I just killed four guys.\n\nDomino turns around and looks at Mariachi, wondering hard is\nhe's joking. He lifts up a bloody hand, grabs a napkin, and\nthen seems to ask permission with his eyes before wiping his\nhands clean.\n\n                    DOMINO\n          Is it true?\n\nMariachi nods an ashamed yes.\n\n\n                                                 (CONTINUED)\n\n                                                           22.\nCONTINUED:\n\n\nDomino reaches for her gun under the counter.\n\nThe camera is on Mariachi when she brings it out and points\nat him.\n\n                    MARIACHI\n              (exhausted)\n          Wait a minute... what's your name?\n\n                    DOMINO\n          Domino.\n\n                    MARIACHI\n          Wait a minute, Domino! It was self-\n          defense.\n\nShe cocks the pistol.\n\n                    MARIACHI (CONT'D)\n              (frantic)\n          I'm new in town. I don't know everyone!!!\n          I have no friends here... and no enemies.\n\n                    DOMINO\n              (lowering the gun a bit)\n          Thieves?\n\n                    MARIACHI\n              (nodding)\n          No way. They were well-dressed men. I\n          checked into the cheapest hotel in town,\n          no money, nothing of value, except this\n          guitar and maybe this coat, which they\n          could have taken when I left my room, but\n          they didn't. They were only interested in\n          killing me.\n\n                     DOMINO\n              (lifting the gun back up)\n          So why do you come here? You want to get\n          me killed?\n\n                    MARIACHI\n          I need a place to stay until I figure\n          this out. They've got me mixed up with\n          someone else.\n\n                    DOMINO\n          And you've never seen them before? Not\n          even in another town?\n\n\n\n\n                                                   (CONTINUED)\n\n                                                             23.\nCONTINUED: (2)\n\n\n                    MARIACHI\n              (long pause)\n          Are you saying they followed me, a\n          mariachi, here? What for?\n\n                    DOMINO\n          Maybe they hate your music.\n\nMariachi stares at her expressionless. She stares back at\nhim.\n\n                    DOMINO (CONT'D)\n          Maybe you were singing in another town,\n          they hated your voice, and now they're\n          trying to kill you.\n\n                    MARIACHI\n          Are you serious?\n\n                       DOMINO\n                 (nodding)\n          Yes.\n\nShe laughes.\n\n                    MARIACHI\n          Are you going to help me, or am I gonna\n          have to die on your porch?\n\n                    DOMINO\n          I have a room upstairs. My room. Don't\n          touch anything. I'll be up after awhile\n          and we can call a friend of mine.\n\nMariachi shakes her hand.\n\n                    MARIACHI\n          Thank you. I'll never forget this.\n\nHe tries to kiss her hand. She slides it away and\neffortlessly slaps him.\n\n                       DOMINO\n          This way.\n\nHe follows her to a doorway revealing an unlit staircase.\nWhen he enters, the darkness swallows him as she shuts the\ndoor behind him.\n\nINT. UPSTAIRS DOMINO'S LOFT - DAY\n\nMariachi enters a roomy, luxurious apartment above the main\nbar.\n\n                                                    (CONTINUED)\n\n                                                            24.\nCONTINUED:\n\nThere is a free-standing porcelain tub in the center of the\nroom. Mariachi places his guitar halfway between the entrance\nand the tub. The camera is tracking backwards with him as he\nwalks, making th room look endless. He removes his jacket as\nhe makes his way to the tub. He drops his jacket onto the\nfloor and gently climbs into the tub. The camera faces him as\nhe settles back. The camera slowly dollies into him as he\nlays back, crosses his fingers, and gives a relaxed smile.\n\nINT. AMADEUS - DAY\n\nDomino is washing a glass. She the then remembers she has the\ngun in her waist belt, so she removes it and sticks it back\nunder the counter. Wounded Mean Dude #5 comes in limping. She\ntakes out a towel and drops it on the counter.\n\n                    MEAN DUDE #5\n          Good morning, Domino.\n\n                    DOMINO\n          What happened?\n\n                    MEAN DUDE #5\n          Give me the phone. I have to call Moco.\n\nShe brings up the phone and sets it down where the cloth was.\nHe picks up the cloth and wraps his arm with it.\n\n                    MEAN DUDE #5 (CONT'D)\n          It's not as bad as it looks. Domino, has\n          anyone come through here? A stranger,\n          maybe?\n\n                    DOMINO\n          This is a border town. I get strangers\n          all the time.\n\n                    MEAN DUDE #5\n          Dressed all in black, carrying a guitar\n          case?\n\n                     DOMINO\n          No.\n\n                    MEAN DUDE #5\n          Well, he shot me... and has killed ten of\n          Moco's men... all in one day.\n\nDomino looks a little upset. She slides the phone towards him\na bit.\n\n                    DOMINO\n          Aren't you gonna call your boss?\n\n\n                                                    (CONTINUED)\n\n                                                            25.\nCONTINUED:\n\n\n                    MEAN DUDE #5\n              (nodding)\n          I have to tell Moco that he got away\n          again... So, you better give me a drink\n          first.\n\nDomino smiles and pours him half a beer mug with tequila. He\nlaughs and drinks. As he's dialing, the camera is on Domino\nas she cleans up a few things, every once in a while glancing\nupstairs.\n\n                     MEAN DUDE #5 (CONT'D)\n              (into phone)\n          Moco, he got away. Shot me in the arm.\n          Killed La Palma. Pepino, Sunday. This guy\n          is one slick maricon. Yeah. Also, I\n          didn't get a look at him. So, unless he's\n          still carrying that guitar around and\n          hasn't changed clothes, I won't even spot\n          him, and I don't think he'll be that\n          obvious...\n\n                    MOCO (V.O.)\n          Don't worry. If there's one thing I know,\n          it's that he'll always wear black and\n          he'll always carry that guitar with him.\n          It's his signature. Besides, that's not a\n          guitar he's carrying. It's a guitar case\n          full of weapons. Find him.\n\nMean Dude hangs up and puts his head in his hands.\n\n                     DOMINO\n          Que paso\n\n?\n\n                    MEAN DUDE #5\n          I screwed up. The guy left his guitar\n          case in the hotel room. We chased him\n          out, but he came back for the case.\n\n                    DOMINO\n          Maybe he loves his guitar. It's probably\n          an antique.\n\n                    MEAN DUDE #5\n          It wasn't a guitar. It was a guitar case\n          full of weapons that he uses on his\n          victims. Adios, I'm gonna take a nap. And\n          thanks for the drink.\n\nMean Dude #5 stumbles as he tries to stand.\n\n                                                    (CONTINUED)\n\n                                                          26.\nCONTINUED:\n\n\n                    MEAN DUDE #5 (CONT'D)\n          If you see this guy, call us.\n\nHe is about to walk off with the bloody towel and he turns\nback pointing at it. She waves her hand at him, as if\ngranting him permission to take it. She cleans his glass, and\nwhen he is gone she slams the glass down and runs for the\nstairs. A few seconds later she comes back into the bar,\ngrabs the gun from under the counter and calls her assistant\nto watch the bar. He sees the gun and wonders what she's up\nto. She storms upstairs.\n\nINT. DOMINO'S LOFT - DAY\n\nDomino opens the door abruptly and finds Mariachi taking a\nbath. He bolts upright, pulls a towel up from the floor and\nsits frozen waiting for Domino's next move. She laughs and\nwalks to the counter.\n\n                    DOMINO\n              (friendly)\n          I thought I told you not to touch\n          anything.\n\n                    MARIACHI\n          Sorry. I needed to relax. I can...\n\n                    DOMINO\n              (smiling)\n          No, it's alright, Finish up. Do you want\n          shampoo?\n\n                    MARIACHI\n              (laying back, closed eyes)\n          Yes, please.\n\nDomino turns to a counter and her smile fades. She looks like\nshe wants to rip Mariachi's throat out with her teeth. She\nputs the gun down on the counter. She finds an omnious-\nlooking knife and then grabs a bottle of shampoo. She walks\nover to him, then pulls the knife up to his throat with one\nhand while grabbing his hair with the other. He opens his\neyes wide. The shampoo hits the floor and begins to roll.\n\n                    DOMINO\n          Who are you?!\n\n                    MARIACHI\n              (choking)\n          I'm a musician!\n\n\n\n\n                                                 (CONTINUED)\n\n                                                             27.\nCONTINUED:\n\n\nThe shampoo bottle rolls into the guitar case and stops.\nDomino sees this, and with her foot reaches out and pulls the\ncase toward her.\n\n                    DOMINO\n          What do you have in here? GUNS? KNIVES?\n\nMariachi tries to catch his breath, pausing before answering\nher as if wondering if all this is really happening.\n\n                    MARIACHI\n          No! My guitar!\n\nDomino slides her foot out of her shoe, and unsnaps one of\nthe latches with her toe.\n\n                    DOMINO\n          We'll see...\n\nShe unsnaps another. The latches snap loud and echo in the\nquiet room. Mariachi gasps as she tightens her grip.\n\n                    DOMINO (CONT'D)\n          You're very modest, Mariachi...\n\nShe squeezes his hair and unsnaps another latch.\n\n                    DOMINO (CONT'D)\n              (through gritted teeth)\n          You told me you killed four men, when you\n          really killed seven. Or were they still\n          breathing even after you shot out their\n          hearts?\n\nAnother latch snaps.\n\n                    MARIACHI\n              (groing dizzy)\n          I'm a mariachi...\n\nSNAP!\n\n                    MARIACHI\n          ... not a murderer...\n\nSNAP!\n\n                    DOMINO\n          Aren't you going to watch?\n\nShe lifts the lid with her foot. It seems an eternity before\nthe case is fully open. Domino is looking into the case, but\nMariachi is not. He knows what's in there.\n\n                                                    (CONTINUED)\n\n                                                             28.\nCONTINUED:\n\n\n                    MARIACHI\n          I told you... I am a musician.\n\nSlow dolly into the case, which contains a white, well-kept\nclassical guitar. Domino is seeing it, and for a moment she\nalmost believes he is telling the truth.\n\nShe rushes to it, grabs the guitar and tosses it to Mariachi.\nHe catches it, choking after she releases the blade. She is\non the other side of the tub, now. She jams the knife down\nbetween Mariachi's legs. Mariachi's eyes bug.\n\n                     DOMINO\n          Play it.\n\n                    MARIACHI\n              (still choking)\n          W...w...what?\n\nDomino shoves the knife in deeper and Mariachi grimaces\nhorribly.\n\n                    DOMINO\n          Play it, damnit, play something sweet!!!\n\nMariachi is sweating and his face is extremely red. He pauses\nfor a long time before plucking an odd note. She squints as\nif she's caught him. But he eventually starts picking out a\nsweet little melody.\n\n                    DOMINO (CONT'D)\n              (growing impatient)\n\nSING!\n\nMariachi starts to sing but chokes on the words. He starts\nover, playing a \"Rancho Grande\" sounding song with his own\nmade up words.\n\n                    MARIACHI\n              (in a high sweet voice)\n          What is this place? That treats me like a\n          murderer? They've all got their heads up\n          their butts... Even this beautiful girl,\n          With a knife to my balls, Should I kiss\n          her or hit her... Or both?\n\nHe finishes his song, bowing and thanking his imaginary\naudience. Domino is smiling. She pulls the knife slowly out\nof the water and wipes it off on her apron.\n\n\n\n\n                                                 (CONTINUED)\n\n                                                            29.\nCONTINUED:\n\n\n                    DOMINO\n          You're a mariachi, all right. And a good\n          one.\n\nMariachi bows a solemn thank you.\n\n                    MARIACHI\n          I think this is the best I've ever\n          played. You... inspired me.\n\nCLOSEUP of the knife.\n\nShe laughs.\n\n                     MARIACHI (CONT'D)\n          Hire me.\n\nDomino looks at him with a silent \"what?\".\n\n                    MARIACHI (CONT'D)\n          I'm good. Hire me to play in your bar.\n          I'll work mostly from tips. But, I need\n          steady work.\n\n                    DOMINO\n          I couldn't pay you. I have no money.\n\n                    MARIACHI\n          This fancy place and you have no money?\n\n                    DOMINO\n          It's the truth.\n\n                    MARIACHI\n          I'll work for room and board, then.\n          Please, I'm desperate.\n\n                    DOMINO\n              (thinking)\n          Will I have to keep a knife at your balls\n          to get you to play like that?\n\n                    MARIACHI\n              (smiling)\n          Not if you're paying me room and board.\n          Please... until I find a permanent job.\n\n                    DOMINO\n              (thinking)\n          You won't find a permanent job in this\n          town... but OK.\n\n\n\n                                                    (CONTINUED)\n\n                                                          30.\nCONTINUED: (2)\n\n\nShe gets up slowly, and turns to leave. Mariachi settles\nback, smiling triumphantly. Suddenly she darts around and\nslams the knife between his legs again with a furious look on\nher face. He bolts up out of this triumphant daze with a look\nof complete shock. She loosens up and laughs.\n\n                    DOMINO (CONT'D)\n          You're going to need a better sense of\n          humor than that, if you're gonna work for\n          me, kid.\n\nShe flings her knife aside. It sticks into a wall. She\nshrugs, smiles a beautiful smile, turns, and goes downstairs.\nMariachi settles back down, closing his eyes. The knife slips\nout of the wall and clangs to the ground. Mariachi jumps\nagain, rolls his eyes, and sinks underwater as the picture\nfades.\n\nINT. AMADEUS - EVENING\n\nMariachi plays in Amadeus.\n\nINT. AZUL'S HIDEOUT - DAY\n\nCamera tracks past a pool table where TWO RATS are playing\nnine ball. They make a few shots, then the phone rings. The\ncamera continues to track past a small table where Azul's\nguitar case lies open. Weapons adorn it, with each knife,\neach gun in its pocket, in its own place. The camera\ncontinues tracking to a dresser on which sits Azul's cellular\nphone. A delicate female hand lifts the receiver. The camera\nis now positioned above the bed as the GIRL answers the\nphone.\n\n                    GIRL #1\n              (into phone)\n          Yes? One moment please...\n\nHe rolls over and wakes a GIRL sleeping beside her. Girl #2\ntakes the phone and passes it to a third GIRL as Girl #2\ntries to wake Azul (he is sleeping between Girls #2 and #3.).\n\nGirl #3 has the phone to her ear as if listening for\nbackground conversation.\n\nThe two Rats playing pool are staring longingly at the three\nGirls in Azul's bed. They look hungry and deprived. One hits\nthe other, signaling it's his shot. While one shoots, the\nother watches.\n\nAzul awakens and grabs the phone.\n\n\n\n                                                 (CONTINUED)\n\n                                                             31.\nCONTINUED:\n\n\n                    AZUL\n              (into phone)\n          Yeah.\n\nEXT. MOCO'S RANCH - DAY\n\nMoco is sitting in his pool. A swimming WAITER is bringing\nhim drinks.\n\n                    MOCO\n              (into phone)\n          Amigo! I'm glad I've reached you! You've\n          not answered all day. Killing ten of my\n          men must have been very time consuming!\n\n                       AZUL\n                 (into phone)\n          Six.\n\n                    MOCO\n              (into phone)\n          What?\n\n                    AZUL\n              (into phone)\n          I've only killed six! You were always bad\n          at math, Moco. I guess that's why you\n          never paid me half of the money. You\n          thought it all belonged to you.\n\n                    MOCO\n              (into phone)\n          I knew half was yours... I got greedy, my\n          friend. It's my nature. But you!!! You\n          are modest! You've killed ten of my men!!\n          I know, because I'm having them buried in\n          my yard right now. With my dogs and cats.\n\n                    AZUL\n              (counting on his fingers, into\n               phone)\n          I killed six. But don't bother counting\n          so soon. The number will triple by\n          tomorrow.\n\n                    MOCO\n              (into phone)\n          I'm sorry things turned out this way. My\n          friend. I got greedy. I should never have\n          tried to kill you. It would have been\n          cheaper for me to pay you. Now I've got\n          to find ten new men.\n\n\n                                                    (CONTINUED)\n\n                                                             32.\nCONTINUED:\n\n\n                       AZUL\n                 (into phone)\n          Six.\n\n                       MOCO\n                 (into phone)\n          Ten.\n\n                    AZUL\n              (into phone)\n          I tell you what. You give me my money,\n          and I won't kill any more of your men...\n          And I won't kill you.\n\n                    MOCO\n              (takes a sip, into phone)\n          No, it's too late for that. We're going\n          to have to see this through.\n\n                    AZUL\n              (into phone)\n          Just like the Moco I used to know. Still\n          wearing white?\n\n                    MOCO\n              (looking down at his clothes,\n               into phone)\n          What do you think?\n\n                    AZUL\n              (into phone)\n          I think you should change clothes. I'd\n          hate to ruin a white suit with your\n          stupid blood.\n\nAzul hangs up. He gets dressed and leaves. The little Rats\nare about to follow, but one Rat walks over to get one look\nat the girls. The girls tease him, and when he tries to\nadvance them, they pull guns and laugh as the Rat runs away.\n\nINT. AMADEUS - DAY\n\nDomino walks by with a trash can. Mariachi is sitting on a\nbarstool.\n\n                    MARIACHI\n          I need to get my money back from that\n          hotel. I'll be right back.\n\n                    DOMINO\n          Are you crazy? If you go anywhere with\n          that jacket and that case you could be\n          killed. Leave that stuff here.\n\n                                                    (CONTINUED)\n\n                                                             33.\nCONTINUED:\n\n\nMariachi gets up and is about to get his guitar case from\nunder the stool.\n\nMariachi leaves it under the stool and takes off the jacket.\n\n                    MARIACHI\n          I never go anywhere without it. Take care\n          of it.\n\nMariachi leaves. Domino drops the trash can and tells her\nassistant to watch the bar. She heads for the staircase.\n\nINT. DOMINO'S LOFT - DAY\n\nDomino walks out onto her balcony, peering down into the\nstreet.\n\nPOV shot of Mariachi walking through the street.\n\nDomino turns and walks to the phone. She dials a number by\nheart and sits in a plush chair.\n\nEXT. MOCO'S RANCH - DAY\n\nMoco answers the phone. Towel around his neck, wet hair.\n\nINT. DOMINO'S LOFT - DAY\n\n                    DOMINO\n              (dolly in slow, into phone)\n          Hi. It's Domino.\n\n                    MOCO\n              (into phone)\n          I know who it is...\n\nDolly into Moco.\n\nINT. HOTEL COAHUILA - DAY\n\nThe Clerk is reading a paper. He hears a noise and pulls it\naside. Mariachi is standing at the counter smiling. The Clerk\njumps in his seat, then after a few frozen seconds he sets\ndown his paper and reaches for Mariachi's old room key.\n\nMariachi shakes his head \"no\", points to the register, and\nmakes the money sign with his hand. The Clerk slowly moves\nover to the register. He depresses a few keys to open it. It\nwon't open. He makes a gesture like it's stuck or something\n(he is not very convincing). He tries again and again; each\ntime pretending to get more impatient.Mariachi glances down\nat the Pit Bull. The Pit Bull is eyeing Mariachi.\n\n\n                                                   (CONTINUED)\n\n                                                            34.\nCONTINUED:\n\nMariachi points to the Clerk as if he has an inside joke with\nthe dog (\"this guy...\"). Mariachi climbs over the counter and\nstands next to the Clerk. The Clerk things Mariachi is a\nlunatic. Mariachi holds up a finger as if cueing the Clerk\nfor a demonstration. Mariachi then leaps over the counter\nlanding firmly back on the other side of the counter.\n\nCLOSEUP of his feet landing hard, just as before.\n\nThe register opens. Mariachi shrugs, smiles, and reaches into\nthe register, taking his money out himself. He counts it.\nAfter a brief consideration, he decides to leave the old man\na tip. Mariachi waves a \"good-bye\" wave and dances out. The\nold man, still standing there with his arms outstretched as\nif he was robbed, dashes to the phone and calls Moco's men.\n\nINT. AMADEUS - DAY\n\nThe bar Assistant is cleaning the bar. He walks over to grab\na few glasses and when he returns, Azul is sitting at the\nbarstool Mariachi was on earlier. The Assistant looks around,\nwondering where Azul appeared from.\n\n                    ASSISTANT\n          Can I get something to drink or eat?\n\n                      AZUL\n          One beer.\n\nThe Assistant grabs a mug and starts to fill it at the tap.\nHe fills it halfway when...\n\n                    AZUL (CONT'D)\n          In a bottle, wey.\n\n                    ASSISTANT\n              (laughs)\n          Sorry.\n\nHe grabs a bottle and hands it to Azul, then lifts the mug,\ntoasts and drinks it straight down.\n\nAzul drinks his straight down, too.\n\n                    AZUL\n              (looking around)\n          Isn't there a girl that works here?\n\n                    ASSISTANT\n          Yeah, she owns the place.\n\n                    AZUL\n              (heading a few bills to the\n               Assistant)\n                    (MORE)\n                                                    (CONTINUED)\n\n                                                             35.\nCONTINUED:\n                    AZUL (CONT'D)\n          She owns it, now? Then she is Moco's\n          girl?\n\n                    ASSISTANT\n              (looking around)\n          So-so. She's onto this new musician.\n\nAzul takes out a few more bills and hands them to the\nAssistant, and begins to stand up.\n\n                       AZUL\n          Thank you.\n\nEXT. STREET - DAY\n\nMariachi is out on the streets, returning to Domino's.\n\nEXT. BOYSTOWN SALOON - DAY\n\nAs he crosses the street he notices Azul leaving the saloon\nwith a guitar case. Mariachi runs into the saloon.\n\nINT. AMADEUS - DAY\n\nMariachi runs inside and checks to see if his case is still\nthere. Domino comes downstairs.\n\n                    MARIACHI\n          I just saw a guy with a guitar case like\n          mine. It's him they want.\n\n                    DOMINO\n              (to Assistant)\n          Did he say anything?\n\n                    ASSISTANT\n              (nodding)\n          No, he just ordered a drink.\n\n                    MARIACHI\n          I don't look anything like him...\n\nEXT. STREET - DAY\n\nAzul is walking to his truck when he turns to a corner and\nMean Dude #4 sticks his gun in his face. Two more guns\nappear, pointed at the back of his head.\n\nMEAN DUDE #10\n\nIs this the guy?\n\n                    MEAN DUDE #5\n          I'm not sure...\n\n                                                            36.\n\n\n\nEXT. DOWN THE STREET - DAY\n\nThe two Rats are in the blue truck half a block away. One\nhits the other to look at what's happening to Azul.\n\nPOV of Rats seeing Azul with three guys around him with guns.\nThey look at each other, start the truck and speed away.\n\nEXT. STREET - DAY\n\n                    MEAN DUDE #5\n          What's in the case?\n\n                       AZUL\n          My guitar.\n\n                    MEAN DUDE #5\n          Yeah? You're one of those old-time\n          mariachis, huh?\n\n                       AZUL\n                 (pause)\n          Yes.\n\n                    MEAN DUDE #5\n          OK, let's take a look.\n\nMean Dude #4 takes the case and lays it flat in Azul's palms.\n\n                    MEAN DUDE #5 (CONT'D)\n          If it's a guitar like you say it is,\n          we'll never bother you again...\n\nMean Dude #4 unsnaps two of the latches, SNAP SNAP.\n\n                    MEAN DUDE #5 (CONT'D)\n          If it's not...\n\nHe unsnaps three more... SNAP... SNAP... SNAP!\n\n                    MEAN DUDE #5 (CONT'D)\n          ... then we'll spray paint this street\n          with your brains.\n\nHe points the gun deep into Azul's face and cocks it. Azul\ncloses his eyes. Mean Dude #5 lifts the lid. Azul hears a\nfaint strumming sound, followed by the sound of the Mean Dude\nslamming the case shut. Azul opens his eyes. The Mean Dude\nresnaps the latches. SNAP... SNAP... SNAP-SNAP-SNAP!!!\n\n                    MEAN DUDE #5 (CONT'D)\n              (walking away)\n          Sorry....\n\n                                                   (CONTINUED)\n\n                                                           37.\nCONTINUED:\n\n\nThey walk away leaving Azul wondering what happened.\n\nINT. AMADEUS - DAY\n\nDomino, Mariachi, and Assistant are standing at the bar.\n\n                    DOMINO\n          Look, as long as you don't carry the case\n          around, they'll leave you alone. It's\n          that guy they're after.\n\n                    MARIACHI\n              (putting on his coat)\n          I better put this upstairs...\n\nHe grabs the case and begins to take it to the stairs, but he\npauses for it feels different to him. He slowly looks down at\nit.\n\nEXT. STREET - DAY\n\nAzul watches the Mean Dudes go and when tey turn the corner\nhe puts the case on the ground to open it.\n\nEXT. AROUND THE CORNER - DAY\n\nThe Mean Dudes are rounding the corner, but Mean Dude #5, who\nis last, snaps his fingers and motions to the others to keep\nquiet and to watch Azul\n\nINT. AMADEUS - DAY\n\nMariachi shakes the case, and puts it on the counter as if to\nopen it... but he doesn't need to check it. He knows it's not\nhis guitar.\n\n                    DOMINO\n          What's wrong?\n\nMariachi looks at her startled, then runs out of the bar with\nthe case.\n\nEXT. AROUND THE CORNER - DAY\n\nMean Dudes are watching Azul unsnap his case.\n\nEXT. STREET - DAY\n\nAzul opens the lid, revealing Mariachi's guitar.\n\n                                                           38.\n\n\n\nEXT. AROUND THE CORNER - DAY\n\n                    MEAN DUDE #5\n          That's him...\n\nThe Mean Dudes start walking towards Azul as the camera\ntracks back with them. Azul slams the case shut, wondering\nwhat the hell is going on. He looks up and notices the Mean\nDudes walking towards him. He stands up and slowly walks in\nthe other direction.\n\nEXT. A BLOCK AWAY - DAY\n\nMariachi is running through the streets and onto the\nsidewalk.\n\nEXT. STREET - DAY\n\nThe bad guys are pulling out their weapons.\n\nMariachi bolts around the corner. Now everyone is on the same\nsidewalk. Mariachi and Azul are on each end of the street\nwith the Mean Dudes in between them.\n\nAzul turns and sees Mariachi with his guitar case. Mean Dude\n#5 turns and sees Mariachi, too.\n\n                    MEAN DUDE #5\n          That's him...\n\nThe two other Mean Dudes exchange glances. Mean Dude #5\nstalks after Mariachi, so the other two follow. Mariachi\nlooks to Azul for help. Azul tips the imaginary hat to\nMariachi and walks away.\n\nEXT. ANOTHER STREET - DAY\n\nMariachi runs through the street almost getting hit. Bullets\nare flying as the Mean Dudes are firing at him as they run.\n\nEXT. DEAD END - DAY\n\nMariachi leaps up over a few cars and ends up in a dead end.\nHe turns around, drops the case on the ground and opens it. A\nmillion weapons seem to stare back at him when he opens it.\nHe is frantic. He grabs a small gun, shakes it in his hand,\ndoesn't like the feel. He tosses it back in.\n\nEXT. STREET - DAY\n\nThe Mean Dudes are barreling down the street. One turns\ntowards the dead end.\n\n                                                             39.\n\n\n\nEXT. DEAD END - DAY\n\nMariachi pulls out the MAC-10 and blasts the first Mean Dude\nhe sees. He grabs the case and runs out into the street,\njumping onto a truck and blasting the other Mean Dude from up\nthere. He sees Mean Dude #5 run away.\n\nMariachi comes off the truck and walks through the streets in\nslow motion. Peolple are staring at him as if he was Azul the\nkiller. Mariachi walks straight to the bar. A BOY is bouncing\na ball on one of the sidewalks.\n\nINT. AZUL'S HIDEOUT - DAY\n\nThe camera dollies past the vacant pool table, and over to a\nRat sitting in a chair, drinking a beer. The other Rat is\npacing back and forth in front of the sitting Rat. Azul\nenters the room. Throwing his guitar case onto the pool table\nas a grand entrance gesture. The sitting Rat stands beside\nthe pacing Rat.\n\n                    RAT #1\n          I'm sorry we left...\n\n                    RAT #2\n          ... We didn't know what to do...\n\n                    RAT #1\n          ... We figured you could defend\n          yourself!!!\n\nRat #2 nods in agreement. Azul unsnaps one of the latches.\nSNAP!\n\n                    AZUL\n          You thought I could defend myself...\n\nSNAP! SNAP!\n\n                    AZUL\n          ... against three armed men...\n\nSNAP!\n\n                    AZUL\n          ... using this?\n\nHe opens the case and the guitar sparkles at them. The Rats\nexchange glances. They look at the guitar then back at Azul.\n\n                    AZUL (CONT'D)\n          My case got switched with some maricon\n          mariachi!\n\n                                                   (CONTINUED)\n\n                                                             40.\nCONTINUED:\n\n\n                    RAT #1\n          Where is this mariachi?\n\n                    AZUL\n          He's dead by now... So, I want you to go\n          look for my case.\n\nThe two Rats are about to leave.\n\n                    AZUL (CONT'D)\n          Leave me a weapon.\n\nBoth Rats take out their guns. Azul takes Rat #2's gun.\n\n                    AZUL (CONT'D)\n          That was disloyal of you to leave me out\n          there. You should be as loyal to me as\n          you are to each other.\n\nThe Rats exchange glances, then aim their eyes back to the\nfloor. Azul turns to Rat #2.\n\n                    AZUL (CONT'D)\n          Are you loyal?\n\n                       RAT #2\n                 (after glancing at Rat #1)\n          Yes.\n\n                    AZUL\n              (to Rat #1)\n          Are you loyal?\n\n                       RAT #2\n          Yes.\n\nAzul gestures to Rat #2.\n\n                    AZUL\n          Then shoot him.\n\nRat #1 turns to Rat #2 who is in shock.\n\n                    AZUL (CONT'D)\n          You are loyal, are you not? SHOOT HIM. Or\n          I shoot you.\n\nAzul aims his gun at Rat #1, who immediately aims his gun at\nRat #2. Rat #2 is sweating bullets. Rat #1 puts his gun down.\n\n                       RAT #1\n          I can't.\n\n\n                                                 (CONTINUED)\n\n                                                            41.\nCONTINUED: (2)\n\n\n                     AZUL\n          Why not?\n\n                    RAT #1\n          You said we should be as loyal to you as\n          we are to each other. I couldn't shoot\n          him, for that would be as disloyal as\n          shooting you.\n\nRat #2 glances back and forth between Rat #1 and Azul.\n\n                    AZUL\n          Very good. Now go find my case.\n\nAzul puts his gun down and motions the rats to leave. They\nleave. When they exit, Rat #1 turns to Rat #2 and snaps his\nfingers. Rat #2 shakes his hand. They leave.\n\nINT. DOMINO'S LOFT - NIGHT\n\nDomino is dabbing hydrogen peroxide onto a cotton swab. She\napplies it to Mariachi's body scars on his back. Mariachi has\nhis eyes closed. He washes the blood from his face.\n\n                    MARIACHI\n          Where were you when he came into the bar?\n\n                    DOMINO\n          I was on the phone, talking to a friend\n          that knows what's going on.\n\n                    MARIACHI\n          Did you mention me?\n\n                    DOMINO\n          No... He told me the man in black is\n          Azul.\n\n                    MARIACHI\n          If his name is Azul, why doesn't he wear\n          blue?\n\n                    DOMINO\n          I don't know... Anyway, he's killing the\n          men of the town drug dealer. The dealer's\n          name is Mauricio. But he's known as Moco.\n\n                    MARIACHI\n          And Moco is sending these men to find\n          Azul. So, why do they chase me?\n\n\n\n\n                                                    (CONTINUED)\n\n                                                            42.\nCONTINUED:\n\n\n                    DOMINO\n          They have never seen Azul... only Moco\n          knows him. My friend says the description\n          Moco gave his men was that he wears\n          black, and carries a guitar case. Sounds\n          like you, no?\n\n                    MARIACHI\n          Couldn't you tell your friend that there\n          are two people like that in his town? One\n          is a killer, and one is a mariachi.\n\n                    DOMINO\n          Only special people can talk to Moco.\n          Besides, you've killed a few of his men,\n          now. Your best option is to keep out of\n          sight, stop wearing black, and to hide\n          that stupid case until this is all over.\n\nEXT. MOCO'S RANCH - DAY\n\nMean Dude #5 comes in and approaches Moco.\n\n                    MEAN DUDE #5\n          He got away... but I got a good look at\n          him.\n\nMoco takes out a cigarette and puts it in his mouth.\n\n                    MEAN DUDE #5 (CONT'D)\n          Coca, Caca, Beto were killed.\n\nMoco takes out a match.\n\n                    MEAN DUDE #5 (CONT'D)\n          He won't get away again, Moco. I promise.\n\nMoco lights his match across Mean Dude #5's face and lights\nhis cigarette. Mean Dude #5 walks away, as Moco flicks his\nmatch at him in slow motion.\n\nINT. DOMINO'S LOFT - NIGHT\n\nMariachi is about to lay on the floor. She tosses him a\nblanket.\n\n                    MARIACHI\n          Are you always closed Monday nights, or\n          did you close since I can't play my\n          guitar tonight?\n\n\n\n\n                                                    (CONTINUED)\n\n                                                           43.\nCONTINUED:\n\n\n                    DOMINO\n          Mondays are my day off. Want to play a\n          game?\n\n                       MARIACHI\n          Sure.\n\nThe phone rings. Domino gets up to answer it. Mariachi\nreaches under his blanket for a small mirror and combs his\nhair, putting spit in his hair to slick it down. He quickly\nstashes the mirror.\n\n                    DOMINO\n              (into phone)\n          Hello?\n\n                    MOCO\n              (into phone)\n          Come see me.\n\n                    DOMINO\n              (into phone)\n          I can't.\n\n                    MOCO\n              (into phone)\n          Please.\n\nMoco is sitting at a table playing cards.\n\n                    DOMINO\n              (into phone)\n          I don't feel well. I've got to go.\n\n                    MOCO\n              (into phone)\n          Have you ridden the bike?\n\n                    DOMINO\n              (into phone)\n          No... I've got to go...\n\nShe hangs up.\n\n                       MARIACHI\n          Boyfriend.\n\n                    DOMINO\n              (quiet as if thinking)\n          No...\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          44.\nCONTINUED: (2)\n\n\n                   MARIACHI\n         I can't figure out something. You tell me\n         you're poor. Poor family. Yet you've got\n         this place.\n\n                   DOMINO\n             (sighing)\n         This place is a gift.\n\n                      MARIACHI\n         From who?\n\n                   DOMINO\n         From Mauricio.\n\n                   MARIACHI\n         From Mauricio? The man trying to kill me?\n\n                   DOMINO\n         He's not trying to kill you, his man had\n         you confused with Azul.\n\n                   MARIACHI\n         Same thing.\n\n                   DOMINO\n         Look, you now how if you want to impress\n         a girl, you send her flowers, candy,\n         jewelry until you win her love?\n\n                      MARIACHI\n         Yes.\n\n                   DOMINO\n         If one present doesn't work, you keep\n         sending bigger and better things until\n         you win her or you're broke?\n\n                      MARIACHI\n         Correct...\n\n                   DOMINO\n         Well, Mauricio sent me flowers, then\n         jewelry, then he gave me a job at his\n         saloon, then he gave me the whole\n         saloon... etc.\n\n                   MARIACHI\n         He's still giving you things?\n\n                   DOMINO\n         He'll never run out of money.\n\n\n                                                  (CONTINUED)\n\n                                                          45.\nCONTINUED: (3)\n\n\n                    MARIACHI\n          And you accept it all? What's the last\n          thing he sent you?\n\nDomino walks over to the counter and picks up a key.\n\n                    DOMINO\n          A motorcycle.\n\nMariachi laughs.\n\n                    DOMINO (CONT'D)\n          He wants me to ride out to his ranch when\n          I've decided to be his. He thinks he's\n          close to having me.\n\n                    MARIACHI\n          Is he?\n\n                    DOMINO\n              (pause)\n          He was.\n\nShe sits next to Mariachi.\n\n                    DOMINO (CONT'D)\n          Not anymore.\n\nThey kiss. She gets up and is about to turn off the lights.\n\n                    MARIACHI\n          So, you really are from a poor family.\n\nCLICK!\n\n                    DOMINO\n              (in the dark)\n          I remember when I was growing up, we were\n          so poor, that my brothers and sisters and\n          I all slept on the same blanket stretched\n          out across the floor. We had to sleep in\n          a circle, with our fingers in each\n          other's ears, to keep the bugs from\n          crawling into them.\n\n                     MARIACHI\n              (after a pause)\n          Ay, wey...\n\nDomino laughs.\n\n                                                             46.\n\n\n\nINT. AMADEUS - DAY\n\nDomino hands Mariachi a wad of money.\n\nMariachi sees the money and looks up at her bewildered.\n\n                    DOMINO\n          Here's a little bit I've saved. I want\n          you to go get a new guitar.\n\nMariachi starts to put up his hand as if to refuse it.\n\n                    DOMINO (CONT'D)\n          Take it, stupid. I'm not saying go by the\n          best one, just a temporary one so you can\n          play again tonight.\n\nMariachi stops and thinks... He looks up at her\nquestioningly, then he shrugs an \"OK\" and grabs the money and\njogs out excitedly. Domino is smiling.\n\nEXT. STREET - DAY\n\nMariachi walks down the sidewalk, passing curioso shops. The\ncamera is low and zoomed in all the way. Mariachi stops by\none of the window that has a guitar in the glass. He pulls\nhis money and counts it. He stops after he notices someone's\nreflection in the window. He turns around and sees it is Mean\nDude #5 right across the street. He meets up with another\nMean Dude. They are standing right behind Mariachi. Mariachi\nis pretending to still look at the window. The Mean Dudes\nwalk past Mariachi so Mariachi walks in the opposite\ndirection. Mean Dude #5 stops and then turns around slowly.\nFar zoomed shot of Mariachi walking down the street with guys\nbehind him. They start after him.\n\n                    MEAN DUDE #5\n          That's him...\n\nTracking shot following Mariachi.\n\nTracking shot in front of Mean Dudes walking at Mariachi.\n\nMean Dude #5 pulls out a small walkie-talkie and calls his\nbuddy in the truck a block away.\n\n                    MEAN DUDE #5 (CONT'D)\n              (into walkie-talkie)\n          Loco, he's headed your way... black\n          pants, white shirt.\n\n                                                          47.\n\n\n\nIN A TRUCK DOWN THE STREET\n\nLOCO starts the truck and starts driving slowly across the\nstreet. As he turns on the corner, Mariachi sees the truck\nand casually climbs inside and hides in the back. Mean Dude\n#5 turns the corner when whispers into walkie-talkie.\n\n                    MEAN DUDE #5\n              (into walkie-talkie)\n          Where did he go, Loco?\n\n                    LOCO\n              (laughs, into walkie-talkie)\n          He got in my truck.\n\nMean Dude #5 laughs.\n\n                    MEAN DUDE #5\n              (into walkie-talkie)\n          Take him around the block.\n\nMean Dude #5 taps his buddy and they start running down the\nblock.\n\nMariachi is in back the truck searching for a weapon. The\ntruck stops. Mariachi rolls to the side and gently lifts his\nhead.\n\nPOV Mariachi sees the two Mean Dudes walking at him. Mariachi\nturns and Loco is there to knock him in the face with the\nrifle butt. Mariachi falls into truck, blood trickling from\nhis dizzying head. He tries to get up a bit, but Loco is in\nthe truck now, and slams the rifle down into his face hard...\nBlackout.\n\nDUSTY ROAD TO MOCO'S\n\nMariachi is unconcious in the back of Loco's truck. Mean Dude\n#5 and other Mean Dudes are riding in back with Mariachi.\n\nEXT. ROAD TO MOCO'S - DAY\n\nThe above scene intercuts back and forth with the arrival of\nLoco. Loco arrives at the gate, Mean Dude #5 opens the gate,\nthey drive through. The truck is facing Moco so he can't see\nMariachi yet. Mean Dude #5 closes the gate and walks over to\nthe truck, opens the back door, and calls Moco over. Moco\nwalks over to the truck and looks inside.\n\n                                                           48.\n\n\n\nEXT. TRUCK - DAY\n\nMariachi is laying there unconcious, Moco puts his arm around\nMean Dude #5, who is looking very proud, and Moco pulls out a\ncigarette and a match.\n\n                    MOCO\n          That's not him.\n\nMoco strikes the match behind Mean Dude #5's head. Mean Dude\n#5 stops smiling.\n\nINT. AMADEUS - DAY\n\nDomino is waiting on customers. She glances at her watch. A\nfew seconds later she glances at it again. She looks very\nworried.\n\nINT. AZUL'S HIDEOUT - DAY\n\nAzul's Rats burst into the hideout. FOUR GIRLS pop up over\nthe partition with guns. The Rats stop in their tracks. The\ngirls sigh a \"oh, it's them\" sigh and slink back to bed. Top\nshot of them trying to wake Azul. Azul wakes up and looks\nover the partition.\n\n                    AZUL\n          Where's my case?\n\n                    RAT #1\n          We couldn't find it.\n\n                    RAT #2\n          We heard they caught you and were taking\n          you to Moco's ranch.\n\n                    RAT #1\n          ... so we came to see if it was true.\n\nAzul thinks a moment. He stands up.\n\n                    AZUL\n          They caught the mariachi.\n\nAzul dresses, smiling...\n\nINT. MOCO'S RANCH - DAY\n\nMariachi is in a holding cell at the ranch. He twitches,\nfinally waking up.\n\nHe sees a GUARD outside and finds a way to escape.\n\n\n                                                  (CONTINUED)\n\n                                                             49.\nCONTINUED:\n\n\nHe grabs the guard's assault rifle and turns a corner. Two\nmen grab him. He slams the butt of the rifle, knocking the\nwind and teeth out of BAD GUY #1, then he kicks down and\nbreaks the shin bone of BAD GUY #2 who screams out in agony.\nMariachi silences him by karate punching his throat. The Bad\nGuy gurgles and hits the ground.\n\nAngle from the ground as Mariachi smashes the guy with is\ngun.\n\nHe crawls up a wall, trying to escape as quietly as he can.\nHe sees TWO MORE MEN running towards him since they heard\nsome noise. Mariachi aims his assault rifle at the blue Chevy\nparked behind him. He fires and it explodes.\n\nMariachi jumps Loco, gets him to drive him to the saloon. He\nalso takes Loco's money.\n\nEXT. BOYSTOWN SALOON - DAY\n\nAzul walks into frame, looks around then proceeds into the\nbar.\n\nINT. AMADEUS - DAY\n\nAzul goes inside and finds Domino tending the bar.\n\n                    DOMINO\n          What can I get you?\n\n                      AZUL\n          One beer.\n\nShe grabs a bottle and slams it down on the counter unopened.\nHe eyes her admirably and then pops the top with one hand.\n\nHe guzzles the drink, slamming it down empty.\n\n                    DOMINO\n          Anything else?\n\n                    AZUL\n              (nodding)\n          My guitar case.\n\n                    DOMINO\n          Where's Mariachi?\n\n                    AZUL\n          Where's my case?\n\n                      DOMINO\n          Upstairs.\n\n                                                 (CONTINUED)\n\n                                                            50.\nCONTINUED:\n\n\n                      AZUL\n          Get it.\n\nDomino grabs another beer for him and runs to get the case.\n\n(In between this time, Mariachi escapes with Loco.)\n\nShe returns, slamming it to the floor.\n\n                    AZUL (CONT'D)\n          If you want your mariachi back, come with\n          me.\n\n                    DOMINO\n          Why will you help me?\n\n                    AZUL\n          Because you know where Moco's ranch is...\n          I don't.\n\nDomino calls her Assistant.\n\n                    AZUL (CONT'D)\n          You help me, I'll help you.\n\n                      DOMINO\n          Let's go.\n\nThey leave. The Assistant tends to the bar.\n\nROAD TO MOCO'S\n\nThey drive out to Moco's ranch in Azul's truck. Little do\nthey know, they passed Loco's truck with Mariachi crouched in\nthe passenger seat. He gets up after the truck passes.\nMariachi didn't know it was Domino in Azul's truck or he\ncould have turned around and kept her from going to Moco's\nranch.\n\nThey arrive at the gate and het out of the truck.\n\n                     DOMINO\n              (over the gate)\n          Mauricio!!\n\nAzul grabs Domino and points a gun to her head. He whispers\nto her...\n\n                    AZUL\n          Play along...\n\nHe kicks at the gate.\n\n\n                                                    (CONTINUED)\n\n                                                            51.\nCONTINUED:\n\n\n                    AZUL (CONT'D)\n          Open the gate or she's dead!\n\nThe gate opens and we see Moco standing at a three-quarter\nstance, flanked with his men on both sides. Azul drags Domino\nin and faces her at Moco with a gun to her head.\n\n                    MOCO\n              (to Domino)\n          I'm sorry he used you to get to me,\n          Domino.\n\nAzul cocks the pistol.\n\n                    MOCO (CONT'D)\n          Azul, let her go and you'll get your\n          money.\n\n                    AZUL\n          Moco, give me my money or I ruin your\n          clothes with her blood.\n\nMoco signals his men to get the money.\n\n                    DOMINO\n          What have you done with Mariachi?\n\n                    MOCO\n          Who?\n\n                    DOMINO\n          The musician your men confused with Azul.\n\n                    MOCO\n              (staring at her)\n          So that's why you were busy that night...\n\nAzul is glancing between Domino and Moco.\n\n                    MOCO (CONT'D)\n          ... you had that little monkey climbing\n          all over you.\n\n                    AZUL\n          Give me my money or I kill her NOW!!!\n\n                    MOCO\n          After all I've done for you, this is how\n          you treat me?\n\n                    DOMINO\n          I never asked you for anything until now.\n          Let Mariachi go.\n\n                                                    (CONTINUED)\n\n                                                             52.\nCONTINUED: (2)\n\n\nAzul is anxious now.\n\n                    AZUL\n          I swear I'll kill her!\n\n                    MOCO\n          No you won't. I will.\n\nMoco pulls out his gun and shoots her in the heart. She falls\nlimp in Azul's arms. Azul tries hold her up, but she's dead.\nAzul rests her on the ground, looking down at her, wondering\nwhy it's all come to this.\n\n                    AZUL\n          All I wanted was my rightful share. But\n          you've got to kill everybody.\n\n                    MOCO\n          You feel sorry for her, don't you? See,\n          that's why you can't ever be as big as\n          me.\n\nAzul slowly looks at Moco.\n\n                    MOCO (CONT'D)\n              (aiming gun)\n          Because you have too much heart.\n\nMoco shoots Azul in the heart. Azul had his hands to his\nside, and now he falls to his knees. Moco shoots him again,\nand Azul dies next to Domino.\n\nMean Dude #5 is exchanging glances with the others. No one\nseems to be on Moco's side.\n\nEXT. NEAR SALOON - DAY\n\nMariachi is still in Loco's truck.\n\n                       MARIACHI\n          Stop here.\n\nLoco stops the truck and Mariachi gets out. Loco drives back\nwhen Mariachi motions for him to leave. Mariachi watches him\ngo then dashes around the corner to the saloon.\n\nINT. AMADEUS - DAY\n\nMariachi runs into the bar...\n\n                    MARIACHI\n          Domino!!! We're leaving!!! Right now!!!\n\n\n                                                    (CONTINUED)\n\n                                                            53.\nCONTINUED:\n\n\nThe Assistant rushes over to Mariachi.\n\n                    ASSISTANT\n          She's gone.\n\n                    MARIACHI\n          Where is she?\n\n                    ASSISTANT\n          Looking for you.\n\nMariachi is about to race upstairs.\n\n                    ASSISTANT (CONT'D)\n          She gave the case back to that guy. She\n          left with him to find you.\n\nMariachi tries to make sense of it all for a minute before\ngrabbing the gun from under the counter and rushing upstairs.\n\nINT. DOMINO'S LOFT - DAY Mariachi grabs the key to the\nmotorcycle and runs out. The motorcycle burns down the road.\nMARIACHI ON THE ROAD TO MOCO'S\n\nMariachi barrels down the road on the motorcycle.\n\nEXT. MOCO'S RANCH - DAY\n\nMoco is walking away from the bodies.\n\n                    MOCO\n          Bring that musician out here so he can be\n          reunited with my Domino.\n\nSome men go to check.\n\nCut back and forth with Mariachi coming.\n\n                    MEN\n          He's gone, sir.\n\n                       MOCO\n          Find him!!\n\nMariachi rides through the semi-open gate... stopping at the\nbodies. He dismounts the bike and holds Domino.\n\nHe has the gun in the back of his pants. You can see it while\nhis back is to the camera and men are approaching him. Moco\ncomes for the show.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                            54.\nCONTINUED:\n\n\n                    MOCO (CONT'D)\n              (good shot)\n          So you're the little mariachi that came\n          to town, killed my men, and stole my\n          girl...\n\nMariachi slowly lifts his eyes to Moco.\n\n                    MOCO (CONT'D)\n          You are very talented.\n\nMariachi stands, hands up.\n\n                    MOCO (CONT'D)\n          I bet you play the guitarra real well,\n          huh?\n\nMariachi says nothing.\n\n                    MOCO (CONT'D)\n              (raising gun)\n          Not anymore.\n\nMoco fires into Mariachi's left hand. Mariachi grimaces,\ncrumbling to the floor. He keeps a tight grip on his hand.\nWhen he opens his hand to see the damage, the camera can see\nright through his hand for a reverse shot of his face through\nthe hole.\n\n                    MOCO (CONT'D)\n          Now get the hell off my property and take\n          your hand with you!!!\n\nMoco is laughing and looking at his men for support, but no\none else laughs. Mariachi tries to stand, but he falls back.\nWhen he rises again he has the gun in his hand. He shoots\nMoco in the chest. Moco falls back and hits the ground hard.\nHe gasps for air...\n\nMoco's men gather around him. Mean Dude #5 crouches down to\ncheck Moco's throat pulse. Moco's dead. Mean Dude #5 strikes\na match across Moco's face and lights up a cigarette. He\nturns and walks away. The others follow.\n\nMariachi wraps a tourniquet on his arm, kisses Domino, opens\nAzul's case, sees the weapons, and rides off with it.\n\nMARIACHI ON THE ROAD\n\nHe looks back at the town behind him, then places his hand on\nthe motorcycle to drive off. We notice the metal brace on his\nhand.\n\n\n                                                    (CONTINUED)\n\n                                                             55.\nCONTINUED:\n\n\nMariachi rides into the sunset road. He speeds pas a sign:\n\"ACUÑA 18 miles\"\n\n\"Coming soon\n\nEL MARIACHI II\"\n\n                                                     FADE OUT\n\nTHE END\n\n\n\n\n\nMariachi, El\nWriters :   Robert Rodriguez\nGenres :   Action  Crime  Thriller  Western\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:30:43.648110"}