{"title": "Midnight Cowboy", "film_link": "/Movie Scripts/Midnight Cowboy Script.html", "script_link": "/scripts/Midnight-Cowboy.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Midnight Cowboy Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Midnight Cowboy Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (10.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=James Leo Herlihy\" title=\"Scripts by James Leo Herlihy\">James Leo Herlihy</a><br/>  <a href=\"/writer.php?w=Waldo Salt\" title=\"Scripts by Waldo Salt\">Waldo Salt</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> :  1969<br/>\n<br/>\n<a href=\"/scripts/Midnight-Cowboy.html\">Read \"Midnight Cowboy\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>Midnight Cowboy by Waldo Salt</title>\n\n<pre>\n\n<b>FADE IN:\n</b>\n<b>INT. TV STUDIO - DAY\n</b>\nA Susskind-type MODERATOR is speaking into camera:\n\n<b>\t\t\tMODERATOR \n</b>\tTonight we'll discuss a subject\n\tmost of us seem to consider either\n\tbad taste or frivolous or funny.\n\tBut if our experts are right, we\n\tface what might be called a\n\tmasculinity crisis. Every fourth\n\tAmerican man uptight, threatened by\n\tthe increasing sexual demands of\n\tAmerican women...\n\n<b>EXT. SIDEWALK INTERVIEW - DAY\n</b>\nAn IRATE WOMAN speaks into camera:\n\n<b>\t\t\tIRATE WOMAN\n</b>\tThey always put it that way, but\n\twell, all it means, you know, is\n\tevery fourth American woman's never\n\tsatisfied. That's it. I never am --\n\thave been, you know...\n\n<b>EXT. SIDEWALK INTERVIEW - DAY\n</b>\nA COOL WOMAN speaks into camera:\n\n<b>\t\t\tCOOL WOMAN\n</b>\tThis, this image of the, the man\n\teating woman. It isn't our\n\tincreasing demands. I think it's\n\tthe shrinking American male...\n\n<b>EXT. SIDEWALK INTERVIEW - DAY\n</b>\nA SAD WOMAN speaks into camera:\n\n<b>\t\t\tSAD WOMAN\n</b>\tNo, I never had, well, whatever it\n\tis you call it. But the hours he\n\tworks, I can't blame him...\n\n<b>INT. CAFETERIA SCULLERY (TEXAS) - DAY\n</b>\nFull frame -- a scandal sheet picture of a sex-starved wife,\nnaked while her husband sleeps, captioned I BUY WHAT MY\n<b>HUSBAND CAN'T GIVE.\n</b>\n<b>\t\t\tSAD WOMAN'S VOICE \n</b>\t... but it's a problem. A big\n\tproblem. With so many women I\n\tknow...\n\nCamera pulls back to show the picture among other pinups of\nwomen -- rich, beautiful or naked, but all blonde -- steam\nwilted on the wall over a dishwashing machine. JOE BUCK grins\nat the wall as he scrapes garbage.\n\n<b>\t\t\tJOB \n</b>\tJust keep your pants on, ladies...\n\n<b>MULTIPLE SPLIT SCREEN\n</b>\nA LADY COMMENTATOR, gradually surrounded by lonely women...\n<b>\tBEAUTY PARLOR\t\t\t\n</b><b>\tFASHION SHOW\t\t\n</b><b>\tPSYCHIATRIST'S COUCH       \n</b><b>\tCOCKTAIL BAR\t\t\t\n</b><b>\tGYMNASIUM\t\t\t \n</b><b>\tSTATUE OF LIBERTY\n</b>\n<b>\t\t\tLADY COMMENTATOR\n</b>\tBefore World War One -- American\n\tmen outnumbered women by over six\n\tpercent. Today American women not\n\tonly outnumber men, but live five\n\tyears longer -- leaving them in\n\tcontrol of vast corporate wealth\n\tand seventy-five percent of\n\tAmerica's purchasing power...\n\nThe Lady Commentator is replaced by Joe, stacking dishes,\nsurrounded by frustrated ladies. He laughs tolerantly.\n\n<b>\t\t\tJOE\n</b>\tY'all,line up and take your turn...\n\n<b>INT. TV STUDIO - DAY\n</b>\nThe Moderator smiles into camera.\n\n<b>\t\t\tMODERATOR \n</b>\tMy question is this -- will\n\tAmerican know-how come up with a\n\tmarketable male to replace all the\n\tmen who are worrying themselves\n\tinto an early grave over women's\n\tincreasing sexual demands?\n\n<b>INT. STALL SHOWER - DAY\n</b>\nJoe sings as he soaps himself, \"Whoopee ti yi yo, git along\nlittle dogies, for you know New York will be your new home!\"\nSound and image freeze on Joe's open mouth.\n\n<b>SUPERIMPOSED MAIN TITLE AND CREDITS\n</b>\nTITLES follow as indicated, sound and action continuing after\neach credit.\n\n<b>INT. SUNSHINE CAFETERIA - DAY\n</b>\nJoe's song continues over a sweating WAITRESS, glancing up.\n\n<b>\t\t\tWAITRESS \n</b>\tWhere's that Joe Buck?\n\n<b>INT. HOTEL ROOM - DAY\n</b>\nWrapped in a towel, singing in front of his dresser mirror,\nJoe sprays himself with deodorant, aiming a last playful\nblast at the unseen crotch -- freezing song and image as\nCREDITS continue over...\n\n... a calendar girl on the wall blushing orange, mouth frozen\nin a tiny O, staring wide-eyed. Joe's song continues as...\n\n... Joe rips the wrapping from a new Stetson and sets it on\nhis head, freezing song and image as CREDITS continue.\n\n<b>INT. CAFETERIA SCULLERY - DAY\n</b>\nRALPH, an aging black man, faces a mountain of dirty dishes.\n\n<b>\t\t\tRALPH\n</b>\tWhere's that Joe Buck?\n\n<b>INT. HOTEL ROOM - DAY\n</b>\nSinging as he buttons his new cowboy shirt, Joe interrupts\nhimself to answer Ralph...\n\n<b>\t\t\tJOE\n</b>\tYeah, where's that Joe Buck?\n\n... continuing his song as he pulls up and zips his tight\nthighed black slacks, freezing song and image for CREDITS.\n\n<b>INT. REMEMBERED BEAUTY PARLOR - ANOTHER TIME\n</b>\nSALLY BUCK, a pretty middle-aged blonde, smiles down at\ncamera,\n\n<b>\t\t\tSALLY BUCK\n</b>\tYou look real nice, Joe baby...\n\n<b>INT. HOTEL ROOM - DAY\n</b>\nJoe sings as he pulls on his new cowboy boots, arranging his\ncuffs to show off the yellow sunburst at the ankle, freezing\nsong and image for CREDITS.\n\n<b>INT. SUNSHINE CAFETERIA - DAY\n</b>\nThe pink MANAGER scowls at his pocket watch.\n\n<b>\t\t\tMANAGER \n</b>\tWhere's that Joe Buck?\n\n<b>INT. HOTEL ROOM - DAY\n</b>\nJoe hums as he piles a complete wardrobe of cowboy clothes,\nstill in their wrappers, into a shiny new suitcase of black\nand white horsehide.\n\n<b>\t\t\tJOE\n</b>\tYeah, where's that Joe Buck?\n\n<b>INT. SUNSHINE CAFETERIA - DAY\n</b>\nHolding his watch, the Manager wags a finger at camera.\n\n<b>\t\t\tMANAGER \n</b>\tYou're due here at four o'clock.\n\tLook at those dishes, look!\n\n<b>INT. HOTEL ROOM - DAY\n</b>\nJoe laughs as he locks his suitcase.\n\n<b>\t\t\tJOE\n</b>\tKnow what you can do with those\n\tdishes? And if you ain't man enough\n\tto do it yourself, I'd be happy to\n\toblige...\n\nJoe picks up his suitcase, a portable transistor radio, walks\naway from the mirror, then pauses to run a comb through his\nhair, hook a cigarette at the corner of his mouth and strike\na match on his thumbnail before he turns back for one\nadmiring glance at himself in the mirror -- proud, exultant,\nready -- freezing the image as CREDITS END.\n\n<b>EXT. TEXAS TOWN MAIN STREET - DAY\n</b>\nJoe leaves the hotel, carrying his suitcase.\n\n<b>INT. CAFETERIA SCULLERY - DAY\n</b>\nThe pink Manager points at his watch angrily.\n\n<b>\t\t\tMANAGER \n</b>\tFour to midnight, understand?\n\nAngle widens to include Joe, holding his suitcase and radio.\nRalph stares at him curiously, stacking dishes.\n\n<b>\t\t\tJOE\n</b>\tSay, look, uh, I gotta have a word\n\twith you, if you got a second.\n\n<b>\t\t\tMANAGER\n</b>\tLater. Later maybe.\n\nThe Manager hurries away, carrying a basket of dishes.\n\n<b>\t\t\tRALPH \n</b>\tYou ain't coming to work?\n\n<b>\t\t\tJOE\n</b>\tDon't guess. Just come for my day's\n\tpay owing and to tell you I'm\n\theading East.\n\nJoe tilts his Stetson as the Waitress appears at the door...\n\n<b>\t\t\tWAITRESS \n</b>\tCups!\n\n... but she disappears without noticing Joe. Ralph offers his\nhand. Joe takes it, holds it.\n\n<b>\t\t\tRALPH \n</b>\tWhat you gonna do back there, East?\n\n<b>\t\t\tJOE \n</b>\tLotta rich women back there...\n\n<b>\t\t\tRALPH\n</b>\tYeah?\n\n<b>\t\t\tJOE \n</b>\tMen, they mostly faggots.\n\n<b>\t\t\tRALPH \n</b>\tMust be some mess back there.\n\n<b>\t\t\tJOE \n</b>\tWell, ain't no use hanging around\n\there.\n\n<b>\t\t\tRALPH\n</b>\tAin't gonna collect your pay?\n\n<b>\t\t\tJOE \n</b>\tI got me two hundred twenty-four\n\tbucks of flat folding money... \n\t\t  (slaps hip)\n\tHe know what he can do with that\n\tchicken-shit day's pay. And if he\n\tain't man enough to do it for\n\thimself, I be happy to oblige!\n\n<b>INT. SUNSHINE CAFETERIA - DAY\n</b>\nThe door marked EMPLOYEES ONLY swings open and Joe appears,\nmeasuring his effect on the customers and his fellow\nemployees as he crosses the sterile white dining room,\nobserving the drab details of the life he has left behind -\ngarbage on greasy dishes, limp food in steam table trays,\ncoffee-soaked cigarette butts, caked mustard and ketchup on\nformica table tops -- two pimply high school girls slurping\nsuggestive noises after Joe through the straws of empty coke\nglasses. O.S. a Tiomkin-tradition chorus sings, \"From this\nvalley they say you are going -- we will miss your bright\neyes and sweet smile for they say you are taking the\nsunshine...\"\n\n<b>EXT. TOWN MAIN STREET - DAY\n</b>\nThe song ends as Joe comes from the cafeteria \"... that\nbrightened our pathway a while.\"\n\n<b>\t\t\tJOE \n</b>\tTough tiddy, ladies, you had your\n\tchance.\n\nFrom a high angle -- Joe starts his long walk toward the bus\ndepot along the street of a small Western town struggling to\nurbanize itself. The click-clack-click of his boots is loud\nbut somehow lonely The radio at his ear drones grain prices\non the Commodity change. Joe's pace slows as he passes...\n\n<b>EXT. SALLY BUCK'S BEAUTY SALON - DAY\n</b>\n... a gilt-lettered sign in the window, glittering in the\nsun, momentarily hiding the fact that the shop is deserted.\nJoe grins as he hears remembered sounds and voices incomplete\nflashes, more significant in tone than content a girl\ngiggling sexily -- \"Keep your meat hooks off my beauty\noperators, sugar\" -- tinkling noises of a busy beauty parlor \n- Sally Buck singing \"Hush, little baby, don't say a word,\nGrammaw gonna buy you a mockingbird...\"\n\n... a shift of light revealing a row of tarnished driers, a\nbroken mirror, a FOR RENT sign in the window. Joe turns\ntoward the bus depot, radio pressed to his ear.\n\n<b>\t\t\tANNOUNCER'S VOICE\n</b>\tBenson and Hedges One Hundreds\n\tmakes special awards from time to\n\ttime for anything that's longer\n\tthan anything...\n\n<b>\t\t\tJOE \n</b>\tCare to get out your yardstick,\n\tgentlemen?\n\nAt the same moment, a recognizable variant of the \"Big\nCountry\" theme blares loud.\n\n<b>INTERCUT WESTERN FILM CLIP\n</b>\nGary Cooper (or John Wayne) walks a frontier street.\n\n<b>EXT. BUS DEPOT - DAY\n</b>\nHigh angle of the departing bus, intercut \"Big Country\"\nfashion, alternating high shots with close-ups of the bus\nwheals.\n\n<b>EXT. FREEWAY CLOVERLEAF - DAY\n</b>\nThrough the bus windshield -- a dizzying montage of traffic\nlines, arrows and signs as the bus sweeps around and up onto\nthe freeway.\n\n<b>INT. BUS - DAY\n</b>\nJoe sits at the front, opposite the driver, cracking his gum\nas he watches the huge billboards streaking by, promising him\npower, happiness and beautiful women if he chooses the right\nbreakfast food, hair oil or automobile. Joe listens to the\nhumming tires, the roar of the engine, shaking his head.\n\n<b>\t\t\tJOE\n</b>\tThis is a powerful mothah, ain't\n\tit?\n\nIgnored by the driver, Joe rises and walks back to his empty\ndouble seat, glancing around to see what impression he's made\non his immediate fellow travelers -- an OLD LADY in front of\nhim -- a hostile young sailor with acne behind him -- two\nteeny-boppers flirting with Joe hysterically -- a PALE BLONDE\ndirectly across the aisle, smiling at Joe weakly.\n\n<b>\t\t\tPALE BLONDE \n</b>\tDo you have a stick of gum?\n\nJoe leans across, snapping his gum as he offers her a stick.\nHe watches her nibble it daintily on her front teeth.\n\n<b>\t\t\tPALE BLONDE (CONT'D)\n</b>\tThank you.\n\n<b>\t\t\tJOE \n</b>\tPlenty more where that came from.\n\n<b>\t\t\tPALE BLONDE \n</b>\tThank you, no, it's just till the\n\tDramamine works. I get carsick.\n\n<b>\t\t\tJOE \n</b>\tI only get carsick on boats. \n\t\t  (waits, then)\n\tBut seems to me that's more the\n\tfish smell than the bouncing...\n\nJoe realizes that her eyes are closed. Mildly depressed, he\nstretches himself across both seats and turns on his radio,\nfinds only static and snaps it off. Further depressed, he\nexamines his reflection in the bus window, squeezes a black\nhead and runs the comb through his hair, picks a piece of\ntobacco off his tooth and lights a cigarette, watching the\nflame die in reflection, forgetting to discard the burnt-out\nmatch as he stares out at a vast lonely prairie, a solitary\ncowboy in the distance, a row of sharecropper shacks\napparently deserted, a barefoot little girl motionless at the\nroadside, watching the bus pass. Through this, leading into\nthe next scene, Sally Buck sings softly \"... if that mocking\nbird don't sing, Grammaw gonna buy you a golden ring...\"\n\n<b>INT. REMEMBERED BEAUTY SALON - ANOTHER TIME\n</b>\nSally Buck, relaxing in the middle of a busy day, eyes closed\nwearily, while little Joe massages her neck. Her song\ncontinues over the noises of the busy beauty parlor \"... if\nthat golden ring turns brass, Grammaw gonna buy you a looking\nglass...\"\n\n<b>\t\t\tSALLY BUCK\n</b>\tNo, a little lower, sugar, yeah,\n\tyeah, that's good. Grammaw's beat.\n\n<b>\t\t\tSALESMAN'S VOICE \n</b>\tYou gotta sell yourself, that's the\n\twhole trick...\n\n<b>INT. BUS - DAY\n</b>\nA seedy TRAVELING SALESMAN with badly-fitted dentures and a\nfrayed collar has taken the aisle seat next to Joe. As he\nlectures Joe on salesmanship, he figures his expenses in a\nworn leatherette notebook, nervous fingers and eyes\nunconsciously revealing the extent of his failure.\n\n<b>\t\t\tSALESMAN \n</b>\tIt ain't the product and it ain't\n\tthe price, no sir, and it ain't\n\twhat you sell, it's personality,\n\tpure and simple. I ain't shined my\n\town shoes or shaved my own face in\n\tforty years, how's that? Not bad\n\tfor a kid that didn't pass the\n\teighth grade, right?\n\n<b>\t\t\tJOE \n</b>\tYeah, hell, yeah.\n\n<b>\t\t\tSALESMAN\n</b>\tAnd that's my golden rule. Make 'em\n\tlove you. Put yourself over and you\n\tcan sell them anything. If they\n\tlike you, they'll buy horsemeat for\n\tprime beef...\n\n<b>INT. REMEMBERED BEAUTY SALON - ANOTHER TIME\n</b>\nA gawky, adolescent Joe sits sprawled on the couch, leafing\nthrough a magazine while Sally Buck bleaches the roots of a\nyoung woman's hair.\n\n<b>\t\t\tSALLY BUCK \n</b>\tYou get him to the church, honey.\n\tHe ain't gonna find out you ain't a\n\treal blonde till after you're\n\tmarried, then's too late.\n\nSally Buck turns, pretending to be stern as Toe laughs.\n\n<b>\t\t\tSALLY BUCK (CONT'D)\n</b>\tYou getting too big for your\n\tbritches, sugar.\n\n<b>EXT. HIGHWAY - NIGHT\n</b>\nThe headlights of the bus flash past a huge sign, painted on\nthe slant roof of a barn: JESUS SAVES.\n\n<b>INT. BUS - NIGHT\n</b>\nJoe is alone again. The Salesman has disappeared. The bus is\ndark, most-passengers trying to sleep. Only one reading light\nstill burns, over the head of the old-Lady in the seat ahead\nof Joe. Joe squirms, restless, trying to lull himself to\nsleep with the music of a revivalist gospel group on the\nradio.\n\n<b>\t\t\tSALLY BUCK'S VOICE \n</b>\tDon't forget to say your prayers,\n\thoney...\n\nJoe leans forward to help the old Lady, irritably struggling\nwith the release button on her seat. She scowls as Joe leans\nover to release her seat, then pulls her blanket around her\nand turns away from him. Joe switches off her reading light.\n\n<b>\t\t\tOLD LADY \n</b>\tI want it on.\n\nJoe switches it on again, fakes a good-natured grin, settles\nback with his radio, aware of an OLD COWHAND seated opposite\nhim, replacing the Pale Blonde. The Old Cowhand is appraising\nJoe's wardrobe curiously. He looks away when he sees Joe\nwatching him. Joe settles back, unable to think of a way to\nopen a conversation.\n\n<b>\t\t\tEVANGELIST'S VOICE\n</b>\tOh, my friends, I say unto you,\n\tinvest with Jesus, put your dollars\n\tto work where they'll pay off at\n\tcompound interest. The Good Book\n\tsays money answereth all things...\n\nThe Old Cowhand has rolled-himself a cigarette. Joe quickly\nlights a match on his thumb and holds it across the aisle.\n\n<b>\t\t\tJOE \n</b>\tLight?\n\nThe Old Cowhand's \"thanks\" is lost in a fit of coughing as he\ninhales his first drag. He settles back, wiping his watery\neyes on a faded bandana.\n\n<b>\t\t\tEVANGELIST'S VOICE \n</b>\t... everyone who sends a dollar to\n\tthe Evangelical Congregation of the\n\tAir will get free gratis a genuine\n\tleatherette hymn book so you can\n\tsing along with Sister Rosella and\n\tthe Evangelical Choir...\n\n<b>\t\t\tJOE\n</b>\tYou throw in Sister Rosella and you\n\tgot a deal, right, old timer?\n\nJoe glances across the aisle. The Old Cowhand manages a\nfaint, humorless smile.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tGoing far?\n\n<b>\t\t\tOLD COWHAND \n</b>\tUp the line. Not far.\n\n<b>\t\t\tJOE\n</b>\tI'm bound for New York City.\n\nThe Old Cowhand reappraises Joe's wardrobe even more\ncuriously.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tEver happen to come across a cowman\n\tname of Woodsy Niles? Friend of my\n\tgrammaw Sally Buck...\n\nThe Old Cowhand considers, shakes his head. Joe leans back,\nlaughing to himself.\n\n<b>INT. REMEMBERED BEDROOM - ANOTHER TIME\n</b>\nLittle Joe's head is lost in a beat-up cowboy hat, similar to\nthe one worn by the old Cowhand. Sally Buck smiles on WOODSY\nNILES -- a long-legged cowboy with a shock of black hair --\nwho stands at her dressing table, admiring himself in a new\nStetson.\n\n<b>\t\t\tSALLY BUCK \n</b>\tLike it, honey? Does it fit?\n\n<b>\t\t\tWOODSY \n</b>\tYou do me good, Sal, you do me real\n\tgood. You know what I gonna give\n\tyou for that Stetson?\n\nWoodsy grabs Sally Buck, lifting her off her feet, carrying\nher to the bed. Struggling, they fall across the covers\ntogether, Little Joe laughing with them.\n\n<b>\t\t\tSALLY BUCK \n</b>\tWoodsy Niles! The boy!\n\n<b>\t\t\tWOODSY \n</b>\tHe don't know what makes little\n\tapples by now, it's time he found\n\tout.\n\n<b>INT. BUS - NIGHT\n</b>\nJoe shakes his head, grinning, offering the old Cowhand a\ncigarette.\n\n<b>\t\t\tJOE\n</b>\tSmoke?\n\nThe old Cowhand shakes his head, showing the rolled cigarette\nJoe lit for him. Joe nods, still bemused.\n\n<b>INT. REMEMBERED BEDROOM - ANOTHER TIME\n</b>\nLittle Joe is cuddled in Sally Buck's arms, under the covers,\nwatching Woodsy, sitting cross-legged on the bed, naked\nexcept for his Stetson and guitar, singing drunkenly.\n\n<b>\t\t\tWOODSY\n</b>\t... git along little dogies!\n\n<b>EXT. MIDWEST TOWN - MORNING\n</b>\nFrom a high angle -- the bus slows to a stop.\n\n<b>INT. BUS - MORNING\n</b>\nJoe awakens, stiff-necked, momentarily confused. He\nstraightens in his seat as he sees the old Cowhand lifting a\nsweat-stained saddle down from the overhead rack, starting\ntoward the front of the bus. Joe calls after him.\n\n<b>\t\t\tJOE\n</b>\tNice talking to you, old timer.\n\nJoe stuffs a stick of gum in his mouth, turns to wave at the\nOld Cowhand through the window as the bus pulls away.\n\n<b>\t\t\tWOODSY'S VOICE\n</b>\tShe-dogs squat, boy. He-dogs stand\n\tup and lift their leg...\n\n<b>INT. REMEMBERED MEN'S ROOM - ANOTHER TIME\n</b>\nWoodsy, in his new Stetson, watches Little Joe in his beat-up\ncowboy hat, trying to balance on one foot, one leg lifted in\nfront of the trough. Woodsy roars with laughter.\n\n<b>\t\t\tWOODSY \n</b>\t... but he-men stand and shoot from\n\tthe hip.\n\n<b>INT. BUS RESTROOM - DAY\n</b>\nJoe laughs, flushes, checks his hair in the mirror.\n\n<b>EXT. HIGHWAY - DAY\n</b>\nThe bus streaks past a brightly-colored billboard -- IN NEW\n<b>YORK, A WELCOME AWAITS YOU AT THE TIMES SQUARE PALACE HOTEL!\n</b>\n<b>INT. BUS - DAY\n</b>\nJoe is now sitting in the wide rear seat, between two young\nMARINES and a group of VETERANS wearing campaign caps and\nconvention buttons, passing a bottle, singing \"From the Balls\nof Montezuma to the Shores of Tripoli...\" Joe follows the\nconversation between a VETERAN and a MARINE, participating\nonly because he's sitting beside them, adopting a remembered\nmilitary stance.\n\n<b>\t\t\tVETERAN\n</b>\tEver stationed at Kennedy? Those\n\tFlorida chicks...\n\n<b>\t\t\tMARINE \n</b>\tInstant V-goddam-D.\n\n<b>\t\t\tVETERAN \n</b>\tThis Pensacola teeny-bopper -- jail\n\tbait -- but built? Ten bucks she\n\twanted. Three of us made a deal\n\tfor, twenty-five, see, big goddam\n\tbargain?\n\n<b>\t\t\tMARINE \n</b>\tBig peni-goddam-cillin bargain,\n\tright?\n\n<b>\t\t\tVETERAN \n</b>\tYou got it.\n\n<b>\t\t\tMARINE \n</b>\tNo. You got it.\n\n<b>\t\t\tJOE \n</b>\tJesus goddam Christ, I ain't\n\tlaughed so hard since I was out at\n\tFort Benning, Georgia.\n\n<b>\t\t\tMARINE\n</b>\tDid you make the Viet?\n\n<b>\t\t\tJOE \n</b>\tWhat? Oh, hell no. Motor pool\n\tmostly...\n\t\t  (shakes his head)\n\tKee-rist...\n\n<b>INT. REMEMBERED WHOREHOUSE - ANOTEER TIME\n</b>\nA plump, aging PROSTITUTE laughs up into camera.\n\n<b>\t\t\tPROSTITUTE \n</b>\tHey, hey, what you try to do to me?\n\tYou gonna cost me money, soldier!\n\n<b>INT. BUS - DAY\n</b>\nJoe laughs as he passes the bottle, trying to sing along\nwithout knowing the words as the Veterans segue into \"Over\nhill, over dale, we will hit the dusty trail, as the caissons\ngo rolling along...\"\n\n<b>INT. REMEMBERED BEAUTY SALON - ANOTHER TIME\n</b>\nSally Buck fondly wipes lipstick from Joe's lips.\n\n<b>\t\t\tSALLY BUCK\n</b>\tKeep your meat hooks off my\n\toperators, sugar, hear?\n\n<b>INT. BUS - DAY\n</b>\nJoe slaps one of the Veterans on the back, trying to follow\nthe song into \"Off we go, into the wild blue yonder...\"\n\n<b>INT. REMEMBERED MOVIE HOUSE - ANOTHER TIME\n</b>\nANASTASIA clutches a younger Joe, eyes wild, gasping.\n\n<b>\t\t\tANASTASIA \n</b>\tYou're the only one, Joe, the only,\n\tonly one ever!\n\n<b>INT. BUS - DAY\n</b>\nJoe is leaning across the two Marines, staring out of the\nwindow as the Veterans switch to \"Anchors aweigh, my boys,\nanchors aweigh...\"\n\n<b>EXT. MANHATTAN SKYLINE - DAY\n</b>\nA stunning view through the bus window past Joe's reflection.\n\n<b>\t\t\tJOE'S REFLECTION \n</b>\tGonna swing my lasso and rope that\n\twhole goddam island, yeah!\n\n<b>EXT. BROADWAY PARADE - DAY\n</b>\nDrum majorettes leading the parade -- ticker tape and\nconfetti -- girls at skyscraper windows.\n\n<b>INTERCUT NEWSREEL CLIP\n</b>\nCharles Lindberg (or James Stewart) waving at the crowd.\n\n<b>EXT. NEW YORK HARBOR - DAY\n</b>\nGirls lining the piers -- flags, banners, bunting -- ship\nhorns, whistles, bells.\n\n<b>INT. BUS - DAY\n</b>\nJoe crowded as the veterans prepare to leave the bus, lifting\ndown banners and flags.\n\n<b>EXT. LINCOLN TUNNEEL - DAY\n</b>\nThe bus suddenly surrounded by converging traffic, horns\nhonking, segueing into the noises of Times Square.\n\n<b>EXT. MARQUEE - DAY\n</b>\nFlag draped, reading: WELCOME VETERANS.\n\n<b>EXT. STREET - BANNER - DAY\n</b>\nFlapping in the wind -- WELCOME VETERANS!\n\n<b>EXT. TIMES SQUARE PALACE HOTEL - DAY\n</b>\nThe marquee announces TRANSIENTS WELCOME. O.S. a singing\nradio station break blares \"W-I-N-S NEW YORK...\"\n\n<b>EXT. RADIO TOWER - DAY\n</b>\nThe sign flashes WINS \"... ten-ten on your dial!\" A torchy\nwoman's voice sings from a lonely echo chamber -- introducing\na love theme which will haunt Joe throughout the film.\n\n<b>INT. ROOM 1014 - DAY\n</b>\nJoe sets his radio on the dresser, his suitcase on the bed,\nthen turns to examine his new home -- as anonymous as his\nTexas hotel room -- but boasting a coin-operated television\nset. Fascinated, Joe inserts a quarter.\n\n... the love song continues over a television talk Show\nfeaturing a POODLE WIGMAKER defending his profession against\na Joe Pyne-type PANEL HOST, \"...well, I perform a real\nservice, there's a need, so many people, you know, really\nlive in their pets, I mean, lonely, I grant you, but their\nfeeling is real. They want to lavish as much love, give them\nas much, yes, pamper them like they were really human\nchildren or whatever...\"\n\n<b>\t\t\tSALLY BUCK'S VOICE \n</b>\tThere's a TV dinner in the fridge,\n\tlover boy...\n\n<b>INT. REMEMBERED PARLOR - ANOTHER TIME\n</b>\nLittle Joe stares sullenly at an antique TV box while Sally\nBuck puts her hat on at the fireplace mirror. There is a\nframed picture of Woodsy Niles on the mantle.\n\n<b>\t\t\tSALLY BUCK \n</b>\tYou be okay, won't you? Maybe I\n\tbring you a treat if you're a good\n\tboy...\n\n<b>INT. ROOM 1014 - DAY\n</b>\nJoe watches the Panel Host, \"... you're a nut case, fella, a\nreal nut case...\"\n\n<b>INT. REMEMBERED BEAUTY SALON - ANOTHER TIME\n</b>\nLittle Joe massaging Sally Buck's neck -- continuing the\nearlier scene.\n\n<b>\t\t\tSALLY BUCK \n</b>\tI'm so beat, no point you waiting\n\tround, toots, think I'll stop in\n\tfor a beer or two...\n\n<b>INT. ROOM 1014 - DAY\n</b>\nJoe sits on the edge of the bed, watching the poodles primp.\n\n<b>INT. REMEMBERED PARLOR - ANOTEER TIME\n</b>\nLittle Joe stares unblinking at the TV screen as Sally Buck\nkisses him on the forehead, dressed for the street.\n\n<b>\t\t\tSALLY BUCK \n</b>\tExpect me when you see me. Looks\n\tlike I got me a new beau, lover\n\tboy, how's that for an old grammaw?\n\tI'll leave you movie money...\n\nSally Buck tucks a dollar bill under a framed picture of\nJesus, who has replaced Woodsy Niles on the mantle.\n\n<b>INT. ROOM 1014 - DAY\n</b>\nAs a fairy godmother's magic wand removes sticky hair spray\nfrom a pretty model's head, Joe's quarter runs out and the\nscreen goes blank. At the same moment, the love song is cut\noff by a singing station break \"W-I-N-S NEW YORK\" Joe rises,\nflipping the dial of the radio to a cultured woman's voice\nreading \"...the Dow Jones averages, brought you by Morgan\nVandercook. Up your income with sound investment\ncounseling...\"\n\n<b>\t\t\tJOE \n</b>\tUp yours, lady.\n\n... but Joe leaves the lady on, savoring the expensive sound\nof her voice reading the stock quotations. Joe seats himself\nat the desk, pleased to find a postcard photograph of the\nhotel. He picks up a ballpoint pen, counts ten floors up from\nthe street and marks a huge X -- THIS IS ME, then turns the\ncard over, pen poised over the address blank.\n\n<b>INT. CAFETERIA SCULLERY - DAY\n</b>\nRalph stares at the card, surrounded by dirty dishes.\n\n<b>\t\t\tRALPH\n</b>\tHell, he know I can't read...\n\n<b>INT. ROOM 1014 - DAY\n</b>\nJoe's pen wavers, starts to write and stops.\n\n<b>EXT. SALLY BUCK'S BEAUTY PARLOR - DAY\n</b>\nAs we saw it last, deserted, a FOR RENT sign in the window.\nJoe's reflection appears, staring at himself, dressed in his\ndishwasher's clothes.\n\n<b>\t\t\tJOE'S VOICE \n</b>\tAfter all them dishes are washed,\n\twhat?\n\n<b>\t\t\tJOE'S REFLECTION \n</b>\tThen they bring some more dishes\n\tand I wash them and then I, uh,\n\tsleep some and then wash some more\n\tdishes and then I...\n\n<b>\t\t\tJOE'S VOICE\n</b>\tSay it, lover boy!\n\n<b>\t\t\tJOE'S REFLECTION \n</b>\tDie.\n\n<b>INT. ROOM 1014 - DAY\n</b>\nJoe stares at the postcard, bemused,\n\n<b>\t\t\tJOE'S VOICE\n</b>\tWell, you better just shake your\n\ttail, lover boy, and root, hog or\n\tdie.\n\nJoe rises abruptly, rips up the postcard and tosses it out\nthe window.\n\n<b>\t\t\tJOE\n</b>\tGoddam if I came to this town to\n\twrite postcards.\n\n<b>EXT. TIMES SQUARE - DAY\n</b>\nThe torn fragments flutter down on the crowd -- a woman\nbrushing irritably at her hair -- a man grimacing, glancing\nup -- a cop removing his hat to examine it.\n\n<b>EXT. TIMES SQUARE PALACE HOTEL - DAY\n</b>\nFrom a low angle -- identical with the postcard photograph --\nan unseen hand scrawls a huge X--- THIS IS ME. Camera zooms\nup to a close-up of Joe at the window.\n\n<b>EXT. FIFTH AVENUE - DAY\n</b>\nFrom on high -- as though Joe were watching himself -- the\nStetson moves through a crowd of Fifth Avenue shoppers...\n\n<b>EXT. GLASS BUILDING - DAY\n</b>\n... passing a glass bank, lady tellers counting money...\n\n<b>EXT. CAR SHOWROOM - DAY\n</b>\n... passing a display of imported luxury cars...\n\n<b>EXT. JEWELRY STORE - DAY\n</b>\n... passing a window which features a single gem -- pausing\nas horns blast O.S. and a mod blonde in a stalled sports car\nmotions to Joe -- she needs a push. Joe grins, glances at\nhimself in the window, runs a comb through his hair, then\nturns back to see a cop helping the mod blonde. \n\n<b>EXT. PARK AVENUE - DAY\n</b>\nJoe's heels drag as he walks a deserted block of luxury\napartment houses. O.S. The torchy woman's voice sings Joe's\nlove theme in counterpoint to the blasting horns, a siren, a\nfire bell, a screech of brakes. Joe's spirits rise as he\nhears the tic-tac-tic of high heels overtaking the heavy\nclick-clack-click of his boots. He adjusts his pace to arrive\nat the corner at the same time as a smart and -- in Joe's\neyes -- very RICH LADY. Joe grins boyishly, holding his\nStetson over his heart.\n\n<b>\t\t\tJOE\n</b>\tBeg pardon, ma'am, I'm new here in\n\ttown, just in from Houston, Texas,\n\tand looking for the Statue of\n\tLiberty.\n\nThe delicate profile gives no signs of hearing. Joe follows\nher to the parkway in the middle of the avenue. There she\nstops and turns, neither friendly nor hostile. \n\n<b>\t\t\tRICH LADY\n</b>\tWere you looking? About the Statue\n\tof Liberty?\n\n<b>\t\t\tJOE \n</b>\tJoking? No, ma'am. Oh no! I mean\n\tbusiness!\n\n<b>\t\t\tRICH LADY \n</b>\tI'm sorry. I thought you were --\n\tnever mind -- I've never actually\n\tbeen there, but let me see, you\n\ttake the Seventh Avenue subway, I\n\tthink, to the end of the line...\n\n<b>\t\t\tJOE \n</b>\tYou sure are a pretty lady.\n\nThe Rich Lady tries to frown, taken aback, blushing.\n\n<b>\t\t\tRICH LADY\n</b>\tYou're not looking for the Statue\n\tof Liberty at all.\n\n<b>\t\t\tJOE \n</b>\tNo, ma'am, I'm not.\n\n<b>\t\t\tRICH LADY\n</b>\tWhy, that's perfectly dreadful.\n\tAren't you ashamed of yourself?\n\nA twinkle of amusement and sympathy reveals the age lines at\nthe corner of her eyes. Then she continues on quickly, just\nas the light turns. Joe's view is blocked for a moment by\ntraffic, then he sees...\n\n... the Rich Lady, newly aware of her flanks as she climbs\nthe steps of a brownstone and searches for her key. Still\nfrom Joe's viewpoint, he sees himself move into frame and\nfollow the Rich Lady up the steps. The love theme swells O.S.\nas the Rich Lady leads him into the house and closes the\ndoor...\n\n... leaving Joe standing alone on the parkway island,\nsurrounded by towering wealth. The love theme continues\nover...\n\n<b>EXT. LEXINGTON AVENUE - DAY\n</b>\n... a pair of high-heeled pink slippers, walking a miniature\npoodle -- slowing slightly, reacting to Joe's cowboy boots as\nthey pass, pause and turn back.\n\n<b>\t\t\tCASS'S VOICE \n</b>\tHurry up, Baby. Do um goody-goods\n\tfor Mama.\n\nJoe grins, holding his hat over his heart as he approaches\nCASS TREHUNE, a blonde lady in a tight black dress, with the\nlook of a movie star who wrecked her career with food.\n\n<b>\t\t\tJOE \n</b>\tBeg pardon, ma'am. I'm brand\n\tspanking new to this town, come \n\tfrom Houston, Texas, and hoping to\n\tget a look at the Statue of\n\tLiberty...\n\n<b>\t\t\tCASS \n</b>\tYou're hoping to get a look at\n\twhat?\n\n<b>\t\t\tJOE \n</b>\tThe Statue of Liberty.\n\n<b>\t\t\tCASS \n</b>\tIt's up in Central Park, taking a\n\tleak. If you hurry, you'll make the\n\tsupper show. Now get lost.\n\nBut as she turns, Cass winks, dimpling the corners of her\nmouth, signaling Joe to follow her.\n\n<b>INT. APARTMENT HOUSE ELEVATOR - DAY\n</b>\nCass holds the DOOR OPEN button till Joe enters the elevator,\nthen the doors close with a soft expensive little kllooosh\nand Cass turns with the smile of a very tiny girl...\n\n<b>\t\t\tCASS \n</b>\tHi.\n\n... her lips closing on Joe's as the poodle yaps shrilly at\ntheir feet. Superimposed, almost subliminally, a golden\ndollar sign appears, halating like a star, and the bell of a\npinball machine rings O.S.\n\n<b>INT. CASS'S APARTMENT - DAY\n</b>\nA princess telephone is ringing on a gold and white desk.\nCass runs to grab it...\n\n<b>\t\t\tCASS \n</b>\tHello?\n\n... as Joe steps from the elevator, which opens directly onto\nCass's penthouse. Cass beckons him toward her, hooks a finger\ninto his neckerchief and pulls his mouth toward hers while\nshe talks on the phone.\n\n<b>\t\t\tCASS (CONT'D)\n</b>\tMorey? Hi-ee, honey...\n\nCass gurgles happily as her free hand unbuckles Joe's\ngarrison belt.\n\n<b>\t\t\tCASS (CONT'D)\n</b>\tI'm just out of breath, honey,\n\trunning to catch the phone.\n\nAs her fingers reach for Joe's zipper, cut to...\n\n... Joe's hand unzipping her dress.\n\n<b>\t\t\tCASS (CONT'D)\n</b>\tI was walking Baby. Him got to do\n\thim goody-goods, right?\n\nThe poodle tugs at Joe's slacks until they fall. Cass steers\nher ear to Joe's mouth, shuddering deliciously.\n\n<b>\t\t\tCASS (CONT'D)\n</b>\tOh God, oh stop. I can't stand\n\tthat. I just die...\n\t\t  (quickly into phone)\n\tIt's Baby, Morey. Him trying to say\n\thello. Say hello to Morey, Baby.\n\nCass holds the phone toward the yapping poodle, twisting\nherself against Joe as she wriggles out of her dress, passing\nthe phone from one hand to the other.\n\n<b>\t\t\tCASS (CONT'D)\n</b>\tOkay, old goosie? Now lookie, when\n\tdo you want me to meet you?\n\tWhatever you say. I'll take a nap,\n\twatch TV, you know, kill time.\n\tOkay, but just one, a big wet one.\n\nCass hangs up. The poodle yaps hysterically, disentangling\nhimself from her tumbling dress -- hops onto the couch \nglances off and flees again as an overturned lamp crashes\n<b>O.S.\n</b>\n<b>INT. CASS'S BEDROOM - DAY\n</b>\nThe poodle bounces onto the bed -- remaining long enough to\nestablish a TV REMOTE CONTROL TUNER lying on the satin\ncoverlet -- then leaps down in panic as he hears Joe and Cass\nexplode into the bedroom, laughing lustily...\n\n... the remote control tuner buried suddenly under the full\nflesh of Cass's hip, activating...\n\n... a twenty-five-inch television screen, blasting at full\nvolume...\n\n... Cass's eyes widening, profoundly impressed...\n\n<b>\t\t\tCASS \n</b>\tYe gods...\n\n... the images and sound of the television set flicking\njoyfully from channel to channel...\n\n... Joe laughing, engulfed by Cass's abundance...\n\n... Cass wild-eyed, overflowing the frame...\n\n... a gleaming slot machine -- three Sahara cowgirls clicking\ninto line for jackpot -- silver dollars overflowing the\nframe...\n\n<b>EXT. MANHATTAN SKYLINE - DAY\n</b>\n... the Mutual of New York tower flashes MONY!\n\n<b>\t\t\tJOE'S VOICE \n</b>\tHoly shee-it, this is a goddam\n\tpenthouse you got here, Cass, a\n\treal goddam penthouse.\n\n<b>INT. CASS'S BEDROOM - DAY\n</b>\nJoe turns away from a small terrace, buckling his belt,\nglancing off toward the sound of Cass in the shower. He\nflicks the TV remote control, enjoying his power, ignoring\nthe silent images on the screen -- battle casualties, a\npretty girl recommending aspirin, a man's stomach flashing\nanimated pain, starving war refugees, a dog eating pzazz --\nflicking it off to concentrate on the costume jewelry and\nperfume bottles on Cass's dressing table.\n\n<b>\t\t\tCASS'S VOICE\n</b>\tDon't look, baby...\n\nJoe turns to look as Cass comes from the bathroom, holding a\ntowel around her as she runs behind the closet door.\n\n<b>\t\t\tJOE \n</b>\tSay, Cass, I, uh, sure have enjoyed\n\tbeing here. Believe it's as fine a\n\ttime as I've had in my life!\n\n<b>\t\t\tCASS'S VOICE \n</b>\tMe, too, lover.\n\n<b>\t\t\tJOE\n</b>\tThat's good, it is, cause, well I\n\tguess I didn't tell you why I came\n\tto New York, did I?\n\nA tower of black bugle beads emerges from the closet door.\n\n<b>\t\t\tCASS\n</b>\tZip this thing, will you, Tex?\n\nJoe zips her dress, follows her to the dressing table, where\nshe sprays her hair with lacquer.\n\n<b>\t\t\tJOB \n</b>\tTruth is, Cass, I'm, well, I'm in\n\tbusiness.\n\n<b>\t\t\tCASS \n</b>\tOh, poor you. Morey's got terrible\n\tulcers.\n\nCass stretches her upper lip across her teeth and she smears\nit with, orange lipstick.\n\n<b>\t\t\tJOE \n</b>\tDon't know what line Morey's in,\n\tbut myself now, fact is -- I'm a\n\thustler.\n\n<b>\t\t\tCASS \n</b>\t\t  (lips stretched)\n\tHers'n zodda meg a livig.\n\n<b>\t\t\tJOE \n</b>\tBeg pardon, ma'am?\n\n<b>\t\t\tCASS \n</b>\tSaid, a person's gotta make a\n\tliving.\n\n<b>\t\t\tJOE \n</b>\tYou sure you heard what I said?\n\n<b>\t\t\tCASS \n</b>\tScuse me, hon, fraid I'm only half\n\there. Maybe you oughta run on\n\talong. But why don't you take this\n\tphone number?\n\nJoe grins, relieved as she takes out a gold lame purse and\nopens it. He frowns as she folds; it upside down, empty.\n\n<b>\t\t\tCASS (CONT'D)\n</b>\tDarn! I didn't get to the bank --\n\tTex -- could you let me have a\n\tlittle coin for the taxi-waxi?\n\nJoe stands mute as she cups his chin in her hand,\nseductively.\n\n<b>\t\t\tCASS (CONT'D)\n</b>\tYou're such a doll. I hate money,\n\tdon't you? God, it's been fun.\n\n<b>\t\t\tJOE \n</b>\tFunny thing, you mentioning money.\n\tI was just about to ask your for\n\tsome...\n\nJoe tries to laugh but it sticks in his throat as Cass speaks\n-- an impassioned whisper -- still holding Joe's chin.\n\n<b>\t\t\tCASS \n</b>\tYou bastard! You son of a bitch!\n\tYou think you're dealing with some\n\told slut? Look at me! You think\n\tjust cause you're a longhorn bull\n\tyou can get away with this crap?\n\tWell, you're out of your mind. I am\n\ta gorgeous chick, thirty-one,\n\tthat's right, you said it!\n\nSobbing suddenly, she throws herself on the bed. Joe stands\nbewildered by the vastness of her grief.\n\n<b>\t\t\tJOE \n</b>\tHey. Hey, Cass. Did you think I\n\tmeant that? Christ, would I be\n\tasking you for money with a wad\n\tlike that riding on my hip?\n\nJoe waves his wallet at her, but she only cries louder. He\nhands her a kleenex. She clutches it to her face, wailing.\nJoe leans over the bed, whispering in her ear:\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tHey. You are a gorgeous-looking\n\tpiece, Cass. Guy gets horny, just\n\tlooking at you. It's a fact. How\n\tmuch you need for that taxi? Ten?\n\tTwenty? There you go.\n\nJoe tucks a twenty-dollar bill into her bosom, tilts his\nStetson and starts out. Cass blows her nose, looking after\nhim. O.S. chorus sings, \"From this valley they say you are\ngoing -- we will miss your bright eyes and sweet smile...\"\n\n<b>EXT. LEXINGTON AVENUE - DAY\n</b>\nFrom a high angle, Joe walks away from the apartment house,\nchorus continuing O.S. \"... they say you are taking the\nsunshine that brightened our pathway a while.\"\n\n<b>INT. EVERETT'S BAR - DAY\n</b>\nJoe sits at the bar, staring morosely at his image in the\nmirror, already quite drunk, oblivious to the assorted types\nhiding from daylight in the barn-like saloon, waiting for\nnight to fall.\n\n<b>\t\t\tRATSO'S VOICE \n</b>\tExcuse me, I'm just admiring that\n\tcolossal shirt...\n\nRATSO studies Joe across the corner of the bar -- a sickly,\nchild-size old man of twenty-one -- hopefully nursing an\nempty beer glass, contemplating the money on the bar in front\nof Joe.\n\n<b>\t\t\tRATSO \n</b>\tThat is one hell of a shirt. I bet\n\tyou paid a pretty price for it, am\n\tI right?\n\n<b>\t\t\tJOE \n</b>\tOh, it ain't cheap. I mean, yeah,\n\tI'd say this was an all right\n\tshirt. Don't like to, uh, you know,\n\thave a lot of cheap stuff on my\n\tback.\n\nRatso spits as JACKIE leans on the bar next to Joe -- a\nfeminine young person, heavily made-up, hair teased, wearing\nearrings and a lace-trimmed blouse over shocking pink  levis.\n\n<b>\t\t\tJACKIE \n</b>\tGot a cigarette, cowboy?\n\n<b>\t\t\tRATSO\n</b>\t\t  (a stage whisper)\n\tMore goddam faggots in this town.\n\nReaching for a cigarette, Joe glances at Jackie, startled as\nJackie twitches his pink levis angrily and turns away.\n\n<b>\t\t\tJOE\n</b>\tShee-it...\n\t\t  (shakes his head)\n\tKee-rist, you really know the\n\tropes. Wish to hell I bumped into\n\tyou before. I'm Joe Buck from Texas\n\tand I'm gonna buy you a drink, what\n\tdo you say to that?\n\n<b>\t\t\tRATSO \n</b>\tEnrico Rizzo from the Bronx. Don't\n\tmind if I do.\n\n<b>\t\t\tJOE\n</b>\t\t  (slaps bar)\n\tSame all around! For my friend,\n\ttoo!\n\nThe TV screen over the bar features a mating game program as\nJackie cruises down to join a tall farm boy with plucked\neyebrows. The TV HOST points to three young men, visible only\nfrom the shoulders up, from whom a pretty DATE GIRL in\nblindfold must choose an escort.\n\n<b>\t\t\tTV HOST \n</b>\t... and for the losers, who don't\n\tget the girl, we'll give as\n\tconsolation prices -- a six month\n\tsupply of underarm deodorant...\n\nIn a booth now -- the TV screen in the background, continuing\nthe game -- Joe is refilling Ratso's beer glass as he speaks,\nloud over the laughter of the TV audience.\n\n<b>\t\t\tJOE \n</b>\t... you see what I'm getting at\n\there? She got a penthouse up there\n\twith color TV and more goddam\n\tdiamonds than an archbishop and she\n\tbusts out bawling when I ask for\n\tmoney!\n\n<b>\t\t\tRATSO \n</b>\tFor what?\n\n<b>\t\t\tJOE \n</b>\tFor money.\n\n<b>\t\t\tRATSO \n</b>\tFor money for what?\n\n<b>\t\t\tJOE \n</b>\tI'm a hustler, hell, didn't you\n\tknow that?\n\n<b>\t\t\tRATSO \n</b>\tHow would I know? You gotta tell a\n\tperson these things \n\t\t  (shakes his head)\n\tA hustler? Picking up trade on the\n\tstreet like that -- baby, believe\n\tme -- you need management.\n\n<b>\t\t\tJOE \n</b>\tI think you just put your finger on\n\tit, I do.\n\n<b>\t\t\tRATSO \n</b>\tMy friend O'Daniel. That's who you\n\tneed. Operates the biggest stable\n\tin town. In the whole goddam\n\tmetropolitan area. A stud like you \n\t- paying! -- not that I blame you --\n\ta dame starts crying, I cut my\n\theart for her...\n\n<b>\t\t\tJACKIE'S VOICE \n</b>\tI'd call that a very minor\n\toperation...\n\nRatso grabs the neck of a bottle, sliding back in the booth.\nJoe scowls as Jackie appears with the tall farm boy.\n\n<b>\t\t\tJACKIE \n</b>\t... in fact, you just sit comfy and\n\tI'll cut it out with my fingernail\n\tfile. You won't even need Blue\n\tCross, Ratso.\n\n<b>\t\t\tRATSO \n</b>\tThe name is Rizzo.\n\n<b>\t\t\tJACKIE \n</b>\tThat's what I said, Ratso.\n\n<b>\t\t\tJOE \n</b>\t\t  (suddenly)\n\tHey now, you heard him.\n\nOn the TV screen -- the Date Girl announces:\n\n<b>\t\t\tTV DATE GIRL \n</b>\tI pick Number Two! He's cool!\n\n<b>\t\t\tRATSO \n</b>\tThat's okay, Joe. I'm used to these\n\ttypes that like to pick on\n\tcripples. Sewers're full of 'em.\n\n<b>\t\t\tJACKIE\n</b>\tMay I ask one thing, cowboy? If you\n\tsit there and he sits way over\n\tthere, how's he gonna get his hand\n\tinto your pocket? But I'm sure he\n\thas that all figured out...\n\t\t  (to Ratso)\n\tGood night, sweets.\n\n<b>\t\t\tTV HOST\n</b>\tMay present your chosen mate!\n\nThe TV host pulls aside the screen which has concealed the\nlower half of the three young men. Number Two, her chosen\nmate, is a dwarf sitting on a high stool. The girl's\nspontaneous dismay starts everyone laughing hysterically,\nincluding the dwarf.\n\n<b>EXT. SIXTH AVENUE - DAY\n</b>\nJoe has difficulty keening up with Ratso, who swings himself\nalong with surprising agility, his half skipping little gate\nfavoring one game leg.\n\n<b>\t\t\tRATSO \n</b>\tLook, with these chicks that want\n\tto buy it, most of 'em are older,\n\tdignified, right? Social register\n\ttypes. They can't be trotting down\n\tto Times Square to pick out the\n\tmerchandise. They need a middleman,\n\tright? That's O'Daniel.\n\nJoe hesitates as Ratso darts into traffic against a red\nlight, yelling unheard obscenities at a cab driver who blasts\nhis horn. Joe runs recklessly forward as Ratso slams the taxi\nfender with his fist, pretending to be hit, falling into\nJoe's arms. The taxi stops, halting traffic. Ratso, recovers,\nstrolls casually in front of the cab, biting his thumb at the\ndriver.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tIt is a crime, a stud like you\n\tpassing out double sawbucks to a\n\tchick like that. With proper\n\tmanagement you should be taking\n\thome fifty, a hundred bucks a day.\n\tMore if you wanta moonlight...\n\n<b>EXT. SIDEWALK CAFE - COCKTAIL HOUR\n</b>\nAt,the corner of Central Park South, Ratso points toward a\nyoung man with diamond cuff-links, sitting with a blue-haired\nmatron who puffs on a small cigar. Ratso waves jauntily at\nthe young man, raising his thumb and forefinger in a circle,\nleaving the young man baffled as Ratso hurries Joe on.\n\n<b>\t\t\tRATSO \n</b>\tHim I placed with O'Daniel just two\n\tweeks ago. And look. Not much of a\n\tstud either, what I hear...\n\n<b>EXT. CENTRAL PARK SOUTH - COCKTAIL HOUR\n</b>\nRatso automatically checks the coin return boxes of the phone\nbooths they pass. Walking the park side of the street,\nlooking across at the limousines and taxis waiting outside\nluxury hotels and apartment buildings.\n\n<b>\t\t\tJOE\n</b>\tHey, listen, how about you take me\n\tto mee this Mister O'Diddle bird\n\tright now?\n\n<b>\t\t\tRATSO \n</b>\tWell, Joe, you're a nice guy, and\n\tI'd be doing you both a favor, but\n\twhy? What'm I dragging my bum leg\n\tall over town for? It's no picnic\n\tand what for, for me myself, what?\n\nRatso stops opposite the Plaza hotel, pointing across at an\naristocratic blonde stepping out of a Rolls Royce.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tTomorrow when some piece like\n\tthat's scratching your back in a\n\tFifth Avenue townhouse, where'll\n\tyour pal Rizzo be? Nedicks.\n\n<b>\t\t\tJOE \n</b>\tHold it, just hold it. You think\n\tI'm that kinda sombitch? Just name\n\tyour cut, whatever you want, you\n\tgot it right now. Five? Ten, how's\n\tthat?\n\nJoe peels a ten from his wallet and offers it to Ratso.\n\n<b>\t\t\tRATSO \n</b>\tJoe, please. You know what I'd ask\n\tanyone else? Oh hell, tell you what\n\tI'll do, I'll take the ten...\n\t\t  (he does)\n\t... but when I hand you over to Mr.\n\tO'Daniel, I'll have to have another\n\tten, Joe; just to like cover\n\texpenses...\n\n<b>INT. PUBLIC PHONE BOOTH - DUSK\n</b>\nRatso is on the phone. Joe holds the door open, listening.\n\n<b>\t\t\tRATSO \n</b>\tThis boy is just your meat, Mr.\n\tO'Daniel, believe it, I'm telling\n\tyou -- what? -- Enrico Rizzo from\n\tthe Bronx. The point is he needs\n\tyou. Right now. Tonight...\n\t\t  (aside to Joe)\n\tI got his tongue hanging out...\n\n<b>EXT. WEST SIDE HOTEL - DUSK\n</b>\nCamera moves slowly up the anonymous wall of a drab hotel,\nfollowing the line of dim red lights marking the fire exits.\n\n<b>\t\t\tRATSO'S VOICE\n</b>\tName's Joe Buck. Cowboy. Just in\n\tfrom Texas, don't know the ropes,\n\tnew to the city, but very promising\n\tmaterial, sir, and ready, if you\n\tget what I mean. Fabulous. Right\n\taway. What's that room number there\n\tagain? \n\n<b>INT. WEST SIDE HOTEL ELEVATOR - DUSK\n</b>\nAs ancient open cage lift rises at the same pace as camera in\npreceding shot. Joe grins excitedly at Ratso, who nods but\nglances significantly at the elevator operator. Ratso follows\nJoe to door as the operator grinds to a stop.  \n\n<b>INT. WEST SIDE HOTEL CORRIDOR - DUSK \n</b>\nRatso steps out with Joe, gesturing to the corridor...\n\n<b>\t\t\tRATSO\n</b>\tHold it a second...\n\n... but the operator slams the door and starts on up. Ratso\nleans heavily on the down button, glancing at Joe.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tNine-oh-one, got it?\n\nRatso glances up the elevator shaft nervously, rings again\nand turns back to Joe. \n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tLet's see how you look. Fine. You\n\tlook fine. Now I'm gonna have to\n\thave that other ten...\n\n<b>\t\t\tJOE\n</b>\t\t  (digs in wallet)\n\tTen, ten -- I got a twenty -- take\n\tthat...\n\n<b>\t\t\tRATSO\n</b>\tOh hell, forget it. \n\n<b>\t\t\tJOE\n</b>\tNow take it. Go on. \n\t\t  (gives it to him)\n\tListen, where can I reach you?\n\tCause I'm gonna make this right\n\twith you soon's I get me set up...\n\n<b>\t\t\tRATSO\n</b>\tForget it.\n\n<b>\t\t\tJOE\n</b>\tI mean, dammit, where you live?\n\nRatso leans on the DOWN as the cage grinds slowly down into\nview and stops. \n\n<b>\t\t\tRATSO\n</b>\tSherry-Netherlands Hotel. Now get\n\tyour ass in there. He's waiting!\n\nRatso steps into the elevator as the door opens then closes,\nleaving Joe alone, repeating \"Cherry Neverlin\" as he starts\nalong the corridor looking for 901. \n\n<b>EXT. WEST SIDE HOTEL - DUSK \n</b>\nRatso bursts from the hotel, almost running as he disappears. \n\n<b>INT. WEST SIDE HOTEL CORRIDOR - DUSK\n</b>\nJoe finds 901 at a dark end of the corridor, knocks\nconfidently, hearing a few bars of his love theme as he\nstuffs a fresh stick of gum in his mouth. Then the door is\nthrown open by O'DANIEL -- for an instant appearing to wear a\ndiamond-studded skull-cap, the naked overhead light bulb\nbright after the dark corridor, halating in Joe's eyes like\nthe earlier dollar sign. \n\n<b>\t\t\tO'DANIEL\n</b>\tYou must be Joe Buck. Come in. \n\nO'Daniel, fat in a worn-out bathrobe, examines Joe like a\nprodigal son as he leads him into the room -- as anonymous as\nJoe's own room. \n\n<b>\t\t\tO'DANIEL (CONT'D)\n</b>\tAm I tickled to find you, boy! Come\n\ton in and let's get a look at you.\n\tTurn around. Good strong back.\n\tYou'll need it. So you want help --\n\ttake a seat, relax, tell me about\n\tyourself. Cowboy, huh?\n\n<b>\t\t\tJOE \n</b>\tNo sir, I'm no cowboy really, but\n\tI'm a first class stud.\n\n<b>\t\t\tO'DANIEL \n</b>\tTake it,easy, boy... \n\t\t  (laughs)\n\tSeems to me you're different than a\n\tlotta boys that come to me. Most of\n\t'em seem troubled, confused, but\n\tI'd say you knew exactly what you\n\twant.\n\n<b>\t\t\tJOE\n</b>\tYou bet I do, sir.\n\n<b>\t\t\tO'DANIEL \n</b>\tBut I'll bet you got one thing in\n\tcommon with them other boys. I'll\n\tbet you're lonesome.\n\n<b>\t\t\tJOE \n</b>\tWell, not too, I mean, a little.\n\nO'Daniel rises suddenly in a fury of self-righteousness,\npacing, his voice simpering, whining sarcastically.\n\n<b>\t\t\tO'DANIEL \n</b>\tI'm lonesome. I'm lonesome so I'm a\n\tdrunk. I'm lonesome so I'm a dope\n\tfiend. I'm lonesome so I'm a thief,\n\ta fornicator, a whore-monger. Poop,\n\tI say, poop! I've heard it all and\n\tI'm sick of it, sick to death.\n\n<b>\t\t\tJOE \n</b>\tYessir, I can see that.\n\n<b>\t\t\tO'DANIEL \n</b>\tLonesomeness is something you take.\n\tYou bear? Dammit, you take it and\n\tgo about your business, that's all.\n\n<b>\t\t\tJOE \n</b>\tWell, uh, I'm raring to go.\n\n<b>\t\t\tO'DANIEL \n</b>\tYes, I believe you are. Cowboy,\n\thuh?\n\n<b>\t\t\tJOE \n</b>\tUh, yessir.\n\n<b>\t\t\tO'DANIEL \n</b>\tReady for hard work, son?\n\n<b>\t\t\tJOE\n</b>\tReady for anything.\n\n<b>\t\t\tO'DANIEL \n</b>\tI got a hunch, Joe Buck, it's gonna\n\tbe easier for you than most.\n\n<b>\t\t\tJOE \n</b>\tGonna be like money from home.\n\n<b>\t\t\tO'DANIEL \n</b>\tMoney from home, see, there's your\n\tstrength, you put things in earthy\n\tterms any man can understand, son.\n\tI warn you I'm gonna use you, I'm\n\tgonna run you ragged!\n\nJoe laughs, driving an obscene uppercut into the air.\nO'Daniel laughs with him.\n\n<b>\t\t\tO'DANIEL (CONT'D)\n</b>\tYou're a wonderful boy. You'n me\n\tgonna have fun, dammit, it don't\n\thave to be joyless. Say, why don't\n\twe get right down on our knees now?\n\n<b>\t\t\tJOE\n</b>\tGet down -- where?\n\n<b>\t\t\tO'DANIEL \n</b>\tRight here, why not? I prayed in\n\tsaloons, I prayed in the street, I\n\tprayed an the toilet. He don't care\n\twhere, what He wants is that\n\tprayer.\n\nO'Daniel drops on all fours, crawling to find the plug of an\nelectric cord. He shoves it into a wall socket, switches off\nthe overhead light and suddenly a hollow, tinted plastic\nJesus glows on the dresser. O.S. a revivalist congregation\nsings. And now we notice, with Joe, placards and flags, horns\nand tracts, all the paraphernalia of a street corner\nevangelist.\n\n<b>\t\t\tJOB \n</b>\tShee-it...\n\n<b>\t\t\tO'DANIEL \n</b>\tThat's the ticket, just open your\n\theart and let it flow. It ain't the\n\twords, it's the love beyond 'em!\n\n<b>EXT. REMEMBERED BAPTISM - ANOTHER TIME\n</b>\nSally Buck sings with the congregation while a rawboned\npreacher stands in the river, preparing to immerse little\nJoe.\n\n<b>\t\t\tO'DANIEL'S VOICE \n</b>\tDon't fight it, boy!\n\n<b>INT. WEST SIDE HOTEL ROOM - DUSK\n</b>\nO'Daniel tries to pull Joe down beside him.\n\n<b>\t\t\tO'DANIEL \n</b>\tPray and you shall be heard!\n\n<b>EXT. REMEMBERED BAPTISM - ANOTHER TIME\n</b>\nCamera becomes little Joe, glimpsing the fevered faces of\nSally Buck and the congregation singing on the riverbank,\njust before being plunged under the river. O'Daniel's voice\nreechoes, filtered through water.\n\n<b>\t\t\tO'DANIEL\n</b>\tDon't be frightened, son!\n\n<b>EXT. TIMES SQUARE - NIGHT\n</b>\nJoe runs in aimless panic, pushing through the crowd, pursued\nby O'Daniel's voice and the singing congregation.\n\n<b>\t\t\tO'DANIEL\n</b>\tDon't run from Jesus!\n\nJoe stops short as he sees the front page of a tabloid on a\nnewsstand. There is a picture of Joe being led away by two\ndeputies, under a headline ALABAMA MURDERER SHOTGUNS ELEVEN.\n\n<b>EXT. FORTY-SECOND STREET - NIGHT\n</b>\nJoe searches the faces of the crowd, running forward suddenly\nas he sees Jackie and the farmboy picked up by two men in a\nlarge convertible. Joe chases the car to Eighth Avenue but\nstops, frightened as he sees himself in multiple image on the\nfront of every newspaper displayed on a newsstand.\n\n<b>INT. EVERETT'S BAR - NIGHT\n</b>\nThe saloon is almost empty during the after dinner lull. The\nBARTENDER doesn't look up from his newspaper as Joe\napproaches.\n\n<b>\t\t\tJOE\n</b>\tSay, you know that runty little\n\tbastard I was with?\n\n<b>\t\t\tBARTENDER\n</b>\tI don't know nothing.\n\nJoe tenses as he sees the . tabloid picture of himself on the\nback of the bartender's paper. Joe's hand closes around an\nempty beer bottle, a terrible violence surging very near the\nsurface. O.S. women scream.\n\n<b>INT. REMEMBERED BEAUTY SALON - ANOTHER TIME\n</b>\nReflected in the mirror, we see little Joe wildly smashing\nbottles and glass display cabinets -- the voices of women\nscreaming O.S. -- little Joe hurling a perfume bottle which\nshatters the mirror and his own image.\n\n<b>INT. EVERETT'S BAR - NIGHT\n</b>\nThe empty beer bottle stands where it was. Joe has\ndisappeared. On the TV screen over the bar, sound drowned out\nby the jukebox, we see a blowup of the tabloid photograph,\nrevealing a young man very similar to, but clearly not Joe.\n\n<b>EXT. TIMES SQUARE - NIGHT\n</b>\nColorful lights still flash seductive promise. The vertical,\nlights on the MONY tower reach bottom and freeze momentarily.\n\n<b>STILL PHOTOGRAPH\n</b>\nJoe at his hotel window staring out blankly. Gun fire O.S....\n\n<b>INT. SHOOTING GALLERY - DAY\n</b>\nThe radio at Joe's ear is drowned out by a kid in cowboy hat,\nshooting alone in the gallery.\nTwo policemen idly slap their thighs with night sticks. Joe\nmoves on, unconsciously checking the coin return box of a pay\nphone.\n\n<b>STILL PHOTOGRAPH\n</b>\nJoe curled up on his bed like a baby, fully dressed, his\nradio on the night stand. O.S. his love theme, remote,\nhollow...\n\n<b>EXT. FORTY-SECOND STREET - NIGHT\n</b>\nJoe's radio is at his ear \"... never too late to look great,\nBen's Bargain Basement's open 'till five a.m., miles and\nmiles of Western styles, worth more at any store, money talks\nand nobody walks.\" For the first time, Joe is aware of the\nother midnight cowboys lurking in doorways, the cruising\nqueens, the middle-age men in sport shirts. Joe moves on self\nconsciously as he sees a scar-faced policeman, unconsciously\nmassaging his night stick. Camera holds on a window display\nof gag buttons, featuring NEW YORK WILL BREAK YOUR HEART,\n<b>BABY.\n</b>\n<b>STILL PHOTOGRAPH\n</b>\nJoe soaking in the tub, eyes closed.\n\n<b>EXT. TIMES SQUARE DANCE HALL - DAY\n</b>\nJoe's radio promises job opportunities for young men eighteen\nto twenty-five in the U.S. Air Force. He stands with a crowd\nstaring up at a girl go-go dancing in the window of SERGEANT\n<b>PEPPER'S LONELY HEART CLUB.\n</b>\n<b>STILL PHOTOGRAPH\n</b>\nJoe staring in the mirror. O.S. static over his love theme.\n\n<b>EXT. SIXTH AVENUE - NIGHT\n</b>\nBy work-light, the tarrier in metal helmet leans on a jack\nhammer, beyond the sign DIG WE MUST, drowning out Joe's\nradio.\n\n<b>STILL PHOTOGRAPH\n</b>\nJoe flexing his muscles in his jockey shorts while -- LIVE ON\nTV SCREEN -- a physical culture personality finishes push-ups\nand starts pitching his own extra protein bread.\n\n<b>EXT. TIMES SQUARE PANCAKE HOUSE - DAY\n</b>\nJoe's radio continues the super-break commercial while a fry\ncook flips flapjacks in the window.\nBut Joe's eyes are on a sign DISHWASHER WANTED. Joe looks up\nand his eyes meet those of the young man scraping garbage\nbehind the counter. It's Joe.\n\n<b>\t\t\tJOE \n</b>\tShee-it.\n\n<b>STILL PHOTOGRAPH\n</b>\nJoe sits in the hotel lobby, staring out at the street,\nunable to concentrate on his comic book. On two-way radio, a\nwoman's voice giggles as she speaks, \"When I can't sleep,\nwell, I just dial the time and listen to those old seconds\nclicking by like, you know, counting sheep?\"\n\n<b>EXT. SIDEWALK CAFE - COCKTAIL HOUR\n</b>\nJoe watches a young man hold a taxi door for an older lady,\nat the same corner where Ratso waved to another young man.\nThe woman's predatory eyes linger momentarily on Joe before\nshe leads the young man into the Cafe. The two-way radio\ncontinues over, \"... that's what I do about insomnia.\"\n\n<b>\t\t\tJOE \n</b>\tWell, now, ma'am, next time you got\n\tthat feeling coming on, you dial\n\tJoe Buck. I'll show you what to\n\tdo...\n\n<b>STILL PHOTOGRAPH\n</b>\nJoe straddles a chair, staring at a blank TV screen.\n\n<b>\t\t\tSINGING COMMERCIAL \n</b>\tNeed a little easy money? It's E-Z.\n\tWant a little easy cash? It's E-Z.\n\n<b>E-Z LOAN COMMERCIAL\n</b>\nAs the jingle continues, we follow Joe and his radio into the\nloan office, the depressing reality photographed and edited\nin the style of a TV commercial:\n\n<b>\t\t\tJINGLE \n</b>\tEasy locations to get to \n\tEasy ladies to greet you \n\tEasy chairs to seat you \n\tEasy payments to meet \n\tLet E-Z set you \n\tOn Easy Street \n\tJoe arrives confident      \n\tHarassed E-Z receptionist     \n\tLines of uneasy customers       \n\tDesperate, angry faces\t\n\tReams of E-Z forms to fill  \n\tClerk's sneer, says\t\t\n\tJoe has to be kidding\n\n<b>INT. TIMES SQUARE PALACE LOBBY - NIGHT\n</b>\nJoe's image frozen -- as if another still photograph -\nstanding at the desk, waiting for his key.\n\n<b>\t\t\tJOE'S VOICE \n</b>\tKey to 1014...\n\nAction continues as the DESK CLERK hands Joe a folded paper\ninstead of a key. Joe opens it, deeply perplexed.\n\n<b>\t\t\tDESK CLERK \n</b>\tLooks like you been locked out of\n\tyour room, buddy. Till you pick up\n\tyour tab.\n\n<b>\t\t\tJOE\n</b>\tUh, what about my things'n all?\n\n<b>\t\t\tDESK CLERK \n</b>\tWe keep them nice and safe till you\n\tget this straightened out.\n\n<b>INTERCUT\n</b>\nRoom 1014 warm and inviting, Joe's suitcase on the bed.\n\n<b>\t\t\tJOE \n</b>\tListen, tell you what, you can keep\n\tall the rest of the goddam junk if\n\tyou let me have just the suitcase.\n\tThat suitcase means a lot to me.\n\n<b>INTERCUT\n</b>\nThe postcard photograph marked X -- THIS IS ME.\n\n<b>\t\t\tDESK CLERK\n</b>\tWe keep everything. House rules.\n\n<b>EXT. TIMES SQUARE - NIGHT\n</b>\nJoe stands outside the hotel, stunned, seeing the bright\ncolored lights turn suddenly grey. The film continues in\nblack and white as Joe walks into the crowd.\n\n<b>EXT. SALLY BUCK'S BEAUTY SALON - DAY\n</b>\nThe FOR RENT sign flapping in the wind.\n\n<b>INT. BAR - DAY\n</b>\nJoe nurses a short beer, like the regulars. He looks up as a\ncrippled panhandler approaches, vaguely reminiscent of Ratso.\n\n<b>\t\t\tJOE \n</b>\tScrew off.\n\n<b>INT. ROOM 1014 - NIGHT\n</b>\nThe bed turned back, clean sheets, a soft night light.\n\n<b>INT. BUS DEPOT - NIGHT\n</b>\nJoe is stretched on a bench, his Stetson over his eyes. A\nloud speaker announces a bus \"departing for Texas\" but Joe\ndoes not move. A policeman taps Joe's boots with his night\nstick. Joe rises and starts away with mixed anger and\napprehension.\n\n<b>INT. PUBLIC MEN'S ROOM - DAY\n</b>\nTwo matching Ivy Leaguers exchange a glance as they see Joe\nwashing his feet in the basin. Joe stares back with a\nbelligerent grin.\n\n<b>\t\t\tJOE\n</b>\tAny objection, gentlemen?\n\n<b>INT. ALL NIGHT CAFETERIA - NIGHT\n</b>\nJoe balances a cup of coffee, walking past the other solitary\nnight people, avoiding each other's eyes. Joe spots what he's\nlooking for and seats himself next to a gaunt woman and her\nten year old son, both freaked out, erratically touching\nthings, themselves, each other in a futile effort to make\ncontact with reality. But Joe is only concerned with the\nplastic-wrapped crackers left by their empty soup bowls.\n\n<b>\t\t\tJOB\n</b>\tY'ain't gonna eat them?\n\nThe woman stares at Joe blankly. The boy runs a toy mouse\nacross the table, up his mother's arm and around her face.\nWith a polite nod, Joe opens the crackers and squirts one\nwith ketchup. Joe upsets his chair as a great gob of ketchup\nspills onto his pants...\n\n<b>\t\t\tJOE\n</b>\tShee-it.\n\n... glancing around with an embarrassed laugh, but the only\none looking is a cop, scratching his calf with a night stick.\nJoe keeps his back to the customers as he moves to the water\ndispenser, wets a paper napkin and tries to wipe away the\nstain. But the water has only spread the stain across his\npants and down his leg. He blushes as a blonde young\nstreetwalker giggles.\n\n<b>\t\t\tSALLY BUCK'S VOICE\n</b>\tWet your britches, lover boy?\n\n<b>INT. SUBWAY ARCADE - NIGHT\n</b>\nJoe tries to hide the stain with his jacket as he checks the\ncoin boxes of vending machines, wary as he passes a burly\npoliceman, abstractedly snapping his handcuffs in front of a\nbakery window display of bride-and-groom wedding cakes. Joe\nbarely glances at a confused MIDDLE-AGE LADY.\n\n<b>\t\t\tMIDDLE-AGE LADY\n</b>\tHow do I get to Grand Central?\n\n<b>\t\t\tJOE\n</b>\tShuttle. Follow the green light.\n\nAutomatically,checking the trough of a gum vending machine,\nJoe unexpectedly faces himself in the mirror, the eyes\nstaring at him tired and hopeless. His hand reaches\nunconsciously for a cigarette, The package is empty. He\ncrumples it in his fist but holds it.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tAlright, cowboy. Enough of this\n\tshee-it. You know what you got to\n\tdo? \n\t\t(nods)\n\tThen go do it.\n\n<b>EXT. FORTY-SECOND STREET - NIGHT\n</b>\nJoe hurls the crumpled package into a DON'T BE A LITTERBUG\nbasket as he emerges from the subway, his radio at his ear.\nThe torchy voice belts his love song, merging with street\nnoises crying danger -- an ambulance, a burglar alarm, a\npoliceman's whistle -- the lights flashing lurid color for\nthe first time since Joe was locked out, no longer promising\nbut threatening, clashing, warning as...\n\n... from a high angle, across the street, Joe joins the other\nmidnight cowboys, offering himself to all comers. His figure\nis momentarily obliterated by traffic then...\n\n... zooming in, we see Joe self-consciously trying to hide\nthe stain on his pants, embarrassed as a large sedan slows\nthen moves on to stop in front of a motorcycle freak. Joe is\nbriefly obliterated again by a passing police car...\n\n... the receding flash of its turret light revealing Joe in\nclose conversation with a frightened young FAT BOY, whose\neyes plead for reassurance as Joe scowls.\n\n<b>INT. ROOM 1014 - DAY\n</b>\nJoe's black and white suitcase gleams on the bed.\n\n<b>\t\t\tJOE'S VOICE\n</b>\tTwenty-three bucks, I got to have\n\ttwenty-three bucks...\n\n<b>INT. ALL NIGHT MOVIE - NIGHT\n</b>\nFrom an apparently empty balcony -- an old science fiction\nfilm grinds endlessly through the night -- a lost spaceman\ntrying to make contact with a tantalizing Martian maiden\nacross an invisible time barrier, theremin voices calling,\n\"Earthling, where are you?\"\n\n<b>\t\t\tFAT BOY'S VOICE \n</b>\tOkay. Sure. I got twenty-five...\n\nAt the top of the balcony, Joe leans back, turning his face\naway as the Fat Boy embraces him, kissing Joe's cheek and\nneck, his head moving down out of frame to show -- on the\nscreen -- the spaceman and Martian maiden meeting, arms\noutstretched. But the Martian maiden moves right on through\nthe spaceman, crying, \"Earthling come back, however many\ncenturies it is, I'll wait!\" Joe closes his eyes, forcing his\nmemory back...\n\n<b>INT. REMEMBERED MOVIE HOUSE - ANOTHER TIME\n</b>\n... repeating the remembered image of Anastasia and a younger\nJoe, behind the movie screen...\n\n<b>\t\t\tANASTASIA \n</b>\tYou're the only one, Joe, the only,\n\tonly one ever!\n\n... the remembered passion continuing, mounting -- intercut\nwith flash impressions, like flipping pages of a nudie\nmagazine -- naked, half-draped blondes gazing into camera\nwith sultry eyes, including one comic strip sexpot and the\ncalendar girl in Joe's Texas hotel room...\n\n<b>\t\t\tANASTASIA'S VOICE\n</b>\tYou're the best, the very best,\n\tyes, yes, kiss me, oh God please\n\tkiss me, Joe, now, now, now!\n\n... Joe's face in extreme close-up, sounds of both movie\nhouses merging, confused, dominated by the voices of\nadolescent boys...\n\n<b>\t\t\tBOYS' VOICES \n</b>\tHey, Joe, give someone else a\n\tchance! What's he doing for\n\tchrisake? He kissing Anastasia? You\n\tbetter swallow a whole goddam\n\tdrugstore, man!\n\n... an adolescent ratpack waiting in line behind the screen,\nlaughing in coarse whispers, watching Joe and Anastasia. O.S.\ntheremin voices call \"Earthling, where are you?\"\n\n<b>INT. ALL NIGHT MOVIE - NIGHT\n</b>\nOn screen, the Martian maiden moves through the spaceman,\ncrying, \"Earthling, come back, however many centuries it is,\nI'll wait!\"\n\n<b>INT. ALL NIGHT MOVIE RESTROOM - NIGHT\n</b>\nJoe watches the Fat Boy doubled over, retching.\n\n<b>\t\t\tJOE\n</b>\tI'm awful damn sorry you're sick,\n\tkid, but you gonna have to gimme\n\tthat money like you said.\n\n<b>\t\t\tFAT BOY \n</b>\tI was lying. I don't have it.\n\tWhat're you going to do to me?\n\n<b>\t\t\tJOE \n</b>\t\t(controls fury)\n\tWhat you got in your pockets?\n\nEagerly, the boy produces a family photograph, a subway\ntoken, a dirty handkerchief. Joe grabs his wrist, revealing a\nwatch.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tHow much's that worth?\n\n<b>\t\t\tFAT BOY \n</b>\tI can't go home without my watch!\n\tMy mother'd die! She'd die! Take my\n\tbooks! Not my watch! She'd die!\n\nBut Joe has already kicked open the door. Theremin voices\ndrown out the Fat Boy, calling \"Earthling, where are you?\"\n\n<b>INT. ALL NIGHT MOVIE - NIGHT\n</b>\nJoe sprawls, trying to sleep, his feet on the balcony rail,\nthe radio at his ear. On screen, once again, the Martian\nmaiden moves through the spaceman, crying, but we hear the\nvoice of a desperate woman on two-way radio. As she speaks, a\npoliceman moves along the aisle, slapping his palm with his\nnight stick.\n\n<b>\t\t\tDESPERATE VOICE \n</b>\tBill, can I call you Bill, Mister\n\tBonner? I feel like I know you from\n\tlistening. What I called about,\n\tBill, I'm gonna kill myself...\n\n<b>EXT. SIXTH AVENUE - DAY\n</b>\nFrom a high angle, only Joe's Stetson and radio can be seen\nabove a passing bus, its side panel advertising BILL BONNER'S\n<b>STRAIGHT LINE, A STRAIGHT TALK SHOW.\n</b>\n<b>\t\t\tBONNER'S VOICE \n</b>\tWhy call me, baby? If you want to\n\tdo it; just do it, don't talk about\n\tit. Are we drunky? Feeling a little\n\tsorry for ourselves maybe?\n\nJoe appears in full figure as the bus passes. He stands\nlooking at the suitcases in a luggage shop window.\n\n<b>\t\t\tDESPERATE VOICE \n</b>\tWell, Bill, what I got thinking, I\n\tdidn't want the neighbors to have\n\tto find me, this young couple with\n\tthe boy I want to have my cat, see,\n\tBill?\n\n<b>INT. RADIO STATION - DAY\n</b>\nBONNER, tough in a grey crew-cut, talks on the phone.\n\n<b>\t\t\tBONNER \n</b>\tOkay, baby, now listen, just hold\n\ton while I leave the line for a\n\tminute. And think about all the\n\tkids that are dying overseas for\n\tyou, okay, baby? Got that? I'll be\n\tback in exactly sixty seconds.\n\tAfter this message from...\n\nA taxi born blasts, interrupting the sponsor's message.\n\n<b>EXT. SIXTH AVENUE - DAY\n</b>\nJoe's fist slams a fender violently, using Ratso's fake\ninjury trick to stop traffic, running across the street\ntoward...\n\n<b>EXT. NEDICK'S - DAY\n</b>\n... Ratso staring out at Joe, paralyzed in the act of\nlighting a cigarette -- intercut in flashing close-ups -- Joe\noutside the window, Ratso inside -- reflecting their\nconflicting emotions -- Joe's murderous rage -- Ratso's panic\n-- one almost subliminal flash of each revealing something\nlike pleasure at finding a long-lost friend...\n\n<b>INT. NEDICK'S - DAY\n</b>\n... Ratso staring up into camera, holding his breath.\n\n<b>\t\t\tRATSO \n</b>\tDon't hit me, I'm a cripple.\n\nJoe's hand falls on Ratso's shoulder.\n\n<b>\t\t\tJOE \n</b>\tOh, I ain't gonna hit you, I'm\n\tgonna strangle you to death...\n\nThe cigarette in Ratso's mouth burns into his lip. He jerks\nspasmodically, choking on smoke as he rips skin away with the\nbutt and drops it in his coffee cup.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\t... only first I'm gonna turn you\n\tupside down and shake you out right\n\there and now.\n\nCoughing, eyes tearing, Ratso empties his pockets on the\ncounter, finally producing: sixty-four cents, a few sticks of\ngum, an almost empty cigarette package, a book of matches and\ntwo pawn tickets. He raises his eyes, somehow ashamed. Joe\nkicks the toe of Ratso's loafer.\n\n<b>\t\t\tJOE \n</b>\tWhat's in your socks?\n\n<b>\t\t\tRATSO \n</b>\tNot a cent, I swear to God, I swear\n\ton my mother's eyes.\n\nRatso removes his loafers and shakes them, glancing at the\ncounter man. His socks don't even conceal his toes.\nDisgusted, Joe shoves Ratso's small pile back at him.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tYou keep the sixty-four cents. I\n\twant you to have it.\n\n<b>\t\t\tJOE \n</b>\tIt's sticky. What you do, slobber\n\ton 'em? I wouldn't touch 'em.\n\nJoe should leave -- Ratso obviously has nothing tangible to\noffer -- but Joe hesitates, lighting a cigarette as Ratso\npulls on his loafers.\n\n<b>\t\t\tRATSO \n</b>\tHow do you like that O'Daniel,\n\tflipping out like that? I wanted to\n\tget in touch with you when I heard,\n\tbut I been laid up with this\n\tcold...\n\nRatso touches his chest, forcing a cough which continues\nitself beyond his intention.\n\n<b>\t\t\tJOE \n</b>\tYou want some free medical advice,\n\tshut your goddam mouth about that\n\tnight.\n\n<b>\t\t\tRATSO \n</b>\tOkay, right, right, okay. Another\n\tsubject. Where you living? Still at\n\tthe hotel?\n\n<b>INT. ROOM 1014 - DAY\n</b>\nThe black and white suitcase lies open on the bed.\n\n<b>INT. NEDICK'S - DAY\n</b>\nJoe turns abruptly and walks away.\n\n<b>\t\t\tJOE \n</b>\tShee-it. I got better things to do\n\tthan talk to you.\n\n<b>EXT. SIXTH AVENUE - DAY\n</b>\nJoe strides north, pretending he doesn't hear...\n\n<b>\t\t\tRATSO'S VOICE \n</b>\tHey, wait up, for crissake!\n\n... Ratso hop-skipping to overtake Joe at the traffic light.\n\n<b>\t\t\tJOE \n</b>\tListen, keep away from me, hear?\n\tYou come near me again, I snatch\n\tyou bald-headed!\n\n<b>\t\t\tRATSO \n</b>\tI'm inviting you. I mean if you're\n\tnot located, I got a place. I'm\n\tinviting you, goddamit.\n\n<b>\t\t\tJOE \n</b>\tYou inviting shee-it.\n\n<b>EXT. TENEMENT STREET - DAY\n</b>\nA contractor's sign announces LUXURY APARTMENTS AVAILABLE in\nhigh-rise co-op, under construction beyond a raw of tenements\nwith X's taped on the windows. Ratso's voice continues over\nthe click-clack-click of Joe's boots and the flip-flap-squeak\nof Ratso's loafers as camera moves toward a condemned\nbuilding.\n\n<b>\t\t\tRATSO'S VOICE \n</b>\tThe X on the window means the\n\tlandlord can't collect rent --\n\twhich is a convenience, hey? -- on\n\taccount of it's condemned.\n\n<b>INT. TENEMENT STAIRS - DAY\n</b>\nFootsteps climb past rubbish piled outside empty flats.\n\n<b>\t\t\tRATSO'S VOICE \n</b>\tThe electric's off. Another\n\tconvenience.\n\tI don't mess with Con Edison, hey?\n\tWhat the hell, I got candles,\n\tright?\n\n<b>INT. X FLAT - DAY\n</b>\nLight from the X window shines on a Florida tourist poster as\nRatso leads Joe into an abandoned tub-in-kitchen flat, barely\nfurnished with a table and chair, a rumple of blankets on a\nburnt-out mattress.\n\n<b>\t\t\tRATSO \n</b>\tI got no heat, but by that time,\n\tyou know, cold weather, hey, I'll\n\tbe in Florida. Stretch out. Make\n\tyourself comfortable. You hungry?\n\tI'll put up some water for coffee.\n\nRatso fills a saucepan from the tub-sink, sets it on a Sterno\nstove. Joe sits himself on the mattress-bed, pretending to\ntest it, weeks of exhaustion and tension overwhelming him\nsuddenly, his only immediate problem being the effort to\nrestrain a large, comfortable yawn.\n\n<b>\t\t\tJOE\n</b>\tComfortable, kee-rist, I slept on\n\tsubways softer than this.\n\nJoe stretches himself, yawning, his eyelids drooping heavily.\nThe sounds of the city recede. Joe's love theme plays softly\non a distant radio. Joe's eyes close momentarily in spite of\nhim elf.\n\n<b>INT. REMEMBERED CAR - ANOTHER TIME\n</b>\nA vintage dashboard, radio dial glowing, Anastasia's face.\n\n<b>\t\t\tANASTASIA\n</b>\tLove me, Joe?\n\n<b>EXT. DEMOLITION SITE - DAY\n</b>\nA huge metal ball arcs on chain, demolishing a brick facade.\n\n<b>INT. X FLAT - DAY\n</b>\nRatso's face seems to radiate evil as he lights a Sterno can.\nJoe forces his eyes half-open.\n\n<b>\t\t\tJOE\n</b>\tSmart thing for me to do is haul\n\tass outta here.\n\n<b>\t\t\tRATSO\n</b>\tWhatsa matter now?\n\nJoe shivers, pulls a blanket around him, resisting sleep, but\nthe noises of demolition fade, the love theme lures Joe back.\n\n<b>\t\t\tJOE \n</b>\tYou don't seem like no fag...\n\n<b>\t\t\tRATSO \n</b>\tWhat's that supposed to mean?\n\nJoe's eyes close, his voice continuing out of half-sleep.\n\n<b>JOE \n</b>\nWant me to stay here, y'after something. What y'after?\n\n<b>INT. REMEMBERED CAR - NIGHT\n</b>\nJoe's thumbnail flares a match, exposing Anastasia on the car\nseat with Joe, both nearly naked. Anastasia butterfly-kisses\nJoe's chest as he lights a cigarette.\n\n<b>ANASTASIA\n</b>\nSay you love me. Just say it.\n\n<b>JOE\n</b>\nOkay. I love you.\n\nAnastasia purrs as her lips find Joe's breast, trying to\nnurse. A flashlight flares suddenly through the car window.\n\n<b>NIGHTMARE - MULTIPLE SPLIT SCREEN\n</b>\nLow angle Ratso bending over Joe, into camera...\n... Sally Buck shocked, hand still on switch... \n... Joe blinded by halation... \n... Anastasia's mouth screaming soundlessly... \n... flashlights multiplying on car window...\n\nFull frame -- Anastasia catatonic in hospital gown -- a\nwoman's voice \"What'd he do to you, Annie?\"...\n... gang-bang ratpack surrounding car with flashlights... \n... Jackie shrieking \"He loves her he loves her\"... \n... hands closing on Joe's buttocks... \n... hand closing on Joe's naked left foot... \n... hand on naked right foot... \n... dentist leaning over Joe's mouth... \n... hands pulling Joe's legs apart...\n\nZoom close-up -- Anastasia screaming soundlessly...\n... thermometer under Little Joe's tongue... \n... Sally Buck shoves chocolate in her mouth... \n... bewigged poodle licks her fingers... \n... Sally Buck hangs enema can on bedpost... \n... Ratso leads ratpack chasing naked Anastasia... \n... corona of flashlights...\n\nAnastasia screaming soundlessly -- flashlight shoved into her\nmouth -- electronic rock blasting...\n... blank-eyed go-go girl in dance hall window... \n... Joe held naked by ratpack... \n... Ratso breaking beer bottle on Everett's bar... \n... dwarf laughing on television... \n... Ratso aims broken bottle at Joe's crotch... \n... shooting gallery cowboys riddle Joe's pelvis...\n\nAnastasia catatonic in courtroom -- between gaunt parents -\nwhining singsong \"Raped her raped her Joe Buck raped her\"...\n... Fat Boy's mouth finds Joe's breast, tries to nurse... \n... Sally Buck kisses him open-mouthed... \n... slug crawls up Joe's stomach, trailing mucus... \n... Cass's poodle laps at his toes... \n... butterflies settle on his eyes...\n\nAnastasia catatonic in courtroom between parents -- who are\nnow O'Daniel and Sally Buck...\n... drawling voice \"evidence of repeated violations\"... \n... Bill Bonner in flag-cloth judge's robe... \n... police advancing, swinging night sticks... \n... Joe running into Times Square, suddenly naked... \n... Anastasia sitting in all-night cafeteria... \n... freaky child running toy mouse over her naked body...\n\nSiren screaming -- Anastasia staring catatonic from rear\nwindow of ambulance...\n... ambulance racing away... \n... Joe chasing naked after ambulance... \n... running into the arms of the police... \n... Ratso laughing as police beat Joe...\n\n<b>INT. X FLAT - NIGHT\n</b>\nJoe awakens in a cold sweat, fighting the blankets, wild-eyed\nas he sees Ratso at the table, examining Joe's radio by\ncandle-light. Joe lunges across the room to snatch the radio\nfrom Ratso's hands.\n\n<b>\t\t\tRATSO\n</b>\tFor crissake!\n\nStill wild-eyed, Joe suddenly points at his stocking feet.\n\n<b>\t\t\tJOE\n</b>\tWhere's my boots -- ?\n\n<b>EXT. TIMES SQUARE - DAY\n</b>\nJoe facing the crowd, naked except for his boots.\n\n<b>INT. X FLAT - NIGHT\n</b>\nRatso points to the boots on the floor by the mattress.\n\n<b>\t\t\tJOB\n</b>\tHow'd they get off me?\n\n<b>\t\t\tRATSO\n</b>\tI took 'em off.\n\n<b>\t\t\tJOE\n</b>\tWhat for?\n\n<b>\t\t\tRATSO\n</b>\tSo you could sleep! I mean Christ!\n\nJoe inspects the boots, seats himself on a battered Army cot \n- which has been added while he slept -- swinging a boot by\nits strap, considering whether to stay or go.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tI drug in a cot, if you want to\n\tstay.\n\n<b>\t\t\tJOE \n</b>\tWell now, Ratso, I'm gonna tell you\n\tsomething for your own good, only\n\tfirst gimme a cigarette.\n\nRatso offers a cigarette from his crushed package, Joe\nstrikes a match on his thumbnail and lights up, staring at\nRatso.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tYou want me to stay here tonight,\n\tis that the idea?\n\n<b>\t\t\tRATSO \n</b>\tI ain't forcing you, like, I mean,\n\twho's forcing you?\n\n<b>\t\t\tJOE \n</b>\tOh. Guess I got the wrong\n\timpression.\n\nJoe makes a slow move to pull on one boot.\n\n<b>\t\t\tRATSO \n</b>\tI want you to stay, okay? I goddam\n\tinvited you, didn't I?\n\n<b>\t\t\tJOE \n</b>\tWell, I hope you know what you're\n\tin for. I'm a very dangerous\n\tperson. Someone does me bad like\n\tyou. If I caught up with you that\n\tnight, there'd be one dead Ratso\n\tlong about now. Hear?\n\n<b>\t\t\tRATSO \n</b>\tI'm impressed. You're a killer.\n\n<b>\t\t\tJOE \n</b>\tSo if you want me to hang around\n\tfor a few days, I thought you\n\tshould know.\n\nJoe yawns, picks up a few blankets and spreads them on the\ncot. He puzzles out the faded printing on one blanket.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tProperty of the YMCA. You make me\n\twanna puke sometimes, Ratso.\n\nRatso blows out the candle and wraps himself in blankets.\n\n<b>\t\t\tRATSO \n</b>\tJoe -- do me one favor -- this is\n\tmy place, am I wrong? You know, in\n\tmy own place my name ain't Ratso. I\n\tmean it so happens my name is\n\tEnrico Salvatore Rizzo.\n\n<b>\t\t\tJOE \n</b>\tShee-it, man, I can't say all that.\n\n<b>\t\t\tRATSO \n</b>\tRico then, at least call me Rico in\n\tmy own goddam place.\n\n<b>\t\t\tJOE \n</b>\tRico! Rico! Rico! Is that enough?\n\t\t(then)\n\tAnd keep your meat hooks off my\n\tradio.\n\n<b>EXT. VEGETABLE MARKET - DAY\n</b>\nRatso wears a threadbare raincoat of faded black, several\nsizes too large, as he shops with housewives at a sidewalk\nvegetable stand -- elbowing his way through the ladies,\ntesting fruit, picking up vegetables and putting them back --\ntill the GREENGROCER spots him.\n\n<b>\t\t\tGREENGROCER \n</b>\tYou! Out! Out! I told you, I calla\n\tcops!\n\nThe other shoppers deliberately turn their backs, avoiding\ninvolvement. As the Greengrocer grabs Ratso, Joe ambles into\nthe scene, wearing his dangerous little smile.\n\n<b>\t\t\tJOE \n</b>\tHey, looka here, that ain't nice,\n\tpicking on a cripple...\n\nJoe intervenes just long enough for Ratso to escape, then\nambles on, leaving the Greengrocer in frustrated fury. Camera\nholds on a tray of coconuts.\n\n<b>INT. X FLAT - DAY\n</b>\nJoe lies on his cot, watching Ratso struggle to penetrate the\nfibrous husk of a coconut, experimenting with a variety of\nrusty tools in an old cigar box.\n\n<b>\t\t\tRATSO \n</b>\tThe two basic items necessary to\n\tsustain life are sunshine and\n\tcoconut milk. That's a known fact.\n\tIf I can find the goddam hole the\n\tmilk squirts out.\n\n<b>\t\t\tJOE \n</b>\tThis is an okay setup you got here,\n\tbut I'd say you ain't just exactly,\n\tuh, flush, is that right or not?\n\n<b>\t\t\tRATSO\n</b>\tI been sick. Hold this, will ya?\n\nJoe takes his time rising to hold the coconut while Ratso\ntries to poke a hole with a bent ice-pick.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tIn Florida, they come smooth, ready\n\tto eat.\n\tDown there, your only problem is,\n\tdiet-wise, you gotta lift an arm to\n\twipe warm milk off your chin.\n\tTough, hey?\n\n<b>\t\t\tJOE \n</b>\tI think finding you's the smartest\n\tthing I ever did, for both of us.\n\tYou just the crooked kinda sneaky\n\tlittle sidewinder I need to get me\n\thustling in this town. Hey!\n\nJoe jerks his hand away just in time to avoid the ice-pick.\nThe coconut bounces on the floor. Ratso picks it up, holds\nit, while Joe tries to crack it, swinging his boot like a\nhammer.\n\n<b>\t\t\tRATSO \n</b>\tMiami Beach is the only place for a\n\treal hustler. Florida has more rich\n\tchicks per square yard than any\n\tresort spot in the world. They lie\n\tout in their pagodas and pergolas\n\twaiting to grab the first jockstrap\n\tthat passes.\n\n<b>\t\t\tJOE \n</b>\tWhat's all this sweet talk about\n\tFlorida? Your friend O'Daniel got a\n\tstable down there now?\n\nJoe swings violently. Ratso yelps, hopping on his one good\nleg, sucking his thumb.\n\n<b>\t\t\tRATSO \n</b>\tCowboy killers! Break my finger,\n\tChrist! I got news for you, baby,\n\tno chick with any class buys that\n\tbig dumb cowboy crap...\n\nRatso holds his thumb under the tub-sink faucet.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\t... the cowboy bit's out, except\n\tamong fags of a certain type, which\n\ttake a certain, type hustler to\n\texploit. Like I could handle it --\n\tbeing a stealing operation\n\tbasically -- but take your average\n\tfag, very few of them want a\n\tcripple.\n\nJoe holds the coconut like Yorick's skull, thinking hard.*\n\n<b>\t\t\tJOE \n</b>\tWell, I am dumb, that's for sure. I\n\tdon't talk right. I can't think too\n\tgood. Just only one thing I ever\n\tbeen good for's loving. Women go\n\tcrazy for me. Fact. Crazy Annie.\n\tHad to send her away. So I don't\n\tcash in on that, what am I? I'm\n\tshee-it. May's well flush me down\n\tthat hole with the dishwater.\n\nJoe sets the coconut on the floor, holding it with both hands\nwhile he tries to smash it with the heel of his boot.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tThat's why you gonna stop crapping\n\tabout Florida and get your skinny\n\tbutt moving to earn twenty bucks\n\tworth of management you owe me...\n\n<b>INT. ROOM 1014 - DAY\n</b>\nThe suitcase lies open, displaying Joe's wardrobe.\n\n<b>\t\t\tJOE'S VOICE \n</b>\tMake that twenty-three bucks.\n\n<b>INT. X FLAT - DAY\n</b>\nJoe slams his heel down. The coconut shoots out from under\nhim and he lands on his ass.\n\n<b>\t\t\tRATSO \n</b>\tLook at yourself, Joe, no offense,\n\tbut frankly, you're beginning to\n\tsmell. For a stud in this town\n\tthat's a handicap.\n\n<b>\t\t\tJOE \n</b>\tYou talk like a man with a tin\n\ttwat.\n\nRatso sets the coconut on the window sill, balancing it as he\nraises the X window.\n\n<b>\t\t\tRATSO \n</b>\tYou ain't got a chance in hell. You\n\tneed threads and glitter, baby. A\n\tfront, hey?\n\n<b>\t\t\tJOE \n</b>\tWell, uh, my manager's gonna manage\n\tall that crap, or else he gonna get\n\ta coconut up his flue.\n\nJoe slams, the window down. The coconut flies down to crash\nO.S. on the sidewalk below.\n\n<b>EXT. SIDEWALK - DAY\n</b>\nAn alley cat laps up the milk of the broken coconut.\n\n<b>EXT. TIMES SQUARE - FANTASY\n</b>\nJoe stands naked in the middle of traffic. A siren shrills.\nAnastasia, catatonic in a hospital smock, moves toward Joe\nlike a sleepwalker, passing through him.\n\n<b>INT. LAUNDROMAT - DAY\n</b>\nWearing only his boots, Joe sits like an Indian chief,\nwrapped in a blanket -- angle widening to show Ratso,\nspotting Joe's jacket, slacks and shirt with cleaning fluid --\nhis eyes on a very pregnant Italian lady. As she starts to\nload a coin cleaning machine, Ratso intervenes solicitously,\nspeaking in Italian...\n\n<b>\t\t\tRATSO \n</b>\tA woman in your condition shouldn't\n\tdo that. Let me help...\n\n... adroitly slipping Joe's cleaning in with her load as she\nturns to seat herself beside Joe.\n\n<b>\t\t\tJOE'S VOICE \n</b>\tIt ain't right, stealing from a\n\tpregnant lady.\n\n<b>INT. HAT CLEANERS - DAY\n</b>\nJoe and Ratso stand waiting at the counter.\n\n<b>\t\t\tRATSO \n</b>\tWhat did it cost her? The\n\tlaundromat syndicate lost a couple\n\tcoins. I'm crying.\n\nThe owner brings Joe's clean and blocked Stetson from the\nrear of the shop. Joe sets it on his head and examines\nhimself in a mirror as the owner hands Ratso, the bill.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tWhere's mine? The black homburg? I\n\tbrought it in the same time.\n\nThe owner glances at the slip, puzzled, returns to the rear\nof the shop to search for the nonexistent homburg. Ratso\nquickly drags Joe away from the mirror and out of the shop.\n\n<b>INT. SUBWAY ARCADE - NIGHT\n</b>\nThe rhythmic duet of boots and loafers follows Joe and Ratso \n- checking coin boxes and telephone booths -- till they reach\na shoeshine stand, locked for the night. They loiter till a\nyoung couple has disappeared, then Joe kicks loose 'the\npadlock on the equipment drawer, mounts one of the chairs and\nRatso goes to work on his boots with furious expertise,\nflourishing double brushes, snapping the rag like a jazz\ndrummer.\n\n<b>\t\t\tJOE \n</b>\tHey, you're good! I bet you could\n\tpick up a living at this if you\n\ttried.\n\n<b>\t\t\tRATSO \n</b>\tAnd end up a hunchback like my old\n\tman? You think I'm crippled? You\n\tshoulda caught him the end of a\n\tday.\n\nRatso demonstrates a chimpanzee walk. Joe laughs. Ratso turns\nback in panic as another man takes a chair next to Joe. Ratso\nis about to retuse when a cop takes the third chair, swinging\nhis handcuffs around to the front, tapping his shoe with his\nnight stick. Ratso quickly drops a rag over the broken\npadlock, cursing under his breath as he starts working on all\nthree customers at the same time.\n\n<b>\t\t\tRATSO'S VOICE \n</b>\tYou think it's funny?\n\n<b>INT. X FLAT - DAY\n</b>\nJoe is seated in a straight-back chair near the X window, a\ntowel tucked around his neck as Ratso trims his hair, almost\nas expert a barber as shoeshine boy.\n\n<b>\t\t\tRATSO \n</b>\tStupid bastard coughed his lungs\n\tout breathing that resin all day.\n\tThey buried him with gloves on.\n\tEven the fag undertaker couldn't\n\tget his nails clean.\n\nAs if by conditioned reflex, Ratso chokes on the cigarette in\nhis mouth, coughing painfully. He crushes it out, opens the\nwindow to spit, shivering, then slam it and turns back to\nremove the towel from Joe's neck.\n\n<b>\t\t\tJOE \n</b>\tKee-rist, you pretty damn clever\n\tfor a skimpy little gimp.\n\n<b>\t\t\tRATSO \n</b>\tYou like it? Take a look.\n\n<b>\t\t\tJOE \n</b>\tDon't rush me. How I do it, see, I\n\tget myself primed, like I was\n\tturning on the charm for some\n\tpretty little blonde lady, then\n\tkinda mosey away slow and easy and \n\t- swing around! -- and there you\n\tare, you handsome devil.\n\nJoe performs his ritual as he speaks, but more relaxed,\nfaintly laughing at himself with Ratso. The wall mirror has\nbeen added since we last saw the flat, along with a legless\noverstuffed chair with burnt-out cushions, a tasselled table\ncover, pinups, calendar girls and several new Florida tourist\nposters, Ratso moves to Joe's side, arranging the\nneckerchief, nodding.\n\n<b>\t\t\tRATSO \n</b>\tNot bad -- for a cowboy -- you're\n\tokay, you're okay.\n\n<b>\t\t\tJOE \n</b>\tWhat I'm gonna do, I'm gonna make a\n\tcowboy outta you, kid. How about\n\tthat? Build you up a little, teach\n\tyou couple little tricks'n turn\n\ty'out to stud, Rat-stuff.\n\nJoe slaps his hat on Ratso's head, tilts it, hooks Ratso's\nthumbs in his jeans and shoves a cigarette into the corner of\nRatso's mouth. Ratso laughs till he chokes -- for one\ninstant, self-consciously, mimicking Joe -- then removes the\nhat and reaches for his threadbare black raincoat.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tOkay, you got yourself one\n\thandsome, sweet-smelling cowboy,\n\tstrut your stuff...\n\n<b>EXT. CONVERTED TOWN HOUSE - DAY\n</b>\nJoe and Ratso peer down through a basement bay window, into\nthe office of THE PERFECT GENTLEMAN ESCORT SERVICE --\nendorsed by leading travel agencies and credit clubs offering\ndiscreet companionship and personal guided tours in any\nlanguage. A large-busted matron, on a French phone, fills out\na memo and hands it to an immaculate young ESCORT, who slips\nthe memo into his topcoat pocket as he comes from the office\nand hails a cab. Ratso darts forward, limping exaggeratedly,\nholding the door, lifting the memo as he brushes off the\nEscort's topcoat. The young man waves him away with out a\ntip. Ratso slams the door and bites his thumb after the cab,\nunfolding the memo as he joins Joe on the sidewalk.\n\n<b>\t\t\tRATSO \n</b>\tHow do you like that? Cheap\n\tbastard...\n\t\t(reads, then)\n\tI think we struck gold. This is one\n\thigh-class chick. The Barbizon for\n\tWomen!\n\n<b>EXT. MANHATTAN SKYLINE - DUSK\n</b>\nThe Mutual of New York tower flashes MONY.\n\n<b>INT. CORNER PHONE BOOTH - DUSK\n</b>\nRatso consults the memo as he speaks into the phone.\n\n<b>\t\t\tRATSO \n</b>\tMr. McNeill, I'm calling for Miss\n\tBeecham at the Barbizon Hotel for\n\tWomen. She won't need you\n\ttonight...\n\n<b>EXT. BARBIZON FOR WOMEN - NIGHT\n</b>\nA doorman helps a young lady into a limousine.\n\n<b>\t\t\tRATSO'S VOICE \n</b>\tWould you believe a whole goddam\n\thotel with nothing but lonely\n\tchicks?\n\nJoe and Ratso watch from across the street.\n\n<b>\t\t\tRATSO \n</b>\tScore once in that setup, the way\n\tchicks talk, Christ...\n\nJoe cracks his gum, tilts his hat, starts across the street.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tGet the money! Remember Cass\n\tTrehune? Cash! These rich bitches\n\twrite a check at night, call the\n\tbank and stop payment in the\n\tmorning. Get the cash!\n\nIn Ratso's eyes -- as Joe enters the hotel -- its facade\nsuddenly wipes away to reveal rich ladies in negligee waiting\nin every room.\n\n<b>INT. BARBIZON FOR WOMEN - NIGHT\n</b>\nJoe starts up the stairs, two at a time. A BELLHOP grabs him.\n\n<b>\t\t\tBELLHOP \n</b>\tHey! No men upstairs!\n\n<b>EXT. BARBIZON FOR WOMEN - NIGHT\n</b>\nRatso warms his hands at a chestnut vendor's cart, seeing...\n\n... zoom close-up, a lady in a window grabbing Joe.\n\n<b>INT. BARBIZON FOR WOMEN - NIGHT\n</b>\nJoe picks up a house phone, watched by the Bellhop.\n\n<b>EXT. BARBIZON FOR WOMEN - NIGHT\n</b>\nRatso sees Joe zip from room to room in wild animation.\n\n<b>INT. BARBIZON FOR WOMEN - NIGHT\n</b>\nThe lobby watches Joe blow a gum bubble at the elevator.\n\n<b>EXT. EXCLUSIVE DRESS SHOP - NIGHT\n</b>\nStaring at a window display of Florida sportswear, Ratso's\nimagination soars, seeing...\n\n<b>EXT. FLORIDA BEACH FRONT - FANTASY\n</b>\n... Ratso, like a model in a travel poster, in gaudy sport\nshirt, talking on the phone against a background of hotels...\n\n... Ratso like James Bond, surrounded by bikinis, dictating\nwhile girls serve coconut milk and massage his game leg...\n\n... Ratso like George Raft, in evening clothes, running a\nposh casino, flicking a coin...\n\n... Ratso simply himself, dressed as he is, sitting on the\nbeach, at peace in the sun...\n\n... the same identical picture with Joe sitting beside Ratso.\n\n<b>INT. BARBIZON FOR WOMEN - NIGHT\n</b>\nJoe faces MISS BEECHAM, a reserved and rather plain young\nlady in evening dress, She tries to speak softly.\n\n<b>\t\t\tMISS BEECHAM \n</b>\tI'm afraid there's been a terrible\n\tmistake...\n\n<b>EXT. EXCLUSIVE DRESS SHOP - NIGHT\n</b>\nRatso leans against the window, flipping a coin.\n\n<b>EXT. BARBIZON FOR WOMEN - NIGHT\n</b>\nMiss Beecham is flushed with humiliation, the entire lobby\nwatching Joe in the hands of two bellboys.\n\n<b>\t\t\tJOE \n</b>\tI want my money, goddamit, you owe\n\tme my money whether you get laid or\n\tnot, lady, shee-it!\n\n<b>EXT. EXCLUSIVE DRESS SHOP - NIGHT\n</b>\nThe lights in the window suddenly switch off, blacking out\nFlorida. Ratso glances toward the growl of a siren O.S.\n\n<b>EXT. BARBIZON FOR WOMEN - NIGHT\n</b>\nA police prowl car slows in front of the hotel. Ratso swings\nacross the street with incredible speed to meet Joe as he's\ntossed onto the sidewalk. Ratso picks up the Stetson and\nbrushes it off, then helps Joe to his feet.\n\n<b>EXT. SIXTH AVENUE - NIGHT\n</b>\nFrom a high angle -- the two figures move slowly along the\ndeserted avenue, their rhythmic musical duet growing more and\nmore faint in the distance, a broken grasshopper and a six\nfoot tarnished cowboy -- passing a tuxedo rental store, next\nto a lighted sign -- TEMPERATURE IN MIAMI BEACH, FLORIDA 89\nDEGREES -- their pace slowing to a dead stop...\n\n<b>INT. X FLAT - NIGHT\n</b>\n... Joe and Ratso frozen -- rain on the X windowpane freezing\ninto sheet ice. O.S.\na radio commercial plays warm, sentimental music while a cozy\nvoice explains how easy it is to heat with Humble oil.\n\n<b>EXT. CONDEMNED TENEMENTS - DAY\n</b>\nJoe and Ratso frozen in a narrow shaft of sunlight, watching\nthe huge metal ball demolish the building next door. O.S. a\nradio announcer sells FROZEN SUNSHINE ORANGE JUICE.\n\n<b>INT. X FLAT - NIGHT\n</b>\nJoe and Ratso frozen, staring significantly at Joe's radio.\nO.S. a singing commercial, \"Don't wheeze and sneeze the\nwinter away! Drink Frozen sunshine every day!\" \n\n<b>EXT. PAWN SHOP - DAY\n</b>\nThrough the window -- Joe and Ratso watch the pawnbroker\nexamine Joe's radio, \"Be healthier, wealthier, life can be\nfine, when you drink Frozen\" -- Sunshine is clicked off by\nthe pawnbroker.\n\n<b>INT. X FLAT - NIGHT\n</b>\nJoe and Ratso frozen, wrapped in blankets as...\n\n... the canned heat dies with a faint puff...\n\n... water dripping in the tub-sink freezes into an icicle...\n\n... the candle burns down and out, leaving the screen dark.\n\n<b>EXT. CONDEMNED TENEMENTS - DAY\n</b>\nJoe and Ratso warm themselves on the smoke and steam rising\nfrom a subway grating -- watching two officials in fur\ncollared coats inspect the front of their X flat building.\nReading their doom, Joe and Ratso, continue on, disappearing\ninto the subway.\n\n<b>EXT. FORTY-SECOND STREET - NIGHT\n</b>\nJoe stands alone, watching the midnight cowboys ply their\ntrade. Camera pulls back as Joe turns away and enters a store\nfront blood bank, offering ten dollars to blood donors.\n\n<b>INSERT\n</b>\nA huge hypodermic fills the frame, sucking Joe's blood. O.S.\nRatso coughs uncontrollably.\n\n<b>INT. X FLAT - NIGHT\n</b>\nRatso leans over the tub-sink, dry-heaving while he coughs,\nwearing a sheepskin coat much too large for him. He controls\nthe cough with effort -- hearing the door open and close O.S.\n-- wipes his mouth and turns to grin at...\n\n... Joe, trying to light the empty Sterno can, deliberately\nignoring Ratso. Ratso shrugs, washes his mouth at the faucet,\nfinds a cigarette butt and lights it, careful to avoid\ninhaling the first puff.\n\n<b>\t\t\tJOE \n</b>\tShee-it. Cough yourself inside out,\n\tthen light a fag, a goddam fag. You\n\tmake me puke. Where'd you steal it?\n\tIn the movies?\n\n<b>\t\t\tRATSO \n</b>\tThe coat? A guy I did a favor once\n\tgave it to me. Christ.\n\n<b>\t\t\tJOE \n</b>\tWho'd you ever do a favor for? You\n\tjust let some poor bastard freeze\n\tto death, wouldn't you?\n\nJoe slams ten dollars on the table. Ratso glances at Joe with\ncurious concern.\n\n<b>\t\t\tRATSO \n</b>\tWhere'd that come from?\n\n<b>\t\t\tJOE \n</b>\tForty-second Street. Where'n hell\n\tyou think it come from?\n\n<b>\t\t\tRATSO \n</b>\tYou wanna know the truth? You dumb\n\tbastard, I got it for you. Look at\n\tit. Goddam thing's ten sizes too\n\tbig for me.\n\nRatso pulls off the coat and throws it at Joe.\n\n<b>\t\t\tJOE \n</b>\tWear it yourself. I wouldn't put it\n\ton my back.\n\nJoe throws it back at Ratso.\n\n<b>\t\t\tRATSO \n</b>\tGoddamned if I'll wear it!\n\nRatso hurls it in a corner. Joe shoves the ten at Ratso.\n\n<b>\t\t\tJOE \n</b>\tGo get your medicine. Before you\n\tdie on my goddam, hands...\n\n<b>EXT. EAST RIVER BRIDGE - DAY\n</b>\nHigh angle -- Joe and Ratso cross an foot, chilled by wind,\nneither wearing the sheepskin coat. The Queens riverfront and\nfactories appear cold and bleak, deserted on Sunday.\n\n<b>EXT. LONG ISLAND CEMETERIES - DAY\n</b>\nCamera moves into acres of tombstones, piled like low-rent\nhousing projects for the dead, the various faiths segregated\nby crumbling boundaries.\n\n<b>\t\t\tJOE'S VOICE\n</b>\tShee-it. I hate boneyards.\n\n<b>\t\t\tRATSO'S VOICE \n</b>\tSo split. He ain't your goddam,\n\tfather.\n\n<b>EXT. PROTESTANT CEMETERY - DAY\n</b>\nRatso leads Joe past a Negro family at a grave -- glances\naround -- snatches an elaborate floral piece from a headstone\nand hides it under his black raincoat as he darts toward a\nlow dividing wail and swings himself over into...\n\n<b>EXT. CATHOLIC CEMETERY - DAY\n</b>\n... an endless section of plain stone markers. Joe touches\nhis hat to two nuns, guiltily hurrying to overtake Ratso at\nibis father's grave, indistinguishable from the other graves\nexcept for the name on the headstone. Ratso places the floral\npiece on the grave with almost absurd solemnity. Joe laughs.\n\n<b>\t\t\tJOE \n</b>\tKee-rist, you sure are one twisty\n\tlittle bastard, Ratso.\n\n<b>\t\t\tRATSO \n</b>\tThe name's Rico, at my own father's\n\tgrave, a man deserves some respect.\n\n<b>\t\t\tJOE\n</b>\tRespect shee-it! You even steal\n\tflowers for his grave.\n\n<b>\t\t\tRATSO\n</b>\tCan he smell the difference, eh?\n\nJoe reads from the ribbon on the floral display.\n\n<b>\t\t\tJOE \n</b>\tWell, uh, he dam well know he ain't\n\t'be-loved Aunt Winifred'.\n\n<b>\t\t\tRATSO\n</b>\tHe can't read. Even dumber than\n\tyou. Couldn't write his own name. X\n\t-- that's what it ought to say\n\tthere on that goddam headstone. One\n\tbig lousy X like our flat.\n\tCondemned. By order of City Hall.\n\nJoe is frowning, standing at the,headstone, momentarily\ndepressed with an undefined sorrow.\n\n<b>\t\t\tJOE \n</b>\tMy Grammaw Sally Buck, she died\n\twithout letting me know.\n\n<b>EXT. SALLY BUCK'S BEAUTY SALON - DAY\n</b>\nThrough the window, past the FOR RENT sign, the tarnishing\ndriers are lined up like tombstones.\n\n<b>EXT. JEWISH CEMETERY - DAY\n</b>\nJoe frowns, puzzled, as Ratso pulls out a black skullcap,\nleading Joe toward a group of professional mourners,\nwhispering:\n\n<b>\t\t\tRATSO \n</b>\tJust keep your hat on and cry a\n\tlittle. They tip you when it's\n\tover.\n\nJoe and Ratso join the mourners as the funeral moves to the\ngrave, Ratso mouthing an authentic double-talk...\n\n... Joe standing self-consciously, aware of the covert\nglances of the other mourners, automatically reaching up to\nremove his hat, remembering when Ratso elbows him in the\nribs...\n\n... Joe scowling, tight-lipped, embarrassed by the tip that\nis thrust in his hand.\n\n<b>INT. LUNCH COUNTER - EVENING\n</b>\nA weary Santa Claus, in a rented beard and over-large\ncostume, warms his hands over the steam of his coffee cup.\nJoe and Ratso are arguing farther down the counter.\n\n<b>\t\t\tJOE \n</b>\tJust ain't right, cheating someone\n\tdead and can't cheat back.\n\nIn the background, as Ratso speaks, HANSEL and GRETEL\nMACALBERTSON enter the lunch counter, inspecting the\ncustomers one by one. Both wear black turtlenecks and jeans,\ndressed as twins, both blond and pretty.\n\n<b>\t\t\tRATSO \n</b>\tYou and my old man. Same kinda\n\tmind. Putting me down till the day\n\the died...\n\t\t(mimics)\n\t... why can't you be like your\n\tbrothers? Sons a father could be\n\tproud of. Yeah, sure. My brothers.\n\tToo goddam busy making something of\n\tthemselves to show up when the old\n\tman's dying!\n\nConditioned reflex, Ratso starts to cough. Joe sees the\nMacAlbertsons in the mirror, standing behind him, studying\nhim. Gretel nods, Hansel hands Joe a large black card,\nsmiling vaguely, then moves on.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tWhat was that all about?\n\nJoe studies the black card, frowning at first, suddenly\nsmiling, turning as if to call after the MacAlbertsons, but\nthey are disappearing around the corner. Joe hands the card\nto Ratso.\n\n<b>\t\t\tJOE \n</b>\tYou wanna read something, read\n\tthis. I been invited somewhere.\n\nShocking pink letters on the black card read YOU ARE INVITED\n<b>TO HELP US BURY LOVE -- TONIGHT AT BROADWAY AND HARMONY LANE \n</b><b>- HANSEL AND GRETEL MACALBERTSON.\n</b>\n<b>\t\t\tJOE (CONT'D)\n</b>\tThey picked me. The only one in the\n\twhole goddam place. You see how\n\tthey looked me over, up and down\n\tbefore they give me that?\n\n<b>\t\t\tRATSO \n</b>\tSo?\n\nJoe sees a young man washing cups behind the counter. Joe\nshakes his head, wonderingly, turning to study himself in the\nmirror.\n\n<b>\t\t\tJOE \n</b>\tWell, this thought just struck me.\n\tIt wasn't too long ago I was\n\twashing dishes way the hell\n\tsomewhere in Texas.\n\n<b>\t\t\tRATSO \n</b>\tYeah, well, so?\n\n<b>\t\t\tJOE \n</b>\tNow I'm here. I'm in New York City.\n\tGetting picked for things. Don't\n\tyou see what I'm driving at?\n\n<b>\t\t\tRATSO \n</b>\tWhat you're driving at, you want me\n\tto get lost so you can go to your\n\tfancy-ass party.\n\n<b>\t\t\tJOE \n</b>\tDid I say that? Did I? \n\t\t(studies card)\n\tIt don't say nothing about you...\n\n<b>\t\t\tRATSO \n</b>\tDon't say nothing about you either.\n\n<b>\t\t\tJOE \n</b>\tBut they picked me, right? So what\n\tI'll do, I'll just say, now look,\n\tyou want me? Well, I don't go\n\tnowhere without my buddy here.\n\n<b>\t\t\tRATSO\n</b>\t\t(shrugs)\n\tWell, what the hell, I got nothing\n\tbetter to do.\n\n<b>EXT. LOFT BUILDING - NIGHT\n</b>\nSnow swirls in the aureole of a street light as Joe and Ratso\nrun, heads lowered, turning into...\n\n<b>INT. LOFT BUILDING - NIGHT\n</b>\n... a drab entrance hall, dimly lit -- signs identifying\nvarious commercial tenants -- a pink-on-black placard reading\nMACALBERTSON, TWO FLIGHTS UP. Joe has started up before he\nnotices Ratso, leaning on the bannister at the foot of the\nstairs, struggling to catch his breath. His face and hair are\nwet with perspiration, his lips lavender-blue.\n\nIn swift flashes -- intercut -- Joe reads the panic in\nRatso's eyes, so intense that Joe shares it, unable to speak\nor offer reassurance.\n\n<b>\t\t\tJOE \n</b>\tBetter dry your hair some. You\n\tsweating all over the goddam place.\n\nJoe pulls out his shirttail, grabs Ratso by the neck and rubs\nhis head dry.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tYou got a comb?\n\n<b>\t\t\tRATSO \n</b>\tDon't need a comb.\n\n<b>\t\t\tJOE \n</b>\tFew dozen cooties won't kill me,\n\tdon't guess.\n\nJoe hands Ratso his own comb. Ratso swipes at his tangled\nhair angrily until two teeth break in the comb. He hands the\ncomb back, tugs at his hair with his fingers, pats it in\nplace, then looks back into Joe's eyes.\n\n<b>\t\t\tRATSO\n</b>\tOkay? I look okay?\n\nIn a moment of silence, distant sounds can be heard -- a\nsiren, the grinding teeth of a garbage truck, the twang of an\nelectric guitar upstairs at the party -- then Ratso makes a\nquick gesture of impatience and starts up the stairs, pulling\nhimself on the bannister.\n\n<b>INT. MACALBERTSONS' LOFT - NIGHT\n</b>\nA bank of lights blinds Joe and Ratso as they enter --\nelectronic rock blasts their ears -- a bearded cameraman on a\nstep-ladder photographs them as they stand confused -- facing\na monstrous collage of tabloid photos blown up, showing the\nmurder of a hippie known as Groovy -- in-huge black letters,\nLOVE WAS GROOVY -- GROOVY IS DEAD. Joe shouts over the\namplified music.\n\n<b>\t\t\tJOE \n</b>\tBetter get a hold of someone and\n\ttell them I'm here.\n\nRatso points to his ear -- he can't hear -- following Joe\nacross the room. The huge loft is crowded with a random\nselection, gathered to serve as dress extras in an\nunderground film. The party is the scene. The MacAlbertsons\nmerely supply the ingredients and allow it to happen, with\ncameras strategically placed to record the happening...\n\n... Hansel with tape recorder, Gretel with hand-held camera \ndrifting through the crowd -- catching words and images in a\ndetached, whimsical fashion. Gretel turns her camera on Joe\nand Ratso as they approach.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tWell, I made it. This here is Ratso\n\tRizzo and I...\n\n<b>\t\t\tRATSO \n</b>\tRico. Rico Rizzo.\n\nGretel smiles without recognition. Hansel gestures vaguely.\n\n<b>\t\t\tHANSEL \n</b>\tDo you need anything? I mean\n\tthere's beer and so forth. Whatever\n\tyour thing is...\n\nThe twins move away together, pausing to confer with the\noperator of a tripod camera -- focused on an emaciated flower\ngirl with long hair and dirty feet, stretched in a\nsarcophagus, clutching a dead daffodil, her eyes glazed.\nScrawled in huge letters on the wall over her head -- LOVE!\n\n<b>\t\t\tRATSO\n</b>\tIf you want the word on that\n\tbrother and sister act, I'll give\n\tyou the word. That Hansel's a fag\n\tand Gretel's got the hots for\n\therself. So who cares, right? Load\n\tup on the salami...\n\nRatso heads for the refreshment table. Joe starts after him\nbut pauses, intrigued by an alcove under the balcony where a\nlight show is in progress -- surreal images of naked bodies\nprojected against abstract currents of color and strobe\nlight...\n\n... a bored fat lady in a muu-muu, squatted like a Buddha at\na low table, rolling joints for the guests.\nShe lights a joint and offers it to Joe as he wanders in to\nwatch the show. Joe laughs delightedly when he realizes what\nit is...\n\n<b>\t\t\tJOE \n</b>\tShee-it, this is one helluva party!\n\n... glancing around at the others, imitating their techniques\n-- the quick inhaler, who follows with sharp gulps of air -\nthe deep inhalers who draw air as they inhale -- the stylist\nwho lets the smoke drift out and inhales through the nostrils\n-- Joe puffing himself slightly dizzy, starting to laugh at\nthe silent flick effect of the strobe light -- the action\naround him slowing almost imperceptibly, overcranked -- a\nveil of smoke hanging over the fat woman's face, transforming\nher into a laughing witch -- a similar veil around Joe's\nhead, relaxing the self-conscious tension of his face,\nspontaneously curious about the play of light on his hand,\ngrinning at...\n\n... a serious young technician handling the light show,\nscattering psychedelic stars across a sky of magenta flesh...\n\n... Joe reaching for the stars as he rises and wanders back\nto the crowded loft, fascinated to see...\n\n... a crew with cameras and lights, on the balcony at one end\nof the loft, photographing the scene below...\n\n... a dark-haired lady by the name of SHIRLEY -- chic in the\nstyle of a gangster's moll -- drinking beer from the bottle,\npredatory eyes searching the crowd...\n\n... Ratso surreptitiously stuffing his pockets from the\nbuffet table, glancing nervously over his shoulder, unaware\nof Gretel and her hand-held camera, photographing Ratso as he\nsteals, turning away casually, disinterested...\n\n... Joe laughing as he dances for a moment with a tall black\ngirl -- the lights swinging around them -- faces swimming...\n\n... Shirley in fleeting close-up, gone in an instant,\nreappearing...\n\n<b>INT. MACALBERTSON BATHROOM - NIGHT\n</b>\n... her face in the mirror smiling in a dark, provocative way\n-- Joe standing at the bathroom door, forgetting to be\nembarrassed as Shirley turns away from the mirror,\nunhurriedly, running her fingers through her hair, boldly\nmeeting Joe's eyes.\n\n<b>\t\t\tSHIRLEY \n</b>\tI can tell, can't you?\n\n<b>\t\t\tJOE \n</b>\tYeah, oh yeah.\n\n<b>\t\t\tSHIRLEY \n</b>\tWhat'll we do? Leave now or what?\n\tYour place or mine? Oh God, the\n\tsecond I looked at you I knew. Did\n\tyou?\n\nJoe grins, watching Shirley's lips move, unable to keep her\nin sync, startled to hear Ratso's voice.\n\n<b>\t\t\tRATSO'S VOICE\n</b>\tShe's hooked...\n\n<b>INT. MACALBERTSONS' LOFT - NIGHT\n</b>\nJoe realizes he is back at the party, Ratso whispering\nhoarsely.\n\n<b>\t\t\tRATSO\n</b>\t... I'd say she was good for ten\n\tbucks, but I'll ask for twenty...\n\nBut Joe is watching with terrible fascination as Hansel and\nGretel lift the flower girl from her sarcophagus.\n\n<b>\t\t\tSHIRLEY'S VOICE \n</b>\tDid you know? We were going to make\n\tit?\n\nJoe glances down to see himself flanked by Ratso and Shirley.\n\n<b>\t\t\tRATSO \n</b>\tYou really want to do business?\n\n<b>\t\t\tSHIRLEY\n</b>\tWho's he? Oh God! Don't tell me you\n\ttwo are a couple -- ?\n\nThe flower girl, hypnotically dazed, accepts a broom dipped\nin black paint and smears a huge X across LOVE. Joe laughs.\n\n<b>\t\t\tHANSEL'S VOICE\n</b>\tWhy are you laughing, Joe?\n\nHansel holds a microphone toward Joe, who shrugs, grinning at\nRatso and Shirley. Gretel's camera moves down Joe's body.\n\n<b>\t\t\tHANSEL\n</b>\tAre you for real, Joe?\n\n<b>\t\t\tJOE \n</b>\tWell, I ain't a f'real cowboy, but\n\tI'm one hell of a stud!\n\nShirley glances at Ratso, who nods, whispering in her ear.\n\n<b>\t\t\tRATSO \n</b>\tA very expensive stud. And I happen\n\tto be his manager.\n\nThe scene -- from Joe's viewpoint -- becomes increasingly\nconfusing and fragmented, dialogue and image moving in and\nout of focus, cameras and lights surrounding him, keeping the\ncenter of attention in his own blown mind...\n\n... Shirley's eyes unnaturally bright, inspecting his body,\nlingering on his thighs, moistening her lips...\n\n<b>\t\t\tSHIRLEY \n</b>\tIt's too much -- to come face to\n\tface with a walking talking sex\n\tfantasy -- to buy a man's -- God!\n\n... the tall black girl dancing in stroble light, starting to\nremove her clothes -- Gretel following her with a camera...\n\n<b>\t\t\tSHIRLEY'S VOICE\n</b>\tI can't wait to tell my man Monday.\n\tI should be taking notes. Look at\n\tmy arm!\n\n... Shirley's talon-like fingernails caressing the gooseflesh\non her tanned arm...\n\n<b>\t\t\tRATSO'S VOICE\n</b>\tI gotta sit down. I feel crummy.\n\nRatso stretched out on a Victorian love seat -- the flower\ngirl walking unsteadily, passing out dead daffodils, placing\none in Ratso's hand Gretel photographing his reaction...\n\n<b>\t\t\tSHIRLEY'S VOICE\n</b>\tEat it -- a man in your line of\n\twork has to keep his strength up...\n\n... Shirley bringing Joe a massive sandwich on a paper plate,\nwatching him bite into it...\n\n<b>\t\t\tSHIRLEY \n</b>\tIt's fantastic, now I know,\n\teverything you do has sexual\n\timplications.\n\tIf I you know, bought it -- could I\n\ttake pictures of you naked? That's\n\tpart of it, isn't it, kinky kinda\n\tthings?\n\n... the tall black girl and a few others are trying to\npromote an orgy. A scrofulous old wino dances spastically,\nworking his toothless gums, preparing to expose himself to\ntwo girls dancing together...\n\n<b>\t\t\tHANSEL'S VOICE\n</b>\tWe want you, Joe. You've been\n\tchosen.\n\n... five youths stand beside the sarcophagus -- two sailors,\ntwo cycle freaks, a weight-lifter -- waiting to be\npallbearers. Joe joins them. All lights and cameras are\nturned on the slow funeral procession, carrying the flower\ngirl out of the loft to the tune of \"Moonlight and Roses\".\nStrobe light adds to the unreality of the scene...\n\n<b>\t\t\tSHIRLEY'S VOICE \n</b>\tI had a thing for him. Before I\n\tknew. Why should knowing make it\n\tmore of a thing?\n\n... Shirley talks to Gretel as she photographs the funeral.\n\n<b>\t\t\tSHIRLEY \n</b>\tNaturally I'll have to ask myself\n\twhy a cowboy? And why a cowboy\n\twhore? But not tonight.\n\n<b>INT. MACALBERTSON LANDING - NIGHT\n</b>\nShirley is pulling her coat out of the pile on the bannister.\n\n<b>\t\t\tSHIRLEY \n</b>\tIncidentally, how much is this\n\tgoing to cost me anyway?\n\nJoe turns to Ratso, whose attention is fixed on the coats.\n\n<b>\t\t\tJOE \n</b>\tTell her, Ratso.\n\n<b>\t\t\tRATSO \n</b>\tTwenty bucks...\n\n<b>\t\t\tSHIRLEY \n</b>\tSold. Let's go.\n\n<b>\t\t\tRATSO \n</b>\t... and taxi fare for me.\n\n<b>\t\t\tSHIRLEY \n</b>\tGet lost.\n\n<b>\t\t\tRATSO \n</b>\tI agree. And for that service I\n\tcharge one dollar taxi fare.\n\nShe takes a dollar from her purse and hands it to Ratso,\ntakes Joe's arm and starts down the stairs. Ratso lingers,\nstarting quickly through the coats, frisking them for loose\nchange.\n\n<b>INT. LOFT BUILDING LOBBY - NIGHT\n</b>\nAt the foot of the stairs, Shirley kisses Joe violently.\n\n<b>\t\t\tSHIRLEY \n</b>\tYour name's Joe. Which is fabulous.\n\tJoe could be anyone. Kiss me, Joe,\n\tmove over, Joe, go away, Joe. It's\n\tjust perfect.\n\nThey glance up as Ratso appears, swinging down too rapidly on\nthe bannister. He misses a step and falls -- a clown's fall,\nunable to stop but apparently not hurting himself. Shirley\nand Joe are laughing when Ratso lands at the foot of the\nstairs.\n\n<b>\t\t\tSHIRLEY (CONT'D)\n</b>\tHe fell. Hey, fella, you fell. Is\n\the all right?\n\n<b>\t\t\tRATSO\n</b>\t\t(rises, mimics)\n\tIs he all right!\n\n<b>\t\t\tJOE \n</b>\tWell, if you're awright, why you\n\thanging on the bannister. Can you\n\twalk or not?\n\n<b>\t\t\tRATSO \n</b>\tWalk? Naturally I can walk.\n\n<b>\t\t\tSHIRLEY \n</b>\tHe's got taxi fare.\n\n<b>\t\t\tJOE \n</b>\tSure you're all right?\n\n<b>\t\t\tRATSO \n</b>\t\t(shouts)\n\tI said yeah! Yeah, yeah, yeah!\n\n<b>INT. TAXICAB - NIGHT\n</b>\nJoe and Shirley are kissing. Shirley rolls away, flushed,\nfanning herself. Joe rolls down the window.\n\n<b>EXT. VILLAGE STREET - NIGHT\n</b>\nJoe leans out of the taxi window, waving his Stetson,\nbellowing at the snow.\n\n<b>\t\t\tJOE\n</b>\tWhoopee ti yi yo...!\n\n<b>EXT. LOFT BUILDING - NIGHT\n</b>\nRatso makes his way slowly from the building to the curb,\nwhistling between his teeth sharply, hailing a cab. The cab\nslows to a stop. Then the driver sees Ratso, shifts into gear\nand drives on. Ratso bites his thumb after the cab, rests for\na moment on the lamp post, then starts painfully inching his\nway along the deserted street.\n\n<b>INT. SHIRLEY'S BEDROOM - NIGHT\n</b>\nJoe lies on his back, staring fixedly at a fragile mobile\nhanging from the ceiling, stirring listlessly.\n\n<b>\t\t\tSHIRLEY'S VOICE\n</b>\tThat happens. Don't worry about\n\tit...\n\nShirley leans on one elbow, looking at Joe sympathetically,\nfighting an almost irrepressible desire to laugh. Still\navoiding Shirley's eyes, Joe finds a cigarette on the side\ntable, searches for matches.\n\n<b>\t\t\tJOE \n</b>\tWell, that's something never\n\thappened to me before, you can bet\n\tyour bottom dollar. Uh, where's the\n\tmatches, ma'am?\n\n<b>\t\t\tSHIRLEY \n</b>\tTop drawer. Maybe if you didn't\n\tcall me ma'am, things would work\n\tout better.\n\nJoe finds the matches, lights up and lies back, staring at\nthe mobile as he smokes, still not looking at Shirley.\n\n<b>\t\t\tJOE\n</b>\tFirst goddam, time it ever quit on\n\tme. Fact.\n\nThe repressed laugh finally breaks through. Shirley stifles\nit quickly as Joe sits up, looking at her.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tYou think I'm lying!\n\n<b>\t\t\tSHIRLEY\n</b>\t\t(controls herself)\n\tNo. Of course not. Just something\n\tstruck me funny...\n\nClose on Joe -- watching Shirley closely, reacting.\n\n<b>\t\t\tSHIRLEY'S VOICE \n</b>\tI just put myself in your shoes. I\n\thad this image of a bugler without\n\ta horn, a policeman without a\n\tstick, etcetera, etcetera and I...\n\t\t(giggles)\n\tI think I'd better shut up, I'm\n\tmaking it worse.\n\nShirley composes her face, reaching out to touch Joe. But\nthat doesn't help either. He reacts sharply.\n\n<b>\t\t\tSHIRLEY \n</b>\tMaybe we should take a little nap,\n\tsee what happens?\n\n<b>\t\t\tJOE \n</b>\tI ain't sleepy.\n\n<b>\t\t\tSHIRLEY \n</b>\tI know. Scribbage!\n\nExtreme close-up of Joe -- frowning, puzzled...\n\n<b>\t\t\tJOE \n</b>\tShee-it...\n\n... camera pulling back to show Joe concentrating on a game,\nspread out on the sheet, consisting of nine dice lettered on\nall sides, the object being to build as many words as\npossible, Scrabble fashion, while a sand timer counts the\nseconds. Shirley watches Joe's efforts to think with\nsympathetic amusement. The only word Joe has composed so far\nis MAN.\n\n<b>\t\t\tSHIRLEY \n</b>\tThat's pretty Freudian, Joe.\n\n<b>\t\t\tJOE \n</b>\tWhat? It's a perfectly good word,\n\tain't it. How much time I got?\n\t\t(glances up)\n\tGoddam sand thing drive you crazy.\n\tKee-rist. Spelling never was a very\n\tstrong point with me. Even in\n\tschool.\n\n<b>\t\t\tSHIRLEY \n</b>\tIf you didn't talk so much, maybe\n\tyou could think more.\n\n<b>\t\t\tJOE \n</b>\tTalking helps. Don't talk, you get\n\tmuddled in your head. Hey! Now you\n\tjust look at this here!\n\nJoe spells out MONY, down from the M in MAN.\n\n<b>\t\t\tSHIRLEY \n</b>\tThere's an E in MONEY. If that's\n\tyour word.\n\n<b>\t\t\tJOE \n</b>\tM-O-N-Y -- I'm right! That's just\n\texactly how they spell it up there\n\ton that big building, bet you could\n\tsee it from here. M-O-N-Y.\n\n<b>\t\t\tSHIRLEY \n</b>\t\t(stifles giggle)\n\tOkay. Never argue with a man.\n\n<b>\t\t\tJOE\n</b>\tY -- what in hell starts with Y?\n\nShirley slyly trails the tips of her fingernails across Joe's\nchest as she leans over to study the game, breathing softly\ninto his ear as she speaks.\n\n<b>\t\t\tSHIRLEY\n</b>\tIt can end in Y day, pay, lay --\n\they, pay lay!\n\nOne predatory hand rests on his knee -- as if by accident -\ndisarranging the sheet, talon nails lightly brushing his\nthigh.\n\n<b>\t\t\tJOE \n</b>\tCut it out. That's cheating,\n\tteasing me so I can't think.\n\tJust one bitsy Y word and I gonna\n\tbeat you!\n\n<b>\t\t\tSHIRLEY \n</b>\tYou gonna beat me, Joe?\n\n<b>\t\t\tJOE \n</b>\tBeat your butt, you don't lemme\n\tthink!\n\n<b>\t\t\tSHIRLEY \n</b>\tGay ends in Y. Fey. You like that --\n\tgay fey -- is that your problem?\n\n<b>\t\t\tJOE \n</b>\tI show you what problem --\n\nBut the end of his sentence is swallowed by Shirley, taking\nhis kiss in her open mouth, crushed by its impact, an animal\nnoise snarling deep in her throat -- the agonized alley cat\nwail of pleasure -- Joe's problem is solved. Joe's love theme\nswells triumphant. At the same time, Shirley half-rises,\ntrying to force Joe's head down, her own on top. The issue is\njoined. Shirley has named the game. Her objective is to force\nJoe onto his back. Joe's objective is to retain his\ninitiative. Camera ignores the classic action on the central\nfront, concentrating exclusively on peripheral tactical\nmaneuvers...\n\n... Joe's elbows pinning her shoulders...\n\n... her eyes bright, accepting the challenge...\n\n... his tight smile revealing clenched teeth...\n\n... her fingers searching out then tickling his underarm...\n\n... Joe laughing as he falls lopsidedly...\n\n... Shirley laughing triumphantly...\n\n... his hand closing on her wrist...\n\n... her talon-nails clawing the air...\n\n... her toes walking up his calf...\n\n... her legs suddenly locking around his knees...\n\n... her free hand grabbing his hair...\n\n... her shoulder rising as she forces his head back...\n\n... her lips pressing down on his...\n\n... his hand swatting an unidentified mass of flesh...\n\n... her eyes popping, teeth clamping his ear lobe...\n\n... his hand catching her ankle...\n\n... her teeth losing the ear lobe as she screams...\n\n... her foot appearing upside down beside her face...\n\n... her talon-nails furrowing flesh, drawing blood...\n\n... his head rearing back, roaring...\n\n... both rolling to the floor, out of view...\n\n... her feet suddenly flying up into view...\n\n... her hand tugging rhythmically at the blanket...\n\n... her other hand wildly exploring Joe's back...\n\n... her ankles locking spasmodically...\n\n... her eyes and mouth wide, gaping...\n\n... the blanket suddenly ripping free, flying into the air as\nher arm flings itself around Joe...\n\n... the bedclothes spilling down around them, muffling her\nascending shrieks.\n\n<b>\t\t\tJOE'S VOICE\n</b>\tWhoopee ti yi yo...\n\n<b>INT. SHIRLEY'S BEDROOM - MORNING\n</b>\nShirley has difficulty reverting to her nine-to-five role as\na Madison Avenue career girl. Half-dressed for work, she is\ntalking on the telephone, her eyes on the open door to the\nbathroom, through which Joe's voice continues singing.\n\n<b>\t\t\tSHIRLEY\n</b>\tWell, I really can't talk now, if\n\tyou know what I mean, but believe\n\tme when I say, Myra, it's an\n\texperience every emancipated woman\n\towes herself. I'm not. I'm not\n\texaggerating. Well, what's Phil's\n\tpoker night?\n\t\t(yells off)\n\tJoe -- are you available next\n\tThursday, eight-thirty?\n\n<b>INT. SHIRLEY'S BATHROOM - MORNING\n</b>\nThoroughly shaved, bathed and groomed, Joe is sprinkling an\nexpensive cologne into his boots. He yells back\nenthusiastically.\n\n<b>\t\t\tJOE \n</b>\tWell, lemme think now, Thursday,\n\teight-thirty, yeah, I guess I could\n\tbe available. Hell, yeah.\n\n<b>INT. SHIRLEY'S BEDROOM - MORNING\n</b>\nShirley turns back to the phone. Joe appears, grinning.\n\n<b>\t\t\tSHIRLEY \n</b>\tWhy don't you just come here? I'll\n\tbe working every night this week.\n\tI'll leave a key with the super...\n\n<b>\t\t\tJOE'S VOICE \n</b>\tWell, ma'am -- Shirley -- I sure\n\thate to trouble you, but...\n\nShirley opens her purse, savoring the moment. As she places\nthe money in Joe's hand...\n\n<b>INT. MEN'S STORE - DAY\n</b>\n... Joe slaps a bill on the counter, admiring a fine new\ncowboy shirt in the mirror, wriggling new white socks into\nhis boots. Suddenly remembering, he goes to the sock rack and\nbuys two pairs, one large and one small. Gradually\ndominating, Joe's love theme recurs, continuing over...\n\n<b>INT. CHAIN DRUG STORE - DAY\n</b>\n... Joe slaps down money to pay for an assortment of\nmedicine.\n\n<b>INT. CONDEMNED TENEMENT - DAY\n</b>\nJoe takes the stairs two at a time to burst in on...\n\n<b>INT. X FLAT - DAY\n</b>\n... Ratso huddled in the overstuffed chair -- wearing the\nstolen sheepskin coat -- wrapped in blankets, his teeth\nchattering, in spite of the sweat on his forehead. Joe stops\nabruptly, his mood shattered by Ratso's alarming condition.\nThey simply stare at each other for a moment, then Joe turns\naway to see soup heating on the Sterno stove. Joe tosses one\nof his paper bags onto Ratso's lap...\n\n<b>\t\t\tJOE \n</b>\tSee what you think of that crap.\n\tI'll pour your soup. Got some of\n\tthat junk you like to swill, too.\n\tMentholatum. Aspirin. All that shee\n\tit...\n\nRatso opens the paper bag, trying to control his shivering,\npulling out the socks and a suit of long underwear. He sees\nJoe watching him for a reaction. The best Ratso can do is a\nslight shake of his head.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tThey wrong?\n\n<b>\t\t\tRATSO \n</b>\tNo. But while you was buying the\n\tunderwear, I could have lifted the\n\tsocks.\n\n<b>\t\t\tJOE \n</b>\tYou couldn't lift fly specks from a\n\tsugar bowl. Can you hold this?\n\nJoe hands Ratso the soup. Ratso seems steadied by the warmth\nin his hands. He nods, sipping the soup.\n\n<b>\t\t\tRATSO\n</b>\tBut thanks.\n\t\t(hesitates, then)\n\tHey, Joe, don't get sore about this\n\tor anything. You promise?\n\n<b>\t\t\tJOE \n</b>\tYeah.\n\n<b>\t\t\tRATSO \n</b>\tWell, I don't think I can walk.\n\t\t(embarrassed)\n\tI mean, I been falling down a lot\n\tand, uh...\n\n<b>\t\t\tJOE \n</b>\tAnd what?\n\n<b>\t\t\tRATSO\n</b>\tI'm scared.\n\n<b>\t\t\tJOE \n</b>\tWhat of?\n\n<b>\t\t\tRATSO \n</b>\tWhat'll happen. I mean what they do\n\tto, you know, do with you -- if you\n\tcan't -- ah, Christ!\n\n<b>\t\t\tJOE \n</b>\tWho?\n\n<b>\t\t\tRATSO \n</b>\tI don't know. Cops. Or the -- how\n\tshould I know?\n\nRatso is trembling so violently that the sou, starts to slop\nover. Joe takes it and sets it on the table.\n\n<b>\t\t\tJOE \n</b>\tOkay. Here it is. You gonna go see\n\tthe doctor. I got nine bucks and\n\ttwenty more Thursday and I gonna be\n\triding high before you know it. So\n\tyou gonna get you the best goddam\n\tdoctor in this town and get\n\tyourself straightened out, that's\n\twhat.\n\n<b>\t\t\tRATSO \n</b>\tNo doctors. No, sir. Not me.\n\tDoctors are like goddam auto\n\tmechanics. Fix one-thing, unplug\n\tanother. Operate for piles and\n\twhile they're there, they unscrew\n\tyour liver. My old man, for God's\n\tsake, wasn't any sicker'n I am when\n\the went to the doctor.\n\n<b>\t\t\tJOE \n</b>\tWell, just exactly what the hell\n\tyou think you're gonna do? Die on\n\tme?\n\n<b>\t\t\tRATSO \n</b>\tI'm going to Florida, that's my\n\tonly chance.\n\n<b>\t\t\tJOE \n</b>\tYou know what's wrong with you? You\n\tgot fevers. You kinky as a bedbug.\n\tHow you gonna get to Florida?\n\n<b>\t\t\tRATSO \n</b>\tI'll find the money. If you just\n\tget me on the bus, that's all I\n\task.\n\n<b>\t\t\tJOE \n</b>\tJust when everything's going my\n\tway, you gotta pull a stunt like\n\tthis.\n\n<b>\t\t\tRATSO \n</b>\tI don't even want you to go.\n\tWhaddya think of that? I got other\n\tplans for my life than dragging\n\taround some dumb cowboy that thinks\n\the's God's gift to women. One\n\ttwenty-buck trick and he's already\n\tthe biggest stud in New York City.\n\tIt's laughable.\n\nJoe sets his Stetson on his head.\n\n<b>\t\t\tJOE \n</b>\tWhen I put you on that bus down to\n\tFlorida tonight, that'll be the\n\thappiest day of my life!\n\n<b>INT. PHONE BOOTH - DAY\n</b>\nJoe strikes a match with his thumbnail and watches it curl\naway while he waits, hearing a phone ring. Then the phone is\nanswered by a woman's voice.\n\n<b>\t\t\tJOE \n</b>\tHey, Shirley... Miss who? Oh, yeah,\n\twell, when will Missus Gardner be\n\thome? ... I'm a friend of hers, a\n\tgoddam good friend... Shee-it, I\n\tcan't wait till then...\n\nJoe hangs up while the answering service's voice is still\ntalking. The match has burned out. Joe flips it away.\n\n<b>INSERT\n</b>\nHeadline -- WALTER P. BOX TAKES NEW YORK BY SURPRISE.\n\n<b>EXT. TIMES SQUARE - DUSK\n</b>\nJoe loiters outside a gag headline print shop, his eyes\nfollowing a man in homburg and chesterfield.\n\n<b>EXT./INT. METROPOLE - DUSK\n</b>\nJoe lingers momentarily, identifying with the violence in a\njazz drummer, his eyes searching for a pickup.\n\n<b>INT. ARCADE - DUSK\n</b>\nJoe tests his skills in a shoot-down with a large metal\ncowboy and kills him, a recorded voice sneaks, \"Got me!\" as\nthe cowboy slumps. Joe glances off as he hears polite\napplause...\n\n<b>\t\t\tTOWNY'S VOICE\n</b>\tBravo...\n\n... TOWNY -- a stout, round-faced man -- clasps Joe's hand\nbetween both of his own, like an old friend.\n\n<b>\t\t\tTOWNY \n</b>\tHow are you?\n\t\t(more quietly)\n\tTownsend P. Locke, from Chicago.\n\tCall me Towny. I'm here to attend a\n\tpaper manufacturers' convention\n\tand, frankly, to have a little fun,\n\tdammit...\n\nTowny grips Joe's elbow, almost forcibly leading him away.\n\n<b>EXT. SIDE STREET WEST OF BROADWAY - DUSK\n</b>\nTowny's face appears huge at Joe's shoulder.\n\n<b>\t\t\tTOWNY \n</b>\tThis is my first night in town and\n\tI'll consider it a ghastly omen\n\tclouding my entire ten days, if you\n\tdon't consent to have dinner with\n\tme. Anywhere you like...\n\nTowny's mouth continues speaking at an incredible rate, but\nhis words are drowned out momentarily by the grinder of a\nsanitation truck, chewing up a discarded Christmas tree with\ntinsel clinging to it. Towny is still talking when they've\npassed the truck.\n\n<b>\t\t\tTOWNY (CONT'D)\n</b>\t... never mind how you're dressed.\n\tThey know me. I'll say you're with\n\tthe rodeo. There's always a rodeo\n\tin New York, dammit. Besides, you\n\tlook very elegant...\n\n<b>EXT. STREET CORNER - NIGHT\n</b>\nJoe hardly notices O'Daniel on a far cornet, his whining\nscarcely audible.\n\"Ye are the salt of the earth, Jesus said, but if the salt\nhath lost its savor, wherewith shall it be salted?\"\n\n<b>\t\t\tTOWNY \n</b>\tBut, dammit all, I just remembered,\n\twe'll have to eat in my room\n\tbecause I have this phone call\n\tcoming at nine-thirty...\n\n<b>INT. TOWNY'S HOTEL ELEVATOR - NIGHT\n</b>\nAn ancient open cage lift.\n\n<b>\t\t\tTOWNY \n</b>\tWhat I like about you, you're such\n\ta wonderful conversationalist. So\n\twon't that be nice to have dinner\n\tsent up?\n\n<b>INT. TOWNY'S HOTEL CORRIDOR - NIGHT\n</b>\nA threadbare, carpeted but spacious hallway.\n\n<b>\t\t\tTOWNY \n</b>\tFifty years ago this was the only\n\thotel in Manhattan. My mother\n\talways calls me at her bedtime, so\n\tI've got to be there.\n\n<b>INT. TOWNY'S BEDROOM-SITTING ROOM - NIGHT\n</b>\nThe room has little to recommend it except its size and large\nFrench window, through which -- ignored by Joe -- the Mutual\ntower flashes MONY. Towny waves Joe toward the couch, quickly\nslipping several physical culture magazines from the coffee\ntable onto a shelf beneath.\n\n<b>\t\t\tTOWNY \n</b>\tA drink? I've got some nice gin. If\n\tyou'd prefer something else,\n\tthey'll send it up...\n\n<b>\t\t\tJOE\n</b>\tGin's okay.\n\n<b>\t\t\tTOWNY \n</b>\tIt's so exciting. New York. The mad\n\tforward thrust of everything. My\n\tsense of time here is completely\n\taltered.\n\n<b>INT. TENEMENT STAIRS - DAY\n</b>\nJoe carries Ratso down the stairs, wrapped in a blanket.\n\n<b>INT. TOWNY'S BEDROOM-SITTING ROOM - NIGHT\n</b>\nThe coffee table is littered with empty cartons of Chinese\nfood, soaked through with brown sauce. Joe finds the last egg\nroll and eats it as Towny's voice drones on.\n\n<b>\t\t\tTOWNY \n</b>\tSometimes it seems to me time\n\tstopped twenty years ago. There was\n\tthis war, there was this handsome\n\tyoung man with quite black hair and\n\the was supposed to die. But he\n\tdidn't. Isn't that amusing?\n\n<b>\t\t\tJOE \n</b>\tWhat?\n\nTowny's dialogue moves out of sync. Towny's eyes seem to look\ninto camera -- from Joe's viewpoint -- but slightly past it.\nThe quality of the scene grows increasingly disjointed as Joe\nglances around the room, looking for something to steal,\nlosing personal contact with Towny, viewing him as an object\nto be used for a specific purpose.\n\n<b>\t\t\tTOWNY \n</b>\tEnough about me. I'm through\n\ttalking for the evening. Now I want\n\tto hear about conditions in the\n\tWest. The romance of the West holds\n\ta tremendous power over me. Mother\n\twas actually a pioneer woman, can\n\tyou believe it? When she calls,\n\tI'll introduce you and she'll be so\n\tthrilled.\n\n<b>EXT. TENEMENT NEIGHBORHOOD - DAY\n</b>\nRatso sits an a stoop while Joe hails a cab.\n\n<b>INT. TOWNY'S BATHROOM - NIGHT\n</b>\nTowny's voice is only a shrill monotone from here, Joe\nsearches with increasing desperation for something of value.\nAn old electric razor is too bulky for Joe's pocket, probably\nworthless anyhow. Towny's array of medicines merely recalls\nJoe's purpose.\n\n<b>\t\t\tTOWNY'S VOICE \n</b>\tMama, a coincidence. Guess who was\n\tbeing discussed. Discussed. Not\n\tdisgusted. Discussed! Do you have\n\tthat thing turned up? Why aren't\n\tyou wearing it! This is impossible!\n\n<b>EXT. GREYHOUND BUS TERMINAL - DAY\n</b>\nJoe lifts Ratso from the taxi and carries him inside.\n\n<b>\t\t\tJOE'S VOICE \n</b>\tListen, Towny, did I mention I got\n\ta sick kid?\n\n<b>INT. TOWNY'S BATHROOM - NIGHT\n</b>\nJoe is rehearsing the speech in the bathroom mirror.\n\n<b>\t\t\tJOE \n</b>\tWell, he is, he's sicker'n shee-it.\n\tAnd I've gotta get him South quick\n\tas I can...\n\n<b>INT. GREYHOUND BUS TERMINAL - DAY\n</b>\nJoe stands in a long line, glancing impatiently at the clock\nwhile Ratso waits on a bench, wrapped in his blanket.\n\n<b>INT. TOWNY'S BEDROOM-SITTING ROOM - NIGHT\n</b>\nTowny is stretched out on the couch, staring morosely.\n\n<b>\t\t\tTOWNY \n</b>\tI was so childish with her.\n\nJoe moves into frame past camera, standing in front of him,\nso that we can see the scene from behind Joe's waist.\n\n<b>\t\t\tJOE \n</b>\tWhat d'you want?\n\n<b>\t\t\tTOWNY \n</b>\tWhat?\n\n<b>\t\t\tJOE \n</b>\tWhat you got me up here for?\n\n<b>\t\t\tTOWNY \n</b>\tOh, difficult, it's so difficult.\n\tYou're a nice person, Joe -- I\n\tshould never have asked you up -- a\n\tlovely person. Oh, how I loathe\n\tlife. I loathe it. Please go.\n\tPlease.\n\n<b>\t\t\tJOE \n</b>\tYou want me to leave?\n\n<b>\t\t\tTOWNY \n</b>\tNo, yes. No, I mean yes please go.\n\tHelp me to be good. Come back\n\ttomorrow. Promise.\n\n<b>\t\t\tJOE\n</b>\tI'm going to Florida.\n\n<b>\t\t\tTOWNY \n</b>\tThis is terrible. I meet someone\n\twho -- then -- wait, I want to give\n\tyou a present. For your trip.\n\tYou'll let me please...\n\n<b>INT. GREYHOUND BUS TERMINAL - DAY\n</b>\nJoe's face is expectant, next in line at the ticket window.\nHe nods reassuringly toward Ratso.\n\n<b>INT. TOWNY'S BEDROOM-SITTING ROOM - NIGHT\n</b>\nJoe's face is puzzled then angry as Towny takes a Saint\nChristopher medal from his sack and hands it to Joe. His eyes\nare looking past Joe, his speech out of sync.\n\n<b>\t\t\tTOWNY \n</b>\tPlease take it. You don't have to\n\tbe Catholic. Saint Christopher is\n\tthe patron saint of all travelers.\n\tI want you to have it. For helping\n\tme be good.\n\n<b>INT. GREYHOUND BUS TERMINAL - DAY\n</b>\nIt's Joe's turn. The clerk looks at him expectantly.\n\n<b>INT. TOWNY'S BEDROOM-SITTING ROOM - NIGHT\n</b>\nJoe's voice is angry.\n\n<b>\t\t\tJOE \n</b>\tListen, I gotta have money.\n\n<b>\t\t\tTOWNY \n</b>\tOh. Yes. Of course. I should have\n\tthought. You shouldn't have to ask.\n\tThat was thoughtless of me. Yes.\n\tWait here...\n\nTowny hurries across the room to the bedside table. Beside\nthe telephone is a picture of a prosperous pioneer woman\nwearing a hearing-aid.\nTowny tries to conceal his movements as he takes a wallet\nfrom the drawer, lifts out a bill and tucks the wallet back\nand turns -- terrified to see Joe close behind him -- almost\nknocking the lamp off the table in his fright. Pressed\nagainst the table, protecting but calling attention to his\nwallet, Towny holds out the bill.\n\n<b>\t\t\tTOWNY (CONT'D)\n</b>\tHere. Don't even thank me.\n\n<b>\t\t\tJOE\n</b>\t\t(takes the bill)\n\tI gotta have more'n ten. I gotta\n\thave fifty-seven dollars.\n\n<b>\t\t\tTOWNY\n</b>\tI simply don't have it, Joe.\n\n<b>\t\t\tJOE\n</b>\tGet outta my way.\n\n<b>\t\t\tTOWNY \n</b>\tYou're wasting your time. There's\n\tnothing in there.\n\nTowny clutches the table, staring at Joe, shaking his head\nlike a bad little boy. Joe backhands him angrily. Trying to\nduck the blow, Towny stumbles and slips to the floor, but\ngrabs the table in his arms, watching Joe out of the corner\nof his eyes, whimpering. Joe grabs his hair, turning his face\nup.\n\n<b>\t\t\tJOE \n</b>\tLet go. Let go of the table.\n\nJoe slaps him, but Towny clings more fiercely to the table as\nJoe tries to jerk it free. Joe strikes him with his fist.\n\n<b>\t\t\tTOWNY \n</b>\tI deserved that, I know I did.\n\nBut he clutches the table wildly. His mother's picture falls\nunnoticed. Joe stands in panic, sickened, unable to fulfill\nthe role Towny has assigned him.\n\n<b>\t\t\tTOWNY (CONT'D)\n</b>\tI brought this on myself. I'm\n\tbleeding, my nose is bleeding,\n\tisn't it?\n\nTowny's eyes shine, teeth clenched in a crazy smile, blood\ntrickling from his nose. Suddenly Joe jerks the lamp free of\nits socket.\n\n<b>\t\t\tJOE \n</b>\tYou wanna gimme fifty-seven dollars\n\tor you wanna busted skull?\n\nTowny simply stares at the lamp.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tPlease let go of that table.\n\nJoe threatens, swings the lamp down, but stops short of\nhitting Towny. Towny shrieks -- eyes rolling back as he falls\nlimp -- loosing his grip on the table, leaning on the bed,\nlaughing and crying hysterically. Joe has to step over him to\nreach the wallet in the drawer. He takes all the money --\nprobably twice what he needs -- desperate to get out of the\nroom.\n\n<b>INT. GREYHOUND BUS TERMINAL - DAY\n</b>\nJoe carries Ratso up the steps onto the bus.\n\n<b>INT. TOWNY'S BEDROOM-SITTING ROOM - NIGHT\n</b>\nTowny's shrill little whisper says...\n\n<b>\t\t\tTOWNY \n</b>\tThank you, Joe.\n\n... provoking Joe to glance back. Towny is reaching for the\ntelephone, his eyes on Joe with wild brightness, holding his\nhand on the receiver. Joe knocks the phone from his hand,\nhits Towny in the mouth, jerks the cord from the wall as\nTowny falls -- gagging -- finally dislodging his dentures on\nthe carpet. Joe stands sick and confused, holding the useless\nphone in two hands...\n\n<b>EXT. GREYHOUND BUS TERMINAL - DAY\n</b>\nThe bus driver revs the powerful engine, shifting gears.\n\n<b>INT. TOWNY'S BEDROOM-SITTING ROOM - NIGHT\n</b>\n... Joe is about to hang the dead receiver on its hook when \non sudden impulse -- he shoves the small end of the receiver\ninto the toothless mouth of the man on the floor.\n\n<b>EXT. LINCOLN TUNNEL - DAY\n</b>\nThe bus roars into the tunnel.\n\n<b>INT. GREYHOUND BUS - DAY\n</b>\nJoe and Ratso sit near the rear of the bus. Ratso's teeth\nchatter, wrapped in the blanket.\n\n<b>\t\t\tRATSO \n</b>\tThirty-one hours.\n\nThey ride a few moments in silence.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tThe trip is. Nine-thirty in the\n\tmorning we get there. Not this\n\tmorning but the next one at nine\n\tthirty.\n\nBoth nod for a moment in silence.\n\n<b>\t\t\tJOE \n</b>\tThese guys're good drivers.\n\n<b>\t\t\tRATSO \n</b>\tThey gotta be.\n\n<b>\t\t\tJOE \n</b>\tYeah.\n\n<b>EXT. HIGHWAY - DAY\n</b>\nThe bus tires sing as it speeds South.\n\n<b>INT. GREYHOUND BUS - DAY\n</b>\nJoe and Ratso have reversed places, putting Ratso by the\nwindow. Joe watches a middle-aged couple try on their new\nstraw hats, unaware that Joe is watching them.\n\n<b>\t\t\tRATSO \n</b>\tYou get your first palm tree in\n\tSouth Carolina.\n\n<b>\t\t\tJOE \n</b>\tHow'n hell a dumb Bronx kid like\n\tyou know that?\n\n<b>\t\t\tRATSO \n</b>\tI read it.\n\n<b>\t\t\tJOE\n</b>\tShee-it. You believe all you read?\n\n<b>EXT. BRIDGE - NIGHT\n</b>\nThe metal grating rings as the bus soars onto it.\n\n<b>INT. GREYHOUND BUS - NIGHT\n</b>\nTwo aging young ladies in brand-new resort wear are casually\nexamining Joe, along with the other men on the bus, but Joe\nis frowning at Ratso, who shivers despite the bright sun.\n\n<b>\t\t\tJOE \n</b>\tIf you have to shiver, why don't\n\tyou pull the blanket up more?\n\n<b>\t\t\tRATSO \n</b>\tI been thinking. I hope we're not\n\tgonna have a lotta trouble about my\n\tname down there. Because like\n\twhat's the whole point of this trip\n\tanyway?\n\n<b>\t\t\tJOE \n</b>\tKeep the goddam blanket on.\n\n<b>\t\t\tRATSO \n</b>\tI mean New York's one thing, but\n\tcan you see this guy, imagine it,\n\trunning around the goddam beach all\n\tsuntan and he's going in swimming,\n\tlike, and then somebody yells 'Hey,\n\tRatso' -- how does that sound to\n\tyou?\n\n<b>\t\t\tJOE \n</b>\tSounds like they knew you.\n\n<b>\t\t\tRATSO \n</b>\tSounds like crap, admit it. And I'm\n\tnot gonna have it. I'm Rico all the\n\ttime, okay, do you blame me? That's\n\tagreed, okay? We're gonna tell all\n\tthese new people my name's Rico?\n\nJoe nods. Ratso closes his eyes, momentarily at peace.\n\n<b>EXT. HIGHWAY - DAWN\n</b>\nThe bus passes a Florida hotel sign too swiftly to read it.\n\n<b>INT. GREYHOUND BUS - DAWN\n</b>\nJoe frowns in his sleep, awakens, lifts his Stetson to see\nRatso wide awake, in misery, wiping tears from his eyes.\n\n<b>\t\t\tJOE\n</b>\tHey -- whatsa matter?\n\n<b>\t\t\tRATSO\n</b>\t\t(barely audible)\n\tI'm wet.\n\n<b>\t\t\tJOE \n</b>\tYou're what?\n\n<b>\t\t\tRATSO \n</b>\tI wet my pants! My seat's all wet.\n\n<b>\t\t\tJOE \n</b>\tHell, don't cry about it!\n\n<b>\t\t\tRATSO \n</b>\tHere I am going to Florida and my\n\tleg hurts, my butt hurts, my chest\n\thurts, my face hurts, and like that\n\tain't enough, I gotta pee all over\n\tmyself.\n\nJoe laughs suddenly, uncontrollably.\n\n<b>\t\t\tRATSO (CONT'D)\n</b>\tI'm falling apart, that's funny?\n\n<b>\t\t\tJOE\n</b>\t\t(nods, laughing)\n\tYou just -- just -- what happened,\n\tyou just had a little rest stop\n\twasn't on the schedule.\n\nRatso begins to laugh with Joe as if it were the funniest\nthing they'd ever heard. Then Ratso's face pales as he starts\nto choke and cough. Joe pats him on the back.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tHey, what size pants you wear?\n\n<b>EXT. SMALL TOWN STREET - DAY\n</b>\nThe bus is parked in the distance. Joe comes from a clothing\nstore, bare-headed, wearing plain slacks and sport-shirt. He\ncarries the boots, Stetson and cowboy suit in one hand, a\nbundle under his arm. He dumps his cowboy regalia in the\ntrash bin of a sandwich stand and calls to the WAITRESS.\n\n<b>\t\t\tJOE\n</b>\tCouple crullers'n coffee to go.\n\nThe Waitress draws coffee, wraps crullers.\n\n<b>\t\t\tWAITRESS\n</b>\tWhere you from?\n\n<b>\t\t\tJOE\n</b>\tNew York.\n\nJoe pays. She smiles, gives him change. Joe smiles, starts on\ntoward the bus, hardly aware that he has accomplished\nsomething rare and remarkable for Joe -- a simple human\ncontact without fear or threat, a pleasant everyday\nhappening.\n\n<b>INT. GREYHOUND BUS - DAY\n</b>\nJoe and Ratso have moved to the seat farthest back, wider\nthan the others. Joe blocks the view of the other passengers\nas he helps Ratso into a new pair of corduroy pants and a\nFlorida shirt. In the middle of the operation, Ratso dozes\noff. Joe shakes his head, scowling, annoyed, but continues,\nlifting Ratso enough to slide the pants around his waist.\nRatso awakens as Joe zips the fly.\n\n<b>\t\t\tRATSO \n</b>\tHey, what the hell you doing?\n\n<b>\t\t\tJOE \n</b>\tI'm zipping your fly, what the hell\n\tyou think I'm doing?\n\nThey both smile. It isn't funny enough to laugh at. Joe\narranges the blanket, takes out a package of cigarettes,\nglances at Ratso and puts it away.\n\n<b>EXT. TRAVELING SHOT WITH BUS - DAY\n</b>\nPalm trees are streaking past the window. The sun is glaring\nhot. A group of kids in bare feet and straw hats wave to the\nbus as it passes.\n\n<b>INT. GREYHOUND BUS - DAY\n</b>\nRatso's eyes squint in a dazed half-sleep. Joe leans across\nto pull down the shade. He hesitates a moment, watching...\n\n... past his reflection, a group of young men on their way to\nwork, carrying lunch pails, dressed exactly as Joe is now\ndressed...\n\n... then Joe lowers the blind and seats himself. Ratso nods\nslightly, his voice practically inaudible.\n\n<b>\t\t\tRATSO \n</b>\tThanks, Joe.\n\n<b>\t\t\tJOE \n</b>\tShee-it, you know, I got this thing\n\tall figured out, Ratso. I mean\n\tRico. When we get to Miami, what\n\tI'll do, I'll go to work. I gotta\n\tdo that, 'cause see, I ain't no\n\tkind of a hustler. I ain't even any\n\tgoddam good as a bum. I'm a\n\tnothing, that's what I am. So\n\treckon I'd better go to work and\n\tget me a goddam job. Okay?\n\nJoe glances at Ratso, but there is no response.\nSurreptitiously, Joe takes out a cigarette, turns his face\naway from Ratso and lights it, hiding it cupped in his hand\nas he smokes.\n\n<b>\t\t\tJOE (CONT'D)\n</b>\tYeah, guess that's what I'm gonna\n\tdo.\n\nThey ride for a moment in semi-darkness, Joe smoking, looking\nat the other people on the bus, brighter without the shades\ndown. Joe turns, checking the blanket around Ratso, noticing\nthat Ratso is sitting in a peculiarly stiff, awkward\nposition. Joe leans over to straighten Ratso's head, blocking\nour view for a moment. Then Joe leans back, frowning,\nthoughtful. We still do not see Ratso's face. Joe rises\nslowly, starting forward in the bus...\n\n... passing an older couple, a schoolgirl, two ladies with\nstraw hats, a young man trying to read, pausing when he\nreaches...\n\n... the DRIVER, staring out at the Sunshine Parkway with the\nDriver, leaning over so he won't have to speak too loudly.\n\n<b>\t\t\tDRIVER\n</b>\tYes, sir?\n\n<b>\t\t\tJOE,\n</b>\tMy friend's dead in the back seat.\n\n<b>\t\t\tDRIVER\n</b>\tYour friend's what in the back\n\tseat?\n\n<b>\t\t\tJOE\n</b>\tDead. Dead as a doornail.\n\n<b>\t\t\tDRIVER\n</b>\tIs this some kind of...\n\nHe glances at Joe, then pulls off the road and stands up.\n\n<b>\t\t\tDRIVER (CONT'D)\n</b>\tOkay, folks, everything's fine.\n\tNothing to worry about.\n\nThe passengers crane their necks as Joe follows the Driver to\nthe rear of the bus. The passengers at the rear are staring\nahead, trying not to see what is going on. The Driver touches\nRatso, straightens, touches his hat, but doesn't remove it.\n\n<b>\t\t\tDRIVER (CONT'D)\n</b>\tIs he kin to you?\n\nJoe nods no.\n\n<b>\t\t\tDRIVER (CONT'D)\n</b>\tDon't you want to close his eyes?\n\n<b>\t\t\tJOE\n</b>\tClose them?\n\n<b>\t\t\tDRIVER \n</b>\tJust reach over and close them.\n\tThat's all.\n\nJoe closes Ratso's eyes.\n\n<b>\t\t\tDRIVER (CONT'D)\n</b>\tI guess we'll just drive on, right?\n\tNothing else to do.\n\n<b>\t\t\tJOE \n</b>\tNo, sir. Not till Miami. I'll see\n\tto burying then.\n\nThe Driver moves to the front and turns to the passengers.\n\n<b>\t\t\tDRIVER\n</b>\tJust a little sickness, folks,\n\tnothing serious. We'll be in\n\tMiami...\n\t\t(looks at watch)\n\t... in forty minutes.\n\n<b>INT. GREYHOUND BUS - DAY\n</b>\nJoe sits stiffly, very frightened, as the bus starts on. Then\nhe glances at Ratso, frowning, reaches out an arm and puts it\naround Ratso, settling back, staring straight ahead.\n\n<b>\t\t\t\t  THE END\n</b>\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Midnight Cowboy</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=James Leo Herlihy\" title=\"Scripts by James Leo Herlihy\">James Leo Herlihy</a>  <a href=\"/writer.php?w=Waldo Salt\" title=\"Scripts by Waldo Salt\">Waldo Salt</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Midnight Cowboy Script.html#comments\" title=\"Midnight Cowboy comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:11:34.571215"}