{"title": "Midnight Express", "film_link": "/Movie Scripts/Midnight Express Script.html", "script_link": "/scripts/Midnight-Express.html", "info_raw": "\n\nMidnight Express Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Oliver Stone  Billy Hayes  William Hoffer\nGenres  Crime  Drama  Thriller\nScript Date : June 1977\nMovie Release Date : October 1978\n\nRead \"Midnight Express\" Script\n\n\n", "script": "\n\n\n\n                                     MIDNIGHT EXPRESS\n\n                               Screenplay by Oliver Stone\n\n                               Based on The Autobiography\n                           by Billy Hayes with William Hoffer\n\n\n\n\n\n                                                          Revised Draft\n                                                          June, 1977\n\n\n\n\n               PROLOGUE BLACK SCREEN - SUPERIMPOSE:\n\n                        THE FOLLOWING IS BASED ON A TRUE STORY.\n\n                             IT OCTOBER 6, 1970 ISTANBUL,\n\n                                       TURKEY -\n\n               SOUND UNDER, SHARP: CRACKLE - RIP - SNIP...\n\n               FADE IN:\n\n               A SET OF CLOTHES ON A HOTEL ROOM BED -- trenchcoat, bulky \n               white turtle-neck sweater, T-shirt, jeans, Western style \n               boots.  SOUNDS continue, Accentuated.  MOVE Across open \n               TRAVEL BAGS On The bed.  Clothes, possessions.  CONTINUE \n               Across FURNITURE, WASHBASIN, TOILET...A large room, high \n               old ceilings And windows suggesting Ancient Europe & design, \n               A haunting greenish AFTERNOON light.\n\n               We MOVE to HANDS, TIGHT - drawing out a strip of adhesive \n               tape,\n\n               SCISSORS move in TIGHT...SNIP!\n\n               UNDERARM, TIGHT.  Tape being laid over it.\n\n               BACK OF SHOULDER.  TIGHT.  Tape going on. \n\n               BELLYBUTTON, TIGHT. TAPE going Then: a harsh RIP! SOUND \n               and the tape comes off the bellybutton.\n\n               HANDS with new strip of tape. Moving to:\n\n               HASHISH PLAQUE. Four of them, thinly pressed. One on top \n               of the other. The HAND wrapping a portion of the TAPE around \n               them and:\n\n               BELLY, TIGHT. SOUNDS of BREATHING stop. The belly is sucked \n               in. The TAPE is pulled HARD across, then CLINCHED.  We \n               hear F.X. of HEART BEAT--\n\n               MOVE UP THE CHEST TO:\n\n               BILLY HAYES - 21, baby-face, attractive, medium build an \n               aura of innocence. His eyes moving off his belly to:\n\n               MIRROR.  FULL SHOT.  Climax.  A creature in a bondage of \n               his own devise, he is naked in his underpants, his body \n               criss-crossed by a network of TAPE and 40 tightly pressed \n               plaques of HASHISH in every conceivable crevice of his \n               body. The eyes are hard.\n\n               NIX THROUGH HEART BEAT, SOUNDS OF AIRPORT.\n\n                                                                    CUT:\n\n               INTERIOR\n\n               ISTANBUL AIR TERMINAL dirty, crowded, wooden benches, \n               peddlers.  Turkish flight instructions on LOUDSPEAKER, \n               followed by mediocre English translations. NOTE: ALL \n               DIALOGUE IN TURKISH TO FOLLOW WILL BE MARKED OFF BY \n               PARENTHESIS. A CERTAIN WILL BE SUBTITLED, BUT SOME NOT.\n\n                                     LOUDSPEAKER VOICE\n                         Pan American Flight 1 to Frankfurt, \n                         London, and New York has arrived \n                         and will be ready for boarding at \n                         Gate 7 in 20 minutes.\n\n               REPEAT IN ENGLISH over:\n\n               BILL walking down a long CORRIDOR. He moves somewhat stuffly \n               in the clothes we saw laid out on the bed; his face \n               complicated by dark, rather ridiculous aviator sunglasses \n               and an increasing edge of nervousness to his actions. With \n               him is:\n\n               SUSAN 23, healthy outdoor looks, dressed casually colorful \n               like an American student abroad.\n\n               APPROACHING P.O.V. - a group of TURKISH SECURITY GUARDS, \n               in rumpled green uniforms, at a security CHECKPOINT inspect \n               the carry-on bags of several PASSENGERS.\n\n               BILLY tensely contemplating the guards as he walks.\n\n               SUSAN digging in her bag for her passport as she walks.\n\n               BILLY, looking from guards ahead to SUSAN. He suddenly \n               breaks stride, still a fair distance from the \n               checkpoint. SUSAN glances at him. He is holding his belly.\n\n                                     BILLY\n                         I think I've been poisoned.\n\n                                     SUSAN\n                         And you ate two baclavas, right? I \n                         not to touch them, mine was awful.\n\n                                     BILLY\n                              (his voice strained)\n                         Look, I think I'm going to have to \n                         go to the john again.  You go on \n                         through, I'll catch up.\n\n               With a sense of panic, he turns and goes back down the \n               corridor without waiting for a response.  SUSAN concerned, \n               moves on.\n\n                                                                    CUT:\n\n               BILLY in the  WASHROOM MIRROR, again checks himself out. \n               His glasses are off, and he has just watered himself down. \n               But the SOUND of his HEARTBEAT is up, and his nerves are \n               visible in his eyeballs and he knows it.  He dabs at the \n               sweat on his sideburns.  He closes his eyes, takes a DEEP \n               BREATH.  A pause. He puts his dark sunglasses back on.  \n               Turns away from the mirror.  No going back now.\n\n               ADVANCING P.O.V. - SECURITY CHECKPOINT.  The GUARDS again.  \n               Closer, closer, Guns in their HOLSTERS. SOUND of billy's \n               heartbeat,\n\n               CLOSE - GUARD smoking a cigarette, bored, uniform, looks \n               at BILLY.\n\n                                                                    CUT:\n\n               The GUARDS again.SOUND of Billy's in a tattered olive\n\n                                     GUARD\n                         Passport!\n\n               BILLY PASSPORT. The Guard's tobacco-stained FINGERS take \n               it open it. Basic information on Billy: Birth Date April \n               17, 1949.  Birth Place: Babylon, Long Island. No wife, no \n               minors.  Signature.\n\n               GUARD gives it back to BILLY.\n\n                                     GUARD\n                         Bag! \n\n               BILLY opens his shoulder bag, proffers it. The GUARD tosses \n               it, pushing aside books, grabbing a white plastic dish.\n\n                                     GUARD\n                         Nebu? \n\n                                     BILLY\n                              (Understand the \n                              Turkish expression, \n                              \"What's this?\")\n                         It's a frisbee.\n\n                                     GUARD\n                         Nebu? \n\n                                     BILLY\n                         A Frisbee.\n                              (makes a throwing \n                              gesture of the \n                              wrist)\n                         You throw, catch it.  Game! \n\n               Curious, one of the other GUARDS ambles over looking at \n               the frisbee.\n\n               BILLY tightens. Cursing the frisbee. Sweat now runs his \n               sideburns again.  HEARTBEAT up.\n\n                                     2ND GUARD\n                         American game. Baseball.\n\n                                     GUARD\n                         Ah! \n                              (puzzled, turns the \n                              Frisbee around and \n                              around)\n\n               THE SECOND GUARD studies BILLY curious about the sweat. \n               Suddenly reaches up, indicates the eyes.\n\n                                     GUARD\n                         Take off the glasses.\n\n               BILLY understanding the gesture rather than the words, \n               removes his glasses. His eyes. Straight, staring at the \n               GUARD without trying to look away. A long moment.\n\n               FIRST GUARD stuffs the frisbee back into the bag. Scowls.  \n               Takes a puff on his cigarette, coughs. Phlegm rattles around \n               in his throat.  \n\n               Reads the International Herald Tribune, seated on a crowded \n               olive-colored out on the tarmac She has saved him a seat \n               and pulls her bag off as BILLY sits down.\n\n                                     FIRST GUARD\n                         Aaaah! \n\n               He waves BILLY through.\n\n               BILLY puts his glasses walks past the back the SECOND GUARD \n               turns away.  BILLY walks past the Checkpoint. His HEARTBEAT \n               drops.\n\n               SUSAN reads the International Herald Tribune, seated on an  \n               crowded olive-colored BUS out on the tarmac.  She has save \n               him a seat and pulls her bag off as BILLY sits down.\n\n                                     SUSAN\n                         Are you all right?\n\n               He looks at her. Relief. A smile, awkward - he wishes he \n               could tell her.\n\n                                     BILLY\n                         Yeah... Yeah. \n\n               Lays his head back on the wooden bench. Reaches out:\n\n               TAKES HER HAND in his. She returns the grip.\n\n               THE BUS DOOR slams shut.\n\n               THE TURKISH BUS DRIVER rolls the bus out towards the PLANES \n               visible in the far distance?.\n\n               SUSAN, feeling Billy is better, shows him the Herald \n               Tribune.\n\n                                     SUSAN\n                              (saddened)\n                         D'you see this?  Janis Joplin died \n                         yesterday.\n\n               BILLY, his sunglasses removed, looks at the paper, almost \n               abstractedly.\n\n                                     SUSAN (OFF)\n                         Overdose, in a Hollywood motel.\n\n               NEWSPAPER Picture of JANIS JOPLIN.  That big, earthy, rugged \n               smile.\n\n               BILLY'S P.O.V. - Moves Up page One To The Headline: NIXON \n               OUT-RAGED AT PALESTINIAN HIJACKERS: CALLS FOR CAPITAL \n               PUNISHMENT\n\n                                     SUSAN\n                              (a faint voice)\n                         Never Was anybody like Janis.\n\n               BILLY, thinking other happier things, reaches over and \n               playful!.:squeezes her tit twice, rapidly.\n\n                                     BILLY\n                              (smiles)\n                         Never was anybody like you...\n\n                                     SUSAN\n                              (annoyed, brushes \n                              his hand away ,a \n                              clicking sound in \n                              her throat)\n                         You can't take anything seriously.\n\n                                     BILLY\n                              (smiles)\n                         You're right.\n\n               Bus stops suddenly. BILLY changes expression.\n\n               THROUGH FRONT WINDSHIELD we see TURKISH SOLDIERS in several \n               HALFTRACKS drawn up in a semicircle blocking the bus. The \n               Pan American PLANE is directly behind. Also JEEPS and a \n               POLICEMAN waving the bus down.\n\n               BUS BOOR opens and the Turkish Police OFFICER hops aboard \n               briskly:\n\n                                     OFFICER\n                         Attention please, Ladies and \n                         Gentlemen. For your own safety \n                         we're conducting a security check \n                         before you board your airplane, \n                         Kindly file out the back. Women \n                         and children in one line. Men in \n                         another.\n\n               PASSENGERS.  A confused hum.\n\n                                     VARIOUS PASSENGERS\n                         What's he saying?  I don't know... \n                         Marian.  Hey Marian, what the \n                         hell...\n\n               The Turkish-speaking PASSENGERS are gathering together \n               their items and beginning to exit as:\n\n               POLICE OFFICER repeats, in ENGLISH\n\n                                     POLICE OFFICER\n                         Idem. \n\n               CLOSE BILLY. The POLICE OFFICER is only beginning the \n               speech.in English but already Billy realizes, And it's \n               panic.  Silent panic. That horrendous cold feeling all \n               over his back: Oh God what have I done, what can I do now?  \n               He freezes.\n\n               MOVE TO SUSAN rising, fetching her things, irritated.\n\n                                     SUSAN\n                         Jesus, they do everything ass \n                         backwards in Turkey.\n\n               Behind her we see the other AMERICAN PASSENGERS beginning \n               to disembark with the usual chorus of overlapped \n               conversations, expletives, including:\n\n                                     PASSENGERS\n                         They're checking for hijackers.  \n                         Any Palestinians aboard? Hey Harry, \n                         get rid of your grenades...\n\n               Laughter is returned from several of the American \n               contingent, but we MOVE BACK to BILLY in foreground; all \n               of a sudden he is on his knees trying to crawl under the \n               seat.\n\n                                     SUSAN (OFF)\n                         Billy, what's the matter?\n\n                                     BILLY\n                         My passport!\n\n                                     SUSAN\n                         No! \n\n               She bends down to look, coming FACE TO FACE with him. He \n               grips her arm.\n\n                                     BILLY\n                              (low voice)\n                         Susan - forget it. Go get us a \n                         seat on the plane. Now.\n\n                                     SUSAN\n                              (picking up the \n                              real fear in his \n                              voice)\n                         What is it? . . . Billy?\n\n                                     BILLY\n                              (a fierce whisper, \n                              panic)\n                         For Christ's sake, just GET on the \n                         plane, okay!\n\n               His tone stuns her; never before has he spoken to her like \n               that.  A LOOK between them; he has his glasses off now. \n               She's not a stupid girl by any means and realizes something \n               is very wrong and for the both of them, she'd best do \n               exactly as he says. And fast.  She moves OUT OF SHOT.\n\n               BILLY, crouched low in the aisle starts to work fast, his \n               finger: shaking reaching into his sweater starting to work \n               the TAPE loose from around his chest; looking from under \n               the bench. Still quite a bit of commotion as passengers \n               are exiting. BUT THEN:\n\n               BILLY P.O.V. - UNIFORMED LEGS coming slowly down Isle \n               Towards him. The muzzle of An M-l RIFLE tapping loosely \n               Against the side of the kneecap.\n\n               PAN WITH and MOVE UP as TURKISH MILITARY LIEUTENANT comes \n               into view, intersecting outgoing PASSENGERS, eyes casually \n               coming to rest on:\n\n               BILLY looks up from his kneeling position on floor; his \n               sweater rolled back down; he indicates the passport in his \n               hand. \"Just found it\" expression.\n\n               MOVE to the LIEUTENANT not necessarily suspecting anything, \n               but with a customary insolence reserved for young vagrant-\n               types, he stretches his rifle arms length with one hand \n               and gently prods Billy up with the tip of the muzzle placed \n               under his chin. MOVE BACK to the OFFICER, bringing the \n               rifle back to his side, indicating Billy get off the bus \n               with the others. All in silence.\n\n                                                                    CUT:\n\n               BILLY among a group of MALE PASSENGERS funnelling into two \n               lines that pass on either side of a wooden inspection table. \n               Thirty TURKISH SOLDIERS with rifles ring the area. It is \n               open, vast, no place to run or hide. The only apparent \n               hope is to melt into their regular jostling patterns of \n               the passengers impatiently waiting.\n\n               TWO PLAINCLOTHESMEN (Police) are on each side of the table, \n               body-searching the male passengers alternately.\n\n               SUSAN is in a similar set-up twenty yards away, with FEMALE \n               ATTENDANTS doing the searching. She glances at Billy as \n               she undergoes search. She is cleared, passes on, towards \n               the ramp of the plane.\n\n               BILLY, his sunglasses off, smoothly melts among the male \n               PASSENGERS pulling some books from his shoulder bag.  Glides \n               to the head of the line. MOVE TO:\n\n               The FIRST OFFICER patting down a PASSENGER, his back \n               partially turned to Billy. MOVE AROUND bringing him into \n               foreground as:\n\n               BILLY skirts him in the background, camouflaged among two \n               other conversing PASSENGERS waiting for the SECOND OFFICER \n               who now appears in foreground on the lateral TRACK; he is \n               busy with another passenger. In passing him, Billy replaces \n               the books in his shoulder bag as though he had already \n               been searched by the first officer,\n\n               Tension. FOLLOW BILLY as he approaches the boarding ramp.\n\n               BILLY P.O.V. - SUSAN at the top of the ramp waiting.  \n               Smiling STEWARDESSES. Pan America. Haven.\n\n               BILLY - FOOT rising off Turkish soil onto ramp.\n\n               TURKISH HAND lightly touching Billy's elbow, then grasping \n               the ARM.\n\n                                     TURK (OFF)\n                         Just a minute!\n\n               BILLY his eyes flattening.\n\n               SUSAN in LONG SHOT, reacting.\n\n               BILLY turns trying to seem casual; he confronts the SECOND \n               OFFICER face to face and gestures towards the:\n\n               FIRST OFFICER who happens to glance at them.\n\n                                     SECOND\n                         Nebu? Did you search him?\n\n                                     FIRST OFFICER\n                              (frowns)\n                         No!\n\n               SECOND OFFICER tightens his grip on BILLY, angry, and pulls \n               him back to the TABLE. MOVE with them. The officer has \n               been lied to; in addition he is young, inexperienced, about \n               eighteen.\n\n                                     SECOND OFFICER\n                         (grunts a command, makes a gesture)\n\n               BILLY, comprehending, spreads his arms.  The OFFICER pats \n               him down carefully, brushing against his armpits. Precisely \n               in the area where we saw the hashish. But incredibly he \n               doesn't notice, continuing to work his way down the hips \n               and legs.\n\n               CLOSE BILLY eyes on the sky behind the OFFICER, praying \n               silently for a break.\n\n               TURKISH FINGERS moving up the inside of his legs, onto his \n               belly, touching the hard bulge below the navel. But again \n               not noticing.\n\n               BILLY in limbo, SOUND of his heartbeat.\n\n               SECOND OFFICER pausing, his fingers around Billy's chest, \n               about to let it go, then:\n\n               PLACES HIS HAND suddenly flat on Billy's heart.\n\n               OFFICER, sensing the accelerated Heartbeat, stares at:\n\n               BILLY whose eyes jump, startled by this technique.\n\n               FINGERS like excited spiders quickly run back up into the \n               armpit area.  STOP - right on the packets.\n\n               TURKISH EYES SWIVEL to BILLY EYES CLOSE. Frozen moment.  \n               Then, sudden blur of movement at the edge of frame.\n\n               SECOND OFFICER jumping back, grabbing his pistol from his \n               holster, crouching on one knee, aiming the gun barrel at \n               BILLY, hand shaking. He is terrified.\n\n                                     SECOND OFFICER\n                              (screaming)\n                         Bomb!  He's got a bomb!\n\n               AMERICAN PASSENGERS scream and the deck all around.\n\n                                     AMERICAN PASSENGER\n                         Bomb!  Bomb! \n\n               BILLY stands there, arms straight up in the air, eyes \n               clamped shut, trying not to breathe. CHORUS of rifle and \n               revolver CLICKS OFF as:\n\n               PULL BACK to OVERHEAD SHOT BILLY surrounded by thirty \n               SOLDIERS with rifles pointed at him from all directions, \n               crouched nervously. The PASSENGERS all huddled on the \n               ground.\n\n               BILLY, eyes closed. Edge of frame shows a shaky muzzle a \n               REVOLVER poked into his belly, moving up.\n\n               MOVE to THE FIRST OFFICER, older, more experienced but \n               scared, poking with the revolver; reaches in with his hand \n               cautiously, starts to pull up the turtleneck sweater. MOVE \n               with the hand, revealing the HASHISH PLAQUES around the \n               navel. A pause. His HAND draws the sweater higher.  More \n               PLAQUES.\n\n               FIRST OFFICER'S FACE relaxes. Starts to smile, finding it \n               funny. \n\n                                     FIRST OFFICER\n                              (yells out)\n                         It's hashish. just a smuggler.\n\n                                     SOLDIERS (OFF)\n                              (in chorus echo, \n                              relaxing, chuckling)\n                         Hashish...smuggler...hippy... \n\n               MASTER ANGLE SOLDIERS REGROUPING. PASSENGERS starting to \n               rise from the ground.  \n\n               SUSAN dumbfounded watching all this from the door of the \n               PLANE, starts back down the ramp. But a flow of upcoming \n               PASSENGERS slows her descent.\n\n               BILLY is led roughly by TWO SOLDIERS parallel to the plane \n               his hands on his head. He manages a glance at Susan. A \n               slight but strong movement of the head and eyes. 'No. Don't \n               come down the stairs'\n\n               SUSAN understands it, looks helplessly, hesitates lost \n               between two worlds. A silent shaping of a puzzled mouth.\n\n                                     SUSAN\n                         ...Billy...?\n\n               She is washed back along in the flow of passengers.\n\n                                                                    CUT:\n\n               VIP ROOM AIRPORT LOUNGE.  The scene moves very fast, \n               Indicating A sense of chaos.  Much smoke.  Many phone calls. \n               Half A dozen Turkish police OFFICERS Are bizarrely seated \n               In A row of fold up chairs next to A desk. Chattering among \n               themselves (AD LIB) lighting their Turkish cigarettes. \n               They hardly pay attention as:\n\n               MOVE TO BILLY, scared, sweating - backlit by the huge \n               windows overlooking the airstrip. In background, we see \n               the 707 Pan American PLANE beginning to circle towards the \n               runway.  GUARDS have stripped him down to his bare chest \n               and now knife through the adhesive tape from two sides at \n               once. Then RIP the tape off.  BILLY winces.\n\n               ANOTHER ANGLE the room. Billy's luggage Is being Tossed.  \n               Clothes fly through the air. A sweatshirt; Marquette \n               University Rowing Team. A 35mm camera. A gift package for \n               his mother ripped open.  A silver Turkish kettle, clanging \n               To The floor. Another package is ripped open and a set of \n               Turkish tea cups smash and break all over the floor. Very \n               fast.\n\n               BILLY watches, bewildered. He is stripped of the last plaque \n               in of the confusion is that each time another police officer\n\n               his navel. FOLLOW the plaque clattering onto the pile of \n               forty plaques.\n\n                                     FIRSTOFFICER (OFF)\n                         Name?\n\n                                     BILLY (OFF)\n                         William Hayes.\n\n               MOVE BACK QUICKLY to the OFFICER with notebook at the desk.  \n               Part of the confusion is that each time we see another \n               police officer we see he has another face.\n\n                                     FIRST OFFICER\n                         Vi... Vilyum... Vilyum...\n\n                                     BILLY (OFF)\n                         Hayes.\n\n                                     FIRST OFFICER\n                         Hi-yes...\n                              (writes it down)\n\n               ANOTHER ANGLE --\n\n                                     FIRST OFFICER\n                         'Merican?\n\n                                     BILLY\n                              (nods)\n                         New York.\n\n               The OFFICER is puzzled.\n\n                                     BILLY\n                         New York... New York...\n\n                                     FIRST OFFICER\n                         Ahhhh...Nev Yok!\n                              (writes it down)\n\n               A LOUD SOUND OFF.\n\n               The DOOR flies open and ANOTHER OFFICER strides in.  \n               Paunchy, moustached. The room is suddenly silent as we \n               TRACK him in, followed by a grinning civilian FLUNKY with \n               a big portable photo instrument and bulb.\n\n               THE FIRST OFFICER jumps up from the desk, makes an \n               obsequious salute to the SECOND OFFICER who arrogantly \n               acknowledges it and takes the vacated chair behind the \n               desk. The FIRST OFFICER moves to the first fold-up chair \n               in the row, pushing the police officer in that chair further \n               down. THIS OFFICER, in turn, shoves the next man down. It \n               goes all the way down the line like a comedy until the \n               last man in the row stands up against the wall. But this \n               is all in the background as:\n\n                                     SECOND OFFICER\n                         Name?\n\n                                     BILLY\n                         William Hayes.\n\n                                     SECOND OFFICER\n                         Vil... Vilyum...?\n\n                                     BILLY\n                         Hayes...\n\n               Sharp SOUND OFF of FILM BEING RIPPED FROM CAMERA. He darts \n               a look at\n\n               POLICEMAN stretching the undeveloped film out.  Another \n               loud SOUND OFF, interrupting this--\n\n               THE DOOR flies open again and a THIRD OFFICER strides in, \n               obviously the most important yet, because the SECOND OFFICER \n               jumps up from the desk, and all the others immediately \n               move down one seat in the hierarchy without a moment's \n               hesitation. But the THIRD OFFICER strides right up to Billy, \n               waves to the SECOND OFFICER.  THE CAMERAMAN in background \n               bubbles with enthusiasm, sliding into position. Billy is \n               puzzled - what's going on?  His arm is grabbed and he is \n               swivelled around.\n\n               REVERSE ANGLE - OVER CAMERAMAN\n\n               BILLY in the middle, flanked by SECOND and THIRD OFFICER, \n               grinning like big game hunters, their arms on his shoulders. \n               The FIRST OFFICER, sticking a bunch of hashish plaques \n               into Billy's hands, runs OUT OF FRAME. BILLY looks from \n               side to side. The SECOND OFFICER pats him hard on the back \n               of the head, meaning 'look at camera'. BILLY glances at \n               him, sees the grin on both the officers' faces. Thinking \n               this is the necessary expression, he grins at the camera.\n\n               CAMERAMAN disgustedly looks up from his eyepiece.\n\n                                     CAMERAMAN\n                         No.. He's smiling. Make him look \n                         miserable.\n\n               SECOND OFFICER slugs BILLY in the stomach with a quick \n               back-handed fist. BILLY groans, sinks to his knees. The \n               plaques fall on the floor.\n\n                                     FIRST OFFICER\n                              (running up)\n                         Gel?  Gel??\n\n               He growls, grabbing Billy's arm and hauling him up, \n               gathering the hashish plaques and putting them back in his \n               arms. The TWO OFFICERS put their arms back on Billy's \n               shoulders. BILLY, in pain, makes the proper expression of \n               misery.\n\n               FLASH!  The bulb goes.\n\n                                                                    CUT:\n\n               THE 707 PAN AMERICAN PLANE, destination New York, roars up \n               into the sky. PULL BACK all the way to BILLY sitting next \n               to the window, huddled over, feeling woozy and near \n               vomiting.  He glimpses the plane but it is anti-climatic \n               now; as he stares down at his boots. Then remembers \n               something! Surprised.\n\n               ANOTHER ANGLE - ROOM. The Turkish OFFICERS talk AD LIB \n               among themselves, congratulating, slapping shoulders, \n               pointing to the hashish plaques, etc.  \n\n               In center background, we see BILLY submissively lifting \n               his arm for permission to speak,\n\n               THIRD OFFICER nods, approaches, followed by OTHERS.\n\n               BILLY slowly, partly out of pain, pulls off one of his \n               boots, bangs it on the heel and two more PLAQUES clatter \n               to the floor.\n\n               TURKISH MOUTHS drop open.\n\n               BILLY finishes the process with the other boot. An awkward \n               silence OFF.\n\n                                     BILLY\n                              (trying to explain, \n                              innocent)\n                         I forgot... I really did.\n                              (makes ineffective \n                              gestures)\n\n               ANOTHER ANGLE. The room explodes with screams and commotion.  \n               AD LIB:\n\n                                     THIRD OFFICER\n                              (screaming at SECOND \n                              OFFICER)\n                         You idiot, you fool. You told me \n                         the American was searched... and \n                         he's pulling hashish out of his \n                         boots!  You're all dogshit!\n\n                                     SECOND OFFICER\n                              (turning on First \n                              Officer, screaming)\n                         You worthless piece of garbage, \n                         where did you learn to search a \n                         prisoner?  He's been in our custody \n                         for an hour, etc.\n\n                                     FIRST OFFICER\n                              (screaming at the \n                              others)\n                         Who searched him?  Who?\n\n               Amid all the screaming TWO POLICEMEN rush over and yank \n               BILLY upwards, and start to strip all his clothes.\n\n                                     BILLY\n                              (protesting)\n                         That's it! That's all I have!\n\n                                                                    CUT:\n\n               BILLY spread-eagled STARK NAKED against the wall. He is \n               afraid to move. A strange silence.\n\n               ANOTHER ANGLE. BILLY naked in center B.G. against the \n               wall.The OFFICERS and SOLDIERS quietly leering at his trim, \n               muscular buttocks. Hungry stares.  Bisexuality is prevalent \n               in Turkey.But there is also embarrassment among the \n               officers; none would do anything openly in front of the \n               others; instead they just stare and smoke their cigarettes.  \n               Low murmurs. Continued telephone calls. Much thick smoke \n               all over the room.\n\n               Another DOOR opens OFF. Obsequious GREETINGS in Turkish.\n\n               BILLY is afraid to look over his shoulder, feeling \n               enormously humiliated.\n\n                                     VOICE (OFF)\n                         Howdy, Billy. Howya doing, Ok?\n\n               A perfect Texas drawl. BILLY glances over his shoulder. \n               Sees:\n\n               TEX a tall, lanky blonde-haired American in a business \n               suit with boots. Clean cut, very handsome, with a strong \n               flavour of danger in his blue eyes.\n\n                                     TEX\n                              (smiling, extends \n                              Billy's clothes)\n                         I think these gentlemen have \n                         finished for the time being if \n                         you'd like to put your clothes on.\n\n               ANOTHER ANGLE - BILLY, so grateful at last to see a fellow \n               American, reaches quietly for the clothes, his eyes never \n               leaving Tex. Release?\n\n                                                                    CUT:\n\n               TURKISH DETECTIVE sits at the main desk in the room.  Unlike \n               the others, he has no moustache; a skeletal face, \n               intelligent looking.  TEX Is behind, leaning casually up \n               against the wall. Angled to Billy's side is the entire \n               array of seated OFFICERS looking on like a tribunal.\n\n                                     DETECTIVE\n                              (thickly accented \n                              English, sympathetic)\n                         Are you afraid, Vilyum?\n\n               BILLY, standing to the side of the desk, clothed now, \n               buckling his belt - afraid.\n\n                                     BILLY\n                         No, I'm not afraid.\n\n                                     DETECTIVE\n                         Good. There's nothing to be afraid \n                         of. If you co-operate with us, you \n                         will be on the plane for New York \n                         tomorrow... yes?\n\n                                     BILLY\n                              (softly, hoping)\n                         Yes...?\n\n                                     DETECTIVE\n                         Good. Now, where did you get the \n                         hashish?\n\n                                     BILLY\n                         A cabdriver. He picked me up in \n                         the Pudding Shoppe in the bazaar.\n\n                                     DETECTIVE\n                         Would you recognize him again?\n\n                                     BILLY\n                         Yes.  I think so.\n\n                                     DETECTIVE\n                         Good.  Would you go back to the \n                         Pudding Shoppe now and point him \n                         out to my men if you see him?\n\n               BILLY'S EYES MOVE TO: \n\n               TEX who makes a cool affirmative nod of the eyes to Billy.\n\n                                     BILLY (OFF)\n                         Yes.\n\n               STREETS, ISTANBUL, AFTERNOON. TEX drives his American CAR; \n               BILLY in the passenger seat; TWO TURKISH PLAINCLOTHESMEN \n               in the rear seats . Various BACKGROUND SHOTS of the city.\n\n                                     TEX\n                              (casual tone)\n                         You decided to fly at a bad time \n                         Billy Palestinian Guerrillas all \n                         over the place blowing up planes \n                         and all.\n\n                                     BILLY\n                              (shakes his head)\n                         Stupid.\n\n                                     TEX\n                         Four planes in four days...but I \n                         guess you kids don't read the \n                         newspapers...and what with our \n                         people kicking up a shit storm \n                         'bout the flow of heroin from Turkey \n                         you got...\n\n                                     BILLY\n                         But didn't have heroin.\n\n                                     TURK\n                              (grins)\n                         Well I'm not up on all that. A \n                         drug's a drug seems to me Billy \n                         and...\n\n                                     BILLY\n                              (sweating)\n                         But it was my first time. I'm not \n                         really a smuggler, was just two \n                         kilos.\n\n                                     TEX\n                         Well, you see Billy, it don't really \n                         matter right now if it's 2 kilos \n                         or 200 kilos. The Turks love to \n                         catch any foreigner smuggling - it \n                         shows the world they're fighting \n                         the drug trade.\n\n                                     BILLY\n                         But just...\n\n                                     TEX\n                         Just what?\n\n                                     BILLY\n                         I just needed some extra money.  I \n                         was broke, the guy offered me the \n                         hash and...\n\n               It sounds bad. Tex looks at him without expression. \n               Pause.Billy tries to sense a sympathy in this ambiguous \n               man, a liking towards himself. But feels nothing yet, except \n               someone who can speak English.\n\n                                     BILLY\n                         ...are you with the Consulate?\n\n                                     TEX\n                              (not looking at him)\n                         Something like that. Cigarette?\n\n               ANOTHER ANGLE - BILLY nervously takes the pack and matches.\n\n                                     TEX\n                         How much you pay this joker... \n                         this cab driver?\n\n                                     BILLY\n                         Two hundred dollars. It was my \n                         last two hundred.\n\n                                     TEX\n                         How much did you figure to make?\n\n               BILLY fumbles to light up his cigarette. He is nervous, \n               grateful to volunteer any information...anything.\n\n                                     BILLY\n                         Three, four thousand...I don't \n                         know.  The guy offered me the hash--\n                              (shakes his head)\n                         ...it just seemed like easy money.\n\n                                     TEX\n                         Beats working.\n\n                                     BILLY\n                         I was just going to sell it to \n                         friends.  I'm not a pusher, honest.\n\n               TEX grins, sceptical of his naivete, changing the subject.\n\n                                     TEX\n                         Got a family back there?\n\n                                     BILLY\n                              (inhales deeply)\n                         Yeah. Parents, brother, sister.  \n                         Babylon, Long Island.\n\n                                     TEX\n                         What's your father do?\n\n                                     BILLY\n                         He sells insurance for Metropolitan \n                         Life.\n\n                                     TEX\n                              (a pause, not looking \n                              at Billy)\n                         Be tough on 'em.\n\n               BILLY nods, takes a deep drag on his cigarette.\n\n               ANOTHER ANGLE\n\n                                     TEX\n                         Girlfriend?\n\n                                     BILLY\n                         ...She was on the plane.\n\n               Tex glances at him, questioningly.\n\n                                     BILLY\n                         She didn't know anything about...I \n                         wouldn't have wanted her to.\n\n                                     TEX\n                         Lucky girl.\n\n               Billy leans back in seat, blowing out the cigarette smoke.\n\n                                     BILLY\n                         Jeez, she used to say I was the \n                         lucky one.\n\n                                     TEX\n                         Let's hope so, Billy.  Let's sure \n                         hope so.\n\n               A narrow cobblestone STREET.  TEX pulls the car to a halt.\n\n                                                                    CUT:\n\n               THE PUDDING SHOPPE TWILIGHT Internationally-known cafe, \n               adjacent BAZAAR. Crowded, noisy. WOMEN dressed in black \n               hold crying CHILDREN by the hands. FOREIGNERS, mostly \n               students and hippies, move about laughing, joking. Hawkers, \n               street peddlers, vendors cooking shishkebab.  small GYPSY \n               BOY leads a huge MUZZLED BEAR on a leash.\n\n               BILLY sits at a small outdoor TABLE alone sipping tea and \n               eating baclava - nervous, very nervous, still trying to \n               sort it all out in his head. If he doesn't find the seller, \n               what will happen next?  \n\n               MOVE across the TABLES, past a middle-aged AMERICAN COUPLE, \n               to TWO TURKISH PLAINCLOTHESMEN watching him closely. They \n               look evident. TWO HIPPIES make a wide berth around them.\n\n                                     HIPPIES (OFF)\n                              (in passing, low)\n                         Hey Janet, why don't you go sell \n                         'em some dope.\n\n               MOVE ON to another TABLE where TWO MORE PLAINCLOTHESMEN \n               sit, equally evident, watching BILLY.\n\n               TEX sits in his car, in the distance, casually glancing at \n               a newspaper.\n\n               BILLY's eyes rove.\n\n               INTERIOR PUDDING SHOPPE Large. Many tables. Stairs. A back \n               exit.\n\n               ANOTHER GYPSY BOY leads a huge PINK PIG leashed with a \n               wooden sign around its neck proclaiming \"Pig\" in Turkish. \n               Various TURKS point the pig out, laughing at it, some \n               disgusted by it, making faces and gestures: \"Go way, go \n               way!  \"Ayip!\"  The PIG moves past BILLY, who shifts his \n               gaze to:\n\n               POV - CABDRIVER #1 lingering at the curb. PAN to CABDRIVER \n               #2  PAN to CABDRIVER #3. PAN BACK to #1 and again to #2 \n               indicating no real fix on identity.\n\n               BILLY tense now, knowing this is the chance he must take, \n               nods with his head, pointing at CABDRIVER #2, off.\n\n               THE PLAINCLOTHESMEN move out towards CABDRIVER #2.\n\n               BILLY tentatively rises, as if to join them, but moves \n               slyly towards the interior of the cafe.\n\n               PLAINCLOTHESMEN move in roughly on a surprised CABDRIVER \n               #2 who begins to protest LOUDLY (AD LIB).\n\n               BILLY moves through the INTERIOR of the PUDDING SHOPPE, \n               past the tables, past the stairs, towards the back of the \n               shop, at a normal.to attract attention.  \n\n               A PLAINCLOTHESMAN looks around, sees he is gone. Tells the \n               others (AD LIB) They spread out looking, abandoning the \n               CABDRIVER #2 who spits and curses them (AD LIB).  \n\n               BILLY, with one backward glance, now eases out the BACK \n               DOOR, into a bilious sunlight, onto a STREET. Pause.\n\n               A HAND with GUN moves into FRAME pointing a six-inch barrel \n               right at his temple.  BILLY freezes, moving just his eyes \n               to:\n\n               TEX looking down at him calm, merciless.\n\n                                     TEX\n                         You seem like a nice enough kid to \n                         me Billy, but try it and I'll blow \n                         your fucking brains out.\n\n               BILLY - the sense of betrayal in his eyes.\n\n               ESTABLISH PRISON - OVERHEAD ANGLE. A large and Byzantine \n               structure suggesting the 15th Century Sultan's Janissary \n               Barracks. Irregular crescent various wings; a MOSQUE inside \n               the prison. The possibly a shapes to the sense of an endless \n               a decorative an equally in a city, labyrinth built by some \n               mad Arab architect to suit purpose and now, in the 20th \n               Century, transformed by mad Turkish bureaucracy into a \n               prison. It should be preferably made to look like Istanbul.\n\n               Faint background atonal Turkish CHANTING. Evening Muslim \n               prayer.\"Allah wakbah, Allah wakbah...\" on and on, suggesting \n               to us fear rather than praise.\n\n                                     BILLY VOICE\n                         Dear Mom and Dad. This is the \n                         hardest letter I've ever had to \n                         write. know the confusion and the \n                         pain it will cause you.  And the \n                         disappointment...\n\n               BILLY - his scalp being shaved off by a prison BARBER in \n               an un-specified ANTI-CHAMBER, His eyes are staring dead \n               ahead.\n\n                                     BILLY VOICE\n                              (continuous)\n                         I really thought knew what I was \n                         doing with my life. I'd hoped \n                         somehow to get out of this quickly \n                         so that you'd never know about it. \n                         But that just isn't possible now. \n                         I don't know what's going to happen.  \n                         But what can I say to you?  Will \n                         'I'm sorry' make a difference?  \n                         Will it ease the pain, the shame \n                         you must be feeling?  Forgive \n                         me...Please...\n\n               BILLY is now completely BALD, SOUND SHARP OVER:\n\n                                                                    CUT:\n\n               A CELL DOOR SLIDING OPEN. BILLY steps in, bewildered.\n\n                                     ZIAT VOICE (OFF)\n                         Git!\n\n               The cell is dark, almost black, an overpowering stench; a \n               small grey metal bunk is bolted to the floor with a lumpy \n               mattress. BILLY turns, looking back at the man staring at \n               him from the door.\n\n               ZIAT is quickly summing up Billy's character. This is his \n               craft.He is a prisoner and trustee. sinister man whose one \n               motivation in life is the accumulation of money, in the \n               pursuit of which he has acquired an ugly purplish SCAR \n               running the width of his throat, various other facial SCARS; \n               and one blind milky white EYE. He's stocky and strong --\n               about five ten, with bushy eyebrows, brown cigarette teeth, \n               big dirty nails, repulsively in need of a bath. What's \n               surprising is that he is no more than thirty years old \n               looks and behaves like sixty. The personification of the \n               denaturalization of a man. Time, body, mind - all of them \n               warped.\n\n               BILLY, not yet attuned to his nature, only repulsed, is \n               still wearing his own clothes and makes a shivering gesture, \n               enunciating very clearly, hoping he will understand.\n\n                                     BILLY\n                         Cold. Very cold. Can I get blanket?  \n                         Blanket?\n                              (makes a gesture of \n                              a blanket wrapped \n                              around him)\n\n               ZIAT smiles, showing his stained teeth, and starts to slide \n               shut the cell door on its ROLLER.\n\n                                     ZIAT\n                              (in English)\n                         Mo sell...Too late.  Tomorrow...\n\n               A cobra smile flashes, as the cell door bangs shut.\n\n                                     ZIAT\n                              (through the bars)\n                         You be here tomorrow.  \"Ayi \n                         Gedjaler\"(\"good night\")\n\n               Goes.\n\n               BILLY walks around the cell, hugging himself for warmth.\n\n                                     VOICE (OFF)\n                         Pssst!\n\n               BILLY stops, goes to the edge of the cell.\n\n               A BONY BARE ARM motions from the bars of the cell next to \n               his.  We never see the face but hear a thick ITALIAN ACCENT, \n               hoarse and cracked.\n\n                                     VOICE (OFF)\n                         (Whispering) \n                         Your cell, no key.  Open...!  \n                         Blanket. Three cell down. You get \n                         me one. Take...\n\n               Extends a stick with a big nail pounded into the end, \n               twisted over to form a hook.\n\n               BILLY takes it. Hesitates.\n\n                                     VOICE (OFF)\n                         Ziat go for night.  Go!\n\n               BILLY cautiously slides the cell door open, amazed that \n               it's been left open.  Nothing makes any sense to him in \n               this labyrinth\n\n               ANOTHER ANGLE - BILLY steps out into a WALKWAY. A bare \n               bulb overhead casts light. He glides past the three cells, \n               seemingly empty.  Finds the cell with blankets, sheets, \n               towels and various supplies stacked inside.  But it's \n               locked.  He slips the stick in between the bars and \n               stretching, hooks the first blanket.\n\n               BILLY asleep with the blankets pulled up to his chin.  \n               Suddenly DIRTY HANDS reach into frame and rip the blanket \n               off. WIDEN TO:\n\n                                     ZIAT\n                              (tugging the sheet, \n                              growls)\n                         Brack!...Brack! \n\n               Then SLAPS at BILLY. BILLY ducks away. Encouraged, ZIAT \n               steps up closer to him, sticks his fingers in his chest \n               screaming.\n\n                                     ZIAT\n                         You, goddamn you, give me sheet.  \n                         Give me! \n\n               And feints as if to hit BILLY again. BILLY reacts to defend \n               himself, pushing ZIAT off and jumping out of the bunk.  \n\n               ZIAT, Enraged by the shove, comes back at BILLY, screaming, \n               arms flailing like a bear to pummel him, but BILLY, not \n               understanding the Turkish bluster in his mannerisms, meets \n               him with a sharp right FIST into the front of his face.  \n\n               ZIAT staggers back, startled into silence; he has misjudged \n               this kid.\n\n               BILLY waits, ready for the fight in the defensive position. \n               The guy is bigger than himself.  ZIAT, however, now feels \n               the blood from his mouth and nose and freaks out, running \n               out of the cell SCREAMING at the top of his lungs as if \n               he's dying.\n\n                                                                    CUT:\n\n               BILLY is blindfolded, stumbling down stone steps pushed by \n               a GUARD, into a dungeon-like basement room. THE PUNISHMENT \n               CELLS.\n\n                                                                    CUT:\n\n               THE GUARD removes the blindfold. BILLY, adjusting to the \n               light, stares around. The cell is spartan, with a series \n               of pulleys and primitive bondage devices hanging from the \n               cobwebbed ceiling.A DOOR opens and:\n\n               HAMIDOU STEPS in, lowering his head to get through the \n               door.Chief of the guards. A clean uniform.  Four stripes. \n               The only guard to carry a holstered gun. very frightening \n               man. He is about six two, two forty, and muscular, and \n               moves lightly like a fighter on his feet.  His skull is \n               bullet-shaped and completely shaven like Billy's, Enhancing \n               this effect, he has no eyebrows, and his pale blue eyes \n               (suggesting a trace of Indo-European stock in his ancestry) \n               are set deep in his skull somewhat like turtle eyes, giving \n               nothing away. His nose is a beak of skin his neck broad, \n               his mouth a small crescent that moves as lightly as his \n               feet between anger and amusement. He approaches BILLY, \n               looks into his eyes, drawing out the moment for himself, \n               enjoying the tension and the fear he instils in others.\n\n               BILLY meets his eyes respectfully, then realizing this is \n               perhaps not the thing do to, looks away. But, fascinated \n               by the man's features beyond his self-control, he looks \n               back.  \n\n               HAMIDOU, amused by eye actions, smiles thinly. The sort of \n               smile that could imply friendship such is its hint of charm.\n\n                                     HAMIDOU\n                              (to one of the guards)\n                         Name?\n\n                                     GUARD\n                              (checking a clipboard)\n                         Vilyum Hi-yes\n\n                                     HAMIDOU\n                              (looking at BILLY, \n                              repeating it)\n                         Vilyum Hi-yes...   \n\n               And slowly his hand moves up to caress the edge of his \n               hairless upper lip. An erotic gesture in Turkey.\n\n                                     HAMIDOU\n                         Vilyum Hi-yes\n\n               \"Its in my memory locked.\"  He slowly extends his right \n               arm stiff out to his side.\n\n               BILLY watches, fascinated.\n\n               HAMIDOU lets the arm linger; then:\n\n               SMASHES BILLY across the face with an open palm. BILLY \n               shoots back: and smashes against the wall just from the \n               force of one blow.  Stunned.\n\n               HAMIDOU advances, taking a wooden CLUB (FALUKA STICK) about \n               feet three long and three inches wide from a GUARD.\n\n               BILLY scared, emphasizing the words, trying to make himself \n               understood.\n\n                                     BILLY\n                         It was cold. Cold! I get blanket.  \n                         Blanket! Cold!\n\n               THWACK!\n\n               BILLY'S LEG BUCKLES, where the faluka stick has just smashed \n               him behind the kneecap. He SCREAMS going down.\n\n               BILLY looks up from the floor:\n\n               HAMIDOU with his club in hand.\n\n                                     HAMIDOU\n                              (In some sort of \n                              English, smiles)\n                         No do. No do.\n\n               Raises the club.\n\n               BILLY tries to block it with his hand, and the CLUB smashes \n               his thumb.  SCREAM.\n\n                                                              SHARP CUT:\n\n               BILLY is hoisted upside-down in his UNDERPANTS ONLY with \n               thick rope tied about his ankles, the legs spread - onto a \n               PULLEY suspended from the ceiling. He is yanked upwards, \n               then lowered slightly, his head and backs of shoulders \n               banging against the stone floor.\n\n               THE PULLEY is LOCKED into place.  (LOUD SOUND)\n\n               BILLY has this surprised look on his face still, through \n               the tears.  What's happening? \n                \n\n               Hamidou motions the GUARDS out of the room (AD LIB).  Turns \n               back to BILLY, raises his club.\n\n               BRINGS IT DOWN FORCE on the soles of BILLY'S BARE FEET.  \n               SCREAM.  He cocks the club again.\n\n               BILLY twists To avoid The blow\n\n               CLUB catches him On The ANKLEBONE\n\n               BILLY SCREAMs louder than ever as we hear The SOUND of \n               wood On bone.  Whimpering SOUNDS follow.\n\n               BILLY looking through teary eyes, sure now that he is going \n               to be killed. The CLUB - OFF - smacks sole skin with the \n               same force as the first blow. No let up.\n\n                                                                    CUT:\n\n               BILLY still in the same position, vomits all over himself.\n\n               HAMIDOU SPINS the PULLEY to a new position bringing:\n\n               BILLY into a steeper, more vertical position.  He is on \n               the verge of fainting, bleary-eyed, looking as:\n\n               HAMIDOU moves around in between his legs. Doing something \n               indistinct with the stick between his legs, then dropping \n               the stick. Then, with this bizarrely excited expression on \n               his hairless face, he begins to undo his own pants. But, \n               for Billy, it all BLURS OUT TO:\n\n               JAPANESE SILK SCREEN depicting a fat jovial Buddhist monk, \n               fishing placidly by a stream. Then moves to soap carvings \n               of chess pieces Then a bed-sheet hung as a curtain with \n               astrological symbols paint; on it.  SOUND OFF, of a blaring \n               radio.  Atonal TURKISH MUSIC.\n\n                                     VOICE\n                              (close, intense)\n                         Hey man, he's gotta walk, or his \n                         feet gonna swell up worse.\n\n                                     2ND VOICE\n                              (softer, sonorous, \n                              Swedish accent)\n                         We take him down to courtyard...\n\n               Then: ERICH - a gentle long bird's face. Long whitish-blond-\n               hair, Swedish, well above six feet, 25.\n\n               Another FACE moves into view JIMMY BELL, American, 23 fiery \n               eyes, black hair and moustache, intense, strong.\n\n                                     BELL\n                         Smoke this rocket, it'll cool the \n                         pain.\n\n               ANOTHER ANGLE - BELL puts a huge cone-shaped JOINT with \n               aluminium foil filter into BILLY'S LIPS. He hardly knows \n               what it is, Puffing weakly. Though dehydrated and his face \n               white without color, he has no facial markings.\n\n                                     BELL\n                         You gotta walk around some man, or \n                         your feet gonna swell up something \n                         bad...\n\n               BILLY looks down at \n\n               HIS FEET Bloated black and blue with inflamed red points \n               in various spots. A vicious bruise on his anklebone. ERICH \n               is running a cold rag from a basin of water over them, his \n               fingers tender.\n\n                                     BELL (OVER)\n                         You've been out for days man, \n                         talking all kinds of shit. Come \n                         on, we'll walk you down to the \n                         courtyard.\n\n               BELL eases BILLY up from the bed, as ERICH puts a pair of \n               clip-clops on his feet.\n\n                                     ERICH\n                         Okay?\n\n               BILLY nods. They rise together, bracing his shoulder.  \n               BILLY adjusting to the sensation of standing.\n\n                                     ERICH\n                         How's it feel?\n\n                                     BILLY\n                              (dizzy)\n                         About as good as it looks.\n\n                                     BELL\n                         Getchmis olsun\n\n                                     BILLY\n                         Getchmis...? \n\n                                     BELL\n                         Olsun - \"May it pass quickly.\" I'm \n                         Bell, Jimmy Bell. This is Erich \n                         something Swedish.\n\n                                     ERICH\n                              (smiling)\n                         Just Erich.\n\n                                     BILLY\n                         I'm Billy Hayes... At least I used \n                         to be.\n\n               Looks around.\n\n               A DORMITORY TYPE ROOM with 24 bunk beds set head to head \n               in horizontal fashion, cramped and with minimal privacy. A \n               narrow WALKWAY leading towards a TOILET AREA and STAIRCASE.\n\n                                     BILLY\n                         Looks like a cheap hotel.\n\n                                     BELL\n                         Yeah... Only the room service is \n                         lousy.  Come on, let me show you \n                         the tennis courts.\n\n               Helps him with ERICH to take the first steps.\n\n               THE COURTYARD. The THREE of them emerge in a thin AFTERNOON \n               sun, Billy now disengaging and hobbling on his own power.\n\n                                     ERICH\n                              (watching Billy \n                              limp)\n                         Feeling all right?\n\n                                     BILLY\n                              (still groggy)\n                         Yeah.  That guy who beat me?\n                              (stops, slightly \n                              puzzled)\n                         I feel stoned.\n\n                                     BELL\n                              (grins, interjects)\n                         'Figgers.\n\n                                     BILLY\n                              (vague, going on)\n                         ...He had a bald skull and...\n\n                                     BELL\n                         Hamidou.  Chief of the Guards.  \n                         Don't fuck with him. He almost \n                         killed an Italian dude couple months \n                         ago.  Bad news. He try anything \n                         with you?\n\n               BILLY glances at him, understanding. Pause.\n\n                                     BILLY\n                         No... I don't remember.\n\n               Glances at ERICH.\n\n                                     BELL\n                         With these fucking Turks, soon as \n                         the light goes out... I keep one \n                         hand on their feet and their feet \n                         better not grow.  You'll meet Max. \n                         He got raped something bad down in \n                         Section 13. That's the pits.\n\n               THE COURTYARD\n\n               VARIOUS ANGLES The yard is 30 by 50 paces with a wall 20 \n               feet high. Cigarette butts, orange peels crumpled news-\n               papers, rocks, sticks, broken glass litter the place.  No \n               guards are on the walls; the only GUARDS are unarmed \n               inanimate lumps of boredom who look as helpless as the \n               prisoners with whom they intermingle; they have raggedy \n               olive green uniforms and worn boots (they make $1 a month, \n               augmented by bribes).  On one side of the yard is a 2-story \n               ROGUS (cellblock) with barred windows from which Billy and \n               his two companions have just emerged.  On the other side \n               of the yard is another 2-story KOGUS (the children's kogus).\n\n               The COURTYARD is colorful, almost like a bazaar, about 8O \n               people in it - groups of exotically dressed AFRICANS, \n               AFGHANS, ARABS, MALAYSIANS, EUROPEANS, and predominantly \n               TURKS pacing back and forth talking in little circles, \n               hawking wares, trading illegal currencies.\n\n               Screaming Turkish STREET URCHINS 10-14 years old, share \n               the space playing soccer and volleyball with a surprising \n               viciousness, continually hitting each other and cursing. A \n               bunch of them vehemently lay bets on the soccer game.\n\n               Other aspects of the prison which should become evident: \n               1) NOISE - continuous, Loud. Radios, Turkish music, \n               screaming, shouting.  2) CATS - all kinds, some of them \n               pets, some stray, tolerated because they kill the rats. 3) \n               THE PRISONERS all wear their own clothing; the foreigners \n               preferring jeans, clip-clops, sneakers, Sweat suits. 4) \n               THE HEADS of only the new prisoners are shaved, then allowed \n               to grow back. 5) MANY PRISONERS have physical disabilities. \n               Carbuncles on the back from wet mattresses. Boils on the \n               lymph glands around the neck, buttocks, under-arms, \n               sometimes SO painful the victim walks with his arms up in \n               the air.  Arthritic in the knees, hips, ankles. Fungus on \n               the feet.  Many limp.\n\n               ANOTHER ANGLE - THE PRISONERS glance at BILLY as he walks, \n               noting the beating he has taken and sizing him up, then \n               going on with their business.\n\n                                     BILLY\n                         The kids? Why are they...\n\n                                     BELL\n                              (snorts)\n                         Little fuckers are thieves, rapists, \n                         pickpockets, murderers, you name \n                         it - they do it. Don't trust any \n                         of 'em...\n\n               BELL's eyes follow a knot of KIDS to:\n\n               ZIAT has a window open on the FIRST FLOOR KOGUS and is \n               selling little cups of tea to the kids from inside where \n               he works a GAS STOVE. The kids push and punch each other \n               to get the tea faster.\n\n                                     BELL (OVER)\n                         ...They tell Ziat everything. He's \n                         the squeal round here. Goes all \n                         over the prison.  Sells watered-\n                         down tea, blankets, hash, black \n                         money, nembutols --anything for a \n                         buck...\n\n               ZIAT leaves the stove in the hands of an ASSISTANT and \n               moves down the window to a particularly gaudy AFGHANI a \n               fierce hawk-faced old man with a chunk of his ear missing. \n               He wears a colorful flowing robe, various scarves, turban, \n               trinkets, rings, baggy pants, and pointed curved shoes, \n               and makes emphatic violent gestures at ZIAT with his \n               mutilated THREE FINGERS.  ZIAT Seems to speak something of \n               his language and bargains back.\n\n                                     BELL\n                              (continuous)\n                         He was an informer on the outside \n                         but he tried to screw the cops out \n                         of 60 kilos of opium. Watch him, \n                         he's a fox.\n\n               BILLY says nothing to them about the Ziat incident, sizing \n               him up for himself.\n\n               THE AFGHANI having concluded the deal with ZIAT reaches \n               deep into his layers of clothing around his crotch and \n               pulls out several scrofulous $10 bills which discreetly \n               takes in exchange for a thick wad of Turkish currency, his \n               eyes moving around, stopping on BILLY. A hooded look.\n\n                                     BELL (OVER)\n                         Whatcha' in for, smuggling? Rash?\n\n               BILLY turning his eyes away from ZIAT \n\n                                     BILLY\n                         Yeah.\n\n                                     BELL\n                              (shaking his head)\n                         History, man, history. How much?\n\n                                     BILLY\n                         Two kilos.\n\n                                     BELL\n                         Where?\n\n                                     BILLY\n                         The airport. Trying to get on the \n                         plane for the States.\n\n                                     BELL\n                              (whistling a kind \n                              of punctuation)\n                         Could be ten or fifteen.  Maybe \n                         even twenty.\n\n                                     BILLY\n                              (tensing)\n                         Twenty months?\n\n                                     BELL\n                         Twenty fucking YEARS, man - YEARS!  \n                         I figger ten at the least.\n\n               BILLY stunned.\n\n                                     BILLY\n                              (soft)\n                         Years?\n\n                                     BELL\n                         Yeah, what do you think this is, \n                         the good USA? This is Turkey, man...\n                              (laughs bitterly))\n                         It's a fucking accident here if \n                         you're innocent. And anyway... \n                         ...ain't nobody who's innocent.\n\n               ANOTHER ANGLE - all the color and breath seems to have \n               gone from BILLY.\n\n                                     ERICH\n                              (his English is \n                              halting but has a \n                              calming effect)\n                         Don't pay too much attention, \n                         anything is possible in Turkey. \n                         You might get bail.\n\n               BELL snorts, amused, kicking the SOCCER BALL away hard as \n               it dribbles towards them.\n\n                                     ERICH\n                         ...If you make bail, you're free. \n                         You can get a fake passport or \n                         sneak across the border to Greece. \n                         The Greeks hate the Turks so much \n                         they never send you back. The Turks \n                         know it. They just keep the bail. \n                         money.\n\n                                     BELL\n                         Sure, keep dreaming and see where \n                         that gets you... like Max, up in \n                         the head, you know...\n                              (makes a crazy signal \n                              towards the head)\n                         You gonna eat a lot more fasoulia \n                         beans, Billy baby, 'fore you taste \n                         a hamburger 'gain cause you broke \n                         the law man, and you got caught...\n                              (grins)\n                         And that... is history.\n\n                                     ERICH\n                         The law is sometimes wrong.\n\n                                     BELL\n                              (eyes feverish)\n                         The Law is never wrong, asshole.  \n                         The Law is!\n\n               And stalks away, disgusted. A deep anger inside him.  ERICH \n               looks at BILLY who is quiet; by way of apology.\n\n                                     ERICH\n                         New people sometimes get on his \n                         nerves.\n\n                                     BILLY\n                              (lifeless)\n                         What did he do? \n                         \n\n                                     ERIC\n                         He was caught steeling from a \n                         Mosque.  That's heavy here.  He \n                         got 30 years. \n\n                                     BILLY\n                         Thirty years?\n\n                                     ERICH\n                         Jimmy has more balls than brains. \n                         He didn't tell his parents he was \n                         in jail for a year and a half.  He \n                         says he got himself in and now \n                         he's going to get himself out.\n\n               He shakes his head, looking at:\n\n               BELL him across the courtyard huddling with a cigarette, \n               bartering angrily. a raggedy GUARD giving him a cigarette, \n               bartering angrily.\n\n               BILLY and ERICH.\n\n                                     BILLY\n                         And you?\n\n                                     ERICH\n                         Hashish.  Ninety percent of the \n                         foreigners are in for hashish.\n\n               They walk. \n\n                                     BILLY\n                         What they give you?\n\n                                     ERICH\n                              (passive)\n                         Twelve years.\n\n               Billy stops. \n\n                                     BILLY\n                         How much did you have?\n\n                                     ERICH\n                         A hundred grams.\n\n                                     BILLY\n                              (appalled)\n                         It's not fair!\n\n               Even ERICH has to smile now.\n\n                                     ERICH\n                         There is no fair in Turkey, Billy.  \n                         It's all \"sula-bula\" like this, \n                         like that. An Italian hippie had a \n                         car accident and a Turk was killed. \n                         SO, they threw him in here for six \n                         months...\n\n                                     BILLY\n                         That doesn't seem so bad.\n\n                                     ERICH\n                         But he was eating lunch a mile \n                         away when the Turk smashed into \n                         killed himself.\n\n                                     BILLY\n                         He wasn't even in the car?\n\n                                     ERICH\n                              (shakes his head)\n                         Aslan, there...\n                              (points)\n\n               ASLAN - a young big fat heavily moustached Turk, wearing a \n               black silk double-breasted business suit, grotesque cuff-\n               links, heavily pomaded hair, is huddling in a section of \n               the YARD with FIVE other grinning GANGSTER TYPES, all in \n               suits.\n\n                                     ERICH (OVER)\n                         Killed a guy. But his father's a \n                         big gangster on the docks.  A \n                         \"Kapidiye.\"  He'll stay in... twelve \n                         months no more, and get parole. In \n                         Turkey, murder is manly - \"erkek\".\n\n               ERICH Glances back at BILLY\n\n                                     ERICH\n                         You just got to get yourself a \n                         good lawyer.  And some money... \n                         Talk to Max.  He's been in the \n                         longest.\n\n                                     BILLY\n                         How long?\n\n                                     ERICH\n                         Seven years...\n\n                                                                    CUT:\n\n               MAX - \"Eskilet\" (skeleton). British, tall, straggly long \n               hair with wire spectacles set crookedly over his nose. An \n               earing in one ear. The far away eyes of an international \n               junkie, preoccupied and uninterested in small talk. Tough \n               in his skinny way, like apiece of old dried leather.\n\n               He occupies with his YOUNG STRIPED CAT a bunk in the far \n               corner of the SECOND FLOOR KOGUS - in the process of \n               shooting himself up with \"Gastro\" a smelly brown liquid \n               stomach medicine.  No one is in the vicinity except\n\n               ANOTHER ANGLE\n\n               ERICH and BILLY who watches repelled as MAX fumbles with a \n               piece of twine tied around his arm in a tourniquet, \n               searching for an unused spot amid dirty infected track \n               marks. PLUNGES the needle in, pumping in the black gunk. \n               Glances at BILLY.\n\n                                     MAX\n                              (smiles)\n                         Gastro.  Stomach medicine. Has \n                         codeine in it... Best can do\n\n               Pulls out the needle, loosens the tourniquet. His eyes \n               take on a far away stare.\n\n                                     ERICH\n                         Lawyers?\n\n                                     MAX\n                         Yeah... there's no straight lawyers \n                         in Turkey... They're all bent bent \n                         as hairpins...\n\n               Gives a spoon with a taste of the black residue to:\n\n               HIS CAT who is full of spunk, and tries to catch Max's \n               HAND.\n\n               He looks at BILLY, not remembering him.\n\n                                     ERICH\n                         His name?\n\n                                     MAX\n                         Who? \n\n                                     ERICH\n                         The lawyer?\n\n               MAX is beginning to go. He sits on his bunk.\n\n                                     MAX\n                         What lawyer?\n\n                                     ERICH\n                         Who got the Frenchman out?\n\n                                     MAX\n                         Oh Yesil...  Yesil's his name but \n                         I...don't know anything... \n                         'bout...Yesil... \n\n               ANOTHER ANGLE - MAX'S head begins to bob back and \n               forth.Focuses on BILLY.\n\n                                     MAX\n                         Best way is get your ass out... \n                         any... way... you can...\n\n                                     BILLY\n                         What do you mean?\n\n                                     MAX\n                         Get the... midnight... express.\n\n                                     BILLY\n                         What's that?\n\n               MAX smiles from faraway like a Cheshire cat and his head \n               drops forward onto his knees, nodding off.\n\n                                                                    CUT:\n\n               HAMIDOU, swinging his falaka stick rhythmically against \n               his leg and that calm killer look on his face, leads an \n               uneasy BILLY down a MAIN WALKWAY with a roof overhead; we \n               gather that the prison contains several separate wings.\n\n               ADMINISTRATIVE BUILDING - HAMIDOU glances back at BILLY, \n               indicates with his stick \"come here\" and opens an office \n               door.\n\n               BILLY, still bewildered, his bruised feet almost back to \n               normal, limps in warily eyeing HAMIDOU who follows.\n\n               NECDIT YESIL, the lawyer, fleshy, grinning, thin black \n               hair heavily greased, sits at a conference table. Standing \n               adjacent is STANLEY DAVIS, the U.S. Consul - eyeglasses, \n               striped tie, neat summer suit with stripes, trimmed hair, \n               ivy league look, his eyes moving from Billy to:\n\n               OLDER MAN, late 50's white hair, blue-eyed New York \n               Irishman.A suburban insurance agent, rumpled suit, an \n               anxious look on his face. Moving towards BILLY fast:\n\n                                     FATHER\n                         Billy!\n\n               FATHER AND SON embrace; the father's left hand grabbing \n               Billy's arm tightly as if never to let go.\n\n                                     BILLY\n                         Dad!\n\n               HAMIDOU looks on, intrigued by the Father and Son; leaves \n               silently, closing the door.\n\n               FATHER looks into his son's eyes, his own eyes moistening.  \n               He looks tired, pain all over his face.\n\n               BILLY looks down.\n\n                                     BILLY\n                         Dad...I'm... \n\n               ANOTHER ANGLE\n\n                                     FATHER\n                              (voice quivering)\n                         ...Don't worry about it.\n                              (managing a smile)\n                         I can punch you in the nose later.  \n                         Right now we've got to get you out \n                         of here.  You all right?\n\n                                     BILLY\n                              (eyes moistening)\n                         Yeah. How's Mom?\n\n                                     FATHER\n                         Bad. She couldn't make the trip.  \n                         You know Her boy...\n                              (breaks off)\n                         Susan told us before we got your \n                         letter. She's fine; she's trying \n                         to get the money to come back and \n                         see you, but...\n\n                                     BILLY\n                         No, don't let her!  I'll... How \n                         about Peg? Robbie?\n\n                                     FATHER\n                         Same. None of the neighbors know.  \n                         We told them you were in a hospital \n                         in Europe.  Oh... this is Stanley \n                         Davis. He's the American Consul \n                         here... And Necdit Yesil, the lawyer \n                         you wanted...\n\n               ANOTHER ANGLE\n\n                                     DAVIS\n                              (shaking hands)\n                         Hello, Billy.\n\n                                     BILLY\n                         Hello.\n\n               The professional smile from the Consul, but in the handshake \n               and the eye contact, BILLY is cool. The unanswered question: \n               Where were you before my father arrived?\n\n                                     DAVIS\n                         I want you to know we're going to \n                         do everything, in our power to get \n                         you out as soon as possible. Believe \n                         me.\n\n                                     BILLY\n                         Thank you.\n\n               ANOTHER ANGLE\n\n               YESIL moves forward. unctuous. bubbling with high spirits, \n               profusely shaking BILLY's hand, exuding confidence in \n               fractured English,\n\n                                     YESIL\n                         Vilyum, I am Necdit Yesil.\n\n                                     BILLY\n                         Mr. Yesil.\n\n                                     YESIL\n                         I know exactly what you feel but \n                         you must not worry, we are acting \n                         immediately, we get the right court, \n                         the right judge,  I arrange \n                         everything - just right.  And I \n                         think we get you bail. If very \n                         bad, maybe twenty month sentence... \n                         But I think we get you bail...\n\n               Pause, BILLY looks at him wondering how to take him in.\n\n                                     YESIL\n                              (reassuringly)\n                         You know I have lectured at the \n                         University of Maryland in your \n                         country?  Also University Michigan \n                         Very nice country. We both go back.\n                              (smiles)\n\n                                     BILLY\n                              (trying to \n                              concentrate)\n                         If I get bail, Mister Yesil, they \n                         say it's easy to cross the border \n                         into Greece?\n\n                                     FATHER\n                              (pacing up, hungry)\n                         Right!  That's what we're shooting \n                         for.  Mister Davis and have been \n                         in contact with the State \n                         Department, but right now relations \n                         with the Turks aren't too good, \n                         Nixon's upset the hell out of them.  \n                         Our best bet's... right here.\n\n                                     BILLY\n                         Dad...\n                              (pauses, glances at \n                              Davis and Yesil, \n                              embarrassed)\n                         I'll pay you back for all this, I \n                         Promise. \n\n               ANOTHER ANGLE\n\n                                     FATHER\n                         Don't worry about it.  Right now \n                         money doesn't count. Okay?\n\n               A pause. YESIL Shifts, Throats are cleared. BILLY moves to \n               sit down, limping faintly; he is wearing sneakers and the \n               bruises don't show.\n\n                                     FATHER\n                         Where'd you get that limp?\n\n                                     BILLY\n                              (not wanting to \n                              alarm him)\n                         Nothing. Just twisted my ankle.\n\n               Sits down at the conference TABLE.\n\n                                     BILLY\n                         Where you staying, Dad?\n\n                                     FATHER\n                              (pulls up a seat \n                              next to Billy)\n                         The Hilton.\n\n                                     BILLY\n                         How do you like it?  Istanbul?\n\n                                     FATHER\n                         Well, it's an interesting place...\n                              (lowers his voice, \n                              a hint of a smile)\n                         Tell you the truth, I think the \n                         food is lousy. The crap they sell \n                         in these little restaurants. I \n                         went out to eat in one of them \n                         last night, and I had to run to \n                         the damn toilet... You shoulda' \n                         seen the toilet.\n\n               BILLY laughs.\n\n                                     BILLY\n                         You mean you got toilets?\n\n               FATHER is happy to see his son laugh.\n\n                                     FATHER\n                         Yeah, with real toilet paper - and \n                         you don't have to use both sides.\n\n               BILLY laughs again.\n\n                                     FATHER\n                         So now I'm eating at the Hilton \n                         every night.\n\n               BILLY smiles. A pause. A worried look returns to the \n               Father's face\n\n                                     FATHER\n                         Why'd you do it, Billy?\n\n                                     BILLY\n                         For the money...\n                              (Looks away))\n\n                                     FATHER\n                              (sighs)\n                         I know you kids smoke that stuff, \n                         and we drink booze, but taking it \n                         across a border - it was stupid, \n                         Billy. Stupid.\n\n                                     BILLY\n                         I know.\n\n               Glances at DAVIS, YESIL back to his father, his voice \n               beginning to tremble, ashamed of himself for letting it \n               show.\n\n                                     BILLY\n                         Dad get me out of here.\n\n               ANOTHER ANGLE. The FATHER understands the desperation in \n               his voice, puts his hand on his son's.\n\n               FATHER I promise you, Billy. Just sit tight and don't.. \n               DON'T do anything stupid.  Let me work with Mr. Yesil and \n               Mr. Davis.  We'll get you out... Okay?  Billy, okay?\n\n               All the assurance of the world is written in this kindly \n               Irishman's face.\n\n               BILLY feels it.\n\n               BILLY being led by TWO GUARDS down a huge arched CORRIDOR \n               in the COURTROOM BUILDING.\n\n                                     BILLY\n                         Okay.\n\n                                                                    CUT:\n\n                                     PROSECUTOR VOICE (OVER)\n                         THE world is now looking at Turkey. \n                         We are called the Heroin Supplier \n                         of the world.  Stories about us \n                         are in newspapers and on television \n                         every day all around the world. \n                         The time has come, your Honor, to \n                         alter this image before we find \n                         ourselves isolated and morally \n                         ostracized by the rest of the human \n                         race...\n\n               THE COURTROOM - monolithic, frightening, immense with cross-\n               currents of greenish light from the enormous windows.  \n               People seem insignificant.\n\n               THE PROSECUTOR, wearing dark green glasses, continues, \n               scowling, gesturing profusely at:\n\n               BILLY in the PRISONERS DOCK, baroque design, isolated.  \n               Doesn't understand a thing, Erich's extra-large blue pin-\n               striped suit makes him look rather absurd.\n\n               HIS FATHER, CONSUL DAVIS, YESIL and ANOTHER LAWYER are \n               seated together at the defence table conferring in low \n               tones with each other. YESIL looks over at BILLY with a \n               big reassuring grin, nods his head - nothing to worry about.\n\n               TURKISH GIRL from the Press with a yellow legal pad, makes \n               notes in the Spectator Gallery. Her legs flare out from a \n               short skirt.\n\n               BILLY pries his eyes away to:\n\n               PROSECUTOR continuing in front of the THREE JUDGES high on \n               an Alice in Wonderland podium wearing long black robes \n               with scarlet collars. One of the Judges is bald, the other \n               has his eyes closed, could be asleep. The CHIEF JUDGE in \n               the middle has a sagging somewhat kindly face and short \n               grey hair.  A YOUNG MAN below the podium, is clacking at \n               an ancient typewriter on a small table.\n\n                                     PROSECUTOR VOICE (OVER)\n                              (continuous)\n                         ...We must alter this image by \n                         punishing only our own drug \n                         smugglers-but by handing out \n                         foreigners who infest our culture \n                         with their depravity ungodly and \n                         behavior.  We must start now - by \n                         sentencing this American, Vilyum \n                         Hi-yes, to the maximum sentence \n                         for smuggling, to be held up to \n                         the light of the world as an example \n                         of Turkish justice and its intention \n                         to halt the drug trade once and \n                         for all.. .I ask the Court therefore \n                         to sentence Vilyum Hi-yes to Life \n                         Imprisonment. \n                         \n\n               He sits, staring malignantly at BILLY.\n\n               THE JUDGES rise.\n\n                                     JUDGE\n                         Thank you, Prosecutor. The Court \n                         will now recess to consider its \n                         verdict.\n\n               The JUDGES exit.\n\n               ANOTHER ANGLE, General commotion in the courtroom as people \n               move about. The FATHER and DAVIS and the OTHER LAWYER \n               consult among themselves, the FATHER vigorously nodding \n               his head.  YESIL approaches BILLY.\n\n               BILLY leans forward anxiously in the dock.\n\n                                     BILLY\n                         What'd the Prosecutor say?\n\n                                     YESIL\n                              (hurried)\n                         It's not important, just technical \n                         things. We make our case.  You \n                         were very good, you spoke well.  \n                         The Judge like you. It look good. \n                         Don't worry.\n\n                                     BILLY\n                              (pressing)\n                         Did you ask for bail?\n\n               But YESIL is called over by the other LAWYER and hurries \n               off.  A SOLDIER comes over and sits BILLY down.\n\n                                                                    CUT:\n\n               THE CHIEF JUDGE puts on his glasses, stands to read the \n               verdict.\n\n               YESIL, standing with the OTHERS, motions BILLY to rise.\n\n               BILLY rises, tense.\n\n               FATHER looks over at him, manages a reassuring smile.\n\n               JUDGE continuing, after preliminaries:\n\n                                     JUDGE\n                         The Defendant has been found guilty \n                         by the Court of the illegal \n                         possession of Hashish...\n\n               PROSECUTOR, his expression souring, makes a gesture of \n               defeat. We wanted a conviction for smuggling, not \n               possession.\n\n               BILLY, not understanding sees the Prosecutor's gesture, \n               and a hint of hope crosses his expression.\n\n               JUDGE puts the paper away, looks at BILLY directly.\n\n                                     JUDGE\n                         ...Therefore. this court sentences \n                         you, Vilyum Hi-yes to be imprisoned \n                         at Sagamilcar Prison for a term of \n                         four years and two months. This \n                         Case is now closed.\n\n               BILLY looking at the JUDGE doesn't understand. Thinks he \n               might be free.  But suddenly TWO SOLDIERS move in, and \n               start chaining his hands together. He is bewildered, looking \n               at:\n\n               YESIL hastily conferring with Billy's FATHER, more concerned \n               about making a good impression with him than with Billy.\n\n                                     YESILF\n                         Four years, two months. It's good.\n\n                                     FATHER\n                              (stunned)\n                         Four years!\n\n                                     YESIL\n                              (quickly)\n                         We appeal it.\n\n               BILLY watching this, a lost look.\n\n               FATHER is too shocked to do anything but look at YESIL who \n               continues on:\n\n                                     YESIL\n                         You will see, he will have maybe \n                         one year taken off this sentence \n                         for good behaviour. Remember, it \n                         is only for possession; the \n                         prosecutor wanted life sentence \n                         for smuggling...\n                              (a smile)\n                         To be honest Mr. Hayes, it is a \n                         great victory!\n\n               BILLY is forcibly removed from the DOCK - in chains.\n\n                                                                    CUT:\n\n               THE FATHER, in the same CONFERENCE ROOM,\n\n                                     FATHER\n                              (embarrassed)\n                         ...With good time Billy it works \n                         out to about 3 years... then there's \n                         the appeal.  Yesil, Davis, they're \n                         all working for you We're going to  \n                         try to make a deal to get you \n                         transferred to a Stateside prison. \n                         And Davis thinks there might be a \n                         political amnesty any month...\n\n               Stops. Knows it sounds bad.\n\n               BILLY looks down.\n\n                                     FATHER\n                         Look - I know it sounds tough, \n                         Billy, but we're gonna get you \n                         out...\n\n               FATHER grips BILLY by the arm hard.\n\n                                     FATHER\n                         ...I promise you, but I don't want \n                         you to get stupid again. Pull \n                         anything.  They can play with your \n                         sentence.\n\n               BILLY nods, acquiescent.\n\n                                     FATTIER\n                              (his voice starting \n                              to crack)\n                         I'm putting $500 in the bank for \n                         you.  Anything you need you write...\n\n               BILLY nods.  His FATHER points to a stack of ITEMS on the \n               conference table, picks up a cigarette carton.\n\n                                     FATHER\n                         There's food, candy, writing paper, \n                         soap, books...\n                              (his eyes start to \n                              water)\n                         ...cigarettes, soap, tooth-brush, \n                         there's... Jesus!\n                              (cracks, throws \n                              down the cigarette \n                              carton)\n                         I been writing insurance policies \n                         on people for thirty goddamn \n                         years...\n                              (laughs and cries \n                              at the same time)\n                         And now I gotta see my own \n                         son...Jesus! Jesus!  If I could be \n                         where you are Billy, I'd be there... \n                         Goddamn Jesus!  These bastards.\n\n               HUGS HIS SON BILLY is on the verge of tears.\n\n                                     BILLY\n                         DAD! \n\n                                     FATHER\n                         Oh Jesus! \n                              (sobbing)\n\n               HAMIDOU enters the room. A morbid curiosity in his \n               expression about this show of grief. Watches a few moments, \n               then indicating the visit is over, he taps his falaka stick \n               lightly a few times on the hollow door.  THWACK!  THWACK!\n\n               FATHER breaks the embrace with BILLY, tears streaking his \n               cheeks. Silently indicates for him to \"Go, go Fast.\"\n\n               BILLY goes, past HAMIDOU\n\n               FATHER shaking his finger at HAMIDOU\n\n                                     FATHER\n                         You take good care of my boy, you \n                         hear, or I'll have your fucking \n                         head, you Turkish bastard!\n\n               It sputters out of his mouth, senseless to:\n\n               HAMIDOU who closes the door. He has an angry glint in his \n               eye.\n\n                                                                    CUT:\n\n               BILLY lies on his bunk at night deeply depressed, paler.  \n               Candlelight flutters softly against the stone walls. A \n               PHOTO of SUSAN taken outdoors with a mountain range in the \n               background, is on his wall with various SOAP CARVINGS of \n               little chess piece she has designed.\n\n               In the distance, very faintly coming upwards into our sound \n               consciousness we hear a TRAIN WHISTLING in the night, on \n               an old railroad track bypassing the prison walls. Two \n               whistles.  Chugging. Then passing off. The Midnight Express.\n\n                                     BILLY'S VOICE\n                         Dear Susan.  1970 has now passed \n                         into 1971.  You can drift in here \n                         and never know you're gone. You \n                         can fade so far out and you don't \n                         know where you are anymore or where \n                         anything else is...\n\n               The CAMERA DRIFTS around the SECOND STORY KOGUS revealing \n               the sleepers: ERICH, BELL, MAX...\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         I find loneliness is a physical \n                         pain which hurts all over; you \n                         can't isolate it in one part of \n                         your body. I so much need your \n                         softness, your strength. I have \n                         your letters. They charge me, give \n                         me courage.News about amnesty and \n                         getting out - tangled, \n                         complicated...\n\n               The CAMERA LINGERS on ZIAT in a far corner of the Kogus, \n               top bunk, against a wall.  Never secure, he shuffles in \n               his sleep.\n\n                                     VOICE\n                         ...I feel myself drifting more \n                         heavily into smoking hashish. The \n                         haze helps the time pass. Also I \n                         do soap carvings.  Erich taught \n                         me. And I have been learning Turkish \n                         because it helps me to deal with \n                         the guards and the prisoners. I'm \n                         trying hard to maintain some sort \n                         of schedule to my life, but \n                         sometimes it seems like I'm just \n                         trying in order to try...\n\n               ZIAT is evidently awake he pulls his RADIO over into the \n               bed, and peering around to make sure no one is watching, \n               here moves the screws from the back of it, pulls off the \n               cover and puts in a sheaf of large denomination GERMAN \n               MARKS: inside we briefly glimpse a wad of different-colored \n               CURRENCIES stacked with rubber bands.\n\n                                                                    CUT:\n\n               COURTYARD. Volleyball game in progress. ERICH is tall and \n               plays with dexterous grace. BILLY is fast, agile. BELL is \n               muscular, intense, his hits power-packed.\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         ... In the daytimes we sometimes \n                         play volleyball against the big \n                         Turkish gangsters...\n\n               THE THREE they play against are hilarious looking in this \n               context, moving like big clumsy bears, waving their arms \n               and screaming at each other, disorganized. Ever conscious \n               of fashion, they have their jackets and vests off but play \n               in their Elvis Presley shirts rolled up at the sleeves, \n               shiny slacks, black pointed pumps. The boys wear shorts \n               and sneakers. On the sidelines we see a group of PRISONERS \n               laying bets and shouting encouragement.\n\n               BILLY leaps up for a ball close to the net and as the \n               TURKISH OPPONENT backs off, he dinks the ball in just over \n               the net; the Turk SCREAMS his teammates scream at him.\n\n                                                                    CUT:\n\n               BELL goes up for another ball close to the net and really \n               SMASHES it with all his might, and:\n\n               BALL bangs right into the eye of a TURK who flails his \n               arms and SCREAMS with pain, very theatrical.\n\n                                                                    CUT:\n\n               THE SAME TURK now swaggers around the COURTYARD, wearing \n               sunglasses so no one will see his black eye.\n\n                                     BILLY'S VOICE\n                         ...To the Turks all foreigners are \n                         \"ayip\" - unclean, dirty. We don't \n                         shave our under-arms or around our \n                         crotch...\n\n               BELL across the pointyard grins at him and points him out \n               to BILLY, and ERICH.\n\n                                     BILLY VOICE\n                              (continuous)\n                         Even the yoga I sometimes do is \n                         \"ayip\" - too suggestive...\n\n               THE TURK scowls back at BELL, huddles menacingly with \n               another TURK. \n               \n\n                                     BILLY'S VOICE\n                              (continuous)\n                         And you're never supposed to eat \n                         with your left hand. You know why?\n                         Because that's what they use to \n                         wipe their asses with instead of \n                         toilet paper.  And yet they hate \n                         pigs. There are no pigs in Turkey. \n                         They're considered dirty...\n\n               BELL, smirking at the Turk, turns and walks away.\n\n                                     BILLY VOICE\n                              (continuous)\n                         So is homosexuality. That's a big \n                         crime here but most of them do it \n                         every chance they get.  There are \n                         about a thousand things that are \n                         \"ayip\".  But they're really so \n                         hypocritical, like children breaking \n                         the rules. For instance...\n\n               Suddenly a CRY OFF and:\n\n               THE TURK runs up, pulling a sharp SHIV from his pants, and \n               using the cloth as a handle he repeatedly STABS BELL in \n               the ass and backs of his thighs. One, two, three, four, \n               five QUICK STABS, like a cook hammering veal. In spite of \n               its violence, the action seems like slapstick.\n\n               BELL tumbles to the ground, crying out.\n\n               THE TURK stashes the shiv and disappears among his FRIENDS, \n               his honor restored.\n\n               BILLY and ERICH run over to help BELL who is obviously \n               more in pain than in danger.\n\n                                     BILLY VOICE\n                              (continuous)\n                         ...You can stab or shoot some body \n                         the but not above the waist because \n                         that's intent to kill. So everybody \n                         runs around stabbing everyone else \n                         in the ass.  That's what they call \n                         'Turkish revenge'.  There's also a \n                         lot of \"Baksheesh\" that's a favorite \n                         Turkish word for bribery...\n\n               LONG SHOT - HAMIDOU and ASLAN the young fat Turkish gangster \n               pointed out previously by Erich, are taking tea together \n               in the FIRST STORY KOGUS alone except for ZIATR and \n               Hamidou's two FAT SONS, 7 and 8 years old, both dressed in \n               little suits listening politely as Hamidou gestures to \n               them, in couched terms. The voices are distant and, after \n               a few beats, UNDER BILLY'S VOICE:\n\n                                     HAMIDOU\n                         Unfortunately my youngest son Arief \n                         is having problems with his teeth; \n                         he needs braces, but dentists are \n                         so expensive these days\n\n                                     ASLAN\n                              (patting Arief on \n                              the head)\n                         Poor kid... You know I have a \n                         friend, a very good friend; he's a \n                         dentist; maybe he could get you \n                         some braces at a... reasonable \n                         price.\n\n                                     HAMIDOU\n                              (protesting with \n                              his hands, shaking \n                              his head))\n                         Oh, no...it's out of the \n                         question...wouldn't want to ask \n                         your friend...\n\n                                     ASLAN\n                         Yes. Please! As a favour... I insist\n\n               They go on, each protesting.\n\n                                     BILLY VOICE\n                              (continuous)\n                         Hamidou hints that he needs new \n                         braces for one of his sons.  Aslan \n                         of course has a friend who's a \n                         dentist.  They bullshit for half \n                         an hour and Hamidou finally accepts \n                         the \"Baksheesh\" in return...\n\n               A BURLAP BAG comes flying over the WALL of the COURTYARD \n               late at NIGHT. Then another comes over, lands in the yard. \n               one is around.\n\n                                     BILLY VOICE\n                              (continuous)\n                         Dope and all kinds of shipments \n                         get delivered to Aslan, who re-\n                         sells it through his runners. People \n                         like Ziat.  But one night, it \n                         backfired...\n\n               A THIRD BAG comes over, gets caught on a hooknail and rips \n               right open. HUNDREDS of yellow PILLS spill out.\n\n                                                                    CUT:\n\n               COURTYARD.  The SUN is just coming up in the East.  PRAYER \n               can be heard in the distance. Thousands of bombers are \n               scattered all over the courtyard.\n\n                                     BILLY VOICE\n                              (continuous)\n                         There were thousands of yellow \n                         nembutols.  Aslan as usual had the \n                         privilege of going into the \n                         courtyard before anybody else to \n                         pick up his stuff but...\n\n               ASLAN arguing vehemently with a GUARD, in his ragged \n               uniform, who won't open the cell of the FIRST FLOOR KOGUS \n               into the courtyard.\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         ...it happened to be a new guard \n                         that day and he didn't understand \n                         the system.\n\n                                     GUARD\n                         No. It's too early.\n\n                                     ASLAN\n                         Open the fucking Gate, you asshole!  \n                         Do you know who I am? You want to \n                         get in trouble!\n\n                                     GUARD\n                              (angry)\n                         Hey, I your mother! Get back to \n                         your bunk.\n\n               ASLAN, red in the face, steps back, suddenly pulling out a \n               little REVOLVER. He promptly shoots the GUARD in both legs \n               and stalks back towards his bunk.\n\n                                                                    CUT:\n\n               PRISONERS rushing out into the COURTYARD, scrambling for \n               the windfall of free nembutols.\n\n               THE PRISON DIRECTOR, A balding unimpressive looking man in \n               a western suit, is calling up the circular stone STAIRS to \n               the second story Kogus from the first story.  With him are \n               several GUARDS, equally reluctant to move forward.  Hamidou \n               is absent.\n\n                                     PRISON DIRECTOR\n                         Aslan...be reasonable. Come down \n                         and talk.\n\n                                     ASLAN (OFF)\n                              (from second story)\n                         You come up here and talk!\n\n                                     PRISON DIRECTOR\n                              (not moving)\n                         Aslan... if you give up the gun, \n                         you can keep the bullets\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         A week later Aslan had a new gun...\n\n               A PHOTOGRAPHER, seedy looking, readies a big old fashioned \n               box of a CAMERA.  He snaps the shutter on:\n\n                                     BILLY'S VOICE\n                         ...I know all this must sound crazy \n                         to you, but this place is crazy...\n\n                                                                    CUT:\n\n               ASLAN and a group of FELLOW GANGSTERS, all impeccably \n               dressed and grinning for camera, fresh from their victory.\n\n               BILLY, ERICH, MAX, form their own group; in contrast to \n               the Turks, none of them are smiling, MAX has his YOUNG CAT \n               in hand.  The PHOTOGRAPHER is lining up his shot, posing \n               them like actors.\n\n                                     BILLY\n                              (continuous)\n                         Everything is \"sula-bula\" which \n                         means \"like this, like that\" - you \n                         never know what will happen. One \n                         day one of the new kids was raped \n                         in the children's kogus, so they \n                         picked out six of the worst kids...\n\n               COURTYARD. GUARDS pull out SIX KIDS by the ears from a \n               line-up.\n\n                                                                    CUT:\n\n               CLOSE KID being pinned onto his back on the floor in \n               CHILDREN'S KOGUS: then he is bent over double by a wooden \n               bench; and TWO GUARDS sit on each end of the bench, holding \n               him down.  A silence,\n\n               HAMIDOU appears in a hat and mohair suit with narrow lapels, \n               accompanied by his two little fat SONS, also in their Sunday \n               best. With a ceremonious solemnity, HAMIDOU takes off his \n               jacket, hat, vest, hands them to his sons.\n\n               BILLY watches through the WINDOW with OTHER PRISONERS.\n\n               HAMIDOU is passed a falaka stick.  He raises it high in \n               the air and begins to whack at the buttocks, legs, and \n               feet of the SCREAMING KID.\n\n               ANOTHER ANGLE - On this cue, the five GUARDS on the other \n               benches begin whacking away; the KIDS squirm, scream, \n               struggle but the GUARDS sitting on the of the benches brace \n               their legs farther apart to keep their balance, In immediate \n               background, the other KIDS watch, scared.\n\n               THE TWO SONS with wide-eyed but passive expressions, stare \n               at their father at work.\n\n               HAMIDOU beating his VICTIM, screams out: \n\n                                     HAMIDOU\n                         PIS!  PIS\" \n                         (\"Obscene, filthy\")\n\n               Then stops.\n\n               BILLY WATCHES AS:\n\n               HAMIDOU is handed back his vest, jacket and hat by his \n               SONS: Puts them on ever so neatly and leads them off as if \n               on a Sunday stroll leaving the CRYING behind. On their \n               backs, we hear, placidly:\n\n                                     HAMIDOU\n                         You see Mamur, Mamet - what happens \n                         when you're not a good boy.\n\n                                     BILLY VOICE\n                              (continuos)\n                         Then there's Ziat.  The more I \n                         know of him...\n\n                                                                    CUT:\n\n               TEN DOLLAR BILL exchanging HANDS. The dirty nails of ZIAT \n               clutch the bill, waving it to the candlelight to see if it \n               is authentic his milky white EYE across the BILL.  He is \n               next to his bunk at night.\n\n                                     BILLY VOICE\n                         ...the more hate him.\n\n               MAX and BILLY are next to him, MAX eagerly gouging with \n               his knife into a small bar of SOAP:\n\n               PULLS out a ball of HASHISH inside, neatly concealed. Brings \n               it up to his NOSE, sniffing.\n\n               ANOTHER ANGLE - BILLY is watching with glazed eyes - stoned.  \n               Approving of the $10, tucks it into his belly cloth looking \n               over and scowling at:\n\n               MAX'S YOUNG CAT on his bunk scratching playfully at one of \n               his wool sweaters.\n\n               ANOTHER ANGLE MAX holding the ball of hash:\n\n                                     MAX\n                         Ten dollars for this shit?  You \n                         greedy one-eyed git.\n\n                                     ZIAT\n                         NO!   Is good!\n                              (gets his English \n                              wrong)\n                         Me good shit.\n                              (Meaning my shit is \n                              good)\n\n                                     MAX\n                         No!  You big shit! \n\n               ZIAT thinking MAX is correcting his English, nods and \n               repeats:\n\n                                     ZIAT\n                         Yeah! Efe big shit.\n\n               BILLY and MAX snigger and ZIAT realizes they are making \n               fun of him.  He hates that and suddenly reaches over and:\n\n                                     ZIAT\n                         JAAAASH! \n\n               SHAKES THE CAT hard off his bunk. A SQUEAL from the cat.\n\n               MAX surprised, glares at Ziat.\n\n                                     MAX\n                         You asshole! \n\n               Then hurries after it, calling its name...\n\n                                     MAX\n                         Hikmet come here boy.  Hikmet\n\n               ZIAT shrugs. So what?\n\n                                     BILLY\n                              (irritated)\n                         What is it with you man, what the \n                         hell is it?\n\n                                     ZIAT\n                         Cat, ah!  Ayip!\n\n                                     BILLY\n                         You're ayip!\n\n                                     ZIAT\n                              (glares at him, \n                              then lets it go)\n                         Look, you don't fuck with me, I \n                         don't fuck with you, right?\n\n                                     BILLY\n                         But you fuck with me. You fuck \n                         with me all the time. You make \n                         crummy tea.  You rip us off on the \n                         hash.\n\n                                     ZIAT\n                              (amused)\n                         I make special tea for you, Hiyes, \n                         okay?  We've to live like brothers.  \n                         We have to be in here together.\n\n                                     BILLY\n                              (tired of it)\n                         Oh shove it, Ziat for all the money \n                         you have, you have nothing!\n\n               ZIAT grins, shrugs, squats and fiddles with his keys and \n               footlocker.\n\n                                     ZIAT\n                         You 'Merican.  You don't know.\n\n               BILLY watches, repulsed and fascinated.\n\n                                     BILLY\n                         Know what?\n\n                                     ZIAT\n                         Was..\n                              (makes gesture with \n                              his fingers)\n                         ...seven years old. I was on street \n                         in Suk.  Buy.  Sell.  No family to \n                         take care. I learn.\n\n                                     BILLY\n                         Learn what?\n\n               ZIAT shrugs. He thinks BILLY is an idiot.  \n\n                                     ZIAT\n                         Dog eat dog, Hi-yes. You fuck other \n                         man before he fuck you.\n                              (grins)\n                         And you must fuck last.\n\n                                     BILLY\n                         That's a great philosophy.\n\n                                     ZIAT\n                              (shakes his head)\n                         You 'Merican.  You don't know.\n\n               MAX has followed his cat down to the end of the floor but \n               it has run up into a rafter which he cannot reach. He calls \n               up.\n\n                                     MAX\n                         Here Hikmet!  Come down here boy!  \n                         Hikmet...\n\n               RAFTER Nothing.\n\n               Max gives up.\n\n                                     MAX\n                         Sodding cat! \n\n               He shuffles off back to his bunk.\n\n               THE CAT is back on ZIAT'S BUNK - NIGHT scratching with his \n               paw around the radio. of the neck, hard. Suddenly he is \n               GRABBED by the scruff  of the neck, hard.\n\n                                                                    CUT:\n\n               BILLY jerks up from his bunk as he the hears a loud, \n               piercing SCREECH, OFF, echoing through the Kogus.  Then \n               silence.\n\n                                                                    CUT:\n\n               ZIAT, industrious as always, is preparing his tea on the \n               three burners of the small bottled gas' stove in THE \n               KITCHEN, FIRST FLOOR Kogus; needless to say the area is \n               filthy with scraps all over the floor, cats and two large \n               wooden eating tables occupied by some PRISONERS. The Kitchen \n               opens up in background into a WASHING ROOM with SINK. It \n               is EARLY MORNING - Muslim CHANTING OFF,\n\n               THREE TURKISH PRISONERS walk in, talking (AD LIB), followed \n               by MAX stoned, who shuffles over to the table, about to \n               sit, sees something.\n\n               HIS CAT, dead stabbed, and lying there neglected in the \n               corner, just another scrap ready to be swept out.\n\n               ZIAT calmly pours the tea for the table, paying MAX no \n               attention, an excellent actor. Prominently seated, however, \n               is a GUARD. \n\n               MAX quietly glares at ZIAT and the Guard but says nothing; \n               he has been in prison long enough to know how to hold it \n               in.\n\n               ANOTHER ANGLE\n\n               MAX - silently walks over and gently picks up the corpse \n               in his arms, starts to walk out.\n\n                                                                    CUT:\n\n               BILLY listening impassively to:\n\n               YESIL the lawyer. They are in a booth in the VISITING \n               CAMBER.  Bars separate prisoner and visitor.\n\n                                     YESIL\n                              (smiling)\n                         The new American Ambassador here \n                         is following your case very closely.  \n                         He says there is progress. But \n                         there is another route that is \n                         quite possible...\n                              (lowers his voice \n                              and leans close)\n                         ...For the proper amount of money \n                         it is possible I can convince \n                         certain officials to lose track of \n                         your papers before the High Court \n                         in Ankara confirms the sentence of \n                         the Lower Court in Istanbul... You \n                         would not exist; and you could be \n                         in Greece by the time the Turkish \n                         courts discovered a stupid clerical \n                         mistake...But I have to act before \n                         the official sentence is handed \n                         down, and for that I must pay \n                         certain officials in advance...\n\n               BILLY closes his eyes as YESIL'S VOICE drones on, explaining \n               the details, the cast, the simplicity Of it,  FADING OUT \n               UNDER:\n\n               BILLY walking the COURTYARD counting his paces 48, 49, 50 \n               Turns, goes back.\n\n                                     SUSAN'S VOICE\n                         ...My dearest Billy. I know it is \n                         long and it is hard for you, but \n                         your family and I are thinking \n                         about you all the time. I am trying \n                         hard to make enough money nights \n                         to come and see you.  Your father \n                         says that lawyer Yesil wants another \n                         $2000.  I know you distrust him \n                         more and more, but your father \n                         wants to do everything he can, and \n                         he is borrowing all he can on the \n                         mortgage of the house.  Money seems \n                         to be the only way out of there. \n                         Except of course the other way...\n\n               BILLY, MAX and BELL (bandaged around the ass from the \n               stabbing) are huddled around BELL's BUNK late NIGHT candle \n               burning, a sheet sealing off some of the kogus. Bell \n               furtively looks around, pulling out and elaborately \n               unfolding a set of DRAWINGS from a pack of letters.\n\n                                     SUSAN'S VOICE\n                              (continuous)\n                         ...But I cannot say I am for it.  \n                         Nor are your parents. They consulted \n                         the priest, and he said to send \n                         you money for that reason would be \n                         like sealing your death.\n\n                                     BELL\n                              (excited)\n                         The blueprints!\n\n                                     MAX\n                         To what?\n\n                                     BELL\n                         The prison, man. There was this \n                         German cat an architect in the \n                         hospital. He was helping the Turks \n                         build some shit round the place.  \n                         I laid some bread on him and he \n                         let me copy them.\n\n               BILLY, puzzled, turns the drawings upside-down, sideways.\n\n               THE DRAWINGS are a lunatic mess of scrambled lines, dots, \n               crosses.\n\n               ANOTHER ANGLE\n\n               MAX and BILLY, trying to follow the map, look at each other \n               dubiously.\n\n                                     MAX\n                         Too bad you didn't have a machine.\n\n                                     BELL\n                              (intent)\n                         There's two ways out I figger -   \n                         over the roof, but that's only one \n                         person, maybe two. The other way \n                         is Under.\n\n                                     BILLY\n                         Tunnel?\n\n                                     BELL\n                              (grins)\n                         It's already built!  There's a \n                         basement substructure where they \n                         used to keep weapons and stuff, \n                         but beneath that there's these old \n                         catacombs that the Christians built \n                         'bout a thousand fucking years ago \n                         to bury their dead.  We're sitting \n                         right on top of it -- here.\n\n               INSERT DRAWING, illustrating roughly the structure of the \n               prison. His FINGER tracing, bubbling with nervous \n               enthusiasm.\n\n                                     BELL (OVER)\n                         The Kraut said there's a whole \n                         bunch of hollow sealed shafts sort \n                         of like dumbwaiters running along \n                         this wall; one of them is right in \n                         there, right next to our shower. \n                         We get in there, he says, we can \n                         get down into the catacombs. With \n                         three of us working....\n                              (stops)\n\n               MAX is standing, tapping on the wall, listening, a funny \n               look on is face.\n\n                                     MAX\n                         Gotta be here someplace.  Thought \n                         I heard a couple of dead Christians \n                         singing down there.\n\n               ANOTHER ANGLE\n\n                                     BELL\n                              (irritated)\n                         Stop shitting me, man!\n\n                                     BILLY\n                              (trying to be serious)\n                         But how would you get into the \n                         shaft, Jimmy?\n\n                                     MAX\n                         I suppose you knock three times \n                         and ask for St. Peter.\n\n                                     BELL\n                              (turning on Max)\n                         Hey!  I'm getting this together \n                         man and I don't need no fucking \n                         Gastro-head along on this trip!\n                              (a fierce look at \n                              Max then back to \n                              Billy)\n                         We go through the wall.\n\n                                     BILLY\n                              (a resigned look on \n                              his face)\n                         We go through the wall?\n\n                                     MAX\n                              (quite sure Bell is \n                              out of his skull)\n                         We go through the wall.\n\n               BELL between BILLY and MAX walking in the COURTYARD \n               continuing intently:\n\n                                     BELL\n                         ...The Kraut was right!  I checked \n                         it out - there's no reinforced \n                         steel in those bath walls. They're \n                         real soft from underground seepage--\n\n               BELL reaches the wall, turns around and continues Lowers \n               his voice occasionally as other PRISONERS intersect them.\n\n                                     BELL\n                              (gesturing profusely)\n                         --the water like \"'weeps\" through \n                         the cement, see. Twenty, thirty \n                         years, you can almost push it over. \n                         All we do is use Gastrohead's \n                         screwdriver here and scrape the \n                         mortar out. Pull out 2, 3 stones, \n                         squeeze through, put 'em back, and \n                         get our ass down the shaft, It's a \n                         two night operation, maybe three.\n\n                                     MAX\n                         And what do you do when you in the \n                         catacombs?\n\n                                     BELL\n                         The catacoombs?  Whaddya want, a \n                         door?  There's miles of em like a \n                         sewer system but they got to come \n                         up someplace in Istanbul.\n\n               Max is fed up with it now, no longer joking.\n\n                                     MAX\n                         You gotta be fucking crazy!  You \n                         got stabbed in the ass once too \n                         much, sweetheart, cause you're \n                         gonna end up in Section 13, that's \n                         what - not the 'catacombs.\n\n                                     BILLY\n                         Section 13?  \n                         \n\n                                     MAX\n                              (looking at Bell)\n                         Yeah,  for the criminally insane.\n                              (looks at Billy)\n                         I was there once for two weeks and \n                         it ain't an illusion. It's awful.  \n                         Namidou runs it like a death camp, \n                         that's where he spends most of his \n                         time...\n\n                                     BILLY\n                         Where is it?\n\n                                     MAX\n                         I don' t know. It's someplace down \n                         in there....\n                              (points at the ground)\n                         ..deep.. A big door...a wheel....\n\n               His eyes go back in time, haunted, vague breaks off.\n\n               ANOTHER ANGLE\n\n                                     BELL\n                              (low-keyed)\n                         Hey, you know what's gonna get us \n                         out of here?  It's not a map, Max.  \n                         It's our balls. You know what I \n                         mean...\n                              (straight at Max, \n                              Billy, very sincere, \n                              his eyes almost \n                              watering)\n                         ...I gotta get laid man, I don't \n                         know 'bout you guys, but if I don't \n                         get it on soon, I'm... I'm not \n                         gonna make it.\n\n                                     MAX\n                              (under his breath)\n                         Shit.\n\n                                     BELL\n                         Billy?\n\n                                     BILLY\n                         ...The roof sounds better to me \n                         than digging through a wall.  Ziat's \n                         round there all the time. But the \n                         roof....\n                              (looks up)\n\n               P.O.V. - THE ROOF, its edges visible over the courtyard.\n\n               BILLY shakes his head.\n\n                                     BILLY\n                         The bullet percentage is awful \n                         high.\n\n               A pause. BILLY looks away from BELL'S stare.\n\n                                     BILLY\n                         If I get caught, Jimmy, I'm facing \n                         another months. I'd be back up to \n                         3 years, maybe more...\n\n               Looks down.\n\n               BELL understands, deeply disappointed.\n\n                                     BELL\n                         Well fuck it!  Choose your own \n                         death, babe, I'm taking the roof \n                         out of here!\n\n               Bell leaves:\n\n                                                                    CUT:\n\n               A LONG DUNGEON CORRIDOR at the end of it, the frame of a \n               small; DOOR, cracks of light at its edges. TRACK IN - F.X. \n               of a siren, capture and now BEATING - heavy beating from \n               behind that door.  CLOSER we reach it. The door FLIES OPEN \n               and HAMIDOU is glimpsed lighting a cigarette. Like a surreal \n               dream, his hand holding the match has a thick LEATHER THONG \n               bound around its knuckles and blood speckled on his fingers.\n\n               A BLUR of foreground movement a GUARD coming out the door - \n               dragging:\n\n               BELL by the hair across the floor. His face contorting in \n               agony.\n\n                                     BILLY'S VOICE\n                         Dear Susan. Poor Jimmy was caught \n                         and beaten so badly he got a severe \n                         hernia and lost a testicle. He's \n                         been in the hospital for months \n                         having operations..\n\n                                                                    CUT:\n\n               CLOSE BILLY'S TOOTH BEING PULLED\n\n                                     BILLY VOICE\n                              (continuous)\n                         ...In comparison my problems seem \n                         very small. But two and a half \n                         years have now gone by, and in \n                         their own fashion, the Turks are \n                         slowly draining my life away...\n\n               WIDEN to a STONE CHAMBER and a crazy looking DENTIST in a \n               filthy long white smock, puffing on a cigarette holder, \n               his ashes falling over Billy as he works his mouth. A \n               motorized drill is plugged into the wall, adjacent a filthy \n               spittoon covered with blood; dried blood is spattered \n               liberally around the chamber.\n\n               BILLY spits out the blood and looks in the mirror.\n\n                                     BILLY'S VOICE\n                         ...I have problems with my stomach \n                         and my leg muscles feel very weak.  \n                         My gums seem to be shrinking and \n                         they sometimes bleed when I massage \n                         them... They've pulled five of my \n                         teeth...\n\n               Suddenly he starts SHOUTING angrily in TURKISH. The DENTIST \n               screams back at him. AD LIB.\n\n               THE DENTIST still screaming, leans BILLY back in the chair \n               and looks in his mouth.\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         ...sometimes they null the wrong \n                         one...\n\n                                                                    CUT:\n\n               BILLY is washing himself in his undershorts at the SINK \n               with ERICH; the hot water is on full blast and billows of \n               vapor fill the small stone room, like a sauna. He pours a \n               pitcher full of hot water over his head; his eyes lingering \n               on:\n\n               THE STONES of the wall with their cracked moldings; some \n               areas are noticeably darker than others - Bell's \"wet \n               spots\", the alternate escape route.\n\n                                     BILLY VOICE\n                              (continuos)\n                         ...even my dreams don't seem to \n                         work any more. Because the outside \n                         doesn't seem real any more. It's \n                         not even a fantasy...because there \n                         is no fantasy.\n\n               ERICH uses a coarse washing sponge on BILLY's back.\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         Even masturbation has become boring.  \n                         It teaches you, like the rest of \n                         prison life, to seal up your \n                         emotions, and this is the greatest \n                         danger, this is what makes so many \n                         of the men change into something \n                         monstrous...\n\n               EYES of the ARABS peer through the musky vapors at Billy \n               and Erich; they loll about the door curious, lecherous for \n               their bodies.\n\n                                                                    CUT:\n\n               ERICH massaging BILLY on his bunk in the SECOND STORY KOGUS.\n\n                                     BILLY VOICE\n                              (continuous)\n                         It is Erich who has taught me how \n                         it is to be conscious, to channel \n                         and direct my energy.  He has \n                         convinced me to stop smoking \n                         hashish, he is the calmest man I \n                         have ever known.  If you don't \n                         control your energy in here if can \n                         blow you apart like with Bell. And \n                         you can't waste it either.  You \n                         have to weigh up every one of your \n                         actions - for and against.  Too \n                         little sex, too much sex either \n                         will throw you off balance...\n\n               ERICH leans forward and kisses a tentative BILLY on the \n               lips.  A gentle kiss. They are standing inside the TOILET \n               STALL; lower themselves down onto the seat. ERICH looks \n               back over his shoulder, guarding their privacy. It is late \n               NIGHT.\n\n                                     BILLY VOICE\n                              (continuously)\n                         ...he has taught me about feelings, \n                         and the need to express them.  And \n                         he has taught me about love...\n\n               BILLY closes his eyes, softly - and with hesitation - \n               returns ERICH's caress. Their hands probe each other's \n               bodies.\n\n                                     BILLY VOICE\n                              (continuous)\n                         ...and what love really is, beyond \n                         its physical forms.. .I think up \n                         to now I have only considered my \n                         own self, never really another...\n\n                                                                    CUT:\n\n               ERICH and BILLY do yoga positions together EARLY MORNING \n               fully clothed, in the FIRST FLOOR KOGUS empty space.  ERICH \n               lies on his belly, his back stiffly arched, feet raised.\n\n               BILLY stands silent, balanced lightly on his feet, his \n               palms pressed together beneath his chin, centering, eyes \n               closed.\n\n                                     BILLY VOICE\n                         ...and now strange as it seems, \n                         Susan, without having seen you in \n                         so long I feel myself more inside \n                         of you than ever before. I feel \n                         your female mind.  I sense you, \n                         touch you; ...know you; and find \n                         myself falling more and more...  \n                         in love with you.\n\n               BILLY rises gracefully onto his toes, stretching his arms \n               out above his head. It is the beginning posture, his body \n               greeting the day.\n\n               BILLY and ERICH sit silently now in lotus position, facing \n               each other, breathing slowly, relaxing minds still, looking \n               into each other's eyes. Billy closes eyes.\n\n                                     BILLY\n                              (chant-like, \n                              gathering momentum)\n                         A prison a monastery a cloister a \n                         cave,\n                         Prison monastery cloister cave,\n                         Prison monastery cloister cave,\n                         Prison monastery cloister cave,\n                         Prison monastery cloister...\n\n               SOUND OFF, interrupting the clomp of FOOTSTEPS on the \n               STAIRS.\n\n               ZIAT comes down, staring at the two of them as he goes \n               into the KITCHEN to prepare early morning tea.\n\n               BILLY's expression changes.\n\n                                     BILLY\n                         Prison.\n\n               Rises from his position.\n\n                                                                    CUT:\n\n               THE SUN flowering up over ISTANBUL.\n\n               BILLY rises from his BUNK to the chanting drone of \"Allah \n               Wakbah\" OFF, and moving to the closest wall, takes out an \n               old wet rag.\n\n                                     BILLY'S VOICE\n                         Dear Susan. Erich has been \n                         transferred to a prison back in \n                         Sweden. He has profoundly affected \n                         my life and though I am lonely \n                         without him I am calmer than ever...\n\n               BILLY erases out a scraped numeral (54) on the wall and \n               with a chalky piece of rock, inscribes in bold strokes the \n               numberal: 53\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         Though I only have 53 days left, I \n                         feel I have never been so well \n                         adjusted to prison and to living \n                         as now....\n\n                                     BELL (OFF)\n                         Allah fuck Off!\n\n               JIMMY BELL wakes, hearing the perpetual \"Allah Wakbah\" \n               CHANT.\n\n                                     BELL\n                         Asina Covaciml.  \n                         (I stick it in his mouth)\n\n               He is noticeably pale and weaker than before.\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         ...Poor Jimmy...\n\n               BILLY cuts hair in the FIRST FLOOR there with a disturbed \n               tight look on his face, work with a pocket mirror. BELL \n               sits inspecting the\n\n                                     BILLY VOICE\n                              (continuous)\n                         ...Though his health is bad he \n                         still won't give up...\n\n               GUARD approaching with a slip in hand.\n\n                                     BILLY'S VOICE\n                              (continuous)\n                         ...He still talks of escape.\n\n               THE GUARD hands the slip to BILLY who is pleasantly \n               surprised.  A visitor.\n\n               BILLY, walking down and turning a CORRIDOR into: in the \n               PRISON, following a GUARD and turning into:\n\n               THE VISITING ROOM where the little booths with BARS separate \n               prisoner and visitor. Behind the grill is the Consul, \n               STANLEY DAVIS. His face is grim and grey. BILLY senses it \n               immediately.\n\n                                     BILLY\n                         What's wrong?\n\n                                     DAVIS\n                         Sit down a moment, Billy.  I'm \n                         afraid I have some bad news for \n                         you.\n\n               BILLY sits, tense.\n\n                                     BILLY\n                         Something happen to Dad?... Mom?\n\n               DAVIS swallows hard, not to say it\n\n                                     DAVIS\n                         No... It looks like your going to \n                         have a new court.\n\n                                     BILLY\n                         What do you mean?\n\n                                     DAVIS\n                         The Prosecutor objected to your \n                         sentence for possession; he wanted \n                         a smuggling conviction and the \n                         High Court in Ankara reviewed it.\n\n               ANOTHER ANGLE \n\n                                     BILLY\n                         And?\n\n                                     DAVIS\n                         We've been notified that they \n                         rejected the sentence...\n\n               Billy's face drains of all expression.\n\n                                     DAVIS\n                              (continuing)\n                         There were 35 judges on the High \n                         Court. Twenty eight of them voted \n                         for a life sentence.\n\n               BILLY'S EYES. Numb, dazed, surreal.\n\n                                     DAVIS (OFF)\n                         The Lower Court in Istanbul will \n                         have to go along with the decision.  \n                         The Judge likes you and he'll do \n                         the only thing he can do under the \n                         law.... . He'll reduce the sentence \n                         to thirty years... We're notified... \n                         Billy.\n\n               Suddenly he is GRABBED by his ivy-league striped tie and \n               his face is yanked up to the bars, his glasses falling \n               off.\n\n               BILLY is berserk, his face right up against the bars, \n               GRIPPING Davis tight.\n\n                                     BILLY\n                         What do you mean LIFE FOR FOR WHAT!  \n                         FOR WHAT!\n\n                                     DAVIS\n                              (choking)\n                         Billy!  Please! \n\n               Commotion OFF as GUARDS run in, HAMIDOU in the lead.\n\n                                     BILLY\n                         FOR WHAT!  FOR WHAT!\n\n               The GUARDS try to pry loose BILLY'S strangling grip ON \n               DAVIS' tie.\n\n                                     BILLY\n                         I HAVE FIFTY THREE DAYS LEFT! \n\n               HAMIDOU takes out a KNIFE and cuts the consul's tie in \n               half.  DAVIS falls backwards.\n\n               BILLY is hauled now. back, still gripping half the tie.  \n               He is trembling now.\n\n                                     BILLY\n                         I HAVE FIFTY THREE DAYS LEFT!\n\n               DAVIS is shaken. He has red bar marks across his face and \n               is absent-mindedly trying to adjust half a tie as he looks \n               at:\n\n               BILLY being hauled out by HAMIDOU, SCREAMING something \n               indistinct.\n\n                                                                    CUT:\n\n               COURTROOM. Same as before.\n\n               BILLY, in the prisoner's dock, addresses the Court; as he \n               speaks, a Turkish TRANSLATOR. drones underneath his voice \n               level:\n\n                                     BILLY\n                         ...What is the crime?  And what is \n                         the punishment?  The answer seems \n                         to vary from place to place, and \n                         from time to time. What's legal \n                         today is suddenly illegal tomorrow \n                         cause some society says it's so; \n                         and what's illegal yesterday all \n                         of a sudden gets legal today because \n                         everybody's doing it and you can't \n                         throw everybody in jail. Well I'm \n                         not saying this is right or wrong.  \n                         It's just the way things are....\n\n               YESIL the lawyer; DAVIS the consul.\n\n               THE PRESS GIRL from the previous trial in the short skirt.\n\n               BILLY\n\n                                     BILLY\n                              (continuous)\n                         But I spent the last three and a \n                         half years of my life in your prison \n                         and I think I paid for my error \n                         and if it's your decision today to \n                         sentence me to more years, I... \n                         I...\n                              (a break)\n                         You know my lawyers told me 'be \n                         cool\n                         Billy don't get upset, don't get \n                         angry, if you're good I can maybe \n                         get a pardon, an amnesty, an appeal, \n                         this that and the other thing.' \n                         Well that's been going down now \n                         for 35 years...\n\n               YESIL looks over, surprised he is talking like this. Looks \n               at DAVIS.\n\n               BILLY.\n\n                                     BILLY\n                              (continuous)\n                         And I've been playing it cool and \n                         I've been good and now I'm damn \n                         tired of being good cause you people \n                         gave me the belief that I had 53 \n                         days left.  You hung 53 days in \n                         front of my eyes and then you took \n                         those 53 days away, and Mister \n                         Prosecutor!  I just wish you \n                         could...\n\n               PROSECUTOR looks over, through his dark green glasses.\n\n                                     BILLY (OVER)\n                         ... stand right here where I'm \n                         standing and feel what that... \n                         ...feels like, cause then you'd \n                         know something you don't know you'd \n                         know what means, Mister Prosecutor \n                         and you'd know the concept of a \n                         society is based on the quality of \n                         its mercy means, of its sense of \n                         fair play, its sense of justice... \n                         but\n                              (shrugs and scoffs \n                              at himself)\n                         I guess that's just like asking a \n                         bear to shit in a toilet...\n\n               TRANSLATOR stops, looks puzzled.\n\n               BILLY \n\n                                     BILLY\n                              (same self-mocking \n                              tone)\n                         For a nation of pigs, it's funny \n                         you don't eat them.  Fuck it, give \n                         me the sentence. Jesus forgave the \n                         bastards, but I can't. I hate you.  \n                         Nation. I hate your I hate your \n                         people. And I fuck your sons and \n                         daughters!\n\n               Sits down, disgusted; under his breath:\n\n                                     BILLY\n                         ...cause you're all pigs.\n\n               SILENCE in the uncomfortably. courtroom.  PEOPLE looking \n               at each other DAVIS looks down.\n\n               YESIL flips some pages abstractedly.\n\n               TRANSLATOR SCARED:\n\n                                     TRANSLATOR\n                         Would Your honor like me to \n                         translate?\n\n               THE OLD CHIEF JUDGE, the same one as before Shakes his \n               head.\n\n                                     JUDGE\n                         That won't be necessary\n\n               ANOTHER ANGLE - THE JUDGE turns to BILLY in the foreground \n               rises, and unexpectedly crosses his wrists out in front of \n               him.\n\n                                     JUDGE\n                              (emotionally)\n                         My hands are tied by Ankara!\n\n               Makes the gesture of the hands forcefully, with anger.\n\n                                     TRANSLATOR (OFF)\n                         My hands are tied by Ankara!\n\n               BILLY WATCHING,\n\n                                     JUDGE (OFF)\n                         I must sentence you, Vilyum Hiyes...\n\n               JUDGE\n\n                                     JUDGE\n                         ... to be imprisoned at Sagamilcar \n                         for a term no less than thirty \n                         years...Getchmis olsun\n\n                                     TRANSLATOR (OFF)\n                         \"I must sentence you, Vilyum Hiyes, \n                         to be imprisoned at Sagamilcar for \n                         a term no less than years... \n                         \"Getchmis Olsun\"\n\n               As he translates, the JUDGE unable to control his emotion \n               exits rapidly, not looking at Billy, followed by the TWO \n               OTHER JUDGES.\n\n                                     TRANSLATOR (OFF)\n                         \"May it pass quickly.\"\n\n                                                                    CUT:\n\n               THREE OLD GLEANING WOMEN swathed in black like three fates \n               turn from their sweeping as BILLY is led out COURTROOM \n               NUMBER SIX down a long stone corridor. Dust floats through \n               long slanting shafts of yellowish light, like a striped \n               leotard dream.  BILLY walks, his eyes straight ahead - \n               determined.\n\n                                     SONG OVER (BELL)\n                              (old Southern blues \n                              beat, improvised)\n                         \"Mmmmm... got the blues babe, \n                         Got those old Istanbul blues, \n                         Said Yeah, I got the blues babe \n                         Got those old Istanbul blues...  \n                         Thirty years in Turkey, babe, \n                         Ain't got nothing left to lose...\"\n\n                                                                    CUT:\n\n               BELL sings it, strumming sloppily but with feeling on his \n               guitar.  BILLY lies, his back up, on his BUNK nearby.  \n               MAX, stoned, sits at the base of the bunk. It is NIGHT. \n               The song falters, but MAX now joins in, improvising:\n\n                                     SONG OVER (MAX AND BELL)\n                         \"Busted at the border \n                         Two keys in my shoes \n                         Said I was busted at the border \n                         with two keys in my shoes \n                         An they gave me thirty years, babe \n                         To learn the old Istanbul blues...\"\n\n               SEVERAL TURKS are partying it up down at the other end of \n               the SECOND FLOOR KOGUS, playing a \"sas\" - Turkish type \n               guitar, counterpointed by a little drum; the music is \n               stridently Turkish, and one of the men does a belly-dance \n               in underpants with two lemons masquerading as breasts under \n               his shirt. The LOUD TWANGING of Bell's GUITAR can be heard \n               OFF, interrupting them. They are annoyed.\n\n               BELL leading MAX into the next stanza:\n\n                                     SONG OVER (MAX AND BELL)\n                         \"I said Lord now save me \n                          Please save me from this pain\"\n\n               BILLY, touched - listening, thinking.\n\n                                     SONG OVER (OVER)\n                         \"I said Lord come and save me, \n                         Come save me from this pain \n                         Come set me free sweet Jesus...\"\n\n                                     TURK (OFF)\n                         Hey knock off that shit music...\n\n               TWO TURKS from the party walk up, waving at BELL's guitar,  \n               annoyed.\n\n                                     TURK\n                         ...We're playing the sas.\n\n                                     BELL\n                              (understanding their \n                              Turkish)\n                         Omina koyden your sas!\n                         (Put your sas in your cunt!)\n\n               THE TWO TURKS tense, the mood changing.\n\n               BELL gets even angrier, puts the guitar aside, ready to \n               spring.\n\n                                     BELL\n                         ...And besides that I fuck Allah \n                         and I fuck your Muslim mother too...\n\n               They don't understand but one of them is reaching into his \n               pants for his shiv.\n\n                                     BELL\n                         You got that, shit face? Asina...\n\n                                     BILLY (OFF)\n                         KNOCK IT OFF!\n\n               ANOTHER ANGLE BILLY is moving fast between the TWO TURKS \n               and BELL. A new authority in his voice, and controlled \n               anger in his face.\n\n                                     BILLY\n                              (to Bell)\n                         Cut it!  No more fights.\n\n               BELL looks.\n\n                                     BILLY\n                         We're getting out of here.\n\n               BELL astonished.\n\n                                                                    CUT:\n\n               BILLY, with Max's little screwdriver and a metal spoon, \n               digs hard at the cracks around a dark stone in the SINK \n               ROOM, FIRST FLOOR KOGUS.  With him is MAX working on the \n               same stone. They are sweating, shirtless, looking back \n               over their shoulders at:\n\n               BELL guarding the STAIRS.\n\n               BILLY works the stucco out, jiggling with the stone (about \n               a nine inch circumference) using his fingers and \n               screwdriver.  Painful work.\n\n                                     BILLY'S VOICE\n                         Dear Susan. It's taken me a long \n                         time to find out that it's got to \n                         stop somewhere. I've learned \n                         painfully not to trust the Turks, \n                         the courts, the lawyers, the Consul, \n                         the United States Government, and \n                         not even my loving parents. There \n                         is only one way out of here.. The \n                         Midnight Express.\n\n               BILLY kicks with his sneakers at the stone, as silently as \n               possible. A LOUD NOISE - crumbling dust, stucco.\n\n               BELL at the stairs freezes, fearful. Then SILENCE.  He \n               Runs over.\n\n               MAX, BELL, BILLY.\n\n                                     MAX\n                              (in a whisper)\n                         We're undermining the other stones!\n\n               BELL studies it, pointing to the stone above left the one \n               that has been loosened.\n\n                                     BELL\n                         We gotta take a chance and do that \n                         one next - \n                              (pointing)\n                         Then pull out this one -\n                              (pointing to the \n                              one directly left \n                              of the loosened  \n                              stone, excited)\n                         Just jiggle it, scratch it out, \n                         loose nit up, it's soft real soft!\n\n               BILLY has his head pressed close to the loosened stone.  \n               Suddenly:\n\n                                     BILLY\n                         It's there!\n\n                                     BELL\n                         What?\n\n                                     BILLY\n                         Listen!\n\n               ANOTHER ANGLE - all THREE press their ears to the stone.  \n               A silence. The faintest whisper of WIND and dripping 'WATER -  \n               indicating a shaft of some nature. BELL looks back at BILLY.\n\n                                     BELL\n                         I told you, I told you you cock-\n                         suckers!  You didn't believe me.\n\n               BILLY smiles. MAX reaches over and grabs Bell's face between \n               his hands, kisses him violently.\n\n                                     MAX\n                         Fuck me! You beautiful mother, \n                         you!\n\n                                                                    CUT:\n\n               MAX now on guard at the STAIRS, looks over at:\n\n               BELL AND BILLY - with fresh paste putting the finishing \n               touches on the edges of the stone which has been replaced \n               in its original position. Bell's half naked torso reveals \n               a pair of dice with lucky sevens tattooed on his shoulder.\n\n                                                                    CUT:\n\n               THE REPLACED STONE. On close inspection, it is apparent \n               that the stucco around it doesn't match the other stones \n               one bit, but as we PULL BACK to see ZIAT washing his tea \n               cups in the SINK during the DAY, this irregularity is lost \n               in the greater mosaic of the wall structure. At least ZIAT \n               doesn't notice as:\n\n               BILLY nervously comes into the SINK area, watching him, \n               and calls to him.\n\n                                     BILLY\n                              (using Turkish)\n                         Hey, Ziat, hurry up with the tea \n                         will ay!\n\n                                     ZIAT\n                              (mutters to himself)\n                         Work, work, work, that's all do\n\n                                     BILLY\n                         I don't hear you bitch about the \n                         money.\n\n               BILLY followed by ZIAT into the KITCHEN casts a look of \n               relief at:\n\n               BELL and MAX who wait at a table with empty tea cups. \n               \n\n                                                                    CUT:\n\n               A HORDE OF COCKROACHES stream out from a crack in the stone \n               as BILLY and MAX dig, scrape, jiggle the third stone. Both \n               covered with sweat, working with confidence now.\n\n               A DARK EMPTY SHAFT on the other side. Dripping water.  Two \n               stones removed.\n\n               BELL runs over:\n\n                                     BELL\n                         Want me to take over?\n\n                                     BILLY\n                         You want to split your hernia again?\n\n                                     MAX\n                         Get off our tits!\n\n               Bell turns to go. Suddenly a LOUD CRUMBLING NOISE and:\n\n               A FOURTH STONE starts to go - but brakes itself.\n\n               BILLY, MAX, BELL all framed in a posture of fear -- not \n               daring to move.\n\n               SECOND STORY KOGUS remains silent.\n\n               BELL looks up the STAIRS, tiptoes back, indicating they \n               are clear.\n\n               MAX AND BILLY. All THREE of them look:\n\n               THE THREE A HALF STONE SPACE. Easily big enough for them \n               to squeeze through. BILLY shines a candle in the shaft, \n               OFF.\n\n               THE THREE look at each other. The same thought. Eager eyes.  \n               The TRAIN WHISTLES by in the night, OFF.\n\n                                     BELL\n                              (sudden)\n                         Let's go!\n\n               BILLY looks at his watch, hates to do it. Shakes his head.\n\n                                     BILLY\n                         No. No time. Put 'em back.\n\n               MAX groans to himself.\n\n                                                                    CUT:\n\n               BILLY tense and restless at his BUNK TWILIGHT. A loud RADIO \n               OFF - Turkish News.\n\n                                     BILLY\n                         We go early. Any fuck-ups we should \n                         be back here and have the stones \n                         in by dawn.\n\n               ANOTHER ANGLE - MAX, BELL, AND BILLY. A pause.\n\n                                     BILLY\n                         You got your stuff?\n\n                                     MAX\n                         Yeah.\n\n                                     BELL\n                              (persistent)\n                         Haps, railroad, bus timetables?\n\n                                     MAX\n                              (business-like)\n                         Everything.\n\n                                     BILLY\n                         Okay.\n                              (looks around the \n                              group)\n                         Let's do it.\n\n               He extends his hands and the other two cross in a six-handed \n               shake.\n\n                                                                    CUT:\n\n               MAX signals down the STAIRS - \"all clear\".\n\n               BILLY going through the HOLE in the STONES that NIGHT into:\n\n               A DARK SHAFT spookily leading downwards. He lights a thick \n               CANDLE tied horizontally across his sneakers so as to give \n               him his light source where his footholds are.  His P.V.O:\n\n               PART DUMBWAITER SHAFT, PART WATER WELL from a previous \n               century A series of corrugated mossy old footholds and \n               iron spikes lead down at irregular intervals.\n\n                                                                    CUT:\n\n               BILLY, MAX AND BELL, each with their own foot candle, are \n               spaced along the shaft easing downwards. BILLY looks up at \n               MAX about ten feet above.\n\n                                     BILLY\n                         Okay?\n\n                                     MAX\n                         Yeah! \n\n                                     BILLY\n                         Jimmy?\n\n                                     BELL\n                              (struggling.)\n                         What?\n\n                                     BILLY\n                         How's your hernia?\n\n                                     BELL\n                         Don't make me laugh.\n\n               BILLY in a sweat, slips. A tense moment - then he catches \n               himself.  OFF - the TRAIN WHISTLE can be heard, echoing \n               into the shaft.Mixed suddenly with LOUD TALKING OFF. Arguing \n               in Turkish.  BILLY freezes, signals upwards with a sharp \n               hiss of breath.\n\n                                     VOICE #1 (OFF)\n                         What do you mean, you forgot, he'll \n                         have my ass!\n\n                                     VOICE #2 (OFF)\n                         Well I can't do two things at once, \n                         you were supposed to be here at \n                         nine o'clock!\n\n               BILLY identifying the relative location of the voices, \n               eases downwards, coming to a GRILL, looks in at:\n\n               A BASEMENT ROOM with FURNACE. TWO TURKISH GUARDS throw the \n               prison rubbish in the furnace, still arguing, AD LIB.\n\n               BILLY signals upwards.\n\n               REVERSE ANGLE, from inside the basement, of BILLY slipping \n               past the grill, his face sharply illuminated by the flame \n               of the furnace.\n\n               Off the walls around the grill we can see the GIANT \n               SILHOUETTES of the two guards still arguing.\n\n               BILLY comes to the base of the shaft. A puddle of scummy \n               water.  Unstraps the candle. A current of WIND He peers \n               around.\n\n               P.O.V. - A WINDING NARROW CATACOMB, WITH BEEHIVE BURIAL \n               PLACES ON BOTH SIDES.\n\n               BILLY, sniffing the stench, unrolls a ball of THREAD ties \n               it to a marker and heads in.\n\n                                                                    CUT:\n\n               BILLY, BELL and MAX are in the catacomb. A scratchy hideous \n               sound and:\n\n               BATS fly out squealing from the ceiling.\n\n               THE BOYS hit the ground as BATWINGS flap over them, \n               colliding against each other, knocking off walls, \n               SCREECHING, then diminishing in sound. Fewer and fewer. \n               Then gone.\n\n                                     MAX\n                              (looking up, scared)\n                         Jesus!\n\n               BILLY looking up. \n\n                                     BILLY\n                         Anybody bitten?\n\n               ANOTHER ANGLE\n\n                                     BELL\n                         Nah, just covered with batshit!\n\n                                     BILLY\n                              (getting to his \n                              knees)\n                         They went out over there: must be \n                         some kind of exit.\n\n               Heads in that direction.\n\n                                                                    CUT:\n\n               A HUGE SPIDER scatters off, as BILLY's CANDLE illuminates:\n\n               ANOTHER ENDLESS WALKWAY.  BILLY comes to a stop - \n               frustrated.\n\n                                     BILLY\n                         Let's go back the other way.\n\n               INTERSECTION Two walkways.  BELL leads in, unwinding the \n               thread, stops.\n\n                                     BELL\n                              (desperate)\n                         The fuck are we?\n\n               BILLY comes into view, equally frustrated.\n\n                                     BILLY\n                         What time is it?\n\n                                     MAX\n                         Two thirty.\n\n               ANOTHER MAZE of walkways. The three stop exhausted, faces \n               blackened.  BILLY, in utter rage and frustration starts \n               kicking the wall.\n\n                                     BILLY\n                         Shit!  Shit!  Shit!\n\n                                     MAX\n                              (slumping to the \n                              ground)\n                         It's a dead end. The Turks musta' \n                         sealed it up.\n\n                                     BELL\n                         What the fuck we gonna do?\n\n               SILENCE as the three pathetic escapees ponder their fate.\n\n               BILLY, getting a grip on himself, thinking.\n\n                                     BILLY\n                         We go back.\n\n               ANOTHER ANGLE\n\n                                     MAX\n                         What?  You gotta be joking.\n\n                                     BILLY\n                              (resolute)\n                         We go back, seal it up again, and \n                         come in tomorrow night - every \n                         night 'till we get out of here.  \n                         There's gotta be a way. Those bats \n                         got out someplace.\n                              (rises)\n                         Now let's go.  Doubletime!\n\n               Takes the THREAD and starts to follow it back.\n\n                                                                    CUT:\n\n               THE SHAFT. BILLY leads the climbers UP.\n\n               MAX reaches a new foothold, stops, getting his breath.  \n               Looks down at BELL heavy breathing OFF.  Urging him on.\n\n                                     MAX\n                         You gotta have a lot of balls for \n                         this \n                         \n\n               BELL, suffering, can't help but grin.\n\n                                     BELL\n                              (murmurs)\n                         Count me out.\n                              (to himself, shaking \n                              his head)\n                         Who ever heard of anybody sneaking \n                         back into a fucking jail?\n\n               MAX overhearing it.\n\n                                     MAX\n                         Yeah, what if got caught?\n\n               BELL starts to giggle.\n\n                                     BILLY (OFF)\n                              (up the shaft)\n                         Hey Max, don't make the dummy laugh.\n\n               MAX laughing, shaking his head.\n\n                                     MAX\n                              (between giggles)\n                         Who's laughing?  I mean I find \n                         this terribly depressing... Can \n                         you see old Hamidou's face when he \n                         tries to figure this one out?\n\n               BILLY can't go on, starts to giggle at the thought.\n\n                                     BILLY\n                              (between giggles)\n                         We'll tell him we were checking \n                         out our escape route.  We wanted \n                         to be completely sure before we \n                         tried it.\n\n               ANOTHER ANGLE - the THREE of them, spaced along the shaft, \n               are all giggling hysterically. Echoing. HOLD ON them.\n\n                                                                    CUT:\n\n               BILLY comes through the HOLE in the stones in the SINK \n               AREA.  It is still NIGHT.  He looks around - silence. MAX \n               follows through the hole.\n\n                                                                    CUT:\n\n               BILLY and MAX work fractically to seal up the STONES.\n\n               BELL, exhausted, is at the STAIRS guarding. Distant early \n               morning SOUNDS of prison waking up.  We feel they will be \n               spotted this time, but:\n\n                                                                    CUT:\n\n               BILLY slumps into his BUNK as the first rays of LIGHT come \n               up in the sky and the CHANT from the Mosque commences.  He \n               immediately sinks into sleep.\n\n               CLOSE on OLD TEA LEAVES being washed in the SINK.  A MILKY \n               WHITE EYE follows into view.  ZIAT is preparing his early \n               morning tea, his good eye now moving to something beyond \n               the tea leaves. Curious, he straightens, throwing the \n               withered bunch of leaves the sink.\n\n               ZIAT approaches the irregular stucco paste around the \n               REPLACED STONES; runs his fingers along the ridges, noticing \n               the paste is fresh.\n\n               BILLY snoring from fatigue.  BELL wakes him quickly.\n\n                                     BELL\n                         Billy, wake up!  They found it!\n\n               OFF there is a lot of SHOUTING downstairs.\n\n                                     BILLY\n                         Who?\n\n                                     BELL\n                         Ziat! \n\n                                                                    CUT:\n\n               BILLY standing in a group of PRISONERS with BELL and MAX. \n               He has a look of total despair on his face, as he watches.  \n\n               THE SINK.  PRISONERS are everywhere jabbering excitedly \n               among themselves.  ZIAT is conferring with HAMIDOU as GUARDS \n               rip out the last stone, revealing the HOLE leading to the \n               SHAFT.\n\n               BILLY's gaze shifts to ZIAT fixing all his hatred on him.\n\n               ZIAT grinning, moves away, and his falaka stick cocked \n               like a sergeant major - moves among the prisoners.\n\n                                     HAMIDOU\n                         Shut up! \n\n               They all fall immediately silent.  HAMIDOU continues his \n               walk among them, bypassing:\n\n               MAX who shifts his gaze onto:\n\n               BILLY.  HAMIDOU approaches, his eyes moving over BILLY \n               with contempt, and shifting him aside with the stick. To \n               him Billy is the same passive prisoner as before. He moves \n               on, shifting OTHERS aside and then stops at:\n\n               BELL.  HAMIDOU swings his stick up slowly and taps him \n               lightly on the chest. BELL realizes and is afraid.\n\n                                     HAMIDOU\n                         No do!  No do!  I tell you I see \n                         you again.. Finish!\n\n               He punctuates this last with a theatrical tap on the chest \n               and he gestures to the GUARDS.\n\n                                     HAMIDOU\n                         Take him!\n\n               BELL, already broken by bad beatings, shivers.\n\n                                     BELL.\n                         No!  Oh no!  No...\n\n               GUARDS grab him, hurry him out the Kogus behind HAMIDOU\n\n               BILLY holds himself rigid, trying not to break. Bell's \n               PROTESTS continue OFF.\n\n               MAX unable to contain his anger, strides right up to ZIAT, \n               collars him, livid.\n\n                                     MAX\n                         You bastard! This time I'm gonna \n                         kick your fucking brains all over \n                         this kitchen!\n\n                                     ZIAT\n                              (calm)\n                         Fine.  Good.  Man to man.  We fight \n                         now.  And when finish I bring \n                         Hamidou and he kick you fuckinq \n                         ass.\n\n               MAX is about to swing when BILLY grabs him.\n\n                                     BILLY\n                         Max! Cool it!\n                              (looking at Ziat \n                              calmly)\n                         Ziat's just doing his job.\n\n               ZIAT Glances from BILLY back to MAX fixing on him as BILLY \n               walks him away.\n\n                                                                    CUT:\n\n               MAX is at his BUNK that NIGHT; puts away the hypodermic \n               needle, stoned and speeding at the same time, smoking a \n               cigarette.  BILLY inwardly tense, sits with his head in \n               his hands.\n\n                                     MAX\n                         Bell's gonna talk. They got to \n                         find out. Man, we gotta out.\n\n               Tears have formed in his eyes.\n\n                                     MAX\n                         Goddamn Gastro's killing me.  Making \n                         me blind. Hey Billy!\n\n                                     BILLY\n                              (sympathetic)\n                         Yeah.\n\n                                     MAX\n                         I got some acid man.  Maybe we can \n                         drop some on the guards huh? In \n                         their tea or something.\n\n               BILLY looks away, not even considering. But MAX is caught \n               up in the notion.\n\n                                     MAX\n                         Yeah I got it all worked out.  \n                         Billy, listen to me.\n                              (looks at Billy, \n                              his eyes glazed)\n                         That old guard likes you, You drop \n                         some acid on him.  When he's Seeing \n                         rainbows yer know. walk out - \n                         tonight.\n\n                                     BILLY\n                         Then we're outside the kogus.  \n                         Then what?\n\n                                     MAX\n                         What? \n\n                                     BILLY\n                         After we're outside the kogus?\n\n                                     MAX\n                         Oh we... we...\n\n                                     BILLY\n                         Max... Your BILLY shirt's on fire...\n\n               MAX clumsily brushes the burning ash off his shirt where \n               it's made a hole.\n\n                                     MAX\n                         Oh shit!  Oh Christ! \n\n               His eyes cloud with tears.  He sits down, head between his \n               hands.\n\n                                     MAX\n                         There just comes a time you know...  \n                         you know you're never going to git \n                         it on.\n\n               Suddenly shifts mood again, stands, pulling out a SHIV, \n               resolute, eyes brightening.\n\n                                     MAX\n                         That's what I'm gonna do.\n                              (giggles)\n\n               BILLY looks up wondering.\n\n                                     BILLY\n                         What?\n\n                                     MAX\n                              (crazily)\n                         Cut his fucking throat.\n\n                                     BILLY\n                         Whose?\n\n                                     MAX\n                         ZIAT... What do I got to lose huh!  \n                         What do I got to lose. And I'd \n                         really enjoy it. \n\n               Lurches against the bunk.\n\n                                     BILLY\n                         Max, sit down. You're in no shape \n                         to kill anybody.\n\n                                     MAX\n                         I want to cut his throat.\n\n                                     BILLY\n                         It's already been cut.\n\n                                     MAX\n                         Then I'll cut his balls off.\n\n               BILLY smiles, shakes his head, then:\n\n                                     BILLY\n                         If you really wanted to hurt Ziat\n                              (pause)\n\n               MAX slumps back down on the bunk, suddenly tired of killing.\n\n                                     BILLY\n                              (reflective)\n                         ...His money - steal that, you \n                         steal his blood... Could you see \n                         his face when everything he worked \n                         so hard to get got snatched?\n                              (plays with the \n                              thought idly, then \n                              shrugs)\n                         If we knew where he hid it.\n                              (waves it away)\n                         Anyway, steal from him they'd pick \n                         up the whole prison and shake it \n                         sideways.  We couldn't hide it \n                         anywhere.\n\n                                     MAX\n                              (head bobbing now, \n                              murmurs)\n                         You know where it is?\n\n                                     BILLY\n                         What?\n\n                                     MAX\n                              (a vague grin)\n                         I know where it is.\n\n               BILLY glances at him, not sure whether he heard.\n\n                                     BILLY\n                         His money?\n\n               MAX gives him a goofy nod - and a grin. Imitating Robert \n               Newton as Long John Silver.\n\n                                     MAX\n                         'Dem dat hides can finds says I'... \n                         I seen him, the clever tit, sneaking \n                         looks at it late at night, talking \n                         to it.\n\n                                     BILLY\n                              (beginning to believe \n                              him)\n                         Yeah? Where?\n\n               MAX, distracted, let's his attention wander back.  Inaudible \n               his head bobbing now.\n\n                                     MAX\n                         Hishradyo.\n\n                                     BILLY\n                         Max - where?\n\n                                     MAX\n                              (his mouth hanging \n                              open, eyes closed)\n                         His radio Back of his open, radio...\n\n               He lurches over gently on the bunk.\n\n                                     MAX\n                         That's why he never plays it... \n                         \n\n               MAX Sleeps.\n\n               BILLY surprised, then reflective.\n\n                                                                    CUT:\n\n               THE BACK OF THE RADIO is unscrewed; the cover pulled off. \n               EMPTY!\n\n               MOVE TO ZIAT.  The look is as Billy expected. Horror, shock, \n               anger, fear.  ZIAT SCREAMS hysterically like old Greek \n               widow and:\n\n               BEATING HIS CHEST and tearing at his hair, ZIAT runs out \n               of the KOGUS wailing, moaning.\n\n                                                                    CUT:\n\n               THE SECOND STORY KOGUS is being\" controlled\" by the GUARDS.  \n               WIDE ANGLE reveals a circus of clockwork destruction as \n               the GUARDS, making abundant NOISE, systematically rip up \n               each bunk, locker, mattress, picture, book, etc., their \n               faces flushed with this opportunity for orgy.\n\n                                                                    CUT:\n\n               THE PRISONERS are lined up in the COURTYARD, each one being \n               body searched.Prominent are MAX and BILLY, looking up amused \n               at the\n\n               SECOND STORY WINDOWS - feathers from a mattress fly around.  \n               ZIAT Briefly appears, his face at the window, looking at \n               the prisoners in the yard, frustrated.\n\n               HAMIDOU breaks apart a with his bare hands.\n\n               ZIAT is stripping MAX's possessions, sure he will find it \n               here.\n\n                                     VOICE (OFF)\n                         Down here!\n\n               Ziat springs up.\n\n               GUARD calling out from the STAIRS.\n\n                                     GUARD\n                         We found it!\n\n                                                                    CUT:\n\n               ZIAT leaning in CLOSE, OVER THE STOVE in the KITCHEN, framed \n               by GUARDS. It is the same crouched posture he always uses \n               to work the stove but now his eyes show complete despair \n               as he sees:\n\n               A THOUSAND SHREDS OF PAPER MONEY floating in his pots amid \n               his withered tea bags. From ashes to ashes and dust to \n               dust.\n\n               ZIAT folds his head into his hands, sobbing then wailing \n               very human, very sad.\n\n                                                                    CUT:\n\n               KITCHEN - NEGDIR an Arab, is now running the tea concession.  \n               A jolly ebullient man. Pours a cup for MAX. Several OTHERS \n               are at the table.\n\n                                     NEGDIR\n                              (heavily accented \n                              English)\n                         ...He sell me tea business - \n                         everything.  No the same. Ziat \n                         lose all...\n                              (makes the gesture \n                              towards the heart \n                              and the gut, using \n                              the Arabic word)\n                         Heart!  Soul! \n\n                                     MAX\n                         He never had one.\n\n                                     NEGDIR\n                         Soon he go back streets Istanbul.  \n                         Thousand enemy.  No money.\n                              (makes throat cutting \n                              gesture)\n\n                                     MAX\n                         I'll drink to that.\n                              (toasting with the \n                              tea)\n\n               Just as:\n\n               ZIAT enters the kitchen; he eyes Max with hatred, sits at \n               the other TABLE and orders tea. Surprisingly, he is wearing \n               a suit and clean shirt-unlike his usual grimy appearance.\n\n               BILLY, looking shaken, enters the kitchen, glances at ZIAT \n               sits with MAX.\n\n                                     BILLY\n                         Just got some news on Bell.\n\n                                     MAX\n                         What? \n\n                                     BILLY\n                         Bad. Sent to the City Hospital.  \n                         They ruptured his hernia again.\n\n                                     MAX\n                              (grim)\n                         Oh shit. \n                         \n\n                                     BILLY\n                         I Guess he didn't talk...Poor \n                         bastard.\n\n               BILLY glances over at:\n\n               ZIAT drinking tea.\n\n               BILLY AND MAX\n\n                                     BILLY\n                         Why the suit?\n\n                                     MAX\n                         Maybe he's changing jobs.\n\n                                     VOICE (OFF)\n                         SAYIM!  SAYIM!\n\n               BILLY looks over to see:\n\n               HAMIDOU and a DOZEN GUARDS spreading through the KOGUS, \n               assembling everybody with shouts of \"SAYIM!\"\n\n                                                                    CUT:\n\n               THE PRISONERS are lined up in ranks in the FIRST FLOOR \n               KOGUS.\n\n               BILLY glancing at MAX next to him, wondering why.\n\n               HAMIDOU goes down the line, his FLUNKIES searching each \n               man.\n\n               A GUARD reaches into ZIAT'S pocket and comes out with a \n               matchbox. Yells to HAMIDOU who comes over.\n\n                                     HAMIDOU\n                              (opening the matchbox)\n                         Nebu?\n\n               MATCHBOX Containing a small amount of HASHISH.\n\n               HAMIDOU reaches over and pulls ZIAT out of the 'line \n               roughly.\n\n                                     HAMIDOU\n                         Nebu? \n\n               Starts to slap him around.\n\n               BILLY glancing at MAX.\n\n                                     MAX\n                              (worried)\n                         What's going on?  Maybe Ziat can't \n                         pay off; Hamidou's taking it out \n                         in trade.\n\n               HAMIDOU smashes ZIAT again, but pulls the punch.\n\n                                     HAMIDOU\n                         Where did you get this hash?\n\n               Raises his arm again.\n\n                                     ZIAT\n                              (cowering, pretending \n                              fear)\n                         From Max.\n\n               Point at: \n\n               MAX who stiffens, eyes like cracked eggs.\n\n                                     MAX\n                              (under his breath)\n                         You got to be kidding.\n\n               HAMIDOU peers at MAX, advances.\n\n                                     HAMIDOU\n                         What's happening with this hash?\n\n               Indicates the matchbox in his hand.\n\n                                     MAX\n                         I didn't sell it to him. I don't \n                         have anything to do with this, \n                         I...\n\n                                     HAMIDOU\n                              (leans closer)\n                         I know your face. Where did you \n                         get the hash?\n\n                                     BILLY\n                              (interrupting in \n                              Turkish))\n                         (He knows nothing about it.  Ziat's \n                         lying.\n\n                                     HAMIDOU\n                              (turns on Billy, in \n                              English)\n                         You, goddamn you, shut up!\n                              (Back to MAX)\n                         Take him to the cellar)\n\n               GUARDS drag off.\n\n                                     MAX\n                         Get out of here! He's lying!  That \n                         cock-sucker!  Billy...?\n\n                                                                    CUT:\n\n               BILLY sits on his his anger building, his imagination \n               running wild.\n\n                                                                    CUT:\n\n               MAX being dragged down a CORRIDOR by his feet. A SCREAM.\n\n               BILLY\n\n                                                                    CUT:\n\n               BELL, his features distorted, being carried into an \n               AMBULANCE.\n\n                                                                    CUT:\n\n               BELL, MAX and BILLY at the wall, digging together, MAX \n               hugging BELL the time they found the shaft.\n\n                                                                    CUT:\n\n               MAX twisting out of the grip of a GUARD and, grabbing the \n               glass from his smashed spectacles, he cuts deep into his \n               wrist.  GUARDS grab him. A LOUD LAUGH OFF carrying over.\n\n               BILLY turning on his bunk to see:\n\n               ZIAT joking with TWO GUARDS as he enters the SECOND STORY. \n               The guards back down the stairs.\n\n               BILLY already in movement.\n\n               ZIAT, in his suit, collecting suitcase from his bunk, \n               preparing to leave.\n\n                                     VOICE (OFF)\n                         ZIAT! \n                         \n\n               Turns and catches a FIST in the side of the face.  Staggers \n               into a bunk.\n\n               BILLY, fists clenched, yells a string of Turkish curse \n               words at him:\n\n                                     BILLY\n                         Asina covacim, ipnave \n                         pesankek...yosakt. \n\n               Lunges.\n\n               ZIAT is bulky, throws the smaller BILLY off and scrambles \n               past a bunk.\n\n               BILLY is up and after him. Jumps back as a SHIV cuts the \n               air in front of him. His side is cut.\n\n               ZIAT holding the shiv, feints, cursing BILLY in Turkish.\n\n               BILLY skips back, takes a MATTRESS off the bed and runs it \n               right into KNOCKING HIM AND THE WHOLE BUNK OVER.\n\n               THE TWO scramble around, BILLY tackling him into another \n               BUNK which also goes over. Chairs break.\n\n               ZIAT butts his head into BILLY'S jaw.\n\n               BILLY staggers back from the blow and ZIAT jumps him, BITING \n               into his ear.\n\n               ZIAT, getting a better hold, now BITES into BILLY'S NOSE.\n\n               BILLY slams ZIAT in the nose hard with the palm of his \n               hand.  ZIAT relinquishes his hold, grabbing at his broken \n               bleeding nose.\n\n               BILLY beats him around the head but though the blood now \n               flows and teeth are broken, is like a clumsy bear, hard to \n               kill.\n\n               ZIAT scrambles away on his knees under another BUNK now \n               screaming as loud as he can.\n\n                                     ZIAT\n                         HELP ME!  GUARDS!  HELP ME!\n\n               SEVERAL PRISONERS watching from further down the SECOND \n               STORY Kogus now move in sync, turning on their RADIOS loud \n               as possible, drowning out the cries for help, others \n               watching the stairs.\n\n               BILLY takes the BUNK and throws it over, revealing ZIAT \n               cowering in pure terror. He grabs ZIAT by the hair, hauls \n               him up and\n\n               LAUNCHES HIS KNEE into HIS FACE.\n\n               ZIAT thuds onto the floor.\n\n               BILLY stomps him in the gut hard.\n\n               ZIAT screams unnaturally shrill.\n\n               BILLY, driven by supernatural anger, now jumps on him and \n               CLAMPS HIS MOUTH right on ZIAT'S open SCREAM.\n\n               A STRUGGLING KISS ensues.\n\n               BILLY pulls back, his mouth filled with blood, spitting \n               out.\n\n               AN UNIDENTIFIED PIECE OF FLESH which Bits the ground with \n               an odd slow motion grace.\n\n               ZIAT - CLOSE in terror; throat cords rippling; eyes bulging \n               with disbelief, body quivering, mouth open and screaming, \n               but it is a SILENT SCREAM and the mouth is a dark hole \n               filled with blood and without a TONGUE.\n\n               BILLY, without a moment's mercy, crashes his fist into \n               ZIAT'S face.\n\n               ZIAT his strength now broken, collapses on his back.\n\n               BILLY crashes his fist again into the hated face. He is \n               GRABBED now by a GUARD, but:\n\n               ANOTHER ANGLE - BILLY shakes the GUARD OFF, then as ANOTHER \n               GUARD runs up, BILLY SLAMS him aside and, obsessed, lunges \n               back down on ZIAT and\n\n               BOTH HANDS CLAMPED TOGETHER high in the air delivers a \n               final blow to ZIAT'S face. The bones shatter. Pause. His \n               ogre unconscious beneath him, BILLY, now in SLOW MOTION, \n               EXTENDS HIS ARMS IN THE AIR - in the fighter's victory \n               gesture, and his eyes glow with the fever in them, and \n               with his mouth and face bloodied, he looks like a savage. \n               No longer Billy Hayes.\n\n                                                              SHARP CUT:\n\n               BILLY bound in a thick leather belt (a kiyis) which screws \n               tightly around the waist and cinches the hands together, \n               is being HAULED in continuing SLOW MOTION through a huge \n               DOOR somewhere in one of the cavernous corridors of the \n               prison.The door is approximately NINE FEET by SIX FEET, \n               strong and wooden with a circular iron handle which one of \n               the GUARDS now pulls open; a GLIMPSE of darkness within.\n\n               THE DOOR CLOSES. SUPERIMPOSE:\n\n                     SECTION 13 - ASYLUM FOR THE CRIMINALLY INSANE\n\n                                     A YEAR LATER \n\n               MAX, barely recognizable in a torn sheet and with a \n               blackened face, comes rushing into a crowded ROOM, screaming \n               louder than any other inmate. marks on his face, He is \n               enraged, blood dripping from scratch ATTENDANTS in white \n               smocks chase him over the beds. Max is yelling in Turkish.\n\n                                     MAX\n                         Please, will you listen to me?  \n                         Will someone please listen to me?  \n                         JUST LISTEN To ME!\n\n                                     ATTENDANTS\n                         Hamidou! Get Hamidou! Get the \n                         Kiyisl!\n\n               The ATTENDANTS wrestle with him, but he throws them off, \n               tearing around the room mindlessly. In the process we see \n               that not much attention is paid him because everybody else \n               is crazy!  There are 50 other LUNATICS yelling at each \n               other in fights over sheets, blankets, beds, cigarettes, \n               jumping: screaming, pushing, shoving; some babbling to \n               themselves, rocking, crying, chanting, singing.  Several \n               of them (the craziest) are stark naked. some, wrapped in \n               torn blackened sheets, patrol the room like quick ferrets, \n               sharp eyes open for anything they can steal. Others move \n               in meaningless, blank-eyed silence. The walls are filthy \n               black and join the ceilings in arches rather than angles, \n               giving the look of an old dungeon. Fifty beds are lined up \n               right next to each other so that you walk right into your \n               bed.  A constant nerve-racking NOISE. \n                \n               HAMIDOU bursts into the ROOM, the angry look in his eyes \n               spelling real trouble for Max. MOVE with him as he sweep \n               sin on MAX and picks him up with one move and SMASHES HIM \n               against the wall. Max hardly notices.\n\n               ANOTHER ANGLE - HAMIDOU takes the leather kiyis from an \n               ATTENDANT, moves in on MAX and starts clamping it around \n               him.\n\n               AN ATTENDANT walks through the room with an apron containing \n               several large pockets bulging with red, green, blue, white \n               PILLS, which he distributes by the handful. \n               \n\n                                     ATTENDANT\n                              (crying out)\n                         Hop! Hop!  Hop!  Full moon.  Hop!  \n                         Hop!  Hop!\n\n               THE LUNATICS gobble them up as if they were candy. In some \n               of the clustered areas, nine lunatics occupy as little as \n               three beds.\n\n               MAX is tightly bound now by HAMIDOU, but his body arches \n               against the bindings, his neck straining, his teeth snapping \n               at the air.  HAMIDOU grabs him with one hand by the leather \n               waist, hauls him high up in the air and \n                \n               THROWS MAX half-ways across the room, MAX smashing heavily \n               against some beds, continuing to SCREAM OFF as:\n\n               THE ATTENDANT with the pills-now bypasses BILLY on one of \n               the beds.\n\n                                     ATTENDANT\n                         Hop!  Hop!  Full Moon - take your \n                         pills!\n\n               BILLY gobbles them up. He has changed. Lines in his face.\n\n               No smile, no sense of humor; a brooding silence about him, \n               a straight ahead look. He pays no attention to MAX off; he \n               is in grubby white pyjamas and shower sandals. Rolls back \n               onto hi& bed with its filthy torn sheet, totally ignoring \n               the surrounding commotion, and\n\n               ANOTHER ANGLE - turning onto his shoulder, BILLY suddenly \n               finds himself face to face with a dark saddened visage. \n               The MAN is very young and stark naked but for an old black \n               rag wrapped around his head and clutched under his chin. \n               His eyes are yellow, the voice pleading.\n\n                                     YOUNG MAN\n                         Cigare?\n                              (pause, same tone, \n                              holds out his palm)\n                         Cigare? Cigare?\n\n               BILLY shakes his head sharply --too sharply --and barks, \n               irritable.\n\n                                     BILLY\n                         Go away! \n\n               Turns on his other shoulder, trying to sleep.\n\n                                     YOUNG MAN (OFF)\n                         Cigare? Cigare?\n\n               YOUNG MAN in a surprisingly meek tone.\n\n                                     YOUNG MAN\n                         S'il Vous plait, Monsieur? S'il \n                         vous plait?\n\n               BILLY, really aggravated now, springs up from the bed, and \n               in the quirky way the mad and the eccentric adopt walks \n               determinedly away from the young man, looking back to shake \n               his head bizarrely at him one more time.\n\n               ANOTHER ANGLE\n\n               BILLY walking down the aisle bypasses MAX int he kiyis, \n               rolling on the floor, still screaming in Turkish.\n\n                                     MAX\n                         Will you listen to me? PLEASE LISTEN \n                         TO ME!  \n\n               Several LUNATICS are gathered around tormenting him, one \n               of them yanking on his penis as if it were made of rubber; \n               another is playing with his ass. A third one, also in a \n               leather kiyis, is leaning over MAX jabbering and drooling \n               into his face.\n\n               MAX, more enraged by this than the other bodily offences, \n               lunges up sharply and bites the man's FACE. SCREAMS, etc.\n\n               BILLY, paying no attention except for a brief disinterested \n               glance, keeps going into:\n\n               A SECOND ROOM.  MORE  LUNATICS. A screaming OLD MAN is \n               chasing after another OLD MAN who has stolen his tespe \n               beads, waving them back at the first old man who howls \n               with rage, frantic to have his beads back. The second old \n               man throws the beads to a THIRD OLD MAN who hops across \n               the beds with the FIRST OLD MAN chasing him. BILLY \n               intersects.\n\n                                     OLD MAN\n                              (pleading)\n                         Allah!  Allah!  Yok!  Yok!  Yok!  \n                         Brack!\n\n                \n               A LITTLE NERVOUS MAN stares into a broken pocket mirror \n               fingering the large round carbuncle under his eye, trying \n               to rub it away with little grimaces and flurries of nervous \n               motion.\n\n               TWO ATTENDANTS in smocks indifferently finish eating on a \n               newspaper spread across one of the beds; they shake out \n               the paper.\n\n               CHICKEN BONES, ORANGE PEELS hitting the floor. A flurry of \n               movement, as the LUNATICS scuffle like rats over the left-\n               overs. AD LIB curses, yells.\n\n               AN OLD MAN obscenely gestures to BILLY from his bed.\n\n                                     OLD MAN\n                         Hey American.  Fik!  Fick!  Come.  \n                         Fik!  Fik!\n\n               His blackened teeth leer.\n\n               BILLY, seemingly immune to all of this in some private \n               island of his own madness, walks in his determined way \n               past a PARTITION to:\n\n               A CIRCULAR STONE STAIRCASE leading downwards, the stones \n               damp, dark, slippery. BILLY continues with the same straight-\n               ahead determination to:\n\n               A LONER LEVEL. at last BILLY's expression changes to almost \n               childish relief, for here at last is the refuge he seeks \n               the relative comfort and silence of THE WHEEL.  \n\n               It is a grim, squat PILLAR dominating the room and bearing \n               the weight of the ceiling. And around it some SIXTY LUNATICS \n               trudge slowly, near silently, in counter-clockwise flow. \n               It is a hypnotic shuffle and BILLY blends right in, sliding \n               easily into the sluggish, mindless river, his eyes hanging \n               loosely on the floor, watching:\n\n               THE SOOTHING RHYTHM OF FEET shuffling at a comforting pace.  \n               These are the spokes of the wheel.\n\n                                                                    CUT:\n\n               TWO TINY BARE LIGHT-BULBS give faint, eerie illumination \n               to the chamber. One one side, a pot-bellied stove flickers, \n               etching the shadows of the walkers in a strange orange \n               glow.\n\n               SOME LUNATICS, not walking, hover around the stove.  OTHERS \n               are jammed onto a low L-shaped wooden platform that runs \n               the length of two walls. of these men are naked, covered \n               with open running sores over their knees, elbows, buttocks.  \n               But they are much quieter than the upstairs crowd. They \n               are the lowest order of madmen. They have no minds left. \n               They are the damned.\n\n               BILLY walks among them, expressionless. A tall, thin \n               cadaverous TURK with a grizzled beard now shuffles up \n               alongside BILLY, looks at him, walks with him. is about \n               fifty, his pyjamas relatively clean, looking more sane \n               than the average but his eyes are bright and scary and his \n               wet hair is matted down on his head, and big clumps of it \n               have been pulled out. He speaks with a cultured English \n               accent.\n\n                                     AHMET\n                         You're an American?\n\n               BILLY is interrupted but keeps his eyes on the ground.  \n               AHMET doesn't wait for an answer.\n\n                                     AHMET\n                         Ah yes, America!  My name is Ahmet.  \n                         I studied philosophy at Harvard \n                         for many many years. But actually \n                         Oxford is my real Alma  Mata -   \n                         I've also studied in Vienna. Now I \n                         study here.\n\n               BILLY doesn't notice, shuffles along.\n\n                                     AHMET\n                         ...They put me here. They say I \n                         raped a little boy. I have been \n                         here very long time. They will \n                         never let me go.\n\n               BILLY pays no attention, keeps shuffling on.  Glances at \n               him, smiles.\n\n                                     AHMET\n                         They won't let YOU go either.\n\n               The smug certainty of his manner reaches some chord deep \n               inside Billy, because Billy glances briefly at this lunatic \n               who is smiling. Billy looks back at his feet.\n\n                                     AHMET\n                         No, they'll never let you go.  \n                         They tell you they let you go but \n                         you stay. You never go from here.\n\n               BILLY plods on. grins and tries to explain the situation \n               like a father lecturing a child.\n\n                                     AHMET\n                         You see we all come from a factory. \n                         Sometimes the factory makes bad \n                         machines that don't work. They put \n                         them here. The bad machines don't \n                         know they're bad machines, but the \n                         people at the factory know. They \n                         know one of the machines that \n                         doesn't work...\n\n               They walk on.  Ahmet's expression changes.\n\n                                     AHMET\n                              (polite)\n                         I think we have spoken enough for \n                         today.  I say good night to you.\n\n               He wraps his rags around himself quite carefully and we \n               FOLLOW him out of the circle. He drops to his hands and \n               knees and with a sense of dignity, crawls into the filthy \n               blackness under the L-shaped wooden platform, disappearing \n               like a cockroach.\n\n               BILLY plods on.\n\n                                                                    CUT:\n\n               AN OLD WHITE-BEARDED MADMAN the Hoja, grandiose in his \n               rags, leads MUSLIM PRAYER in the first ROOM. Some of his \n               followers have prayer mats, others a scrap of sheet or \n               newspaper; their tones discordant, still pushing and shoving \n               at each other during the prayer.\n\n               TWO SPASTICS can't follow the routine of kneeling and \n               bending; they tangle up absurdly and fall to the floor in \n               a ball of arms and legs.\n\n               A FALAKA STICK pokes BILLY wake SOUND of the CHANTING fills \n               room. It is evidently impossible to distinguish night from \n               day because there are no windows.\n\n               ATTENDANTS poke the LUNATICS awake with their \"clubs.\n\n                                     ATTENDANTS\n                         Head count!  Head count! \n\n                                                                    CUT:\n\n               A MASS OF LUNATICS in the ROOM all at once.  Attendants \n               take a redundant and comic head count. The place sounds \n               like a \"yadi yadi room\" the noise fearsome.\n\n               ANOTHER ANGLE\n\n                                     ATTENDANT #1\n                         Sixty two, sixty three, sixty \n                         four....\n\n                                     ATTENDANT #2\n                         Seventy four, seventy five, seventy \n                         six.. .get back there, you! . . . \n                         seventy five, seventy six....)\n\n               ATTENDANTS poke around underneath a bed and pull out a \n               very old trembling VEGETABLE.\n\n               OTHER ATTENDANTS wrap an old DEAD LUNATIC with no teeth \n               and foam on his open lips into a dirty sheet and haul him \n               away.\n\n               BILLY amid the LUNATICS.  We MOVE closer and closer to \n               him, the head COUNT regressing. The room has become a \n               torture cell - the NOISE LOUDER, LOUDER, closing in on \n               Billy.\n\n                                                                    CUT:\n\n               BILLY is led down a CORRIDOR by HAMIDOU into:\n\n               A VISITING room - Cabins are lined up like narrow wooden \n               phone booths.\n\n                                     HAMIDOU\n                         Kabin on-yedi\n\n               BILLY plods without interest to the specified cabin, closes \n               the door, sits in the chair. No one is there. He waits -\n               indifferent to any sense of time. Dirty two glass panes \n               separate visitor and prisoner booths; bars are between the \n               panes.  An erratic microphone is the method of \n               communication, giving a weird and distant aspect to the \n               voice.\n\n               HAMIDOU opens a small peep-hole in the cabin door, looks \n               in unseen as:\n\n               TEE VISITOR DOOR opens and SUSAN tentatively walks in \n               holding a large photo album; it takes several moments for \n               her to react, and then her face shows the shock.\n\n               BILLY stares at her, his face rabid, decaying; if he \n               remembers her even, he doesn't register it because she is \n               a shock to him as well. Reality, the outside world all at \n               once. His mind is spinning, unbalanced, unable to grasp \n               it.\n\n                                     SUSAN (OFF)\n                         Oh my God...!\n\n               SUSAN \n\n                                     SUSAN\n                         Billy, what have they done to \n                         you...my God!\n\n               The MICROPHONE makes her voice jarring, gagged. She looks \n               silently.  No sobbing, no big sad looks. Just shock.  Shock \n               of recognition, shock of time gone by.\n\n               BILLY looking at her, his eyes moving down to:\n\n               BILLY P.O.V. - SUSAN, her neck, her breasts straining \n               against the thin shirt.\n\n               SUSAN fingers the photo album nervously, speaking slow and \n               distinct; not sure she is communicating.\n\n                                     SUSAN\n                         ...Billy, your family is fine.  \n                         Senator Buckley just made a special \n                         plea on your behalf in the Senate.  \n                         Newsday has written several big \n                         articles about you.  They've called \n                         you a pawn in the poppy game between \n                         Nixon and the Turks. The letters \n                         are coming in, Billy. People \n                         care.... \n                          \n                         \n\n               Stops, shakes her head. It sounds all wrong in this context.\n\n               BILLY is still staring at her breasts. He hasn't seen a \n               woman for five years and now a hungry animal look comes \n               into his eyes He moves suddenly pressing up against the \n               glass, rabid.  And in Turkish:\n\n                                     BILLY\n                              (in Turkish)\n                         Take it off. Take it off!\n                              (then remembering \n                              the English)\n                         Take it off. Take it off!\n\n               His voice is savage, demanding.\n\n               SUSAN understands, startled. Looks around.\n\n                                     SUSAN\n                         Billy - you'll just make yourself \n                         crazy.\n\n               BILLY\n\n                                     BILLY\n                         Take it off! Take it off!\n                              (suddenly in a very \n                              soft voice)\n                         ...S'il vous plait?...\n\n               A strange look in his eye.\n\n               SUSAN slowly, scared, begins to unbutton her shirt.\n\n               HAMIDOU looks on silently, does nothing.\n\n               BILLY follows every movement with wild-eyed lust.\n\n               SUSAN leans up close to the window.  With both hands on \n               the front of her blouse, she slowly draws it apart.\n\n               BILLY going wild! Against the window. His hand down in his \n               pyjamas.\n\n               HER BREASTS spring free, quivering, full and ripe with a \n               deep cleavage and hard dark nipples. They hang full and \n               loose.  FULL SCREEN\n\n               BILLY'S EYES - FULL SCREEN.\n\n               BILLY beats on the window, working his mouth soundlessly.\n\n               SUSAN is shattered, scared of Billy's sanity.\n\n                                     SUSAN\n                         Oh Billy, Billy, I wish I could \n                         make it better for you. Please \n                         don't...  don't...\n\n               Tears. Fear.\n\n               BILLY tightens dramatically and comes right in his pants, \n               slumps against the window.\n\n               SUSAN realizes he has come, surprised.\n\n               BILLY looks at her. Furtive, animal shame. And suddenly he \n               starts to cry. A flood of feelings locked up too long come \n               pouring out. He murmurs some words, Turkish SOUNDS \n               sputtering out in his throat, then:\n\n                                     BILLY\n                         S.... Susan?\n\n               Softly, working his mouth finding it hard to speak.\n\n               SUSAN yearning. Tears sprinkling her eyes.\n\n                                     SUSAN\n                         Yes, Billy?\n\n               BILLY straining, not out of physical weakness but an \n               emotional one. Sputters, eyes closed.\n\n                                     BILLY\n                         ...I love you....\n\n               It sounds pathetic, lost.\n\n               SUSAN is worked up to the limit, tries to hug him through \n               the window.\n\n                                     SUSAN\n                         Oh Billy... Billy!  Don't give up.  \n                         Please don't give up. You'll get \n                         out. I know you will!\n\n               Remembers something. Grabs the PHOTO ALBUM with all her \n               strength, holding it up for him to see through the \n               glass.Then remembering herself, looks around the room to \n               make sure they're alone and in a contained voice:\n\n                                     SUSAN\n                         Billy, your father gave me this \n                         for you.  There's pictures of your \n                         Mom and Dad...Rob...Peg...\n\n               BILLY looks at it listlessly.\n\n               HIS P.V.O - SUSAN holding the album open to PICTURES of \n               his MOTHER and FATHER in front of the house, ROB on a \n               bicycle, PEG in her cheer-leading outfit.\n\n                                     SUSAN\n                         And there's pictures in the back \n                         of your old Mr. Franklin.  Remember \n                         him... From the bank?\n\n               A certain tone slips into her voice.\n\n                                     SUSAN\n                         He's over in Greece now. He bought \n                         a ticket.\n\n               BILLY looks from the album to Susan. Possibly there is a \n               gleam of understanding in his eyes but it is very faint. \n               An Attendant BANGS on Susan's door, OFF.\n\n                                     VOICE\n                         Visiting is over.\n\n               SUSAN quickly puts the album away as if it were a hidden \n               weapon.\n\n                                     SUSAN\n                         I'll give it to them for you.\n\n               She buttons her blouse but her eyes are worried, on Billy.\n\n                                     SUSAN\n                         You were right Billy don't count \n                         on them, you hear, don't count on \n                         anybody but yourself! \n                         \n\n               The ATTENDANT now swings open her door, annoyed.\n\n                                     ATTENDANT\n                         Let's go!\n\n               Susan stands, about to go, then suddenly leans up close to \n               the bars, hard and practical.\n\n                                     SUSAN\n                              (quickly)\n                         If you stay you'll die Billy!  Get \n                         out of here. Get to Greece, you \n                         hear me?...Billy?\n\n               Pause. Silence. She closes her eyes, in pain; she doesn't \n               think she has reached him. She turns to go, resigned.\n\n               BILLY looking at her. Behind him HAMIDOU opens the door.  \n               A calm and cunning look on his face, glancing with Billy \n               towards\n\n               A BRIEF GLIMPSE of SUSAN looking back, the album under her \n               arm. The door closes.\n\n                                                                    CUT:\n\n               BILLY, with the same deadened expression as before, comes \n               down the STAIRS towards THE WHEEL. It is early morning and \n               the walkers haven't started yet. Billy looks at the Pillar \n               a dire look of reflection passing over his eyes. Then he \n               starts walking but in a clockwise motion, opposite the \n               normal pattern; in the same methodical manner as before.\n\n               ANOTHER ANGLE\n\n               BILLY, on the inner track, passes TWO LUNATICS who are \n               walking counter-clockwise. They glare at him, motion for \n               him to turn around. Billy just keeps walking.\n\n               BILLY intersects several more LUNATICS going counter-\n               clockwise They motion for him to turn.\n\n                                     LUNATIC\n                              (grunting)\n                         Gower! \n\n               Tries to block Billy's way, but BILLY shakes his head, \n               brushes by him - determined.  \n               \n\n               AHMET Slides up next to BILLY in his rags.\n\n                                     AHMET\n                         Good morning, my American friend!  \n                         There will be trouble if you go \n                         this way. A good Turk always walks \n                         to the right. Left is communist.  \n                         Right is good. You must go the \n                         other way... It's Good.  \n                         \n\n               More LUNATICS join the flow, gesturing or grunting at BILLY.\n\n               BILLY STOPS, turns, looks at the rest of them slogging in \n               the usual direction, looks as if he 'sees' them; and he \n               walks out of the wheel, towards the stairs.\n\n               AHMET curious about his unusual behavior, follows BILLY.  \n\n                                     AHMET\n                         Why you go?  Why don't you walk \n                         the wheel with us?\n                              (suspiciously leaning \n                              forward, suddenly \n                              realizing the answer)\n                         The bad machine doesn't know he's \n                         a bad machine. You still don't \n                         believe it? You still don't believe \n                         you're a bad machine?\n\n               ANOTHER ANGLE\n\n               BILLY stops and turns to look at AHMET at the base of the \n               STAIRS. BILLY carries on up the stairs.\n\n                                     AHMET\n                              (shakes his head)\n                         To know oneself is to know God, my \n                         friend. The factory knows.  That's \n                         why they put you here. You'll see.  \n                         You'll find out. Later on you'll \n                         know.\n\n               BILLY stops and turns to look at AHMET.  His eyes glint \n               with special knowledge and he takes AHMET into his \n               confidence using the latter's tone of voice:\n\n                                     BILLY\n                         I already know. I know that you're \n                         a bad machine.  That's why the \n                         factory keeps you here.\n                              (Lowers s voice)\n                         You know how I know?  I know because \n                         I'm from the factory. I make the \n                         machines.. I'm here to spy on you.\n\n               Eyes narrow. Surprise. Fear. He shuffles away.\n\n               BILLY looks at him and turns up the STAIRS.\n\n                                                                    CUT:\n\n               BILLY in his BED. The usual UPROAR. THE ATTENDANT comes by \n               with the pills, offers a handful to BILLY.\n\n                                     ATTENDANT\n                         Hop!  Hop!  Take!\n\n               He takes them, puts a few into his mouth, swallows.  \n               Reflective, unsure.  A RADIO playing OFF blares suddenly \n               with the U.S. Armed Forces Station - JANIS JOPLIN singing \n               \"Take another piece of my heat now, Baby\" then it's switched \n               back to a TURKISH STATION, loud. Billy rises.\n\n               BILLY enters the TOILET with the PHOTO ALBUM tightly \n               clutched under his arm. A dark stone room, very shadowy. \n               Piles of waste on the floor. A vacant-eyed barefoot LUNATIC \n               shuffles past BILLY who goes to one of the four partitioned \n               HOLES cut into the floor.\n\n               ANOTHER ANGLE - BILLY squats over it and with his filthy \n               long nails he starts to slit open the back binder of the \n               album Susan gave him. Flickering shadows. He looks up \n               absently.\n\n               THREE LUNATIC FACES stare in at him through wooden slats, \n               tongues hanging out and drooling - playing with themselves - \n               OFF.\n\n               BILLY makes a lunatic face and SCREAM kicking at the \n               partition.\n\n                                     BILLY\n                         Aaaaaaaaaaaaaaaaahhhhhhhhhhhhhhhh!!! \n\n               THE LUNATICS, petrified, scatter off but ONE LUNATIC skids \n               in a puddle of urine and crashes onto the tile howling.\n\n               BILLY slits open the binder to reveal TEN HUNDRED DOLLAR \n               BILLS with Pictures of Mr. Franklin' neatly inserted.\n\n               ANOTHER ANGLE\n\n               BILLY has no particular expression on his face.  Reflective, \n               staring at the money; he looks up.\n\n               A LARGE SILHOUETTE is moving towards him.\n\n               BILLY just watches, transfixed, not trying to hide the \n               money.\n\n               HAMIDOU comes into a faint light, looking down at him; \n               glances at the money. Shakes his head gently.\n\n                                     HAMIDOU\n                         No do!  No do! \n\n               Reaches for and:\n\n               ANOTHER ANGLE - HAMIDOU takes the money from BILLY like \n               candy from a baby, then takes him by the ear and slowly \n               lifts him up.  Billy is like a vegetable in his hands.\n\n                                     HAMIDOU\n                              (in his broken \n                              English)\n                         I tell you I see 'gain...\n                              (into Turkish)\n                         I take you down to bath and your \n                         feet be big like...Breasts\n                              (a gesture)\n\n               HAMIDOU leads BILLY roughly out of the lunatic room, pulling \n               him by the ear.\n\n               HAMIDOU still Pulling BILLY by the ear, guides him through \n               the GUARD QUARTERS.\n\n               HAMIDOU leads him up a narrow winding flight of STAIRS.\n\n                                     HAMIDO\n                         First you make mistake with Ziat, \n                         now you make mistake with money.  \n                         You're not a new Prisoner, Vilyum \n                         Hi-yes.\n\n               The tone of his voice indicates a severe reckoning this \n               time.\n\n               HAMIDOU pulls BILLY by the ear into a large echoing BATH.\n\n               BILLY looking, bent over by the ear - a hint of awareness \n               of new surroundings.\n\n               ANOTHER ANGLE - the BATH is deserted, spooky with greenish \n               Yellow fish light flittering down from holes in ceiling \n               around damp mossy arches. Steam rises off a bath.  Benches, \n               buckets of water.  HAMIDOU swings BILLY around until he is \n               facing him. \n\n               HAMIDOU makes an elaborate gesture of putting aside his \n               falaka stick and holstered gun; he will use his hands.\n\n                                     HAMIDOU\n                              (shakes his head)\n                         You've been in prison too long, \n                         Vilyum Hi-yes.\n\n               He takes that: stiff arm all the way back to its full arc \n               and WHACKS BILLY up against the wall.\n\n               BILLY bounces back off the wall. The print of Hamidou's \n               fingers is imbedded like a flaring white rainbow in the \n               redness of his left cheek. SLAM -  a backhanded whack. \n                \n               BILLY bounces right back from the wall. steadies him.\n\n                                     HAMIDOU\n                         You go crazy here Vilyum Hi-yes. \n                         Many people go crazy here. Best \n                         thing for crazy people is this...\n\n               THE BLOW, in SLOW MOTION comes sailing into:\n\n               BILLY, and we see the brief boxer's distortion of all his \n               face as he flies upwards and back into:\n\n               THE BENCH smashing it. Echo like jarring F.X.\n\n               BILLY is held up by the PAJAMAS, steadied. The Turkish \n               words seem far away, incomprehensible.\n\n                                     HAMIDOU (OFF)\n                         Vilyum Hi-yes. You die here, Hi-\n                         yes.\n\n               WHACK - ANOTHER BLOW, but:\n\n               HAMIDOU this time holds onto the pajamas using Billy like \n               a punching bag.\n\n               WHACK - A REVERSE BLOW.\n\n               HAMIDOU increasingly excited. \n\n                                     HAMIDOU\n                         Babba sikijam!  I fuck your mother, \n                         I fuck your sister...\n\n               WHACK - ANOTHER BLOW in SLOW MOTION\n\n                                     HAMIDOU\n                         ...I fuck your father, I fuck your \n                         brother...\n\n               RIP! - a loud SOUND as HAMIDOU moves with a blur of speed, \n               and shreds BILLY's pajamas with his hands.\n\n               BILLY naked, totally passive, semiconscious. HAMIDOU \n               suddenly shifts position and snaps Billy into a strenuous \n               wrestling hold across his knee on the steamy floor. He \n               loosens him up by cracking his bones along his back.\n\n               HAMIDOU - sweat pouring off his face, excited.\n\n                                     HAMIDOU\n                         ...And I fuck your grandmother and \n                         I fuck your pretty girlfriend... \n                         And I fuck you Hi-yes!)\n\n               A bizarre otherworldly scene. This man is dredging Billy \n               through a sadistic imagination sparked by the steam, the \n               sweat, and an ethnic identification with a Turkish steam \n               bath as a bedroom. He loosens his hold abruptly, rises, \n               moves off as:\n\n               BILLY holds himself on his knees, head sunk on his chest, \n               gasping for breath, about to vomit. Pause; he looks up \n               horrified at: \n\n               HAMIDOU pouring fresh buckets of water on the floor.  \n               SSSSSSSSSS!  The awakened STEAM coils like a snake into \n               every cranny of the little room.\n\n               BLURRED VISUALS - HAMIDOU stripping his shirt off. A huge \n               muscular flash of chest,\n\n               A BELT being snapped open.\n\n               BILLY waiting.\n\n               A FIGURE moving through the steam, closer.\n\n               BILLY backing away from it.\n\n               STEAM - a glint of a FACE coming through.  HAMIDOU - his \n               eyes so intense they seem to burn off the steam like sun \n               cutting haze. Then disappear again.\n\n               BILLY pulls back. A pause. Silence. Cat and mouse.  Then \n               very suddenly:\n\n               A HAND reaches out of the STEAM and GRABS BILLY by the \n               hair.  A GRUNT, OFF.\n\n               BILLY his eyes moving fast.\n\n               A FLASH of a huge darkened penis, fully erect cutting \n               forward into the steam like a from drill, detached from \n               the rest of the body.\n\n               A SOUND - grotesque and so sudden after the silence it \n               jars the senses. A BLURRED VISUAL then:  \n                \n               BILLY Launching forward in SLOW MOTION, desperation \n               distorting his features and: \n                \n               STEAM - then BILLY'S HEAD SLAMS through it in SLOW MOTION \n               and:\n\n               SMASHES the penis with its skull. A horrifying GASP.\n\n               BLURRED VISUALS - STEAM - HAMIDOU staggering CLOSE - \n               surprise, pain...\n\n               BILLY MOVING.\n\n               A FOOT coming up fast through the steam, connecting again \n               with the genitals. Another SCREAM.\n\n               A BODY hitting the tiles.\n\n               BILLY groping for the falaka stick. Raises it. \n                \n               A STRUGGLE - Two bodies thrashing, one of them screaming \n               now in pain. A definitive sound then a THWACK! Another \n               thwack!  The steam seems to clear and\n\n               BILLY is on top of the gigantic HAMIDOU smashing him with \n               the falaka stick with all his might. \n                \n               HAMIDOU is in contortions, his nose busted and bleeding.\n\n               His HAND gripping BILLY by the neck, forcing him back and \n               strangling him at the same time. Billy is red in the face, \n               such is the force of this creature but continues to beat \n               him, harder, harder.  His expression filled with a life \n               energy, seeded in hatred, that he thought he had lost.  \n               Again, Again -\n\n                                     BILLY\n                         Babba sikijam, Hamidu!  I fuck your \n                         Mother, I fuck your daughter, I \n                         fuck your sons, I fuck your wife!\n\n               The BAND slips from his throat, then springs up desperately \n               again and clenches Billy's whole face with one gigantic \n               palm, clawing to get in, then just as quickly slips away.  \n               BILLY beats on - again, again.\n\n               BLOOD flows fast in agitated swirls into the little pool.\n\n                                                                    CUT:\n\n               BILLY opens a door gently, moves across an empty CORRIDOR, \n               dressed in and gun in intense. Hamidou's holster. large \n               uniform with his He looks shaken, weak, falaka stick dizzy \n               but\n\n                                     VOICE (OFF)\n                         How about a shoe shine, friend?\n\n               BILLY starts, clenches the falaka stick ready to spring, \n               spins.\n\n               A LITTLE SHOESHINE BOY is his case down the corridor.\n\n               BILLY has not seen a child in a long time. get words out, \n               then manages: Surprised.  Can't get the words out, then \n               manages:\n\n                                     BILLY\n                         No! \n\n               THE KID shrugs, moves on, looking At Billy strangely.\n\n               BILLY goes up a flight of STAIRS.  Ahead, VOICES passing.  \n               He stops. Goes on.\n\n               BILLY goes through an empty GUARD QUARTERS.\n\n               BILLY is in another CORRIDOR, approaches\n\n               A SMALL PORTAL, daylight at its edges.  Locked?\n\n               BILLY, tense, tries it. It swings open on:\n\n               DAYLIGHT!\n\n               BILLY squints.  Adjusting to the harsh sensation.\n\n               AN ISTANBUL STREET - TRAFFIC, SOUNDS.  TWO GUARDS \n               approaching the portal in the distance, drinking soda pop.\n\n               BILLY steps back, straightens his clothes, steps out briskly \n               and at such an angle that  \n\n               THE TWO GUARDS don't notice him in the traffic  as they \n               enter the open portal.\n\n               LONG SHOT - BILLY walking down the street, looking back, \n               almost bewildered, not quiet believing this. \n\n                                                                    CUT:\n\n               TIGHT - RAILROAD TICKET being stamped.  SOUND - SNAP.  \n               MOVE UP to TICKET CLERK behind a grill.\n\n                                     VOICE (OFF)\n                         Edirne to Uzun Kopru?\n\n               THE CLERK looks puzzled.\n\n               BILLY is on the other side of the grill.  A ill-fitting \n               new Western style suit, a hat over his dyed black hair; \n               totally paranoid. He hasn't slept in three days and the \n               bruises from the Hamidou beating now show clearly black \n               and blue on his face. His eyes are alert, darting around, \n               his speech clipped and to the point.\n\n                                     BILLY\n                         What's the matter?\n\n               THE CLEF!!  Shrugs.\n\n                                     CLERK\n                         'What are you crazy? There's no \n                         train anymore to Uzun Kopru, it'd \n                         have to go through Greece. The \n                         border's closed.\n\n               BILLY taken by surprise.\n\n                                     BILLY\n                         No train?\n\n                                     CLERK (OFF)\n                         No more train.\n\n               BILLY Moves off a small provincial RAILROAD DEPOT - DAY.  \n               He looks at the:\n\n               EMPTY TRACKS - No 'midnight express'.\n\n                                                                    CUT:\n\n               BILLY, tenser than ever, uses the occasion of buying a \n               newspaper at an OUTDOOR STAND to study:\n\n               THE MAIN SQUARE of the VILLAGE (EDIRNE) - DAY. SOLDIERS \n               and POLICE are abundant, chattering bustling amid tanks \n               and half-tracks.  Mountains can be seen in the far distance.\n\n               BILLY camouflages his face as best he can in the Newspaper \n               \"Hurriyet\" studying:\n\n               CABDRIVERS in the Main Square.  Most of them are older, \n               grizzled looking standing next to their old battered dusty \n               cabs talking with stray SOLDIERS. Billy's eyes settle on a \n               YOUNGER DRIVER with longish hair, possibly an ally.\n\n               BILLY glances down at his newspaper as a SOLDIER intersects \n               and his expression goes stony as he sees:\n\n               FULL COLOR DRAWING (first page) of a ridiculously fierce \n               heavy-muscled barechested MAN beating a facsimile of Hamidou \n               into the ground.  Next to it a blurry badly reproduced \n               photograph of BILLY with a superimposed GUN in his hand. \n               You can't really tell it's him.\n\n               BILLY, controlling himself, crumples up the newspaper into \n               a baton, his eyes everywhere.  Be the darting A crosses \n               square.\n\n               ANOTHER ANGLE - BILLY, intersecting a POLICEMAN who glances \n               at him, joins the YOUNG CABDRIVER..\n\n                                     BILLY\n                         Listen, I have Swedish friends \n                         camping south of the town. I was \n                         supposed to meet them here this \n                         morning but I was late. Can you \n                         take me there?\n\n               DRIVER looks at him neutral.\n\n                                     DRIVER\n                         You know where they are?\n\n                                     BILLY\n                              (anxious to get in \n                              the cab)\n                         Sure.\n\n                                     DRIVER\n                         How far?\n\n                                     BILLY\n                              (impatient)\n                         About ten kilometers.\n\n                                     DRIVER\n                         Sixty Lira?\n\n                                     BILLY\n                              (surprised)\n                         Sixty?\n\n               Billy eyes:\n\n               APPROACHING SOLDIERS.\n\n                                     BILLY (OFF)\n                         Okay.\n\n               THE DRIVER, noticing Billy's look at the soldiers, gets in \n               the cab.\n\n               BILLY climbs into the back seat, feeling already he has \n               made a mistake. There is something too alert, too hard in \n               this young driver.\n\n                                                                    CUT:\n\n               BILLY P.O.V. - THE MOUNTAINS as they roll in the taxi.  \n               FORESTS - FIELDS.\n\n               INTERIOR TAXI\n\n                                     BILLY\n                         Those mountains? are they?\n\n                                     DRIVER\n                         (Greece  \n                              (shakes his head)\n                         Very bad now. Maybe war. Those \n                         Greek pigs try to steal Cyprus \n                         again\n                              (pause))\n                         How'd you lose your friends?\n\n               BILLY leaning back in his seat, casual.\n\n                                     BILLY\n                         Oh, I drank a lot of raka last \n                         night in Istanbul. Got into a fight.\n\n               Indicates the bruises on his face.\n\n               DRIVER looking at him in the rear view mirror. His curiosity \n               narrowing.\n\n                                     DRIVER\n                         How come you speak Turkish so good?\n\n               BILLY casually glances out the window.\n\n                                     BILLY\n                         Did twenty months in prison in \n                         Istanbul.  Hash\n\n               THE DRIVER studies BILLY in the rear-view mirror. Then:\n\n                                     DRIVER\n                         You want to score some?  Cheap?\n\n               BILLY looks at him hard. Something's wrong with this man.\n\n                                     BILLY\n                              (curt)\n                         No!\n\n               Cutting off further conversation, he looks out at:\n\n               THE MOUNTAINS of Greece - with longing.\n\n               BILLY stares back at:\n\n               THE DRIVER whose eyes now move away from the rear-view \n               mirror under the pressure of the stare.  SOUND OFF loud \n               machinery.\n\n               BILLY turning - in rear window, we see a TURKISH HALFTRACK \n               pulling alongside the cab, SOLDIERS waving their arms for \n               the cabdriver to get out of the way.\n\n               ANOTHER ANGLE - the HALFTRACK pulls level. The CABDRIVER \n               slows down, with a curse.\n\n               BILLY - beads of sweat trickle his brow \n\n               THE PERSONNEL CARRIER, disinterested, pulls past.\n\n               BILLY breathes heavily with nervous relief.\n\n                                                                    CUT:\n\n               THE CAB pulls up to the end of a dirt road.\n\n               BILLY has his MAP out, studying it.\n\n                                     BILLY\n                         The Maritas River? Where is it?\n\n               ANOTHER ANGLE - the DRIVER, exasperated, waves southwest.\n\n                                     DRIVER\n                         Two miles! Minefields over there.  \n                         Do you know where this campground \n                         is or not?\n\n                                     BILLY\n                         Not far. Just a little way.\n\n                                     DRIVER\n                         No!  I'm not going any further!  \n                         It'll wreck my car.\n\n                                     BILLY\n                         I'll pay extra\n\n                                     DRIVER\n                         How much? \n\n               ANOTHER ANGLE - BILLY slips him fifty lira. The DRIVER \n               takes it, muttering under his breath, jams the cab into \n               gear.\n\n               THE CAB follows rutted tracks into low HILLS.\n\n               INTERIOR CAB - very bumpy.\n\n                                     BILLY\n                         Where are the minefields?\n\n                                     DRIVER\n                         All over.  Turkish Army up there.  \n                         It's against the law. They shoot \n                         us.\n                              (looks up in the \n                              mirror)\n                         You sure you looking for your \n                         friends, man?\n\n                                     BILLY(VERY SHARP NOW)\n                              (very sharp now)\n                         Okay!  Ley me out right here.  I'm \n                         getting tired of all this bullshit \n                         from you.  I'll walk it.\n\n                                     DRIVER\n                              (looks back, then \n                              ahead, suddenly \n                              brightening)\n                         Ah, look!  they probably know where \n                         the campers are\n\n               BILLY's entire expression changes. It is all over.\n\n               A TANK AND HALFTRACK are sitting there by the rutted track, \n               with SOLDIERS. And a little LEAN-TO with several POLICE.  \n               Also a couple of attack DOGS on leashes. The Driver honks \n               his horn on the approach.\n\n               ANOTHER ANGLE\n\n                                     DRIVER\n                         Hey officer, we're looking for the \n                         campground. Do you know where it \n                         is?\n\n               ANOTHER ANGLE - TWO POLICEMEN and A SOLDIER come sauntering \n               over, their collars open, beer bottles in hand, slightly \n               drunk.\n\n                                     POLICEMAN\n                              (curt)\n                         You're not supposed to be here\n\n                                     DRIVER\n                              (indicated Billy)\n                         He's a tourist, what do you want, \n                         he says he's looking for friends \n                         at the campground. \n\n               FIRST POLICEMAN glances BILLY\n\n                                     POLICEMAN\n                         Campground?\n                              (shrugs)\n                         Never heard of one.\n\n                                     DRIVER\n                         Seen any Swedish foreigners in a \n                         camper-bus?\n\n               SECOND POLICEMAN meanwhile eases his arm down on the OPEN \n               WINDOW bringing BILLY into foreground. The COP'S mouth is \n               open and exhaling a wave of beer breath over-BILLY.\n\n               BILLY P.O.V. - BEER FACE FOCUS PAST him to SOLDIER at tank \n               reading \"Hurriyet\" - the picture of BILLY on page one, \n               spread for all to see.\n\n                                     BEER FACE\n                         Noldu? \n\n               DRIVER turning around to address him.\n\n                                     DRIVER\n                         Seen any foreigners in a camper \n                         bus?\n\n               SOLDIER circles the cab from the other side.\n\n               BILLY motions to the DRIVER.\n\n                                     BILLY\n                         Okay, they haven't seen him, let's \n                         go back to town, it's getting late.\n\n               THE DRIVER ignores it. Calls out again, louder to BEER \n               FACE.\n\n                                     DRIVER\n                         Foreigners!  KAMPER.  VOLKSWAGEN\n\n               BILLY rigid. This asshole of a driver!\n\n               BEER FACE glances at BILLY, pulls his head out the window.\n\n               Looks down the road. Takes a sip of beer.\n\n               SOLDIER, disinterested, moves back towards the tank.\n\n               BEER FACE looks in the other direction down the road, \n               burps.Very conscious of his authority, shakes his head \n               without looking at the driver.  Moves away.\n\n               BILLY nudges the DRIVER.\n\n                                     BILLY\n                         Okay, let's go. \n\n               THE DRIVER impatiently turns and looks straight at BILLY, \n               aware of his anxiety.\n\n                                     DRIVER\n                         Is no Volkswagen, man! Something \n                         wrong with you?\n\n               BILLY hardening.\n\n               DRIVER calling out.\n\n               BEER FACE turns.\n\n               DRIVER leans out the window.\n\n                                     DRIVER\n                         This guy's fishy...I think he might \n                         be trying to get to Greece.\n\n               BILLY looks around fast.\n\n               BEER FACE starts back lazily, half drunk, with the OTHER \n               POLICEMAN\n\n                                     BEER FACE\n                         Huh?\n\n               DRIVER\n\n                                     DRIVER\n                         I don't know, there's\n\n               His eyes grow big suddenly As he sees the barrel of \n               Hamidou's REVOLVER right in His cheek.\n\n               BILLY all business, very quiet.\n\n                                     BILLY\n                         Get out -- right now, move!\n\n               BEER-FACE advancing looks puzzled, thinks he sees something, \n               then crouches as:\n\n               DRIVER gets out the door crouching, yells.\n\n                                     DRIVER\n                         He's got a gun!\n\n               BILLY firing SHOTS off to distract them has climbed over \n               the front seat, jams the cab into gear. It stalls! Again \n               he tries, and now shoots off.\n\n               THE CAB Roars past the roadblock.\n\n               THE COPS AND SOLDIER, scattered by the shots, now scream \n               at each other. They run.  SHOTS are fired.\n\n               BILLY guns the cab down the road, flying.\n\n               CLOUDS OF DUST trail the cab.\n\n               THE TANK starts to roll after it. Full speed. The HALFTRACK \n               follows, the MEN riding it shouting.\n\n               BILLY looks back, then looking ahead sees something.\n\n               P.O.V - a speck in the far distance. Another ROADBLOCK.\n\n               BILLY decides, then - \n\n               THE CAB swerves right off the road and jumps into the gently \n               rolling FIELD on the border of the road, pock marked with \n               HILLS.\n\n               THE TURKS come roaring down the road, pointing to the cab.\n\n               LOW ANGLE - the TANK makes a flat out stop, gears grinding.\n\n               THE GUN TURRET swings left.\n\n               THE CAB in the far distance, at an angle to the tank, starts \n               running up an incline.\n\n               THE TANK FIRES.\n\n               P.O.V. - SHELL BLASTS WIDE OF THE CAB. \n\n               BILLY, startled, looks back, guns for the top of the \n               incline.\n\n               HIS P.O.V. - ANOTHER SHELL now blasts to his front right, \n               closer. Something heavy (shrapnel) thuds into the rood of \n               the cab.\n\n               BILLY drives all out.\n\n               P.O.V. - THE INCLINE CLOSER, CLOSER, ABOUT TO MAKE IT, \n               THEN: A BLAST\n\n               TANK P.O.V. - the CAB spinning in the blast of the adjacent \n               shell-burst.\n\n               BILLY, shaken but unhurt, staggers out of the cab, looks:\n\n               P.O.V. - A WHEEL BLASTED AWAY, FUEL PISSING OUT FROM THE \n               SHRAPNEL HOLES, SMASHED WINDSHIELD AND FENDER.\n\n               THE TURKS are coming up the incline now, like the Cavalry --\n               some on foot running, others on the HALFTRACK.  BULLETS \n               whistle and pop nearby.\n\n               BILLY running. He tears off his jacket.\n\n               SOLDIERS pass the wrecked car, at the top of the incline \n               shouting, pointing and firing at\n\n               BILLY in the distance.\n\n               ONE SOLDIER seems lighter than the others and takes off in \n               a sprint as the OTHERS follow.\n\n               THE HALFTRACK now crests the incline and gathering full \n               gear and momentum, roars off down the slope after Billy.\n\n               CLOSE BILLY running sweat all over him. In background, the \n               HALFTRACK and running FIGURES.\n\n               BILLY runs into a high dry cornfield with the sun starting \n               to set ahead of him in the Greek mountains.\n\n               MOUNTAINS - must make those mountains.\n\n               BILLY running all out - eyes fixed on them, breathing, \n               skipping heartbeats.\n\n               THE PERSONNEL CARRIER bypasses the FAST SOLDIER who slows \n               down, panting. Billy has outrun him.\n\n               OTHER SOLDIERS run up in the distance.\n\n               BILLY, tireless, obsessed, runs right into a POPPY FIELD.It \n               is a splendid beautiful scarlet red, set off by the dipping \n               rays of the sun.\n\n               HIS FEET smashing down the poppy plants.  Fast - THUCK!  \n               THUCK!  THUCK!  THUCK!  THUCK!  THUCK!\n\n               CROSSCUT the metal TREADS of the Halftrack into the poppy, \n               mowing down entire rows.\n\n               TWO SOLDIERS on the PERSONNEL CARRIER are waving \n               encouragement to the driver inside. They have him.\n\n               ANOTHER ANGLE the HALFTRACK closing the distance on BILLY \n               now thirty yards apart.\n\n               BILLY looking back, starting to fade. Huge wheezing gasps \n               of breath.\n\n               SOLDIERS running up looking at \n\n               THE HALFTRACK in the distance.\n\n               SOLDIERS yell.\n\n                                     SOLDIERS\n                         Minefield!  Minefield! Come back!  \n                         Stop!  \n                              (NO SUBTITLE)\n\n               BILLY runs out of the POPPY FIELD into a THIN FOREST.\n\n               THE SOLDIERS screaming in the distance, jumping up and \n               down waving for the halftrack to come back.\n\n               LOW ANGLE - the HALFTRACK with the waving SOLDIERS on board \n               now blasts out of the poppy field at full speed.\n\n               BILLY -- he has no chance, In immediate background is the \n               fast HALFTRACK.  \n\n               ONE SOLDIER on the HALFTRACK now looking back to the SHOUTS \n               of his comrades. Confused. Turns bout back to yell something \n               and:\n\n               ENORMOUS EXPLOSION The HALFTRACK disintegrates in a tank \n               landmine.\n\n               BILLY thrown to the ground by the force of the blast, looks \n               back, GASPS!\n\n               A BURNING WRECKAGE. Black spirals of smoke.  Secondary \n               explosions.\n\n               BILLY stumbles up. A gash of blood is on his temple but he \n               doesn't know it or feel it such is his stress. He runs on, \n               SHOTS whistling towards him from the poppy field.\n\n               TURKISH OFFICER screaming angrily at Billy, cursing, shaking \n               his fist at the sky.\n\n               BILLY, in the forest, is totally out of breath and out of \n               eyesight of the pursuers. He stops against a tree.  FROG \n               SOUNDS. The gurgle of water. Muddy ground. He looks:\n\n               THE MARITAS RIVER rushing ahead. A strong current.\n\n               BILLY peels off all his clothing except his pants, not \n               delaying one more moment. He feels he must keep going. And \n               he's right. DOGS are barking OFF.\n\n               A SNARLING ATTACK DOG is tearing through the minefield, \n               fast, ahead of the others.\n\n               BILLY looks, sees it.\n\n               THIRTY YARDS - the huge DOG coming right at him!\n\n               BILLY runs for the edge of the bank and plunges in.\n\n               THE ATTACK DOG sprints up to the edge of the river bank \n               and without a moment's hesitation, plunges right in after \n               him.\n\n               BILLY lashing into the current with a fierce breast stroke, \n               is swept downstream kicking futilely.\n\n               THE DOG, its jaws open and clacking, is also swept down \n               river.\n\n               BILLY going under, coming back up - fighting, still \n               fighting.\n\n               THE DOG struggling sails past as\n\n               BILLY hauls himself out of the river, going in a circle, \n               dizzy. Falls. Struggles up again. Looks back. Must keep \n               going. Must.\n\n               THE BASE OF' MOUNTAIN - hilly, rugged.\n\n               BILLY runs, drags, runs again.  He is a lamentable sight - \n               naked except for ripped wet pants, barefoot, bleeding, \n               muddied.  Dimly he makes out:\n\n               A FARMHOUSE - TWILIGHT. Some cows, goats, chickens. NO \n               sign of people.\n\n               BILLY staggers towards it. Wears something. A rooting SOUND.  \n               Stops. Something familiar about it.\n\n               A FAMILY OF PIGS snort and root in the mud, little piglets \n               running around.\n\n               BILLY staggers towards them, muttering to himself.\n\n                                     BILLY\n                         Pigs...!  Pigs...! \n\n               Then yells in the recognition of it\n\n                                     BILLY\n                         Pigs... You... Beautiful... \n\n               BILLY BILLY falls to his knees in the confined pen; the \n               pigs run around squealing. Trying to reach out for one of \n               them, he falls face first into the mud and lies there. \n               Pause.  A wooden DOOR squeaks open OFF. BILLY slowly turns \n               his muddy eyes over his shoulder.\n\n               BILLY P.O.V. - TWO SOLDIERS, khaki-colored uniforms, \n               helmets, olive faces, mustaches, approach cautiously from \n               the farmhouse, rifles ready.  Following them is an OLD \n               FARMER, Further behind in the doorway is his WIFE and \n               CHILDREN.\n\n               BILLY muttering to himself, in Turkish.\n\n                                     BILLY\n                         Greek?...  Greek?... \n\n               THE SOLDIERS approach close, stand above this strange \n               figure, look at each other.\n\n                                     SOLDIER\n                         Ti leei?\n                         (What is he saying?)\n\n                                     2ND SOLDIER\n                         Mou fainetai san Toupkika\n                         (It sounded like Turkish) \n\n               BILLY with dimming strength.\n\n               BILLY\n\n               THE FARMER understands, makes a vigorous nod of his head.\n\n                                     FARMER\n                         Malisee...Ellada! \n                         (Ah, yes...  Greece!)\n\n                                                                    CUT:\n\n               CAR DOOR SLAMS SHUT - and BILLY, his movements still weak, \n               moves a few steps from the car and stops.  SUBTITLE:\n\n                        OCTOBER 24, 1975 - BABYLON, LONG ISLAND\n\n               Framing Billy are SUSAN and his FATHER, both silent.  They \n               look with him at\n\n               HIS SISTER, BROTHER, UNCLE, AUNT, SISTER-In-LAW FAMILY \n               FRIEND - AND GRANDMOTHER, all on the porch of the ordinary \n               house in BABYLON, LONG ISLAND - DAY; all of them returning \n               his gaze in that first SILENT moment. Curiosity. \n               Recognition. Shock. Love.\n\n               And then they move. But we don't hear their movements. It \n               is SOUNDLESS reunion; the SISTER running out first in SLOW \n               MOTION, the MOTHER following last, crying; the GRANDMOTHER \n               too infirm to move, the shaking her head from side to side \n               in SLOW MOTION, her tears lost somewhere in the wrinkles \n               of her face. \n\n               BILLY surrounded by FAMILY - SLOW MOTION - SOUNDLESS.  His \n               eyes flooding. All the feelings in him.  And deep inside - \n               a solitary question.  \n\n               EPILOGUE BLACK SCREEN - SUPERIMPOSE:\n\n                       THE CHARACTER NAMED BELL IS STILL INSIDE.\n\n                                        AS ARE: \n\n                               (ROLL THE LIST OF NAMES) \n\n               And OVER this, the SOUND of a PASSING TRAIN rushing by in \n               the night - UP, FAST and AWAY.\n\n                                   (Getchmis Olsun)\n\n                                        THE END\n\n\n\n\n\nMidnight Express\nWriters :   Oliver Stone  Billy Hayes  William Hoffer\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:31:10.571509"}