{"title": "Miller's Crossing", "film_link": "/Movie Scripts/Miller's Crossing Script.html", "script_link": "/scripts/Miller's-Crossing.html", "info_raw": "\n\nMiller's Crossing Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Joel Coen  Ethan Coen\nGenres  Crime  Drama  Thriller\n\nRead \"Miller's Crossing\" Script\n\n\n", "script": "\n\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\tMILLER'S CROSSING -- by Joel and Ethan Coen\n\n\n\n\n\n\n\n\n\n\n                            Miller's Crossing\n\n                        An Original Screenplay By\n\n                                Joel Coen\n\n                                   and\n\n                               Ethan Coen\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1.   FADE IN:\n     CLOSE SHOT   A WHISKEY TUMBLER\n\n     That sits on an oak side bar under a glowing green bankers\n     lamp, as two ice cubes are dropped in.  From elsewhere in\n     the room:\n\n                           Man  (off)\n          I'm talkin' about friendship.  I'm talkin' about\n          character.  I'm talkin' about--hell, Leo, I ain't\n          embarassed to use the word--I'm talkin' about\n          ethics.\n\n     Whiskey is poured into the tumbler, filling it almost to\n     the rim, as the offscreen man continues.\n\n          . . . You know I'm a sporting man.  I like to\n          make the occasional bet.  But I ain't that\n          sporting.\n\n\n     THE SPEAKER\n\n     A balding middle-aged man with a round, open face.  He\n     still wears his overcoat and sits in a leather chair in the\n     dark room, illuminated by the offscreen glow of a desk\n     lamp.  This is Johnny Caspar.\n\n     Behind him stands another man, harder looking, wearing an\n     overcoat and hat and holding another hat--presumably\n     Caspar's.  This is Bluepoiont Vance.\n\n                           Caspar (cont'd)\n          When I fix a fight, say--if I pay a three-to-one\n          favorite to throw a goddamn fight--I figure I got\n          a right to expect that fight to go off at three-\n          to-one.  But every time I lay a bet with this\n          sonofabitch Bernie Bernheim, before I know it the\n          odds is even up--or worse, I'm betting the short\n          money. . .\n\n     Behind Caspar we hear the clink of ice in the tumbler and a\n     figure emerges from the shadows, walking away from the\n     glowing bar in the backgound.\n\n          . . . The sheeny knows I like sure things.  He's\n          selling the information I fixed the fight.  Out-\n          of-town money comes pourin' in.  The odds go\n          straight to hell.  I don't know who he's sellin'\n          it to, maybe the Los Angeles combine, I don't\n          know.  The point is, Bernie ain't satisfied with\n          the honest dollar he can make off the vig.  He\n          ain't satisfied with the business I do on his\n          book.  He's sellin' tips on how I bet, and that\n          means part of the payoff that should be ridin' on\n          my hip is ridin' on someone else's.  So back we\n          go to these questions--friendship, character,\n          ethics.\n\n     The man with the whiskey glass has just passed the camera\n     and we cut to the:\n\n\n     REVERSE\n\n     Another well dressed, middle aged man, behind a large\n     polished oak desk, listening intently.  This is Leo.  He is\n     short but powerfully built, with the face of a man who has\n     seen things.\n\n     The man with the whiskey enters frame and passes Leo to\n     lean against the wall behind him, where he listens quietly.\n\n                           Caspar\n          . . . So its clear what I'm sayin'?\n\n                           Leo\n          Clear as mud.\n\n     Caspar purses his lips but continues unfazed.\n\n                           Caspar\n          It's a wrong situation.  It's gettin' so a\n          businessman can't expect no return from a fixed\n          fight.  Now if you can't trust a fix, what can\n          you trust?  For a good return you gotta go\n          bettin' on chance, and then you're back with\n          anarchy.  Right back inna jungle.  On account of\n          the breakdown of ethics.  That's why ethics is\n          important.  It's the grease makes us get along,\n          what separates us from the animals, beasts a\n          burden, beasts a prey.  Ethics.  Whereas Bernie\n          Bernheim is a horse of a different color ethics-\n          wise.  As in, he ain't got any.  He's stealin'\n          from me plain and simple.\n\n     Leo leans back in his chair.\n\n     The man behind Leo raises the whiskey glass to his lips.\n\n     He is trimmer and younger than Leo, perhaps in his thir-\n     ties, dark-complected, with a pencil mustache and a gaunt\n     intensity that is not entirely healthy-looking.  This is\n     Tom.\n\n     As he drinks, he studies Caspar and Bluepoint.\n\n                           Leo\n          You sure it's Bernie, selling you out?\n\n     For the first time the man behind Caspar speaks:\n\n                           Bluepoint\n          It ain't elves.\n\n                           Leo\n          Nobody else knows about the fix?\n\n                           Caspar\n          No one that ain't got ethics.\n\n                           Leo\n          What about the fighters you pay to tank out?\n\n                           Bluepoint\n          We only pick fighters we can put the fear of God\n          in.\n\n                           Leo\n          Any other bookies know?  You play anyone else's\n          book?\n\n                           Caspar\n          I lay an occasional bet with Mink Larouie.\n\n                           Bluepoint\n          But it ain't Mink, I'll vouch for that.\n\n                           Leo\n          How do you know?\n\n     Caspar shakes his head.\n\n                           Caspar\n          It ain't Mink.  Mink is Bluepoint's boy.\n\n                           Leo\n          Mm.  And of course, Bluepoint always knows about\n          the fix.\n\n                           Bluepoint\n          What the hell is that supposed to mean?\n\n                           Leo\n          Let it drift.  All it means is a lot of people\n          know.\n\n                           Caspar\n          I guess you ain't been listening.  Sure other\n          people know.  That's why we gotta go to this\n          question of character, determine just who exactly\n          is chiseling in an my fix.  And that's how we\n          know it's Bernie Bernheim.  The Motzah Kid.\n          'Cause ethically, he's kinda shaky.\n\n                           Leo\n          You know Bernie's chiseling you because he's a\n          chiseler.  And you know he's a chiseler because\n          he's chiseling you.\n\n     Airily:\n\n                           Caspar\n          Sometimes you just know.\n\n                           Leo\n          . . . So you wanna kill him.\n\n                           Bluepoint\n          For starters.\n\n\n\n     Leo nods, thinking.  He swivels to look interrogatively at\n     Tom.\n\n     Tom gives an almost imperceptable shrug.  The ice cubes in\n     his glass clink.\n\n     Leo turns back to Caspar, pauses.\n\n                           Leo\n          . . . Sorry, Caspar.  Bernie pays me for protec-\n          tion.\n\n\n     Tom, peering over his drink, does not entirely conceal his\n     surprise.\n\n     Caspar stares at Leo, his mouth open.  It is not the\n     response he expected.\n\n                           Caspar\n          . . . Listen, Leo, I ain't askin, for permission.\n          I'm tellin' you as a courtesy.  I need to do this\n          thing, so it's gonna get done.\n\n                           Leo\n          Then I'm telling you as a courtesy that you'll\n          have trouble.  You came here to see if I'd kick\n          if you killed Bernie.  Well there's your answer.\n\n     Caspar's voice is harder:\n\n                           Caspar\n          Listen Leo, I pay off to you every month like a\n          greengrocer--a lot more than the Motzah--and I'm\n          sick a gettin' the high hat--\n\n                           Leo\n          You pay off for protection, just like everyone\n          else.  Far as I know--and what I don't know in\n          this town ain't worth knowing--the cops haven't\n          closed any of your dives and the O.A. hasn't\n          touched any of your rackets.  You haven't bought\n          any license to kill bookies and today I ain't\n          selling any.  Now take your flunky and dangle.\n\n     Caspar is staring at Leo.  He looks at Tom, then rises\n     slowly to his feet.  Back at Leo:\n\n                           Caspar\n          Ya know I'm tryin'. . . I'm tryin not to raise my\n          voice in anga.  I've always gone along to get\n          along.  But you make me lay off the Matzoh and\n          you're givin' me the needle.  I told you the\n          sheeny was robbin' me blind, I told you I wanna\n          put him in the ground and I'm telling you now I'm\n          sick a the high hat.\n\n     He swipes his hat from Bluepoint.\n\n          . . . You think I'm some guinea fresh off the\n          boat and you think you can kick me.  But I'm too\n          big for that now.\n\n     He puts his hands on the desk and leans towards Leo.\n     The cords stand out on his ndck.\n\n          I'm sick-of takin' the strap from you, Leo.  I'm\n          sick a marchin' down to this goddamn office to\n          kiss your Irish ass and I'M SICK A THE HIGH HAT!\n\n     Caspar stops, out of breath.  He is red faced and panting.\n     Bluepoint has put a gently restraining hand an his shoul-\n     der.\n\n     Leo and Tom stare at Caspar impasssively.\n\n     After a beat Caspar shuts his mouth.  His eyes lose some of\n     their glaze.  He looks at Bluepoint's hand, turns and\n     strides towards the door.\n\n                           Caspar\n          . . . Youse fuckin' fancy-pants, all of ya.\n\n     He opens the docr, but Leo's voice stops him.\n\n                           Leo\n                        (softly)\n          Johnny.  You're exactly as big as I let you be\n          and no bigger and don't forget it.  Ever.\n\n     Caspar looks at Lea from the open doorway.  After a beat he\n     chuckles.\n\n                           Caspar\n          Ats right, Leo, you're the big-shot around here.\n\n     He dances over at Tom again, then back to Leo:\n\n          . . . And I'm just some schnook likes to get\n          slapped around.\n\n     He leaves, Bluepoint following, shutting the door.\n\n     After a beat Tom crosses in front of the desk and sits down\n     in the chair Caspar has just vacated.  Leo chuckles and\n     leans back in his chair.\n\n                           Leo\n          Twist a pig's ear.  Watch him squeal.\n\n     Tom swallows the last of his drink and stares ruminatively\n     down at his glass.\n\n                           Tom\n          . . . Bad play, Leo.\n\n     Leo, unfazed, grins at Tom.\n\n                           Leo\n          Got up on the wrong side, huh?\n\n                           Tom\n          Same side as always.\n\n                           Leo\n          That's what I mean.  Still owe money to--who's\n          your bookie?  Lazarre? \n\n                           Tom\n          Mm.\n\n                           Leo\n          I could put it right for you.\n\n                           Tom\n          Thanxs Leo, I don't need it.\n\n                           Leo\n          In a pig's eye.  You haven't played a winner in\n          six weeks.  People'll speak ill of me if I let\n          him break your legs.\n\n     Tom grins back, for the first time.\n\n                           Tom\n          People'll say I had it coming.\n\n                           Leo\n          And they'll be right, but that ain't the point.\n          Call me a big-hearted slob, but I'm gonna square\n          it for ya.\n\n     He picks up a phone on his desk and starts to dial.\n\n          . . . Yeah, I think I'll do that, this very same\n          night.  Looking at you moping around takes away\n          all my . . . What did you call it?  Joy de veever.\n\n     Tom stands and walks over to the desk.\n\n                           Tom\n          Joi de vivre.\n\n     He takes the receiver from Leo and prongs the phone.\n\n                           Leo\n          Well look, if your gonna laugh at me, the hell\n          with you.\n\n     Tom walks to the door, putting an his hat.\n\n                           Tom\n          And with you.  I'll square myself with Lazarre if\n          you don't mind.  Thats why God invented cards.\n\n     He pauses in the doorway and turns back to Leo.\n\n          . . . There is something you can do for me.\n\n                           Leo\n          Name it.\n\n                           Tom\n          Think about what protecting Bernie gets us.\n          Think about what offending Caspar loses us.\n\n     Leo chuckles good-naturedly.\n\n                           Leo\n          Come on, Tommy, you know I don't like to think.\n\n     Tom has stepped into the hallway and, just as he closes the\n     door:\n\n                           Tom\n          Yeah.  Well, think about whether you should start.\n\n     The door clicks shut.\n\n     CUT TO BLACK\n\n\n\n2.   FADE IN:\n     THE WOODS   CREDIT SEQUENCE\n\n     Although it is day, the tree cover gives an effect of\n     almost cathedral-like darkness.  The sun filters down\n     through the leaves in gently shifting patterns.\n\n     We hear only the sound of the wind and the creaking and\n     groaning of tree limbs in the breeze.\n\n     Head titles are supered over the dissolving series of woods\n     scenes.\n\n     In the last woods scene the angle is low--almost ground-\n     level.  The sun dapples the floor of the forest, which is\n     carpeted with pine needles.\n\n     With a whoosh of rustling leaves the wind gusts a fedora\n     into frame.  For a moment it lies still in the foreground,\n     sunlight rippling over it, making it seem almost alive.\n     Then the wind picks up again and the hat tumbles away from\n     us, end over end, in slow motion into the background,\n     impossibly far away until . . . it dissappears.\n\n     As we fade out, we hear a distant knocking.\n\n\n3.   FADE IN:\n     CLOSE SHOT   TOM\n\n     Unshaven, eyes closed, motionless.\n\n     The head credits continue over this one-shot scene.\n\n     The knocking continues, faintly, offscreen.  As we hear a\n     door opening we pull back to a looser shot, revealinq that\n     Tom is slumped back on a tired green sofa.\n\n     A fat hand enters to shake Tom's shoulder.\n\n                           Voice\n          Wake up, Tommy.\n\n     Without ocening his eyes:\n\n                           Tom\n          I'm awake.\n\n                           Voice\n          You're eyes were shut.\n\n                           Tom\n          Who're you gonna believe?\n\n     Tom sits up, though it seems like an effort.  He looks\n     sick.\n\n     From a small mirror behind the couch we see that we are in\n     the back room of a gambling establishment.  The leavings of\n     a card game litter a table in the middle background.\n\n                           Tom\n          . . . How'd I do?\n\n                           Voice\n          What do you think.  You're a millionaire.  You\n          gonna remember your friends?\n\n     Tom reaches up to feel his head, and looks stupidly about.\n\n                           Tom\n          . . . Where's my hat?\n\n                           Voice\n          You bet it, ya moron.  Good thing the game broke\n          up before you bet your shorts.\n\n     After a beat of staring at nothing in particular, Tom\n     abruptly lurches to his feet and staggers out of frame.\n\n     The other man sits heavily onto the couch that Tom has just\n     vacated.  He is Fat Tony, a big man wearing an apron.\n\n     He watches as we hear Tom, offscreen, staggering across the\n     room, bumping into something which scrapes and then\n     clatters over, opening a door, staggering across tile, and\n     then vomiting.\n\n     Fat Tony watches with mild interest.\n\n     Finally:\n\n                           Tom's Voice\n          . . . Who left with my hat?\n\n                           Tony\n          Verna.  Verna and Mink.\n\n                           Tom\n          . . . Who?\n\n     Louder:\n\n                           Tony\n          Mink and Verna.\n\n     Offscreen we hear a tap running.\n\n                           Tom\n          . . . Thunderclap running tonight?\n\n                           Tony\n          Yeah.\n\n                           Tom\n          What's she leave at?\n\n                           Tony\n          Three-to-one, more'n likely.  Lay off, Tom.  You\n          shouldn't go deeper in the hole.\n\n                           Tom\n          Tell Lazarre I want five hundred on the nose.\n\n     Tony shrugs.\n\n                           Tony\n          You would have it.\n\n                           Tom\n          . . . Somebody hit me?\n\n                           Tony\n          Yeah.  Mink hit you.\n\n                           Tom\n          . . . Whyzat?\n\n     Tony inspects a hangnail on his thumb.\n\n                           Tony\n          You asked him to.\n\n\n\n4.   CUT TO:\n     A HALLWAY\n\n     A loose shot looking over Tom's shoulder as he knocks on an \n     partment door.  Head credits continue.\n\n     The door swings open and Verna, an attractive but hard-\n     looking woman in her late twenties or early thirties looks\n     coldly out at Tom.\n\n                           Tom\n                  (still slightly woozy)\n          Miss me?\n\n                           Verna\n          You again.  What now?\n\n                           Tom\n          I want my hat.\n\n                           Verna\n          . . . Is that all you came for?\n\n                           Tom\n          Yeah.  I want my hat.\n\n                           Verna\n          I won it.  It's mine.\n\n                           Tom\n          What're you gonna do with it?\n\n                           Verna\n          Drop dead.\n\n     She slams the door.\n\n     There is a long, motionless beat.  Tom raises his hand and\n     knocks again, missing the door completely on his first try.\n\n     After a knock or two the door swings open again.\n\n                           Tom\n          I need a drink.\n\n                           Verna\n          Why didn't you say so.\n\n     She steps away from the door and Tom enters the apartment.\n     As the door clicks shut we cut to black, and the last of\n     the movie's head credits.\n\n     Music clays under the credits, mixed in with the woods\n     sounds we heard earlier.  As the last of the credits is\n     fading to black we hear a distant knocking, and from black\n     we:\n\n\n\n5.   CUT TO:\n     CLOSE SHOT   A FEDORA\n\n     Lying on a marble bureau top in a dark room.  A gently\n     rippling cookie plays over it--light from a streetlamp\n     thrown through a curtained window.  Reflected in the bureau\n     mirror behind the fedora we see the soft glow of a burning\n     cigarette.\n\n\n     REVERSE\n\n     Tracking in on Tom, sitting in bed, smoking, staring at the\n     bureau.  The rippling street light plays over him from the\n     window.  We hear a distant knocking.\n\n\n     WIDER\n\n     The bedroom, as Tom swings his legs around and gets out of\n     bed.\n\n     Tom throws on a dressing gown and leaves the bedroom\n     through its double oak pocket doors, closing the doors\n     behind him.\n\n\n6.   LIVING ROOM\n\n     Also dark, lit only by streetlight filtering in.\n\n     The knocking is louder here.  Tom crosses the room,\n     silhouetted against the windows, to the apartment's front\n     door.  Light fans in as he opens it.\n\n     Shiftng uncomfortably in the hallway is Leo, in an\n     overcoat and fedora.\n\n                           Leo\n          'Lo, Tommy.  Sorry about the hour.\n\n                           Tom\n          I'll live.  What's the rumpus?\n\n                           Leo\n          Can i come in?\n\n     Tom thinks about this for the slightest beat.\n\n                           Tom\n          Sure.\n\n     He lets Leo precede him into the living room.\n\n     Tom turns on a lamp that sits on a rolling bar.\n\n          . . . Drink?\n\n                           Leo\n          I wouldn't mind. . . I tried calling earlier.\n\n                           Tom\n          I got home late.\n\n     As Tom sits down facing Leo with two drinks:\n\n                           Leo\n          Well. . . Sorry about the hour.\n\n                           Tom\n          Uh-huh.\n\n     He waits, with no apparent impatience.\n\n     The older man is uncomfortable; he is having trouble\n     finding the words.  Finally he lifts his glass and swallows\n     it in one gulp.\n\n                           Leo\n          . . . Not bad. . .\n\n                           Tom\n          Better than the paint we sell at the club.\n\n                           Leo\n          That it is. . . That it is. . .\n\n                           Tom\n          Thought about cutting Bernie loose?\n\n     Leo is shuffling his hat nervously from hand to hand.\n\n                           Leo\n          Can't do it, Tommy, can't do it. . . That's sort\n          of why I'm. . . Tommy. . . I don't know where\n          Verna is.\n\n     Tom fixes him with a level stare, then takes a sip of his\n     drink.\n\n                           Tom\n          Uh-huh.\n\n                           Leo\n          I know what you're thinking:  What else is new?\n          But the situation now, I'm worried. . .\n\n     Tom blows out air.\n\n                           Tom\n          Verna can take care of herself.  Maybe better\n          than you can.\n\n                           Leo\n          What does that mean?\n\n     Tom stands up, takes Leo's glass and walks back over to the\n     bar.\n\n                           Tom\n          Want another?\n\n                           Leo\n          No.  What does that mean?\n\n     Tom turns to look at Leo, pauses, then decides to speak:\n\n                           Tom\n          How far has she got her hooks into you?\n\n                           Leo\n          That's a hell of a question.\n\n                           Tom\n          It's a grift, Leo.  If she didn't need you to\n          protect her brother from Johnny Caspar, d'you\n          think she'd still go with you on slow carriage\n          rides through the park?  That is the deal, isn't\n          it?  You keep Bernie under wraps 'till Caspar\n          cools down?\n\n                           Leo\n          Jesus but you're a prickly pear.  What's wrong\n          with her wanting her brother taken care of?\n\n                           Tom\n          Not a thing.  I don't blame her.  She sees the\n          angle--which is you--and she plays it.  She's a\n          grifter, just like her brother.  They probably\n          had grifter parents and grifter grandparents and\n          someday they'll each spawn little grifter kids--\n\n                           Leo\n          Stop it, Tommy.  I don't like to hear my friends\n          run down.  Even by other friends.\n\n     Tom shrugs.\n\n                           Tom\n          Friendship's got nothing to do with it.\n\n                           Leo\n          The hell you say.  You do anything to help your\n          friends.  Just like you do anything to kick your\n          enemies.\n\n                           Tom\n          Wrong, Leo.  You do things for a reason.\n\n                           Leo\n          Okay, Tom, you know the angles--Christ, better\n          than anybody.  But you're wrong about this.  You\n          don't know what's in Verna's heart. . .\n\n     Tom stares down into his drink.  There is an awkward pause.\n     Then finally, without looking up:\n\n                           Tom\n          Leo, throw her down.  And her brother, too. Dump\n          her.\n\n     Leo looks like he has just been stepped on.\n\n                           Leo\n          Jesus, Tom. . . Verna's okay. . .\n\n     He nods to himself.\n\n          She's a little wild, but she's okay.  I\n          like her.\n\n     Tom smiles.\n\n                           Tom\n          Yeah, you like her.  Like the Kaiser likes\n          cabbage.  You're dizzy for her.\n\n     Leo scowls at Tom.\n\n                           Leo\n          What of it?  Jesus, Tom, ain't you ever been bit\n          by that bug?\n\n                           Tom\n          Leo, if she's such an angel, why are you looking\n          for her at four in the morning?\n\n     Leo digs his hands into his pockets and slouches back,\n     profoundly embarassed.\n\n                           Leo\n          I put a tail on her this afternoon.\n\n                           Tom\n          Hah!\n\n                           Leo\n          Yeah, I asked Rug Daniels to follow her around--\n          just, you know, just to keep her out of trouble.\n\n                           Tom\n          And to tell you what trouble she was managing to\n          whip up herself.\n\n                           Leo\n          It wasn't to spy, Tom; I was worried.  After that\n          meeting with Caspar, well--you can't be too\n          careful.\n\n                           Tom\n          Uh-huh.  And what did Rug tell you that has you\n          scurrying over here?\n\n                           Leo\n          That's just it.  Nothing.  He's disappeared.\n\n     Tom laughs humorlessly.\n\n                           Tom\n          So you've lost your ladyfriend and the tail you\n          put an her.\n\n                           Leo\n          I guess it does sound pretty sorry at that. . .\n\n     He looks from his empty glass up to Tom.\n\n          . . . Help me out, Tom.  I wouldn't know where to\n          start looking.  You know Rug's crowd, you know\n          the people Verna runs with.  I'm just worried\n          now, with things the way they are between me and\n          Caspar--\n\n     Tom gives a wave of disgust.\n\n                           Tom\n          You shouldn't be confronting Johnny Caspar, it's\n          what I've been trying to tell you.  You can't\n          trade body blows with him.  He's gotten too\n          strong.\n\n     For the first time Leo displays some testiness:\n\n                           Leo\n          I reckon I can still trade body blows with any\n          man in this town. . .\n\n     He sighs, looks back down at his drink.\n\n          . . . Except you, Tom.\n\n                           Tom\n          And Verna.\n\n     Leo smiles good-naturedly.\n\n                           Leo\n          Okay, give me the needle.  I am a sap, I deserve\n          it. . .\n\n     He stands and walks to the door.\n\n     Tom doesn't move.  His eyes remain fixed on the chair Leo\n     has just vacated.\n\n     Leo pauses in the open doorway.\n\n          . . . Thanks for the drink.  Let me know if you\n          hear anything. . .\n\n     The door closes and he is gone.\n\n     Tom grimaces and stands up.  Sunlight is just starting to\n     come in through the windows, defining for the first time\n     the corners of the large semi-circular room as Tom walks\n     across it to the bedroom.  Distant early-morning traffic\n     noise is filtering up from the street.\n\n\n7.   INT  BEDROOM\n\n     As Tom opens the double oak doors and enters, leaving them\n     open.\n\n     He crosses to the bed and sits an its edge, hunched\n     forward, thinking.  Behind him, a woman stirs.\n\n                           Woman\n                        (sleepily)\n          Who was that?\n\n                           Tom\n          Leo. . .\n\n     He takes a cigarette from the nightstand and lights it.\n\n          . . . He's looking for you.\n\n     Verna stiffens.\n\n                           Verna\n          Did you tell him I was here?\n\n                           Tom\n          No.\n\n     Verna relaxes.\n\n                           Verna\n          Did you put in a good word for my brother?\n\n                           Tom\n          No.\n\n                           Verna\n          You said you would.\n\n                           Tom\n          . . . I said I'd think about it.\n\n                           Verna\n          What did you tell him?\n\n     Tom is lost in thought.  He exhales smoke.\n\n                           Tom\n          . . . Did you see Rug Daniels last night?\n\n                           Verna\n          No.  What did you tell Leo?\n\n     Tom finally turns to face her.  After looking at her for a\n     beat:\n\n                           Tom\n          . . . I told him you were a tramp and he should\n          dump you.\n\n     A shoe flies past his head and hits the wall behind him.\n\n                           Verna\n          You're a son of a bitch, Tom.\n\n\n\n7.   EXT  ALLEYWAY   EARLY MORNING\n\n     We are on an extreme close shot of a small dog.  Behind\n     him, in the distance, we can see the mouth of the alley.\n\n     The dog is on point, perfectly still, one front leg crooked\n     and raised off the ground, his ears pointed straight up,\n     his eyes in a fixed stare.\n\n\n     A MAN\n\n     is slouched, half-sitting, against the wall of the alley.\n     He is motionless.  His mouth is agape.  His eyes are rolled\n     up in a lifeless stare.\n\n     He is wearing an overcoat but it is unbuttoned and reveals\n     a blood stain in the middle of his chest.  His fedora lies\n     on the ground near one of his splayed hands.\n\n     There is something subtly odd about his hair.\n\n\n     CLOSE SHOT   A LITTLE BOY\n\n     Perhaps five years old.  He stares down at the dead man in\n     front of him.\n\n\n     CLOSE SHOT   THE MAN\n\n     Staring vacantly.\n\n\n     THE BOY\n\n     After a moment, he reaches forward.\n\n\n     THE MAN\n\n     As the boy's hand enters frame.  The boy pokes once at the\n     man's shoulder.\n\n     There is no reaction.\n\n     The boy touches the top of the man's head.\n\n     The man's hair slips forward a couple of inches over over his\n     forehead.\n\n\n     THE BOY\n\n     Staring.\n\n\n     THE MAN\n\n     Also staring, his skewed hairpiece ill becoming his stunned\n     expression.\n\n     The boy reaches forward and takes the hairpiece off the\n     man's head.  Now a bald man stares off into smace, still\n     looking stunned, still quite dead.\n\n     WIDE SHOT   THE ALLEY\n\n     The dead man and the little bov face each other in profile\n     in the middle foreground.  In the background, between them,\n     the little boy's dog faces us, still on point, still\n     whining.\n\n     The little boy is fascinated by the hairpiece he holds.  He\n     turns it over and around, and looks from it to the dead\n     man.\n\n     Suddenly the boy turns and runs, away from us, towards the\n     mouth of the alley, still clutching the hairpiece.\n\n     As he passes the dog it turns and runs after him, wagging\n     its tail, happy to be leaving.\n\n     FADE OUT\n\n\n\n9.   FADE IN:\n     INT   DINER EVENING\n\n     A man sits facing us at the counter in the foreground.  His\n     face is hidden by the newspaper he is reading.\n\n     The page of the newspaper being presented to the camera\n     bears a story headlined:  GANGSTER SLAIN.  The subhead:\n     Politician's \"Aide\" Found Dead in Alley.\n\n     After a beat the diner drops the paper to the counter, and\n     we see that it is Tom, wearing overcoat and hat.  He is\n     grimacing at whatever he was reading.  He stands and digs\n     into his pocket.\n\n\n     REVERSE\n\n     Looking down at the newspaper an the counter, next to a\n     steaming cup of coffee.  Tom's hand enters to put some\n     change on the counter, leaves, and we hear his receding\n     footsteps.\n\n     The headlined story on the page Tom was reading is:\n     THUNDERCLAP INJURED IN RACING MISHAP.\n\n\n\n10.  CUT TO:\n     TRACKING IN TO CLOSE SHOT   PLAQUE\n\n     Set into the brick of a building's exterior, it reads:\n     SHENANDOAH CLUB.  In script underneath: Members Only.\n\n\n\n11.  INT   THE CLUB   NIGHT\n\n     Tracking towards the front door as Tom enters.  He puts his\n     coat and hat on the check counter.\n\n                           Tom\n          Hello, Beryl--\n\n     Her arm sweeps across frame to slap Tom hard.\n\n                           Check Girl (off)\n          Ain't you got a conscience?\n\n     Tom stares dumbly.\n\n\n     ON BERYL\n\n     A diminutive woman in a french maid's uniform with a pill\n     box hat.  She rocks her weight on one leg with her hands\n     proceed defiantly on her hips.\n\n          . . . It's a little voice inside that tells you\n          when you been a heel!\n\n                           Tom\n          Mine's been mum lately--what'd I do?\n\n                           Beryl\n          Stood me up is all.  Made me wait an hour and a\n          half is all?  Or maybe you don't remember sayin'\n          you'd pick me up after work last night.  I seen\n          heels in my time, sure, plenty of 'em!  But none\n          so low as couldn't tell me to my face when they\n          was sick of me! . . .\n\n     She throws a check number at him.\n\n          . . . You know where you can stick it!\n\n\n\n12.  CUT TO:\n     TRACKING SHOT\n\n     Pulling Tom as he walks across the gambling floor.  He is\n     joined bv a nervous young man in a tuxedo.\n\n                           Mink\n          'Lo Tom.  What's the rumpus?\n\n                           Tom\n          Mink.\n\n     Mink throws a glance back in the direction of the coat\n     check.\n\n                           Mink\n          . . . I see you got your hat back.\n\n                           Tom\n          Yeah, what of it.\n\n                           Mink\n          Not a thing, Tommy.  I got not a thing to say.\n          Listen, Bernie wants to see you.  It's important.\n\n                           Tom\n          Well I'm right here, and I'm not made of glass.\n\n                           Mink\n          Yeah, but he's nervous walkin' around in public.\n          He's a right guy, but he's nervous, Tommy!  He's\n          very nervous!  Who wouldn't be?!\n\n     Tom looks at Mink for the first time.\n\n                           Tom\n          Mink--\n\n                           Mink\n          The spot he's in, who wouldn't be!  He asked me\n          to ask you to ask Leo to take care of him.  You\n          know, put in a good word with Leo.  Leo listens\n          to you.  Not that Leo wouldn't help the Motzoh\n          anyway!  A guy like Bernie?  A square gee like\n          the Motzah!  A straight shooter like him?\n\n                           Tom\n          I don't get it, Mink--\n\n                           Mink\n          What's to get?!  It's as plain as the nose--\n\n                           Tom\n          I thought you were Bluepoint's sycophant.\n\n                           Mink\n          Yeah Tom, that's right.  But a guy can have more\n          than one friend, can't he?  Not that I'd want\n          Bluepoint to know about it, but a square gee like\n          the Motzah?  He's a right guy, Tom!  He's a\n          straight shooter!  I know he's got a mixed\n          reputation, but for a sheeny he's got a lot a\n          good qualities!\n\n     Tom has reached the foot of a large staircase.  He turns to\n     look at Mink with mild curiosity.\n\n                           Tom\n          Why should I care what happens to Bernie?\n\n                           Mink\n          C'mon Tom, you like Bernie dontcha?\n\n                           Tom\n          I don't like anybody, Mink, you know that.\n\n                           Mink\n          Well, you like his sister.\n\n                           Tom\n          What's that supposed to mean?\n\n                           Mink\n          Nothing, Tom.  If it ain't my business I got not\n          a thing to say.\n\n     Tom studies Mink for a beat.\n\n                           Tom\n          What's going an between you and Bernie?\n\n                           Mink\n          Nothin, Tom!  We're just friends--you know,\n          amigos?\n\n     He sics on his cigarette and looks nervously around the\n     floor, then back at Tom, who stares coolly back.\n\n                           Tom\n          You're a fickle boy, Mink.  If Bluepoint found\n          out you had another \"amigo\"--well, I don't peg\n          him for the understanding type.\n\n     Mink is startled.  In a high shrill voice, as Tom walks up\n     the stairs, clutching his drink:\n\n                           Mink\n          Find out!?  How would he find out?!  Damnit Tom,\n          me and you ain't even been talking!  Jesus Tom,\n          damnit, Jesus!\n\n\n\n13.  INT   LEO'S OFFICE\n\n     Pulling Tom as he enters the office.\n\n                           Leo (off)\n          'Lo, Tom.  You know O'Gar. . .\n\n\n     REVERSE\n\n     Leo faces us from behind his desk.\n\n     Seated in two chairs facing the desk, twisting around to\n     greet Tom, are two men.  O'Gar is a large man wearing a\n     police uniform.  Dale Levander wears a suit; a florid man\n     with a shock of white hair, in his mid-sixties.\n\n                            Leo\n          . . . and the mayor.\n\n                            Tom\n          I ought to.  I voted for him six times last May.\n\n     Levander chuckles.\n\n                           Levander\n          And that ain't the record, either.\n\n     Tom is crossing to the bar.\n\n                           Leo\n          Verna turned up.  She's downstairs.\n\n     Tom, his back to Leo as he pours a drink, stiffens.\n\n                           Tom\n          . . . She say where she'd been?\n\n                           Leo\n          No, I uh. . . didn't want to press her.  Hear\n          about Rug?\n\n     Drink in hand, Tom turns and crosses to perch an a corner\n     of Leo's desk.\n\n                           Tom\n          Yeah, R.I.P.\n\n                           Leo\n          They took his hair, Tommy.  Jesus that's strange.\n          Why would they do that?\n\n                           Tom\n          Maybe it was Injuns.\n\n                           Leo\n          Eye-ties, more like it.  Giovanni Casparro.\n\n                           Tom\n          So you figure it was Caspar bumped Rug?\n\n     Leo, with a puzzled smile, glances at O'Gar and the mayor,\n     and then back at Tom.\n\n                           Leo\n          . . . Well it's pretty obvious ain't it?\n\n                           Tom\n          Mm. . . So what's the plan?\n\n                           Leo\n          Jump on the guinea hard.  With both feet.\n\n     He looks at the mayor who shifts uncomfortably in his seat.\n\n          . . . Give him the low-down, Dale.\n\n                           Mayor\n          Yes, well. . . Leo here has just reminded us that\n          Mr. Caspar operates several clubs in our city\n          wherein the patrons imbibe of rum and play at\n          games of chance.\n\n     Morosely:\n\n                           O'Gar\n          And we're sunnosed to stop the party.\n\n                           Tom\n          Uh-huh. . .\n\n     Looking at Leo, he jerks his head towards the two men.\n\n          . . . They don't seem too happy about it, Leo.\n\n                           O'Gar\n          Naw, it ain't that, Tom.\n\n                           Mayor\n          Jesus, Tom!  We do as we're told!\n\n     Tom ignores them.\n\n                           Tom\n          Maybe they're right not to like it.  Stirring up\n          this hornets' nest won't be good for anyone.  And\n          it'll mean killing.\n\n                           Leo\n          Well I'm not thrilled about it either, but I\n          can't just lay down to Caspar.\n\n                           Tom\n          You could do worse.  You might not like it, but\n          giving up Bernie Bernheim is a pretty small price\n          to pay for peace.  Business is business and a\n          war's going to hurt everybody.  Bernie plays with\n          fire, he's got to deal with the consequences--\n          even if that means he gets bumped off.\n\n                           Leo\n          Sweet Jesus, Tom, that ain't even the point\n          anymore.  Caspar pooped Rug.  The day I back down\n          from a fight, Caspar is welcome to the rackets,\n          this town, and my place at the table.  I didn't\n          start this thing, but--\n\n     Tom's voice is sharp:\n\n                           Tom\n          You did start it--you and Verna--\n\n     The mayor has risen to his feet.  Uncomfortably:\n\n                           Mayor\n          We can dangle, Leo, if you'd prefer.\n\n                           Leo\n          Siddown Dale, we're all friends here.\n\n                           Tom\n          --and Caspar hasn't broken the rules, Bernie has-\n          -and you too, by helping him.  And if that isn't\n          enough, consider that if you make it a war, you\n          have more to lose than Caspar.\n\n     Leo is getting up from behind the desk and walking over to\n     stare out the window.\n\n                           Leo\n          Okay, but more to beat him with.  Jesus, Tom, the\n          two of us've faced worse odds.\n\n                           Tom\n          But never without reason.  It helps to have one.\n\n     Leo doesn't reply.  Tom is irritated, but shrugs indif-\n     ference.\n\n          . . . Well, it's your call.\n\n     He gets to his feet and starts for the door.\n\n          . . . My opinion use to count for something\n          around here, but it's always yours to take or\n          leave.\n\n     Leo has turned from the window and is striding after Tom,\n     gesturing appologetically.\n\n                           Leo\n          Aw, c'mon Tommy.  Its not like that. . .\n\n     The door clicks shut.\n\n          . . . Goddamnit.  Goddamn kid is just like a\n          twist.\n\n\n\n14.  CUT TO:\n     FAT TONY\n\n     Tending the downstairs bar as Tom stalks over.\n\n                           Tom\n          Gimme a stiff one.\n\n                           Tony\n          No small talk, huh?  They shoot vour nag?\n\n     Tony has finished pouring a shot of whiskey which Tom\n     immediately knocks back.\n\n                           Tom\n          If there's any justice.  Verna around?\n\n                           Tony\n          She stepped into the ladies, room.  You got\n          Lazarre's five hundred?\n\n                           Tom\n          He'll have to carry me for a few days.\n\n     Tom is pouring himself another drink.\n\n                           Tony\n          He ain't gonna like that.  Couldn't, you get it\n          from Leo?\n\n     Tom is irritated:\n\n                           Tom\n          It's not Leo's debt.  I'll pay my own way.\n\n                           Tony\n          I admire a man of principle.  Does this go on the\n          tab?\n\n     Drink in hand, Tom is already walking away.\n\n\n\n15.  INT   LADIES' LOUNGE\n\n     As Tom bangs through the door, still carelessly holding his\n     tumbler of whiskey.  A rogue lock of hair hangs down over\n     his forehead.\n\n                           Tom\n          Close your eyes, ladies, I'm coming through.\n\n\n     REVERSE\n\n     The hubbub of female voices evaporates as all turn to look\n     at the male intruder.\n\n     The lounge's decor is done in various shades of pink.  Some\n     of the women apply make-up facing the large bulb-encircled\n     mirrors on overstuffed seashell shaped pink chairs.  Other\n     women sit, smoking, in the banquettes that line the other\n     wall.\n\n     All react to Tom's entrance with surprise mixed with\n     various degrees of outrage, and they hurry to gather their\n     things and leave.  The one exception is Verna, who looks at\n     Tom with unperturbed distaste.\n\n     As he crosses to her seashell chair:\n\n                           Tom\n          Who's the warpaint for?\n\n                           Verna\n          Go home and dry out.\n\n                           Tom\n          You don't need it for Leo, believe me.  He\n          already thinks you're the original Miss Jesus.\n\n     She glances hurriedly around the lounge, but the last of\n     the women are already leaving.\n\n                           Verna\n          . . . What the hell's the matter with you?\n\n                           Tom\n          What's the matter with you?  Afraid people might\n          get the right idea?\n\n     Verna studies him for a beat.\n\n                           Verna\n          Leo's got the right idea.  I like him, he's\n          honest and he's got a heart.\n\n     Tom weaves a couple of steps closer to her.\n\n                           Tom\n          Then its true what they say.  Opposites attract.\n\n                           Verna\n          Do me a favor and mind your own business.\n\n     She turns back to the mirror and starts applying her\n     lipstick.  Tom drops down to face her in the mirror.\n\n                           Tom\n          This is my business.  Intimidating helpless women is\n          part of what I do.\n\n                           Verna\n          Then find one and intimidate her.\n\n     Tom swallows the rest of his drink in one gulp.\n\n                           Tom\n          Leo's upstairs getting ready to shoot himself in\n          the foot on your account.\n\n                           Verna\n          I don't know what you're talking about.\n\n                           Tom\n          He's gonna go to the mat for your brother.  And\n          it's gonna hurt him.\n\n                           Verna\n          I don't know Leo's business, but he's a big boy.\n\n                           Tom\n          He used to be.\n\n     Verna causes with the lipstick.  She looks at Tom intently\n     but her tone softens.\n\n                           Verna\n          Look.  What do you want, Tom?  You want me to\n          pretend I don't care what happens to Bernie?\n          Well I do.  He's my brother and I don't want him\n          to get hurt.  If Leo wants to help him out I'll\n          step out with him, show him a good time in\n          return.  There's no harm in that.\n\n                           Tom\n          There's a name for that kind of business arrange-\n          ment.\n\n                           Verna\n          I'll do what I have to for Bernie and there's no\n          reason for you to try and queer that.  Regardless\n          of what you think of me, Bernie's a decent guy.\n\n                           Tom\n          A straight shooter, huh?  A square gee?\n\n                           Verna\n          Yeah, sneer at him like everyone else.  Just\n          because he's different.  People think he's a\n          degenerate.  People think he's scum.  Well he's\n          not.\n\n                           Tom\n          Poor misunderstood Bernie.\n\n     Verna swivels around to stare quizzically at Tom.\n\n                           Verna\n          . . . What is this about?  You want me to stop\n          seeing Leo . . . Why don't you just say so?\n\n                           Tom\n          I want you to quit spinning Leo in circles and\n          pointing him where to go.\n\n                           Verna\n          I forgot--that's your job, isn't it?\n\n                           Tom\n          I'll do what I have to to protect Leo.  I'm\n          asking you--politely, for me--to leave him alone.\n          I don't have to ask.  If I told him about our\n          little dance last night, your pull would dry up\n          pretty fast.\n\n     Now Verna is irritated:\n\n                           Verna\n          So would yours.  I don't like being threatened.\n\n                           Tom\n          I don't like being played for a sucker.  That\n          game might work with Leo but it won't work with\n          me.\n\n                           Verna\n          You think last night was just more campaigning\n          for my brother?\n\n                           Tom\n          I can see the angles. . .\n\n     He grabs her by the arm and drags her roughly to her feet.\n\n          . . . And I know if there was a market for little\n          old ladies, you'd have Grandma Bernheim first on\n          line.\n\n                           Verna\n               (struggling to get out of his grasp)\n          You're a pathetic rumhead.\n\n                           Tom\n          And I love you, Angel.\n\n     Tom takes her hat off, tosses it onto the chair, and kisses\n     her roughly on the lips.\n\n     Verna breaks away and socks him on the jaw.  Tom staggers\n     back, upsetting a table of toiletries and landing against a\n     banquette.\n\n     He throws his empty whiskey glass at Verna.\n\n     She ducks and it smashes into the mirror.\n\n     They stand staring at each other for a beat, breathing\n     hard.  Tom has a smear of lipstick near one side of his\n     mouth.\n\n     Finally:\n\n                           Verna.\n          . . . I suppose you think you've raised hell.\n\n     She picks up her stole and heads for the door.\n\n     Tom stands staring at her back, swaying, ever so slightly.\n\n                           Tom\n          Sister, when T've raised hell you'll know it.\n\n\n\n16.  CUT TO:\n     INT   TOM'S APARTMENT\n\n     A wide shot, facing the semi-circular windows, the door of\n     the apartment behind us.  A large easy chair in the middle\n     foreground faces away from us: a smaller chair is at the\n     window end of the room, facing us.\n\n     At the cut we hear the ringing of the telephone.\n\n     Offscreen we can hear the unhurried scrape of a key in the\n     lock, then the door opening, then the door closing.\n\n     Tom's back enters frame as he strolls into the room and\n     then disappears briefly through an open doorway to the\n     right.  We hear an icebox door opening and closing, and\n     then Tom reenters again, still not reacting to the insis-\n     tently ringing phone.  He is now holding a balled-up towel.\n\n     He walks over to the facing chair at the window end of the\n     room, shrugs off his overcoat, drapes it on the chair,\n     sits, crosses his legs, takes off his hat, tosses it onto\n     the upraised toes of his crossed leg, tilts his head back,\n     and presses the towel against his forehead--apparently it\n     is an icepack.\n\n     We are beginning to track slowly towards him.\n\n     After a beat he takes out a cigarette, lights it, and\n     reaches back for the phone that refuses to stop ringing.\n\n                           Tom\n          Yeah. . .\n\n     He casually looks forward, just off to one side, at a\n     specific point in space.  He does not react to whatever he\n     is hearing.\n\n          . . . I need a couple days. . . Because I don't\n          have it now. . .\n\n     We are almost in close shot now.  His gaze is still fixed\n     and emotionless.\n\n          . . . Because I say so. . . What would be good\n          enough?. . . Well, if it'll make him feel any\n          better, tell Lazarre he can send someone by to\n          break my legs.  I won't squawk.\n\n     He prongs the earpiece, still looking off.  The track has\n     stopped in close shot.  He exhales a stream of smoke, then\n     after a beat:\n\n          . . . 'Lo, Bernie.\n\n\n     REVERSE\n\n     Slouched in a chair, in the corner of the room, facing Tom,\n     is Bernie Bernheim.  He is about thirty and wears his\n     overcoat and hat and a good-natured smile.  He holds an\n     apple in one hand and a paring knife in the other.  The\n     long peel of the apple corkscrews down off the knife.\n\n                           Bernie\n          'Lo, Tom.  What's the rumpus?\n\n                           Tom\n          C'mon in, make yourself at home.\n\n                           Bernie\n          Yeah, you weren't here so I thought I'd do that.\n          Didn't wanna answer the phone, though.  Figured\n          it wasn't for me.\n\n                           Tom\n          Uh-huh.\n\n     After a silent beat, Bernie chuckles.\n\n                           Bernie\n          . . . I get it, get to the point, huh?  Okay.\n          The point is: I'm a good guy.\n\n                           Tom\n          I've heard that from a lot of people today.\n\n     Bernie slices off an apple section and holds it out to Tom,\n     who shakes his head.\n\n                           Bernie\n          Good guy, lot of friends--that's the way it\n          works.  Maybe if you appreciated me a little\n          more, you wouldn't be making waves with Leo.\n\n     He pops the slice in his mouth.\n\n          It's a bad time to be doing that.  I mean, right\n          now we're both in a jam.  I hear you're on a bad\n          streak, short of funds, and I've got that\n          psychotic guinea mad at me.  Don't ask me why;\n          I'm just a small-timer trying to get by, like\n          everyone else.  I need help from my friends.\n          Like Leo.  And you.\n\n                           Tom\n          Leo gets your sister, what're you selling me?\n\n                           Bernie\n          C'mon Tom, its not like that at all.  Wasn't\n          my idea.  She'll sleep with anyone, you know\n          that.  She's even tried to teach me a thing or\n          two about bed artistry.  Can you believe that--my\n          own sister!  Some crackpot idea about saving me\n          from my friends. . .\n\n     Bernie laughs pleasantly.\n\n          She's a sick twist all right.  I guess some\n          guys like that.\n\n                           Tom\n          She speaks highly of you.\n\n     Bernie shrugs.\n\n                           Bernie\n          Yeah, well, you stick by your family.  The point\n          is, I can help you with your debts if that would\n          make us friends.  My motto is, a guy can't have\n          too many.  Big payday Saturday, Tom.  You could\n          be in on it.\n\n     For the first time, Tom is interested.\n\n                           Tom\n          Another fix?  Which fight?\n\n                           Bernie\n          Well that's confidential at the moment.  But it\n          doesn't have to stay that way.\n\n     Tom gives Bernie a speculative eye.\n\n                           Tom\n          How d'you know about it?  Caspar isn't laying any\n          more bets with you.\n\n                           Bernie\n          Mm.\n\n     Tom gives a humorless smile.\n\n                           Tom\n          . . . You must really have Mink jumping through\n          hoops.\n\n     Bernie is getting to his feet wiping the knife blade on his\n     coat.\n\n                           Bernie\n          Like I say, you can't have too many.\n\n     He pauses at the open door, looks up and down the hall and\n     turns to look at Tom.\n\n          . . . We got a deal?\n\n                           Tom\n          . . . I'll think about it.\n\n     On his way out:\n\n                           Bernie\n          I wouldn't want it any other way.\n\n     On the click of the door latch we cut to:\n\n\n\n17.  STREET   DAY\n\n     Pulling Tom along the sidewalk.\n\n                           Tom\n          Cud. . .\n\n     He is calling out to a short rail-like man lounging against\n     a building who joins him as he walks.  Cud has small sharp\n     features except for one cheek, which is hugely distended by\n     a wad of chewing tobacco.\n\n          . . . My credit still good with you?\n\n     Cud gives a so-so flutter of his hand.\n\n          . . . Give me a hundred across on Tailor Maid in\n          the third tonight.\n\n     Cud shakes his head.\n\n                           Cud\n          Lazarre won't like it.\n\n                           Tom\n          Try fifty across.\n\n     Cud shrugs.\n\n                           Cud\n          I'll try.  That'll make another one-fifty you owe\n          him.\n\n                           Tom\n          Only if I lose, Cud.\n\n                           Cud\n          Tommy, the way you're goin'--horses got knees?\n\n                           Tom\n          I dunno.  Fetlocks.\n\n                           Cud\n          Well the way you're goin', if I was a horse I'd\n          be down on my fetlocks prayin' you don't bet on\n          me.\n\n     Another man, a huge man, has walked up to flank Tom's other\n     side.  This is Frankie.\n\n                           Frankie\n          Drift, small guy.\n\n                           Cud\n          Drop dead, ape.\n\n                           Frankie\n          C'mon Tom, my boss wants to see you.  He didn't\n          have time to engrave nothin' formal.\n\n     Cud starts to fade away.\n\n                           Cud\n          I'll see you later, Tommy.  I gotta go spit.\n\n\n\n18.  INT   ROOM\n\n     It is a large room with a couple of card tables, straight-\n     backed chairs, a ratty sofa--a sparsely furnished card room\n     off the main floor of a club.\n\n     At the cut we are tracking behind Tom into the room as\n     Frankie and Tic-Tac, a small ferret-faced-man, escort him\n     in.  We hear a woman's voice speaking rapid-fire Italian.\n\n     Bluepoint is sitting on the couch, wearing his overcoat and\n     his hat pushed back an his forehead.\n\n     Sitting at one of the card tables is Caspar.  With him is\n     his wife, a short, very round Italian woman, and his son,\n     Johnny Jr.  Johnny Jr., about five years old, is also very\n     round.  He wears a suit with short pants that reveal\n     dimpled knees.\n\n     Bluepoint, an the couch, is watching the domestic scene\n     without any particular warmth.\n\n                           Caspar\n          Whaddya mean he's eatin' too much?  Whadduz the\n          goddamn doctor know?\n\n     He turns to the little boy.\n\n          . . . What you eat for lunch?\n\n                           Johnny Jr.\n          A hot dog.\n\n                           Caspar\n          Just a hot dog?\n\n     The boy shakes his head.\n\n                           Johnny Jr.\n          A hot dog and mustard.\n\n     Caspar throws his head back and roars with laughter.\n\n                           Caspar\n          A hot dog with mustard!  A hot dog with mustard!\n          You hear that, Bluepoint!  The kids as smart as a\n          whip!  Even Uncle Bluepoint thinks that's funny.\n\n     Bluenpoint's face is a solem mask.\n\n          . . . Whadduz the goddamn doctor know!\n\n     Caspar wipes away tears of mirth and digs in his pocket\n     with his left hand.  Extending two closed fists towards the\n     boy:\n\n          . . . G'head, which hand is the penny in?\n\n     The boy touches his right fist.\n\n          . . . Choose again.\n\n     The boy just looks at him.\n\n          . . . Okay, here ya go.  Take the penny.  Shiny\n          new penny.\n\n     To his wife.\n\n          . . . Take the kid.  Wait in the car.  Give'm\n          a penny, boys.\n\n     Tic-Tac and Frankie dig in their pockets for change as the\n     boy and his mother cross to the door.\n\n                           Frankie\n          I ain't got a penny, boss.\n\n     Caspar has turned his attention to a check book that lies\n     on the table in front of him.  As he writes:\n\n                           Caspar\n          Ah, well, that's a penny ya owe him.  'Lo Tom,\n          what's the rumpus?  You like kids?\n\n                           Tom\n          No.\n\n     Absently:\n\n                           Caspar\n          Uh-huh.  Have a seat.  G'ahead.\n\n     He tears out the check.\n\n          . . . Well, you're missin' out on a complete\n          life.  I know, kids, big deal, but still, I'm\n          tellin' ya.\n\n     He blows on the check.\n\n          . . . Anyway. . . Thanks for comin' by.  I just\n          wrote this check out to your bookmaker, Lazarre.\n          It's for an even fifteen hundred, which is more\n          than I hear you owe him but I figure you can\n          always use some money on the cuff, a high roller\n          such as yaself whaddya say?\n\n                           Tom\n          . . . Thanks.\n\n     Caspar laughs.\n\n                           Caspar\n          Always the yapper, huh?  Well, you're welcome.\n          You wanna know why I'm putting you square with\n          Lazarre?\n\n                           Tom\n          Not particularly.\n\n                           Caspar\n          Bad feeling.  It ain't a good thing.  It's a\n          poison, kid.  I want everybody to be friends.  I\n          do this, you're friends with Lazarre, he's\n          friends with you, and you're friends with me.\n          And all you gotta do, show you're a friend, is to\n          give me Bernie Bernheim.  You know it's the right\n          thing anyway; I can't keep any discipline if I\n          can't punish the people I need to punish.  The\n          Motzah steals from me, I can't have Leo givin'\n          him a shiny new penny. . .  You find some way to\n          make Leo understand that.\n\n                           Tom\n          So the deal is, I give you the Motzah, smooth it\n          over with Leo, and you bail me out with Lazarre.\n\n                           Caspar\n          Yeah, then we're all friends again: You, me,\n          Leo, Bluepoint.\n\n     Bluepoint sneers from the couch:\n\n                           Bluepoint\n          We can maybe have tea sometime.\n\n                           Caspar\n          C'mon, Bluepoint.  Friends is a mental state.\n          Wuddya say, kid?\n\n                           Tom\n          . . . I'll think about it.\n\n                           Caspar\n          He'll think about it.  Hear that, Bluepoint?\n          That's terrific.  The kid's a thinker.\n\n                           Bluepoint\n          Does he want a pillow for his head?\n\n                           Caspar\n          Okay kid, think about it.  It's a mental state.\n          But make it quick, my family's waitin'.\n\n                           Tom\n          I'll think about it and tell you later.\n\n                           Bluepoint\n          He needs to think in the thinking room.\n\n     Caspar shakes his head sadly.\n\n                           Caspar\n          Kid, if it'll help you think, you should know\n          that if you don't do this you won't be in any\n          shape to walk outa here.\n\n     Tom considers this.\n\n                           Tom\n          . . . Would that be physically, or just a mental\n          state?\n\n     Caspar stares at him for a beat, then slowly starts to tear\n     up the check.\n\n                           Caspar\n          . . . That ain't friendly, kid.  I make you a\n          nice offer, I get the high hat.\n\n     He gets up and walks over to the door.  Tic-Tac opens it\n     for him and precedes him out.\n\n     Before following Caspar out the door, Bluepoint grins at\n     Tom.\n\n                           Bluepoint\n          Too bad for you, smart guy.\n\n     He leaves, shutting the door.\n\n     The room is quiet.\n\n     Tom looks at Frankie, the large man, who looks back.\n\n     Frankie stands, takes off his suit coat, and hangs it\n     carefully on a rack by the door.\n\n     He approaches Tom.\n\n                           Tom\n          Hold it.\n\n     Frankie complies.  Tom is standing and shrugging off his\n     coat.  He folds it neatly and turns to lay it on the chair\n     he was in.\n\n     When he turns around again he is holding the chair and he\n     smashes it into Frankie's face.\n\n     Frankie staggers back but doesn't drop.  He reaches up to\n     his nose and his hand comes away bloody.\n\n                           Frankie\n          . . . Jesus, Tom.\n\n     Tom still holds the chair.\n\n     Frankie looks at him for a moment, then walks over to the\n     door, opens it, and leaves, shutting it behind him.\n\n     The room is very quiet.  Tom stands facing the door, still\n     holding the chair.  After a beat or two, he starts to put\n     it down.\n\n     The door opens and he quickly raises the chair again.\n\n     Tic-Tac, the little man with the hawk nose, is striding\n     into the room, briskly approaching Tom.  Frankie, the\n     gorilla, follows cautiously.\n\n     Tic-Tac blocks Ton's swing of the chair with his forearm,\n     wraps both arms around it and pulls it awav from Tom.  As\n     Frankie circles Tom, Tic-Tac tosses the chair across the\n     room.\n\n     Frankie, now behind Tom, wallops him in the small of the\n     back.  The blow sends him staggering towards Tic-Tac, who\n     cracks him in the jaw.\n\n     Frankie grabs Tom's hair and yanks his head back as Tic-Tac\n     works on his midsection.  Tom's hands are reaching back to\n     grope for Frankie.\n\n     Still holding his hair with one hand, Frankie cuffs Tom\n     awkwardly on the side of the head.  Tom staggers around and\n     Tic-Tac, now behind him, also hits him on the side of the\n     head.\n\n     Tom goes down.  His head hits the floor with a thunk.\n\n     We are on a low angle an the floor.  Behind Tom's head, in\n     the background, we see the door to the room.\n\n     The door splinters in with a loud crash.\n\n     Frankie's feet are walking up alongside Tom's head, as blue\n     uniforms stream into the room.\n\n                           Frankie\n          Just in the nick of time, huh?\n\n     He brings his foot back to deliver a walloping kick to the\n     back of Tom's head.  On the impact we cut to:\n\n     BLACK\n\n     Over black we hear the sound of running water.\n\n\n\n19.  FADE IN:\n     TOM\n\n     Gasping for air as his head is pulled out from under a\n     running faucet.\n\n     The uniformed policeman who was holding him there and is\n     now pulling him back up, grins at him.\n\n                           Cop\n          No harm done.  Unless your friend broke his foot.\n\n     Tom is still woozy.\n\n                           Tom\n          . . . Wuzzit. . . How long. . . What day is it?\n\n                           Cop\n          Friday, 12th of September, 1929.  Same as when\n          you left us, about ten seconds ago. . .\n\n     He is leading Tom by the arm out of the cramped bathroom,\n     back into the card room where he was beat up.  Another cop\n     has Frankie cuffed in a straightbacked chair and is taking\n     roundhouse swings at him.  He pauses, breathing heavily.\n\n                           Second Cop\n          . . . 'Lo, Tom.  Care to skin a knuckle an your\n          playmate here?\n\n                           Tom\n          No. . . thanks, Delahanty. . .\n\n     As Tom and the first cop leave the card room:\n\n                           Second Cop\n          Well if you change your mind, we'll be inter-\n          rogatin' for a while. . .\n\n     Tom and his escort are emerging onto the casino floor.\n\n                           First Cop\n          What was that party about, anyway?\n\n                           Tom\n          We do this every weekend.\n\n     Blue uniforms are everywhere.  Some are escorting tuxedoed\n     patrons and employees to the exit; some wield axes on the\n     gaming equipment; others are using nightsticks to smash the\n     bottles behind the bar.  Tom winces at this and lights a\n     cigarette.\n\n                           Tom\n          Jesus. . .\n\n     He takes a battle and glass from a table as they walk by.\n\n          . . . What the hell is the matter with you\n          people?\n\n                           First Cop\n          Well, they said make it hurt. . . So we make it\n          hurt.\n\n22.  EXT   THE BUILDING\n\n     We see that the building's facade claims to be SABBATINI'S\n     ANTIQUES AND COLLECTIBLES.\n\n     Tom weaves across the street with his battle and glass\n     towards O'Gar, the police chief, leaning against a squad\n     car, chewing a toothpick.  He is watching morosely as his\n     men load other men into paddywagons; the street is clogged\n     with police vehicles.\n\n                           Tom\n          Drink, O'Gar?\n\n     O'Gar does not bother to look at Tom as they talk; he is\n     unhappily watching the spectacle.\n\n                           O'Gar\n          I'm an duty.\n\n     Tom pours himself a glass.\n\n                           Tom\n          To Volstead. . .\n\n     He tosses back a shot.\n\n          . . . Any news on Rug?\n\n                           O'Gar\n          Still dead, far as I know.\n\n                           Tom\n          Get a slug out of him?\n\n                           O'Gar\n          Yeah, a .22.  Listen, Tom, I'm just the chief\n          around here, so don't bother telling me if you\n          don't happen to feel like it, but what the hell\n          is Leo doing?\n\n                           Tom\n          Ours is not to reason why, friend.\n\n                           O'Gar\n          Balls.  Look at this mess.  Make him listen to\n          you, Tom.  It ain't right, all this fuss over one\n          sheeny.  Let Caspar have Bernie--Jesus, what's\n          one Hebrew more or less?\n\n     He nods at the building.\n\n          . . . We're burning our mealticket here.\n\n                           Tom\n          Leo'll do what suits him, and you'll do what he\n          tells you.  Last I heard Leo's still running this\n          town.\n\n                           O'Gar\n          He won't be for long if this keeps up.  It's no\n          good for anyone--you said as much yourself.\n\n                           Tom\n          First off, O'Gar, I can say what I please to Leo\n          and about him. . .\n\n     He taps him on the chest.\n\n          . . . You can't.  Second, once Leo decides--\n          that's that.  And if that sticks going down,\n          there are plenty of other coppers wouldn't mind\n          being chief, and could swallow it clean.\n\n     O'Gar looks chastened.\n\n                           O'Gar\n          Jesus, Tom, I was just speculatin' about a\n          hypothesis.  I know I don't know nothin'.  It's\n          just a damn mess is all--\n\n     He is interrupted by gunfire from an upper story of the\n     facing building.\n\n     O'Gar's men react, finding cover, returning the fire.\n\n     O'Gar unholsters his gun as he and Tom scramble for cover.\n\n          . . . a goddamn mess.\n\n\n\n23.  HALLWAY\n\n     We are shooting over Tom's shoulder as he knocks at the\n     door to Verna's apartment.\n\n     After a beat, Verna opens the door.\n\n     On seeing who it is she starts to swing the door shut.\n\n     Tom puts his toe in the doorway and leans into the door.\n\n     As he pushes his way in:\n\n                           Tom\n          Thanks, don't mind if I do.\n\n\n24.  INT   APARTMENT\n\n     As Verna gives up and Tom enters.\n\n     Verna walks over to the phone.  As she dials, Tom tosses\n     his hat onto a chair and checks the apartment to see if\n     they're alone.\n\n                           Verna\n          Hello, officer, I'd like to report an intruder at\n          346 West--\n\n     Tom grabs the phone away from her.\n\n                           Tom\n          Who's this?. . . 'Lo, Shad, Tom Duchaisne here.\n          We won't be needing any today. . . That's right,\n          my mother.  She didn't recognize me.  Lemme talk\n          to Mulvaney.\n\n     He takes a flask out of his packet and looks across the\n     room towards Verna.\n\n          . . . Miss me?\n\n                           Verna\n          Drop dead.\n\n     We hear a voice barking through the line and Tom turns back\n     to the phone.\n\n                           Tom\n          . . . 'Lo Sean, tell O'Car to send a car over to\n          Leo's tonight.  If we're going to be banging away\n          at Caspar we ought to be ready for him to bang\n          back. . . Yeah.\n\n     He hangs up the phone and tips the flask back, draining the\n     last drop.\n\n                           Verna\n          What do you want?\n\n     Tom is crossing to the bar.\n\n                           Tom\n          I was in the neighborhood, feeling a little\n          daffy.  Thought I'd drop in for an apperitif.\n\n     He pours himself a drink.\n\n          . . . Rug Daniels is dead.\n\n                           Verna\n          Gee, that's tough.\n\n                           Tom\n          Don't get hysterical.  I've had enough excitement\n          for one nigit without a dame going all weepy on\n          me.\n\n                           Verna\n          I barely knew the gentleman.\n\n                           Tom\n          Rug?  Bit of a shakedown artist.  Not above the\n          occasional grift, but you'd understand that.  All\n          in all not a bad guy, if looks, brains and\n          personality don't count.\n\n                           Verna\n          You better hope they don't.\n\n     He gives her a sick grin.\n\n                           Tom\n          . . . Yeah well, we're none of us the saint I\n          hear your brother is.\n\n                           Verna\n          Who killed him?\n\n                           Tom\n          Leo thinks Caspar did.\n\n                           Verna\n          But you know better.\n\n                           Tom\n          I do now.  Caspar just tried to buy me into\n          settling his tiff with Leo, which held hardly do\n          if he was waging war.  So I figure you killed\n          him, Angel.  You or Saint Bernard.\n\n                           Verna\n          Why would I--or my brother--kill Rug Daniels or\n          anybody else?\n\n                           Tom\n          Rug was following you.  He knew about you and me.\n          That wouldn't help your play with Leo, would it?\n\n     He looks at her.  She holds his gaze.\n\n                           Verna\n          You think I murdered someone.  Come on, Tom, you\n          know me a little.\n\n                           Tom\n          Nobody knows anybody--not that well.\n\n                           Verna\n          You know or you wouldn't be here.\n\n                           Tom\n          Not at all, sugar.  I came to hear your side of\n          the story--how horrible Rug was, how he goaded\n          you into it, how he tried to shake you down--\n\n                           Verna\n          That's not why you came either.\n\n     Tom shrugs.\n\n                           Tom\n          Tell me why I came.\n\n     Verna looks at him.\n\n                           Verna\n          The oldest reason there is.\n\n                           Tom\n          There are friendlier places to drink.\n\n                           Verna\n          Why can't you admit it?\n\n                           Tom\n          Admit what?\n\n                           Verna\n          Admit you don't like me seeing Lee because you're\n          jealous.  Admit it isn't all cool calculation\n          with you--that you've got a heart--even if it's\n          small and feeble and you can't remember the last\n          time you used it.\n\n                           Tom\n          If I'd known we were going to cast our feelings\n          into words I'd have memorized the Song of\n          Solomon.\n\n     Verna smiles.\n\n                           Verna\n          . . . Maybe that's why I like you, Tom.  I've\n          never met anyone made being a sonofabitch such a\n          point of pride.\n\n     She turns to walk across the room.\n\n          . . . Though one day you'll pay a crice for it.\n\n     Tom grabs her wrist.\n\n                           Tom\n          Okay, Verna.  But until then, let's get stinko.\n\n     He draws her close.\n\n                           Verna\n          . . . Let's do something else first.\n\n     She reaches up, takes off his hat, and tosses it casually\n     away.  We pan with the hat to where it lands on the floor,\n     in front of a curtained window.\n\n                           Tom  (off)\n          Yeah.  Let's do plenty.\n\n\n\n25.  DISSOLVE THROUGH TO:\n     ANOTHER WINDOW   NIGHT\n\n     A living room window, open, its white sheers billowing\n     lazily in the draft.\n\n     Faintly, from another room in the house, we can hear a\n     phonograph playing John McCormack singing \"Danny Boy\".\n\n     At the cut we hear a thump, close by, and briefly the\n     sounds of a struggle.  We then hear a breathy, gurgling\n     sound, which quickly subsides.\n\n     The living room is late-night quiet.\n\n     The shot is a lateral track, which brings us off the window\n     to an end table in the foreground.  On the end table is a\n     pouch of Bull Durham, a package of rolling papers, a cup of\n     coffee with steaming rising off of it, and a section of a\n     newspaper.  The draft gently lifts a couple rolling papers\n     off the table.\n\n     The continuing track takes us off the end table and,\n     booming down, shows us an upset chair and the legs of the\n     man who occupied it.\n\n     We track along the man's body to discover that he is face-\n     down on the section of newspaper he was reading, blood\n     oozing out of his slit throat onto the newspaper.\n\n     The continuing track shows that, between the fingers of one\n     outflung hand, a cigarette burns.  It is resting on the\n     newspaper.\n\n     We see the feet of another man who is turning and walking\n     away from the man on the floor, into the background.  We\n     pan over to watch him recede, framing out all of the dying\n     man except his outflung hand and cigarette.\n\n     As the walking man recedes, more and more of his topcoated\n     body crops in.  By the time he reaches the house's front\n     door, in the deep background, we can see him full figure.\n\n     The newspaper in the foreground is crackling into flame.\n     The rug it rests on is beginning to smoke and discolor.\n\n     As the man in the background opens the front door we jump\n     in:\n\n\n     OVER HIS SHOULDER\n\n     Waiting in the darkness just outside is another man in a\n     topcoat and fedora.  He is holding two tommy guns.\n\n     The men do not exchange words.\n\n     The man outside hands his partner a tommy gun and follows\n     him as he walks back into the house.\n\n     Still faint, we continue to hear \"Danny Boy\".  We also hear\n     the lick of flames.\n\n\n26.  A VICTROLA\n\n     The song is louder at the cut.  We are in an upstairs\n     bedroom.\n\n\n     LEO\n\n     Stretched out an his bed, wearing a robe over his pyjamas,\n     smoking a cigar, listening--but only to the phonograph.\n     Its sound covers any other noise in the house.\n\n\n27.  STAIRWAY\n\n     A close track on the two pairs of feet climbing the stairs.\n     We see only the feet, the swaying hems of the topcoats and,\n     occasionally dipping into frame, the muzzles of the two\n     tommy guns.\n\n\n26.  BEDROOM\n\n     Leo, is motionless, looking down, a puzzled expression.\n\n\n     HIS POV\n\n     The floor.\n\n     Thin smoke is beginning to sift up through the floorboards.\n\n\n28.  STAIRWAY\n\n     Tracking on the approaching feet.  The song grows louder.\n\n\n26.  BEDROOM\n\n     Leo, looking, slowly taking the cigar from his mouth.\n\n\n     BEDROOM DOOR\n\n     From inside as--CRASH--it is kicked in.\n\n\n     LEO\n\n     Hitting the floor and rolling under the bed.\n\n\n     THE TWO GUNMEN\n\n     Striding into the room.\n\n\n     LEO\n\n     On his belly under the bed, facing the door, swinging a\n     handgun in front of him.\n\n\n     HIS POV\n\n     From floor level, the bottom of the mattress above us, the\n     floorboards stretching away.\n\n     The bed crops the two gunmen mid-shin as they swing their\n     guns up, firing.\n\n     RAT-TAT-TAT-TAT--the hems of their coats sway as they fire.\n\n     The floorboards in front of us are pocked by bullet hits\n     that walk across the floor towards the bed and hit the\n     mattress.\n\n     The mattress above us dances under the gunfire as ticking\n     sprays down at the floor.\n\n     Smoke curls up throuch the floorboards.\n\n\n     LEO\n\n     Jaw clamped on his cigar, he starts firing.\n\n\n     HIS POV\n\n     Blood spurts as one gunman takes a hit in the ankle.\n\n     He staggers and his tommy gun clatters to the floor.\n\n\n     LEO\n\n     Still firing.\n\n\n     HIS POV\n\n     The other gunman is ducking out the door.\n\n     The injured gunman pitches forward, head towards us, his\n     hat rolling off.\n\n\n     LEO\n\n     Firing.\n\n\n     HIS POV\n\n     A bullet hit in the top of the fallen man's head.\n\n\n     LEO\n\n     Rolling out from under the bed.\n\n     He stoops to pick up the dead man's tommy gun.  Thick smoke\n     seeps up through the floor.\n\n     The phonograph plays.\n\n     Leo ducks through another door.\n\n\n28.  HALLWAY\n\n     Facing down the length of the dark hallway, towards the\n     mouth of the stairs.\n\n     As Leo leaps across frame in the foreground, to enter a\n     facing room, muzzle flashes erupt at the end of the hall--\n     where the other gunman has been waiting in the darkness.\n\n\n29.  SECOND ROOM\n\n     Leo throws open a window.\n\n\n30.  EXT\n\n     As Leo rolls out onto the long sloping eave of a front\n     porch.\n\n     His gun skates down the eave and falls.  Leo grabs the rain\n     gutter, hangs by his hands and drops down to the front\n     lawn.\n\n     The first floor of the house is in flames.\n\n     From a high angle the camera swoops down on Leo as he picks\n     up the gun and backs away from the house, looking up at the\n     second story.  His open robe flaps in the breeze.  The dead\n     cigar is still clamped between his teeth.\n\n\n     LEO'S POV\n\n     The second floor window that he just emerged from.\n     Staccato gunfire erupts in the dark room.\n\n     The strobing gunfire makes a strobing shadow of the gunman,\n     whose back is to us as he rakes the room with fire.\n\n\n     LEO\n\n     Firing, the gun jumping and bucking in his hands.\n\n\n29.  INSIDE THE ROOM\n\n     The gunman, riddled with bullets and showered with broken\n     glass, spins around, his thompson still firing uncontrol-\n     lably.\n\n     Bullets dance across the walls and ceiling, blast out the\n     remaining glass and sing harmlessly into the trees outside.\n\n\n     BACK TO LEO\n\n     As we hear the screech of skidding tires.  A black coupe\n     takes a curve on the street behind him, machine gun fire\n     spitting out of the back window.\n\n     Leo turns, in the glow of the fanning flames, walking\n     calmly into the street, firing at the receeding car.\n\n\n     ON THE CAR\n\n     Growing smaller, still snitting fire and lead.\n\n\n     PULLING LEO\n\n     Still walking calmly up the street, the gun still bucking\n     in his hands.  Bullets whistle by and claw up the pavement\n     around him.\n\n\n     BEHIND LEO\n\n     His robe whips back in the breeze.  He fires again and we\n     hear the distant sound of shattering glass.  The car\n     weaves, runs up off the road, hits a tree and bursts into\n     flame.\n\n     A figure emerges from the car and staggers off into the\n     darkness.  He is on fire.\n\n\n     CLOSE ON LEO\n\n     As he stops, squinting, raising the gun.\n\n\n     HIS POV\n\n     The burning gunman zig-zagging into the darkness.\n\n\n     BACK TO LEO\n\n     A faint smile curls around the cigar.  He drops the muzzle\n     of the gun.\n\n                           Leo\n          Huhh. . .\n\n     The shell of the car explodes in a fireball as we:\n\n\n\n31.  CUT TO:\n     UPSTAIRS HALLWAY   SHENANDOAH CLUB\n\n     The explosion echoes over the cut as we track up the\n     hallway behind Tom and a tall cadaverous man with pre-\n     maturely white hair.  This is Dead Terry McGill.\n\n     Gunmen of every description line the hallway, lounging\n     against the walls, barely acknowledging the two men.\n\n                           Tom\n          Who's winning?\n\n                           Terry\n          We are, for the nonce.\n\n                           Tom\n          What's the disposish?\n\n                           Terry\n          Last night?  Four to one.  Dana Cudahy went up\n          with the house.\n\n                           Tom\n          And theirs?\n\n                           Terry\n          One burned.\n\n                           Tom\n          The other three?\n\n                           Terry\n          Lead.\n\n                           Tom\n          Whose?\n\n                           Terry\n          Leo's.\n\n     He is opening the door to admit Tom.  In a low, gravelly\n     voice:\n\n          . . . The old man's still an artist with a\n          thompson.\n\n\n32.  INT   LEO'S OFFICE\n\n     As Tom enters.\n\n     Leo is bellowing into the phone:\n\n                           Leo\n          --well find him, goddamnit!  Go see if he fell in\n          the john!  And get him, over here!\n\n     He slams down the phone.\n\n          . . . Sonofabitch!  No chief!  Who's running the\n          goddamned store?\n\n     Tom goes to the bar to pour himself a drink.\n\n                           Tom\n          Can't raise O'Gar?\n\n                           Leo\n          No, nor the mayor either.\n\n                           Tom\n          Hmm.\n\n     He takes a sip.\n\n          . . . That's not good.  They're running.\n\n                           Leo\n          They wouldn't dare.\n\n                           Tom\n          I don't know, Leo.  I warned you not to hit\n          Caspar's club--\n\n                           Leo\n          I'm still here, ain't I?\n\n                           Tom\n          Caspar's play hurt you anyway.\n\n                           Leo\n          Hah!  That sorry sonofabitch just slit his own\n          throat.  He just made me decide to step on him--\n\n                           Tom\n          Listen to me Leo.  Last night made you look\n          vulnerable.  You don't hold elected office in\n          this town.  You run it because people think you\n          run it.  Once they stop thinking it, you stop\n          running it.\n\n                           Leo\n          Jesus, Tom, sounds like a bad break for me I\n          wasn't killed.\n\n                           Tom\n          I mean it, Leo.  Start taking Caspar seriously.\n\n                           Leo\n          Don't sing me the blues again, Tommy.  I need\n          your help.  He shoots, we gotta answer--\n\n                           Tom\n          That's what got you in this mess.\n\n                           Leo\n          I know, I know.  Retreat to win.  Give up Bernie.\n          That'll solve all our problems.\n\n                           Tom\n          It won't anymore, I'll grant that.  Now its\n          either you or Caspar.  But going toe-to-toe with\n          a psychopath'll get you nowhere.  It'll force\n          everyone to choose sides just when you're looking\n          shaky.\n\n                           Leo\n          The hell I do!\n\n                           Tom\n          Then where's the mayor?  Why aren't there any\n          police here?  Why weren't there police at your\n          place last night?\n\n                           Leo\n          I didn't ask for any.\n\n                           Tom\n          I did.\n\n     Leo chuckles.\n\n                           Leo\n          Mother hen, huh?  What's the matter, Tommy, you\n          think I can't take care of myself?\n\n                           Tom\n          I know you can't.  Here's the smart play, Leo:\n          you lay back, give up Bernie, let Caspar think\n          he's made his point.  Wait for him to show you a\n          weakness--\n\n                           Leo\n          Please, Tom. . .\n\n     Tom stares at him.\n\n                           Tom\n          You're sticking on Bernie.  Sticking your neck\n          out for a guy who'd chop you off at the heels if\n          there was two bits in it.\n\n     Leo leans back in his chair, puts his feet up, and gazes\n     out the window.\n\n                           Leo\n          . . . Tom, it ain't all as clear-cut as you make\n          it. . . Bernie's--Well hell, you know about me\n          and Verna. . . Things now are--not that I haven't\n          been a gentleman, but. . . I, uh. . . I plan to\n          ask her to marry me, Tom.\n\n     There is a long, awkward silence.  Leo avoids Tom's look\n     but finally responds to the silence:\n\n          . . . I guess you think that's a bonehead play.\n\n                           Tom\n          Do you think she wants you to?\n\n                           Leo\n          How the hell do I know, Tom?. . .  I think she\n          does. . . Yeah, 'course she does.  I know, I\n          know, you think different but--well, we just\n          differ on that.\n\n                           Tom\n          Leo.\n\n     Tom takes a deep breath, and exhales.\n\n          . . . Caspar didn't kill Rug.\n\n     Absently:\n\n                           Leo\n          Course he did.\n\n                           Tom\n          No.  Think about it.  Just this one time.  Who\n          was Rug following?\n\n     This gets Leo's attention.  He turns to look at Tom.\n\n                           Leo\n          . . . Huh?\n\n                           Tom\n          It needn't have been that sinister.  A strange\n          man, following her down a dark alley, late at\n          night. . . I've told you, Leo, she can take care\n          of herself.\n\n     Leo stares at Tom.  He seems somewhat dazed.\n\n                           Leo\n          . . . Tom, why're you saying that?  Christ, Tom.\n          I just told you, I plan to. . .\n\n                           Tom\n          They pulled a .22 slug out of him.  A pop gun,\n          Leo--a woman's gun.\n\n                           Leo\n          . . . That's a whiskey dream.  Verna wouldn't\n          panic--shoot someone--just because he was\n          following her.\n\n     He gazes off again, shaking his head.\n\n          . . . No. . . It wouldn't have happened that way\n          in the first place, and if it had she would have\n          told me. . . I know you don't like her, Tom, but\n          I trust Verna as much as I trust you.\n\n                           Tom\n          On her account you'll burn the town down.\n\n                           Leo\n          Don't worry, Tom.  We'll still be standing when\n          the smoke clears.\n\n     Tom's tone is gentle:\n\n                           Tom\n          Okay Leo.  Then maybe it wasn't that innocent.\n          Maybe Rug knew something she didn't like him\n          knowing, and wouldn't want you to know.  He was\n          following her.  He knew who she was seeing.  He\n          knew where she was sleeping, and who with. . .\n\n     Leo has taken his feet off the sill and has turned back to\n     face Tom.  He studies him carefully.\n\n                           Leo\n          Maybes don't make it so.\n\n     Tom's suddenly very earnest, almost beseeching.\n\n                           Tom\n          They're more than maybes.  You've trusted me\n          before, and never lost anything by it.  Trust me\n          on this.\n\n                           Leo\n          This is too important.\n\n                           Tom\n          I don't ask much, and I don't ask often.  Trist\n          me on this.\n\n                           Leo\n          Tommy--\n\n                           Tom\n          Trust me on this or the hell with you.\n\n                           Leo\n          You don't mean that.\n\n                           Tom\n          . . . She was at my place.  The night Rug was\n          following her; the night you dropped by.\n\n     Leo is still staring impassively at Tom.  Tom doesn't\n     flinch from his gaze.\n\n     After a long beat Leo gets up slowly from his chair, walks\n     over to the window, shoves his hands in his pockets and\n     gazes out.\n\n     For a moment Tom looks at Leo's motionless back, but he has\n     nothing left to say.  He rises, plucks his hat from the\n     desk and goes to the door.  Before exiting, he looks back.\n\n     Leo, in long shot, is still gazing out the window.\n\n     Tom exits.\n\n\n33.  HALLWAY\n\n     Pulling Tom up the hall.\n\n     Behind him we can see the door to Leo's office opening and\n     Leo coming out.  He strides up the hall after Tom.\n\n     Tom turns as Leo reaches him.\n\n     Leo, without breaking stride, seems to walk right into him,\n     throwing a punch that catches Tom on the chin and sends him\n     stumbling back, his hat flying off.\n\n     The men 1ining the hall watch with casual interest.\n\n     Tom staggers into one of the men who catches him.  Another\n     man has picked up Tom's hat and now hands it to him.  The\n     first man shoves Tom back into the middle of the hall just\n     in time for the approaching Leo to land another punch\n     against his jaw.\n\n34.  This blow sends Tom rolling down the staircase, still\n     clutching his hat.\n\n     Leo is clomping down the stairs; his army of private\n     retainers clomp down behind him.  In his shirtsleeves and\n     chomping an unlit cigar, Leo looks like a labor leader\n     taking the rank and file to the barricades.\n\n     Tom claws himself up the wall to his feet.\n\n     Leo has reached the floor and still without breaking stride\n     uppercuts Tom with a blow that straightens him up and sends\n     him staggering like a drunk into gamblers in evening\n     dresses and tuxedos.\n\n     A path clears for Leo and his entourage.  He has not\n     slackened his pace, but is also not hurrying.  Tom weaves,\n     watching Leo approach, but makes no attempt to defend\n     himself.\n\n     Leo grabs his own wrist with one hand and swings his elbow\n     up to catch Tom with a sharp blow on the side of his face.\n\n     Tom spins into a screaming lady in a sequined evening dress\n     and sinks to the floor grabbing at her bodice and skirt for\n     support.  She bats at him with her handbag as he slips\n     down.\n\n     Fat Tony emerges from the crowd and helps Tom to his feet.\n     He raises his hand to stop Leo.\n\n                           Tony\n          Okay, Leo.  I'll throw him out.\n\n     Leo stops, panting.  He is looking at Tom, but speaking to to\n     Tony.\n\n                           Leo\n          . . . Yeah.  Do that. . . It's the kiss-off.  If\n          I never see him again it'll be soon enough.\n\n\n\n35.  CUT TO:\n     TOM'S APARTMENT\n\n     Wide shot of his living room, facing the windows.  It is\n     night.\n\n     Tom sits with his back to us at the window, feet propped up\n     on the sill.  He is smoking a cigarette.  A full ashtray on\n     a table at his side indicates that he has been sitting\n     there for some time.\n\n     We are slowly tracking in.\n\n     The telephone sits on the the arm of his chair.  After a\n     moment he stubs out the cigarette, picks up the phone and\n     dials.\n\n                           Tom\n          . . .'Lo Frankie its Tom, how's the flunky\n          business?. . . I've had worse; your ventilator\n          healing up?\n\n     Offscreen we hear a knocking at the door to the apartment.\n     Tom ignores it.\n\n          . . . Tell Caspar its already forgotten.  I'd\n          like to see him. . .\n\n     The knocking continues.\n\n          . . . All right, do what you have to do and let\n          me know.\n\n     He cradles the phone, lights another cigarette, takes a\n     drag, blows a thoughtful cloud of smoke and turns to face\n     the door.  After a beat he rises and leaves frame.\n\n\n     THE DOOR\n\n     As Tom swings it open.  Verna stands in the hallway\n     outside.  After a wordless beat she moves past him into the\n     apartment.  Tom turns and follows her.\n\n     He walks over to his bar, pours two drinks, then crosses\n     the room to Verna who has seated herself, hands her a drink\n     and sits down in a chair facing hers.\n\n                           Verna\n          . . . It worked, whatever you did; Leo told me\n          we're quits.  But you know I didn't have anything\n          to do with Rug.\n\n                           Tom\n          Maybe not. . . Anyway, that isn't what soured him\n          on you.\n\n     The thought is bitter but her tone isn't:\n\n                           Verna\n          Oh, you and me, huh?  You always take the long\n          way around to get what you want, don't you Tom.\n          . . . You could have just asked.\n\n     Tom looks at her.\n\n                           Tom\n          . . . What did I want?\n\n     Verna returns his look, then answers evenly:\n\n                           Verna\n          Me.\n\n     After a beat Tom, his eyes still on Verna, brings the glass\n     to his lips and takes a sip.  The ice cubes clink.\n\n     FADE OUT\n\n\n\n36.  FADE IN:\n     THE BEDROOM\n\n     Tom sits perched on the edge of the bed, smoking a ciga-\n     rette.  Verna is in bed behind him.  The lamp on the\n     nightstand is burning a faint yellow.\n\n     The telephone rings.\n\n     As Tom reaches for it, Verna stirs behind him.\n\n                           Tom\n          Yeah?\n\n     He reaches over to switch off the light; when he does the\n     room remains illuminated by dull gray light; it is dawn.\n\n          . . . Yeah yeah, when?. . . Okay.\n\n     He hangs up, and continues to smoke, staring absently off.\n\n                           Verna\n          . . . You're still up?\n\n     Tom answers without turning to face her:\n\n                           Tom\n          Yeah.\n\n                           Verna\n          . . . What're you chewing over?\n\n                           Tom\n          . . . Remembering something. . .\n\n                           Verna\n          What was it?\n\n     Tom turns to look at her, then turns back and looks out the\n     window.\n\n                           Tom\n          Just a dream.  I was walking in the woods, don't\n          know why. . . The wind came up and blew my hat\n          off. . .\n\n                           Verna\n          And you chased it, right?  You ran and ran and\n          finally you caught up to it and picked it up but\n          it wasn't a hat anymore.  It had changed into\n          something else--something wonderful.\n\n                           Tom\n          No. It stayed a hat.  And no I didn't chase it.\n          I watched it blow away. . .\n\n     He takes a drag an the cigarette.\n\n          . . . Nothing more foolish than a man chasing his\n          hat.\n\n     Tom rouses himself, rises, and we pan to follow as he picks\n     up a shirt and starts buttoning it in the bureau mirror.\n\n                           Verna\n          Where're you going?\n\n                           Tom\n          Out.\n\n     Verna stares at him.\n\n                           Verna\n          . . . Don't let on more than you have to.\n\n     Tom shrugs.\n\n                           Tom\n          Just have to do a few things.\n\n                           Verna\n          You and Leo might still be able to patch\n          things up.\n\n     Tom grimaces into the mirror.\n\n                           Tom\n          Me and Leo are finished.  Nothing's going to\n          change that.\n\n                           Verna\n          You never know.  He's got a big heart.\n\n                           Tom\n          We're quits--as far as I'm concerned, never mind\n          him.  And if Leo did want me back he's an even\n          bigger sap than I thought.\n\n                           Verna\n          . . . Then why don't we just pick up and leave\n          town?  There's nothing keeping you here.  I know\n          there's nothing keeping me.\n\n     Tom is starting to knot a tie.\n\n                           Tom\n          What about Bernie?\n\n                           Verna\n          He could come with us.\n\n                           Tom\n          You, me and Bernie.  Where would we go, Verna?\n          Niagara Falls?\n\n                           Verna\n          Why do you hate him?\n\n                           Tom\n          I don't hate anyone.\n\n                           Verna\n          Or like anyone.\n\n                           Tom\n          Whatever.  Where is Bernie?\n\n     Verna looks at him.\n\n                           Verna\n          Why?\n\n                           Tom\n          Leo can't protect him anymore.  I ought to tell\n          him to skip.\n\n                           Verna\n          The Royale.  Room three-oh-two.\n\n     She gazes off.\n\n          . . . I guess we both double-crossed Leo, there's\n          no getting around that.  I guess he's well rid of\n          both of us.\n\n                           Tom\n          Mm.\n\n                           Verna\n          The two of us, we're about bad enough to deserve\n          each other.\n\n                           Tom\n          Are we?\n\n                           Verna\n          We're a couple of heels, Tom.  Yes we are.\n\n\n\n37.  PULLING TOM\n\n     Into a dark office.  Behind him, Frankie, his nose swathed\n     with bandages, is closing the door from the outside.\n\n                           Caspar (off)\n          'Lo, Kid.  You know O'Gar. . .\n\n\n     TOM'S POV\n\n     Caspar sits behind his desk.  Bluenoint sits slouched on a\n     couch to one side, wearing his hat, his hands jammed into\n     the pockets of his overcoat.\n\n     In two chairs facing the desk, away from us, sit two men\n     who are twisting around to smile at Tom.\n\n                           Caspar\n          . . . and the mayor.\n\n                           Tom\n          'Lo, boys.\n\n                           Mayor\n          Tom's a big booster.  Always has been.\n\n                           Caspar\n          S'fine, s'fine.  Well, Tom and me's got the\n          proverbial fat to chew--\n\n     The mayor and O'Gar are already rising to their feet.\n\n                           Mayor\n          Well, let us know if you need anything. . .\n\n                           Caspar\n          Yeah, happy days.  Have a seat, kid. . .\n\n     Tom sits into one of the vacated chairs facing Caspar.\n\n          . . . So you had enough time to think about it?\n\n                           Tom\n          Yeah, well, circumstances have changed.\n\n                           Caspar\n          Don't I know it.  Last night, I know Bluepoint\n          was disappointed the bulls showed up before\n          Frankie and Tic-Tac could really pin your ears\n          back, but I said, Relax, Bluepoint, I got a\n          feeling about this kid.  Take the long view.  The\n          kid and Leo are gonna go bust-o.  If the kid ain't\n          ready yet, well, he soon will be.  Matter of\n          time.  I said, the kid's too smart for Leo.\n          That's what I said.  Like a psychic.  Ask\n          Bluepoint if I didn't.  Like a goddamn psychic.\n          G'ahead.  Ask him.\n\n     Tom turns to look at Bluepoint.\n\n                           Tom\n          You vouch for this psychic business?\n\n     From the couch, Bluepoint sneers:\n\n                           Bluepoint\n          That's right, smart guy.\n\n     Caspar cheerfully continues, oblivious to any hostility in\n     the room:\n\n                           Caspar\n          I know you knew protecting the Motzah was a dumb\n          idea.  I know you been wise to all of Leo's dumb\n          ideas lately.  Only a matter of time.  Bust-o.\n\n     He chuckles.\n\n          . . . That's why last night we didn't put the arm\n          on you.  Only Leo.\n\n                           Tom\n          Seeing how you squiffed your play on Leo, I can\n          be only so grateful.\n\n                           Bluepoint\n          That's brave, coming from Little Miss Punching\n          Bag.\n\n                           Caspar\n          C'mon Bluepoint.  Friends now, huh?\n\n                           Bluepoint\n          Nuts.\n\n     Caspar smiles at Tom.\n\n                           Caspar\n          So we get a little jingle.  And I figure you know\n          Leo's on his way out.  It's only a matter of time\n          before we get him.  Am I right, kid?\n\n                           Tom\n          Maybe.\n\n     Caspar laughs.\n\n                           Caspar\n          What maybe.  You know or you wouldn't be bust-o.\n          So I guess you're looking for a job?\n\n                           Tom\n          I might be.\n\n     Caspar laughs.\n\n                           Caspar\n          You got references?  You been to college, kid?\n          We only take yeggs what's been to college.  Ain't\n          that right, Bluepoint?\n\n     Bluepoint says nothing.  His scowl is set in cement.\n\n          . . . I'm jokin', of course.  We all know you can\n          be useful to us, a smart kid such as yaself, the\n          man who walks behind the man and whispers in his\n          ear.  I guess you could be useful, in spades.\n\n                           Tom\n          Yeah.  I can do plenty for you.  But the fact is\n          that right now Leo's still got all his vital\n          signs and once he hears about this he'll be more\n          anxious to get to me than to either of you.\n\n                           Caspar\n          I'm tellin' ya not to worry about Leo.  We got\n          plans for him.\n\n                           Tom\n          Yeah?  What?\n\n                           Bluepoint\n          Not so fast there, Kaputnik.\n\n     There is a beat through which Caspar continues to smile at\n     Tom.\n\n                           Caspar\n          . . . I think what the Bluepoint is trying to say\n          is, there'll be time to talk about that.  That\n          can be tabled for a later date.  See, the last\n          time we jawed you gave-me the high hat.  So I\n          guess I'm sayin', maybe we want your confidence\n          before we give you ours.  You gotta put somethin'\n          on the table.  Ante up.\n\n                           Tom\n          Fair enough.  Where shall we start.\n\n                           Caspar\n          Hear that, Bluepoint?  All business!  I told you\n          he was a good kid!  Where shall we start!  All\n          business!. . .\n\n     He rocks back in his chair and dries his eyes.  Tom smiles\n     pleasantly.  Finally Caspar sighs.\n\n          . . . Well, we could start for instance with the\n          Motzah. . . Like where's the Motzah?  You could\n          maybe tell us that. . .\n\n                           Tom\n          The Royale.  Room three-oh-two.  You might find\n          Mink with him.\n\n                           Bluepoint\n          The hell you say.\n\n                           Tom\n          Sure, Bernie and Mink are as cozy as lice.\n\n     He turns to look at Bluepoint.\n\n          . . . And it ain't just business.\n\n     Caspar looks at Bluepoint.  Bluepoint's eyes bare into Tom.\n\n                           Bluepoint\n          This guy's lying.\n\n     Tom shrugs.\n\n                           Tom\n          Why would I?\n\n                           Bluepoint\n          This guy's wrong.  This guy's all wrong.  Mink is\n          clean and this clown is a smart guy.\n\n     Caspar is still staring at Bluepoint, no longer smiling.\n\n                           Caspar\n          Easy enough to find out, ain't it?  You find\n          Mink, bring him back here.\n\n     He nods at Tom.\n\n          . . . You go down to the car.  I'll send Frankie\n          and Tic-Tac with you to the Royale.  If Bernie's\n          there, Frankie and Tic-Tac'll take care of him.\n\n                           Bluepoint\n          And if he's not there?\n\n     Tom shrugs.\n\n                           Tom\n          I'll sit facing the corner in a funny hat.\n\n\n\n38.  CUT TO:\n     INT   CAR\n\n     Tom sits behind the wheel of the parked car; we are an his\n     profile.\n\n     Tom's face is rigidly set; we don't know why as we watch\n     him for a short beat.\n\n     BAM--with a loud impact Bernie Bernheim's face is slammed\n     against the driver's window.  Tom still faces forward.\n\n     Bernie is wailing as he is muscled back away from the\n     window by two topcoated torsos--their faces above the car\n     window.\n\n     They muscle Bernie out of frame towards the rear of the car\n     and we hear the back door being opened.\n\n     Bernie's voice, off, is near hysteria:\n\n                           Bernie\n          Frankie, let me go, I'm prayin' to ya, Jesus God-\n          -Tom!  Jesus!\n\n     As Frankie and Tic-Tac pile Bernie into the back, we\n     continue to hold on Tom's face.  He still does not react.\n\n                           Bernie\n          . . . Are you part of this?!  You can't be part\n          of this!  I think these guys're gonna whack me!\n          You gotta talk to 'em, Tommy!\n\n                           Frankie\n          You gimme a headache, you little sheeny.\n\nTo Tom:\n\n                           Tic-Tac\n          Okay, we're going to Miller's Crossing.\n\n     Tom still doesn't react.  There is a beat of Bernie's crying.\n     Finally:\n\n                           Frankie\n          . . . Lets go!\n\n     As Tom reaches forward and starts the car:\n\n                           Bernie\n          You're not part of this!  Tom!  Help me!  These\n          guys are gonna whack me!\n\n                           Tic-Tac\n          Whack you inna mouth you don't shut up.\n\n\n\n39.  MILLER'S CROSSING   WIDE\n\n     Day.  A wooded area outside of town.  The wind blows.\n\n     The car pulls into frame and stops on the shoulder.  The\n     backseat passengers--Frankie, Tic-Tac and Bernie--emerge;\n     Tom remains in the driver's seat.\n\n     Bernie is weeping, loudly; he has lost control.  Frankie\n     takes out a gun and whacks him smartly on the side of his\n     head.  The blow sends him stumbling over towards Tic-Tac,\n     who kicks him down.\n\n     The blows haven't quelled Bernie's sobbing.\n\n                           Tic-Tac\n          I don't want you runnin' anywhere.\n\n     Frankie takes a swig from his flask and hands it to Tic-\n     Tac, who leans in the car window.\n\n\n     INT    CAR\n\n     Tom gazes forward, jaw set, eyes off the doings outside.\n\n     As Tic-Tac hands his gun in through the window:\n\n                           Tic-Tac\n          Okay.  Take him in the woods and whack him.\n\n                           Tom\n          Huh?  I don't. . .\n\n                           Tic-Tac\n          Yeah, that's right, the boss wants you to do it.\n          Make sure you're with the good guys.\n\n     Tom stares dumbly at the gun.  Tic-Tac holds it, grip\n     towards Tom, motionless.\n\n     After a beat he takes the gun.\n\n                           Tic-Tac\n          You know how to do this, right?  You gotta\n          remember to put one in his brain.  Your first\n          shot puts him down, then you put one in his\n          brain.  Then he's dead, then we go home.\n\n     Tom opens his door.\n\n\n     WIDE   EXT\n\n     Bernie is still on the ground, sobbing, not responding to\n     Frankie who prods him with his foot.\n\n                           Frankie\n          Get up.\n\n                           Bernie\n          I can't get up!  I can't get up!\n\n     Frankie drags him to his feet.\n\n                           Frankie\n          Get up and walk, you chiselin' little yid.\n\n     He pushes him towards the woods and reaches for the whiskey\n     flask.\n\n     Bernie stumbles off; Tom follows him.\n\n\n40.  TRACK\n\n     Through the woods, pulling the two men, Bernie in the\n     foreground.  Tree limbs groan in the wind.\n\n     Bernie is stumbling, his clothes rumpled and dirty, his\n     face stained by tears and blood from the gun blow.  His\n     shaking voice strains for a tone of reasonableness:\n\n                           Bernie\n          . . . Tommy, you can't do this.  You don't bump\n          guys.  You're not like those animals back there.\n          . .\n\n     Tom marches on, face drawn, silent.\n\n          . . . It's not right, Tom.  They can't make us do\n          this.  It's a wrong situation.  They can't make\n          us different people than we are.  We're not\n          muscle, Tom.  I never killed anybody.  I used a\n          little information for a chisel, that's all.  I\n          couldn't help it, Tom, it's my nature.  Somebody\n          hands me an angle, I play it.  I don't deserve to\n          die for that!  D'you think I do?  I'm just a\n          grifter!  Huh, Tom?\n\n     Still no response from Tom.  Bernie is fighting a losing\n     battle to keep himself from whining.\n\n          . . . But I'll tell you what, I never crossed a\n          friend.  Huh, Tom?  Never killed anybody, never\n          crossed a friend.  Nor you, I'll bet.  We're not\n          like those animals.  You can't do this!  You're\n          not like those animals.  This is not us!  This is\n          some hop dream!\n\n     Tom's face is a ---ny mask.  Bernie is losing control\n     again.  He starts to weep.\n\n          . . . It's a dream!  Tommy!  I'm praying to you!\n          I can't die!  I can't die!  Out here in the\n          woods!  Like a dumb animal!  I can't die!\n\n     He turns and sinks to his knees, wailing, his hands clasped\n     in front of him, staring up at Tom.\n\n          . . . You can't kill me.  I'm praying to you!\n          look in your heart!  I'm praying to you!  Look in\n          your heart!\n\n     Tom stares down at Bernie, his face drawn and pale.\n\n          . . . I'm praying to you!  Look in your heart!\n\n     Slowly Tom raises the gun and levels it at Bernie's head.\n\n          . . . Look in your heart!  Look in your--\n\n     BOOM!  The gun blast is deafening.  With it, Bernie's\n     sobbing abruptly stops.\n\n     The shot echoes away in the woods, taking the wind with it,\n     leaving silence.\n\n\n     CLOSE   BERNIE\n\n     Still kneeling, in shock, staring wide-eyed at Tom.\n\n     Finally, whispering:\n\n                           Bernie\n          . . . Tommy.\n\n                           Tom\n          Shutup.  You're dead, get me?\n\n     Still whispering:\n\n                           Bernie\n          I understand.  I'm dead.  God bless you--\n\n                           Tom\n          Shutup.  You have to disappear.  You have to\n          blow, for good.  Nobody can see you, nobody can\n          know.\n\n                           Bernie\n          God bless you--\n\n                           Tom\n          Go somewhere no one knows you.  Anyone sees you,\n          you really are dead, I don't care, you're not my\n          problem any more.\n\n                           Bernie\n          Of course not.  Of course not.  You've done your\n          share.  Thank you.  Don't worry, I understand.\n          Thank you--\n\n                           Tom\n          Shutup. Just get the hell out, before I change\n          my mind.\n\n     Bernie is already on his feet, and running.\n\n\n     CLOSE ON TOM\n\n     Watching Bernie go.\n\n\n     TRACKING\n\n     Pulling Bernie as he runs.  Foreground trees flash by.  In\n     the background we see Tom standing, his gun dangling at his\n     side.\n\n     Boom!--another gun blast.  Running, Bernie reacts, but Tom\n     has only fired into the ground.\n\n     On the echo of the shot we cut to:\n\n\n41.  WIDE   THE ROAD\n\n     Tic-Tac and Frankie are leaning against the car, trading\n     the flask back and forth.\n\n     In the background, Tom emerges from the woods.\n\n                           Frankie\n          Put one in his brain?\n\n     Tom takes a few steps more before answering:\n\n                           Tom\n          . . . Yeah.\n\n                           Frankie\n          Attaboy.\n\n     FADE OUT\n\n\n     Over black we hear the sound of coins being dropped into a\n     phone box.\n\n42.  FADE IN\n\n     Looking down a deserted street towards a glowing phone\n     booth on a dark corner.  Tom stands inside the booth\n     waiting, the receiver to his ear.\n\n                           Tom\n          Mink?  Tom Duchaisne.  Where've you been?. . .\n\n\n     CLOSE ON TOM\n\n     Inside the phone booth.\n\n          . . . Well you're lucky, Bluepoint's been looking\n          for you.  Bernie's dead--Stop wailing and listen\n          to me.  Caspar knows you were in on selling out\n          his fix. . . I guess I gave him that idea.  Sorry\n          Mink, we were chatting and it just slipped out.--\n          Shutup and let me talk.  You've gotta make\n          yourself missing, but let me know where you hole\n          up.  You're gonna say some things for me. . .\n          Some stories.  About Bluepoint, to Caspar--don't\n          worry, I'll let you know.  For now just dis-\n          appear. . . Yeah, I got you into it.  Just\n          remember, Mink, I'm the only one who can get you\n          out.\n\n     Tom hangs up the phone, turns around and opens up the glass\n     door.\n\n     WHOMMMP!  A fist slams into his stomach, driving him back\n     into the phone booth, knocking his hat off of his head.\n\n     The man who hit him leans down, picks up the hat, dusts it\n     off and hands it into the booth.  It is Dead Terry, the\n     tall cadaverous man we saw earlier outside of Leo's office.\n     A cigarette dangles from his lower lip.\n\n     Behind him a black sedan is parked at the curb.  Three or\n     four gunmen stand on the sidewalk looking warily up and\n     down the road.\n\n     Tom looks up, the color drained from his face, and reaches\n     feebly out for his hat.\n\n                           Tom\n          'Lo, Terry.  Getting out the vote?\n\n     Dead Terry flicks his cigarette away and smiles.\n\n                           Terry\n          Message from Leo.  Leo says, if you're smart\n          you'll sit this one out--not that he cares one\n          way or the other.  Leo says if you're on the\n          wrong side you take your chances, like anyone\n          else.  Leo says he gives no special favors.\n          That's all.\n\n                           Tom\n          Mm. . .\n\n     Terry starts to turn away.\n\n          . . . Tell Leo he's not God on the throne, he's\n          just a cheap mick political boss with no brains\n          and an office that looks like a French whore-\n          house.\n\n     Tom moves to exit the booth but Terry lays a hand on his\n     shoulder.\n\n                           Terry\n          One more thing. . .\n\n     He cracks Tom across the chin with a clean left hook,\n     knocking him back into the booth again.\n\n     Tom rubs his chin, looking up at Terry.\n\n                           Tom\n          Leo say that too. . . ?\n\n     As Terry and the gunmen get into the car:\n\n                           Terry\n          No, I said that.  Cross Leo and next time I'll\n          say plenty.\n\n     We FADE OUT as the door slams and the car roars off.\n\n     Over black we hear:\n\n                           Caspar\n          When you're right you're right, but you never say\n          I told you so.\n\n43.  FADE IN\n\n     On Tom, sitting into frame in Caspar's office.\n\n                           Tom\n          So what'm I right about?\n\n     Behind his desk, Caspar is smiling.\n\n                           Caspar\n          Well, I'll tell ya, but first you gotta promise\n          not to say I told you so.\n\n     Tom's eyes hold an Caspar's.  He is taking out a pack of\n     cigarettes.\n\n                           Tom\n          I never say that.  And I don't like people who\n          do.\n\n                           Caspar\n          Mink was robbin' me right along with the Mptzah.\n\n                           Tom\n          . . . What convinced you of that?\n\n                           Caspar\n          Mink Larouie took a powder.  We can't find him.\n          Bluepoint's makin' excuses for him, but personal-\n          ly, I think you were right.  I think Mink and\n          Bernie was in it together.  I think Mink heard\n          you'd bumped the Motzah, and lit out.  The lousy\n          sonofabitch.\n\n     His eyes on Caspar, Tom takes out a cigarette, lights it,\n     takes a deep drag.\n\n                           Tom\n          . . . I told you so.\n\n     Caspar laughs.\n\n                           Caspar\n          Okay.  You got a lip on ya.  Ats all right.  I\n          don't generally care for it, but that's all\n          right. . . You were a good sport to bump the\n          Motzah.  I just like to make sure my friends is\n          my friends.  So.\n\n     He throws his hands up.\n\n          . . . Friends, right?\n\n                           Tom\n          How d'you know Mink skipped?\n\n                           Caspar\n          Bluepoint can't find him.\n\n                           Tom\n          So he says.\n\n     Caspar stares at Tom.\n\n                           Caspar\n          Meanin' what, exactly?\n\n                           Tom\n          Maybe nothing. . . I didn't give it much thought\n          until now, since a guy will say pretty much\n          anything when he knows his number is up, but just\n          before I bumped Bernie he swore to me that\n          Bluepoint and Mink were setting him up.  That\n          they were the ones that were selling out your\n          fix.\n\n     Caspar looks at Tom.\n\n                           Caspar\n          'Zat so. . .\n\n     He thinks for a beat.\n\n          . . . Like you say, a guy'll say anything.\n\n                           Tom\n          . . . Uh-huh.  So why isn't Bluepoint here?\n\n                           Caspar\n          Well. . .\n\n     He figdets.\n\n          . . . He don't care for you, kid.  Maybe it's\n          only fair to tell you. . .  After you left us, he\n          tried to sell me on a double-cross.  He says to\n          me, why don't we double-cross you and give you\n          the bump once we get the Motzah.  But I figure a\n          deals a deal, you're square with me, you bump the\n          Motzah, I'll hold up my end.  Question of ethics.\n          Everything above board, that's how I like it, so\n          everybody knows who's a friend and who's an\n          enemy. . .  But Bluepoint wouldn't cross me.  We\n          go back.\n\n                           Tom\n          Uh-huh. . . Course, there's always that wild card\n          when love is involved. . .\n\n     Caspar is staring intently at Tom.  After a beat:\n\n                           Caspar\n          . . . I know Mink is Bluepoint's boy, but I still\n          don't make it that way.\n\n                           Tom\n          Mm.  Well, then there's nothing to worry about.\n\n     Caspar seems lost in thought:\n\n                           Caspar\n          Yeah. . .\n\n     We hear the door to the office open offscreen and Johnny\n     Jr. runs into frame clutching a scrolled piece of paper.\n\n                           Johnny Jr.\n          Poppa!  Poppa!  I got a prize from the--\n\n     Caspar holds his hand up to quiet the youngster, still\n     looking at Tom.\n\n                           Caspar\n          Just a minute.\n\n     As Tom rises to his feet:\n\n          . . . Course, there's no reason not to be\n          careful--\n\n                           Johnny Jr.\n          Poppa!  Poppa!  The sisters gave me a--unnnh!\n\n     Cascar has cuffed him sharply on the side of the head.\n     He points at Tom.\n\n                           Caspar\n          Shaddap!  You take a page outta this guy's book.\n          A little less you talk and a little more you\n          think!\n\n     Cascar looks at Tom and smiles.\n\n          . . . Kids.  Ya gotta be firm.  Anyways.  You\n          know what I'm sayin'.  No reason to worry but no\n          reason not to investigate, neither.  If Mink is\n          around I want you to find him.  He can tell us\n          what's what. . .\n                       (to Johnny Jr.:)\n          . . . What's a matter, somebody hit you, what's a\n          matter, we ain't friends anymore?. . .\n\n     He picks up Johnny Jr., who is crying softly, and sets him\n     in his lap.  Encouraged by the attention, the child starts\n     wailing.  Caspar bounces him on his knee and raises his\n     voice over the sobs:\n\n          . . . If you find him, I wanna talk to him alone.\n          That's how you get the straight dope.  Man-to-\n          man.  Just me, Mink. . .\n\n     He pats his jacket where his shoulder holster is.\n\n          . . . and my friend roscoe.  Y'understand what\n          I'm sayin'?\n\n     Tom takes a contemplative drag on his cigarette.\n\n                           Tom\n          . . . It ain't complicated.\n\n\n\n44.  CUT TO:\n     CLOSE SHOT   A MAN'S FACE\n\n     Crunch!--being hit by a gloved hand.\n\n     The blow and the man's grunt echo.\n\n\n     CLOSE ON A NEWSPAPER\n\n     As the noise of fists against flesh continues, echoing, in\n     the background.\n\n     The newspaper headline reads: PARTY BOSS LOOSES MUNICIPAL\n     CONTRACT.  The subhead reads:  Liam (Leo) O'Bannon Removed\n     From City Highway Commission;  New Construction Contracts\n     To Raffo Bros.\n\n\n     ON TOM\n\n     Leaning against a pillar in a large bare room with a\n     hardwood floor.  He is reading the newspaper.\n\n     We are in a gym.  In a ring in the background two boxers\n     are sparring as two or three old men with towels slung over\n     their shoulders and elbows hooked over the ropes idly\n     watch, and offer occasional bits of half-hearted advice.\n\n     We hear high heels echoing across the floor and Verna\n     enters.\n\n                           Tom\n          You should leave town for a few days; things are\n          going to heat up here.  Go out to the Pallisades;\n          I'll join you once I'm done.\n\n                           Verna\n          . . . I can't find Bernie.  Did you find him?\n\n     Tom looks out at the fighters in the background, avoiding\n     Verna's look.\n\n                           Tom\n          . . . Yeah.\n\n                           Verna\n          Is he leaving?\n\n                           Tom\n          He left.\n\n                           Verna\n          Where to?\n\n                           Tom\n          . . . He didn't say.  You should--\n\n     She reaches out to touch his hand--\n\n                           Verna\n          Thanks.\n\n     She leans in to embrace him.\n\n     Tom's eyes drift up to the fighters.\n\n\n45.  EXT   THE GYM\n\n     Peeling paint on its blackened-out window reads: Gleason's\n     Gym.  Training in The Sweet Science.\n\n     Verna is exiting the gym in long shot.\n\n     We pull back to bring Bluepoint into frame.  He sits in the\n     driver's seat of a car, watching through his side window as\n     Verna recedes.  Quietly:\n\n                           Bluepoint\n          What's he up to?\n\n     An offscreen voice, a passenger:\n\n                           Voice\n          I dunno.\n\n                           Bluepoint\n          That's Bernie's sister, isn't it?\n\n                           Voice\n          I dunno.\n\n     Bluepoint thinks, a short beat.\n\n                           Bluepoint\n          What's he seeing her for?\n\n                           Voice\n          I dunno, maybe he's--\n\n                           Bluepoint\n          Shutup.  Get outta the car.  Stick with the\n          bighead.\n\n     Bluepoint reaches for the ignition, as we hear the car door\n     open.\n\n          . . . I'll see where the twist flops.\n\n\n\n46.  CUT TO:\n     INT   SPEAKEASY\n\n     A hand swings through frame holding the barrel of a gun,\n     smashing the butt into a surprised face.\n\n     With a loud crash the surprised man stumbles back into a\n     table and hits the floor.  Legs and the skirts of an\n     overcoat approach the prostrate, round, middle-aged man and\n     start kicking him.\n\n     He rolls across the floor trying to shield himself from the\n     blows.\n\n                           Voice (off)\n          C'mon, get up.  I just wanna talk.\n\n                           Another Voice (off)\n          Yeah, get up.  He ain't gonna hurt ya.\n\n                           Round Man\n          He already hurt me!  He broke my goddamn nose!\n\n     Whisper, the man standing over him, has a long scar across\n     his neck.  He has a rasping voice:\n\n                           Whisper\n          So what?  I had my nose broke once.\n\n                           Round Man\n          I already paid Leo's men.\n\n     Bert, another enforcer, is down at the end of the bar with\n     Tom.\n\n                           Bert\n          You still pay Leo for protection?  Is he protec-\n          tin' you?\n\n     As he kicks at the little round man:\n\n                           Whisper\n          We's protectin' you.  Johnny Caspar's runnin'\n          things or maybe you ain't heard.\n\n     In the background Whisper continues to hector and kick at\n     the round man as Bert and Tom talk in the foreground.\n\n                           Tom\n          So Bluepoint hasn't got a line on Leo yet?\n\n                           Bert\n          Not that I know about.  He's been lookin', but I\n          guess Leo's been movin' around and--hoist this\n          over the bar, will ya?--and thingslve been kinda\n          hectic.\n\n     He is handing Tom a briefcase.  As Tom leans over the bar\n     to drop it behind:\n\n                           Tom\n          Do me a favor--let me know if he finds anything.\n\n     Bert is pouring himself a drink.\n\n                           Bert\n          Yeah, okay--\n\n     Whisper, gun drawn, calls from the back of the bar:\n\n                           Whisper\n          I'm gonna put this one to sleep, wuddya think\n          Bert?\n\n     Bert shrugs into his overcoat.\n\n                           Bert\n          Yeah, okay.\n\n                           Tom\n          If you kill him he won't be able to think things\n          over.\n\n                           Whisper\n          He don't seem like such a hot thinker.\n\n                           Tom\n          You'll think about what you've learned here,\n          won't you Louie?\n\n                           Round Man\n          You bet, Tom, I'll think plenty!\n\n     Bert shrugs.\n\n                           Bert\n          Ah, what the hell. . .\n\n     The round man scrambles to his feet and runs out the back\n     door.  Whisper puts away his gun and saunters over to Tom\n     and Bert.\n\n     As the three men head for the front door:\n\n                           Bert\n          . . . If we can't trust a dago, the whole thing's\n          hopeless anyway.\n\n\n\n47.  EXT   SPEAKEASY\n\n     As the three men emerge into the afternoon sun.\n\n                           Tom\n          So, are we winning?\n\n     Bert gives a so-so flutter of his hand.\n\n                           Bert\n          It's tough.  Leo's still got some teeth left.\n          His men bushwhacked Tony Campisi last night, slit\n          his throat.\n\n                           Whisper\n          Yeah?  He die?\n\n                           Bert\n          I said, they slit his throat.\n\n                           Whisper\n          So what, genius?  I had my t'roat slit once.\n\n                           Tom\n          Sure Whisper, but normal people's brains need\n          oxygen--\n\n     BOOM!--Behind the three men the front of the speakeasy\n     blows--glass flying, flame licking out.\n\n     Though there is commotion among the passers-by, Tom, Bert\n     and Whisper don't even turn around to look.\n\n                           Bert\n          Get the car, will ya Whisper?\n\n     As Whisper trots out into the street:\n\n                           Tom\n          Don't tell Bluepoint I was asking about him.\n\n                           Bert\n          Yeah yeah.\n\n                           Tom\n          Caspar just wanted me to check up, make sure he's\n          doing everything he can--\n\n     There is a faint but distinct popping sound.\n\n     Tom looks into the street.\n\n     Whisper is staggering around, as if drunk.  He turns to\n     face Tom and Bert.\n\n     He lurches toward them.  A red stain is blossoming on his\n     chest.\n\n     The ambient hubbub fades to total silence; we hear only the\n     crisp staggering scuffle of Whisper's shoes as he stumbles\n     into the foreground, looking stunned.\n\n     He drops.\n\n     A woman screams.\n\n     Noise wells up.\n\n     Bert is unhoistering his gun, looking up.\n\n     Tom looks where Bert is looking.\n\n\n     FACING ROOFTOP\n\n     A man with a distinctive shock of white hair--Dead Terry\n     McGill.  He puts up his gun and starts running along the\n     roof.\n\n\n     BERT\n\n     Starts running along the street to keep pace, firing up at\n     the facing roof.\n\n\n     A POLICE CAR\n\n     Siren wailing, up on two wheels, taking a speeding turn\n     onto the street.\n\n     It is speeding towards Bert.\n\n\n     PULLING BERT\n\n     Running, he is pointing, and bellowing at the car:\n\n                           Bert\n          Leo's man!  Up there!\n\n\n     POLICE CAR\n\n     Cops with guns hang out every window.  They start firing.\n\n\n     TRACKING TOWARDS BERT\n\n                           Bert\n          . . . Up there!  Leo's--\n\n     A hail of bullets cuts him to pieces.  A limp rag, he hits\n     the road.\n\n     The police car squeals to a halt in front of his corpse.  A\n     sergeant and his men pile out.\n\n     Tom is sauntering over, smoking a cigarette.\n\n                           Sergeant\n          'Lo, Tom.  Chalk one up for the good guys, huh?\n\n                           Tom\n          Yeah, Caspar'll be thrilled.  You just shot one\n          of his apes.\n\n                           Sergeant\n          Bullshit!\n\n     Tom's attention is drawn by something down the street.\n\n\n     HIS POV\n\n     About a block away, a man with white hair is crossing the\n     street, from the side where the sniper's shot came from.\n\n                           Sergeant (off)\n          I'm tellin' you that's Two-Toe Jackson!  He's\n          Leo's!\n\n\n     BACK TO TOM\n\n     As he starts to leave.\n\n                           Tom\n          It's Bert Sachetti, Caspar's bang-man.\n\n     Behind him the Sergeant bellows at another cop:\n\n                           Sergeant\n          Bullshit!  Take his shoes off.  Count his goddamn\n          toes!\n\n\n\n48.  INT   DINER\n\n     Dead Terry McGill sits at a stool looking angrily down at a\n     cup of coffee.  Tom enters to sit next to him.\n\n     Through the windows behind them, we can see people running\n     back and forth on the street, a fire engine racing past--\n     furious activity, its noise muted inside the diner.\n\n                           Tom\n          'Lo, Terry.  You weren't aiming at me, were you?\n\n     Terry does not even look over at him.  Sullenly:\n\n                           Terry\n          In the first place, I don't know what you're\n          talking about.  In the second place, if I had\n          been aiming at you I'd've hit you.  In the third\n          place, I don't know what you're talking about in\n          the first place.\n\n     He tosses some coins onto the counter and gets up.  We hold\n     on Tom as Terry talks to Tom's back:\n\n          . . . I'd like to have, believe me.  Leo won't\n          let me--yet.  But I'll bring him around.\n\n     He puts a hand on Tom's stoulder and swivels him around.\n     Terry clenches a fist and draws it back to throw a punch.\n\n     Tom and Terry look at each other, Tom making no movement to\n     defend himself.\n\n     After a long beat, Terry uncldnches his fist and sneers:\n\n          . . . I won't give you the satisfaction.\n\n\n\n49.  CUT TO:\n     DOORKNOB\n\n     As--CRASH--a foot enters to kick it and the door in.\n\n\n     INT   VERNA'S APARTMENT\n\n     Verna is backing away from the door--behind us--into the\n     apartment.  Bluepoint strides into frame.\n\n                           Bluepoint\n          Know who I am?\n\n     Verna continues to back away; Bluepoint continues to\n     advance.\n\n                           Verna\n          Yeah, Johnny Caspar's shadow.  Did he stay in bed\n          today?\n\n                           Bluepoint\n          Jesus.  I open my mouth, the whole world turns\n          smart. . .\n\n     He glances around the room.  Verna is backing around the\n     couch.  Bluepoint continues to follow her.\n\n          . . . What business d'you have with Tom Duchaisne?\n\n                           Verna\n          None.\n\n     She continues to back away; Bluepoint continues to follow.\n\n                           Bluepoint\n          You're Leo's twist, right?\n\n                           Verna\n          Me and Leo are through.\n\n     She picks up her purse from the sill behind the couch and\n     rummages.  Bluepoint doesn't seem to mind.\n\n                           Bluepoint\n          Yeah?  So you're sluttin' around with Tom now,\n          huh?\n\n     Verna has taken a gun from her purse; she levels it at\n     Bluepoint.\n\n                           Verna\n          Get outta here.\n\n     As he continues to stride towards her:\n\n                           Bluepoint\n          Okay, see ya later. . .\n\n     His hand shoots out in a flash--he has grabbed the gun with\n     one hand, her arm with the other.\n\n          . . . Before I go, what's your boyfriend up to?\n\n     Verna is stuggling in his grasp to no effect.\n\n                           Verna\n          Nothing I know about.\n\n     Bluepoint drags her close, nose to nose:\n\n                           Bluepoint\n          Yeah?  It doesn't figure for me, your dumping\n          Leo for the guy who put a bullet in your brother.\n\n     Verna stops resisting and stares at him.\n\n     Bluepoint stares back at her, thinking.\n\n          . . . Didn't tell you, huh?\n\n     We hear a footstep offscreen.\n\n\n     REVERSE\n\n     Facing the door, from behind Bluepoint and Verna.\n\n     Bluepoint wheels, swinging her body in front of his as two\n     topcoated men enter, guns drawn.\n\n     Both intruders hold fire, their shot blocked by Verna.  The\n     gun in Bluepoint's hand barks once.\n\n     The lead man pitches forward, his gun clattering away.\n\n     His partner is ducking back out the door.\n\n     Verna still struggles futilely; Bluepoint keeps his gun,\n     peeking out from behind Verna, trained on the empty\n     doorway.\n\n     The man an the floor, still alive, has started clawing\n     himself towards his gun, a few paces away.\n\n     Bluepoint ignores him.  He stares at the open door.\n\n     After a silent beat, from the hall:\n\n                           Man In Hall\n          . . . Let her go, Bluepoint, there's nothing you\n          can do.  Leave by the fire escape.  There's more\n          of us on the way--\n\n     BANG--Bluepoint fires.\n\n     Wood splinters in the door, which shudders back a few more\n     inches towards the wall.  The voice from the hall has\n     stopped short.\n\n     After a short silent beat, we hear a gun clattering to the\n     floor outside in the hall.\n\n     We hear fabric drag across wall, and then see the dead man\n     drop to the floor just outside the door.\n\n     Bluepoint tosses Verna away and saunters unhurriedly over\n     to the first man, who has almost reached his gun.\n\n     Just as the man's hand closes over it Bluepoint, in stride,\n     steps onto the hand and gun.  Most of his weight is on it.\n\n     Head cocked, he looks down at the man in front of him.\n\n                           Bluepoint\n          . . . You Leo's?\n\n                           Man\n          Yeah.  He wanted her looked out for.\n\n                           Bluepoint\n          Well you did a bang-up job; I'll be sure to tell\n          him.  Where is Leo?\n\n                           Man\n          . . . If I tell you, how do know you won't kill\n          me?\n\n                           Bluepoint\n          Because if you told me, and I killed you, and you\n          were lying, then I wouldn't get to kill you then.\n          Where's Leo?\n\n     The man is sweating.\n\n                           Man\n          . . . He's--he's moving around.  But tomorrow\n          night he's getting his mob together at Whiskey\n          Nick's.\n\n     Bluepoint points his gun at the man's head.\n\n                           Bluepoint\n          You sure?\n\n                           Man\n          Check it.  It's gold.\n\n                           Bluepeint\n          You know something, yegg?  I believe you.\n\n     BANG.\n\n     Bluepoint straightens up from the body and turns.\n\n\n     LOW AND WIDE ON BLUEPOINT\n\n     One corpse an the floor beside him, the other corpse in the\n     doorway behind him.\n\n     He absently wraps one hand around the warm barrel of the\n     gun, then brings the hand up to blow against its open palm.\n\n                           Bluepoint\n          Go ahead and run, sweetie . . .\n\n\n     HIS POV THE WINDOW\n\n     The main zoom is now empty.  Sheers billow at the window,\n     now open, that let's out on the fire escape.  Off:\n\n                           Bluepoint\n          . . . I'll track down all a you whores.\n\n\n\n50.  DISSOLVE THROUGH TO:\n     WINDOW  NIGHT\n\n     Sheers billow in the breeze.\n\n\n     TOM\n\n     Sitting up in bed, smoking a cigarette, thinking.  The\n     bedroom is dark.\n\n     There is a knock at the apartment's front door. Tom\n     reacts, but does not immediately rise.\n\n     The knock is repeated.\n\n     Tom finally throws the covers off and swings his feet\n     around to the floor.\n\n     But the knocking stops and another sound brings him up\n     short:  The person at the door is now playing with the\n     lock.\n\n     Tom sits motionless, listening.\n\n     After some rattling we hear the lock spring, then the door\n     swinging open, then shut again.  We hear footsteps cross\n     the main room, and then the squeak of chair springs.\n\n     Silence.\n\n     Tom rises and walks to the living room doorway.  He leans\n     against the jamb.\n\n\n51.  HIS POV\n\n     The windows throw moonlit squares onto the floor.  We can\n     see only the legs of someone sitting in the armchair.\n\n                           Tom\n          'Lo, Bernie.  Come on in, make yourself at home.\n\n     Bernie turns on the lamn on the table at his elbow.  He\n     holds a gun casually in his lap.\n\n                           Bernie\n          'Lo, Tom.  Thought I'd do that, since you didn't\n          seem to be in.  Figured it was a bad idea to wait\n          in the hall, seeing as I'm supposed to be dead.\n\n                           Tom\n          Mm.\n\n                           Bernie\n          How'd you know it was me?\n\n                           Tom\n          You're the only person I know'd knock and break\n          in.\n\n                           Bernie\n          Your other friends wouldn't break in, huh?\n\n     Tom shakes his head.\n\n                           Tom\n          My other friends wanna kill me, so they wouldn't\n          knock.\n\n     He crosses to the chair facing Bernie's.\n\n          . . . What's on your mind, Bernie?\n\n                           Bernie\n          Things. . . I guess you must be kind of angry.\n          I'm supposed to be gone, far away.  I guess it\n          seems sort of irresponsible, my being here. . .\n\n     Bernie leaves room for a response but Tom is only listen-\n     ing.\n\n          . . . And I was gonna leave.  Honest I was.  But\n          then I started thinking.  If I stuck around, that\n          would not be good for you.  And then I started\n          thinking that. . . that might not be bad for me.\n\n     Tom still doesn't answer.\n\n          . . . I guess you didn't see the play you gave\n          me.  I mean what'm I gonna do?  If I leave, I got\n          nothing--no money, no friends, nothing.  If I\n          stay, I got you.  Anyone finds out I'm alive--\n          you're dead, so. . . I got you, Tommy.\n\n     Tom is silent.\n\n          . . . What's the matter, you got nothin' to crack\n          wise about?  Bernie ain't so funny anymore?\n\n     Bernie's lip is quivering.  His voice is softer:\n\n          . . . I guess I made kinda a fool a myself out\n          there. . . I was shittin' myself, Tommy. . .\n          you didn't tell anyone about that.\n\n                           Tom\n          No.\n\n                           Bernie\n          'Course you know about it. . . its . . . It's a\n          painful memory.  And I can't help remembering\n          that you put the finger on me, and you took me\n          out there to whack me. . . I know you didn't. .\n          . I know you didn't shoot me. . . but. . . but--\n\n                           Tom\n          But what have I done for you lately?\n\n                           Bernie\n          Don't smart me.\n\n     He stares hard at Tom for a moment.\n\n          . . . See, I wanna watch you squirm.  I wanna see\n          you sweat a little.  And when you smart me, it\n          ruins it.\n\n     Bernie gets to his feet, keeping the gun trained on Tom.\n\n          . . . There's one other thing I want.  I wanna\n          see Johnny Caspar cold and stiff.  That's what\n          you'll do for your friend Bernie. . .\n\n     He has opened the door to the flat.\n\n          . . . In the meantime I'll stay outa sight.  But\n          if Caspar ain't stiff in a couple of days I start\n          eating in restaurants.\n\n     The door shuts behind him.\n\n     Tom, heretofore very still, springs from the chair, goes to\n     the bedroom and reemerges with a gun.\n\n     He bolts for the door, instinctively grabbing his hat off a\n     hook.  He is wearing only his boxer shorts, a sleeveless\n     tee-shirt, and the hat jammed onto his head.\n\n     He throws open the door.\n\n52.  HALLWAY\n\n     Empty.\n\n     Tom runs to the bannister and looks down.\n\n\n     HIS POV\n\n     A flight down, a hand slides down along the railing.\n     Bernie's trotting footsteps echo in the stairwell.\n\n\n     TOM\n\n     He runs back to his apartment.\n\n\n53.  APARTMENT\n\n     Tom runs across to the open window and clambers out.\n\n\n54.  FIRE ESCAPE\n\n     Tom trots down.  His bare feet ring dully against the steel\n     of the fire escape.\n\n     He reaches the bottom landing, swings over the railing,\n     hangs by his hands for one brief moment and then drops.\n\n\n     THE ALLEY\n\n     As his bare feet hit the pavement.  Tom is a silhouette in\n     the lamplight from the end of the alley.\n\n     He straightens from his crouch and runs.\n\n\n     BACK DOOR\n\n     Of his apartment building--over Tom's shoulder as he enters\n     frame.  The empty, brightly lit hall inside runs straight\n     the length of the building to the front door, which is just\n     closing.\n\n     Tom throws open the back door.\n\n\n55.  HALLWAY\n\n     As Tom runs through toward the front.\n\n     Before reaching the door, he falls violently forward.\n\n     His gun skates away from him across the floor.\n\n     He starts to roll over to look behind him and a crunching\n     blow catches him on the chin, snapping his head the rest of\n     the way around and sending him flat onto his back.\n\n     Bernie, who has emerged from under the staircase, towers\n     over him.\n\n                           Bernie\n          You make me laugh, Tommy.  You're gonna catch\n          cold, then you're no good to me. . .\n\n     He is walking over to Tom's gun, which he picks up and\n     unloads into his hand.\n\n          . . . What were you gonna do if you caught me,\n          I'd just squirt a few and then you'd let me go\n          again.\n\n     He tosses Tom the empty gun and walks out.\n\n     Tom, white-faced and shivering, pulls himself up to sit\n     leaning against the wall.\n\n     A first-floor apartment door opens and a sixty-year-old\n     woman emerges, pulling a housecoat tight.  She goggles at\n     Tom.\n\n                           Woman\n          Why Mr. Duchaisne!  What on earth. . .\n\n     Tom tries a smile that looks idiotic.\n\n                           Tom\n          They took everything. . .\n\n\n     LONG SHOT   THE HALL\n\n     Clucking sympathetically, the old woman is leaning down to\n     help Tom up.  As he drapes an arm over her shoulder:\n\n                           Tom\n          . . . I fought like hell but there were too many\n          of 'em . . .\n\n     FADE OUT\n\n\n\n56.  CUT TO:\n     CLOSE SHOT   PLAQUE\n\n     Set into an exterior wall, identifying the SHENANDOAH CLUB.\n\n\n57.  INT   CLUB\n\n     Tom, in his overcoat and hat, is walking up to the bar.\n\n                           Tom\n          'Lo, Tony.  How's the club holding up?\n\n     Behind the bar, Tony looks sour.\n\n                           Tony\n          We're managing to squeak by without you.  Got\n          Lazarre's money?\n\n                           Tom\n          No.\n\n                           Tony\n          Well, you're not supposed to be here since you\n          turned rat.\n\n                           Tom\n          Relax, Tony, Leo's not around, is he?\n\n                           Tony\n          Maybe Leo's not the only one doesn't care for you\n          here.\n\n     Tom works to keep his smile.\n\n                           Tom\n          . . . Fickle, huh Tony?  You could almost be a\n          dame.\n\n                           Tony\n          Pal, you read my mind, you sneak my thoughts.\n          Jesus, I hope you know what you're doing.\n\n                           Tom\n          No more than usual.  The last couple days, you\n          booked any heavy bets on a long shot at Satur-\n          day's fights?\n\n                           Tony\n          Why the hell should I tell you?\n\n     Tom shrugs.\n\n                           Tom\n          The truth is Tony, there's no reason on earth.\n\n     Staring at Tom, Tony blows air through his teeth.  He sets\n     up a drink for Tom.\n\n                           Tony\n          . . . Saturday's fights.  Yeah.  Drop Johnson\n          parked two yards on one yesterday.  On Sailor\n          Reese, an undercard bum.\n\n     Tom downs the drink in a gulp.\n\n                           Tom\n          Drop Johnson?  He play your book much?\n\n                           Tony\n          You kidding?  I didn't even know he could count.\n\n     From offscreen there is a loud CRASH and, with that, many\n     of the club patrons start screaming.  Tony looks off and\n     Tom swivels to look.\n\n                           Tony\n          Oh Jesus. . . You bring them with you?\n\n     As he shoves off from the bar:\n\n                           Tom\n          No.\n\n     Uniformed policemen are pouring into the club, wielding\n     axes.  They destroy everything in their path, sweeping the\n     elegantly dressed patrons before them.\n\n     Tom wades into the sea of blue and nods at Delahanty, the\n     policeman we know from the raid on Caspar's.\n\n                           Tom\n          'Lo, Brian.  Still fighting the good fight?\n\n                           Delahanty\n          'Lo, Tom.  Neither wind nor rain nor snow. . .\n\n                           Tom\n          That's just the mailmen.  Is O'Gar here?\n\n                           Delahanty\n          Just look for the long face.\n\n\n58.  EXT   THE CLUB\n\n     It is just cracking dawn.\n\n     O'Gar is leaning against a car, facing the club, taking in\n     the scene as he glumly chews on a toothpick.  The street is\n     clogged with police vehicles.\n\n     Tom approaches.\n\n                           Tom\n          'Lo, O'Gar.  You don't look happy.\n\n                           O'Gar\n          Look at this mess.  Gutting the golden calf\n          again.\n\n     He shakes his head.\n\n          . . . I don't know whether to laugh or cry.\n\n                           Tom\n          Yeah, it's awful confusing.  You know a yegg\n          named Drop Johnson?\n\n                           O'Gar\n          We've spanked him a couple times.\n\n                           Tom\n          Where does he flop?\n\n                           O'Gar\n          The Terminal Hotel on Bay Street, whenever he's\n          broke--which is one hundred percent of always.\n          Jesus . . .\n\n     He reacts to gunfire from the second story of the club.\n\n          . . . Don't nobody ask me, since I'm only the\n          chief around here, but I'll tell you my opinion:\n          Caspar's just as crazy as Leo.  And an eye-tie\n          into the bargain.\n\n     As he heads off:\n\n                           Tom\n          What's the matter, O'Gar, doesn't anything ever\n          suit you?\n\n\n\n59.  PULLING TOM\n\n     As he walks along a nearby street; we can still faintly\n     hear the sirens and police activity back at the club.\n\n     A black touring car is tooling up alongside of him.  Tic-\n     Tac leans out the driver's window.  He has welts around his\n     mouth and looks like he has been a little roughed up.\n\n                           Tic-Tac\n          Hop in, Tom, we been lookin' for you.\n\n     Still briskly walking:\n\n                           Tom\n          I'm busy.\n\n                           Tic-Tac\n          Hop in anyway, as in you ain't got no choice.\n\n                           Tom\n          You can't hijack me, Tic-Tac, we're on the same\n          side now--or didn't you get that far in school?\n\n     The car screeches over to put a wheel on the sidewalk and\n     block Tom's way.  The back door swings open and Frankie\n     emerges to help Tom in.  Like Tic-Tac, Frankie looks a\n     little worked over.\n\n     Tom quickly sizes up the situation and decides to comply.\n\n\n60.  INT  CAR\n\n     As Tom sits into the back, next to Bluepoint.  Frankie\n     slides in after him.\n\n                           Bluepoint\n          How'd you get the fat lip?\n\n     The car starts moving.\n\n                           Tom\n          Old war wound.  Acts up around morons.\n\n                           Bluepoint\n          Very smart.  What were you doing at the club?\n          Talking things over with Leo?\n\n                           Tom\n          Don't think so hard, Bluepoint, you might sprain\n          something.\n\n                           Bluepoint\n          You're so goddamn smart.  Except you ain't.  I\n          get you, smart guy, I know what you are.\n          Straight as a corkscrew.  Mr. Inside-Outsky.\n          Like a goddamn bolshevik, picking up your orders\n          from Yegg Central.  You think you're so goddamn\n          smart.\n\n     He sneers:\n\n          You joined up with Caspar.  You bumped Bernie\n          Bernheim.  Down is up.  Black is white.  Well I\n          think you're half-smart.  I think you were\n          straight with your frail and queer with Johnny\n          Caspar.  And I think you'd sooner join the\n          Ladies' League then gun a guy down.\n\n     His eyes narrow at Tom.\n\n          . . . Then I hear that these two geniuses never\n          even saw this rub-out take place.\n\n     Defensively:\n\n                           Tic-Tac\n          The boss just said have him do it, he didn't say\n          nothing about--\n\n                           Bluepoint\n          Shutup, or maybe you still got too many teeth.\n\n     Tic-Tac sulks.  Bluepoint turns and gazes out the window of\n     the car.\n\n          . . . Everyone's so goddamn smart.  Well, we'll\n          go to Miller's Crossing.  And we'll see who's\n          smart.\n\n\n\n61.  EXT   WOODS\n\n     It is morning; the sun is now fully up.  Bluepoint and Tom\n     walk side-by-side through the woods.  Frankie and Tic-Tac\n     walk several steps ahead of them, each off to one side,\n     searching.  Frankie is singing an old Neapolitan song.\n\n                           Bluepoint\n          Y'understand if we don't find a stiff out here,\n          we leave a fresh one.\n\n     Tom walks a little unsteadily.  His shoulders are hunched\n     and his hands are jammed into his overcoat packets.  He\n     stares woodenly forward.  Bluepoint laughs softly.\n\n          . . . Where're your friends when you need 'em,\n          huh?  Where's Leo now?\n\n     Tom tramps mechanically on.  His eyes drift up.\n\n\n     HIS POV\n\n     Tracking.  A canopy of leaves, sprinkled by sunlight.\n     The boughs of the trees sough quietly in the wind.\n\n     We hear the unearthly groaning of the tree limbs.\n\n\n     TOM\n\n     Looks forward.\n\n     Bluepoint calls out:\n\n                           Bluepoint\n          Hey Tic-Tac, ever notice how the snappy dialogue\n          dries up once a guy starts soiling his union\n          suit?\n\n     Tom tramps on.\n\n\n     HIS POV\n\n     The backs of Frankie and Tic-Tac as they walk on ahead.\n\n     Frankie is still singing.\n\n\n     TOM\n\n     He looks stupidly at Bluepoint.  He looks ahead.\n\n     He stops abruptly.\n\n\n                           Bluepoint\n          What?\n\n     Tom is still for a moment, then with jerky movements gets\n     down on his knees, hugs a tree with one arm for support,\n     and vomits.\n\n     Bluepoint watches him, then calls out to Frankie and Tic-\n     Tac:\n\n          . . . Okay, there's nothing out here.\n\n     He grabs Tom's hat off his head and flings it away.  Then\n     he plants a foot against Tom's side and shoves him to the\n     ground.\n\n\n     CLOSE ON TOM\n\n     As his face hits the ground.\n\n     Bluepoint's foot enters; he plants it an the side of Tom's\n     neck to keep him pinned.\n\n\n     TOM'S POV\n\n     Skewed angle, from the ground.\n\n     Frankie is ambling back, singing.\n\n\n     BLUEPOINT\n\n     Checking the open chamber of his gun.  He snaps it shut.\n\n     As he levels the gun at Tom:\n\n                           Bluepoint\n          Think about this, smart guy.\n\n\n     TOM\n\n     Closing his eyes.\n\n     From offscreen:\n\n                           Tic-Tac\n          Uh-oh, hankie time!\n\n     FRANKIE\n\n     He stops singing and turns to look.\n\n\n     TOM\n\n     The foot comes off his neck.\n\n\n     BLUEPOINT\n\n     Looking towards Tic-Tac.\n\n\n     TIC-TAC\n\n     Taking a handkerchief out of his breast pocket and bringing\n     it to his face as he looks at something on the ground in\n     front of him.\n\n\n     BLUEPOINT\n\n     He hauls Tom to his feet and pushes him towards Tic-Tac.\n\n     We track behind the two men as they approach Tic-Tac and\n     Frankie enters from the side.\n\n     We cannot yet see what is on the ground in front of him.\n\n                           Tic-Tac\n          Birds been at him.\n\n     Frankie is taking out his hankie as he draws near.\n\n                           Frankie\n          Jesus Christ. . .\n\n     He looks up at Tom as Tom approaches.\n\n     Over Tom and Bluepoint's shoulders, stretching away from\n     us, face-up, is a body.  We cannot see much of its face;\n     what we do see is pulp.\n\n     Tic-Tac is laughing, incredulously.\n\n                           Tic-Tac\n          . . . I said put one in his brain, not in his\n          stinking face. . .\n\n\n     EXTREME LONG SHOT\n\n     Four very small men in overcoats and fedoras, looking down\n     at the ground; they are dwarfed by the surrounding trees.\n\n     Very faintly we can hear:\n\n                           Frankie\n          I told you, Bluepoint, we heard two shots. . .\n\n     QUICK FADE OUT\n\n\n\n62.  CUT TO:\n     APARTMENT BUILDING DOOR BUZZER\n\n     A beat-up panel in the building's entryway, listing\n     tenants' names and apartments opposite a row of buttons.\n\n     A hand coasts along the names and stops at CLARENCE\n     JOHNSON/4C, then moves away and presses two other buzzers\n     on the fifth floor.\n\n     After a beat, we hear the front door buzz open.\n\n\n63.  FOURTH-FLOOR HALLWAY\n\n     Tom walks up to 4C, unpocketing a gun.  He gently tries the\n     knob, which turns, and enters.\n\n\n64.  DROP'S APARTMENT\n\n     As Tom enters.\n\n     Drop Johnson is sitting at a table in the living room,\n     which also serves as kitchen and dining room.  He is a\n     large man with a thick neck, a low forehead, and rather\n     vacant eyes.\n\n     He is looking up at Tom, a spoonful of cereal frozen\n     halfway to his mouth, a folded-back newspaper in his other\n     hand, opened to the funnies.\n\n                           Tom\n          'Lo, Drop.  How're the Katzenjammers?\n\n     Uncomfortably:\n\n                           Drop\n          'Lo, Tom.  What's the rumpus?\n\n     As he talks, Tom walks casually around the apartment,\n     bumping open doors, sticking his head in each room.\n\n                           Tom\n          Had any visitors?\n\n     Drop's head swivels to follow Tom around the room; aside\n     from that he does not move.  He speaks cautiously:\n\n                           Drop\n          No.\n\n                           Tom\n          Not ever, Drop?\n\n                           Drop\n          . . . Not lately.\n\n     Tom nods.\n\n                           Tom\n          Then you must be happy to see me.\n\n     Drop doesn't respond.\n\n          . . . So you didn't see Bernie Bernheim, before\n          he was shown across?\n\n                           Drop\n          No.\n\n                           Tom\n          . . . Seen him since?\n\n     Drop maintains a sullen silence.\n\n     Tom is picking up a hat from a clutter on top of a bureau.\n\n                           Tom\n          One last question, Drop.  I hear you've got a lot\n          of money on tomorrow's fight.  Is that your bet,\n          or did you place it for a friend?\n\n                           Drop\n          No, uh. . . it's my bet.  I just. . . I have a\n          good feeling about that fight. . .\n\n     Tom's stroll through the apartment has brought him behind\n     where Drop sits.\n\n                           Tom\n          A good feeling, huh.  When did the feeling return\n          to your head?\n\n                           Drop\n          . . . Huh?\n\n     Tom puts the hat on top of Drop's head.  Drop's eyes roll\n     up to look at it, but otherwise he still doesn't move.\n\n     The hat, too small, sits ludicrously atop his head.\n\n     Tom starts toward the door.\n\n                           Tom\n          You've outgrown that one.  Must be all the\n          thinking you've been doing. . .\n\n     He pauses with his hand on the knob.\n\n          . . . Tell Bernie something's come up.  He has to\n          get in touch.  There'll be nothing stirring til I\n          talk to him.\n\n     He slams the door.\n\n\n\n65.  CUT TO:\n     A LARGE WINDOW\n\n     We are looking at the ground-floor window from the street.\n     Letters stencilled on the glass identify the SONS OF ERIN\n     SOCIAL CLUB.\n\n     A topcoated man scurries into frame, knocks out a pane with\n     the grip of a gun, and tosses a small pipelike device\n     inside.  He scurries away and we pan with him across the\n     street to reveal a line of cars, police and civilian,\n     parked along the far curb.  No men are visible except the\n     scurrying man, who takes cover behind one of the parked\n     cars.\n\n\n     SOCIAL CLUB\n\n     A beat.  From inside we hear a pair of trotting footsteps--\n\n     BOOM!  The window blows out, spitting glass into the\n     street, along with a large dark form.\n\n\n     THE STREET\n\n     Glass showers the pavement and a charred rag-doll of a body\n     hits hard, face down, and skids a couple feet.  Smoke wisps\n     from it.\n\n\n     THE CLUB\n\n     A lick of flame from the bomb is already dying and heavy\n     grey smoke is billowing out.\n\n\n     THE STREET\n\n     Men start cautiously rising from behind the cars.  A lot of\n     men.  Some wear police uniforms; some are civilians.  All\n     are armed.\n\n\n     THE CLUB\n\n     Billowing smoke.\n\n\n     THE STREET\n\n     The men have straightened up.  A policeman calls through a\n     bullhorn:\n\n                           Policeman\n          All right.  Anyone left in there, come on out,\n          grabbing air.  You know the drill.\n\n\n     THE CLUB\n\n     After a beat, the front door swings open.  A man emerges,\n     one hand in the air, one holding a handkerchief over his\n     mouth.\n\n     He walks into the middle of the street.\n\n     One of the civilians behind the cars fires.\n\n     The man takes the bullet in the chest and drops to the\n     ground, where he twitches.\n\n     The man who fired, in the foreground, grins.  A ripple of\n     laughter runs down the line of men.\n\n\n     THE CLUB WINDOW\n\n     Smoke still pouring out.\n\n     With a RAT-A-TAT-TAT muzzle flashes from inside illuminate\n     the smoke.\n\n\n     THE STREET\n\n     Bullet hits chew up the cars and a few of the men; the\n     others drop back down behind the cars and start returning\n     fire.\n\n\n     THE WINDOW\n\n     A forbidding black hole in the exterior wall.  A second\n     tommy has joined the first to pour lead out into the\n     street.\n\n\n\n66.  CUT TO:\n     RECEPTION AREA\n\n     Tracking in an a youngish secretary in a severe dress,\n     sitting behind a desk.\n\n     Faintly, from a distance, we can still hear gunfire.\n\n                           Secretary\n          'Lo, Tom, where've you been hiding?\n\n\n     REVERSE\n\n     On Tom.\n\n                           Tom\n          Hither and yon.  The mayor in?\n\n                           Secretary\n          With Mr. Caspar.\n\n     Tom is already heading for the door.\n\n                           Tom\n          That's who I'm looking for.  Scare up some\n          hootch, will you honey?\n\n                           Secretary\n          Surely.  I'll announce you.\n\n     As he opens the door:\n\n                           Tom\n          Don't bother, I'm well liked.\n\n\n67.  INT    MAYOR'S OFFICE\n\n     A grand, high-ceilinged place.  Mayor Levander sits behind\n     his desk sputtering, his face turning purple.  Caspar,\n     sitting across from him, is also turning purple.  Sitting\n     to one side are two identical thirty-year-old men, appar-\n     ently twins, mustachiced, silent, respectful, mournful,\n     their hands clasped over the hats in their laps, wearing\n     stiff new-looking suits with old-fashioned collars.\n\n                           Mayor\n          I can't do it, Johnny!  I'll look ridiculous!\n          Why, it simply isn't done!  Assistants, maybe--\n\n                           Caspar\n          For a mayor, you don't hear so hot!  I said head!\n          Head of the assessor's office!\n\n                           Mayor\n          But there's two of 'em!\n\n                           Caspar\n          I can count!  Co-heads!\n\n                           Mayor\n          Johnny, needless to say, this office will do\n          anything in its power to assist you and your\n          cousins.  We did it for Leo, of course, on\n          countless occasions--\n\n                           Caspar\n          Damn right--had every potato eater from County\n          Cork an the public tit--\n\n                           Mayor\n          But there's a way we do things, hallowed by usage\n          and consecrated by time!  When we put people on\n          the pad, when Leo was running things, we--\n\n     Caspar is furious:\n\n                           Caspar\n          Leo ain't running things!  I ain't innarested in\n          ancient history!  I'm running things now!\n\n                           Mayor\n          Johnny, no one appreciates that more than I!  I\n          can give them jobs!  I can give them good jobs!\n          I can even give them jobs where thev won't have\n          to perform any work, where their lack of English\n          will be no impediment!  But I cant--\n\n                           Caspar\n          What is this, the high hat?!\n\n     The mayor mops his face with a handkerchief and looks\n     beseechingly at Tom.\n\n                           Mayor\n          Tom, can you explain it to him?  I can put them\n          in public works but I can't--\n\n                           Tom\n          You can do whatever the hell Caspar tells you.  I\n          don't remember all this double-talk when Leo gave\n          you an order.\n\n     The mayor looks flabbergasted.\n\n                           Mayor\n          Tom!  Jesus!\n\n                           Tom\n          Stop whimpering and do as you're told.\n\n                           Caspar\n          You can start by gettin' outta here.\n\n                           Mayor\n          But Johnny, it's my office!\n\n                           Caspar\n          Get outta here!  Take it on the heel and toe,\n          before I whack you one!. . .\n\n     The mayor retreats and Casmar stares at the two men sitting\n     to the side.\n\n          . . . You too, beat it!\n\n     The two men look at each other, then back at Caspar.\n\n                           First Man\n          . . . Partiamo?\n\n                           Caspar\n          Yeah, go keep the mayor company.  I'll take care\n          of ya's later.\n\n     The immigrants rise and leave the room.  Caspar takes out a \n     handkerchief and wipes his brow.\n\n          . . . Runnin' things.  It ain't all gravy.\n\n     The secretary enters the office with a bottle of whiskey, a\n     soda siphon and ice.  She places it an the mayor's desk and\n     leaves.\n\n     We can still hear faint gunfire and an occasional booming\n     explosion that rattles the windows of the office.\n\n                           Tom\n          What's the fireworks?\n\n                           Caspar\n          Knockin' over one of Leo's clubs.  Sonofabitch\n          just won't go belly-up. . . I'm sorry, kid.  I\n          heard about your little ride this morning.\n\n     Tom is walking over to pour himself a drink.\n\n                           Tom\n          Yeah, well sorry don't fix things.  We could just\n          as easily've missed Bernie's corpse as stumbled\n          over it, and I'd be dead now.\n\n                           Caspar\n          I know, I know.  But it don't mean Bluepoint's up\n          to anything.  So he heard some rumor Bernie ain't\n          dead, those stories pop up, people seen Dillinger\n          in eight states last week.  So he hears a story,\n          and he don't like you much anyway, so he decides\n          to check it out--\n\n                           Tom\n          Any stories about Bernie being alive, Bluepoint's\n          made up himself.\n\n                           Caspar\n          Aw, you don't know that.  It don't even make\n          sense--why would he?\n\n     Tom stares at Caspar for a beat.\n\n                           Tom\n          . . . There could be a damn good reason. . .\n\n     Caspar squints at Tom.\n\n          . . . If you've got a fixed fight coming up.  Do\n          you?\n\n                           Caspar\n          . . . Maybe.  Okay, yeah, sure.  Tomorrow night,\n          the fix is in.  What of it?\n\n                           Tom\n          Bluepoint knows about it?\n\n                           Caspar\n          Yeah. . . \n\n     He gazes off.\n\n          . . . Okay, I get it.\n\n                           Tom\n          If Bluepoint's been selling you out on these\n          fights, and means to again, he'll have to be able\n          to point the finger at someone else--\n\n     Uncomfortably:\n\n                           Caspar\n          Yeah, yeah, I get it.\n\n                           Tom\n          --but with Bernie dead there ain't a hell of a\n          lot of people he can point to.\n\n                           Caspar\n          Yeah.  Bluepoint sells me out.  Makes pretend\n          Bernie's still doin' it.  Ats real pretty.\n          Bernie leaked the fix, and you take the fall for\n          supposedly not killing him. . . .\n\n     He leans back in the mayor's chair and gazes off, sucking\n     his lips in and out as he thinks.  Finally:\n\n          . . . But I dunno, why would Bluepoint cross me\n          like that?  Money, okay, everybody likes money.\n          But somehow it don't seem like him.  And I know\n          the Bluepoint.\n\n                           Tom\n          Nobody knows anybody.  Not that well.\n\n     Caspar shakes his head.\n\n                           Caspar\n          Money don't mean that much to him.\n\n     Tom shrugs.\n\n                           Tom\n          Then it's not just money he's after.  He's got a\n          wart on his fanny.\n\n                           Caspar\n          . . . Huh?\n\n                           Tom\n          A wart.  On his fanny.  Giving him the fidgets.\n          Maybe he's sick of sitting on the couch and maybe\n          behind your desk don't look like a bad place to\n          move to.  Maybe he figures the money can help\n          move him there.\n\n     Caspar studies Tom.\n\n                           Caspar\n          . . . Kid, you got a lip on ya.\n\n     He looks off again.\n\n          . . . I don't generally care for it.  But you're\n          honest, and that's something we can't get enough\n          of in this business. . . I'll admit, since last\n          we jawed, my stomach's been seazin' up on me.\n          Bluepoint saying we should double-cross you; you\n          double-cross once, where's it all end?  An\n          innaresting ethical question.  I'll find Blue-\n          point, talk to him, straighten it out--\n\n     Tom laughs bitterly.\n\n                           Tom\n          Sure, talk to him.  Have a chat.  Ask him whether\n          he's selling you out.  Don't take care of him\n          before he makes his next move, just sit back and\n          let him make it.  You're swimmin' in it.\n\n     Caspars eyes flash.  Tom's tone softens:\n\n          . . . Johnny, my chin's hanging out right along\n          side yours.\n\n     Caspar goes slack.\n\n                           Caspar\n          Yeah.\n\n     Tom stands up.\n\n                           Tom\n          . . . I'd worry a lot less if I thought you were\n          worrying enough.\n\n     Caspar, miserable, rubs his face.  From the distant street,\n     we hear another booming explosion.\n\n                           Caspar\n          . . . But I am, kid. . . Christ. . . running\n          things. . .\n\n\n\n68.  CUT TO:\n     TOM'S APARTMENT\n\n     The phone is ringing at the cut.\n\n     We are looking at the window sill upon which the phone\n     sits, with an empty chair facing.\n\n     Footsteps approach and Tom sits into frame and takes the\n     phone.\n\n                           Tom\n          Yeah?\n\n     Through the phone:\n\n                           Voice\n          I got your message.\n\n                           Tom\n          'Lo, Bernie, I had a dream about you the other\n          day.\n\n     We hear Bernie laugh.\n\n                           Bernie\n          . . . Yeah?  A nightmare?\n\n                           Tom\n          On the contrary; very sweet.  I dreamt you were\n          lying out at Miller's Crossing with your face\n          blown off.\n\n     More laughter.\n\n                           Bernie\n          . . . You get a kick out of that?\n\n                           Tom\n          I was in stitches.  It's Mink, isn't it?\n\n                           Bernie\n          I came back and he wasn't happy to see me.  Can\n          you beat that, Tom?  All he could taik about was\n          how he had to skip, and how much trouble he'd be\n          in if anyone found me at his place.\n\n                           Tom\n          Some friend.\n\n                           Bernie\n          Yeah.  And you know what a nervous boy he was.  I\n          figured, hell, you're a friend.  Maybe you could\n          use some insurance.\n\n                           Tom\n          That's you to the gills, Bernie: thoughtful.  You\n          didn't happen to keep his gun, did you?\n\n     After a moment's hesitation:\n\n          . . . Didn't Mink have a .22?\n\n                           Bernie\n          Held already ditched it.  Why?\n\n     Another hesitation:\n\n                           Tom\n          . . . After Rug?\n\n                           Bernie\n          Yeah. . . How did you know?\n\n     Down to business:\n\n                           Tom\n          Doesn't matter.  Listen, Bernie, I've been\n          thinking about our little deal and I've decided\n          you can stick it in your ear.\n\n                           Bernie\n          . . . Huh?\n\n                           Tom\n          I figure you don't have anything on me that I\n          don't have on you.  As a matter of fact, less,\n          since I've decided to leave town. So I'm calling\n          your bluff.\n\n                           Bernie\n          Wait a minute--\n\n                           Tom\n          Shutup and let me talk.  I'm pulling out of here,\n          tomorrow morning.  The only thing for you to\n          decide is whether or not I leave behind a message\n          for Caspar that you're still around.  If you want\n          me to keep my mouth shut, it'll cost you some\n          dough.\n\n                           Bernie\n          You can't--\n\n                           Tom\n          I figure a thousand bucks is reasonable.  So I\n          want two thousand.\n\n                           Bernie\n          In a pig's eye--\n\n                           Tom\n          This isn't a debate, it's instructions.  I'm\n          going out for a while; I'll be back here at four\n          this morning.  Bring me the money.  If you're not\n          at my place, four o'clock, with the dough,\n          Caspar'll be looking for you tomorrow.\n\n     He hangs up.\n\n\n\n69.  CUT TO:\n     HALLWAY\n\n     We are close on Tom as, in overcoat and hat, he emerges\n     from his apartment and looks down at the keys in his hand.\n\n     WHAP--A fist swings into frame to connect with Tom's cheek.\n     He falls back.\n\n     Three topcoated men loom over him.\n\n                           First Man\n          Got any money?\n\n     Tom is massaging his face.\n\n                           Tom\n          . . . No.\n\n     The first man nods at the other two.\n\n                           First Man\n          Okay.\n\n     The two men pick Tom off the floor and start to work him\n     over.  He doesn't resist.\n\n     The first man watches dispassionately.\n\n          . . . Third race tonight.  By the finish, Tailor\n          Maid had a view of the field.\n\n     He lights himself a cigarette.\n\n          . . . You oughta lay off the ponies, Tom.\n\n     The two men work in silence for a while.  Tom too is\n     silent.\n\n     Finally:\n\n          . . . Okay.\n\n     The two men back away from Tom, breathing heavily.  He\n     slides down the wall to the floor.\n\n          . . . Lazarre said he's sorry about this.  It's\n          just getting out of hand.\n\n     Tom speaks thickly, his head propped against the baseboard:\n\n                           Tom\n          . . . Yeah.\n\n                           First Man\n          He likes you, Tom.  He said we didn't have to\n          break anything.\n\n                           Tom\n          Yeah.  Okay. . . Tell him no hard feelings.\n\n                           First  Man\n          Christ, Tom, he knows that.\n\n     With a jerk of the head the first man signals the other two\n     and the trio turns to leave.\n\n                           First Man\n          . . . Take care now.\n\n\n\n70.  CUT TO:\n     DOORWAY:  NIGHT\n\n     We are looking over Tom's shoulder as he waits in the rain\n     in front of a large oak doorway with wrought-iron fretwork.\n     At the cut we hear chimes dying, and the door swings open.\n\n     There is a grand foyer with a parquet floor, unsittable\n     furniture and a large chandelier.  A liveried butler looks\n     inquiringly out at Tom.\n\n                           Tom\n          Tom Duchaisne.\n\n                           Butler\n          Yes sir . . .\n\n     He steps back.\n\n          . . . Mr. Caspar is in the great room.\n\n     Tom is handing the butler his hat.\n\n                           Tom\n          Swell.  Can you take this?\n\n\n     INT   FOYER\n\n     As Tom starts to shrug out of his coat, Caspar is crossing\n     towards him.\n\n                           Caspar\n          Kid, what's the rumpus?\n\n     Caspar seems as unhappy as last time we saw him.\n\n                           Tom\n          I got news.\n\n                           Caspar\n          Yeah, news at this end too.  My stomach's been\n          seazin' up on me.\n\n                           Tom\n          Mink just told me that he--\n\n     This has woken Caspar up:\n\n                           Caspar\n          You talked to Mink?!\n\n                           Tom\n          Yeah, on the phone.  Bluepoint wants you to think\n          he's dissappeared, so you can't talk to him, but\n          he's been right here in town.\n\n                           Caspar\n          You're sure it was Mink?\n\n     Tom shrugs.\n\n                           Tom\n          See for yourself; he's coming to my place, four\n          o'clock this morning.\n\n     Having handed the butler his coat and hat, Tom lets Caspar\n     lead him towards a pair of double doors.\n\n          . . . He's afraid of a cross from Bluepoint.  He\n          told me about the fix.  Says he'll sing for a\n          couple grand skip money, tell us everyone\n          involved. . .\n\n71.  Caspar opens one of the double doors, and we continue\n     tracking behind the two men as they enter the trophy room.\n     The room has the low warm light of a men's club.  Outside\n     the dark windows the rain sheets down.\n\n     Caspar sits in behind his desk and swivels away to poke\n     morosely with a fire shovel at the blaze in the fireplace.\n     In the foreground, back to us, Tom rests his knuckles an\n     the desk to lean towards Caspar.\n\n          . . . But you better take care of Bluepoint right\n          away.  Mink says if he comes after us its going\n          to be tonight.\n\n     As he looks into the fire:\n\n                           Caspar\n          Leo's holed up at Whiskey Nick's dump.\n\n     Tom is momentarily taken aback.\n\n                           Tom\n          . . . How d'you know?\n\n     A chuckle comes from behind\n\n\n     REVERSE\n\n     On Tom.  In the background, Bluepoint is walking over to\n     the door to the room to close it.\n\n                            Bluepoint\n          That ain't all we know, smart guy.\n\n     He points with a nod towards the couch.\n\n          . . . Recognize your playmate?\n\n     On the couch sits Drop Johnson.  Drop's face looks worked\n     on, and is beaded over with sweat.\n\n     Having shut the door, Bluepoint is sauntering over to Tom.\n\n          . . . Yeah.  You thought I'd quit.\n\n     He shakes his head.\n\n          Huh-uh.  I followed you this afternoon.  And I\n          wondered why Einstein would want to talk to a\n          gorilla. . .\n\n     He is nose to nose with Tom, smiling at him.\n\n          . . . So I grabbed the gorilla. . . And I beat it\n          out of him.\n\n     He shrugs.\n\n          . . . Give me a big guy, every time.  They crack\n          easy.  Not like you.\n\n     Tom holds Bluepoint's look.\n\n                           Tom\n          Is there a point?  Or are you just brushing up on\n          your small talk?\n\n                           Bluepoint\n          I like that.  Cool under fire.  I'm impressed.\n\n     Very quickly he delivers two slaps--forehand and backhand.\n     Tom's head rocks but he recovers to stare back at Blue-\n     point.\n\n          . . . The gorilla didn't know whose stiff we\n          found, but I can fill that in.  You killed Mink,\n          you sonofabitch.\n\n     He grabs Tom by the lapels, swings him away from the desk,\n     and lands a punch on his chin.\n\n     Tom stumbles backs.\n\n     Caspar has turned from the fireplace, watching the doings\n     across the room.\n\n     Bluepoint moves towards Tom, breathing hard with antici-\n     pated pleasure.\n\n          . . . Come here, bum.  I'm gonna send you to a\n          deep dark place.  And I'm gonna have fun doing\n          it.\n\n     Bluepoint's hand snakes out and grabs Tom by the front of\n     the coat, hauling him close.  He slaps him savagely.\n\n          . . . It was Mink, and by God I'll hear you say\n          it!\n\n                           Tom\n          Is this how you taught Drop his story?\n\n     In one motion Bluepoint's hands wrap around Tom's throat\n     choking him off.  As the pressure increases, Tom, purpling,\n     sinks to his knees.\n\n                           Bluepoint\n          I like the way you think.  Maybe when you're dead\n          I'll cut your head off, put it on my mantle--\n\n     WHANG--a shovel blade swings into frame to smash Bluepoint\n     in the face.\n\n     He drops.\n\n     From somewhere in the room, a scream.\n\n     Bluepoint is on his hands and knees, one hand pressed over\n     his ruined face, blood pouring from between the fingers.\n\n                           Caspar\n          Sonafabitch. . .\n\n     He stands over Bluepoint with the fireplace shovel.\n\n          . . . If there's one thing I can't stand, it's a\n          double-cross artist.  I had a feeling 'bout this\n          sonofabitch--\n\n     He swings the shovel back and delivers an overhand blow to\n     the top of Bluepoint's head.\n\n     Bluepoint drops to the floor, instantly motionless.\n\n     The scream, however, continues.\n\n     Drop Johnson, on the couch, his eyes wide, his hands\n     spastically squeezing his knees, is looking down at\n     Bluepoint.  Drop's mouth is stretched wide.  He is scream-\n     ing.\n\n     Tom gets slowly to his feet.\n\n     Cascar looks at Drop.\n\n          . . . Shut it, you sonofabitch!\n\n     He is striding over to him with the shovel.\n\n          . . . I'll give you something to holler about!\n\n     Tom intercepts him.\n\n                           Tom\n          Johnny.  It's okay.  Bluepoint made him.  It's\n          okay.  It's not important.\n\n     Caspar is panting.\n\n                           Caspar\n          Then have him shut it!\n\n     Drop does.\n\n     There is a beat.\n\n     Incongruously, Caspar's bellow breaks the silence:\n\n          . . . And we do the same to Mink!  This very same\n          night!\n\n     Another silence.  The rain.  The crackle of the fire.\n\n     Tom's tone is soothing:\n\n                           Tom\n          . . . Johnny.  We can't double-cross him.  He\n          wants to spill the whole set-up--\n\n     Caspar stares at him through glazed eyes.\n\n                           Caspar\n          I've never let a sonofabitch walk!\n\n                           Tom\n          You've never crossed anyone . . .\n\n     Caspar is staring at him.  His eyes have lost some of their\n     glaze.\n\n                           Tom\n          . . . Four o'clock, my place.  Mink's coming in\n          on his own hook so I promised him the money.\n          Don't make me out a liar--\n\n     Drop is suddenly screaming again.\n\n     Caspar looks where Drop is looking:\n\n     Bluepoint is raising his head, moaning.  His face is a mask\n     of blood.  One hand gropes in his overcoat pocket for his\n     gun.\n\n     Caspar shouts over Drop's howl as he pulls something from\n     his desk drawer:\n\n                           Caspar\n          . . . Lookit this, kid.\n\n     He strides over to Bluepoint.\n\n          . . . Something I try and teach all my boys. . .\n\n     With the gun point blank against the back of Bluepoint's\n     head, he fires.\n\n     Tom recoils.\n\n          . . . Always put one inna brain!\n\n\n\n72.  A CLOCK\n\n     A large wall clock.  It is 3:30.\n\n     We are pulling back and down to reveal that we are inside a\n     diner; we are isolating on a section of counter on which\n     sits a half-empty cup of coffee and an ashtray half-filled\n     with butts.  A hand puts some change on the counter and\n     leaves frame.\n\n\n73.  EXT   DINER\n\n     As Tom pushes the door open and exits.  He tucks his\n     overcoat collar up as he walks; it is pouring rain.\n\n     Tom turns at the sound of approaching heels and recognizes\n     Verna with some surprise.  He glances up and down the\n     street, but it is deserted.  Verna doesn't seem to much\n     notice the rain.\n\n                           Tom\n          'Lo, Verna.  What's the rumpus.\n\n     Coldly, as they walk on together:\n\n                           Verna\n          I was just in the neighborhood, feeling a little\n          daffy.  What're you doing?\n\n                           Tom\n          . . . Walking.\n\n                           Verna\n          Don't let on more than you have to.\n\n                           Tom\n          In the rain.\n\n     Tom glances at her.\n\n          . . . What're you doing out?\n\n                           Verna\n          Bernie's dead, isn't he?\n\n     They walk on for a beat, Tom looking down at the sidewalk.\n     Finally:\n\n                           Tom\n          . . . What makes you think that?\n\n                           Verna\n          That's no answer.\n\n     Tom again glances around, and escorts Verna into a dark\n     doorway alcove.  It is very small; they have to crowd into\n     each other to stay out of the rain.  Water drops from the\n     brim of Tom's fedora.  He studies her for a beat.\n\n                           Tom\n          I can't tell you anything yet.\n\n                           Verna\n          Nobody cares, do they?  His friends didn't really\n          like him.\n\n     Tom shrugs.\n\n                           Tom\n          He didn't like his friends.\n\n                           Verna\n          You're a sonofabitch, Tom.  You're someone to\n          talk.  You got me to tell you where he was and\n          then you killed him.\n\n     She is raising a gun into frame: She presses it into his\n     stomach.\n\n     Tom stiffens but continues to stare at her calmly.\n\n          . . . Tell me why.  What was in it for you?\n\n                           Tom\n          Nothing for me.\n\n                           Verna\n          Then why?\n\n                           Tom\n          . . . Giving up Bernie was the only way I could\n          see to straighten things out for Leo.\n\n                           Verna\n          You said you didn't care about Leo.\n\n                           Tom\n          I said we were through.  It's not the same thing.\n\n     Verna looks at him.\n\n                           Verna\n          I don't understand.  I don't care.  I don't\n          care what reason you had or thought you had.\n\n     She raises the gun and presses its barrel into the under-\n     side of Tom's chin.  Tom stiffens but remains calm.\n\n                           Tom\n          . . . He's still alive.\n\n     Verna stares at him.\n\n                           Verna\n          You expect me to  believe you?\n\n                           Tom\n          . . . No.\n\n                           Verna\n          That's you all over, Tom.  A lie and no heart.\n\n     Verna pulls back the hammer.  There is a long beat.\n\n     Verna's eves widen, locked an Tom's.\n\n     Tom returns her look; his is sympathetic.\n\n     Verna starts trembling.\n\n     Tom's tone is soft, understanding.  It's the first time we\n     have ever seen compassion from him.\n\n                           Tom\n          . . . It isn't easy, is it Verna?\n\n     She abruptly lurches away and staggers a couple of paces\n     onto the sidewalk in the rain.  She hugs a lamppost for\n     support.  She is staring down at the street, still trem-\n     bling.\n\n     Tom walks up behind her and rests a hand an her shoulder.\n\n          . . . Are you all right?\n\n     She doesn't look around.  After a moment:\n\n                           Verna\n          . . . I don't know how you did it.\n\n     She shrugs off his hand and stumbles off down the street.\n\n     Tom watches her dissappear into the rain.\n\n\n\n74.  CUT TO:\n     TREE LIMBS\n\n     Night, but sometime later--it has stopped raining.  The\n     branches groan in the wind.  As they sway, streetlight\n     glitters off the leaves, still wet with rain..\n\n     We are booming down to reveal that we are in front of Tom's\n     building, its windows dark.  During the boom we hear the\n     rumble of an approaching car and the hiss of its tires on\n     wet asphalt.\n\n     The boom down ends as the car pulls into frame to stop at\n     the curb with the camera framed on the driver's window.\n     The driver has a small bandage on his left cheek.  We hear\n     Caspar's voice as we hear him getting out the back:\n\n                           Caspar\n          Ya put the razor in cold water, not hot--'cause\n          metal does what in cold?\n\n                           Driver\n          I dunno, Johnny.\n\n     We hear the back door slam and Caspar appears in the front\n     passenger window.\n\n          . . . 'Ats what I'm tellin' ya. It contracts.\n          'At way you get a first class shave.\n\n                           Driver\n          Okay, Johnny.\n\n     As Caspar walks off the driver slouches back, pulls his\n     fedora over his eyes and folds his arms across his chest.\n     A back enters frame in the foreground.\n\n                           Tom's Voice:\n          'Lo, Sal.  You can dangle.\n\n     The driver looks up, startled.\n\n                           Driver\n          'Lo, Tom.  You sure?  You don't look so hot.\n\n     We still don't see Tom's face.\n\n                           Tom\n          I'm okay.  Go ahead, I'll drive him home.\n\n     The driver shrugs.\n\n\n     REVERSE\n\n     Wider, from the other side of the car, as the car pulls\n     away.\n\n     Tom walks into the foreground, toward his house; we tilt up\n     to hold him.\n\n     The low-angle shows us the tree behind Tom, its branches\n     still creaking in the wind.\n\n     Crack crack--we hear two gunshots from inside the house.\n\n     Tom stops momentarily in close shot, looking up, and then\n     continues on out of frame.\n\n\n75.  OVER TOM'S SHOULDER\n\n     We follow him as he walks into the building and slowly down\n     the first-floor hall.\n\n     The hallway is quiet excent for a light moaning wind.\n\n     Beyond Tom we see the door to the first-floor apartment\n     crack open a slit.  Hissing:\n\n                           Voice\n          Mr. Duchaisne. . .\n\n     The door opens wider.  Mrs. Zarpmas, wearing a housecoat,\n     her gray hair down in braids, sticks her head out.\n\n          . . . There were shots.\n\n     Tom looks up towards the staircase, then back at Mrs.\n     Zarpas.\n\n                           Tom\n          Go down to the drugstore.  Call the police.\n\n     She stares at him, nods.  As she drapes on a raincoat:\n\n                           Mrs. Zarpas\n          Yes, Mr. Duchaisne.\n\n                           Tom\n          You better stay there til the officers arrive.\n\n                           Mrs. Zarpas\n          Yes . . .\n\n     She pauses.\n\n          . . . Will the cats be all right here?\n\n     Tom stares at her.\n\n     Finally, he nods.\n\n                           Tom\n          . . . They'll be fine.\n\n     Mrs. Zarpas returns his dazed nod, and shuffles away.\n\n     So far, upstairs, all is quiet.\n\n\n     PULLING TOM\n\n     As he starts slowly towards the staircase.\n\n\n     TOM'S POV   TRACKING FORWARD\n\n     A small black object on the staircase--an upside-down\n     fedora.  Blood drips with a hollow rattle down onto a step,\n     a couple steps above the hat.\n\n\n     PULLING TOM\n\n     He looks up.\n\n\n     POV\n\n     A head sticks through the balusters of the second story\n     landing return.  The body is on its back; the head lolls\n     back over the tip of the landing down towards the stair-\n     case.\n\n     Our climbing low angle shows us mostly the back of the\n     head.  The body's far shoulder has knocked out a baluster\n     whose splintered bottom juts down towards the stairs.\n\n\n     PULLING TOM\n\n     Still climbing, looking at the body.\n\n\n     HIS POV\n\n     Climbing and panning as we draw even with the head.\n\n     It is Caspar.  Blood has been expelled through his nostrils\n     over his mouth and chin.  His face is deep red.  His eyes\n     stare glassily at Tom.\n\n\n     PULLING TOM\n\n     As he reaches the top of the stairs and swings around to\n     face along the landing.  We hear a chuckle, close by.  Wind\n     is groaning through the hallway.\n\n\n     POV\n\n     In the middle foreground Caspar lies an the floor; beyond\n     him, Bernie leans against the doorframe in Tom's open\n     doorway, smiling, his arms folded over his chest.\n\n     The balusters stretch away in a regular line, throwing\n     vertical shadows upwards against the opposite wall.\n\n                           Bernie\n          I get it.  You set me up.\n\n     Tom leans against the wall and looks morosely down at\n     Caspar.\n\n                           Bernie\n          . . . Anything to avoid a little dirty work\n          yourself, huh?\n\n     Tom doesn't answer.\n\n          . . . How'd you know held get it and not me?  Or\n          didn't you care?\n\n     Tom shrugs, still staring down at Caspar.\n\n                           Tom\n          I figured you'd come early, and be looking for\n          blood.  He wouldn't, so you'd likely have the\n          drop on him.\n\n     Bernie takes his gun out of his overcoat packet and\n     saunters over.\n\n                           Bernie\n          You're a sonofabitch, Tom.  I like the way you\n          think.  You're right, the bonehead never knew\n          what hit him.\n\n     He looks down at Caspar, unable to supress a smile.\n\n          . . . But if you knew I'd come looking to kill\n          you, how do you know I won't still?\n\n     Tom shrugs again.\n\n                           Tom\n          Nothing in it for you, now.  With him dead we got\n          nothing on each other.  Let me have the gun.\n\n                           Bernie\n          Why?\n\n     Tom jerks his head towards Caspar.\n\n                           Tom\n          Pin this on Bluepoint.  Neither of us wants him\n          walking around after this.\n\n     Bernie shakes his head.\n\n                           Bernie\n          The cops'll be Leo's now.  They won't care what\n          they hang Bluepoint for.\n\n     Tom shrugs again.\n\n                           Tom\n          I guess that's so.  If you don't mind keeping the\n          gun that killed Caspar.  And Mink.\n\n     He stoops down over Caspar's body and starts feeling\n     through Caspar's pockets, looking for something.\n\n          . . . Why did Mink shoot Rug, anyway?\n\n     Bernie is walking towards him, emptying the bullets from\n     his gun.\n\n                           Bernie\n          I dunno, it was just a mix-up.  Here.\n\n     Tom looks back over his shoulder.  Bernie hands him the\n     gun, which Tom slips into his overcoat packet.\n\n          . . . So you're gonna say Bluepoint did this?\n\n     As he goes back to the body:\n\n                           Tom\n          Mink thought Rug was tailing him?\n\n     He finds Caspar's gun and sets it on the floor, but keeps\n     looking.\n\n                           Bernie\n          Yeah yeah, you know Mink.  Hysterical.  Skin full\n          of hop, head full of bogeymen.  Comes home crying\n          one day, said he had to pop a guy, one of\n          Bluepoint's spies.\n\n                           Tom\n          Rug was following Verna, not Mink.  Mink just\n          happened to be with her.\n\n     He has found a wallet and is thumbing through it.\n\n                           Bernie\n          Yeah.  Funny, ain't it?  But you know, Mink was\n          terrified Bluepoint'd find out me and him were\n          jungled up together.\n\n     Tom has taken out the money, rifles it, and replaces the\n     wallet.\n\n                           Tom\n          And I'll bet you'd kept him plenty worried about\n          that, to keep him under your thumb.\n\n                           Bernie\n          Yeah, so what . . .\n\n     Bernie is peering over Tom's shoulder at the monev.\n\n          . . . Scratch, huh?  A  little bonus?\n\n     Tom straightens up, Caspar's gun in hand.\n\n                           Tom\n          Why did Mink take Rug's hair?\n\n     Bernie shrugs.\n\n                           Bernie\n          Beats me, the kid was dizzy.  Fifty-fifty on the\n          dough?  Or maybe I should get a little more,\n          since I did the deed.\n\n     Tom is stuffing the money into his pocket.\n\n          . . . Okay, you keep it.  I want you to have it.\n\n                           Tom\n          Bernie. . .\n\n     He nods towards Caspar's body.\n\n          . . . We can't hang this on Bluepoint.\n\n                           Bernie\n          Huh?  Why not?\n\n                           Tom\n          Bluepoint's already dead, halfway 'cross town.\n\n     Bernie's smile is fading.\n\n                           Bernie\n          What the hell are you talking about?\n\n                           Tom\n          Bluepoint's dead.  It's gotta be you.  I mean\n          hell, it's your gun.\n\n     Alarm is beginning to rise:\n\n                           Bernie\n          What is this!  What the hell are you talking\n          about! . . .\n\n     He looks down at Caspar and then back at Tom.\n\n          . . . You took my gun!  Just your word against\n          mine!\n\n     Tom pops the chamber of Caspar's gun, glances in, and snaps\n     it shut.\n\n                           Tom\n          Not necessarily.\n\n     Bernie's eyes widen.\n\n                           Bernie\n          Are you crazy!  We're square!  You said it\n          yourself!  We got nothing on each other!\n\n                           Tom\n          Yup.\n\n     Bernie fights against hysteria:\n\n                           Bernie\n          So what's in it for you?!  There's no angle!  You\n          can't just shoot me, like that!\n\n     He sinks to his knees, his voice rising.\n\n          . . . Jesus Christ!  It don't make sense!  Tommy!\n          Look in your heart!\n\n                           Tom\n          What heart.\n\n     BANG--Bernie splays backwards from the knees, a bullet\n     drilled neatly through his forehead.\n\n     Tom drops the gun by Caspar's body.\n\n     Unpocketing Bernie's gun, Tom goes over to his corpse and\n     drops it there.\n\n     We pan with Tom's legs to bring his doorway into view as he\n     walks into his apartment, to the window chair in the\n     background, and sits with his back to us.\n\n     The windows show daylight breaking.  Far away a clock\n     strikes the quarter hour.\n\n     Tom is picking up the phone and dialing.  Waiting for an\n     answer, he reaches over to turn off the feeble yellow lamp\n     burning chairside.\n\n     As we start to FADE OUT, we can hear Tom talking into the\n     phone:\n\n                           Tom\n          . . . Tony?  Tom.  Tell Lazarre I've got his\n          money. . . Yeah, all of it.  And I want to place\n          a bet on tonight's fight. . .\n\n     A BEAT OF BLACK\n\n\n\n76.  CUT TO:\n     THE HALLWAY\n\n     Of Leo's club, leading to his office.\n\n     We are tracking over Tom's shoulder as he walks down the\n     hall, led by Dead Terry.\n\n                           Terry\n          They set you up downstairs?\n\n                           Tom\n          How's that?\n\n                           Terry\n          Hootch?  Whatever?\n\n     Tom gestures with the drink he is carrying.  Its ice cubes\n     clink.\n\n          . . . Well thanks for coming, Tom.  Leo's real\n          anxious to see you. . .\n\n                           Tom\n          Yeah.  I happened to be near.\n\n     We can hear muffled bellowing coming from Leo's office,\n     growing louder as we approach.\n\n     Terry seems embarassed:\n\n                           Terry\n          Actually. . . this might not be the best time. . .\n\n     They have pulled up in front of the closed door to Leo's\n     office.\n\n     Leo's bellowing, inside, abates for a moment.  We can hear\n     another voice, muffled so that we don't hear words, but\n     only the voice's plaintive quality.\n\n     Leo's bellowing cuts it short.\n\n                           Tom\n          . . . Who's he got in there?\n\n                           Terry\n          O'Gar and the mayor.\n\n     As he leaves frame:\n\n                           Tom\n          I'll try again.\n\n     Terry calls after him:\n\n                           Terry\n          I'll tell him you stopped by.\n\n\n\n77.  DOWNSTATRS\n\n     Pulling Tom as he walks across the gambling floor, drink\n     still in hand.\n\n     Behind him we can see workmen busily repairing the damage\n     done to the club in the police raid.\n\n     Halfway across the floor Tom stiffens and slows, seeing\n     something.\n\n     Verna is entering the club.\n\n     The two meet.\n\n                           Tom\n          'Lo, Verna.\n\n                           Verna\n          See Leo?\n\n     They both lean against a counterstop and look out at the\n     floor.\n\n                           Tom\n          He was busy.\n\n                           Verna\n          You should see him.  He has something to tell\n          you.\n\n                           Tom\n          Maybe I'll run into him.\n\n                           Verna\n          Bernie's funeral is tomorrow.  You could stop by.\n\n                           Tom\n          Maybe.\n\n                           Verna\n          . . . Leo has something to tell you.\n\n                           Tom\n          So you said.\n\n     There is a silent beat.  Verna scowls.\n\n                           Verna\n          . . . Tell me something, Tom.  Why didn't you\n          tell me what was going on?  I thought he was\n          dead, and you never--\n\n                           Tom\n          There was no point in telling you.  It could only\n          have queered things if it had gotten out--\n\n                           Verna\n          Jesus, Tom!  You don't just talk to people for\n          the play it gives you or doesn't give you!  I\n          suffered, you no-heart son of a bitch!\n\n     Tom lets this drift.\n\n     Verna tries to compose herself.\n\n          . . . I'm sorry.  It's just that things might've\n          been different.  With us.  If I'd known that you\n          hadn't. . . done anything to him. . .\n\n                           Tom\n          You know now.\n\n     Verna looks at him intently.\n\n                           Verna\n          What happened that night?\n\n     Tom still looks at her evenly.\n\n                           Tom\n          I went to a bar.  Passed out.  When I got back to\n          my place they were both dead.\n\n     Verna studies him.\n\n                           Verna\n          . . . Passed out, huh?\n\n                           Tom\n          Yeah.\n\n     She looks at him a beat more, then out at the floor.\n\n                           Verna\n          It's funny. . . I've never even seen you sleep--\n          though you told me once about a dream you had.\n\n                           Tom\n          Maybe I lied.\n\n     WHAP!  Verna slaps him hard.  His head rocks under the\n     blow.\n\n                           Verna\n          You've never been straight with me about any-\n          thing!  You are a sonofabitch!\n\n     She stalks off.\n\n     Tom watches her go.\n\n     He raises the drink and rolls it across his slapped cheek.\n\n     The ice cubes clink.\n\n\n78.  CEMETARY\n\n     An small old marble orchard set on a hilltop cleared\n     against the woods.  Stars of David adorn the headstones; in\n     the foreground Bernie's funeral is ending.  Present is a\n     rabbi, just finishing the chanting of the liturgy, Verna,\n     and Leo.\n\n     In the background, on the road at the foot of the hill, Tom\n     is emerging from a taxi.  It rolls away as he starts up the\n     hill.\n\n     Just as he arrives, Leo and Verna turn to leave.\n\n     Tom takes in the scene.\n\n                           Tom\n          Big turnout.\n\n                           Verna\n          Drop dead.\n\n     She stalks off, leaving Leo and Tom alone.  Leo takes off\n     his yarmulke and fiddles with it uncomfortably.  The two\n     men start walking.\n\n                           Leo\n          . . . She's under a lot of strain.\n\n                           Tom\n          Well, at least she didn't hit me.\n\n     Leo chuckles.\n\n     They walk on.\n\n                           Leo\n          Tommy, I'm glad you came. . .\n\n                           Tom\n          She's taking the car.\n\n                           Leo\n          Huh?\n\n     Leo looks up.\n\n     Verna is getting into the elegant black touring-car that\n     waits at the bottom of the hill.  It pulls away.\n\n     Leo looks at Tom.\n\n          . . . I guess we're walking.\n\n                           Tom\n          I guess we are.\n\n     They walk in silence for a beat.\n\n                           Leo\n          . . . We're getting married.\n\n     Tom stiffens.  He brings out:\n\n                           Tom\n          . . . Congratulations, Leo.\n\n     Leo too is uncomfortable.\n\n                           Leo\n          The funny thing is. . . She asked me.  To tie the \n          knot.  I guess you're not supposed to say that.\n\n                           Tom\n          It doesn't matter.  Congratulations.\n\n                           Leo\n          Thanks. . . Hell, Tom!  Why didn't you tell me\n          what you were up to?!  I thought you'd really\n          gone over--not that I didn't deserve it.  But you\n          could have told me.\n\n                           Tom\n          Telling you could only've queered things if it\n          had. . .\n\n     Tom cuts himself off and walks in silence for a moment.\n\n          . . . There just wasn't any point.\n\n     Leo wants to be encouraging.  He nods.\n\n                           Leo\n          I can see that.  Well.  It was a smart play, all\n          around.  I guess you know I'm grateful.\n\n                           Tom\n          No need.\n\n     Leo is grinning again.\n\n                           Leo\n          I guess you picked that fight with me just to\n          tuck yourself in with Caspar.\n\n                           Tom\n          I dunno.  Do you always know why you do things,\n          Leo?\n\n     Leo greets this with a puzzled Smile.\n\n                           Leo\n          Course I do.\n\n     He nods to himself.\n\n          . . . It was a smart play.\n\n     They walk on.\n\n                           Tom\n          You'll do fine.\n\n     Leo stops, grabs Tom's arm, and the words come cut in a\n     rush:\n\n                           Leo\n          . . . Jesus, Tom!  I'd give anything if you'd\n          work for me again!  I know I've made some\n          bonehead plays!  I know I can be pig-headed but,\n          damnit, so can you!  I need your help, and things\n          can be like they were, I know it!  I just know\n          it!  As for you and Verna--well I understand,\n          you're both young, and--well, damnit, Tom, I\n          forgive you!\n\n     Tom instantly bristles.  For the first time, his tone is\n     sharp:\n\n                           Tom\n          I didn't ask for that and I don't want it.\n\n     The two men stare at each other--Tom's look angry; Leo's,\n     distraught.\n\n     Tom's look softens.\n\n          . . . Goodbye, Leo.\n\n     Leo still stares at him, waiting for something else.\n\n     When nothing is forthcoming he turns and walks away.\n\n     Tom watches him go.  He unpockets a flask and raises it to\n     his lips.\n\n     Behind him a tree soughs in the wind.\n\n     FADE OUT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMiller's Crossing\nWriters :   Joel Coen  Ethan Coen\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:31:14.400876"}