{"title": "Mimic", "film_link": "/Movie Scripts/Mimic Script.html", "script_link": "/scripts/Mimic.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Mimic Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Mimic Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Matt Greenberg\" title=\"Scripts by Matt Greenberg\">Matt Greenberg</a><br/>  <a href=\"/writer.php?w=Guillermo del Toro\" title=\"Scripts by Guillermo del Toro\">Guillermo del Toro</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : June 1996<br/>\n<br/>\n<a href=\"/scripts/Mimic.html\">Read \"Mimic\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n   <title>\"Mimic\", production draft, revised by Matt Greenberg &amp; Guillermo del Toro</title>\n\n\n\n   <pre>\n\n\n\n\n\n\n\n                            M i M i C\n\n                            a revision\n                                by\n\n                          Matt Greenberg\n                               and\n                        Guillermo del Toro\n\n\n\n\n                                                     June 19th 1996\n\n\n\n\n\n\n\n<b>     NOTE: THE HARD COPY OF THIS SCRIPT CONTAINED SCENE NUMBERS.\n</b><b>     THEY HAVE BEEN REMOVED FOR THIS SOFT COPY.\n</b>\n\n\n\n<b>                                                           FADE IN:\n</b>\n<b>     THE SCREEN\n</b>\n     Stygean darkness.\n\n     Wet CLICKING SOUNDS. A BEAM of purplish ULTRA-VIOLET LIGHT\n     reveals a mosaic of moving forms... COCKROACHES. They skitter\n     restlessly under the beam's intensity. SERIES OF SHOTS -- the\n     UV Beam passing over various parts of the space. Pipe webs,\n     walls, girders -- all covered with the insects. Thousands of\n     them.\n\n<b>     PULL BACK TO REVEAL\n</b>\n<b>     INT. SEWER SYSTEM\n</b>\n     Innards of steel. A vast maze of tunnels.\n\n     A GROUP OF FIGURES advances through the tunnels with handheld\n     UV lamps.\n\n     The figures are dressed in gray air-tight NEOPRENE SUITS,\n     their faces hidden by skin tight MASKS and bug-like NIGHT\n     VISION GOGGLES. In the dense silence, respirator valves HISS-\n     CLICK at the corner of their lips in mechanical rhythm.\n\n     The scene has a dream-like, choreographed quality.\n\n<b>     NIGHT-VISION POV\n</b>\n     Eerie, aquatic green.  The horde of insects appear to be some\n     kind of sea-life, crawling over the floor of a dead ocean.\n\n<b>     THE TEAM OF FIGURES\n</b>\n     From their midst appears another FIGURE, its neoprene suit a\n     flat WHITE.  Female, clearly the TEAM LEADER.\n\n     She carries a stainless steel CONTAINER filled with twenty\n     small compartments, each bearing a large, heavy-shelled roach\n     with a different BARCODE on their back.\n\n<b>     JUDAS ROACHES.\n</b>\n     She kneels and opens the\n\n<b>     CASE\n</b>\n     TCHK!! A dozen of the Judas roaches are released.  They slide\n     through into the area.\n\n<b>     THE NEARBY ROACHES\n</b>\n     react instantaneously.  In a rustle of tiny legs, they begin\n     to stream toward the Judases.\n\n     Jostle and fight each other for position to mate with them.\n\n     They even crawl over the Team Leader in an effort to reach\n     the Judases.  The Team Leader makes no effort to brush them\n     off.  Patient, almost godlike, she watches the MATING.\n\n<b>     LATER\n</b>\n     A MANHOLE has been opened above. CHAINS are dropped down and\n     attached by a Team Member to A 100-GALLON DISPOSAL DRUM.\n\n     REVEAL the floor of the tunnel, carpeted with the still forms\n     of the roaches, now all DEAD.\n\n     The Team Members quietly shovel the tiny corpses into other\n     disposal drums.\n\n     At their feet skitter the only survivors of the massacre:\n     the bar-coded Judas Roaches.\n\n     In a crunch of machinery, the first disposal drum is lifted\n     by the chains through the manhole to\n\n<b>     EXT. A CITY STREET - DAY\n</b>\n     MIDTOWN MANHATTAN.  A cacophony of SOUND and LIGHT.\n\n     Dirty snow drifts over Bryant Park. Emergency lights blink\n     everywhere. A wall of cars sits on Sixth Avenue, stopped\n     dead. Exhaust fumes hang in the air. Jaded TRAFFIC COPS send\n     the cars on crosstown detours.\n\n     Mounted policemen patrol a line of yellow sawhorses near\n     dozens of Department of Public Health vehicles, angle-parked\n     in a military phalanx.\n\n     A monumental ribcage-like scaffolding has been erected in the\n     middle of the street, \"sealing\" the area with amber plastic.\n\n     Inside, UNIFORMED WORKERS take the disposal drum of roaches\n     and toss it into one of a number of huge DUMPSTERS.\n\n     The Team Leader watches from nearby, exhauster.  Her mask is\n     off. We see her face: Enthomologist SUSAN WYETH, 28.\n\n     An ARM gently drapes over her shoulder.\n\n<b>                          PETER (OS)\n</b>                How we doing?\n\n     She looks over at DR. PETER TYLER, 34, bespectacled.  A\n     HEADSET around his neck, a coat emblazoned with the\n     DEPARTMENT OF HEALTH logo.  He has the look of a man who's\n     just fought a long battle and come out victorious.\n\n<b>                          SUSAN\n</b>                We'll see...\n\n     He offers her a bite of a PAY DAY CANDYBAR.  Susan smiles,\n     shakes her head.  She wearily leans against him.\n\n     Peter looks out as the dumpster filled with roaches is raised\n     by MECHANICAL ARMS into the waiting maw of the dump truck.\n\n<b>     THE SCREEN. DARKNESS.\n</b>\n     A voice, a somber bas-relief in the darkness.\n\n<b>                          ANCHORMAN (VO)\n</b>                Strickler's Disease crept into Manhattan\n                like a thief in the night, claiming its\n                first hundred victims before it was even\n                classified.\n\n<b>     INT. HOSPITAL - NIGHT - FLOATING SHOT\n</b>\n     We FLOAT through a long hospital ward.\n\n     Past ROWS of illuminated oxygen tents, pulsating softly in\n     the dark like cocoons of light.\n\n<b>                          ANCHORMAN (VO)\n</b>                Most were children under ten.\n\n     TRACK past tents.  BODIES OF SMALL CHILDREN inside, wrapped\n     in white sheets, hooked up to IVs or breathing apparatus.\n     Skeletal hands, parched lips, glazed eyes.\n\n     BELLOWS of respirators push in and out, labored, failing.\n\n<b>     IMAGE RESOLVES TO A VIDEO ON A SCREEN.\n</b>\n     PULL BACK to reveal a number of SCREENS, each with a\n     different set of images.  We are in a NEWS VAN.   A\n     TECHNICIAN and DIRECTOR sit watching.\n\n     The voice belongs to an ANCHORMAN who's now overimposed.\n\n<b>                          ANCHORMAN\n</b>                Only after the numbers had reached into\n                the thousands were officials able to\n                identify the carrier of the deadly\n                infection...\n\n<b>                          DIRECTOR\n</b>                Cut to three.\n\n     The Technician manipulates the controls.  On another screen\n     we see them cut to STOCK NEWS FOOTAGE: regular cockroaches,\n     crawling on garbage.\n\n<b>                          ANCHORMAN\n</b>                Blattida Germanica.  The common\n                cockroach.\n\n<b>                          DIRECTOR\n</b>                     (To a RUNNER)\n                Tell them we're ready for a live feed.\n\n<b>     EXT. OUTSIDE VAN - CITY HALL - DUSK\n</b>\n     The runner exits the News Van.  Other such vehicles parked\n     nearby.  A CROWD of ONLOOKERS, REPORTERS and a gaggle of\n     PROTESTERS with handpainted signs.\n\n     Gliding past them, we pick up sound bites...\n\n<b>                          REPORTER 1\n</b>                ...an insect that has proven virtually\n                immune to chemical control...\n\n<b>                          REPORTER 2\n</b>                ...the announcement by the Health\n                Department that an end to the nightmare\n                has finally...\n\n     REPORTER 3 is interviewing a Greenpeace PROTESTER who is\n     holding up a photograph of Susan.\n\n<b>                          REPORTER 3\n</b>                ...an ex-colleague of Doctor Susan\n                Wyeth...\n\n<b>                          PROTESTER\n</b>                ...Susan has always been opposed to\n                biological tampering. A real advocate\n                for ecological causes, it's not...\n\n     MOVE past them to further inside of the perimeter...\n\n<b>     INT. AUDITORIUM - CITY HALL\n</b>\n     A NEWS CONFERENCE in progress.  A packed house.  T.V.\n     monitors spaced ever 10 seats or so. In the audience, the\n     MAYOR OF NEW YORK and various CITY OFFICIALS, listening to\n\n     Peter, speaking at the podium with the ease and enthusiasm of\n     a public servant still untainted by bureaucracy.\n\n<b>     ON A TV MONITOR\n</b>\n     While Peter talks, a news title appears at the bottom of the\n     screen: PETER TYLER. DEPUTY DIRECTOR, DEPARTMENT OF HEALTH.\n\n<b>                          PETER\n</b>                     (wrapping up)\n                ...in Nature, evolution is a long,\n                leisurely conversation between an\n                organism and its environment. We,\n                however, did not have the luxury of\n                time...\n\n     Susan is waiting in the wings. She observes the audience.\n\n     She notices that the entire front row is composed of CHILDREN\n     who have survived Strickler's.  Leg and arm braces, facial\n     scarring...\n\n     He nods at Susan, who takes the podium, adjusting her jacket,\n     slightly ill at ease in her business suit.  She clears her\n     throat, speaks softly.\n\n<b>                          SUSAN\n</b>                With the aid of genetic labs throughout\n                the country, we recombined cockroach DNA\n                with genetic information from termites\n                and mantids. We were able to create a\n                biological counter-agent.  A new ally, if\n                you will...\n\n     She places a clear container on the podium for all to see.\n\n<b>                          SUSAN\n</b>                Blattida Traditor.\n\n<b>     CU CONTAINER\n</b>\n     One of the Judas roaches skitters about in the container.\n\n<b>                          SUSAN (OS)\n</b>                The \"Judas Roach\".\n\n     Cameras FLASH.  MURMURS from the audience.\n\n<b>                          SUSAN\n</b>                The Judas is a non-carrier of Stricklers,\n                with a short life-span and heightened\n                pheromone emission.\n\n     On the back row she can see some ecological hand-painted\n     signs being raised in silent protest. She stumbles for a\n     second, then resumes her speech.\n\n<b>                          SUSAN\n</b>                The female is basically a sexual magnet;\n                common males travelled miles and fought\n                for the right to mate with them.\n\n     The audience is rapt.\n\n<b>                          SUSAN\n</b>                When they did, they took away something\n                else we added -- a hormone, passed\n                through sexual congress that causes their\n                metabolism to go into overdrive.  No\n                matter what their food intake, they\n                starved to death in a matter of hours.\n\n     Now Peter takes the mic.\n\n<b>                          PETER\n</b>                We've achieved almost total eradication\n                of the roach population.  As of today,\n                the disease has been officially\n                contained.\n\n     A STANDING OVATION starts and is carried on as we...\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. TYLER APARTMENT - BATHROOM - SUSAN\n</b>\n     in a tub in a dark bathroom. Her business suit crumpled\n     on the bathroom floor.  SOUND of a TV outside.\n\n<b>                          PETER (OS)\n</b>                Sus, come on.  You're missing it.\n\n<b>     INT. LIVING ROOM\n</b>\n     Nothing grand.  Peter in his shorts at a TV with shitty\n     reception.  He adjusts the disgruntled cable box.\n\n     He is seen over the TV, giving his address.\n\n<b>                          PETER\n</b>                Fucking thing! I hope someone's taping\n                this.\n                     (Out.)\n                Susan, come on.  It's really good this\n                time. I got most of the lines out.\n                     (No response.)\n                Sus?\n\n     Peter sighs. He picks up an open bottle of champagne and\n     two mis-matched ceramic cups, then heads for the bathroom.\n\n<b>     INT. BATHROOM\n</b>\n<b>                          PETER\n</b>                Life's a bitch. Our 15 minutes came\n                and went and all we got was bad\n                cable...\n\n     Susan doesn't answer, clearly not in the same high spirits.\n\n<b>                          PETER\n</b>                Hiding from the hard glare of publicity?\n\n     He notices her crumpled garment on the floor.  He picks it\n     up, puts it up on the hanger.\n\n<b>                          PETER\n</b>                A shame.  You looked great tonight.\n\n<b>                          SUSAN\n</b>                Please.\n\n<b>                          PETER\n</b>                You did!\n\n     He sits by the tub.\n\n<b>                          SUSAN\n</b>                Do you think we did the right thing?\n\n<b>                          PETER\n</b>                Taking a cab instead of hiring a limo?\n\n<b>                          SUSAN\n</b>                You know what I mean...\n\n     Peter pours some champagne into the cups.\n\n<b>                          SUSAN\n</b>                We did no impact evaluation.  The\n                consequences of...\n\n<b>                          PETER\n</b>                     (sighs)\n                Is this a Catholic guilt thing...?\n\n     We hear a NEWSREADER on the TV.\n\n<b>                          NEWSREADER (TV)\n</b>                ...a flawless strategy which has stopped\n                a potential epidemic in its tracks...\n\n<b>                          PETER\n</b>                You hear that?  Flawless.\n\n<b>                          SUSAN\n</b>                We just don't know.\n\n     He offers one cup to Susan.  She doesn't take it.\n\n<b>                          PETER\n</b>                We know we saved lives.\n\n     He sits closer to her.\n\n<b>                          PETER\n</b>                There're gonna be a lot of kids running\n                around next year because of you.\n\n     Beat.  Susan starts to relax. He kisses her.\n\n<b>                          PETER\n</b>                Who know?  We get lucky, maybe a couple\n                of 'em'll be ours.\n\n<b>                          SUSAN\n</b>                     (smiling now)\n                We're down to a \"couple\" now, huh?\n\n     She pats the water, beckoning.\n\n<b>                          PETER\n</b>                Oh, I don't know. People are beginning\n                to talk about us...\n\n     Still partially clothed, he steps into the bathtub. Susan\n     shakes her head, laughs ruefully.\n\n<b>                          SUSAN\n</b>                Don't worry, I'll save your honor.\n                Maybe I'll even marry you.\n\n     She reaches over, kisses him.\n\n<b>                                                          FADE OUT:\n</b>\n<b>                                                        FADE IN TO:\n</b>\n<b>     EXT. ALPHABET CITY - NIGHT\n</b>\n     The WILLIAMSBURG BRIDGE dimly visible through the rain.\n\n<b>     ALPHABET CITY STREETS\n</b>\n     Empty warehouses. Closed businesses. Traffic lights blinking\n     on empty streets. Everything seems doomed under the heavy\n     layer of rain.\n\n<b>     SUPERIMPOSE:  TWO YEARS LATER\n</b>\n     A DILAPIDATED BUILDING before us. A blazing NEON CROSS made\n     of the words 'JESUS SAVES' hangs askew from its facade.\n\n     CRANE to see the ROOFTOP.\n\n     WHAM! The door to the interior stairs FLIES OPEN and a tall,\n     thin CHINESE PREACHER in his sixties lurches out, eyes wild\n     with terror.\n\n     He looks back down the steps.\n\n     Something's climbing up fast, casting ominous, complex\n     shadows on the wall.\n\n     Too many FOOTSTEPS for it to be just one person.\n\n     The man hurriedly shuts the door and slides a bolt home.\n\n     Trembling, he backs away as a booming THUD makes the door\n     shudder. Raw, frenzied pounding and scratching follows...\n     something inhuman, determined to break through.\n\n     The metal surface suddenly buckles and bulges.\n\n     On the man's white undershirt, a blotch of blood starts to\n     grow.  Needles of rain stab his flesh.\n\n     He searches wildly for a possible escape.\n\n     He reaches the edge of the roof: it's five floors down to the\n     sidewalk.\n\n     Two of the hinges on the door come loose, pulverizing the\n     surrounding concrete.\n\n     WHAM!  The door to the stairs bulges outward as something\n     SMASHES against it again and again.  Frenzied SCRATCHING.\n\n     The man sprints to the other end of the roof. There, on the\n     adjoining building...\n\n<b>     THE CHINESE PREACHER'S POV\n</b>\n     Just one floor below on the building across the alley is a\n     suspended PAINTERS' PLATFORM, crowded with paint cans under a\n     tarp.  A two-story old EYEWEAR ADVERTISEMENT from the 40's is\n     being painted over.\n\n<b>     THE CHINESE PREACHER\n</b>\n     Looks back to the door.  BAM! a tremendous SHATTERING sound.\n     LIGHT spills from inside. Two bolts fly in the air, a hinge\n     gives.\n\n     He CRIES OUT in terror.\n\n     The man gauges the distance between buildings; can he make\n     it?\n\n     He takes a few steps back, a few more...\n\n     Panting hard, he closes his eyes, his chest soaked in blood\n     and rain.\n\n<b>     THE DOOR EXPLODES OUTWARD AND SKIDS ACROSS THE SLIPPERY ROOF.\n</b>\n     Light from inside projects the shadow of wild, busy things\n     onto the curtain of rain.\n\n     Weeping with fear, the man desperately tries to hurl himself\n     to the catwalk.\n\n     It's too far.\n\n     He FALLS...CRASH!  he hits the platform, knocking boards\n     loose and sending paint cans onto their sides, rolling.  He\n     bounces, slides off the edge, barely able to grab onto a\n     loose board to save himself from falling.\n\n     The RAIN blasts down.  The scaffold CREAKS.  He hits the\n     edge, upsetting the cans of paint there.\n\n     He holds onto the planks with all his might, trying to push\n     with his feet, but they slide on the wet wall.\n\n<b>     BELOW\n</b>\n     Cans bounce off the pavement. White pain blasts all over.\n\n<b>     CU HANDS\n</b>\n     The man's hands slip on the planks, tiring.\n\n<b>     FEET\n</b>\n     The Chinese Preacher's FEET bicycle in the air, unable to\n     find a purchase on the wet brick wall-\n\n<b>     THE CHINESE PREACHER\n</b>\n     is hanging just in front of the painted EYE of the forties'\n     model.  He looks up above him, sees something-\n\n<b>                          CHINESE PREACHER\n</b>                No.  Please, God, no!\n\n     A SHADOW crosses his face as something looms above him.\n     Suddenly there is a CRACK and the platform tilts completely\n     on one end.\n\n<b>     HANDS\n</b>\n     The Chinese Preacher's fingernails dig in, then slip on the\n     wet wood.\n\n     His hands paw the air.\n\n<b>     WIDER\n</b>\n     For a moment his body, silhouetted in the rain, seems\n     suspended in a void. Then he falls backwards.\n\n<b>     THE GROUND\n</b>\n     Impact. His body cracks the pavement.\n\n     Small pools of rain form on his dead, open eyes.\n\n     We CRANE to reveal\n\n<b>     A WINDOW ON A BUILDING ACROSS THE STREET\n</b>\n     CHUY, a young Latino boy. He stares out the window at the\n     Chinese Preacher's body with no discernable emotion.\n\n     He works a small WIRE SCULPTURE in his hands.\n\n<b>     APARTMENT\n</b>\n     It's a small one-bedroom apartment.\n\n     An old man sleeps peacefully on a cot: Chuy's grandfather.\n     MANNY GAVIOLA, mid 60's, white hair haloes his handsome,\n     benign face.\n\n     All around him: SHOES, shoes everywhere you look, on the\n     table, on the chairs, on the kitchen counter, on the floor.\n\n     A small altar is illuminated by votive candles. Next to it,\n     standing by the window is\n\n<b>     CHUY\n</b>\n<b>     HIS P.O.V.\n</b>\n     We see a blurry vision of The Chinese Preacher's splayed\n     figure in a swirl of color.\n\n     Chuy's attention focuses on the Preacher's shoes.\n\n<b>     CHUY\n</b>\n<b>                          CHUY\n</b>                     (a whisper)\n                Oxfords, 8 1/2. Black...\n\n     He looks away from the body and goes back to twisting the\n     wire into shape.\n\n<b>     THE PUDDLE OF PAINT\n</b>\n     around the preacher, reflects large shadows moving above,\n     and across the neon sign...\n\n<b>     CHUY\n</b>\n     hears a strange sound, a rhythmic clicking.\n\n     His head lifts and what he sees causes his expression to\n     change--there is an uncharacteristic flicker of excitement in\n     his eyes.\n\n<b>     ACROSS THE ROOFTOP\n</b>\n     We are behind whatever it is that has captured Chuy's\n     attention.\n\n<b>     TICKETY-TACKETY-TOCK...\n</b>\n     The strange clicking sound grows louder.  The figure begins\n     moving in some weird, preparatory fashion. Then it steps\n     forward and drops out of frame.\n\n<b>     CHUY\n</b>\n     His eyes follow the figure down to the pavement in a slow\n     arc.\n\n     Chuy puts down the wire miniature and opens the window to get\n     a better view.\n\n<b>     GROUND LEVEL\n</b>\n     The Chinese Preacher's body is now being dragged toward the\n     rear of the alley, leaving colored paint smears in its wake.\n\n<b>     CHUY\n</b>\n     We isolate the boy's face and, on the soundtrack, every other\n     noise FADES AWAY.\n\n     Chuy reaches for a pair of SPOONS nearby.\n\n     He begins to click them together.\n\n     Imitating the strange clicking sound heard a moment ago.\n\n<b>     THE CHINESE PREACHER\n</b>\n     is being pulled into a small, ground-level vent. The only\n     problem is that no human is small enough to squeeze through\n     this hole.\n\n<b>     CHUY\n</b>\n     watches, still clicking with his spoons.\n\n<b>     THE CHINESE PREACHER'S BODY\n</b>\n     is stuck. One of his legs is through the hole up to the\n     thigh, but the other is folded up unnaturally and pressing\n     against the wall next to the vent. Impossible.\n\n     There is a silent beat, and then a series of INCREDIBLY\n     VIOLENT TUGS, BAM! BAM! BAM! shaking the Paint-soaked body\n     like a rag doll.\n\n<b>     CHUY\n</b>\n     His spoons stop. His jaw tightens a little as we hear\n     terrible cracking and scraping sounds.\n\n<b>     THE WINDOW\n</b>\n     The Chinese Preacher's head and hands disappear into the\n     hole. Bits of clothing, paint and blood stick to the edges of\n     the opening.\n\n<b>     CHUY\n</b>\n     watches, still fascinated.\n\n<b>                          CHUY\n</b>                     (very low)\n                Funny, funny shoes...\n\n     He starts a new wire sculpture.\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. JOGGING PATH - CENTRAL PARK - DAWN\n</b>\n     Peter is covered in sweat, running at a good clip around the\n     Central Park reservoir. A beautiful day dawns behind him; the\n     windows of the Beresford sparkle in the morning sun.\n\n     Peter outperforms most of the other RUNNERS in the track, his\n     steady rhythm evidence of years of practice. Keeping his\n     stride, he runs off the track and past a flock of OLD NUNS.\n\n<b>                          PETER\n</b>                Excuse me, ladies...\n\n     Without slowing down, Peter retakes the path and moves past\n     them.\n\n<b>     EXT. JOGGER'S PATH - NEAR FIFTH AVENUE - LATER\n</b>\n     Peter finally slows down. He checks his pulse and stops at a\n     water fountain.\n\n     As he drinks, he sees a DERELICT drawing a figure on the\n     sidewalk.\n\n     The derelict spots Peter.  He picks up his chalk, drifts off.\n\n     Intrigued, Peter goes closer to the drawing. An arrow points\n     to a manhole cover set among the bushes.\n\n     Peter circles around, trying to make sense out of the lines.\n\n     Then the painted motif finally reveals itself.\n\n<b>     GRAFFITI\n</b>\n     A talismanic figure of raw, archetypal power. A few jagged\n     lines form the shape of a MAN IN AN OVERCOAT. His face is\n     little more than a malignant blotch.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. MUSEUM - EXHIBIT ROOM - DAY\n</b>\n     A room of half-finished exhibits. A group of SCULPTORS --\n     most of them undergraduates -- work on a gigantic piece\n     representing a termite mound.  They're supervised by SIRI, a\n     punkish young Indian research assistant.\n\n     Susan talks to some of the sculptors about a 100-1 scale\n     clay model of an insect's head.  She gestures to the\n     model's mandible set.\n\n<b>                          SUSAN\n</b>                ...no, guys, these have to fit\n                perfectly.  No spaces in between. Let\n                me tell you why. Insects have no\n                hands. All they have is this set of\n                mandibles.\n\n     She grabs the outer mandible set.\n\n<b>                          SUSAN\n</b>                See?  This little piggy will grab the\n                prey.\n\n     Then unfolds a second set...\n\n<b>                          SUSAN\n</b>                Then this little piggy will tear it\n                in half...\n\n     And a third!!!\n\n<b>                          SUSAN\n</b>                ...and this little one will grind it\n                to a pulp and push it in... all the\n                way into the mouth.  These are\n                precision tools here. Can you\n                remember that?\n\n     The guys nod.\n\n<b>                          SUSAN\n</b>                Good.  Then get it right.\n\n     A piece of the termite mound is raised above their heads,\n     revealing...\n\n     ...Peter, at the entrance, still dressed in his jogging\n     sweats. He smiles at Susan.\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXHIBITS\n</b>\n     Peter and Susan walk through.  Peter pulls something from a\n     KNAPSACK.  A bottle of medicine marked: METALLININ.\n\n<b>                          PETER\n</b>                     (teasing)\n                \"Baby in a bottle...\"\n\n     He gives it to Susan.\n\n<b>                          SUSAN\n</b>                Don't tease.\n\n     Around them, WORKMEN begin unloading crates of display stuff,\n     as a MAN on a ladder tacks up an \"ARCHITECTS OF NATURE\"\n     banner. Susan proceeds behind an exhibit representing a\n     honeycomb.  Peter follows as she begins to arrange some tools.\n\n<b>                          PETER\n</b>                You know where they get this\n                fertility stuff?  They extract it\n                from the urine of menopausal Italian\n                nuns.\n\n<b>                          SUSAN\n</b>                     (laughs)\n                Monks bottle their own wine. Don't\n                they?\n\n     She gently touches her belly.\n\n<b>                          SUSAN\n</b>                Trust me. I've never been this late.\n                Never.\n\n     She shakes the bottle.\n\n<b>                          SUSAN\n</b>                If nun's pee is what it takes...\n\n     Peter's cellular RINGS from his knapsack. Susan grabs a\n     larvae model from a pile on the floor.\n\n<b>                          SUSAN\n</b>                You were the one who ran around with\n                ice in his underwear, don't forget\n                that.\n\n<b>                          PETER\n</b>                Don't get kinky here...\n\n     Peter takes the call. Susan cuts away the excess plastic on\n     the lid around the honeycomb moldings. The larvae fits\n     perfectly inside.\n\n<b>                          PETER\n</b>                Okay, meet me out front.\n                     (to Susan)\n                I gotta go. Josh's picking me up in five.\n                see you tonight.\n\n<b>                          SUSAN\n</b>                I'll be late.\n\n     He kisses her and leaves. Susan turns to Siri and the group\n     working on that sculpture.\n\n<b>                          SUSAN\n</b>                Siri, sandblast that thing. It looks\n                like Trump Tower.  Those mounds are\n                supposed to be made of dirt and\n                excretions...\n\n<b>                          SIRI\n</b>                     (a wicked smile)\n                Just like Trump Tower, then.\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. STREET\n</b>\n     A Department of Health VAN honks its way through a traffic\n     jam.\n\n<b>     INT. VAN\n</b>\n     Peter's right hand man, JOSH MASLOW -- a young, good-natured,\n     can-do guy -- drives.\n\n<b>                          JOSH\n</b>                ...So I say \"buddy, you have every\n                violation in the book.  Gimme one\n                good reason not to close you down.\"\n                You know what the Kraut says to me?\n\n     In the back, Peter finishes changing out of his jogging\n     sweats and into his worksuit.\n\n<b>                          JOSH\n</b>                The blintzes!  \"Try the blintzes...\"\n\n<b>                          PETER\n</b>                     (distractedly)\n                Selling your sould for a fistful of\n                carbohydrates...\n\n<b>                          JOSH\n</b>                Not just any carbohydrates, mind you.\n                It was like being on the receiving\n                end of some kind of transcendent oral\n                sex.\n                     (honks furiously)\n                We should get a strobe on this thing.\n                Maybe even a siren.\n\n<b>                          PETER\n</b>                Yeah, and a loudspeaker so you can\n                yell \"Epidemic! Epidemic! You're all\n                going to die!\"\n\n<b>     EXT. FLOPHOUSE - DAY\n</b>\n     The Department of Health van pulls up outside the flophouse\n     where the Chinese Preacher died. Peter and Josh get out.\n\n     COPS push back a few ONLOOKERS. Josh proudly flashes his DOH\n     badge.\n\n<b>                          JOSH\n</b>                Health Department...\n\n     The cops let them pass.\n\n<b>                          PETER\n</b>                You really love flashing that thing,\n                don't you?\n\n<b>                          JOSH\n</b>                Hey. I'm a short guy. Waddaya want?\n\n     Two cops -- WOYCHEK and RICE -- approach, in no real hurry.\n\n<b>                          PETER\n</b>                Peter Tyler, DOH. You gentlemen were\n                the first on the scene?\n\n<b>                          WOYCHEK\n</b>                     (gestures to Rice)\n                We were both on patrol, saw this paint\n                mess. Then I looked through that cellar\n                window. We both did...\n\n<b>                          PETER\n</b>                You gone in?\n\n<b>                          WOYCHEK\n</b>                No. We waited.\n\n<b>                          PETER\n</b>                Good.\n\n     Peter peeks through a narrow cellar window on the floor.\n\n     Through the oily, smeared window, a ghostly array of PALE\n     FACE AND HANDS appears, startling him.\n\n<b>                          PETER\n</b>                     (to Josh)\n                Get the EMT's in there, now.\n\n<b>                                                            CUT TO:\n</b>\n<b>     LATER\n</b>\n     PARAMEDIC AMBULANCES rush in. Sirens at full blast.\n\n     Stepping out of the building across, Manny walks next to\n     Chuy, who holds his hand. The old man carries a box full of\n     shoes.\n\n     Chuy looks back at the cop circus, amused.\n\n<b>                          MANNY\n</b>                C'mon Chuy, we're gonna be late.\n                     (discreetly crossing himself)\n                Cops are bad news. Don't look at them.\n\n     He gently pulls his grandson's hand and moves briskly away.\n\n<b>     JOSH\n</b>\n     uses an iron bar, and breaks a padlocked cellar door. A heavy\n     stench emanates from inside. The cops cover their noses.\n\n<b>     INT. CELLAR\n</b>\n     Peter and Josh enter a dingy, dungeon-like cellar,\n     illuminated only by bug zappers and emergency lights. Every\n     door and window has been nailed shut or sports a heavy-duty\n     padlock. Peter and Josh walk through the dismal scene.\n\n     In sharp contrast with the dirt-smeared walls, we see shiny\n     metallic SEWING MACHINES and swatches of cloth appliqued with\n     a FUNNY BUNNY cartoon character.\n\n     Josh examines the label stitched into the collar. It reads:\n<b>     PROUDLY MADE IN USA.\n</b>\n<b>                          PETER\n</b>                Jesus.\n\n     His light hits a group of quivering, skeletal CHINESE\n     IMMIGRANTS, standing in a tight group against a wall.\n\n<b>                          WOYCHEK\n</b>                     (from the outside)\n                They look real sick, don't they?\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. STAIRWELL, MUSEUM - DUSK\n</b>\n     Carrying boxes full of terrarium material, Susan and Siri\n     ride an antiquated cage-steel elevator.  No floor buttons,\n     just an old-fashioned hand-activated lever.\n\n<b>                          SUSAN\n</b>                ...as long as they're ready for the\n                opening I don't care, just tell them\n                that.\n\n<b>                          SIRI\n</b>                I'm on it.  Don't worry.\n                     (Beat)\n                Look, Susan...I don't mean to pry,\n                but... I kinda overheard you and\n                Peter.\n\n<b>                          SUSAN\n</b>                     (Smiles ironically)\n                Watch your step, Siri.  Your grant\n                could be on the line here.\n\n<b>                          SIRI\n</b>                I just...well, I had this cousin in\n                Delhi.  She was having problems, too.\n                She, ah...\n\n<b>                          SUSAN\n</b>                What?\n\n<b>                          SIRI\n</b>                She used a baster.\n\n     Susan looks at her.\n\n<b>                          SIRI\n</b>                Not a big one.  I mean, it was like a\n                turkey baster.\n\n<b>                          SUSAN\n</b>                Oh, Jesus.\n\n     She tries to stop the elevator at the fourth floor, but\n     it rises just a little too far.\n\n<b>                          SUSAN\n</b>                Come on, darlin'...\n\n     Susan has to jimmy the lever till the elevator falls\n     level to the floor.\n\n<b>                          SIRI\n</b>                     (continues)\n                She kept it under her bed. Thing is,\n                it kinda worked.  I mean, she had to\n                hide it from her husband, but...\n\n     A pair of young boys, RICKY and DAVIS, sit on the floor\n     outside Susan's lab door.  A crumpled paper bag and a shoe\n     box sit beside them.\n\n<b>                          SUSAN\n</b>                What's this?\n\n<b>                          SIRI\n</b>                Oh, right... They been here since noon.\n                I told them you're real busy.\n\n     Susan smiles at the boys, who stand when they see her.\n\n<b>                          SUSAN\n</b>                Hello.\n\n<b>                          RICKY\n</b>                You the bug lady, right?\n\n     Siri chuckles.\n\n<b>                          SUSAN\n</b>                     (smiles)\n                I suppose so.\n\n     Ricky raises and shakes the paper bag.\n\n<b>                          RICKY\n</b>                We're here to deal.\n\n<b>     INT. MOUNTING ROOM - DUSK\n</b>\n     SUNLIGHT slants in to illuminate an incredible array of live\n     and mounted dead INSECTS, trapped in turn-of-the-century\n     glass fronted cabinets. Davis puts his nose up against one,\n     fascinated.\n\n<b>                          SUSAN\n</b>                Metaxonycha Godmani, Trigonopelastes\n                Delta.  Field Butterflies.  Have you been\n                upstate?\n\n     She examines the boys' findings, mostly rag-tag specimens\n     of battered butterflies.\n\n<b>                          DAVIS\n</b>                Avenue B.\n\n<b>                          SUSAN\n</b>                     (sadly)\n                I guess they got lost in this city.\n\n<b>                          RICKY\n</b>                So, you wanna buy em?\n\n<b>                          DAVIS\n</b>                There's extra wings in the bag.\n\n     Siri lingers in the background.\n\n<b>                          SUSAN\n</b>                You guys have done a nice job.  How bout\n                five dollars?\n\n<b>                          RICKY\n</b>                     (dismayed)\n                That's it?\n\n<b>                          DAVIS\n</b>                     (to Ricky)\n                Show her the weirdbug.\n\n     He indicates the shoebox-\n\n<b>                          RICKY\n</b>                Cost a dollar just to look.\n\n<b>                          DAVIS\n</b>                It's a great bug.  We kinda broke it a\n                little...\n\n     Siri impatiently points at the wall clock-\n\n<b>                          SUSAN\n</b>                Fellas, I'll tell you what...ten dollars\n                for everything.  Plus a killing jar, some\n                tweezers and mounts so the next bunch you\n                catch will be in better shape.\n\n<b>                          DAVIS\n</b>                Deal!\n\n<b>                          RICKY\n</b>                You crazy! That's the best!!\n\n<b>                          DAVIS\n</b>                Bug's almost dead anyway.\n\n     Susan holds out two five dollar bills.  The boys can't\n     resist.  Davis grabs the money-\n\n<b>                          DAVIS\n</b>                Thanks, lady.\n\n     Ricky gives a last possessive look to the shoe box, then\n     follows Davis out.\n\n     Siri crosses to the window and wrestles to close it.\n\n<b>                          SIRI\n</b>                Ten dollars?\n\n     Susan places all the kid's items -including the shoebox- in\n     a wastebasket.\n\n<b>                          SUSAN\n</b>                Alphabet City kids- there's much worse\n                things they could be selling.\n\n     Siri hits the window frame with a paperweight, gets it half\n     way down.\n\n<b>                          SIRI\n</b>                I hate this fucking window...\n\n<b>     EXT. ACROSS STREET FROM MUSEUM - NIGHTFALL\n</b>\n     CRANE TO a nearby alley.\n\n     A GAUNT MAN IN AN OVERCOAT stands in the shadows, looking up\n     at Siri working on the window.\n\n     As a streetlamp lights up, he backs up into the shadows.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. FLOPHOUSE. LOBBY - NIGHTFALL\n</b>\n     Religious slogans and posters are hung everywhere in what\n     used to be the lobby of a men's hotel.  A hand-lettered sign:\n<b>     \"NO LIQUOR, NO DRUGS, NO PROFANITY\"\n</b>\n     PARAMEDICS are leading a number of ill CHINESE IMMIGRANTS up\n     from the cellar door seen earlier.  Many are brought out on\n     STRETCHERS. DOH staff put tags on their wrists.\n\n     Peter examines a PALE OLD MAN on a stretcher while\n     simultaneously talking to Josh.\n\n<b>                          PETER\n</b>                     (to Josh)\n                There's plenty of systemic infection\n                already, so as soon as we get a\n                preliminary reading, start them on\n                anti-biotics. You saw this?\n\n     Peter flicks on his penlight, examines the Old Man's eyes.\n     One of them is completely bloodshot. Then he shows Josh\n     the gums. They're bleeding.\n\n<b>                          PETER\n</b>                Internal hemorrage. 2 our of 5 have\n                it.  No definite signs of TB, but we'll\n                quarantine them a week just to make sure.\n\n<b>                          JOSH\n</b>                Immigration's gonna love you for that.\n\n<b>                          PETER\n</b>                Tell them to send flowers to the\n                usual address.\n\n<b>     INT. SWEAT SHOP. BASEMENT\n</b>\n     Peter pushes back a sheet hung across a doorway.\n\n<b>     BASEMENT SHOWERS\n</b>\n     A tiled nightmare. Concentration camp-cozy. A pile of old,\n     rusting sewing machines clutter the floor, spilling\n     oxide to a central grate.\n\n<b>                          JOSH\n</b>                Two shifts, people rotating from bed to\n                work.  One toilet. We're in Wal-Mart\n                hell, here.\n\n     Josh swats a fly.\n\n<b>                          PETER\n</b>                Did they get the sleazebag who owns this\n                place?\n\n<b>                          JOSH\n</b>                Triad, Chinese Mafia. They bring people\n                from Yunan. Slave labor...\n                     (eyes his notebook)\n                Reverend Harry Wong, a preacher had the\n                flophouse fronting for them. No sign of\n                him.\n\n     An overhead door is opened. Daylight streams in. Peter spots\n     YANG, an Asian cop, talking to a CHINESE WOMAN lying on a\n     stretcher which hasn't been moved yet.  She is hollow-eyed,\n     near death.  Her hand weakly hangs on to the cop as if for\n     dear life.\n\n<b>                          PETER\n</b>                Tell her she's going to be alright.\n                We'll take care of her.\n\n     Peter kneels next to her, looking at her and nodding while\n     Yang translates. The woman mutters again, tears of fear in\n     her eyes.  Yang shakes his head.\n\n<b>                          YANG\n</b>                She's delirious.  Keeps saying the \"Dark\n                Angels\" are coming for her. She says\n                they took some of her people away.\n\n<b>                          PETER\n</b>                Dark Angels?\n\n<b>                          YANG\n</b>                     (Shrugs.)\n                Probably a gang.  Chinese people, man.\n                They come up with some wacky stuff.\n\n     They pull the stretcher out through the open overhead door\n     and into an\n\n<b>     ALLEY\n</b>\n     The stretcher is rolled into a waiting vehicle, its lights\n     flashing. Unseen by them, on a brick wall, nearly buried by\n     graffiti, is a crude DRAWING.\n\n     It is of the same, odd figure Peter saw drawn earlier.  The\n<b>     OVERCOAT MAN.\n</b>\n<b>     INT. LAB - NIGHT - MONTAGE\n</b>\n     Susan and Siri, both wearing Walkman headsets, deftly mount\n     BUTTERFLIES and other INSECTS onto display boards for the\n     exhibit. Rain is blowing in through the half-open window.\n\n     Their movements are precise and lyrical, the colors and\n     designs of the insects are beautiful.\n\n     We understand how you can get lost in this world.  Susan\n     works steadily, a partially-eaten PAY-DAY BAR and the\n     wrappers of several others are evidence of her dinner.\n\n     A PAGER goes off in Susan's lab coat.\n\n     She takes off her headset; CLASSICAL MUSIC leaks from her\n     headphones.\n\n     On the PAGER's LCD screen the message reads: LATE\n<b>     TONIGHT. PETE.\n</b>\n     Susan puts the pager down. Goes to close the window.\n\n     There is a loud, angry BUZZING sound.\n\n<b>                          SUSAN\n</b>                Siri?\n                     (louder)\n                Siri?!\n\n     Siri pulls her headset off; HEAVY METAL MUSIC leaks from her\n     headphones.\n\n     The BUZZING sound again. We PAN across the various bugs and\n     mounting implements till we come to rest...\n\n     ...on the SHOEBOX the boys gave Susan. Something rattles\n     wildly inside.\n\n<b>                          SIRI\n</b>                ...the fuck?\n\n     Susan crosses to the trash bin, picks the box out. It\n     vibrates on her hand, then becomes quiet, something moves\n     inside.\n\n     She slowly opens the lid.\n\n     The bottom of the box is littered with two inches of shredded\n     newspaper. Crumbs of bread and some rice-krispies can be\n     spotted here and there: a kid's idea of a comfy critter's\n     nest. She moves her free hand closer.\n\n<b>                          SUSAN\n</b>                     (To Siri)\n                Can you...?\n\n     Suddenly and INSECT big as her hand springs out of the\n     shredded paper nest and tries to grab on to her! Minute\n     pieces of paper fly through the air!!\n\n     Susan slaps the lid back down.\n\n<b>                          SUSAN\n</b>                     (a scared whisper)\n                Could you...help me...?\n\n<b>                                                            CUT TO:\n</b>\n<b>     LATER\n</b>\n     Siri comes over as Susan grabs steel tongs and a cork\n     dissecting board.\n\n<b>                          SUSAN\n</b>                I'm gonna pull it out and I want you to\n                pin it down, okay?\n\n<b>                          SIRI\n</b>                What is it?\n\n<b>                          SUSAN\n</b>                I have no idea.  Are you ready?\n\n     Siri nods, pins in hand.  Susan opens the lid and grabs the\n     nymph with the tongs.  The creature goes berserk, flailing\n     its spindly limbs, BUZZING and CROAKING, a milky substance\n     FOAMING out of its body.\n\n<b>                          SIRI\n</b>                Oh my God...\n\n     Susan deposits the insect onto the corkboard.\n\n     Siri tries to get a hold of it; but it twists out of the\n     tongs and wraps its coarse legs around her hand!! A spider\n     trapping a sparrow.\n\n<b>                          SIRI\n</b>                Shit!! Get it!  Get it!\n\n     SNAP!  It bites her hand between index and forefinger.\n\n     Susan pins the insect into the corkboard. It spins furiously,\n     like a crazy LP record.\n\n     Susan gets a grip on it again with the tongs.  Siri uses more\n     pins to secure it down.\n\n<b>                          SUSAN\n</b>                     (Noticing Siri's hand)\n                It bit you.\n\n<b>                          SIRI\n</b>                No shit.\n\n<b>     SUSAN\n</b>\n     leans to get a closer look at the NYMPH: Deep dark brown,\n     flat as a pancake, one rear leg broken, lower tail smashed.\n\n     It squirms helplessly now, looking pitiful under the harsh\n     overhead light.\n\n<b>                          SUSAN\n</b>                This wing configuration. I've\n                never...\n\n<b>                          SIRI\n</b>                     (looking at her injury)\n                Fuck! It broke the skin...\n\n<b>                          SUSAN\n</b>                And they're not fully developed.  This\n                thing's not even an adult.\n\n     The nymph continues to HISS and FOAM, struggling against the\n     steel pins. Susan looks closely at the insect's belly.\n\n<b>                          SUSAN\n</b>                My God.\n\n<b>                          SIRI\n</b>                What?\n\n     Susan gestures to look.  Siri stares down at\n\n<b>     THE NYMPH'S TORSO\n</b>\n     where a SET OF VALVES on its underside click in and out.\n\n<b>                          SUSAN (OS)\n</b>                It's breathing.\n\n<b>     SIRI\n</b>\n     shakes her head.\n\n<b>                          SIRI\n</b>                That's impossible.  Insects don't...\n\n<b>                          SUSAN\n</b>                I know.\n                     (Picks up a SCALPEL)\n                Help me get a sample.\n\n     Susan touches her scalpel to the nymph's leg.\n\n     The nymph CLICKS nervously.\n\n<b>                          SUSAN\n</b>                Hold on, big guy, hold on...\n\n     She traps the nymph down and CUTS THE LEG OFF.\n\n     A painful, agonized BUZZ echoes around the room.\n\n<b>                                                            CUT TO:\n</b>\n<b>     MONITOR\n</b>\n     Susan attaches the insect's leg to a samll holder. It is\n     frozen in a swirl of dry ice.\n\n     The brittle leg is then mounted in a LASER MICROTOME. Bit by\n     bit, the machine executes MICROSCOPIC WAFER CUTS. Siri is\n     making slides out of each section.\n\n     A series of MICROPHOTOGRAPHIC IMAGES flash onto the screen.\n     In the background we hear the high-pitched BUZZ-\n\n     We see the lights from the mounting room through a glass\n     brick wall.\n\n<b>     INT. MOUNTING ROOM - NIGHT\n</b>\n     We see the nymph slowly squirming in the FG, then RACK FOCUS\n     to the rain-spattered WINDOW.\n\n     Suddenly the OVERCOAT MAN is standing on the windowsill!\n\n     The window is lifted effortlesly from the outside.\n\n<b>     SUSAN\n</b>\n     prepares a blue solution and places two drops on each smear\n     slide.\n\n     Reflected in the glass brick behind her we see the man moving\n     across the room.\n\n<b>     THE OVERCOAT MAN\n</b>\n     seen only through rippled glass and reflections, moves\n     through the lab.\n\n     His body STEAMS lightly from the rain. His movements are\n     quirky, spastic.\n\n     The man observes the imprisoned insects with curiosity.\n\n     He comes to the nymph, pinned and mutilated on the worktable.\n     The nymph CLICKS and CHITTERS excitedly, as if communicating\n     with the man.\n\n     He looks up at the worklight.  It seems to bother him.\n\n     WHUMP!!! In a blur of motion, he SMASHES the light bulb.\n\n<b>     SUSAN\n</b>\n     watches the smear slide.  The blue droplets begin to CHANGE\n     COLOR once in contact with the leg section...\n\n<b>                          SUSAN\n</b>                Hold on a second...\n\n     ...slowly turning a deep green.\n\n<b>                          SIRI\n</b>                What?\n\n     Then, THREE LARGE BEETLES fly into the room.\n\n     Siri looks at Susan. Susan gets up, hesitant, signals for\n     Siri to stay.\n\n     We FOLLOW Susan into the mounting room.\n\n<b>     SUSAN'S POV\n</b>\n     She walks in, barely able to see her hand in front of her\n     face.\n\n     The window facing the street is wide open, rain blowing in.\n\n     Something CRUNCHES under her feet.  She bends down, looks.\n\n     She's stepped on the broken glass of the lightbulb.\n\n     The floor is alive with various INSECTS -- crawling, hopping,\n     flying away from their displays, which have been opened.\n\n     The nymph is gone from the board!\n\n     She looks under the work table the nymph was on.\n\n     We LOWER as we TRACK BACK with her.  Something is folded up\n     in the corner of the ceiling behind her, camouflaged in the\n     shadows, clinging impossibly to the wall.\n\n<b>     THE OVERCOAT MAN.\n</b>\n     He lowers himself with silent grace.\n\n     Susan whirls.\n\n<b>     WHOOSH! A GUST OF WIND! A FLUTTERING SHADOW OFF THE WINDOW!\n</b>\n     Silence.\n\n<b>                          SIRI (O.S.)\n</b>                Susan?\n\n     Susan GASPS, startled.  We SHIFT to see Siri at the door.\n\n<b>                          SUSAN\n</b>                Call security.\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. FLOPHOUSE - NIGHT\n</b>\n     The last DOH van takes off under the heavy rain.\n\n     Across the street, Chuy looks down from his apartment window.\n\n<b>     INT. MANNY'S APARTMENT - SAME\n</b>\n     Chuy sits at the window, twisting wire into a human-like\n     figure.  MOVING past him, we see a group of other WIRE\n     FIGURES on the table, backs of chairs, lamps, everywhere.\n\n     Manny sits at the kitchen table. He IGNITES a can of shoe\n     polish with a match, then lights a cigarette off the flame.\n\n     He puts the cigarette in his mouth and proceeds to polish a\n     pair of shoes. A SILLY SHOW plays over the TV.\n\n<b>                          MANNY\n</b>                Not too little, not too much. You rub it\n                in, around and around like this. Let the\n                leather take it.\n\n     Manny leans tiredly against the table. He looks fatigued\n     and in pain. He takes a small pill and places it under\n     his tongue.\n\n<b>                          MANNY\n</b>                You watching? You should learn to\n                work the shoes. You're good with your\n                hands...\n\n     Manny shoots a glance over to his grandson.\n\n<b>                          MANNY\n</b>                Chuy...you gonna get all wet.\n\n     Chuy doesn't pay attention, just stares out at the street.\n\n<b>                          MANNY\n</b>                Did you look at the story book I got you?\n\n     Manny lifts a brightly colored CHILDREN'S BOOK.\n\n<b>                          MANNY\n</b>                Our Animal Friends.  Can you say that,\n                Chico?  \"Friends\"?\n\n     Nothing from Chuy.\n\n<b>     CHUY'S POV - STREET\n</b>\n     The building across the street. Yellow DOH tape at the\n     entrance.\n\n<b>                          MANNY (OS)\n</b>                A friend is the one you can trust.  When\n                you are with a friend, no matter where in\n                the world, you are at home.\n\n     A FIGURE moves out of the shadows and totters in the rain\n     toward the entrance.  It is the OVERCOAT MAN, barely visible\n     in the rain.\n\n<b>                          MANNY\n</b>                In this city. A friend is a hard thing to\n                find...\n\n<b>     CHUY\n</b>\n     His face shows a bit of animation.\n\n<b>                          CHUY\n</b>                Funny Shoes...\n\n     Manny looks up from the book.\n\n<b>                          CHUY\n</b>                Alli.  Mr. Funny Shoes.\n\n     Manny comes over, looks out.\n\n<b>     THEIR POV\n</b>\n     The figure has disappeared into the dark front of the\n     boarded-up building.\n\n<b>     MANNY AND CHUY\n</b>\n<b>                          MANNY\n</b>                No one is there. Is empty.\n\n     Chuy doesn't respond.  Manny turns the boy's face to his.\n\n<b>                          MANNY\n</b>                Chuy, listen to me.  They have Jesus on\n                the cross, but that is not a holy place.\n                You understand?\n\n     Chuy looks at him blankly.  Manny sighs; he knows he doesn't.\n\n<b>                          MANNY\n</b>                Ah, Nino.  God only knows what goes on in\n                your head, eh?\n\n     He pats the boy on the head, then goes back to work. Chuy\n     turns back to stare at the street.\n\n<b>                          CHUY\n</b>                Mr. Funny Shoes...\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. OUTSIDE TYLER APARTMENT BUILDING - NIGHT\n</b>\n     The D.O.H. Van pulls up in front of a modest Pre-war\n     building. Josh and Peter climb out.\n\n     Peter is reviewing a roster.\n\n<b>                          PETER\n</b>                Josh, what was Immigration's\n                countdown?\n\n     Josh hands Peter a plastic bag with his sweat clothes\n     and running shoes.\n\n<b>                          JOSH\n</b>                Thirty-three workers.\n\n     Peter hands him the roster.\n\n<b>                          PETER\n</b>                There are thirty five listed in the\n                reverend Wong's roster...\n\n<b>                          JOSH\n</b>                Shit.\n\n     Peter walks up the front steps.\n\n<b>                          PETER\n</b>                Remember what that woman said, about\n                people being taken? Check with the\n                copsin the area.\n\n<b>     INT. TYLER APARTMENT - NIGHT\n</b>\n     Peter enters the apartment, which has long since been\n     remodeled with a nicer couch and a bigger TV with slightly\n     better reception.\n\n<b>                          PETER\n</b>                Sus?\n\n     No answer.  He notices the dining room table is filled with\n     yellowed FILES, all marked JUDAS TRADITOR.\n\n<b>                          PETER\n</b>                     (Looks around once again)\n                Susan?\n\n<b>     INT. LAUNDRY ROOM\n</b>\n     Peter comes in to find Susan sitting in a chair before a\n     dryer, quietly watching laundry whirl within.\n\n<b>                          PETER\n</b>                     (Regarding the laundry.)\n                Thought it was my week for that.\n\n<b>                          SUSAN\n</b>                     (Shrugs.)\n                I needed to think. It was either this\n                or the weather channel.\n\n     Peter walks over, kisses her.  He notices an open book of\n     INSECT MORPHOLOGY on her lap. There's a FULL COLOR\n     PHOTOGRAPH of an OOTHECA -- an insect eggcase.\n\n<b>     INT. LAUNDRY ROOM - LATER\n</b>\n     Peter folds laundry into his/her piles.  Susan paces.\n\n<b>                          SUSAN\n</b>                This thing was the size of my fist,\n                Peter!! That's off the charts!\n\n<b>                          PETER\n</b>                Okay. So you lost a great specimen-\n\n<b>                          SUSAN\n</b>                Don't you get it? It's more than\n                that.\n\n     Peter takes a bedsheet. Susan helps him fold it.\n\n<b>                          SUSAN\n</b>                You know why insects don't grow larger?\n                Because they don't have a complex\n                respiratory system. What I saw did. It\n                had lungs.\n\n     Peter walks backward with his end of the sheet.  The two\n     begin to fold it together.\n\n<b>                          SUSAN\n</b>                Evolution doesn't work that fast.\n                Something pushed that thing to take the\n                leap. We need to find another specimen.\n\n<b>                          PETER\n</b>                We?\n\n     As they fold the sheet, they move closer together.\n\n<b>                          SUSAN\n</b>                I did a PH test on its tarsal pads.\n\n     The folding of the sheet has brought them almost face to\n     face. Susan finishes folding herself.\n\n<b>                          SUSAN\n</b>                There's only two species who match the\n                enzymes I found.  One's a leaf-cutter ant\n                in the Amazon...\n\n     She has his full attention now.\n\n<b>                          SUSAN\n</b>                The other we released here two years ago.\n\n<b>     EXT. ALPHABET CITY - AVENUE B - DAY\n</b>\n     A TAXI CAB makes a U turn and cruises on.\n\n<b>     INT. CAB\n</b>\n     Susan ignores the yakking Armenian DRIVER as she scans\n     the buildings and empty lots-\n\n<b>                          ARMENIAN DRIVER\n</b>                Avenue B... again! Maybe you got\n                wrong letter, uh?\n\n     The cabbie looks up at a Manhattan street map glued over\n     his head on the roof of the cab.\n\n<b>                          SUSAN\n</b>                Keep going. We'll tell you when to\n                stop...\n\n<b>                          PETER\n</b>                Maybe they lied to you.\n\n<b>                          SUSAN\n</b>                Even if they did... that's all we\n                have, isn't it?\n\n     The cab cruises past the tenement buildings, nondescript\n     stores, junked cars and rubble-strewn lots. It stops\n     before a traffic light.\n\n     A LEERING HOMELESS GUY with a greasy rag and greasier\n     cleaning solution approaches the windshield.\n\n<b>                          ARMENIAN\n</b>                No... Oh, shit. Get away, you Turk!\n\n     The Homeless guy begins wiping/smudging the windshield\n     with his dirty rag. The driver sends him away.\n\n     The light turns green.  The Driver accelerates, turning\n     on the windshield wipers to expunge the smears left by\n     the guy.\n\n     Susan sees something.\n\n<b>                          SUSAN\n</b>                Pull over!\n\n<b>                          ARMENIAN DRIVER\n</b>                What...?\n\n     Susan motions excitedly.  The Driver pulls over. Susan\n     gets out.\n\n<b>     EXT. OUTSIDE CAR\n</b>\n     Susan rushes over, removes something from the windshield\n     wiper.\n\n     A BUTTERFLY, its wing pinned under the rubber flapper.\n     She holds it in her palm, then looks up at Peter.\n\n<b>                          SUSAN\n</b>                Metaxonycha Godmani.\n\n<b>                          PETER\n</b>                So?\n\n     Susan looks around.  Just ahead is an empty LOT surrounded by\n     a wooden fence plastered with flyers for rock bands and\n     performance artists.\n\n     An identical BUTTERFLY perches on the edge of a board.\n\n<b>     EXT. EMPTY LOT\n</b>\n     Susan and Peter walk through waist-high GRASS of a small\n     urban wilderness.  Dozens of BUTTERFLIES flutter around them\n     from the weeds.\n\n<b>                          RICKY (OS)\n</b>                If you want your money back, forget it!\n\n     Peter and Susan look up.  The voice comes from a RAMSHACKLE\n     CLUBHOUSE, built of wood scraps and cardboard.\n\n<b>                          DAVIS (OS)\n</b>                We already spent it!\n\n     Susan walks forward.\n\n<b>                          SUSAN\n</b>                We're here to deal.\n\n     Long beat.  The door to the clubhouse swings open.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. SUBWAY STATION - DAY\n</b>\n     A BLUR of subway cars goes by with an ear-pulverizing SOUND.\n\n     At the end of the platform, Davis untwists a wire around the\n     busted lock of a locker room door. Peter paces nervously\n     nearby.\n\n<b>                          PETER\n</b>                Here, let me...\n\n     He starts on it himself. Meanwhile, Ricky stares at a\n     PHOTOGRAPH Susan has given to him:  a ribbed, tortoise-\n     brown colored EGGCASE.\n\n<b>                          SUSAN\n</b>                You sure you didn't see one of these?\n\n<b>                          RICKY\n</b>                Gross. What is it?\n\n<b>                          SUSAN\n</b>                An \"Ootheca\". An eggcase. It probably had\n                more, uh \"weirdbugs\" inside.\n\n<b>                          RICKY\n</b>                     (shakes his head)\n                No way. I see one of those, I'd puke.\n\n     Davis opens the door with a CLICK.\n\n<b>     INT. SUBWAY LOCKER ROOM\n</b>\n     A dark, abandoned LOCKER ROOM once used for transit workers.\n\n     Susan and Peter walk in with the boys, nervous in the off-\n     limits area.\n\n<b>                          DAVIS\n</b>                It was in that corner over there.\n\n     Davis points to a bank of dented metal LOCKERS.\n\n<b>                          RICKY\n</b>                Sucker was fast, man.\n                     (Picks up a pipe.)\n                Had to take it out with one a these.\n\n<b>                          PETER\n</b>                Okay, guys.  We'll take it from here.\n\n     Peter hands Ricky some money. The boy looksdown at it\n     slyly.\n\n<b>                          RICKY\n</b>                Make it ten an' we won't tell the cops\n                you're here.\n\n     Peter regards the little scam artist dryly.\n\n<b>                          PETER\n</b>                Let's keep it at five and I won't\n                condemn your clubhouse.\n\n     Peter hands him a couple of dollars more. The two boys\n     take off.\n\n     Peter removes a PENLIGHT from his pocket.\n\n     Dust covers everything. A forest of COPPER TUBING and PIPES\n     where the sinks used to be.\n\n<b>     PETER\n</b>\n     inspects the floor. It's littered with cheap objects:\n     chipped combs, used rubbers, soggy newspapers, smeared\n     heroin syringes.\n\n     Something shiny catches his eye. He picks it up.\n\n<b>                          PETER\n</b>                     (quietly)\n                Look, a broken tooth...\n\n     Something rustles nearby.\n\n     He notices an old, rotting poster on the back wall.  It\n     seems ODDLY TEXTURED somehow.  He walks toward it.\n\n<b>     SUSAN\n</b>\n     kneeling, pushes aside a dented trash bin. Behind it, there\n     is a cabinet with rusty sliding doors.\n\n     A SUBWAY TRAIN RUMBLES by outside, the sound echoes off\n     the tile walls.\n\n     Susan forces the door back. She peeks through the opening.\n\n     Her face stares back at her from a dirty pocket mirror.\n     She starts pulling something out.\n\n<b>     PETER\n</b>\n     at the oddly texture wall.  He shines the penlight at it...\n\n     ...and is met with a FLUTTER OF WINGS.  MOTHS, perfectly\n     camouflaged against the poster on the wall, whiz past him.\n\n     Peter recoils.\n\n<b>                          SUSAN (OS)\n</b>                You okay?\n\n     He nods.\n\n<b>     SUSAN\n</b>\n     turns back to her locker.  She withdraws a cheap PLASTIC\n     NECKLACE from it.  As she removes it, it breaks.  A coulpe of\n     beads fall away...\n\n     ...rolls under the locker...\n\n     ...and BOUNCE -- once, twice, thrice -- each time going\n     deeper till they comes to a stop.\n\n     Susan peers where the beads fell.\n\n<b>                          SUSAN\n</b>                There's something under here.\n\n     Peter comes over, kneels by her. Susan takes a handful of\n     beads and throws them at the base of the locker.\n\n     CAMERA TRACKS to follow one of them. It rolls all the way\n     under.\n\n     A moment later, from some interior space, the sound of it\n     BOUNCING on cement. He shines his light inside.\n\n<b>     INT. HOLE - PETER'S HAND\n</b>\n     Very dark. A highlight glints off a shell-like surface.\n\n     The light barely touches it.\n\n<b>     THE WHOLE SURFACE BACKS AWAY.\n</b>\n     Peter drops the penlight.  It gets stuck in a jutting piece\n     of concrete.\n\n<b>     PETER\n</b>\n<b>                          PETER\n</b>                Shit.\n\n     Peter tries to get his hand in\n\n<b>     DEEPER\n</b>\n     But he cannot reach the light. It is literally inches from\n     his fingers...\n\n<b>     SUSAN\n</b>\n<b>                          SUSAN\n</b>                Let me try.  My hands are smaller.\n\n     She kneels and goes for it.\n\n<b>     INT. HOLE - SUSAN'S HAND\n</b>\n     Her hand reaches for the penlight.\n\n     She barely touches it.  The penlight spins around.  Its light\n     now illuminates...\n\n     THE FACE OF A MAN.  Unseen by Susan.  Terrifying in its doll-\n     like simplicity.  In the darkness, its features seem\n     indiscernable, inert, almost frozen in a perfectly\n     symmetrical pattern.\n\n     It regards the spiderlike movement of Susan's fingers.\n\n<b>     SUSAN'S\n</b>\n     face squinches with the effort.\n\n<b>                          PETER\n</b>                Honey, just leave it.\n\n<b>                          SUSAN\n</b>                No, there's...\n\n<b>     INT. HOLE - SUSAN'S HAND\n</b>\n     As Susan's hand moves closer, the strange Face begins to\n<b>     TREMBLE.\n</b>\n<b>     A CLICKING SOUND.\n</b>\n     Susan's hand is almost there.\n\n<b>     SUSAN\n</b>\n     reaches further.\n\n     And suddenly A BEAM OF LIGHT cuts through the darkness.\n\n     Their vision resolves. The figures of two MTA COPS stand\n     before them:  ERNEST, 50, burly and bull-necked; and LEONARD\n     -- African American, 45, more formidable than fat.\n\n<b>                          LEONARD\n</b>                     (Wearily)\n                Now don't tell me.\n\n<b>     INT. HOLE\n</b>\n     Susan's hand withdraws.\n\n<b>                          LEONARD (OS)\n</b>                You lost a token, right?\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. SUBWAY PLATFORM - LATER\n</b>\n     SHH-SHH-SHH.  A felt rag is expertly being pulled across a\n     set of pristine black shoes.\n\n     REVEAL Leonard sitting like a king in a chair, getting his\n     shoes shined by Manny.  He leans back laconically while\n     arguing with Peter. Ernest examines the ootheca picture.\n\n<b>                          PETER\n</b>                Look, I showed you my badge...\n\n<b>                          LEONARD\n</b>                Yeah, and you gonna have to show me a lot\n                bigger one you wanna go down there.\n                That's the old maintenance grid, Doc.\n                Swiss cheese: tunnels, tracks...\n\n<b>                          PETER\n</b>                The Department of Public Health...\n\n<b>                          LEONARD\n</b>                ...should know better'n to go sneakin'\n                around my turf...\n\n<b>                          PETER\n</b>                Fine.  You want me to call your\n                supervisor?\n\n<b>                          LEONARD\n</b>                Please do.  He's a lonely guy.\n\n     Uninterested, Leonard looks over to Susan and Chuy.\n\n<b>     ANGLE ON SUSAN\n</b>\n     She leans against the wall, inspects her dirty hand. Ernest\n     gives her his handkerchief.\n\n<b>                          CHUY (OS)\n</b>                Gucci.  Flat pump.\n\n     She looks down at Chuy, who sits nearby, holding a PAIR OF\n<b>     SPOONS.\n</b>\n<b>                          ERNEST\n</b>                Your shoes.\n\n     She stares down at her shoes.  Gucci flat pumps, all right.\n     Susan smiles.\n\n     Just then, a SUBWAY TRAIN pulls up.  The doors open,\n     disgorging passengers. Chuy flips into action.  He starts\n     playing his spoons, CLICKING them together, slapping them\n     against his knee.\n\n     Susan watches in wonder as the boy begins to use the spoons\n     to IMITATE the different rhythmical step patterns of the\n     VARIOUS COMMUTERS: The rolling, comical gait of A FAT MAN,\n     the lithe haughty step of A PRIM LADY.\n\n<b>                          SUSAN\n</b>                     (Laughs.  To Chuy.)\n                That's wonderful!  What grade are you in?\n\n     Chuy doesn't answer.\n\n<b>                          ERNEST\n</b>                No school. Shoes're all Chuy knows about.\n\n     Ernest discreetly points to his forehead.\n\n<b>                          MANNY\n</b>                     (immediately)\n                He's special.\n\n<b>                          LEONARD\n</b>                He can imitate anything, you just watch\n                him.\n\n<b>                          PETER\n</b>                     (Irritably, to Leonard)\n                Excuse me, I'm talking to you.\n\n<b>                          LEONARD\n</b>                No, you talkin' at me.\n\n     Leonard hands Manny a $5.00 bill for the shine, gets up and\n     walks past Peter as if he were invisible.\n\n<b>                          ERNEST\n</b>                     (discreetly, to Susan)\n                Is there some reward for this?\n\n<b>                          SUSAN\n</b>                I guess that could be arranged.\n\n     Ernest smiles, pockets the ootheca picture.\n\n<b>                          PETER\n</b>                For Chrissakes.  You gonna lay a two-\n                bit bureaucratic, territorial number\n                on me?\n\n<b>                          LEONARD\n</b>                You wanna keep up the conversation, you\n                best come back with the proper permits\n                and the right attitude.\n\n     Leonard saunters away with Ernest in tow.\n\n     Peter shakes his head angrily.  He takes Susan by the arm,\n     heads off in another direction.\n\n     Chuy, without watching, clicks his spoons to the imitation of\n     their steps.\n\n<b>     INT. SUBWAY STAIRS - DAY\n</b>\n     Susan and Peter walk up the stairs; Peter still fumes.\n\n<b>                          PETER\n</b>                You give someone a fucking uniform\n                and... Did you hear how he talked to us?\n\n<b>                          SUSAN\n</b>                I heard how you talked to him.\n\n<b>                          PETER\n</b>                Oh, so I'm the bad guy now?\n\n     Susan spares him an ironic look.\n\n<b>                          SUSAN\n</b>                He was just doing his job.\n\n<b>                          PETER\n</b>                Fine, then I'm the bad guy. Jesus!\n\n     At the top of the stairs they're completely engulfed by\n     sunlight.\n\n<b>                          PETER\n</b>                He wants a permit, I'll get him a\n                permit.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. SUBWAY TRACKS - DUSK\n</b>\n     A train blurs by.\n\n     A FLASHLIGHT BEAM over dirty gravel.  TILT with the beam to\n     see Ernest walking his beat past TRACKS and GIRDERS.  Hulking\n     out-of-service SUBWAY CARS surround him. He shines his light\n     on the ootheca picture and then around him at the walls.\n\n     A SOUND catches his attention.  A RUSTLING.\n\n     He notices something off to a corner, walks over to it.\n\n     A SHINY BROWN LUMP in the corner, covered in garbage.\n\n     He touches the lump with his shoe.  It STIRS slightly.\n\n     He touches it again...\n\n     ...and a PAIR OF LEGS suddenly LASH OUT, kicking at him\n     reflexively.\n\n     Ernest jumps back.\n\n     Another SET OF LEGS emerges...\n\n     Oddly enough, Ernest relaxes.\n\n<b>                          ERNEST\n</b>                Chrissakes...\n\n     He grabs the surface of the lump, and pulls it.  We see that\n     it was just a SHINY BROWN TARP.\n\n     Underneath, a group of THREE HOMELESS PEOPLE -- emaciated,\n     toothless -- sleeping intertwined for warmth. In the dim\n     light, they almost seem like a single organism.\n\n<b>                          ERNEST\n</b>                Guys, c'mon.\n\n     The Homeless People stare back at him mutely.  Ernest starts\n     getting annoyed.\n\n<b>                          ERNEST\n</b>                I told you to stick by the maintenance\n                area.\n\n<b>                          BAG LADY\n</b>                Nah... It's private property now.\n\n     Ernest looks at her, confused.\n\n<b>                          SKELETAL BUM\n</b>                He eats down there.\n\n<b>                          ERNEST\n</b>                Who?\n\n<b>                          HOMELESS MAN\n</b>                The Stickman.\n\n<b>                          BAG LADY\n</b>                Long John.\n\n     The homeless man points.  Ernest turns his light.\n\n     Another SILHOUETTE of the OVERCOAT MAN drawn on the wall. An\n     arrow below it points east.\n\n<b>                          ERNEST\n</b>                Graffiti artist, uh?\n                     (To Homeless People)\n                Look guys, just get off my beat, you\n                hear?  Get moving.\n\n     Ernest hustles them out.  The homeless people glare at him,\n     pick up their things and head into the gloom.\n\n     Ernest watches them go.  He turns back to the graffiti\n     painting of The Stickman.\n\n<b>                                                       DISSOLVE TO:\n</b>\n<b>     INT. SUBWAY TUNNEL - LATER\n</b>\n     Ernest walks deeper into the tunnels. Dusklight slants in\n     weakly from grates above.\n\n     He stops as a RUMBLE is heard ahead of him  He ducks into a\n     recess in the wall.  The RUMBLE grows LOUDER, LOUDER.\n\n     A SUBWAY TRAIN curves around the bend up ahead, its\n     HEADLIGHTS raking the opposite wall to reveal...\n\n     A FIGURE crouched over something.\n\n     We hear CHOMPING and SWALLOWING sounds.\n\n<b>     CU ERNEST\n</b>\n     Squinting to see over his flashlight beam.\n\n<b>                          ERNEST\n</b>                Hey, buddy!\n\n     No answer.  Just the wet sounds of food getting chewed and\n     ingested.  Ernest is revolted.\n\n<b>                          ERNEST\n</b>                Get off my track...\n\n     The crouching figure lifts its head and looks around in a\n     unusually quick BLUR OF MOTION.  It's the OVERCOAT MAN.\n\n     Another distant RUMBLE. Ernest's clothes flutter in the puff\n     of hot wind that signals an approaching train.\n\n     Ernest pulls a CAN OF MACE from his belt, begins to advance.\n\n     The Overcoat Man stands up.\n\n     Ernest stops in his tracks.\n\n     For he sees that the Overcoat Man is holding a large OBJECT\n     in his arms. Something wet and shiny with blood.\n\n     A dead dog.\n\n     The Overcoat Man drops the animal.  It rolls slowly down his\n     chest...\n\n     ...and is briefly caught BY ANOTHER SET OF ARMS EXTENDING\n<b>     FROM HIS TORSO.\n</b>\n<b>                          ERNEST\n</b>                Sweet Jesus...\n\n     The Overcoat Man lets the animal fall to the ground.  He\n     begins walking toward Ernest.\n\n     Ernest backs away.\n\n     The Overcoat Man LEAPS on him just as the SUBWAY TRAIN ROARS\n<b>     PAST!\n</b>\n     CRACK! Ernest's body is twisted and crunched by powerful\n     arms.\n\n     Through the strobing windows we see Ernest enveloped by the\n     dark figure, then raised above, taken away.\n\n<b>     TRACK\n</b>\n     The can of mace rolls next to the track as the TRAIN CLEARS.\n\n     The track is empty again.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. EXHIBITION HALL - BANNER\n</b>\n     We PAN across the banner:  'ARCHITECTS OF NATURE'.\n\n<b>     INT. EXHIBITION FLOOR\n</b>\n     EXHIBITS under glass set up throughout the room: Insect\n     chambers and vaults of great complexity, etc.\n\n     An opening night CROWD of affluent MUSEUM PATRONS.  All\n     tuxedoes and painted smiles.  Some peremptorily peruse the\n     displays; most just camp out at the buffet table.\n\n     Peter enters, dressed in his worksuit.  He scans the\n     room, sees Siri leaning against a wall by the buffet\n     table, drinking an orange juice.  He goes over to her.\n\n<b>                          PETER\n</b>                Heya.\n                     (Kisses her on the cheek.)\n                Where's the boss?\n\n     Siri gestures to the far end of the room.  Susan stands\n     alone, sipping a chardonnay by an ANT MOUND exhibit.\n\n<b>                          SIRI\n</b>                Ant mound.\n\n     Peter notices Siri seems unusually weary. She covers one\n     of her eyes.\n\n<b>                          PETER\n</b>                You okay?\n\n<b>                          SIRI\n</b>                It's just a headache.  We were\n                sandblasting Trump Tower here since\n                four this morning.\n\n<b>                          PETER\n</b>                Maybe you should sit...\n\n<b>                          SIRI\n</b>                I'm fine. Go talk to Susan.  She could\n                use a good word right now.\n\n     She nods for him to go ahead.  Peter leaves.\n\n     Siri closes her eyes.  She rubs the bandage around the\n     insect bite on her hand.\n\n<b>     PETER\n</b>\n     approaches Susan.  She's staring through thr glass panes\n     of the exhibit at the crowd of patrons.  In the\n     refraction, their black tuxedoes and evening gowns seem\n     to blend into one another.\n\n<b>                          PETER\n</b>                Great crowd.\n\n<b>                          SUSAN\n</b>                No such thing, baby.\n\n     She looks over at the crowd congregated around the\n     buffet table.\n\n<b>                          SUSAN\n</b>                I get the feeling they came more for\n                the potroast than the apterids.\n\n<b>                          PETER\n</b>                Fuck 'em.  They don't know what\n                they're missing.\n\n<b>                          SUSAN\n</b>                     (Distantly)\n                Right.\n\n     Peter looks at her.\n\n<b>                          PETER\n</b>                What's wrong?\n\n     Susan sighs.\n\n<b>                          SUSAN\n</b>                Oh...nothing that a little\n                menopausal's pee daikiri couldn't\n                cure. Least that's what I thought.\n\n     Peter looks at her, notices that one of her hands is on\n     her stomach.\n\n<b>                          PETER\n</b>                     (genuinely moved)\n                Oh, no, you were-\n\n<b>                          SUSAN\n</b>                I was just late.\n\n     Susan nods.  Peter takes her hand. They sit by the ant\n     mound.\n\n<b>                          SUSAN\n</b>                Ironic, don't you think?  These guys\n                can hatch hundreds of offspring in a\n                single clutch of eggs, right? And\n                here we are...\n\n<b>                          PETER\n</b>                Susan, we're not b-\n\n<b>                          SIRI (OS)\n</b>                Susan?\n\n     Susan looks up to see Siri standing on the other side of\n     the glass case.\n\n<b>                          SIRI\n</b>                     (Weakly.)\n                I'm sorry.  I think...I need...\n\n     One of her eyes is completely bloodshot. Her mouth is\n     bleeding. She puts her hand on the case to steady\n     herself.\n\n     Her fingers leave a STREAK OF BLOOD on the glass.\n\n<b>                          SUSAN\n</b>                Siri...\n\n     Siri collapses.  The exhibit tips over.\n\n     Peter pulls Susan out of the way just as the exhibit\n<b>     FALLS AND SMASHES TO THE GROUND!\n</b>\n<b>                          SUSAN\n</b>                Siri!\n\n     The room erupts into COMMOTION.\n\n     Susan and Peter run to Siri, who lies unconscious on the\n     floor.\n\n     Peter gently turns her over.\n\n     Siri's BLEEDING from the corner of her mouth.  Just like\n     the Chinese workers in the sweatshop.\n\n     Tuxedoed people encircle her next to the insect mounds.\n\n<b>                                                  SMASH CUT TO:\n</b>\n<b>     EXT. NEW YORK STREET - NIGHT\n</b>\n     An ambulance races down the avenue toward a distant\n     hospital.\n\n<b>     INT. HOSPITAL - HALLWAY\n</b>\n     Siri is rushed on a gurney toward the Emergency Room.\n\n     Peter and Susan walk next to it talking to DR. CHRIS\n     RAYMOND, a 35-year old ER physician.\n\n<b>                          PETER\n</b>                ...I think it's some kind of systemic\n                infection, Chris.  I saw a few cases\n                like it yesterday. A sweatshop in\n                Canal.\n\n<b>                          RAYMOND\n</b>                     (to Peter.)\n                Okay, look.  You better come in with\n                me.  Help me through.\n\n<b>     INT. EMERGENCY ROOM\n</b>\n     Raymond, Peter, and several other ER STAFF work on Siri,\n     now lying on an operating table.\n\n<b>                          RAYMOND\n</b>                     (To Peter)\n                All hands on deck, Pete. Remember the\n                dril?\n\n<b>                          PETER\n</b>                It'll come back to me.\n\n     RAYMOND inspects Siri's wounded hand.  The bandage has\n     been removed.  The bite-wound is infected and\n     suppurating.  A large red circular RASH around it.\n\n<b>                          PETER\n</b>                Looks like a Lyme disease rash.\n\n<b>                          RAYMOND\n</b>                It's not consistent with the internal\n                bleeding. Any idea what bit her?\n\n     Peter shakes his head.\n\n<b>                          RAYMOND\n</b>                I think we're gonna need to have that\n                specimen here.\n\n     An ASSISTANT finishes inserting a catheter down her\n     throat.\n\n     Blood and fluid leak up through the clear tube.\n\n<b>     ABOVE THE OPERATING THEATER.\n</b>\n     Staring down through the circular glass deck, Susan\n     silently observes the procedures.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. MANNY'S APARTMENT - NIGHT\n</b>\n     Salmon-colored LIGHT slants in from sodium vapor streetlight.\n     PAN through the shadowy room, past Manny's sleeping form to\n     Chuy, asleep under a tent made of an old Star Wars blanket.\n\n     A RHYTHMICAL CLICKING SOUND is heard from outside.\n\n     Chuy pops his head out from under the blanket, listening.\n\n<b>     EXT. FIRE ESCAPE - NIGHT\n</b>\n     Wearing only his pajama bottoms, Chuy steps out on the fire\n     escape with his spoons in hand.\n\n     The CLICKING RESUMES from the building across the street.\n\n<b>     OVERHEAD VIEW\n</b>\n     The barefoot little boy crosses the street, steps through the\n     center of the huge PAINT STAIN on the sidewalk.\n\n     The CLICKING sound comes again.\n\n<b>     STREET LEVEL\n</b>\n     The CLICKING comes again from inside the flophouse.  It\n     continues a little bit, then stops.\n\n     Chuy CLICKS his spoons together, mimicking the sound.\n\n     Beat.  A CLICKING from within again; almost an answer.\n\n     Chuy ducks under the yellow DOH tape, walks toward the front\n     of the building.\n\n     He comes to the boarded entrance.  There is a hole, narrow,\n     and low in the doorway.\n\n     Chuy squats, begins to wriggle through it.\n\n<b>     INT. FLOPHOUSE - LOBBY\n</b>\n     Chuy steps into the lobby.\n\n     The CLICKING comes again, from further inside.\n\n     Chuy moves to find it.\n\n<b>     CHAPEL\n</b>\n     Bits of STREETLIGHT slant in.  Chuy walks slowly, listening.\n\n     He steps into the SHADOW of a LOOMING FIGURE.  He turns...\n\n<b>     CHUY'S POV - CRUCIFIX\n</b>\n     We start on bleeding, nail-pierced feet, then TILT up the\n     twisted body to the face of Jesus, looking down.\n\n<b>     CHUY\n</b>\n     stares without emotion at the plaster figure.\n\n     MOVEMENT to his side.  He turns again.\n\n     A dimly-lit FIGURE stands before him.\n\n     Shapes fold and regroup in the darkness, resolving into the\n     tall figure of the OVERCOAT MAN.\n\n     The Man begins to emit the CLICKING NOISE from under his\n     chin, his whole head VIBRATING.\n\n     Chuy smiles.  He has a beautiful smile.\n\n<b>                          CHUY\n</b>                Mr. Funny Shoes.\n\n     He plays his spoons, imitating the sound the figure made.\n\n     He is answered...but this time, it's from the other side of\n     the room. We PAN as he turns.\n\n     ANOTHER OVERCOAT MAN appears in the shadows.\n\n     Chuy GIGGLES, delighted.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. HOSPITAL - WAITING ROOM\n</b>\n     Susan and Peter.\n\n<b>                          SUSAN\n</b>                ...you don't even know what you're\n                looking for.\n\n<b>                          PETER\n</b>                You said that thing was big as your\n                hand.  I don't think I'm going to\n                miss...\n\n<b>                          SUSAN\n</b>                Why take the chance?  Just let me go\n                down there with you...\n\n<b>                          PETER\n</b>                No.\n\n     Susan glares at him.  Peter sits down by her.\n\n<b>                          PETER\n</b>                Susan, listen to me:  you handled\n                that insect almost as much as Siri...\n\n<b>                          SUSAN\n</b>                It didn't bite me.\n\n<b>                          PETER\n</b>                I know.  But if it was carrying\n                something...there's a chance you\n                could have been exposed.\n\n     Susan is silent.\n\n<b>                          PETER\n</b>                Chris is going to run some blood\n                tests on you.  I want you to stay here\n                till he's absolutely sure you're\n                clean.  Okay? Then you'll call me...\n                You'll catch up with us...\n\n     Susan looks up at him. Finally, she nods.\n\n<b>                          PETER\n</b>                We'll be all right, Sus.  I promise.\n\n     He leans over, kisses her gently.  But Susan seems\n     hardly reassured.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. MANNY'S APARTMENT - PREDAWN\n</b>\n     The blue hours before dawn. Laconic movement outside.  New\n     York dragging itself out of bed.\n\n     We FIND Manny fixing some melted cheese sandwiches on a hot\n     plate. He addresses Chuy's tented bed behind him.\n\n<b>                          MANNY\n</b>                My father saw me stay in bed, he'd go get\n                a pitcher. Cold water, whoosh, I tell you\n                that's some alarm clock, brrrrr!\n\n     Manny cuts the bread in four equal sections and arranges them\n     in a star-shaped pattern. A breakfast ritual of some kind.\n\n<b>                          MANNY\n</b>                Ah! There you go! The way you like 'em,\n                Chu-chu...\n                     (He pours a glass of milk.)\n                We're low on milk, you remind Grampa to\n                pick some up tonight, okay?\n\n     He walks over to Chuy's tent bed. He pulls the sheets aside.\n\n     His grandson is gone.\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. SEWAGE FILTRATION PLANT - PREDAWN\n</b>\n     Sewage water BUBBLES in huge tanks.\n\n     A WORKMAN walks down catwalks above the tank, disengaging the\n     larger pieces of debris from the filter areas with grappling\n     hooks.  Shoes, tires, rags...\n\n     A GRINDING SOUND is heard.  The Workman YELLS out to a\n     CONTROL BOOTH above.\n\n<b>                          WORKMAN\n</b>                Hold up!  We gotta block on filter D.\n\n     SOUND of the pump coming to a halt.\n\n     The Workman walks to the filter area.  He sinks his grappling\n     hook into the polluted waters.\n\n<b>     UNDERWATER SHOT\n</b>\n     Spooky, silent. The grappling hook moves like a scythe to the\n     filter...\n\n     ...past long, soft filaments of RAGGED TISSUE...\n\n     ...and connects with a LARGER FORM.\n\n<b>     ABOVE WATER\n</b>\n     The Workman feels the grappling hook connecting.  He gives a\n     YANK, hooking whatever it is.\n\n     He begins pulling it up.\n\n     A PALE FORM bubbles to the surface.\n\n     The Workman's face goes pale.\n\n<b>                          WORKMAN\n</b>                Oh, God...\n\n     A grating VOICE from the control booth is heard over the P.A.\n\n<b>                          CONTROL BOOTH\n</b><b>                          VOICE\n</b>                What's the problem?\n\n     It take the Workman a moment to speak.\n\n<b>                          WORKMAN\n</b>                I think it's a baby!\n\n     The Workman pulls the form (as if that will do any good)\n     toward the edge of the tank.\n\n     He bends down, and now gets his first good look at it.\n\n     The Workman SCREAMS.\n\n     His grappling hook falls from his hand, into the sewage.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. HOSPITAL - ICU WARD\n</b>\n     Susan watches Siri from behind a pane of glass.  Siri is\n     connected to a respirator, her vital signs monitored by\n     several machines.\n\n     Raymond approaches Susan, two cups of coffee in his\n     hands.\n\n<b>                          RAYMOND\n</b>                How you feeling?\n\n<b>                          SUSAN\n</b>                You tell me.\n\n     He smiles, gives her one of the cups.\n\n<b>                          RAYMOND\n</b>                Your blood tests were all negative.\n                You checked out.\n\n     Susan visibly relaxes.  She looks back at the ICU ward.\n\n<b>                          SUSAN\n</b>                What about Siri?\n\n<b>                          RAYMOND\n</b>                She's stable.  I don't think there's\n                any immediate danger, but we'll have\n                to keep her under observation...\n\n<b>                          SUSAN\n</b>                You think it's some form of\n                Strickler's, don't you?\n\n     Beat.  Raymond shrugs.\n\n<b>                          RAYMOND\n</b>                Pathology's still working on the\n                tissue samples.  If it is...it must\n                be an errant strain.  Shorter\n                incubation period.\n                     (Beat.)\n                I'm sorry, Sue.  We just don't know\n                yet.\n\n<b>     INT. HOSPITAL - BATHROOM\n</b>\n     At the sink, Susan runs water over her hands, her face,\n     trying to collect herself.  She looks up in the mirror.\n     We see that her eyes are swollen, tear-stained.\n\n<b>     INT. HOSPITAL - HALLWAY\n</b>\n     She walks out of the ladies room, drying her face with a\n     paper towel.\n\n     SOUNDS of a nearby argument catch her attention.\n\n<b>                          JEREMY (OS)\n</b>                ...how many times I gotta tell you,\n                man: we can't accept this!\n\n<b>                          EMT (OS)\n</b>                Well, what the hell else am I suppose\n                to do with it?\n\n     Susan heads in the direction of the voices.\n\n<b>     INT. HOSPITAL - HALLWAY NEAR MORGUE\n</b>\n     An ORDERLY (JEREMY) argues with an EMT.  Their point of\n     contention:  a small FORM lying on a stretcher.\n\n<b>                          JEREMY\n</b>                Take it out back and throw it in the\n                friggin' dumpster!\n\n<b>                          EMT\n</b>                Not unless somebody signs for it.\n\n     Susan walks toward them, catches sight of the tiny form.\n\n     Her eyes go wide.\n\n<b>                          SUSAN\n</b>                Oh, my God.\n\n     Jeremy notices her.\n\n<b>                          JEREMY\n</b>                Hey, you can't...\n\n<b>                          SUSAN\n</b>                What's your name?\n\n<b>                          JEREMY\n</b>                Jeremy...\n\n<b>                          SUSAN\n</b>                Okay, Jeremy...go get Dr. Chris\n                Raymond, will you?\n\n<b>                          JEREMY\n</b>                Lady...\n\n<b>                          SUSAN\n</b>                Did you hear me?  Get Dr. Raymond!\n<b>                NOW!!\n</b>\n     Jeremy hesitates.  But if her tone wasn't enough, the\n     stare she gives him certainly is.\n\n<b>                          JEREMY\n</b>                Okay.\n\n     Jeremy backs away, takes off down the hall.\n\n     Susan approaches the stretcher.\n\n<b>                          SUSAN\n</b>                     (To EMT)\n                Where'd you find it?\n\n<b>                          EMT\n</b>                Washed up at the filtration plant on\n                Bank street. Some asshole there\n                thought it was a baby. They called\n                us.\n\n     Susan bends over it.  She covers her mouth and nose at\n     the stench.\n\n<b>                          EMT\n</b>                It's a lobster, right?\n\n     But it's not.  What lies on the stretcher before them\n     looks more like a demon from a Brueghel painting.\n\n     A THREE FOOT INSECT.  It's mephitic, pink-white body is\n     rotten, falling apart.  The head's intact, with strange,\n     large jaws thrown wide open. The chitin on one is half\n     gone.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. SUBWAY LOCKER ROOM\n</b>\n     Josh deposits a backpack full of equipment on the floor,\n     along with a small acrylic cage. Peter trains his FLASHLIGHT\n     into the bank of lockers.\n\n     Leonard, weary and pissed, looks at his watch.\n\n<b>                          LEONARD\n</b>                Better hurry it up, Doc. My shift's\n                almost over.\n\n     Josh hands him a piece of paper.\n\n<b>                          PETER\n</b>                Guess someone requested you for\n                overtime...buddy.\n\n     Peter braces his legs and tries to push the whole bank of\n     lockers clear--the locker section tips and falls with an\n     ENORMOUS BANG, which echoes loudly off the tile walls. Dust\n     flies everywhere.\n\n     When the dust settles and flashlights are focussed on the\n     area of the wall where the lockers stood, we see a LARGE\n<b>     HOLE.\n</b>\n<b>                                                            CUT TO:\n</b>\n<b>     INT. MORGUE - DAY\n</b>\n     Using a steel probe, Susan examines the dead insect.\n\n<b>                          SUSAN\n</b>                Posterior sternites are gone...half the\n                protonum rotted off.\n\n     Raymond lifts one of the wings.  A CLUMP OF WHITE LARVAE\n     feasts on the flesh underneath.\n\n<b>                          RAYMOND\n</b>                Maggots...\n\n<b>                          SUSAN\n</b>                Near hatching.  Thing must've died about\n                three weeks ago.\n\n     Susan closes the mandibles and examines them.\n\n<b>                          SUSAN\n</b>                Do you have a polaroid?\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. SUBWAY TRACKS\n</b>\n     Water DRIPPING from overhead, ECHOING footsteps- very\n     spooky.  Leonard leads Peter and Josh down the tunnel-\n\n<b>                          LEONARD\n</b>                You all watch your step.  We got some\n                burrows goin' down seven stories\n                here.  You fall, I don't wanna have to\n                come pick you up.\n\n<b>                          JOSH\n</b>                     (Whisper to Peter)\n                New York's finest.\n\n     Monumental archways give way to naves as big as Notre Dame.\n\n     Josh flashes the ultra-violet light over an abandoned\n     underground encampment, made of cardboard walls, electrical\n     wiring, elaborate debris kitchens. The walls are completely\n     taken by layer after layer of hand carved initials and\n     messages. Everything from \"Kilroy was here\" to\n     elaborate quotations from the bible.\n\n<b>                          JOSH\n</b>                There's really people living down here?\n\n<b>                          LEONARD\n</b>                Mole people. This section was pretty\n                popular, all the way to Fulton Street...\n\n     Their flashlights shine in a haze of brown dust. The air is\n     heavy.\n\n<b>                          LEONARD\n</b>                Substance abusers, mental cases... Then\n                about a year ago, Poof! All gone. Rumors\n                got started... Someone found a couple of\n                stiffs...\n\n     They work their way down a steep incline. They're covered in\n     sweat.\n\n<b>                          LEONARD\n</b>                Down here's the land of talk, see? So the\n                wildest version goes the farthest. They\n                mark that area with a sign or a drawing,\n                and its as good as closed.\n                     (chuckles)\n                We had one fella... for years said he was\n                Bela Lugosi. Got him on Geraldo.\n\n     Peter's cellular rings. He picks up -big static-\n\n<b>     INTERCUT WITH:\n</b>\n<b>     MORGUE\n</b>\n     Susan's got the phone up on her shoulder, clamped against her\n     ear. Raymond's cranking out a bunch of Polaroids. Color shots\n     of the insect, from every angle.\n\n<b>                          SUSAN\n</b>                It's me. Can you hear me?\n\n<b>                          PETER\n</b>                     (phone, barely audible)\n                Yeah, barely. We haven't found\n                anything down here. Nothing...\n\n     Jeremy goes to the fridge for a beer.\n\n<b>                          SUSAN\n</b>                I have.\n\n     The fridge light plays over the large insects jaws. It makes\n     out a few new ridges and valleys. Raymond snaps a couple of\n     Polaroids.\n\n<b>                          SUSAN\n</b>                I'm on my way. I've got something for you\n                to look at...\n\n     Susan notices something weird and undefinable about the\n     contours of the claws... But she can't put her finger on\n     it.\n\n<b>     BACK AT THE TUNNEL\n</b>\n<b>                          PETER\n</b>                We'll be back at the platform in...\n\n<b>                          LEONARD\n</b>                20 minutes. If you don't go sight-seeing\n                anymore.\n\n<b>                          PETER\n</b>                     (To phone.)\n                20 minutes.\n                     (Beat.)\n                Susan?\n\n     The call is lost. Peter tries to change frequencies, but it's\n     useless.\n\n     Peter replaces the phone in his pocket.  He walks off.\n\n<b>                          LEONARD\n</b>                Funny.  Shoulda seen some track\n                bunnies by now.\n\n<b>                          JOSH\n</b>                What?\n\n<b>                          LEONARD\n</b>                Track bunnies.  Rats.  They're\n                usually around.\n\n     No one notices the OVERCOAT MAN carving on the wall.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. MANNY'S APARTMENT - NIGHT\n</b>\n     On Manny's dining room table, a heap of unpolished shoes has\n     accumulated. The radio is playing a sad, elegiac Tango.\n\n<b>                          MANNY\n</b>                No, no, please understand... I can't\n                wait that long.\n\n     Looking disheveled and tired, Manny clutches the phone,\n     listening intently.\n\n<b>                          MANNY\n</b>                Please. I write it down.\n                     (he writes)\n                2... 8... 7... 3. What does this mean\n                \"case number\"? Okay. So, now what?  When\n                can you...?\n\n     He holds a color snapshot of Chuy sitting on a mailbox.\n\n<b>                          MANNY\n</b>                No, I can't wait...no, listen...\n\n     Click. Manny slowly hangs up. He stares at his notepad, at\n     the number 2873.\n\n<b>                          MANNY\n</b>                Hijos de puta.\n\n     He crumples it up, throws it away, crosses to the window,\n     picks up Chuy's last wire figure-\n\n<b>     FIGURE, CLOSER\n</b>\n     Another human-looking figure, long and thin, but with\n     something slightly off about it.\n\n     It has six limbs instead of four!\n\n<b>     MANNY\n</b>\n     frowns, looks down at the dark flophouse across the street.\n\n<b>                          MANNY\n</b>                Mr. Funny Shoes.\n\n     Distant thunder is heard.\n\n<b>     BATHROOM CABINET\n</b>\n     Manny takes a STRAIGHT RAZOR from the bathroom cabinet, opens\n     the blade.\n\n<b>     EXT. SUBWAY STATION - DAY\n</b>\n     Susan arrives at the stairs leading down to the subway\n     station. A COUPLE passes her on their way up.\n\n     A sign over the entrance says \"STATION WILL CLOSE FOR REPAIRS\n     AT 3 PM - TOKENS ONLY\". Susan looks around- the area is semi-\n     deserted, a bit creepy.\n\n     She takes a deep breath, descends.\n\n<b>     INT. SUBWAY - DAY\n</b>\n     Susan pushes through the turnstile, enters the long corridors\n     of gleaming tile, a somewhat de-humanizing atmosphere,\n     straight out of a George Tooker painting.\n\n     Very creepy.  Susan's footsteps ECHO in the empty tunnel.\n     She sneaks a nervous glance over her shoulder- nobody is\n     following her-\n\n<b>     PLATFORM \"A\" DELANCEY\n</b>\n     Susan observes the locker room door impatiently. A small crew\n     of REPAIRMEN are dismantling a row of fluorescent lights.\n\n     She sits and waits.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. DEEP IN TUNNEL\n</b>\n     Peter, Josh and Leonard walk through a darker area. The\n     floor beneath them suddenly changes, becomes tile.\n\n<b>                          JOSH\n</b>                     (Sniffing)\n                Smells like acid.\n\n     Peter stops, looks around.\n\n<b>                          PETER\n</b>                Ammonia.\n\n     Josh walks to the right, where the smell seems to emanate\n     from.  At last they come to\n\n<b>     INT. VAULTED AREA - CONTINUOUS\n</b>\n     Josh LIGHTS a flare, sets it on the ground, walks ahead.  The\n     ominous RUMBLE of a subway is heard in the distance.\n\n     A cracked WATER MAIN above.  Water dribbles to the ground.\n\n<b>                          JOSH\n</b>                Peter...\n\n<b>                          PETER\n</b>                Yeah...?\n\n<b>                          JOSH\n</b>                There's some weird shit here.\n\n<b>                          PETER\n</b>                Weird shit...?\n\n<b>                          JOSH\n</b>                Take a look.\n\n     Leonard shines his flashlight ahead.\n\n     Revealed, quite literally, is a world of shit.\n\n     LARGE FECES scattered everywhere:  on the floor, hanging\n     sausage-like from the ceiling.  One can almost taste the\n     stench of old ammonia.\n\n     Peter puts on a rubber glove, inspects one of the fecal\n     stalactites.\n\n<b>                          JOSH\n</b>                Fecal matter, unknown origin: weird\n                shit.\n                     (Beat)\n                Whatever it is, it's not human.\n\n     Josh breaks off a sample, drops it in a jar with a hard\n     THUNK.  Leonard turns away in distaste.\n\n<b>                          LEONARD\n</b>                And it needs some metamucil.\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. FLOPHOUSE - NIGHT\n</b>\n     It's raining like hell. Manny approaches the abandoned\n     flophouse.\n\n     He peeks through the boarded-up front entrance. Right there,\n     on the dusty lobby floor, clearer than the larger\n     shoeprints...\n\n     ...he discovers a trail of tiny, barefoot prints.\n\n<b>                          MANNY\n</b>                Chuy...\n\n     He kicks experimentally at the planks, but they're far too\n     strong.\n\n<b>     ALLEY\n</b>\n     Manny explores the opposite face of the building, looking for\n     a way in.\n\n     A DOG is BARKING incessantly. Manny turns.\n\n     Something moves in the shadows!  Something long and thin,\n     haloed  by the rain.\n\n     It moves again, the streetlight touching it for a fleeting\n     moment as it totters around to the rear of the building.\n     It's The Overcoat Man!\n\n     The man hurries past. Manny sprints after him.\n\n<b>     ALLEYS\n</b>\n     Manny comes running around a pile of grocery crates.\n\n     There is the OVERCOAT MAN.\n\n     CARGO WORKERS mill around a group of vegetable trucks,\n     unloading produce.\n\n     The OVERCOAT MAN attracts no attention. Keeping his head\n     down, staying near the shadowed buildings. Jumping and\n     hopping, he skitters into an alley.\n\n<b>     FOLLOWING\n</b>\n     Manny has to trot to keep up with the mysterious figure. He\n     pauses to take a pill and place it under his tongue.\n     Once it takes effect he moves on.\n\n     The OVERCOAT MAN has moved past a chainlink fence. How??\n     It's too high!!!\n\n     The old man squeezes through a jagged opening. The metal\n     fabric cuts his shirt.\n\n     On the other side: a dead end. Nowhere to go except\n     for...\n\n<b>     A SEWAGE GRATE\n</b>\n     Manny lifts it.\n\n<b>     SEWAGE PIPE\n</b>\n     Manny lands on his feet with considerable difficulty. He\n     flicks his lighter flame and opens the straight razor.\n\n     This pipe is carpeted with trash and a thick crust of dirt.\n     Something moves under a wet newspaper: a thick mass of long-\n     legged spiders dissolve onto the walls and floor.\n\n     Suddenly...the distant sound of spoons playing.\n\n<b>                          MANNY\n</b>                Chuy...\n\n     Manny pulls a rosary from his pocket, wraps it around\n     his wrist and crosses himself with the razor...\n\n     ...then begins to move down the pipe.\n\n<b>                                                            CUT TO:\n</b>\n<b>     PLATFORM \"A\" DELANCEY\n</b>\n     Susan examines the Polaroids.  She pulls out a payday bar.\n\n     The crew of repairmen are leaving.\n\n<b>                          REPAIRMAN\n</b>                Hey, Lady, all power will be down in\n                five minutes, okay?\n\n<b>                          SUSAN\n</b>                Okay....\n\n     She munches on the bar. She stops: one snapshot has caught\n     her attention.  The fridge light illuminated this photograph.\n\n     Susan turns it around... and around... Trying to find\n     something different in the lines.\n\n     A train roars by.\n\n     Then she notices it:\n\n<b>     THE POLAROID\n</b>\n     The closed jaws. They look like A HUMAN FACE.\n\n<b>     SUSAN\n</b>\n     Gets up nervously and heads for the dor to the locker room.\n\n     A whole row of lamps goes off. The rest flickers in and\n     out.\n\n     Then we see, now standing on her platform: THE OVERCOAT MAN!!\n     He looks at her between a row of columns under the dead neon\n     lights.\n\n     Susan tries the locker room door. It's unlocked.\n\n<b>     INT. LOCKER ROOM - SUSAN\n</b>\n     carefully crosses the floor to the bank of lockers.\n\n     She kneels to examine the hole in the wall.  She nears a\n     noise.\n\n     THE OVERCOAT MAN is moving toward her.\n\n<b>                          SUSAN\n</b>                Peter?\n\n<b>     OVERCOAT MAN\n</b>\n     The man's face TIPS BACK...\n\n     ...raising the complex, glittering INSECT HEAD FROM BEHIND\n<b>     ITS MASK-LIKE FRONT JAWS.\n</b>\n     Its multi-parted MOUTH clicks OPEN.\n\n     Susan SCREAMS!\n\n     The thing charges, its \"coat\" opening to reveal...SIX\n     LEATHERY WINGS, fully extended! The wingspan blocks the\n     whole tunnel, they vibrate rapidly.\n\n     Susan tries to run, but the creature -- hereafter known\n     simply as \"The Mimic\" -- LEAPS ONTO HER CHEST!\n\n     She's dragged screaming into the hole.\n\n     Their silhouettes recede rapidly amidst a confusion of legs,\n     wings and pipes.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. VAULTED AREA\n</b>\n     Peter and Josh put the fecal samples into the back-pack.\n\n     Leonard stands at the other end of the area. He inspects some\n     OLD SCAFFOLDING set up at an opening which leads to\n\n<b>     THE REMAINS OF AN OLD STATION\n</b>\n     fifteen feet below.\n\n<b>                          LEONARD\n</b>                I've never been this deep. This area\n                here is the Old Armory station. They\n                built it in the 40's. Ran out of money\n                half-way through...\n\n     It's like Grand Central's dead little brother. Tiled mosaic\n     walls, columns, monumental arches. Spaces for shops. A group\n     of abandoned turn-of-the-century subway cars on parallel\n     tracks.\n\n<b>                          LEONARD\n</b>                Okay, the fat lady's singing. Time to go.\n\n     Everything is gray with dust.\n\n<b>                          PETER (O.S.)\n</b>                     (To Josh)\n                I want a team in here by six tonight,\n                hands and knees with toothpicks...\n\n     Leonard squints down at the planks of the scaffolding.\n\n     A NYMPH -- big as the one seen earlier -- emerges from a pile\n     of nearby feces as if it were part of the mound.\n\n     Keeping his eyes fixed on the insect, Leonard coolly bends\n     down, picks up a ROCK.\n\n<b>     PETER\n</b>\n     putting the last sample boxes into the back-pack, looks up\n     and sees\n\n<b>     LEONARD\n</b>\n     step onto the scaffolding, raising the rock to crush the\n     nymph.\n\n<b>                          PETER\n</b>                Don't!!\n\n     SMASH! Leonard tosses the rock at the insect, crushing it.\n\n     Peter rushes to the insect's corpse on the scaffolding.\n\n<b>                          LEONARD\n</b>                Did you see the size of that thing?!\n\n<b>                          PETER\n</b>                Look what you did! You stupid sonofa-\n\n     A CREAK from the scaffolding at their combined weight.\n\n     Leonard grabs Peter, tries to pull him from the scaffolding.\n\n<b>     CREEEEAAAAAK!\n</b>\n<b>     THE ENTIRE SCAFFOLDING GIVES WAY!\n</b>\n     Buckling diagonally...\n\n     ...taking Peter and Leonard with it...\n\n     CRASH!  Both Peter and Leonard are thrown to the ground of\n     the station below.  The scaffolding falls around them.\n\n<b>     JOSH\n</b>\n     rushes forward.\n\n<b>                          JOSH\n</b>                Peter!\n\n<b>     PETER AND LEONARD\n</b>\n     stir in the wreckage.  Peter rises shakily.  He puts his\n     glasses on. One of the lenses is badly smashed.\n\n<b>                          PETER\n</b>                It's okay.  I'm all right.\n\n     He tries to help Leonard up; Leonard knocks his hand away.\n\n<b>                          LEONARD\n</b>                Get the hell away from me!\n\n     Peter looks up at Josh.\n\n<b>                          PETER\n</b>                     (Deadpan)\n                He's all right, too.\n\n     Leonard brushes himself off, checks out his walkie-talkie.\n     It's been broken in the fall, a tangle of plastic and wires.\n     He curses under his breath.\n\n     Peter checks the wall for a handhold.  But there's only\n     smooth tile and dust.\n\n<b>                          LEONARD\n</b>                Oh, that's gonna work.\n\n<b>                          PETER\n</b>                You got a better way up?\n\n     Leonard removes his badge, tosses it up to Josh.\n\n<b>                          LEONARD\n</b>                     (To Josh.)\n                Show that to the station manager.  Tell\n                him Leonard's gonna have his bubble-butt\n                he don't have someone down here in ten.\n\n<b>                          JOSH\n</b>                H-how do I get...?\n\n<b>                          LEONARD\n</b>                Way we came.  Take the first tunnel to\n                your right...\n\n     Leonard's voice echoes off the cavernous walls. Josh\n     hurriedly writes it down in his notebook.\n\n<b>                          LEONARD (OS)\n</b>                Go left.  Go left again till you hit the\n                fork... Then right again. You got that?\n\n<b>                          JOSH\n</b>                I think so. One right, two lefts...\n\n<b>                          LEONARD\n</b>                And a right.\n\n<b>                          JOSH\n</b>                Right.\n\n<b>                          PETER\n</b>                Go Josh. Now.\n\n     Josh obeys.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. NICHE\n</b>\n     We hear a persistent BEEPING...\n\n     A concrete ROOM filled with glimmering debris. Cans,\n     eyeglasses, fake teeth, chrome, foil, glass shards, broken\n     watches.\n\n     Susan lies unconscious, half-sunk in a mulch of decomposing\n     food, old newspapers, plastic garbage bags.  An inch of brown\n     WATER burbles past her bloody head.\n\n     SOMETHING jostles her, rocking her back and forth.\n\n     Her eyelids slowly open.\n\n<b>     A HUGE MIMIC IS PERCHED ON HER BODY!\n</b>\n     Its WINGCASE is drooped around her like a shroud. The\n     creature furiously tears at her jacket, trying to get at\n     Susan's beeper.\n\n     The beeper spills from her pocket along with several Pay Day\n     bars.  The Mimic CRUSHES the machine instantly, then chomps\n     up all the candy bars with a single move of its mandibles.\n\n     Susan watches in terror as the creature steps away.\n\n     A SOUND from an adjacent tunnel.  Susan looks...\n\n     ...and sees ANOTHER MIMIC pulling the REMAINS OF A MAN into\n     the darkness.\n\n     Susan gropes around her in the soggy debris, looking for some\n     weapon.\n\n<b>     SUSAN'S HAND\n</b>\n     Her fingers close around a three-foot piece of RUSTY PIPE.\n\n     Something dark drips on her hand.\n\n<b>     SUSAN\n</b>\n     looks up. Above her, a badly decomposing HUMAN FOOT, or what\n     is left of it.  All part of the excarnated corpse of the\n     Chinese Preacher.  His gold cross shines boldly in the dark.\n\n     Susan GASPS.\n\n<b>     THE MIMIC\n</b>\n     hears the sound.  It immediately SKITTERS back to her.\n\n<b>     SUSAN\n</b>\n     jerks herself sideways...\n\n     AND STABS THE PIPE into the Mimic's thorax with a wet CRRK!\n\n     Susan heaves herself up, pushing the thing onto its back.\n\n     The Mimic BUZZES furiously, milky WHITE FOAM pumping from the\n     wound.  Its legs slash the air as it tries to right itself.\n\n     Susan runs for the tunnels, debris falling from her clothing.\n\n<b>                                                            CUT TO:\n</b>\n<b>     JOSH\n</b>\n     comes to a t-junction.  He checks his notepad for the\n     appropriate direction.\n\n     He turns, heads left.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. TUNNELS\n</b>\n     Susan staggers through a dark PASSAGEWAY.  Water drizzles\n     into her grimy face.  She looks up.\n\n     Rain leaks from an overhead grate three stories up.  She can\n     see the SHOES of PEOPLE walking to and fro above.\n\n<b>                          SUSAN\n</b><b>                HELP!!!\n</b>\n<b>     EXT. STREET ABOVE - NIGHT\n</b>\n     Life as usual on Delancey street.\n\n     Pedestrians crisscross the metal grate, hunched under their\n     umbrellas.  Traffic noise, T.V. displays on street front\n     stores, boom boxes, car horns...\n\n     They drown out the tiny sound of Susan's voice...\n\n<b>     SUSAN\n</b>\n     hears distant FEET SCURRYING toward her, punctuated by a\n     metallic CLANG!  CLANG!  CLANG!\n\n<b>     SIDE TUNNEL\n</b>\n     CLANG!  The metal pipe, still imbedded in the Mimic, BANGS\n     the wall as the insect moves down the dripping narrow tunnel.\n\n<b>     SUSAN\n</b>\n     looks around frantically.  She crosses to a METAL LID on the\n     floor, lifts it.\n\n     A HOLE is below, dropping off into darkness.\n\n     The Mimic's CLANGING grows louder.\n\n     Susan sits herself on the edge of the hole, grasping the\n     metal lid by handles on its underside.\n\n     The Mimic rushes into the chamber, speeding toward her...\n\n     Susan JUMPS into the hole, hanging onto the lid...\n\n     WHANG!  The lid SLAMS SHUT over the hole a fraction of a\n     second before the creature reaches it.\n\n     The Mimic touches the lid with its antennae, confused.\n\n<b>     INT. HOLE\n</b>\n     The TICK-TICKING of the Mimic's antennae scanning the lid.\n\n     Susan hangs from the handles on the lid, her arms trembling.\n\n     Susan's strength gives out.  She lets go, falls.\n\n<b>     PIPE GALLERY\n</b>\n     Susan CRASHES onto a juncture between two large PIPES.\n\n     She MOANS in pain.\n\n<b>     CLOSER - SUSAN\n</b>\n     secures her position, looks down.  A seemingly bottomless pit\n     below, crisscrossed with a FOREST OF PIPES AND DUCTS.\n\n     The nearest pipe above her is well beyond reach.\n\n     She is trapped.\n\n     Then she hears the SOUND of the LID OPENING above.  She holds\n     her breath.\n\n     A faint YELLOW LIGHT of a lighter flickers down at her.\n\n<b>                                                            CUT TO:\n</b>\n<b>     WET SECTION\n</b>\n     Josh cautiously enters a vaulted area.  Old pipes have been\n     ripped from the walls.  WATER gushes over the steel-plated\n     walls.  He looks around- this doesn't seem familiar.\n\n     Josh freezes as he sees something behind a loose metal PLATE\n     on the wall.\n\n     He yanks at the plate- it gives a little bit. He yanks\n     harder- the plate falls down on one side, hanging\n     precariously from a loose bolt.\n\n     It reveals A HOLE PACKED WITH DOZENS AND DOZENS OF OOTHECAS.\n\n     He leans close to examine them- there is a NOISE in the\n     tunnel behind him-\n\n<b>     JOSH'S POV - WATERFALL\n</b>\n     A curtain of WATER falls over the side of a pipe onto the\n     floor.  Behind it, something ENORMOUS crawls into view.\n     Multiple legs, antennae, an elongated body distorted by the\n     water and the light of a flare.  It stops-\n\n<b>     JOSH\n</b>\n     Holding his breath and tiptoeing sideways, never taking his\n     eyes off the thing, Josh begins to move away.  He sees a\n     narrow OPENING in the wall- there seems to be dim LIGHT\n     coming from something beyond it.  He tries to squeeze through\n     the opening-\n\n<b>     MIMIC\n</b>\n     The creature is immobile behind the sheet of water, as if\n     mesmerized by its flow-\n\n<b>     PIT - JOSH\n</b>\n     With tremendous effort, Josh passes through the opening.\n\n     He finds himself inside a bowl-shaped mud hole.  Scattered\n     around him he sees FUNNY BUNNY PATCHES that were sewn in the\n     sweatshop.  He trips on a half-buried SEWING MACHINE.  He\n     looks up-\n\n     Above him is a grate.  He's come to the SHOWER ROOM of the\n     sweatshop!\n\n<b>     INT. SWEATSHOP SHOWER ROOM\n</b>\n     Empty now, except for the rusting sewing machines in a\n     corner.  We TILT to see Josh moving the grate away.  He\n     jumps- no way he can grab onto the slippery tile-\n\n<b>     HIS HANDS SLIDE!!\n</b>\n<b>     PIT\n</b>\n     Josh puts the old sewing machine upright.\n\n<b>     OUTSIDE\n</b>\n     Suddenly, the bolt hinging the plate gives way and... the\n     steel plate hits the ground: KLANGG!!\n\n<b>     THE MIMIC\n</b>\n     leaps into action!\n\n<b>     PIT - JOSH\n</b>\n     hears the CLICKING, fairly close.  He shines his light back\n     down the hole he entered through-\n\n<b>     JOSH'S POV - THE MIMIC\n</b>\n     moves past the waterfall and takes the wall at full speed.\n\n<b>     JOSH\n</b>\n<b>                          JOSH\n</b>                Oh shit, oh shit, oh shit!\n\n     He stands on top of the sewing machine, wobbling, reaches for\n     the floor above-\n\n<b>     SWEATSHOP SHOWER ROOM\n</b>\n     Josh's head and one shoulder are in through the hole.  His\n     arms tremble. He makes a desperate lunge and manages to grab\n     the POWER CORD of one of the abandoned sewing machines.\n\n<b>     THE MIMIC\n</b>\n     rushes through the opening without even slowing down.\n\n<b>     JOSH\n</b>\n     pulls himself up, up-  WHAM!  The Mimic hits the lower part\n     of his body, BLOOD spraying up through the hole.  He SCREAMS,\n     grasps the cord with both hands!\n\n     He is brutally YANKED down into the hole, the sewing machine\n     tipping, then dragged across the tiled floor till it wedges\n     violently in the hole!\n\n     We track over to reveal, one of Chuy's perfectly\n     executed WIRE SCULPTURES. Sitting atop another sewing\n     machine.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. REMAINS OF THE SUBWAY STATION\n</b>\n     A ring of FLARES burns in the darkness like an island.  Peter\n     lights another one, revealing a space buried in layers of\n     dust and time.\n\n     Cracked MANNEQUIN FACES stares out from an unopened TAILOR\n     SHOP.  A FLOWER PARLOR decorated with cobwebs.  A yellowed\n     NEWSPAPER on the floor, its headlines reading:  GERMAN TROOPS\n<b>     DRIVEN BACK ACROSS RHINE.\n</b>\n     Peter looks up to see Leonard approaching from the track.\n\n<b>                          PETER\n</b>                Any luck?\n\n<b>                          LEONARD\n</b>                Well...there's an old service elevator\n                half a mile down the tracks.  Ain't gonna\n                be much use, though.  Lines are dead.\n\n     Peter shines his flare up at a thick cord of cables which HUM\n     ominously with electricity.\n\n<b>                          PETER\n</b>                You said those cables're still live.\n                Can't we rewire...?\n\n<b>                          LEONARD\n</b>                Oh, man, there you go again.\n\n<b>                          PETER\n</b>                What?\n\n<b>                          LEONARD\n</b>                Those things bring juice to the new\n                stations.  You just can't rewire that\n                shit...\n\n     Peter approaches him.\n\n<b>                          PETER\n</b>                For Chrissakes, what's the problem?\n                You need a memo every time you fart?\n\n<b>                          LEONARD\n</b>                All right, motherfucker, that's it.\n\n     He pushes Peter violently. Their eyes lock and meet.\n     Inches away from a fistfight.\n\n<b>                          PETER\n</b>                Shh! Shh!\n\n     A SOUND rushing towards them, its echoes increasing by the\n     second.\n\n     Where is it coming from?\n\n     Peter looks at Leonard.  Leonard unbuttons his holster clip,\n     places his hand on his .22\n\n     A SHADOW appears outside the archway.\n\n     It steps onto the platform.\n\n     Leonard frowns.\n\n<b>                          LEONARD\n</b>                     (tentative)\n                Manny?!\n\n     The old man stumbles out of the darkness, out of breath. A\n     rusted crowbar in his hand.\n\n     Leonard walks over to him solicitously.\n\n<b>                          LEONARD\n</b>                My God, what the hell are you...?\n\n<b>                          MANNY\n</b>                Hurry, the woman needs help!\n\n     A shadow crosses Peter's face.\n\n<b>                          PETER\n</b>                Woman?\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. PIPE GALLERY\n</b>\n     OUTSTRETCHED HANDS in the darkness.\n\n     REVEAL Peter leaning across the void with one hand while\n     Manny and Leonard grip his other.\n\n     Susan below, balancing precariously on the crisscrossing\n     pipes. A mess, but still alive.  She reaches up to Peter.\n\n     It's too far.\n\n<b>                          SUSAN\n</b>                     (A whisper)\n                Don't.\n\n<b>                          PETER\n</b>                Listen to me:  we're getting you out.\n\n     Leonard and Manny pull Peter back into\n\n<b>     INT. TUNNELS\n</b>\n     Peter undoes his belt.\n\n<b>                          PETER\n</b>                     (To Manny and Leonard)\n                Give me your belts.\n\n     They obey. Peter buckles them together with his. He then\n     loops one end around a bannister, the other around his wrist.\n\n<b>                          LEONARD\n</b>                     (to Manny, as he ties them\n                     together)\n                What are you doing down here?\n\n<b>                          MANNY\n</b>                Chuy. He was taken. He's down here\n                somewhere...\n                     (to Peter)\n                Oh, please, hurry. I saw what was\n                after her.\n\n<b>                          PETER\n</b>                What's...?\n\n<b>                          MANNY\n</b>                Just hurry.\n\n     Peter takes his word for it.  He uses the belts to lower\n     himself to the nearest pipe.\n\n     Leonard LIGHTS a flare to illuminate the pipe gallery.\n\n     Peter works his way down. The web of pipes seem to recede\n     into Hades.\n\n     The lifeline tightens.\n\n     Peter gets to the last solid footing, lies down on his\n     stomach and lets the belts down.\n\n<b>                          PETER\n</b>                I'm coming, Sus, I'm coming.\n\n     But then, he sees something move below her. Then a hollow\n<b>     CLANG! CLANG! CLANG!\n</b>\n<b>                          SUSAN\n</b>                No, Jesus, no.\n\n<b>                          PETER\n</b>                     (To Leonard)\n                Toss the flare down!\n\n<b>                          LEONARD\n</b>                I only got...\n\n<b>                          PETER\n</b>                Just do it!\n\n     Leonard lets the flare drop from his hand.\n\n     It falls past them, ricocheting off the maze of pipes,\n     spinning down to the pitch-black below.\n\n     And for a split second the flame illuminates...\n\n<b>     THE MIMIC\n</b>\n     pipe in its thorax, nimbly CLIMBING THE PIPES TOWARD SUSAN\n<b>     CLANG! CLANG! CLANG!\n</b>\n<b>     PETER'S\n</b>\n     eyes grow huge.\n\n<b>                          PETER\n</b>                Oh, Jesus...\n\n<b>     LEONARD\n</b>\n     just plain loses it.\n\n<b>                          LEONARD\n</b>                What the fuck is that?! What the fuck is\n                that?!\n\n<b>     SUSAN\n</b>\n     knows all too well what's coming for her.\n\n<b>                          SUSAN\n</b>                     (A desperate appeal)\n                Peter...\n\n     Throwing caution to the wind, Peter reaches the belt down.\n\n<b>                          PETER\n</b>                Wrap it around your hand!\n\n     Susan at last gets a grip.  Peter pulls with both arms.\n\n     CLANG! CLANG! CLANG! Getting closer.\n\n<b>                          PETER\n</b>                Come on!\n\n     Susan struggles for footholds on the slippery pipes,\n     ascending foot by foot...\n\n     Peter pulls her into his arms.\n\n<b>     CLANG! CLANG! CLANG!\n</b>\n     Peter bends down.\n\n<b>                          PETER\n</b>                Get on my shoulders!\n\n     Susan steps onto his shoulders.  He pushes her up...\n\n     And Leonard and Manny yank her out.\n\n<b>     CLANG! CLANG! CLANG!\n</b>\n     Peter scrambles up, SLAMS the lid back on the hole.\n\n<b>                          PETER\n</b>                Let's go!\n\n     The four of them run.\n\n     HOLD ON the lid.\n\n     WHAM! It bursts from the floor, rolls away like a coin.\n\n<b>     INT. ABANDONED PLATFORM\n</b>\n     The four humans run down the empty platform.  Peter spares a\n     look back.\n\n<b>                          PETER\n</b>                Oh, shit...\n\n     Far down the tunnel,\n\n<b>     THE MIMIC HAS SPREAD ITS WINGS AND IS FLYING AFTER THEM!!\n</b>\n<b>                          MANNY\n</b>                There!\n\n     He points to the open DOOR of an ancient SUBWAY CAR.\n\n     They sprint for the car, get to the door.  Manny, Peter,\n     Leonard, then Susan...\n\n<b>     INT. SUBWAY REPAIR CAR\n</b>\n     ...tumble inside a repair car crammed with shelves and empty\n     crates.\n\n<b>                          LEONARD\n</b>                Get the goddam door!\n\n     Leonard and Peter both grab its handle, slide it shut...\n\n     SPLACK!  The Mimic crashes into it!\n\n     KLANGGG!  The door bulges out from the impact, almost\n     tearing itself off the hinges.\n\n     Susan jumps back.  Manny runs to cover her.\n\n     The creature is caught, half in, half out, antennae and\n     forelegs waving wildly!\n\n     The abdomen CRASHES through a pane of glass.\n\n<b>                          PETER\n</b>                Push it! Push it! Don't let up!\n\n     Leonard and Peter push harder, barely keeping it pinned.\n\n<b>     THE UPPER HALF OF THE MIMIC TEARS ITSELF LOOSE.\n</b>\n     WHITE BLOOD SPATTERS everywhere. The Mimic is NOW CUT IN\n<b>     HALF!\n</b>\n     The wings flap wildly, the abdomen shatters the safety\n     window's outer panels.\n\n     But the FRONT SECTION IS STILL ALIVE.  It scrabbles in,\n     spraying white blood...\n\n     ...drags itself up on the ceiling, then down onto the floor\n     and under a row of shelves in a half-circle around the car\n     till it finally comes to a halt.\n\n     Silence.  The only sound is a SKITTERING outside.\n\n     Susan looks outside the window.\n\n     The Mimic's REAR HALF IS STILL TRYING TO PUSH THROUGH THE\n     DOOR, its feet blindly dragging along.\n\n<b>     LEONARD\n</b>\n<b>                          LEONARD\n</b>                What the fuck was that?\n\n     Peter says nothing. Leonard grabs him by the shirt.\n\n<b>                          LEONARD\n</b>                You better tell me what the hell's\n                going on here!\n\n<b>                          MANNY\n</b>                Hey, hey!! Take it easy!!\n\n<b>                          PETER\n</b>                     (to Leonard)\n                We don't know!! We don't know what it\n                is!\n\n     Leonard releases Peter and, cocking his gun moves closer\n     to the still thing.\n\n<b>                          PETER\n</b>                Wait a minute-\n\n<b>                          LEONARD\n</b>                Fuck you, wait a minute. I'm\n                going to-\n\n     SNAP!  The Mimic POUNCES on him, catching his leg in its\n     front mandibles.\n\n     A sickening CRUNCH as the Mimic's mouth begins to work the\n     leg like a grinder-blender.\n\n<b>                          LEONARD\n</b><b>                GET IT!  GET IT OFF ME!\n</b>\n     Peter and Manny try to pull the thing off as Leonard falls\n     and writhes on the floor.\n\n     BAM! BAM! BAM! The men flinch away as Leonard empties his\n     guns on it, until the thing's shell finally CRACKS!\n\n     But the thing is still locked onto Leonard's leg.  Peter\n     tries to work it free from the creature's jaws. No good.\n\n<b>                          PETER\n</b>                Its muscles are locked.\n\n<b>                          LEONARD\n</b>                     (Hoarse)\n                Oh, Jesus!!\n\n<b>                          MANNY\n</b>                Wait...\n\n     Manny removes a can of shoe polish from his coat, then starts\n     smearing the stuff onto the Mimic's head and jaws.\n\n<b>                          LEONARD\n</b>                Oh, Jesus! It's hitting the bone man, get\n                it off!!\n\n     He lights a CIGARETTE LIGHTER, goes to touch the flame to the\n     flammable stuff.\n\n<b>                          PETER\n</b>                     (Stopping him.)\n                Hey hey hey...\n\n<b>                          MANNY\n</b>                Is how we make loose the ticks back home.\n\n     Peter hesitates, but lets him go.  Manny lights the polish.\n\n     WHOOSH...the Mimic's head is engulfed in a halo of flame. THE\n<b>     LEGS LOOSEN THEIR GRIP.\n</b>\n     Peter and Manny yank it free from Leonard, who's PASSED OUT\n     from the pain.  His leg is torn and bloody.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. SUBWAY REPAIR CAR - LATER\n</b>\n     We now see the car is 50's vintage.  A POSTER of Mickey\n     Mantle above an empty worktable.\n\n     Peter sits before Susan.  She's trembling, understandably\n     shaken from her previous experience.  BLOOD pours from a CUT\n     on her forehead.\n\n     Peter takes a bit of torn cloth, puts it to the wound, then\n     tenderly raises her hand to keep the bandage in place.\n\n<b>                          PETER\n</b>                Just keep holding it.  Can you do that\n                for me?\n                     (No reponse.)\n                Susan?\n\n     Susan nods silently.  Her hand weakly presses the compress.\n\n<b>                          MANNY (OS)\n</b>                Doctor Tyler?\n\n     He turns to Manny, who sits solicitously next to Leonard.\n     His wound is wrapped with makeshift bandages. He begins to\n     stir.\n\n     Peter gets up, but Susan's hand is closed tightly around his,\n     like the jaws of the Mimic.  He kisses her gently, then\n     slowly manages to release his hand.\n\n     He walks to Leonard, inspects his wound. Touches the sole of\n     his foot.\n\n<b>                          PETER\n</b>                You feel anything?\n\n<b>                          LEONARD\n</b>                Yeah, I feel like ripping your\n                fucking eyes out...\n\n<b>                          PETER\n</b>                Leonard, listen.  I need to see if\n                there's any nerve damage before we\n                carry you back.\n                     (No response.)\n                Look, I'm trying to help you here...\n\n<b>                          LEONARD\n</b>                Oh, you helped me here, all right, white\n                boy.  You and your goddam memo. You\n                needed to prove your point, uh?\n\n<b>                          PETER\n</b>                I'm sorry.  But I don't think letting you\n                bleed to death is the best apology.\n\n     Peter touches his foot again. Leonard finally nods.\n\n     Manny gazes at the Mimic carcass at the end of the car.\n\n<b>                          MANNY\n</b>                Where the hell'd that thing come from?\n\n     Peter looks at Susan.  She remains silent.\n\n<b>                          PETER\n</b>                     (Quietly)\n                A mistake.\n\n<b>                          LEONARD\n</b>                \"Mistake\"?  What's that supposed to...?\n\n<b>                          PETER\n</b>                It doesn't matter, all right?  It's dead.\n\n<b>                          LEONARD\n</b>                How you know that?  Shit, it was runnin'\n                around with its buttside gone and a\n                fucking pipe through its heart...\n\n<b>                          SUSAN\n</b>                     (Quietly)\n                It doesn't have a heart.\n\n     Peter looks up at her.\n\n<b>                          SUSAN\n</b>                Just inner chambers...\n\n<b>                          MANNY\n</b>                But it look like a man. It... I saw it.\n\n<b>                          SUSAN\n</b>                No...\n\n     She gets up, finally moving.\n\n<b>                          SUSAN\n</b>                That's what it wanted you to see.\n\n<b>                                                            CUT TO:\n</b>\n<b>     OUTSIDE CAR\n</b>\n     The subway car sits at the end of the platform, windows dimly\n     glowing in the dark. The door opens, and Manny and Peter\n     snatch the lower half and wing pieces back into the car.\n\n<b>     INSIDE CAR - A LITTLE LATER\n</b>\n     The lower half of the insect has been moved into the car.\n     Susan is reassembling it.\n\n<b>                          PETER\n</b>                So, you're saying this is like those bugs\n                that -- that look like twigs or leaves\n                or...\n\n<b>                          SUSAN\n</b>                     (shakes her head)\n                That's camouflage...\n\n     Susan displays the partly-charred head.\n\n<b>                          SUSAN\n</b>                This is mimicry. They evolve to mimic\n                their predators. A butterfly can look\n                like the eyes of an owl.  A catterpillar\n                can copy a snake...\n\n     Susan closes the multiple mouth parts into a self-contained\n     bud shape, then pushes back the \"face\" mandibles.\n\n<b>                          SUSAN\n</b>                This has evolved to mimic the most\n                dangerous predator it's ever had...\n\n     She holds it in her hand, like Yorick's skull. The mimic's\n     head obscenely mirrors her own. She inserts it into the\n     shoulder cavity.\n\n     She stands back.\n\n<b>                          SUSAN\n</b>                Us.\n\n     CAMERA cranes up and reveals that the thing now looks like\n<b>     THE OVERCOAT MAN.\n</b>\n<b>                          SUSAN\n</b>                Mantids can mimic. We gave the Judas\n                that code...\n\n<b>                          MANNY\n</b>                     (quotes)\n                \"...and behold he will come that walks as\n                a man, yet is not a man- ...\"\n\n<b>                          SUSAN\n</b>                This, is our baby Peter. Yours and\n                mine. Aren't you proud?\n\n<b>     OUTSIDE OF THE CAR - IN THE TUNNELS\n</b>\n     We see four shadows move fast, scuttling on the walls and\n     ceiling...\n\n     ...heading towards the car...\n\n<b>     INSIDE THE CAR\n</b>\n     A SUBWAY MAP on the wall.  Red, blue, and orange lines\n     branching through the boroughs like veins.\n\n<b>                          SUSAN\n</b>                All these...they're like tunnels of an\n                insect colony. Once these things hit a\n                certain population density, they'll have\n                to move out, form new colonies.\n\n     The realization hits the others.\n\n<b>                          SUSAN\n</b>                We have to get help down here.  Burn\n                the tunnels before...\n\n     She's interrupted by a CLICKING from the tunnel ahead.\n\n     It's answered by CLICKING from the tunnel behind.\n\n<b>                          LEONARD\n</b>                Get the doors!\n\n     A brief glimpse down the car shows too many OTHER DOORS to\n     close in time.\n\n<b>                          PETER\n</b>                Is there a switch?\n\n<b>                          LEONARD\n</b>                Third rail is dead.\n                     (To Manny and Susan.)\n                Get me up.  There must be a manual\n                override in the booth.\n\n     Manny and Susan help Leonard up.\n\n<b>                          SUSAN\n</b>                     (Whispering to Peter)\n                The lights!\n\n     Peter turns off the flashlights.\n\n     Susan and Manny help Leonard to the car's CONTROL BOOTH.\n\n     Peter looks\n\n<b>     OUTSIDE\n</b>\n     where the silhouette of a MIMIC moves to the rear of the car.\n\n<b>     CONTROL BOOTH\n</b>\n     Leonard opens a box on the side-wall marked MANUAL OVERRIDE.\n\n     Inside, there is a large, HEXAGONAL SHAPED HOLE.\n\n<b>                          LEONARD\n</b>                     (Starts looking around)\n                Where's the damn crank?!\n\n<b>     OUTSIDE\n</b>\n     The Mimic is only yards away.\n\n     OTHER SHADOWS emerge from the distant dark.\n\n<b>     INSIDE\n</b>\n     Manny leaves Leonard and Susan to look for the lever crank.\n\n     He runs to help Peter try and shut the doors manually.\n\n     But it's useless.  Many of the doors won't budge.\n\n<b>                          PETER\n</b>                     (hissing a whisper)\n                They're coming!\n\n<b>     OUTSIDE\n</b>\n     The shadows get nearer, their CLICKING louder...\n\n<b>     CONTROL BOOTH\n</b>\n     Susan looks under the dashboard, finds a HEXAGONAL SHAPED\n     ROD.  The lever crank.\n\n<b>                          SUSAN\n</b>                I got it!\n\n     Susan gives it to Leonard. He JAMS the rod into the hexagonal\n     shaped hole.  Perfect fit.\n\n     Leonard begins CRANKING the thing.  But it's rusty and\n     slow...\n\n<b>                          SUSAN\n</b>                Hurry! Please!\n\n<b>     THROUGHOUT SUBWAY CAR\n</b>\n     The doors begin to swing shut very slowly.\n\n<b>     OUTSIDE - A MIMIC'S POV\n</b>\n     sees the moving doors, starts heading for them.\n\n<b>     CONTROL BOOTH\n</b>\n     Leonard can't crank fast enough.  Susan joins in, putting her\n     hands over Leonard's.  Both spin the thing as fast as\n     possible.\n\n<b>     SUBWAY CAR\n</b>\n     Peter and Manny each pulling on a door, trying to speed up\n     the closing process.\n\n     SHADOWS are seen approaching, now very close.\n\n<b>     CONTROL BOOTH\n</b>\n     Leonard and Susan put all their effort into turning the crank\n     one more time...\n\n<b>                          LEONARD\n</b>                Come on, you son-of-a...\n\n<b>     SUBWAY CAR\n</b>\n     A SOFT CLICK as the doors SHUT IN UNISON.\n\n     Silence.\n\n     All four are stock still, like a submarine crew awaiting the\n     blast of depth charges.  Their eyes dart to the\n\n<b>     WINDOWS\n</b>\n     caked with soot, irradiated by the distant glow of one of the\n     red flares.\n\n     THUCK! Something BUMPS against the door.\n\n     A machine-gun patter of FOOTSTEPS on the roof.\n\n     The car SHAKES.\n\n<b>     OUTSIDE\n</b>\n     The dark platform is alive with phantom shapes.\n\n<b>     INSIDE\n</b>\n     SCREEECH!! Something sharp is drawn along the car roof like a\n     nail over a chalkboard.\n\n     THUMP! THUMP!  Impacts on the sides...\n\n     An obscene symphony of sounds as Mimics lay siege to the car.\n\n<b>     PETER\n</b>\n     A BUZZ OF WINGS catches his attention.  He turns.  His face\n     is reflected in a security window.\n\n     CRACK!  The window SPLINTERS, destroying Peter's reflection.\n\n<b>     ABOVE MANNY\n</b>\n     Claws SCRATCH the ceiling. It begins to dent.\n\n<b>     BELOW SUSAN AND LEONARD\n</b>\n     Large forms CLICKING underneath, looking for a way in.\n\n     Susan stares at the floor, her eyes following the course of\n     the clicking...\n\n     ...which leads to Leonard's wounded, bloodstained leg.\n\n<b>                          SUSAN\n</b>                Oh, God.\n                     (Looks at Leonard.)\n                The blood...\n\n     KLANGGG!  A Mimic leg PIERCES the ceiling above them!\n\n     Susan pulls Leonard out of the way just in time as\n\n<b>     IN THE SUBWAY CAR\n</b>\n     KLANG!  KLANG! More legs break through the ceiling!\n\n<b>     SUSAN AND LEONARD\n</b>\n     emerge from the control booth, Leonard's arm over Susan's\n     shoulder.\n\n<b>                          SUSAN\n</b>                His blood! It's driving them crazy! We\n                have to mask the odor!\n\n<b>                          PETER\n</b>                How?!\n\n     But there's not time enough to discuss possible solutions.\n\n     Leonard pulls off his jacket. Susan begins wrapping it around\n     his wound to mask it. Manny helps.\n\n     Peter has upended one shelf, jamming it against a broken\n     window as a barricade.\n\n     Despite their efforts, the Mimics are not thrown off the\n     scent.\n\n<b>                          PETER\n</b>                It's no use! They know we're in here!\n\n<b>                          SUSAN\n</b>                They don't know anything Peter, they\n                just sense. They're hardwired!\n\n<b>                          PETER\n</b>                Right. Hardwired to eat anything that's\n                not like them!\n\n     The whole car is now shaking and buckling.\n\n<b>                          SUSAN\n</b>                Exac...\n\n     She looks over at the severed Mimic corpse nearby.  A\n     realization...\n\n<b>                          SUSAN\n</b>                     (To Manny)\n                Give me your razor.\n\n     Manny looks at her blankly. Susan just takes the blade.\n\n     The whole car is now shaking and buckling.\n\n     She runs to the Mimic's carcass.  For a moment, she\n     hesitates.  But the pandemonium leaves her little choice.\n\n     She SLICES into the Mimic's corpse with the razor...\n\n<b>                          PETER\n</b>                What are you doing?\n\n     ...sticks her arm in all the way to the elbow...\n\n     ...and pulls out two fat AMBER SACS the size of\n     softballs.  She SLICES them open.\n\n     Orange GOO leaks out, its stench overpowering.\n\n<b>                          LEONARD\n</b>                     (covers his nose)\n                Shit!\n\n     Peter looks up as Susan slides one of the sacs over to\n     him.\n\n<b>                          SUSAN\n</b>                Rub it on the windows!\n\n<b>                          PETER\n</b>                What-\n\n<b>                          SUSAN\n</b>                Just do it!!\n\n     Holding his breath, against the stench, he smears the\n     crap on the windows, the doorframe...\n\n<b>     MANNY\n</b>\n     looks to the roof, listening.\n\n     And remarkably, the SOUNDS of the Mimics START\n<b>     SUBSIDING.\n</b>\n     Susan comes over to Leonard, begins dabbing the goop on\n     Leonard's wound.  Leonard makes a face at the stink.\n\n<b>                          LEONARD\n</b>                What are you putting that crap on me\n                for?\n\n<b>                          SUSAN\n</b>                Scent glands.  Insects use 'em to\n                identify themselves to each other.\n\n     She smears the floor area behind Leonard. The activity winds\n     down gradually, and finally comes almost to a halt.\n\n<b>                                                            CUT TO:\n</b>\n<b>     SUBWAY CAR - LATER\n</b>\n     Leaning against the dirtied window, Manny creates a streak\n     for every Mimic he sees.\n\n     Peter, Leonard and Susan are hard at work. Leonard has\n     created a small \"model\" of the station using pocket debris\n     and the wall map.\n\n<b>                          LEONARD (O.S.)\n</b>                Okay. That's us.\n\n     Manny's lighter represents the subway car.\n\n<b>                          LEONARD\n</b>                This track we're on? Goes down into\n                the repair area.\n                     (Makes an \"X\" further down)\n                The elevator's over here. Leads up to\n                the active tunnels.\n\n     THUMP! An oily, soft abdomen brushes lazily up against\n     the glass. Manny moves away.\n\n<b>                          PETER\n</b>                Can we get this car there?\n\n<b>                          LEONARD\n</b>                Someone'd have to go to the\n                switchroom, pull the coupling lever,\n                that'll send us left and to the\n                elevator.\n\n<b>                          SUSAN\n</b>                But the power...\n\n<b>                          LEONARD\n</b>                Hell, I might be able to juice the whole\n                area, if I can get to the power box. It's\n                just a couple of cables...\n\n<b>                          MANNY\n</b>                Oh, how you gonna get there, Leonard?\n                Hop?\n\n<b>                          PETER\n</b>                     (To Leonard)\n                Just talk me through it. I can go with\n                Manny.\n\n<b>                          LEONARD\n</b>                It would take a minute or so.\n                     (beat)\n                You won't last that long out there.\n\n<b>                          SUSAN\n</b>                Peter, you couldn't even fix our TV!\n\n     Tense silence. He points at the glands on the floor.\n\n<b>                          PETER\n</b>                We'll cover ourselves with this. They\n                can mimic us-  we Goddam mimic them!\n\n<b>                          SUSAN\n</b>                Peter-\n\n<b>                          PETER\n</b>                It worked before...\n\n<b>                          SUSAN\n</b>                     (an edge in her voice)\n                The scent won't last...\n\n<b>                          PETER\n</b>                That's why we should do it now.\n\n     Susan knows they have no other choice.\n\n<b>     LATER\n</b>\n     Susan is stuffing Leonard's old bloody bandages into the\n     thorax of the dead Mimic.  She ties a flare to its center.\n\n<b>                          LEONARD\n</b>                It's just a regular old pump switch,\n                okay? Right by the track signal\n                board.\n\n     Manny is spreading the mucus-like liquid of the gland-sac on\n     himself and Peter as Leonard instructs them-\n\n<b>                          LEONARD\n</b>                The lights come up, you pull the\n                switch.\n\n<b>                          MANNY\n</b>                I pull.\n\n<b>                          LEONARD\n</b>                You don't do that, we're on the wrong\n                track.\n                     (turns to Peter)\n                You...\n\n     The two men look into each other's eyes.\n\n<b>                          LEONARD\n</b>                You gonna finally get to fuck around\n                with the wires.  Think you can\n                handle it?\n\n<b>                          PETER\n</b>                Depends.  You got a memo?\n\n     Leonard's hard feelings give way to an almost\n     imperceptible smile.\n\n     Using a ballpoint pen, he draws a schematic on the back\n     of Peter's hand.\n\n<b>                          LEONARD\n</b>                All right then.  You gonna find two\n                wires.  One's green.  The other's\n                blue...\n\n<b>     SUSAN\n</b>\n     approaches Manny, who looks distractedly out the window.\n\n<b>                          MANNY\n</b>                He's out there. I heard him. How can\n                he be? This things...\n\n<b>                          SUSAN\n</b>                Manny...\n\n<b>                          MANNY\n</b>                I didn't protect him, lady. He\n                trusted me. And I didn't protect\n                him... His father...I lost his father\n                to the streets and now, Chuy...\n\n<b>                          SUSAN\n</b>                We'll find him. We'll be back and\n                find him.\n\n     Manny doesn't respond.\n\n<b>     READY TO GO\n</b>\n     Susan dabs at Peter's face with the last touches of the\n     scent gland substance.  She doesn't meet his eyes as she\n     speaks.\n\n<b>                          SUSAN\n</b>                You're going to have to keep it\n                really slow.  Their eyes react to\n                sudden movements.\n\n     Peter barely nods, his nerves clearly on edge.  He\n     instinctively goes to wipe his forehead.  Susan stops\n     him.\n\n<b>                          SUSAN\n</b>                Don't touch it.  And for Godsakes,\n                try not to sweat.  They can sense\n                chemical changes...\n\n<b>                          PETER\n</b>                Try not to sweat?\n\n     Leonard turns to Susan and Peter.\n\n<b>                          LEONARD\n</b>                Okay, people...\n\n     Leonard's voice comes through like a clarion.\n\n<b>                          LEONARD (OS)\n</b>                ...are we ready for this?\n\n     Susan has her hand on Peter's chest; Peter is taking deep\n     breaths, trying to cool down his body to prevent sweat.  It's\n     an odd parody of Lamaze exercise.\n\n<b>                          LEONARD\n</b>                Whatever you do, don't step on the\n                third rail coming back. Six hundred\n                volts'll blow your leg right off.\n\n     A final breath.  He's about as calm as he's going to get.\n\n     He looks at Susan a long moment. He takes her hand.\n\n<b>                          PETER\n</b>                I was just thinking how I could use a\n                pair of pliers... and I remembered where\n                they are...\n\n<b>                          SUSAN\n</b>                     (overlapping)\n                That's it. That's it. Breathe easy.\n\n     A sad, nervous smile appears on Peter's face.\n\n<b>                          PETER\n</b>                In the tool box under the kitchen\n                counter...\n\n     Susan kisses him softly on the lips.\n\n     Manny approaches.  Show time.\n\n     Susan steps away from Peter. She looks toward the control\n     booth.\n\n<b>                          SUSAN\n</b>                Open it.\n\n<b>     LEONARD\n</b>\n     begins turning the lever crank slowly.\n\n<b>     SUBWAY DOORS\n</b>\n     gradually begin to open, and stop half way.\n\n     The darkness outside is alive with CLICKING.\n\n<b>     PETER AND MANNY\n</b>\n     slowly move between the opening of the door and make their\n     way to\n\n<b>     INT. PLATFORM\n</b>\n     They step onto the dusty concrete.  Come to a stop.\n\n<b>     SUSAN\n</b>\n     watches nervously for the reaction of the Mimics\n\n<b>     OUTSIDE\n</b>\n     LARGE SHADOWS pass far and near of Peter and Manny; but none\n     of the Mimics seem to care about them one way or the other.\n\n     Peter and Manny exchange looks: a moment of relief.  It's\n     working.\n\n     Peter slowly moves right along the track to the nearby POWER\n<b>     BOX.\n</b>\n     Manny goes left, starts to make a longer journey across the\n     platform to the SWITCH ROOM.\n\n<b>     SUBWAY CAR\n</b>\n     Susan moves away from the door, goes over the Mimic carcass,\n     filled with the bloody bandages.\n\n<b>     PLATFORM - BY THE TRACKS\n</b>\n     Peter makes his way to the edge of the platform, whispering\n     to himself.\n\n     He lowers himself slowly to the track.\n\n<b>     PLATFORM - NEAR THE SWITCHROOM\n</b>\n     Manny moves toward the door.  A large WINDOW OF DUSTY GLASS\n     reflects his image...and the distant ones of the Mimics.\n\n<b>     BY THE TRACKS\n</b>\n     Peter gets to the track.  He turns\n\n     And is met FACE TO FACE WITH A MIMIC!\n\n     Its antennae move toward his head, curious.\n\n     Its human-mask face plate clicks apart and together.\n\n     Peter remains stock still.  He starts breathing deeply...\n\n<b>     SUBWAY CAR\n</b>\n     Leonard has now fully opened the doors.\n\n<b>     SUSAN\n</b>\n     pulls the tipcase of the FLARE tied to the dead Mimic's\n     midsection.  FSST!  The flare SPARKS alive.\n\n     The sudden light draws the attention of several Mimics\n     outside.\n\n     Susan pushes the carcass toward an open door at the front of\n     the car...\n\n     ...and with a HEAVE, throws it onto the front track.\n\n<b>     OUTSIDE\n</b>\n     The other Mimics take instant notice.\n\n<b>     BY PETER\n</b>\n     The Mimic before him suddenly turns.  In a flash of speed,\n     it's gone, heading toward\n\n<b>     THE DEAD MIMIC\n</b>\n     stuffed with the bloody rage, the thing sends its fellow\n     into a feeding frenzy.\n\n     The other Mimics begin TEARING into it, ripping their brother\n     to shreds in cannibalistic orgy.\n\n<b>     SUBWAY CAR\n</b>\n     Susan watches in disgust.\n\n<b>                          SUSAN\n</b>                Choke on it, motherfuckers.\n\n     Leonard turns the lever crank again.  The doors begin to\n     shut.\n\n<b>     PETER\n</b>\n     breathes a sigh of relief.\n\n     He goes to the powerbox, opens it up.\n\n     He shines his flashlight down on the back of his hand.\n     The simple chart tells him what to wire:  BLUE WIRES TO\n<b>     THE GREEN WIRES.\n</b>\n<b>                          PETER\n</b>                     (to himself)\n                Green...Blue...\n\n     He looks back up at the powerbox.  His face falls.\n\n     All the wires are a GROSS BROWN, their colored plastic\n     casings having long ago faded into goo.\n\n<b>     INT. SWITCHROOM\n</b>\n     Manny enters. The space is even more dusty than the rest of\n     the station. Spiderwebs strung over old machinery.  White\n     Doric PILLARS support the ceiling like skeletal bones.  1940s\n     style LAMPS are built into their side.\n\n     Manny looks around.  Off to the right, right next to the\n     rusted track switch board, he heads for the COUPLING SWITCH.\n\n     Once there, he rests and, through the murky windows, he\n     waves back to LEONARD.\n\n     He pulls out his pills box and takes a pill. But his hands\n     are shaking, under enormous tension. Some of the pills\n     scatter on the floor. He puts the box away and leans\n     against the wall.\n\n     A CLICKING nearby catches his attention, echoing from the\n     entrance of ANOTHER ROOM.\n\n     It is not the sound of the Mimics; but rather, of METAL.\n\n     Spoons.\n\n<b>                          MANNY\n</b>                Chuy...?\n\n     Manny follows the sound.\n\n<b>     BY THE TRACK\n</b>\n     Peter desperately tries to connect the wires the right way.\n     He wipes off the brown gunk, tries to discern any semblance\n     of color.\n\n     He feels himself start to sweat.  He tries to relax.\n     Breathes...\n\n<b>     INT. ROOM BEHIND SWITCHROOM\n</b>\n     The space is larger than the switchroom.  The walls and\n     ceiling have an odd, shiny consistency.\n\n     Manny heads in further, locates the levers and waits.\n\n     Something pale and small emerges from the dark, a few feet\n     away, a face that seems to float in the eerie half-light.\n\n     A RUSTLING behind him.  Manny turns around.\n\n<b>                          MANNY\n</b>                     (Whispering)\n                Nino...\n\n     He swings the light onto Chuy, sitting on the floor before\n     the remains of a RUSTY COLUMN.  That beautiful, emotionless\n     smile on his pale face.\n\n<b>                          MANNY\n</b>                Chuy...\n\n<b>     BY THE POWERBOX\n</b>\n     Peter has made all the necessary connections.  He turns now\n     to the fuse-section.\n\n     A red throw-switch is there, and two big slots for fuses.\n\n     One is still occupied.\n\n     The other one empty.\n\n<b>                          PETER\n</b>                Dammit!\n\n<b>     CU - PETER'S FOREHEAD\n</b>\n     BEADS OF SWEAT begin to form.\n\n<b>     SUBWAY CAR\n</b>\n     Susan watches the Mimics at their feast.\n\n     All of a sudden, they begin to stop, as if losing interest.\n\n<b>                          SUSAN\n</b>                     (horrified)\n                The scent's fading...\n\n     Susan steps back, looks around desperately for a flashlight.\n\n<b>                          LEONARD\n</b>                     (tense as hell)\n                What's Manny doing? I can't see him\n                anymore.\n\n<b>     ROOM BEHIND SWITCHROOM\n</b>\n<b>                          MANNY\n</b>                Nino, please...\n\n     Manny slaps his knees with both hands in a parental gesture\n     of \"come to me\".\n\n     In the darkness, something that looks like a PALM FROND\n     floats gracefully down from the ceiling, making see-saw\n     gestures as it falls through the air.\n\n     Manny shines his flashlight on the floor.  It's not a palm\n     frond.\n\n     It's a wing.\n\n     Manny turns his flashlight to the ceiling and walls.\n\n     The place IS COVERED WITH MIMICS.  They are in the middle of\n     a vicious mating ritual.  The males tear savagely at the\n     females wings as they proceed to mount them.  A chaotic\n     clusterfuck.\n\n     Manny is sickened.\n\n     CHUY GIGGLES. Manny shines his light ahead. Manny's face\n     falls.\n\n<b>                          MANNY\n</b>                Dios mio...\n\n     The WHITE PILLAR BEHIND CHUY IS MOVING...\n\n     ...unfolding...\n\n     ...at last revealing...\n\n     AN ALBINO MIMIC!  Another leap for evolution...\n\n     Its form is different from the other Mimics.  Sleeker, more\n     supple, almost beautiful.  And while its movements are still\n     not completely human, there is a kind of unearthly grace to\n     them that at the very least entrance us.\n\n     The thing raises itself to full height, dwarfing the tiny\n     boy.  It stands over him like a king over his court fool.\n\n     Chuy giggles happily.  It's all a game to him.\n\n     The Albino CLICKS in response -- a long, leisurely sound, as\n     if trying to communicate with the boy.\n\n     Chuy pulls his spoons out and begins to play them, making a\n     perfect imitation of the sound.\n\n     Manny starts to tremble as the creature gazes upon him with\n     huge, expressionless 'eyes'.  He turns to Chuy-\n\n<b>                          MANNY\n</b>                     (barely audible)\n                Chuy...\n\n<b>                          CHUY\n</b>                     (whispers)\n                Friends.\n\n<b>                          MANNY\n</b><b>                NO, NO, CHUY, NO...\n</b>\n<b>                          CHUY\n</b>                Friends.\n\n     The Albino CLICKS his jaws, moving in toward Manny.\n\n<b>     CHUY\n</b>\n     plays his SPOONS in perfect imitation.\n\n<b>     MANNY\n</b>\n     stands under an archway in a swirl of dust. He raises his\n     arms, like a prophet. He lets go of hsi razor and kneels.\n\n<b>                          MANNY\n</b>                God has closed his eyes. This, he cannot\n                see...\n\n     His vacant eyes, fill with tears, he prays quietly, a strange\n     serenity invades him.\n\n     The Albino's jaws open and charge.\n\n<b>     PLATFORM\n</b>\n     Some Mimics advance toward Peter's direction.\n\n<b>     SUBWAY CAR\n</b>\n     Susan desperately waves a flashlight and bangs the window,\n     trying to attract their attention.\n\n<b>                          SUSAN\n</b>                Over here! Over here! Goddam you!!\n\n<b>     BY THE TRACKS\n</b>\n     Peter BREAKS the arm off one of his glasses.  He jams it at\n     the empty fuse.  It SPARKS.\n\n<b>     PLATFORM\n</b>\n     THUMP!  The electricity COMES ON...\n\n     The lamps on the columns BURST INTO FLAMES from the power\n     surge.  Fire illuminates the station like a Greek temple.\n\n<b>     BY THE TRACKS\n</b>\n     Peter climbs up onto the tracks...\n\n     ...sweat staining his forehead...\n\n     Peter wipes it and removes the scent coating.\n\n<b>     THE MIMICS\n</b>\n     clearly react, sensing the chemical change, like bees\n     reacting to honey.\n\n<b>     SUBWAY CAR\n</b>\n<b>                          SUSAN\n</b>                     (to Leonard)\n<b>                THE DOOR! OPEN THE FUCKING DOOR!\n</b>\n<b>     LEONARD\n</b>\n     looks at the now lit control panels, tries to decide which\n     button to press. He begins to press each one in turn.\n\n<b>     PETER\n</b>\n     hears the sound of spoons playing.\n\n     He turns to see Chuy, standing by the outside of the switch\n     room.  The boy smiles. A flashlight shines behind him.\n\n<b>                          PETER\n</b>                Manny...\n\n     But the thing holding the flashlight is anything but human:\n     The ALBINO steps into view, moving eerily like an unstrung\n     puppet. His claws and jaws are coated in blood. Chuy joyfully\n     announces the arrival like a little drummer boy.\n\n<b>     THE MIMICS\n</b>\n     climb over the roof, moving toward the rear of the-\n\n<b>     SUBWAY CAR - CONTROL BOOTH\n</b>\n     Susan runs in.  SLAMS her hand down on a button.\n\n<b>     FSST!\n</b>\n<b>     THE SUBWAY CAR\n</b>\n     The doors open.\n\n<b>                          SUSAN\n</b>                Peter!!\n\n     Peter hesitates, takes a step toward Chuy.\n\n<b>                          PETER\n</b>                Come on, kid...\n\n     Chuy seeks shelter behind the Albino's legs.\n\n<b>                          PETER\n</b>                     (horrified)\n                Jesus!\n\n     The albino charges toward him.\n\n<b>                          SUSAN\n</b>                Run!! Peter!!\n\n     Peter bolts for the car.\n\n<b>     THE MIMICS\n</b>\n     jump and land\n\n<b>     SUBWAY CAR\n</b>\n     just as Peter squeezes through one of the doors.\n\n     BAM! THUD! The doors dent. Glass cracks.\n\n<b>                          SUSAN\n</b>                     (Yelling to Leonard)\n<b>                GO!!\n</b>\n     Susan presses the button. The doors close again.\n\n<b>                          LEONARD\n</b>                The kid...\n\n<b>                          PETER\n</b>                The kid's with them!!\n\n<b>                          LEONARD\n</b>                What do you-?\n\n<b>                          PETER\n</b>                Go!! Just go!!\n\n<b>     CONTROL BOOTH\n</b>\n     Leonard throws the dead man's switch by the control board.\n\n<b>     SUBWAY CAR\n</b>\n     JOLTS into action.\n\n<b>     OUTSIDE\n</b>\n     The train LURCHES forward.\n\n     Wheels spark and kick into gear. The mimics scramble and re-\n     assemble quickly, ready to attack.\n\n<b>     THE ALBINO\n</b>\n     changes position and charges towards the car.\n\n<b>     THE MOVING CAR\n</b>\n     reaches a \"Y\" section.  The car moves to the track to the\n     right.\n\n<b>     INSIDE SUBWAY CAR\n</b>\n     Leonard's eyes go wide as he sees\n\n<b>                          LEONARD\n</b>                He didn't do it!\n\n<b>                          SUSAN\n</b>                What?\n\n<b>                          LEONARD\n</b>                Manny never threw the coupling switch!!\n                We're goin' the wrong way!!!\n\n<b>     OUTSIDE CAR\n</b>\n     It keeps bearing right. Further away from their destination.\n\n     ...towards an old STORAGE YARD in their path.  Idle cars and\n     repair equipment on the tracks.\n\n     A crash seems inevitable.\n\n<b>     INSIDE THE CAR\n</b>\n     Leonard pulls\n\n<b>     THE BRAKES\n</b>\n     but they don't work at all.\n\n     From below the car we see the wheels spinning freely,\n     heading for collision.\n\n<b>     INSIDE THE CAR\n</b>\n     Susan grabs Leonard from the control booth. To Peter\n\n<b>                          SUSAN\n</b><b>                MOVE BACK!!!\n</b>\n     They rush back against the opposite door.\n\n<b>     STORAGE YARD - SUBWAY CAR\n</b>\n     CRAAASHH!!  The car BASHES into a parked section of train in\n     a GRIN of tearing metal...\n\n     ...flips off the track...\n\n     ...and onto its side...\n\n     The car skids to a stop.  SPARKS fill the air.\n\n<b>     INSIDE SUBWAY CAR\n</b>\n     All three are hurt.  Leonard's leg wound has reopened. Peter\n     has badly damaged his right arm.\n\n<b>                          SUSAN\n</b>                You all right?\n\n     Peter nods painfully.  Susan to Leonard.\n\n<b>                          LEONARD\n</b>                     (Simply, re: his leg)\n                Can't feel it.\n\n     Peter and Susan sling Leonard's arms over their shoulders.\n     They raise him up.\n\n<b>     OUTSIDE SUBWAY CAR\n</b>\n     They move unsteadily outside.\n\n<b>                          SUSAN\n</b>                Which way?\n\n<b>                          LEONARD\n</b>                Across both tracks!!\n\n<b>                          PETER\n</b>                Shit.\n\n     They head off over a concrete island in the direction of the\n     correct track.\n\n<b>     FURTHER BACK\n</b>\n     The Mimics and the Albino moving closer.\n\n<b>     PETER AND SUSAN\n</b>\n     try to hurry, but it's no use given Leonard's condition.\n\n<b>                          LEONARD\n</b>                     (Quietly)\n                Lemme go.\n\n     Peter and Susan both disregard the order.\n\n<b>                          SUSAN\n</b>                We're no leaving you!\n\n<b>                          LEONARD\n</b>                No way we can outrun 'em together.\n                Move it!\n\n     Leonard suddenly grabs his POLICE BATON from his belt\n     clip.  He pushes the two away.\n\n<b>                          LEONARD\n</b>                NOW!! GO!! Get the hell off my beat!\n\n     Leonard turns away from them.\n\n     Peter goes to get Leonard, but Susan stops him.  This MTA\n     officer is staying put.\n\n<b>                          LEONARD\n</b>                Come on.  Come to poppa.\n\n     Reluctantly, the two begin down the tunnel.\n\n<b>     LEONARD\n</b>\n     takes a stand by the third rail, baton in hand.\n\n<b>     INT. SUBWAY TUNNEL - FURTHER DOWN\n</b>\n     Peter and Susan run.\n\n<b>                          SUSAN\n</b>                There.\n\n     An open CAGE ELEVATOR on a platform nearby.  A sign overhead:\n<b>     AUTHORIZED PERSONNEL ONLY.\n</b>\n     They rush toward it.\n\n<b>     INT. SUBWAY TUNNELS - \"Y\" SECTION\n</b>\n     Leonard stands like a guardian to the tunnel mouth.\n\n     SOUNDS of the Mimics approaching. He glances at the third\n     rail beside him, then down the track.\n\n<b>                          LEONARD\n</b>                Come here, you mealy-mouthed...\n\n     The sound gets louder.\n\n<b>                          LEONARD\n</b>                Multi-legged...\n\n     Leonard raises his baton in top MTA form.\n\n<b>                          LEONARD\n</b>                Maggot-munchin' motherfu...\n\n     THUD!  Several Mimcs slam onto Leonard!\n\n     Leonard goes down, HITTING them futilely with his baton.\n\n     They begin to tear at his limbs.\n\n     Leonard rolls...\n\n     ...kicks his good leg out...\n\n     ...and CONNECTS WITH THE THIRD RAIL.\n\n     AN ARC of ELECTRICITY lights up the darkness, consuming\n     Leonard and the Mimics.\n\n<b>     INT. BY THE CAGE ELEVATOR\n</b>\n     The crackling sound echoes through to Peter and Susan.\n\n     Susan hits the elevator button again.\n\n<b>                          SUSAN\n</b>                I can't tell if it's working!\n\n     Peter has unbarred the gate.\n\n<b>     SUSAN\n</b>\n     looks up, into the shaft.\n\n<b>     THE ELEVATOR\n</b>\n     coming down, but it's taking its own sweet time.\n\n<b>                          SUSAN\n</b>                Oh, come on, come on!\n\n<b>                          PETER\n</b>                Jump in.\n\n     Peter pulls her into the shaft, closes the security gate\n     behind them.\n\n<b>     INT. SHAFT\n</b>\n     A skeletal framework on each side.  Just enough for a\n     handhold.\n\n     Peter steadies Susan as she climbs in beside him.  She\n     balances on the narrow ledge.\n\n     Peter SLAMS the cage door shut, latching it.\n\n<b>                          PETER\n</b>                You go first. I'll be right below you.\n\n<b>                          SUSAN\n</b>                Your arm, you can't...\n\n<b>                          PETER\n</b>                I can.  We can do this...\n\n     He shows her the first hand and foothold.  Susan grabs on.\n\n<b>     INT. SUBWAY TUNNEL\n</b>\n     The Albino amkes its way forward, flanked by two Mimics.\n\n     It stops.\n\n     Turns toward the elevator.\n\n<b>     INT. SHAFT\n</b>\n     Susan hauls herself up the framework, handhold by\n     handhold. Peter is right below her.\n\n     She can see his arms are starting to tremble dangerously\n     with the effort.\n\n<b>                          SUSAN\n</b>                We're gonna make it!\n\n     Peter grinds his teeth, trying to make the next\n     handhold.\n\n     WHAM!  Something hits the gate below them!\n\n<b>     INT. BY THE ELEVATOR GATE\n</b>\n     The Mimics are tearing at the metal gate.\n\n     The Albino remains still, watching them work.\n\n<b>     PETER AND SUSAN\n</b>\n     Susan's arm and legs are shaking now.  Her breath starts\n     catching in her throat with the effort.\n\n<b>                          PETER\n</b>                Don't hold your breath!  Keep it going,\n                even flow!\n\n     Susan tried, but can't.  She tries to pull herself up to the\n     next level.\n\n<b>                          PETER\n</b>                C'mon...\n\n<b>                          SUSAN\n</b>                Ah...\n\n<b>                          PETER\n</b>                Talk to me.\n\n<b>                          SUSAN\n</b>                Peter...\n\n     Susan pulls herself up.\n\n<b>                          SUSUAN\n</b>                I'm really glad I'm not pregnant.\n\n<b>     REVERSE\n</b>\n     We look down past them as they climb.  Two of the Mimics and\n     the Albino have gotten into the shaft!\n\n     The Albino is so long it climbs by bracing its legs against\n     opposite walls.\n\n<b>     SUSAN AND PETER\n</b>\n     Susan is crying, barely any strength left.\n\n     Peter does his best to stay in control, but in truth is\n     barely hanging on himself.\n\n     LIGHT hits them from the shaft above now, SOUNDS of PEOPLE\n     TALKING and a muffled P.A. ANNOUNCEMENT filter down.\n\n<b>     MIMICS\n</b>\n     rushing upward on the shaft wall, higher, higher.\n\n<b>     INT. ELEVATOR SHAFT\n</b>\n     Peter's hands grab onto the grating of the gate on the next\n     floor.\n\n     KCHUNK! is heard above them.  Peter looks up.\n\n     Now the elevator is coming down.\n\n<b>                          PETER\n</b>                Hang onto me.\n\n     Peter pulls Susan up till she can grab it too, both of them\n     able to get a foothold on the ledge-\n\n<b>                          PETER\n</b>                Hang on tight!\n\n     He begins to KICK on the gate, trying to tear it free.  Susan\n     looks back down.\n\n<b>     SUSAN'S POV - SHAFT\n</b>\n     The Mimics rush up, closer, closer.  The Albino opens its\n     mandibles.\n\n<b>     SUSAN AND PETER\n</b>\n     both KICK at the gate, it gives, Peter pulls Susan through\n     to the\n\n<b>     INT. SUBWAY TRACK\n</b>\n<b>                          PETER\n</b>                Come on!\n\n     Peter and Susan stumble away.\n\n<b>     INT. ELEVATOR SHAFT\n</b>\n     The Albino sees the elevator approaching from above.\n\n     It gives a few CLICKS to its minions.\n\n     The two other Mimics race up the shaft...\n\n     ...toward the elevator...\n\n     ...and WEDGE THEMSELVES IN ON EITHER SIDE!\n\n     They are CRUSHED instantly.  But the elevator is stopped just\n     above the open gate.\n\n     With just enough room for the Albino to get through to\n\n<b>     INT. SUBWAY TRACKS\n</b>\n     Susan and Peter run.  There is LIGHT just up the tunnel.  We\n     hear VOICES.\n\n<b>                          SUSAN\n</b>                Don't look back!\n\n     They go for it.  At last, they make it to\n\n<b>     INT. A PLATFORM\n</b>\n     Susan and Peter stumble forward.  Light streams down from\n     overheads. Susan turns.\n\n<b>     SUSAN'S POV\n</b>\n     The Albino spills out onto the track behind them.\n\n     Sleek, streamlined, light glancing beautifully off it.\n\n<b>     SUSAN AND PETER\n</b>\n     turn back...\n\n     HEADLIGHTS hit them as we hear the ROAR of a SUBWAY TRAIN\n     heading at them from the other side of the platform!\n\n<b>                          SUSAN\n</b>                No...\n\n<b>                          PETER\n</b>                We can do it!\n\n     They run.\n\n<b>     ALBINO\n</b>\n     runs, faster than any other Mimic.\n\n<b>     TRAIN\n</b>\n     The express train BLOWS its HORN, RUSHING FORWARD.\n\n<b>     PLATFORM - COMMUTERS\n</b>\n     Weary late-night COMMUTERS stand half-asleep on the tracks.\n     A sleepy-eyed little girl points, tugging on her mother's\n     hand.\n\n<b>                          LITTLE GIRL\n</b>                Mommy, there's people...\n\n<b>     PETER AND SUSAN\n</b>\n<b>                          PETER\n</b>                     (Adrenaline pumping)\n                We-can-do-this!!!\n\n<b>     MOTORMAN\n</b>\n     The driver sees the battered couple...\n\n     He reaches for the brake...\n\n<b>     SUSAN AND PETER\n</b>\n     They reach the edge of the platform, the HORN deafening as\n     the train speeds toward them.  Peter pushes Susan up, leaps-\n\n<b>     INT. TRAIN - CONDUCTOR\n</b>\n     We RUSH toward his horrified face.\n\n<b>     THE ALBINO\n</b>\n     directly ahead.\n\n     The train, still flying, PLOWS INTO IT...\n\n     ...flattening, grinding, pulverizing...\n\n     ...until the windshield of the subway car is covered in white\n     blood.\n\n     The motoran leans on the brake, his eyes screwed shut in\n     primal horror. The train SQUEALS to a stop...\n\n<b>     ON THE PLATFORM\n</b>\n     Susan and Peter collapse on the cement floor in each others\n     arms.  Heaving and weeping.\n\n<b>     INT. GRAND CENTRAL STATION - NIGHT\n</b>\n     COMMUTERS turn to stare as Peter and Susan move across\n     the floor.  Both bruised and bloodied, leaning against\n     each other, heading for the exit.\n\n     Some DERELICTS observe them with curiosity.\n\n     A trio of MTA cops start towards them.\n\n<b>                          PETER\n</b>                It'll be fine... it... They're still\n                down there. We'll seal the whole\n                system, go in with whatever it\n                takes...\n\n     But Peter's voice evidences a lack of conviction now,\n     he's trying to convince both Susan and himself of\n     something he doesn't fully believe.\n\n<b>                          PETER\n</b>                It'll be fine... We nailed them\n                before, we'll do it again...\n\n     He hurries to meet the MTA cops. Susan looks up.\n\n<b>     SUSAN'S POV\n</b>\n     Commuters move to and fro, moving up and down and in and\n     out of the illuminated areas of the station.\n\n     In the crush of onlookers is one deadpan face-  a MIMIC,\n     hugging the shadows, waiting for its moment!\n\n     We PAN 180 degrees to the other side of the platform-\n     there, briefly glimpsed is ANOTHER, and ANOTHER.\n\n     We TILT down to the throng below.\n\n<b>                          SUSAN\n</b>                     (barely audible)\n                They've come up...\n\n     The electrified VOICE of the train ANNOUNCER suddenly\n     FADES UP, telling of departures and delays-\n\n     We raise above Susan's head-\n\n<b>                          TRAIN ANNOUNCER\n</b>                The 11:16 local to Poughkeepsie,\n                boarding now, Track 32- the 7:20\n                Connecticut local, making\n                connections to South Norwalk-\n\n<b>     DOWN ANGLE\n</b>\n     -culminating in an OVERHEAD VIEW of the main terminal.\n\n     The movement continues. But from here, the people are\n     dots, their importanec no greater than that of a colony\n     of ants.\n\n<b>                                                          FADE OUT:\n</b>\n<b>                                            LOS ANGELES, JUNE-19-96\n</b>\n\n\n\n\n\n   </pre>\n\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Mimic</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Matt Greenberg\" title=\"Scripts by Matt Greenberg\">Matt Greenberg</a>  <a href=\"/writer.php?w=Guillermo del Toro\" title=\"Scripts by Guillermo del Toro\">Guillermo del Toro</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Mimic Script.html#comments\" title=\"Mimic comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:11:40.292172"}