{"title": "Misery", "film_link": "/Movie Scripts/Misery Script.html", "script_link": "/scripts/Misery.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Misery Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Misery Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (10.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=William Goldman\" title=\"Scripts by William Goldman\">William Goldman</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<br/>\n<a href=\"/scripts/Misery.html\">Read \"Misery\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre><title>Misery - by William Goldman\n</title>\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n\n<pre>\n<b>                                         \"MISERY\"\n</b>\n                                            by\n\n                                     William Goldman\n\n                                  Based on the Novel by\n\n                                       Stephen King\n\n<b>                \n</b>\n<b>               FADE IN ON:\n</b>\n               A SINGLE CIGARETTE. A MATCH. A HOTEL ICE BUCKET that holds a \n               bottle of champagne. The cigarette is unlit. The match is of \n               the kitchen variety. The champagne, unopened, is Dom Perignon. \n               There is only one sound at first: a strong WIND--\n\n               --now another sound, sharper--a sudden burst of TYPING as we\n\n<b>               PULL BACK TO REVEAL\n</b>\n               PAUL SHELDON typing at a table in his hotel suite. It's really \n               a cabin that's part of a lodge. Not an ornate place. Western \n               themed.\n\n               He is framed by a window looking out at some gorgeous \n               mountains. It's afternoon. The sky is grey. Snow is scattered \n               along the ground. We're out west somewhere. The WIND grows \n               stronger--there could be a storm.\n\n               PAUL pays no attention to what's going on outside as he \n               continues to type.\n\n               He's the hero of what follows. Forty-two, he's got a good \n               face, one with a certain mileage to it. We are not, in other \n               words, looking at a virgin. He's been a novelist for eighteen \n               years and for half that time, the most recent half, a \n               remarkably successful one.\n\n               He pauses for a moment, intently, as if trying to stare a \n               hole in the paper. Now his fingers fly, and there's another \n               burst of TYPING. He studies what he's written, then--\n\n<b>                                                                    CUT TO:\n</b>\n               THE PAPER, as he rolls it out of the machine, puts it on the \n               table, prints, in almost childlike letters, these words:\n\n<b>                                         THE END\n</b>\n<b>                                                                    CUT TO:\n</b>\n               A PILE OF MANUSCRIPT at the rear of the table. He puts this \n               last page on, gets it straight and in order, hoists it up, \n               folds it to his chest, the entire manuscript--hundreds of \n               pages.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, as he holds his book to him. He is, just for a brief \n               moment, moved.\n\n<b>                                                                    CUT TO:\n</b>\n               A SUITCASE across the room. PAUL goes to it, opens it and \n               pulls something out from inside: a battered red leather \n               briefcase. Now he takes his manuscript, carefully opens the \n               briefcase, gently puts the manuscript inside. He closes it, \n               and the way he handles it, he might almost be handling a \n               child. Now he crosses over, opens the champagne, pours himself \n               a single glass, lights the one cigarette with the lone match--\n               there is a distinct feeling of ritual about this. He inhales \n               deeply, makes a toasting gesture, then drinks, smokes, smiles.\n\n               HOLD BRIEFLY, then--\n\n<b>                                                                    CUT TO:\n</b>\n<b>               LODGE - DAY\n</b>\n               PAUL--exiting his cabin. He stops, makes a snowball, throws \n               it, hitting a sign.\n\n<b>                                     PAUL\n</b>                         Still got it.\n\n               He throws a suitcase into the trunk of his '65 MUSTANG and, \n               holding his leather case, he hops into the car and drives \n               away.\n\n<b>                                                                    CUT TO:\n</b>\n               A SIGN that reads \"Silver Creek Lodge.\" Behind the sign is \n               the hotel itself--old, desolate. Now the '65 Mustang comes \n               out of the garage, guns ahead toward the sign. As \"Shotgun\" \n               by Jr. Walker and the Allstars starts, he heads off into the \n               mountains.\n\n<b>                                                                    CUT TO:\n</b>\n               THE SKY. Gun-metal grey. The clouds seem pregnant with snow.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, driving the Mustang, the battered briefcase on the \n               seat beside him.\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROAD AHEAD. Little dainty flakes of snow are suddenly \n               visible.\n\n<b>                                                                    CUT TO:\n</b>\n               THE CAR, going into a curve and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, driving, and as he comes out of the curve, a stunned \n               look hits his face as we\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROAD AHEAD--and here it comes--a mountain storm; it's as \n               if the top has been pulled off the sky and with no warning \n               whatsoever, we're into a blizzard and\n\n<b>                                                                    CUT TO:\n</b>\n               THE MUSTANG, slowing, driving deeper into the mountains.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, squinting ahead, windshield wipers on now.\n\n<b>                                                                    CUT TO:\n</b>\n               THE MUSTANG, rounding another curve, losing traction--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, a skilled driver, bringing the car easily under control.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE ROAD\n</b>\n               Snow is piling up.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL driving confidently, carefully. Now he reaches out, \n               ejects the tape, expertly turns it over, pushes it in and, \n               as the MUSIC continues, he hums along with it.\n\n<b>                                                                    CUT TO:\n</b>\n               THE SKY. Only you can't see it.\n\n               There's nothing to see  but the unending snow, nothing to \n               hear but the wind which keeps getting wilder.\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROAD. Inches of snow on the ground now. This is desolate \n               and dangerous.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, driving.\n\n<b>                                                                    CUT TO:\n</b>\n               THE SNOW. Worse.\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROAD, curving sharply, drop ping. A sign reads: \"Curved \n               Road, Next 13 Miles.\"\n\n<b>                                                                    CUT TO:\n</b>\n               THE MUSTANG, coming into view, hitting the curve--no problem--\n               no problem at all--and then suddenly, there is a very serious \n               problem and as the car skids out of control--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, doing his best, fighting the conditions and just as it \n               looks like he's got things going his way--\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROAD, swerving down and\n\n<b>                                                                    CUT TO:\n</b>\n               THE MUSTANG, all traction gone and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, helpless and\n\n<b>                                                                    CUT TO:\n</b>\n               THE MUSTANG, skidding, skidding and\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROAD as it drops more steeply away and the wind whips \n               the snow across and\n\n<b>                                                                    CUT TO:\n</b>\n               THE MUSTANG starting to spin and\n\n<b>                                                                    CUT TO:\n</b>\n               THE MOUNTAINSIDE as the car skids off the road, careens down, \n               slams into a tree, bounces off, flips, lands upside down, \n               skids, stops finally, dead.\n\n<b>               HOLD ON THE CAR A MOMENT\n</b>\n               There is still the sound of the WIND, and there is still the \n               music coming from the tape, perhaps the only part of the car \n               left undamaged. Nothing moves inside. There is only the WIND \n               and the TAPE. The wind gets louder.\n\n<b>                                                                    CUT TO:\n</b>\n               THE WRECK looked at from a distance. The MUSIC sounds are \n               only faintly heard.\n\n<b>                                                                    CUT TO:\n</b>\n               THE AREA WHERE THE WRECK IS--AS SEEN FROM THE ROAD. The car \n               is barely visible as the snow begins to cover it.\n\n<b>                                                                    CUT TO:\n</b>\n               THE WRECK from outside, and we're close to it now, with the \n               snow coming down ever harder--already bits of the car are \n               covered in white.\n\n<b>               CAMERA MOVES IN TO\n</b>\n               PAUL. He's inside and doing his best to fight is, but his \n               consciousness is going. He tries to keep his eyes open but \n               they're slits.\n\n               Slowly, he manages to reach out with his left arm for his \n               briefcase--\n\n               --and he clutches it to his battered body. The MUSIC continues \n               on.\n\n               But PAUL is far from listening. His eyes flutter, flutter \n               again. Now they're starting to close.\n\n               The man is dying.\n\n               Motionless, he still clutches the battered briefcase.\n\n               HOLD ON THE CASE. Then--\n\n<b>                                                               DISSOLVE TO:\n</b>\n               The BRIEFCASE in Paul's hands as he sits at a desk.\n\n<b>                                     SINDELL (O.S.)\n</b>                         What's that?\n\n<b>               PULL BACK TO REVEAL\n</b>\n               We are in New York City in the office of Paul's literary \n               agent, MARCIA SINDELL. The walls of the large room are \n               absolutely crammed with book and movie posters, in English \n               and all other kinds of other languages, all of them featuring \n               the character of MISERY CHASTAIN, a perfectly beautiful woman. \n               Misery's Challenge, Misery's Triumph--eight of them. All \n               written by Paul Sheldon.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, lifting up the battered briefcase--maybe when new it \n               cost two bucks, but he treats it like gold.\n\n<b>                                     PAUL\n</b>                         An old friend. I was rummaging through \n                         a closet and it was just sitting \n                         there. Like it was waiting for me.\n\n<b>                                                                    CUT TO:\n</b>\n<b>                                     SINDELL\n</b>                              (searching for a \n                              compliment)\n                         It's... it's nice, Paul. It's got... \n                         character.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE TWO OF THEM\n</b>\n<b>                                     PAUL\n</b>                         When I wrote my first book, I used \n                         to carry it around in this while I \n                         was looking for a publisher. That \n                         was a good book, Marcia. I was a \n                         writer then.\n\n<b>                                     SINDELL\n</b>                         You're still a writer.\n\n<b>                                     PAUL\n</b>                         I haven't been a writer since I got\n                         into the Misery business--\n\n<b>                                     SINDELL\n</b>                              (holding up the cover \n                              art of MISERY'S CHILD)\n                         Not a bad business. This thing would \n                         still be growing, too. The first \n                         printing order on Misery's Child was\n                         the most ever--over a million.\n\n<b>                                     PAUL\n</b>                         Marcia, please.\n\n<b>                                     SINDELL\n</b>                         No, no. Misery Chastain put braces \n                         on your daughter's teeth and is \n                         putting her through college, bought \n                         you two houses and floor seats to \n                         the Knick games and what thanks does \n                         she get? You go and kill her.\n\n<b>                                     PAUL\n</b>                         Marcia, you know I started \"Misery\" \n                         on a lark. Do I look like a guy who \n                         writes romance novels? Do I sound \n                         like Danielle Steel? It was a one-\n                         time shot and we got lucky. I never \n                         meant it to become my life. And if I \n                         hadn't gotten rid of her now, I'd \n                         have ended up writing her forever.\n                              (touches his briefcase)\n                         For the first time in fifteen years, \n                         I think I'm really onto something \n                         here.\n\n<b>                                     SINDELL\n</b>                         I'm glad to hear that, Paul, I really \n                         am. But you have to know--when your \n                         fans find out that you killed off \n                         their favorite heroine, they're not \n                         going to say, \"Ooh, good, Paul Sheldon \n                         can finally write what we've always \n                         wanted: An esoteric, semi-\n                         autobiographical character study.\n\n<b>                                     PAUL\n</b>                              (passionately)\n                         Marcia, why are you doing this to \n                         me? Don't you know I'm scared enough? \n                         Don't you think I remember how nobody \n                         gave a shit about my first books? \n                         You think I'm dying to go back to \n                         shouting in the wilderness?\n                              (beat)\n                         I'm doing this because I have to.\n                              (Marcia is stopped)\n                         Now, I'm leaving for Colorado to try \n                         to finish this and I want your good \n                         thoughts--because if I can make it \n                         work ...\n                              (beat)\n                         I might just have something that I \n                         want on my tombstone.\n\n               On the word \"tombstone\"\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL'S TOMBSTONE--the upside down car with the blizzard coming \n               gale-force and his motionless body trapped inside the car.\n\n               The WIND screams. PAUL'S EYES flutter, then close.\n\n               Hold\n\n               Keep holding as--\n\n               Suddenly there's a new sound as a crowbar SCRATCHES at the \n               door--\n\n               -- nd now the door is ripped open as we\n\n<b>               PULL BACK TO REVEAL\n</b>\n               A BUNDLED-UP FIGURE gently beginning to pull PAUL and the \n               case from the car. For a moment, it's hard to tell if it's a \n               man or woman--\n\n               --not to let the cat out of the bag or anything, but it is, \n               very much, a woman. Her name is ANNIE WILKES and she is close \n               to Paul's age. She is in many ways a remarkable creature. \n               Strong, self-sufficient, passionate in her likes and dislikes, \n               loves and hates.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL AND ANNIE as she cradles him in her arms. Once he's \n               clear of the car, she lays him carefully in the snow\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL AND ANNIE: CLOSE UP. She slowly brings her mouth down \n               close to his. Then their lips touch as she forces air inside \n               him.\n\n<b>                                     ANNIE\n</b>                              (Their lips touch \n                              again. Then--)\n                         You hear me--Breathe! I said \n                         breathe!!!\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, as he starts to breathe--\n\n               --in a moment his eyes suddenly open wide, but he's in shock, \n               the eyes see nothing--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE--the moment she sees him come to life, she goes into \n               action, lifting PAUL in a fireman's carry, starting the \n               difficult climb back up the steep hill.\n\n               As she moves away, she and Paul are obliterated by the white \n               falling snow.\n\n<b>                                                               DISSOLVE TO:\n</b>\n               THE WHITE OF WHAT SEEMS LIKE A HOSPITAL. Everything is bled \n               of color. It's all vague--\n\n               --we are looking at this from Paul's blurred vision.\n\n               And throughout this next sequence, there are these SOUNDS, \n               words really, but they make no sense.\n\n               \"...no... worry...\n\n               ...be... fine...\n\n               ...good care... you...\n\n               ...I'm your number one fan...\"\n\n               The first thing we see during this is something all white. \n               It takes a moment before we realize it's a ceiling.\n\n               Now, a white wall.\n\n               An I.V. bottle is next, the medicine dripping down a tube \n               into PAUL'S LEFT ARM. The other arm is bandaged and in a \n               sling.\n\n               ANNIE is standing beside the bed. She wears off-white and \n               seems very much like a nurse. A good nurse. She has pills in \n               her hands.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. Motionless, dead pale. He has a little beard now. Eyes \n               barely open, he's shaking with fever.\n\n<b>                                     PAUL\n</b>                              (hardly able to whisper)\n                         ...where... am I...?\n\n               ANNIE is quickly by his side.\n\n<b>                                     ANNIE\n</b>                              (so gently)\n                         Shhh... we're just outside Silver \n                         Creek.\n\n<b>                                     PAUL\n</b>                         How long...?\n\n<b>                                     ANNIE\n</b>                         You've been here two days. You're \n                         gonna be okay.\n                              (relieved)\n                         My name is Annie Wilkes and I'm--\n\n<b>                                     PAUL\n</b>                         --my number one fan.\n\n               And now the gibberish words make sense.\n\n<b>                                     ANNIE\n</b>                         That's right. I'm also a nurse. Here.\n                              (Now, as she brings \n                              the pills close)\n                         Take these.\n\n               She helps him to swallow, as Paul's eyes close.\n\n<b>                                                               DISSOLVE TO:\n</b>\n               AN EXTERIOR OF THE PLACE. It's a farmhouse--we 're in a \n               desolate area with mountains in the background.\n\n               THE HOUSE is set on a knoll so that Paul's room, although on \n               the first floor, is ten feet off the ground.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, in the room. He's not on the I.V. anymore. His fever \n               has broken. Annie enters, pills in her hand.\n\n<b>                                     ANNIE\n</b>                         Here.\n\n<b>                                     PAUL\n</b>                         What are they...?\n\n<b>                                     ANNIE\n</b>                         They're called Novril--they're for \n                         your pain.\n                              (helps him take them)\n\n               ANNIE applies a cool rag to his forehead.\n\n<b>                                     PAUL\n</b>                         Shouldn't I be in a hospital?\n\n<b>                                     ANNIE\n</b>                         The  blizzard was too strong. I \n                         couldn't risk trying to get you there. \n                         I tried calling, but the phone lines \n                         are down.\n\n               PAUL tries to test his left arm.\n\n<b>                                     ANNIE\n</b>                              (Gently, her fingers \n                              go to his eyelids, \n                              close them)\n                         Now you mustn't tire yourself. You've \n                         got to rest, you almost died.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE: CLOSE UP. Sometimes her face shows the most remarkable \n               compassion. It does now.\n\n               HOLD ON IT briefly.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               CLOSE UP ON PILLS IN ANNIE'S HAND\n</b>\n<b>                                     ANNIE (O.S.)\n</b>                         Open wide.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM\n</b>\n               He lies in bed. His fever is gone, but he's terribly weak.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE. As she lays the pills on PAUL'S TONGUE, she gives him \n               a glass of water from the nearby bed table.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, swallowing eagerly.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, watching him, sympathetically.\n\n<b>                                     ANNIE\n</b>                         Your legs just sing grand opera when \n                         you move, don't they?\n                              (Paul says nothing, \n                              but his pain is clear)\n                         It's not going to hurt forever, Paul, \n                         I promise you.\n\n<b>                                     PAUL\n</b>                         Will I be able to walk?\n\n<b>                                     ANNIE\n</b>                         Of course you will. And your arm \n                         will be fine, too. Your shoulder was \n                         dislocated pretty badly, but I finally \n                         popped it back in there.\n                              (proudly)\n                         But what I'm most proud of is the \n                         work I did on those legs. Considering \n                         what I had around the house, I don't \n                         think there's a doctor who could \n                         have done any better.\n\n               And now suddenly she flicks off the blankets, uncovering his \n               body.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring, stunned at the bottom half of his body as we\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL'S LEGS. From the knees down he resembles an Egyptian \n               mummy--she's splinted them with slim steel rods that look \n               like the hacksawed remains of aluminum crutches and there's \n               taping circling around.\n\n               From the kness up they're all swollen and throbbing and \n               horribly bruised and discolored.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, lying back, stunned with disbelief.\n\n<b>                                     ANNIE\n</b>                         It's not nearly as bad as it looks. \n                         You have a compound fracture of the \n                         tibia in both legs, and the fibula \n                         in the left leg is fractured too. I \n                         could hear the bones moving, so it's \n                         best for your legs to remain immobile. \n                         And as soon as the roads open, I'll \n                         take you to a hospital.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE: CLOSE UP\n</b>\n<b>                                     ANNIE\n</b>                         In the meantime, you've got a lot of \n                         recovering to do, and I consider it \n                         an honor that you'll do it in my \n                         home.\n\n               HOLD on her ecstatic face.\n\n               Then--\n\n<b>                                                                    CUT TO:\n</b>\n               MISERY'S PERFECT FACE. We're back in SINDELL's office in New \n               York. The office looks just the same, posters and manuscripts \n               all over. But she doesn't.\n\n               She holds the phone and she is fidgety, insecure.\n\n<b>                                     SINDELL\n</b>                         This is Marcia Sindell calling from \n                         New York City. I'd like to speak to \n                         the Silver Creek Chief of Police or \n                         the Sheriff.\n\n<b>                                     MALE VOICE (O.S.)\n</b>                         Which one do you want?\n\n<b>                                     SINDELL\n</b>                         Whichever one's not busy.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               SMALL OFFICE IN SILVER CREEK\n</b>\n               ...with a view of the mountains.\n\n               A MARVELOUS LOOKING MAN sits at a desk, by himself, holding \n               the phone. In his sixties, he's still as bright, fast and \n               sassy as he was half-a-lifetime ago. Never mind what his \n               name is, everyone calls him BUSTER.\n\n<b>                                     BUSTER\n</b>                         I'm pretty sure they 're both not \n                         busy, Ms. Sindell, since they're \n                         both me. I also happen to be President \n                         of the Policeman's Benefit \n                         Association, Chairman of the \n                         Patrolman's Retirement Fund, and if \n                         you need a good fishing guide, you \n                         could do a lot worse; call me Buster, \n                         everybody does, what can I do for \n                         you?\n\n<b>                                                                    CUT TO:\n</b>\n               SINDELL in her office. She pushes the speakerphone, gets up, \n               paces; she's very hesitant when she speaks about Paul. Almost \n               embarrassed--\n\n<b>                                     SINDELL\n</b>                         I'm a literary agent, and I feel \n                         like a fool calling you, but I think \n                         one of my clients, Paul Sheldon, \n                         might be in some kind of trouble.\n\n<b>                                     BUSTER\n</b>                         Paul Sheldon? You mean Paul Sheldon \n                         the writer?\n\n<b>                                     SINDELL\n</b>                         Yes.\n\n<b>                                     BUSTER\n</b>                         He's your client, huh?\n\n<b>                                     SINDELL\n</b>                         Yes, he is.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               BUSTER'S OFFICE\n</b>\n               He rolls a penny across the back of one hand--he's very good \n               at it, doesn't even look while he does it.\n\n<b>                                     BUSTER\n</b>                         People sure like those Misery books.\n\n<b>                                     SINDELL\n</b>                         I'm sure you know Paul's been going \n                         to the Silver Creek Lodge for years \n                         to finish his books.\n\n<b>                                     BUSTER\n</b>                         Yeah, I understand he's been up here \n                         the last six weeks.\n\n<b>                                     SINDELL\n</b>                         Not quite. I just called, and they \n                         said he checked out five days ago. \n                         Isn't that a little strange?\n\n<b>                                     BUSTER\n</b>                         I don't know. Does he always phone \n                         you when he checks out of hotels?\n\n<b>                                                                    CUT TO:\n</b>\n               SINDELL, really embarrassed now.\n\n<b>                                     SINDELL\n</b>                         No, no, of course not. It's just \n                         that his daughter hasn't heard from \n                         him, and when he's got a book coming \n                         out, he usually keeps in touch. So \n                         when there was no word from him...\n\n<b>                                     BUSTER\n</b>                         You think he might be missing?\n\n<b>                                     SINDELL\n</b>                              (shakes her head)\n                         I hate that I made this call--tell \n                         me I'm being silly.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. He nods as a WOMAN enters, carrying lunch. It's his \n               wife, VIRGINIA. She begins putting the food down on a table \n               for the both of them.\n\n<b>                                     BUSTER\n</b>                         Just a little over-protective, maybe.\n                              (beat)\n                         Tell you what--nothing's been reported \n                         out here--\n                              (he puts Paul Sheldon's \n                              name with a ? on a 3 \n                              x 5 CARD)\n                         --but I'll put his name through our \n                         system.\n                              (he tacks the card to \n                              a bulletin board)\n                         And if anything turns up, I'll call \n                         you right away.\n\n<b>                                                                    CUT TO:\n</b>\n               SINDELL. She smiles, a genuine sense of relief.\n\n<b>                                     SINDELL\n</b>                         I appreciate that. Thanks a lot.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               BUSTER\n</b>\n<b>                                     BUSTER\n</b>                         G'bye, Ms. Sindell.\n\n               As he hangs up--\n\n<b>                                     VIRGINIA\n</b>                         We actually got a phone call. Busy \n                         morning.\n\n<b>                                     BUSTER\n</b>                              (smiles)\n                         Work, work, work.\n                              (gives her a hug)\n                         Virginia? When was that blizzard?\n\n<b>                                     VIRGINIA\n</b>                         Four or five days ago. Why?\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. The penny flies across the back of his hand. He \n               doesn't look at it, stares instead out the window at the \n               mountains.\n\n<b>                                     BUSTER\n</b>                              (a beat)\n                         ...no reason...\n\n               HOLD ON BUSTER for a moment.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM\n</b>\n<b>                                     PAUL'S VOICE\n</b>                              (soft)\n                         I guess it was kind of a miracle... \n                         you finding me...\n\n               ANNIE's soft, sweet laughter is heard. She stands over him, \n               finishing shaving him with a very sharp straight razor. She \n               wears what we will come to know as her regular costume--plain \n               wool skirts, grey cardigan sweaters.\n\n<b>                                     ANNIE\n</b>                         No, it wasn't a miracle at all... in \n                         a way, I was following you.\n\n<b>                                     PAUL\n</b>                         Following me?\n\n               ANNIE concentrates on shaving him with great care; she has \n               wonderful, strong hands.\n\n<b>                                     ANNIE\n</b>                              (explaining, normally)\n                         Well, it wasn't any secret to me \n                         that you were staying at the Silver \n                         Creek, seeing as how I'm your number-\n                         one fan and all. Some nights I'd \n                         just tool on down there, sit outside \n                         and look up at the light in your \n                         cabin--\n                              (gently moves his \n                              head back, exposing \n                              his neck; this next \n                              is said with total \n                              sincerity, almost \n                              awe)\n                         and I'd try to imagine what was going \n                         on in the room of the world's greatest \n                         writer.\n\n<b>                                     PAUL\n</b>                         Say that last part again, I didn't \n                         quite hear--\n\n<b>                                     ANNIE\n</b>                              (smiles)\n                         Don't move now--wouldn't want to \n                         hurt this neck--\n                              (shaving away)\n                         Well, the other afternoon I was on \n                         my way home, and there you were, \n                         leaving the Lodge, and I wondered \n                         why a literary genius would go for a \n                         drive when there was a big storm \n                         coming.\n\n<b>                                     PAUL\n</b>                         I didn't know it was going to be a \n                         big storm.\n\n<b>                                     ANNIE\n</b>                         Lucky for you, I did.\n                              (pauses)\n                         Lucky for me too. Because now you're \n                         alive and you can write more books. \n                         Oh, Paul, I've read everything of \n                         Yours, but the Misery novels...\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE: CLOSE UP\n</b>\n<b>                                     ANNIE\n</b>                         I know them all by heart, Paul, all \n                         eight of them. I love them so.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, looking at her. There's something terribly touching \n               about her now.\n\n<b>                                     PAUL\n</b>                         You're very kind...\n\n<b>                                     ANNIE\n</b>                         And you're very brilliant, and you \n                         must be a good man, or you could \n                         never have created such a wondrous, \n                         loving creature as Misery Chastain.\n                              (runs her fingers \n                              over his cheek)\n                         Like a baby.\n                              (smiles)\n                         All done.\n                              (starts to dab away \n                              the last bits of \n                              soap)\n\n               ANNIE starts cleaning up.\n\n<b>                                     PAUL\n</b>                         When do you think the phone lines'll \n                         be back up? I have to call my \n                         daughter, and I should call New York \n                         and let my agent know I'm breathing.\n\n<b>                                     ANNIE\n</b>                         It shouldn't be too much longer.\n                              (gently)\n                         Once the roads are open, the lines'll \n                         be up in no time. If you give me \n                         their numbers, I'll keep trying them \n                         for you.\n                              (suddenly almost \n                              embarrassed)\n                         Could I ask you a favor?\n                              (Paul nods)\n                         I noticed in your case there was a \n                         new Paul Sheldon book and...\n                              (hesitant)\n                         and I wondered if maybe...\n                              (her voice trails off)\n\n<b>                                     PAUL\n</b>                         You want to read it?\n\n<b>                                     ANNIE\n</b>                              (quietly)\n                         If you wouldn't mind.\n\n<b>                                     PAUL\n</b>                         I have a hard and fast rule about \n                         who can read my stuff at this early \n                         stage--only my editor, my agent, and \n                         anyone who saves me from freezing to \n                         death in a car wreck.\n\n<b>                                     ANNIE\n</b>                              (genuinely thrilled)\n                         You'll never realize what a rare \n                         treat you've given me.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. His eyes close briefly, he grimaces.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, watching him, concerned. She glances at her watch.\n\n<b>                                     ANNIE\n</b>                         Boy, it's like clockwork, the way \n                         your pain comes--I'll get you your \n                         Novril, Paul. Forgive me for prattling \n                         away and making you feel all oogy.\n\n               She turns and goes out of the room.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, watching her.\n\n<b>                                     ANNIE\n</b>                         What's your new book called?\n\n<b>                                     PAUL\n</b>                         I don't have a title yet.\n\n<b>                                     ANNIE\n</b>                         What's it about?\n\n<b>                                     PAUL\n</b>                              (fast)\n                         It's crazy, but I don't really know, \n                         I mean I haven't written anything \n                         but \"Misery\" for so long that--you \n                         read it you can tell me what you \n                         think it's about. Maybe you can come \n                         up with a title.\n\n<b>                                     ANNIE\n</b>                              (in the doorway)\n                         Oh, like I could do that?\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE MANAGER'S OFFICE AT THE SILVER CREEK LODGE\n</b>\n               Small, neat, one window--outside, snow covers all.\n\n               BUSTER AND LIBBY, THE MANAGER, are going over books and \n               records. Libby is an old guy, walks with a cane.\n\n<b>                                     LIBBY\n</b>                         Nothing unusual about Mr. Sheldon's \n                         leaving, Buster--you can tell by the \n                         champagne.\n\n<b>                                     BUSTER\n</b>                         Maybe you can, Libby.\n\n<b>                                     LIBBY\n</b>                         No, see, he always ordered a bottle \n                         of Dom Perignon when he was ready to \n                         go. Then he'd pay up and be out the\n                         door.\n\n<b>                                     BUSTER\n</b>                         No long-distance phone calls, Federal \n                         Express packages--anything at all \n                         out of the ordinary?\n\n<b>                                     LIBBY\n</b>                              (head shake)\n                         I don't think Mr. Sheldon likes for \n                         things to be out of the ordinary. \n                         Considering who he is and all, famous \n                         and all, he doesn't have airs. Drives \n                         the same car out from New York each \n                         time--'65 Mustang--said it helps him \n                         think. He was always a good guest, \n                         never made a noise, never bothered a \n                         soul. Sure hope nothing happened to \n                         him.\n\n<b>                                     BUSTER\n</b>                         So do I...\n\n<b>                                     LIBBY\n</b>                         I'll bet that old Mustang's pulling \n                         into New York right now.\n\n<b>                                     BUSTER\n</b>                         I'm sure you're right.\n\n               But you can tell he's not sure at all as we\n\n<b>                                                                    CUT TO:\n</b>\n<b>               A SPOON FILLED TO THE BRIM WITH BEEF BARLEY SOUP\n</b>\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM.\n</b>\n               He lies in bed. Sun comes in the lone window. ANNIE sits on \n               the bed, a large bowl of soup in her hands, feeding him.\n\n<b>                                     ANNIE\n</b>                              (almost shy about \n                              this)\n                         I know I'm only forty pages into \n                         your book, but...\n\n               She stops, fills the spoon up again.\n\n<b>                                     PAUL\n</b>                         But what?\n\n<b>                                     ANNIE\n</b>                         Nothing.\n\n<b>                                     PAUL\n</b>                         No, what is it?\n\n<b>                                     ANNIE\n</b>                         Oh, it's ridiculous, who am I to \n                         make a criticism to someone like \n                         you?\n\n<b>                                     PAUL\n</b>                         I can take it, go ahead.\n\n<b>                                     ANNIE\n</b>                         Well, it's brilliantly written, but \n                         then everything you write is \n                         brilliant.\n\n<b>                                     PAUL\n</b>                         Pretty rough so far.\n\n<b>                                     ANNIE\n</b>                              (a burst)\n                         The swearing, Paul.\n                              (beat)\n                         There, I said it.\n\n<b>                                     PAUL\n</b>                         The profanity bothers you?\n\n<b>                                     ANNIE\n</b>                         It has no nobility.\n\n<b>                                     PAUL\n</b>                         Well, these are slum kids, I was a \n                         slum kid, everybody talks like that.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE. She holds the soup bowl in one hand, the muddy-colored \n               beef barley soup close to spilling.\n\n<b>                                     ANNIE\n</b>                         They do not. What do you think I say \n                         when I go to the feed store in town?\n                         \"Now, Wally, give me a bag of that \n                         effing pigfeed and ten pounds of \n                         that bitchly cow-corn\"--\n\n               PAUL is amused by this.\n\n<b>                                                                    CUT TO:\n</b>\n               THE SOUP, almost spilling as she gets more agitated.\n\n<b>                                     ANNIE\n</b>                         --and in the bank do I tell Mrs. \n                         Bollinger, \"Here's one big bastard \n                         of a check, give me some of your \n                         Christing money.\"\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, almost laughing as some soup hits the coverlet.\n\n<b>                                     ANNIE\n</b>                              (seeing the spill, \n                              suddenly upset)\n                         There! Look there! See what you made \n                         me do!\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL--his smile disappears.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, and she is just totally embarrassed.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul, I'm sorry. I'm so sorry. \n                         Sometimes I get so worked up. Can \n                         you ever forgive me? Here...\n\n               She hands him his pills and starts to clean the soup off the \n               coverlet. Then she makes the sweetest smile.\n\n<b>                                     ANNIE\n</b>                         I love you, Paul.\n                              (more embarrassed \n                              than ever)\n                         Your mind. Your creativity--that's \n                         all I meant.\n\n               Flustered, she turns away as we--\n\n<b>                                                                    CUT TO:\n</b>\n               A ROAD IN THE MOUNTAINS. Piles of snow all around but it's \n               been ploughed enough so it's driveable.\n\n<b>                                                                    CUT TO:\n</b>\n               A CAR coming into view. Up ahead is the sign we've already \n               seen: \"Curved Road, Next 13 Miles.\"\n\n<b>                                                                    CUT TO:\n</b>\n<b>               INSIDE THE CAR\n</b>\n               BUSTER AND HIS WIFE VIRGINIA: Virginia is driving while Buster \n               intently studies the terrain. He reaches for a large thermos, \n               pours some coffee, offers it to her. She shakes her head. He \n               begins to sip it.\n\n<b>                                     VIRGINIA\n</b>                         This sure is fun.\n\n               She puts her hand on his leg.\n\n<b>                                     BUSTER\n</b>                              (removing it)\n                         Virginia, when you're in this car, \n                         you're not my wife, you're my deputy.\n\n<b>                                     VIRGINIA\n</b>                         Well, this deputy would rather be \n                         home under the covers with the \n                         Sheriff.\n\n<b>                                                                    CUT TO:\n</b>\n               THE CAR. Suddenly, it goes into a little icy spin--she fights \n               it back under control.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               INSIDE THE CAR\n</b>\n<b>                                     BUSTER\n</b>                              (suddenly)\n                         Stop--stop right here.\n\n<b>                                     VIRGINIA\n</b>                         What? What is it?\n\n<b>                                                                    CUT TO:\n</b>\n               THE CAR, skidding, slowing, stopping. BOTH OF THEM get out, \n               go to the edge of the road. Mountains of snow. Nothing much \n               else visible. Then Buster points.\n\n<b>                                     BUSTER\n</b>                         Look at that broken branch there...\n\n<b>                                                                    CUT TO:\n</b>\n               VIRGINIA, seeing it, unconvinced.\n\n<b>                                     VIRGINIA\n</b>                         Could be the weight of the snow.\n\n<b>                                     BUSTER\n</b>                         Could be--or a rotten branch or a \n                         mountain lion could have landed on \n                         it. Could be a lot of things.\n\n               He steps off the road, starts down.\n\n<b>                                                                    CUT TO:\n</b>\n               VIRGINIA, watching him, worried--it's very slippery.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, graceful, in great shape, navigating down easily.\n\n<b>                                                                    CUT TO:\n</b>\n               THE TREE that the car ran into. BUSTER reaches it, studies \n               it.\n\n<b>                                                                    CUT TO:\n</b>\n               VIRGINIA, staring out after him--she can't see him because \n               the drop is both too steep and covered with trees and mounds \n               of snow.\n\n<b>                                     VIRGINIA\n</b>                         Anything down there?\n\n<b>                                     BUSTER'S VOICE (O.S.)\n</b>                         Yeah. An enormous amount of snow.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. He's moved away from the tree now, going toward where \n               the Mustang is buried.\n\n<b>                                                                    CUT TO:\n</b>\n               THE MOUND OF SNOW with the Mustang inside.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, making his way closer to it, closer, staring around.\n\n<b>                                                                    CUT TO:\n</b>\n               THE AREA. Nothing to be seen--everything is covered with \n               mountains of snow. You could have a house down there and not \n               be able to see it. Just glaring white.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, angry, frustrated, turning around and around and\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER from another angle, from behind the mound with the \n               Mustang inside--and out of his sight, glistening in the sun, \n               a bit of the door protrudes. But, of course, Buster can't \n               see it.\n\n               HOLD ON BUSTER, in a sour mood, staring around as the edge \n               of the door continues to glisten.\n\n<b>               CUT TO:\n</b>\n               VIRGINIA, on the road as Buster makes his way back up, still \n               ticked.\n\n<b>                                     VIRGINIA\n</b>                              (they move to the car)\n                         You really think Sheldon's out there?\n\n<b>                                     BUSTER\n</b>                         Hope not--if he is, he's dead. Let's \n                         go to the newspaper office.\n\n               As they get in the car--\n\n               ANOTHER CAR DRIVING BY--it's Annie in her Jeep--neither she \n               nor Buster notice each other.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM\n</b>\n               The door opens and ANNIE enters.\n\n<b>                                     ANNIE\n</b>                         Oh, I'm sorry. I didn't mean to wake \n                         you.\n\n<b>                                     PAUL\n</b>                         It's fine.\n\n<b>               PULL BACK TO REVEAL\n</b>\n               Paul's eyes fluttering awake to see the hardback copy of his \n               novel, Misery's Child, in Annie's hands. She's never been \n               more excited--\n\n<b>                                     ANNIE\n</b>                         They had it at the store, Paul, there \n                         was a whole batch of them there. As \n                         soon as I saw it, I slammed my money\n                         down. I got the first copy.\n\n<b>                                     PAUL\n</b>                         Then the roads are open...\n\n<b>                                     ANNIE\n</b>                         The one to town is, but that's about \n                         it. I called the hospital and talked \n                         to the head orthopedic surgeon. I \n                         told him who you were and what had \n                         happened. He said as long as there's \n                         no infection, you're not in any \n                         danger, and as soon as the road to \n                         the hospital is open, they'll send \n                         an ambulance for you.\n\n<b>                                     PAUL\n</b>                         The phones are working?\n\n<b>                                     ANNIE\n</b>                         Well, mine's still out. But the ones \n                         in town were working just fine. I \n                         called that agent of yours.\n                              (soft now)\n                         Oh, Paul, I peeked at the very \n                         beginning.\n                              (looks at him)\n                         What a wonderful first page--just to \n                         read the name Misery Chastain...\n\n<b>                                     PAUL\n</b>                         My daughter must be going nuts.\n\n<b>                                     ANNIE\n</b>                         ...it's like a visit from my oldest,\n                         dearest friend.\n\n<b>                                     PAUL\n</b>                         I was supposed to be home for her \n                         birthday three days ago.\n\n<b>                                     ANNIE\n</b>                         Your agent said she would tell her \n                         you were okay. But I'm afraid you'll \n                         have to wait until tomorrow if you \n                         want to speak to her yourself.\n\n               She starts to leave, stops at the door.\n\n<b>                                     ANNIE\n</b>                              (She looks at him now \n                              with almost a look \n                              of amazement)\n                         Oh, Paul, what a poet you are...\n\n               As she leaves--\n\n<b>                                                               DISSOLVE TO:\n</b>\n               PAUL, watching as she enters, moves to him, carrying a tray.\n\n<b>                                     ANNIE\n</b>                         I made you my speciality--scrambled \n                         eggs a la Wilkes. And I'm on page \n<b>                         75.\n</b>\n<b>                                     PAUL\n</b>                         I guess that means it's okay.\n\n<b>                                     ANNIE\n</b>                         No. No, it isn't, it's--\n                              (halts)\n                         --oh pooh, I can't think of any words. \n                         Would \"great\" be insulting?\n\n<b>                                     PAUL\n</b>                         I can live with \"great.\"\n\n               He starts, with effort, to eat.\n\n<b>                                     ANNIE\n</b>                              (as she turns, goes)\n                         No, it's not just great, it's perfect, \n                         a perfect, perfect thing.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. MID-AFTERNOON\n</b>\n               ANNIE is clearing Paul's tray. She hands him his Novril; he \n               quickly swallows them.\n\n<b>                                     ANNIE\n</b>                         I'm up to page 185. I always get sad \n                         when I pass the halfway point. Will \n                         you do me a favor? I'd love it if \n                         you would autograph my copy. I already \n                         have your autograph on a picture, \n                         but it would mean so much to me to \n                         get it in person. I know you're right-\n                         handed, so don't worry if it's not \n                         so legible. I'll cherish it anyway.\n\n               As PAUL signs the book:\n\n<b>                                     ANNIE\n</b>                         I don't mean to pry, but I've read \n                         in two magazines now where you were \n                         seeing this model who does those \n                         disgusting jeans commercials. And I \n                         said it can't be true. Paul Sheldon \n                         would never waste his time with a \n                         trampy woman like that.\n\n<b>                                     PAUL\n</b>                         Well, you can't believe everything \n                         you read in magazines.\n\n<b>                                     ANNIE\n</b>                         I knew it. I knew it wasn't true. \n                         Boy, how do they get away with \n                         printing stuff like that?\n\n<b>                                     PAUL\n</b>                         You'd be amazed at what some people \n                         will believe.\n\n               He finishes the autograph, hands the book back to her.\n\n<b>                                     ANNIE\n</b>                         Thank you so much.\n\n<b>                                     PAUL\n</b>                         My pleasure.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               THE WINDOW - LATE - AFTERNOON SUNLIGHT\n</b>\n<b>                                                                    CUT TO:\n</b>\n               THE DOOR. IT opens and guess what--a sow lumbers in.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, kind of stunned as this female pig skitters its way \n               around the room, excited, confused, slipping and sliding.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, all smiles and happiness, laughing in the doorway.\n\n<b>                                     ANNIE\n</b>                         I thought it was time you two should \n                         meet. Paul, say hello to my favorite \n                         beast in all the world, my sow, \n                         Misery.\n\n<b>                                     PAUL\n</b>                         Misery?\n\n<b>                                                                    CUT TO:\n</b>\n               THE PIG, snorting around the room.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL AND ANNIE, watching it.\n\n<b>                                     ANNIE\n</b>                         Yes. I told you I was your number-\n                         one fan.\n\n<b>                                     PAUL\n</b>                         I'm getting to believe you.\n\n<b>                                     ANNIE\n</b>                         This farm was getting kind of dreary, \n                         what with just the few cows and \n                         chickens and me--\n                              (happy)\n                         But when I got Misery here, everything \n                         Changed--she just makes me smile so.\n\n<b>                                     PAUL\n</b>                         She's a fine... uh... pig is what \n                         she is...\n\n<b>                                     ANNIE\n</b>                              (scooping up the pig, \n                              holding it tight as \n                              she stands by Paul)\n                         I'm on page three-hundred now, Paul, \n                         and it's better than perfect--it's \n                         divine. What's the ceiling that dago \n                         painted?\n\n<b>                                     PAUL\n</b>                         The Sistine Chapel?\n\n<b>                                     ANNIE\n</b>                         Yeah, that and Misery's Child--those \n                         are the only two divine things ever \n                         in this world...\n\n               PAUL watches as the pig skitters out of the room with ANNIE \n               in pursuit, happily imitating the pig.\n\n<b>                                     ANNIE\n</b>                         Woink! Whoink! Whuh-Whuh-WHOINK!\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL staring after them--what the hell was that?\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE WINDOW. DUSK.\n</b>\n               ANNIE'S VOICE is heard softly.\n\n<b>                                     ANNIE\n</b>                         When my husband left me... I wasn't \n                         prepared, it wasn't an easy time...\n\n<b>               PULL BACK TO REVEAL\n</b>\n               ANNIE, standing at the window, her back to the room.\n\n               In bed, PAUL is dealing with a bedpan, peeing.\n\n<b>                                     ANNIE\n</b>                         For a while I thought I might go \n                         crazy.\n\n<b>                                     PAUL\n</b>                         I know how that can be.\n\n<b>                                     ANNIE\n</b>                         I don't know about you, but what I \n                         did to get through it was I dove \n                         into work--days, nights--night shifts \n                         can be lonely at a hospital. I did a \n                         lot of reading. That was hen I first \n                         discovered Misery. She made me so \n                         happy. She made me forget all my \n                         problems.\n                              (She smiles now)\n                         'Course, I suppose you had a little \n                         something to do with that too.\n\n               There is a peeing sound.\n\n<b>                                     PAUL\n</b>                         Yeah, well...\n\n               He is embarrassed.\n\n<b>                                     ANNIE\n</b>                              (She isn't)\n                         I just kept reading them over and \n                         over. I know when I finish this one--\n                         and I've only got two chapters to go--\n                         I'll just turn right to the front \n                         page and start reading it again.\n\n<b>                                     PAUL\n</b>                         I'm...\n\n<b>                                     ANNIE\n</b>                              (She turns around, \n                              moves to the bed)\n                         Done?\n\n<b>                                     PAUL\n</b>                         Yeah, thanks.\n\n<b>                                     ANNIE\n</b>                         No problem.\n\n               As she takes the bedpan...\n\n<b>                                     ANNIE\n</b>                         Don't get me wrong. I'm not against \n                         marriage per se. But it would take a \n                         pretty special guy to make me want \n                         to go down the aisle again.\n\n<b>                                     PAUL\n</b>                         Well, it's not something you should\n                         enter into lightly.\n\n<b>                                     ANNIE\n</b>                         It boils down to respect. People \n                         just don't respect the institution \n                         of marriage any more. They have no \n                         sense of real commitment.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, attempting to smile. There is not much he can say to \n               this.\n\n<b>                                     ANNIE\n</b>                         I'd love to stay here and chat, but \n                         I'm right at the end and I gotta \n                         find out what happens.\n\n<b>                                     PAUL\n</b>                         Well, I hope you like it.\n\n<b>                                     ANNIE\n</b>                         Of course I'll like it. Misery's \n                         about to have her child. What's it \n                         gonna be, a boy or a girl? Ooh, don't \n                         tell me.\n\n               With that, she exits.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE WINDOW. MOONLIGHT.\n</b>\n<b>                                                                    CUT TO:\n</b>\n               PAUL. He's been dozing but now his eyes flutter awake as we\n\n<b>                                                                    CUT TO:\n</b>\n               THE DOOR. It opens and ANNIE enters, comes to his bedside.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. Hard to see. He squints up as we\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE. CLOSE UP: her face is ashen pale.\n\n<b>                                     ANNIE\n</b>                         You...you dirty bird. She can't be \n                         dead. Misery Chastain cannot be dead! \n                         How could you?\n\n<b>                                     PAUL\n</b>                         Annie, in 1871, women often died in \n                         childbirth, but her spirit is the \n                         important thing, and Misery's spirit \n                         is still alive--\n\n<b>                                     ANNIE\n</b>                              (screaming)\n                         I DON'T WANT HER SPIRIT! I want HER!\n                         And you MURDERED her!\n\n<b>                                     PAUL\n</b><b>                         I DIDN'T...\n</b>\n<b>                                     ANNIE\n</b>                         Then who did?\n\n<b>                                     PAUL\n</b>                         No one--she just died--she slipped \n                         away, that's all.\n\n<b>                                     ANNIE\n</b>                              (screaming)\n                         She slipped away? She slipped away? \n                         She didn't just slip away. You did \n                         it. You did it. You did it. You did \n                         it. You murdered my Misery.\n\n               And now she has lifted a chair--it's heavy but she's very \n               strong--and she raises it and turns on Paul, and it's high \n               above her head, and PAUL realizes that this might be it, she \n               might shatter him with it, crunch his skull--and that's just \n               what she seems she's about to do--and then she swings it, \n               not against him but against the wall, and it shatters and \n               she's panting from the effort as she turns on him again, her \n               voice surprisingly soft.\n\n<b>                                     ANNIE\n</b>                         I thought you were good, Paul, but \n                         you're not good, you're just another \n                         lying old dirty birdie and I don't \n                         think I better be around you for \n                         awhile.\n                              (she crosses to the \n                              door, then stops)\n                         And don't even think about anybody \n                         coming for you, not the doctors, not \n                         your agent, not your family--because \n                         I never called them. Nobody knows \n                         you're here. And you better hope \n                         nothing happens to me because if I \n                         die, you die.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, watching as she closes the door behind her. Then there \n               is a RATTLE OF A KEY and the sound of the door to his room \n<b>               LOCKING.\n</b>\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, getting in her Cherokee and gunning away.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE ROOM\n</b>\n               PAUL lies still. He looks around the room and listens for \n               sounds. All he hears are the SOUNDS OF A WINTER NIGHT in the \n               mountains. After a few beats, he takes a deep breath and \n               then begins his greatest effort of all: to force his body \n               out of bed, to make it move.\n\n               He's still weak from what he's endured, but that's not the \n               main thing: it's the pain. Any attempt at movement and his \n               legs scream. He sags back, lies there still a moment. Slowly \n               he tries to maneuver his body off the bed. He rolls over \n               onto his stomach, then tries to lower himself onto the floor \n               by moving down head first. His good arm hits the floor, and \n               he is able to hold himself up but, realizing there is no way \n               to get out of bed without causing tremendous pain, he girds \n               himself and flings himself out of bed and comes crashing to \n               the floor.\n\n               The pain is excruciating. After he regains his composure, he \n               slowly crawls toward the door.\n\n               He reaches up and tries the handle. It is, in fact, locked. \n               He awkwardly tries to slam up against the door, but it is \n               much too painful and to no avail. He crawls back over to the \n               bed, realizes there's no way to climb back in, then grabs\n\n               the blanket from the bed, wraps it around himself, and closes \n               his eyes.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               BUSTER'S OFFICE. DAY.\n</b>\n               He sits alone at his desk on the telephone, staring at the \n               Rocky Mountain Gazette spread in front of him.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE NEWSPAPER'S FRONT PAGE\n</b>\n               In a prominent spot on the top is what is most likely a book-\n               jacket photo of Paul. Above the picture is the following: \n<b>               \"HAVE YOU SEEN PAUL SHELDON?\"\n</b>\n               BUSTER is on the phone with Marcia Sindell.\n\n<b>                                     BUSTER\n</b>                         No, Ms. Sindell, there's no point in \n                         coming up here now. Everything that \n                         can be done is... Yes, we're working \n                         closely with the state police, and \n                         the FBI has been informed. Right... \n                         Right... As soon as we know anything \n                         we'll let you know. No, it's no \n                         bother. Call anytime. Bye, Ms. \n                         Sindell.\n\n               VIRGINIA enters, carrying some files.\n\n<b>                                     VIRGINIA\n</b>                         Here's the list of all Sheldon's \n                         credit charges. Nothing after the \n                         Silver Creek.\n                              (With a glance at his \n                              dour face, she \n                              indicates the photo)\n                         Any calls?\n\n<b>                                     BUSTER\n</b>                         Just from his agent.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. His eyes flick up to her. An almost imperceptible \n               shake of the head.\n\n               HOLD FOR A MOMENT, then--\n\n               FACES. They are distorted, and they come into view but \n               briefly, then change into the next distorted face. All kinds-- \n               there is no order to them\n\n               --young, Oriental, female, male, pretty, sad, black, not so \n               pretty, happy, white, old--what we HEAR is this:\n\n               \"...You've changed my life...\"\n\n               \"...I'm your number one fan...\"\n\n               \"...I'm a really big fan of yours...\"\n\n               \"...I'm your biggest fan...\"\n\n               \"...Don't ever stop writing those Misery books...\"\n\n               \"...I've read all your books, but the Misery's... well...\"\n\n               \"...I'm your number one fan...\"\n\n               \"...You've given me such pleasure...\"\n\n               \"...I feel like you're writing just for me...\"\n\n               And now, it gets kicked up in speed and all goes faster, \n               many times overlapping.\n\n               \"...I love you... I'm your number one fan... I'm your biggest \n               fan... We love you... number one... love you... biggest... \n               love you... number one... number one... you poor dear \n               thing...\"\n\n               This last was said by Annie, out of focus, and for a moment, \n               she stays that way--\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROOM, AS IT SNAPS BACK INTO FOCUS--ANNIE is standing by \n               the bed. It is dusk.\n\n               She wears a dark blue dress and a hat with a sprig of flowers. \n               Her eyes are bright and vivacious--the fact is, this is the \n               prettiest ANNIE WILKES has ever looked.\n\n<b>                                     ANNIE\n</b>                         What are you doing on the floor?\n                              (crossing to the bed)\n                         It's my fault. If I'd had a proper \n                         hospital bed, this never would have \n                         happened. Here, let me help you back \n                         in.\n                              (She lifts him back \n                              into the bed, which \n                              causes considerable \n                              pain)\n                         I know this hurts, but it'll only \n                         take a few seconds. There you go. \n                         Comfy?\n\n<b>                                     PAUL\n</b>                              (in pain)\n                         Perfect.\n\n<b>                                     ANNIE\n</b>                         You're such a kidder. I have a big \n                         surprise for you. But first there's\n                         something you must do.\n\n<b>                                     PAUL\n</b>                         I don't suppose I could have a little \n                         snack while I wait for the\n                         surprise?\n\n<b>                                     ANNIE\n</b>                         I'll get you everything you want, \n                         but you must listen first. Sometimes \n                         my thinking is a little muddy, I \n                         accept that. It's why I couldn't \n                         remember all those things they were \n                         asking me on the witness stand in \n                         Denver.\n\n               Now she turns, goes to the doorway, keeping on talking. She \n               is never out of sight.\n\n<b>                                     ANNIE\n</b>                         But this time I thought clearly. I \n                         asked God about you and God said \"I \n                         delivered him unto you so that you \n                         may show him the way.\"\n\n<b>                                     PAUL\n</b>                         Show me the way?\n\n<b>                                     ANNIE\n</b>                         Yes.\n\n               She exits and re-enters wheeling something toward his bed. \n               It's a charcoal barbecue, the kind you use in summer for \n               cooking hamburgers. She holds several items in her arms: a \n               box of Diamond Blue Tip wooden matches, a can of lighter \n               fluid. And most noticeably, Paul's manuscript.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE AND PAUL. He watches, mute, as she takes off the grill, \n               puts the manuscript into the barbecue itself where the \n               charcoal goes, spritzes it with lighter fluid. The grill is \n               close enough to the bed for him to reach out and drop a match.\n\n<b>                                     PAUL\n</b>                         When I mentioned a snack, I was \n                         thinking more along the lines of a\n                         cheese and crackers kind of thing.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, looking at him.\n\n<b>                                     ANNIE\n</b>                         Paul, this is no time for jokes. You \n                         must rid the world of this filth.\n\n               She hands him the box of kitchen matches.\n\n<b>                                     PAUL\n</b>                         You want me to burn my book?\n\n<b>                                     ANNIE\n</b>                              (she nods)\n                         Yes.\n\n<b>                                     PAUL\n</b>                         You want me to burn my book?\n\n<b>                                     ANNIE\n</b>                         I know this may be difficult for \n                         you, but it's for the best.\n\n<b>                                     PAUL\n</b>                         This isn't difficult, my agent's \n                         made dozens of copies. There's gonna \n                         be an auction on this, and every \n                         publishing house in New York is \n                         reading it now. So if you want me to \n                         burn it, fine. You're not ridding \n                         the world of anything.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, watching him.\n\n<b>                                     ANNIE\n</b>                              (quietly)\n                         Then light the match, Paul.\n\n<b>                                     PAUL\n</b>                         No big deal.\n\n<b>                                     ANNIE\n</b>                         So you've indicated. Do it.\n\n<b>                                                                    CUT TO:\n</b>\n               THE MATCHES. PAUL'S HANDS are starting to tremble now. He \n               can't do it.\n\n<b>                                     ANNIE\n</b>                         I know this is the only copy, Paul. \n                         When you were twenty-four you wrote \n                         your first book and you didn't make \n                         a copy, because you didn't think \n                         anybody would take it seriously. But \n                         they did. And ever since you've never \n                         made any copies because you're \n                         superstitious--it's why you always \n                         come back to the Silver Creek Lodge. \n                         You told that story to Merv Griffin \n                         eleven years ago.\n\n<b>                                     PAUL\n</b>                         You know, Annie, this book never \n                         would have survived without you. \n                         When it gets to new York, there will \n                         be a big auction, and whatever it \n                         brings we can split.\n                              (pause)\n                         God knows you're entitled to it.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul. This isn't about money. \n                         It's about decency and purity. It's \n                         about God's values.\n\n<b>                                     PAUL\n</b>                         You're right. You're right. I don't \n                         know what I was thinking. I'll tell \n                         you what. It doesn't have to be \n                         published. Nobody ever has to see \n                         it. I'll just keep it for myself. No \n                         one will ever have to know it exists.\n\n<b>                                     ANNIE\n</b>                         As long as it does exist, your mind \n                         won't ever be free. I think you should \n                         light the match, Paul.\n\n               There is a long silence. PAUL doesn't move.\n\n<b>                                     ANNIE\n</b>                         Can't you see it's what God wants?\n\n               She's holding the can of lighter fluid in her hand as she \n               speaks and absentmindedly flicks a few drops of the fluid on \n               the bed.\n\n<b>                                     ANNIE\n</b>                         You're so brilliant. I would think \n                         you'd certainly be able to see that.\n                              (More drops fall on \n                              the bed)\n                         We're put on this earth to help \n                         people, Paul. Like I'm trying to \n                         help you.\n\n               PAUL watches as the fluid continues to drop on the bed.\n\n<b>                                     ANNIE\n</b>                         Please let me help you.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. His hands shaking. Almost robot-like, he strikes one. \n               It flames.\n\n<b>                                     ANNIE\n</b>                         You're doing the right thing, Paul.\n\n<b>                                                                    CUT TO:\n</b>\n               THE BARBECUE, as Paul's hand appears, drops the match on the \n               fluid-soaked manuscript. For a moment--nothing--\n\n               --and then, KABOOM, the goddamn thing practically explodes \n               and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring, dazed, and as the flames leap higher,\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, suddenly scared and startled at the heat and the size \n               of the flames and the full baking heat and\n\n<b>                                     ANNIE\n</b>                              (crying out)\n                         Goodness!\n\n<b>                                                                    CUT TO:\n</b>\n               THE BARBECUE. The sound is LOUDER as the flames leap up and \n               now charred bits of paper begin floating upward and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, watching, as more bits of paper rise.\n\n<b>                                     ANNIE\n</b>                         Goodness--Goodness--Oh, my gracious--\n\n               And she starts trying to catch them.\n\n<b>                                                                    CUT TO:\n</b>\n               A PIECE OF BURNING PAPER in midair, floating against the \n               gauzy curtain, and for a moment it looks like the curtain \n               will catch fire and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, panicked, racing out of the room, going \"Goodness, \n               heavens to Betsy\"--\n\n<b>                                                                    CUT TO:\n</b>\n               THE BARBECUE, and what's left of the book.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, and he cannot take his eyes off the disaster.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, hurrying back in, carrying a big bucket, slopping \n               water as she lifts the bucket.\n\n<b>                                                                    CUT TO:\n</b>\n               THE LAST of the manuscript as the bucket of water is tossed \n               onto it--there's hissing and steam and as the steam clears \n               it all looks now like a log in a brackish pond.\n\n<b>                                     ANNIE\n</b>                         Well, isn't that an oogy mess?\n\n               As she starts to wheel the barbecue out, suddenly there is a \n               new and different sound as we\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, head turning toward the window.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE taking  a step toward the window, stopping for a moment. \n               The sound we're hearing is a motor. A HELICOPTER MOTOR. And \n               it's getting louder. Annie goes to the window now, looks \n               toward the sky as we\n\n<b>                                                                    CUT TO:\n</b>\n               A HELICOPTER flying along.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               INSIDE THE HELICOPTER\n</b>\n               BUSTER and a PILOT are in the machine. Buster has a pair of \n               binoculars looped around his neck, a map rumpled in his lap.\n\n<b>                                     BUSTER\n</b>                              (pointing out)\n                         That's the Steadman place up there.\n                              (The pilot nods. Buster \n                              points again)\n                         The only other place up here is the \n                         Wilkes farm.\n\n               Another nod. The PILOT points down. BUSTER stares through \n               the binoculars.\n\n               WHAT HE SEES: ANNIE'S JEEP parked in front of her house.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               INSIDE THE HELICOPTER\n</b>\n<b>                                     BUSTER\n</b>                         That's no '65 Mustang. There's nothing \n                         else out this way--circle on back.\n\n               As the pilot starts to change direction\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE at the window, watching, as the helicopter turns, starts \n               off.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, listening as the MOTOR sound recedes.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, staring out the window.\n\n<b>                                     ANNIE\n</b>                         I do believe the winters are getting \n                         shorter and shorter every year. People \n                         say it has something to do with the \n                         ozone layer. What do you think?\n\n<b>                                     PAUL\n</b>                         I don't know.\n\n<b>                                     ANNIE\n</b>                         Yeah, well, it's a theory. Here's \n                         your Novril.\n                              (she wheels the \n                              barbecue to the door; \n                              stops)\n                         How does tuna casserole sound for \n                         dinner?\n\n<b>                                     PAUL\n</b>                         Great.\n\n               She exits. PAUL takes the two Novril, stares at them, then \n               deliberately tucks them under his mattress.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               PAUL'S ROOM. NIGHT.\n</b>\n               As PAUL is finishing the last of his tuna casserole. There \n               are two Novrils on his tray. We hear strains of TV GAME SHOW \n               THEME MUSIC. These sounds are not surprising. Paul has heard \n               them before.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE'S ROOM. NIGHT.\n</b>\n               It is much smaller than Paul's and filled with religious \n               bric-a-brac, pictures of Paul Sheldon, and a TV on a portable \n               stand. Annie lies in bed, with an open bag of Cheetos resting \n               on her stomach and a big quart-sized plastic bottle of Coke \n               on the nightstand. As she munches away, she is heavily \n               engrossed in her favorite TV show, \"The Love Connection.\" As \n               Chuck Woolery extracts the embarrassing details of a couple's \n               romantic interlude, we\n\n<b>                                                                    CUT TO:\n</b>\n               Paul faintly hearing the sounds of the TV. He has now finished \n               eating. He takes the two Novril from under the mattress. He \n               then undoes the sheet, takes his fork and delicately pokes a \n               hole in the mattress, then stuffs all four pills back into \n               the hole.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               FARMHOUSE\n</b>\n               Coming up to dawn.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL'S DOOR slowly opening.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring at  the door.\n\n<b>                                                                    CUT TO:\n</b>\n               WHEELS, seen from underneath the bed, being rolled around \n               the foot of the bed. We realize PAUL is in a wheelchair with \n               ANNIE pushing him.\n\n<b>                                     ANNIE\n</b>                         See, isn't this nice?\n\n<b>                                     PAUL\n</b>                         Great. I've always wanted to visit \n                         the other side of the room.\n\n<b>                                     ANNIE\n</b>                         And look what I've got for you. An \n                         electric razor so you can shave \n                         yourself now.\n\n<b>                                     PAUL\n</b>                         If I knew this was gonna be the \n                         surprise, you could've gotten me to\n                         burn all my books.\n\n<b>                                     ANNIE\n</b>                              (She hands him some \n                              Novril)\n                         Now don't josh. This is a very big \n                         day for you, Paul. Here. You just \n                         sit tight, and I'll set everything \n                         up.\n\n               ANNIE exits.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, quickly shoving the Novril into the mattress.\n\n<b>                                     PAUL\n</b>                         Set what up?\n\n<b>                                     ANNIE\n</b>                         That's the big surprise. Your new \n                         studio--after all, writers do need a \n                         place to work.\n\n<b>                                     PAUL\n</b>                         Work? You mean write? What in the \n                         world do you think I'd write?\n\n<b>                                     ANNIE\n</b>                         Oh, but Paul!\n                              (flushed)\n                         I don't think, I know! Now that you've \n                         gotten rid of that nasty manuscript, \n                         you can go back to doing what you're \n                         great at--\n                              (beat)\n                         --you're going to write a new novel-- \n                         your greatest achievement ever--\n                         Misery's Return.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. Stunned.\n\n<b>                                     PAUL\n</b>                              (after a beat)\n                         Misery's Return?\n\n<b>                                     ANNIE\n</b>                         I know you didn't mean it when you \n                         killed her, and now you'll make it \n                         right.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE: CLOSE UP. In an almost religious fervor.\n\n<b>                                     ANNIE\n</b>                         Yes. It will be a book in my honor. \n                         For saving your life and nursing you \n                         back to health. I'll be the first \n                         one to read it.\n                              (beat)\n                         Oh, Paul, you're going to make me \n                         the envy of the whole world...\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL\n</b>\n<b>                                     PAUL\n</b>                         You just expect me to whip something \n                         off, that it?\n\n<b>                                     ANNIE\n</b>                              (nods)\n                         I expect nothing less than your \n                         masterpiece.\n\n<b>                                     PAUL\n</b>                         You do understand that this isn't \n                         the ordinary way books get written--\n                         I mean, some people might actually \n                         consider this an oddball situation.\n\n               She rolls him over to a table she has set up by the window.\n\n<b>                                     ANNIE\n</b>                         I have total confidence in your \n                         brilliance--besides, the view will\n                         inspire you.\n\n<b>                                                                    CUT TO:\n</b>\n               THE WINDOW, as the wheelchair approaches it.\n\n               The sky is innocent of clouds. There's a green forest climbing \n               the flank of the nearest mountain. A plot of open ground \n               between the house and the mountain. A neat red barn where \n               the livestock stay. A Jeep Cherokee, maybe five years old. A \n               Fisher plow. And no neighbors in sight. This is a desolate \n               place.\n\n<b>                                     ANNIE\n</b>                         You just inhale that. I'll be right \n                         back.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring out the window.\n\n<b>                                     PAUL\n</b>                              (calling out)\n                         I guess you don't get bothered by\n                         neighbors much.\n\n<b>                                     ANNIE\n</b>                         Don't worry about that. You'll have \n                         total solitude so you can concentrate \n                         on your work.\n\n<b>                                     PAUL\n</b>                         Great.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE in the doorway, carrying reams of typing paper, pencils, \n               pens and sharpener.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, watching her--it's all kind of amazing. She hands him \n               a box of typing paper.\n\n<b>                                     ANNIE\n</b>                         I got you this expensive paper to \n                         type on.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, looking at the paper. It's Corrasable Bond. An idea \n               hits him; he masks it as best he can.\n\n<b>                                     ANNIE\n</b>                              (putting the rest of \n                              the paper on the \n                              table)\n                         And I got a great deal on this fifty-\n                         pound clunker--on account of it's \n                         missing an \"n.\" I told the saleslady \n                         \"n\" was one of the letters in my \n                         favorite writer's name.\n\n<b>                                     PAUL\n</b>                         It's two of the letters in my favorite \n                         nurse's name, Annie.\n\n<b>                                     ANNIE\n</b>                              (embarrassed, blushing)\n                         You--fooler...!\n                              (turns, grabs up pens, \n                              pencils, paper)\n                         Did I do good?\n\n<b>                                     PAUL\n</b>                              (gesturing to the box \n                              of paper)\n                         You did great, except there's just \n                         one little thing--I can't work with \n                         this paper. It's Corrasable Bond, it \n                         smudges. Maybe you could go back \n                         into town and bring me some white, \n                         long-grained mimeo.\n\n<b>                                     ANNIE\n</b>                         But mine cost the most so I don't \n                         see how it could smudge.\n\n<b>                                     PAUL\n</b>                              (quickly taking a \n                              sheet of paper, making \n                              a pencil mark on it)\n                         C'mere, I'll show you.\n\n               As she approaches, he rubs his thumb over the pencil mark.\n\n<b>                                     ANNIE\n</b>                              (looking at it)\n                         Well, it does smudge after all--isn't \n                         that fascinating?\n\n<b>                                     PAUL\n</b>                         I thought you'd be interested. I'd \n                         like you to be in on everything, \n                         Annie. Not just the finished book, \n                         but how it's written.\n\n<b>                                     ANNIE\n</b>                         Thank you for thinking of me.\n                              (She can be so charming \n                              when she wants)\n                         Anything else I can get while I'm in \n                         town? Any other crucial requirements \n                         that need satisfying? Would you like \n                         a tiny tape recorder? Or maybe a \n                         handmade set of writing slippers?\n\n<b>                                     PAUL\n</b>                         No, just the paper will be fine.\n\n<b>                                     ANNIE\n</b>                              (suddenly very agitated)\n                         Are you sure? 'Cause if you want, \n                         I'll bring back the whole store for \n                         you.\n\n<b>                                     PAUL\n</b>                         Annie, what's the matter?\n\n<b>                                     ANNIE\n</b>                         What's the matter? I'll tell you \n                         what's the matter. I go out of my \n                         way for you. I do everything to try \n                         and make you happy. I feed you, I \n                         clean you, I dress you. And what \n                         thanks do I get? \"You bought the \n                         wrong paper, Annie. I can't write on \n                         this paper, Annie.\" Well, I'll get \n                         your stupid paper, but you just better \n                         start showing me a little more \n                         appreciation around here, Mister \n                         Man.\n\n               With that, she throws the ream of paper in PAUL'S LAP, causing \n               considerable pain.\n\n<b>                                                                    CUT TO:\n</b>\n               THE DOOR as she slams it shut, locks it, stomps off and\n\n<b>                                                                    CUT TO:\n</b>\n               THE WINDOW. Annie, in a parka, can be seen storming out in \n               the direction where her Cherokee was parked. She gets in and \n               drives off.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. He heaves a sigh, reaches out toward his tortured knees, \n               then drops his head. He sees something.\n\n<b>                                                                    CUT TO:\n</b>\n               BOBBY PIN on the floor.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, as he moves toward the bobby pin. Or tries to. It's \n               brutally hard for him. The chair moves half a foot. Stops. \n               Paul strains again. Another half foot. Another.\n\n<b>                                                                    CUT TO:\n</b>\n               The BOBBY PIN. The wheelchair is beside it now. PAUL reaches \n               down for it. Can't make it. Tries again. Can't. He takes a \n               deep breath, forces himself to bend, ignoring the pain. The \n               bobby pin is in his hands.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, inserting the bobby pin into the keyhole, beginning to \n               jimmy the lock.\n\n<b>                                                                    CUT TO:\n</b>\n               THE LOCK--it makes a SOUND--something has caught.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, excited, trying to force the bobby pin and he's doing \n               great--until it slips from his hands, falls to the floor \n               again.\n\n<b>                                     PAUL\n</b>                              (furious)\n                         Shit...\n\n<b>                                                                    CUT TO:\n</b>\n               THE BOBBY PIN. Paul reaches for it. The pain has him. He \n               reaches again, involuntarily cries out. But he grabs it, \n               clutches it tight.\n\n<b>                                                                    CUT TO:\n</b>\n               THE KEYHOLE. Paul is trying to jimmy the lock a second time.\n\n               No luck.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. In wild frustration.\n\n<b>                                     PAUL\n</b>                         You've written how to do this--now \n                         do it!\n\n<b>                                                                    CUT TO:\n</b>\n               THE KEYHOLE. There is a loud CLICKING sound.\n\n<b>                                                                    CUT TO:\n</b>\n               THE DOOR as Paul turns the knob. The door opens a crack.\n\n<b>                                     PAUL\n</b>                              (amazed)\n                         What do you know, it actually works.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, trying to get out of the room--but it's a bitch because \n               in order to get to the lock he had to move the wheelchair up \n               to the door and in order to get out, he's got to maneuver it \n               out of the way of the door and every turn of the chair's \n               wheels is an effort for him. He works at it and works at it, \n               but his energy is failing him. He's pale, perspiring. Finally \n               he succeeds, barely forces his way into the hall.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, in the hallway outside. He looks around for a phone. \n               Doesn't see one. He wheels himself over to the front door, \n               tries it. It's locked from the outside.\n\n<b>                                     PAUL\n</b>                         What a surprise.\n\n               He looks off into the living room, and...\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE TELEPHONE\n</b>\n<b>                                                                    CUT TO:\n</b>\n               PAUL, wheeling into the living room. Dark red predominates. \n               It's a musty room. Over the mantel, a photograph of a six-\n               year-old ANNIE, with her mother and father in front of the \n               family car--a new 1952 Buick. These were happier times.\n\n               The windows have bars on them.\n\n               As PAUL begins to wheel as fast as he can toward the phone--\n\n<b>                                                                    CUT TO:\n</b>\n               THE PHONE as PAUL at last grabs for it, gets it, punches the \n               \"operator\" button--\n\n<b>                                     PAUL\n</b>                         Operator...\n                              (nothing)\n<b>                         ...OPERATOR...\n</b>                              (wildly frustrated)\n                         ...Shit!\n\n               He shakes the phone. It's terribly light. He picks it up, \n               turns it over--it's hollow, just a shell of a telephone. He \n               stares at it for a long moment, shaking his head, the \n               disappointment plain.\n\n<b>                                     PAUL\n</b>                         You crazy bitch...\n\n               He puts the phone back on the table.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE GENERAL STORE. DAY.\n</b>\n               Annie exits the store, carrying new paper, hops into her \n               Cherokee and drives off.\n\n<b>                                                                    CUT TO:\n</b>\n               THE STUDY, as PAUL enters. He looks around.\n\n               It's stuffed with heavy, graceless furniture as well as lots \n               of coffee tables covered with knickknacks. As he, with effort, \n               wheels across it--\n\n<b>                                                                    CUT TO:\n</b>\n               A shelf of BOOKS. PAUL SHELDON books. EVERY Paul Sheldon \n               book.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, pausing, looking at her collection. The only book on \n               the shelf that isn't his is a large scrapbook. The title on \n               the back reads \"My Life.\"\n\n               He glances back at the shelf as he forces his wheelchair \n               across the study, and we\n\n<b>                                                                    CUT TO:\n</b>\n               A SMALL TABLE with little ceramic doodads on top. The \n               wheelchair his it, one of the doodads topples--it's a penguin, \n               fragile looking, and as it's about to fall to the floor and \n               shatter--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, grabbing for it, catching it, putting it back where it \n               was. He continues his slow way across the room and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE HALLWAY.\n</b>\n               Out in the hallway, on his way toward the kitchen, PAUL \n               notices a door to his right. He wheels over and surprisingly \n               it opens. However, this is not a door to the outside of the  \n               house, only a storage pantry. He looks around--nothing but \n               canned goods, potato chips, cereals and large plastic Coke \n               containers, etc. Just as he is about to close the door, he \n               notices an open cardboard box. He opens the flap and sees \n               all kinds of prescription drugs. Among them are a couple of \n               strips of Novril encapsulated in blisters. He grabs them and \n               stuffs them into his sweatpants. Now he closes the pantry \n               door and heads to the kitchen.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE KITCHEN\n</b>\n               As PAUL approaches it. He starts to wheel his way in, but he \n               has trouble.\n\n               He backs up slightly, wheels forward again--\n\n               --but the door is too narrow for the chair to fit through. \n               He pounds his fists on the chair arm, staring as we\n\n<b>                                                                    CUT TO:\n</b>\n               THE BACK DOOR. It's at the far end of the kitchen leading to \n               the outside. It seems somehow less formidable than the front \n               door did. The windows around the kitchen are barred.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring at the kitchen door--\n\n               --then without warning, he makes his move, starting to lower \n               himself out of the chair\n\n               gently to the floor--\n\n               --only it doesn't work that way. It's too awkward, he doesn't \n               have the strength to maneuver properly--\n\n               --and his body tilts awkwardly out of the chair, slams hard \n               against the hard floor.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, crying out in pain as he lands. He lies there for a \n               moment. Little droplets of sweat are on his forehead now. He \n               is hurting.\n\n               He closes his eyes, gathering strength--\n\n               --and then slowly, very slowly, inch by inch, he moves his \n               body across the floor toward the kitchen door.\n\n<b>                                                                    CUT TO:\n</b>\n               THE KITCHEN DOOR. It's still a long way away.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, ignoring his pain, his awkwardness, making his body \n               move.\n\n<b>                                                                    CUT TO:\n</b>\n               THE KITCHEN DOOR. Closer now.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, growing pale, but he won't stop, and now the door is \n               just ahead of him, and with his good arm he reaches out and \n               up and grabs the doorknob--\n\n<b>                                                                    CUT TO:\n</b>\n               THE KITCHEN DOOR. Locked solid.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL: CLOSE UP. The disappointment and anger is plain on his \n               face. His arm drops. He lies still for a moment, panting \n               from his effort. Then--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, and his eyes are wide for a moment. You can feel his \n               wild excitement, as we\n\n<b>               PULL BACK TO REVEAL\n</b>\n               Sitting on the counter: A SET OF CARVING KNIVES sticking out \n               of a slotted wooden block.\n\n               They seem to be out of reach, but that doesn't stop him. He \n               starts to crawl over to the counter.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE ROAD\n</b>\n               ANNIE is driving along in her Cherokee. She is heading home.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE KITCHEN\n</b>\n               Now at the counter, PAUL tries to pull himself up with his \n               one good arm, but even though he is able to chin himself up \n               to the top of the counter, he is still unable to reach the \n               knives. He makes a desperate attempt which sends him crashing \n               to the floor.\n\n               As he starts to force his way up again--from outside there \n               comes a sound--the motor of a car.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               OUTSIDE ANNIE'S\n</b>\n               ANNIE, driving up to the house.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE KITCHEN\n</b>\n               PAUL, throwing himself back to the floor, starting a wild \n               crawl back across the kitchen toward the wheelchair and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               OUTSIDE ANNIE'S\n</b>\n               ANNIE, getting out of her Jeep and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               KITCHEN\n</b>\n               PAUL, crawling, crawling and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               OUTSIDE ANNIE'S\n</b>\n               ANNIE, walking around to the back of the Jeep and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               KITCHEN\n</b>\n               PAUL, scrambling wildly up into his wheelchair, starting to \n               get it turned and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE'S\n</b>\n               ANNIE, opening the back of the Jeep and lifting out several \n               rectangular boxes of paper and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, straightened out now, forcing the wheelchair to move, \n               and now we're into a race, a crazed life-and-death race and \n               the cuts go fast--\n\n               --and ANNIE closes the door of the car--\n\n               --and PAUL is suddenly stuck, there's no traction on the rug--\n\n               -- ow ANNIE, purchases in hand, starts away from the car for \n               the house--\n\n               --and now PAUL is finally moving toward the bedroom.\n\n               --and ANNIE is moving swiftly toward the front door.\n\n               -- he drops one of the packages of paper.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, still biting down, churning his arms with all the \n               strength he has left. PAUL'S ARMS, aching, start to turn to \n               rubber.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE'S FEET, walking quickly across the snow-covered area \n               in front of the house and\n\n<b>                                                                    CUT TO:\n</b>\n               THE BEDROOM DOOR as Paul gets through it, shuts it, and \n               attacks the bedroom lock with the bobby pin and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, unlocking the front door of the house and\n\n<b>                                                                    CUT TO:\n</b>\n               THE BEDROOM DOOR, as it locks and\n\n<b>                                                                    CUT TO:\n</b>\n               THE FRONT DOOR, unlocking and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE balancing the bundles under her chin as she jiggles \n               the key out of the front door lock and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, soaked.\n\n<b>                                     ANNIE (V.O.)\n</b>                              (her voice from the \n                              hallway, close and \n                              growing closer)\n                         Paul, I've got your paper.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. He wheels to exactly where he was when she left him. \n               He at last allows himself a sigh of relief.\n\n<b>                                                                    CUT TO:\n</b>\n               THE DOOR as the sound of a lock CLICKING is heard.\n\n<b>                                     ANNIE\n</b>                         Just the kind you asked for.\n\n               And as the door opens--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL--looking down. Paul's waistband--a half a dozen strips \n               of Novril ominously stick out.\n\n               As the door swings open, he quickly covers the Novril with \n               this hands.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, in the doorway, a strange look on her face.\n\n<b>                                     ANNIE\n</b>                         Paul, you're dripping with \n                         perspiration, your color is very \n                         hectic--what have you been doing?\n\n<b>                                     PAUL\n</b>                         You know goddamn well what I've been \n                         doing--I'VE BEEN SITTING HERE \n                         SUFFERING. I need my pills.\n\n<b>                                     ANNIE\n</b>                              (tenderly, as she \n                              starts toward him)\n                         Poor dear... Let's get you back in \n                         bed and I'll get them for you.\n\n<b>                                     PAUL\n</b>                              (exploding--a real \n                              child's tantrum)\n                         I want my pills NOW!\n\n<b>                                     ANNIE\n</b>                         It'll only take a second.\n\n<b>                                     PAUL\n</b>                         I want my pain to go 'way, Annie--\n                         make it go 'way, please Annie--\n                              (She looks at him--\n                              you can't tell if \n                              she's buying it or \n                              not)\n                         --please...\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE. She stares a moment more, then turns, starts for the \n               door.\n\n<b>                                     ANNIE\n</b>                              (upset)\n                         It just breaks my heart to see you\n                         like this...\n\n<b>               CUT TO:\n</b>\n               PAUL watching, and the instant she is out the door in the \n               hallway, he stuffs the Novril into his pants.\n\n<b>                                     ANNIE (O.S.)\n</b>                              (coming closer)\n                         I've done a lot of thinking on the \n                         drive...\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, entering the room, the Novril in her hand. She is \n               genuinely contrite.\n\n<b>                                     ANNIE\n</b>                         ...and I'm absolutely convinced that \n                         the main reason I've never been more \n                         popular is because of my temper. You\n                         must be so mad at me. The truth now.\n\n               She hands him the pills. And rolls him over to the bed.\n\n<b>                                     PAUL\n</b>                         Well, I don't  hold grudges. After \n                         all, who doesn't let off a little \n                         steam once in a while.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL putting the pills in his mouth, as she picks him up \n               from the chair and puts him gently down in bed.\n\n<b>                                     ANNIE\n</b>                         My genius needs his rest before he\n                         writes.\n\n               She hands him a pad and pencil.\n\n<b>                                     ANNIE\n</b>                         Here, in case you think of any ideas.\n\n<b>                                     PAUL\n</b>                         Yeah, well I wouldn't expect too \n                         much.\n\n<b>                                     ANNIE\n</b>                         Don't be silly. You'll be brilliant. \n                         Think of me as your inspiration.\n\n<b>                                                                    CUT TO:\n</b>\n               THE DOORWAY, as ANNIE starts to it.\n\n<b>                                     ANNIE\n</b>                         I have faith in you...\n                              (beat)\n                         ...my darling...\n\n               On that she turns--for the first time, a coquettish look \n               comes to her face.\n\n<b>                                     ANNIE\n</b>                         Catch this--\n                              (she throws him a \n                              kiss--it's grotesque)\n                         --ummmm-wahhhh.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, summoning up all his courage, as he mimes catching it \n               and forces a smile on. She waves, closes the door.\n\n               HOLD ON PAUL. The smile dies. He reaches in and pulls the \n               two Novril capsules out of his mouth. Now--\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE SOUND OF A HELICOPTER\n</b>\n<b>                                                                    CUT TO:\n</b>\n<b>               INSIDE THE HELICOPTER\n</b>\n               BUSTER AND PILOT flying along. Buster is all bundled up as \n               he stares out, using the binoculars...\n\n<b>                                                                    CUT TO:\n</b>\n               SOMETHING SHINY reflecting the sun.\n\n               HOLD AS IT ALMOST BLINDS US--we're looking at the part of \n               Paul's Mustang that was revealed by the snow when Buster \n               almost found the car.\n\n<b>                                     BUSTER\n</b>                              (to Pilot)\n                         Walter, we could be skipping lunch \n                         today.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               CRASH SITE\n</b>\n               Paul's car being hoisted by chains from the ground and, as \n               it starts to rise up into the afternoon air...\n\n<b>               PULL BACK TO REVEAL\n</b>\n               THE AREA BY THE CAR--BUSTER is there and a bunch of STATE \n               POLICEMEN and various MEDIA PEOPLE are there--Buster stands \n               with the STATE POLICE CHIEF watching as the car is hoisted \n               via derrick; the sound of the powerful MOTOR lifting the car \n               is enormous and as the car keeps rising higher and higher \n               and PEOPLE take pictures and stare and\n\n<b>                                                                    CUT TO:\n</b>\n               THE STATE POLICE CHIEF is addressing maybe a dozen REPORTERS. \n               It's very cold. BUSTER stands slightly away from the group.\n\n<b>                                     STATE POLICE CHIEF\n</b>                         The presumption must now be that \n                         Paul Sheldon is dead. We know he \n                         somehow crawled out of his car. But \n                         we have been unable to locate his \n                         body in the vicinity of the crash. \n                         We also know if anyone had found \n                         him, they would have taken him to an \n                         area hospital. His body is undoubtedly \n                         out there buried somewhere in the \n                         snow. We'll find him after the first \n                         thaw--unless the animals have gotten \n                         to him first.\n                              (beat)\n                         I'll take questions.\n\n               After the first sentence, a very cold and very unhappy BUSTER \n               leaves the gathering.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL'S CAR as Buster studies it, especially the area by the \n               driver's side where there are still dents visible from Annie's \n               crowbar.\n\n               VIRGINIA moves to him now. They exchange a glance, start \n               walking together toward their car.\n\n<b>                                                                    CUT TO:\n</b>\n               THE CHIEF, surrounded--people are asking questions, raising \n               hands for attention, and as he answers them--\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER AND VIRGINIA, close together, walking toward their \n               car.\n\n<b>                                     VIRGINIA\n</b>                         You don't think he's dead, do you?\n\n<b>                                     BUSTER\n</b>                         He might well be. But not the way \n                         they say. He didn't crawl out of \n                         that car by himself. You saw those \n                         dents on the door--someone pulled \n                         him out.\n\n<b>                                     VIRGINIA\n</b>                         It was an old car--those dents could \n                         have been there forever.\n\n<b>                                     BUSTER\n</b>                         There's two kinds of people that \n                         drive around in old cars: the ones \n                         that can't afford new ones, and the \n                         ones who wouldn't give 'em up for \n                         anything in the world. That second\n                         bunch don't drive around with twenty-\n                         five-year-old dents.\n\n               As they drive off...\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. NIGHT.\n</b>\n               PAUL lies in bed listening to the strains of \"The Love \n               Connection,\" coming from upstairs. As Chuck Woolery drones \n               on, Paul is intently involved in folding a piece of paper \n               from his pad. He is making a container of some sort. He \n               finishes, then reaches down and grabs the Novril capsules \n               that he has been stashing in the mattress.\n\n               Carefully, he opens one and pours it into the palm of his \n               hand. First he smells it--no odor--then he takes a tiny bit \n               on a finger and tastes it--no taste. Then, he takes his paper \n               container and empties the contents of all the pills into it, \n               then places it under the mattress.\n\n               Now, what to do with the empty capsules. He thinks for a \n               second, then--what the hell--he swallows them. He then places \n               the packet back in the mattress.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE TYPEWRITER. DAY.\n</b>\n               The window is visible behind it. From this angle, it almost \n               seems to be staring at PAUL, broken \"n\" and all. PAUL tests \n               his wounded arm. He's able to raise it a few inches, but \n               that's it.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               OUTSIDE THE WINDOW\n</b>\n               ANNIE is visible heading for the barn, followed by MISERY, \n               the pig. For a moment, she stops, turns to look back.\n\n<b>                                     ANNIE\n</b>                              (calling out)\n                         Don't be nervous--\n                              (beat)\n                         --just remember, I'll treasure \n                         whatever you do.\n\n               Now, as she turns again, moves quickly away--\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE TYPEWRITER\n</b>\n<b>                                                                    CUT TO:\n</b>\n               PAUL. He rolls in a piece of paper, types briefly.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               WHAT HE'S WRITTEN, AND IT'S THIS:\n</b>\n                                    \"Misery's Retur .\"\n\n                                      By Paul Sheldo\n\n                                    for A  ie Wilkes.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, studying the paper. He takes it out, starts to roll in \n               a new sheet.\n\n<b>                                                                    CUT TO:\n</b>\n               THE MACHINE as the new sheet is rolled in.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring at the blank page. He takes a deep breath, \n               glances outside, then back to the paper.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE BLANK PAGE\n</b>\n<b>                                                                    CUT TO:\n</b>\n               PAUL, and now there's a brief light behind his eyes and \n               suddenly he types a burst, stares at what he's written.\n\n<b>                                                                    CUT TO:\n</b>\n               THE PAPER and these words: \"fuckfuckfuckfuckfuck.\"\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. He closes his eyes briefly, mutters something, kind of \n               nods, opens his eyes, grabs for another piece of paper, rolls \n               it in and starts mechanically to type.\n\n<b>                                                               DISSOLVE TO:\n</b>\n               A NEW PIECE OF PAPER with the words \"Chapter Two\" and a half \n               paragraph of writing as we\n\n<b>               PULL BACK TO REVEAL\n</b>\n               PAUL WORKING in his room. ANNIE  enters, the first pages of \n               manuscript in her hands. It's dusk.\n\n<b>                                     ANNIE\n</b>                         I'm sorry, Paul. This is all wrong, \n                         you'll have to do it over again.\n\n<b>                                     PAUL\n</b>                              (totally stunned)\n                         What? What happened to \"I'll treasure\n                         whatever you do?\"\n\n<b>                                     ANNIE\n</b>                         Paul, it's not worthy of you. Throw \n                         it all out except for the part of \n                         naming that gravedigger after me. \n                         You can leave that in.\n\n<b>                                     PAUL\n</b>                         I really value your criticism, but \n                         maybe you're being a little hasty \n                         here.\n\n<b>                                     ANNIE\n</b>                         Paul, what you've written just isn't \n                         fair.\n\n<b>                                     PAUL\n</b>                         --not fair?\n\n<b>                                     ANNIE\n</b>                         That's right--when I was growing up \n                         in Bakersfield, my favorite thing in \n                         all the world was to go to the movies \n                         on Saturday afternoons for the chapter \n                         plays...\n\n<b>                                     PAUL\n</b>                              (it just comes out)\n                         --cliff-hangers--\n\n<b>                                     ANNIE\n</b>                              (suddenly angry)\n                         I know that, Mister Man--they also \n                         call them serials. I'm not stupid, \n                         you know.\n                              (and she's a child \n                              again)\n                         Anyway, my favorite was Rocket Man, \n                         and once it was a no-brakes chapter, \n                         the bad guys stuck him in a car on a \n                         mountain road and knocked him out \n                         and welded the doors shut and tore \n                         out the brakes and started him to \n                         his death and he woke up and tried \n                         to steer and tried to get out, but \n                         the car went off a cliff before he \n                         could escape and it crashed and burned \n                         and--I was so upset and excited and \n                         the next week you better believe I \n                         was first in line and they always \n                         start with the end of the last week \n                         and there was Rocket Man trying to \n                         get out, and here came the cliff and \n                         JUST BEFORE the car went off he jumped \n                         free and all the kids cheered--\n                              (standing up now)\n                         --but I didn't cheer, I stood right \n                         up and started shouting, \"This isn't \n                         what happened last week--have you \n                         all got amnesia?--THEY JUST CHEATED \n<b>                         US--THIS WASN'T FAIR--\"\n</b>\n               ANNIE: CLOSE UP. Still in her childhood reverie. Shouting:\n\n<b>                                     ANNIE\n</b><b>                         \"HE DIDN'T GET OUT OF THE COCKADOODIE \n</b><b>                         CAR!\"\n</b>\n<b>                                     PAUL\n</b>                         They always cheated like that in \n                         cliff--\n                              (stops himself)\n                         --chapter plays.\n\n<b>                                     ANNIE\n</b>                         But not you. Not with my Misery. \n                         Remember, Ian did ride for Dr. Cleary \n                         at the end of the last book, but his \n                         horse fell jumping that fence and \n                         Ian broke his shoulder and his ribs \n                         and lay there all night in the ditch \n                         so he never reached the doctor, so \n                         there couldn't have been any \n                         \"experimental blood transfusion\" \n                         that saved her life. Misery was buried \n                         in the ground at the end, Paul, so \n                         you'll have to start there.\n\n               As she goes--\n\n<b>                                     PAUL\n</b>                         Look at this, I've got Lizzie Borden \n                         for an editor, here.\n\n               PAUL slumps, staring barefully at the typewriter.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               OUTSIDE THE FARMHOUSE. NIGHT.\n</b>\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               OUTSIDE THE FARMHOUSE. NEXT MORNING.\n</b>\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. DAY.\n</b>\n               PAUL is at the table. He takes the Novril off his breakfast \n               tray, wheels over to the bed, and stuffs them into the \n               mattress. He hears FOOTSTEPS coming down the hall. He smoothly \n               wheels back to the table. A pause.\n\n               ANNIE enters to remove the tray.\n\n<b>                                     ANNIE\n</b>                         What's the matter, Paul? You haven't \n                         written a word.\n\n<b>                                     PAUL\n</b>                         I can't write this anymore.\n\n<b>                                     ANNIE\n</b>                         Don't be silly. Of course you can.\n\n<b>                                     PAUL\n</b>                         I'm telling you, I can't.\n\n<b>                                     ANNIE\n</b>                         You can--you have the \"gotta\"--\n\n<b>                                     PAUL\n</b>                         The what?\n\n<b>                                     ANNIE\n</b>                         The \"gotta.\" Remember, you talked \n                         about it in Playboy magazine. You \n                         said there's a million things you \n                         can't do in this world; you can't \n                         hit a curve ball, you can't fix a \n                         leaky faucet or make a marriage work-- \n                         but there's one thing you always \n                         have, and that's the power of the \n                         \"gotta.\"\n\n<b>                                     PAUL\n</b>                         I said that?\n\n<b>                                     ANNIE\n</b>                         You said you can make it so they \n                         gotta turn the page. You know, \"I \n                         'gotta' know will she live,\" \"I\n                         'gotta' know will he catch the \n                         killer.\" \"I gotta see how this chapter \n                         ends.\" You said it. I don't usually \n                         buy that magazine. I only got it, \n                         'cause they were interviewing you.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL: CLOSE UP. Blinking.\n\n<b>                                     PAUL\n</b>                              (quietly)\n                         What about a bee...?\n\n<b>                                     ANNIE\n</b>                         What?\n\n<b>                                     PAUL\n</b>                         Nothing.\n\n<b>                                                                    CUT TO:\n</b>\n               THE KEYBOARD as the piece of paper slides in and the keys  \n               start to move. Annie stands there for a moment, then quietly \n               backs out of the room.\n\n<b>                                                               DISSOLVE TO:\n</b>\n               THE WINDOW. It's late afternoon.\n\n<b>               PULL BACK TO REVEAL\n</b>\n               PAUL in the wheelchair watching as ANNIE finishes reading.\n\n<b>                                     PAUL\n</b>                         Well, is it fair? Should I keep going?\n\n<b>                                     ANNIE\n</b>                         You better. Oh, Paul, when Ian \n                         realized that the reason they'd buried \n                         Misery alive was because the bee \n                         sting had put her in that temporary \n                         coma--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, in a fervor.\n\n<b>                                     ANNIE\n</b>                         --and when Gravedigger Wilkes \n                         remembered how thirty years earlier, \n                         the same thing had happened to Lady \n                         Evelyn-Hyde--\n                              (hands clasped)\n                         --and then old Dr. Cleary deduced \n                         that Misery must be Lady Evelyn-Hyde's \n                         long-lost daughter because of the \n                         rarity of deadly bee-stings--my heart \n                         just leapt.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, watching her. It's as if he had nothing to do with \n               anything she's read as she goes on.\n\n<b>                                     ANNIE\n</b>                         I've known from the very first book \n                         that Misery had to be born of nobility \n                         and I was right!\n\n<b>                                     PAUL\n</b>                              (mumbling  to himself)\n                         Yeah, yeah...\n\n<b>                                                                    CUT TO:\n</b>\n               THE TWO OF THEM; she touches the pages as if they were gold, \n               rubbing gently with the tips of her fingers.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul, can I read each chapter \n                         when you finish? I can fill in the \n                         \"n\"s.\n                              (Paul nods, and she's \n                              off again)\n                         Will she be her old self, now that \n                         Ian has dug her out, or will she \n                         have amnesia...?\n\n<b>                                     PAUL\n</b>                         ...have to wait.\n\n<b>                                     ANNIE\n</b>                         Will she still love him with that \n                         special perfect love?\n\n<b>                                     PAUL\n</b>                         Have to wait.\n\n<b>                                     ANNIE\n</b>                              (plead ing)\n                         Not even a hint?\n\n               Paul shakes his head.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, spinning around the room like a happy child.\n\n<b>                                     ANNIE\n</b>                         Misery's alive! Misery's alive. Oh, \n                         it's so romantic--this whole house \n                         is going to be filled with romance. \n                         I'm going to put on my Liberace \n                         records--\n                              (Stops, looks at Paul)\n                         --you do like Liberace, don't you?\n\n<b>                                     PAUL\n</b>                              (quickly)\n                         Whenever he played Radio City, who \n                         do you think was right there in the\n                         front row?\n\n<b>                                     ANNIE\n</b>                         I'm going to play my records all day\n\n<b>                                     LONG\n</b>                         --to inspire you--he's my all-time \n                         favorite.\n\n               And with that, she starts to leave.\n\n<b>                                     PAUL\n</b>                         Annie?\n\n               She stops at the door.\n\n<b>                                     PAUL\n</b>                         Would you have dinner with me tonight?\n\n               She can't speak.\n\n<b>                                     PAUL\n</b>                         To celebrate Misery's return. I \n                         couldn't have done it without you.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul. It would be an honor.\n\n               ANNIE dashes excitedly out of the room. PAUL wheels over to \n               the bed, pulls the packet of Novril powder out from the \n               mattress and stuffs it in his pants. The sound of Liberace \n               playing \"Tammy\" with orchestra and chorus booms in from beyond \n               the door.\n\n<b>                                     PAUL\n</b>                         Jesus Christ.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               BUSTER'S OFFICE. DUSK.\n</b>\n               VIRGINIA is on the phone.\n\n<b>                                     VIRGINIA\n</b>                              (into phone)\n                         No, he's not here. I don't know where \n                         he went. He never tells me anything \n                         anymore. He's probably out having an \n                         affair somewhere. Wait a minute. I \n                         think I hear him coming.\n\n               BUSTER enters carrying a bagful of books.\n\n<b>                                     VIRGINIA\n</b>                              (to Buster)\n                         It's Jim Taylor. He wants to know \n                         who you've been having an affair \n                         with.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. He puts the bag down, shoots Virginia a look and \n               grabs the phone. VIRGINIA looks in the bag.\n\n<b>                                     BUSTER\n</b>                         Hey, Jim, what's doing? Uh-huh... uh-\n                         huh... Jim, we've been over this. If \n                         you're gonna have benches in front \n                         of your store, people are gonna sit \n                         on them. I don't like him either, \n                         but I'm not going to come over there \n                         and tell him to move. Give my best \n                         to Denise. Bye.\n\n<b>                                     VIRGINIA\n</b>                              (looking through the \n                              books; all paperback \n                              Misery novels)\n                         Well, whoever she is, she sure likes \n                         to read a lot.\n\n<b>                                     BUSTER\n</b>                         Virginia, I'm flattered you think I \n                         got that much energy. I just figured \n                         if I can't find Paul Sheldon, at \n                         least I can find out what he wrote \n                         about.\n\n<b>                                     VIRGINIA\n</b>                         What do you expect to find? A story \n                         about a guy who drove his car off a \n                         cliff in a snowstorm?\n\n<b>                                     BUSTER\n</b>                         Now, you see, it's that kind of \n                         sarcasm that's given our marriage\n                         real spice.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               STUDY. NIGHT.\n</b>\n               PAUL is sitting at a table that Annie has set up with her \n               best china and silverware. It is as romantic as Annie Wilkes \n               gets. ANNIE enters, carrying a basket of rolls. She sits and \n               serves Paul.\n\n<b>                                     ANNIE\n</b>                         I hope you like it.\n\n<b>                                     PAUL\n</b>                         It looks wonderful. And so do you.\n\n<b>                                     ANNIE\n</b>                         Oh...\n\n               They eat in awkward silence. Finally:\n\n<b>                                     PAUL\n</b>                         I've never had meatloaf this good,\n                         what do you do to it?\n\n<b>                                     ANNIE\n</b>                         My secret is I only use fresh \n                         tomatoes, never canned. And to give \n                         it that little extra zip, I mix in\n                         some Spam with the ground beef.\n\n<b>                                     PAUL\n</b>                         Oh.\n                              (pause)\n                         You can't get this in a restaurant \n                         in New York.\n\n               After another pause:\n\n<b>                                     PAUL\n</b>                         Annie, I think we should have a toast.\n\n<b>                                     ANNIE\n</b>                         A toast?\n\n<b>                                     PAUL\n</b>                         Yes, to Misery. Let me pour you some\n                         more wine.\n\n               Paul pours more of the Gallo wine, then raises his glass.\n\n<b>                                     ANNIE\n</b>                         To Misery.\n\n<b>                                     PAUL\n</b>                         Wait, let's do this right. Do you \n                         have any candles?\n\n<b>                                     ANNIE\n</b>                         Oh, I don't know. I think so. I'll \n                         go look.\n\n               She exits into the kitchen. PAUL quickly pulls the packet \n               filled with Novril powder from his pants. He empties it into \n               her glass of wine, stuffs the empty packet back into his \n               pants, talking the whole time:\n\n<b>                                     PAUL\n</b>                         Did you study decorating, or do you \n                         just have a flair?\n\n<b>                                     ANNIE\n</b>                         Oh, you. I just picked things up \n                         over the years.\n\n<b>                                     PAUL\n</b>                         Well, it certainly says you.\n\n<b>                                     ANNIE\n</b>                         You really think so?\n\n<b>                                     PAUL\n</b>                         Absolutely. Listen, if you can't \n                         find any, it's okay. I just thought\n                         it might be nice.\n\n               ANNIE re-enters with a candle.\n\n<b>                                     ANNIE\n</b>                         Are you kidding? If anyone ever told \n                         me that one day I'd be having a \n                         candlelit dinner with Paul Sheldon \n                         in my own house, I woulda checked \n                         both legs to see which one was being \n                         pulled. Will this do?\n\n<b>                                     PAUL\n</b>                         It's perfect.\n\n               She places the candle on the table. With a slight tremor in \n               her hand, she lights the candle. PAUL raises his glass.\n\n<b>                                     PAUL\n</b>                         To Misery and Annie Wilkes, who \n                         brought her back to life.\n\n               ANNIE raises her glass.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul, every time I think about \n                         it, I get goosebumps.\n\n               They clink glasses.\n\n               And with that, her emotions having gotten the best of her, \n               she knocks over the candle. In trying to right the situation, \n               she places her glass back down, and as she reaches for the \n               candle, she knocks over her glass, spilling the wine.\n\n<b>                                     ANNIE\n</b>                              (wiping up the spilled \n                              wine with her napkin)\n                         Oh, God, what have I done? I'm so \n                         sorry, Paul. I ruined your beautiful \n                         toast. Will you ever forgive me? \n                         Here, let me pour another one.\n                              (she does)\n                         Can we pretend this never happened? \n                         To Misery?\n\n<b>                                     PAUL\n</b>                         To Misery.\n\n               So they drink their wine.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               OUTSIDE THE FARMHOUSE. DAY.\n</b>\n               The snow, although still present, has melted somewhat. And \n               starting now and continuing throughout is this: the sound of \n               typing.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM\n</b>\n               PAUL, working at his typewriter.\n\n<b>                                                                    CUT TO:\n</b>\n               THE MANUSCRIPT. Growing.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE'S BEDROOM. DUSK.\n</b>\n               ANNIE, in her room. Reading and loving it.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               BUSTER'S DEN. NIGHT.\n</b>\n               BUSTER sitting in his den reading a Misery novel by the fire. \n               VIRGINIA brings him a cup of tea.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. DAY.\n</b>\n               PAUL, the sling off, moving his injured arm. It's more mobile \n               than before. Testing his strength, he uses his arm to remove \n               the page and place it on the pile. He puts in another page \n               and continues to type.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, entering Paul's room, carrying a chapter. Handing him \n               a cup of tea.\n\n<b>                                     ANNIE\n</b>                         Paul, this is positively the best \n                         Misery you've ever written.\n\n<b>                                     PAUL\n</b>                         I think you're right.\n\n<b>                                                                    CUT TO:\n</b>\n               THE PILE OF PAPER. Bigger.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               OUTSIDE THE BARN\n</b>\n               ANNIE, out by the barn. She stares in at the house. Framed \n               in the window is PAUL, working. She smiles, enters the barn.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. NIGHT.\n</b>\n               He stretches but only briefly, then back to his typing.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE KITCHEN\n</b>\n               ANNIE, cooking happily away, reading a chapter.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM\n</b>\n               PAUL, arm out of the sling. He manages to lift the typewriter \n               once, sets it back down, puts the sling back on.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. LATER.\n</b>\n               ANNIE, bringing a tray of food.\n\n<b>                                     ANNIE\n</b>                         I think it's so wonderful that Misery \n                         would sacrifice her title to take up \n                         the cause of her people. That's true \n                         nobility.\n\n               Paul hands her some new pages. As she exits,\n\n<b>                                                                    CUT TO:\n</b>\n<b>               BUSTER'S OFFICE\n</b>\n               BUSTER, in his office reading. He is alone.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE'S LIVING ROOM. NIGHT.\n</b>\n               Annie is reading by the fire. Her pig Misery sits beside \n               her, staring at the pages.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. DAY.\n</b>\n               His fingers just fly, faster than he's ever typed and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. NIGHT.\n</b>\n               Paul, staring and\n\n<b>                                                                    CUT TO:\n</b>\n               THE PILE, growing, growing and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S FINGERS\n</b>\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM\n</b>\n               PAUL, ripping open a new ream of paper...\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. DUSK.\n</b>\n               His lips move silently. He's not even aware of it as he nods \n               and...\n\n<b>                                                                    CUT TO:\n</b>\n               THE PAPER IN THE TYPEWRITER, line after line being written.\n\n<b>                                                             INTERCUT WITH:\n</b>\n               Paul's face at DAY, NIGHT, and DUSK in rapid succession, \n               ending with\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE'S FARMHOUSE. NIGHT.\n</b>\n               Lightning! Giant deep rolls of THUNDER as RAIN begins...\n\n<b>                                                                    CUT TO:\n</b>\n               TYPEWRITER being lifted out of frame, then back in, then out \n               again.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. NIGHT.\n</b>\n               The pile of manuscript has doubled. Maybe two hundred pages.\n\n               PAUL, with some effort, is pumping the typewriter up and \n               down. Finally, he places it back down and puts his arm back \n               in the sling.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, looking outside breifly.\n\n<b>                                                                    CUT TO:\n</b>\n               THE RAIN. Worse. The SOUND hit s the roof of the house, hits \n               the window.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, lumbering in--she's never looked like this: She's \n               wearing her slippers and her pink quilted housecoat. Her \n               eyes are without life. Her hair, loose and straggly, hangs \n               around her face. Slowly, like a  robot, she goes to PAUL, \n               who looks silently up at her.\n\n<b>                                     ANNIE\n</b>                         Here's your pills.\n\n               She drops them on the table.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, as the pills hit his chest and bounce into his lap.\n\n<b>                                     PAUL\n</b>                         Annie, what is it?\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE\n</b>\n<b>                                     ANNIE\n</b>                              (half turns away, \n                              turns back, gestures \n                              outside)\n                         The rain... sometimes it gives me \n                         the blues.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE: CLOSE UP. And suddenly it's as if she's been turned \n               off, gone lifeless.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring at her. No sound but the rain.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, seen straight on. No light in her eyes.\n\n<b>                                     ANNIE\n</b>                         When you first came here, I only \n                         loved the writer part of Paul Sheldon. \n                         But now I know I love the rest of \n                         him too. As much as Misery loves \n                         Ian.\n                              (beat)\n                         I know you don't love me--don't say \n                         you do--you're a beautiful, brilliant, \n                         famous man of the world; and I'm...not \n                         a movie star type. You'll never know \n                         the fear of losing someone like you \n                         if you're someone like me.\n\n<b>                                     PAUL\n</b>                         Why would you lose me?\n\n<b>                                     ANNIE\n</b>                         The book is almost finished. Your \n                         legs are getting better. Soon you'll \n                         be able to walk. You'll be wanting\n                         to leave.\n\n<b>                                     PAUL\n</b>                         Why would I want to leave? I like it\n                         here.\n\n<b>                                     ANNIE\n</b>                         That's very kind of you, but I'll \n                         bet it's not altogether true.\n\n<b>                                     PAUL\n</b>                         It is.\n\n               She slowly reaches into the pocket of her bathrobe and pulls \n               out a .38 Special.\n\n<b>                                     ANNIE\n</b>                         I have this gun, and sometimes I \n                         think about using it.\n\n               She is absentmindedly clicking the empty gun.\n\n<b>                                     ANNIE\n</b>                         I better go now. I might put bullets \n                         in it.\n\n               Robot-like, she crosses to the door and leaves. As she closes \n               and locks the door--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, stunned, listening, waiting--\n\n               --here is the sound of the front door closing--\n\n               --then footsteps on the outside walk--\n\n               --the sound of a car door opening and slamming shut.\n\n               Now comes the GUNNING of the motor.\n\n<b>                                                                    CUT TO:\n</b>\n               THE WINDOW as ANNIE drives by, hunched over the wheel. The \n               MOTOR sound grows fainter, faint...\n\n<b>                                                                    CUT TO:\n</b>\n<b>               BUSTER AND VIRGINIA'S BEDROOM. NIGHT.\n</b>\n               BUSTER AND VIRGINIA are lying in bed. Buster is reading yet \n               another Misery novel, Misery's Trial. Virginia is also \n               reading.\n\n<b>                                     BUSTER\n</b>                         \"There is a justice higher than that \n                         of man. I will be judged by Him.\"\n\n<b>                                     VIRGINIA\n</b>                         What?\n\n<b>                                     BUSTER\n</b>                         They're hauling Misery into court.\n\n<b>                                     VIRGINIA\n</b>                         That's nice.\n\n<b>                                     BUSTER\n</b>                              (mutters under his \n                              breath)\n                         \"There is a justice higher than that \n                         of man--I will be judged by Him.\"\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE'S KITCHEN.\n</b>\n               The kitchen KNIVES on the counter.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, now using both arms, forcing his body up toward them.\n\n               This isn't easy, it was a bitch the first time he tried it, \n               but nothing's going to stop him now. He's leaning against \n               the cupboard, using it for balance--\n\n               --his balance starts to go but he won't let it as we\n\n<b>                                                                    CUT TO:\n</b>\n               THE KNIVES, AS HIS HAND grabs the largest one, a fat-handled \n               sharp beauty and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, and you can sense the relief as he begins to lower \n               himself to the floor.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE STUDY\n</b>\n               PAUL, back in his wheelchair, knife in his lap, carefully \n               opening drawers of little tables, looking inside. He closes \n               them, moves on, unmindful of the rain. Now--\n\n<b>                                                                    CUT TO:\n</b>\n               THE SHELF OF PAUL SHELDON BOOKS. As before--\n\n               --except the \"My Life\" scrapbook is gone.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, glancing around--\n\n               --and there it is, on a coffee table in the living room. \n               Also on the table are a roll of Scotch tape, a pair of \n               scissors, and a copy of Newsweek. Paul wheels toward the \n               table and the book, which is as big as a folio Shakespeare \n               play and as thick as a family Bible.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE LIVING ROOM\n</b>\n               PAUL, opening the book.\n\n<b>                                                                    CUT TO:\n</b>\n               THE FIRST PAGE OF THE BOOK, as Paul opens it. It's a newspaper \n               clipping as is almost all of what follows. A small article: \n               simply a birth announcement for Anne Marie Wilkes.\n\n               PAUL turns the page. This headline reads: \"Investment Banker \n               Carl Wilkes Dies in Freak Fall.\"\n\n               \"USC Nursing Student Dies in Freak Fall.\" That's the headline \n               on the next page.\n\n               Now: \"Miss Wilkes is Nursing School Honors Graduate.\"\n\n               Paul turns the page.\n\n               Manchester, New Hampshire, Union Leader: \"Ernest Gonyar, 79, \n               Dies After Long Illness.\"\n\n               Now that phrase seems to be what catches our eye--\"after \n               long illness\" is from the next article. \"Long illness\" from \n               the one after that. Then, on the next page, a variation: \n               \"Short Illness.\"\n\n               Now we're in Pennsylvania: \"New Hospital Staff Announced.\"\n\n               And here come those phrases again on page after page--\"After \n               Long Illness.\" \"After Long Illness.\"\n\n               \"After Long Illness.\"\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, transfixed; he keeps on turning the pages--the states \n               keep changing, moving west. Pennsylvania to Minnesota, \n               Minnesota to North Dakota. And always the clippings reporting \n               deaths and deaths and--\n\n               --and now we're in Colorado. \"NEW HEAD MATERNITY NURSE NAMED.\" \n               And now the dead are young and helpless; babies. More and \n               more of them.\n\n<b>                                     PAUL\n</b>                              (stunned)\n                         Holy shit.\n\n               Then a headline which reads:\n\n<b>               \"HEAD MATERNITY NURSE QUESTIONED ON INFANT DEATHS\"\n</b>\n               Next page: \"MISS WILKES RELEASED.\"\n\n               Next page: \"THREE MORE INFANTS DIE.\"\n\n               Next page, at last: \"DRAGON LADY ARRESTED.\"\n\n               Then a photo: the front page of the Rocky Mountain Gazette. \n               Annie on the courthouse steps. \"DRAGON LADY CLAIMS INNOCENCE,\" \n               under which there is a statement by Annie Wilkes.\n\n               Paul turns quickly to the next page and a very large headline:\n\n<b>               \"DRAGON LADY FOUND NOT GUILTY\"\n</b>\n               PAUL just sits there, shaking his head in bewilderment.\n\n<b>                                                                    CUT TO:\n</b>\n               THE BOOK, as Paul turns the LAST page.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, stunned and now we find out why, as we\n\n<b>                                                                    CUT TO:\n</b>\n               THE PAGE IN THE BOOK. It's an article from Newsweek magazine, \n               a picture of Paul's car being hauled up out of the snow. \n               Above it this caption: \"Presumed Dead--Paul Sheldon.\"\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. Slamming the book shut, putting it back on the coffee \n               table, then quickly turning his wheelchair as we\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, steering his wheelchair toward the front door. He tries \n               to position himself for a surprise attack of ANNIE, but he \n               can't find a way to get close enough. The wheelchair is too \n               cumbersome. He looks around and decides to head back to his \n               room. He is faced with the same problem there--so he struggles \n               into bed and, lying on his back, he rests the knife on his \n               chest and stares up at the ceiling.\n\n<b>                                                               DISSOLVE TO:\n</b>\n               PAUL'S WINDOW, hours later. The rain has stopped.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL--trying to stay awake. After a few beats, he hears \n               something. It's the sound of a CAR PULLING UP.\n\n               HEADLIGHTS can be seen flashing through the window. PAUL \n               grips the knife and hides it under the covers. The sound of \n               a CAR DOOR OPENING AND CLOSING, then FOOTSTEPS.\n\n               As the FRONT DOOR OPENS, PAUL girds himself for attack. THE \n               FRONT DOOR CLOSES, then a couple of FOOTSTEPS. Then silence. \n               Then the FOOTSTEPS continue down the hall and up the stairs.\n\n               After a beat, we hear the TELEVISION. Someone is explaining \n               how you can buy millions of dollars of prime real estate \n               with no money down.\n\n               PAUL, allowing himself to relax, slips the knife under the \n               mattress. As the TV DRONES ON, Paul lies staring up at the \n               ceiling.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               OUTSIDE THE FARMHOUSE. NIGHT.\n</b>\n               We hear a clap of THUNDER and once again the rain pours down.\n\n<b>                                                                    CUT TO:\n</b>\n               CLOSE UP: PAUL--eyes closed. There is another loud THUNDERCLAP \n               which causes Paul to stir and open his eyes.\n\n               He turns his head and another CLAP OF THUNDER is heard, \n               LIGHTNING flashes and reveals ANNIE standing over his bed.\n\n               Before he can react, she jabs a needle into his arm, pulls \n               it out and starts out of the room.\n\n               PAUL tries to raise himself, but the power of the drug causes \n               him to collapse, unconscious.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE ROOM. EARLY MORNING.\n</b>\n               It's stopped raining, PAUL lies asleep. Now, surprisingly, \n               we hear a VOICE we've never heard in the movie before--loud--\n               for an instant we don't recognize the voice, then we do: \n               It's LIBERACE talking to his audience on a record going, \n               \"Thank you, thank you, what a wonderful thing it is for me \n               to be back with you in Paris...\" PAUL stirs and awakens to \n               discover that he is strapped to his bed. He can move his \n               arms, but that's it.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, standing in the room, and she looks very together; \n               her eyes are bright. Too bright. Way too bright.\n\n               She comes to the foot of his bed.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, groggy from being drugged, tries to clear the cobwebs.\n\n<b>                                     ANNIE\n</b>                              (in a soft voice)\n                         Paul, I know you've been out.\n\n<b>                                     PAUL\n</b>                         What?\n\n<b>                                     ANNIE\n</b>                         You've been out of your room.\n\n<b>                                     PAUL\n</b>                         No, I haven't.\n\n<b>                                     ANNIE\n</b>                         Paul, my little ceramic penguin in \n                         the study always faces due south.\n\n<b>                                     PAUL\n</b>                         I don't know what you're talking \n                         about.\n\n               PAUL looks up at her--he is totally honest and sincere. As \n               he talks, his hand surreptitiously begins moving toward the \n               mattress edge.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, as she brings the fat-hand led knife out of her skirt \n               pocket.\n\n<b>                                     ANNIE\n</b>                         Is this what you're looking for? I \n                         know you've been out twice, Paul. At \n                         first, I couldn't figure out how you \n                         did it, but last night I found your \n                         key.\n                              (She holds up the \n                              bobby pin)\n                         I know I left  my scrapbook out, and \n                         I can imagine what you might be \n                         thinking of me. But you see, Paul, \n                         it's all okay.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, as she walks slowly back to the foot of the bed.\n\n               And now a THUMP comes from the foot of the bed. Something is \n               out of sight.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring at her; waiting.\n\n<b>                                     ANNIE\n</b>                         Last night it came so clear. I realize \n                         you just need more time. Eventually, \n                         you'll come to accept the idea of \n                         being here. Paul, do you know about \n                         the early days at the Kimberly Diamond \n                         Mine? Do you know what they did to \n                         the native workers who stole diamonds? \n                         Don't worry, they didn't kill them. \n                         That would be like junking a Mercedes \n                         just because it had a broken spring--\n                         no, if they caught them they had to \n                         make sure they could go on working, \n                         but they also had to make sure they \n                         could never run away. The operation \n                         was called hobbling.\n\n               And with that, she reaches down out of sight and comes up \n               holding a 16-inch piece of 4 x 4 wood.\n\n<b>                                     PAUL\n</b>                         Annie, whatever you're thinking about, \n                         don't do it.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE. She wedges the 4 x 4 firmly between his legs, just \n               above the ankles, secures it and adjusts his feet.\n\n<b>                                     ANNIE\n</b>                         Now don't fuss, Paul.\n\n<b>                                     PAUL\n</b>                         Why would I run away? I'm a writer, \n                         Annie--it's all I am--and I've never \n                         written this well--even you said \n                         that this is my best, didn't you?\n\n               ANNIE picks up a sledgehammer.\n\n<b>                                     PAUL\n</b>                         Didn't you? Why would I leave a place \n                         where I'm doing my best work? It \n                         doesn't make any sense.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, positioning herself to the side of his right ankle.\n\n<b>                                     ANNIE\n</b>                         Shh, darling, trust me--\n                              (taking aim at his \n                              ankle)\n                         It's for the best.\n\n               She takes the sledgehammer back.\n\n<b>                                     PAUL\n</b>                         Annie, for God's sake, please.\n\n               As ANNIE swings, the sledgehammer makes contact with the \n               ankle. It breaks with a sharp CRACK.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL: CLOSE UP, shrieking.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, moving to the other side of the bed.\n\n<b>                                     ANNIE\n</b>                         Almost done, just one more.\n\n               And as she breaks the other ankle, PAUL shrieks even louder.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               ANNIE: CLOSE UP.\n</b>\n<b>                                     ANNIE\n</b>                         God, I love you...\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL'S FACE. He is beyond agony.\n\n<b>                                                             FADE TO BLACK:\n</b>\n               For a long moment, nothing.\n\n               Then... a FAINT SOUND. After a moment, it begins to become \n               more intrusive and we can tell what it is: a car horn HONKING.\n\n<b>               FADE IN ON:\n</b>\n               SILVER CREEK and ANNIE in her Cherokee, HONKING for another \n               car to get a move on.\n\n<b>                                                                    CUT TO:\n</b>\n               A HAND AND A COIN MOVING ACROSS IT, from finger to finger.\n\n<b>               PULL BACK TO REVEAL\n</b>\n               BUSTER, sitting by the front window of his office, reading \n               The Rocky Mountain Gazette.\n\n               He watches idly as ANNIE yells out the window to the car in \n               front of her. THE DRIVER of the car yells back. Annie yells \n               louder. The Driver guns off, and Annie pulls into the parking \n               space next to the General Store.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, getting out, shaking a fist at the other car, calling \n               out, \"You poop!\" She enters the store.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, staring straight ahead. Something is gnawing at him.\n\n<b>                                                                    CUT TO:\n</b>\n               VIRGINIA, in his office, tidying the desk. BUSTER enters, \n               looks angry.\n\n<b>                                     BUSTER\n</b>                         Just leave it, all right?\n\n<b>                                     VIRGINIA\n</b>                         Oh, I like that tone.\n\n<b>                                     BUSTER\n</b>                         How many times do I have to tell you--\n                         I have a system here.\n                              (rooting through a \n                              pile of papers)\n                         Where the hell is that thing?\n\n<b>                                     VIRGINIA\n</b>                         What thing?\n\n<b>                                     BUSTER\n</b>                         That thing.\n                              (finding what he's \n                              looking for, a 3 x 5 \n                              card)\n                         Here it is. Right where it's supposed \n                         to be.\n\n<b>                                     VIRGINIA\n</b>                         What is it?\n\n<b>                                     BUSTER\n</b>                         I'm not sure. Maybe nothing.\n\n<b>                                     VIRGINIA\n</b>                         It's good you found it.\n\n<b>                                     BUSTER\n</b>                         There's that spice again.\n\n               As BUSTER leaves, VIRGINIA goes back to tidying the desk.\n\n<b>                                                                    CUT TO:\n</b>\n               A LARGE LIBRARY as Buster leaves his car, hurries inside and\n\n<b>                                                                    CUT TO:\n</b>\n<b>               LIBRARY STACKS\n</b>\n               BUSTER, wearing bifocals, sits poring over bound volumes of \n               The Rocky Mountain Gazette.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, frustrated, puts one set of volumes down, picks up \n               another, starts through it, as we\n\n<b>                                                                    CUT TO:\n</b>\n               THE ROCKY MOUNTAIN GAZETTE, as the pages turn.\n\n               --only now they stop moving.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, tense, adjusting his bifocals.\n\n<b>                                                                    CUT TO:\n</b>\n               A SERIES OF HEADLINES pertaining to Annie Wilkes' murder \n               trial.\n\n<b>                                                                    CUT TO:\n</b>\n               A HEADLINE which reads, \"DRAGON LADY CLAIMS INNOCENCE.\"\n\n               Under a PICTURE OF ANNIE on the courthouse steps, we see a \n               CAPTION: \"Wilkes told reporters on the courthouse steps, \n               'There is a higher justice than that of man; I will be judged \n               by Him.'\"\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. He takes the 3 x 5 card out of his pocket.\n\n<b>                                                                    CUT TO:\n</b>\n               The CARD--on it is printed the exact quote we just saw in \n               the paper.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, sitting there, staring at the quote.\n\n<b>                                     BUSTER\n</b>                         Interesting.\n\n               HOLD ON HIS FACE, then--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, carrying a bag of feed, followed by MISERY, the sow, \n               comes into view. She slows, smiles, waves--\n\n<b>                                     ANNIE\n</b>                         Hi, Punkin.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring out at her.\n\n<b>                                     ANNIE\n</b>                         Give us a smile?\n                              (Paul gives her the \n                              finger. She laughs)\n                         Such a kidder.\n\n               As she exits our view--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, lifting the typewriter and repeatedly raising it over \n               his head, this time without any difficulty.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE GENERAL STORE IN SILVER CREEK. EARLY AFTERNOON.\n</b>\n               BUSTER enters. The place is empty. It's one of those wonderful \n               spots that stocks pretty much everything in what seems like \n               complete disarray. Buster goes to the coffee urn behind the \n               counter, helps himself. He speaks to the guy who sits behind \n               the counter nearby; these two have known each other forever.\n\n<b>                                     BUSTER\n</b>                         Hey, Pete.\n\n<b>                                     PETE\n</b>                         Buster.\n\n<b>                                     BUSTER\n</b>                         Answer me a couple things?\n\n<b>                                     PETE\n</b>                         If I can.\n\n<b>                                     BUSTER\n</b>                         Do you have any of those new Paul \n                         Sheldon books?\n\n<b>                                     PETE\n</b>                         We had a batch. Sold 'em all in three \n                         days.\n\n<b>                                     BUSTER\n</b>                         You wouldn't happen to remember if \n                         Miz Wilkes bought one, would you?\n\n<b>                                     PETE\n</b>                         Are you kidding? Every time that \n                         fella writes a book, she makes me \n                         set aside the first copy.\n\n               BUSTER opens the cash register, drops his coffee money inside, \n               closes the register.\n\n<b>                                     BUSTER\n</b>                         Has she been buying any odd things \n                         lately?\n\n<b>                                     PETE\n</b>                         Miz Wilkes? Same old stuff.\n                              (beat)\n                         --Lest you call paper odd.\n\n<b>                                     BUSTER\n</b>                         Newspapers?\n\n<b>                                     PETE\n</b>                              (mimes typing)\n                         No, the typing kind.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               BUSTER: CLOSE UP\n</b>\n<b>                                     BUSTER\n</b>                         Oh. That kind. Nothing odd about \n                         that.\n\n               He cannot hide his excitement now as we--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, entering Paul's room. He lies back in the wheelchair, \n               eyes closed. Liberace music playing in the background. From \n               the start, PAUL'S TONE is different--strong, he's in control.\n\n<b>                                     ANNIE\n</b>                         Paul, don't you think it's time for \n                         you to start writing again? It's \n                         been over a week.\n\n<b>                                     PAUL\n</b>                         I don't know, it's weird, but a couple \n                         of broken bones hasn't done a lot \n                         for my creative juices. Get the fuck \n                         out of here.\n\n<b>                                     ANNIE\n</b>                         Don't talk to me like that.\n\n<b>                                     PAUL\n</b>                              (staring at her now)\n                         Why, what are you going to do?\n                              (spreading his arms \n                              wide)\n                         Kill me? Take your best shot.\n\n<b>                                     ANNIE\n</b>                              (taken aback)\n                         Why are you so mean, Mister you'd-be-\n                         dead-in-the-snow-if-it-wasn't-for-\n                         me?\n\n<b>                                     PAUL\n</b>                         Oh, no reason, you keep me prisoner, \n                         you make me burn my book, you drive \n                         a sledgehammer into my ankles...\n\n<b>                                     ANNIE\n</b>                         I'll drive a sledgehammer into your \n                         man-gland if you're not nicer--\n\n<b>                                     PAUL\n</b>                              (He spreads his legs)\n                         Be my guest.\n\n<b>                                     ANNIE\n</b>                              (after a beat)\n                         That's disgusting.\n\n               As she exits.\n\n<b>                                                                    CUT TO:\n</b>\n               A ROAD. Empty. Hold for a moment--now a car appears around a \n               curve.\n\n<b>                                                                    CUT TO:\n</b>\n               THE CAR. BUSTER is driving fast.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL in his room. He sits as before, by the window. He doesn't \n               move. Now he closes his eyes, stretches, sighs as we\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE KITCHEN\n</b>\n               ANNIE, busily making cocoa.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER IN HIS CAR. He stops at a mailbox. The name on the \n               box is WILKES. Buster turns his car slowly into the driveway \n               by the mailbox.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. He yawns, opens his eyes briefly. Closes them. In the \n               distance now, growing more and more visible is Buster's car--\n\n               --and now PAUL'S EYES go open wide, and he's staring out the \n               window at the car as it keeps on coming, closer, closer and\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, looking around. He's driving very slowly, carefully.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. Fixating on the window and now it's all going to be \n               all right, everything's going to be all right--\n\n               --and then ANNIE is on him, hypodermic needle in hand, jabbing \n               it into his arm. He desperately tries to fight her off, but \n               the drug starts to take hold. He tries to grab her by the \n               neck, but she fights him off as she wheels him out of the \n               room, down the hall and towards the cellar door.\n\n<b>                                     ANNIE\n</b>                         I don't think I'll ever understand \n                         you. I cook your meals, I tend to \n                         you practically twenty-four hours a \n                         day, and you continue to fight me. \n                         When are we going to develop a sense \n                         of trust?\n\n               ANNIE opens the cellar door. PAUL is all but limp by now. As \n               she picks him up and starts to carry him down the steps--\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER pulling up in front of the house. As he gets out of \n               his car--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE placing Paul on the cellar floor and heading up the \n               stairs. PAUL is out.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER heading up the steps to the front door.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE stashing the wheelchair in the hall closet. She crosses \n               to the front door, opens it, revealing BUSTER.\n\n<b>                                     ANNIE\n</b>                              (Gasping)\n                         Oh, my!\n\n<b>                                     BUSTER\n</b>                         Sorry, didn't mean to startle you. \n                         You didn't give me a chance to knock.\n\n<b>                                     ANNIE\n</b>                              (all charm)\n                         Guess you can tell from my reaction, \n                         I'm not all that used to visitors \n                         out here. What can I do for you?\n\n<b>                                     BUSTER\n</b>                         I was just wondering if you happen \n                         to know anything about Paul Sheldon.\n\n<b>                                     ANNIE\n</b>                              (stammering)\n                         What do you want to know?\n\n<b>                                     BUSTER\n</b>                         Anything you can tell me might help.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE. The words pour out--\n\n<b>                                     ANNIE\n</b>                         Well, he was born in Worcester, \n                         Massachusetts, forty-two years ago, \n                         the only child of Franklin and Helene \n                         Sheldon, mediocre student, majored \n                         in history...\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, watching her, surprised.\n\n<b>                                     BUSTER\n</b>                              (cutting in)\n                         Excuse me, that's not exactly the \n                         kind of information I was after. You \n                         see, he's been missing for quite \n                         some time now, and...\n\n<b>                                     ANNIE\n</b>                         I know. It's so upsetting. I'm his \n                         number-one fan...I've got all his \n                         books, every sentence he ever put \n                         down. I'm so proud of my Paul Sheldon \n                         collection...\n                              (stops suddenly, almost \n                              embarrassed)\n                         ...here I am, prattling on and my \n                         manners have just flown away. I \n                         haven't invited you in. Please.\n\n<b>                                     BUSTER\n</b>                         Thank you.\n\n               ANNIE lets BUSTER in, closes the door. They linger in front \n               of Paul's door. Buster idly checks out the hallway.\n\n<b>                                     ANNIE\n</b>                         'Course you must know about that \n                         horrible accident.\n\n               BUSTER nods and wanders into the living room. ANNIE follows. \n               He crosses into the study and checks out a bookcase that \n               contains the complete works of Paul Sheldon. One shelf below \n               contains Annie's infamous scrapbook.\n\n<b>                                     ANNIE\n</b>                         Almost killed me, too. I prayed when \n                         I heard the news. I got down on my \n                         knees and begged for it not to be \n                         true.\n\n<b>               CUT TO:\n</b>\n               ANNIE. She's so moved. Buster wanders into the kitchen.\n\n<b>                                     ANNIE\n</b>                         You're going to laugh at what I'm \n                         about to say, but go ahead, I don't \n                         care...\n                              (beat)\n                         ...when I was praying, God told me \n                         to get ready.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER, watching her. This isn't at all what he expected.\n\n<b>                                     BUSTER\n</b>                         Get ready for what?\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, trying to fight the drug; just his eyes flutter.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE and BUSTER heading back down the hallway toward Paul's \n               room.\n\n<b>                                     ANNIE\n</b>                         To try and be his replacement--he \n                         gave so much pleasure to so many \n                         people and there's a shortage of \n                         pleasure on this planet these days, \n                         in case you hadn't noticed.\n\n               BUSTER enters Paul's room. ANNIE follows.\n\n<b>                                     ANNIE\n</b>                         God told me, since I was his number-\n                         one fan, that I should make up new \n                         stories as if I was Paul Sheldon. \n                         So, went to town. And I bought a \n                         typewriter. And paper to type on. \n                         The same kind Paul Sheldon used. And \n                         I turned the guest bedroom into a \n                         writing studio. Would you like to \n                         see it?\n\n<b>                                     BUSTER\n</b>                         Sure.\n\n<b>                                     ANNIE\n</b>                         It's right this way.\n\n               BUSTER takes a look in the bathroom. ANNIE waits for him.\n\n<b>                                     ANNIE\n</b>                         It's right here. I knew how he wrote, \n                         the kinds of words he used, the \n                         wonderful stories he told--\n                              (moved)\n                         --I've spent the last four weeks \n                         trying to write like Paul Sheldon.\n                              (sad shake of the \n                              head)\n                         But I can't do it right. I try and I \n                         try and I know all the words--\n                              (eyes closed in despair)\n                         --but it's just not the same.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. He just stands there, watches her.\n\n<b>                                     BUSTER\n</b>                         Well...\n                              (long pause)\n                         ...maybe it takes time to get the \n                         hang of it.\n\n<b>                                     ANNIE\n</b>                              (holding up pages \n                              from the manuscript)\n                         I could give you a couple of hundred \n                         pages of mine, and you could tell me \n                         what you think.\n\n<b>                                     BUSTER\n</b>                         I'm not much of a critic.\n\n<b>                                     ANNIE\n</b>                         Well, I just thought--oh, look at \n                         me. You'd think I'd never had a house \n                         guest before. Would you like something \n                         to drink?\n\n<b>                                     BUSTER\n</b>                         Sure.\n\n<b>                                     ANNIE\n</b>                         How does a nice cup of cocoa sound?\n\n<b>                                     BUSTER\n</b>                         Sounds good.\n\n               As she exits into the kitchen.\n\n<b>                                     ANNIE\n</b>                         There's some already made.\n\n               BUSTER lingers in Paul's room for a beat, then goes into the \n               hallway.\n\n<b>                                     BUSTER\n</b>                         Must get lonely, living out here all \n                         by yourself.\n\n<b>                                     ANNIE\n</b>                         I always say if you can't enjoy your \n                         own company, you're not fit company \n                         for anyone else.\n\n<b>                                     BUSTER\n</b>                         You got a point there...\n\n               As Buster moves up the stairs--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, still fighting the drug. His arm twitches almost \n               involuntarily, grazing the barbecue.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER opening the door to Annie's room. He looks around and \n               just as he is about to turn to leave--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, standing right in front of him.\n\n<b>                                     ANNIE\n</b>                         Here you are.\n\n               BUSTER heads down the stairs, ANNIE follows.\n\n<b>                                     BUSTER\n</b>                         Thanks, Miz Wilkes, but I don't want \n                         to take up any more of your time. I \n                         best be going.\n\n<b>                                     ANNIE\n</b>                         But you didn't even taste your cocoa.\n\n               They cross to the front door.\n\n<b>                                     BUSTER\n</b>                         I'm sure it's wonderful, but really \n                         should be getting back.\n\n               BUSTER opens the door.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL stirring.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER and ANNIE at the door.\n\n<b>                                     BUSTER\n</b>                         If you don't mind, perhaps I could \n                         pay you another visit sometime.\n\n<b>                                     ANNIE\n</b>                         I'd be delighted. Now that you know \n                         the way...\n\n               With that, she closes the door. We stay with BUSTER. He stands \n               on the front porch for a beat, thinking, then starts heading \n               down the porch steps. Just as he reaches about halfway down, \n               we HEAR A LOUD CRASH coming from inside the house.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL--he has managed to partially fight his way through the \n               drug, and in waking has accidentally knocked over the \n               barbecue. He fights to clear the cobwebs.\n\n<b>                                                                    CUT TO:\n</b>\n<b>                                     BUSTER\n</b>                         Miz Wilkes, are you all right?\n\n               There is no answer. He quietly moves into the house.\n\n<b>                                     BUSTER\n</b>                         Miz Wilkes?\n\n               Again, no answer.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, still fighting to gain complete consciousness.\n\n<b>                                     PAUL\n</b>                              (weakly)\n                         Here. I'm down here. Down here.\n\n<b>                                                                    CUT TO:\n</b>\n               BUSTER. Hearing Paul's muffled call for help, he tracks the \n               sound to the cellar door. As PAUL continues to call out, \n               Buster looks around, sees no one, and opens the cellar door. \n               The shaft of light from the open door pours down on Paul, \n               who is still lying on the floor.\n\n<b>                                     BUSTER\n</b>                         Mr. Sheldon?\n\n               But before Paul can answer, there's the sound of a LOUD \n               EXPLOSION. Seemingly from nowhere a hole is ripped through \n               Buster's chest, knocking him out of frame, revealing Annie, \n               smoking shotgun in hand, standing at the top of the cellar \n               steps.\n\n<b>                                     ANNIE\n</b>                         Don't feel bad, Paul. It had to \n                         happen. I've been waiting for this \n                         sign.\n\n               ANNIE walks toward BUSTER'S BODY and very casually takes his \n               gun out of its holster.\n\n<b>                                     ANNIE\n</b>                         I've known for some time why I was \n                         chosen to save you. You and I were \n                         meant to be together forever. But \n                         now our time in this world must end. \n                         But don't worry, Paul. I've already \n                         prepared for what must be done. I \n                         put two bullets in my gun, one for \n                         you and one for me. Oh, darling, it \n                         will be so beautiful.\n\n               With that, ANNIE turns and exits the cellar.\n\n               Paul's mind races desperately. He looks at the barbecue again. \n               Next to it is a messy table with a dozen jars and cans on \n               it.\n\n<b>                                                                    CUT TO:\n</b>\n               THE TABLE. One of the cans is LIGHTER FLUID.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. He stares at it for a moment. An idea hits him--\n\n               --now, PAUL struggles and crawls over to the table. He grabs \n               the lighter fluid in his hands, jams it into the rear of his \n               pants and scrambles back to where ANNIE left him.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE returning with her .38 Special and a hypodermic needle. \n               She stops at the top of the stairs.\n\n<b>                                     ANNIE\n</b>                         Now don't be afraid. I love you.\n\n               She starts toward him.\n\n<b>                                     PAUL\n</b>                         I know you do. I love you too, Annie.\n                              (this stops her)\n                         And you're right. We are meant to be \n                         together. And I know we must die. \n                         But it must be so that Misery can \n                         live. We have the power to give Misery \n                         eternal life. We must finish the \n                         book.\n\n<b>                                     ANNIE\n</b>                         But the time is now. Soon others \n                         will come.\n\n<b>                                     PAUL\n</b>                         It's almost done. By dawn we'll be \n                         able to give Misery back to the world.\n\n               ANNIE stares at Paul. She could go either way on this. Then, \n               without a word, she turns and goes back up the stairs.\n\n<b>                                     ANNIE\n</b>                         Here, Paul. I'll fix you something \n                         to eat.\n\n               She exits. PAUL hesitates for a moment, then realizes he has \n               no choice. He starts dragging himself over BUSTER and up the \n               stairs.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. NIGHT.\n</b>\n               PAUL working. Typing like a madman, totally concentrated on \n               the white paper. His lips move but he's not even aware of \n               it.\n\n               ANNIE enters quietly, holding a few pages.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul. It's beautiful.\n\n<b>                                     PAUL\n</b>                         Three more chapters to go.\n\n               She looks at him now, enthralled.\n\n<b>                                     ANNIE\n</b>                         The stranger staying at the Inn, is \n                         he someone from Misery's past?\n\n<b>                                     PAUL\n</b>                         Maybe.\n\n<b>                                     ANNIE\n</b>                         This is so exciting. It's Windthorne, \n                         her first love, right?\n\n<b>                                     PAUL\n</b>                         Maybe. Are you ready for the next \n                         chapter?\n\n               He taunts her with it.\n\n<b>                                     ANNIE\n</b>                              (brimming with \n                              enthusiasm)\n                         Oh you!\n\n               She takes the pages and goes.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. LATER.\n</b>\n               PAUL types a moment then rips out the page and starts over.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, putting the coffee down for him, putting the pages \n               back on the main pile.\n\n<b>                                     ANNIE\n</b>                              (more excited now \n                              than the last time)\n                         It WAS Windthorne. I knew it--what \n                         does that do to her love for Ian?--\n                              (thinks)\n                         --of course, if she hadn't thought \n                         Windthorne was murdered she never \n                         would have fallen in love with Ian \n                         in the first place.\n                              (Paul glares at her, \n                              she turns to the \n                              door)\n                         Sorry, it's just that this is so \n                         wonderful.\n\n<b>                                     PAUL\n</b>                         I'm glad you like it.\n\n<b>                                     ANNIE\n</b>                         Paul, this will be our legacy.\n\n<b>                                     PAUL\n</b>                         It will.\n\n               He hands her a few more pages, she starts reading as she \n               exits.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM. MUCH LATER.\n</b>\n               PAUL rubs his eyes. For a moment, he sags, but he fights it. \n               He puts a clean page into the typewriter.\n\n               ANNIE bursts in.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul. I'm dying. Does she wind \n                         up with Ian or Windthorne? You have \n                         to tell me.\n\n<b>                                     PAUL\n</b>                         You'll know very soon. I'm starting \n                         the last chapter. And when I finish, \n                         I want everything to be perfect. \n                         I'll require three things.\n\n<b>                                     ANNIE\n</b>                         What things?\n\n<b>                                     PAUL\n</b>                         You don't know?\n\n<b>                                     ANNIE\n</b>                              (smiling)\n                         I was fooling, silly.\n                              (ticking them off)\n                         You need a cigarette, because you \n                         used to smoke but you quit except \n                         when you finish a book, and you just \n                         have one, and the match is to light \n                         it. And you need one glass of \n                         champagne.\n                              (thinks)\n                         Dome Pear-igg-non.\n\n<b>                                     PAUL\n</b>                         Dome Pear-igg-non it is.\n\n               AS ANNIE exits.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               THE WINDOW\n</b>\n               The first light of morning is starting to break through.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, stretching. He makes sure everything is set.\n\n<b>                                     PAUL\n</b>                              (calling out)\n                         Annie! Annie!\n\n               With that, she enters.\n\n<b>                                     ANNIE\n</b>                         Yes, Paul.\n\n<b>                                     PAUL\n</b>                         I'm almost done.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul, this is so romantic. Ian \n                         and Windthorne dueling for the right \n                         to Misery's hand. Does Ian win? Oh, \n                         don't me. It's Windthorne, right?\n\n<b>                                     PAUL\n</b>                         You'll know everything in a minute. \n                         Get the champagne.\n\n<b>                                     ANNIE\n</b>                              (dying from the \n                              suspense)\n                         Ahh!!!\n\n               She exits; PAUL adjusts the manuscript on the table and then \n               types the last line.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE IN THE KITCHEN. She takes the bottle of Dom Perignon \n               out of the icebox, places it on a tray with two glasses--\n               opens a drawer--takes out the gun--places it in her pocket--\n               then takes out the hypodermic needle and places it on the \n               tray.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL'S ROOM\n</b>\n               ANNIE enters with the tray. She sets it down on the table.\n\n<b>                                     ANNIE\n</b>                         Did I do good?\n\n<b>                                     PAUL\n</b>                         You did perfect. Except for one thing. \n                         This time we need two glasses.\n\n               He takes the last page out of the typewriter.\n\n<b>                                     ANNIE\n</b>                         Oh, Paul.\n\n               As soon as she exits, PAUL drops the manuscript to the floor, \n               pulls the lighter fluid from his pants, and starts dousing \n               the manuscript with lighter fluid. He grabs the last chapter \n               and twists the last few pages together torch style. He douses \n               it with the fluid and holds the match out of sight.\n\n               He smiles as we\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE entering with the second glass...\n\n<b>                                     PAUL\n</b>                         It's all right here, Annie. Remember \n                         how for all those years no one ever \n                         knew who Misery's real father was, \n                         or if they'd ever be reunited? It's \n                         all right here. Will Misery finally \n                         lead her countrymen to freedom? Does \n                         she finally marry Ian or will it be \n                         Windthorne? It's all right here.\n\n<b>                                                                    CUT TO:\n</b>\n               THE MATCH, as he strikes it and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE screaming--\n\n<b>                                     ANNIE\n</b>                         Paul, you can't.\n\n               And as her hands fly out beseechingly--\n\n<b>                                                                    CUT TO:\n</b>\n               THE CHAMPAGNE BOTTLE--it falls to the floor, explodes like a \n               torpedo, shards of glass all over, curds of foam everywhere--\n\n<b>                                     PAUL\n</b>                         Why not? I learned it from you...\n\n               And on that--\n\n<b>                                                                    CUT TO:\n</b>\n               THE LAST CHAPTER as Paul brings the match close to it and it \n               bursts into flame. And Paul, holding it like the torch it \n               is. Annie starts moving forward now.\n\n<b>                                     ANNIE\n</b>                         No, no, NOT MISERY--NOT MY MISERY...!\n\n               He drops the last chapter into the soaked manuscript and\n\n<b>                                                                    CUT TO:\n</b>\n               THE MANUSCRIPT, as KABOOM!, it bursts into flame and--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, transfixed by the sight for a moment,\n\n               --and then she charges.\n\n<b>                                                                    CUT TO:\n</b>\n               THE FIRE as ANNIE rushes to the book, stoops down, grabs it \n               with both hands, brings the burning mass up to her body, \n               both arms across it, trying to smother the flames--\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, grabbing the typewriter, raising it high above his \n               head, then throwing it down on her with all his power and\n\n<b>                                                                    CUT TO:\n</b>\n               THE TYPEWRITER, crashing into the back of her head.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, screaming, driven to the floor by the blow, the book \n               beneath her, and the flames fly up, her sweater is starting \n               to burn and she's covered with shards of glass from the \n               shattered bottle of champagne and some of the manuscript is \n               hissing from the liquid, but she is able to struggle to her \n               knees--\n\n<b>                                     ANNIE\n</b>                         I'm going to kill you, you lying \n                         cocksucker...\n\n               As she struggles to her feet, she pulls out the gun and shoots \n               at Paul, hitting him in the shoulder. Just as she's about to \n               shoot again, Paul quickly wheels the chair up to her, throws \n               himself out of the chair, and tackles her. The gun flies out \n               of her hand and lands in the hallway, going off as it lands. \n               They wrestle on the floor.\n\n               Flames still around them, PAUL gets on top of her, grabs \n               some burning pages, stuffs them into her mouth, shouting --\n\n<b>                                     PAUL\n</b>                         Here. Here. You want it? You want \n                         it? You can eat it--eat it--eat it \n                         till you fucking CHOKE--you sick, \n                         twisted fuck.\n\n               And as he forces more paper into her mouth--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, and she's hideous--blistered, her hands claw at her \n               throat. She makes horrible sounds, spitting the charred chunks \n               of manuscript out of her mouth. Shards of glass are in her \n               hair. Now a shriek and a tremendous jerk of her body and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, falling away --\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, still making the sounds as she gets to her feet, and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, trying to crawl away after her.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE--heading for the door, she takes a step away from Paul, \n               then another, then\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, suddenly kicking out with his shattered leg, screaming \n               in pain as it crashes into her ankle and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, trying to keep her balance, not doing well, her arms \n               windmilling as she fights for balance one last moment, fights \n               and loses, and now, as she topples over--\n\n<b>                                                                    CUT TO:\n</b>\n               THE TYPEWRITER as she falls and her head slams into it, \n               collides with the sharp metal and a great wound opens in her \n               head. There is one final cry. Blood pours. It's over. All \n               over. We are looking at a dead body.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, exhausted, panting, lying there, trying to gather his \n               energy. He starts to crawl for the door. Just as he reaches \n               the doorjamb, an arm grabs his leg, and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, shrieking, and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, pulling herself up his body and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, trying to buck her off, but he can't and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, the stronger, relentless, moving up on him, and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, his grip broken as he turns and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, all-powerful, looming over him and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, hitting up at her and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, swelling, and the blood pours down and if she feels \n               his blows she doesn't show it and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, whatever energy he has left he uses now, trying to \n               twist and strike and as his body moves--\n\n<b>                                                                    CUT TO:\n</b>\n               METAL BASED FLOOR LAMP and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, grabbing the thing, suddenly bringing it across his \n               body, clobbering Annie in the face and\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, startled by the power of the blow and for a moment \n               she is stopped and\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, as with everything he has left, he crunches her forehead \n               with the sharp heavy metal base, just creams her as the air \n               is forced out of her--\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE. Her eyes roll up into her head. For a moment all we \n               see are the whites--\n\n               --then she collapses on PAUL, a motionless mountain of slack \n               flesh.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, scrambling free, pushing her off him, crawling for the \n               door--\n\n<b>                                                                    CUT TO:\n</b>\n               --outside the door, as PAUL crawls into view, makes it to \n               the corridor, reaches back, closes the door, locks it.\n\n               Safe, he collapses, exhausted against the wall opposite the \n               door.\n\n<b>                                                               DISSOLVE TO:\n</b>\n               PAUL. HOURS LATER. It is dawn. He is awakened by a loud \n               smashing at the front door. After a couple of heart-stopping \n               pounds,\n\n<b>                                                                    CUT TO:\n</b>\n               THE FRONT DOOR smashes open, revealing two cops with guns \n               drawn.\n\n               THE POLICEMEN, hurrying to PAUL. The YOUNGER COP kneels beside \n               Paul.\n\n<b>                                     YOUNGER COP\n</b>                         It's the writer--the dead one--\n\n<b>                                     PAUL\n</b>                              (trying to keep himself \n                              together)\n                         --right! I'm the dead one--\n\n<b>                                     OLDER COP\n</b>                         Where's Sheriff McCain?\n\n<b>                                     PAUL\n</b>                         He's in the cellar. She killed him.\n\n<b>                                     OLDER COP\n</b>                         Annie Wilkes?\n\n<b>                                     PAUL\n</b>                         Yeah. She's in there.\n\n<b>                                                                    CUT TO:\n</b>\n               The OLDER COP, taking the key to the room, unlocks the door, \n               throws it open, and as he steps inside--\n\n<b>                                                                    CUT TO:\n</b>\n<b>               INSIDE THE BEDROOM\n</b>\n               The OLDER COP has his gun ready to fire, but even with it \n               tight in his hand, he's edgy as hell.\n\n               He looks around--\n\n               --glass and bloodstains on the floor. The charred remains of \n               a manuscript.\n\n               He kneels quickly, glances under the bed--nothing.\n\n               He looks at the window--wide open.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL and the YOUNGER COP. Pause. The OLDER COP is in the \n               doorway now.\n\n<b>                                     OLDER COP\n</b>                         Mr. Sheldon? There's no one in there.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL: CLOSE UP. In shock.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               PALM COURT, PLAZA HOTEL\n</b>\n               This legend appears: ONE YEAR LATER\n\n               MARCIA SINDELL is seated at a table. PAUL enters, walking \n               briskly, and he's never looked this good before. He's gained \n               his weight back, his color is normal again. He appears to \n               be, for the first time in the movie, a jaunty, happy figure.\n\n<b>                                     PAUL\n</b>                         Sorry I'm late. Jenny's basketball \n                         game went into overtime. If anybody \n                         ever told me I'd have a daughter \n                         who'd get a triple double, I'd...\n\n<b>                                     SINDELL\n</b>                         Did they win?\n\n<b>                                     PAUL\n</b>                         Yeah. They're in the semis.\n\n<b>                                     SINDELL\n</b>                         Here it is.\n                              (big moment)\n                         Very first copy.\n\n               And she hands him a wrapped package. PAUL sits, begins \n               unwrapping it. It's a book. A new one by Paul Sheldon. The \n               Higher Education of J. Phillip Stone. Paul turns it over \n               gently in his hands.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               SINDELL\n</b>\n<b>                                     SINDELL\n</b>                         The word I'm getting is the Times \n                         review is gonna be a love letter.\n\n<b>                                     PAUL\n</b>                         That'd be a first.\n\n<b>                                     SINDELL\n</b>                         And my contacts at Time and Newsweek \n                         tell me they're both raves. And don't \n                         laugh--for the first time, I think \n                         you've got a shot at some prizes.\n\n<b>                                     PAUL\n</b>                              (flatly)\n                         Great.\n\n<b>                                     SINDELL\n</b>                         I thought you'd be thrilled. You're \n                         being taken seriously.\n\n<b>                                     PAUL\n</b>                         I'm delighted the critics are liking \n                         it, and I hope the people like it, \n                         too. But it's not why I wrote the \n                         book.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL: CLOSE UP. There is a genuine sense of peace about him. \n               He has been through the fire and survived.\n\n<b>                                     PAUL\n</b>                         I like it. Remember how you once \n                         said I live my whole life as if I'm \n                         in danger of being found out? Well, \n                         I believe I've managed to get that \n                         guy down on paper.\n                              (He touches the book. \n                              Beat.)\n                         Don't think I'm completely nuts, but \n                         in some way, Annie Wilkes, that whole \n                         experience, helped me.\n\n<b>                                     SINDELL\n</b>                         Paul, since you brought her up, I \n                         have to ask you this, or I'd be \n                         drummed out of the agents' union--\n                         what about a non-fiction book? The \n                         truth about what went on in that \n                         house.\n\n<b>                                     PAUL\n</b>                         Gee, Marcia, if I didn't know you \n                         better, I'd think you were suggesting \n                         I dredge up the worst horror of my \n                         life just so we could make a few \n                         bucks.\n\n<b>                                     SINDELL\n</b>                         Now you've hurt me, Paul.\n\n               As Paul glances around...\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, looking past MARCIA.\n\n<b>                                                                    CUT TO:\n</b>\n               DESSERT TROLLEY, some distance away, being pushed by a \n               waitress. It is ANNIE.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL AND SINDELL\n</b>\n<b>                                     SINDELL\n</b>                         I thought you were over it.\n\n<b>                                     PAUL\n</b>                         I am. Well, maybe not completely--\n\n               He glances toward the trolley.\n\n<b>                                                                    CUT TO:\n</b>\n               THE DESSERT TROLLEY, moving inexorably closer to PAUL. ANNIE \n               reaches down and pulls out a very sharp knife.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               PAUL AND SINDELL\n</b>\n<b>                                     PAUL\n</b>                         I don't know if you can ever be \n                         totally over something like that--I \n                         just don't think about it as much \n                         anymore, and when I do, it's not so \n                         terrifying.\n\n<b>                                                                    CUT TO:\n</b>\n               ANNIE, with the knife raised.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL, staring up at ANNIE.\n\n<b>                                     PAUL\n</b>                         I mean, once they found her body, my \n                         nightmares stopped.\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL AND ANNIE--only it isn't Annie, just a WAITRESS. She \n               stands by the trolley, the knife in her hand, ready to slice \n               whatever anyone wants.\n\n<b>                                     WAITRESS\n</b>                         Would you care for anything?\n\n<b>                                     PAUL\n</b>                              (smiles)\n                         Cut me something sinful...\n\n<b>                                                                    CUT TO:\n</b>\n               PAUL. The smile holds. In the background now, soft music: \n               someone might be playing \"Liberace.\"\n\n<b>               HOLD ON PAUL\n</b>\n<b>                                                            FINAL FADE OUT:\n</b>\n<b>                                         THE END\n</b>\n<b>\t\n</b></pre>\n<b></b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Misery</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=William Goldman\" title=\"Scripts by William Goldman\">William Goldman</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Misery Script.html#comments\" title=\"Misery comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:11:45.732696"}