{"title": "Mission to Mars", "film_link": "/Movie Scripts/Mission to Mars Script.html", "script_link": "/scripts/Mission-to-Mars.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Mission to Mars Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Mission-to-Mars.jpg\" title=\"Mission to Mars Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Lowell Cannon\" title=\"Scripts by Lowell Cannon\">Lowell Cannon</a><br/>  <a href=\"/writer.php?w=Jim Thomas\" title=\"Scripts by Jim Thomas\">Jim Thomas</a><br/>  <a href=\"/writer.php?w=John Thomas\" title=\"Scripts by John Thomas\">John Thomas</a><br/>  <a href=\"/writer.php?w=Graham Yost\" title=\"Scripts by Graham Yost\">Graham Yost</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/><br/>\n<b>Movie Release Date</b> : March 2000<br/>\n<br/>\n<a href=\"/scripts/Mission-to-Mars.html\">Read \"Mission to Mars\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                                    \"MISSION TO MARS\"\n</b>\n\n                                      Screenplay by\n\n                          Jim Thomas, John Thomas &amp; Graham Yost\n\n                                         Story by\n\n                         Lowell Cannon, Jim Thomas &amp; John Thomas\n\n\n<b>                                      SHOOTING DRAFT\n</b>\n\n<b>                \n</b>\n<b>               FADE IN:\n</b>\n<b>               EXT. LATE AFTERNOON SKY\n</b>\n               Blue sky, a few puffs of cloud, pierced by slanting rays of \n               sunlight. Late afternoon on a perfect day.\n\n<b>               SUPER TITLE: \"HOUSTON, TEXAS. JULY 4, 2020.\"\n</b>\n               As we hear, after a few more beats, an ASTRONAUT'S VOICE.\n\n<b>                                     PHIL\n</b>                         T minus ten, nine, eight, start \n                         ignition sequence, five, four, three, \n                         two, one, ignition... Liftoff!\n\n               A tiny red streak zips into the sky, then bursts with a faint, \n               ludicrous POP. A bottle rocket. We hear CHILDREN'S LAUGHTER, \n               excited SHOUTS.\n\n<b>               EXT. LAWN PARTY. LUKE GRAHAM'S HOUSE. LATE AFTERNOON\n</b>\n               DESCENDING, we see PHIL OHLMYER, late 20's, kneeling, with a \n               gaggle of eager CHILDREN around him. Phil, an astronaut, has \n               got an impressive array of fireworks lined up, and is using \n               an empty longneck as his launching tube.\n\n<b>                                     CHILDREN\n</b>                              (all at once)\n                         My turn! My turn! No, I was next! \n                         No, me! Uncle Phil, Uncle Phil, can \n                         I do one? I want to do one!\n\n<b>                                     PHIL\n</b>                         Guys, guys, please! This is risky \n                         stuff here. And I'm a highly trained \n                         professional.\n\n               Derisive GROANS from the kids, more SHOUTS. Phil grins. \n               There's little danger NASA will ever use him on a recruiting \n               poster: he's messy, very hyper. Phil waves his hands for \n               silence.\n\n<b>                                     PHIL\n</b>                         Okay, okay! Uncle Phil will launch \n                         another booster...\n\n               Another astronaut, RENEE COTE, a tall, very fit French woman, \n               is walking by with a fresh six-pack. She tosses a beer and \n               Phil catches it.\n\n<b>                                     PHIL\n</b>                         ...just as soon as he completes his \n                         fuel intake.\n\n<b>               ANGLE FOLLOWS COTE\n</b>\n               Who grins, walking away from Phil and the kids, as we begin \n               to get a better sense of the scope of this party. We are in \n               the big back yard of a middle-class home in a Houston suburb. \n               DOZENS OF PEOPLE - astronauts, NASA personnel, and their \n               families -- are gathered around picnic tables or spread-out \n               blankets. Lots of red, white and blue bunting, lots of \n               balloons. We hear snatches of MUSIC, mostly country-flavored, \n               from dueling boomboxes. Futuristic Frisbees are being tossed \n               about. A banner, strung between trees, reads \"BON VOYAGE, \n<b>               MARS ONE!!!\"\n</b>\n<b>                                     WILLIS\n</b>                         It'll take us six months just to get \n                         to Mars. Another year on the surface, \n                         then six months back. That's two \n                         years...\n\n               Passing the banner, Cote lobs a beer to another astronaut, \n               NICHOLAS WILLIS, who snags it neatly. He's got his other arm \n               around the waist of a PRETTY GIRL. As Cote moves OUT OF FRAME, \n               ANGLE LINGERS on these two. Willis, a very young astronaut, \n               early 20s, is recruiting poster material, and knows it all \n               too well.\n\n<b>                                     WILLIS\n</b>                         I guess what I'm trying to say is, \n                         since this is my last night on Earth, \n                         it's gonna be a very precious memory \n                         to me. Y'know?\n\n<b>                                     PRETTY GIRL\n</b>                         Nice try, Nick.\n\n               As the Pretty Girl slips out of his grasp, laughing, and \n               walks away, Willis shrugs philosophically. He pops open his \n               beer, swigs it.\n\n               ANGLE FOLLOWS THE PRETTY GIRL As she swerves around an open-\n               pit barbecue, where other ASTRONAUTS are gathered. Cote has \n               paused here, too, distributing the last of her beers. SERGEI \n               KIROV, a Russian cosmonaut, is watching some kids nearby as \n               they play a game of wiffle ball. He turns, grinning beerily \n               at the chef.\n\n<b>                                     KIROV\n</b>                         Hey, Woody, our Mars One crew won't \n                         be heading back to Earth till ten \n                         days after you guys land at our base \n                         camp with Mars Two. That's a pretty \n                         good long rendezvous.\n\n               WOODY BLAKE, late 30s, is a big, rangy guy in a cowboy hat \n               over a Hawaiian shirt and a \"KISS THE CHEF\" apron. An entire \n               pig is turning on a spit over the flames, and Woody is basting \n               this as he smiles at Malik.\n\n<b>                                     WOODY\n</b>                         What are you suggesting, Sergei?\n\n<b>                                     KIROV\n</b>                         Maybe you should bring a baseball \n                         bat. Yes? American baseball? Our two \n                         crews could have ourselves a little \n                         Solar System Series.\n\n<b>                                     WOODY\n</b>                         Please. Half you guys are foreigners. \n                         We'd crush you.\n\n<b>                                     KIROV\n</b>                         No, no, we have equal crews. Three \n                         men, one woman. Same handicap.\n\n               He grins teasingly at Cote, who makes a face at him.\n\n<b>                                     WOODY\n</b>                         Easy now, you're talking about my \n                         wife.\n                              (seeing her approach)\n                         And Terri just happens to be one \n                         helluva shortstop.\n\n               DR. TERRI FISHER, early 30s, passes by with a platter of \n               corn-on-the-cob. Short, sturdy body, a face made attractive \n               by its alert, questing intelligence. She pauses to kiss \n               Woody's cheek; there's a wonderful, sexy spark between them. \n               Then she glances at Kirov, all business now.\n\n<b>                                     TERRI\n</b>                         Fast pitch, no steals, batter calls \n                         his own strikes. Thousand bucks make \n                         it interesting?\n\n               He's a bit rattled by her cockiness, and looks at Cote, who \n               smiles, nods her cool agreement.\n\n<b>                                     COTE\n</b>                         Eh bien. Winner take all.\n\n<b>                                     TERRI\n</b>                         Good.\n                              (smiles sweetly at \n                              Kirov)\n                         Bring some balls.\n\n               The other men ooooh at this, busting on Kirov and Cote, as \n               Terri moves on. Woody, watching her go, has a thousand-watt \n               grin.\n\n<b>                                     WOODY\n</b>                         You wanna know the sad part? \n                         Technically I outrank her. But if we \n                         want any peace at all on Mars Two, \n                         I'm gonna be saying a lot of \"Yes, \n                         dears.\"\n\n               The others laugh.\n\n               ANGLE FOLLOWS TERRI as she dodges a PACK OF KIDS -- they run \n               by her, shrieking happily - before she finally reaches a \n               picnic table, where ASTRONAUTS' WIVES are opening containers \n               of baked beans, coleslaw, and potato salad.\n\n<b>                                     1ST WIFE\n</b>                         ...just not sure how I feel about \n                         NASA allowing couples to go on this \n                         type of mission together.\n\n               One of the other women raises a warning eyebrow, and the 1st \n               Wife turns, sees Terri setting down her platter.\n\n<b>                                     1ST WIFE\n</b>                              (embarrassed)\n                         Nothing personal, Terri. It's just \n                         that, well, it's kind of a funny \n                         feeling for those of us staying \n                         behind.\n\n<b>                                     TERRI\n</b>                              (carefully neutral)\n                         All the research shows that marriage \n                         will provide stability on these long \n                         duration trips.\n\n<b>                                     2ND WIFE\n</b>                         Then they haven't studied some of \n                         the couples I've known.\n\n               Laughter at this. Terri smiles politely -- she doesn't really \n               have much in common with these women -- before moving on. \n               ANGLE LINGERS on the wives, who watch her go with a slight \n               tinge of jealousy. One of them is looking around.\n\n<b>                                     3RD WIFE\n</b>                         Anybody seen Jim McConnell?\n\n<b>                                     4TH WIFE\n</b>                         I don't think he's coming.\n\n<b>                                     1ST WIFE\n</b>                         God, that poor man. How's he doing?\n\n<b>                                     2ND WIFE\n</b>                         Totally losing it, from what I hear. \n                         Can't sleep, can't eat. Visits her \n                         grave almost every day.\n                              (lowers her voice)\n                         They say he could lose mission status.\n\n<b>                                     3RD WIFE\n</b>                         Oh, that's so sad. That is just so \n                         tragic. You go to a routine physical \n                         one day, and wham.\n\n<b>                                     4TH WIFE\n</b>                         After all those years of training, \n                         too. It was their whole dream.\n\n<b>                                     1ST WIFE\n</b>                         Must be a pretty funny feeling for \n                         Luke Graham. Y'know? Now he's gonna \n                         be in the history books. First man \n                         on Mars...\n\n               She shakes her head, awed by the thought. The others nod in \n               agreement, following her glance...\n\n               In the distance, a lone MALE FIGURE stands by the garage, \n               his back to them, facing the parked cars, vans, and SUVs \n               which stretch down the driveway and along the street. Another \n               figure, a WOMAN, can be seen approaching him.\n\n               CLOSER ANGLE FOLLOWS the moving woman -- DEBRA GRAHAM, early \n               30s, very attractive -- until she reaches her husband. LUKE \n               GRAHAM, mid 30s, has the lean, fit body of an astronaut, the \n               restless intellect of a scientist. He's unaware of her \n               approach until she touches his shoulder. He looks at her \n               with an apologetic smile.\n\n<b>                                     DEBRA\n</b>                         He's not coming, Luke.\n\n<b>                                     LUKE\n</b>                         Jim deserves this, too. All his \n                         friends are here. And it's my last \n                         night.\n\n<b>                                     DEBRA\n</b>                              (gently)\n                         Your last night with us, too.\n\n               He looks at her, moved. She summons a smile. He slides his \n               arms around her waist, kisses her forehead.\n\n<b>                                     LUKE\n</b>                         I love you, Deb.\n\n<b>                                     DEBRA\n</b>                         I love you too, baby. But maybe you \n                         should spend some time with Bobby.\n\n<b>                                     LUKE\n</b>                         Yeah. I will. Where is he?\n\n<b>                                     DEBRA\n</b>                         Up in his fort.\n\n               He kisses her again, then goes. Debra's eyes follow him, \n               with a mixture of pride and sadness.\n\n               ANGLE FOLLOWS Luke away from the garage, into\n\n<b>               EXT. THE BACK YARD. LATE AFTERNOON\n</b>\n               Luke moves through the crowd. Phil and the kids are still \n               shooting off rockets. Red streaks arc high overhead.\n\n               In the back corner of the yard, where it's quieter, he passes \n               Willis, who's sitting on a blanket, murmuring soulfully to \n<b>               PRETTY GIRL #2.\n</b>\n<b>                                     WILLIS\n</b>                         Deep space is so lonesome. So cold. \n                         But I guess I'll have my memories to \n                         keep me warm...\n\n               Luke shakes his head. Willis is incorrigible. Finally he \n               reaches a tall redwood playset. He looks up the ladder.\n\n               A SMALL BOY sits on the platform of the tower, arms around \n               his knees, staring up at the stars. A telescope rests nearby \n               on a tripod. He looks lonely.\n\n               Luke climbs up, sits down on the wooden deck next to him. \n               BOBBY, 7, glances over at his dad, his idol, then back at \n               the sky.\n\n<b>                                     BOBBY\n</b>                         Who's gonna read to me now, at \n                         bedtime?\n\n               Luke is surprised by the question. A pause.\n\n<b>                                     LUKE\n</b>                         Mommy will.\n\n<b>                                     BOBBY\n</b>                         I like when you do it. Now we're \n                         never gonna finish our book.\n\n               His voice is unexpectedly fierce. He's fighting back tears. \n               Luke is moved. Another brief silence.\n\n<b>                                     LUKE\n</b>                         Well, I'll tell you what. I've been \n                         thinking about that. And what I \n                         thought was -- how 'bout if I bring \n                         along my own copy?\n                              (Bobby looks at him)\n                         Then every night, wherever I am, \n                         I'll read a little bit more of it. \n                         And I'll know that you and Mommy, \n                         wherever you are, you're reading it \n                         too. That way, it'll feel like we're \n                         still reading it together. 'Cause I \n                         don't know about you, but I'm pretty \n                         anxious to find out how 'ol Ben Gunn \n                         got marooned on that island. What \n                         d'you say?\n\n               Bobby manages a smile. He nods, feeling a little better. \n               Luke is proud of his son's courage.\n\n<b>                                     LUKE\n</b>                         Good deal. Can I have a hug?\n\n               Bobby's arms go around his father's neck. He hugs Luke \n               fiercely, and Luke hugs him back. His eyes, over the thin \n               young shoulders, are brimming with love and impending absence. \n               Then, from the distance, the sound of an APPROACHING CAR. \n               They both turn.\n\n               An open Jeep is coming down the street. Its DRIVER is alone.\n\n               Luke's expression changes. Recognition, then happiness.\n\n<b>               EXT. LUKE'S STREET. LATE AFTERNOON\n</b>\n               The Jeep stops, its electric engine WHIRRING down. The Driver \n               climbs out wearily, reaching into the back seat, and comes \n               out with a champagne bottle, hastily decorated with ribbon. \n               The PARTY SOUNDS are drifting this way, and he hesitates a \n               moment, seeming to gather himself. He starts gamely towards \n               the party, then pauses again.\n\n               Debra Graham stands nearby on the front lawn, waiting. She \n               smiles tentatively.\n\n               JIM MCCONNELL, early 40s, manages a smile in return. He has \n               dark circles under his eyes, and his clothes look slept in.\n\n               Yet we sense, even through his sadness, a kind of quiet \n               competence in this man, an unforced authority; he's a natural \n               leader.\n\n               Debra hurries forward, into his arms, and he hugs her. They \n               separate, looking at each other. Her eyes are shining.\n\n<b>                                     DEBRA\n</b>                         We were afraid you wouldn't come.\n\n<b>                                     MCCONNELL\n</b>                         I caught a whiff of your barbecue. \n                         After that I was helpless.\n\n<b>                                     DEBRA\n</b>                         All the way out in Galveston?\n\n<b>                                     MCCONNELL\n</b>                         Something like that.\n                              (she smiles)\n                         It's his night, Deb. I didn't want \n                         to spoil it.\n\n<b>                                     DEBRA\n</b>                         Spoil it? He's been going crazy \n                         looking for you.\n\n               Over her shoulder he sees Luke approaching, his arm around \n               Bobby. The two men look at each other, the bond between them \n               so strong it needs no words. Finally Luke smiles.\n\n<b>                                     LUKE\n</b>                         C'mon. A whole lot of folks here are \n                         gonna be mighty glad to see you.\n\n               McConnell comes towards him, accompanied by Debra, and \n               together the four of them move OUT OF FRAME, heading towards \n               the party. ANGLE HOLDS on the parking area, as we...\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. SAME VIEW. NIGHT (HOURS LATER)\n</b>\n               All the parked cars and vans are gone now, except for two: \n               McConnell's Jeep and Woody's classic 'Vette. Willis, one of \n               the last to go, is just departing on his motorcycle. Perched \n               behind him, arms around his waist, is PRETTY GIRL #3. They \n               zoom away, through the darkened neighborhood.\n\n<b>               EXT. BACK YARD. NIGHT\n</b>\n               The yard is nearly deserted. The \"Bon Voyage\" banner has \n               torn loose at one end and flutters limply. Here and there a \n               napkin blows across the ground.\n\n               In the distance, THREE FIGURES sit on the ground, by the \n               waning fire of the barbecue pit, sipping beers.\n\n<b>               CLOSER ON THIS TRIO\n</b>\n               As Woody shoves another piece of wood into the flames. For a \n               moment he, McConnell, and Luke are silent, staring at the \n               sparks as they rise towards the stars -- red and gold dots \n               mingling with the silver ones.\n\n<b>                                     WOODY\n</b>                              (abruptly)\n                         I wish we were all going. Together.\n\n               The intensity in his voice surprises the others, and even \n               Woody himself. Luke glances at McConnell. An awkward beat.\n\n<b>                                     LUKE\n</b>                         Then you've got a short memory. Think \n                         back to how we were by the second \n                         week of lunar training.\n\n<b>                                     WOODY\n</b>                         Oh, you're not gonna bring that up \n                         again --\n\n<b>                                     LUKE\n</b>                              (laughing)\n                         I'm trying to remember, let's see, \n                         which one of us scored the lowest \n                         ranking up there?\n\n<b>                                     WOODY\n</b>                         You just can't let that go --\n\n<b>                                     LUKE\n</b>                         Oh, man, three commanders, on the \n                         same ship? If they sent us off to \n                         Mars together, there wouldn't be \n                         enough fuel to lift all those egos.\n\n<b>                                     WOODY\n</b>                              (laughs)\n                         Bullshit, we would've made a great \n                         crew.\n\n<b>                                     MCCONNELL\n</b>                         That was never gonna happen. I was \n                         always teamed with Maggie, and we \n                         were mostly chalkboard jockies. You \n                         know? Systems. Payloads...\n\n<b>                                     LUKE\n</b>                         Listen to him. Mr. Cover-of-Time \n                         Magazine!\n\n<b>                                     WOODY\n</b>                         Yeah, who landed the crippled Block \n                         II Shuttle?\n\n<b>                                     LUKE\n</b>                         Yeah, and who scored highest on the \n                         lunar rankings?\n\n<b>                                     WOODY\n</b>                         Let it go, Luke.\n\n<b>                                     MCCONNELL\n</b>                              (smiles)\n                         Sure, I made a little noise. But \n                         putting the first footprints on Mars? \n                         Nah. That's for guys who...\n                              (looks at Luke)\n                         ...wrote their Ph.D. thesis on how \n                         to colonize the place. And guys who...\n                              (looks at Woody)\n                         ...read too much science fiction as \n                         a kid and still wear little Flash \n                         Gordon rocketships around their necks.\n\n               He grabs playfully at Woody's neck. Woody smacks his hand \n               away, laughing.\n\n<b>                                     WOODY\n</b>                         You read the same damn science fiction \n                         books that I did! You're just not \n                         man enough to wear jewelry!\n\n               He pulls from his shirt a little Flash Gordon rocketship \n               emblem hanging on a chain, and waggles this tauntingly at \n               McConnell, as Luke and McConnell laugh.\n\n<b>                                     WOODY\n</b>                         You want Flash. You know you want \n                         him. Well you'll have to come through \n                         me!\n\n               Luke grabs Woody's arm to give McConnell a better shot at \n               the emblem, but Woody cuffs his hands away, laughing. \n               McConnell, watching their horseplay, shakes his head.\n\n<b>                                     MCCONNELL\n</b>                         God, she would've loved to see you \n                         two clowns. Just one more time.\n\n               He tries to smile, but his face reddens. Then all at once \n               his chest is heaving as he struggles to control his emotions. \n               Woody sees this, reaches out a reassuring hand, but McConnell \n               shakes him off, rises abruptly. He turns his back on them, \n               walking away a few steps.\n\n               Woody and Luke exchange a worried glance.\n\n<b>               EXT. LUKE'S STREET. LATER THAT NIGHT\n</b>\n               McConnell and Luke watch as Woody starts up his Corvette. \n               McConnell has regained his composure.\n\n<b>                                     LUKE\n</b>                         Hey, Woodrow, isn't it about time \n                         you donated this thing to a museum?\n\n               Woody revs the engine, which ROARS lustily. He grins.\n\n<b>                                     WOODY\n</b>                         Internal combustion, boys. Accept no \n                         substitutes.\n\n               Luke laughs. Woody looks at McConnell.\n\n<b>                                     WOODY\n</b>                         Jim, if there's ever... if there's \n                         anything Terri and I can do --\n\n<b>                                     MCCONNELL\n</b>                         I'm okay. Really. Thanks.\n\n               Woody reaches out to shake Luke's hand.\n\n<b>                                     WOODY\n</b>                         See you when I get to Mars, Luke. \n                         Don't solve all the mysteries of the \n                         universe, okay? Leave a little \n                         something for the next guys.\n\n<b>                                     LUKE\n</b>                         I'll see what I can do. Just make \n                         sure you bring some fresh beer.\n\n<b>                                     WOODY\n</b>                         You got it.\n\n               With a final glance at McConnell, Woody slips the car into \n               gear. McConnell and Luke watch as he drives away. A silence. \n               Luke glances at his old friend, growing more serious. We \n               sense he's been waiting all night for a chance to say this.\n\n<b>                                     LUKE\n</b>                         Should've been your mission, Jim. \n                         Yours and Maggie's.\n\n               McConnell, looking after Woody's car, becomes very still.\n\n<b>                                     LUKE\n</b>                         None of us ever wanted Mars the way \n                         you two did. Not even Woody. Twelve \n                         years of hoping for this assignment, \n                         training for it --\n\n<b>                                     MCCONNELL\n</b>                         That's all over now.\n\n<b>                                     LUKE\n</b>                         If Maggie hadn't gotten sick -- if \n                         you hadn't pulled yourself out of \n                         the rotation to take care of her --\n\n               McConnell turns to him, his eyes flashing danger. He will \n               not tolerate pity. Luke sees this but presses on.\n\n<b>                                     LUKE\n</b>                         No, I'm gonna say this. I have to \n                         say it...\n                              (pause)\n                         I wanted Mars One. Hell, I battled \n                         you for it every step of the way. \n                         Never wanted to beat anybody so bad \n                         in my life. But not like this... \n                         Jim, I'd give this all up in a second, \n                         if it would bring Maggie back to us.\n\n               McConnell is deeply moved, and for a moment doesn't trust \n               his own voice.\n\n<b>                                     MCCONNELL\n</b>                         I know that, Luke. You don't have to \n                         say it... Mars is yours now. Go get \n                         it.\n\n<b>                                     LUKE\n</b>                              (pause)\n                         Take care of yourself.\n\n<b>                                     MCCONNELL\n</b>                         Yeah. You too.\n\n               Luke nods. They grab hands for a second, then let go. Luke \n               walks back towards his house. McConnell watches him for a \n               moment, then turns, walks over to his Jeep. He opens his \n               door, then pauses. He turns. Looks up at --\n\n<b>               EXT. NIGHT SKY\n</b>\n               A tiny reddish dot hovers there, glowing steadily. Mars \n               itself, a tantalizing prize. But for him now, more distant \n               than ever. For him, perhaps, never to be attained.\n\n<b>               CLOSE ON MCCONNELL'S FACE\n</b>\n               As we see these thoughts going through him. After a moment \n               he looks down at\n\n<b>               HIS SHOES\n</b>\n               And the sandy verge of the front yard.\n\n<b>               MCCONNELL'S EYES\n</b>\n               Are a map of complex emotions: regret, injured pride, infinite \n               yearning. Gently, a bit self-consciously, HE LIFTS ONE SHOE\n\n               And sets it down again, making a careful, deliberate footprint \n               in the sandy soil...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. MARS. CHRYSE PLANITIA. DAY\n</b>\n               Instantly we're hurled into an immense, stunning LANDSCAPE, \n               mysterious and vivid as a fever dream. Dazzling sunlight. A \n               vast plain of rust-orange soil. Countless craters. Boulders \n               the size of houses, tossed about by the hands of gods. Twin \n               moons hanging in a salmon-pink sky. On the horizon, towering, \n               craggy peaks. And, at center -- the only sign of life -- a \n               small, mysterious, moving puff of dust.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. MARS. DAY\n</b>\n               CLOSER ANGLE as a small, Sojourner-like, multi-wheeled robotic \n               vehicle ambles INTO FRAME, jouncing along the orange Martian \n               soil, pausing to snuffle its sensors towards the occasionally \n               interesting rock. Lettering on its side reads \"ARES-8.\"\n\n<b>               SUPER TITLE: \"MARS. PLAINS OF CYDONIA. EIGHT MONTHS LATER.\"\n</b>\n               Suddenly Ares-8 pauses. Its video lens WHIRRS out, fine-tuning \n               focus, as it becomes intrigued by something OFFSCREEN -- a \n               higher, more distant target. The little fellow almost quivers \n               with excitement.\n\n<b>               EXT. MARS. TIU VALLIS. DAY\n</b>\n               A one-man ATV ROVER waits in the background, in a dry \n               streambed, as Luke, in an EVA spacesuit, swings a clawed \n               rock hammer against a multi-layered, sedimentary rock face. \n               Reddish dust coats his bulky white suit. Despite that bulk, \n               he moves easily in the light Martian gravity (1/3 Earth's). \n               A hunk of rock breaks off, and Luke examines it more closely, \n               holding it up to his clear faceplate. He's very happy, \n               absorbed in this work, when his RADIO CRACKLES.\n\n<b>                                     COTE\n</b>                         Luke, you read me?\n\n<b>                                     LUKE\n</b>                         Yeah, Renee.\n\n<b>                                     COTE\n</b>                         Luke, I just got ARES-8 on line and... \n                         Well, we think you're gonna wanna \n                         see this for yourself.\n\n               Luke, though reluctant to break off work, is intrigued.\n\n<b>                                     LUKE\n</b>                         Copy that.\n\n               As Luke turns away, headed for the rover\n\n<b>               WE PULL WIDE\n</b>\n               To REVEAL a STAGGERING PROSPECT, seen for the first time: \n               Valles Marineris, that planet-creasing slash. So wide, so \n               deep, it boggles the mind: on earth it would reach from New \n               York to L.A.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. MARS ONE HAB. DAY\n</b>\n               The crew of Mars One - Kirov, Willis, and Cote -- have joined \n               Luke, gathered around some display monitors. They're in NASA \n               jumpsuits; the Hab has artificial atmosphere, enhanced \n               gravity, and heat. All are captivated by what they see. ON A \n<b>               VIDEO SCREEN\n</b>\n               We see a low-angle image of an elongated, rubble and dirt-\n               covered MOUNTAIN. Hard to tell scale, but it looks huge. \n               What's most striking, however, is a WHITE PEAK barely \n               protruding through the rubble two-thirds of the way along \n               the mountain's ridgeline. Its whiteness is in clear contrast \n               to the typical rust-orange of the surrounding rubble; what's \n               more, this strange little peak also displays an oddly-smooth, \n               multi-planed symmetry.\n\n<b>                                     LUKE\n</b>                         What the hell is that?\n\n<b>                                     COTE\n</b>                         No idea, boss.\n\n<b>                                     LUKE\n</b>                         Where is it?\n\n               Cote glances at the others. They're all smirking, as if they \n               share some secret joke Luke's not yet in on.\n\n<b>                                     WILLIS\n</b>                         You don't wanna know.\n\n<b>                                     LUKE\n</b>                         C'mon, what's so funny? Gimme the \n                         coordinates.\n\n               He leans over to read a digital gauge, but Cote covers it \n               with her hand, enjoying the tease.\n\n<b>                                     COTE\n</b>                         Latitude 41 degrees north, longitude \n                         9 degrees west.\n\n<b>                                     LUKE\n</b>                         The Plains of Cydonia. So?\n                              (pause)\n                         Oh no. You're not telling me --\n\n               They all laugh as the other shoe drops. Luke's expression is \n               incredulous, exasperated.\n\n<b>                                     COTE\n</b>                         Oui. Exactement! It's Kirov's fault, \n                         he picked today's sector.\n\n<b>                                     KIROV\n</b>                         Hey, c'mon! We've got a scientific \n                         duty to check that thing out.\n\n               Luke sits, taking over the Ares remote control from Cote. \n               They all watch as he fine tunes the image, trying without \n               success to coax more resolution.\n\n<b>                                     LUKE\n</b>                         Great. That's great. The first anomaly \n                         we hit, and it's gotta be in the one \n                         place guaranteed to make NASA look \n                         ridiculous... You know how many books \n                         have been written about that damned \n                         mountain?\n\n<b>                                     COTE\n</b>                         The Egyptians put it there.\n\n<b>                                     KIROV\n</b>                         No, the Amazons.\n\n<b>                                     WILLIS\n</b>                         No, it was little green men!\n\n<b>                                     LUKE\n</b>                         And all because a couple of lousy \n                         impact craters happen to look like \n                         eye sockets. If this gets out, we'll \n                         have every UFO kook on Earth spouting \n                         off on the six o'clock news... C'mon, \n                         people, gimme a read here. Is that a \n                         cinder cone?\n\n<b>                                     KIROV\n</b>                         Nah, too smooth. Too angular. Volcanic \n                         upwelling?\n\n<b>                                     COTE\n</b>                         No fissures. No caldera.\n\n<b>                                     LUKE\n</b>                         It's an upwelling, for sure. But \n                         maybe not volcanic...\n\n               The others look at him, puzzled. Luke leans in closer, with \n               growing excitement. He points to the screen.\n\n<b>                                     LUKE\n</b>                         Look at the color. And see how shiny \n                         it is? I could swear that's ice...\n\n<b>                                     COTE\n</b>                         This far south?\n\n<b>                                     WILLIS\n</b>                         Impossible. You can't have ice at \n                         this latitude. Not unless...\n\n               They look at each other, Luke's excitement now leaping from \n               one to another of them. They're almost trembling.\n\n<b>                                     WILLIS\n</b>                         Oh my God.\n\n<b>                                     LUKE\n</b>                         How far away is it?\n\n<b>                                     KIROV\n</b>                         Sixteen kilometers northeast. Take \n                         us twenty minutes to get there.\n\n<b>                                     LUKE\n</b>                              (considers a moment)\n                         Let's send a packet to Micker. Then \n                         we'll go check it out.\n\n<b>               EXT. MARS ONE BASE CAMP. DAY\n</b>\n<b>               AIRLOCK DOORS\n</b>\n               Slide back, REVEALING the crew in EVA suits, carrying gear. \n               They walk over to...\n\n<b>               THE FOUR-MAN ROVER\n</b>\n               The astronauts climb in through the hatch. The last one in \n               pulls it shut behind him and locks the latches. We see Cote \n               and Luke check their screens and press some buttons. Luke \n               puts the rover in drive.\n\n<b>               WIDER ANGLE, PULLING UP AND AWAY\n</b>\n               As the rover moves off across the rocky surface, dust kicking \n               up from the wheels, we get our first exterior glimpse of the \n               Mars One Base Camp. The main HAB UNIT looks like a huge tuna \n               can with a conical top section; it connects to a separate, \n               inflated-bubble GREENHOUSE. There's also an OXYGEN STILL, \n               PROPELLANT PLANT, and, on the other side, a couple hundred \n               meters distant, the massive ERV (Earth Return Vehicle), which \n               arrived as a separate, unmanned flight.\n\n               Rows of SOLAR PANELS, arrayed on the ground, and an AMERICAN \n               FLAG on a thin pole, about man-height, complete the scene.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. INTERNATIONAL SPACE STATION (ISP). EARTH ORBIT. DAY\n</b>\n               A vast, impressive, MULTI-SECTIONED SPACECRAFT is drifting \n               majestically above Earth. The main hull displays both NASA \n               and U.N. flag decals.\n\n<b>               SUPER TITLE: \"INTERNATIONAL SPACE STATION. MARS MISSION \n</b><b>               CONTROL ROOM (MMCR). 20 MINUTE TIME LAG.\"\n</b>\n               We MOVE IN towards another of the station's segments, which \n               is dedicated entirely (as we see from more labels and \n               insignias) to the Mars Program: Control Room, Training and \n               Living Quarters, and a Vehicle Docking and Launch Area, where \n               Mars Two is already positioned for its eventual flight. We \n               hear LUKE'S EXCITED VOICE, over speakers.\n\n<b>                                     LUKE\n</b>                         This is a truly anomalous formation. \n                         Looks like nothing we've seen so \n                         far. The structure appears to be \n                         crystalline, at least from the angle \n                         displayed by ARES-8 ...\n\n<b>               INT. MMCR. DAY\n</b>\n               On a large CENTER DISPLAY SCREEN, we see Luke and the Mars \n               One crew, sitting around their kitchen table in the Hab, \n               finishing lunch while taping this VIDEO MESSAGE.\n\n<b>                                     LUKE\n</b>                              (grins)\n                         We're all trying not to go too nuts \n                         up here, but -- we think there's a \n                         good chance this could be an extrusion \n                         from some subsurface, geothermal \n                         column of water. And if we're right...\n\n               He looks at his crew. They beam like cats who ate canaries.\n\n<b>                                     LUKE\n</b>                         ...then we've found the key to \n                         permanent human colonization.\n\n<b>               IN THE MMCR\n</b>\n               There's an EXCITED BUZZ among the assembled TECHNICIANS, \n               FLIGHT ENGINEERS, and SCIENTISTS. This would be a fantastic, \n               epochal discovery.\n\n<b>               MCCONNELL\n</b>\n               Sits at the center console, wearing a headset. He's now the \n               Mars One CAPCOM (Capsule Communicator), and his manner is \n               brisk, efficient, all-business. A TECHNICIAN leans in for \n               instructions.\n\n<b>                                     MCCONNELL\n</b>                         Tell geology and hydrology we need \n                         to scramble on this. Full-court press.\n\n               The technician nods, hurries away. McConnell, sharing the \n               intense excitement of those around him, stares up at\n\n<b>               THE SCREEN\n</b>\n               Where Luke and his crew are still smiling, well knowing the \n               excitement their bombshell will create.\n\n<b>                                     LUKE\n</b>                         Anyway, we'are going out to take a \n                         closer look at it, try to get an \n                         idea of its composition.\n                              (checks his watch)\n                         By the time you receive this, we \n                         should be just about on-site.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               The rover is a hundred meters away and moving fast TOWARDS \n               CAMERA. We BOOM DOWN to REVEAL Ares-8, still faithfully \n               holding its point, like an Irish Setter, with its video snout \n<b>               WHIRRING OUT.\n</b>\n               The rover drives up and slows to a stop nearby. The hatch \n               door cracks open and some dust vents out. The door opens all \n               the way and the astronauts climb out. They all look up in \n               awe. We hear their voices ON RADIOS.\n\n<b>                                     KIROV\n</b>                         Jesus Christ...\n\n<b>               THE MYSTERIOUS PEAK\n</b>\n               Gleams in the sun, dazzling white, its facets as planed and \n               smooth as if an architect had drawn them. It pierces through \n               the topmost rubble at the near end of the big mountain -- an \n               isolated, butte-like giant, stretching two miles from left \n               to right in front of them.\n\n<b>               THE ASTRONAUTS\n</b>\n               Walk towards the mountain. There's a very deep, very low, \n               staccato tone intruding over their headsets.\n\n<b>                                     LUKE\n</b>                         Anyone else hear that?\n\n<b>                                     COTE\n</b>                         Yeah. What is it?\n\n<b>                                     WILLIS\n</b>                         Sounds like our antenna's out of \n                         phase.\n\n<b>                                     LUKE\n</b>                         Can you fix it?\n\n<b>                                     WILLIS\n</b>                         Hey, skip, I can fix anything.\n\n<b>                                     LUKE\n</b>                         Big talker. Renee, Sergei, let's \n                         break out the radar, see what this \n                         thing's made of.\n\n               As they go to their jobs, the deep, barely audible rumbling \n               tone continues.\n\n<b>               INT. SPACE STATION. CORRIDOR OUTSIDE MMCR. DAY\n</b>\n               MULTINATIONAL CREWMEMBERS walk by, in the artificial gravity \n               of the busy station, as RAY BECK, mid-50s, approaches from \n               the opposite direction. Beck is the tough, crewcut, PR-savvy \n               head of the NASA Mars Program (ID'd by his name tag), and \n               just now he's leading a covey of U.N. AMBASSADORS on a tour. \n               The ambassadors, of both sexes, many nations, and all races, \n               look as excited as schoolkids.\n\n<b>                                     BECK\n</b>                         ...and this is the Mars Mission \n                         Control Room, nicknamed \"Micker.\" I \n                         understand a comm packet is incoming \n                         from Mars One Base Camp, so you may \n                         find this interesting.\n\n               He opens the doors, ushering his flock inside.\n\n<b>               INT. MMCR. DAY\n</b>\n               The ambassadors enter, oohing and ahhing over the impressive \n               array of gadgetry and personnel, and especially over the big \n               screen. Some of them start taking souvenir snaphots. The \n               NIGERIAN AMBASSADOR turns to Beck, whispering curiously.\n\n<b>                                     AMBASSADOR\n</b>                         That man over there. He's in charge?\n\n<b>               BECK FOLLOWS HIS GLANCE TO\n</b>\n<b>               MCCONNELL\n</b>\n               Who is surrounded by a KNOT OF TECHNICIANS, to whom he is \n               giving quiet, precise instructions. They hover, then depart, \n               like so many eager bees.\n\n<b>               BECK\n</b>\n               Smiles indulgently at the ambassador's misunderstanding.\n\n<b>                                     BECK\n</b>                         No, actually, that's Jim McConnell, \n                         the CAPCOM. Our voice link to the \n                         astronauts? Jim's been with the manned \n                         Mars program since its inception. \n                         One of our real pioneers.\n\n<b>                                     AMBASSADOR\n</b>                         Will he be going to Mars, too?\n\n<b>                                     BECK\n</b>                         Ah, no. This is as close as he gets.\n\n<b>               ON THE SCREEN\n</b>\n               Luke and his crew have finished eating, and are clearing \n               away their dishes and leftovers.\n\n<b>                                     LUKE\n</b>                         ...anyway, that's about it. We'll \n                         send another packet when we get back.\n\n               Cote clears her throat, gives Luke a look. The others can \n               barely conceal their grins.\n\n<b>                                     LUKE\n</b>                         Oh, right. One more thing. Today is \n                         a very special day for a good friend \n                         of ours, and I know he's there right \n                         now.\n\n               McConnell looks at the screen, worried. What's Luke up to?\n\n<b>                                     LUKE\n</b>                         Now, he hates it when any fuss is \n                         made, so I won't mention his name...\n\n               A look of relief comes over McConnell.\n\n<b>                                     LUKE\n</b>                         ...because the last thing in the \n                         world I'd ever want to do is embarrass \n                         someone like Jim McConnell.\n\n               McConnell winces -- Dear God, no -- as, on the screen, Kirov \n               appears from OFF CAMERA holding a cupcake with a burning \n               candle stuck in it, and the Mars One crew starts SINGING \n               \"Happy Birthday\" to him. Loudly. And very off-key.\n\n<b>                                     LUKE\n</b>                         C'mon, you Micker weasels, sing!\n\n               Soon most everyone in MMCR is singing along -- even some of \n               the jolly ambassadors -- with the noticeable exception of \n               Beck, who stiffens unhappily. McConnell is mortified.\n\n<b>                                     LUKE\n</b>                              (sings a line, then, \n                              to CAMERA:)\n                         Hey, Ray! Take a look at him! Is he \n                         all red with one of those fake \"I'm-\n                         a-good-sport\" grins?\n\n               Beck looks over at McConnell, who indeed is red in the face \n               with a fake \"I'm-a-good-sport\" grin.\n\n<b>                                     LUKE\n</b>                         And hey, you guys, check out Ray! \n                         Does he have on one of his \"This-\n                         wasn't-in-my-mission-plan\" faces?\n\n               Indeed, Beck's smile is thin, sour, disapproving.\n\n<b>                                     LUKE\n</b>                         Nothing you can do about it, Ray! \n                         We're a hundred million miles away!\n\n               Luke and the crew finish singing the song. Luke raises the \n               cupcake in a toast.\n\n<b>                                     LUKE\n</b>                         Happy Birthday, Jimbo! Make a wish!\n\n               He and his crew lean in, blow out the candle. They laugh and \n               applaud, then wave goodbye.\n\n<b>                                     LUKE\n</b>                         Catch you again soon. Take care, \n                         buddy. End of transmission.\n\n               Luke reaches out, turns OFF the CAMERA, and the display screen \n<b>               GOES BLACK.\n</b>\n               Beck turns, his gaze locking with McConnell's. He's annoyed, \n               as if this violation of protocol were somehow McConnell's \n               fault. McConnell returns his stare coolly.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               Cote stands by a display screen mounted on the rover. Kirov \n               has a big radar gun on a tripod, pointing at the mountain. \n               Luke turns to Cote.\n\n<b>                                     LUKE\n</b>                         Well? What's under there?\n\n<b>                                     COTE\n</b>                              (puzzled)\n                         Je ne sais pas. I... I think there's \n                         something wrong with the equipment.\n\n<b>                                     LUKE\n</b>                         What?\n\n<b>                                     COTE\n</b>                         I mean, it can't be right. It says... \n                         it says there's metal under there.\n\n               Luke doesn't understand. He walks up to look at the display \n               screen.\n\n<b>                                     COTE\n</b>                              (points)\n                         There's ten, twelve meters of rubble \n                         and sand, and then... solid metal.\n\n<b>                                     LUKE\n</b>                         That doesn't make any sense. You're \n                         reading a vein of ore.\n\n<b>                                     COTE\n</b>                              (shakes her head)\n                         No. It's under the whole mountain.\n\n               The deep pulsing tone continues. Luke frowns.\n\n<b>                                     LUKE\n</b>                         Nick, could the problem with the \n                         antenna be interfering?\n\n<b>                                     WILLIS\n</b>                         Could be.\n\n<b>                                     LUKE\n</b>                              (to Cote and Kirov)\n                         Try it closer and up the power. I'll \n                         watch the screen.\n\n<b>               INT. MMCR. DAY\n</b>\n               McConnell is taping an audio message to be sent to Mars as \n               the rest of MMCR looks on. Beck is gone. So are the U. N. \n               ambassadors.\n\n<b>                                     MCCONNELL\n</b>                         Ah, we're all pretty stoked about \n                         that formation you spotted, Mars \n                         One. The folks in the geology and \n                         hydrology back rooms are going over \n                         your images and comparing them to \n                         every photomap they've got.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               Cote and Kirov are close to the foot of the mountain, \n               resetting the radar gun on its tripod. The deep vibrating \n               tone continues.\n\n               Luke is some distance away, by the rover. He looks at Willis, \n               who's still working on the rover's antenna.\n\n<b>                                     LUKE\n</b>                         Nick, how we coming on that antenna?\n\n<b>                                     WILLIS\n</b>                         Goin' as fast as I can, boss.\n\n               Cote and Kirov are having some trouble with the switches on \n               the radar gun. They turn towards Luke and Willis.\n\n<b>                                     KIROV\n</b>                         Hey, Nick. Come show me how stupid I \n                         am. I can't get this to work.\n\n               Willis looks at Luke. Luke nods -- Go help them. Willis starts \n               towards the radar gun.\n\n<b>               INT. MMCR. DAY\n</b>\n               McConnell is handed a slip of paper, glances at it.\n\n<b>                                     MCCONNELL\n</b>                         Medical wants me to remind you that \n                         you're three days late on your blood \n                         tests. I know they're a bore, but \n                         you've got to get them done, or \n                         else... or else I don't know what. \n                         Just do them, okay?\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               Willis, Cote, and Kirov get the radar gun up and running.\n\n<b>                                     KIROV\n</b>                         All set here, chief.\n\n               Luke sidles over to the display screen on the rover.\n\n<b>                                     LUKE\n</b>                         Okay. Crank up the juice and let's \n                         see what's in this sucker.\n\n<b>               INT. MMCR. DAY\n</b>\n               McConnell checks over his clipboard list of updates.\n\n<b>                                     MCCONNELL\n</b>                         I think that's about it for business. \n                         But on a personal note, be advised \n                         that, ah, none of you can sing worth \n                         a damn.\n\n               LAUGHTER in the MMCR.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               Luke watches the screen on the rover, as, by the mound...\n\n<b>               KIROV\n</b>\n               Flips a switch on the radar gun, then swivels its muzzle \n               slowly across the near slope of the mountain. We hear and \n               feel the radar signal. The immediate result is that the \n               pulsing tone we've been hearing suddenly stops.\n\n<b>               LUKE\n</b>\n               Looks up from the display screen. A puzzled expression.\n\n<b>                                     LUKE\n</b>                         Why did that stop?\n\n               A split-second later, he gets his answer. We hear a WHOOSH, \n               a mighty rushing of wind, as\n\n<b>               A GIGANTIC, TRANSLUCENT CYLINDER\n</b>\n               Starts to swirl and rise, straight up from the top or the \n               mountain, at its center. As it swirls, the cylinder picks up \n               debris -- pebbles, sand -- from the sediment-encrusted surface \n               of the slopes.\n\n<b>               THE FOUR ASTRONAUTS\n</b>\n               Stare up at this spectacle, awed. A cyclone? Some kind of \n               energy wave? They have no idea. At the moment they're too \n               fascinated to even be scared.\n\n<b>               TILTING UP - FROM THEIR POV\n</b>\n               We see the whirling cylinder rise, higher and higher, \n               perfectly straight, until in just moments it's as tall as a \n               skyscraper. As it rises, it gains speed and power, narrowing \n               at its top into a conical vortex. It's sucking up so much \n               dirt, so many rocks -- even small boulders now -- that the \n               accumulating debris begins to darken its swirling, translucent \n               outer \"skin\".\n\n<b>               THE ASTRONAUTS\n</b>\n               Exchange amazed glances. Can't believe their eyes...\n\n<b>               INT. MMCR. DAY\n</b>\n               McConnell still hovers by the microphone.\n\n<b>                                     MCCONNELL\n</b>                         Honestly, Luke, if you guys don't \n                         have anything better to do with your \n                         time, I can make some suggestions to \n                         mission medical. There are worse \n                         things than blood tests.\n\n               LAUGHTER and GROANS from the staff in MMCR.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               Luke, still staring in fascination, becomes aware of sand \n               and pebbles flashing past his helmet. From behind. He turns.\n\n<b>               SAND PATTERS AGAINST HIS FACEPLATE\n</b>\n               As the nearby landscape BLURS. The vacuuming effect is \n               becoming more general across the area. More violent.\n\n<b>               LUKE IS ALARMED\n</b>\n               And the spell is broken. He keys his throat mike, his lips \n               moving, but no sound can be heard over the ROARING WIND. He \n               waves his arms, motioning for the others to back away, towards \n               the rover. Wind whips at their EVA suits as they obey him, \n               retreating.\n\n               Luke, backing away himself, is afraid to take his eyes off \n               the cylinder.\n\n               Then he sees that one man -- Willis -- hasn't moved. In fact \n               he's busily snapping photographs of the cylinder. Luke hurries \n               over to him, tugs his sleeve.\n\n<b>               WILLIS LOWERS HIS CAMERA\n</b>\n               But still stares up, transfixed, like a man face to face \n               with a cobra. Luke follows the young astronaut's frightened \n               gaze, and his own eyes widen as he sees\n\n<b>               THE TOP OF THE VORTEX\n</b>\n               Beginning to tilt down, then coil sideways. Suddenly they're \n               looking into the huge open \"mouth\" of it, as sand and rocks \n               fly into the swirling darkness...\n\n               The monstrous, gaping maw slithers down over the rim of the \n               mountain, turning this way, then that. Seeking them. And \n               then, with horrifying precision, it locks in on the little \n               group of astronauts. And lunges towards them...\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               Luke and Willis turn, running as hard as they can towards \n               the rover. But the suction is so great, it's as if they're \n               held back by wires.\n\n               The ground itself is SHAKING, RUMBLING, as earthquakes begin \n               to open fissures across the plain. The ROAR of the vortex, \n               the GROANING of the earth, are like an onrushing freight \n               train...\n\n<b>               AHEAD OF THEM\n</b>\n               In the maelstrom of flying debris, they can barely make out \n               Cote and Kirov, still retreating, leaning back with all their \n               strength against the suction, while staring up, aghast.\n\n               Suddenly a hurtling rock, the size of a basketball, smashes \n               into Cote's helmet from behind, crushing it and killing her \n               instantly. Blood sprays into the wind, immediately \n               crystallizing, in the sub-zero atmosphere, into red pellets...\n\n<b>               LUKE, HORRIFIED, FLINGS HIS ARM UP\n</b>\n               As bloody hail patters against his faceplate and forearm. An \n               instant later he sees\n\n<b>               KIROV\n</b>\n               Snatched up by the wind, then swept past him, in a terrifying \n               blur, arms and legs flailing, mouth open in a silent scream \n               as he vanishes...\n\n<b>               THE GROUND AT LUKE'S FEET\n</b>\n               Abruptly opens, and he slides into a fissure. Scrabbling \n               frantically with his gloved hands, he manages to momentarily \n               arrest his fall, gripping the edge of the fault line, with \n               his helmet and one elbow thrust over its lip. The air is \n               almost solidly choked with debris, deadly boulders bound \n               over him, and torrents of cascading sand are burying him \n               alive...\n\n<b>               CLOSE ON LUKE\n</b>\n               Barely conscious, as he watches, for a horrifying final \n               instant, as...\n\n<b>               HIS LAST CREWMAN, WILLIS\n</b>\n               Is sucked bodily into the black maw of the vortex, spinning \n               and tumbling like a rag doll...\n\n<b>               CLOSE ON WILLIS'S FACE\n</b>\n               His features grotesquely distorted by the forces tearing at \n               him, before suddenly his faceplate is sprayed with blood, \n               and...\n\n<b>               DISTANT ANGLE - LUKE'S POV\n</b>\n               Willis's spacesuit explodes, his entire body disintegrating \n               into a million bits, which instantly disappear into the \n               hellish maelstrom. And then that maelstrom itself, just as \n               abruptly...\n\n               STOPS. Vanishes.\n\n               There is an instant, ringing SILENCE, as awesome in its own \n               way as the roaring storm itself had been...\n\n<b>               WIDE ANGLE\n</b>\n               On the plain, as the last pebbles, released from suction, \n               pitter down, bouncing. Swirls of dust and sand drift away, \n               settling gently. The harsh orange landscape is once again \n               calm, peaceful.\n\n               And then, from the direction of the nearby mountain, we hear \n               another sound: the deep bass pulsing rumble returns.\n\n<b>               INT. MMCR. DAY\n</b>\n               As McConnell finishes his message to Luke.\n\n<b>                                     MCCONNELL\n</b>                         Oh, and I talked to Debra. She and \n                         Bobby are doing fine. Said to tell \n                         you, they're, ah, they're on their \n                         \"third time through the book, page --\n                              (glances at a note)\n                         -- page 125.\" They send their love \n                         and say take care of yourself. Same \n                         from us here, buddy. Till next time, \n                         then. End of transmission.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               MOVING ANGLE, the CAMERA EXPLORING ground zero, as the bass, \n               pulsing rumble continues...\n\n               WE PASS the Rover, canted sideways into a little crater, \n               with its canopy missing, one axle fractured, but miraculously \n               still with all four wheels...\n\n               WE PASS faithful little ARES-8, lying on its side, partially \n               crushed under a boulder. It gives a final, pitiful WHINE, \n               its video snout slowly extending, then dies. And finally we \n               come to the area where the fissure had been, and see\n\n<b>               THE FISSURE HAS BEEN FILLED IN\n</b>\n               Leaving only a slender crease of umber sand. No sign of Luke. \n               The pulsing rumble continues, over, as we see\n\n<b>               EXT. AERIAL VIEW. DAY\n</b>\n               An extraordinary sight, seen from high in the air, looking \n               back down. Staring up at us from the bottom of a shallow \n               crater, scoured clean of its aeons of accumulated silt and \n               rubble, is a structure resembling a vast humanoid Face.\n\n               The surface is gleaming white, apparently metallic. The \n               features are suggested by intricately interlocking planes, \n               slopes, ramps. The \"eyes\" -- hatches of some kind? -- are \n               closed, and the overall expression is eerily calm, but \n               terrible in its power, like some ancient tribal mask.\n\n               We see the Face clearly for only a few beats before thick, \n               scudding clouds OBSCURE it, but the deep, pulsing rumble \n               continues, low and insistent...\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               INT. MARS TWO (DOCKED). COCKPIT. DAY\n</b>\n               We're inside the Mars Two spacecraft, which is still in its \n               docked position alongside the Space Station.\n\n               Woody Blake, wearing a NASA jumpsuit, floats up into the \n               cockpit in Zero-G, studying a thick manual.\n\n<b>                                     WOODY\n</b>                              (reads)\n                         \"Problem: Hatch door malfunction, \n                         backup power fail, manual override \n                         fail. Solution: Replace circuit \n                         breaker 907B.\"\n\n               He straps into the pilot's seat, staring at an electrical \n               junction box at one end of the console.\n\n<b>                                     WOODY\n</b>                         Okay... Piece of cake.\n\n               He swings open the housing, revealing a bewildering tangle \n               of fuses and wires. He sighs heavily, as Terri drifts up \n               beside him, also in a jumpsuit, and straps into the co-pilot's \n               seat.\n\n<b>                                     WOODY\n</b>                         God, who dreams up these nightmares?\n\n<b>                                     TERRI\n</b>                         Don't try to change the subject.\n\n<b>                                     WOODY\n</b>                         I'm not! We're talking about your \n                         sister's wedding, right?\n\n<b>                                     TERRI\n</b>                         Very funny. We're talking about \n                         dancing lessons. Before my sister's \n                         wedding.\n\n<b>                                     WOODY\n</b>                         Honey, do you mind? I've got a \n                         catastrophic power failure here.\n\n               He peers into the housing with exaggerated concern. But \n               Terri's not so easily sidetracked.\n\n<b>                                     TERRI\n</b>                         Woody, we're a married couple. Would \n                         it kill you to invite me out on the \n                         floor once in awhile?\n\n<b>                                     WOODY\n</b>                         I danced with you at our wedding.\n\n<b>                                     TERRI\n</b>                         I'm not talking about shuffling your \n                         feet around while you grab my butt. \n                         I mean real dancing. Cha-cha, rhumba, \n                         jitterbug --\n\n<b>                                     WOODY\n</b>                         Face it, honey, some couples dance, \n                         some go to Mars. That's life.\n\n<b>                                     TERRI\n</b>                         I'm serious. We've got two more months \n                         in this training rotation, but just \n                         as soon as we get home, we're starting \n                         lessons. If we never dance, people \n                         will think there's something wrong.\n\n<b>                                     WOODY\n</b>                         If they see me dance, they'll know \n                         there's something wrong.\n\n               Reaching past him, she pulls out the required breaker. As he \n               reacts, surprised, she smiles, despite her exasperation.\n\n<b>                                     TERRI\n</b>                         You are such a lug.\n\n               Overhead, an intercom CRACKLES. We hear PHIL.\n\n<b>                                     PHIL'S VOICE\n</b>                         Cockpit, this is Control.\n\n<b>                                     TERRI\n</b>                         Control, this is Cockpit.\n\n<b>                                     PHIL'S VOICE\n</b>                         Uh, Terri, they want us all back in \n                         the Station. Report to Micker.\n\n<b>                                     TERRI\n</b>                         Who says report to Micker?\n\n<b>                                     PHIL'S VOICE\n</b>                         The little men who live in my head.\n\n<b>                                     WOODY\n</b>                         Phil, c'mon! We just started this \n                         drill.\n\n<b>                                     PHIL\n</b>                         Woody, it was Ray Beck. He told me \n                         to round up the team. Now.\n\n               Woody and Terri exchange a worried look. What's wrong?\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. SPACE STATION. MMCR. DAY\n</b>\n               A crisis atmosphere prevails. The big room is more crowded \n               than we've ever seen it, with ENGINEERS and MANAGERS hurrying \n               by, huddling in tense, conferring knots, or muttering \n               feverishly into microphones.\n\n               On the center screen, a giant image of Mars. A frantic flow \n               of green numbers crawls above and below this, and the site \n               of the Mars One Base Camp is marked in blinking red.\n\n<b>               WOODY AND HIS CREW\n</b>\n               Are staring up at this screen, appalled. McConnell and Beck \n               stand nearby, briefing them.\n\n<b>                                     BECK\n</b>                         Then, at 1417, the X-band continuous \n                         data stream from Mars went silent. \n                         All data -- med, environmental, \n                         everything -- suddenly stopped. While \n                         we were trying to figure out what \n                         the hell went wrong, we got a signal \n                         from the folks at the Large Array at \n                         Soccoro.\n\n<b>                                     MCCONNELL\n</b>                         At the same moment we lost the data \n                         stream, they picked up an intense \n                         burst of energy from Mars.\n\n<b>                                     WOODY\n</b>                         What do you mean, \"intense\"?\n\n<b>                                     MCCONNELL\n</b>                              (hesitates)\n                         Catastrophic.\n\n               Looks are exchanged among the Mars Two crew.\n\n<b>                                     TERRI\n</b>                         What about the crew?\n\n<b>                                     BECK\n</b>                         The level of energy in the pulse... \n                         didn't seem survivable.\n\n<b>                                     WOODY\n</b>                         What about the REMO? It went into \n                         Mars orbit last week. Maybe that \n                         could give us some clue.\n\n<b>                                     MCCONNELL\n</b>                         Good thinking, Woody. That's just \n                         what we tried next.\n\n               He leans over, punches buttons on a keyboard.\n\n<b>               ON THE CENTER SCREEN\n</b>\n               An orange dot can be seen in its orbital ellipse around Mars, \n               leaving a glowing electronic trail. This dot gets isolated \n               in a viewing box, then enlarged and rotated into the computer-\n               animated image of a small, ugly, industrial-looking unmanned \n               cargo craft, labelled \"REMO.\"\n\n<b>                                     MCCONNELL\n</b>                         The Resupply Module checked out fine. \n                         No instrument failures, no change in \n                         status. Orbit holding steady. But \n                         there was something else. The REMO'S \n                         computer contained an uplink message -- \n                         a very faint, highly distorted \n                         transmission from Mars One Base Camp.\n\n<b>                                     TERRI\n</b>                         Someone's alive.\n\n<b>                                     MCCONNELL\n</b>                         Yes.\n\n<b>                                     PHIL\n</b>                         How?\n\n<b>                                     BECK\n</b>                         The message is almost indecipherable. \n                         Two teams are still working on it. \n                         You better see for yourselves.\n\n<b>               INT. MMCR. DAY\n</b>\n               FINGERS press buttons on a console. McConnell, Woody, Terri, \n               and Phil are crowded around a monitor with Beck and two weary \n<b>               TECHNICIANS.\n</b>\n<b>                                     TECHNICIAN\n</b>                         Still concentrating on the audio. We \n                         managed to bring out a couple more \n                         words, but we've got a long way to \n                         go.\n\n<b>                                     WOODY\n</b>                         Show us whatever you've got.\n\n               The technician nods, then gestures to his assistant who hits \n               a play button.\n\n<b>               CLOSE ON A MONITOR\n</b>\n               Black for a moment, then static. Out of this static comes a \n               faint image of Luke, sitting alone at the Hab kitchen table. \n               He looks awful -- dried blood on his face, bloodshot eyes. \n               The image is blurry, heavily streaked, and most of what he \n               says is lost in waves of static.\n\n<b>                                     LUKE\n</b>                         ...make this quick... may be only ch--\n                              (long section of static)\n                         ...to the site, when we... hit us \n                         just as we... --thers are all dead...\n\n               Woody, Terri and Phil look at each other -- Oh, God.\n\n<b>                                     LUKE\n</b>                              (following more static)\n                         ...low sound that we couldn't \n                         understand. Then all of a sudden \n                         there was this terrib...\n                              (another long burst \n                              of static)\n                         ...--stems are holding up for now, \n                         but I don't know how long I can...\n\n               The monitor screen GOES BLACK.\n\n<b>               INT. MMCR. DAY\n</b>\n<b>                                     TECHNICIAN\n</b>                         That's it.\n\n               Woody and his crew stare at the screen, stunned. This is a \n               catastrophe almost too huge to grasp.\n\n<b>               INT. SPACE STATION. DAY\n</b>\n               As Beck leads McConnell and the other shaken astronauts down \n               a corridor, Phil pauses, seeing...\n\n<b>               A SOBBING TECHNICIAN\n</b>\n               At her desk. TWO CO-WORKERS are trying to comfort her. One \n               of these women looks up, and her reddened eyes meet...\n\n<b>               PHIL'S EYES\n</b>\n               He looks back at her, haunted.\n\n<b>                                     TERRI\n</b>                         What did Luke mean by a \"low sound?\"\n\n<b>               INT. SPACE STATION. DAY\n</b>\n               In an otherwise empty lounge, the astronauts clutch Styrofoam \n               coffee cups. Beck stands nearby. Through a large viewport \n               behind them, stars glitter against the inky blackness.\n\n<b>                                     BECK\n</b>                         If this was a earthquake, as we're \n                         now assuming, there's usually an \n                         auditory component.\n\n<b>                                     WOODY\n</b>                         But that energy pulse they picked up \n                         in New Mexico...\n\n<b>                                     PHIL\n</b>                         Electromagnetic emission. Not uncommon \n                         with large-scale geophysical \n                         phenomena.\n\n<b>                                     WOODY\n</b>                              (incredulous)\n                         Causing this kind of damage? I don't \n                         buy it. We're missing something here.\n\n               McConnell and Woody exchange a glance... Woody's right.\n\n<b>                                     TERRI\n</b>                         Luke must be in pretty bad shape if \n                         he hasn't blasted out of there in \n                         the Earth Return Vehicle. That thing's \n                         designed so even one crew member \n                         could fly it back to Earth.\n\n<b>                                     MCCONNELL\n</b>                         Even if Luke was in great shape, he \n                         couldn't get home. That energy pulse \n                         would've fried the ERV'S computers.\n\n<b>                                     WOODY\n</b>                         Other than the computers, how do we \n                         think the ERV fared?\n\n<b>                                     BECK\n</b>                         Well, so far our modelling says it \n                         should be in pretty good shape.\n\n<b>                                     WOODY\n</b>                         Which means it's gonna be up to us \n                         to get new motherboards, drives, and \n                         software to Mars. As fast as we can.\n\n               McConnell looks at him, nods. They're on the same wavelength. \n               But Beck is more cautious.\n\n<b>                                     BECK\n</b>                         Whoa, slow down. It's gonna take us \n                         weeks just to analyze this data.\n\n<b>                                     MCCONNELL\n</b>                         Right, but meanwhile, we've gotta be \n                         working up a mission plan.\n\n<b>                                     WOODY\n</b>                         Luke needs us now.\n\n<b>                                     BECK\n</b>                         Luke may already be dead. And even \n                         if he's not, it's doubtful he's going \n                         to be able to transmit again. So we \n                         wouldn't know whether it's safe to \n                         land until you were almost there.\n\n<b>                                     PHIL\n</b>                         What about SIMA?\n\n               Terri looks at Phil -- SIMA?\n\n<b>                                     PHIL\n</b>                         The Saturn Imaging Probe. It's going \n                         to slingshot around Mars on its way \n                         through the solar system. It could \n                         be retasked to take pictures, read \n                         radiation levels at Mars One Base \n                         Camp.\n\n<b>                                     WOODY\n</b>                         Good idea Phil. If SIMA tells us \n                         Luke hasn't survived and it's not \n                         safe to land, we swing around Mars \n                         and come right back home.\n\n<b>                                     MCCONNELL\n</b>                         Yes. We can design the mission to \n                         have a free return capability. It's \n                         a long trip, but if you don't land \n                         it's the best option.\n\n<b>                                     BECK\n</b>                         We're getting ahead of ourselves. \n                         You're forgetting the bigger problem.\n                              (they look at him)\n                         The orbits are all wrong. Our first \n                         decent launch window is almost eight \n                         months from now.\n\n<b>                                     MCCONNELL\n</b>                         But we can go earlier and get there \n                         faster if we reconfigure the payload \n                         for extra fuel. We've modelled that, \n                         Ray. I've modelled it.\n\n<b>                                     BECK\n</b>                         On paper, yeah. But those stresses \n                         have never been tested in space.\n\n<b>                                     MCCONNELL\n</b>                         The ship can take it.\n\n<b>                                     BECK\n</b>                         I wasn't thinking of just the ship.\n\n               A tense beat. Again we sense the test of wills between these \n               two tough-minded men, once good friends.\n\n<b>                                     MCCONNELL\n</b>                         I know the protocols for a Mars \n                         Recovery Mission better than anybody, \n                         because I helped design them. And \n                         I'm saying these guys can do it.\n\n<b>                                     WOODY\n</b>                         He's right, Ray. We've got a real \n                         shot.\n\n               A pause with beck weighing the odds. He looks at Woody.\n\n<b>                                     BECK\n</b>                         Give me an updated mission plan by \n                         0800 tomorrow. Then I'll put it in \n                         the works.\n\n<b>                                     MCCONNELL\n</b>                         You'll have it by 0600.\n\n               He looks at Woody, Phil and Terri, who are just as eager.\n\n<b>                                     MCCONNELL\n</b>                         Let's get to work.\n\n               McConnell exits followed by Terri and Phil, but as Beck starts \n               out, too, Woody stops him.\n\n<b>                                     WOODY\n</b>                         Chief, could I have a word?\n\n               Beck looks at him a moment, nods.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. SPACE STATION. MMCR. DAY\n</b>\n               In a quiet corner, Woody and Beck are alone.\n\n<b>                                     WOODY\n</b>                         I've no longer got the right crew.\n\n<b>                                     BECK\n</b>                              (surprised)\n                         What do you mean? Bjornstrom can be \n                         up here on the next shuttle.\n\n<b>                                     WOODY\n</b>                         Bjornstrom is a geologist. He's good, \n                         but not for this. My people just \n                         lost eight months of training. This \n                         is a different mission, with a \n                         different objective.\n\n<b>                                     BECK\n</b>                         I haven't been given authorization \n                         for a mission yet.\n\n<b>                                     WOODY\n</b>                         But when you are, it ought to be \n                         given the best chance for success. I \n                         want McConnell to fly right seat.\n\n               Beck's expression hardens.\n\n<b>                                     BECK\n</b>                         He's no longer on mission status.\n\n<b>                                     WOODY\n</b>                         Yeah. Because you washed him out.\n\n<b>                                     BECK\n</b>                         He washed himself out. He only had \n                         to pass a few more psych evaluations, \n                         but he refused to take them.\n\n<b>                                     WOODY\n</b>                         Ray, he's the best pilot I ever saw, \n                         and you've got him benched at a desk.\n\n<b>                                     BECK\n</b>                         Everybody has to pass the psych \n                         prelims. No exceptions. Jim knew \n                         that.\n\n<b>                                     WOODY\n</b>                         Maggie was his wife. He didn't want \n                         to lie on a couch and share her with \n                         strangers.\n\n<b>                                     BECK\n</b>                         That was his call. But I had to make \n                         one too. It was tough as hell, but \n                         I'd do it again.\n\n<b>                                     WOODY\n</b>                         His wife wasted away in front of his \n                         eyes. What was he supposed to do? \n                         Suck it up? Get with the program? \n                         What was his crime? That he was upset? \n                         That he cried...?\n\n<b>                                     BECK\n</b>                         I couldn't trust him!\n\n               Beck and Woody stare at each other. A long tense beat.\n\n<b>                                     BECK\n</b>                              (his voice softer)\n                         Not in a crisis... I'm sorry Woody, \n                         but Jim lost his edge. Are you gonna \n                         stand there and tell me Jim McConnell \n                         is the same man he was two years \n                         ago? You want me to bet four more \n                         lives on that?\n\n               This stops Woody, just for a beat. Then makes him press on \n               harder, with even greater intensity.\n\n<b>                                     WOODY\n</b>                         When Maggie died, yeah, it knocked \n                         the shit out of him. It knocked the \n                         hell out of all of us. But you know \n                         and I know that he's still the best \n                         we've got. He and Maggie wrote the \n                         book on Mars. He's got more hours in \n                         the sims than the rest of us put \n                         together. Ray, we can do this. Give \n                         me McConnell as co-pilot, and we \n                         will bring Luke home. And that's a \n                         promise.\n\n               Beck looks back at him, his features taunt.\n\n<b>               INT. SPACE STATION. MMCR. DAY\n</b>\n               Woody, Terri, and Phil stand at the edge of the big control \n               room, waiting and watching, in a tense silence, as\n\n<b>               IN THE DISTANCE, FROM THEIR POV\n</b>\n               Beck and McConnell are huddled together at the CAPCOM's \n               console. Other personnel have moved away, giving them room. \n               Both men are seated, leaning forward, with McConnell listening \n               intently, while Beck does most of the talking, very quietly. \n               After a moment McConnell looks up in surprise. His eyes search \n               the room till they find\n\n<b>               WOODY'S FACE\n</b>\n               Woody looks back at him, nods: C'mon, man. Take it.\n\n<b>               MCCONNELL'S OWN FACE\n</b>\n               Is a study in conflicting emotions. But after a moment he \n               masters his feelings, turns back toward Beck. A few more \n               quiet words are exchanged, then Beck offers his hand. \n               McConnell hesitates, then shakes it. Both men rise, and \n               McConnell turns again to look towards\n\n<b>               WOODY, TERRI, AND PHIL\n</b>\n               Who react with relief, glad that he's now a part of their \n               crew. Woody grins, giving him a thumb's up.\n\n<b>               CLOSE ON MCCONNELL'S FACE\n</b>\n               As he smiles. Then he starts towards them, with a new energy \n               in his step, a new sense of confidence and purpose. And as \n               he WALKS TOWARDS US, PASSING OUT OF FRAME...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. DEEP SPACE. MARS RECOVERY. DAY\n</b>\n               An infinite canopy of stars. After a moment, some of them \n               begin to be BLOTTED OUT as\n\n<b>               A SPACESHIP\n</b>\n               Glides INTO VIEW. \"MARS RECOVERY\" (formerly Mars Two) looks \n               much like its sister craft on Mars: a conical cockpit mounted \n               above a \"tuna can\" crew Hab module.\n\n<b>               SUPER TITLE: \"MARS RECOVERY. MISSION DAY 172.\"\n</b>\n               The entire lower deck forms a segmented section of the hull \n               that rotates on bearings to provide artificial gravity; we \n               see window ports spinning past, then an American flag emblem.\n\n               Behind this lower deck, in an extending network of struts, \n               like the abdomen of a dragonfly, are the three huge round \n               PROPELLANT TANKS. Then vast, delicate-looking rectangular \n               SOLAR PANELS, which sweep out to either side of the ship; \n               these also bear the dish of the earth-pointing HI-GAIN \n               ANTENNA. And finally comes the great mass of the ENGINE BELLS, \n               housed within a curving AEROSHELL; three hatches in the \n               aeroshell can open to allow the main thrusters to fire through \n               for a mid-course burn.\n\n<b>               CAMERA DRIFTS CLOSER\n</b>\n               To the forward section of the ship, APPROACHING a viewport \n               in the EVA airlock chamber. Inside, we can see Phil leaning \n               forward, concentrating on some task...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. EVA AIRLOCK. DAY. A BUNCH OF M&amp;MS\n</b>\n               Are floating in mid-air, forming an intricate 3D pattern. In \n               the EVA airlock, it's zero G.\n\n               Phil, strapped into a chair by a galley counter, is just \n               completing this weightless puzzle by placing a final blue \n               M&amp;M. He looks bored, sluggish. In the b.g., Terri is hunched \n               over a microscope.\n\n               McConnell emerges from the core tunnel, behind them, coming \n               up from the lower Hab, then pushes off from the ladder, \n               floating towards Phil. He grins, admiring Phil's obsessive \n               handiwork.\n\n<b>                                     MCCONNELL\n</b>                         What's that?\n\n<b>                                     PHIL\n</b>                         That... is the exact chemical \n                         composition of my ideal woman.\n\n<b>                                     MCCONNELL\n</b>                         Used to be.\n\n               He plucks out a couple of the M&amp;Ms as he drifts by.\n\n<b>                                     PHIL\n</b>                         Hey!\n\n               McConnell grins, snacking on the M&amp;Ms.\n\n<b>                                     MCCONNELL\n</b>                         Now what is it?\n\n               Phil looks sadly at his floating model.\n\n<b>                                     PHIL\n</b>                         A frog.\n\n               McConnell and Terri laugh as Phil starts scarfing down the \n               rest of the M&amp;Ms. Swooping at them with both hands.\n\n<b>                                     TERRI\n</b>                         I guess now we have our answer to \n                         the effects of long-term \n                         interplanetary travel on the human \n                         mind. The answer is Phil.\n\n<b>                                     MCCONNELL\n</b>                              (smiles)\n                         I'm gonna get an update on SIMA. It \n                         should be just about close enough to \n                         start capturing some surface images.\n\n               He's drifted to another short ladder, and now grabs it, starts \n               up to the cockpit, atop the Hab.\n\n<b>               INT. COCKPIT. DAY\n</b>\n               As McConnell appears in the cockpit, he sees Woody by the \n               forward instrumentation panel, looking at a monitor. The \n               cockpit is also zero G.\n\n<b>                                     MCCONNELL\n</b>                         Hey, Skip.\n\n<b>                                     WOODY\n</b>                         Take a look.\n\n               McConnell pulls himself forward.\n\n<b>               ANGLE ON MONITOR\n</b>\n               MARS completely fills the screen. Surface details are clearly \n               visible. Something is moving down there, an amorphous brown \n               swirl.\n\n<b>               INT. COCKPIT. DAY\n</b>\n<b>                                     WOODY\n</b>                         What do you make of that?\n\n<b>                                     MCCONNELL\n</b>                         Dust storm. Southern hemisphere, \n                         coming from the east... Big fella, \n                         too.\n\n<b>                                     WOODY\n</b>                         Headed for Chryse Planitia.\n\n<b>                                     MCCONNELL\n</b>                         Yup. Could get a little hairy just \n                         about landing time...\n\n               McConnell pulls back from the screen, looks at Woody.\n\n<b>                                     WOODY\n</b>                         We'll have to be ready to move fast. \n                         Maybe even advance our ETA. Those \n                         things can cover the whole planet, \n                         and last up to a year.\n\n               A beat. They both hope he's wrong.\n\n<b>                                     MCCONNELL\n</b>                         When does SIMA do her fly-by?\n\n<b>                                     WOODY\n</b>                         Tomorrow morning, about 0600. That's \n                         when we find out whether we came all \n                         this way for nothing.\n\n               They exchange a glance. Woody's right, but the thought is \n               too terrible to dwell on. McConnell looks back at Mars.\n\n<b>                                     MCCONNELL\n</b>                              (softly)\n                         My money's on Luke.\n\n<b>               INT. MARS RECOVERY. EVA AIRLOCK. NEXT MORNING\n</b>\n<b>               CLOSE ON A DIGITAL CLOCK\n</b>\n               Just turning over to read \"0545.\"\n\n<b>               TERRI\n</b>\n               Pulls her gaze away from these numbers. Judging from her \n               redrimmed eyes, it's been a long, anxious night. Restlessly, \n               looking to distract herself, she reaches for a test tube of \n               blood, straps it into a centrifuge, sets it spinning. Nearby \n               is her electron microscope.\n\n<b>               MCCONNELL (LOWER HAB)\n</b>\n               Lies on his cot in his own cubicle, with the door closed. \n               The lower hab has artificial gravity (AG) and McConnell can \n               move normally. Hands behind his head, he stares at his bureau.\n\n<b>               PHOTO OF A WOMAN\n</b>\n               Rests there, in its leather travel frame. Beautiful, smiling, \n               dark-haired: MAGGIE MCCONNELL. Her face glows with \n               intelligence and energy.\n\n<b>               MCCONNELL\n</b>\n               Shifts his eyes. The clock on his bulkhead reads \"0546.\"\n\n<b>               PHIL (LOWER HAB)\n</b>\n               Stands in the communal bathroom, still in his pajamas, a \n               towel around his shoulders, brushing his teeth. He glances \n               at another digital clock, which reads \"0547.\" Shakes his \n               head impatiently. He looks back into the mirror, then is \n               surprised to hear MUSIC lilting incongruously over the \n               loudspeakers: Elvis Presley's \"Blue Moon.\"\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. EVA AIRLOCK. DAY\n</b>\n               Phil floats in through the connecting tunnel, then stops \n               himself at a handhold. He grins, charmed by the sight of\n\n<b>               WOODY AND TERRI DANCING\n</b>\n               Like a weightless Fred and Ginger. Woody is surprisingly \n               good at this. Enthusiastic, unselfconscious.\n\n               He sweeps Terri gallantly about the little cabin, pushing \n               off from every handy surface, even guiding her into some \n               passable twirls and dips. She laughs, shaking her head.\n\n<b>                                     PHIL\n</b>                         What brought this on?\n\n<b>                                     WOODY\n</b>                         Zero-G. My last chance to be graceful. \n                         Once we're in Mars gravity, it's \n                         back to shuffling my feet and grabbing \n                         her butt.\n\n<b>                                     TERRI\n</b>                         I'll take what I can get.\n\n               She grins, kisses his ear, as Phil turns, sees\n\n<b>               MCCONNELL\n</b>\n               Who has now arrived, is also watching the dancing couple. A \n               twinge of sadness crosses his features. But when his eyes \n               meet Phil's, he shakes off the feeling and manages a smile: \n               Aren't they something?\n\n               Over the music, they hear a CHIRP from the SHIP'S COMPUTER, \n               then an announcement.\n\n<b>                                     COMPUTER\n</b>                         Attention. Incoming packet.\n\n               They all look at each other. This is it! Woody spins over to \n               a console, shuts off the music.\n\n<b>                                     MCCONNELL\n</b>                         It's SIMA.\n\n<b>               INT. COCKPIT. DAY. MINUTES LATER\n</b>\n               The crew is gathered around a display screen. The lights are \n               dim, reflecting up off their faces. By their expressions, we \n               can tell the news is not good.\n\n<b>               CLOSE ON THE SCREEN\n</b>\n               It's a color, high-resolution satellite image of the Mars \n               One Base Camp. Ghostly, dust-covered. No signs of life.\n\n<b>                                     WOODY\n</b>                         Looks deserted.\n\n<b>                                     PHIL\n</b>                         It's still standing, though. So is \n                         the ERV. And look, there's the \n                         greenhouse.\n\n<b>                                     MCCONNELL\n</b>                         We know Luke survived for at least a \n                         few hours. Question is, are there \n                         any signs of recent activity?\n\n               They all scan the screen. Phil spots something.\n\n<b>                                     PHIL\n</b>                         There.\n\n               He grabs a stylus and touches the screen. They all look. \n<b>               CLOSE ON THE SCREEN\n</b>\n               Using where the stylus touches the screen as the focal point, \n               the image enlarges. THREE LONGISH DIRT PILES appear, some \n               fifty meters from the hab.\n\n<b>                                     PHIL\n</b>                         What the hell are those?\n\n               McConnell gets it first.\n\n<b>                                     MCCONNELL\n</b>                         Graves.\n\n               They all realize he's right. They sit back, stunned. But \n               then Phil has another thought.\n\n<b>                                     PHIL\n</b>                         Hold on. There's only three. That \n                         means --\n\n<b>                                     TERRI\n</b>                         Phil --\n\n<b>                                     PHIL\n</b>                         It means Luke must still be --\n\n<b>                                     TERRI\n</b>                         No. It just means there was nobody \n                         left to bury him.\n\n               This quiets everyone for a long moment.\n\n<b>                                     WOODY\n</b>                         Check the radiation levels.\n\n               Phil keys in some commands and data pops up onscreen.\n\n<b>                                     PHIL\n</b>                         Normal.\n\n<b>                                     WOODY\n</b>                         Go to the disaster site.\n\n               Phil uses the stylus to bring MORE IMAGES into view. The \n               frame moves over the terrain in the direction of the Face, \n               first in SWIFT BLURS, then slowing. Scattered rock debris \n               come into view. The IMAGE ARRIVES where the mountain was, \n               and they see...\n\n               Debris in every direction, NEAT SPIRALS of it now, dropped \n               uncannily into place, like some massive earth sculpture. As \n               if - but this makes no sense -- it had been swirled towards \n               a LARGE CRATER. The crater itself is a perfect circle. They \n               FOCUS on the CENTER OF THE CRATER, but the image gets \n               distorted by STATIC.\n\n<b>                                     MCCONNELL\n</b>                         What's wrong?\n\n<b>                                     PHIL\n</b>                         I don't know. Magnetic interference?\n\n               Phil tweaks the stylus, but the image won't clear up.\n\n<b>                                     WOODY\n</b>                         Go to infrared.\n\n               Phil works the keyboard.\n\n<b>               THE SCREEN\n</b>\n               Goes to INFRARED, reading heat, The middle of the IMAGE, \n               where the Face is, is still distorted, refusing focus.\n\n<b>               THE ASTRONAUTS\n</b>\n               Sit back, exasperated.\n\n<b>                                     PHIL\n</b>                         Must be a problem with SIMA. I don't \n                         see how an earthquake, six months \n                         ago, could give us this kind of \n                         distortion.\n\n<b>                                     MCCONNELL\n</b>                         That was no quake.\n\n               He leans closer, staring intently.\n\n<b>                                     WOODY\n</b>                         Then what the hell was it?\n\n               McConnell shakes his head. But his every sense is engaged; \n               he's like a predator just sighting his prey for the first \n               time. We see in his eyes an utter determination to unlock \n               this secret.\n\n<b>               EXT. SPACE. DAY\n</b>\n               Mars Recovery is speeding ever closer to Mars, which now \n               looms large, a dusty red mysterious sphere.\n\n<b>               INT. MARS RECOVERY. LOWER HAB. DAY\n</b>\n               McConnell and crew are eating dinner while they watch a taped \n               message from MMCR.\n\n<b>               CLOSE ON MONITOR SCREEN\n</b>\n               As Ray Beck addresses them. Other NASA STAFFERS, twenty or \n               more, have crowded in behind him, and we sense their great \n               hopefulness and high spirits; the whole team's triumph is \n               tantalizingly close now.\n\n<b>                                     BECK\n</b>                         We're going to continue analyzing \n                         this data and try to determine what \n                         the problem is with those images. \n                         Frankly, we're just as stumped as \n                         you guys, but we'll keep on it.\n                              (glancing around)\n                         We agree that the evidence of the \n                         graves is inconclusive and that a \n                         ground search is advisable. Be aware \n                         there are little sand storms kicking \n                         up near Mars One Base, but the big \n                         one you spotted is turning south. It \n                         shouldn't be a factor.\n\n               Beck takes a breath, smiles.\n\n<b>                                     BECK\n</b>                         We're all pretty excited here and \n                         we're sure you must be feeling the \n                         same. Enjoy your meal and get a good \n                         night's sleep. We anticipate that \n                         tomorrow morning you will be Go for \n                         Mars Orbital Insertion.\n\n<b>               INT. MARS RECOVERY. LOWER HAB. DAY\n</b>\n               WHOOPS OF JOY from McConnell's crew. Woody and Terri high \n               five each other.\n\n<b>                                     BECK\n</b>                         God bless you and goodnight. End of \n                         transmission.\n\n               The monitor screen GOES BLACK.\n\n<b>               INT. MARS RECOVERY. LOWER HAB. NIGHT\n</b>\n               The lighting is subdued for a sleep period, but everyone's \n               too restless. There's a low HUM of equipment.\n\n<b>               INT. EVA AIRLOCK. NIGHT\n</b>\n               Terri and Phil are playing computer Monopoly under a single \n               light. Terri is using touch-screen technology to move her \n               piece. She glances at Phil. He has spread some M&amp;Ms out, \n               letting them drift in mid-air as he performs his ritual \n               weeding out of the red ones. She shakes her head.\n\n<b>                                     TERRI\n</b>                         What if you opened up your meal packs \n                         and found that, instead of putting \n                         in everything but red ones, they'd \n                         made a mistake and put in only red \n                         ones?\n\n<b>                                     PHIL\n</b>                         Hey, that's a funny notion. And what \n                         if in your meal packs, instead of \n                         brown rice, there were spring-loaded \n                         spikes that shot into your eyes?\n\n<b>                                     TERRI\n</b>                              (pause)\n                         How did you ever pass the psych \n                         evaluation?\n\n<b>                                     PHIL\n</b>                         When you're schizophrenic, they take \n                         the higher score.\n\n               He touches the screen to roll the dice.\n\n<b>               INT. MARS RECOVERY. LOWER HAB. NIGHT\n</b>\n               McConnell, in his cubicle, looks away from the photo of \n               Maggie. Haunted by memories. He rises, flips through the CDs \n               in a storage case, pulls one out. He holds this carefully, \n               hesitating, then feeds it into his computer. Immediately his \n               screen saver vanishes and we see\n\n<b>               HOME VIDEO OF A PARTY\n</b>\n               An impromptu celebration, a bunch of friends gathered in a \n               semi-darkened living room. The footage is HANDHELD, a bit \n               jerky. People have paper plates of food, beers in hand, \n               everyone is a little tipsy. Debra is there, Terri, Phil, \n               Cote, Kirov, others. They're watching a STILL PHOTO SEQUENCE, \n               shown on a large screen TV, with commentary by Luke and Woody.\n\n<b>               THE FIRST PHOTO\n</b>\n               Is of a small boy (YOUNG MCCONNELL) in his pajamas, kneeling \n               in front of a Christmas tree. He's grinning ecstatically as \n               he holds up a brand new model rocket.\n\n<b>                                     LUKE\n</b>                         Jim's first ship was seriously \n                         underpowered...\n\n               LAUGHTER at this. Some AD LIB CRACKS about the painfully bad \n               haircut and the pajamas.\n\n<b>               THE SECOND PHOTO\n</b>\n               Is of a gawky-looking teenage girl (YOUNG MAGGIE), standing \n               on a porch at night, posing a bit self-consciously by a \n               telescope on its tripod.\n\n<b>                                     WOODY\n</b>                         Maggie was always starstruck...\n\n               More LAUGHTER, plus some digs about the nerdy eyeglasses and \n               braces. VIDEOCAMERA swings around the room, REVEALING the \n               adult JIM and MAGGIE. They sit side by side on the hearth, \n               leaning into each other, looking very happy.\n\n<b>                                     MAGGIE\n</b>                         I'll get you guys for this.\n\n               More LAUGHTER. Everyone's having a great time. The VIDEOCAMERA \n               swings back towards the TV screen as\n\n<b>               THIRD PHOTO APPEARS\n</b>\n               Jim and Maggie, young adults, standing on the wing of a \n               fighter jet. Both in Air Force flight suits, helmets in hand. \n               Suntanned, cocky, flashing radiant smiles.\n\n<b>                                     LUKE\n</b>                         When they met at the Air Force \n                         Academy, it was \"love at first \n                         flight.\"\n\n               GROANS and LAUGHTER from the offscreen watchers.\n\n<b>                                     WOODY\n</b>                         After that, NASA training was tough. \n                         All Jim could think about was \n                         exploring a heavenly body. More ribald \n                         LAUGHTER, as\n\n<b>               FOURTH PHOTO APPEARS\n</b>\n               Maggie and Jim, tethered together, floating weightlessly in \n               space suits.\n\n<b>                                     LUKE\n</b>                         But Maggie, as you can see, kept him \n                         on a short leash. Until...\n\n<b>               A FIFTH PHOTO\n</b>\n               Shows McConnell, in a dress uniform, leaning in to kiss \n               Maggie, who wears a white bridal gown.\n\n<b>                                     WOODY\n</b>                         Mission accomplished!\n\n<b>               ANGLE ON MCCONNELL, IN THE PRESENT\n</b>\n               As he smiles at this, hearing the renewed LAUGHTER and CHEERS, \n               the AD-LIBBED DIGS from the video. He becomes aware he's not \n               alone. He looks up.\n\n<b>               WOODY\n</b>\n               Stands in the doorway of his cubicle. Their eyes meet. They \n               both smile, turning back to the video. Remembering.\n\n<b>               IN THE VIDEO\n</b>\n               Luke and Woody have stepped forward, INTO SHOT, standing at \n               the sides of the TV, where the last photo lingers. Luke waves \n               his hands, hushing everybody.\n\n<b>                                     LUKE\n</b>                         Today we celebrate a new chapter in \n                         their story. And guys, it's a pretty \n                         historic one.\n\n               Both men raise champagne flutes.\n\n<b>                                     WOODY\n</b>                         Let's hear it for the newly-announced \n                         Captain and Co-Captain of Mars One. \n                         To Jim and Maggie!\n\n               CHEERS at this, repeats of \"Jim and Maggie!\" Luke grins, \n               giving a little signal, and we see\n\n<b>               A FINAL PHOTO\n</b>\n               Of Maggie in Jim's arms, both of them in goofy tropical \n               vacation wear, smiling. Evidently a photo taken in the surf \n               somewhere, but here it's been crudely superimposed onto a \n               Martian landscape. Laughter greets this unlikely image.\n\n<b>                                     LUKE\n</b>                         When you guys land, it'll prove once \n                         and for all there's no intelligent \n                         life on Mars.\n\n               More hoots of LAUGHTER, CATCALLS, but Maggie jumps in to \n               protest, as the VIDEOCAMERA SWINGS TO HER AND JIM. Terri \n               sits nearby.\n\n<b>                                     MAGGIE\n</b>                         Hey, c'mon, what if I'm right?\n\n<b>                                     ASSORTED VOICES\n</b>                         Oh no, here we go! Don't get her \n                         started! Somebody put on some music!\n\n<b>                                     MAGGIE\n</b>                         It's our sister planet!\n\n<b>                                     PHIL\n</b>                         Oh brother!\n\n               LAUGHTER at this, and Maggie joins in. She's a good sport.\n\n<b>                                     TERRI\n</b>                         Maggie, why does this have to be \n                         about us? Mars is a great opportunity \n                         for pure science.\n\n<b>                                     MAGGIE\n</b>                         We'll do the science. And we'll do \n                         it very well. That's what we've \n                         trained for. But what if there's \n                         more...? In all our myths, in every \n                         human culture, Mars has always held \n                         a special attraction. What if that \n                         means something? Only we don't \n                         understand it yet...\n\n               The mood of the party is changing, as everyone is caught up \n               in Maggie's spell. She has a radiant simplicity. The VIDEO \n               CAMERA DRIFTS IN ON HER; we are caught up, too.\n\n<b>                                     MAGGIE\n</b>                         The universe is not chaos. It's \n                         connection. Life reaches out for \n                         life...\n\n               She looks at McConnell, smiles. He takes her hand.\n\n<b>                                     MAGGIE\n</b>                         This is what we were born for, isn't \n                         it? To stand on a new world, and \n                         look beyond it to the next one. It's \n                         who we are.\n\n               A silence; the guests are enchanted by the purity of her \n               passion. She smiles, suddenly self-conscious. She hadn't \n               meant to get so carried away.\n\n<b>               IN THE PRESENT - MCCONNELL\n</b>\n               Reaches out, gently taps the keyboard, FREEZING the screen. \n               He and Woody, their eyes shining, stare at her image. A beat.\n\n<b>                                     WOODY\n</b>                         You okay?\n\n<b>                                     MCCONNELL\n</b>                         Yeah. I'm good to go.\n\n               Woody glances at him. It's true. Rather than being saddened, \n               McConnell seems to have taken on new strength. A renewed \n               sense of wonder.\n\n<b>                                     MCCONNELL\n</b>                         After all these years... Can you \n                         believe it? Tomorrow we'll be standing \n                         on Mars.\n\n               Woody nods, smiles.\n\n<b>                                     WOODY\n</b>                         You know what? She may have been \n                         right.\n\n               McConnell looks at him.\n\n<b>                                     WOODY\n</b>                         If that wasn't a quake down there, \n                         then something else caused it. Or \n                         planned it... You're thinking the \n                         same thing.\n\n<b>                                     MCCONNELL\n</b>                         It's never been out of my mind.\n\n<b>                                     WOODY\n</b>                         Jesus. You realize what this means?\n\n               McConnell nods. Looks again at Maggie's face on the screen.\n\n<b>                                     MCCONNELL\n</b>                         She knew, Woody. She was the only \n                         one of us that ever thought there \n                         might be something down there.\n\n<b>                                     WOODY\n</b>                         Yeah, and we're not leaving until we \n                         find out... Deal?\n\n               McConnell nods. They clasp hands briefly. Deal. Then Woody \n               turns. Before leaving, he hesitates just a moment, turning \n               back. One last thought, and he doesn't know he's going to \n               say it until it comes out.\n\n<b>                                     WOODY\n</b>                         Maggie was the best of us.\n\n               McConnell looks at him, silent but grateful. Woody goes. \n               McConnell turns back, looking at her smiling face, frozen on \n               the screen.\n\n<b>               INT. COCKPIT. NIGHT\n</b>\n<b>               MARS LOOMS AHEAD OF US.\n</b>\n               As seen through the cockpit windows. Huge, beautiful, MUCH \n               CLOSER now. We can make out swirling pink clouds, large \n               surface features. It's just before Martian dawn, the next \n               morning.\n\n<b>                                     MCCONNELL\n</b>                         Range 6783 and closing. 35 minutes \n                         till Mars Orbital Capture.\n\n<b>                                     WOODY\n</b>                         Okay, people let's look sharp. If we \n                         overshoot, there's no coming back.\n\n<b>                                     PHIL (O.S.)\n</b>                         Yeah, and drifting through eternity \n                         will ruin your whole day.\n\n               In the cockpit, Woody and McConnell are in the pilot and co-\n               pilot's wearing space suits but not yet helmets. AS CAMERA \n               PULLS BACK AND AWAY, we see them making instrument adjustments \n               in preparation for MOI.\n\n<b>                                     TERRI (O.S.)\n</b>                         Delta V systems initialized.\n\n<b>                                     WOODY\n</b>                         Charge primary APU.\n\n<b>                                     TERRI (O.S.)\n</b>                         Engaged. Charged.\n\n<b>                                     WOODY\n</b>                         Select HPU fuel cells for run.\n\n<b>                                     TERRI (O.S.)\n</b>                         Engaged.\n\n<b>                                     MCCONNELL\n</b>                         Tie main bus to systems.\n\n<b>                                     PHIL (O.S.)\n</b>                         Power ready.\n\n<b>                                     MCCONNELL\n</b>                         Select H2/O2 HPU and fuel cells for \n                         open.\n\n<b>                                     PHIL (O.S.)\n</b>                         H2/O2 control valves open.\n\n<b>               CAMERA TURNS, PUSHING DOWN INTO...\n</b>\n<b>               INT. EVA AIRLOCK. NIGHT\n</b>\n               ...Where Phil and Terri sit side by side at a pair of \n               computers, relaying cockpit commands to the systems.\n\n<b>                                     WOODY (O.S.)\n</b>                         Charge flow.\n\n<b>                                     TERRI\n</b>                         Charged and on-line\n\n<b>                                     WOODY (O.S.)\n</b>                         Reset PW.\n\n<b>                                     TERRI\n</b>                         Set\n\n<b>                                     MCCONNELL\n</b>                         Transfer protocol data from EVA \n                         station.\n\n<b>                                     PHIL\n</b>                         Transferred. Awaiting track \n                         confirmation.\n\n               There's a sudden LOUD, BRITTLE POP from somewhere overhead, \n               and Phil's gloved hand, hovering over a computer screen, is \n               punctured through and through. The screen itself is holed \n               and spiderwebbed with a loud CRACK!\n\n<b>                                     PHIL\n</b>                         Uhhh!\n\n<b>               PHIL HOLDS UP HIS HAND\n</b>\n               As he and Terri stare at it, dumbfounded. Thick droplets of \n               blood leak out and begin to swirl away, sucked up towards \n               the venting puncture in the hull over head. The astronauts' \n               helmets dangle up there, awaiting use.\n\n<b>                                     TERRI\n</b>                         What in God's --\n\n               Suddenly we hear HIGH PITCHED ALARMS SOUNDING, then the \n               PINGING OF MORE TINY MISSILES, slashing across the ship's \n               outer skin.\n\n<b>               WOODY AND MCCONNELL\n</b>\n               Are staring back from the cockpit, reacting in astonishment \n               to Phil's drifting blood and to the alarms. Then Woody \n               suddenly understands.\n\n<b>                                     WOODY\n</b>                         Micrometeoroids\n\n<b>                                     MCCONNELL\n</b>                              (scanning sensors)\n                         Breach hits in the hull!\n\n<b>               ANGLES ON TERRI AND PHIL\n</b>\n               As she seizes his wounded hand, tries to stop the bleeding. \n               He's staring at a gauge.\n\n<b>                                     PHIL\n</b>                         Outgassing! Losing pressure!\n\n<b>                                     TERRI\n</b>                         Woody, seal the breech!\n\n<b>               ANGLE ON WOODY\n</b>\n               As he unbuckles, dives from the cockpit back down into the \n               EVA, and floats quickly over to a storage hatch. He yanks \n               this open pulling out a\n\n<b>               PATCH GUN\n</b>\n               Then spins around in zero-G, as his eyes track\n\n<b>               THE RISING DROPLETS OF BLOOD\n</b>\n               Which give a telltale hint of the puncture's location, \n               somewhere up among the dangling helmets on the \"ceiling.\"\n\n<b>               WOODY PUSHES OFF\n</b>\n               Rising to this area, and shoves aside a helmet with a \n               shattered faceplate -- its label reads \"MCCONNELL\" -- to \n               REVEAL A BREECH IN THE HULL. Jagged metal edges, dangling \n               insulation. The blood droplets are whirling out through here, \n               going into the vacuum of space.\n\n               Quickly Woody stuffs the muzzle of the patch gun into the \n               puncture, firing a thick grey sealant. We hear MORE PINGS, \n               ECHOING LOUDLY, but after a few seconds they DIMINISH, then \n               abruptly STOP. The KLAXONS continue to wail.\n\n<b>                                     WOODY\n</b>                         Kill those alarms!\n\n               McConnell punches buttons, MUTING THE ALARMS, and they all \n               strain to listen, faces tense and sweating. A long beat. But \n               the meteor shower has passed by, as abruptly as it appeared. \n               The astronauts turn, becoming aware of a strange phenomenon.\n\n<b>               PHIL'S BLOOD DROPLETS\n</b>\n               Have stopped in place, wobbling eerily as perfect spheres in \n               the zero-G. Then suddenly they start moving again, faster \n               and faster, in a new direction. Down through the open core \n               tunnel that leads to the lower Hab.\n\n<b>               MCCONNELL\n</b>\n               Stares at a gauge that confirms what's happening.\n\n<b>                                     MCCONNELL\n</b>                         Still outgassing in the lower Hab! \n                         There must be another hole down there, \n                         even bigger.\n\n<b>                                     PHIL\n</b>                         Losing pressure fast! We're gonna \n                         decompress!\n\n<b>                                     WOODY\n</b>                         Computer, how long until zero \n                         atmosphere?\n\n<b>                                     COMPUTER\n</b>                              (after a beat)\n                         Four minutes, nine seconds.\n\n<b>                                     PHIL\n</b>                         If we get below 20% atmosphere, the \n                         power will shut down!\n\n<b>                                     TERRI\n</b>                         Are you sure?\n\n<b>                                     PHIL\n</b>                         Positive! A vacuum inside the ship \n                         would cause a total electrical \n                         failure. The nav computers will fry!\n\n<b>                                     MCCONNELL\n</b>                              (to Woody)\n                         We'll lose all control. We won't be \n                         able to fire the engines to capture \n                         Mars orbit.\n\n               Just then a computer screen flickers, freezes. Phil punches \n               keys with his good hand. What he sees shocks him.\n\n<b>                                     PHIL\n</b>                         It's already starting. The primary L-\n                         1 hub has been smashed. The systems \n                         are crashing.\n\n               Woody looks back at his crew, struggling to project more \n               calm than he really feels.\n\n<b>                                     WOODY\n</b>                         Everybody switch to suit oxygen. We \n                         beat this in the simulator, we can \n                         do it here. Jim, you've got the ship. \n                         I'm going EVA.\n\n               They stare at him, stunned by their immense task.\n\n<b>                                     WOODY\n</b>                         C'mon, people, let's go! Let's work \n                         the problem!\n\n<b>               INT. EVA AIRLOCK. MOMENTS LATER\n</b>\n               Terri, now helmeted, is putting Woody's helmet on him, but \n               something's in the way, chafing his neck. He reaches into \n               his suit, pulls out...\n\n<b>               THE CHAIN\n</b>\n               From around his neck, with his little Flash Gordon rocketship \n               dangling.\n\n<b>               WOODY HANDS THIS TO TERRI\n</b>\n               As they share a brief, loving glance, but there's no time \n               for words. She tightens his helmet ring, and he brushes his \n               gloved fingertips on her faceplate. Then he hurries towards \n               the inner hatch door, where McConnell is throwing airlock \n               switches. Woody and McConnell exchange a look.\n\n               At the EVA computer panel, Phil is shutting down non-essential \n               power drains, trying to get the main computer system back on \n               line. His wounded hand makes this difficult and painful.\n\n<b>                                     PHIL\n</b>                         Jesus, it's still bleeding.\n\n<b>                                     TERRI\n</b>                         Keep the pressure on!\n\n<b>                                     COMPUTER\n</b>                         Eighty percent atmosphere...\n\n<b>               INT./EXT. AIRLOCK. NIGHT\n</b>\n               The outer airlock door is now open, revealing stars, as Woody \n               drifts through it into space. He's now wearing the MMU, an \n               oversized jet pack like the ones used by the shuttle \n               astronauts.\n\n<b>               INT. EVA ROOM. NIGHT\n</b>\n<b>               MCCONNELL'S HELMET.\n</b>\n               With its shattered faceplate -- now useless -- drifts past \n               Terri as she is wrapping med tape around gauze pads on Phil's \n               glove.\n\n<b>               MCCONNELL\n</b>\n               Floats up to them, checking on Phil's work at the computer.\n\n<b>                                     TERRI\n</b>                         Jim, you've gotta get your spare \n                         helmet from storage.\n\n<b>                                     MCCONNELL\n</b>                         No time. Phil, can you keep the nav \n                         computers on-line?\n\n<b>                                     PHIL\n</b>                         I can't get this damn machine to re-\n                         initialize! And the automated systems \n                         just went down. We can't shut down \n                         the hab rotation from here.\n\n<b>                                     MCCONNELL\n</b>                         I'll do it from below.\n\n<b>                                     TERRI\n</b>                         We're losing pressure. You could \n                         embolize.\n\n<b>                                     COMPUTER\n</b>                         Seventy percent atmosphere...\n\n               McConnell looks at her, knows she's right. But he starts off \n               anyway. Phil reaches out his good hand.\n\n<b>                                     PHIL\n</b>                         Jim, I've got an idea. If you guys \n                         can save enough atmosphere, I'll \n                         disconnect the power in the main \n                         computer bay, then jump start the \n                         systems. I'll do a hard boot.\n\n               This is a radical, incredibly risky notion. McConnell stares \n               hard at Phil. So does Terri.\n\n<b>                                     MCCONNELL\n</b>                         Has that ever been tested?\n\n<b>                                     PHIL\n</b>                         Are you kidding? These machines are \n                         much too valuable.\n\n               McConnell looks from Terri to Phil. It's life and death.\n\n<b>                                     MCCONNELL\n</b>                         Do it.\n\n               Then he turns, and the CAMERA FOLLOWS MCCONNELL as he pushes \n               away from the console and dives down into the core tunnel, \n               heading towards the\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. LOWER HAB\n</b>\n               ...where he emerges from the core into the rotating Hab deck, \n               and pushes himself down a ladder toward the floor. He \n               accelerates as he gets closer to the floor, then rights \n               himself with a twist and lands on his feet -- now in gravity.\n\n<b>               EXT. MARS RECOVERY. NIGHT\n</b>\n               Woody, in the MMU, is hovering over the lower segment of the \n               Hab hull, and right away we see his problem. He can't reach \n               the damaged spot because it's spinning past him, spewing \n               vapor.\n\n<b>                                     WOODY\n</b>                              (over radio)\n                         Jim, how we doin' on the AG?\n\n<b>               INT. LOWER HAB. NIGHT\n</b>\n               McConnell runs to a computer terminal and starts clicking \n               with the mouse.\n\n<b>                                     MCCONNELL\n</b>                         Just one goddamn second. Come on, \n                         c'mon...\n\n<b>                                     COMPUTER\n</b>                         Voice print identification.\n\n<b>                                     MCCONNELL\n</b>                         McConnell!\n\n<b>                                     COMPUTER\n</b>                              (a beat)\n                         Accepted. Shutting down artificial \n                         gravitational rotation.\n\n               McConnell hears a sound up at the core tunnel. He turns, \n               it's Terri. She holds an small 0-2 cannister, marked with a \n               red cross.\n\n<b>                                     MCCONNELL\n</b>                         Hang on!\n\n               McConnell grabs onto a counter edge as...\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               Attitude control thrusters on the hull begin firing in pulses. \n               The rotation of the lower Hab deck immediately starts to \n               slow down. The great red ball of Mars drifts by.\n\n<b>               INT. CORE TUNNEL. NIGHT\n</b>\n               Terri, lurching, grabs a ladder strut, and watches from the \n               tunnel as...\n\n<b>               MCCONNELL\n</b>\n               Is also jarred by the firing of the thrusters. The rotation \n               slows until the Hab is still. Zero-G. McConnell floats. He \n               and Terri can hear the terrifying sound of air whistling out \n               into space through the breach hole.\n\n<b>                                     COMPUTER\n</b>                         Sixty per cent atmosphere...\n\n<b>                                     WOODY (V.O.)\n</b>                         Get some light on the hole so I can \n                         locate it.\n\n<b>                                     MCCONNELL\n</b>                         I've got a better idea.\n                              (shouts to Terri)\n                         Stay there!\n\n               He starts rooting through Phil's storage area -- bags of \n               M&amp;Ms, comic books -- looking for what he needs.\n\n<b>               INT. COCKPIT. NIGHT\n</b>\n               Phil is now strapped into the pilot's seat. He's scared, \n               sweating hard, but concentrating fiercely as his one good \n               hand works a battery-powered screwdriver.\n\n               He's removing the panel of the main computer bay. Over the \n               intercom, he can hear the merciless struggle going on \n               elsewhere.\n\n<b>                                     WOODY (V.O.)\n</b>                         I'm topside, Jim, do you know which \n                         sector?\n\n<b>                                     MCCONNELL (V.O.)\n</b>                         I'm workin' on it!\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               The lower Hab deck is no longer revolving. Woody pops his \n               thrusters and drifts over the metallic skin. But there's \n               such a vast area to search!\n\n<b>                                     WOODY\n</b>                         Jesus, uh, OK, this is gonna be like \n                         searching for a needle in a haystack.\n\n<b>               INT. LOWER HAB NIGHT\n</b>\n               McConnell locates a can of Dr. Pepper, shakes this violently, \n               then tosses it up to Terri, who's still in the tunnel mouth. \n               She catches the drifting can, confused. When McConnell speaks \n               again, he's gasping for air.\n\n<b>                                     MCCONNELL\n</b>                         Shake out the liquid.\n\n<b>                                     TERRI\n</b>                         Jim, I don't --\n\n<b>                                     MCCONNELL\n</b>                         Shake it out near the hull!\n\n               Terri shakes out soda from the open can. She and McConnell \n               watch the brown stream of fluid swirl up into the air, caught \n               by escaping oxygen. It rises towards the \"ceiling\" of the \n               outer hull, like a miniature tornado.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               Woody still drifts over the hull, searching intently as his \n               frustration builds.\n\n<b>                                     WOODY\n</b>                         C'mon, c'mon, where are you...?\n\n<b>                                     COMPUTER (V.O.)\n</b>                         Fifty per cent atmosphere...\n\n<b>               INT. LOWER HAB. NIGHT\n</b>\n               Terri, staring at the ceiling, sees something remarkable.\n\n<b>               THE SODA STREAM\n</b>\n               Swirling ever tighter, has formed a whirlpool that's now \n               being sucked out through the breach hole in the hull. She \n               can now see the ugly puncture for the first time.\n\n<b>                                     MCCONNELL\n</b>                              (gasping)\n                         Woody, the breech is in sector four! \n                         Sector four, copy that?\n\n<b>                                     WOODY (V.O.)\n</b>                         Copy, I' heading there now.\n\n               Terri turns, excited by McConnell's triumph; she's just in \n               time to see him collapse to the floor below her, as he starts \n               to lose consciousness. He's deathly pale.\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               Woody spots a tiny geyser of brownish ice crystals spouting \n               out of the hull of the lower Hab. It's some distance away \n               from him, but clearly visible.\n\n<b>                                     WOODY\n</b>                              (to himself, marveling)\n                         Sonofabitch. You never did that in \n                         the simulator.\n\n<b>               INT. LOWER HAB. NIGHT\n</b>\n               Terri pushes off from the ladder, drifting weightlessly down \n               to McConnell. She opens the valve of the oxygen cannister, \n               pushing the plastic mask over McConnell's face. He sucks in \n               air, color returning to his skin as he revives.\n\n<b>               INT. COCKPIT. NIGHT\n</b>\n<b>               CLOSE ON THE COMPUTER'S GUTS.\n</b>\n               An incredible tangle of tubes, wires, chips, as Phil's gloved \n               fingers -- both hands now -- probe desperately through them.\n\n<b>                                     PHIL\n</b>                         Where are you, you little bastard, \n                         where are you...?\n\n<b>               PHIL WINCES WITH PAIN.\n</b>\n               As he moves his hands and forearms deep inside the computer \n               bay. Around him, several of the smaller screens and gauges \n               are starting to malfunction, the data streams breaking apart, \n               streaking into electronic snow. He shoots a tense glance at\n\n<b>               THE NAVIGATIONAL MONITOR\n</b>\n               Which is flickering crazily. It shows the ship moving much \n               closer to its critical MOI point, indicated by a flashing \n               red triangle aimed down at the Martian surface.\n\n<b>                                     COMPUTER\n</b>                         Forty percent atmosphere...\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               Woody, popping his thrusters, moves as fast as he can towards \n               the protruding finger of crystal, but he's not there yet.\n\n               All of a sudden Woody's thrusters cut out. The ship is moving \n               by, a meter beneath him. Woody punches his arm controls. \n               Nothing.\n\n               Then just as the outer edge of the hab starts to pass him, \n               the thrusters kick back in. Woody grabs the edge, starts to \n               move to the hole. Woody lets out a breath.\n\n<b>                                     WOODY\n</b>                              (to himself)\n                         Whoa.\n\n<b>               INT. LOWER HAB. NIGHT\n</b>\n               McConnell, holding his breath, grabs a patch gun from a \n               storage locker. Terri's still got the 0-2 cannister. He nods \n               to her, and together they push off from the floor, leaping \n               weightlessly up to the other side of the Hab, the \"ceiling.\" \n               They reach the gaping puncture, which they now see has been \n               only partially dammed by the soda ice.\n\n<b>               INT. COCKPIT. NIGHT\n</b>\n<b>               VERY CLOSE ON THE COMPUTER'S INTERIOR\n</b>\n               As Phil's gloved fingers finally locate the plug he's been \n               searching for. He hopes. And grip it firmly.\n\n<b>                                     PHIL\n</b>                         Gotcha!\n\n<b>               PHIL TAKES A DEEP BREATH.\n</b>\n               Says a silent prayer. Then he yanks the plug. SHRILL WHINES, \n               ELECTRONIC CRACKLES from all around him, as the systems are \n               abruptly shut down, in a way they were never meant to be \n               mishandled. Terrifyingly, a couple of the monitors arc to \n               each other as they die. Dodging sparks, Phil stares at\n\n<b>               THE NAVIGATIONAL MONITOR\n</b>\n               As it also flickers and dies. Now they're flying blind.\n\n<b>                                     COMPUTER\n</b>                         Thirty percent atmosphere...\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               Woody arrives at the ice finger, knocks away the big crystal, \n               then pulls his patch equipment from a pouch.\n\n<b>               INT. LOWER HAB. NIGHT\n</b>\n               In the Hab, Terri uses the base of the 0-2 cannister to smash \n               away the interior ice chunk, then McConnell, who's getting \n               wobbly again, blasts the hole with the epoxy gun. As he works, \n               Terri gives him another hit of air.\n\n<b>                                     COMPUTER\n</b>                         Twenty percent atmosphere...\n\n               The lights flicker out in the Hab.\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               Outside, Woody slaps a big square patch over the hole, rips \n               off the backing.\n\n<b>               CLOSE ON THE PATCH\n</b>\n               As it changes color and shrinks, drawing itself down into \n               the metal of the hull.\n\n<b>               INT. COCKPIT. NIGHT\n</b>\n<b>               VERY CLOSE ON THE COMPUTER'S INTERIOR.\n</b>\n               As Phil's fingers re-connect the same plug.\n\n<b>               PHIL PULLS HIS HAND OUT\n</b>\n               From inside the computer bay. He's trembling, sweat-streaked \n               inside his faceplate. Blood has soaked through his gauze \n               pads. His good hand hovers over the red main power switch. \n               The moment of truth.\n\n<b>                                     PHIL\n</b>                         OK... OK now...\n\n               With a dramatic click, he throws the switch, hard-booting \n               the computer system back on. He stares at the screens.\n\n               Nothing happens!\n\n<b>                                     PHIL\n</b>                         Come on. Come on...!\n\n               Frightened, furious, Phil bangs on the switch with his \n               cordless screwdriver. When all else fails, hit something.\n\n<b>               INT. LOWER HAB. NIGHT\n</b>\n               Feeble starlight from the viewports. McConnell and Terri, \n               drifting side by side, stare at one another, expecting to \n               die within seconds. It feels like an agonizing eternity.\n\n<b>                                     COMPUTER\n</b>                         Twenty percent atmosphere...\n\n               McConnell's eyes widen, as he realizes this is the same as \n               the last reading.\n\n<b>                                     COMPUTER\n</b>                         Pressure stabilizing... Atmosphere \n                         level increasing.\n\n               Terri and McConnell look at each other. Tears of relief in \n               her eyes. He is exhausted, nearly spent, but manages a grin. \n               She holds the 0-2 mask up to his face, and as he grips it, \n               breathing deeply, they hug one another.\n\n<b>               INT. COCKPIT. NIGHT\n</b>\n               The lights and computer screens are flickering back on. All \n               of them! The cockpit lights up like a Christmas tree. Phil \n               bounces up and down like a madman, babbling in triumph.\n\n<b>                                     PHIL\n</b>                         Yes! Awriiiight! Had it all the way. \n                         Yes!\n\n               Forgetting his injury, he pounds his gloved fist on the \n               console in triumph.\n\n<b>                                     PHIL\n</b>                         Shit!\n\n               He wrings his injured hand, then his gaze is caught by\n\n<b>               THE NAVIGATIONAL MONITOR\n</b>\n               Which pops back on, showing the ship and the MOI point coming \n               perilously close together.\n\n<b>               PHIL'S EYES WIDEN IN FEAR\n</b>\n               As he keys his mike urgently.\n\n<b>                                     PHIL\n</b>                         Get back in here, guys!\n\n<b>               EXT. SPACE. NIGHT\n</b>\n               Woody floats above the repaired hole, scanning the nearby \n               surface of the hull.\n\n<b>                                     WOODY\n</b>                         Jim, there's a lot of scarring... \n                         I'd better check for other punctures \n                         while I'm out here.\n\n<b>                                     MCCONNELL (V.O.)\n</b>                         Negative, negative. Woody, get back \n                         inside. We've gotta start the \n                         checklist for orbital insertion.\n\n<b>                                     WOODY\n</b>                              (a beat; reluctantly)\n                         Copy, I'm heading there now.\n\n               Woody jets back towards the open EVA hatch. But as he reaches \n               this, about to re-enter the ship, he's captured momentarily \n               by a breathtakingly beautiful sight below him.\n\n<b>               SUNRISE OVER MARS\n</b>\n               As the huge planet is REVEALED in all its red, unearthly \n               glory. It's so close now that individual features can be \n               seen with the naked eye -- the vast chasm of Valles Marineris, \n               and then Olympus Mons, poking all the way up through the \n               Martian atmosphere. A stunning, alluring spectacle.\n\n<b>               WOODY\n</b>\n               Stares down at Mars, enthralled, as sunlight floods the side \n               of the spaceship, sparkles off his visor. Dawn, after a very \n               long night indeed. He whispers lovingly, under his breath.\n\n<b>                                     WOODY\n</b>                         Hey, Beautiful...\n\n               Then he stirs himself out of his reverie and hurries through \n               the EVA hatch.\n\n               CAMERA DRIFTS QUICKLY BACK and down along the hull as stark \n               sunlight flares off the big propellant tanks, three in a \n               row, and the thick silver tubes that join them. There's a \n               good deal of scarring and denting from the meteor shower. \n               Then, as the ship begins to MOVE OUT OF FRAME...\n\n<b>               WE MOVE IN CLOSER\n</b>\n               On one of these tubes, a feeder line to the engine bells, we \n               see a scatter of tiny, undetected holes, about the size of \n               the eraser at the end of a pencil. So small, so apparently \n               harmless...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. EVA AIRLOCK. DAY\n</b>\n               As Woody enters, stripped from the MMU, dripping with sweat, \n               McConnell is waiting for him. For a moment the two men just \n               look at each other, then they surge forward into a fierce \n               hug.\n\n<b>                                     WOODY\n</b>                              (whispers)\n                         Know what? You've got enough left.\n\n               McConnell looks at him, understands.\n\n               Terri sits nearby, where she has just finished stitching up \n               Phil's hand. As Woody goes to her, she rises from her seat \n               and looks at him tears of relief and pride in her eyes.\n\n<b>                                     TERRI\n</b>                         Piece of cake?\n\n<b>                                     WOODY\n</b>                         Well. Easier than the cha-cha.\n\n               He scoops her into his arms; they kiss passionately.\n\n               Phil is blinking; something seems to be getting into his own \n               eyes. His voice catches for a moment.\n\n<b>                                     PHIL\n</b>                         I don't know what you're getting so \n                         cocky about. We scored better times \n                         in the sim at least twice.\n\n<b>                                     MCCONNELL\n</b>                              (grins)\n                         How's his hand?\n\n               Terri separates from Woody, looks down at Phil.\n\n<b>                                     TERRI\n</b>                         Seems OK. Couple of the tendons are \n                         going to be a little tight for awhile. \n                         Try to close your fingers, Phil, \n                         nice and slowly.\n\n               Phil starts curling up his fingers. The middle digit remains \n               extended in the universal gesture. They all consider this \n               for a moment. Then Phil looks up cheerfully.\n\n<b>                                     PHIL\n</b>                         Well, at least I'll still be able to \n                         drive.\n\n               After a split-second they get it, and the whole crew roars \n               with LAUGHTER, which builds and builds; they're almost giddy \n               with the relief of the tension...\n\n<b>               EXT. DEEP SPACE. DAY\n</b>\n<b>               MARS RECOVERY\n</b>\n               Sails INTO VIEW, with small attitude thrusters firing as the \n               great ship maneuvers into position for its orbital-capture \n               burn. Mars looks very large, blood-red. The entire spectacle \n               is majestic, awe-inspiring.\n\n<b>                                     WOODY\n</b>                         OK, we're ready to light this candle. \n                         Go/No Go for braking burn and MOI. \n                         Engines?\n\n<b>               INT. COCKPIT. DAY\n</b>\n               All four astronauts are strapped in, fully suited and \n               helmeted. Mars looms through the cockpit windows. The \n               atmosphere is electric with excitement.\n\n<b>                                     MCCONNELL\n</b>                         Go.\n\n<b>                                     WOODY\n</b>                         Systems.\n\n<b>                                     TERRI\n</b>                         Go.\n\n<b>                                     WOODY\n</b>                         Nav.\n\n<b>                                     PHIL\n</b>                         Go.\n\n<b>                                     WOODY\n</b>                         We are Go for the burn. I'm fueling \n                         the engines.\n\n               He flips three switches, in rapid sequence, and...\n\n<b>               EXT. MARS RECOVERY. DAY\n</b>\n               As we MOVE IN on the damaged fuel line, we see a tiny but \n               steady spray of fuel venting from the hole caused by the \n               meterorite. This freezes into eerie streamers and chunks, \n               which slowly drift away from the ship. They're quite \n               beautiful.\n\n<b>                                     PHIL (V.O.)\n</b>                         Optimum angle of entry minus seven \n                         degrees. Six... Five...\n\n<b>               INT. COCKPIT. DAY\n</b>\n               Woody looks at the others for moment -- everyone is set, \n               looking good -- then reaches for a last switch.\n\n<b>                                     PHIL\n</b>                         Four... Three...\n\n               Woody hesitates, then glances at McConnell.\n\n<b>                                     WOODY\n</b>                         Jim?\n\n               McConnell, moved by this honor, nods. He reaches out to throw \n               the switch himself.\n\n<b>                                     MCCONNELL\n</b>                         Let's go to Mars.\n\n               As the countdown indicator reaches \"0000.00.00\", a final \n               signal PINGS, and he flips the switch.\n\n<b>               EXT. MARS RECOVERY. DAY\n</b>\n               In total silence, the engines ignite. The second they do, \n               the streamers of frozen fuel explode in a white flash.\n\n<b>               INT. COCKPIT. DAY\n</b>\n               With alarms sounding, the four astronauts are slammed \n               violently forward, against their restraints.\n\n<b>                                     WOODY\n</b>                         What the --\n\n<b>                                     MCCONNELL\n</b>                         Shut down engines!\n\n               He and Woody both reach out, straining against the incredible \n               G-forces, and manage to grab a red emergency lever, yanking \n               it down hard.\n\n<b>               EXT. MARS RECOVERY. DAY\n</b>\n               Too late! IN SLOW MOTION, we see a terrifyingly violent chain \n               reaction. The fuel tanks themselves explode, one after \n               another. The supporting metal struts are vaporized. The solar \n               panels are snapped off. Two of the huge engine bells are \n               smashed sideways, out of alignment, while the third, trailing \n               pieces of the cowling, goes hurtling off, PAST CAMERA, like \n               a flaming cannon ball. The entire aft section of the ship, \n               including much of the lower Hab, instantly becomes a shredded, \n               charred tangle of metal, and even worse, the explosion causes \n               what's left of the ship -- mainly the EVA chamber and cockpit -- \n               to tumble end over end, cartwheeling down towards Mars.\n\n<b>               INT. COCKPIT. DAY\n</b>\n               In the windows, Mars goes crazily in and out of view. The \n               astronauts, flung this way, then that, are all fighting \n               against unconsciousness.\n\n<b>                                     WOODY\n</b>                         Engines negative! No response! I've \n                         got no attitude control!\n\n<b>                                     MCCONNELL\n</b>                         Manual separation! Blow the bolts!\n\n<b>                                     WOODY\n</b>                         Negative! The CM doesn't have enough \n                         thrust to correct this rotation!\n\n<b>                                     PHIL\n</b>                         We're too steep! Falling into the \n                         atmosphere...!\n\n<b>               EXT. MARS RECOVERY. DAY\n</b>\n               From further away, the charred remainder of the ship can be \n               seen spinning down towards Mars, which now fills the screen, \n               looming as large as Earth, when seen from the space shuttle. \n               The ship's motion is mercifully slowing as it hits the outer \n               atmosphere, but just as clearly this steep, unplanned angle \n               of entry dooms it.\n\n<b>                                     PHIL\n</b>                         Christ, at this angle we'll burn up!\n\n<b>               INT. COCKPIT. DAY\n</b>\n<b>               ON A COMPUTER.\n</b>\n               Their ANGLE OF ENTRY is shown -- much too direct -- with an \n               indicated swerve into blinking red disaster. Warnings flash: \n<b>               CRITICAL ENTRY! PULL OUT!\n</b>\n<b>                                     WOODY\n</b>                         How much time've we got?\n\n<b>                                     PHIL\n</b>                         I don't know! Three minutes? I don't \n                         know!\n\n               McConnell's mind is racing furiously, desperately.\n\n<b>                                     MCCONNELL\n</b>                         Where's the REMO?\n\n<b>                                     PHIL\n</b>                         The Resupply Module? Why? That's not --\n\n<b>                                     MCCONNELL\n</b>                         Where is it?!\n\n               Phil punches buttons. ON THE SCREEN a second ellipse appears: \n               a blinking orange dot labelled \"REMO.\" It appears to be soon \n               intersecting with their own trajectory.\n\n<b>                                     PHIL\n</b>                         Uh, it's close...\n\n<b>                                     MCCONNELL\n</b>                         Damn it, how close?!\n\n<b>                                     PHIL\n</b>                              (shaken)\n                         I-I don't know. It'll take time...\n\n<b>                                     MCCONNELL\n</b>                         We don't have time! Figure it out! \n                         Now!\n\n               Phil frantically types in commands on the computer.\n\n<b>                                     WOODY\n</b>                         Jim, we're dead stick, there's no \n                         way to maneuver this ship into a \n                         link-up!\n\n<b>                                     MCCONNELL\n</b>                         Not the ship. Just us. We have to go \n<b>                         EVA.\n</b>\n               They look at him, stunned. Leave the ship?\n\n<b>                                     PHIL\n</b>                         You want us to transfer in suits?\n\n<b>                                     TERRI\n</b>                         Jesus, Jim -- if we don't make it -- \n                         if we miss the REMO...\n\n<b>                                     MCCONNELL\n</b>                         There's no other choice! Phil, how \n                         close?!\n\n<b>                                     PHIL\n</b>                         One kilometer, that's the best I can \n                         do!\n\n               They stare at Woody. We feel the full, terrible weight of \n               his responsibility. Four lives hang on his call.\n\n<b>                                     WOODY\n</b>                         Prepare to abandon ship.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. SPACE. DAY\n</b>\n               The astronauts are outside the ship, tethered to each other \n               with long shock cords. Other cords, clipped to their suits, \n               trail gear bags. Phil clutches a silver metallic case -- his \n               precious computer repair kit. Woody is in the MMU. They're \n               all rotating at the same speed as the ship behind them.\n\n<b>                                     WOODY\n</b>                         On my mark, seven percent left \n                         thruster. Three, two, one, fire.\n\n               All four astronauts fire a brief, simultaneous burst from \n               the tiny attitude control thrusters in their suits. This \n               stops their rotation, bringing their travel under control. \n               The ship continues spinning in the background.\n\n               Woody takes a final look at the charred, doomed Mars Recovery. \n               The only home they've known for six months. He exchanges a \n               silent glance with the others. They all expect to be dead in \n               the next few minutes. Woody takes a breath, nods.\n\n<b>                                     WOODY\n</b>                         Okay. Let's go.\n\n               He pops the big thrusters on the MMU and starts heading away \n               from the ship. The cord between Woody and the others pulls \n               taut and they start to follow.\n\n<b>               WIDE SHOT\n</b>\n               Of Woody leading them away from the crippled spaceship, \n               against the magnificent backdrop of the blood-red planet \n               below. Four tiny figures, all alone in space.\n\n<b>               ANGLE ON MCCONNELL AND THE OTHERS\n</b>\n               As Phil looks back, his eyes searching the stars.\n\n<b>                                     TERRI\n</b>                         What're you looking for?\n\n<b>                                     PHIL\n</b>                              (softly, sadly)\n                         Earth.\n\n<b>                                     TERRI\n</b>                              (beat)\n                         Hey. When we get back? We really \n                         will have to try this in the sim.\n\n               He tries to smile. So does she.\n\n<b>                                     MCCONNELL\n</b>                         How we doin' on fuel, Woody?\n\n               Woody eyes a small display screen on his forearm.\n\n<b>                                     WOODY\n</b>                         I'm at fifty percent.\n                              (looking down)\n                         But I don't see the REMO.\n\n<b>               THEIR POV\n</b>\n               Everyone is looking back at the curve of Mars against black \n               space, expecting to see the REMO coming up behind them.\n\n<b>               TERRI\n</b>\n               Happens to glance directly below.\n\n<b>                                     TERRI\n</b>                         There she is!\n\n<b>               THEIR POV\n</b>\n               The black outline of the little cargo craft drifts against \n               the red of Mars.\n\n<b>                                     WOODY\n</b>                         Jesus. She's not where I thought \n                         she'd be.\n\n<b>                                     PHIL\n</b>                         We're going to miss her.\n\n<b>               WOODY\n</b>\n               Looks again at his display screen, frustrated.\n\n<b>                                     MCCONNELL\n</b>                         What do you think?\n\n<b>                                     WOODY\n</b>                         We can't catch it. Not like this.\n\n<b>                                     MCCONNELL\n</b>                              (thinking quickly)\n                         Use the tether.\n\n               From a compartment on the side of the MMU, Woody pulls out...\n\n<b>               THE TETHER GUN\n</b>\n               About the size of a large flare gun. There's a carabiner-\n               like hook five inches in diameter on the front of the gun.\n\n<b>                                     MCCONNELL\n</b>                         We'll only have one, maybe two shots \n                         before she's out of reach.\n\n<b>                                     WOODY\n</b>                         It'll be better if I leave you the \n                         gun while I run out to the REMO. \n                         I've got enough fuel left for that.\n\n<b>                                     MCCONNELL\n</b>                         You'll be going too fast.\n\n<b>                                     WOODY\n</b>                         I'll aim to overshoot, then brake \n                         like hell; arc it in.\n\n               McConnell looks at him. They both know how risky this is, \n               and they also know it's their only chance. Woody flips a \n               switch on the gun and pulls on the hook. Off it comes, \n               trailing wire. Woody clips the hook to the MMU, then hands \n               McConnell the gun.\n\n<b>                                     WOODY\n</b>                         Seeya in a few.\n\n               McConnell nods. Woody and Terri exchange a look -- tender, \n               loving -- then Woody turns around and fires the MMU jets at \n               full throttle. As Woody pulls away, line unspools from the \n               tether gun.\n\n<b>               WOODY AND THE REMO\n</b>\n               Woody is chasing the REMO from above. It's as if he were in \n               an airplane, trying to land on a car racing along a freeway. \n               Woody is picking up speed quickly. Maybe too quickly. He \n               checks his armpad display screen.\n\n<b>                                     WOODY\n</b>                         Okay. I'm on path to overshoot. I'm \n                         gonna take the edge off.\n\n               Woody starts braking with the MMU thrusters as hard as he \n               can.\n\n<b>               CLOSE ON THE THRUSTERS\n</b>\n               Glowing with orange flame. They suddenly cut off.\n\n<b>               WOODY'S EYES\n</b>\n               Show alarm. He checks his display.\n\n<b>                                     WOODY\n</b>                         I'm out. Coming in hot. Still long.\n                              (beat)\n                         Abandoning the unit. I'll brake with \n                         suit jets.\n\n               Woody hits some buttons and the MMU's latches snap open. He \n               grabs the hook connected to the tether line, then pushes \n               himself free of the MMU, starts firing his small suit jets.\n\n<b>               WOODY'S POV\n</b>\n               He's still going very quickly.\n\n<b>               WITH MCCONNELL, TERRI AND PHIL\n</b>\n               Floating close together. The tether line is still unspooling \n               from the gun. They watch Woody, below and ahead of them, as \n               he races towards the REMO. Terri's heart is in her throat.\n\n<b>                                     TERRI\n</b>                         Oh Jesus. Jesus...\n\n               McConnell reaches a glove out, touching her arm.\n\n<b>               BACK ON WOODY\n</b>\n               Still speeding towards the REMO. His suit jets cut out.\n\n<b>                                     WOODY\n</b>                         Suit jets gone. But I'm gonna make \n                         contact...\n\n<b>               MCCONNELL, TERRI AND PHIL\n</b>\n               Stare at Woody's distant figure.\n\n<b>               INTERCUT --\n</b>\n<b>                                     MCCONNELL\n</b>                         At what velocity?\n\n<b>                                     WOODY\n</b>                         Impact's gonna be a little rough.\n\n<b>                                     MCCONNELL\n</b>                         At what velocity?\n\n<b>                                     WOODY\n</b>                              (beat)\n                         Thirty-two.\n\n               A look between McConnell and Terri; her face is stricken.\n\n<b>                                     MCCONNELL\n</b>                         I'm gonna use the gun to slow you.\n\n<b>                                     WOODY\n</b>                         No! You slow me and I'll fall short.\n\n<b>                                     MCCONNELL\n</b>                         It's too fast, Woody.\n\n<b>                                     WOODY\n</b>                         No choice. I'll be okay. Here we \n                         go...\n\n<b>               WOODY AND THE REMO\n</b>\n               Woody's coming down on the module at over thirty kilometers \n               an hour. He holds the hook out in front of him with one hand \n               while grabbing the tether line with the other, and WHAM! -- \n               he crashes into the REMO.\n\n<b>               WOODY'S HAND\n</b>\n               Slams the hook against a receiver on the hull of the REMO.\n\n<b>               IT CONNECTS --\n</b>\n<b>               WOODY\n</b>\n               Tries to hold onto the tether line but his momentum is too \n               much.\n\n<b>               HIS GLOVED HANDS\n</b>\n               Are ripped from the line.\n\n<b>               WOODY\n</b>\n               Slides over the hull of the REMO.\n\n<b>               HIS HANDS\n</b>\n               Grasp in vain for something to grab onto. They drag and bump \n               and then finally his fingers close on... empty space.\n\n<b>               WOODY\n</b>\n               Is past the REMO, freefalling toward Mars.\n\n<b>               BACK ON MCCONNELL, TERRI AND PHIL\n</b>\n               As Terri screams.\n\n<b>                                     TERRI\n</b>                         Woody!!\n\n               McConnell hits a button on the tether gun and starts to reel \n               them quickly in towards the REMO.\n\n<b>               WOODY\n</b>\n               Tries his suit jets again -- they're empty.\n\n<b>               HIS POV\n</b>\n               Falling away from the REMO.\n\n<b>               MCCONNELL AND THE OTHERS\n</b>\n               Are being reeled towards the REMO by the tether line. Another \n               couple hundred meters to go.\n\n<b>                                     MCCONNELL\n</b>                         Woody, what's your status?\n\n<b>               INTERCUTTING --\n</b>\n<b>                                     WOODY\n</b>                              (after a beat)\n                         Uh, well, no suit jets and I'm still \n                         carrying a good deal of velocity.\n\n<b>                                     MCCONNELL\n</b>                         As soon as we get hooked up, I'll \n                         come get you.\n\n<b>                                     WOODY\n</b>                              (after a beat)\n                         Uh, I'd have to say negative on that, \n                         Jim.\n\n<b>                                     MCCONNELL\n</b>                         Negative on the transmission?\n\n<b>                                     WOODY\n</b>                         No, I heard you. Negative on the \n                         maneuver. I am not retrievable.\n\n               McConnell and Terri share a quick, anguished look.\n\n<b>                                     TERRI\n</b>                         Woody, that's not possible. You're \n                         not going that fast.\n\n<b>                                     WOODY\n</b>                         It comes down to the amount of fuel, \n                         honey. The suit jets were designed \n                         for attitude control, not travel. \n                         Retrieval just won't work.\n\n<b>                                     PHIL\n</b>                         It has to work!\n\n<b>                                     WOODY\n</b>                         Hey, believe me, I don't like it any \n                         more than you do.\n\n<b>                                     TERRI\n</b>                         Woody --\n\n<b>                                     WOODY\n</b>                         Run the numbers, Jim.\n\n<b>                                     MCCONNELL\n</b>                         I am.\n\n               McConnell finishes looking over the numbers on his display \n               pad. Terri is staring at him. When McConnell's eyes meet \n               hers, they are red-rimmed. Haunted.\n\n<b>                                     MCCONNELL\n</b>                         Woody, you hang tight. We'll get \n                         into the REMO, fire her up, drop her \n                         into a lower orbit and come scoop \n                         you up.\n\n<b>                                     WOODY\n</b>                         Sounds good, Jim.\n\n<b>                                     TERRI\n</b>                         It's gonna take half an hour to get \n                         the REMO reoriented! Woody'll be... \n                         He'll be in the atmosphere by then!\n\n<b>                                     MCCONNELL\n</b>                         Then we'll have to get her moving \n                         faster.\n\n<b>                                     TERRI\n</b>                         We don't have time!\n\n<b>                                     WOODY\n</b>                         You listen to Jim, honey. It's a \n                         good plan.\n\n<b>                                     TERRI\n</b>                         No! We are going to --\n\n<b>                                     PHIL\n</b>                         Oh Jesus, look! The ship!\n\n               Phil points. McConnell and Terri look.\n\n<b>               THE MARS RECOVERY COCKPIT\n</b>\n               Is now several kilometers below and behind them. It's glowing \n               red... then orange... then white. Then it erupts into a giant \n               fireball, devoured by friction with Mars' atmosphere.\n\n<b>               MCCONNELL, TERRI AND PHIL IN DEEP SPACE\n</b>\n               Are all staring at this, awed, when McConnell happens to \n               look up again. He sees something alarming.\n\n<b>                                     MCCONNELL\n</b>                         Look out!\n\n<b>               THEIR POV\n</b>\n               They are drifting quickly into the REMO.\n\n<b>                                     MCCONNELL\n</b>                         Brakes!\n\n<b>               ALL THREE\n</b>\n               Fire their suit jets, slowing themselves down. They bang \n               into the REMO at about one-tenth the speed Woody did. They \n               find handholds and grab on. McConnell hits a button on the \n               tether gun.\n\n<b>               THE HOOK\n</b>\n               Releases from the REMO's hull. McConnell hits another button \n               and it is reeled all the way into the gun. Phil is already \n               scrabbling at a latch on the REMO's outer airlock door.\n\n<b>                                     MCCONNELL\n</b>                         Okay, let's get inside! Phil, start \n                         dumping the cargo, or there won't be \n                         room for us.\n\n<b>                                     PHIL\n</b>                         But we need those supplies for --\n\n<b>                                     MCCONNELL\n</b>                         Dump the cargo. Hang on, Woody!\n\n<b>               WOODY\n</b>\n               Is looking back at the REMO. Smiles with relief to see that \n               Terri has reached it safely.\n\n<b>                                     WOODY\n</b>                         Will do, Jim.\n\n               He turns to look at...\n\n<b>               MARS\n</b>\n               Right below him, filling his field of view. A long beat.\n\n<b>                                     WOODY\n</b>                              (softly)\n                         Hey, Beautiful...\n\n<b>               BACK AT THE REMO\n</b>\n               Terri makes a snap decision. She grabs the tether gun from \n               McConnell's surprised hands, then pushes off from the REMO. \n               McConnell lunges after her, his gloved hand straining.\n\n<b>                                     MCCONNELL\n</b>                         Terri, no!\n\n               But it's too late. She's already out of reach, and now fires \n               her suit jets, pulling quickly away from the REMO.\n\n<b>               MCCONNELL\n</b>\n               Is reaching to activate his own jets, when\n\n<b>               PHIL'S HAND\n</b>\n               Grabs at his wrist, restraining this suicidal courage. They \n               stare at each other. McConnell wrenches his hand free, half-\n               maddened, agonized, staring after Terri.\n\n<b>                                     MCCONNELL\n</b>                         Goddammit, Terri, it won't work!\n\n               But Terri keeps on going.\n\n<b>               WOODY\n</b>\n               Looks back at the REMO, as he continues to fall towards Mars. \n               Sees the small figure of his wife heading towards him.\n\n<b>                                     WOODY\n</b>                         Terri, what are you doing?\n\n<b>               INTERCUT --\n</b>\n<b>                                     TERRI\n</b>                         I'll tell you what I'm not doing, \n                         Woody. I'm not going to watch you \n                         die.\n\n<b>                                     WOODY\n</b>                         Terri --\n\n<b>                                     TERRI\n</b>                         You'd do the same for me.\n\n<b>               AT THE REMO\n</b>\n               Phil is watching as Terri drops towards the distant twinkle \n               of Woody's suit lights. The airlock door hangs open. Phil \n               looks at McConnell, anguished.\n\n<b>                                     MCCONNELL\n</b>                         Get inside. Dump the cargo, then \n                         start the systems.\n                              (Phil hesitates)\n                         Now.\n\n<b>               INTERCUTTING BETWEEN WOODY AND TERRI\n</b>\n               As Woody keys his mike. Tries to steady his voice.\n\n<b>                                     WOODY\n</b>                         No. I wouldn't come for you. Not if \n                         it just wasn't possible.\n\n<b>                                     TERRI\n</b>                         I can do it!\n\n<b>                                     WOODY\n</b>                         No, Terri, you can't! You don't have \n                         enough fuel to get me, stop us both, \n                         and get us back. Hell, you come any \n                         farther and you won't have enough to \n                         get back yourself.\n\n               No response from Terri.\n\n<b>                                     WOODY\n</b>                         Listen to me, goddammit! You have to \n                         stop! You have to stop now!\n\n<b>                                     MCCONNELL\n</b>                         He's right, Terri... It's no use.\n\n               Terri looks at her armpad display.\n\n<b>               CLOSE ON DISPLAY SCREEN\n</b>\n               As her fuel indicator drops from 50 percent to 49 to...\n\n<b>               TERRI\n</b>\n               Releases her thumb from the toggle control.\n\n<b>               HER SUIT JETS\n</b>\n               Stop firing.\n\n<b>               TERRI\n</b>\n               Drifts, staring towards Woody.\n\n<b>               TERRI AND WOODY\n</b>\n               Are on the same trajectory, going the same speed, and only \n               about a hundred meters apart. But it might as well be \n               infinity.\n\n<b>                                     WOODY\n</b>                         Okay, honey...? You gotta go back \n                         now.\n\n<b>                                     TERRI\n</b>                         The hell I do.\n\n               Terri raises up the tether gun and pulls the trigger.\n\n<b>               THE HOOK\n</b>\n               Comes shooting out of the gun, wire spooling out behind it.\n\n<b>               WOODY\n</b>\n               Watches as it comes shooting down toward him.\n\n<b>               PLATE POV -- MOVING -- AS\n</b>\n               Woody gets larger and larger, the hook gets closer and closer, \n               and then SNAP! -- the hook stops. ANGLE ON THE TETHER GUN\n\n               The wire has run all the way out.\n\n<b>               WOODY\n</b>\n               Looks at the drifting hook, ten agonizing meters away from \n               him. His only life preserver.\n\n<b>               TERRI\n</b>\n               Hits the button and the wire starts winching fast back into \n               the gun.\n\n<b>                                     WOODY\n</b>                         What are you doing?\n\n<b>                                     TERRI\n</b>                         I'm gonna jet a little closer and \n                         try again.\n\n<b>                                     WOODY\n</b>                         Terri, you spend any fuel getting \n                         closer, you won't get back, and if \n                         anyone tries to get you, they'll die \n                         too.\n\n               No response from Terri.\n\n<b>               THE HOOK\n</b>\n               Is whipping back toward Terri and the gun. Woody's voice \n               cracks; he's very close to tears. Pleading now.\n\n<b>                                     WOODY\n</b>                         Honey, please go back. Go back and \n                         help everyone get down to the surface.\n\n               The hook slams back against the muzzle of the gun. Terri \n               resets the gun quickly, in an anguished fury.\n\n<b>                                     TERRI\n</b>                         I am not losing you.\n\n<b>                                     WOODY\n</b>                         I can't let you do it. I can't. I'm \n                         sorry.\n\n<b>               TERRI\n</b>\n               Looks at Woody, two hundred meters away, sensing something \n               different in his voice now, a terrible resolve...\n\n<b>                                     TERRI\n</b>                         Woody...?\n\n<b>               WOODY\n</b>\n               Raises his hands to his helmet ring. His eyes shining.\n\n<b>                                     WOODY\n</b>                         I love you, Terri. God how I love \n                         you.\n\n               He unscrews the ring, pops the seal. The outrush of air pushes \n               his helmet all the way off. Woody shuts his eyes and opens \n               his mouth.\n\n<b>                                     TERRI\n</b>                         Woody, nooooooo...!!!\n\n               Ice crystals bloom with Woody's last breath. There's nothing \n               to suck in. He doesn't fight it. He lets death come.\n\n<b>               ANGLE ON TERRI\n</b>\n               Tears streaming, chest heaving, frantic.\n\n<b>                                     TERRI\n</b>                         Woody, oh Woody, please God, no!\n\n<b>               HER THUMB\n</b>\n               Hovers over her suit jet toggle control. McConnell's voice, \n               from the distance, sounds very tired. Like he's aged fifty \n               years in the blink of an eye.\n\n<b>                                     MCCONNELL\n</b>                         Come back, Terri.\n\n               Terri's thumb is still poised. Death would be better.\n\n<b>               ANGLE ON MCCONNELL\n</b>\n               Outside the REMO. The hatch is still open. We see Phil inside, \n               staring out anxiously towards Terri.\n\n<b>                                     MCCONNELL\n</b>                              (quietly, simply)\n                         He's gone.\n\n               He sees no movement from the distant, small figure of Terri.\n\n<b>                                     MCCONNELL\n</b>                         Please, Terri...\n                              (long beat)\n                         We need you.\n\n<b>               TERRI'S THUMB\n</b>\n               Pushes the toggle control... to one side, not forward.\n\n<b>               TERRI'S FACE\n</b>\n               Inside her helmet, is streaming with tears. She turns herself \n               around, reluctantly. Heads slowly back towards the REMO.\n\n<b>               INT. INTERNATIONAL SPACE STATION. MMCR. DAY\n</b>\n               On the big screen at MMCR, a glowing green icon labelled \n               \"MARS RECOVERY\" is shown in orbit, as a stream of computer \n               figures crawls beside it.\n\n<b>               SUPER TITLE: \"SPACE STATION. MMCR. 20 MINUTE TIME LAG\"\n</b>\n               Beck stands by the NEW CAPCOM, as the latter repeats headset \n               data.\n\n<b>                                     NEW CAPCOM\n</b>                         Okay, they're Go for the burn and \n                         MOI. Should be initiating the burn \n                         just about... now.\n\n               Suddenly the data stream goes crazy. It shivers, streaks, \n               breaks up... then stops. The blinking green icon representing \n               Mars Recovery glows brighter... then vanishes.\n\n               A moment of stunned silence in the big room. Then a rising \n               babble of scared, confused voices.\n\n<b>               RAY BECK\n</b>\n               Takes a step forward, staring helplessly at the screen. His \n               face goes pale, stricken. His worst nightmare is taking place, \n               right before his eyes -- and for the second mission in a \n               row...\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. REMO. MARS ORBIT. NIGHT\n</b>\n               The REMO is now on the night side of Mars. Cargo boxes, \n               packing cases and assorted equipment containers float outside. \n               The hatch is sealed.\n\n<b>               INT. REMO. MARS ORBIT. NIGHT\n</b>\n               McConnell hovers by a bulkhead. He's anguished, haunted by \n               the image of Woody's death. We see him struggling to overcome \n               his grief and shock, trying to force himself to concentrate \n               on the critical tasks at hand. In front of him, a panel has \n               been opened; he's facing\n\n<b>               SMALL UTILITY MONITOR\n</b>\n               Already glowing, surrounded by coded switches, indicator \n               lights, com ports.\n\n<b>               MCCONNELL\n</b>\n               Stares at these, thinking hard, remembering. He's holding a \n               palm-sized computer, already wired into this panel. He begins \n               tapping the keys, but then stops himself. Reconsiders. He \n               turns, looking back at\n\n<b>               TERRI AND PHIL\n</b>\n               Hunched on what would be the floor if the REMO were on land. \n               They grip stowage straps to keep from drifting. Clearly this \n               tiny, rude cargo craft was never designed for manned \n               operation. It's claustrophobic, bitterly cold.\n\n<b>               PHIL'S FACE\n</b>\n               Is a map of torment. He is shivering, both from cold and \n               fear, barely holding himself together. He hugs his computer \n               supply case like a scared child would hug a teddy bear.\n\n<b>               TERRI\n</b>\n               Is worse. A thousand-yard stare. She's in shock.\n\n<b>               MCCONNELL\n</b>\n               Knows he has to occupy them. Speaks softly.\n\n<b>                                     MCCONNELL\n</b>                         Phil?\n                              (no response)\n                         Hey, Phil...?\n\n               Phil looks up at him dully.\n\n<b>                                     MCCONNELL\n</b>                         We're going in blind. We'll deploy \n                         the chutes by laptop. I need to get \n                         on the data bus, put in a software \n                         patch, and try to soften this tin \n                         can's landing. I could use your help \n                         with the patch.\n\n               After a moment Phil releases his strap, pushes towards \n               McConnell. He stares numbly at the monitor for a few beats, \n               then takes the little computer from McConnell. He begins to \n               tap the keys, slowly at first, but then with more confidence.\n\n<b>                                     MCCONNELL\n</b>                         That's great. Good job.\n                              (turning to Terri)\n                         Hey, Terri, I was wondering. Think \n                         maybe we could rig some kind of \n                         seatbelts out of those cargo straps?\n\n               Terri hesitates a moment, then looks at the strap in her \n               hand, as if she's never seen it before. Dully she reaches \n               for another one, begins looping them together.\n\n<b>               MCCONNELL\n</b>\n               Studies both of their faces intently. Knows that he can't \n               push them too hard, too fast. They're moving like robots, \n               but at least they're moving.\n\n<b>               EXT. REMO. MARS ORBIT. NIGHT. (MINUTES LATER)\n</b>\n               Small thrusters are firing, getting the REMO into position \n               for entry into the atmosphere.\n\n               Then all the jets fire in unison, braking the REMO, as it \n               falls away from us, towards Mars at night.\n\n<b>               INT. REMO. HIGH ATMOSPHERE. NIGHT\n</b>\n               The astronauts, restrained on the floor by Terri's jury-rigged \n               strap system, hold on for dear life. The buffeting through \n               the atmosphere is shaking them violently.\n\n<b>               BEHIND THEIR FACEPLATES\n</b>\n               We see the effect of the incredible g-forces: faces distorted, \n               unable to focus their eyes. Each of them thinking, once again: \n               Now I'm going to die...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. MARS ONE BASE CAMP. NIGHT\n</b>\n               The Mars One Base Camp looms in the foreground, like some \n               desolate, otherwordly ghost town. And then, in the night sky \n               beyond it, we see an eerie and beautiful sight: a bright \n               streak of red as the REMO slashes down into the Martian \n               atmosphere, like a shooting star, finally disappearing behind \n               distant mountains. Then all is stillness again, deathly \n               stillness and silence...\n\n<b>               INT. INTERNATIONAL SPACE STATION. VIEWPORT. DAY\n</b>\n               Beck stands by a viewport, staring out into space. He's just \n               lost four good friends, and also knows he is seeing, in this \n               disaster, the probable end of the Mars Program, and the \n               certain end of his own career. He doesn't, at first, even \n               hear the nearby VOICE.\n\n<b>                                     NEW CAPCOM\n</b>                         Ray...? We've got some new data, \n                         just coming in.\n\n               Beck looks up, his eyes red-rimmed. The CapCom shifts \n               uneasily. He's holding a computer printout.\n\n<b>                                     NEW CAPCOM\n</b>                         We just -- it doesn't make any sense. \n                         We're not sure how to read this.\n\n<b>                                     BECK\n</b>                         Data?\n\n<b>                                     NEW CAPCOM\n</b>                         Yes sir. Telemetry reports the REMO \n                         has left its orbit and reached the \n                         Martian surface.\n\n<b>                                     BECK\n</b>                              (pause)\n                         Crashed?\n\n<b>                                     NEW CAPCOM\n</b>                         No sir. Under power.\n\n               Beck snatches the paper, staring at it. For the first time \n               we see some life coming back into him.\n\n<b>                                     BECK\n</b>                         When?\n\n<b>                                     NEW CAPCOM\n</b>                         Sixty-three minutes after Mars \n                         Recovery went off-line. Sir, the \n                         graph reads like a controlled descent. \n                         But that doesn't make any --\n\n               Beck suddenly understands. And it's a joy to see his face, \n               the tears of happiness that spring into his eyes.\n\n<b>                                     BECK\n</b>                         They used the REMO as a lander.\n\n               The CapCom stares back at him, feeling the same surge of \n               hope.\n\n<b>                                     BECK\n</b>                         It's McConnell, it's got to be! Nobody \n                         else could have pulled this off. Son \n                         of a bitch! They're alive.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. MARTIAN SURFACE. MARS ONE BASE CAMP. DAY\n</b>\n<b>               POV ANGLE - WIDE\n</b>\n               As we see the Mars One Base Camp: silent, very still. In the \n               distance, the massive ERV still looms, perched for takeoff, \n               the bottom rungs of its ladder buried.\n\n<b>               PANNING\n</b>\n               We see that sand has drifted high against the Hab, as well \n               as the sides of the partially-deflated tunnel and greenhouse, \n               and the four-man rover. The oxygen still and propellant plant \n               are almost buried. Solar panels, some of them punctured by \n               micrometeors, FLAP and CREAK eerily in the slight breeze. \n               And finally,\n\n<b>               CLOSER TO CAMERA\n</b>\n               We see the camp's American flag, still on its toppled pole, \n               but nearly obliterated by sand.\n\n<b>               ANGLE ON MCCONNELL, TERRI, AND PHIL\n</b>\n               Who are spooked by this desolation. They've paused at the \n               edge of the camp.\n\n               They have dragged along with them from their landing site a \n               crude sledge, improvised from the REMO's hatch cover and \n               some cargo straps. On this, their meager supplies.\n\n               McConnell, glancing at the others, knows he's got to keep \n               their spirits up. He kneels, digs out the flag pole. Brushing \n               off the sand, he rights this and re-plants it firmly in the \n               ground, packing the sand down with his boot. He stands for a \n               moment looking at the flag, his eyes moist. Despite the cost, \n               they have made it to Mars.\n\n               When he turns, Terri and Phil are looking at him, moved.\n\n<b>                                     MCCONNELL\n</b>                         Better?\n\n<b>                                     PHIL\n</b>                              (pause)\n                         Damn right.\n\n<b>                                     MCCONNELL\n</b>                         Terri, let's see if that oxygen still \n                         is operational. Phil, you better \n                         check out the ERV. I'll take the \n                         Hab. If you find Luke's --\n\n               He catches himself. Phil and Terri look at him.\n\n<b>                                     MCCONNELL\n</b>                         Just keep in touch.\n\n<b>               EXT. ERV. DAY\n</b>\n               Phil steps from the umber sand onto the ERV's ladder, begins \n               to climb. The four-man rover is nearby, sand drifted high \n               against its tires.\n\n<b>               EXT. OXYGEN STILL. DAY\n</b>\n               Terri kneels by the oxygen still, begins to scoop away sand \n               with her gloved hands. She still looks numb.\n\n<b>               EXT. HAB. DAY\n</b>\n<b>                                     MCCONNELL\n</b>                              (on radio)\n                         I'm at the main airlock door.\n\n               He unlatches a panel, grips the emergency lever inside, tugs \n               it. After a seeming eternity, the door groans and creaks \n               open. Little puffs of dust and sand swirl about, settle.\n\n<b>                                     MCCONNELL\n</b>                         Entering Hab.\n\n<b>               EXT. ERV. DAY\n</b>\n               Perched atop the ERV's ladder, Phil, using a battery-powered \n               drill, is just removing the final screw from the hatch cover. \n               He lifts off the heavy cover, lets it tumble to the sand.\n\n<b>                                     PHIL\n</b>                         I've got ERV access. I'm going in. \n                         Terri, you okay?\n\n<b>               EXT. OXYGEN STILL. DAY\n</b>\n               Terri is still scooping sand. She's just cleared the first \n               row of gauges.\n\n<b>                                     TERRI\n</b>                         Yeah. This is gonna take awhile to \n                         get back to 100% capacity.\n\n<b>               INT. MARS ONE HAB. DAY\n</b>\n               McConnell walks through the kitchen, which we recognize. He \n               pauses to look at the table from which Luke and his crew \n               taped their final, fateful message.\n\n<b>               HIS BIRTHDAY CUPCAKE\n</b>\n               Still sits there, eerily, with its stub of burned-out candle. \n               Half-finished, frozen cups of coffee. Suddenly, out of the \n               corner of his eye, he catches a flash of white. He spins, \n               startled, and sees\n\n<b>               HIS OWN REFLECTION.\n</b>\n               In his white pressure suit, staring back at him from the \n               screen of a video monitor. Above this is perched the camera \n               the Mars One astronauts used for their comm packets.\n\n<b>               MCCONNELL SHIVERS\n</b>\n               This place is filled with ghosts.\n\n<b>               INT. ERV COCKPIT. DAY\n</b>\n               Phil, in the pilot's seat of the ERV, pushes a computer's \n               power button. The screen flickers weakly to life, startling \n               him a bit, but all he sees on it are white streaks, crazy \n               static.\n\n<b>                                     PHIL\n</b>                         ERV appears structurally intact. \n                         Computers are fried, just as we \n                         thought.\n\n<b>               EXT. OXYGEN STILL. DAY\n</b>\n               Terri has cleared more gauges, valves. She sits back on her \n               heels, studying the tangle of pipes.\n\n<b>                                     TERRI\n</b>                         Copy that. I've got busted filters \n                         here, clogged intakes. Helluva cleanup \n                         job, but so far no major damage.\n\n<b>               INT. GREENHOUSE. DAY\n</b>\n<b>               AN INNER AIRLOCK DOOR WHOOSHES OPEN, AND MCCONNELL ENTERS. \n</b><b>               THEN STOPS, ASTONISHED. HIS POV\n</b>\n               On a fantastic, almost jungle-like atmosphere. The plants \n               have been allowed -- encouraged? -- to grow wildly. Some are \n               even pushing against the inflated roof. Water condenses on \n               the leaves and the roof, then is captured and routed through \n               pipes of every shape and size, dripping into a clever \n               assortment of collection jars. Liquid water.\n\n<b>               MCCONNELL\n</b>\n               Reaches into a bucket, touches the water. His glove comes up \n               before his wondering eyes, dripping. Grasping the implication, \n               he looks down at his forearm instrument pad.\n\n               Blinking red letters read \"25 deg. C.\" And something else -- \n               the puffy white material of his suit is starting to slightly \n               deflate, revealing his arm's shape. There's air pressure in \n               here!\n\n<b>               MCCONNELL\n</b>\n               Punches in more numbers, and gets the readout:\n\n               \"Nitr. 78%/ 02 20%/ C02 1%/ Trace gasses 1%.\"\n\n<b>               MCCONNELL\n</b>\n               Slowly reaches up, unsealing the neck ring of his helmet. He \n               hesitates, then lifts it off. Takes a deep, quenching lungful \n               of pure air. Holds it in. Lets it slowly out. For a moment \n               he doesn't trust his own voice. Then speaks softly towards \n               his helmet.\n\n<b>                                     MCCONNELL\n</b>                         I'm in the greenhouse. You better... \n                         you better come see this for \n                         yourselves.\n\n<b>               INT. ERV. DAY\n</b>\n               Phil, still sitting at the cockpit controls, turns. Through \n               a side viewport he can just make out the greenhouse.\n\n<b>                                     PHIL\n</b>                         What is it?\n\n               There's no answer. He rises.\n\n<b>               EXT. OXYGEN STILL. DAY\n</b>\n               Terri rises, concerned, and turns. Through the distant, \n               translucent wall of the greenhouse, McConnell's shadowy figure \n               can be seen, moving slowly.\n\n<b>                                     TERRI\n</b>                         Jim...?\n\n<b>               INT. GREENHOUSE. DAY\n</b>\n               McConnell sets down his helmet, starts exploring, pushing \n               through fronds as he makes his way down an aisle. The dripping \n               foliage is so dense it almost chokes his path. Everywhere he \n               looks, he has the sense of a scrounged-together, recycled, \n               jury-rigged environment, where a great deal of ingenuity has \n               come into play. He pauses, looking up...\n\n               Overhead, a bellows, stitched together from pieces of plastic \n               tarp, slowly inhales and exhales, pumping air into a vent in \n               the upper deck of the Hab. Its power comes from a crude water \n               wheel, a buckets-and-strut assemblage, tidily sutured with \n               duct tape, like some giant Erector set.\n\n               As McConnell turns away from this, still marvelling, a ragged \n               figure leaps through the foliage! It smashes into him, with \n               a HARSH SCREECH, knocking him to the ground.\n\n               McConnell, on his back, straddled by his attacker, fights \n               back as best he can. A blur of flailing arms and fists, as \n               he tries to push the creature away. Staring up, he catches a \n               glimpse of the almost unrecognizable\n\n<b>               LUKE GRAHAM\n</b>\n               Whose frightened eyes glare back at him through a swaying \n               curtain of dreadlocks. His skin is creased, weathered, above \n               a scraggly beard. His clothes are tattered, patched together. \n               In one fist he grips a rock hammer, which he swings high \n               overhead, about to drive the claw through McConnell's skull. \n               McConnell grabs his arm desperately, trying to fend him off.\n\n<b>                                     MCCONNELL\n</b>                         Luke, it's me! Jim McConnell!\n\n               We see a flash of uncertainty in Luke's eyes. Then he yanks \n               his arm free, and his hammer arcs up even higher, trembles \n               in the air.\n\n<b>                                     LUKE\n</b>                         You're not here!\n\n<b>                                     MCCONNELL\n</b>                         Luke, it's Jim!\n\n<b>                                     LUKE\n</b>                         No, no, you're not... you can't be \n                         here.\n\n<b>                                     MCCONNELL\n</b>                         Your wife is Debra! Your son is Bobby! \n                         You were reading Treasure Island \n                         with him...!\n\n               As he stares down at McConnell, Luke's eyes finally light up \n               with recognition. but before he can move, he is seized from \n               behind and flung backwards to the ground, the hammer ripped \n               from his grasp, as Terri and Phil pinion his arms. McConnell \n               scrambles to his feet.\n\n<b>                                     MCCONNELL\n</b>                         Don't hurt him!\n\n               McConnell kneels beside Luke, signalling to Terri and Phil \n               that it's okay to let him go. They stand back, pulling off \n               their helmets. Everyone is panting, out of breath.\n\n               Luke sits up, slowly studying their features, one after \n               another, as if still not quite certain whether they might \n               vanish. His voice is hoarse, rusty from disuse.\n\n<b>                                     LUKE\n</b>                         Phil... Terri...\n\n               Luke looks with incomprehension at McConnell.\n\n<b>                                     LUKE\n</b>                         Jim... I don't understand. You're \n                         not supposed to be here... Why are \n                         you here? Where's Woody?\n\n<b>                                     MCCONNELL\n</b>                         He didn't make it Luke.\n\n               Luke stares at McConnell, trying to absorb everything. He \n               looks to Terri, who looks down.\n\n<b>                                     LUKE\n</b>                         Oh no.\n\n               Luke shakes his head in dismay. He seems to shrink in on \n               himself. It's all too much for him to take in. McConnell \n               kneels and puts his arm around Luke, comforting him.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. ELSEWHERE IN THE GREENHOUSE. DAY (MINUTES LATER)\n</b>\n               Luke sits on the side of his cot, in the little tented \n               sleeping area he's created in one corner of the greenhouse. \n               Nearby, his hotplate, pots, and some freshly harvested \n               vegetables and greens. The others crouch around him.\n\n<b>                                     MCCONNELL\n</b>                         Luke, what happened here?\n\n               A flash of fear in Luke's eyes.\n\n<b>                                     LUKE\n</b>                              (whispers)\n                         We fired the radar. It came. They \n                         all died.\n\n<b>                                     MCCONNELL\n</b>                         What came?\n\n<b>                                     LUKE\n</b>                         They all died, but I was spared. \n                         Why? Had to be for a reason. Then, \n                         all of a sudden, I knew why I was \n                         spared.\n\n               His voice drops to a conspiratorial whisper.\n\n<b>                                     LUKE\n</b>                         So somebody would be left to figure \n                         out the secret.\n\n               He taps his forehead, significantly, then nods once or twice. \n               The others exchange an uneasy glance.\n\n<b>                                     MCCONNELL\n</b>                         Luke, we still don't understand.\n\n<b>                                     LUKE\n</b>                         Come. Comecomecome.\n\n               He rises quickly and scuttles off, waving an impatient hand, \n               without waiting to see if they'll follow. McConnell, Terri \n               and Phil stare after him for a long moment. Phil breaks the \n               silence.\n\n<b>                                     PHIL\n</b>                         Is it just me? Or is he about two \n                         mealpacks short of a picnic?\n\n<b>                                     TERRI\n</b>                         Long term exposure to low gravity \n                         can have an adverse impact on the \n                         brain. He could be suffering from a \n                         form of asphyxia.\n\n<b>                                     MCCONNELL\n</b>                         Or maybe his whole crew died and \n                         he's been marooned alone on Mars. \n                         Let's give him time to adjust.\n\n               McConnell and Terri follow in the direction Luke went. Phil, \n               trailing, mutters to himself.\n\n<b>                                     PHIL\n</b>                         Greatgreatgreat.\n\n<b>               EXT. MARS ONE BASE CAMP. DAY\n</b>\n               Luke, now in a patched-up pressure suit and grubby-looking \n               helmet, stands peering down unhappily at the improvised \n               sledge, with its meager supplies. McConnell, Terri, and Phil \n               walk up behind him, wearing their helmets again. They hear \n               Luke over his RADIO.\n\n<b>                                     LUKE\n</b>                         So... let me be sure I understand \n                         this. Your ship blew up, with all \n                         its supplies. Then you emptied the \n                         cargo out of the REMO, and it was \n                         totalled on landing. You've got no \n                         food, no water, no spare oxygen, \n                         nothing but what I see here...?\n\n               McConnell and the others are silent, embarrassed. Then \n               McConnell nods. Luke looks at him, a cracked grin.\n\n<b>                                     LUKE\n</b>                         What kinda rescue mission is this?\n\n<b>                                     MCCONNELL\n</b>                         That kind.\n\n               He points to the computer repair case, as Phil lifts it off \n               a sledge. Luke turns, looks at the case, then Phil.\n\n<b>                                     PHIL\n</b>                         Check it out. New nav boards for the \n                         ERV. I got four round-trip tickets, \n                         baby, right in here.\n\n<b>                                     LUKE\n</b>                              (softly)\n                         Four.\n\n               In some mysterious way, this reminder of Woody's death seems \n               to bring him fully back into himself. He takes Terri by the \n               shoulders, deeply saddened. She meets his gaze.\n\n<b>                                     LUKE\n</b>                         Terri... I'm so sorry. He was a good \n                         man.\n\n<b>                                     TERRI\n</b>                         Thanks, Luke.\n\n<b>                                     LUKE\n</b>                         When there's time, we'll talk.\n\n               She nods, grateful. A beat. He looks at the others.\n\n<b>                                     LUKE\n</b>                         This way.\n\n               He starts off across the sand, and they follow.\n\n<b>               EXT. GRAVE SITE. DAY\n</b>\n               They stand looking down at the three long mounds of dirt, as \n               Luke completes his account of the disaster.\n\n<b>                                     LUKE\n</b>                         ...When I came to and dug myself out \n                         of the sand, my faceplate was cracked. \n                         Leaking badly. I barely made it back \n                         to Base. It was weeks before I could \n                         work up the nerve to go back out \n                         there and look for their...\n\n               He has to pause, collect himself.\n\n<b>                                     LUKE\n</b>                         Renee was the only one I could find. \n                         But it didn't seem right, somehow, \n                         to dig just one grave.\n\n               There is an emotional silence. Luke turns, takes a few steps. \n               He stares into the distance, observing the swirling dust \n               around them. McConnell hesitates, notices Luke's gaze.\n\n<b>                                     MCCONNELL\n</b>                         Has it been blowing like this for a \n                         while?\n                              (Luke nods)\n                         We saw a big storm from space. But \n                         Micker said it was turning south.\n\n               Luke looks off into the distance, studies something only he \n               seems to see.\n\n<b>                                     LUKE\n</b>                         If it holds course.\n\n               McConnell pulls his gaze away from the horizon, looks at \n               Luke.\n\n<b>                                     MCCONNELL\n</b>                         This -- whatever it was -- this force. \n                         You say it came directly out of the \n                         top of the mountain?\n\n<b>                                     LUKE\n</b>                         You don't believe me. That's okay. \n                         But I'm not crazy, Jim.\n\n               McConnell isn't quite sure how to reply to this.\n\n<b>                                     MCCONNELL\n</b>                         What did you mean by its \"secret?\" \n                         What secret?\n\n<b>                                     LUKE\n</b>                              (pause)\n                         You better see for yourselves.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. MARS ONE HAB. DAY\n</b>\n               McConnell, Terri, and Phil follow Luke into the Science Lab \n               area of the Hab, then stop in their tracks. Their helmets \n               are off. It's very cold in here; their breath is frosty.\n\n<b>               THEIR POV --\n</b>\n               The Lab is crammed with rock and sand samples from many \n               locations, all tagged and labelled. There are drawings and \n               diagrams covering the walls: Martian landscapes, annotated \n               maps, and over and over, obsessively repeated, drawings of \n               the vortex that destroyed the Mars One crew.\n\n<b>                                     LUKE\n</b>                         See, where they made their mistake \n                         was, they must've planned for it to \n                         be visible from Earth...\n\n               The others turn, looking at him. Luke is aiming an electric \n               space heater at his computer. As the coils glow red, he rubs \n               his hands together, poised over the keyboard.\n\n<b>                                     MCCONNELL\n</b>                         Who's \"they\"?\n\n               Luke reacts to their blank stares. He has a kind of jittery \n               feverish intensity, a secret excitement.\n\n<b>                                     LUKE\n</b>                         Don't you understand? Hundreds of \n                         millions of years have gone by. You've \n                         got erosion, sand storms, lava flows, \n                         meteor impacts -- hell, in that much \n                         time, the whole surface would've \n                         changed. So no wonder we never saw \n                         it before. Well, I mean, we saw it, \n                         but not like they meant us too. Too \n                         much dirt on it.\n\n               The others exchange worried glances. Is he totally nuts?\n\n<b>                                     TERRI\n</b>                         Saw what?\n\n<b>                                     LUKE\n</b>                         This.\n\n               On the computer screen they're looking at...\n\n<b>               CLOSE ON THE MONITOR\n</b>\n               Pictures of the Face after the disaster, seen from ground-\n               level, in telephoto views. Rising out of a ring of rock and \n               dirt rubble is the shiny-white profile of a gigantic face. \n               The white is smooth, impenetrable. It has the scale of a \n               mountain, but the planes and angles are clearly unnatural.\n\n<b>               MCCONNELL, PHIL AND TERRI (INT. MARS ONE HAB.)\n</b>\n               They are stunned. Can hardly believe their eyes.\n\n<b>                                     PHIL\n</b>                         Jesus...\n\n<b>                                     TERRI\n</b>                         What is that...?\n\n<b>                                     LUKE\n</b>                         I don't know. But whatever it is, \n                         somebody built it. And not us.\n\n               A few moments of silence while they try to absorb this.\n\n<b>                                     MCCONNELL\n</b>                         What about the sound? That signal \n                         you heard before the explosion?\n\n<b>                                     LUKE\n</b>                         Good, Jim, good. That's the key.\n\n               A click of the mouse and they all HEAR, over speakers, the \n<b>               DEEP PULSING BASS TONE.\n</b>\n<b>                                     LUKE\n</b>                         Hear the pauses? That's what made me \n                         realize it's a pattern -- a repeating \n                         pattern.\n\n<b>                                     MCCONNELL\n</b>                         Mathematical?\n\n               Luke is trembling with excitement. His words tumble out very \n               quickly. He's been waiting so long to share this.\n\n<b>                                     LUKE\n</b>                         That's what I thought. There are \n                         distinct blocks in the pattern, and \n                         within each block the tones come in \n                         groups of three. Threethreethree. \n                         For months I struggled to analyze \n                         it, trying different constructs... \n                         Then I thought about dimensions.\n\n<b>                                     MCCONNELL\n</b>                         X-Y-Z coordinates...\n\n<b>                                     LUKE\n</b>                         Right! Three groups equals three \n                         dimensions... So I tried assigning \n                         different graphic values to each \n                         block, group and tone. And finally I \n                         got... this.\n\n               He types another command. They all look at the monitor, the \n               glow reflecting on their faces. They are amazed again.\n\n<b>               CLOSE ON THE MONITOR\n</b>\n               Where we see the beautiful interlocking chain, the universally \n               familiar double helix, of a DNA molecule -- the elegant \n               blueprint of life.\n\n<b>               BACK TO SCENE (INT. MARS ONE HAB.)\n</b>\n<b>                                     PHIL\n</b>                         My God... Is that what I think it \n                         is?\n\n<b>                                     TERRI\n</b>                         DNA... that's a model of DNA!\n\n<b>                                     LUKE\n</b>                         You see it, too. Thank God. I was \n                         afraid I was just suffering from a \n                         form of asphyxia.\n\n               She glances at him, surprised that he overheard her earlier \n               diagnosis. But he smiles, not offended.\n\n<b>                                     PHIL\n</b>                         So, okay, so -- somebody left this \n                         thing here, somebody -- other than \n                         human. But what the hell is it?\n\n<b>                                     LUKE\n</b>                         My guess is, it's a signature. A \n                         self-portrait of whatever species \n                         created the Face.\n\n<b>                                     MCCONNELL\n</b>                         But that DNA looks human.\n\n<b>                                     TERRI\n</b>                         No way. It's missing the last pair \n                         of chromosomes. See?\n\n<b>                                     MCCONNELL\n</b>                         Yeah, but it's close. Damn close.\n\n<b>                                     TERRI\n</b>                         The difference between a man and an \n                         ape is less than three percent of \n                         genetic material. But that three \n                         percent gives you Mozart. Einstein.\n\n<b>                                     PHIL\n</b>                         Or Jack the Ripper.\n\n               They look at him. Then all four turn, stare again at the \n               slowly rotating DNA, pondering its awesome mystery.\n\n<b>               MCCONNELL\n</b>\n               When he finally speaks, never takes his eyes off the screen. \n               We can read in them the almost overwhelming grip this mystery \n               has on his imagination.\n\n<b>                                     MCCONNELL\n</b>                         It's been a long day. Let's get a \n                         couple hours sleep, then tackle this \n                         thing when we're fresher. Phil, your \n                         first priority will be to get the \n                         motherboards over to the ERV. \n                         Concentrate on getting communications \n                         up first.\n                              (Phil nods)\n                         Soon as we've got the juice, we'll \n                         send a packet to Micker, tell them \n                         Luke's OK, and that... everything \n                         else that's happened. The rest of us \n                         will take an inventory of supplies, \n                         see where we stand. Okay?\n\n               The others nod in weary agreement. As they start out, towards \n               the relative warmth of the greenhouse, Terri looks at Luke, \n               at his scraggly beard and his long, lank hair. She smiles, \n               brushing some locks off his forehead.\n\n<b>                                     TERRI\n</b>                         C'mon. There's a pair of scissors in \n                         my medkit.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. MARS ONE HAB. ANOTHER SECTION. NEXT MORNING\n</b>\n               As in the Science Area, this space has enough thin oxygen \n               for the astronauts to remain unhelmeted. McConnell and Luke \n               are still going through what few supplies were salvaged from \n               the REMO.\n\n               Luke pauses, rubbing the unfamiliar smoothness of his cheek. \n               His beard is gone, his hair neatly trimmed. McConnell enjoys \n               Luke's own wonder at his transformation.\n\n<b>                                     MCCONNELL\n</b>                         How do you feel?\n\n<b>                                     LUKE\n</b>                         Like I just got back my other three \n                         percent.\n\n               McConnell smiles. Terri enters through the hatch, removing \n               her helmet.\n\n<b>                                     TERRI\n</b>                         The backup generator is salvageable, \n                         and two of the solar panels. I'm \n                         pretty sure I can get the oxygen \n                         still back into production, too. So \n                         we're not in such bad shape, \n                         considering.\n\n<b>                                     LUKE\n</b>                         Good work, Terri.\n\n               McConnell, rummaging through Phil's backpack, drops an already-\n               opened bag of M&amp;Ms. The CANDIES scatter and bounce all over \n               the floor.\n\n<b>                                     MCCONNELL\n</b>                         Look at that. Phil's idea of absolute \n                         essentials.\n\n               Luke and Terri smile. McConnell scoops up the fallen M&amp;Ms. \n               He slows down as he does it, looking at the scatter of little \n               round CANDIES. Something tugging at the back of his mind...\n\n<b>                                                              FLASHBACK TO:\n</b>\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. MARS RECOVERY. EVA AIRLOCK. DAY\n</b>\n               Phil's intricately designed M&amp;M model of his \"ideal woman\", \n               floating weightlessly, as McConnell drifts past it, plucking \n               away a couple pieces of the candy. Phil reacting, in good-\n               natured annoyance. The gap in the design left by McConnell's \n               theft...\n\n<b>               INT. MARS ONE HAB. ANOTHER SECTION. DAY\n</b>\n<b>               CLOSE ON MCCONNELL\n</b>\n               As he trembles with excitement. With sudden comprehension.\n\n<b>                                     MCCONNELL\n</b>                         It's not a signature.\n\n<b>                                     LUKE\n</b>                              (puzzled)\n                         What?\n\n<b>                                     MCCONNELL\n</b>                         That noise from the Face... It's not \n                         a signature. It's a test.\n\n               Luke and Terri stare at him.\n\n<b>               INT. MARS ONE HAB. MOMENTS LATER\n</b>\n               McConnell sits in front of the computer back in the science \n               lab area, staring once again at the mysterious DNA model. \n               Luke and Terri stand behind him. McConnell's energy, his new \n               certainty, is almost electrifying.\n\n<b>                                     MCCONNELL\n</b>                         It's asking us for the right answer. \n                         It wants us to put in the missing \n                         pair of chromosomes.\n\n<b>                                     LUKE\n</b>                         But why?\n\n<b>                                     MCCONNELL\n</b>                         To prove that we're human.\n\n               Terri and Luke look at each other, starting to understand.\n\n<b>                                     LUKE\n</b>                         We fired radar into that thing. \n                         Concentrated sound waves...\n\n<b>                                     MCCONNELL\n</b>                         Which it interpreted as a wrong \n                         answer... Yes! It's like a, a security \n                         alarm. When it gets an incorrect \n                         response, it defends itself.\n\n<b>               INT. ERV COCKPIT. DAY\n</b>\n               Phil is listening in on radio. He's got panels open, wires \n               dangling, as he works his ongoing repair. He keys his mike, \n               uneasily.\n\n<b>                                     PHIL\n</b>                         So what happens when it gets the \n                         right answer?\n\n<b>               INT. MARS ONE HAB. DAY\n</b>\n               As McConnell looks at Luke and Terri.\n\n<b>                                     MCCONNELL\n</b>                              (hesitates)\n                         I don't know. But we've got to find \n                         out.\n                              (to Luke, pointing)\n                         Can you work this the other way? \n                         Figure out which tones would be \n                         equivalent to the missing chromosomes? \n                         Then dub them into your recording of \n                         the signal?\n\n<b>                                     LUKE\n</b>                         I think so, yes.\n\n<b>                                     MCCONNELL\n</b>                         What about the radar gun? Will it \n                         accept that input? Can we transmit a \n                         completed signal back to the Face?\n\n               Luke stares at him, startled by what he's implying.\n\n<b>               INT. ERV COCKPIT. DAY\n</b>\n               Phil is also growing increasingly nervous.\n\n<b>                                     PHIL\n</b>                         Whoa, whoa, hold on, Jim. What if \n                         you're wrong? Whoever goes out \n                         there... I mean, what if you're wrong? \n                         Three people have already died over \n                         that thing.\n\n<b>               INT. MARS ONE HAB. DAY\n</b>\n               As Luke and Terri look tensely at McConnell.\n\n<b>                                     TERRI\n</b>                         Four.\n\n               McConnell looks at her.\n\n<b>                                     MCCONNELL\n</b>                         Terri, if we leave here without \n                         getting some answers, they all died \n                         in vain.\n\n               Terri shakes her head.\n\n<b>                                     TERRI\n</b>                         We just don't know enough about that -- \n                         that thing out there to take any \n                         more chances.\n\n<b>                                     MCCONNELL\n</b>                         What are we here for, if not to take \n                         chances...?\n\n               His passion startles them; they've never seen him so \n               emotional. He points at the computer screen.\n\n<b>                                     MCCONNELL\n</b>                         This means we're not alone. It means \n                         we're on the brink of the greatest \n                         discovery in mankind's history. But \n                         we've still got to prove it. Who \n                         knows when someone else will get \n                         back here? Or if they ever will? You \n                         know what Congress is like. They'll \n                         say it's too dangerous, too much \n                         loss of life, let's go back to \n                         unmanned flights. We could be the \n                         last explorers to come here for \n                         decades. We're it, guys.\n                              (pause)\n                         We're it.\n\n<b>                                     LUKE\n</b>                              (quietly)\n                         We don't have to go out there. There's \n                         a better way.\n\n               They look at him, surprised.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. DAY\n</b>\n               The familiar, plucky little figure of ARES-8 wheels across \n               ocher sand, with the radar gun jury-rigged onto its back. \n               Ares' video snout WHIRRS out, extending. The familiar bass \n               rumble of the Face is very loud from here.\n\n<b>                                     LUKE\n</b>                         Checking video feed...\n\n<b>               INT. MARS ONE HAB. LATE DAY\n</b>\n               McConnell, Terri, and Phil have gathered around Luke as he \n               pushes buttons, and a monitor CRACKLES to life. White streaks, \n               then a blurry image, which he tries to enhance. Finally the \n               image starts to sharpen.\n\n<b>                                     LUKE\n</b>                         There!\n\n<b>               ON THE MONITOR\n</b>\n               They see the familiar stark white profile of the FACE, shot \n               from ground level, in a SLOWLY APPROACHING ANGLE...\n\n<b>               THE FOUR ASTRONAUTS\n</b>\n               Stare at the ominous sight. They're all more nervous than \n               they want to show. Luke's fingers delicately work a joystick \n               as he maneuvers the remote surveyor.\n\n<b>                                     MCCONNELL\n</b>                         How close do we need to get?\n\n<b>                                     LUKE\n</b>                         I'm not sure. Maybe we better stop \n                         by that boulder.\n\n<b>               EXT. MARS. THE FACE. LATE DAY\n</b>\n               Ares-8 whines to a stop by a large boulder, which partially \n               shields it from the Face, looming beyond. The radar gun \n               swivels, locating its target. Then stops, ready to fire.\n\n<b>               INT. MARS ONE HAB. LATE DAY\n</b>\n               Luke looks at Terri, Phil, and McConnell. Phil shuts the lid \n               of the box holding the new nav boards, snaps it protectively \n               down. He nods. Terri takes a deep breath, then she nods.\n\n               Luke's hand hovers over the red firing button; a moment of \n               awesome uncertainty and danger. He looks at McConnell, who \n               finally gives a nod of command. Then Luke hits the button.\n\n<b>               EXT. MARS. THE FACE. LATE DAY\n</b>\n               From the radar gun on Ares-8's back, a sharp, high-pitched \n               electronic burst is emitted, pulsating like a tuning fork as \n               it's fired towards the Face. After a few seconds it stops.\n\n               For a moment nothing happens.\n\n               Then the deep bass rumbling stops as well. The only remaining \n               sound is of WIND, stirring up dust on the Martian plains.\n\n<b>               ANGLE ON THE FACE\n</b>\n               As suddenly a huge, curved segment of the white surface begins \n               to rise from the earth, like a gigantic hangar door, sliding \n               out of sight into an upper sheath of some kind. The movement \n               is measured, stately, utterly silent. As the segment rises, \n               it reveals a blinding white light: the interior of the Face. \n               No inside details can be seen.\n\n<b>               INT. MARS ONE HAB. DAY\n</b>\n               McConnell, Luke, Terri and Phil stare at this phenomenon, \n               awed. They're barely breathing.\n\n<b>                                     PHIL\n</b>                         Oh my God...\n\n<b>                                     LUKE\n</b>                         It worked... It worked!\n\n<b>                                     MCCONNELL\n</b>                         Check for radiation.\n\n               Luke punches buttons, waits anxiously for a readout.\n\n<b>                                     LUKE\n</b>                         Normal. Seismic... normal. Anemometer \n                         steady. No sign of the vortex.\n\n<b>                                     PHIL\n</b>                         I don't know what we did, but guys -- \n                         does that look to you like a hostile \n                         gesture?\n\n<b>                                     TERRI\n</b>                         No. More like an invitation.\n\n<b>                                     LUKE\n</b>                         Or another test...\n\n               McConnell is staring at the mysterious opening. On his face, \n               a growing look of determination.\n\n<b>                                     MCCONNELL\n</b>                         Luke, the four-man rover. Does it \n                         still work?\n\n               The others look at him, their expressions changing as they \n               realize what he's implying.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. MARS ONE BASE CAMP. LATE DAY\n</b>\n               McConnell, once again helmeted, emerges from the Hab airlock. \n               Luke, Terri and Phil are coming out behind him. The wind has \n               picked up, and fine dust is blowing. They stop, staring off \n               in astonishment towards\n\n<b>               A FRIGHTENING SIGHT\n</b>\n               The entire sky has darkened from its customary salmon into \n               purplish-black at the horizon, with bloody streaks above. \n               The DUST STORM has turned their way; it's now sixty kilometers \n               away and closing. The main body of it reaches two thousand \n               meters above the surface and stretches out along a thousand-\n               kilometer front.\n\n<b>               THE ASTRONAUTS\n</b>\n               Stare at this unholy juggernaut, alarmed. McConnell turns to \n               Luke, whose expression is grim.\n\n<b>                                     MCCONNELL\n</b>                         How long before it hits?\n\n<b>                                     LUKE\n</b>                         An hour? Maybe less.\n\n<b>                                     MCCONNELL\n</b>                         How bad?\n\n<b>                                     LUKE\n</b>                         A storm like that? It could go \n                         planetary. And last a year.\n\n               McConnell stares at him.\n\n<b>                                     LUKE\n</b>                         It'll sock us in, Jim. We won't be \n                         able to take off. If that happens, \n                         with what few supplies we've got \n                         left...? We'll starve to death.\n\n               McConnell turns, staring off towards the killer storm. The \n               others look at him with questioning gazes. He turns again. \n               There's the four-man rover, ready to go. Waiting.\n\n<b>                                     MCCONNELL\n</b>                         Phil, how much longer to prep the \n<b>                         ERV?\n</b>\n<b>                                     PHIL\n</b>                         Maybe forty-five minutes. It'll be \n                         tight, but we can make it.\n\n<b>                                     MCCONNELL\n</b>                         Then there's still time for us to \n                         get out there and back.\n\n               He looks a question at Luke and Terri, one after the other. \n               Their eyes, tense but excited, signal agreement.\n\n<b>                                     MCCONNELL\n</b>                         Stay here. Continue the repair. If \n                         something goes wrong, you get out of \n                         here before that storm hits.\n\n<b>                                     PHIL\n</b>                         Go back... alone?\n\n<b>                                     MCCONNELL\n</b>                         If we're not back in forty-five \n                         minutes, I want you to prep and \n                         launch.\n                              (looks at his armpad \n                              display)\n                         That's 1950 hours.\n\n<b>                                     PHIL\n</b>                         Jim --\n\n<b>                                     MCCONNELL\n</b>                         It's not a suggestion, it's an order. \n                         You understand?\n\n<b>                                     PHIL\n</b>                              (reluctantly)\n                         I understand. But --\n\n<b>                                     MCCONNELL\n</b>                         You understand what?\n\n<b>                                     PHIL\n</b>                         If you're not back by 1950, I prep \n                         and launch.\n\n               McConnell nods, satisfied. Looks at Terri and Luke.\n\n<b>                                     MCCONNELL\n</b>                         Let's go.\n\n               They start towards the four-man rover. Dust is swirling more \n               thickly through the air, and the WIND IS LOUDER NOW. Phil \n               stands watching them go, a lone, rather forlorn figure.\n\n<b>               EXT. PLAINS OF CYDONIA. DUSK\n</b>\n               In a WIDE SHOT, we see the rover approaching the Face, across \n               the plains. The sky beyond the Face is almost black, as the \n               storm approaches from that direction. It's marching \n               relentlessly across the planet, with flashes of lightning \n               now rippling up and down its face, and even small tornadoes \n               spinning off near its purple-black base...\n\n<b>               INT. ERV COCKPIT. DUSK\n</b>\n               Phil has panels off. He's reaching into the guts of the main \n               computer, working feverishly. His repair kit is beside him.\n\n<b>               EXT. MARS. THE FACE. DUSK\n</b>\n               In a HIGH SHOT, we look down across the side of the Face and \n               its vast, open doorway, out of which the bright white light \n               is streaming. Into this corridor of light, we see the rover \n               arrive, slewing to a stop, throwing sand from its wheels.\n\n<b>               GROUND LEVEL SHOT\n</b>\n               Looking at the cavernous vertical gap in the side of the \n               Face. The opening towers to a dizzying height above us; the \n               white light strains our eyes. The three astronauts ENTER \n               FRAME as we see them, from behind, staring up.\n\n<b>               ON THE ASTRONAUTS' AWED FACES\n</b>\n               As they are stunned by the immensity of the scene, the cosmic \n               mystery before them. Luke and Terri look at McConnell. Another \n               moment of critical decision. He keys his mike.\n\n<b>                                     MCCONNELL\n</b>                         Phil, do you read me?\n\n<b>               INT. ERV COCKPIT. DUSK\n</b>\n               Phil keys his own mike.\n\n<b>                                     PHIL\n</b>                         Yeah, Jim. Your signal's breaking up \n                         a little in the storm, but I read \n                         you.\n\n<b>               EXT. THE FACE. DUSK\n</b>\n               McConnell stares into the bright opening. Bathed in its light.\n\n<b>                                     MCCONNELL\n</b>                         We're at the Face. We're gonna need \n                         a few minutes here. Same deadline, \n                         launch at 1950. With or without us. \n                         Do you copy?\n\n<b>                                     PHIL\n</b>                              (pause)\n                         Copy that.\n\n               Terri and Luke exchange a tense glance.\n\n<b>                                     TERRI\n</b>                         Jim, are you sure you want to do \n                         this?\n\n<b>                                     MCCONNELL\n</b>                         I'm not sure of anything anymore. \n                         But I didn't come a hundred million \n                         miles just to turn back in the last \n                         ten feet.\n\n               Luke smiles. The three of them stare into the portal. \n               McConnell, between the others, reaches out and grips each of \n               them by a gloved hand. They take a sort of collective breath. \n               Then they walk forward together, into the light.\n\n<b>               INT. THE FACE. DUSK\n</b>\n               The astronauts continue forward, each of them extending a \n               free hand.\n\n               The light is too dazzling for them to gauge distances, \n               textures, colors -- anything at all. They can't see walls, \n               ceiling, even a floor.\n\n<b>                                     MCCONNELL\n</b>                         Surface seems firm and level.\n\n<b>                                     LUKE\n</b>                         Roger that. Texture is smooth.\n\n<b>                                     TERRI\n</b>                         I've got good footing and no \n                         obstructions. Let's check our --\n\n               Behind them, there is an abrupt WHOOOSH, like a giant airlock \n               sealing shut. They turn, startled and nervous. Letting go of \n               each other's hands, Luke and Terri run back the way they \n               came, but almost immediately are stopped by a wall of some \n               sort. The vast hangar-type door has closed behind them.\n\n<b>                                     TERRI\n</b>                         It's solid again! We're trapped.\n\n<b>                                     MCCONNELL\n</b>                         Don't move! Keep this orientation.\n\n               The three scared, helmeted faces seem to float in the \n               brightness, some twenty feet apart.\n\n<b>                                     MCCONNELL\n</b>                              (keys his mike)\n                         Phil? Phil, can you still hear me?\n\n<b>               INT. ERV COCKPIT. DUSK\n</b>\n               Phil, saying a silent prayer, reaches over and turns on the \n               main computer. It works! He's immensely relieved.\n\n<b>                                     PHIL\n</b>                         Computers are online! Ready to load \n                         software. But guys -- we're losing \n                         visibility here.\n\n               He glances out the cockpit window at the blowing dust. Then \n               realizes that he's hearing only silence over his radio.\n\n<b>                                     PHIL\n</b>                         Guys...? Jim? Luke? Terri? Is anyone \n                         there...?\n\n               No answer. Phil stares at his radio in dread.\n\n<b>                                     PHIL\n</b>                         Don't leave me.\n\n<b>               INT. FACE. DUSK\n</b>\n               McConnell is staring at his spacesuit's sleeve. He can see \n               that the suit material is starting to deflate, revealing the \n               shape of his arm, just as it did in Luke's greenhouse. He \n               hesitates, then begins to unscrew the sealing ring on his \n               right glove.\n\n               Terri and Luke see this.\n\n<b>                                     TERRI\n</b>                              (alarmed)\n                         Jim, what're you doing? You'll \n                         depressurize!\n\n<b>                                     MCCONNELL\n</b>                         I don't think so.\n\n               McConnell makes the final twist on his glove and there's the \n               hiss of rushing air.\n\n<b>                                     LUKE\n</b>                         Jim, seal it!\n\n<b>                                     MCCONNELL\n</b>                         No. That was air going into my suit, \n                         not out. Look at your own suits -- \n                         they're not rigid anymore. We've got \n                         pressure in here.\n\n               Luke looks at his sleeve. McConnell's right.\n\n<b>                                     TERRI\n</b>                         Above Mars atmospheric? That's \n                         impossible.\n\n<b>                                     MCCONNELL\n</b>                         We're millions of miles from Earth \n                         and we're inside a gigantic white \n                         face. What's impossible?\n\n               Terri types on her arm keypad. She's amazed.\n\n<b>                                     TERRI\n</b>                         There's six psi in here...\n                              (taps more keys)\n                         Nitrogen and oxygen.\n\n<b>                                     LUKE\n</b>                         Otherwise known as air?\n\n               Terri nods. McConnell starts unscrewing his helmet ring. \n               Luke follows suit.\n\n<b>                                     TERRI\n</b>                         Hey, there may be some lethal trace \n                         gasses I haven't picked up yet, or... \n                         or... oh, the hell with it.\n\n               Terri starts taking off her helmet. In a few moments, all \n               three helmets are off. They hold them, glowing softly, against \n               their chests, as they breathe deeply and gratefully. Air. \n               And then, at this very moment, as if they have just passed \n               another kind of test...\n\n<b>               HIGH, STRIATED WALL\n</b>\n               Appears through the glare, soaring up before their startled \n               eyes. White, metallic, composed of complexly-linked bands, \n               plates, ramps. It's part of a STRUCTURE whose overall height \n               and breadth keep us from understanding its purpose. But the \n               hatch opening slowly in its side, at the top of an approach \n               ramp, is unmistakable. Radiant white light streams out from \n               within, forming a glowing tunnel, down towards the astronauts.\n\n<b>               THE ASTRONAUTS BLINK\n</b>\n               Raising their gloves against the dazzling glow. At the end \n               of this tunnel of light, inside the hatch frame\n\n<b>               A SHAPE MATERIALIZES\n</b>\n               And slowly resolves itself into a glowing humanoid form, \n               which we somehow sense is female. She appears benign, \n               wondrous. This glowing MARTIAN -- a holograph -- regards the \n               astronauts for a few moments, then beckons to them, as if to \n               say \"Enter.\" All her motions are both calm and calming -- \n               precise, unhurried, gracious.\n\n<b>               MCCONNELL, LUKE AND TERRI\n</b>\n               Look at each other. They're awed into silence, and still \n               tense, but now more out of excitement and anticipation than \n               fear. Their eyes agree: Let's go.\n\n               They walk forward slowly, carrying their helmets, up the \n               ramp and into the tunnel of light, following the Martian, \n               who retreats before them. They go through the hatch and \n               disappear inside.\n\n<b>               INT. MARTIAN STRUCTURE. DUSK\n</b>\n               Following the Martian, they find themselves in a round, open \n               space, defined by light, with a smooth matte-metallic floor, \n               but without apparent walls.\n\n               The Martian stops, turns, facing them. The astronauts stop, \n               too, uncertain what they're meant to do. Then the Martian \n               gestures again.\n\n               A cylindrical holographic column appears, rising from the \n               floor in front of the astronauts. Inside it, a swirl of eerie \n               lights, millions of them, like cosmic fireflies...\n\n<b>               MCCONNELL, LUKE, AND TERRI\n</b>\n               Set down their helmets, then cautiously converge around this \n               column, forming a loose triangle. As they stare into it, the \n               myriad lights are reflected off their own eyes and their \n               spacesuits.\n\n<b>               IN THE HOLOGRAPHIC COLUMN\n</b>\n               The whirling lights resolve into images, which relate to \n               them the story of ancient Mars:\n\n<b>               A BLUE PLANET\n</b>\n               we do not recognize. All is peaceful, beautiful.\n\n<b>               INTERCUT\n</b>\n<b>                                     MCCONNELL\n</b>                              (softly)\n                         Is that what I think it is?\n\n<b>                                     LUKE\n</b>                         Yeah. It's Mars.\n\n<b>               SUDDENLY A HUGE ASTEROID\n</b>\n               Tumbles through space towards the planet...\n\n<b>                                     TERRI\n</b>                         Oh my God.\n\n<b>               ON THE PLANET - CLOSER VIEW\n</b>\n               As thousands of small rocketships lift away from the surface, \n               heading in a stream out of the solar system...\n\n<b>               THE ASTEROID IMPACTS\n</b>\n               And a wall of fire and debris scours the planet. Oceans boil \n               and vaporize. Two gigantic hunks are blasted out of the \n               planet, spinning in flames...\n\n<b>               MCCONNELL, LUKE, AND TERRI\n</b>\n               Involuntarily flinch, bathed in the fiery images...\n\n<b>               THE PLANET IS NOW DEAD\n</b>\n               As dust storms roil across its cold, lifeless surface. The \n               flaming hunks of molten rock cool into twin moons.\n\n<b>               THE ASTRONAUTS\n</b>\n               Stare at this devastation, deeply moved.\n\n<b>               IN DEEP SPACE\n</b>\n               The stream of Martian ships grows smaller and smaller as it \n               continues on its epic voyage towards a new solar system. \n               Then we zero in on\n\n<b>               ONE PARTICULAR ROCKETSHIP\n</b>\n               As it peels off and goes in another direction. Graphics show \n               a model of what the ship contains: the familiar double helix \n               of DNA. The ship heads towards another blue planet in our \n               solar system...\n\n<b>               EARTH\n</b>\n               As it was then. More clouds than now, more ocean, and the \n               landforms all wedged together.\n\n<b>               TERRI\n</b>\n               Her voice is soft.\n\n<b>                                     TERRI\n</b>                         Earth, when it was still Pangaea. \n                         Before the continents separated.\n\n<b>               THE LONE MARTIAN SHIP\n</b>\n               Makes a fiery streak through Earth's atmosphere and plunges \n               into the ocean.\n\n               Instantly the image of the DNA double helix grows, filling \n               the entire holographic column, then it begins to spin and \n               pulse, disintegrating into a phantasmagoric whirl of new \n               images...\n\n<b>               MCCONNELL, LUKE, AND TERRI\n</b>\n               Cry out, stunned by the strobelike power of the display as\n\n<b>               LIVING FORMS\n</b>\n               Flash into the holographic column, swimming, growing, \n               crawling, leaping, flying: one-celled microscopic organisms, \n               plankton, plants of all kinds, insects, then fish, dinosaurs, \n               birds, small mammals, larger mammals -- the entire stunning \n               panorama of evolution, distilled into a single explosive \n               sequence, as the images wash over the dazzled, awestruck\n\n<b>               FACES OF THE ASTRONAUTS\n</b>\n               Until finally the images whirl away, the holographic column \n               dissolves, leaving only a circle of glowing, concentric, \n               colored rings on the floor. The astronauts are left staring \n               at each other across the open space where the column had \n               been.\n\n<b>               THE MARTIAN\n</b>\n               Now comes forward with outstretched arms and completes their \n               circle, taking the fourth position. McConnell is opposite \n               her glowing form, and Terri and Luke are at either side. The \n               Martian reaches her arms out, inviting them to link hands. \n               As they do so, the Martian seems to be staring directly into \n               McConnell's eyes.\n\n<b>               MCCONNELL\n</b>\n               Is in wondrous awe, his whole face radiant with joy. It's \n               the first time we've ever seen him utterly without sadness \n               or reserve. Staring at the Martian, he understands.\n\n<b>                                     MCCONNELL\n</b>                         They're us. We're them...\n\n<b>                                     LUKE\n</b>                         We're Martians...?\n\n<b>                                     MCCONNELL\n</b>                         That's what she means.\n\n<b>                                     TERRI\n</b>                         Oh my God. The Cambrian explosion.\n\n               McConnell and Luke look at her.\n\n<b>                                     TERRI\n</b>                         Almost six hundred million years \n                         ago, there was a sudden expansion of \n                         life on Earth. The first multi-celled \n                         plants and animals appeared. No one \n                         has ever understood why...\n\n<b>                                     LUKE\n</b>                         They seeded Earth.\n\n               We hear a BELL-LIKE TONE, a single lingering high note, and \n               simultaneously the outermost ring of the circle on the floor \n               begins to glow brightly. It is an intense chromium yellow.\n\n<b>               THE ASTRONAUTS\n</b>\n               Step back, startled, unlinking their hands, and look at the \n               circle of colored rings. These shade from yellow, on the \n               outer rim, to a deeper yellow, then orange, then finally \n               reds. Inside the final, deep red ring is a circle of indigo \n               blue, about a meter across. Small points of light glitter \n               here, like stars against a midnight sky.\n\n<b>               THE MARTIAN\n</b>\n               Steps closer to McConnell. She has picked him out in \n               particular. Now she beckons for him to move inside the circle \n               of colored rings, to stand on the indigo core.\n\n<b>               MCCONNELL\n</b>\n               Looks back at her, nods his understanding. For the first \n               time she seems to smile. Benevolence, reassurance. Then as \n               abruptly as she first appeared, she fades away. Vanishes.\n\n               Luke and Terri look at McConnell, confused. There is a sudden, \n               static-filled CRACKLE from their helmets, nearby on the floor.\n\n<b>                                     PHIL\n</b>                              (over radio)\n                         ...in, please. Can you... me?\n\n               Terri picks up her helmet, leans into its mike.\n\n<b>                                     TERRI\n</b>                         Phil, we're here! We read you.\n\n               Even through the scratchy interference, they can hear the \n               relief in Phil's voice. And then the desperation.\n\n<b>                                     PHIL\n</b>                         Thank God! Listen, this storm is \n                         really --\n                              (loud static)\n                         -- few more minutes, I can't --\n                              (more static)\n                         You've gotta get back to the ship!\n\n               And then they hear only STATIC. His signal is lost.\n\n<b>                                     TERRI\n</b>                         Phil? Phil...?\n\n               Suddenly the BELL-LIKE TONE REPEATS, at a lower register, \n               with a more sustained note, and simultaneously, the last of \n               the yellow circles of light begins to fade, as\n\n<b>               THE FIRST ORANGE BAND\n</b>\n               Begins to glow brighter. McConnell turns, looking at this \n               new color, then looks back at Luke and Terri.\n\n<b>                                     MCCONNELL\n</b>                         We are in a ship. This is a ship. \n                         And the countdown has already started.\n\n               Terri looks at Luke, alarmed.\n\n<b>                                     LUKE\n</b>                         He's right.\n\n<b>                                     TERRI\n</b>                         Then let's get the hell out of here!\n\n               She scoops up Luke's helmet, tosses it to him. As he catches \n               it, she's already starting back out, in the direction they \n               came from, and Luke follows her. Until they both become aware \n               that McConnell isn't with them. They turn back. He's still \n               rooted to the spot, his gaze locked on the indigo core of \n               the colored rings.\n\n<b>                                     LUKE\n</b>                         Jim...\n\n               McConnell doesn't turn.\n\n<b>                                     LUKE\n</b>                         Jim, we gotta go.\n\n<b>                                     MCCONNELL\n</b>                         I'm not coming with you.\n\n<b>                                     TERRI\n</b>                              (stunned)\n                         What?\n\n               Coming back, she sees how calm he is. How certain.\n\n<b>                                     TERRI\n</b>                         What are you talking about? We've \n                         got to get home.\n\n<b>                                     MCCONNELL\n</b>                         That's where I'm going. Don't you \n                         see? That's what all this is for.\n                              (McConnell gestures \n                              at the ship around \n                              them)\n                         You were right Terri. This is an \n                         invitation. To follow them. To follow \n                         them home.\n\n               He looks into their faces. Terri is trying to grasp this \n               idea, still incredulous. Luke has the beginning of a half \n               smile.\n\n<b>                                     MCCONNELL\n</b>                         I have to go. This is the mission \n                         now. To find out who we are. Isn't \n                         that why we came here? Like Maggie \n                         said, \"To stand on a new world and \n                         look beyond it to the next one.\"\n\n               Luke nods at the memory of Maggie's words. Terri remembers \n               too. McConnell's passionate conviction is affecting them \n               both.\n\n<b>                                     MCCONNELL\n</b>                         You know, when you think about it -- \n                         I wasn't even supposed to be here -- \n                         all the accidents, everything that \n                         got us to this point, it's just... \n                         it's just... I just know it's right.\n\n               Terri looks at Luke. Luke is smiling. He understands.\n\n<b>                                     MCCONNELL\n</b>                         I'm okay. I know what I'm doing. But \n                         you're running out of time. You've \n                         gotta get back to the ERV and get \n                         off this planet. Now please go.\n\n               Luke steps closer, looking at his old friend.\n\n<b>                                     LUKE\n</b>                         I once felt like I was taking your \n                         turn. But now I think maybe you're \n                         taking mine. Guess I'm a little \n                         jealous.\n\n               They clasp hands for a moment. But in this moment is a \n               lifetime of camaraderie, an eternity of farewell.\n\n<b>                                     LUKE\n</b>                         Thanks for saving my life.\n\n<b>                                     MCCONNELL\n</b>                         My pleasure.\n\n               Luke nods, deeply moved. He turns away, picking up his helmet, \n               as Terri comes closer, looking at McConnell, a long unspoken \n               beat. Her eyes are glistening.\n\n<b>                                     TERRI\n</b>                         I wish Woody were here to see this. \n                         He would've wanted to go too, Jim.\n\n               Terri smiles. She is starting on the road to recovery. She's \n               going to be okay.\n\n<b>                                     MCCONNELL\n</b>                         He's here, Terri. We wouldn't have \n                         made it without him.\n\n               Terri nods. She digs into one of her suit's pockets, pulls \n               something out. She hands it to McConnell, and his fist closes \n               around it.\n\n<b>                                     TERRI\n</b>                         Take care, Jim.\n\n               McConnell smiles. Terri smiles back at him. Then she turns, \n               picks up her helmet, and crosses to where Luke has paused, \n               looking back.\n\n<b>                                     LUKE\n</b>                         Hey, Jim...?\n\n<b>                                     MCCONNELL\n</b>                         Yeah?\n\n<b>                                     LUKE\n</b>                         Have a great ride.\n\n<b>                                     MCCONNELL\n</b>                         Always do.\n\n               Luke and Terri exchange a final silent farewell with him, \n               then hurry away, into the darkness.\n\n<b>               MCCONNELL\n</b>\n               Looks down at what Terri gave him.\n\n<b>               IT'S WOODY'S NECK CHAIN\n</b>\n               With the little Flash Gordon rocketship.\n\n<b>               MCCONNELL\n</b>\n               Grips this tightly as he looks up.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. MARS. THE FACE. PLAINS OF CYDONIA. NIGHT\n</b>\n               The hanger-like hatch has reopened, and Luke and Terri, \n               helmeted again, emerge from the Face. The leading edge of \n               the dust storm is upon them. They can't see much more than a \n               few meters.\n\n               As they reach the rover, they hear, even in this chaos, that \n               the deep pulsing tone of the Face has started again. They \n               look at each other, uncertain what this means. But McConnell \n               is now beyond their help. Luke keys his mike.\n\n<b>                                     LUKE\n</b>                         Phil? Phil, do you read?\n                              (to Terri)\n                         He's not reading.\n\n<b>                                     TERRI\n</b>                         I can barely read you. Let's get the \n                         hell out of here!\n\n<b>               INT. ERV COCKPIT. NIGHT\n</b>\n<b>                                     PHIL\n</b>                         Is anyone there? Can anyone read me?\n\n               Phil gets no response. He is shaking, almost crying. He \n               hesitates, then starts hitting some keys.\n\n<b>               CLOSE ON HIS COMPUTER DISPLAY\n</b>\n               Which reads: \"PRE-LAUNCH CHECKLIST.\"\n\n<b>               INT. MARTIAN SPACESHIP. NIGHT\n</b>\n               McConnell has shed his backpack, with its unneeded oxygen \n               tank. He steps cautiously onto the colored rings. Nothing \n               seems to happen. Moving further, he takes his place on the \n               indigo circle at their core. He looks at\n\n<b>               THE GLOWING TAKE-OFF COUNTDOWN INDICATOR\n</b>\n               As it dips from orange into red; the BELL TONES are continuous \n               now, very deep and rapid.\n\n<b>               EXT. PLAINS OF CYDONIA. NIGHT\n</b>\n               The rover, with Luke and Terri inside, races away towards \n               the safety of the ERV, as the maelstrom boils over the Face \n               behind them. The sky is purplish black, thick with flying \n               debris and eerie lightning flashes. Towering billows of dust \n               chase them over the plain, nearly enveloping them as they \n               speed towards us, passing OUT OF FRAME.\n\n<b>               INT. MARTIAN SPACESHIP. NIGHT\n</b>\n               McConnell reacts, surprised, as suddenly\n\n<b>               A TRANSPARENT, GLASS-LIKE CYLINDER\n</b>\n               Begins to rise around him, swiftly and smoothly, coming up \n               from the circumference of the indigo circle.\n\n               Then a second, identical cylinder -- the top half -- drops \n               down from somewhere overhead. The two sections meet and fuse \n               in a flash of light, containing McConnell inside them, as \n               neatly as if he were in a giant, transparent mailing tube.\n\n<b>               MCCONNELL\n</b>\n               Fights against a stab of claustrophobia. Is he being \n               imprisoned? Or somehow protected? Either way, he's virtually \n               immobilized. In this tight space in his bulky suit, he can't \n               even move his arms. Only his head and neck can still shift.\n\n<b>               INT. ERV COCKPIT. NIGHT\n</b>\n               Phil is going over his final pre-launch checklist, flipping \n               switches and pressing buttons. He looks at his\n\n<b>               DIGITAL CLOCK\n</b>\n               Which reads \"1350.\"\n\n<b>               PHIL IS STRICKEN, TORMENTED\n</b>\n               His finger hovers over a \"Fire\" button. He licks his lips \n               nervously, squeezes his eyes shut, and hits the button.\n\n<b>               CLOSE ON COMPUTER DISPLAY\n</b>\n               And the words: \"IGNITION SEQUENCE INITIATED\"\n\n<b>               INT. MARTIAN SPACESHIP. NIGHT\n</b>\n               McConnell is straining inside the cylinder that surrounds \n               him, when something catches his attention. He arches his \n               neck, looking down.\n\n<b>               A COBALT-BLUE TRANSPARENT LIQUID\n</b>\n               Is beginning to fill the cylinder! It swirls in, from some \n               unknown source, rising rapidly; already his lower boots are \n               covered.\n\n<b>               MCCONNELL'S EYES\n</b>\n               Widen in alarm. He strains against the sides of the cylinder \n               but\n\n<b>               HIS GLOVED HANDS\n</b>\n               Slide helplessly across the smooth surface.\n\n<b>               MCCONNELL\n</b>\n               Looks down again.\n\n<b>               THE COBALT LIQUID\n</b>\n               Is up to his knees. Now his thighs...\n\n<b>               MCCONNELL\n</b>\n               Cranes his neck, staring up. Can he wedge himself higher, \n               can he somehow climb to safety?\n\n<b>               ABOVE HIM\n</b>\n               The entire \"ceiling\" of the Face is becoming translucent. He \n               can see the dust storm, boiling overhead. And now, rising \n               into this, are fiery coils of energy from the Face itself. \n               These swirl and twist in every direction, like angry water \n               snakes; battered by the fierce winds. Two vast forces on a \n               collision course.\n\n<b>               INT. ROVER. NIGHT\n</b>\n               Luke drives the rover through the blinding storm, as Terri \n               stares at a dashboard computer screen. They have to shout to \n               be heard over the ROARING WIND.\n\n<b>                                     TERRI\n</b>                         I've lost the Base Camp beacon!\n\n               Luke looks over alarmed.\n\n<b>               CLOSE ON A DIAL\n</b>\n               As the needle spins freely, giving no direction whatsoever.\n\n<b>                                     TERRI\n</b>                         No good! We're driving blind.\n\n<b>                                     LUKE\n</b>                         I'll try to keep on a straight line! \n                         It's our only chance.\n\n<b>                                     TERRI\n</b>                         Don't worry! I've worked with Phil \n                         for four years! I know Jim gave him \n                         a direct order, but he won't leave \n                         without us.\n\n<b>               EXT. PLAINS OF CYDONIA. NIGHT\n</b>\n               The Rover races towards us, the front of the storm chasing \n               it from behind, then completely overtaking the Rover. It \n               disappears from view!\n\n<b>               INT. ERV COCKPIT. NIGHT\n</b>\n               Phil sits in the pilot's seat. He is looking at a computer \n               graphic that shows the engines readying to launch. With \n               resignation, he keys his mike.\n\n<b>                                     PHIL\n</b>                         This is ERV, do you read? ERV to \n                         Rover, do you read...?\n\n               Phil waits a second, then reaches slowly for a blinking red \n               switch that reads \"LAUNCH.\" He hesitates, then actually has \n               his fingers on it, about to flip it, when he hears a crackle \n               of static on the radio. Phil keys his mike.\n\n<b>                                     PHIL\n</b>                         This is ERV, do you read?\n\n<b>                                     LUKE\n</b>                              (very faint)\n                         Save the fuel, Phil. We're coming \n                         in.\n\n               And Phil chokes back a sob. Blinking back the tears, he tries \n               to compose himself, then keys his mike.\n\n<b>                                     PHIL\n</b>                         Uh, Phil's not here right now. He \n                         left for Earth five minutes ago. \n                         Please leave your message at the \n                         beep.\n\n<b>               EXT. THE FACE. NIGHT\n</b>\n               FROM GROUND LEVEL we see that the coils of energy are rising \n               from the forehead of the Face, from its \"third eye,\" spinning \n               and looping faster and faster, starting to form a vortex. \n               But unlike the wind vortex that killed the Mars One crew, \n               this is a vortex of fire. As we watch, more fiery streaks \n               begin to emerge from the sides of the Face, from the chin, \n               cheeks and temples. These all rush upwards, like lava flowing \n               uphill, gathering in intensity as they leap free of the Face \n               itself and spiral into the atmosphere. The peak of the forming \n               vortex is already piercing the lowest layer of storm clouds, \n               causing a dark counter-swirl.\n\n<b>               EXT. MARS ONE BASE CAMP. NIGHT\n</b>\n               Phil stands at the bottom of the ERV's ladder, gripping it \n               to steady himself, staring into the swirling dust.\n\n               THE ROVER appears out of the dust and sand, the immense storm \n               seeming to chase it from behind. Luke and Terri climb out, \n               struggle towards him through the wind. Phil grips their hands, \n               helping them over to the ladder. He looks back, confused.\n\n<b>                                     PHIL\n</b>                         Where's Jim?\n\n<b>                                     TERRI\n</b>                         He got another ride.\n\n               Phil stares at her, bewildered.\n\n<b>                                     LUKE\n</b>                         Tell you on the way. Let's go!\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. MARTIAN SHIP. NIGHT\n</b>\n               LOOKING DOWN INTO THE CYLINDER, we see that the cobalt-blue \n               fluid has risen to McConnell's upper chest. Now it's at his \n               shoulders! It pours into his suit through his neck ring.\n\n               He strains on tiptoes, craning his head back, trying to keep \n               his unhelmeted face above the rising liquid.\n\n               He sucks in deep desperate gulps of air, his head thrashing \n               from side to side. Then suddenly the fluid is over his mouth, \n               his nose, his forehead. His whole body is submerged!\n\n               The level of fluid continues to rise towards the unseen top \n               of the cylinder.\n\n<b>               MCCONNELL\n</b>\n               Squeezes his eyes shut, holding his breath. Not so much \n               fighting this anymore as simply floating in place, waiting \n               for his inevitable death...\n\n<b>               EXT. PLAINS OF CYDONIA. NIGHT\n</b>\n               WIDEVIEW FROM ABOVE, as the energy vortex bends from side to \n               side, pushing back the swirling storm that surrounds the \n               Face. As the vortex coalesces its energy into a cylindrical \n               shape, we see through its center to a rising form -- the \n               Martian ship. It is a flattened convex circle whose matte-\n               metallic angles replicate the \"Face\" imagery.\n\n<b>               EXT. PLAINS OF CYDONIA. NIGHT. SIDEVIEW FROM INSIDE THE FACE\n</b>\n               As the Face burns away around us, the Martian ship begins to \n               rise and spin.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. PLAINS OF CYDONIA. NIGHT\n</b>\n               The vortex is now a tight, rapidly spinning cylinder. As it \n               draws more and more power from the disintegrating Face, the \n               Martian ship in its center spins faster and faster.\n\n<b>               INT. MARTIAN SHIP. NIGHT\n</b>\n<b>               MCCONNELL'S FACE\n</b>\n               Is spinning and shaking too, more and more violently, as the \n               huge buildup of G-forces tears at his body. We're reminded \n               of Nick Willis just before the vortex exploded him; is the \n               same thing about to happen to McConnell?\n\n               His eyes remain tightly shut, bubbles are streaming from his \n               lips. His last breath is nearly exhausted, it's being shaken \n               from his lungs.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. MARTIAN SPACESHIP. NIGHT\n</b>\n               As we MOVE IN CLOSER ON HIS FACE, we suddenly see, with him, \n               a SERIES of rapid-fire, almost subliminal IMAGES FROM THE \n               PAST. We recognize each one. Previously, though, we saw them \n               as still photos; now they have movement, life, and we view \n               them from new and slightly different angles. These images \n               INTERCUT with glimpses of McConnell's pale, shaking, near-\n               death face in the present...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               THE YOUNG MCCONNELL\n</b>\n               Under the Christmas tree, lifts his new model rocket from \n               its box. He turns to us, smiling joyfully. A blinding white \n               flash, and he disappears...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               THE TEENAGED MAGGIE\n</b>\n               Is on her porch, under a night sky, bending down to the \n               eyepiece of a TELESCOPE. She looks up at us with a shy, proud \n               smile. A blinding white flash and she's gone...\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               MAGGIE AND MCCONNELL\n</b>\n               In flight suits, holding their helmets, stand on the wing of \n               a fighter jet. The radiant young couple turn to each other, \n               kissing. A blinding white flash and they vanish...\n\n<b>               MAGGIE MCCONNELL\n</b>\n               In an astronaut's pressure suit, drifts rapidly towards us, \n               reeling in along a tether. A man's gloved hand is \n               outstretched, reaching for her. As she grips the hand, we \n               see her triumphant expression through her faceplate. A \n               blinding flash; she's gone...\n\n<b>               MCCONNELL'S FACE - IN THE PRESENT\n</b>\n               Is shaking savagely; he is very near death. And then, all at \n               once, the SHAKING STOPS.\n\n               Time itself seems to stop.\n\n               McConnell opens his eyes, staring STRAIGHT AT US. And then, \n               fully accepting his fate, he throws his head back, opens his \n               mouth and takes in a deep lungful of the fluid. He can breathe \n               it.\n\n               His eyes widen in surprise and understanding. He can breathe \n               it! This fluid will keep him alive! His whole body relaxes, \n               the tension draining from his head and shoulders, as he fully \n               trusts this launch for the first time. And then, with his \n               eyes wide open, he sees, from memory, one final image...\n\n<b>               BRIDAL VEIL IS LIFTED\n</b>\n               And REVEALS, in CLOSEUP, the beautiful face, the shining \n               eyes of MAGGIE McCONNELL. Beatific, eternal. She gazes \n               directly INTO CAMERA, then smiles...\n\n<b>               MCCONNELL\n</b>\n               Smiles back.\n\n<b>               EXT. PLAINS OF CYDONIA. NIGHT\n</b>\n               WIDE VIEW, FROM ABOVE, as the energy vortex changes from red-\n               orange to blue-white. It ROARS with terrifying power as its \n               top starts to bend, angling like a telescope towards a \n               specific point in the stars. Then the Martian ship -- a \n               rounded darker form, little more than a blip within the vast, \n               blue-white column of energy -- shoots away from the surface, \n               leaving only a blacked crater where the Face had been.\n\n<b>               EXT. MARS. HIGH ATMOSPHERE. NIGHT\n</b>\n               ANGLE FROM DEEP SPACE, LOOKING DOWN, as the Martian ship, \n               riding its blue-white column of energy, streaks up into the \n               vast blackness, like a narrowly focused spotlight piercing \n               the night. Down below, we can see the dust storm in all its \n               vastness still boiling orange and brown across the planet's \n               surface, which it now completely covers.\n\n               As the Martian ship flashes by us, it passes another ship, \n               much smaller and slower, rising through the storm clouds on \n               a different trajectory. We recognize the familiar, comfortable \n               sight of the ERV.\n\n<b>               PUSHING IN QUICKLY ON THIS.\n</b>\n               We see three figures in the cockpit.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               INT. ERV COCKPIT. NIGHT\n</b>\n               Luke, Terri and Phil are strapped in, with their acceleration \n               just starting to level off, when suddenly their cockpit \n               interior is starkly bathed in white light. They wince at the \n               unearthly radiance, shielding their faceplates with gloved \n               hands.\n\n<b>                                     TERRI\n</b>                         Dear God. Look at that.\n\n               Through their cockpit window, they watch the Martian ship \n               hurtle by them at a hundred times their speed.\n\n<b>                                     PHIL\n</b>                         Is that him?\n\n               Luke nods. Their eyes are glistening. Luke's voice is a \n               whisper, both of prayer and farewell.\n\n<b>                                     LUKE\n</b>                         Godspeed Jim McConnell.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               OMITTED\n</b>\n               Sequence omitted from original script.\n\n<b>               EXT. SPACE\n</b>\n               Looking through the cockpit window we see the Martian ship \n               receding into the infinite distance of space -- a long blue-\n               white scratch that in moments begins to fade. Finally it is \n               a tiny point of light, taking its place amongst the limitless \n               expanse of the star-filled heavens.\n\n<b>                                         THE END\n</b>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Mission-to-Mars.jpg\"/>\n</td><td><h1>Mission to Mars</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Lowell Cannon\" title=\"Scripts by Lowell Cannon\">Lowell Cannon</a>  <a href=\"/writer.php?w=Jim Thomas\" title=\"Scripts by Jim Thomas\">Jim Thomas</a>  <a href=\"/writer.php?w=John Thomas\" title=\"Scripts by John Thomas\">John Thomas</a>  <a href=\"/writer.php?w=Graham Yost\" title=\"Scripts by Graham Yost\">Graham Yost</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Mission to Mars Script.html#comments\" title=\"Mission to Mars comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:11:49.013641"}