{"title": "Monkeybone", "film_link": "/Movie Scripts/Monkeybone Script.html", "script_link": "/scripts/Monkeybone.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Monkeybone Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Monkeybone.jpg\" title=\"Monkeybone Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Sam Hamm\" title=\"Scripts by Sam Hamm\">Sam Hamm</a><br/>  <a href=\"/writer.php?w=Kaja Blackley\" title=\"Scripts by Kaja Blackley\">Kaja Blackley</a><br/>  <a href=\"/writer.php?w=Vanessa Chong\" title=\"Scripts by Vanessa Chong\">Vanessa Chong</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Animation\" title=\"Animation Scripts\">Animation</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/>\n<b>Script Date</b> : February 1999<br/>\n<b>Movie Release Date</b> : February 2001<br/>\n<br/>\n<a href=\"/scripts/Monkeybone.html\">Read \"Monkeybone\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n\n<b>                               MONKEYBONE\n</b>\n\n\n\n                               Written by\n\n                                Sam Hamm\n\n\n\n                based on the comic book \"Dark Town\" by\n\n                    Kaja Blackley and Vanessa Chong\n\n\n\n\n<b>                                                           SEVENTH DRAFT\n</b><b>                                                         3 FEBRUARY 1999\n</b>\n\n\n\n<b>FADE IN:\n</b>\n<b>MAIN CREDITS ROLL\n</b>\nover BLACK SCREEN, with PORTENTOUS SPOOKY MUSIC underneath. Just as the\nmusic reaches its crescendo, we hear a simian SCREECH.\n\nA BUCK-TOOTHED CARTOON MONKEY swings past on a vine. TITLE WIPES IN with\nhim:\n\n                             MONKEYBONE(tm)\n                                   in\n<b>                            \"FREUD CHICKEN!\"\n</b>\n<b>TIGHT CLOSEUP - STANLEY (ANIMATED)\n</b>\nA POCKETWATCH swings back and forth in F.G. Gaping at it is a goofy,\nbespectacled CARTOON CHARACTER, sucking his thumb as his EYES move back\nand forth. After a moment, the LEFT EYE freezes in place - but the right\neye keeps going back and forth with the watch.\n\n                           SHRINK'S VOICE (o.s.)\n            Back, Stanley...you're going back...back to when\n            it all began. Are you going back yet? Come on,\n            get back, ve haven't got all day.\n\nNow BOTH EYES are locked in place. The patient is hypnotized.\n\n<b>INT. SCHOOLROOM - DAY (ANIMATED)\n</b>\nA squat, lumpy TEACHER, MISS HUDLAPP, is straining to erase the\nGettysburg Address, which is written along the very top of the\nblackboard. There's an obtrusive, rhythmic BANGING noice in B.G.\n\n<b>                           STANLEY (V.O.)\n</b>            It was third grade. The teacher was Miss\n            Hudlapp. She was kinda squat and lumpy - she\n            smelled funny - but she was kind.\n\n<b>                           MISS HUDLAPP\n</b><b>            CLASS!\n</b>                 (turning around suddenly)\n            How many times have I told you? In this class we\n            do not pound tenpenny nails into Stanley's head!\n\n\n<b>REVERSE ANGLE - ON STANLEY\n</b>\nHapless ten-year-old STANLEY, still goofy and bespectacled, in his\nfront-row desk. NAILS stick out of his head. The FOUR MEAN KIDS poised\naround him lower their hammers and return to their seats, grumbling.\n\nA dreamy SMILE crosses STANLEY's face as he gazes at MISS HUDLAPP.\n\n<b>                           STANLEY (V.O.)\n</b>            You know how some teachers have those, kind of,\n            flaps on their arms - those big sacks of limp\n            flab that like, dangle?\n\nAs MISS HUDLAPP pulls her sweater off, TWO MASSIVE ARM-FLAPS - fifty\ngallons of flab apiece - SPILL OUT and SMACK INTO THE FLOOR.\n\nMISS HUDDLAPP claps two erasers together, kicking up a cloud of dust.\nYoung STANLEY watches, transfixed by her massive ARM FLAPS. We TRACK IN\non the gigantic ARM FLAPS as they swing hypnotically back and forth,\nwith a loud SLAP each time they collide.\n\n<b>                           STANLEY (V.O.)\n</b>            It sounds weird...but for some reason, as I\n            watched those big old flaps of hers, I began to\n            feel...well...oddly...\n\nNow we TRACK IN on the mesmerized STANLEY. A SONG comes up underneath:\nDonna Summer, \"I FEEL LOVE.\"\n\n<b>                           STANLEY (V.O.)\n</b>            ...aroused.\n                 (beat)\n            And then the horror began.\n\nDOINK! STANLEY looks down at his LAP in horror. The boys and girls\naround him are pointing and tittering.\n\nGrimacing in embarrassment, he discreetly places a heavy TEXTBOOK onto\nhis lap, suppressing the bulge in his pants. But SPROING!! - the BOOK\ngoes flying across the room. The BULGE is fighting back!\n\nThe kids DUCK AND COVER beneath their desks as STANLEY slams a STACK of\ntextbooks onto his lap. It's no use - the WHOLE STACK goes flying, and\nBOOKS come raining down on the entire class! Now MISS HUDLAPP is staring\ndirectly at him...\n\n<b>                           MISS HUDLAPP\n</b>            Young man. What's that in your lap?\n\nShe marches toward him. STANLEY pulls his BACKPACK over his lap.\n\n<b>                           STANLEY (V.O.)\n</b>            It was useless. Like putting a baseball cap on\n            the Washington Monument. And then...all at once\n            ...there he was.\n\nThe BACKPACK bucks and wriggles, as if something inside is trying to GET\nOUT. And then - with a flourish of rousing disco strings - IT DOES!\n\n<b>                           STANLEY (V.O.)\n</b>            Monkeybone!!\n\nThe libidinous cartoon monkey BURSTS OUT of the backpack, POINTS at MISS\nHUDLAPP - and announces, in his Barry White baritone:\n\n<b>                           MONKEYBONE\n</b>            Oooo-oo-ooh, baby. I love your way.\n\nKC and the SUNSHINE BAND comes up underneath as MONKEYBONE DANCES to the\nfront of the class. He grabs MISS HUDLAPP by the hands and begins\ndancing The Bump with her ARM FLAPS. Butt left, WHAP. Butt right, WHAP.\n\nThe KIDS are bug-eyed - agog. With each WHAP their little heads turn\nback and forth as if they're watching a nude tennis match.\n\n\n<b>INT. SCREENING ROOM - ON AUDIENCE (LIVE-ACTION)\n</b>\nA roomful of LIVE HUMANS watching the cartoon, heads turning in sync\nwith the kids onscreen. TV-INDUSTRY HIPSTERS, AD EXECS, MANUFACTURER'S\nREPS...they're all guests at this sneak preview of the Monkeybone show,\nand they're LAUGHING UPROARIOUSLY.\n\nIn the midst of the crowd is a handsome young couple: JULIE McELROY and\nSTU MILEY. JULIE's a research scientist, brainy, professional,\nabnormally well-adjusted - and pretty enough that she'd be intimidating\nif it weren't for a prominent goofy streak.\n\nSTU is the one guy in the auditorium who isn't laughing at the cartoon\non the screen. In fact, he's solemn as a judge - peering nervously\naround to see how the rest of the audience is responding.\n\nWhy? Because he's the cartoonist who created the characters on screen.\nIn his looks (gangly, disheveled) and manner (sardonic, self-\ndeprecating), he's the obvious model for the character of STANLEY.\n\n<b>INT. CLASSROOM (ANIMATED)\n</b>\nAs the monkey dance continues, we ZOOM IN on the mortified face of\nLITTLE STANLEY. His eyes begin doing the familiar HYPNO-SWIRL...\n\n<b>INT. SHRINK'S OFFICE (ANIMATED)\n</b>\nA CUCKOO pops out of a wall clock. ADULT STANLEY'S THUMB pops out of his\nmouth. He awakens from his trance in a cold sweat.\n\n<b>                           STANLEY\n</b>            How about it, Doc? Can you help me?\n\n<b>                           SHRINK\n</b>            Not overnight. These imaginary monkey cases take\n            time. I vould estimate...roughly...\n\nOn the desk is a CATALOGUE, open to a two-page spread depicting a 40-\nfoot CABIN CRUISER. \"NEW FOR SUMMER! ONLY $229,999.95!\" With his free\nhand, the SHRINK is working a CALCULATOR...\n\n<b>                           SHRINK\n</b>            Twelve years and three months ought to do it.\n\nThe SHRINK hustles STANLEY to the door and shakes his hand.\n\n<b>                           STANLEY\n</b>            One question, doc - what did you mean when you\n            said \"imaginary\"?\n\n<b>                           SHRINK\n</b>            All in good time, my boy. All in good time.\n\nThe SHRINK shoves STANLEY out and slams the door behind him. Two beats.\nThen he doubles over, WEEPING with LAUGHTER.\n\n<b>                           SHRINK\n</b>            Vot a crackpot! Monkey on ze back - HAH!! ROLL\n<b>            OUT ZE WACKY WAGON!!\n</b>\nNow he notices a BACKPACK, which STANLEY has left on the couch. It\nTWITCHES slightly - of its own free will.\n\n<b>                           VOICE IN BACKPACK\n</b>            Imaginary, huh? You quack.\n\n\n<b>EXT. SHRINK'S BUILDING (ANIMATED)\n</b>\nA WINDOW shatters. The SHRINK comes hurtling out. MONKEYBONE STRADDLES\nHIM like Slim Pickens riding an H-bomb, hootin' and hollerin' all the\nway down to the street.\n\nSPLAT! A gob of gore hits STANLEY in the face as he exits the building.\nHe kneels on the sidewalk - finding a PIPE and a GOATEE.\n\n<b>                           STANLEY\n</b>            Aw, Monkeybone! At this rate I'll never find a\n            good shrink.\n\n<b>                           MONKEYBONE\n</b>            Those guys are a waste of money! I'll show you\n            how to stop sucking your thumb...\n\nMONKEYBONE sticks his thumb in his butt as he and STANLEY toddle off\ninto the sunset.\n\n<b>INT. SCREENING ROOM - THAT MOMENT\n</b>\nSTANDING O from the crowd as the cartoon ends and the lights come up.\nHERB, an all-purpose sidekick type, appears at the podium:\n\n<b>                           HERB\n</b>            Thank you...that's our pilot...the good news is,\n            Comedy Channel has just picked us up with an\n            order for six new episodes!\n\nHERB leads a round of APPLAUSE. JULIE nudges STU - the only guy in the\nroom who's still in his seat.\n\n<b>                           HERB\n</b>            Now, let's give it up for the guy who started it\n            all. Creator of America's most disturbed comic\n            strip...the man behind the monkey...Mister Stu\n            Miley!\n\nA SPOTLIGHT hits him, and he STANDS to tumultuous applause. He looks\ngenuinely stunned. He can't believe it's happening.\n\nJULIE surreptitiously PINCHES him on the bottom, giving him a start. She\nWINKS at him. He shoots her a small private smile - then turns to WAVE\nat the adoring crowd.\n\n<b>INT. LOBBY - HALF-HOUR LATER - NIGHT\n</b>\nSTU working his way through a crowd of well-wishers and FANS.\n\n<b>                           STU\n</b>            I don't actually draw all the animation, no. We\n            have sweatshop workers who couldn't get jobs at\n            Nike doing that.\n\nA beautiful, heavily-pierced FEMALE FAN hands STU a marker.\n\n<b>                           BEAUTIFUL FAN\n</b>            Mr. Miley, would you draw Monkeybone on my\n            belly? As a guide?\n\n<b>                           STU\n</b>            Guide...?\n\n<b>                           BEAUTIFUL FAN\n</b>            For my tattoo artist?\n\nShe exposes her taut midriff. STU thinks for a moment, then goes to\nwork. When he's done, Monkeybone appears to be climbing out of the\ngirl's pants and WAVING to her. Nearby FANS APPLAUD.\n\n<b>                           BEAUTIFUL FAN\n</b>            Wait! You have to draw the rest of him -\n\nShe begins unbuckling her belt so STU will have enough room to draw\nMonkeybone's bottom half. STU demurs...\n\n<b>                           STU\n</b>            I - I have to, uh, check in with my doctor. DO-\n<b>            OCCCC!!\n</b>\nHe wanders across the room, finds JULIE deep in conversation with a\nbunch of other GUESTS, and pulls her aside.\n\n<b>                           STU\n</b>            Hey, Doc. Come here. There's something really\n            cool I want to show you.\n\nHe grabs her by the sleeve, pulls her across the floor to -\n\n<b>INT. ALCOVE - OFF LOBBY - CONTINUOUS\n</b>\nThere's nothing \"cool\" about it - it's a stairway landing, with metal\nfire doors that open onto the parking lot outside.\n\n<b>                           STU\n</b>            See these doors? The cool thing is, you go out\n            ...they close...you can't get back in!\n\nHe opens one door and holds it for JULIE.\n\n<b>                           JULIE\n</b>            You want to leave? But Stu - you're a big hit!\n            Everyone loves you!\n\n<b>                           STU\n</b>            They don't love me. They love Monkeybone.\n\n<b>                           JULIE\n</b>            It was you who got the standing O. It was you\n            drawing on the belly over there...\n\n<b>                           STU\n</b>            That was especially Monkeybone. Come on, Doc, I\n            don't want to be stuck here with this bunch of\n            media creeps. I just want to be us. Home. Alone!\n                 (conspiratorially)\n            I have something I have to give you.\n\n<b>                           JULIE\n</b>            Can't you give it to me later?\n\n<b>                           STU\n</b>            Yeah, I could, but the thing is, if later got\n            here sooner, it would be...better.\n\nHe gives up trying to explain...pulls her close and kisses her. For a\nmoment they completely forget about the party in the next room.\n\nThen HERB appears behind them, trying to catch STU's eye as he waits for\nthe clinch to break up. Finally he pries them apart:\n\n<b>                           HERB\n</b>            Sorry, Julie - won't be a minute. Now Stu - I\n            know you don't like the idea, but you really\n            ought to talk to these guys -\n\n<b>                           STU\n</b>            Julie and I - we were just gonna go...\n\nBut before STU knows what's hit him, HERB is leading him back to -\n\n\n<b>INT. LOBBY - THAT MOMENT - CONTINUOUS\n</b>\n<b>                           HERB\n</b>            Go? There's a potload of money here, pal. You\n            got three major toy companies...you got the guys\n            from Burger God over here...\n\n<b>                           STU\n</b>            Burger God. The ones that found the pig hair in\n            the french fries?\n\n<b>                           HERB\n</b>            Never proven. They're ready to pop for a pre-\n            emptive endorsement. Kids love Burger God -\n\nThe MERCHANDISERS shoot STU an expectant wave. STU waves back and turns\nin the opposite direction. HERB grabs him by the sleeve.\n\n<b>                           STU\n</b>            Herb, it's too much. It's all out of hand.\n\n<b>                           HERB\n</b>            Do you know what kind of opportunity you have\n            here? You gotta strike. I'm talking mansions.\n            Lamborghinis. Champagne for mouthwash when you\n            brush your teeth!\n\n<b>                           STU\n</b>            I don't want to be rich. It's just a trap!\n\n<b>                           HERB\n</b>            Being rich is not a trap. That is a dirty lie\n            perpetuated by rich people to keep the failures\n            from killing them.\n\n<b>                           STU\n</b>            Herb. I have to go.\n\n<b>                           HERB\n</b>            Why?\n\n<b>                           STU\n</b>            I got the ring.\n                 (beat)\n            Tonight's the night, Herb. Tonight's the night.\n\nHe nods toward JULIE, who's at the open bar grabbing two glasses of\npunch. HERB realizes a proposal is in the works.\n\n<b>                           HERB\n</b>            Oh my God...you're proposing?\n\n<b>                           STU\n</b>            My life was totally crappy, Herb, and she...\n            fixed it. She made me happy. Which I'd never\n            been. She loves me the way I am - right now.\n                 (beat)\n\n            I don't want everything to change. I don't want\n            her saying yes to some big success. I just want\n            her saying yes to me.\n\n<b>                           HERB\n</b>            ...In some weird way I respect that.\n\nJULIE's over by the punchbowl. She sees the two boys staring at her\nconspiratorially - MAKES A FACE at them as she waves back.\n\n<b>                           HERB\n</b>            Okay then. If I get you out of here - you pop\n            the question - tonight. Or else. Get me?\n\nSTU nods gravely.\n\n<b>EXT. PARKING LOT - NIGHT\n</b>\nSTU, JULIE, and HERB in the parking lot. A small safari of FLUNKIES is\nloading enormous boxes full of MONKEYBONE JUNK into STU's beat-up car -\nstuffed dolls, action figures, board games, lunchboxes, beach towels,\nteam jackets and more! STU groans at the sight of it...\n\n<b>                           HERB\n</b>            They're just prototypes...take 'em home and look\n            at 'em before you say no...\n                 (scanning the streets)\n            If you could just hold on a minute or two, we're\n            expecting a couple more trucks.\n\nSTU GLOWERS at HERB as he opens the car door for JULIE.\n\n<b>                           HERB\n</b>            Okay, okay! You're a beautiful couple. Go.\n\n<b>INT. CAR - NIGHT - MOVING\n</b>\nSTU backs out of his space. The small parking lot is full of DELIVERY\nTRUCKS from would-be merchandisers - all too large for the spaces\nthey're parked in. STU has to keep backing up because the exit lanes are\nblocked. It's like negotiating a labyrinth.\n\n<b>                           STU\n</b>            Look at this! He won't let us leave!\n\n<b>                           JULIE\n</b>            Who?\n\n<b>                           STU\n</b>            The monkey!! He's everywhere! He'll take over\n            both our lives if we let him.\n\n<b>                           JULIE\n</b>            Stu - stop it. That monkey is good luck. You\n            thought him up, and everybody loves him, and\n            he's probably going to make you rich. So relax!\n            Enjoy it!\n\n<b>                           STU\n</b>            I'm trying. It's weird, that's all. I never had\n            any good luck, until I met you...what if it's\n            all just another bad dream?\n\n<b>                           JULIE\n</b>            What's the \"bad\" part?\n\n<b>                           STU\n</b>            I might wake up.\n\n<b>                           JULIE\n</b>                 (laughing; taking his hand)\n\n            If you do, I'll be right there beside you. So\n            face it. You're just going to have to be happy!\n\n<b>                           STU\n</b>            I am happy. It just so happens this is the\n            happiest night of my life.\n\nHe says it so solemnly that she cracks up. After a moment he joins in.\n\n<b>EXT. PARKING LOT - THAT MOMENT - NIGHT\n</b>\nA PLASTIC BANNER stretches between two poles on either side of the entry\nto the lot. It shows MONKEYBONE in a typical languorous pose:\n\n                  It's His World. We Just Live in It!\n<b>                               MONKEYBONE\n</b>                        Sunday Nights This Fall\n\nTWO GUYS on EXTENSION LADDERS are taking the sign down as STU'S CAR\nidles at the exit below. There's a strong wind tonight, and one guy\nLOSES HOLD of his end of the banner just as he gets it detached...\n\n<b>INT. CAR - THAT MOMENT - NIGHT\n</b>\nAs STU pulls into the intersection he sees a DELIVERY TRUCK approaching\nin the opposite lane, with a cardboard likeness of MONKEYBONE mounted\natop the cab. He chuckles...\n\n<b>                           STU\n</b>            That damn monkey is everywh--\n\nSuddenly his view of the street DISAPPEARS. The MONKEYBONE BANNER has\nfallen DIRECTLY ACROSS HIS WINDSHIELD, like a huge SHROUD. All he can\nsee is a great, grinning MONKEY FACE!!\n\nJULIE SCREAMS. STU SCREAMS. Unable to see, he slams on the brakes and\n<b>JERKS THE WHEEL RIGHT.\n</b>\nOff screen: HORNS BLARING. TIRES SQUEALING. The horrible crunch of METAL\n<b>ON METAL.\n</b>\nBut Stu's car comes to a halt untouched. After a moment he opens his\neyes...and JULIE opens hers...\n\n<b>                           STU\n</b>            Did we just - hit something?\n\n<b>                           JULIE\n</b>            I don't think so.\n\n<b>                           STU\n</b>            Are you okay??\n\nShe thinks it over, nods. STU takes a moment to catch his breath, then\nopens the door gingerly. A HORN BLARES as a car speeds past in the\nopposite lane, nearly taking STU's door off. He jumps back inside,\nwaits, opens the door again...\n\n<b>EXT. INTERSECTION - THAT MOMENT\n</b>\nHis eyes widen in horror as he steps out to survey the scene. The\nasphalt is strewn with MONKEYBONE MERCHANDISE - stuffed dolls, games,\nlunchboxes. SKID MARKS show where the TRUCK which was carrying all this\n<b>SWERVED...\n</b>\n...and slammed into the rear of a BUICK REGAL, pinning it up against a\nTELEPHONE POLE. STU races up to the Buick. Its front end is mashed up\nlike an accordion, but the occupants - a couple of TEENAGERS dressed for\nthe prom - seem to be okay.\n\n<b>                           STU\n</b>            Hey! Are you guys all right in there?\n\n<b>                           TEENAGE GIRL\n</b>            We're fine.\n\n<b>                           STU\n</b>            That stupid monkey banner! It fell on my\n            windshield - it practically killed us all!\n                 (to JULIE)\n            God, Julie, if anything had happened to you -\n\n<b>                           JULIE\n</b>            I'm fine, baby. We're all okay. We were lucky.\n\n<b>                           STU\n</b>            I'd better go report this...\n\nHe spots a PHONE BOOTH and starts across the street. On the way there he\nplucks a STUFFED MONKEYBONE DOLL off the pavement and CHOKES IT with\nboth hands.\n\nJULIE stays behind with the prom kids. The TEENAGE BOY in his tux is\nglassy-eyed, miserable beyond description.\n\n<b>                           JULIE\n</b>            Dad's car?\n\nThe BOY begins to SOB softly. JULIE nods in sympathy.\n\nThen: EVERYONE WINCES. The air is full of a horrible CREAKING noise,\nlike nails on a blackboard...\n\n<b>                           TEENAGE GIRL\n</b>            What was that? Did you hear that?\n\nThe horrible CREAKING NOISE continues. JULIE turns. Behind her, the\nTELEPHONE POLE that the car slammed into is beginning to TEETER. Then it\nTOPPLES. Directly toward...\n\n<b>                           JULIE\n</b><b>            STU!!\n</b>\n<b>ON STU - IN PHONE BOOTH\n</b>\nHe sees JULIE running toward him and holds up a single finger.\n\n<b>                           STU\n</b>            Operator? I want to report an accident.\n\nFinally he glances up - just in time to see the TELEPHONE POLE coming\ndown toward the phone booth like a gigantic sledgehammer. His eyes\nwiden. The STUFFED MONKEYBONE slips from his grasp...\n\n<b>CLOSEUP - MONKEYBONE\n</b>\nA HORRIBLE CRASH. SCREAMS. CAMERA ZEROES IN on the MONKEYBONE DOLL which\nSTU was holding, surrounded by broken glass, its face twisted into an\ninsane, almost macabre grin.\n\nThe screen fades to PITCH BLACK for a few seconds...until we hear a\nDISTANT SIREN, and an IMAGE comes swimming into focus...\n\n<b>STU'S POV: ON JULIE\n</b>\nHe's in the back of an ambulance, with PARAMEDICS all around him,\nworking feverishly. JULIE hovers above him, holding his hand.\n\n<b>                           JULIE\n</b>            Stu? I'm here, baby. It's me. It's Julie. I love\n            you. You're gonna be okay, baby, I promise -\n\nAll at once he seems to be RECEDING from JULIE and the others - as if\nSINKING THROUGH the bottom of the stretcher, and BEYOND - through the\nfloor of the ambulance! JULIE's voice grows weaker, more distant:\n\n<b>                           JULIE (V.O.)\n</b>            I'm here, baby. I won't leave you...\n\nAnd then all trace of the ambulance is gone, and he's floating down\nthrough some strange LIMBO, surrounded by the silhouettes of billowing\nSHROUDS, with the sound of BIRDS CALLING all around him...\n\nAn AWFUL MECHANICAL RATCHETING NOISE fills the soundtrack. STU's eyes\nclose - and when they reopen, he finds himself in:\n\n<b>EXT. TROLLEY - MOVING\n</b>\nA tiny ROLLER-COASTER CAR descends from dense clouds down the length of\nan impossibly long and rickety METAL TRACK. The track leads through a\nvast black VOID...\n\n...to a tiny ISLAND floating in the darkness...an island that looks not\nunlike a disembodied FIST.\n\nAnd, as the car draws closer, the fist begins to OPEN - tulip-like -\nturning into a HAND, with a full-sized TOWN nestled in its palm! In the\ntown, CARNIVAL LIGHTS begin to glitter. MUSIC begins to tinkle...\n\n\n<b>EXT. PLATFORM - NIGHT\n</b>\nThe car - a one-passenger job with a CARTOON ANIMAL FACE on its prow -\nstops with a lurch. STU steps out onto a fog-shrouded TRAIN STATION\nPLATFORM. Before he knows it, the little car DEPARTS behind him. He's\nstranded - alone.\n\n<b>                           STU\n</b>            Hello? Anybody? - Am I dead?\n                 (beat)\n<b>            PLEASE. I'D LIKE TO KNOW IF I'M DEAD.\n</b>\nOff in the fog is a big wheeled CART with the sign: \"PSYCHOLOGICAL\nBAGGAGE CLAIM.\" There STU finds two SUITCASES and a BACKPACK. He\nexamines the TAGS. They all belong to him!\n\nHe sits on the edge of the cart, opens a SUITCASE, and pulls out...\n\n - A bagged copy of Marvel Comics' Conan the Barbarian #1;\n\n - An 8mm reel of highlights from Ray Harryhausen's Jason and the\n   Argonauts, with swordfighting skeletons on the box cover;\n\n - A SPIRAL NOTEBOOK, its cover labelled \"STU M. - GEOGRAPHY,\" its\n   inside pages covered with drawings of dinosaurs and airplanes;\n\n - Transparent plastic models of \"THE VISIBLE MAN\" and his mate, \"THE\n   VISIBLE WOMAN,\" with a couple of spare organs that young STU never\n   quite found a place for;\n\n - A vinyl LP of \"BREAD'S GREATEST HITS,\" which STU quickly slips back\n   into the suitcase lest anyone see it.\n\nAs he gathers his bags, he hears odd SQUEAKS and CHITTERING...\n\n                           RACCOON (o.s.)\n            Carry your bags, mister?\n\nA STRANGE FURRY CREATURE pops out from beneath the platform and yanks on\nSTU's pants leg. It looks like a raccoon, but it's FLAT - an animated\npelt. Before STU has time to let out a yell, a FLAT SNAKESKIN comes\nslithering out from beneath the baggage cart...\n\n<b>                           SNAKE\n</b>            Cigars, mister? Genuine Coobans!\n\nSTU looks down and sees a SQUASHED RABBIT humping his leg.\n\n<b>                           RABBIT\n</b>            Wanna meet my sister?\n\nThese bordertown types are known as ROADKILL, and they're sporting the\ntire tracks to prove it. STU SCREAMS, shakes them off, and RUNS.\n\n<b>EXT. DARK TOWN GATES - NIGHT\n</b>\nA long stone STAIRWAY leads to decorative wrought-iron GATES. SHADOWY\nCARVED SPHINXES sit on either side. As STU races up the steps, a\nsputtering NEON SIGN comes to life overhead:\n\n<b>                               D RK TOWN\n</b>\nA FANFARE BLOWS as the creaky gates begin to part. A SPOTLIGHT hits the\nSPHINXES - and they COME TO LIFE! They rise up on their hind legs, put\non boater hats. One of them blows a note on a kazoo...\n\n<b>                           SINGING SPHINXES\n</b>            Weeee...welcome you to Dark Town\n            And while you're in your coma\n            This odd amusement park-town\n            Will be your Home Sweet Homa -\n\nSTU bolts THROUGH THE GATES, with the ROADKILL TRIO right on his heels.\nThe indignant SPHINXES exchange a look of outrage.\n\n<b>EXT. DARK TOWN - MIDWAY - NIGHT\n</b>\nIt's a carny town, a tourist trap, seedy and nightmarish. Despite the\nfestive trappings, there's something off about it - an air of neglect\nand decrepitude - as if they'd tried to turn Alcatraz into Disneyland,\nand given up halfway through.\n\nSTU looks back and sees the ROADKILL gaining on him. He spots a small\ngroup of OTHER HUMANS...\n\n<b>                           STU\n</b>            Help me. Please. There's animals. They -\n\nThe humans just YAWN. They're COMA VICTIMS, just like STU. He ditches\none of his SUITCASES as the ROADKILL come after him.\n\n<b>                           VOICE\n</b>            Pony ride, Mister?\n\nHe turns and spots a helpful-looking fellow in a COWBOY OUTFIT. The\nCOWBOY is in fact a CENTAUR - rider and mount rolled into one!\n\nThe characters who run this place - the BARKERS, TICKET-TAKERS, and RIDE\nOPERATORS - are all weird HYBRIDS, part human, part ANIMAL. They could\nbe the ancient Gods of some primitive culture - reduced to working as\nstreet entertainers in this ramshackle resort town.\n\nSTU pinballs down the street, bouncing from one shock to another:\n\n - JOE CAMEL, doing community service as a STREET SWEEPER -\n\n<b>                           JOE CAMEL\n</b>            Hey, Mister. Mister! Got a smoke?\n\n - a YETI selling SNO-CONES from a cart outside the MORPHEUM THEATRE.\n   The marquee reads:\n\n<b>                        LIVE! NIGHTMARES! LIVE!\n</b>          First-Run - Continuous Performances - Popular Prices\n                Rated NR-H - Not Recommended for Humans\n\n - A CYCLOPS working as a barker at the Penny Arcade;\n\n - A VIDEO RENTAL OUTLET - \"BAD DREAMS VIDEO,\" offering your favorite\n   nightmares, cult and classic, three nights for $2.95. A THREE-HEADED\n   DEVIL emerges from the shop carrying a sackful of videos - and\n   recognizes STU, much to his horror.\n\n<b>                           HEAD #1\n</b>            Hey, aren't you Stu Miley?\n\n<b>                           HEAD #2\n</b>            We're big fans.\n\n<b>                           HEAD #3\n</b>            Could we have your autograph?\n\nReduced to babbling hysteria, STU ducks into the nearest building. Above\nthe door, an ANIMATED NEON SIGN shows a happy boozer lifting his martini\nglass, then falling over flat on his back, at which point his eyes are\nreplaced by the traditional cartoon X's. This is the COMA BAR.\n\n\n<b>INT. COMA BAR - A MOMENT LATER - NIGHT\n</b>\nSTU bursts in, flattens himself against the wall as the ROADKILL skitter\npast outside. He's given them the slip. He looks around.\n\nThe bar's a weird melange of styles. COMA VICTIMS ride around in\nwheelchairs refurbished as BUMPER CARS, drinking cocktails from IV\nbottler. A four-armed ELEPHANT GOD is at the Mighty Wurlitzer while a\nMERMAID VOCALIST in a half-shell belts out the wistful lyrics of Johnny\nMercer's \"DREAM.\" And over at the BAR...\n\n                           BULL (o.s.)\n            New in town, huh? What're you drinking?\n\nOut of breath, STU edges toward the bar as the BARTENDER, BULL, turns\naway to grab a fresh glass.\n\n<b>                           STU\n</b>            Chasing me - animals - horrible -\n\n<b>                           BULL\n</b>            Animals? What kind of animals?\n\nSTU GAGS. BULL is a full-fledged MINOTAUR, body of a man, head of a\nBULL. His features are CUBIST - weirdly squashed over to one side.\n\n<b>                           BULL\n</b>            Yeah, I know - Picasso. Guernica, right? That's\n            what everybody says - although personally, I\n            don't see the resemblance. What are you\n            drinking?\n\n<b>                           STU\n</b>            Uhh - martini?\n\n<b>                           BULL\n</b>            Olive or eyeball?\n\n<b>                           STU\n</b>            Olive. - Where exactly am I?\n\n<b>                           BULL\n</b>            Dark Town. Land of nightmares. I'm Bull.\n\n<b>                           STU\n</b>            Stu Miley.\n\n<b>                           BULL\n</b>            Yeah, I've seen a few of your dreams. You're\n            quite a celebrity down here.\n\nSTU gives him a cockeyed look. BULL points to a MONITOR mounted over the\nbar, on which a panicked man in pajamas is trying to run barefoot\nthrough a great sticky SEA OF MOLASSES.\n\n<b>                           BULL\n</b>            I told you, it's the land of nightmares. Same on\n            every channel...all the stuff people dream,\n            after they have the extra anchovies.\n\nHe changes channels with a remote. Now we see a guy falling through\nmidair, arms and legs flailing, falling, falling, falling...\n\n<b>                           STU\n</b>            Jeez, it all looks like bad late-night cable.\n\n<b>                           BULL\n</b>            Sad commentary, huh?\n\nNow a small muffled VOICE speaks from the area of STU'S BACKPACK:\n\n                           DISEMBODIED VOICE (o.s.)\n            \"Bull,\" huh? That's cute. What's your last name\n            - \"Shit\"??\n\n<b>                           BULL\n</b>                 (turning angrily to STU)\n            I beg your pardon?\n\n<b>                           STU\n</b>            I didn't say anything.\n\n                           VOICE (o.s.)\n            Nice face. Lemme guess. You were in a bullfight\n            ...with a Mack Truck!!\n\nSTU claps both hands over his mouth to prove he's not the one talking.\nBULL glowers at him, snorting STEAM out of both nostrils.\n\n<b>                           STU\n</b>            I was, uh, just getting ready to leave...\n\n<b>                           BULL\n</b>            Yo, Jumbo. We got us some kind of ventriloquist\n            here.\n\nThe ELEPHANT GOD from the Wurlitzer organ comes lumbering over.\n\n                           VOICE (o.s.)\n            Well, hello, sailor. Get a lot of dates with\n            that ding-dong on your face??\n\nBULL and JUMBO rear back to PUNCH STU'S LIGHTS OUT. He's saying his\nprayers when his BACKPACK begins to BULGE and QUIVER - and a SMALL FURRY\nBEAST pops out, CACKLING HIS HEAD OFF!!\n\n<b>                           MONKEYBONE\n</b>            Just kiddin', folks! Drinks for everybody -\n                 (pointing at STU)\n\n            On him!! HIYA, BOSS!!\n\nBULL and JUMBO back off, STUNNED. The monkey grabs STU'S FACE and plants\na big wet SMOOCH right on his NOSE. STU SCREAMS.\n\n<b>                                                     CUT TO:\n</b>\n<b>INT. HOSPITAL ROOM - THAT MOMENT - NIGHT\n</b>\nTIGHT ON an EEG monitor. There's a sudden BLIP on the readout.\n\n<b>                           NURSE\n</b>            Just a spike, ma'am. It happens. It's perfectly\n            natural with coma patients.\n\n<b>                           JULIE\n</b>            I'm a doctor too. I know this man's brain -\n\nJULIE strokes STU's limp hand. He's COMATOSE, cocooned in a tangle of\nwires and tubes. His head and shoulders are heavily bandaged. He's\nhooked up to as much machinery as you can cram into one room.\n\n<b>                           DOCTOR\n</b>            Go home, Doctor. Rest. Come back when you can do\n            us some good.\n\n<b>INT. HOSPITAL - WAITING ROOM - NIGHT\n</b>\nDead on her feet, JULIE stumbles toward the exit. As she's leaving she\npasses the WAITING ROOM -\n\n<b>                           WOMAN'S VOICE\n</b>            Julie?\n\nShe turns and sees an older colleague from work - ALICE - waiting in the\ndoorway. Hovering right behind ALICE is HERB. And behind him -\n\nIt appears that almost everyone in the waiting room is a friend of JULIE\nand STU's. Disheveled and groggy, they rouse themselves and make their\nway over to JULIE's side. She's overcome with emotion.\n\n<b>INT. STU &amp; JULIE'S HOUSE - ENTRY - NIGHT\n</b>\nThe sound of the key in the lock is met by INSANE BARKING. JULIE and\nALICE enter and are met by BUSTER, the pet basset - jumping and yipping\nlike crazy after 24 hours without food or human company.\n\n<b>                           ALICE\n</b>            Now don't pick a fight. I'm staying over.\n\n<b>                           JULIE\n</b>            Oh, poor Buster. He hasn't been fed in a day and\n            a half. Let me get some food...\n\nALICE kneels to play with the dog. She hears a sudden GASP from the\nkitchen. JULIE is standing by the open refrigerator, wearing an\nabsolutely stricken expression...\n\n<b>INT. KITCHEN - THAT MOMENT - NIGHT\n</b>\nALICE finds JULIE holding a bottle of champagne - Veuve Clicquot La\nGrande Dame 1989 - all wrapped up in a bow and ribbon.\n\n<b>                           ALICE\n</b>            Special occasion?\n\n<b>                           JULIE\n</b>            I don't know. I guess it was...\n\nShe bursts into tears. ALICE sits her down at the kitchen table and\ntakes the champagne from her.\n\n<b>                           ALICE\n</b>            Don't get all poignant. We're keeping this\n            bottle on ice. When he comes around you're going\n            to need it.\n\n<b>INT. BATHROOM - LATER - NIGHT\n</b>\nA limp JULIE soaking in a steamy tub, one arm dangling over the side. On\nthe vanity is a framed PHOTO STRIP, four poses for a dollar. In the\nfirst three, STU and JULIE are making outrageously goony faces. In the\nfourth, they imitate the stern-faced farm couple from American Gothic.\n\nShe gazes at it for a long, long time. Eventually she smiles.\n\n<b>INT. SECOND BEDROOM/STUDIO - NIGHT\n</b>\nOPEN on two PHOTOS, mounted in a single frame. On the left, BUSTER\nKEATON, droopy-eyed, in his familiar porkpie hat and vest. On the right,\na Photoshopped image of BUSTER THE BASSETT HOUND, in the same pose, also\nwearing Keaton's hat and vest.\n\nThese photos are on the wall of the cramped room which serves as STU's\nstudio and JULIE's office. MONKEYBONE STRIPS are scattered across the\ndrafting table. ALICE is making up the sofa as a guest bed.\n\nAs she's hanging her coat in the closet she comes across an ACRYLIC\nCANVAS in the back, stashed behind a battered portfolio and a box full\nof spiral-bound sketchbooks. She pulls it out. She's obviously disturbed\nby it, but she can't tear her eyes away...\n\nShe's still gaping at the painting when JULIE enters in a terrycloth\nrobe.\n\n<b>                           ALICE\n</b>            Who did this?\n\n<b>                           JULIE\n</b>            Stu. That was right about the time we met.\n\n<b>                           ALICE\n</b>            When he first came in to the sleep lab?\n\n<b>                           JULIE\n</b>            Yeah...before your time.\n\nThe canvas depicts a group of SURGEONS with the faces of wolves. They're\nstanding over a HUMAN PATIENT, replacing his internal organs with\nMACHINE PARTS. The style is at once cartoony and unsettling.\n\n<b>                           ALICE\n</b>            Jesus, honey...he always joked about you curing\n            him, but I never realized what you cured him\n            from.\n\n<b>                           JULIE\n</b>            He hadn't gotten a good night's sleep in years.\n            The nightmares would wake him up, and he'd start\n            right in painting...\n                 (chuckling)\n\n            That boy looked like pluperfect hell.\n\nALICE's gaze goes from the nightmare paintings to the MONKEYBONE strips\ntacked up over the drafting table.\n\n<b>                           ALICE\n</b>            How do you get from here - to there?\n\n<b>                           JULIE\n</b>            Switch hands.\n\n<b>                           ALICE\n</b>            What?\n\n<b>                           JULIE\n</b>            I'm serious. It was bicameral disjunction -\n            right brain and left brain out of balance. He\n            was a rightie, so I made him switch the pencil\n            to his left hand. Just to see what'd come out.\n\nA smile comes to JULIE's face. She settles in on the floor beside ALICE\nand digs through the various portfolios until she comes up with a\nquickie CARTOON on the back of a napkin - the prototype for...\n\n<b>                           ALICE\n</b>            Monkeybone?\n\n<b>                           JULIE\n</b>            Left-handed, he was funny. He'd been doing all\n            this scary, intense work...then he found out he\n            could draw this stuff, and make me laugh, and he\n            liked that.\n                 (shrugging)\n            And then the nightmares just...stopped.\n\n<b>                           ALICE\n</b>            Wow - two guys in the same brain. - Which one\n            did you fall in love with?\n\nJULIE smiles at the cartoon. She isn't telling.\n\n<b>                           JULIE\n</b>            I've put a ton of work into that boy, Alice. I\n            am not going to let him get away from me.\n\n<b>INT. ICU - MORNING\n</b>\nJULIE, in her white lab coat, wanders through Intensive Care and finds a\nWOMAN hunched over STU's bed, BAWLING HER EYES OUT.\n\n<b>                           JULIE\n</b>            Kimmy...?\n\nKIMMY looks up. She's crying so much she can barely recognize JULIE.\n\n<b>                           KIMMY\n</b>            Oh, Julie...my poor Stu...my poor baby\n            brother...\n\n<b>                           JULIE\n</b>            When'd you get in?\n\n<b>                           KIMMY\n</b>            An hour ago.\n                 (gathering herself)\n            I tried to prepare myself, but I didn't know he\n            would be like, like this. I can't even bear to\n            look at him... How about you? You're okay?\n\n<b>                           JULIE\n</b>            I'm fine, Kimmy. Fine.\n\n<b>                           KIMMY\n</b>            I had so much I always wanted to say to him. At\n            least he had a chance to give you the ring.\n\n<b>                           JULIE\n</b>            The ring...\n\n<b>                           KIMMY\n</b>            Grandmama's ring. The engagement ring. He asked\n            me to send it to him -\n\nJULIE turns to look at STU in the bed. The certain knowledge that he was\nabout to propose is like a knife in her heart. KIMMY feels bad as well,\nhaving let the cat out of the bag, but before they can hash it out -\n\n<b>                           VOICE FROM BEHIND\n</b>            Mrs. Brewster? Julie? I'm Dr. Edelstein.\n\nCheery DR. EDELSTEIN enters. He shakes hands with the women, then checks\nSTU's readouts, making notations on his clipboard.\n\n<b>                           DR. EDELSTEIN\n</b>            Vital signs have stabilized. That's good.\n\n<b>                           KIMMY\n</b>            Can you give us a realistic sense of my\n            brother's chances?\n\n<b>                           DR. EDELSTEIN\n</b>            He's held on this far. We can't do much but wait\n            and see.\n\n<b>                           KIMMY\n</b>            But these...machines are what's keeping him\n            alive, is that right?\n\nThis remark sends a shiver down JULIE's spine, but she keeps silent.\n\n<b>                           DR. EDELSTEIN\n</b>            At the moment, yes.\n\n<b>                           KIMMY\n</b>            Can you give me a realistic idea...of how long\n            this is going to last?\n\n<b>                           DR. EDELSTEIN\n</b>            Comas are unpredictable. He could wake up today,\n            tomorrow, a month from now...\n\n<b>                           KIMMY\n</b>            Honey, I have to clarify this. The thing is, Dr.\n            Edelstein, my brother has an absolute horror of\n            doctors - hospitals - needles - all of it -\n\n<b>                           JULIE\n</b>            Kimmy, he doesn't know what's going on. He\n            doesn't even know he's in a -\n\n<b>                           KIMMY\n</b>            Please, Julie. This is not easy for me. Our\n            father took a long time to die. A long time. It\n            just about killed us all. And Stu and I made a\n            pact that when our time came - we wouldn't let\n            it drag out.\n\n<b>                           JULIE\n</b>            It's too soon even to - talk about that!\n\n<b>                           KIMMY\n</b>            Give me a date, Doctor.\n\n<b>                           DR. EDELSTEIN\n</b>            Three months.\n                 (pause)\n\n            There's always some brain damage. But at three\n            months...the chances of coming back shrink\n            dramatically with every day.\n\n<b>                           KIMMY\n</b>            I want him to have every chance, Doctor. We can\n            certainly give it...three months.\n\nNo one says anything. But both women look at STU, and then at each\nother, and everyone knows exactly where everyone else stands. JULIE has\na sinking feeling that STU is working on a 3-month deadline.\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>INSERT - TELEVISION SCREEN\n</b>\nA beauty pageant - shapely INGENUES in EVENING GOWNS being introduced by\nan EMCEE with enormous teeth.\n\n<b>                           EMCEE\n</b>            And now the last of our five finalists...Miss\n            Michigan...GEORGE T. WILLOUGHBY!\n\nGEORGE is a pudgy shmoe with a small pencil mustache who's wearing\nglasses, a necktie, and NOTHING ELSE. He steps forward, holding a\nbriefcase in front of his crotch, looking EXTREMELY MORTIFIED.\n\n<b>                           EMCEE\n</b>            And now George will give us his analysis of\n            Heisenberg's Uncertainty Principle as it\n            pertains to third-world economics!!\n\nCAMERA PULLS BACK - and we realize we're in:\n\n<b>INT. COMA BAR - NIGHT\n</b>\nwhere BULL the BARTENDER and a number of PATRONS are watching GEORGE's\nnightmare on the TV mounted over the bar.\n\nOnscreen, NUDE GEORGE is sweating bullets. He has no idea what to say,\nand the audience is beginning to laugh at him. In a desperate, feeble\nattempt to buy time...he begins to SING.\n\n<b>                           GEORGE\n</b>            I'm gonna wash that man right outta my hair!\n\nIn fact he goes into a little softshoe, keeping the briefcase poised\nover his crotch. Unfortunately, THE CASE POPS OPEN, dumping frilly\nLINGERIE all over the stage. The weeping GEORGE must crawl around on all\nfours to retrieve it...\n\nBy now the onlookers at the bar are CRACKING UP. All except one - the\nlonely, disconsolate fellow on the last stool, nursing a martini - STU.\n\n<b>                           BULL\n</b>            Hey, Stu, why so glum? Everybody loves a good\n            humiliation nightmare.\n\n<b>                           STU\n</b>            Three months, Bull. Three months tonight. Three\n            months since the accident - and I'm no closer to\n            going home than I was then.\n\n<b>                           BULL\n</b>            Aw, buck up. Have another 'tini.\n\n<b>                           STU\n</b>            I'm sick of martinis. I'm sick of the waiting,\n            and the carnival rides, and watching people's\n            nightmares. And of course, I need not add -\n\nHe GRIMACES at MONKEYBONE, who's stretched out atop the mighty Wurlitzer\nat the other end of the room. The MERMAID CHANTEUSE is singing a\nDietrich number, \"The Laziest Gal in Town\" - or at least trying to,\nbecause MONKEYBONE is caterwauling behind her. By the time she gets to\nthe grand finale, he's practically BAYING AT THE MOON.\n\nPissed off, she SHAKES her FIST at MONKEYBONE and pulls the lid of her\nclamshell SHUT. This suits MONKEYBONE just fine, as it leaves him alone\nin the spotlight to soak up what little applause there is.\n\n<b>                           MONKEYBONE\n</b>            Thank you, thank you for that very modest\n\n            response. I know you're all in comas, but still.\n            And now...it's dedication time!\n\nHe gestures to JUMBO, the elephant organist, who begins to vamp.\n\n<b>                           MONKEYBONE\n</b>            We've got a special dedication tonight. This\n            one's from my ever-lovin' boss, Mr. Stu Mopey -\n            I mean Miley - and we're sendin' it up to\n            a very special lady in the land of the living.\n            Yes, I do mean Julie - the beautiful Miss Julie\n            - who, if she has a brain in her head, is\n            shacked up right now with some good-lookin' doc\n            she met in the E.R.!\n                 (pointing at STU)\n            JUST KIDDING, BUDDY! Because if we know anything\n            about Miss Julie, we know she is faithful,\n            loyal, and true. Even if her boyfriend is an\n            eggplant. Which is why we're dedicating...this\n            very special tune...to her. Jumbo?\n\nJUMBO's tasteful vamping gives way to a RAUNCHY ROCK BEAT - and\nMONKEYBONE begins STRUTTING across the top of the piano, bumping and\ngrinding and shaking his booty to the tune of -\n\n<b>                           MONKEYBONE\n</b>            MAH baby does the Hanky-Panky! UNHH!\n            MAH baby does the Hanky-Panky! UNHH!\n\nMONKEYBONE sings the same poignant line over and over until STU comes\nstorming over from the bar and YANKS HIM off the Wurlitzer by the scruff\nof his scrawny NECK.\n\nA trouper to the end, MONKEYBONE WAVES at the crowd even as STU drags\nhim off to an empty table in the farthest corner of the room.\n\n<b>                           STU\n</b>            You have humiliated me in public for the last\n\n            time.\n\n<b>                           MONKEYBONE\n</b>            I doubt that. Besides, I can't help myself. I'm\n            just a figment of your imagination.\n\n<b>                           STU\n</b>            Then you can learn to act normally. I had to!\n\n<b>                           MONKEYBONE\n</b>            Aw, come on. You know you love me. You're a\n            masochistic pain freak. You gotta love me.\n\n<b>                           STU\n</b>            I am not. And I don't gotta.\n\nMONKEYBONE waves and winks at every female who passes by. STU whacks him\nupside the head.\n\n<b>                           MONKEYBONE\n</b>            You are too! Mooning over Julie when we could\n            both be gettin' some o' this fine local action.\n            It's not like she's gonna know. Out of town,\n            under five minutes, and in a coma don't count.\n\n<b>                           STU\n</b>            Sorry. The women here aren't my type. Most of\n            them aren't even my species.\n\nCocktail waitress KITTY, a seven-foot cat-faced feline sex bomb, arrives\nin her skimpy black dress and shows STU a Cheshire-cat grin. MONKEYBONE\nreclines, Odalisque-style, on the table.\n\n<b>                           MONKEYBONE\n</b>            Hellooooooooo, Kitty.\n\n<b>                           KITTY\n</b>            Hiya, Stu. Refill on that martini?\n\n<b>                           MONKEYBONE\n</b>            I'd like something with an umbrella in it and a\n            really smutty name. Like a...Sex Behind the Sofa\n            with Your Parents in the Same Room Watching \"The\n            Brady Bunch.\"\n\n<b>                           STU\n</b>            Nothing for him! He's being repressed.\n\n<b>                           KITTY\n</b>            Is something wrong, Stu? You seem so tense.\n\n<b>                           MONKEYBONE\n</b>            Aaah, it's the same as always...poor mope's just\n            wishin' he was me.\n\n<b>                           STU\n</b>            I've been trying to get through to the head guy\n            - the nightmare god - what's his name?\n\n<b>                           KITTY\n</b>            Hypnos?\n\n<b>                           STU\n</b>            Yeah. To see if he could expedite my case. But I\n            wait, and I wait, and...I'm starting to think\n            I'll never see her again.\n\nA softie at heart, KITTY sits across from STU and takes his hand.\n\n<b>                           STU\n</b>            I shoulda proposed, Kitty. That way at least\n            she'd know how I feel. That way she'd...wait for\n            me.\n\nShe leans forward sympathetically. From this particular vantage,\nMONKEYBONE has an unobstructed view of KITTY's cleavage. And so does STU\n- although he's not quite as obvious about staring.\n\n<b>                           KITTY\n</b>            She is waiting for you, Stu. I know she is. Guys\n            like you don't come along that often. Believe\n            me, I know.\n\nMONKEYBONE slinks over behind STU - up onto his shoulder - and whispers\ninto his ear:\n\n<b>                           MONKEYBONE\n</b>            My Fellow Americans. I have a dream. Let us\n            boldly go where no man has gone before.\n\n<b>                           STU\n</b>                 (trying to ignore him)\n\n            I'm sorry, Kitty - what were you saying?\n\n<b>                           KITTY\n</b>            I mean it, Stu. You're one in a million.\n\nKITTY is holding the cleavage pose for an unnaturally long time. Her\nfurry tail begins to swing back and forth playfully in the air. It's\nhypnotic - like a windshield wiper.\n\nSTU stares at it. MONKEYBONE stares at it. And MONKEYBONE'S TAIL\nresponds by straightening...stiffening...bending upward slightly.\n\n<b>                           STU\n</b>            I'm not so special. I'm just - kind of -\n\nSTU is suddenly aware of something LONG, RED, and WET unrolling onto his\nshoulder. It's a TONGUE...dangling out of MONKEYBONE'S OPEN MOUTH. STU\nlets out a YOWL OF SHOCK.\n\nBlushing bright red, he GRABS THE TONGUE and shoves it manually back\ninto the monkey mouth whence it came.\n\n<b>                           MONKEYBONE\n</b>            Come on, pal! It was a compliment! You'da done\n            the same if you had the equipment!\n\n<b>                           STU\n</b><b>            THAT DOES IT! BACK IN THE PACK!\n</b>\n<b>                           MONKEYBONE\n</b><b>            FORGET IT! NO WAY! I'M NOT GETTING -\n</b>\nSTU LUNGES at MONKEYBONE - who JUMPS OVER HIM, BOUNDS off the edge of\nthe table, and grabs hold of a CHANDELIER.\n\n<b>                           MONKEYBONE\n</b>            I'm reportin' this to my union!!\n\n<b>                           STU\n</b>            What union?\n\n<b>                           MONKEYBONE\n</b>            The sidekicks' union! Me, Tonto, and Robin the\n            Boy Wonder. You top bananas better watch your\n            ass!\n\nSTU grabs a CHAIR and swings it at the chandelier. MONKEYBONE makes a\nseries of SUBMARINE NOISES -\n\n<b>                           MONKEYBONE\n</b><b>            DIVE! DIVE!!\n</b>\n- and DIVES - directly between KITTY's breasts into her skimpy black\ndress!! STU circles around KITTY, following the undulating monkey-sized\nBLOB that's tunnelling around under her dress. Finally MONKEYBONE pops\nout of the BACK of the dress and NUZZLES KITTY'S EAR:\n\n<b>                           MONKEYBONE\n</b>            I left my phone number in your undies. Try not\n            to lose it in traffic.\n\n<b>                           STU\n</b>            Sorry, Kitty! I'll be right back after I choke\n            my monkey.\n\nMONKEYBONE runs under the pool table. STU is giving chase when -\nsuddenly - a DOOR blows open in the chill night wind.\n\nEVERYONE IN THE BAR freezes in place.\n\nFor there, in the doorway, is a looming, ominous figure - the most\ndreaded figure in all of Dark Town -\n\n- a GRIM REAPER, nine feet tall and swinging a scythe, come to take some\nhapless coma victim to the land of Death!\n\nEERIE WINDS WHISTLE and the shroud FLUTTERS in the night breeze as the\nREAPER looks from face to face. For a moment he focuses on STU. STU\nbacks away involuntarily, with a mounting sense of dread...and\nMONKEYBONE jumps into his arms, clinging to him fearfully.\n\nBut the REAPER moves on - past each COMA VICTIM in turn - finally\nSTOPPING in front of a TINY, WIZENED, PRUNELIKE OLD GENT in a\nwheelchair, who looks to be 110 years old at least.\n\n<b>                           MONKEYBONE\n</b>            Him. Whew. About time!\n\n<b>                           REAPER\n</b><b>            EARL BIEGLER. I'VE COME -\n</b>\n<b>                           EARL\n</b>            Can't hear you, young fellow. Speak up!\n\n<b>                           REAPER\n</b>            EARL BIEGLER, I'VE COME TO GIVE YOU - aw, hell.\n            Here.\n\nGASPS OF ANTICIPATION all around the room as the REAPER hands EARL a\nlong white ENVELOPE. EARL opens it slowly and removes...\n\n...an oversized rectangular TICKET...the size of a Hershey bar, made of\nSOLID GOLD, with the letter \"E\" stamped upon it.\n\nVARIOUS CHARACTERS around the barroom react, in hushed voices:\n\n<b>                           BULL\n</b>            An E-Ticket!\n\n<b>                           PATRON\n</b>            He got a reprieve.\n\n<b>                           KITTY\n</b>            Good for him! He's gonna wake up!\n\nEARL throws his crutches aside, jumps out of his chair, and DANCES A\nJIG, waving the ticket over his head. STU stares at him with naked envy.\n\n<b>                           STU\n</b>            No. No. Not him.\n\n<b>                           EARL\n</b>            So long, suckers! See you in the funny papers!\n\nEARL does an end-zone dance toward the door. One by one, OTHER PATRONS\nget up from their seats to watch EARL's departure.\n\n\n<b>EXT. COMA BAR - STREETS - NIGHT\n</b>\nThe COMA VICTIMS shuffle toward a BIG RIDE across the midway.\n\nIt's a \"TEST YOUR STRENGTH\" machine - the kind where you slam down a\nmallet and try to ring the bell. It's surrounded by crocodile moats and\nstorm fences and electrified barbed wire, and a big sign reading PRIVATE\n<b>- NO ADMITTANCE.\n</b>\nEARL, still jubilant, inserts his E-ticket into a receptacle at the\nentrance. A DRAWBRIDGE LOWERS, and CAROUSEL MUSIC cranks up, and\nCARNIVAL LIGHTS blink on, and FIREWORKS rocket into the sky...\n\nAll around them, faces turn skyward. CLOUDS are parting. An EDDY of\nswirling colors is forming DIRECTLY ABOVE the E-ticket ride - and a\nPINPOINT HOLE opens up at its center.\n\nThe \"TEST YOUR STRENGTH\" machine has been outfitted with a SEAT where\nthe bell-ringer should be. Once EARL has settled in, a GIANT MECHANICAL\nMAN lifts its enormous mallet...\n\n...and SLAMS IT DOWN on the lever end of the machine, sending EARL\nROCKETING UPWARD toward the hole in the sky. DING!! The SEAT hits the\nBELL, but EARL keeps going - up - up - UP...\n\nThen, with a distinct POP, he's gone. Over the rainbow...home.\n\n<b>                           STU\n</b>            He's ninety. He's practically dead already. How\n            come he goes back and I stay here?\n\n<b>                           MONKEYBONE\n</b>            Maybe he wanted to pick out his own casket?\n\n<b>                           STU\n</b>                 (turning abruptly)\n<b>            HEY!! HEY, YOU!!\n</b>\nSTU marches across the street to the GRIM REAPER - who's climbing onto\nhis WINGED BICYCLE and seems shocked that anyone would want to chat with\nhim. MONKEYBONE scurries alongside, terrified.\n\n<b>                           STU\n</b>            He got an E-ticket. Where's mine? When do I get\n\n            to wake up??\n\n<b>                           MONKEYBONE\n</b>            Stu? Stu? Let's not disturb the nice Reaper.\n\n<b>                           STU\n</b>            I've been stuck down here for months. Somebody\n            had better start paying attention, or I'm gonna\n            - I'm gonna kick ass!\n\n<b>                           MONKEYBONE\n</b>            Let's not kick the nice Reaper's ass.\n\nMONKEYBONE practically swoons. But the REAPER just stares at STU:\n\n<b>                           REAPER\n</b><b>            SORRY, BUD. OFF-DUTY.\n</b>\nThe REAPER climbs onto his winged bike and PEDALS OFF down the midway.\nSTU lets out a HOWL OF FRUSTRATION.\n\n<b>                           MONKEYBONE\n</b>            Stu? Stu? Let's calm down, talk things over. How\n            about some comedy relief? Okay. Brontosaurus\n            walks into a gay bar...\n\nSTU BOOTS MONKEYBONE aside. They're at a GAME STALL manned by Elsie the\nCow - the one where you throw baseballs at milk bottles. STU picks up a\nbaseball and HURLS IT at the departing REAPER.\n\nThe ball hits the REAPER smack on the head, knocking him off his bike!\n\n<b>                           STU/MONKEYBONE\n</b>                 (in unison - impressed)\n            Damn.\n\nMONKEYBONE cowers in fear as the REAPER gets up, shaking a fist at them.\nBut STU isn't intimidated. He grabs another ball and winds up.\n\n<b>                           MONKEYBONE\n</b>            Stu? Stu? I think weve got this backwards. Your\n            behavior...is disturbing me.\n\nThe REAPER, scared shitless, jumps back on his bike and PEDALS OFF as\nthe ball whizzes past. STU starts chasing after him!\n\nThe REAPER turns down a side street and pedals up an incline - one of\nthe \"fingers\" of the hand that holds Dark Town. When the bike hits the\nend of the finger, it TAKES OFF into the void and KEEPS ON GOING.\n\n<b>                           STU\n</b>            That's right. Run! And don't come back unless\n            you've got my e-ticket!!\n\nThe REAPER vanishes. STU sits dejectedly on the edge of the curb.\n\n<b>                           STU\n</b>            Who am I kidding? I'm never gonna get out of\n            here. I'll never see her again.\n\nJust then, a multi-armed MESSENGER BOY in royal livery toodles past on a\nCHILD'S SCOOTER. He stops...\n\n<b>                           MESSENGER BOY\n</b>            Miley? Stu Miley?\n\nSTU looks up. Six arms reach into six pockets. Finally the MESSENGER\nfinds an ENVELOPE and hands it over. Inside is an ENGRAVED INVITATION:\n\n                          YOU Are Invited to a\n<b>                              PAJAMA PARTY\n</b>                          at HYPNOS' HIDEAWAY\n                     Penthouse Suite - 10 PM Sharp\n                       \"If You Snooze, You Lose\"\n\nSTU'S EYES widen with excitement as the MESSENGER scoots off.\n\n<b>                           STU\n</b>            Hypnos! The god of nightmares! Do you know what\n            this means, Monkeybone? He's finally going to\n            hear my case. I'm going home!\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>INT. STU'S PRIVATE ROOM - MORNING\n</b>\nAs she's done every morning for the last three months, JULIE brushes\nSTU'S TEETH. Although she looks a bit more worn and haggard than when we\nsaw her last, she always affects a cheerful manner around STU - on the\noff chance that he might be aware of her presence.\n\nShe packs the toothbrush away, runs a hand along his stubbly cheek.\n\n<b>                           JULIE\n</b>            I think we can go another day without shaving.\n            Long as you don't look like you're growing one\n            of those stupid little goatees.\n\nShe opens up the entertainment section of the daily newspaper.\n\n<b>                           JULIE\n</b>            Hey, there's an article about the Monkeybone\n            show. They've run that one episode about eight\n            times now. Herb says it gets higher ratings\n            every time...they're hoping you'll give 'em some\n            new material soon...\n                 (long, bored pause)\n            Wanna hear another joke?\n\nShe refolds the paper and reaches into a bedside drawer for a paperback\nentitled The Book of Raunch. She pages through it for a moment.\n\n<b>                           JULIE\n</b>            Okay...let me see...here we go. A plane full of\n            explorers crashlands in New Guinea; they are\n            captured by a cannibal tribe and taken to the\n            chief's hut, where...wait a minute. I know this\n            one...\n                 (reading ahead)\n\n            You stinker! You swiped this joke for a\n            Monkeybone strip!\n\nShe whacks him on the arm with the book. No response at all.\n\n<b>                           JULIE\n</b>            Okay. Let's try again. Why did the pervert cross\n            the road?\n\nThe sound of SOBBING interrupts her joke. She looks up and sees KIMMY\nstanding in the doorway, red-eyed and crying.\n\n<b>                           JULIE\n</b>            Kimmy! What's the matter?\n\n<b>                           KIMMY\n</b>            This is hard for me, Julie...very hard...but\n            it's been three months now, and...\n                 (long pause)\n            I gave the order.\n\nJULIE just stares at her for a beat or two, refusing to understand. Then\nit sinks in. Her hand goes to her mouth in horror and grief.\n\n<b>                                            FADE THROUGH TO:\n</b>\n<b>EXT. HYPNOSPIRE - ESTABLISHING - NIGHT\n</b>\nCAMERA TRACKS up the seemingly endless length of the HYPNOSPIRE - up,\nup, THROUGH a heavy layer of clouds, to the ROTATING PENTHOUSE DOME of\nthe building...\n\n...which is festooned with oodles of 18-INCH DSS SATELLITE DISHES.\n\n<b>INT. HYP'S HIDEAWAY - NIGHT\n</b>\nELEVATOR DOORS open, and we glide into the swank, swingin', space-age\nbachelor pad of HYPNOS, God of Sleep. A giant flying CUPID welcomes us,\ntiny bumblebee wings somehow keeping his vast bulk aloft.\n\nHYP'S HIDEAWAY occupies the entire penthouse floor, and there's always a\nparty in full effect. A rotating disco ball flashes colored light on\nwalls, floors, and ceilings covered with shockadelic OP-ART PATTERNS.\n\n<b>                           MONKEYBONE\n</b>            Now this...is livin'.\n\nOf course, a party needs party animals - and the DARKTOWNERS on the\nscene are in fine fettle, working up a sweat on the dance floor. DJ\nSLEEPY ZZZ'S has three turntables spinning at once.\n\nAs STU wanders through, he gets a big surprise. Reproductions of his old\nNIGHTMARE PAINTINGS are hanging on the walls! They've been turned into\nONE-SHEETS for the coming attractions at the Morpheum.\n\n<b>                           MONKEYBONE\n</b>            Y'call that art? Why, my three-year-old can\n            paint better than that.\n\n<b>                           STU\n</b>            Like you'd know. You started out on the back of\n            a napkin, you little...doodle.\n\nScowling at each other, the boys turn their backs and part ways. We\nfollow MONKEYBONE to the wet bar, where he almost immediately bumps into\na statuesque GORGON with a full head of writhing SNAKES.\n\n<b>                           MONKEYBONE\n</b>            Hey! Like the do. So tell me, are you a, uhh...\n            natural snakehead?\n\n<b>                           GORGON\n</b>            Only fifty dollars to find out.\n\n<b>                           MONKEYBONE\n</b>            Fifty dollars?! Bite me!\n\n<b>                           GORGON\n</b>            You got it, big boy.\n\nHe grins and shrugs: what the hell. As they head for a back room, the\nBARTENDER hands him a SNAKEBITE KIT.\n\nA look of apprehension crosses MONKEYBONE's face. But before he can\nchange his mind, the GORGON'S HAND yanks him out of frame.\n\nSTU, meanwhile, is crossing the dance floor, moving among glittering\nanimal-people who DANCE in their bizarre, uninhibited way. A FIVE-LEGGED\nWOMAN - the bottom half of her body a big human HAND - SMILES at STU as\nhe passes. He tries to talk to her, but she's dancing, and with five\nconstantly moving legs it's difficult to get in close.\n\n<b>                           STU\n</b>            Say, have you seen Mr. Hypnos?\n\n<b>                           HAND WOMAN\n</b>            Hyp? He was here a while ago. Aren't you Stu\n            Miley? The nightmare guy?\n\nSTU grins meekly, nods yes. She pulls him over to dance.\n\n<b>                           HAND WOMAN\n</b>            I heard you were going to be here tonight. This\n            is so cool!\n\nJUMBO the ELEPHANT GOD is dancing in ungainly fashion nearby. His trunk\nswings out and hits one of the HAND WOMAN'S arms - which SNAPS OFF like\nmarble statuary. Before she can let out a squeal, he does it again. Now\nshe's armless - a regular Venus de Milo!\n\n<b>                           HAND WOMAN\n</b>            You fat slob! Watch what you're doing!\n\n<b>                           JUMBO\n</b>            Why don't you slap me? Go on, slap me!\n\n<b>                           HAND WOMAN\n</b>            Come on, Stu. Let's go where the real fun is.\n\nShe leads him over to the sunken living room. Among the other guests, we\nsee a CYCLOPS, a YETI, a BBQ PIG. A number of sofas and lounge chairs\nare arranged around a big crystal ORB in the center of the room.\n\nThe ORB is where nightmares happen. Although the perspective shifts and\nthe locales change abruptly, as in a movie, all the nightmares have a\n3-D quality - as if they're taking place right here in the room with us!\n\n<b>                           STU\n</b>            Wow. Live feed, huh?\n\n<b>                           HAND WOMAN\n</b>            You bet. Hyp gets all the best stuff before it\n            goes out to the theatres.\n\nSTU grins in anticipation. He finds an empty chair and starts to sit\ndown - but there's a SLUG with a MAN'S HEAD already in it!\n\n<b>                           SLUG WITH A MAN'S HEAD\n</b><b>            HEY!\n</b>\n<b>                           STU\n</b>            Sorry.\n\nSTU picks another seat. The HAND WOMAN sidles up alongside him.\n\n<b>                           HAND WOMAN\n</b>            Shh! There's a new one just starting.\n\n\n<b>EXT. FIELD OF FLOWERS (NIGHTMARE ORB)\n</b>\nIn long shot we see a handsome young couple dressed in paisley prints.\nEmerging from a sylvan glade, they kiss in golden sunlight. Then the MAN\nbreaks free - sprints through knee-high sunflowers to the middle of the\nfield, where a picnic blanket is waiting.\n\n<b>CLOSEUP - STU\n</b>\nHIS FACE GOES PALE as he recognizes the man in the paisley shirt.\n\n<b>                           STU\n</b>            That - that's me.\n\n<b>                           CYCLOPS\n</b>            Nice shirt, dude!\n\n<b>EXT. FIELD OF FLOWERS (NIGHTMARE ORB) - DAY\n</b>\nPaisley-shirted STU pours champagne for two. Toasts his beloved - who\nis, of course, JULIE, the dreamer of the dream.\n\nHe pulls out a little velvet RING BOX and offers it to her. But when she\ntries to take it, he pulls it away, teasing her, and STEALS A KISS.\n\nSuddenly the two of them are locked in a tight embrace, rolling together\nthrough the flowers, LAUGHING, full of joy.\n\n<b>INT. HYP'S HIDEAWAY - THAT MOMENT\n</b>\nThe DARKTOWNERS are rubbing their hands together in anticipation of\nhorrors to come. STU looks from one misshapen face to the next, his\nheart pounding with dread.\n\n<b>                           STU\n</b>            What is this? Who's dreaming this??\n                 (beat)\n            Julie??\n\n<b>                           YETI\n</b>            Hey, keep it down!\n\n<b>EXT. FIELD OF FLOWERS (NIGHTMARE ORB) - DAY\n</b>\nJULIE rolls onto her back on the grass, FACE AGLOW. Only to realize...\nthat STU IS NO LONGER THERE BESIDE HER.\n\nShe looks around. Gets to her feet. Turns. And the BACKGROUND behind her\nMORPHS suddenly into...\n\n<b>INT. HOSPITAL ROOM (NIGHTMARE ORB)\n</b>\nThe room is decorated for a FAREWELL PARTY, complete with streamers and\nconfetti. KIMMY, DR. EDELSTEIN, various MEDICAL PERSONNEL and FRIENDS\nare wearing party hats, lifting champagne glasses in a toast to the\nguest of honor...the comatose Stu!\n\n<b>INT. HYP'S HIDEAWAY - THAT MOMENT\n</b>\nThe DARKTOWNERS clustered around the orb can barely conceal their animal\nexcitement. It's obvious that the nightmares they're watching are more\nthan mere entertainment - they get some kind of addictive, visceral\ncharge from the spectacle of human terror.\n\n<b>                           STU\n</b><b>            JULIE!!\n</b>\nHe tries to push his way forward to the orb. An angry CYCLOPS elbows him\naside. A YETI grabs his coat and pushes him out of the way.\n\n<b>                           HAND WOMAN\n</b>            Stu!! What are you doing? Chill out!!\n\n<b>INT. HOSPITAL ROOM (NIGHTMARE ORB)\n</b>\nCOMATOSE STU stands in the center of the room, UPRIGHT and IMMOBILE in a\nparty hat. A weird UMBILICAL CORD extends from his navel to a huge\ngroaning BELLOWS DEVICE - like an artificial lung, it's all that keeps\nhim breathing.\n\nEDELSTEIN hands a pair of OVERSIZED CEREMONIAL SCISSORS to KIMMY, and\nshe CUTS THE CORD, as if opening a new mall. Applause all around. JULIE\nraces toward STU in slo-mo, SHRIEKING -\n\n- as he DEFLATES into a LIMP PUDDLE OF FLESH before her eyes!!\n\n<b>                           JULIE\n</b>            No. No. STU!\n\n<b>INT. HYP'S HIDEAWAY - ON STU\n</b>\nJULIE's distress is killing him. Yet all around him, DARKTOWNERS are\ncackling their heads off, growling, howling, punching their fists in the\nair like rowdy drunks at a football game. He LOSES IT ALTOGETHER.\n\n<b>                           STU\n</b><b>            JULIE! I'M HERE, DOC! DON'T LET THEM PULL THE\n</b><b>            PLUG! I'M HERE!!!\n</b>\nHe won't be stopped this time. He makes for the orb - climbing over\nsofas, pushing guests aside, knocking over their drinks -\n\n<b>                           CYCLOPS\n</b>            HEY! Watch it, you stinkin' gringo -\n\n<b>                           STU\n</b><b>            JULIE! I'M HERE! I LOVE YOU!\n</b>\nSomehow, JULIE has heard him!! Down in the nightmare orb, her dream self\nis looking UP, trying to locate the source of STU's disembodied voice!\nHe struggles to reach the orb, but the CYCLOPS is holding him back.\n\n<b>                           JULIE\n</b>            Stu? STU...?\n\nSTU breaks free and FLINGS HIMSELF on the ORB - which SHORTS OUT in a\nhaze of smoke and sparks, abruptly ending the nightmare. JULIE's image\nvanishes - and STU gropes at the air, DESPAIRING.\n\n<b>INT. STU'S PRIVATE ROOM - NIGHT\n</b>\nThe real JULIE awakens suddenly and lets out a scream of her own.\n\n<b>                           JULIE\n</b><b>            STU!!!!\n</b>\nOnly now does she realize where she is. She's fallen asleep in the\nvisitor's chair next to STU's bed. The clock on the wall reads 1:15 AM.\n\nSTU'S READOUTS are spiking like crazy.\n\n<b>INT. HYP'S HIDEAWAY - THAT MOMENT - NIGHT\n</b>\nSTU is being dragged across the dance floor by the YETI and JUMBO THE\nELEPHANT GOD. HAND WOMAN brings up the rear.\n\n<b>                           JUMBO\n</b>            Who invited this schmuck, anyway?\n\n<b>                           HAND WOMAN\n</b>            Oh, it's my fault. I thought he was cooler than\n            that.\n\n<b>                           STU\n</b>            Listen. Please. It's my girlfriend. I've gotta\n            get a message to her...\n\nBut just then a hush falls over the room, and someone screams...\n\n<b>                           WOMAN'S VOICE\n</b><b>            HYP!!!\n</b>\nA WALL PANEL does a 180-degree turn, and a CIRCULAR BED rotates into the\nroom. Languishing atop it, garbed in a silk robe which exactly matches\nthe black &amp; white checkerboard pattern of the bedspread...\n\n...is a CHUBBY, GRINNING, SLEEPY-EYED SATYR, with horns and hooves. TWO\nWASP WOMEN are with him on the bed, brushing his furry goat legs and\nfeeding him grapes.\n\nAs STU fights his way over, he sees an odd LUMP wriggling under the\nbedcovers. Out pops MONKEYBONE, clutching a bottle of champagne!\n\n<b>                           MONKEYBONE\n</b>            I knew I left it in there somewhere.\n\nHe shakes the bottle, pops the cork, and SPRAYS SPURTING BUBBLY at\nHYPNOS, the GIRLS, and everyone else within firing range!\n\n<b>                           HYPNOS\n</b>            Haw! I like a monkey with vision!\n\n<b>                           MONKEYBONE\n</b>            You said it, partner!\n\nHilarity all around. STU snatches MONKEYBONE off the bed -\n\n<b>                           STU\n</b>            How'd you get in there?\n\n<b>                           MONKEYBONE\n</b>            Stu... It's a party.\n\n<b>                           STU\n</b>            Mr. Hypnos - sir - I needed to talk to you -\n\n<b>                           HYPNOS\n</b>            Wait a minute. Stu Miley, right? Boys and girls\n            ...Mr. Stu Miley, in the house!\n                 (leading a round of applause)\n\n            This is an honor. We see a lot of nightmares\n            down here, but yours are like caviar, man. You\n            da shits!!\n\n<b>                           STU\n</b>            Mr. Hypnos, I saw a dream. My girlfriend was\n            having it. She dreamed they were pulling the\n            plug on me. She was watching me die.\n\n<b>                           HYPNOS\n</b>            Uh huh. And?\n\n<b>                           STU\n</b>            Well, I have to get a message to her. I have to\n            let her know I'm okay. Until I can get out of\n            here...\n\nA vaguely embarrassed look crosses HYPNOS's face. All the nearby\nDARKTOWNERS stare at their shoes, clear their throats.\n\n<b>                           STU\n</b>            ...which is actually what I wanted to talk to\n            you about. See, I've been here three months -\n\nWith a brusque gesture, HYPNOS sends the party girls packing. He slings\none arm around STU's shoulder and pulls him aside.\n\n<b>                           HYPNOS\n</b>            Kid - didn't they tell you about this party?\n\n<b>                           STU\n</b>            Tell me what?\n\n<b>                           HYPNOS\n</b>            It's a special kind of party. A farewell party.\n            Do you...get what I'm saying?\n\n<b>                           STU\n</b>            Farewell? You mean - you mean I'm -\n\nSTU EXPLODES WITH JOY. He practically dances a jig.\n\n<b>                           STU\n</b><b>            I'M GOING HOME! I'M WAKING UP! HEY, EVERYBODY!\n</b><b>            I'M OUTTA HERE. I...\n</b>\nOne by one, the celebrants turn their backs and slink discreetly away.\n\n<b>                           STU\n</b>            I think I...I'm about to... Am I mistaken, or\n            don't I get to... Is there some...\n\n<b>                           HYPNOS\n</b>            Y'see, Stu, as I understand it, you made this\n            pact with your sister...no life support?\n\nMONKEYBONE's jaw drops. He slaps himself across the forehead.\n\n<b>                           MONKEYBONE\n</b>            Pact? Pact? NO LIFE SUPPORT??\n\n<b>                           STU\n</b>            Well - yeah - but that doesn't...apply. It was\n            different then. I was depressed. My life is\n            great now. I'm in love!\n\nMONKEYBONE marches back and forth across the bed, wearing a dimwit's\nexpression as he MOCKS STU in a singsongy voice...\n\n<b>                           MONKEYBONE\n</b>            Pull the plug! Pull the plug! Take my organs! I\n            don't need 'em! I don't need no! Life support!\n            I'm an idiot! Pull the pl--\n\nSTU grabs the monkey and clamps a hand over his mouth.\n\n<b>                           STU\n</b>            Besides, Julie wouldn't...she'd never...\n\n<b>                           HYPNOS\n</b>            Actually, Stu, Julie doesn't get to decide.\n            That's why she was having the nightmare.\n                 (an embarrassed shrug)\n\n            They're pulling the plug at nine AM.\n\n<b>                           STU\n</b>            Nine AM! But that's - twelve hours.\n\nIn checking his watch, STU removes his hand from MONKEYBONE's mouth. The\nsingsong resumes...\n\n<b>                           MONKEYBONE\n</b>            I'm so dumb! I deserve to die -\n\n<b>                           STU\n</b>            Mr. Hypnos, you run this place. I'm begging you.\n            There's gotta be something I can do.\n\n<b>                           HYPNOS\n</b>            Stu, I like you personally, I admire your work,\n            but I'm just the God of Sleep. This is Death's\n            bailiwick.\n\n<b>                           STU\n</b>            Maybe you could talk to Death!\n\n<b>                           HYPNOS\n</b>            Me? Me, go crawling to Death? My friend, it will\n            be a cold, cold day in Las Vegas, Nevada, before\n            I go crawling to that piece of -\n\nHYP shuts up. Looks around the room, as if he's afraid of being\noverheard. Then he gestures to the boys to join him on the bed.\n\nThey climb aboard eagerly. HYPNOS hits his remote...\n\n<b>INT. HYPNOS'S BEDROOM - ON BED\n</b>\n...and they rotate AWAY from the party. Privacy at last.\n\n<b>                           HYPNOS\n</b>            Now Death is not what you would call a people\n            person, like me. Death is a putz - and I should\n            know. I'm his little brother.\n\n<b>                           STU\n</b>            You're Death's brother?\n\n<b>                           HYPNOS\n</b>            Oh yeah. Mr. By-the-book, Stick-Up-the-Ass, My-\n            Way-or-the-Highway Death. Believe me - over the\n            course of eternity, you get pretty damned tired\n            of that schtick.\n                 (spreading his hands)\n\n            So I need a job. He sticks me in this broke-down\n            amusement park, with a buncha animals to run it.\n            I'm supposed to be grateful?\n\n<b>                           MONKEYBONE\n</b>            The penthouse is pretty swank, though.\n\n<b>                           HYPNOS\n</b>            Thank you. I decorated it myself.\n\n<b>                           STU\n</b>            Guys, I don't mean to be rude, but I only have\n            eleven hours and fifty-three minutes to...\n\n<b>                           HYPNOS\n</b>            Oh, right. Cheating Death. There's one thing you\n            might try. Only one guy in history ever pulled\n            it off. Well, actually two. Actually, no, there\n            was that other guy who...well, very few people\n            have done it.\n\n<b>                           STU\n</b>            Hyp, I'll do anything.\n\n<b>                           MONKEYBONE\n</b>            Me too. And I mean anything. Ask the chicks in\n            the back room.\n\n<b>                           HYPNOS\n</b>            You've seen those E-tickets, right? Well, what\n            you gotta do...is go into the Land of Death...\n            and steal an E-ticket right out from under\n            Death's nose.\n\n<b>                           STU\n</b>            Land of Death. How do I get there?\n\n<b>                           HYPNOS\n</b>            Kid, listen: that's all I'm saying. And you\n            didn't hear it from me.\n\nHYP hits the remote. The bed begins to ROTATE OUTWARD again.\n\n<b>                           HYPNOS\n</b>            You've heard of a fate worse than Death? That's\n            what's waiting for you if you screw up.\n\n<b>INT. HYP'S HIDEAWAY - A MOMENT LATER\n</b>\nHYP gives the boys a wink and a thumbs-up, then wanders off to shmooze\nhis other guests. MONKEYBONE shakes STU's hand.\n\n<b>                           MONKEYBONE\n</b>            Fate worse than death! Well, it's been real,\n            boss, but I gotta go buff up my resumé. ANYBODY\n<b>            HERE NEED A FIGMENT?\n</b>\n<b>                           STU\n</b>            Fine! Don't put yourself out. I'll go to the\n            land of Death alone.\n\n<b>                           MONKEYBONE\n</b>            Stu, you have my absolute confidence. ­- DEAD\n<b>            MAN! DEAD MAN WALKING!!\n</b>\n<b>                           STU\n</b>                 (grabbing him by the throat)\n            I've got one chance to get back to Julie, and\n            I'm gonna take it - with or without you.\n\nHe turns and stalks off. MONKEYBONE stands there blinking.\n\n<b>                           MONKEYBONE\n</b>            Hey. Aren't you gonna talk me into it?\n\n<b>                           STU\n</b>            No. Goodbye. Thanks for nothing.\n\nStunned, MONKEYBONE scurries along behind him, PLEADING.\n\n<b>                           MONKEYBONE\n</b>            You gotta talk me into it. You'll screw up on\n            your own. I mean, a guy's gotta have a sidekick.\n            For moral support! Wisecracks - snappy banter -\n                 (wrapping himself around STU's leg)\n            It's the land of Death, Stu, the Land of Death!\n            Don't go in there without your comedy relief!!\n\n<b>                           STU\n</b>            All right. You can come.\n\n<b>                           MONKEYBONE\n</b><b>            OH, THANK YOU! THANK YOU! TH--\n</b>                 (suddenly realizing)\n            Something went very, very wrong here.\n\n<b>                           STU\n</b>            Now we just gotta figure out how to get there.\n\nAs if in reply, a PALE, SPECTRAL PRESENCE comes drifting across the\ndance floor - an eight-foot-tall GRIM REAPER.\n\nThe boys duck behind a POTTED PLANT to watch as he zeroes in on the WET\nBAR - where a beautiful coma victim, LULU, is drunkenly making out with\nanother sloshed corpse-to-be, FRED.\n\n<b>                           REAPER\n</b><b>            LULU LA RUE. I HAVE COME FOR YOU.\n</b>\nLULU doesn't notice. She continues grappling with FRED. Muttering, the\nREAPER dives in and tries to disentangle them.\n\n<b>                           REAPER\n</b><b>            LULU LA RUE, I HAVE COME FOR -\n</b>\n<b>                           LULU\n</b>            Shay, you're kinda cute.\n\nShe ditches FRED and throws her arms around the REAPER. Repulsed, he\npushes her away, props her against the nearest wall -\n\n- and TOUCHES HER with one bony finger above the heart! It's like\nthrowing a switch. Her body stiffens. Her EYES cross. Her TONGUE droops\nout of her mouth. She makes a noise like a DIAL TONE.\n\nThe true horror of death is that it makes you look like a total idiot.\nThe REAPER pulls a collapsible HAND TRUCK from beneath his shroud and\nstarts maneuvering LULU onto it.\n\n<b>                           FRED\n</b>            Say there. How 'bout one for the road?\n\nThe REAPER ignores him. FRED holds up a cocktail glass.\n\n<b>                           FRED\n</b>            Hold this for me, pally.\n\nThe REAPER heaves a sigh and takes the cocktail glass. FRED grabs a\npitcher filled with some luminescent tropical concoction...\n\n...and POURS IT down the REAPER's front!\n\n<b>                           FRED\n</b>            Ooopsy daisy.\n\n\n<b>ON STU AND MONKEYBONE - BEHIND THE PLANT\n</b>\nWINCING at the REAPER in his sopping wet, pink-stained shroud.\n\n<b>                           MONKEYBONE\n</b>            Is that what they call \"death with dignity\"?\n\nThe REAPER wrings out his shroud and grabs the hand truck. As he wheels\nLULU past the boys, MONKEYBONE pops up with a helpful hint:\n\n<b>                           MONKEYBONE\n</b>            Two words for you, my friend: club soda.\n\nSTU claps a hand over MB's mouth as the REAPER turns down a hall.\n\n<b>EXT. DARK TOWN GATES - NIGHT\n</b>\nThe still-muttering REAPER wheels LULU toward the entrance to Dark Town.\nThe boys are skulking along behind him at a discreet distance.\n\n<b>                           STU\n</b>            He's taking her to the land of Death, right? So\n            all we've gotta do is...hitch a ride!\n                 (beat)\n            Stop shaking! I'll protect you.\n\n<b>                           MONKEYBONE\n</b>            Oh, sure. Mr. Action Hero! Why couldn't I be\n            Arnold Schwarzenegger's figment?\n\nThe REAPER approaches the GATES. He presses a remote-control BEEPER and\nthe meshing teeth of the gates slide back far enough to let him pass\nthrough.\n\nSTU realizes they've only got an instant to make their move. He DIVES\nthrough the gates at top speed. As soon as he's on the other side, he\nhears a nasty CLANG behind him...\n\nMONKEYBONE is caught - his body contorted like a pretzel, woven in and\nout among the meshing teeth! STU gives him a good hard YANK, and he\nslips out like a strand of fettuccine.\n\nThey hear RUMBLING on the tracks outside. A CAR is arriving!\n\n<b>EXT. DARK TOWN GATES - OTHER SIDE - NIGHT\n</b>\nThe REAPER loads LULU into the little roller-coaster and climbs aboard.\nThe car begins to move. STU and MONKEYBONE get there just in time to\njump onto the LUGGAGE RACK in the back!\n\n<b>ON ROLLER-COASTER - MOVING - THAT MOMENT\n</b>\nThey peep over the back of the car at the REAPER and wonder what to do\nnext. MONKEYBONE spies a TOOL KIT mounted under the rack - opens it, and\npulls out a big, nasty MONKEYWRENCH.\n\nThe boys nod in agreement. MONKEYBONE clambers over the back of the car\nand hoists the wrench. STU covers his eyes. WHANG!\n\nSTU looks up - sees a confused MONKEYBONE alone in the car with LULU.\nNow he clambers into the car as well.\n\n<b>                           STU\n</b>            Where'd he go??\n\n<b>                           MONKEYBONE\n</b>            I don't know.\n\nThere's no trace of the REAPER - except for a rumpled shroud, a\nwristwatch, and a St. Christopher's medal on the floor of the car. The\nboys exchange a puzzled shrug. MONKEYBONE tries on the watch.\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>INT. SLEEP LAB - PRE-DAWN\n</b>\nThe wall clock says it's not quite 3 AM, yet JULIE has managed to round\nup all her co-workers: ALICE, HUTCH, CLARISSA, et al. They're groggy,\ndisheveled, un-made-up, unshaven. But they're there.\n\n<b>                           JULIE\n</b>            Six hours. That's when they pull the plug.\n            That's how long we've got to wake him up.\n                 (beat)\n\n            Now these are Stu's old charts from five years\n            ago, when he first came to the sleep lab...\n\nShe points to a series of EASELS where HUTCH and ALICE have been tacking\nup EEG printouts, engram maps, etc.\n\n<b>                           JULIE\n</b>            ...they show incredibly intense nightmare\n            activity. The chart below is his new chart...\n\nThe lower chart shows a JAGGED SPIKE virtually identical to the one on\nthe upper chart. JULIE pauses for effect - then pulls on the edge of the\nlower chart, OPENING IT UP like a gatefold -\n\nThe onlookers GASP. Opened accordion-style, the lower chart shows the\nSAME SPIKE recurring again and again, TEN TIMES OVER!\n\n<b>                           HUTCH\n</b>            Holy shit.\n\n<b>                           JULIE\n</b>            He's stuck in a loop - a nightmare loop.\n                 (beat)\n            Anybody here know what Oneirix is?\n\n<b>                           CLARISSA\n</b>            Sure - it's an enzyme. The brain secretes it\n            during violent dream activity...\n\n<b>                           HUTCH\n</b>            It's nightmare juice. Julie and I were on the\n            team that learned to synthesize it. If those\n            charts are right, Stu's swimming in the stuff.\n                 (puzzled)\n            Are you thinking we can decrease the levels?\n\n<b>                           JULIE\n</b>            No. I want to give him more. I want to give him\n            a massive dose.\n\n<b>                           HUTCH\n</b>            That's not going to stop his nightmare -\n\n<b>                        JULIE\n</b>            I don't want to stop the nightmare, Hutch. I\n            want to crank it up. I want to take it right off\n            the charts. I want to scare him awake.\n\nThe group exchanges nervous glances: it's risky. JULIE claps her hands:\n\n<b>                           JULIE\n</b>            All right! We have a plan. Let's move!\n\nAs the group swings into action, HUTCH pulls JULIE aside.\n\n<b>                           HUTCH\n</b>            You know, Julie, even if this works - which it\n            probably won't - that stuff is tricky. You don't\n            know what it'll do to his brain.\n\n<b>                           JULIE\n</b>            What'll it do if they pull the plug?\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>INT. LAND OF DEATH - NIGHT\n</b>\nA PANORAMIC VIEW of an impossibly grand, Gilded-Age TRAIN STATION. A\ncentral turntable is the hub for dozens of TUNNELS, which converge like\nthe spokes of a wheel, disgorging long trains full of DEAD PASSENGERS\nfrom all over the world.\n\nFar above, in the dizzying reaches of the vaulted DOME that crowns the\nstation, REAPERS on FLYING BICYCLES spiral about like mosquitos,\nbringing dead souls to their final reward.\n\nThis is Thanatopolis - land of Death - truly the end of the line.\n\nA WET SQUEEGEE scrapes across the frame - wielded by a GRIM REAPER in a\njumpsuit bearing the logo of \"LAND OF DEATH WINDOW WASHERS, INC.\" The\nnoise is irritating, so a REAPER on the inside snaps the venetian blinds\nshut, cutting off our view.\n\nCAMERA PULLS BACK, and we realize we've been seeing all this through the\nwall-to-wall windows of...\n\n<b>INT. DEATH'S OFFICE - NIGHT\n</b>\nIt looks like the observation bridge in the nose of the Nautilus; the\ndecor is ornate, and the office equipment - vacuum tubes, pipe\nintercoms, etc. - is on loan from the Jules Verne Museum of Defunct\nTechnology.\n\nREAPERS are bustling about everywhere. One of them pushing a HAND TRUCK\nladen with oversized crates bearing the label \"DEAD SOULS.\"\n\n<b>                           REAPER\n</b>            Batch of souls - just back from Processing.\n\n<b>                           DEATH'S ASSISTANT\n</b>            Put them over there with the others.\n\nHe unloads the crates in a corner of the room, where SCORES of crated\nsouls are already piled up.\n\n<b>                           DEATH'S ASSISTANT\n</b>            Your Grimness? We have a new shipment -\n\n                           DEATH (o.s.)\n            Yeah, yeah, yeah... I'll get to it...\n\nWe can't see DEATH himself - just the back of a tall swivel chair. With\nmuch creaking, it rotates around - bringing us face-to-face with...\n\n<b>CLOSEUP - DEATH\n</b>\nHe's not at all what you'd expect. He's a chubby-cheeked, bespectacled\nACCOUNTANT TYPE...a harried bureaucrat, just trying to do his job.\nThere's something sweet, almost avuncular about him.\n\nThere's an open crate of DEAD SOULS on his desk. Dead souls take the\nform of PERFORATED PAPER DOLLS...two-dimensional, underwear-clad,\nusually wearing expressions of shock. DEATH pulls a sheet from the box,\ndetaches the dead soul, and outfits it with a cut-out TOGA.\n\nNow he places it in a big diorama - with OODLES of toga-clad souls\nstaring up at a scale model of an active volcano. He throws a switch and\nBEAMS as the volcano spits BLOBS OF KETCHUP into the air.\n\n<b>                           DEATH\n</b>            Last Days of Pompeii...now there was a Great\n            Moment in Death.\n\n<b>                           DEATH'S ASSISTANT\n</b>            If I may point out...it is 12:05...\n\nDEATH, grumbling, digs into the box and pulls out another soul. His eyes\nlight up. He clutches the sheet with trembling hands.\n\n<b>                           DEATH\n</b>            I can't believe - oh, man, I - SINATRA!! Do you\n            know how long I've been waiting for this?\n\nSure enough, the doll on the sheet is Ol' Blue Eyes. DEATH digs in a\ndesk drawer and pulls out a SHOEBOX DIORAMA...DINO and SAMMY standing at\nmicrophones, with a third, center mike conspicuously open.\n\n<b>                           DEATH'S ASSISTANT\n</b>            Make that 12:07, your bleakness...the dispatch\n            team is waiting...\n\nGrumpy, DEATH shoves FRANK, DEAN, and SAMMY back in the drawer.\n\n<b>                           DEATH\n</b>            Okay, okay, send 'em in. Jeez.\n\n\n<b>INT. DEATH'S OFFICE - CONTINUOUS - DAY\n</b>\nA FLUNKY opens the office door, and a long line of REAPERS glides in.\nDEATH lugs an enormous musty leather-bound BOOK over to a long table. He\nsnaps his fingers and WHISTLES.\n\nHis pet HELLHOUND - a tiny plump weiner dog, with a HORNED DEATH'S HEAD\nfor a face, comes skittering across the office floor and jumps into his\nlap. Meanwhile, the ASSISTANT turns on a chugging, card-shuffling UNIVAC\nCOMPUTER, which spits out a length of TICKERTAPE.\n\n<b>                           ASSISTANT\n</b>            Chakasandra Singh, New Delhi. Snakebite.\n\nDEATH checks the name against the master list in his big ledger. He\npulls out a document and puts his STAMP on it - the DEATH WARRANT. This\nhe gives to the REAPER at the head of the line.\n\n<b>                           ASSISTANT\n</b>            Mulrooney, Lavinia P., Dearborn, Michigan. Head\n            crushed in a pants press.\n\nAs the line moves along, we notice an odd-looking REAPER nearing the\ndesk. His gait is wobbly. His head bobs independently of the rest of his\nbody. There's a big, luminescent STAIN on the front of his shroud.\n\n<b>                           DEATH\n</b><b>            YOU!!!\n</b>\nEVERYONE FREEZES as DEATH points a bony finger DIRECTLY AT the wobbly\nREAPER with the iridescent stain.\n\n<b>                           DEATH\n</b>            You're the customer, okay? You're about to die.\n            It's a big occasion. A formal occasion. And as\n            you shuffle off this mortal coil, the last thing\n            your eyes behold is a Grim Reaper covered\n            with...\n                 (sputtering)\n            What the hell is that??\n\nTWO VOICES come out from under the shroud at once:\n\n<b>            STU                                 MONKEYBONE\n</b>   Cranberry Margarita.                Sex on the Beach.\n\nMuch COUGHING and THROAT-CLEARING from under the shroud. By now DEATH'S\nLAPDOG is GROWLING at the STAINED REAPER, and DEATH can't hear what\nanyone is saying. He shushes the dog.\n\n<b>                           DEATH\n</b>            ...What??\n\n<b>            STU                                 MONKEYBONE\n</b>   Salty Dog.                          Sufferin' Bastard.\n\nThe little hellhound YIPS VICIOUSLY. DEATH whacks him on the rump.\n\n<b>                           DEATH\n</b>            Well - whatever it is - you get that shroud to\n            the dry cleaner ASAP! Now where were we?\n\n<b>                           ASSISTANT\n</b>            Clarke P. Devereaux, San Francisco.\n            Complications resulting from coma...\n\n<b>                           DEATH\n</b>            Oh, wait. Says here he's supposed to recover.\n\nA loud chorus of \"A WWWWW's\" from the disappointed REAPERS. DEATH stamps\nthe word \"REPRIEVE\" on Clarke's warrant.\n\nHis ASSISTANT crosses the room. In the far wall is a steel-reinforced\nVAULT DOOR with a hydraulic wheel - the kind you see at banks. The\nASSISTANT dials in a combination, turns the wheel, laboriously pulls the\ndoor open and STEPS INSIDE...\n\n...returning, a moment later, with a priceless gold E-TICKET!!\n\nThe UPPER HALF of the STAINED REAPER begins to gyrate wildly.\n\n<b>CLOSEUP - ON STU - UNDER THE SHROUD\n</b>\nMONKEYBONE is doing an agitated TAP DANCE on his head. His TAIL whips\nrepeatedly across STU'S FACE.\n\n\n<b>INT. DEATH'S OFFICE - BACK TO SCENE\n</b>\nThe REAPER in front of the boys stares at the E-ticket, crestfallen.\n\n<b>                           DEATH\n</b>            Take this to Dark Town. Sad to say, he's gonna\n            live another forty years.\n                 (a consoling pat on the shoulder)\n            Sorry. Nobody said this job would be easy.\n\nThe ASSISTANT hands the REAPER a YELLOW MAILMAN'S POUCH containing the\nE-ticket. But before he can depart, the STAINED REAPER - aka STU and\nMONKEYBONE - jumps to the front of the line.\n\n<b>                           MONKEYBONE\n</b>            Say, Death, just out of curiosity, could we\n            maybe swap jobs with that other guy? See, we've\n            been meaning to drop in on Dark Town - I mean\n            I've been meaning to...\n\nDEATH is stunned by this unprecedented breach of protocol. The other\nREAPERS in the line are ABUZZ.\n\n<b>                           DEATH\n</b>            ...I beg your pardon?\n\n<b>                           MONKEYBONE\n</b>            I got relatives there. I...EEP!!\n\n<b>CLOSEUP - ON STU - UNDER SHROUD\n</b>\nAn ENRAGED STU is yanking on MONKEYBONE'S TAIL, signalling him to shut\nup. MONKEYBONE, in pain, squeals repeatedly. Finally he reaches down and\n<b>PUNCHES STU IN THE NOSE.\n</b>\n<b>INT. DEATH'S OFFICE - BACK TO SCENE\n</b>\nThe blow sends STU staggering. DEATH and the other REAPERS look on in\nastonishment as the STAINED REAPER does a bizarre DANCE across the\nfloor, top half and bottom half moving independently. Miraculously, he\nmanages to right himself and regain his balance.\n\n<b>                           DEATH\n</b>            Now what were you saying?\n\n<b>                        STU/MONKEYBONE\n</b>                 (in unison)\n            Nothing.\n\n<b>                           DEATH\n</b>            I'd like to have a word with you in private.\n\nHe stands and gestures toward a side room. The boys follow. The little\nHELLHOUND scampers out from behind the desk...\n\n...and GRABS THE HEM OF THEIR SHROUD in its teeth! The boys keep on\nwalking, but the shroud stays behind. Somehow they go three or four\nsteps before they realize they've been exposed.\n\nDEATH jumps a foot in the air and SHRIEKS. PANDEMONIUM ERUPTS.\n\n<b>                           DEATH\n</b><b>            IMPOSTORS!! GET 'EM!!\n</b>\nThe boys back toward the big WINDOW overlooking the trainyard. The\nREAPERS close in on them, BRANDISHING THEIR SCYTHES.\n\n<b>                           DEATH\n</b>            HYPNOS! That little twerp! He's the one who put\n            you up to this!\n\nWith a SCREECH, MONKEYBONE LEAPS into the air, BOUNDS OVER the heads and\nshoulders of the advancing REAPERS, and SNATCHES the yellow E-ticket\npouch from the guy Death gave it to.\n\nHe bounds over a table and into STU's arms, with the precious pouch in\nhand! DEATH lets out a great rattling BELLOW OF RAGE.\n\nHis features begin to JITTER VIOLENTLY. HIS HEAD EXPLODES!!!\n\n<b>                           MONKEYBONE\n</b>            Yowie.\n\nNothing to lose at this point. With a CRASH, the boys DIVE THROUGH THE\nBIG WINDOW overlooking the trainyard!\n\nThe headless DEATH gropes around blindly, waving to his ASSISTANT.\n\n<b>                           DEATH\n</b>            Head. HEAD!!\n\nThe ASSISTANT opens a cabinet containing a half-dozen identical HEADS.\nHe pulls out a spare and screws it onto DEATH's neck.\n\n<b>EXT. TRAINYARD - THAT MOMENT - NIGHT\n</b>\nThe boys land hard at the edge of the trainyard. Behind them, REAPERS\nare shepherding a line of newly arrived DEAD PEOPLE past a sign which\nreads: \"PROCESSING - THIS WAY.\"\n\nBy the time they can dust themselves off, an ALARM starts blaring.\nREAPERS drop what they're doing, point at the boys. Panic time!\n\nNearby, a FLYING BICYCLE is propped up against a SIGN. Side-by-side they\nrace toward the bike, each of them clutching the strap of the pouch,\nYANKING each other back and forth in a tug-of-war.\n\nSTU's bigger. He pulls the pouch onto his shoulder, and MONKEYBONE with\nit. They grab the bike, climb aboard, and pedal off -\n\n- revealing the SIGN it was leaning against: \"CYCLE REPAIR.\"\n\n<b>EXT. TRAINYARD - ON BICYCLE - THAT MOMENT\n</b>\nSTU pedals onto the central turntable area. The BATWINGS on the rear of\nthe bike flap feebly, but the flying bike just won't fly.\n\nMONKEYBONE looks over his shoulder. A small ARMY of REAPERS, anned with\nscythes, is pouring into the trainyard behind them.\n\n<b>                           MONKEYBONE\n</b>            Stu...Stu...\n\n<b>                           STU\n</b><b>            IT'S NOT WORKING.\n</b>\n<b>                           MONKEYBONE\n</b>            There's a thing here! There's a switch!\n\nMONKEYBONE fiddles with the ignition switch. A BLACK CLOUD OF EXHAUST\nbelches violently from the rear of the bike, almost pitching them off\ntheir seat. The batwings start to flap faster...\n\nSPUT. BLAP. The engine BACKFIRES and DIES. STU fiddles with the switch,\nbut it's no go.\n\n<b>                           MONKEYBONE\n</b>            Stu...LOOK!\n\n<b>                           STU\n</b>            What?\n\n<b>                           MONKEYBONE\n</b>            Isn't that Lulu?\n\nLULU is still sitting in her little car at the edge of the tracks, eyes\ncrossed, mouth agape. MONKEYBONE waves brightly. Then a mob of REAPERS\nappears on either side of LULU's car, swarming out onto the tracks! STU\nstarts pedaling for his life.\n\nHe makes for the TRAIN TUNNELS in the far wall of the station.\nILLUMINATED SIGNS over the tunnels read: Calcutta...Hong Kong...Waco, TX\n...and directly ahead...\n\nDark Town!! By now they're well out onto the turnaround. STU pedals\nfrantically, BOUNCING over tracks and ties. MONKEYBONE bites his\nfingernails down to the quick as he watches the column of REAPERS\npursuing them onto the tracks.\n\n<b>INT. OFFICE - ON DEATH\n</b>\nwatching through a crooked spyglass as the boys pedal down the tracks.\n\n<b>                           DEATH\n</b>            Now we've got 'em.\n\nPetting his hellhound, he reaches for a WALL SWITCH.\n\n<b>EXT. TRAINYARD - HIGH ANGLE\n</b>\nThe boys are almost at the Dark Town tunnel. The REAPERS, on foot, will\nnever be able to catch them. But as they pick up speed for the stretch\nrun, the GROUND begins to move beneath them!\n\nDEATH has activated the TRAIN TURNAROUND - the rotating platform at the\nend of the line which allows an engine to reverse direction. Before they\nknow it, they're doing a full 180!\n\n<b>EXT. TRAINYARD - ON BICYCLE\n</b>\nThe boys continue to bounce down the tracks - but the tunnel entrances\nseem to be SPINNING before their eyes. Before they know it, they're\npedaling directly TOWARD the mob of ANGRY REAPERS!!\n\n<b>                           MONKEYBONE\n</b>            Weren't we just here?\n\nSTU jerks the handlebars HARD RIGHT and JUMPS THE TRACK he's on. He\nWINCES IN PAIN as the bike BOUNCES over a series of rails...\n\n<b>                           MONKEYBONE\n</b>            What'd I tell you? You go to the Land of Death,\n            wear a jockstrap!\n\n<b>EXT. TRAINYARD - HIGH ANGLE\n</b>\nThe REAPERS are SPREADING OUT around the turntable - encircling it! STU\nrides around the periphery of the great turning platter, but there's no\ngetting off. They're completely surrounded!\n\n<b>EXT. TRAINYARD - ON BICYCLE\n</b>\nMONKEYBONE covers both eyes and wails in fear. But STU is rattling the\nignition switch, making ONE LAST EFFORT to get the bike aloft...\n\nTHE ENGINE CATCHES. Trailing black fumes, the BICYCLE RISES! The REAPERS\nconverge in its path, and RAISE THEIR SCYTHES...\n\nBut the bike JUST MANAGES TO CLEAR the tangle of scythes - leaving the\nREAPERS slicing at empty air!\n\n<b>INT. OFFICE - ON DEATH\n</b>\nThrough the big window, he sees the boys leveling off, flying toward the\nDARK TOWN TUNNEL. They're moments away from a clean escape.\n\n<b>INT. STU'S ROOM - NIGHT\n</b>\nSTU's readout monitors are registering frantic nightmare activity when\nJULIE and ALICE enter. JULIE sets her purse on STU's bedside table -\nremoves a SYRINGE and a test tube filled with PURPLISH FLUID.\n\n<b>                           JULIE\n</b>            What's the maximum safe dose?\n\n<b>                           ALICE\n</b>            Most we've ever used is half a CC.\n\n<b>                           JULIE\n</b>            Five CC's.\n\n<b>CLOSEUP - DEATH\n</b>\nHe unlocks a RED SECURITY BOX on his wall. Inside is a TOGGLE SWITCH\nlabelled \"FATE WORSE THAN DEATH.\" He flips it...\n\n<b>CLOSEUP - THE SYRINGE\n</b>\nThe plunger goes down, injecting fluid into STU...\n\n<b>EXT. TRAINYARD - ON FLYING BIKE\n</b>\nMONKEYBONE is sitting on STU's shoulder, facing backward, thumbing his\nnose at the REAPERS. STU glances back as well, laughing, unable to\nbelieve his own good luck.\n\nSince they're both looking the wrong way, neither of them sees the\nsheer, monolithic WALL rising up DIRECTLY IN THEIR PATH.\n\nIt's no ordinary wall. It's STU'S PAINTING - the one ALICE found in the\ncloset, the wolf-surgeon canvas from his scary period -\n\n- and as the bicycle SLAMS INTO IT, it begins to TOPPLE OVER - PINNING\nSTU against the ground underneath!\n\n<b>STU'S DREAMSCAPE\n</b>\nNo bike. No monkey. Just STU - who finds himself on an operating table,\nwith the world of the painting coming to 3-D life around him. The WOLF-\nFACED SURGEONS are closing in on him, baring their fangs, brandishing\ntheir scalpels and their metallic REPLACEMENT PARTS...\n\nSuddenly the fabric of this weird reality TEARS - just like a rip in a\ncanvas. A FURRY PAW reaches through - GRABS STU by the hand...\n\n<b>                           MONKEYBONE\n</b>            This ain't my nightmare!\n\n<b>EXT. TRAINYARD - JUST OUTSIDE TUNNEL\n</b>\nMONKEYBONE PULLS STU through the rip in the back of the giant toppled\ncanvas. The bike's there waiting. They hop aboard and pedal off INTO THE\nDARK TOWN TUNNEL a split-second before the REAPERS arrive to slice them\nto ribbons.\n\n<b>INT. DARK TOWN TUNNEL - ON BICYCLE\n</b>\nSTU pedals so hard his heart is about to burst. He feels down at his\nside - the yellow pouch containing the E-ticket is still there. The\nREAPERS are clustered at the mouth of the tunnel, but they aren't\nfollowing.\n\nThe boys WEEP WITH GLEE. It's a miracle - they've cheated Death!\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>EXT. DARK TOWN GATES - NIGHT\n</b>\nAn exhausted STU huffs and puffs as he pedals the bike up the last\nstretch of track to the platform outside the gates. He climbs off the\nbike and stares back - it looks like the last thousand miles or so have\nall been uphill. He slings the YELLOW POUCH over his shoulder...\n\n<b>                           STU\n</b>            You saved my life, Monkeybone. I never would've\n            made it without you.\n\n<b>                           MONKEYBONE\n</b>            Move it. We got exactly five minutes left.\n\n<b>                           STU\n</b>            It's just...now that I'm leaving, I feel like\n            there's lots of things I haven't said. Who's\n            gonna look out for you? Are you gonna be okay\n            when I'm gone?\n\n<b>                           MONKEYBONE\n</b>            Oh, don't you worry. I'll be fine.\n\n<b>                           STU\n</b>            You've been a hell of a figment, pal. I sure\n            wish I could take you home with me.\n\nThe gates slide open. STU passes through. But MONKEYBONE lingers behind\na moment - just long enough for one of the SINGING SPHINXES to slip him\na big, nasty BASEBALL BAT.\n\n<b>                           MONKEYBONE\n</b>            Awwww. Worried about my feelings, are you? Well,\n            there's a new twist.\n\n<b>                           STU\n</b>            Don't joke around, little buddy. I mean it. I\n            really do love y--\n\nHe turns - and MONKEYBONE MARK McGWIRES HIM upside the head! STU\ncrumples in a heap...\n\n<b>                           MONKEYBONE\n</b>            Love you too. Boss.\n\nLaughing maniacally, MONKEYBONE STEALS the E-TICKET and goes RACING OFF\n<b>DOWN THE MIDWAY!!\n</b>\nSTU'S HEAD is swimming. It takes him a few seconds, but he gets to his\nfeet. By now, MONKEYBONE is halfway to the E-ticket ride. Worse yet,\nSTU'S WATCH reads 8:59 AM!!!\n\n<b>                           STU\n</b>            Stop! Monkeybone! Please!!\n\n<b>EXT. DARK TOWN PLAZA - NIGHT\n</b>\nThe STREETS ARE LINED with Darktowners ROOTING MONKEYBONE ON as if he's\nthe hometown favorite in a big footrace. Which he is.\n\nMONKEYBONE reaches the E-TICKET RIDE - drops his E-TICKET into the\nreceptacle at the gate. The drawbridge lowers...\n\nAs STU sprints down the street, the SNAIL MAN oozes into his path - and\nTRIPS HIM! Before he can get up, cackling DARKTOWNERS converge on him -\nforcing him back to the ground and HOLDING HIM THERE.\n\n<b>                           STU\n</b><b>            NO! DON'T YOU UNDERSTAND?? HE'S GOT MY E-TICKET!\n</b><b>            HE'S GOT MY -\n</b>\n<b>                           HYPNOS\n</b>            Sorry, Stu. It's all part of the deal. We've got\n            big plans for that body of yours!\n\n<b>EXT. E-TICKET RIDE - ON MONKEYBONE\n</b>\nThe familiar miasma of COLORS is beginning to swirl in the night sky\noverhead. MONKEYBONE straps on a NEEDLE-TIPPED HELMET which makes him\nlook like a simian DART. Then he climbs into the seat of the TEST-YOUR-\nSTRENGTH machine and braces himself for the big ride!\n\n<b>EXT. DARK TOWN PLAZA - THAT MOMENT - RIGHT\n</b>\nONLOOKERS APPLAUD as the robot lifts its mallet and LETS FLY. DING!! The\ntiny figure of MONKEYBONE soars toward the swirling colors. His DART-\nHELMET strikes the black hole dead center.\n\nSTU WATCHES HELPLESSLY as MONKEYBONE penetrates the veil of the sky and\nVANISHES. He's still SCREAMING when the cackling DARKTOWNERS drag him\nout of the plaza by the heels...\n\n<b>                           STU\n</b><b>            NO! JULIE! NO-O-O-O!\n</b>\n<b>AERIAL SHOT - ON MONKEYBONE\n</b>\nROCKETING UPWARD through the clouds in his dart-helmet, a look of SHEER\nEXHILARATION on his simian face. Somewhere a CLOCK begins to chime the\nhour...\n\n\n<b>INT. STU'S PRIVATE ROOM - 8:59 AM - DAY\n</b>\nMOST OF OUR CAST is either in STU's room or in the hallway outside.\n\nPLUS we've got a man of the cloth; two LEGAL TYPES, with briefcases; and\nseveral of the NURSES from the facility.\n\nALICE squeezes JULIE's hand, and JULIE squeezes STU's. The minute hand\non the clock hits twelve. KIMMY, sobbing into a handkerchief, gives DR.\nEDELSTEIN the nod. As he reaches for the power switch...\n\n<b>                           STU\n</b><b>            EEEEEEPP!!\n</b>\nJULIE DROPS the hand with a gasp. The DOCTOR jumps half a foot.\n\nAll at once STU is sitting BOLT UPRIGHT IN BED...shaking his head and\nfeeling around gingerly under the bedclothes, as if something VERY SHARP\nhas just poked him in the ass.\n\n<b>                           STU\n</b>            Oooie! That smarts!!!\n\nKIMMY sighs and FAINTS DEAD AWAY.\n\nSTU blinks and looks about the room, disoriented. It could be because\nhe's just come out of a coma after seven months. Or it could be because\nhe's a MONKEY unaccustomed to hanging out in a human body.\n\n<b>                           JULIE\n</b>            Stu?\n\n<b>                           STU\n</b>            Julie?... Hey, you are a looker.\n\nA BURST OF LAUGHTER from the others in the room. Weeping TEARS OF JOY,\nJULIE flings herself across the bed and hugs him tight.\n\nWhile JULIE is hugging him, STU is checking out his new fingers and\ntoes, RUBBING his sparse patch of CHEST FUR. DOCTORS and NURSES look on\nin amazement from the doorway.\n\n<b>                           NURSE\n</b>            It's a miracle. It's a miracle.\n\n<b>                           DOCTOR\n</b>            Two more ticks of the clock...\n\nSTU is almost oblivious to JULIE. He lifts up the sheet, sneaks a quick\npeek at his CROTCH, and grins delightedly.\n\nJULIE gives him another kiss, WHISPERS in his ear:\n\n<b>                           JULIE\n</b>            Thank you. Thank you for coming back to me.\n\nWhat she doesn't know is that, although he still looks like STU, his\nbody is now occupied by MONKEYBONE. Since he's now a hybrid character,\nman on the outside and monkey within, let's call him...\n\n<b>                           STU-BONE\n</b>            Boy, I don't know about you guys, but I'm\n            starving.\n\n<b>                                                    WIPE TO:\n</b>\n<b>INT. DUNGEON - NIGHT\n</b>\nA damp, stonewalled VAULT with a barred door. STU is sprawled on the\nfloor, OUT COLD, when a VOICE awakes him...\n\n                           RAT GUARD (o.s.)\n            Heads up! Feeding time!\n\nSTU comes around just in time to see a PANEL sliding open in the ceiling\nfar overhead. A torrent of JUNK - stale popcorn, half-eaten candy bars,\nmolten ice cream pops, and sticky soda - rains down ON HIS FACE.\n\nA horde of DARK FIGURES emerge from the shadowy catacombs around him.\nAll at once, HANDS are grabbing at him from all directions. STU lets out\na SCREAM - backs up against a wall -\n\n<b>                           STU\n</b>            Who are y-- WHAT DO YOU WANT??\n\nA MONGOL WARRIOR with a droopy mustache looks up at him.\n\n<b>                           GENGHIS KHAN\n</b>            Dinner.\n\nAfter a moment STU realizes that the DARK FIGURES have almost no\ninterest in him - instead, they've been grabbing at the half-eaten\nSNACKS that cascaded down onto his head. A long-haired SLAV - RASPUTIN -\ndives on a Hershey bar with only one bite out of it, but an oddly\nfamiliar FAT MAN gets there first. STU gapes at him...\n\n<b>                           STU\n</b>            Alfred Hitchcock??\n\n<b>                           EDGAR ALLAN POE\n</b>            A fat bastard, but damn quick on his feet.\n\n<b>                           TYPHOID MARY\n</b>            That's how he keeps his girlish figure.\n\n<b>                           STEPHEN KING\n</b>            Gotta move fast in this crowd, or you'll starve.\n            Here you go, pal. Have some popcorn.\n\nHe offers STU a box of popcorn soaked in Dr. Pepper.\n\n<b>                           STU\n</b>            What is this stuff?\n\n<b>                           STEPHEN KING\n</b>            They feed us the slops from the Morpheum\n            Theatre. You hope for Jujubes, settle for\n            goobers. - I'm Steve. Steve King.\n\n<b>                           STU\n</b>            Stephen King? What are you doing in here?\n\nVarious OTHERS emerge from the shadows to shake STU's hand.\n\n<b>                           JACK THE RIPPER\n</b>            I'm Jack the Ripper.\n\n<b>                           TYPHOID MARY\n</b>            Typhoid Mary.\n\n<b>                           ATILLA THE HUN\n</b>            Atilla the Hun. Trade you a Twizzler for a box\n            of Raisinets!\n\n<b>                           STU\n</b>            Atilla the - ! What in hell is this place?\n\nAs if in reply, a FANFARE sounds in the distance...\n\n\n<b>INT. DUNGEON - ENTRANCE\n</b>\nA RAT GUARD stands at attention by the door, TOOTING HIS KAZOO to\nannounce the arrival of an honored guest.\n\n<b>                           RAT GUARD\n</b>            All hail the most glorious! Most eminent! Most\n            esteemed all-powerful God of Sleep...his Royal\n            Lassitude -\n\n<b>                           HYPNOS\n</b>            Enough, enough, I'm hung over.\n\nAs HYPNOS passes, the DUNGEON DWELLERS race up to the WALL OF BARS that\nseparates the entry area from the dungeon proper.\n\n<b>                           TYPHOID MARY\n</b>            Hyp! Did you bring me the cough medicine?\n\n<b>                           STEPHEN KING\n</b>            Did you remember the night light I asked for?\n\n<b>                           EDGAR ALLAN POE\n</b>            King, you pussy.\n\n<b>                           STEPHEN KING\n</b>            Bite me, Poe! I hate waking up in the dark.\n\n<b>                           HYPNOS\n</b>            Sorry, Steve, maybe next time. And how's our new\n            guest settling in - ?\n\n<b>                           STU\n</b><b>            YOU SET ME UP!!\n</b>\nSTU LUNGES at HYPNOS - who backs up just out of reach.\n\n<b>                           HYPNOS\n</b>            Easy, pal! I was coming to congratulate you. It\n            ain't easy snatching one of those E-tickets.\n            Steve here was the last guy to pull it off, and\n            that musta been, what, 25 years ago...?\n\n<b>                           STU\n</b>            Why'd you do it? What'd I ever do to you?!?\n\n<b>                           HYPNOS\n</b>            It's simple, Stu. We need nightmares - lots of\n            'em. So whenever we can swing it, we send a guy\n            up to stimulate the flow...a nightmare maker!\n            Like Steve here. Poe. Rasputin...we've been\n            doing this all the way back to Atilla and\n            Genghis Khan!\n\n<b>                           STU\n</b>            But why me? Why'd you pick on me??\n\n<b>                           HYPNOS\n</b>            The monkey, of course. It was his idea.\n\n<b>                           STU\n</b>            Monkeybone...!?\n\n<b>                           HYPNOS\n</b>            Nobody wants to be a sidekick, Stu. So one day\n            he comes to us - he's got a proposition. We help\n            him get your body...in return he gives us all\n            the nightmares we want.\n\n<b>                           STU\n</b>            You're nuts! I'm a comic strip artist! What's he\n            gonna do - draw really scary cartoons??\n\n<b>                           HYPNOS\n</b>            Oh, no, no, no. Y'see, Stu, as it happens, that\n            girlfriend of yours figured out the chemical\n            basis of bad dreams. And she just whipped up a\n            big old batch of nightmare juice!\n\nSTU's face goes white as he realizes the point of the master plan.\n\n<b>                           HYPNOS\n</b>            Oh, we're predicting a record box-office. It's\n            like I always say...nightmares are your best\n            entertainment!\n\nHYPNOS marches off, chuckling. STU's head sinks into his hands.\n\n\n<b>EXT. STU AND JULIE'S HOUSE - DAY\n</b>\nSTU's back from the hospital. JULIE is removing his bags from the trunk\nof KIMMY's car while STU and KIMMY chat in the front seat.\n\n<b>                           KIMMY\n</b>            I just couldn't stand the thought of you\n            suffering. I love you so, I would never have...\n            forgive me, Stu. Please forgive me.\n\n<b>                           STU-BONE\n</b>            Kimmy. Chill. We've still got a pact. If\n            anything ever happens to you, I'll be right\n            there to return the favor.\n                 (baring his teeth)\n            So drive carefully! From now on.\n\nHe climbs out. KIMMY is so rattled that she smacks bumpers with the car\nparked in front of her. She PEELS OUT with the hand brake still on.\n\n<b>INT. STU &amp; JULIE'S HOUSE - DAY\n</b>\nSTU-BONE and JULIE enter with luggage. He stands there for a moment\nscoping out the unfamiliar surroundings. She sets the bags down, taps\nhim on the shoulder.\n\n<b>                           JULIE\n</b>            Welcome home.\n\nSTU-BONE grins insipidly. She kisses him, pulls him into a tight embrace\n- and then, overwhelmed by emotion, begins to SOB.\n\n<b>                           JULIE\n</b>            Oh, baby, I can't believe you're back.\n\n<b>                           STU-BONE\n</b>            Home sweet home, huh? Actually, I was expecting\n            something a little swankier. How much loot does\n            old Stu rake in, anyway?\n\nShe gives him an extremely puzzled look.\n\n<b>                           STU-BONE\n</b>            Meaning me, of course. I'm referring to myself.\n            You have to assume Monkeybone would be a pretty\n            lucrative franchise...\n\n<b>                           JULIE\n</b>            Baby? Why don't you just...rest on the sofa for\n            a minute. I'll be right back.\n\nShe goes into the kitchen as STU-BONE plops onto the sofa. He spies a\nbowl of FRESH FRUIT on the coffee table and immediately tries to pick up\na banana with his FOOT.\n\nBut he can't. He's got shoes on. Frowning, he unties his shoe, peels off\nhis sock. His bare foot is in the fruit bowl when JULIE returns from the\nkitchen with a TRAY holding a chocolate cake and the bottle of CHAMPAGNE\nStu bought three months ago. The cake bears the message \"WELCOME HOME -\nI LOVE YOU\" in pink icing.\n\nShe sits beside him with the goodies. He removes his foot from the bowl,\ncrosses his legs, WIGGLES HIS TOES at her. She smiles uncertainly. Then\nshe opens the bottle of champagne and pours two flutes full.\n\n<b>                           JULIE\n</b>            Here's to a bottle...we should have opened...\n            three months ago.\n\nShe finishes pouring, hands a flute to STU-BONE. His face is smeared\nwith CAKE and ICING. He's scooped out a big fistful and crammed it right\ninto his pie hole. He GRINS at her.\n\n<b>                           STU-BONE\n</b>            Bitchin' good cake.\n\n<b>                           JULIE\n</b>            Stu, are you...feeling okay?\n\n<b>                           STU-BONE\n</b>            Sure. Why?\n\n<b>                           JULIE\n</b>            You're acting kind of...odd.\n\n<b>                           STU-BONE\n</b>                 (grabbing another fistful)\n\n            In what way?\n\nThen: we hear TINY NAILS skittering across the hardwood floors at high\nspeed. And BUSTER THE DOG races into the living room!\n\n<b>                           JULIE\n</b>            Buster! Look who's here!\n\nSTU-BONE tenses instinctively. The dog is yipping, wagging his tail\ninsanely at the sight of his long-lost master - until he gets just a\nlittle bit closer, and senses that something is very, very wrong.\n\nBUSTER sizes STU-BONE up and GROWLS. STU-BONE bares his teeth and\nHISSES. The dog LUNGES - and STU-BONE jumps up on the sofa!\n\n<b>                           STU-BONE\n</b>            Oh shit, the cake!\n\nHe bends down, snatches up the cake, and CRADLES IT under one arm as he\nKICKS AT BUSTER from the sofa.\n\n<b>                           STU-BONE\n</b>            Mine. Get back! MINE!!\n\nThe frazzled JULIE pours herself another jolt of champagne - a stiff\none.\n\n<b>INT. BEDROOM - NIGHT\n</b>\nSOUNDS of JULIE taking a shower in the adjacent bathroom o.s.\n\nSTU-BONE is sprawled in bed, pillows propped up behind him, flipping\nchannels on the bedroom TV with his trusty remote. The Discovery Channel\nhappens to be showing a Jane Goodall special...\n\n                           NARRATOR (on TV)\n            The mating rituals of the African silverback are\n            as rigidly formalized as those of any animal we\n            know - with the possible exception of man.\n\nOnscreen a FEMALE GORILLA is presenting her furry haunches to an ALPHA\n<b>MALE.\n</b>\nSTU-BONE watches this erotic spectacle with a connoisseur's eye. He\nglances over at the open bathroom door and catches a teasing glimpse of\nJULIE'S SHADOW as she steps out of the shower and pulls on a robe. He\nSCRATCHES and SNIFFS, just to put himself in the mood.\n\nOn TV: MONKEY FOREPLAY, which consists of a pounce from behind.\n\n                           NARRATOR (on TV)\n            In the wild, a dominant chimpanzee male is\n            likely to engage in sex numerous times\n            throughout the day, with a shockingly wide\n            variety of -\n\nSTU-BONE mutes the nature special and sneaks up behind JULIE just as she\nemerges from the bathroom in her robe and towel-turban.\n\n<b>                           JULIE\n</b>            What are you watching?\n\n<b>                           STU-BONE\n</b>            Ohhh, nothing.\n\nShe tries to pass, but he grabs the belt of her robe and spins her\naround. He delicately unwraps the turban, then opens her robe and pulls\nit closed around the two of them. They kiss...\n\n<b>                           JULIE\n</b>            You sure this is...medically advisable?\n\n<b>                           STU-BONE\n</b>            Got a doctor on duty.\n\n<b>                           JULIE\n</b>            Well. As long as it's okay with Monkeybone -\n\nSTU-BONE almost lets out a gasp of shock. What does she mean???\n\n<b>                           JULIE\n</b>                 (glancing downward)\n\n            - which it seems to be.\n\nSTU-BONE does a take. The good news is, she doesn't suspect. The bad\nnews is, he's apparently named after his creator's penis.\n\n<b>INT. HALLWAY - A MOMENT LATER\n</b>\nAll at once the air is full of Barry White's lush baritone on the\nbedroom CD player. Through the bedroom doorway we see STU-BONE and JULIE\nwaltzing romantically, belly to belly, still wrapped up in the single\nrobe.\n\nThe only jarring note is BUSTER'S FRANTIC BARKING. The poor dog is stuck\nbehind an accordion gate in the hall, going crazy, trying to warn his\nmistress about the imposter in STU's body. The dog is almost drowning\nout Barry White -\n\n- so STU-BONE stops kissing JULIE long enough to reach over with one\nfoot and KICK THE DOOR SHUT.\n\n<b>INT. BEDROOM - A MOMENT LATER\n</b>\nJULIE watches from the bed as STU-BONE begins peeling off his PJ's,\ngoing into a bizarrely formalized MONKEY MATING DANCE. He circles back\nand forth from one side of the bed to the other, making faces, grunting,\nFEINTING at her occasionally.\n\nJULIE has some dim sense that this ritual is supposed to be erotic, but\nin fact, it's making her damned nervous. She finds herself scrunching up\non the bed, trying to keep out of STU-BONE's way.\n\nNow he LEAPS UP onto the foot of the bed. REARS BACK. And with an animal\nhowl of triumph, POUNCES AT JULIE!\n\nTerrified, she rolls out of the way. STU-BONE'S SKULL slams into the\nheadboard.\n\n<b>                           JULIE\n</b>            Oh, God!! Baby! Are you -\n\nDazed, he sits up. He tries to stand, but his rubbery legs give way, and\nhe pitches over - CRACKING HIS SKULL AGAIN on the nightstand.\n\n<b>EXT. HALLWAY - A MOMENT LATER\n</b>\nJULIE helps a punchdrunk, staggering STU to the stairway.\n\n<b>                           STU\n</b>            How was it? I don't recall.\n\n<b>                           JULIE\n</b>            It was great, baby. Let's get you to the ER.\n\nAs they pass, BUSTER lets out a little growl of satisfaction from behind\nhis gate. HOLD ON THE DOG's satisfied expression as STU-BONE loses his\nbalance and topples down the stairs O.S.\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>INT. DUNGEON - NIGHT\n</b>\nRASPUTIN, ATILLA, JACK THE RIPPER and STEPHEN KING are engrossed in\ntheir weekly Parcheesi game. STU is clinging to the bars, bemoaning his\nfate.\n\n<b>                           STU\n</b>            I'm not like the rest of you. I'm just a regular\n            guy! I'm not a \"nightmare maker.\"\n\n<b>                           RASPUTIN\n</b>            Neither are we. We got our bodies hijacked just\n            like you. The guys who replaced us are the\n            nightmare makers!\n\n<b>                           ATTILA\n</b>            Like me. I was a mess sergeant in the Mongol\n            Horde. I never wanted to be the Scourge of Asia.\n            I just wanted a new recipe for yak!\n\n<b>                           JACK THE RIPPER\n</b>            I was Jack the Haberdasher.\n\n<b>                           STU\n</b>            But how? Did you all have sidekicks? Figments?\n            ...Monkeys??\n\n<b>                           STEPHEN KING\n</b>            Hey, I got screwed over by my own dog. Go\n            through hell to get that E-ticket, and who winds\n            up in my body? That darn Cujo.\n\nTYPHOID MARY runs past, GIGGLING, pursued by a huffing HITCHCOCK.\n\n<b>                           RASPUTIN\n</b>            He's sure got a thing for those icy blondes.\n\nKAZOOS SOUND. The RAT GUARD appears to announce:\n\n<b>                           RAT GUARD\n</b>            Miley. You got a visitor.\n\n<b>                           STU\n</b>            ...Kitty?!?\n\nAt the sight of STU behind bars, she breaks down CRYING.\n\n<b>                           KITTY\n</b>            I'm so sorry, Stu. I wanted to tell you what was\n            going on. I really, really liked you.\n\n<b>                           STU\n</b>            Kitty...my situation is really not important.\n            The thing is, my girlfriend is now living with,\n            and possibly engaged to, a demented monkey.\n\n<b>                           KITTY\n</b>            You're such a beautiful man. Look at you - stuck\n            in this place, and only thinking of her.\n\n<b>                           STU\n</b>            Listen to me! Is there any way I can warn her\n            what Monkeybone is up to??\n\n<b>                           RAT GUARD\n</b>            Time's up! Break it up, you two.\n\nThe RAT GUARD pushes STU back with a prod. KITTY reaches out...\n\n<b>                           KITTY\n</b>            No! Give me a moment. Just to look at him. Oh,\n            Stu. Oh, my sweet, sweet Stu.\n\nAs she gazes at him, love struck, the overhead PANEL opens and a deluge\nof CRUD from the Morpheum lands directly on STU.\n\n<b>                           RAT GUARD\n</b>            Feeding time!\n\nKITTY BAWLS inconsolably as the RAT GUARD leads her away.\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>INT. KITCHEN - DAY\n</b>\nSTU-BONE in pajamas and a head bandage, reading the morning funnies. He\npounds the table, practically WEEPING with hilarity at the MONKEYBONE\n<b>COMIC STRIP.\n</b>\n<b>                           STU-BONE\n</b>            Priceless! Priceless! This stuff just kills me!\n\n<b>                           JULIE\n</b>            I'm heading in to work, baby. Are you sure\n            you'll be okay?\n\n<b>                           STU-BONE\n</b>            Oh yeah. There's just one thing I don't get.\n            \"Monkeybone Creator Awakens from Coma\" that's a\n            big story! That's front page news! But I can't\n            find a word of coverage in this stinkin' rag!\n                 (shuffling through the paper)\n            Hey. Don't I have a TV show?\n\n<b>                           JULIE\n</b>            They only made the one episode. They've shown it\n            about nineteen times.\n\n<b>                           STU-BONE\n</b>            I need a new PR guy.\n\nJULIE grins, plants a goodbye smooch on his forehead, and exits. He\nwaits a minute, then reaches for the PHONE.\n\n<b>                                                    WIPE TO:\n</b>\n<b>INT. LIVING ROOM - EVENING\n</b>\nThe house is crawling with PRESS. There must be three dozen REPORTERS\nand PHOTOGRAPHERS and TV CREWS hanging on STU­BONE's every pronouncement.\n\n<b>                           STU-BONE\n</b>            Yes, being in a coma taught Stu Miley a thing or\n            two about life. Buckle your seat belts, for one.\n            But seriously, Stu Miley is a different man\n            today. I'm much homier.\n\nThe front door opens. A stunned JULIE pushes her way inside...\n\n<b>                           STU-BONE\n</b>            And speaking of which, here's the light of my\n            life, the pert and saucy Miss Julie McElroy.\n\n<b>                           JULIE\n</b>            I had to park two blocks away. Is something -\n\nHe pulls her to his side for a photo op. FLASHBULBS go off.\n\n<b>                           STU\n</b>            I took the liberty of calling a little press\n            conference. We're on TV, so don't say \"shit.\"\n                 ­(covering his mouth)\n            Shit! I said it. Shit! I said it again!\n\n<b>                           REPORTER\n</b>            Stu, what is it about Monkeybone that makes him\n            so popular?\n\n<b>                           STU-BONE\n</b>            Well, it's partly that he punctures all the\n            phony pretensions of our modern society...and\n            it's partly that he's a breathtakin',\n            heartbreakin', rump-shakin' sex machine!\n                 (beat)\n            Ask these gentlemen here. They're an important\n            cog in my media machine. They'll be doing six\n            new episodes of the Monkeybone show under my\n            personal supervision.\n\nHe pauses for a photo op with MIKE CACHUELA and MIKE MITCHELL.\n\n<b>                           STU-BONE\n</b>            It's all synergy. The show synergizes the strip,\n            which synergizes the merchandising, which\n            synergizes the religion, which synergizes the\n            Barbara Walters special; and then, baby, we are\n            all in the United Empire of Monkeybonia.\n\n\n<b>INT. KITCHEN - THAT MOMENT - LATE AFTERNOON\n</b>\nJULIE squeezes through the crowd, finds HERB working the phone.\n\n<b>                           HERB\n</b>            I tell you, he's ready to merchandise. We've\n            gotta move quickly. Get the toy guys, the burger\n            guys, the lunchbox guys -\n\n<b>                           JULIE\n</b>            Herb...what in God's name -\n\nHERB holds up a finger. He's too busy talking. STU-BONE enters with the\nvideo crew in tow. JULIE somehow manages to sideline him.\n\n<b>                           JULIE\n</b>            What's this about merchandising? You always\n            hated merchandising!\n\n<b>                           STU-BONE\n</b>            Well, baby, I do, but to look at it from another\n            angle...there's a potload of money here.\n\n<b>                                                DISSOLVE TO:\n</b>\n<b>EXT. STREET - DAY\n</b>\nSUPERCHARGED POP MUSIC underneath as STU-BONE comes running around a\ncorner - followed, a moment later, by a SCREAMING HORDE of BEAUTIFUL\nGROUPIES in black miniskirts and high heels. It's like something out of\n\nA Hard Day's Night, only more so.\n\n<b>INT. BEDROOM - NIGHT\n</b>\nTIGHT on STU-BONE, head still bandaged, eyes closed, SNORING slightly.\nHe wears a big monkey grin as he DREAMS the above.\n\n<b>EXT. STREET - DAY\n</b>\nA CARLOAD OF SUPERMODELS. They kill their engine in the middle of a busy\nintersection and climb out to join the mob chasing STU-BONE.\n\nHe cuts around a corner, ducks into an alley, and FLATTENS HIMSELF\nbehind a dumpster. As the girls run past, he pulls out a handkerchief\nand MOPS SWEAT from his brow.\n\nThen, with a what-the-hell twinkle, he steps out and FLINGS HIS SWEATY\nHANKIE into the midst of the GROUPIES. A CATFIGHT ensues as they\nscramble after this precious memento. The chase resumes.\n\nSuddenly he realizes he's SLOWING DOWN...running in SLO-MO. Same deal\nwith the girls on his trail. After a moment, he FREEZES. He can't move\nanything except his EYES; he looks right, left, up, down...\n\n...and suddenly he sees HYPNOS winking into view directly in front of\nhim! HYPNOS is perfectly capable of moving. He strolls right up to the\nfrozen STU-BONE and SLAPS HIM REPEATEDLY, Moe Howard-style.\n\n<b>                           HYPNOS\n</b>            You two-bit simian stooge. WHAT THE HELL IS\n            THIS? We didn't send you up here to shake your\n            booty and chase broads. We sent you up to make\n            nightmares!!\n\nSTU-BONE tries to speak. All that comes out is a slo-mo DRAWL.\n\n<b>                           HYPNOS\n</b>            Now find that nightmare juice and get to work.\n            'Cause you may be a free man during the day...\n            but when you dream, your monkey ass is mine!\n\nHe winds up - throws a ROUNDHOUSE PUNCH at STU-BONE'S FACE.\n\n\n<b>INT. BEDROOM - NIGHT\n</b>\nSTU-BONE sits up suddenly in bed. For a moment he's relieved - it was\nall a dream. Then he realizes his FACE is swelling like a\nprizefighter's. His front tooth is loose. BLOOD is streaming from his\nnose!\n\n<b>                           STU-BONE\n</b>            Eep!\n\n<b>INT. DOWNSTAIRS HALLWAY - NIGHT\n</b>\nHe's awake, fully dressed, and fishing around in the pocket of JULIE's\ntopcoat. He finds her KEY RING and tiptoes furtively to the front door.\n\n<b>                           STU-BONE\n</b>            Friggin' Hypnos. I'll show him...\n\n<b>INT. SLEEP LAB - NIGHT\n</b>\nHe unlocks the door and enters the darkened lab. Finds the dispensary\narea and kneels beside a LOCKED REFRIGERATOR. Then he shuffles through\nthe keys on the ring until he finds one labelled \"FRIDGE.\"\n\nOn the top shelf is a corked beaker of purple fluid bearing the label\n\"ONEIRIX\" with red DANGER stickers all over it. STU-BONE takes it out,\nflashes a sinister grin, and EMPTIES ITS CONTENTS into a similar beaker.\nThen he refills the original from a hip flask and replaces it.\n\nHe's just about to leave when he's startled by a series of SIMIAN GRUNTS\nand SQUEAKS - which are TRANSLATED in SUBTITLE:\n\n<b>                           FEMALE BABOON\n</b>            Hey, handsome.\n\nHe turns and spots a SEDUCTIVE FEMALE BABOON who's confmed to a CAGE in\nthe corner. The conversation continues in MONKEY TALK.\n\n<b>                           FEMALE BABOON\n</b>            Yeah, you. Come here, good-looking.\n                 (beat)\n            Why don't you let me out of this cage?\n\n<b>                           STU-BONE\n</b>            Hey, I'd love to, baby, but...it'd put me in hot\n            water.\n\n<b>                           FEMALE BABOON\n</b>                 (caressing his chin)\n            I know how to be very, very grateful.\n\nHe pulls out a MATCHBOOK and scribbles a number on it.\n\n<b>                           STU-BONE\n</b>            Tell you what, angel. When you get out, give me\n            a call...\n\nA LIGHT goes on suddenly in the outside hallway! STU-BONE tries to dive\nfor cover, but the FEMALE BABOON grabs him by the belt and pulls him\nagainst the cage.\n\nStartled, he drops the ONEIRIX BEAKER - which rolls out into the hall!\n\n<b>INT. HALLWAY - NIGHT\n</b>\nThe beaker CLATTERS LOUDLY as it rolls through the lab door. STU-BONE'S\nHANDS grope through the doorway - but the FEMALE BABOON has got him by\nthe pants leg and won't let go, no matter how much he rattles the cage.\nHe can't quite pull himself through the door...\n\nHe unbuckles the belt. UNZIPS HIS PANTS. Keeps clawing toward the\nbeaker. But he still can't quite make it, and the BABOON won't let go.\n\nNow his pants are down around his knees. He keeps wriggling until his\npants legs are entirely INSIDE OUT - and still he can't quite reach the\nbeaker! His shoes are caught in his pants cuffs! RRRRRIPPPPP...\n\nFreedom! Minus his pants, he GRABS THE BEAKER.\n\nIn FG through all this is a dim teenage JANITOR pushing his electric\nfloor polisher. He has his Walkman on and he can't hear any of the\nmayhem behind him. He sings along atonally with the music:\n\n<b>                           JANITOR\n</b>            Gettin' jiggy wit' it - gettin' jiggy wit' it...\n\n<b>INT. BEDROOM - NIGHT\n</b>\nA disheveled STU-BONE, back from his secret mission, is trying to take\nhis clothes off so he won't wake JULIE. But she starts to rouse, so he\njumps into bed fully dressed and pulls up the covers.\n\n<b>                           JULIE\n</b>            Stu? Is that you? Where did you go?\n\n<b>                           STU-BONE\n</b>            Me? Nowhere. I was asleep.\n\n<b>                           JULIE\n</b>            Baby, don't lie. I know you went out.\n\n<b>                           STU-BONE\n</b>            Not me. Nope. You must've been dreaming.\n\nShe pulls the covers back. He's still wearing his topcoat, shoes, socks,\nand shorts...but NO PANTS.\n\n<b>                           JULIE\n</b>            You're wearing a topcoat, Stu. - Where are your\n            pants?\n\n<b>                           STU-BONE\n</b>            Well, Miss Smarty, if I didn't go out, I\n            wouldn't need any pants. Now would I?\n\nHe pulls the covers up to his chin. The two of them lie there in the\ndark staring up at the ceiling.\n\n\n<b>INT. STU'S LIVING ROOM - DAY\n</b>\nThe entire Monkeybone brain trust has come to visit: HERB, syndicate\nhead MR. BOWERS, and several CORPORATE REPS hoping to arrange tie-in\ndeals. Host STU-BONE has started to take on a simian look: more\nprominent ears, flared nostrils, heavy beard stubble, etc.\n\nThe BURGER GOD REP sets a tray of FAST FOOD in front of STU-BONE - the\npackaging all covered with angelic haloed Monkeybones.\n\n<b>                           BURGER GOD REP\n</b>            As you know, Burger God has 1700 outlets\n            nationwide...we're prepared to back a major TV\n            buy to launch our Mega Monkey Meal.\n                 (beat)\n            Go ahead. Try a bite.\n\nSTU-BONE takes a bite out of his Monkeyburger - looks pleased at first -\nthen begins PICKING something out of his teeth.\n\n<b>                           HERB\n</b>            What's the matter?\n\n<b>                           STU-BONE\n</b>            I think it's a pig hair.\n                 (examining a contract)\n            How much is McDonald's offering?\n\n<b>                           HERB\n</b>            Less.\n\nSTU-BONE immediately signs the contract and shakes hands with the BURGER\nGOD REP. HERB consults his agenda.\n\n<b>                           HERB\n</b>            Oh, here's something. The city zoo is kicking\n            off a fund-raising campaign. They wonder if\n            you'd be willing to appear at a benefit.\n\n<b>                           STU-BONE\n</b>            How much?\n\n<b>                           HERB\n</b>            Well, nothing. It's a benefit. But we could\n            probably get People and Entertainment Tonight to\n            cover it.\n\n<b>                           STU-BONE\n</b>            I get it. We could give the public the\n            impression that we were doing something...\n            charitable. Brilliant!!\n\n<b>                           HERB\n</b>            And last...you remember Bill here, from the\n            Bazoom Toy Company? He's got a little something\n            I think you'll like.\n\nThe TOY REP sets a LOCKBOX on the table. A stencil on the box reads \"TOP\nSECRET.\" He pulls out a key and opens it to reveal...\n\n...a tuxedoed, collector's-edition MONKEYBONE DOLL lying on a bed of\nCRUSHED PURPLE VELVET. He carefully removes the treasure from its chest.\nIts right hand is hinged. The doll's thumb is UP ITS REAR.\n\n<b>                           BAZOOM TOY REP\n</b>            It's a prototype. Code name \"Little Jack\n            Horner.\" Go on - pull out his thumb.\n\nSTU-BONE stares at the doll - cautiously yanks its thumb out. We go to\nSLO-MO as the rising arm causes a NOXIOUS AEROSOL SPRAY to shoot out of\nMonkeybone's ass!\n\nAnd we STAY in slo-mo as STU-BONE stares at the doll in wonderment and\nawe...a man in looooove.\n\nStill in slo-mo, the EXECS crack up, gag, hold their noses at the awful\nstank of it. STU-BONE is the only one not laughing. He reaches out to\ntouch the doll - to fondle it adoringly -\n\n- and suddenly we're back to REAL-TIME.\n\n<b>                           BAZOOM TOY REP\n</b>            You know kids - they love anything gross...\n\n<b>                           STU-BONE\n</b>            Kids? Kids?! This is a work of genius. This is\n            art. This is the answer to all my prayers!\n                 (beat)\n\n            Say - just a technical question - could you fill\n            these babies up with a particulate solution of\n            one part chemical enzyme to ten parts water?\n\n<b>                           BAZOOM EXEC\n</b>            Well - I guess...\n\n<b>                           STU-BONE\n</b>            Aww righhhhht!\n\nHe breaks into RIOTOUS LAUGHTER and begins blasting monkeyfarts at HERB\nand the EXECS, who dive for cover under the conference table.\n\n<b>EXT. STU AND JULIE'S HOUSE - DAY\n</b>\nLaughter and back-slapping as STU-BONE walks his guests to their cars.\n\n<b>                           STU\n</b>            So here's my idea. We do a giveaway at the zoo\n            benefit. We get a big piñata. We fill it with\n            Monkeybone dolls - hundreds of 'em.\n\n<b>                           HERB\n</b>            A piñata. That's a great idea!\n\n<b>                           STU-BONE\n</b>            You guys don't know it, but you just saved my\n            ass!\n\nWith a big grin, he pantomimes sticking a thumb up his ass, in obvious\nimitation of the doll, and then gives the thumbs-up sign. The unnerved\nEXECS gape at him as he goes back inside - he's developed an odd, loping\ngait, and his arms swing outward in wide arcs as he walks.\n\n<b>                           BURGER GOD EXEC\n</b>            Interesting fellow.\n\n<b>                           HERB\n</b>            Head trauma.\n\n<b>INT. STU'S KITCHEN - THAT MOMENT\n</b>\nHe digs around under the sink, finds the purple beaker of ONEIRIX. Looks\nat the FARTING DOLL...and GRINS.\n\n<b>                           STU-BONE\n</b>            This'll get him off my back!\n\n<b>INSERT - TV SCREEN\n</b>\nA PROMO for the MONKEYBONE cartoon show. MONKEYBONE swings across the\nscreen on a vine, followed by a string of grinning, live-action FANS\ndoing a scratch 'n' sniff, pull-out-a-plum LINE DANCE.\n\n<b>                           ANNOUNCER\n</b>            It's his world - we just live in it. Monkeybone!\n            Back with six all-new episodes, starting -\n\n<b>INT. LIVING ROOM - REVERSE ANGLE - NIGHT\n</b>\nA distraught JULIE mutes the TV. Her friend ALICE is on the sofa beside\nher, having coffee and dessert.\n\n<b>                           JULIE\n</b>            The thing is, I'm responsible for the way he's\n            acting. It's the nightmare juice. It's got to\n            be.\n\n<b>                           ALICE\n</b>            Julie, that stuff probably saved his life.\n\n<b>                           JULIE\n</b>            I can't explain this, Alice, but I'm not so sure\n            it did. It's as if...he's not Stu any more. The\n            Stu I love is gone!\n                 (beat)\n\n            He spends all his time in the garage. He says\n            he's...autographing.\n\n<b>INT. GARAGE - NIGHT\n</b>\nTIGHT ON the flask of ONEIRIX as STU-BONE picks it up.\n\nHe's wearing a GAS MASK. He's rigged a CLOTHESLINE in the garage.\nMONKEYBONE DOLLS are clipped to it, ass-end up - forming a makeshift\nASSEMBLY LINE. He dips a TURKEY BASTER into the flask...withdraws a\nquantity of purple fluid...plucks the FINGER out of the first doll's\nbehind...\n\n- and plunges the TURKEY BASTER into the doll's hindquarters, filling it\nwith ONEIRIX!! The doll's buttocks take on the purple hue characteristic\nof Orangutans in heat. STU-BONE holds the doll at arm's length and pulls\nits finger - launching a purple puff of SPIKED NIGHTMARE GAS.\n\n<b>                           STU-BONE\n</b>            Yeah, baby! Nightmare-in-a-butt!\n                 (looking around)\n            Okay...guinea pig, guinea pig...\n\n<b>EXT. GARAGE/BACK YARD - NIGHT\n</b>\nSTU-BONE steps out into the driveway and hears a low growl - BUSTER is\ngiving him the stinkeye from behind the picket fence. STU-BONE's eyes\nlight up with inspiration.\n\n<b>                           STU-BONE\n</b>            C'mere, boy...c'mere, ole buddy...\n\n<b>INT. LIVING ROOM - A MOMENT LATER - NIGHT\n</b>\nLOUD BARKING outside. JULIE wanders over toward the window.\n\n<b>                           ALICE\n</b>            Listen. Let's bring him in for some tests. I\n            guarantee you're overreacting.\n\nJULIE lifts the curtain - and sees STU-BONE in his gas mask, bent over\nin a weird crab like stance, chasing BUSTER around the yard with the\nMonkeybone doll.\n\nJULIE doesn't seem especially surprised - but ALICE's mouth falls open.\n\n<b>                           JULIE\n</b>            Actually, no, I don't think I'm overreacting.\n\n<b>EXT. BACK YARD - THAT MOMENT - NIGHT\n</b>\nBUSTER is apparently ALONE now - he's pacing in circles under a HIGH\nTREE BRANCH, staring up and GROWLING. Someone throws a PINE CONE at the\npicket fence. BUSTER'S HEAD TURNS, just for an instant -\n\n<b>                           STU-BONE\n</b><b>            KREEEGAHHHH!!!\n</b>\n- and STU-BONE plunges out of the tree, DIRECTLY ON TOP OF THE DOG! The\ntwo of them GRAPPLE, rolling around on the grass.\n\nFor a moment it looks like this battle royale could go either way. Then\nSTU-BONE gets on top of BUSTER, STRADDLES HIM, shoves the ASS of the\nMonkeybone doll up against his muzzle...\n\nFOONT! A purple cloud of NIGHTMARE GAS hits BUSTER in the face. The dog\ngoes limp. His eyes roll back in his head. He starts to TWITCH.\n\n<b>                           STU-BONE\n</b>            Sweet dreams, you little bastard!\n\nDisheveled but triumphant, STU-BONE stands up, pounds his chest with\nboth fists, and lets out a Tarzanian ROAR. Lights go on all over the\nneighborhood. ANGRY NEIGHBORS poke their heads out the windows.\n\n<b>INT. GARAGE - NIGHT\n</b>\nSTU-BONE skulks back into the garage. He throws back a tarp, revealing\nHUNDREDS of boxed Monkeybone dolls, stacked so high they fill an entire\nwall of the garage. He pulls out his turkey baster, cranks up the\nclothesline, and goes to work.\n\n<b>EXT. BACK YARD - THAT MOMENT - NIGHT\n</b>\nCAMERA TRACKS IN on the twitching face of BUSTER, and we see\n\n<b>BUSTER'S DREAM (BLACK &amp; WHITE)\n</b>\nA German-expressionist nightmare, all low angles and heavy shadows.\nWe're in some kind of OPERATING ROOM, where a struggling PATIENT is\nbeing wheeled in on a tall, creaking GURNEY. Four ORDERLIES in surgical\nmasks are holding him down.\n\nThe PATIENT is BUSTER. And the ORDERLIES...are CATS.\n\nA CAT SURGEON draws the sheet back. Looks at the spreadeagled BUSTER.\nAnd brandishes a big nasty pair of GARDEN SHEARS.\n\n<b>INT. HYP'S HIDEAWAY - THAT MOMENT - NIGHT\n</b>\nThe Dark Town audience is scratching its collective head at Buster's\ndream, which is showing in one of HYP'S NIGHTMARE ORBS. An angry HYPNOS\nslams down the phone and storms across the dance floor to his big\ncircular bed.\n\n<b>                           HYPNOS\n</b>            Dog dreams!! That stinkin' monkey. I can't\n            believe it. We give him a body, and he sends us\n            ...dogs.\n\nA FELINE BEAUTY embraces him from behind, pulls him onto the bed.\n\n<b>                           KITTY\n</b>            Let's not think about dogs. Let's think about\n            pussycats. Meeowwwwwwrrrr....\n\nShe draws ONE SHARP CLAW lightly down his chest. He gives her a now-\nyou're-talkin' grin and hits a switch - causing the big circular bed to\nROTATE off the dance floor and into the boudoir.\n\nAs it turns, we see KITTY'S PAW closing discreetly around a KEY CHAIN on\nthe nightstand...\n\n<b>INT. DUNGEON - RIGHT\n</b>\nSTU's curled up on the dank floor when he's awakened by the sound of a\nVISITOR in the corridor outside - KITTY. She passes a sack containing\nFOOD and BOTTLED WATER through the bars - and SHUSHES the astonished STU\nbefore he can speak.\n\n<b>                           KITTY\n</b>            Shh! You'll need it when you're traveling.\n\nGlancing back at the GUARDS, she pulls a KEY from her cleavage.\n\n<b>                           KITTY\n</b>            Don't ask where I got it.\n\n<b>                           STU\n</b>            You can't do this! You'll get in trouble!\n\n<b>                           KITTY\n</b>            You're the only true-hearted man I ever met. You\n            find a way back to that girl of yours and make\n            her happy.\n\n<b>                           STU\n</b>            How am I gonna get past the guards?\n\n<b>                           KITTY\n</b>            I'll worry about the guards.\n                 (loudly)\n\n<b>            OKAY, STU. SEE YOU IN A DAY OR TWO.\n</b>\nShe turns down the corridor. STU stands there for a beat, GAPING at the\nkey in his hand.\n\nThen he hears the sound of CARNAGE outside. A FEROCIOUS, BLOODY BATTLE\nseems to be underway. Realizing that KITTY must be in trouble, he uses\nthe key to unlock the dungeon door.\n\n<b>INT. DUNGEON - THAT MOMENT - NIGHT\n</b>\nHe finds KITTY hunched in the corner on all fours, surrounded by blood\nand tufts of fur and an abandoned GUARD'S HAT.\n\n<b>                           KITTY\n</b>            Go. Just go.\n\n<b>                           STU\n</b>            Thanks, Kitty, I'll never forget you for th--\n\nShe looks up at him, feline eyes aglow. There's a three-foot-long\nRODENT'S TAIL dangling out of her mouth.\n\n<b>                           STU\n</b>            I'll really...never...forget you.\n\nHe races off as KITTY resumes her feast. The sound of fighting has\nroused the other DUNGEON DWELLERS, and when they realize the dungeon\ndoor is open they come rushing out en masse.\n\nThen the PANEL opens. They hear FOOD raining down behind them. HITCHCOCK\nis the first to turn back - then STEPHEN KING - then ATILLA. A moment\nlater they're back to their old habits, climbing over one another to get\nat a half-empty box of Raisinets.\n\n<b>                                                    WIPE TO:\n</b>\n<b>INT. SLEEP LAB - DAY\n</b>\nThe usual gang sitting around at their computer terminals, etc. JULIE is\ncoolly reading NOTEBOOK ENTRIES into a TAPE RECORDER.\n\n<b>                           JULIE\n</b>            \"4/17: Subject, when unaware of observation,\n            prefers to hold eating utensils...with feet.\n            Successfully carves turkey roll holding eating\n            utensils...with feet.\"\n\n<b>                           ALICE\n</b>            They had a case like that at Johns Hopkins.\n            Wires got crossed between hands and feet.\n\n<b>                           CLARISSA\n</b>            Great lead. I'll try and find it on the net.\n\n<b>                           JULIE\n</b>            \"4/18: Subject climbs backyard tree...to perform\n            elimination. When confronted with product...\n            blames it on family dog.\"\n\nDEAD SILENCE from the mortified group. They never had a case like that\nat Johns Hopkins. JULIE somehow keeps a stiff upper lip - deeply\nembarrassed for STU, but a scientist nonetheless.\n\n<b>                           HUTCH\n</b>            Seems perfectly obvious. He's been possessed by\n            a monkey!\n\nThe others all GLOWER at HUTCH for this egregious display of bad taste.\n\n<b>EXT. GARAGE - AFTERNOON\n</b>\nSTU-BONE and HERB are standing outside the garage in formal attire as a\ncrew of ZOO WORKERS load MONKEYBONE DOLLS into a pickup.\n\n<b>                           HERB\n</b>            You're really gonna pop the question?\n\n<b>                           STU-BONE\n</b>            Got the ring. Got the airline tickets. Soon as\n            they break that piñata, we'll grab a cab - and\n            it's off to the land of palm trees and coconuts.\n\n<b>                           HERB\n</b>            I can't believe you. You used to hate being the\n            center of attention. Now you're proposing, in\n            public, at a benefit.\n\n<b>                           STU-BONE\n</b>            Yeah, I was thinking...I mean, I'm a celebrity\n            now, do I really want to get married? But on the\n            other hand, if you're married, they can't\n            testify against you.\n\nHERB wonders if this is a joke, decides it is, and forces a chuckle.\n\n<b>INT. BEDROOM - DAY\n</b>\nJULIE is getting dressed for the benefit when the PHONE RINGS.\n\n<b>                           JULIE\n</b>            Hello? Oh, Hutch - what?\n\n<b>INTERCUT - JULIE AND HUTCH\n</b>\nHUTCH is at the sleep lab, standing over the open refrigerator.\n\n<b>                           HUTCH\n</b>            The Nightmare Juice! It's gone! Somebody\n            switched it for a beaker of grape Kool-Aid!!\n\n<b>                           JULIE\n</b>            Kool-Aid!? But who'd would want to -\n\nHer eyes move to the WINDOW - to STU-BONE out by the garage.\n\n<b>                           JULIE\n</b>            Okay. Call the police. I'll be right over.\n\n<b>INT. SLEEP LAB - LATE AFTERNOON\n</b>\nTwo DETECTIVES examining the scene of the crime.\n\n<b>                           JULIE\n</b>            The technical name is Oneirix. It's an enzyme.\n            It's present in the brains of -\n\n<b>                           DETECTIVE\n</b>                 (cutting her off; writing)\n            Yeah, yeah...Nightmare juice.\n\n<b>                           DETECTIVE II\n</b>            And there's been no sign of a break-in?\n\n<b>                           HUTCH\n</b>            Holy shit...the pants.\n                 (remembering)\n            The janitor found a pair of torn-up pants. It\n            was the same night the monkey tipped her cage\n            over. Remember that, Julie?\n\n<b>                           JULIE\n</b>                 (suddenly afraid)\n            Yeah...I remember it vividly.\n\n<b>EXT. ZOO - DAY\n</b>\nLIVERIED WAITERS scurrying all about in preparation for the benefit. ZOO\nWORKERS set up tables and chairs underneath a giant CANOPY.\n\nSTU-BONE watches with satisfaction as the last of the DOLLS is loaded\ninto a giant piñata in the shape of STANLEY.\n\n<b>                                                    WIPE TO:\n</b>\n<b>INT. DEATH'S OFFICE - NIGHT\n</b>\nThe big creaky swivel chair swings around, revealing DEATH.\n\n<b>                           DEATH\n</b>            Now, if I may ask - what kind of idiot sneaks\n            into the Land of Death twice?\n\nThe party he's addressing is STU - who's stretched out horizontally,\nstrapped to a medieval TORTURE RACK, with a whole posse of GRIM REAPERS\nstanding guard around him.\n\n<b>                           STU\n</b>            You're mad at me. Great. You have every right to\n            be. But we're both mad at Dark Town. We're both\n            mad at Hypnos.\n\n<b>                           DEATH\n</b>            Oh, sure. Now you're gonna tell me it was all\n            his idea. You were completely innocent -\n\n<b>                           STU\n</b>            I'm not going to tell you that. I wanted that E-\n            ticket. I wanted it so bad I'd stare you right\n            in the face to get it - and I'd do the same\n            again.\n\n<b>                           DEATH\n</b>            Why??\n\n<b>                           STU\n</b>            I have a girl up there. And I never - I\n            should've - I just want to tell her I love her.\n\n<b>                           DEATH\n</b>            I'm a simple man. I'm just doing my job. I enjoy\n\n            my job. Why does everyone want to make it\n            difficult for me? Stealing tickets, switching\n            bodies...it is so irresponsible.\n\n<b>                           STU\n</b>            Death, I'm trying to make things right. Take my\n            soul. Turn me into a paper doll. But give me\n            just one lousy hour.\n\n<b>                           DEATH\n</b>            Well - you'd need a body.\n\nDEATH gestures for the REAPERS to unshackle STU.\n\n<b>                           DEATH\n</b>            If it wasn't for that comic strip of yours, I\n            wouldn't be doing this. But a good chuckle is\n            darned hard to come by.\n                 (chortling)\n            That one where Monkeybone stole the soap cake\n            out of the urinal - I thought I would die.\n\n<b>                           STU\n</b>            Coming from you, that's quite a compliment.\n\n<b>                           DEATH\n</b>            De nada. Now, come here...bend over...before I\n            change my mind.\n\n<b>                           STU\n</b>            Bend over?\n\nDEATH rears back and KICKS HIM, full-force, SMACK IN THE ASS. The\nsupernatural might of the blow sends STU ROCKETING UPWARD THROUGH THE\n<b>CEILING!!\n</b>\n<b>INT. HOSPITAL - OPERATING ROOM - DAY\n</b>\nA TEAM OF SURGEONS. The lead SURGEON has his arm buried up to the elbow\nin the open torso of an ORGAN DONOR.\n\n<b>                           SURGEON\n</b>            Okay...detaching the left kidney...\n\nSCREAMS ALL AROUND as the ORGAN DONOR sits BOLT UPRIGHT! The startled\nSURGEON drops the kidney back into place.\n\n<b>                           ORGAN DONOR\n</b>            What the - who the hell am I??\n\n<b>                           SURGEON\n</b>            You're an organ donor!\n\n<b>                           ORGAN DONOR\n</b>            Am I dead?!?\n\n<b>                           SURGEON\n</b>            The chute didn't open. We kind of assumed -\n\n<b>                           ORGAN DONOR\n</b>            I need this body. Just for a few minutes. I'll\n            bring it back, okay?\n\nThe ORGAN DONOR grabs a lab coat from a nearby rack and races out. (And\nsince STU is temporarily occupying the DONOR's body, we will henceforth\nrefer to him as O.D. STU.)\n\n\n<b>INT. HOSPITAL CORRIDOR - A MOMENT LATER\n</b>\nO.D. STU comes racing around a corridor. His LAB COAT is already covered\nwith gore, and he's having trouble holding his GUTS in. His PANCREAS\nspills out onto the floor just as two DOCTORS stroll past.\n\n<b>                           DOCTOR\n</b>                 (eyeing the pancreas)\n            Might have someone take a look at that.\n\n<b>                        O.D. STU\n</b>            Oh. Yeah. Thanks.\n\nThe DOCTORS move on. O.D. STU spots a JANITOR'S CART with a roll of DUCT\nTAPE on one shelf. He WRAPS IT TIGHTLY around his midsection to keep his\ninnards from falling out. Then he runs for it.\n\nNow the TEAM OF SURGEONS rounds the corner in hot pursuit. The lead\nSURGEON spots O.D. STU at the end of the corridor and takes off after\nhim. But he SLIPS on the PANCREAS and goes sprawling!\n\nThe pancreas goes flying down the hall, where it gets SQUASHED in rapid\nsuccession by a GURNEY and by a little old lady's MOTORIZED WHEELCHAIR.\nWhen the SURGEONS retrieve it, it's a hunk of pulp.\n\n<b>                           LEAD SURGEON\n</b>            I think it can still be saved. Put it on ice.\n\n<b>EXT. ZOO - DAY\n</b>\nGUESTS are beginning to arrive for the benefit. In the cages and\nhabitats, animals stare up at a gigantic MONKEYBONE BALLOON.\n\n<b>EXT. ZOO - ANOTHER ANGLE - DAY\n</b>\nThe BAZOOM TOY REP is rounding a corner when HERB pops out from behind a\ntree and BLASTS HIM with a jolt of purple gas from a Monkeybone doll! He\nsputters and coughs...\n\nThen he grabs the doll away and blasts HERB right back! The two of them\nchase each other around the tree, giggling. The BAZOOM REP'S WIFE, in\nher formal gown, affects a look of supreme mortification.\n\n<b>EXT. STU'S HOUSE - BACK YARD - DAY\n</b>\nO.D. STU climbs over the fence, finds a hidden key, and lets himself in.\n\n<b>INT. HOUSE - STUDIO - DAY\n</b>\nO.D. STU rushes frantically from room to room.\n\n                           O.D. STU (o.s.)\n<b>            DOC? DOC?? - JULIE?\n</b>\nNo reply - the joint's empty. O.D. STU enters the studio and spots a\nNEWSPAPER on his drafting table. The paper is folded back to a big\nDISPLAY AD for the benefit: \"MEET STU MILEY AND MONKEYBONE - 8 PM\nTONIGHT!\" He checks the wall clock: time is short.\n\nReaching into the drawer of the drafting table, he pulls out a TACKLE\nBOX which contains old brushes...and a small VELVET BOX. O.D. STU opens\nthe velvet box to reveal Grandma's ANTIQUE RING.\n\nHe hears GROWLING behind him - it's BUSTER. The dog looks up, cocks his\nhead - and begins WAGGING HIS TAIL. Somehow, even though STU's in a\ndifferent body, BUSTER recognizes him.\n\n<b>EXT. STU AND JULIE'S HOUSE - DAY\n</b>\nO.D. STU exits, ring in hand. Behind him, BUSTER is throwing a fit -\nbarking, FLINGING himself at the screen door. He wants to come along!\n\nA BUS pulls up at the corner, and O.D. STU boards it. BUSTER throws\neverything he's got at the door - and it gives! He takes off after STU.\n\n<b>EXT. ZOO - GROUNDS - DAY\n</b>\nAs HERB is walking toward the refreshment table, an ODD LOOK crosses his\nface. All at once he begins to TUG at his collar. He yanks his TIE off\n...doffs his JACKET onto the pavement...\n\n<b>POV HERB - PSYCHO-VISION\n</b>\nThe nightmare drug is kicking in! The whole zoo SWIMS around him. All at\nonce he's being ATTACKED...by a HORDE of EMPTY CLOTHES!!\n\n<b>EXT. ZOO - GROUNDS - DAY\n</b>\nJULIE has arrived at the zoo. She's wandering zombie-like through the\nfood court, flanked by her friends ALICE and CLARISSA.\n\n<b>                           JULIE\n</b>            Whatever he's done, I'm responsible for it.\n\n<b>                           CLARISSA\n</b>            That's not true, Julie. It's not true.\n\n<b>                           ALICE\n</b>            This is not about your guilt, Julie. There could\n            be innocent people in danger.\n\n<b>                           CLARISSA\n</b>            He's not the same guy. He's not your Stu.\n                 (beat)\n            I didn't want to tell you this, but the other\n            day he pinched me on the butt.\n\n<b>                           ALICE\n</b>            I didn't want to tell you this, but the other\n            day he tried to mount me from behind! Look, you\n            have to tell the police.\n\n<b>                           JULIE\n</b>            Tell them what? I don't know anything concrete.\n            All I have is a feeling.\n\nAll of a sudden, they hear SHOUTS and LAUGHTER from the area of the\nreptile house. In the distance, ZOO SECURITY GUARDS are chasing a NAKED\nMAN through the crowds of formally-dressed partygoers.\n\n<b>                           CLARISSA\n</b>            Oh my God, we've got a flasher.\n\n<b>                           JULIE\n</b>            That...that's Herb!\n\nThe GUARDS catch hold of HERB and drag him away past JULIE, ALICE, and\nCLARISSA. He doesn't recognize any of them. He's PSYCHOTIC:\n\n<b>                           HERB\n</b>            CLOTHES! Beware of clothes. They're working\n            together. All of them. Shirts...pants...\n<b>            ENSEMBLES...!\n</b>\nThe three women exchange looks of stupefied HORROR.\n\n<b>INT. MUNI BUS - LATE AFTERNOON\n</b>\nPASSENGERS are holding their noses, frantically pulling on the BELL ROPE\nto alert the driver that they want off. As we move toward the back we\nsee O.D. STU sitting alone, with rows of empty seats on either side.\n\nHe looks rough. He's bone-white, his taped-up lab coat is crusted with\nblood, and he never did find any shoes. Also, it's a hot night and he's\nstarting to get a little ripe. FLIES are buzzing all around him.\n\n<b>EXT. STREETS - THAT MOMENT\n</b>\nBUSTER runs down the sidewalk as fast as his stumpy little legs will\ncarry him, in pursuit of the BUS.\n\n<b>INT. CAR - MOVING - LATE AFTERNOON\n</b>\nThe team of SURGEONS has been tracking O.D. STU across the city! Through\nthe windshield they see the BUS pulling up outside the zoo. O.D. STU\nhops out and sprints across the parking lot.\n\n<b>                           SURGEON\n</b><b>            IT'S HIM! HE'S GETTING OFF!\n</b>\n<b>INT. ZOO - ENTRANCE - LATE AFTERNOON\n</b>\nO.D. STU doesn't even stop at the ticket window. He VAULTS over the\nturnstile, knocking benefit guests aside. The SURGEONS aren't far\nbehind. They race up to the ticket window -\n\n<b>                           SURGEON\n</b>            Did you see a corpse running this way?\n\nThe TICKET-TAKER shrugs and points off in O.D. STU's direction.\n\n<b>INT. BANQUET TENT - THAT MOMENT - LATE AFTERNOON\n</b>\nThe last stages of dinner. WAITERS are already clearing plates, and\nalthough JULIE has barely touched her food she sends her plate away.\n\nOnstage a BAND is playing tasteful zoo jazz. When the number ends, STU-\nBONE approaches the dais and leans into the mike.\n\n<b>                           STU-BONE\n</b>            As emcee I want to thank you all for joining us\n            at this swingin' bash...it's a special night for\n            the birds, and the lions, and the monkeys, but\n            it's also a special night for -\n                 (tapping his chest)\n            - this monkey. And it's special because of a\n            very special lady. Her name is -\n                 (checking a note in his pocket)\n            Julie McElroy. Just kiddin', Julie. Stand up.\n\nJULIE stands reluctantly. The CROWD APPLAUDS.\n\n<b>                           STU-BONE\n</b>            And to make this special night extra-special,\n            I'd like to do a special number...especially for\n            you.\n\nA DISCO BALL lowers. STU-BONE turns to welcome a group of BACKUP SOUL\nSINGERS who are just joining the band on stage.\n\nThe TENT begins to ROCK with a throbbing beat. And STU-BONE launches\ninto a wild-eyed, hip-shaking parody of Mick Jagger singing the Rolling\nStones' \"MONKEY MAN\"!\n\nAs he sings, STU-BONE gyrates over toward JULIE, bumping and grinding\nlike the cartoon-monkey sex machine he is. He waves his mike to the\ncrowd, urging everyone to join in. JULIE gasps in disbelief, but the\ncrowd is eating it up - clapping and singing along with STU-BONE.\n\nHe gestures for pretty women to join him out on the floor. He opens his\nshirt at the neck, exposing a hitherto unseen plenitude of chest hair.\n\nHe pulls out a hanky to mop his brow and tosses it to the crowd. He\nwipes his armpits with a second hanky and tosses it to the crowd. He\nblows his nose into a third and tosses it to the crowd.\n\nThen he JUMPS UP ON THE TABLES and shakes his booty wildly,­ strutting in\nand out among the dessert plates. If the real Jagger could see him, he\nwould creep home a sad and broken man.\n\nFor the big finale, he jumps off the table and SLIDES ACROSS THE FLOOR\nto JULIE'S table - arriving ON HIS KNEES.\n\n<b>                           STU-BONE\n</b>            I am just a Monkey Man! I'm glad you are a\n            monkey...woman...too.\n                 (soft voice)\n\n            How about it, Julie?\n\nHe pulls out a RING BOX and hands it to the beet-red JULIE. The crowd\nlets out a collective GASP - followed by WILD APPLAUSE.\n\nShe stares down at the ring - a big vulgar sparkler. She can't speak.\n\n<b>                           STU-BONE\n</b>            We'll hop a plane tonight. An island ceremony.\n            An Abba Dabba honeymoon!\n\n<b>                           JULIE\n</b>            It looks so...new.\n\n<b>                           STU-BONE\n</b>            It is new. Why wouldn't it be new?\n\n<b>                           JULIE\n</b>            But the heirloom ring. Your grandmother's\n            ring...\n\n<b>                           STU-BONE\n</b>            Heirloom? Huh? You want a used ring - ?\n\nNo reply. She's taking a long time to say yes. The audience is\nmuttering.\n\n<b>                           STU-BONE\n</b>            Ju-leeee... Operators are standing by... Offer\n            expires at midnight, December 31...\n\nSuddenly a GORE-STAINED FIGURE bursts into the tent.\n\n<b>                           O.D. STU\n</b><b>            DOC! DOC! DON'T DO IT! HE ISN'T STU! HE'S\n</b><b>            MONKEYBONE!!!\n</b>\nJULIE's jaw drops. She barely gets a glimpse of O.D. STU before the ZOO\nGUARDS arrive to haul him away.\n\n<b>                           STU-BONE\n</b>            Boy, the nuts are out tonight. What'd that creep\n            call you - ?\n\n<b>                           JULIE\n</b>            He called me \"Doc.\"\n\n- which STU-BONE never does. Someone in the crowd yells...\n\n<b>                           GUEST\n</b><b>            HEY MONKEYBONE!!\n</b>\nSTU-BONE turns and does a simian COMEDY SHTICK for the crowd.\n\n<b>                           STU-BONE\n</b>            That's me, folks! Monkeybone! Let's party!\n\nBy the time he's done scratching his ribs, JULIE has vanished!\n\n<b>EXT. ZOO GROUNDS - LATE AFTERNOON\n</b>\nShe races out of the tent - grabs a passing ZOO GUARD.\n\n<b>                           JULIE\n</b>            Please. Where did you take that man...?\n\nThe GUARD points to an ANIMAL CONTROL VAN. JULIE sees O.D. STU peering\nout through a small barred panel. Their eyes meet...\n\n<b>                           JULIE\n</b>            Who are you? Why did you say those things?\n\n<b>                           O.D. STU\n</b>            Oh, Doc, it's all a mixup. We were in the land\n            of death. He stole my e-ticket. That's how he\n            got my body, see? All they had left for me was\n            this corpse!\n\nJULIE digests this, nods professionally, and turns to walk away.\n\n<b>                           O.D. STU\n</b>            Don't walk away, Doc! He's only here to give\n            people nightmares!\n                 (no response)\n\n            Doc! Please! Don't you remember the dream? They\n            were pulling the plug - I called out to you -\n            and you heard me. Remember?\n\nThis stops JULIE cold. Her spine is tingling. She turns slowly, a single\ntear rolling down her cheek. And then...\n\n<b>                           JULIE\n</b><b>            BUSTER?!?\n</b>\nThe dog runs right past JULIE and bounds up to the animal control van,\nbarking his head off. Now JULIE is starting to believe. She turns -\n\n<b>                           JULIE\n</b>            Stu...how?\n\n<b>                           O.D. STU\n</b>            I had to come back, Julie. I had to give you\n            this.\n\nTHROUGH THE BARS he hands her the little box containing Grandma's\nantique ring.\n\n<b>                           O.D. STU\n</b>            I meant to give it to you before. The night we\n            crashed. I was so happy, Julie, I...try to\n            remember me like that, okay? Not like this.\n\nShe slips the ring on her finger - looks up at O.D. STU with TEARS\nWELLING in her eyes. He makes an odd SNORKELING kind of noise.\n\n<b>                           JULIE\n</b>            What's wrong?\n\n<b>                           O.D. STU\n</b>            I'm crying too. I just don't have any tears. I'm\n            all dried up.\n\nJULIE TURNS. The two DETECTIVES we saw in the sleep lab have just\narrived at the gate, and ALICE and CLARISSA are leading them over.\n\n<b>                           ALICE\n</b>            Detective, please let this man out of the van.\n\n<b>EXT. ZOO GROUNDS - PIÑATA AREA - THAT MOMENT\n</b>\nThe PARTYGOERS are lined up under the gigantic Stanley-shaped PIÑATA,\nwhich is hanging from a tree. A TUBBY BANKER in a blindfold takes a good\nhard whack. CRACKS are beginning to appear...\n\n<b>                           STU-BONE\n</b>            Okay, folks, it's piñata time - you know the\n            rules - five bucks a pop - and remember, it's\n            all for the benefit of our friends the animals!\n                 (eyes brightening)\n            Oooooh! This one's on me!\n\nThe next contestant is a GORGEOUS WOMAN. He blindfolds her and embraces\nher from behind to help her with her grip on the bat.\n\n<b>                           STU-BONE\n</b>            Choke up, baby. That's right. Choke up!\n\nSuddenly he notices the COPS marching up with JULIE, O.D. STU and co. in\ntow. He freezes, terrified - BACKS AWAY from the BABE -\n\n- and catches a BAT IN THE FACE. Several people rush up to help him as\nthe COPS consult with the BENEFIT ORGANIZERS...\n\n<b>                           ORGANIZER\n</b>            I don't understand, officer. This is a benefit.\n            Surely this can wait until -\n\n<b>                           COP\n</b>            Sorry, ma'am...we need to question Mr. Miley on\n            a most urgent matter.\n\n<b>                           JULIE\n</b>            Stop this. Now. Those dolls have been tampered\n            with. They're toxic!\n\nO.D. STU comes marching through the crowd. He passes a LIFE-SIZED\nDISPLAY of Stanley and Monkeybone...GRABS THE BACKPACK off the Stanley\nfigure...and proceeds deliberately toward STU-BONE.\n\n<b>                           O.D. STU\n</b><b>            MONKEYBONE...BACK IN THE PACK.\n</b>\nThe old command seems to retain its magical power, because STU-BONE\nclutches his gut as if stricken at the sound of it.\n\n<b>                           O.D. STU\n</b>            I mean it this time. Back in the pack.\n\nSTU-BONE bends over - jerks and twitches - becoming more SIMIAN by the\nmoment as O.D. STU approaches.\n\n<b>                           STU-BONE\n</b>            Stu...I can explain...I was sick of being a\n            figment, see? It's awful being a figment. It's\n            degrading! And I never really wanted to give\n            people nightmares. I just told 'em that so\n            they'd help me get a body.\n\n<b>                           O.D. STU\n</b>            Yeah - my body. Back in the pack, you simian\n            shitbird!\n\nThe COPS are tres confused by all this -\n\n<b>                           COP\n</b>            Ma'am, can you give me some idea of what's going\n            on here?\n\n- but JULIE holds them back so the scene can play itself out. Now STU-\nBONE is doing a weird little monkey dance - PLAYING UP to the puzzled\ncrowd, who laugh and snicker, wondering what to make of all this.\n\n<b>                           STU-BONE\n</b>            Laugh, damn you...laugh at the sidekick...the\n            happy little monkey. He doesn't have any\n            feelings. He's just a figment of your\n            immagination!\n\nHe turns suddenly - GRABS THE BAT from the puzzled BABE -\n\n<b>                           STU-BONE\n</b><b>            GIMME THAT GODDAM BAT!\n</b>\nHe wails on the piñata like Ken Griffey Jr. O.D. STU tries to stop him,\nbut it's too late - the piñata BURSTS, and hundreds of PURPLE-ASSED\nMONKEYBONE DOLLS spill out onto the ground!\n\nAn equal number of RABID PARTYGOERS surge forward to scoop them up. The\nCOPS swing into action, trying to hold the crowd back...\n\n<b>                           COP\n</b><b>            HE'S GETTING AWAY!\n</b>\nSTU-BONE climbs a tree and JUMPS from a branch onto one of the TWIN\nJUNGLE TOWERS at the pavilion - begins CLIMBING toward the giant\nMONKEYBONE BALLOON moored up above!\n\nO.D. STU sees him - pulls away from JULIE -\n\n<b>                           O.D. STU\n</b><b>            I LOVE YOU!\n</b>\n<b>                           JULIE\n</b><b>            STU!!\n</b>\nSTU-BONE unties the mooring rope and wraps it around his midsection. Now\nfreed, the balloon LIFTS INTO THE AIR, CARRYING HIM ALOFT!\n\nO.D. STU climbs up the opposite tower as the balloon starts to drift\naway. He GRABS HOLD of the MOORING ROPE as it whips past.\n\nAnd the TEAM OF SURGEONS - who have been combing the grounds in search\nof O.D. STU - catch sight of him just as he FLOATS OFF INTO THE AIR, ON\n<b>THE END OF THE ROPE!\n</b>\n<b>                           HEAD SURGEON\n</b><b>            LOOK! IT'S HIM!\n</b>\n\n<b>EXT. ZOO GROUNDS - ON BALLOON - MOVING\n</b>\nThey rise to an altitude of ten or twelve feet. But O.D. STU's\nadditional weight pulls the balloon back DOWN - and both of them hit the\nground! They have to RUN at top speed just to keep pace with the\nballoon!\n\n<b>                           STU-BONE\n</b>            Let...go...you...dingleberry...\n\nAs he's trying to KICK O.D. STU off the rope, a GUST OF WIND catches the\nballoon and LIFTS IT HIGH INTO THE AIR.\n\nFor about three seconds. The boys tumble to earth, off-balance, in a\nheap, BOUNCING along the pavement. The balloon pulls them over a\nWROUGHT-IRON FENCE and drags them through the ALLIGATOR PIT. Giant jaws\nsnap as the boys glide overhead like bait on a hook.\n\nAs the balloon LIFTS UP AGAIN, O.D. STU hauls himself along the length\nof the rope.\n\nHe gets close enough to GRAB STU-BONE's LEG. STU-BONE reaches down to\npush him away...grabs a fistful of DUCT TAPE...\n\n...and RIP! The tape TEARS - exposing the great big GASH in O.D. STU's\nmidsection! He tries to pull himself together...\n\n<b>EXT. FOOD COURT - THAT MOMENT - LATE AFTERNOON\n</b>\nA SERVER ladles out a cup of PUNCH from a big silver PUNCHBOWL.\nSomething PINK comes plummeting out of the sky - and the next thing he\nknows, the SERVER is DRENCHED!\n\nThe SURGEONS come rushing up. They all stick their hands in the\npunchbowl at once...fishing out O.D. STU'S KIDNEY!\n\n<b>                           HEAD SURGEON\n</b>            Put it on ice. I think it can still be saved!\n\nOne of the TEAM finds an ice cooler full of soft drinks. In it goes.\n\n<b>EXT. TIGER HABITAT - LATE AFTERNOON\n</b>\nBOTH BOYS SCREAM as the balloon drags them perilously close to the RAZOR\nWIRE atop a tall storm fence.\n\nThey clear it by inches - but they don't have much time to celebrate.\nThey're dangling over the Bengal Tiger exhibit, and the great cats are\nLEAPING INTO THE AIR trying to snag them!\n\nAs O.D. STU squirms out of reach, his LIVER drops out...\n\n<b>EXT. GROUNDS - TIGER HABITAT - LATE AFTERNOON\n</b>\nIt lands close enough to the FENCE that one of the SURGEONS thinks he\ncan reach it. He reaches through the bars and sees a pack of BENGAL\nTIGERS racing toward him! He manages to grab ONE END of the liver - but\na TIGER gets the other end -\n\n- and it's a TUG-OF-WAR until the tiger BITES the liver in half, sending\nthe terrified SURGEON sprawling on the pavement outside the bars! The\nHEAD SURGEON examines the remaining half-liver...\n\n<b>                           HEAD SURGEON\n</b>            Put it on ice. I think it can still be saved.\n\n<b>ANGLE ON BALLOON\n</b>\nSTU-BONE socks O.D. STU hard across the face! He lets go of his incision\n...and his SMALL INTESTINE falls out! Since it's still connected at both\nends, the intestine forms a great big LOOP...\n\n<b>EXT. FOOD COURT - SERVING TABLE - LATE AFTERNOON\n</b>\nThe SERVER has just brought out a new PUNCHBOWL full of nice clean\npunch. He sets it down on the table and is about to ladle out a cupful\nwhen STU flies past overhead. His intestinal LOOP slides across the\ntable, knocking over glasses, snagging the PUNCHBOWL at its base...\n\n...and YANKING IT right off the table! Bystanding GUESTS are DRENCHED in\npunch as the punch bowl FLIES END OVER END...\n\n...and, with the sound of a GONG being struck, BEANS a member of the\nSURGICAL TEAM from behind!! Naturally it's the guy who's lugging the ICE\nCHEST full of O.D. STU's organs. When the punchbowl strikes, he GOES\nDOWN HARD, PITCHING the ice chest...\n\n... at a pair of COPS who are over by the piñata, loading CONFISCATED\nMONKEYBONE DOLLS into a SHOPPING CART. The ICE CHEST knocks them off\ntheir feet - and sends the SHOPPING CART rolling downhill!\n\nThe COPS try to get up, but they skid every which way on the SPILLED ICE\nunderneath. On top of which, the SURGICAL TEAM is all over them, playing\nGRAB-ASS with the COPS as they try to retrieve precious organs.\n\nThe HEAD SURGEON kneels beside his fallen comrade, the guy who got\nBEANED by the punchbowl, and feels for a pulse.\n\n<b>                           HEAD SURGEON\n</b>            Put him on ice. I think he can still be saved!\n\n<b>EXT. ZOO GROUNDS - LATE AFTERNOON\n</b>\nCOPS sprint downhill, trying to intercept the runaway SHOPPING CART full\nof confiscated dolls. Too late. The CART slams into a fence and goes\nass-over-teakettle, dumping its contents into the PENGUIN HABITAT...\n\n<b>INT. HYP'S HIDEAWAY - THAT MOMENT\n</b>\nHYPNOS and an audience of DARKTOWNERS peer into the nightmare orb. They\nsee a Keystone-Cops vision of fur-clad ESKIMOS, with clubs and\nspearguns, amid a colony of terrified PENGUINS.\n\n<b>                           HYPNOS\n</b>            Not again. THAT STINKING MONKEY!!!\n\n<b>AERIAL SHOT - STU'S POV - MOVING\n</b>\nSTU gets an idea as he looks down at his dangling INTESTINE. He begins\nFEEDING IT OUT - giving himself more rope to work with - and when it's\nlong enough, begins SWINGING IT like a LASSO!\n\n<b>EXT. WATER BUFFALO HABITAT - LATE AFTERNOON\n</b>\nWATER BUFFALO graze Buddha-like as STU'S INTESTINE snags one of them\naround the HORNS. The lasso draws taut - and holds!\n\n<b>ANGLE ON BALLOON - O.D. STU AND STU-BONE\n</b>\nThe balloon is moored in place again! O.D. STU pulls himself upward,\ntoward STU-BONE, who KICKS AT him frantically!\n\n<b>EXT. ZOO GROUNDS - LATE AFTERNOON\n</b>\nA COP pulls his sidearm and TAKES AIM at the now-stabilized balloon.\n\n<b>                           COP\n</b>            I think I can bring 'em down.\n\n<b>ANGLE ON BALLOON - MOVING - LATE AFTERNOON\n</b>\nBLAM! The cop's shot hits the giant MONKEYBONE BALLOON smack in the ass.\nWith a gale-force helium FART, the balloon ZOOMS UPWARD. The INTESTINE\nsnaps. STU-BONE and O.D. STU shoot off into the air!\n\n\n<b>ON STU-BONE &amp; O.D. STU - AERIAL\n</b>\nAT APOGEE. They exchange a LOOK as the last gasp of helium hisses out of\nthe gigantic balloon. Then it occurs to them to look DOWN...\n\n<b>THEIR POV - PARKING LOT - OVERHEAD ANGLE\n</b>\n...at the tiny CARS parked far, far below. They must be close to a\nhundred feet up in the air - and all at once the ground is coming up\nfast!\n\n<b>EXT. ZOO - ON JULIE &amp; CROWD - LATE AFTERNOON\n</b>\nJULIE et al SCREAM IN HORROR as the two bodies plunge earthward.\n\n\n<b>ON STU-BONE &amp; O.D. STU - FALLING\n</b>\n...and falling and falling until they SMACK INTO the hot asphalt of the\nparking lot, the deflated balloon settling over them like a shroud.\n\nTheir BODIES have stopped - but their SPIRITS keep on falling...\n\n<b>AERIAL SHOT - SKIES OVER DARK TOWN - NIGHT\n</b>\n...and the fight continues - even into the afterlife! As they plummet\ndown through the heavens, they REVERT to their true personae. It's STU\nvs. MONKEYBONE, creator vs. sidekick, still duking it out - like a\ncouple of skydivers fighting over a single parachute!\n\n<b>EXT. STREETS - DARK TOWN - RIGHT\n</b>\nDARKTOWNERS pour into the streets to watch the epic struggle overhead.\nThey're placing bets, rooting their favorites on. Then...\n\nTHE GROUND SHAKES AND THUNDERS - and the DARKTOWNERS scatter in all\ndirections, DIVING for the nearest hiding place. They seem to know what\nthis mighty rumbing signifies.\n\nThe E-TICKET RIDE pops out of the ground - begins to RISE into the air -\nand a COLOSSUS appears beneath it! A FIFTY-FOOT WARRIOR clad in JAPANESE\nCEREMONIAL ARMOR, he TOWERS over Dark Town, so mighty and enormous that\nhe can wear the E-TICKET RIDE as a hat!!\n\n<b>ON STU AND MONKEYBONE - FALLING\n</b>\nSTU lands a HAYMAKER, and the two of them break loose of each other -\n\n\n<b>ON ARMORED COLOSSUS - THAT MOMENT\n</b>\n- LANDING in the upturned palms of the COLOSSUS! STU watches in\ndisbelief as a PANEL pops open in the giant's CHEST, revealing...\n\n<b>                           STU\n</b><b>            DEATH!!\n</b>\n<b>                           DEATH\n</b>            I dress up when I want to make an impression. -\n            So how'd it go?\n\n<b>                           STU\n</b>            Fine, thanks. Saw my girl, said goodbye,\n            everything's gonna be okay.\n                 (shrugging)\n            I guess I'm yours now.\n\n<b>                           MONKEYBONE\n</b>            Death, I'd like to point out that none of this\n            was my fault. The roots of this tragedy go back\n            to a callous, uncaring society that -\n\nDEATH lets out a MIGHTY ROAR and CLAPS HIS GREAT METAL HANDS together.\nMan and monkey are surely squished. But when DEATH opens his hands, STU\nis still there, cupped safely in his palms.\n\n<b>                           STU\n</b>            Hey. Where's Monkeybone?\n\n<b>                           DEATH\n</b>            Back in your head, where he belongs.\n                 (beat)\n            No offense, Stu, but on your own you're kinda\n            vanilla. I didn't want to send you back without\n            him.\n\n<b>                           STU\n</b>            Back? You're sending me back?\n\n<b>                           DEATH\n</b>            It's irregular, but...I just love that strip of\n            yours. I figure I'll take the \"Family Circus\"\n            guy instead.\n\n<b>                           STU\n</b>            Death! Thank you!\n\n<b>                           DEATH\n</b>            Thank me next time you see me.\n\nHe sends STU ROCKETING UPWARD INTO THE STRATOSPHERE with a single flick\nof his finger. Then he turns...\n\n<b>                           DEATH\n</b>            Ohhhh, Hypnos??\n\nA BUNCH OF FRIGHTENED DARKTOWNERS pitch the quivering satyr out into the\nmiddle of the town square.\n\n<b>                           HYPNOS\n</b>            Death! So nice to see you. I can explain -\n\nHe looks up tremulously. A GIANT SHADOW falls across him...followed by a\n<b>GIANT ARMORED FOOT.\n</b>\n<b>EXT. ZOO - DUSK\n</b>\nJULIE SOBS in a POLICEMAN's arms at the exit to the zoo.\n\n<b>                           JULIE\n</b>            I don't know what happened. All I know is...he\n            was in a coma...and then he came back...and now\n            he's gone again.\n\nThey wander out. Behind them, a squad of COPS are confiscating\nMONKEYBONE DOLLS from squawling children as they file out.\n\n\n<b>EXT. ZOO - PARKING LOT - DUSK\n</b>\nThe TWO CORPSES, on gurneys, are being loaded into the back of the\npolice ambulance. The SURGEON and his team come wandering up.\n\n<b>                           SURGEON\n</b>            Excuse me. We lost a corpse - we saw him heading\n            this way...\n\n<b>                           DRIVER\n</b>            I got a couple of fresh ones in the back. Help\n            yourself.\n\nThe SURGEON pulls the sheet off CORPSE #1 - aka O.D. STU.\n\n<b>                           SURGEON\n</b>            I'll be. It's him all right. Still dead...\n\nThe SECOND CORPSE sits up abruptly. His sheet falls away, revealing STU\n...the real STU...now back in his own body! The SURGEON and his TEAM run\naway from the ambulance SHRIEKING.\n\n<b>EXT. ZOO - ANOTHER ANGLE - DUSK\n</b>\nBUSTER barks like a maniac. JULIE turns and sees an IMPOSSIBLE VISION\nambling toward her...STU, alive and kicking. She can't believe it's him\nuntil he grabs her and pulls her close.\n\n<b>                           JULIE\n</b>            Is it you? Is it really you this time?\n\nHe pulls her close and kisses her long and hard, quelling all doubts.\n\n<b>                           JULIE\n</b>            Oh, Stu. Tell me I'm not dreaming.\n\n<b>                           STU\n</b>            Baby...you're asking the wrong guy.\n\nThey wander off, arm in arm. STU TUGS at the seat of his pants.\n\n<b>                           JULIE\n</b>            What's the matter?\n\n<b>                           STU\n</b>            My tail itches.\n\nHe DOES A TAKE as he realizes what he's just said - but JULIE smiles,\nand he shrugs it off. Johnny Mercer's \"DREAM\" comes up underneath as the\nreunited lovers walk off into the moonlight, and we\n\n<b>                                                   FADE OUT.\n</b>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Monkeybone.jpg\"/>\n</td><td><h1>Monkeybone</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Sam Hamm\" title=\"Scripts by Sam Hamm\">Sam Hamm</a>  <a href=\"/writer.php?w=Kaja Blackley\" title=\"Scripts by Kaja Blackley\">Kaja Blackley</a>  <a href=\"/writer.php?w=Vanessa Chong\" title=\"Scripts by Vanessa Chong\">Vanessa Chong</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Animation\" title=\"Animation Scripts\">Animation</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Monkeybone Script.html#comments\" title=\"Monkeybone comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:11:51.349936"}