{"title": "Mr Brooks", "film_link": "/Movie Scripts/Mr Brooks Script.html", "script_link": "/scripts/Mr-Brooks.html", "info_raw": "\n\nMr Brooks Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Bruce A. Evans  Raynold Gideon\nGenres  Crime  Drama  Thriller\nMovie Release Date : June 2007\n\nRead \"Mr Brooks\" Script\n\n\n", "script": "\n\n\n\n\n                      MR BROOKS\n\n\n\n\n                      Written by\n\n\n           Bruce A Evans & Raynold Gideon\n\n\n\n\n\n\nFADE IN:\n\nCLOSE on a Polaroid of a dimly lit COUPLE locked in a sexual\nembrace. We cannot see their faces.\n\n                     MR. BROOKS (V.O.)\n               (tortured)\n           God grant me the Serenity to accept\n           the things I cannot change...\n\nOur view travels sensuously down the Woman's naked torso to\nfind the Man's head buried between her legs.\n\n                     MARSHALL (V.O.)\n           Why do you fight it so hard, Earl?\n\n                     MR. BROOKS (V.O.)\n           Courage to change the things I\n           can...\n\n                     MARSHALL (V.O.)\n           Come on, you've been a good boy for\n           a long time, you deserve a little\n           fun.\n\nOur view moves back up to the Woman's breasts.\n\n                                            DISSOLVE THROUGH\n                                            THIS TO:\n\nEARL BROOKS' reflection in a mirror. Earl, in his 40's, has\non a tuxedo. He's in front of a sink in a Public Bathroom and\nhe's whispering to his image.\n\n                     MR. BROOKS\n           ... and Wisdom to know the\n           difference.\n\nPicking up speed against the hunger in his head:\n\n                     MR. BROOKS (CONT'D)\n           Living one day at a time, Enjoying\n           one moment at a time, Accepting\n           hardship as a pathway to peace...\n\nFrom far away comes the sound of applause.\n\nINT. BALLROOM - NIGHT\n\nMEN in tuxedos and WOMEN in gowns.\n\nMr. Brooks is seated at one of the front tables with his\nwife, EMMA, also 40's.\n\n\n                                                     (CONTINUED)\n\n                                                         2.\nCONTINUED:\n\n\nThe audience's hands are coming together for what a MAN at\nthe microphone has just said.\n\nMr. Brooks is smiling but not clapping; and although his lips\ndon't move we can hear:\n\n                       MR. BROOKS (V.O.)\n                 (even faster now)\n             ... Taking, as He did, this sinful\n             world as it is, not as I would have\n             it. Trusting that He will make all\n             things right if I surrender to His\n             will. That I may be reasonably\n             happy in this life, And supremely\n             happy with Him forever in the next.\n             Amen.\n\nThe Man at the microphone raises his arms to quiet the\nAudience.\n\n                       MAN\n             I could go on and on about what a\n             great guy Earl is, how he cuts his\n             toe nails...\n\nEveryone laughs.\n\n                       MAN\n             ... how he gives freely of his time\n             and money, but let's get Earl up\n             here to speak for himself. Ladies\n             and Gentlemen, I give you a\n             businessman, a philanthropist, a\n             great friend and the Evanston\n             Chamber of Commerce Man of the\n             Year... Mr. Earl Brooks.\n\nMr. Brooks kisses Emma, stands and after accepting\ncongratulations along the way, arrives at the podium.\n\n                       MR. BROOKS\n             Thank you all very much. The first\n             thing I would like to say is... I\n             don't even know how I cut my toe\n             nails.\n\nApplause and laughter from the Audience.\n\n                       MR. BROOKS\n             Twenty years ago when I started the\n             Brooks Box Factory I never dreamed\n             I would one day be standing here.\n\n                                                            3.\n\n\n\nEXT. STREET - NIGHT\n\nA silver Lexus LS 430 glides past us.\n\n                    EMMA (V.O.)\n          Did you see Sis Wallace's dress?\n\nINT. LEXUS Ñ NIGHT\n\nMr. Brooks is driving. Emma is in the passenger seat. They're\nholding hands.\n\n                    EMMA\n          You could see her nipples. At her\n          age she should keep those things\n          hidden.\n\nMr. Brooks is only listening to his Wife with one ear and\nunderneath what she is saying we can barely hear:\n\n                    MR. BROOKS (V.O.)\n          God grant me the Serenity to\n          accept...\n\n                    EMMA\n          The only thing that would have made\n          this evening more perfect is if\n          Jane had been here.\n\n                     MR. BROOKS\n          She called. She has mid terms\n          coming up.\n\n                    EMMA\n          She's dropping out, you know.\n\n                       MR. BROOKS\n          We'll see.\n\n                    EMMA\n          Nothing she does is wrong to you,\n          is it?...\n\nMr. Brooks doesn't rise to the bait.\n\n                    EMMA\n          Well she missed a good party...\n\nAs she continues, we look at Mr. Brooks and Emma's voice\nfades to a murmur.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                         4.\nCONTINUED:\n\n\nIn the back seat, a Man leans out from behind Mr. Brooks's\nhead. This is MARSHALL. He's 50 plus.\n\nEmma can neither see nor hear him. Marshall exists only in\nMr. Brooks's mind.\n\n                       MARSHALL\n             Come on, Earl, give yourself a\n             break, you know you want to do\n             this.\n\n                        MR. BROOKS\n             No.\n\n                       MARSHALL\n             You're the fucking 'man of the\n             year', you deserve it. It's not\n             like it's not set up. You already\n             know how to by-pass the alarm, you\n             know how to pick the locks.\n             Tonight's the perfect night.\n\n                       MR. BROOKS\n                 (over his shoulder)\n             No, Marshall, I said 'no'!\n\n                        MARSHALL\n             I heard you, Earl, but you don't\n             mean 'no'.\n\nEmma feels Mr. Brooks's distance.\n\n                       EMMA\n             What's the matter?\n\nMr. Brooks pulls himself back into the moment.\n\n                        MR. BROOKS\n             Nothing.\n\n                       EMMA\n             You were frowning.\n\n                       MR. BROOKS\n             I was thinking of what I didn't say\n             in the speech.\n\n                       EMMA\n             They laughed, they were touched, I\n             don't think anyone felt left out.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                         5.\nCONTINUED: (2)\n\n\n                    MARSHALL\n              (from the back seat)\n          They have their dance class\n          tonight. What if we go by and just\n          look at them. There's no harm in\n          just having a look.\n\n                    MR. BROOKS\n          No means 'no', Marshall.\n\n                    MARSHALL\n          Please... pretty please.\n\n                    MR. BROOKS\n              (to Emma)\n          The food tonight was very good, but\n          I wasn't crazy about the dessert.\n          Would you like to stop somewhere\n          and get something sweet?\n\nINT. ICE CREAM PARLOR Ñ NIGHT\n\nIn a booth, Mr. Brooks and Emma are sharing a Sundae. Mr.\nBrooks steals a look at the Arthur Murray dance class that is\ntaking place behind the full-length windows fronting the\nsecond floor of the Building across the street.\n\n                    EMMA\n          ... Labradors are supposed to be\n          nice, or maybe a rescue mutt...\n\n                    MR. BROOKS\n          The Pound's a pretty sad place; if\n          you want me to, I'll go with you.\n\n                    EMMA\n          There's an Irish Lab I read about,\n          and I think the breeder is...\n\nMr. Brooks turns his attention back to the Dancers and again\nEmma's voice fades to a murmur.\n\nBoth Mr. Brooks and Marshall who is seated on the other side\nof Emma are focused on one particular COUPLE.\n\nThe Man and Woman are not great dancers nor are they\nespecially attractive, but Mr. Brooks and Marshall are\nfascinated with them.\n\nMarshall leans forward and looking slyly around Emma at Mr.\nBrooks:\n\n\n\n                                                  (CONTINUED)\n\n                                                          6.\nCONTINUED:\n\n\n                       MARSHALL\n             I bet your dick's getting hard,\n             isn't it, just imagining what they\n             would look like dead?\n\nSavoring the ice-cream, Mr. Brooks nods.\n\nEXT. BROOKS HOUSE Ñ NIGHT\n\nTwo story modern. Not ostentatious, but the elegance of the\nline and the grounds say there's big money here.\n\nINT. MASTER BEDROOM - NIGHT\n\nThrough the door of the DRESSING AREA, Emma can be seen\ntaking off her evening clothes.\n\nHidden by the darkness on the other side of the bed, Mr.\nBrooks is hunched forward on a chair, his head in his hands.\nHis bow tie is undone, but he's still wearing his Tuxedo. In\nobvious torment, he is whispering to himself.\n\n                       MR. BROOKS\n             ... I can't do this, I can't do\n             this, I can't do this, please don't\n             let me do this, God grant me the\n             Serenity to accept the things I\n             cannot change...\n\nIn the DRESSING AREA\n\nEmma is putting on her sleep-wear. Mr. Brooks steps into the\ndoorway.\n\n                       MR. BROOKS\n             I'm going to stay up a while, maybe\n             go to the studio and play with some\n             glazes.\n\n                       EMMA\n             Okay, I'm going to read. If I'm not\n             awake, wake me when you come back.\n\nMr. Brooks comes forward, puts his arms around Emma and hugs\nher, then easing back, kisses her.\n\n                       MR. BROOKS\n             I thought you were wonderful\n             tonight.\n\n                                                           7.\n\n\n\nEXT. THE BROOKS HOUSE Ñ NIGHT\n\nMr. Brooks exits the back door and starts down a path that\nleads away from the house.\n\n                    MR. BROOKS\n              (to himself)\n          Don't do this, don't do this,\n          please don't do this, don't do\n          this, don't do, please don't do\n          this...\n\nHe passes through a screen of trees and arrives at a small\nbeautiful industrial-looking Building.\n\nNo windows except for a narrow strip on three sides just\nunder the edge of the roof.\n\nMr. Brooks lets himself in with a key.\n\nINT. BUILDING Ñ NIGHT\n\nExquisitely unique handmade handglazed bowls, vases, cups,\nplates are scattered haphazardly on shelves and tables around\nthe room.\n\nThis is Mr. Brooks's CERAMICS STUDIO.\n\nMr. Brooks turns on the big industrial kiln and sets the\ntemperature, then in a series of quick cuts changes out of\nhis tuxedo into his work clothes which he selects from a\ndozen identical pairs of khaki shirts and pants hanging in a\ncloset.\n\nBelow the pants and shirts are a dozen pairs of identical\nleather work shoes. The windbreaker he puts on is also from a\ndozen identical windbreakers.\n\nHe takes a set of car keys off a hook next to a door which\nopens into a garage. Under the light is an older model non-\ndescript Toyota.\n\nEXT. CERAMICS STUDIO Ñ NIGHT\n\nThe Toyota backs into an alley and with the garage door\nclosing behind it, pulls away.\n\nINT. TOYOTA Ñ NIGHT\n\nMarshall is up front with Mr. Brooks.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                            8.\nCONTINUED:\n\n\n                       MARSHALL\n             Oh Lordy, Earl my boy, I've missed\n             this! We are going to have so much\n             fun!\n\n                       MR. BROOKS\n             This is the last time, Marshall.\n             Understand me?! The very last time!\n\nEXT. RESIDENTIAL STREET Ñ NIGHT\n\nA mixture of modest houses and apartment buildings. Mr.\nBrooks's Toyota is parked in the semi-dark cast by a tree.\n\nWe rise over the car, over the trees, over the houses to the\nother side of the block and come down to find Mr. Brooks\nworking the lock on the side door of a small BUNGALOW.\n\nHe has on surgical gloves.\n\nThe pick is extracted, the handle turned. The door opens.\nThere's a chain.\n\nMr. Brooks removes a pair of bent rubber tipped forceps from\na pocket, inserts it in the chain, pulls the door to, gives\nthe tool a twist and gently pushes the door inward.\n\nThe chain has been released.\n\nINT. BUNGALOW Ñ NIGHT\n\nMr. Brooks quietly closes the door and holding his breath\nstands very still and listens.\n\nThere's a faint indistinct sound coming from the recesses of\nthe house.\n\nMr. Brooks's feet glide out of the PANTRY. Now coming\nslightly behind him is another pair of legs encased in dark\nslacks.\n\nMove up; the person in the black slacks is Marshall.\n\nIn the middle of the KITCHEN, the sound is now recognizable.\nIt's the moans of a Couple fucking. This disturbs Mr. Brooks,\nhe hesitates.\n\nMarshall leans in and hisses fiercely in his ear.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                            9.\nCONTINUED:\n\n\n                       MARSHALL\n             Don't you dare quit on me, you\n             piece of shit. I want to see what\n             they're doing.\n\nMr. Brooks's spine stiffens and he's going forward again.\n\nEntering a HALLWAY, he reaches into his jacket. When his hand\nreappears it's inside a Ziplock bag, his fingers around the\nbutt of a silenced pistol.\n\nHe brings the hand and bag to his mouth and tightens the\nZiplock against his wrist.\n\nThe two Men arrive at a door that's slightly ajar. Behind it\nthe sounds of the love-making are becoming more intense.\n\nMr. Brooks nudges the door with his foot. It opens enough for\nhe and Marshall to see the Couple inside.\n\nThe Man and Woman from the Arthur Murray dance class are\nnaked on the bed.\n\nAs much as Mr. Brooks hates himself for it he loves watching.\nHe can now hear his heart beating in his ears.\n\nHe begins to breathe in unison with the Couple, but his\nexpression is distant almost clinical.\n\nWhen the Couple climaxes, when they come, Mr. Brooks's face\ngoes blank.\n\nOn the bed the Woman rolls off her Partner and the two of\nthem lie there basking in the afterglow.\n\nBehind them Mr. Brooks pushes the door fully open and slips\ninto the ROOM. They don't know he's there until he speaks.\n\n                       MR. BROOKS\n             Hello.\n\nBoth the Man and Woman jump with surprise and look. The Woman\nscreams and scrabbles at the sheet to cover herself.\n\n                       MAN\n             What the fuck?!\n\nThen he sees the gun.\n\n                       MAN\n             Hey, man, don't...\n\n\n\n                                                  (CONTINUED)\n\n                                                        10.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n              (to the Woman)\n          Be quiet and sit up.\n\nIn an attempt to get away, the Woman pushes herself back\nagainst the wall. She can't take her eyes off Mr. Brooks and\nshe can't stop screaming.\n\nPOP! A hole appears above her left eye. The impact of Mr.\nBrooks's High Velocity .22 slug bounces her head off the\nwall. The screaming stops.\n\nThe Man opens his mouth and begins to shake. POP! The bullet\nthrough his brain makes him instantly dead and he crumples\nonto the Girl.\n\nMr. Brooks looks at what he's done. His nostrils flare at the\nscent of death. Then he moves, he's got work to do. On his\nway to the bed, the pistol goes into his pocket.\n\n                    MARSHALL (O.S.)\n              (barks)\n          Whoa, Earl, what the fuck is\n          this?!!\n\nMr. Brooks snaps a look.\n\nThe curtains of the bedroom window are open; and over half of\nthe Apartments in a four story Building on the other side of\nan alley can see into this room.\n\nMost of their windows are dark. And there's no one looking\nout of the windows that are lit.\n\n                    MARSHALL\n          These pigs liked to fuck with the\n          blinds open, you should have known\n          that, Earl. This is a big mistake\n          for you, Earl.\n\n                    MR. BROOKS\n              (going to the window)\n          Almost like I want to get caught,\n          huh, Marshall?\n\n                     MARSHALL\n          Well, don't fucking do that. I\n          don't think either of us would\n          enjoy spending the rest of our\n          lives in jail or a lethal\n          injection.\n\n\n\n                                                  (CONTINUED)\n\n                                                          11.\nCONTINUED: (3)\n\n\n                      MR. BROOKS\n          Yes, sir.\n\nHe grabs a side of cloth in either hand and yanks the\ncurtains closed.\n\n                                         CUT TO:\n\nCLOSE on a Polaroid of the dance Couple in a sexual pose. The\nattitude of the bodies is awkward and very reminiscent of the\nones in the Polaroid we opened the movie with.\n\nINT. CERAMICS STUDIO Ñ NIGHT\n\nMr. Brooks is kneeling naked in front of the kiln where his\nmurder clothes are being reduced to ash.\n\nArranged on the floor are Polaroids of the dance Couple in\nsexual positions.\n\n                    MR. BROOKS\n          Please forgive me... Please forgive\n          me...\n\nAs we look closer at the Photographs we realize by a smear of\nblood here and there and the distortion of the limbs that\nthese tableaus were arranged after the Couple was killed.\n\nOne by one, Mr. Brooks picks up his souvenirs. He lingers\nover the last image; and from where he's sitting on the edge\nof a table:\n\n                     MARSHALL\n          Don't even think about it. You know\n          the rules.\n\nReluctantly Mr. Brooks throws the Polaroids into the fire of\nthe kiln.\n\n                    MARSHALL\n          Now go up and make love to your\n          beautiful wife.\n\nHe leaves. In the kiln, the Polaroids burst into flame.\n\nEXT. MURDER HOUSE Ñ AFTERNOON\n\nThe sunlight exposes its charm.\n\nIf it weren't for the Police tape, the UNIFORMED OFFICERS,\nand the PLAINCLOTHES DETECTIVES, it looks like it would be a\ncool place to live.\n\n\n                                                   (CONTINUED)\n\n                                                        12.\nCONTINUED:\n\n\nAn OLDER DETECTIVE, an African-American, comes out on the\nporch and calls to two other DETECTIVES who are drinking\ncoffee on the lawn:\n\n                       OLDER DETECTIVE\n             Where the fuck is Atwood?!\n\n                       YOUNG DETECTIVE\n             I called ten minutes ago, they said\n             she was on her way.\n\n                       OLDER DETECTIVE\n             She doesn't get here soon, these\n             bodies won't even be dead anymore?\n\nA Uniformed Cop standing guard at the tape:\n\n                       COP\n             You looking for the lady Cop?\n\n                       OLDER DETECTIVE\n             Yeah.\n\n                       COP\n             She's here. She's been sitting in\n             her car right over there for the\n             last half hour.\n\n                       OLDER DETECTIVE\n             Oh, Christ.\n\nEXT. ATWOOD'S CAR Ñ AFTERNOON\n\nSpecial Detective TRACY ATWOOD, somewhere in her 30's, is\nbehind the wheel. The door is open.\n\nBy the expression on her face we might guess that Detective\nAtwood has simply forgotten to get out of the car.\n\nOn the seat next to her is a copy of the Chicago Tribune. The\nheadline of a middle article on the first page reads: THE\nHANGMAN ESCAPES.\n\nMove up to Atwood's face. The Older Detective followed by the\nYounger Detective approaches.\n\n                       OLDER DETECTIVE\n             You thinking of joining us anytime\n             soon, Atwood?\n\nAtwood doesn't look at the Detectives for a long beat and\nwhen she does her expression is not friendly.\n\n\n                                                   (CONTINUED)\n\n                                                         13.\nCONTINUED:\n\n\n                       DETECTIVE ATWOOD\n             I really hated yesterday, Snyder,\n             and then today came along.\n\nAs she gets out of the car, the Men notice the bandages on\nher wrists and falling into step with her on the way to the\nhouse.\n\n                       SNYDER (OLDER DETECTIVE)\n             What happened to your wrists?\n\nAtwood holds up her hands to reveal the extent of the\nbandages.\n\n                       DETECTIVE ATWOOD\n             I tried to commit suicide.\n\nThe Young Detective laughs. Atwood whirls on him.\n\n                       DETECTIVE ATWOOD\n             What's so funny?\n\n                       YOUNG DETECTIVE\n             Eh... I... I don't know, I heard it\n             was because you were drunk and got\n             into a fight with a fish tank.\n\nAtwood sticks her finger into the Young Detective's chest.\n\n                       DETECTIVE ATWOOD\n             Who are you gonna believe? Me or\n             the fucking fish?!\n\n                          YOUNG DETECTIVE\n             Eh... you.\n\n                          DETECTIVE ATWOOD\n             Good.\n\nAtwood turns and leaves the Men.\n\n                       YOUNG DETECTIVE\n                 (under his breath)\n             She's nuts!\n\n                          SNYDER\n             And rich.\n\nThey catch up to Atwood who has squatted down to examine the\nlock on the front door.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                         14.\nCONTINUED: (2)\n\n\n                    SNYDER\n          There are some scratches in the\n          side door cylinder. Other than that\n          no signs of forced entry. The alarm\n          was armed and we even had to cut\n          the security chains to get in.\n\n                    DETECTIVE ATWOOD\n              (straightens up)\n          This guy hasn't been active for\n          over two years...\n\nShe enters the house.\n\nINT. MURDER HOUSE Ñ AFTERNOON\n\nFrom the way Atwood looks at her surroundings as she crosses\nthe Living Room we get the feel that this Woman misses\nnothing.\n\n                    DETECTIVE ATWOOD\n          ... we think he's either dead or in\n          jail on some other charge. This is\n          probably a copycat.\n\nDetective Snyder points her down the Hall toward the Bedroom\nand follows.\n\n                    SNYDER\n          That's why we called you. You're\n          the God that tells us peons if we\n          have a simple murder here or\n          something we can dump on you.\n\n                    DETECTIVE ATWOOD\n          Bite yourself.\n\nAtwood arrives in the doorway of the BEDROOM where the\nmurders took place and stops.\n\nThe Bodies of the dance Couple are now on the floor. The Man\nis propped up against the bed in a sitting position. The\nWoman has her head in the Man's crotch.\n\nAlmost like Mr. Brooks, Atwood's nostrils flare, but in\nAtwood's case it's not the scent of death that arouses her\nbut it's like she's searching for the scent of her prey.\n\nIn a glance she memorizes the Room, then steps inside.\n\n                                                           15.\n\n\n\nINT. BEDROOM Ñ AFTERNOON\n\nThe Crime Scene TECHNICIANS shift to accommodate Atwood's\ninspection.\n\n                    DETECTIVE ATWOOD\n              (indicating the Victims)\n          He always rearranges the bodies,\n          but this is out of character. He\n          has never left them in such a crude\n          position. Usually it's more\n          romantic with their arms around\n          each other, kissing, their mouths\n          open, their tongues touching.\n\n                    SNYDER\n          So we have a copycat?\n\n                    DETECTIVE ATWOOD\n          Where are the thumbprints?\n\nSnyder points to a bare space of wall above the bed. Atwood\nleans in to look at two bloody 'thumbprints' placed side by\nside.\n\n                    DETECTIVE ATWOOD\n          One his one hers?\n\n                    SNYDER\n          That's what it looks like.\n\n                    DETECTIVE ATWOOD\n          What's that?\n\nThere are two holes gouged into the plaster of the wall.\n\n                     SNYDER\n          The bullets went completely through\n          the victims. The killer recovered\n          the slugs.\n\nAtwood unfolds and after another look around the room goes to\nthe window and cracks the curtains.\n\nThere's the four story Apartment Building across the alley,\nits windows staring down at her.\n\n                    DETECTIVE ATWOOD\n          Were these open or closed when you\n          got here?\n\n\n\n\n                                                  (CONTINUED)\n\n                                                         16.\nCONTINUED:\n\n\n                       SNYDER\n             Closed.\n\nAtwood tries the cord, the curtains are stuck.\n\n                       DETECTIVE ATWOOD\n             Hmm...\n\nShe returns her attention to the murder scene.\n\n                       DETECTIVE ATWOOD\n             It has never been revealed to the\n             public that the Thumbprint Killer\n             retrieves the slugs.\n\n                       SNYDER\n             So this one's yours.\n\n                       DETECTIVE ATWOOD\n             I don't fucking need this.\n\nShe doubles back and cracks the curtains for another look at\nthe four story Apartment Building.\n\n                       DETECTIVE ATWOOD\n             Have you checked the tenants of\n             that building?\n\n                       SNYDER\n             Only a few of them are home, they\n             say they didn't see anything. We\n             checked the whole neighborhood, so\n             far nobody saw a thing.\n\nAtwood nods and turns back to the bodies.\n\n                       DETECTIVE ATWOOD\n             Leaving them like this, he must\n             have been angry at them for some\n             reason.\n\nShe reaches down and runs a hand over the carpet.\n\n                       DETECTIVE ATWOOD\n             Where would they keep their vacuum\n             cleaner.\n\nA puzzled Snyder follows her out of the room.\n\nINT. PANTRY Ñ AFTERNOON\n\nAtwood opens a service closet. There's the Vacuum Cleaner.\n\n\n                                                    (CONTINUED)\n\n                                                           17.\nCONTINUED:\n\n\n                       DETECTIVE ATWOOD\n             I'll bet you a hundred bucks,\n             Snyder, there is no bag in that\n             vacuum cleaner.\n\n                       SNYDER\n             I have no idea what you're looking\n             for.\n\nAtwood unzips the cover. There is no bag inside.\n\n                       DETECTIVE ATWOOD\n             He vacuumed the house and took the\n             bag.\n\n                       SNYDER\n             Oh, shit. That is scary smart.\n\nEXT. ALLEY Ñ AFTERNOON\n\nDetective Atwood is standing on an empty capped plastic\ngallon milk carton looking over the fence into the back yard\nof the Murder House. Snyder has his hand on her back to\nsteady her.\n\n                       DETECTIVE ATWOOD\n             Okay.\n\nHe releases her. She hops down and directs her attention at\nthe four story Apartment Building.\n\n                       DETECTIVE ATWOOD\n             Our best hope is if someone in\n             there saw something.\n\nA MAN comes out from behind the next door fence and strides\npurposefully toward them.\n\n                       MAN\n             Detective Tracy Atwood?\n\n                       DETECTIVE ATWOOD\n             Yes.\n\n                       MAN\n             This is for you.\n\nShe accepts the official looking document being offered.\n\n                       MAN\n             You have been served.\n\n\n\n                                                   (CONTINUED)\n\n                                                        18.\nCONTINUED:\n\n\n                       DETECTIVE ATWOOD\n             You fucking asshole!! I'm in the\n             middle of a fucking murder\n             investigation!!\n\n                       MAN\n                 (backing away)\n             Hey, take it easy lady, I'm just\n             the messenger.\n\n                          DETECTIVE ATWOOD\n             Goddamit!!\n\n                       SNYDER\n             What is it?\n\n                       DETECTIVE ATWOOD\n             My soon to be ex-husband's scumbag\n             lawyer is trying to show me how\n             painful she can make my life if I\n             don't give them what they want.\n\n                       SNYDER\n             This is not the Doctor.\n\n                       DETECTIVE ATWOOD\n             The doctor was a couple years ago.\n             This one is my stupid mistake.\n\nINT. CHURCH HALL Ñ DAY\n\nAn AA Meeting is getting started. Mr. Brooks is one of the\nASSEMBLED. The LEADER steps into the semicircle of Men and\nWomen.\n\n                       LEADER\n             Are there any new members?\n\nA WOMAN comes forward.\n\n                        WOMAN\n             Hi, my name is Vaughn and I'm an\n             alcoholic.\n\nShe rejoins the circle. Mr. Brooks separates himself from the\nOthers.\n\n                       MR. BROOKS\n             Hi, my name is Earl and I'm an\n             addict.\n\nWhen he rejoins the circle, Marshall is there to greet him.\n\n\n                                                  (CONTINUED)\n\n                                                        19.\nCONTINUED:\n\n\n                       MARSHALL\n             You're such a fucking hypocrite. If\n             you were honest you would step out\n             there and say 'Hi, I'm Earl. I\n             killed two people last night and I\n             really got off on it, but I need\n             your help to be cured.'\n\n                       MR. BROOKS\n             I'm different Marshall, I won't\n             argue that with you. This is the\n             only place that has ever helped me\n             be normal and I've been straight up\n             until last night for the past two\n             years. I'm not going to kill again\n             and I'm not going to quit coming\n             here because it upsets you.\n\n                       MARSHALL\n             Yeah but for the next 29 days\n             you're going to have to step out\n             there and say 'Hi, I'm Earl, I'm an\n             addict.' And everybody will know\n             you fell off the wagon. Don't you\n             feel stupid doing that?\n\n                       MR. BROOKS\n             No. I feel good.\n\nEXT. INDUSTRIAL SECTION OF CHICAGO Ñ DAY\n\nA Cab arrives at the Front Entrance of the BROOKS BOX\nFACTORY, a long three story brick Building.\n\nA YOUNG WOMAN, 19, is dropped off along with an assortment of\nluggage and boxes.\n\nINT. BROOKS BOX FACTORY Ñ DAY\n\nIt's loud. We follow a thin piece of cardboard as one machine\ndeals it off the bottom of a stack into the maw of another\nmachine.\n\nThat machine prints one side of the cardboard blue.\n\nIt is handed off to the third machine which cuts the flaps.\nThe fourth machine folds and glues those flaps and spits the\npiece of cardboard out onto a conveyor belt as a box.\n\nWearing safety glasses and ear protectors along with his\nbusiness suit, Mr. Brooks picks up the box and hands it to\none of three similarly attired MEN, standing nearby.\n\n\n                                                   (CONTINUED)\n\n                                                         20.\nCONTINUED:\n\n\n                       MR. BROOKS\n             This is not the top of the line or\n             the bottom, but for the money we're\n             talking about this is the quality I\n             can provide you.\n\nAs Mr. Brooks talks the Men pass the box between them.\n\n                       MR. BROOKS\n             Your packaging is the first\n             impression your customers will have\n             of your product...\n\n                       PA SYSTEM\n             Mr. Brooks, your daughter is\n             waiting for you in your office.\n\nA surprised Mr. Brooks grabs a quick look at the PA Speaker,\nthen continues.\n\n                       MR. BROOKS\n             ... We'd love to work you with on\n             the design. It's fun to challenge\n             our machines. If you check around,\n             you'll find we're not the cheapest,\n             but we are the best.\n\nINT. RECEPTION AREA - BROOKS BOX FACTORY Ñ DAY\n\nOn his way through to his office, Mr. Brooks smiles absently\nat a MAN waiting on the couch. The pleasant-looking Man in\nhis early 30's, nods.\n\nMr. Brooks stops at his SECRETARY's desk.\n\n                       MR. BROOKS\n             Sunday, did Jane call and say she\n             was coming?\n\n                       SUNDAY\n             I would have given you that\n             message, Mr. Brooks. She has boxes\n             and suitcases downstairs.\n\n                       MR. BROOKS\n             Hold my calls.\n\nINT. MR. BROOKS' OFFICE Ñ DAY\n\n                       MR. BROOKS\n                 (coming in)\n             What are you doing here, Gorgeous?\n\n\n                                                   (CONTINUED)\n\n                                                          21.\nCONTINUED:\n\n\nThe 19 year old Girl we saw arrive by cab stands up and\nthrows her arms around Mr. Brooks.\n\n                       JANE\n             I'm sorry, Daddy, please don't be\n             angry with me.\n\nMr. Brooks kisses Jane on the forehead and goes to sit at his\ndesk.\n\n                       MR. BROOKS\n             I can guess what you've done, but\n             why don't you tell me and then I'll\n             decide.\n\n                       JANE\n             I dropped out of school.\n\n                       MR. BROOKS\n             Okay. Have you told your mother\n             this?\n\n                       JANE\n             No. I wanted to speak to you first.\n\n                       MR. BROOKS\n             You'll have to tell her, I'm not\n             going to do that for you, and then\n             together the three of us will\n             decide where to go from here.\n\n                       JANE\n             I've thought a lot about this, Dad.\n             College is a waste of time for me.\n\n                       MR. BROOKS\n             I don't know how you know that half\n             way through your Freshman year,\n             but...\n\n                       JANE\n             You didn't go to college, Dad, and\n             you're successful. I want to come\n             and work for you.\n\nSitting on the couch:\n\n                       MARSHALL\n             She's not telling you everything,\n             she's hiding something.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        22.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n          I know.\n              (to Jane)\n          I'm not hiring right now.\n\n                    JANE\n          Just listen to me. What would\n          happen to the business if, God\n          forbid, something happened to you?\n          Mom would probably have to sell to\n          strangers. I'm willing to start at\n          the bottom, you can treat me as a\n          regular employee, I want to learn\n          everything there is to know about\n          running the box business, and then\n          when the time comes, the business\n          would stay in the family.\n\n                    MR. BROOKS\n          That's sweet, but you're talking\n          about emotion, not business. In\n          fact your mother and I came very\n          close to selling out last year.\n\n                    JANE\n          What?!\n\n                    MR. BROOKS\n          If we had been offered a little\n          more money, and they may come back\n          to us, we will sell.\n\n                    JANE\n          What would you do without...?!\n\nThere's a knock on the door.\n\n                    MR. BROOKS\n          Yes?\n\nSunday, the secretary, comes in and crossing to Mr. Brooks:\n\n                    SUNDAY\n          I'm sorry, I know you didn't want\n          to be disturbed, the Man in the\n          waiting room insisted I give you\n          this.\n\nShe hands Mr. Brooks a letter-size envelope.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                           23.\nCONTINUED: (3)\n\n\n                    SUNDAY\n          He said you would find what's\n          inside very interesting.\n\n                    MR. BROOKS\n          What is he? A salesman?\n\n                    SUNDAY\n          He won't say. I've never seen him\n          before. I can tell him to go away\n          if you want me to.\n\n                    MR. BROOKS\n          That's okay.\n\nShe leaves. Slicing the flap of the envelope, Mr. Brooks\npicks up with Jane.\n\n                    MR. BROOKS\n          Part of spending the four years in\n          college is to...\n\nMr. Brooks can now see the contents of the envelope.\n\nTwo snapshot-size PHOTOS taken with a high speed digital\ncamera. One shows the right side of Mr. Brooks's cheek.\n\nHe is in no way identifiable, but that blur of flesh appears\nto be looking at the dead dance Couple.\n\nThe second Photo is a clear shot of Mr. Brooks closing the\ncurtains with the dead dance Couple behind him.\n\nNeither Mr. Brooks's voice or his face betray the enormity of\nwhat he's looking at.\n\n                    MR. BROOKS\n          ... eh... to give yourself the\n          chance to find out who you are and\n          what you want to do.\n\n                    JANE\n          I'll talk to Mom, but I'm not going\n          back to school.\n\n                    MR. BROOKS\n          Where would you live?\n\n                    JANE\n          To save money I would move back\n          home, but no rules, no curfew, I\n          want to be treated like an adult.\n\n\n                                                  (CONTINUED)\n\n                                                        24.\nCONTINUED: (4)\n\n\nMr. Brooks allows himself a slight smile.\n\n                    MR. BROOKS\n          Would you pay for your food, would\n          you pay rent?\n\n                    JANE\n          No, dad, you're a very wealthy man,\n          you can afford to keep me.\n\nMr. Brooks presses his Intercom.\n\n                    MR. BROOKS\n          Sunday, would you show the\n          gentleman who gave you the envelope\n          to the conference room, and tell\n          him I'll meet him there and...\n              (to Jane)\n          What happened to the BMW?\n\n                    JANE\n          A friend is driving it across\n          country, it'll be here next\n          weekend.\n\n                    MR. BROOKS\n              (to Sunday, through\n               Intercom)\n          And get Jane a cab.\n\nHe picks up the phone and holds it out to Jane.\n\n                    MR. BROOKS\n          Call your mother.\n\n                    JANE\n          Are you going to give me a job?\n\n                    MR. BROOKS\n          If it were up to me, and I think\n          your mother will agree with this,\n          you should go back to school.\n\nINT. HALLWAY - BROOKS BOX FACTORY Ñ DAY\n\nMr. Brooks comes around the corner. He's raving at Marshall\nwho's walking beside him.\n\n                    MR. BROOKS\n          You see all of this?! The factory,\n          the houses, the cars, the money,\n          the respect!!...\n\n\n                                                  (CONTINUED)\n\n                                                        25.\nCONTINUED:\n\n\nA different angle in the same hallway shows Mr. Brooks\nwalking away from us. A passing EMPLOYEE crosses him. The Men\nnod to each other. Marshall is nowhere in sight.\n\n                        MR. BROOKS (V.O.)\n             ... I like them! I don't want to\n             lose them!\n\nAnd then we're back to the original angle and Marshall is\nagain in the picture.\n\n                       MR. BROOKS\n             ... That's why I didn't want to do\n             the dance Couple!\n\n                       MARSHALL\n             Stop your fucking whining, Earl,\n             you enjoyed doing that Couple just\n             as much as I did, and look on the\n             bright side, he came to us he\n             didn't go to the Cops. If he tries\n             to shake us down we kill him.\n             Period. We make it fun but we kill\n             him. End of story.\n\nINT. CONFERENCE ROOM - BROOKS BOX FACTORY Ñ DAY\n\nThe Man from the Reception Area is nervously admiring a\ndisplay of Mr. Brooks's ceramic pieces. He turns at the sound\nof the door opening behind.\n\n                       MR. BROOKS\n             What can I do for you, Mr...?\n\n                       MAN\n             ... Let's say, 'Smith'.\n\n                       MR. BROOKS\n             Okay, Mr. Smith.\n\nMr. Brooks motions him to a seat.\n\n                       MR. SMITH (MAN)\n                 (sitting)\n             Before you get the wrong\n             impression, Mr. Brooks, I'm not\n             here to shake you down.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        26.\nCONTINUED:\n\n\n                       MR. BROOKS\n                 (holding up the photos)\n             Then these are the only copies of\n             these photos and you have no\n             others.\n\n                       MR. SMITH\n             No. I have other copies and other\n             photos, and if something were to\n             happen to me...\n\n                       MR. BROOKS\n             How did you find me, Mr. Smith?\n\n                       MR. SMITH\n             You're 'Man of the Year', Mr.\n             Brooks. Your picture was in the\n             paper. If it hadn't been, I don't\n             know what I would have done.\n\n                       MR. BROOKS\n             Lucky me. What is it that I can\n             help you with?\n\n                       MR. SMITH\n             I've been watching that Couple for\n             months, they liked to make love\n             with the blinds open. Sometimes I\n             would take pictures, you know,\n             visual aides for later. It was fun,\n             it was a great way to get off; I\n             thought, until I saw you kill them.\n             I have to tell you I have never\n             ever felt a rush like that ever. I\n             know you're the Thumbprint killer,\n             you've done this before. What I\n             want is to go with you the next\n             time you kill someone. And I would\n             like that to be soon.\n\nFrom the end of the table, Marshall cackles a laugh.\n\n                       MARSHALL\n             And you were worried that this was\n             going to be unpleasant. The answer\n             is simple. Just tell him you've\n             decided never to kill again and\n             he'll go away.\n\n                       MR. BROOKS\n             You enjoy watching me suffer, don't\n             you?\n\n\n                                                   (CONTINUED)\n\n                                                          27.\nCONTINUED: (2)\n\n\n                    MARSHALL\n          In a word, yes.\n\n                    MR. BROOKS\n          Where do you think he has the other\n          pictures?\n\n                    MARSHALL\n          He put them in a safety deposit box\n          but I'll bet the box is at the bank\n          where he has his checking account\n          and the key is on his keychain. He\n          really wants to do this, he's not\n          going to go to the cops.\n\nMr. Smith who has grown uneasy under Mr. Brooks's stare\nswallows:\n\n                    MR. SMITH\n          So do we have a deal?\n\n                    MR. BROOKS\n          From the angle of these pictures...\n              (taps the envelope)\n          ... you live on the third floor of\n          the apartment building across the\n          alley from the Couple's house.\n\n                    MR. SMITH\n          Well... eh.\n\n                    MR. BROOKS\n          Yes or no, Mr. Smith?\n\nMr. Smith nods 'yes'.\n\n                    MR. BROOKS\n          What time do you get home from\n          work?\n\n                    MR. SMITH\n          Six thirty, seven, depending on the\n          traffic.\n\n                    MR. BROOKS\n          You can never come here again, you\n          can never call me. Do you\n          understand that?\n\n                    MR. SMITH\n          Yes.\n\n\n\n                                                  (CONTINUED)\n\n                                                        28.\nCONTINUED: (3)\n\n\n                    MR. BROOKS\n          Tomorrow night, not tonight,\n          tomorrow night, at eight o'clock,\n          leave your apartment and walk east.\n          I'll pick you up.\n\n                    MR. SMITH\n          If you're thinking of doing\n          anything to me, Mr. Brooks...\n\n                    MR. BROOKS\n          We're both aware of the rules, Mr.\n          Smith, but I feel I must warn you.\n          If it turns out that you enjoy\n          killing, it can become very\n          addictive. It could ruin your life.\n\n                    MR. SMITH\n          I want to do this.\n\n                    MR. BROOKS\n              (looks at Marshall)\n          Have I covered everything?\n\n                    MARSHALL\n          I can't think of anything else.\n\nMr. Brooks stands up and opens the door.\n\n                    MR. BROOKS\n          I'll see you tomorrow night, Mr.\n          Smith.\n\nOn his way out, Mr. Smith nods. Mr. Brooks closes the door.\nHis chin drops on his chest and he sighs.\n\n                    MR. BROOKS\n              (under his breath)\n          Please God, please help me find a\n          way not to do this.\n\nEXT. DOWNTOWN CHICAGO Ñ DAY\n\nDetective Atwood comes out of the CROWD on the sidewalk and\nenters a Highrise.\n\nINT. CONFERENCE ROOM - LAW OFFICES Ñ DAY\n\nAtwood and her ATTORNEYS, a gray-haired Man in his 60's, and\nan Asian Woman about the same age as Atwood are on one side\nof the table.\n\n\n\n                                                  (CONTINUED)\n\n                                                           29.\nCONTINUED:\n\n\nJESSE, Atwood's soon to be ex-husband, very handsome,\nslightly younger than Atwood, and SHEILA, his attractive\ndivorce lawyer, sit across from them.\n\n                       ASIAN ATTORNEY\n             We've talked to our client and\n             we've come up with a number that we\n             feel is more than fair.\n\nAtwood is not happy with this. The Attorney slides a sheet of\npaper to Sheila. She turns it over. On it is written:\n$750,000 -.\n\n                       ASIAN ATTORNEY\n             We can have a check for that amount\n             in your office by 6 o'clock.\n\n                       SHEILA\n             We told you at the beginning what\n             we want and that hasn't changed.\n\n                       GRAY-HAIRED ATTORNEY\n             You know as well as I do,\n             Counselor, if we go to court you're\n             not going to get a million five.\n\n                       SHEILA\n             I don't know. Let's see.\n\nShe holds up the front page of the Chicago Tribune. \"THE\nHANGMAN ESCAPES\" story is circled in red.\n\n                       SHEILA\n             This is the front page of\n             yesterday's paper...\n                 (reads)\n             'Hangman Escapes'... eh... now,\n             here it is... 'after torturing the\n             young women, Thorton Meeks would\n             hang them in public places - church\n             steeples, balconies, Freeway\n             overpasses'... Your client captured\n             Mr. Meeks. This is just one example\n             of the cases my client lived\n             through when he was married to your\n             client.\n\n                       ASIAN ATTORNEY\n             Your client knew Detective Atwood\n             was a homicide detective when he\n             married her.\n\n\n\n                                                   (CONTINUED)\n\n                                                     30.\nCONTINUED: (2)\n\n\n                    SHEILA\n          But he had no idea of the mental\n          anguish that being in close\n          proximity to her work would cause\n          him.\n\n                    DETECTIVE ATWOOD\n          What about the mental anguish I\n          went through being in close\n          proximity to him. Who's gonna pay\n          me for that?\n\n                    ASIAN ATTORNEY\n          We don't need to get into this,\n          Tracy.\n\n                    DETECTIVE ATWOOD\n          Yes, we do. I was the one who paid\n          for everything while we were\n          married, and now I'm being asked to\n          give him a bonus for spending time\n          with me when I've already paid for\n          it in the first place.\n\n                    JESSE\n              (to Atwood)\n          Tracy, this is not a lot of money\n          for you, and you know how upset I\n          was when Meeks said that he was\n          going to escape and he would come\n          back and kill you.\n\n                    SHEILA\n          We're quite willing to find out\n          what a court would think that\n          mental anguish is worth.\n\n                    DETECTIVE ATWOOD\n          Jesse... Darling?... you know the\n          best thing that could happen to me\n          right now? That you get hit by a\n          truck and die.\n\n                    SHEILA\n              (smiles)\n          That's it! Mr. Vialo and I are\n          leaving.\n              (she and Jesse stand up)\n          You've threatened my client, we're\n          going to ask for a restraining\n          order, and we'll see you in court.\n\n\n\n                                                (CONTINUED)\n\n                                                        31.\nCONTINUED: (3)\n\n\nThe door closes behind them.\n\n                    GRAY-HAIRED ATTORNEY\n          That's going to cost you, Tracy.\n\n                    DETECTIVE ATWOOD\n              (standing up)\n          Fuck it. It felt good.\n\nINT. APARTMENT Ñ NIGHT\n\nMoonlight seeps around the blinds to reveal Mr. Smith asleep\nin bed.\n\nBeyond the open BEDROOM door down the hall is only darkness\nuntil the eruption of illumination from a penlight\nmomentarily outlines the figure of a Man.\n\nThen we're looking at what the penlight sees.\n\nA keyring. Hands in surgical gloves isolate the - safety\ndeposit key - and press it into a soft wax block where it\nleaves its impression. The light goes off.\n\nIn the BEDROOM at the end of the hallway, Mr. Smith begins to\nsnore. The Figure coasts silently toward the sound.\n\nMr. Smith's face is sideways on the pillow. The snores and a\nlittle drool burbles out of the corner of his mouth.\n\nWHOOMP!! The impact of something landing on the bed bounces\nMr. Smith upright and awake.\n\n                    MR. SMITH\n          Ahhh!!! Ahhh!!! Ahhh!!!\n\nThe beam from the penlight hits him in the face. He raises\nhis hands to shield his eyes.\n\n                    MR. BROOKS\n          Don't worry, if I were here to kill\n          you, you would already be dead.\n\nThe penlight leaves Mr. Smith and Mr. Brooks places it\ndeliberately under his own chin casting long sinister shadows\nup his face. He's sitting on the bed next to Mr. Smith.\n\n                    MR. BROOKS\n          After you left today, I realized\n          our friendship was a little one-\n          sided.\n                    (MORE)\n\n\n                                                  (CONTINUED)\n\n                                                           32.\nCONTINUED:\n                       MR. BROOKS (CONT'D)\n             So when we meet tomorrow night\n             would you be so kind as to bring\n             all of the pictures and the memory\n             card from your camera. That way we\n             can like each other simply for who\n             we are. If you don't show up, I\n             will presume you've gone to the\n             police and I will kill you. Even if\n             I go to jail because of you,\n             someone will find you wherever you\n             are and kill you.\n\nThe penlight goes off. There's total silence.\n\n                       MR. SMITH\n                 (squeaks)\n             Mr. Brooks?...\n\nHe squints into the black.\n\n                       MR. SMITH\n             Mr. Brooks?...\n\nFinally he gathers the courage to extend a shaky hand. The\nbedside lamp goes on. The room is empty. Cautiously Mr. Smith\nswings his legs out of bed and stands up.\n\nHe forces himself to go to the door and from there curls his\narm around the jamb into the darkness.\n\nThe HALL light is dazzling.\n\nA peek into the BATHROOM shows there is nobody there. He\ncontinues on into the LIVING ROOM.\n\nHis camera equipment is on the table. The tripod is still set\nup. There is no sign of Mr. Brooks.\n\nMr. Smith eyes the front door. It's closed and the 'security\nchain' is in place!!\n\nAnother quick scan of the room. It sure seems that he's\nalone.\n\nHe opens the front door the length of the chain and looks up\nand down the hallway. It's empty. Slowly he closes the door.\n\nStanding in the light of his LIVING ROOM, Mr. Smith is more\nscared and strangely more excited than he's ever been in his\nlife.\n\n                       MR. SMITH\n             Wow!...\n\n                                                         33.\n\n\n\nINT. BROOKS HOUSE Ñ NIGHT\n\nIn a robe and pajamas, Mr. Brooks comes down the HALLWAY\ncarrying a glass of milk. The door to his Daughter's ROOM is\npartly open. By the nightlight in the plug at the head of the\nbed he can see she's asleep.\n\nINT. BEDROOM Ñ NIGHT\n\nMr. Brooks walks to the bed, leans over and kisses his\nDaughter on the cheek.\n\n                       MR. BROOKS\n                 (quietly)\n             It's nice to have you home.\n\nHe leaves.\n\nEXT. CHICAGO - MORNING\n\nThe early rays of the sun are moving down the tall buildings.\n\nEXT. BROOKS HOUSE Ñ MORNING\n\nA garbage truck is picking up the trash.\n\nINT. BROOKS HOUSE Ñ MORNING\n\nDressed for work and a smile on his face, Mr. Brooks comes\ndown the stairs.\n\nIn the BREAKFAST ROOM, the mood is decidedly different. His\nWife and Daughter are leaning against opposite walls staring\nat the floor.\n\n                       MR. BROOKS\n             What's wrong?\n\n                       EMMA\n             Ask your daughter what the real\n             reason is she dropped out of\n             school.\n\n                       JANE\n             I keep telling you it's not the\n             reason.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        34.\nCONTINUED:\n\n\n                       EMMA\n             You wanted to go to college, you\n             had good grades in High School,\n             your father helped you get into\n             Stanford, we're paying a ton of\n             money, if this is not the reason,\n             then please dear God tell me the\n             reason.\n\n                       MR. BROOKS\n                 (picking up an orange\n                  juice)\n             Why does your mother think you\n             dropped out of school?\n\n                       JANE\n             I'm pregnant.\n                 (to her Mother)\n             And it's not the reason I dropped\n             out. Being pregnant wouldn't stop\n             me from going to school if I wanted\n             to go.\n\n                       MR. BROOKS\n             Who's the father?\n\n                       JANE\n             Some guy I was seeing.\n\n                       EMMA\n             Does he know?\n\n                       JANE\n             Yes, he's a married man and he\n             doesn't want to have anything to do\n             with me.\n\n                       EMMA\n             Oh, Honey, I'm so sorry.\n\n                       JANE\n             I'm going to have an abortion\n             anyway, so there is nothing to get\n             upset about. I wasn't even going to\n             tell you guys.\n\nMr. Brooks looks directly at his Daughter.\n\n                       MR. BROOKS\n             There will be no abortion.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          35.\nCONTINUED: (2)\n\n\n                    JANE\n          Daddy, you are not going to tell me\n          what to do. It's my body and I will\n          do what I want to do with it.\n\nMr. Brooks's eyes find Emma's. Almost imperceptibly she\nshakes her head 'no'.\n\n                    MR. BROOKS\n              (to his Daughter)\n          You're right. I'm sorry. I said it\n          wrong. I'm not trying to tell you\n          what to do. I'm trying to say that\n          a grandchild would be a wonderful\n          gift for your mother and me.\n\n                    EMMA\n          Please, Honey, don't have an\n          abortion.\n\n                    JANE\n          Would you really want to have a\n          grandchild, even though I'm not\n          married?\n\n                    MR. BROOKS\n          Yes. The child is what's important.\n          We would love it and cherish it\n          completely and help you raise it.\n\n                    JANE\n          If it means that much to you, I'll\n          think about it.\n\nINT. GARAGE - BROOKS HOUSE Ñ MORNING\n\nWalking to the Lexus, Mr. Brooks notices Marshall waiting for\nhim on the passenger side.\n\n                     MR. BROOKS\n              (smiles)\n          Well, we were right, she was hiding\n          something.\n\n                     MARSHALL\n              (flat)\n          Pregnant's not all of it. She's\n          hiding something bigger. Much\n          bigger.\n\n                    MR. BROOKS\n          You think so?\n\n\n                                                  (CONTINUED)\n\n                                                          36.\nCONTINUED:\n\n\n                       MARSHALL\n             I know so, and so do you.\n\nINT. CRIME LAB Ñ AFTERNOON\n\nLarge and small Color Photographs pinned to a corkboard\ncreate a Collage of the dance Couple murder scene.\n\nStanding in front of this is CAPTAIN LISTER, a tall slim open-\nfaced Woman in her mid-fifties, and the lead Crime Scene\nTechnician we saw earlier at the Murder House.\n\n                       TECHNICIAN\n             It's not what's here, it's what's\n             not here that's interesting.\n             There's not a trace of anything\n             foreign. If I didn't know better\n             I'd say these people were killed by\n             a ghost.\n\n                       CAPTAIN LISTER\n             The autopsy found a tiny piece of\n             plastic in the female victim's\n             brain.\n\n                       TECHNICIAN\n             We're checking with the ammunition\n             manufacturers.\n\n                       DETECTIVE ATWOOD\n                 (entering the room)\n             That's a dead end, he bags the gun.\n\n                       TECHNICIAN\n             I don't understand.\n\n                       DETECTIVE ATWOOD\n             He ziplocks a one gallon plastic\n             freezer bag to his wrist over the\n             gun. Bang. Bang. A little bit of\n             plastic is carried by the first\n             slug, the ejected shells go into\n             the bag and it limits the powder\n             residue.\n                 (to Captain Lister)\n             I hear you were looking for me.\n\n                       CAPTAIN LISTER\n                 (to the Technician)\n             Sigy...\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        37.\nCONTINUED:\n\n\n                       SIGY (TECHNICIAN)\n             Yeah, okay...\n                 (to Atwood)\n             Did you find anything? Did they\n             have enemies, did they owe money,\n             did anybody ever notice someone\n             watching the house?\n\n                       DETECTIVE ATWOOD\n             So far they are Mr. and Miss\n             Normal.\n\n                       SIGY\n                 (backing away)\n             If you find anything, call, it\n             might help me.\n\nHe's gone.\n\n                       CAPTAIN LISTER\n             I received a subpoena from your\n             husband's lawyer for your work\n             records, where you were, date and\n             times for the past two years.\n\n                       DETECTIVE ATWOOD\n             That's blackmail.\n\n                       CAPTAIN LISTER\n             Almost three quarters of your cases\n             are current. I can't let that\n             information go into open court. So\n             until you settle your divorce, I'm\n             going to have to put you on a desk.\n\n                       DETECTIVE ATWOOD\n             That's also blackmail.\n\n                       CAPTAIN LISTER\n             That's one of your big problems,\n             Atwood, you don't know how to ask\n             for help.\n\n                       DETECTIVE ATWOOD\n             Do you know what he did to me?\n\n                       CAPTAIN LISTER\n             You can't grow old as a woman\n             without having at least one lousy\n             man in your life.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                     38.\nCONTINUED: (2)\n\n\n                    DETECTIVE ATWOOD\n          I was so stupid. While we were\n          married, while I paid for him to\n          live, the son of a bitch fucked\n          every woman he could get his hands\n          on. He fucked my friends, he even\n          fucked a cousin of mine. Everyone\n          knew but me, and they were laughing\n          at me behind my back. He made me\n          look like an idiot. I was a joke.\n\n                      CAPTAIN LISTER\n          And?...\n\n                      DETECTIVE ATWOOD\n          And what?\n\n                    CAPTAIN LISTER\n          Get over it.\n\n                    DETECTIVE ATWOOD\n          I made him an offer. I'm not going\n          to give him one red cent more.\n\n                    CAPTAIN LISTER\n          I hear what he's asking for, you\n          could take out of pocket change. Do\n          that and go on with your life.\n\n                    DETECTIVE ATWOOD\n          I couldn't live with myself if I\n          did.\n\n                    CAPTAIN LISTER\n          I'll spread your work among the\n          other guys and the FBI will be here\n          on thursday...\n              (motions to the pictures)\n          ... they'll take over this case.\n\n                    DETECTIVE ATWOOD\n          Please, these are my cases. Nobody\n          knows them like me. Don't give them\n          away and don't give the Thumbprint\n          Killer to the FBI. He's killed\n          people in twelve other states, let\n          them fuck up those investigations.\n          This one's mine.\n\n\n\n\n                                                (CONTINUED)\n\n                                                           39.\nCONTINUED: (3)\n\n\n                    CAPTAIN LISTER\n              (opening the door to\n               leave)\n          You heard Meeks escaped?\n\n                    DETECTIVE ATWOOD\n          Yeah.\n\n                    CAPTAIN LISTER\n          Do you want a detail on you in case\n          he comes after you?\n\n                    DETECTIVE ATWOOD\n          I can take care of myself.\n\n                    CAPTAIN LISTER\n          You're a good cop, Tracy, I don't\n          want to lose you, but you have to\n          help me if you want me to help you.\n\nINT. HALLWAY Ñ CRIME LAB Ñ AFTERNOON\n\nAtwood is waiting for an elevator. It arrives. The doors\nopen. The car is empty.\n\nINT. ELEVATOR Ñ AFTERNOON\n\nAtwood gets in and presses the key for her destination, then\nslumps into a corner for the ride. The doors close. The\nelevator begins to move.\n\nAll at once Atwood screams. Her pent-up anger and frustration\nrip the air and she goes nuts.\n\nShe punches the wall of the elevator, kicks it, throws\nherself to the other side, bangs her head against that wall,\npunches it, kicks it, all the while screaming.\n\nThen the tears come. The screams stop and she settles upright\nagainst the back wall, where she strikes her chest repeatedly\nwith the flat of her closed hand.\n\n                    DETECTIVE ATWOOD\n          What is wrong with me? What is\n          wrong with me? What is wrong with\n          me?\n\nEXT. MURDER HOUSE Ñ NIGHT\n\nIt's raining. The yellow Police tape that still circles the\nyard snaps in the wind.\n\n\n\n                                                  (CONTINUED)\n\n                                                        40.\nCONTINUED:\n\n\nUp the driveway, out of sight of all the other homes, there's\na movement at the side door of the house.\n\nA closer inspection reveals that it's Detective Atwood. From\nunder her umbrella she studies her surroundings and as if\nshe's speaking to the killer, she speaks to herself.\n\n                       DETECTIVE ATWOOD\n             Did you choose them because of\n             where they lived or how they looked\n             or what jobs they had? Or did you\n             just pick them because at the\n             instant you saw them, you had\n             decided to kill someone? The side\n             door was perfect. No one could see\n             you pick the lock.\n\nWith a key she lets herself in.\n\nEXT. STREET Ñ NIGHT\n\nParked against the curb opposite the driveway of the Murder\nHouse is an old green Pontiac Convertible with the top up.\n\nThe driver's window is down and from inside a WOMAN, late\n20's, is watching the house.\n\nINT. MURDER HOUSE Ñ NIGHT\n\nAtwood stops in the PANTRY almost in the exact spot where Mr.\nBrooks stopped.\n\nThe quiet is filled by the rain drumming on the roof. The\nwind rattles the windows.\n\n                        DETECTIVE ATWOOD\n             How did you know where they were in\n             the house?\n\nShe steps into the KITCHEN. On the way across she bumps into\na chair.\n\n                       DETECTIVE ATWOOD\n             It's darker tonight than it was on\n             your night. But still how did you\n             manage not to bump into the\n             furniture? Did you have a little\n             light? That would be too dangerous.\n             I'll bet you were in the house\n             before.\n                       (MORE)\n\n\n\n                                                   (CONTINUED)\n\n                                                        41.\nCONTINUED:\n                       DETECTIVE ATWOOD (CONT'D)\n             So I should ask the neighbors if\n             they saw a meter reader around the\n             house or a telephone repairman or\n             someone from the gas company.\n\nThese musings take her through the LIVING ROOM to the\nentrance of the HALLWAY where she pauses and looks both ways.\n\n                       DETECTIVE ATWOOD\n             Once again, how did you know where\n             they were? Did you check the rooms\n             before you found them? She had his\n             semen in her vagina, they had just\n             made love, did you hear them or was\n             there a light on?\n\nShe steps into the HALL.\n\n                       DETECTIVE ATWOOD\n             And when did you bag the gun?\n             Because even though I'm sure you're\n             an expert at it, there's still a\n             chance of noise from the plastic.\n\nShe continues down the HALL to the BEDROOM.\n\n                       DETECTIVE ATWOOD\n             Was the door open or did you have\n             to open it?\n\nShe opens the door and goes in.\n\n                       DETECTIVE ATWOOD\n             Were they asleep or awake? Was the\n             light on, or did you turn it on?\n             Because I know you, you wouldn't\n             risk a shot in the dark.\n\nShe turns on the overhead light.\n\n                       DETECTIVE ATWOOD\n             Too bright. What if it wasn't that\n             light that was on, but this one?\n\nShe turns on a bedside light and goes back to the door and\nturns off the overhead.\n\nIf the dance Couple were on the bed and their blood was not\non the wall, the room would look exactly the way it did when\nMr. Brooks said 'hello'.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        42.\nCONTINUED: (2)\n\n\n                    DETECTIVE ATWOOD\n          That's better... What thrill do you\n          get by killing people? Is it\n          sexual, is it hate, is it power? Do\n          you feel remorse? Probably that\n          part of your brain doesn't exist.\n          Do you have emotions of love or\n          affection or joy? Or have you\n          learned to fake them so you won't\n          stand out in a crowd.\n\nShe's at the window now, feeling the curtains.\n\n                    DETECTIVE ATWOOD\n          What if these are stuck closed\n          because you yanked them closed?\n          Which means they were open when you\n          came into the room.\n\nShe separates the fabric and looks out the rain-streaked\nwindow at the four story building across the alley. There are\nlights on in almost all the apartment windows.\n\n                    DETECTIVE ATWOOD\n          If Mr. and Miss Normal made love\n          with the curtains open and the\n          lights on, someone in that building\n          noticed them and may have seen you.\n\nShe allows the fabric to drop back into place and turns to\nlook at the bed.\n\n                    DETECTIVE ATWOOD\n          Was that what you were angry about?\n\nINT. APARTMENT BUILDING Ñ NIGHT\n\nMoving slowly across a neutral colored wall.\n\n                    DETECTIVE ATWOOD (O.S.)\n          Thank you for your time.\n\nA door is closed. We come to the corner and are looking down\na HALLWAY at Atwood coming toward us. We move to her and\narrive just as she raises her fist to knock.\n\nBefore she can, the door opens and she and Mr. Smith who is\non his way out of his Apartment are surprised that the other\none is suddenly there. Each one takes a half step back.\n\nPhwap! The manila envelope that was wedged under Mr. Smith's\nleft arm hits the floor.\n\n\n                                                  (CONTINUED)\n\n                                                         43.\nCONTINUED:\n\n\n                       MR. SMITH\n             Oh! You scared me.\n\n                       DETECTIVE ATWOOD\n             I'm sorry...\n                 (bends down and picks up\n                  the envelope)\n             ... I was about to knock. I'm\n             Detective Atwood with the Chicago\n             Police.\n\n                        MR. SMITH\n                 (accepting the envelope)\n             Thank you.\n\nThrough the open door, Atwood can see Mr. Smith's camera on a\ntable and the collapsed tripod leaning against the wall.\n\n                       DETECTIVE ATWOOD\n             Are you a photographer...\n                 (glances at her list)\n             Mr. Baffert?\n\n                       MR. SMITH\n             No... eh, it's kind of a hobby, I\n             just started.\n\n                       DETECTIVE ATWOOD\n             I don't know if you're aware but\n             there was a murder...\n\n                       MR. SMITH\n             Oh, yes in the house across the\n             alley...\n\n                       DETECTIVE ATWOOD\n             Did you happen to see anything\n             unusual or suspicious that night\n             around that house? Anything at all?\n\nMr. Smith puts on his thinking expression and pauses a little\nbit before:\n\n                       MR. SMITH\n             No... I wondered that when I heard\n             what happened, but... no.\n                 (looks at his watch)\n             I'm sorry, I'm meeting someone and\n             I don't want to be late.\n\nHe moves into the Hallway closing the door behind him.\n\n\n\n                                                   (CONTINUED)\n\n                                                           44.\nCONTINUED: (2)\n\n\n                    DETECTIVE ATWOOD\n          Here's my card, if you hear\n          anything or remember anything.\n\n                    MR. SMITH\n              (taking the card)\n          I wish I could be of more help, but\n          sorry.\n\nWatching him walk away amid the crinkle of his raincoat,\nDetective Atwood, maybe because of her woman's intuition or\nmaybe because she's a good cop, wonders what is in that\nmanila envelope under his arm.\n\nThe thought is gone almost as soon as it comes and she faces\nabout to the next door.\n\nEXT. STREET Ñ NIGHT\n\nHunched against the rain, Mr. Smith is acutely aware of the\ntraffic. His eyes strain to see the Occupants of each passing\ncar. He doesn't give a second thought to the older non-\ndescript Toyota parked against the far curb.\n\nINT. TOYOTA Ñ NIGHT\n\nMr. Brooks is in the driver's seat. Marshall is in the back.\nThey're both tracking the progress of Mr. Smith.\n\n                    MR. BROOKS\n          He looks clean. He looks like he's\n          alone.\n\n                    MARSHALL\n          No, I'm telling you he wants to do\n          this.\n\n                    MR. BROOKS\n          I guess I should turn around and go\n          pick him up.\n\n                    MARSHALL\n          Nah. Just honk. Maybe he'll get\n          killed crossing the street and save\n          us the mess of doing it.\n\nEXT. STREET Ñ NIGHT\n\nHonk!! Honk!! Mr. Smith looks around. He's not sure that\nsound was for him. But when the Toyota honks again and\nflashes it's lights, Mr. Smith waves and splashes to the\ncenter of the street.\n\n\n                                                  (CONTINUED)\n\n                                                        45.\nCONTINUED:\n\n\nEven though he stops to let it pass, a car sounds its horn\nand swerves to avoid him. Mr. Smith crosses behind the Toyota\nand opens the passenger door.\n\nINT. TOYOTA Ñ NIGHT\n\nMr. Smith flops into the seat.\n\n                       MR. SMITH\n             Woof! It's really coming down out\n             there.\n\n                       MR. BROOKS\n             They say it'll be sunny tomorrow.\n\nMr. Smith fumbles with the buttons and zipper on his\nraincoat.\n\n                       MR. SMITH\n             I never trust those guys, when they\n             say it's going to be clear it\n             always rains and when they say it's\n             going to rain, it's sunny.\n\nHe comes up with the manila envelope.\n\n                       MR. SMITH\n             Here's what you asked for.\n\nMr. Brooks takes it and hefts it.\n\n                       MR. BROOKS\n             The pictures and the memory card\n             all here?\n\n                       MR. SMITH\n             Yeah.\n\n                       MR. BROOKS\n             You and I both know that not all\n             the pictures are in here and you\n             made a copy of the Memory Card,\n             isn't that so?\n\n                       MR. SMITH\n             But you understand my position.\n\nMr. Brooks favors him with a wolfish smile.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        46.\nCONTINUED:\n\n\n                       MR. BROOKS\n             Yes, I do. But it's my hope that\n             once you get to know me better\n             you'll feel comfortable in giving\n             me all that I've asked for.\n\n                       MR. SMITH\n             That sounds fair. Oh, I almost\n             forgot. I thought you might be\n             interested in this.\n\nHis hand comes forward with a card.\n\n                       MR. SMITH\n             It's the policewoman who's looking\n             for you.\n\nMarshall snaps forward from the back seat.\n\n                       MARSHALL\n             Wow! We've never known anyone who's\n             looking for us before.\n\nMr. Brooks pinches the rectangle of paper away from Mr. Smith\nfor a closer view.\n\n                       MARSHALL\n             We've got to find out everything\n             there is to know about this woman.\n\n                       MR. BROOKS\n             This is too close, Marshall, too\n             damn close.\n\nMr. Smith interrupts Mr. Brooks's focus on Detective Atwood's\ncard.\n\n                       MR. SMITH\n             So, what do we do now? What's the\n             plan for the evening?\n\nMr. Brooks slips the envelope under the seat and starts the\ncar.\n\n                       MR. BROOKS\n             We drive around until we see\n             someone we think we might enjoy\n             killing.\n\n                       MR. SMITH\n             Really? That's it? I thought you\n             might already have someone in mind.\n\n\n                                                   (CONTINUED)\n\n                                                        47.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n          I don't enjoy this, Mr. Smith. I do\n          it because I'm addicted to it. And\n          before you entered my life I had\n          vowed I would never kill again. So\n          this is your party, you can chose\n          anyone you want and we'll do it\n          together.\n\n                    MR. SMITH\n          Can it be someone I know?\n\n                    MR. BROOKS\n          You never kill someone you know.\n          That's the easiest way to get\n          caught.\n\nEXT. STREET Ñ NIGHT\n\nThe Toyota enters the traffic.\n\nINT. APARTMENT BUILDING Ñ NIGHT\n\nAn older WOMAN in a Stewardess uniform is standing in the\ndoorway of her apartment. Atwood is in front of her in the\nHALL.\n\n                     STEWARDESS\n          I wasn't in town that night, my\n          roommate was, maybe he saw\n          something.\n\n                    DETECTIVE ATWOOD\n          May I speak to him?\n\n                    STEWARDESS\n          He's on his way to Tokyo now, he's\n          also a Flight Attendant.\n\n                    DETECTIVE ATWOOD\n          Did the victims ever leave the\n          curtains in the bedroom open?\n\n                    STEWARDESS\n          All the time. I don't know if they\n          thought we couldn't see them\n          \"fucking\" or they didn't care.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                         48.\nCONTINUED:\n\n\n                       DETECTIVE ATWOOD\n             Here's my card, could you ask your\n             roommate to call me when he gets\n             back, the people at that number\n             will find me any hour of the day or\n             night.\n\n                       STEWARDESS\n             I won't be here, but I'll leave him\n             a note.\n\nEXT. STREET Ñ NIGHT\n\nMr. Brooks' Toyota is cruising in the flow of traffic.\n\n                       MR. BROOKS (V.O.)\n             ... maybe I already know how to\n             pick the locks on the house, if I\n             don't...\n\nINT. TOYOTA Ñ NIGHT\n\n                       MR. BROOKS\n             ... I buy one of those locks and I\n             practice on it, same with the\n             alarm... some I know how to bypass,\n             some I have to study.\n\n                        MR. SMITH\n             You don't mind me asking these\n             questions?\n\n                       MR. BROOKS\n             No. This is your first time, you're\n             interested. And you should be if\n             you're...\n\nA neutral-colored PICKUP swerves out of the next lane into\nMr. Brooks' lane.\n\n                       MR. SMITH\n             Jesus Christ!!\n\nMr. Brooks is forced to slam on his brakes to avoid running\nup the PICKUP'S tailpipe.\n\nHOONKK!!! Mr. Brooks angrily lays on the horn.\n\nThe brake lights of the PICKUP flash in response causing Mr.\nBrooks to brake again.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          49.\nCONTINUED:\n\n\n                       MR. SMITH\n             Fuck him!! It was his fault!! What\n             an asshole!!\n\n                       MARSHALL\n                 (leans forward)\n             Maybe Mr. Smith would like to kill\n             the driver of the pickup.\n\n                       MR. BROOKS\n                 (to Mr. Smith)\n             What about the driver of the\n             pickup? What if we killed him?\n\n                       MR. SMITH\n             Oh, fuck, yes!! I've always wanted\n             to kill someone who fucked with me\n             in traffic.\n\nThe PICKUP makes a right onto a side street. Mr. Brooks\nfollows.\n\n                       MR. BROOKS\n             Do you want to kill the driver of\n             the pickup or the owner, they may\n             not be the same.\n\n                       MR. SMITH\n             The driver.\n\n                       MR. BROOKS\n             Okay we'll follow until we get a\n             look at him, or her; would it\n             bother you to kill a woman?\n\n                       MR. SMITH\n             No. An asshole's an asshole.\n\nMr. Brooks begins to slow down.\n\n                       MR. SMITH\n             What are you doing?\n\n                       MR. BROOKS\n             The asshole shouldn't know we've\n             decided to follow him, or her.\n\nEXT. FOUR STORY APARTMENT BUILDING - NIGHT\n\nDetective Atwood is on her way out the Outer Door when the\nhair on the back of her neck stands on end.\n\n\n\n                                                  (CONTINUED)\n\n                                                          50.\nCONTINUED:\n\n\nFootsteps can be heard running toward her through the rain.\n\nHer hand goes under her jacket and comes out holding a Glock\n9mm.\n\nShe sidesteps out of the light into the grayness at the edge\nof the doorway.\n\nNow she sees the RUNNER. A hood hides the face. She can't\ntell if it's a Man or a Woman.\n\nDetective Atwood thumbs the Glock's safety to the 'off'\nposition.\n\nThe Runner passes, white breath coming from an unseen mouth.\n\nShe waits while the Figure recedes, then with the gun still\nin hand she fishes into a pocket for a cell phone and heads\nin the opposite direction.\n\nA finger speedials a number. After a second ring a:\n\n                          MALE VOICE\n                    (answers)\n             Yes?\n\n                       DETECTIVE ATWOOD\n                 (puts the phone to her\n                  ear)\n             It's Tracy. Can you carve out some\n             time for me tonight?... I'll be\n             home in an hour and a half. I'll\n             see you there.\n\nThe phone is shut, the umbrella unfurled and the darkness\nswallows her up.\n\nEXT. MINI MART Ñ NIGHT\n\nThe neutral-colored Pickup is parked in front. The DRIVER\ngets out.\n\nINT. TOYOTA Ñ NIGHT\n\nIt has stopped at the curb just beyond the Entrance to the\nMini-Mart parking lot.\n\nMr. Brooks and Mr. Smith watch the DRIVER come around the\nfront of another car before entering the store.\n\nThe light reveals the Driver to be a tall middle-age preppie\nguy with close cropped dark hair and dark-rimmed glasses.\n\n\n                                                  (CONTINUED)\n\n                                                        51.\nCONTINUED:\n\n\n                       MR. BROOKS\n             Would you recognize him if you saw\n             his driver's license picture?\n\n                       MR. SMITH\n             Yeah.\n\n                       MR. BROOKS\n             I've memorized the license number,\n             you write it down. When you get\n             home go on the Internet and find\n             out everything you can about this\n             guy.\n\n                       MR. SMITH\n             We aren't going to kill him\n             tonight?\n\n                       MR. BROOKS\n             No. We could, but then we wouldn't\n             be in control. We could leave loose\n             ends, and we both know the danger\n             of that.\n\n                       MR. SMITH\n                 (squints at the Pickup's\n                  license)\n             I got it.\n\n                       MR. BROOKS\n             Look at me.\n\nMr. Smith does.\n\n                       MR. BROOKS\n             Close your eyes. What's the number?\n\n                       MR. SMITH\n             VF... eh...\n\nMr. Smith opens his eyes and grins sheepishly.\n\n                       MR. BROOKS\n             Don't feel bad, I've been doing\n             this a long time...\n                 (he points to a holder on\n                  the dash)\n             Pen, paper. Write it down.\n\n                       MR. SMITH\n                 (copying the number)\n             What was your first time?\n\n\n                                                   (CONTINUED)\n\n                                                        52.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n          You really don't want to know that\n          much about me, Mr. Smith.\n\nINT. INDOOR POOL Ñ NIGHT\n\nThe lane lines are in place.\n\nDetective Atwood is the only one in the water. Up and down\nshe goes with a long smooth stroke flipping the turns. She's\nnot swimming for pleasure, she's working out.\n\nThe underwater lights cast rippling shadows on the walls and\nceiling and since they are the only illumination, the room\nfeels spooky.\n\nAtwood's fingers touch the wall. She raises her head to check\nher time, then takes off her goggles.\n\nHanging onto the gutter she tries to catch her breath, lowers\nherself under the surface, blows a lungful of bubbles, comes\nup to face LARRY, a Man slightly younger than she is, in a\nbeautiful suit, perched on the edge of the deck looking down\nat her.\n\nHe has a dress on a hangar over one shoulder and a pair of\nshoes dangling from the fingers of his other hand.\n\n                    DETECTIVE ATWOOD\n          Hi.\n\n                     LARRY\n          Hi. I brought a dress and a pair of\n          shoes. I thought we could leave\n          from here.\n\n                    DETECTIVE ATWOOD\n          Great idea.\n\nShe lifts herself to him and they kiss.\n\nINT. EXCLUSIVE SUPPER CLUB Ñ NIGHT\n\nDetective Atwood and Larry are at a balcony table overlooking\na well-populated dance floor. The Music is 40's and 50's\nperformed by a live BAND.\n\n                    LARRY\n          ... I gave him my driver's license,\n          my student ID, he didn't look\n          anything like me, luckily they\n          never checked.\n\n\n                                                  (CONTINUED)\n\n                                                          53.\nCONTINUED:\n\n\n                        DETECTIVE ATWOOD\n             I did something like that except I\n             was the one who took the test. It\n             wasn't math, a friend of mine was a\n             theology major and needed a second\n             language to get into the Master's\n             program...\n\n                       LARRY\n             She started her career in theology\n             with a lie?!\n\n                       DETECTIVE ATWOOD\n             Isn't that what all theology is\n             based on?\n\n                       LARRY\n             Did you pass the test?\n\n                          DETECTIVE ATWOOD\n             Oh yeah...\n\n                       LARRY\n             Don't tell me she ended up as\n             Mother Teresa or the Pope.\n\n                       DETECTIVE ATWOOD\n             No, she realized very quickly there\n             wasn't enough money in religion for\n             her, the last I heard she'd written\n             a diet book that was very\n             successful.\n\n                       LARRY\n             She stayed in religion.\n\nAtwood smiles, her fingers find Larry's and they intertwine.\n\nThe view floats over the balcony.\n\nAs it slowly drops, the PEOPLE on the dance floor, Couple by\nCouple, disappear until there are only three Couples left,\none of them is Atwood and Larry. Her head is on his shoulder.\n\nIt's a slow dance.\n\nLarry is very good and wherever he leads, Atwood easily\nfollows. The lights begin to dim and we move in.\n\nLarry touches his lips to Atwood's neck. She arches back and\nhe kisses her neck again and again.\n\n\n\n                                                   (CONTINUED)\n\n                                                           54.\nCONTINUED: (2)\n\n\nHis lips move up and find hers, and we are now close on the\nkiss. Gently the lips separate and we slowly retreat.\n\nLooking into her eyes, Larry traces her lips with a finger,\nthen replaces that finger with his tongue.\n\nHis lips brush a cheek, down her neck to where it meets her\nshoulder, his teeth close softly on the muscle, by now we are\nfar enough away to realize that Atwood and Larry have no\nclothes on and we are:\n\nINT. HALLWAY - DETECTIVE ATWOOD'S CONDOMINIUM Ñ NIGHT\n\nWhat light there is, is coming from a room we can't see.\n\nLarry nibbles at Atwood collarbone, kisses a breast, strokes\nhis hands down her sides. She shivers. He brushes his lips\nback and forth across her stomach and then down to where the\nflesh of her belly meets her pubic hair.\n\nShe's watching all of this in a mirror on the opposite wall.\n\nThen he sinks to his knees and buries his head between her\nlegs. From low in her throat, Atwood moans. We lose sight of\nthe Couple as we move around a corner.\n\nINT. BEDROOM Ñ DETECTIVE ATWOOD'S CONDOMINIUM - NIGHT\n\nIt's dark. Atwood is propped up against the headboard, the\nsheet pulled up over her breasts.\n\nThe door to the BATHROOM opens. Larry dressed in his suit,\nminus the tie, comes out, kneels on the bed and kisses her.\n\n                    LARRY\n          Thank you, this was wonderful.\n\n                    DETECTIVE ATWOOD\n          For me too.\n\n                    LARRY\n          I'll see you then?\n\n                    DETECTIVE ATWOOD\n          I'd like that. The money is in the\n          usual place.\n\n                    LARRY\n          It's not just the money, Tracy. I\n          like you.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        55.\nCONTINUED:\n\n\n                       DETECTIVE ATWOOD\n             I like you too, Larry. Send me a\n             bill for the dress and the shoes.\n\n                       LARRY\n             I will. Good-night.\n\n                       DETECTIVE ATWOOD\n             Good-night.\n\nEXT. MR. BROOKS' CERAMICS STUDIO Ñ NIGHT\n\nThe rain is muffled by the trees.\n\nMove slowly toward the Building then up the side to peek\nthrough the narrow window that circles just below the roof\nline.\n\nIn the center of the room, the kiln relieves the darkness\nwith a yellow red glow whose rim touches a slash of white\nlight coming from under a door tucked in a corner.\n\nINT. CERAMICS STUDIO Ñ NIGHT\n\nWe creep through the white light across the floor that's\nlittered with splashes of paint and smears of clay to the\noffice door and peer under it.\n\nIn front of us are chair casters and two bare feet and legs.\n\n                       MARSHALL (O.S.)\n             I think that was right. Go back.\n\n                         MR. BROOKS (O.S.)\n             We're in.\n\n                       MARSHALL (O.S.)\n             With the taxes we pay, you'd think\n             they could make it more difficult\n             to hack into the Police personnel\n             files.\n\nWe tip toe under the door.\n\nINT. OFFICE - CERAMICS STUDIO Ñ NIGHT\n\nIt's crammed with file cabinets. Sketches for pottery pieces\nare taped to the walls along with photos of Mr. Brooks, Jane\nand Emma.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        56.\nCONTINUED:\n\n\nMr. Brooks, clad only in a T-shirt and underwear, is sitting\nin front of a computer. Marshall, dressed as he usually is,\nis in a chair at his side.\n\nThey are both staring at the monitor where on one side of the\nscreen is Detective Atwood's Police ID photo, on the other\nside of the screen, Mr. Brooks is scrolling through her\npersonnel file.\n\n                       MR. BROOKS\n             .... Huh... her father's Gerald\n             Atwood, why does that ring a bell?\n\n                       MARSHALL\n             Someone you did business with,\n             someone we killed?\n\n                       MR. BROOKS\n             Not someone we killed... MBA...\n             College of William and Mary...\n             she's been a cop for eleven\n             years... Married Doctor Carlson,\n             divorced Dr. Carlson, married Jesse\n             Vialo... restaurateur... separated\n             from Jesse Vialo, sued for support\n             by Jesse Vialo, seeing a shrink\n             because of Jesse Vialo...\n\n                       MARSHALL\n             Excellent fitness report though.\n\n                       MR. BROOKS\n             She caught the Hangman, the guy\n             that escaped the other day...\n\n                       MARSHALL\n             Oooh... She's caught a lot of\n             people... And look here, this isn't\n             the first time she's been hunting\n             for us.\n\n                       MR. BROOKS\n             I wonder what the deal was with her\n             and Jesse Vialo?\n\nMr. Brooks taps a key that minimizes Atwood's file then drags\nit to the right hand corner. In the middle of a key stroke it\nhits him:\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          57.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n          Ahhhh... now I remember. Her\n          father, Gerald Atwood, never did\n          business with him but Emma and I\n          met him a couple times, big\n          political fundraiser. He owns or\n          owned one of the largest insurance\n          groups in the country and a lot of\n          other stuff.\n\nTap, tap, tap. Jesse Vialo's Driver's license comes up.\n\n                    MR. BROOKS\n          Jesse Vialo... Good looking, a\n          little younger than she is.\n\n                    MARSHALL\n          Younger, restaurateur...\n              (snorts)\n          She married him on the rebound from\n          the doctor and I'll bet he married\n          her for her money and her\n          connections.\n\n                    MR. BROOKS\n          The old man being rich doesn't mean\n          she's rich. Maybe he's one of those\n          guys who would rather give it to\n          the Opera than to his kids.\n\n                    MARSHALL\n          Wouldn't she have to declare any\n          outside income and holdings to the\n          Police?\n\n                    MR. BROOKS\n          Hmmm...\n\nHe restores Atwood's file. Tap, tap, tap, tap. Stop. The Men\nstudy the screen then look at each other.\n\n                    MR. BROOKS\n          The Opera didn't get much.\n\n                    MARSHALL\n          Why would a woman with her\n          education and worth 60 plus million\n          dollars and probably more to come,\n          want to be a cop?\n\n                    MR. BROOKS\n          I like that about her.\n\n\n                                                  (CONTINUED)\n\n                                                        58.\nCONTINUED: (3)\n\n\n                    MARSHALL\n          You're such a fucking snob, Earl.\n          You like her because she's rich.\n\n                    MR. BROOKS\n          No, I like her because she found\n          something that's hers. It's not the\n          family business. And she's good at\n          it. I'd like Jane to find something\n          that's hers and that she could be\n          good at.\n\n                    MARSHALL\n          That's exactly why Atwood scares\n          the shit out of me. She's a cop who\n          doesn't need the money and she's\n          looking for us. That's one fucking\n          dangerous human being.\n\n                    MR. BROOKS\n          The fact that you're not wrong\n          doesn't make me admire her any\n          less.\n\nINT. SUBURBAN STARBUCKS Ñ MORNING\n\nAt a table the Asian Attorney is going over a brief. There\nare two foamy coffees in to-go cups in front of her.\nDetective Atwood arrives at the table.\n\n                    DETECTIVE ATWOOD\n          Hi...\n\nShe reaches out, the Women shake hands.\n\n                    ASIAN ATTORNEY\n          Hi. I got you a Latte.\n\n                    DETECTIVE ATWOOD\n              (sitting)\n          Thanks and thanks for meeting me\n          here.\n\n                    ASIAN ATTORNEY\n          We got an injunction to quash the\n          subpoena for your work records\n          yesterday. They've already\n          appealed.\n\n                    DETECTIVE ATWOOD\n          That doesn't help me does it?\n\n\n\n                                                  (CONTINUED)\n\n                                                        59.\nCONTINUED:\n\n\n                       ASIAN ATTORNEY\n             Your father has a lot of political\n             muscle.\n\n                       DETECTIVE ATWOOD\n             My father does nothing for nothing.\n\n                       ASIAN ATTORNEY\n             I understand. If you're willing to\n             play the game and ride a desk for a\n             year; I think we can settle for one\n             two five, one five.\n\n                         DETECTIVE ATWOOD\n             No desk.\n\n                       ASIAN ATTORNEY\n             Then the only other option is\n             money. Tell me how high you are\n             willing to go.\n\n                         DETECTIVE ATWOOD\n             One five.\n\n                       ASIAN ATTORNEY\n             I can try. If I were on the other\n             side I'd hold out for more.\n\n                       DETECTIVE ATWOOD\n             How much more?\n\n                       ASIAN ATTORNEY\n             Give me a cap and that's how high\n             we'll go.\n\n                       DETECTIVE ATWOOD\n             Try and get a number out of them\n             first. I want to know what ballpark\n             I'm playing in and if it's a lump\n             sum, is it less than something\n             that's paid in installments.\n\n                       ASIAN ATTORNEY\n             I'll call them today.\n\nAtwood stands up with her coffee.\n\n                       DETECTIVE ATWOOD\n             I'd like to get this done as soon\n             as possible.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        60.\nCONTINUED: (2)\n\n\nThe Asian Attorney also stands and gathering her papers and\ncoffee.\n\n                    ASIAN ATTORNEY\n          Are you working on the Thumbprint\n          Killer this time?\n\n                       DETECTIVE ATWOOD\n          Yeah.\n\n                    ASIAN ATTORNEY\n          That one's creepy to me. The doors\n          are locked, the alarms are armed\n          and the people are dead. It makes\n          you feel like you're not safe\n          anywhere.\n\nAtwood nods and opens the front door then follows the\nAttorney out.\n\nEXT. SUBURBAN STARBUCKS Ñ MORNING\n\n                    DETECTIVE ATWOOD\n          Where are you parked?\n\n                    ASIAN ATTORNEY\n          I'm right over there.\n\n                    DETECTIVE ATWOOD\n          I'm down the street. Call me as\n          soon as you have something.\n\nShe starts to walk away.\n\n                    ASIAN ATTORNEY\n          Oh, Tracy... I almost forgot, your\n          husband says there's a picture of\n          him holding some trophy that you\n          still have.\n\n                    DETECTIVE ATWOOD\n          He took all those pictures. He took\n          everything.\n\n                    ASIAN ATTORNEY\n          He claims it's his favorite picture\n          and you put it up where you store\n          your suitcases.\n\n                       DETECTIVE ATWOOD\n          I'll look.\n\n\n\n                                                  (CONTINUED)\n\n                                                           61.\nCONTINUED:\n\n\n                       ASIAN ATTORNEY\n             I know it's petty, but you're going\n             through a divorce.\n\nEXT. SIDEWALK Ñ MORNING\n\nAtwood strides toward her car. The PEDESTRIAN traffic is\nlight. It's too early for the stores to be open.\n\nUp ahead a BROWN VAN is idling at the curb, the sliding side\ndoor is open. Atwood can see inside. Empty except for some\nfurniture blankets.\n\nThe Person in the Driver's seat turns to look into the back.\nIt's the Woman who was watching Atwood outside the Murder\nHouse. Her hands are unseen in leather gloves.\n\nShe looks up and their eyes meet. Two strangers. The contact\nis instantly broken.\n\nAtwood takes a deep breath and smiles. After the rain, the\nair is brisk and clean. It's good to be alive.\n\nSLAM!!! Atwood is body-checked by a Man who springs out of\nthe recess of a doorway. His arms wrap around her, she's\nlifted off her feet and the Man throws himself and her into\nthe Van.\n\nINT. BROWN VAN - MORNING\n\nOooff!! The wind is knocked out of Atwood when she lands left\nshoulder first on the furniture blankets, the Man on top of\nher.\n\nThe Man is Thorton Meeks, the Hangman, six feet, a solid two\nhundred pounds. He's also wearing tight leather gloves.\n\nEXT. STREET Ñ MORNING\n\nThe Brown Van accelerates fast away from the curb.\n\nINT. BROWN VAN Ñ MORNING\n\nHis body crushing hers, Meeks kisses Atwood's cheek.\n\n                       MEEKS\n             Surprise, surprise, Tracy. I told\n             you I was coming back to get you.\n\nHe frees his right hand and pulls his gun.\n\n\n\n\n                                                     (CONTINUED)\n\n                                                         62.\nCONTINUED:\n\n\n                       MEEKS\n             I already know where I'm gonna hang\n             you. But first I'm gonna watch\n             her...\n                 (indicates the Driver)\n             ... have some fun with you, then\n             she's gonna watch me have some fun\n             with you.\n\nHe kisses her again and puts the gun to Atwood's head.\n\n                       MEEKS\n             Now, don't move.\n\nHe raises up and straddles her.\n\n                       MEEKS\n             You know the drill, I'm gonna put\n             the cuffs on.\n\nWith his left hand he fishes a pair of handcuffs from a back\npocket and snaps them on Atwood's right wrist.\n\n                       MEEKS\n             Now the left.\n\nHe rolls Atwood on her back and with the chain of the\nhandcuff pulls her right arm toward her left.\n\nAll Meeks' talk has allowed Atwood to catch her breath and\nsuddenly she jerks her head up into the gun and screams at\nthe top of her lungs.\n\n                       DETECTIVE ATWOOD\n             SHOOT ME!!!\n\nAt the same time she pulls hard against the handcuff with her\nright wrist. A startled Meeks is thrown off balance. The gun\ncomes away from Atwood's head.\n\nHer left arm now free, Atwood swings her palm with all of her\nmight into Meeks' right ear. POP!! His eardrum breaks.\n\nAaaggh!! He instinctually reaches to cover the damaged ear\nwith his gun hand.\n\nThe Driver doubles around to see what's happening. From\noutside, HOONNNKK!! The Driver's attention returns to the\nroad.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        63.\nCONTINUED: (2)\n\n\nAtwood swings again. This time she snags the barrel of the\ngun and using it as a lever bends Meeks' hand back on the\nwrist.\n\nBLAM! The gun goes off. Neither one of them is hit.\n\nAt the same time Atwood pulls hard on the handcuff that Meeks\nis holding in his left hand and twists into him. This\ndislodges Meeks and he's off of her.\n\nSnarling like animals they fight for the gun.\n\nCRACK! Atwood's leverage breaks Meeks' trigger finger. His\ngrip loosens on the weapon. She pulls it out of his hand.\n\nA quick push skitters it across the floor. It drops through\nthe open side door into the street.\n\nAtwood rolls away and reaches for her ankle gun. Now it's\nMeeks' turn. A sharp tug on the chain of the handcuff stalls\nher motion.\n\nHe flicks his other arm and a switchblade is delivered into\nhis right hand. Snap!! The blade comes out. Atwood is\nreaching again for her ankle gun. She sees the flash of metal\nand flings her head back.\n\nLuckily all she receives is a deep gash above her right eye.\nBlood immediately begins to cascade over her brow.\n\nMeeks grins and gives another sharp tug on the handcuff to\npull Atwood into the range of his knife.\n\nWith one foot Atwood kicks at him, with the other she pushes\noff and propels herself backward to grab a handful of the\nDriver's hair.\n\nAtwood's weight hinges the Driver's head back until she's\nlooking at the ceiling. Her scream is equal parts pain and\nsurprise.\n\nEXT. STREET Ñ MORNING\n\nThe Brown Van veers into the on-coming traffic. The Driver of\nthe car dead ahead swerves. The Van solidly clips the rear of\nthat car.\n\nINT. BROWN VAN - MORNING\n\nThe sudden deceleration of that impact slingshots Atwood and\nMeeks forward. She hits the back of the Driver's seat.\n\n\n\n                                                  (CONTINUED)\n\n                                                         64.\nCONTINUED:\n\n\nMeeks has further to go. He loses his hold on the handcuffs\nand smashes into the passenger seat.\n\nHer right hand now free, Atwood scratches for the gun on her\nhip.\n\nEXT. STREET Ñ MORNING\n\nCareening across its lane, the Van sideswipes a parked car.\n\nINT. BROWN VAN Ñ MORNING\n\nThat impact rips Atwood's hand out of the Driver's hair and\nsends her sliding on her knees toward the side door.\n\nOn her way she unclips her gun and is bringing it out of her\nholster when Meeks who has managed to hang onto the passenger\nseat sees this and slams a foot into her chest.\n\nAtwood is launched backward out the side door.\n\nEXT. STREET Ñ MORNING\n\nIn slow motion Atwood flies through the air while at normal\nspeed the Van is leaving her behind.\n\nSMASH! Butt first, Atwood hammers into the back window of a\nparked car. The shattering glass breaks her fall.\n\nGroggily she rolls out of the indentation. Gun still in hand\nand blood covering one side of her face she slides off the\ncar to stand in the street.\n\nThe Van is nowhere in sight.\n\nINT. EMERGENCY ROOM Ñ DAY\n\nCaptain Lister is watching a DOCTOR sew up the gash on\nDetective Atwood's forehead.\n\n                       CAPTAIN LISTER\n             We found the van in an underground\n             lot about two miles from where they\n             left you. It was stolen last night.\n\nDetective Snyder comes in and hands a packet of photographs\nto Atwood.\n\n                       SNYDER\n             These are the women we have\n             pictures of who know Meeks.\n\n\n\n                                                   (CONTINUED)\n\n                                                         65.\nCONTINUED:\n\n\n                       CAPTAIN LISTER\n             Meeks and the Woman, none of the\n             Attendants remember seeing them.\n\nAs Detective Atwood begins to go through the pictures.\n\n                       DETECTIVE ATWOOD\n             That chiropractor, Alvin Griffin,\n             who sold Meeks his steroids, he\n             might know where he is.\n\n                       CAPTAIN LISTER\n             His phone's been tapped since Meeks\n             escaped. No contact that way so far\n             and he's sure not going to talk to\n             us.\n\n                       DETECTIVE ATWOOD\n             What about a warrant to search his\n             house? Get me in the door and he'll\n             talk to me.\n\n                       CAPTAIN LISTER\n             How's your divorce going?\n\n                       DETECTIVE ATWOOD\n             I took your advice and told my\n             lawyer to settle.\n\nStretching out her arm to return the photos:\n\n                       DETECTIVE ATWOOD\n             None of these is the woman in the\n             van.\n\n                       DOCTOR\n             Whoa... I'm sewing up your head\n             here.\n\n                       DETECTIVE ATWOOD\n             Sorry.\n\n                       CAPTAIN LISTER\n             And your ego can handle that?\n\n                       DETECTIVE ATWOOD\n             It doesn't like any of the other\n             choices.\n\n                       CAPTAIN LISTER\n             Until Meeks is caught, Snyder is\n             with you.\n\n\n                                                   (CONTINUED)\n\n                                                        66.\nCONTINUED: (2)\n\n\n                    DETECTIVE ATWOOD\n          Nothing personal, Snyder.\n              (to Lister)\n          He's not part of our team.\n\n                    CAPTAIN LISTER\n          He's there to protect you. And\n          listen to him, he's been alive\n          longer than you have.\n\n                    SNYDER\n          I didn't volunteer for this,\n          Atwood.\n\n                    CAPTAIN LISTER\n          The Parking Lot has a security\n          camera. We're checking the tape. If\n          Meeks and the Woman left in a car\n          we'll have a license number. You\n          have two days then I want a\n          progress report on your divorce.\n\n                    DETECTIVE ATWOOD\n          I think I have all the pieces on\n          the Thumbprint Killer, I'm just not\n          looking at them the right way.\n\n                    CAPTAIN LISTER\n          Okay, you have three days.\n\nShe leaves.\n\n                    DETECTIVE ATWOOD\n              (smiles sweetly at Snyder)\n          Every babysitter I ever had loved\n          me.\n\nEXT. DRUG STORE PARKING LOT Ñ NIGHT\n\nIn the scattering of vehicles Mr. Brooks' Toyota is hidden in\nplain sight in a row of cars.\n\nINT. TOYOTA Ñ NIGHT\n\nBehind the wheel, Mr. Brooks is again wearing his Pottery-\nThrowing clothes. Mr. Smith is in the passenger seat and\nMarshall is leaning forward from the back.\n\nThey're all focused to varying degrees on the Entrance to the\nstore. Mr. Smith raises his watch for a look at the time.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        67.\nCONTINUED:\n\n\n                       MR. SMITH\n             Maybe he went home with someone\n             else.\n\n                       MR. BROOKS\n             Can you still see his pickup?\n\nMr. Smith looks.\n\n                       MR. SMITH\n             Uh huh.\n\n                       MR. BROOKS\n             This is not the kind of guy who\n             leaves his pickup in an unguarded\n             Lot overnight.\n\nThe silence returns.\n\nAll three Men idly observe an old green Pontiac convertible\nwith a frayed top and paint peeling, come into the Lot and\npark two spaces away facing them. We saw this car last\nwatching Atwood from outside the Murder House.\n\nThe headlights go off.\n\nThe Driver's door opens. The Woman who was with Meeks in the\nVan steps out and hurries toward the Drug Store.\n\nShe of course means nothing to Mr. Brooks but in the brief\nseconds the domelight is on, he catches sight of the Man in\nthe passenger seat. A memory tickles his brain.\n\nHe turns to Marshall.\n\n                       MR. BROOKS\n             Where do we know that guy from?\n\n                       MARSHALL\n             You really should pay more\n             attention to what you read, Earl.\n\n                       MR. BROOKS\n             That's what I have you for,\n             Marshall.\n\n                       MARSHALL\n             His picture was on the front page\n             of the paper a couple days ago\n             because he escaped from jail. He's\n             the killer they call the Hangman.\n\n\n\n                                                  (CONTINUED)\n\n                                                           68.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n          Ahh...\n\n                    MARSHALL\n          Remember that cop you like, Atwood,\n          who's chasing us, she's the one who\n          put him away. I think his name is\n          Thorton Meeks.\n\nMr. Brooks cocks his head at the vague outline of Meeks.\n\n                    MR. BROOKS\n          Well, well, well... What would life\n          be without surprises?\n\nMr. Smith who, remember, cannot hear or see Marshall,\nstraightens up.\n\n                    MR. SMITH\n          There he is!\n\nThe Man they are waiting for is coming down the steps of the\nstore. On the way to his Pickup he takes off a Manager's\nsmock.\n\n                    MR. SMITH\n          You know what's weird? I'll bet he\n          has all these plans of what he's\n          going to do tonight and tomorrow\n          and he doesn't know he will already\n          be dead and won't be able to do any\n          of them.\n\nMr. Brooks nods absently. The Drug Store Manager arrives at\nhis truck.\n\n                    MR. BROOKS\n          I don't think I want to kill this\n          guy.\n\n                    MR. SMITH\n          What?! But you promised we would!\n\nMarshall smiles.\n\n                    MARSHALL\n          Oh, I love what you're thinking.\n\n                    MR. BROOKS\n          You have no idea what I'm thinking.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                         69.\nCONTINUED: (3)\n\n\n                    MARSHALL\n          Oh yes I do, and it's wonderfully\n          twisted.\n\n                    MR. BROOKS\n              (to Mr. Smith)\n          I know I said we would, but I don't\n          think it would be that much fun.\n\nMr. Brooks starts the car and puts it in reverse.\n\n                    MR. SMITH\n          So just like that, you're saying\n          'no', it's not going to happen.\n\n                      MR. BROOKS\n          Yes.\n\n                    MR. SMITH\n              (purses his lips into a\n               tight line)\n          I see.\n\nMr. Brooks casts his eyes on the license plate of the car\nMeeks is in.\n\n                    MARSHALL\n          You get the number?\n\n                      MR. BROOKS\n          I got it.\n\nEXT. DRUG STORE PARKING LOT Ñ NIGHT\n\nMr. Brooks' Toyota leaves.\n\nINT. TOYOTA Ñ NIGHT\n\nMr. Smith sits stiffly. His expression hasn't changed.\n\n                    MARSHALL\n          Mr. Smith wants you to notice he's\n          pouting.\n\n                    MR. BROOKS\n          Yeah, I know.\n\nEXT. STREET Ñ NIGHT\n\nThe Toyota is part of the light traffic.\n\n                                                        70.\n\n\n\nEXT. RESIDENTIAL STREET Ñ NIGHT\n\nThe Toyota comes into view around a corner and stops next to\nthe sidewalk.\n\nINT. TOYOTA Ñ NIGHT\n\n                     MR. BROOKS\n          I know you're upset, Mr. Smith, and\n          I'm sorry.\n\n                    MR. SMITH\n          Yeah, I am upset.\n\n                    MR. BROOKS\n          Maybe I was a little abrupt back\n          there, but let me explain. Finding\n          someone you think would be fun to\n          kill is a bit like falling in love.\n          You meet a lot of candidates, and\n          you like some of them and they're\n          nice, but they're not right; and\n          then that special one shows up and\n          your heart beats faster and you\n          know that's the one. The man in the\n          pickup did not make my heart beat\n          faster.\n\n                    MR. SMITH\n          Okay, he did not make your heart\n          beat faster. If not him, who?\n\n                    MR. BROOKS\n          I don't know, I think I have\n          someone in mind.\n\n                    MR. SMITH\n          Do you need me to do any work on\n          it?\n\n                    MR. BROOKS\n          No, let's see how it plays out.\n\n                    MR. SMITH\n          You see? That's my problem. That\n          makes me feel like I'm being jerked\n          around, Mr. Brooks. I thought it\n          was happening last night, then it\n          was happening tonight. And now it's\n          \"Let's see how it plays out\".\n                    (MORE)\n\n\n\n                                                  (CONTINUED)\n\n                                                         71.\nCONTINUED:\n                       MR. SMITH (CONT'D)\n             I feel like you're planning to back\n             out on our deal and I don't like\n             that feeling at all.\n\n                       MR. BROOKS\n             I promise you, it will happen.\n\n                       MR. SMITH\n             When? That's what I want to know,\n             Mr. Brooks. When?\n\n                       MR. BROOKS\n             Tomorrow night, same time. When you\n             come out of your building, turn\n             right, go to the first street you\n             can go west on, I'll pick you up on\n             that street.\n\n                       MR. SMITH\n             Okay.\n\nHe gets out and with the door still open, turns back.\n\n                       MR. SMITH\n             I want to do this. But if it drags\n             on too long, I could change my\n             mind.\n\n                        MR. BROOKS\n             Don't you think I want to do this,\n             Mr. Smith?\n\n                       MR. SMITH\n             Maybe you don't anymore.\n\nHe shuts the door. Marshall and Mr. Brooks watch him walk\naway.\n\n                       MARSHALL\n             Even if that guy was charming and\n             funny I still wouldn't like him.\n\nEXT. RESIDENTIAL STREET Ñ NIGHT\n\nThe Toyota U-turns, makes the corner and is lost from sight.\n\nEXT. ALLEY - CERAMICS STUDIO Ñ NIGHT\n\nThe garage door opens and Mr. Brooks swings the Toyota\ninside.\n\n                                                           72.\n\n\n\nINT. GARAGE Ñ CERAMICS STUDIO - NIGHT\n\nMr. Brooks steps out of the Toyota onto a sheet of plastic.\nTwo strides away is an industrial vacuum cleaner.\n\nINT. TOYOTA Ñ NIGHT\n\nMr. Brooks vacuums the passenger seat and dash and floor and\neverything around it.\n\nINT. GARAGE Ñ CERAMICS STUDIO - NIGHT\n\nMr. Brooks removes his shoes and leaves them on the plastic,\nthen slips his feet into paper slippers.\n\nWith handiwipes he wipes down the outside of the passenger\ndoor, in fact anything on that side Mr. Smith could have\ntouched.\n\nHe opens the door and wipes down the seat and the dash and\nthe console.\n\nBack on the plastic, Mr. Brooks undresses. On top of his\nclothes he drops the used handiwipes, the slippers and the\nvacuum bag.\n\nThe corners of the plastic sheet are folded up, twisted\ntogether and Zip-tied to create a nice neat package which Mr.\nBrooks picks up and takes into the Ceramics Studio.\n\nINT. SHOWER - CERAMICS STUDIO Ñ NIGHT\n\nMr. Brooks rinses off the lather under the spray.\n\nINT. CERAMICS STUDIO Ñ NIGHT\n\nThe glow from 3000 degrees Fahrenheit is coming through the\nwindow of the kiln.\n\nINT. OFFICE - CERAMICS STUDIO Ñ NIGHT\n\nThe Driver's license, complete with picture, of the Woman who\nwas with Meeks in the Drug Store parking lot, is up on the\ncomputer screen.\n\nMr. Brooks, now back in his regular clothes, brings the\ncursor down to the address. He scores this and drags it into\nYahoo Maps 'driving directions'.\n\nA route is generated. Mr. Brooks brings the cursor up to\n'Print' and clicks.\n\n\n\n                                                    (CONTINUED)\n\n                                                        73.\nCONTINUED:\n\n\nCLOSE on his Printer. The map is fed out and settles into the\ntray.\n\nEXT. BROOKS HOUSE Ñ MORNING\n\nAn unmarked Police car stops on the gravel of the Turn-\nAround. Two Plainclothes DETECTIVES get out and walk to the\nfront door.\n\nThe taller One rings the bell and they wait and then the door\nis opened by Mr. Brooks.\n\nIn a flash he takes in the car and the way the Men are\ndressed and although his face doesn't betray it, he knows\nwhat they are.\n\n                       MR. BROOKS\n             Hi, what can I do for you?\n\nThe shorter One holds up a badge.\n\n                       DETECTIVE 1\n             I'm Detective Smolny with the\n             Chicago Police and this is\n             Detective Carfagno, from Palo Alto,\n             California...\n\n                       CARFAGNO (DETECTIVE 2)\n                 (showing his badge)\n             We'd like to speak to Jane Brooks,\n             if that's possible.\n\n                       MR. BROOKS\n             Jane is my daughter, what's this\n             about?\n\n                       CARFAGNO\n             There was a murder at Stanford not\n             long before she left. She may be\n             able to help us.\n\n                       MR. BROOKS\n             Is she a suspect?\n\n                       CARFAGNO\n             Not at this time. We simply would\n             like to ask her some questions.\n\n                       SMOLNY (DETECTIVE 1)\n             Is your daughter here?\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        74.\nCONTINUED:\n\n\n                       MR. BROOKS\n             Yes... she is.\n\n                       CARFAGNO\n             The questions won't take long.\n\n                       MR. BROOKS\n             I'm sure you would have no\n             objection if she had an attorney\n             present.\n\n                       SMOLNY\n             That's fine.\n                 (reaching into his pocket)\n             Here's my card. We can schedule a\n             time for later today or tomorrow\n             for her to come in to see us.\n\nMr. Brooks looks at the card.\n\n                       MR. BROOKS\n             If you gentlemen can wait, I will\n             call my lawyer right now and see\n             what we can work out.\n\n                       SMOLNY\n             Oh, that's even better.\n\n                       MR. BROOKS\n                 (opening the door wider)\n             Would you like some coffee?\n\n                          SMOLNY\n             Thank you.\n\nINT. UPSTAIRS HALLWAY Ñ BROOKS HOUSE - MORNING\n\nMarshall is walking alongside a very disturbed Mr. Brooks.\n\n                       MARSHALL\n             We both knew she was hiding\n             something bigger, I certainly\n             didn't think it was this big.\n\n                       MR. BROOKS\n             She's not a suspect, Marshall. She\n             may not have anything to do with it\n             at all.\n\nMr. Brooks opens a door. The room that is revealed is a very\nwell equipped home GYM.\n\n\n\n                                                   (CONTINUED)\n\n                                                        75.\nCONTINUED:\n\n\nIn sweats and wearing a Walkman, Emma is working out on an\nElliptical machine.\n\nMr. Brooks motions to her that he wants to talk. Emma takes\noff the headphones and pauses the machine.\n\n                       MR. BROOKS\n             Did Jane ever tell you that there\n             was a murder at her school?\n\n                       EMMA\n             No.\n\n                       MR. BROOKS\n             Nothing? Not that a friend died or\n             someone she knew died? Or someone\n             in her dorm died?\n\n                       EMMA\n             No.\n\n                       MR. BROOKS\n             There are two Detectives\n             downstairs, one is from Palo Alto,\n             they want to ask her some questions\n             about a murder that occurred\n             shortly before she came home.\n\n                       EMMA\n             Oh, my Gosh! I'm sure if she was\n             close to someone who was murdered,\n             she would have said something.\n\n                       MR. BROOKS\n             I called Roger, he suggested a\n             criminal attorney, they'll be here\n             within the hour.\n\n                       EMMA\n             I'll get dressed.\n\nEXT. BROOKS HOUSE Ñ DAY\n\nThere are now three cars plus the unmarked Police car in the\nTurn-Around.\n\nINT. BROOKS HOUSE Ñ DAY\n\nEveryone is in the LIVING ROOM.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        76.\nCONTINUED:\n\n\nJane is on a couch flanked by her Mother and a LAWYER.\nStanding behind them is a heavyset LAWYER and a YOUNG LAWYER.\nWe've never seen any of these Men before.\n\nFacing this Group from the opposite couch are the two\nDetectives. There are two tape recorders on the coffee table.\n\nMr. Brooks is in a chair off to one side watching everything.\n\nFor him the conversation is merely a burble of voices. He\nstudies his daughter while she answers a question.\n\nShe is unaware of his scrutiny. And finally all he can see\nare her lips moving. Even the burble has faded to silence.\n\nEXT. BROOKS HOUSE Ñ DAY\n\nThe unmarked Police car with the two Detectives pulls away.\nWe move in on the front door. It opens. The Lawyers spill\nout. Mr. Brooks shakes hands with the lawyer who was sitting\non the couch next to Jane.\n\n                       MR. BROOKS\n             Mr. Clifford, it was a pleasure.\n             Thank you for coming on such short\n             notice.\n\n                       HEAVYSET LAWYER\n             There won't be any more dropping by\n             like they did today, they'll call\n             us first.\n\n                       MR. BROOKS\n             Thanks again, Roger. It was a good\n             idea to hear what they wanted to\n             know sooner rather than later.\n\n                       MR. CLIFFORD\n             We'll talk.\n\n                       MR. BROOKS\n             Yup.\n\nHe waves and re-enters the house.\n\nINT. BROOKS HOUSE Ñ DAY\n\nMr. Brooks shuts the door and turning, finds himself face to\nface with Emma and Jane. The Women are both worried.\n\nHe and his Daughter look at each other. For a brief instant\neach one tries to find what they hope to find in the other.\n\n\n                                                   (CONTINUED)\n\n                                                          77.\nCONTINUED:\n\n\nMr. Brooks smiles and folds the Girl into his arms.\n\n                       MR. BROOKS\n             You did good, Kid. Your answers\n             were clear, concise and honest. And\n             when they tried to trip you up, it\n             didn't work.\n\n                       JANE\n             I hope so. I'm not feeling so well.\n\n                       EMMA\n             Should you lie down?\n\n                       JANE\n             I think I'd better.\n\nMr. Brooks kisses his daughter on the top of the head.\n\n                       MR. BROOKS\n             Try and get some sleep.\n\nJane bends her steps toward the stairs.\n\n                       MR. BROOKS\n                 (to Emma)\n             I think Roger has a handle on this.\n             He and Mr. Clifford will take care\n             of it.\n\nEmma takes her Husband's hand and after squeezing it follows\nher Daughter. On the stairs Jane stops and looks back.\n\n                       JANE\n             I'm sorry I didn't tell you about\n             it, Daddy. It was horrible but I\n             really didn't know the guy that\n             well. It happened at about the same\n             time I found out I was pregnant,\n             and it just went out of my mind.\n\n                       MR. BROOKS\n             I understand.\n\nJane resumes her journey up the stairs.\n\n                                           CUT TO:\n\nCLOSE on a water glass being filled from a tap.\n\n\n\n\n                                                     (CONTINUED)\n\n                                                          78.\nCONTINUED: (2)\n\n\n                    MR. BROOKS (V.O.)\n          God grant me the Serenity to accept\n          the things I cannot change, Courage\n          to change the things I can, and\n          Wisdom to know the difference...\n\nINT. KITCHEN Ñ BROOKS HOUSE - DAY\n\nWith a shaky hand, Mr. Brooks raises the glass to his lips.\n\n                    MR. BROOKS\n          God help me. What do I do?\n\nSitting on the island behind him Marshall waits for Mr.\nBrooks to gulp the glass dry.\n\n                    MARSHALL\n          She did it, didn't she?\n\n                    MR. BROOKS\n          Yeah. It'll take the Cops a week to\n          ten days to put their case together\n          and then they'll come back and\n          arrest her.\n\n                    MARSHALL\n          What are you going to do?\n\nMr. Brooks puts his hands over his eyes and sobs, then wiping\naway the tears:\n\n                    MR. BROOKS\n          I've been afraid of this since the\n          day she was born. She has what I\n          have.\n\n                    MARSHALL\n          Yes, she does. But you've always\n          been smart about it. She was\n          stupid. She did it because she got\n          off on it, she did it for fun. Why\n          didn't she think it through? A\n          hatchet! And she left it there!!\n\n                    MR. BROOKS\n          They were pretty graphic, weren't\n          they?\n\n                    MARSHALL\n          That was to shock her into making a\n          mistake.\n\n\n\n                                                  (CONTINUED)\n\n                                                        79.\nCONTINUED:\n\n\n                       MR. BROOKS\n             What does she think I think?\n             Doesn't she remember what she told\n             me? That the BMW was being driven\n             across country by a friend and now\n             right in front of me, she tells the\n             Cops it was stolen.\n\n                       MARSHALL\n             You've always cleaned up after her,\n             whatever she did, all her life.\n\n                       MR. BROOKS\n             If the BMW has anything\n             incriminating in it, I hope it was\n             stolen or she dropped it at the\n             bottom of a very deep lake.\n\n                       MARSHALL\n             Do you think she knows what kind of\n             trouble she's in?\n\n                       MR. BROOKS\n             I think she thought she had gotten\n             away with it until the Cops showed\n             up. I should have listened to her,\n             it was there. She was telling me.\n             'I didn't quit school because I was\n             pregnant'. I should have dug\n             deeper.\n\n                       MARSHALL\n             And where would you be but at the\n             exact same place you are now. It is\n             not your fault, Earl. Part of your\n             problem with her is that you always\n             think it is.\n\n                       MR. BROOKS\n             She has what I have, Marshall. So\n             on a very basic level, it is my\n             fault.\n\n                       MARSHALL\n             What are you going to do?\n\n                       MR. BROOKS\n             Maybe the best thing for her would\n             be to let her go to jail.\n\n                       MARSHALL\n             And what about her child?\n\n\n                                                   (CONTINUED)\n\n                                                           80.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n          Emma and I would raise it.\n\n                    MARSHALL\n          You might be right, Earl, you might\n          be. Because you know if she's not\n          stopped, she's going to do it\n          again. And if she wants to take\n          over the box business, the next\n          victim could be you.\n\n                    MR. BROOKS\n          I don't think she'd go that far.\n\nINT. CRIME LAB Ñ DAY\n\nA slide of what looks like enlarged grains of sand among\ngiant carpet fibers is projected onto a screen.\n\nThe Lead Crime Lab Technician:\n\n                    SIGY (O.S.)\n          We found traces of this in two\n          places.\n\nThe slide changes to an overhead schematic showing the\ninterior of the house where the dance Couple was murdered.\n\nDetective Atwood and Detective Snyder are standing with Sigy\nwatching the presentation. Atwood has a bandage covering the\nstitches over her eye.\n\n                    SIGY\n              (with a laser pointer)\n          Here and here.\n\nThe red dot indicates an area just outside the Kitchen and\njust outside the Bedroom.\n\n                    SIGY\n          We did an analysis and it's made up\n          of feldspar, alumina and kaolin.\n\n                    DETECTIVE ATWOOD\n          What's that?\n\n                    SIGY\n          A high fire stoneware clay.\n\n                    SNYDER\n          Like you make ashtrays and vases\n          from?\n\n\n                                                  (CONTINUED)\n\n                                                          81.\nCONTINUED:\n\n\n                       SIGY\n             This is more plates and teacups. It\n             was slightly wet when whoever it\n             was tracked it into the house and\n             it stuck to the carpet fibers.\n             We're thinking it was the killer.\n\n                       DETECTIVE ATWOOD\n             It could have been tracked in by a\n             friend.\n\n                       SIGY\n             That's the thing, you see, the\n             friend would have had to have been\n             there almost at the same time the\n             killer was. Otherwise the samples\n             would have been dry and the killer\n             would have vacuumed them up.\n\n                       DETECTIVE ATWOOD\n             Is the clay rare, is it difficult\n             to get?\n\n                       SIGY\n             You can buy it almost anywhere.\n\n                       SNYDER\n             That's not much help, Sigy.\n\n                       DETECTIVE ATWOOD\n             And this is the only incongruity\n             you were able to find in the whole\n             house.\n\n                       SIGY\n             We've done everything we know how\n             to do. It sure doesn't break the\n             case wide open, does it?.\n\n                       DETECTIVE ATWOOD\n             No, Sigy, it doesn't. It does give\n             me an excuse to ask someone some\n             new questions.\n\nINT. MR. BROOKS' OFFICE Ñ BROOKS BOX FACTORY - DAY\n\nMr. Brooks is standing behind his desk staring blankly at the\ncontents of his briefcase when Sunday, his Secretary, comes\nin.\n\n                       SUNDAY\n             Yes, Mr. Brooks?\n\n\n                                                     (CONTINUED)\n\n                                                          82.\nCONTINUED:\n\n\nMr. Brooks doesn't immediately answer her, he's lost in\nthought.\n\n                       MARSHALL\n                 (from the couch)\n             Before you open your mouth, be very\n             sure this is the right thing to do.\n\n                       MR. BROOKS\n             I will never be sure.\n\nRemember; Sunday can neither see nor hear Marshall.\n\n                       MARSHALL\n             You get pissed at me because I'm\n             always the one arguing to go ahead\n             and do murder. Not this time, Earl.\n             This is your decision.\n\n                       MR. BROOKS\n             I know it's wrong. In my heart I\n             know it's wrong.\n\n                       MARSHALL\n             Then don't do it. Go with Mr. Smith\n             tonight and end that, then let the\n             Police put Jane in jail. Hopefully\n             that will save her and we can\n             happily go on with our tortured\n             lives.\n\n                       MR. BROOKS\n             That's exactly what I want to do.\n             That's exactly what I should do.\n             The thing is, she's my daughter and\n             I love her.\n\nMr. Brooks raises his head and looks at Sunday.\n\n                       MR. BROOKS\n             I'm going home. Cancel everything\n             for the rest of the day. I might be\n             in tomorrow afternoon. I'll let you\n             know about that.\n\n                       SUNDAY\n             I'll take care of it.\n\n                       MR. BROOKS\n             If you need me, need me, call my\n             studio, that's where I'll be.\n                       (MORE)\n\n\n                                                   (CONTINUED)\n\n                                                        83.\nCONTINUED: (2)\n                    MR. BROOKS (CONT'D)\n          I probably won't pick up, just\n          leave a message.\n\n                    SUNDAY\n          I'll try not to bother you.\n\nThe door closes behind her.\n\nINT. CERAMICS STUDIO Ñ DAY\n\nWith a hidden lever, Mr. Brooks lowers casters under the kiln\nand rolls it aside to reveal a Combination Safe imbedded in\nthe concrete floor.\n\nHe spins the dial, opens the Safe and extracts four quadruple-\npocketed plastic sleeves which he lines up in front of\nhimself.\n\nEach sleeve contains a Driver's License, two Credit cards and\ncash.\n\nThe pictures on the Driver's Licenses are of Mr. Brooks, but\nyou wouldn't immediately recognize him because of the\ndisguises.\n\nAs he's trying to decide which of the four Identities would\nbe best for what he has in mind, Marshall comes forward to\nlook over his shoulder.\n\n                    MARSHALL\n          The thing that bothers me about\n          this, besides the fact we're not\n          prepared, and a multitude of other\n          things, is what does Mr. Smith do\n          when he's walking west tonight and\n          you don't show up. That little\n          freak could flip out.\n\nMr. Brooks chooses the first sleeve and the third sleeve. The\nother two go back into the Safe.\n\n                    MR. BROOKS\n          I'll take care of it on the way to\n          the airport.\n\nEXT. FIVE STORY GLASS BUILDING Ñ DAY\n\nIt's in an Industrial Park.\n\nMr. Smith exits one of the doors and continues on into the\nParking Lot to a moderately expensive foreign car sitting in\na space identified by a sign which reads:\n\n\n\n                                                  (CONTINUED)\n\n                                                        84.\nCONTINUED:\n\n\nMr. Baffert.\n\nHe squeezes the 'disarm' button on his key chain. The car\nchirps twice and he opens the door. Bending his knees to get\nin, he stops.\n\nThere is a section of Newspaper wedged in the steering wheel.\n\nWhen his brain unlocks he straightens up and moving only the\ntop of his body, makes a quick recon of the surrounding area\nand his back seat.\n\nNothing threatening seen, he eases into the seat. Slam! The\ndoor is closed and locked.\n\nINT. CAR Ñ DAY\n\nGingerly, Mr. Smith removes the Newspaper. It folds open. On\nthe first page there are words circled in red.\n\nAs his eyes dart from one to the other we go in close on the\nwords and hear Mr. Brooks say them as Mr. Smith finds them.\n\n                       MR. BROOKS (V.O.)\n             Not - able - to - meet -\n\nMr. Smith turns the page.\n\n                       MR. BROOKS (V.O.)\n             - tonight - Do - it - same -\n\nTurns the page.\n\n                       MR. BROOKS (V.O.)\n             - time - tomorrow -\n\nTurns the page.\n\n                       MR. BROOKS\n             - night - Don't - be - stupid -.\n\nMr. Smith refolds the Newspaper and throws it at the\npassenger seat.\n\n                         MR. SMITH\n             Fuck you!\n\nHe inserts the key into the ignition.\n\nRAP-RAP!! There's a sudden sharp KNOCK!!, on the Driver's\nwindow.\n\n\n\n                                                  (CONTINUED)\n\n                                                           85.\nCONTINUED:\n\n\nMr. Smith levitates off the seat!! Unable to breathe, he\nturns.\n\nDetective Atwood's face lowers into view.\n\n                       DETECTIVE ATWOOD\n             You remember me?\n\nAll Mr. Smith can do is nod.\n\n                       DETECTIVE ATWOOD\n             Would you step out of the car,\n             please, I want to talk to you.\n\nEXT. CAR Ñ DAY\n\nAtwood steps back as Mr. Smith gets out. Behind her,\nDetective Snyder is standing next to the Driver's door of an\nun-marked Police car which has blocked Mr. Smith in.\n\n                       DETECTIVE ATWOOD\n             So Mr. Baffert, what is that you\n             have to tell me?\n\n                       MR. SMITH\n             What do you mean? I don't have\n             anything to tell you.\n\n                       DETECTIVE ATWOOD\n             Really? Because I was driving\n             around and I got this sudden\n             feeling that you had something to\n             tell me about the murders.\n\n                       MR. SMITH\n             No. Nothing.\n\n                       DETECTIVE ATWOOD\n             That's disappointing. Because when\n             I left you the last time we talked,\n             I felt I had missed a clue that was\n             right in front of me that would\n             solve this whole case.\n\n                       MR. SMITH\n             I don't know why you would feel\n             that.\n\n                        DETECTIVE ATWOOD\n             Didn't you tell me you were an\n             amateur potter, that you made bowls\n             and vases?\n\n\n                                                   (CONTINUED)\n\n                                                        86.\nCONTINUED:\n\n\n                       MR. SMITH\n             No, I said I was an amateur\n             photographer.\n\n                       DETECTIVE ATWOOD\n             Are you positive? Because we found\n             potter's clay on the carpet of the\n             murder house and I was sure you\n             said to me that you worked with\n             clay, that you made pots.\n\n                       MR. SMITH\n             No. I said my hobby was\n             photography, not pottery.\n\n                       DETECTIVE ATWOOD\n             Maybe that was it. The Stewardess\n             upstairs said the victims kept\n             their curtains open when they made\n             love. Could I see some of the\n             pictures you took of that Couple?\n\nMr. Smith can only stare at Detective Atwood. His Adam's\napple moves up and down though he makes no sound. Should he\nor shouldn't he?\n\nFinally he throws his arms up in a shrug but in his half-turn\nof indecision he happens to spy the Newspaper he tossed at\nthe passenger seat of his car.\n\nPart of it is draped over the console. The red circles around\nthe words on that page jump out at him.\n\n                       MR. BROOKS (V.O.)\n             Don't - be - stupid -.\n\nMr. Smith returns his attention to Detective Atwood.\n\n                       MR. SMITH\n             You are harassing me, Detective\n             Atwood. You know very well I'm not\n             a potter and I don't have any\n             pictures! So my feeling is that\n             your feeling is wrong and that you\n             should move your car and let me go\n             home.\n\n                       DETECTIVE ATWOOD\n             What is your job here? What do you\n             do?\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        87.\nCONTINUED: (2)\n\n\n                    MR. SMITH\n          I'm a mechanical engineer.\n\n                    DETECTIVE ATWOOD\n          You have to be pretty smart for\n          that, don't you?\n\n                     MR. SMITH\n          I guess.\n\n                    DETECTIVE ATWOOD\n          Then be smart, Mr. Baffert. You\n          lied to me right there at the end.\n          I'll be watching you. And when you\n          want to tell me the truth, you know\n          how to get in touch with me.\n\nShe gives him a dazzling smile.\n\n                    DETECTIVE ATWOOD\n          See you later, alligator.\n\nAtwood walks back to her car and gets in.\n\nINT. UNMARKED POLICE CAR Ñ DAY\n\n                    DETECTIVE ATWOOD\n              (under her breath)\n          Goddamit...\n\nAs Snyder accelerates away he points to the car's computer\nscreen.\n\n                    SNYDER\n          Captain Lister got us the search\n          warrant for Meeks' Chiropractor.\n\n                     DETECTIVE ATWOOD\n          Good.\n              (shakes her head 'no',\n                frustrated)\n          Goddamit!, that guy knows\n          something...\n              (meaning Mr. Smith)\n          He almost told me and then\n          something happened.\n\n                    SNYDER\n          You think he did it?\n\n                    DETECTIVE ATWOOD\n          I don't think it's that simple.\n\n                                                           88.\n\n\n\nEXT. PARKING LOT Ñ DAY\n\nMr. Smith watches the unmarked police car going away and\nwipes the sweat out of his hairline.\n\nINT. AIRPLANE Ñ DAY\n\nWe're following a STEWARDESS down the aisle. She stops at a\nrow and leans over to hand a glass of tomato juice to the\nPerson in the Window Seat.\n\n                    STEWARDESS\n          Here you are, Sir.\n\nMr. Brooks who now looks like the Man in the picture on the\nthird Driver's license, accepts the drink.\n\n                       MR. BROOKS\n          Thank you.\n\nHe takes a sip and resumes his gaze out the window.\n\n                    MR. BROOKS\n              (almost inaudible whisper)\n          God grant me the Serenity to accept\n          the things I cannot change, Courage\n          to change the things I can, and\n          Wisdom to know the difference...\n\nThe earth that he is looking at below is a long way away.\n\nEXT. REDWOOD CITY Ñ LATE AFTERNOON\n\nCome off a sign which reads: STANFORD UNIVERSITY - 2 1/2\nmiles to an Alamo rental car traveling south on the El Camino\nReal.\n\nINT. ALAMO RENTAL CAR Ñ LATE AFTERNOON\n\nIn his Pottery-Throwing clothes, Mr. Brooks is behind the\nwheel.\n\nThere's an Ace Hardware Store bag sitting upright and open on\nthe passenger seat. We peek over the edge of the bag.\n\nA brand new hatchet with a gleaming blade sits at the bottom.\n\nMr. Brooks adjusts the rearview mirror. Marshall is on the\npassenger side of the back seat.\n\n                    MR. BROOKS\n          You're awfully quiet back there.\n\n\n                                                  (CONTINUED)\n\n                                                          89.\nCONTINUED:\n\n\nWithout any indication he's been addressed, Marshall\ncontinues to stare stoically ahead.\n\nEXT. EL CAMINO REAL - LATE AFTERNOON\n\nThe Alamo Rental car carrying Mr. Brooks continues on.\n\nINT. HIGH CEILING BUNGALOW Ñ NIGHT\n\nIt's dark. There's barely enough ambient light to see that we\nare close on the knob of the Front Door.\n\nFrom outside we hear the muffled sound of a Black & Decker\ncordless drill and the knob begins to vibrate. Someone is\ndrilling the lock.\n\nThe sound stops. The knob turns. The door opens. A flashlight\nis shone into our face.\n\n                       UNIFORMED POLICEMAN (O.S.)\n             Mr. Alvin Griffin, this is the\n             Chicago Police.\n\nEXT. HIGH CEILING BUNGALOW Ñ NIGHT\n\nFrom the protection of the doorjamb, a very young UNIFORMED\nPOLICEMAN is the person shining the flashlight into the\nhouse.\n\nHe's flanked on either side of the door by Detective Atwood\nand Detective Snyder.\n\nThe Officer's flashlight illuminates a short ENTRYWAY with a\nHALL immediately off to the left and the LIVING ROOM fading\ninto darkness, straight ahead.\n\n                       UNIFORMED POLICEMAN\n                 (continues)\n             We have a warrant to search your\n             home and premises. We're coming in.\n\nFlashlight in her left hand and the Glock in her right,\nDetective Atwood is the first one across the threshold.\n\nShe directs the beam at the wall next to the door; finds the\nlight switch. Click! Click! Click.\n\n                       DETECTIVE ATWOOD\n             Lights don't work.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                        90.\nCONTINUED:\n\n\nShe continues to the Hall. The darkness is so oppressive\nthere, it seems that her stream of light must struggle to\npierce it.\n\nThe Room at the end is the KITCHEN.\n\nWith Snyder hanging in the Entryway to protect her back,\nAtwood eases the hand with the flashlight around the corner.\n\nThe dishwasher, the sink, the cabinets gleam dully back at\nher. She steps inside.\n\nA debris field of empty pharmaceutical boxes and vials trails\naway from the Refrigerator.\n\nHer flashlight sweeps the rest of the Room. Beyond an open\ncountertop in the DINING AREA, the light blurs past an oval\nof white, and then comes back.\n\nIt's the face of a WOMAN!!\n\nCareful of the litter, Atwood moves forward until she can see\nthat the Woman is sitting in a chair at the far end of the\ndining table.\n\nHer throat has been cut. Her head is being held upright by\nher hair which is taped to the back of the chair.\n\nShe has a pen taped between her fingers, but the Appointment\nBook in front of her is drenched in blood.\n\n                       DETECTIVE ATWOOD\n                 (calls to the darkness in\n                  back of her)\n             We have a dead woman in here.\n\nA light and footsteps hurry toward her from the LIVING ROOM.\nAtwood swings her light at them.\n\n                       SNYDER\n             Hey!\n\nHe squints and turns away.\n\n                       DETECTIVE ATWOOD\n             I thought you were behind me.\n\n                       SNYDER\n             The living room is clean.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        91.\nCONTINUED: (2)\n\n\nAtwood swings her light back onto the dead Woman. The\ncombined illumination of the flashlights cause the support\njoists twelve feet up to throw eerie shadows onto the open\nceiling.\n\n                    DETECTIVE ATWOOD\n          Snyder, meet Mona.\n\nThe Uniformed Policeman comes up beside Atwood.\n\n                    UNIFORMED POLICEMAN\n          I called it in.\n\nThe smell of blood and the sight of the carnage is too much\nfor him. His gorge rises and he gags.\n\n                    DETECTIVE ATWOOD\n          Do that outside.\n\nThe Officer doesn't have to be told twice.\n\n                    DETECTIVE ATWOOD\n              (to Snyder, re: the body)\n          Meeks did this.\n\n                    SNYDER\n          I thought Meeks hung people.\n\nAtwood retraces her steps in the Kitchen.\n\n                    DETECTIVE ATWOOD\n          Meeks is a steroid freak. This\n          Refrigerator was always full of\n          steroids. Mona was Alvin Griffin's\n          niece, receptionist, lover and\n          keeper of the keys.\n\nShe focuses her flashlight on an open padlock dangling from a\nsteel band that runs around the Refrigerator. With the barrel\nof the Glock she opens the door.\n\nThe only edibles inside are a tomato, half a loaf of bread, a\npackage of hotdogs and some part of a chicken in a KFC box.\nThe rest of the space is vacant.\n\n                    DETECTIVE ATWOOD\n          Well, the steroids are certainly\n          gone.\n\n                    SNYDER\n          You think Meeks has Alvin with him?\n\n\n\n                                                  (CONTINUED)\n\n                                                           92.\nCONTINUED: (3)\n\n\n                    DETECTIVE ATWOOD\n          Meeks thinks Alvin turned him in.\n\nShe shuts the Refrigerator.\n\n                     DETECTIVE ATWOOD\n          Let's go see what's in the rest of\n          the house.\n\n                                         CUT TO:\n\nAtwood and her flashlight pass us. Three feet to her right\nand slightly behind is Snyder and his flashlight.\n\nThe two Detectives are leaving the Living Room and entering\nthe HALL toward the bedrooms. The ceiling is low here and it\nfeels very claustrophobic.\n\nAhead is a Door painted red.\n\nBut before they get to it, there's a Room on the right.\nSnyder shines his light in.\n\nIt's a BATHROOM. The shower curtain is open. Nobody in the\ntub.\n\nThe Door ahead is waiting, but there's another Door on the\nright. Snyder shines his light in.\n\nThis one is a Treatment Room with a Therapy table and shelves\nof oils and unguents.\n\nThey've come to the red Door. Atwood will open this one.\n\nShe turns the knob and pushes. The Door is stuck. She and\nSnyder exchange a look.\n\nSnyder shuffles back half a step and flattens himself against\nthe wall. He shuts off his flashlight.\n\nAtwood takes a deep breath, levers her weight against the\ndoor and pushes.\n\nThere's a sudden Snap! Then the door swings freely open. The\nbeam of Atwood's flashlight reveals a large room containing a\nbed, a dresser, a...\n\nCREEEKKK!!! The sound is coming from up in the rafters.\nAtwood whips her flashlight in that direction.\n\nFor an instant the beam catches a piece of a large shape\nfalling fast right at her.\n\n\n                                                   (CONTINUED)\n\n                                                        93.\nCONTINUED: (4)\n\n\nThen it's lost in the darkness and then picked up again in\nthe reflected light in the Hall. The shape is a naked Man.\n\nWHACK!! The Man nails Atwood in the shoulder. BANG! Her gun\ngoes off. She bounces into the wall and onto her ass.\n\nBarely slowed the Man continues in an upward arc. His feet\nand knees slam into the ceiling. Plaster dust rains.\n\nThe Man swings back, past Snyder. He's lost in the darkness\nagain. Then he swings back into the light and comes to a stop\njust inside the bedroom Door.\n\nThe Man is hanging from a rope around his neck. He's dead.\nHis Body is festooned with syringes stuck into his bare\nflesh.\n\nIn fact two of the needles hold a sheet of paper to the Man's\nchest. Printed on the paper in big black letters are the\nwords:\n\nHA! HA! HA! HA!\n\n                    DETECTIVE ATWOOD\n              (getting to her feet)\n          Snyder, this is Alvin Griffin.\n\nEXT. CHICAGO\n\nThe gray of dawn is in the sky.\n\nEXT. O'HARE AIRPORT Ñ PRE DAWN\n\nMr. Brooks, wearing a disguise that makes him look like the\npicture on the Driver's license in the first plastic sleeve,\ngets into a Taxi.\n\nEXT. SUBURBAN STREET - CHICAGO - DAWN\n\nThe Cab drops Mr. Brooks off in front of a house. Mr. Brooks\nwatches the Cab drive away and then with his Carry-On bag\nstarts walking in the opposite direction. He turns a corner.\n\nEXT. SECOND SUBURBAN STREET - CHICAGO - DAWN\n\nStill on foot, Mr. Brooks arrives at his non-descript Toyota.\nThere are also neighborhood cars parked along the street. Mr.\nBrooks unlocks his car and throws his Carry-On onto the\npassenger seat.\n\n                                                        94.\n\n\n\nEXT. FREEWAY - DAWN\n\nMr. Brooks' Toyota speeds up an on-ramp and joins the light\ntraffic.\n\nINT. TOYOTA - DAWN\n\nFrom the back seat Marshall watches Mr. Brooks remove the\npieces of his disguise - a wig, a mustache, glasses, and drop\nthem in the Carry-On.\n\n                    MARSHALL\n          How do you feel?\n\n                      MR. BROOKS\n          Dirty.\n\n                    MARSHALL\n          That's understandable. You've never\n          killed for this reason before. The\n          feeling will go away.\n\n                    MR. BROOKS\n          I don't think so. It's the whole\n          thing, Marshall. If I could find a\n          way to just disappear, where there\n          was absolutely no trace of me;\n          because eventually I will get\n          caught doing this. And it'll be\n          very embarrassing for me and Emma\n          and Jane. So I've been thinking...\n          is there a way that Mr. Smith could\n          kill me and make me disappear.\n\n                    MARSHALL\n          Number one, Mr. Smith is not smart\n          enough to do that. Number two,\n          there is no reason, if you're\n          careful, to believe you will ever\n          get caught.\n\n                    MR. BROOKS\n          I know I will have to plan it for\n          Mr. Smith, but I think that's what\n          I want to do.\n\n                    MARSHALL\n          I'm not particularly fond of that\n          plan, Earl. Remember if you die, I\n          go with you and I like being alive.\n          I like eating, I like fucking, I\n          like killing.\n\n\n                                                  (CONTINUED)\n\n                                                           95.\nCONTINUED:\n\n\n                       MR. BROOKS\n             I have to end it, Marshall. One way\n             or the other. And I think this is\n             the best way.\n\n                       MARSHALL\n             Well fuck you then.\n\nEXT. CITY STREET Ñ DAWN\n\nLong ago this was a nice area. A banner hangs from an old\nDeco building - ROOMS FOR RENT.\n\nMr. Brooks is walking through the Parking Lot beside the\nBuilding.\n\nThere, as a first car in a double space is the old green\nPontiac convertible. It's blocked in by another car.\n\nMr. Brooks sidles between the cars to check the license plate\nagainst the one in his memory.\n\nIt's the car Thorton Meeks was in, outside the Drug Store.\nMr. Brooks walks away.\n\nINT. CERAMICS STUDIO - DAWN\n\nMr. Brooks opens the kiln door and removes three pieces\nembellished with a beautiful yellow glaze.\n\nHe sets them on a table then takes his Carry-On bag and\nplaces it in a ceramic trough which he puts into the kiln.\nThe door is shut.\n\nINT. KILN Ñ DAWN\n\nFlame erupts from the gas jets.\n\nINT. MASTER BEDROOM - BROOKS HOUSE - DAWN\n\nThe Bathroom door opens. Mr. Brooks, in his pajamas, turns\nout the light and crosses to the bed. Emma looks up as he\npulls back the covers and gets in.\n\n                       EMMA\n             You worked all night.\n\n                       MR. BROOKS\n             I had ideas for pots that took too\n             long and the clay kept winning...\n                 (he kisses her)\n             I'll be fine.\n                       (MORE)\n\n                                                   (CONTINUED)\n\n                                                         96.\nCONTINUED:\n                       MR. BROOKS (CONT'D)\n             And there's a yellow Chinese glaze\n             I'm trying to get right...\n\nHe lays his head on the pillow and is almost instantly\nasleep.\n\nINT. DETECTIVE ATWOOD'S CONDOMINIUM - MORNING\n\nReflected in the glass of an open mirrored closet door is a\ntastefully furnished DEN with floor-to-ceiling windows that\nlook out at LAKE MICHIGAN from the 20th floor.\n\nAn empty suitcase falls into this picture and bounces on the\ncarpet. Behind the mirrored door, Detective Atwood is atop a\nstepstool rummaging through the suitcases on the highest\nshelf.\n\nThroughout the Condo there is an incessant ringing of the\nphones.\n\nAnother suitcase goes down and Atwood finds what she's\nlooking for - a framed color 8 x 10 photo of her husband,\nJesse. He's in a business suit and holding some kind of\ntrophy.\n\nThe phones stop ringing.\n\nAtwood comes down the stepstool, folds it and is carrying it\nback to where it lives when the phones start ringing again.\n\nShe picks up a cordless in the Den.\n\n                       DETECTIVE ATWOOD\n             Yes?\n\nINT. LAW OFFICES Ñ MORNING\n\nThe Asian Attorney interrupts her sip of coffee.\n\n                       ASIAN ATTORNEY\n             Hi Tracy, this is Nancy Tang. We\n             received a counter offer. Are you\n             sitting down?\n\nINT. DEN - DETECTIVE ATWOOD'S CONDOMINIUM Ñ MORNING\n\n                       DETECTIVE ATWOOD\n             Yeah, go ahead... He can't get\n             that, can he?!\n\nINTERCUT with Nancy.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                           97.\nCONTINUED:\n\n\n                       NANCY (ASIAN ATTORNEY)\n             No, my sense of it is by asking for\n             five, they're hoping you'll settle\n             anywhere between two five and\n             three.\n\n                       DETECTIVE ATWOOD\n             Never. How long can you stall them?\n\n                       NANCY\n             They know you want this done\n             quickly, so they're going to expect\n             a quick counter offer.\n\n                       DETECTIVE ATWOOD\n             I need two days. Wait two days\n             before getting back to them. If\n             they call, tell them it's a big\n             number, I'm thinking about it.\n\n                       NANCY\n             Okay.\n\n                       DETECTIVE ATWOOD\n             And the picture he wanted...\n\nShe slams the frame of Jesse's photo against the inside of a\nmetal trash can.\n\nNancy winces and then smiles at the sound of shattering\nglass.\n\nAtwood plucks the photo out of the frame and tears it so that\nthe rip can be heard over the phone.\n\n                       DETECTIVE ATWOOD\n             ... tell him I couldn't find it.\n\nINT. MASTER BEDROOM - BROOKS HOUSE Ñ MORNING\n\nMr. Brooks is still asleep. Emma, dressed for the day,\narrives at his side of the bed. She rubs the back of Mr.\nBrooks' hand.\n\n                       EMMA\n             Earl... Earl...\n\nMr. Brooks opens his eyes.\n\n                       MR. BROOKS\n                 (sleepy, groggy)\n             Huh?...\n\n\n                                                   (CONTINUED)\n\n                                                         98.\nCONTINUED:\n\n\n                       EMMA\n             Roger is on the phone.\n\nINT. KITCHEN Ñ BROOKS HOUSE - MORNING\n\nIn his slippers and robe, Mr. Brooks is standing in the\nDoorway watching Jane who is leaning over the Counter with an\nopen Newspaper next to a bowl of cereal.\n\nHe has a chance to take a good long look before she feels his\npresence and raises her head.\n\n                       JANE\n             Oh, Hi, Daddy, I thought you'd\n             already be gone.\n\n                       MR. BROOKS\n             Roger called. There was another\n             murder last night near Stanford.\n\n                       JANE\n             Oh...\n\n                       MR. BROOKS\n             Done the same way as the one they\n             talked to you about. Right down to\n             the hatchet being left at the\n             scene.\n\nJane can't quite conceal the tremor of surprise that ripples\nthrough her and Mr. Brooks sees it.\n\n                       MR. BROOKS\n             They think they have a serial\n             killer. Obviously you were here\n             last night, so you're in the clear.\n\n                       JANE\n             That's good news, isn't it? I mean\n             even if you're innocent it's good\n             news to know you're not a suspect.\n\n                       MR. BROOKS\n             Oh, yeah. How's the morning\n             sickness? Do you want to ride in\n             with me today?\n\n                       JANE\n             I feel fine, but I don't know how\n             long that will last.\n\nMr. Brooks nods, turns to leave, then turns back.\n\n\n                                                    (CONTINUED)\n\n                                                           99.\nCONTINUED:\n\n\n                       MR. BROOKS\n             Do you love me, Jane?\n\n                        JANE\n             Of course I love you, daddy, you're\n             my father.\n\n                       MR. BROOKS\n             Have you decided whether or not to\n             keep the baby?\n\n                          JANE\n             Not yet.\n\n                          MR. BROOKS\n                 (nods)\n             Okay.\n\nEXT. MR. SMITH'S CAR Ñ AFTERNOON\n\nLooking off the grill as it overtakes another car in the\nFastlane.\n\nEminem is on the stereo. The car ahead moves out of the way.\n\nINT. MR. SMITH'S CAR Ñ AFTERNOON\n\nMr. Smith is rapping along to \"Cleanin' Out My Closet\". He\nknows all the words.\n\nEXT. FREEWAY Ñ AFTERNOON\n\nWith Eminem fading, we fall behind Mr. Smith. One car, two\ncars. The third car is Detective Atwood's car.\n\nINT. DETECTIVE ATWOOD'S CAR Ñ AFTERNOON\n\nAtwood is driving. Snyder is in the passenger seat.\n\n                       SNYDER\n             What are we doing?\n\n                       DETECTIVE ATWOOD\n             'Are we there yet?' , are we there\n             yet?' , you sound like a child.\n             We're playing a hunch.\n\n                       SNYDER\n             We've been following this guy all\n             day, he's boring, and everything we\n             run on him comes up clean.\n\n\n\n                                                   (CONTINUED)\n\n                                                         100.\nCONTINUED:\n\n\n                       DETECTIVE ATWOOD\n             If it didn't, it wouldn't be called\n             a hunch.\n\n                       SNYDER\n             Meeks' finger-prints were all over\n             the chiropractor, the note,\n             refrigerator, he's the guy we\n             should be looking for.\n\n                       DETECTIVE ATWOOD\n             Look where? Please tell me.\n             Everyone knows who Meeks is and is\n             looking for him. The chiropractor\n             was the last link to his old life\n             that I know of. The only way we'll\n             find him, now, is if someone turns\n             him in or we trip over him at a bus\n             stop. On the other hand, Detective\n             Snyder, no one knows who the\n             Thumbprint Killer is or where he\n             is. However, I have a fucking hunch\n             this guy Baffert does. I have two\n             days to play that hunch. If you\n             feel like you're wasting your time\n             with me, I'd be happy to do it\n             alone.\n\nHe looks at her and shakes his head.\n\n                       SNYDER\n             I had a fight with my wife this\n             morning; what's your problem?\n\n                       DETECTIVE ATWOOD\n             My husband wants five million\n             dollars.\n\nEXT. SUBURBAN STREET Ñ AFTERNOON\n\nMr. Smith's car enters the Parking Lot of a Rib Joint.\nAtwood's car stops across the street.\n\nINT. ATWOOD'S CAR Ñ AFTERNOON\n\nAtwood and Snyder watch Mr. Smith enter the Restaurant. They\nwait in silence. A muted 'tone' announces the arrival of an\nEmail on their computer. Snyder reads and frowns.\n\n                         DETECTIVE ATWOOD\n             Bad news?\n\n\n\n                                                   (CONTINUED)\n\n                                                         101.\nCONTINUED:\n\n\n                       SNYDER\n             Lister is pulling you off this\n             case.\n\n                          DETECTIVE ATWOOD\n             Why?!\n\n                       SNYDER\n             Maybe they caught him.\n\nShe twists the screen around so she can read the message.\n\n                       DETECTIVE ATWOOD\n             No. She would have said that.\n\nSnyder points across the street at Mr. Smith coming out of\nthe Restaurant carrying a Take-Out bag.\n\n                       SNYDER\n             You want to keep following him?\n\nAtwood hesitates.\n\n                       SNYDER\n             Lister only said you were off the\n             case, not me.\n\n                       DETECTIVE ATWOOD\n                 (smiles)\n             Good thinking, Tonto.\n\nShe starts the car. There's the muted 'tone' again. Atwood\nlooks at the computer screen.\n\n                       DETECTIVE ATWOOD\n             Shit! She just 86'ed you too.\n\nINT. POLICE STATION Ñ AFTERNOON\n\nTrailed by Snyder, Detective Atwood arrives at Captain\nLister's SECRETARY.\n\n                          DETECTIVE ATWOOD\n             Is she in?\n\n                       SECRETARY\n             She's with someone.\n\n                          DETECTIVE ATWOOD\n             Good.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                        102.\nCONTINUED:\n\n\nAtwood blows past the Secretary and opens the door to\nLister's office.\n\nINT. CAPTAIN LISTER'S OFFICE Ñ AFTERNOON\n\nThere are two MEN in suits on the other side of the desk from\nthe Captain. Atwood ignores them and focuses on Lister.\n\n                       DETECTIVE ATWOOD\n             You promised if I settled my\n             divorce I had three days on the\n             Thumbprint Killer. I have the rest\n             of today and tomorrow left.\n\n                       CAPTAIN LISTER\n             Detective Atwood, meet FBI Agents\n             Longnecker and Campbell, they're\n             taking over your investigation.\n\n                       DETECTIVE ATWOOD\n             You promised you would keep them\n             out of it for three days.\n\n                       CAPTAIN LISTER\n             They won't allow me to keep that\n             promise.\n\nAtwood glares at her then at the FBI Men.\n\n                       DETECTIVE ATWOOD\n             This is my case, what you're doing\n             is fucked. But since I can't stop\n             you, and she won't, here's a tip.\n             James Baffert, you should stake him\n             out, he knows something.\n\n                       DETECTIVE LONGNECKER\n             We have some other ideas we are\n             looking into.\n\n                       DETECTIVE ATWOOD\n             Then what's the problem? You do\n             that and I'll tail Baffert.\n\n                       DETECTIVE LONGNECKER\n             Thank you for all your good work,\n             Detective. This is our case now.\n\nAtwood looks from one Man to the Other.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          103.\nCONTINUED:\n\n\n                        DETECTIVE ATWOOD\n             Good luck.\n                 (to Captain Lister)\n             Later I suppose you'll fill me in\n             on what I'm supposed to be doing\n             around here. I'm confused.\n\nShe leaves. Snyder closes the door behind her.\n\nINT. RECEPTION AREA - BROOKS BOX FACTORY - LATE EVENING\n\nIt's deserted with only a small spill of light coming from\nMr. Brooks' Office.\n\nINSIDE\n\nMr. Brooks is at his desk.\n\nThe lamp at his elbow throws a yellow cone across his face.\nHis head is in his hands, he's been crying.\n\nMarshall steps out of the shadows behind him.\n\n                       MARSHALL\n             It's time to go.\n\n                       MR. BROOKS\n             Yeah.\n\nHe reaches into a bottom drawer and as he takes out an\nenvelope, Marshall reads the tear-stained hand written letter\nresting on the blotter.\n\n                       MARSHALL\n             Dear Emma and Jane, my loves, I\n             have a terminal illness and instead\n             of subjecting you to my\n             deterioration, I have decided to\n             disappear. Don't try to find me, I\n             don't want to be found. Please\n             believe that the time I spent with\n             you brought me the greatest joy of\n             my life. Love. Dad.\n\nMr. Brooks picks up the letter and folds it.\n\n                       MARSHALL\n             So you're going to go through with\n             it.\n\nMr. Brooks stuffs the letter in the envelope, seals it and\npicks up a pen.\n\n\n                                                   (CONTINUED)\n\n                                                       104.\nCONTINUED:\n\n\n                       MR. BROOKS\n             It's all planned to work out,\n             Marshall.\n\nOn the envelope he writes: For EMMA and JANE.\n\nEXT. STREET Ñ NIGHT\n\nOn the sidewalk Mr. Smith is walking toward the on-coming\ntraffic. The headlights make it difficult to tell one car\nfrom the other until they pass. That doesn't keep him from\nlooking for Mr. Brooks.\n\nThe houses stop and he's passing a pocket park. In a dark\nspace between the street lamps, a hand falls on Mr. Smith's\nshoulder. He jumps and a scream squeaks out of his throat.\nIt's Mr. Brooks, in his Pottery-Throwing clothes.\n\n                       MR. BROOKS\n                 (smiles)\n             Are you ready to rock and roll, Mr.\n             Smith?\n\nMr. Smith swallows hard and nods. Mr. Brooks propels him into\nthe park.\n\nINT. MR. BROOKS' CAR Ñ NIGHT\n\nMr. Brooks is driving. Mr. Smith is in the passenger seat.\nBoth are lost in a wary silence. Abruptly from the back seat:\n\n                       MARSHALL\n             I smell gun oil, a gun oil that's\n             different than yours.\n\n                       MR. BROOKS\n             He brought his gun. After he gets\n             what he wants he plans to kill me.\n\n                       MARSHALL\n             Ah... now I get it. You were\n             counting on that, weren't you?\n\n                       MR. BROOKS\n             It has a certain logic.\n\n                       MARSHALL\n             But if your plan is to have him\n             kill you, why do you have to kill\n             someone else first?\n\n\n\n\n                                                   (CONTINUED)\n\n                                                       105.\nCONTINUED:\n\n\n                       MR. BROOKS\n             He'll need to see that to get up\n             the courage to kill me.\n\nMarshall roars with laughter.\n\n                       MARSHALL\n             Not even you believe that, Earl. It\n             makes it more exciting, doesn't it,\n             to think he's going to kill you\n             after you kill someone else. You're\n             getting your rocks off big time,\n             that's why you're doing it.\n\n                       MR. BROOKS\n             Not true... and if it were, so\n             what?\n                 (to Mr. Smith)\n             You're goddamn great, you know. To\n             have the balls to do this.\n\n                       MR. SMITH\n             I'm pretty nervous but that's\n             normal right?\n\n                       MR. BROOKS\n             Perfectly normal.\n\nINT. DETECTIVE ATWOOD'S CONDOMINIUM Ñ NIGHT\n\nAtwood is propped up in bed reading a Magazine. Her hair is\npulled back and her face glistens with Cold Cream.\n\nThe phone rings. Should she answer it? It rings again, then\nagain. Reluctantly she grabs the receiver.\n\n                       DETECTIVE ATWOOD\n             Hello... Oh, yes, yes.\n                 (she sits up)\n             Put him through... Hi, this is\n             Detective Atwood speaking, thanks\n             for calling...Yes, your roommate\n             said you were in Tokyo... Anything,\n             if you saw anything at all it might\n             be helpful.\n\nINT. FOUR STORY APARTMENT BUILDING Ñ NIGHT\n\nA MAN in a Flight Attendant's uniform is standing at the\nwindow of the Apartment he shares with the Stewardess.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                        106.\nCONTINUED:\n\n\nA cordless phone to his ear, he is looking down at the House\nwhere the dance Couple was murdered.\n\n                       FLIGHT ATTENDANT\n             The weird thing is that they closed\n             their curtains, at first they were\n             open like they always were and they\n             were making love, which they always\n             did, and then when I looked again\n             the curtains were closed, and there\n             were what looked like camera\n             flashes coming from behind the\n             curtains.\n\nINTERCUT with Detective Atwood.\n\n                       DETECTIVE ATWOOD\n             Camera flashes?\n\n                       FLIGHT ATTENDANT\n             That's what it looked like.\n\n                       DETECTIVE ATWOOD\n                 (almost to herself)\n             That's why he poses them.\n\n                          FLIGHT ATTENDANT\n             I'm sorry?\n\n                          DETECTIVE ATWOOD\n             Nothing.\n\n                       FLIGHT ATTENDANT\n             I wish I could be more helpful, I\n             didn't see the killer or anything\n             like that, but since it was weird I\n             thought I should call.\n\n                       DETECTIVE ATWOOD\n             You've been very helpful. This\n             answers a lot of questions for me.\n             Thank you very much, Mr. Struber.\n\nShe's about to hang up when Struber speaks again.\n\n                       FLIGHT ATTENDANT\n             The guy you should talk to is the\n             guy on the floor below us...\n                       (MORE)\n\n\n\n\n                                                    (CONTINUED)\n\n                                                          107.\nCONTINUED: (2)\n                    FLIGHT ATTENDANT (CONT'D)\n          eh, I can't remember his name, but\n          he told me once that he'd taken\n          some great pictures of that Couple\n          making love, he's the one you\n          should speak to.\n\n                    DETECTIVE ATWOOD\n          Would that be, Mr. Baffert?\n\n                    FLIGHT ATTENDANT\n          Yeah, I think Jim or James...\n\n                    DETECTIVE ATWOOD\n          Thank you very much.\n\nAtwood disconnects then quickly dials.\n\n                     DETECTIVE ATWOOD\n          Snyder, meet me at Baffert's\n          apartment with a Search Warrant...\n          Listen to me, this is what you tell\n          the judge.\n\nINT. APARTMENT BUILDING Ñ NIGHT\n\nComing up the back STAIRS we arrive at a LANDING and make a\nright. In front of us is Mr. Smith watching Mr. Brooks pick\nthe deadbolt in the Service door.\n\nCLICK!\n\nMr. Brooks straightens up, twists the handle and pushes the\ndoor inward. It's caught by a chain. He takes the bent rubber-\ntipped forceps from one pocket, from another he hands Mr.\nSmith a pair of latex gloves.\n\n                    MR. BROOKS\n          Put these on.\n\nINT. APARTMENT Ñ NIGHT\n\nIn the middle of the large darkened KITCHEN, Mr. Brooks\npauses to listen to the sounds of the Apartment.\n\nThe gun with the silencer is already in his right hand. Both\nare encased in a Ziplock bag.\n\nBeside him, Mr. Smith is wide eyed with fear and\nanticipation. His teeth are even chattering.\n\n                     MR. BROOKS\n          Try a couple deep breaths through\n          your nose.\n\n\n                                                   (CONTINUED)\n\n                                                          108.\nCONTINUED:\n\n\n                       MR. SMITH\n             I have to take a crap so bad.\n\n                       MR. BROOKS\n             This won't take long.\n\nMr. Brooks and Mr. Smith come out of the Kitchen. The LIVING\nROOM is quite well appointed. There's a fire going in the\nFireplace.\n\nThe sound of a T.V. is coming from a ROOM off a HALL up\nahead. That is where Mr. Brooks and Mr. Smith are headed.\n\nThey're more than half way across the LIVING ROOM when DING!\nDONG!, the doorbell rings.\n\nMr. Smith gasps and looks beseechingly at Mr. Brooks. Without\nan ounce of hurry, Mr. Brooks maneuvers him back into the\nshadows of the KITCHEN.\n\nThe doorbell rings again.\n\nA wet spot appears in Mr. Smith's crotch and runs down his\npant leg. Pee drips onto the linoleum.\n\nA Man comes out of the Hallway. The Living Room light goes\non.\n\nThe Man is Jesse, Detective Atwood's estranged husband.\n\nHe opens the Front Door.\n\nThe Woman who comes in is Sheila, his divorce lawyer.\n\nThey kiss, tongues. His hands brush over her breasts. He\nbegins to unbutton her blouse. The kiss breaks. As he\ncontinues unbuttoning.\n\n                       SHEILA\n             I called your wife's lawyer.\n             They're thinking about the five\n             million dollars.\n\nJesse opens the blouse and looks at the breasts under the\nbra.\n\n                       JESSE\n             Realistically how much do you think\n             we can get?\n\nSheila gives him a quick kiss and moves on into the LIVING\nROOM where she drops her briefcase on the couch.\n\n\n                                                   (CONTINUED)\n\n                                                        109.\nCONTINUED: (2)\n\n\n                     SHEILA\n          If we go to court, best case, two,\n          if she wants to settle, best case,\n          three, but I would be happy with\n          two seven.\n\nBacklit by the Fireplace, Jesse kisses her again.\n\nFrom the KITCHEN, Mr. Brooks and Mr. Smith watch Jesse unzip\nSheila's slacks and dropping to his knees peel them off her\nlegs.\n\nShe steps out of them. He kisses the inside of her thighs,\nher crotch, then standing up:\n\n                    JESSE\n          I'll be right back.\n\nOn his way out of the LIVING ROOM:\n\n                    JESSE\n          I think we should hold firm for\n          three.\n\nHe shuts off the light. In the glow of the Fireplace, Sheila\nremoves her jacket.\n\n                    SHEILA\n          Let's not be piggish, two five, two\n          seven, would be a good deal.\n\nThe T.V. goes silent. Jesse returns with a partially full\nglass of Champagne.\n\nHe hands Sheila a glass from a side table, takes a bottle out\nof an ice bucket and as he fills her glass:\n\n                    SHEILA\n              (teasing)\n          You've already had half a bottle.\n\n                    JESSE\n          You're late; if we want it, there's\n          more.\n\nThey clink glasses.\n\n                      SHEILA\n          To us.\n\n                    JESSE\n          To three million dollars.\n\n\n                                                    (CONTINUED)\n\n                                                       110.\nCONTINUED: (3)\n\n\n                    SHEILA\n              (after a sip)\n          We have to do this fast because\n          remember, Marie is meeting us here.\n\n                    JESSE\n          We could ask her to join us.\n\n                       SHEILA\n          Not funny.\n\n                    JESSE\n              (undoing the front of her\n               bra)\n          I wasn't trying to be.\n\nShe bops him playfully. He bends and slips a nipple into his\nmouth. Sheila bites her lip and moans.\n\nIn the KITCHEN, Mr. Smith shifts around for a better view.\nThe floor under him CRREEEKKS!\n\nIn the LIVING ROOM, both Sheila and Jesse react to the sound.\n\n                    SHEILA\n          Are we alone?\n\n                       JESSE\n          Yeah.\n\nMr. Brooks seems to appear magically out of the darkened\nKitchen with his gun raised. He's followed by Mr. Smith.\nSheila opens her mouth to scream.\n\n                    MR. BROOKS\n          Don't do that.\n\nINT. MR. SMITH'S APARTMENT BUILDING Ñ NIGHT\n\nDetective Atwood hurries down the HALL and out of breath,\nstops in front of Mr. Smith's door. She raps sharply. Waits a\nbare three seconds and raps again.\n\n                    DETECTIVE ATWOOD\n          Mr. Baffert?... Mr. Baffert?\n\nThe door of the Apartment behind her opens and an OLDER WOMAN\nsticks her head out.\n\n                       OLDER WOMAN\n          He's gone.\n\n\n\n                                                  (CONTINUED)\n\n                                                          111.\nCONTINUED:\n\n\nAtwood shows her badge.\n\n                       DETECTIVE ATWOOD\n             Do you have any idea when he'll be\n             back?\n\n                       OLDER WOMAN\n             He skipped out. I heard him leave\n             this evening and a few minutes\n             later there were Movers here. Musta\n             been behind on the rent. He didn't\n             even say good-bye.\n\n                          DETECTIVE ATWOOD\n             Thank you.\n\nAs the Old Lady watches, Atwood tries the knob. It's\nunlocked. She pushes the door open.\n\nThe HALLWAY and LIVING ROOM she can see are completely empty.\nFurniture, T.V., camera equipment, art, gone.\n\n                       OLDER WOMAN\n             I told you.\n\nINT. MR. SMITH'S APARTMENT Ñ NIGHT\n\nOn her way in, Atwood draws her gun.\n\nKeeping close to the walls she audits the KITCHEN. All the\nCabinet doors are open. Dishes, pots and pans, cutlery, gone.\n\nShe moves on to the BATHROOM. Soap, shampoo, toilet paper,\ntoothpaste, toothbrushes, towels, washcloths, the contents of\nthe Medicine Cabinet, gone.\n\nShe moves on to the BEDROOM. Bed, night table, lamps, T.V.,\ncomputer, gone. Clothes closets, empty of everything.\n\nShe looks around. Mr. Smith's entire Apartment has been\nstripped absolutely clean, except...\n\n... there's a crumpled piece of paper in the far corner of\nthe Bedroom.\n\nAtwood goes over and gets down on one knee. With her fingers\npulling at the corners she is able to straighten the paper\nenough to make out that it's a work order from a Moving\ncompany.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                         112.\nCONTINUED:\n\n\nReading it with the paper pinched between thumb and\nforefinger of her left hand, Atwood rises. There's the\nsilhouette of a Man in the doorway behind her.\n\n                       MAN\n             Obviously Baffert's gone...\n\nAtwood whirls, gun up. She sees that it's Snyder.\n\n                       DETECTIVE ATWOOD\n                 (overlapping)\n             Goddamit, Snyder. Knock.\n\n                       SNYDER\n             I wasn't able to get the search\n             warrant.\n\n                       DETECTIVE ATWOOD\n             We may have gotten lucky.\n                 (holding up the paper)\n             This is the Moving Company's work\n             order and...\n                 (points))\n             ... it looks like this is the\n             address where they're taking\n             Baffert's stuff.\n\n                       SNYDER\n             Where were you when you called me?\n\n                       DETECTIVE ATWOOD\n             At home in bed.\n\n                       SNYDER\n             Can you prove that?\n\n                       DETECTIVE ATWOOD\n             I was home in bed, why should I\n             have to prove that?\n\n                       SNYDER\n             Your husband Jesse and his lawyer\n             were killed tonight...\n\nAtwood slowly lowers her head and fixes her eyes on the floor\nin stunned silence.\n\n                       SNYDER\n             It looks like the Thumbprint\n             Killer, I've been ordered to bring\n             you in for questioning.\n\n\n\n                                                    (CONTINUED)\n\n                                                        113.\nCONTINUED: (2)\n\n\n                    DETECTIVE ATWOOD\n          Why, I didn't want Jesse dead, I\n          loved him, I hated what he was\n          doing to me...\n\n                    SNYDER\n          It's on record you said you'd like\n          him dead and who better to fake a\n          Thumbprint killing than you.\n\n                    DETECTIVE ATWOOD\n          You can't actually believe I would\n          do that.\n\n                    SNYDER\n          If our jobs have taught us\n          anything, Tracy, is that people do\n          strange things. They just want to\n          ask you some questions.\n\n                    DETECTIVE ATWOOD\n          I will be happy to answer any\n          questions after we check out this\n          address.\n\nAtwood goes to leave the room. Snyder blocks her way.\n\n                    SNYDER\n          I have to take you in, Tracy.\n\n                    DETECTIVE ATWOOD\n              (waves the paper)\n          This is the answer to the\n          Thumbprint Killer, Snyder, and this\n          is where I'm going and you're not\n          going to stop me.\n\n                    SNYDER\n          Don't make me cuff you, Tracy,\n          because I will if I have to.\n\nAtwood smiles winningly.\n\n                    DETECTIVE ATWOOD\n          I believe you would.\n\n                    SNYDER\n              (smiles back)\n          You can count on it.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                       114.\nCONTINUED: (3)\n\n\nSnyder never sees it coming. WHACK! Atwood's right cross\nnails him exactly where the jaw meets the neck and down he\ngoes on his ass.\n\n                    DETECTIVE ATWOOD\n              (standing over him)\n          It would be nice if you could come\n          with me, but if you do and it goes\n          bad, they'll burn your ass. So this\n          never happened.\n\nEXT. FREEWAY Ñ NIGHT\n\nMr. Brooks' car speeds under an overpass.\n\nINT. MR. BROOKS' CAR Ñ NIGHT\n\n                    MR. SMITH\n          That was great! It was fantastic!\n          It was everything I hoped it would\n          be. Thank you.\n\n                    MR. BROOKS\n          You're welcome.\n\nIn the back seat:\n\n                    MARSHALL\n          Here comes the gun.\n\nWithout taking his eyes off the road.\n\n                       MR. BROOKS\n          Yup.\n\nMr. Smith slides a pistol from under his jacket and points it\nat Mr. Brooks.\n\n                    MR. BROOKS\n              (feigns surprise)\n          What are you doing?!\n\n                    MR. SMITH\n          You're smart enough to figure that\n          out, Mr. Brooks.\n\n                    MR. BROOKS\n          Well we're going sixty five miles\n          an hour, Mr. Smith, if you shoot me\n          now, there's a good chance we'll\n          both die.\n\n\n\n                                                  (CONTINUED)\n\n                                                       115.\nCONTINUED:\n\n\n                       MR. SMITH\n             Not now. Take the next off ramp.\n\n                       MR. BROOKS\n             That wouldn't be very smart of me\n             would it?\n\nHe accelerates around a truck into the Fastlane. Mr. Smith\ncan see the Exit coming up, it's quickly left behind.\n\n                       MR. BROOKS\n                 (matter of fact)\n             Think about this. You pissed\n             yourself back there, you left your\n             DNA at the scene of a double\n             homicide, and there's nothing to\n             indicate that I was ever there. If\n             the Cops do an analysis of that\n             urine, and they will, you're the\n             Thumbprint Killer.\n\n                        MR. SMITH\n                 (smug)\n             No. I still have pictures of you\n             doing the first murder.\n\nMr. Brooks smiles a knowing smile. Beyond him on the other\nside of the Divider, cars are zipping by in the opposite\ndirection.\n\n                       MR. BROOKS\n             Yes. But what were you doing at the\n             second murder?\n\nMr. Smith doesn't have an answer for that.\n\n                       MR. BROOKS\n             Let me help you with a thought. You\n             say I forced you to come along and\n             if I'm not here or more\n             specifically my body is not here to\n             say different, you might have a\n             chance to beat the rap. Now you're\n             probably asking yourself why I\n             would help you. I'm tired, Mr.\n             Smith, I'm tired of killing. But\n             I'm an addict, I can't quit. I've\n             tried. I can't do it on my own. So\n             I'll let you kill me but I want you\n             to do it smart, in a way that I\n             disappear and my family never knows\n             what I was.\n\n\n                                                   (CONTINUED)\n\n                                                       116.\nCONTINUED: (2)\n\n\n                    MR. SMITH\n          How do I do that?\n\n                    MR. BROOKS\n          There's a cemetery I know about. We\n          find an open grave, you shoot me, I\n          fall in the grave, you shovel in\n          just enough earth to cover me,\n          tomorrow a casket is lowered onto\n          me and I've disappeared. It's a\n          good plan. What do you say?...\n\n                    MR. SMITH\n          Why should I trust you?\n\n                    MR. BROOKS\n          You don't have to trust me. You're\n          the man holding the gun, you saw me\n          put mine in the trunk.\n\n                    MR. SMITH\n          I don't know. You really want me to\n          kill you?\n\n                    MR. BROOKS\n          Yes.\n\n                    MR. SMITH\n          Okay... But any sudden moves and\n          you're dead on the spot and I'll\n          make sure your family knows what\n          you are.\n\n                    MR. BROOKS\n          I understand.\n\nEXT. OLD DECO BUILDING Ñ NIGHT\n\nCome off the banner hanging across the front - ROOMS FOR\nRENT, to find Atwood walking away from her car.\n\n                    DETECTIVE ATWOOD\n              (to herself, regarding the\n               Building)\n          You've come down in the world, Mr.\n          Baffert.\n\nINT. LOBBY - OLD DECO BUILDING Ñ NIGHT\n\nHigh ceilings, once grand, now blue neon and a cage around\nthe Front Desk to protect the Night Clerk who is nowhere in\nsight. Somewhere a radio is playing salsa music loud.\n\n\n                                                  (CONTINUED)\n\n                                                       117.\nCONTINUED:\n\n\nAtwood crosses to the elevator. She pushes the call button.\nWith an arthritic rattle the door opens.\n\nINT. ELEVATOR Ñ NIGHT\n\nAtwood selects the 5th Floor. Creek!, Clatter!, Clank!, the\ndoor closes and after a stuttering liftoff the car begins its\nascent. The overhead light flickers on and off. Atwood looks\nup at it.\n\nEXT. SIDEWALK Ñ NIGHT\n\nMr. Brooks leads Mr. Smith across a street to a pedestrian\ngate set in a high wall.\n\nThrough the bars of the gate we can see a Cemetery bathed in\nmoonlight.\n\nMr. Brooks reaches into his pocket. Mr. Smith tightens his\ngrip on the gun.\n\n                       MR. SMITH\n             Uh uh, take your hand out real\n             slow.\n\nMr. Brooks does as he's told. A key dangles from his fingers.\n\n                       MR. BROOKS\n             It's locked. You don't want to\n             climb over, do you?\n\n                       MR. SMITH\n             What are you doing with a key to a\n             cemetery?\n\n                         MR. BROOKS\n             I own it.\n\n                       MR. SMITH\n             Why do you own a cemetery?\n\nMr. Brooks unlocks the gate and preceding Mr. Smith, goes\ninside.\n\n                       MR. BROOKS\n             You always want to invest in things\n             people can't do without. Water and\n             cemeteries are pretty safe.\n\nHe locks the gate and handing the key to Mr. Smith:\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          118.\nCONTINUED:\n\n\n                       MR. BROOKS\n             You'll need this to get out. Now\n             there should be an open grave\n             around here somewhere. Let's see if\n             we can find it.\n\nHe produces a small flashlight from his pocket and off they\ngo.\n\nINT. OLD DECO BUILDING Ñ NIGHT\n\nRepeating their arthritic performance the elevator doors\nopen. Atwood steps out into a wide sporadically lit HALLWAY.\n\nPeering at the numbers Atwood goes to her Left.\n\nIn the middle of the Hall behind her a Couple exits a Room\nand drifts to the other side of the Hall on their way to the\nelevator.\n\nAtwood re-checks the number on the Moving Company's Work\nOrder - 517, she's going the wrong way. She turns around.\n\nNow Atwood and the Couple are walking toward each other on\nopposite sides of the Hall.\n\nAtwood steps into an area of light.\n\nThe reflection off her face catches the attention of the Man\nwho is wearing a wide brimmed hat. He lifts his head.\n\nIt's Thorton Meeks. The Woman with him was the Driver of the\nVan. She's wearing a watchcap.\n\nMeeks gently takes his Companion's arm. They stop. Her eyes\ngo to where he's looking and then back to his. At some\nunspoken signal they both draw their guns.\n\nIntent on finding 517 and Baffert, the Couple hasn't\nregistered on Atwood's radar.\n\nBANG! TWOCK! A chunk of plaster blows off the wall next to\nher head. Startled, Atwood winces away. BANG! The Woman\nfires. The slug explodes the plaster on the other side of\nAtwood's head.\n\nNow Atwood is turning toward them, gun in hand.\n\nMeeks fires. The bullet passes through Atwood's jacket.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                       119.\nCONTINUED:\n\n\nInstinctively Atwood assumes a classic duelist's pose\noffering the smallest target possible. Calmly she squeezes\noff her first shot.\n\nThe plaster explodes from the wall above Meeks' head. The\nWoman fires.\n\nA hole appears in Atwood's sleeve. Atwood pulls the trigger\nagain.\n\nSMACK! The Woman screams and falls back into Meeks, a bullet\nin her hip. Atwood's third shot takes the hat off Meeks head.\nShe now realizes who her attackers are.\n\n                        DETECTIVE ATWOOD\n             Meeks?!!\n\nDragging the Woman in the direction of the stairs, BANG!\nMeeks fires. Maybe it's his broken trigger finger that\naffects his aim. The shots miss. BANG! BANG! The Woman fires.\n\nAtwood's next two shots miss.\n\nMeeks and the Woman arrive at the stairs and before rounding\nthe corner, BANG! BANG! BANG!, fire at Atwood who is now\nmoving deliberately at them.\n\nAtwood doesn't try and dodge the bullets or flinch away from\nthem and her shots are unhurried.\n\nThe next one catches the Woman in the side. The one after\nthat nails Meeks in the left shoulder. He's spun into the\nWoman.\n\nINT. STAIRS - OLD DECO BUILDING Ñ NIGHT\n\nLeaning on each other Meeks and the Woman lurch down the worn\nmarble steps.\n\nINT. HALLWAY Ñ OLD DECO BUILDING - NIGHT\n\nAtwood reaches the stairs and cheats a look around the\ncorner. BANG! BANG! BANG! From the landing below, Meeks and\nthe Woman fire.\n\nAtwood steps out from behind the wall and shoulders square,\nshoots. Another sidestep. This shot shatters Meeks' knee. He\nbellows in pain.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                          120.\nCONTINUED:\n\n\nMoving to the side again, Atwood shoots. But Meeks' knee has\ncollapsed and he and the Woman are already tumbling down the\nnext set of steps. Atwood waits. There's silence, then the\nmurmur of voices.\n\n                       MEEKS\n                 (calls out)\n             Atwood?\n\n                       DETECTIVE ATWOOD\n             Yeah.\n\n                       MEEKS\n             Come on down, there's something I\n             want to show you.\n\nINT. STAIRS - OLD DECO BUILDING Ñ NIGHT\n\nGun at the ready, Atwood edges her way downward. At about the\ntenth step she is able to lean over and look through the\nbanisters.\n\nMeeks and the Woman are propping themselves up against the\nwall on the LANDING below. Both of them still have their\nguns.\n\nThe moment Meeks' eyes meet Atwood's, he puts his gun to the\nWoman heads. BANG!\n\nAtwood sucks in her breath.\n\nMeeks puts the gun to his temple. BANG!\n\nAtwood clasps a hand to her mouth and exhales in ragged\ngulps.\n\nEXT. CEMETERY Ñ NIGHT\n\nThe finger of light from Mr. Brooks' handtorch discovers a\nfreshly dug GRAVE.\n\n                       MR. BROOKS\n             There we are. Now if I stand\n             here...\n\nHe positions himself at one end of the Grave.\n\n                       MR. BROOKS\n             ... and you stand there, not too\n             far away and you shoot me, I should\n             fall straight back into the hole.\n\n\n\n                                                   (CONTINUED)\n\n                                                         121.\nCONTINUED:\n\n\n                       MR. SMITH\n             You don't think I have the guts to\n             do this do you?\n\n                       MR. BROOKS\n             I'm hoping you do.\n\nMr. Brooks shuts off his light and straightens up.\n\n                       MR. BROOKS\n             Okay, let's get this over with.\n\nMr. Smith raises his gun and points it at Mr. Brooks's head.\nHe hesitates.\n\n                       MR. BROOKS\n             I'll close my eyes.\n\nHe does. Mr. Smith pulls the trigger.\n\nClick!\n\nMr. Smith looks in horror at the malfunctioning gun. Mr.\nBrooks opens his eyes. Mr. Smith aims the gun again.\n\nClick!... Click!\n\n                          MR. BROOKS\n             I'm sorry.\n\nAs he talks he counters around until Mr. Smith is the one\nwith his back to the open Grave.\n\n                       MR. BROOKS\n             I really did want you to kill me.\n             But in case at the last minute I\n             changed my mind, I returned to your\n             apartment and bent the firing pin\n             on your gun.\n\nHe wrenches the shovel out of a mound of waiting earth. Mr.\nSmith tries to fire the gun at Mr. Brooks again.\n\nCLICK!... CLICK!\n\n                       MR. BROOKS\n             In fact I even brought another gun\n             for you so you could finish me if I\n             had decided to go through with it.\n\nHe opens his jacket and shows Mr. Smith the gun.\n\n\n\n                                                     (CONTINUED)\n\n                                                       122.\nCONTINUED: (2)\n\n\n                    MR. BROOKS\n          Unfortunately for you, my daughter\n          is pregnant and just before you\n          pulled the trigger, I realized how\n          much I want to see the end to that\n          story.\n\n                    MR. SMITH\n              (dry mouth)\n          If you do anything to me, if you\n          touch one hair on my head, the\n          Police will find the pictures of\n          you killing that Couple.\n\n                    MR. BROOKS\n          The contents of your safety deposit\n          box, Mr. Smith, have vanished.\n\nWithout warning, Mr. Brooks swings the shovel. The force of\nthe blow breaks Mr. Smith's left arm. He howls.\n\nThe next blow comes almost immediately. It smashes into the\nleft side of Mr. Smith's head.\n\nThe screams stop and a misfiring set of neurons causes Mr.\nSmith to stand up straight and wobbling, look directly at Mr.\nBrooks.\n\nThe blood streaming down his face is black in the moonlight.\n\nMr. Brooks takes a step to the side, cocks his wrists and\nswings again. His full weight is behind this one.\n\nThe blade of the shovel strikes Mr. Smith in the throat very\nnearly taking off his head. The flesh that was once Mr. Smith\nfalls to the ground.\n\n                    MR. BROOKS\n              (looking down at the\n               corpse)\n          Before I was the Thumbprint Killer,\n          Mr. Smith, I killed a lot of people\n          in a lot of different ways.\n\nINT. GRAVE Ñ NIGHT\n\nLooking up. Mr. Smith's body is rolled over the edge. It\nfalls on top of us.\n\n                                                       123.\n\n\n\nEXT. CEMETERY Ñ NIGHT\n\nMr. Brooks takes a shovel of dirt from the pile and whistling\n'By The Light Of The Silvery Moon', begins the task of\ncovering Mr. Smith.\n\nINT. COFFEE SHOP Ñ MORNING\n\nA Newspaper is lying unfolded on the Counter next to the\nremnants of a breakfast.\n\nThe headline reads - NATIONWIDE MANHUNT FOR THUMBPRINT KILLER\n- Under that headline is a large picture of Mr. Smith aka Mr.\nBaffert.\n\nIn the lower right corner is another headline to a story -\nMurder Suicide For The Hangman -.\n\nThe reader of the paper is Mr. Brooks. On a stool next to\nhim, Marshall is also reading.\n\n                    MARSHALL\n          It says here the Thumbprint Killer\n          is a monster... annoys you a little\n          bit that you can't take credit,\n          doesn't it?\n\n                    MR. BROOKS\n          Anyone who is good at what they do,\n          wants recognition. But since I'm\n          not going to do it anymore, I'll\n          let Mr. Smith take the credit.\n\n                    MARSHALL\n          Don't kid yourself, Earl, you're\n          going to kill again.\n\n                    MR. BROOKS\n          No, I'm not. I'll continue the AA\n          meetings and I'll control it.\n\nOn the other stool next to Mr. Brooks is a WOMAN. Her large\npurse hangs open from the back of the stool; the cel phone\nclearly visible inside. Mr. Brooks looks at the phone.\n\n                    MR. BROOKS\n          But there is an answer I would like\n          to have.\n\n                                                       124.\n\n\n\nINT. POLICE STATION Ñ MORNING\n\nDetective Atwood is seated in her CUBICLE reading the same\nfront page Mr. Brooks was reading. A FELLOW OFFICER stops in\nthe door.\n\n                    OFFICER\n          Good work, Atwood.\n\n                    DETECTIVE ATWOOD\n          Thanks, Tom.\n\nHe moves on. From off screen:\n\n                    ANOTHER OFFICER\n          You should ask the FBI to kiss your\n          ass and buy you a Cadillac.\n\n                    DETECTIVE ATWOOD\n          I like my ass too much for that.\n\nSnyder comes in and holds up the Work Order from the Moving\nCompany.\n\n                    SNYDER\n          This is bogus. The company doesn't\n          exist in the city, the state, the\n          United States or Canada.\n\n                    DETECTIVE ATWOOD\n          So the whole point of this piece of\n          paper was to give me Meeks.\n\n                    SNYDER\n          That's what it looks like.\n\n                    DETECTIVE ATWOOD\n          Why? Who moved him, where did they\n          move him to, and why did he give me\n          Meeks?\n\n                    SNYDER\n          That's what we get paid to find\n          out.\n\nAtwood picks up the Newspaper.\n\n                    DETECTIVE ATWOOD\n          I'm going to go to the bathroom and\n          think about this.\n\nShe stands. The phone rings. She answers it.\n\n\n                                                  (CONTINUED)\n\n                                                       125.\nCONTINUED:\n\n\n                       DETECTIVE ATWOOD\n             Detective Atwood...\n\nEXT. ROOFTOP PARKING LOT Ñ MORNING\n\nLooking out at the city, Mr. Brooks speaks into the cel phone\nhe stole from the Woman.\n\n                       MR. BROOKS\n             Why are you a cop?\n\nINTERCUT with Atwood.\n\n                       DETECTIVE ATWOOD\n             Who is this?\n\n                       MR. BROOKS\n             You're rich, you have a good\n             education, you could have gone into\n             your father's business, instead you\n             went outside all of that and became\n             successful on your own. Why?\n\n                       DETECTIVE ATWOOD\n             You want something from me if you\n             don't tell me who you are I'm going\n             to hang up.\n\n                       MR. BROOKS\n             Did you think your husband's\n             killing was random and I certainly\n             didn't have to give you Meeks.\n\n                       DETECTIVE ATWOOD\n             Mr. Baffert?!\n\nSnyder perks up. She points for him to get on the other line.\n\n                       MR. BROOKS\n             What's the answer?\n\n                       DETECTIVE ATWOOD\n             You don't sound like you.\n\n                       MR. BROOKS\n             I have a little cold. Are you going\n             to give me the answer?\n\n                       DETECTIVE ATWOOD\n             Where are you?\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          126.\nCONTINUED:\n\n\n                       MR. BROOKS\n             I'll tell you if you can give me\n             the true answer to my question.\n\nDetective Atwood weighs her options and decides to go for it.\n\n                       DETECTIVE ATWOOD\n             My father was very disappointed I\n             was born a girl and he let me know\n             that. I've spent my whole life\n             trying to prove him wrong.\n\n                          MR. BROOKS\n             Thank you.\n\n                       DETECTIVE ATWOOD\n             Wait. You promised to tell me where\n             you are.\n\n                       MR. BROOKS\n             Me? I'm on top of a building.\n\nAtwood and Snyder hear the click as Mr. Brooks hangs up.\n\n                       DETECTIVE ATWOOD\n             Why would he be interested in that?\n\nAt the Parking structure, Mr. Brooks holds the phone over the\nedge and drops it.\n\nWe follow the phone down, down, down, until it hits the\npavement and disintegrates.\n\nEXT. BROOKS HOUSE Ñ NIGHT\n\nEverything is as it was.\n\nINT. KITCHEN - BROOKS HOUSE Ñ NIGHT\n\nIt's dark. In his robe and pajamas, Mr. Brooks is standing in\nfront of the open refrigerator gazing blankly at the contents\nwith a glass of milk in one hand. There's nothing he wants in\nhere. He closes the door.\n\nINT. UPSTAIRS HALLWAY Ñ BROOKS HOUSE - NIGHT\n\nCarrying the glass of milk, Mr. Brooks passes Jane's ROOM.\nThe door is ajar. He stops, backs up and looks. His\nDaughter's asleep.\n\n                                                       127.\n\n\n\nINT. JANE'S BEDROOM - BROOKS HOUSE Ñ NIGHT\n\nMr. Brooks walks to the bed and leans over to give her a kiss\non the cheek.\n\nHis lips have just brushed her flesh when she twists\nviolently under him and stabs upward with a pair of scissors.\nThe blades are driven deep into his throat. Mr. Brooks jerks\nback, the milk flies out of his hand.\n\n                    MR. BROOKS\n          Agghhh!!! Agghhh!!!\n\nHe grabs at the handle of the scissors, but his blood makes\nthem too slippery. He can't pull them out.\n\n                    EMMA (V.O.)\n          Honey, Earl, Earl...\n\nINT. MASTER BEDROOM Ñ BROOKS HOUSE - NIGHT\n\nMr. Brooks is tossing in his sleep next to Emma. She has a\nhold of his arm.\n\n                    EMMA\n          Wake up, wake up...\n\nOn the pillow Mr. Brooks' eyes fly open.\n\n                    EMMA\n          You were having a nightmare.\n\n                    MR. BROOKS\n              (breathing hard)\n          Oh... I woke you up.\n\n                       EMMA\n          It's okay.\n\nShe kisses him on the forehead.\n\n                    EMMA (CONT'D)\n          I'm here, go back to sleep, I'm\n          here.\n\nTaking his hand, she lies back down. After a moment Mr.\nBrooks turns over on his side and looks directly at us. His\nlips begin to move but we can't hear what he's saying, so we\nmove in on his face. It's not until it fills our view that we\ncan hear the words.\n\n\n\n\n                                                  (CONTINUED)\n\n                                                   128.\nCONTINUED:\n\n\n                       MR. BROOKS\n             ... that I may be reasonably happy\n             in this life, And supremely happy\n             with Him forever in the next. Amen.\n             .... God grant me the Serenity to\n             accept...\n\n\n\nFADE TO BLACK\n\n\n                         THE END\n\n\n\n\n\n\nMr Brooks\nWriters :   Bruce A. Evans  Raynold Gideon\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:31:39.407048"}