{"title": "Mrs. Brown", "film_link": "/Movie Scripts/Mrs. Brown Script.html", "script_link": "/scripts/Mrs.-Brown.html", "info_raw": "\n\nMrs. Brown Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Jeremy Brock\nGenres  Drama  Romance\n\nRead \"Mrs. Brown\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nMrs.Brown\n\n\n\n\n\tMRS BROWN BY JEREMY BROCK\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tBegin on black.  The sound of rain driving into trees. \n\tSomething wipes frame and we are suddenly hurtling through\n\ta forest on the shoulders of a wild-eyed, kilted JOHN\n\tBROWN.  Drenched hair streaming, head swivelling left and\n\tright, as he searches the lightening-dark.  A crack to his\n\tleft.  He spins round, raises his pistol, smacks past\n\tsaplings and plunges on.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tClose-up on BROWN as he bangs against a tree and heaves for\n\tair.  A face in its fifties, mad-fierce eyes, handsome,\n\tbruised lips, liverish.  He goes on searching the dark. \n\tStops.  Listens through the rain.  A beat.  Thinking he\n\thears a faint thump in the distance, he swings round and\n\traces on.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tBROWN tears through the trees, pistol raised at full arm's\n\tlength, breath coming harder and harder.  But even now\n\tthere's a ghost grace, a born hunter's grace.  He leaps\n\tfallen branches, swerves through turns in the path, eyes\n\tforward, never stumbling once.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tBROWN bursts into a clearing, breaks to the centre and\n\tstops.  With his pistol raised, he turns one full slow\n\tcircle.  His eyes take in every swerve and kick of the\n\twildly swaying trees.\n\n\tThere's a crack and a branch snaps behind him.  He spins\n\tround, bellows deep from his heart:\n\n\t\t\t\tBROWN\n\t\tGod save the Queen!!\n\n\tAnd fires.\n\n\tNothing happens.  The trees go on swaying, the storm goes\n\ton screaming and BROWN just stands there, staring into\n\tempty space.  A pause.\n\n\tSlowly, he starts to frown as the fact begins to dawn on\n\thim that he is alone.  He stares at the thrashing trees,\n\twaving their mocking arms at him.  His hand lets the pistol\n\tdrop to his side.  He feels the rain drench down his face. \n\tAnd now, for the first time, we see that his socks have\n\tfallen to his ankles and his knees are cut to shreds.  He\n\tshifts a foot.  His dress-shoes are covered in mud.  He\n\tgoes on staring into the dark.  Nothing. \n\tJust the wind and rain.  Gradually, we pull back, higher\n\tand higher.  As we do, we hear the quiet cultivated voice:\n\n\t\t\t\t\t\tFADE TO BLACK.\n\n\tCAPTION: \"1864\"\n\n\t\t\t\t\t\tFADE IN:\n\n\t\t\t\tPONSONBY (V.O.)\n\t\tI have sent for a Mr. John BROWN from\n\t\tBalmoral.  Her majesty has mentioned\n\t\thim, on one or two occasions, as being\n\t\ta most devoted outdoor servant to\n\t\tPrince Albert during his last days\n\t\tthere...\n\n\tJohn BROWN is now just a tiny figure dwarfed by the storm.\n\n\t\t\t\t\t\t CUT TO:\n\n\tINT. OSBORNE HOUSE, QUEEN VICTORIA'S DRESSING ROOM - DAY\n\n\tThe screen is black.  As the camera pulls back, we discover\n\tthat we are looking at a black night-gown.\n\n\tQueen VICTORIA is sitting at her dressing table, while an\n\telderly HAIRDRESSER, also in black, works at her hair.\n\n\t\t\t\tPONSONBY (V.O.)\n\t\t... The depths of the Queen's sorrow\n\t\tremain impenetrable.  She has now\n\t\trestricted herself to a regime of such\n\t\tferocious introspection that we are\n\t\tall at our wits' end...\n\n\tINT. OSBORNE HOUSE, PRINCE ALBERT'S DRESSING ROOM - DAY\n\n\tA bust of the Prince Consort is draped in black.  His desk\n\tis laid out as if for work.  A VALET is brushing one of his\n\tsuits before laying it carefully on the bed.\n\n\t\t\t\tPONSONBY (V.O.)\n\t\t... The Household continues, at her\n\t\tinstruction, to observe the rituals\n\t\tnow so familiar to her, in a vain\n\t\tattempt to render vivid that which can\n\t\tnever be revived...\n\n\tClose-up on a small table as a shaving brush is placed\n\tcarefully beside a dish of freshly poured water.\n\n\tINT. OSBORNE HOUSE, QUEEN VICTORIA'S DRESSING ROOM - DAY\n\n\tThe hairdresser is pulling VICTORIA's hair back into the\n\twidow's cape.  For the first time, we see her face.  It is\n\tset in a mask of severity.\n\n\t\t\t\tPONSONBY (V.O.)\n\t\t... It will not surprise you to hear\n\t\tthat she continues steadfast in her\n\t\trefusal to accept any public\n\t\tengagements, however trivial...\n\n\tINT. OSBORNE HOUSE, QUEEN VICTORIA'S BEDCHAMBER - DAY\n\n\tA bronze cast of Prince Albert's hand hangs above the Royal\n\tbed.  His sleeping-gown is laid out on one side.\n\n\tA somberly dressed middle-aged man stands by the bed:\n\tDOCTOR JENNER, the Queen's physician.  He is placing\n\tpotions and medicaments in a row on the bedside table.\n\n\tBehind him, TWO MAIDSERVANTS are busy stripping and\n\tremaking the bed while another raises the window to air the\n\troom.\n\n\t\t\t\tPONSONBY (V.O.)\n\t\t... Family and staff expend all their\n\t\tefforts endeavouring to draw her out\n\t\tof this state of unfettered morbidity,\n\t\tbut to no avail.  Indeed, Doctor\n\t\tJenner will not undertake to vouchsafe\n\t\ther sanity, unless some remedy is\n\t\tfound...\n\n\tINT. OSBORNE HOUSE, QUEEN VICTORIA'S DRESSING ROOM - DAY\n\n\tVICTORIA is turning slowly around as a young ASSISTANT\n\tDRESSER completes the fastening on her black crepe dress.\n\n\t\t\t\tPONSONBY (V.O.)\n\t\t... We must hope, therefore, that this\n\t\tMr Brown will appeal to the Queen's\n\t\tsentimental, though deeply-held, view\n\t\tthat all Highlanders are good for the\n\t\thealth.  If she can at least be\n\t\tpersuaded to take the air, the\n\t\tprospect of further recovery may seem\n\t\tless remote...\n\n\tThe assistant dresser pulls too tightly on her dress. \n\tVICTORIA winces slightly.\n\n\t\t\t\tASSISTANT DRESSER\n\t\t\t(terrified)\n\t\tSorry, ma'am.\n\n\tEXT. THE SEA FRONT, ISLE OF WIGHT - DAY\n\n\tWe glide slowly past the coastline as a caption reads:\n\t\"ISLE OF WIGHT. 1864.\"\n\n\tA DRIVER stands against the sea front with a horse and cart\n\tbearing the Royal coat of arms.\n\n\tJohn BROWN leads his pony along the dockside, towards the\n\twaiting driver.  He is in his late thirties, fit, handsome\n\tand dressed in tartan kilt and short jacket.\n\n\t\t\t\tPONSONBY (V.O.)\n\t\t... He is arriving by boat this\n\t\tafternoon, by which time it is hoped\n\t\tHer Majesty will be in a fit state to\n\t\tconsider riding out...\n\n\tINT. OSBORNE HOUSE, PRIVATE SECRETARY'S ROOM - DAY\n\n\tSIR HENRY PONSONBY, the Queen's Private Secretary, is\n\tsitting at his writing desk, completing a letter.\n\n\t\t\t\tPONSONBY (V.O.)\n\t\t... As to that decision, along with\n\t\tall others, we remain, as ever,\n\t\tprisoners of the Queen's grief.\n\t\t\t(beat)\n\t\tEver your devoted husband, Henry.\n\n\tHe folds the letter and slips it into an envelope.  He is a\n\tmiddle-aged man in a dark mourning suit; tall, Saturnine\n\tand with a civil servant's stoop.  As he looks up, we see a\n\twhite-stockinged FOOTMAN standing to attention by the door. \n\tPONSONBY hands the letter to him.\n\n\t\t\t\tPONSONBY (CONT'D)\n\t\tWindsor.\n\n\t\t\t\t\t\t CUT TO:\n\n\tCAPTION: \"OSBORNE HOUSE, ISLE OF WIGHT\"\n\n\tINT. OSBORNE HOUSE, CORRIDOR AND QUEEN'S DINING ROOM - DAY\n\n\tA series of windows are being slammed open by white\n\tstockinged FOOTMEN as members of the ROYAL FAMILY and UPPER\n\tHOUSEHOLD hurry by in silence, all dressed in mourning and\n\trushing to make the luncheon hour.\n\n\tINT. OSBORNE HOUSE, QUEEN'S DRAWING ROOM - DAY\n\n\tQueen VICTORIA heads down the empty corridor with two\n\tladies-in-waiting, LADY ELY and LADY CHURCHILL, hurrying\n\talong a pace behind.\n\n\tINT. OSBORNE HOUSE, QUEEN'S DINING ROOM - DAY\n\n\tMembers of the Royal family and upper household hurry into\n\tthe icy dining room and take their designated places at the\n\tluncheon table.  Everybody is dressed in mourning and\n\tnobody speaks.  Wind whistles through the open windows. \n\tSilence.\n\n\tAmong the diners we catch our first glimpse of BERTIE, the\n\tPrince of Wales.  He is in his mid-twenties, plump, stiff\n\tdressed and balding.  He stands next to his young wife,\n\tPRINCESS ALEXANDRA, who fiddles nervously with her shawl,\n\ttrying to keep warm.\n\n\tAs BERTIE smooths down his thinning hair, DOCTOR JENNER\n\tbustles into the dining room, stands himself next to\n\tPONSONBY and proceeds to conduct a hurried conversation\n\twith the Prince of Wales, entirely in whispers.\n\n\t\t\t\tJENNER\n\t\tCongratulations, Your Royal Highness!\n\n\t\t\t\tBERTIE\n\t\tThank you, Doctor.\n\n\t\t\t\tJENNER\n\t\tA boy, I hear.  Excellent, excellent.\n\n\t\t\t\tBERTIE\n\t\tYes.\n\t\t\t(beat)\n\t\tAlbert Victor.  Eddie for short.  What\n\t\tdo you think?\n\n\t\t\t\tPONSONBY\n\t\tA fine choice, sir.\n\n\t\t\t\tJENNER\n\t\tExcellent!\n\n\tEXT. DOCKSIDE, ISLE OF WIGHT - DAY\n\n\tJOHN BROWN leads his pony gently up the ramp and into the\n\tcarrier bearing the Royal coat of arms.  The DRIVER leans\n\tin.\n\n\t\t\t\tDRIVER\n\t\tAre you riding up front?\n\n\tBROWN looks straight at this man, quiet and reserved.\n\n\t\t\t\tBROWN\n\t\tI'll stay with the pony, thank you. \n\t\tShe's all the way from Deeside and\n\t\tshe's not sure she likes you yet.\n\n\tThe DRIVER shrugs and slams the doors on them.\n\n\tINT. OSBORNE HOUSE, CORRIDOR AND QUEEN'S DINING ROOM - DAY\n\n\tVICTORIA reaches the dining room door and takes a deep\n\tbreath.  LADY ELY and LADY CHURCHILL stop a pace behind.\n\n\t\t\t\tVICTORIA\n\t\tHow many?\n\n\tLADY ELY is slightly taken aback.\n\n\t\t\t\tLADY ELY\n\t\tThe Royal Family and senior members of\n\t\tthe household, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tJust them?\n\n\t\t\t\tLADY ELY\n\t\tYes, ma'am.\n\n\tVICTORIA closes her eyes, then steels herself and steps\n\tthrough the door.\n\n\tINT. OSBORNE HOUSE, QUEEN'S DINING ROOM - DAY\n\n\tEveryone stiffens as VICTORIA walks in.  Acknowledging the\n\tother diners with a quick nod, the Queen takes her place.\n\n\tShe flaps open her napkin and, bang on cue, everyone else\n\tsits and does the same.  The meal is served immediately by\n\twaiting SERVANTS, who plonk the food down without ceremony.\n\n\tIt's a very ordinary meal of meat and vegetables.  VICTORIA\n\tstarts eating heartily, straight away.  Everyone does the\n\tsame.\n\n\tOnly the clink of cutlery and the same eerie silence.\n\n\tEXT. OSBORNE HOUSE, THE GROUNDS - DAY\n\n\tThe Royal horse-carrier rattles into the grounds and on\n\tdown the driveway past the beautiful, manicured lawns\n\tstretching away towards the ornate twin towers of Osborne\n\tHouse.  A few outdoor servants watch its progress\n\tcuriously.\n\n\tINT. OSBORNE HOUSE, QUEEN'S DINING ROOM - DAY\n\n\tThe silence continues as VICTORIA finishes her plain\n\tpudding.  Immediately, servants appear at every place and\n\twhip away the pudding bowls whether their owners have\n\tfinished or not.  Nobody thinks this odd; it is part of the\n\troutine.  DOCTOR JENNER clears his throat.\n\n\t\t\t\tJENNER\n\t\tWe're expecting Brown this afternoon,\n\t\tma'am.\n\n\t\t\t\tVICTORIA\n\t\tWhom?\n\n\tA beat.  VICTORIA takes a sip of water, dabs her mouth with\n\ther napkin and rises.  Everyone else rises too.  Suddenly,\n\tthe Queen turns to Bertie's nervous wife, PRINCESS\n\tALEXANDRA, and proclaims abruptly:\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tThat's a very pretty shawl you are\n\t\twearing, Alex.  Silk suits you well.\n\t\t\t(beat)\n\t\tBut you are not eating enough.  One\n\t\tmust not let vanity overrule one's\n\t\tappetite.\n\n\t\t\t\tPRINCESS ALEXANDRA\n\t\tYes, ma'am.\n\n\tVICTORIA nods earnestly.  Lost to the effect her words have\n\thad, she marches out again.  Behind her, she leaves\n\tPRINCESS ALEXANDRA feeling humiliated and crestfallen in\n\tfront of all the others.  BERTIE takes her hand and\n\tsqueezes tight, trying awkwardly to console.\n\n\tEXT. OSBORNE HOUSE - DAY\n\n\tThe horse-carrier pulls up outside the servant's entrance\n\tand the DRIVER opens the doors.\n\n\tJOHN BROWN pulls out a watch from his waistcoat and checks\n\tthe time.  His eyes narrow critically.\n\n\t\t\t\tBROWN\n\t\tI was due at a quarter past one.\n\t\t\t(beat)\n\t\tYou're late.\n\n\tINT. OSBORNE HOUSE, CORRIDOR - DAY\n\n\tA few minutes later, JOHN BROWN strides down the long\n\tcorridor with PONSONBY at his side.  Their journey takes\n\tthem down an endless series of corridors, past servants and\n\thouseholders hurrying about their duties.  The presence of\n\tthe dead Albert is felt all around in the black-wreathed\n\tportraits and busts that crop up along the way.\n\n\tBROWN and PONSONBY could not be more contrasted.\n\n\t\t\t\tPONSONBY\n\t\t\t(in low tones)\n\t\tHer Majesty's routine at Osborne House\n\t\tis not as you will remember it.  The\n\t\tHousehold remains in full mourning and\n\t\tno-one is permitted to raise their\n\t\tvoice under any circumstances\n\t\twhatsoever.  As for the Queen's\n\t\troutine, she breakfasts at nine\n\t\tthirty, lunches at two,takes tea at\n\t\tfive thirty and dinner at eight forty\n\t\tfive.  No one is allowed to leave the\n\t\tbuilding while the Queen is at home. \n\t\tOn the rare occasions when she is out,\n\t\tyou may ask permission to leave, but\n\t\tonly with my consent. \n\t\tYou're to be ready to walk the pony at\n\t\tany time after ten o'clock.  You'll\n\t\tclean her outdoor things and do any\n\t\todd jobs as and when she requires.\n\n\t\t\t\tBROWN\n\t\tHow will I know?\n\n\t\t\t\tPONSONBY\n\t\t\t(surprised to be interrupted)\n\t\tI'm sorry?\n\n\t\t\t\tBROWN\n\t\tHow will I know what she requires?\n\n\t\t\t\tPONSONBY\n\t\tYou'll be sent a message.\n\n\t\t\t\tBROWN\n\t\tWho'll bring it to me?\n\n\t\t\t\tPONSONBY\n\t\tHer Highness' Equerry.\n\n\t\t\t\tBROWN\n\t\tI need a man who knows where I am.\n\n\t\t\t\tPONSONBY\n\t\tI'm sure it won't be difficult to find\n\t\tyou.\n\n\t\t\t\tBROWN\n\t\tThat's not good enough.\n\n\tA beat.\n\n\t\t\t\tPONSONBY\n\t\tThen we'll have to see what can be\n\t\tarranged.\n\n\t\t\t\tBROWN\n\t\tAye, do.\n\n\tPONSONBY stiffens.  A beat.\n\n\t\t\t\tPONSONBY\n\t\tThere is to be no communication with\n\t\tother members of the household on\n\t\tmatters concerning the court except\n\t\tthrough myself or one of the\n\t\tEquerries.  No plans must be altered\n\t\tunless you are given prior authority\n\t\tby myself or a senior member of the\n\t\thousehold.\n\n\t\t\t\tBROWN\n\t\tI came down at the Queen's request. \n\t\tI'll take my orders from her.\n\n\t\t\t\tPONSONBY\n\t\tIn matters concerning the Household, I\n\t\tact on her behalf.\n\n\tBROWN takes the measure of him.\n\n\t\t\t\tBROWN\n\t\tDo you?\n\n\t\t\t\tPONSONBY\n\t\tYes.\n\t\t\t(beat)\n\t\tI do.\n\n\tBROWN glances up the corridor.\n\n\t\t\t\tBROWN\n\t\tSo, is passing wind out of the\n\t\tquestion or do I need permission for\n\t\tthat?\n\n\tPONSONBY refuses to acknowledge what he has heard.  They\n\treach the door of the Royal Chamber and he concludes the\n\tinterview.\n\n\t\t\t\tPONSONBY\n\t\tAs I am sure you remember from\n\t\tBalmoral, you do not talk while in Her\n\t\tMajesty's presence unless Her Majesty\n\t\taddresses you directly.\n\n\tBROWN refuses to answer, so PONSONBY knocks.  After a\n\tmoment, the door is opened by LADY ELY who ushers them in.\n\n\tINT. OSBORNE HOUSE, QUEEN'S SITTING ROOM - DAY\n\n\tBROWN walks stiffly into the room and stops.  PONSONBY\n\twaits by the door.\n\n\t\t\t\tPONSONBY (O.S.)\n\t\tMr Brown, ma'am.\n\n\tVICTORIA is bent over the desk, working at one of her\n\tnumerous red boxes.  She scribbles furiously at a letter,\n\tunderlining and accenting words as she goes.  Finally, LADY\n\tELY steps up to her side and whispers something in her ear. \n\tShe carries on working.\n\n\tBROWN has time to survey the room.  Dominating everything\n\tare the same black-wreathed busts and portraits of Prince\n\tAlbert glimpsed in the corridor.\n\n\tFinally, VICTORIA nods and LADY ELY beckons BROWN forward. \n\tHe steps up in front of the desk and waits.  VICTORIA looks\n\tup and BROWN bows deeply.\n\n\tSilence.\n\n\tShe stares at him for a long moment without apparently\n\tregistering who he is.  He towers over her, in bright\n\ttartan, while she sits hunched in her seat, all in black\n\tand knotted with tension.\n\n\tFinally, she finds her voice.  She sounds nervous and edgy.\n\n\t\t\t\tVICTORIA\n\t\tMr Brown.\n\n\t\t\t\tBROWN\n\t\tMa'am.\n\n\t\t\t\tVICTORIA\n\t\tYou are here safely.\n\n\t\t\t\tBROWN\n\t\tAye, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tYou are well?\n\n\t\t\t\tBROWN\n\t\tI am.\n\n\t\t\t\tVICTORIA\n\t\tAnd the pony?\n\n\t\t\t\tBROWN\n\t\tShe's well, too.\n\n\tVICTORIA blinks at the sight of him.  His presence is\n\tbringing him back.  A beat.\n\n\t\t\t\tVICTORIA\n\t\tYour family sent cards.  It was much\n\t\tappreciated.\n\n\t\t\t\tBROWN\n\t\tI'm glad of it.\n\n\tIn an effort to control her emotions, VICTORIA now sounds\n\tthe same severe note as at lunch.  But BROWN, unlike\n\tothers, seems unaffected.\n\n\t\t\t\tVICTORIA\n\t\tMy husband was always very\n\t\tcomplimentary in speaking of you.  He\n\t\twould have approved, I am sure, of my\n\t\tcalling on you in this way.\n\t\t\t(beat)\n\t\tI trust it does not inconvenience you\n\t\ttoo much.\n\n\t\t\t\tBROWN\n\t\tI've no family, ma'am, apart from my\n\t\tbrothers and sisters.\n\n\t\t\t\tVICTORIA\n\t\tYes.\n\t\t\t(beat)\n\t\tYou have a brother in service here, do\n\t\tyou not?\n\t\t\t(furrowing her brow)\n\t\tI forget his name.\n\n\t\t\t\tBROWN\n\t\tArchie.\n\n\t\t\t\tVICTORIA\n\t\tYes.\n\t\t\t(beat)\n\t\tThat will be company for you.\n\n\t\t\t\tBROWN\n\t\tYes, ma'am.\n\n\tSilence.  VICTORIA starts to tire.  She takes a sip of\n\twater and spills a little on herself.  Flustered, she\n\tsearches for a hanky but cannot find one.  LADY ELY hurries\n\tup with one of her own and the Queen dabs it off.  BROWN\n\twatches all of this with genuine concern.  When VICTORIA\n\tfinally looks up, he stares at her in deep sympathy.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tHonest to God, I never thought to see\n\t\tyou in such a state.  You must miss\n\t\thim dreadfully.\n\n\tVICTORIA stares back in stunned silence.  PONSONBY coughs\n\tinvoluntarily.  LADY ELY freezes.  A beat.\n\n\t\t\t\tVICTORIA\n\t\tYou do not - he ... get him out.\n\t\t\t(beat)\n\t\tGet him out.  Get him out!\n\n\tSuddenly, BROWN finds himself tugged backwards out of the\n\troom.  LADY ELY rushes up to assist as VICTORIA shouts\n\therself into a fit of uncontrolled sobbing.\n\n\tINT. OSBORNE HOUSE, BROWN'S QUARTERS - DAY\n\n\tSome minutes later, BROWN is angrily unpacking a trunk. \n\tHis humiliation expresses itself in the extraordinary\n\tferocity with which he slams down every object.\n\n\tHis younger brother, ARCHIE, sits on the bed.  He's in his\n\tearly thirties, bright, sharp and dressed in the same\n\tdistinctive kilt and tweed.\n\n\t\t\t\tARCHIE\n\t\t\t(telling it fast)\n\t\tSo the day they arrive, she greets the\n\t\tSultan and his family with barely a\n\t\tword and then retires to her chamber. \n\t\tThe Sultan, not used to State\n\t\tOccasions without a head of State, is\n\t\tstanding in the lobby waiting for\n\t\tsomeone to tell him what to do.  But\n\t\tthe court is under strict instructions\n\t\tnot to talk in the corridors so nobody\n\t\tspeaks to him, not a living soul, for\n\t\tthe whole afternoon.  So now it's\n\t\tdinner and everyone's standing round\n\t\tthe table -- still not a word --\n\t\twaiting for Her Majesty to arrive. \n\t\tOne hour goes by, two, the Sultan's\n\t\tgetting a wee bit peckish to say the\n\t\tleast.  So finally, his wee laddy\n\t\tbreaks for the cold meats and stuffs a\n\t\tslice in his mouth.  Well, the uproar\n\t\twhen she heard.  You'd have thought\n\t\tsomeone had stolen the crown jewels.\n\n\tBROWN stares back, still pissed off.\n\n\t\t\t\tBROWN\n\t\tSo?\n\n\t\t\t\tARCHIE\n\t\tSo, there are rules.  Things you do\n\t\tand things you don't do.\n\n\t\t\t\tBROWN\n\t\tI was just telling the woman how I\n\t\tfeel, for God's sake.\n\n\t\t\t\tARCHIE\n\t\tYou don't tell Her Majesty how you\n\t\tfeel.\n\n\t\t\t\tBROWN\n\t\tI speak as I find, Archie.\n\n\t\t\t\tARCHIE\n\t\tNot down south you don't.\n\n\tBROWN slams a drawer shut.  ARCHIE lets it go and watches\n\this brother.  A beat.\n\n\t\t\t\tARCHIE (CONT'D)\n\t\tSo what did Ponsonby do when she\n\t\tstarted shouting?\n\n\t\t\t\tBROWN\n\t\tI think he nearly ruptured his truss.\n\n\tA beat, then both men burst out laughing.\n\n\tINT. OSBORNE HOUSE, SERVANT'S HALL - DAY\n\n\tThe clatter of voices and banging doors as under servants\n\thurry about with plates, knives and forks, laying the Upper\n\tServant's huge table for dinner.  ARCHIE leads BROWN\n\tthrough this rush of activity.\n\n\t\t\t\tBROWN\n\t\tHow much?\n\n\t\t\t\tARCHIE\n\t\tSeventy a year.\n\n\t\t\t\tBROWN\n\t\tNot bad, not bad.\n\n\t\t\t\tARCHIE\n\t\tHow about yourself?\n\n\t\t\t\tBROWN\n\t\tSixty.\n\n\t\t\t\tARCHIE\n\t\t\t(grinning)\n\t\tThat's pretty good for a ghillie.\n\n\tBROWN smiles dryly.  They pour themselves a drink from the\n\ttable.\n\n\t\t\t\tBROWN\n\t\tPrince Leopold?  Is he the one who\n\t\tbleeds all day?  So what does his\n\t\tvalet do?  Wash his poultices for him?\n\n\t\t\t\tARCHIE\n\t\tIt's better than shovelling horse\n\t\tshit.\n\n\t\t\t\tBROWN\n\t\tIf you were looking for promotion, you\n\t\tshould have picked one of the\n\t\thealthier ones.\n\n\t\t\t\tARCHIE\n\t\tShe's hardly a full hamper herself.\n\n\t\t\t\tBROWN\n\t\t\t(beat)\n\t\tIt's only grief makes her like she is.\n\n\t\t\t\tARCHIE\n\t\tThree years, John.  Is that not a bit\n\t\tlong to be grieving?\n\n\t\t\t\tBROWN\n\t\tShe loved him.\n\n\t\t\t\tARCHIE\n\t\tCome on, man.  There's love and\n\t\tthere's ...\n\n\t\t\t\tBROWN\n\t\tWhat?\n\n\t\t\t\tARCHIE\n\t\tYou know what I mean.\n\n\t\t\t\tBROWN\n\t\tI'm not sure I do, Archie.\n\n\t\t\t\tARCHIE\n\t\tThere's love and there's behaving like\n\t\tyou do because there's nobody to tell\n\t\tyou not to.\n\n\tHold on BROWN.  He lets it go and moves on.  Across the\n\thall, he spots the pretty ASSISTANT DRESSER watching them.\n\n\t\t\t\tBROWN\n\t\tWhich one of us is she flirting with?\n\n\t\t\t\tARCHIE\n\t\tThe good-looking one.\n\n\t\t\t\tBROWN\n\t\tAye?  Then she's obviously not got\n\t\tenough to do.\n\n\t\t\t\tARCHIE\n\t\tYou work the system right, you could\n\t\task her yourself.  Just be thankful\n\t\tyou're not working for Household.  The\n\t\tQueen never lets them out of her\n\t\tsight.  But wee spats like us can slip\n\t\tthrough the net, easy.\n\n\tA beat.  BROWN stares straight at him.\n\n\t\t\t\tBROWN\n\t\tI'm no wee spat, ARCHIE.\n\n\tINT. OSBORNE HOUSE, UPPER CORRIDOR - MORNING\n\n\tThe next day, VICTORIA and her ladies are hurrying down a\n\tcorridor on her way into the dining room.  VICTORIA\n\tsuddenly stops and stares out of the windows.  Her\n\tentourage are several steps past her before they realize\n\twhat's happened and scurry back to take up their positions\n\tbehind.\n\n\tNow we see what has caught her attention.  BROWN is\n\tstanding in the courtyard below, by his pony.  She watches\n\thim for a moment, then without reacting, walks on.\n\n\tEXT. OSBORNE HOUSE - AFTERNOON\n\n\tSome hours later.  It is now raining.\n\n\tA gaggle of ROYAL GRANDCHILDREN hurry out of a carriage\n\tfrom their afternoon recreational while their NANNIES\n\tfrantically try to keep them dry under the umbrellas.  John\n\tBROWN stands tall and erect on the gravel while they rush\n\taround him, laughing and giggling.\n\n\tINT. OSBORNE HOUSE, UPPER CORRIDOR - EVENING\n\n\tRain on the window.  VICTORIA is walking in the opposite\n\tdirection down the corridor with her entourage.  She stops\n\tat the same place as before.\n\n\t\t\t\tVICTORIA\n\t\t\t(as if she had not seem him\n\t\t\t earlier)\n\t\tWho is that?\n\n\tLady Ely peers through the rain.\n\n\t\t\t\tLADY ELY\n\t\tIt's Mr Brown, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tWhat is he doing there?\n\n\t\t\t\tLADY ELY\n\t\tHe appears to be ... standing by his\n\t\thorse.\n\n\t\t\t\tVICTORIA\n\t\tI made no request to go out riding\n\t\ttoday.\n\t\t\t(beat)\n\t\tHow long has he been there?\n\n\t\t\t\tLADY ELY\n\t\tI don't know, ma'am.\n\t\t\t(nervously)\n\t\tHe was observed earlier, I believe.\n\n\tAt this moment, PONSONBY comes down the corridor.\n\n\t\t\t\tVICTORIA\n\t\tSir Henry, Mr Brown is standing in the\n\t\tcourtyard.  I have no wish to go\n\t\triding.\n\n\t\t\t\tPONSONBY\n\t\tI'm very sorry, ma'am.  I can't\n\t\timagine -- he was certainly given no\n\t\tinstructions.\n\n\t\t\t\tVICTORIA\n\t\tPlease make sure it does not happen\n\t\tagain.\n\n\t\t\t\tPONSONBY\n\t\tOf course, at once.\n\n\tVICTORIA takes one last look and walks away.\n\n\tINT. OSBORNE HOUSE, PRIVATE SECRETARY'S CHAMBERS - NIGHT\n\n\tHalf an hour later, PONSONBY stands at his desk facing\n\tBROWN.\n\n\t\t\t\tPONSONBY\n\t\tWhat on earth did you think you were\n\t\tdoing?\n\n\tBROWN stares straight back.\n\n\t\t\t\tBROWN\n\t\tAwaiting my orders.\n\n\t\t\t\tPONSONBY\n\t\tYou do not report for duty unless the\n\t\tQueen requests it.  You know that very\n\t\twell.\n\n\t\t\t\tBROWN\n\t\tI didn't come all this way to sit on\n\t\tmy arse.\n\n\t\t\t\tPONSONBY\n\t\tYou will await your orders like\n\t\teveryone else.  Unless you prefer a\n\t\trepeat of yesterday's little\n\t\texcitement.\n\n\t\t\t\tBROWN\n\t\tNo.\n\n\t\t\t\tPONSONBY\n\t\tI beg your pardon?\n\n\tINT. OSBORNE HOUSE, UPPER CORRIDOR - DAY\n\n\tThe next day.  From a high window, we see PONSONBY\n\tscuttling madly across the courtyard towards the figure of\n\tJOHN BROWN, who is standing exactly as he was the day\n\tbefore.\n\n\tVICTORIA watches impassively.\n\n\tEXT. OSBORNE HOUSE, COURTYARD - DAY\n\n\tPONSONBY stands close to BROWN, shouting in his face.\n\n\t\t\t\tPONSONBY\n\t\tI thought I made myself perfectly\n\t\tclear.  You do not leave your room\n\t\tuntil Her Majesty requests it.\n\n\t\t\t\tBROWN\n\t\t\t(eyes straight ahead,\n\t\t\t shouting back)\n\t\tWell, you tell Her Majesty from me, if\n\t\ther husband was here now, he'd have\n\t\thad her out of that house and getting\n\t\tsome air in her.  What the hell's the\n\t\tpoint in me being here otherwise?!\n\n\tFrom the window above, VICTORIA takes in his words.  A\n\tbeat.  PONSONBY collects himself.\n\n\t\t\t\tPONSONBY\n\t\tGo inside at once.\n\n\t\t\t\tBROWN\n\t\tIs that the Queen's request?\n\n\t\t\t\tPONSONBY\n\t\tYes, it most certainly is!\n\n\tBROWN turns, grabs the lead rein and leads his horse back\n\tto the stables.\n\n\tINT. OSBORNE HOUSE, STABLES - DAY\n\n\tA few minutes later, BROWN is in the process of stabling\n\this horse.  Suddenly he turns.\n\n\tVICTORIA is standing at the far end of the stable with her\n\tentourage.\n\n\t\t\t\tVICTORIA\n\t\tMr Brown.\n\n\t\t\t\tBROWN\n\t\tYes, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tYou have been told repeatedly not to\n\t\tstand in the courtyard unless\n\t\trequested to do so.\n\n\t\t\t\tBROWN\n\t\tYes, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tThen why do you persist in doing it?\n\n\t\t\t\tBROWN\n\t\tBecause I think Her Majesty is wrong. \n\t\tIf ever there was a poor soul who\n\t\tneeded fresh air, it is her.\n\n\tA beat.\n\n\t\t\t\tVICTORIA\n\t\tThe Queen will ride out if and when\n\t\tshe chooses.\n\n\t\t\t\tBROWN\n\t\tAnd I intend to be there when she's\n\t\tready.\n\n\tSilence.  The two of them stare at each other.\n\n\tEXT. OSBORNE HOUSE, THE GROUNDS - DAY\n\n\tThe next day, high and wide over the stunningly manicured\n\tlandscape.  Long lawns, wind-cropped copses and in the\n\tdistance, the glittering sea.\n\n\tEXT. OSBORNE HOUSE, THE GROUNDS - DAY\n\n\tVICTORIA sits side-saddle on a horse.  BROWN leads her in\n\tsilence.\n\n\tEXT. CLIFFTOP - DAY\n\n\tVICTORIA looks up.\n\n\t\t\t\tVICTORIA\n\t\tPrince Albert was going to build a\n\t\tbench here.  He thought it one of the\n\t\tbest views in Osborne.\n\n\t\t\t\tBROWN\n\t\tIt's a fine spot, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tHe thought so, yes.\n\n\tShe stares ahead.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tIn everything I do and everything I\n\t\tsay, I try to think, as much as\n\t\tpossible, what he would do, or say, if\n\t\the were here now.  My Private\n\t\tSecretary wishes me to return to\n\t\tpublic duties--\n\n\tShe stops abruptly, but BROWN cuts in.\n\n\t\t\t\tBROWN\n\t\tIf Prince Albert were here today, he'd\n\t\ttell him a thing or two.\n\n\t\t\t\tVICTORIA\n\t\tSir Henry is not alone.  They all wish\n\t\tit.\n\t\t\t(beat)\n\t\tThe same people who refused to grant\n\t\tmy husband the title of King because\n\t\the was deemed of insufficient rank--\n\n\tShe stops again, cutting quickly back to small-talk.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tIt is a fine spot for a bench, is it\n\t\tnot?\n\n\t\t\t\tBROWN\n\t\tAye, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tYes.\n\n\tA pause.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tI have some letters in the saddle bag. \n\t\tI wish to read them.\n\n\tBROWN walks up to her side, opens the saddle bag and hands\n\ther a bundle of letters held together with ribbon.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tI cannot read them like that.\n\n\tBROWN undoes the ribbon and tries again.  VICTORIA cuts in.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tYou will hand them to me as I require.\n\n\tBROWN takes off the top letter and hands it to her.\n\n\tINT. OSBORNE HOUSE, UPPER SERVANT'S TABLE - NIGHT\n\n\tThe clatter and crush of the Upper Servant's table as UPPER\n\tSERVANTS sit themselves down to dinner while UNDER SERVANTS\n\tprepare to serve soup.\n\n\tARCHIE comes in and sits himself somewhere in the middle\n\tnext to an empty seat.  A moment later, BROWN strides in.\n\n\tBut instead of sitting at the place beside his brother, he\n\tgoes straight to the head of the table and plonks himself\n\tdown.  Slowly, the clatter dies away as the whole room\n\tstops and stares at him in silence.  BROWN fixes them with\n\ta look.\n\n\tAn elderly butler steps into the room and stares in\n\tamazement at BROWN.  A smooth young man, BERTIE'S VALET,\n\thurries up to intercede.\n\n\t\t\t\tBERTIE'S VALET\n\t\tMr. Carter, the Head Butler, sits\n\t\tthere.\n\n\t\t\t\tBROWN\n\t\tNot now he doesn't.  This is my place.\n\n\t\t\t\tBERTIE'S VALET\n\t\tBy whose authority?\n\n\t\t\t\tBROWN\n\t\tMy own.\n\n\tA little frisson of oh-my-gawdness.  BERTIE'S VALET stares\n\ticily at him.\n\n\t\t\t\tBERTIE'S VALET\n\t\tThe order of seating at the Upper\n\t\tServant's table is arranged personally\n\t\tby the Queen herself.\n\n\t\t\t\tBROWN\n\t\tThat's a tautology lad.\n\t\t\t(unable to stop himself\n\t\t\t seriously explaining it)\n\t\tIf you say the Queen arranges\n\t\tsomething, you've no need to say she's\n\t\tdone it personally.  That's\n\t\tunderstood.\n\n\tBut as far as BERTIE'S VALET is concerned, it isn't.  He\n\tstares down in mute fury, then snaps his fingers at one of\n\tthe under servants, who rushes over.  There is a hurried\n\texchange of whispers before the under servant rushes out.\n\n\tUnperturbed, BROWN brings out his flask and pours himself a\n\tsubstantial draft of whiskey.  He turns to the pretty\n\tassistant dresser, sitting to his right.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tAre you dresser to Her Majesty?\n\n\tShe blinks nervously at him.\n\n\t\t\t\tASSISTANT DRESSER\n\t\tAssistant, sir, yes.\n\n\tBROWN tucks into his soup.  Everyone watches and waits.\n\n\t\t\t\tBROWN\n\t\tWhat's your name?\n\n\t\t\t\tASSISTANT DRESSER\n\t\tMary Taylor, sir.\n\n\t\t\t\tBROWN\n\t\tHave I seen you up in Balmoral, Mary?\n\n\t\t\t\tASSISTANT DRESSER\n\t\tI hope to go up next year.\n\n\t\t\t\tBROWN\n\t\tYou wouldn't happen to know what the\n\t\tQueen's reading for recreation, would\n\t\tyou, Mary?\n\n\tThe assistant dresser thinks for a moment.\n\n\t\t\t\tASSISTANT DRESSER\n\t\tLord Tennyson, sir?\n\n\tBROWN nods.  All conversation stops as the under servant\n\tbursts back in.  She halts at the door, looking blankly\n\tfrom Bertie's valet to the elderly butler.  A beat.  The\n\told man stiffens and makes his way to the middle of the\n\ttable.\n\n\tBROWN looks up from his soup.\n\n\t\t\t\tBROWN\n\t\tAm I the only one eating?\n\n\tWith a clatter of spoons, everyone obediently eats.\n\n\tINT. OSBORNE HOUSE, DRAWING ROOM - DAY\n\n\tA few days later.  A morning \"drawing room.\"  Standing\n\tround the unlit fireplace are DOCTOR JENNER, LADY ELY, LADY\n\tCHURCHILL, the two LADIES IN WAITING and PRINCESS\n\tALEXANDRA.  All are dressed against the icy wind that\n\twhistles through the open window where VICTORIA sits\n\tknitting busily while BERTIE stands beside her, coat\n\tbuttoned up to the collar.  PONSONBY has stationed himself\n\topposite, beside a desk piled high with red dispatch boxes. \n\tHe runs through the daily itinerary.\n\n\t\t\t\tPONSONBY\n\t\tLord Clarendon arrives, by invitation,\n\t\tat eleven o'clock, followed at twelve\n\t\tby a picnic in the grounds to\n\t\tcelebrate Princess Alice's birthday. \n\t\tDispatches, as usual, at two.\n\t\t\t(finishes, then coughs)\n\t\tThe Chancellor writes to say that, by\n\t\thappy coincidence, he will be in Cowes\n\t\tfor the weekend.  He asks if Your\n\t\tMajesty might grant him an audience.\n\n\t\t\t\tVICTORIA\n\t\tWhy?\n\n\t\t\t\tPONSONBY\n\t\tHe thought, perhaps, Your Majesty\n\t\tmight wish to be informed of the\n\t\tlatest developments in government.\n\n\t\t\t\tVICTORIA\n\t\tNo.  I shall be out walking.\n\n\tA beat.  BERTIE watches closely now.  PONSONBY coughs\n\tagain, nervous.\n\n\t\t\t\tPONSONBY\n\t\tThen perhaps Your Majesty might\n\t\tconsider it opportune if the Prince of\n\t\tWales were to meet him on your behalf?\n\n\tVICTORIA stiffens.  She speaks without turning.\n\n\t\t\t\tVICTORIA\n\t\tOn no account.\n\n\tPONSONBY gives up.  Politely, but firmly, BERTIE takes up\n\tthe reins.\n\n\t\t\t\tBERTIE\n\t\tMama, I really do think it's time we\n\t\tmade ourselves a little more ...\n\t\tavailable.\n\n\tVICTORIA carries on knitting.\n\n\t\t\t\tBERTIE (CONT'D)\n\t\tI think we must accept our position in\n\t\tthe country is not entirely unrelated\n\t\tto the continued absence of the\n\t\tMonarchy from public life.\n\t\t\t(silence)\n\t\tI thought perhaps we might consider a\n\t\tsmall gesture of some kind?\n\n\tVICTORIA looks up sharply.\n\n\t\t\t\tVICTORIA\n\t\tGesture?\n\n\t\t\t\tBERTIE\n\t\tI thought, a dinner for our\n\t\tambassadors perhaps?\n\n\t\t\t\tVICTORIA\n\t\t\t(cutting in firmly)\n\t\tNo dinners, Bertie.\n\t\t\t(beat)\n\t\tWhy are you dressed for outdoors?\n\n\t\t\t\tBERTIE\n\t\tIt's so infernally cold in here.\n\n\t\t\t\tVICTORIA\n\t\tCold is good--\n\t\t\t(calling across)\n\t\tIs that not so, Dr. Jenner?!\n\n\t\t\t\tJENNER\n\t\tI'm sorry, ma'am?\n\n\t\t\t\tVICTORIA\n\t\tCold is good!\n\n\t\t\t\tJENNER\n\t\tExcellent, ma'am, excellent.\n\t\t\t(trying his hand)\n\t\tBut perhaps if her Majesty were to\n\t\tconsider accompanying her new-found\n\t\tphysical vigor with the benefits of\n\t\tmental activity...\n\n\t\t\t\tVICTORIA\n\t\t\t(becoming very agitated)\n\t\tWhy am I being lectured in this way?!\n\n\t\t\t\tJENNER\n\t\tForgive me, Your Majesty.  In no way\n\t\tdid I wish to suggest--\n\n\t\t\t\tVICTORIA\n\t\t\t(cutting across him)\n\t\tI will not tolerate anybody lecturing\n\t\tme about the responsibility of the\n\t\tmonarchy....\n\n\t\t\t\tBERTIE\n\t\tMother....\n\n\t\t\t\tVICTORIA\n\t\t... Least of all my son.  It was his\n\t\tirresponsibility that drove my husband\n\t\tto his grave.\n\n\tAn appalled silence.  With great dignity, BERTIE absorbs\n\tthe shock of the insult and quietly steers the conversation\n\tin another direction.\n\n\t\t\t\tBERTIE\n\t\tIf it is inconvenient to Her Majesty,\n\t\tthen perhaps she might consider\n\t\tallowing the Prince of Wales to host--\n\n\t\t\t\tVICTORIA\n\t\tI do believe they send so many boxes\n\t\tto taunt me. \n\t\tDoctor Jenner writes to them to say\n\t\tthat my nerves are in an extremely\n\t\tfragile state and yet they continue to\n\t\thound me with box after box after box\n\t\tafter box after box!\n\n\tSilence.  VICTORIA has crossed to the window and stares out\n\tat the view.  Having recovered her composure, she turns to\n\taddress them all.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tI wish to take the Princesses for a\n\t\tswim.\n\n\tFor a moment, nobody believes what they have heard.  She\n\tcontinues.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tThe turns I have been taking in the\n\t\tgrounds have proved most beneficial to\n\t\tme, and Brown thinks that salt water\n\t\twill do me good.\n\n\tBertie stares at her in silence while PONSONBY and DOCTOR\n\tJENNER exchange a worried look.\n\n\tEXT. PRIVATE BEACH, ISLE OF WIGHT - DAY\n\n\tThe doors of the Royal bathing-machine swing open and Queen\n\tVICTORIA, in a voluminous swim-dress, sails out like a duck\n\tinto the freezing sea.  As she does so, the doors of the\n\tother machines open and Princess Helena and Princess Louise\n\tfollow her in.  Dignity does not allow them to shout out,\n\tbut their expressions of constipated agony are a picture.\n\n\tVICTORIA begins swimming around in a vigorous little\n\tcircle.\n\n\t\t\t\tVICTORIA\n\t\tDon't potter, children.  Swim.\n\n\tHold for a moment on the princesses' miserable faces.\n\n\tEXT. OSBORNE HOUSE - DAY\n\n\tHalf an hour later, PONSONBY, DOCTOR JENNER, LADY ELY and\n\ttwo FOOTMEN watch as BROWN helps VICTORIA up some steps and\n\tonto her horse.  He glances at the stiff line of\n\thouseholders and mutters curtly to himself.\n\n\t\t\t\tBROWN\n\t\tYou could buy that lot for garden\n\t\tornaments and still see change from\n\t\tten guineas.\n\n\tThe household do not hear this, but QUEEN VICTORIA has\n\toverheard and tries to suppress a smile. \n\tAs she settles into the saddle, her foot comes loose. \n\tBROWN fastens it into the stirrups.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tLift your foot, woman.\n\n\tEveryone hears this.  VICTORIA obeys.  Taking the reins, he\n\tthen walks the QUEEN out of the courtyard.  As they vanish\n\tfrom site, we hear...\n\n\t\t\t\tDISRAELI (O.S.)\n\t\tThis nation is fortunate in so much as\n\t\tit is not governed by force...\n\n\t\t\t\t\t\tFADE TO BLACK.\n\n\tCAPTION: \"1866\"\n\n\t\t\t\t\t\tFADE IN:\n\n\tINT. THE HOUSES OF PARLIAMENT - DAY\n\n\tThe speech continues as we follow the progress of a\n\tTomahawk cartoon doing the rounds of the Tory back benches\n\tfrom knee to knee.  It is entitled, \"Where is Britannia?\"\n\tand shows an empty throne draped with the Royal cloak.\n\n\t\t\t\tDISRAELI (O.S.)\n\t\t... but by a chain of traditions that\n\t\thave been cherished from generation to\n\t\tgeneration, because in them -- in our\n\t\ttraditions -- are embodied all the\n\t\tlaws which have enabled us to create\n\t\tthe greatest empire of modern times...\n\n\tDuring the above, the cartoon reaches the front benches and\n\tlands on the knees of the young, earnest STANLEY.  As he\n\tfrowns at the picture in front of him, DISRAELI winds up.\n\n\t\t\t\tDISRAELI (CONT'D)\n\t\t... but, even though we have amassed\n\t\tgreat capital and even though we have\n\t\testablished an industry with no\n\t\tparallel in the world, yet all these\n\t\tmighty creations are as nothing\n\t\tcompared to the invisible customs that\n\t\tshape our lives.  To those honorable\n\t\tgentlemen of the opposition who seek\n\t\tto destroy the essential elements of\n\t\tthis country, I say let them remember:\n\t\tEngland cannot begin again.\n\n\tDuring this peroration, we see DISRAELI for the first time. \n\tHe is handsome, obviously Jewish and wire thin, like\n\tDickens on Slimfast.  He dresses almost dandyishly but\n\tspeaks with startling vigor; a combination of brilliance\n\tand cheek that is his key.  To cheers from his back\n\tbenchers, he sits.\n\n\tAs he looks up, he catches the eye of his opposite on the\n\tLiberal benches.  GLADSTONE is different in almost every\n\trespect; dour, dogged, heavy-set and tall.  They stare\n\tlevelly for a second, then DISRAELI flashes a brilliant\n\tsmile.\n\n\tSTANLEY plops the cartoon on his lap.\n\n\t\t\t\tSTANLEY\n\t\tHave you seen this?\n\n\tINT. THE HOUSES OF PARLIAMENT, LOBBY CORRIDOR - DAY\n\n\tA few minutes later, DISRAELI and STANLEY are strolling\n\tdown the busy lobby corridor.  Throughout their talk, Tory\n\tback-benchers bustle up to pat their hero on the back and\n\toffer their congratulations.\n\n\t\t\t\tSTANLEY\n\t\tShould we take it seriously?\n\n\t\t\t\tDISRAELI\n\t\tThe cartoon or Her Majesty's\n\t\tabsenteeism?\n\n\t\t\t\tSTANLEY\n\t\tWell, both.\n\n\t\t\t\tDISRAELI\n\t\tThe question is, do we need her?\n\n\t\t\t\tSTANLEY\n\t\tSurely, you're not suggesting we\n\t\tdispense--\n\n\t\t\t\tDISRAELI\n\t\tMy dear Stanley, a Prime Minister with\n\t\tonly a handful of friends must respect\n\t\tpublic opinion.\n\n\tThe pass GLADSTONE in a huddle of cohorts.\n\n\t\t\t\tDISRAELI (CONT'D)\n\t\tGossip counts.  Lord Aberdeen was\n\t\tright.  This country is not governed\n\t\tby wisdom but by talk.\n\t\t\t(beat)\n\t\tGranted, it wouldn't take much to\n\t\twinkle the old girl out of mourning,\n\t\tbut if public opinion is against her,\n\t\tthen it doesn't do to appear too\n\t\tclose.\n\n\t\t\t\tSTANLEY\n\t\tSo?\n\n\t\t\t\tDISRAELI\n\t\tWe'll see which way the wind blows.\n\n\tDISRAELI sweeps through a prattle of back-benchers.\n\n\tEXT. PUBLIC BEACH, ISLE OF WIGHT - DAY\n\n\tBROWN and ARCHIE crash into the water.  It is freezing. \n\tBROWN braces himself against the icy shallows by bellowing\n\tBurns at the sea.\n\n\t\t\t\tBROWN\n\t\tMy heart's in the Highlands, my heart\n\t\tis not here!  My heart's in the\n\t\tHighlands a-chasing the deer!  Chasing\n\t\tthe wild deer and following the roe! \n\t\tMy heart's in the Highlands wherever I\n\t\tgo!\n\n\tARCHIE is so creased up with laughing, he almost drowns.\n\n\tEXT. PUBLIC BEACH, ISLE OF WIGHT - DAY\n\n\tA few minutes later, BROWN and ARCHIE hurry back up the\n\tcold beach to rub themselves dry.  BROWN is very energized.\n\n\t\t\t\tBROWN\n\t\tOne box of biscuits, one box of drop\n\t\ttablets, one box of pralines, sixteen\n\t\tchocolate sponges.  It's the same\n\t\torder every week, but does anybody\n\t\tbother to check it?  Now she has to\n\t\ttravel all the way to Balmoral without\n\t\tthe few luxuries she actually enjoys.\n\n\t\t\t\tARCHIE\n\t\tSo?  Someone'll send it on ahead.\n\n\t\t\t\tBROWN\n\t\tAye, but will they?\n\n\t\t\t\tARCHIE\n\t\tJohn, it's not your problem what she\n\t\teats.\n\n\t\t\t\tBROWN\n\t\tThe woman's surrounded by fools!\n\t\t\t(beat)\n\t\tShe has to be packed and ready to\n\t\tleave by seven thirty tomorrow\n\t\tmorning.  Knowing that lot, they'll\n\t\tstill be dressing her at eight.\n\n\tBROWN takes a nip of whiskey and offers some to his\n\tbrother.\n\n\t\t\t\tARCHIE\n\t\tShe's got an army of people to get her\n\t\tup and out.\n\n\t\t\t\tBROWN\n\t\tBut I'm the only one she trusts.\n\n\tARCHIE stares at him.  A beat.\n\n\t\t\t\tARCHIE\n\t\tShe'll blow hot and cold on you, John,\n\t\tshe always does.  You want to be\n\t\tcareful.\n\n\t\t\t\tBROWN\n\t\tI'm on ninety pounds a year plus\n\t\tseventy pounds for a pile of tartan\n\t\tI'd be wearing anyway.  That's as much\n\t\tas a Page of the Back Stairs gets and\n\t\tthat job's only for toffs.\n\t\t\t(raising his hip flask\n\t\t\t triumphantly at the sea)\n\t\tI'm Her Majesty's Highland Servant! \n\t\tIndoors and Out.  There's no stopping\n\t\tme now.\n\n\tEXT. BALMORAL CASTLE - NIGHT\n\n\tA few days later.\n\n\tThe clatter of carriage and horse as the ROYAL PARTY\n\tthunders through gathering dark toward Balmoral Castle.\n\n\tCAPTION: \"BALMORAL\"\n\n\tEXT. BALMORAL CASTLE - TWILIGHT\n\n\tA mass of torches encircle the ROYAL PARTY as kilted\n\tGHILLIES and STAFF swarm round the carriage, opening doors\n\tand clambering off boxes while a regiment of PIPERS play\n\tthem in.\n\n\tAmid this swarm of activity, we glimpse BROWN opening the\n\tdoor to a smiling VICTORIA as she climbs down, followed by\n\tPRINCESS HELENA and PRINCESS LOUISE.  Emerging from another\n\tcarriage come BERTIE and PRINCESS ALEXANDRA, staring grim\n\tfaced at the castle.  HENRY PONSONBY and DOCTOR JENNER\n\talight from their carriage as PONSONBY slips on his gloves\n\tand pinches his nose at the pain of remembrance.\n\n\t\t\t\tPONSONBY\n\t\tOh God, not the pipes!\n\n\tEXT. LOCHNAGER - DAY\n\n\tThe next day.\n\n\tHigh over the vast, bleak mountains of Lochnager and Loch\n\tMuick.  VICTORIA and BROWN are riding fast towards the top. \n\tReaching the summit, VICTORIA points excitedly at the far\n\thorizon.\n\n\t\t\t\tVICTORIA\n\t\tWhat are those?\n\n\t\t\t\tBROWN\n\t\tWhat?\n\n\t\t\t\tVICTORIA\n\t\tThose, over there, there.\n\n\t\t\t\tBROWN\n\t\t\t(horse chestnut trees...)\n\t\tCraobhan-geanmchno-fhiadhaich.\n\n\t\t\t\tVICTORIA\n\t\t\t(beat)\n\t\tCraobhan-geanmchno...\n\t\t\t(bursts out laughing)\n\t\tHow can I possibly say that with a\n\t\tstraight face?!\n\n\tBROWN lets it go and they ride on.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tI am thinking of publishing my\n\t\t\"Highland Journals.\"\n\n\t\t\t\tBROWN\n\t\tAre they worth reading?\n\n\t\t\t\tVICTORIA\n\t\t\t(beat)\n\t\tI am told so.\n\n\t\t\t\tBROWN\n\t\tWho by?\n\n\t\t\t\tVICTORIA\n\t\tSir Henry Ponsonby tells me they are\n\t\tcharming.\n\n\t\t\t\tBROWN\n\t\tWhat does he know about the Highlands?\n\n\t\t\t\tVICTORIA\n\t\tHe has been attending at Balmoral for\n\t\tmany years.\n\n\t\t\t\tBROWN\n\t\tThat doesn't make him an expert.\n\n\t\t\t\tVICTORIA\n\t\tHis remarks were directed at the\n\t\tquality of the writing, not its\n\t\tsubject.\n\n\t\t\t\tBROWN\n\t\tI don't groom a horse to have it\n\t\tadmired by others, I groom it because\n\t\tit needs grooming.\n\n\t\t\t\tVICTORIA\n\t\t\t(curtly)\n\t\tI do not do it for others.  But\n\t\tPonsonby thinks they are good.\n\n\t\t\t\tBROWN\n\t\tJust say what you have to say, woman. \n\t\tWhat other people think shouldn't\n\t\tmatter to you.\n\n\t\t\t\tVICTORIA\n\t\t\t(snapping)\n\t\tOf course I shall say what I have to\n\t\tsay.  I always do.\n\n\tThe stare at each other until BROWN kicks his horse on.\n\n\t\t\t\tBROWN\n\t\tAye, well, if all you want is a good\n\t\topinion then he'd be sure to oblige\n\t\tyou.\n\n\t\t\t\tVICTORIA\n\t\t\t(riding alongside)\n\t\tWhat Mr Ponsonby was appreciating was\n\t\ttheir literary merit, a skill not\n\t\tintimately associated with the\n\t\tknowledge of grooming.\n\t\t\t(beat)\n\t\tLiterary appreciation does not begin\n\t\tand end with Tennyson.\n\n\tBROWN lowers his head.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\t\t(in a softer tone)\n\t\tI mention you in them.\n\n\tBROWN says nothing.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tIn particular, the occasion when\n\t\tAlbert was alive; the Royal Carriage\n\t\toverturned during a storm and you\n\t\tdemonstrated such loyal service in\n\t\treturning the Queen and the Princesses\n\t\tsafely to Balmoral.\n\n\tTaking a sprig of heather from her brooch, VICTORIA holds\n\tit out to him.  A beat.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tFor friendship.\n\n\tINT. BALMORAL CASTLE - DAY\n\n\tA few days later, PONSONBY, DOCTOR JENNER and BROWN stand\n\tat the chamber-desk, talking over the Queen's itinerary.\n\n\t\t\t\tBROWN\n\t\t\t(briskly)\n\t\tShe'll be away on Friday between eight\n\t\to'clock and six in the evening to\n\t\tvisit the Grants in Glasalt.  If she's\n\t\tto make the journey there and back in\n\t\tthe day she's to have no distractions\n\t\tthe night before.  She'll take a light\n\t\tsupper alone in her private drawing\n\t\troom and retire early.\n\n\t\t\t\tPONSONBY\n\t\tShe'll need to sign dispatches before\n\t\tshe retires.\n\n\t\t\t\tBROWN\n\t\tThat can wait till the weekend.\n\n\t\t\t\tPONSONBY\n\t\tThere are important papers from --\n\n\t\t\t\tBROWN\n\t\tIt can wait.  Anything else?\n\n\t\t\t\tJENNER\n\t\tAre you sure Her Majesty is up to such\n\t\ta long journey?  She has only just\n\t\trecovered from a severe head cold.\n\n\t\t\t\tBROWN\n\t\tIf I thought she wasn't up to it, I\n\t\twouldn't let her go, would I?\n\n\tBROWN snaps together his papers and walks out, leaving\n\tPONSONBY and DOCTOR JENNER standing lamely at the table.\n\n\tEXT. BALMORAL CASTLE - DAY\n\n\tThe next morning.  The ROYAL FAMILY are picnicking in the\n\tgrounds.  VICTORIA walks along a path accompanied on one\n\tside by BROWN, on the other by BERTIE.\n\n\tBERTIE is in mid-plea.\n\n\t\t\t\tBERTIE\n\t\tSurely it is for the gentlemen to\n\t\tdecide when to stop...\n\n\t\t\t\tVICTORIA\n\t\tIt is a disgusting habit, Bertie.  It\n\t\tshould be discouraged.\n\n\t\t\t\tBERTIE\n\t\tYes, but isn't midnight a little\n\t\texcessive?\n\n\t\t\t\tVICTORIA\n\t\tIt is quite late enough.\n\n\t\t\t\tBERTIE\n\t\tBut mama, the room was built expressly\n\t\tfor that purpose.  It has been a\n\t\tsmoking-room by tradition ever since\n\t\tfather --\n\n\t\t\t\tVICTORIA\n\t\t\t(cutting in angrily)\n\t\tBrown's responsibilities are onerous\n\t\tenough already.  He has far too much\n\t\tto do without having to stay up all\n\t\tnight waiting for you to go to bed. \n\t\tThe smoking-room will be closed and\n\t\tthe lights put out at twelve o'clock.\n\n\t\t\t\tBERTIE\n\t\tMama...\n\n\t\t\t\tVICTORIA\n\t\tAnd that is my last word on the\n\t\tmatter.\n\n\t\t\t\tBERTIE\n\t\tWell, I'm sorry, but I really do think\n\t\tit's too much that the gentlemen of\n\t\tthe house should be dictated to by a\n\t\tservant.\n\n\t\t\t\tBROWN\n\t\tIt's the Queen's decision.\n\n\t\t\t\tBERTIE\n\t\tI beg your pardon?\n\t\t\t(to VICTORIA)\n\t\tMama...?\n\n\tBefore Bertie can continue, BROWN steps right into his\n\tface.\n\n\t\t\t\tBROWN\n\t\tI think you should go now.\n\t\t\t(beat)\n\t\tYou've tired your mother enough.\n\n\tBERTIE stares back, too stunned to speak.  He glances at\n\this mother, but VICTORIA looks off into the distance as if\n\tshe has not heard.  BERTIE turns and storms away.\n\n\tINT. ESTATE COTTAGE, BALMORAL - DAY\n\n\tJOHN BROWN is standing in the doorway of a small cottage\n\twatching, with amused detachment, as a middle-aged couple,\n\tMR and MRS GRANT, race about their tiny living room, trying\n\tdesperately to make it presentable for the Queen's sudden\n\tvisit.  They fling open the windows, slosh water on the\n\tfire, tidy up their two grubby BOYS, plump up the cushions,\n\tdump knitting under the sofa and try to smarten themselves\n\tup, all in the space of a few seconds.\n\n\t\t\t\tBROWN\n\t\tThere's really no need for this.\n\n\t\t\t\tMRS GRANT\n\t\tI'll not have her seeing it like it\n\t\tis!\n\t\t\t(beat)\n\t\tI know she means well, but I wish\n\t\tshe'd warn us she was coming.\n\n\t\t\t\tBROWN\n\t\tShe thinks if she warned you, you'd go\n\t\tpouring water on the fire and stuffing\n\t\tthe knitting under the sofa.\n\n\t\t\t\tMR GRANT\n\t\tAye, well, you can't stop a wife being\n\t\thouse-proud.\n\n\tMRS GRANT surveys the room critically.\n\n\t\t\t\tMRS GRANT\n\t\tAll right.\n\t\t\t(beat)\n\t\tShow her in.\n\n\tEXT. ESTATE COTTAGE, BALMORAL - DAY\n\n\tVICTORIA sits on a horse and trap.  BROWN steps out and\n\thelps her down.\n\n\t\t\t\tBROWN\n\t\tThey're ready now.\n\n\t\t\t\tVICTORIA\n\t\tI hope they didn't go to any trouble,\n\t\tJohn.\n\n\t\t\t\tBROWN\n\t\tAh, well...\n\n\tINT. ESTATE COTTAGE, BALMORAL - DAY\n\n\tVICTORIA steps in to be greeted by all four GRANTS in one\n\tmilitary row, smoke still steaming off the fire.  BROWN\n\tstands behind her, barely able to contain himself.  But for\n\tVICTORIA, it is all she's ever known and so she takes it as\n\tperfectly normal.\n\n\t\t\t\tVICTORIA\n\t\tMr Grant.  How good it is to see you.\n\n\t\t\t\tMR GRANT\n\t\t\t(bowing deeply)\n\t\tYour Majesty.\n\n\t\t\t\tVICTORIA\n\t\tMrs Grant.  How is your knee?  Has the\n\t\tpain eased a little?\n\n\t\t\t\tMRS GRANT\n\t\t\t(bobbing in terror)\n\t\tOh not so bad, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tGood.  Oh and here are Douglas and\n\t\tJohn.  Haven't you grown?\n\n\t\t\t\tMRS GRANT\n\t\t\t(still bobbing away)\n\t\tGrowing all the time, ma'am.\n\n\tMR GRANT remembers himself and gestures VICTORIA towards a\n\tchair.\n\n\t\t\t\tMR GRANT\n\t\tWill you sit, ma'am?\n\n\tFrom his place by the wall, BROWN notices how easily she\n\tsmiles as she is led to the chair.  She points to a picture\n\ton the wall and her good humour is infectious.\n\n\t\t\t\tVICTORIA\n\t\tI know that!  That's Cairn Lochan.  We\n\t\tpicnicked there once, did we not,\n\t\tJohn?\n\n\tINT. A SOCIETY PARTY, LONDON - DAY\n\n\tA few days later, a party of ARISTOCRATS, MINISTERS,\n\tDIPLOMATS, ESCORTS, BUSINESSMAN and WHORES.  Into this\n\tbrouhaha come DISRAELI, his elderly wife MARY ANNE and the\n\tyoung STANLEY.  It is all eyes and nods here.  Everyone\n\tknows everyone.\n\n\t\t\t\tDISRAELI\n\t\tAh, the greasy pole.\n\n\t\t\t\tMARY ANNE\n\t\tDon't be facetious, dear. Remember\n\t\tyour position.\n\n\t\t\t\tDISRAELI\n\t\tIt's my position I'm thinking of.\n\n\tAcross the room, STANLEY spots BERTIE amid a crowd of\n\tacolytes.\n\n\t\t\t\tSTANLEY\n\t\tI see the Prince of Wales is here.\n\n\t\t\t\tDISRAELI\n\t\tI hope he got his mother's permission.\n\n\tSTANLEY smiles faintly.  DISRAELI homes in on a punter and\n\traises his hand, already working the room.\n\n\t\t\t\tDISRAELI (CONT'D)\n\t\tLord Salisbury!\n\n\tINT. A SOCIETY PARTY, LONDON - DAY\n\n\tThe society party is hotting up.  STANLEY is deep in\n\tconversation with three SOCIETY LADIES.\n\n\t\t\t\tSOCIETY LADY 1\n\t\t\t(ridiculously pleased with\n\t\t\t herself)\n\t\tWhy is the Queen penny-wise and pound\n\t\tfoolish?  Because she looks after the\n\t\tBrowns and lets the sovereigns take\n\t\tcare of themselves!\n\n\tA peal of naughty laughter.  Unseen, DISRAELI steps up.\n\n\t\t\t\tDISRAELI\n\t\tAnd in your opinion?  Is she foolish?\n\n\tThe SOCIETY LADY stares blankly back.\n\n\t\t\t\tSOCIETY LADY 1\n\t\tWell I ... well, I mean to say, it's\n\t\thardly right, is it?\n\n\t\t\t\tDISRAELI\n\t\tWhat?\n\n\t\t\t\tSOCIETY LADY 1\n\t\tWell, the Queen and --\n\t\t\t(appalled whisper)\n\t\tMr Brown.\n\n\tDISRAELI stares at her steadily, already thinking ahead.\n\n\t\t\t\tDISRAELI\n\t\tLa superstition met le monde entier en\n\t\tflammes.\n\n\t\t\t\tSOCIETY LADY 2\n\t\t\t(thick as shit)\n\t\tI beg your pardon?\n\n\t\t\t\tDISRAELI\n\t\t\t(changing tack)\n\t\tHas anybody seen this ... Mr Brown?\n\n\t\t\t\tSTANLEY\n\t\tHe is her personal servant, I believe.\n\n\t\t\t\tSOCIETY LADY 1\n\t\t\t(knowingly)\n\t\tFollows her wherever she goes.\n\n\t\t\t\tDISRAELI\n\t\tHe would hardly make a very good\n\t\tpersonal assistant if he did not.\n\n\tINT. ESTATE COTTAGE, BALMORAL - DAY\n\n\tBROWN stands by a wall, smiling to himself at the sight of\n\tQUEEN VICTORIA struggling to help lay the table while MRS\n\tGRANT nervously prattles on.\n\n\t\t\t\tMRS GRANT\n\t\t... it's not my best china.  I mean,\n\t\tit is my best china now, but the\n\t\tfamily set got stolen last summer.\n\n\t\t\t\tVICTORIA\n\t\tOh, I'm so sorry ...\n\n\t\t\t\tMRS GRANT\n\t\tOf course it was no-one on the Estate. \n\t\tMore likely one of the lads from\n\t\tBraemar.  Or further even.\n\t\t\t(beat)\n\t\tI'll fetch the salt.\n\n\tMRS GRANT scurries away.  VICTORIA immediately holds up the\n\tspoons to BROWN with a questioning look -- above or beside\n\tthe plate?  He nods her to the top and she quickly carries\n\ton.\n\n\tINT. A SOCIETY PARTY, LONDON - DAY\n\n\tDISRAELI and MARY ANNE stand with BERTIE and his ACOLYTES.\n\n\t\t\t\tBERTIE\n\t\tMr Disraeli.  Ma'am.\n\n\t\t\t\tDISRAELI\n\t\tYour Royal Highness.  What a pleasure\n\t\tto see you here.\n\n\t\t\t\tBERTIE\n\t\tHave you met Mr Lyle?  He's in\n\t\tsugar...?\n\n\t\t\t\tDISRAELI\n\t\tI don't think I've had that pleasure.\n\n\tDISRAELI shakes hands with the fat sugar tycoon who wobbles\n\twith drink.  MARY ANNE engages him in conversation while\n\tBERTIE turns DISRAELI aside.\n\n\t\t\t\tBERTIE\n\t\tNo doubt you've heard the rumors.\n\n\t\t\t\tDISRAELI\n\t\tI take no account of gossip, Your\n\t\tHighness.\n\n\t\t\t\tBERTIE\n\t\tMy concern is for the reputation of\n\t\tthe Monarchy.\n\n\t\t\t\tDISRAELI\n\t\tOf course.\n\n\t\t\t\tBERTIE\n\t\tI fear the influence he has on her. \n\t\tThe man's word is not to be credited. \n\t\tHe is an arriviste of the very lowest\n\t\twater.\n\t\t\t(beat)\n\t\tShe's having a bust cast of him.  In\n\t\tNero Marquino marble.\n\n\t\t\t\tDISRAELI\n\t\tI see.\n\n\t\t\t\tBERTIE\n\t\tI would talk to her myself, but she\n\t\twon't listen to me.  She must be\n\t\tpersuaded, by someone she respects, to\n\t\tabandon this ridiculous favoritism\n\t\tbefore a situation develops.\n\n\t\t\t\tDISRAELI\n\t\tA situation?\n\n\t\t\t\tBERTIE\n\t\tI don't imagine you frequent the\n\t\tRepublican Clubs.  But the fact that\n\t\tneither you nor I are members should\n\t\tnot blind us to the significance of\n\t\ttheir existence.\n\t\t\t(beat)\n\t\tThe Tory Party has always been our\n\t\tparty.\n\n\t\t\t\tDISRAELI\n\t\tI'm flattered you think so.\n\n\t\t\t\tBERTIE\n\t\tI tell you, if we don't stick together\n\t\ton this, you could find yourself First\n\t\tPresident's Opposition.\n\t\t\t(murdering it)\n\t\tDu Royaum Uni.\n\n\t\t\t\tDISRAELI\n\t\tQuite.\n\n\tA beat.\n\n\t\t\t\tBERTIE\n\t\tI don't think we can overstate the\n\t\tseriousness of this.\n\n\tDISRAELI nods and BERTIE walks swiftly back to his party. \n\tThe moment he's gone, STANLEY steps up to DISRAELI's side.\n\n\t\t\t\tSTANLEY\n\t\tWhat did he want?\n\n\t\t\t\tDISRAELI\n\t\tTo know when he'll be king.\n\n\tINT. ESTATE COTTAGE, BALMORAL - DAY\n\n\tVICTORIA, BROWN and the GRANTS are eating around a large\n\ttable.  Like a wife watching her husband, VICTORIA beams\n\tproudly at BROWN as he tells a story.\n\n\t\t\t\tBROWN\n\t\t... so Grant here and myself are\n\t\triding over Lochnagar and the rain's\n\t\tpouring down in sheets and all we're\n\t\tthinking about is getting home for a\n\t\tdrink, when through the gloom Grant\n\t\tspots a couple of poachers.  He gives\n\t\tme a shout and we chase them down\n\t\ttowards the loch until Grant has your\n\t\tmen up against the stacks and he's\n\t\tshouting and cursing at them, \"Why are\n\t\tyou poaching on Royal land?!\"  And one\n\t\tof the little fellas looks up at him\n\t\tand says, \"coz we've come up in the\n\t\tworld.\"\n\n\tFor a split second, both the GRANTS look petrified, then\n\tBROWN and VICTORIA explode into laughter and the GRANTS\n\trelax.  Suddenly the GRANTS are helpless with laughter too. \n\tBeginning with VICTORIA's glass, BROWN pours out liberal\n\tquantities of whiskey all round.\n\n\tEXT. BALMORAL CASTLE - DUSK\n\n\tLater that night, the courtyard is packed with a gaggle of\n\tworried HOUSEHOLDERS holding lamps.\n\n\tThrough the light, BROWN and VICTORIA clatter into the\n\tcourtyard on the horse and trap.  DOCTOR JENNER breaks\n\tthrough the crowd in a state of high excitement.\n\n\t\t\t\tJENNER\n\t\tYour Majesty!  Thank goodness you're\n\t\tsafe!  I'll have a bath prepared\n\t\timmediately.  I recommend Macdonald's\n\t\tAfrican Embrocation --\n\n\t\t\t\tBROWN\n\t\t\t(cutting in)\n\t\tAh, pipe down, man.  The woman's fine.\n\n\t\t\t\tVICTORIA\n\t\tWe stayed a little longer than\n\t\texpected with Mr and Mrs Grant.  It\n\t\twas most agreeable.\n\n\t\t\t\tPONSONBY\n\t\tWe were expecting you to return by\n\t\tsix.\n\n\t\t\t\tVICTORIA\n\t\tAnd now I am back.\n\n\tBROWN cannot resist one more little dig.\n\n\t\t\t\tBROWN\n\t\tWe took a nip of whiskey.\n\n\t\t\t\tVICTORIA\n\t\tTo keep out the cold.\n\n\t\t\t\tBROWN\n\t\tAye.\n\n\tVICTORIA smiles and BROWN lifts her off the trap.  Before\n\twalking in she turns and, in front of everyone, says...\n\n\t\t\t\tVICTORIA\n\t\tThank you, John.\n\n\tBROWN bows and the QUEEN walks on.  As she straightens up,\n\the finds PONSONBY and DOCTOR JENNER staring back at him in\n\tutter disbelief at what she has just said.  He turns and\n\tleads the horse back to the stables.\n\n\t\t\t\tJENNER\n\t\t\t(under his breath)\n\t\tShe's drunk.\n\n\tPONSONBY doesn't answer.  He is watching BROWN very\n\tclosely.\n\n\t\t\t\tJENNER (CONT'D)\n\t\tA distinct flushing around the cheeks. \n\t\tShe was drunk, I tell you.\n\n\t\t\t\tPONSONBY\n\t\tNo, she wasn't.\n\n\tSilence.  JENNER turns to look at PONSONBY.\n\n\t\t\t\tJENNER\n\t\tSurely not ...\n\n\tPONSONBY's face is set hard.\n\n\t\t\t\tPONSONBY\n\t\tDon't even think about it.\n\n\tINT. BALMORAL CASTLE, BALLROOM - NIGHT\n\n\tA crush of kilted GHILLIES as we slam into the height of\n\tthe annual Ghillie's Ball.\n\n\tThe whole court is reeling through the dance; all of them\n\tbeholding the extraordinary spectacle of QUEEN VICTORIA and\n\tJOHN BROWN dancing together in the middle of the hall.\n\n\tPONSONBY and JENNER stand by the wall, watching.  Close-up\n\ton PONSONBY'S face as JENNER mutters darkly.\n\n\t\t\t\tJENNER\n\t\tPandora's Box ...\n\n\tWith a slam of feet the reel ends, the GHILLIES roar and\n\tBROWN and VICTORIA stand smiling at each other in silence. \n\tA King and his Queen.\n\n\tINT. BALMORAL CASTLE, BALLROOM - NIGHT\n\n\tLater that night.\n\n\tWe find BROWN, slouched on the ground, dead-drunk and\n\tsnoring loudly.\n\n\tEXT. LOCHNAGER - DAY\n\n\tA few days later, four JOURNALISTS are scrabbling up a\n\tstony path, armed with telescopes.\n\n\tEXT. LOCHNAGER - DAY\n\n\tA large ROYAL PARTY is making its way smoothly and quietly\n\tup the mountain.  BROWN is on horseback, leading VICTORIA\n\ton a dapple-grey.\n\n\tEXT. LOCHNAGER - DAY\n\n\tThe JOURNALISTS rattle up the hill.\n\n\tEXT. LOCHNAGER - DAY\n\n\tBROWN and VICTORIA start pulling ahead of the main party.\n\n\tEXT. LOCHNAGER - DAY\n\n\tThe JOURNALISTS scramble up to some gorse bushes, dump\n\tthemselves down and start setting up the telescopes.\n\n\tEXT. LOCHNAGER - DAY\n\n\tBROWN and VICTORIA near the summit when BROWN suddenly\n\tstops.  He stiffens and turns to face the wind, as if\n\tcatching a scent.  VICTORIA frowns.\n\n\t\t\t\tVICTORIA\n\t\tWhat is it, John?\n\t\t\t(beat)\n\t\tJohn?\n\n\t\t\t\tBROWN\n\t\tI heard something.\n\n\tBROWN's eyes fix on some distant gorse bushes.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tI won't be long.\n\n\tHe dismounts and races off.\n\n\tEXT. LOCHNAGER - DAY\n\n\tThe JOURNALISTS are peering through their telescopes.\n\n\t\t\t\tJOURNALIST 1\n\t\tWhere did he get to?  I've lost him?\n\n\tBelow them, BROWN races across the riverbank and\n\tundergrowth, unseen.\n\n\t\t\t\tJOURNALIST 2\n\t\tI don't know if there's much worth\n\t\twriting about.\n\n\t\t\t\tJOURNALIST 1\n\t\tHard to tell.\n\n\tBROWN rears up above them and stops.\n\n\t\t\t\tBROWN\n\t\tThis close enough for you?  Go on!  On\n\t\tyour way!  You filthy scavengers!\n\n\tThe JOURNALISTS scramble to their feet and start legging it\n\tdown the hill, while BROWN roars furiously, hurling their\n\tbags after them.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tYou leave her alone, do you hear?!\n\n\tThe JOURNALISTS vanish below the hillside.\n\n\tINT. BALMORAL CASTLE, UPPER SERVANT'S TABLE - NIGHT\n\n\tThat night.\n\n\tBROWN is standing at the head of the table, yelling at the\n\tUPPER SERVANTS, irrespective of ARCHIE or anyone.\n\n\t\t\t\tBROWN\n\t\tIf I catch the miserable by-blow who\n\t\ttold those men where she'd be, then\n\t\tI'll hang his balls to dry on Jock\n\t\tWemyss, so I will!!\n\n\tARCHIE glances up at BERTIE'S VALET.  He is staring down at\n\tthe table, teeth gritted, fists clenched.  BROWN rounds on\n\tthem all again.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tWhat happens to John Brown is his\n\t\tbusiness, but the Queen's security\n\t\twill never be compromised!\n\n\t\t\t\tBERTIE'S VALET\n\t\tWe --\n\n\t\t\t\tBROWN\n\t\tYou'll talk when I'm finished!\n\n\tBERTIE'S VALET stares at him in astonishment.  BROWN turns\n\tback to the table.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tThat kind of disloyalty will not be\n\t\ttolerated in this house, is that\n\t\tclear?\n\t\t\t(beat, yelling)\n\t\tI said, is that clear?!\n\n\tThere is a general mutter of assent.  BROWN turns and\n\tstorms out as ARCHIE gets up to follow.\n\n\tINT. BALMORAL CASTLE, HENRY PONSONBY'S ROOMS - DAY\n\n\tA few days later, PONSONBY is sitting at his desk, hands to\n\this hips, listening quietly as DOCTOR JENNER reads from his\n\tcopy of Punch.\n\n\t\t\t\tJENNER\n\t\t\"Court Circular, Balmoral.\"\n\t\t\t(beat)\n\t\t\"On Tuesday, Mr John Brown enjoyed a\n\t\tdisplay of sheep-dipping by local\n\t\tfarmers.  On Wednesday, he attended a\n\t\tseance where he was pleased to listen\n\t\tto a recital of Auld Lang Syne by Mr\n\t\tRobert Burns himself ...\"\n\n\tINT. BALMORAL CASTLE, LOWER CORRIDOR - DAY\n\n\tBROWN crashes through a door holding a copy of the same\n\tjournal.\n\n\t\t\t\tJENNER (O.S.)\n\t\t\"... On Thursday, Mr John Brown walked\n\t\ton the slopes, accompanied by family\n\t\tand friend ...\"\n\n\tINT. BALMORAL CASTLE, CORRIDOR - DAY\n\n\tBROWN storms up to PONSONBY's door.\n\n\t\t\t\tJENNER (O.S.)\n\t\tMr Brown retired early.\n\n\tINT. BALMORAL CASTLE, HENRY PONSONBY'S ROOMS - DAY\n\n\tBROWN bursts in on PONSONBY and JENNER, slamming down his\n\tcopy of Punch on the desk.  He is furious but controlled.\n\n\t\t\t\tBROWN\n\t\tIf I find out that you had anything to\n\t\tdo with this, I will have you sacked.\n\n\t\t\t\tPONSONBY\n\t\tI believe that decision rests with Her\n\t\tMajesty.\n\n\t\t\t\tBROWN\n\t\tDon't think I can't persuade her.\n\n\t\t\t\tPONSONBY\n\t\tI don't doubt that the Queen was\n\t\thighly amused.  She has always had a\n\t\tvery healthy sense of humor.\n\n\t\t\t\tBROWN\n\t\tThis is a slur on her good name.\n\n\t\t\t\tPONSONBY\n\t\tIn as much as the article is about\n\t\tyourself, I think you must now accept\n\t\tthat the public has a right to its\n\t\tinterest in you.\n\n\t\t\t\tBROWN\n\t\tNobody has any rights over me.\n\n\t\t\t\tPONSONBY\n\t\tWe are all of us subject to forces\n\t\tbeyond our control, Mr Brown, even\n\t\tyou.\n\n\tBROWN stares at him in silence.  A beat.\n\n\t\t\t\tBROWN\n\t\tYou'll regret saying that.\n\n\t\t\t\t\t\tFADE TO BLACK.\n\n\tCAPTION: \"1867\"\n\n\t\t\t\t\t\tFADE IN:\n\n\tINT. THE HOUSES OF PARLIAMENT - DAY\n\n\tChaos.  The Tories are losing the vote as both sides of the\n\thouse stand and shout at each other while the SPEAKER rises\n\tin his chair.\n\n\t\t\t\tSPEAKER (O.S.)\n\t\tOrder!  Order!  ORDER!\n\n\tA buzzing silence settles as the house sits for the vote. \n\tThe COUNTERS approach the chair.\n\n\t\t\t\tSPEAKER (CONT'D)\n\t\tResult of the vote to the first\n\t\treading of the Bill to Disestablish\n\t\tthe Irish Church.\n\n\tA murmur of excitement from the LIBERALS.\n\n\t\t\t\tSPEAKER (CONT'D)\n\t\tOrder!\n\n\tA beat.\n\n\t\t\t\tCOUNTER\n\t\tAyes to the right, three hundred and\n\t\tthirty, noes to the left, two hundred\n\t\tand sixty-five...\n\n\tBy the time he reaches \"sixty-five\" his voice is drowned in\n\tcheers from the Liberal benches.  DISRAELI and the rest of\n\tthe front bench sit in stony silence.\n\n\tSomewhere on the Liberal back benches, a wild-eyed\n\tmaverick, DILKE, rises to his feet shouting:\n\n\t\t\t\tDILKE\n\t\tMr Speaker, I table a motion in\n\t\tfurtherance of the Bill to\n\t\tDisestablish the Monarchy!\n\n\tA roar from the irate TORIES and chaos reigns again.\n\n\t\t\t\tSPEAKER\n\t\tOrder!  Order!!  ORDER!!!\n\n\tINT. THE HOUSES OF PARLIAMENT, LOBBY CORRIDOR - NIGHT\n\n\tAn hour later the house is empty except for a few\n\tstraggling MPs hurrying home.  An exhausted DISRAELI stands\n\tin the corridor with STANLEY.\n\n\t\t\t\tDISRAELI\n\t\tWe're going to lose.\n\n\t\t\t\tSTANLEY\n\t\tYou can't know that for sure.\n\n\t\t\t\tDISRAELI\n\t\tGladstone's got his party facing the\n\t\tsame way for the first time in years. \n\t\tWe need help.\n\t\t\t(long beat)\n\t\tWhere is the old girl?\n\n\t\t\t\tSTANLEY\n\t\tWho?\n\n\t\t\t\tDISRAELI\n\t\tMrs Brown.\n\n\t\t\t\tSTANLEY\n\t\tIt's questionable whether there's any\n\t\tadvantage to be had from that\n\t\tdirection.  She's never been less\n\t\tpopular.\n\n\t\t\t\tDISRAELI\n\t\tIn the press, perhaps.\n\t\t\t(holding up Punch)\n\t\tBut she's sold more copies of her\n\t\tHighland Journal in three months than\n\t\tPunch will ever sell in a year.  Time\n\t\tto wheel her out.\n\n\t\t\t\tSTANLEY\n\t\tShe's refusing to leave Balmoral.\n\n\t\t\t\tDISRAELI\n\t\tWhat's her excuse this time?\n\n\t\t\t\tSTANLEY\n\t\tThe Princess Louisa is too ill to\n\t\tmove.  Frankly, the Queen's rather\n\t\tupset at the recent spate of bad\n\t\tpublicity.\n\t\t\t(beat)\n\t\tYou're smiling.\n\n\t\t\t\tDISRAELI\n\t\tI was trying to imagine \"rather\n\t\tupset.\"\n\n\tThe elderly prelate, DEAN WELLSELLY, hurries in through the\n\tlobby doors.  DISRAELI puts on a welcoming smile.\n\n\t\t\t\tDEAN WELLSELLY\n\t\tForgive me, gentlemen.  I'm late.\n\n\t\t\t\tDISRAELI\n\t\tNot at all, Dean.  Good of you to\n\t\tspare the time.\n\n\t\t\t\tDEAN WELLSELLY\n\t\tI came as quickly as I could.\n\n\t\t\t\tDISRAELI\n\t\tYou've seen the latest cartoon in\n\t\tPunch, I take it?\n\n\t\t\t\tDEAN WELLSELLY\n\t\t\t(completely lost)\n\t\tI beg your pardon?\n\n\tDISRAELI opens the copy of Punch and hands it to Dean\n\tWellselly.  The Dean clears his throat and starts to read.\n\n\t\t\t\tDISRAELI\n\t\t\t(as Wellselly reads)\n\t\tOne of our madder brethren in the\n\t\thouse was calling for disestablishment\n\t\tof the monarchy.\n\n\tDean Wellselly looks up from the article, horrified.\n\n\t\t\t\tDEAN WELLSELLY\n\t\tGood Lord.\n\n\t\t\t\tSTANLEY\n\t\t\t(playing the soft glove)\n\t\tI'm sure it won't come to that.\n\n\t\t\t\tDISRAELI\n\t\t\t(the hard glove)\n\t\tNo.  But it has now become a matter\n\t\tfor our consciences.\n\t\t\t(beat)\n\t\tI was just telling Stanley how vital\n\t\tit is that the nation should feel the\n\t\tvisible influence of the Sovereign. \n\t\tAs a reminder that Parliament, indeed\n\t\tmy own ministry, depends on the will\n\t\tof the Queen.\n\n\tDEAN WELLSELLY nods his head gravely.  Over his shoulder,\n\tSTANLEY is gaping at DISRAELI's silky distortion of the\n\tparty political maneuver into a moral imperative.\n\n\t\t\t\tDEAN WELLSELLY\n\t\tI couldn't agree with you more, but I\n\t\tam only Dean of Windsor.  I don't\n\t\tunderstand what ...\n\n\tDISRAELI interrupts.\n\n\t\t\t\tDISRAELI\n\t\tWe hear from Balmoral that Mr Brown is\n\t\tinteresting Her Majesty in some of the\n\t\tforms of worship associated with ...\n\t\tlow-church Presbyterian.\n\n\tSilence.  DEAN WELLSELLY'S face is a picture of\n\tunrestrained horror.  Low-church.  Presbyterian.\n\n\t\t\t\tDEAN WELLSELLY\n\t\tWhat can we do?\n\n\t\t\t\tDISRAELI\n\t\tOh, several things.\n\n\tINT. BALMORAL CASTLE, QUEEN'S DRAWING ROOM - DAY\n\n\tSome days later.\n\n\tQueen VICTORIA sits at her desk while Henry PONSONBY stands\n\tin front of her, holding a copy of The Times.\n\n\t\t\t\tVICTORIA\n\t\tRead it.\n\n\t\t\t\tPONSONBY\n\t\tAgain?\n\n\t\t\t\tVICTORIA\n\t\tRead it!\n\n\tPONSONBY coughs once and begins again.\n\n\t\t\t\tPONSONBY\n\t\t\"The Times wishes to join the rest of\n\t\tHer Majesty's loyal subjects in\n\t\texpressing its deep joy at the news\n\t\tthat the Queen is soon to come out of\n\t\ther mourning.\"\n\n\tVICTORIA glowers at him.\n\n\t\t\t\tVICTORIA\n\t\tWho told them that?\n\n\t\t\t\tPONSONBY\n\t\tI have no idea.\n\n\t\t\t\tVICTORIA\n\t\tWhy not?\n\n\t\t\t\tPONSONBY\n\t\tI -- forgive me, ma'am, I am no wiser\n\t\tthan yourself.\n\n\tSuddenly, VICTORIA's temper goes and she shouts at him.\n\n\t\t\t\tVICTORIA\n\t\tNo-one should think themselves wiser\n\t\tthan me!\n\t\t\t(beat)\n\t\tIt is not for any of the Queen's\n\t\tsubjects to presume to tell Her\n\t\tMajesty when and where She should come\n\t\tout of mourning.  It is the Queen's\n\t\tsorrow that keeps her secluded!  It is\n\t\tHer overwhelming amount of work and\n\t\tresponsibility, work which She feels\n\t\twill soon wear her out entirely!\n\n\t\t\t\tPONSONBY\n\t\tYour Majesty --\n\n\t\t\t\tVICTORIA\n\t\t\t(cutting right through him)\n\t\tIs it not enough that She is uncheered\n\t\tand unguided that she should also have\n\t\tto suffer these malicious rumors?!\n\t\t\t(a pause, more quietly)\n\t\tI am not a fool.\n\t\t\t(beat)\n\t\tI know there are those in the\n\t\testablishment too afraid to attack me\n\t\tand so they attack my dearest friends. \n\t\tSometimes -- I feel that Brown is all\n\t\tI have left of Albert.\n\t\t\t(beat)\n\t\tAnd now they attack Brown too.\n\n\tShe looks up, eyes blazing.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tI will not give him up to them.\n\n\tINT. BALMORAL CASTLE, ROOM ADJOINING DRAWING ROOM - DAY\n\n\tBROWN is guarding the door to the drawing room while the\n\tbalding BERTIE muscles up, eye ball to eye ball.\n\n\t\t\t\tBERTIE\n\t\tI wish to see my mother.\n\n\t\t\t\tBROWN\n\t\tShe's busy.\n\n\t\t\t\tBERTIE\n\t\tConvey her a message.\n\n\t\t\t\tBROWN\n\t\tShe's away to Windsor tomorrow.  Talk\n\t\tto her there.\n\n\t\t\t\tBERTIE\n\t\tTell her the Prince of Wales wishes to\n\t\tspeak with her urgently about matters\n\t\tconcerning the press.\n\n\t\t\t\tBROWN\n\t\tAre you deaf as well as stupid?\n\n\tA split-second.  BERTIE gapes at him.\n\n\t\t\t\tBERTIE\n\t\tWhat did you say?\n\n\t\t\t\tBROWN\n\t\tI said, are you deaf as well as\n\t\tstupid?\n\n\t\t\t\tBERTIE\n\t\tDo you know who you address, sir?\n\n\t\t\t\tBROWN\n\t\tWhom you address.\n\n\t\t\t\tBERTIE\n\t\tThe future King!\n\n\tA beat.\n\n\t\t\t\tBROWN\n\t\tWell, everyone's entitled to their\n\t\topinion.\n\n\t\t\t\tBERTIE\n\t\tOut of my way!\n\n\tFoolishly, BERTIE tries to barge his way past.  Suddenly\n\tBROWN loses it completely.  He grabs the Prince of Wales by\n\tthe shoulders and pins him back, shouting right into his\n\tface.\n\n\t\t\t\tBROWN\n\t\tLEAVE US ALONE, WHY DON'T YOU!!\n\n\tFor a split-second, BROWN's eyes flicker as he senses he\n\thas gone too far.  A look of pure venom in BERTIE'S face,\n\tthen ...\n\n\tEXT. WINDSOR CASTLE, QUADRANGLE - NIGHT\n\n\tWeeks later.\n\n\tIn a roar of hooves and wheels, the Royal Carriage sweeps\n\tinto the huge quadrangle.  JOHN BROWN stands rigid on the\n\tbox, glowering at all the world.\n\n\tCAPTION: \"WINDSOR\"\n\n\tINT. WINDSOR CASTLE, SERVANT'S CORRIDOR - NIGHT\n\n\tA pair of doors open out onto a torchlit driveway as a mass\n\tof SERVANTS rush in and out, ferrying bags an trunks.\n\n\tBROWN marches in, still charged-up from the strain of the\n\tjourney's watchfulness.  He spots an UNDER-PORTER snatching\n\ta break.\n\n\t\t\t\tBROWN\n\t\tYou!  What's your business here?!\n\n\t\t\t\tUNDER-PORTER\n\t\t\t(jumping to)\n\t\tUnder-porter, sir.\n\n\t\t\t\tBROWN\n\t\tWell, don't stand where you shouldn't!\n\n\tThe UNDER-PORTER scrambles up the stairs.  A few SERVANTS\n\texchange looks.  BROWN seems more determined than ever to\n\texert his control.\n\n\tEXT. WINDSOR CASTLE, STABLES - NIGHT\n\n\tThat night.\n\n\tCarrying an old storm lamp high over his head, BROWN walks\n\ttowards the stables.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE - DAY\n\n\tThe next day.\n\n\tBROWN is on horseback, riding with VICTORIA through the\n\tgrounds.  He is still jumpy, eyes flicking left and right,\n\tsearching for intruders.  They are being followed at a\n\tdistance by two EQUERRIES on horseback.  VICTORIA frowns\n\tpeevishly.\n\n\t\t\t\tVICTORIA\n\t\tMust they always follow us?\n\n\t\t\t\tBROWN\n\t\tI ordered it.  It's for your own\n\t\tsafety.\n\n\t\t\t\tVICTORIA\n\t\tDear me, you'll be telling me to watch\n\t\twhat I eat next.\n\n\tBROWN doesn't react.  A beat.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tAm I not safe enough with you, John?\n\n\t\t\t\tBROWN\n\t\tAye.\n\t\t\t(looking away)\n\t\tBut there are Fenians reported on the\n\t\tmainland.\n\n\t\t\t\tVICTORIA\n\t\t\t(tutting irritably)\n\t\tThe threat from the Irish is greatly\n\t\texaggerated, I'm sure.\n\n\t\t\t\tBROWN\n\t\t\t(snapping back)\n\t\tI'll decide when it's exaggerated.\n\n\tBROWN chucks his horse on, bringing a firm halt to the\n\tconversation.  A beat.  He pulls up suddenly, staring at\n\tthe shadows in the copse.\n\n\t\t\t\tVICTORIA\n\t\tIs anything the matter, John?\n\t\t\t(beat)\n\t\tJohn?\n\n\tHe stares for along moment and then lets it go.\n\n\t\t\t\tBROWN\n\t\tNothing's the matter.\n\n\tINT. WINDSOR CASTLE, STABLES - NIGHT\n\n\tBROWN marches down the line of horse boxes.  A stable-lad,\n\tBARNEY, is feeding the horses.  He looks twitchy.\n\n\t\t\t\tBROWN\n\t\tHey, Barney.\n\n\t\t\t\tBARNEY\n\t\tMr Brown, sir --\n\n\t\t\t\tBROWN\n\t\tIt's cold out there tonight, Barney.\n\n\tReaching his pony, BROWN stops and smiles.  The animal\n\tlifts its face to him and he softly strokes his muzzle.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tYeah, there's a good girl.\n\t\t\t(to Barney)\n\t\tHave you had a look at this hoof?  She\n\t\twas limping badly.  I think there\n\t\tmight be a stone in it.\n\n\t\t\t\tBARNEY\n\t\tYeah, yeah, I did.\n\n\t\t\t\tBROWN\n\t\tGood man.  And is she all right?\n\n\t\t\t\tBARNEY\n\t\tYeah.\n\n\t\t\t\tBROWN\n\t\tGood.  She's a good girl.  Aren't you? \n\t\tYeah, she's a lovely girl.  And you\n\t\tknow the Queen's riding tomorrow?\n\n\t\t\t\tBARNEY\n\t\tYeah.\n\n\t\t\t\tBROWN\n\t\t\t(beat)\n\t\tAre you all right, Barney?\n\n\tBARNEY twitches again and BROWN realizes too late.  The\n\tsplit-second he turns, he sees THREE MEN.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tOh, aye...\n\n\tThe MEN pile onto him and he collapses under their weight.\n\n\tAs he falls, BROWN manages to yank himself round, bang up a\n\tfist and fling the others off him.  But the FIRST MAN is up\n\tagain, twisting an arm round his neck and tugging him back. \n\tThe others grapple his arms down, but BROWN is incredibly\n\tstrong.  Even now, grunting and scrabbling, he makes them\n\tfight to force him back.  BARNEY stands transfixed in\n\thorror.\n\n\tDumping BROWN against the wall, the men step back and start\n\tkicking the shit out of him.  BROWN curls into a ball, jaw\n\tlocked, hands over his head.  Not a sound.\n\n\tFinally, they back off, panting hard.  The FIRST MAN pulls\n\tout a bottle of whiskey, yanks back BROWN's head and forces\n\twhiskey down his throat.  It spills over his face and\n\tdribbles down his neck.\n\n\tINT. WINDSOR CASTLE, QUEEN'S SITTING ROOM - DAY\n\n\tThe next day.\n\n\tVICTORIA is standing at the windows.  The door opens and\n\tLADY ELY walks in.\n\n\t\t\t\tVICTORIA\n\t\tWell?\n\n\t\t\t\tLADY ELY\n\t\tMr Brown is unable to attend today.\n\n\t\t\t\tVICTORIA\n\t\tWhy?\n\n\t\t\t\tLADY ELY\n\t\tI believe he is unwell, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tUnwell?\n\n\t\t\t\tLADY ELY\n\t\tI understand he was in a fight.\n\n\t\t\t\tVICTORIA\n\t\tHas he been hurt?\n\n\t\t\t\tLADY ELY\n\t\tI believe not, ma'am.  I understand --\n\t\the'd had rather too much to drink.\n\n\tVICTORIA walks away and steps behind her desk.\n\n\t\t\t\tVICTORIA\n\t\tYou may go.\n\n\tLADY ELY bows and walks out.  VICTORIA stares at the desk a\n\tmoment, then picks up her pen and tries to work.  She\n\tcannot.\n\n\tINT. WINDSOR CASTLE, BROWN'S QUARTERS - DAY\n\n\tBROWN sits on the edge of the bed in only his\n\tundergarments.  His face, arms, legs and fingers are livid\n\twith bruises, but he sits there, stiff-backed and gritting\n\this teeth, while ARCHIE crouches in front of him, tending\n\tto his wounds.\n\n\t\t\t\tBROWN\n\t\tAnd she sent no word down?\n\n\t\t\t\tARCHIE\n\t\tThey said you were drunk.\n\t\t\t(beat)\n\t\tWhy don't you tell her the truth?\n\n\t\t\t\tBROWN\n\t\tShe'll think it's her fault for\n\t\tkeeping me.\n\n\tARCHIE completes one of the dressings when BROWN suddenly\n\treaches back and starts trying to put on his shirt.\n\n\t\t\t\tARCHIE\n\t\tWhat are you doing?!\n\n\t\t\t\tBROWN\n\t\tI'm getting dressed.\n\n\t\t\t\tARCHIE\n\t\tYou've got three broken ribs, man!\n\n\t\t\t\tBROWN\n\t\tI've got my duties to attend to.\n\n\t\t\t\tARCHIE\n\t\tDon't be an idiot!  You're in no fit\n\t\tstate to go anywhere.\n\n\t\t\t\tBROWN\n\t\tShe'll be worried about me.\n\n\t\t\t\tARCHIE\n\t\tShe'll get over it.\n\n\t\t\t\tBROWN\n\t\tI can't let her down now, Archie.\n\n\t\t\t\tARCHIE\n\t\tAnd when was the last time she put\n\t\therself out for you?  Look, John,\n\t\twhatever she says to you now, in the\n\t\tend you're still a servant.\n\n\t\t\t\tBROWN\n\t\tOh, I'm much more than that.\n\n\t\t\t\tARCHIE\n\t\tAye, she may say that to you, but the\n\t\twoman can say what she wants.\n\n\t\t\t\tBROWN\n\t\tYou watch your tongue.\n\n\t\t\t\tARCHIE\n\t\tCome on, man, I'm telling you what you\n\t\talready know.\n\n\t\t\t\tBROWN\n\t\tYou know nothing about her!\n\n\t\t\t\tARCHIE\n\t\tWhen are you gonna see it, John?  She\n\t\tdoesn't give a damn about you.\n\n\tBROWN lunges for the bedside drawer and pulls out a card\n\tshowing a coy picture of a pretty woman.  He holds it up,\n\teyes blazing.\n\n\t\t\t\tBROWN\n\t\tFrom the Queen!\n\n\tHe reads out the inscription.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tMy lips may give a message better of\n\t\tChristmas love than e'en this letter.\n\t\t\t(beat)\n\t\tTo my best friend, J.B. from his best\n\t\tfriend, V.R.\n\t\t\t(he thrusts it in his\n\t\t\t brother's face)\n\t\tBest friend!\n\n\t\t\t\tARCHIE\n\t\tAye.\n\n\t\t\t\tBROWN\n\t\tShe means it.\n\n\tARCHIE stares at him.\n\n\t\t\t\tARCHIE\n\t\tShe'll drop you.  When she's done with\n\t\tyou, she'll drop you.\n\n\t\t\t\tBROWN\n\t\tGet out.\n\t\t\t(beat)\n\t\tOut!\n\n\tARCHIE steps back but BROWN roars at him.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tOUT!!\n\n\tARCHIE steps outside and BROWN is left alone.\n\n\tINT. WINDSOR CASTLE, QUEEN'S SITTING ROOM - DAY\n\n\tThe next day.  VICTORIA sits at her desk.  PONSONBY hands\n\ther letters to sign.\n\n\t\t\t\tPONSONBY\n\t\t... to be followed by a visit from\n\t\tLady Bridport.  She is keen to secure\n\t\ta place for her niece as Maid of\n\t\tHonor.\n\n\tVICTORIA signs the last letter and sits back.\n\n\t\t\t\tVICTORIA\n\t\tI am tired.\n\n\tPONSONBY coughs.\n\n\t\t\t\tPONSONBY\n\t\tThere is one other matter.\n\n\t\t\t\tVICTORIA\n\t\tWhat is it?\n\n\t\t\t\tPONSONBY\n\t\tI have a letter, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tFrom whom?\n\n\t\t\t\tPONSONBY\n\t\tFrom Princess Helena and other members\n\t\tof your family.\n\n\t\t\t\tVICTORIA\n\t\t\t(stiffening defensively)\n\t\tMy family is quite capable of\n\t\tcommunicating with the Queen in\n\t\tperson.\n\n\tPONSONBY does not reply.  Finally, VICTORIA is obliged to\n\task.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tWhat do they want?\n\n\t\t\t\tPONSONBY\n\t\tThey are demanding the dismissal of\n\t\tJohn Brown on grounds of drunkeness.\n\n\tVICTORIA stares through the window, expressionless.\n\n\tINT. WINDSOR CASTLE, CHAPEL - DAY\n\n\tVICTORIA walks through the ornate chapel, nervously\n\tfingering her handkerchief.  Waiting for her, smiling\n\tsoftly, is the Dean of Windsor, DEAN WELLSELLY.\n\n\t\t\t\tDEAN WELLSELLY\n\t\tYou wished to see me, ma'am?\n\n\tShe holds his eyes for a moment, then nods.\n\n\tINT. WINDSOR CASTLE, CHAPEL - DAY\n\n\tA few minutes later, VICTORIA and DEAN WELLSELLY are seated\n\tin a corner of the chapel, talking softly.  She cannot\n\tbring herself to look at him and so does not notice how\n\tcarefully he is watching her throughout the interview. \n\tThis is incredibly hard for her to say, but she struggles\n\tto be as honest as possible.\n\n\t\t\t\tVICTORIA\n\t\tMy husband tried always to make me\n\t\tthink more subtly.  Of course he\n\t\ttaught me so much and I can never\n\t\trepay my debt to him, or the love I\n\t\tfeel, even now.  But, in truth, I\n\t\tthink I am someone who can only feel\n\t\tthings while they are alive to me. \n\t\tFor that reason, I know I do not have\n\t\ta subtle mind.  I know that.  But I\n\t\twork hard and I try to do my duty.\n\t\t\t(she hesitates; she is\n\t\t\t struggling now)\n\t\tHowever, I have noticed of late that\n\t\tmy feelings of grief are not so strong\n\t\tand -- that I find myself leaning more\n\t\tupon the comfort of living friends.\n\t\t\t(beat)\n\t\tFriends close to me now.\n\n\tShe stops herself.  She is crying.  DEAN WELLSELLY watches\n\ther a moment, then speaks close, choosing his words\n\tcarefully.\n\n\t\t\t\tDEAN WELLSELLY\n\t\tYour Majesty, a settled resignation is\n\t\tmore lasting proof of affection than\n\t\tactive grief.  If the good Lord sees\n\t\tfit to bring one into contact with\n\t\tcongenial fellow beings, one should\n\t\tnot analyze one's reaction too deeply. \n\t\tTo allow oneself to be comforted by\n\t\tsomeone else need not imply any\n\t\tdisloyalty to the memory of the loved\n\t\tone.\n\n\tSilence.  VICTORIA stares into the long, dark chapel. \n\tGradually, as she takes in the tone of his remarks, her\n\tdisappointment turns to anger.\n\n\tINT. WINDSOR CASTLE, QUEEN'S SITTING ROOM - DAY\n\n\tThe next day, VICTORIA stands at the far window and her\n\tback to the room.  Lined up against the wall are BERTIE and\n\this siblings.\n\n\t\t\t\tVICTORIA\n\t\tSir Henry.\n\n\tPONSONBY steps forward.\n\n\t\t\t\tPONSONBY\n\t\tMa'am?\n\n\t\t\t\tVICTORIA\n\t\tPlease tell the Princess, and other\n\t\tsignatories to this letter, that the\n\t\tQueen will not be dictated to, or made\n\t\tto alter, in any way, what she has\n\t\tfound to answer for her comfort.\n\t\t\t(beat)\n\t\tDo I make myself clear?\n\n\t\t\t\tPONSONBY\n\t\tMa'am.\n\n\tA beat.\n\n\t\t\t\tVICTORIA\n\t\tYou may go.\n\n\tThey all file out.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE - DAY\n\n\tA few days later.\n\n\tBROWN and VICTORIA are riding on horseback.  Although\n\tbetter than he was, BROWN'S face is still badly bruised. \n\tThey turn a corner banked by trees.  BROWN is watching the\n\tQUEEN closely.  She stops.\n\n\t\t\t\tVICTORIA\n\t\tI would like to get down.\n\n\tWithout a word, BROWN dismounts and helps her off her\n\thorse.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tJohn?\n\n\t\t\t\tBROWN\n\t\tYes, ma'am?\n\n\t\t\t\tVICTORIA\n\t\tI was told you were in a fight.\n\n\t\t\t\tBROWN\n\t\tYes, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tHas someone seen to those bruises?\n\n\t\t\t\tBROWN\n\t\tYes, ma'am.\n\n\tA beat.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tMa'am?\n\n\t\t\t\tVICTORIA\n\t\tYes?\n\n\t\t\t\tBROWN\n\t\tHaving considered my position here at\n\t\tcourt, I have come to the conclusion\n\t\tthat it is in the best interest of\n\t\tYour Majesty that I should resign.\n\n\t\t\t\tVICTORIA\n\t\tI do not accept.\n\n\tA beat.\n\n\t\t\t\tBROWN\n\t\tI had foreseen that you would not. \n\t\tBut Your Majesty should understand --\n\t\tthat my mind will not be changed in\n\t\tthis.  I leave for Deeside --\n\n\t\t\t\tVICTORIA\n\t\t\t(cutting in)\n\t\tThe Queen forbids it.\n\t\t\t(beat)\n\t\tI cannot allow it because I cannot\n\t\tlive without you.  Without you, I\n\t\tcannot find the strength to be who I\n\t\tmust be.  Please.\n\n\tShe takes his hand to her mouth and kisses it gently, then\n\tlooks at him, utterly helpless.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tPromise me you won't let them send me\n\t\tback.\n\n\tA long silence.  BROWN holds her hand tight.\n\n\t\t\t\tBROWN\n\t\tI promise.\n\n\t\t\t\t\t\tFADE TO BLACK.\n\n\tCAPTION: \"1868\"\n\n\t\t\t\t\t\tFADE IN:\n\n\tEXT. LOWLANDS - DAY\n\n\tA few weeks later.\n\n\tA tiny horse-drawn carriage creeps across a huge Highland\n\tlandscape.\n\n\t\t\t\tDISRAELI (V.O.)\n\t\tYesterday, Gladstone talked for three\n\t\thours on the Irish Church Bill ... I\n\t\tam as guilty as the rest of\n\t\tunderestimating his reforming zeal.\n\t\tTory days may be numbered, but I fancy\n\t\tthere yet remains one last hope of\n\t\tdeliverance.  Wheresoever the blame\n\t\tlies, we must now close ranks and\n\t\tdefend Mrs Brown's England.  As for my\n\t\tinterminable journey to the land of\n\t\tCalvin, oatcakes and sulphur ...\n\n\tEXT. BALMORAL CASTLE - DAY\n\n\tDISRAELI hurries through the pouring rain.\n\n\t\t\t\tDISRAELI (O.S.)\n\t\t... no Prime Minister made greater\n\t\tsacrifice than attempting to run the\n\t\tcountry six hundred miles north of\n\t\tcivilization.\n\n\tReaching the castle, he hurries inside and the great doors\n\tbang behind him.\n\n\tINT. BALMORAL CASTLE, QUEEN'S DRAWING ROOM - DAY\n\n\tThe next day.\n\n\tQUEEN VICTORIA is playing the piano like she walks, with\n\tgreat vim and vigor.  The tune is some quaint Scottish\n\tballad which she belts out in her clear strong voice,\n\talmost drowning out PRINCE ARTHUR, PRINCE LOUISE and PRINCE\n\tLEOPOLD who are meant to be accompanying her.  They stand\n\tin a nervous semi-circle, fumbling their harmonies. \n\tIgnoring them completely, VICTORIA bobs up her head with a\n\tquizzical smile to make sure she is being appreciated.\n\n\tDISRAELI and the rest of the HOUSEHOLD stand a few yards\n\toff, smiling rigidly.  DISRAELI, the consummate politician\n\tto his inch-high insteps, out-smiles the lot of them.  This\n\tman is in raptures of delight.  And the more liquid his\n\tsmiles, the happier he makes VICTORIA.  He beams, she\n\tbelts, until her children are drowned out completely.\n\n\tAnd then, with characteristic suddenness, VICTORIA stops\n\tplaying and launches into one of her tirades.  The\n\tHOUSEHOLD wobbles in shock like children on a switch-back,\n\tbut DISRAELI glides smoothly from delight to sober concern.\n\n\t\t\t\tVICTORIA\n\t\tHow dare the Irish break with the\n\t\tAnglicans? \n\t\tIf Albert were alive today he would\n\t\tnever allow the Crown to give up\n\t\tChurch patronage.  No, the Irish must\n\t\tbe told, very firmly, to stay exactly\n\t\twhere they are.  It is the thin edge\n\t\tof the wedge, Mr Disraeli.  Next, you\n\t\twill be telling me that the Crown no\n\t\tlonger governs this nation.\n\n\tA beat. A nervous silence in the Household.\n\n\t\t\t\tDISRAELI\n\t\tYour Majesty remains at the very\n\t\tepicenter of governance.  As for your\n\t\tpeople, look no further than the sales\n\t\tof your Highland Journals to see in\n\t\twhat affection the nation holds their\n\t\tQueen.\n\t\t\t(beat)\n\t\tYou sell even more copies than Mr\n\t\tDickens.\n\n\t\t\t\tVICTORIA\n\t\tBut I lack your prose, Mr Disraeli.\n\n\tVICTORIA gives him a tiny smile.  DISRAELI acknowledges it,\n\tthen steers the conversation back.\n\n\t\t\t\tDISRAELI\n\t\tOf course I understand your concern. \n\t\tYou miss your people.\n\t\t\t(a pause)\n\t\tAnd they miss you.\n\n\tVICTORIA registers a slight flicker of defensiveness at the\n\timplied criticism.\n\n\t\t\t\tVICTORIA\n\t\tThen they may read about me.\n\n\t\t\t\tDISRAELI\n\t\tIndeed, and for that they are\n\t\teternally grateful.\n\n\t\t\t\tVICTORIA\n\t\tIs that not enough?\n\n\t\t\t\tDISRAELI\n\t\tIn so many ways ... and yet it is your\n\t\tpresence they crave.  A figurehead.\n\n\tVICTORIA has the measure of him.\n\n\t\t\t\tVICTORIA\n\t\tI never thought to be bullied by you,\n\t\tMr Disraeli.  You, I thought,\n\t\tunderstood a widow's grief.\n\n\t\t\t\tDISRAELI\n\t\tForgive me, ma'am, I cannot speak for\n\t\tthe nation, only for myself.  As Prime\n\t\tMinister I confess I miss your\n\t\tpresence, but that is only an\n\t\texpression of my own selfish desires\n\t\tand I should not burden you with it.\n\n\tThe Household waits.  Has he clawed himself back?  VICTORIA\n\tacknowledges his apology.  Her voice drops and she talks\n\tdirectly to DISRAELI, straight from the heart.\n\n\t\t\t\tVICTORIA\n\t\tI stay here because I am happy.\n\t\t\t(beat)\n\t\tIs that such a terrible crime?\n\n\t\t\t\tDISRAELI\n\t\tNo, ma'am.\n\n\tAt this moment the far door opens and BROWN walks in.\n\n\t\t\t\tBROWN\n\t\tTime for your walk.\n\n\tWithout a word, VICTORIA rises from her chair and starts\n\tfollowing him out.  As they pass DISRAELI, she stops.\n\n\t\t\t\tVICTORIA\n\t\tThis is my good John Brown.\n\n\t\t\t\tDISRAELI\n\t\t\t(taking him in)\n\t\tYes.\n\n\t\t\t\tVICTORIA\n\t\tI have asked him to show you a little\n\t\tof Highland life while you are with us\n\t\tat Balmoral.\n\n\tBROWN measures DISRAELI suspiciously.\n\n\t\t\t\tBROWN\n\t\tWhat brings you here?\n\n\t\t\t\tDISRAELI\n\t\tA man can refuse only so many\n\t\tinvitations from his Queen.  It was\n\t\tremiss of me not to come earlier.\n\n\tVICTORIA smiles.  BROWN stares.\n\n\t\t\t\tBROWN\n\t\tWhat do you know about the Highlands?\n\n\t\t\t\tDISRAELI\n\t\tI am a blank sheet.\n\n\t\t\t\tBROWN\n\t\tDo you hunt?\n\n\t\t\t\tDISRAELI\n\t\tOccasionally.\n\n\t\t\t\tBROWN\n\t\tDare say you can be taught.\n\n\t\t\t\tDISRAELI\n\t\tTo shoot perhaps, but not to kill.\n\n\t\t\t\tBROWN\n\t\tIf you hunt, you kill.\n\n\tDISRAELI counters effortlessly.\n\n\t\t\t\tDISRAELI\n\t\tWell then, I'll do my best.\n\n\tEXT. HIGHLANDS, GLEN GELDER - DAY\n\n\tStaying close to the ground we develop through a series of\n\tshots showing the other highlands -- sheet rain against\n\theather and gorse, rivulets of water slashing through mud,\n\tcrude pathways sliding in wind and all ball-breakingly\n\tcold.\n\n\tComing up the hill, we begin to make out a hunting party. \n\tThe sound first.  Like a small army, crashing their way up\n\tthe winding path.  GHILLIES urging on their horses and\n\tdogs, guns and equipment jangling off pony-hacks an then\n\tthe tall figure of JOHN BROWN striding out in front.\n\n\tMaking no concession to anyone, he force-marches them up\n\tthe hill, eyes on the hunt ahead. Behind them trot the men\n\ton horseback -- DISRAELI, PONSONBY, BERTIE and other\n\tGENTLEMEN, each led by GHILLIES and ATTENDANTS, among them\n\tARCHIE.\n\n\tSuddenly, BROWN stops and raises a hand.  The party halts.\n\n\tHe listens for a second.  Satisfied that he has found his\n\tquarry, he brings his hand down and the party of gentlemen\n\tdismount as quietly as they can.\n\n\tAs he waits, BROWN winces slightly from the pain in his\n\tside.  He pulls a flask of whiskey from his sporran and\n\tdrinks.  All the time, DISRAELI keeps his eyes on BROWN.\n\n\tEXT. HIGHLANDS, GLEN GELDER - DAY\n\n\tThe stalking.\n\n\tEveryone is now fanned out along the hillside, a ghillie to\n\teach gentleman, slowly and silently moving up the hill.\n\n\tDISRAELI stalks with BROWN, panting hard to keep up, eyes\n\ton his man, trying to make no sound.\n\n\tSuddenly, BROWN stops.  Very slowly he rises.  DISRAELI\n\trides alongside and sees ...\n\n\tA huge stag staring majestically across the hillside.\n\n\tKeeping his movements smooth and slow, BROWN brings up his\n\trifle, cocks it and offers DISRAELI the kill.  With a\n\tdeferential gesture of the hands, DISRAELI declines.  BROWN\n\tstares at him a split-second, raises the rifle to his\n\tshoulder and fires.\n\n\tEXT. HIGHLANDS, GLEN GELDER - DAY\n\n\tThe kill.\n\n\tA rapid montage of guns firing, as we cut to ...\n\n\tINT. BALMORAL CASTLE - DAY\n\n\tBROWN sweeps in from the hunt, DISRAELI dripping at his\n\tside.\n\n\t\t\t\tBROWN\n\t\t\t(demonstrating with his\n\t\t\t rifle)\n\t\tAlways remember, you keep it tight to\n\t\tyour shoulder, you absorb the kick. \n\t\tAim for the head.  Then imagine it's\n\t\tGladstone.\n\n\t\t\t\tDISRAELI\n\t\t\t(smiling)\n\t\tQuite.\n\n\tBROWN pulls out his flask and offers some to DISRAELI, who\n\tdeclines.  He watches BROWN take a long swig.\n\n\tINT. BALMORAL CASTLE, UPPER SERVANT'S TABLE - NIGHT\n\n\tThat night.\n\n\tBROWN is standing at his place, drinking steadily.  He has\n\ta sheet of paper and a pen and is ticking off a list. \n\tLined up in front of him, trying desperately not to laugh,\n\tare five or six UPPER SERVANTS including the pretty\n\tASSISTANT DRESSER and BERTIE'S VALET.  They each step up,\n\tone at a time, to make their report.\n\n\t\t\t\tBROWN\n\t\t\t(ticking as he goes)\n\t\t... Back doors, West Wing.\n\n\t\t\t\tUPPER SERVANT 1\n\t\tChecked and locked, sir.\n\n\t\t\t\tBROWN\n\t\tSide doors, East Wing.\n\n\t\t\t\tASSISTANT DRESSER\n\t\tChecked and locked, sir.\n\n\t\t\t\tBROWN\n\t\tLouder, girl!\n\n\t\t\t\tASSISTANT DRESSER\n\t\t\t(creasing up)\n\t\tChecked and locked, sir.\n\n\t\t\t\tBROWN\n\t\tKitchen and lower house.\n\n\t\t\t\tBERTIE'S VALET\n\t\tChecked and locked, sir.\n\n\t\t\t\tBROWN\n\t\tBack and upper corridors.\n\n\t\t\t\tUPPER SERVANT 2\n\t\tChecked and locked, sir.\n\n\t\t\t\tBROWN\n\t\tFront door.\n\t\t\t(beat)\n\t\tChecked and locked.\n\n\tFolding up the paper, BROWN downs his glass of whiskey and\n\tsits.  On his nod, dinner is served by UNDER SERVANTS amid\n\ta clatter of cutlery and chat.\n\n\tARCHIE looks across at his brother but BROWN is hunched\n\tover his plate, pecking at his food.\n\n\tSomeone titters and ARCHIE looks up.  BERTIE'S VALET\n\tcoughs.  BROWN slowly lifts his head.  His eyes have the\n\tslightly unfocused look of too much drink.  It is clear to\n\tARCHIE that he is about to be sent-up.\n\n\t\t\t\tBERTIE'S VALET\n\t\t\t(with a smug smile)\n\t\tDid you see any Irish assassins today,\n\t\tMr Brown?\n\n\tBrown doesn't react.\n\n\t\t\t\tBERTIE'S VALET (CONT'D)\n\t\tWe heard the dogs were Fenian\n\t\tsympathizers.\n\n\tBrown drinks.\n\n\t\t\t\tBERTIE'S VALET (CONT'D)\n\t\tOr was it the stag ...?\n\n\tEveryone bursts out laughing.  Brown slams down his glass.\n\n\t\t\t\tBROWN\n\t\tThere's not a soul here cares about\n\t\tthat wee woman's safety except me! \n\t\tShe'd die in a ditch if I wasn't there\n\t\tto look out for her --\n\n\tHe stops.  ARCHIE has come across to his brother's chair\n\tand pulls gently on his arm.\n\n\tBROWN stares at the SERVANTS.  Everyone is about to burst\n\tout laughing.  Keeping his dignity, he pushes back his\n\tchair and lets ARCHIE lead him away.\n\n\tAs BROWN reaches the double doors, the laughter hits him in\n\tthe back like a wave. ARCHIE holds him steady.\n\n\tINT. BALMORAL CASTLE, BROWN'S QUARTERS - NIGHT\n\n\tBROWN is lying on a grubby bed.  ARCHIE is looking around\n\tthe untidy room.  For the first time, he notices a thick\n\tmanuscript on the table.  BROWN follows his eyes.\n\n\t\t\t\tARCHIE\n\t\tWhat's this?\n\n\t\t\t\tBROWN\n\t\tIt's a diary.\n\n\t\t\t\tARCHIE\n\t\tBe careful who sees it.\n\n\t\t\t\tBROWN\n\t\tWhat do you take me for?\n\n\tARCHIE turns back to BROWN.\n\n\t\t\t\tARCHIE\n\t\tYou should have someone look after\n\t\tyou.\n\n\t\t\t\tBROWN\n\t\tI'm all right.  I just need to rest up\n\t\ta wee bit.\n\t\t\t(feeling everything spin)\n\t\tThe room ... You don't have to stay.\n\n\tBROWN shuts his eyes and starts to drift.  ARCHIE watches\n\tover him.\n\n\t\t\t\tARCHIE\n\t\tThe place is a mess.\n\n\t\t\t\tBROWN\n\t\tI can't move to tidy.\n\n\t\t\t\tARCHIE\n\t\tIt's what the maids are for.\n\n\t\t\t\tBROWN\n\t\tI'm not having some prattler going\n\t\tthrough my things.\n\n\tA beat.\n\n\t\t\t\tARCHIE\n\t\tWon't you give yourself a rest, John? \n\t\tShe's other people to look out for\n\t\ther.\n\n\t\t\t\tBROWN\n\t\tShe needs me, Archie.  She canna do\n\t\twithout me, she said it to my face.\n\t\t\t(his hands come up to cover\n\t\t\t his eyes)\n\t\tHow can I stop now?\n\n\tINT. BALMORAL CASTLE, SERVANT'S CORRIDOR - DAY\n\n\tDawn the next morning.\n\n\tBROWN is scrambling into his jacket as he hurries down the\n\tstairs.\n\n\tEXT. BALMORAL CASTLE - DAY\n\n\tBROWN crashes out of a side-door -- just fully dressed --\n\tto be met by the smiling figure of DISRAELI.  He is got up\n\tin smart walking boots, plus-fours and a tweed jacket.\n\n\t\t\t\tBROWN\n\t\tYou sent for me.\n\n\t\t\t\tDISRAELI\n\t\tI've been called back to London.  My\n\t\tlast day.  I thought I might take a\n\t\twalk on Lochnagar.\n\n\tBROWN stares straight back.\n\n\tEXT. LOCHNAGER - DAY\n\n\tAn hour later, BROWN leads DISRAELI up the hill.  BROWN has\n\this head down, on with the job.  DISRAELI slows to a halt.\n\n\t\t\t\tDISRAELI\n\t\tPrinces and Lords are but the breath\n\t\tof kings, An honest man's the noblest\n\t\twork of God.\n\t\t\t(beat)\n\t\tYou must miss such magnificent views.\n\n\t\t\t\tBROWN\n\t\tI don't think about it.\n\n\tThey reach the top and continue along the high ground. \n\tDISRAELI glances at BROWN and notices the limp.\n\n\t\t\t\tDISRAELI\n\t\tForgive me, I've called you out and\n\t\tyou should have been resting.\n\n\t\t\t\tBROWN\n\t\tI'm fine.\n\n\t\t\t\tDISRAELI\n\t\tYou're injured.\n\n\t\t\t\tBROWN\n\t\tIt's nothing.\n\n\t\t\t\tDISRAELI\n\t\tStill, someone must attend you.  Your\n\t\twife should not have let you out.\n\n\t\t\t\tBROWN\n\t\tI'm not married.\n\n\t\t\t\tDISRAELI\n\t\t\t(deadpan)\n\t\tOh.\n\n\t\t\t\tBROWN\n\t\tThis is the top.\n\n\tDISRAELI admires the view for a moment, then continues.\n\n\t\t\t\tDISRAELI\n\t\tI confess, I sometimes feel as if I am\n\t\tnot married myself, I see my wife so\n\t\tlittle.  But I'm forgetting the\n\t\trewards.\n\n\tHe looks across.  BROWN keeps staring ahead.\n\n\t\t\t\tDISRAELI (CONT'D)\n\t\tThe look on their faces when one walks\n\t\tinto the room.  Still gives one a\n\t\tridiculous thrill.\n\n\t\t\t\tBROWN\n\t\tI wouldn't know.\n\n\t\t\t\tDISRAELI\n\t\tSurely --\n\n\t\t\t\tBROWN\n\t\t\t(interrupts)\n\t\tWhat I do, I do for my Queen.\n\n\t\t\t\tDISRAELI\n\t\tWas there never ambition?\n\n\t\t\t\tBROWN\n\t\t\t(beat)\n\t\tMaybe, once.\n\n\t\t\t\tDISRAELI\n\t\tThen I envy yo.\n\n\t\t\t\tBROWN\n\t\tWhy?\n\n\t\t\t\tDISRAELI\n\t\tTo have achieved one's ambition, or to\n\t\thave reconciled oneself to its limits,\n\t\tis a lifetime's work.\n\n\t\t\t\tBROWN\n\t\tI do what I do.\n\n\t\t\t\tDISRAELI\n\t\tFor Her Majesty.\n\n\t\t\t\tBROWN\n\t\tAye.\n\n\t\t\t\tDISRAELI\n\t\tBut yourself?\n\t\t\t(beat)\n\t\tWhat about John Brown?\n\n\t\t\t\tBROWN\n\t\tI said.\n\t\t\t(beat)\n\t\tI serve the Queen.\n\n\t\t\t\tDISRAELI\n\t\tNo other aspiration?\n\n\tBROWN stares for a long moment.  Finally he speaks.\n\n\t\t\t\tBROWN\n\t\tTo see her safe.\n\n\tDISRAELI steps a little closer.\n\n\t\t\t\tDISRAELI\n\t\tYou will not be unaware of the threat\n\t\tnow posed by Republicanism.\n\n\t\t\t\tBROWN\n\t\tWhy do you think I keep her here?\n\n\t\t\t\tDISRAELI\n\t\tAh, but therein lies the paradox.  It\n\t\tis her very isolation that encourages\n\t\tthe malcontents.  The longer she is\n\t\taway, the stronger they become; and\n\t\twho, honestly, can promise security\n\t\tagainst that?  However many doors you\n\t\tlock, someone will always get in. \n\t\tEven here.\n\n\tBROWN watches him, eyes alert.\n\n\t\t\t\tBROWN\n\t\tSo...?\n\n\t\t\t\tDISRAELI\n\t\tThe truth is, the Queen would be safer\n\t\tdoing her duty and returning south to\n\t\ther public.  John Bull loves her and\n\t\tJohn Bull is her best defense.\n\n\t\t\t\tBROWN\n\t\tHer mind is set.  She won't change\n\t\tnow.\n\n\t\t\t\tDISRAELI\n\t\tShe trusts you, John.\n\n\tDISRAELI is right on his shoulder now, like his own voice.\n\n\t\t\t\tBROWN\n\t\tThey don't see it.\n\n\t\t\t\tDISRAELI\n\t\tSee what?\n\n\t\t\t\tBROWN\n\t\tThe threat.\n\t\t\t(beat)\n\t\tI tell them, but they don't see it.\n\n\t\t\t\tDISRAELI\n\t\tThey aren't as watchful as you.\n\n\t\t\t\tBROWN\n\t\tToo busy looking after themselves.\n\n\t\t\t\tDISRAELI\n\t\tThe greasy pole.\n\n\t\t\t\tBROWN\n\t\tNo loyalty.\n\n\t\t\t\tDISRAELI\n\t\tNo love.\n\n\tSilence.  For a moment BROWN seems unaware that someone\n\telse has said that.\n\n\t\t\t\tBROWN\n\t\tI promised to protect her from people\n\t\tlike you.\n\n\t\t\t\tDISRAELI\n\t\tFor once in my life, I am not the\n\t\tissue.\n\n\t\t\t\tBROWN\n\t\tShe'll never understand it.\n\n\t\t\t\tDISRAELI\n\t\tIn time, she will.\n\n\t\t\t\tBROWN\n\t\tShe'll think I betrayed her.\n\n\t\t\t\tDISRAELI\n\t\tBut others will know that you acted\n\t\tfor the greater good.\n\n\tBROWN stares off into the distance.\n\n\tEXT. LOCH MUICK - DAY\n\n\tThe next day.\n\n\tBROWN is rowing VICTORIA across the loch.  The EQUERRIES\n\twait on the shore.\n\n\tVICTORIA trails her hand in the water, frowning at the\n\tsurface.  BROWN concentrates on the oars, slipping them\n\tcarefully through the water.  \n\n\t\t\t\tVICTORIA\n\t\tI received a letter today from Mr\n\t\tDisraeli.  Parliament is calling for\n\t\tmy return to public duties.\n\t\t\t(beat)\n\t\tWhy won't they let us be?\n\n\tBROWN does not answer.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tHe insists that the country expects me\n\t\tto preside over the opening of the new\n\t\tsession.  I refuse to offer sustenance\n\t\tto enable his weakening grip. \n\t\tBesides, you know how much I should\n\t\thate it.  It frightens me.\n\n\tShe notices that BROWN has said nothing.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tJohn?\n\n\tBROWN does not look at her.  Finally:\n\n\t\t\t\tBROWN\n\t\tWe can't always have what we wish.\n\n\tVICTORIA stares at him.\n\n\tINT. BALMORAL CASTLE, QUEEN'S DRAWING ROOM - DAY\n\n\tLater that day.\n\n\tVICTORIA and BROWN are in the middle of a blazing row in\n\tfront of the entire Household, including PONSONBY, JENNER\n\tand LADY ELY.\n\n\t\t\t\tVICTORIA\n\t\tDuty?!  You talk about duty?!\n\n\t\t\t\tBROWN\n\t\tIf duty and safety are served by the\n\t\tsame end then, aye, I do.\n\n\t\t\t\tVICTORIA\n\t\tI cannot believe you are saying this? \n\t\tYou, who I have relied on all this\n\t\ttime --\n\n\t\t\t\tBROWN\n\t\t\t(cutting in)\n\t\tHave I ever let you down before--?\n\n\t\t\t\tVICTORIA\n\t\t\t(as if he had not spoken)\n\t\t-- You stand there and tell me it is\n\t\tmy duty ... after all you promised me!\n\n\t\t\t\tBROWN\n\t\tI'm breaking no promises!\n\n\t\t\t\tVICTORIA\n\t\tYou are forcing me to do the very\n\t\tthing you know I fear most!\n\n\t\t\t\tBROWN\n\t\tFor god's sake, woman, I'm just trying\n\t\tto keep you safe!\n\n\t\t\t\tVICTORIA\n\t\tI will not hear any more about my\n\t\tsafety!!  You made me a promise and\n\t\tnow you have broken it!\n\n\tBROWN rounds on her, deeply wounded.\n\n\t\t\t\tBROWN\n\t\t-- When I took you out riding, come\n\t\train or shine, because I knew it was\n\t\tright for you, when I kept the bairns\n\t\toff your back so you could have a bit\n\t\tof peace, when I saw you safe from\n\t\thome to home and you didn't even know\n\t\tI was there...!  All I've ever thought\n\t\tabout is you!\n\n\t\t\t\tVICTORIA\n\t\tThen why send me back to them?!\n\n\t\t\t\tBROWN\n\t\tBecause I have to!\n\t\t\t(pause\n\t\tWill you no listen to me, woman?\n\n\tFace turned from him, VICTORIA replies in a brittle voice.\n\n\t\t\t\tVICTORIA\n\t\tDo not presume to talk to your Queen\n\t\tin that manner.\n\n\tA long silence.  BROWN watches her, but she will not look\n\tat him again.  Finally, she walks very slowly across the\n\troom.  She turns in the doorway, her voice faltering\n\tslightly.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tDoctor Jenner, I feel unwell.  I shall\n\t\tretire to my chamber.  Please attend\n\t\tme presently.\n\n\tAs the door slams, we ...\n\n\t\t\t\t\t\tFADE TO BLACK.\n\n\tCAPTION: \"NOVEMBER\"\n\n\t\t\t\t\t\tFADE IN:\n\n\tINT. BALMORAL CASTLE, DINING ROOM - DAY\n\n\tA few weeks later.\n\n\tClose on a door as it opens.  The ROYAL FAMILY are eating\n\tlunch with members of the UPPER HOUSEHOLD.  VICTORIA walks\n\tin with LADY ELY.\n\n\tA great scraping of chairs as everyone drops their forks\n\tand stands.  Clearly, they were not expecting her.  In\n\tsilence, VICTORIA steps up and takes her place at the head\n\tof the table.\n\n\tAt last, PONSONBY leans forward deferentially.\n\n\t\t\t\tPONSONBY\n\t\tMay I say, how glad I am to see Your\n\t\tMajesty so much recovered.\n\n\tVICTORIA nods, then turns and looks about at the others. \n\tPRINCESS ALEXANDRA is seated at the far end of the table. \n\tVICTORIA frowns.\n\n\t\t\t\tVICTORIA\n\t\tWhere is my son?\n\n\t\t\t\tPRINCESS ALEXANDRA\n\t\tPrince Albert is at Windsor, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tWhy is he not here?\n\n\t\t\t\tPRINCESS ALEXANDRA\n\t\tHe is sick, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tThen why are you not with him?\n\n\t\t\t\tPRINCESS ALEXANDRA\n\t\tYou ordered all members of the Royal\n\t\tFamily to attend you at Balmoral.\n\n\t\t\t\tVICTORIA\n\t\tWhat is the matter with him?\n\n\t\t\t\tPRINCESS ALEXANDRA\n\t\tHe has typhoid fever, ma'am.\n\n\tVICTORIA stares blankly at DOCTOR JENNER.\n\n\t\t\t\tVICTORIA\n\t\tNo.  You are mistaken.  Prince Albert,\n\t\tmy husband, had typhoid fever.  I\n\t\tasked what was wrong with my son.\n\n\t\t\t\tJENNER\n\t\tThe same, your Majesty.\n\n\tVICTORIA stops.  She stares down the length of the table. \n\tA long pause.\n\n\t\t\t\tVICTORIA\n\t\tWhy was I not informed?\n\n\t\t\t\tJENNER\n\t\tI did not consider it wise, in the\n\t\tcircumstances, to tax your nerves.\n\n\t\t\t\tVICTORIA\n\t\tHow ill is he?\n\n\tNo answer.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\t\t(to Alexandra)\n\t\tAlex?\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tHe is not well, ma'am.\n\n\tA beat.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tI must go to him.\n\n\tSuddenly, VICTORIA stands.  Chairs bang back as everyone\n\tleaps to their feet.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tWe must leave at once.\n\n\tAbruptly, VICTORIA turns for the door and the room erupts\n\tinto activity.\n\n\tINT. BALMORAL CASTLE, CORRIDOR - DAY\n\n\tBROWN stands in the corridor, a little nonplussed by the\n\tservants and Householders hurrying about in every\n\tdirection.\n\n\tEXT. BALMORAL CASTLE - DAY\n\n\tHalf an hour later, BROWN races up to the Queen's carriage\n\tamid a swarm of servants, ladies' maids and Householders\n\trushing to be ready in time.\n\n\tSuddenly the huge castle doors open and VICTORIA bustles\n\tout with her entourage in tow.  BROWN -- only just in time \n\t- yanks open the door for VICTORIA to step past him and\n\ttake her place.  She ignores him completely.\n\n\tBROWN slams the doors.  As he looks up, he sees his brother\n\tARCHIE staring at him from across the courtyard.  For a\n\tsecond the two brothers hold each other's gaze.  It's\n\tobvious that ARCHIE has noticed the Queen's indifference. \n\tBROWN turns away and mounts the box as the carriage races\n\taway under him.\n\n\tINT. WINDSOR CASTLE, PRINCE'S BEDCHAMBER - DAY\n\n\tSome days later.  A tableau.\n\n\tQUEEN VICTORIA sits at the foot of the bed, a matriarch\n\tsurrounded by her ROYAL FAMILY.  They watch DOCTOR JENNER\n\tbend to examine the ghostly figure of BERTIE.  He listens\n\tfor a pulse.  Finally, he looks up.\n\n\t\t\t\tJENNER\n\t\tBetter.\n\n\tVICTORIA lets out a deep breath.  She takes hold of\n\tPRINCESS ALEXANDRA'S hand.\n\n\t\t\t\tVICTORIA\n\t\tShould the good Lord see fit to spare\n\t\tmy son, I will order a mass to be\n\t\tcelebrated at St. George's.  The\n\t\tpeople must share with their Queen,\n\t\ther prayers and hopes for their future\n\t\tKing.\n\n\tINT. WINDSOR CASTLE, CORRIDOR OUTSIDE BEDCHAMBER - DAY\n\n\tA few minutes later, BROWN stands in the corridor when the\n\tdoor bursts open and VICTORIA marches straight past him\n\twith PONSONBY at her side.\n\n\t\t\t\tPONSONBY\n\t\t\t(aside to BROWN)\n\t\tThe Queen will be riding to St.\n\t\tGeorge's on the fifth.\n\n\t\t\t\tBROWN\n\t\t\t(launching straight in)\n\t\tI recommend Her Majesty uses the\n\t\tcovered carriage with a full Horse\n\t\tGuard.  In the event of any\n\t\tdisturbance I will ensure --\n\n\t\t\t\tVICTORIA\n\t\t\t(cutting in)\n\t\tI will ride to St. George's in an open\n\t\tcarriage.  It is time the Queen was\n\t\tseen by her public.\n\n\tVICTORIA turns and disappears down the corridor, followed\n\tby PONSONBY.  We linger on BROWN'S humiliation, closer and\n\tcloser until ...\n\n\tEXT. WINDSOR CASTLE, ST. GEORGE'S - DAY\n\n\tSome weeks later.\n\n\tA series of angles on BROWN as he walks amid the mass of\n\tonlookers pressing against a cordon of guards surrounding\n\tthe cathedral.  All the time, his eyes flick left and\n\tright, searching the faces in front of him for potential\n\tassassins.  Over his intense watchfulness we hear ...\n\n\t\t\t\tDEAN WELLSELLY (O.S.)\n\t\t... praise and magnify thy glorious\n\t\tname for that thou has raised thy\n\t\tservant Albert Edward, Prince of Wales\n\t\tfrom the bed of sickness. \n\t\tWe pray thee to perfect the recovery\n\t\tof thy servant and to crown him day by\n\t\tday with more abundant blessings both\n\t\tfor body and soul, through Jesus\n\t\tChrist our Lord ...\n\n\tThe CONGREGATION mutters a vast ...\n\n\t\t\t\tCONGREGATION (O.S.)\n\t\tAmen.\n\n\tEXT. WINDSOR CASTLE, ST. GEORGE'S - DAY\n\n\tVICTORIA and other members of the ROYAL FAMILY walk down\n\tthe steps towards the cheering crowd.  As DEAN WELLSELLY\n\tand BROWN follow, BROWN sees ARTHUR O'CONNER break from the\n\tonlookers, pulling out a gun.  BROWN yells out:\n\n\t\t\t\tBROWN\n\t\tNO!!\n\n\tHe races toward O'CONNER and hits him flying, bangs him to\n\tthe ground and twists the gun out of his hand.  As they\n\tfall we hear laughter and:\n\n\t\t\t\tBERTIE (O.S.)\n\t\tSo there he is, Arthur O'Conner...\n\n\tINT. WINDSOR CASTLE, DINING HALL - NIGHT\n\n\tIt's a few days later and BERTIE is entertaining a private\n\tdinner party.  They include QUEEN VICTORIA, PRINCESS\n\tALEXANDRA, PRINCESS LOUISE and HENRY PONSONBY.  BROWN is in\n\tattendance.  He stands off to one side, near the door.\n\n\t\t\t\tBERTIE\n\t\t\t(bristling with confidence)\n\t\t... all seven stone of the man,\n\t\tpaddling madly towards us through a\n\t\tsea of Horse Guards, waving something\n\t\tthat looks vaguely like a pen.  I\n\t\tthought he must be one of the mother's\n\t\tardent readership in search of the\n\t\tRoyal indenture...\n\n\tMore chortling.  VICTORIA watches her son, smiling proudly. \n\tBROWN looks straight ahead.\n\n\t\t\t\tBERTIE (CONT'D)\n\t\tI believe I saw him first and then\n\t\talerted Brown.  I'm not convinced that\n\t\the wasn't taking a snooze on top of\n\t\tthe box.  Anyway, we had our man\n\t\tpinned down and I must say, Brown\n\t\tacquitted himself admirably.  Of\n\t\tcourse the gun was a fake, but all the\n\t\tsame, it was well done.\n\n\tNo-one registers BROWN.  But while VICTORIA does not look\n\tat him, she is acutely aware of his presence.\n\n\t\t\t\tVICTORIA\n\t\tI intend Brown to be rewarded with a\n\t\tspecial medal cast in gold.  It will\n\t\tbe called The Devoted Service Medal.\n\n\tThe guests applaud politely.  BERTIE clinks his glass for\n\tattention and raises it high.\n\n\t\t\t\tBERTIE\n\t\tA toast.  Victoria Regina!\n\n\tThe others raise their glasses in unison.\n\n\t\t\t\tEVERYONE\n\t\tVictoria Regina!\n\n\tVICTORIA smiles.  BROWN remains alone by the door.\n\n\t\t\t\tDISRAELI (O.S.)\n\t\tThe people of England have expressed\n\t\tin a manner which cannot be mistaken,\n\t\tthat they will uphold the ancient\n\t\tmonarchy of England ...\n\n\tINT. CRYSTAL PALACE - DAY\n\n\tDISRAELI is delivering his come-back speech at a banquet of\n\tTory delegates.\n\n\t\t\t\tDISRAELI\n\t\t... If the first great object of the\n\t\tTory Party is to maintain the\n\t\tinstitutions of the country, the\n\t\tsecond is, in my opinion, to maintain\n\t\tthe Empire of England ... the\n\t\thereditary, the traditionary policy of\n\t\tthe Tory Party.  Go to your homes,\n\t\tteach them these truths, which will\n\t\tsoon be imprinted on the conscience of\n\t\tthe land ...\n\n\t\t\t\t\t\tFADE TO BLACK.\n\n\tCAPTION: \"1883\"\n\n\t\t\t\t\t\tFADE IN:\n\n\tINT. WINDSOR CASTLE, BROWN'S QUARTERS - NIGHT\n\n\tThe sound of rain driven hard against a window.  We creep\n\tslowly down the corridor until we are back with the fifty\n\tyear-old BROWN.  With his whiskey for company, he is\n\tsitting at his desk, writing in the diary.\n\n\tThe diary-manuscript is now falling apart with wear, but\n\tthere remain a few blank pages.  Slowly, he fills them in.\n\n\t\t\t\tBROWN (V.O.)\n\t\tWe should not live in expectation of\n\t\tcontentment.  Fifteen years of\n\t\tvigilance will not guarantee peace of\n\t\tmind.  Yesterday, intruders were again\n\t\treported in the South Wing.  I believe\n\t\tmy prompt arrival may have averted any\n\t\tcrisis, but it was a timely reminder. \n\t\tIt is a great comfort to me that my\n\t\tefforts in securing the Queen's safety\n\t\tover the years have not been in vain. \n\t\tCertainly Her Majesty sends me no word\n\t\tthat she's dissatisfied.  And I feel\n\t\tsure that if she were unhappy she\n\t\twould have found the occasion  to\n\t\tspeak to me in person, as she has so\n\t\toften done in the past.\n\n\tA knock at the door.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tWhat is it?\n\n\tWe hear a young PAGE, breathless from running.\n\n\t\t\t\tPAGE\n\t\tNorth woods, sir.\n\n\tBROWN grabs his gun and rushes out.\n\n\tEXT. WINDSOR CASTLE, QUADRANGLE - NIGHT\n\n\tBROWN appears at the door and strides into the storm.  He\n\twalks quickly across the wide quadrangle, rain soaking his\n\thair and clothes.\n\n\tTwo GUARDS watch BROWN as he races out into the storm.\n\n\tA coin flips through the air to be caught by an\n\toutstretched hand.  The second GUARD grins.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE - NIGHT\n\n\tBROWN races across the open ground towards the forest.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tAnd now we are back with the opening sequence.  Truncated,\n\tsevere, and shot from a slightly different angle.  The\n\tdriving rain, BROWN hurtling through the trees, the crack\n\tto his left, he spins and plunges on.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tClose-up on BROWN as he bangs against a tree, heaving for\n\tair.  He searches the dark, stops, listens and races on.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tBROWN tears through the trees, pistol raised at full arm's\n\tlength.\n\n\tEXT. THE GROUNDS OF WINDSOR CASTLE, FOREST - NIGHT\n\n\tHe bursts into a clearing, breaks to the centre and stops.\n\n\tPistol raised, he turns a circle, eyes on the wildly\n\tswaying trees.  A branch snaps behind him.  He spins round,\n\tbellows deep from his heart:\n\n\t\t\t\tBROWN\n\t\tGod save the Queen!!\n\n\tAnd fires.\n\n\tINT. WINDSOR CASTLE, CORRIDOR - NIGHT\n\n\tA few days later.\n\n\tVICTORIA is moving swiftly down a long corridor with LADY\n\tELY.  They arrive at a door.  VICTORIA stands facing it.\n\n\t\t\t\tVICTORIA\n\t\t\t(quietly)\n\t\tHow long has he been this sick?\n\n\t\t\t\tLADY ELY\n\t\tA few days, ma'am.\n\n\t\t\t\tVICTORIA\n\t\tWhy was I not told earlier?\n\n\tLADY ELY doesn't answer.  VICTORIA knows anyway.  She nods. \n\tLADY ELY knocks.  The door is opened by a young UNDER\n\tSERVANT who gawps at the sight of Her Majesty standing here\n\tin the servant's quarters.  VICTORIA walks in.\n\n\tINT. WINDSOR CASTLE, BROWN'S QUARTERS - NIGHT\n\n\tThe room has been cleared of bottles, but the thinness of\n\tthe life here shocks her deeply.  The cheap furniture, the\n\tanonymous prints, the bed and, finally, the sight of BROWN.\n\n\tHe is lying in bed, barely conscious.  After a moment, he\n\topens his eyes and stares at her.  She steps forward,\n\tsmiling nervously.\n\n\tHer voice is the old voice, between friends.\n\n\t\t\t\tVICTORIA\n\t\tYou should never have gone out in such\n\t\tfoul weather.\n\n\t\t\t\tBROWN\n\t\tSomeone has to look after you.\n\t\t\t(pause)\n\t\tIt could've been someone.  It was\n\t\tbefore.\n\n\t\t\t\tVICTORIA\n\t\tYes.  Yes it was.\n\n\tHe cannot speak.  It's difficult for her too, but she\n\tspeaks for him.\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tMy Ministers are as impertinent as\n\t\tever.  Dispatches are now so numerous,\n\t\tthey come in a trunk.  Sometimes I do\n\t\tbelieve they will never stop.  Endless\n\t\tletters...\n\t\t \n\n\tHer voice falters.  A pause\n\n\t\t\t\tVICTORIA (CONT'D)\n\t\tI know I have not always been the\n\t\tloyal friend you deserved, John.  And\n\t\tyet here I am now, even now, feeling\n\t\tdesperate at the thought of losing\n\t\tyou.\n\n\tShe starts to cry.\n\n\t\t\t\tBROWN\n\t\tDon't be silly, woman.\n\n\tHis old, familiar gruffness makes her smile and she pulls\n\therself together.  Seeing a bowl of water on the side\n\ttable, she steps across.  Carefully folding a cloth in\n\tfour, she rinses it in the water and gently wipes his face. \n\tLeaning closer, she is about to touch his face when BROWN\n\tgestures protectively.\n\n\t\t\t\tBROWN (CONT'D)\n\t\tNot too near.\n\n\tINT. WINDSOR CASTLE, CORRIDOR - DAY\n\n\tA week later.  PONSONBY and JENNER stand at the window\n\toverlooking the grounds.\n\n\t\t\t\tJENNER\n\t\tErysipelas.\n\n\t\t\t\tPONSONBY\n\t\tNot too protracted, I hope.\n\n\t\t\t\tJENNER\n\t\t\t(shakes his head)\n\t\tA few days...\n\t\t\t(beat)\n\t\tWhen he heard, the Prince of Wales\n\t\tthrew the bust from the window of the\n\t\tRoyal Gallery.  It took four hours to\n\t\tgather the fragments.\n\n\tA beat.\n\n\t\t\t\tPONSONBY\n\t\tThe Queen wishes to publish an account\n\t\tof him.\n\n\t\t\t\tJENNER\n\t\tDear oh dear.\n\n\t\t\t\tPONSONBY\n\t\tWe think she can be dissuaded.\n\t\t\t(beat)\n\t\tHave you had a glance at the diary?\n\n\t\t\t\tJENNER\n\t\tYes.\n\n\t\t\t\tPONSONBY\n\t\tQuite.\n\t\t\t(beat)\n\t\tI think I'd best take it back.\n\n\t\t\t\tJENNER\n\t\tOf course.\n\n\tHe brings out BROWN'S tatty diary-manuscript and hands it\n\tover to PONSONBY.  The two men move away from the window,\n\tto go their separate ways.  Daily business beckons.\n\n\t\t\t\tJENNER (CONT'D)\n\t\tWhere did you find it by the way?\n\n\t\t\t\tPONSONBY\n\t\tSome young page was boasting about\n\t\thaving seen it.\n\t\t\t(beat)\n\t\tLucky.\n\n\tJENNER nods.\n\n\t\t\t\tJENNER\n\t\tWell, no rest for the wicked, Henry.\n\n\t\t\t\tPONSONBY\n\t\tNo, indeed.\n\n\tThe two men head off in opposite directions down the\n\tcorridor.\n\n\n\n\n\n\n\nMrs. Brown\nWriters :   Jeremy Brock\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:31:45.293738"}