{"title": "Mulan", "film_link": "/Movie Scripts/Mulan Script.html", "script_link": "/scripts/Mulan.html", "info_raw": "\n\nMulan Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.82 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Robert D. San Souci\nGenres  Family  Animation  Comedy  Musical  Adventure\nScript Date :  1998\n\nRead \"Mulan\" Script\n\n\n", "script": "\nDisney's Mulan\nCompiled by Barry Adams  during theater showings in 1998\nLast updated: August 18, 1998\n\nMulan is the property and copyright of the Walt Disney Company, Inc.  The\nscript on this page was compiled while watching Mulan in the theater during\nthe summer of 1998 when the film originally aired.  Abuse of this page could\nresult in its removal from this site.\n\n[Chinese guard is seen walking on The Great Wall.  Shan-Yu's falcon swoops\ndown and hits the guard on the head knocking his helmet off.  The falcon lands\non top of a flag pole in front of a full moon and lets out a large cry.  One\ngrappling hook comes over The Great Wall.  The guard walks over to the edge\nand sees many grappling hooks coming towards him]\n\nGuard [yelling]:  We're under attack!  Light the signal!\n\n[Guard runs to the tower and up the ladder as Hun Bald Man #1 and Hun Long\nHair Man appear trying to stop him.  Hun Bald Man #1 breaks the ladder with\nhis sword just as Guard reaches the top.  The guard picks up the torch to\nlight the fire and sees Shan-Yu jump over the edge of the tower and looks at\nhim across from the caldron.  The guard throws the torch into the caldron\nlighting a large fire.  Shan-Yu watches as each tower lights their caldrons\none by one]\n\nGuard [sternly]:  Now all of China knows you're here.\n\nShan-Yu [taking the flag and holding it over the fire]:  Perfect.\n\n[Cut to the palace.  The large doors to the central chamber open as General Li\nwalks in flanked on his left and right by soldiers and approaches the Emperor. \nHe bows, then looks up]\n\nGeneral Li:  Your Majesty, the Huns have crossed our Northern border.\n\nChi Fu:  Impossible! No one can get through The Great Wall.  [The Emperor\nmotions for Chi Fu's silence]\n\nGeneral Li:  Shun-Yu is leading them.  We'll set up defenses around your\npalace immediately.\n\nEmperor [forcefully]:  No!  Send your troops to protect my people.  Chi Fu, \n\nChi Fu:  Yes, your highness.\n\nEmperor: Deliver conscription notices throughout all the provinces.  Call up\nreserves and as many new recruits as possible.\n\nGeneral Li:  Forgive me your Majesty, but I believe my troops can stop him.\n\nEmperor:  I wont take any chances, General.  A single grain of rice can tip\nthe scale.  One man may be the difference between victory and defeat.\n\n[Cut to Mulan using her chopsticks to single out a grain of rice on top of the\nmound of rice]\n\nMulan: Quiet and demure...graceful...polite...[picking up some rice with her\nchopsticks and eating a mouthful] delicate...refined...poised... [She sets\ndown her chopsticks and writes down a final word on her right arm] punctual.\n[A cock crows]  Aiya.  [Calling out]  Little brother. Little brother.  Lit-\nahhh, there you are.  Who's the smartest doggie in the world?  Come on smart\nboy, can you help me with my chores today?\n\n[Mulan ties a sack of grain around Little Brother's waist.  She ties a stick\nonto Little brother so that end of it is in front of Little Brother's face. \nShe ties the bone on the end of the stick just out of reach.  Little Brother\nbegins to run after the bone which he cannot reach.  Mulan opens the door for\nLittle Brother and he runs into the door frame, then out the open door. \nLittle brother runs by the chickens and Khan - the family horse]\n\n[Cut to Mulan's Father, Fa Zhou, kneeling and praying before the Fa family's\nancestors]\n\nFa Zhou:  Honorable ancestors, please help Mulan impress the matchmaker today. \n\n\nLittle Brother [running into the temple and around Fa Zhou scattering grain\naround the floor]: Bark, bark, bark, bark, bark.\n\n[The chickens follow Little Brother into the temple and begin to feed on the\ngrain]\n\nFa Zhou:  Please, PLEASE, help her.\n\n[Mulan steps up to the temple seeing Little Brother on his hind legs trying to\nget the bone.  Mulan bends the stick down so that Little brother can reach the\nbone.  Little brother gnaws on the bone happily.  Mulan continues toward the\ntemple]\n\nMulan [calling out]: Father I brought your--whoop!  [Fa Zhou bumps into Mulan. \nThe cup falls to the ground and Fa Zhou catches the teapot with the handle of\nhis cane]\n\nFa Zhou:  Mulan--\n\nMulan:  I brought a spare. [Mulan pulls out a cup from underneath the back of\nher dress and begins to pour the tea]  \n\nFa Zhou:  Mulan--\n\nMulan [hurried]: Remember, the doctor said three cups of tea in the morning--\n\nFa Zhou:  Mulan--\n\nMulan:  And three at night. \n\nFa Zhou:  Mulan, you should already be in town.  We're counting on you to up--\n\nMulan:  --uphold the family honor.  Don't worry father.  I wont let you down. \n[Mulan covers over the writing on her arm with here sleeve]  Wish me luck. \n[Mulan hurries down the stairs]\n\nFa Zhou [calling out]:  Hurry!  [to himself] I'm going to...pray some more.\n[Fa Zhou turns and walks back into the temple]\n\n[Cut to the town with Fa Li looking worried]\n\nBath Lady [poking out of her building]:  Fa Li, is your daughter here yet? \nThe matchmaker is not a patient woman.  [She goes back into the building]\n\nFa Li:  Of all days to be late.  I should have prayed to the ancestors for\nluck.\n\nGrandma Fa [walking in with a Cri-Kee in a cage]:  How lucky can they be,\nthey're dead.  Besides,  I've got all the luck we'll need.  [Speaking to\nCri-Kee]  This is your chance to prove yourself.  [Cri-Kee chirps approvingly. \nGrandma Fa covers her eyes steps into a busy street]\n\nFa Li [excitedly]:  Grandma No!\n\n[The traffic barely misses Grandma Fa as she crosses the busy street.  But two\nhorse and carriage collide causing a big accident.  She arrives at the other\nside of the street, uncovers here eyes and looks at Cri-Kee]\n\nGrandma Fa:  Yep, this cricket's a lucky one. [Cri-Kee falls over out of\nfright]\n\nFa Li [sighing in relief]:  Hai.\n\n[Mulan arrives on Khan jumping over the recent accident in the street and\njumps off with hay stuck in her hair]\n\nMulan: I'm here.  [Seeing a stern look from her mother] What?  But Mama I had\nto--\n\nFa Li:  None of your 'xcuses.  Now let's get you cleaned up. [They walk\ntogether into the preparation area]\n\n[Song: Honor to us all]\n\nBath Lady:  [all the while Bath Lady undresses Mulan and pushes her into the\nBath]\nThis is what you give me \nto work with?\nWell, honey, I've seen worse.\nWe're gonna turn \nthis sow's ear\nInto a silk purse. [Bath Lady moves the silk partition aside showing Mulan in\nthe bath] \n\nMulan [spoken]:  It's freezing.\n\nFa Li [spoken]:  It would have been warm if you were here on time.  \n\nBath Lady [washing Mulan's hair]:\nWe'll have you\nWashed and dried\nPrimped and polished \ntill you glow with pride\nTrust my recipe for \ninstant bride\nYou'll bring honor to us all\n\nFa Li [grabbing a sponge and Mulan's right arm to start cleaning her.  She\nnotices the writing] [spoken]:  Mulan, what's this?\n\nMulan [Drawing her arm back and batting her eyelashes] [spoken]:  Ahh, notes,\nin case I forget something?\n\nGrandma Fa [spoken]:  Here, hold this [hands the cricket to Fa Li].  We'll\nneed more luck than I thought.  [Mulan looks on with an air of disappointment]\n\n[Cut to the hair dressers]\n\nHair Dresser 1 [Brushing and combing Mulan's hair much to Mulan's chagrin]:\nWait and see\nWhen we're through\n\nHair Dresser 2:\nBoys will gladly go to \nwar for you\n\nHair Dresser 1:\nWith good fortune \n\nHair Dresser 2 [Finalizing the hairdo to look exactly like hers]:\nAnd a great hairdo\n\nBoth:\nYou'll bring honor to us all\n\nFa Li and others:  [Mulan following her Mother passes a xiangqi game and\npauses to make an impressive move.  Mulan has a smug look on her face when Fa\nLi comes back and drags Mulan away]\nA girl can bring her family\nGreat honor in one way\nBy striking a good match\nAnd this could be the day\n\nDresser 1 [Dresser 1, Dresser 2, and Fa Li dress Mulan]:\nMen want girls \nwith good taste\n\nDresser 2:\nCalm\n\nFa Li:\nObedient\n\nDresser 1:\nWho work fast-paced\n\nFa Li:\nWith good breeding\n\nDresser 2 [Pulling the dress tight around her waist]:\nAnd a tiny waist \n\nMulan [expressing her waist being squeezed tight] [spoken]: huh.\n\nAll Three:\nYou'll bring honor to us all \n\nChorus:  [Mulan follows Fa Li and sees boy stealing a doll from a girl.  Mulan\ngrabs the doll from the boy and returns it to its owner]\nWe all must serve \nour Emperor\nWho guards us from the Huns\nA man by bearing arms\nA girl by bearing sons \n\nMake-up Lady/Fa Li: [Putting on Mulan's face, powder, lipstick and eye liner]\n[in a 3 person round]\n When we're through \nyou can't fail\nLike a lotus blossom \nsoft and pale\nHow could any fellow \nsay \"No sale\"\nYou'll bring honor to us all\n[Make-Up Lady holds a mirror so Mulan can see her reflection.  Not looking\npleased, Mulan takes her single, short bang and brings it down in front of her\nforehead and smiles]\n\nFa Li [spoken. Fa Li places a hair comb in Mulan's hair]:  There, you're\nready.\n\nGrandma Fa [spoken]:  Not yet! An apple for serenity [putting an apple in\nMulan's mouth]...A pendant for balance [places a yin-yang pendant under her\nsash] [sings]\n\nBeads of jade for beauty [putting beads around Mulan's neck]\nYou must proudly show it [Grandma Fa raises her chin high with her hand]\nNow add a cricket just for luck [putting the cage with Cri-Kee under Mulan's\nsash in the back.  Cri-Kee doesn't look pleased]\nAnd even you can't blow it\n\nMulan:  [Walking to catch up with the other maidens]\nAncestors\nHear my plea\nHelp me not to make a fool of me\nAnd to not uproot my fam'ly tree\nKeep my father standing tall\n\nMaidens and Mulan: [Mulan taking the parasol from Fal Li and running to fall\nin line with the other 4 maidens]\nScarier than the undertaker\nWe are meeting our \nmatchmaker\n\nAll Townspeople:\nDestiny\nGuard our girls\nAnd our future \nas it fast unfurls\nPlease look kindly on \nthese cultured pearls\nEach a perfect porcelain doll\n\nMaiden #1:  Please bring honor to us\nMaiden #2:  Please bring honor to us\nMaiden #3:  Please bring honor to us\nMaiden #4:  Please bring honor to us\nMulan and Maidens:  Please bring honor to us all! \n\n[All Girls and Mulan arrive before the Matchmaker crouched down behind their\nparasols.  End of song]\n\nMatchmaker [looking at her clipboard]:  Fa Mulan\n\nMulan [Jumping up and raising her hand]:  Present.\n\nMatchmaker:  Speaking without permission.\n\nMulan:  Oops. \n\nGrandma Fa [to Fa Li]:  Who spit in her bean curd?\n\n[Mulan walks into the Matchmaker's building with the Matchmaker following\nbehind and closing the door]\n\nMatchmaker [looking over Mulan]: Huh, Hmm, too skinny.  [Cri-Kee escapes from\nhis cage.  Mulan struggles to catch him] Hmph, not good for bearing sons. \n[Mulan puts Cri-Kee in her mouth when Matchmaker turns around to face her]\nRecite the final admonition.\n\nMulan [nodding and smiling]:  Mmm-Hmm.  [Takes out fan and covers her mouth as\nshe spits out Cri-Kee] Ptu\n\nMatchmaker:  Well...\n\nMulan [with dignity]: Fulfill your duties calmly and re...f--[looking at her\narm with smeared writing] spectfully.  Reflect before you snack [surprised,\nMulan looks at her arm again] act.  [now rapidly] This shall bring you honor\nand glory.  [Fanning herself rapidly and sighing in relief] Huh.\n\nMatchmaker [snatches the fan and looks at it on both sides looking for notes\nnot finding any.  Mulan smiles big when Matchmaker looks at her.  Matchmaker\ngrabs Mulan's right arm pulling her along while smearing the writing and\nleaving some ink on her hand]  Hmmm, this way.  Now, pour the tea  [Pushing a\nteapot towards Mulan].  To please your future in-laws you must demonstrate a\nsense of dignity [Matchmaker smears ink around her mouth.  Mulan staring at\nMatchmaker pours some tea onto the table then notices her mistake and pours\nthe tea into the cup] and refinement.  You must also be poised.  [Mulan\nnotices Cri-kee in the tea-cup as Matchmaker takes the cup]\n\nMulan [quiet and timid]:  Um, pardon me.\n\nMatchmaker:  And silent! [Matchmaker sniffs the tea]\n\nMulan [reaching and grabbing the teacup]:  Could I just take that back...one\nmoment.\n\n[They struggle for the teacup and it turns over on Matchmaker and Cri-kee\njumps down matchmaker's dress]\n\nMatchmaker:  Why you clumsy--[Matchmaker feels Cri-Kee in her dress and dances\naround]  Wooo, woooo, wooooooo, [Matchmaker knocks over her pot of coals, and\nsits down on the coals.  Matchmaker jumps around screaming]  Ahhhhhhhhhhh \n[Mulan grabs her fan and briskly fans the charred area on Matchmaker's behind\ncausing it to flame up.  Mulan looks surprised about her mistake]\n\n[Cut to outside Matchmakers building showing Grandma Fa with much noise coming\nfrom Matchmaker's building]\n\nGrandma Fa [to Fa Li]:  I think it's going well, don't you?\n\nMatchmaker [running out of the building screaming]:  Put it out! Put it out! \nPut it out! [Mulan takes the teapot, throws the tea on Matchmaker and puts out\nthe fire.  She bows, hands the teapot back to Matchmaker and covers her face\nas she walks toward Fa Li and Grandma Fa] [with anger]  You are a disgrace! \n[Matchmaker throws the teapot down smashing it to pieces]  You may look like a\nbride, but you will never bring your family honor!\n\n[The townsfolk who have gathered whisper and walk away]\n\n[Cut to Mulan walking through the gate with her home leading khan.  She looks\nsorrowful.  Fa Zhou sees his daughter and smiles.  Mulan sees her father's\nsmile.  She covers her face with Khan's head and leads him to the water\ntrough]\n\n[Song: Reflection]\n\nMulan: \nLook at me [looking at her reflection in the water trough]\nI will never pass for \na perfect bride [taking off her earrings and beads of jade]\nOr a perfect daughter [Mulan watches Fa Li relating what happened at the\nMatchmaker's to Fa Zhou]\nCan it be\nI'm not meant to play \nthis part?  [Mulan releases Cri-Kee back to the wild]\nNow I see\nThat if I were to truly\nTo be myself [Mulan hops along the bridge railing]\nI would break my \nfamily's heart\n\nWho is that girl I see  [Mulan looks into the pond and sees her own\nreflection]\nStaring straight\nBack at me? [Mulan puts her hand on the Great Stone Dragon and looks toward\nthe temple]\nWhy is my reflection someone \nI don't know? [Cri-Kee rowing across the pond on a lily pad]\nSomehow I cannot hide [Mulan walking into the family temple]\nWho I am [Cri-Kee watches Mulan in the temple seeing multiple reflections of\nherself in the ancestors' stones]\nThough I've tried  [Mulan bows to the ancestors]\nWhen will my reflection show\nWho I am inside?  [Mulan finishes wiping off her make-up seeing her reflection\nin the stones]\nWhen will my reflection show\nWho I am inside? [Mulan gets up and heads out the temple]\n\n[End of song.  Mulan sits on a bench under the blossom tree.  Fa Zhou\napproaches her, clearing his throat.  Mulan sees him approaching and turns her\nhead away.  Fa Zhou sits down beside Mulan]\n\nFa Zhou:  My, my, what beautiful blossoms we have this year [looking up into\nthe blossom tree].  But look, this one's late.  But, I'll bet that when it\nblooms, it will be the most beautiful of all.  [Mulan and Fa Zhou share\nsmiles.  Drums start pounding announcing the arrival of Chi Fu and two guards\non horseback]\n\nMulan:  What is it?\n\n[Fa Zhou gets up and walks to the entrance of their house with Mulan\nfollowing]\n\nFa Li:  Mulan, stay inside.\n\n[Grandma Fa clears her throat catching Mulan's attention and motions inside. \nMulan spies the railing near the wall and climbs up to watch over the roof]\n\nChi Fu:  Citizens  I bring you a proclamation from the Imperial City:  the\nHuns have invaded China! \n\nTownspeople [expressing surprise]:  No!\n\nChi Fu:  By order of the Emperor, one man from every family must serve in the\nImperial Army.  The Xiao family [a family member steps up, bows to the guard\nand takes the conscription notice from the guard].  The Yi family.\n\nYi's Son [holding his old father back]:  I will serve the Emperor in my\nfather's place.\n\nChi Fu:  The Fa Family.\n\nMulan:  No.\n\n[Fa Zhou gives his cane to Fa Li and walks toward Chi Fu.  Fa Zhou bows before\nthe horsemen]\n\nFa Zhou [standing proud]:  I am ready to serve the Emperor.  [Fa Zhou reaches\nfor the conscription notice]\n\nMulan [running outside to keep her father from taking the conscription\nnotice]:  Father, you can't go.\n\nFa Zhou [turning to see his daughter]:  Mulan!\n\nMulan:  Please sir, my father has already fought bravely--\n\nChi Fu:  Silence!  You would do well to teach your daughter to hold her tongue\nin a man's presence.\n\nFa Zhou [looking away from Mulan]:  Mulan, you dishonor me.\n\n[Grandma Fa guides Mulan back away]\n\nChi Fu [handing Fa Zhou the conscription notice]:  Report tomorrow at the Wu\nShu camp.\n\nFa Zhou:  Yes, sir. [Fa Zhou walks back into the homestead refusing to take\nhis cane from Fa Li]\n\nChi Fu [fading out as we follow Fa Zhou]:  The Chu family.  The Wen family. \nThe Chang family.  The...\n\n[Cut to Fa Zhou in his armory at night.  Fa Zhou takes out his sword and\npractices his stances.  Whan he balances on his right leg, his leg injury acts\nup and he falls.  Unbeknownst to her father, Mulan watches in horror.  She\nbreathes heavily]\n\n[Cut to dinner.  The Fa Zhou, Grandma Fa, Fa Li, and Mulan eat in silence. \nThunder can be heard and lightning can be seen through the opaque window. \nMulan pours the tea for her family.  She slams her teacup down on the table\nand stands up]\n\nMulan:  You shouldn't have to go.\n\nFa Li:  Mulan!\n\nMulan:  There are plenty of young men to fight for China.\n\nFa Zhou:  It is an honor to protect my country and my family.\n\nMulan [angrily]:  So you'll die for honor!\n\nFa Zhou [standing up and angered]:  I will DIE doing what's right.\n\nMulan [starts to speak but is cut off]: But if you--\n\nFa Zhou:  I know my place, it is time you learned yours.\n\n[Mulan looking like she's about to cry, turn away from Fa Zhou and runs\noutside into the rain storm and cries]\n\n[Cut to Mulan sitting at the base of the Great Stone Dragon in the rain. \nMulan looks down to see her reflection in the puddle caused by the rain. She\nwatches her parents in the bedroom.  Fa Li turns away from Fa Zhou and walks\nout of site.  Fa Zhou blows out the light.  Mulan gets up and walks to the Fa\nFamily Temple.  Mulan's image reflects off the stone tablets as she lights\nincense and places it in the hanging encense holder.  She bows and prays to\nher ancestors. Getting up, Mulan hurries down the steps.  Cri-Kee sees her and\nhops down from above and follows her.  Mulan goes to her parent's bedroom and\ntakes the conscription notice replacing it with the hair comb her mother gave\nto her.  She pauses to give her parents a loving, sorrowful look and hurries\nout.  Cut to Mulan in the armory.  She opens the cabinet with the armor. \nUsing her father's sword, she cuts her hair short and ties it up above her\nhead.  She finishes putting on the armor and ties it in the front.  She takes\nthe sword and places it in the scabbard to her left.  Cut to Mulan in the\nstable doorway.  Khan rears back in fright at the sight of Mulan.  Mulan goes\nforward and comforts Khan letting him know her identity.  Mulan walks Khan out\nof the stable, Cri-Kee watches from the ground as she passes by.  Mulan takes\none sorrowful glance back at her parents bedroom and rides Khan through the\ngate and off to camp.]\n\n[Cut to the face of a statue in the Fa Family Temple.  The eyes glow.  Cut to\nGrandma Fa.  She wakes up with a start rising in bed.  Cut to Grandma Fa\nwalking into Fa Li and Fa Zhou's bedroom, both are in bed]\n\nGrandma Fa:  Mulan is gone.\n\nFa Zhou [waking up]:  What?  It can't be.  [Fa Zhou looks at his night stand\nand notices the hair comb in place of his conscription notice.  He checks the\ncabinet and sees his armor is gone.  He hurries outside] [calling out]  Mulan! \n[He stumbles while walking because of his leg injury] No.\n\nFa Li [kneeling down beside the fallen Fa Zhou]:  You must go after her.  She\ncould be killed!\n\nFa Zhou [sadly]:  If I reveal her, she will be. [Fa Zhou embraces Fa Li]\n\nGrandma Fa:  Ancestors, hear our prayer: Watch over Mulan.\n\n[Cut to the Fa Family Temple.  A wind blows out the incense at the base of the\ncenter stone.  The center stone begins to glow as First Ancestor comes to\nlife]\n\nFirst Ancestor [motioning to a bronze dragon]:  Mushu, awaken!\n\n[Mushu comes to life and falls to the ground flat on his back all being\nobscured by smoke]\n\nMushu [rising from the smoke arms stretched out]:  I live!  So tell me what\nmortal needs my protection Great Ancestor.  You just say the word and I'm\nthere.\n\nFirst Ancestor [agitated]:  Mushu!\n\nMushu:  Hey, let me say something. Anybody who is foolish enough to threaten\nour family, vengeance will be MINE.  Hrrrrr.\n\nFirst Ancestor [sternly to silence Mushu]:  Mushu!  These are the family\nguardians [motioning towards the stone statues on pedestals near the ceiling]. \nThey...\n\nMushu [dejectedly]:  Protect the family.\n\nFirst Ancestor [pointing to the empty pedestal]:  And you, oh demoted one.\n\nMushu:  I...ring the gong.\n\nFirst Ancestor:  That's right, now, wake up the ancestors.\n\nMushu:  One family reunion coming right up.  [ringing the gong] Okay people,\npeople look alive, lets go! C'mon get up.  Let's move it, rise and shine. \nYou're way past the beauty sleep thing now trust me!\n\nAncestor 1:  I knew it, I knew it. That Mulan was a trouble maker from the\nstart.\n\nAncestor 3:  Don't look at me, she gets it from your side of the family.\n\nAncestor 2:  She's just trying to help her father.\n\nAncestor 4 [appearing out of thin air]:  But, if she is discovered, Fa Zhou\nwill be forever shamed.  Dishonor will come to the family.  Traditional values\nwill disintegrate.\n\nAncestor 5:  Not to mention they'll lose the farm.\n\nAncestor 1:  My children never caused such trouble.  They all became\nacupuncturists.\n\nAncestor 3:  Well, We can't all be acupuncturists.\n\nAncestor 6:  No, your great granddaughter had to be cross-dresser!\n\n[All ancestors argue at once, except First Ancestor]\n\nAncestor 7:  Let a guardian bring her back.  \n\nAncestor 8 [grabbing Mushu and bringing him next to a guardian]: Yeah, awaken\nthe most cunning.\n\nAncestor 4 [taking Mushu and holding him next to the stone rabbit guardian]: \nNo, the swiftest.\n\nAncestor 9 [grabbing Mushu and holding him next to the stone monkey guardian]: \nNo, send the wisest.\n\nFirst Ancestor:  Silence!  We must send the most powerful of all [Motioning to\nthe Great Stone Dragon as it is seen through the window]\n\nMushu [climbs up the empty guardian post laughing]:  Ho, ho, heh, heh. Okay,\nokay, I get the drift, I'll go. [All Ancestors give a quick look of surprise\nand laugh uncontrollably]  You all don't think I can do it.  Watch this here. \n[Mushu produces a small flame from his mouth]  Ah, ha, Jump back, I'm pretty\nhot huh.  Don't make me have to singe nobody to prove no point.\n\nFirst Ancestor [grabbing Mushu and pulling away from the post]:  You had your\nchance to protect the Fa family.\n\nAncestor 6:  Your mis-guidance led Fa Deng to disaster.\n\nFa Deng [with his decapitated head on his lap]:  Yeah, thanks a lot.\n\nMushu:  And your point is?\n\nFirst Ancestor:  The point is we will be sending a real dragon to retrieve\nMulan.\n\nMushu:  What?  But I'm a real dragon.\n\nFirst Ancestor [grabbing Mushu and pulling him away from the guardian post as\nMushu fights to hold on]:  You are not worthy of this spot.  Now, awaken the\nGreat Stone Dragon.  [First Ancestor throws Mushu out of the temple]\n\nMushu [looking back into the temple]:  So you'll get back to me on the job\nthing.\n\n[An ancestor throws Mushu's gong and hits Mushu in the face]\n\nMushu [walking with a slouch and banging the gong on the ground]:  Just one\nchance is that too much to ask?  I mean, it's not like it'll kill ya.\n\nMushu [rings the gong and looks at the Great Stone Dragon]:  Yo rocky, wake\nup!  You gotta go fetch Mulan.  [pauses as nothing happens.  Mushu walks over\nto the side of the statue] C'mon boy, go get her, go on, [throws the gong\nstick off the screen and whistles] Come on.  [Angrily while climbing up the\nGreat Stone Dragon] Grrr, Grrrr.  [speaking in his ear and banging the ear\nwith the gong] Hello, helloooooo. [curtly] Hello [bangs the gong extra hard\nagainst the ear causing it to break off].  Uh oh.  [The Great Stone Dragon\ncrumbles to the ground, head intact minus the ear].  [knocks on the dragon's\nhead] Uh, Stoney, Stooooneeey.  Oh man, they're gonna kill me!\n\nFirst Ancestor [calling out through the temple window]:  Great Stone Dragon,\nhave you awaken? \n\nMushu [holding the head of the Great Stone Dragon up to that First Ancestor\ncan only see it's head and Mushu's body]:  Uhhh, Yes, I just woke up.  And I\nam the Great Stone Dragon, good morning [Mushu waves].  I will go forth and\nfetch Mulan.  Did, did I mention that I was the Great Stone Dragon?\n\nFirst Ancestor:  Go, The fate of the Fa Family rests in your claws.\n\nMushu:  Don't even worry about it, I will not lose face.  [Mushu falls down\nthe hill under the weight of the Great Stone Dragon's head and lands on the\ndragon's pedestal with the head falling on top of him]\n\nMushu [muffled]:  Ow, my elbow.  Aw, aw, I know I twisted something. \n[Throwing the head off him]  That's just great.  Now what?  I'm doomed!   And\nall 'cause miss man decides to take her little drag show on the road.\n\n[Cri-Kee enters stage right]\n\nCri-Kee:  Chirp, Chirp.\n\nMushu:  Go get her?   What's the matter with you?  After this great stone\nHumpty Dumpty mess, I'd have to bring her home with a medal to get back in the\ntemple.  Wait a minute, that's it!  I make Mulan a war hero, then they'll be\nbegging me to come back to work.  That's the master plan.  Oh, you've gone and\ndone it now. [Mushu runs off stage right]\n\nCri-Kee [hopping along side of Mushu]:  Chirp.  Chirp Chirp Chirp.\n\nMushu [pushing Cri-Kee away]:  Hey, what makes you think you're coming?\n\nCri-Kee:  Chirp, Chirp. \n\nMushu:  You're lucky?  Ho, ho, heh.  Do I look like a sucker to you?\n\nCri-Kee:  Chirp. Chirp.\n\nMushu:  Whach' you mean loser?  How 'bout I pop one of your antenna's off and\nthrow it across the yard.  Then who's a loser, me or you?\n\n[Interlude]\n\n[Cut to Shan-Yu leading his army at a charge on horseback through a forest. \nHe stops and motions stage right.  Hun Archer, Hun Strong Guy, Hun Long-Hair\nGuy dismount and walk into the forest.  They throw down two Imperial scouts\nbefore the rest of the army]\n\nHun Long-Hair Guy:  Imperial scouts. \n\n[Shan Yu dismounts and walks towards the scouts]\n\nScout #1:  Shan-Yu.\n\n[He crouches down in front of them]\n\nShan-Yu [adjusting Scout #1's collar]:  Nice work, gentlemen.  You found the\nHun army. [motioning to the soldiers on horseback.  The Hun army laughs]\n\nScout #2:  The Emperor will stop you.\n\nShan-Yu [grabs Scout #2 by the shirt collar and lifts him up to his face]: \nStop me?  He invited me.  By building his wall, he challenged my strength. \nWell I'm here to play his game  [Shan-Yu throws Scout #2 to the ground and\npoints his sword at Scout #1 as he gets up and runs] [calling out to the\nscouts] Go!  Tell your emperor to send his strongest armies.  [Quietly]  I'm\nready. \n\n[The Imperial Scouts run off towards the palace]\n\nShan-Yu [scratching his chin]:  How many men does it take to deliver a\nmessage.\n\nArcher Guy [drawing back his bow]:  One.\n\n[End Interlude]\n\n[Cut to Mulan on a hill outside of the camp.  Khan is sitting watching]\n\nMulan:  Okay, okay, how 'bout this?  Ahem, [in her manly voice] excuse me,\nwhere do I sign in?  Hah, I see you have a sword.  I have one too.  They're\nvery manly and tough [Mulan bites her lip as she mishandles pulling the sword\nout of the scabbard and it falls to the ground.  Khan rolls on his back in\nlaughter.  Mulan throws her shoe and hits Khan in the head with it quieting\nKhan].  I'm working on it.  Who am I fooling?  It's going to take a miracle to\nget me into the army.\n\n[Mushu appears as a giant shadow being cast on a rock with flames on either\nside.  Mushu's real appearance remains out of sight]\n\nMushu [in a Southern Baptist Preacher's voice]:  Did I hear someone ask for a\nmiracle!?  Let me hear you say aye!\n\nMulan [Running and hiding behind a rock]:  Ahhhhhh.\n\nMushu:  That's close enough.\n\nMulan [from behind a rock]:  Ghost.\n\nMushu:  Get ready Mulan your serpentine salvation is at hand.  For I have\nbeen sent by your ancestors-- [notices Cri-Kee making a hand shadow of a\ndragon on the rock and stamps him down with his foot] to guide you through\nyour masquerade.  [bending down to Cri-Kee]  C'mon, you're gonna stay you're\ngonna work. [returning to Mulan] Heed my word, 'cause if the army finds out\nthat you are a girl, the penalty is death. [big flames shoot up from the\nrocks]\n\nMulan:  Who are you?\n\nMushu:  Who am I?  Who am I?  I am the guardian of lost souls. [Mulan smiles\nbig in anticipation of seeing her guardian] I am the powerful, the\npleasurable, the indestructible [coming out from the rocks to show his real\nsize] Mushu! Oh hah, hah, pretty hot, huh? [Khan stomps on Mushu.  Mulan\npushes Khan back]\n\nMulan:  Ah, my ancestors sent a little lizard to help me?\n\nMushu:  Hey, dragon, dragon,  not lizard.  I don't do that tongue thing [flips\nout his tongue to show Mulan what he means].\n\nMulan:  You're uh...\n\nMushu:  Intimidating?  Awe inspiring?\n\nMulan [making a hand gesture to denote his smallness of size]: Tiny.\n\nMushu [with a look of disappointment]:  Of course.  I'm travel size for your\nconvenience.  If I was my real size, your cow here [patting Khan on the nose]\nwould die of fright.  [Khan tries to bite Mushu]  [pointing to the ground\nspeaking to Khan] Down Bessy.  My powers are beyond your mortal imagination. \nFor instance, [leaning in and looking at Mulan's chest] my eyes can see\nstraight through your armor.  [Mulan cover her bust with her left arm and\nslaps Mushu with the right]  Ow.  [angrily] All right, that's it!  Dishonor! \nDishonor on your whole family.  [aside to Cri-Kee] Make a note of this\n[Cri-Kee grabs a leaf and a pen and starts writing].  [Loudly with gusto]\nDishonor on you.  Dishonor on your cow.  Dis-\n\nMulan [pleadingly while covering Mushu's mouth]:  Stop!  I'm sorry, I'm sorry\n[kneeling down in front of Mushu].  I'm just nervous.  I've never done this\nbefore.\n\nMushu: Then you're gonna have to trust me.  And don't you slap me no more, we\nclear on that?  [Mulan nods emphatically].  All right.  Okey dokey, let's get\nthis show on the road.  Cri-Kee, get the bags [Mushu starts walking to the\ncamp].  [to Khan] Let's move it heifer.\n\n[Cut to Mulan at the camp's entrance]\n\nMushu [hiding in Mulan's armor poking his head out from her back]:  Okay this\nis it, time to show 'em your man walk.  Shoulders back,  chest high, feet\napart, head up [Mushu pulls Mulan's head back]  ...and strut 2, 3, break it\ndown, 2, 3 and work it, [Mulan walks into the camp drawing the attention the\nmen who see her.  Mulan walks into a tent and sees a man picking his nose and\nanother man picking out dirt from between his toes with chopsticks] Beautiful\nisn't it?\n\nMulan [making a face of disgust and continuing to walk]:  They're disgusting.\n\nMushu:  No, they're men.  And you're going to have to act just like them, so\npay attention.\n\n[Mulan stops and watches Yao, Ling, Chien-Po and Tattoo Soldier]\n\nTattoo Soldier [showing the dragon tattoo on his chest and belly]:  Look, this\ntattoo will protect me from harm.\n\n[Yao thinks for a moment, then punches Tattoo Soldier in the stomach causing\nLing to laugh.  Mulan watches in utter amazement.  Yao kisses his hand]\n\nLing [laughing]:  I hope you can get your money back.\n\nMulan:  I don't think I can do this.\n\nMushu:  It's all attitude.  Be tough like this guy here [looking at Yao].\n\n[Mulan looks at Yao as he hocks up a loogie and spits]\n\nYao [noticing Mulan watching him]:  What are you looking at?\n\nMushu:  Punch him, it's how men say 'hello.'\n\n[Mulan looks at her fist, then punches Yao from behind on the shoulder.  The\nforce causes Yao to run into Chien-Po]\n\nChien-Po:  Oh Yao, you made a friend.\n\nMushu:  Good, Now slap him on the behind, they like that.\n\n[Mulan slaps Yao on the behind]\n\nYao:  Wu hoo hooooo.  [grabbing Mulan buy the collar]  I'm going to hit you so\nhard it'll make your ancestors dizzy.\n\nChien-Po [Holding and picking up Yao]:  Yao, relax and chant with me. \nYaaaaaaa Moouuuu Ahhhhhh Doooou Fuuuu Daaaaa.\n \nYao:  Ya Mi Ah To Fu Da.\n\nChien-Po:  Feel better? \n\nYao [relaxed]:  Yeah. [Chien-Po places Yao back on the ground]  [to Mulan\nwhile walking away] Aaaaa, you ain't worth my time chicken boy.\n\nMushu [loudly]:  Chicken boy!?  Say that to my face ya limp noodle!\n\n[Yao grabs Mulan by the collar cocking back his arm to punch.  Mulan ducks as\nYao hits Ling standing behind her]\n\nYao:  Oh, sorry Ling.  Hey!\n\n[Yao grabs Mulan's foot as she starts to crawl away.  Ling kicks Yao on the butt causing him to land on Chien-Po's stomach. Ling Jump\nattacks Mulan, but she ducks and he lands on Yao on top of Chien-Po]\n\nLing:  You're dead.  [They fight on top of Chien-Po.  Mulan runs away.  Ling notices Mulan and then points toward her] Oh, there he goes.\n\n[Mulan runs into a tent and stops.  Yao, Ling, and Chien-Po (in that order) run through the tent.  Yao stops short as he is about to run into a\nsoldier in a line for food.  He looks behind him with concerned eyes as Ling stops in time.  Chien-Po bumps into Ling causing the entire line\nof soldiers to fall forward and knock over the pot of congee and the cook behind it.  The men look to the back of the line and spy Mulan who\nhas emerged from the tent.  They angrily start walking towards her.  Mulan has a look of horror on her face as if trouble is about to brew]\n\nMulan:  Hey guys.  \n\n[Chi Fu watches and then walks into the tent.  General Li and Li Shang are in the tent.]\n\nGeneral Li [motioning with his pointer to a map of the region]:  The Huns have struck here, here and here.  I will take the main troops up to\nthe Tung Shao Pass and stop Shan-Yu before he destroys this village.\n\nChi Fu:  Excellent strategy, Sir.  I do love surprises, Ha ha, ha, ha.\n\nGeneral Li:  You will stay here and train the new recruits.  When Chi Fu believes you're ready, you will join us...Captain. [General Li hands\na sword to Shang]\n\nShang:  Captain?\n\nChi Fu:  Oh, this is an enormous responsibility, General.  Uh, perhaps a soldier with more experience--\n\nGeneral Li:  Number one in his class, extensive knowledge of training techniques, [leaning back smugly stroking his chin] an impressive\nmilitary lineage.  I believe Li Shang will do an excellent job.\n\nShang [excitedly]:  Oh, I will.  I wont let you down.  This is, I mean, I...[somberly] yes sir.\n\nGeneral Li [gets up and starts walking out of the tent]:  Very good then.  We'll toast China's victory at the Imperial City.  [to Chi Fu] I'll\nexpect a full report in three weeks.\n\nChi Fu [to Shang]:  And I wont leave anything out.  [exits through the tent]\n\nShang [while tying his sword to his uniform]:  Captain Li Shang, Hmmm, leader of China's finest troops.  No, the greatest troops of all time. \nHeh, heh, heh, heh.  [Shang walks out of the tent to see the recruits fighting.  He stands stage left of Chi Fu and General Li.  Injured Recruit\nsees the General and salutes him as he falls to the ground.  General Li steps over Injured Recruit and mounts his horse]\n\nChi Fu:  Most impressive.\n\nGeneral Li:  Good luck Captain.  [The general and his mounted troops leave the camp]\n\nShang [quietly, to himself]:  Good luck, Father.  [Shang looks at his troops and sighs]\n\nChi Fu [smirking, with board and brush in hand]:  Day one.\n\nShang [shouting]:  Soldiers!\n\nAll Recruits [backing away revealing Mulan and pointing at her.  Mulan is crouching in the fetal position on the ground]:  He started it!\n\n[Shang approaches Mulan and looks down over her.  Mulan looks up, sees Shang over top of her and gets up quickly dusting herself off]\n\nShang [to Mulan]:  I don't need anyone causing trouble in my camp!\n\nMulan:  Sorry, [in her man voice] Uhh, I mean, sorry you had to see that.  [with her fist she taps Shang on the shoulder]  You know how it is\nwhen you get those, uh [pounding her chest] manly urges and you just have to kill something [slapping her hand], fix things, uh, cook\noutdoors.\n\nShang:  What's your name?\n\nMulan [stumbling]:  Ahh, I, uhhh, I, uh--\n\nChi Fu [stepping into Mulan's face]:  Your commanding officer just asked you a question.\n\nMulan:  Uhh, I've got a name.  Huh.  And it's a boys name too.\n\nMushu [from the back of Mulan]:  Ling, How 'bout Ling?\n\nMulan [to Mushu motioning with her head to Ling]:  His name's Ling.\n\nShang:  I didn't ask for his name.  I asked for yours.\n\nMushu:  Try, uh, ahh, Chu!\n\nMulan:  Ah Chu.\n\nShang:  Ah Chu?\n\nMushu:  Gesundheit.  He He, I kill myself.\n\nMulan [whispering over her shoulder]:  Mushu.\n\nShang:  Mushu?\n\nMulan:  No.\n\nShang:  Then what is it!\n\nMushu:  Ping! Ping was my best friend growing up!\n\nMulan:  It's Ping.\n\nShang:  Ping.\n\nMushu:  Of course Ping DID steal my gir-[Mulan reaches back and grabs holds Mushu's mouth together]\n\nMulan:  Yes, my name is Ping.\n\nShang:  Let me see your conscription notice.  [Takes the notice from Mulan]  Fa Zhou, *the* Fa Zhou?\n\nChi Fu:  I didn't know Fa Zhou had a son.\n\nMulan:  Um, he...doesn't talk about me much.  [Mulan tries to hawk up a loogie and spit but the saliva just runs from her mouth.  The\nrecruits laugh]\n\nChi Fu:  I can see why, the boy's an absolute lunatic.\n\nShang [to the recruits]: Okay gentlemen, thanks to your new friend Ping, you'll spend tonight picking up every single grain of rice.  And\ntomorrow, the real work begins.\n\n[All recruits growl at Mulan]\n\nMushu [Popping out the front of Mulan's armor]:  You know, we have to work on your people skills.\n\n[Cut to Mulan sleeping in her tent.  Mushu winds up Cri-Kee's wings.  Cri-Kee rings like an alarm clock]\n\nMushu: All right, rise and shine sleeping beauty.  [Mulan rises and blinks] C'mon [rapping on Mulan's head with each syllable] hup, hup,\nhup. [Mulan groans, lies back down and pulls the covers over her head.  Mushu pulls the covers off Mulan entirely]  Get your clothes on. \nGet ready.  Got breakfast for ya.  [Mushu jumps onto Mulan's knee with a bowl of porridge]  Look, you get porridge, and it's happy to see\nyou.  [Mushu shows her the bowl with two eggs and bacon looking like a smiley face.  Cri-Kee pops up out from the bowl of porridge] Hey,\nget outta there, you gonna make people sick!  [Mushu uses chopsticks to push Cri-Kee out of the porridge]\n\nMulan:  Am I late?\n\nMushu [while feeding Mulan]:  No time to talk.  Now remember, it's your first day of training so listen to your teacher and no fighting.  Play\nnice with the other kids, unless of course one of the other kids wanna fight, then you have to kick the other kid's butt.\n\nMulan [with her mouth full of food]:  But I don't wanna kick the other kid's butt.\n\nMushu:  Don't talk with your mouth full.  Now let's see your war face [Mulan looks at him with wide eyes and chipmunk cheeks full of food]. \nI think my bunny slippers just ran for cover.  C'mon scare me, girl! \n\nMulan [swallows the food]:  Rrrrrrr!\n\nMushu [rolling back into the half eaten bowl of porridge]:  Oh, that's my tough looking warrior.  That's what I'm talking about.  Now get out\nthere and make me proud. [Mushu ties up Mulan's hair]\n\n[Khan whinnies and pokes his head into the tent]\n\nMushu:  What do you mean the troops just left?  \n\nMulan [acting surprised]:  They what!? [Mulan hurriedly puts on her clothes and jumps out of the tent going off to join the other recruits]  \n\nMushu [running out from the tent calling after Mulan]:  Wait, you forgot your sword.  My little baby off to destroy people [sniffle].\n\n[Cut to the troops muddling around near Shang's tent]\n\nChi Fu [enters stage left]:  Order people, order!\n\nRecruit #2:  I'd like a pan fried noodle.\n\nChien-Po:  Oh, oh, sweet and pungent shrimp [Ling and others begin to laugh]\n\nRecruit #3:  Moo goo gai pan\n\nChi Fu:  That's not funny.\n\n[Mulan comes running up to the group]\n\nLing [noticing Mulan's arrival]:  Looks like our new friend slept in this morning.  [Mulan stops between Ling and Yao] [to Ping] Hellooo Ping,\nAre you hungry?\n\nYao:  Yeah, 'cause I owe you a knuckle sandwich.  [grabs Mulan by the shirt collar drawing back his other arm.  Mulan hides her face with\nher hands.  Ling looks away, closes his eyes, and puts his fingers in his ears so that he wont hear anything]\n\nAll Soldiers [in agreement with Yao]:  Yeah.\n\nShang [loudly]:  Soldiers!  [The soldiers line up quicky.  Shang takes off his shirt and grabs a bow and quiver of arrows.  Mulan is duly\nimpressed by Shang's physique] You will assemble swiftly and silently every morning. [Shang walks down the line of soldiers] Anyone who\nacts otherwise will answer to me.\n\nYao:  Ooooo, tough guy.\n\nShang [turning around with knocked arrow pointing towards Yao]:  Yao.  [All recruits take a step back leaving Yao one step forward.  Shang\nPoints arrow skyward and shoots it into the top of a high pole]  Thank you for volunteering.  Retrieve the arrow.\n\nYao [bows to Shang]:  I'll get that arrow pretty boy.  And I'll do it with my shirt on.  [Yao prepares to leap onto that pole]\n\nShang:  One moment, you seem to be missing something.  [Chi Fu brings out two large bronze disks.  Shang takes out one disk and holds it\nhigh speaking to all the troops]  This represents discipline  [Shang hands the weight to Yao and the weight falls to the ground taking Yao's\narm with it]  and this represents strength [Shang hands the other weight to Yao making him fall to the ground.  The troops laugh while\nMulan looks concerned].  You need both to reach the arrow.\n\n[Yao climbs up the pole then slips down under the weight.  Ling, Chien-Po, and Mulan each take their turn and fall down.  Mulan rubs her\nbehind as she walks away in front of Shang]\n\nShang:  We've got a long way to go.\n\n[Song I'll Make a Man Out of You]\n\n[Shang throws staffs to the soldiers.  Yao intercepts Mulan's staff and trips her with it]\n\nShang:\nLet's get down to business--\nto defeat the Huns.\n\n[Shang throws up two clay pots and breaks them apart with his staff.  The troops are highly impressed]\n\nRecruits [putting their staffs out at arms length, spoken]:  Hua\n\nShang:\nDid they send me daughters\n when I asked for sons?  [Ling puts a cricket down Mulan's back causing her to flail erratically]\nYou're the saddest bunch\n I ever met  [Most soldiers fall as Mulan moves uncontrollably]\nBut you can bet \nbefore we're through  [Shang does a somersault in the air landing near Mulan.  He takes a pole in the stomach.  Shang stops Mulan and\ntakes her staff.  He grabs her by the collar]\nMister, I'll make a man\n out of you \n\n[Shang steps on a lever throwing up 3 targets which he hits with 3 arrows from one bow]\nTranquil as a forest\n[The recruits try and fail.  Mulan gets ready to fire when Mushu sticks a target on her arrow before she shoots.  Mulan looks at Mushu's in\nshock and pauses.  Shang looks disdainfully at Mulan as she cracks a huge smile]\nBut on fire within\n[Shang balances a bucket of water on his head holding a staff.  The recruits fire stones at him which Shang deflect with the staff]\nOnce you find your center\nYou are sure to win\n[Mulan wobbles with the bucket of water on her head.  As the recruits throw stones at her the bucket tips over onto her head]\nYou're a spineless, pale,\npathetic lot \nAnd you haven't got a clue \n[Shang throws his hand down into a river and retrieves a fish.  Mulan throws her hand down into the river and retrieve's Yao's foot.  Mushu\ncomes out of the water with a fish in hand to give to Mulan]\nSomehow I'll make a man\nout of you!\n\nChien-Po [running through a field of fire arrows]:\nI'm never gonna catch \nmy breath\n\nYao [following Chien-Po, falls and gets hit in the butt with an arrow]:\nSay good-bye to those \nwho knew me\n\nLing [Banging his head on a stone slab]:\nBoy I was a fool in school \nfor cutting gym\n\n[Shang practices martial arts with Mulan.  With a punch to the face he knocks her back into a tree]\n\nMushu [from the tree acts as a boxing coach]:\nThis guy's got 'em \nscared to death\n\nMulan [Mushu pushes Mulan back out into the ring]:\nHope he doesn't see \nright through me\n\nChien-Po [stops as he's hopping across poles protruding from water causing Shang and the recruits to pile into him]:\nNow I really wish that I \nknew how to swim!\n\nShang and Chorus:  \n[Cannon fire misses the target in the middle of an open field. Ling kicks the support structure out from Mulan's cannon and it begins to fall.\nMulan quickly grabs the cannon and it fires high and back towards the camp landing and exploding Chi Fu's tent]\n(Be a man)\nWe must be swift as \nthe coursing river\n(Be a man)\nWith all the force \nof a great typhoon\n(Be a man)\nWith all the strength \nof a raging fire\n[Picture of Shang looking over the camp from the hill not looking pleased]\nMysterious as the \ndark side of the moon \n\nShang [his troops laden with poles on their shoulders carrying bags of grain - one on each side.  They march up a mountain]:\nTime is racing toward us \ntill the Huns arrive  \n[Chi Fu points Shang's eyes back to a struggling Mulan who falls to the ground.  Cri-Kee and Mushu try to pick her up but hide when Shang\ncomes up to her.  Shang picks up her pole with grain, puts it on top of his and returns to the troops. Mulan looks rejected]\nHeed my every order \nand you might survive\n[Shang hand the reigns of Khan to Mulan]\nYou're unsuited for \nthe rage of war\nSo pack up, go home, \nyou're through\nHow could I make a man\nout of you?\n\nShang and Chorus [Mulan takes the weights and tries to climb the pole again]:\n(Be a man)\nWe must be swift as \nthe coursing river\n[Mulan ties the weights together behind the pole and uses the cloth to help her shimmy up the pole]\n(Be a man)\nWith all the force \nof a great typhoon\n[As the sun begins to rise the recruits come out of their tents to cheer on Mulan]\n(Be a man)\nWith all the strength \nof a raging fire\n[As Shang comes out of his tent, the arrow he shot up onto the pole comes down to his feet.  He looks up and sees Mulan sitting on top of\nthe pole]\nMysterious as the \ndark side of the moon\n\n[order of events during the last repeat of the chorus:\nTroops hit all targets with arrows correctly.\nMulan racing in front of Shang and the recruits with the pole and weights on her shoulders.\nMulan kicking Shang in the face with a round house.  Shang looking pleased.\nChien-Po doing acrobatics on the poles as the troops follow.\nStaffs being thrown to troops, Yao hands Mulan hers. \nYao running through arrows.\nYao grabs Mulan's staff and hands it to her.\nTroop staff practice #1.  (Hya)\nLing breaking the block\nTroop staff Practice #2.  (Hya)\nMulan holding up fish.\nTroop staff practice #3.\nCannon fire hitting the Hun Target.\nTroop staff practice #4 - jumping in the air (Hya)]\n(Be a man) \nWe must be swift as \nthe coursing river\n(Be a man)\nWith all the force \nof a great typhoon\n(Be a man)\nWith all the strength \nof a raging fire\nMysterious as the \ndark side of the moon\n\n[End Song]\n\n[Interlude]\n\n[Cut to Shan Yu sitting on top of a tree.  He cuts off the very top with his sword.  His falcon swoops buy and drops a doll.  Shan-Yu takes\nthe doll, sniffs it, looks surprised, and drops down to the ground]\n\nShan-Yu [tossing the doll to Hun Strong Man]:  What do you see?\n\nHun Strong Man [feeling the doll]:  Black pine, from the high mountains.  [Long Hair Hun Man takes the doll from Hun Strong Man.  Bald\nHun Man #1 takes a hair as it passes by him]\n\nBald Hun Man #1:  White horse hair.  Imperial stallions.  \n\nLong Hair Hun Man [sniffing the doll]:  Sulfur, from cannons.\n\nShan-Yu:  This doll came from a village in the Tung Shao Pass, where the Imperial Army's waiting for us.\n\nHun Archer:  We can avoid them easily.\n\nShan-Yu [shaking his head]:  No, the quickest way to the Emperor is through that pass.  Besides, the little girl will be missing her doll.  We\nshould return it to her.\n\n[End Interlude]\n\n[Cut to Mulan by the lake with Mushu, Khan, and Cri-Kee]\n\nMushu:  Hey, oh, ah, no, this is not a good idea.  What if somebody sees you?\n\nMulan [from behind the reeds]:  Just because I look like a man doesn't mean I have to smell like one.  \n\nMushu [holding a towel covering his eyes with his ears]:  So a couple of guys don't rinse out their socks, picky, picky, picky.  Well myself I\nkinda like that corn chip's smell.\n\nMulan [running by Mushu and jumps into the lake splashing water on Mushu]:  Ahhhhhhh.\n\nMushu:   Okay, all right, all right, that's enough.  Now, c'mon, get out before you get all pruny and stuff [holding out a towel towards Mulan\nkeeping his eyes covered].\n\nMulan:   Mushu, if you're so worried, go stand watch.\n\nMushu:  Yeah, yeah, [walking in a womanly fashion speaking in woman's voice] stand watch Mushu while I blow our secret with my stupid\ngirly habits. [back to normal] Humph, hygiene.\n\nCri-Kee [alarmed, tugging on Mushu's whiskers]:  Chirp, Chirp.\n\nYao:  Me first! Me first! Me First! [Yao, Ling and Chien-Po run by Mushu smacking him in the face with colored boxers]\n\nMushu [gasps]:  Ah.  We're doomed!  There a couple of things I know they're bound to notice!\n\n[Yao and Ling jump into the water.  Chien-Po dips in his toe to check temperature then jumps in causing a large wave.  Yao and Ling ride\nthe wave towards Mulan.  Mulan sees them and hides her face behind a lily pad]\n\nYao [calling]:  Hey, Ping.\n\n[Mulan peeks over the lily pad and spreads it on the water covering her chest]\n\nMulan [speaking nervously and unnaturally in a manly voice]:  Oh hi guys, I didn't know you were *here*. [Yao, Ling and Chien-Po share\n\"this boy is strange\" looks] I was just washing, so now I'm clean and I'm gonna go.  Bye, bye.  [Mulan hides behind a rock keeping her front\nfacing the rock]\n\nLing [from behind Mulan]:  Come back here.  I know we were jerks to you before so lets start over.  [extending his hand to shake hands with\nMulan]  Hi, I'm Ling!\n\nMulan [covering her chest with her left arm, she turns and shakes his hand with an outstretched right arm, smiling]:  Heh, heh.  [Mulan turns\nand wades away from Ling and runs into Chien-Po]\n\nChien-Po [taking a lily pad off his head]:  And I'm Chien-Po.\n\nMulan [waving slightly and smiling]:  Hello Chien-Po.\n\n[Yao stands on top of a rock looking down at the others.  Mulan looks down into the water and hides her eyes with her free hand]\n\nYao:  And I am Yao, king of the rock.  And there's nothin' you girls can do about it.\n\nLing [taking a fighting stance]:  Oh, yeah?  Well, I think Ping [elbowing Mulan] and I could take you.\n\nMulan [wading away]:  I really don't want to take him anywhere.\n\nLing [following Mulan]:  Ping, we have to fight!\n\nMulan:  No we don't. [unnaturally]  We could just close our eyes and swim around.\n\nLing: C'mon don't be such a g--Ouch!  Something bit me.\n\nMushu [popping out of the water between Mulan and Ling]:  What a nasty flavor.\n\nLing [with fear and gusto]:  Snake!  \n\nChien-Po [while all three of them climb up the rock and on each other]: Snake, snake.\n\n[Mulan whistles for Khan and wades back to shore.  Khan comes close enough to shore and Mulan hides behind Khan as she wraps a towel\naround her body]\n\n[Cut to Yao, Ling and Chien-Po calmed down sitting on the rock]\n\nLing:  Some king of the rock!  [Yao pushes him off the rock]\n\n[Cut to Mulan with towel wrapped around her]\n\nMulan:  Boy, that was close.\n\nMushu [brushing his teeth]:  No, that was vile!  You owe me big!\n\nMulan:  I never want to see a naked man again.  [the rest of the troops run by naked and jump into the lake]\n\nMushu:  Hey, don't look at me.  I ain't biting any more butts.\n\n[Cut to Mulan outside Chi Fu's Tent having dressed fully.  Chi Fu and Shang are talking from inside]\n\nChi Fu [fading in]:  You think your troops are ready to fight?  Hah!  They would not last a minute against the Huns.  \n\nShang:  They completed their training.\n\nChi Fu:  Those *boys* are no more fit to be soldiers than you are to be Captain.  Once the general reads my report, your troops will never\nsee battle.\n\nMushu [from outside the tent]:  Oh no you don't.  I've worked to hard to get Mulan into this war. [to Cri-Kee] This guy's messing with my\nplan.\n\nShang [grabbing onto the front of Chi Fu's clip board]:  We're not finished.\n\nChi Fu [pulling the board away]:  Be careful, Captain.  The General may be your father, but I am the Emperor's council.  And, oh, by the\nway, huh, I got that job on my own.  [opens the entrance to the tent for Shang] You're dismissed.\n\n[Shang storms out of the tent and starts to walk by Mulan]\n\nMulan [in a manly voice]:  Hey, I'll hold him and you punch, heh, heh...  [Shang walks by without reacting] or not.  [calling out to Shang] \nFor what it's worth, I think you're a great captain.  [Shang pauses to glance back, then continues forward]\n\nMushu [looking at Mulan's fixed gaze on Shang]:  I saw that!\n\nMulan [innocently]:  What?\n\nMushu [teasing]:  You like him don't you?\n\nMulan:  No, I--\n\nMushu:  Yeah right, Yeah sure.  Look,  [pointing to Mulan's tent] go to your tent.  [Mulan walks away with a look of delight. Mushu talks to\nCri-Kee]  I think it's time we took this war into our own hands [rubbing hands together].\n\n[Mushu and Cri-Kee wait outside Chi Fu's Tent.  Chi Fu emerges with carrying a scrub brush and wrapped in a towel and with big\nshowering slippers on his feet.  He whistles as he walks off.  Mushu and Cri-Kee enter his tent.  Cri-Kee uses his legs to write up a letter.  He\nfinishes and Mushu takes the paper]\n\nMushu:  Okay, okay, let me see what you've got.  From General Li, dear son, we're waiting for the huns at the pass and it would mean a lot\nif you'd come and back us up.  [sarcastically]  That's great except you forgot, \"and since we're all out of potpourri, maybe you wouldn't\nmind bringing up some.\"  Hellooooo, this is the army!  Make it sound more urgent, please!  You know what I'm talkin' about?  [Cri-Kee starts\nwriting the note again]  That's better, much better.  [taking the note] Okay, Let's go.\n\n[Cut to Khan drinking water from the trough.  Mushu is on his back]\n\nMushu:  Khan-ie baby, hey, we need a ride.  [Khan squirts Mushu off his back with water from his mouth]\n\n[Cut to Chi Fu walking out of the lake wrapped in a towel, sounds of laughter can be heart from the troops]\n\nChi Fu [muttering]:  Insubordinate ruffians.  [then calling to the troops]  You men owe me a new pair of slippers.  And I do not squeal like a\ngirl.  [a panda bear chomps down on the slipper Chi Fu is holding] Aaaaaahhhhhh!\n\nMushu [sitting on top of the panda bear behind a dummy of a soldier using sticks to gesticulate with the dummy's arms to push the note\ntowards Chi Fu.  Cri-Kee works the mouth]:  Urgent news from the general!  [Chi Fu looks over the panda]  What's the matter, you've never\nseen a 'black and white' before?\n\nChi Fu:  Who are you?\n\nMushu:  Excuse me!  I think the question is: who are you?  We're in a war man!  There's no time for stupid questions.  I should have your\nhat for that, [the panda starts walking forward] snatch it right off of your head [swiping with an arm at Chi Fu's hat.  Mushu turns the upper\nhalf of the dummy around after the panda passes Chi Fu.  Chi Fu begins reading the message].  But I'm feeling gracious today, so carry on\nbefore I report you.  [the panda walks up a tree taking Mushu and Cri-Kee with him out of sight]\n\nChi Fu [looking around for Mushu but not finding him, then runs into Shang's tent]:  Captain.  Urgent news from the General.  We're needed\nat the front.\n\nMushu [from up in the tree]:  Pack your bags Cri-Kee, we're movin' out.  [Cri-Kee high fives Mushu]\n\n[Song:  A Girl Worth Fighting For]\n\nArmy Chorus [troops walking up hill]:\nFor a long time we've been \nmarching off to battle\n\nYao [close-up of Yao, then a shot of 2 cows]: \nIn a thundering herd \nwe feel a lot like cattle\n\nCow [spoken]:  Moo\n\nArmy Chorus [showing troops marching]:\nLike the pounding beat \nour aching feet aren't \neasy to ignore\n\nLing [catching up to Yao and Chien-Po]:\nHey, think of instead,\nA girl worth fighting for [Yao, Ling and Chien-Po look upwards dreamily]\n\nMulan [spoken from behind]: Huh?\n\nLing [grabbing Mulan and drawing her close while pulling out a centerfold]:\nThat's what I said, a girl \nworth fighting for [Mulan runs away seeing the centerfold]\n\n[artistry section where the images are drawn like painted people.  Ling is seen looking at a woman and then kissing her]\nI want her paler than the \nmoon with eyes that \nshine like stars\n\nYao [lifting and lowering a woman over his head then opening his chest to show a gaping wound that we can see the woman through]:\nMy girl will marvel at \nmy strength, adore my \nbattle scars\n\nChien-Po [Chien-Po and a woman circle around then land on the edge of a large bowl of rice as a cow, pig and chicken fall beside them]:\nI couldn't care less what she'll \nwear or what she looks like\nIt all depends on what \nshe cooks like:\nBeef, pork, chicken... [end painted people section, the last image fades into statues that the troops just passed]\n\nAll Three:\nMmm...\n\nYao [looking at Mulan while crossing the river with swords over their heads.  Mulan looks disgusted and hurries forward]:\nBet the local girls thought \nyou were quite the charmer\n\nLing [with armor full of water to make him look muscular]:\nAnd I'll bet the ladies love \na man in armor [the water leaks out making Ling look like his normal self]\n\nArmy Chorus [Mushu whistles to ladies working in the rice field from out of the carriage holding cannons.  Cri-Kee looks shocked.  The\nladies look and giggle at Mulan who hides her face]:\nYou can guess what we \nhave missed the most \nsince we went off \nto war\nWhat do we want?\nA girl worth fighting for!\n\nYao [Mulan walks away from Yao and into Chien-Po]:\nMy girl will think I have \nno faults\n\nChien-Po:\nThat I'm a major find\n\nMulan [Caught between Yao, Ling, and Chien-Po who all look up dreamily waiting for her ideal woman.  She is forced to speak (sing)]:\n[spoken] Uh, [singing] How about a girl who's \ngot a brain,  [Yao starts to look unimpressed]\nWho always speaks her mind? [Mulan shrugs her shoulders]\n\nLing, Yao and Chien-Po [disdainfully, looking disappointed and disgusted]: Nah!\n\nLing [grabbing Mulan's shoulder and leaning on her, she takes his hand off and shakes her head disapprovingly.  Ling leans against the\ncarriage of cannons]:\nMy manly ways and turns of \nphrase are sure to thrill her\n\nYao [hitting Khan so that the carriage runs out from under Ling.  Ling looks upset then falls in the mud]:\nHe thinks he's such a \nlady-killer!\n\nChi Fu:\nI've a girl back home who's \nunlike any other.\n\nYao [aside to Mulan]:\nYeah, the only girl who'd \nlove him is his mother! [Mulan smiles]\n\nArmy Men [lining up locking arms across each others shoulders with Mulan in the middle to her discontent]:\nBut when we come home \nin victory they'll line up \nat the door!\n\nLing [sitting on top of Chien-Po]:\nWhat do we want?\n\nArmy Chorus:\nA girl worth fighting for!\n\nLing:\nWish that I had\n\nArmy Chorus [Mulan breaks away and walks in the opposite direction of the army]:\nA girl worth fighting for!\n(whistle) [Mulan sees Ling, Yao, and Chien-Po with snowballs about to pelt her so she turns around] \nA girl worth fighting--\n\n[All have stunned looks on their faces]\n\n[End Song]\n\n[Cut to ruins of a burned out village.  The soldiers walk through the singed gate and look around at the few planks that remain from the\nbuildings]\n\nShang [from mounted horse]:  Search for survivors.\n\n[Cut to Mulan walking around the burned-out village.  She finds a the doll that Shan-Yu was holding and looks up sorrowfully.  Shang\ncomes to her side]\n\nShang:  I don't understand.  My father should have been here.\n\nChi Fu [calling out from the top of a hill overlooking a valley]:  Captain!  \n\n[Chi Fu points down to the valley where the remains of General Li's army can be seen.  Flags poking up out of the snow, armor lying face\ndown, broken cannon carts.  Ling, Yao, Mulan, and a soldier have the look of horror on their faces as they look into the valley.  Chien-Po\nwalks up from the valley carrying a helmet]\n\nChien-po [handing the helmet to Shang]:  ...the General.\n\n[Shang takes the helmet and walks to the edge of the hill.  He draws his sword and stabs it into the snow upright.  He kneels down and\nplaces the helmet on top of the sword.  Mulan approaches him from behind]\n\nMulan [softly]:  I'm sorry.\n\n[Shang gets up, turns around and puts his hand on Mulan's shoulder and he walks by.  Shang walks to the center of the troops. He grabs his\nhorse by the saddle, takes one quick look of grief then mounts his horse]\n\nShang:  The Huns are moving quickly.  We'll make better time to the Imperial City through the Tung Shao Pass.  We're the only hope for the\nEmperor now.  Move out!\n\n[Mulan looks at the sword, takes out the doll she found and places the doll at the base of the sword.  She turns around and joins the rest of\nthe troops marching on]\n\n[Cut to Mulan standing next to Khan saddled to the cart with cannons.  A cannon blast shoots out of the cart and explodes in the air.  The\ntroops look surprised.  Mulan glances back with a scowl into the hole in the canopy of the cart to see Mushu with a sorrowful face.  Mushu\npoints at Cri-Kee.  Shang charges up to Mulan on his horse, Chi Fu right behind]\n\nShang [angrily]:  What happened?!\n\nMulan [stumbling]:  Uhhh--\n\nShang:  You just gave away our position.  Now we're--[an arrow hits Shang in the shoulder as he falls to the ground.  Shang pulls out the\narrow]  [calling out] Get out of range!!\n\n[The troops hurriedly run away as many arrows start falling all around them.  Mulan pulls Khan by the reins to hurry him up.  Fire arrows\nstart hitting the cart with cannons attached to Khan.  The cart begins to blaze with fire]\n\nShang:  Save the cannons!\n\n[The troops form a human chain and start taking the cannons out of the burning cart one by one while Mulan steadies Khan to keep him\nfrom bolting.  Chien-Po grabs many and hauls them on his own.  The troops grab]as many cannons as they safely can and Mulan cuts Khan\nfree from the cart.  She mounts Khan and charges away from the fire.  The cart explodes sending Mulan flying off Khan losing her helmet\nand sword which land near her.  Mushu and Cri-Kee, sent flying by the blast, scream and land near Mulan.\n\nMushu:  Oh sure, save the horse.\n\n[Mulan grabs Mushu with her right hand and grabs the sword with her left and runs to the troops position.  Cri-Kee and Khan follow.  Yao,\nLing, Chien-Po and other recruits set up cannons against rocks.  They dodge a set of arrows that fall around them]\n\nShang:  Fire!\n\n[They launch a volley at the mountain where the archers are stationed.  As the cannon fire explodes, Shan-Yu's army hides]\n\nShang:  Fire!\n\n[Mulan, Ling and Chien-Po launch a second volley at the mountain where the archers are stationed.  No more arrows can be seen coming\nfrom the mountain position]\n\nShang:  Hold the last cannon.  [Yao poised to light his cannon, pauses.  Shan-Yu and his troops appear at the top of the mountain]  Prepare\nto fight.  If we die, we die with honor.\n\n[Shan-Yu raises his sword high above his head and charges down the mountain at Shang's position.  His falcon flies off his shoulder on\nShan-Yu's war cry  The Hun army follows]\n\nShang:  Yao, aim the cannon at Shan-Yu.\n\n[The line of Shang's troops with Mulan at the end draw their swords.  Mulan looks down at her sword and sees the reflection of a large snow\nembankment hanging to the side of a cliff.  She rushes forward]\n\nYao [being pushed aside by Mulan as she grabs the cannon]:  Hey.\n \nShang:  Ping, come back.  Ping!\n\n[Mulan charges forward towards the oncoming horde of the Hun army being led by Shan-Yu and his falcon.  Mushu looks over her at the\noncoming horde with worry in his eyes]\n\nShang [starting to run after her waving his arms]:  Stop!\n\n[Mulan plants the cannon and aims it for the cliff with the snow overhang]\n\nMushu [seeing Shan-Yu riding closer to their position]:  All right, you might want to light that right about now.  Quickly!  Quickly!\n\n[Mulan takes out the flint and tries to light the fuse.  Shan-Yu's falcon swoops buy knocking Mulan down scattering the flint rock]\n\nYao [speaking to Ling and Chien-Po]:  C'mon, we've gotta help.  [they charge towards Mulan's position]\n\n[Mulan searches for the flint in the snow in vain.  She sees Mushu, grabs him and stretches him causing him to light the fuse.  Mushu lands\non the cannon and the cannon fires off just above the charging Shan-Yu]\n\nMushu [tailing off as he rides the cannon toward the snow embankment]:  You missed him!  How could you miss?  He was three feet in\nfront of you!\n\n[The cannon lodges in the snow and explodes causing the beginning of a large avalanche.  Mulan looks up with an evil grin on her face and\nShan-Yu watches in horror as many of his troops begin to be swallowed up by the snow]\n\nShan-Yu [recollecting himself and focusing in on Mulan]:  Yrrrrrrraah.  \n\n[Shan-Yu swipes at Mulan with his sword hitting her in the right side.  Mulan falls back grabbing her right side.  Shan-Yu's horse stumbles. \nMulan uses this break to bolt away from the avalanche.  Shan-Yu gains his composure and starts to gallop away from the avalanche on his\nhorse.  Shang looks with shock as hee sees the avalanche coming toward him.   Mulan grabs Shang as she passes by him, turning him\naround and helping him run away from the avalanche]\n\nYao, Chien-Po and Ling [running towards the oncoming avalanche]:  Yeeahhhhhh!  [they stop.  noticing the oncoming avalanche they  turn\naround and run back to where they came from]  Waaaaaaaaaa!\n\n[Khan jumps away from the troops position and starts to run towards Mulan passing Ling, Yao and Chien-Po. The avalanche swallows up\nShan-Yu and his horse.  Khan arrives at Mulan's position just ahead of the avalanche.  Mulan jumps onto Khan and reaches for Shang.  She\ngrabs his hand, then the avalanche rushes forth breaking their grip, turning Khan around facing the oncoming avalanche of snow]\n\n[Cut to Ling, Yao and Chien-Po standing behind a rock.  They see the snow approaching close and run to larger shelter where the rest of\nShang's army is positioned just as the avalance reaches their posision]\n\n[Cut to Mushu riding down the snow on a shield]\n\nMushu [calling out]:  Mulan!  Mulan!  [seeing hair sticking up from the snow] Mulan?  [Mushu picks up the Hun by the hair]\n\nHun Soldier:  Arrrrr.\n\nMushu [pushing the hun soldier back under the snow]:  Nope.  Mulan!  [Mushu picks up Cri-Kee out of the snow]  Man, you are one lucky\nbug.\n\n[Cut to Mulan riding Khan above the snow into the teeth of the avalanche.  Khan and Mulan are swept under by the snow and reemerge\nquickly.  She looks back and sees Shang passed out riding the wave of snow]\n\nMulan [calling loudly]:  Shang, Shang!  [Mulan turns around and rides to Shang's position.  She picks him up and places him on Khan.  She\nturns Khan around again to be riding upstream]\n\n[Cut to Chien-Po with Ling standing on him and Yao standing on top of Ling]\n\nChien-Po:  Do you see them?\n\nYao [extatically]:  Yes! [Yao shoots an arrow with a rope attached]  Perfect!  Now I'll pull them to safe--[Yao grasps at air as the rope\ncompletely passed through his hands]--ty.\n\n[Cut to Mulan and Shang on Khan with Mushu and Cri-Kee riding up to her on his shield]\n\nMushu [riding on the shield up to Mulan, Khan and Shang speaking loudly, above the noise of the avalanche]:  Hey Mulan, I found a lucky\ncricket.\n\nMulan [speaking loudly]:  We need help!  [Yao's arrow lands near by Mulan and she picks it up and starts to tie the rope to Khan]\n\nMushu [Getting off the shield and carrying Cri-Kee with him]:  Ooo, nice, very nice, you can sit by me.  [Mushu sees that they're about to fall\nover the cliff.  He and Cri-Kee look frightened] Ahhhhh!  We're gonna die!  We're gonna die!  I know we're gonna die!  No way we can\nsurvive this!  Death is coming! [Mulan knocks the arrow and shoots it toward Yao]\n\nYao [crying]:  I let them slip through my fingers. [Mulan's arrow lands in Yao's hands.  He grabs on and is pulled toward the cliff, the soldiers\ngrab onto Yao and hold him steady near the cliff edge with the rope taught over the cliff]\n\nYao:  Pull\n\n[Chien-Po prays as he calmly walks up to the group of soldiers.  He lifts them all up and pulls backward hauling Mulan, Shang, Khan, Mushu\nand Cri-Kee to safety]\n\nMushu:  I knew we could to it.  You da man. [Mulan looks pleased] Well sorta. [Mulan grimaces]\n\n[The soldiers help them up to the cliff]\n\nLing:  Step back guys, give 'em some air.\n\nShang [catching his breath]:  Ping, you are the craziest man I've ever met.  And for that I owe you my life.  From now on, you have my trust.\n[Mulan smiles big]\n\nLing:  Let's hear it for Ping!  The bravest of us all.\n\nYao [lifting his arm high]:  You're king of the mountain!\n\nChien-Po [jumping up and down]:  Yes, yes, yes!\n\nMulan [beginning to stand up]:  Ahhh, [she clutches her right side]\n\nShang:  Ping, what's wrong?  [Mulan removes her hand slightly to show the blood on her hand and seeping through the armour] [loudly] \nHe's wounded, get help!  [Ping starts to pass out.  The images of Shang, Yao, Ling, and Chien-Po begin to fade as she loses consciousness] \nPing, hold on.  Hold on.\n\n[Cut to outside of the medic tent.  Mulan and Medic are inside.  Shang stands by the entrance.  Yao, Ling and Chien-Po look quite\nconcerned.  Ling drums his fingers on his knees.  The medic comes out from the tent and whispers to Shang.  Shang looks astonished and\ngoes into the tent.  Mulan is lying down.  She opens her eyes, sees Shang and smiles at the sight of him.  She sits up allowing the blanket to\nfall to her waist revealing her form fitting bandages on her chest.  She sees Shang's surprised look and realizes her feminine form is\nnoticeable]\n\nMulan [gasping as she covers up]: Huh,  I can explain.\n\nChi Fu [stepping into the tent]:  Huh?  So it's true.\n\nMulan [calling after Shang as he steps out of the tent]:  Shang!\n\n[Cut to outside the tent.  Chi Fu hauls out Mulan by the arm.  Mulan uses her other hand to hold the blanket]\n\nChi Fu:  I knew there was something wrong with you.  [Chi Fu takes off Mulan's hair tie and throws her to the ground]  A woman.\n\n[Ling, Yao and Chien-Po are shocked]\n\nChi Fu [to the troops]:  Trecherous snake.\n\nMulan [on the ground kneeling and hunched over, speaking to Shang]:  My name is Mulan.  I did it to save my father.\n\nChi Fu [to the troops]:  High treason!\n\nMulan:  I didn't mean for it to go this far.\n\nChi Fu [getting in Mulan's face and speaking to her while she whinces]:  Ultimate dishonor.\n\nMulan:  It was the only way.  Please believe me.\n\nChi Fu [to Shang]:  Hmph, Captain?\n\n[Shang walks over to Khan and takes the sword out of the scabbard attached to Khan.  Khan rears back]\n\nChi Fu [to the soldier by Khan]:  Restrain him.\n\n[Shang walks toward Mulan with sword in hand]\n\nYao, Ling and Chien-Po [rushing toward Mulan]:  Noooooo!\n\nChi Fu [putting his hand to stop Ling, Yao, and Chien-Po from proceeding further]:  You know the law.\n\n[Shang stands over Mulan.  Mulan looks at Shang then bows her head in anticipation.  Shang lifts the sword high above his head and throws\nit down in front of Mulan]\n\nShang:  A life for a life.  My debt is repaid.  [turns and walks towards the Imperial City]  Move out!\n\nChi Fu [coming up to Shang's face]:  But you can't just...\n\nShang [getting in Chi Fu's face]:  I said, \"Move out!\"\n\n[The troops walk off toward the Imperial City leaving Mulan behind with Khan, Cri-Kee, and Mushu.  Mulan is sitting, shivering. Khan takes\nhis blanket and wraps it around Mulan with his mouth and sits behind her.  Cri-Kee lights a fire with twigs.  When he doesn't get warm, he\nmoves under the blanket wrapped around Mulan.  Mushu walks toward Mulan carrying a stick]\n\nMushu:  I was this close, this close to impressing the ancestors, getting the top shelf, an entourage.  Man, all my fine work, ffft.  [Mushu picks\nup a dumpling with his stick, slumps down in front of the fire Cri-Kee made and begins to cook the dumpling over the fire] [glancing up] Hi.\n\nMulan [look of sadness]:  I should never have left home.\n\nMushu:  Eh, come on, you wanted to save your father's life.  Who knew you'd end up shaming him, disgracing your ancestors, and losing all\nyour friends.  You know, you just gotta, you gotta learn to let these things go [looking as if he's about to cry].\n\nMulan:  Maybe I didn't go for my father.  Maybe what I really wanted was to prove I could do things right.  So when I looked in the mirror\n[picking up her helmet and looking at her reflection in her helmet] I'd see someone worthwhile.  But I was wrong.  I see nothing.  [throws the\nhelmet down and a tear runs down her cheek]\n\nMushu [picking up the helmet and spitting on it]:  Well that's because this just needs a little spit, that's all.  Let me shine this up for ya [wiping\nthe spit to clean the helmet and holding it up to Mulan].   I can see you, look at you, you look so pretty.  [seeing Mulan is not cheered up by\nhis actions, he shows sorrow on his face]  The truth is we're both frauds.  Your ancestors never sent me, they don't even like me.  I mean,\nyou risked your life to help people you love.  I risked your life to help myself.  At least you had good intentions  [Mulan smiles].\n\nCri-Kee [jumping on top of the helmet beginning to bawl]:  Chirp, Chirp, Chirp.  Bawl, Bawl.\n\nMushu:  What!?  What do you mean you're not lucky?  You lied to me?  [Cri-Kee nods] [to Khan]  And what are you? A sheep?\n\nMulan [sadly]:  I'll have to face my father sooner or later.  Let's go home.\n\nMushu:  Yeah, this ain't gonna be pretty.  But, don't you worry, 'kay?  Things'll work out.  We started this thing together and that's how we'll\nfinish. [Mushu hugs Mulan.  Mulan smiles]  I promise.\n\n[Cut to Shan-Yu's falcon flying over the avalanche site.  Shan-Yu's hand pops out of the snow.  He gets up and glances around]\n\nShan-Yu [screaming]:  Rrrrrrraaaaaaaaahhh!\n\n[Hun Archer, Long-Hair Hun Man, Hun Strong Guy, Hun Bald Man #1, and Hun Bald Man #2 each pop out of the snow and join\nShan-Yu.  They set off towards the Imperial City]\n\nMulan [seeing them from behind, gasps]:  Huh.  [Mulan runs, grabs her sword, mounts Khan, and heads out following the Huns to the\nImperial City]\n\nMushu:  Home is that way! [points to the opposite direction Mulan is heading]\n\nMulan:  I have to do something.\n\nMushu:  Did you see those Huns!?  They popped out of the snow, like daisies!\n\nMulan:  Are we in this together or not?\n\nCri-Kee [emphatically]:  Chirp, Chirp.\n\nMushu:  Well, let's go kick some Huny buns!  [Jumps onto Khan and utters fighting words as they ride off to the Imperial City]  Wu Hu Ha\nGa, Wu Hu Ha Ga\n\n[Cut to the victory parade in the Imperial City.  Fireworks go off, kites are flying.  The drummers march by, followed by the flutist, followed\nby the acrobats.  The Parade Leader follows, then Shang and his men, followed by lion dancers]\n\nParade Leader:  Make way for the heros of China.\n\n[Shang leads the men on horseback, all have sorrowful looks on their faces.  Mulan rides up through the crowd and stops.  She looks around\nand sees Shang in the parade]\n\nMulan [calling out]:  Shang! [riding next to him]\n\nShang [surprised]:  Mulan?\n\nMulan:  The Huns are alive, they're in the city.\n\nShang:  You don't belong here Mulan, go home.\n\nMulan [with a scowl rides khan to the other side of Shang]:  Shang, I saw them in the mountains.  You have to believe me.\n\nShang:  Why should I?\n\nMulan [riding ahead to block Shang's horse]:  Why else would I come back?  You said you'd trust Ping.  Why is Mulan any different?\n\n[Shang turns his horse and rides around Mulan and goes forward]\n\nMulan [to Yao, Chien-Po and Ling]:  Keep your eyes open.  I know they're here.  Hya.\n\n[Mulan rides off and stops near the entrance to the palace, she dismounts Khan and runs into the palace yard]\n\nMushu:  Now where are you going?\n\nMulan [calling over her shoulder]:  To find someone who will believe me.  [Mulan runs into the palace yard]  \n\n[Cut to the parade procession stopping in front of the Emperor on the steps of the palace.  Chi Fu stands next to Shang and gives him\nShan-Yu's sword.  The Lion dancers stop behind Shang.  A palace man strikes a large gong and the people fall silent]\n\nEmperor:  My children, heaven smiles down upon the Middle Kingdom.  China will sleep safely tonight thanks to our brave warriors.\n\n[The crowd cheers]\n\n[Cut to Mulan at the fringe of the crowd]\n\nMulan [approaching Man #1 laying her hand on his shoulder]:  Sir, the Emperor's in danger! [Man #1 rips his shoulder away from Mulan's\ntouch and moves away] [agitated]  But the Huns are here!  [Mulan walks up to Man #2]  Please, you have to help me.  [Man #2 walks\naway from Mulan] [turning to Mushu who is standing near her in the yard]  No one will listen!\n\nMushu:  Huh?  Oh, I'm sorry, did you say something?\n\nMulan [irritatedly]:  Mushu!\n\nMushu:  Hey, you're a girl again, remember?\n\n[Cut to Shang holding the sword before the Emperor]\n\nShang [kneeling down giving the sword to the Emperor]:  Your Majesty, I present to you the sword of Shan-Yu.\n\nEmperor:  I know what this means to you, Captain Li.  Your father would have been very proud.\n\n[Shan-Yu's falcon swoops down and takes the sword as Shang is giving it to the Emperor.  The falcon rises above the roof and drops the\nsword to Shan-Yu who was sitting next to the gargoyles in the shadows blending in.  He rises out of the shadows to catch the sword so that\nall the people can see his face.  The masses of people gasp at the sight of Shan-Yu.  Shang begins to draw his sword.  All 5 of Shan-Yu's\nmen jump out from behind the dragon knocking down Shang and grab the Emperor knocking off his hat.  Hun Bald Man #1 and #2 carry\nthe Emperor into the Palace.  Long-Haired Hun Man and Hun Strong Guy close the palace doors as Hun archer knocks his arrow retreating\ninto the Palace to threaten would be rescue attempts]\n\nShang [getting up and running toward the closing doors]:  No.\n\nYao [beckoning to the other soldiers]:  C'mon.\n\n[Shang reaches the palace doors just as they close with all the Huns inside]\n\nShan-Yu [laughs evily]:  Ha, Ha, Ha, Ha, Ha, Ha.\n\n[Shang and his soldiers pick up a big stone statue and use it as a battering ram.  They are unsuccessful at opening the door.  Mulan sees\nwhat's going on and arrives at the steps]\n\nMulan [to herself]:  They'll never reach the Emperor in time.  [She looks at the columns and runs near to the Shang and his soldiers.  She\nwhistles loudly catching the soldiers' attention]  Hey guys, I've got an idea.  [Mulan runs around the palace to the right towards the columns]\n\n[Song:  I'll Make a Man Out of You (reprise) plays in the background during the next action sequence]\n\n(Be a man) \nWe must be swift as \nthe coursing river\n(Be a man)\nWith all the force \nof a great typhoon\n(Be a man)\nWith all the strength \nof a raging fire\nMysterious as the \ndark side of the moon\n\n[Yao, Ping and Chien-Po look at one another then drop the statue and follow Mulan.  Shang looks astonished.  Around the corner Yao, Ling\nand Chien-Po begin to take off their armor and dress as women.  Once the transformation is complete, they take out their sashes and\nprepare to shimmy up the columns.  Shang arrives and taps Mulan on the shoulder.  He takes off his cape and wraps it around the column\nto signify that he's coming along.  They shimmy up the poles together]\n\n[End song]\n\n[Cut to Hun Bald Man #1 and #2 arriving with the Emperor and a high balcony within the palace.  Shan-Yu drops down from the roof]\n\nShan-Yu:  Boo.  [Shan-Yu steps into the balcony next to the Emperor] [to Hun Bald Man #1 and #2] Guard the door [they walk off down\nthe stairs that lead to the balcony].  [pacing around the Emperor]  Your walls and armies have fallen, and now it's your turn.  Bow to me.\n\n[Cut to the entrance to the stairwell that leads to the balcony.  Hun Bald Man #1 and #2 come down the stairs and close the door, joining\nHun Archer Man, Hun Strong Man and Hun Long-Hair Man.  Mulan and company are around the corner]\n\nMulan [whispering]:  Okay, any questions?\n\nYao [whispering]:  Does this dress make me look fat? [Mulan slaps him]  Ow.\n\n[Mulan, Yao, Ling and Chien-Po walk out smiling, giggling and trying to act lady-like including holding fans and waving fans]\n\nHun Archer:  Who's there?\n\nHun Bald Man #2 [putting down Hun Bald Man #1's sword]:  Concubines.\n\nHun Bald Man #1:  Ugly concubines.\n\nLing [waving daintily, speaking to Yao]:  Oh he's so cute.\n\n[Hun Bald Man #2 smiles and waves back.  Hun Bald Man #1 elbows Hun Bald Man #2.  A bitten apple falls out from beneath Ling's\ndress.  He pulls the dress out and turns so as not to expose the loss of figure]\n\nShang [from around the corner putting his head down into his hand]:  Aww.\n\n[Shan-Yu's Falcon sees Shang and starts to squawk.  Mushu from above singes off all his feathers with his fire breathing]\n\nMushu [to Cri-Kee sitting above him]:  Now that's what I call Mongolian Barbeque.  [Cri-Kee rolls on his back in laughter.  The stunned\nfalcon doesn't do anything]\n\n[Hun Bald Man #2 picks up the apple and offers it back to Ling.  Ling, Yao, and Chien-Po pull out the fruit they were using to simulate a\nwoman's chest.  Chien-Po takes his watermelons and smashes them on the heads of Hun Bald Man #1 and #2.  He then smashes their two\nheads together and they fall to the ground.  Ling pushes the apple into Hun Long-Hair man's mouth and kicks him in the stomach causing\nHun Long-Hair Man to stoop over on the ground.  Ling uses his head to crack Hun Long-Hair Man's back.  Hun Strong Guy lunges his fist\nat Yao and misses, he misses with the other.  Yao grabs the outstretched arm and flips him over onto his head. Mulan kicks away Hun\nArcher Man's bow and knocked arrow, avoids his strike by turning her back to Hun Archer.  She follows with a left elbow to the stomach\nfollowed by a left upper cut knocking Hun Archer to the ground.  She sits on his back and uses the bow to pull his head back]\n\nMulan [calling out]:  Shang, GO!\n\n[Shang runs out from behind the corner, charges through the door and runs up the stairs]\n\n[Cut to Shan-Yu and the Emperor on the balcony]\n\nShan-Yu:  I tire of your arrogance old man.  [yelling and putting his sword at the emperor's\nthroat] Bow to me!\n\nEmperor:  No matter how the wind howls, the mountain cannot bow to it.\n\nShan-Yu:  Then you will kneel in pieces. [Shan-Yu draws back his sword to strike the Emperor]\n\n[Shang runs up in time to block the striking blow of Shan-Yu with his sword.  Shang swipes with\nhis sword.  Shan-Yu grabs Shang's arm and throws him towards the edge.  Shang grabs onto a column\nand he flies over the edge and uses the momentum to swing back and kick Shan-Yu.  Shan-Yu falls\nto the ground, Shang on top of him. Shang punches Shan-Yu.  Shan-Yu grabs Shang and rolls over\nforcing Shang to be on his back underneath him.  Shang uses his knee to hit Shan-Yu from behind\nas he uses his hand to hit him in the head.  Shang forces Shan-Yu onto his back and grabs his arm\npulling it behind Shan-Yu's back.  Mulan, Chien-Po, Yao and Ling enter the balcony from the\nstairs]\n\nMulan:  Chien-Po, get the Emperor.\n\nChien-Po [standing in front of the Emperor and bowing]:  Sorry, your Majesty.  \n\n[Chien-Po lifts up the Emperor and runs over to Mulan who is by a rope attached to a column in\nthe balcony.  Chien-Po uses his sash as a pulley and rides down the rope to the ground.  Shan Yu\nwatches the Emperor leave]\n\nShan-Yu:  No! \n\n [Shan-Yu uses his free arm to elbow Shang in the face.  Shan-Yu gets up and head-butts Shang and\nthrows him to the ground.  Shang lies limp.  Mulan watches Shang fall then she looks over the\nedge at Ling and Yao now on the ground.  Chien-Po runs off the screen out of sight]\n\nYao [motioning her to follow]:  Come on!\n\n[Mulan looks down at Shang with a worried look.  Shan-Yu begins to approach Mulan and the rope. \nMulan looks at the approaching Shan-Yu and then down to spy his sword. Thinking quickly, Mulan grabs\nShan-Yu's sword and cuts the taught rope.  Shan-Yu reaches the edge and grabs for the falling rope unsuccessfully as Mulan leaves the\nsword embedded in the column and runs to Shang's position.  The crowd cheers]\n\nShan-Yu:  No!  [He looks down at the crowd and realizes he cannot find the Emperor among the\nthrong of people]  Yrraaaaahhhh!\n\n[Shan-Yu turns and looks back and sees Mulan looking concerned, holding up Shang.  Shan-Yu pulls\nout his sword lodged in the column and heads toward them.  As Shang sees Shan-Yu approaching, he\nputs his arm in front of Mulan to ask her to leave and takes out his knife.  Mulan slides away. \nShan-Yu comes up to Shang, knocks away his knife, slaps him in the face, and grabs Shang by the\nshirt collar]\n\nShan-Yu [in Shang's face]:  You, you took away my victory.\n\n[Mulan's shoe hits Shan-Yu in the head and bounces back to her feet.  Shan-Yu turns toward Mulan]\n\nMulan:  No!  I did!  [Mulan pulls her hair back to look like she did when she was a soldier]\n\nShan-Yu [looking at Mulan]:  The soldier from the mountains.\n\n[Shan-Yu drops Shang and starts after Mulan as she puts on her shoe and runs down the stairs and\nthrough the doors to the balcony.  She closes the door with the latch falling in place right\nbehind her.  She leans against the doors.  Shan-Yu punches a hole in one door with his fist. \nMulan runs away from the doors down the corridor.  Mushu riding Shan-Yu's falcon like a horse\ncatches up with Mulan]\n\nMushu:  So what's the plan?\n\nMulan:  Ummmm.\n\nMushu:  You don't have a plan?!\n\nMulan:  Hey, I'm making this up as I...[looks out a window and spies the firework tower] go. \nMushu--\n\nMushu:  I'm way ahead of you sister.  C'mon Cri-Kee. [Mushu and Cri-Kee jump onto a kite and use\nthe wings to soar over toward the fireworks tower]\n\n[Cut to Shan-Yu.  Shan-Yu breaks through the doors and catches up to Mulan swinging his sword\nwildly knocking down a support column with every swipe.  Mulan runs and ducks his every blow. \nMulan climbs up a column to get out of Shan-Yu's reach.  Shan-Yu slices the base of the column\ncausing it to fall and break through the outer wall.  Mulan screams as the beam falls and comes\nto a stop.  Mulan gets up on the beam and jumps up to catch onto the awning.  She looks off to\nher right and spies Mushu arriving at the fireworks tower]\n\n[Zoom in on the fireworks tower.  Mushu lands near Barry Cook and Tony Bancroft (the firework\nlighters) on the edge of the tower] \n\nMushu:  Citizens, I need firepower.\n\nBarry Cook:  Who are you?\n\nMushu [Mushu (using the wings from the kite) and Cri-Kee with wings spread like batman]:  You're\nworst nightmare.\n\n[Barry Cook and Tony Bancroft jump off the tower and plunge toward the ground]\n\n[Cut to Mulan. She pulls herself onto the roof and climbs up to the crest]\n\nMan in Crowd #1:  On the roof.\n\nMan in Crowd #2:  Look!\n\n[Mulan lines up where she is standing with the fireworks tower across the way.  Shan-Yu breaks\nthrough the roof behind Mulan surprising her.  Mulan backs away and searches for something on her\nperson to help her against Shan-Yu.  She finds a her fan, takes it out, and opens it]\n\nShan-Yu:  It looks like you're out of ideas.\n\n[Shan-Yu lunges with his sword.  Mulan dodges to her right and lets the sword go right through\nthe fan.  She closes the fan back up on the sword and twists the fan with both hands so that\nShan-Yu loses his grip.  The sword flies toward Mulan and she catches it by the handle slipping\noff the fan with her sword movement]\n\nMulan:  Not quite.  [calling out]  Ready, Mushu?\n\nMushu [behind Shan-Yu tied to a large rocket firework]:  I am ready, baby. [He blows fire onto a\nstick and hands the stick to Cri-Kee who's standing on the firework]  Light me!  [Cri-Kee lights\nthe fuse]\n\n[Shan-Yu approaches Mulan.  Using the sword as a lever, Mulan lunges at Shan-Yu kicking him in\nthe face then sweep kicks him and he falls to the ground.  Mulan picks the sword back up and\nstabs it into Shan-Yu's cape.  The rocket on Mushu ignites and hurls him toward Shan-Yu.  Mulan\nlies flat down on the left side of the roof.  Shan-Yu sees the approaching rocket and tries to\nrun, but the sword has him pinned to the spot.  The rocket hits Shan-Yu square in the belly\npropelling him toward the firework tower.  Mushu grabbed onto the sword as he went by letting the\nrocket do the work.  Cri-Kee hangs on to Mushu's tail.  Mulan jumps back up to the crest of the\nroof and runs away from the fireworks tower grabbing Mushu and Cri-Kee off the sword]\n\nMulan [while running]:  Get off the roof, get off the roof, get off the roof.\n\n[The rocket rides Shan-Yu into the fireworks tower causing masses of explosions and fireworks to\nfly everywhere.  Mulan jumps near the edge of the roof.  Propelled by the explosion, she grabs\nonto a lantern that is hanging on a taught rope and starts to slide down.  She looks down and\nreleases her grip so that she lands on the back of Shang causing the two of them to fall to the\nground.  Shan-Yu's sword follows and lands on the ground near by]\n\nMushu [landing and flying backwards on his butt a couple of times pointing at the fireworks]:  Ah\nha ha ha ha.  [Mushu's catches Cri-Kee with antenna on fire as Cri-Kee falls toward him] [to\nCri-Kee]  You are a lucky bug. [Mushu pinches out the fire on Cri-Kee's antenna]\n\nChi Fu [walking down the stairs in a tattered outfit and slightly burned]:  That was a deliberate\nattempt on my life.  Where is she?  Now she's done it.  What a mess.  [Shang and troops push\nMulan behind them to protect her] [to Shang] Stand aside, that creature's not worth protecting.\n\nShang [in Chi Fu's face]:  She's a hero.\n\nChi Fu:  'Tis a woman.  She will never be worth anything.\n\nShang [grabbing Chi Fu by the shirt collar]:  Listen, you pompous--\n\nEmperor [walking down the steps]:  That is enough!\n\nShang:  Your Majesty, I can explain.\n\n[The Emperor motions for Shang to stand aside.  Shang and his men part giving the Emperor a clear\npath to Mulan.  Mulan steps forward and bows before the Emperor.  Chi Fu with a sinister look\nwaits to write down the words of the Emperor]\n\nEmperor:  I've heard a great deal about you, Fa Mulan.  You stole your father's armor, ran away\nfrom home, impersonated a soldier, deceived your commanding officer, dishonored the Chinese army,\ndestroyed my palace, AND...you have saved us all.  [the Emperor bows to Mulan]\n\n[Chi Fu looks at the Emperor actions astonishingly then immediately falls prostrate before Mulan. \nShang, Yao, Ling, and Chien-Po follow suit.  Mulan looks up then turns around hardly believing\nwhat she sees as the entire Chinese population within the palace grounds fall prostrate on the\nground in a wave like pattern, bowing to her.  Khan bows with Mushu and Cri-Kee on his back]\n\nMushu:  My little baby's all grown up and savin' China.  [to Cri-Kee] You have a tissue?\n\nEmperor:  Chi Fu,\n\nChi Fu:  Your Excellency?\n\nEmperor:  See to it that this woman is made a member of my council.\n\nChi Fu [muttering to himself]:  A member of your coun...[realizing what the Emperor has said]\nwhat? [stutters] But there are no council positions open, your Majesty.\n\nEmperor [to Mulan]:  Very well then, you can have his job [pointing out Chi Fu].\n\nChi Fu [wobbling to and fro]:  What?...My...[faints]\n\nMulan [smiles big then turns to the Emperor and bows]:  With all due respect, your Excellency.  I\nhave been away from home long enough.\n\nEmperor [taking off his pendant]:  Then take this, so your family will know what you have done\nfor me.  And this [handing her the sword of Shan-Yu]  so the world will know what you have done\nfor China.\n\n[Mulan takes the gifts and hugs the Emperor]\n\nYao:  Is she allowed to do that?  [Shang, Ling, and Chien-Po shrug]\n\n[Mulan walks away from the Emperor and is embraced by Yao and Ling.  Chien-Po comes up and lifts\nall three of them off the ground in a big bear hug.  Chien-Po lets them all back to the ground\nagain.  Mulan walks toward Shang and stops in front of him.  As Shang begins to speak Mulan\nstarts to smile anticipating something good]\n\nShang:  Um...[Mulan grins]  You... [Mulan smiles] You fight good.\n\nMulan [smile turning into disappointment]:  Oh, thank you.  [Mulan walks toward Khan]\n\nShang: [turning toward Mulan and grunts with disappointment in himself]:  Hmm.\n\n[Mulan mounts Khan]\n\nMulan:  Khan, let's go home.\n\n[Khan jumps down the steps and gallops on the flat parts of the stair case back down to ground\nlevel.  The crowd cheers al the while.  The Emperor approaches Shang and clears his throat]\n\nEmperor [to Shang]:  The flower that blooms in adversity is the most rare and beautiful of all.\n\nShang [dumbfounded]:  Sir?\n\nEmperor:  You don't meet a girl like that ev'ry dynasty.  [The emperor puts on his hat and walks\nback up the steps to his palace]\n\n[Cut to Mulan's home, her father is sitting beneath the blossom tree.   A blossom falls and lands\non his leg.  Mulan appears at the threshold and moves toward her father.  Fa Zhou sees her\napproaching and starts to stand]\n\nFa Zhou:  Mulan.  \n\n[Mulan quickly moves in front of her father and kneels causing him to sit back down]\n\nMulan:  Father, I brought you the sword of Shan-Yu [hands the sword to Fa Zhou] and the crest of\nthe Emperor [hands the crest to Fa Zhou].  [with head bowed] They're gifts to honor the Fa\nFamily.\n\n[Fa Zhou takes the gifts and throws them down to the ground beside him to the surprise of Mulan. \nHe bends down and holds her arms outstretched]\n\nFa Zhou:  The greatest gift and honor, is having you for a daughter.  [Fa Zhou wipes away Mulan's\ntear then hugs Mulan]  I've missed you so.\n\nMulan:  I've missed you too Baba.\n\n[Fa li and Grandma Fa watch from the doorway]\n\nFa Li [sighing]:  Ahhhhh\n\nGrandma Fa:  Great, she brings home a sword.  If you ask me she should have brought home a\nma--[leaving her mouth open when she sees Shang]\n\nShang [just arriving]:  Excuse me, does Fa Mulan live here?\n\n[Grandma Fa's mouth stays open as she and Fa Li point toward Mulan's position.  Shang walks\ntoward Mulan and Fa Zhou]\n\nGrandma Fa:  Woo, sign me up for the next war.\n\n[Shang approaches seeing Fa Zhou]\n\nShang [bows before Fa Zhou and speaks confidently]:  Honorable Fa Zhou I--Mulan [Mulan steps up. \nShang sees her and speaks insecurely] Uh...Uh...You forgot your helmet.  Ah but well, actually\nit's your helmet, isn't it?...[handing the helmet toward Fa Zhou] I mean...\n\n[Fa Zhou motions with his head for Mulan to take over.  Mulan holds the helmet Shang offers]\n\nMulan:  Would you like to stay for dinner?\n\nGrandma Fa [speaking from stage right]:  Would you like to stay forever? [Mulan shakes her head with a\nsmile at Grandma Fa's statement]\n\nShang [reassuredly to Mulan]:  Dinner would be great.\n\n[Cut to First Ancestor grinning happily looking at the scene through the temple window.  He watches Mulan hand the helmet back to Fa\nZhou.  Mushu climbs up to the window sill by First Ancestor's his head]\n\nMushu [tugging on First Ancestor's ear]:  C'mon, who did a good job?  C'mon, tell me who did a\ngood job.\n\nFirst Ancestor [hesitantly]:  Oh, all right.  You can be a guardian again.\n\nMushu: Yeeeeeahhhhhhh.  [Mushu runs to his post and Cri-Kee bangs the gong awakening all the\nancestors]\n\nMushu:  Take it Cri-Kee.\n\n[Song:  True to Your Heart -- No characters sing in the song]\n\n[Ancestor 1 does a dance from Pulp Fiction while Ancestor 3 does the Hand Jive]\n\nAncestor 3 [spoken to Ancestor 1]:  She get's it from my side of the family.\n\nMushu [spoken while swinging on a chain]:  Call out for egg rolls!\n\nFirst Ancestor [disgusted]:  Guardians.\n\n[Mushu lands on the steps outside the temple.  Mulan walks up to him and rests besides him on the\nsteps]\n\nMulan:  Thanks, Mushu [kisses Mushu on the forehead].\n\nLittle Brother:  Bark, bark, bark, bark, bark, bark, bark  \n\n[Little brother runs up the steps and into the temple with the bag of grain tied to him.  The\nchickens follow him in]\n\nFirst Ancestor [annoyed]:  Mushu!\n\n[Roll Credits]\n\n[The End]\n\n\n\n\n\nMulan\nWriters :   Robert D. San Souci\nGenres :   Family  Animation  Comedy  Musical  Adventure\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:31:47.116984"}