{"title": "Mulholland Drive", "film_link": "/Movie Scripts/Mulholland Drive Script.html", "script_link": "/scripts/Mulholland-Drive.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Mulholland Drive Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Mulholland Drive Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (9.71 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=David Lynch\" title=\"Scripts by David Lynch\">David Lynch</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a><br/>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : January 1999<br/>\n<br/>\n<a href=\"/scripts/Mulholland-Drive.html\">Read \"Mulholland Drive\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>Mulholland Drive Screenplay</title>\n\n<pre>\n\n<b>\t\t\tM  U  L  H  O  L  L  A  N  D\n</b>\n<b>\t\t\t\tD  R  I  V  E    \n</b>\n\n\n\n\n\n\n\n\n\n\n\n<b>\t\t\t\t 1/5/1999\n</b><b>    \n</b>\n\n\n\n<b>\t\tM U L H 0 L L A N D             D R I V E\n</b><b>    \n</b>\n<b>EXT.  NIGHT - HOLLYWOOD HILLS, LOS ANGELES\n</b><b>    \n</b>Darkness. Distant sounds of freeway traffic. Then the closer\nsound of a car - its headlights illumine an oleander bush and\nthe limbs of an Eucalyptus tree. Then the headlights turn - a\nstreet sign is suddenly brightly lit. The words on the sign\nread... \"Mulholland Drive.\" The car moves under the sign as\nit turns and the words fall once again into darkness.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. NIGHT - MULHOLLAND DRIVE\n</b><b>    \n</b>Gliding we follow the car - an older black Cadillac limousine\n- as it winds its way up Mulholland Drive through the\ndarkness of the Hollywood Hills. There is no one else on the\nroad. As we drift closer to the car...\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. BLACK CADILLAC LIMOUSINE - NIGHT\n</b><b>    \n</b>Two men in dark suits are sitting in the front seat. A\nbeautiful, younger, dark-haired woman sits in back. She sits\nclose up against the door and stares out into the darkness.\nShe seems to be thinking about something. Suddenly she turns\nand looks ahead. The car is slowing and moving off to the\nside of the road.\n<b>    \n</b><b>\t\t\t\tDARK-HAIRED WOMAN\n</b>\t\tWhat are you doing? You don't stop\n\t\there ...\n<b>    \n</b>The car stops - half on, half off the road at a dark, blind\ncurve. Both men turn to the woman.\n<b>    \n</b><b>\t\t\t\tDRIVER\n</b>\t\tGet out of the car.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT.  FURTHER UP MULHOLLAND DRIVE - NIGHT\n</b><b>    \n</b>Two cars - a convertible and a late model sedan are drag\nracing toward the blind curve blocking the view of the\nCadillac limousine. The cars are filled with crazed\nteenagers. Two girls are standing up through the sunroof of\nthe sedan screaming as their hair is whipped straight back.\n<b>    \n</b>\n<b>    \n</b>The cars are travelling so fast that they seem to almost\nfloat as they fly with psychotic speed down both lanes of\nMulholland Drive.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. EXT. - CADILLAC LIMOUSINE\n</b><b>    \n</b>The driver, still in his seat, has a pistol with a silencer\nattached pointing at the woman. The other man is getting out\nof the car. The woman is clutching the seat and the door\nhandle as if trying to anchor herself. She is visibly afraid.\nThe man who got out of the car tries the woman's door, but it\nis locked. He smiles as he reaches in through the front door\nand unlocks her door. He opens her door. As he reaches for\nher, the woman's face becomes flooded with light. Her eyes\ndart to the front windshield. The driver, flooded with light,\nturns just as the late model sedan slams into the Cadillac\nlimousine. There is an explosion of metal and glass amidst\nthunderous tearing sounds as the two cars become one in\ndeath. The convertible screams past with hardly a notice.\nThe driver of the limousine dies instantly as his body is\njettisoned through the windshield. The other man is torn as\nthe cars screech over him. The woman is brutally thrown into\nthe back of the front seats as a cloud of dust and flying\nrocks engulfs her. The disastrous moving sculpture of the two\ncars wants to climb up the hill, then stops and slides back\ntoward the road The Cadillac tips onto its side. Then all is\nsilent. A fire erupts in the sedan and as the dust clears we\nsee the woman appear, then crawl out of the Cadillac to the\nroad. Her face is vacant. There is a bleeding cut just above\nher forehead. She stands for a moment clutching her purse -\nlost , then begins to walk as if in a trance across\nMulholland down through the bushes and into darkness.\n\n<b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>EXT. HOLLYWOOD HILLS - LATER - NIGHT\n</b><b>    \n</b>The woman slides down a hill through tangles of hostile\ndesert plants. Sirens can be heard in the distance. She\ncrosses through some trees and is suddenly confronted by a\ncoyote which snarls and leaps at her. She screams and strikes\nout with her purse in self defense. The coyote backs away -\nsnarling. The woman then loses control and runs at the coyote\nand it races off. She falls to the ground. We can hear the\nthunder of her heartbeat as the sirens grow louder. She gets\nup and stumbles through the trees. When she clears them she\nis standing overlooking all of Los Angeles glowing down\nbelow. She clumsily starts down toward it.\n<b>   \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>HOLLYWOOD STREETS - LATER - NIGHT\n</b><b>    \n</b>The woman slides down a dusty hill and finds herself at\nFranklin Avenue. A car races by and its headlights flare on\nher face. Her expression shows fear and panic. She doesn't\nknow where she is or where to go. She runs frantically across\nthe street. She moves quickly to a sidewalk which takes her\ninto a residential area.\n<b>    \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>EXT. HOLLYWOOD STREETS - LATER - NIGHT\n</b><b>    \n</b>The woman crosses Sunset Boulevard. Coming up Sunset in the\ndistance is a police car with its sirens and lights going.\nShe hurries into the darkness of another residential area. A\ncar turns onto the street and comes toward her. She\ninstinctively moves behind a tree until it passes.\n<b>  \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>EXT. HOLLYWOOD STREETS - LATER - NIGHT\n</b><b>    \n</b>As if being hunted in a foreign land the woman moves\ndesperately down another residential street. A drunken couple\nround the corner up ahead and start up the sidewalk toward\nher. She runs off the sidewalk and into the bushes in front\nof an apartment building. The couple passes by without\nnoticing her. Feeling safe in these bushes her exhaustion\novertakes her and she lays her head down to sleep.\n<b>   \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>EXT.  MULHOLLAND DRIVE   - NIGHT\n</b><b>    \n</b>Police, paramedics surround the wreckage. Two detectives,\nHARRY MCKNIGHT and NEAL DOMGAARD (both mid 40's to 50), stare\nat the remains of the two cars glowing white hot under the\ncrime scene lights. A coroner's van pulls out just after an\nambulance. The ambulance's siren begins to wail as it speeds\noff. The coroner's van cruises slowly. Detective Harry\nMcKnight and Detective Neal Domgaard continue staring. They\ndo not look at each other. They are each motionless for a\nlong moment.\n<b>  \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tYou feel it?\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tYeah.\n<b>    \n</b>They continue to stare.\n<b>    \n</b><b> \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tSammy thinks the Caddy had stopped along\n\t\tthe shoulder ... man up the road said he\n\t\tsaw two cars drag racin'...then you got\n\t\tthat blind corner.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tTwo men... two guns in the Caddy.\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tThe boys found this on the floor in back\n\t\tof the Caddy.\n<b>    \n</b>Neal holds up a plastic bag holding a pearl earring.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tYeah, they showed me\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tCould be unrelated.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tCould be...any of those dead kids wearin'\n\t\tpearl earrings?\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tNo. Could be someone's missin' maybe.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tThat's what I'm thinkin'.\n<b>    \n</b>Detective Harry McKnight turns and crosses Mulholland. His\neyes move over each blade of grass at the shoulder - each\ndesert bush just beyond. He slowly raises his gaze to the\nshining lights of Hollywood laying far below like a galaxy.\nHe looks out and wonders.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. HOLLYWOOD STREETS - EARLY DAWN\n</b><b>    \n</b>The clang of a metal gate wakes the woman. It is just getting\nlight and she sees an older red-headed woman carrying a\nsuitcase to the curb where a cab stands waiting with its\ntrunk open. The cab driver appears with two suitcases which\nhe sets down next to the car. The red-headed woman and the\ncab driver both go back through the iron gate. The woman in\nthe bushes pulls herself to the gate where she can peer into\nthe courtyard of this apartment building. She sees the red-\nheaded woman and the cab driver go into an apartment and come\nback out with more luggage.\n\n<b>    \n</b>They leave the apartment door open. When the red-headed woman\nand the cab driver reach the cab they both begin loading the\nbags into the trunk and backseat. Their backs are to the\nwoman in the bushes who takes this opportunity to go quickly\ninto the courtyard and through the open apartment door.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. APARTMENT - EARLY DAWN\n</b><b>    \n</b>The woman comes into a living room where a single trunk\nremains. She goes further into the apartment and crouches\ndown in a back corner of the kitchen. She listens as\nfootsteps come across the courtyard. She hears the red-headed\nwoman and the cab driver get the trunk. She hears them set it\ndown once they have it in the courtyard. She hears the steps\nof the red-headed woman come back inside the apartment. She\nhears the footsteps go all around the apartment and then she\nhears the footsteps come toward the kitchen. Remaining\nfrozen, the dark-haired woman's eyes look up as the red-\nheaded woman walks right past her, grabs a set of keys off\nthe kitchen counter, then leaves the apartment. The woman can\nhear the door being locked. She lets go, slides to the\nkitchen floor, and passes out.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. DENNY'S RESTAURANT , HOLLYWOOD - MORNING\n</b><b>    \n</b>Two well-dressed men HERB and DAN (mid 30's) are sitting at a\ntable drinking coffee. Herb has finished eating his\nbreakfast, but Dan hasn't touched his bacon and eggs - he\nappears too nervous to eat. A blonde waitress with a\nnameplate saying \"DIANE\" lays the check on their table\nsmiles, then walks off.\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tWhy did you want to go to breakfast if\n\t\tyou're not hungry?\n\n<b>\t\t\t\tDAN\n</b>\t\tI just wanted to come here.\n\n<b>\t\t\t\tHERB\n</b>\t\tTo Denny's? I wasn't going to say\n\t\tanything, but why Denny's?\n<b>    \n</b><b>\t\t\t\tDAN\n</b>\t\tThis Denny's.\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tOkay. Why this Denny's?\n<b>    \n</b><b>    \n</b><b>\t\t\t\tDAN\n</b>\t\tIt's kind of embarrassing but,\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tGo ahead.\n<b>    \n</b><b>\t\t\t\tDAN\n</b>\t\tI had a dream about this place.\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tOh boy.\n<b>    \n</b><b>\t\t\t\tDAN\n</b>\t\tYou see what I mean...\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tOkay, so you had a dream about this\n\t\tplace. Tell me.\n<b>    \n</b><b>\t\t\t\tDAN\n</b>\t\tWell ... it's the second one I've had, but\n\t\tthey were both the same......they start\n\t\tout that I'm in here but it's not day or\n\t\tnight. It's kinda half night, but it\n\t\tlooks just like this except for the\n\t\tlight, but I'm scared like I can't tell\n\t\tya. Of all people you're standing right\n\t\tover there by that counter. You're in\n\t\tboth dreams and you're scared. I get\n\t\teven more frightened when I see how\n\t\tafraid you are and then I realize what it\n\t\tis - there's a man...in back of this\n\t\tplace. He's the one ... he's the one\n\t\tthat's doing it. I can see him through\n\t\tthe wall. I can see his face and I hope\n\t\tI never see that face ever outside a\n\t\tdream.\n<b>    \n</b>Herb stares at Dan to see if he will continue. Dan looks\naround nervously, then stares at his uneaten food.\n<b>    \n</b>\t\t\t\tDAN (cont'd)\n\t\tThat's it.\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tSo, you came to see if he's out there?\n\n<b>\t\t\t\tDAN\n</b>\t\tTo get rid of this god-awful feeling.\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tRight then.\n\n<b>    \n</b>Herb gets up, picks up the bill and goes to the cashier to\npay. Dan just sits.\n<b>    \n</b>As Herb is paying the bill he looks over at Dan just as Dan\nis turning to look at him. From Dan's point of view Herb is\nstanding in exactly the same spot as he stood in the dream.\nHerb gets a strange feeling, turns back and finishes up with\nthe cashier. He motions for Dan to follow him. Dan rises\nreluctantly and he and Herb make their way outside.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. DENNY'S\n</b><b>    \n</b>Now Herb waits for Dan to lead the way.\n<b>    \n</b><b>\t\t\t\tDAN\n</b>\t\tAround here.\n<b>    \n</b>Dan takes Herb across the front of Denny's to a narrow\nsidewalk that leads down the side toward the back.\n<b>    \n</b>They begin walking down the narrow sidewalk - past a\npayphone. Dan begins to sweat the nearer he gets to the rear\ncorner of the building. Red bricks glide by slowly.\n<b>    \n</b><b>CLOSER ON DAN\n</b><b>    \n</b>Beads of sweat cover his face. He finds it difficult to\nbreathe. Herb is just behind him unable to see the fear\novertaking his friend, but Herb can feel something himself.\n<b>    \n</b>The red bricks moving by now are coming to an end - the\ncorner is coming closer - the corner is now very close.\n<b>    \n</b>Suddenly a man - a face ... a face dark and bum-like- moves\nquickly out from behind the corner and stops - freezes -\nstaring into Dan's eyes.\n<b>    \n</b>Dan lurches back. All his breath is suddenly gone. He falls\nback into Herb who tries to catch him as he's falling. Dan\nhits the ground unable to breathe - his eyes wide with\nhorror.\n<b>    \n</b>Herb looks up - the man is gone. He looks down to Dan.\n<b>    \n</b><b>\t\t\t\tHERB\n</b>\t\tDan! ... Dan! You all right? ... Dan!\n<b>    \n</b>He kneels down and studies his friend. He feels for a pulse\nin the neck. He listens for breathing. His friend is dead.\n<b>    \n</b>\n<b>    \n</b>\t\t\t\tHERB (cont'd)\n\t\tMy God!\n<b>    \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>EXT.  LAX AIRPORT - DAY\n</b><b>    \n</b>The airport sits in blinding sunlight and veiled with smog.\nA big jet lands.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. LAX AIRPORT\n</b><b>    \n</b>A blonde girl walking with an old woman approaches us. As the\nblonde's face fills the screen we move with her and stay with\nher as she goes. Her face is bright and her eyes move here\nand there taking in everything. She can hardly believe she's\nin Los Angeles - the City of Dreams. She and the old woman\npass under a sign which reads \"WELCOME TO LOS ANGELES.\"\nThe girl smiles and looks around excited by every detail.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. LAX AIRPORT\n</b><b>    \n</b>The girl and the old lady exit the terminal with their bags.\nAn older gentleman has joined the old lady. They stop at the\ntaxicab stand. The old lady takes the blonde girl's hand.\n<b>    \n</b><b>\t\t\t\tOLD LADY\n</b>\t\tIt's time to say goodbye, Betty. It's\n\t\tbeen so nice travelling with you.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThank you, Irene. I was so excited and\n\t\tnervous. It was sure great to have you\n\t\tto talk to.\n<b>    \n</b><b>\t\t\t\tIRENE\n</b>\t\tNow, remember I'll be watching for you on\n\t\tthe big screen.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(smiling)\n\t\tOkay Irene. Won't that be the day.\n\n<b>\t\t\t\tIRENE\n</b>\t\tThe best of luck to you, Betty. Take\n\t\tcare of yourself and be careful.\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOkay I will. Thanks again.\n<b>    \n</b>Betty and Irene give each other a hug. The old gentleman nods\nto Betty and takes Irene off. Betty smiles after them.\nSuddenly someone is grabbing her bags. She turns abruptly to\nfind she is next in line and her cab is waiting. She turns\nonce more and waves at Irene as her bags are loaded into the\ntrunk of the cab.\n<b>    \n</b><b>\t\t\t\tCAB DRIVER\n</b>\t\tWhere to?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(smiling excitedly)\n\t\t1612 Havenhurst.\n<b>    \n</b><b>\t\t\t\tCAB DRIVER\n</b>\t\tGot it!\n<b>    \n</b>They get into the cab and close their doors. The cab pulls\naway.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. STREETS - LOS ANGELES - DAY\n</b><b>    \n</b>Betty goes from the right side of the cab to the left side of\nthe cab looking at every building, tree and sign. Each street\nsign seems to be magical to her and she says the names to\nherself as they pass by. She sees La Tijera, La Cienega,\nVenice Boulevard, Pico Boulevard, Olympic Boulevard, Wilshire\nBoulevard, etc., etc. until they reach Fountain and turn\nright. Betty's heart is pounding when she sees Havenhurst\nand the cab turns left. In the middle of the block on the\nright the cab pulls over and stops. Betty sees her new\nhome ... an ancient, gorgeous courtyard apartment building,\nbuilt during the golden age of cinema.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. 1612 HAVENHURST\n</b><b>    \n</b>The cab driver puts Betty's bags down on the sidewalk next to\nher. She can barely stop looking at the building long enough\nto pay the cab driver who then goes off and drives away.\nBetty picks up her bags and enters, as if in a dream, through\nan ornate iron gate to a courtyard with a beautiful working\nfountain at its center. A sign on a door to her right reads\nManager and she rings the bell.\n\n<b>    \n</b>An older, once very beautiful, woman wearing heavy make-up\nand smoking a cigarette in a silver holder opens the door.\nAn unbelievable raspy voice comes out through the dark screen\nof the still closed screen door.\n<b>    \n</b><b>\t\t\t\tMANAGER\n</b>\t\tHi there...ten bucks says you're Betty.\n\n<b>\t\t\t\tBETTY\n</b>\t\tI am, Mrs. Lanois. It is Mrs. Lanois\n\t\tisn't it?\n<b>    \n</b><b>\t\t\t\tMRS. LANOIS\n</b>\t\tIn all my living glory, baby.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tPleased to meet you.\n<b>    \n</b><b>\t\t\t\tMRS. LANOIS\n</b>\t\tYou can call me Coco ... everybody does.\n\t\tStay there, I'll get the key.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOkay, Coco.\n<b>    \n</b>Coco returns with the key and opens the screen door inhaling\na huge drag off her cigarette. She starts off into the\ncourtyard and Betty picks up her bags and follows. As Coco\nspeaks smoke comes out of her with every word.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tI guess it was your grandfather, was\n\t\tit ... he called me to check in, said you\n\t\twere on your way and for you to call when\n\t\tyou get in. Nice man... farmer I hear.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYes, he is. He raises corn.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tDamn lot of corn raised in Hollywood\n\t\tthese days too.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWell, I ...\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tYou don't have to tell me. It's written\n\t\tall over that pretty face of yours.. You\n\t\tcame here to be an actress. I just hope\n\t\tyou'll remember there's never been a\n\t\tgreat poem called \"tits and ass.\"\n<b>    \n</b><b>    \n</b><b>\t\t\t\tBETTY\n</b><b>\t\tI...\n</b><b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tYou probably don't remember her, but\n\t\tLouise Bonner lives right over there in\n\t\tnumber 29. When she isn't drunk she runs\n\t\ta damn good acting class.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHave many famous actors and actresses\n\t\tlived here? I was meaning to ask you\n\t\tthat.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tHoney, all the great ones came through\n\t\there at one time or another.\n<b>    \n</b>A haunting music begins to swell.\n<b>    \n</b>\t\t\t\tCOCO (cont'd)\n<b>    \n</b>\t\tPeople say in the springtime when the\n\t\twind blows the smell of the jasmine you\n\t\tcan still feel the presence of everyone\n\t\tof them.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI guess I've come to quite a place.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tSweetheart, you don't know the half of\n\t\tit.\n<b>    \n</b>The music fades.\n<b>    \n</b>Coco looks down suddenly. On the cobblestone courtyard in\nfront of her she sees a fresh product of waste from a dog.\nShe angrily turns up to an apartment on the second level.\n<b>    \n</b>\t\t\t\tCOCO (cont'd)\n\t\t\t(yelling up)\n\t\tWILKINS! ... (no answer) ... THAT DOG CRAPS\n<b>\t\tONCE MORE OUT HERE AND I'LL BAKE HIS\n</b><b>\t\tBUTT FOR BREAKFAST!!\n</b><b>    \n</b>Coco turns back to Betty.\n<b>    \n</b>\t\t\t\tCOCO (cont'd)\n\t\tYou don't have pets do you?\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNo, I don't.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tThat's good. They're allowed, but I\n\t\tdon't like 'em...for obvious reasons.\n\t\tOne man used to live here that had a\n\t\tprize fighting kangaroo. You wouldn't\n\t\tbelieve what that kangaroo did to this\n\t\tcourtyard ... let's see your Aunt's\n\t\tapartment ... it's a good one.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI can hardly wait, Coco.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. APARTMENT - BEDROOM\n</b><b>    \n</b>The dirty and torn black cocktail dress of the dark-haired\nwoman along with her shoes, purse and undergarments are in a\npile in the bedroom. We drift off them toward the bathroom\nwhere the dark-haired woman can be seen showering through\nrippled glass. There's the sound of a door opening. We see a\nmovement through the glass and the shower goes off instantly.\nWe can hear the dark-haired woman's frightened breathing as\nshe waits frozen listening.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. APARTMENT  LIVING ROOM\n</b><b>    \n</b>Betty enters, thrilled with what she sees. The apartment is\nfilled with movie memorabilia, deco furniture, oriental rugs,\nbrass floor lamps and a massive tiled fireplace. She sets her\nbags down and stares.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tIt's unbelievable!\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tI told ya.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWow!\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tNow I guess you and your Aunt have an\n\t\tunderstanding. So here's the key and you\n\t\tneed anything, just give a holler.\n\t\t\t(Coco hands Betty the key)\n\t\tEverybody in this building's pretty much\n\t\tokay with me or they wouldn't be here.\n\t\tIf you want, later I'll introduce you\n\t\taround. No hard feelings if you don't,\n\t\tand don't forget the rooftop garden.\n\t\tIt's just up the stairs we passed. It's\n\t\topen to all the tenants. You can see the\n\t\tHollywood sign from there.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOh Coco thank you. Thank you so much.\n\n<b>\t\t\t\tCOCO\n</b>\t\tYou got it! See you later honey.\n<b>    \n</b>Coco leaves and closes the door behind her. Betty begins to\nexplore the apartment.- After walking a circle in the living\nroom she passes through the kitchen. She moves down a\nhallway looking at paintings and posters. She goes into the\nbedroom. She smiles when she sees the bed which has a huge\nornately carved head and foot board. She notices the soiled\ndress on the floor and she frowns as she looks closer. She\nstands back up, shrugs and goes into the bathroom which has\nall the original thirties fixtures damndest floor to ceiling\ntiles. As she goes toward the sink she smiles to herself in\nthe mirror above it. Suddenly something catches her eye and\nshe opens the shower stall. There before her is the naked,\nbeautiful dark-haired woman.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOh my!\n<b>    \n</b>She quickly closes the shower door.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tI'm sorry. My Aunt ... Ruth didn't tell\n\t\tme someone was going to be here. I'm so\n\t\tsorry.\n<b>    \n</b><b>\t\t\t\tDARK-HAIRED WOMAN\n</b>\t\tThat's okay.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI'm Ruth's niece. My name's Betty. I'm\n\t\tsure she told you I was coming.\n<b>    \n</b>There's a silence.\n<b>    \n</b><b>\t\t\t\tDARK-HAIRED WOMAN\n</b>\t\tThere was an accident. I came here.\n\n<b>\t\t\t\tBETTY\n</b>\t\tI understand. I saw the dress. I...I'm\n\t\tsorry.   Are you all right?\n\n<b>    \n</b>There is another silence.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tWhat happened?\n<b>    \n</b><b>\t\t\t\tDARK-HAIRED WOMAN\n</b>\t\tA car ... a car accident.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tAre you okay?\n<b>    \n</b><b>\t\t\t\tDARK-HAIRED WOMAN\n</b>\t\tI think so. I was just taking a shower.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOh my god. I'm sorry. I'll let you get\n\t\tback to that. I'm going to get unpacked.\n<b>    \n</b>Betty goes to the bathroom door and is closing it when she\nstops and looks back in.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tWhat's your name?\n<b>    \n</b>We see a close-up of the dark-haired woman. We see her eyes\nwiden with a kind of fear. She's frantically thinking -\nsearching her mind for an answer.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tI'm sorry. I'll get out of here and we\n\t\tcan talk later.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. APARTMENT BEDROOM\n</b><b>    \n</b>Betty is unpacking in the bedroom and putting her belongings\nin the closet and the dresser drawers. Many of her Aunt's\nthings are still there.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT.  APARTMENT BATHROOM\n</b><b>    \n</b>The dark-haired woman is looking at herself in the mirror.\nShe turns and begins looking around the bathroom at shampoos,\ncosmetics, until her eyes fall on a poster of \"Gilda\"\nstarring Rita Hayworth.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. APARTMENT BEDROOM\n</b><b>    \n</b>The bathroom door opens and the dark-haired woman comes out\nwrapped in a towel. She's drying her hair with another. She\nand Betty stare at one another.\n<b>    \n</b><b>\t\t\t\tDARK-HAIRED WOMAN\n</b>\t\tMy name is Rita.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHi...do you work with my Aunt?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tNo ..........I.\n\n<b>\t\t\t\tBETTY\n</b>\t\tI...I mean......I...it's none of my\n\t\tbusiness.\n\n<b>\t\t\t\tRITA\n</b>\t\tShe has pretty red hair... she is very\n\t\tkind I think.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tShe sure is. She's letting me stay here\n\t\twhile she's working on a movie that's\n\t\tbeing made in Canada, but I guess you\n\t\tknow that.  I couldn't afford a place\n\t\tlike this in a million years. Unless of\n\t\tcourse I'm discovered and become a movie\n\t\tstar. Of course, I'd rather be known as\n\t\ta great actress than a movie star, but\n\t\tsometimes people end up being both and\n\t\tthat is, I guess you'd say, sort of why I\n\t\tcame here. I'm sorry, I'm just so\n\t\texcited to be here..I mean I just came\n\t\there from Iowa and now I'm in this dream\n\t\tplace. You can imagine how I feel.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tI think I've been hurt.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOh...\n<b>    \n</b>Betty goes to Rita.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tSit down...\n<b>    \n</b>Betty sits Rita on the bed. She leans down and looks at her\nhead and face.\n<b>    \n</b><b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tWhere were you hurt?\n<b>    \n</b>Rita motions to her head above her forehead. Betty looks\nthrough her hair and finds her wound which has stopped\nbleeding but is surrounded by a very large blue black\nbruising.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tWe should get a doctor.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tNo.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tBut, this could be serious.\n\n<b>\t\t\t\tRITA\n</b>\t\tNo...I need to sleep.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tIf you have a concussion you shouldn't\n\t\tsleep.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tIt will be okay if I sleep. I need to\n\t\tlie down and sleep.\n\n<b>\t\t\t\tBETTY\n</b>\t\tAll right, but...I'm going to check on\n\t\tyou.\n<b>    \n</b>Rita lies down and is instantly asleep. Betty leans over her\nand listens to her breathing. She gets a blanket and drapes\nit over the beautiful sleeping Rita, then leaves the room.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. - DOWNTOWN LOS ANGELES - LOW RENT OFFICE BUILDING - DAY\n</b><b>    \n</b>The street level of the office building is filthy and houses\nstores selling racks of cheap toys. Up above we see office\nwindows and a big sign saying \"Office Space For Rent\" along\nwith a telephone number to call. We drift in toward one of\nthe windows on the sixth floor.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b>\n<b>INT. OFFICE ON SIXTH FLOOR\n</b><b>    \n</b>Two men are in the room, JOE and ED. Joe leans up against a\nrack of filing cabinets. He is in his late twenties. He\nlooks like a run down, heavy metal rocker - wears a blue\ndenim shirt open, T-shirt underneath, black denim jeans and\nmotorcycle boots. His black belt has silver studs. He's\nsmoking a cigarette and is laughing at something the man at\nthe desk has said. His laugh is easy and his grin is\ninfectious.\n<b>    \n</b>The man at the desk, Ed, wears a clean, crisp black suit,\nlike a business man's but unlike a business man his blonde\nhair is long enough to go over his shoulders.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tSo man, that's unheard of ... an accident\n\t\tlike that ... who coulda foreseen that.\n<b>    \n</b><b>\t\t\t\tED\n</b>\t\tUnreal ... so, you're looking good.\n\t\tWhatcha doin' these days?\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tWell, not much Ed. Just doin' some stuff\n\t\tfor this guy.\n<b>    \n</b><b>\t\t\t\tED\n</b>\t\tMaking ends meet, huh.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tHardly.\n<b>    \n</b><b>\t\t\t\tED\n</b>\t\tYeah, look at my digs ... times are tough.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tOh, things aren't so bad. Gee, I hope\n\t\tyou're not goin' to get in any trouble.\n<b>    \n</b><b>\t\t\t\tED\n</b>\t\tIt was just a thing. The story made you\n\t\tlaugh.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tYeah, that's a funny story.\n<b>    \n</b>Looking like he's rubbing the small of his back Joe moves\nover to Ed at his desk. Joe looks down to the surface of the\ndesk - to a small worn black book.\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\tSo, there it is ... Ed's famous black book.\n\n<b>    \n</b><b>\t\t\t\tED\n</b>\t\tYeah, the history of the world in phone\n\t\tnumbers.\n<b>    \n</b>Joe's hand still at the small of his back moves into view\nholding a silenced pistol and in one swift move reaches out\nand fires a hole through Ed's temple - blowing Ed's brains\nout across the desk, carpet and wall. Ed's head bangs down\non the desk, then is still save the leaking of blood from the\nwounds. Joe flips his finished cigarette out the open window\nbehind Ed's desk, wipes the gun clean with a handkerchief and\nplaces the cleaned gun in Ed's right hand. He places Ed's\nright forefinger gently onto the trigger. As he puts the\nfinger on the trigger he presses a little too hard and the\ngun goes off. The bullet shoots out and penetrates the cheap\nwall at the far end of Ed's office. Joe hears a muffled\nscream.\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\t\t(disgusted with himself)\n\t\tOh...man!\n<b>    \n</b>With a sense of \"just more stuff I got to do\" Joe moves\nslowly and begrudgingly out of Ed's office, checks the\ncorridor and goes toward the screaming which still persists.\nHe opens up the office door next to Ed's and finds a heavy\nset woman screaming bloody murder as she is grabbing her\nbuttock and lower back. He sighs and walks over to her and\ncups his hand tightly around her mouth to squelch the\nscreaming. Wide-eyed, she tries to fight him off and he\nbegins dragging her out of her office. Joe's foot catches on\na computer cable clumsily taped across the floor and he falls\nbackwards bringing the heavy woman down with a bone-crushing\nblow on top of him. The woman begins beating his face with\nher meaty fists. Joe snaps her head back, instantly stilling\nher violent activity. He wrestles the stunned heavyweight\nback to her feet and out her door. He pushes and pulls her\ninto Ed's office. Just before they enter, Joe notices a man\nwith a vacuum cleaner watching him from the far end of the\ncorridor. He stops and calls to the man.\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\tHey man. She's hurt bad. Get down here\n\t\tand use the phone. Help me out. You\n\t\tgotta call the hospital.\n<b>    \n</b>The man hesitates...not sure if this jives with what he's\nseeing.\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\tI mean it! Get down here quick! She's\n\t\thurt and I can't do everything myself,\n\t\tman.\n\n<b>    \n</b>Joe pushes the woman inside Ed's office, throws a glance back\ndown the corridor and sees the man is on his way to him,\npushing his industrial vacuum and trailing a 200 ft. long\nthick black cord as he goes. Joe goes in to Ed's office\nwith the woman. He throws her down on the floor in line\nbetween Ed's desk and the bullet hole in the wall. She\nstarts screaming immediately and struggles to get up. Joe\ngrabs the pistol from Ed's dead hand and lifts it to fire,\nbut the woman has turned around and is almost standing.\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\tNo, no, no. You gotta be turned around.\n<b>    \n</b>He goes to her, slaps her hard in the face and spins her\naround. Before she can turn again Joe races back to place\nhimself in the proper line at Ed's desk and quickly fires two\nsilenced shots into the back of her head. The man with the\nvacuum enters. His eyes begin to widen in reaction to the\nscene. Just then Joe fires a bullet into the man's chest.\nThe man inadvertently flicks on the vacuum cleaner as his\nhands rush up to the wound. As the vacuum cleaner whines Joe\nrushes to the man before the man falls back out into the\ncorridor. He pulls him into the room - the man moaning and\nclutching his chest, starting to collapse. Joe releases him\nand the man goes down. The vacuum cleaner seems to be\nscreeching now in the threshold. Joe fires the last bullet\ninto the heavy duty vacuum cleaner. The bullet shorts out\nthe internal wiring of the vacuum. That in turn blows the\nbuilding's circuit breaker and all the lights go out.\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\t\t(disgusted with himself)\n\t\tOh ... man!\n<b>    \n</b>Now he hears voices - voices moving into the corridor.\n<b>    \n</b><b>\t\t\t\tVOICES\n</b>\t\tWhat the hell .... what happened? What's\n\t\tthis cord doing here? It's the vacuum.\n\t\tIt's the vacuum what did it.\n<b>    \n</b>Joe cleans the pistol once again and places it back in\nEddie's hand - Eddie's finger on the trigger. Joe picks up\nthe black book - turns and makes his escape by going out the\noffice window and quickly descending the rusty fire escape.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. CONFERENCE ROOM - CENTURY CITY BUILDING - DAY\n</b><b>    \n</b>We see three men sitting at a conference table RAYMOND(RAY)\nHOTT -president of production, wearing a crisp blue\nsuit,VINCENT DARBY -senior vice-president, wearing a crisp\ngreen suit and ROBERT SMITH -talent manager, wearing a crisp\nbrown suit. Ray and Mr. Darby sit at the head of the table\nand Robert Smith sits along the side. A younger man -ADAM\nKESHER enters and sits down, with an arrogant nonchalance,\nnext to Robert Smith. Adam is dressed in a frumpy old\nfashioned plaid shirt, worn jacket, dark blue cotton slacks,\nand a pair of old brown wing tips. As he sits he is holding\nand twirling a vintage \"7-iron\" golf club.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tSo what's the problem?\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tThere is no problem.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tSo why did you idiots bring me\n\t\there? ... I'm in the middle of making a\n\t\tpicture.\n<b>    \n</b>Silence for a moment. A man enters through a rear door and\nwhispers something to Mr. Darby and shows him something on a\npiece of paper. Mr. Darby studies the piece of paper.\n<b>    \n</b><b>\t\t\t\tMR. DARBY\n</b>\t\t\t(to man who entered)\n\t\tWhat was it last time?\n<b>    \n</b>The man who entered points to something on the paper.\n<b>    \n</b>\t\t\t\tMR. DARBY (cont'd)\n\t\tOkay, let's try the next one.\n<b>    \n</b>The man nods and leaves.\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tHe isn't gonna like it.\n<b>    \n</b><b>\t\t\t\tMR. DARBY\n</b>\t\tWe'll see.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tHello ... who're we talkin' about here?\n<b>    \n</b>Robert Smith shuffles nervously in his chair next to Adam.\n\n<b>    \n</b><b>\t\t\t\tROBERT SMITH\n</b>\t\tYou see Adam... there are some suggestions\n\t\twhich are to be brought forward ... and I\n\t\tknow you said you would entertain\n\t\tsuggestions and that's all anybody here\n\t\tis asking you to do.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWhat're you talking about?\n<b>    \n</b><b>\t\t\t\tROBERT SMITH\n</b>\t\tAn open mind ... You're in the process of\n\t\tre-casting your lead actress and\n\t\tI'm... (looks around) We're asking you to\n\t\tkeep an open mind.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. CENTURY CITY - DAY\n</b><b>    \n</b>Before us is a huge modern office building of glass and\nsteel. Two men in dark suits have exited a large limousine\nand are walking up into the building. We drift up the facade,\nhigher and higher moving in toward the top of the building.\n<b>    \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>INT. OFFICE BUILDING - DAY\n</b><b>    \n</b>The men exit an elevator and move through a lobby where a\nplaque beneath an enormous bronze sculpture reads \"Ryan\nEntertainment\". Gliding we travel behind the two men down a\nwide, carpeted hallway with blonde wood and glass on each\nside. They enter through two large blonde wooden doors to the\nconference room.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. CONFERENCE ROOM - DAY\n</b><b>    \n</b>The men in dark suits go in as if they owned the place. Ray,\nMr. Darby and Robert Smith stand immediately. Adam remains\nseated. Mr. Darby is the only one near enough to attempt a\nhand shake, but when he offers his hand it is not taken. The\nmen in dark suits sit down without wasting a movement and\nwithout acknowledging anyone. One of the men in a dark suit\nopens a briefcase. Ray has been trying to make\nintroductions.\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tAh... the Castigliane brothers. Let me\n\t\tintroduce you around ... please ... sit down.\n\t\t(after they've already seated\n\t\tthemselves) ... this is Mr. Darby whom you\n\t\tknow and this is the director Adam\n\t\tKesher and his manager Robert Smith\n<b>    \n</b>The Castigliane brothers do not acknowledge any of this,\nhowever, during the introductions the one with the briefcase\nremoves a photo of a girl and sets it in front of Ray.\n<b>    \n</b>\t\t\t\tRAY (cont'd)\n\t\tAh... she's very pretty.\n<b>    \n</b>We see the photo of the girl - of a nice looking blonde -\nsomeone we've never seen before. Adam looks like he doesn't\nknow what's going on and he's getting upset about not\nknowing. His manager, Robert Smith, is beginning to see the\nmakings of a confrontation - he's starting to panic.\n<b>    \n</b><b>\t\t\t\tMR. DARBY\n</b>\t\t\t(referring to Castigliane\n\t\t\tbrothers)\n\t\tMay I offer you gentlemen anything?\n<b>    \n</b><b>\t\t\t\tLUIGI CASTIGLIANE\n</b>\t\tEspresso.\n\n<b>\t\t\t\tVINCENZO CASTIGLIANE\n</b>\t\tNothing. \n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tUh  what's the photo for?\n<b>    \n</b><b>\t\t\t\tMR. DARBY\n</b>\t\t\t(picking up phone and speaking)\n\t\tOne espresso ... no, that's it.\n\t\t\t(sets phone down - addresses\n\t\t\tCastigliane brothers)\n\t\tI think you're going to enjoy your\n\t\tespresso this time... I've been doing\n\t\tquite a bit of research knowing how hard\n\t\tyou are to please... this one comes highly\n\t\trecommended.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWhat's the photo for?\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\t\t(to Adam)\n\t\tA recommendation... a recommendation to\n\t\tyou Adam.\n<b>    \n</b><b>\t\t\t\tVINCENZO CASTIGLIANE\n</b>\t\tNot a recommendation.\n<b>    \n</b><b>    \n</b><b>\t\t\t\tLUIGI CASTIGLIANE\n</b>\t\tThis is the girl.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWhat girl? For what? What is this Ray?\n<b>    \n</b>Ray, still standing with a forced smile, turns to the\nCastigliane brothers.\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tWe'd be happy to put her in the pile for\n\t\tconsiderations ... you'd be pleased to know\n\t\tthere's quite a lot of interest in this\n\t\trole.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tInterest?! There's six of the top\n\t\tactresses that want this thing.\n<b>    \n</b><b>\t\t\t\tLUIGI CASTIGLIANE\n</b>\t\tThis is the girl.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tRay...you better take care of this.\n<b>    \n</b><b>\t\t\t\tROBERT SMITH\n</b>\t\tHold on ... hold on, Adam.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tHold on!!!!!!!! There's no way, there's\n\t\tno way!!!\n<b>    \n</b>Luigi Castigliane's espresso is brought in by the man who had\nbeen in earlier. The man sets the espresso down in front of\nLuigi and takes a step back. The room becomes silent -\nwatching the Espresso Man and Luigi. Without looking up Luigi\nspeaks softly.\n<b>    \n</b><b>\t\t\t\tLUIGI CASTIGLIANE\n</b>\t\tNapkin.\n<b>    \n</b><b>\t\t\t\tESPRESSO MAN\n</b>\t\t\t(leading forward to hear)\n\t\tPardon?\n<b>    \n</b><b>\t\t\t\tLUIGI CASTIGLIANE\n</b>\t\tNapkin.\n<b>    \n</b><b>\t\t\t\tESPRESSO MAN\n</b>\t\tOf course. Excuse me.\n<b>    \n</b>The Espresso Man leaves the room. Luigi looks at the\nespresso. Vincenzo stares at Adam.\n<b>    \n</b>Adam is doing his best to stare down Vincenzo. The Espresso\nman returns with a cloth napkin and lays it down next to the\nespresso.\n<b>    \n</b>\t\t\t\tESPRESSO MAN (cont'd)\n\t\tWill that be all, Sir?\n<b>    \n</b>Luigi doesn't answer and after a moment of standing very\nstill waiting, the Espresso Man turns and leaves the room.\n<b>    \n</b>Adam is stared down by Vincenzo and averts his eyes to the\nespresso cup. He looks around at Ray and Mr. Darby - seeing\nthem stare at the espresso cup.\n<b>    \n</b>Vincenzo keeps staring at Adam.\n<b>    \n</b>Luigi picks up the napkin and holds it in his left hand.\nWith his right hand he lifts the espresso cup and places it\nabove the napkin. He brings the cup and napkin to his mouth.\nHe takes a sip of espresso. A small fleeting expression forms\non Luigi's impassive face as if for one millisecond he is\ngoing to vomit. His mouth opens and he allows the espresso\nto fall and dribble onto the napkin. He pushes any remaining\nespresso in his mouth out with his tongue. He holds it in\nthat position for a moment.\n<b>    \n</b><b>\t\t\t\tLUIGI CASTIGLIANE\n</b>\t\tIs shit!\n<b>    \n</b>Luigi Castigliane stands up.\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tI'm sorry. That was a highly\n\t\trecommended...\n<b>    \n</b><b>\t\t\t\tMR. DARBY\n</b>\t\tThat's considered one of the finest\n\t\tespressos in the world , Sir.\n<b>    \n</b>Luigi just stands there. A small thread on his left suit\njacket pocket catches his attention and he smooths it back\ninto the fabric. Vincenzo closes his briefcase, takes out a\nhankerchief and cleans his nose - then stands, placing the\nhandkerchief back in his pocket.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWait a minute!! What's going on here?\n<b>    \n</b>Vincenzo just stares toward Adam as if he's not even there.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tThere's no way that girl is in my movie!\n<b>    \n</b>Silence.\n\n<b>    \n</b><b>\t\t\t\tLUIGI CASTIGLIANE\n</b>\t\tThat is the girl.\n<b>    \n</b>The Castigliane brothers begin to leave. Adam stands up\ntrembling with anger.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tHey!!!!! That girl is not in my film!!!\n<b>    \n</b><b>\t\t\t\tVINCENZO CASTIGLIANE\n</b>\t\tIt is no longer your film.\n<b>    \n</b>Adam turns white and stands very still as this sinks in. The\nCastigliane brothers leave. As the big blonde wood doors\nclose behind them Adam starts to boil.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\t\t(screaming)\n\t\tYou'd better fix this, Ray!!!\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tI'll speak to someone.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\t\t(turning to his manager)\n\t\tAnd you'd better speak to someone\n\t\ttoo ... or find yourself another client!!\n\t\tThis smells like a set-up to me!\n\t\t\t(back to Ray)\n\t\tAnd by the way, Ray, I don't know who\n\t\tthese guys are kidding, but every foot of\n\t\tfilm I've shot is in a vault at the lab\n\t\tthat only I can access. No one's getting\n\t\tthat film!!\n<b>    \n</b><b>\t\t\t\tROBERT SMITH\n</b>\t\tThis is a catastrophe...\n\t\t\t(turning toward Ray)\n\t\tyou told me they might insist on a girl,\n\t\tthat's all.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWhy didn't you tell me, Robert? That's\n\t\twhat I mean ... you set me up! I woulda\n\t\tnever come here.\n\t\t\t(standing)\n\t\tI'm leaving. I'm a director you don't\n\t\twant to lose ... you guys better fix this!!\n<b>    \n</b>Adam storms out of the room.\n\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\t\t(standing)\n\t\tWell...I didn't know that was going to\n\t\thappen.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXTERIOR - OFFICE BUILDING - CENTURY CITY - DAY\n</b><b>    \n</b>Adam exits the building carrying his 7-iron. An attendant\ntakes his valet parking ticket. While Adam, still fuming,\nwaits for his car he notices the big limo standing off to one\nside. He stares at the car and the huge limo driver leaning\nup against the front driver's side door.\n<b>    \n</b>Adam's car arrives - a late model Porsche. Before Adam gets\ninto his car he addresses the attendant.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tDid the Castigliane brothers get out of\n\t\tthat limo?\n<b>    \n</b><b>\t\t\t\tATTENDANT\n</b>\t\tThey two guys in dark suits?\n<b>    \n</b>Adam nods and walks over to the limo. The limo driver eyes\nhim and his 7-iron suspiciously.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tCastigliane brothers?\n<b>    \n</b><b>\t\t\t\tLIMO DRIVER\n</b>\t\tBeat it!\n<b>    \n</b><b>\t\t\t\tADAM\n</b><b>\t\tO.K.\n</b><b>    \n</b>Adam raises his 7-iron and smashes out the limo's windshield.\nHe whacks two big dents in the hood, then smashes out a\nheadlight. The limo driver starts towards him. Adam laughs,\nruns to his car and takes off.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - LATER DAY\n</b><b>    \n</b>Betty is stretched out on the big leather couch in the living\nroom. A half eaten sandwich and chips are on a plate on the\ncoffee table next to her. She is talking on the phone.\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNo Grandpa, you wouldn't believe it.\n\t\tIt's more beautiful than I ever\n\t\tdreamed ... no she left me a lot of food.\n\t\tThe refrigerator's full ... Aunt Ruthie\n\t\tsaid she'd call me when she got\n\t\tsettled... it was real smooth. I sat next\n\t\tto a lady who gave up her first class\n\t\tseat to a boy with a broken leg. She was\n\t\tso nice to me. She invited me to her\n\t\thouse sometime. It's in Bel Air which is\n\t\ta place where people have a lot of\n\t\tmoney... I will. Everybody's telling me\n\t\tto be careful, but I sure love it here\n\t\tGrandpa. Thank you for helping me get\n\t\there ... yeah, it's long distance. I love\n\t\tyou. Say hello to Grams. Give her a big\n\t\tkiss for me. Okay, I love you\n\t\tGrandpa ... bye.\n<b>    \n</b>Betty hangs up the phone, takes a big bite of her sandwich\nand lays flat out on the couch, chewing and smiling up at the\nceiling. She suddenly remembers Rita and her promise to look\nin on her. She gets off the couch and goes into the bedroom.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. BEDROOM - DAY\n</b><b>    \n</b>Rita is still asleep when she enters. She leans down and\nfinds Rita breathing normally. She feels her forehead.\nSatisfied that all is well, Betty quietly leaves the bedroom.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. - EXT. APARTMENT - DAY\n</b><b>    \n</b>Betty rinses her dishes in the kitchen sink and pours herself\na cup of coffee. She takes the coffee outside to the\ncourtyard - to a white metal table just outside her doorway.\nShe sits down and stretches in the warm afternoon sun.\nAcross the way she can hear a blues saxophonist practicing in\none of the apartments. She drinks her coffee and listens to\nthe music.\n<b>    \n</b>Some birds fly by overhead. She takes another sip of coffee.\nThe blues music which was mellow and slow is now building in\ntempo and volume. The phone inside rings. Betty takes her\ncoffee back into the living room, shutting the door behind\nher. She crosses to the leather couch and picks up the\nphone.\n<b>    \n</b><b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tHello ... Aunt Ruth!! I can't tell you how\n\t\thappy I am. Your place is so fantastic!\n\t\tYes ... Coco...what a character. I really\n\t\tlike her... that's too bad...waiting in an\n\t\tairport must not be too fun. What's a\n\t\tmosquito plane? ... Oh I get it. How long\n\t\tdoes that take from Montreal? ... Well,\n\t\tyou'll sleep good tonight ... Hudson Bay\n\t\tsounds beautiful ...oh well, I hope you\n\t\tpacked your coat. (laughs). You mean\n\t\tthe audition...Wally Brown... she didn't\n\t\tmention it but he'll fax the dialogue to\n\t\tCoco? Suddenly I'm so nervous ... okay\n\t\tAunt Ruth... I'll try. I'll study those\n\t\tlines until I know them inside out.\n\t\tYes, either right here on this fabulous\n\t\tleather couch or I'll take them with a\n\t\tcoffee in the courtyard like a regular\n\t\tmovie star. (laughs). Oh! I got a real\n\t\tshock to find your friend Rita here. She\n\t\twas in the shower and I opened the\n\t\tdoor ... Rita ... what do you mean? She was\n\t\tin an accident ... your friend Rita. No,\n\t\tCoco unlocked the door. No, she didn't\n\t\tsee her. She's sleeping. No... she's\n\t\tvery nice. I'm sure there's some\n\t\texplanation, Aunt Ruth... I don't think we\n\t\thave to do that. Please don't worry.\n\t\tI'll take care of it. No, I'll let you\n\t\tknow. Where can I ... okay I'll get it\n\t\tfrom Coco.\n\t\tNo, please don't worry... thank you so\n\t\tmuch for letting me stay here. You've\n\t\tmade me so happy... thank you, thank you.\n\t\tPlease don't worry... Aunt Ruth we don't\n\t\tneed the police. I'll call you when you\n\t\tget to Hudson Bay. Please...\n\t\tplease ... Goodbye Aunt Ruth.\n<b>    \n</b>Betty slowly and quietly hangs up the phone. She sits for a\nmoment listening. Silently she stands and moves toward the\nbedroom. As she approaches the bedroom door she stops at\nsomething she sees. Rita is sitting on the edge of the bed\ncrying quietly. Betty goes into the bedroom. Rita looks up\nat her with desperation.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tYou're awake... I think I misunderstood\n\t\tyou. I thought you knew my Aunt and\n\t\tthat's why you were here. I just talked\n\t\tto my Aunt on the phone and she wants me\n\t\tto call the police.\n\n<b>    \n</b>Rita starts crying harder, bows down, covering her face with\nher hands.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tRita?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(crying harder)\n\t\tI'm... sorry. I ...\n\nBetty's heart softens.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat is it Rita?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(still sobbing)\n\t\tI'm...I'm... oh no... I thought when I woke\n\t\tup... I thought sleep would do it ...\n<b>    \n</b>Betty kneels down in front of her.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat's wrong?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(crying)\n\t\tI don't know who I am.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat do you mean? You're Rita.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(crying)\n\t\tI'm not. I don't know what my name is.\n\t\tI don't know who I am!!\n<b>    \n</b>Betty looks down at the purse next to Rita's dress. She picks\nit up and hands it to Rita.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThis is your purse. Your name must be in\n\t\tyour purse.\n<b>    \n</b>Rita takes the purse with sudden trepidation. She hesitates.\nSomething is worrying her. She looks at Betty for help.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tYou want to know don't you?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tI ... yes, but ... I ...\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOpen it!\n<b>    \n</b>Rita slowly unzips the purse. The pressure of its contents\nforce the mouth of the purse to widen as the zipper opens and\nthen there is suddenly revealed what will later be known to\nbe $125,000.00 cash in hundred dollar bills.\n<b>    \n</b>Both Rita and Betty almost stop breathing. They look at each\nother, then back to the money.\n<b>    \n</b>Rita takes the massive wad of bills out of the purse and sets\nit on the bed. She reaches back inside and comes up with the\nonly other remaining item in the purse ... A BLUE KEY. Betty\nsees Rita's expression change to a kind of <u>horror</u>.\n(note: This blue key is made of very fine heavy metal and\ndoes not look like a door key.)\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INTERIOR - OFFICE BUILDING - DAY\n</b><b>    \n</b>Ray crosses a carpeted closed area. He mounts a flight of\nstairs. At the top of the stairs there's a plain blonde wood\ndoor. Ray punches in a code on a security panel next to it.\nThe door opens automatically. Ray passes through and goes\ndown a narrow hall. At the end of the hall there is a small\nelevator. Again Ray punches in a code. The elevator opens and\nRay goes in. The elevator door closes, but the elevator does\nnot move. Ray waits. Finally, a woman's voice comes through a\nspeaker.\n<b>    \n</b><b>\t\t\t\tWOMAN'S VOICE\n</b>\t\tWho is it please?\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tRaymond Harris ... 20743.\n<b>    \n</b>The elevator begins to move up. When it stops, the door opens\nand Ray walks into a windowless reception area where a\nbeautiful Italian woman sits behind a large, blonde, modern,\nbuilt-in desk.\n<b>    \n</b><b>\t\t\t\tRECEPTIONIST\n</b>\t\t\t(very quietly)\n\t\tYou may go right in, Ray.\n<b>    \n</b>Ray crosses to a blonde wood double door and waits. The\nreceptionist pushes a button behind her desk - chimes sound\nas the double doors open to an enormous office with no\nwindows. Heavy rich brown curtains line the walls.\n<b>    \n</b><b>    \n</b>Ray enters and the doors close behind him. Ray takes a few\nsteps forward, then stops. There is a solid glass wall that\nwe now notice running the width of the office. Cut into the\nglass wall is a small speaker microphone apparatus. Beyond\nthe glass off in the center of the room is a man sitting in a\nvery plain, blonde, wood, modern, yet not motorized,\nwheelchair. The man is paralyzed except for his right hand\nand head. His head appears small in relation to the size of\nhis body. His suit is immaculate and one of the finest we've\never seen. His manservant stands in the shadows behind him.\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tGood afternoon Mr. Roque. (pronounced\n\t\tRowk).\n<b>    \n</b>Mr. Roque stares at Ray silently.\n<b>    \n</b>\t\t\t\tRAY (cont'd)\n\t\tDo you want him replaced?\n<b>    \n</b>Mr. Roque continues to stare.\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tI know they said...\n<b>    \n</b><b>\t\t\t\tMR. ROQUE\n</b>\t\tThen?\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tThen... I guess it's so .... alright, but\n\t\tthat means we should ...\n<b>    \n</b><b>\t\t\t\tMR. ROQUE\n</b>\t\tYes?\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tShut everything down ... Is that something\n\t\tthat...do you want us to shut everything\n\t\tdown?\n<b>    \n</b>Silence. Ray doesn't know what to do. He struggles to\ninterpret Mr. Roque's silence. He waits. Mr. Roque does\nnothing but stare.\n<b>    \n</b>\t\t\t\tRAY (cont'd)\n\t\tThen we'll shut everything down.\n<b>    \n</b>Silence.\n<b>    \n</b>Ray turns. The doors open as he approaches them and he\nleaves the room. The doors close.\n<b>    \n</b>\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXTERIOR - OFFICE BUILDING - CENTURY CITY\n</b><b>    \n</b>Vincenzo and Luigi are staring silently and without\nexpression at the broken windshield of the limousine. The\nlimousine driver suddenly starts signaling to a car entering\nthe driveway to the building. He turns to the Castigliane\nbrothers.\n<b>    \n</b><b>\t\t\t\tLIMO DRIVER\n</b>\t\tThe other car is here sirs. Please allow\n\t\tme.\n<b>    \n</b>The limo driver opens the rear door of the new limo, then\nhurries around and opens the other rear door. The new driver\ngets out of the car.\n<b>    \n</b>\t\t\t\tLIMO DRIVER (cont'd)\n\t\tHere's the key to the car. Take it\n\t\tstraight to the garage. They're waiting\n\t\tfor you.\n<b>    \n</b>The limo driver closes both back doors after the Castigliane\nbrothers are seated within. He then gets in himself and\nmaneuvers the big limo out into traffic.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>PINK'S CHILI DOGS - DAY\n</b><b>    \n</b>Two guys, JOE ( the guy who killed Ed in the sixth floor\noffice) and BILLY another unkept, rocker type delivery man\nare standing waiting for their chili dogs with a girl, LANEY,\nwho could be very good looking but she seems to be in poor\nhealth. Her hair is long and stringy. She's wearing a\ntight, short sleeve blue sweater, black jeans and boots.\n<b>    \n</b><b>\t\t\t\tBILLY\n</b>\t\tYeah, sure. Look what happened to them.\n\n<b>\t\t\t\tJOE\n</b>\t\tNo, no, no, I told you. They're fine.\n\t\tThey're all real happy.\n\n<b>\t\t\t\tBILLY\n</b>\t\tMy next delivery is up that way, so I'll\n\t\tbe getting down to it real soon.\n<b>    \n</b>\n<b>\t\t\t\tJOE\n</b>\t\tYou're so easy.\n<b>    \n</b><b>\t\t\t\tBILLY\n</b>\t\tGotta keep an eye on her, that's all.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tYeah, what for?\n<b>    \n</b><b>\t\t\t\tBILLY\n</b>\t\tKeep her from gettin' in trouble, that's\n\t\tall.\n<b>    \n</b>The chili dogs arrive and they pay for them.\n<b>    \n</b>\t\t\t\tBILLY (cont'd)\n\t\tCan we eat in the van?\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tWhat's  the matter now?\n<b>    \n</b><b>\t\t\t\tBILLY\n</b>\t\tNothing... I don't like being out in the\n\t\topen like this.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tIt must be just so pathetic being you.\n\t\tSure Billy, grab your dog we'll eat in\n\t\tthe van.\n<b>    \n</b>The three make their way to the van. Joe looks over at\nLaney.\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\tYou sure you don't want anything?\n<b>    \n</b><b>\t\t\t\tLANEY\n</b>\t\t\t(hesitantly)\n\t\tNot here...no thanks.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tNot a coke or anything?\n<b>    \n</b><b>\t\t\t\tLANEY\n</b>\t\tNo ... thanks though... I'll take a\n\t\tcigarette if you have one.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tSure, reach in my shirt pocket there.\n<b>    \n</b>As Laney is getting her cigarette and lighting it..\n\n<b>    \n</b>\t\t\t\tJOE (cont'd)\n\t\tAny new girls on the street these days?\n<b>    \n</b><b>\t\t\t\tLANEY\n</b>\t\t\t(taking her first big drag)\n\t\tNo.  I haven't seen any.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tA brunette? ... maybe beat up?\n<b>    \n</b><b>\t\t\t\tLANEY\n</b>\t\tNo...\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tYou'll keep your eyes open for me won't\n\t\tyou baby?\n<b>    \n</b><b>\t\t\t\tLANEY\n</b>\t\tSure.\n<b>    \n</b>Joe spanks her butt as she gets in the van.\n<b>    \n</b><b>\t\t\t\tJOE\n</b>\t\tYou bet you will.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT.  MR. ROQUE'S OFFICE - DAY\n</b><b>    \n</b>Mr. Roque, in his wheelchair is still in the center of the\nhuge softly lit, windowless office. His manservant standing\nsilently behind him. The small built-in wheelchair phone\nrings. Mr. Roque pushes a button on a small intricate remote\ndevice he holds in his right hand. A slender streamlined\nmicrophone rises from the arm of the chair.\n<b>    \n</b><b>\t\t\t\tMR. ROQUE\n</b>\t\tYes?\n<b>    \n</b>He listens through a high-tech earplant which we now see.\n<b>    \n</b>\t\t\t\tMR. ROQUE (cont'd)\n\t\tThank you.\n<b>    \n</b>He pushes two buttons, one after another on the remote\ndevice. We hear a small click, a dial tone, a number being\ndialed, and a phone ringing.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b>\n<b>    \n</b><b>INT. DARK ELEGANT ROOM - SOMEWHERE - SIMULTANEOUS\n</b><b>    \n</b>We see the back of a man's head and just over his shoulder we\nsee the top of the phone which is ringing. The man picks up\nthe phone and brings the receiver to his ear.\n<b>    \n</b><b>\t\t\t\tTHE MAN\n</b>\t\tHello.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT.  MR. ROQUE'S OFFICE   -   SIMULTANEOUS\n</b><b>    \n</b><b>\t\t\t\tMR. ROQUE\n</b>\t\tShe's still missing.\n<b>    \n</b>We hear a small click and the line goes dead. Mr. Roque\npushes a button and the microphone descends back into the\nchair.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. DARK ELEGANT ROOM - SOMEWHERE\n</b><b>    \n</b>Again we see the back of the man's head. He's dialing a new\nnumber. -He brings the receiver to his ear. We hear a phone\nringing - we hear a click- the phone being answered.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. FILTHY LOW CLASS KITCHEN - SOMEWHERE - SIMULTANEOUS\n</b><b>    \n</b>We see only a black rotary wall phone and a portion of a\ngreasy filthy kitchen - The receiver has already been lifted\noff the phone and we see only the cord extending to someone\noff screen.\n<b>    \n</b><b>\t\t\t\tHAIRY-ARMED MAN\n</b>\t\t\t(off screen)\n\t\tTalk to me...\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. DARK ELEGANT ROOM - SOMEWHERE\n</b><b>    \n</b>Again we see only the back of the man's head.\n<b>    \n</b><b>\t\t\t\tTHE MAN\n</b>\t\tSame.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. FILTHY LOW CLASS KITCHEN - SOMEWHERE - SIMULTANEOUS\n</b><b>    \n</b>A man's hairy-arm enters frame and the receiver is placed\nback on the phone, then immediately picked back up and with\nthe receiver held in the hand the hairy man dials a new\nnumber. Part way through the dialing...\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. A BLUE TABLE - SOMEWHERE - SIMULTANEOUS\n</b><b>    \n</b>The surface of this table is high gloss ultra smooth\nmaterial. A very modern phone sits on this table and begins\nto ring softly. A hand enters frame - a woman's hand. The\nskin is pale white, almost translucent. The fingers are long\nand seem slightly too large. At the ends of the fingers and\nthumb are stretched tapered high gloss red fingernails which\nslightly curve downward. The forefinger of the hand presses\na button on the phone. A small tone sounds - followed by a\nvery modern sounding coded signal.\n<b>    \n</b><b>\t\t\t\t\t\t\tFADE OUT:\n</b><b>    \n</b>INT. - AUNT RUTH'S APARTMENT - day\n<b>    \n</b>We pull back from Rita's face until we see that Betty and\nRita are sitting on the leather couch about four feet apart\nstaring at the floor. They just sit this way for awhile.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWell...  what do you think about then? I\n\t\tmean...  well what do you think about?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tWhat do you mean?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWell ... if you don't remember anything, I\n\t\tmean what goes through your mind then if\n\t\tyou don't remember anything?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tNothing. I do remember the car crash... I\n\t\ttold you... I remember the glass ... I\n\t\tthink about that sometimes ... I remember\n\t\twalking here, sort of. Now I remember\n\t\tthis place and you. That's about it.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHow do you remember how to talk?\n\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tI don't know.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou don't remember anything else?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tNo\n\t\t\t(she covers her eyes with her\n\t\t\thands)\n\t\tThere is something...something there I\n\t\tcan't tell... I can't describe it.\n\t\t\t(struggling to figure it out -\n\t\t\tto express it)\n\t\tThere are things there.... but I'm... here.\n<b>    \n</b>Betty thinks about what Rita has said. Somehow it seems to\nmake sense to her.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThe money. You don't know where it came\n\t\tfrom?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tUnh, unh.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhen you think about them... the\n\t\tmoney... the key ... does it make you\n\t\tremember anything?\n<b>    \n</b>Silence.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tThe money... I don't know about the\n\t\tmoney... the key... it makes me feel ...\n\t\tafraid.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>BEVERLY HILLS CITY STREETS - DAY\n</b><b>    \n</b>A car - a late model generic sedan is moving toward us. Two\nmen dressed in suits and wearing dark glasses are driving\nslowly. As they go each man is scanning sidewalks,\nbuildings, passing cars as if hunting for someone. They pass\nby us and as we turn we leave them and pick-up Adam driving\nin the opposite direction in the other lane. We stay with\nAdam.\n<b>    \n</b>Adam drives his Porsche up a palm lined street.\n\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tOffice...\n<b>    \n</b>The voice activated phone connects the line to Adam's office.\nA secretary answers.\n<b>    \n</b><b>\t\t\t\tSECRETARY\n</b>\t\tAdam Kesher's office.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tIt's me. Where's Cynthia?\n<b>    \n</b><b>\t\t\t\tSECRETARY\n</b>\t\tShe's on the set. I'll connect you Mr.\n\t\tKesher.\n<b>    \n</b>Another ringing sound, then a voice.\n<b>    \n</b><b>\t\t\t\tVOICE\n</b>\t\tStage One.\n<b>    \n</b><b>\t\t\t\tSECRETARY\n</b>\t\tPaul, I have Mr. Kesher for Cynthia.\n<b>    \n</b><b>\t\t\t\tPAUL\n</b>\t\tRight baby, all Hell's broke loose down\n\t\there. I'll try to find her.\n<b>    \n</b>Adam listens to dead silence for a moment or two then Cynthia\nspeaks.\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tAdam, where are you?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWhat's going on, Cynthia?\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tThey've closed the set. They sent\n\t\teverybody home.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWhat did you say?\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tThey fired everyone.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWho fired everyone?\n\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\t\t(starting to cry)\n\t\tRay did ... and then they closed the\n\t\tset.... everybody's gone. You'd better\n\t\tget down here Adam!\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tNo.\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tYou've got to talk to Ray you've got to\n\t\tfix this.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tI'm going home.\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tHome! Meet me at the office. We've got\n\t\tto do something ... you've got to do\n\t\tsomething Adam!\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tI'm going home Cynthia.\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tAdam, this isn't like you. Please come\n\t\tto the office. There must be something\n\t\twe can do.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tI'm going home. I'll call you later.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. - 1612 HAVENHURST - DAY\n</b><b>    \n</b><b>ESTABLISH\n</b><b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT . AUNT RUTH'S APARTMENT - DAY\n</b><b>    \n</b>The girls are still sitting on the leather couch as before,\nbut now silently off in their own worlds. After a moment...\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI wonder where you were going.\n<b>    \n</b>Betty's question hangs in the air. Slowly we move close to\nRita who is on the verge of remembering something.\n\n<b>    \n</b>Suddenly -\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tMulholland Drive.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tMulholland Drive?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tThat's where I was going... Mulholland\n\t\tDrive.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tMaybe that's where the accident was.\n\t\tThere must be a police report. We could\n\t\tcall.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tNo.... I don't...\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWe could call anonymously from a pay\n\t\tphone... just to see if there was an\n\t\taccident.\n<b>    \n</b>Rita sits worrying.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tCome on. It'll be just like in the\n\t\tmovies. We'll pretend to be someone\n\t\telse. I want to walk around anyway. I'm\n\t\tin Hollywood and I haven't even seen any\n\t\tof it. Come on Rita. Do you feel up to\n\t\tit?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tOkay... but just...just to see.\n\n<b>\t\t\t\tBETTY\n</b>\t\tJust to see if there was an accident on\n\t\tMulholland Drive.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(tentatively)\n\t\tOkay.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tCome on... let's find you something to\n\t\twear.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>AUNT RUTH'S BEDROOM - DAY\n</b><b>    \n</b>Betty laughs as she holds one of Ruth's dresses in front of\nRita.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tIt's terrible ... My Aunt dresses like Miss\n\t\tMarple.\n\t\t\t(off a blank stare from Rita )\n\t\tShe's kind of a frumpy woman detective in\n\t\tBritish movies.\n<b>    \n</b>Rita laughs along with Betty. Betty goes back in the closet.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tHere's something okay.\n<b>    \n</b>She brings out a pair of khaki pants.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tTry these on. You can wear one of my T-\n\t\tshirts with it and it won't look bad with\n\t\tthose sandals.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. ADAM'S HOUSE - BEL AIR\n</b><b>    \n</b>Adam pulls into his driveway, but is blocked from entering\nthe garage by a poolman's truck. He gets out of the car and\nlooks at the truck - sees the insignia on the door which is a\nblue square with the word \"Gene\" above and the word \"Clean\"\nbelow. Adam hears steps behind him and turns. A JAPANESE\nGARDENER is coming toward him smiling and bowing.\n<b>    \n</b><b>\t\t\t\tJAPANESE GARDENER\n</b>\t\tAh, Mister ... you remember me. I am Taka.\n\t\tyour gardener. For long time I not see\n\t\tyou. I pleased to see you.\n<b>    \n</b>Taka reaches out his hand and Adam shakes it.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tHello Taka. It's 'cause I'm never home\n\t\tin the day time. It's good to see you\n\t\tagain. The garden looks great.\n<b>    \n</b>Taka bows, smiling and nodding, and goes back to work. Adam\nheads toward the front door of his house.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. - ADAM'S HOUSE - DAY\n</b><b>    \n</b>Adam enters, puts his 7-iron in his golf bag just inside the\ndoor, then looks around. He can see the pool through a wall\nof plate glass windows, but there is no one visible poolside.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\t\t(calling out)\n\t\tLorraine...\n\t\t\t(then louder)\n\t\tLorraine ... you home?\n<b>    \n</b>He hears a noise, something falling. He walks in the\ndirection of the noise. It leads him to his bedroom. His\nexpression darkens as he approaches the closed door. He\nhears voices as he throws the door open.\n<b>    \n</b>LORRAINE and the poolman GENE are in bed.\n<b>    \n</b><b>\t\t\t\tLORRAINE\n</b>\t\tNow, you've done it!\n<b>    \n</b><b>\t\t\t\tGENE\n</b>\t\tJust forget you ever saw it. It's better\n\t\tthat way.\n<b>    \n</b><b>\t\t\t\tLORRAINE\n</b>\t\tWhat the hell are you even doing here?\n<b>    \n</b>Adam stands stunned for a moment. Then finds himself walking\nover to the dresser and opening the top drawer. He removes a\nlarge case.\n<b>    \n</b>\t\t\t\tLORRAINE (cont'd)\n\t\tWhat are you doing?\n<b>    \n</b>Adam starts walking out of the bedroom with the case.\n<b>    \n</b>\t\t\t\tLORRAINE (cont'd)\n<b>\t\tTHAT'S MY JEWELRY!!!\n</b><b>    \n</b>Adam leaves the bedroom and starts through the house. He\ngoes into the kitchen and looks around - numb but trying to\nthink.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. ADAM AND LORRAINE'S BEDROOM - DAY\n</b><b>    \n</b>Lorraine is getting dressed as fast as she can.\n<b>    \n</b><b>\t\t\t\tLORRAINE\n</b>\t\tThat bastard!\n\n<b>    \n</b><b>\t\t\t\tGENE\n</b>\t\tHe's probably upset Lorraine.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. ADAM'S KITCHEN - DAY\n</b><b>    \n</b>Adam leaves the kitchen and goes out into the garage. He\nturns on the light and looks around. He spots some paint\ncans on a shelf and grabs one and goes back into the kitchen.\nHe can hear Lorraine calling his name. She seems to be\ncoming closer. He sets the jewelry case and the paint can on\nthe floor, kneels down and opens the paint can with his car\nkey. Just as Lorraine enters the kitchen, he opens the\njewelry box and empties the 3/4 full gallon can of Hot Pink\npaint into her jewelry case.\n<b>    \n</b><b>\t\t\t\tLORRAINE\n</b><b>\t\tWHAT.. ARE ... YOU ... DOING!!!???\n</b><b>    \n</b>He puts his hands into the paint and jewels and smushes them\nabout. Lorraine rushes toward him.\n<b>    \n</b>\t\t\t\tLORRAINE (cont'd)\n<b>\t\tSTOP IT!!!\n</b><b>    \n</b>Lorraine grabs hold of him. Starts pulling his hair,\nslapping his face. She tears his jacket. Adam stands all at\nonce and with his wet Hot Pink hands he pushes Lorraine and\nslams her into the kitchen counter just as Gene the poolman\nenters. Gene grabs ahold of Adam, cocks back and slams his\nhuge suntanned fist into Adam's face.\n<b>    \n</b><b>\t\t\t\tGENE\n</b>\t\tThat's not a way to treat your wife,\n\t\tbuddy. I don't care what she's done.\n<b>    \n</b>Adam gets up off the floor bleeding from the nose and tries\nto hit Gene. Gene blocks his punch and slams Adam again,\nknocking him down to the kitchen floor where he lands and\nspills the jewelry case. Adam, now covered with paint, is\npicked up by Gene and thrown out toward the front door.\n<b>    \n</b><b>\t\t\t\tLORRAINE\n</b>\t\tThrow him out!\n<b>    \n</b>Lorraine opens the front door while Gene picks Adam up, moves\nhim across the carpet and heaves him out onto the front lawn.\nLorraine slams the door behind him.\n<b>    \n</b>Adam picks himself up, severely dazed and bleeding pretty\nbadly, he heads for his car.\n\n<b>    \n</b>Taka stops gardening and smiles and bows at Adam as he gets\ninto his car.\n<b>    \n</b>Adam drives away - pink paint and red blood all over.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT.  AUNT RUTH'S BEDROOM - DAY\n</b><b>    \n</b>Rita is now dressed to go out and is studying herself in a\nmirror. She turns and her gaze falls to her purse. She\npicks it up and looks questioningly at Betty.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tNo ... you shouldn't take that. Let's hide\n\t\tit.\n<b>    \n</b>They look around the room... There's a hatbox in the closet\nabove the clothes rack. Betty brings it down, takes out the\nhat, and Rita puts the purse inside. Betty puts the hat over\nthe purse in the hatbox and puts in back in the closet.\nBetty puts out her hand. Rita looks at it for a moment,\nsmiles, and they shake.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. APARTMENT COURTYARD - DAY\n</b><b>    \n</b>All dressed now Betty and Rita leave Aunt Ruth's apartment\nand walk across the courtyard past Coco's apartment and out\nthrough the iron gates. No one is about.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. HOLLYWOOD RESIDENTIAL STREET - DAY\n</b><b>    \n</b>Betty and Rita walk along. Birds are chirping in the trees\nwhich line both sides of the street. Betty is smiling and\nonce again looking around at everything. Her good mood and\nexcitement about life lifts Rita's spirits.\n<b>    \n</b>Coming toward them on the sidewalk are two people - a middle-\naged woman and a young boy around 10 years old. The boy is\nvery thin and something is wrong with him as he is walking\nawkwardly on crutches. As the two groups pass each other on\nthe sidewalk Betty is struck deeply by the boy's brilliant,\nluminous blue eyes which are at once innocent and filled with\nwisdom.\n\n<b>    \n</b>After they pass each other Betty turns back and sees the boy\nand the woman enter 1612 Havenhurst. Betty and Rita continue\nup the street.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. SUNSET BOULEVARD - DAY\n</b><b>    \n</b>The girls walk along the busy boulevard, past guitar shops,\nvideo stores. Betty is looking for a payphone. Rita's eyes\ndart back and forth nervously. She's beginning to feel\nfrightened.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>PAYPHONE ON RED BRICK WALL - DAY\n</b><b>    \n</b>We see the red brick building. It is Denny's. Betty and\nRita are walking to the payphone. Betty digs out some change\nfrom her purse. She picks up the receiver, drops in a\nquarter and dials the \"0\" for Operator. An Operator answers.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHollywood Police Department please.\n<b>    \n</b><b>\t\t\t\tOPERATOR\n</b>\t\tIs this an emergency?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNo, no, I just want the number.\n<b>    \n</b><b>\t\t\t\tOPERATOR\n</b>\t\tHold for the number.\n<b>    \n</b>Betty gets the number for the Hollywood Police Station, re-\ndeposits the quarter and dials.\n<b>    \n</b><b>\t\t\t\tVOICE\n</b>\t\tHollywood Police Department\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI'm inquiring about an accident that\n\t\thappened last night on Mulholland Drive.\n<b>    \n</b><b>\t\t\t\tVOICE\n</b>\t\tHold please. I'll connect you to\n\t\ttraffic.\n<b>    \n</b>Betty holds.\n<b>    \n</b><b>\t\t\t\tSERGEANT BAXTER\n</b>\t\tTraffic. Sergeant Baxter speaking.\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHi. I'm inquiring ...well, I heard a\n\t\tsound last night that sounded like a car\n\t\tcrash and I want to know if there was an\n\t\taccident on Mulholland Drive.\n<b>    \n</b><b>\t\t\t\tSERGEANT BAXTER\n</b>\t\tYes, there was.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tCan you tell me what happened?\n<b>    \n</b><b>\t\t\t\tSERGEANT BAXTER\n</b>\t\tNo. I can't.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWas anyone hurt?\n<b>    \n</b><b>\t\t\t\tSERGEANT BAXTER\n</b>\t\tMay I have your name please?\n<b>    \n</b>Betty hangs up. She turns to Rita smiling like a girl who's\ndone something bad and gotten away with it.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThere was an accident. He wouldn't tell\n\t\tme anything else, but that was your\n\t\taccident Rita. I just know it was.\n\t\tMaybe there's something about it in the\n\t\tpapers. Come on I'll buy you a cup of\n\t\tcoffee and we can see.\n<b>    \n</b>Betty and Rita enter Denny's.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT.- DENNY'S - DAY\n</b><b>    \n</b>Rita and Betty are seated next to the table where Dan and\nHerb sat earlier in the day. They both have a cup of coffee\nin front of them. Betty has a newspaper open and she is\nscanning the last pages.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tMaybe it happened so late it's not going\n\t\tto be in today's paper.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tThere's nothing?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNot that I can see.\n\n<b>    \n</b>The same waitress - Diane, comes up to the girl's table and\nfreshens up their coffee. Betty looks up and smiles, sees\nDiane's nameplate.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tThank you ... Diane.\n<b>    \n</b>Rita shoots a look from Betty to Diane to the nameplate.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b>close-up nameplate\n<b>    \n</b>The word \"DIANE\" is huge from Rita's POV.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b>Back to scene\n<b>    \n</b>Diane finishes pouring Rita's cup and smiles at Betty.\n<b>    \n</b><b>\t\t\t\tDIANE\n</b>\t\tYou're welcome. Will that be all? You\n\t\twant your check?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tJust the coffee. Rita, you want\n\t\tsomething?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(still staring at the nameplate\n\t\t\t- thinking)\n\t\tNo. Just the coffee.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWe'll take our check.\n<b>    \n</b>Diane searches through her many checks to find Betty and\nRita's.\n<b>    \n</b>The manager of Denny's, standing with a woman in a blue\ndress, calls Diane's name. Diane turns and looks to the\nmanager and the woman. A fleeting fear goes through her\neyes. She surreptitiously reaches in her pocket and takes\nout a Mont Blanc fountain pen which she puts under Betty's\ncheck as she places it on their table. She does this very\nquickly but Betty notices this and Diane notices Betty\nnoticing. Diane walks quickly over to the manager and the\nwoman in the blue dress. Betty turns and watches a heated\nconversation that she can't hear, but she sees the woman in\nthe blue dress searching her purse and shrugging and then\nleaving.\n\n<b>    \n</b>The manager says something to Diane and Diane turns her\npockets inside out and pats herself down in front of the\nmanager showing him her innocence. He waves her off and she\ngoes behind the counter to retrieve an order of food. Betty\nstops watching and turns her attention to Rita, who is tense\nand lost in a thought.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tWhat is it Rita?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(without moving a muscle)\n\t\tShhhh.\n<b>    \n</b>At that moment Diane the waitress reappears at their table.\nDiane looks Betty in the eye and while looking at Betty her\nleft hand slides the Mont Blanc out from under the check and\nback into her pocket.\n<b>    \n</b><b>\t\t\t\tDIANE\n</b>\t\tThank you. Come in again.\n<b>    \n</b>Betty holds her gaze.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou're welcome. We will.\n<b>    \n</b>Relieved Diane leaves and goes about her business. Betty\nlooks over at Rita waiting for her to tell her something.\nRita slowly turns and focuses on Betty.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tI remember something... I remember\n\t\tsomething!\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. - HAVENHURST - DAY\n</b><b>    \n</b>Betty and Rita are walking back to the apartment. We see\nthem from a distance. They are talking and gesturing in an\nexcited and animated way. Just after they enter through the\niron gates of 1612 Havenhurst and are out of sight we notice\na car moving slowly up Havenhurst toward us. We notice two\nmen in the front seat who seem to be looking around for\nsomething.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. - AUNT RUTH'S APARTMENT - DAY\n</b><b>    \n</b>The door slams shut. Rita grabs Betty's shoulders.\n\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t<u>Diane</u> <u>Selwyn</u>. Maybe it's my name.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>AUNT RUTH'S APARTMENT - MOMENTS LATER\n</b><b>    \n</b>Betty and Rita are sitting next to each other on the leather\ncouch. Betty is rifling through the phone book. She finds\nthe listings for Selwyn. Her finger drifts down and finds D.\nSelwyn followed by an address and phone number. It is the\nonly Selwyn with a D. first name. She hands the phone to\nRita.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tStrange to be calling yourself.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tMaybe it's not me.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tCall the number.\n<b>    \n</b>Betty reads the number off and Rita pushes the corresponding\nbuttons. Each tone seems to be louder than the last. The\nringing seems deafening. There's a click and the phone is\nanswered - by a machine. A woman's voice is heard - loudly.\n<b>    \n</b><b>\t\t\t\tWOMAN'S VOICE\n</b>\t\t\t(coming from answering machine)\n\t\tHi ... this is me. Leave me a message.\n<b>    \n</b>Betty now has her ear pressed up against the phone also -\nstraining to hear everything. The machine starts recording.\nBetty hangs up the phone immediately.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tIt's not my voice ... but I know her.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tMaybe the voice isn't Diane Selwyn.\n\t\tMaybe that's your roommate or if it is\n\t\tDiane Selwyn she can tell you who you\n\t\tare.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tMaybe...maybe ... maybe.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. - ADAM'S HOUSE - AFTERNOON\n</b><b>    \n</b>Taka is bowing and smiling and nodding to someone we don't\nsee.\n<b>    \n</b>TAKA'S POV - A man, KENNY, in a sharp black suit is walking\ndown the driveway past Gene the Poolman's truck to the front\ndoor of Adam's house. Parked at the street is a big limo\nwith Vincenzo and Luigi Castigliane sitting in the back.\n<b>    \n</b>Kenny knocks on Adam's front door. Lorraine answers.\nLorraine's hands are covered with pink paint. Pink paint is\non her face and clothes.\n<b>    \n</b><b>\t\t\t\tKENNY\n</b>\t\tAdam Kesher...he...\n<b>    \n</b><b>\t\t\t\tLORRAINE\n</b>\t\tYeah, right ... get lost!\n<b>    \n</b>She slams the door, but Kenny's foot stops it and pushes it\nback with a force that shakes the wall as the door slams open\nonce again. Kenny enters the house.\n<b>    \n</b><b>\t\t\t\tKENNY\n</b>\t\tThis is Adam Kesher's house. Where...\n<b>    \n</b><b>\t\t\t\tLORRAINE\n</b>\t\tLike hell it is! Get out ... NOW!!!\n<b>    \n</b>Gene comes out of the kitchen fast, his hands covered with\npink paint.\n<b>    \n</b><b>\t\t\t\tGENE\n</b>\t\tI guess you don't understand English.\n\t\tShe asked to leave. Here's the door.\n<b>    \n</b>Gene grabs hold of Kenny and starts to push him out the door.\nKenny rabbit punches Gene in the nose with lightning speed -\nhis fist like a sledgehammer. Gene goes down. Lorraine\nshrieks and leaps on Kenny. Her long fingernails going for\nhis eyes. Kenny slaps Lorraine hard. The shriek stops\ninstantly and she falls out cold on the carpet. Gene is back\nup and going for Kenny. Kenny gets three punches in on Gene's\nhead before Gene hits the ground unconscious. Kenny rubs some\npink paint off his hands and tries to get a pink stain off\nhis jacket. He begins walking around the house calling out\nfor Adam. He sees nothing and hears nothing. He goes back to\nthe front door and sees Adam's golf clubs sitting there.\nKenny begins snapping the shaft of each club. As he snaps\neach club we see Lorraine and Gene remain out cold on the\nfloor.\n\n<b>    \n</b>And in the kitchen we see that the tap is on and the sink\nwater is now overflowing from the sink and jewelry box -\nspilling out onto the kitchen floor. Finishing his work with\nthe vintage golf clubs - Kenny leaves.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. - ADAM'S HOUSE - AFTERNOON\n</b><b>    \n</b>Kenny jumps into the front seat of the limo. Vincenzo and\nLuigi nod to the driver and they take off.\n<b>    \n</b>Taka hoes some weeds beneath a Jacaranda.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>L.A. AERIAL SHOT HIGH ANGLE - NIGHT\n</b><b>    \n</b>Night descends on Los Angeles. Millions of lights down below\ntwinkle like stars.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. 1612 HAVENHURST - NIGHT\n</b><b>    \n</b>We see the courtyard at night. Some of the apartment windows\nhave dim, warm lights. Most all is in darkness. The only\nsound is the water flowing in the fountain with muted distant\ntraffic. Far away a siren wails softly.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - NIGHT\n</b><b>    \n</b>Betty and Rita are on their hands and knees around the coffee\ntable. A map of L.A. is unfolded and Betty is running her\nfinger along a street. Her finger stops.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tIt's right about here on Sierra Bonita.\n\t\tThat's not too far away.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. COURTYARD - SIMULTANEOUS\n</b><b>    \n</b>An older, beautiful woman - drunk, is walking slowly -\nstrangely toward the door of Aunt Ruth's apartment.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b>\n<b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - NIGHT - SIMULTANEOUS\n</b><b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat's wrong with that?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tI'm not sure about this.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI know you're afraid of something. We'll\n\t\tbe careful. Tomorrow we'll go over there\n\t\tand we'll find out.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. 1612 HAVENHURST COURTYARD - NIGHT\n</b><b>    \n</b>The woman moves up to the door we see her face. Her eyes have\nthe eerie look of one possessed. She knocks mechanically on\nthe door.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b>\n<b>INT. AUNT RUTH'S APARTMENT\n</b><b>    \n</b>Betty and Rita both turn with alarm. Betty gets up, stares\nat the door, then at Rita. Rita waits, not knowing what to\ndo.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tIt'll be okay.\n<b>    \n</b>Betty opens the door. Betty finds the face of the actress,\nLOUISE BONNER, staring questioningly at her.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tYes? May I help you?\n<b>    \n</b><b>\t\t\t\tLOUISE\n</b>\t\tWhere is Ruth?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tRuth's gone on a film. I'm her niece\n\t\tBetty.   Who are you?\n\n<b>\t\t\t\tLOUISE\n</b>\t\tSomeone is in trouble. Who are you? Why\n\t\tare you in Ruth's apartment?\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI'm her niece. She's letting me stay\n\t\there. My name is Betty.\n<b>    \n</b><b>\t\t\t\tLOUISE\n</b>\t\tNo it isn't. That's not it. That's not\n\t\twhat she said. Something bad's happening.\n\t\tWhere's Ruth?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI'm sorry, but I don't know who you are\n\t\tand I'm...\n\n<b>\t\t\t\tCOCO\n</b>\t\tLouise... what're are you doing Louise?\n<b>    \n</b>Louise turns and sees Coco approaching across the courtyard.\n<b>    \n</b><b>\t\t\t\tLOUISE\n</b>\t\tWhere have you been Coco? God, I've been\n\t\ttrying to find you all afternoon since\n\t\t3:00 o'clock. That one is in my room and\n\t\tshe won't leave. I want you to get her\n\t\tout. I want you to get her out now.\n<b>    \n</b>Coco comes up and grabs hold of Louise. She turns over to\nBetty.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tThis is Louise Bonner. I'm sure she\n\t\tmeant well.\n\t\t\t(looking over to Louise)\n\t\tThis is Betty, Ruth's niece. In fact and\n\t\tfortunately I was just coming to see\n\t\tBetty. Betty's a young actress and I'm\n\t\tdelivering faxed pages of a scene for her\n\t\taudition tomorrow. Here they are honey.\n\t\tNow come along Louise and I'll take you\n\t\thome.\n\t\t\t(back to Betty)\n\t\tSorry about this. Sometimes it happens.\n<b>    \n</b><b>\t\t\t\tLOUISE\n</b>\t\tNo, she said it was someone else in\n\t\ttrouble.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tStop it, Louise. Let's get you\n\t\thome ... goodnight Betty.\n<b>    \n</b>Coco takes Louise back through the darkness of the courtyard.\nBetty closes the door and turns.\n<b>    \n</b><b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhoa!\n<b>    \n</b>She catches Rita's look. Rita is staring at her, horrified.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. BEVERLY HILLS HOTEL - NIGHT\n</b><b>    \n</b>Establish\n<b>    \n</b><b>INT. BEVERLY HILLS HOTEL - CORRIDOR OUTSIDE ROOM 214\n</b><b>    \n</b>A Hotel Manager is walking toward the door of room 214. He\nknocks softly on the door. The door opens and Adam Kesher is\nstanding there - still beaten looking with remnants of pink\npaint.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tYes...what is it?\n<b>    \n</b><b>\t\t\t\tHOTEL MANAGER\n</b>\t\tI'm sorry Mr. Kesher, but there seems to\n\t\tbe some problem concerning your credit\n\t\tcard.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\t... What??\n<b>    \n</b><b>\t\t\t\tHOTEL MANAGER\n</b>\t\tThe fact is Mr. Kesher a representative\n\t\tof your bank called us.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tHow...  how'd they know I was here?\n<b>    \n</b><b>\t\t\t\tHOTEL MANAGER\n</b>\t\tI don't know. All we do is take an\n\t\timpression of the credit card and until\n\t\tyou check out it just sits in our files.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tSo, what did they say?\n<b>    \n</b><b>\t\t\t\tHOTEL MANAGER\n</b>\t\tWell, Sir, I'm afraid they said you're\n\t\toverdrawn at your bank and your line of\n\t\tcredit has been cancelled.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tUnbelievable. Look... here.\n\t\t\t(Adam taking out his wallet.)\n\t\tI don't know what's going on.\n\t\tThat's so much baloney. I've got enough\n\t\tcash for one night, okay?\n<b>    \n</b><b>\t\t\t\tHOTEL MANAGER\n</b>\t\tThat's fine, Mr. Kesher. You can pay\n\t\tcash when you check out. I'm sorry. it\n\t\twas my duty to inform you.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tFine. I'll check out in the morning.\n\n<b>\t\t\t\tHOTEL MANAGER\n</b>\t\tHave a good evening, Mr. Kesher.\n<b>    \n</b>The Hotel Manager turns to leave and Adam closes the door.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. ROOM  214 - NIGHT\n</b><b>    \n</b>Adam crosses the room to the phone and dials a number. The\nphone is answered.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tSomeone's shut off my money!\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tI know.  Where are you Adam?\n\n<b>\t\t\t\tADAM\n</b>\t\tWhat do you mean \"you know\"?\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tSomeone called me. When they couldn't\n\t\tget you they told me you were as good as\n\t\tbroke. I didn't believe then, so I made\n\t\tsome calls.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tAnd?\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tYou're broke!\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tBut I'm not broke.\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tI know, but you're broke. Where are you?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tBeverly Hills Hotel. I've got enough\n\t\tcash in my pocket for one night.\n\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tDo you know somebody called the The\n\t\tCowboy?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tThe Cowboy??\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tYeah, the Cowboy. This guy, the Cowboy,\n\t\twants to see you. Jason said he thought\n\t\tit would be a good idea.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tOh, Jason thought it would be a good idea\n\t\tfor me to meet the Cowboy. Should I wear\n\t\tmy ten gallon hat and my six shooters?\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tSomething tells me this guy is connected\n\t\twith what's happening, Adam, and I think\n\t\tyou should do it and I think you should\n\t\tdo it right away.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tCynthia...what's going on?\n\n<b>\t\t\t\tCYNTHIA\n</b>\t\tIt's been a very strange day.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tAnd getting stranger. Where do I meet\n\t\tthis Cowboy? I mean do I have to ride\n\t\tout to the range?\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tSort of, funny boy. If I tell him the\n\t\tmeeting's on you're to go to the top of\n\t\tBeachwood Canyon. There's a corral up\n\t\tthere where he'll be.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tYou gotta be kidding?\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tWill you meet with him?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tYeah, sure. It is that kind of a day.\n\t\tWhen?\n\n<b>\t\t\t\tCYNTHIA\n</b>\t\tI'll call him, then call you back...If\n\t\tyou want you could stay at my place.\n<b>    \n</b>\n<b>\t\t\t\tADAM\n</b>\t\tCynthia... that would not be a good idea.\n\n<b>\t\t\t\tCYNTHIA\n</b>\t\tI'm just offering a place to stay.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tI understand, Cynthia and thank you for\n\t\tthe offer. I'll find a place. Now go\n\t\tahead and give the Cowboy a yodel and get\n\t\tback to me.\n<b>    \n</b><b>\t\t\t\tCYNTHIA\n</b>\t\tOkay, but you don't know what you're\n\t\tmissing.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tGit along little dowgie and call me back.\n<b>    \n</b>Adam hangs up and seems to sag, cupping his forehead and eyes\nwith his hand.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. BEACHWOOD CANYON - NIGHT\n</b><b>    \n</b>Adam, in his Porsche, makes his way up the canyon.\n<b>    \n</b><b>INT. PORSCHE\n</b><b>    \n</b>Adam feeling like a fool drives up the dark, winding canyon\nroad. As he nears the top of the canyon the residential area\ngives way to desert brush. The road winds steeply up to a\ndark dead end where an old barn and stable sit. Adam parks in\na little dirt lot and walk up past the barn to the corral.\nHis eyes grow accustomed to the dark and he.looks about. No\none is around. There's only a light wind and a few twinkling\nstars in the sky above. Suddenly some bare bulbs hanging from\nthe corral gate flare up. Adam hears a noise in the\nbrightness and turns. There walking toward him into the light\nis the Cowboy - dressed in clean blue denim jeans, well-oiled\nunscuffed, beautifully engraved cowboy boots, a red\nembroidered ivory buttoned cowboy shirt complete with string\ntie. Atop the Cowboy's head is a 10 X white Stetson. The\nCowboy is smiling warmly as he approaches. He stops in front\nof Adam and begins to speak with a true, slow Western drawl.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tHowdy!\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tHowdy to you.\n\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tBeautiful night.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tYeah.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tSure want to thank ya for drivin' all the\n\t\tway up to see me from that Beverly Hills\n\t\tHotel.\n\n<b>\t\t\t\tADAM\n</b>\t\tNo problem. What's on your mind?\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tWell now, here's a man who wants to get\n\t\tright to it. Kinda anxious to get to it\n\t\tare ya?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tWhatever.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tA man's attitude ... a man's attitude goes\n\t\tsome ways toward how a man's life will\n\t\tbe. Is that somethin' you agree with?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tSure.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tNow... did you answer cause you thought\n\t\tthat's what I wanted to hear or did you\n\t\tthink about what I said and answer cause\n\t\tyou truly believe that to be right?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tI agree with what you said...truly.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tWhat did I say?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tThat a man's attitude determines to a\n\t\tlarge extent how his life will be.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tSo since you agree I guess you could be a\n\t\tperson who does not care about the good\n\t\tlife.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tHow's that?\n\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tWell, just stop for a little second and\n\t\tthink about it. Will ya do that for me?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tOkay, I'm thinking.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tNo. You're too busy being a smart aleck\n\t\tto be thinkin'. Now I want ya to think\n\t\tand quit bein' such a smart aleck. Can ya\n\t\tdo that for me?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tLook ... where's this going? What do you\n\t\twant me to do?\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tThere's sometimes a buggy. How many\n\t\tdrivers does a buggy have?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tOne.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tSo let's just say I'm drivin' this buggy\n\t\tand you fix your attitude and you can\n\t\tride along with me.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tOkay.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tNow I know a few things. I know you have\n\t\thad a rough day. You're probably thinkin'\n\t\tI don't know the half of it, but in\n\t\tactual fact I know every part of it. The\n\t\tbusiness of gittin' thrown off your\n\t\tmovie, the heartache of seeing your wife\n\t\twith another man... losin' access to that\n\t\tprecious film vault...\n<b>    \n</b>Adam suddenly looks stunned, unsure.\n<b>    \n</b>\t\t\t\tCOWBOY (cont'd)\n\t\t... realizin' you don't have hardly a\n\t\tnickel to your name and then add on to\n\t\tthat the sickenin' feeling some men are\n\t\tgonna catch you and hurt you bad for\n\t\tbustin' their vehicle. Some days are like\n\t\tthat. They are rough, but what will\n\t\ttomorrow bring? Will it be better than\n\t\ttoday? The same ... or worse?\n\t\tA lot of that is up to us individually.\n\t\tUp to us and our attitude. When the\n\t\tCastigliane brothers said \"This is no\n\t\tlonger your film,\" they meant it, but\n\t\tthey didn't mean you were not going to\n\t\tdirect it. I want you to go back to work\n\t\ttomorrow. You were re-casting the lead\n\t\tactress anyway ... audition many girls for\n\t\tthe part. When you see the girl that was\n\t\tshown to you earlier today, you will say\n\t\t\" This is the girl.\" The rest of the\n\t\tcast can stay- that is up to you, but\n\t\tthat lead girl is not up to you. Now,\n\t\tyou will see me one more time if you do\n\t\tgood. You will see me two more times if\n\t\tyou do bad. Good night.\n<b>    \n</b>The Cowboy turns and walks until he is engulfed in darkness.\nThrough the darkness Adam hears the sound of a car door\nopening and closing, then another opening and closing and\nthen the sound of the car driving away. Adam walks up in the\ndirection the Cowboy took, but he sees no sign of a car nor\nany dust nor any road. He goes back down past the barn and\nstables to his car. There standing by his Porsche is the\nCowboy.\n<b>    \n</b>\t\t\t\tCOWBOY (cont'd)\n\t\tYou thinkin' this'll work out, cause I\n\t\twas thinkin' it just might.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tIt will work out.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tGood then, but, just in case, that bank's\n\t\tgonna stay closed a bit longer. You\n\t\tunderstand that?\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tI understand.\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tYou're an understandin' fella.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tSo, this is the last time I see you then\n\t\tunless I do bad?\n<b>    \n</b><b>\t\t\t\tCOWBOY\n</b>\t\tNo, this one doesn't count. It's part of\n\t\tthe original one. So then ... until we meet\n\t\tagain.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tOkay.\n<b>    \n</b>Adam gets in his car and drives off leaving the Cowboy\nsmiling behind him.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. HOLLYWOOD - MORNING\n</b><b>    \n</b>We see the rays of the rising sun falling on the huge letters\nof the HOLLYWOOD SIGN and the hills surrounding it.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT.  AUNT RUTH'S APARTMENT. - MORNING\n</b><b>    \n</b>We see Rita's face as we hear Betty off screen.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\"You're still here?\"\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\"I came back. I thought that's what you\n\t\twanted.\"\n<b>    \n</b>We see Betty.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(angrily)\n\t\t\"Nobody wants you here!\"\n<b>    \n</b>Moving back we realize that the girls are acting out Betty's\naudition scene. Rita is reading her lines.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\"Really?\"\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\"My parents are right upstairs! They\n\t\tthink you've left...\"\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\"So... surprise\"...\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\"I can call them... I can call my dad... \"\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\"But you won't...\"\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\"You're playing a dangerous game here.\n\t\tIf you're trying to blackmail me... it's\n\t\tnot going to work.\"\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\"You know what I want...it's not that\n\t\tdifficult.\"\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(furious)\n\t\t\"Get out! Get out before I call my\n\t\tdad ... he trusts you ... your his best\n\t\tfriend. This will be the end of\n\t\teverything... \"\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\"What about you? What will your dad\n\t\tthink about you?\"\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\"Stop! Just Stop! That's what you said\n\t\tfrom the beginning. If I tell what\n\t\thappened... they'll arrest you and put you\n\t\tin jail, so get out of here before...\"\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\"Before what?\"\n<b>    \n</b>Betty pulls a table knife out from behind her back.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\"Before I kill you.\"\n\n<b>\t\t\t\tRITA\n</b>\t\t\"Then they'd put you in jail.\"\n<b>    \n</b>Betty mimes with moving fingers tears flowing from her eyes.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tCry, cry, cry, and then I say with big\n\t\temotion, \"I hate you... I hate us both!\"\n<b>    \n</b>Betty drops the kitchen knife and both girls start laughing.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tSuch a lame scene.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tBut you are <u>really</u> good.\n<b>    \n</b>Betty mimes tapping a cigarette in a cigarette holder ala\nDietrich.\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThank you dahling!\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. COCO'S APARTMENT - DAY\n</b><b>    \n</b>On the move Coco is just bringing her cigarette in its holder\nup to her painted red lips. The phone is ringing and she's\ncrossing the room to answer it.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\t\t(into phone)\n\t\tHello ... Ruthie... How's the great up\n\t\tnorth? ... Oh, I'm sorry to hear\n\t\tit ... what? Well, I haven't seen her if\n\t\tshe's in there. Now, Ruthie there's\n\t\tnothing to worry about. I saw Betty last\n\t\tnight and she was just fine. Yes, and I\n\t\tgave them to her. She's a real nice kid,\n\t\tRuthie. Now stop worrying, will ya.\n\t\tI'll go over and have a look around. I\n\t\twill. I've got the production office\n\t\tnumber. I'll find you. Now keep your\n\t\tsocks on up there and take lots of \"C.\"\n\t\tGoodbye honey.\n<b>    \n</b>Coco puts down the receiver with a long sigh.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - DAY\n</b><b>    \n</b>Betty and Rita are sitting on the leather couch having some\ncoffee. The front door to the apartment is open and sunlight\nis pouring in through the screen door. Betty looks at her\nwatch.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOh, no wonder I'm starving. I'm going to\n\t\tfix a sandwich. You want one?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tI'm all right.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou've got to eat something. You're just\n\t\tnervous about going over to see if you're\n\t\tDiane Selwyn.\n<b>    \n</b>Rita just looks at her. Betty starts for the kitchen.\n<b>    \n</b><b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tSuit yourself. I'll share mine with you\n\t\tif you change your mind.\n<b>    \n</b>Betty goes into the kitchen. Suddenly there's a knock on the\nscreen door and Coco peers in, seeing Rita on the couch.\nRita looks up ... panicked.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tHi! Who are you?\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tUh...Betty!?\n<b>    \n</b>Betty comes out from the kitchen and sees the situation.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tCan I see you outside a minute Betty?\n<b>    \n</b>Betty walks past Rita, pats her on the shoulder and goes\noutside to see Coco who has moved away to wait.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. COURTYARD 1612 HAVENHURST - DAY\n</b><b>    \n</b>The screen door slams. Coco and Betty face each other close,\nout of earshot of Rita.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tYour Aunt called me.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI was afraid of that.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tShe wants to know who's staying in her\n\t\tapartment.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(slowly, deliberately)\n\t\tIt's just for a night or two, until she\n\t\tfinds her own place. I tried to explain\n\t\tthat to Aunt Ruth, but the connection was\n\t\tbad and her plane was leaving and she got\n\t\tit all mixed up. I kept telling her it\n\t\twas my friend and she kept saying she\n\t\tdidn't know any Ritas ...\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tSweetie, look at me straight.\n<b>    \n</b>Betty lifts her eyes to Coco's. Direct, clear.\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tCoco...she's very nice. We went to\n\t\tschool together.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tSo I guess your Grandpa and Grandma know\n\t\ther.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNot really. I met her in junior college\n\t\tand she was from this other town.\n<b>    \n</b>Coco looks hard into Betty's innocent face.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tYou can call my grandparents ... I'm sure\n\t\tthey'd tell you that I don't lie and I\n\t\tsure wouldn't allow a stranger to invade\n\t\tmy Aunt Ruth's apartment.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tHoney... I was married to a director for\n\t\tthirty years. He had an uncanny ability\n\t\tto read people. Maybe some of it rubbed\n\t\toff on me or maybe I had it all\n\t\talong ... you're a good kid... What you're\n\t\ttelling me is a load of horse - pucky but\n\t\tit comes from a good place. I'll trust\n\t\tyou to sort this out. Now I'm not going\n\t\tagainst Ruth. She's got enough to worry\n\t\tabout up there in Canada. If she asks-\n\t\tI'm going to say everything is okay, and\n\t\tyou make sure it is.\n\t\t\t(Coco places her hand on\n\t\t\tBetty's shoulder and squeezes\n\t\t\tit)\n\t\tIf you need any help you know where to\n\t\tfind me.\n<b>    \n</b>Betty puts her hand on Coco's shoulder and gives her a\nsqueeze.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou're really something Coco...thank you.\n\n<b>\t\t\t\tCOCO\n</b>\t\tDon't make me out to be a sucker. Louise\n\t\tBonner says there's trouble in there.\n\t\tYou remember last night. Sometimes she's\n\t\twrong, but if there is trouble - get rid\n\t\tof it.\n\n<b>    \n</b>Coco turns and walks away. Betty studies her and thinks\nabout what she said before turning and going back inside.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - SAME\n</b><b>    \n</b>Betty enters through the screen door. Rita studies her.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tIs everything all right? Is it bad for\n\t\tyou that I'm here?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(slightly forcing a broad\n\t\t\tsmile)\n\t\tEverything is A-okay, but I've gotta get\n\t\tthat sandwich!\n<b>    \n</b>On her way to the kitchen she checks her watch.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tAnd I've got an audition in one hour.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. HOLLYWOOD POLICE STATION - DAY\n</b><b>    \n</b>Detective Neal Domgaard throws two wallets down on the desk\nin front of Detective Harry McKnight. Harry pauses in the\nmiddle of a large bite of grilled cheese sandwich with bacon\nand tomato. He looks down and studies the wallets.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\t\t(biting in and chewing)\n\t\tNice wallets.\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tHandstitched Italian. Filled with phony\n\t\tcredit cards ... off the two guys in the\n\t\tCaddy.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tThe one of 'em still alive?\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tYeah... just .... Dr. Scott's got 'im. You\n\t\tremember Dr.Scott.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tOh yeah.\n\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tWell he said...  you know in his way... you\n\t\tknow what I mean? Besides the guy\n\t\tgettin' rolled up under the kids car\n\t\twhich busted him up pretty bad, there was\n\t\tthis little knife-like torn piece of\n\t\tmetal, you know, off the car body, rolled\n\t\tout and slid up through this guy's neck\n\t\tand just kinda slit his aorta, you know,\n\t\tbut they didn't find it right away, so\n\t\tthe guy's losin' a lot of blood, you\n\t\tknow, to the brain - all this time cause\n\t\tit was just like this thin little\n\t\tpuncture wound on the surface of his neck\n\t\tthat kinda sealed itself, he said, while\n\t\tinside the aorta is bleedin' pretty\n\t\tsteady all that time. So, Dr. Scott's\n\t\tlaughin' you know like he does 'cause he\n\t\tknows we want to talk to this guy. He's\n\t\tlaughin' you know and shakin'... Son of a\n\t\tbitch couldn't stop laughin'... It was\n\t\tkinda contagious 'cause pretty soon we\n\t\twere all laughin'...the nurse was\n\t\tlaughin'. You know how he is.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tFind out who they are?\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tNope, not yet. Their fingerprints don't\n\t\tmatch up anywhere.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\t\t(another big bite - chewing)\n\t\tInteresting.\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tYeah ... and they both use the same\n\t\taddress.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tWhere at?\n<b>    \n</b><b>\t\t\t\tDETECTIVE NEAL DOMGAARD\n</b>\t\tPalmdale.\n<b>    \n</b><b>\t\t\t\tDETECTIVE HARRY MCKNIGHT\n</b>\t\tDamn, that's a long drive.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b>\n<b>EXT. -  COURTYARD 1612 HAVENHURST - DAY\n</b>\n<b>    \n</b>Betty is coming out of Aunt Ruth's apartment. She calls\nback in to Rita.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI hope I'm back in a couple of hours.\n\t\tDon't drink all the coke.\n\t\t\t(we hear laughter from inside\n\t\t\tand Rita call out.)\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tGood luck!\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhen I get back I'll have the cab\n\t\twaiting, so be ready to go.\n\n<b>\t\t\t\tRITA\n</b>\t\tOkay.\n<b>    \n</b>Betty closes the door and heads across the courtyard. She\nknocks on Coco's door and in a moment Coco answers.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tSorry to trouble you, Coco.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tIt's all right gorgeous. Something\n\t\twrong?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNo, no. I'm on my way to my audition.\n\t\tBefore I go I wanted to ask you if you\n\t\tcould remember the man's name ... Aunt\n\t\tRuthie's friend who helped put this\n\t\ttogether. It completely went out of my\n\t\tmind.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tHis name's Wally Brown .... great guy.\n\t\tBeen in the business since forever.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThanks Coco. It'd be so embarrassing\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tNaw! He wouldn't have cared. Just give\n\t\thim a good performance and he'll be happy\n\t\tand I've got a feeling you'll do just\n\t\tthat.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThanks Coco. I'll let you know.\n\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tGet going. You don't want to be late.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tRight. See ya.\n<b>    \n</b><b>\t\t\t\tCOCO\n</b>\t\tGood luck, honey!\n<b>    \n</b>Betty takes off through the iron gates and Coco smiles as she\nwatches her go.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. CAB - DAY\n</b><b>    \n</b>Betty is wide-eyed and filled with awe at something she is\nseeing.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. - PARAMOUNT STUDIOS - MAIN ENTRANCE GATE - DAY\n</b><b>    \n</b>The cab pulls up to the gate. Betty pays the driver and gets\nout. She-stands for a moment staring at a dream.\n<b>    \n</b>She walks through the gate and as she goes is stopped by a\n<b>PARAMOUNT GUARD.\n</b><b>    \n</b><b>\t\t\t\tPARAMOUNT GUARD\n</b>\t\tAnd where do we think we're going, Miss?\n<b>    \n</b>Betty stops and turns.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tTo my audition.\n<b>    \n</b><b>\t\t\t\tPARAMOUNT GUARD\n</b>\t\tAnd who are we auditioning for today?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWally Brown.\n<b>    \n</b><b>\t\t\t\tPARAMOUNT GUARD\n</b>\t\tAnd do we know which of the fifty-seven\n\t\tbuildings Wally Brown is in?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(smiling)\n\t\tNo, we don't.\n<b>    \n</b><b>\t\t\t\tPARAMOUNT GUARD\n</b>\t\tWell, now we've got to figure that out\n\t\tfirst don't we?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYes, Sir.\n<b>    \n</b><b>\t\t\t\tPARAMOUNT GUARD\n</b>\t\tMr.Wallace Brown is in the Executive\n\t\tBuilding on the second floor. We want to\n\t\tgo in and turn right at the first street.\n\t\tThen we want to walk three blocks down\n\t\tpast Stage 17 to the white Executive\n\t\tBuilding. Once we're on the second floor\n\t\tthe receptionist will take us from there.\n\t\tNow do we have name?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tBetty Elms.\n<b>    \n</b><b>\t\t\t\tPARAMOUNT GUARD\n</b>\t\tLet's see if we have a pass for Betty\n\t\tElms ... and we do. Here we go. And good\n\t\tluck Miss. Elms.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThank you... thank you very much.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT.   EXECUTIVE BUILDING - SECOND FLOOR - DAY\n</b><b>    \n</b>Betty finishes climbing some stairs and crosses to the\nreceptionist. She hands over her pass. The receptionist\nlooks at it, hands it back to Betty and points down the hall\nto her left.\n<b>    \n</b><b>\t\t\t\tRECEPTIONIST\n</b>\t\tNumber 43, on the left.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThank you.\n<b>    \n</b>Betty walks down the long corridor past several offices. The\ndoor to office 43 is open when she arrives and she enters a\nlarge sitting room with a receptionist at a desk off to one\nside.\n<b>    \n</b><b>\t\t\t\tRECEPTIONIST\n</b>\t\tMay I help you?\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tMy name is Betty Elms. I'm here to\n\t\taudition for... Mr. Brown\n<b>    \n</b><b>\t\t\t\tRECEPTIONIST\n</b>\t\tGood. Perfect timing. Have a seat and\n\t\tI'll get Mr. Brown.\n<b>    \n</b>The receptionist stands, walks to a door, knocks twice, then\nenters.\n<b>    \n</b>She closes the door behind her and Betty is alone in the\nsitting room. She sits on a couch and looks at the old\nmovie posters covering all four walls.\n<b>    \n</b>In a moment the same door opens again and an elderly,\ndistinguished looking gentleman WALLY BROWN comes out\nsmiling. Betty stands up immediately.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tBetty Elms?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYes.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tI'm Wally Brown. Your Aunt is a very dear\n\t\tfriend of mine so it's particularly nice\n\t\tto meet you.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tVery pleased to meet you.\n\n<b>\t\t\t\tWALLY\n</b>\t\tCome in. I'd like you to meet everyone.\n<b>    \n</b>As they walk into Wally's office...\n<b>    \n</b>\t\t\t\tWALLY (cont'd)\n\t\tI took the liberty of inviting an extra\n\t\tperson to see your audition. She saw\n\t\tyour resume picture and was very\n\t\tinterested in meeting you.\n<b>    \n</b>Inside Wally's office several people rise out of chairs when\nWally enters with Betty.\n<b>    \n</b>\t\t\t\tWALLY (cont'd)\n\t\tBetty Elms this is Jack Taft, my\n\t\tassistant, Jimmy Katz who we've already\n\t\tcast for the part of \"Chuck\". He'll be\n\t\tdoing the scene with you.\n\t\tThis is Julie Chadwick and Bob Brooker,\n\t\tthe director, and our surprise guest is\n\t\tSarah James. We couldn't afford her to\n\t\tcast our picture, but as casting agents\n\t\tgo she's the best.\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tWhy thank you, Wally. Hello Betty.\n<b>    \n</b>She and Betty shake hands.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tPleased to meet you.\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tThis is Nicki, my assistant.\n<b>    \n</b>Nicki, a very stylish, thin girl with black cat-eyed glasses\nnods coolly to Betty.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tAnd this is Martha, Martha Johnson, who\n\t\tyou met out front.\n<b>    \n</b>Betty nervously smiles to the room.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHi.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tWell. Shall we get to it? Would you like\n\t\ta water or a coffee before we begin?\n<b>    \n</b>Betty's hands are beginning to sweat.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNo, no, I'm fine.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tWell then, take a seat everyone. Betty\n\t\twhy don't you join Jimmy and we'll play\n\t\tthe scene. Is there anything you'd like\n\t\tto say Bob... something to Betty before\n\t\tthey begin?\n<b>    \n</b>Betty stops on her way across to Jimmy and looks to Bob the\ndirector.\n<b>    \n</b><b>\t\t\t\tBOB\n</b>\t\tNo ... it's not a contest, see, the two of\n\t\tthem with themselves, so don't play it\n\t\tfor real until it gets real.\n\n<b>    \n</b>Betty doesn't know what to say. She catches Sarah's\nassistant, Nicki, rolling her eyes.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOkay.\n<b>    \n</b>Betty continues walking toward Jimmy who opens his arms to\nher as she approaches. He's old enough to be her father.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tJust tell me where it hurts, baby.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat?\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tI want to play this one close, Bob. Like\n\t\tit was with that girl, what's her name,\n\t\twith the black hair. That felt good.\n\t\tWhaddya think?\n<b>    \n</b>Betty looks from Jimmy to Bob.\n<b>    \n</b><b>\t\t\t\tBOB\n</b>\t\tThat'd be good, Jimmy. Just don't rush\n\t\tthat line again. I told you... the line\n\t\twhere you say, \"Before what?\"\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tI was playin' off 'em. They say,\n\t\t\"They'll arrest you\"... and stuff like\n\t\tthat.. \"put you in jail\"... they say it\n\t\tlike that. They all say it the same way,\n\t\tso I react like that.\n<b>    \n</b>Jimmy turns to Betty.\n<b>    \n</b>\t\t\t\tJIMMY (cont'd)\n\t\tLook ... what's your name?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tBetty.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tYeah ... Betty. You don't rush it. I\n\t\tdon't rush it. We play it close, just\n\t\tlike in the movies.\n<b>    \n</b>Jimmy reaches out and puts his arm around Betty and brings\nher in against his pot belly.\n<b>    \n</b>\t\t\t\tJIMMY (cont'd)\n\t\tDad's best friend goes to work.\n\n<b>    \n</b>Jimmy smiles as he brings Betty a little closer. She is\ntrying to concentrate through the nervousness and Jimmy's\nbreath. There is a silence as Jimmy looks her in the eyes.\nEveryone in the room is looking Betty in the eyes.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tBob?\n<b>    \n</b><b>\t\t\t\tBOB\n</b>\t\tAnd ... ACTION!\n<b>    \n</b>Betty and Jimmy start the scene. It is very difficult for\nBetty as Jimmy has her in an absurd clench now.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou're still here?\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tI came back. I thought that's what you\n\t\twanted.\n<b>    \n</b>Jimmy plays this with a big lecherous smile. He gives the\nlast part of the line across her cheek up to her ear.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNobody wants you here.\n<b>    \n</b>Betty uses the anger of this line to push herself away from\nJimmy. Jimmy reaches out and grabs her wrist.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tReally?\n<b>    \n</b>Betty pulls her hand away and stands her ground.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tMy parents are right upstairs! They\n\t\tthink you've left.\n<b>    \n</b>Jimmy smiles broadly and moves again toward Betty.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tSo ... surprise!\n<b>    \n</b>Betty pushes him back.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI can call them... I can call my dad.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tBut you won't.\n\n<b>    \n</b>He grabs Betty by the wrist again and pulls her in to him.\nHe puts his hand on her waist and it accidently slips and\nkeeps going down her hips. He jerks his hand back. Betty\nlooks down and sees Jimmy's hand hovering above her thigh.\nBetty takes her hand and gently presses down on Jimmy's hand.\nShe slowly looks up with the most seductive smile. Jimmy\nlets his hand rest more firmly on her thigh, and squeezes her\nthigh as he sees her smile. With his other hand Jimmy gently\npulls her closer. Something has started coming over Betty\nand she catches the drift of this scene in a different way.\nShe's surprising herself.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(almost a hot whisper)\n\t\tYou're playing a dangerous game here. if\n\t\tyou're trying to blackmail me... it's not\n\t\tgoing to work.\n<b>    \n</b>Jimmy now surprises himself. He becomes almost tender and\ngenuinely worked up from the heat coming off Betty.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tYou know what I want...it's not that\n\t\tdifficult.\n<b>    \n</b>Where the scene should turn to anger from Betty it can't now\nand Betty plays it as she feels it. She stays in very close\nto Jimmy - looking him right in the eyes.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(whispering desperately -\n\t\t\tslowly)\n\t\tGet out... Get out before I call my dad.\n\t\tHe trusts you... you're his best friend.\n\t\t\t(her arms go around him)\n\t\tThis will be the end of everything.\n<b>    \n</b>Jimmy gets lost. He doesn't know where he is anymore. He\ncan only see Betty's eyes.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tWhat about you? What will your dad think\n\t\tabout you?\n<b>    \n</b>Betty still playing it in a dreamy whisper... lost in heat.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tStop... just stop! That's what you said\n\t\tfrom the beginning. If I tell what\n\t\thappened... they'll arrest you and put\n\t\tyou in jail, so get out of here before...\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\t\t(caught by her transfixing,\n\t\t\tsultry eyes, and almost\n\t\t\tbreathless ... he finds himself\n\t\t\ttaking an extra long pause)\n\t\tBefore what?\n<b>    \n</b>As scripted Betty pretends to pull the knife from behind her\nback, but wraps the knife around behind Jimmy and pulls him\ninto a kiss.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(as she kisses him - whispers)\n\t\tBefore I kill you.\n<b>    \n</b>Jimmy panics and pushes Betty away with his hands on her\nshoulders as if forcing himself to come out of a trance. He\nfinally is able to say his line.\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tThen they'd put you in jail.\n<b>    \n</b>As scripted Betty is supposed to cry now and it is very easy\nfor her to do this because she's ashamed at how the sex of\nthe scene took her over. Tears begin running down her\ncheeks. She backs away.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI hate you... I hate us both!\n<b>    \n</b>She pretends to drop the knife. The scene ends.\n<b>    \n</b>Everyone in the room has become mesmerized by Betty, but they\nsoon drift back to reality and begin applauding the\nperformance. Sarah turns to Nicki.\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tI'm going to take her over there.\n<b>    \n</b><b>\t\t\t\tNICKI\n</b>\t\tBig time!\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\t\t(to everyone)\n\t\tWow!\n<b>    \n</b>Betty wipes her eyes and turns smiling - still shocked at\nherself.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWell, there it was.\n\n<b>    \n</b><b>\t\t\t\tJIMMY\n</b>\t\tThere it was it was! Baby, you got a\n\t\tway!\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tBob?\n<b>    \n</b><b>\t\t\t\tBOB\n</b>\t\tVery good. Really. I mean it was forced\n\t\tmaybe but still humanistic. Yeah, very\n\t\tgood, really.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tWell, thank you Betty, and I mean that.\n\t\tThat was very impressive. You've done\n\t\tyour Aunt proud and I'm going to tell her\n\t\tthe first chance I get. We'll speak again\n\t\tsoon I'm sure, and thank you so much for\n\t\tcoming in.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWell, thank you.\n<b>    \n</b>Betty doesn't quite know what to do. She moves to the center\nof the room and just stands. Remnants of the scene still\nstaying with her.\n<b>    \n</b>Sarah stands and Nicki stands just after.\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tThank you, Wally. I'm sure you all have a\n\t\tlot to talk about. We'll walk Betty out.\n<b>    \n</b><b>\t\t\t\tWALLY\n</b>\t\tWell, yes indeed. Our pleasure, Sarah,\n\t\tand don't you be a stranger. We'd love to\n\t\tsee you around here again real soon.\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tWell come along, Betty.\n<b>    \n</b>Sarah takes Betty's hand and they go to the door. Betty turns\nback once more and smiles.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThank you again, Mr. Brown. It was nice\n\t\tmeeting all of you.\n<b>    \n</b>Everyone nods and waves and Betty is taken out by Sarah and\nNicki.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b>\n<b>    \n</b><b>INT.- CORRIDOR EXECUTIVE BUILDING - DAY\n</b><b>    \n</b>The three of them walk down the corridor.\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tOh God, that was awful!\n<b>    \n</b>Betty's head spins to Sarah. A look of shock and let down on\nher face.\n<b>    \n</b>\t\t\t\tSARAH JAMES (cont'd)\n\t\tOh, not you Betty. You were stellar and\n\t\tI mean that, but poor Wally. He'll never\n\t\tget that picture made. Wally's days were\n\t\tup twenty -years ago.\n<b>    \n</b><b>\t\t\t\tNICKI\n</b>\t\t\t(sickening little laugh)\n\t\tHow about that Jimmy Katz?\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tOh god! Jimmy Katz never had a day.\n\t\tJimmy Katz never had a minute. Poor\n\t\tWally.\n<b>    \n</b>Betty finds herself getting a little upset.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tThey seem very nice to me, and\n\t\tWally... Mr. Brown is a very close friend\n\t\tof my Aunt's, so. . .\n<b>    \n</b><b>\t\t\t\tSARAH JAMES\n</b>\t\tSettle down, Betty. Don't get me wrong.\n\t\tI love Wally. I ought to. I was married\n\t\tto him for ten years.\n<b>    \n</b>Betty does another shocked head turn.\n<b>    \n</b>\t\t\t\tSARAH JAMES (cont'd)\n\t\tAnd I love actors, all actors, Jimmy Katz\n\t\tincluded. We just get a little catty\n\t\tsometimes. Now we want to take you across\n\t\tthe way and introduce you to a director\n\t\twho's a head above the rest. He's got a\n\t\tproject that you would kill!\n<b>    \n</b>At the word 'kill' Betty turns to her once again with a\nquestioning look.\n\n<b>    \n</b>\t\t\t\tSARAH JAMES (cont'd)\n\t\t... Knock it right out of the park.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. - RECORDING STUDIO - DAY\n</b>\nWe see what looks like a recording studio right out of the\n1960's. We're looking through a plate of glass. A blonde\ngirl is standing at a vintage microphone. Behind her are\nthree back-up male vocalists dressed in three tone, shiny\n60's suits. We hear strings soar up and the blonde girl\nbegins to sing SIXTEEN REASONS by Connie Stevens. The male\nvocalists backing her up flawlessly.\n\nWe move back and realize we are on a movie set inside a sound\nstage. A screen test is being shot of the girl and as we\ncontinue moving back we see the director Adam Kesher\nsurrounded by his crew. Behind them there are many people\nstanding, eating, watching, working. The stage is full and\nbustling. The song plays loudly over. Sarah and Nicki bring\nBetty into this scene through a giant stage door. A guard\nmimes for them to be quiet as they approach the set. The\nsong continues to play over.\n\nAs Sarah leads Betty up close Adam turns and his eyes fall on\nthe beautiful face of Betty Elms. Sensing something Betty\nturns and sees Adam. They each seem to feel the thrill of\nthe thunderbolt, but each embarrassed to stare longer than\nthey already have turn back and watch the girl finish the\nsong.\n\n<b>\t\t\t\tADAM\n</b>\t\t\t(calling out through an\n\t\t\telectronic megaphone)\n\t\tCut it!\n<b>    \n</b>He gets out of his chair and walks into the set - up to the\nblonde girl. He shakes her hand.\n<b>    \n</b>\t\t\t\tADAM (cont'd)\n\t\tThank you very much, Carol. It was really\n\t\tgreat of you to come in. I know how busy\n\t\tyou are.\n<b>    \n</b><b>\t\t\t\tCAROL\n</b>\t\tOh, man, are you kidding? I love this\n\t\tscript! Where do I sign?\n\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tLook... I love you, but there's no way\n\t\tthey're gonna let me cast this thing\n\t\tuntil I've seen everyone. I'll let you\n\t\tknow as soon as I can.\n<b>    \n</b><b>\t\t\t\tCAROL\n</b>\t\tI know you will ... cause my manager's\n\t\tgonna bug you day and night ... me too.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tIt'll be my pleasure. Now, get out of\n\t\there.\n<b>    \n</b><b>\t\t\t\tCAROL\n</b>\t\tOh, you're just so cruel... don't forget\n\t\tme. I'm the girl that's going to play\n\t\tthis part.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\t\t(lightly pinching her cheek)\n\t\tSee ya later.\n<b>    \n</b>Adam turns and goes back out of the set onto the stage floor.\nHe looks around. He sees Betty being introduced by Sarah to\nsome of the studio executives. He goes over to his Assistant\nDirector and looks down at the man's notepad.\n<b>    \n</b>\t\t\t\tADAM (cont'd)\n\t\tWho's next, Hank?\n<b>    \n</b><b>\t\t\t\tHANK\n</b>\t\tCamilla Rhodes.\n<b>    \n</b>Adam wonders - worries.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tIs she ready?\n<b>    \n</b><b>\t\t\t\tHANK\n</b>\t\tAll ready.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tBring her out.\n<b>    \n</b>Hank speaks into his walkie-talkie headset. The sound of his\nvoice can be heard in several locations throughout the stage.\n<b>    \n</b><b>\t\t\t\tHANK\n</b>\t\t\t(through walkie-talkie)\n\t\tCamilla Rhodes next!\n\n<b>    \n</b>Adam looks up - a beautiful blonde steps into the set in\nfront of the microphone. IT IS THE GIRL! The back-up\nsingers step in behind her.\n<b>    \n</b>Adam nods to Hank.\n<b>    \n</b>\t\t\t\tHANK (cont'd)\n\t\tTurn over!\n<b>    \n</b>The cameraman calls out, \"Speed\".\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\t\t(through megaphone)\n\t\tPlayback!\n<b>    \n</b>Countdown before the music begins.\n<b>    \n</b>\t\t\t\tADAM (cont'd)\n<b>\t\tACTION!\n</b><b>    \n</b>The strings soar up and Camilla Rhodes begins to sing.\n<b>    \n</b>On the set Betty hears the song again and turns and watches.\nOnce again her eyes find Adam as his eyes are finding hers.\nThis time Adam turns away. He watches Camilla for a moment.\nShe is passable, but not spectacular. Adam reaches out and\npulls Hank over to him.\n<b>    \n</b><b>\t\t\t\tHANK\n</b>\t\tYeah?\n<b>    \n</b>Adam pauses.\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tGet Jason over here.\n<b>    \n</b>Hank gets on his walkie-talkie.\n<b>    \n</b><b>\t\t\t\tHANK\n</b>\t\tCindy ... Adam wants to see Jason.\n<b>    \n</b>Adam continues to watch Camilla Rhodes sing. JASON GOLDWYN,\na tall sixty year old silver-haired man, comes through the\ncrowd and stops at Adam's side. He looks down at Adam, but\nAdam continues watching Camilla Rhodes. Jason follows Adam's\ngaze and he watches Camilla sing then turns back to Adam.\nAdam slowly looks up right into Jason's eyes - wondering how\nmuch Jason knows, but Jason's face doesn't give away a thing.\n<b>    \n</b><b>\t\t\t\tJASON\n</b>\t\tDid you want to tell me something, Adam?\n\n<b>    \n</b><b>\t\t\t\tADAM\n</b>\t\tThis is the girl!\n<b>    \n</b>At that moment Ray, having overheard, comes to Jason's side.\nHe smiles at Adam.\n<b>    \n</b><b>\t\t\t\tRAY\n</b>\t\tExcellent choice, Adam.\n<b>    \n</b>Adam is sick with himself.\n<b>    \n</b>Across the room Betty panics when she looks at her watch.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tOh ... oh...I have to be somewhere. I\n\t\tpromised a friend.\n<b>    \n</b>She quickly shakes Sarah's and Nicki's hands saying, \"I'm\nsorry, I'm sorry\" and runs off like Cinderella.\n<b>    \n</b>Adam turns and sees her running off out of his world.\n<b>    \n</b>Chris Isaak's song \"Except The New Girl\" segues in over\nConnie Stevens and plays as Adam, Sarah and Nicki watch Betty\ndisappear out the sound stage door.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT.  1612 HAVENHURST - STREET - DAY\n</b><b>    \n</b>Chris Isaak song \"Except The New Girl\" continues.\n<b>    \n</b>An idling cab sits waiting with back door open.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>COURTYARD - 1612 HAVENHURST DAY\n</b><b>    \n</b>Chris Isaak song segues to the sounds of a blues saxophone.\n<b>    \n</b>Betty and Rita come out of Aunt Ruth's apartment. Betty is\nlaughing, pulling on Rita.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tC'mom. There's nothing to be afraid of.\n<b>    \n</b>Across the courtyard CORNELL DUMONT, a strikingly handsome\nyoung black musician, is on his balcony playing the\nsaxophone. He stops playing when he sees the girls. He\nstands and looks as if recognizing someone.\n\n<b>    \n</b><b>\t\t\t\tCORNELL DUMONT\n</b>\t\tHey!\n\n<b>    \n</b>Betty and Rita stop and look up, shielding their eyes from\nthe sun.\n<b>    \n</b>\t\t\t\tCORNELL DUMONT (cont'd)\n\t\tHey, how's Sol?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tSol?\n<b>    \n</b><b>\t\t\t\tCORNELL DUMONT\n</b>\t\tNo ... not you...\n\t\t\t(to Rita)\n\t\tI'm sorry... I forget your name.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(almost inaudible)\n\t\tRita.\n<b>    \n</b><b>\t\t\t\tCORNELL DUMONT\n</b>\t\tYeah. Well, I haven't seen Sol lately.\n\t\tTell him to come by the club.\n<b>    \n</b>Rita nods ... biting her lip. Cornell smiles and picks up his\nsax.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tAnd what's your name?\n<b>    \n</b><b>\t\t\t\tCORNELL DUMONT\n</b>\t\t\t(big smile)\n\t\tCornell Dumont.\n<b>    \n</b>He begins to blow some sweet jazz that flows smooth as syrup.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(whispering)\n\t\tAsk him who Sol is ...\n<b>    \n</b>Rita hurriedly starts for the gate.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tMaybe he could help...\n<b>    \n</b>Betty follows Rita through the gate to the waiting cab. They\nget in and the cab pulls away.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. CAB - DAY\n</b><b>    \n</b>Betty reaches and gently grabs Rita's shoulder. She speaks\nfirmly but quietly so the cab driver won't hear.\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhy didn't you ask him? Sol knows you!\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(whispering back)\n\t\tBut I don't know, Sol. I never heard of\n\t\tSol. I'd just get in trouble. That's why\n\t\twe shouldn't go see about Diane\n\t\tSelwyn... it's better not to get in\n\t\ttrouble.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tYou're not going to get in trouble.\n\t\tYou're going to find out who you are.\n\t\tFinding out who you are gets you out of\n\t\ttrouble.\n<b>    \n</b>Rita thinks about this silently then begins to worry and\ndoubt all over again.\n<b>    \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>INT. CAB - LATER\n</b><b>    \n</b>Betty holds the slip of paper with the address in her hand.\nShe turns back and forth watching the buildings on both sides\nof the street.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tIt should be around here...\n<b>    \n</b>Rita watches out of the window pensively as the cab moves up\nSierra Bonita. They near a modern apartment compound of\nbungalows and duplexes almost hidden in the trees and\nvegetation. A smooth stucco wall surrounds the complex.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\t\t(points)\n\t\tThat's it ... 2590.\n\t\t\t(nudging Rita)\n\t\tDoes it look familiar?\n<b>    \n</b>Rita shakes her head..no. Rita is looking at a black car\nparked down the street facing 2590. She discerns two men\nsitting in the front.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tDon't stop!\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat is it? What do you see?!\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(quietly - frantic)\n\t\tThose men in front, in the car.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tDo you know them?!\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tNo... but...\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(to driver)\n\t\tKeep going. Go around to the back.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. SIERRA BONITA APARTMENT - BACK ALLEY - DAY\n</b><b>    \n</b>Betty gets Rita out of the cab and pays the driver, who then\ndrives away. The girls go through a rear gate and enter the\ncomplex walking along a curving concrete walk. This leads\nthem to an intersection where a registry is printed on a\nrough hewn wooden plaque. They scan the list.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tSelwyn ... number 12.\n<b>    \n</b>They both look around the various doors near them. Betty\nspots a sign which says, behind an arrow, bungalows #10\nthrough #20.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tIt's this way.\n<b>    \n</b>They set off down another sidewalk toward Bungalow #12. As\nthey near it and actually can see it just ahead they pass a\nchainlink service gate to the alley. Standing in the alley is\na man in a dark suit wearing sunglasses.\n<b>    \n</b>Both girls dive for the bushes.\n<b>    \n</b>The man in the black suit turns reacting to the noise and\nmotion. Both girls are trying to catch their breath and stay\nas still and quiet as possible.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\t\t(panting whisper)\n\t\tNow, you've got me scared.\n<b>    \n</b>Peering through the bushes they see the man still looking in\ntheir direction. Suddenly he turns and smiles at something\nto his left.\n<b>    \n</b>\nHe hurries off, but soon returns carrying two heavy\nsuitcases, followed by an older woman in a yellow dress.\nBoth Betty and Rita crawl further forward. They see the limo\nand realize that the man they were afraid of is an ordinary\nlimousine driver just going about his work. The girls stand\nup, relieved and a little embarrassed.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tSee, I told you there was nothing to be\n\t\tafraid of!\n<b>    \n</b>They go up to Bungalow #12 and stand for a moment facing the\nfront door.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tOh no ... don't.\n<b>    \n</b>Betty doesn't listen to Rita. She knocks strongly on the\ndoor. They stand waiting. There's no answer so Betty knocks\nagain harder. They wait.\n<b>    \n</b>\t\t\t\tRITA (cont'd)\n\t\tNo one's ...\n<b>    \n</b>Suddenly the door opens. An attractive MIDDLE-AGED WOMAN\nstands before them.\n<b>    \n</b><b>\t\t\t\tMIDDLE-AGED WOMAN\n</b>\t\tYes?\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tDiane?\n<b>    \n</b><b>\t\t\t\tMIDDLE-AGED WOMAN\n</b>\t\tNumber 17.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tBut it said #12.\n<b>    \n</b><b>\t\t\t\tMIDDLE-AGED WOMAN\n</b>\t\tI switched apartments with her. She's in\n\t\t#17. Just walk down that way. It's just\n\t\tto the right.\n<b>    \n</b>The woman seems to be looking now at Rita.\n<b>    \n</b>\t\t\t\tMIDDLE-AGED WOMAN (cont'd)\n\t\tIt's kind of hidden by the foliage.\n<b>    \n</b>Betty and Rita start to leave.\n<b>    \n</b>\t\t\t\tMIDDLE-AGED WOMAN (cont'd)\n\t\tShe hasn't been around for a few days ...\n\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWell ... we'll leave her a note.\n<b>    \n</b><b>\t\t\t\tMIDDLE-AGED WOMAN\n</b>\t\t\t(starting toward them)\n\t\tI'll go with you. She's still got some of\n\t\tmy stuff.\n<b>    \n</b>The phone rings from inside her bungalow.\n<b>    \n</b>\t\t\t\tMIDDLE-AGED WOMAN (cont'd)\n\t\t\t(turning back)\n\t\tOh ... go ahead. I've got to get that.\n<b>    \n</b>The woman hurries back inside and closes the door. Betty and\nRita quickly move up the walkway toward Bungalow #17.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI guess you're not Diane.\n<b>    \n</b>Rita, still fighting her fear doesn't answer.\n<b>    \n</b>They reach Bungalow #17. It's set back beneath tall bushes\nand an old Eucalyptus tree. The front door is in deep shadow.\nWithout even looking at Rita Betty knocks quickly. There's no\nanswer. She knocks again.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tStill not home I guess.\n<b>    \n</b>The girls drift off to the side of the bungalow. Betty tries\nto see in the windows. She tries a window and to her surprise\nit opens.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tI don't think...\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(looking around for anyone\n\t\t\twatching)\n\t\tC'mon help me in. I'll open the front\n\t\tdoor.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tNo.\n<b>    \n</b>Betty jumps up and catches her knees on the siding, her head\nthrough the open window.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b><b>\t\tPUSH!!!\n</b>\n<b>    \n</b>Rita reluctantly pushes and Betty is in. As she closes the\nwindow ...\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tMeet you at the door.\n<b>    \n</b>Rita walks around to the front door and gets there just as\nBetty opens it. Betty has her hand over her mouth and nose.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tI don't know if you want to come in here\n\t\tor not. There's some kind of horrible\n\t\tsmell like... something...\n<b>    \n</b>Rita is compelled to go in and as the door clicks shut she\nreacts to the smell.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. - BUNGALOW #17 - DAY\n</b><b>    \n</b>Betty begins to go through the bungalow and Rita follows.\nAll the blinds are closed and the curtains drawn. They move\nslowly, looking around at everything as they go. Betty looks\nto Rita to see if any of this is something she remembers.\nRita looks as though she's walking in a trance. Through the\nhalf light they move deeper into the bungalow to a corridor.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. SIERRA BONITA APARTMENTS - BUNGALOW #12 - DAY\n</b><b>    \n</b>The Middle-Aged Woman is just shutting the door to her\nbungalow. She walks quickly in the direction of Bungalow\n<b>#17.\n</b><b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. - BUNGALOW #17 - DAY\n</b><b>    \n</b>Betty and Rita are moving down the corridor. They pass a\nsmall room and look in at a couch, wardrobe and make-up\ntable. They move on down the corridor to a door which is\nalmost closed. Betty touches the door and it seems to swing\nopen on its own. They enter the room and stop cold. A scream\nstarts to build inside Rita. Before them is a dead woman\nlying on a bed. Great chunks of mattress are standing upright\nhaving been ripped and torn by shotgun blasts. A dried sea of\nblood surrounds the bloated, gray body of the woman. The\nscream comes out of Rita as a force propelling her to look\ncloser. Betty lunges after Rita, her eyes also not able to\nleave the sight. She covers Rita's mouth with her hand and\nbrings her close. The scream is stifled by Betty's hand.\n<b>    \n</b>In the silence that follows, knocking can be heard. Betty\nfreezes and keeps Rita quiet with her hand still placed over\nher mouth, but she can't stop Rita's violent shaking nor the\nhorror in her eyes.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. BUNGALOW #17 - DAY\n</b><b>    \n</b>The Middle-Aged Woman backs away from the front door, looking\naround at bungalow #17. She's not sure if she has heard\nsomething or not. She wonders, then turns and goes back to\nher bungalow.\n<b>    \n</b>Just as she has disappeared the door to Bungalow #17 flies\nopen and Rita, followed closely behind by Betty, runs with a\nlook of horror directly toward us until her tortured face\nfills the screen.\n<b>    \n</b>Sounds, churning music.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - BATHROOM - DAY\n</b><b>    \n</b>Sounds, music churning continues.\n<b>    \n</b>Great sobs, almost hysterical, wrack Rita's body as she bends\nover the sink, scissoring into her long, dark hair with a\nfrenzy. There is a loud sound of the scissors cutting deep\nthrough many strands of hair. Betty's is rushing to her -\nher hands reach tenderly, but firmly for Rita's hand holding\nthe scissors. She keeps her from cutting and moves closer,\nwhispering in Rita's ear. Rita can't stop crying, but lets\nBetty hold her. Music changes ...\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tRita... I know what you're doing.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\t\t(through uncontrollable sobs)\n\t\tWhat ... I..HAVE... to do.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tI know what you have to do, but let me do\n\t\tit.\n<b>    \n</b>Rita turns and looks up at Betty, her eyes red with crying.\nBetty pulls her up facing her. Rita lets Betty take the\nscissors. They look into each other's eyes. Betty gently\nstrokes Rita's cheek, wiping away some tears.\n\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\tLet me do it.\n<b>    \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - LATER - DAY\n</b><b>    \n</b>Panning slowly across we see on the bathroom counter various\nopen bottles, used Q-tips, towels, combs, a brush, a bowl,\nand lots of long strands of cut black hair. We continue\nmoving up to an empty mirror and eerie music builds. The\nreflection of the new Rita moves into the mirror. She has\nshort, beautiful blonde hair, blonde eyebrows and no make-up.\nBetty's reflection comes in beside Rita's. They stare at the\nnew Rita in the mirror.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\t\t(quietly with assurance)\n\t\tYou look like someone else.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. COURTYARD 1612 HAVENHURST - LATE EVENING - ALMOST\n</b><b>DARK\n</b><b>    \n</b>We move off the door of Aunt Ruth's apartment and crane\nslowly up to the apartment above hers - WILKINS - the one\nwith the wayward dog. We move closer to Wilkins' apartment\nand as we move in we hear a phone ringing.\n<b>    \n</b><b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b><b>    \n</b><b>INT. WILKINS' APARTMENT - A MOMENT LATER\n</b><b>    \n</b>Wilkins still in his pajamas, bathrobe and slippers from\nmorning slouches in an enormous stuffed chair and matching\nottoman, surrounded by piles of papers and coffee cups. His\nJack Russell Terrier wakes and stands at the sound of the\nphone ringing on a side table next to Wilkins. Wilkins comes\nout of a deep thought and picks up the receiver as he runs\nhis hand through strange, matted tufts of dirty blonde hair.\n<b>    \n</b><b>\t\t\t\tWILKINS\n</b>\t\tHello. Adam. How's it going? No, it's\n\t\tokay. Yeah, I'm working, but... they\n\t\twanted this script a week ago. What?\n\t\tWhat's wrong with your house? The\n\t\tpoolman? Sure, you can have the couch.\n\t\tNo, it's no problem..it's just I\n\t\tgotta ... I gotta work. Any chance you\n\t\tcould bring some food. No, I got plenty\n\t\tof money - I just haven't gone out for\n\t\tawhile. Groovy man!\n\n<b>    \n</b>\t\t\t\tWILKINS (cont'd)\n\t\tMurphy and I'll be glad to see you. No,\n\t\tno, no, he's got plenty of food.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - BEDROOM - NIGHT\n</b><b>    \n</b>Rita has just taken the hatbox from the closet shelf and is\nsetting it on the bed.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tWhat are you doing?\n<b>    \n</b>Betty is sitting on the bed opposite. Rita opens the hatbox\nand removes her purse. She opens the purse and takes out the\nmoney. She sits down on the bed and while staring at the\nmoney she thinks of what to say.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tYou've been so good to me ... now we know\n\t\twhy ... why I was so afraid. We know what\n\t\tkind of trouble I'm in. I shouldn't...\n\t\task you... I only have this to offer.\n\t\tI'll give you this if I can stay here for\n\t\tawhile. I don't know what else to do.\n<b>    \n</b>Betty moves across the bed to the side of Rita. She puts her\narm around Rita and holds her.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tRita... I want you to stay here and you\n\t\tdon't have to give me that money.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tBut I want to.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tNo. We shouldn't touch that money. We\n\t\tdon't know about that money. That might\n\t\tbe dangerous money. You have to start all\n\t\tover again. You look like a brand new\n\t\tperson and you can be a brand new\n\t\tperson... whoever you want to be.\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tIt sounds kind of nice ... being somebody\n\t\tbrand new.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHey, let's introduce the brand new you to\n\t\tHollywood. We haven't seen the roof\n\t\tgarden yet.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT.  COURTYARD -  NIGHT\n</b><b>    \n</b>The girls come out the front door ... Betty leading and pulling\na much happier Rita along with her. They half run across the\ncourtyard to stone steps under an Ivy covered eave.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. ROOF GARDEN - NIGHT\n</b><b>    \n</b>The girls race up the stone steps toward us. Soon their wind-\nblown, smiling faces fill the screen as they look out. There\nbefore them are the lights of Hollywood with silhouetted\npalms, slow-moving theater kleig lights, and floating above\nit all the giant sign in the hills reading HOLLYWOOD.\n<b>    \n</b><b>\t\t\t\tBETTY\n</b>\t\tHere I am Hollywood! My name's Betty.\n<b>    \n</b>A pause.\n<b>    \n</b>\t\t\t\tBETTY (cont'd)\n\t\t\t(to Rita)\n\t\tSay it!\n<b>    \n</b><b>\t\t\t\tRITA\n</b>\t\tHere I am Hollywood! My name is ... Rita.\n<b>    \n</b>They look out, maybe waiting for an answer blowing in the\nSanta Ana wind.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>INT. AUNT RUTH'S APARTMENT - NIGHT - A MOMENT LATER\n</b><b>    \n</b>We move in to the pile of money next to Rita's purse. Past\nthat we move down inside Rita's purse. We see the Blue Key\nand move closer to it until it fills the screen.\n<b>    \n</b><b>\t\t\t\t\t\t\tCUT TO:\n</b><b>    \n</b><b>EXT. DENNY'S RESTAURANT - HOLLYWOOD - NIGHT\n</b><b>    \n</b>We drift along the red bricks past the payphone, along the\nwall until we come to the corner. Slowly we round the corner\nand move to a dark alley. There amongst the dumpsters and\ntrash cans is the dark silhouette of a figure. We move closer\nto the figure. It is the bum and the bum sits. We move\ncloser and the bum's face fills the screen. It's face is\nblack with fungus. It's eyes turn and they seem to be red.\n<b>    \n</b><b>\t\t\t\tTHE END\n</b><b>    \n</b>\n\n</pre>\n\n\n\n<b></b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Mulholland Drive</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=David Lynch\" title=\"Scripts by David Lynch\">David Lynch</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Mulholland Drive Script.html#comments\" title=\"Mulholland Drive comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:12:06.818086"}