{"title": "Mumford", "film_link": "/Movie Scripts/Mumford Script.html", "script_link": "/scripts/Mumford.html", "info_raw": "\n\nMumford Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Lawrence Kasdan\nGenres  Comedy  Drama\nMovie Release Date : September 1999\n\nRead \"Mumford\" Script\n\n\n", "script": "\n                                        \"MUMFORD\"\n\n                                      Screenplay by\n\n                                     Lawrence Kasdan\n\n                                      SHOOTING DRAFT\n\n                \n\n               EXT. MAIN STREET, SMALL TOWN - DAY\n\n               A freight truck of late 1950's vintage pulls to the side of \n               the road in a small rural town. A handsome, well-built man \n               gets out of the passenger side and thanks the Driver. THE \n               NEWCOMER carries his coat over his shoulder and a beat-up \n               suitcase; he's got a jut jaw and a modified pompadour, his \n               shirtsleeves are rolled all the way up past his biceps. He \n               wipes his brow against the sweltering heat and looks around. \n               [Until noted below, this section of the movie is in BLACK & \n               WHITE.]\n\n                                     FOLLETT (V.O.)\n                         I get outta the truck in this two-\n                         bit town. I got no money and no \n                         prospects. What I need right now is \n                         a stiff drink, a cold shower, and a \n                         hot broad. I'll take 'em in any order \n                         they come...\n\n               EXT. BOARDING HOUSE - DAY\n\n               Old three story gothic house in ill-repair beyond a peeling \n               picket fence and a scruffy yard. The sign says -- ROOMS TO \n               RENT. The Newcomer goes in the gate.\n\n                                     FOLLETT (V.O.)\n                         ...Oh yeah, one other thing I need -- \n                         an angle.\n\n               He squints through the dirty screen door but sees nothing, \n               then knocks and turns away to survey the neighborhood.\n\n                                     FOLLETT (V.O.)\n                         I was thinking -- if it weren't for \n                         bad luck, I wouldn't have any luck \n                         at all...\n\n                                     LANDLADY (O.S.)\n                         Can I help you?\n\n               The Newcomer turns toward the door. Standing there, holding \n               the screen open, is the LANDLADY. She's a knockout in a cheap, \n               small-town way: a cotton dress that buttons down the front \n               and clings with sweat to her generous curves.\n\n                                     FOLLETT (V.O.)\n                         Either my luck had just changed, or \n                         Fate just bought me another round of \n                         trouble.\n\n               INT. BOARDING HOUSE - DAY\n\n               The Newcomer's POV of the Landlady as she leads him up the \n               narrow, gloomy stairs from the second floor to the third \n               story / attic. She has a Monroe-like sway to her walk. We \n               can barely HEAR her DISTANT, ECHOEY DIALOGUE:\n\n                                     LANDLADY\n                         ...not very fancy... house needs \n                         repairs... We haven't had a man around \n                         here for so long...\n\n                                     FOLLETT (V.O.)\n                         She kept yammerin' the whole time, \n                         but her hips were doing all the \n                         talking...\n\n               The Landlady reaches the tiny landing at the top of the stairs \n               and opens a door to a squalid room with a bed, bureau and \n               tiny window. The Newcomer has to squeeze by her voluptuous \n               body to get inside and look around. It doesn't take long. \n               His gaze returns to the Landlady who is leaning against the \n               door, chest thrust forward. He focusses on her fingers, toying \n               with the button at her sweat-shiny cleavage.\n\n                                     FOLLETT (V.O.)\n                         It couldn't 'a been any clearer what \n                         the set-up was. The next move was up \n                         to me...\n\n               The Newcomer takes a step in the Landlady's direction --\n\n                                     MUMFORD (V.O.)\n                         Don't tell me!\n\n               INT. MUMFORD'S OFFICE - (PRESENT) DAY\n\n               CLOSE-UP of MUMFORD wincing.\n\n                                     MUMFORD\n                              (softer)\n                         -- That's all the time we have. \n                         Sorry...\n                              (indicates his watch)\n                         ...next time.\n\n               We see Mumford's office: the office of a Psychologist, a \n               therapist with a doctorate. It's modest, comfortable, neat, \n               with a calm, relaxed ambience. [The movie is now in COLOR.] \n               His patient, HENRY FOLLETT, looks nothing like The Newcomer \n               in the soft-core fantasy he's been narrating. Instead, he's \n               a mild-looking pharmacist with glasses and a receding \n               hairline. Only the voice is the same; it's as studly as his \n               fantasy alter-ego. Follett has been lying on a couch, but \n               now has twisted with some irritation to look at Mumford.\n\n                                     FOLLETT\n                         I have eighteen more minutes!\n\n                                     MUMFORD\n                         I don't want to hear any more today.\n\n                                     FOLLETT\n                         Why not?\n\n                                     MUMFORD\n                         Mr. Follett, do you trust me or don't \n                         you?\n\n                                     FOLLETT\n                         Well, I don't know... I only been \n                         seeing you --\n\n                                     MUMFORD\n                         Without trust, there's no point to \n                         any of this. You might as well not \n                         come.\n\n                                     FOLLETT\n                         Now hold on, I didn't say I didn't \n                         want to come --\n\n                                     MUMFORD\n                         Good, then go.\n\n               INT. LILY'S CAFÉ- DAY\n\n               Lunch crowd. Mumford can be seen out the big front window, \n               crossing from the two-story building that houses his office \n               on the main drag of this small town which, oddly enough, is \n               also called Mumford. He comes inside and goes to the counter \n               to pick up some take-out. The Proprietor is a woman around \n               forty named LILY, who talks to him as she works.\n\n                                     LILY\n                         You're early... it's not ready. What \n                         happened?\n\n                                     MUMFORD\n                         My patient had to leave early.\n\n                                     LILY\n                         Who was that?\n\n               She comes over to the register with an order. Mumford is \n               am[...] her, likes her a lot.\n\n                                     MUMFORD\n                         Does the phrase \"nosy\" have any \n                         meaning to you, Lily?\n\n                                     LILY\n                         I think it's like... inquisitive.\n\n                                     MUMFORD\n                         It was Henry Follett.\n\n                                     LILY\n                              (reacts)\n                         Man, you see him a lot. And it's \n                         very wrong to reveal it. Next you'll \n                         be saying what his problem is.\n\n                                     MUMFORD\n                         What do you want to know?\n\n                                     LILY\n                         You're terrible. I'm never telling \n                         you anything.\n\n               A Patron passes on the way out.\n\n                                     PATRON\n                         Hey, Doc... how's it going?\n\n                                     MUMFORD\n                         Fine, Vincent... how's yourself?\n\n                                     LILY\n                         How long you been in this town?\n\n                                     MUMFORD\n                         Oh, I don't know...\n\n                                     LILY\n                         Four months, two and a half weeks -- \n                         that's how long.\n                              (Mumford gives her a \n                              look)\n                         And you've already got more patients \n                         than those other two shrinks combined.\n\n                                     MUMFORD\n                         Lily, I don't think even you could \n                         know that --\n\n               Lily sees something out the window.\n\n                                     LILY\n                         Look at that guy...\n\n               Mumford turns to look out the window. A young man of about \n               30, in jeans and a Hawaiian shirt, is skateboarding down the \n               street at high speed, weaving in and out amongst the cars. \n               He zips past the front of the restaurant.\n\n                                     LILY\n                         You know who that is, don't you?\n                              (Mumford does not)\n                         You really don't? That's Skip \n                         Skipperton, man. He gets himself hit \n                         by a truck, this whole town shuts \n                         down.\n\n                                     MUMFORD\n                         Oh, so that's him? The Panda Man.\n\n               LILY hands over Mumford's bagged order, rings it up. Back on \n               track:\n\n                                     LILY\n                         So, what makes you so popular? What's \n                         your secret?\n\n                                     MUMFORD\n                              (takes his bag to go)\n                         You like me. How come?\n\n                                     LILY\n                         Not sure. Let me think about it.\n\n               Mumford is smiling as he goes out. Another Patron, LIONEL \n               DILLARD, a lawyer, brings his check to Lily, watching Mumford \n               cross the street. Lily can't stand this guy.\n\n                                     LIONEL\n                         That's the new psychiatrist?\n\n                                     LILY\n                         Psychologist. He's not medical.\n\n                                     LIONEL\n                         Probably thinks he's pretty smart.\n\n               Lily gives him a look as she takes his money.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               An overweight, teenage girl named NESSA WATKINS is on \n               Mumford's couch. She fidgets as she talks and can't decide \n               whether to lie down (so she's looking away from him) or sit \n               up and face him. She plays with an unlit cigarette and keeps \n               taking out a lighter, then stuffing it back in her big, sloppy \n               handbag.\n\n                                     NESSA\n                         ...so he already had the tattoo that \n                         said, \"Naomi Forever\"... and now \n                         they're broken up, see, and he has \n                         to have it removed. But while the \n                         scar is still healing, or whatever \n                         you call it when you have a tattoo \n                         removed, he meets Chandra. And it's \n                         serious, immediate love. So in no \n                         time, he's gone from the most gorgeous \n                         model in the world to the most \n                         gorgeous actress in North America.\n\n                                     MUMFORD\n                         What do you mean, \"in no time\"?\n\n                                     NESSA\n                         In maybe three or four issues.\n\n                                     MUMFORD\n                         Weekly or monthly?\n\n                                     NESSA\n                         Monthly! God, how shallow do you \n                         think Brad is? Why do I waste my \n                         time telling you this stuff?\n\n                                     MUMFORD\n                         Why do you think you tell me, Nessa?\n\n                                     NESSA\n                         Don't do that thing...\n                              (Mumford: what?)\n                         ...that shrink thing.\n\n                                     MUMFORD\n                         It's a big part of the show.\n\n               She jams the cigarette in her mouth and flames the lighter, \n               but is afraid to actually break his rules.\n\n                                     NESSA\n                         You really need to let people smoke \n                         in here, you know. It's perverse. \n                         What are they paying you to see me?\n\n               Mumford indicates \"nothing\".\n\n                                     NESSA\n                         The school board doesn't pay you? \n                         What kind of deal is that?\n\n                                     MUMFORD\n                         It's called pro bono.\n\n                                     NESSA\n                         Pro boner?\n                              (he waits her out)\n                         Pro bono, huh? For whose good, \n                         supposedly?\n\n                                     MUMFORD\n                         It's my bit for the community.\n\n                                     NESSA\n                         Fuck the community.\n                              (he won't go for it)\n                         There was this article my friends \n                         and I read. It was \"25 Signs He's \n                         Great in Bed\". It was very \n                         fascinating.\n\n                                     MUMFORD\n                         Where was this?\n\n                                     NESSA\n                         Where?... The New York Times. The \n                         first one was -- \"he handles produce \n                         well.\" Which we already knew!\n                              (an expression she \n                              uses)\n                         The point is, you have a lot of the \n                         signs.\n\n                                     MUMFORD\n                         You been spying on me in the \n                         supermarket, Nessa?\n\n                                     NESSA\n                         Have women found you attractive?\n\n               Mumford laughs.\n\n                                     NESSA\n                         I knew you wouldn't answer. I've \n                         been thinking about what you said \n                         last time. How me trying to lose \n                         weight -- and constantly not -- is \n                         like a lot of people with addictions. \n                         How maybe I can't lose the weight, \n                         ever...\n                              (quietly)\n                         Which we already knew...\n\n                                     MUMFORD\n                         That's not quite what I said --\n\n                                     NESSA\n                         It's a really weird thing for a shrink \n                         to say... and then you said maybe \n                         people'd be happier if they'd accept \n                         that some things don't change -- \n                         that it'd be some kind of a relief \n                         or something...\n\n               Mumford waits.\n\n                                     NESSA\n                         Well, I guess I'm just a dumb bitch, \n                         but how depressing is that moment -- \n                         the moment when you give up?\n\n               EXT. HIKING TRAIL, MOUNTAIN FOREST - MAGIC\n\n               The last rays of sun are fighting their way through the trees \n               as Mumford comes up the trail he clearly knows very well.\n\n               EXT. BIG ROCK LOOKOUT POINT - MAGIC\n\n               Mumford climbs out on the Big Rock, settles himself on the \n               edge and takes a long drink from a water bottle.\n\n               WHAT HE SEES: far below at the foot of these hills, lights \n               just twinkling on, is the town of Mumford. He stares at it \n               for several long moments. Then he takes a small headlamp \n               from his pack and fits the straps over his head (it looks \n               like a miner's light). He twists the light on to test it and \n               turns his head to watch the beam move about.\n\n               WE CUT BACK WIDE. After a beat, Mumford settles back and \n               turns off the light.\n\n               INT. SCATTERGOOD'S TAVERN - NIGHT\n\n               The place is quietly busy with the regulars. Mumford has a \n               favorite spot at the far end of the bar. Right now he's \n               sitting alone, reading the remnants of a newspaper.\n\n               SKIP SKIPPERTON, the man on the skateboard, comes in. Everyone \n               in the bar is surprised to see Skip in here. Several patrons \n               greet him as he makes his way deeper inside, looking around. \n               He's uncomfortable. He seems relieved when he spots Mumford \n               and heads back there. Mumford doesn't notice Skip waiting \n               for his attention.\n\n                                     SKIP\n                         Hi.\n\n               Mumford looks up, smiles. Skip offers his hand.\n\n                                     SKIP\n                         You're Doc Mumford.\n                              (Mumford nods)\n                         Skip Skipperton.\n\n                                     MUMFORD\n                         How are you?\n\n                                     SKIP\n                         Fine. Okay. Pretty good. I've been \n                         hoping we'd meet. I've heard a lot \n                         about you.\n\n               Mumford waits, friendly. Skip runs out of gas, gets uneasy, \n               glances around.\n\n                                     SKIP\n                         Do you think we could...? Can I buy \n                         you a drink?\n\n                                                                    CUT TO:\n\n               [...]\n\n               LATER. IN A BOOTH near the back. They've been at it a while, \n               but nothing is clear to Mumford, yet. Skip keeps his voice \n               down; he doesn't want anyone else in the bar to hear him.\n\n                                     SKIP\n                         ...\"Find the need and fill it\" my \n                         dad used to say -- I guess a lot of \n                         dads say that -- but I did and it \n                         just took off.\n\n                                     MUMFORD\n                         No kidding... Panda. Where'd that \n                         come from?\n\n                                     SKIP\n                         Panda? I've always liked giant \n                         pandas... I've been to China and \n                         seen them in the wild. That's the \n                         kind of thing I can do if I want... \n                         now. I can do pretty much anything I \n                         want to do these days.\n\n               Skip stares into his beer for a moment, as though the thought \n               depresses him. He catches himself and snaps back --\n\n                                     SKIP\n                         So now we make 23% of the modems in \n                         the market, which is pretty good.\n\n               Skip glances around, leans in, confidential.\n\n                                     SKIP\n                         When I was growing up here, the town \n                         was about dead. The timber business \n                         was played out... Panda changed all \n                         that. Now, just about everybody in \n                         town either works for the company or \n                         depends on it somehow. Which is kinda \n                         the problem...\n\n               Mumford waits, watches. Skip gets uncomfortable.\n\n                                     SKIP\n                         Would you like another beer?\n\n                                     MUMFORD\n                         Nah... scotch.\n\n                                     SKIP\n                              (brightens, like a \n                              kid)\n                         Far out. Single malt?\n                              (gets up)\n                         Can I pick it?\n\n               Skip heads off to the bar. Mumford looks around. Everybody \n               is watching.\n\n                                                               DISSOLVE TO:\n\n               LATER. The bar crowd has thinned. Both Mumford and Skip have \n               had a few. In fact, Mumford is now carefully pouring them \n               each another drink from a bottle of Glensomething on the \n               table.\n\n                                     MUMFORD\n                         You want me... to be... your friend.\n\n               Skip beams. Mumford leans forward in the same confidential \n               way Skip did before; he indicates that Skip should lean in \n               too. Mumford is almost whispering --\n\n                                     MUMFORD\n                         But that's not what's really going \n                         on...\n                              (Skip is excited)\n                         ...What's really going on is... you \n                         have some problems and you want some \n                         therapy, but you feel it could be \n                         very bad for Panda Modem stock if \n                         word got out that you were having \n                         head problems.\n\n               Skip confirms that's it.\n\n                                     MUMFORD\n                         Can I ask you a personal question?\n\n                                     SKIP\n                         Of course! That's exactly what I \n                         want.\n\n                                     MUMFORD\n                         Have you thought about getting a \n                         wife?\n\n               Skip makes a face and gesture to indicate a large \"YES!\", \n               but also total frustration and failure.\n\n                                     SKIP\n                         When Panda started to happen, I was \n                         dating women from New York, San \n                         Francisco, L.A. They came out of the \n                         woodwork. Models, actresses, venture \n                         capitalists... These were not the \n                         kind of girls who were interested in \n                         me before I hit it... And you know \n                         what I discovered? I discovered these \n                         girls did not love me for myself. \n                         The majority of them didn't even \n                         like me. But a lot of them would've \n                         gladly become Mrs. Skipperton for a \n                         while. Can you imagine that -- \n                         marrying someone just because they've \n                         got money?\n\n               Mumford considers that.\n\n                                     SKIP\n                         I gotta pee.\n                              (he gets up, a little \n                              wobbly)\n                         Can I ask you something? This town \n                         is called Mumford... Been that way \n                         since... 18... 18-0... 18-0...\n                              (finally remembers)\n                         ...thirteen! Right?\n                              (Mumford: if you say \n                              so)\n                         Now here's the question -- Your name \n                         is Mumford, too.\n\n                                     MUMFORD\n                         Is that the question?\n\n                                     SKIP\n                         You moved here from back East and \n                         your name is the same as this town. \n                         Is that right?\n                              (Mumford shrugs)\n                         Far out.\n\n               Skip takes a few steps toward the men's room, then comes \n               back and leans down toward Mumford.\n\n                                     SKIP\n                         I hope you don't think I want you to \n                         do this for free. Just because we're \n                         gonna play it like we're friends, \n                         doesn't mean I won't pay you like a \n                         doctor.\n\n                                     MUMFORD\n                         I understand.\n\n                                     SKIP\n                         I have a lot of money. Do you know \n                         how much money I've got?\n\n                                     MUMFORD\n                         Don't tell me, 'cause I'm not going \n                         to tell you what I've got.\n\n                                     SKIP\n                         I've got three big ones.\n\n                                     MUMFORD\n                         I'm impressed. I couldn't make three \n                         million dollars if I lived three \n                         lifetimes.\n\n                                     SKIP\n                         No, no... I have three billion \n                         dollars.\n\n               Skip stumbles off to take a leak. Mumford takes a moment to \n               digest that. It's difficult.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               Mumford is listening to Lionel, the arrogant lawyer who asked \n               about him in the restaurant. Lionel is lying on the couch, \n               talking with enormous energy; he has a serious superiority \n               complex. Mumford can't stand him and the session seems to be \n               lasting an eternity.\n\n                                     LIONEL\n                         ...so I'm watching Brokaw and they've \n                         got some astronomer, this little \n                         limey know-it-all, and he's telling \n                         how, with this Himball telescope, \n                         they've discovered there are maybe \n                         400 million more galaxies than they \n                         thought there were. And I guess that's \n                         supposed to make me feel small? I'm \n                         supposed to feel insignificant? Is \n                         that the point? Because I can tell \n                         you it didn't.\n\n               Mumfords eyes dart to look at --\n\n               THE CLOCK on the bookshelf: 2:23\n\n                                     MUMFORD\n                         Lionel, since this is our first \n                         session together, maybe --\n\n               Lionel is twisting his neck around painfully to look back at \n               Mumford.\n\n                                     MUMFORD\n                         -- you can sit up and look at me if \n                         you'd like --\n                              (Lionel waves that \n                              off and looks away)\n                         -- maybe it would be helpful if you \n                         told me a little about what brought \n                         you here.\n\n                                     LIONEL\n                         Kind of impatient for a big-time \n                         headshrinker, aren't you? How 'bout \n                         you let me explain it my own way...\n\n               As Lionel goes on, Mumford's eyes again dart toward -- THE \n               CLOCK: still 2:23! Hold on it. Finally, it moves. Mumford's \n               eyes dart toward his desk --\n\n               A deadly-looking letter opener in the shape of Excalibur \n               stands GLINTING LIGHT in a marble rendition of Arthur's stone.\n\n                                     LIONEL\n                         ...and in the dream, it's always the \n                         same, I wake up in my room from when \n                         I was I kid in Ohio, and I realize \n                         this is the day of the big exam at \n                         school...\n\n               Mumford's head rocks slowly back for a moment as if he's \n               going to drift off. He snaps back to life and stares hard at \n               the top of Lionel's head, where there is a bald spot starting \n               to take hold. The sound of LIONEL'S VOICE begins to echo --\n\n                                     LIONEL\n                         ...which is no problem for me, because \n                         I remembered it was coming and I've \n                         attended every class, so I'm totally \n                         prepared. Then I see myself running \n                         down the hall at school...\n\n               MUMFORD'S GLANCE FLASHPANS from Lionel's bald spot to the \n               gleaming letter opener.\n\n               Mumford closes his eyes. We CUT TO:\n\n               INT. HIGH SCHOOL HALLWAY - DAY\n\n               A boy, unmistakably the Young Lionel, runs down the deserted \n               hallway toward a bright doorway. [LIONEL'S DREAM has a BLUE \n               TINT.]\n\n                                     LIONEL (V.O.)\n                         ...but it's not really my school -- \n                         and this is very interesting -- it's \n                         the school from the next district --\n\n                                     MUMFORD (V.O.)\n                         -- Go on!\n\n               INT. HIGH SCHOOL CLASSROOM - DAY\n\n               Young Lionel comes breathlessly in the classroom door and \n               stares alarmed.\n\n                                     LIONEL (V.O.)\n                         And even though I arrive a little \n                         bit early, everybody's already there. \n                         But the surprising part is --\n\n               WHAT YOUNG LIONEL SEES: Everyone in the class, including the \n               Teacher in the front, is naked. The Teacher holds out an \n               exam toward Young Lionel.\n\n                                     LIONEL (V.O.)\n                         -- I'm the only one who's prepared!\n\n                                                                    CUT TO:\n\n               INT. WAITING ROOM, MUMFORD'S OFFICE - DAY\n\n               ALTHEA BROCKETT, a woman in her forties, sits on the couch \n               reading a mail order catalogue for home furnishings. There \n               are several other catalogues sticking out of her jammed, \n               woven carry-all.\n\n               The door to Mumford's inner office opens with some force. \n               Mumford stands looking back across his office at Lionel, who \n               is getting up from the couch in some confusion.\n\n                                     LIONEL\n                         -- you crazy? You can't do this!\n\n                                     MUMFORD\n                         Sure I can, Lionel.\n\n                                     LIONEL\n                         I'm a criminal lawyer -- you think I \n                         like my clients? I can't stand most \n                         of them! But I don't kick them out...\n\n                                     MUMFORD\n                         See that sign -- We retain the right \n                         to refuse service to anyone. I'm not \n                         going to charge you for this session, \n                         but I don't want to see you back \n                         here.\n\n               Lionel looks around, but there is no such sign. He does spot \n               Althea watching the show from the couch.\n\n                                     LIONEL\n                         Don't you at least have a back door \n                         I can use?\n\n                                     MUMFORD\n                         Come out this way. There's no shame \n                         in getting a little therapy... is \n                         there, Althea?\n\n               Althea stands up, smiling. She thinks Mumford is the bee's \n               knees.\n\n                                     ALTHEA\n                         Not at all. It takes guts, Lionel.\n\n               Lionel steams by them in a black mood.\n\n                                     LIONEL\n                         Maybe some of us don't need this \n                         crap!\n\n                                     MUMFORD\n                         And it's the Hubble Telescope, not \n                         the Himball Telescope.\n\n               Lionel bangs out the front door. Mumford motions Althea inside --\n\n                                     MUMFORD\n                         Jeez... what an asshole.\n\n               Althea heads inside, giggling wildly. She can't get enough \n               of this guy.\n\n               INT. MUMFORD'S OFFICE -DAY\n\n               Althea is sobbing. Mumford hands her a new Kleenex from the \n               box next to the couch. She wads it with her current one and \n               tries to stop crying. Mumford settles back in his chair, \n               patient.\n\n                                     ALTHEA\n                         What do they want from me?\n                              (more sobbing)\n                         What have I done that's so wrong?\n                              (pulling it together)\n                         They act as though they don't have \n                         their own peculiar things... They \n                         do! Believe me. Everybody's got \n                         something...\n                              (looks at Mumford)\n                         Even you probably have things.\n\n                                     MUMFORD\n                         Me more than most.\n\n                                     ALTHEA\n                         Why are they ganging up against me?\n\n                                     MUMFORD\n                         I'm not sure. But I think they're \n                         worried about you.\n\n                                     ALTHEA\n                         It's the kids, you know, not Jeremy. \n                         He had nothing to do with this -- \n                         except pay, of course. He's always \n                         willing to pay. He's extremely \n                         generous.\n                              (a long beat)\n                         I'm so humiliated that my own children \n                         would threaten me.\n\n                                     MUMFORD\n                         How did they threaten you?\n\n                                     ALTHEA\n                         They said if I didn't get help, they \n                         wouldn't deal with me any more.\n                              (a beseeching look)\n                         What do you think about that?\n\n                                     MUMFORD\n                         Good kids.\n\n               Althea stares at him a long moment. She knows he's right. \n               Tears well up in her eyes and roll down her cheeks. She grabs \n               another Kleenex. In the midst of the torrent she tries to \n               talk, but it's undecipherable:\n\n                                     ALTHEA\n                         Mmmmfffstttubll abbittmm.\n\n                                     MUMFORD\n                         Hmm?\n\n               Althea uses three new tissues to dry up her face.\n\n                                     ALTHEA\n                         I said... you must come out to the \n                         house for dinner on Thursday.\n\n                                     MUMFORD\n                         Really? You think so?\n\n                                     ALTHEA\n                         Yes. Jeremy will be home for the \n                         weekend. And you can meet the kids.\n\n               Mumford considers, then nods his assent.\n\n               EXT. MUMFORD'S STREET - MAGIC\n\n               Mumford hurries up the sidewalk carrying two grocery bags. \n               He's late. The modest houses are close together on this pretty \n               street, which rises out of the main business district, seen \n               beyond Mumford.\n\n               EXT. THE DUPLEX HOUSE - MAGIC\n\n               Mumford comes to the house where he lives. He heads down the \n               driveway toward the stairs that lead up to his apartment.\n\n               The front yard is completely fenced. Lily, the owner of the \n               restaurant, is almost visible in there working among the \n               greenery of a lush garden. Her friendly dog, AINGE, sees \n               Mumford, leaps easily over the fence and does a circle around \n               Mumford, who has no free hand to pet him.\n\n                                     MUMFORD\n                         How ya doin', Ainge? Evenin', Lily.\n\n                                     LILY\n                         Doc.\n                              (doesn't look up)\n                         Ainge...\n\n               The dog leaps gracefully back into the yard. Mumford hurries \n               up the stairs.\n\n               INT. MUMFORD'S APARTMENT - MAGIC\n\n               Mumford comes in and puts the bags down on the kitchen \n               counter. He goes directly to the table by his main chair and \n               picks up the TV remote. He switches it on and changes the \n               channel. The opening segment of UNSOLVED MYSTERIES is just \n               beginning. It previews the stories on that evening's episode -- \n               disappearances and unclosed cases -- with Robert Stack \n               hosting.\n\n               CLOSE ON MUMFORD'S FACE as he watches. Only when the whole \n               show has been previewed does he seem to relax. He leaves the \n               show on as he goes into the kitchen and begins unloading the \n               bags.\n\n               INT. COOK'S HARDWARE STORE - DAY\n\n               Mumford is comparing different stepladders. MR. COOK, the \n               sixty-ish proprietor, has been watching from a distance, but \n               now --\n\n                                     COOK\n                         Dr. Mumford.\n\n                                     MUMFORD\n                              (doesn't really know \n                              him)\n                         Mr. Cook.\n\n                                     COOK\n                         Could you come with me please?\n\n               Mystified, Mumford follows Cook through the door into the \n               back.\n\n               BACK OF THE STORE. Cook motions for Mumford to take the seat \n               of honor in the work area, but Mumford prefers to stand. \n               Cook has a little trouble figuring how to start. Finally --\n\n                                     COOK\n                         I know I shoulda come to your office. \n                         I was gonna, actually, but then when \n                         you walked in here today...\n\n                                     MUMFORD\n                         Uh-huh.\n\n                                     COOK\n                         It's my daughter Sofie... she's gotta \n                         problem.\n\n                                     MUMFORD\n                         What's that?\n\n                                     COOK\n                         We're not sure. She's been to all \n                         kinds of doctors in the city and \n                         they've said different things. Some \n                         of 'em are callin' it --\n                              (wants to get this \n                              right)\n                         -- Epstein-Barr virus, and the rest \n                         are callin' it... Chronic Fatigue \n                         Symptom...\n\n                                     MUMFORD\n                         Syndrome... Chronic Fatigue Syndrome.\n\n                                     COOK\n                         That's it -- syndrome. So you know \n                         all about it?\n\n                                     MUMFORD\n                         No... a little. There's a lot of \n                         debate about it.\n\n                                     COOK\n                         Yeah, I got that. Some people think \n                         it's all in their heads.\n                              (more intense)\n                         It's been so bad she's had to move \n                         back here to Mumford and live with \n                         us. And I'm not sure that's the best \n                         thing, either...\n\n                                     MUMFORD\n                         Why's that?\n\n                                     COOK\n                         Oh... a lot of things. Several \n                         different factors. Will you see her, \n                         Doctor Mumford?\n\n                                     MUMFORD\n                         Sure. Why don't you bring her up to \n                         my office at 3 tomorrow afternoon.\n\n               Cook nods, but looks worried.\n\n                                     COOK\n                         I'm not sure she'll come. She's in a \n                         mood. Do you ever go to somebody's \n                         house?\n\n                                     MUMFORD\n                         Generally that doesn't work out so \n                         well. It sends the wrong message to \n                         people who need to make a change.\n\n               Cook is quick to agree; he doesn't want to make waves. But \n               he's worried.\n\n               EXT. MAIN STREET - DAY\n\n               Mumford is walking up the busy sidewalk carrying his new 5-\n               foot stepladder hooked on his shoulder. Folks greet him. \n               Suddenly Lionel appears in front of Mumford, who stops.\n\n                                     MUMFORD\n                         Hello, Lionel.\n\n                                     LIONEL\n                         You've got to have the right ladder \n                         for the job. You don't know what \n                         you're doing, you can get yourself \n                         in trouble.\n\n                                     MUMFORD\n                         You're right, as usual. See you.\n\n               Mumford continues up the street. We STAY WITH Lionel, who \n               watches Mumford with a sour look, then turns to enter a small \n               medical building.\n\n               INT. DR. DELBANCO'S OFFICE - DAY\n\n               DR. ERNEST DELBANCO, a middle-aged psychiatrist with longish, \n               vanity hair, and PHYLLIS SHEELER, a psychologist in her \n               thirties, sit on the doctor's comfortable furniture, \n               listening. The remains of their take-out lunch is on the \n               coffee table. They seem a little impatient with their as-yet-\n               unseen visitor --\n\n                                     LIONEL (O.S.)\n                         ...completely inappropriate and highly \n                         unprofessional. Now I don't want to \n                         presume to tell you how to run your \n                         businesses --\n\n                                     SHEELER\n                         -- practices.\n\n               Lionel is sitting across the room, making an ardent case --\n\n                                     LIONEL\n                         -- Whatever. Six months ago, you two \n                         were the only games in town. The \n                         value of your...\n                              (mocking)\n                         ...\"practices\" could be seriously \n                         undermined by this bozo. A town this \n                         size has only so many headcases to \n                         go around.\n\n                                     DELBANCO\n                         What exactly would you have us do, \n                         Lionel?\n\n                                     LIONEL\n                         Protect your turf! Check this guy \n                         out. I smell a rat, I tell you.\n\n               Delbanco and Sheeler exchange a look; they find Lionel \n               distasteful.\n\n                                     SHEELER\n                         Mr. Dillard, I'm sure Dr. Delbanco \n                         shares my gratitude for your concern. \n                         But I also know he'd agree that you \n                         misunderstand the nature of our \n                         calling to mental health. We're not \n                         in some... widget business, trying \n                         to crush our competition.\n\n                                     LIONEL\n                         What the hell's a widget?\n\n               INT. HALLWAY OUTSIDE DR. DELBANCO'S OFFICE - DAY\n\n               Lionel comes out of the office, miffed, and goes down the \n               stairs. A moment later, the door opens slightly and Delbanco \n               peeks out to make sure Lionel is gone. He closes the door on \n               us.\n\n               INT. DR. DELBANCO'S OFFICE - DAY\n\n               Delbanco stands at the door looking across the room at \n               Sheeler.\n\n                                     DELBANCO\n                         What an asshole!\n\n                                     SHEELER\n                              (agrees)\n                         Ernest, what do you think?\n\n                                     DELBANCO\n                         I think he's got a point.\n\n               So does she.\n\n               EXT. BASEBALL DIAMOND - DAY\n\n               Idyllic. The beautifully manicured field is surrounded by \n               lush woods. Standing about forty feet apart, Mumford and \n               Skip are alone on the field throwing a baseball back and \n               forth. For quite a while the only sounds are the birds, the \n               wind, and the regular SLAP of ball into glove. Finally --\n\n                                     SKIP\n                         This is great!\n\n               SLAP... SLAP.\n\n                                     SKIP\n                         This is exactly what I wanted.\n\n               SLAP... SLAP.\n\n                                     MUMFORD\n                         Skip, you must have lots of people \n                         you can throw a ball with.\n\n                                     SKIP\n                         You'd be surprised. Most guys have \n                         kids or wives or girlfriends. They're \n                         busy. It's not as easy as you think.\n\n                                     MUMFORD\n                         Skip, you're the head of the whole \n                         deal here. Are they busier than you?\n\n                                     SKIP\n                         Well, you know... that's the thing. \n                         Like I said, just about everybody in \n                         town works for me. And it's just not \n                         the same asking someone to throw a \n                         ball when they work for you. It's \n                         like an order or something... And no \n                         one -- no one -- asks me.\n\n               Mumford considers. SLAP... SLAP... SLAP.\n\n                                     MUMFORD\n                         So, would you say we're out here... \n                         let me think how to put this... Is \n                         your problem really that you're... \n                         lonely?\n\n                                     SKIP\n                         Don't you like this?\n\n                                     MUMFORD\n                         Hell yes, I like it. What's better \n                         than this? Most guys would kill just \n                         to have someone do this with them \n                         whenever they like.\n\n                                     SKIP\n                         Okay then.\n                              (SLAP... SLAP)\n                         Have you got a lot of friends?\n\n                                     MUMFORD\n                              (\"nope\")\n                         Lily and I talk a bit. You know Lily, \n                         runs the coffee shop?\n\n                                     SKIP\n                         No... I've seen her. Good-looking \n                         woman.\n\n                                     MUMFORD\n                              (agrees)\n                         She's probably ten years older than \n                         you.\n\n                                     SKIP\n                              (SLAP... SLAP)\n                         Good-looking woman.\n\n                                     MUMFORD\n                         Lives downstairs from me. She's got \n                         a great dog named for Danny Ainge.\n\n                                     SKIP\n                              (sparks to that)\n                         Really? I'm the only person I know \n                         that likes Danny Ainge, outside of \n                         Celtic fans. Maybe Phoenix.\n\n                                     MUMFORD\n                         Well, there's Lily.\n\n                                     SKIP\n                         Did you know that Danny Ainge was \n                         drafted by the Blue Jays? Do you \n                         know what kind of athlete you have \n                         to be to play in the NBA and in the \n                         bigs?\n\n                                     MUMFORD\n                         Amazing.\n\n                                     SKIP\n                         Unbelievable...\n                              (SLAP... SLAP)\n                         ...And Lily named her dog after him? \n                         Far out.\n\n                                     MUMFORD\n                         What kind of person do you have to \n                         be to do this?\n\n               Mumford gestures off in the one direction we have not yet \n               seen.\n\n                                     SKIP\n                         What?\n\n                                     MUMFORD\n                         This --\n\n                                                                    CUT TO:\n\n               REVERSE ANGLE: The baseball diamond is sitting in the vast, \n               lush grounds behind the PANDA MODEM WORLD HEADQUARTERS, a \n               brand new, distinctively original, high-tech office park. \n               Wherever there is an opportunity for tasteful signage, it is \n               in the motif of a Giant Panda -- sweet white face, black \n               eyes and ears, round body.\n\n               Skip is suddenly self-conscious, embarrassed.\n\n                                     SKIP\n                         I would've traded any of it to have \n                         made the Mumford High varsity.\n\n               Mumford takes that in. SLAP... SLAP.\n\n                                     SKIP\n                         So I guess Henry Follett is a patient \n                         of yours. He's my pharmacist.\n\n                                     MUMFORD\n                         Yeah.\n                              (SLAP... SLAP)\n                         Guy's got some serious sex fantasies.\n\n               Skip is a little surprised to hear this from Mumford, but he \n               just throws the ball.\n\n                                     MUMFORD\n                         Pretty good, too. Lots of detail. \n                         Nothing hard core. Old-fashioned \n                         ones, from back when people cared \n                         about atmosphere and character.\n\n                                     SKIP\n                         Uh-huh.\n\n                                     MUMFORD\n                         Problem is, his fantasy life's a lot \n                         better than his real one. Nothing \n                         can live up to it. His wife got sick \n                         of it and left him. Took his kids \n                         with her.\n\n                                     SKIP\n                         I wondered what happened to her...\n\n               Skip is fascinated, but a little uncomfortable. Mumford seems \n               oblivious, unusually talkative --\n\n                                     MUMFORD\n                         Of course, it's not that simple. \n                         There's something powerful going on \n                         there. We've got a lot of work to \n                         do.\n                              (announcer voice)\n                         It's hit to the warning track!\n\n               For the first time, Mumford throws the ball way high, like a \n               long fly ball. Skip, delighted as a dog, takes off running \n               and just barely catches it on the run. He pegs it back to \n               Mumford.\n\n                                     MUMFORD\n                         In these fantasies, Henry Follett is \n                         played by a handsome guy with biceps. \n                         Can you imagine that? Where your \n                         self-esteem has to be?\n                              (throws him the ball)\n                         Man, I'd just like to move the guy \n                         to the point where he gets to appear \n                         in his own fantasies.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               Silence. Nessa sits staring at Mumford defiantly, an unlit \n               cigarette in her mouth. Mumford looks at the clock -- 3:00 -- \n               and stands up, session over. Nessa quickly lights her \n               cigarette with the lighter concealed in her hand and stands \n               up too. She exhales a huge cloud of smoke and walks quickly \n               to the back door of the office, which Mumford has opened for \n               her, and goes out.\n\n               Mumford waves half-heartedly at the cloud of smoke as he \n               walks to the door to the waiting room and opens it.\n\n               MUMFORD'S POV: As the door swings open, the first figure we \n               see is Mr. Cook; he twists around at the sound of the door. \n               He acknowledges Mumford and then sighs as he steps aside to \n               reveal, sitting exhausted in a chair, his daughter --\n\n               SOFIE -- a young woman whose actual appearance is somewhat \n               disguised at present by her wan, ashen visage. She regards \n               Mumford with some resignation. Her father helps her out of \n               the chair. Sofie keeps her eyes on Mumford.\n\n               CLOSE ON Mumford, watching her.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               LATER. Mr. Cook is gone. Sofie is sitting up on the couch, \n               facing Mumford. She looks like she might pass out at any \n               moment, but her voice is stronger than you'd expect.\n\n                                     MUMFORD\n                         Feel free to lie down. Most people \n                         do.\n\n                                     SOFIE\n                         I'd better not, I'll fall right to \n                         sleep. I think it's too soon for me \n                         to be sleeping with you.\n\n               A joke. Mumford smiles.\n\n                                     MUMFORD\n                         What can you tell me about this?\n\n                                     SOFIE\n                         Oh, lord. It's almost too exhausting \n                         to tell you...\n                              (tiny smile, to herself)\n                         ...about my exhaustion. I didn't \n                         really want to come. I'm not hopeful \n                         right now. But I couldn't take the \n                         look on my dad's face. He's a truly \n                         kind person, which is pretty \n                         extraordinary if you knew the story. \n                         He's the opposite of me, I guess -- \n                         all stamina and resolve.\n\n               It's taken all her energy to say this and she sinks down a \n               bit into the couch.\n\n                                     MUMFORD\n                         When did you start to feel this way?\n\n                                     SOFIE\n                         About six months ago, I guess it is \n                         now. God, it seems like years. What \n                         a bore! I'm embarrassed by it. Before \n                         this happened -- when I'd hear people \n                         talk about this kind of thing -- I \n                         thought it was a bunch of bullshit.\n\n               She sees something in his face and suddenly laughs -- it's a \n               weak but magical sound.\n\n                                     MUMFORD\n                         What?\n\n                                     SOFIE\n                         You think that now! You think it's a \n                         bunch of hooey, don't you?\n\n                                     MUMFORD\n                              (unconvincing)\n                         No.\n\n                                     SOFIE\n                         I saw it. I saw it in your eyes.\n\n               Mumford is knocked off balance -- she's right. She saw him \n               clearly.\n\n                                     SOFIE\n                         That's okay. Maybe it is. My mother \n                         always says -- \"Everything that's \n                         wrong with you is in your head.\" I \n                         suppose that's true.\n\n                                     MUMFORD\n                         Back when this started, was there \n                         anything unusual happening in your \n                         life? A change of job, of living \n                         situation... a loss of some kind?\n\n                                     SOFIE\n                         No... but it started one year to the \n                         day after my divorce became final. \n                         That's not too suspicious, is it?... \n                         But it wasn't like I was feeling bad \n                         about the divorce. Just the opposite.\n\n                                     MUMFORD\n                         Hmm.\n\n                                     SOFIE\n                         Hmm? Is that a professional opinion?\n\n                                     MUMFORD\n                         Hmm, as in -- that's interesting. \n                         Sometimes, with enough clues, it's \n                         possible to figure these things out.\n\n                                     SOFIE\n                         Even if you don't think it's real?\n\n                                     MUMFORD\n                         I don't know what's real and what \n                         isn't. That's never been my strong \n                         suit. But if you're tired all the \n                         time and you've had to give up the \n                         life you were having and come back \n                         home when you didn't want to... that's \n                         worth trying to fix. Maybe I can \n                         help you do that.\n\n                                     SOFIE\n                         What would you do?\n\n                                     MUMFORD\n                         We... we would try several things. \n                         But I need to see you a lot.\n\n                                     SOFIE\n                         I don't know. I barely made it today.\n\n                                     MUMFORD\n                         I'll come to you. We'll try a little \n                         walking.\n\n               Sofie suddenly looks defeated.\n\n                                     MUMFORD\n                         We'll take it slow. You'll never \n                         feel you can't handle it.\n\n                                     SOFIE\n                         I don't think I can afford it. I \n                         don't want my dad paying.\n\n                                     MUMFORD\n                         We'll work it out.\n\n               Sofie gives him a long look.\n\n                                     SOFIE\n                         You have the best answer for \n                         everything.\n                              (Mumford shrugs)\n                         You seem so... hopeful. Are you always \n                         this sunny?\n\n                                     MUMFORD\n                         No one ever thought so. You must \n                         bring it out.\n\n                                     SOFIE\n                         Is it contagious? 'Cause everyone \n                         agrees my immune system's way down.\n\n                                     MUMFORD\n                         Maybe you'll catch it.\n\n                                     SOFIE\n                         Can I ask you something?\n                              (Mumford: of course)\n                         Didn't you tell my dad you didn't \n                         think it was a good idea to come to \n                         the patient?\n                              (he admits it)\n                         So what changed?\n\n               Mumford just smiles. He doesn't want to tell her the truth -- \n               everything.\n\n               EXT. BROCKETT HOUSE - MAGIC\n\n               A taxi drops Mumford in front of the Brockett's large and \n               beautiful house, which sits on an isolated lot on the \n               outskirts of town.\n\n               INT. HALLWAY TO BACK VERANDA, BROCKETT HOUSE - MAGIC\n\n               Althea leads Mumford toward the back of the lavishly appointed \n               house. The weird thing, what gets in the way of the decor, \n               is the cardboard boxes of all sizes which are stacked \n               everywhere. Many are unopened, but the rest are spilling \n               their styrofoam-nugget and bubble-wrap guts to reveal some \n               hint of their contents: a huge variety of catalogue-ordered \n               housewares, clothing, linens, gadgets, and knickknacks. If \n               it can be ordered from an upscale catalogue (and everything \n               can), it is here. Althea sounds very nervous, cheery.\n\n                                     ALTHEA\n                         -- sorry everything's in such an \n                         uproar. Lots of big occasions coming \n                         up, and of course Christmas is only \n                         eight months away --\n                              (giggles uncontrollably)\n                         -- I don't know what's keeping Jeremy. \n                         You know he stays in the city three \n                         nights a week -- I guess I explained \n                         that...\n                              (Mumford nods)\n                         ...I know Katie's here, but I'm not \n                         so sure about Martin... I'm making \n                         dinner myself tonight, so I'll have \n                         to leave you, I'm afraid...\n\n               EXT. REAR VERANDA, BROCKETT HOUSE - MAGIC\n\n               They come out onto the wide porch, which commands a \n               spectacular view of the surrounding countryside. There's an \n               elaborate bar cart out here, which Althea points Mumford \n               toward.\n\n                                     ALTHEA\n                         I'm awful I know, but will you please \n                         help yourself. I just got a new copper \n                         sauciere from Williams-Sonoma and \n                         I'm afraid it'll be the death of us \n                         all if I don't get back in there...\n\n               She disappears inside with a bang of the screen door. Mumford \n               gets a drink for himself, taking in the view. He sees \n               something out there.\n\n               MUMFORD'S POV: Way in the distance, coming out of the woods \n               and down toward the house is a teenage boy.\n\n                                     KATIE (O.S.)\n                         You're the doctor, aren't you?\n\n               Mumford turns to see that Althea's thirteen year old daughter \n               KATIE has silently appeared. Her jeans and little tee-shirt \n               are meant to be sexy; it seems sad on her. Mumford nods.\n\n                                     MUMFORD\n                         You must be Katie. People call me \n                         Doc.\n\n                                     KATIE\n                              (motioning urgently)\n                         C'mere. Quick... c'mon!\n\n               Mumford follows as she disappears around the corner of the \n               porch.\n\n               INT. SIDE HALL, BROCKETT HOUSE - MAGIC\n\n               Mumford follows Katie into a gloomy hall from a side entrance. \n               Here too, the walls are lined with boxes. She tiptoes to one \n               of two facing doors and waits for him.\n\n               When he has joined her, she motions him back a foot for \n               safety, then carefully opens the door to a large walk-in \n               closet. Katie's caution becomes understandable: the space is \n               packed so fully and chaotically with catalogue item cartons \n               that it might come tumbling out the door with one careless \n               move. Katie closes the door, then pirouettes to the opposing \n               door, which she swings open freely -- REVEALING: what was \n               once a study is now completely filled with hundreds of \n               cartons, in an infinite variety of shapes and sizes.\n\n               Mumford is taken aback. Katie points at packages and speaks \n               in a hypnotic WHISPER --\n\n                                     KATIE\n                         Cuddledown... Linen & Lace... Scully \n                         & Scully... Smith & Hawken... Plow & \n                         Hearth... Museum of Modern Art... \n                         Smithsonian Museum... J. Crew... \n                         Wolferman's... Hold Everything... \n                         Nieman Marcus... Coldwater Creek... \n                         Garnett Hill... Norm Thompson... \n                         Victoria's Secret... Sharper Image... \n                         Hammacher Schlemmer...\n\n               EXT. REAR VERANDA, BROCKETT HOUSE - MAGIC\n\n               Just as Mumford and Katie come back around the corner, MARTIN, \n               Althea's sixteen year old son, crosses the yard and comes up \n               onto the porch. He's wearing an old black leather jacket \n               with a lot of zippers, dirty jeans and black Converse All-\n               Stars that are coming apart. In his hand, casually but \n               properly held, is a .22 caliber rifle. He looks Mumford over.\n\n                                     MARTIN\n                         Is this him?\n\n                                     KATIE\n                              (nods)\n                         I showed him.\n\n                                     MARTIN\n                              (to Mumford)\n                         Do you get it now? This is no joke.\n\n               Mumford takes them both in and nods. He understands. Suddenly, \n               their manner changes, for the worse. What they can see that \n               Mumford cannot is JEREMY BROCKETT, Althea's husband, who has \n               come to the back screen door, with the bustle of a late \n               arrival.\n\n                                     JEREMY\n                         Hey, kids. Oh, hi.\n\n               Seeing Mumford, Jeremy steps out onto the porch to shake his \n               hand. Jeremy is quite handsome and a fantastic dresser; his \n               Armani outfit cost $4200 all in. His tone: hearty and strained --\n\n                                     JEREMY\n                         You must be Dr. Mumford of Mumford. \n                         Jeremy Brockett.\n\n                                     MUMFORD\n                         Doc. Nice to meet you.\n\n                                     JEREMY\n                         Sorry I'm late... traffic was a \n                         motherfucker. Have another drink, \n                         I'll be back in five.\n\n               Jeremy goes inside. Martin and Katie exchange a look with \n               each other, then to Mumford. Martin goes inside.\n\n                                                               DISSOLVE TO:\n\n               EXT. REAR VERANDA, BROCKETT HOUSE - NIGHT\n\n               LATER. Dinner is over. Jeremy comes out onto the veranda \n               carrying two Cuban cigars. His casual outfit is as stylish \n               and pricey as his work outfit. He joins Mumford and Althea, \n               who immediately gets up.\n\n                                     ALTHEA\n                         I'll be back.\n\n               She goes inside. The men each have a snifter of cognac. Jeremy \n               makes a ceremony of cutting the cigars --\n\n                                     JEREMY\n                         I think you'll like this. Know much \n                         about Cuban cigars?\n\n                                     MUMFORD\n                         Nope.\n\n               Jeremy puts the cigars down, pulls a joint out of his cashmere \n               pullover and fires it up. After exhaling a huge cloud of \n               smoke, he offers the joint to Mumford, who declines.\n\n                                     JEREMY\n                         Makes the whole thing that much \n                         better.\n\n               Jeremy takes another hit on the joint and puts it down. He \n               gives a cigar and his gold lighter to Mumford, who begins to \n               light up --\n\n                                     JEREMY\n                         Just hold the flame a little bit \n                         below the end... that's it... now \n                         just turn it slowly as you draw...\n\n               Mumford does as he's told. Jeremy lights his own cigar.\n\n                                     JEREMY\n                         Are you a man who likes to treat \n                         himself right?\n\n                                     MUMFORD\n                         I've had my moments.\n\n                                     JEREMY\n                         I am. And I'm not ashamed of it. \n                         Nobody ever said on their death bed -- \n                         \"I treated myself too well.\"\n\n                                     MUMFORD\n                         I thought it was -- Nobody ever said, \n                         \"I should have spent more time at \n                         the office.\"\n\n                                     JEREMY\n                         Fill in the blank. I don't mind the \n                         office. The point is, you only go \n                         'round once. Like the Zens say -- Be \n                         here now.\n\n                                     MUMFORD\n                         What do you do?\n\n                                     JEREMY\n                         Althea hasn't told you?\n\n                                     MUMFORD\n                              (no)\n                         We've been talking about her, mostly.\n\n                                     JEREMY\n                         Well, in '85 four of us left our \n                         firms and formed an investment banking \n                         venture. We've got twenty-three people \n                         working there now.\n\n                                     MUMFORD\n                         You've done well.\n\n               The marijuana is kicking in now -- Jeremy gets a self-\n               satisfied, condescending look on his face that no straight \n               mind would dare. His response includes their lavish immediate \n               surroundings--\n\n                                     JEREMY\n                         We've done... very well. You know \n                         anything about addiction, Doc?\n\n                                     MUMFORD\n                         A little.\n\n                                     JEREMY\n                         Well, I'm addicted to winning. I say \n                         when you're in the red zone, you \n                         gotta score.\n                              (watches Mumford smoke)\n                         So what do you think?\n\n                                     MUMFORD\n                         Tastes good.\n\n                                     JEREMY\n                         No... I mean about Althea. About \n                         her...\n                              (makes a face)\n                         ...behavior. Do you think you can \n                         fix her up?\n\n                                     MUMFORD\n                         What do you think's wrong with her?\n\n                                     JEREMY\n                         She's gone weird is what's wrong \n                         with her. Out of control. Probably \n                         from living out here in Mayberry.\n\n               Jeremy blows cigar smoke into his snifter, then takes a \n               mouthful of cognac, savoring the sensations. Mumford watches, \n               fascinated by this guy.\n\n                                     JEREMY\n                         You're the doctor, what do you think?\n\n                                     MUMFORD\n                         She seems very unhappy.\n\n               Jeremy gives him a look, as if to say \"duh.\"\n\n                                     JEREMY\n                         I think we all knew that, professor. \n                         The question... the real --\n                              (drawn out, stoned)\n                         -- quest-tio-nee... is... why?\n\n               Mumford looks at him a long time.\n\n               EXT. ROAD INTO MUMFORD - NIGHT\n\n               Jeremy Brockett's Mercedes 500 SL whips around a curve.\n\n               INT. BROCKETT'S MERCEDES - NIGHT\n\n               Martin is driving Mumford back to town.\n\n                                     MARTIN\n                         But you know how to drive?\n\n                                     MUMFORD\n                         Sure.\n\n                                     MARTIN\n                         Got a license?\n                              (yes)\n                         But no car?\n\n                                     MUMFORD\n                         Don't need it.\n\n                                     MARTIN\n                         I just got my license two weeks ago.\n\n                                     MUMFORD\n                         You're good.\n\n                                     MARTIN\n                         I been drivin' since I was twelve.\n\n                                     MUMFORD\n                         That would explain it.\n\n                                     MARTIN\n                         Can you help Mom?\n\n                                     MUMFORD\n                         I'm trying.\n\n                                     MARTIN\n                              (intense)\n                         Got to.\n\n               They drive in silence for a bit. Then --\n\n                                     MARTIN\n                         Nessa Watkins... She comes to you, \n                         doesn't she? You're treating her, \n                         right?\n\n               Mumford gives him a surprised look, then acknowledges it.\n\n                                     MARTIN\n                         What's wrong with her?\n\n                                     MUMFORD\n                         Is she a friend of yours?\n\n                                     MARTIN\n                         No... sort of. Man, she could be \n                         cool, but all she does is get wrecked \n                         and do all the guys. She's blowin' \n                         them in the parking lot.\n\n               Mumford knew that.\n\n                                     MARTIN\n                         A person's got to hate themselves to \n                         act like that.\n\n               Mumford regards Martin with respect, then turns to look out \n               front. After a few moments --\n\n                                     MARTIN\n                         Have you ever met a bigger shithead \n                         than my stepfather?\n\n               EXT. THE DUPLEX HOUSE - NIGHT\n\n               Lily is walking Ainge as the Mercedes pulls up and Mumford \n               gets out. Ainge runs happily around the car and puts his \n               paws up on the driver's door to greet Martin; we HEAR the \n               clicking SCRATCH of his nails on the surface. Martin rubs \n               the dog's head.\n\n                                     LILY\n                         Ainge!\n\n                                     MARTIN\n                         That's okay. Jeremy won't mind. Good \n                         dog.\n\n                                     LILY\n                         Ainge!\n\n               The dog obediently leaves Martin and runs back to Lily. \n               Mumford waves as Martin pulls away.\n\n                                     LILY\n                              (to Ainge)\n                         Do we run into the street? No, I \n                         didn't think so.\n                              (looks after Martin)\n                         Nice car. How's that place?\n\n                                     MUMFORD\n                         It's a pretty piece of land.\n\n               They walk up the block with the dog.\n\n                                     LILY\n                         And the Brocketts?\n\n                                     MUMFORD\n                         Horror show. What'd you do tonight?\n\n                                     LILY\n                         It was insane here, man. 'Hadda call \n                         in the National Guard.\n                              (he nods)\n                         Then I did my laundry... watched \n                         20/20.\n\n                                     MUMFORD\n                         ...And?\n\n                                     LILY\n                         Shocking. Did you know the government \n                         is wasteful?\n                              (Mumford reacts)\n                         You heard it here first. Oh, and \n                         being a supermodel... it's no walk \n                         in the park.\n\n                                     MUMFORD\n                         Why do you watch?\n\n                                     LILY\n                         No gentleman caller, Doc.\n                              (they turn back)\n                         Not that I care. I've had it with \n                         men. They're so fascinated by their \n                         own crap. Took me four years to get \n                         the last one out. Almost turned me \n                         into a dyke... These days my idea of \n                         a hot date is a long shower by myself \n                         before bed. Now that feels good. And \n                         you don't have to do all that... \n                         listening.\n\n               Mumford laughs.\n\n                                     LILY\n                         Oops... sorry. I guess that's the \n                         story of your life.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               TIGHT ON COMPUTER SCREEN. A health information \"library\" \n               website has been called up on Mumford's office computer. \n               Right now it's beginning to spew information about \"CHRONIC \n               FATIGUE SYNDROME\" -- Definitions, Signs and Symptoms, \n               Diagnostic Measures, etc.\n\n               Mumford is hunched over the computer, reading avidly. His \n               printer is churning out hard copies.\n\n               EXT. FRONT PORCH, COOK HOUSE - DAY\n\n               Mumford comes out the front door and holds it open for Sofie. \n               He offers his arm and she takes it tentatively.\n\n                                     SOFIE\n                         I'm not making any promises.\n\n                                     MUMFORD\n                         We'll turn back anytime you want.\n\n                                     SOFIE\n                              (seeing something)\n                         Oh boy... this should be interesting.\n\n               Mumford looks out toward the street. A woman in her fifties \n               is turning into the front walk. She stares at them, unsmiling, \n               as the two parties converge. She is MRS. COOK.\n\n                                     SOFIE\n                         Hello, Mother. I want you to meet \n                         Dr. Mumford.\n\n                                     MRS. COOK\n                         Mumford... like the town?\n\n                                     MUMFORD\n                              (offering his hand)\n                         Yes. It's nice to meet you, Mrs. \n                         Cook.\n\n               She finally takes his hand, but it's not friendly.\n\n                                     MRS. COOK\n                         What's happening here?\n\n                                     SOFIE\n                         We're going for a walk.\n\n                                     MRS. COOK\n                         Do you think that's a good idea?\n\n                                     SOFIE\n                         Dr. Mumford does, yes. I've put myself \n                         completely in his hands. For today, \n                         anyway.\n\n                                     MRS. COOK\n                         What kind of doctor are you?\n\n                                     MUMFORD\n                         Ph.D., psychologist.\n\n                                     MRS. COOK\n                         Oh... not a real doctor.\n\n                                     MUMFORD\n                         That's right, the fake kind.\n\n               Mrs. Cook is not amused. Sofie pulls on Mumford.\n\n                                     SOFIE\n                         We'd better go or I'm liable to bail \n                         on the whole thing.\n\n               Mrs. Cook steps aside as they move up the walk.\n\n               EXT. SIDEWALK, NEAR THE COOK HOUSE - DAY\n\n               Mumford and Sofie, foreground, walk slowly up the block. In \n               the background, Mrs. Cook watches for awhile before going \n               inside.\n\n                                     SOFIE\n                         Mom's such a cutie.\n\n                                     MUMFORD\n                         People usually have to get to know \n                         me before they hate me.\n\n                                     SOFIE\n                         She's not in a bad mood. She's like \n                         that all the time.\n                              (a beat)\n                         It doesn't bother me anymore. It's \n                         my dad and my brother I worry about.\n\n                                     MUMFORD\n                         Maybe... but you're the one whose \n                         ass is dragging.\n\n                                     SOFIE\n                              (laughs)\n                         Is that the technical description of \n                         what I've got?\n\n                                     MUMFORD\n                         Is she against you getting help?\n\n                                     SOFIE\n                         We don't discuss it.\n\n                                     MUMFORD\n                         Something's bothering her.\n\n                                     SOFIE\n                         Oh, we've all disappointed her. Me, \n                         especially, but Dad, of course. She \n                         thinks my brother's all right, but \n                         she didn't expect much. It's what \n                         happens when you \"marry beneath \n                         yourself\"...\n\n               Sofie suddenly seems to be fading.\n\n                                     MUMFORD\n                         Please... forgive me.\n\n                                     SOFIE\n                         What?\n\n                                     MUMFORD\n                         Negative thinking makes everything \n                         more difficult. If you're going to \n                         have enough strength to do this, we \n                         have to talk only about positive \n                         things. All right?\n\n               She looks at him, unsure if he's serious. It seems so corny. \n               But she agrees.\n\n                                     MUMFORD\n                         Okay then... Are you positive your \n                         mother's a bitch?\n                              (she laughs, surprised)\n                         Just kidding.\n\n                                     SOFIE\n                         You've got a funny idea of funny.\n\n                                     MUMFORD\n                              (seems worried)\n                         I've offended you!\n\n                                     SOFIE\n                         No.\n\n                                     MUMFORD\n                         Really? What would it take?\n\n               She laughs again; surprised again. He's got her off balance \n               makes a \"rim shot\" sound.\n\n                                     SOFIE\n                         Is this the treatment?\n\n                                     MUMFORD\n                         Sorry... I'm done.\n\n                                     SOFIE\n                         'Cause I'll tell you, none of the \n                         others have tried this approach.\n\n               They've come to the corner. He gestures to ask -- \"shall we \n               cross?\" She considers for quite a while, gauging her strength, \n               then, still on his arm, steps off the curb --\n\n                                     SOFIE\n                              (absurdly unconvincing)\n                         Hey, 'Just do it!'\n\n               THEY CROSS OUT OF FRAME as we HEAR:\n\n                                     MUMFORD (O.S.)\n                         I want you to tell me all your \n                         symptoms.\n\n               EXT. PATH BY RIVER - DAY\n\n               ANOTHER DAY. They're dressed differently. Sofie seems more \n               vigorous.\n\n                                     SOFIE\n                         I'm embarrassed. The list is so long.\n\n                                     MUMFORD\n                         Be specific.\n\n                                     SOFIE\n                         Well... I'm tired all the time, \n                         obviously. I always feel like taking \n                         a nap. But when I try to sleep, I \n                         have trouble.\n                              (Mumford nods)\n                         My muscles ache. And my joints. I \n                         feel like an old person, or like I \n                         did back when I used to work out too \n                         hard... What else?...\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               CLOSE ON COMPUTER SCREEN. Under the list of Signs and \n               Symptoms: \"Sore throat.\"\n\n                                     MUMFORD (V.O.)\n                         Sore throat?\n\n                                     SOFIE (V.O.)\n                         Uh-huh.\n\n               ON THE SCREEN: \"Low grade fever... Painful lymph glands... \n               Irritability...\"\n\n                                     MUMFORD (V.O.)\n                         Low grade fever?\n\n               EXT. PATH BY RIVER - DAY\n\n               Sofie nods.\n\n                                     MUMFORD\n                         Painful lymph glands?\n                              (yes)\n                         Forget fulness... irritability... \n                         depression?\n\n                                     SOFIE\n                         Yes, yes, and definitely yes. Also... \n                         I get confused.\n\n                                     MUMFORD\n                         Yeah, most people have that. It's \n                         confusing here.\n\n                                     SOFIE\n                         Where?\n\n                                     MUMFORD\n                         Life.\n\n               EXT. HIGH SCHOOL ATHLETIC FIELD - DAY\n\n               ANOTHER DAY. Mumford is leading Sofie through the lightest \n               set of calisthenics ever devised. Now they're doing waist \n               bends and arm waving. Even so, it's taking everything Sofie's \n               got.\n\n                                     SOFIE\n                         I don't know if I mentioned the \n                         headaches.\n\n                                     MUMFORD\n                         Did you get headaches before this?\n                              (Sofie: yes)\n                         But you get more now? Or more severe?\n\n                                     SOFIE\n                         No, not really. They're about the \n                         same. My marriage was one long \n                         headache.\n\n                                     MUMFORD\n                         So the headaches may not even be a \n                         part of this?\n\n               She considers that, reluctantly agrees.\n\n                                     MUMFORD\n                         I can give myself a headache \n                         instantly.\n\n                                     SOFIE\n                         Is that like a party trick?\n\n                                     MUMFORD\n                         All I have to do is have two \n                         conflicting thoughts at the same \n                         time... Like I'll think -- 'Taking \n                         these walks is going to help Sofie \n                         get better.' But then I'll also think -- \n                         'Mumford, you just enjoy taking these \n                         walks and you're kidding yourself \n                         about the benefits.'\n\n               Sofie's not sure how to take that. She looks away.\n\n                                     MUMFORD\n                         There... I've given myself a real \n                         whopper.\n\n                                     SOFIE\n                         You actually address yourself by \n                         name in your thoughts?\n                              (Mumford laughs)\n                         So you really think having two \n                         opposing ideas in your head does \n                         some kind of damage?\n\n                                     MUMFORD\n                         Sometimes, yeah... pulling in two \n                         different directions at once. It \n                         makes tiny little tears in our fabric.\n\n                                     SOFIE\n                         Well then, my life has been some \n                         kind of huge rip.\n\n               INT. BOARDING HOUSE (IN HENRY FOLLETT'S FANTASY) - DAY\n\n               The handsome Newcomer of Follett's fantasy comes down the \n               steps from the attic wearing a sleeveless undershirt, towel \n               thrown over his shoulder. He goes into the bathroom off the \n               second floor hall and begins to wash up. [Again, Follett's \n               fantasy world is in BLACK & WHITE.]\n\n                                     FOLLETT (V.O.)\n                         The town was a rube's heaven, but I \n                         found work my first day out down at \n                         Old Man Sutter's gas station and \n                         diner. I knew his stacked young wife \n                         was going to be a problem, but, hey, \n                         life is full of problems. Back at \n                         the boarding house, I was washing up \n                         when I heard a load of yellin' and --\n\n               IN THE BATHROOM MIRROR, the Newcomer's POV: a nubile teenager, \n               17 going on 35, in a tight cheerleader's outfit, comes up \n               the stairs and stops at the top to turn and yell back down \n               at her mother. Her dialogue distant and echoey:\n\n                                     LANDLADY'S DAUGHTER\n                         ...get off my case! You don't like \n                         any of my friends...\n\n                                     FOLLETT (V.O.)\n                         ...I got my first look at the \n                         landlady's daughter.\n\n               The LANDLADY'S DAUGHTER looks up and sees the Newcomer \n               watching her through the half-open bathroom door. She gives \n               him a petulant, white-hot look, then turns on her heel and \n               goes into her room at that end of the hall. She bangs her \n               door behind her, but it bounces open again about a foot. The \n               Newcomer, still watching in the bathroom mirror, now has a \n               view of the bureau mirror in the Landlady's Daughter's room. \n               In there, seemingly oblivious, the girl quickly strips off \n               the top of her outfit, revealing a '50's-era white bra.\n\n                                     FOLLETT (V.O.)\n                         Lucky for me, she was plenty upset \n                         but not too careful.\n\n               Suddenly, in mirror reflection of mirror, the Landlady's \n               Daughter meets the Newcomer's smoldering stare and her lip \n               begins to curl.\n\n                                     FOLLETT (V.O.)\n                         Or maybe it wasn't an accident at \n                         all --\n\n                                     MUMFORD (V.O.)\n                         Mr. Follett.\n\n                                     FOLLETT (V.O.)\n                         -- 'cause in that instant I saw the \n                         beginning of a vixen's smile and I \n                         knew --\n\n                                     MUMFORD (V.O.)\n                         Henry!\n\n               Mysteriously, the door to the girl's bedroom slams shut, \n               cutting off the Newcomer's view. He looks with surprise into \n               his mirror -- it suddenly shatters.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               Follett sits up abruptly on the couch and twists toward \n               Mumford, agitated.\n\n                                     FOLLETT\n                         What?\n\n                                     MUMFORD\n                         Stop now.\n\n                                     FOLLETT\n                         Why? I'm paying for this.\n\n                                     MUMFORD\n                         Not for this. Not me, you're not.\n\n                                     FOLLETT\n                              (challenging)\n                         You find it distasteful, don't you?\n\n                                     MUMFORD\n                         It doesn't matter how I feel about \n                         it. It's how you feel about it that \n                         matters.\n\n                                     FOLLETT\n                         I enjoy it. Does that make me some \n                         kind of pervert? Just because a man \n                         has a rich imaginative life --\n\n                                     MUMFORD\n                         You didn't come to me because you \n                         have a rich imagination.\n\n                                     FOLLETT\n                         No?\n\n                                     MUMFORD\n                         You came because it's taking over. \n                         You're in its grip.\n\n                                     FOLLETT\n                         I never said that.\n\n               Mumford's tone suddenly picks up a touch of steel.\n\n                                     MUMFORD\n                         Where's your wife, Henry?\n\n               Follett flinches, settles back down onto the couch, sulking.\n\n                                     MUMFORD\n                         Where's your wife, Henry?\n\n                                     FOLLETT\n                         Go to hell.\n\n                                     MUMFORD\n                              (softer)\n                         I didn't hear you.\n\n               Follett mutters something to himself, then is silent until --\n\n                                     FOLLETT\n                         We got divorced.\n                              (petulant)\n                         I had to get rid of her. She couldn't \n                         satisfy me.\n\n                                     MUMFORD\n                              (shouts, Follett jumps)\n                         What?!\n\n               Follett seems to shrink in size. They've been here before \n               and he doesn't like it.\n\n                                     FOLLETT\n                              (softly)\n                         I was... never satisfied.\n\n                                     MUMFORD\n                              (normal again)\n                         Now we're back on track.\n\n               Again, Follett says something under his breath.\n\n                                     MUMFORD\n                         What's that?\n\n                                     FOLLETT\n                              (long beat)\n                         You are so mean.\n\n               EXT. HIKING TRAIL - MAGIC\n\n               Mumford strides up the trail on his late day excursion. He \n               comes around a bend and is surprised to find Skip waiting \n               for him, looking serious.\n\n                                     MUMFORD\n                         Hey, Skip.\n\n                                     SKIP\n                         Doc. I know we're not supposed to \n                         get together till Wednesday...\n\n                                     MUMFORD\n                         That's all right. What's on your \n                         mind?\n\n               Mumford indicates that Skip should walk with him up the trail.\n\n                                     SKIP\n                         How many sessions have we had now, \n                         Doc?\n                              (Mumford tries to \n                              remember)\n                         Six. And it's been good... like we \n                         were two buddies hanging out. Just \n                         shootin' the shit.\n\n                                     MUMFORD\n                         Yep.\n\n               They walk in silence for a while.\n\n                                     SKIP\n                         This is really hard. Everything I \n                         want to say is hard...\n\n               EXT. BIG ROCK LOOKOUT POINT - MAGIC\n\n               Mumford and Skip come out of the trees, climb onto the big \n               rock, and settle down. The sun is falling over the town of \n               Mumford.\n\n                                     SKIP\n                         ...We're like friends, almost... who \n                         trust each other.\n\n               He checks Mumford's reaction. Mumford nods, offers Skip water, \n               who turns it down. Mumford takes a swig.\n\n                                     SKIP\n                         I want to tell you something, Doc, \n                         but before I do, I need to ask you a \n                         question... Because, for me to tell \n                         you this thing -- well, I haven't \n                         told anybody about this. It's the \n                         biggest secret I've got.\n\n                                     MUMFORD\n                         Sometimes it's best to keep a few \n                         things just for ourselves.\n\n                                     SKIP\n                         You're a shrink, Doc. Aren't I \n                         supposed to be able to tell you \n                         everything?\n\n                                     MUMFORD\n                         It's just a thought.\n\n               Skip, even more unsure now, looks away, at the town below.\n\n                                     SKIP\n                         That really relates to the thing I \n                         want to ask you... I've noticed that \n                         sometimes, not a lot, but sometimes, \n                         when we're hanging out, throwin' the \n                         ball... or that time we went \n                         bowling... sometimes you'll like --\n                              (gets it out fast --)\n                         -- tell me things about your other \n                         patients.\n\n               Mumford lets that hang a few moments, then acknowledges it \n               silently. Now Skip is even more nervous.\n\n                                     SKIP\n                         Hey, maybe that's all right! I don't \n                         know all that much about psychology \n                         or therapy or... ethics, so maybe \n                         there's something I missed... or \n                         something...\n\n                                     MUMFORD\n                         You're concerned that maybe I can't \n                         be trusted with a secret.\n\n                                     SKIP\n                         I trust you. Definitely. No question. \n                         But, yeah, I'm a little concerned. I \n                         mean, you're not supposed to tell \n                         anyone about your patients' \n                         problems... are you?\n\n               Mumford looks at Skip for a long moment.\n\n                                     MUMFORD\n                         That is correct, Skip. I'm going to \n                         have to take a long look at that.\n\n               The conversation seems to end there. Skip's not sure where \n               to go next. Finally --\n\n                                     SKIP\n                         Yeah, well... what I was gonna tell \n                         you --\n\n                                     MUMFORD\n                         -- Skip. Knowing what you do about \n                         me --\n\n                                     SKIP\n                         Doc, I trust you! You've listened to \n                         me better than anybody... maybe ever.\n                              (leans in, intense)\n                         And this secret I've got, I can't \n                         stand it anymore. I don't know if \n                         I'm some kind of --\n\n               Skip looks around at the darkening woods, though clearly \n               there's no one around.\n\n                                     SKIP\n                         -- I don't know if I'm a pervert or \n                         what. It's taken me this long to get \n                         where I can come out and say it... I \n                         can't back away now. I can't spend \n                         another day not knowing if I'm nuts.\n\n               Skip closes his eyes for a second and gathers himself.\n\n                                     SKIP\n                         All right, I'm just gonna tell you, \n                         as simple and direct as I can.\n                              (one last spasm of \n                              doubt)\n                         And you understand that this is a \n                         big secret? Just between us?\n                              (Mumford does)\n                         Okay. You know I've got this gift \n                         for certain kinds of... machines.\n\n                                     MUMFORD\n                         You are Panda, monarch of modems.\n\n                                     SKIP\n                         That's right. And you also know that \n                         even though I make 23% of the modems \n                         in the world... I cannot make one \n                         simple connection with any woman who \n                         could truly love me.\n\n                                     MUMFORD\n                         Okay... let's say that, for now.\n\n                                     SKIP\n                         It's true, believe me. So... do you \n                         know what I've been doing, all alone, \n                         in my workshop, for almost two \n                         years?... Mr. Find-the-Need-and-Fill-\n                         It. How I spend my every solitary \n                         hour?\n\n               Mumford shakes his head, \"no.\"\n\n                                     SKIP\n                         Guess.\n                              (Mumford demurs)\n                         Go ahead, guess!\n\n                                     MUMFORD\n                              (if he must)\n                         Jerking off?\n\n                                     SKIP\n                         No!... Although that's a good guess. \n                         No, what I've been working on, what \n                         the world really needs and no one \n                         has been able to create --\n                              (leans in, whispering)\n                         -- a virtually life-like, humanoid, \n                         gender-specific, anatomically \n                         functional... sexual surrogate slash \n                         companion.\n\n               Mumford tries to put that all together. Finally --\n\n                                     MUMFORD\n                         Slash what?\n\n                                     SKIP\n                         Sexual surrogate... slash... \n                         companion.\n\n                                     MUMFORD\n                         A doll?\n\n                                     SKIP\n                         No, Doc, not a doll. I am Panda. I'm \n                         talking about much, much more than a \n                         doll. The world has never seen what \n                         I'm talking about... except maybe in \n                         the movies.\n\n               Mumford considers that a long time, watching as the sun \n               finally sinks below the horizon. He looks back at Skip.\n\n                                     MUMFORD\n                         How's it coming?\n\n                                     SKIP\n                         You don't think I'm insane?\n\n                                     MUMFORD\n                              (\"no\")\n                         And that's your secret?\n                              (Skip: \"yes\")\n                         You meant -- like a trade secret?\n\n                                     SKIP\n                         No, Doc, a private secret! It's \n                         perverted, it's pitiful. What am I -- \n                         Dr. Frankenstein? Aren't you repulsed?\n\n                                     MUMFORD\n                         Sounds like kind of a good idea.\n\n                                     SKIP\n                              (nonplussed)\n                         Really?\n\n                                     MUMFORD\n                         Definitely.\n\n               It's getting dark fast now. Mumford reaches into his bag and \n               takes out the headlamp we saw earlier. He fits the straps \n               carefully over his head.\n\n                                     MUMFORD\n                         Skip, that's not much of a secret.\n\n                                     SKIP\n                              (hurt)\n                         It's not?\n\n                                     MUMFORD\n                         Oh, it's okay. It's just not something \n                         to be ashamed of. Maybe you don't \n                         want people knowing -- and believe \n                         me, it's safe with me -- but on the \n                         scale of dirty little secrets, I'd \n                         give it, say... a two.\n\n               Mumford twists the headlamp and the light shines out in the \n               dusk. Mumford turns the beam directly at Skip.\n\n                                     MUMFORD\n                         You want to know a secret? I'll tell \n                         you a secret. Since it's just between \n                         us and all...\n\n               Skip, hanging on every word now, agrees emphatically.\n\n                                     MUMFORD\n                         The secret, Skip, is this -- I am \n                         not now, nor have I ever been... a \n                         psychologist.\n\n               At first, Skip thinks he's misunderstood Mumford. But in the \n               huge silence that ensues, he replays it and knows he's heard \n               right. Mumford looks around, adjusts his headlamp, and gets \n               up.\n\n                                     MUMFORD\n                         We'd better get going. Just follow \n                         my light. And, Skip, watch your step.\n\n               EXT. MUMFORD'S PORCH, THE DUPLEX HOUSE - NIGHT\n\n               This porch is directly above Lily's porch. Mumford and Skip \n               sit nursing beers. There's a cooler on the floor. Mumford's \n               legs are propped up on the porch railing\n\n                                     SKIP\n                         Who else knows?\n\n                                     MUMFORD\n                         Just you.\n\n                                     SKIP\n                         It's time you did some talkin', Dr. \n                         Mum -- Wait a minute. That is your \n                         name, isn't it?\n\n               Mumford takes a drink of beer.\n\n                                     SKIP\n                         Damn! What is your name?\n\n                                     MUMFORD\n                         Doesn't matter. You can call me Doc.\n\n                                     SKIP\n                         It matters to me.\n\n               Mumford gestures: \"sorry, no can do.\"\n\n                                     SKIP\n                         I've told you a lot of private stuff.\n\n                                     MUMFORD\n                         I can tell you anything else.\n\n                                     SKIP\n                         What about everything? How did this \n                         happen?\n\n               Mumford looks at Skip, considering. He takes a long pull \n               from his beer, then looks at the frosty bottle.\n\n                                     MUMFORD\n                         Did you know that every species of \n                         mammal has found some way to drug, \n                         inebriate, or anestnetize itself? \n                         Even if it's just banging its head \n                         against a rock. Seems to be some \n                         natural urge... to get away for a \n                         while.\n                              (one more look at \n                              Skip)\n                         I've had it for as long as I can \n                         remember. The first place I wanted \n                         out of was home...\n\n               AS MUMFORD TALKS we SEE IMAGES FROM HIS PAST, all FROM \n               MUMFORD'S POV. We do not see him in the scenes. Instead, \n               everyone else in the scene RELATES TO THE CAMERA AS MUMFORD, \n               even if they're just ignoring him.\n\n               EXT. MUMFORD'S CHILDHOOD HOME, BALD KNOB, WEST VIRGINIA - \n               MAGIC\n\n               MOVING FAST (MUMFORD'S CHILDHOOD POV) toward the back door \n               of a rundown, little house in a poor mining community. We \n               reach the back door and bang inside --\n\n               INT. MUMFORD'S CHILDHOOD HOME - MAGIC\n\n               The cramped interior is grimy and depressing. MUMFORD'S MOTHER \n               worse for wear, has just put a glass of liquor on the sink \n               and returned her attention to the smoking stovetop. She \n               glances briefly at Mumford and greets him pleasantly, clearly \n               drunk. Suddenly, her attention shifts and we -- PAN TO THE \n               FRONT DOOR which is opened roughly by MUMFORD'S FATHER, a \n               coal miner whose face still shows the grime of his work. But \n               it's his scary scowl that impresses. His eyes take in his \n               wife (and her drink) but he says nothing. He barely gives \n               Mumford a glance as he drops his lunch pail on the table and \n               disappears into another room.\n\n                                     MUMFORD (V.O.)\n                         I thought I had the best parents in \n                         Bald Knob, West Virginia... till I \n                         was seven years old and got a look \n                         at some others. They weren't bad \n                         folks...\n\n               AT THE DINNER TABLE. Across the table, MUMFORD'S OLDER SISTER \n               eats with her head down. On the right, Mumford's Mother is \n               picking at her food. Mumford's POV shifts to his Father, who \n               is yelling something at his wife.\n\n                                     MUMFORD (V.O.)\n                         ...but they were real unhappy about \n                         being who they were...\n\n               Now, his Father looks suddenly at Mumford; his hand shoots \n               out to slap Mumford's face, and the IMAGE GOES BLACK, then \n               immediately FADES UP AGAIN on --\n\n               INT. HIGH SCHOOL CLASSROOM, WEST VIRGINIA - DAY\n\n               TIGHT ON A TEST PAPER being laid on an old-fashioned student \n               desk. Scrawled in red pencil at the top: \"A -- Outstanding!\"\n\n               TILT UP to the old classroom, full of kids getting their \n               tests back. ACROSS THE AISLE, looking at camera with disgust, \n               is a sixteen year old boy, MUMFORD'S CLASSMATE.\n\n                                     MUMFORD (V.O.)\n                         It made no sense that school came \n                         easy for me... I didn't do much work, \n                         and there was a proud tradition in \n                         my family of being really dumb. My \n                         friends didn't like it much. It made \n                         them distrust me...\n\n               EXT. FOOTBALL FIELD - NIGHT\n\n               FROM INSIDE A HELMET: the brutal chaos of crashing bodies in \n               a Friday night high school football game. Mumford is violently \n               hit. Our view is smashed so deep into the muddy turf that \n               again the IMAGE GOES BLACK, then quickly FADES UP AGAIN on --\n\n               INT./EXT. LOVER'S LANE, WOODS - NIGHT\n\n               TIGHT ON A CAN OF \"IRON CITY\" BEER in MUMFORD'S POV as he \n               puts it on the roof of a green Nash Rambler and ducks into \n               the back seat. In the shadows is a teen-age girl, MUMFORD'S \n               DATE. As Mumford moves toward her, she flames a Bic lighter \n               and gleefully lights a fat joint; her blouse is unbuttoned \n               and gaping.\n\n                                     MUMFORD (V.O.)\n                         On the other hand, it made some of \n                         my classmates like me better... I \n                         don't know what it was in me, maybe \n                         some genes from my mom, maybe some \n                         discomfort with myself, but early on \n                         I was drawn to any substance that \n                         made me numb...\n\n               EXT. HIGH SCHOOL FOOTBALL FIELD - DAY\n\n               Graduation Ceremonies. MUMFORD'S POV moving across a platform \n               toward the diploma being proffered by the PRINCIPAL. PAN TO \n               Mumford's Parents, dressed up and proud, in the audience.\n\n                                     MUMFORD (V.O.)\n                         When I got a scholarship to go out \n                         of state to college, I was the first \n                         one in my extended family who'd gone \n                         beyond high school. At graduation, \n                         my folks looked like a normal, happy \n                         couple, which I guess they were about \n                         10% of the time... out in public.\n\n               INT. UNIVERSITY DORMITORY HALLWAY - DAY\n\n               TIGHT ON A DORM ROOM DOOR as it is pushed open. MUMFORD'S \n               NEW ROOMMATE, a crazed, middle-class doper, has his stuff \n               spread around and is settled in the midst of the chaos. He \n               looks up at the arriving Mumford with a maniacal, stoned \n               smile.\n\n                                     MUMFORD (V.O.)\n                         My roommate was from a planet I had \n                         never heard of called Scarsdale, \n                         where everything was the opposite of \n                         West Virginia...\n\n               INT. COLLEGE APARTMENT - NIGHT\n\n               TIGHT ON A BONG filling with white smoke. We FOLLOW IT UP \n               THE TUBE to a PRETTY COED, who inhales deeply, then blows a \n               seductive cloud directly at Mumford. The room is full of \n               partying students.\n\n                                     MUMFORD (V.O.)\n                         All the other kids, in fact, seemed \n                         to know things I didn't. They were \n                         friendly enough, but in four years, \n                         I never got over feeling that I had \n                         sneaked in... and was about to be \n                         exposed as the hillbilly and imposter \n                         I actually was.\n\n               INT. BEDROOM, STUDENT APARTMENT - NIGHT\n\n               Funky decor, red scarf over the lamp creating a sexy glow. \n               MUMFORD'S POV moves toward an undulating shape hidden by a \n               sheet on the bed. He reaches out and lifts the edge to REVEAL \n               the Pretty Coed, now naked, giggling, her extended hand \n               offering a tab of acid right up to camera.\n\n                                     MUMFORD (V.O.)\n                         The thing that always made those \n                         feelings go away was... fun. Fun was \n                         drugs, fun was sex, fun was \n                         aggressively doing nothing. The only \n                         problem I had with degenerate, self-\n                         destructive behavior was... I couldn't \n                         get enough of it.\n\n               INT. UNIVERSITY CLASSROOM - DAY\n\n               A PROFESSOR approaches camera and lays a fresh examination \n               on the desk in front of Mumford. The problem is -- Mumford \n               is so doped up the classroom is swimming and the examination \n               paper keeps changing shape.\n\n                                     MUMFORD (V.O.)\n                         All that fun eventually had an impact \n                         on the work I was doing. I figured, \n                         what the hell, it was only college, \n                         after all. I'd straighten up when I \n                         went out in the real world...\n\n               INT. OFFICE BUILDING CORRIDOR - NIGHT\n\n               TIGHT ON SEVERAL AMPHETAMINE CAPSULES being dumped into \n               Mumford's palm over a water fountain. They disappear toward \n               camera as we dip down toward the stream of water.\n\n                                     MUMFORD (V.O.)\n                         I didn't want to jump into my career \n                         right out of college. And since I \n                         had no career, that turned out to be \n                         not much of a problem...\n\n               MUMFORD'S POV lifts from the fountain and turns to the \n               endless, deserted corridor of the huge building. We begin \n               TRACKING DOWN the hall, checking out the various doorways. A \n               Cleaning Crew appears far up ahead.\n\n                                     MUMFORD (V.O.)\n                         I had a series of challenging jobs \n                         over the next few years...\n\n               EXT. ALLEY - DAY\n\n               We PAN from the back of a garbage truck to a mess of garbage \n               containers, and MOVE TOWARD THEM.\n\n               INT. GAS STATION - NIGHT\n\n               TIGHT ON TWO LINES of cocaine. We DIP TOWARD THEM, then UP \n               AGAIN and they're gone. PAN to REVEAL we're in a closet off \n               the brightly-lit office of an all-night gas station. A PATRON \n               is waiting impatiently out by the pumps.\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n               BACK TO PRESENT. Skip watches Mumford intently.\n\n                                     MUMFORD\n                         ...pizza delivery, pipe fitting, \n                         pest control... lots of jobs that \n                         started with the letter \"p\". For \n                         some reason, I kept losing these \n                         jobs.\n                              (takes a swig of beer)\n                         The only mind-altering substance I \n                         never had a problem with was alcohol. \n                         I never got drunk. I didn't like the \n                         feeling. But really, when you're as \n                         fucked up as I was... big deal.\n\n               Mumford stands up and stretches, then sits on the railing \n               facing Skip.\n\n                                     MUMFORD\n                         Eventually, doing all these different \n                         jobs, I noticed something. For some \n                         reason, probably because I was too \n                         stoned to talk, everywhere I went --\n\n               INT./EXT. SERIES OF SHOTS-- TALKING HEADS\n\n               We see various CO-WORKERS from Mumford's jobs. The \n               environments are radically different, but the activity is \n               always the same -- the Co-Worker in question is pouring his \n               heart out to camera.\n\n                                     MUMFORD (V.O.)\n                         -- people would talk to me, tell me \n                         everything... their stories, their \n                         problems, their innermost thoughts. \n                         Sometimes they'd pretend they needed \n                         advice, but mostly people just wanted \n                         someone to listen.\n\n               INT. CRAWLSPACE UNDER HOUSE - DAY\n\n               MUMFORD'S MOVING POV as he crawls into the darkness, an \n               insecticide sprayer ahead of him. He pushes at a cinderblock --\n\n                                     MUMFORD (V.O.)\n                         Anyway, one day I was spraying for \n                         termites when I had a vision --\n\n               The cinderblock tips over and a swarm of scary-looking spiders \n               comes rushing out toward camera.\n\n                                     MUMFORD (V.O.)\n                         -- it was time to put my college \n                         degree to work and get a job with a \n                         desk.\n\n                                                              SMASH CUT TO:\n\n               INT. GOVERNMENT OFFICES - DAY\n\n               FROM BEHIND A DESK in the middle of a huge sea of desks.\n\n                                     MUMFORD (V.O.)\n                         I took the civil service exam and \n                         found myself working at the Internal \n                         Revenue Service, District 14, Central \n                         Administrative Office. I started off \n                         as a general records clerk...\n\n               SERIES OF SHOTS: computer records scrolling rapidly, paper \n               files being pulled, documents being routed.\n\n                                     MUMFORD (V.O.)\n                         I guess the standards weren't too \n                         high there, because my superiors got \n                         excited and pushed me to take the \n                         advancement tests...\n\n               INT. YMCA GYM - NIGHT\n\n               An intense basketball game. The ball zips from behind camera \n               (Mumford) to an older guy, MUMFORD'S SUPERVISOR, under the \n               basket; he lays it in easily, then comes over to high-five.\n\n                                     MUMFORD (V.O.)\n                         One guy in particular thought I should \n                         be a Revenue Officer. There was more \n                         money to be made as your \n                         classification went up. Which had a \n                         lot of appeal to me...\n\n               INT. KITCHEN TABLE, MUMFORD'S CITY APARTMENT (PAST) - NIGHT\n\n               A COCAINE MILL is loaded with white chunks and screwed shut \n               in MUMFORD'S POV; the steady grinding begins. Spread across \n               the messy kitchen table is the regular user's paraphernalia.\n\n                                     MUMFORD (V.O.)\n                         ...since, even though I was certain \n                         I could stop anytime I wanted, I had \n                         developed a real affection for \n                         cocaine. It was my favorite hobby I \n                         had ever had.\n\n               INT. INTERNAL REVENUE SERVICE OFFICES - DAY\n\n               MUMFORD'S POV SHIFTS around the office. First, he's looking \n               at an irate TAXPAYER yelling across a desk at a REVENUE \n               OFFICER, who remains unruffled --\n\n                                     MUMFORD (V.O.)\n                         But I sure didn't want to be a Revenue \n                         Officer, where you were face to face \n                         abusing -- and getting abused -- all \n                         day long...\n\n               His POV PANS with a couple of intense COLLECTION AGENTS who \n               pass behind the first scene on their way out of the offices.\n\n                                     MUMFORD (V.O.)\n                         ...And being a Collection Agent was \n                         definitely not in my genetic make-\n                         up...\n\n               His POV STOPS, letting the Collection Agents go, on another \n               fellow, with the disreputable, cocksure demeanor of a private \n               dick, who is lolling near the water cooler, watching the \n               altercation with amusement. He is GREGORY, an IRS \n               INVESTIGATOR.\n\n                                     MUMFORD (V.O.)\n                         But there was one job that looked \n                         like it might be fun -- Investigator.\n\n                                     SKIP (V.O.)\n                         Are you telling me your last job \n                         before becoming a psychologist was --\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n               BACK TO PRESENT. Skip is leaning intensely toward Mumford.\n\n                                     SKIP\n                         -- an investigator for the Internal \n                         Revenue Service?\n\n                                     MUMFORD\n                         Everybody has a story, Skip.\n\n                                     SKIP\n                         Sounds like you have several.\n\n                                     MUMFORD\n                         What it felt like was... a series of \n                         separate, unconnected lives -- \n                         hillbilly kid, wrecked college boy, \n                         garbage man, civil service guy...\n                              (Yul Brynner accent)\n                         ...et cetera... et cetera. Every \n                         time I'd leave a life, it felt good. \n                         Whatever problems I was having were \n                         suddenly gone. I had no friends and \n                         I didn't talk to my family. The only \n                         constant, stabilizing force in my \n                         life was... drugs.\n\n                                     SKIP\n                         An IRS investigator with a drug \n                         problem?\n\n                                     MUMFORD\n                         It wasn't the best situation.\n\n                                     SKIP\n                         Did you carry a gun?\n\n                                     MUMFORD\n                         Didn't need one. We didn't even need \n                         a warrant for most of the shit we \n                         did. Man, the IRS... we could go in \n                         your bank account, your credit \n                         cards... hell, we used to go into \n                         doctors' files and get all the juicy \n                         details. Nobody wants to argue with \n                         the IRS.\n\n               EXT. ALLEY, REAR OF DRY CLEANING FACILITY - MAGIC\n\n               MOVING POV as Mumford follows GREGORY down the gloomy alley \n               to a corner where they can spy at the scene beyond.\n\n                                     MUMFORD (V.O.)\n                         I got teamed with one of the top \n                         guys, a fanatic named Gregory. He \n                         always got his man, whether they \n                         deserved it or not. He was a \"closer\" \n                         and everybody admired that...\n\n               WHAT THEY SEE: The DRY CLEANING BOSS, a Middle-Eastern fellow, \n               is standing at the back door of his place paying his Asian \n               employees in cash as they leave.\n\n                                     MUMFORD (V.O.)\n                         He'd make the case and the Collection \n                         guys would come in and clean up. Our \n                         specialty was... sleazy skulking...\n\n               Gregory turns to look at camera (Mumford) with a devilish \n               grin.\n\n                                     MUMFORD (V.O.)\n                         We were a good team. I was a dope \n                         addict and Gregory was insane.\n\n               INT. GREGORY'S HOUSE, CITY STREET - NIGHT\n\n               MUMFORD'S POV as he supports a drunken Gregory as they stagger \n               down the sidewalk to a row house. Holding Gregory up on the \n               other side, is CANDY, Gregory's pretty wife. They wrangle \n               Gregory up the front steps. Gregory stumbles inside and \n               Mumford retreats down the steps, his eyes still on the front \n               door. Candy appears there and stares down at Mumford, who \n               stops where he is.\n\n                                     MUMFORD (V.O.)\n                         Of course, him being insane didn't \n                         make it all right that I fell in \n                         love with his wife.\n\n                                     SKIP (V.O.)\n                         Holy shit!\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n               Mumford settles back in his chair as Skip shakes his head, \n               astounded.\n\n                                     MUMFORD\n                              (announcer-like)\n                         \"Get to know your therapist.\"\n\n                                     SKIP\n                         You were messed up, man.\n\n                                     MUMFORD\n                              (dry)\n                         But look at me now...\n\n                                     SKIP\n                         Hey, you've done good. Look at \n                         yourself... you've cleaned up, you've \n                         got a career --\n\n               Skip stops, remembers the truth, realizes. Mumford smiles.\n\n                                     SKIP\n                         At least you pulled yourself out...\n\n                                     MUMFORD\n                         Things got a lot worse.\n\n                                     SKIP\n                         You and Candy...?\n\n               INT. BEDROOM, MUMFORD'S CITY APARTMENT - DAY\n\n               MUMFORD'S POV from his bed. Candy finishes dressing across \n               the room. She looks at camera, her face full of the pain of \n               leaving.\n\n               EXT. FIRESCAPE/ROOF, BUILDING IN CITY - DAY\n\n               MOVING POV as Mumford follows Gregory up the ladder and onto \n               the roof of this old building in a rundown industrial \n               neighborhood.\n\n                                     MUMFORD (V.O.)\n                         The way the District Managers got \n                         ahead and won their bonuses was by \n                         generating maximum payments. That \n                         meant the revenue officers had to \n                         use all their \"collection tools\" -- \n                         seizures, liens, levies -- even if a \n                         more reasonable compromise could \n                         have been worked out. The best way \n                         to reduce resistance from the \n                         taxpayers was to build a convincing \n                         case -- whether there'd actually \n                         been a violation or not...\n\n               Mumford follows Gregory, crawling, to the edge of the roof \n               and looks down on a building one block over. It is a small \n               furniture factory. Employees are eating their lunches on the \n               loading dock.\n\n                                     MUMFORD (V.O.)\n                         That's where we came in. Our DM was \n                         a particular sonuvabitch, and he \n                         knew just how to get Gregory crazy.\n\n               INT. ETHNIC RESTAURANT - NIGHT\n\n               MUMFORD'S POV takes in his ATTRACTIVE DATE next to him, then \n               PANS TO Candy and Gregory across the table. Everybody's \n               laughing. Candy flashes Mumford a momentary special look. \n               MUMFORD'S POV guiltily PANS TO Gregory. Did he see it?\n\n                                     MUMFORD (V.O.)\n                         So several things were working on \n                         Gregory when we started building a \n                         case against a furniture maker named \n                         Edmond Worrell...\n\n               EXT. PARKING LOT, FURNITURE FACTORY - MAGIC\n\n               BINOCULAR VIEW of EDMOND WORRELL and MRS. WORRELL as they \n               get in a Cadillac at the end of a workday.\n\n                                     MUMFORD (V.O.)\n                         ...and his family.\n\n               INT. BUSINESS OFFICE, WORRELL FURNITURE FACTORY - NIGHT\n\n               Lit by powerful flashlights, Gregory and Mumford attack the \n               files of the company, both in cabinets and on computer.\n\n                                     MUMFORD (V.O.)\n                         Gregory was acting more and more \n                         irrational. We started doing things \n                         that were over the line even for the \n                         IRS. When I look back on it now, I'm \n                         sure Gregory must have known about \n                         Candy and me. On our team, I had \n                         become...\n\n               INT. MEN'S ROOM, WORRELL FURNITURE FACTORY - NIGHT\n\n               EXTREME CLOSE-UP A LINE OF COCAINE on the top of a toilet \n               tank as it is sucked out of sight.\n\n                                     MUMFORD (V.O.)\n                         ...the responsible one.\n\n               INT. BEDROOM, MUMFORD'S CITY APARTMENT - DAY\n\n               MUMFORD'S POV IS A BLURRY SHAPE until Candy moves up and \n               away, her face sweaty and aroused, torso naked. She's on top \n               of Mumford.\n\n               INT. GOVERNMENT CAR - DAY\n\n               Mumford's POV slides into the passenger seat. Gregory is \n               already sitting in the driver's seat. He stares at Mumford a \n               long time.\n\n               INT. CORRIDOR, SHABBY OFFICE BUILDING - DAY\n\n               Mumford is following Gregory and REVENUE OFFICER MCLURE down \n               the hall. They reach a door with the painted sign: \"SAMUEL \n               GORBECK, C.P.A.\"\n\n                                     MUMFORD (V.O.)\n                         Sometimes when a case didn't work \n                         out right, Gregory and this Revenue \n                         Officer named McLure would put the \n                         squeeze on the subject's accountant...\n\n               As they start to enter, SOFT CUT TO:\n\n               INT. GORBECK'S INNER OFFICE - DAY\n\n               GORBECK listens, intimidated by McLure, who sits on the \n               accountant's desk, and Gregory, who is moving around the \n               office -- snooping.\n\n                                     MUMFORD (V.O.)\n                         There aren't many accountants who \n                         don't have something to worry about \n                         with the Service...\n\n               INT. IRS OFFICES - DAY\n\n               Edmond Worrell, his wife, his adult SON and DAUGHTER, \n               WORRELL'S LAWYER, and, finally, the accountant Gorbeck are \n               ushered toward a conference room by McLure, Gregory and some \n               other IRS types. Gorbeck sneaks a nervous look at Mumford. \n               Gregory, who now appears slightly mad, motions for Mumford \n               to join them.\n\n                                     MUMFORD (V.O.)\n                         The parties met repeatedly over a \n                         period of months. The IRS offered to \n                         settle for a sizable but, they said, \n                         fair amount. Worrell said he'd done \n                         nothing wrong and threatened to fight \n                         it all the way to Washington. He \n                         seemed pretty strong. I was secretly \n                         pulling for him. McLure and the \n                         District Manager stepped up the \n                         pressure.\n\n               EXT. PARKING LOT, WORRELL FURNITURE FACTORY - DAY\n\n               MOVING POV OUT THE WINDSHIELD of Gregory's government car as \n               it comes speeding into the parking lot. There are two flashing \n               Squad Cars and an Ambulance at the entrance. As Gregory's \n               car hits a speedbump, the IMAGE BEGINS TO SLOW DOWN --\n\n                                     MUMFORD (V.O.)\n                         What none of us down at the Service \n                         knew was that Edmond Worrell had a \n                         story too... Worrell's was that he'd \n                         been fighting chronic depression for \n                         thirty years. Under the heat of the \n                         investigation, he fell off his \n                         medication. One Tuesday morning, he \n                         went down to the factory early, wrote \n                         his family a letter, then used the \n                         9mm automatic they kept there to \n                         kill himself... The DM dropped the \n                         case that day and started proceedings \n                         to get rid of Gregory...\n\n               The IMAGE HAS SLOWED TO A STILL. It now DISSOLVES TO:\n\n               EXT. GREGORY'S HOUSE, CITY STREET - NIGHT\n\n               Mumford's POV as he comes up the steps. The front door opens \n               before he gets there. Candy, her face bruised, her eyes red, \n               comes into view, she has a suitcase in hand.\n\n                                     MUMFORD (V.O.)\n                         Gregory went home drunk, beat up \n                         Candy and went out to drink some \n                         more. Candy told me she didn't want \n                         to see me again. She hated us both \n                         and she was leaving us both... It \n                         made perfect sense to me. I felt the \n                         same way...\n\n               INT. BEDROOM, MUMFORD'S CITY APARTMENT - NIGHT\n\n               Mumford is frantically, futilely looking for an imagined \n               drug stash. He's ransacked the place and is now throwing the \n               clothes out of a drawer.\n\n               INT. BATHROOM, MUMFORD'S CITY APARTMENT - NIGHT\n\n               Mumford looks desperately through the pill bottles and \n               detritus in his squalid medicine cabinet.\n\n                                     MUMFORD (V.O.)\n                         ...In fact, I was jealous of Candy. \n                         I wanted to leave too, just like \n                         her... get as far away from --\n\n               Giving up, Mumford slams the medicine cabinet shut and FOR \n               THE FIRST TIME SINCE HIS STORY BEGAN, WE SEE MUMFORD in his \n               previous incarnation. And this is probably as bad as he ever \n               looked. He stares at his image in the mirror.\n\n                                     MUMFORD (V.O.)\n                         -- me... as possible.\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n               Skip is staring at Mumford. Empty beer bottles are lined up \n               on the porch railing.\n\n                                     SKIP\n                         And so you did...\n\n               Mumford nods.\n\n                                     SKIP\n                         And the drugs?\n\n                                     MUMFORD\n                         Harder than I thought. Took me three \n                         tries. But I was highly motivated -- \n                         figured there was no point in leaving \n                         me and taking that along. After two \n                         bomb-outs, I found a place in the \n                         desert...\n\n               INT. DESERT DRUG REHAB CENTER - SUNRISE\n\n               A venetian blind is raised, revealing sunrise over a desert \n               landscape.\n\n                                     MUMFORD (V.O.)\n                         The joint wasn't fancy -- it was run \n                         by an order of monks -- but it worked. \n                         When I got out of there, I was just \n                         about broke...\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n               Mumford gets up from his chair and moves toward his door.\n\n                                     MUMFORD\n                         ...which seemed perfect for starting \n                         something new. Be back.\n\n               Mumford goes inside. Skip sits listening to the night. From \n               downstairs, in Lily's apartment, he HEARS A SHOWER GO ON. \n               Mumford comes back out.\n\n                                     SKIP\n                         Somebody's taking a shower down there.\n\n                                     MUMFORD\n                         That'd be Lily.\n\n                                     SKIP\n                         I wish I could live in the shower. \n                         I'd take five a day if I had the \n                         time. I went to this spa in Germany, \n                         a sanitarium practically, up on this \n                         mountain. And the great thing -- \n                         they just kept you wet all day.\n\n                                     MUMFORD\n                         Who'd you go with?\n                              (Skip: \"alone\")\n                         That's not good.\n\n                                     SKIP\n                         How'd you do it?\n                              (Mumford is confused)\n                         The new you.\n\n                                     MUMFORD\n                         You know how easy it is. A kid can \n                         manage it if he wants a fake I.D. \n                         You can do practically the whole \n                         deal at your local Kinko's. The only \n                         variable is how much pride you take \n                         in the product.\n\n                                     SKIP\n                         I know it starts with a birth \n                         certificate...\n\n                                     MUMFORD\n                         All new people start with that...\n\n               INT. ANONYMOUS WORK ROOM - DAY\n\n               ON A COMPUTER SCREEN an elaborate graphics program is creating \n               the filigreed border of a birth certificate that already \n               bears the official-looking designs of \"Green County, State \n               of West Virginia\".\n\n                                     MUMFORD (V.O.)\n                         With desktop publishing, you don't \n                         have to deal with printers, supply \n                         houses, or pesky government agencies. \n                         Eventually you do have to get your \n                         hands on a typewriter. Ever seen one \n                         of those, Skip?\n\n               As the border is completed, we PUSH IN and DISSOLVE THROUGH \n               TO:\n\n               SURFACE OF A DESK, with an electric Smith-Corona typewriter \n               (late '50's vintage). EXTREME CLOSE-UP of the keys hammering \n               out individual letters and numbers: date, hospital, attending \n               physician.\n\n                                     SKIP (V.O.)\n                              (playing along)\n                         Is that like a mimeograph?... What \n                         about the name?\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n               Mumford looks at Skip.\n\n                                     MUMFORD\n                         What about it?\n\n                                     SKIP\n                         \"Mumford\"... I mean, why pick the \n                         name of the town you were going to?\n\n                                     MUMFORD\n                         Oh. You got it backwards. I already \n                         had the name when I started looking \n                         for somewhere to settle. When I saw \n                         this town on a map, I thought maybe \n                         it was a sign. See...\n\n               INT. ANONYMOUS WORK ROOM - DAY\n\n               The typewriter is just pounding out: MICHAEL OLIVER MUM-F-O-\n               R-D.\n\n                                     MUMFORD (V.O.)\n                         ...Mickey Mumford was in Miss Rice's \n                         kindergarten class with me. He was \n                         killed with his parents in a wreck \n                         on their way back from a Steelers \n                         game. He was only six years old, \n                         which is a real plus, so there's a \n                         birth certificate if anyone checks -- \n                         but not much else. They died in \n                         Pennsylvania, so there's no death \n                         certificate in West Virginia... that's \n                         also good.\n\n               ON A KITCHEN TABLE, the new birth certificate, now filled \n               out for Michael Mumford, is carefully lifted from a shallow \n               bowl of light tea (the tea bags are nearby). The paper has \n               taken on an aged, sepia look. CUT TO:\n\n               A STACK OF BOOKS. The ones on top are lifted away. The bottom \n               book is opened to reveal the birth certificate. It has been \n               folded in an official way. Now Mumford unfolds it, then \n               refolds it differently -- with its smudges and creases, it's \n               starting to look old.\n\n                                     SKIP (V.O.)\n                         And a birth certificate is enough?\n\n                                     MUMFORD (V.O.)\n                         Everything flows from that, and what \n                         doesn't... can be easily purchased.\n\n               SERIES OF SHOTS of Mumford's DOCUMENTATION PILING UP. A post \n               office box is emptied, official-looking correspondence is \n               opened, the bounty is laid out for perusal: Social Security \n               card, driver's license, college and graduate school diplomas, \n               license and accreditation to operate as a therapist.\n\n                                     MUMFORD (V.O.)\n                         Of course, my IRS training made it \n                         easier. Once you've done that, there's \n                         not much data you can't access and \n                         use any way you want.\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n                                     MUMFORD\n                         In a free society, you are who you \n                         say you are.\n                              (smiling)\n                         People should remember that before \n                         they go around knocking this country.\n                              (he gets up)\n                         Skip, all this beer's got me sleepy.\n\n               Skip looks upset.\n\n                                     SKIP\n                         But you studied psychology, right? \n                         You did the training and just never \n                         got the degree?\n\n                                     MUMFORD\n                         No... no training.\n\n                                     SKIP\n                              (hopeful)\n                         Psych major?\n\n                                     MUMFORD\n                         English Lit.\n\n                                     SKIP\n                         Jeez, man. But you're good at it!\n\n                                     MUMFORD\n                         I understand what it's like to want \n                         to leave a problem behind. That's \n                         all most people are looking to do.\n                              (shrugs)\n                         Mainly, I listen.\n\n               He heads inside.\n\n                                     SKIP\n                         Where ya going? I've got a million \n                         questions.\n\n                                     MUMFORD\n                         See you Thursday... regular time.\n\n               Mumford goes inside. Skip nods, head spinning.\n\n               EXT. NEIGHBORHOOD STREET - SUNRISE\n\n               Mumford and Sofie are delivering newspapers in lovely first \n               light. Mumford has a canvas sack full of newspapers around \n               his neck. At each house, he consults the list in his hand, \n               then hands Sofie a rolled-up paper, which she throws -- with \n               varying success -- toward the front doors. The activity is \n               tiring for her, but she's committed.\n\n                                     SOFIE\n                         ...so we get on this incredible steam \n                         engine train that runs up into the \n                         mountains...\n                              (she tosses a paper, \n                              grunting)\n                         ...and this trip is everything it's \n                         cracked up to be... an open car, \n                         great views, the mountain air blowing \n                         through. We're sitting there, married \n                         for six years, and he says how he \n                         likes it better when I put my hair \n                         back...\n\n               Mumford hands her another paper, which she heaves with all \n               her limited strength, missing the front porch badly. Mumford, \n               who can't get enough of watching her, doesn't notice at first.\n\n                                     SOFIE\n                         That wasn't so good.\n\n               Mumford snaps out of it. He goes up on the lawn and flips \n               the paper deftly onto the porch. As they continue --\n\n                                     MUMFORD\n                         You're doing great.\n\n                                     SOFIE\n                         I don't know if I'm going to make it \n                         the whole way.\n\n                                     MUMFORD\n                         It doesn't matter. Go on.\n\n                                     SOFIE\n                         Oh... this makes me sound irrational, \n                         which is probably right, but there \n                         was something about him saying this -- \n                         it was maybe the millionth time he'd \n                         told me about some preference of \n                         his. Well, I was so... tired of it.\n                              (memories)\n                         Seems like my whole life someone's \n                         been telling me... I'm just not \n                         getting it right. Can we rest for a \n                         second?\n\n               She leans against the iron handrail on some front steps, \n               breathing hard.\n\n                                     SOFIE\n                         You're purposely making me talk while \n                         we do this...\n                              (Mumford nods)\n                         ...because you think this is good \n                         for me...\n                              (nods again)\n                         ...and you're a sadistic bastard...\n\n                                     MUMFORD\n                         Yes.\n\n                                     SOFIE\n                         ...who thinks there's nothing really \n                         wrong with me.\n\n                                     MUMFORD\n                         Oh, there's something wrong with \n                         you, all right. Especially after \n                         hearing that dream of yours, about \n                         the Roto-Rooter.\n\n               She laughs. They're playing with each other.\n\n                                     SOFIE\n                         That was really bad, wasn't it?\n\n                                     MUMFORD\n                         Disgusting.\n\n                                     SOFIE\n                         And I'll bet you can interpret the \n                         whole thing\n\n                                     MUMFORD\n                         It's pretty obvious to a trained \n                         professional.\n\n               Sofie starts walking again, taking another newspaper from \n               his sack. He points to the next house.\n\n                                     SOFIE\n                         I hate those dreams where everything \n                         means something.\n\n               Sofie heaves the paper squarely onto the porch. She turns to \n               him with pride, but when she sees the way he looks at her, \n               she glances away, uncomfortable.\n\n                                     MUMFORD\n                         Is that when you split up?\n\n                                     SOFIE\n                         No, that'd be a good story, but that \n                         was just the beginning of the end. \n                         We went on for another year or so.\n\n               Mumford hands her another paper and indicates the next house.\n\n                                     SOFIE\n                         So whose route is this?\n\n                                     MUMFORD\n                         Brady Peck's. Fourteen years old. \n                         Lives next door.\n\n                                     SOFIE\n                         And he's where?\n\n                                     MUMFORD\n                         In the capitol for Boy's Nation. \n                         Five days. Why?\n\n                                     SOFIE\n                              (heaves another paper)\n                         I'm thinking a gal could make a good \n                         living doing this. How hard could it \n                         be squeezing out some fourteen year \n                         old?\n\n                                     MUMFORD\n                         You like it?\n\n                                     SOFIE\n                         It's all right.\n\n                                     MUMFORD\n                         Then you can expect me at 5:30 \n                         tomorrow morning.\n\n                                     SOFIE\n                         And this is legitimate therapy?\n\n                                     MUMFORD\n                         Therapy? Hell no, I just don't want \n                         to do it alone.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               TIGHT ON RAPID SERIES OF IMAGES on slick, glossy magazine \n               pages: each change of image is punctuated by the AMPLIFIED \n               SNAP of the page being turned, like a gunshot. We're SO CLOSE \n               to the images we can't tell when the magazines change -- \n               from Glamour to Vogue to Us to Mademoiselle to W to Vanity \n               Fair. And it doesn't matter. Whether the images are ads or \n               fashion spreads or celebrity candids, the look is the same -- \n               jaded, hip, disinterested, apathetic, either impossibly buff \n               or anorexic, but always severely beautiful. The PAGE TURNING \n               starts at a fevered pitch and becomes even more intense. \n               Finally --\n\n                                     MUMFORD (V.O.)\n                         What is it, Nessa?\n\n               The IMAGES CONTINUE.\n\n                                     NESSA (V.O.)\n                         Isn't she amazing? That is such a \n                         wicked look.\n\n                                     MUMFORD (V.O.)\n                         What do you want me to see?\n\n                                     NESSA (V.O.)\n                         Just chill for a second. Look at \n                         this guy, it appears he's actually \n                         dead... but gorgeous.\n\n               Mumford is sitting next to Nessa on the couch. At their feet \n               is a mess of magazines. Nessa discards one and immediately \n               starts flipping through a new one beneath it. She is very \n               agitated. Mumford stands up, walks over and sits in his chair.\n\n                                     NESSA\n                         What are you doing? We're not done. \n                         I just need to find the thing...\n\n                                     MUMFORD\n                         If you don't want to have a session \n                         today, it's okay.\n\n                                     NESSA\n                         I want to have the session. I thought \n                         it would be cool if I could show you \n                         some of the things that interest me. \n                         But I guess you're not into it... \n                         which we already knew.\n\n                                     MUMFORD\n                         What happened today?\n\n                                     NESSA\n                         What are you talking about?\n\n                                     MUMFORD\n                         Was it something that happened at \n                         school?\n\n                                     NESSA\n                              (petulant)\n                         These appointments were not my idea, \n                         remember.\n\n                                     MUMFORD\n                         True. Should we stop them?\n\n               A look of panic crosses Nessa's face, but she instantly hides \n               it, busily taking out cigarette and lighter, which she doesn't \n               use. Instead, she lies down on the couch, balancing the closed \n               magazine on her chest.\n\n                                     NESSA\n                         I don't think you know what you're \n                         talking about.\n\n                                     MUMFORD\n                         Uh-huh.\n\n                                     NESSA\n                         This shrink school you went to... \n                         did you hear about it on an \n                         infomercial?\n\n               Mumford waits. Nessa refers to the magazine beneath her chin.\n\n                                     NESSA\n                         I want to live in the world these \n                         people are in. No one ever says \n                         anything in there, have you noticed? \n                         So they're very cool. Like they're \n                         all really deep. It's when people \n                         start talking that everything goes \n                         to shit.\n\n               Nessa suddenly seems on the edge of tears, but beats it back.\n\n                                     NESSA\n                         There's this kid at school... Martin \n                         Brockett. He has some gigantic idea \n                         of himself that no one else shares. \n                         You wouldn't believe the crap he \n                         lays on me... Who appointed him my \n                         spiritual leader? If he has everything \n                         so figured out how come his best \n                         friend is a .22 rifle? And why's he \n                         spend all his time chasing after me? \n                         Probably thinks I'm gonna give him a \n                         hummer...\n\n                                     MUMFORD\n                         Do you think that's what he wants?\n\n                                     NESSA\n                              (after a beat)\n                         No. I don't know what he wants. But \n                         I know I don't like being watched. \n                         Nobody's ever paid any attention to \n                         what I did, and I liked it just fine. \n                         Where does he get off telling me I \n                         disrespect myself?\n                              (a beat)\n                         Fuck him. Look in a mirror, bozo.\n\n               EXT. LILY'S CAFÉ, MAIN STREET - DAY\n\n               Mumford crosses the street from his office. A huge bus with \n               \"APPLEJACK TOURS\" on the sides, is disgorging its passengers, \n               a large group of elderly JAPANESE WOMEN, all of whom file \n               neatly into Lily's Café. Lily stands on the sidewalk outside \n               greeting them merrily.\n\n                                     MUMFORD\n                         What's the deal?\n\n               Lily continues her welcomes, but points out a hand-lettered \n               sign in her front window -- \"Closed for Lunch. See you \n               tomorrow.\"\n\n                                     LILY\n                         They come through a few times each \n                         year.\n                              (greeting one cheerily)\n                         Hello, Mrs. Saito, good to see you \n                         again!\n                              (back to Mumford)\n                         It's a tour.\n\n                                     MUMFORD\n                         Where am I supposed to eat?\n\n                                     LILY\n                         You're on your own today, honey.\n\n               Mumford's attention is suddenly drawn to something across \n               the street. He glances thoughtfully at Lily for a moment, \n               then back out there.\n\n               WHAT HE SEES: Skip is once again zipping down the street on \n               his skateboard in the midst of traffic. He has not noticed \n               Mumford.\n\n                                     MUMFORD (O.S.)\n                         Hey, Skip!\n\n               Skip looks over, then immediately changes course toward them, \n               barely checking the surrounding traffic. He is extraordinarily \n               skillful. When he gets to the curb, he pulls a snazzy board-\n               flipping maneuver to dismount and come up on the sidewalk. \n               Some of the Japanese matrons react with delight.\n\n                                     SKIP\n                         Doc.\n\n               Skip notices the tour members filing by, but is immediately \n               distracted by the presence of Lily, who's a little excited \n               to meet the local celebrity.\n\n                                     MUMFORD\n                         Lily, I want you to meet Skip. Skip, \n                         Lily.\n\n                                     LILY\n                         It's a pleasure to meet you.\n\n                                     SKIP\n                              (flustered)\n                         Yeah... me you, too... I was at your \n                         house...\n\n                                     LILY\n                         Oh?\n\n                                     SKIP\n                         Upstairs, with Doc... Yeah, it's \n                         very nice... I heard your shower.\n\n               Skip can't believe what he just said. Neither can the other \n               two, actually. Mumford can't stop himself from laughing, but \n               he cuts it off fast. Lily blushes, but Skip's agitation has \n               charmed her. Something's happening here.\n\n                                     LILY\n                         I've seen you going by on your board, \n                         but I didn't realize -- you're so \n                         young... to be so...\n\n                                     SKIP\n                         What?\n\n                                     MUMFORD\n                         ...so rich?\n\n                                     LILY\n                              (gives him a look)\n                         ...so accomplished.\n\n                                     SKIP\n                         I may be young, but Doc can tell \n                         you, I'm very immature.\n\n               He's making a joke and it represents quite a recovery. They're \n               all relieved. Then there's an awkward silence. Skip watches \n               the last of the tour enter the restaurant.\n\n                                     SKIP\n                         So, is this like a Japanese \n                         restaurant?\n\n                                     LILY\n                         I'd better get in there.\n\n                                     SKIP\n                         That's a lot of people all at once.\n\n                                     LILY\n                         It's okay. They pre-order. There's a \n                         choice of three entrees.\n\n                                     SKIP\n                         What are they?\n\n               Lily gives him a careful look: Is he really interested? \n               There's something about him...\n\n                                     LILY\n                         Meat loaf, turkey quesadillas, or \n                         salad nicoise.\n\n                                     SKIP\n                         Salad nicoise? I love salad nicoise.\n\n                                     LILY\n                              (giggling)\n                         You do?\n\n                                     SKIP\n                         Yeah.\n\n                                     LILY\n                         Well, come on in.\n\n               She motions him in and starts to follow. Mumford makes a \n               \"what about me?\" sound. Lily, grinning, just points to the \n               sign and leaves Mumford standing on the sidewalk.\n\n                                     DELBANCO (O.S.)\n                         Dr. Mumford.\n\n               Mumford turns to find Dr. Delbanco and Phyllis Sheeler, the \n               shrinks Lionel had conferred with, standing nearby. It takes \n               a moment for Mumford to remember Delbanco. Finally, shaking \n               hands --\n\n                                     MUMFORD\n                         Dr. Delbanco. It's nice to see you \n                         again.\n\n                                     DELBANCO\n                         I don't think you know Dr. Sheeler. \n                         She's the other therapist here in \n                         town.\n\n                                     MUMFORD\n                              (shaking her hand)\n                         Of course... I've heard great things \n                         about you.\n\n                                     SHEELER\n                         Thank you.\n\n                                     DELBANCO\n                         You never got back to me.\n                              (Mumford doesn't \n                              understand)\n                         ...I called to say we'd like to take \n                         you out for a meal?... Kind of a \n                         professional welcome.\n\n               Mumford makes a show of remembering.\n\n                                     MUMFORD\n                         Forgive me, please. What a gracious \n                         thought. We must do that.\n\n                                     SHEELER\n                         When?\n\n                                     MUMFORD\n                         Why don't I call you when I've got \n                         my calendar in front of me?\n\n                                     DELBANCO\n                         What are you doing for lunch?\n\n                                     MUMFORD\n                         Right now?\n\n               The other two nod in unison. Mumford considers, trapped.\n\n               INT. THE LANTERN AND THE LAMB RESTAURANT - DAY\n\n               The town's upscale dining spot. Mumford, Delbanco and Sheeler \n               are in a red leather booth. Sheeler listens with rapt, \n               admiring attention as Delbanco speaks --\n\n                                     DELBANCO\n                         ...annihilation anxieties engendered \n                         by bad experiences with a depriving \n                         mother... but no one can escape the \n                         fear of death. It is, as Henry James \n                         put it, \"the worm at the core.\" Try \n                         as we may to forget or ignore our \n                         mortality, James said --\n                              (theatrically)\n                         -- \"the skull will grin in at the \n                         banquet.\"\n\n               Mumford nods appreciatively. (He really is an extraordinary \n               listener.) Delbanco catches his own vanity in Sheeler's \n               adoring gaze and becomes self-conscious --\n\n                                     DELBANCO\n                         I've run on. Forgive me. We're here \n                         to talk about you.\n\n                                     MUMFORD\n                         Are we?\n\n                                     SHEELER\n                              (covering)\n                         What Ernest means, I think, is we're \n                         very interested in other \n                         methodology... different kinds of \n                         training. We're great believers in \n                         learning from each other. I've learned \n                         so much from Ern -- Dr. Delbanco...\n\n                                     DELBANCO\n                         ...And I from Phyllis.\n\n                                     SHEELER\n                              (back to a previous \n                              thread)\n                         So... the University of Kentucky. \n                         Who runs the program down there?\n\n                                     MUMFORD\n                         My mentor was an amazing teacher \n                         named Benton Mandlebaum. Died quite \n                         tragically in the collapse of a \n                         gazebo.\n\n                                     DELBANCO\n                         I think I've heard of him... a \n                         disciple of Rothberg, wasn't he?\n\n               Mumford's response, and all that follow, is calm and pleasant.\n\n                                     MUMFORD\n                         It's possible. I don't know about \n                         that.\n\n                                     SHEELER\n                         I suppose your extended training was \n                         at an institution in that area?\n\n                                     MUMFORD\n                         Lots of institutions. My graduate \n                         advisor believed we should experience \n                         as many environments as possible -- \n                         prisons, clinics, half-way houses. \n                         For a while I was chief therapist in \n                         a shopping mall. Had a little spot \n                         next to the yogurt place.\n\n                                     DELBANCO\n                         Interesting approach. What was his \n                         name?\n\n                                     MUMFORD\n                         Dorothy Fowler. Fantastic woman. She \n                         passed last year in a train wreck. \n                         Damned Amtrak.\n\n               Delbanco and Sheeler exchange a look. Sheeler adopts a \n               \"casual\" tone --\n\n                                     SHEELER\n                         I trained in the east, myself -- \n                         Cornell -- and I don't care what \n                         anyone says, there really are regional \n                         differences. I found the state \n                         certification exams out here quite \n                         harrowing... Did you?\n\n                                     MUMFORD\n                         Oh, yeah, very tough. But I guess \n                         that's good... to keep out the quacks.\n\n                                     SHEELER\n                         Which examiner did you have? I \n                         probably know him.\n\n                                     MUMFORD\n                         Wallace Franklin... from Greensburg.\n\n               A dark look comes over Sheeler's face for a moment.\n\n                                     SHEELER\n                         That was a terrible thing.\n\n                                     MUMFORD\n                              (agrees)\n                         I don't even know why hang-gliding \n                         is considered a legitimate sport.\n\n                                     DELBANCO\n                              (back on track)\n                         We're interested in any new therapies. \n                         How would you characterize your \n                         approach?\n\n                                     MUMFORD\n                         My approach?\n\n                                     SHEELER\n                         Yes... your particular approach.\n\n                                     MUMFORD\n                         I don't have one really. Most of the \n                         time I'm faking it. See, I think \n                         there's not much that can be done \n                         about most problems... they're too \n                         complicated, too deep-rooted by the \n                         time I hear about them. The most I \n                         can do, usually, is look and listen \n                         real closely, try to catch some \n                         glimpse of the secret life everybody's \n                         got. If I can get a sense of that, \n                         well then, maybe... just maybe, I \n                         can help them out a little.\n\n               Mumford sits back, considering the couple across the table. \n               His gaze is so crystalline that, after a moment, they become \n               uncomfortable and steal a glance at each other. Finally --\n\n                                     DELBANCO\n                         I see.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               CLOSE ON Althea Brockett.\n\n                                     ALTHEA\n                         -- The argument had nothing to do \n                         with it.\n\n                                     MUMFORD (O.S.)\n                         I understand. I just want to know \n                         what the argument was about.\n\n                                     ALTHEA\n                              (hates to say)\n                         I had ordered some books. \"The 100 \n                         Greatest Books Ever Written.\"\n\n                                     MUMFORD (O.S.)\n                         Uh-huh. What are they?\n\n                                     ALTHEA\n                         Oh, all the great writers -- \n                         Shakespeare, Charles Dickens, Moby \n                         Dick... those people. Each is bound \n                         in genuine premium leather with 22 \n                         carat gold accents. It's a magnificent \n                         set -- and only $33.50 per volume. \n                         Right away you get Great Expectations \n                         for just $6.99.\n\n                                     MUMFORD (O.S.)\n                         One hundred books?\n\n                                     ALTHEA\n                         It's irrelevant. It had nothing to \n                         do with what happened.\n\n                                     MUMFORD (O.S.)\n                         What happened?\n\n               Althea is sitting on the couch facing Mumford. She has a \n               bulky knit cardigan sweater hugged tightly around her -- the \n               only sign that she's not completely calm.\n\n                                     ALTHEA\n                         We argued on Sunday. He went to work \n                         on Monday and stayed in the city \n                         during the week, like always. But on \n                         Thursday, when he normally comes \n                         home, he didn't. Didn't call either. \n                         Not till Saturday afternoon.\n\n                                     MUMFORD\n                         You must have been concerned.\n\n                                     ALTHEA\n                         It's happened before.\n                              (a beat)\n                         I'm shocked by how little I'm feeling. \n                         I can't understand it.\n                              (a real question --)\n                         I'll probably have a complete \n                         depressoid collapse soon, won't I?\n\n                                     MUMFORD\n                         Doubtful. What did he say?\n\n                                     ALTHEA\n                         He said he wasn't coming back. He \n                         said it wasn't working for him any \n                         more. That it hadn't \"worked for \n                         him\" for quite a while... You know \n                         what I regret the most? I'm sorry I \n                         let him make the kids take his name. \n                         He was an acquirer.\n                              (off Mumford's look)\n                         He liked to acquire things.\n\n               Mumford looks away. Althea realizes what he's thinking.\n\n                                     ALTHEA\n                         You think that has something to do \n                         with my problem? Ordering all those \n                         things?...\n\n               It hadn't occurred to Mumford, but it's an interesting \n               thought.\n\n                                     ALTHEA\n                         ...Like I was on some kind of campaign \n                         to out-acquire him...\n                              (excited now, playing \n                              it out)\n                         ...If I was just an acquisition to \n                         him, and he lost interest once he \n                         had me --\n\n               She stops, shakes her head.\n\n                                     ALTHEA\n                         That can't be it. It's too simple. \n                         And besides, I still like it. This \n                         morning I ordered a marble turtle \n                         cheese board from The Horchow \n                         Collection.\n                              (an odd look)\n                         Can I tell you something just awful? \n                         You know how people who are just \n                         assholes will sometimes look at a \n                         woman who's got problems and say, \n                         \"What she needs is a good shtupping!\"?\n\n               Mumford nods.\n\n                                     ALTHEA\n                         Well, there may be something to that. \n                         Jeremy didn't keep up his end -- Oh, \n                         what difference does it make?\n                              (suddenly)\n                         Why do I feel elated? Am I in denial? \n                         You know what it feels like?...\n\n               She glances at her watch, then starts talking fast --\n\n                                     ALTHEA\n                         I know my time's up, but I've got to \n                         get this out while I've got hold of \n                         it --\n\n                                     MUMFORD\n                         Take your time.\n\n                                     ALTHEA\n                              (no slowing down)\n                         -- When I was in high school, the \n                         thing I wanted most, when I was stuck \n                         in class, the thing I was always \n                         desperately in pursuit of -- was a \n                         hall pass. That's all I wanted. I \n                         loved moving freely around the school \n                         while everybody else was trapped in \n                         there... And that's how I feel right \n                         now... Like I have some giant, all-\n                         day hall pass.\n\n               She is beaming, but suddenly becomes self-conscious. She \n               stands up abruptly, flushed.\n\n                                     ALTHEA\n                         My god, did it just get hot in here \n                         or what?\n\n               She takes off the bulky sweater and bends to pick up her \n               purse. She is wearing a simple cotton dress that buttons up \n               the front and hugs her body. WE SEE for the first time what \n               all her other outfits have hidden: Althea has a terrific, \n               voluptuous figure.\n\n                                     ALTHEA\n                         See you next time. I'll probably be \n                         a basket case by then.\n\n               She heads toward the door to the waiting room. Mumford \n               indicates the back door.\n\n                                     MUMFORD\n                         You can go out there if you like...\n\n                                     ALTHEA\n                              (quoting Mumford)\n                         \"There's no shame in getting a little \n                         therapy\", right, Doc?\n\n               She opens the door to the waiting room, startling Henry \n               Follett, who jumps up from a chair out there, magazine still \n               in hand.\n\n               INT. WAITING ROOM, MUMFORD'S OFFICE - DAY\n\n               Follett is embarrassed to be discovered here. But that's \n               secondary to the impact Althea's current appearance -- sexy \n               body framed in the doorway -- is having on him. She's been a \n               customer in his store, but he's seeing her now as if for the \n               first time. All his libidinous buttons are being pushed. \n               Althea breezes by, oblivious to his reaction.\n\n                                     ALTHEA\n                         Hello, Mr. Follett. Have a good \n                         session. Bye, Doc.\n\n               She goes out.\n\n                                     MUMFORD\n                         Henry...\n\n               But Follett continues to stare in the direction Althea has \n               gone.\n\n               INT. LOBBY ATRIUM, PANDA MODEM WORLD HEADQUARTERS - DAY\n\n               Mumford is being escorted across the spectacular atrium by a \n               PANDA SECURITY AIDE. Her informal uniform, and all the other \n               details in the building, carry out the Panda design motif. \n               As they head down the main corridor --\n\n                                     SKIP (O.S.)\n                         Hey, Doc!\n\n               Mumford looks that way. In the distance, Skip is descending \n               from an upper level on his skateboard via a unique system of \n               ramps designed for that purpose alone. None of the hustling \n               Panda Employees in the area take any particular notice of \n               the sight.\n\n               Skip meets Mumford and his escort at the bottom of the ramp \n               with a spectacular stop.\n\n                                     SKIP\n                         Thanks, Jennifer, I'll take him from \n                         here.\n\n               The Security Aide retreats as Skip (riding slowly alongside) \n               leads Mumford into a side corridor.\n\n               INT. BOWELS OF THE BUILDING, PANDA MODEM HEADQUARTERS - DAY\n\n               SERIES OF SHOTS. Skip and Mumford move through a maze of \n               hallways with progressively less foot traffic.\n\n                                     SKIP\n                         I've never brought anyone down here \n                         before.\n\n                                     MUMFORD\n                         I'm honored.\n\n                                     SKIP\n                         Doc, there's something about what \n                         you told me the other night I can't \n                         get out of my head. It's driving me \n                         batty --\n                              (Mumford nods, waits)\n                         Why me? How did you know you could \n                         trust me?\n\n                                     MUMFORD\n                         You're completely reliable.\n\n               Skip is pleased. They approach a heavy steel door, the \n               entrance to Skip's Workshop. A VERY OLD SECURITY AIDE sits \n               at the end of the intersecting hallway, watching this area. \n               Skip shouts down there --\n\n                                     SKIP\n                         It's just me, Dino!\n\n               The old man nods, barely awake.\n\n                                     MUMFORD\n                         Skip, I've got a problem and I need \n                         some advice.\n\n                                     SKIP\n                         You want my advice? Far out!\n\n               Skip puts his hand in a scanning device in the wall. Some \n               lights blink and the heavy metal door pops open a few inches. \n               Skip has to put all his weight into opening the door. He \n               hesitates, suddenly concerned --\n\n                                     SKIP\n                         I hope nothing you're about to see \n                         will shake your faith in me.\n\n               Mumford reassures him with a look. Skip pushes the door open \n               far enough for them to enter, then pulls it closed behind \n               them.\n\n               INT. SKIP'S WORKSHOP - DAY\n\n               Mumford and Skip enter the large, windowless workspace. What \n               at first appears chaotic is, in fact, carefully organized. \n               Many different disciplines interface here:\n\n               THE BODY SECTION: The first thing one notices -- some \n               incredibly life-like, anatomically correct, \n               sculpture/mannequins -- both male and female. You half expect \n               them to breathe. From there, a full wall of forms descends \n               from store mannequins and skeletons all the way down to a \n               huge variety of inflatable sex dolls.\n\n               THE CYBER SECTION: A dizzying array of computers and screens, \n               some showing wire-form outlines of body parts in repeated \n               motion. Above them, on a huge corkboard, hundreds of computer \n               generated renderings of skin, eyes, limbs, sexual organs.\n\n               THE BODY PARTS SECTION: Medical models of teeth, eyes, lips, \n               limbs. Hundreds of porn store samples: plastic dildos, rubber \n               vaginas, sucking machines and sundry genitalia.\n\n               THE FORM-CASTING SHOP: All the machinery you need to make \n               rubber and acrylic forms of anything that can be computer \n               designed.\n\n               All these weird objects are set upon shiny, spotless, high-\n               tech work surfaces. Skip watches Mumford move about in awe, \n               picking up the odd item.\n\n                                     SKIP\n                         Pretty creepy, huh? Are you totally \n                         disgusted?\n\n                                     MUMFORD\n                              (\"no\")\n                         Skip, you're a visionary. That can \n                         be a burden.\n\n                                     SKIP\n                         This doesn't seem a little... \n                         perverse?\n\n                                     MUMFORD\n                         There are a lot of lonely people in \n                         the world. Somebody's gonna figure \n                         this out someday.\n\n                                     SKIP\n                         It's not going to be me. I'm giving \n                         it up.\n\n                                     MUMFORD\n                         Really?\n\n                                     SKIP\n                         It's all your fault. In the last 48 \n                         hours, I've completely lost interest.\n\n                                     MUMFORD\n                         What'd I do?\n\n               Skip looks at Mumford, a wide grin on his face.\n\n                                     SKIP\n                         Lily.\n\n                                     MUMFORD\n                         Lily...\n                              (gets it)\n                         ...Skip, that's great! You and Lily.\n\n                                     SKIP\n                         Oh, she doesn't know about it yet. \n                         Right now, of the two of us, I'm the \n                         only one in love. But I'm very stoked.\n\n               Skip settles in front of the Body Parts section, framed by \n               an array of limbs and sex toys. There's an assembled pelvic \n               section with upper legs lying in the clutter behind him.\n\n                                     SKIP\n                         Doc, how I can be of help to you?\n\n               Skip leans back against the table and accidentally hits a \n               button. The pelvic section begins to hump, slowly and \n               sensually, in place. It's amazingly life-like, but it makes \n               a mechanical WHIRRING SOUND. Skip fumbles to turn it off.\n\n                                     SKIP\n                         Sorry...\n\n                                     MUMFORD\n                         Wow.\n\n               Skip gets the pelvis switched off and turns back to Mumford.\n\n                                     SKIP\n                         I'm here for you, Doc.\n\n                                     MUMFORD\n                         Skip, you know that it's improper -- \n                         completely unethical -- for a licensed \n                         psychologist to carry on a romantic \n                         relationship with one of his patients?\n\n                                     SKIP\n                         I guess that makes sense.\n\n                                     MUMFORD\n                         Yes, yes it does...\n\n               Mumford sinks into silence. He begins to wander the room.\n\n                                     SKIP\n                         You've fallen in love with one of \n                         your patients?\n\n               Mumford nods. Skip is desperate to say something useful. \n               Suddenly, he has an alarming thought.\n\n                                     SKIP\n                         Doc!... It's not me, is it?\n\n                                     MUMFORD\n                         What?\n\n               Mumford understands and can't stop a laugh.\n\n                                     MUMFORD\n                         No, Skip, it's not you. But I like \n                         you a lot.\n\n               Skip is relieved. He has another thought and brightens.\n\n                                     SKIP\n                         Doc, what about this? You're not \n                         really a licensed psychologist!\n\n               Mumford turns to meet Skip's gaze. Skip realizes the \n               ramifications of what he's just said.\n\n                                     SKIP\n                         Hmm. I guess that doesn't help... I \n                         see where you're going here. It's a \n                         mess.\n\n                                     MUMFORD\n                         Yep.\n\n               INT. DR. DELBANCO'S OFFICE - DAY\n\n               Lionel is here with Delbanco and Sheeler. This time, Delbanco \n               is behind his desk, Sheeler across the room on the sofa.\n\n                                     LIONEL\n                         Don't you find it incredibly \n                         convenient that everyone who could \n                         possibly corroborate his story has \n                         recently died some exotic death?\n\n                                     DELBANCO\n                         They're neither all recent nor exotic.\n\n                                     SHEELER\n                         But they're certainly dead. And yes, \n                         personally, I find it a bit odd.\n\n                                     DELBANCO\n                         It could happen. What about his state \n                         certification exams? The records \n                         seem to be in order.\n\n               Lionel's derisive snort is so obnoxious, it's hard to bear.\n\n                                     LIONEL\n                         What's easier than hacking your way \n                         into a state computer and inserting \n                         some numbers? For all you know he \n                         never even took the exams!\n\n                                     SHEELER\n                         That's true.\n\n                                     DELBANCO\n                         I don't know that it's all that \n                         easy...\n\n                                     LIONEL\n                         Doctor, correct me if I'm wrong, but \n                         it sounds to me like you've gone for \n                         this guy's story hook, line and bull-\n                         twaddle.\n\n                                     SHEELER\n                         You do seem much more disposed toward \n                         him than I understand, Ernest. Did I \n                         miss something?\n\n                                     DELBANCO\n                              (sharply)\n                         Oh, for god's sake, Phyllis -- we \n                         have no reason to doubt the man! Are \n                         we listening to Lionel now?\n\n               Sheeler jumps, so shocked is she by his outburst, and so \n               humiliated for Lionel to witness it. Fighting tears and trying \n               to maintain her dignity, she gathers up her things and walks \n               to the door. Delbanco, immediately contrite, stands up.\n\n                                     DELBANCO\n                         Phyllis, I'm sorry. I didn't mean to \n                         shout...\n\n                                     SHEELER\n                         No, Dr. Delbanco, it is I who am \n                         sorry. Sorry to have wasted your \n                         time with such...\n\n               She breaks into tears and rushes out of the office. Delbanco \n               is left facing Lionel, who gives him exactly the look the \n               doctor least wants to see.\n\n               INT. LILY'S CAFÉ - DAY\n\n               Mumford is eating his lunch at the counter. He watches Lily \n               busily working the midday rush. She sees him grinning at \n               her, but doesn't say anything for a while. Finally, blushing --\n\n                                     LILY\n                         Stop it! He's a kid. I'm old enough \n                         to be his... older sister.\n\n               Mumford smiles, eats.\n\n               INT. ENTRY HALL, COOK HOUSE - NIGHT\n\n               Mr. Cook opens the front door to Mumford.\n\n                                     COOK\n                         Dr. Mumford. Please, come in.\n\n               Mumford comes in, reluctantly.\n\n                                     MUMFORD\n                         Hello, Mr. Cook. I was wondering if \n                         Sofie was around?\n\n                                     COOK\n                         Were you supposed to have a session?\n\n                                     MUMFORD\n                         No. It's sort of spur of the moment.\n\n               INT. LIVING ROOM, COOK HOUSE - NIGHT\n\n               Mumford follows Mr. Cook into the room. Mrs. Cook and Sofie's \n               thirtyish brother, BEN, are in there, watching television. \n               Mrs. Cook keeps knitting; Ben stands to shake Mumford's hand, \n               muting the TV with a remote.\n\n                                     COOK\n                         Look who's here. Have you met Sofie's \n                         moth--\n\n                                     MRS. COOK\n                         -- We've met.\n\n                                     COOK\n                         And our son, Ben...\n\n                                     BEN\n                              (vigorously shakes \n                              hands)\n                         This is a real honor, Doctor. Have a \n                         seat, will ya?\n\n               Mumford continues to stand.\n\n                                     MUMFORD\n                         Well, actually, I can't really... Do \n                         you think I could see Sofie?\n\n                                     BEN\n                         I insist! I've been wanting to meet \n                         you.\n\n               Mumford sits.\n\n                                     MRS. COOK\n                              (icy)\n                         Sofie's not here.\n\n               Mumford's surprised. Mr. Cook speaks with some pleasure.\n\n                                     COOK\n                         Her friend from the city came and \n                         took her out to dinner. First time \n                         in a long time she's been willing.\n\n                                     MUMFORD\n                         A friend?\n\n                                     BEN\n                         We owe that to you. She's perked up \n                         a lot since you started treating \n                         her.\n\n               Mrs. Cook gives Ben a condescending look and keeps knitting.\n\n                                     MRS. COOK\n                         What'd you want?\n\n                                     MUMFORD\n                         There's something I think we need to \n                         talk about.\n\n                                     MRS. COOK\n                         What?\n\n                                     MR. COOK\n                         Elizabeth...\n\n                                     MRS. COOK\n                         I think we have a right.\n\n                                     BEN\n                         We certainly do not.\n\n                                     MRS. COOK\n                         Keep it zipped, Ben.\n\n               Ben gives Mumford an exasperated look, but doesn't argue.\n\n                                     MR. COOK\n                         Is there something we need to know, \n                         Dr. Mumford?\n\n               Mumford is conflicted, not sure what to share with them.\n\n                                     MUMFORD\n                         Well... yes, I guess I should tell \n                         you. I don't think I'm going to be \n                         able to treat Sofie anymore.\n\n               Mr. Cook and Ben exchange an alarmed glance. Mrs. Cook \n               actually cheers up.\n\n                                     MRS. COOK\n                         Finally, some common sense...\n\n                                     MUMFORD\n                         What do you mean?\n\n                                     MRS. COOK\n                         I think you know what I mean.\n\n                                     MUMFORD\n                         No, I really don't.\n\n                                     MRS. COOK\n                         I think you do.\n\n                                     MUMFORD\n                         Why don't you tell me?\n\n                                     MRS. COOK\n                              (very calm)\n                         Why don't you go to hell? It's all a \n                         bunch of nonsense and you know it.\n\n                                     MR. COOK\n                         Elizabeth, I'm tellin' you, stop \n                         this...\n\n                                     MRS. COOK\n                              (dismissive)\n                         You're telling me? That's rich...\n\n                                     MUMFORD\n                              (standing up)\n                         I'd better go.\n\n                                     BEN\n                         Why can't you see Sofie? I know the \n                         treatment's working.\n\n               Mumford looks from Ben to Mr. Cook, who nods his agreement.\n\n                                     MUMFORD\n                         Well... you see, the problem is --\n\n                                     MRS. COOK\n                         -- the problem is you're a big fake. \n                         You haven't got a clue what's wrong \n                         with that girl.\n\n               Mumford looks at Mrs. Cook and can't stifle a laugh.\n\n                                     MUMFORD\n                         Wow. You're something.\n\n                                     MRS. COOK\n                         Take a hike, Dr. Quack!\n\n                                     MR. COOK\n                              (ignoring her now)\n                         What is the problem, Doctor?\n\n               Mumford can't take his eyes off Mrs. Cook, even as he speaks \n               to Mr. Cook.\n\n                                     MUMFORD\n                         Problem? I guess there is no \n                         problem... Uh, this friend of Sofie's, \n                         where'd he take her?\n\n                                     BEN\n                         It's she -- Roxy. Used to work with \n                         her. I think they went over to The \n                         Lantern.\n\n                                     MUMFORD\n                              (delighted)\n                         Oh, Roxy! Excellent. Roxy.\n\n               Mrs. Cook looks at him sharply. She's heard what the other \n               two have not.\n\n               EXT. SIDE STREET/ALLEY - DAY\n\n               Mumford carries a large Fed-Ex box down a side street and \n               into an alley. As he passes a secluded space created by two \n               adjacent buildings, something catches his eye.\n\n               MUMFORD'S MOVING POV: A young couple is embracing and talking \n               intimately. As they separate, we can see that it is Nessa \n               and Martin Brockett. Martin sees Mumford, but makes no sign. \n               Nessa twists to see what Martin's looking at just as the \n               view is interrupted by a wall.\n\n               Mumford walks on, mulling what he's seen.\n\n               EXT. BACK DOOR, FOLLETT'S PHARMACY - DAY\n\n               There is a locked security screen at the alley entrance to \n               the back room of the pharmacy, but the door inside is open. \n               When a YOUNG PHARMACIST appears in there, Mumford raps on \n               the metal screen.\n\n               INT. HENRY FOLLETT'S OFFICE - DAY\n\n               Follett's private space is above and at the back of his \n               drugstore. When you sit at his desk and in front of it, as \n               Follett and Mumford are doing now, you can see down into the \n               store through a floor-to-ceiling, one-way mirror.\n\n               The Fed-Ex box sits on the desk between the two men, unopened.\n\n                                     FOLLETT\n                         What is it?\n\n                                     MUMFORD\n                         It's a thought I had.\n\n                                     FOLLETT\n                         Should I open it now?\n\n               Mumford seems hesitant, but nods. Follett takes out an Exacto \n               knife and makes the first incision, but as he's about to go \n               on, Mumford suddenly reaches out and stops him.\n\n                                     MUMFORD\n                         Let me just say something here... I \n                         have no idea if this is going to \n                         help.\n\n                                     FOLLETT\n                         What exactly is it supposed to do?\n\n                                     MUMFORD\n                         You remember when I asked you about \n                         pornography --\n\n                                     FOLLETT\n                         -- I find it degrading. Maximum \n                         gynecology and minimum turn-on --\n\n                                     MUMFORD\n                         -- and you told me that. Still, \n                         there's some kind of imagery that's \n                         haunting you and, I think, getting \n                         in your way --\n\n                                     FOLLETT\n                         -- Which I don't necessarily agree.\n\n                                     MUMFORD\n                         But you did come to me.\n\n               Follett reacts. It's true, even if he keeps forgetting.\n\n                                     MUMFORD\n                         My guess is these images were burned \n                         into your brain when you were young. \n                         Maybe if we could nail down the exact \n                         fantasies that are haunting you -- \n                         maybe you could get past them... \n                         Anyway, I thought we could try an \n                         experiment.\n\n                                     FOLLETT\n                              (indicating the box)\n                         And the experiment is in here?\n\n               Mumford nods, but suddenly looks depressed, distracted.\n\n                                     MUMFORD\n                         You know what? I think this was a \n                         dumb idea...\n\n               He starts to take hold of the box.\n\n                                     MUMFORD\n                         ...I just heard myself talking and I \n                         realize I'm completely unqualified \n                         to be doing this. Let's forget the \n                         whole thing.\n\n               Follett grabs the box back.\n\n                                     FOLLETT\n                         Whoa, whoa, what are you doing? I \n                         want to know what's in here.\n\n                                     MUMFORD\n                              (pulling on the box)\n                         There's absolutely no reason to think \n                         this is going to have any impact on \n                         you. I'm embarrassed to have --\n\n               Follett stands up and grabs the box, taking sole possession. \n               Loud --\n\n                                     FOLLETT\n                         Hey! I agree with you that you don't \n                         know what you're talking about. That's \n                         what I've been saying all along. And \n                         I can guarantee you that looking at \n                         the Lost Ark or whatever you got in \n                         here is not going to mean diddly to \n                         me...\n                              (quieting down)\n                         ...but if you think I'm going to let \n                         you walk out of here without seeing \n                         what's in this box, you don't know \n                         much about Henry A. Follett.\n\n               Mumford gives up. Follett gestures to ask whether it's safe \n               to put the box on the desk; Mumford reassures him. Now, with \n               much more anticipation and ceremony than before, Follett \n               carefully cuts open the package.\n\n               THE CONTENTS OF THE BOX is revealed as Follett opens the \n               flaps. There is an inner, brown paper wrapping upon which \n               has been set a low-rent catalogue: \"METROPOLITAN COLLECTIBLES -- \n               Periodicals, Erotica, Adult Nostalgia.\" Follett lifts away \n               the wrapping --\n\n               There are perhaps a dozen men's magazines of the late fifties \n               and early sixties: Nugget, Adam, The Adam Reader, Swank, \n               Dude. Plus several cartoon collections: Sex to Sexty, Stag \n               Humor. Plus trashy adult novels of the era, with provocative \n               illustrations on the covers: Night Call Nurse, The Neighbors \n               Have No Curtains, Secretarial Sluts, etc. Finally, two video \n               tapes, both of Russ Meyer films: MUDHONEY and COMMON-LAW \n               CABIN.\n\n               We stay CLOSE ON the contents of the box as Follett's hands \n               shuffle through it, rapidly flipping through the pages. Very \n               soft-core by today's standards, the common thread is clear: \n               voluptuous, heavy-breathing sirens in tight clothes (and out \n               of them) tempting muscular, he-man drifters or libidinous \n               businessmen. A world of lusty secretaries, siren babysitters, \n               and frustrated, neglected wives. In other words, exactly the \n               erotic ambience of Follett's fantasies.\n\n               SLOW TILT UP TO FOLLETT'S FACE. He is transported, mesmerized, \n               galvanized. In fact, at this moment, as the MUSIC SWELLS, a \n               tear is rolling down his cheek. He dare not take his eyes \n               from this Holy Grail to look up at Mumford. The only thing \n               that could wreck his mood now, is --\n\n                                     YOUNG PHARMACIST (O.S.)\n                         Mr. Follett --\n\n               Follett jumps, startled from his revery. As the Young \n               Pharmacist steps tentatively into the office, Follett jams \n               everything back into the box as best he can and tries to \n               cover it.\n\n                                     FOLLETT\n                         What?! What the hell is so important \n                         I can't have five minutes --?\n\n               The Young Pharmacist is cowed and doesn't advance into the \n               room.\n\n                                     YOUNG PHARMACIST\n                         It's her, sir. You told me to get \n                         you when she came to pick up her \n                         prescription.\n\n               It takes Follett a moment to understand, but when he does, \n               his whole manner changes. He dismisses the Young Pharmacist \n               with a nod, then gives a quick, self-conscious glance to \n               Mumford.\n\n                                     FOLLETT\n                         Uh, sorry, I'm going to have to...\n                              (indicates box)\n                         ...I really appreciate what you're \n                         trying to... uh, I can't thank you \n                         enough for...\n\n                                     MUMFORD\n                         My pleasure.\n\n               Follett heads for the door, pausing briefly at a mirror to \n               check his appearance, pushing at his hair with his palm.\n\n                                     FOLLETT\n                         I'll see you on... whatever...\n\n               He hurries out. Mumford stands up to leave, but first looks \n               down through the one-way mirror.\n\n               WHAT HE SEES: Follett hurries up behind the prescription \n               counter, where Althea Brockett is waiting; once again she \n               looks quite sexy. Follett brings her prescription up and \n               begins playfully flirting. Althea is responsive. Follett \n               motions Althea down the aisle, where it's more private. He \n               comes out from behind the counter, ostensibly to show Althea \n               something on the prescription bottle. Althea leans back \n               against some shelves in the same posture as the Landlady in \n               Follett's first fantasy.\n\n               Mumford reacts, bemused.\n\n               EXT. HIKING TRAIL - DAY\n\n               Mumford and Sofie make their way slowly up the trail. Despite \n               her labored breathing, it's clear Sofie has made enormous \n               progress since we first saw her.\n\n                                     SOFIE\n                         When I was in high school we used to \n                         come up here and make out. I liked \n                         to sit on the rock and watch the sun \n                         go down.\n\n                                     MUMFORD\n                         That's what I like.\n\n                                     SOFIE\n                         Which thing?\n\n                                     MUMFORD\n                         Either one.\n\n                                     SOFIE\n                         Why'd you come to the house the other \n                         night?\n\n                                     MUMFORD\n                         I thought I had something to tell \n                         you. But it turned out I didn't.\n\n                                     SOFIE\n                         My brother said you were about to \n                         fire me.\n\n                                     MUMFORD\n                         That's one way to put it.\n\n                                     SOFIE\n                         I bet I know what changed your mind...\n                              (Mumford looks at her)\n                         ...My mother. She was so horrible, \n                         you decided you couldn't desert me.\n\n                                     MUMFORD\n                         I thought only action movies had \n                         villains like that.\n\n               Sofie gestures ahead.\n\n                                     SOFIE\n                         That's the cut-off, isn't it?\n                              (Mumford nods)\n                         I know why you were going to quit \n                         seeing me.\n\n               Mumford slows at this. Sofie heads off the trail into the \n               woods.\n\n               EXT. BIG ROCK LOOKOUT POINT - DAY\n\n               Sofie appears first, but she waits for Mumford before she \n               steps tentatively onto the rock. Mumford takes firm hold of \n               her and leads her to a spot where she can securely settle \n               herself.\n\n                                     SOFIE\n                         You feel like a fake, an imposter...\n\n               Mumford looks up, sharply.\n\n                                     SOFIE\n                         ...as if maybe you don't know what \n                         you're doing.\n\n               She puts a hand on his arm.\n\n                                     SOFIE\n                         Everybody feels that way sometimes... \n                         like we're not who we're supposed to \n                         be. But I have to tell you, Dr. \n                         Mumford --\n\n               He winces at her formality.\n\n                                     SOFIE\n                         -- you've been a tremendous help to \n                         me.\n\n                                     MUMFORD\n                         Yeah?\n\n                                     SOFIE\n                         I can't tell you how much I admire \n                         you. You have a wonderful way with \n                         people. And you're very insightful. \n                         I feel like you've seen me clearly... \n                         I never used to admit what a horrible \n                         person my mother was. You've made \n                         that possible for me.\n\n                                     MUMFORD\n                         That's... good?\n\n                                     SOFIE\n                         Yes! And my ex-husband -- he never \n                         accepted me for who I was, just like \n                         Mother. The things you've said have \n                         helped me understand what a dick he \n                         is.\n\n                                     MUMFORD\n                         I don't know if --\n\n                                     SOFIE\n                         You're shockingly honest, that's \n                         what makes you great. I've never had \n                         a man treat me this way. With you, I \n                         feel really... listened to.\n                              (gives him a look)\n                         Can I tell you something? It's a \n                         little embarrassing, but I feel very \n                         unguarded with you.\n\n                                     MUMFORD\n                         Of course.\n\n                                     SOFIE\n                         Thanks to this therapy, I now know \n                         what I'm looking for. I need to find \n                         a man like you.\n                              (laughs)\n                         Not one who's treating me, of course.\n                              (full of resolve)\n                         And I'm going to do it, dammit! You've \n                         given me the confidence.\n\n               Mumford is in agony.\n\n                                     MUMFORD\n                         Sofie... that makes me very happy.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               Nessa's on the couch, playing with her usual unlit cigarette. \n               There's an uncharacteristic lightness to her.\n\n                                     NESSA\n                         ...I mean, Doc, the dude is seriously \n                         deluded. I said that to him, I said, \n                         \"If you think I'm gonna do all that \n                         shit for you, man, you are seriously \n                         deluded.\"\n\n                                     MUMFORD\n                         What'd he say?\n\n                                     NESSA\n                              (can't hide her \n                              pleasure)\n                         He said -- \"Which we already knew!\"\n\n               Mumford laughs, delighted.\n\n                                     MUMFORD\n                         What did he want you to do?\n\n                                     NESSA\n                         First off, he tells me to stop smoking \n                         cigarettes. I told him abso-fuckin'-\n                         lutely no. As you can see --\n\n               She holds up the cigarette as though it were her middle \n               finger, flipping the bird.\n\n                                     NESSA\n                         Then he says stop smoking dope. No \n                         again. So then he says he doesn't \n                         want me getting together with any \n                         other guys...\n\n               Mumford doesn't have to see her face to know how much pleasure \n               this gives her, despite her hard-ass cover.\n\n                                     NESSA\n                         ...What balls on this guy? What're \n                         we...\n                              (too geeky for her)\n                         ...going steady? Jesus.\n\n                                     MUMFORD\n                         No again?\n\n                                     NESSA\n                              (long pause)\n                         I said I'd consider it. Nobody owns \n                         me. And the last thing was insane. I \n                         don't know what's wrong with him... \n                         No magazines.\n\n                                     MUMFORD\n                         Really?\n\n                                     NESSA\n                         I don't know if I can quit. We're \n                         gonna try it together, like, you \n                         know, AA or something. And I made \n                         him give up his .22. No more sneaking \n                         around the hills with his fucking \n                         nut gun like some loony tune.\n\n                                     MUMFORD\n                         He agreed?\n\n                                     NESSA\n                              (yes)\n                         He's pitiful, Doc, a goddam puppy. I \n                         don't know how much longer I can put \n                         up with it. I already got two arms \n                         and legs, I don't need another \n                         appendage.\n\n               She takes a look at her watch and immediately lights her \n               cigarette as she stands up --\n\n                                     NESSA\n                         Oops... gotta go!\n\n               She heads toward the waiting room. Mumford gestures to \n               indicate the back door. She waves him off. He shakes his \n               head -- no one wants to use the back anymore.\n\n               Nessa opens the door to the waiting room. Martin Brockett is \n               sitting there. He makes a gesture to Nessa to underline the \n               fact that he is not reading any of the many magazines lying \n               around, then stands up. She goes into his arms like maybe \n               she's the puppy. He beams and looks at Mumford.\n\n                                     MARTIN\n                         Hiya, Doc.\n\n                                     MUMFORD\n                         Martin.\n\n                                     MARTIN\n                              (pulling Nessa tighter)\n                         Did you straighten her out?\n\n               Nessa give him an affectionate punch in the side, then blows \n               smoke in his face.\n\n                                     MUMFORD\n                         How are you?\n\n                                     MARTIN\n                         Insane! Didn't ja hear? My family \n                         got five hundred times better.\n                              (turning Nessa)\n                         Let's go, Vanessa.\n\n               Nessa gives Mumford an embarrassed, \"ain't he corny?\" look, \n               but as they go out the door, she's never looked happier.\n\n                                     GILROY (O.S.)\n                         Doctor Mumford?\n\n               Mumford is startled to find a man in a suit, GILROY, rising \n               from the chair behind the door. He's got a briefcase and a \n               document in his hand.\n\n                                     MUMFORD\n                         I didn't see you there. Can I help \n                         you?\n\n                                     GILROY\n                         My name's Gilroy. I'm from the State \n                         Certification Board.\n\n               He proffers the document in his hand, but Mumford doesn't \n               take it.\n\n                                     GILROY\n                         It's all right, it won't bite you. \n                         Under civil code 1294.67b you are \n                         entitled to be notified that your \n                         status and certification are being \n                         reviewed. This is the notice.\n\n                                     MUMFORD\n                              (takes the paper)\n                         Do you want to come in?\n\n                                     GILROY\n                              (already leaving)\n                         No thanks. Plenty of time for that \n                         when we're a little further along.\n\n                                     MUMFORD\n                         Mr. Gilroy --\n\n               Gilroy stops, outside door already open.\n\n                                     MUMFORD\n                         What brought this on?\n\n                                     GILROY\n                         I'm not at liberty to say. Sometimes \n                         it's just routine, sometimes there's \n                         been a complaint. We'll be in touch.\n\n               He goes out. Mumford considers the paper in his hands, \n               thoughts elsewhere.\n\n               INT. MUMFORD'S APARTMENT - NIGHT\n\n               CLOSE ON A PACKING CARTON half full of books. PULLING BACK \n               and FLOATING OVER other boxes, half-packed with Mumford's \n               personal belongings -- he doesn't have a lot. On the bed, an \n               open suitcase with a few clothes thrown in. We're STILL MOVING \n               across the room and out onto the porch, to REVEAL Mumford in \n               his chair, nursing a beer, looking up at the starry sky.\n\n               Mumford HEARS THE SHOWER GO ON downstairs at Lily's. Then \n               the MURMUR AND GIGGLE of a wet couple.\n\n                                     SKIP (O.S.)\n                         Far out!\n\n               Mumford smiles. He gets up and goes inside, closing the door \n               behind him so as not to violate their privacy. He goes to \n               the suitcase, takes out some clothes and begins putting them \n               back in the dresser. Right now, he's not going anywhere.\n\n               INT. MUMFORD'S OFFICE - DAY\n\n               EXTREME CLOSE-UP of Ernest Delbanco. We can't tell where he \n               is at first. As he speaks, we PULL BACK to REVEAL him lying \n               on Mumford's couch -- a patient.\n\n                                     DELBANCO\n                         ...and when you said at lunch about \n                         everybody having \"a secret life\", \n                         something just snapped inside me. I \n                         knew I could no longer continue my \n                         relationship with Dr. Sheeler. It \n                         was tearing me up inside. And I know \n                         Phyllis wasn't getting what she needed \n                         from it. What had started as a genuine \n                         respect, I think, for each other's \n                         professional abilities, and became, \n                         over time, a personal attraction had \n                         somehow... migrated into a rather \n                         torrid sexual relationship...\n\n               Across the room, Mumford sits, chin in hand, displaying no \n               reaction.\n\n                                     DELBANCO\n                         ...I won't go into that today. Though, \n                         if we should continue these sessions, \n                         as I certainly hope we will, there \n                         are some aspects of that I would \n                         like to look at. God knows, I've \n                         listened to enough people giving me \n                         the juicy --\n                              (catches himself)\n                         ...At any rate, I just wanted to \n                         acknowledge the catalyzing effect \n                         your comment had on me. I just hope \n                         that it doesn't come roiling back \n                         upon you like some dreadful undertow.\n\n                                     MUMFORD\n                         How do you mean?\n\n               This next is painful for Delbanco.\n\n                                     DELBANCO\n                         Well... you see, when I broke it off \n                         with Phyllis, she was naturally upset \n                         and she became more determined than \n                         ever to pursue certain -- how to put \n                         it -- doubts she's been harboring...\n\n                                     MUMFORD\n                         What kind of doubts?\n\n                                     DELBANCO\n                         About you... your background and \n                         your qualifications. I'm afraid \n                         Phyllis somehow got you mixed up in \n                         her fury with me, and actually took \n                         the whole issue to the state board.\n\n               Mumford digests this.\n\n                                     MUMFORD\n                         I see.\n\n                                     DELBANCO\n                         And please, for whatever small way I \n                         may have encouraged this, accept my \n                         apologies.\n                              (brightens)\n                         There is good news, though.\n\n                                     MUMFORD\n                         What's that?\n\n                                     DELBANCO\n                         Phyllis has decided to leave town \n                         and pursue her practice in the city. \n                         Which leaves you the only psychologist \n                         in town.\n\n                                     MUMFORD\n                         Dr. Sheeler is leaving Mumford? I'm \n                         sorry to hear that.\n\n                                     DELBANCO\n                         As you can imagine, my own feelings \n                         about this are mixed... Unlike, I \n                         must say, those of my wife.\n\n               Mumford's head snaps up. He had no idea Delbanco was married.\n\n               EXT. GAS STATION, SMALL TOWN (IN HENRY FOLLETT'S FANTASY) - \n               DAY\n\n               We (CAMERA) are being pummelled by three SMALL TOWN TOUGHS \n               behind Old Man Sutter's gas station/diner in the Follett's \n               fantasy town. [In BLACK & WHITE.] Beyond them, Old Man \n               Sutter's stacked YOUNG WIFE watches in horror from the \n               backdoor of the building. We DO NOT SEE The Newcomer yet.\n\n                                     FOLLETT (V.O.)\n                         Old Man Sutter's young bride had got \n                         me in hot water all right, and now I \n                         was bein' dealt the beating of my \n                         life. If there'd just been two of \n                         those bastards it would have been a \n                         little closer...\n\n               One of the Toughs winds up and delivers the coup de grace. \n               CUT TO BLACK, then FADE UP ON:\n\n               INT. ATTIC ROOM, BOARDING HOUSE - DAY\n\n               STILL IN SUBJECTIVE CAMERA as the concerned Landlady, cleavage \n               foremost, stands away from us, having patted the unseen \n               Newcomer's face with a washcloth. Beyond her, near the half-\n               open door, stands her Cheerleader Daughter, worriedly chewing \n               on her thumb.\n\n                                     FOLLETT (V.O.)\n                         The Landlady was good at quite a few \n                         things, but doctoring wasn't one of \n                         them...\n\n               CUT TO REVERSE and see the hero, who this time is actually \n               played by Henry Follett, appearing in his own fantasy for \n               the first time. He's lying in bed, his face bruised in the \n               manner of a fifties movie.\n\n                                     FOLLETT (V.O.)\n                         ...Lucky for me, one of the other \n                         boarders, the broad who lived \n                         downstairs in the front room...\n\n               BACK AT THE DOOR, the Cheerleader hears someone coming and \n               steps aside to make way for -- Althea Brockett, dressed now \n               in a nurse's uniform so tight the buttons are straining.\n\n                                     FOLLETT (V.O.)\n                         ...was a nurse...\n\n               As the Landlady and the Cheerleader retreat out the door, \n               Althea the Nurse sways forward toward the bed bearing bandages \n               and a bowl of steaming water, a lascivious look of concern \n               on her face.\n\n                                     FOLLETT (V.O.)\n                         ...and she had ways to make you feel \n                         better they didn't teach in nursing \n                         school.\n\n               Althea the Nurse places a bandage over Follett's eyes, \n               BLACKING OUT THE SCENE.\n\n               INT. MUMFORD'S OFFICE - (PRESENT) DAY\n\n               Mumford sits beaming at Henry Follett on the couch. Mumford's \n               glance takes in the clock and he stands up, signalling the \n               end of the session. Follett snaps out of his revery and gets \n               up.\n\n                                     MUMFORD\n                         I'm very happy for you, Henry.\n\n               Mumford, surprisingly, takes Follett's hand and shakes it \n               vigorously.\n\n                                     MUMFORD\n                         I feel like we're making real progress \n                         here.\n\n                                     FOLLETT\n                         Me too, Doc. And I can't tell you \n                         what that package meant to me --\n\n               Mumford stops him with a \"don't mention it\" gesture. Follett \n               accepts and goes out the back door. Mumford is pleased someone \n               still wants to use that door.\n\n               Mumford returns to his desk and begins reading some papers \n               when he HEARS the entry door to the waiting room. Not \n               expecting anyone, he checks the clock, then goes to his office \n               door and opens it.\n\n               Sofie is standing there, very agitated, just about to knock. \n               She peers past him to see if he's alone.\n\n                                     SOFIE\n                         I need to talk to you... Doctor. Can \n                         I come in?\n\n                                     MUMFORD\n                         Of course.\n\n               Sofie sits on the couch. Mumford sits in his chair, facing \n               her. Her voice is as strained as her manner.\n\n                                     SOFIE\n                         We haven't met in this office since \n                         that first time. This is how a real \n                         professional and his client are \n                         supposed to see each other.\n\n               Mumford waits.\n\n                                     SOFIE\n                         It might've been more appropriate if \n                         we had followed a traditional approach \n                         to the doctor-patient relationship.\n\n                                     MUMFORD\n                         Is something wrong, Sofie?\n\n                                     SOFIE\n                         Yes, something's very wrong, Dr. \n                         Mumford.\n\n                                     MUMFORD\n                         You're upset.\n\n                                     SOFIE\n                         How intuitive! That must take years \n                         of training right there. Maybe you \n                         can guess what has upset me.\n\n               Mumford considers a long moment, several scenarios racing \n               through his mind. Finally, carefully --\n\n                                     MUMFORD\n                         Is it something you've heard about \n                         me?\n\n                                     SOFIE\n                         No, it is not something I've heard \n                         about you! It is someth--\n                              (stops suddenly)\n                         Why? Is there something I should \n                         have heard about you?\n\n                                     MUMFORD\n                         Why don't you tell me what's on your \n                         mind?\n\n               Sofie suddenly finds it difficult to look into his eyes, she \n               looks around frenetically for a moment. Then, indicating the \n               couch --\n\n                                     SOFIE\n                         May I?\n\n               Mumford gestures \"of course.\" Sofie swings her legs up and \n               lies on the couch so they can no longer see each other's \n               face. (It's the most vigorous movement she's yet shown us.) \n               This seems to help Sofie a bit.\n\n                                     SOFIE\n                         All right... I'm going to come right \n                         out and say this, because that's \n                         what your shrink is for, right, so \n                         you can tell him what's bothering \n                         you?\n\n                                     MUMFORD\n                         Um-huh.\n\n                                     SOFIE\n                              (tone still rough)\n                         First of all, I have been feeling \n                         much better lately. I don't know if \n                         the syndrome is over -- if it's just \n                         run its course or something -- but I \n                         feel a hundred per cent better than \n                         when I first came to you.\n\n                                     MUMFORD\n                         I'm glad.\n\n                                     SOFIE\n                         Given that, I'm obviously not going \n                         to be judging things in the most \n                         realistic way.\n\n                                     MUMFORD\n                         I don't follow you.\n\n                                     SOFIE\n                              (sharply)\n                         I'm saying that since I'm doing so \n                         much better -- which I attribute to \n                         you -- I'm liable to misinterpret \n                         some of my feelings.\n\n                                     MUMFORD\n                              (tentative)\n                         Okay...\n\n                                     SOFIE\n                         The point is this -- I am not a blank \n                         page. I did not just fall off the \n                         turnip truck. Do you know what I \n                         mean?\n\n                                     MUMFORD\n                         I think so.\n\n                                     SOFIE\n                         I know a little about psychology. I \n                         took three different courses in \n                         college. It's true, none of them \n                         were above the two hundred level, \n                         but I took them... And there was one \n                         concept I remember very well.\n\n                                     MUMFORD\n                         What was that?\n\n                                     SOFIE\n                         Transference!\n\n                                     MUMFORD\n                         Transference.\n\n                                     SOFIE\n                         Yes, and that is what I have got \n                         right now. I have taken my feelings \n                         of gratitude... and relief... and \n                         transferred them onto... you. I have \n                         taken all those warm, grateful \n                         emotions and confused them with \n                         feelings for you... So that now I am \n                         under the delusion...\n                              (a deep breath)\n                         ...that I am in love with you.\n\n               Mumford appears frozen in his chair. There is a heavy silence \n               in the room. Sofie does not look back there.\n\n                                     SOFIE\n                         Hello?\n\n                                     MUMFORD\n                         Hello.\n\n                                     SOFIE\n                         I think you can understand why I \n                         have some serious questions about \n                         your methods. I mean, obviously it \n                         becomes much more likely that I'm \n                         going to have confusion about this \n                         when your idea of treatment is to go \n                         walking in the woods and up to make-\n                         outs-ville and do all these highly \n                         romantic activities --\n\n               Suddenly, Sofie's voice cracks. She is starting to cry, but \n               refuses to acknowledge it.\n\n                                     SOFIE\n                         -- We had a paper route together, \n                         for godssake! Do you understand how \n                         I might be a little resentful? Knowing \n                         that this so-called \"love\" I'm feeling \n                         is totally bogus, and just a pathetic \n                         case of... transference?\n\n               Mumford doesn't know what to say. He's on the rack. Finally --\n\n                                     MUMFORD\n                         Yes.\n\n               Silence. Then Sofie gets up, wiping at tears with the back \n               of her bare hand. Mumford jumps up to offer her a tissue, \n               but she ignores it. She will not meet his gaze.\n\n                                     SOFIE\n                         Maybe you ought to think about how \n                         you're going to fix this. And when \n                         you do...\n                              (suddenly losing her \n                              will)\n                         ...please get back to me.\n\n               Sofie turns to go out through the waiting room, but after a \n               step, she stops, pirouettes and goes out the back.\n\n               EXT. THE DUPLEX HOUSE - MAGIC\n\n               Mumford comes up the street, lost in thought, and turns into \n               the driveway toward his stairs. Ainge leaps over the front \n               yard fence. Mumford pets the dog distractedly, still moving.\n\n                                     MUMFORD\n                         Hey, Ainge.\n\n               Lily rises up suddenly from where she's been working in the \n               garden.\n\n                                     LILY\n                         Doc...\n\n                                     MUMFORD\n                              (keeps walking)\n                         Lily.\n\n                                     LILY\n                         Doc.\n\n               Mumford reluctantly stops. Lily comes up to the fence.\n\n                                     LILY\n                         I don't want you to be mad at Skip...\n\n                                     MUMFORD\n                         He told you.\n\n                                     LILY\n                              (yes)\n                         Skip and I wouldn't have got together \n                         if it weren't for you. That's a big \n                         deal.\n\n                                     MUMFORD\n                              (dismisses it)\n                         You would have met in some shower \n                         eventually...\n\n                                     LILY\n                         I want to give you something. Will \n                         you let me?\n\n                                     MUMFORD\n                         Thanks, Lily, I don't need anything.\n\n                                     LILY\n                         Yes, you do, you damn well do.\n\n                                     MUMFORD\n                              (can't fight)\n                         Okay.\n\n                                     LILY\n                         Here it is, some advice -- do the \n                         hard thing.\n\n                                     MUMFORD\n                         That's it? That's what you're giving \n                         me?\n\n                                     LILY\n                         Clean up the mess. No matter what it \n                         takes.\n\n               Mumford leans down to pet Ainge.\n\n                                     MUMFORD\n                         What it might take is... doing time.\n\n                                     LILY\n                         Too bad. That's tough, I mean it. \n                         I'm not unsympathetic. But Skip says \n                         you're in love.\n\n               Mumford straightens, looks at Lily and acknowledges it.\n\n                                     LILY\n                         Then it's worth it.\n\n               Mumford looks at Lily a long moment, then leans over the \n               fence and kisses her on the forehead. Ainge jumps back over \n               to her side.\n\n                                     MUMFORD\n                         I'll tell her tonight.\n\n               Mumford turns and continues toward his stairs.\n\n               INT. MUMFORD'S APARTMENT - MAGIC\n\n               Mumford comes in, drops his coat, gets a carton of orange \n               juice out of the fridge and drinks directly from it. \n               Distracted, he picks up the remote from the kitchen counter \n               and switches on the TV, then opens his freezer and stares \n               inside.\n\n               UNSOLVED MYSTERIES comes on. The opening segment previews a \n               story about a couple who claim to have had a visitation from \n               Gianni Versace, then one about a yacht that went down near \n               Venezuela. ROBERT STACK, in his characteristic fragmented \n               delivery, intones the preview for the last story, accompanied \n               by appropriate footage:\n\n                                     ROBERT STACK\n                         ...A drug rehabilitation center in \n                         the lonely southwestern desert... \n                         run by reclusive monks... becomes \n                         the point of departure in a mysterious \n                         vanishing...\n\n               A CLOSE-UP of an IRS identification card featuring a picture \n               of a younger Mumford, badly photographed in suit and tie. \n               His name is not visible.\n\n                                     ROBERT STACK\n                         ...as an intrepid government \n                         investigator disappears -- without a \n                         trace.\n\n               In the kitchen, Mumford spins to look. DISSOLVE TO:\n\n               LATER IN THE PROGRAM. Documentary shots of IRS Headquarters, \n               etc., are INTERCUT with hokey-looking re-enactments from \n               Mumford's life -- with a YOUNG ACTOR who looks vaguely like \n               Mumford playing him.\n\n               IN MUMFORD'S APARTMENT the telephone is RINGING. Clearly, \n               it's not the first time. Mumford, watching the show intently, \n               lifts the headset an inch from the cradle and then hangs up. \n               When it immediately RINGS AGAIN, Mumford takes it off the \n               hook, cuts off the call, and buries the headset under a sofa \n               cushion.\n\n               ON THE SHOW: scenes of tax investigation -- in the show's \n               version the IRS guys have drawn guns and are storming houses -- \n               are interspersed with scenes of sordid drug-taking.\n\n                                     ROBERT STACK\n                         ...despite brilliant promise as a \n                         fearless investigator... found himself \n                         on a downward spiral of drug abuse \n                         and dissolution...\n\n               MUMFORD'S SISTER, the real thing, a plain, middle-aged West \n               Virginia woman, appears in a \"dramatic\", badly-lit interview. \n               (As with all the interviewees, she is identified by a supered \n               title.)\n\n                                     MUMFORD'S SISTER\n                         ...we didn't talk much after our \n                         folks died, but I know he felt his \n                         life had taken a wrong turn...\n\n               A snapshot of some IRS-era party, happy revelers posing for \n               a flash. Camera PUSHES IN on Mumford, smiling and high, his \n               neck encircled by Gregory's arm. Candy is on the other side \n               of Gregory.\n\n               A shot of the Pennsylvania Turnpike as a State Police Cruiser \n               zips by.\n\n                                     ROBERT STACK\n                         His former undercover partner at the \n                         IRS... is now a trooper with the \n                         Pennsylvania State Police...\n\n               GREGORY, in State Police uniform, with a sadistic glint in \n               his eye, is interviewed by the roadside, cars whipping by.\n\n                                     GREGORY\n                         The guy was obsessed... didn't always \n                         know where to draw the line... but I \n                         would have trusted him with my wife -- \n                         er, my life --\n                              (looks off camera, \n                              laughing)\n                         -- What'd I say? Both, actually...\n                              (gets serious again)\n                         ...I can't say I was surprised, \n                         though, when he disappeared.\n\n               Ragged telephoto shots of the Drug Rehab Center in the desert, \n               low, innocuous adobe buildings.\n\n                                     ROBERT STACK\n                         Who was this enigma... a courageous \n                         public servant or a debauched \n                         addict?... Either way, his last known \n                         stop was here... isolated in the \n                         Arizona desert... taken in by an \n                         order of devoted monks...\n\n               IN AN ARIZONA TOWN, a monk with a clerical collar, BROTHER \n               TIMOTHY, is loading groceries into the back of a pick-up. \n               He's being ambush interviewed. He's polite, but not \n               cooperative.\n\n                                     BROTHER TIMOTHY\n                         We don't talk about the people who've \n                         been our guests... but I can tell \n                         you this about our order -- we believe \n                         everybody has the right to start \n                         over... everybody deserves a second \n                         chance.\n\n               Shots of wind-swept desert, cactus, and dust-blown highway.\n\n                                     ROBERT STACK\n                         And perhaps... that is exactly the \n                         chance the now-sober pilgrim took... \n                         on a blustery November day... walking \n                         away from the rehab center... never \n                         to be heard from again...\n\n               MUMFORD'S SISTER AGAIN:\n\n                                     MUMFORD'S SISTER\n                         I'd like to know if he's alive. If \n                         he is, I just hope he's happy and \n                         his new life is...\n                              (not sure how to put \n                              it)\n                         ...well, I hope he's found what he \n                         was looking for...\n\n               Mumford, in his apartment, watches with real emotion.\n\n               His sister's face DISSOLVES into a new snapshot of Mumford, \n               dressed in an Orkin Exterminator uniform, as the MUSIC on \n               the show comes up. A 1-800 telephone number appears across \n               the bottom of the frame.\n\n                                     ROBERT STACK\n                         If you have any information about \n                         this man or know anything about his \n                         whereabouts, contact the Sheriff's \n                         Department in Cochise County, Arizona, \n                         or call this number...\n\n               EXT. SECOND FLOOR PORCH, THE DUPLEX HOUSE - NIGHT\n\n               Mumford comes out to the rail and looks off over the town of \n               Mumford.\n\n               WHAT HE SEES (or imagines he sees): all across the nightscape, \n               one window in every house is glowing blue with flickering TV \n               light.\n\n               EXT. COOK HOUSE - NIGHT\n\n               MOVING IN on the porch steps. Mumford runs into the shot. In \n               fact, he's run the whole way from his place and he's out of \n               breath. He takes the porch steps three at a time, rings the \n               doorbell, and waits.\n\n               Mrs. Cook peeks out, then opens the front door, an especially \n               sour look on her face. She speaks through the screen door.\n\n                                     MRS. COOK\n                         Well, look who's here...\n\n                                     MUMFORD\n                         Good evening, Mrs. Cook.\n\n                                     MRS. COOK\n                         Just who is here, can you tell me?\n\n                                     MUMFORD\n                         Could I see Sofie, please?\n\n                                     MRS. COOK\n                         No, you can not. I wouldn't know who \n                         to say is calling.\n\n                                     SOFIE (O.S.)\n                         Mother...\n\n               Mrs. Cook glances inside at the as-yet-unseen Sofie, then \n               hisses at Mumford --\n\n                                     MRS. COOK\n                         I could see right through you from \n                         the start, you imposter. I know what \n                         you're after. I knew it then and I \n                         know it now!\n\n               Sofie appears behind her mother.\n\n                                     SOFIE\n                         Mother...\n\n                                     MUMFORD\n                         What do you think I'm after, Mrs. \n                         Cook?\n\n                                     MRS. COOK\n                         Sofie. It's so obvious... you're \n                         after my daughter.\n\n                                     MUMFORD\n                         Well, I gotta say, Mrs. Cook, you're \n                         right about that.\n\n               Both Sofie and Mrs. Cook are set back for a moment. Mrs. \n               Cook recovers fastest --\n\n                                     MRS. COOK\n                         It'll never happen! You're in big \n                         trouble, mister.\n\n                                     SOFIE\n                              (scary strong)\n                         Mother... go away!\n\n               Mr. Cook suddenly appears, takes Mrs. Cook by the arm and \n               makes her vanish. Sofie and Mumford are left alone. She looks \n               at him through the screen.\n\n                                     MUMFORD\n                         I guess you saw the show...?\n\n                                     SOFIE\n                         Which show was that?\n\n                                     MUMFORD\n                         Sofie...\n\n                                     SOFIE\n                         Part of it. We were watching \"ER\" \n                         until someone called.\n\n                                     MUMFORD\n                         You probably got the idea.\n\n               Sofie comes outside. She doesn't get too close or look at \n               him as she walks to the other end of the porch.\n\n                                     SOFIE\n                         Do you know what a betrayal this \n                         is?...\n\n               Mumford knows.\n\n                                     SOFIE\n                         ...How violated I feel?\n\n                                     MUMFORD\n                         You're not the only one...\n\n               Sofie turns sharply to look at him, ready to blow up.\n\n                                     SOFIE\n                         You feel violated?\n\n                                     MUMFORD\n                         Not me... all my other my patients. \n                         I smelled tar and feathers on the \n                         way over here.\n\n                                     SOFIE\n                         You deserve it.\n\n               Mumford agrees. He watches her closely.\n\n                                     SOFIE\n                         I should be irate.\n\n               Mumford immediately perks up. Sofie tries to correct --\n\n                                     SOFIE\n                         I am irate!\n\n                                     MUMFORD\n                              (grabbing at the thread)\n                         But...\n\n                                     SOFIE\n                         But nothing... I'm mad as hell. This \n                         is a terrible thing you've done.\n\n                                     MUMFORD\n                         I know it! Please believe me, I know \n                         that...\n\n               Mumford steps closer to her.\n\n                                     MUMFORD\n                         But, there is one... mitigating factor \n                         I want you to consider before you \n                         write me off.\n\n                                     SOFIE\n                         What?\n\n                                     MUMFORD\n                         Will you think about it?\n\n                                     SOFIE\n                         I don't know. Depends. I'm in a bad \n                         mood.\n\n                                     MUMFORD\n                         I love you. More than I've ever loved \n                         anyone or anything in my life.\n\n               She looks into his eyes.\n\n                                     SOFIE\n                         Oh.\n\n                                     MUMFORD\n                         I want to spend the rest of my life \n                         with you... but I'm not sure you \n                         feel the same way.\n\n               She regards him for several moments, her mind racing.\n\n                                     SOFIE\n                         I sort of do...\n\n               Mumford feels joy. Now, finally, he takes her in his arms.\n\n                                     SOFIE\n                         ...but first, you have to tell me \n                         something...\n\n                                     MUMFORD\n                         Anything... just ask.\n\n                                     SOFIE\n                         What is your name?\n\n               As Mumford breaks into a huge grin, CUT TO:\n\n               INT. COURTROOM, MUMFORD COUNTY COURTHOUSE - DAY\n\n               Mumford is at the defense table. Lionel is his lawyer. Sofie, \n               Mr. Cook and Ben sit right behind the rail.\n\n                                     JUDGE OTTO (O.S.)\n                         The defendant will rise.\n\n               Mumford and Lionel stand up.\n\n                                     JUDGE OTTO (O.S.)\n                         Sit down, Lionel.\n\n               Lionel sits down, squelched again. We see JUDGE OTTO for the \n               first time, a tough guy in his sixties.\n\n                                     JUDGE OTTO\n                         Clarence Norman White, do you \n                         understand how serious are the crimes \n                         with which you have been charged?\n\n                                     MUMFORD\n                         I do.\n\n                                     JUDGE OTTO\n                         Do you realize how insidious it is \n                         to invade the most private thoughts \n                         and secret lives of unsuspecting \n                         people?...\n\n               WE SEE there's a pretty big turnout for this hearing. \n               Prominent among the onlookers: Lily and Skip, sitting \n               together; Nessa and Martin, holding hands; Dr. Delbanco and \n               MRS. DELBANCO. Gilroy, from the State Certification Board, \n               sits with the PROSECUTOR.\n\n                                     JUDGE OTTO\n                         ...People who have come to you with \n                         the faith that you know what you're \n                         doing... and that you are who you \n                         say you are?\n\n                                     MUMFORD\n                         Yes, your honor.\n\n                                     JUDGE OTTO\n                         It means absolutely nothing to me \n                         that so many of your patients have \n                         come forward with praise for you and \n                         your therapeutic skills. You \n                         understand that?\n\n                                     MUMFORD\n                         Yes.\n\n               Follett is sitting in one of the back rows, apparently alone. \n               But now he looks down the row. Althea is sitting down at the \n               end in a stylish suit, completely appropriate, but a size \n               too small.\n\n               She gives Follett a sidelong glance, then crosses her legs \n               provocatively. Whatever fantasy they're currently enacting \n               is working really well for both of them.\n\n                                     JUDGE OTTO\n                         Mr. White, I am frustrated that the \n                         criminal code in this state allows a \n                         maximum sentence of only six months \n                         and a maximum fine of only $2000.\n\n                                     MUMFORD\n                         I'm sorry, your honor.\n\n                                     JUDGE OTTO\n                         What?\n\n                                     MUMFORD\n                         I'm sorry you're frustrated.\n\n                                     JUDGE OTTO\n                         Are you disrespecting this court, \n                         Mr. White?\n\n                                     MUMFORD\n                         No, sir. I was empathizing. Sorry.\n\n                                     JUDGE OTTO\n                         Maybe you can empathize with this -- \n                         Maximum fine. Three months in jail, \n                         three months house arrest. Sentence \n                         to begin immediately at the Orchard \n                         Valley Correctional Facility. Case \n                         closed. This court is adjourned.\n\n               The judge slams down his gavel, stands up and stalks out. A \n               DEPUTY moves in to take custody of Mumford. Lionel stands up \n               and leans in --\n\n                                     LIONEL\n                         It's a country club. Don't worry \n                         about it.\n\n                                     MUMFORD\n                         Thanks for your help, Lionel.\n\n               Mumford turns to face the Cooks. Mr. Cook and Ben shake his \n               hand like he's just won something. Lionel addresses them all \n               with his usual self-satisfaction --\n\n                                     LIONEL\n                         I'll have him out in half the time.\n\n               WE PUSH IN on Mumford and Sofie, who embrace.\n\n                                     SOFIE\n                         You got off easy.\n\n                                     MUMFORD\n                         Will you wait for me?\n\n                                     SOFIE\n                         We're only talking about six weeks.\n\n                                     MUMFORD\n                         Will you be here?\n\n                                     SOFIE\n                         Of course... I haven't got the energy \n                         to get out of town that fast.\n\n               They kiss. The Deputy takes Mumford's arm, and we --\n\n                                                                    CUT TO:\n\n               INT. STATE CORRECTIONAL SEDAN - DAY\n\n               Mumford is alone in the backseat, handcuffed to a metal \n               restraint. A lone COUNTY CORRECTIONAL OFFICER is up front, \n               driving. There's a heavy security screen divider between \n               front and back.\n\n                                     CORRECTIONAL OFFICER\n                         Better make yourself comfortable. We \n                         got a three hour drive here.\n\n                                     MUMFORD\n                         I'm fine.\n\n                                     CORRECTIONAL OFFICER\n                         You're the shrink, aren't you?\n\n                                     MUMFORD\n                         No, not really.\n\n                                     CORRECTIONAL OFFICER\n                         But you do therapy?\n\n                                     MUMFORD\n                         Not any more.\n\n               They ride along in silence. At peace, Mumford watches the \n               town go by. Finally --\n\n                                     CORRECTIONAL OFFICER\n                         I'll tell you, Doc, the wife and I, \n                         we got a little bit of a problem. \n                         Would you mind if I just ran it by \n                         you?\n\n               The Correctional Officer watches Mumford in the rear view \n               mirror, waiting hopefully. Mumford ponders the question a \n               long time, then gives a \"what the hell\" shrug.\n\n                                     MUMFORD\n                         Go ahead.\n\n               EXT. MAIN STREET, EDGE OF TOWN - DAY\n\n               The State Correctional Sedan heads out of the business \n               district toward the highway, leaving the town of Mumford \n               behind.\n\n               FADE OUT.\n\n                                         THE END\n\n\n\n\nMumford\nWriters :   Lawrence Kasdan\nGenres :   Comedy  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:31:48.979372"}