{"title": "Music of the Heart", "film_link": "/Movie Scripts/Music of the Heart Script.html", "script_link": "/scripts/Music-of-the-Heart.html", "info_raw": "\n\nMusic of the Heart Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Pamela Gray\nGenres  Drama\nScript Date : January 1999\nMovie Release Date : October 1999\n\nRead \"Music of the Heart\" Script\n\n\n", "script": "\n\n\n\n                                    MUSIC OF THE HEART\n\n\n                                       Written by\n\n                                       Pamela Gray\n\n\n\n                                      SHOOTING DRAFT\n                                     January 25, 1999\n\n\n                \n\n               FADE IN:\n\n               CREDITS OVER PHOTOS IN AN ALBUM\n\n               The photos include a sepia-tone portrait of an Italian \n               immigrant family... a b&w snapshot of ROBERTA, a nine-year-\n               old girl playing violin in front of a refrigerator (1950)...\n\n               ...Roberta and her dashing Italian father, hand-carving a \n               wooden music stand... a b&w snapshot of Roberta in a communion \n               dress... Roberta at 15, playing violin in front of the same \n               refrigerator, eyes on the music stand...\n\n               ...a color photo of two cute blonde little boys building a \n               sandcastle on a beach... a color photo of a groom in a white \n               naval uniform and his pretty bride, (Roberta at 25), her \n               hand over his as they cut their wedding cake with a sword...\n\n               ...a color photo of Roberta and her husband Greek dancing \n               with another couple at an outdoor taverna. Roberta's husband \n               and the other man's sexy wife are exchanging a slight smile...\n\n               HOLD ON THIS LAST PHOTO as we now see the ALBUM open on the \n               floor of a bedroom, as if it's been tossed. We are:\n\n               INT. GUASPARI HOUSEHOLD, ROME, N. Y. - BEDROOM - DAY (1988)\n\n                                     WOMAN'S VOICE (O.S.)\n                         Wake up, Roberta!\n\n               We hear the sound of KNOCKING as the CAMERA PANS a small, \n               darkened guest room. A few streaks of daylight filter through \n               Venetian blinds.\n\n                                     WOMAN'S VOICE (O.S.)\n                         Come on, Bert -- get out of bed!\n\n               The CAMERA finds a WOMAN lying face down on a twin bed, thick \n               wavy hair sprawled across her shoulders.\n\n                                     WOMAN'S VOICE (O.S.)\n                         Please, Bert -- you need to get out \n                         of that bed.\n\n               The KNOCKING continues, and she puts the pillow over the top \n               of her head.\n\n               END CREDITS\n\n               INT. GUASPARI BEDROOM - DAY\n\n               The WOMAN -- ROBERTA GUASPARI-DEMETRAS (38) -- retrieves the \n               photo album from the floor, looks at a photo and removes it. \n               She's a beautiful woman with large, expressive eyes, but \n               right now she looks like hell. She stares at the photo -- \n               it's the two couples dancing. A quick glimpse of hurt on her \n               face, then her jaw tightens and she rips the picture in half. \n               There's muffled talking outside the door, and then two young \n               boys' voices.\n\n                                     BOY'S VOICE (O.S.)\n                         Can you come out now, Mommy? Please?\n\n               She puts the half with her and her husband on the dresser, \n               then tears the woman off the other half and rips her into \n               pieces.\n\n                                     BOY #2 (O.S.)\n                         Mommy, Nick broke my crayon!\n\n                                     BOY #1 (O.S.)\n                         Well, Lexi hit me and he almost \n                         broke... he almost broke my ear!\n\n               O.S. arguing \"I DID NOT!\" \"YES YOU DID!\" \"LIAR!\" etc. As if \n               that one action siphoned all her energy, Roberta returns to \n               bed, gets into fetal position, and stares at a point beyond \n               the wall, ignoring the O.S. voices.\n\n                                     WOMAN'S VOICE (O.S.)\n                         Hear that? Your boys need you.\n\n               EXT. GUASPARI HOUSE - DOORWAY - DAY\n\n               ASSUNTA GUASPARI (58), Roberta's slender, tired Italian-\n               American mother, stands in the doorway of a well-tended \n               working-class home, addressing a young NAVAL OFFICER who \n               holds a lengthy delivery inventory. It's a gray day with \n               ominous storm clouds. Late 70's CARS are parked on the street.\n\n                                     ASSUNTA\n                         But I have no room for this!\n\n                                     OFFICER\n                         I'm sorry, M'am. We have orders to \n                         deliver these.\n\n               Assunta looks beyond the man, dismayed.\n\n               HER POV\n\n               Large wooden CRATES cover her front lawn, and TWO MOVERS \n               plant down another. They hurry back to the TRUCK, grabbing \n               the next crate too quickly this time. It slips from their \n               hands, CRASHES to the ground and splinters open. Several \n               VIOLIN CASES spill out. The crate looks like it holds a whole \n               lot more.\n\n               BACK TO SCENE\n\n               Instantly a second-story window is flung open, and Roberta \n               sticks her head out, a hundred times more energized than \n               we've seen her so far.\n\n                                     ROBERTA\n                         Watch it, you idiots! Be careful \n                         with those!\n\n               The men scramble to pick them up. Assunta looks at all the \n               violins, then up at Roberta.\n\n                                     ASSUNTA\n                         Why so many?\n\n               Roberta disappears inside and slams the window shut.\n\n               INT. GUASPARI LIVING ROOM - DAY\n\n               The living room is filled with boxes shipped from Greece, \n               labelled by the U.S. NAVY. And on the floor, in the middle \n               of the boxes, are FIFTY VIOLIN CASES of various sizes, also \n               with Greek and U.S. NAVY labels. NICK (7) and LEXI (5) climb \n               over the boxes as if they were giant blocks.\n\n                                     NICK\n                              (calling)\n                         Mommy, which box has our toys?\n\n               INT. GUASPARI HALLWAY - CONTINUOUS\n\n               ROBERTA'S on the phone, yelling at someone. She's still in \n               the same ratty nightgown.\n\n                                     ROBERTA\n                         Look, I know he's there, so quit \n                         lying to me!... Then check under \n                         Lana Holden -- Mrs. Lana Holden... \n                         Fine. Just tell Lieutenant Demetras \n                         that his wife called and --\n\n               ASSUNTA grabs the phone from her hand and hangs it up.\n\n                                     ROBERTA\n                         Ma!\n\n                                     ASSUNTA\n                         No. I want you to listen to me. You \n                         can't keep doing this to yourself -- \n                         or to the boys. They need their mother \n                         now. You're a beautiful, talented \n                         woman and you have your whole life \n                         ahead of you.\n\n                                     ROBERTA\n                         If I'm so beautiful and talented, \n                         why did Charles leave me?\n\n                                     ASSUNTA\n                         Because Charles is a big jerk.\n                              (beat)\n                         Now get dressed.\n\n               She exits, leaving Roberta to mull over her words.\n\n               INT. GUASPARI KITCHEN - DAY\n\n               Coffee is brewing and homemade cinnamon rolls are cooling on \n               a rack. We recognize the kitchen from the home movie footage. \n               As Assunta clears the boys' breakfast dishes from the table, \n               Roberta enters. She's dressed, but hasn't put on makeup or \n               done much with her hair. It's a start.\n\n                                     ROBERTA\n                         You really think Charles is a jerk?\n\n                                     ASSUNTA\n                         From the day you married him.\n\n                                     ROBERTA\n                         Why didn't you say something?\n\n                                     ASSUNTA\n                         Since when do you listen to me?\n\n               Roberta half-smiles, pours herself some coffee, then sits \n               down at the table.\n\n                                     ROBERTA\n                              (sighs, then)\n                         What am I gonna do?\n\n                                     ASSUNTA\n                         First, you eat breakfast. Second, \n                         you go out and get a job -- any job. \n                         Your boys, god-bless-em, are good \n                         eaters -- but I can't afford it.\n\n                                     ROBERTA\n                         Mama, he's gonna get tired of her -- \n                         you'll see.\n\n               Assunta's face shows she's doubtful about this.\n\n                                     ASSUNTA\n                         Well in the meantime, get a job.\n\n               INT. DEPARTMENT STORE - GIFT WRAP COUNTER - ROME, N.Y. - DAY\n\n               Roberta is behind the counter, meticulously wrapping a present \n               with ribbons, bows and stickers. At one point she even unties \n               a ribbon and redoes it because it's not perfect. She looks \n               pretty, but she's dressed conservatively, like a navy \n               housewife. There's only one other clerk wrapping gifts and a \n               long line of impatient customers. A male SUPERVISOR appears \n               behind Roberta.\n\n                                     SUPERVISOR\n                         Just wrap. You're not Picasso.\n\n               He exits, and Roberta quickly tries to finish her task.\n\n                                     MALE VOICE (O.S.)\n                         Picasso would probably put the bows \n                         on the back of the box.\n\n               Roberta looks up to find BRIAN TURNER (40), a handsome, sexy \n               guy with longish hair and a beat-up leather jacket.\n\n                                     ROBERTA\n                         Brian Turner?\n\n                                     BRIAN\n                         Hello, Roberta.\n\n                                     ROBERTA\n                         I thought you moved away.\n\n                                     BRIAN\n                         I did. I'm in town for my Mom's \n                         birthday.\n\n               He holds out his hand. Roberta misunderstands the gesture \n               and tries to shake his hand.\n\n                                     BRIAN\n                         No -- that's her gift.\n\n                                     ROBERTA\n                              (embarrassed)\n                         Oh! Sorry.\n\n               Roberta hands him the gift she's been wrapping.\n\n                                     BRIAN\n                         It looks very pretty.\n\n                                     ROBERTA\n                         Thank you.\n                              (beat)\n                         I heard you had a book published. I \n                         didn't read it but...\n\n                                     BRIAN\n                         That's O.K. My parents didn't read \n                         it either. It looks good on their \n                         coffee table, though.\n\n               Roberta smiles.\n\n                                     BRIAN\n                         So what are you doing here? I thought \n                         you'd be in Carnegie Hall by now.\n\n               HOLD ON ROBERTA as she takes this in.\n\n               INT. COFFEE SHOP - ROME, N.Y. - DAY\n\n               Roberta sits opposite Brian. Her lunch is untouched.\n\n                                     ROBERTA\n                         My college professors said it was \n                         too late -- I hadn't had enough \n                         training to be a concert violinist. \n                         So I got a teaching degree instead.\n\n                                     BRIAN\n                         I'll bet you're a great teacher.\n\n                                     ROBERTA\n                         I think I am. It's just that...\n                              (sighs)\n                         See, every time I'd get started \n                         somewhere, Charles would be \n                         transferred... then I had my kids \n                         and took time off to raise them... \n                         and then when I decided to teach \n                         again, no one would hire me 'cause \n                         you can't count on a navy wife to \n                         stick around. I finally decided I'd \n                         start my own program -- Charles gave \n                         me the money and I bought fifty \n                         violins from this little Greek shop -- \n                         got started at a private school and \n                         then...\n\n                                     BRIAN\n                         Your husband ran off with your best \n                         friend.\n\n               A beat.\n\n                                     ROBERTA\n                         She wasn't my \"best\" friend. She was \n                         a friend.\n                              (beat)\n                         Charles is the last person you'd \n                         think would cheat on me -- he never \n                         broke a rule...\n                              (a few beats)\n                         I wake up one night -- it's like one \n                         in the morning -- and he's not in \n                         bed. I go outside and our neighbor -- \n                         this old Greek guy -- is sitting out \n                         there, smoking a cigar, so I ask if \n                         he's seen my husband. \"He's taking a \n                         walk with the other officer's wife,\" \n                         he says. \"He takes a walk every night \n                         with the other officer's wife.\"\n\n               A beat as she gets lost in the memory. She takes a bite of a \n               french fry.\n\n                                     ROBERTA\n                         God, these are cold.\n\n                                     BRIAN\n                         So you're just gonna wrap presents \n                         and wait for him to come back?\n\n                                     ROBERTA\n                         You sound like my mother.\n\n                                     BRIAN\n                         That's not very sexy.\n\n                                     ROBERTA\n                         Are you trying to be sexy or be my \n                         friend?\n\n                                     BRIAN\n                         A little of both.\n\n               Roberta smiles, blushing a bit. Brian looks at her, getting \n               an idea.\n\n                                     BRIAN\n                         You know, I know this really cool \n                         lady who runs this elementary school -- \n                         I wrote a piece on her. It's a public \n                         school, but it's alternative -- she \n                         might be able to create some kind of \n                         gig for you. Let me give her a call.\n\n                                     ROBERTA\n                         Great!\n\n                                     BRIAN\n                              (takes his last bite \n                              of sandwich)\n                         If she hires you, though, you have \n                         to be willing to relocate.\n\n                                     ROBERTA\n                         Where is it?\n\n               EXT. SPANISH HARLEM, NEW YORK CITY - TRAVELLING SHOT - DAY\n\n               A SALSA SONG PLAYS OVER as we see stores with Spanish names \n               and signs; Black and Latino elementary school children walking \n               home from school; some burned-out buildings; Black and Latino \n               teens playing basketball on a cement court; Spanish graffiti \n               on walls; elderly women buying fruit at a produce stand.\n\n               PULL BACK TO REVEAL this is the POV of Roberta from the back \n               seat of a cab. The SALSA SONG plays on the cab's radio. \n               Roberta looks scared shitless.\n\n               Suddenly, two YOUNG MEN flash down the middle of the street, \n               dart IN FRONT of the cab and the driver SLAMS on the brakes, \n               jerking Roberta forward.\n\n                                     TAXI DRIVER\n                         Welcome to East Harlem.\n\n               EXT. CENTRAL PARK EAST ELEMENTARY SCHOOL (CPE 1) - EAST \n               HARLEM - ESTABLISHING - DAY\n\n               INT. JANET WILLIAMS' OFFICE - DAY\n\n               JANET WILLIAMS, a Black woman (40's) with a kind face, sits \n               behind her desk and looks at Roberta's resume. A sign on her \n               desk indicates that she's the DIRECTOR. Also on the desk is \n               a FRAMED PICTURE of Janet, her husband, daughter (14), and \n               son (12). Roberta sits nervously in the chair opposite her.\n\n                                     JANET\n                              (looking at resume)\n                         Aside from half a term in a private \n                         school -- in Greece -- and a year \n                         teaching chorus in Hawaii -- ten \n                         years ago -- it doesn't look like \n                         you've had any other teaching \n                         experience.\n\n                                     ROBERTA\n                         Well, not traditional teaching \n                         experience. I've been doing private \n                         lessons...\n\n               Janet looks for this on the resume.\n\n                                     ROBERTA\n                         It's not on there... I taught my \n                         sons.\n\n               Janet smiles politely.\n\n                                     JANET\n                         I'd like to help you, Mrs. Demetras. \n                         Brian spoke highly of you and I told \n                         him I'd consider starting a violin \n                         class... But without the proper \n                         qualifications, and without any \n                         experience in an inner city school...\n\n               Roberta nods, defeated.\n\n                                     JANET\n                         I'm very sorry.\n\n               INT. CPE 1 - HALLWAY - DAY\n\n               Roberta stands outside Janet's office, dejectedly watching \n               the children noisily running through the hall.\n\n               INT. AREA OUTSIDE JANET WILLIAMS' OFFICE - THE NEXT DAY\n\n               Roberta knocks on Janet's door.\n\n                                     JANET (O.S.)\n                         Yes?\n\n               As Roberta opens the door, we see that Nick and Lexi are \n               with her. All three have violins. INSIDE, Janet's in \n               conversation with DENNIS RAUSCH (38), an uptight man with a \n               tie that doesn't match his suit jacket. He's showing Janet a \n               large scheduling chart.\n\n                                     ROBERTA\n                         I'm sorry to interrupt, but I wanted \n                         you to meet my sons -- Nick, Lexi...\n\n               They enter.\n\n               INT. JANET'S OFFICE - CONTINUOUS\n\n               Janet smiles at the boys, but clearly thinks Roberta's a \n               little off. Roberta holds her hand out to Dennis.\n\n                                     ROBERTA\n                         Roberta Guaspari-Demetras.\n\n               Dennis shakes her hand, regarding her warily.\n\n                                     JANET\n                         This is Dennis Rausch, our music \n                         teacher and program coordinator.\n                              (beat)\n                         Mrs. Demetras, didn't I make things \n                         clear yesterday?\n\n                                     ROBERTA\n                         If I could just show you something -- \n                         it'll only take a minute.\n\n               Before Janet can answer, Roberta and the kids quickly take \n               out their violins and get into position. Janet and Dennis \n               exchange a look.\n\n                                     DENNIS\n                         Are we having a talent show? I should \n                         have brought my tap shoes.\n\n               Roberta ignores the jab, then nods to the boys. The three of \n               them begin an incredibly impressive violin trio, playing an \n               ETUDE in three-part harmony. For the first measures, Janet's \n               still annoyed by the intrusion, but she's quickly won over. \n               Dennis watches impassively.\n\n               Roberta and the boys finish their piece; Janet applauds and \n               Dennis joins in to be polite. The three take bows. A beat.\n\n                                     LEXI\n                         Will you hire her now?\n\n               Janet laughs, then gestures for them to sit.\n\n                                     JANET\n                         How long have you boys been playing?\n\n                                     NICK\n                         Since I was three.\n\n                                     LEXI\n                              (contemplates, then)\n                         Maybe since I was three and a half.\n\n                                     JANET\n                         Your mom must be a good teacher.\n\n                                     NICK\n                              (shrugs)\n                         She's O.K.\n\n               Roberta gives Nick a look, but Janet smiles.\n\n                                     JANET\n                              (to Roberta)\n                         If you could teach our students to \n                         play like that, I'd be thrilled, but --\n\n                                     ROBERTA\n                         I can. Any child can learn the violin.\n\n                                     DENNIS\n                         Assuming they had the discipline.\n\n                                     ROBERTA\n                         I'll teach them to have discipline.\n\n                                     JANET\n                         A lot of our parents are struggling \n                         to feed their kids and pay the rent -- \n                         they don't have time to help them \n                         learn violin.\n\n                                     ROBERTA\n                         They don't have to. If they can help, \n                         great -- but these kids will be \n                         committed. They'll practice on their \n                         own, they'll help each other in the \n                         classroom --\n\n               Dennis laughs. Roberta looks at him, a bit miffed.\n\n                                     DENNIS\n                              (with an edge)\n                         I think I know these students, Miss \n                         Demetras. Their attention span doesn't \n                         go past do-re-mi. Maybe on a good \n                         day, I can get them to \"fa.\"\n\n                                     ROBERTA\n                         You're underestimating them. They \n                         can play as well as any other kids.\n\n                                     DENNIS\n                         That I'd like to see.\n\n                                     ROBERTA\n                         You will.\n\n               A beat. Janet observes the tension, then turns to Roberta.\n\n                                     JANET\n                              (to Roberta)\n                         For now I'll put you down as a sub, \n                         but I have to warn you -- even if it \n                         works out, the Board may not let me \n                         create a permanent position for you.\n\n                                     ROBERTA\n                         That's O.K. I'll worry about that \n                         later.\n                              (with a grateful look)\n                         Thank you.\n\n               We see relief -- and fear -- in Roberta's face.\n\n                                     DENNIS\n                              (to Janet)\n                         Well, I've already planned out the \n                         whole term, and I can tell you right \n                         now, there's no room for this! \n                         Besides, where you gonna find money \n                         for violins?\n\n                                     ROBERTA\n                         You need violins?\n\n               INT. MUSIC ROOM - DAY\n\n               In a noisy music room with bad acoustics, Roberta tries to \n               take control of fifty kids, third through fifth-graders, who \n               are in a state of manic excitement over the FIFTY VIOLIN \n               CASES on the floor.\n\n                                     ROBERTA\n                              (gently)\n                         Please do not open the cases, O.K.?\n\n               They ignore her.\n\n                                     ROBERTA\n                         Look, can everyone just settle down \n                         and listen to me -- please?\n\n               ANGLE - Three girls open their cases.\n\n                                     ROBERTA\n                              (starting to lose it)\n                         Keep them closed! Please.\n\n               ANGLE - Two boys open their cases.\n\n                                     ROBERTA\n                              (to the boys)\n                         Did you hear what I just said?\n\n               ANGLE - Three kids are using the violin cases as pretend \n               machine guns -- and shooting each other.\n\n                                     ROBERTA\n                         Put those down, please!\n\n               ANGLE - A boy and a girl are having a \"sword fight\" with \n               their bows.\n\n                                     ROBERTA\n                              (to the fencers)\n                         Don't do that! Put the bows back in \n                         the cases -- right now!\n\n               There's the SOUND of violin strings being plucked.\n\n                                     ROBERTA\n                         Who's plucking?\n\n               Roberta wheels around to find a girl plucking her violin \n               like a banjo, and doing a little dance. This is LUCY, a skinny \n               Puerto Rican girl in perpetual motion.\n\n                                     ROBERTA\n                         What have I been saying? Put that \n                         away! Back in the case!\n\n               Roberta takes a breath. The kids settle down a bit.\n\n                                     ROBERTA\n                         O.K. Thank you. That's much better.\n                              (takes another breath)\n                         I'll be dividing you into five \n                         classes, but for today --\n\n               ANGLE - A boy plays \"bongos\" on his violin case.\n\n                                     ROBERTA\n                         O.K. -- that's it! You! Stand up!\n\n               The bongo player stands.\n\n                                     ROBERTA\n                         You will be the first student who \n                         will NOT be in my violin class. Out!\n\n               The child looks stunned.\n\n                                     ROBERTA\n                         I said OUT!\n\n               With a sheepish expression, he exits. The room is finally \n               quiet -- and Roberta's amazed that something worked. She \n               puffs up a little bit, enjoying the feeling of control.\n\n                                     ROBERTA\n                         Who else would like to be kicked out \n                         of my class?\n\n               The students stare at her, afraid of her now. DE SEAN, a \n               small but tough Black boy, raises his hand.\n\n                                     ROBERTA\n                         Are you raising your hand because \n                         you want to be kicked out?\n\n                                     DE SEAN\n                         Yeah.\n\n                                     ROBERTA\n                         Why?\n\n                                     DE SEAN\n                         I don't wanna learn no stupid violin. \n                         It's for wimps.\n\n                                     ROBERTA\n                         Who told you that?\n\n                                     DE SEAN\n                         I just know.\n\n                                     ROBERTA\n                         What's your name?\n\n                                     BOY\n                         De Sean.\n\n                                     ROBERTA\n                         Well, De Sean -- you haven't given \n                         me a good enough reason, so you're \n                         staying.\n\n               She looks around the room.\n\n                                     ROBERTA\n                         Anyone else?\n\n               Silence.\n\n               INT. MUSIC ROOM - LATER\n\n               In front of the class, Roberta helps NAEEM, a graceful Black \n               boy, hold the violin. He has a serious expression and a scar \n               on his left cheek. Roberta controls the bow and fingerboard, \n               but it appears that the boy is playing music. He smiles.\n\n                                     NAEEM\n                         Hey, I play pretty good.\n\n               Roberta laughs.\n\n                                     ROBERTA\n                              (to Naeem)\n                         See how easy it is?\n                              (to the class)\n                         Maybe in the spring, we could have a \n                         big concert for your families and \n                         for the whole school.\n                              (to the boy)\n                         What's your name?\n\n                                     NAEEM\n                         Naeem.\n\n               Roberta writes in a notebook and we see that she's measuring \n               for violin sizes.\n\n                                     ROBERTA\n                              (to class)\n                         If you listen to me and do exactly \n                         what I say, you're gonna sound \n                         beautiful at the concert and you're \n                         gonna be so proud of yourselves.\n                              (to Naeem)\n                         Good, Naeem. Your hand's staying \n                         soft.\n                              (to the class)\n                         But if you don't listen to me, you'll \n                         sound so bad that your own parents \n                         will feel sick when they hear you. \n                         They might even throw up.\n\n               ON THE KIDS, not used to a teacher speaking like that.\n\n               INT. BRIAN'S APARTMENT - LIVING ROOM - NIGHT\n\n               A funky apartment on the Upper West Side. Nick and Lexi are \n               both asleep in sleeping bags on top of a futon on the floor, \n               their suitcases nearby. Brian tiptoes past them, carrying \n               two glasses of champagne. He knocks on his office door.\n\n                                     ROBERTA (O.S.)\n                         Come in.\n\n               INT. BRIAN'S APARTMENT - OFFICE - CONTINUOUS\n\n               Roberta's in a bathrobe and nightgown, some rollers in her \n               hair. She's tidying up her suitcase, etc., next to an old \n               couch that's been made up as a bed. Leftist political books \n               line a shelf above Brian's desk, including copies of his \n               own, TO HELL AND BACK: INTERVIEWS WITH VIETNAM VETS by BRIAN \n               TURNER. His desk is covered with files and books pertaining \n               to MIGRANT WORKERS. Brian enters.\n\n                                     ROBERTA\n                              (referring to champagne)\n                         What's this?\n\n                                     BRIAN\n                         It's a toast.\n                              (giving her a glass, \n                              holding his up)\n                         To Roberta, who's made it through \n                         her first week.\n\n               They clink glasses and drink.\n\n                                     ROBERTA\n                         I don't know, Brian. I'm hanging on \n                         by a thread there. Out of fifty kids, \n                         maybe six are listening to me.\n\n                                     BRIAN\n                         Look at the progress. Didn't you say \n                         no one was listening to you on Monday?\n\n               Roberta laughs.\n\n                                     ROBERTA\n                         I really appreciate all you've done \n                         for us. And I promise -- this weekend \n                         I'll start looking for a place.\n\n                                     BRIAN\n                         There's no rush.\n\n                                     ROBERTA\n                         No, we've put you out enough. You're \n                         supposed to be writing, not \n                         babysitting for us.\n                              (crosses to his desk, \n                              flips through his \n                              Vietnam book)\n                         I've started your book. It's very \n                         powerful.\n\n                                     BRIAN\n                         Thank you.\n\n               Brian comes up behind her and starts to kiss her neck. \n               Roberta's scared -- so she keeps talking, as if it's not \n               really happening.\n\n                                     ROBERTA\n                         So what made you choose migrant \n                         workers for your next book? I mean, \n                         how do you know what to write about?\n\n                                     BRIAN\n                              (kissing her neck)\n                         I follow my gut, pay attention to \n                         what I'm being drawn to...\n\n               Roberta's aroused, in spite of herself. She turns around and \n               faces him.\n\n                                     ROBERTA\n                         What are you doing?\n\n                                     BRIAN\n                         I've been waiting to do that since \n                         Mr. Baines' orchestra class.\n\n                                     ROBERTA\n                         You didn't even notice me!\n\n                                     BRIAN\n                         Sure I did. You used to ignore me \n                         and it drove me wild.\n\n                                     ROBERTA\n                         You had at least five different \n                         girlfriends.\n\n                                     BRIAN\n                         It didn't mean I had the one I wanted.\n\n               He gives her a flirtatious smile, then takes out one of her \n               rollers.\n\n                                     BRIAN\n                         You're not a navy wife anymore...\n\n               He moves to takes out another roller and Roberta stops him.\n\n                                     ROBERTA\n                         Yes I am... legally.\n\n                                     BRIAN\n                         And is it a navy requirement that \n                         you dress like it's the 1950's?\n\n                                     ROBERTA\n                         I do not!\n\n                                     BRIAN\n                              (goading her)\n                         Who did you vote for in the last \n                         election?\n\n                                     ROBERTA\n                         What does that have to do with \n                         anything?\n\n                                     BRIAN\n                         Tell me.\n\n                                     ROBERTA\n                              (hesitates, then)\n                         I don't know. Charles filled out my \n                         absentee ballot.\n\n                                     BRIAN\n                         Oh my God -- it's even worse than I \n                         thought!\n                              (touching her hair)\n                         Is this the same Roberta who got the \n                         orchestra to strike until they gave \n                         us new uniforms?\n\n               She laughs wistfully, then looks a little sad.\n\n                                     ROBERTA\n                         That Roberta's not around anymore.\n\n               He pulls her towards him by the belt to her robe.\n\n                                     BRIAN\n                         I don't believe that.\n\n               They kiss and it heats up quickly. Roberta pulls back.\n\n                                     ROBERTA\n                         I shouldn't.\n\n                                     BRIAN\n                         Because?\n\n                                     ROBERTA\n                         The boys --\n\n                                     BRIAN\n                         They're sleeping.\n\n                                     ROBERTA\n                         I know, but... I'm still married.\n\n                                     BRIAN\n                         And what's your husband doing right \n                         now?\n\n               A few beats, and she moves towards him.\n\n               INT. BRIAN'S BEDROOM - DAY\n\n               Sun streams into the room as Roberta awakens in Brian's bed, \n               a look of afterglow on her face. She suddenly remembers where \n               she is, and quickly looks at the clock.\n\n                                     ROBERTA\n                         Oh shit -- the boys.\n\n                                     BRIAN (O.S.)\n                         They're still sleeping.\n\n               She turns, relieved, until she sees that Brian's packing a \n               suitcase.\n\n                                     ROBERTA\n                         Where are you going?\n\n                                     BRIAN\n                         Texas.\n\n               He dashes out. Roberta sits up, rattled by this news.\n\n               INT. BRIAN'S OFFICE - DAY\n\n               Brian excitedly gathers papers and files scattered around \n               his electric typewriter.\n\n                                     ROBERTA (O.S.)\n                         What's in Texas?\n\n               He turns to see Roberta in the doorway.\n\n                                     BRIAN\n                         Farm workers. I just got the call -- \n                         it came through -- my research grant! \n                         It came through! Isn't that great?\n\n                                     ROBERTA\n                         Today?\n\n               He places items into a carry-on bag, packing at a rapid clip. \n               In contrast, Roberta seems to be moving in slow motion.\n\n                                     BRIAN\n                         I've got a few families lined up \n                         there, some in California --\n\n                                     ROBERTA\n                         How long will you be gone?\n\n                                     BRIAN\n                         Two, three months.\n\n                                     ROBERTA\n                         What?\n\n               INT. BRIAN'S BATHROOM - DAY\n\n               Brian throws toiletries into a plastic bag. Roberta enters.\n\n                                     ROBERTA\n                         I thought... I just thought you were \n                         gonna be around. And then last night --\n\n               He stops what he's doing and looks at her.\n\n                                     BRIAN\n                         Whoa. Roberta -- last night was great \n                         but did you think I was gonna marry \n                         you in the morning?\n\n                                     ROBERTA\n                         No! Of course not.\n\n               We see in her face that part of her did think that.\n\n                                     ROBERTA\n                         It's just that... we just got here \n                         and we're barely... I don't even \n                         know where to buy groceries.\n\n               Brian softens as he sees how vulnerable she is. He takes her \n               in his arms.\n\n                                     BRIAN\n                         You're gonna be fine. You have a \n                         job, a place to stay, your kids have \n                         a school to go to -- and there's a \n                         D'Agostino's around the corner.\n\n               She attempts a smile.\n\n                                     ROBERTA\n                         Congratulations.\n\n               He kisses her forehead, then exits. HOLD ON ROBERTA, looking \n               hurt and frightened.\n\n               INT. MUSIC ROOM - DAY\n\n               Roberta rosins her bow, standing in front of ten kids -- \n               third through fifth-grade -- who sit on the floor next to \n               their violin cases. The kids are Black and Latino, with a \n               couple of white faces. They're all talking and ignoring \n               Roberta except for NAEEM and GUADALUPE, a petite Mexican \n               girl with a long dark braid. [NOTE: We'll see other violin \n               students from time to time, but this is the class we'll follow \n               for Roberta's first year]\n\n                                     ROBERTA\n                         And what am I doing now?\n\n                                     NAEEM/GUADALUPE\n                         Rosining the bow.\n\n                                     ROBERTA\n                         Good. And what am I doing when I \n                         turn this little screw?\n                              (raising her voice)\n                         Everyone stop talking. Right now!\n\n               The kids quiet down. Only Naeem raises his hand.\n\n                                     ROBERTA\n                         Naeem?\n\n                                     NAEEM\n                         Tightening the horse hair.\n\n                                     ROBERTA\n                              (touches the heel of \n                              the bow)\n                         And what do we call this?\n\n               Again, only Naeem raises his hand. Roberta sees him but turns \n               to DE SEAN, who's talking to his neighbor.\n\n                                     ROBERTA\n                         De Sean?\n\n                                     DE SEAN\n                         Yeah?\n\n                                     ROBERTA\n                         What do we call this?\n\n                                     DE SEAN\n                         I don't know.\n\n                                     ROBERTA\n                         Why not?\n\n                                     DE SEAN\n                         I wasn't here.\n\n                                     ROBERTA\n                         Yes you were but you weren't paying \n                         attention! Do you want people to \n                         think you're stupid?\n\n               This makes De Sean blush -- and it pisses him off.\n\n                                     ROBERTA\n                         All right, Naeem -- tell them.\n\n                                     NAEEM\n                         It's called the frog.\n\n               Some kids giggle and joke about this. Roberta points to the \n               scroll of the violin.\n\n                                     ROBERTA\n                         Anyone remember what this is?\n\n               LUCY, the fidgety girl, snaps her fingers.\n\n                                     ROBERTA\n                         Lucy! Do you like people snapping \n                         their fingers when you're talking?\n\n                                     LUCY\n                         Yeah!\n\n               The kids laugh. Roberta doesn't. She points to the scroll.\n\n                                     ROBERTA\n                         What is this called?\n\n                                     LUCY\n                         The jeri curl?\n\n               Roberta laughs, even though she's trying to be tough.\n\n               INT. DENNIS' MUSIC CLASSROOM - DAY\n\n               Dennis's twenty students play recorder in rows of attached \n               theatre-style seats. Dennis sits at his desk, a METRONOME \n               ticking, and apathetically leads them in scales, using a red \n               pen as a baton. He keeps one eye on a stack of quizzes that \n               he's marking, stopping to circle mistakes with the pen.\n\n                                     DENNIS\n                         C-C-C-C, D-D-D-D, E-E-E-E...\n\n               ANGLE - Roberta stands in the hallway at the open door, \n               dismayed by Dennis' uninspired teaching. She enters and \n               crosses to Dennis, speaking quietly to him.\n\n                                     ROBERTA\n                         Excuse me -- sorry to interrupt --\n\n               The students immediately start to chatter.\n\n                                     DENNIS\n                         No talking!\n\n               He looks back at Roberta, annoyed by her intrusion.\n\n                                     ROBERTA\n                         I'm supposed to take kids out of \n                         Miss Cooper's classroom for my ten \n                         o'clock class -- there's nobody there.\n\n                                     DENNIS\n                         Miss Cooper's students have phys ed \n                         on Tuesdays.\n\n                                     ROBERTA\n                         But you scheduled them for violin.\n\n                                     DENNIS\n                         You must have read the schedule wrong.\n\n                                     ROBERTA\n                              (trying to remain \n                              polite)\n                         I don't think so.\n\n                                     DENNIS\n                         Well, I can't solve this problem for \n                         you right now.\n                              (nods to his class)\n                         I'm trying to teach.\n\n                                     ROBERTA\n                         So am I.\n\n               She exits.\n\n               INT. BRIAN'S BEDROOM - NIGHT\n\n               Lexi and Nick are in Brian's bed. Roberta's tucking in Lexi; \n               he holds a toy truck with Greek writing on it.\n\n                                     LEXI\n                         Can I bring a puppy for show and \n                         tell tomorrow?\n\n                                     ROBERTA\n                         Honey, we don't have a puppy.\n\n                                     NICK\n                         Daddy said we could get one when we \n                         moved back to America.\n\n               Roberta looks at Nick, then turns back to Lexi.\n\n                                     ROBERTA\n                         How about your truck? I'll bet you're \n                         the only one in school with a truck \n                         from Greece.\n\n                                     NICK\n                         When's Daddy coming back?\n\n               Roberta turns to Nick and tucks him in.\n\n                                     ROBERTA\n                         Well, he's still on his tour, so \n                         we'll just have to see but... It \n                         shouldn't be too much longer.\n\n                                     LEXI\n                         Is he gonna live with us and Brian?\n\n                                     ROBERTA\n                         No, honey. We're just staying at \n                         Brian's house for a little while.\n\n               She turns back to Nick who looks worried. She kisses him.\n\n                                     ROBERTA\n                         Good night, sweetie.\n\n               She kisses Lexi, then reaches to turn off the lamp.\n\n                                     NICK\n                         No! Leave it on.\n\n               Roberta nods, smiles at her sons, and exits.\n\n               INT. MUSIC ROOM - DAY\n\n               Nine children stand, violins under their right arms, bows \n               hanging down from their right hands, and try to position \n               their feet as Roberta addresses them.\n\n                                     ROBERTA\n                         Now take the right foot and put it \n                         on a tile. Good. Now with the other \n                         foot take a tiny step forward and \n                         put it on a line. Try to make a box \n                         with your feet --\n\n               She walks over to BENJAMIN, a white boy with glasses, and \n               corrects his feet. She sees Lucy dancing in place.\n\n                                     ROBERTA\n                         Lucy! Would you like to leave the \n                         class right now?\n\n               Lucy nods, giggling. Roberta walks down the row of students.\n\n                                     ROBERTA\n                         You should feel very strong -- so \n                         strong and balanced that if I wanted \n                         to knock you over I couldn't.\n\n               She crosses to TANISHA, a sweet-natured Black girl with her \n               hair in tiny braids, and gently pushes her belly.\n\n                                     ROBERTA\n                         You see? If you're standing strong, \n                         I can't even push you.\n\n               Roberta turns to De Sean, who's talking to JAMES, a pudgy \n               Black/Puerto Rican boy.\n\n                                     ROBERTA\n                         De Sean! James! Quiet!\n                              (as she crosses to \n                              another student)\n                         Does anyone know where Naeem is?\n\n                                     TANISHA\n                         I saw him this morning but he's not \n                         here.\n\n                                     ROBERTA\n                         Yes, I know he's not here -- that's \n                         why I'm asking.\n\n               She gently pushes Guadalupe's belly. The girl stumbles back.\n\n                                     ROBERTA\n                         See how I pushed you? It means your \n                         feet aren't centered.\n\n               Guadalupe tries to correct her feet. Roberta bends down to \n               help and sees that the little girl wears LEG BRACES under \n               her pants. Roberta stands and gestures to one of the boys.\n\n                                     ROBERTA\n                         Can you bring over a chair?\n                              (to Guadalupe)\n                         It's probably better for you to sit.\n\n               The boy brings the chair. Guadalupe sits, embarrassed.\n\n               EXT. SCHOOL YARD - DAY\n\n               Roberta walks through a school yard filled with kids and \n               parents picking them up. She sees Naeem and crosses to him.\n\n                                     ROBERTA\n                         Where were you today, Naeem?\n\n                                     NAEEM\n                         I can't be in violin class anymore.\n\n                                     ROBERTA\n                         Why not?\n\n                                     NAEEM\n                         My mother won't let me.\n\n                                     ROBERTA\n                         What?\n\n               NAEEM'S MOTHER, MRS. ADISA, steps INTO FRAME. She's an \n               attractive Black woman in a dress and head scarf made of \n               African fabric.\n\n                                     MRS. ADISA\n                         My son's got more important things \n                         to do than learn dead white men's \n                         music.\n\n                                     ROBERTA\n                         They're gonna learn \"Twinkle Twinkle \n                         Little Star\"!\n\n                                     MRS. ADISA\n                         How many Black classical composers \n                         can you name? How many Black classical \n                         violinists do you know?\n\n                                     ROBERTA\n                         That doesn't mean it's the way it \n                         should be. Naeem's learning to play \n                         music -- and that makes him feel \n                         good about himself. Why should it \n                         matter who wrote it?\n\n                                     NAEEM\n                         Please, Mom? Can't I be in the class?\n\n               Mrs. Adisa puts a protective arm around her son, then \n               addresses Roberta.\n\n                                     MRS. ADISA\n                         Look. I've seen this before. You \n                         white women come up here and think \n                         you can rescue our poor inner city \n                         children who never asked to be rescued \n                         in the first place. No thank you.\n\n               She walks off with Naeem. He glances back at Roberta, then \n               turns away quickly. Roberta watches after them.\n\n               INT. BRIAN'S LIVING ROOM - NIGHT\n\n               Roberta attempts to read Brian's book, To Hell and Back: \n               Interviews with Vietnam Vets, but she's distracted. She \n               glances at her purse, then back to the book. She puts the \n               book down and dials the phone.\n\n                                     ROBERTA\n                         Brian Turner's room, please.\n\n               While she waits, she looks at Brian's picture on the book \n               jacket. There's no answer and she hangs up. She starts to \n               straighten the already clean room, then gets her purse, takes \n               out her wallet, and opens it to the plastic covered pictures.\n\n               INSERT - PICTURES\n\n               Charles in uniform; a studio shot of the boys when they were \n               3 and 1; the whole family posed on the terrace of their home \n               in Greece, a view of the ocean behind them.\n\n               BACK TO ROBERTA\n\n               She's really depressed herself now.\n\n               INT. CLASSROOM - DAY\n\n               ALICE CROWLEY (50's), a no-nonsense Black teacher, shows her \n               fifth-graders a globe. She doesn't turn as Roberta enters \n               and crosses to her. In the b.g. we see ROBERTA'S STUDENTS \n               waiting in THE HALL.\n\n                                     ALICE\n                         And which ocean is this?\n\n               Kids simultaneously yell out \"ATLANTIC\" and \"PACIFIC.\"\n\n                                     ROBERTA\n                         Excuse me... I'm here for the violin \n                         students.\n\n                                     ALICE\n                              (icy)\n                         You're late.\n\n                                     ROBERTA\n                         Just a couple of minutes -- I'm sorry.\n\n                                     ALICE\n                         They're having a lesson now.\n\n                                     ROBERTA\n                         But this is when they have violin \n                         class!\n\n                                     ALICE\n                         That's not my problem.\n\n               Roberta's reluctant to argue in front of the kids; she exits.\n\n               EXT. SCHOOL YARD - DAY\n\n               Lots of noise and chaos as kids run wild during lunch recess. \n               Janet rushes through the throngs while Roberta tries to keep \n               up.\n\n                                     ROBERTA\n                         I thought all the teachers agreed to \n                         this.\n\n                                     JANET\n                         In theory.\n                              (to a student)\n                         Adam! I want you in my office right \n                         after lunch, you understand?\n\n                                     ADAM\n                         What'd I do?\n\n                                     JANET\n                         Think about it!\n                              (to Roberta)\n                         Whenever you pull kids out, it's a \n                         disruption, plus it's extra work for \n                         the teacher 'cause they have to fill \n                         the kids in on what they missed. \n                         Some teachers resent it.\n\n                                     ROBERTA\n                         Well, can't you talk to them?\n\n               Janet stops walking and pulls a box cutter out of her pocket.\n\n                                     JANET\n                         I took this off a second-grader this \n                         morning. I'll help you Roberta -- \n                         but I can't hold your hand here.\n\n               Janet starts to walk away, then turns.\n\n                                     JANET\n                         A word of advice? When you're picking \n                         up your students, go to Alice's \n                         classroom first.\n\n               Roberta stands there as Janet walks on ahead.\n\n               INT. MUSIC ROOM - DAY\n\n               The nine children hold their violins in position as Roberta \n               addresses them.\n\n                                     ROBERTA\n                         So pretend you're driving a car and \n                         I'm the policeman and I say STOP! \n                         Thumb up, fingers straight up, flat \n                         palm. Now you be policemen, but turn \n                         your hand and make it say stop to \n                         yourself.\n\n               ON THE CHILDREN, attempting this. She walks around and helps.\n\n                                     DE SEAN\n                              (to himself)\n                         You're under arrest.\n\n               Some kids crack up and start joking and chatting.\n\n                                     ROBERTA\n                         Knock it off, De Sean!\n                              (to all)\n                         If you kids can't take this seriously, \n                         I don't want you here. I'm teaching \n                         you a difficult instrument because I \n                         respect you and have faith that you \n                         can learn it. But none of that matters \n                         if you don't have respect for \n                         yourself.\n\n               Some of the children think about what she's saying. A couple, \n               uncomfortable with the intensity, hold back giggles.\n\n                                     ROBERTA\n                         Now turn your wrist so it's flat \n                         against the fingerboard, and that's \n                         how you'll set up your hand...\n\n               Roberta sees Guadalupe struggling.\n\n                                     ROBERTA\n                         Guadalupe! You've got the violin in \n                         the wrong hand! How did that happen?\n\n               Embarrassed, Guadalupe corrects her position.\n\n               INT. BRIAN'S KITCHEN - NIGHT\n\n               At the small kitchen table, Nick does homework and Lexi puts \n               stickers in a sticker book. Roberta's cooking dinner; she \n               grabs a potholder and checks on a bubbling lasagna in the \n               oven. The PHONE RINGS and she answers it.\n\n                                     ROBERTA\n                         Hello?\n\n                                     CHARLES (O.S.)\n                         Hello, Bobbi.\n\n               Her face falls as she hears the voice. She holds onto the \n               counter to steady herself.\n\n                                     ROBERTA\n                         Where are you?\n\n                                     CHARLES (O.S.)\n                              (calm, detached)\n                         I'm back in the States. I'm at my \n                         parents.\n\n               Roberta closes the oven and gathers her courage.\n\n                                     ROBERTA\n                         Are you still with her?\n\n               A beat.\n\n                                     CHARLES (O.S.)\n                         No.\n\n               We watch Roberta's body collapse into a sense of overwhelming \n               relief. FOLLOW HER as she steps into THE HALLWAY, then \n               stretches the phone into:\n\n               INT. BRIAN'S BATHROOM - CONTINUOUS\n\n               She half-closes the door, leans against the sink and starts \n               to cry.\n\n                                     ROBERTA\n                              (through tears)\n                         We've missed you so much, Charles. \n                         The boys... they can't wait for you \n                         to come home... I know we'll have a \n                         lot to work out and it won't be easy \n                         right away, but we're gonna get \n                         through this, you know? We're a family \n                         and we belong together and --\n\n                                     CHARLES (O.S.)\n                              (more emotive than \n                              before)\n                         Bobbi -- stop, O.K.? Just stop.\n\n               Roberta looks as if she's been slapped. A beat.\n\n                                     CHARLES (O.S.)\n                         I want a divorce.\n\n                                     ROBERTA\n                         What?\n\n               Silence.\n\n                                     ROBERTA\n                         But you said... you and Lana... you \n                         said it was over.\n\n                                     CHARLES (O.S.)\n                         It is.\n                              (beat)\n                         It's over between us too, Bobbi.\n\n               HOLD ON ROBERTA, devastated. ANGLE on NICK, watching her \n               through the door.\n\n               INT. BRIAN'S HOTEL ROOM, TEXAS - NIGHT\n\n               Brian's on the phone with Roberta. He's in a t-shirt and \n               sweats, and his papers are scattered on the bed.\n\n                                     ROBERTA (O.S.)\n                         He wouldn't even talk about it! No \n                         explanations, no discussion...\n\n               INTERCUT\n\n               Roberta in Brian's living room. She's extremely agitated and \n               her eyes are puffy from crying.\n\n                                     BRIAN\n                         I can't believe you were still holding \n                         out hope. The guy hasn't called you \n                         or the kids in three months -- I \n                         thought you'd moved on.\n\n                                     ROBERTA\n                         I never said that.\n\n                                     BRIAN\n                         No? Maybe not with words.\n\n               This embarrasses her, then pisses her off.\n\n                                     ROBERTA\n                         You know what? I shouldn't have called \n                         you. This was a mistake.\n\n                                     BRIAN\n                         No, no -- I'm sorry. Look, I know it \n                         hurts, but you're gonna get through \n                         this, Roberta -- you will.\n\n                                     ROBERTA\n                         I'm moving back to my Mom's.\n\n                                     BRIAN\n                         What? You're gonna quit teaching in \n                         the middle of the term?\n\n                                     ROBERTA\n                         I don't fit in there -- I'm not making \n                         any progress with the kids...\n\n                                     BRIAN\n                         What are you gonna tell Janet -- \n                         your husband left you and nothing \n                         else matters?\n\n                                     ROBERTA\n                         I don't know yet.\n\n               INT. BRIAN'S LIVING ROOM - NIGHT\n\n               Roberta lies awake on the futon, heartbroken.\n\n               INT. BRIAN'S BEDROOM - NIGHT\n\n               Roberta stands and watches Nick and Lexi sleep. She lies \n               down beside them and closes her eyes.\n\n               INT. SCHOOL HALLWAY - DAY\n\n               Roberta walks through crowds of kids towards Janet who's in \n               the middle of confronting a boy student. Janet holds a FIFTY-\n               DOLLAR BILL. Roberta hangs back and waits for a chance to \n               speak.\n\n                                     BOY\n                         My mother gave it to me.\n\n                                     JANET\n                         Why would she give you fifty dollars?\n\n                                     BOY\n                         To buy breakfast.\n\n               Janet gives him a stern look.\n\n                                     JANET\n                         Do you know how hard your mother \n                         works? Do you think it's right for \n                         you steal from her?\n\n                                     BOY\n                         I didn't!\n\n                                     JANET\n                         Well let's go call her right now and \n                         ask her.\n\n               As Janet turns to walk off, Roberta crosses to her.\n\n                                     ROBERTA\n                         I need to speak to you. It's \n                         important.\n\n                                     JANET\n                         It'll have to wait.\n                              (to the boy)\n                         Come on. In my office.\n\n               Roberta watches as Janet dashes off with the boy in tow.\n\n               INT. MUSIC ROOM - DAY\n\n               Guadalupe sits on a chair in the empty room, struggling to \n               set up her violin. Roberta enters, surprised to see her.\n\n                                     ROBERTA\n                         Guadalupe? What are you doing here?\n\n                                     GUADALUPE\n                         I can't get the stop sign.\n\n                                     ROBERTA\n                         Honey, your teacher's probably looking \n                         for you.\n\n               Guadalupe sighs, then hands Roberta the violin.\n\n                                     GUADALUPE\n                         I can't come anymore. It's too hard.\n\n                                     ROBERTA\n                         The violin is hard for everyone.\n\n                                     GUADALUPE\n                         But everyone else is better than me. \n                         I'll always be slow.\n\n               Roberta looks at her sadly and puts the violin in its case.\n\n                                     ROBERTA\n                         Did you ever hear of Itzhak Perlman?\n\n                                     GUADALUPE\n                         No.\n\n                                     ROBERTA\n                         He's one of the greatest violinists \n                         in the world, and he has problems \n                         with his legs too. He walks with two \n                         canes -- but he still makes the most \n                         beautiful music.\n\n                                     GUADALUPE\n                         And he sits down when he plays?\n\n                                     ROBERTA\n                         He has to.\n\n               Guadalupe takes this in.\n\n                                     GUADALUPE\n                         He was your student?\n\n               Roberta laughs.\n\n                                     ROBERTA\n                         No. But if he was, I'd tell him the \n                         same thing I'm telling you. You \n                         shouldn't quit something just because \n                         it's hard.\n\n                                     GUADALUPE\n                         But I can't stand strong.\n\n                                     ROBERTA\n                         Standing strong doesn't only mean \n                         using your legs. You can stand strong \n                         on the inside too.\n                              (beat)\n                         Know what I mean?\n\n               Guadalupe nods. Roberta holds out the violin case. Guadalupe \n               lunges forward and hugs her around the waist. Roberta \n               awkwardly accepts the hug, startled and touched by it, and \n               strokes the girl's hair. Guadalupe lets go, takes the violin \n               and exits. HOLD ON ROBERTA as she absorbs what just happened. \n               JANET pokes her head into the room.\n\n                                     JANET\n                         You wanted to speak to me?\n\n                                     ROBERTA\n                         Oh. Umm -- that's O.K. It's taken \n                         care of.\n\n               Janet looks at her curiously, then exits.\n\n               INT. EMPTY APARTMENT - EAST HARLEM - DAY\n\n               Roberta walks around an empty, rundown apartment, her \n               expression somber. Crayon markings on the walls, cigarette \n               burns on the floors, a filthy bathroom and kitchen. An older \n               Puerto Rican woman stands back as Roberta inspects the place. \n               Roberta wipes grease off one of the windows.\n\n                                     LANDLADY\n                         Is just for you and your boys?\n\n                                     ROBERTA\n                         Yes.\n\n                                     LANDLADY\n                         No husband? No boyfriend?\n\n               A beat.\n\n                                     ROBERTA\n                         No.\n\n               EXT. SCHOOL YARD - LUNCH RECESS - DAY\n\n               Roberta enters the yard from inside the school. It's filled \n               with kids playing, including Nick and Lexi. She waves to \n               them and Lexi runs up to her, carrying a piece of artwork.\n\n                                     LEXI\n                         Look what I made you, Mommy!\n\n               He gives her a tempera PAINTING of a man's face, the \n               background decorated with glued-on macaroni. It says DADDY.\n\n                                     ROBERTA\n                              (covering her \n                              discomfort)\n                         That is so beautiful!\n\n               He runs off. Roberta exhales, sits down alone on a bench and \n               takes out her lunch. She smiles at ALICE CROWLEY and another \n               TEACHER but they cross to another bench. ISABEL VASQUEZ (25) \n               approaches, a lively Puerto Rican woman with a strong New \n               York accent.\n\n                                     ISABEL\n                         Whatsa matter -- you got cooties?\n\n                                     ROBERTA\n                         Apparently.\n\n                                     ISABEL\n                         I'll take my chances.\n                              (extends a hand)\n                         Isabel Vasquez. Second grade.\n\n                                     ROBERTA\n                         Roberta Demetras. I'm the --\n\n                                     ISABEL\n                         Violin teacher. I know.\n\n               She sits down beside Roberta, takes out her lunch.\n\n                                     ROBERTA\n                         Is it my imagination, or does everyone \n                         hate me?\n\n                                     ISABEL\n                         It's hard to fit in when you're doing \n                         a special program. People figure \n                         you're not gonna be here very long, \n                         so why make the effort?\n                              (beat)\n                         It may take a while for folks to \n                         warm up, but nobody hates you.\n\n                                     ROBERTA\n                              (sotto)\n                         What about Alice Crowley?\n\n                                     ISABEL\n                              (sotto)\n                         A) she thinks the violin's a waste \n                         of time... and B) -- she's a bitch.\n\n               Roberta laughs.\n\n                                     ROBERTA\n                         And then there's Dennis.\n\n                                     ISABEL\n                         The Music Man. You've had the bodacity \n                         to threaten his private little empire -- \n                         not to mention the fact that you \n                         messed up his sacred scheduling chart.\n\n                                     ROBERTA\n                         How come you're being nice to me?\n\n                                     ISABEL\n                         Ulterior motives. I want my daughter \n                         in your class next year.\n\n               Roberta smiles.\n\n                                     ROBERTA\n                         If I'm here next year.\n\n                                     ISABEL\n                         You will be.\n\n               INT. ROBERTA'S NEW APARTMENT - LIVING ROOM - NIGHT\n\n               LEXI'S PAINTING is on the wall, along with a crayon drawing \n               of himself, Roberta, and Nick in front of a house.\n\n               ANGLE - ROBERTA looks out the window. She's gotten some used \n               furniture, cleaned the place, and it's less depressing.\n\n               ROBERTA'S POV OUT THE WINDOW\n\n               On the street below, three prostitutes stand at the corner. \n               Two men sit on a stoop, smoking a joint, and in a parked \n               car, three men seem to be making a drug deal. One of the \n               buildings on the street is burned out, missing a front door.\n\n               BACK TO SCENE\n\n               Nick, in his pajamas, enters and crosses to his mother. She \n               smiles at him and they both look out the window.\n\n                                     NICK\n                         In Greece, we could see the ocean. \n                         Remember?\n\n                                     ROBERTA\n                         I remember. And the fishing boats...\n\n                                     NICK\n                         And the octopuses.\n\n               Roberta smiles and puts her arm around him.\n\n                                     NICK\n                         Is Daddy coming here soon?\n\n               Roberta tenses up.\n\n                                     ROBERTA\n                         Well, that's something I've been \n                         wanting to talk to you about. Daddy's \n                         not gonna live with us anymore. You \n                         and Lexi will have special times \n                         when you stay with him, like at \n                         Christmas.\n\n               A beat.\n\n                                     NICK\n                         Can you tell the birthday story?\n\n               Roberta looks at him, concerned that he's not responding to \n               her news.\n\n                                     ROBERTA\n                         Don't you want to talk about what I \n                         told you?\n\n                                     NICK\n                         I want to hear the birthday story.\n\n               A beat as she contemplates whether to push or not, then:\n\n                                     ROBERTA\n                         It was the day of Grandpa's birthday, \n                         and I was sad because he had died a \n                         few months back.\n\n                                     NICK\n                         But you knew I'd be born that day.\n\n                                     ROBERTA\n                         So I packed a bag and got all ready --\n\n                                     NICK\n                         And Daddy laughed.\n\n                                     ROBERTA\n                         I said, \"It's my father's birthday, \n                         and the baby's gonna be born today.\"\n\n                                     NICK\n                         He didn't believe you. But I was \n                         born. The same day as Grandpa.\n\n                                     ROBERTA\n                         It was a happy day.\n\n                                     NICK\n                         Was Daddy happy too?\n\n               She looks at him, taken aback by the question.\n\n                                     ROBERTA\n                         Of course he was.\n\n                                     NICK\n                         Then why is he leaving me?\n\n               Roberta, overcome with emotion, can barely answer.\n\n                                     ROBERTA\n                         He's not leaving you, Nick. He loves \n                         you and Lexi very much.\n\n                                     NICK\n                         Then why can't he live here?\n\n                                     ROBERTA\n                              (struggling)\n                         It's very hard to explain... Sometimes \n                         things happen between grown-ups... \n                         and they just can't be together.\n\n               The CAMERA moves behind them as they continue to look out \n               the window, and we see Nick move away from his mother.\n\n               INT. MUSIC ROOM - DAY\n\n               The kids play \"Twinkle Twinkle Little Star\" and they sound \n               awful. Roberta looks disgusted as she leads them.\n\n                                     ROBERTA\n                         Slow bows! Slow bows! Don't squeeze! \n                         Stop! Everybody stop!\n                              (to De Sean)\n                         How much did you practice this week?\n\n                                     DE SEAN\n                         My asthma -- it was very bad and I \n                         had to go to the hospital.\n\n                                     ROBERTA\n                         Again? You told me you went to the \n                         hospital last week.\n\n                                     DE SEAN\n                         Oh yeah. Maybe it was last week.\n\n               Roberta rolls her eyes, then turns to Lucy.\n\n                                     ROBERTA\n                         Lucy -- you sounded the worst of \n                         all. Have you practiced?\n\n                                     LUCY\n                         No.\n\n                                     ROBERTA\n                         Why not? You can't be in this class \n                         if you don't practice!\n\n                                     LUCY\n                         My grandma got mugged.\n\n               A beat.\n\n                                     ROBERTA\n                         Oh. I'm sorry. Is she O.K.?\n\n                                     LUCY\n                         She died.\n\n               Roberta stands there, sobered.\n\n                                     ROBERTA\n                         I'm really sorry, Lucy.\n                              (tries to get her \n                              bearings)\n                         Just do the best you can.\n\n               EXT. SCHOOL YARD - DAY\n\n               A group of kids stand together with their violins and chat. \n               Roberta exits the building and they greet her. She waves \n               back, but she's clearly still upset by her interaction with \n               Lucy. She sees Naeem and his mother and approaches them.\n\n                                     NAEEM\n                         Hi, Roberta.\n\n                                     ROBERTA\n                         Hi, Naeem. Can I talk to your mom \n                         for a minute?\n\n               Naeem nods and moves off.\n\n                                     ROBERTA\n                         Look, I didn't come up here to rescue \n                         anybody. I'm a single mother and I \n                         needed a job. And I know you think \n                         you're protecting your son, but you're \n                         not. I mean, what if Arthur Ashe's \n                         mother had stopped him from playing \n                         tennis because it's a \"white man's \n                         game\"?\n                              (beat)\n                         The important thing is that when \n                         Naeem plays music, his whole face \n                         lights up. You should see him.\n\n               Mrs. Adisa takes this in. Roberta exits. Mrs. Adisa looks \n               for Naeem and sees him watching the violin students, longing \n               to be among them. She watches her son with compassion.\n\n               EXT. OUTDOOR MARKET - DAY\n\n               Roberta and the boys shop in a colorful outdoor produce market \n               in their neighborhood.\n\n               The boys suddenly rush over to A MAN sitting on the ground \n               with mixed-breed PUPPIES in a cardboard box. The boys pet \n               them excitedly. Roberta watches her sons; they're happier \n               than she's seen them in ages.\n\n               INT. ROBERTA'S APARTMENT - LIVING ROOM - NIGHT\n\n               A brown puppy is jumping all over Nick and Lexi who laugh \n               delightedly. Roberta is putting down newspapers.\n\n                                     ROBERTA\n                         We all have to take turns cleaning \n                         up, O.K.?\n\n               The boys are oblivious to her -- they're in heaven.\n\n                                     ROBERTA\n                              (to herself)\n                         Yeah, right.\n\n               INT. MUSIC ROOM - DAY\n\n               Roberta's SCREAMING at the kids as they play \"Twinkle Twinkle \n               Little Star.\"\n\n                                     ROBERTA\n                         First finger on the E! Three -- two -- \n                         one -- open!\n                              (to a white girl with \n                              pigtails)\n                         Wrong string, Becky! We've done this \n                         fourteen times! And look at your \n                         nails! You're supposed to cut them \n                         for violin class! O.K, everybody \n                         stop! It sounds horrible! I can't \n                         believe how bad it sounds!\n\n               They stop playing. Tanisha raises her hand.\n\n                                     ROBERTA\n                         Is this an important question, \n                         Tanisha?\n\n               Tanisha nods.\n\n                                     TANISHA\n                         Do you have two of those skirts?\n\n                                     ROBERTA\n                         What?\n\n                                     TANISHA\n                         You wore a skirt just like it on \n                         Monday.\n\n               Some of the kids crack up.\n\n                                     ROBERTA\n                         You know, Tanisha -- I don't think \n                         that's such an important question.\n                              (to class)\n                         O.K. Let's try --\n\n               The door opens and Naeem enters with Mrs. Adisa. Roberta \n               crosses to them.\n\n                                     MRS. ADISA\n                         Naeem and I were wondering if he \n                         could still be in the class.\n\n               A beat.\n\n                                     ROBERTA\n                         I'd love that.\n                              (to Naeem)\n                         You'll have a lot of catching up to \n                         do. You think you can work that hard?\n\n                                     NAEEM\n                         Yeah, I can.\n\n                                     ROBERTA\n                         Maybe we can also arrange some private \n                         lessons at my house.\n\n                                     MRS. ADISA\n                         I wouldn't have the money for that.\n\n                                     ROBERTA\n                         That's O.K.\n                              (to Naeem)\n                         Why don't you go grab one of my spare \n                         violins?\n\n               Naeem happily runs to the extra violins at the front of the \n               room; Mrs. Adisa nods to Roberta with a look of gratitude, \n               then exits. Roberta crosses back to the front of the room.\n\n                                     ROBERTA\n                              (to class)\n                         Let's try it again.\n\n               They begin again, and we see Naeem take out a violin and \n               join in. As they play, Roberta's ears perk up at something \n               she's hearing. She crosses to Lucy.\n\n                                     ROBERTA\n                         What are you playing?\n\n                                     LUCY\n                         Twinkle.\n\n                                     ROBERTA\n                              (to class)\n                         Everyone stop!\n                              (to Lucy)\n                         Let me hear.\n\n               Lucy hesitates, thinking she's in trouble. She plays a jazz \n               variation of the song. Roberta smiles.\n\n                                     ROBERTA\n                         Did someone teach you that?\n\n                                     LUCY\n                         No. I made it up.\n\n                                     ROBERTA\n                         That's really great, Lucy. I'm proud \n                         of you.\n\n               Lucy beams.\n\n                                     ROBERTA\n                              (to class)\n                         All of you -- try it.\n\n               The class plays Lucy's jazz variation and Naeem happily joins \n               in.\n\n               INT. JANET WILLIAMS' OFFICE - DAY\n\n               Roberta sits opposite Janet and MRS. LAMB, a white woman in \n               her 30's.\n\n                                     MRS. LAMB\n                         You're shouting at them. All the \n                         time.\n\n                                     ROBERTA\n                         Not all the time. But if they don't \n                         listen --\n\n                                     MRS. LAMB\n                         Didn't you tell them that they were \n                         making their parents sick?\n\n               Janet raises her eyebrows at this.\n\n                                     ROBERTA\n                         That wasn't exactly what I said --\n\n                                     MRS. LAMB\n                         I'm raising Becky in a supportive \n                         atmosphere. I don't send her to school \n                         to be abused.\n\n                                     ROBERTA\n                         I'm just trying to discipline them. \n                         If they're gonna learn an instrument, \n                         they need to take it seriously --\n\n                                     JANET\n                         I think what Mrs. Lamb is trying to \n                         say, Roberta, is that you're a little \n                         too harsh. I'm sure you might be \n                         able to soften some of your comments \n                         to the children?\n\n               She gives Roberta a long hard look. Roberta nods.\n\n               INT. MUSIC ROOM - DAY\n\n               Roberta listens to the students play \"Go Tell Aunt Rhody\" -- \n               badly. They finish and stare at her, afraid of her response.\n\n                                     ROBERTA\n                         Well, that was... that was pretty \n                         good... that wasn't too bad...\n\n               They look at her in disbelief, then look at each other.\n\n                                     DE SEAN\n                         It wasn't? I thought we stunk.\n\n                                     ROBERTA\n                         I wouldn't put it that way... You \n                         all just need to practice a bit more.\n                              (to James)\n                         James, have you practiced this week?\n\n               The boy nervously shakes his head no.\n\n                                     ROBERTA\n                         Can you please try a little harder \n                         for next week?\n\n               James nods. The kids are baffled by her politeness.\n\n                                     ROBERTA\n                         Good. Just do the best you can.\n\n                                     DE SEAN\n                         Why you acting like that?\n\n                                     ROBERTA\n                         Like what?\n\n                                     DE SEAN\n                         Nice.\n\n                                     ROBERTA\n                         Don't you want a nice teacher?\n\n                                     DE SEAN\n                         I already got nice teachers. You \n                         added some variety.\n\n                                     LUCY\n                         Yeah. We like you better the way you \n                         used to be.\n\n                                     ROBERTA\n                         Oh.\n                              (to Becky)\n                         What about you, Becky?\n\n                                     BECKY\n                         Yeah. This is even worse. You're \n                         acting weird now.\n\n               A beat.\n\n                                     ROBERTA\n                         Well, then -- I take it back. You \n                         all stunk.\n\n               The kids laugh.\n\n                                     ROBERTA\n                         But don't tell your parents I said \n                         so!\n\n               The kids laugh again.\n\n               INT. KENNEDY AIRPORT - DEPARTURE GATE - DAY\n\n               Christmas MUZAK plays in the b.g. as Roberta kisses and hugs \n               Lexi and Nick goodbye. A FLIGHT ATTENDANT stands nearby.\n\n                                     LEXI\n                         Can't you come with us? Please?\n\n                                     ROBERTA\n                         Honey, I told you. This is Daddy's \n                         special time with you.\n\n               Lexi looks upset; Nick is stoic. Roberta hugs them one last \n               time. The FLIGHT ATTENDANT steps forward.\n\n                                     FLIGHT ATTENDANT\n                         I'll take good care of them.\n\n               The FLIGHT ATTENDANT escorts them into the jet way. Roberta \n               holds back tears as they get further away from her. At the \n               last moment, Lexi turns and waves; Nick does not. Roberta \n               waves, tears starting to fall, and the boys disappear from \n               sight. She observes all the families travelling together, \n               and feels like the loneliest person in the airport.\n\n               INT. ROBERTA'S APARTMENT - LIVING ROOM - NIGHT\n\n               Roberta enters her apartment, back from the airport, and \n               double-locks the door behind her. You can see on her face \n               that she's dreading the emptiness. She crosses to a small \n               Christmas tree, obviously decorated by her and the boys, and \n               plugs in the tiny blinking lights. It's not exactly \n               Rockefeller Center. She turns on the T.V., playing IT'S A \n               WONDERFUL LIFE.\n\n               She crosses to the kitchen, then returns with a carton of \n               eggnog, a glass, and a bottle of rum. She sits down on the \n               couch, pours herself some eggnog, adds rum, adds more rum, \n               goes back into the kitchen, returns with nutmeg, sprinkles \n               some on top, then drinks. She sighs, glancing miserably at \n               the tree and the T.V. Pathetic. She couldn't look any less \n               festive if she tried. There's a KNOCK on the DOOR.\n\n               Roberta gets up and warily approaches the door.\n\n                                     ROBERTA\n                         Who is it?\n\n                                     BRIAN (O.S.)\n                         Santa Claus.\n\n               She looks through the peephole, then quickly unlocks the \n               door and opens it, revealing BRIAN, giving her a big smile.\n\n               He looks sexy as hell (even with a silly lit-up Santa Claus \n               pin on his leather jacket), and he holds a long-stemmed red \n               rose in one hand, and a Christmas present in the other.\n\n                                     BRIAN\n                         I'm back.\n\n               Roberta's thrilled and relieved to see him. She embraces \n               him, and they kiss passionately.\n\n               INT. BROWNSTONE - DAY (TIME CUT - TWO MONTHS LATER)\n\n               CLOSE ON plaster walls being knocked down with sledgehammers. \n               REVEAL Brian, Roberta, and a couple of workmen knocking down \n               the walls in an old brownstone.\n\n               EXT. BROWNSTONE - EAST HARLEM - THE SAME DAY\n\n               A mild winter day. Roberta, covered with plaster dust and \n               overheated from working, leans against a car and drinks a \n               beer. The three-story brick building has some graffiti on it \n               and is badly in need of a paint job; there are a few broken \n               windows, and the front stairs need repairing. WORKMEN file \n               in and out. We can see from the STREET SIGNS that we're on \n               118th STREET, a few houses off FIRST AVENUE.\n\n               Brian (also dust-covered), Nick and Lexi toss around a \n               football. LAWRENCE (6), a Black boy who lives next door, \n               joins them. Brian crosses to Roberta, sweaty and out of \n               breath. He takes a swig of her beer.\n\n                                     ROBERTA\n                         O.K., enough goofing off -- back to \n                         work.\n\n                                     BRIAN\n                         You trying to kill me?\n\n               She laughs and they kiss.\n\n               ASSUNTA comes up the street with a bag of take-out food. She \n               casts a dubious glance at the lovers.\n\n                                     ASSUNTA\n                         I was the only person in the whole \n                         coffee shop not speaking Spanish.\n\n               Roberta rolls her eyes. O.S. a car BACKFIRES.\n\n                                     ASSUNTA\n                         You hear that? Gunshots! How you \n                         gonna live here by yourself?\n                              (calling)\n                         Boys, come eat!\n\n                                     ROBERTA\n                         I work in this neighborhood, Mama. I \n                         want to live here.\n\n               The boys approach and Assunta hands them sandwiches. Lawrence \n               hangs back. Assunta calls to him.\n\n                                     ASSUNTA\n                         What's your name?\n\n                                     LAWRENCE\n                         Lawrence.\n\n                                     ASSUNTA\n                         You hungry, Lawrence?\n\n               Lawrence nods and she hands him a sandwich. Roberta smiles \n               at her mother's gesture. The kids move off to Lawrence's \n               front steps and Assunta gives Roberta and Brian sandwiches.\n\n                                     ASSUNTA\n                              (to Brian)\n                         Why did you let her buy this house?\n\n                                     BRIAN\n                         Hey, your daughter does what she \n                         wants -- or haven't you noticed?\n\n                                     ASSUNTA\n                         I've noticed.\n\n               INT. ROBERTA'S APARTMENT - KITCHEN - DAY\n\n               Robert washes dishes and Assunta dries. The leftovers from \n               an Italian dinner are on the counter.\n\n                                     ASSUNTA\n                         I still don't understand the rush.\n\n                                     ROBERTA\n                         Having my own place will make me \n                         feel like I'm really starting my \n                         life again.\n\n                                     ASSUNTA\n                         But if you invested your divorce \n                         settlement, you could buy something \n                         nice someday. It's bad enough that \n                         you've been renting in this \n                         neighborhood, but to lock yourself \n                         into a mortgage --\n\n                                     ROBERTA\n                              (snapping)\n                         Mama, please. Just stop!\n\n               Assunta backs off. Roberta feels guilty and moves to her.\n\n                                     ROBERTA\n                         Don't worry, O.K.? Besides, if things \n                         keep going well, I'm sure eventually \n                         Brian will move in with us.\n\n               A few beats.\n\n                                     ASSUNTA\n                         How much do you know about this man?\n\n                                     ROBERTA\n                         Brian's a good person, he's helped \n                         me a lot, he's great with the boys -- \n                         since he got back to town, it's been \n                         really sweet.\n\n                                     ASSUNTA\n                              (with an attitude)\n                         And how long has he been back?\n\n                                     ROBERTA\n                         Two months.\n\n                                     ASSUNTA\n                         That's not very long. Don't make the \n                         same mistake twice, Bert. You barely \n                         knew Charles when you married him.\n\n                                     ROBERTA\n                              (defensive)\n                         I don't get it -- you're ragging on \n                         me about buying the house -- I would \n                         think you'd want Brian to live with \n                         me.\n\n                                     ASSUNTA\n                         Not if he's the wrong person.\n\n               Roberta locks her jaw, not wanting to believe that she's \n               right.\n\n               INT. MUSIC ROOM - DAY\n\n               The kids play \"Allegro,\" Roberta leading them.\n\n                                     ROBERTA\n                         Get ready, now -- we're coming up to \n                         the fermata...\n\n               They reach a certain note, then pause.\n\n                                     ROBERTA\n                         Hold... Hold... Don't anybody move. \n                         Now at the Spring Concert, the \n                         audience is gonna be dying for that \n                         next note -- but we'll make them \n                         wait. As a matter of fact, I think \n                         I'll go grab a cup of coffee.\n\n               She starts for the door and the kids moan and groan: \"Come \n               on, Roberta!\" \"Roberta, get back here!\" She smiles.\n\n                                     ROBERTA\n                         Well, O.K. But you have to promise \n                         you'll all start together.\n\n               She nods. They begin again -- all at different times.\n\n                                     DE SEAN\n                         Man. We'll never get that right.\n\n                                     ROBERTA\n                         That's not a very nice thing to say \n                         about your classmates.\n                              (to class)\n                         How many people think they can get \n                         it right by the concert?\n\n               All the kids raise their hands. De Sean looks around, \n               embarrassed, then raises his too. Roberta smiles.\n\n               INT. ROBERTA'S APARTMENT - LIVING ROOM - NIGHT\n\n               Brian and Roberta finish making love on the futon. They lie \n               in each other's arms, still breathing heavily.\n\n                                     ROBERTA\n                         I love you.\n\n               Brian makes a sound that's either panting or laughing.\n\n                                     ROBERTA\n                         Did you just laugh?\n\n                                     BRIAN\n                         I'm sorry. It's just...\n\n               Roberta looks at him, offended.\n\n                                     ROBERTA\n                         What?\n\n                                     BRIAN\n                         Why do people feel like the minute \n                         something's going great, they gotta \n                         name it?\n                              (beat)\n                         Once you name something, you snuff \n                         the life out of it.\n\n               She disentangles from him.\n\n                                     ROBERTA\n                         Jesus, Brian. Do you still get away \n                         with that crap? It's not the Sixties \n                         anymore.\n\n                                     BRIAN\n                         Well, maybe if you'd actually gone \n                         through the Sixties, you'd know what \n                         I'm talking about.\n\n                                     ROBERTA\n                         Fine! We won't name it, we won't \n                         talk about it, we'll act like we \n                         have no feelings for each other \n                         whatsoever!\n\n               She angrily turns on her side with her back to him. Brian \n               regrets hurting her and moves to her, kissing her shoulder.\n\n                                     BRIAN\n                         I'm sorry. I'm being an asshole.\n                              (sweetly teasing)\n                         You can say you love me if you want.\n\n                                     ROBERTA\n                         Forget it. I changed my mind.\n\n               He laughs and coaxes her to kiss him -- a temporary truce.\n\n               INT. BROWNSTONE - DAY\n\n               ERNIE (70's), a rickety Black man in work boots, looks baffled \n               by a tangled mess of wires protruding from a wall. Roberta \n               approaches.\n\n                                     ROBERTA\n                         How's it coming, Ernie?\n\n                                     ERNIE\n                         Well, if I could just remember what \n                         I did here yesterday, I'd be moving \n                         a whole lot faster.\n                              (beat)\n                         You look real pretty today, honey.\n\n               Brian overhears, rolls his eyes and pulls her aside.\n\n                                     BRIAN\n                         You're crazy. Why did you hire him?\n\n                                     ROBERTA\n                         He needed a job. Besides, he's wired \n                         all of East Harlem.\n\n                                     BRIAN\n                         When? Fifty years ago?\n\n               Brian sighs and walks off into another room. Two MEN carry \n               in large panels of sheetrock with old WALLPAPER on it.\n\n                                     ROBERTA\n                         Why is there wallpaper on it?\n\n                                     MAN #1\n                         That's how it comes.\n\n               They lean the panels against a wall. Roberta turns to Ernie.\n\n                                     ERNIE\n                         Yep, that's how it comes now.\n\n               The guys quickly exit. Brian re-enters and sees the panels.\n\n                                     BRIAN\n                         What the hell is this?\n\n                                     ROBERTA\n                         Sheetrock.\n\n                                     BRIAN\n                         You've gotta be kidding. Those ex-\n                         cons you hired ripped this off -- \n                         and you too!\n\n               Roberta feels stupid but doesn't want to show it.\n\n                                     ROBERTA\n                         Look -- this house is taking every \n                         penny of my settlement. I can't afford \n                         fancy union workers!\n\n                                     BRIAN\n                              (throwing up his hands)\n                         Fine. Do it your way.\n\n               He stomps off. ANOTHER ANGLE - Nick watches them fight and \n               looks distressed.\n\n               EXT. SCHOOL YARD - DAY\n\n               Lots of screaming and commotion as the kids crowd around a \n               fight in progress. As we move through the crowd we see that \n               NICK's in a fight with another boy; Nick's nose is bleeding \n               and he has the boy in a headlock. TWO TEACHERS run over to \n               break it up.\n\n               INT. AREA OUTSIDE JANET'S OFFICE - DAY\n\n               Nick sits outside, holding an ice pack to his bloody nose.\n\n               INT. JANET'S OFFICE - DAY\n\n               Roberta stands opposite Janet.\n\n                                     JANET\n                         I'm giving him a two-day suspension -- \n                         but next time he'll be expelled.\n\n                                     ROBERTA\n                         There won't be a next time -- I \n                         promise.\n\n                                     JANET\n                         Have you noticed your son lately? \n                         He's tied up in knots and he needs \n                         help.\n\n                                     ROBERTA\n                         Janet, kids fight. You're making too \n                         much of this.\n\n                                     JANET\n                         He was choking the kid.\n                              (beat)\n                         Nick's in trouble, Roberta. You need \n                         to deal with it.\n\n               Roberta takes this in, upset.\n\n               INT. ROBERTA'S APARTMENT - LIVING ROOM - NIGHT\n\n               Roberta plays \"Go Tell Aunt Rhody\" with Guadalupe, De Sean, \n               Naeem, Benjamin, and two kids from the other classes. Lexi \n               plays along with them. Nick enters from the kitchen, eating \n               a cookie, ignoring the students. He turns on the T.V.\n\n                                     ROBERTA\n                              (to students)\n                         Keep playing, guys.\n\n               Roberta crosses to Nick and shuts off the T.V.\n\n                                     ROBERTA\n                         You can watch when we're done.\n\n                                     NICK\n                         It's my house! They don't live here -- \n                         I do!\n\n                                     ROBERTA\n                              (sotto)\n                         Nick honey -- the kids are real \n                         nervous about the Spring concert. \n                         You could probably give them some \n                         pointers.\n\n                                     NICK\n                         I don't feel like it.\n\n               He reaches for the T.V. dial and she stops him.\n\n                                     ROBERTA\n                         I said no.\n\n               She crosses back to her students; Nick turns on the T.V.\n\n               EXT. CENTRAL PARK - DAY\n\n               Brian, Nick and Lexi laugh as they play frisbee alongside a \n               DUCK POND. Roberta watches, relieved to see Nick enjoying \n               himself.\n\n                                     BRIAN\n                         Good catch Nick!\n\n               Nick throws it back to Brian and it lands in the WATER.\n\n                                     BRIAN\n                              (mock sternly)\n                         Uh-oh. You know what that means?\n\n               He stalks towards Nick menacingly, picks him up and pretends \n               he's going to throw him into the water. Nick laughs \n               hysterically.\n\n                                     NICK\n                              (through laughter)\n                         Don't! Don't throw me in!\n\n                                     BRIAN\n                         Whatsa matter? Afraid of a little \n                         water? The ducks aren't afraid! Are \n                         you a chicken or a duck?\n\n                                     NICK\n                         Don't! Don't throw me!\n\n                                     BRIAN\n                         Looks like you got yourself a chicken, \n                         Roberta!\n\n                                     NICK\n                         I'm not a chicken!\n\n                                     BRIAN\n                         Well then you must be a duck!\n\n               He pretends again to throw Nick in, then puts him down. Lexi \n               holds out his arms to Brian.\n\n                                     LEXI\n                         Throw me in the water, Brian! Do it \n                         to me!\n\n               Brian swoops him up and Lexi starts laughing. Roberta laughs \n               along, happy to see the affection between Brian and her sons.\n\n               EXT. CENTRAL PARK - A LITTLE LATER\n\n               Brian and Roberta speak as they stroll; the boys run ahead \n               of them, dragging sticks along the pavement. In the b.g. we \n               see HARLEM STREETS bordering the park.\n\n                                     ROBERTA\n                         You seem to be the only one who can \n                         get Nick to laugh these days.\n\n                                     BRIAN\n                         He misses his dad. I'm just a \n                         surrogate.\n\n                                     ROBERTA\n                         No -- I think Nick really likes you.\n                              (taking his arm)\n                         You know... we're all hoping you'll \n                         move into the new house with us.\n\n                                     BRIAN\n                         Whoa. Can we just slow down here a \n                         minute? It's too much like getting \n                         married.\n\n                                     ROBERTA\n                         What's so bad about that?\n\n                                     BRIAN\n                         That kind of commitment just isn't \n                         realistic. I mean, how can we know \n                         that you and I will even be able to \n                         stand each other in five years?\n\n                                     ROBERTA\n                         Well, we don't. But if two people \n                         care about each other, they take a \n                         chance.\n\n                                     BRIAN\n                         And look what happened to you and \n                         Charles.\n\n                                     ROBERTA\n                         I'm not talking about Charles. I'm \n                         talking about us.\n\n                                     BRIAN\n                         Look, Roberta. Marriage is based on \n                         a belief that one person can \n                         completely meet another person's \n                         needs. I just don't buy that.\n\n               This is making her nervous. She looks at him, afraid of what \n               he might be saying.\n\n                                     ROBERTA\n                              (carefully)\n                         What are you saying? If there's some \n                         need you have that I don't meet, \n                         you'd go and get it \"met\" by someone \n                         else?\n\n               He heaves a sigh of frustration, not wanting to answer the \n               question.\n\n                                     BRIAN\n                         I'm saying that it's the 80's and \n                         it's a fantasy to think of marriage \n                         lasting these days. One out of two \n                         marriages ends in divorce!\n\n                                     ROBERTA\n                         You didn't answer my question.\n                              (beat)\n                         If I don't meet all your needs, and \n                         we're in a committed relationship -- \n                         forget marriage for a minute; I'm \n                         just talking about a relationship -- \n                         would you go to someone else?\n\n               A beat.\n\n                                     BRIAN\n                         In theory, yes.\n\n                                     ROBERTA\n                         In theory.\n\n               Roberta looks very disheartened. Brian feels badly.\n\n                                     BRIAN\n                         Roberta, we've got something good \n                         right now -- that's the important \n                         thing. Let's just keep it that way, \n                         O.K.?\n\n               He pulls her to him, kissing her neck, but she pulls away \n               from him. ON NICK, observing with an anxious expression.\n\n               INT. ROBERTA'S APARTMENT - NIGHT\n\n                                     NICK (O.S.)\n                              (whining)\n                         Why can't he?\n\n               Roberta looks distressed by her talk with Brian as she and \n               the boys enter, back from the park.\n\n                                     ROBERTA\n                         He just can't, O.K.? Brian's at his \n                         house tonight, and we're at ours.\n\n                                     NICK\n                         Well then I wanna go to his house.\n\n                                     ROBERTA\n                         Enough, Nick. Now why don't you and \n                         your brother practice while I make \n                         dinner.\n\n                                     NICK\n                         I don't feel like practicing.\n\n                                     ROBERTA\n                         Well do it anyway.\n\n                                     NICK\n                         I wanna go to Brian's!\n\n                                     ROBERTA\n                         Stop whining, and get your violin.\n\n               Nick stomps off to get his violin. Lexi follows. Roberta \n               puts down her bag and takes off her coat. While Lexi sets up \n               his violin, Nick opens his violin case, takes out the violin \n               and angrily starts playing, loudly and roughly.\n\n                                     ROBERTA\n                         What the hell are you doing?\n\n                                     NICK\n                         The problem with you is you're mean \n                         to everybody and then they don't \n                         want to be with you!\n\n                                     ROBERTA\n                         I've heard just about enough from \n                         you, young man. Now set your violin \n                         up properly and start practicing.\n\n               Nick THROWS the violin against the floor. Roberta's \n               speechless.\n\n                                     NICK\n                         I hate the violin!\n\n                                     ROBERTA\n                         You pick that violin up right now \n                         and don't you ever ever --\n\n               Nick picks up the violin and THROWS the violin down even \n               harder, then YELLS at Roberta before she can even respond.\n\n                                     NICK\n                         It's all your fault! You made Daddy \n                         leave and you're gonna make Brian \n                         leave too! You're gonna be all alone \n                         and I'll have to take care of you!\n\n               Roberta is stunned. The anger drains out of her as she \n               suddenly sees what this is all about.\n\n                                     ROBERTA\n                         Nick -- you don't have to take care \n                         of me.\n\n                                     NICK\n                         Then who's going to?\n\n                                     ROBERTA\n                         I'll take care of myself -- and I'll \n                         take care of you and Lexi. I promise.\n\n                                     NICK\n                         You didn't try hard enough. You made \n                         Daddy leave us.\n\n               This hits her in the solar plexus. Her hurt and vulnerability \n               start to pour out.\n\n                                     ROBERTA\n                         That's not true. I begged him not to \n                         leave, but he didn't listen.\n\n                                     NICK\n                         Why not?\n\n               Roberta hesitates, but knows she has to tell them the truth. \n               She addresses both boys.\n\n                                     ROBERTA\n                         Your father met someone he liked \n                         more than Mommy, and then --\n\n                                     NICK\n                         Who?\n\n               Roberta swallows, shocked to hear him ask this. She can hardly \n               answer him.\n\n                                     ROBERTA\n                         Lana. Remember our friends Lana and \n                         Tom?\n\n                                     NICK\n                         Is he gonna marry her now?\n\n                                     ROBERTA\n                         No, but he's not coming back... to \n                         me.\n\n               Nick and Lexi look very upset, not only from hearing the \n               finality in her words, but from seeing their mother's pain. \n               Roberta moves closer to them.\n\n                                     ROBERTA\n                         I'll take care of you, Nick. You \n                         too, Lexi. I promise. I'm not going \n                         anywhere. We're still a family.\n\n               Nick starts crying. Roberta takes him in her arms. Lexi starts \n               to cry and Roberta holds him too.\n\n                                     ROBERTA\n                              (softly, to both)\n                         I promise.\n\n               INT. BROWNSTONE - DAY\n\n               Ernie's radio plays a BLUES SONG. The BRICK WORKERS radio \n               plays SPANISH MUSIC, and the PAINTERS' radio plays a RAP \n               SONG. Roberta stands in the middle, about to lose her mind.\n\n               HER POV - Ernie sits on a stool facing his wiring. He's fast \n               asleep. ANOTHER ANGLE - The brick workers build a crooked \n               fireplace.\n\n               BACK TO SCENE\n\n               Roberta sighs heavily, then crosses to the painters.\n\n                                     ROBERTA\n                         What color is this?\n\n                                     PAINTER\n                         White.\n\n                                     ROBERTA\n                         I told you Eggshell.\n\n                                     PAINTER\n                         Eggshells are white.\n\n               Brian watches this interaction as he sands a door.\n\n                                     BRIAN\n                         You're an idiot! I told you -- you \n                         can't be your own contractor.\n\n                                     ROBERTA\n                         You're right. I'm an idiot.\n\n               She crosses to Ernie and shakes him.\n\n                                     ROBERTA\n                         Wake up, Ernie.\n\n               He looks at her groggily.\n\n                                     ROBERTA\n                         You're fired.\n\n               She crosses to the brick workers.\n\n                                     ROBERTA\n                         You're fired.\n\n               She crosses to the painters.\n\n                                     ROBERTA\n                         You're fired.\n\n               Brian smiles at her, impressed.\n\n                                     BRIAN\n                         That's more like it.\n\n                                     ROBERTA\n                         You're fired too.\n\n               Brian laughs.\n\n                                     ROBERTA\n                         No, Brian. I mean it. I need to be \n                         with a man who can make a commitment \n                         to me. I need that, and my sons need \n                         that.\n                              (beat)\n                         So can you?\n\n                                     BRIAN\n                              (hesitates, then)\n                         Roberta --\n\n               His tone and expression tell her the words are not \n               forthcoming.\n\n                                     ROBERTA\n                         Get out.\n\n               He looks at her, shocked by her toughness, but knows he can't \n               give her what she wants. He exits. Roberta stands in the \n               middle of the room, a determined look on her face.\n\n               INT. SCHOOL AUDITORIUM - NIGHT\n\n               ROBERTA\n\n               Stands in the aisle, leading the students and playing violin.\n\n               ON STAGE\n\n               The fifty fifth-grade students play the \"Twinkle\" variations. \n               Their playing is impeccable and they look terrific.\n\n               As the CAMERA PANS the audience, we recognize: MRS. ADISA, \n               tears in her eyes as she watches Naeem; MRS. LAMB and her \n               husband, watching Becky in amazement; ISABEL and her daughter \n               sitting with ASSUNTA, NICK and LEXI; JANET, impressed as \n               hell; and DENNIS, seething with jealousy. As the kids start \n               the jazz variation of \"Twinkle,\" a WOMAN elbows her husband:\n\n                                     WOMAN\n                         That's the one Lucy wrote!\n\n               The CAMERA returns to the children and captures their own \n               pride in their playing, including LUCY, who smiles as she \n               hears her song played by fifty.\n\n               THE CONCERT - TIME DISSOLVE\n\n               The students are now playing \"Allegro,\" and they reach the \n               fermata. They hold their positions in silence and the audience \n               watches in anticipation. Roberta cues them and they play the \n               next note in perfect unison. An involuntary smile lights on \n               DE SEAN's face. They finish the song, the audience applauds, \n               and Roberta turns to face them.\n\n               She lights up when she sees how thrilled Janet looks, and \n               Janet in turn raises her hands higher as she applauds Roberta.\n\n                                                               DISSOLVE TO:\n\n               EXT. CPE 1 - DAY - ESTABLISHING - TIME CUT (1998)\n\n               The side of the building now has an impressive mural: an \n               urban landscape with three super heroes -- Puerto Rican, \n               Black, and white -- rising up out of the street. It reads \n               ONLY THE STRONG SHALL SURVIVE.\n\n               INT. CLASSROOM - DAY\n\n               Roberta stands in front of a classroom of twenty cute first-\n               graders -- mostly Black and Latino, a few white -- sitting \n               on the floor, chatting excitedly. Even though Roberta's ten \n               years older, she seems more youthful; her wavy hair is loose \n               over her shoulders, her clothing's casual and artistic. Beside \n               her is Janet, her hair flecked with gray, and Dennis, who \n               looks pretty much the same. The classroom teacher is ISABEL, \n               a little older, a little tougher.\n\n                                     ISABEL\n                         C'mon everybody, settle down -- Janet \n                         wants to talk to you.\n\n                                     JANET\n                         Today's a very special day because \n                         we're starting the tenth year of the \n                         East Harlem Violin Program. This is \n                         a wonderful opportunity for you, so \n                         I want you to talk to your parents \n                         about whether you'd like to try this.\n\n                                     ISABEL\n                         My daughter took violin with Roberta \n                         when she was your age, and now she's \n                         in high school and she still talks \n                         about how much she loved it.\n\n                                     DENNIS\n                         Janet and I started this program \n                         because we knew how much you kids \n                         could benefit from it.\n\n               CUTAWAY to Roberta and Janet exchanging glances over Dennis \n               taking credit for the program.\n\n                                     DENNIS\n                         You should know, however, that the \n                         violin is a difficult instrument.\n\n               JUSTIN, a Black boy with attitude, raises his hand. He always \n               wears a puffy red, yellow and green crocheted beret. Isabel \n               nods to him.\n\n                                     JUSTIN\n                         Who's that lady in the back?\n\n               ANGLE - DOROTHEA (Doro-taya) VAN HAUFTEN (40's), an elegant, \n               beautiful woman, smartly dressed, takes photographs from the \n               back of the room.\n\n                                     JANET\n                         That's Dorothea Van Hauften --\n\n                                     JUSTIN\n                         Say what? What kinda name is that?\n\n                                     ISABEL\n                         Justin -- sshh!\n\n                                     JANET\n                         -- and she's taking pictures of \n                         Roberta's classes for a magazine \n                         article about music education.\n\n                                     JUSTIN\n                         I wanna be in the magazine!\n\n                                     ISABEL\n                         First things first, Justin. Roberta's \n                         gonna explain to you about the \n                         \"lottery.\"\n\n               Roberta steps forward. RAMON OLIVAS (7), a small, adorable \n               Puerto Rican boy with a crew cut, watches her with adoration.\n\n                                     ROBERTA\n                         I used to just teach fifty kids at \n                         this school. But now I teach a hundred \n                         and fifty kids at three East Harlem \n                         schools and there's so many children \n                         who want to take violin classes that \n                         we have to have a lottery.\n\n               VANESSA raises her hand, a white girl whose clothes and \n               accessories are always adorned with cats.\n\n                                     VANESSA\n                         Can I be in the class?\n\n                                     ISABEL\n                         Roberta's explaining that. Just \n                         listen.\n\n                                     ROBERTA\n                         After your parents sign your \n                         permission slips, I'm gonna put them \n                         in a sack, and I'll pick fifty names \n                         from each school.\n\n               ANGLE - Ramon listens intently with his fingers crossed.\n\n                                     ROBERTA\n                         So everyone bring in your slips by \n                         Friday, and I'll come back and tell \n                         you who's in violin class.\n\n                                     ISABEL\n                         Remember, she's just picking names \n                         from a hat. It doesn't mean that \n                         anyone's better than anyone else.\n\n               RAMON raises his hand.\n\n                                     RAMON\n                              (to Roberta)\n                         I really really hope that I get in \n                         the class.\n\n               Roberta looks at him, struck by his sweetness.\n\n                                     ROBERTA\n                         I hope so too.\n\n               EXT. 118TH STREET - STREET SIGN - ESTABLISHING - DAY\n\n               EXT. ROBERTA'S BROWNSTONE - DAY\n\n               The brownstone looks a lot better than when we last saw it. \n               Graffiti's been removed, the stairs have been repaired, the \n               windows have security bars, and there are flowers blooming \n               in pots in front of the building. Roberta steps INTO FRAME, \n               walking Allegra, now a 10-year-old dog.\n\n               INT. BROWNSTONE - DAY\n\n               The house is transformed: the first floor is one long open \n               room with oak floors, a living room in front with a beautiful \n               fireplace and a grand piano, and a country kitchen in the \n               rear, complete with pots hanging over a large butcher block.\n\n               NICK (17) practices cello and LEXI (15) practices piano; \n               they play Haydn's \"Trio #13.\" Now handsome young men, their \n               blonde hair has darkened to brown. Nick is huskier; Lexi has \n               a slighter build. Both are passionate, talented musicians.\n\n               On the couch, RACHEL (12), a mature, beautiful Black girl, \n               rosins her bow.\n\n                                     RACHEL\n                         How come you guys don't play the \n                         violin?\n\n                                     LEXI\n                         Well, picture her being your teacher \n                         and your mother.\n\n               Rachel cracks up but stifles her laughter as Roberta enters \n               from outside with Allegra.\n\n                                     ROBERTA\n                         Hi Rachel. Be right with you.\n\n               As Roberta removes Allegra's leash, Rachel and Lexi share a \n               conspiratorial look. In the b.g., Nick packs up his cello.\n\n                                     ROBERTA\n                              (to Nick)\n                         You're gonna practice upstairs?\n\n                                     NICK\n                         No. I'm done.\n\n                                     ROBERTA\n                         Already? You've barely practiced.\n\n                                     NICK\n                         What -- are you timing me with a \n                         stop watch? Why don't you pick on \n                         Lexi for a change?\n\n                                     LEXI\n                         'Cause I'm perfect.\n\n               Nick jostles him and heads upstairs. Lexi gets up from the \n               piano.\n\n                                     LEXI\n                              (to Rachel)\n                         Have a good lesson.\n\n               He crosses to a sharp-looking bike parked behind the front \n               door and addresses Roberta.\n\n                                     LEXI\n                         I'll be back in a couple of hours.\n\n                                     ROBERTA\n                         Be careful.\n\n               Lexi mouths \"be careful\" along with her.\n\n               EXT. RIVER EAST PARK - DUSK\n\n               Lexi plays basketball with a group of Black and Latino guys. \n               Despite his small stature, he's a great athlete, and an \n               accepted part of the group. The game ends. He and his buddy \n               Lawrence (now 16), both all sweaty, cross to a water fountain. \n               As Lexi takes a drink --\n\n                                     MALE VOICE (O.S.)\n                         Can I try your bike?\n\n               Lexi wipes his mouth and looks up at HENRY (18), a tall, \n               intimidating Black teenager who towers over him. Lawrence \n               watches tensely.\n\n                                     LEXI\n                         I'm gonna be leaving pretty soon.\n\n                                     HENRY\n                         Just wanna take it for a spin.\n\n                                     LAWRENCE\n                         C'mon, Henry -- he don't want to \n                         loan you his bike.\n\n                                     HENRY\n                         I didn't hear him say that.\n                              (to Lexi)\n                         Is that true? Did you say that?\n\n               Lexi looks at him, knowing there's only one right answer.\n\n               INT. LIVING ROOM - DAY\n\n               Roberta and Rachel play Bach's \"Minuet One\" together on the \n               violin. The girl has obvious talent.\n\n                                     ROBERTA\n                         Vibrato... don't wiggle your wrist.\n\n               Rachel stops, frustrated.\n\n                                     RACHEL\n                         Dang! I can't get that right.\n\n                                     ROBERTA\n                         You almost have it.\n\n                                     RACHEL\n                         Almost isn't good enough.\n\n                                     ROBERTA\n                         Did I turn you into such a \n                         perfectionist?\n\n                                     RACHEL\n                         No. I came that way.\n\n                                     ROBERTA\n                              (smiles, then)\n                         Just as long as you get it right for \n                         your Julliard audition.\n\n                                     RACHEL\n                         What?\n\n                                     ROBERTA\n                         I've recommended you for a gifted \n                         kids scholarship.\n\n               Rachel looks at her in wide-eyed gratitude.\n\n               ANGLE - Lexi enters the front door, a glum look on his face.\n\n                                     ROBERTA\n                         Where's the bike?\n\n               INT. HONDA/EXT. EAST HARLEM STREETS - NIGHT\n\n               Roberta drives with Nick in the front, Lexi and Lawrence in \n               the back. They're in a dangerous looking part of East Harlem.\n\n                                     LEXI\n                         Mom, please. Don't do this to me!\n\n                                     NICK\n                         C'mon, Mom -- why don't you let me \n                         handle this?\n\n                                     ROBERTA\n                         Are we getting closer, Lawrence?\n\n                                     LAWRENCE\n                         It's the next block up.\n\n                                     LEXI\n                              (to Roberta)\n                         You don't have to do this. I'll pay \n                         you back.\n\n                                     ROBERTA\n                         How? It took me six months to save \n                         up for it.\n\n                                     NICK\n                         I'll help him, O.K.? We'll both pay \n                         you back.\n\n                                     LEXI\n                         Or we'll ask Dad -- he'll help us \n                         out.\n\n                                     ROBERTA\n                         Yeah, right.\n\n                                     LAWRENCE\n                         O.K., slow down. It's the second one \n                         on the right.\n\n               Roberta slows the car down next to a HOUSING PROJECT.\n\n               EXT. HOUSING PROJECT - NIGHT\n\n               Not a place you'd want to go into, even in the day time.\n\n               PULL BACK TO REVEAL this is their POV from INSIDE THE CAR. \n               The boys look frightened, but Roberta's on a mission.\n\n                                     NICK\n                         C'mon Mom, let's get out of here.\n\n                                     ROBERTA\n                         Lock the doors.\n\n               And she exits. The boys watch as she heads for the building, \n               then Lexi shakes his head and covers his face.\n\n                                     LEXI\n                         I'm dead. She's gonna get me killed.\n\n               Nick jumps out of the car and heads after her.\n\n                                     NICK\n                         I'm coming with you!\n\n                                     ROBERTA\n                         No. Get back in the car and stay \n                         with the boys.\n\n               Nick hesitates and heads back. Roberta presses on. Lawrence \n               opens the window and calls to her.\n\n                                     LAWRENCE\n                         Don't take the stairs!\n\n               INT. TENEMENT BUILDING - LOBBY - NIGHT\n\n               CLOSE ON THE ELEVATOR DOOR with a handwritten SIGN that reads \n               OUT OF ORDER.\n\n               WIDER - Roberta stands in front of the elevator, staring \n               tensely at the sign. She takes a deep breath, then heads for \n               the staircase.\n\n               INT. TENEMENT BUILDING - STAIRWELL - NIGHT\n\n               Roberta climbs the dimly-lit stairs of a dilapidated, scary \n               building. O.S. a BABY CRIES, a couple of TV's BLARE.\n\n               INT. TENEMENT BUILDING - HALLWAY - CONTINUOUS\n\n               At the top of the stairs, Roberta turns down the hall, passing \n               a door riddled with bullet holes. She finds the apartment \n               and knocks. No response. She knocks again.\n\n                                     OLD WOMAN (O.S.)\n                         Yeah?\n\n                                     ROBERTA\n                         I'm a school teacher. Henry has taken \n                         my son's bicycle and I want it back.\n\n               A beat, then the door cracks open, an OLD WOMAN visible \n               through the chain lock.\n\n                                     OLD WOMAN\n                         Henry's not here.\n\n                                     ROBERTA\n                         Well you tell Henry that if he returns \n                         the bike, I won't have to notify the \n                         police -- or his school principal. \n                         Although since I am a teacher, it \n                         would be very easy for me to do that.\n\n               A couple of beats.\n\n                                     OLD WOMAN\n                         He's not home. He doesn't get home \n                         till late.\n\n                                     ROBERTA\n                         How late?\n\n                                     OLD WOMAN\n                         Not till after ten.\n\n                                     ROBERTA\n                         I'll be on the steps of CPE 1 at 11 \n                         P.M. I'll be waiting for him.\n\n               The door closes. Roberta exhales. Did she just do that?\n\n               EXT. CPE 1 - NIGHT\n\n               Roberta, Nick, Lexi and Lawrence sit on the front steps of \n               the school. The street is deserted.\n\n                                     LEXI\n                         You're crazy. He's not gonna show.\n\n               Roberta sits confidently.\n\n                                     NICK\n                         You think he actually cares that \n                         you're a teacher? You think he even \n                         goes to school?\n\n                                     LEXI\n                         C'mon, Mom -- let's just go.\n\n                                     ROBERTA\n                         It's only five after eleven.\n\n               Nick and Lexi roll their eyes and exchange a look: she's \n               nuts. Suddenly, there's the SOUND of a bicycle. Nick, Lexi \n               and Lawrence look towards the sound, incredulous. Lexi stands.\n\n               Henry rides up on the bike and dismounts. Lexi looks directly \n               at him as he takes the bike from him.\n\n                                     HENRY\n                         I was just borrowing it.\n\n               He glances at Roberta, then walks off.\n\n               INT. CPE 1 - CLASSROOM - DAY\n\n               Roberta stands in front of Isabel's class and calls out names, \n               handing the selected children acceptance letters. The kids \n               are charged up; \"My heart is pounding!\" \"Please pick me!\"\n\n                                     ROBERTA\n                         Shandra Wilson.\n\n               A pretty Black girl with braids and tons of barrettes jumps \n               up and down, then runs up for her letter. The kids SQUEAL \n               and CHEER for each student called. Shandra hugs her best \n               friend MYESHA, a chubby Black girl who also holds a letter.\n\n                                     ROBERTA\n                         Justin Brady.\n\n               JUSTIN raises his fists in triumph. ANGLE - RAMON anxiously \n               waits to see if his name will be called. JUSTIN sits down \n               next to him, waves his letter in Ramon's face, taunting him.\n\n                                     ROBERTA\n                         Vanessa Klein.\n\n               Vanessa takes her letter and smiles. She puts it into her \n               cat-shaped backpack.\n\n                                     ROBERTA\n                         O.K. One more name...\n\n               Ramon crosses his fingers and holds his breath.\n\n                                     ROBERTA\n                         Leonard Hood.\n\n               RAMON looks crushed. JUSTIN taunts him some more. LEONARD, a \n               scrawny white boy takes his letter, scared by it. He starts \n               to cry.\n\n                                     LEONARD\n                         It's too hard! I don't wanna do it!\n\n                                     ISABEL\n                         Don't you even wanna try, Leonard?\n\n                                     LEONARD\n                              (through tears)\n                         I don't want to!\n\n               Isabel looks at Roberta.\n\n                                     ROBERTA\n                         Well, O.K. then. I'll pick someone \n                         else.\n                              (she picks a name)\n                         Ramon Olivas.\n\n               Ramon's face lights up.\n\n               EXT. SCHOOL YARD - DAY\n\n               As Roberta walks through the yard, she sees kids excitedly \n               showing acceptance letters to their moms.\n\n               SHANDRA and MYESHA hold hands as they run to Shandra's mom, \n               BEVERLY WILSON, pushing a stroller. She looks at the letter \n               and hugs Shandra.\n\n               ANGLE - RAMON reads his letter to his mother, CONCEPCION \n               (45), whose eyes tell you that she's lived through a lot. \n               She speaks with a Puerto Rican accent.\n\n                                     RAMON\n                         This is to inform you that your child, \n                         Ramon Olivas, has been chosen by \n                         lottery to be in the violin program.\n\n                                     CONCEPCION\n                         You happy?\n\n               Ramon spins round and round with the letter in his hand.\n\n                                     CONCEPCION\n                         I think you're happy.\n\n               EXT. RIVER EAST ELEMENTARY SCHOOL - DAY\n\n               Roberta illegally parks her old Honda, rushes out of the \n               car, grabs her book bags and three violins, pulls a parking \n               ticket from her pocket and puts it on the windshield.\n\n                                     WOMAN'S VOICE (O.S.)\n                              (German accent)\n                         Does that really work?\n\n               Roberta turns. It's DOROTHEA, the PHOTOGRAPHER we saw in the \n               classroom.\n\n                                     ROBERTA\n                         No. But I keep trying. And maybe \n                         someday the school will give me a \n                         parking space!\n\n               She rushes towards the school and Dorothea follows her.\n\n                                     DOROTHEA\n                         Wait --\n\n               She hands Roberta a thin box. Roberta puts down her violins, \n               glances inside it and forgets about being late.\n\n               INSERT\n\n               -- Terrific black and white shots of Roberta's advanced \n               classes playing violin.\n\n                                     ROBERTA (O.S.)\n                         God, these are great.\n\n               BACK TO SCENE\n\n                                     DOROTHEA\n                         Those copies are for you.\n\n                                     ROBERTA\n                         Thank you. Can I... pay for you them?\n\n                                     DOROTHEA\n                         Don't be silly. Besides -- you'll \n                         need your money for parking tickets.\n\n               They smile at each other.\n\n                                     DOROTHEA\n                         What you're doing for these children \n                         is wonderful. My husband's a violinist -- \n                         he was quite impressed when I told \n                         him about you.\n\n                                     ROBERTA\n                         What's his name?\n\n                                     DOROTHEA\n                         Arnold Steinhardt.\n\n                                     ROBERTA\n                         Of the Guarneri String Quartet?\n\n               Dorothea nods, and hands Roberta a card.\n\n                                     DOROTHEA\n                         Stay in touch. Let us know when the \n                         kids have a concert.\n\n               RACHEL, heading for school, calls out to Roberta.\n\n                                     RACHEL\n                         Don't be late for violin class! I \n                         hear the teacher's really mean.\n\n               Roberta smiles, slips the card in her pocket, nods to Dorothea \n               and follows Rachel.\n\n               INT. RIVER EAST SCHOOL - MUSIC ROOM - DAY\n\n               Roberta's advanced class plays \"Can-Can.\" Rachel's one of \n               the eight sixth-graders. Roberta plays along, crossing to \n               AMANDA, a white girl in a country-western outfit.\n\n                                     ROBERTA\n                         Amanda, what did I tell you about \n                         wearing cowboy boots to violin class? \n                         They're too slippery!\n\n               She crosses to a pudgy Black/Puerto Rican boy with glasses.\n\n                                     ROBERTA\n                         Relax your two, Simon...\n\n               She glances at STEPHANIE, a white girl with red hair, next \n               to KENNY, a Black boy with an earnest expression.\n\n                                     ROBERTA\n                         Your stop sign has to be up, Kenny! \n                         Stephanie, it doesn't look like you \n                         ever had a lesson with me!\n\n               CARLOS (13) hurries in, a handsome Black boy in a baseball \n               jacket that says \"LOS LEONES.\" He looks 15.\n\n                                     ROBERTA\n                         Where's your violin, Carlos?\n\n                                     CARLOS\n                         It's coming.\n\n               He nervously looks down the hall.\n\n                                     ROBERTA\n                         What, is it walking here by itself?\n\n               A Black third-grade girl rushes into the room and hands Carlos \n               his violin, then runs off. Roberta crosses to Carlos as he \n               quickly readies the violin.\n\n                                     ROBERTA\n                         Your buddies giving you a hard time?\n\n                                     CARLOS\n                         Look, it's just not cool. You wouldn't \n                         understand.\n\n                                     ROBERTA\n                         Hey, you want your sister to carry \n                         your violin, that's fine. But is she \n                         practicing for you too? Because \n                         lately, that's how it sounds.\n\n                                     CARLOS\n                         I've been busy! I've been --\n\n                                     ROBERTA\n                         I'm not interested! Just get here on \n                         time, and commit to this class or I \n                         don't want you in here, you \n                         understand?\n\n               He nods sullenly.\n\n                                     ROBERTA\n                         You're a good violinist, Carlos -- \n                         and it's definitely not \"cool\" to \n                         waste your own talent.\n\n               Carlos takes this in as Roberta crosses to another student.\n\n               EXT. RAMON'S APARTMENT - EAST HARLEM - ESTABLISHING - NIGHT\n\n               It's upstairs from a grocery store on a busy street.\n\n               INT. RAMON'S APARTMENT - LIVING ROOM - NIGHT\n\n               Ramon sits on the floor, upset, half-heartedly building with \n               Legos, while his parents argue in the KITCHEN. His father \n               MANUELO is a stocky, muscular man. INTERCUT between the two \n               areas. This is a modest, well-kept apartment. Off the kitchen, \n               religious candles burn on a shelf above a washing machine.\n\n                                     MANUELO\n                         Why didn't you show it to me?\n\n                                     CONCEPCION\n                         It just needed one parent's signature.\n\n                                     MANUELO\n                              (with some Spanish)\n                         Well, I'm his parent and I don't \n                         give permission! He should be playing \n                         baseball, not the violin!\n\n                                     CONCEPCION\n                         It makes him happy.\n\n               ON RAMON, looking far from happy at the moment.\n\n               EXT. RIVER EAST SCHOOL - DAY\n\n               Rachel steps off a city bus, carrying her violin. She passes \n               two sixth-grade boys and a girl.\n\n                                     BOY #1\n                              (loudly)\n                         Ooh, check out little Miss Violinhead.\n\n                                     GIRL\n                         She carry that violin with her all \n                         the time 'cause she think she special.\n\n               Rachel turns to them.\n\n                                     RACHEL\n                         I am special.\n\n               She proudly continues on, then sees Roberta walking towards \n               the school and catches up to her.\n\n                                     RACHEL\n                              (nonchalant)\n                         So I heard from Julliard.\n\n               Roberta stops and looks at her.\n\n                                     ROBERTA\n                         And?\n\n                                     RACHEL\n                         They said yes!\n\n               Roberta gives her a big hug.\n\n               INT. CPE 1 - MUSIC ROOM - DAY\n\n               ON THE BEGINNER'S CLASS, including Ramon, as they play \n               \"Lightly Row.\" Roberta walks around, making corrections as \n               she addresses the students. She doesn't see Justin poking \n               Ramon with his bow; Ramon swats the bow away and glares at \n               his nemesis. Roberta moves some of Shandra's braids away \n               from the violin.\n\n                                     ROBERTA\n                         So when you take the violins home, \n                         tape your music to the wall directly \n                         in front of your nose so you can \n                         play with perfect posture. Your \n                         parents are gonna be so excited to \n                         hear you play!\n\n               INT. RAMON'S HOUSE - LIVING ROOM - NIGHT\n\n               SCREECHING comes from Ramon's room as he practices \"Lightly \n               Row.\" His brothers, PEDRO (18) and ERNESTO (17), cringe as \n               they try to watch T.V. Ernesto gives up and puts on his \n               Walkman; Pedro's ready to break the violin. Concepcion listens \n               patiently as she folds laundry, but even she winces.\n\n                                     PEDRO\n                              (yelling)\n                         Ramon! How many cats you killing in \n                         there?\n\n               INTERCUT RAMON - He plays with pride, eyes on the music taped \n               to the wall.\n\n               INT. CPE 1 - MUSIC ROOM - DAY (A FEW MONTHS LATER)\n\n               ON RAMON, his improved playing showing that time has passed. \n               WIDER - the beginner's class plays \"Lightly Row.\"\n\n               JUSTIN is struggling more than the other students. Roberta \n               plays along with the class, eyeing each student.\n\n                                     ROBERTA\n                         More bow! To the frog! Myesha, your \n                         stop sign line should be touching. \n                         Don't let it wiggle! You're on the \n                         wrong string, Justin! And look at \n                         your feet!\n\n               Vanessa enters the front door without her violin.\n\n                                     ROBERTA\n                         Where's your violin?\n\n                                     VANESSA\n                         I forgot.\n\n                                     ROBERTA\n                         Goodbye! And you may be dropped.\n\n               Vanessa pouts and exits. Roberta moves to ROSARIO, a Puerto \n               Rican girl.\n\n                                     ROBERTA\n                         Look at those nails, Rosario!\n\n               She pulls a clipper from her pocket and swiftly clips them. \n               MYESHA nervously glances at her own nails.\n\n                                     ROBERTA\n                         I see you over there, Myesha.\n\n               She moves to Ramon and corrects his bowing position.\n\n                                     ROBERTA\n                              (to Ramon)\n                         You're doing much better.\n\n               As Roberta walks on to the next student, Justin purposely \n               knocks over Ramon's music stand.\n\n                                     RAMON\n                         Drop dead, Justin!\n\n                                     JUSTIN\n                         It was a accident!\n\n                                     RAMON\n                         Was not!\n\n                                     ROBERTA\n                         Ramon, I don't like that kind of \n                         talk. Justin, pick up his stand, \n                         now! Our spring concert is in three \n                         weeks and you might not be in it. Is \n                         that what you want?\n\n               EXT. CPE 1 - DAY\n\n               As Roberta heads for her car, she sees Vanessa being helped \n               into a car by her FATHER, his suit wrinkled and tie loosened. \n               There's SNOW on the ground.\n\n                                     ROBERTA\n                         Mr. Klein? I'm gonna have to drop \n                         Vanessa from the class if she keeps \n                         forgetting her violin.\n\n                                     MR. KLEIN\n                              (sotto)\n                         She's going back and forth between \n                         houses. My wife and I split up.\n\n                                     ROBERTA\n                              (softening)\n                         Oh. I'm sorry.\n\n               Roberta leans into the car window.\n\n                                     ROBERTA\n                         Vanessa, maybe you could write down \n                         for your Mom and Dad which days are \n                         violin days.\n\n                                     VANESSA\n                              (almost in tears)\n                         The tape doesn't stick.\n\n                                     ROBERTA\n                         What?\n\n                                     VANESSA\n                         I taped the music to the wall at my \n                         Mom's house and then I took it to my \n                         Dad's house and it doesn't stick \n                         anymore.\n\n               Mr. Klein's eyes tear up and he quickly wipes them.\n\n                                     ROBERTA\n                         Well you know what? That's an easy \n                         problem to solve.\n\n               She looks through her book bag, takes out a piece of music \n               and gives it to her.\n\n                                     ROBERTA\n                         Now you have two, O.K.? One for each \n                         house.\n\n               Vanessa nods, clutching the piece of music. Roberta and Mr. \n               Klein exchange a look. She touches his arm, then walks off.\n\n               INT. RAMON'S HOUSE - NIGHT\n\n               Ramon, holding his bow and violin, crosses to his father \n               who's watching a baseball game on T.V.\n\n                                     RAMON\n                         You wanna hear my new song, Papa?\n\n                                     MANUELO\n                              (in Spanish)\n                         Not right now.\n\n               Ramon exits, hurt. Concepcion watches from the side, and \n               crosses to her husband.\n\n                                     CONCEPCION\n                         We made mistakes with Pedro and \n                         Ernesto and we can't fix them now, \n                         but Ramon -- he works so hard. The \n                         violin makes him want to be good at \n                         everything.\n\n               He shows no response, and she exits. Manuelo ponders what \n               she said.\n\n               EXT. CPE 1 ELEMENTARY SCHOOL - DAY (MORNING)\n\n               Roberta approaches the school on a winter morning. She smiles \n               as she sees Vanessa get out of her MOTHER'S car with her \n               violin. Roberta nears the front door and finds Isabel and \n               some teachers huddled in conversation. A few students are \n               crying.\n\n                                     ROBERTA\n                              (to Isabel)\n                         What happened?\n\n               INT. MUSIC ROOM - DAY\n\n               The beginners sit on the floor and rosin their bows. A few \n               chat, but it's quieter than usual, except for RAMON who is \n               \"blessing\" kids with his violin bow.\n\n                                     RAMON\n                         You go to heaven... You go to hell... \n                         You go to hell... heaven...\n\n               Roberta enters slowly. She looks very shaken up. She takes \n               note of what Ramon is doing, and overhears Toussaint and \n               Shandra in mid-conversation.\n\n                                     TOUSSAINT\n                         My grandpa died and my uncle, so \n                         that makes six.\n\n                                     SHANDRA\n                         I know more than that. At least seven \n                         people... maybe even nine.\n\n               Roberta gently tells Ramon to sit, and then she sits down on \n               a child-sized chair in front of them.\n\n                                     ROBERTA\n                              (quietly)\n                         I know that you've all heard the bad \n                         news about Justin.\n\n                                     MYESHA\n                         I didn't hear.\n\n                                     TOUSSAINT\n                         There was a drive-by shooting by his \n                         house and he got shot on accident \n                         and he died.\n\n               Myesha takes this in, looking sad.\n\n                                     ROBERTA\n                         Does anyone want to talk about it?\n\n                                     RAMON\n                              (angry)\n                         I think we should just play violin.\n\n               Roberta watches him.\n\n               INT. RAMON'S HOUSE - LIVING ROOM/KITCHEN AREA - DAY\n\n               Concepcion cooks chicken and Pedro sets the table, whistling \n               along to Ramon's O.S. violin playing \"We Shall Overcome.\" \n               There's a KNOCK on the door. Concepcion answers it, revealing \n               Roberta.\n\n                                     CONCEPCION\n                         Roberta! Come in.\n\n               Roberta enters.\n\n                                     ROBERTA\n                         I came by to check on Ramon.\n\n                                     CONCEPCION\n                              (confused)\n                         Why?\n\n                                     ROBERTA\n                         Didn't he tell you what happened at \n                         school?\n\n               Concepcion shakes her head no.\n\n               INT. RAMON'S ROOM - DAY\n\n               Ramon is still playing violin as Concepcion and Roberta enter. \n               When he sees Roberta he straightens up even more.\n\n                                     CONCEPCION\n                         Roberta wants to talk to you, O.K.?\n\n               He nods. Concepcion touches his head, then exits.\n\n                                     RAMON\n                         Did that sound O.K.?\n\n                                     ROBERTA\n                         Yeah, it did.\n\n               Ramon smiles, pleased with himself.\n\n                                     ROBERTA\n                         I've been thinking about Justin. \n                         Remember how mad I got the last time \n                         I saw him?\n\n                                     RAMON\n                         Yeah. You got very strict with him.\n\n                                     ROBERTA\n                         It wasn't always so easy to be nice \n                         to him, you know?\n\n               Ramon looks away from her, upset.\n\n                                     RAMON\n                         You think Justin's in heaven or hell?\n\n                                     ROBERTA\n                         Heaven.\n\n               Ramon runs his fingers along his bow.\n\n                                     RAMON\n                         I told him to drop dead.\n\n               Roberta touches Ramon's back.\n\n                                     ROBERTA\n                         Justin didn't die because of what \n                         you said. I promise.\n\n                                     RAMON\n                         How do you know?\n\n                                     ROBERTA\n                         I don't think you're that powerful, \n                         do you? I mean, if you had such \n                         powers, just imagine what kind of \n                         violin player you'd be by now!\n\n                                     RAMON\n                         Yeah. I'd be better than you!\n\n               They laugh together, then Ramon looks sad again.\n\n                                     ROBERTA\n                         It's O.K. to cry, you know.\n\n                                     RAMON\n                         Not for a man.\n\n                                     ROBERTA\n                         My boys still cry and they're big, \n                         strong young men now.\n                              (beat)\n                         I bet Justin's daddy cried.\n\n               Ramon's eyes get teary. Roberta quietly leaves the room.\n\n               EXT. ROBERTA'S BROWNSTONE - ESTABLISHING - DAY (SPRING)\n\n               INT. ROBERTA'S BROWNSTONE - LIVING ROOM - DAY\n\n               Roberta brings in the mail, looking curiously at a manila \n               envelope with a return address from the NY REVIEW OF BOOKS. \n               She opens it, looks inside, then pours out a batch of other \n               letters onto the table. They're addressed to BOX HOLDER 127. \n               She opens one, reads it, then rushes to an INTERCOM.\n\n                                     ROBERTA\n                         Nick, Lexi! Get down here right now!\n\n               INT. ROBERTA'S BROWNSTONE - MOMENTS LATER\n\n                                     NICK\n                         We were just trying to help!\n\n               Nick and Lexi stand by the table, opposite Roberta -- with \n               the incriminating pile of letters between them.\n\n                                     ROBERTA\n                         This is humiliating!\n\n                                     NICK\n                         Mom, no one knows it's you! I mean, \n                         you don't even have to read them if \n                         you don't want to.\n                              (glances at pile)\n                         Although obviously, a lot of guys \n                         are interested in dating you.\n\n                                     ROBERTA\n                         No. A lot of guys are interested in \n                         dating you and Lexi.\n                              (beat)\n                         What did you say about me, anyway?\n\n               They thought she'd never ask.\n\n                                     NICK\n                         \"Beautiful musician, late 40's, tired \n                         of playing solo --\n\n                                     LEXI\n                         -- seeks a healthy, stable, attractive \n                         man who's not afraid of a duet with \n                         a strong, independent woman.\n\n                                     NICK\n                         My violin playing will feed your \n                         soul...\n\n                                     LEXI\n                         ...And my lasagna will be music to \n                         your palate.\"\n\n               They beam with pride. Roberta looks at them, mortified.\n\n                                     ROBERTA\n                         Oh, my God.\n\n                                     LEXI\n                         Did you catch all the music metaphors?\n\n                                     ROBERTA\n                         Don't you think it's a little weird \n                         that you're trying to get your mother \n                         a date?\n\n                                     NICK\n                         Don't you think it's a little weird \n                         that you're not even interested in \n                         dating?\n\n                                     ROBERTA\n                         Boys, look. Number one -- even if I \n                         wanted to date, I don't have time. \n                         And number two -- I've got my \n                         teaching, I've got you guys -- that's \n                         all I need.\n\n               The boys nod, disappointed, and she exits. They look at each \n               other with glum expressions.\n\n                                     LEXI\n                              (to Nick)\n                         I really thought she'd like the music \n                         metaphors.\n\n               INT. ROBERTA'S BROWNSTONE - LIVING ROOM - NIGHT\n\n               Roberta lies on the couch, reading the personal ad letters. \n               She tosses one aside, then opens another.\n\n               INSERT\n\n               The letter is designed like a newspaper with a headline that \n               reads: JOURNALISM PROFESSOR DAN PAXTON ANSWERS PERSONAL AD; \n               HOPES RUN HIGH BEAUTIFUL MUSICIAN WILL CALL FOR A DATE!\n\n               BACK TO SCENE\n\n               Roberta can't help but be charmed.\n\n               INT. ROBERTA'S BROWNSTONE - LIVING ROOM - NIGHT\n\n               Roberta, Nick and Lexi play Haydn's \"Trio #13\" together on \n               their respective instruments. We sense that this is a special \n               family ritual. They play throughout their conversation:\n\n                                     ROBERTA\n                         I think you're flat, Nick.\n\n                                     NICK\n                         I'm not flat.\n\n                                     ROBERTA\n                         The B sounded flat.\n\n                                     NICK\n                         Just play the violin, Mom. I'll take \n                         care of the cello.\n\n               They play for a few beats.\n\n                                     LEXI\n                         You nervous, Mom?\n\n                                     ROBERTA\n                         No. I'm fine.\n\n               The DOORBELL rings and Roberta jumps up, bolting into the \n               bathroom down the hall.\n\n               Lexi and Nick exchange a smile, then Lexi crosses to the \n               door and opens it.\n\n               INT. DOORWAY - CONTINUOUS\n\n               Standing in the doorway is a man in casual college professor \n               attire. He's nice-looking, but no Prince Charming. He shakes \n               Lexi's hand and smiles warmly.\n\n                                     DAN\n                         Hi. I'm Dan Paxton.\n\n               Lexi shows him in.\n\n               INT. ROBERTA'S BATHROOM - CONTINUOUS\n\n               IN THE MIRROR - Roberta takes a last look at herself, \n               wondering if he'll find her attractive. She touches her hair, \n               adjusts her dress, then takes a deep breath as she builds up \n               her courage.\n\n               INT. ROBERTA'S BROWNSTONE - LIVING ROOM - CONTINUOUS\n\n               Roberta enters the living room where Dan is chatting with \n               Nick and Lexi. Dan sees her and is instantly smitten.\n\n                                     DAN\n                              (shaking her hand)\n                         Wow. An honest woman.\n\n                                     ROBERTA\n                         Honest?\n\n                                     DAN\n                         Your ad. When you said you were \n                         beautiful, you were telling the truth.\n\n               She smiles, blushing, and avoids eye contact with her sons \n               who are trying really hard not to laugh. As she and Dan start \n               to exit:\n\n                                     NICK\n                         Make sure you're home by midnight, \n                         young lady.\n\n               INT. ROBERTA'S BROWNSTONE - LIVING ROOM - NIGHT\n\n               CLOSE ON CLOCK\n\n               It reads 12:30.\n\n               WIDER - Nick and Lexi play a video game on the TV screen. \n               O.S., there's the SOUND OF A CAR. They race to the window.\n\n                                     LEXI\n                         Ten bucks he tries to kiss her.\n\n                                     NICK\n                         That's a no-brainer. Of course he'll \n                         try. The real question is whether \n                         she'll let him.\n\n                                     LEXI\n                         O.K. -- ten bucks she lets him.\n\n                                     NICK\n                         You're on.\n\n               They stare out the window intently.\n\n               INT. DAN'S CAR - NIGHT\n\n               Dan pulls his car up in front of Roberta's house. Beside \n               him, Roberta holds a program from a Lincoln Center concert. \n               Roberta's tense, but Dan seems relaxed and centered in his \n               attraction to her.\n\n                                     DAN\n                         I had a lot of fun tonight.\n\n                                     ROBERTA\n                         Yeah, I did too.\n\n                                     DAN\n                         I have a confession -- I've never \n                         answered an ad before. I did it on a \n                         dare.\n\n                                     ROBERTA\n                         Well, I have a confession -- my boys \n                         placed the ad behind my back.\n\n               They both laugh, then smile at each other. An awkward beat: \n               will he or won't he? Dan leans in to kiss her, and Roberta \n               turns away, uncertain.\n\n                                     ROBERTA\n                         Look, Dan -- I went along with this \n                         'cause it's been a while. Quite a \n                         while... And I had a very nice time... \n                         but I'm not sure if I'm ready to get \n                         involved with anyone right now.\n\n               A beat. Roberta feels badly about rejecting him.\n\n                                     DAN\n                              (deadpan)\n                         Does this mean I don't get any \n                         lasagna?\n\n               Roberta cracks up. Dan smiles at her.\n\n               INT. ROBERTA'S BROWNSTONE - NIGHT\n\n               Roberta enters. The boys are back to their video game, \n               covering that they've been spying on her.\n\n                                     ROBERTA\n                         Why are you guys still up?\n\n                                     NICK\n                              (all innocence)\n                         Why? Is it late?\n\n                                     ROBERTA\n                         Good try, Nick.\n\n                                     LEXI\n                         So how was it?\n\n                                     ROBERTA\n                         Well... he's nice.\n\n                                     NICK\n                         \"Nice\"? As in \"let's just be friends\" \n                         nice?\n\n                                     ROBERTA\n                         I don't know yet. We'll see.\n\n               Nick looks disappointed.\n\n                                     NICK\n                         There's still a lot more letters.\n\n                                     ROBERTA\n                         Good night, Nick.\n\n               She starts heading upstairs.\n\n                                     LEXI\n                         Hey, Mom -- can you loan me ten \n                         dollars?\n\n               INT. CPE 1 - MUSIC ROOM - DAY\n\n               THE BLACKBOARD reads: SPRING CONCERT IN 10 DAYS! PRACTICE \n               PRACTICE PRACTICE!\n\n               Roberta rushes in, frazzled, not noticing at first that the \n               beginners are very quiet -- and that most don't have violins.\n\n                                     ROBERTA\n                         Guys, I'm so sorry -- I got stuck \n                         over at CPE 2...\n\n               She puts her stuff down, then looks at the kids.\n\n                                     ROBERTA\n                         What's going on? Where are all your \n                         violins?\n\n                                     RAMON\n                         We heard you got fired.\n\n                                     ROBERTA\n                         What?!\n\n               EXT. HALLWAY - DAY\n\n               Janet and Dennis talk outside Janet's office. Roberta storms \n               over to them. Janet looks at her, alarmed.\n\n                                     ROBERTA\n                         Is it true?\n\n                                     JANET\n                         Why don't you come in my office?\n\n                                     ROBERTA\n                         It's true? You're firing me?\n\n                                     JANET\n                         It's not me, Roberta. The Board of \n                         Ed. cut the budget, the District had \n                         to comply, and as of the end of this \n                         term, the violin program has been... \n                         excessed.\n\n               Roberta takes this in, momentarily speechless. In the b.g., \n               the beginners slip into the hall to watch.\n\n                                     ROBERTA\n                         Excessed.\n                              (beat)\n                         They specifically said that my violin \n                         program has to go.\n\n                                     JANET\n                         They've slashed the budget -- music \n                         and art programs got hit the worst.\n\n                                     ROBERTA\n                         What about Dennis' classes?\n\n                                     DENNIS\n                         I'm tenured, Roberta.\n\n               Roberta looks at him, then back to Janet.\n\n                                     ROBERTA\n                         When was this decided?\n\n                                     JANET\n                         Things happened very quickly... I \n                         wanted to tell you myself --\n\n                                     ROBERTA\n                              (reeling)\n                         I just... I can't even believe this \n                         is happening!\n\n                                     DENNIS\n                         Why not? You're a sub. Your position \n                         has never been permanent.\n\n                                     JANET\n                         Shut up, Dennis! You're not helping!\n                              (softly, to Roberta)\n                         Come into my office, please.\n\n               They leave Dennis standing there, looking as if he's had his \n               face slapped.\n\n               INT. JANET WILLIAMS' OFFICE - CONTINUOUS\n\n                                     ROBERTA\n                         There's gotta be a way to fight this!\n\n                                     JANET\n                         Fight it with what? I don't have any \n                         other extra programs to give them \n                         instead.\n\n                                     ROBERTA\n                         Oh, I see. So after ten years, after \n                         fourteen hundred children have learned \n                         to play the violin, this is just an \n                         \"extra program.\"\n\n                                     JANET\n                         You know I don't feel that way and \n                         you know damn well I've been standing \n                         by you all these years! You think I \n                         haven't noticed what you've done for \n                         these kids?\n\n                                     ROBERTA\n                         Then do something!\n\n                                     JANET\n                              (points to her phone)\n                         I've been on this phone for the past \n                         three days trying to \"do something\" -- \n                         the District office can't even stand \n                         the sound of my voice. Believe me, \n                         there are some people around here \n                         I'd much rather get rid of. But as \n                         far as the Board's concerned, violin \n                         classes are not a priority.\n\n               Roberta's fury starts to give way to grief. She looks terribly \n               wounded. Janet looks at her helplessly.\n\n                                     JANET\n                         I don't have the power here, Roberta. \n                         I'm so sorry.\n\n               A beat, and Roberta exits.\n\n               EXT. SCHOOL YARD - DAY\n\n               Roberta's dazed and in pain as she walks through the crowds \n               of children, oblivious to kids calling her name and waving.\n\n               INT. ROBERTA'S BROWNSTONE - DAY (LATE AFTERNOON)\n\n               Nick and Lexi enter the darkened house, chatting as Nick \n               wheels in the bike and Lexi bounces a basketball. They turn \n               on a light to reveal\n\n                                     ROBERTA\n                         sitting at the kitchen table with a \n                         glass of wine, her face ashen.\n\n                                     NICK\n                         What happened?\n\n               EXT. STREETS - DAY (LATE AFTERNOON)\n\n               Roberta, Nick and Lexi walk Allegra in their neighborhood. \n               Roberta looks worn out.\n\n                                     ROBERTA\n                         I'm a good teacher. I've worked so \n                         hard to give these kids something to \n                         be proud of.\n\n               Lexi moves to comfort her.\n\n                                     LEXI\n                         I'm so sorry, Mom. I can't believe \n                         they did this to you.\n\n                                     ROBERTA\n                         It's like when my father got killed. \n                         For twenty years, he followed every \n                         safety rule the factory had, and \n                         then someone else flips the wrong \n                         switch...\n                              (she chokes up)\n                         It's not fair. You do everything \n                         right and then...\n\n                                     NICK\n                         It's the wrong analogy. You couldn't \n                         do anything about Grandpa's death. \n                         It was irreversible. This isn't.\n\n                                     ROBERTA\n                         Tell that to the Board of Education.\n\n                                     NICK\n                         Let me ask you something. Why did \n                         you risk your life for a bicycle?\n\n               Roberta and Lexi look at Nick, baffled as to the relevance \n               of the question.\n\n                                     ROBERTA\n                         I did not risk my life.\n\n                                     NICK\n                         Of course you did! That building? \n                         Threatening Henry? And for what -- \n                         two hundred dollars?\n\n                                     ROBERTA\n                         No. Not for that.\n\n                                     LEXI\n                         Then why?\n\n                                     ROBERTA\n                         When someone steals something that \n                         belongs to my kids, I'm not gonna \n                         sit back and let that happen!\n\n               A beat as she realizes what she's just said. The boys look \n               at her and the three of them stop walking.\n\n                                     ROBERTA\n                         Guys -- you need to think about this. \n                         If I try to fight this -- with no \n                         salary coming in -- I could lose the \n                         house, screw up your college plans... \n                         It would be a lot safer to just go \n                         out tomorrow and get a job in a \n                         private school.\n\n                                     LEXI\n                         Yeah, but is that where you really \n                         want to be?\n\n               INT. ROBERTA'S HOUSE - LIVING ROOM - NIGHT\n\n               Roberta frantically searches through her purse, then crosses \n               to a hall closet and quickly checks the pockets of her coats \n               and jackets.\n\n               She feels inside a jacket pocket, then finds it: DOROTHEA'S \n               BUSINESS CARD.\n\n               EXT. COLUMBIA UNIVERSITY - ESTABLISHING - DAY\n\n               INT. COLUMBIA UNIVERSITY - DEPT. OF JOURNALISM - DAY\n\n               FOLLOW DAN PAXTON as he walks down the hall towards his office \n               and sees a strange silver object on the floor in front of \n               his office door. He picks it up.\n\n               INSERT\n\n               -- A foil-covered plate with a note on top: DO YOU KNOW ANYONE \n               AT THE NEW YORK TIMES?\n\n               BACK TO SCENE\n\n               Dan lifts up the foil to reveal a large piece of LASAGNA.\n\n               INT. CPE 1 AUDITORIUM - THE CONCERT - STAGE - NIGHT\n\n               SEVENTY-FIVE KIDS play \"We Shall Overcome\" and it's incredibly \n               moving. Nick's on cello, Lexi plays piano. ROBERTA proudly \n               leads the children. At the side of the stage, we see DOROTHEA \n               photographing the concert. THE CAMERA PANS THE AUDIENCE of \n               teary-eyed parents, many of them with CAM CORDERS. We FIND \n               Ramon's family. Manuelo is riverted by his son's playing, \n               and he starts to cry. Concepcion knows this without looking. \n               She takes his hand.\n\n               ANGLE - JANET stands along the side and her eyes start to \n               fill with tears. She tries to stay composed, then discreetly \n               exits the auditorium.\n\n               The song ends and the audience APPLAUDS, rising from their \n               seats, including ASSUNTA (now 65), next to ISABEL and DAN. \n               Someone remains seated: a REPORTER (40's), sitting beside \n               Dan and taking notes.\n\n               The STUDENTS bow, then point to Roberta who bows and takes \n               the stage. She gestures for people to sit. A beginner student \n               brings her flowers. Roberta kisses her, then approaches the \n               mike.\n\n                                     ROBERTA\n                              (to the audience)\n                         The beautiful concert that you just \n                         heard could be the last concert of \n                         the East Harlem Violin Program. The \n                         Board of Education and the District \n                         Superintendent don't think that music \n                         is important for our children. But \n                         they're wrong -- and they're in for \n                         a fight.\n\n               The parents stand and applaud. We see the REPORTER writing \n               quickly. Dorothea snaps more pictures. Roberta extends an \n               arm towards the kids, directing the applause at them. Ramon \n               gives her a thumbs up.\n\n               INT. ROBERTA'S BROWNSTONE - LIVING ROOM - NIGHT\n\n               ROBERTA is vacuuming the living room while Assunta dusts. \n               Extra chairs are set up in the living room in preparation \n               for a meeting. The doorbell RINGS.\n\n                                     ROBERTA\n                         Someone's early.\n\n               FOLLOW ASSUNTA to the DOOR. She opens it, revealing JANET, \n               who's carrying two bags of groceries. Assunta's demeanor \n               instantly cools when she sees her. In the b.g. Roberta sees \n               Janet and turns off the vacuum cleaner.\n\n                                     JANET\n                         Hello, Assunta. How are you?\n\n                                     ASSUNTA\n                         I'd be a lot better if my daughter \n                         had a job next year.\n\n                                     ROBERTA\n                         Ma!\n\n                                     JANET\n                              (to Assunta)\n                         I would too.\n\n               Janet briskly walks into THE LIVING ROOM, puts the grocery \n               bags down on a table, and begins to take things out of them. \n               Roberta watches her, mystified.\n\n                                     JANET\n                              (to Roberta)\n                         Sorry I'm early, but I figured we'd \n                         need time to set up.\n\n               Roberta watches Janet for a beat, then addresses Assunta.\n\n                                     ROBERTA\n                         Mama, why don't you take Allegra out \n                         for a walk?\n\n               Assunta hesitates for a beat, then gets the dog and exits. \n               Janet continues unpacking the bags as if there's nothing \n               unusual about her being there. Cheeses, crackers, bread, \n               salads, fruit, paper plates, napkins, etc. She sees Roberta's \n               confused expression.\n\n                                     JANET\n                         You are having a meeting here tonight, \n                         right? Parents and teachers?\n\n                                     ROBERTA\n                         Well, yes, but ...\n\n                                     JANET\n                         Take it from me. If you want to get \n                         parents to help you with something, \n                         you have to feed them.\n\n               She holds up two wedges of cheese.\n\n                                     JANET\n                         You have a cutting board for these?\n\n               Roberta crosses into the kitchen and returns with a cutting \n               board and a knife.\n\n                                     JANET\n                              (as she continues to \n                              unpack)\n                         And if you think parents are bad, \n                         teachers are even worse, no offense. \n                         If you don't feed them, you never \n                         get anything extra out of them. That's \n                         why I got this.\n\n               She pulls out an Entenmann's blackout cake.\n\n                                     JANET\n                         Entenmann's gets them every time.\n\n               Roberta continues to stare in amazement at Janet.\n\n                                     JANET\n                         What? Don't tell me you expected me \n                         to bring something homemade.\n\n                                     ROBERTA\n                              (as she takes the \n                              cake from her)\n                         Well, no... I --\n\n                                     JANET\n                         Good. Because take it from me -- my \n                         own family begs me to stay out of \n                         the kitchen.\n\n                                     ROBERTA\n                         What I didn't expect was for you to \n                         be here.\n\n                                     JANET\n                         Why not? We've gotta figure out a \n                         way to fight this.\n                              (as she arranges \n                              crackers on a plate)\n                         After ten years, Roberta, I can't \n                         imagine walking through those hallways \n                         and not hearing that off-key, \n                         screechy, scratchy, nails-on-the-\n                         blackboard violin music.\n\n               Roberta smiles. Janet holds up a baguette.\n\n                                     JANET\n                         What do you think? Cut it into slices \n                         now, or leave it whole?\n\n                                     ROBERTA\n                         Let's cut it now. It'll be less messy.\n\n               Janet hands her the bread. A beat as the two women exchange \n               a private smile, then return to their respective tasks.\n\n               INT. ROBERTA'S BROWNSTONE - NIGHT\n\n               There's a crowd of PARENTS assembled in Roberta's front room, \n               talking at once, yelling out ideas, including CONCEPCION, \n               BEVERLY WILSON (Shandra's mom), MR. ADAMS (Black) and MRS. \n               ADAMS (Puerto Rican), the parents of James (from Roberta's \n               first year) and Simon. DOROTHEA, JANET, ISABEL are also there; \n               ASSUNTA is keeping tabs on the refreshments.\n\n                                     ISABEL\n                         Don't they realize how much this \n                         program helps the kids?\n\n                                     MR. ADAMS\n                         Simon's our third child to study \n                         with Roberta. James is pre-med, \n                         April's valedictorian -- now that \n                         says something!\n\n                                     MR. KLEIN\n                         I think we should inundate the Board \n                         and the District with letters.\n\n                                     JANET\n                         You're wasting your time. The Board \n                         and the District are not gonna pay \n                         for this program, no matter how many \n                         letters they get.\n\n               Disappointed grumblings.\n\n                                     ISABEL\n                         What if we raise the money ourselves?\n\n                                     JANET\n                         I can't see how they'd object to \n                         that.\n\n               A beat as people take this in.\n\n                                     CONCEPCION\n                         Well once that newspaper article \n                         comes out, that should help bring in \n                         money.\n\n                                     BEVERLY\n                         Yeah, but what if it doesn't? For \n                         all we know, it's gonna be buried on \n                         the back page. Besides, who says \n                         anyone's gonna give a damn about our \n                         kids?\n\n                                     DOROTHEA\n                              (to Roberta)\n                         What if you do a benefit concert? We \n                         can raise a batch of money from ticket \n                         sales, and then the concert itself \n                         could be great publicity. There's \n                         word of mouth... you could get \n                         reviewed...\n\n                                     ROBERTA\n                         It better be a good concert!\n\n               Some people laugh but we see the anxiety on Roberta's face.\n\n                                     ROBERTA\n                         We have to offer something more than \n                         me and the kids.\n                              (to Dorothea)\n                         Do you think maybe your husband would \n                         perform with us?\n\n                                     DOROTHEA\n                              (slyly)\n                         I'm sure I could persuade him with a \n                         little pillow talk. And maybe he can \n                         get another violinist too -- Itzhak \n                         Perlman, perhaps.\n\n               This gets people's attention.\n\n                                     ROBERTA\n                         That would be fantastic.\n\n                                     DOROTHEA\n                         We could rent a place like the 92nd \n                         Street Y -- it's perfect for this. \n                         It seats about nine hundred people \n                         and if we charge between fifty and a \n                         hundred a ticket --\n\n                                     ISABEL\n                              (to Roberta)\n                         We could probably raise enough to \n                         reinstate your program for a year.\n\n                                     JANET\n                         Sounds like a plan.\n\n                                     ROBERTA\n                              (half to herself)\n                         It better be a good concert.\n\n               The DOORBELL RINGS and Roberta crosses to get it. DAN enters, \n               holding copies of the NY POST, the DAILY NEWS, and a couple \n               of other papers. Each paper has been opened to a specific \n               page.\n\n                                     DAN\n                         Take your pick.\n\n               Roberta grabs the top one -- the POST -- opened to page 5.\n\n               INSERT\n\n               The page has a photo of Roberta at the Spring Concert, and a \n               large article headlined A VIOLIN TEACHER FIGHTS BACK.\n\n               INT. MUSIC ROOM - DAY\n\n               Lots of chaos as a TELEVISION NEWS CREW sets up. Roberta \n               tries futilely to get the beginners to pay attention to her.\n\n                                     ROBERTA\n                         Kids, listen to me -- it's really \n                         important that you don't look at the \n                         camera and you try to act as natural \n                         as possible.\n\n               Dennis storms in.\n\n                                     DENNIS\n                         Who authorized this?\n\n                                     ROBERTA\n                         Janet.\n\n                                     DENNIS\n                         Well Janet's not here today and I \n                         want these people out of here.\n\n               The kids quiet down and watch them argue. A CAMERA GUY starts \n               shooting the argument and Dennis sees him.\n\n                                     DENNIS\n                         Turn that off, you hear me?\n\n                                     ROBERTA\n                         Why are you doing this? We're not \n                         bothering anyone.\n\n                                     DENNIS\n                         You're disrupting school and I want \n                         them out of here -- now.\n\n                                     ROBERTA\n                         You still don't get it, do you? I \n                         don't care if you hate me, Dennis -- \n                         that's your business. But think about \n                         the students for once. Every time \n                         you interfere, you're not hurting me -- \n                         you're hurting them.\n\n               She points to the kids. They're silent, waiting to see if \n               Roberta got through to him. A beat.\n\n                                     DENNIS\n                         Get these people out of here or I'm \n                         calling the police.\n\n                                     ROBERTA\n                         Go right ahead, call them. That'll \n                         look real good on the eleven o'clock \n                         news.\n\n               A beat and he exits. Roberta takes a deep breath, then turns \n               back to the kids who are watching her, impressed.\n\n                                     RAMON\n                         I don't hear no sirens.\n\n               INT. ROBERTA'S BROWNSTONE - LIVING ROOM - NIGHT\n\n               ON THE TV is the news segment: ROBERTA speaks to an unseen \n               interviewer.\n\n                                     ROBERTA\n                         I'm from a blue collar family, and \n                         if it weren't for the lessons I got \n                         in public school, I never would have \n                         learned the violin.\n\n               It CUTS TO Roberta's beginners speaking to the interviewer.\n\n                                     INTERVIEWER (O.S.)\n                         How does it make you feel to lose \n                         your violin program?\n\n                                     SHANDRA\n                         It makes us sad!\n\n                                     RAMON\n                         Yeah, like we're never gonna have no \n                         more violin lessons --\n\n                                     VANESSA\n                         And it's bad because... because we \n                         love violin class.\n\n               WIDER - REVEAL Roberta, Lexi and Nick watching the TV.\n\n               INT. ARNOLD STEINHARDT AND DOROTHEA'S APARTMENT - NIGHT\n\n               ON TV - THE SAME NEWS SEGMENT, ANOTHER SOUND BITE\n\n                                     ROBERTA\n                         Yes, I've gotten offers from two \n                         private schools, but this is where I \n                         want to be.\n\n                                     DOROTHEA (O.S.)\n                         Arnold, these kids need help.\n\n               WIDER - REVEAL a comfortable Upper East Side apartment and \n               DOROTHEA watching T.V. while ARNOLD practices violin. There's \n               FRAMED PHOTOGRAPHY on the walls, signed by Dorothea.\n\n                                     ARNOLD\n                         Didn't we send them a donation?\n\n                                     DOROTHEA\n                         They need something bigger. And you \n                         can't just write a check -- you have \n                         to get involved.\n\n                                     ARNOLD\n                         Involved how?\n\n               The look on her face tells him it's more than he bargained \n               for.\n\n                                     ARNOLD\n                         Uh-oh.\n\n               INT. SERIES OF SHOTS - DAY\n\n               1. Arnold Steinhardt speaks on the phone. His Roladex is \n               open to the name ITZHAK PERLMAN. In the b.g., Dorothea tensely \n               waits to hear if Itzhak Perlman will say yes.\n\n               2. Parents, Roberta, Nick and Lexi hang \"FIDDLEFEST CONCERT\" \n               posters around their neighborhood, announcing a concert at \n               THE 92ND STREET Y with ARNOLD STEINHARDT, ITZHAK PERLMAN and \n               STUDENTS FROM THE EAST HARLEM VIOLIN PROGRAM.\n\n               3. Parents -- including Beverly Wilson, Concepcion, Mr. Adams \n               and Carlos' mom and dad -- stuff envelopes with INVITATIONS \n               to \"FIDDLEFEST\" and accompanying LETTERS and TICKET ORDER \n               FORMS. Roberta and Dorothea open envelopes with filled-out \n               TICKET ORDER FORMS and CHECKS. They stack the checks in a \n               pile, address return envelopes and place FIDDLEFEST TICKETS \n               inside them.\n\n               INT. MUSIC ROOM - DAY\n\n               Thirty-three excited kids from Roberta's different classes \n               chat, tune their violins, rosin their bows. The students \n               include Carlos, Stephanie, Amanda, Kenny, Rachel, Simon, \n               Ramon, Vanessa, and Shandra. Roberta enters the room, full \n               of energy, and addresses them as she heads to the front.\n\n                                     ROBERTA\n                         Listen up, everyone! Quiet down!\n\n               The students give her their attention.\n\n                                     ROBERTA\n                         You are my very best beginner and \n                         advanced violin students and I've \n                         chosen you to play in Fiddlefest \n                         because I trust that you can handle \n                         the pressure. It's gonna be a lot of \n                         work -- a lot. Right now, we've sold \n                         some tickets, but I'm not gonna be \n                         back here in the fall if the audience \n                         storms out of their seats, demanding \n                         a refund!\n\n               She nods to Rachel who starts handing out sheets of music.\n\n                                     ROBERTA\n                         Rachel's gonna be my lieutenant and \n                         I expect you to listen to her.\n\n               Ramon looks through his music sheets.\n\n                                     RAMON\n                         Bach's \"Minuet One\"?\n\n                                     ROBERTA\n                         People are gonna be paying good money \n                         for this concert -- we're not just \n                         gonna play \"Twinkle.\"\n                              (handing out papers)\n                         I'm passing out a contract that you \n                         and your parents need to sign.\n\n               The kids read the contracts. Carlos' eyes widen.\n\n                                     CARLOS\n                         Every Saturday and Sunday?\n\n                                     ROBERTA\n                         Plus night time rehearsals during \n                         the week. There's only six weeks \n                         till the concert, so classes in school \n                         won't be enough.\n\n               The kids look sobered by this.\n\n                                     ROBERTA\n                         Come to think of it, we'll probably \n                         also need to meet before school.\n\n               Lots of grumbling: \"Say what?\" \"No way!\" \"Before school?\" \n               I'ma be sleepwalking!\"\n\n                                     ROBERTA\n                         You've heard of Navy Seal Training? \n                         Well, this is gonna be Roberta String \n                         Training.\n\n               ANOTHER ANGLE - Two young men and two young women walk in, \n               carrying violins. We realize from the scar that one is NAEEM \n               (20), now a strikingly handsome man, over six feet tall. \n               With him is DE SEAN (19), a short guy with dreadlocks, looking \n               more like a rapper than a violinist. GUADALUPE (19), walking \n               with a cane, is now a beautiful young woman, her long braid \n               pinned up. The fourth is a reserved Puerto Rican woman (20).\n\n                                     ROBERTA\n                         Oh my god! Naeem! De Sean!\n                              (hugs them)\n                         Guadalupe!\n\n               She hugs her, then looks closely at the other woman.\n\n                                     ROBERTA\n                         Lucy? Is that you?\n\n               The woman snaps her fingers and smiles. Roberta laughs and \n               embraces her, then turns to the students.\n\n                                     ROBERTA\n                         Kids, these are four of my very first \n                         violin students and I've asked them \n                         to play in the concert with us.\n                              (to the alumni)\n                         I was just telling them how hard \n                         they're gonna have to work.\n\n                                     DE SEAN\n                              (to class)\n                         Take it from me -- this lady don't \n                         lie. Y'all are gonna work your butts \n                         off.\n\n               INT. RAMON'S HOUSE - NIGHT\n\n               Ramon's father carefully reads the violin contract while \n               Ramon and Concepcion anxiously watch. He stops to look up a \n               word in the English-Spanish dictionary beside him. Ramon and \n               his mom are squirming. Manuelo nods as he finishes reading, \n               then SIGNS the contract. Ramon breaks into a smile, throws \n               his little arms around his Papa and kisses him.\n\n               EXT. RIVER EAST - DAY\n\n               School's letting out; Carlos' sister exits, carrying Carlos' \n               violin. A few beats later, Carlos quickly exits, checking \n               his watch. He sees his LOS LEONES teammates standing in a \n               group, and tries to bypass them without being noticed, but \n               they spot him.\n\n                                     TEAMMATE #1\n                         Hey Carlos! Where ya goin'? We got a \n                         game, remember?\n\n                                     CARLOS\n                         Yeah, I know, but... I can't make \n                         it.\n\n                                     TEAMMATE #1\n                         What you talkin' about?\n\n                                     CARLOS\n                         I just can't make it.\n\n                                     TEAMMATE #2\n                         You got a date with the violin \n                         teacher?\n\n               A beat.\n\n                                     CARLOS\n                         Yeah. I do.\n\n               He dashes off, a barrage of Spanish and English curses behind \n               him, and crosses to his sister, waiting for him DOWN THE \n               STREET. He takes the violin from her and carries it himself.\n\n               INT. CPE MUSIC ROOM - DAY\n\n               The Fiddlefest kids, including Carlos, Vanessa, Shandra, \n               Ramon, Stephanie, Amanda, Kenny, Simon, Thomas, De Sean and \n               Guadalupe practice Bach's \"Minuet One,\" Roberta leading them \n               and giving direction. They're playing badly.\n\n               Rachel plays as well, but walks around the room making \n               corrections. It's early morning, and the kids look half-\n               asleep.\n\n                                     ROBERTA\n                         Frog! Frog! I need more accents on \n                         the down beat! More bow! More!\n\n               They play a few more bars and still sound pretty bad.\n\n                                     ROBERTA\n                         Stop! Stop!\n                              (they do so)\n                         You sound horrible! Isn't anyone \n                         practicing?\n\n                                     CARLOS\n                         How can we practice? We're rehearsing \n                         all the time.\n\n               Some kids laugh, including Stephanie.\n\n                                     ROBERTA\n                              (to Stephanie)\n                         You think this is funny, Stephanie?\n                              (to all of them)\n                         You think the four hundred people \n                         who've bought tickets so far will \n                         think it's funny too? You think Itzhak \n                         Perlman will think it's funny that \n                         he's donating his time and you're \n                         all gonna stink?\n\n               Vanessa yawns and Roberta sees her. Uh-oh.\n\n                                     ROBERTA\n                         Am I boring you, Vanessa?\n\n                                     VANESSA\n                         No. It's 7:30 in the morning. I'm \n                         just tired.\n\n                                     ROBERTA\n                         There's no time to be tired.\n                              (to all, getting her \n                              violin in position)\n                         Let's try it again.\n\n               INT. ARNOLD AND DOROTHEA'S APARTMENT - DAY\n\n               Dorothea opens the door for Roberta who just charges in, \n               agitated, without even saying hello. We sense that Dorothea \n               too, is troubled by something.\n\n                                     ROBERTA\n                         I must have been crazy to agree to \n                         this. They're never gonna be ready. \n                         And you should hear the Bach Double! \n                         A disaster. So the good news is \n                         tickets are selling like hot cakes, \n                         but the bad news is that the kids \n                         sound like shit.\n\n                                     DOROTHEA\n                         There's more bad news... We've lost \n                         the Y.\n\n               Roberta looks at her, aghast.\n\n                                     ROBERTA\n                         What?!\n\n                                     DOROTHEA\n                         They had a flood -- a water heater \n                         burst... The concert hall was damaged \n                         and they've cancelled all events.\n\n                                     ROBERTA\n                         Until when?\n\n                                     DOROTHEA\n                         \"Until further notice.\"\n\n                                     ROBERTA\n                         This can't happen! We've sold tickets! \n                         We've done publicity! The concert's \n                         in three weeks!\n\n                                     DOROTHEA\n                         I've been on the phone all morning \n                         calling other theaters. Nothing's \n                         available.\n\n               They both sink into the couch, completely undone by this.\n\n                                     ROBERTA\n                         Just keep looking.\n\n               INT. ROBERTA'S BROWNSTONE - NIGHT\n\n               The Fiddlefest kids are crammed into Roberta's house, \n               (including De Sean, Guadalupe, Ramon, Vanessa, Shandra, \n               Carlos, Thomas, Stephanie, Amanda, Kenny, and Simon), \n               rehearsing \"Orange Blossom Special.\" They play badly. Rachel \n               helps Roberta correct students.\n\n                                     ROBERTA\n                         Stop! Someone's playing the wrong \n                         notes! And you shouldn't need your \n                         music anymore! Except for the Bach \n                         Double, everything has to be memorized \n                         by next rehearsal!\n\n               The kids look at each other, daunted.\n\n                                     ROBERTA\n                         And you sound like you're \n                         sleepwalking. Your heart's not even \n                         in it.\n\n                                     VANESSA\n                         Maybe 'cause we don't have a place \n                         for the concert.\n\n               Roberta looks at her, and then notices the despondent looks \n               on many of the kids' faces.\n\n                                     ROBERTA\n                         Well, you're right. This might all \n                         be for nothing. So we can either \n                         keep on rehearsing in case we find a \n                         place -- or we can just... give up.\n\n                                     DE SEAN\n                         Am I hearing right? Did you use the \n                         words \"give up\"?\n                              (to the students)\n                         Let's take a vote. How many of you \n                         want to give up?\n\n               No one raises a hand. Roberta takes this in.\n\n                                     GUADALUPE\n                         See? You taught us well.\n\n               INT. ROBERTA'S BROWNSTONE - KITCHEN - DAY\n\n               It's early morning. Lexi cooks breakfast while Nick and \n               Roberta look at scribbled-on, marked-up lists.\n\n                                     ROBERTA\n                         What about in the Bronx?\n\n                                     NICK\n                         There's nothing.\n                              (beat)\n                         Why don't you just do it in one of \n                         the schools? It'll be a lot smaller \n                         but --\n\n                                     ROBERTA\n                         We won't make enough money.\n\n                                     LEXI\n                         What about postponing it?\n\n                                     ROBERTA\n                         Itzhak and Arnold are booked all \n                         summer.\n\n               They all look depressed. Lexi places an equally depressing-\n               looking stack of pancakes on the table. There's a BANGING on \n               the door, startling everyone.\n\n                                     DOROTHEA (O.S.)\n                         It's Dorothea.\n\n               Nick opens the door and Dorothea rushes in, out of breath, \n               talking a mile a minute.\n\n                                     DOROTHEA\n                         I have good news -- really good news. \n                         Arnold got a call from his friend \n                         Wally Scheur who heard about us losing \n                         the Y and wanted to see how he could \n                         help -- and then Wally had this \n                         brilliant idea and called his friend \n                         Isaac Stern and it's all arranged! \n                         We have a new place for Fiddlefest!\n\n                                     ROBERTA\n                         Where?\n\n                                     DOROTHEA\n                         Carnegie Hall.\n\n               Dorothea grins from ear to ear, Nick and Lexi whoop and \n               holler, and all wait for Roberta to jump up and down for joy -- \n               but she looks stricken.\n\n                                     ROBERTA\n                              (panicked)\n                         Carnegie Hall?\n\n               INT. CARNEGIE HALL - DAY\n\n               CLOSE ON THE CEILING OF CARNEGIE HALL, revolving slowly.\n\n               PULL BACK TO REVEAL THIS IS ROBERTA'S POV\n\n               She stands on the empty stage, gazing at the ceiling as she \n               slowly turns around. She's holding her violin case. She looks \n               at the UPPER BALCONIES -- THE LOWER BALCONIES -- THE ORCHESTRA \n               SEATS. Her footsteps echo as she walks towards the front of \n               the stage, then stops.\n\n               CLOSE ON ROBERTA\n\n               We can see her imagining the audience on the night of the \n               concert. She can't believe her eyes. A beat, and she looks \n               around to make sure she's alone. She takes out her violin, \n               takes a deep breath as she looks out towards her \"audience,\" \n               then starts to play the second violin part of the Bach Double \n               Concerto. Suddenly, there's the SOUND of a stage door opening. \n               Roberta stops.\n\n                                     MALE VOICE (O.S.)\n                         Incredible sound in this room, no?\n\n               Roberta turns to see ISAAC STERN approaching her. She's \n               completely flustered.\n\n                                     ROBERTA\n                         Oh my god -- Isaac Stern.\n\n                                     ISAAC STERN\n                         You must be Roberta.\n\n                                     ROBERTA\n                         Thank you so much for helping us.\n\n                                     ISAAC STERN\n                              (looking out at the \n                              hall)\n                         Would you believe in 1960, they tried \n                         to tear this place down? They wanted \n                         to replace it with a bright red \n                         skyscraper -- we called it \"the red \n                         terror.\"\n\n                                     ROBERTA\n                         You're kidding.\n\n                                     ISAAC STERN\n                         We had to fight like hell, but with \n                         a lot of help, we saved Carnegie \n                         Hall.\n\n               Roberta takes this in, relating it to her own struggle.\n\n                                     ISAAC STERN\n                         If it's all right with you, I'd like \n                         to play in your concert. Maybe bring \n                         a couple of friends...\n\n                                     ROBERTA\n                         Yes, of course! That would be great!\n\n               Isaac nods, then touches her shoulder.\n\n                                     ISAAC STERN\n                         Don't give up.\n\n               EXT. SIDEWALK CAFE, UPPER WEST SIDE - DAY\n\n               Roberta pours nervous energy into her cappuccino, adding \n               cinnamon, chocolate, and sugar, stirring loudly. Dan sits \n               across from her, observing.\n\n                                     ROBERTA\n                         I just don't see how I'm gonna do \n                         this. It's huge. It's gigantic! It's \n                         Carnegie Hall! And listen to this: \n                         now Isaac Stern wants to play with \n                         us -- Diane Monroe, Michael Tree -- \n                         there's other people calling --\n\n                                     DAN\n                         That's fantastic!\n\n                                     ROBERTA\n                         Fantastic? I'll never get the kids \n                         up to speed in time, I'll never get \n                         myself up to speed. I'm gonna be \n                         playing side by side with the world's \n                         greatest violinists.\n\n                                     DAN\n                         And \"the world's greatest violinists\" \n                         are playing side by side with you \n                         because they want to help you win \n                         this fight.\n\n               He offers her a forkful of some decadent-looking chocolate \n               cake, but she shakes her head.\n\n                                     ROBERTA\n                         Yes, but... you don't understand. \n                         Maybe there's a good reason why I \n                         never made it as a violinist -- maybe \n                         I just can't cut it. I keep blaming \n                         it on not having enough early \n                         training, but if I were talented, if \n                         I had a gift --\n\n                                     DAN\n                         But you do have a gift. You're gonna \n                         put thirty East Harlem kids on stage \n                         at Carnegie Hall not because they're \n                         prodigies, but because you got them \n                         to stick with something that's hard \n                         as hell and to strive for excellence -- \n                         which, by the way, I certainly wasn't \n                         striving for when I was their age. \n                         Not to mention the other ten years' \n                         worth of students whose lives were \n                         changed because of you. That's your \n                         talent, Roberta.\n\n               She takes this in, looks at him gratefully and puts her hand \n               over his. He strokes her hand.\n\n                                     ROBERTA\n                         I'm scared.\n\n                                     DAN\n                         I know.\n                              (beat)\n                         And by the way, I happen to think \n                         you're a pretty good violinist too.\n\n                                     ROBERTA\n                         You've barely heard me play.\n\n                                     DAN\n                         I've heard enough to know you're \n                         gonna do just fine.\n\n               Roberta looks at him with trepidation. Dan takes another \n               forkful of his cake.\n\n                                     DAN\n                         Besides, no one's gonna be paying \n                         attention to your playing anyway.\n\n               Roberta laughs. Dan smiles, glad he got her to lighten up.\n\n               EXT. CPE 1 - DAY (EARLY MORNING)\n\n               The Fiddlefest kids (including Ramon, Shandra, Vanessa, De \n               Sean, Naeem, Guadalupe, Lucy, Simon, Stephanie, Amanda and \n               Kenny -- but RACHEL is absent) stand outside the locked school \n               gate, waiting for Roberta. Some of the kids have their violins \n               out of the cases, tuning them.\n\n                                     CARLOS\n                         Teacher's late. I think she should \n                         be dropped, don't you?\n\n               Kids laugh.\n\n                                     RAMON\n                         Yeah. I don't think we should let \n                         her play in Fiddlefest!\n\n               A few kids start playing \"CAN-CAN.\" It catches on, and more \n               of them join in. PASSERSBY stop to listen, and some drop \n               change into the open cases. RAMON and a couple of other kids \n               grin at this.\n\n               CARLOS steps in front of the kids as he plays, and begins an \n               uncanny imitation of Roberta:\n\n                                     CARLOS\n                         More bow! To the frog! You sound \n                         terrible! I can't believe how terrible \n                         you sound!\n\n               The kids crack up, but a few spot ROBERTA heading quickly up \n               the street. Carlos is oblivious to this -- and no one signals \n               him that Roberta's watching.\n\n                                     CARLOS\n                         You're gonna make everyone in Carnegie \n                         Hall sick to their stomachs! That's \n                         right, they're gonna pay a thousand \n                         dollars a ticket and you're gonna \n                         make them throw up on their gowns \n                         and tuxedos!\n\n               Carlos senses a presence and turns to see Roberta. A tense \n               beat as he awaits her reaction.\n\n                                     ROBERTA\n                              (in all seriousness)\n                         If you're gonna imitate me, do it \n                         right.\n                              (corrects his posture)\n                         Shoulders back. Violin higher. Check \n                         your feet. There.\n                              (beat)\n                         G'head, Carlos. Continue.\n\n               Carlos freezes.\n\n                                     CARLOS\n                         No, that's O.K. You can take it from \n                         here.\n\n               Roberta nods, and addresses the kids as she unlocks the gate.\n\n                                     ROBERTA\n                         He's right, by the way. You do sound \n                         terrible, and you are gonna make \n                         everyone in Carnegie Hall sick to \n                         their stomachs.\n\n               The kids start filing in. Rachel comes up the street and \n               catches up to Roberta.\n\n                                     RACHEL\n                         I need to talk to you.\n\n               Roberta sees how distressed Rachel looks.\n\n                                     ROBERTA\n                              (to kids)\n                         I'll be right in. Start on Minuet \n                         One.\n                              (to Rachel)\n                         What's wrong?\n\n                                     RACHEL\n                         We're moving away.\n\n                                     ROBERTA\n                         What? Where are you moving?\n\n                                     RACHEL\n                              (looking downward)\n                         It's a secret... My father... he's \n                         been hurting my mom... We have to \n                         leave.\n\n                                     ROBERTA\n                              (gently)\n                         Has he been hurting you too?\n\n               Rachel shakes her head no, then starts to cry a little.\n\n                                     RACHEL\n                         I'm sorry about Julliard... and the \n                         concert.\n\n               She hands Roberta her violin.\n\n                                     ROBERTA\n                         Keep it. Take it with you.\n\n                                     RACHEL\n                         No... I don't want to play anymore.\n\n                                     ROBERTA\n                         What?! You can't give up violin, \n                         Rachel -- it's a part of you. A very \n                         important part.\n\n               Rachel looks anguished. Roberta moves closer and touches her \n               arm.\n\n                                     ROBERTA\n                         Please honey. Just take it.\n\n                                     RACHEL\n                         I don't want to.\n\n               Roberta looks at her, pained, then hugs her. Rachel quickly \n               kisses Roberta goodbye and exits. Roberta watches her.\n\n               INT. CPE 1 - MUSIC ROOM - A LITTLE LATER\n\n               Roberta leads De Sean, Naeem, Guadalupe, Lucy, Stephanie, \n               Thomas, Carlos, Erica and Nicholas in the Bach Double \n               Concerto. The other kids watch. Roberta's on the edge of \n               hysteria. She signals the players to stop.\n\n                                     ROBERTA\n                         No, no, no! Accent the up bow after \n                         the slurred notes and then it'll get \n                         you off of those slurred notes! You \n                         Double Concerto kids need to be \n                         working harder! This is the grand \n                         finale of the concert! You're each \n                         gonna be sharing a music stand with \n                         one of the world's greatest \n                         violinists!\n\n               The kids say \"the world's greatest violinists\" along with \n               her -- they've obviously been hearing this a lot. Roberta \n               glares at them.\n\n                                     ROBERTA\n                         I think we should forget the Bach \n                         Double.\n                              (to the other kids)\n                         And you guys are never gonna get \n                         Minuet One. I think we should drop \n                         that too.\n\n                                     VANESSA\n                         No! We can do it, Roberta!\n\n                                     CARLOS\n                         And we'll get the Bach Double. We \n                         will.\n\n               She stops, takes a breath.\n\n                                     NAEEM\n                         It's gonna be O.K., Roberta.\n\n                                     ROBERTA\n                              (vulnerable)\n                         You think?\n\n               All the kids nod. A few beats.\n\n                                     ROBERTA\n                         O.K...\n                              (not believing it)\n                         It's gonna be O.K.\n\n               She crosses to take a look at her music, and the kids exchange \n               looks that say, \"Oh shit. What did we just promise?\"\n\n               REHEARSAL MONTAGE - SERIES OF SHOTS - DAY\n\n               1. Carlos practices violin against the fence around River \n               East School. In the b. g., his buddies make fun of him.\n\n               2. Shandra practices in a school stairwell, ignoring a boy \n               who pulls one of her braids as he passes by.\n\n               3. Stephanie practices at a bus stop, her eyes closed, then \n               looks up and realizes she's just missed her bus.\n\n               4. Ramon practices in his living room, his father watching \n               attentively, then helping him lift the violin higher.\n\n               5. Vanessa practices in a crowded school hallway, frustrated \n               as kids keep bumping into her.\n\n               6. Roberta, in her nightgown, practices in front of her \n               refrigerator in the middle of the night.\n\n               INT. ROBERTA'S BROWNSTONE - DAY (LATE AFTERNOON)\n\n               Pandemonium. Nick and Lexi, both in tuxes, are doing several \n               tasks at once while Roberta, in a simple black velvet dress \n               and stockinged feet, tries to put on her makeup but keeps \n               poking her head out of the bathroom, giving orders. Allegra \n               BARKS outside the back door.\n\n                                     ROBERTA\n                         Nick -- did you feed Allegra?\n\n                                     NICK\n                              (fixing Lexi's tie)\n                         Yes, Mom.\n\n                                     ROBERTA\n                         Lexi, can you make sure the charts \n                         are still in my bag?\n\n                                     LEXI\n                         I already checked, Mom.\n\n                                     ROBERTA (O.S.)\n                         Check again, please. And look for my \n                         repair kit too.\n\n               ASSUNTA descends the staircase, dressed in a formal dress. \n               She holds a small jewelry box and heads for the bathroom.\n\n                                     ASSUNTA\n                         Bert, which earrings you want?\n\n               Roberta sticks her head out and picks the earrings. Assunta \n               enters the small bathroom to work on her own makeup.\n\n                                     ROBERTA\n                         Nick? Get two more violins.\n\n                                     NICK\n                         You've already got two -- how many \n                         emergencies can there be?\n\n               A beat.\n\n                                     ROBERTA\n                         Get three more. And make sure a couple \n                         of them are half-size.\n\n               Nick rolls his eyes and runs upstairs while Lexi organizes \n               things by the door: Nick's cello, Roberta's papers, extra \n               violins. Roberta rushes out of the bathroom, adjusting the \n               earrings. She starts compulsively straightening the house.\n\n                                     ROBERTA\n                         Lexi -- can you call about the car \n                         again?\n\n                                     LEXI\n                         Mom, they're not gonna forget to \n                         send a car!\n\n               Nick comes running down the stairs with the violins and stares \n               in disbelief at Roberta fluffing a couch pillow.\n\n                                     NICK\n                         What are you doing?\n\n                                     ROBERTA\n                         Just straightening a little.\n\n                                     NICK\n                         You're insane, you know that?\n                              (grabs the pillow)\n                         Finish getting dressed!\n\n               He throws the pillow onto the couch. Roberta heads upstairs.\n\n               INT. CARLOS' ROOM - DAY\n\n               IN THE MIRROR - Carlos adjusts his tuxedo. We see the \n               reflection of his baseball bat, glove and trophies in the \n               room behind him.\n\n               INT. GUADALUPE'S ROOM - DAY\n\n               Guadalupe's mom pins up her braid, then steps back to look \n               at her daughter, radiant in a floral gown. Her mom starts to \n               cry.\n\n               INT. SHANDRA'S ROOM - DAY\n\n               Beverly puts rhinestone-studded barrettes in Shandra's hair.\n\n               INT. RAMON'S ROOM - DAY\n\n               ON RAMON - He's in a sharp black suit and looks very dapper. \n               WIDER - Manuelo and Concepcion stand back to admire him, \n               then Manuelo straightens Ramon's tie, brimming with pride \n               over his son.\n\n               INT. ROBERTA'S BROWNSTONE - FRONT ROOM - DAY\n\n                                     ROBERTA (O.S.)\n                         SHIT!\n\n               Nick and Assunta look towards the stairs. Roberta comes \n               running down.\n\n                                     ROBERTA\n                         Can you believe this?\n\n               She turns around, revealing a RIP on the back of the dress, \n               next to the zipper. The DOORBELL RINGS.\n\n                                     ROBERTA\n                         It can't be time! Is it time?\n\n                                     ASSUNTA\n                         I'll sew it in the car.\n\n               EXT. ROBERTA'S BROWNSTONE - DAY\n\n               Roberta, Assunta and the boys step outside, amazed to see a \n               STRETCH LIMOUSINE double-parked in front, a CHAUFFEUR waiting.\n\n                                     LEXI\n                         See? I told you they'd send a car.\n\n               Roberta's open-mouthed. She leads her entourage towards the \n               limo. THE NEIGHBORS come out of their houses to watch. Some \n               lean out windows, gawking. Ad libs... \"Who's that?\" \"It's \n               the Violin Lady!\" LAWRENCE, dressed in a tux, gives Lexi a \n               high sign.\n\n               The chauffeur helps Roberta and Assunta into the limo while \n               Nick and Lexi start to load the instruments into the trunk.\n\n               INT. LIMOUSINE - CONTINUOUS\n\n               Roberta sits down beside Assunta and turns around so Assunta \n               can mend the tear in her dress. Assunta partially unzips the \n               dress and starts stitching it from the inside.\n\n                                     ROBERTA\n                         Thank you, Mama.\n\n                                     ASSUNTA\n                         Don't worry about it. You rip -- I \n                         sew.\n\n                                     ROBERTA\n                         Not just for that.\n                              (beat)\n                         Thank you for getting me out of bed.\n\n               Assunta stitches, remembering, and smiles.\n\n                                     ASSUNTA\n                         Don't thank me -- thank Charles.\n\n                                     ROBERTA\n                         Charles?!\n\n                                     ASSUNTA\n                         If that jerk hadn't of left you, \n                         none of this would've happened.\n\n               Roberta contemplates this. A beat.\n\n                                     ROBERTA\n                         Thank you, Charles.\n\n               Her last stitch finished, Assunta rips the needle from the \n               thread.\n\n               EXT. CARNEGIE HALL - ESTABLISHING - DUSK\n\n               INT. CARNEGIE HALL - BACK STAGE - NIGHT\n\n               The kids and their parents are practically boiling over with \n               excitement. Last minute kisses, violin tunings, and clothing \n               adjustments take place throughout the room.\n\n               The boys are in suits or tuxes, the girls in velvet or \n               flowered dresses, some with bows in their hair, some with \n               their hair up in buns. Roberta tries to take a head count, \n               Dorothea confers with a stage manager, Assunta fixes a boy's \n               tie, and Janet helps one girl with her hair, stopping in the \n               middle to button the back of another girl's dress.\n\n                                     ROBERTA\n                         Where's Vanessa? Has anyone seen \n                         Vanessa?\n\n               Janet looks at her, concerned.\n\n                                     JANET\n                         I'll call her house.\n\n               ANGLE - Roberta sees MRS. ADISA enter the room with Naeem. \n               The two women walk towards each other and embrace. As they \n               start to chat, Roberta suddenly sees someone and excuses \n               herself: BRIAN is walking towards her, wearing a tux. They \n               smile at each other, but Roberta's clearly a bit shaken to \n               see him. They're not quite sure how to greet each other -- \n               he takes her hand, and then kisses her on the cheek.\n\n                                     BRIAN\n                         Congratulations.\n\n                                     ROBERTA\n                         Thank you...\n\n                                     BRIAN\n                         I knew you'd get here sooner or later. \n                         I'm glad I'm here to see it.\n\n               A beat.\n\n                                     ROBERTA\n                         I am too.\n\n               INT. CARNEGIE HALL - BACKSTAGE WINGS AREA - NIGHT\n\n               Guadalupe shyly approaches Itzhak Perlman, her mother behind \n               her, silently encouraging her.\n\n                                     GUADALUPE\n                         Excuse me, Mr. Perlman?\n\n               He turns around.\n\n                                     GUADALUPE\n                              (extends a hand)\n                         I'm Guadalupe. I've wanted to meet \n                         you for a long time.\n\n               He smiles at her and they shake hands.\n\n                                     ITZHAK PERLMAN\n                         A pleasure to meet you, Guadalupe.\n\n               As Guadalupe introduces him to her mother, CARLOS approaches.\n\n                                     CARLOS\n                         You nervous, Mr. Perlman?\n\n                                     ITZHAK PERLMAN\n                         Should I be?\n\n                                     CARLOS\n                         Us kids are gonna be great -- I don't \n                         know about you guys. How much did \n                         you practice?\n\n               Itzhak Perlman laughs.\n\n               INT. CARNEGIE HALL - BACK STAGE - NIGHT\n\n               Roberta talks to Janet with a worried expression.\n\n                                     ROBERTA\n                         You called Vanessa's father and \n                         mother?\n\n                                     JANET\n                         No answer at either.\n\n               A Carnegie Hall staff person in a suit enters.\n\n                                     STAFF PERSON\n                         Half hour call! It's now half hour \n                         call! So pace yourself accordingly. \n                         Don't get more than thirty minutes \n                         worth of nervous!\n\n               The room electrifies with nerves.\n\n               VANESSA\n\n               rushes into the room with her father. She's out of breath, \n               her stocking has a big run in it, and she's in tears.\n\n                                     VANESSA\n                         They stole the car!\n\n                                     MR. KLEIN\n                         With the violin.\n\n                                     ROBERTA\n                         Oh my God.\n                              (calling)\n                         Nick, Lexi --\n\n                                     NICK\n                         Done.\n\n               The boys rush over to the extra violins and look to find the \n               right size.\n\n                                     VANESSA\n                              (crying)\n                         And then when we were getting a taxi, \n                         I fell down.\n\n               Roberta comforts her and Janet moves in.\n\n                                     JANET\n                         C'mon honey -- let's get you cleaned \n                         up.\n\n               ANGLE - DAN enters with a bouquet of long-stemmed red roses. \n               He's in a tux and looks very handsome. He crosses to Roberta, \n               hands her the flowers, and they hug.\n\n                                     DAN\n                         You're glowing.\n\n                                     ROBERTA\n                         It's terror.\n\n               INT. CARNEGIE HALL - NIGHT\n\n               The hall is filling to capacity as people take their seats, \n               the room buzzing with voices.\n\n               INT. CARNEGIE HALL - BACKSTAGE - NIGHT\n\n               The CARNEGIE HALL staff person enters.\n\n                                     STAFF PERSON\n                         FIVE MINUTE CALL. WE NOW HAVE FIVE \n                         MINUTES.\n\n               The tension in the room shoots sky high.\n\n               INT. CARNEGIE HALL - STAGE - PODIUM - NIGHT\n\n               Janet stands onstage and addresses the audience.\n\n                                     JANET\n                         When I became the principal of Central \n                         Park East Elementary, I envisioned a \n                         school where children could fulfill \n                         their highest potential, despite the \n                         challenges of poverty and racism. \n                         Ten years ago, Roberta Guaspari walked \n                         into my office because she needed a \n                         job, and because she had a vision \n                         that any child could learn the violin. \n                         We put our dreams together and created \n                         the East Harlem Violin Program which \n                         has helped more than a thousand \n                         students expand their vision of what's \n                         possible in their lives. When a \n                         program like this is cut, our \n                         children's future is compromised. I \n                         want to thank you for your support. \n                         Enjoy the concert.\n\n               INT. CARNEGIE HALL - BACKSTAGE - NIGHT\n\n               In the b.g. we hear the audience APPLAUDING Janet. Roberta \n               holds up her hands to quiet down the anxious students.\n\n                                     ROBERTA\n                         Everyone -- attention please!\n\n               They become quiet.\n\n                                     ROBERTA\n                         I want you all to take a second just \n                         to breathe, O.K.? Deep breath.\n\n               The kids breathe.\n\n                                     ROBERTA\n                         I would like you all to play with \n                         your heart, all right? Play like I \n                         know you can play. You'll be \n                         wonderful. Watch me, don't look out \n                         in the audience -- you don't need to \n                         be afraid. It's gonna be really \n                         wonderful. So play -- play from here.\n\n               She pats her heart.\n\n               INT. CARNEGIE HALL - BACKSTAGE CORRIDOR - NIGHT\n\n               The kids head out towards the stage, the APPLAUSE getting \n               louder as they get closer.\n\n               INT. CARNEGIE HALL - STAGE - NIGHT\n\n               CRANE SHOT of the children on stage, in their positions.\n\n               REVERSE SHOT - FOUR FILLED BALCONIES\n\n               BACK TO THE STAGE\n\n               Some of the kids look awestruck by the audience; one subtly \n               waves hi to her family. Roberta walks out to APPLAUSE. She \n               bows to the audience, turns to the kids, signals them with a \n               slight nod and the BACH MINUET ONE begins. We've heard it in \n               all phases, and now it is flawless.\n\n               PAN the STUDENTS watching her: VANESSA, wearing a corsage; \n               SIMON in his red bow tie; SHANDRA in black velvet with pearls; \n               NAEEM standing proud and tall, DE SEAN in dreadlocks and a \n               tux; RAMON playing from his heart...\n\n               INT. CARNEGIE HALL - BACK STAGE - CONTINUOUS\n\n               Isaac Stern, Itzhak Perlman, Michael Tree, Arnold Steinhardt, \n               Diane Monroe, Karen Briggs and Mark O'Connor wait back stage, \n               chatting and listening to the kids.\n\n               INT. CARNEGIE HALL - THE STAGE - MOMENTS LATER\n\n               The students finish MINUET ONE. There's an exquisite moment \n               of silence, then APPLAUSE.\n\n               INT. CARNEGIE HALL - THE STAGE - LATER\n\n               Country fiddler MARK O'CONNOR plays ORANGE BLOSSOM SPECIAL \n               with the kids. He improvises, surprising them as his violin \n               makes the sound of a TRAIN moving through a tunnel.\n\n               RAMON smiles, awed by this -- but he remains calm and \n               professional.\n\n               INT. CARNEGIE HALL - BACK STAGE CORRIDOR - LATER\n\n               As the guest violinists head for the stage, we hear their \n               names over a mike, mixed with APPLAUSE:\n\n                                     MALE VOICE (V.O.)\n                         Isaac Stern, Itzhak Perlman, Arnold \n                         Steinhardt, Diane Monroe, Michael \n                         Tree, Mark O'Connor and Karen Briggs.\n\n               INT. CARNEGIE HALL - STAGE - MOMENTS LATER\n\n               CRANE SHOT of the six guest violinists on stage for the Grand \n               Finale, each one sharing a music stand with a student. Roberta \n               nods, and they begin THE BACH DOUBLE CONCERTO. She turns to \n               face the audience as she joins them.\n\n               MOVE IN AND PAN the performers and students: NAAEM shares a \n               stand with ARNOLD STEINHARDT; ISAAC STERN stands and plays \n               with GUADALUPE, sitting beside him; ITZHAK PERLMAN sits and \n               plays next to CARLOS, standing beside him; MICHAEL TREE plays \n               beside DE SEAN; DIANE MONROE plays beside LUCY; KAREN BRIGGS \n               plays beside THOMAS, and MARK O'CONNOR plays beside STEPHANIE. \n               NICK plays cello; LEXI plays the piano behind them; and, \n               playing with her own solo music stand, ROBERTA.\n\n               Their expressions are serious and passionate, broken by \n               occasional smiles lighting on faces: Isaac Stern... Lucy... \n               Carlos... Itzhak Perlman... Diane Monroe... De Sean.\n\n               The song finishes and the APPLAUSE begins. The OTHER \n               FIDDLEFEST PLAYERS come out from back stage, RAMON in front, \n               and join the rest. More applause. The CAMERA PULLS BACK TO \n               INCLUDE the audience facing the stage, then REVERSES to show \n               the audience standing in the orchestra and balconies.\n\n               We see the students' PARENTS; JANET, ISABEL and their \n               families; ASSUNTA, LAWRENCE and DOROTHEA; DAN; CONCEPCION, \n               MANUELO and their sons; BRIAN; and DENNIS -- even he can't \n               stop himself from applauding.\n\n               BACK AGAIN to the stage where the students and guest \n               violinists bow... and MOVE IN CLOSER on ROBERTA in her moment \n               of triumph.\n\n               INT. CARNEGIE HALL - STAGE - PODIUM - MOMENTS LATER\n\n               Roberta addresses the audience. Her voice is strong but softer \n               around the edges; she is a woman in a state of grace.\n\n                                     ROBERTA\n                         We're all here tonight because we \n                         have a bigger mission: to take the \n                         magical spirit of tonight's concert \n                         with us out into the world, and to \n                         fight for music and art to be a part \n                         of every child's education. Thank \n                         you.\n\n               The APPLAUSE is DEAFENING, then slowly diminishes as we:\n\n                                                               DISSOLVE TO:\n\n               INT. CPE 1 - MUSIC CLASSROOM - DAY\n\n               Roberta addresses ten first-graders sitting in a circle on \n               the floor. She points to the horsehair on her bow.\n\n                                     ROBERTA\n                         And this? What's this?\n\n                                     BOY\n                         The frog hair?\n\n               Roberta and the kids laugh.\n\n                                     ROBERTA\n                         Did you ever see a frog with hair?\n\n               The boy smiles and shakes his head.\n\n                                     A FEW KIDS\n                         It's horsehair!\n\n                                     ROBERTA\n                         That's right.\n                              (to the boy)\n                         But you're right, there is a frog. \n                         Can you show me where it is?\n\n               One girl raises her hand with urgency.\n\n                                     GIRL\n                         Ooh! I know!\n\n                                     ROBERTA\n                         Sssh -- let him answer.\n\n               The boy points to the frog of the bow and Roberta smiles. \n               And as she continues her lesson, her voice recedes and we:\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n               CRAWL:\n\n               Roberta Guaspari lives in East Harlem with her daughter Sofia, \n               whom she adopted from El Salvador. Nick is a professional \n               cellist in a graduate music program, and Alexi has been \n               accepted to medical school.\n\n               Roberta teaches violin to approximately 150 students a year \n               in three East Harlem elementary schools. The East Harlem \n               Violin Program, however, is still not funded by the New York \n               City Board of Education.\n\n               The money raised from Fiddlefest supported Roberta's violin \n               program for three years. Roberta and Opus 118 continue their \n               fundraising efforts to keep the program alive.\n\n\n\n\nMusic of the Heart\nWriters :   Pamela Gray\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:31:51.216211"}