{"title": "My Mother Dreams the Satan's Disciples in New York", "film_link": "/Movie Scripts/My Mother Dreams the Satan's Disciples in New York Script.html", "script_link": "/scripts/My-Mother-Dreams-the-Satan's-Disciples-in-New-York.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>My Mother Dreams the Satan's Disciples in New York Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"My Mother Dreams the Satan's Disciples in New York Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (8.50 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Rex Pickett\" title=\"Scripts by Rex Pickett\">Rex Pickett</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Short\" title=\"Short Scripts\">Short</a><br/><br/>\n<br/>\n<a href=\"/scripts/My-Mother-Dreams-the-Satan's-Disciples-in-New-York.html\">Read \"My Mother Dreams the Satan's Disciples in New York\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>MY MOTHER DREAMS THE SATAN'S DISCIPLES IN NEW YOR</title>\n\n<pre>                                 \"MY MOTHER DREAMS \n<b>                         THE SATAN'S DISCIPLES IN NEW YORK\"\n</b>\n\n\n<b>            FADE IN:\n</b>\n<b>            EXT. SOUTH DAKOTAN FARM - DAY\n</b>\n            A lone farmhouse sits isolated against a prairie backdrop,\n            silhouetted by a marbled dawn sky.\n\n<b>            INT. FARMHOUSE - DAY\n</b>\n            MARIAN PETERSON, a gray-haired woman in her late sixties,\n            meticulously packs a suitcase.  She picks up a small, framed\n            PHOTO from a chest-of-drawers and holds it up to her.\n\n<b>            INSERT - PHOTO\n</b>\n            It's a picture of a man about Marian's age.  He has a sweet\n            natured smile on his face.  Marian looks at it longingly,\n            then packs it carefully in her suitcase between some sweaters\n            and closes it up.\n\n<b>            EXT. FARMHOUSE - DAY\n</b>\n            A paint-chipped truck rounds the corner on a dirt road\n            leading into the farm.\n\n            Marian, waiting on the porch, ready to go, rises and waves.\n\n<b>            A FEW MOMENTS LATER -\n</b>\n            Marian's son, STEVE, dressed in jeans and flannel shirt,\n            loads his mother's single piece of luggage into the bed of\n            the truck, climbs back into the cab, where his mother is\n            sitting, and drives off.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            EXT. THE SKY - DAY\n</b>\n            A JETLINER descending in the hot, cerulean sky.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            EXT. KENNEDY INTERNATIONAL - AFTERNOON\n</b>\n            Marian, looking a little forlorn and out of sorts, stands out\n            by the taxi area with her suitcase on a tote, looking around\n            for a cab, unsure what to do.\n\n<b>            CURBSIDE - A FEW MINUTES LATER\n</b>\n            MISCHA, a somewhat dissolute-looking Russian cabbie in his\n            thirties, roughhouses Marian's single piece of luggage into\n            the dirty, cluttered trunk of his cab.\n\n<b>            INT. TAXI - DAY\n</b>\n            Marian is sitting in the back of the cab as Mischa opens the\n            driver's side door and slams it shut, rattling Marian's\n            nerves.\n\n<b>                                MISCHA\n</b>                          (brusquely)\n                      Where to?\n\n<b>                                MARIAN\n</b>                      Are you sure you got my bag in?\n\n<b>                                MISCHA\n</b>                      What do you think?  I left it on the\n                      curb?\n\n<b>                                MARIAN\n</b>                      I'm sorry, I'm a little nervous.  It's my\n                      first time in New York.  Just a minute.\n\n            Marian fumbles with a piece of paper she's rooted out of her\n            purse.  \n\n            Mischa, annoyed, slams the shift lever into Drive and lurches\n            off.\n\n            Marian leans forward into the rectangular opening of the\n            Plexiglas partition.\n\n<b>                                MARIAN\n</b>                      I want to go to 526 East 5TH.  That's in\n                      the East Village.  My daughter said it\n                      would cost thirty dollars.\n\n            In the REAR-VIEW MIRROR we glimpse Mischa giving Marian a sly\n            look.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. LOCATION - DAY\n</b>\n            The TAXI passes on a turnpike, streaming with vehicles,\n            headed toward Manhattan.  DRIVE-BY TRANSITION.\n\n<b>            INT. TAXI - DAY\n</b>\n            Hurtling along.  Marian cranes her head through the partition\n            and attempts to strike up a conversation with the surly\n            cabbie.\n\n<b>                                MARIAN\n</b>                      I came to New York to visit my youngest\n                      daughter.\n\n<b>                                MISCHA\n</b>                      And where is she?\n\n<b>                                MARIAN\n</b>                      She would have come to the airport to\n                      meet me - she wanted to - but ... but,\n                      she just started a new job and, well, I\n                      guess no one drives here.\n\n<b>                                MISCHA\n</b>                      So, you come here all by yourself?\n\n<b>                                MARIAN\n</b>                      Uh, yes.  My husband passed away recently\n<b>                      ...\n</b>\n<b>                                MISCHA\n</b>                      ... Oh ...\n\n<b>                                MARIAN\n</b>                      ... And the children thought I should\n                      take a trip.\n\n<b>                                MISCHA\n</b>                      Yeah.\n\n<b>                                MARIAN\n</b>                      I'm from South Dakota.  Where are you\n                      from?\n\n<b>                                MISCHA\n</b>                      Moscow.\n\n<b>                                MARIAN\n</b>                      Ohhh.  Do you know the East Village?\n\n<b>                                MISCHA\n</b>                      Oh, yeah ... yeah ... it's a hellhole.\n\n<b>                                MARIAN\n</b>                          (disconcerted)\n                      You mean it's dangerous?\n\n<b>                                MISCHA\n</b>                      Nah, not dangerous.  Not that dangerous.\n                          (beat)\n                      Not during the day.\n\n            Mischa chuckles as Marian sits back in the cab.\n\n<b>            ANGLE ON MARIAN -\n</b>\n            looking out the window, her face clouded with consternation.\n\n<b>            EXT. BRIDGE - DAY\n</b>\n            Cars pouring into Manhattan over one of the many bridges\n            spanning the East River.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. EAST 5TH STREET AND 2ND AVENUE - DAY\n</b>\n            The cab brakes to a halt, bringing Marian INTO THE FRAME, her\n            face strickened with fear.\n\n            Marian climbs out of the cab as Mischa, in the background,\n            opens the trunk to retrieve her bag.  Marian, taking in the\n            foreign surroundings, seems confused about something.\n\n<b>                                MARIAN\n</b>                      Pardon me, Mischa.  Is this 526 East 5TH\n                      Street?\n\n            Mischa closes the trunk and approaches Marian with her one\n            piece of luggage on a tote.\n\n<b>                                MISCHA\n</b>                      No, no.  Sorry, I can't drive you to\n                      door.  There's a roadblock on Avenue B\n<b>                      ...\n</b>                          (he gestures down the street)\n                      right there ...\n\n<b>            MARIAN'S AND MISCHA'S P.O.V. -\n</b>\n            At the far end of the block, we SEE a movable, blue NYPD\n            roadblock.\n\n<b>            BACK -\n</b>\n            The two of them, Marian looking puzzled.\n\n<b>                                MISCHA\n</b>                      This is one-way street.  You go down the\n                      block to the middle.\n\n<b>                                MARIAN\n</b>                          (pointing uncertainly)\n                      This way?\n\n<b>                                MISCHA\n</b>                      Yeah.  Not far.  You will be fine.\n                          (beat)\n                      It's still day.\n\n            He chuckles to himself, but Marian doesn't get the joke.\n\n<b>                                MARIAN\n</b>                      I see.  How much?\n\n<b>                                MISCHA\n</b>                      Forty-five all total.\n\n<b>                                MARIAN\n</b>                      Forty-five?  I thought it was only\n                      supposed to be thirty?\n\n<b>                                MISCHA\n</b>                      Thirty is base price.  Tolls, tax, tip\n                      ... it all adds up.\n\n            Marian unsnaps her wallet and grudgingly hands the\n            disreputable cabbie two twenties and a five.\n\n            Mischa takes the money and starts away.  Halfway back to his\n            cab, he turns around and calls out to Marian, who stands\n            frozen on the dilapidated street.\n\n<b>                                MISCHA\n</b>                      Hey, lady.\n                          (Marian turns)\n                      Hold purse like this.\n\n            Mischa hugs an imaginary purse close to his side.  Marian\n            apes his advice in all seriousness.\n\n<b>                                MISCHA\n</b>                          (nodding approval)\n                      Good luck.\n\n            Mischa climbs back into his cab and peels off.\n\n<b>            NEW ANGLE -\n</b>\n            HIGH DOWN WIDE of Marian standing forlornly at the end of the\n            street, a Dayton's shopping bag in one hand, her luggage\n            strapped to the tote in the other.\n\n<b>            TITLE IS SUPERIMPOSED:\n</b>\n<b>                  MY MOTHER DREAMS THE SATAN'S DISCIPLES IN NEW YORK\n</b>\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. EAST 5TH STREET - DAY - A FEW MINUTES LATER\n</b>\n            Marian pulling her luggage apprehensively down the street.  \n\n            She passes THE SQUATTERS, a motley group of homeless\n            teenagers, pierced, tattooed, wild hairdos and even wilder\n            attire.\n\n<b>                                SQUATTER #1\n</b>                      Hey, lady, can you help us out with some\n                      change today?\n\n            Marian, shocked by their circumstances, rolls her luggage\n            past them, smiling faintly.\n\n<b>                                SQUATTER #2\n</b>                      Come on.  Every little bit helps.  A\n                      little food, you know?\n\n<b>                                MARIAN\n</b>                      Maybe some other time.\n\n<b>                                SQUATTER #1\n</b>                      Thanks a lot anyway.\n\n            Marian continues on.  She's distracted by ...\n\n            A WOMAN in her thirties, who looks like she hasn't slept in a\n            week, bent over the railing of a second-story fire escape\n            balcony, in the throes of a veritable rage.\n\n<b>                                WOMAN IN A RAGE\n</b>                      You forgot your fucking plant, you\n                      fucking asshole!\n\n            Marian stares up at her, even more disconcerted than ever.\n\n            The enraged woman continues her tirade at an unseen old\n            boyfriend below.\n\n<b>                                WOMAN IN A RAGE\n</b>                      And there's a lot of other shit in there\n                      you forgot.  Just wait there, I'm going\n                      to go fucking get it for you, all right? \n                      No, just wait there! Do you want me to go\n                      get it for you?  Well, why don't I just\n                      do that, huh?  I'm going to do that right\n                      now!\n\n            Marian looks away and, intrepid Midwesterner that she is,\n            pushes on.\n\n            A MAN, dressed strangely, stands surreally in the middle of\n            the street, blowing huge clouds of cigarette smoke.\n\n            A GAY COUPLE parade past, laughing hysterically.\n\n<b>            NEW ANGLE - AT THE END OF THE STREET -\n</b>\n            A PACK of unmufflered, chrome-coruscating HARLEYS round the\n            corner in a ear-shattering approach.\n\n<b>            MARIAN -\n</b>\n            stops dead in her tracks and stares in heartstopping terror.\n\n<b>            ACROSS THE STREET -\n</b>\n            The BIKERS, wearing their club's colors embroidered on blue\n            jeans, and leather, vests, back their motorcycles in a\n            uniform row against the curb, kill their engines, park them\n            at an angle on their kickstands, and dismount.\n\n            They high-five a biker known as the DISCIPLE PROSPECT, a\n            small, mean-looking man with a red bandana tied taut over his\n            head, and then disappear into the windowless clubhouse,\n            passing through a large, forbidding, black door with the\n            skeleton of Death riding a motorcycle painted on it.\n\n            The Disciple Prospect tosses the butt of a cigarette into a\n            rusted steel drum and flames erupt.\n\n<b>            MARIAN -\n</b>\n            in horror, cannot pry her eyes away from them.\n\n<b>            NEW ANGLE -\n</b>\n            An upstairs window on a six-story, red-brick co-op building. \n            PAULA, Marian's daughter, a pretty woman with short dark\n            hair, is leaning out the window, waving.\n\n<b>                                PAULA\n</b>                      Mom!  Hi!  I'll be right down.\n\n<b>            EXT. THE FRONT SECURITY DOOR - A FEW MOMENTS LATER\n</b>\n            Paula emerges to greet her mother.  \n\n            Marian glances one last time across the street and exchanges\n            oblique looks with the Disciple Prospect, now parked on a\n            stool next to the burning drum.  He seems to home in on her.\n\n<b>            INT. CO-OP - TWILIGHT - A FEW MOMENTS LATER\n</b>\n            A nice, one-bedroom co-op, tastefully furnished.  Paula is\n            unpacking Marian's things.  Marian stands in the middle of\n            the apartment, feeling relaxed, if still a bit shaken, for\n            the first time since she arrived.\n\n<b>                                PAULA\n</b>                      So, what do you think?\n\n<b>                                MARIAN\n</b>                      Well, once you're inside, it's nice.\n\n<b>                                PAULA\n</b>                      You don't like where I live?\n\n            Marian walks over to the window and peers out.\n\n<b>                                MARIAN\n</b>                      Well, when I walked up the block, I ...\n                      well, my word!\n\n<b>                                PAULA\n</b>                      That's New York.  It looks rundown, but\n                      it's safe during the day.  You'll get\n                      used to it.\n\n            Marian returns her gaze to the view out the window.\n\n<b>            EXT. STREET - TWILIGHT - MARIAN'S P.O.V. -\n</b>\n            Out the window.  Two BIKERS stand with their arms\n            crisscrossed against their leather-vested chests, framing the\n            burning drum on the sidewalk, guarding the phalanx of\n            Harleys.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. CO-OP - NIGHT - LATER\n</b>\n            Paula and Marian are sitting at the dining table.  They're\n            studying one of those plastic laminated maps of New York that\n            you can buy everywhere.  Paula is attempting to acquaint her\n            mother with Manhattan's complex public transportation system.\n\n<b>                                PAULA\n</b>                      You take the M-15 bus all the way to ...\n                      79TH Street.  And then you take the\n                      crosstown bus to 5TH Avenue, and the\n                      Metropolitan Museum of Art is right\n                      there.  You can't miss it.\n\n            Marian removes her glasses and fixes her gaze on her\n            daughter.\n\n<b>                                MARIAN\n</b>                      I wanted to ask you something.  Those\n                      motorcycles across the street ...?\n\n<b>                                PAULA\n</b>                      Uh-huh?\n\n<b>                                MARIAN\n</b>                      ... What are they all doing there?\n\n<b>                                PAULA\n</b>                      That's the Satan's Disciples' New York\n                      headquarters.\n\n<b>                                MARIAN\n</b>                          (alarmed)\n                      The motorcycle gang?  Don't they deal\n                      drugs and rape young girls?\n\n<b>                                PAULA\n</b>                      I've never had any problem with them. \n                      People say it's the safest block in the\n                      East Village.\n                          (lays a reassuring hand on her\n                           mother's arm)\n                      I just hope their motorcycles don't keep\n                      you up at night.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. CO-OP - NIGHT\n</b>\n            CRANE UP to Marian lying wide awake on a convertible sofa\n            next to the street window.  We (Marian!) hear VOICES,\n            MOTORCYCLES REVVING, POLICE SIRENS, followed by what sounds\n            like GUNFIRE, tires SCREECHING, a cacophony of sounds typical\n            of summer nights in the East Village.\n\n            We go UP and OVER Marian toward the window as imaginary\n            voices flood in and become intelligible.\n\n<b>                                RANDOM VOICES (O.S.)\n</b>                      Did that shipment of heroin come in?\n                      That old lady see them?  \n                      We can kill her if we have to.\n\n            RAUCOUS LAUGHTER erupts.\n\n<b>            EXT. STREET - NIGHT - MONTAGE\n</b>\n            A Kenneth Anger Scorpio Rising-like MONTAGE:\n            A black-booted foot kick-starts a Harley.  \n            A gleaming chrome exhaust pipe vibrates and spits smoke.  \n            A black-gloved hand revs a handle-bar accelerator.  \n            A helmet is pulled down over a Hun-like face.  \n            Flames roar in the steel drum as though a signpost in Hell.\n\n            One of the DISCIPLES, bare-chested, long-haired, sweating,\n            swings a baseball bat and calls out to Marian in a singsong\n            voice:\n\n<b>                                BIKER\n</b>                      Oh, Marian ...\n\n            Another half-naked BIKER, arms tattooed up and down, has\n            Marian's suitcase open and is scattering her belongings out\n            into the street.  He finds the framed photo of her deceased\n            husband and tosses it to the pavement.  He raises his head\n            slowly with a sneer and looks up at ...\n\n<b>            MARIAN -\n</b>\n            standing in the window in her nightgown, a hand covering her\n            mouth, looking down in utter terror on the fire-lit tableaux\n            of her nightmare.\n\n<b>            THE BIKER ON THE STREET -\n</b>\n            starts stomping on the photo with the heel of his boot,\n            shattering the glass.  Then he removes the photo from the\n            frame and slowly drops it into the roaring conflagration in\n            the oil drum.\n\n            The other dawdling Disciples guffaw loudly.\n\n<b>                                                            SLAM CUT TO:\n</b>\n<b>            INT. CO-OP - NIGHT\n</b>\n            Marian wakes with a start, consciousness giving way to a sigh\n            of relief.\n\n<b>                                                                FADE TO:\n</b>\n<b>            EXT. CO-OP BUILDING - DAY\n</b>\n            ESTABLISHING SHOT of Paula's red-brick co-op, splashed with\n            sunlight and framed by a bright blue sky.\n\n<b>            INT. CO-OP - DAY\n</b>\n            It's quiet in the co-op.  Marian is dusting the bookshelves\n            and humming to herself.  \n\n            Behind a shelf of books she discovers a PHOTO ENVELOPE with\n            some snapshots in them.  Curious, she has a look-see.\n\n<b>            SNAPSHOTS -\n</b>\n            flipping through Marian's hands.  They chronicle Paula and a\n            BOYFRIEND on a recent vacation to a Caribbean island.  Marian\n            is amused by them ... until she comes to one showing Paula\n            with her bathing suit top off, arms raised giddily in the\n            air.\n\n<b>            MARIAN -\n</b>\n            gasps, then blushes and quickly replaces the pictures.\n\n<b>            INT. CO-OP - DAY - LATER\n</b>\n            Marian is at the window, peering through the furling\n            curtains.\n\n<b>            EXT. STREET - DAY - MARIAN'S P.O.V. -\n</b>\n            Looking down on the Satan's Disciples' clubhouse.  Two BIKERS\n            and their GIRLFRIENDS swagger out of the clubhouse, don their\n            helmets, mount their bikes, kick-start them to life and roar\n            off down the street.\n\n<b>            MARIAN -\n</b>\n            draws away from the window.  She picks up her \"Streetwise\n            Manhattan\" laminated map, puts her glasses on, looks at it,\n            debating whether to tackle the streets of New York or not.\n\n<b>            A FEW MINUTES LATER -\n</b>\n            Marian, determined now to get out of the co-op, pulls her\n            purse over her shoulder and grips it like the cabbie\n            instructed.  Then she moves to the front door, opens it, and\n            steps warily out into the hallway.  She freezes when she\n<b>            HEARS THUNDERING FOOTSTEPS.\n</b>\n<b>            INT. HALLWAY - DAY\n</b>\n            Marian cowers against the half-open door as a young MAN,\n            wearing faded jeans, black cowboy boots, and leather vest\n            over a naked torso, comes charging down the stairs pulled by\n            a frothing, pent-up BULLDOG on a leash.\n\n            As he passes, Marian retreats quickly back into her unit,\n            closes the door, and locks the locks from inside.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. CO-OP - NIGHT\n</b>\n            Paula is hanging up her coat and setting down her briefcase,\n            an incredulous expression on her face, looking at ...\n\n            Marian, sitting in a chair by the window, leafing through a\n            magazine.\n\n<b>                                PAULA\n</b>                          (mildly rebuking)\n                      You didn't leave the house all day?\n\n            Marian shrugs.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. NEW YORK - DUSK\n</b>\n            Manhattan skyscrapers framed against a twilit sky.\n\n<b>            INT. RESTAURANT/BAR - NIGHT\n</b>\n            Marian and Paula are sitting at the bar.  They each have a\n            glass of white wine in front of them.  Paula is looking at\n            some PHOTOS of the farm that Marian has brought along.\n\n<b>                                MARIAN\n</b>                      Would you look at those strawberries. \n                      They made the best jam.  \n                          (passes Paula the photos)\n                      Here are some more pictures of the farm. \n                      Crops were unbelievable this year.\n\n            Paula continues to browse through the snaps.\n\n<b>                                MARIAN\n</b>                      Plenty of rain.  Your dad would have been\n                      happy with that.\n\n            Marian removes a pill from a small vial she's rummaged out of\n            her purse and slips it discreetly into her mouth.\n\n<b>                                MARIAN\n</b>                      I just can't seem to focus on anything\n                      these days.\n\n<b>                                PAULA\n</b>                          (turning to her mother)\n                      That's why it's good you came to visit\n                      me.\n\n<b>                                MARIAN\n</b>                          (washing her pill down with\n                           some wine)\n                      How are you doing sweetheart?\n\n<b>                                PAULA\n</b>                      I'm good.\n\n<b>                                MARIAN\n</b>                      Dating anyone?\n\n<b>                                PAULA\n</b>                      No, I'm working too much, I don't have\n                      time.\n\n<b>                                MARIAN\n</b>                      What about the fellow in those pictures?\n\n<b>                                PAULA\n</b>                      What pictures?\n\n<b>                                MARIAN\n</b>                      You know ...\n                          (raises both hands in the air)\n                      ... whoops!\n\n<b>                                PAULA\n</b>                          (blushing)\n                      Mother!\n\n<b>                                MARIAN\n</b>                      Well, they were right out in plain view.\n\n<b>                                PAULA\n</b>                      Behind the books.\n\n<b>                                MARIAN\n</b>                      But I was dusting.\n\n<b>                                PAULA\n</b>                          (reluctantly explaining)\n                      I was seeing Aaron and there were some\n                      ... complications.\n\n<b>                                MARIAN\n</b>                      He seemed quite taken with you.\n\n<b>                                PAULA\n</b>                      I don't want to talk about it.\n\n<b>                                MARIAN\n</b>                          (hurt)\n                      You know, you never tell me anything.\n\n<b>                                PAULA\n</b>                      That's not true.\n                          (lays a placating hand on her\n                           mother's arm)\n                      Besides, I don't want you dusting.  I\n                      want you to see New York.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. EAST 5TH STREET - NIGHT\n</b>\n            Marian and Paula, arm-in-arm, walk down the block back to her\n            building.\n\n            A MOTORCYCLE rounds the corner, slows to a crawl, and one of\n            the Satan's Disciples stares over at the two of them as if\n            casing them out.  Paula won't look at him, but Marian can't\n            avert her gaze.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            INT. CO-OP - NIGHT\n</b>\n            Marian lying awake in bed, the ENGINES of the Disciples'\n            Harleys deafening ...\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            EXT. SATAN'S DISCIPLES' CLUBHOUSE - NIGHT\n</b>\n            DOLLY ACROSS a line of idling Harleys, the bikers, one at a\n            time in succession, switching their single-beam headlights\n            on.  \n\n            PAN ACROSS the FACES of the Disciples, mounted on their\n            cycles, dark helmets, faded blue jeans jackets embroidered\n            with elaborate stitching of their club's insignia, cigarettes\n            dangling from their hirsute mouths, baleful-looking\n            countenances, revving their engines loudly, tauntingly.\n\n<b>            NEW ANGLE -\n</b>\n            From across the street, Marian, appearing like an apparition\n            in her nightgown, surreally walks toward them, a beseeching\n            look on her face.\n\n<b>                                MARIAN\n</b>                      Excuse me.  Could you please turn your\n                      motorcycles off?  They're so loud, I\n                      can't sleep.\n\n            GO TO SLOW MOTION as the BIKERS, some ten in number, slowly\n            approach the frail-looking Marian.  Gently, they pick her up\n            off the ground and raise her aloft.  Then, like some moving\n            human bier, they carry her through the forbidding black door\n            into their clubhouse.\n\n<b>            INT. CLUBHOUSE - NIGHT\n</b>\n            We follow Marian down a dark corridor leading into the bowels\n            of the clubhouse.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            INT. DREAM CORRIDOR - NIGHT\n</b>\n            At the end of another corridor, a MAN stands, silhouetted\n            against an explosion of blue light.  As we near the ghostly\n            figure, we REALIZE it's Marian's deceased husband.\n\n            There's a GUN SHOT.\n\n<b>                                                            SLAM CUT TO:\n</b>\n<b>            INT. CO-OP - NIGHT\n</b>\n            Marian wakes with a start, clutching a hand to her breast.\n\n<b>            INT. KITCHEN - A FEW MOMENTS LATER\n</b>\n            Marian shakes a Valium out of a vial, puts it into her mouth, \n            swallows it with a drink of orange juice.\n\n<b>                                                                FADE TO:\n</b>\n<b>            INT. PAULA'S CO-OP - THE NEXT DAY\n</b>\n            Marian, not wanting to be a disappointment to her daughter,\n            damn her fears, gathers her purse up and starts out the door.\n\n<b>            INT. HALLWAY - DAY\n</b>\n            Marian is again prevented from an easy exit when a young, hip\n            looking COUPLE come bounding down the stairs.  As she stands\n            at her open door to let them pass, they completely ignore her\n            as if she didn't exist.\n\n<b>            EXT. EAST 5TH STREET - DAY - A FEW MOMENTS LATER\n</b>\n            Seen from Marian's perspective across the street, the front\n            of the Satan's Disciples headquarters is quiet.  There are\n            only a couple Harleys parked out front.\n\n            Marian, relieved that there are no bikers out, hurries off in\n            the direction of First Avenue, determined to see the sights\n            of the city.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            EXT. NEW YORK CITY - DAY - MONTAGE\n</b>\n            A giddy, almost dreamlike, MONTAGE of Marian touring New\n            York.  She's SUPERIMPOSED over famous landmarks, as if she\n            were standing stationery and the city were in a diorama\n            rotating all around her.  The Empire State Building; Circle\n            Cruise Line; eating a hot dog from a street vendor; shopping\n            at Macy's.  Marian beams as she is magically whisked along,\n            walking on air.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            EXT. EAST 5TH STREET - DAY\n</b>\n            Marian comes INTO THE FRAME around the corner.  She has a\n            spring in her step and a broad smile emblazoning her face. \n            But her sanguine mood is quickly shattered when she HEARS\n            shouting.  She freezes in her tracks.\n\n<b>            ACROSS THE STREET - THE SATAN'S DISCIPLES HEADQUARTERS -\n</b>\n            The Disciple Prospect and another Biker are roughing up a\n            teenage KID, wrestling him into submission.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      You're just chilling, huh?  Not on this\n                      block, do you understand?\n\n<b>            MARIAN -\n</b>\n            at the security door of Paula's building.  She rummages\n            anxiously through her purse, but she can't find her keys!\n\n<b>                                MARIAN\n</b>                      Oh, no.\n\n            Marian glances across the street, her face tensed with fear.\n\n<b>            ACROSS THE STREET -\n</b>\n            The Bikers continue to roughhouse the Kid.  The Disciple\n            Prospect brandishes a plastic bag under his nose.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      What's this, huh?\n\n<b>                                KID\n</b>                      I ain't got shit on me.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      What is that?   You're chilling, man? \n                      Well, then maybe we need to warm things\n                      up for you, man.  How many times do we\n                      got to tell you?  You don't listen and\n                      you don't learn and that's the problem. \n                      That is the problem.\n\n<b>            MARIAN -\n</b>\n            turns away from the escalating violence across the street and\n            punches one of the buttons on the intercom.  A WOMAN'S VOICE\n            crackles over it.\n\n<b>                                WOMAN'S VOICE (O.S.)\n</b>                      Hello?\n\n<b>                                MARIAN\n</b>                      My daughter lives here and I'm her mother\n                      and I've lost my keys.\n\n            There's no answer.\n\n<b>                                MARIAN\n</b>                      Hello?  Hello?\n\n            Marian returns her frightened gaze to the altercation across\n            the street.\n\n<b>            ACROSS THE STREET - MARIAN'S P.O.V.\n</b>\n            Two more DISCIPLES emerge from the clubhouse.  One of them\n            squirts lighter fluid on the fire burning in the steel drum\n            and the flames explode.  Then KID is dragged over toward the\n            fire.  The Disciple Prospect drags him dangerously close to\n            the flames.\n\n<b>                                DISCIPLE\n</b>                      Roast him!\n\n<b>                                KID\n</b>                          (screaming)\n                      All right all right all right.\n\n<b>            MARIAN -\n</b>\n            petrified, as if she'd stepped into a re-enactment of a\n            passage out of Revelations, walks briskly down to the middle\n            of the block toward a pay phone. \n\n<b>            DISCIPLES CLUBHOUSE -\n</b>\n            The Disciples kick the drug-dealing Teenager a couple more\n            times, then set him free, laughing as he flees down the block\n            in mortal fear.\n\n<b>            PAY PHONE -\n</b>\n            Marian drops the appropriate coins in the coin slot and dials\n            a number from memory.\n\n<b>                                MARIAN\n</b>                          (quavery voice)\n                      Yes, is Paula there? ... Could you leave\n                      her a message, please?  Tell her it's\n                      urgent.\n                          (gathers herself)\n                      Her mother has lost her keys and is\n                      stranded on the street with the Satan's\n                      Disciples ... When she comes back, would\n                      you tell her to come home as quickly as\n                      she can? ... Thank you.\n\n            Marian hangs up the phone and turns, quails in terror.\n\n<b>            NEW ANGLE -\n</b>\n            The Disciple Prospect is towering over her, staring down at\n            her with a scowl on his face.\n\n<b>                                MARIAN\n</b>                      Oh, please, don't hurt me.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      I just need to use the phone, lady.\n\n<b>                                MARIAN\n</b>                      Oh, let me get out of your way then.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      What happened?  Did you lose your keys?\n\n<b>                                MARIAN\n</b>                          (withdrawing anxiously)\n                      Have a nice day.\n\n<b>            WIDE SHOT -\n</b>\n            Marian walks quickly ACROSS THE FRAME.  As she EXITS RIGHT,\n            the Disciple Prospect ENTERS LEFT and trails after her.\n\n<b>            EXT. PAULA'S BUILDING - DAY - A FEW MOMENTS LATER\n</b>\n            Marian is at the front entrance, uncertain what to do.  She\n            quailss when the Disciple Prospect approaches.  Without a\n            word, he reaches his arm over her and presses a buzzer to one\n            of the units.\n\n<b>                                WOMAN'S VOICE (O.S.)\n</b>                      Hello.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      Washing machine repairman.\n\n            The DOOR BUZZES almost at once, and the Disciple Prospect\n            pushes it in and holds it open until Marian is safely inside. \n            He looks at her a little annoyed.  Marian is absolutely\n            nonplussed.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. CO-OP HALLWAY - LATER THAT DAY\n</b>\n            Paula comes running up the stairs.  She stops when she SEES:\n\n<b>            MARIAN -\n</b>\n            sitting on the floor, propped against the door to their unit.\n\n            Paula shakes her head reprovingly at her mother who just\n            shrugs, chagrined.\n\n<b>            INT. CO-OP - BATHROOM - NIGHT - LATER\n</b>\n            Paula is in the bathroom.  She has her mother's vial of\n            Valium in her hand.\n\n<b>                                PAULA\n</b>                      Maybe you should lay low tomorrow.  I'm\n                      going to see if I can get off early and\n                      maybe we can take the ferry cruise. \n                      Okay?\n\n<b>            LIVING ROOM -\n</b>\n            Marian is standing at the window looking down on the street.\n\n<b>            EXT. STREET - NIGHT - MARIAN'S P.O.V.\n</b>\n            The Disciples are backing their bikes against the curb,\n            parking them, and filing into the clubhouse.\n\n<b>            BATHROOM -\n</b>\n            Paula dispenses the remaining pills into the palm of her\n            hand.\n\n<b>                                PAULA\n</b>                          (to herself)\n                      Three left.\n\n<b>            LIVING ROOM -\n</b>\n            Marian looking apprehensively down at the Disciples'\n            headquarters, stupefied.\n\n            Paula emerges from the bathroom in the background.  Marian\n            doesn't turn to acknowledge her.  She continues to stare\n            transfixed at the bikes and the fire-burning oil drum.\n\n<b>                                PAULA\n</b>                          (softer)\n                      Okay?  Does that sound like a plan?\n\n            Marian doesn't answer. \n\n            Paula stands some distance from her distracted mother, a\n            worried expression featured on her face.\n\n<b>                                                                FADE TO:\n</b>\n<b>            INT. CO-OP - DAY\n</b>\n            Looking through the security eyepiece, a FISH-EYE LENS SHOT\n            of an attractive, but distraught woman in her twenties,\n            puffing a cigarette, eyes red and swollen from crying.\n\n<b>                                MARIAN\n</b>                      Who is it?\n\n<b>                                MARIKA\n</b>                      It's Marika.  Is Paula there?\n\n<b>                                MARIAN\n</b>                      She's at work.  I'm her mother.\n\n<b>                                MARIKA\n</b>                      Oh.  I thought today was Saturday.\n\n            Marian, seemingly reassured, opens the door for her.  She\n            sees Marika, realizes she's upset about something, and feels\n            immediately compassionate toward her.\n\n<b>                                MARIKA\n</b>                      I'm sorry.  I had a wretched night.\n\n<b>                                MARIAN\n</b>                      Oh.  You need a cappuccino.\n\n            And she lets Marika in.\n\n<b>            INT. CO-OP - DAY - A FEW MINUTES LATER\n</b>\n            They're sitting at the dining table, having coffee.  Marian\n            is listening sympathetically to Marika's tale of woe.\n\n<b>                                MARIKA\n</b>                      And there was this number on my phone\n                      bill that I didn't recognize.  Calls made\n                      at three and four in the morning.  So, I\n                      called the number ... and a woman\n                      answered.  And I ... I hung up.\n                          (leans forward)\n                      So, then I followed him.  Just like in\n                      the movies.  And I found out that he has\n                      a wife and a little girl living in\n                      Brooklyn.  We had been going together for\n                      almost a year.\n\n<b>                                MARIAN\n</b>                          (shaking her head in disgust)\n                      Men ... they're all the same. \n                          (beat)\n                      Our pastor in Sioux Falls was caught with\n                      his wife's sister.\n\n<b>                                MARIKA\n</b>                          (brightening)\n                      Really?\n\n<b>                                MARIAN\n</b>                      Oh, it was such a big scandal.\n\n<b>                                MARIKA\n</b>                      What happened?\n\n<b>                                MARIAN\n</b>                      Poor man had to leave town.\n                          (Marika laughs)\n                      And I hear that other women came forward.\n\n            This makes Marika laugh even harder.  Marian's story seems to\n            have assuaged her own grief in some parallel way.\n\n<b>                                MARIAN\n</b>                      You know, you ought to come out to South\n                      Dakota some time and meet my son, Steve. \n                      He's single.\n\n<b>                                MARIKA\n</b>                      What does he do?\n\n<b>                                MARIAN\n</b>                      He's an organic farmer.\n\n<b>                                MARIKA\n</b>                          (chuckling)\n                      Oh.  Well, that would be a ... change.\n                          (smiles warmly)\n                      Thank you, Mrs. Peterson.  You have a\n                      very reassuring voice.\n\n            The Disciple's MOTORCYCLES GROWL OFF SCREEN, interrupting\n            their tête-à-tête.  \n\n            Marian and Marika both rise simultaneously from the table and\n            amble over to the window together.\n\n<b>                                MARIKA\n</b>                      I wish they wouldn't come and go in\n                      packs, then they wouldn't be so loud.\n\n            They reach the window.\n\n<b>            EXT. STREET - DAY - MARIAN'S AND MARIKA'S P.O.V.\n</b>\n            The Disciples dismounting from their bikes below, shutting\n            down their engines and removing their helmets.\n\n<b>            INT. CO-OP - DAY\n</b>\n            At the window, Marian and Marika standing side by side.\n\n<b>                                MARIAN\n</b>                      I wonder what they do in there?  Don't\n                      they frighten you?  They all look so ...\n\n<b>                                MARIKA\n</b>                      ... Manly?\n\n            Marian does a double-take and throws a backward glance at\n            Marika.\n\n<b>                                MARIKA\n</b>                      You know, probably none of them had a\n                      mother like you.\n\n            Marian and Marika smile at each other.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. EAST 5TH STREET - DAY\n</b>\n            Marian's FOOT STEPS OFF THE CURB.\n\n<b>            WIDER ANGLE -\n</b>\n            Marian crosses the street headed in the direction of the\n            Satan's Disciples headquarters.\n\n            The Disciple Prospect is sitting alone, guarding the line of\n            parked Harleys.  He's wearing dark aviator shades and his\n            trademark red bandana tied over his head.  Marian steps\n            bravely right up to him.\n\n<b>                                MARIAN\n</b>                      Excuse me, sir.\n                          (the Disciple Prospect looks\n                           up, poker-faced)\n                      I just wanted to thank you for helping me\n                      get into my building yesterday.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      Yeah, sure, no problem, you're welcome.\n\n<b>                                MARIAN\n</b>                      My daughter lives across the street from\n                      you people and she tells me that you keep\n                      this area safe.  Is that true?\n\n<b>                                DISCIPLE PROSPECT\n</b>                      We like to think so, yeah.\n\n<b>                                MARIAN\n</b>                      And you don't deal drugs?\n\n            The Disciple Prospect removes his sunglasses and looks at her\n            mock reprovingly.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      Who told you we deal drugs?\n\n<b>                                MARIAN\n</b>                      I'm just concerned about my daughter.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      You don't have to worry.  She's going to\n                      be fine.  We're law-abiding citizens just\n                      like you.\n\n<b>                                MARIAN\n</b>                      What about yesterday?  Kicking that poor\n                      boy?\n\n<b>                                DISCIPLE PROSPECT\n</b>                          (mildly annoyed)\n                      That poor boy's a crack dealer from\n                      Alphabet City.  We do not allow his kind\n                      on this block.\n\n            Marian seems to accept the explanation.  She glances up.\n\n<b>            THE CLUBHOUSE DOOR -\n</b>\n            The black, forbidding door leading into the clubhouse with\n            its painting of Death on a stylized Harley, gripping\n            lightning bolts for handlebars.\n\n<b>            DISCIPLE PROSPECT -\n</b>\n            looking at Marian looking up at the door.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      Is there something else I can do for you?\n\n<b>                                MARIAN\n</b>                      Well, I'd love to see inside your club.\n\n<b>                                DISCIPLE PROSPECT\n</b>                          (taken aback)\n                      You want to come inside?\n\n<b>                                MARIAN\n</b>                      Well, if you're not holding a meeting or\n                      anything.\n\n<b>            EXT. CLUBHOUSE ENTRANCE - DAY - A FEW MOMENTS LATER\n</b>\n            The Disciple Prospect emerges from the club with the HEAD\n            DISCIPLE, a gentle giant of a man with a long, flowing wispy\n            beard and an old man's paunch.  They're muttering about\n            something.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      Her daughter lives across the street and\n                      she was wondering ...\n\n<b>                                HEAD DISCIPLE\n</b>                      What?\n\n<b>                                DISCIPLE PROSPECT\n</b>                      She's curious ...\n\n            The Head Disciple glances over at Marian standing curbside,\n            expectantly awaiting approval.  He sees that she's ingenuous.\n\n<b>                                HEAD DISCIPLE\n</b>                      What the hell ...\n                          (calling out to Marian)\n                      Come on in.\n\n            Marian, smiling, comes forward.\n\n<b>                                HEAD DISCIPLE\n</b>                          (pointing to the steps leading\n                           up to the door)\n                      You watch your step here.\n\n            And the three disappear inside.\n\n<b>            INT. SATAN'S DISCIPLES' CLUBHOUSE - DAY\n</b>\n            The hallway leading into the clubhouse is dark and gloomy. \n            ROCK MUSIC assails them as they make their passage into the\n            main room.\n\n<b>            CLUBHOUSE MAIN ROOM -\n</b>\n            They reach the main room where about ten or so DISCIPLES are\n            lounging about.  One has his nose in a book, The Road Less\n            Traveled.  Another reads the Wall Street Journal.  Two others\n            are seated at a card table, playing a game of poker.  Still\n            another is sprawled on a couch, smoking a cigarette.  The\n            walls are festooned with biker posters.  The place is a bit\n            of a mess, but innocuous.\n\n            The Head Disciple stands in the center of the room and\n            addresses his clan.\n\n<b>                                HEAD DISCIPLE\n</b>                      Hey, guys.  This here is, uh ...\n\n            He turns to Marian, realizing he doesn't know her name.\n\n<b>                                MARIAN\n</b>                          (meekly)\n                      Marian.\n\n<b>                                HEAD DISCIPLE\n</b>                          (booming voice)\n                      Marian!\n\n<b>                                A CHORUS OF VOICES\n</b>                      Hi, Marian.\n                      Hey, Marian.\n                      Yo, Marian.\n\n            Marian blushes at their warm response to her unexpected\n            appearance.\n\n<b>                                HEAD DISCIPLE\n</b>                          (explaining her visit)\n                      Marian's daughter lives across the street\n                      and she was a little worried about her.\n\n<b>                                DISCIPLE #1\n</b>                      Swear to God, lady, she's not here.\n\n            Laughter erupts.  Marian smiles.\n\n<b>                                DISCIPLE #2\n</b>                      Hey, is she cute?\n\n<b>                                DISCIPLE #3\n</b>                      Does she like motorcycles?\n\n<b>                                DISCIPLE #4\n</b>                      Can she cook?\n\n            Amiable laughter fills the room.  Marian laughs with them. \n            She glances all around her, fascinated by this dungeon she\n            had dreamed and fantasized about since she first arrived in\n            New York.\n\n<b>                                MARIAN\n</b>                      You know, this isn't so bad.  It looks\n                      like our kids' rooms when they were\n                      growing up.\n\n<b>            INSERT SHOTS -\n</b>\n            of overflowing ashtrays, crushed beer cans, fast food\n            wrappers balled up and strewn on tables.\n\n<b>            BACK -\n</b>\n            to Marian, her brow knitted thoughtfully in a schoolmarmish\n            expression.\n\n<b>                                MARIAN\n</b>                      Could use some cleaning.\n\n<b>            INSERT SHOTS -\n</b>\n            of several of the Disciples' FACES, turning to her in SLOW\n            MOTION with mock baleful looks of disapprobation.\n\n            THERE'S A BEAT, then ...\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. CLUBHOUSE - DAY - MONTAGE\n</b>\n            A MONTAGE, with abbreviated SCENES DISSOLVING one into\n            another of Marian supervising a thorough, top-to-bottom\n            cleaning of the clubhouse:\n\n            One Disciple sprays Easy-Off in a blackened oven.\n            Another empties ashtrays.\n            Yet Another vacuums.\n            Still others pick up wrappers from under the couch, while\n            Marian wags a reproving finger at them.\n            One Disciple tosses the contents of an ashtray under the\n            couch while Marian isn't looking.\n\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            INT. CLUBHOUSE - DAY - MONTAGE CONTINUING - LATER\n</b>\n            Marian in the kitchen, wearing the cut-off blue jeans\n            insignia jacket of the Satan's Disciples, their colors\n            emblazoned on the back.  She pops the top on a can of beer\n            and pours some of it into a huge pot of chili she's stirring\n            over a stove, while the Disciples sit patiently in the\n            background at a bar awaiting the food.  \n\n            Marian tries a sip of the beer and some of the Disciples\n            smile approvingly.\n\n<b>            A FEW MOMENTS LATER -\n</b>\n            Marian ladles chili into all of their bowls in a series of\n<b>            JUMP CUTS.\n</b>\n<b>                                                            DISSOLVE TO:\n</b>\n<b>            INT. CLUBHOUSE - DAY - STILL LATER\n</b>\n            All the Disciples are huddled around Marian in the middle of\n            the clubhouse, as if she were the mother hen, arms folded\n            across their chests, smiles creasing their faces, sated.\n\n<b>                                MARIAN\n</b>                      Well, I'd better be going.  It was nice\n                      meeting all of you.\n\n<b>                                DISCIPLE #1\n</b>                      Thanks, Marian.\n\n<b>                                CHORUS OF OTHER DISCIPLES\n</b>                      Thanks, Marian.\n\n<b>                                DISCIPLE #2\n</b>                      The food was outstanding.\n\n            Marian starts off.\n\n<b>                                HEAD DISCIPLE\n</b>                      You know, if we can do anything for you,\n                      Marian, you just let us know.\n\n<b>                                MARIAN\n</b>                          (turns, considers for a moment)\n                      Well, there is one thing.\n                          (beat, mildly scolding)\n                      At night, your motorcycles are so darn\n                      loud, I'm not getting much sleep.  Now,\n                      I'm going home in a few days, so ...\n                      could I ask you to keep them quiet?\n\n            Some of the Disciples exchange petulant looks, rolling their\n            eyes at the request.\n\n<b>                                HEAD DISCIPLE\n</b>                          (mollifying)\n                      Well, we'll, uh, see what we can do,\n                      Marian.\n\n            All the Disciples break into laughter.\n\n<b>                                MARIAN\n</b>                      Thank you.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. BUILDING - DAY\n</b>\n            A narrow, stand-alone ten-story isosceles-shaped office\n            building, on an island of land in downtown Manhattan. \n<b>            ESTABLISHING SHOT.\n</b>\n<b>            INT. OFFICE - DAY\n</b>\n            Paula, with her mother in tow, knocks on an open office door.\n\n<b>                                PAULA\n</b>                      Hello.\n\n<b>            NEW ANGLE -\n</b>\n            DON PALMER, an avuncular-looking man in his mid-forties rises\n            from his desk.\n\n<b>                                MR. PALMER\n</b>                      Come in.\n\n            Paula and Marian enter the office and halt mid-room across\n            from his desk.\n\n<b>                                PAULA\n</b>                      Don, this is my mother.\n                          (turns to Marian)\n                      Mom, this is my boss, Don Palmer.\n\n<b>                                MARIAN\n</b>                          (enthusiastically)\n                      Oh, it's so nice to meet you.\n\n<b>                                MR. PALMER\n</b>                      We're very glad to have your daughter\n                      working for us.\n\n<b>                                MARIAN\n</b>                          (blurting out)\n                      I met the Satan's Disciples today.\n\n<b>                                MR. PALMER\n</b>                          (chuckling nervously)\n                      Really?\n\n<b>                                PAULA\n</b>                      Mother, I ...\n\n<b>                                MARIAN\n</b>                          (waving her daughter off)\n                      My daughter lives right across the street\n                      from the Satan's Disciples' clubhouse,\n                      and I was so worried about her ...\n                      so, I went over and introduced myself. \n                      And they were the nicest people.\n\n            Paula and Mr. Palmer exchange disquieting glances.\n\n<b>                                MR. PALMER\n</b>                          (playing along)\n                      Well, that's a very unusual New York\n                      experience.\n\n<b>                                MARIAN\n</b>                      I had a wonderful time.\n\n            Paula is in a mild state of shock hearing her mother's\n            fantastical anecdote.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. CO-OP - NIGHT\n</b>\n            Paula is sitting at the dining table with a plate piled with\n            roast chicken, potatoes, and broccoli in front of her.  She\n            has a worried look etched on her face.\n\n            Marian is in the kitchen in the background, feeling light and\n            happy, a singsong quality to her voice.  She brings a plate\n            of food for herself to the table.\n\n<b>                                MARIAN\n</b>                      And they were so friendly those young\n                      men.  Though I do think they should shave\n                      their beards and ... and get some nicer\n                      clothes.\n\n            Marian sits down at the table and takes a sip of her wine,\n            picks up her utensils and gets ready to dig in.  She turns to\n            Paula who isn't touching her food, her head in her hands. \n            Marian, seemingly oblivious of her daughter's feelings,\n            prattles on.\n\n<b>                                MARIAN\n</b>                      What do you say ... we take a subway\n                      uptown and see a play tonight?\n\n            Marian finally notices that Paula isn't listening.\n\n<b>                                MARIAN\n</b>                      What's wrong?\n\n<b>                                PAULA\n</b>                      Mom ... I mean, it's amusing to imagine\n                      such a thing, but ... how many of those\n                      pills have you been taking?\n\n<b>                                MARIAN\n</b>                          (stung, taken aback)\n                      Oh, that has nothing to do with it.\n\n<b>                                PAULA\n</b>                      No, no, it's my fault.  I've been pushing\n                      you too hard to do things on your own.\n\n            Marian retreats into herself, sips her wine - as if she,\n            herself, now wonders if she's lost her mind - and her buoyant\n            mood deflates almost at once.\n\n<b>                                PAULA\n</b>                      The, um, other night, I got up to get a\n                      glass of water and you were standing by\n                      the window talking to daddy.  I called\n                      out to you, but you didn't answer.  You\n                      remember?\n\n            Marian doesn't remember, and her daughter's words pierce her. \n            She's afraid to object.\n\n<b>                                PAULA\n</b>                      New York is a ... it's a strange place in\n                      the summertime.  The noise, the warm air,\n                      it's ... easy to imagine things.\n\n            Paula lays a reassuring hand on Marian's arm, talks to her\n            condescendingly, as if she were a child.\n\n<b>                                PAULA\n</b>                      Now, you know you didn't go into the\n                      clubhouse, did you?\n\n            Marian doesn't bother to argue, fearing anything she might\n            say would compromise her.\n\n<b>                                PAULA (CONT'D)\n</b>                      It's okay.  Dad's dying put a lot of\n                      stress on you.  But you're going to be\n                      all right.  We're all going to be all\n                      right.  Where did you get this vivid\n                      imagination, huh?\n\n            Paula grips Marian's arm a little tighter and shakes it\n            gently as if snapping her back to reality.  Marian returns\n            her a tight-lipped smile.\n\n<b>                                                               FADE OUT.\n</b>\n<b>            INT. CO-OP - NIGHT\n</b>\n            Marian, lying supine on the convertible sofa bed by the open\n            window, snoring peacefully.\n\n<b>            EXT. EAST 5TH STREET - NIGHT\n</b>\n            On the sidewalk, the Disciple Prospect sits next to the fire\n            breathing oil drum, standing sentry over the Harleys.\n\n            One of the Disciples comes out of the clubhouse and they high\n            five.  The Disciple mounts his Harley and is about to kick\n            start it to life, when the Disciple Prospect rises from his\n            stool.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      Yo, man!\n\n            The Disciple about to start his bike, turns.  \n\n            The Disciple Prospect raises two fingers to his lips in a\n            kind of warning, then gestures up to Paula's co-op where\n            Marian is sleeping.\n\n            The Disciple, remembering the new rule, nods assent with a\n            slightly annoyed expression.\n\n            Then, he puts his Harley into neutral, dismounts, and starts\n            slowly walking it down the quiet, ill-lit street.\n\n<b>            INT. CO-OP - NIGHT\n</b>\n            The room is cast in soft ambient light from the street. \n            Paula comes into the living room and lies down next to her\n            mother on the sofa bed and rouses her awake.  Marian swims\n            leadenly back to consciousness.  \n\n<b>                                PAULA\n</b>                      Mom, I need to talk to you.\n\n<b>                                MARIAN\n</b>                          (still drowsy)\n                      If it's about the bikers, dear, I don't\n                      want to talk about it.\n\n<b>                                PAULA\n</b>                      No, I had a dream about daddy.  Do you\n                      think I'll ever meet anyone like him?\n\n<b>                                MARIAN\n</b>                      Oh, I hope so, dear.\n\n<b>                                PAULA\n</b>                      You know that guy in the pictures you\n                      saw?\n\n<b>                                MARIAN\n</b>                      Aaron?\n\n<b>                                PAULA\n</b>                      Yeah ... turned out to be a real jerk.\n\n<b>                                MARIAN\n</b>                      I'm sorry.\n\n            Marian pats her daughter on the arm.  Paula pricks up her\n            ears for a minute.\n\n<b>                                PAULA\n</b>                      It's unusually quiet tonight, isn't it?\n\n<b>                                MARIAN\n</b>                      Mm hmm.\n\n<b>                                                                FADE TO:\n</b>\n<b>            EXT. CENTRAL PARK - DAY\n</b>\n            A lovely, sun-drenched day.  Shadows dapple a promenade along\n            one of the park's many ponds.  Paula and Marian walk arm-in\n            arm.\n\n<b>                                PAULA\n</b>                      I think you should consider coming out\n                      and staying with me longer.\n\n<b>                                MARIAN\n</b>                      Oh, I don't want to be in the way. \n                      You've got your career and everything.\n\n<b>                                PAULA\n</b>                      You wouldn't be in the way.  I like\n                      having you around.\n\n<b>                                MARIAN\n</b>                      Dear, I was thinking.  Why don't we go to\n                      Paris next year?  I've never been.  Your\n                      father, God bless him, wasn't much for\n                      traveling.\n\n<b>                                PAULA\n</b>                      I'd love to.\n\n            They walk off into the golden light.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            INT. CO-OP - DAY\n</b>\n            Marian is finishing up her packing.  Paula comes from the\n            kitchen, bearing a gift for her mother to take home with her.\n\n<b>                                PAULA\n</b>                      Here you go.\n                          (Marian accepts the gift)\n                      I think you should talk to Dr. Byrne when\n                      you get back about how much Valium he's\n                      prescribing.  Okay?\n\n<b>                                MARIAN\n</b>                      At my age, I'm going to take any pill\n                      that makes me feel better.\n\n<b>                                PAULA\n</b>                      Mother!\n\n<b>                                MARIAN\n</b>                      I can make my own decisions.\n\n            Paula extends her arms and embraces her mother.\n\n<b>                                PAULA\n</b>                      I love you, Mom.\n                          (turns to leave)\n                      I have to run.  You remembered to call\n                      the limousine service, right?\n\n<b>                                MARIAN\n</b>                      Mm hmm.\n\n<b>                                PAULA\n</b>                          (pulling on her backpack)\n                      Well, bye.  And have a safe trip ... and\n                      ... Paris in the spring!\n\n<b>                                MARIAN\n</b>                          (pensive)\n                      Goodbye, sweetheart.\n\n            Paula blows her mother a kiss and Marian throws her daughter\n            a little wave.\n\n<b>                                                                 CUT TO:\n</b>\n<b>            EXT. EAST 5TH STREET - DAY\n</b>\n            Marian steps down the stairs of her daughter's building.  A\n            smile breaks out on her face when she SEES:\n\n<b>            A MOTORCADE -\n</b>\n            of idling Harleys in the middle of the street, waiting for\n            her.\n\n<b>            MARIAN -\n</b>\n            turns to the Head Disciple, materializing behind her,\n            carrying her luggage.  He gestures with his head toward the\n            motorcycles.\n\n<b>            THE MIDDLE OF THE STREET -\n</b>\n            The Disciple Prospect takes Marian's luggage from the Head\n            Disciple and hauls it over to one of the waiting Harleys and\n            straps it on to the carrying rack.\n\n            Then, he helps Marian onto the back of the Harley she's going\n            to be riding to the airport.  Gently, he places a helmet -\n            festooned with decals of fire-breathing reptiles - over her\n            head and affixes the chin-strap.\n\n<b>                                DISCIPLE PROSPECT\n</b>                      All right?\n\n            Marian nods and beams at the same time.\n\n            The other Harleys form a circle around Marian's motorcycle.\n\n            The Disciple Prospect gives them a signal and they start off,\n            one by one, forming a V-shaped procession.\n\n            Marian, completely comfortable on her motorcycle, her arms\n            around her Disciple escort, her fever dream now manifest.\n\n            CRANE UP as the procession heads down East 5TH.\n\n<b>            WHITE OUT -\n</b>\n<b>                                       CREDITS\n</b>\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>My Mother Dreams the Satan's Disciples in New York</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Rex Pickett\" title=\"Scripts by Rex Pickett\">Rex Pickett</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Short\" title=\"Short Scripts\">Short</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/My Mother Dreams the Satan's Disciples in New York Script.html#comments\" title=\"My Mother Dreams the Satan's Disciples in New York comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:12:13.865767"}