{"title": "Next Friday", "film_link": "/Movie Scripts/Next Friday Script.html", "script_link": "/scripts/Next-Friday.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Next Friday Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Next Friday Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (9.88 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Ice Cube\" title=\"Scripts by Ice Cube\">Ice Cube</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/>\n<br/>\n<a href=\"/scripts/Next-Friday.html\">Read \"Next Friday\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<title>\"Next Friday\" -- by Ice Cube</title>\n\n\n<pre>\n\n\n\n\n<b>       EXT. FRONT LAWN - OVERHEAD SHOT - NIGHT\n</b>\n       DEBO is laid out on the grass.\n\n<b>                           CRAIG (V.O.)\n</b>                 In the movies, when you beat up the\n                 neighborhood bully; you suppose to live\n                 happily ever after.  But around here;\n                 that's when all the drama begins...\n\n       Blue and red police lights flash over Debo's body.  Two\n       sheriffs walk INTO OUR FRAME and stand over Debo.  They flash\n       their lights on him.\n\n                           CRAIG (cont'd) (V.O.)\n                 Last Friday; I got fired for the first\n                 time.  I got high for the first time.  I\n                 got shot at for the first time and I\n                 kicked Debo's ass for the first time...\n\n       They get him to his feet; but he stumbles and falls in the\n       bushes like a knocked out prize fighter.  The sheriffs laugh\n       at him.\n\n       Debo looks dazed and confused.  The sheriffs help him out the\n       bushes and start to cuff him.\n\n                           CRAIG (cont'd) (V.O.)\n                 I was the man that night; and Debo ended\n                 up going to jail for a couple of years.\n                 But he told Ezal he was getting out next\n                 Friday.  He said, when he see me, he was\n                 gonna smoke me on the spot...\n\n       They walk him OUT OF FRAME...\n\n<b>                                                     FADE TO BLACK.\n</b>\n<b>                                                        OVER BLACK:\n</b>\n                           CRAIG (cont'd) (V.O.)\n                 And today is next Friday...\n\n<b>       SOUNDTRACK!\n</b>\n       \"New Line Cinema presents, etc., etc...\n\n<b>       FADE IN:\n</b>\n<b>       EXT. LOS ANGELES - EARLY MORNING\n</b>\n       OPENING CREDITS.  It's early Friday morning and the sun peeks\n       over the LA skyline.  As the city starts to awake and the\n       credits continue to roll;\n       we see SEVERAL SHOTS of the real people who make up Los\n       Angeles.  It seems that they all move to the same beat.\n\n<b>       EXT. L.A. COUNTY JAIL - CONTINUOUS\n</b>\n       Debo is released from the Twin Towers County Jail.  Still in\n       his orange jumpsuit, he walks right past us and down the\n       street.  Everybody clears his path.\n\n       SOUNDTRACK still PUMPIN'.\n\n       Debo crosses the street passing an old man dancing and\n       directing traffic.  Debo stops, the man starts to dance in\n       front of him.  He stares for a second, then he's on his way.\n\n       Still walking tall and hard, he trips over a crack in the\n       sidewalk (losing cool points).\n\n       Three little black girls in plaid uniforms practice the\n       latest dance steps on their way to school.  Debo is walking\n       towards them.  They scream and take off in the other\n       direction.  He smiles.  Briefly.\n\n       Still walking; he stops at a corner.  A SA boy waits to cross\n       with his low-rider bike.  A Metrolink train passes.  After it\n       goes by; we see Debo riding off on the boy's bike.  He's on\n       the ground holding his eye.\n\n       Debo continues to ride through the city.\n\n       He turns a corner or two and comes to a stop at Craig's\n       house.\n\n<b>       EXT. JONES' HOUSE - CONTINUOUS\n</b>\n       Mr. Jones' dog catcher's truck sits in front of the house.\n\n       A CHIHUAHUA (like the Taco Bell dog) takes a dump on the\n       lawn.  It starts to BARK at Debo.  He looks down at the dog\n       and kicks him in the street.  The DOG YIPES!\n\n       Debo focuses his attention on Craig's house.\n\n<b>       INT. JONES' HOUSE - CONTINUOUS\n</b>\n       The hallway is clear and quiet, until MR. JONES (Craig's\n       father), storms out of the bedroom.  He struggles to put on\n       his dog catcher's uniform.  He stops at the bathroom door and\n       knocks hard.\n\n<b>                           MR. JONES\n</b>                 Craig!  Craig!  Off yo' ass and on yo'\n                 feet; this ain't the time to beat your\n                 meat!\n\n       Mr. Jones laughs at himself.\n\n<b>                           CRAIG (O.S.)\n</b>                 I'll be out in about 35-40 minutes!\n\n<b>                           MR. JONES\n</b>                 Hurry up; today is Fri-day!  And we gotta\n                 hit the high-way!\n\n       Mr. Jones continues on his way; dancing to the beat.\n\n<b>       INT. BATHROOM - CLOSE-UP ON HIGH TIMES MAGAZINE - CONTINUOUS\n</b>\n       Hands crack open a $20 sack of bud onto the magazine.  A pack\n       of Zigzags fall INTO FRAME.  Papers are ripped from the\n       package.\n\n<b>       CLOSE UP ON CRAIG JONES\n</b>\n       the doctor of this delicate operation.\n\n<b>                           CRAIG (V.O.)\n</b>                 Soon as my pops found out what Debo said\n                 to Ezal, he wanted me to move with my\n                 uncle and little cousin in Rancho\n                 Cucamonga.  Til' things calm down, or\n                 Debo went back to prison.  Whichever\n                 comes first.\n\n       He's sitting on the toilet (dressed: not using it) putting\n       the finishing touches on his masterpiece.  He licks, rolls\n       and slides the 'J into the fifth pocket on his Levi jeans.\n\n                           CRAIG (cont'd) (V.O.)\n                 I feel like the biggest punk around here.\n                 I wiped Debo's ass.  He should be the one\n                 moving.\n\n       He exits.\n\n<b>       EXT. JONES' HOUSE - CONTINUOUS\n</b>\n       The front door opens.  Mr. Jones walks out the door, yelling\n       back into the house.\n\n<b>                           MR. JONES\n</b>                 Craig!  Let's go!  I don't wanna hit that\n                 traffic.\n\n       He steps off the porch backwards and into \"fresh Chihuahua\n       shit.\"  He slips and falls on the grass.\n\n                           MR. JONES (cont'd)\n                 I be got damn.\n\n       Mr. Jones gets up.  He brushes the grass off his uniform.  He\n       looks clean, but when he turns around dog shit is smashed all\n       over his back and butt.\n\n                           MR. JONES (cont'd)\n                 Craig!  Craig!\n\n       Craig emerges from the house with his bags in hand.\n\n<b>                           CRAIG\n</b>                     (irritated)\n                 Here I come!\n\n<b>                           MR. JONES\n</b>                     (still mad)\n                 Well bring yo' ass on...\n\n       Craig slams the door and starts towards the truck.\n\n<b>                           CRAIG\n</b>                 What's the matter?\n\n<b>                           MR. JONES\n</b>                 I fell in some mud.  Now hurry up!\n\n       Mr. Jones gets in the truck.  Craig jumps in.  They back out\n       and pull off.\n\n<b>       INT. DOG TRUCK - MOVING - CLOSE-UP ON CRAIG - CONTINUOUS\n</b>\n       He's daydreaming about Smokey.\n\n<b>                           CRAIG (V.O.)\n</b>                 I didn't wanna leave my neighborhood at\n                 all.  Especially my homeboy Smokey.  But\n                 he went to rehab last week.  I know I'mma\n                 miss him...\n\n       Out of nowhere, Debo jumps in front of the truck.  Mr. Jones\n       slams on the BRAKES.\n\n<b>                           DEBO\n</b>                 Craig!  Get out the car, boy!  This the\n                 rematch!\n\n       Debo reaches for his shank.  Craig turns to Mr. Jones!\n\n<b>                           CRAIG\n</b>                 Daddy, punch it!\n\n       Mr. Jones floors it and hits Debo.  He falls over the hood,\n       off the car and in the street.  The yellow truck speeds off.\n\n       Debo jumps up staggering with scrapes and bruises.\n\n<b>                           DEBO\n</b>                 You know I'mma find you!  You can run ya'\n                 can't hide!\n\n<b>       BACK IN CAR - CONTINUOUS\n</b>\n       Craig screams out the window.\n\n<b>                           CRAIG\n</b>                 You fake ass Suge Knight!\n\n       Mr. Jones is a bit shaken up.\n\n<b>                           MR. JONES\n</b>                 That nigga worst than them damn pit\n                 bulldogs or something!  That's why moving\n                 wit'cha Uncle Elroy and Cousin Day-Day is\n                 the best thing for you right now.\n\n<b>                           CRAIG\n</b>                     (with attitude)\n                 Ya'll making me look like a punk.\n\n<b>                           MR. JONES\n</b>                 It ain't about being a punk, son.  It's\n                 about this...\n\n       Craig smells something in the air.\n\n                           MR. JONES (cont'd)\n                 My great, great grand daddy on my Momma\n                 side; had a saying... 'See a fool --\n                 leave a fool.'  Somebody else a get him.\n                 Plus, I don't want that fool shooting at\n                 my house trying to hit yo' ass.\n\n<b>                           CRAIG\n</b>                 What's that smell?\n\n       Mr. Jones sniffs.\n\n<b>                           MR. JONES\n</b>                 Must be your upper lip, 'cause I don't\n                 smell nothing.\n\n<b>                           CRAIG\n</b>                     (holding his nose)\n                 I do.\n\n<b>                           MR. JONES\n</b>                 What it smell like?\n\n<b>                           CRAIG\n</b>                 Smells like you didn't fall in no mud.\n\n       Mr. Jones grabs the air freshener from under the seat.  He\n       starts to spray too much.  Craig's window won't roll down.\n\n                           CRAIG (cont'd)\n                 What's wrong with the window?\n\n<b>                           MR. JONES\n</b>                 I gotta get'em fixed.  They don't roll\n                 down.\n\n<b>                           CRAIG\n</b>                 All damn.\n\n<b>                           MR. JONES\n</b>                 Just hold your breath.\n\n<b>       EXT. CITY OF RANCHO CUCAMONGA - MORNING\n</b>\n       They exit the freeway and pass a sign that reads, \"Rancho\n       Cucamonga\" (the city away from the city).\n\n<b>       EXT. UNCLE ELROY'S STREET - CONTINUOUS\n</b>\n       Welcome to the suburbs.  Where the \"Smiley Happy People\" live\n       in peace and quiet.\n\n       The neighborhood is full of green lawns and nice two story\n       track homes as far as the eye can see.  The yellow truck\n       drives through the streets and pulls up to a cul-de-sac.  Mr.\n       Jones BLOWS the HORN.\n\n<b>                           MR. JONES\n</b>                 Nice neighborhood, huh?\n\n<b>                           CRAIG\n</b>                 It's alright.\n\n<b>                           MR. JONES\n</b>                 18-years of chasing dogs; and my lazy ass\n                 brother hits the lotto his first time\n                 playing.  I still can't figure that one\n                 out.\n\n<b>                           CRAIG\n</b>                 Why they got to have the loudest house on\n                 the block!\n\n       Uncle Elroy's house is royal blue with gold trim.  All the\n       other houses are painted in earth tones.\n\n<b>                           MR. JONES\n</b>                 Ah, son, don't be no hater.  You know\n                 your uncle ain't got no taste.  Just\n                 don't let him rub off on you.\n\n       Craig grabs his bags.\n\n<b>                           CRAIG\n</b>                 You coming in?\n\n<b>                           MR. JONES\n</b>                 No, I'mma go on to work.  I don't wanna\n                 hear Elroy's mouth.  Now listen to me,\n                 Craig.  It's gonna be different living\n                 over here.  Don't let your uncle and your\n                 cousin get you into no shit.  Understand?\n\n<b>                           CRAIG\n</b>                 Hey, Pops, I'm grown.  Can't nobody get\n                 me in trouble no more.\n\n       As craig gets out;  the front door flies open.  It's DAY-DAY\n       (22), Craig's crazy younger cousin.  He yells back into the\n       house.\n\n<b>                           DAY-DAY\n</b>                 Daddy, Craig is here.\n\n       Day-Day walks out to the car and gives Craig a pound.\n\n<b>                           CRAIG\n</b>                 What's crackin'?\n\n<b>                           DAY-DAY\n</b>                 You.  Hi, Uncle Willie.\n\n<b>                           MR. JONES\n</b>                 Hey, Day-Day.  Where's yo' big head\n                 father?\n\n<b>                           DAY-DAY\n</b>                 There he is.\n\n       Just then, UNCLE ELROY (42) hits the door.  Dressed in boxers\n       and a T-shirt.  This is Mr. Jones' (very loud) little\n       brother.\n\n<b>                           UNCLE ELROY\n</b>                 Hey, Debo, heard you running from a ass-\n                 whippin'?\n\n<b>                           CRAIG\n</b>                 Naw, it ain't like that.\n\n<b>                           UNCLE ELROY\n</b>                 If you see that boy again, bite off his\n                 ear off like Mike Tyson.\n\n<b>                           CRAIG\n</b>                 Alright, I'll remember that.\n\n<b>                           UNCLE ELROY\n</b>                 You know me?  I would've shot his big\n                 ass.\n                     (peeking into the ear)\n                 Hey, Willie, how's it going?  Still\n                 steppin' in dog shit every day?\n\n       Uncle Elroy laughs.  Mr. Jones isn't amused.\n\n<b>                           MR. JONES\n</b>                 Make sure you look after my son out here.\n                 Don't get him involved with none of your\n                 bullshit, Roy.\n\n<b>                           UNCLE ELROY\n</b>                 Don't worry 'bout nothin', big bro.  He\n                 in the best fuckin' hands in Rancho\n                 Chocomunga, baby!  This my world, you\n                 just a nigga late paying rent.  Ain't\n                 that right, nephew?\n\n       Uncle Elroy hugs Craig by the arm.\n\n<b>                           MR. JONES\n</b>                 Craig, remember what I told you.\n\n<b>                           CRAIG\n</b>                 I'll remember.\n\n       Mr. Jones pulls off.  Uncle Elroy yells out to him.\n\n<b>                           UNCLE ELROY\n</b>                 Send Betty my love.\n                     (to Craig)\n                 Boy you looking good.\n                     (grabbing his bags)\n                 I'mma take these in the house for you,\n                 man... and when you finish with this cat,\n                 come inside.  I got something to show\n                 you.\n\n<b>                           CRAIG\n</b>                 Thanks, Unc.\n\n       Uncle Elroy starts towards to the house.\n\n<b>                           DAY-DAY\n</b>                 You know it's been over a year since we\n                 kicked it last?  Up at the family\n                 reunion.\n\n<b>                           CRAIG\n</b>                 I know, that's when Uncle Elroy cussed\n                 out everybody, and threw up in Aunt\n                 Faye's backseat.\n\n       Day-Day laughs.\n\n<b>                           DAY-DAY\n</b>                 Yep.  I forgot about him cussin' out\n                 everybody.  Damn that was fun.\n\n<b>                           CRAIG\n</b>                 I know, we had a good time.  But ever\n                 since you guys moved out here, it seems\n                 like we've lost touch.\n\n<b>                           DAY-DAY\n</b>                 I know; this a long way from Watts.  But\n                 what I like about living out here is that\n                 you don't hear no helicopters, no sirens,\n                 no drive-by's, no nothing.  Just peace\n                 and quiet.  Listen.\n\n       They do.  It is quiet, except for a few BIRDS SINGING.\n\n                           DAY-DAY (cont'd)\n                 Shit sound good, huh?\n\n       Just then, a maroon Cadillac low-rider on Daytons rolls up\n       the block.  It's the Jokers: JOKER (28), LI'L JOKER (21) and\n       BABY JOKER (15).  They pull into their driveway.\n\n                           DAY-DAY (cont'd)\n                 Aw damn.\n\n       In SLOW MOTION: One by one they get out the car.  They have a\n       dog with them named \"Cheeco.\"  As they get to the front door\n       they all look over at Craig and Day-Day.\n\n       Day-Day looks away, while Craig keeps his eye on them.  They\n       disappear inside.\n\n<b>                           CRAIG\n</b>                 Who is that?\n\n<b>                           DAY-DAY\n</b>                 Joker, he just got out of the pen.  Li'l\n                 Joker, he just got out of Youth\n                 Authority.  And Baby Joker, he just got\n                 out of Juvenile Hall.\n\n<b>                           CRAIG\n</b>                 They ever let you hit the switches on\n                 that Cadillac?\n\n<b>                           DAY-DAY\n</b>                 Naw, them dudes is assholes.  Especially\n                 that dog - Cheeco.  Watch this little\n                 ass, he's sneaky.  Plus, I got something\n                 better than a Cadillac.\n\n       They walk over to his black BMW 325i on chrome rims.\n\n<b>                           CRAIG\n</b>                 This you?\n\n<b>                           DAY-DAY\n</b>                     (proud)\n                 Yeah, that's me.  Just a little somethin'\n                 somethin' I picked up.\n\n<b>                           CRAIG\n</b>                 Must be nice.  I wish we won the lottery.\n                 Come up on a million dollars like ya'll.\n\n<b>                           DAY-DAY\n</b>                 Man, after taxes, lawyer fees, and paying\n                 off my daddy's bad credit, we didn't end\n                 up with a million.  We bought this house\n                 and I spent the rest on this.  It's the\n                 bomb, huh?\n\n<b>                           CRAIG\n</b>                 This my baby.  I feel like a new nigga in\n                 this car.  I get mo' phone numbers\n                 rollin' this, than I ever did on the bus.\n\n<b>                           MISS HO KYM (O.S.)\n</b>                 Hi, Day-Day!\n\n       They turn to spot MISS HO KYM (67), the old Korean lady who\n       lives next door.  She's sitting on her porch nursing a cup of\n       coffee.\n\n<b>                           DAY-DAY\n</b>                     (speaking louder and slower)\n                 Hi, Mulan.\n\n<b>                           MISS HO KYM\n</b>                 Fuck you, Day-Day.  Who's ya boy?\n\n<b>                           DAY-DAY\n</b>                 This my cousin, Craig.  He just moved out\n                 here from L.A.  Craig, this is Miss Ho.\n\n       Day-Day smiles at Craig.\n\n<b>                           MISS HO KYM\n</b>                 My name is Miss Ho Kym.  Day-Day just\n                 trying to be a smart ass.  Nice to meet\n                 you, Craig.  Are you 'bout it, 'bout it?\n\n<b>                           CRAIG\n</b>                 Excuse me?\n\n<b>                           MISS HO KYM\n</b>                 I said...are you 'bout it, 'bout it --\n                 rowdy, rowdy?\n\n       Craig can't believe his ears.\n\n<b>                           CRAIG\n</b>                 Yeah, I'm 'bout it.\n\n<b>                           MISS HO KYM\n</b>                 Well, then, it's all good.  Yo, Day-Day,\n                 something is going down with those\n                 Mexicans across the street?  I've been\n                 seeing a lot of activity.\n\n       They all look over at the Joker's house.\n\n<b>                           CRAIG\n</b>                 What kind of activity?\n\n<b>                           MISS HO KYM\n</b>                 Strange activity.  I think they running\n                 drugs off Tijuana.  Day-Day don't believe\n                 me.\n\n<b>                           DAY-DAY\n</b>                 How do you know for sure?\n\n<b>                           MISS HO KYM\n</b>                 I know everything, playboy.  Don't hate,\n                 congratulate.\n\n<b>                           DAY-DAY\n</b>                 I don't have time, Miss Ho, I'll see you\n                 later.\n\n       Day-Day and Craig start to walk back to the house.\n\n<b>                           MISS HO KYM\n</b>                 See you later, Day-Day.  Come by after\n                 work, I got the John Blaze shit for you.\n\n<b>                           CRAIG\n</b>                 Nice to meet you?\n\n<b>                           MISS HO KYM\n</b>                 Peace out, Craig.\n\n<b>       INT. UNCLE ELROY'S HOUSE - CONTINUOUS\n</b>\n       Day-Day and Craig enter the house.  They still have the\n       furniture from the projects.  Craig looks around.  He spots\n       at a few hanging pictures.\n\n<b>                           CRAIG\n</b>                 Man, this a cool house.\n\n<b>                           DAY-DAY\n</b>                     (picking up a picture)\n                 Thanks, I just wish my mother had a\n                 chance to see it.\n\n       Mother's picture: she looks like Day-Day with a wig on.\n       She's smiling and holding the winning lotto ticket.\n\n                           DAY-DAY (cont'd)\n                 But when she found out we won the money,\n                 she had a heart attack.  You know the\n                 story.\n\n<b>                           CRAIG\n</b>                 Yeah.\n\n       A sad moment.\n\n<b>                           DAY-DAY\n</b>                 Go on and make yourself at home.  I'mma\n                 go get dressed for work.\n\n<b>                           CRAIG\n</b>                 Oh, yeah, where you work at?\n\n<b>                           DAY-DAY\n</b>                 Pinky's Records and Disc in the shopping\n                 center.  I'mma talk to my boss and see if\n                 he got a little position for you.  'Cause\n                 you been unemployed for a long time now,\n                 Craig.\n\n<b>                           CRAIG\n</b>                 Thanks for reminding me.\n\n       Day-Day exits.  Craig is left to look around, until something\n       outside catches his eye.\n\n<b>       EXT. HOUSE\n</b>\n       It's D'WANA (20), Day-Day's six-month pregnant girlfriend.\n       She's walking on the right side of his BMW.  With one hand\n       she waves at Craig...with the other hand she's keying Day-\n       Day's car with the skills of a retarded first-grader.\n\n<b>       INT. HOUSE\n</b>\n       Craig waves back, but something ain't right.  Uncle Elroy\n       steps in with SUGA (39), his nymphomaniac girlfriend.  She's\n       wearing a sexy nightie that's a size too small.\n\n<b>                           UNCLE ELROY\n</b>                 Craig, I want you to meet my old lady,\n                 Suga.  Suga, this is Craig.\n\n<b>                           SUGA\n</b>                 Oooh, ba-by!\n\n       She gives Craig a big, juicy hug and kiss, grabbing his ass\n       in the process.\n\n                           SUGA (cont'd)\n                     (hugging and grabbing)\n                 You even cuter than your baby pictures.\n\n<b>                           CRAIG\n</b>                 Thank you.\n\n<b>                           SUGA\n</b>                     (whispering in Craig's ear)\n                 You know, I'mma be your new auntie.  We\n                 can keep it all in the family if you want\n                 to.\n\n       Uncle Elroy un-hugs them.\n\n<b>                           UNCLE ELROY\n</b>                 Okay, okay, that's enough.  Go put on\n                 some damn clothes.\n\n<b>                           SUGA\n</b>                     (pouting)\n                 Elroy.\n\n<b>                           UNCLE ELROY\n</b>                 Suga.  Go ahead and get us something to\n                 smoke on.\n\n<b>                           SUGA\n</b>                 Okay.\n                     (winking)\n                 Bye, Craig.\n\n<b>                           CRAIG\n</b>                 Nice to meet you.\n\n       Suga walks out.\n\n<b>                           UNCLE ELROY\n</b>                 Man, that girl's gonna kill me one day.\n                 Viagra ain't working.  My back keep going\n                 out... she don't never get enough.  But\n                 check this out.  I got to lay some ground\n                 rules.\n                     (gets closer to Craig)\n                 Your my family and I love you.  You're\n                 welcome to anything you want in my home.\n                 But I don't wanna catch you in the\n                 refrigerator or in my Suga bowl... you\n                 feel me knocking?\n\n<b>                           CRAIG\n</b>                 Yeah.\n\n<b>                           UNCLE ELROY\n</b>                 Well, let me in.\n\n<b>                           CRAIG\n</b>                 Uncle Elroy, who's that girl by Day-Day's\n                 car?\n\n       He looks.\n\n<b>                           UNCLE ELROY\n</b>                 Oh, that's D'Wana.  His ex.\n                     (yelling upstairs)\n                 Day-Day, the crazy bitch is back!\n\n       Day-Day runs down the stairs to get a look.  He's holding a\n       piece of paper.\n\n<b>                           DAY-DAY\n</b>                 Aw, naw.\n\n       He runs out the door.\n\n<b>       EXT. HOUSE\n</b>\n       D'Wana continues her job.  Day-Day storms over, waving the\n       paper.\n\n<b>                           DAY-DAY\n</b>                 Girl, you supposed to be 1000 feet from\n                 my house.  What you doing over here?\n\n<b>                           D'WANA\n</b>                 What it look like I'm doing?  You can't\n                 quit me, I'm pregnant!\n\n<b>                           DAY-DAY\n</b>                 That ain't my baby!\n\n       Day-Day spots the damage.  He loses it.\n\n                           DAY-DAY (cont'd)\n                     (in disbelief)\n                 Oh, my God!  What you doing?!\n\n       Now he's a madman.\n\n                           DAY-DAY (cont'd)\n                 Bitch!  You keyed my car!  I'mma kill\n                 you!\n\n       Day-Day charges D'Wana.  She has her pepper spray ready.\n\n<b>                           D'WANA\n</b>                 I got your bitch right here.\n\n       D'Wana sprays his face orange.  He stops in his tracks; grabs\n       his eyes and screams like a woman.\n\n<b>                           DAY-DAY\n</b>                 Awwwww....\n                     (staggering)\n                 Awwwww....\n\n<b>                           D'WANA\n</b>                 I expect you to return all phone calls\n                 and take me to lunch today.  I'll be back\n                 out here on my break.  Nobody quits me.\n\n       D'Wana runs to her car.  She speeds off.  Uncle Elroy goes\n       for the water hose.  Craig grabs Day-Day.\n\n<b>                           DAY-DAY\n</b>                 I can't see!  I can't see!  Daddy!\n\n<b>                           CRAIG\n</b>                 Lay down, Day-Day.  Stop moving.\n\n       Craig puts him on the grass.\n\n<b>                           DAY-DAY\n</b>                 She pepper-sprayed me, man!  She pepper-\n                 sprayed me!\n\n<b>                           CRAIG\n</b>                 I know, be still.\n\n       Before he can say another word, Uncle Elroy nearly drowns him\n       with the water hose.\n\n<b>                           UNCLE ELROY\n</b>                 Boy, you got you a little fatal\n                 attraction, huh?  I had two or three of\n                 them in my day.\n\n       Day-Day is drowning.\n\n                           UNCLE ELROY (cont'd)\n                 Craig, I hope you know how to deal with\n                 women better than this fool.\n\n       Craig moves the hose.\n\n<b>                           CRAIG\n</b>                 That's too much water.\n\n       Now Day-Day is blind and choking.\n\n<b>                           UNCLE ELROY\n</b>                 Help him to his feet.  Let's get him to\n                 the bathroom.\n\n       They get him up and into the house.\n\n<b>       INT. BATHROOM - CONTINUOUS\n</b>\n       They rush Day-Day into the shower.\n\n<b>                           DAY-DAY\n</b>                     (confused)\n                 Hold on.  What you doing?\n\n       Uncle Elroy turns on the cold water.  Day-Day screams.  He\n       tries to get out.  They push him back in.\n\n<b>                           UNCLE ELROY\n</b>                 Wet your eyes, boy.  Stay in there for\n                 about 20 minutes.\n\n<b>                           DAY-DAY\n</b>                 20 minutes?\n\n<b>                           UNCLE ELROY\n</b>                 Yeah, 20 minutes.  Trust me.  I've been\n                 pepper sprayed nine times.  20 minutes.\n\n       Uncle Elroy slams the door.  Day-Day stands in the shower\n       fully dressed and soaking wet.\n\n                           UNCLE ELROY (cont'd)\n                 Let me show you my back yard.  You know\n                 it's bigger than y'all back yard.\n\n       They exit, leaving Day-Day in the shower.\n\n<b>       EXT. ELROY'S BACK YARD - CONTINUOUS\n</b>\n       Uncle Elroy and Craig start to walk around the back yard.  In\n       the B.G., we NOTICE giant weed plants everywhere.\n\n<b>                           UNCLE ELROY\n</b>                 Yeah, you gotta have a little money to\n                 live out here, Craig.  I never thought\n                 I'd be the kinda nigga to move to the\n                 suburbs.  But as soon as I got my check,\n                 I was gone.  Paid 230 thousand dollars\n                 cash on this house.\n\n<b>                           CRAIG\n</b>                 You paid cash?\n\n<b>                           UNCLE ELROY\n</b>                 Cash money.  They wasn't gonna stick me\n                 with no 30-year payment plan.  That's for\n                 suckas.  They got my daddy like that for\n                 a Cadillac years ago.  I got the only\n                 house on the block that's paid for.\n                 That's why I'm the king around here.\n\n       They walk over to the pool.\n\n                           UNCLE ELROY (cont'd)\n                 You like that pool?\n\n       It's half-full with dirty water.  An upside-down lawn chair\n       floats in it.\n\n<b>                           CRAIG\n</b>                 It's cool, but where's the water?\n\n<b>                           UNCLE ELROY\n</b>                 Don't need water.  We didn't have no pool\n                 in the projects...so none of us swim.\n\n<b>                           CRAIG\n</b>                 Y'all never use it?\n\n<b>                           UNCLE ELROY\n</b>                 Never...\n                     (humping the air)\n                 But me and Suga can get real nasty in\n                 that Jacuzzi, though.\n\n       The Jacuzzi water has a purple condom floating in it.  Uncle\n       Elroy reaches over and picks it out.\n\n                           UNCLE ELROY (cont'd)\n                     (shaking the water off the\n                      condom)\n                 You welcome get in it anytime you want\n                 to.  Shit, you my brother's son.\n\n<b>                           CRAIG\n</b>                 That's okay, Unc.  I can't swim, either.\n\n<b>                           UNCLE ELROY\n</b>                 Good.\n\n<b>       EXT. CRACK HOUSE - MORNING\n</b>\n       A run-down crack house sits alone in the middle of the block.\n       It looks deserted with chipped paint, overgrown grass and\n       security bars everywhere.  Inside we can hear a FIGHT in\n       progress.\n\n<b>                           CRACK DEALER (O.S.)\n</b>                 Ezal, I'm sick of you coming around here\n                 wit no money.\n\n       Suddenly the door flies open and Ezal comes flying out on his\n       ass.\n\n<b>                           EZAL\n</b>                 I be damned.\n\n       He gets up and brushes himself off.  He heads back into the\n       crack house.\n\n                           EZAL (cont'd)\n                 Now look here, man.  I'mma preferred\n                 customer and I can take my credit card\n                 somewhere else.\n\n       SMACK!  SMACK!  SMACK!  Ezal is roughed up some more and\n       flies through the picture window.  GLASS rains down.\n\n                           EZAL (cont'd)\n                 Oh, my neck, oh, my back.  Man, I quit!\n                 I'm retired!  Officially!  Life shouldn't\n                 be this hard for a crackhead!\n\n       Ezal lays there in pain.  Out of nowhere, a bicycle comes\n       INTO FRAME.  Ezal looks up at the rider.  It's Debo.\n\n<b>                           DEBO\n</b>                 Where did Craig move to?\n\n<b>                           EZAL\n</b>                 I don't know, Debo.\n\n       Debo rolls on top of him with the front tire.  Ezal is\n       smashed and in more pain.\n\n<b>                           DEBO\n</b>                 What you say?\n\n<b>                           EZAL\n</b>                     (hurting)\n                 He moved out to Rancho Cucamonga with his\n                 cousin Day-Day.\n\n<b>                           DEBO\n</b>                 Rancho Cucamonga?\n\n<b>                           EZAL\n</b>                 Yeah.\n\n       Debo thinks about it.\n\n                           EZAL (cont'd)\n                 I can't breathe.\n\n       He rolls off of Ezal.  Relief.\n\n<b>                           DEBO\n</b>                 Get on.\n\n<b>                           EZAL\n</b>                 Man, we can't ride to Rancho Cucamonga on\n                 that.\n\n<b>                           DEBO\n</b>                 Get on!\n\n       Ezal hops on the handlebars quick.  They start to ride off.\n\n<b>                           EZAL\n</b>                 Just don't go over the curb.\n\n       Debo rides over the curb and into the street.  The journey\n       begins.\n\n                           EZAL (cont'd)\n                 Watch my balls!\n\n<b>       INT. DAY-DAY'S ROOM - MORNING\n</b>\n       Day-Day's room is junky.  Clothes are everywhere.  He's\n       putting on his Pinky's Records and Disc T-shirt.  Craig comes\n       in.\n\n<b>                           CRAIG\n</b>                 You straight?\n\n<b>                           DAY-DAY\n</b>                 Yeah, I'm alright.  Is my face still\n                 orange to you?\n\n       Day-Day's face looks sunburned.\n\n<b>                           CRAIG\n</b>                 Just a little.\n\n<b>                           DAY-DAY\n</b>                 I can't taste nothing.\n\n<b>                           CRAIG\n</b>                 What's the matter with your girlfriend?\n\n<b>                           DAY-DAY\n</b>                 Man, it's a long story.  I met D'Wana\n                 three months ago.  She had a little pudge\n                 in her stomach but I didn't pay it no\n                 attention.  Come to find out, she six\n                 months pregnant.  Saying I'm the daddy!\n\n<b>                           CRAIG\n</b>                 What?\n\n<b>                           DAY-DAY\n</b>                 Yeah, I broke up with her two Fridays ago\n                 and she's been harassing me ever since.\n                 She don't care about the restraining\n                 order or nothing.\n\n<b>                           CRAIG\n</b>                 Restraining order?  Where the hell you\n                 meet this girl?\n\n<b>                           DAY-DAY\n</b>                 I went back to Watts to sell my old car\n                 and met her on the way.  Worst day of my\n                 life.\n\n<b>                           CRAIG\n</b>                 Damn, you got a stalker.\n\n<b>                           DAY-DAY\n</b>                 That ain't the worst part.  Her little\n                 sister, Baby D.  She's the one that gets\n                 real physical.  But I got a restraining\n                 order on her, too.\n\n<b>                           CRAIG\n</b>                 You got a restraining order on a little\n                 girl named Baby D?\n\n<b>                           DAY-DAY\n</b>                     (very serious)\n                 You don't know Baby D.\n\n       He looks at his watch.\n\n                           DAY-DAY (cont'd)\n                 I gotta get to Pinky's before I get fired\n                 like you.\n\n       Day-Day exits.  Craig is close behind.\n\n<b>       EXT. UNCLE ELROY'S HOUSE - CONTINUOUS\n</b>\n       As they walk out the front door, someone catches Craig's eye.\n       It's KARLA (23), the Joker brothers' fine sister.  She's\n       leaning against the lowrider, looking into her purse.  She\n       waves at them.\n\n<b>                           KARLA\n</b>                     (friendly)\n                 Hi!\n\n       Craig and Day-Day are mesmerized.\n\n<b>                           BOTH\n</b>                     (waving back)\n<b>                 HEY!\n</b>\n       Craig and Karla's eyes meet.  She smiles.\n\n<b>                           CRAIG\n</b>                 Who is that?\n\n<b>                           DAY-DAY\n</b>                 That's the sister.\n\n<b>                           CRAIG\n</b>                 Yo know what?  I'm starting to like\n                 Rancho Cucamonga.\n\n<b>                           DAY-DAY\n</b>                 I know what 'cha thinking.  I thought the\n                 same thing.  But it can't happen.\n\n<b>                           CRAIG\n</b>                 Why?\n\n<b>                           DAY-DAY\n</b>                 Because, it's been a little tension\n                 between us ever since they got out the\n                 joint and ran their momma crazy.  And I'm\n                 just trying to keep the peace.  We moved\n                 out here to get away from that shit.\n\n       Day-Day walks over to his Beamer.  Craig follows.\n\n<b>       CLOSE-UP\n</b>\n       Big scratch on the side of Day-Day's car.\n\n<b>       WIDER\n</b>\n                           DAY-DAY (cont'd)\n                 It ain't that bad, is it?\n\n       Craig is still looking at Karla.\n\n                           DAY-DAY (cont'd)\n                 Craig!  It ain't that bad, is it?\n\n<b>                           CRAIG\n</b>                 Yeah, it's bad.  And that scratch make it\n                 ugly.\n\n       Day-Day is starting to get mad.\n\n                           CRAIG (cont'd)\n                 It's long and crooked...make you not\n                 wanna even drive it.\n\n<b>                           DAY-DAY\n</b>                 Alright, alright... I see what you\n                 talking about.\n\n       Karla looks at her watch and starts to walk up the street.\n       This is Craig's chance.\n\n<b>                           CRAIG\n</b>                 Hold up, Day-Day.\n\n       He trots after her.\n\n<b>                           DAY-DAY\n</b>                 Let it go.\n\n       Karla is still walking.\n\n<b>                           CRAIG\n</b>                 Hey!  Hey!\n\n       She stops and waits for him.\n\n                           CRAIG (cont'd)\n                 I'm Day-Day's cousin, Craig.  What's your\n                 name?\n\n<b>                           KARLA\n</b>                 Karla.\n\n<b>                           CRAIG\n</b>                 Craig and Karla, damn that sound pretty\n                 good together.  Where you going?\n\n<b>                           KARLA\n</b>                 To the Cucamonga shopping center.\n\n<b>                           CRAIG\n</b>                 Oh yeah, why you walking?\n\n<b>                           KARLA\n</b>                 My brothers won't give me a ride.\n\n       Day-Day is about to have a heart attack.  He's looking back\n       and forth between Craig and Karla, and the Joker's house\n       where somebody is looking out the window.\n\n<b>                           DAY-DAY\n</b>                     (to himself)\n                 Just get the number and come on.  Just\n                 get the number and come on.\n\n       Back at the \"Love Connection,\" Craig has Karla smiling.\n\n<b>                           CRAIG\n</b>                 You want us to give you a ride?\n\n<b>                           KARLA\n</b>                 I don't know.\n\n<b>                           CRAIG\n</b>                 What you mean, you don't know?  Just wait\n                 here.\n\n       Craig starts to trot over towards Day-Day.  Day-Day is\n       frantically waving Craig to hurry.\n\n                           CRAIG (cont'd)\n                 What are you worried about?\n\n       Day-Day's eyes get as big as golf balls.\n\n<b>                           DAY-DAY\n</b>                 Cheeco!\n\n       Craig turns to see the pit bull \"Cheeco\" running right after\n       him.\n\n<b>                           KARLA\n</b>                 Cheeco, no!\n\n       Craig runs right towards Day-Day's BMW.\n\n<b>                           DAY-DAY\n</b>                 Oh shit, jump!\n\n       They both jump on top of Day-Day's BMW with CHEECO coming up\n       fast.  He's BARKING viciously.\n\n<b>       ACROSS STREET\n</b>\n       Joker, Li'l Joker and Baby Joker are across the street\n       laughing.  Karla is embarrassed.\n\n<b>       ON BMW\n</b>\n       Craig is breathing hard but he's calm, but Day-Day is\n       terrified.\n\n                           DAY-DAY (cont'd)\n                 Hey, Joker!  Stop playing, man!  Call the\n                 dog back!\n\n       They continue to laugh.  Craig pulls his belt off.  He swings\n       it and hits Cheeco in the middle of his forehead with the\n       buckle.  The DOG CRIES and runs back across the street.\n\n       The Jokers aren't laughing anymore.  Joker stares at Craig.\n       Craig stares back.  You can feel the tension.  Joker kicks\n       the dog.\n\n<b>                           JOKER\n</b>                 Get yo dumb ass in the back.\n\n       CHEECO HOLLERS.  Craig and Day-Day get off the top of the\n<b>       BMW.\n</b>\n<b>                           DAY-DAY\n</b>                 Look at my roof.\n\n       Big dents in the roof of his BMW.\n\n                           DAY-DAY (cont'd)\n                 Man, why you do that?  I told you not to\n                 talk to that girl.\n\n<b>                           CRAIG\n</b>                 Why not?  She was cool with it.\n\n       Day-Day gets into the car.\n\n<b>                           DAY-DAY\n</b>                 So.\n\n<b>                           CRAIG\n</b>                 What you mean, so?\n\n<b>                           DAY-DAY\n</b>                 If you 'get into it' with them S.A.'s and\n                 start a feud, you can always go back to\n                 home.  I gotta live here.  Just remember\n                 that.\n\n       He slams the door, starts the car and backs up.  Leaving\n       Craig standing there.  He sees Karla walking away.  He looks\n       over at the Jokers.  They're still staring hard.  Craig just\n       looks away and walks into the house.\n\n<b>       INT. UNCLE ELROY'S HOUSE - CONTINUOUS\n</b>\n       Craig steps into the house.\n\n<b>                           UNCLE ELROY\n</b>                 Nephew, you got perfect timing...\n\n       Uncle Elroy is sitting on the couch.  He has a Phillies'\n       Blunt (cigar) in one hand, a razor blade in the other.\n\n                           UNCLE ELROY (cont'd)\n                 We about to start a little puff, puff\n                 give in this mothafucka.  Are you down?\n\n       Suga is sippin' on a glass of wine.  She moves over, making\n       room in the middle.\n\n<b>                           SUGA\n</b>                     (patting the couch)\n                 Come on, Craig.  Sit down right here.\n\n       Craig does.  Suga moves closer, boxing him in nice and tight.\n       Uncle Elroy licks the cigar.\n\n<b>                           UNCLE ELROY\n</b>                 I know you smoke weed, right?\n\n<b>                           CRAIG\n</b>                 Why you say that?\n\n<b>                           UNCLE ELROY\n</b>                 'Cause your lips is getting black.\n\n       Uncle Elroy takes the razor and starts to cut the cigar the\n       long way.\n\n                           UNCLE ELROY (cont'd)\n                 All I smoke is blunts.  Them fuckin'\n                 Zigzags don't do nothing for me.\n\n       Uncle Elroy scrapes the cigar shavings into a nearby trash\n       can (that's overflowing with cigar shavings already).  Suga\n       presses against Craig.\n\n<b>                           SUGA\n</b>                 Would you like a glass of wine, baby?\n\n<b>                           CRAIG\n</b>                 No thank you. It's too early.\n\n       Uncle Elroy stuffs the open cigar full of weed.  He's\n       concentrating.\n\n<b>                           UNCLE ELROY\n</b>                 Boy, I can roll a blunt better than them\n                 bitches in Havana.  I know Willie don't\n                 let'cha smoke in the house, but I'm ya\n                 uncle.  I don't care how high you get in\n                 my house.  Long as you let me hit it...\n\n       He licks and rolls.\n\n                           UNCLE ELROY (cont'd)\n                 Look at that.\n\n       It's perfect.\n\n<b>                           SUGA\n</b>                 Fire it up, Roy.\n\n       Uncle Elroy grabs the lighter.\n\n<b>                           UNCLE ELROY\n</b>                 Now I'mma show you the real \"Puff Daddy.\"\n\n       He lights the blunt.  Craig's watching, so is Suga.  Uncle\n       Elroy holds the smoke in for a very long time.  Maybe too\n       long...'cause his eyes start to bulge, and he starts to toke\n       (cough with your mouth closed).  And toke.  And toke.  And\n       toke.  It looks like he's about to bust when he lets out a\n       big puff of smoke.  Then he starts to cough, and cough, and\n       cough out of control.\n\n       Craig and Suga are amazed at this display.  Uncle Elroy falls\n       to the floor on his hands and knees.  Still coughing.  He\n       falls on his back and passes the blunt to Craig.\n\n                           UNCLE ELROY (cont'd)\n                     (still coughing)\n                 It's the Bombay.\n\n       Craig takes the blunt and puts it up to his lips.  He hits\n       it, holds it in and looks at Suga.  Suddenly, his eyes bulge\n       out and he starts to toke, and toke, and toke, and toke.  He\n       starts to cough out of control and he falls next to Uncle\n       Elroy who's still coughing.  Craig passes the blunt to Suga,\n       who looks at it for a moment and then looks directly INTO the\n       CAMERA.  (As if to say, \"Shiiiiiiiiiiiit.\").\n\n<b>       INT. UNCLE ELROY'S HOUSE - 15 MINUTES LATER\n</b>\n       All three are passed out on the couch.  Uncle Elroy is\n       snoring with a little slobber hanging.  Craig's knocked out\n       with his mouth open.  Suga's head is not secure and she's\n       starting to bob.  She bobs so hard that her head falls in\n       Craig's lap.  He wakes up and looks down.\n\n<b>                           CRAIG\n</b>                 Suga.\n\n       He looks over at Uncle Elroy who's looking over at him.\n\n<b>                           UNCLE ELROY\n</b>                 Negro, what the hell you doing to my\n                 woman?\n\n<b>                           CRAIG\n</b>                     (confused and dazed)\n                 I don't know!\n\n<b>                           UNCLE ELROY\n</b>                 Suga!\n\n<b>                           SUGA\n</b>                     (face in lap)\n                 Huh?\n\n<b>                           UNCLE ELROY\n</b>                 What you doing to my nephew?\n\n<b>                           SUGA\n</b>                     (lifting her head)\n                 Ah, baby...I thought this was you.\n                     (to Craig)\n                 Craig, what are you doing to me?\n\n<b>                           CRAIG\n</b>                 I don't know, I think I passed out or\n                 something.  I don't remember.\n\n<b>                           UNCLE ELROY\n</b>                 Passed out?  Can't hang, huh?  Boy, I\n                 knew you was a lightweight.  Passed out\n                 on one funky ass blunt.  They don't make\n                 'em like they used to, baby.\n\n       Uncle Elroy staggers to his feet.\n\n                           UNCLE ELROY (cont'd)\n                 Come on, woman.  I'm faded and feeling X-\n                 rated.  It's Mr. Nasty time.\n\n<b>                           SUGA\n</b>                 Mr. Nasty time?\n\n<b>                           UNCLE ELROY\n</b>                 Mr. Nasty time.\n                     (grabbing his back)\n                 But take it easy on me, girl.\n\n<b>                           SUGA\n</b>                 Craig, you ain't the only lightweight\n                 around here.\n\n       Suga takes Elroy's hand.\n\n<b>                           UNCLE ELROY\n</b>                 Make yourself at home.\n\n       They both stumble upstairs leaving Craig all alone.  It's too\n       quiet now.  He grabs the remote and TURNS ON the TV.  Flicks\n       a few channels.  He picks up the blunt and the lighter.\n\n<b>       ON TV\n</b>\n       A public service announcement from King/Drew Rehab Center.\n       It's SMOKEY!\n\n<b>                           SMOKEY (V.O.)\n</b>                 Hi, my name is Smokey.  And I'm a bud-\n                 head.  But here at the King/Drew Rehab\n                 Center, they help you curve your crave\n                 for marijuana but still let you get your\n                 drank on.\n\n       He lifts a 22 oz. bottle of Olde English.\n\n                           SMOKEY (cont'd) (V.O.)\n                 It's too hard to stop everything all at\n                 once.  So some days they let you smoke,\n                 but not drank.  And other days you can\n                 drank, but not smoke.  And if you're\n                 really making progress, the nurses will\n                 get fucked up wit you.  Helping you kick\n                 the habit by smoking up all yo shit.  So\n                 come down to the King/Drew Rehab Center\n                 and put down the joint, but B.Y.O.B.,\n                 man!\n\n<b>       BACK ON COUCH\n</b>\n       Craig is high.  He's looking at the TV with a slight smile on\n       his face.  It seems like the walls are shaking.  He looks\n       over at Suga's glass and her wine is vibrating, like Jurassic\n       Park.  Plaster falls from the ceiling.  He listens, it's\n       Uncle Elroy and Suga making love.\n\n<b>                           UNCLE ELROY (O.S.)\n</b>                 Oh, baby, right there.  Right\n                 there...bite the nipple, baby.  Bite it!\n                 Bite it!  Yeah, mothafucka -- yeah, come\n                 on, baby, get busy...\n\n       His eavesdropping is interrupted by a loud KNOCK on the door.\n       Craig is so comfortable, he doesn't want to move.  The\n       KNOCKING gets LOUDER.\n\n<b>                           DELIVERY GUY (O.S.)\n</b>                 Delivery!\n\n<b>                           CRAIG\n</b>                 Hold on.\n\n       Craig gets up slowly and starts to clean the area.  The\n<b>       KNOCKING CONTINUES.\n</b>\n<b>                           DELIVERY GUY (O.S.)\n</b>                 Delivery!\n\n<b>                           CRAIG\n</b>                 I said hold on!\n\n<b>                           DELIVERY GUY (O.S.)\n</b>                 Could you hurry up, please... it's kinda\n                 hot out here.\n\n       Craig stops what he's doing and swings the door open.\n\n<b>       ON PORCH\n</b>\n       The DELIVERY GUY, a thirtysomething asshole with tight shorts\n       and a buzz cut, is looking into the house.\n\n<b>                           CRAIG\n</b>                 Can I help you?\n\n<b>                           DELIVERY GUY\n</b>                 Nice house. Didn't expect you to answer.\n                 You must be one of those entertainers.\n                 What team you play for?\n\n<b>                           CRAIG\n</b>                 I don't play for no team.\n\n<b>                           DELIVERY GUY\n</b>                 Come on, jerky, you can tell me.  Got a\n                 white wife, huh?  Blonde bombshell type.\n                 Remember what happen to O.J... what team\n                 do you play for?  You're not related to\n                 the Jacksons, are you?\n\n<b>                           CRAIG\n</b>                     (in his face)\n                 Naw, I play for the Chocamunga Cracker\n                 Killers.  You want tickets?\n\n<b>                           DELIVERY GUY\n</b>                 Okay, buddy.  Don't send your entourage\n                 out here to do a 187 on me.  It's just a\n                 certified mail delivery.\n\n       He hands Craig a letter.\n\n                           DELIVERY GUY (cont'd)\n                 Sign here.\n\n       Craig signs.\n\n<b>                           CRAIG\n</b>                 What is it?\n\n<b>                           DELIVERY GUY\n</b>                 Delinquent Property Tax Notice... I hope\n                 the Cracker Killers pay well 'cause if\n                 not, back to the ghetto you go.  Wife\n                 stays here, of course.\n\n       He laughs and walks off singing the \"Good Times\" jingle.\n\n                           DELIVERY GUY (cont'd)\n                 '...temporary layoffs?  Good\n                 Times...hustling and surviving... Good\n                 Times...ain't we lucky we got'em...' Oh\n                 shit!\n\n       Cheeco starts to chase him down the street.  Craig looks at\n       the notice.  \"DELINQUENT! YOUR HOUSE WILL BE SEIZED AND\n<b>       AUCTIONED -- TOMORROW AT 9AM  PAY TODAY!\"\n</b>\n<b>                           CRAIG\n</b>                 Oh damn.\n\n       He SLAMS the DOOR.  We FOLLOW Craig upstairs TO Uncle Elroy's\n       room.  He knocks softly.\n\n                           CRAIG (cont'd)\n                 Uncle Elroy?\n\n       No answer.\n\n                           CRAIG (cont'd)\n                 Uncle Elroy, you got a tax notice.\n\n       Still no answer.  He turns the knob.  It's open.\n\n<b>       INT. UNCLE ELROY'S BEDROOM - CONTINUOUS\n</b>\n       Craig steps into Uncle Elroy's freak palace.  Black lights,\n       candles, velvet posters - the works.  There's even a leather\n       fuck swing hanging from the ceiling.  Uncle Elroy and Suga\n       are asleep in a leopard-skin waterbed.  Craig is amazed.  He\n       slowly walks over to the bed.  Uncle Elroy is calling the\n       hogs.  Snoring.\n\n<b>                           CRAIG\n</b>                     (whispering)\n                 Uncle Elroy...Uncle Elroy?\n\n       He's about to shake him when Uncle Elroy lets out a big\n       grunt.  It startles Craig.  He looks over at Suga.  She's\n       completely under the covers.  Uncle Elroy rolls over on his\n       stomach, then he rolls on his back again.  Craig shakes him.\n\n                           CRAIG (cont'd)\n                 Uncle Elroy, wake up.  You got a letter\n                 today.\n\n       No response.  Craig tries again.\n\n                           CRAIG (cont'd)\n                 Unc.\n\n       Uncle Elroy jumps up like a hibernating grizzly.\n\n<b>                           UNCLE ELROY\n</b>                     (half asleep)\n                 Come on here, Suga...\n\n       He goes after Craig, who has to fight him off.\n\n                           UNCLE ELROY (cont'd)\n                 I like it rough now.\n\n<b>                           CRAIG\n</b>                 Naw, naw!  Unc, wake up!  It's me!  Wake\n                 up!\n\n       Uncle Elroy grabs him in a bear hug and slams him on the bed.\n\n       Craig finds himself caught between Suga and Uncle Elroy, but\n       now everything is totally still and quiet.  Uncle Elroy\n       starts to snore again.  He's asleep.  The coast is clear now.\n       Craig tries to make his escape.  He crawls over Suga to get\n       away.  She grabs him and starts to kiss him.\n\n<b>                           SUGA\n</b>                     (half asleep)\n                 Ohhh, baby!\n\n       Craig breaks away and tries to hurry out the room.  On his\n       exit, he hangs himself on the \"fuck swing\" and hits the floor\n       with a thud.  He scrambles to his feet, then he's out of\n       there.  Uncle Elroy and Suga lay asleep as if nothing ever\n       happened.\n\n<b>       IN HALLWAY\n</b>\n       Craig tries to gain his composure.  He gets an idea.\n\n<b>       EXT. BUSY CITY STREET - AFTERNOON\n</b>\n       Debo is riding Ezal on the handlebars.\n\n<b>                           EZAL\n</b>                 We gotta stop or something, man.  My ass\n                 is hurting.  This handlebar is hard.\n\n       Debo keeps riding.\n\n                           EZAL (cont'd)\n                 Debo!  Debo!  Now you stuck on stupid.\n\n       He finally stops at a pay phone.  Ezal jumps off and grabs\n       his ass.\n\n                           EZAL (cont'd)\n                 My God...gotta walk it out, walk it out.\n                 Man, it's gonna take us a week to ride\n                 out there.\n\n<b>                           DEBO\n</b>                 Shut up!  He still eats here every day!\n\n<b>       EXT. SANDWICH JOINT - ACROSS STREET - CONTINUOUS\n</b>\n       Mr. Jones' dog truck sits in front.\n\n<b>                           DEBO\n</b>                 Here's the plan.  You gonna call over\n                 there and say you have a very urgent\n                 message for Mr. William Jones.\n\n<b>                           EZAL\n</b>                 What urgent message?\n\n<b>                           DEBO\n</b>                 If you shut up I'll tell you.  The urgent\n                 message is...Drop everything!  Craig is\n                 in trouble.  Come quick, don't call.\n\n<b>                           EZAL\n</b>                 That ain't gonna work.\n\n       Debo slaps him in the back of the head.\n\n<b>                           DEBO\n</b>                 Just do it.\n\n<b>                           EZAL\n</b>                 I don't know the number.\n\n       Smack!  Debo slaps him again.\n\n<b>                           DEBO\n</b>                 It's on the outside of the building, now\n                 pick the phone up!\n\n       Ezal picks up the phone.  He starts to dial.\n\n<b>                           EZAL\n</b>                 Hello...Yeah, I got an urgent message for\n                 a nigga named Mr. Willie Jones.\n\n       Debo slaps him again.\n\n<b>                           DEBO\n</b>                 William.\n\n<b>                           EZAL\n</b>                 Yeah, I got a urgent message for a\n                 customer named William Jones.  Drop\n                 everything, Craig is in trouble.  Come\n                 quick.  Don't try to call.\n\n       Ezal hangs up the phone.\n\n                           EZAL (cont'd)\n                 Man, you better stop hittin' on me for I\n                 do you like Craig did you.\n\n<b>                           DEBO\n</b>                 Let's go.\n\n       Debo and Ezal run across the street to the dog truck.  Debo\n       opens the back and lets all the dogs out.  They run for it.\n\n                           DEBO (cont'd)\n                 After I get in, close the door.\n\n       Debo is a hard fit.  Ezal stuffs him in there.\n\n<b>                           EZAL\n</b>                 You too big.\n\n<b>                           DEBO\n</b>                 Keep pushing.\n\n       Finally he's in.  Ezal gets in and slams the door shut.  Just\n       then, Mr. Jones comes running out the joint with a sandwich\n       in hand.\n\n<b>                           MR. JONES\n</b>                 Oh my God!\n\n       He gets in and speeds off.\n\n<b>       EXT. CUCAMONGA SHOPPING CENTER - AFTERNOON\n</b>\n       Cars pull in and out of this 12 store strip mall where\n       Pinky's is located.\n\n<b>       INT. PINKY'S RECORDS AND DISC - AFTERNOON\n</b>\n       Everything is pink inside this mom and pop record store.  The\n       latest RAP HIT PLAYS in the B.G.  A few people exit the store\n       with bags.\n\n       Day-Day is scanning inventory.  A bud-head by the name of\n       ROACH is on top of the counter with his skateboard.\n\n<b>                           ROACH\n</b>                 Yo, Day-Day!  Check me out.\n\n       He tries to jump off the counter and land perfectly on his\n       board.  Wrong!  Off the board and on his ass.\n\n<b>                           DAY-DAY\n</b>                 Look, Roach, I know you ain't never\n                 worked in a record shop before and you're\n                 a little excited.  But if Pinky catches\n                 you doing that X-Games shit off his\n                 counter top, we both getting fired.  You\n                 feel me?\n\n<b>                           ROACH\n</b>                 I feel you.  I've just been practicing\n                 that one move all week.\n                     (disappointed)\n                 I thought that was it.\n\n       An unhappy CUSTOMER walks in holding a CD without the cover.\n\n<b>                           CUSTOMER #1\n</b>                 I can't get jiggy with this shit.\n                     (getting loud)\n                 Where is the damn manager?\n\n<b>                           DAY-DAY\n</b>                 Sir, the manager stepped out for a\n                 moment.  I'm currently running the store.\n                 Can I see the CD?\n\n       The customer throws the CD on the counter.  Day-Day picks it\n       up.\n\n<b>                           CUSTOMER #1\n</b>                 No, give me my damn money back.  Right\n                 now, and I don't have no damn receipt\n                 neither.\n\n<b>                           DAY-DAY\n</b>                 Okay, sir...but where's the cover?\n\n<b>                           CUSTOMER #1\n</b>                 I don't have no damn cover.\n\n       Craig walks in with the notice in hand.\n\n<b>                           DAY-DAY\n</b>                 I can't give you your damn money back on\n                 this.\n\n<b>                           CUSTOMER #1\n</b>                 Bullshit!  I'll go postal in this\n                 mothafucka!\n\n<b>                           DAY-DAY\n</b>                 Well, you gonna have to go postal then.\n\n       The customer KNOCKS over a counter display and then turns to\n       get away.\n\n                           DAY-DAY (cont'd)\n                 Hey!\n\n       Craig bumps him and he falls into the Rap cassette rack.\n\n<b>                           CUSTOMER #1\n</b>                 I'm sorry!  Don't hit me!  Don't hit me.\n\n       He jumps up and slips on a few more cassettes on his scramble\n       out the door.\n\n<b>                           DAY-DAY\n</b>                 ...and if you come back, it's gonna be\n                 worse.\n\n       Roach can't believe what just happened.\n\n<b>                           ROACH\n</b>                 Did you see that?  That was a W.W.F. hit\n                 right there, huh, Day-Day?\n\n<b>                           DAY-DAY\n</b>                 Yeah, it was.  How you get up here?\n\n<b>                           CRAIG\n</b>                 I walked.\n\n<b>                           DAY-DAY\n</b>                 You walked?\n\n<b>                           CRAIG\n</b>                 Yeah, ya'll got a notice today.  It came\n                 certified mail.\n\n       He gives it to Day-Day.\n\n<b>                           DAY-DAY\n</b>                 Craig, this Roach.  Roach, this is my\n                 cousin, Craig.\n\n<b>                           ROACH\n</b>                 What up, bro?\n\n       Craig nods his head.\n\n<b>                           CRAIG\n</b>                 I tried to wake up Uncle Elroy but he\n                 thought I was Suga.\n\n       Day-Day reads the notice.\n\n<b>                           DAY-DAY\n</b>                 You know what this is?\n\n<b>                           CRAIG\n</b>                 Yeah, that's why I walked down here.\n\n<b>                           ROACH\n</b>                 What it say?\n\n       Day-Day ignores Roach.\n\n<b>                           DAY-DAY\n</b>                 How can they do this?\n\n<b>                           CRAIG\n</b>                 I don't know.  Did ya'll forget to pay it\n                 or something?\n\n<b>                           ROACH\n</b>                 What it say?\n\n<b>                           DAY-DAY\n</b>                 Ever since my momma died the bills are\n                 always late.\n\n<b>                           CRAIG\n</b>                 See how much it is?\n\n       Day-Day opens it.  A PHONE starts to RING.\n\n<b>                           ROACH\n</b>                 What is it?\n\n<b>                           DAY-DAY\n</b>                 Don't worry about it, man.  Get the\n                 phone.\n\n       Roach skateboards over to the phone.\n\n<b>                           ROACH\n</b>                 Pinky's.\n\n       Day-Day reads on.\n\n<b>                           DAY-DAY\n</b>                 It says we owe $3,900...by tomorrow.\n\n<b>                           CRAIG\n</b>                 Damn...how much money ya'll got left from\n                 the lottery?\n\n       Day-Day goes for his bank book.  He flips a few pages.\n\n<b>                           DAY-DAY\n</b><b>                 $247.\n</b>\n<b>                           CRAIG\n</b>                 Okay, plan B.\n\n       Day-Day is overwhelmed.  Roach skates back over.\n\n<b>                           ROACH\n</b>                 That was a girl on a cell phone.  She\n                 said she's outside in the parking lot\n                 waiting for you to take her to lunch.\n\n       Day-Day looks at Craig.  He runs over to the door.\n\n<b>       OUTSIDE IN THE PARKING LOT\n</b>\n       D'Wana sits in her car with her play sister BABY'D (her name\n       does not fit her body).\n\n<b>                           DAY-DAY\n</b>                 Oh my God.  That's D'Wana.  And she got\n                 Baby'D with her.\n\n       Day-Day locks the door and runs into the back.  Craig and\n       Roach follow.\n\n<b>                           CRAIG\n</b>                 What's the matter?\n\n<b>                           DAY-DAY\n</b>                 D'Wana brought Baby'D up here.\n\n<b>                           ROACH\n</b>                 That the big one, huh?\n\n<b>                           DAY-DAY\n</b>                 You damn right that's the big one.\n\n       The PHONE starts to RING again.  D'Wana and Baby'D are at the\n       door.  D'Wana is on her phone.  Baby'D starts to knock.\n\n                           DAY-DAY (cont'd)\n                 Craig, go out there and tell 'em I'm\n                 gone.\n\n<b>                           CRAIG\n</b>                 I ain't trying to get in it.\n\n<b>                           DAY-DAY\n</b>                 You already in.\n\n       The knocking gets louder.\n\n<b>                           CRAIG\n</b>                 No I'm not.\n\n<b>                           ROACH\n</b>                 I'll do it.\n\n<b>                           DAY-DAY\n</b>                 No.  You can't handle a girl like D'Wana.\n                 It's got to be Craig.\n\n<b>       AT FRONT DOOR\n</b>\n       They observe the \"Yes We're Open\" sign.\n\n<b>                           D'WANA\n</b>                 That white boy said he was in there.\n\n<b>                           BABY'D\n</b>                 Day-Day, don't make me break this window!\n\n       Craig is peeking out.  He hesitates.\n\n<b>                           DAY-DAY\n</b>                 Watch out for Baby'D.\n\n       Craig walks out the back.  He steps over the door.  Unlocks\n       it, and cracks it open.\n\n<b>                           CRAIG\n</b>                 Day-Day ain't here.\n\n       They don't believe him.\n\n<b>                           D'WANA\n</b>                 Who are you?\n\n<b>                           CRAIG\n</b>                 I'm his cousin.\n\n<b>                           BABY'D\n</b>                 You suppose to work here now or\n                 something?\n\n<b>                           CRAIG\n</b>                 Yeah, I work here now.\n\n<b>                           D'WANA\n</b>                 We didn't come here for Day-Day.\n\n<b>                           CRAIG\n</b>                 Yes you did.\n\n<b>                           D'WANA\n</b>                 No we didn't.  We came to buy a CD.\n\n<b>                           BABY'D\n</b>                 Now move.\n\n       Baby'D kicks the door.  Craig has no choice but to let 'em\n       in.\n\n<b>                           D'WANA\n</b>                 Where's that boy that told me Day-Day was\n                 here?\n\n<b>                           CRAIG\n</b>                 I don't know... I think he went out the\n                 back.\n\n<b>                           D'WANA\n</b>                 Can I look for myself?\n\n       Suddenly Roach is pushed into the front area.\n\n<b>                           ROACH\n</b>                 Hey, ladies.\n\n<b>                           D'WANA\n</b>                 Where's Day-Day?\n\n<b>                           ROACH\n</b>                 I don't know, he must've left.\n\n       D'Wana looks at Baby'D.\n\n<b>                           CRAIG\n</b>                 I thought ya'll wanted to buy a CD?\n\n<b>                           BABY'D\n</b>                 I do... can you help me find the jazz\n                 section?\n\n       Craig looks at Roach for directions.  He nods over towards\n       the front of the store.\n\n<b>                           CRAIG\n</b>                 Right this way.  You know damn well you\n                 don't listen to no jazz.\n\n       Baby'D checks out Craig as he leads the way.  D'Wana looks\n       around.\n\n<b>                           D'WANA\n</b>                 If Day-Day comes back, tell him I came by\n                 and need to see him.  Lamaze classes are\n                 Wednesday.\n\n<b>                           ROACH\n</b>                 Will do.\n\n       D'Wana starts to walk towards Craig and Baby'D.\n\n<b>                           D'WANA\n</b>                 Come on, 'D, let's go.\n\n       But first she doubles back towards the storage room.\n\n<b>                           CRAIG\n</b>                 Where you going?\n\n<b>                           D'WANA\n</b>                 Ain't the rest room this way?  I gotta\n                 pee.\n\n<b>                           ROACH\n</b>                 Yeah.\n\n<b>                           D'WANA\n</b>                 Thank you.\n\n       As she's walking in the back, Roach realizes his mistake.\n\n<b>       BACK STORAGE AREA\n</b>\n<b>                           DAY-DAY\n</b>                 Shit.\n\n       Day-Day makes a run for it.  She spots him ducking out the\n       back door.\n\n<b>                           D'WANA\n</b>                 He's in there!\n\n<b>       INSIDE STORE\n</b>\n       Baby'D knocks Craig out of the way.\n\n<b>                           BABY'D\n</b>                 Where is he?\n\n<b>                           D'WANA\n</b>                 He ran out the door.\n\n       Baby'D gives chase with D'Wana, Craig and Roach close behind.\n\n<b>       EXT. PINKY'S RECORDS AND DISC - CONTINUOUS\n</b>\n       Day-Day runs around the side of Pinky's Records store.  He\n       stops to see if anyone is coming.  It's Baby'D with the three\n       others trailing.  Baby'D is chasing Day-Day all through the\n       parking lot.  Craig, D'Wana and Roach stop to watch.\n\n<b>                           ROACH\n</b>                 Haul ass, dude.  Don't stop.\n\n       ...and he is.\n\n<b>                           CRAIG\n</b>                 You better stop running from that girl.\n\n<b>                           DAY-DAY\n</b>                 Fuuuuuuck -- U!\n\n       He runs back towards his BMW.  The chase continues around his\n       car.  Baby'D is starting to tire.\n\n                           DAY-DAY (cont'd)\n                 I'mma shoot yo' big ass.\n\n       D'Wana watches from a distance.  Craig and Roach are close.\n\n<b>                           ROACH\n</b>                     (smiling)\n                 She moves well for a big girl.\n\n       Just then, out of nowhere, Karla appears behind them carrying\n       a couple of bags.  She taps Craig on his shoulder.  He turns\n       around.\n\n<b>                           KARLA\n</b>                 Hello, remember me?\n\n<b>                           CRAIG\n</b>                 Hell yeah, I remember you.\n\n<b>                           KARLA\n</b>                 I'm sorry for what my brother did this\n                 morning.  They're assholes.\n\n<b>                           CRAIG\n</b>                 It's cool.  You ain't got to apologize\n                 for your brothers.  They're big boys.\n\n<b>                           KARLA\n</b>                 I just wanted to give you this.\n\n       She hands him a card with her number on it.\n\n                           KARLA (cont'd)\n                 If my brothers wasn't so over-protective,\n                 I'd have you call the house.  But for now\n                 just page me when you get a chance.\n\n<b>                           CRAIG\n</b>                 Most definitely.\n\n<b>                           KARLA\n</b>                 Better sooner than later.\n\n       She picks up her shopping bags and walks away.  Over at the\n       chase: Baby'D is winded.  She bends over trying to catch her\n       breath.\n\n<b>                           DAY-DAY\n</b>                 Baby'D, you're not going to catch me as\n                 usual.  So what can we do to end it this\n                 time?  What you want?  Another Big Pun\n                 CD?  'Cause I gotta get back to work.\n\n       Baby'D looks over at Craig.\n\n<b>                           BABY'D\n</b>                 Okay, I know what I want this time.\n\n<b>                           DAY-DAY\n</b>                 Anything you need.\n\n<b>                           BABY'D\n</b>                 Yo' cousin, Craig.  Hook us up.\n\n<b>                           DAY-DAY\n</b>                 That's it?\n\n<b>                           BABY'D\n</b>                 Just tell him to come over here and talk\n                 to me.\n\n<b>                           DAY-DAY\n</b>                 And I can go free?\n\n<b>                           BABY'D\n</b>                 Go, fo' I change my mind.\n\n       Day-Day carefully walks back over towards the store.  D'Wana\n       pouts and walks towards Baby'D.  (If looks could kill.)\n\n<b>                           ROACH\n</b>                 Great moves, Day-Day.\n\n<b>                           CRAIG\n</b>                 What happen?\n\n<b>                           DAY-DAY\n</b>                 We worked out a deal.  All you gotta do\n                 is go over there and talk to Baby'D.\n\n       Craig looks over at Baby'D.  She's waiting.\n\n<b>                           CRAIG\n</b>                 What you mean talk to her?\n\n<b>                           ROACH\n</b>                     (still smiling)\n                 You know what he mean, dude.\n\n<b>                           CRAIG\n</b>                 I'm gone.\n\n       Craig turns and sprints into the store.  Baby'D looks\n       concerned.  Day-Day grabs Roach and they run into the store.\n\n<b>                           BABY'D\n</b>                 I'mma get you, Day-Day!  You gotta come\n                 out sometimes!\n\n       D'Wana hands her a brick.\n\n<b>                           D'WANA\n</b>                 I told you.\n\n       Baby'D screams and throws the brick through Day-Day's\n<b>       WINDSHIELD.\n</b>\n<b>       INT. PINKY'S RECORDS AND DISC - CONTINUOUS\n</b>\n<b>                           DAY-DAY\n</b>                 What was that?\n\n<b>                           ROACH\n</b>                     (looking out window)\n                 You don't wanna know.\n\n       Day-Day is devastated.\n\n<b>                           DAY-DAY\n</b>                 Thanks a lot, Craig.\n\n<b>                           CRAIG\n</b>                 I know we cousins and all, but don't try\n                 an' hook me up with the big little\n                 sisters.\n\n<b>                           DAY-DAY\n</b>                 Big bitches need love, too, Craig.\n\n<b>                           ROACH\n</b>                 For sure.  That's how I like 'em.\n\n<b>                           CRAIG\n</b>                 Not me.\n\n<b>                           DAY-DAY\n</b>                 Are they still out there?\n\n<b>                           ROACH\n</b>                 Negative...they vamped.\n\n       Day-Day starts to walk into the back storage area.\n\n                           ROACH (cont'd)\n                 Shouldn't we straighten up out here\n                 before Pinky gets back?\n\n       Day-Day is like a zombie now.  He doesn't answer, just keeps\n       walking.\n\n<b>                           CRAIG\n</b>                 Day-Day?\n\n       No answer.  Craig looks at Roach.  They follow.\n\n<b>       BACK STORAGE AREA\n</b>\n       Day-Day sits with the notice in hand.\n\n<b>                           DAY-DAY\n</b>                 Today ain't my day.\n\n<b>                           ROACH\n</b>                 Bummer, huh?  And Friday is suppose to be\n                 a kick-ass day.\n\n<b>                           CRAIG\n</b>                 Yeah it is...the best day before the\n                 weekend.\n\n<b>                           ROACH\n</b>                 That's fuckin' poetic, Craig.\n\n       Day-Day is still sad.\n\n                           ROACH (cont'd)\n                 I know how you feeling.  And if I had my\n                 bong right now, I'd let you 'toke 'til\n                 you choke.'  Dude, right here.  All out.\n                 No lungs.  All I got is this.\n\n       Roach pulls out a big, smashed brownie with green shit in it.\n\n<b>                           CRAIG\n</b>                 What's the green stuff poking out?\n\n<b>                           ROACH\n</b>                 That's cron-don, sir.  My mom hates for\n                 me to smoke, so she made me bud-brownies.\n                 Wanna bite?\n\n<b>                           CRAIG\n</b>                 Naw, I already ate.\n\n<b>                           ROACH\n</b>                 Come on, Day, try it.  For moms.\n\n       Day-Day shakes his head.  Craig reaches into his fifth\n       pocket.\n\n<b>                           CRAIG\n</b>                 It ain't a bong but, wa-la!\n\n       He has the joint from this morning.\n\n<b>                           ROACH\n</b>                 Wo!\n\n       Roach snatches it.\n\n<b>                           CRAIG\n</b>                 Hey.\n\n       Craig snatches it back.\n\n<b>                           ROACH\n</b>                 Sorry, bro, reflexes.  How did you do\n                 that?\n\n<b>                           CRAIG\n</b>                 Black magic.\n\n       Day-Day snatches the joint and puts it in his mouth.\n\n<b>                           DAY-DAY\n</b>                 Give me dat.  I'm the one with the\n                 problem.\n\n       Roach pulls out a mini-skateboard that's actually a lighter.\n\n<b>                           ROACH\n</b>                 Weed doesn't solve problems.  It eases\n                 the mind, and the soul.  Enjoy.\n\n       He lights the joint.  Day-Day takes a hit.\n\n<b>                           CRAIG\n</b>                 I didn't think you smoked bud that much.\n\n<b>                           DAY-DAY\n</b>                     (letting out the smoke)\n                 I don't.\n\n<b>                           ROACH\n</b>                     (taking the joint)\n                 I do.\n\n<b>                           DAY-DAY\n</b>                 Damn nigga, don't Jack the joint.  I\n                 didn't even pass it.\n\n<b>                           ROACH\n</b>                     (hitting it good)\n                 Sorry, dude.\n\n<b>                           CRAIG\n</b>                 You better open up a window or something\n                 before the smell gets out.\n\n<b>                           DAY-DAY\n</b>                 Ain't no windows in here.\n\n<b>                           ROACH\n</b>                 I got an idea.\n\n       He hands the joint to Craig.  Gets up and closes the door.\n       Then he grabs the vacuum out of the corner.\n\n                           ROACH (cont'd)\n                 This is a little theory of mine... it\n                 should work.\n\n       He plugs in the VACUUM and TURNS it ON.  He puts the nozzle\n       in Day-Day's face.\n\n<b>                           DAY-DAY\n</b>                 Blow.\n\n<b>                           CRAIG\n</b>                 That ain't gonna work.\n\n<b>                           ROACH\n</b>                 Fuck yeah.\n\n       Day-Day hits the 'J and blows into the nozzle.  It quickly\n       sucks up the smoke.\n\n<b>                           DAY-DAY\n</b>                     (passing the 'J)\n                 It works.\n\n<b>                           CRAIG\n</b>                 Still gonna smell it.\n\n<b>                           ROACH\n</b>                 No way.  Watch this.\n\n       Roach hits the joint harder than anyone else.  Smoke starts\n       to come out of his ears.  Craig and Day-Day get a kick out of\n       that.\n\n<b>       EXT. PINKY'S RECORDS AND DISC - CONTINUOUS\n</b>\n       A pink limo pulls to a stop.  The chauffeur gets out wearing\n       his suit just a little too tight.  He opens the door and a\n       pair of pink boots hit the pavement.  The CAMERA PANS UP TO\n       PINKY (35), the asshole owner.\n\n<b>                           PINKY\n</b>                 Look, man, you hittin' them goddamn\n                 corners too fast.  Slow down.  I almost\n                 spilled my Hennessy on this 300 dollar\n                 suit.\n\n       He walks over to the door.  He thinks it's open.  It's not.\n\n                           PINKY (cont'd)\n                 I be damn.\n\n       He shakes the door.  It's locked.  He looks inside.  No one's\n       at the counter.  Cassettes all over the floor.  Pinky looks\n       around making sure no one sneaks up on him.  He reaches under\n       his shirt and pulls out a Glock 9mm.  Sticks his key in the\n       door and steps in.\n\n<b>       BACK STORE AREA - CLOSE UP - ROACH\n</b>\n       is upside down.  All the blood has rushed to his head.  He\n       has Chinaman eyes and a big smile on his face.\n\n<b>                           DAY-DAY\n</b>                 Roach, what are you doing?\n\n<b>                           ROACH\n</b>                 R-U-S-H Intensely.\n\n       A big cloud of smoke rolls out of his mouth and he falls and\n       hits the deck.\n\n                           ROACH (cont'd)\n                 My spleen.\n\n       Craig and Day-Day laugh at Roach.  The VACUUM is still GOING\n       but the room is very smoky.  Craig jumps in.\n\n<b>                           CRAIG\n</b>                     (unplugging the vacuum)\n                 This vacuum don't work.  Where's the\n                 restroom?\n\n<b>                           DAY-DAY\n</b>                 Out the door and to the left.\n\n<b>                           ROACH\n</b>                 I thought the vacuum would work.\n\n<b>       IN HALLWAY\n</b>\n       Craig makes a left and grabs the knob.  He feels something\n       pressing on the back of his head (gun).\n\n<b>                           PINKY\n</b>                     (whispering)\n                 Don't move or I'll blow your head smooth\n                 off.\n\n       Craig throws his hands up.\n\n                           PINKY (cont'd)\n                 Now back up slowly... and don't say a\n                 word.\n\n       He obeys.  Pinky backs Craig into the store.\n\n                           PINKY (cont'd)\n                 Get on the floor.\n\n       Craig gets down.\n\n                           PINKY (cont'd)\n                 Little mothafucka trying to rob me.\n                 I'mma show you how I do 'em.\n\n<b>                           CRAIG\n</b>                 I ain't trying to rob you...\n\n<b>                           PINKY\n</b>                 Shut up!  Fo' I pump this Glock in yo'\n                 ass!  What did you do wit Day-Day and\n                 Roach?\n\n<b>                           CRAIG\n</b>                 Man, Day-Day is my people!\n\n<b>                           PINKY\n</b>                 I said shut up!  Now who sent you?\n\n<b>                           CRAIG\n</b>                 Nobody!\n\n<b>                           PINKY\n</b>                 If you say another word, it's over.  I'm\n                 not playing!\n\n       Pinky starts to pat down Craig's pockets.\n\n                           PINKY (cont'd)\n                 You ain't got no gun, but where's the\n                 weed at?  I smell it.\n\n       Craig says nothing.\n\n                           PINKY (cont'd)\n                 I'mma tie you ass up!\n\n       Pinky backs up and steps on Roach's skateboard.  The gun goes\n       flying and so does he.  Pinky falls on his ass.  The 9mm\n       lands in front of Craig.  There's a big scramble for the gun.\n\n<b>       BACK STORAGE AREA\n</b>\n       The mood is serious.\n\n<b>                           DAY-DAY\n</b>                 I gotta think of a plan to get this money\n                 before tomorrow.\n\n<b>                           ROACH\n</b>                 You could sell your Beamer.\n\n       Day-Day gives Roach the evil-eye.\n\n                           ROACH (cont'd)\n                 My bad.\n\n<b>                           DAY-DAY\n</b>                 I don't know.  I hope Craig got a good\n                 idea.  We gotta ask him when he comes\n                 out.  Let's go and clean up before Pinky\n                 gets here.\n\n<b>                           ROACH\n</b>                 Maybe you can ask him to loan you the\n                 money.\n\n<b>                           DAY-DAY\n</b>                 Yoooo, that's it.  You ain't as dumb as I\n                 think you are, Roach.\n\n<b>                           ROACH\n</b>                 I know.\n\n<b>       BACK INSIDE STORE\n</b>\n       Pinky and Craig are still scrambling for the gun.  The store\n       looks like a tornado hit it.  Twice.  Craig comes up with the\n       pistol.  Pinky jumps on the ground.\n\n<b>                           PINKY\n</b>                 Don't kill me.\n\n       Craig is exhausted.  He stands over Pinky with the gun.\n\n<b>                           CRAIG\n</b>                 Shut up.  I been trying to tell yo' ass\n                 that... Day-Day is my cousin.  They're\n                 right there in the back.\n\n<b>                           PINKY\n</b>                 Whatever you say, man.  I didn't see\n                 shit.  The safe combination is 34-5-27.\n                 Just take it all.\n\n       Just then, Day-Day and Roach come from the back.\n\n<b>                           DAY-DAY\n</b>                 Craig, what the hell are you doing?\n\n<b>                           CRAIG\n</b>                 Nothing.\n\n<b>                           PINKY\n</b>                 Day-Day, is this your cousin?\n\n<b>                           DAY-DAY\n</b>                 Yeah.\n\n<b>                           PINKY\n</b>                 Good.  You fired...and, Roach, your fired\n                 too.\n\n<b>                           ROACH\n</b>                 Why me?\n\n<b>                           PINKY\n</b>                 I smell weed.\n\n       He looks up at Craig.\n\n                           PINKY (cont'd)\n                 And you...you lucky.  I was just about to\n                 get in yo' ass.  Now give me my pistol\n                 back and get the hell out my store.\n\n       Craig looks at Day-Day.  Day-Day looks back at him.  Nobody's\n       high now.\n\n<b>       EXT. FREEWAY - MONTAGE SEQUENCE - AFTERNOON\n</b>\n       Mr. Jones' dog truck is weaving in and out of traffic.\n\n<b>       INT. TRUCK - MONTAGE SEQUENCE - CONTINUOUS\n</b>\n       Mr. Jones is driving and eating at the same time.  He\n       finishes off the last few bites of his sandwich.\n\n<b>                           MR. JONES\n</b>                 Just hold on, Craig.  I'm on my way.\n\n<b>       INT. BACK OF TRUCK - MONTAGE SEQUENCE\n</b>\n       Debo and Ezal are smashed inside the dog cages.\n\n<b>                           EZAL\n</b>                 Debo!  Debo!\n\n<b>                           DEBO\n</b>                 What?\n\n<b>                           EZAL\n</b>                 I can't feel my legs no more.\n\n<b>                           DEBO\n</b>                 Me neither.  How far is Rancho Cucamonga?\n\n<b>                           EZAL\n</b>                 I don't know.\n\n<b>       EXT. UNCLE ELROY'S STREET - MONTAGE SEQUENCE\n</b>\n       The Beamer pulls into the driveway.  Our trio get out with\n       very long faces.\n\n<b>                           CRAIG (V.O.)\n</b>                 In a strange way, I feel responsible for\n                 Day-Day getting fired.  If I wouldn't\n                 have fought Pinky, and gave Day-Day the\n                 joint, he'd still have a job.\n\n       Day-Day walks into the house while Craig and Roach stay out\n       on the porch.\n\n<b>       INT. UNCLE ELROY'S HOUSE - UPSTAIRS - MONTAGE SEQUENCE\n</b>\n       Uncle Elroy opens his bedroom door wearing a S&amp;M mask and\n       holding a tube of KY jelly.  He removes the mask.  Day-Day\n       hands him the notice.  Uncle Elroy takes it with his greasy\n       hands.\n\n<b>                           UNCLE ELROY\n</b>                 Ah damn.  Damn.\n\n<b>                           DAY-DAY\n</b>                 I got fired too.\n\n<b>                           UNCLE ELROY\n</b>                 What?!\n\n       He starts to beat Day-Day with a sex toy.\n\n<b>       EXT. FREEWAY - MONTAGE SEQUENCE - AFTERNOON\n</b>\n       The dog truck exits the freeway.  He pulls into a gas station\n       by the freeway.  He stops near the restrooms and jumps out,\n       air freshner in hand.  When he gets to the door, it's locked.\n\n<b>                           MR. JONES\n</b>                 Damn.\n\n       He knocks.\n\n                           MR. JONES (cont'd)\n                 Say, man, hurry up.  We got an emergency\n                 out here.\n\n       No answer.  Mr. Jones paces nervously.\n\n                           MR. JONES (cont'd)\n                 I knew I shouldn't have ordered that\n                 extra hot sauce.\n\n<b>       EXT. UNCLE ELROY'S PORCH - MONTAGE SEQUENCE - LATE AFTERNOON\n</b>\n       Craig and Day-Day are trying to think.  Roach is practicing\n       skateboard moves.  He's not very good.\n\n<b>                           DAY-DAY\n</b>                 Man, sit down.\n\n<b>       EXT. GAS STATION RESTROOM - MONTAGE SEQUENCE\n</b>\n       He knocks again.\n\n<b>                           MR. JONES\n</b>                 Say, man, what the hell you doing in\n                 there?  Open the door.\n\n       Just then the door opens and out walks MICHAEL JORDAN.\n\n<b>                           MICHAEL JORDAN\n</b>                 Don't nobody go in the bathroom for about\n                 35, 40 minutes.\n\n       Mr. Jones is stunned.\n\n<b>                           MR. JONES\n</b>                 Hey, you that boy?\n\n       Jordan jumps in his car and he's gone.  Mr. Jones is happy\n       he's just seen Michael Jordan.\n\n                           MR. JONES (cont'd)\n                     (smiling)\n                 Ain't that something, Michael Jordan.\n\n       He walks in the bathroom.\n\n<b>       INSIDE\n</b>\n       Reality hits, it stinks up in there.  Mr. Jones fronds.\n\n                           MR. JONES (cont'd)\n                 Oh, Michael, that boy better check his\n                 drawls.\n\n       He starts to spray.\n\n<b>       EXT. UNCLE ELROY'S PORCH - MONTAGE SEQUENCE - LATE AFTERNOON\n</b>\n       Craig, Day-Day and Roach are sitting on the porch thinking.\n\n<b>                           DAY-DAY\n</b>                 What we gonna do?\n\n<b>                           CRAIG\n</b>                 I don't know yet.\n\n<b>                           ROACH\n</b>                 I know what I'mma do.  Go home and face\n                 the music.  My dad is gonna kick my ass\n                 for getting fired again.\n\n       He gets on his skateboard.\n\n<b>                           DAY-DAY\n</b>                 Alright, Roach, see you around.\n\n<b>                           CRAIG\n</b>                 Sorry about today, man.\n\n<b>                           ROACH\n</b>                 Yeah, me too.  Later.\n\n       He attempts to jump off the porch with his board and lands\n       dead on his ass once again.  His board continues to roll.\n\n<b>                           DAY-DAY\n</b>                 Man, sit down.  I can't think with you\n                 falling everywhere.\n\n       His board continues to roll into the street.  At this same\n       time, Joker's low-rider rolls by and breaks his board in two.\n       Roach runs to pick up the pieces.\n\n<b>                           ROACH\n</b>                 My board!\n\n       The Joker Bros. back their low-rider into the driveway.  They\n       have no sympathy.  Cheeco (the pitbull) is in the back yard.\n       He's happy to see them.\n\n       They stroll into the house with three Mexican girls with\n       them.  Joker spots our trio looking.\n\n<b>                           JOKER\n</b>                 What the fuck you looking at?\n\n<b>                           DAY-DAY\n</b>                 Nothing.\n\n<b>                           ROACH\n</b>                 You ran over my board!\n\n<b>                           JOKER\n</b>                 So what?  It shouldn't have been in the\n                 street.\n\n       They disappear into the house.\n\n<b>       BACK ON PORCH\n</b>\n       Craig has a twinkle in his eyes and Roach walks over, pissed.\n\n<b>                           ROACH\n</b>                 Who the fuck is that, Day-Day?\n\n<b>                           DAY-DAY\n</b>                 Let it go, Roach, trust me.\n\n<b>                           ROACH\n</b>                 I'm not letting nothing go.  They killed\n                 my board.\n\n<b>                           DAY-DAY\n</b>                 Let it go!\n\n       Craig is looking over at the Joker's house.  Baby Joker walks\n       out the front door.  He walks over to the rider and POPS the\n<b>       TRUNK.\n</b>\n<b>                           CRAIG\n</b>                 Wait.  Check'em out.\n\n       Baby Joker pulls out a chrome hydraulic pump.  He carries it\n       towards the house.  Cheeco starts to hump his leg.\n\n<b>                           BABY JOKER\n</b>                 Get down.\n\n       Baby Joker drops the pump, something falls out.  (We can't\n       see what it is.)  Baby Joker quickly puts it back.\n\n<b>       BACK ON PORCH\n</b>\n<b>                           CRAIG\n</b>                 You see that?\n\n<b>                           DAY-DAY\n</b>                 I didn't see nothing.\n\n<b>                           ROACH\n</b>                 Me neither.\n\n<b>                           CRAIG\n</b>                 It's something in that hydraulic pump.\n\n<b>                           DAY-DAY\n</b>                 Yeah, air.\n\n<b>                           CRAIG\n</b>                 Naw.  I bet'cha it's something better\n                 than air.\n\n<b>                           DAY-DAY\n</b>                 How you know?  It could be anything.\n\n<b>                           CRAIG\n</b>                 I don't know, and it could be anything.\n                 But I just say we go take a look.\n\n<b>                           ROACH\n</b>                 I say we go over there and kick their\n                 asses.  I can take the little one.\n\n<b>                           DAY-DAY\n</b>                 Are you out your mind?  I'm not messing\n                 with them S.A.'s boy.  You must be crazy.\n\n<b>                           CRAIG\n</b>                 Could be.  Rather be crazy than homeless.\n                 Now all we need is a big pack of baloney.\n\n       Day-Day and Roach look at each other.\n\n<b>                           BOTH\n</b>                 Baloney??\n\n<b>       INT. JOKER'S HOUSE - DEN - NIGHT\n</b>\n       The private party is starting to heat up.  Big Joker sits on\n       the couch with a PRETTY YOUNG GIRL on his lap.  He's smoking\n       on a perfectly rolled cone joint.  Li'l Joker dances with the\n       other girlfriend, as an OLD SCHOOL JAM PLAYS in the B.G.  The\n       other senorita is pouring herself a drink.\n\n       Karla walks into the room.\n\n<b>                           KARLA\n</b>                 I thought you were taking me to see Mama?\n\n<b>                           JOKER\n</b>                 I'll take you later.\n\n<b>                           KARLA\n</b>                 When?  After you get all drunk and\n                 loaded?\n\n<b>                           JOKER\n</b>                 Hey!  I said I'll take your fuckin' ass\n                 later.  Now get out of here.  You're\n                 scaring our company.\n\n       Karla storms out the room.  Baby Joker walks in carrying the\n       chrome pump.\n\n                           JOKER (cont'd)\n                 Get up.\n\n       The Pretty Girl moves off Joker's lap.\n\n                           JOKER (cont'd)\n                 Take it in the room.\n\n       Baby Joker carries the pump in the bedroom.  Joker is close\n       behind.  He SLAMS the DOOR.  The Girl dancing with Li'l Joker\n       gets too nosy.\n\n<b>                           GIRL #1\n</b>                 What was that?\n\n<b>                           LI'L JOKER\n</b>                 What was what?\n\n<b>                           GIRL #1\n</b>                 That silver thing.\n\n<b>                           LI'L JOKER\n</b>                 I didn't see no silver thing, and neither\n                 did you.\n\n<b>       EXT. UNCLE ELROY'S STREET - CONTINUOUS\n</b>\n       Craig, Day-Day and Roach are sneaking across the street\n       towards Joker's house.  Craig looks calm.  Day-Day looks\n       nervous.  Roach eats on a piece of baloney.\n\n<b>                           DAY-DAY\n</b>                 This ain't gonna work.  I'm going back.\n\n       Day-Day tries to turn around.  Craig grabs him.\n\n<b>                           CRAIG\n</b>                 It's about to work, just come on.\n\n<b>                           ROACH\n</b>                     (about to bite baloney)\n                 What about the dog?\n\n       Craig slaps the baloney out of his hand.\n\n<b>                           CRAIG\n</b>                 That's what the baloney's for!\n\n       All three kneel down next to a parked car.  Day-Day looks\n       sick.\n\n<b>                           DAY-DAY\n</b>                 Man, I don't think I can do this, Craig.\n                 I got the B-G's.\n\n<b>                           CRAIG\n</b>                 What's the B-G's?\n\n<b>                           DAY-DAY\n</b>                     (holding his stomach)\n                 The bubble guts.  I'm so nervous it feels\n                 like I'mma shit on myself.\n\n<b>                           ROACH\n</b>                 Try an' hold it, man.  Squeeze your ass\n                 cheeks together.\n\n<b>                           DAY-DAY\n</b>                 Butterflies, my ass.  I'm about to go\n                 home.\n\n       Craig grabs Day-Day again.\n\n<b>                           CRAIG\n</b>                 Look, Day-Day.  If we don't go over there\n                 and take a look, this might be the last\n                 night you got a home.  Now trust me.\n\n       Day-Day realizes that Craig is right. He takes a deep breath.\n\n                           CRAIG (cont'd)\n                 Now all we gotta do is find out where the\n                 little one put that pump.  Take it and\n                 see what's in it.\n\n<b>                           DAY-DAY\n</b>                 You make it sound so easy.\n\n<b>                           CRAIG\n</b>                 It is easy. You know why?  'Cause they're\n                 not expecting it.\n                 Now, Roach, you gotta occupy Cheeco.\n                 Long enough for me and Day-Day to take a\n                 good look.\n\n<b>                           ROACH\n</b>                 Dude, dogs hate me.  I don't know why.\n                 Me and K-9's just don't get along.\n\n<b>                           CRAIG\n</b>                 Well get along with this one.\n                     (pushing Roach)\n                 Go ahead of us.  Don't get seen and don't\n                 let that mutt out of your sight.\n\n<b>                           ROACH\n</b>                 Fuck, what's his name?\n\n<b>                           CRAIG\n</b>                 Cheeco.\n\n       Roach crawls away on his hands and knees.\n\n<b>       EXT. JOKER'S HOUSE - NIGHT\n</b>\n       Roach sneaks past Joker's lowrider.  He slowly approaches the\n       fence.  No sign of Cheeco.  Roach opens the pack of baloney\n       and pulls out a slice.\n\n<b>                           ROACH\n</b>                     (nervous whisper)\n                 Here, Cheeco.  Chee-co, here boy.  That's\n                 a good boy.\n\n       It's pitch-black behind the fence, still no Cheeco.\n\n<b>       PARKED CAR - SAME TIME\n</b>\n       Craig makes a move.\n\n<b>                           CRAIG\n</b>                 Come on, he should have'em by now.\n\n       Day-Day follows.\n\n<b>                           DAY-DAY\n</b>                 Hurry up.  He didn't have that much\n                 baloney.\n\n       They sneak up to the side of the house.  The MUSIC is\n       BLEEDING THROUGH the walls.\n\n<b>       INSIDE HOUSE\n</b>\n       Li'l Joker is dancing with all 3 girls.  They're all getting\n       high and feeling good.  One girl has come out of her blouse.\n       The others start to follow her lead.\n\n<b>                           LI'L JOKER\n</b>                     (yelling towards bedroom)\n                 Hey, homes, you guys better hurry up!\n                 I'mma get greedy.\n\n<b>       BACK OUTSIDE\n</b>\n       Craig and Day-Day are peeking through the window.  Craig\n       moves on.  Day-Day is still watching.\n\n<b>                           DAY-DAY\n</b>                     (to himself)\n                 Look at those tig-ole-bitties\n\n       Craig snatches him from the window.  They walk over to the\n       fence.\n\n<b>                           CRAIG\n</b>                 You go first.\n\n<b>                           DAY-DAY\n</b>                 Naw, you go first.\n\n<b>                           CRAIG\n</b>                 You go first.\n\n<b>                           DAY-DAY\n</b>                 No.\n\n<b>                           CRAIG\n</b>                 Day-Day, if you don't hop that fence\n                 I'mma throw you over.\n\n<b>                           DAY-DAY\n</b>                 I ain't scared of you.  We ain't little\n                 no more.\n\n       Day-Day gets ready to fight.\n\n<b>                           CRAIG\n</b>                 What?\n\n       Craig jumps like he's going to hit him.  Day-Day jumps back\n       and almost falls.\n\n<b>                           DAY-DAY\n</b>                 I hope to God that dog is happy.\n\n<b>                           CRAIG\n</b>                 Me too.\n\n<b>       ROACH\n</b>\n       ...is having no luck.  Cheeco is nowhere to be found.  Roach\n       starts to sing.\n\n<b>                           ROACH\n</b>                 My baloney has a first name.  It's C-h-e-\n                 e-c-o.\n\n       We hear a MEAN GROWL out of the darkness.  Roach continues.\n\n                           ROACH (cont'd)\n                 My baloney has a second name it just like\n                 the first Cheeco.\n\n       GROWLING gets LOWDER.\n\n                           ROACH (cont'd)\n                 Ooooohhhh I love to eat it everyday if\n                 you ask me what I'll say.\n\n       We can hear TINY FOOTSTEPS RUNNING at Roach.\n\n                           ROACH (cont'd)\n                 Cheeco's got to be the dumbest fuckin'\n                 mutt in the whole wide U.S.A.\n\n       CHEECO is running at Roach full speed.  He jumps on the fence\n       and starts to BARK with everything he's got.  Roach drops the\n       baloney.\n\n<b>       CRAIG AND DAY-DAY\n</b>\n       ...hear the DOG BARKING and freeze in their tracks.  Day-Day\n       tries to run.  Craig grabs him, again.\n\n<b>                           CRAIG\n</b>                 Wait.\n\n<b>                           DAY-DAY\n</b>                     (loud whisper)\n                 Wait for what?\n\n       A LOT of BARKING.  Nothing coming.\n\n<b>                           CRAIG\n</b>                 He's still over by Roach.\n\n<b>       ROACH\n</b>\n       ...picks up the baloney and stuffs the whole pack into his\n       mouth.  CHEECO is SILENCED.  Roach is relieved.\n\n<b>       INSIDE JOKER'S BEDROOM - CONTINUOUS\n</b>\n       The chrome pump is open and filled with money.  Baby Joker's\n       pulling out the money while Joker sits on the bed counting\n       it.  They stop when they hear CHEECO BARKING.\n\n<b>                           BABY JOKER\n</b>                 Want me to take a look?\n\n<b>                           JOKER\n</b>                 No, keep working.\n\n       In the mirror behind Joker, we see a stick slide through the\n       curtain.  The curtain cracks just enough to see Craig's eye\n       looking in.\n\n       Just then, Li'l Joker bursts through the door with his shirt\n       off and two half-naked girls on his arms.\n\n<b>                           LI'L JOKER\n</b>                 Yo, man fuck that shit.  Do it later.\n                 It's Friday, time to party, SA.\n\n<b>                           JOKER\n</b>                 Close the door.\n\n<b>                           LI'L JOKER\n</b>                 Not until you come party with us, man.\n\n       Baby Joker looks at the girls, then at Joker.\n\n<b>                           JOKER\n</b>                 Alright, put it in that drawer.\n\n       Joker hands Baby Joker the money.  He puts it away.  They\n       start to exit the room.\n\n<b>       OUTSIDE JOKER'S BEDROOM WINDOW - CONTINUOUS\n</b>\n       Craig is still looking.  Day-Day is scared shitless.  He's\n       looking for Cheeco.\n\n<b>                           DAY-DAY\n</b>                     (whispering)\n                 What you see?\n\n<b>                           CRAIG\n</b>                 That pump was full of money.  I saw where\n                 they put it.  Stay right here, I'mma\n                 climb in and go get it.\n\n<b>                           DAY-DAY\n</b>                 Wait here?  So Cheeco can bite my ass\n                 off?  Tell me where it is I'll do it.\n\n<b>                           CRAIG\n</b>                 No, man, just wait.\n\n       Craig climbs in the window.  Day-Day holds his stomach.\n\n<b>                           DAY-DAY\n</b>                 I got the B-G's.\n\n<b>       ROACH\n</b>\n       ... his meat supply is almost gone.  He tries to think fast.\n       Cheeco starts to look for more meat.  Roach grabs the smashed\n       brownie out of his pocket and throws it to Cheeco.  He\n       swallows it in one big gulp.  He's looking for more.  There\n       is no more.  Roach smiles.  CHEECO GROWLS.\n\n<b>                           ROACH\n</b>                 Good boy.  Nice dog.\n\n       CHEECO'S STILL GROWLING.  Suddenly Cheeco falls back on his\n       butt and lets out a slight moan.\n\n<b>       CHEECO'S POV\n</b>\n       Cheeco is looking up at Roach.  He's seeing double, even\n       triple.  Cheeco lays down.  It looks like he's faded.\n\n<b>                           ROACH\n</b>                 No lungs, baby.  No lungs.\n\n<b>       INSIDE JOKER'S BEDROOM - CONTINUOUS\n</b>\n       Craig is in.  The bedroom door is cracked.  Craig walks over\n       and shuts the door gently.  He locks it.  Then he creeps over\n       to the dresser.  He pulls out the pump and sets it on the\n       bed.  He opens it, revealing all the bundled-up money packed\n       in.  He starts to stuff it in his pockets.\n\n<b>       OUTSIDE JOKER'S BEDROOM WINDOW - CONTINUOUS\n</b>\n       Day-Day is trying to keep his composure.\n\n<b>       INT. DEN - CONTINUOUS\n</b>\n       The SA brothers are having a good time.  Joker is getting\n       nasty with one of the Girls.  He pulls her by the hand.\n\n<b>                           GIRL #2\n</b>                 No.\n\n<b>                           JOKER\n</b>                 Fuck that.\n\n       Joker picks her up and carries her to the bedroom.  She\n       screams.  He laughs.  He goes for the door.  It's locked.\n\n                           JOKER (cont'd)\n                 Who locked this door?\n\n       Everybody looks confused.\n\n                           JOKER (cont'd)\n                 Who locked this fuckin' door?!\n\n       Joker starts to kick the door.\n\n<b>       INSIDE JOKER'S BEDROOM - CONTINUOUS\n</b>\n       Craig hurries to put the pump back.  He's about to go for the\n       window when: BANG!  There's a KICK on the door.  All Craig\n       can do is go for another door on the other side of the room.\n       BANG!  The door flies open and Craig is out there just in\n       time.\n\n<b>                           JOKER\n</b>                 I don't want no doors locked around here.\n                 You hear me?\n\n       Joker walks in and hits the lights.  He throws the girl on\n       the bed.\n\n<b>                           GIRL #2\n</b>                 Oh, poppy, I like it rough.\n\n<b>                           JOKER\n</b>                     (taking off shirt)\n                 Good, 'cause that's how you gonna get it.\n\n<b>       INT. JOKER'S HOUSE - STAIRWAY - CONTINUOUS\n</b>\n       Baby Joker has his back turned when we see Craig sprint\n       behind him and up the stairs.  Baby Joker turns around.  He\n       thinks he saw something.  He slowly starts to walk up the\n       stairs.\n\n<b>                           LI'L JOKER\n</b>                 Karla!\n\n<b>       INT. KARLA'S ROOM - CONTINUOUS\n</b>\n       Karla is in her room working out.  Craig runs in.  He's\n       shocked to see her.  She doesn't see him, but he's frozen.\n       Then she turns around and he startles her.\n\n<b>                           KARLA\n</b>                 What are you doing?\n\n       Think fast, Craig.\n\n<b>                           CRAIG\n</b>                 Huh?\n\n<b>                           KARLA\n</b>                 What are you doing here?\n\n<b>                           CRAIG\n</b>                 I hope you don't think I'm crazy, but I\n                 just had to come in here and show you I\n                 ain't scared of yo' punk ass\n                 brothers...and you wouldn't have be\n                 scared of 'em neither if you had a man\n                 like me in yo' life.\n\n<b>                           KARLA\n</b>                 What??  So you snuck in my room to tell\n                 me that?\n\n<b>                           CRAIG\n</b>                 Yes I did.  Excuse me.\n\n       Her door flies open.  Smashing Craig behind it.  It's Li'l\n       Joker.\n\n<b>                           LI'L JOKER\n</b>                 Who you talking to?\n\n       Craig looks nervous.\n\n<b>                           KARLA\n</b>                 Nobody.\n\n<b>                           LI'L JOKER\n</b>                 I heard a voice.\n\n<b>                           KARLA\n</b>                 No you didn't.  Get out my room.  Go back\n                 down to your little girlfriends.\n\n       Karla pushes Li'l Joker out.\n\n<b>       OUTSIDE JOKER'S BEDROOM WINDOW - CONTINUOUS\n</b>\n       Day-Day is having a fit.\n\n<b>                           GIRL #2 (O.S.)\n</b>                 Shut the window.\n\n<b>                           JOKER (O.S.)\n</b>                 You shut the window.\n\n       She does.\n\n<b>                           DAY-DAY\n</b>                 Oh shit.\n\n       Day-Day takes off.  He hops the fence in record speed.\n\n<b>       CHEECO\n</b>\n       ...is laying on his back looking through the fence.  He's\n       calm and cool now.\n\n<b>       OTHER SIDE\n</b>\n       Roach is on his back looking through the fence.  He hits a\n       joint and blows the smoke into Cheeco's face.\n\n<b>                           ROACH\n</b>                 ...like I was saying.  A guy like me, and\n                 a dog like you, don't need this bullshit.\n                 We need to be in Maui renting jet ski to\n                 fat funks in flower shirts.  You feel me,\n<b>                 C?\n</b>\n       Cheeco is passed out.  Day-Day sneaks around the corner.  He\n       whispers.\n\n<b>                           DAY-DAY\n</b>                 Roach...Roach, come on.\n\n<b>                           ROACH\n</b>                 Where's Craig?\n\n<b>                           DAY-DAY\n</b>                 He's inside the house?\n\n<b>                           ROACH\n</b>                 Why did he go in the house?\n\n<b>                           DAY-DAY\n</b>                 Don't worry about it.  We gotta figure\n                 out a way to get Craig out of there.\n                 He's probably getting tied up now.\n\n<b>       INT. KARLA'S ROOM - CONTINUOUS\n</b>\n       Craig is sweating.  Karla is standing in front of him.\n\n<b>                           KARLA\n</b>                 You did all this for me?\n\n<b>                           CRAIG\n</b>                 Most of it.  I just hate to see you in\n                 this situation.\n\n<b>                           KARLA\n</b>                 Thanks for noticing.  It used ta be\n                 peaceful before they got out.  Took over\n                 the house and caused my mother's nervous\n                 breakdown.\n\n<b>                           CRAIG\n</b>                 Why didn't she put'em out?\n\n<b>                           KARLA\n</b>                 Easier said than done.  We saved up to\n                 get away from them, but they followed us.\n\n<b>                           CRAIG\n</b>                 I'm sorry to hear that.\n\n       Craig walks over to the window.\n\n                           CRAIG (cont'd)\n                 Can I get out this way?\n\n       Karla walks up behind him, looking very sexy.\n\n<b>                           KARLA\n</b>                 I thought you came up here to see me.\n\n       Craig turns around.\n\n<b>                           CRAIG\n</b>                 I did.  Is that door locked?\n\n<b>                           KARLA\n</b>                 It's locked.\n\n<b>                           CRAIG\n</b>                 Make sure.\n\n       Karla turns around to check the door.\n\n<b>                           KARLA\n</b>                 You so nervous, I already locked this\n                 door.\n\n       Craig drops a thick roll of money into her purse.  She shakes\n       the knob.\n\n                           KARLA (cont'd)\n                 See.  All locked.\n\n       She walks over to him.  They're face-to-face.\n\n                           KARLA (cont'd)\n                 What's your hurry?\n\n<b>                           CRAIG\n</b>                 I got my cousin Day-Day waiting for me.\n\n<b>                           KARLA\n</b>                     (getting even closer)\n                 So what?  Let's make'em wait.\n\n       Craig looks AT the CAMERA.\n\n<b>                           CRAIG\n</b>                 I be damn.\n\n<b>       EXT. JOKER'S HOUSE - NIGHT\n</b>\n       Day-Day and Roach are at Joker's front door.\n\n<b>                           DAY-DAY\n</b>                 You wanna knock?\n\n<b>                           ROACH\n</b>                 Go for it.\n\n       Day-Day knocks real soft.  Too soft.\n\n                           ROACH (cont'd)\n                 No one's gonna hear that.  The music's\n                 playing.\n\n<b>                           DAY-DAY\n</b>                 'Scuse me, partner, but that's a ghetto\n                 knock.\n\n<b>                           ROACH\n</b>                 This is a knock.\n\n       Roach starts to kick on the door with his foot.  It's very\n       loud.\n\n<b>       INT. DEN - CONTINUOUS\n</b>\n       Joker storms in with the AK.  Li'l Joker is in the corner\n       with his girl, and Baby Joker is on the floor.  Joker TURNS\n<b>       DOWN THE STEREO.\n</b>\n<b>                           JOKER\n</b>                 You fuckin' lover boys hear that?\n\n<b>                           BABY JOKER\n</b>                 Hear what?\n\n       The KNOCKING continues.  Li'l Joker and Baby Joker push the\n       girls aside and jump up.  Li'l Joker grabs a big knife.  Baby\n       Joker grabs a 9mm.  Joker looks at the girls.\n\n<b>                           JOKER\n</b>                 Don't fuckin' move.\n\n       They won't.  The brothers run to the door.\n\n<b>       OUTSIDE\n</b>\n       Roach is still kicking.\n\n<b>                           DAY-DAY\n</b>                 What's wrong with you, fool.  Stop\n                 kicking their door.  They might think we\n                 the police.\n\n       The front door swings open and before we know it.  Day-Day's\n       got an AK pointed in his face, and Roach is looking at a 9\n       close up.\n\n<b>                           JOKER\n</b>                 What the fuck you want?\n\n       Day-Day's tongue doesn't work.\n\n<b>                           DAY-DAY\n</b>                 Uh...um...I mean uh, can we borrow a cup\n                 of sugar?\n\n<b>                           JOKER\n</b>                 What?!  This look like a 7-11 or\n                 something?  Get the fuck outta here!\n\n<b>                           DAY-DAY\n</b>                     (starts to leave)\n                 Alright, no problem.  We gone.\n\n<b>                           ROACH\n</b>                 Hold on.  A man, you broke my fuckin'\n                 board and I don't appreciate it.\n\n       Immediately Day-Day and Roach are snatched inside the house,\n       and the door is SLAMMED.\n\n<b>       EXT. UNCLE ELROY'S HOUSE - CONTINUOUS\n</b>\n       Mr. Jones' dog truck pulls to a stop.  He gets out and runs\n       to the house.  He KNOCKS.  Uncle Elroy answers.  Suga is\n       looking over his shoulder.\n\n<b>                           MR. JONES\n</b>                 I got your message.  Where's Craig?\n\n<b>                           UNCLE ELROY\n</b>                 I don't know, I didn't leave you no damn\n                 message!\n\n<b>                           MR. JONES\n</b>                 You didn't call the Sandwich Joint with a\n                 urgent message?\n\n<b>                           UNCLE ELROY\n</b>                 Hell naw, Willie. Them fleas and tics\n                 must be sucking on yo' brain!\n\n<b>                           MR. JONES\n</b>                 Somebody left me a message.  Well where's\n                 Craig and Day-Day?\n\n<b>                           UNCLE ELROY\n</b>                 I don't know.  Suga, go ask Miss Ho Kym\n                 if she seen them.\n\n<b>       EXT. KARLA'S BEDROOM WINDOW - CONTINUOUS\n</b>\n       Craig is about to climb out the window.\n\n<b>                           KARLA\n</b>                 Next time, page me first.\n\n<b>                           CRAIG\n</b>                 Okay.\n\n       Craig climbs out the window.  He loses his footing and free\n       falls into some bushes.\n\n<b>                           KARLA\n</b>                 You alright?\n\n<b>                           CRAIG\n</b>                 Yeah, I'm cool.  See you later.\n\n       He runs past a sleeping Cheeco and hops the fence.  Free at\n       last.  He's about to run back across the street when he sees\n       the dog truck.\n\n                           CRAIG (cont'd)\n                 What is he doing here?\n\n       Craig ducks back.\n\n<b>       INT. JOKER'S HOUSE - DEN - NIGHT\n</b>\n       Day-Day and Roach are sitting on a couch looking nervous.\n       The Joker brothers hold guns on them.  The three half-dressed\n       Mexican Girls look a bit scared themselves.\n\n<b>                           DAY-DAY\n</b>                 Look, man, this is a big\n                 misunderstanding.  All we wanted to do is\n                 borrow some sugar.\n\n<b>                           ROACH\n</b>                 And some rolling papers.\n\n<b>                           DAY-DAY\n</b>                 ...and some rolling papers, that's it.\n                 We didn't mean to mess up y'all get\n                 together or nothing.\n                     (to the Girls)\n                 How y'all doing?\n\n       They answer --\n\n<b>                           GIRLS\n</b>                 Fine.\n\n<b>                           DAY-DAY\n</b>                 That's good.  My name's Day-Day and this\n                 is my friend, Roach.\n\n<b>                           ROACH\n</b>                     (waving)\n                 Hey.\n\n<b>                           DAY-DAY\n</b>                 Ya'll live around here?\n\n<b>                           JOKER\n</b>                 Shut up!  Both of you right now!\n\n<b>                           DAY-DAY\n</b>                     (to Roach)\n                 Shhhh!  Roach, shut the fuck up.\n\n<b>                           JOKER\n</b>                 I don't believe this sugar shit.\n                 Something ain't right.\n\n       Joker thinks for a moment.  Then he turns to Baby Joker.\n\n                           JOKER (cont'd)\n                     (in Spanish)\n                 Go check on the money.\n\n       Baby Joker obeys the order.\n\n<b>                           LI'L JOKER\n</b>                 Here comes Karla, put the guns away.\n\n<b>                           JOKER\n</b>                 Keep your mouth shut.\n\n       Karla walks back in.\n\n<b>                           KARLA\n</b>                 Hey, what's going on?\n\n<b>                           JOKER\n</b>                 Nothing.  What you want?\n\n<b>                           KARLA\n</b>                 Are you going to take me to see Mom?\n\n<b>                           JOKER\n</b>                 Take your car.\n\n<b>                           KARLA\n</b>                 'Take your car?'\n\n<b>                           JOKER\n</b>                 Yeah, and hurry up.\n\n       Karla doesn't believe it.\n\n<b>                           KARLA\n</b>                 Okay.\n\n       She grabs the keys off the bar.\n\n                           KARLA (cont'd)\n                 I'll be back in a bit.  'Bye.\n\n       She's out the door.  Joker turns to Day-Day and Roach.\n\n<b>                           JOKER\n</b>                 If everything's alright.  We might let\n                 you leave, too.\n\n<b>       EXT. UNCLE ELROY'S HOUSE - CONTINUOUS\n</b>\n       The front door swings open.  It's Uncle Elroy.\n\n<b>                           UNCLE ELROY\n</b>                 Craig, where the hell you been?\n\n       Mr. Jones pops up.  So does Suga and Miss Ho Kym.\n\n<b>                           MR. JONES\n</b>                 Hold up, Elroy, that's my boy.  Craig,\n                 what the hell wrong with you?  Where you\n                 been?\n\n<b>                           CRAIG\n</b>                 Have you seen Day-Day?\n\n<b>                           UNCLE ELROY\n</b>                 No.  Thought he was with you.\n\n<b>                           CRAIG\n</b>                 Daddy, Uncle Elroy, I need your help.\n\n       He steps in the house and closes the door behind him.\n\n<b>       INT. JOKER'S HOUSE - DEN - NIGHT\n</b>\n       It's the same scene as before.  Two angry Mexicans, three\n       half-naked Girls, plus Day-Day and Roach in the middle.  Baby\n       Joker returns.\n\n<b>                           BABY JOKER\n</b>                     (in Spanish)\n                 Some of the money is missing.\n\n<b>                           JOKER\n</b>                     (upset)\n                 What?!?!\n\n<b>                           DAY-DAY\n</b>                 What?!\n                     (as he looks at Roach)\n                 What that mean?\n\n<b>                           ROACH\n</b>                 I don't know.\n\n<b>                           JOKER\n</b>                 It means you Miyateas are staying with\n                 us.\n                     (to Baby Joker)\n                 Get the duct tape.\n                     (to Li'l Joker)\n                 You know what to do.\n\n       Li'l Joker turns to the girls.\n\n<b>                           LI'L JOKER\n</b>                 Put your clothes back on.\n\n       The scared Girls start to dress.\n\n<b>       EXT. JOKER'S HOUSE - NIGHT\n</b>\n       Karla backs up the rider and she's out.  The Joker house\n       looks quiet.  Then the door opens and three Girls walk out.\n\n<b>                           LI'L JOKER\n</b>                 Sorry you gotta walk, but I'll call you\n                 tomorrow.\n\n       The Girls take off down the street.  The porch lights go out.\n\n<b>       INT. UNCLE ELROY'S HOUSE - CONTINUOUS\n</b>\n       Craig, Mr. Jones, Uncle Elroy, Suga and Miss Ho Kym are\n       peeking out the window.\n\n<b>                           CRAIG\n</b>                 You see that?\n\n<b>                           MR. JONES\n</b>                 I saw it.\n\n<b>                           UNCLE ELROY\n</b>                 Me, too.  You think they're in there?\n\n<b>                           CRAIG\n</b>                 Yup.\n\n<b>                           MISS HO KYM\n</b>                 Why for?  Them boys are real player\n                 haters.\n\n<b>                           CRAIG\n</b>                 It's a long story.  Right now we gotta do\n                 somethin'.\n\n<b>                           MR. JONES\n</b>                 You come way out here to get into more\n                 trouble.  You could've stayed at home.\n\n<b>                           UNCLE ELROY\n</b>                 Willie, shut up.  Yo' old ass need to get\n                 in a little bit o' trouble sometimes.\n\n<b>                           MR. JONES\n</b>                     (rolling up his sleeve)\n                 Don't get it twisted, Elroy.  I ain't\n                 lost none of my street skills.\n\n<b>                           SUGA\n</b>                 If ya'll don't come back not in ten\n                 minutes, I'mma callin' the po'lice.\n\n       Craig, Uncle Elroy and Mr. Jones are about to go on a\n       mission.\n\n<b>                           UNCLE ELROY\n</b>                 Wait a minute.  I gotta go get my shit.\n\n       Uncle Elroy runs upstairs.\n\n<b>       INT. JOKER'S HOUSE - DEN - CONTINUOUS\n</b>\n       Li'l Joker is almost finished duct-taping Day-Day and Roach.\n       Baby Joker holds the AK.  Joker paces the floor.  Day-Day and\n       Roach try to make peace by singing an old \"War\" song.  Day-\n       Day is serious.\n\n<b>                           DAY-DAY &amp; ROACH\n</b>                 'Why can't we be friends?  Why can't we\n                 be friends?  Why can't we be friends?\n                 Why can't we be friends?'...\n\n<b>                           DAY-DAY\n</b>                     (still singing)\n                 'I hope my cousin call the C.I.A.'\n\n       Joker throws a BOTTLE against the wall.  It SHATTERS into a\n       million pieces.\n\n<b>                           JOKER\n</b>                 Shut the fuck up!\n\n       The singing stops.\n\n                           JOKER (cont'd)\n                 If you don't tell me where my money is,\n                 I'mma show you how close we can get.\n\n<b>                           DAY-DAY\n</b>                 Money?  Man, we came over here from some\n                 sugar and rolling papers.  We was going\n                 to get high, and I was going to show this\n                 white boy how to make Kool-Aid.  That's\n                 all.\n\n<b>                           ROACH\n</b>                 Hey, mister Joker, have a heart, bro.\n                 It's Friday.\n\n       Joker walks over to Roach and kicks him in the mouth.\n\n<b>                           JOKER\n</b>                 I'm hearing a lot of talking, but I'm not\n                 hearing the right words.\n\n<b>                           BABY JOKER\n</b>                 Maybe the other guy took it.\n\n<b>                           DAY-DAY\n</b>                 Why would he take it?  He don't even know\n                 you.\n\n<b>                           JOKER\n</b>                     (thinking)\n                 Shut up!  Where's that other miyatea?\n\n<b>       EXT. JOKER'S HOUSE - CONTINUOUS\n</b>\n       Uncle Elroy catches up with Craig and Mr. Jones on the side\n       of Joker's house.  He has a big chrome .357 magnum.\n\n<b>                           CRAIG\n</b>                 That's a nice piece of heat right there.\n\n<b>                           UNCLE ELROY\n</b>                 Thank you.  I only got two bullets in the\n                 mothafucka, but it's better than nothing.\n\n<b>                           MR. JONES\n</b>                 Two bullets?  Yo' ass ain't changed.\n                 Back in the day, all I had was a stick.\n\n<b>                           CRAIG\n</b>                 Come on.\n\n       They sneak over to the fence.\n\n<b>                           UNCLE ELROY\n</b>                 What about that ugly dog?\n\n<b>                           MR. JONES\n</b>                 I got my mase.\n\n<b>                           CRAIG\n</b>                 He's on the other side, sleep.\n\n       They start to hop the fence.\n\n<b>       ON CHEECO\n</b>\n       ...starts to awake.  He tries to stand up and stumbles back\n       on his face.  He lets out ANOTHER MOAN.\n\n<b>       ON CRAIG AND UNCLE ELROY\n</b>\n       Craig is over the fence.  Mr. Jones is over  But Uncle Elroy\n       is having a little trouble.\n\n                           CRAIG (cont'd)\n                 Need some help?\n\n<b>                           MR. JONES\n</b>                 Need to lose some weight.\n\n<b>                           UNCLE ELROY\n</b>                 Shut yo' ass up.\n\n       Uncle Elroy falls off the fence.\n\n                           UNCLE ELROY (cont'd)\n                 Damn.\n\n       Craig &amp; Mr. Jones helps him up.  They creep over to the\n       window - the shades are pulled down.\n\n<b>                           CRAIG\n</b>                 I'm not sure, but I think they're in this\n                 room.\n\n<b>       INT. JOKER'S HOUSE - DEN - CONTINUOUS\n</b>\n       Joker is getting tired of the games.  And Day-Day is pleading\n       for his life.\n\n<b>                           JOKER\n</b>                 Tape his mouth shut.\n\n<b>                           DAY-DAY\n</b>                 Joker, a man like yourself can do a lot\n                 for this community.  By letting us go,\n                 you can improve black and brown\n                 relations.\n\n<b>                           ROACH\n</b>                 Yeah, brown and white relations, too.\n\n       Day-Day looks at Roach.\n\n<b>                           DAY-DAY\n</b>                 Boy, you gonna get us killed.\n\n       Li'l Joker grabs Day-Day and tapes his mouth shut.  He does\n       the same to Roach.\n\n<b>                           JOKER\n</b>                 I'm sick and tired of bullshitting with\n                 you guys.\n                     (in Spanish)\n                 Baby brother, go get the chainsaw.\n\n       Baby Joker hands him the AK and he's gone.  Day-Day and Roach\n       look terrified.  Everything has turned serious.\n\n<b>       INT. MR. JONES' DOG TRUCK - CONTINUOUS\n</b>\n       Debo and Ezal are still asleep.  Debo wakes first.\n\n<b>                           DEBO\n</b>                 Ezal!  Ezal!\n\n<b>                           EZAL\n</b>                 Huh?\n\n<b>                           DEBO\n</b>                 We must be here 'cause we stopped.\n\n<b>                           EZAL\n</b>                 Good, let's get out.\n\n       They both try to get out.  But it's no way to get out from\n       the inside.\n\n<b>                           DEBO\n</b>                 Hey, how you get out of here.\n\n<b>                           EZAL\n</b>                 I don't know.\n\n       They both start to go nuts on the door.\n\n<b>       OUTSIDE\n</b>\n       The dog truck is shaking like crazy.\n\n<b>       EXT. JOKER'S BACKYARD - CONTINUOUS\n</b>\n       Baby Joker walks out the back door.  He stops in the middle\n       of the yard.\n\n<b>                           BABY JOKER\n</b>                 Cheeco!  Cheeco!  Here, boy!\n\n       No Cheeco.  He continues to a shed in the back yard.  He goes\n       inside and picks up a chainsaw.  On his way out the shed,\n       he's slapped in the face with a \"Big Ass Stick.\"  Mr. Jones\n       is working the handle.\n\n       Baby Joker is out cold.  Mr. Jones stands over him.\n\n<b>                           MR. JONES\n</b>                 Nigga, you got knock the fuck out.\n\n<b>                           CRAIG\n</b>                 Yeah, pops!\n\n<b>                           UNCLE ELROY\n</b>                 Damn, big bro.  You swung that like Sammy\n                 Sosa.\n\n<b>                           MR. JONES\n</b>                 The skills are still intact.  Now tie his\n                 ass up, Elroy.\n\n       He does.\n\n<b>       INT. JOKER'S HOUSE - DEN - CONTINUOUS\n</b>\n       The terror continues.\n\n<b>                           JOKER\n</b>                 My little brother went out to get my\n                 chainsaw.  I'mma show you what happens to\n                 fools who don't tell me what I wanna\n                 hear.  You ever see Scarface, mothafucka?\n\n       Day-Day starts to cry.  Roach tries to scream through the\n       tape.  Joker turns to Li'l Joker.\n\n                           JOKER (cont'd)\n                 Go see what's taking him so long.\n\n       Li'l Joker obeys.  We FOLLOW Li'l Joker THROUGH the house and\n       OUT the back door.\n\n<b>       EXT. JOKER'S BACKYARD - CONTINUOUS\n</b>\n       Li'l Joker stands at the back door.\n\n<b>                           LI'L JOKER\n</b>                 Junior?!  Junior?!\n\n       No answer.  Suddenly he spots something over by the shed.\n       It's Baby Joker all ties up.\n\n                           LI'L JOKER (cont'd)\n                 What the...\n\n       He runs to the rescue.  But right before he gets to him,\n       Uncle Elroy jumps out the bushes and takes him.  \"Ronnie Lott\n       Style.\"  Mr. Jones steps in with the stick.  Craig steps in\n       with the rope, and it's over.  Uncle Elroy's hurt.  It's his\n       back.\n\n<b>                           UNCLE ELROY\n</b>                     (in pain)\n                 My back.\n\n<b>                           MR. JONES\n</b>                 What's the matter?\n\n<b>                           UNCLE ELROY\n</b>                 I slip my disc, again... Oh got damn.\n\n       Craig goes to assist Uncle Elroy.\n\n<b>                           CRAIG\n</b>                 Stretch it out.\n\n<b>                           UNCLE ELROY\n</b>                 Don't move me.\n\n<b>       INT. JOKER'S HOUSE - DEN - CONTINUOUS\n</b>\n       Joker is pissed.\n\n<b>                           JOKER\n</b>                 Where are these fucking guys?\n\n       He storms out the room.  Day-Day and Roach try to escape.\n       They flap around on the ground like a fish out of water.\n\n<b>       EXT. JOKER'S BACKYARD - CONTINUOUS\n</b>\n       The back door flies open.  Joker appears with the AK-47 in\n       hand.  He spots Uncle Elroy in the middle of the yard bent\n       over.  He lifts the AK.\n\n<b>                           JOKER\n</b>                 What you doing here?\n\n<b>                           UNCLE ELROY\n</b>                 I lost something, nigga.  What it look\n                 like?\n\n<b>                           JOKER\n</b>                 Looks like a dead man.\n\n       Out of nowhere, Craig hits Joker from the back.  He flies one\n       way and the gun flies another.  Now it's really on!  Hand-to-\n       hand combat.  Craig vs. Joker.  Right vs. wrong.  Good vs.\n       evil.  You know how it go.\n\n<b>                           MR. JONES\n</b>                 Go to the body, Craig!  Go to the body!\n\n<b>       INT. JOKER'S HOUSE - DEN - CONTINUOUS\n</b>\n       Day-Day and Roach have made it a little further to the door,\n       but they still look like fish searching for H2O.  Uncle Elroy\n       stumbles in.  He grabs a knife and starts to cut them loose.\n\n<b>                           UNCLE ELROY\n</b>                 Boy, Day-Day, I'mma kick yo' ass for\n                 getting me into this mess and hurting my\n                 back!  I moved out here to get away from\n                 this kinda shit!\n\n<b>       EXT. JOKER'S BACKYARD - CONTINUOUS\n</b>\n       Fight's still on.  Craig is giving Joker the ass-whipping he\n       deserves when Uncle Elroy, Day-Day and Roach reach the back\n       porch.\n\n<b>                           DAY-DAY\n</b>                 Get 'em, Craig!\n\n<b>                           ROACH\n</b>                 Bite his ear!\n\n<b>                           UNCLE ELROY\n</b>                 What 'em!  Watch 'em!\n\n       Joker takes a few more shots from Craig, then grabs Craig\n       around the waist and slams him to the ground.  Craig is hurt.\n\n                           UNCLE ELROY (cont'd)\n                 Get off yo' back, Craig!\n\n       Craig struggles with Joker, who now has the devil in his\n       eyes.\n\n<b>                           CRAIG\n</b>                 Ya'll mothafuckas help me!\n\n       Day-Day and Roach look at each other.  They rush to Craig's\n       aide.  Joker spots them coming, he also spots the AK.\n\n       In SLOW MOTION, Day-Day and Roach dive on Joker...at the same\n       time Joker dives for the AK.  Day-Day and Roach land on top\n       of Craig and our trio try to hurry to their feet.  But as\n       soon as they get up, they're looking down the barrel of an AK-\n<b>       47.\n</b>\n<b>                           JOKER\n</b>                     (smiling)\n                 Say hello to my little friend.\n\n<b>       BOOM!\n</b>\n       Debo hits Joker from the back.  Joker is out cold.\n\n<b>                           DEBO\n</b>                 No way, Jose.  This one is mine.\n\n       Ezal picks up the gun and hands it to Debo.\n\n                           DEBO (cont'd)\n                 Hi, Craig, remember me?\n\n       Craig knows he can't fight a gun.  Everybody is helpless.  We\n       can hear SIRENS getting CLOSER and CLOSER.  Suddenly, out of\n       nowhere...\n\n<b>       CHEECO!\n</b>\n       The pitbull is back!  And he's mad as hell.  He runs through\n       everybody and jumps on Debo, knocking the gun from his hand.\n       Craig and Day-Day jump on Debo.  Roach WHISTLES, and Cheeco\n       stops his attack on Debo.\n\n       Cheeco runs over to Roach and jumps in his arms.  Roach's\n       being licked to death by the pitbull.\n\n<b>                           DAY-DAY\n</b>                 Finally you got a bitch, huh, Roach?\n\n<b>                           ROACH\n</b>                 He's a boy, dude.\n\n<b>       EXT. JOKER'S HOUSE - CONTINUOUS\n</b>\n       Out front, three sheriff cars swoop into the driveway.  The\n       cops jump out, guns drawn.\n\n<b>       EXT. JOKER'S BACKYARD - CONTINUOUS\n</b>\n       Debo and Ezal are tied up next to the Jokers.\n\n<b>                           EZAL\n</b>                 Mr. Jones, we was just playin'.  He made\n                 me do it.\n\n       Mr. Jones don't wanna hear it.  Craig runs into the house.\n       Uncle, Day-Day, Roach and Cheeco look at the five on the\n       ground...it's over, or is it?\n\n<b>                           SHERIFF #3\n</b>                 Freeze, Sheriff's Department!\n\n       The SHERIFFS are on our heroes, guns drawn.\n\n<b>                           UNCLE ELROY\n</b>                 Wait a minute!  I live across the street!\n\n<b>                           SHERIFF LADY\n</b>                 You do?\n\n<b>                           UNCLE ELROY\n</b>                 Yeah.  Paid cash.\n\n<b>                           DAY-DAY\n</b>                 They the ones you want.\n\n<b>       EXT. UNCLE ELROY'S STREET - CONTINUOUS\n</b>\n       Red and Blue lights flash through the neighborhood.  Everyone\n       is out their door looking at the action.  The suburbs is\n       starting to look like the ghetto for real.\n\n       Uncle Elroy is bent over.\n\n<b>                           UNCLE ELROY\n</b>                 When my back gets better I'mma beat the\n                 black off you, Day-Day.\n\n<b>                           DAY-DAY\n</b>                 I know.  I'm sorry.\n\n<b>                           UNCLE ELROY\n</b>                 Sorry, my ass.\n\n       Suga and Miss Ho Kym come running.\n\n<b>                           SUGA\n</b>                 Elroy, what happen?\n\n<b>                           UNCLE ELROY\n</b>                 I threw my back, again.\n\n<b>                           SUGA\n</b>                 Aw, no lovin' tonight?\n\n<b>                           UNCLE ELROY\n</b>                 Naw, baby, no lovin' tonight.\n\n<b>                           SUGA\n</b>                 Come on, baby, let's go in the house.\n\n<b>                           UNCLE ELROY\n</b>                 For what?  We ain't gonna have no house\n                 after the auction tomorrow!\n\n       Everyone is sad.\n\n<b>                           ROACH\n</b>                 Don't worry, bro, you, Suga, Day-Day and\n                 Craig can live with me and my parents.\n                 'Til you get back on yo' feet.\n\n<b>                           UNCLE ELROY\n</b>                 Thanks, Roach, but I can't accept that.\n                 We're moving back to Watts where it's\n                 safe.\n\n<b>                           DAY-DAY\n</b>                 Where's Craig?\n\n<b>                           UNCLE ELROY\n</b>                 I don't know.\n\n<b>                           MR. JONES\n</b>                 That boy just don't never learn.\n\n<b>       EXT. JOKER'S HOUSE - CONTINUOUS\n</b>\n       Craig steps out of Joker's front door carrying the chrome\n       hydraulic pump.\n\n<b>                           CRAIG\n</b>                 I love Fridays.\n\n       He walks past the cops and crosses the street.\n\n<b>                           ROACH\n</b>                 There he go.\n\n<b>                           MR. JONES\n</b>                 What the hell is he carrying?\n\n<b>                           DAY-DAY\n</b>                 Property taxes, and a new candy-apple\n                 paint job.\n\n       They greet Craig and all start to walk towards the house.\n\n<b>       INT. UNCLE ELROY'S STREET - NIGHT\n</b>\n       The \"Jefferson's\" theme song, \"Movin' On Up,\" PLAYS on the\n       TV.  Uncle Elroy is face down on the floor looking at the TV.\n       Miss Ho Kym walks on his back with her shoes off.  He moans\n       in pleasure.  Mr. Jones eats chicken wings.\n\n<b>                           MR. JONES\n</b>                 Jump up and down on him.\n\n<b>                           MISS HO KYM\n</b>                 That's next.\n\n<b>                           UNCLE ELROY\n</b>                 Don't listen to him.  How much we got?\n\n       Suga is at the table counting money.  She takes a few\n       hundreds for herself.\n\n<b>                           SUGA\n</b>                 We got forty-seven thousand, three\n                 hundred and fifteen dollars.\n\n<b>                           MR. JONES\n</b>                 Good Lord.\n\n<b>                           MISS HO KYM\n</b>                 That's a whole lot of scrilla.\n\n<b>                           UNCLE ELROY\n</b>                 It's gonna feel good to pay my taxes.\n\n       Craig is tending to his wounds.\n\n<b>                           CRAIG\n</b>                 You're welcome, Unc.\n\n<b>                           DAY-DAY\n</b>                 What about me?\n\n<b>                           UNCLE ELROY\n</b>                 You didn't do nothing.\n\n       Roach and Cheeco are about to leave.  He has a handful of\n       money.\n\n<b>                           ROACH\n</b>                 Hey, guys, I'm outta here.\n\n<b>                           DAY-DAY\n</b>                 Thanks for the help.\n\n<b>                           ROACH\n</b>                 Hey, man, the pleasure's all mine.\n                 Thanks for the dog, and the money.  Maybe\n                 my dad won't kick my ass tonight.\n\n<b>                           DAY-DAY\n</b>                 Call me.\n\n<b>                           ROACH\n</b>                 Okay, later, bro.  Hey, Craig, nice\n                 smokin' wit'cha.\n\n<b>                           CRAIG\n</b>                 You too.\n\n<b>                           MR. JONES\n</b>                 Smokin' what?\n\n<b>                           CRAIG\n</b>                 Nothing.\n\n<b>                           ROACH\n</b>                 Later, Mr. Jones.  Bye, Suga.\n\n<b>                           ALL\n</b>                 Bye, Roach.\n\n       Roach is gone.  Day-Day shuts the door.  Miss Ho Kym is\n       finished.  She steps off of Uncle Elroy.\n\n<b>                           MISS HO KYM\n</b>                 All done.  Stand up.\n\n       Uncle Elroy gets up.  He's better.\n\n<b>                           UNCLE ELROY\n</b>                 Hey, that George Jefferson shit works.\n                 Thanks, Miss Kym.\n\n       Uncle Elroy walks over to the table and grabs a stack of\n       hundred-dollar bills.  He hands it to Miss Ho Kym.\n\n<b>                           MISS HO KYM\n</b>                 I can't accept.\n\n<b>                           UNCLE ELROY\n</b>                 You better take this money.\n\n       She takes the money.\n\n<b>                           MISS HO KYM\n</b>                     (in Korean)\n                 Thank you.\n                     (in English)\n                 I can take a trip back to Korea now.\n                 Find a freak daddy, bring him back to\n                 America.  Make 'em my bitch.\n\n<b>                           SUGA\n</b>                 You go, girl.\n\n       Uncle Elroy helps Miss Ho Kym out the door.\n\n<b>                           MR. JONES\n</b>                 Well, we better hit the road, too.\n                 Craig, get your stuff.\n\n<b>                           UNCLE ELROY\n</b>                 Well, Craig, you're welcome anytime.\n\n       Suga hugs Craig.\n\n<b>                           SUGA\n</b>                 Yeah, baby, it's a shame you leavin'.\n                 Aunt Suga gonna miss yo.\n\n       And the others have to agree.\n\n<b>                           DAY-DAY\n</b>                 You sure you don't wanna stay?\n\n<b>                           CRAIG\n</b>                 Naw, I'm got live ghetto fabulous.  make\n                 sure you get that car fixed.\n\n<b>                           DAY-DAY\n</b>                 I will.  When can I come visit?\n\n<b>                           CRAIG\n</b>                 I don't know.  Probably next Friday.\n\n       They're out the door.\n\n<b>       EXT. UNCLE ELROY'S HOUSE - CONTINUOUS\n</b>\n       As we PULL BACK, all is well inside and outside Uncle Elroy's\n       house.  The suburbs are back to normal.  They get in the car.\n       Craig looks over at the Joker's house.\n\n<b>       ANGLE ON JOKER'S HOUSE\n</b>\n       Karla pulls up in the low-rider.  They lock eyes and she\n       blows him a kiss.  He gives her a wink.  They pull off.  She\n       goes in the house.\n\n<b>                           CRAIG (V.O.)\n</b>                 Well, all's well that ends well.  Another\n                 Friday gone.  Another problem solved.\n                 It's a trip to know that things can get\n                 crazy in the suburbs, too.  I can't wait\n                 to get back home...to the peace and quiet\n                 streets of South Central.\n\n       D'Wana's car pulls INTO FRAME.  She stops in front of Uncle\n       Elroy's house.  Baby'D jumps out with a brick.  She throws it\n       through the back window of Day-Day's BMW.  She jumps back in\n       and they're gone...\n\n<b>                                                           THE END.\n</b>\n</pre>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Next Friday</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Ice Cube\" title=\"Scripts by Ice Cube\">Ice Cube</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Next Friday Script.html#comments\" title=\"Next Friday comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:12:25.464954"}