{"title": "Office Space", "film_link": "/Movie Scripts/Office Space Script.html", "script_link": "/scripts/Office-Space.html", "info_raw": "\n\nOffice Space Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.81 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Mike Judge\nGenres  Comedy\nScript Date : December 1997\n\nRead \"Office Space\" Script\n\n\n", "script": "\n\n\n \n                                OFFICE SPACE\n\n\n\n                              Transcribed by\n\n                                 Jean Liew\n\n\n\n[Scene: A highway. There's a huge traffic jam. Peter drives forward a \nbit at a time and he sees an old man with a walker on the sidewalk. The \nlane next to his is moving, so he switches lanes, only to have it stop \nand the lane he was on move. He switches back and then it happens \nagain. The old man is now ahead of him.]\n\nCut to Michael, who's rapping along with the radio. A black guy selling \npapers walks by and he shuts the windows and turns down the volume. He \npasses and he turns it back up again.\n\nCut to Samir. He grabs the steering wheel and shakes it in frustration.\n\nSAMIR\nMotherf - shit - sonofa - ass!! I just -\n\nHe hits the steering wheel.\n\nCut to Milton at a bus stop. TN\n\nHe mumbles his coming lines, as he does with all his lines.\n\nMILTON\nIt's late again. If I'm there late again, I will be dismissed.\n\n[Scene: Initech parking lot. Bill drives into his special spot. \n(Reserved for Bill Lumbergh) He turns on the alarm for his Porsche \n(license plate: MY PRSHE) and walks in. Peter walks in too.]\n\nCut to inside. Peter pauses at the door and slowly reaches out to touch \nthe metal handle. It gives him a shock and he enters.\n\nCut to the cubicles. Peter goes into his. He picks up papers, turns on \nthe computer and sits down.\n\nNINA\nCorporate Counsels Payroll, Nina speaking. Just a moment.\n\n(repeats that over and over)\n\nBill comes up to Peter.\n\nBILL\nHello, Peter. What's happening? Uh\u0085 we have sort of a problem here. \nYeah. You apparently didn't put one of the new coversheets on your TPS \nreports.\n\nPETER\nOh, yeah. I'm sorry about that. I, I forgot.\n\nBILL\nMMMM..YEAH. YOU SEE, WE'RE PUTTING THE COVERSHEETS ON ALL TPS REPORTS \nNOW BEFORE THEY GO OUT. DID YOU SEE THE MEMO ABOUT THIS?\n\nPETER\nYeah. Yeah. Yeah. I've got the memo right here, but, uh, uh, I just \nforgot. But, uh, it's not shipping out until tomorrow, so there's no \nproblem.\n\nBILL\nYeah. If you could just go ahead and make sure you do that from now on, \nthat will be great. And Uh, I'll go ahead and make sure you get another \ncopy of that memo Mmmm, Ok?\n\nHe walks away.\n\nPETER\nYeah, yeah, I've got the memo, I've got -\n\nHe picks it up but Bill's at another cubicle.\n\nBILL\nHello, Phil. What's happening?\n\nPeter tries to read his papers, but a loud radio (news) is bothering \nhim. He stands up and sees it's Milton.\n\nPETER\nMilton? Uh, could you turn that down just a little bit?\n\nMILTON\nUh, they said I could listen to the radio at a reasonable volume from \nnine to eleven while I'm collating\u0085.\n\nPETER\nBut, no, no, no. I know you're allowed to, I was just thinking, like a \npersonal favor, y'know?\n\nMILTON\nI, I told Bill that if Sandra's going to listen to her headphones while \nshe' working, I can listen to the radio while I'm collating -\n\nPETER\nOk.\n\nMILTON\nSo I don't see why -\n\nPETER\nOk.\n\nMILTON\nThe radio, I can't -\n\nPETER\nYeah! All right!\n\nHe sits down.\n\nMILTON\nI enjoy listening to the radio at a reasonable volume from nine to \neleven.\n\nDom walks up.\n\nDOM\nHello, Peter. What's happening?  (Big smile)We need to talk about your \nTPS reports.\n\nPETER\nYeah. The coversheet. I know, I know. Uh, Bill talked to me about it.\n\nDOM\nYeah. Uh, did you get that memo?\n\nPETER\nYeah. (holds it up) I got the memo. And I understand the policy. The \nproblem is, I just forgot this time. And I've already taken care of it \nso it's not a problem anymore.\n\nDom nods.\n\nDOM\nYeah. It's just that we're putting new coversheets on all the TPS \nreports before now before they go out now. So I'd really appreciate it \nif you could just remember to do that. from now on. That'd be great.\n\nHe walks away. Peter's phone rings and he answers it.\n\nPETER\nPeter Gibbons. (listens) Yes. (listens) I have the memo.\n\n[Scene Another part of the room. Paper jams in the printer.]\n\nSAMIR\nOh no! Not again! Why does it say paper jam when there is no paper \njam?!! I, I swear to God, one of these days, I, I, I just kick this \npiece of shit out the window!!!\n\nMICHAEL\nyou and me both, man. The thing is lucky I'm not armed.\n\nSamir grabs the paper out, tearing off the bottom part of it.\n\nSAMIR\nPiece of shit!!\n\nNina comes with papers.\n\nNINA\nSam...ire...Na...Na...Naga...\n\nSamir gets it.\n\nNINA\nUh-huh!\n\nSAMIR\nPlease.\n\nHe sits in his and Michael's cubicle.\n\nNINA\nMichael\u0085 - (Michael reaches for it) Bolton?\n\nMICHAEL\nThat's me.\n\nNINA\nWow! Is that your real name?\n\nMICHAEL\nYeah.\n\nNINA\nSo are you related to the singer guy?\n\nMICHAEL\nNo, it's just a coincidence.\n\nSAMIR\nHow come no one in this country can pronounce my name right? It's Na-\ngee-een-ah-jah. Nagaenajar\n\nMICHAEL\nAt least your name isn't Michael Bolton.\n\nSAMIR\nMichael, there's nothing wrong with that name.\n\nMICHAEL\nThere was nothing wrong with it. Until I was about nine years old and \nthat no-talent assclown became famous and started winning Grammys.\n\nSAMIR\nWell, why don't just go by Mike, instead of Michael?\n\nMICHAEL\n WHY SHOULD I CHANGE IT? HE'S THE ONE WHO SUCKS.\n\nPeter comes up to their cubicle.\n\nPETER\n HEY GUYS.\n\nMICHAEL\nWhat's up G?\n\nPETER\nWanna go to Chotchkie's, get some coffee?\n\nSAMIR\nIt's a little early...\n\nPETER\nI gotta get out of here. I think I'm gonna lose it.\n\nNINA\nUh oh. Sounds like somebody's got a case of the Mondays.\n\n[Scene Chotchkie's. They're sitting at a booth thing.]\n\nPETER\nBoy. I tell ya, one of these days... One of these days it's gonna be \nlike\n\nHe mimics a machine gun. Brian, a waiter, does it too, in Peter's face.\n\nBRIAN\n(LAUGHS) \nSO CAN I GET YOU GENTLEMEN SOMETHING MORE TO DRINK? OR MAYBE SOMETHING \nTO NIBBLE ON? SOME PIZZA SHOOTERS, SHRIMP POPPERS, OR EXTREME FAJITAS.\n\nPETER\nJust coffee.\n\nBRIAN\nOh. Sounds like a case of the Mondays.\n\nHe goes to take some more orders.\n\nPETER\nWhat if we're still doing this when we're 50?\n\nSAMIR\nIt could be nice to have that kind of job security.\n\nPETER\nLumbergh's gonna have me work on Saturday, I, I can tell already. I'm \ndoing it because, because, uh, I'm a big pussy. Which is why I work at \nInitech to begin with.\n\nMICHAEL\nUh, I work at Initech and I don't consider myself a pussy, ok?\n\nSAMIR\nYes, I am also not a pussy.\n\nMICHAEL\nI'm gonna find out the hard way that I'm not a pussy if they don't \nstart treating us software people better.\n\nSAMIR\nThat's right.\n\nMICHAEL\nThey don't understand. I could come up with a program that could rip \nthat place off big time\u0085big time.\n\nPETER\nYeah.\n\nCut to Joanna, a pretty waitress.\n\nCut back to the guys.\n\nPETER\nOh, there she is.\n\nSAMIR\nPeter, you, you always talk about this girl. If you're so obsessed with \nher, why don't you just ask her out?\n\nPETER\nBecause I'm just another asshole customer. You can't just walk up to a \nwaitress and ask her out. \n(cut to Joanna, and back to them) \nPlus, I'm still trying to work it out with Anne. Oh, that reminds me. \nI'm not going to be able to play poker with you guys on Friday.\n\nMICHAEL\nWhy not?\n\nPETER\nUh, I have to see this occupational hypnotherapist with Anne.\n\nMICHAEL\nDude! An occupational hypnotherapist?!\n\nPETER\nAnne wants me to go. She thinks it might help. Y'know, sometimes I just \nthink, I keep thinking that she's cheating on me.\n\nMICHAEL\nYeah. I know what you mean.\n\nSAMIR\nYeah.\n\nPETER\nWhat is that supposed to mean?\n\nMICHAEL\nNothing. Why don't you just tell Anne you're not into hypnosis and you \nwant to play poker with us?\n\nPETER\nAh, I can't do that. She might get all pissed off at me. Besides, I \nthink the guy might be able to help. He did help Anne lose weight.\n\nSAMIR\nPeter, she's anorexic.\n\nPETER\nYeah, I know. The guy's really good.\n\nMICHAEL\nAn occupational hypnotherapist isn't going to help you solve any of \nyour problems. And speaking of problems, what's this I hear about you \nhaving problems with your TPS reports?\n\nSAMIR\nYeah. Didn't you get that memo?\n\nPeter sighs.\n\n[Scene Outside Initech. Tom, another employee, runs across the street, \ntowards Samir, Peter and Michael.]\n\nTOM\nHey! Hey, guys! Samir!!\n\nSAMIR\nIs that Tom Smykowski?\n\nPETER\nWhat's he doing?\n\nMICHAEL\nOh, probably working on another heart attack.\n\nTOM\nHave you guys see this?\n\nHe hands them a piece of paper.\n\nMICHAEL\nWhat? It's the staff meeting. So what?\n\nTOM\nWe're all screwed, that's what. They're gonna downsize Initech.\n\nSAMIR\nOh, what are you talking about Tom? How do you know that?\n\nTOM\nThey're bringing in a consultant - that's how I know. That's what this \nstaff meeting is all about! That's what happened at Initrode last year. \nYou have an interview with a consultant and they bring in efficiency \nexperts. You're interviewing for your own job!\n\nMICHAEL\nTom, every week you say you're losing your job and you're still here.\n\nTOM\nI'm going to be the first one they're gonna lay off. Just the thought \nof having to go to the State Unemployment Office and having to stand in \nline with those scumbags!!!\n\n[Scene Michael and Samir's cubicle. They're sitting there worrying.]\n\nMICHAEL\nShit. Shit.\n\nTOM\nYou know there are people in this world who don't have to put up with \nall this shit? Like that guy that invented the pet rock. You see, \nthat's what you have to do. You have to use your mind and come up with \nsome really great idea like that and you never have to work again!\n\nMICHAEL\nI don't think the pet rock was really such a good idea.\n\nTOM\nThe guy made a million dollars! Y'know\u0085 I had an idea like that once.\n\nPETER\nReally? What was it, Tom?\n\nTOM\nWell, all right. It was a Jump\u0085 to Conclusions-mat. You see, it would \nbe this mat that you would put on the floor and it would have different \nconclusions written on it that you could\u0085jump to.\n\nMICHAEL\nThat is the worse idea I've ever heard in my life, Tom.\n\nSAMIR\nYes, yes, it's horrible\u0085this idea\u0085.\n\nTOM\nAh, look. I, I gotta get outta here. I'll see you guys later, if I \nstill have a job.\n\nHe goes to his cubicle.\n\nPETER\nOur high school guidance counselor used to ask us what you would do if \nwe had a million dollars and didn't have to work. And invariably, \nwhatever we would say, that was supposed to be our careers. If you \nwanted to build cars, then you're supposed to be an auto mechanic.\n\nSAMIR\nSo what did you say?\n\nPETER\nI never had an answer. I guess that's why I'm working at Initech.\n\nMICHAEL\nNo, you're working at Initech because that question is bullshit to \nbegin with. \n(The printer is not working) \nIf that quiz worked, there would be no janitors, because no one would \nclean shit up if they had a million dollars.\n\nSAMIR\nWell, I would invest half of it in ??? Mutual Funds and give the rest \nof it to my friend, Saheib, in Securities.\n\nMICHAEL\nSamir, the point of the exercise is that you could figure out what you \nwant to do. And then\u0085\n(reads the printer's display) \n\"PC load letter\"?!! What the fuck does that mean?!!\n\nHe knocks off the paper tray.\n\n[Scene Peter's apartment. He enters, tired, and sits down on the couch. \nHe then turns on the TV.]\n\nLAWRENCE\n(V/O, FROM NEXT DOOR) \nHEY PETER-MAN! CHECK OUT CHANNEL NINE! IT'S THE BREAST EXAM! CHECK OUT \nTHIS CHICK!\n\nPETER\nLawrence, can't you just pretend like we can't hear each other through \nthe wall?\n\nLAWRENCE\nOh! I'm sorry man, is Anne over there or something?\n\nPETER\nNo! But if you just want to talk to me, just come over.\n\nLawrence does so; it takes him like ten seconds.\n\nLAWRENCE\nHey man. Check this out, dude.\n\nHe changes channels a bunch of times\n\nPepsi commercial, a soap opera and another show. He stops on breast \nexam.\n\nPETER\nOh geez, Lawrence.\n\nLAWRENCE\nI'm sorry, man. I thought you'd wanna see this. Doesn't this chick look \nlike Anne?\n\nPETER\nYeah, a little bit.\n\nLAWRENCE\nHey, she hasn't been over here in a while. You two still going out?\n\nPETER\nI guess, yeah. I, I don't know. Sometimes I get the feeling that she's \ncheating on me.\n\nLAWRENCE\nYeah, I get that feeling too, man.\n\nPETER\nWhat do you mean by that?\n\nLAWRENCE\nI don't know , man, I just get that feeling looking at her, like - I'm \nsorry, man. Look, I, I, I, I, I, I'm talking out of my ass. I don't \nknow.\n\nHe gets up.\n\nPETER\nIt's ok. I just had a rough day.\n\nLAWRENCE\nTell me about it, man. \n(sits on the couch)\n I gotta wake my ass up at six AM every day of this week and drag \nmyself up to Vascalinas. Yeah, I'm doing the drywall up there at the \nnew McDonalds.\n\nPETER\nLet me ask you something. When you come in on Mondays, and you're not \nfeeling too well, does anybody ever come up to you and say \"sounds like \nsomeone's got a case of the Mondays\"?\n\nLAWRENCE\nNo. No, man, shit, no, man. I believe you get your ass kicked for \nsayin' something like that, man.\n\nPETER\nHuh.\n\nLAWRENCE\nWe still going fishing this weekend?\n\nPETER\nNah. Lumbergh's gonna make me come in this Saturday. I know it.\n\nLAWRENCE\nWell, you can get out of that easily.\n\nPETER\nYeah, how?\n\nLAWRENCE\n(Gets up) \nWell, when you work on an Saturday, he generally asks you at the end of \nthe day, right? \n(gets a beer) \nSo all you have to do is avoid him \u0096 \n(peter offers him a bottle cap remover) \nThat's all right, i got one \u0096 \n(he gets on from his pocket) \nThe last few hours of the day. And turn off your answering machine, you \nshould be home free then.\n\nPETER\nThat's a really good idea. (sits on the couch) Lawrence, what would you \ndo if you had a million dollars?\n\nHe sits down.\n\nLAWRENCE\nI'll tell you what I'll do, man--Two chicks at the same time.\n\nPeter laughs.\n\nPETER\nThat's it? If you had a million dollars, that's what you'd do, two \nchicks at the same time?\n\nLAWRENCE\nDamn straight, man. I've always wanted to do that. I figure if I were a \nmillionaire, I could hook that up. Chicks dig guys with money.\n\nPETER\nWell not all chicks\u0085.\n\nLAWRENCE\nWell, the type that double up on a guy like me do.\n\nPETER\nGood point.\n\nLAWRENCE\nNOW, WHAT WOULD YOU DO?\n\nPETER\nBesides two chicks at the same time?\n\nLAWRENCE\nOh yeah.\n\nPETER\nNothing.\n\nLAWRENCE\nNothing, huh?\n\nPETER\nI would relax, I would sit on my ass all day, I would do nothing.\n\nLAWRENCE\nYou don't need a million dollars to do nothing, man. Take a look at my \ncousin. He's broke and don't do shit.\n\n[Scene Peter's room. He's in bed and he keeps hearing voices.]\n\nNINA\nCorporate payroll, Nina speaking. Just a moment. Corporate payroll, \nNina speaking. Just a moment. Corporate payroll, Nina speaking. Just a \nmoment.\n\nPeter buries his head in his pillow.\n\n[Scene The staff meeting. Peter's watch reads Friday 12, 10:37. \nEveryone's standing outside their cubicles. There's a banner that says \n\"Is This Good for the COMPANY?\"]\n\nBILL\nSo you should ask yourself, with every decision that you make (points \nto the banner) Is this good for the company? Am I helping the best way \nthat I can for the company...\n\nPETER\nIs that the guy?\n\nTOM\nYeah...\n\nBILL\nGood. Well, uh, I'd like to, uh, welcome a new member to our team. Uh, \nBob Slydell. Yeah. Uh, he is, uh, a consultant. Yeah. He is a \nconsultant. (Tom shakes his head) He'll be helping us out a little \nhere, asking some questions, making sure things go a little more \nsmoothly. Yeah. Oh and remember, next Friday is Hawaiian shirt day! So, \ny'know, if you want to, go ahead and uh, wear a Hawaiian shirt and \njeans.\n\n[Scene Milton's cubicle, under the banner. He's on the phone with \nPeter.]\n\nMILTON\nI, I don't care if they, if they lay me off either, because I, I told \nBill that if he moves my desk one more time, then, then I'm quitting. \nI'm going to quit. And I told Dom too because they've moved my desk \nfour times. I used to be by the window, where I could see the squirrels \nand they were merry. But then they switched from the Swingline to the \nBoston stapler, but I kept my Swingline. (he's holding his red \nSwingline) (Camera pans to Peter) They have my staples for the Boston \nand I kept the staples from the Swingline stapler.\n\nPETER\nOk, Milton.\n\nMILTON\nAnd if, if they take my stapler, I will, I will set this building on \nfire.\n\nPETER\nOh, that's great. I will talk to you later.\n\nHe hangs up and looks at his watch\n\n4:45. Peter looks around and sees Bill. He ducks and peeks to see Bill \ntalking with some workers. He quickly tries to save his files, but the \ncomputer is slower than he'd like. Bill is talking to other guys.\n\nPETER\nOh, come on! (it finished saving, but starts to save another file) Oh, \nfor crying out -!\n\nHe peeks over the wall again. The computer finally finished saving and \nhe turns it off. He peeks over the wall but Bill's not there. He gets \nready to leave and almost runs into Bill.\n\nBILL\nHello Peter. What's happening? Um, I'm gonna need you go ahead and come \nin tomorrow. So if you could be here around nine, that would be great. \n(starts to walk away) Oh, oh, yea\u0085I forgot. I'm gonna also need you to \ncome in Sunday too. We, uh, lost some people this week and we need to \nsorta catch up. Thanks.\n\n[Scene Outside the clinic. A sign says\n\nHypnotherapist; Dr. Swanson, CCS; Anxiety, Depression, Marriage, Weight \nLoss, Smoking, Insurance\n\nCut to inside. Anne is with Peter. Opposite them are Dr. Swanson and \ntwo other patients.\n\nPETER\nSo I'm sitting in my cubicle today and I realized that ever since I \nstarted working, every single day of my life has been worse than the \nday before it. So it means that every single day you see me, that's on \nthe worse day of my life.\n\nDR. SWANSON\nWhat about today? Is today the worse day of your life?\n\nPETER\nYeah.\n\nDR. SWANSON\nOh, that's bad stuff.\n\nPETER\nI'm sorry.\n\nDR. SWANSON\nOk.\n\nPETER\nBut is there any way that you, you could just sock me out so there's no \nway that I'll know I'm at work? Right here? (points to his head) Can I \njust come home and think I've been fishing all day or something?\n\nDR. SWANSON\nThat's really not what I do, Peter. However, the good news is, I think \nI can help you. I want you to do something for me, Peter. (dims the \nlights) I want you to try and relax. I want you to relax every muscle \nin your body, from your toes to your fingertips. Now I want you to \nrelax your legs. You're going to begin to feel your eyelids getting \nheavy as you slip deeper and deeper into a state of complete \nrelaxation. the air of concerns to you is disappearing. Deeper, way \ndown, your concerns about your job melts away. Way, way down. Now when \nI count backwards from three, you'll be in a state of complete \nrelaxation. your worries, cares and ambitions will be gone. And you \nwill remain in that state until I snap my fingers. Three. Deeper and \ndeeper. Way down, way down. Two. Way down. One.\n\nHe faints out of the chair and everyone rushes to his aid.\n\nANNE\nOh my God, Dr. Swanson! Ooh! Ooh! Is he dead? Oh!\n\nShe runs to get help. Peter just sits there and smiles. The hypnosis \nthing apparently worked...\n\n[Scene Peter's bedroom. Saturday morning, 8:00. His alarm clock beeps \nand he sits up. He looks at the clock and decides to go back to sleep.]\n\nCut to later. Peter's still asleep. The phone rings and the answering \nmachine picks up.\n\nBILL\nYah, hi. It's Bill Lundbergh. It's about ten o' clock, uh, wondering \nwhere you are.\n\nCut to later. Peter's still asleep. The phone rings again.\n\nBILL\nON MACHINE) YEAH, HI, IT'S BILL LUMBERGH AGAIN. I JUST WANTED TO MAKE \nSURE YOU KNEW THAT WE, UH, DID START AT THE, UH, USUAL TIME THIS \nMORNING. (PETER ROLLS OVER...) YEAH, IT ISN'T A HALF DAY OR ANYTHING \nLIKE THAT. SO IF YOU COULD GET HERE AS SOON AS POSSIBLE, THAT WOULD BE \nTERRIFIC.\n\nCut to later. Peter finally gets up. The answering machine has \nseventeen messages. He listens to them.\n\nBILL\nYeah, hi, it's Bill Lum -\n\nNext message\n\nBILL\nYeah, it's -\n\nNext message\n\nBILL\nYeah, hi, it's Bill Lumbergh -\n\nNext message\n\nBILL\nYeah, it's me again. Uh, I was away from my desk for a minute. Just \nchecking in case you called while I was gone.\n\nThe phone rings. Peter answers it.\n\nPETER\nHello?\n\nANNE\nPeter, what's going on?!\n\nPETER\nHuh?\n\nANNE\nIt's 3:30. Why aren't you at work?!\n\nPETER\nBecause I didn't feel like it.\n\nANNE\nPeter, what is wrong with you?! First, you sit there while Dr. Swanson \ndies and you just walk out of the car and embarrass me in front of my \nfriends. Don't blame this on hypnosis either. That's total bull!\n\nPeter hangs up but Anne calls back.\n\nANNE\nANSWERING MACHINE) LISTEN, ASSHOLE. NO ONE HANGS UP ON ME. WE'RE \nTHROUGH!!! AND \u0096HA- ONE MORE THING. I'VE BEEN CHEATING ON YOU!!!! (BEEP\n\nPeter gets back into bed.\n\n[Scene Initech. Another staff meeting.]\n\nBILL\nFrom now on, you use the time sheets if you work on two or more job \ncodes and you need the extra columns to fit it all in. Otherwise, use \nthe old time sheets...\n\nTOM\nWhere's Peter? How come he didn't show up this weekend?\n\nMICHAEL\nI, I don't know.\n\nBILL\n...it would really, really help us out.\n\nMICHAEL\nPOINTS) WHO'S THAT GUY?\n\nBILL\nSo, uh, any questions?\n\n[Scene Chotchkie's. Peter enters and goes up to Joanna at the counter.]\n\nPETER\nHi, I'm Peter.\n\nJOANNA\nHi. How can I help you?\n\nPETER\nWhat are you doing for lunch today?\n\nJOANNA\nWell, our specials are barbecued chicken - it's actually right over \nthere on the board. (points) Excuse me.\n\nShe goes to take orders.\n\nBRIAN\nHey! Look who's back! Table for three, to -\n\nPeter shoves him out of his way and goes over to Joanna.\n\nPETER\nI was asking what you were doing for lunch. Would you like to have \nlunch with me?\n\nJOANNA\nOh, are you serious? Yeah, I don't , I don't think I'm supposed to do \nthat.\n\nPETER\nOh. I'll tell you what I'm gonna do. I'm gonna go next door and get a \ntable and if you'd like to join me, no big deal. All right? And if not, \nthat's cool too. Ok?\n\nHe starts to walk away.\n\nJOANNA\nUh, when you say \"next door\", do you mean Chili's or Flingers?\n\nPETER\nFlingers.\n\nJOANNA\nOk.\n\n[Scene Initech. Bob Slydell and Bob Porter are interviewing Tom.]\n\nBOB SLYDELL\nSo what you do is you take the specifications from the customers and \nyou bring them down to the software engineers?\n\nTOM\nThat, that's right.\n\nBOB PORTER\nWell, then I gotta ask, then why can't the customers just take the \nspecifications directly to the software people, huh?\n\nTOM\nWell, uh, uh, uh, because, uh, engineers are not good at dealing with \ncustomers.\n\nBOB SLYDELL\nYou physically take the specs from the customer?\n\nTOM\nWell, no, my, my secretary does that, or, or the fax.\n\nBOB SLYDELL\nAh.\n\nBOB PORTER\nThen you must physically bring them to the software people.\n\nTOM\nWell...no. Yeah, I mean, sometimes.\n\nBOB SLYDELL\nWell, what would you say\u0085 you do here?\n\nTOM\nWell, look, I already told you. I deal with the goddamn customers so \nthe engineers don't have to!! I have people skills!! I am good at \ndealing with people!!! Can't you understand that?!? WHAT THE HELL IS \nWRONG WITH YOU PEOPLE?!!!!!!!\n\nCUT TO THE CUBICLES. TOM EXITS THE INTERVIEW ROOM AND MICHAEL ENTERS.\n\nCut to inside.\n\nBOB SLYDELL\nLet's see. You're Michael...Bolton?\n\nHe nods.\n\nBOB PORTER\nIs that your real name?\n\nMICHAEL\nYeah.\n\nBOB PORTER\nAre you in any relation to the pop singer?\n\nMICHAEL\nIt's just a coincidence.\n\nBOB SLYDELL\nLAUGHS) TO BE HONEST WITH YOU, I LOVE HIS MUSIC. I DO . I AM A MICHAEL \nBOLTON FAN. FOR MY MONEY, I DON'T THINK IT GETS ANY BETTER THAN WHEN HE \nSINGS WHEN A MAN LOVES A WOMAN. \n\nBOB PORTER\nI mean you must really love his music.\n\nMICHAEL\nYeah. Yeah\u0085he, he, he's pretty, he's pretty good, I guess.\n\nBOB SLYDELL\nYou're GOD DAMN right he is.\n\nThey laugh.\n\nBOB PORTER\nSo tell me. What's your favorite song of his?\n\nMICHAEL\nHmm. I, I, I don't know. I mean, I guess, I sorta like 'em all.\n\nThe Bobs laugh.\n\nBOB SLYDELL\nHA HA! I feel the exact same way, but it must be hard for you, I mean, \nhaving the same name as him. I celebrate the guy's entire catalogue. \nBut anyway, let's get down to business, Michael!\n\nMICHAEL\nYou, you know, you can just call me Mike.\n\nThey stare at him.\n\n[Scene Flingers. Peter is saving a table and Joanna enters.]\n\nJOANNA\nHi.\n\nPETER\nHey.\n\nJOANNA\nI wonder if they will let me wear this in here.\n\nPETER\nI think it would be ok. Would you like to sit down?\n\nHe motions to a chair.\n\nJOANNA\nOk. (does so) Wow. This place is really nice.\n\nPETER\nYeah, is it?\n\nJOANNA\nOh my God, compared to Chotchkie's. I like the uniforms better anyways.\n\nPETER\nI like yours.\n\nJOANNA\nNah. (makes a face\n\nPeter looks at the buttons' wearing on his suspender. One says We're \nnot in Kansas anymore. The one underneath says POOF.\n\nPETER\n\"We're not in Kansas anymore.\"\n\nJOANNA\nYeah. Really. (laughs\n\nPETER\nIt's on your - (points\n\nJOANNA\nOh! That's, uh, that's uh, my pieces of flair.\n\nPETER\nWhat are pieces of flair?\n\nJOANNA\nThat's where you know, suspenders and buttons and all sorts of stuff. \nWe're, uh, we're actually required to wear fifteen pieces of flair. \nquite stupid actually.\n\nPETER\nDo you get to pick them out yourself?\n\nJOANNA\nYeah. Yeah. Although I didn't actually choose these. I, uh, I just \ngrabbed fifteen buttons and, uh, I don't even know what they say! \nY'know, I don't really care. I don't really like talking about my \nflair.\n\nPETER\nOk.\n\nJOANNA\nSo, where do you work, uh, Peter?\n\nPETER\nInitech.\n\nJOANNA\nAnd, uh, what do you do there, Peter?\n\nPETER\nI sit in a cubicle and I update bank software for the 2000 switch.\n\nJOANNA\nNODS) WHAT'S THAT?\n\nPETER\nYou see, they wrote all this bank software and to save space, they put \n98 instead of 1998. So I go through these thousands of lines of code \nand uh, it doesn't really matter. I, uh, I don't like my job. I don't \nthink I'm gonna go anymore.\n\nJOANNA\nYou're just not gonna go?\n\nPETER\nYeah.\n\nJOANNA\nWon't you get fired?\n\nPETER\nI don't know. But I really don't like it so I'm not gonna go.\n\nJOANNA\nLAUGHS) SO YOU'RE GONNA QUIT?\n\nPETER\nNo, no, not really. I'm just gonna stop going.\n\nJOANNA\nWhen did you decide all that?\n\nPETER\nAbout a week ago.\n\nJOANNA\nReally?\n\nPETER\nOh, yeah.\n\nJOANNA\nOk. So, so you're gonna get another job?\n\nPETER\nI don't think I 'd like another job.\n\nJOANNA\nLAUGHS) SO WHAT ARE YOU GOING TO DO ABOUT MONEY AND BILLS?\n\nPETER\nY'know, I never really liked paying bill? I don't think I'll do that \neither.\n\nJOANNA\nLAUGHS) SO WHAT DO YOU WANT TO DO?\n\nPETER\nI want to take you out for dinner and then I wanna go to my apartment \nand watch Kung Fu. Did you ever watch Kung Fu? \n\nJoanna gets a weird look on her face.\n\nJOANNA\nI love Kung Fu...\n\nPETER\nChannel 39.\n\nJOANNA\nTotally...\n\nPETER\nYou should come over and watch Kung Fu tonight.\n\nJOANNA\nOk...\n\nPETER\nGreat.\n\nJOANNA\nOk. Can we order lunch first?\n\nPETER\nYeah.\n\nJOANNA\nOk.\n\n[Scene Milton's cubicle. He hears bill talking and eavesdrops.]\n\nBILL\n...stapler off my desk...\n\nMilton puts his Swingline stapler somewhere else. The guys laugh.\n\nBILL\n...anyway, sounds great, Bob. I'll see you in a few. (they walk off) \nHey, Milton, what's happening?\n\nMILTON\nUh...sir...\n\nBILL\nUh, I'm going to have to ask you to move your desk. Now, if you could \nget it to go as far back against that wall as possible, that would be \ngreat.\n\nMILTON\nNo, no, because I was, I was -\n\nBILL\nThat way, we'll have some room for more boxes and things we need to put \nin here.\n\nMILTON\nNo...sir...\n\nBILL\nUh (sees the Swingline) Oh there it is.\n\nMILTON\nNo. No.\n\nBILL\nLet me just get that from ya. (picks it up) Great. So if you could get \nto that as soon as possible, that would be terrific. Have a nice lunch, \nMilton. Bye.\n\nHe walks off.\n\nMILTON\nOk. I'll set the building on fire.\n\n[Scene Hallway at Initech. Peter enters in casual clothes. Milton walks \nup to him.]\n\nMICHAEL\nPeter!\n\nPETER\nMichael!\n\nMICHAEL\nWhat the hell's going on, man? I thought you were going to come in here \nand start shooting.\n\nPETER\nI just came to get my address book. I'm not gonna stay. I've got a \nnumber I don't wanna lose.\n\nMICHAEL\nWhat?! Peter, you're in deep shit! You were supposed to come in on \nSaturday. What were you doing?\n\nPETER\nMichael, I did nothing. I did absolutely nothing and it was everything \nthat I thought it could be.\n\nMICHAEL\nWell, I hope you have a better story than that for Lumbergh. You know, \nyou're supposed to be having your interview right now with the \nconsultants.\n\nPETER\nWho?\n\nHe writes down Joanna's number.\n\nMICHAEL\nWhat has gotten into you?\n\nPETER\nOh yeah. Right.\n\nMICHAEL\nPeter, Peter you, gotta postpone it man. Tell them you were sick. Make \nsomething up.\n\nPETER\nAh, no way. I feel great.\n\n[Scene The interview room.]\n\nBOB PORTER\nThe next paper looks like a Peter Gibbons.\n\nPeter enters.\n\nBOB SLYDELL\nAha! All right. We were just talking about you. You must be Peter \nGibbons. Uh huh. Terrific. I'm Bob Slydell and this is my associate, \nBob Porter.\n\nPETER\nHi, Bob. Bob.\n\nBOB PORTER\nWhy don't you grab a seat and join us for a minute?\n\nHe does so.\n\nBOB SLYDELL\nY'see, what we're trying to do here, we're just trying to get a feel \nfor how people spend their day. So, if you would, would you just walk \nus through a typical day for you?\n\nPETER\nYeah.\n\nBOB SLYDELL\nGreat.\n\nPETER\nWell, I generally come in at least fifteen minutes late. I use the side \ndoor, that way Lumbergh can't see me. Uh, and after that, I just sorta \nspace out for about an hour.\n\nBOB PORTER\nSpace out?\n\nPETER\nYeah. I just stare at my desk but it looks like I'm working. I do that \nfor probably another hour after lunch too. I'd probably, say, in a \ngiven week, I probably do about fifteen minutes of real, actual work.\n\nBOB SLYDELL\nUh, Peter, would you be a good sport and indulge us and tell us a \nlittle more?\n\nPETER\nLet me tell you something about TPS reports...'\n\nCut to later. Peter is more relaxed.\n\nPETER\nThe thing is, Bob, it's not that I'm lazy. It's just that I just don't \ncare.\n\nBOB PORTER\nDon't, don't care?\nPETER\nIt's a problem of motivation, all right? Now, if I work my ass off and \nInitech ships a few extra units, I don't see another dime. So where's \nthe motivation? And here's another thing, Bob. I have eight different \nbosses right now!\n\nBOB SLYDELL\nI beg your pardon?\n\nPETER\nEight bosses.\n\nBOB SLYDELL\nEight?\n\nPETER\nEight, bob. So that means when I make a mistake, I have eight different \npeople coming by to tell me about it. That's my real motivation - is \nnot to be hassled. That and the fear of losing my job, but y'know, Bob, \nit will only make someone work hard enough not to get fired.\n\nBOB SLYDELL\nBear with me for a minute.\n\nPETER\nOk.\n\nBOB SLYDELL\nBelieve me, this is hypocritical. But what if you were offered some \nkind of stock option and equity sharing program?\n\nPETER\nI don't know. I guess. Listen, I'm gonna go. It's been really nice \ntalking to be of you guys.\n\nHe shakes their hands.\n\nBOB SLYDELL\nAbsolutely. It's all on this side of the table, trust me.\n\nPETER\nGood luck with your layoffs. I hope your firings go really well.\n\nBOB SLYDELL\nWow.\n\nCut to the cubicle's. Peter walks past them and into the hall.\n\nBILL\nHey, Peter, what's happening? Listen, uh -\n\nPeter walks right past him.\n\n[Scene Chotchkie's]\n\nSTAN\nJoanna? Would you come here for a moment, please?\n\nJOANNA\nI'm sorry. I was late. I was having lunch.\n\nSTAN\nI need to talk about your flair.\n\nJOANNA\nReally? I have 15 buttons on. I, uh, (shows him\n\nSTAN\nWell, ok, 15 is minimum, ok?\n\nJOANNA\nOk.\n\nSTAN\nNow, it's up to you whether or not you want to just do the bare \nminimum. Well, like Brian, for example, has 37 pieces of flair. And a \nterrific smile.\n\nJOANNA\nOk. Ok, you want me to wear more?\n\nSTAN\nLook. Joanna.\n\nJOANNA\nYeah.\n\nSTAN\nPeople can get a cheeseburger anywhere, ok? They come to Chotchkie's \nfor the atmosphere and the attitude. That's what the flair's about. \nIt's about fun.\n\nJOANNA\nOk. So, more then?\n\nSTAN\nLook, we want you to express yourself, ok? If you think the bare \nminimum is enough, then ok. But some people choose to wear more and we \nencourage that, ok? You do want to express yourself, don't you?\n\nJOANNA\nYeah. Yeah.\n\nSTAN\nGreat. Great. That's all I ask.\n\nJOANNA\nOk.\n\n[Scene Conference room. Dom and Bill are talking to the two Bob's.]\n\nBOB SLYDELL\nRight. So there's three more people we can easily lose. There's Tom \nSmykowski.\n\nBILL\nHe's useless.\n\nBOB SLYDELL\nGone.\n\nDOM\nSounds good to me.\n\nBOB SLYDELL\nHere's a peculiar one. Milton Waddams.\n\nDOM\nWho's he?\n\nBOB\nYou know, squirrely looking guy, mumbles a lot.\n\nDOM\nOh.\n\nBOB SLYDELL\nWe can't find a record of him being a current employee here.\n\nBOB PORTER\nI looked into it more deeply and I found what happened was he got layed \noff about five years ago and no one ever told him about it. But through \na glitch in Payroll, he still gets a paycheck. I went ahead and fixed \nthe glitch.\n\nBILL\nGreat.\n\nDOM\nSo, um, Milton has been let go.\n\nBOB SLYDELL\nJust a second there, Professor. We, uh, we fixed the glitch. So he \nwon't be receiving a paycheck anymore. So it'll just work itself out \nnaturally.\n\nBOB PORTER\nWe always like to avoid confrontation whenever possible. The problem is \nsolved from here on, then.\n\nThey laugh.\n\nBOB SLYDELL\nUh, we should move on to a Peter Gibbons. I had a chance to meet this \nyoung man and boy does he have Straight to Upper Management written all \nover him.\n\nBILL\nOoh, uh, yeah. I'm going to have to go ahead and sort of disagree with \nyou there. Yeah. Uh, he's been real flaky lately and I'm not sure that \nhe's the caliber person you want for upper management. He's been having \nsome problems with his TPS reports.\n\nBOB PORTER\nI'll handle this. We feel that the problem isn't with Peter.\n\nBOB SLYDELL\nUm-um.\n\nBOB PORTER\nIt's that you haven't challenged him enough to get him really \nmotivated.\n\nBOB SLYDELL\nThere it is.\n\nBILL\nYeah, I'm not sure about that now.\n\nBOB PORTER\nAll right, Bill. Let me ask you this. How much time each week would you \nsay you deal with these TPS reports?\n\nBILL\nYeah...\n\n[Scene Peter parks in Bill's usual spot and goes into the building. He \ntakes a drill and removes the metal door handle.]\n\nCut to outside, where Bill has to park in the handicap spot.\n\nCut back inside. Peter tears down the banner.\n\nCut to outside. Bill's Porsche is being towed away. They only manage to \npull off the bumper.\n\nCut to Peter and Joanna watching Kung Fu. They're about to kiss.\n\nLAWRENCE\nHey Peter man! Check out channel nine! It's a breast exam! Whoo!!\n\nCut to Peter's cubicle. Bill checks his watch because Peter's still not \nthere.\n\nCut to a lake. Lawrence, Peter and Joanna are fishing. Peter holds up a \nbig fish.\n\nCut to Initech. Peter enters with an Igloo cooler.\n\nDOM\nHello, Peter.\n\nPETER\nHey Dom!\n\nHe slaps him on the back.\n\nCut to Peter's cubicle. He puts the fish on his desk and starts to gut \nit. He throws its entrails on a stack of TPS reports.\n\nCut to Peter and Joanna watching Kung Fu.\n\nCut to Peter removing the screws in the cubicle wall. He pushes it \nover. It reveals a window and Peter relaxes.\n\n[Scene Peter's cubicle, now with only one wall. he's playing Tetris as \nBill walks up.]\n\nBILL\nSo, Peter, what's happening? Now are you going to go ahead and have \nthose TPS reports for us this afternoon? (Peter keeps playing) Uh, \nyeah. So I guess we should probably go ahead and have a little talk, \nhmm?\n\nPETER\nNot right now, Lumbergh. I'm, I'm kinda busy. In fact, I'm going to \nhave to ask you to go ahead and just come back another time. I have a \nmeeting with the Bobs in a couple of minutes.\n\nBILL\nUh, I wasn't aware of a meeting with them.\n\nPETER\nYeah, they called me at home.\n\nBILL\nThat sounds good, Peter. Uh, and we'll go ahead and, uh, get this all \nfixed up for you later.\n\n[Scene Milton's cubicle. He's organizing papers.]\n\nMILTON\nF...C...P...\n\nBILL\nHi, Milton. What's going on?\n\nMILTON\nI, I, I, I, I didn't receive my paycheck this week.\n\nBILL\nUh, you're gonna have to talk to Payroll about that.\n\nMILTON\nI, I did and they, and they said -\n\nBILL\nUh, we're gonna need to move your desk downstairs into Storage B.\n\nMILTON\nNo...I...I...\n\nBILL\nUh, we have some new people coming in and we need all the space we can \nget.\n\nMILTON\nNo...no...no...no...but...but...but...I, I, I -\n\nBILL\nAnd if you could could go ahead and get a can of psticide and take care \nof the roach problem we've been having that would be great. (He walks \naway.\n\nMILTON\nI can't...Excuse me. I believe you have my stapler?\n\n[Scene The meeting between Peter and the two Bobs.]\n\nBOB PORTER\nIt looks like you've been missing a lot of work lately.\n\nPETER\nI wouldn't say I've been missing it, Bob.\n\nThey laugh.\n\nBOB SLYDELL\nThat's terrific, Peter. I,I, I'm sure you've, you've, you've heard some \nof the rumors around the hallway about how we're just going to do a \nlittle (finger quotes) housecleaning with some of the software people.\n\nPETER\nWell, Bob, I have heard that and you gotta do what you gotta do.\n\nBOB PORTER\nWell, these people here. First, Mr. Samir Naga...Naga...\n\nBOB SLYDELL\nNaga...\n\nBOB PORTER\nNaga-worker here anyway!\n\nThe Bobs laugh.\n\nBOB SLYDELL\nMr. Mike Bolton. We're certainly gonna miss him.\n\nPETER\nYou're gonna layoff Samir and Michael!?\n\nBOB PORTER\nWe're gonna bring in some entry level graduates for us to work in \nSingapore, that's the usual deal.\n\nBOB SLYDELL\nWell, it's standard operating procedure.\n\nPETER\nDo they know about this yet?\n\nBOB SLYDELL\nNo! No, of course not. We always find it's better to fire people on a \nFriday. It's statistically shown that there's less chance of an \nincident if we do it at the end of the week. Anyway, Peter, what we \nwould like to do is put you into a position where you would have as \nmany as four people working right underneath you.\n\nBOB PORTER\nThis is a big promotion, Pete.\n\nBOB SLYDELL\nHuge.\n\nPETER\nSo you're gonna fire Samir and Michael and give me more money?\n\nBOB SLYDELL\nUmm-hmm.\n\nPETER\nWow!\n\n[Scene Michael is messing with the printer.]\n\nMICHAEL\nYeah. Yeah. That's it. That's exactly what I need. Just give it to me. \nCome on. Come on, you little fucker. Let's go! That's what I need. \nLet's do that. Let's do exactly that, you little, fu-\n\nPeter walks up to him.\n\nPETER\nListen... Well, what are you doing tonight?\n\n[Scene Peter's place. Michael, Samir and Peter are there.]\n\nPETER\nThere comes a place in a man's life and, uh, maybe that time for you is \nnow, when it doesn't hurt to think about the future.\n\nMICHAEL\nUh, no offense, there, Peter, but think about yourself, sport. You're \nthe one who's been flaking out at work. Whatever that religious \nexperience or whatever the hell it was, you better snap out of it, or \nyou're gonna get canned.\n\nPETER\nYeah. I, I, I...Listen, that virus you're always talking about. The one \nthat, that could rip off the company for a bunch of money...\n\nMICHAEL\nYeah? What about it?\n\nPETER\nWell, how does it work?\n\nMICHAEL\nIt's pretty brilliant. What it does is where there's a bank \ntransaction, and the interests are computed in the thousands a day in \nfractions of a cent, which it usually rounds off. What this does is it \ntakes those remainders and puts it into your account.\n\nPETER\nThis sounds familiar.\n\nMICHAEL\nYeah. They did this in Superman III.\n\nPETER\nYeah. What a good movie.\n\nMICHAEL\nA bunch of hackers did this in the 70s and one of them got busted.\n\nPETER\nWell, so they check for this now?\n\nMICHAEL\nNo, you see, Initech's so backed up with all the software we're \nupdating for the year 2000, they'd never notice.\n\nPETER\nYou're right. And even if they wanted to, they could never check all \nthat code.\n\nMICHAEL\nIt's numbers up their asses.\n\nPETER\nSo, Michael, what's to keep you from doing this?\n\nMICHAEL\nIt's not worth the risk. I got a good job.\n\nPETER\nWhat if you didn't have a good job?\n\n[Scene A bar. Michael and Peter are there.]\n\nMICHAEL\nCockos! Samir and I are the best programmers in that place. And you, \nyou haven't even been showing up and you get to keep your job.\n\nPETER\nActually, I'm being promoted.\n\nMICHAEL\nWhat?!!!\n\nPETER\nYeah, I know, Michael. It's completely unfair. And I realized something \ntoday. It's not about me and my dream of doing nothing. It's about all \nof us together. I don't know what happened at that hypnotherapist the \nother day; maybe it was just shock. It's wearing off now, but when I \nsaw that fat man keel over and die, Michael, I realized that we don't \nhave a lot of time on this earth. We weren't meant to spend it this \nway. Human beings weren't meant to sit in little cubicles, starring at \ncomputer screens all day, filling out useless forms and listening to \neight different bosses drone on about mission statements.\n\nMICHAEL\nI told those fudge-packers that I like Michael Bolton's music. God.\n\nPETER\nthat is not right, Michael. For five years now, you've worked your ass \noff at Initech, hoping for a promotion or some kind of profit sharing \nor something. Five years of your mid-20s now, gone. And you're gonna go \nin tomorrow and they're gonna throw you out into the street. You know \nwhy? So Bill Lumbergh's stock will go up a quarter of a point. Michael, \nlet's make that stock go down. Let's take enough money from that place \nthat we never ever have to sit in a cubicle ever again. Your software \nworks right?\n\nMICHAEL\nOf course it works. That's not the point. Look, even if it could work, \nI don't know how to install it. I don't know the credit union software \nloan.\n\nPETER\nYeah? But Samir does.\n\n[Scene Peter's apartment. Samir's there, along with Michael and Peter.]\n\nSAMIR\nBut that's not much money, I -\n\nPETER\nThat's the beauty of it. Each withdrawal is a fraction of a cent. \nThat's too small to notice. Take a thousand withdrawals a day, space it \nout over a few years, that's a couple hundred thousand dollars.\n\nMICHAEL\nJust like Superman III.\n\nSAMIR\nSuperman III - that's it, I have to leave now, ok? (gets up) I have to \nget my resume ready.\n\nPETER\nGet your resume ready for what? Another job where they can fire you for \nno reason?\n\nSAMIR\nThat's right! If I'm lucky.\n\nPETER\nLook, I don't know about you guys, but I'm tired of being pushed \naround. Aren't you?\n\nSAMIR\nYes, Peter, but I'm not going to do something illegal.\n\nPETER\nIllegal? Samir, this is America! Come on, sit down! Come on! This isn't \nRiyadh! They're not gonna saw your hands off, all right? The worse they \ncan do is put you for a couple of months into a while collar, minimum \nsecurity resort! Shit, we should be so lucky! Did you know they have \nconjugal visits there?\n\nSAMIR\nReally.\n\nPETER\nYes.\n\nMICHAEL\nShit, I'm afraid. I haven't had a conjugal visit in six months.\n\nSAMIR\nSo what do you think?\n\nMICHAEL\nThis thing actually is pretty fail-safe, Samir.\n\nPETER\nYou came here looking for a land of opportunity. And this is the knock \nof that opportunity. Tomorrow's your last day at Initech. You have two \noptions\n\nunemployment or early retirement. What's it gonna be?\n\nSAMIR\nI have a question.\n\nPETER\nYes.\n\nSAMIR\nIn, in these conjugal visits, you can have sex with women?\n\nPETER\nYep. You sure can.\n\nSAMIR\nOk. I'm gonna do it.\n\nPETER\nThat's what I'm talking about! I'm talking about America!!\n\nMICHAEL\nPeter Let's discuss the plan, all right?\n\nPETER\nAll right.\n\nMICHAEL\nAll right. It works like a computer virus. All right? So all we have to \ndo is load it anywhere into the credit union mainframe and it'll do the \nrest.\n\nPETER\nOk, you guys give me that disk and I'll take it from there. Oh, but \nlisten. Before we go any further, all right, we have to swear to God, \nAllah, that nobody knows about this, all right? No family members, no \ngirlfriends, nobody!\n\nSAMIR\nOf course.\n\nMICHAEL\nAgreed.\n\nLAWRENCE\nDon't worry man! I won't tell anybody about this either!\n\nMICHAEL\nWho the fuck is that?!\n\nPETER\nUh, don't worry about him. He's cool. All right. Now here's how I see \nit all going down...\n\n[Scene Initech. Peter shakes the Bobs' hands.]\n\nBOB SLYDELL\nPeter, congratulations. This is one heck of a promotion.\n\nBOB PORTER\nAnd we'll go ahead and get some people under you right away.\n\n (They give a thumbs up.\n\n[Scene Samir and Michael's cubicle. They look at each other. Michael \ncopies the virus and looks around. He gives it to Samir. Samir walks by \nPeter and gives it to him. He puts it into his computer and copies the \nfile. He goes to Samir and Michael's cubicle.]\n\nMICHAEL\nWell, that was easy.\n\nPETER\nYeah, I guess it was.\n\nMICHAEL\nWhat did you do with the -\n\nDREW\nHey guys.\n\nPETER\nOh, hey Drew.\n\nDREW\ndid you guys hear about Tom Smykowski?\n\nMICHAEL\nThe guy who got laid off?\n\nDREW\nNo, man, check this out.\n\n[Flashback. Tom's getting drunk in his kitchen.]\n\nDREW\nV/O) LAST WEEK, AFTER HE FOUND OUT HE WAS GETTING LAID OFF, HE TRIES TO \nKILL HIMSELF BY RUNNING THE CAR IN THE GARAGE.\n\nCut to Tom in his car.\n\nMICHAEL\nV/O) IS HE DEAD?!\n\nDREW\nV/O) BUT THAT WIFE OF HIS COMES HOME EARLY FROM WORK EARLY AND FOUND \nHIM IN THE CAR AND TRIES TO PLAY IT OFF AS IF NOTHING HAPPENED.\n\nTOM\nCOUGH) I WAS HAVING SOME TROUBLE WITH THE SHIFTER HERE. IT'S JAMMED. I, \nI COULDN'T GET IT INTO DRIVE. I, I, I MEAN, REVERSE.\n\nMRS. SMYKOWSKI\nAre you ok, Tom?\n\nTOM\nYeah.\n\nDREW\nV/O) AND THEN, AS HE'S LOOKING AT HER, HE DECIDES HE WANTS TO LIVE.\n\nTOM\nI'm ok.\n\nMRS. SMYKOWSKI\nRight.\n\nTOM\nIt seems to be working now. See ya later, honey. Love ya.\n\nHe backs out.\n\nDREW\nV/O) BUT THEN AS HE BACKS OUT INTO HIS DRIVEWAY, HE'S SLAMMED BIG TIME \nBY A DRUNK DRIVER.\n\nWe hear a bang from behind the closing garage door.\n\nCut back to Initech, present.\n\nPETER\nWell, is he ok?\n\nDREW\nSort of. He broke both his wrists, his legs, a couple of ribs, his \nback. But check it out. He's gonna get a huge settlement out of this. \nLike seven figures. He's getting out of the hospital this weekend and \nhe's throwing a big party to celebrate. I'm thinking I'm gonna take \nthat new chick from Logistics. I might be showing her my O face. Oh! \nOh! Oh! you know what I'm talking about. Oh! Yeah. Right. See you guys \nthere.\n\n[Scene Peter's car. Samir and Michael are with him.]\n\nMICHAEL\nWow, our last day at Initech.\n\nSAMIR\nI can't believe they had security escort us out. Not like we're gonna \nsteal something.\n\nPETER\nI stole something.\n\nMICHAEL\nOh yeah. I guess we all did.\n\nPETER\nNo, I stole something else.\n\nSAMIR\nWhat did you steal?\n\nPETER\nWe'll call it a going away present.\n\n[Scene A field. They drop the printer. Samir stomps on it four times \nand Michael, eight times. Peter hands Samir a bat. He hits the printer \ntwice and Michael takes over. He starts to punch it. Samir and Peter \npull him away, but he runs back to destroy the evil printer.]\n\nCut to Peter's place. Samir's trying to break dance.\n\n[Scene Outside Peter's place.]\n\nPETER\nEverything is going to be ok. Ok?\n\nSAMIR\nThe one I see is -\n\nPETER\nI can see this working. I gotta go. I gotta go. Joanna's coming over. \nDon't worry! You're worrying! All right? Monday morning we're gonna \ncheck the account balance and everything will be all right. Don't miss \nTom's barbecue. I'll see you there.\n\nPeter goes inside.\n\nSAMIR\nRAPPING) BACK UP IN YOUR ASS WITH THE RESURRECTION...\n\n[Scene Peter's place, morning. Joanna sees all the empty liquor \nbottles.]\n\nJOANNA\nHey, what were you guys celebrating last night?\n\nPETER\nUm, I'm not really at liberty to talk about it. I really can't.\n\n[Scene Peter's car. He and Joanna are going to the barbecue.]\n\nPETER\nSo when the subroutine compounds the interest, right, it uses all these \nextra decimals places that just get rounded off. So we just simplify \nthe whole thing and we just round it down and drop the remainder into \nan account that we own.\n\nJOANNA\nSo you're stealing.\n\nPETER\nAh, no. No. You don't understand. It's, uh, very complicated. It's, uh, \nit's, it's aggregate so I'm talking about fractions of a cent that, uh, \nover time, they add up to a lot.\n\nJOANNA\nOk. So you're gonna make a lot of money, right?\n\nPETER\nYeah.\n\nJOANNA\nOk. That's not yours?\n\nPETER\nWell, it, it becomes ours.\n\nJOANNA\nHow's that not stealing?\n\nPETER\nI don't think, I don't think I'm explaining this very well. Um, this \nSeven Eleven, right? If you take a penny from the tray -\n\nJOANNA\nFrom the crippled children?!\n\nPETER\nNo, that's the tray. I'm talking about the tray. The penny's for \neverybody.\n\nJOANNA\nOh, for everybody. Ok.\n\nPETER\nYeah, well, those are whole pennies.\n\nJOANNA\nYeah.\n\nPETER\nRight. I'm just talking about fractions of a penny here, but we do it \nfrom a much bigger tray. A couple of million times. So what's wrong \nwith that?\n\nJOANNA\nIt seems wrong.\n\nPETER\nIt's not wrong. Initech is wrong. Initech is an evil corporation, all \nright? Chotchkie's is wrong. Doesn't it bother you that you have to get \nup in the morning and put on pieces of flair?\n\nJOANNA\nYeah, but I'm not about to go in and start taking money from the \nregister!\n\nPETER\nYou know, the Nazis had pieces of flair but they made the Jews wear \nthem.\n\nJOANNA\nWhat?!\n\nPETER\nLook, we don't - I, I - we don't have to talk about this. Let's just go \nto the barbecue, all right?\n\nJOANNA\nOk.\n\n[Scene Tom's house. Samir and Michael open the front door. tom is in a \nfull body cast and is hooked up to a bunch of stuff.]\n\nTOM\nMichael! Samir! How are you doing?\n\nMICHAEL\nHiya Tom.\n\nSAMIR\nHi Tom.\n\nTOM\nYeah, I'd like you to meet my lawyer, Rob Newhouse. (they shake hands) \nRob, Michael.\n\nROB\nHello Michael.\n\nTOM\nSamir.\n\nROB\nHello -\n\nSAMIR\nSamir.\n\nROB\n...Samir.\n\n (Peter and Joanna enter.\n\nTOM\nPeter!! How are ya? I'm glad you could make it.\n\nPETER\nTom! Hi! This is someone I'd like you to meet. This is Joanna.\n\nJOANNA\nHi.\n\nTOM\nHi. Forgive me for not getting up. (He starts laughing and everyone \njoins in nervously) Ooh...Ooh... Uh, Peter, Peter, come here a minute. \nI want to show you something.\n\nThey go into the kitchen. There's a Jump to Conclusions mat. It says \n??? ; Jump Again ; Strike Out ; Could be ; Loose one Turn ; Yes! ; No! \n; Accept it ; Go wild ; One step back ; Think Again ; Moot! On the \nbottom are footprints, under the word Start\n\nTOM\nWell, what do you think? It's a prototype.\n\nPETER\nWell, that's exactly as you described it. Uh, listen, I, I heard about \nyour settlement. Congratulations.\n\nTOM\nWell, thanks, Peter. y'know, I'm glad you're here because I wanted to \ntalk to you. I know how you get depressed about your job and all, and I \njust wanted you to know that's how you feel. I used to be the same way.\n\nPETER\nReally?\n\nTOM\nSure. Oh maybe I didn't whine as much, but I hated my job as much as \nyou and I've been doing good for over thirty years!\n\nPETER\nWow.\n\nTOM\nJust remember\n\nIf you hang in there long enough, good things can happen. I mean, look \nat me.\n\nHe laughs.\n\nPETER\nThanks Tom.\n\nTOM\nAw, sure.\n\n[Scene The backyard. Samir and Michael are talking to Rob.]\n\nROB\nConjugal visits? Not that I know of. Now, a minimum security prison is \nno picnic. I have a client in there right now. You see, the trick is, \nkick someone's ass the first day or become someone's bitch. Then \neverything will be all right. Why do you ask, anyway?\n\nMICHAEL\nOh, no, we were just seeing -\n\nHis cup flies out of his hand and ice cubes go everywhere.\n\nCut to Peter and Drew.\n\nDREW\nHey Peter.\n\nPETER\nDrew.\n\nDREW\nThat's something about old Tom Smykowski, huh?\n\nPETER\nYeah.\n\nDREW\nLucky bastard. (sees Joanna) Hey, isn't that the girl who works over at \nChotchkie's?\n\nPETER\nYeah.\n\nDREW\nHmm, who's she here with?\n\nPETER\nShe's here with me.\n\nDREW\nReally?\n\nPETER\nYeah.\n\nDREW\nAll right, Peter! Ooh! Ooh! Right on. Make sure you wear a rubber, \ndude.\n\nPETER\nWhy's that, Drew?\n\nDREW\nAre you kidding me? She gets around, all right?\n\nPETER\nShe does, does she?\n\nDREW\nOh yeah. Like a record.\n\nJoanna waves.\n\nPETER\nWith who?\n\nDREW\nWell, let's see. Lumbergh fucked her. Ah, let me see who else...\n\nPETER\nLumbergh?!\n\n[Scene Peter's car. He and Joanna are leaving the party.]\n\nJOANNA\nOh, what if you get caught? Oh, I, I, I, I just don't know if this is \nsuch a good idea.\n\nPETER\nANGRY) YEAH? WELL, MAYBE IT WASN'T SUCH A GOOD IDEA FOR YOU TO SLEEP \nWITH LUMBERGH!\n\nJOANNA\nWhat?! What are you - Oh! All right, Lumbergh...\n\nPETER\nARGH!!! AH GOD! LUMBERGH!!\n\nJOANNA\nPeter! What is wrong with you? That was like to years ago! What, do you \nknow him?\n\nPETER\nYeah, I know him!! I know him! He's my boss!! He's my unholy, \ndisgusting, pig of a boss!!\n\nJOANNA\nOh, he's not that disgusting.\n\nPETER\nHe represents all that is solace and wrong! And you slept with him!\n\nJOANNA\nThat is none of your business, ok? I didn't ask you who you slept with \nbefore we were together. I don't care!\n\nPETER\nWell, I didn't think you would sleep with a guy like Lumbergh!\n\nJOANNA\nListen to you! Who do you think you are? How dare you judge! Do you \nthink you're an angel or something? No! You're this petty, stealing, \nwannabe criminal...man!\n\nPETER\nWell, I may be. But at least I never slept with Lumbergh!!\n\nJOANNA\nOk. That's it. I'm done. I want to get out of the car. Stop. I wanna \nget -\n\nPETER\nFine.\n\nHe stops and Joanna gets out.\n\nJOANNA\nWhy don't you call me when you grow up? Oh, wait, that's probably never \ngonna happen so just don't call me, all right?\n\nPETER\nSay hello to Lumbergh for me!!!\n\nShe slams the door and he drives off.\n\n[Scene Peter's room. He's having nightmares again.]\n\nDREW\nLumbergh fucked her...Lumbergh fucked her...Lumbergh fucked her...\n\nBILL\nOh that's great\u0085great\u0085\n\nDREW\nI'm gonna see the O-face again. Oh! Oh! Oh! Ooh! Ooh!\n\nThat dissolves into Bill, naked, holding a foot in one hand a cup of \ncoffee in the other.\n\nBILL\nWhy don't you move it a little to the left? That's right. Great. Oh, \nhello, Peter. What's happening? Uh, could you give me those TPS reports \nASAP? Mmmkay?\n\nPeter wakes up and breathes deeply.\n\n[Scene Chotchkie's. Stan approaches Joanna.]\n\nSTAN\nJoanna?\n\nJOANNA\nYeah?\n\nSTAN\nWe need to talk. Do you know what this is about?\n\nJOANNA\nMy, uh, flair.\n\nSTAN\nYeah. Or, uh, your lack thereof. I'm counting and I only see fifteen \npieces. Let me ask you a question, Joanna.\n\nJOANNA\nUmm-hmm.\n\nSTAN\nWhat do you think of a person who only does the bare minimum?\n\nJOANNA\nHuh. What do I think? Let me tell you what I think, Stan. If you want \nme to wear thirty-seven pieces of flair like your pretty boy Brian over \nthere, then why don't you just make the minimum thirty-seven pieces of \nflair?\n\nSTAN\nWell, I thought I remember you saying you wanted to express yourself.\n\nJOANNA\nYeah. Yeah. Y'know what? I do. I do want to express myself. Ok? And I \ndon't need thirty-seven pieces of flair to do it. (gives him the \nfinger) All right? There's my flair! And this is me expressing myself. \n(holds up her hand) There it is! I hate this job! I hate this goddamn \njob and I don't need it!!\n\nShe storms out.\n\n[Scene An ATM machine. Peter gets out a receipt that says he has \n$305,326.13]\n\n [Scene Peter's car. Samir and Michael have obviously seen the \nreceipt.]\n\nSAMIR\nShit, shit, shit, shit. Son of a bitch! Shit! This is a - fuck! Son of \na bitch! Shit!\n\nMICHAEL\nWhat happened?\n\nPETER\nYou tell me, Michael, it's your software!\n\nSAMIR\nYes, it's your software!\n\nPETER\nCorporate accounting is sure as hell going to notice 305, 3 (grabs the \nreceipt) 26.13!! Michael!!\n\nMICHAEL\nOh shit! They, they probably won't notice it's gone for another two or \nthree days.\n\nPETER\nMichael! Michael! You said the thing was gonna take two years!\n\nSAMIR\nWhat happened?!\n\nPETER\nYou said the thing was supposed to work.\n\nMICHAEL\nWell, technically it did work.\n\nPETER\nNo it didn't!\n\nSAMIR\nIt did not work, Michael, ok?!\n\nMICHAEL\nOk! Ok!\n\nSAMIR\nOk?!\n\nMICHAEL\nOk! Ok! I must have, I must have put a decimal point in the wrong place \nor something. Shit. I always do that. I always mess up some mundane \ndetail.\n\nPETER\nOh! What is this fairly mundane detail, Michael?!!!!!\n\nMICHAEL\nOk quit getting pissed at me, all right? This was all your idea, \nasshole.\n\nPETER\nAll right. Ok. All right. Let's try not to get pissed off at each \nother, all right? We'll figure this thing out together, ok? And the \nfirst thing we gotta do is we gotta close that account down before it \ngets any bigger.\n\n[Scene Initech. It's Bill's 41st birthday. All the employees are \nsinging the birthday song to him in a flat monotone. He blows out the \ncandles and everyone claps.]\n\nALL\nMmm. You look terrific. (etc\n\nBILL\nAll right, Kate, you wanna get everybody started there. (he gets a \nslice of cake) Mmm. That is terrific. That is just terrific. I really, \nreally appreciate it.\n\nA slice is handed to Milton.\n\nNINA\nMilton, don't be greedy. Let's pass it along and make sure everyone \ngets a piece.\n\nMILTON\nCan I keep a piece? Because last time I was told that -\n\nNINA\nJust pass.\n\nHe does so.\n\nMILTON\nBut this, this, it, it, it's a little cake...\n\nEveryone gets a piece and Nina gets the last one. Milton has to watch \neveryone enjoy their piece.\n\n[Scene Peter's apartment. They're trying to figure out what to do.]\n\nSAMIR\nIs, is there a way to just give the money back?\n\nPETER\nWhat? We just hand them a check with the exact amount they're missing? \nI, I think they'd figure that out.\n\nSAMIR\nWell, we have to do something.\n\nMICHAEL\nMay-maybe we launder the money.\n\nPETER\nThat's a great idea. Ok, how do we do that?\n\nMICHAEL\nI don't know, I don't know. I don't even know what it means. It's \nsomething I think, I think coke dealers do.\n\nPETER\nOk. Do we know any coke dealers?\n\nMICHAEL\nMy, my cousin's a cokehead. We're in deep shit.\n\nSAMIR\nYes. We are in very, very deep shit.\n\n[Scene Milton's new \"office\" - the basement. Bill enters with a piece \nof cake.]\n\nBILL\nMilton?\n\nMILTON\nYes.\n\nBILL\nWhat's happening?\n\nMILTON\nI wanted to see you because -\n\nBILL\nSay, you know what would be a great idea?\n\nMILTON\nNo...no.\n\nBILL\nSince you're already down here, it would be great if you could get a ca \nof pesticipe and take care of the cockroach problem we've been having \nin here.\n\nMILTON\nI...I...that's really not my job and I haven't received my -\n\nBILL\nFor now, why don't you get a flashlight and a can of pesticide and -\n\nDom enters.\n\nDOM\nBill! We need you upstairs right away. Some major glitch in the \naccounting. A lot of money missing.\n\nThey go upstairs and Bill turns off the light.\n\nMILTON\nExcuse me? Excuse me? Ok, that's the last straw.\n\n[Scene Peter's place. Michael is looking up \"money laundering\" in the \ndictionary.]\n\nMICHAEL\nLAUNDERING. TO CLEAN...NO, UH, HERE IT IS. TO CHANNEL MONEY THROUGH A \nSOURCE OR BY AN INTERMEDIARY.\n\nSAMIR\nIt doesn't really help us, Michael.\n\nPETER\nOk. We're looking up money laundering in a dictionary.\n\nMICHAEL\nYeah, well, you guys can both eat my ass, ok?\n\nPETER\nMy girlfriend slept with Lumbergh, that's what I can't believe.\n\nSAMIR\nYeah, you didn't know that?\n\nMICHAEL\nIt happened two years before you moved to Atlanta.\n\nPETER\nYou mean, Ron Lumbergh, the airshow guy?\n\nMICHAEL\nYeah, who did you think she slept with, Bill? (He and Samir start \nlaughing) If she fucked him, their children would have hooves!\n\nPETER\nRon's not related to Bill, is he?\n\nSomeone rings the doorbell.\n\nMICHAEL\nWho is it?\n\nHe hides the checks while Peter goes to the door.\n\nPETER\nDon't panic. It's probably just the mailman.\n\nHe opens the door.\n\nSTEVE\nMONOTONOUSLY) HELLO SIR. MY NAME IS STEVE. I CAME FROM A ROUGH AREA. I \nUSED TO BE ADDICTED TO CRACK BUT NOW I'M OFF AND TRYING TO STAY CLEAN.\n\nPETER\nOk.\n\nSTEVE\nThat is why I am selling magazine subscriptions.\n\nPETER\nNo -\n\nSTEVE\nI was hoping you would help me out.\n\nMICHAEL\nWait, wait, wait, wait! You used to be addicted to crack?\n\nSTEVE\nYes, but not anymore.\n\nCut to later. They've got Steve in an armchair, trying to get him to \nhelp.\n\nSTEVE\nLook, I'm sorry. I do not know anything about money laundering.\n\nMICHAEL\nLook, we're not asking you if you know about money laundering, we're \njust trying to see if you can hook us up.\n\nPETER\nHe doesn't know anything, all right?\n\nSAMIR\nWait, wait, wait a minute. Wait a minute. You just give us the name of \none drug dealer. I could talk to him. I have good networking skills.\n\nSTEVE\nNORMAL) I LIED. ALL THAT STUFF ABOUT ME BEING A CRACKHEAD WAS TO HELP \nME SELL MAGAZINES. I'M A SOFTWARE ENGINEER.\n\nPETER\nYou're a software engineer?!\n\nSAMIR\nWorking must be, must be very hard for you.\n\nSTEVE\nI made more money selling magazine subscriptions than I ever did \nworking at Initrode.\n\nMICHAEL\nHuh? You worked at Initrode?\n\nPETER\nYou can't tell anybody about any of this stuff I told you. I mean, we \nknow a lot of the same people.\n\nSTEVE\nActually, that all depends.\n\nHe holds up his clipboard.\n\nCut to later. Peter closes the door.\n\nPETER\nWhat am I going to do with forty subscriptions to Vibe ?\n\nMICHAEL\nI wish we had never done this. What are we going to do? You know what I \ncan't figure out? How is it that all these stupid, Neanderthal, Mafia \nguys can be so good at crime and smart guys like us can suck so badly \nat it?\n\nSAMIR\nWe're new to it, though. If we had more experience -\n\nMICHAEL\nNo. No. Y'know what I think? I think we're screwed. There's evidence \nall over that building to link it to us. Even if we could launder \nmoney, I wouldn't want to. If we're caught while laundering money, \nwe're not going to go to white-collar-resort-prison. No, no, no. We're \ngonna go to federal-reserve-pound-me-in-the-ass-prison.\n\nSAMIR\nI don't want to go to any prison! Why the hell did I do this?! I've \nnever done anything wrong in my whole life! We weren't thinking clearly \nbecause you told us we were losing our jobs! And look at us now, we're, \nwe're worried about going to prison!\n\nPETER\nDon't worry about it. I'll think of something.\n\nSAMIR\nAss. I'm going home. You are a very bad person, Peter.\n\nSamir and Michael leave. Peter knocks on the wall.\n\nPETER\nLawrence! You awake?\n\nLAWRENCE\nYeah, man!\n\nPETER\nYou wanna come over?\n\nLAWRENCE\nNo thanks, man. I don't want you fucking up my life too!\n\n[Scene Peter's room. He dreams that they're in court, with Rob as their \nlawyer.]\n\nJUDGE\nAnd now the sentence for these heinous crimes committed against \nInitech. I hereby sentence you, Michael Bolton and Samir \nNa...Ananajibad...to a term of no less than four years in federal-\npound-me-in-the-ass-prison. Peter Gibbons, you've lead a trite and \nmeaningless life. And you're a very bad person.\n\nThe judge bangs the gavel and Peter wakes up.\n\n[Scene The living room. Peter is up, feverishly writing a confession. \nHe tears it out and puts it into an envelope with the checks.]\n\n[Scene Flingers parking lot. Peter sits on the hood of his car, trying \nto figure out what to do. Joanna comes out.]\n\nJOANNA\nHey.\n\nPETER\nHey. You're not working at Chotchkie's anymore.\n\nJOANNA\nNo, no, I got fired.\n\nPETER\nWhat happened?\n\nJOANNA\nI flipped off my boss. And some customers - actually a line just \nhappened to be standing there, so...\n\nPETER\nI'm going to go away for awhile. Uh, to jail. Yea, about that computer \nscam, you were right\u0085it was a bad idea. I'm going to take the blame for \nit, I decided. I'm going to return the money and leave the confession \nunder Lumbergh's door. Joanna, I wanna apologize. I had no right to get \npissed off at you, Lumbergh isn't my problem. It wasn't even the right \nLumbergh. I don't know why I can't just go to work and be happy, like \nI'm supposed to like everybody else.\n\nJOANNA\nPeter, most people don't like their jobs. But you go out there and find \nsomething that makes you happy.\n\nPETER\nYeah. I may never be happy with my job. But if I could be with you, I \nthink that I could be happy with my life. But if you could give it \nanother shot, I promise, Joanna -\n\nJOANNA\nOh shut up.\n\nThey hug and kiss.\n\nBRIAN\nHey, what's going on here? Get a room you two!\n\nHe makes an annoying noise and gives them the finger.\n\nJOANNA\nI hate that guy.\n\n[Scene Initech. Peter drives up.]\n\nCut to inside. Peter sticks the envelope under the door of William \nLumbergh, Division Vice President. He walks away but frantically runs \nback and tries to get the envelope. He can't reach it and finally gives \nup.\n\n[Scene Initech. Morning. Milton is talking to an secretary. Lumbergh \nhasn't gotten to work yet.]\n\nMILTON\n...to Mr. Lumbergh and he told me to talk to Payroll and then Payroll, \nthey told me to talk to Mr. Lumbergh. And I still haven't gotten my \npaycheck and they stole my stapler and they told me to move my desk to \nStorage Room B and there was garbage all over it and I don't appreciate \nthat.\n\nSECRETARY\nUm, why don't you go and sit at your desk. Mr. Lumbergh should be here \nany minute.\n\nMILTON\nMr. Lumbergh -\n\nSECRETARY\nJust go and sit at your desk.\n\nMILTON\nBut -\n\nSECRETARY\nOh?\n\nMILTON\nOk, I, I, I'm going to set the building on fire. I tell him, if I don't \nget my stapler (the secretary leaves) I'm going to have to get my \nstapler back because it is my stapler. (he goes into Mr. Lumbergh's \noffice) It's my stapler, the Swingline. It's been mine for a very long \ntime.\n\n[Scene Peter's room. He's packing his clothes. He goes outside and \nknocks on Lawrence's door.]\n\nPETER\nHey, Lawrence, are you there?\n\nLAWRENCE\nHey, Peter, man.\n\nPETER\nHey. So, I may be going away for awhile.\n\nLAWRENCE\nYeah, I know, man. It's a bummer, dude, what can I say?\n\nPETER\nYeah. Well, it's time to go face the music. You take care of yourself, \ncause I don't wanna see ya.\n\nThey shake hands.\n\nLAWRENCE\nYou too, man. Take care. (Peter starts to leave) Hey Peter! Watch out \nfor the corn hole ok?\n\nPETER\nOk, Lawrence.\n\n[Scene Peter's car. He's driving along when he sees something.]\n\nCut to Initech. It's on fire, big time. Peter joins the crowd of his \nco-workers and watches. Milton walks away quickly. A structure falls \nand Peter laughs.\n\nCut to inside, a burning cubicle.\n\n[Scene The burned ruins of Initech. Peter is now a construction worker, \nworking alongside Lawrence. Lawrence digs up Milton's burnt Swingline.]\n\nPETER\nLet me see this.\n\nLAWRENCE\nWho would want that stapler, man? That's toasted, man.\n\nPETER\nI know someone who might want this.\n\nA car horn beeps. Michael and Samir step out of the car.\n\nMICHAEL\nHey man! Wanna go out to lunch?\n\nPETER\nI brought mine in a pail. Plus, Joanna's supposed to come by later.\n\nSAMIR\nSo, how do you like your new job?\n\nPETER\nIt's not too bad. Not too bad. How's Penetrode?\n\nMICHAEL\nInitrode.\n\nPETER\nInitrode.\n\nSAMIR\nIt's work.\n\nPETER\nYeah. Yeah.\n\nMICHAEL\nI could probably get you a job if you want.\n\nPETER\nNo, thanks. I'm doing good here.\n\nMICHAEL\nSo, uh, we're gonna be ok, right?\n\nPETER\nYeah. I think the fire pretty much took care of everything.\n\nSAMIR\nBut what if the money burned up? It's too be a scheme.\n\nPETER\nYeah...\n\nSAMIR\nAre you sure you don't want us to get you a job?\n\nPETER\nThat's the one thing I'm definitely sure of.\n\nMICHAEL\nAll right, G.\n\nPETER\nYou guys take care!\n\nSAMIR\nOk.\n\nMICHAEL\nStay in touch, man!\n\nPETER\nOk, will do. (They get in the car and leave) This isn't so bad, huh? \nMaking bucks, getting exercise, working outside.\n\nLAWRENCE\nFuckin' A.\n\nPETER\nFuckin' A...\n\n[Scene\n\nA beach. Milton is relaxing and a waiter comes up to him.]\n\nMILTON\nExcuse me. Excuse me, Senor. May I speak to you please? I asked for a \nmai tai, a margarita, and a pina colada. I asked for no salt, no salt \nin the margarita. But it had salt in it. (the waiter leaves) If you do \nthat again, I won't be leaving a tip. I won't be putting one down. Sir? \nI could check into a competing resort...\n\nEND\n\n\n\n\nOffice Space\nWriters :   Mike Judge\nGenres :   Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:27.786377"}