{"title": "One Flew Over the Cuckoo's Nest", "film_link": "/Movie Scripts/One Flew Over the Cuckoo's Nest Script.html", "script_link": "/scripts/One-Flew-Over-the-Cuckoo's-Nest.html", "info_raw": "\n\nOne Flew Over the Cuckoo's Nest Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Bo Goldman  Lawrence Hauben  Ken Kesey\nGenres  Drama\n\nRead \"One Flew Over the Cuckoo's Nest\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nOne Flew Over The Cuckoo's Nest \n\n\n\nEXT. WORK FARM - NIGHTFALL\n\nAll we SEE is an ELEVATED SHOT of the distant mountains,\nrolling landscape and McMURPHY -- one cheek laid-open and\ncrusted over with dried blood, his face and prison work\nclothes caked with dried sweat and dust -- as he sits on the\nvery top of a water tower watching the last rays of sunlight.\n\nA long moment passes before McMurphy's attention is drawn\nelsewhere and he looks down.\n\nREVERSE SHOT - McMURPHY'S POV\n\nFar below, in the prison yard a MAN is SEEN hurrying acrcss\nthe yard where he joins a group of men composed of armed\nprison guards, officials, and medics -- a stretcher, an\nambulance, a fire truck and safety nets spread out at the\nbase of the water tower. The man is seen talking to the\nofficials, then a bullhorn is handed to him and they all look\nup at McMurphy.\n\nMcMURPHY\n\nAs he looks down at them, a searchlight is turned on him.\n\n\t\t\tMAN (V.O.)\n\t\t(through bullhorn)\n\tMcMurphy! This is Doctor Shankle,\n\tfrom the infirmary. Can you hear\n\tme?\n\nMcMurphy doesn't respond.\n\n\t\t\tSHANKLE (V.O.)\n\t\t(through bullhorn)\n\tCan you hear me, McMurphy?\n\nMcMurphy doesn't respond. Another searchlight goes on as a\nSECOND VOICE is PICKED UP on the BULLHORN.\n\n\t\t\tSECOND VOICE\n\t\t(through bullhorn)\n\tWhy don't we blast 'im, for Christ\n\tsake, he ain't gonna come down...\n\tyou...\n\nThe BULLHORN is TURNED OFF. A long moment passes as McMurphy\ncontinues to squat on the tower and wait. He shivers against\nthe coming night when...\n\n\t\t\tSHANKLE (V.O.)\n\t\t(through bullhorn)\n\tMcMurphy!\n\tI have the warden's promise. If you\n\tcome down, nobody will hurt you!\n\tYou'll be in my custody! I promise!\n\nAn imperceptible smile appears on McMurphy's face.\n\nINT. MEN'S DORM - OREGON STATE HOSPITAL - DAWN\n\nStrange HUMMING SOUNDS, CLANKING PIPES and HISSING RADIATORS\nas we see beds, with patients lying asleep, line two walls.\nThe third wall is a heavy gauge steel grill, with a door that\nopens on to the day room. The door is open. On the far side\nof the day room, a long hallway with other doors opening into\nrooms: the latrine, washroom, tub room, mess hall, seclusion\nroom, psychiatrist's office, visitors' room, etc.\n\nAcross the day room, a glass enclosed nurses' station where\nTURKLE, a Negro night attendant, is seen preparing to go off\nduty.\n\nThe CAMERA PANS the beds in the men's dorm. One man turns,\nanother twists, a third lies as if dead.\n\nCAMERA PAN ENDS on BROMDEN, who lies still, eyes wide open,\nvery alert. He reaches down, plucks a stale piece of gum from\nunder the bed frame, puts it in his mouth and starts chewing.\n\nA beat, then Bromden carefully undoes the leather strap which\nbinds him to the bed. He slips out of bed and quietly makes\nhis way down the aisle, paying no attention to the other\npatients, some of who are beginning to stir awake.\n\nAhead, at the end of the hallway, the door opens and three\nNegro day attendants, WASHINGTON, WARREN and MILLER, dressed\nin white uniforms, enter and move down the hallway and\ndisappear into a side room.\n\nBromden continues his silent journey towards the day room as\nTurkle emerges from the side door to the nurses' lounge, goes\nup the hallway as MISS PILBOW, the day nurse, comes in,\npassing Turkle on the way out. She crosses to the nurses'\nstation and enters as Bromden reaches the day room.\n\nINT. DAY ROOM - DAY\n\nas Bromden makes his way across the day room, past the\nnurses' station, unnoticed by Miss Pilbow who is busy\npreparing the day's medication.\n\nBromden is sliding along the hallway wall, when he is\nsuddenly cut off by a mop which THUDS against one side of his\nneck. A second mop yokes him on the other side. Bromden\nfreezes. Terrified.\n\n\t\t\tMILLER\n\tWhere you goin', Chief?\n\n\t\t\tWARREN\n\tYou goin' t'see the Big White\n\tFathuh?\n\n\t\t\tWASHINGTON\n\tHe goin' t'see the Big White\n\tMuthuh...\n\nThey cackle, legs jiving, as the ammonia stings Bromden's\neyes and burns his nose. He tries to twist his head, but\nWashington jams the mop harder. Bromden freezes, panic\nspreading across his face.\n\n\t\t\tWASHINGTON (CONT'D)\n\tHaw, look at 'im, big 'nough to eat\n\tapples off my head an' he mine me\n\tlike a baby...\n\nA KEY is HEARD hitting the lock in the main door. Washington\nvery adroitly releases Bromden, hands him the mop, and turns,\nalong with Warren and Miller, to their duties, as BIG NURSE\nenters the ward.\n\n\t\t\tTHREE ATTENDANTS\n\t\t(simultaneously, as Big\n\t\tNurse passes)\n\tMornin', Miss Ratched...\n\n\t\t\tBIG NURSE\n\tGood morning, boys.\n\nShe sweeps by and disappears into the nurses' station. The\nthree attendants put their mops and rags aside and start\ntowards the men's dorm, leaving Bromden pressed against the\nwall, mop in hand.\n\nINT. NURSES' STATION\n\nas Big Nurse enters to be greeted by Miss Pilbow, who wears\nan enormous cross between her breasts.\n\n\t\t\tMISS PILBOW\n\tGood morning, Miss Ratched. It's a\n\tbeautiful day, isn't it?\n\n\t\t\tBIG NURSE\n\tMean old Monday, Miss Pilbow, mean\n\told Monday...\n\t\t(she flips on the\n\t\tintercom)\n\tGood morning, boys. Rise and shine.\n\tRise and shine.\n\nINT. MEN'S DORM - DAY\n\nas Washington, Warren and Miller roust the patients out of\nbed.\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(through loudspeaker)\n\tTime to get up! Come on now, it's a\n\tbeautiful day! Let's not straggle!\n\tEverybody up, up, up!\n\nThe Chronics are physically helped out of bed as the Acutes,\nwho can handle themselves, cross out into the Day Room,\nrubbing the sleep out of their eyes. Big Nurse steps out of\nthe Nurses' Station. Washington and Warren are hustling the\npatients toward the washroom.\n\nMiller stays behind, stripping Blastic's bed and rolling up\nhis mattress.\n\nINT. DAY ROOM - DAY\n\nas the Acutes straggle past Big Nurse.\n\n\t\t\tBIG NURSE\n\tGood morning, Mister Sefelt... Good\n\tmorning, Mister Fredrickson. Good\n\tmorning, Billy, I spoke to your\n\tmother last night and she sends her\n\tlove... Good morning, Mister\n\tHarding... Good morning, Mister\n\tCheswick. Mister Scanlon...\n\nBromden comes drifting by, going in the opposite direction.\nBig Nurse takes his hand and reaches up and pats his face.\n\n\t\t\tBIG NURSE (CONT'D)\n\tOh, Mister Bromden...\n\t\t(calling out)\n\tMister Washington!\n\nWashington comes running.\n\n\t\t\tWASHINGTON\n\tYes, Miss Ratched?\n\n\t\t\tBIG NURSE\n\tMister Washington, why don't we get\n\ta good head start on the day by\n\tshaving Mister Bromden and see if\n\twe can't avoid a disturbance.\n\n\t\t\tWASHINGTON\n\t\t(taking Bromden by the\n\t\thand)\n\tYes, Miss Ratched...\n\nINT. WASHROOM - DAY\n\nThe patients are busy washing and shaving.\n\nWarren is assisting a vegetable wash himself as Washington\nguides Bromden through a cage-like partition... where an\nantique barber chair stands.\n\n\t\t\tWASHINGTON\n\t\t(calling as he goes)\n\tWarren!\n\nHe sits Bromden down and straps his bands and legs in, then\nplugs the electric shaver in and turns it on and brings the\nBUZZING instrument towards Bromden's face. Bromden turns\naway.\n\n\t\t\tWASHINGTON (CONT'D)\n\t\t(shouting out)\n\tGet your black ass in here!\n\nWarren props the vegetable up against the sink.\n\n\t\t\tWARREN\n\tTha's it... be right back!\n\nWarren leaves; the old man starts sliding.\n\n\t\t\t\t\tQUICK CUT TO:\n\nBROMDEN\n\nas Warren enters and takes a firm grip on Bromden's head and\nWashington goes to work on Bromden's face. CAMERA PUSHES INTO\nEXTREME CLOSEUP of Bromden's fearfully distorted face as the\nBUZZING SOUND of the electric razor INTENSIFIES until it is\nINSUPPORTABLE.\n\n\t\t\t\t\tQUICK CUT TO:\n\nINT. DAY ROOM - DAY\n\nNo sound as we SEE Big Nurse watch the last few patients file\npast the side door to the Nurses' Station where Miss Pilbow\nhands out little cups with pills. Washington stands by,\nchecking to see each man takes his pills before filling their\ncups with orange juice.\nThe last patient takes his pills and returns to his place in\nthe Day Room. Miss Pilbow closes the window.\n\nSatisfied that all is well, Big Nurse turns on an old 45\nrecord player with a stack of records, then she settles down\nto her work as a SOFT, NOSTALGIC NUMBER from the '40's is\nHEARD OVER LOUDSPEAKER. CAMERA BEGINS SLOW PAN of the Day\nRoom.\n\nThe patients, under the influence of drugs, have settled down\nfor the day. HARDING is playing cards with MARTINI, CHESWICK\nand BILLY. SEFELT and FREDRICKSON are putting a jigsaw puzzle\ntogether in brotherly love. SORENSEN is off by himself,\nrubbing his hands clean. TABER, pencil in hand, sits\npondering over a blank piece of paper. SCANLON paces back and\nforth. On the Chronics' side of the room, RUCKLY is turning a\ngrimy photograph over in his hands. BANCINI sits wagging his\nhead, mumbling over and over, \"Tired, awful tired...\" ELLIS\nstands against the wall, arms outstretched, hands nailed to\nthe wall by imaginary nails.\n\nBromden is pushing a mop around. \n\nWashington, Warren and Miller are in the men's dorm making up\nthe Chronics' beds when O.S. the TELEPHONE RINGS.\n\n\t\t\t\t\tCUT TO:\n\nINT. NURSES' STATION - DAY\n\nas Miss Pilbow picks up the phone.\n\n\t\t\tMISS PILBOW\n\tEighty-two, Miss Pilbow speaking...\n\tYes...\n\t\t(she makes a note and\n\t\thangs it)\n\t... New admission, Miss Ratched...\n\nMiss Pilbow goes to the mirror, quickly preens herself, then\nturns and flips the intercom on.\n\n\t\t\tMISS PILBOW (CONT'D)\n\t\t(over loudspeaker)\n\tMister Washington! Mister Warren!\n\nShe exits.\n\n\t\t\t\t\tCUT TO:\n\nINT. DAY ROOM\n\nas Miss Pilbow exits nurses' station and heads down the\nhallway, Washington and Warren on her heels. Miller looking\nwistfully after them.\n\n\t\t\t\t\tCUT TO:\n\nINT. MAIN ENTRANCE - STATE HOSPITAL - DAY\n\nStaff personnel are SEEN moving in and out of the main\nentrance where a state penitentiary car is parked. A DEPUTY\nSHERIFF leans on the fender smoking a cigarette as SECOND\nDEPUTY SHERIFF comes out of the building and motions down to\nFirst Deputy, who crushes his cigarette out, then opens the\nrear door to the car.\n\n\t\t\tDEPUTY SHERIFF\n\t\t(to an unseen occupant)\n\tOkay, let's go.\n\nA long beat, then McMurphy slowly emerges from the car. He's\nwearing handcuffs and dressed in faded jeans, flannel work\nshirt, leather jacket, black motorcycle cap, and heavy black\nboots. He's been scrubbed clean and has a Band-Aid on his\ncheek. McMurphy does a couple of knee bends to get the kinks\nout of his legs as Deputy reaches in the car and takes out a\nsmall gym bag containing McMurphy's belongings.\n\n\t\t\tDEPUTY SHERIFF (CONT'D)\n\tLet's move it...\n\nMcMurphy goes up the stairs, followed by the Deputy, and\ncrosses into the building.\n\nINT. MAIN BUILDING - DAY\n\nas McMurphy enters the building followed by the Deputies,\nwhere Nurse Pilbow, McMurphy's folder in hand, and Washington\nand Warren stand waiting -- all in a pleasant, receptive\nmood. First Deputy hands McMurphy's gym bag to Washington,\nwho hands it to Warren.\n\n\t\t\tSECOND DEPUTY\n\tOkay, this is it!\n\nMcMurphy turns and holds out his hands. As cuffs are removed,\nMcMurphy impulsively takes hold of the Deputy's head and\nplants a kiss on his forehead.\n\n\t\t\tSECOND DEPUTY (CONT'D)\n\t\t(squirming out of\n\t\tMcMurphy's grasp)\n\tJesus, you're crazy, McMurphy.\n\n\t\t\tMCMURPHY\n\tYeah, ain't that the truth.\n\n\t\t\tDEPUTY SHERIFF\n\t\t(to Miss Pilbow)\n\tHe's all yours, Miss.\n\n\t\t\tMISS PILBOW\n\tThank you, Officer...\n\nThe two Deputies start down the stairs.\n\n\t\t\tMCMURPHY\n\tSo long, fellas...\n\nThe two Deputies merely shrug their backs at McMurphy who\ntakes a deep breath of fresh air.\n\n\t\t\tMCMURPHY (CONT'D)\n\tYes, sir, it's a mighty nice fall\n\tday...\n\n\t\t\tMISS PILBOW\n\tThis way, Mister McMurphy.\n\n\t\t\tMCMURPHY\n\tYes, ma'am...\n\nMcMurphy follows Nurse Pilbow into the hallway as the door\ncloses behind them.\n\n\t\t\t\t\tCUT TO:\n\nINT. HALLWAY - DAY\n\nOther STAFF MEMBERS are administrative personnel are SEEN as\nMcMurphy walks alongside Nurse Pilbow, who is noticeably\nnervous by his close proximity. Washington and Warren\ncasually bringing up the rear.\n\n\t\t\tMCMURPHY\n\t\t(as he peels the Band-Aid\n\t\toff, revealing a scar)\n\tI tell ya, these goons showered me\n\tat the courthouse this morning,\n\tlast night at the jail, and I swear\n\tthey'd have swabbed my ears out on\n\tthe way over if they could've found\n\tthe facilities...\n\nA young Japanese nurse, named ITSU, passes by.\n\n\t\t\tMCMURPHY (CONT'D)\n\t\t(to Nurse Itsu)\n\tHey, how ya doin', cutie?\n\n\t\t\tNURSE ITSU\n\tOkay. How you doing?\n\n\t\t\tMCMURPHY\n\tJust great!\n\t\t(calling after her)\n\tSee ya around!\n\nNurse Itsu laughs and disappears around the corner.\n\n\t\t\tMCMURPHY (CONT'D)\n\t\t(to Nurse Pilbow)\n\tYes, sir, I sure am gonna enjoy my\n\tstay here.\n\n\t\t\tMISS PILBOW\n\tI'm sure you will.\n\n\t\t\tMCMURPHY\n\t\t(to Nurse Pilbow)\n\tYa know, I ain't never been in an\n\tinstitution of psychology before.\n\n\t\t\tMISS PILBOW\n\tOh...\n\nThey arrive at the ward door. Nurse Pilbow unlocks the door\nand opens it as...\n\n\t\t\tMCMURPHY\n\tYeah, I'm here on a ninety-day\n\tobservation period. Short-timer,\n\tlike they say...\n\nSoft nostalgic MUSIC is HEARD OVER.\n\n\t\t\tMISS PILBOW\n\tOf course.\n\t\t(indicating door)\n\tMister McMurphy.\n\n\t\t\tMCMURPHY\n\tAfter you, ma'am.\n\n\t\t\tMISS PILBOW\n\tThank you.\n\nNurse Pilbow enters the ward and McMurphy watches her cross\nthe visitors' area to a heavy-gauge steel screen wall, with\nsecurity gate which she opens.\n\n\t\t\tMCMURPHY\n\t\t(to Washington and Warren\n\t\tas they step into ward)\n\tMan, there sure is an awful lot of\n\tpoontang around here.\n\n\t\t\tSPIVEY\n\t\t(calling)\n\tHold it!\n\nMcMurphy turns to see DOCTOR SPIVEY approaching.\n\n\t\t\tSPIVEY (CONT'D)\n\tGood morning, boys.\n\n\t\t\tWASHINGTON AND WARREN\n\t\t(simultaneously as Spivey\n\t\tpasses into the ward)\n\tMornin', Doctor Spivey.\n\n\t\t\tSPIVEY\n\tGreat day for fishing.\n\n\t\t\tWASHINGTON AND WARREN\n\t\t(simultaneously)\n\tYes, sir!\n\nThe door closes. CAMERA HOLDS on sign that READS: \n\nSMILE AT THE NEXT FACE YOU SEE. IT MAY SAVE HIS LIFE.\n\n\t\t\tMCMURPHY (O.S.)\n\tYeah, I was just thinking the same\n\tthing, Doc...\n\n\t\t\t\t\tCUT TO:\n\nINT. WARD - DAY\n\nas McMurphy, Spivey, Washington and Warren cross the\nvisitors' area towards Nurse Pilbow, who stands holding the\nsecurity gate open. At the far end of the hallway, which\nopens into the day room, patients can be seen.\n\n\t\t\tSPIVEY\n\t\t(to McMurphy)\n\tOh, what's that?\n\n\t\t\tMCMURPHY\n\tWhy, I'll betcha there must be a\n\tmillion albacore and tuna running\n\tof the coast right this minute.\n\n\t\t\tSPIVEY\n\tOh, do you do much fishing?\n\nAs they pass through the security gate:\n\n\t\t\tMCMURPHY\n\tFish! Hell, Doc, I'd like to have a\n\tnickel for every fish I landed\n\tbetween Point Conception and the\n\tAlaska coast...\n\nWashington and Warren continue down the hallway, passing\nSEFELT, who shyly approaches and waits at a respectful\ndistance.\n\n\t\t\tSPIVEY\n\t\t(to McMurphy)\n\tIs that so?\n\n\t\t\tMCMURPHY\n\tYup! Worked right outta Depoe Bay\n\tfor just about every season since I\n\twas able to haul my own weight.\n\n\t\t\tSPIVEY\n\tMy, my... Ah, who are you?\n\n\t\t\tMCMURPHY\n\tMcMurphy, Doc. R.P. McMurphy.\n\nThey shake hands.\n\n\t\t\tNURSE PILBOW\n\tMister McMurphy is a new admission.\n\n\t\t\tSPIVEY\n\tAh, yes. Well, we must talk soon,\n\tMister McMurphy.\n\n\t\t\tMCMURPHY\n\tYou bet, Doc.\n\nSpivey turns to Sefelt.\n\n\t\t\tSPIVEY\n\tGood morning, Jim. How are you\n\tfeeling?\n\n\t\t\tSEFELT\n\t\t(approaching and pointing\n\t\tto his mouth)\n\tDoc, my gungs hurt me.\n\nSpivey starts checking out Sefelt's mouth.\n\n\t\t\tNURSE PILBOW\n\tThis way, Mister McMurphy.\n\nAs McMurphy follows Nurse Pilbow down the hall, Spivey's\nvoice trails after him.\n\n\t\t\tSPIVEY (O.S.)\n\tHave you been taking your Dilantin,\n\tJim?\n\n\t\t\tSEFELT (O.S.)\n\tUh-huh...\n\n\t\t\tSPIVEY (O.S.)\n\tWell, we'll send you over to the\n\tdentist and see what he can do.\n\tOkay?\n\n\t\t\tSEFELT (O.S.)\n\tOkay, Doc!\n\nMcMurphy and Nurse Pilbow reach the day room.\n\n\t\t\tMISS PILBOW\n\tMake yourself at home, Mister\n\tMcMurphy...\n\n\t\t\tMCMURPHY\n\tThank you, ma'am,\n\nNurse Pilbow enters the nurses' station, closing the door\nbehind her. Next to the door is a bulletin board which, among\nother bits of information, READS: \n\nTODAY IS MONDAY SEPTEMBER 30, 1963. THE NEXT MEAL IS LUNCH.\nTHE NEXT HOLIDAY IS HALLOWEEN.\n\nAnother notice READS: \n\nSIGN UP NOW! BASKETBALL TOURNAMENT STAFF VS PATIENTS.\nWashington, Warren, Miller\n\nThere are no other names listed. Sefelt passes by.\n\n\t\t\tMCMURPHY (CONT'D)\n\tHi.\n\n\t\t\tSEFELT\n\tHi.\n\nSefelt crosses into the day room where he joins Fredrickson,\nwho is putting a jigsaw puzzle together.\n\nINT. DAY ROOM - DAY\n\nas McMurphy drifts into the room and looks around. The room\nis as it was. The MUSIC ENDS. There is a CLICK. McMurphy's\nattention is drawn to the nurses' station.\n\nMcMURPHY'S POV OF NURSES' STATION\n\nwhere Miss Pilbow is SEEN through a large plate glass window,\nbusy typing a nameplate for McMurphy.\n\nBig Nurse, her back to McMurphy, is turning over a stack of\nrecords. She presses the phonograph button. A record falls on\nthe turntable and MUSIC BEGINS as she turns and sees\nMcMurphy.\n\nANOTHER ANGLE\n\nMcMurphy smiles and tips his hat to Big Nurse. \n\nBig Nurse smiles back and takes her seat. \n\nMcMurphy turns and drifts into the day room. \n\nBig Nurse looks up and studies him. \n\nMcMurphy catches the eye of a PATIENT, sitting by himself.\n\n\t\t\tMCMURPHY\n\tHow ya doin', buddy?\n\n\t\t\tPATIENT\n\tPoorly, thank you.\n\n\t\t\tMCMURPHY\n\tOh, yeah? What's ailing ya?\n\n\t\t\tPATIENT\n\tI got the fever.\n\n\t\t\tMCMURPHY\n\tWell, that's too bad...\n\nTaber, pencil and paper in hand, crosses to McMurphy and taps\nhim on the shoulder.\n\n\t\t\tMCMURPHY (CONT'D)\n\tYeah, buddy?\n\n\t\t\tTABER\n\tAre you a doctor?\n\n\t\t\tMCMURPHY\n\tNo, 'fraid not...\n\nTaber walks away.\n\nMartini tugs at McMurphy's sleeve.\n\n\t\t\tMCMURPHY (CONT'D)\n\tYeah, buddy?\n\n\t\t\tMARTINI\n\tCan you borrow me a dime?\n\n\t\t\tMCMURPHY\n\tSorry, buddy, I'm clean outta\n\tchange...\n\nScanlon moves in.\n\n\t\t\tSCANLON\n\tGot a cigarette?\n\n\t\t\tMCMURPHY\n\tSure...\n\n\t\t\tMARTINI\n\tMe too! Me too!\n\nAs McMurphy hands out his cigarettes Bromden drifts by, mop\nin hand.\n\n\t\t\tMCMURPHY\n\tHey, how's it look up there, big\n\tboy?\n\n\t\t\tSCANLON\n\tHe can't hear you. He's just a deaf\n\tand dumb Indian!\n\n\t\t\tMCMURPHY\n\tThat right?\n\n\t\t\tHARDING (O.S.)\n\tMartini, it's your turn!\n\nMartini is staring off into space.\n\n\t\t\tHARDING (O.S.) (CONT'D)\n\tMartini!\n\n\t\t\tMCMURPHY\n\t\t(to Martini)\n\tYour buddy is callin' ya.\n\nMartini crosses back to the card game as Taber returns.\n\n\t\t\tMCMURPHY\n\tWhat's troubling ya, buddy?\n\n\t\t\tTABER\n\tI want you to write me a letter to\n\tmy brother for a hundred dollars to\n\tbury me.\n\n\t\t\tMCMURPHY\n\tYou look pretty healthy to me.\n\n\t\t\tTABER (CONT'D)\n\tI'm the next one.\n\n\t\t\tMCMURPHY\n\tHow do ya know that?\n\n\t\t\tTABER (CONT'D)\n\tBecause I quit breathing.\n\n\t\t\tMCMURPHY\n\tYou're breathin' right now.\n\nTaber walks away.\n\nMcMurphy watches him go.\n\nNearby, an OLD VEGETABLE squeaks.\n\n\t\t\tMCMURPHY\n\t\t(crossing to him)\n\tWhat's that, Pop?\n\nThe old man squeaks again.\n\n\t\t\tMCMURPHY\n\t\t(leaning in close)\n\tCan't hear ya, old-timer.\n\n\t\t\tOLD VEGETABLE\n\tAin't this a pisser?\n\n\t\t\tMCMURPHY\n\tHell, compared to where I just come\n\tfrom, this is a country club.\n\nMcMurphy crosses to the card game and stands watching the\ngame.\n\n\t\t\tMCMURPHY\n\tWhatcha boys playin'?\n\n\t\t\tBILLY\n\tH-H-Hearts.\n\n\t\t\tMCMURPHY\n\tShoot! No wonder you don't care\n\tnothin' 'bout showin' your hand.\n\nBilly holds his hand close to his chest.\n\n\t\t\tMCMURPHY\n\tWhat's your name, buddy?\n\n\t\t\tBILLY\n\tB-B-Billy.\n\n\t\t\tMCMURPHY\n\tWell, put 'er there, Billy boy, my\n\tname's McMurphy.\n\nThey shake hands.\n\n\t\t\tMCMURPHY\n\tWhat I wanna know is who's the top\n\tloony around here?\n\n\t\t\tBILLY (CONT'D)\n\tY-Y-You m-mean th-the pr-president\n\tof the P-P-Patients C-Council?\n\n\t\t\tMCMURPHY\n\tYeah, that'll do for openers!\n\n\t\t\tBILLY (CONT'D)\n\t\t(to Harding)\n\tH-H-Harding, the m-m-man w-wants to\n\tt-talk to you, y-you're the pr-pr\n\tpr...\n\n\t\t\tHARDING\n\tDoes he have an appointment?\n\n\t\t\tCHESWICK\n\tYeah, do you have an appointment?\n\n\t\t\tMCMURPHY\n\tWhat for?\n\n\t\t\tCHESWICK\n\t\t(to Harding)\n\tWhat for?\n\n\t\t\tHARDING\n\tI'm a busy man!\n\n\t\t\tCHESWICK\n\t\t(to McMurphy)\n\tHe's a busy man!\n\nA beat; then:\n\n\t\t\tMCMURPHY\n\tI can wait...\n\nMcMurphy picks up a chair and sits down right next to Harding\nand looks at him. Another beat; then:\n\n\t\t\tHARDING\n\t\t(to McMurphy)\n\tWhat are you doing?\n\n\t\t\tMCMURPHY\n\tI'm seeing what a busy man does.\n\nHarding, very nervous at McMurphy's proximity, turns back to\nthe game.\n\n\t\t\tHARDING\n\tYour turn, Martini!\n\nMartini is lost in the clouds.\n\n\t\t\tHARDING (CONT'D)\n\tMartini, throw a card!\n\nMartini throws a diamond.\n\n\t\t\tHARDING (CONT'D)\n\tNo, throw a club!\n\n\t\t\tCHESWICK\n\tYeah, throw a club!\n\nMartini throws a spade.\n\n\t\t\tHARDING\n\tDon't you have any clubs?\n\n\t\t\tMARTINI\n\tNo!\n\n\t\t\tHARDING\n\tLet me see your hand!\n\n\t\t\tMARTINI\n\tNo!\n\n\t\t\tHARDING\n\t\t(slamming his cards)\n\tWell, if you gentlemen will excuse\n\tme, I have some pressing matters to\n\tattend to.\n\nHarding gets up and crosses to the hallway, gathering his\npride as he goes.\n\nMcMurphy slides into Harding's seat and rakes all the cards\nin.\n\n\t\t\tMCMURPHY\n\tYessir, that's why I came to this\n\testablishment for, to bring you\n\tbirds fun and entertainment 'round\n\tthe gamin' table...\n\nMcMurphy fans the deck out and lays it on the table.\nEveryone's eyes pop as he scoops the cards up in one movement\n-- he's a card shark, a magician -- leaving the Acutes with\ntheir mouths hanging open.\n\n\t\t\tMCMURPHY\n\tEasy now, don't smudge 'em, we got\n\tlots of games ahead of us...\n\n\t\t\tBIG NURSE (O.S.)\n\tMister McMurphy!\n\nMcMurphy turns to see Big Nurse approaching, Washington\ncasually bringing up the rear.\n\n\t\t\tMCMURPHY\n\tYes, ma'am...\n\n\t\t\tBIG NURSE (CONT'D)\n\t\t(handing him his bag)\n\tWill you come with me, please.\n\n\t\t\tMCMURPHY\n\t\t(rising)\n\tHold the fort down, will ya,\n\tfellas!\n\n\t\t\tBILLY\n\tSure, Mack!\n\nMcMurphy walks with her toward the men's dorm.\n\n\t\t\tBIG NURSE\n\tMy name is Miss Ratched. I'm the\n\thead nurse here. You've already met\n\tMiss Pilbow and Aides Washington\n\tand Warren.\n\n\t\t\tMCMURPHY\n\tYes, ma'am.\n\nBig Nurse and McMurphy stop at the security gate to the men's\ndorm where Miller opens the gate.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Miller, this is Mister\n\tMcMurphy, who'll be staying with\n\tus.\n\nGreetings are exchanged as they pass through.\n\nINT. MEN'S DORM - DAY\n\nas Big Nurse and McMurphy cross down the aisle.\n\n\t\t\tBIG NURSE\n\tWe do appreciate the way you have\n\ttaken it upon yourself to meet the\n\tother patients.\n\n\t\t\tMCMURPHY\n\tThank you, ma'am...\n\nBig Nurse stops at an empty bed where Warren is turning the\nmattress down.\n\n\t\t\tBIG NURSE\n\tThis is your bed. You may leave\n\tyour things in that cabinet.\n\n\t\t\tMCMURPHY\n\tYes, ma'am...\n\n\t\t\tBIG NURSE\n\tPlease use your time to familiarize\n\tyourself with your new home and if\n\tthere is anything you need to know,\n\tdon't hesitate to ask us.\n\n\t\t\tMCMURPHY\n\tNow that you mention it, I sure\n\twould like to call my aunt up in\n\tPortland and tell 'er where I am so\n\tshe can come visit me.\n\n\t\t\tBIG NURSE \n\tAll in good time, Mister McMurphy.\n\tAll in good time.\n\n\t\t\tMCMURPHY\n\tYes, ma'am.\n\n\t\t\tBIG NURSE \n\tGood. Now if you'll just go along\n\twith Mister Washington, he'll see\n\tthat you're properly oriented.\n\nMcMurphy doesn't move.\n\n\t\t\tBIG NURSE (CONT'D)\n\tIs there anything else?\n\n\t\t\tMCMURPHY\n\tJust that I'm glad to be here, Miss\n\tRatched. I really am.\n\n\t\t\tBIG NURSE \n\tGood. I'm sure we'll be friends.\n\nThey smile, sizing up each other.\n\n\t\t\tMCMURPHY\n\tYeah, you ain't half so bad looking\n\tfor a head nurse.\n\n\t\t\tBIG NURSE\n\tYes. Now go along, Mister McMurphy.\n\tGo along.\n\n\t\t\tMCMURPHY\n\tYes, ma'am.\n\t\t(to Washington)\n\tLead the way, Sam.\n\nThey cross out of the men's dorm.\n\nBig Nurse watches them go.\n\n\t\t\tSPIVEY (V.O.)\n\tWhat other work have you done?\n\nINT. DOCTOR SPIVEY'S OFFICE - DAY\n\nDoctor Spivey is seated behind his desk, on which are several\nglass-framed photos of Spivey's family, plus a nameplate:\nJOHN M. SPIVEY, M.D., and McMurphy's papers.\n\nMcMurphy, freshly showered and wearing hospital-issue\nclothes, sits facing him.\n\n\t\t\tMCMURPHY\n\tHell, Doc, I've been everything\n\tfrom a hoopla man with a two-bit\n\tcarny show to a top mechanic and\n\tbull goose catskinner for every\n\tgypo loggin' operation in the\n\tNorthwest till the Army taught me\n\twhat my natural bent was.\n\n\t\t\tSPIVEY\n\tOh, what was that?\n\n\t\t\tMCMURPHY\n\tPoker!\n\n\t\t\tSPIVEY \n\tI see.\n\n\t\t\tMCMURPHY\n\tYeah, but you know how society\n\tpersecutes a dedicated man.\n\n\t\t\tSPIVEY (CONT'D)\n\tIn what way?\n\n\t\t\tMCMURPHY\n\tThey say I'm a habitual hassler.\n\tLike I fight some. Sheeut. They\n\tdidn't mind so much when I was a\n\tdumb logger and got into a hassle.\n\tThat's a hardworkin' feller blowing\n\toff steam, they say. But if you're\n\ta gambler, all you have to do is\n\tspit slantwise and you're a\n\tgoddamned criminal.\n\n\t\t\tSPIVEY\n\tI see...\n\n\t\t\tMCMURPHY\n\tTo tell the truth, ever since I\n\tfound my natural callin' I done\n\ttime in so many small-time jails I\n\tcould write a brochure...\n\n\t\t\tSPIVEY \n\tYes... Ah, do you know why you're\n\there?\n\n\t\t\tMCMURPHY\n\tWell, ya know, Doc...\n\t\t(indicating his papers)\n\tDoesn't it say so there?\n\n\t\t\tSPIVEY \n\t\t(looking over papers)\n\tWell, according to the Warden at\n\tPendleton, you were a disturbing\n\tinfluence on others. 'It appears\n\tthat there is a potential in him\n\tfor instigating a revolt among the\n\tother inmates.'\n\t\t(looking up at McMurphy)\n\tWhat do you think of that report?\n\n\t\t\tMCMURPHY\n\tI don't, Doc...\n\n\t\t\tSPIVEY \n\t\t(goes back to papers)\n\tArrested on an assault charge five\n\ttimes...\n\n\t\t\tMCMURPHY\n\tThat's correct, Doc ...\n\n\t\t\tSPIVEY\n\t\t(reading from folder)\n\tThe doctor at the prison states:\n\t'Don't overlook the possibility\n\tthat this man may be faking\n\tpsychosis to escape the drudgery of\n\tthe work farm...' What do you say\n\tto that?\n\n\t\t\tMCMURPHY\n\tDoc, what can I tell ya?\n\n\t\t\tSPIVEY\n\tAh, it seems you have no other\n\tpsychiatric history, Mister Murphy?\n\n\t\t\tMCMURPHY\n\tNo, this is my first trip, Doc.\n\n\t\t\tSPIVEY\n\t\t(closes folder and sits\n\t\tback)\n\tWell, you're here for a ninety-day\n\tobservation period, Mister\n\tMcMurphy. I'd like you to\n\tunderstand you are here on a court\n\torder and we are responsible to the\n\tstate. So, I'd like your\n\tcooperation!\n\n\t\t\tMCMURPHY\n\tYou bet, Doc!\n\n\t\t\tSPIVEY\n\tGood. Good.\n\nINT. DAY ROOM - DAY\n\nCAMERA is on Big Nurse as she stands, in front of a chair,\ndoing a deep breathing exercise.\n\nThe patients and staff, standing in front of chairs arranged\nin a circle, follow suit as best they can. After a couple of\nexercises Big Nurse sits. The others do the same except\nBancini, who remains standing, wagging his head back and\nforth.\n\n\t\t\tBANCINI\n\tI'm tired. Whew. O Lord. Oh, I'm\n\tawful tired...\n\n\t\t\tBIG NURSE\n\t\t(busy with her papers)\n\tSomebody please see to Mister\n\tBancini, so we can start the\n\tmeeting.\n\nBilly does... gently laying a hand on Bancini.\n\n\t\t\tBILLY\n\tT-t-t-take it e-e-easy, P-P-P\n\tPete...\n\n\t\t\tBANCINI\n\tAwful tired...\n\nBilly gently eases Bancini into his chair and sits beside\nhim, patting his skinny knee.\n\n\t\t\tBIG NURSE\n\tAt the close of Friday's meeting,\n\twe were discussing Mister Harding's\n\tproblem, concerning his wife...\n\t\t(reading from logbook)\n\tMister Harding stated that his wife\n\tmade him uneasy because she drew\n\tstares from men on the street. Is\n\tthat correct, Mister Harding?\n\n\t\t\tHARDING\n\tYes, that's perfectly correct.\n\n\t\t\tBIG NURSE\n\t\t(reading)\n\tHe also thinks he may have given\n\ther reason to seek sexual attention\n\telsewhere, but he didn't say how.\n\tHe has been heard to say to his\n\twife, 'I hate you, I don't ever\n\twant to see you again. You've\n\tbetrayed me.'\n\t\t(she closes book)\n\tSo. Does anyone care to touch upon\n\tthis further?\n\nBig Nurse waits. A long beat.\n\nHarding sits, chewing his nails, tensely waiting, almost\nwanting someone to begin.\n\nThe patients shift uncomfortably, looking in all directions.\n\nMcMurphy looks around to see what will follow, when he sees\nEllis, nailed to the wall; his pants leg darkens and a puddle\nof piss forms at his feet. McMurphy looks to see if Big Nurse\nor the Aides have noticed.\n\nIf they have, no one pays any attention.\n\nMcMurphy fidgets in his seat, then gets up, crosses to Ellis,\nunhooks him from the wall, and moves him over a few feet.\n\nThe other patients are aghast at this move, look at each\nother quizzically.\n\nBig Nurse merely watches.\n\nMcMurphy crosses back to his chair and sits.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister McMurphy, this ward is a\n\tdemocratic community run by the\n\tpatients and their votes, so you\n\tshould feel at ease in your new\n\tsurroundings to the extent you can\n\tfreely discuss emotional problems\n\tin front of the patients and staff.\n\tHowever, the cardinal rule, and I\n\tmust emphasize this: Everyone keeps\n\ttheir seat during the meeting!\n\n\t\t\tMCMURPHY\n\tYeah, well, it just pains me\n\tsomethin' awful to see a full\n\tgrowed man sloshing around in his\n\town water...\n\n\t\t\tBIG NURSE\n\tYes... We were discussing Mister\n\tHarding's problem with his wife.\n\tNow, who will start?\n\t\t(no response)\n\tBilly.\n\n\t\t\tBILLY\n\tM-m-m-ma'am?\n\n\t\t\tBIG NURSE\n\tWould you like to start?\n\n\t\t\tBILLY\n\tN-n-n-n-n-no, ma'am.\n\n\t\t\tBIG NURSE\n\tMister Sefelt?\n\nSefelt shrugs and sinks into his seat.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Fredrickson?\n\nFredrickson passes.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Taber?\n\nTaber passes.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Martini?\n\n\t\t\tMARTINI\n\tNo!\n\n\t\t\tBIG NURSE\n\tMister Scanlon?\n\nScanlon looks at the floor.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Cheswick?\n\nCheswick wags his head 'no.'\n\n\t\t\tBIG NURSE (CONT'D)\n\tAm I to take it that there isn't a\n\tman among you who has an opinion\n\tconcerning this matter?\n\t\t(no response; she focuses\n\t\tin on Harding)\n\tMister Harding, you've stated on\n\tmore than one occasion that you\n\tsuspected your wife of seeing other\n\tmen.\n\n\t\t\tHARDING\n\tYes, Miss Ratched, this is correct.\n\n\t\t\tBIG NURSE\n\tBut you have no proof.\n\n\t\t\tHARDING\n\tNo, Miss Ratched...\n\n\t\t\tBIG NURSE\n\tAnd yet you suspect her.\n\n\t\t\tHARDING\n\tYes, that is correct.\n\n\t\t\tBIG NURSE\n\tWhy?\n\n\t\t\tHARDING\n\tI can only speculate as to the\n\treasons why.\n\n\t\t\tBIG NURSE\n\tHave you ever speculated, Mister\n\tHarding, that you are impatient\n\twith your wife because she does not\n\tmeet your mental requirements?\n\nOne of the Chronics laughs like a child.\n\n\t\t\tHARDING\n\tMiss Ratched. Given all the\n\tconditions of that sublime\n\trelationship, coupled with the\n\tsubsequent annihilation of all that\n\tI held to be sacred, mentally,\n\tphysically and emotionally, the\n\tonly thing that I can speculate on,\n\tat this late date, is how I will\n\tjustify the very existence of my\n\tlife, with or without my dear wife.\n\n\t\t\tSEFELT\n\tWhat's he talkin' about?\n\n\t\t\tTABER\n\tYeah, Harding, why don't you\n\tknockoff the bullshit and get to\n\tthe point.\n\nSeveral Acutes chime in, \"Yeah, get to the point,\" AD LIB.\n\n\t\t\tHARDING\n\tThe point is, I will carry on until\n\tI fully understand what the\n\tfunction of that relationship is\n\tregardless of form or content.\n\nSeveral hands go up.\n\n\t\t\tBIG NURSE\n\tYes, Billy?\n\n\t\t\tBILLY\n\tI-I-I-I-I d-d-don't s-s-see how\n\tanyone could lu-lu-lu-love a man\n\twho t-t-t-talks the way he does.\n\n\t\t\tTABER\n\tYeah, Harding, you're so fuckin'\n\tdumb I can't believe it.\n\n\t\t\tHARDING\n\tThat's a matter of opinion.\n\n\t\t\tSEFELT\n\tYeah, Harding, where do you breathe\n\tanyway?\n\n\t\t\tFREDRICKSON\n\tThrough the ass.\n\nSefelt and Fredrickson snicker into their hands. A few of the\nothers laugh.\n\n\t\t\tHARDING\n\t\t(smarting)\n\tIs that your sense of humor or are\n\tyou trying to say something?\n\n\t\t\tFREDRICKSON\n\t\t(innocence itself)\n\tNow what would I be trying to say?\n\n\t\t\tHARDING\n\tI don't know. I don't know, but it\n\tmakes me feel very peculiar when\n\tyou throw in something like that.\n\n\t\t\tFREDRICKSON\n\tPeculiar?\n\n\t\t\tSEFELT\n\tWhy?\n\n\t\t\tTABER\n\tYeah, why?\n\n\t\t\tSCANLON\n\tYeah, tell us why.\n\n\t\t\tHARDING\n\tI hesitate to go on.\n\n\t\t\tBIG NURSE\n\tNo secrets, Mister Harding. Let's\n\tget it all out in the open...\n\n\t\t\tHARDING\n\tI mean, the other day you made an\n\tallusion to my wife and the\n\tpossible sexual problems we might\n\tbe having. I know that to be the\n\tcase, but the way in which you\n\tbroached it, if that's your idea of\n\tteaching me something...\n\n\t\t\tHARDING (CONT'D)\n\t\t(his voice rising as he\n\t\tgoes on)\n\t... or making me aware of a\n\tcondition in my life, then I say,\n\tcategorically speaking, the hell\n\twith you, Taber!\n\tI don't have to justify the\n\tcondition of my life to you or any\n\tof you. No matter what I will carry\n\ton until I fully understand what\n\tthat function is regardless of the\n\tform or content. Regardless of the\n\tfact we must try to understand the\n\tfunction of our capacity to obtain,\n\tto personify the condition, the\n\tcondition of our existence, our\n\texistence...\n\n\t\t\tTABER\n\tYou know what, Harding? I think\n\tyou're some kind of morbid asshole\n\tor something. You've been talking\n\tabout your wife evere since I can\n\tremember. You know, she's on your\n\tmind and blah, blah, blah and on\n\tand on and when are you going to\n\twise up and turn her loose!\n\n\t\t\tFREDRICKSON\n\tYeah, wise up, Harding.\n\n\t\t\tSEFELT\n\tYeah, turn her loose!\n\n\t\t\tACUTES\n\t\t(start pouring it on)\n\tYeah, who do you think you are\n\tanyway?... He thinks he's God\n\tAlmighty... He's a snob... He's a\n\tschmuck... Dumbbell... Creep...\n\tCretin... Idiot... Get rid of\n\thim... Ship him upstairs...\n\n\t\t\tRUCKLY\n\t\t(chiming in)\n\tFfffffuck da wife...\n\n\t\t\tBANCINI\n\t\t(wagging his head)\n\tTired... Awful tired...\n\n\t\t\tACUTES\n\t\t(not letting up)\n\tZap him... Give 'im lobotomy... Cut\n\this nuts off... He doesn't have\n\tany... Fag... Pervert.\n\n\t\t\tBANCINI\n\t\t(in a strong angry voice)\n\tI'm tired!\n\nEveryone hushes.\n\n\t\t\tBIG NURSE\n\tSomebody see to Mister Bancini.\n\nTwo or three Acutes get up and try to soothe Bancini, but he\nisn't to be hushed.\n\n\t\t\tBANCINI\n\tTired. Tired. Oh God, I'm tired...\n\nBig Nurse nods to Washington, who goes to Pete, and gives his\narm a jerk toward the door. Bancini is unmovable.\n\nBig Nurse signals Nurse Pilbow, who heads for the nurses'\nstation.\n\nWashington senses danger, lets go of Pete's arm, backs away.\n\n\t\t\tWASHINGTON\n\tYou a good boy, Mistah Bancini...\n\nNurse Pilbow returns, hypodermic needle in hand.\n\nPete turns to his fellow inmates.\n\n\t\t\tBANCINI\n\tYou see... it's a lotta baloney...\n\tIt's all a lotta baloney...\n\n\t\t\tNURSE PILBOW\n\tYes, yes, Mister Bancini, now if\n\tyou'll just be calm...\n\n\t\t\tBANCINI\n\tThat's all it is, just a lotta\n\tbaloney. Ya see, I can't help it,\n\tcan't...\n\n\t\t\tNURSE PILBOW\n\t\t(working her way around\n\t\tBancini)\n\tYes, I know, I know...\n\nShe gets him in the ass, with the needle, and springs back.\n\n\t\t\tBANCINI\n\t... don't ya see. I was born dead.\n\tNot you. You wasn't born dead.\n\tAhhh, it's been so hard...\n\t\t(starts going over,\n\t\tslowly; sighing and\n\t\tcrying)\n\tTired... I'm tired... aw-ful\n\ttired...\n\nMcMurphy looks around at the others.\n\nEach patient is locked in his own world -- oblivious to\nBancini's state.\n\nEXT. BASKETBALL COURT - DAY\n\nWIDE SHOT of entire court, surrounded by a high fence topped\noff with barbed wire, as Washington and Warren escort the\nAcutes -- including Bromden, Ellis, a lobotomy case and\nseveral other Chronics -- through the gate onto the court,\nwhich is run down, with cracks in its surface and leaves\nscattered everywhere.\n\nMartini, who is carrying the ball, runs ahead, followed by\nScanlon, where he starts dribbling the ball in a frantic\ncircle, suddenly passes the ball to nothing.\n\n\t\t\tMARTINI\n\t\t(as he throws ball)\n\tCatch it! Catch it!\n\nThe ball rolls to the corner.\n\n\t\t\tWASHINGTON\n\tMartini, there ain't nobody there,\n\tya dumb goon! Go get the ball!\n\n\t\t\tMARTINI\n\tNo!\n\nMartini turns away, his feelings hurt. Washington goes after\nthe ball, when Martini goes running after it.\n\n\t\t\tMARTINI (CONT'D)\n\tI get it! I get it!\n\nBut Washington gives Martini a body check and beats him to\nthe ball.\n\nMartini tries to get the ball from Washington, who is quite\nagile and teases him as he returns to the court where he and\nWarren start shooting baskets, freezing Martini and Scanlon\nout.\n\nThe other patients just hang around or walk, as if in a\nprison yard.\n\nCheswick stands in close proximity to McMurphy and Harding,\nwho stand watching the action. McMurphy finally offers a\ncigarette to Harding, who accepts. They both light up.\n\n\t\t\tMCMURPHY\n\tWell, say, buddy, is that the usual\n\tpro-cedure for those Group Ther'py\n\tshindigs? Bunch of chickens at a\n\tpeckin' party?\n\n\t\t\tHARDING\n\tA pecking party?\n\n\t\t\tMCMURPHY\n\tThat's right, buddy. And you want\n\tto know who pecks the first peck?\n\n\t\t\tHARDING AND CHESWICK\n\tWho? Who?\n\n\t\t\tMCMURPHY\n\tAh, come off it! It's that Big\n\tNurse, that's who...\n\nThe other Acutes have gathered around McMurphy and Harding.\n\n\t\t\tHARDING\n\tIt's as simple as that. You've been\n\ton our ward six hours and have\n\talready simplified the work of\n\tFreud, Jung and Maxwell Jones in\n\tone grand analogy: it's a pecking\n\tparty.\n\n\t\t\tMCMURPHY\n\tI'm not talking about Fred Yoong or\n\tMaxwell Jones, buddy, what I'm\n\ttalkin' about is that crummy\n\tmeeting and what that nurse did to\n\tyou!\n\n\t\t\tHARDING\n\tDid to me?\n\n\t\t\tMCMURPHY\n\tDid to you and all the rest of you\n\tguys.\n\n\t\t\tBILLY\n\tY-y-yes! Yes! Y-y-y-you s-s-saw wh\n\twh-what she c-c-can do to us!\n\n\t\t\tMCMURPHY\n\tWhat did I see 'cept a grown man\n\tgettin' whipped so bad he can't\n\tlaugh anymore.\n\n\t\t\tFREDRICKSON\n\tIt's the questions she asks.\n\n\t\t\tMCMURPHY\n\tTell 'er to go straight to hell!\n\n\t\t\tHARDING\n\tMiss Ratched is a competent\n\tpsychiatric nurse, not some, some\n\tkind of monster pecking out our\n\teyes!\n\n\t\t\tMCMURPHY\n\t\t(as calm as blue waters)\n\tShe ain't peckin' at your eyes,\n\tbuddy.\n\nMcMurphy grabs Harding by his balls and Harding goes up on\nhis toes.\n\n\t\t\tMCMURPHY\n\tShe's peckin' at your balls, buddy,\n\tat your ever-lovin' balls.\n\nHarding is doubled over.\n\n\t\t\tSEFELT\n\tThat kind of behavior will get you\n\ta P.A. rating, my friend.\n\n\t\t\tMCMURPHY\n\tP.A. What the hell is that?\n\n\t\t\tSEFELT \n\tPotential assaultive.\n\n\t\t\tFREDRICKSON\n\tWhich gets you shipped up to\n\tDisturbed for a nice little zap\n\tjob.\n\n\t\t\tMCMURPHY\n\tHuh?\n\n\t\t\tHARDING\n\tElectro-Shock Therapy, my friend.\n\tFive cents' worth of electricity\n\tand you are out of everybody's\n\thair.\n\n\t\t\tMCMURPHY\n\tTell 'er to go to hell anyway!\n\n\t\t\tHARDING (CONT'D)\n\tAnd if you persist in your ways,\n\tthey can always ship you over to\n\tMedical Surgery.\n\n\t\t\tMCMURPHY\n\tWhat for?\n\n\t\t\tHARDING (CONT'D)\n\tLobotomy!\n\n\t\t\tMCMURPHY\n\tLobotomy?\n\n\t\t\tHARDING (CONT'D)\n\t\t(pointing to lobotomy\n\t\tcase)\n\tThat!\n\nMcMurphy looks.\n\nSHOT OF A LOBOTOMY CASE\n\nA vegetable, complete with two half-dollar scars in his\nforehead.\n\nMcMURPHY\n\nAs he absorbs this bit of information the basketball rolls to\nhis feet and he picks it up.\n\n\t\t\tMCMURPHY\n\t\t(to Harding)\n\tIs that your sense of humor or are\n\tyou tryin' to say somethin'?\n\n\t\t\tHARDING\n\tNow, what would I be trying to say?\n\nMartini and Scanlon rush over and try to get the ball.\n\n\t\t\tSCANLON\n\tGimme the ball!\n\n\t\t\tMARTINI\n\tNo. Me! Me!\n\n\t\t\tWASHINGTON (O.S.)\n\tPass the ball, McMurphy.\n\nMcMurphy crosses to the court, bouncing the ball as he goes.\nWhen he reaches the court he holds the ball out to\nWashington, who reaches for it, but McMurphy snaps it back\nover his shoulder to Martini.\n\n\t\t\tMCMURPHY\n\t\t(turning to Martini)\n\tPass it to me, Martini.\n\nMartini holds back.\n\n\t\t\tMCMURPHY\n\tC'mon, I'll give it back!\n\nMartini passes to McMurphy.\n\n\t\t\tMCMURPHY\n\tAtta boy, Martini.\n\nHe passes it back to Martini, who laughs and passes it back\nto McMurphy, who passes it to Scanlon, who passes to\nMcMurphy, who passes to Billy, etc. Bromden just stands\nwatching.\n\n\t\t\tMCMURPHY\n\t\t(encouraging them)\n\tBack and forth, that's it. Shoot,\n\tman, we'll be takin' on the New\n\tYork Knicks before we're through...\n\nMcMurphy looks to see Big Nurse looking out a window at them.\nHe catches her eye. She turns away.\n\n\t\t\tMCMURPHY (V.O)\n\tHey-ya, hey-ya, come on, come on,\n\tI'm waitin' on you suckers, you hit\n\tor you sit...\n\nINT. DAY ROOM - NIGHT\n\nThe MUSIC is PLAYING. The TV is on the six o'clock news as\nMcMurphy, cards in hand, is dealing blackjack to Cheswick,\nHarding, Sefelt, Billy and Martini. Fredrickson and Scanlon\nare looking on as Bromden eases up to the game. Cheswick is\nat the nurses' station talking to Big Nurse.\n\n\t\t\tSEFELT\n\tHit me!\n\n\t\t\tMCMURPHY\n\tHit, you say? Well well well and\n\twith a king up, the boy wants a\n\thit. Whadaya know.\n\tSo comin' at you and too bad, a\n\tlittle lady for the lad and he's\n\tover the wall and down the road, up\n\tthe hill and dropped his load.\n\n\t\t\tSEFELT\n\tBoogered!\n\nMcMurphy rakes in Sefelt's cigarettes, adding them to a pile\nof loose cigarettes, packs of cigarettes, several cartons of\ncigarettes.\n\nAs Cheswick sits down, depressed:\n\n\t\t\tMCMURPHY\n\t'Kay, place your bets.\n\n\t\t\tMARTINI\n\t\t(holding up a cigarette)\n\tWhat's this?\n\n\t\t\tMCMURPHY\n\tThat's a dime, Martini.\n\nMartini breaks a cigarette in half.\n\n\t\t\tMARTINI (CONT'D)\n\tBet a nickel!\n\n\t\t\tMCMURPHY\n\t\t(to Cheswick)\n\tWhadaya bet, Cheswick?\n\n\t\t\tCHESWICK\n\tShe won't give me any more\n\tcigarettes!\n\n\t\t\tMCMURPHY\n\tThat okay. I'll take your marker.\n\tHow many ya want?\n\n\t\t\tCHESWICK (CONT'D)\n\tLend me twenty.\n\nMcMurphy counts out twenty cigarettes, marks it down on a\npiece of paper, and passes the cigarettes to Cheswick, who\nbets all twenty.\n\nThe Sports have come on TV and McMurphy's attention is\ndivided.\n\n\t\t\tMCMURPHY\n\t\t(checking the board)\n\t'Kay, all bets are down, let's\n\twheel 'em an' deal 'em.\n\nHe deals the cards out, the first one face down, then the\nnext one face up.\n\n\t\t\tMCMURPHY\n\tBig king... little deuce... another\n\tking... a lovely lady... big ten...\n\tand a trey... hey, hey, whadaya\n\tsay? Ya hit or sit, Martini?\n\n\t\t\tMARTINI\n\tHit me.\n\n\t\t\tMCMURPHY\n\t\t(hits with a picture)\n\tThat's twenty up, Martini.\n\t\t(turning to TV, he shouts\n\t\tacross room)\n\tHey, Taber, who's pitching the\n\topening game?\n\nTaber calls back something but it's lost in the other sounds.\n\n\t\t\tMARTINI (CONT'D)\n\tHit me!\n\n\t\t\tMCMURPHY\n\tWait a minute, Martini, I can't\n\thear a thing.\n\t\t(turning back to Taber)\n\tWhat?\n\n\t\t\tTABER\n\t\t(shouting back)\n\tKoufax against Ford!\n\n\t\t\tMISS PILBOW (V.O.)\n\t\t(over loudspeaker)\n\tMedication time! Medication time!\n\tMedication!\n\n\t\t\tMARTINI\n\t\t(simultaneously with\n\t\tPilbow)\n\tHit me!\n\nMcMurphy slams his cards down, stands up, crosses the day\nroom, heading for the nurses' station. He passes Washington,\nwho stands there waiting to dispense orange juice.\n\nINT. NURSES' STATION - NIGHT\n\nas McMurphy enters. Nurse Pilbow is the only one there.\n\n\t\t\tMCMURPHY\n\tPardon me miss, but would you mind\n\tturning...\n\n\t\t\tNURSE PILBOW\n\t\t(scared out of her wits)\n\tStay back! Patients aren't allowed\n\tto enter the... Oh, stay back!\n\n\t\t\tMCMURPHY\n\tAll I'm askin' is...\n\nNurse Pilbow grabs at her cross, screams and shuts her eyes,\nholding the cross in front of her.\n\n\t\t\tNURSE PILBOW (CONT'D)\n\tOh, stay back, I'm a Catholic!\n\nBig Nurse enters from the nurses' lounge.\n\n\t\t\tBIG NURSE\n\tMister McMurphy. Patients aren't\n\tallowed in here.\n\n\t\t\tMCMURPHY\n\tSorry, ma'am.\n\nMcMurphy steps out of the station, closing the door behind\nhim.\n\nINT. DAY ROOM - NIGHT\n\nas McMurphy goes around to the front of the nurses' station\nand queues up behind the other Acutes who are getting their\nmedication. McMurphy reaches the window, takes the cup, but\ndoesn't take his pills.\n\n\t\t\tMCMURPHY\n\t\t(to Big Nurse)\n\tPardon me, ma'am, can I ask you\n\tsomethin'?\n\n\t\t\tBIG NURSE\n\t\t(politely)\n\tYes, Mister McMurphy?\n\n\t\t\tMCMURPHY\n\tHow 'bout turning off that music\n\tfor a while so a man can hear\n\thimself think?\n\n\t\t\tBIG NURSE\n\t\t(pleasantly)\n\tThat music is for everyone, Mister\n\tMcMurphy.\n\nMcMurphy leans in, placing his hand on the window.\n\n\t\t\tMCMURPHY\n\t\t(confidentially)\n\tWell, say, how 'bout easin' it down\n\ta bit so a man don't have to shout!\n\n\t\t\tBIG NURSE (CONT'D)\n\t\t(aware of his physical\n\t\tproximity)\n\tMister McMurphy, there are old men\n\there who couldn't hear the music at\n\tall if it were lower. That music is\n\tall they have, and I wish you\n\twouldn't lean against the glass\n\tthere, your hands are staining the\n\twindow.\n\nMcMurphy jerks his hand away.\n\n\t\t\tMCMURPHY\n\tSorry, ma'am... Sorry 'bout that...\n\nMcMurphy breathes on the glass and wipes it clean with his\nsleeve.\n\n\t\t\tMCMURPHY\n\tSorry to have bothered you.\n\n\t\t\tBIG NURSE \n\tNot at all, Mister McMurphy...\n\nMcMurphy turns to walk away.\n\n\t\t\tNURSE PILBOW\n\tYour medicine, Mister McMurphy.\n\n\t\t\tMCMURPHY\n\t\t(turning back, he examines\n\t\tthe contents of the cup)\n\tWhat's the horse pill for, honey?\n\n\t\t\tNURSE PILBOW\n\tIt's just medication, Mister\n\tMcMurphy, good for you. Now down it\n\tgoes...\n\n\t\t\tMCMURPHY\n\tLook, miss, I don't like swallowing\n\tsomething without knowing what it\n\tis!\n\n\t\t\tNURSE PILBOW \n\t\t(stepping back a little)\n\tDon't get upset, Mister McMurphy...\n\n\t\t\tMCMURPHY\n\tI'm not upset. All I wanna know,\n\tfor the lovva Jesus...\n\n\t\t\tBIG NURSE\n\tThat's all right, Miss Pilbow, if\n\tMister McMurphy does not wish to\n\ttake his medication orally, he\n\tmay...\n\n\t\t\tMCMURPHY\n\tNo, that's okay, ma'am. Down it\n\tgoes.\n\nMcMurphy makes a big show of popping the pill in his mouth,\nholding his paper cup upside down, for all to see, then\nmoving on to Washington, who fills it with orange juice.\n\nMcMurphy gulps it down, not without some difficulty, then he\nsmiles at all the concerned faces and crosses the room to the\ncard table, where he sits to see the Acutes looking at him.\n\n\t\t\tHARDING\n\tWhy didn't you tell her to go to\n\thell, lover boy?\n\n\t\t\tTABER\n\tYeah, whattsa matter, Mack, she too\n\tmuch for ya?\n\nMcMurphy holds the pill up and flicks it into Harding's\nforehead.\n\n\t\t\tMCMURPHY\n\tYou boys seem to think you've got a\n\tchamp in there, huh?\n\n\t\t\tHARDING\n\tI don't see you scoring any points,\n\tbuddy. And you're just the man for\n\tthe job, right?\n\n\t\t\tMCMURPHY\n\tHell, I couldn't get it up over old\n\thatchet-face if ya paid me!\n\n\t\t\tHARDING (CONT'D)\n\tShe's not all that homely, Mister\n\tMcMurphy. In fact, she must have\n\tbeen a rather beautiful young lady.\n\nThe men look at Big Nurse.\n\nThe patients look at the nurses' station.\n\nPATIENTS' POV\n\nBig Nurse is busy at her work.\n\nINT. NURSES STATION - BIG NURSE'S POV - NIGHT\n\nThe patients looking at her. They turn back to their card\ngame.\n\nREVERSE ANGLE\n\nCAMERA HOLDS on Big Nurse as McMurphy's VOICE is HEARD over\nINTERCOM.\n\n\t\t\tMCMURPHY (V.O.)\n\t\t(through intercom)\n\tYeah, an' I'm tellin' ya, she's\n\tjust an icy-hearted over-the-hump\n\tgal who never got enough of the old\n\twham-bam to straighten 'er out...\n\tOkay, who wants a card?\n\n\t\t\tMARTINI (V.O.)\n\t\t(through intercom)\n\tMe. Hit me!\n\nBig Nurse looks up and studies the men gathered round the\ntable.\n\nINT. MEN'S DORM - NIGHT\n\nThe patients are asleep except for Bromden, who stands by the\nwindow looking out.\n\nMcMurphy is asleep in the bed next to his. A beat when\nTURKLE, a fifty-year-old Negro night attendant, slightly\ndrunk, lays a gentle hand on Bromden's shoulder.\n\n\t\t\tTURKLE\n\tLe's get back to bed, Mistah\n\tBromden...\n\nBromden allows himself to be led back to bed. Turkle fumbles\naround for the security belt, finds it, straps Bromden\nloosely in bed, then goes off clucking to himself.\n\nBromden reaches under his bed and plucks a stale piece of gum\nfrom under the bed frame. He starts chewing it when he sees\nMcMurphy looking at him.\n\nBromden goes right on chewing and looking McMurphy right in\nthe eye.\n\n\t\t\tMCMURPHY\n\t\t(whispering)\n\tChief? I wanna ask ya somethin'.\n\t\t(sings)\n\tOh, does the spearmint lose its\n\tflavor on the bedpost overnight?\n\tWhen you chew it in the morning,\n\twill it be too hard to bite? This\n\tquestion's got me goin', won't\n\tsomebody set me right; does the\n\tspearmint lose its flavor on the\n\tbedpost overnight?\n\nMcMurphy holds the last note, reaches over and rustles\nthrough his nightstand.\n\n\t\t\tMCMURPHY\n\tHere ya go, Chief...\n\nA small object lands on Bromden's bed. It is a fresh package\nof gum. Bromden picks it up. Examines it. Unwraps it.\nDeposits his old piece of gum under the bed frame, then\ninserts the fresh gum in his mouth and starts chewing.\n\nSERIES OF SHOTS\n\nSHOWING the MEN'S DORM, the empty DAY ROOM, TURKLE ASLEEP in\nthe NURSES' STATION, EMPTY HALLWAYS, the NIGHT SUPERINTENDENT\nAT HER DESK, MORE HALLWAYS... ENDING ON:\n\nINT. MEN'S DORM - SUNRISE\n\nABERRATED SHOT of INSTITUTIONAL GROUNDS SEEN THROUGH STEEL\nMESH SCREEN -- as the sun rises above the treetops.\n\nREVERSE SHOT - BROMDEN\n\nlooking out of the window. His face washed by the sunlight.\nHis eyes have a vague look, almost vacuous, as...\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(through loudspeaker)\n\tGood morning, boys. Rise and shine.\n\tRise and shine.\n\nINT. MEN'S DORM - DAY\n\nas Washington, Warren and Miller roust the patients out of\nbed.\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(through loudspeaker)\n\tTime to got up! Come on now, it's a\n\tbeautiful day! Let's not straggle!\n\tEverybody up, up, up!\n\nMcMurphy is in bed, not ready for the world, when Washington\ncrosses to Bromden, who is looking out the window, and leads\nhim off.\n\n\t\t\tWASHINGTON\n\tLe's go, Chief. Le's go get\n\tourselves all nice and clean...\n\t\t(to McMurphy)\n\tYou too, Mistah Mack-Murphy!\n\nWashington goes off with Bromden.\n\nCAMERA HOLDS on McMurphy as he slowly pulls it together and\nsits on the edge of the bed. He's naked as he opens the\ndrawer to his nightstand and fishes around for a cigarette.\n\n\t\t\tMCMURPHY\n\t\t(looking in the drawer)\n\tWhat the...\n\t\t(looking around)\n\tWho the fuck stole my cigarettes!\n\nINT. DAY ROOM - DAY\n\nas the Acutes straggle past Big Nurse.\n\n\t\t\tBIG NURSE\n\tGood morning, Mister Sefelt, are\n\tyour teeth any better?... Good\n\tmorning, Mister Fredrickson... Good\n\tmorning, Mister Harding;\n\tmy, my, you've been biting your\n\tfingernails again...\n\nShe sees McMurphy approaching, wearing a towel around his\nwaist and a scowl on his face.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister McMurphy, patients are not\n\tpermitted to run around in towels.\n\n\t\t\tMCMURPHY\n\tI wanna report a robbery!\n\n\t\t\tBIG NURSE\n\tOn this ward?\n\n\t\t\tMCMURPHY\n\tYeah, some creep stole my\n\tcigarettes!\n\n\t\t\tBIG NURSE \n\tOh, I had them removed.\n\n\t\t\tMCMURPHY\n\tWhat for?\n\n\t\t\tBIG NURSE \n\tPatients are rationed to one pack\n\tof cigarettes a day.\n\nBromden comes drifting by, going in the opposite direction.\nBig Nurse takes his hand.\n\n\t\t\tBIG NURSE (CONT'D)\n\t\t(calling out)\n\tMister Washington!\n\nWashington comes running.\n\n\t\t\tWASHINGTON\n\tYes, Miss Ratched?\n\n\t\t\tBIG NURSE\n\tPlease see to Mister Bromden.\n\n\t\t\tWASHINGTON\n\t\t(taking Bromden by the\n\t\thand)\n\tYes, Miss Ratched...\n\nWashington leads Bromden off. Big Nurse turns to Cheswick and\nseveral other Acutes, who have crowded around.\n\n\t\t\tBIG NURSE\n\tNow you boys hurry along and wash\n\tup for breakfast...\n\t\t(to McMurphy)\n\tYou too, Mister McMurphy.\n\n\t\t\tMCMURPHY\n\tWell, say. How 'bout springing a\n\tpack of cigarettes loose?\n\n\t\t\tBIG NURSE\n\tAfter breakfast, Mister McMurphy,\n\tafter breakfast.\n\n\t\t\tMCMURPHY\n\tYou sure run a tight-assed ship\n\t'round here, don't ya!\n\n\t\t\tBIG NURSE\n\tYes. Now run along like a good boy\n\tand see that you wash up properly.\n\nWIDER ANGLE\n\nA beat, as the Acutes wait for McMurphy's next move, then:\n\n\t\t\tMCMURPHY\n\t'Kay, let's go brush our teeth,\n\tfellas...\n\nMcMurphy turns and crosses toward the washroom, singing at\nthe top of his lungs.\n\n\t\t\tMCMURPHY\n\tOh, Lulu had a baby,\n\tHis name was Sunny Jim,\n\tShe put 'im in a piss pot,\n\tTo teach 'im how to swim.\n\tOh, he swam to the bottom,\n\tHe swam to the top,\n\tLulu got excited,\n\tAn' pulled 'im by his...\n\tCock-tail ginger-ale,\n\tFive cents a glass,\n\tAn' if ya don't like it\n\tYa can shove it up your...\n\tAsk me no more questions,\n\tI'll tell ya no more lies.\n\nBIG NURSE\n\nwatching McMurphy who removes his towel as he enters the\nwashroom.\n\nINT. WASHROOM - DAY\n\nas McMurphy enters to see Warren take a firm grip on\nBromaen's head and Washington goes to work on Bromden's face.\nCAMERA PUSHES INTO EXTREME CLOSEUP of Bromden's fearfully\ndistorted face as the BUZZING SOUND of the ELECTRIC RAZOR\nINTENSIFIES until it is INSUPPORTABLE.\n\nINT. MESS HALL - DAY\n\nWe SEE the attendants spooning food into the sucking pink\nmouths of the vegetables, a shade too fast for swallowing.\n\n\t\t\tMCMURPHY (O.S.)\n\tWhat's wrong with you guys?\n\nWe SEE McMurphy seated with the Acutes, shoveling food down\nhis guillet. The others are barely touching their food.\n\n\t\t\tMCMURPHY\n\tWhy, if I'd have known how soft\n\tthis place was gonna be, I'd have\n\tarranged for my transfer sooner...\n\t\t(holding up his orange\n\t\tjuice)\n\tLook at this here, real orange\n\tjuice!\n\t\t(slugging it down)\n\tHooee, that's good. Why, you\n\tcouldn't pay me to leave this\n\tplace!\n\t\t(slaps his belly)\n\tAll this place lacks is a couple of\n\tsweet gals to liven things up...\n\nHe gets up and carries his tray to the proper place, where he\nnotices Miller loading several other trays onto a dumbwaiter.\nMiller pushes a button and the dumbwaiter goes down. McMurphy\ncrosses to the door to find it blocked by Washington.\n\n\t\t\tMCMURPHY\n\tStand aside, Sam, Nature's callin'.\n\n\t\t\tWASHINGTON\n\tNobody leaves here till seven\n\tthirty.\n\nMcMurphy turns Washington over in his mind, then he looks up\nat the clock above the door.\n\nThe time is 7:28. The second hand sweeping its way toward\n7:29.\n\n\t\t\tMCMURPHY\n\tDon't know if I can hold it that\n\tlong, Sam.\n\n\t\t\tWASHINGTON (CONT'D)\n\tTha's your problem.\n\n\t\t\tMCMURPHY\n\t\t(confidentially)\n\tWho do you like in the opening\n\tgame, Sam?\n\n\t\t\tWASHINGTON (CONT'D)\n\tHuh?\n\n\t\t\tMCMURPHY\n\t\t(turning away)\n\tAsshole.\n\nMcMurphy turns and walks away.\n\nWashington watches him go.\n\n\t\t\tCHESWICK (V.O.)\n\tI wanna know about my cigarettes!\n\nINT. DAY ROOM - DAY\n\nA group meeting is in progress. Doctor Spivey is there.\n\nCheswick is on his feet.\n\n\t\t\tBIG NURSE\n\tSit down, Mister Cheswick.\n\n\t\t\tCHESWTCK\n\t\t(not sitting)\n\tNo, I ain't no kid to have my\n\tcigarettes keep from me like\n\tcookies! Ain't that right, Mack!\n\t\t(McMurphy doesn't respond)\n\tMack???\n\n\t\t\tBIG NURSE\n\tSit down, Mister Cheswick!\n\nCheswick sits -- stunned. A beat; then:\n\n\t\t\tBIG NURSE (CONT'D)\n\t\t(to Cheswick)\n\tYou should have thought about that\n\tbefore you gambled all your\n\tcigarettes away. Is that clear?\n\nCheswick sulks in his seat.\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Cheswick, is that clear!\n\n\t\t\tCHESWICK\n\tYeah...\n\n\t\t\tBIG NURSE\n\tGood...\n\t\t(opens her book)\n\tNow, as I recall, we were making\n\tquite a bit of headway, last time,\n\twith Mister Harding's problem. So,\n\tdoes anyone care to begin?\n\nMcMurphy's hand goes up. No one else's does.\n\n\t\t\tBIG NURSE (CONT'D)\n\tYes, Mister McMurphy.\n\n\t\t\tMCMURPHY\n\tRight... I've been givin' some\n\tserious consideration to what you\n\ttold me about the democratic\n\tsomething of this therapeutic\n\tcommunity of ours, an' I got a few\n\tthings I wanna get off my chest,\n\tbefore we get back to Harding's\n\tproblem.\n\n\t\t\tBIG NURSE\n\tCertainly, Mister McMurphy.\n\n\t\t\tMCMURPHY\n\tRight!\n\nMcMurphy takes a folded sheet of paper out of his pocket,\nunfolds it, studies it and begins.\n\n\t\t\tMCMURPHY\n\t'Kay... Item one... I've been\n\tthinkin' 'bout the age problem we\n\tgot on this ward. You know, the\n\tyoung an' old livin' together, an'\n\tI was thinkin' what a great thing\n\tit would be if the music was turned\n\tup louder. Louder so the old fellas\n\tcould hear better...\n\nDoctor Spivey nods with approval.\n\nBig Nurse doesn't.\n\nThe Acutes are bewildered.\n\n\t\t\tMCMURPHY\n\tBut then I got to thinkin', the\n\tmusic is so loud already, it makes\n\tit difficult for the young fellas\n\tto hold a decent conversation...\n\nNods and murmurs of approval from the Acutes.\n\nBig Nurse can only wait for McMurphy's next move.\n\n\t\t\tMCMURPHY\n\tWell, I was turnin' this dilemma\n\tover in my head, when I happened to\n\thit on that old tub room out there,\n\tan' I said to myself, McMurphy, I\n\tsaid, that place would make a great\n\tsecond day room. A sort of game\n\troom for the young fellas. Whadaya\n\tthink, Doc?\n\n\t\t\tSPIVEY\n\tIt is worth considering... Miss\n\tRatched?\n\n\t\t\tBIG NURSE\n\tThe point is well taken, Doctor,\n\tbut do we have the necessary\n\tpersonnel to cover a second day\n\troom?\n\n\t\t\tSPIVEY\n\tWell, since it will be largely the\n\tChronics who remain here, one aide\n\tand one nurse should easily be able\n\tto handle any situation that might\n\toccur.\n\t\t(he turns to the patients)\n\tWhat do you think, men, is it\n\tworkable?\n\n\t\t\tCHESWICK\n\tRight, Doc. It's workable.\n\nSeveral other Acutes voice in the affirmative.\n\n\t\t\tSPIVEY\n\tFine!\n\n\t\t\tBIG NURSE\n\tGood. Good. Yes, yes, I think we\n\tshould give it a trial period. So!\n\tMay we get back to Mister Harding's\n\tproblem...\n\t\t(she sees McMurphy's hand\n\t\tup)\n\tYes, Mister McMurphy?\n\n\t\t\tMCMURPHY\n\tI'm not finished yet.\n\n\t\t\tBIG NURSE \n\tGo on...\n\n\t\t\tMCMURPHY\n\t\t(looking at his list)\n\t'Kay, item two. Tomorrow, and\n\tlisten carefully to me, you ding-a\n\tlings. Tomorrow is the opening game\n\tof the World Series an' what I want\n\tis to take a vote on switchin' the\n\tgroup meetin' to later on in the\n\tday, so we can watch the ballgame.\n\n\t\t\tBIG NURSE\n\tJust a minute, Mister McMurphy!\n\n\t\t\tMCMURPHY\n\tYeah?\n\n\t\t\tBIG NURSE \n\tPlease understand, the schedule has\n\tbeen set up for a delicately\n\tbalanced reason that would be\n\tthrown into turmoil by a switch of\n\troutines.\n\n\t\t\tMCMURPHY\n\tThe hell with the schedule, you can\n\tget back to the schedule next week\n\twhen the series is over. What I\n\twant is a vote on it right now!\n\n\t\t\tCHESWICK\n\tI second the motion!\n\n\t\t\tMCMURPHY\n\tAtta boy, Cheswick!\n\n\t\t\tBIG NURSE\n\tVery well! All those in favor,\n\tplease raise your hands.\n\nBig Nurse casts a watchful eye over the patients.\n\n\t\t\tMCMURPHY\n\t\t(raising his hand)\n\tOkay, raise your hands.\n\nOnly Cheswick's goes up.\n\n\t\t\tMCMURPHY\n\tCome on', what is this crap? Who\n\twants to watch the World Series?\n\nMartini and Scanlon's hands go up.\n\nSeveral Acutes look at them.\n\nScanlon and Martini's hands go down.\n\nMcMurphy can't believe his eyes.\n\n\t\t\tBIG NURSE (CONT'D)\n\t\t(politely)\n\tI count only two, including you,\n\tMister McMurphy. Certainly not\n\tenough to change ward policy.\n\nMcMurphy's hand goes down.\n\n\t\t\tBIG NURSE (CONT'D)\n\tYes. Now was there anything else\n\tyou wanted to discuss, Mister\n\tMcMurphy?\n\n\t\t\tMCMURPHY\n\tNo way.\n\n\t\t\tCHESWICK\n\tNo way.\n\nMcMurphy starts tearing his sheet of paper up into a thousand\npieces.\n\n\t\t\tBIG NURSE\n\t\t(checking her watch)\n\tThen I suggest we turn our\n\tattention back to Mister Harding's\n\tproblem. Would anybody care to\n\tbegin?\n\nShe looks around.\n\nMcMurphy is slouched in his chair.\n\nHarding puts his hands up. No one else does.\n\n\t\t\tBIG NURSE (CONT'D)\n\tYes, Mister Harding?\n\n\t\t\tHARDING\n\tYes, thank you, Miss Ratched. Since\n\tour last meeting I have been\n\treflecting, quite seriously, on the\n\tnature of my problem. Naturally,\n\tI'm referring to the capacity to\n\tobtain the necessary results in\n\torder to obtain... No, no. To\n\tpersonify the very existence of\n\tthat relationship regardless of the\n\tfunction...\n\t\t(he stops, chews his lip,\n\t\tthen continues)\n\tRegardless of the function, we will\n\tconfront the question of... Yes.\n\tYes. The question of...\n\tExistence... Relationship...\n\tFunction... Confront... Yes,\n\tconfronting us in the moment of\n\tdeepest crisis... Yes, the crisis\n\tof our souls. Of our souls, which I\n\tam trying to fully understand the\n\tproblem... the problem. Not to shut\n\tourselves off, but somehow...\n\tSomehow to understand fully our\n\tcapacity... to obtain... to\n\tpersonify... the question...\n\texistence depends... depends on the\n\tquestion... to reflect... to\n\treflect...\n\nHarding, breaks off, sweating; he begins to knead his\nforehead and chew his nails.\n\n\t\t\tHARDING (CONT'D)\n\tTo reflect...\n\nANGLE\n\nSilence as the CAMERA REFLECTS: the room, the patients, the\nstaff, the hallways, the hospital, the grounds, the trees,\nthe sky, ending on.\n\n\t\t\tMARTINI (V.O.)\n\tHold it a minute. What's a man need\n\tto buy thum hotels?\n\nINT. TUB ROOM - NIGHT\n\nBromden is pressed against the wall, watching McMurphy,\nMartini, Scanlon and Cheswick play a game of monopoly. The\nothers are playing cards or just hanging around, a little\nchagrined. Billy is most disturbed by this separation.\n\n\t\t\tMCMURPHY\n\tYou need four houses on every lot\n\tof the same color, Martini. Now\n\tlet's go, for Christsakes.\n\n\t\t\tMARTINI\n\tHold it a minute.\n\nThere's a flurry of money from Martini, red, green and yellow\nbills blowing in every direction.\n\n\t\t\tCHESWICK\n\tLet's go, for Christsakes...\n\n\t\t\tMCMURPHY\n\tIt's your dirty roll, Cheswick.\n\nCheswick rolls the dice.\n\n\t\t\tMCMURPHY\n\tSnake eyes! Hoooeee, that puts you\n\ton my Marvin Gardens, which means\n\tyou owe me three hundred and fifty\n\tdollars.\n\nCheswick starts counting out the money.\n\n\t\t\tMARTINI\n\tWhat's thum other things? Hold it a\n\tminute. What's thum other things\n\tall over the board?\n\n\t\t\tCHESWICK\n\t\t(to Martini)\n\tHow can a man concentrate with you\n\tsitting there hallucinating a mile\n\ta minute...\n\n\t\t\tMCMURPHY\n\tYou just come on with that three\n\tfifty and Martini will take care of\n\thimself... Your dice, Scanlon.\n\n\t\t\tSCANLON\n\tGimme those dice. I'll blow this\n\tboard to pieces. Here we go... \n\t\t(throws the dice)\n\tLebenty leben, count me over\n\televen, Martini...\n\nMartini picks up a house...\n\n\t\t\tSCANLON (CONT'D)\n\tNot that one, you crazy bastard,\n\tthat's my house...\n\nScanlon grabs Martini's hand and tries to get his piece back.\nMartini won't let go.\n\n\t\t\tMCMURPHY\n\tBreak it up, God dammit! Ain't I\n\tgot enough troubles without you\n\tguys messin' around... can't depend\n\ton nobody.\n\n\t\t\tBILLY\n\t\t(from the next table)\n\tSome of us ha-ha-have b-b-been here\n\ta long t-t-time, Randle, and will b\n\tb-be here long after this Wo-Wo\n\tWorld Series of yours is oh-oh-oh,\n\twhat's the use anyway...\n\nMcMurphy slams his fist down on the table, sending the\nmonopoly pieces flying. Martini is crestfallen.\n\n\t\t\tMCMURPHY\n\tWhat's the use! Hooee! It'd do you\n\tbirds some good just to get a\n\tlittle exercise lifting your arms\n\tto vote!\n\n\t\t\tHARDING\n\tA baseball game isn't worth the\n\trisk, my friend.\n\n\t\t\tMCMURPHY\n\tIt is to me! An' if I hafta bust\n\tway outta this place to see it, I\n\twill!\n\n\t\t\tCHESWICK\n\tRight!\n\n\t\t\tFREDRICKSON\n\tOh, yeah?\n\n\t\t\tMCMURPHY\n\tYeah!\n\n\t\t\tSEFELT\n\tBig man!\n\n\t\t\tMCMURPHY\n\tYeah, how much you wanna bet?\n\n\t\t\tSEFELT \n\tOn what?\n\n\t\t\tMCMURPHY\n\tThat me an' my buddy, Cheswick,\n\twe'll be downtown tomorrow watchin'\n\tthe ballgame while you suckers are\n\tsittin' around this goddamn\n\tnursery!\n\n\t\t\tHARDING\n\tAnd how do you propose to\n\taccomplish that little feat, my\n\tfriend?\n\n\t\t\tMCMURPHY\n\tThat's between me an' myself. So\n\twhy don't you boys just shove off.\n\tI got some planning to do.\n\nMcMurphy sits and resumes his game of solitaire. Martini and\nScanlon are putting the monopoly game back together again.\n\nBromden spots (or he thinks he spots) one of the attendants\nlistening at the door. He wants to warn the others, but\ndoesn't know how.\n\n\t\t\tSEFELT\n\tMaybe he'll just show Miss Ratched\n\this big thing an' she'll open the\n\tdoor for him.\n\nSefelt and Frederickson smile at each other.\n\nBromden slides along the wall toward the door.\n\n\t\t\tMCMURPHY\n\tMaybe I'll just use that thick\n\tskull of yours as a batterin' ram,\n\tSefelt.\n\n\t\t\tSEFELT (CONT'D)\n\tWhy, my head would just squash like\n\tan eggplant, McMurphy.\n\nFredrickson and Sefelt snicker in their hands.\n\n\t\t\tMCMURPHY\n\tYou think it's funny, huh?\n\n\t\t\tTABER\n\tYeah, you don't know how to get\n\toutta this place!\n\nBromden reaches the door and looks out. No one is there.\n\n\t\t\tMCMURPHY\n\tPut your money where your mouth is,\n\tTaber.\n\n\t\t\tTABER (CONT'D)\n\tYeah, yeah, you're a fucking phony,\n\tMcMurphy!\n\nBromden turns back to the room to see McMurphy slam his fist\ndown on the table; the monopoly game goes flying.\n\n\t\t\tMCMURPHY\n\t\t(rising and turning on the\n\t\tothers, who back off)\n\tYou want me to show ya! You want me\n\tto show ya how!\n\n\t\t\tTABER (CONT'D)\n\tYeah, yeah, show me. Show me how!\n\n\t\t\tMCMURPHY\n\tAll right!\n\nHe looks wildly around the room, spots the machine, crosses\nto it and smacks it with his hand.\n\n\t\t\tMCMURPHY\n\tWith this thing! I'm gonna put this\n\tthing right through the window,\n\tthat's how!\n\n\t\t\tHARDING\n\tYou mean you're going to try to\n\tpick that thing up and shove it\n\tthrough the window?\n\n\t\t\tMCMURPHY\n\tYou're fuckin' A-right, I am!\n\n\t\t\tHARDING (CONT'D)\n\tWith your own two hands?\n\n\t\t\tMCMURPHY\n\tYou heard me the first time!\n\n\t\t\tTABER\n\tI'll bet a buck you don't do it!\n\n\t\t\tMCMURPHY\n\tYou're on!\n\n\t\t\tBILLY\n\tM-M-Mack, y-y-y-you c-c-can't l-l\n\tlift that thing!\n\n\t\t\tMCMURPHY\n\tStand aside, son. Any more takers?\n\n\t\t\tSEFELT\n\tI'll bet a dollar.\n\n\t\t\tFREDRICKSON\n\tMe, too...\n\n\t\t\tMCMURPHY\n\tRight!\n\n\t\t\tMARTINI\n\tA nickel.\n\n\t\t\tSCANLON\n\tA dime.\n\n\t\t\tMCMURPHY\n\tOkay. Who else?\n\n\t\t\tHARDING\n\tTwenty-five dollars.\n\n\t\t\tMCMURPHY\n\t\t(knows he's taking a bad\n\t\tbet)\n\tOkay, Harding, you're on.\n\n\t\t\tHARDING \n\tOkay, sucker.\n\n\t\t\tMCMURPHY\n\tYeah... Okay, stand aside, you\n\tguys! You're usin' up my oxygen!\n\nThe Acutes stand aside and McMurphy steps up to the machine.\n\nHe shifts his feet to get a good stance, wipes his hands on\nhis thighs, leans down and gets hold of the levers on each\nside, and strains.\n\nBromden watches, in awe of McMurphy.\n\nMcMurphy turns loose, straightens up and shifts his feet for\na better position.\n\n\t\t\tHARDING\n\tGiving up?\n\n\t\t\tMCMURPHY\n\tJust warmin' up.\n\nHe grabs the levers again. His whole body shakes with the\nstrain. For just a second we HEAR the cement GRIND. Then his\nbreath explodes and he falls back limp against the wall.\nThere's blood on his hands. No sound but his rasping breath.\nHe opens his eyes and looks around. Then pulls out a\npocketful of IOU's and tries to sort them out, but his hands\nare frozen into red claws. He throws the whole bundle on the\nfloor and walks out. At the door, he turns back.\n\n\t\t\tMCMURPHY\n\tBut I tried. Goddammit, I sure as\n\thell did that much. Didn't I?\n\nMcMurphy exits.\n\nREACTION SHOT OF ACUTES\n\nSHOT OF BROMDEN\n\nlooking at the machine. A long beat.\n\nINT. MEN'S DORM - NIGHT\n\nThe patients are getting ready for bed when Billy approaches\nMcMurpby, who is in bed.\n\n\t\t\tBILLY\n\tM-M-Mack...\n\nMcMurphy turns away from Billy, who crosses to the other side\nof the bed.\n\n\t\t\tBILLY (CONT'D)\n\tM-M-Mack, I-I-I'm sorry!\n\n\t\t\tHARDING\n\tLeave him alone, he's pouting.\n\n\t\t\tBILLY\n\tY-Y-Y-You leave him alone!\n\n\t\t\tMCMURPHY\n\tThat's okay, kid...\n\n\t\t\tBILLY \n\tTh-th-then y-y-you're n-n-not m-m\n\tmad?\n\n\t\t\tMCMURPHY\n\tNo, kid, it was my own stupidity,\n\tthat's what pissed me off.\n\n\t\t\tBILLY \n\tO-o-o-oh...\n\n\t\t\tMCMURPHY\n\tWhat we're gonna have to do is pull\n\tthis ballclub together for our next\n\tplay. 'Kay!\n\n\t\t\tBILLY\n\t'K-k-kay, Mack!\n\nINT. HALLWAY - DAY\n\nWashington, Warren and Miller are at the end of the hallway,\nlistening to a small RADIO. We can HEAR the SPORTS ANNOUNCER\ngiving the line-up for the opening game of the World Series.\n\n\t\t\tWASHINGTON'S POV\n\tWay down the hall, the Group\n\tMeeting is SEEN in progress.\n\nINT. DAY ROOM - DAY\n\nA Group Meeting is in progress and Big Nurse is honed in on\nBilly.\n\n\t\t\tBIG NURSE\n\tTry, Billy, try...\n\nBilly tries, but can't talk.\n\nThe other Acutes are bored, restive, waiting.\n\nMcMurphy has ants in his pants as Big Nurse speaks to Billy.\n\n\t\t\tBIG NURSE (CONT'D)\n\tWas it your idea to visit her on\n\tSunday?\n\n\t\t\tBILLY\n\tY-y-y-yes...\n\n\t\t\tBIG NURSE\n\tTell us about it...\n\n\t\t\tBILLY\n\tI-I-I-I c-c-c-came over S-S-S\n\tSunday m-m-m-morning after ch-ch-ch\n\tchurch and br-br-brought her s-s\n\tsome flowers, and I s-s-said, I\n\tsaid, 'C-C-C-Celia, will you muh\n\tmuh-muh-muh-muh...' till the girl\n\tbroke out l-l-laughing.\n\nBilly laughs at himself.\n\n\t\t\tBIG NURSE\n\tWhat was it about her that\n\tdisturbed you so, Billy?\n\n\t\t\tBILLY\n\t\t(rubbing scars on his\n\t\twrist)\n\tI was in luh-love with her.\n\n\t\t\tBIG NURSE\n\tBilly, were you afraid of her, or\n\tof her love?\n\nNo response from Billy.\n\n\t\t\tBIG NURSE (CONT'D)\n\tThat was the first time you\n\tattempted to commit suicide, wasn't\n\tit?\n\t\t(no response)\n\tYou must try to talk about it,\n\tBilly.\n\n\t\t\tMCMURPHY\n\tJesus Christ, the man doesn't want\n\tto talk, so get off his back an'\n\tlet's get on to some new business.\n\n\t\t\tBIG NURSE \n\tMister McMurphy, the purpose of\n\tthis meeting is therapy. Group\n\ttherapy.\n\n\t\t\tMCMURPHY\n\tYeah, yeah, the hell with that\n\tcrap! The World Series is goin' on\n\tright' now an' that's therapy also!\n\n\t\t\tBIG NURSE \n\tLet me pose a question to the\n\tgroup: do any of you feel that\n\tMister McMurphy is perhaps imposing\n\this personal desires on you too\n\tmuch?\n\n\t\t\tMCMURPHY\n\tWhat the hell does that have to do\n\twith it? This is an important event\n\tand I want a vote on it!\n\n\t\t\tCHESWICK\n\tYeah, let's vote on it!\n\n\t\t\tBIG NURSE\n\tWill one more vote satisfy you?\n\n\t\t\tMCMURPHY\n\tYeah, it'll satisfy me.\n\n\t\t\tBIG NURSE \n\tVery well. What is it you're\n\tproposing, Mister McMurphy?\n\n\t\t\tMCMURPHY\n\tI'm proposing a re-vote on watchin'\n\tthe ballgame!\n\n\t\t\tBIG NURSE \n\t\t(to the patients)\n\tA vote is before the group.\n\n\t\t\tMCMURPHY\n\tOkay, I wanna see the hands. I\n\twanna see which of you birds has\n\tany guts.\n\n\t\t\tBIG NURSE \n\tEveryone in favor of changing the\n\tschedule raise his hand.\n\nThe first hand to come up is Cheswick's. Then McMurphy's.\nThen Martini, Scanlon, Sefelt, Fredrickson, Billy and Taber.\n\nHarding doesn't vote.\n\nBig Nurse starts counting the hands.\n\nMcMurphy, his face beaming, counts the hands.\n\n\t\t\tMCMURPHY\n\tThat's it! We made it!\n\n\t\t\tBIG NURSE\n\tI'm sorry, Mister McMurphy, I count\n\tonly eight.\n\n\t\t\tMCMURPHY\n\tSo do I!\n\n\t\t\tBIG NURSE \n\tBut there are eighteen patients on\n\tthe ward, Mister McMurphy.\n\n\t\t\tMCMURPHY\n\t\t(the light dawning)\n\tYou mean to tell me you're gonna\n\tcount those old birds over there?\n\n\t\t\tBIG NURSE \n\tI'm sorry, Mister McMurphy, but you\n\tmust have a majority to change ward\n\tpolicy.\n\n\t\t\tMCMURPHY\n\tWell, I'll be a son-of-a-bitch...\n\n\t\t\tBILLY\n\tB-But, M-M-Miss R-Ratched, y-you n\n\tnever c-c-counted th-their votes\n\tbefore!\n\nA beat.\n\n\t\t\tBIG NURSE\n\t\t(losing ground)\n\tYou mean you don't want their votes\n\tto count, Billy!\n\n\t\t\tBILLY\n\tI-I-I...\n\n\t\t\tMCMURPHY\n\tWell, screw that noise!\n\nMcMurphy rises and, taking his chair, he crosses toward the\ntelevision set.\n\n\t\t\tBIG NURSE\n\tSit down, Mister McMurphy!\n\nMcMurphy turns the TV on, flips the channel, then sits and\nwaits for a picture.\n\n\t\t\tBIG NURSE (CONT'D)\n\tI want you to turn the television\n\toff and return to your place!\n\nA picture swirls onto the TV screen. The ballgame is in\nprogress (documentary footage to be used).\n\nMartini rushes over and joins McMurphy. Scanlon follows hot\non his heels as --\n\n\t\t\tMCMURPHY\n\tHoo-wee! Man, all I need me now is\n\ta can of beer and a red-hot.\n\nCheswick gets up and starts across when --\n\n\t\t\tBIG NURSE\n\tSit down, Mister Cheswick.\n\nCheswick stops and stands there, helpless to move.\n\n\t\t\tCHESWICK\n\tMack...\n\nMcMurphy is deep into the game.\n\nINSERT - TV SCREEN\n\nOn the screen a great play is taking place, and at the\nbreathtaking moment the TV picture swirls into a little eye\nof light -- then nothing.\n\nBACK TO SCENE\n\nThe Acutes are left with their mouths hanging open.\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(over loudspeaker)\n\tI want you men to return to your\n\tproper places. The group meeting is\n\tnot over!\n\nMcMurphy continues looking at the blank TV screen as the\nAcutes look from McMurphy to Big Nurse, not knowing what to\ndo next when --\n\n\t\t\tMCMURPHY\n\t\t(jumping up and shouting\n\t\tat the blank TV screen)\n\tA hit! It's a hit! He's rounding\n\tfirst, heading for second. Here\n\tcomes the throw. He's sliding...\n\tand... he's safe! He's safe!\n\t\t(McMurphy whistles and\n\t\tclaps his hands)\n\tHoo-wee! Whatta game! Whatta game!\n\tCome on, Koufax! Strike 'em out!\n\nThe Acutes are stunned at McMurphy's outburst.\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(over loudspeaker)\n\tMister McMurphy, you are\n\tdeliberately violating the\n\trules!...\n\n\t\t\tMCMURPHY\n\tHe's into his wind-up. Here comes\n\tthe pitch. Strike on the inside\n\tcorner!\n\nSefelt, Fredrickson, Billy and Taber get up and cross toward\nthe TV. Harding is the only one who doesn't join them.\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(over loudspeaker)\n\tYou men remain seated!\n\n\t\t\tMCMURPHY\n\t\t(focusing in on TV screen)\n\tHe's into his wind-up. Here's the\n\tnext pitch... and it's a hit! It's\n\ta hit!\n\n\t\t\tMARTINI\n\t\t(jumping up and down)\n\tI saw thum! I saw thum!\n\n\t\t\tSCANLON\n\tMe, too! Me, too!\n\n\t\t\tSEFELT\n\tYes, I see it! I see it!\n\n\t\t\tMCMURPHY\n\t\t(on his feet, shouting)\n\tYa-hoo, let's'play ball!\n\nThe other Acutes pick up on McMurphy and start shouting at\nthe blank TV screen.\n\n\t\t\tACUTES\n\tYa-hoo! \n\tIt's a hit! \n\tA triple! \n\tIt's a home run! \n\tA double! \n\tHe's out! \n\tWhadaya blind? \n\tHe's safe by a mile! \n\t\t(AD LIB)\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(over loudspeaker)\n\tYou boys, stop this and go to your\n\tassignments! Mister McMurphy, I\n\twant you to set an example...\n\n\t\t\tMCMURPHY\n\t'Kay, it's two outs, bases loaded\n\tas Koufax steps up to the mound...\n\tChecks the runners... goes into his\n\twind-up... Here comes the three-two\n\tpitch... And it's a fly ball into\n\tdeep center. Mantle is going back.\n\tHe's going back! Back! His back is\n\tup against the wall... and... he\n\tcatches it! He catches it!\n\nThe Acutes are shouting, cheering, stomping and dancing in\neach other's arms.\n\n\t\t\tBIG NURSE'S VOICE\n\t\t(over loudspeaker)\n\tYou men stop this! Mister\n\tWashington! Miller! Warren!\n\nBig Nurse's last words overload the intercom and the system\npeaks out. Big Nurse's mouth continues to work in frantic\ncircles as Washington, Miller and Warren rush to quell the\nuproar.\n\nINT. SPIVEY'S OFFICE - DAY\n\nDoctor Spivey is seated behind his desk, looking over\nMcMurphy's papers.\n\nMcMurphy sits facing him.\n\n\t\t\tSPIVEY\n\tHow are you feeling?\n\n\t\t\tMCMURPHY\n\tJust fine, Doc... In fact, I think\n\tI might've put on a couple of\n\tpounds since I got here.\n\n\t\t\tSPIVEY\n\tGood, good, and how are you getting\n\talong on the ward?\n\n\t\t\tMCMURPHY\n\tCome on, Doc, you know as well as I\n\tdo what's been comin' down in that\n\tloony bin.\n\n\t\t\tSPIVEY \n\tYes, well, Miss Ratched feels that\n\tyou're a disturbing influence on\n\tthe other patients.\n\n\t\t\tMCMURPHY\n\tShoot, Doc, the only one I'm\n\tdisturbing is that old nurse and\n\ther fixed ways. That's all.\n\n\t\t\tSPIVEY \n\tYes, that may be so, but in making\n\ta careful study of your past\n\trecord, along with your behavior\n\tsince you arrived here, my feeling\n\tis that you are not mentally ill\n\tand it is going to be my\n\trecommendation that you be returned\n\tto Pendleton where they are better\n\tequipped to handle your case.\n\nThis is the kiss of death to McMurphy.\n\n\t\t\tMCMURPHY\n\tCome on, Doc, you must be kiddin'.\n\n\t\t\tSPIVEY\n\tI'm afraid not.\n\n\t\t\tMCMURPHY\n\tJesus, that old nurse sure wants my\n\tass in a sling, don't she!\n\n\t\t\tSPIVEY \n\tNo, Mister McMurphy, it's just that\n\twe cannot offer you the guidance\n\tand assistance that you would\n\treceive at Pendleton.\n\n\t\t\tMCMURPHY\n\tGuidance and assistance! That's\n\tinsane! Doc, ya gotta help me.\n\n\t\t\tSPIVEY \n\tI'm sorry, but I can't keep you\n\there.\n\n\t\t\tMCMURPHY\n\tWhen?\n\n\t\t\tSPIVEY\n\tWe'll let you know.\n\nREACTION SHOT of McMurphy.\n\nEXT. BASKETBALL COURT - DAY\n\nWashington and Warren are sitting on the grass watching\nMartini, Scanlon, Harding and Billy, who are positioned on\nthe court waiting on McMurphy who is under the board with\nBromden.\n\nCheswick and the other patients hang around off court as:\n\n\t\t\tMCMURPHY\n\t\t(with great physical and\n\t\tvocal emphasis throughout\n\t\tentire scene)\n\tOkay, Chief. This is your spot! I\n\tdon't want you to move from this\n\tspot! Never!... 'Kay, now, take the\n\tball! Raise your hands, like\n\tthis...\n\nMcMurphy raises his hands above his head. Bromden follows\nsuit.\n\n\t\t\tMCMURPHY\n\tThat's good! That's a good boy,\n\tChief! Now jump and put it in!\n\nMcMurphy jumps. Bromden doesn't. McMurphy does this a couple\nof times. Each time Bromden remains motionless.\n\n\t\t\tHARDING\n\tHe can't hear you!\n\n\t\t\tMCMURPHY\n\tI know, goddammit! You don't have\n\tta tell me that!\n\n\t\t\tHARDING \n\tSo why are you talking to him?\n\n\t\t\tMCMURPHY\n\tI'm not talkin' to him! I'm talkin'\n\tto myself! It helps me think!\n\n\t\t\tHARDING \n\tIt doesn't help him.\n\n\t\t\tMCMURPHY\n\tWell, it doesn't hurt him either!\n\t\t(turning to Bromden)\n\tDoes it, Chief!\n\t\t(no response)\n\tSee, it doesn't hurt him.\n\t\t(to Bromden)\n\tJump! An' put it in!\n\nMcMurphy jumps. Bromden doesn't move.\n\n\t\t\tHARDING\n\tWell, I think you're just confusing\n\thim...\n\nBromden jumps.\n\n\t\t\tMCMURPHY\n\tHa! Did ya see that!\n\t\t(calling to Cheswick on\n\t\tthe sidelines)\n\tHey, Cheswick!\n\n\t\t\tCHESWICK\n\tYeah, Mack?\n\n\t\t\tMCMURPHY\n\tCome here!\n\nCheswick runs over.\n\n\t\t\tCHESWICK\n\tYeah, Mack?\n\n\t\t\tMCMURPHY\n\tLet me get on your shoulders.\n\n\t\t\tCHESWICK \n\tSure, Mack...\n\nMcMurphy climbs on his shoulders.\n\n\t\t\tMCMURPHY\n\t'Kay, wheel me around to the\n\tbasket... 'Kay, easy, easy. Hold\n\tit! 'Kay, now.\n\t\t(he sees Bromden has\n\t\twalked away)\n\tHey, Chief, come back!\n\nBromden doesn't hear.\n\n\t\t\tMCMURPHY\n\tCheswick, go get 'im!\n\nCheswick goes after Bromden, catches him, and McMurphy\nlatches onto him.\n\n\t\t\tMCMURPHY\n\tNow, wheel me to the basket.\n\nCheswick, straining under the weight of McMurphy, turns\ntoward the basket.\n\nINT. MEN'S DORM - NIGHT\n\nas Bromden, chewing his gum, watches McMurphy ease his way\nout of bed and silently cross down the aisle, past the sleep\npatients, toward the day room.\n\nINT. DAY ROOM - NIGHT\n\nas McMurphy crosses the day room, past the nurses' station\nwhere Turkle is asleep.\n\nINT. HALLWAY - NIGHT\n\nas McMurphy crosses down the hallway and stops at the mess\nhall door. He tries the handle. The door is locked. McMurphy\nlooks up at the open transom, ponders it, then jumps up and\ngrabs the door lintel. He tries to lift himself up, but can't\nmake it when suddenly he is lifted up to the level of the\ntransom by Bromden.\n\nMcMurphy worms his way through the transom and disappears\ndown the other side.\n\nCAMERA HOLDS on Bromden who waits. A long beat. There is a\nstrange HUMMING SOUND HEARD O.S. Another beat, then the door\nopens.\n\nMcMurphy smiles at Bromden.\n\n\t\t\tMCMURPHY\n\t\t(pointing to the floor)\n\tWait here, Chief.\n\t\t(more to himself as he\n\t\tstarts down hall)\n\tHeh, heh, I'll show 'em who's\n\tcrazy.\n\nINT. MEN'S DORM - NIGHT\n\nMcMurphy is nudging Cheswick awake.\n\n\t\t\tMCMURPHY\n\tHey, Cheswick! Wake up!\n\n\t\t\tCHESWICK\n\t\t(waking up)\n\tYeah, Mack, what is it?\n\n\t\t\tMCMURPHY\n\tI'm leaving. Goodbye!\n\n\t\t\tCHESWICK\n\t\t(sitting up)\n\tWhere ya goin', Mac?\n\n\t\t\tMCMURPHY\n\tShhh...\n\nMcMurphy turns and crosses to Billy.\n\n\t\t\tMCMURPHY\n\t\t(waking Billy)\n\tHey, Billy. Billy boy, wake up and\n\tsay goodbye to your ol' buddy.\n\n\t\t\tBILLY\n\t\t(waking up)\n\tW-w-w-what is it, M-M-Mac?\n\n\t\t\tMCMURPHY\n\tSo long, kid.\n\n\t\t\tBILLY\n\tWh-wh-wh-wh...\n\n\t\t\tMCMURPHY\n\tShhh...\n\nMcMurphy turns from the bewildered Billy and crosses to\nMartini.\n\n\t\t\tMCMURPHY\n\t\t(nudging Martini awake)\n\tPsst! Hey, Martini, wake up!\n\n\t\t\tMARTINI\n\t\t(waking up)\n\tYeah, Mac?\n\n\t\t\tMCMURPHY\n\tBye-bye.\n\nMcMurphy turns to Scanlon.\n\n\t\t\tMCMURPHY\n\tScanlon! Hey, Scanlon, wake up!\n\n\t\t\tSCANLON\n\t\t(waking up)\n\tYeah, what's up?\n\n\t\t\tMCMURPHY\n\tShhhh. See ya around the ball park.\n\nMcMurphy crosses to Fredrickson and wakes him.\n\n\t\t\tFREDRICKSON\n\t\t(waking up)\n\tWhat? What?\n\n\t\t\tMCMURPHY\n\tSo long, Freddy. Don't take any\n\twooden nickles.\n\n\t\t\tFREDRICKSON\n\t\t(sitting up)\n\tWhat?\n\n\t\t\tMCMURPHY\n\tShhh...\n\nThe other patients are sitting up, some of them getting out\nof bed as McMurphy turns to Sefelt who is snoring. McMurphy\npinches his nose and Sefelt wakes up.\n\n\t\t\tMCMURPHY\n\tBye-bye, pussy cat.\n\nMcMurphy crosses to Taber.\n\n\t\t\tMCMURPHY\n\t\t(waking Taber)\n\tUp an' at 'em, Taber.\n\n\t\t\tTABER\n\t\t(waking up)\n\tWhat's going on?\n\n\t\t\tMCMURPHY\n\tShhhh. Time to say goodbye.\n\nMcMurphy turns and crosses to Harding.\n\n\t\t\tMCMURPHY\n\tHey, Hard-on. Wake up, Dumbo.\n\nHarding opens his eyes and looks at McMurphy.\n\n\t\t\tMCMURPHY (CONT'D)\n\tYa owe me twenty-five bucks.\n\n\t\t\tHARDING\n\tWhat for?\n\n\t\t\tMCMURPHY\n\tI'm busting outta this place.\n\n\t\t\tHARDING \n\tThat's nice. Send me a post card.\n\nHarding turns his back to McMurphy.\n\n\t\t\tMCMURPHY\n\t\t(turning to the others who\n\t\thave gathered around)\n\tSo long suckers.\n\n\t\t\tBILLY\n\tWh-wh-where ya going, M-M-Mac?\n\n\t\t\tCHESWICK\n\tHow ya gettin' out, Mac?\n\n\t\t\tMCMURPHY\n\tShhh... That's for me to know an'\n\tyou to find out.\n\n\t\t\tTABER\n\tBullshit. You ain't got no way out!\n\n\t\t\tMCMURPHY\n\tOh, yeah?\n\n\t\t\tTABER\n\tYeah!\n\n\t\t\tMCMURPHY\n\tHow much ya wanna bet?\n\n\t\t\tTABER (CONT'D)\n\tTen bucks.\n\n\t\t\tMCMURPHY\n\tYou're on.\n\t\t(to the others)\n\tLet's go! An' keep it quiet.\n\nMcMurphy starts down the aisle. The others follow.\n\nINT. DAY ROOM - NIGHT\n\nas McMurphy and the other patients cross the day room, past\nthe nurses' station, where Turkle shifts in his sleep.\n\nINT. HALLWAY - NIGHT\n\nas McMurphy and the patients cross down the hallway and enter\nthe mess hall followed by Bromden.\n\nINT. MESS HALL - NIGHT\n\nCheswick, Bromden, Martini, Scanlon, Sefelt, Fredrickson,\nBilly, Taber and McMurphy, stand looking at the dumbwaiter.\n\n\t\t\tBILLY\n\tWh-wh-what's d-d-down th-there, M-M\n\tMac?\n\n\t\t\tTABER\n\tWhere's it go?\n\n\t\t\tMCMURPHY\n\tOut. It's the way out. So just keep\n\tit in your minds if ya ever wanna\n\tmake use of it.\n\n\t\t\tTABER \n\tI don't believe it...\n\n\t\t\tFREDRICKSON\n\tNeither do I...\n\n\t\t\tSEFELT\n\tMe too...\n\n\t\t\tMARTINI\n\tI wanna see it...\n\n\t\t\tSCANLON\n\tMe too! Me too!\n\n\t\t\tBILLY\n\tY-y-yeah, p-p-prove it, M-M-Mac!\n\n\t\t\tCHESWICK\n\tYeah, show us, Mac!\n\n\t\t\tMCMURPHY\n\tShhh. Wait a minute. You guys are\n\tgonna screw up my plans. So just\n\tgone on back to bed like nothin'\n\thappened.\n\n\t\t\tMARTINI\n\tNo! I wanna go!\n\n\t\t\tSCANLON\n\tMe too! Me too!\n\nSeveral of the others chime in.\n\n\t\t\tMCMURPHY\n\tShhh. Hold it down! I'll take you\n\tguys down, but ya gotta come right\n\tback up! 'Kay?\n\n\t\t\tPATIENTS\n\t\t(simultaneously)\n\t'Kay, Mac!\n\n\t\t\tMCMURPHY\n\tShhh... Remember this is a\n\tprivilege, so I don't want none of\n\tyou goons fuckin' up. Kay?\n\n\t\t\tPATIENTS\n\t\t(simultaneously)\n\t'Kay, Mac!\n\n\t\t\tMCMURPHY\n\t'Kay, let's see...\n\t\t(he checks the men out)\n\tCheswick first ... then Billy...\n\tMartini... Scanlon... Sefelt...\n\tFredrickson... Taber an' the\n\tChief... 'Kay\n\n\t\t\tPATIENTS\n\t\t(simultaneously)\n\t'Kay!\n\n\t\t\tMCMURPHY\n\tShhh!\n\nINT. TUNNEL - NIGHT\n\nThe patients are waiting in the tunnel, which is used as an\nunderground connecting system to the institutional buildings,\nas McMurphy gets out of the dumbwaiter.\n\n\t\t\tMCMURPHY\n\t\t(looking around)\n\tWhere's Martini and Scanlon?\n\n\t\t\tCHESWICK\n\t\t(pointing)\n\tThey went that way.\n\n\t\t\tMCMURPHY\n\tCharlie, ya can't ever let those\n\tgoons outta ya sight! Understand!\n\n\t\t\tCHESWICK\n\tRight, Mack!\n\nFar down the tunnel Martini and Scanlon are briefly SEEN as\nthey skitter across the tunnel.\n\n\t\t\tSEFELT\n\tThere they are!\n\n\t\t\tMCMURPHY\n\tHey, Martini! Psst! Scanlon! Ya\n\tdumb goons, come back here!\n\t\t(starting after them)\n\tCome on, let's get 'em!\n\nMcMurphy starts down the tunnel. The others don't move.\n\n\t\t\tMCMURPHY\n\t\t(calling back)\n\tCome on, you guys, let's stick\n\ttogether.\n\nThe Acutes follow McMurphy. They run down to the intersection\nand turn the corner.\n\nNo sign of Martini or Scanlon.\n\nSomewhere a DOOR is HEARD SLAMMING CLOSED and FOOTSTEPS are\nHEARD coming their way.\n\n\t\t\tTABER\n\tSomebody's coming!\n\n\t\t\tMCMURPHY\n\tShhh!\n\t\t(he listens then)\n\tThis way!\n\nMcMurphy hustles the men round the corner as two aides\npushing a gurney come wheeling by.\n\n\t\t\tBILLY\n\tI-I-I th-th-think we sh-sh-should\n\tgo back!\n\n\t\t\tSEFELT\n\tYeah, my feet are gettin' cold.\n\n\t\t\tFREDRICKSON\n\tMine, too!\n\n\t\t\tMCMURPHY\n\tWe'll go back just as soon as we\n\tfind those guys! 'Kay?\n\n\t\t\tACUTES\n\t\t(simultaneously)\n\t'Kay, Mack!\n\nThe band takes off down tbe tunnel, calling out in loud\nwhispers, \"Martini! Scanlon! Psst! Where are you?\"\n\nDown one tunnel and up another -- till they turn a corner and\nsee an open door.\n\nThey go to the door and peer out. Steps lead up to the\noutside world.\n\n\t\t\tMCMURPHY\n\tThey must be up there!\n\n\t\t\tCHESWICK\n\tYeah!\n\n\t\t\tBILLY\n\tL-L-Let-'s go b-back!\n\nSeveral Acutes express the same desire.\n\n\t\t\tMCMURPHY\n\tCome on, don't crap out on me now.\n\tWe got two buddies out there!\n\n\t\t\tBILLY (CONT'D)\n\tI-I d-d-don't know! M-M-Miss R\n\tRatched g-g-g-g...\n\n\t\t\tMCMURPHY\n\tFuck Miss Ratched!\n\nMcMurphy crosses out and up the stairs.\n\nThe Acutes look at each other. A beat, then:\n\n\t\t\tMCMURPHY (O.S.)\n\tWow! Look at this!\n\nThe Acutes don't move.\n\n\t\t\tMCMURPHY (O.S.)\n\tHey, you guys, come on up here and\n\ttake a gander at this!\n\nThe Acutes inch their way out the door and up the steps.\n\nEXT. INSTITUTIONAL GROUNDS - NIGHT\n\nas the Acutes join McMurphy to see the moon low in the sky,\nsilhouetting the trees and buildings, and Martini chasing\n\nScanlon across the wet grounds.\n\n\t\t\tCHESWICK\n\tThere they are!\n\n\t\t\tMCMURPHY\n\t\t(his attention elsewhere)\n\tHey, what's that?\n\n\t\t\tSEVERAL ACUTES\n\t\t(simultaneously)\n\tWhat? Where?\n\n\t\t\tMCMURPHY\n\t\t(pointing)\n\tOver there!\n\n\t\t\tSEFELT\n\t\t(squinting)\n\tI don't know...\n\n\t\t\tBILLY\n\tI-i-it's a b-b-bus!\n\n\t\t\tMCMURPHY\n\tA bus?\n\n\t\t\tBILLY (CONT'D)\n\tY-y-yes, a b-b-bus!\n\n\t\t\tMCMURPHY\n\tWell, shoot, man! Whadaya say we\n\ttake ourselves a little spin around\n\tthe place.\n\n\t\t\tTABER\n\tWe'll get in trouble...\n\n\t\t\tCHESWICK\n\tYeah, maybe we ought to go back,\n\tMac...\n\n\t\t\tFREDRICKSON\n\tYeah, my feet are cold...\n\n\t\t\tSEFELT\n\tMy feet hurt...\n\n\t\t\tBILLY\n\tI-I-I'm w-w-wet...\n\n\t\t\tMCMURPHY\n\t\t(walking towards the bus)\n\tGo ahead! Go back!\n\nThe Acutes cast frightened looks at each other then go after\nMcMurphy. Martini and Scanlon join them.\n\n\t\t\tBILLY (CONT'D)\n\tH-H-How d-d-do we g-g-get b-back?\n\nMcMurphy has reached the bus and begins checking it out.\n\n\t\t\tTABER\n\tYeah, take us back to the\n\tdumbwaiter, Mac.\n\n\t\t\tMCMURPHY\n\tI'm not going back in there. I told\n\tya this was a one way trip. Now\n\tstand aside.\n\nMcMurphy lifts the hood to the bus and begins jumping the\nwire. The Acutes stand helplessly by as the engine turns over\nand catches. McMurphy closes the hood and gets on the bus to\na chorus of, \"Please, Mac, take us back... Please...\"\nMcMurphy puts the bus in gear and the bus starts moving. The\nAcutes start running alongside of the bus calling out for\nMcMurphy to take them back.\n\n\t\t\tMCMURPHY\n\t\t(shouting to them)\n\tGet on assholes!\n\nThey leap on.\n\nEXT. INSTITUTIONAL GROUNDS - ANOTHER ANGLE - NIGHT\n\nAs the bus makes a full circle and stops alongside of\nBromden.\n\n\t\t\tMCMURPHY\n\t\t(waving Bromden onto the\n\t\tbus)\n\tCome on, Chief! Let's go!\n\nBromden boards the bus. McMurphy lets out a war whoop as he\ncloses the door and starts the bus moving.\n\nEXT. INSTITUTIONAL GROUNDS - NIGHT\n\nas the bus picks up speed and churns across the grounds.\n\nINT. BUS - NIGHT\n\nthe Acutes look out with wild-eyed excitement.\n\nEXT. INSTITUTIONAL GROUNDS - NIGHT\n\nas the bus careens out the main entrance and down the\nthoroughfare.\n\nINT. BUS - NIGHT\n\nas the Acutes cast worried looks at each other.\n\nEXT. HIGHWAY\n\nas the bus turns a corner past a sign that reads: \n\nDALLES 6, SALMON CREEK 8, DEPOE BAY 11, CAPE LOOKOUT 22,\nPORTLAND 46\n\nINT. BUS - NIGHT\n\nMcMurphy is singing at the top of his lungs.\n\n\t\t\tMCMURPHY\n\t\t(singing)\n\tYour horses are hungry,\n\tThat's what she did say,\n\tCome sit down beside me,\n\tAn' feed them some hay.\n\tMy horses ain't hungry,\n\tThey wontt eat your hay-ay-aeee...\n\n\t\t\tBILLY\n\tH-Hey, M-Mack.\n\n\t\t\tMCMURPHY\n\tYeah, kid?\n\n\t\t\tBILLY \n\tW-W-Where we g-g-going?\n\n\t\t\tCHESWICK\n\tYeah, where we going?\n\n\t\t\tMCMURPHY\n\tI dunno. Where do ya wanna go?\n\n\t\t\tMARTINI\n\tI wanna go home!\n\n\t\t\tSCANLON\n\tYeah, it's cold!\n\n\t\t\tMARTINI\n\tI'm hungry.\n\n\t\t\tTABER\n\tYeah, we'll miss breakfast!\n\n\t\t\tMCMURPHY\n\tBreakfast! Hell, I know just the\n\tplace where we can chow down an'\n\tthaw out before we shoot back on\n\thome. 'Kay?\n\n\t\t\tBILLY\n\t'K-Kay, M-Mack!\n\n\t\t\tMCMURPHY\n\t\t(singing)\n\tSoo, fare-the-weel, darlin'.\n\tI'm gone on my way,\n\tMy wagons are loaded,\n\tMy whip's in my hand...\n\n\t\t\t\t\tDISSOLVE TO:\n\nEXT. DEPOE BAY - DAWN\n\nThe dawn is just cracking the horizon as the bus pulls up\nbehind a corroded tin sheet building. A sign reads: \n\nDEPOE BAY, SEAMANIS SERVICE, SPORT FISHING, BOATS FOR CHARTER\n\nBeyond the boathouse is the dock with several fishing\ntrawlers and beyond that -- the open sea.\n\nThe door to the bus opens and McMurphy gets out.\n\n\t\t\tMCMURPHY\n\t\t(as he steps out of the\n\t\tbus)\n\tThis is it!\n\nas McMurphy walks directly to the wall, alongside the door,\nlifts the edge of the siding, comes up with a key, opens the\ndoor and enters.\n\nA beat, then the lights go on inside the building.\n\nSHOT OF BUS\n\nThe Acutes' faces pressed against the windows, looking out.\n\nINT. SEAMAN'S BUILDING - DAWN\n\nas McMurphy lifts a cold bottle of beer out of a Coca-Cola\ncooler, opens it, takes a long pull on the bottle, then\ncrosses to the heater and turns it on.\n\nNearby, a sign reads: ALL EQUIPMENT CAN BE RENTED\n\nOn the walls are old photographs of people with their prize\ncatches. Fishing equipment, tackle and wet weather gear crowd\nthe room.\n\nThere is a counter which McMurphy walks behind and takes a\nbag of potato chips off a wall rack, full of beer nuts,\nhostess cupcakes, etc.\n\nMcMurphy eyes the keyboard to the fishing boats. Several keys\nare there.\n\nINSERT - KEYBOARD\n\nwith the names of the fishing boats: The Lark. Mary Ann.\nNoel. Annabella. The Capri.\n\nINT. BUILDING DEPOE BAY - DAWN\n\nMcMurphy studying the board as the Acutes stick their heads\nin the door. They're all miserable and cold.\n\n\t\t\tMCMURPHY\n\tCome on in an' warm up. You can put\n\tsome of that gear on to keep warm.\n\tAn' there's beer an' Coke in the\n\tcooler an' some food over here...\n\nThey hesitate.\n\n\t\t\tMCMURPHY\n\tCome on, don't be shy now, you're\n\tamong friends.\n\nThe Acutes come in, Bromden bringing up the rear.\n\nMartini goes for the candy. Scanlon goes for the Coke. Sefelt\nand Fredrickson go for the wet weather gear and boots. The\nothers go to the heater. Bromden stands in the middle of the\nroom.\n\n\t\t\tMCMURPHY\n\tWhy don't one of you boys help ol'\n\tChief there get warmed up?\n\nBilly goes to Bromden's aid as McMurphy crosses to a window\nand looks out.\n\nMcMurphy turns and looks out the window. A long beat.\n\n\t\t\tCHESWICK\n\tWhen do you think we'll be going\n\tback, Mack?\n\n\t\t\tMCMURPHY\n\t\t(looking out the window)\n\tCome here a minute, Cheswick. You,\n\ttoo, Sefelt. Hey, all you guys,\n\tcome over here, I wanna show you\n\tsomethin'.\n\nThe Acutes cross to the window and look out, saying, \"What?\nWhat is it? Whadaya lookin' at? I don't see a thing.\"\n\n\t\t\tMARTINI\n\tOh, look at the pretty boat.\n\nACUTES' POV\n\nNestled against the dock is a trim fishing trawler,\nbeautifully framed in the bay window.\n\n\t\t\tMCMURPHY (V.O.)\n\tYeah, did you ever see a boat like\n\tthat? Why, I'll bet you could go\n\tall the way to Hawaii in that boat!\n\tTahiti... the Philippines...\n\tTibet...\n\nCAMERA HOLDS on FULL SHOT of the boat.\n\nBACK TO SCENE\n\nA long beat, then we SEE the Acutes, wearing wet weather\ngear, complete with boots and squall hats, each man carrying\nsoda pop, food, fishing equipment, etc., being led onto the\nboat by McMurphy who carries a case of beer.\n\nEXT. FISHING BOAT - DAWN\n\nas a white gorge of smoke and water pours from the stern and\nthe boat pulls away from the dock, leaving a boiling foam of\nwater.\n\nINT. SHIP'S BRIDGE - DAWN\n\nThe entire crew is jammed into the bridge, McMurphy behind\nthe wheel.\n\nMcMURPHY'S POV\n\nas the dock and other fishing boats slip by.\n\nEXT. HARBOR JETTY - DAWN\n\nas the boat passes out of the harbor and heads for the open\nsea.\n\n\t\t\t\t\tDISSOLVE TO:\n\nEXT. BOAT DECK - DAY\n\nThe sun is up. The engine is dead. The ballgame is HEARD OVER\nship's RADIO. The men are scattered over the boat. Taber and\nMcMurphy, beer in hand, are sunning themselves, listening to\nthe ballgame. On the stern Martini and Scanlon are trying to\nrig up a pole. Fredrickson gives them a hand. Billy has a\nline out. So does Bromden and Sefelt who is seated nearby,\nfishing the ocean floor when he suddenly gets a bite and\nlooks over the side, surprised. His line goes straight down\ninto the depths. His glasses fall off into the water. Sefelt\nsighs and slowly begins reeling his line in.\n\nBilly gets a strike and starts fighting the fish.\n\n\t\t\tBILLY\n\tH-H-Help!\n\n\t\t\tMCMURPHY\n\tEase up on the star drag, keep the\n\ttie up, up and work hell outta that\n\tfella.\n\nMartini gets a strike and loses it. Scanlon comes up and\nstarts to take the pole from him.\n\n\t\t\tSCANLON\n\tMy turn.\n\n\t\t\tMARTINI\n\t\t(hanging onto the pole)\n\tNo.\n\nThey start a tug of war. Fredrickson tries to break it up,\nwhen he gets a strike and his line spins out.\n\nBilly's fish breaks into the sun in a shower of silver\nscales, and he gets so excited he lets the end of the pole go\ndown and the line snaps.\n\n\t\t\tMCMURPHY\n\tUp, I told you! Keep that tip up...\n\tup! You had you one big silver\n\tthere.\n\nFredrickson lands his salmon in a spray of scales and blood.\n\nThe fish is flopping all over the deck. Billy grabs the fish\nand wrestles it down.\n\nBromden lands a fish when --\n\n\t\t\tSEFELT (O.S.)\n\tOh, my God! I see something!\n\nEveryone rushes over to Sefelt and looks down into the water.\n\nREVERSE SHOT\n\nDeep down in the water a gigantic white form slowly rises out\nof the depths, becoming solid, alive.\n\n\t\t\tSCANLON\n\tJesus God...\n\n\t\t\tMARTINI\n\tWhat is it?\n\n\t\t\tFREDRICKSON\n\tWe'll never get that on the boat.\n\nThe fish is now clearly SEEN.\n\n\t\t\tBILLY\n\t\t(calling)\n\tM-M-Mack! M-M-Mack!\n\nMcMurphy pulls himself up.\n\n\t\t\tMCMURPHY\n\tWhat is it, kid?\n\n\t\t\tBILLY \n\tC-C-Come here and l-look at th\n\tthis!\n\nMcMurphy crosses down and looks over the side.\n\n\t\t\tMCMURPHY\n\tHe's a big flounder. Could weigh\n\ttwo, three hundred. You got to lift\n\thim in with a winch.\n\n\t\t\tFREDRICKSON\n\tDoes that mean we have to cut him\n\tloose?\n\n\t\t\tMCMURPHY\n\tLike hell we will! We got the\n\tmuscle standing right here. All we\n\tneed is a couple gaffin' hooks and\n\tsome rope.\n\n\t\t\tBILLY\n\tI-I-I'll get them.\n\n\t\t\tMARTINI\n\tMe, too.\n\n\t\t\tSCANLON\n\tMe, too.\n\nMcMurphy turns to Sefelt who is sweating under the strain.\n\n\t\t\tMCMURPHY\n\tSteady does it, Sefelt!\n\nSEFELT'S POV\n\nThe massive fish is closer to the surface.\n\n\t\t\t\t\tDISSOLVE TO:\n\nBACK TO SCENE\n\nAll the men are standing by as gaffing hooks and rope are\nmade ready. The fish is gaffed and slowly hauled out of the\nwater.\n\nMcMurphy and Bromden lean over, held by the others, grab the\nbig fish by its gills and, with a heave-ho, the fish is slid\nin and flopped to the bottom of the boat. The men go\nsprawling over the big fish. There's a lot of laughter,\nhandshakes and back-slapping going on when --\n\n\t\t\tVOICE\n\t\t(over bull horn)\n\tAll right! Stand to! Stand to!\n\nThe men look up.\n\nREVERSE SHOT - ACUTES' POV\n\nOff the bow is a Coast Guard cutter, and on the deck stands\nDoctor Spivey, Washington, Warren and several other aides\ndressed in white.\n\nINT. HALLWAY - STATE HOSPITAL - LATE AFTERNOON\n\nas the Acutes, sunburned and covered with dried brine and\nfish scales, are escorted down the hallway by Washington,\nWarren and Doctor Spivey.\n\nIt's a triumphant procession as they wheel the giant flounder\nwith a sheet over it on a gurney, holding up their catches\nfor all to see.\n\nMcMurphy is lagging a bit behind as they pass the mess hall\nwhere workmen are busy installing a security screen over the\ntransom, while inside the mess hall another workman is SEEN\nwelding a lock on the dumbwaiter.\n\nINT. DAY ROOM\n\nas Big Nurse steps out of the Nurses' Station.\n\n\t\t\tSPIVEY\n\t\t(to Big Nurse)\n\tHere they are, Miss Ratched. Safe\n\tand sound!\n\n\t\t\tBIG NURSE\n\tGood. Well, boys, did you enjoy\n\tyourselves?\n\nA burst of exuberance as the inmates hold up their fish.\n\n\t\t\tFREDRICKSON\n\t\t(to Sefelt)\n\tShow her the one you caught, Jim.\n\nSefelt whips the sheet off the big fish.\n\n\t\t\tBIG NURSE\n\tMy, my...\n\nNo one can find superlatives or gestures big enough to\ndescribe his catching of the big fish, \"brought it in\nhimself\" AD LIB.\n\n\t\t\tMCMURPHY\n\tYeah, ya should've come along with\n\tus, Miss Ratched, an' gotten a\n\tlittle sun on your cheeks and maybe\n\tcaught a fish or two.\n\n\t\t\tBIG NURSE\n\tMr. McMurphy, you had no right to\n\ttake these men out with you!\n\n\t\t\tMCMURPHY\n\t\t(loudly)\n\tYeah, that's kind of crazy, ain't\n\tit!\n\n\t\t\tBIG NURSE\n\tNo, it was irresponsible!\n\nBig Nurse turns to the others, leaving McMurphy dangling.\n\n\t\t\tBIG NURSE (CONT'D)\n\t\t(respectfully)\n\tThat's quite a catch, Jim. Whaat\n\tare you going to do with it?\n\n\t\t\tMARTINI\n\t\t(crossing to McMurphy)\n\tGimme a cigarette!\n\n\t\t\tSEFELT\n\tI thought I might donate it to the\n\tmess hall.\n\n\t\t\tMCMURPHY\n\t\t(reaches in his pocket; he\n\t\thas none)\n\tI don't have any.\n\nAD LIBS: \"They could use it.\" \"Take a picture first.\"\n\n\t\t\tBIG NURSE (CONT'D)\n\tThat's an excellent idea. Now, why\n\tdon't you boys place your fish on\n\tthe gurney and we'll see to it that\n\teveryone enjoys a fresh fish\n\tdinner.\n\nThe men toss their fish on the gurney as Martini joins the\ngroup and starts hitting the others up for a cigarette. All\nhe gets for his troubles are a series of \"No,\" \"Get lost,\" \"I\ndon't have any.\"\n\n\t\t\tBIG NURSE (CONT'D)\n\tThank you, boys. Now if you'll just\n\tgo along with Mister Washington to\n\tthe showers, supper is in half an\n\thour.\n\nThe inmates start AD LIBBING and laughing, \"We're not\nhungry,\" as Martini sees Harding light up a cigarette and\ncrosses to him.\n\n\t\t\tMARTINI\n\t\t(to Harding)\n\tGimme a cigarette!\n\n\t\t\tHARDING\n\tNo!\n\n\t\t\tMARTINI\n\tWhy not?\n\n\t\t\tHARDING\n\tI'm not running a charity ward...\n\nMartini snaps the cigarette out of Harding's hand, and takes\noff with Harding chasing him.\n\nMartini dashes around the room, pulling chairs in Harding's\nway, taking a drag on the cigarette whenever he can.\n\nHarding corners Martini, but Martini tosses the cigarette\nover Harding's head to Scanlon.\n\nScanlon takes off with Harding after him, absolutely livid.\n\nScanlon passes to Billy who passes to Martini. Everyone in\nthe room is getting wired.\n\nMartini throws it away as Harding jumps him and nails him to\nthe floor.\n\n\t\t\tMARTINI\n\t\t(holding his hands up;\n\t\tempty)\n\tAll gone! All gone! Don't hit!\n\tDon't hit!\n\nHarding starts pounding Martini's head on the floor when\nBilly and Scanlon jump Harding and start pounding him.\n\nFredrickson picks up the cigarette and stands there watching\nthe fight as he smokes the cigarette as Washington, Warren\nand Miller move in and start separating the men.\n\nMcMurphy, watching the fight, sighs, then deliberately\ncrosses toward the Nurses' Station.\n\nINT. NURSES' STATION - MISS PILBOW'S POV - DAY\n\nas McMurphy reaches the Nurses' Station and puts his hand\nthrough the plate glass window, his fist stopping inches from\nMiss Pilbow's startled face. Miss Pilbow's scream is added to\nthe SOUND OF THE SHATTERED WINDOW.\n\nINT. DAY ROOM - DAY\n\nMcMurphy reaches in and picks up his carton of cigarettes.\n\n\t\t\tMCMURPHY\n\tI'm sure sorry, ma'am. Gawd, but I\n\tam. That window glass was so clean\n\tI didn't even see it...\n\nMcMurphy turns and crosses back to the day room, opening the\ncarton of cigarettes as he goes.\n\n\t\t\tMCMURPHY\n\tYou guys want cigarettes! Here's\n\tthe goddamn cigarettes!\n\nMcMurphy starts tossing packages of cigarettes into the mass\nof struggling bodies as Washington grabs McMurphy by the arm\nand tries to wheel him away.\n\nMcMurphy shakes him off and throws a pack of cigarettes in\nWashington's face.\n\nWashington goes after McMurphy, grabs him, and drives him\nagainst the wall, right next to Bromden, who watches as\nMcMurphy shoves Washington away, goes into a crouch and\nstarts circling Washington. Washington dances in and out,\nchipping away at McMurphy's face until McMurphy drives his\nfist square into Washington's white, starched chest, drawing\nhim against the wall.\n\nMcMurphy moves in for the kill.\n\n\t\t\tWASHINGTON\n\tWarren! Miller!\n\nThe Acutes have stopped fighting and are watching.\n\nMcMurphy tags Washington, then is grabbed from behind by\nWarren, who pulls him back.\n\nWashington moves in and goes to work on McMurphy, when\nBromden grabs Washington, from behind, in a bear hug.\n\nMiller jumps on Bromden's back. Bromden, still holding\nWashington, backs up into the wall, squashing Miller, who\nscreams out.\n\nEXT. HALLWAY TO DISTURBANCE WARD - LATE AFTERNOON\n\nas McMurphy, bruised from the fight, and Bromden, handcuffed\nto a special belt, wait while an aide unlocks the first of a\ndouble set of heavy security doors.\n\nThe first door is locked, leaving McMurphy, Bromden, and the\nthree aides crammed in the small space between the two doors\nwhile another aide opens the second door and McMurphy and\nBromden step through, followed by the aides.\n\nINT. DISTURBANCE WARD - LATE AFTERNOON\n\nAs the aide locks the door behind them, the other aides lead\nBromden and McMurphy toward a bench, where they unshackle\nthem.\n\n\t\t\tAIDE\n\t\t(pointing to a bench)\n\tWait over there...\n\nThe three aides go down the hall, leaving McMurphy and\nBromden who sit and look at their new surroundings. There is\na man sitting next to them.\n\nMcMURPHY'S POV\n\nThe architecture is the same as the ward we left below, but\nit is the atmosphere that is different. A heaviness pervades\nall. Heavily sedated patients sit isolated from each other.\nOthers stand shifting from one foot to the other, while\nothers walk up and down the hallway, their locomotive powers\nnot unlike that of Parkinson's Disease (caused by too much\nsedation).\n\nSuddenly, one patient gets up, speaking very angrily,\nshouting incoherently at no one; he crosses the hall and\nenters a side room. An aide goes in after him. A long beat,\nthen the aide comes out with the patient and gently leads him\nback to his seat, talking softly to the man.\n\nFurther down the hallway, a gurney is wheeled out of the east\nroom with a patient lying on it, out cold; he is wheeled\nfurther down the hall to the men's dorms, where he is left to\nsleep it off.\n\nTwo aides come out of the EST room and head in McMurphy's\ndirection, where one of the aides motions to the patient\nsitting next to McMurpby.\n\n\t\t\tAIDE (CONT'D)\n\t\t(approaching him very\n\t\tgently)\n\tCome on, Joey... this isn't going\n\tto hurt you... good for you... make\n\tyou feel better...\n\nThe patient clings to the bench, terrified, weeping.\n\nThe aides peel him off the bench and escort him down the hall\nto the EST room.\n\nANOTHER ANGLE\n\nAs McMurphy watches the patient go, he takes out a package of\ngum. Takes a stick for himself and gives Bromden one.\nMcMurphy turns back to his own thoughts.\n\n\t\t\tBROMDEN\n\tThank you.\n\nMcMurphy looks up. A long beat.\n\n\t\t\tMCMURPHY\n\tSay it again.\n\n\t\t\tBROMDEN\n\tThank you.\n\nAnother beat.\n\n\t\t\tMCMURPHY\n\tSay... God Bless America!\n\n\t\t\tBROMDEN\n\tGod Bless America.\n\n\t\t\tMCMURPHY\n\t\t(slapping his thigh)\n\tGoddammit, you sly son-of-a-bitch!\n\tDoes anybody else know?\n\n\t\t\tBROMDEN \n\tNo.\n\n\t\t\tMCMURPHY\n\tShit! This is too much!\n\t\t(his mind going a mile a\n\t\tminute)\n\tChief, I tell you we're gonna bust\n\toutta this place an' make it all\n\tthe way to Canada before they know\n\twhat bit 'em.\n\n\t\t\tBROMDEN \n\tCa-na-da...\n\n\t\t\tMCMURPHY\n\tYa like that, Chief, huh?\n\n\t\t\tBROMDEN\n\tYeah...\n\n\t\t\tMCMURPHY\n\tYeah, well, well, well. 'Bout time\n\tthe rest of the world got a gander\n\tat Big Chief Bromden cuttin' down\n\tthe boulevard, stopping just long\n\tenough for virgins... Oh, man, I\n\ttell you, I tell you, you'll have\n\twomen trippin' you and beating you\n\tto the floor...\n\n\t\t\tBROMDEN\n\tCa-na-da...\n\n\t\t\tMCMURPHY\n\tShhh, Chief, don't talk. Never\n\ttalk! Remember, this is just\n\tbetween you an' me. Do ya\n\tunderstand?\n\nBromden nods.\n\n\t\t\tNURSE ITSU (O.S.)\n\tMister McMurphy.\n\nMcMurphy turns to see Nurse Itsu. The two aides are standing\nbehind her.\n\n\t\t\tMCMURPHY\n\t\t(recognizing a long-lost\n\t\tfriend)\n\tHey, how ya doin'?\n\n\t\t\tNURSE ITSU\n\tFine, thank you.\n\t\t(offering pills)\n\tHere, please take these.\n\n\t\t\tMCMURPHY\n\tWhat are they?\n\n\t\t\tNURSE ITSU\n\tTo help you relax... please...\n\nMcMurphy takes the pills and downs them. Bromden takes his\npills.\n\n\t\t\tNURSE ITSU (CONT'D)\n\tPlease take off your shoes.\n\nMcMurphy takes off his shoes.\n\n\t\t\tNURSE ITSU (CONT'D)\n\tPlease follow me.\n\n\t\t\tMCMURPHY\n\t\t(rising, thumbs up)\n\tYou an' me, Chief.\n\nMcMurphy, flanked by the two aides, follows Nurse Itsu to the\nEST room.\n\n\t\t\tMCMURPHY\n\t\t(to Itsu)\n\tYou know, I never got your name.\n\n\t\t\tNURSE ITSU\n\t\t(stopping at the door)\n\tMiss Itsu.\n\t\t(indicating the room)\n\tIn here, please.\n\n\t\t\tMCMURPHY\n\tYou comin' in to hold my hand?\n\n\t\t\tNURSE ITSU\n\tNo...\n\n\t\t\tMCMURPHY\n\tYeah... Well, see ya around, Itsu.\n\nItsu smiles at McMurphy.\n\n\t\t\tMCMURPHY\n\tYeah...\n\nMcMurphy gives Bromden one last wave and goes in.\n\nBromden watches the door close behind McMurphy.\n\nINT. EST ROOM - LATE AFTERNOON\n\nThere are four other aides in there, standing around an empty\ngurney.\n\nA DOCTOR is at the head of the gurney, a NURSE alongside of\nhim.\n\n\t\t\tMCMURPHY\n\t\t(as he enters)\n\tHi...\n\nMcMurphy looks around at the six aides.\n\n\t\t\tMCMURPHY\n\tYou boys can take a cigarette break\n\tnow...\n\nThe Nurse smiles at him.\n\n\t\t\tDOCTOR\n\tThat's all right, Mister McMurphy,\n\tjust climb on the bed and lie\n\tdown...\n\n\t\t\tMCMURPHY\n\tWhatever you say, Doc...\n\nMcMurphy climbs on the bed and lies down.\n\nThe Doctor moves around to the side of the bed and takes\nMcMurphy's pulse, while the Nurse dips her fingers into a jar\nof salve.\n\n\t\t\tDOCTOR\n\t\t(to McMurphy)\n\tThis won't hurt you at all...\n\n\t\t\tMCMURPHY\n\tUh, uh...\n\nThe Nurse starts applying salve to McMurphy's temples.\n\n\t\t\tMCMURPHY\n\tWhat's that for?\n\n\t\t\tNURSE\n\tConductant.\n\n\t\t\tMCMURPHY\n\t\t(smiling up at her)\n\tSurely, goodness and mercy will\n\tfollow this, eh, honey?\n\n\t\t\tDOCTOR\n\t\t(holding a mouthpiece)\n\tPlease, put this in your mouth...\n\nMcMurphy takes the bit in his teeth. The Doctor moves back to\nthe head of the gurney and places the thongs on McMurphy's\ntemples.\n\nThe Doctor nods to the six aides, who move in and gently\nplace their hands, in a very professional manner, on\nMcMurphy's knees, hips and shoulders. Once set, the Doctor\nturns to his controls.\n\nSHOT OF McMURPHY\n\nas he looks around, not nearly as scared as he is mystified\nby the whole process, when suddenly, without warning,\nMcMurphy is hit by the shock. His face is a contorted mask of\nsurprise and pain. His whole body caught in a sudden spasm. A\nmoment of rigidity, then McMurphy passes out and his body\nrelaxes. Another moment, then a series of violent body spasms\nbegin flowing down his body. Now the aides' function is very\nclear, as they press down, holding McMurphy firmly to the\ngurney, until the last spasm subsides.\n\n\t\t\t\t\tSLOW FADE OUT\n\t\t\t\t\tTO:\n\nFADE IN:\n\nINT. DAY ROOM - DAY\n\nA Group Meeting is in progress. Doctor Spivey is there.\n\n\t\t\tBIG NURSE\n\t\t(to Sefelt)\n\tIt's been brought to my attention\n\tthat you're giving Mister\n\tFredrickson your medication, aren't\n\tyou, Mister Sefelt?\n\n\t\t\tSEFELT\n\tIt's the Dilantin that makes my\n\tgums soft!\n\n\t\t\tBIG NURSE\n\tNow, Jim, you must be honest with\n\tyourself.\n\nAt the end of the hall, the door opens and McMurphy and\nBromden enter the visitors' room, accompanied by Washington\nand Warren. They cross to the security gate, open it and pass\ninto the hallway.\n\nWashington and Warren disappear into a room, leaving McMurphy\nand Bromden, who walk slowly towards the day room.\n\nThe Group Meeting continues over as Fredrickson raises his\nhand.\n\n\t\t\tBIG NURSE (CONT'D)\n\tYes, Mister Fredrickson?\n\n\t\t\tFREDRICKSON\n\tI wanna know why the dorm has to be\n\tlocked in the daytime and on\n\tweekends?\n\n\t\t\tTABER\n\tYeah, why can't a fellow even have\n\tthe weekends to himself?\n\n\t\t\tCHESWICK\n\t\t(standing up)\n\tYeah, whadabout our cigarettes?\n\n\t\t\tBIG NURSE\n\tSit down, Mister Cheswick, and wait\n\tyour turn!\n\nHe sits.\n\n\t\t\tBIG NURSE (CONT'D)\n\tIf the dorms were left open, you\n\twould just return to bed after\n\tbreakfast...\n\n\t\t\tFREDRICKSON\n\tSo what? Is it a mortal sin? I\n\tmean, normal people get to sleep\n\tlate on weekends...\n\n\t\t\tBIG NURSE\n\tWith few exceptions, time spent in\n\tthe company of others is\n\ttherapeutic, while every minute\n\tspent brooding alone only increases\n\tseparation.\n\n\t\t\tCHESWICK\n\t\t(jumping up as he sees\n\t\tMcMurphy)\n\tMack!\n\nEveryone looks at McMurphy and Bromden.\n\nBromden is as he always was, as McMurphy slowly drags himself\ninto the day room. He looks like a zombie as he takes the\nroom in. Then, suddenly, he slaps his thigh.\n\tMcMURPHY\n\tHey, hey, you ding-a-lings, you\n\tcreeps, you goons...\n\nHe enters the room doing a jig. The Acutes' faces light up.\n\n\t\t\tMCMURPHY\n\tI got ten thousand watts and hot to\n\ttrot. First woman takes me on is\n\tgonna light up like a pinball\n\tmachine an' pay off in silver\n\tdollars...\n\nMcMurphy does a full circle of the room, greeting the\nChronics. But it's an effort for him. His voice is slower,\nhis footwork slightly out of sync.\n\n\t\t\tBILLY\n\tH-h-how's it g-g-going, Mack?\n\n\t\t\tMCMURPHY\n\tJust fine, Billy boy, just fine.\n\tFull of piss an' vinegar! They\n\tchecked my plugs and cleaned my\n\tpoints...\n\n\t\t\tBIG NURSE\n\tMister McMurphy.\n\n\t\t\tMCMURPHY\n\t\t(turning)\n\tYes, ma'am?\n\n\t\t\tBIG NURSE\n\tWelcome back.\n\n\t\t\tMCMURPHY\n\tThank you, ma'am.\n\n\t\t\tBIG NURSE\n\tI hope everything is settled.\n\n\t\t\tMCMURPHY\n\tMa'am, I'm as gentle as a puppy\n\tdog. Why, I haven't licked the tar\n\tout of an aide for two weeks! Hi\n\tya, Doc!\n\nSpivey greets McMurphy.\n\n\t\t\tBIG NURSE \n\tGood. Why don't you join us?\n\n\t\t\tMCMURPHY\n\tWhy, thank you, ma'am...\n\t\t(he gets a seat and sits\n\t\theavily)\n\tWhew. Man, I tell you, that place\n\tup there is somethin' else!\n\t\t(pulling it together)\n\tWell, ya boys been practicin' up\n\tfor the big game?\n\t\t(no response)\n\tI figured as much...\n\n\t\t\tBILLY\n\tW-W-We h-heard y-you w-were n-never\n\tc-c-coming back!\n\n\t\t\tMCMURPHY\n\tYeah, well, let me tell ya\n\tsomethin'... While I was up there\n\tgettin' in-lightened, I came up\n\twith one hellava plan...\n\nA great sadness suddenly sweeps over McMurphy's face and he\nbreaks off.\n\n\t\t\tBILLY\n\tWh-wh-what p-plan, M-Mack!\n\nNo response from McMurphy.\n\n\t\t\tHARDING\n\tWhat's your plan, Mack?\n\n\t\t\tMCMURPHY\n\t\t(coming out of it)\n\tPlan?... Oh, yeah, the plan...\n\tYeah...\n\nMcMurphy gets up and crosses to the window, where he joins\nBromden who is looking out the window.\n\nREACTION SHOT of the others as they look at McMurphy and each\nother with quizzical looks.\n\nINT. GYMNASIUM - DAY\n\nOn the court both teams are lined up taking photographs for\nthe local newspaper. The bulb pops a few times.\n\n\t\t\tPHOTOGRAPHER\n\t\t(wrapping it up)\n\tThank you, boys.\n\nThe line breaks up. McMurphy crosses to Big Nurse, who sits\nin the front row.\n\nIt's the big Saturday game between the Acutes and Aides, as\nspectators enter the gymnasium already half-filled with male\nand female patients, staff members and visitors.\n\nDoctor Spivey stands nearby at the timers' table, basketball\nin hand, whistle around his neck, talking to the timer.\n\n\t\t\tMCMURPHY\n\tMiss Ratched, would you please save\n\ta space for my aunt? She's comin'\n\tdown from Portland.\n\n\t\t\tBIG NURSE\n\tCertainly, Mister McMurphy, with\n\tpleasure.\n\n\t\t\tMCMURPHY\n\tThank you, ma'am...\n\nO.S. the WHISTLE BLOWS.\n\n\t\t\tMCMURPHY\n\tGotta go now, ma'am...\n\n\t\t\tBIG NURSE\n\tYes. Good luck, Mister McMurphy.\n\n\t\t\tMCMURPHY\n\tThank you, ma'am.\n\nMcMurphy crosses onto the court. Big Nurse watches him go.\n\nBASKETBALL COURT\n\nDoctor Spivey is at half-court, basketball in hand as the\nplayers take up their positions: Washington faces McMurphy\nfor the jump at center. Harding and Billy are playing guard\nwith Warren and Miller on them. Martini and Scanlon are in\nthe forward position, with the two white Aides covering them.\nThe other Acutes sit on the bench as substitutes.\n\n\t\t\tMCMURPHY\n\t\t(to Washington)\n\tHey, Sam, bet ya two bucks ya lose.\n\n\t\t\tWASHINGTON\n\tShit, man, tha' ain't even worth\n\tconsiderin'.\n\n\t\t\tMCMURPHY\n\tHow 'bout twenty?\n\n\t\t\tWASHINGTON\n\tNow you talkin'.\n\n\t\t\tMCMURPHY\n\tBet!\n\n\t\t\tWASHINGTON\n\tBet you ass...\n\n\t\t\tMCMURPHY\n\t\t(to Spivey)\n\tYou're a witness, Doc!\n\n\t\t\tSPIVEY\n\tMe? I didn't hear a thing! Let's\n\tplay ball!\n\nSpivey checks the court, then blows the whistle as he tosses\nthe ball into the air.\n\nWashington taps the ball to Warren, who passes to Miller, who\nhands off to Washington, who goes up for a layup. Two points.\nThe Acutes haven't even moved from their spots. The\nscoreboard reads: AIDES 2 PATIENTS 0.\n\n\t\t\tMCMURPHY\n\t\t(taking the ball out)\n\tCome on, wake up, you ding-a-lings.\n\tThe game is on.\n\nThe Acutes snap to and McMurphy passes the ball into Harding,\nwho fiercely dribbles down court, McMurphy running alongside\nhim.\n\n\t\t\tMCMURPHY\n\tPass the ball, Harding...\n\t\t(no pass)\n\tDon't hang onto it...\n\t\t(no response)\n\tPass it, goddammit!\n\nHarding dribbles into the corner and finds himself bottled in\nby two Aides.\n\n\t\t\tMCMURPHY\n\tHarding, here, over here!\n\nThe ball is snagged from Harding's hands by an Aide, who\npasses it down court to another Aide, who turns and makes\nanother basket.\n\nScoreboard: AIDES 4 PATIENTS 0\n\n\t\t\tMCMURPHY\n\t\t(to Harding)\n\tYa deaf! I said pass the ball!\n\n\t\t\tHARDING\n\tWhat are you talking about???\n\tEverybody was covered!!! Everybody\n\twas covered!!!\n\n\t\t\tMCMURPHY\n\tI was open! Come on, let's play\n\tball!\n\nMcMurphy and Harding turn to see Martini, down court, passing\nthe ball into Billy.\n\n\t\t\tWASHINGTON\n\t\t(slapping his hands)\n\tGimme tha' ball!\n\nBilly panics and hands the ball to Washington, who turns\naround and makes another basket. Score: AIDES 6 PATIENTS 0.\n\nMcMurphy and Harding run down court, McMurphy taking the ball\naway from Martini, who would like to bring it in.\n\n\t\t\tMCMURPHY\n\t\t(to Washington)\n\tWhat kind of crap is that???\n\n\t\t\tWASHINGTON (CONT'D)\n\tJus' playin' the game, sucker...\n\nWashington chuckles and trots on down court.\n\n\t\t\tMCMURPHY\n\t\t(to Martini)\n\tGet down there where ya belong,\n\tMartini. You, too, Scanlon.\n\t\t(tosses ball to Harding)\n\tYou take it out, Harding!\n\nHarding takes the ball and passes it in to McMurphy, who\nturns and dribbles down court exactly like Harding did.\n\n\t\t\tHARDING\n\t\t(running alongside\n\t\tMcMurphy)\n\tPass the ball!\n\t\t(no response)\n\tPass it!\n\t\t(no response)\n\tPass it! Pass it! I'm open,\n\tMcMurphy, pass the ball!\n\nMcMurphy stops dead in his tracks and flings the ball at\nHarding. The ball bounces off Harding's head and goes out of\nbounds. The WHISTLE BLOWS. Harding spins a few times.\n\n\t\t\tMCMURPHY (O.S.)\n\tHarding, get back here!\n\nHarding turns to see the other team go by. They score another\nbasket. Score: AIDES 8 PATIENTS 0.\n\nBilly takes the ball and passes into McMurphy, who turns to\nsee CANDY enter the gym, with her friend, ROSE.\n\n\t\t\tMCMURPHY\n\t\t(calling out)\n\tCandy. Candy, over here.\n\t\t(to Doctor Spivey)\n\tHey, Doc, time out.\n\n\t\t\tSPIVEY\n\t\t(blowing his whistle)\n\tTime out!\n\nMcMurphy tosses the ball to Spivey, then crosses the court to\nCandy and Rose, who have had a couple of drinks on the way\ndown.\n\n\t\t\tCANDY\n\tMack, you sonofabitch, you ol'\n\tfucker, how've you been?\n\n\t\t\tMCMURPHY\n\t\t(swinging her around in\n\t\this arms)\n\tTerrific, baby, terrific!\n\t\t(to Rose)\n\tHi ya doin', Rose?\n\n\t\t\tROSE\n\tOkay, Mack!\n\t\t(looking around)\n\tWhoowe, Candy girl, are we in an\n\tinsane asylum or ain't we?\n\n\t\t\tMCMURPHY\n\t\t(to Candy)\n\tHow's your ass been holdin' up,\n\thoney?\n\nCandy pokes her ass at McMurphy. He gives it a squeeze. O.S.\na WHISTLE BLOWS.\n\n\t\t\tMCMURPHY\n\tCome on, girls, we're holding up\n\tthe game!\n\nMcMurphy leads the two ladies across the court.\n\nThe entire gymnasium is riveted on the three of them. As they\nreach Big Nurse:\n\n\t\t\tMCMURPHY\n\tMiss Ratched, this is my Aunt Candy\n\tand her friend Rose...\n\nGreetings are exchanged.\n\n\t\t\tMCMURPHY\n\tMiss Ratched was kind enough to\n\tsave you ladies a seat...\n\nThe two ladies wedge themselves in next to Big Nurse. O.S.\nthe WHISTLE BLOWS.\n\n\t\t\tMCMURPHY\n\tTalk to ya at half time!\n\nMcMurphy turns and crosses onto the court.\n\n\t\t\tCANDY\n\t\t(calling after him)\n\tSock it to 'em, kid!\n\n\t\t\tROSE\n\t\t(taking in the players)\n\tAre they all crazies?\n\n\t\t\tBIG NURSE\n\tNo.\n\n\t\t\tROSE\n\tOh, just those guys dressed in\n\twhite?\n\n\t\t\tBIG NURSE\n\tNo, miss, it's the other way\n\taround.\n\n\t\t\tROSE\n\tWell, you could've fooled me.\n\nOn the court, McMurphy throws the ball to Martini.\n\nMartini throws the ball to McMurphy.\n\nMcMurphy throws the ball back to Martini.\n\nMartini throws the ball into the stands.\n\nThe WHISTLE BLOWS O.S.\n\n\t\t\tMCMURPHY\n\tWhadaya doin', there's no one\n\tthere!\n\n\t\t\tMARTINI\n\tI saw 'em! I saw 'em.\n\n\t\t\tHARDING (O.S.)\n\t\t(shouting)\n\tMack, get back here!\n\nMcMurphy turns to see the other team go by and score a\nbasket.\n\nBilly passes the ball into MeMurphy.\n\n\t\t\tMARTINI\n\tGimme the ball!\n\n\t\t\tMCMURPHY\n\t\t(holding the ball)\n\tOkay, Martini. That's okay. Now you\n\twatch me.\n\nMcMurphy dribbles the ball down the sideline. Stops.\n\nGoes into his routine of ball tricks: faking one way, then\nthe other, over his head, under his legs, finally ending on a\npass behind his back which goes straight into Washington's\nhands. Washington dribbles down court for an easy layup.\n\nScore: AIDES 10 PATIENTS 0\n\n\t\t\tMCMURPHY\n\t\t(to Spivey)\n\tTime out!\n\n\t\t\tSPIVEY\n\t\t(blowing his whistle)\n\tTime out!\n\n\t\t\tMCMURPHY\n\t\t(shouting to Timer)\n\tReplacement coming in! Harding out!\n\nMcMurphy crosses to Bromden, takes his hand, and leads him\nonto the court and under the Acutes' basket, where he\nmaneuvers him into the proper position. Then McMurphy raises\nhis hands above his head and Bromden follows suit.\n\n\t\t\tMCMURPHY\n\t\t(starting back up court)\n\tTime in!\n\t\t(sees Harding still on\n\t\tcourt)\n\tHold it! Time out!\n\t\t(to Harding)\n\tI said Harding out!\n\n\t\t\tHARDING\n\tI refuse!\n\n\t\t\tMCMURPHY\n\tI said out!\n\n\t\t\tHARDING\n\t\t(casting a quick look at\n\t\this wife)\n\tNo!\n\n\t\t\tMCMURPHY\n\tI'm the coach!\n\n\t\t\tHARDING\n\tI just started!\n\n\t\t\tMCMURPHY\n\tYou can come back later!\n\n\t\t\tHARDING\n\tI don't trust you!\n\n\t\t\tMCMURPHY\n\t(looking for another victim)\n\tScanlon out!\n\n\t\t\tSCANLON\n\tNo!\n\n\t\t\tMCMURPHY\n\tMartini out!\n\n\t\t\tMARTINI\n\tNo!\n\nMcMurphy looks at Billy.\n\n\t\t\tBILLY\n\tI-I-I-I-I'll g-g-g-go, M-M-Mack...\n\n\t\t\tMCMURPHY\n\tGood boy, thank you, Billy.\n\nBilly goes off and sits by Big Nurse. Now, the lineup on the\nbench is Billy, Big Nurse, Candy and Rose.\n\nSpivey blows the whistle.\n\nUnder the Aides' basket, Harding passes the ball into\nMcMurphy, who dribbles to half court, takes his mark, and\nlobs the ball over the outstretched arms of the Aides right\ninto Bromden's waiting hands. Bromden turns and slams the\nball into the basket.\n\nThe crowd goes bananas. Score: AIDES 10 PATIENTS 2\n\nBromden walks in majestic dignity the full length of the\ncourt and takes up his position under the Aides' basket,\nwhile McMurphy and his teammates have been putting tremendous\npressure on the Aides, not allowing them to pass the ball in.\n\nAs soon as McMurphy sees that Bromden is firmly set, hands\nheld up, under the Aides' basket, McMurphy turns and runs\ndown court, followed by the other Acutes, where they take up\ntheir defensive position.\n\nWashington and the Aides easily bring the ball down court,\nwork themselves into position, and take a shot at the basket,\nwhich Bromden swats aside.\n\nEach Aide gets a shot at the basket, and each time Bromden\nswats it aside; sending the last swat into McMurphy's waiting\nhands.\n\nMcMurphy dribbles the ball up court, where he runs into heavy\npressure from Washington.\n\n\t\t\tHARDING\n\t\t(off to the side of\n\t\tMcMurphy)\n\tMcMurphy, pass the ball!\n\nMcMurphy passes the ball to Harding and cuts toward the\nbasket.\n\n\t\t\tMCMURPHY\n\t\t(as he cuts past Harding)\n\tHarding, pass the ball!\n\nHarding ignores McMurphy, as he runs by, and throws the ball\nto Bromden, who turns and slams the ball into the basket.\n\nThe crowd goes bananas.\n\nScore: AIDES 10 PATIENTS 4\n\n\t\t\tCANDY\n\t\t(at the top of her lungs)\n\tAtta boy, Mack!\n\t\t(to Big Nurse)\n\tWhat's he in for?\n\n\t\t\tBIG NURSE\n\tWho?\n\n\t\t\tCANDY\n\tMack!\n\n\t\t\tBIG NURSE\n\tMiss, it's a complicated case. It\n\twould take too long to explain.\n\n\t\t\tCANDY\n\tYeah, well, he looks like hell!\n\nCHEERS are HEARD O.S. Candy turns back to the game.\n\nCAMERA HOLDS on Candy, Big Nurse and Billy, who is staring at\nCandy.\n\n\t\t\tBIG NURSE\n\t\t(to Billy)\n\tBilly, it's not polite to stare!\n\nBilly sinks back, thinks it over, then presses forward.\n\n\t\t\tBILLY\n\t\t(to Candy)\n\tMiss!\n\nCandy looks at Billy.\n\n\t\t\tBILLY (CONT'D)\n\tHi!\n\n\t\t\tCANDY\n\t\t(giving him a big smile)\n\tHi...\n\nBilly sinks back in his seat.\n\nOn the court, McMurphy dribbles down to half court where he\nis stopped by Washington and Warren, who put the squeeze on\nhim. McMurphy turns and gives them his ass to contend with,\nthen manages to throw the ball under his legs and\nWashington's legs. The ball rolls to Martini, who scoops it\nup and throwing it wildly away, the ball ricochets off the\nbackboard and goes in for two points.\n\nThe crowd goes bananas. Score: AIDES 10 PATIENTS 6\n\nBromden starts striding down court when the Aides make a fast\nbreak past him, but miss their shot.\n\nMcMurphy retrieves the ball as Bromden, not more than several\nfeet from his own basket, does an about-face and returns to\nhis basket where he turns to see McMurphy lob the ball full\ncourt to Bromden, who catches the ball on one bounce, turns\nand slams the ball in for another basket.\n\nScore: AIDES 10 PATIENTS 8\n\nThe crowd goes bananas and Bromden turns and starts striding\ndown the court when he sees McMurphy at the far end of the\ncourt yelling at him.\n\n\t\t\tMCMURPHY\n\t\t(yelling and gesturing)\n\tRun, Chief, run!\n\nBromden gets the idea and starts loping down court abreast of\nWashington, who is making another fast break towards his own\nbasket.\n\nWashington and Bromden go up together and Bromden swats the\nball to Scanlon.\n\n\t\t\tMCMURPHY\n\t\t(yelling and gesturing)\n\tRun, Chief, run!\n\nBromden starts running towards his own basket, Washington hot\non his heels, when the ball is passed to him and he goes up,\nmakes the point, but takes a bad spill, crashing head over\nheels to the floor.\n\nThe crowd gasps. The WHISTLE BLOWS.\n\n\t\t\tSPIVEY\n\t\t(shouting)\n\tFoul!\n\nAs McMurphy charges across court and grabs Washington by his\nshirt...\n\n\t\t\tMCMURPHY\n\t\t(breathing in Washington's\n\t\tface)\n\tYa fuckin' coon, you're not on the\n\tward now!\n\n\t\t\tWASHINGTON\n\t\t(cool as a cucumber)\n\tTake you han's offa me!\n\nSpivey comes running, blowing his whistle.\n\n\t\t\tSPIVEY\n\tBreak it up, boys!\n\t\t(to Timer)\n\tPoint counts. One free throw!\n\nMcMurphy pushes Washington away and turns to Bromden, who is\nbeing helped off the floor by Harding, as...\n\n\t\t\tMARTINI AND SCANLON\n\tGreat shot, Chief! Ya okay? You're\n\tdoin' great!\n\nThey lead Bromden to the foul line.\n\n\t\t\tMCMURPHY\n\t\t(to Washington as they\n\t\tline up at the foul line)\n\tWe got your black ass now,\n\tWashington, wanna bet another\n\ttwenty?\n\n\t\t\tWASHINGTON\n\tNo way...\n\nBromden takes the ball at the foul line. Sets himself up and\nlobs the ball underhand. It goes in.\n\nThe crowd goes wild.\n\nINT. MEN'S DORM - NIGHT\n\nThe patients are asleep except for Bromden who sits on the\nedge of his bed watching McMurphy, his face pressed against\nthe window, looking out.\n\n\t\t\tTURKLE\n\t\t(approaching)\n\tWhat you boys doin' up at this\n\tungodly time o' the night?\n\n\t\t\tMCMURPHY\n\tPrayin', brother. Prayin'.\n\n\t\t\tTURKLE \n\tWell, you boys finish it up an'\n\tclimb back into your beds. 'Kay?\n\n\t\t\tMCMURPHY\n\t'Kay...\n\nThe men slide into their beds and Turkle goes off, clucking\nto himself.\n\nA beat, then McMurphy rushes back to the window and looks\nout.\n\nMcMURPHY'S POV\n\nOutside, in the dark, Candy and Rose are seen wandering\naround.\n\nREVERSE ANGLE - BROMDEN AND McMURPHY\n\n\t\t\tMCMURPHY\n\tThere they are, Chief!\n\nMcMurphy tries to get the girl's attention and fails.\n\n\t\t\tMCMURPHY\n\tWhere are they goin'?\n\nMcMurphy takes off, towards the day room, followed by\nBromden.\n\nINT. DAY ROOM - NIGHT\n\nAs the two of them cross into the day room heading for the\nwindow, Turkle sticks his head out of the nurses' station.\n\n\t\t\tTURKLE\n\tI thought I told you boys to go to\n\tbed!\n\n\t\t\tMCMURPHY\n\t\t(flagging the girls)\n\tOur prayers have been answered,\n\tTurkle! Our prayers have been\n\tanswered!\n\nMcMURPHY'S POV\n\nas we SEE the girls coming.\n\nREVERSE ANGLE\n\n\t\t\tTURKLE\n\tOh yeah...\n\n\t\t\tMCMURPHY\n\tI tell ya, there's an angel of\n\tmercy standing out there, Turkle.\n\n\t\t\tTURKLE\n\tHallelujah, brother, now get back\n\tin bed!\n\n\t\t\tMCMURPHY\n\tCome an' see.\n\nTurkle comes out of the nurses' station, leaving the side\nwindow open.\n\n\t\t\tTURKLE\n\t\t(crossing to McMurphy)\n\tThat angel of mercy, he ain't a\n\tshe, is he?\n\n\t\t\tMCMURPHY\n\tYou's better believe it, brother!\n\nTurkle reaches the window and sees the girls outside.\n\nCANDY and ROSE'S POV - THE MEN looking out.\n\nBACK TO SCENE\n\nas Turkle turns to McMurphy.\n\n\t\t\tTURKLE \n\tAh believe ya, brother. Ah believe\n\tya!\n\n\t\t\tMCMURPHY\n\t\t(taking Turkle aside;\n\t\tholds up $20 bill)\n\tNow, wouldn't you pray for twenty\n\tbucks, a bottle booze an' a piece\n\tof that angel cake?\n\n\t\t\tTURKLE\n\t\t(taking the $20 and\n\t\treaching for his keys)\n\tAh'm on my knees, brother, ah'm on\n\tmy knees.\n\nTurkle unlocks the security screen and raises the window.\n\nMcMurphy sticks his head out the window.\n\n\t\t\tCANDY AND ROSE\n\t\t(both slightly tipsy)\n\tHiya, Mack.\n\n\t\t\tMCMURPHY\n\tHiya, girls...\n\n\t\t\tTURKLE\n\tShhh...\n\nCandy passes a heavy bag of bottles in. Then McMurphy and\nTurkle help her in. Her dress is above her thighs, her ass\nvisible as she swings over the windowsill and into McMurphy's\narms.\n\n\t\t\tCANDY\n\tWhew! Made it!\n\n\t\t\tMCMURPHY\n\t\t(embracing Candy)\n\tMan, you look good 'nough to eat!\n\n\t\t\tCANDY\n\tYeah, well you look like hell\n\twarmed over...\n\n\t\t\tROSE (O.S.)\n\tHey, pssst! Whadda 'bout me?\n\nTurkle turns to help Rose in, but she's not as easy to\nhandle, being a good deal heavier and twice as plastered as\nCandy.\n\n\t\t\tTURKLE\n\tHey, Mac! Gimme a hand, will ya!\n\nMcMurphy disengages himself from Candy and lends Turkle a\nhand. Rose is finally hauled into the room.\n\n\t\t\tROSE\n\t\t(giggling; loud)\n\tWhew! Hiya, boys!\n\n\t\t\tTURKLE\n\tShhh... let's move it away from the\n\twindow...\n\nThe group shifts a few feet as Turkle closes the window and\nlocks the screen. McMurphy turns back to Candy.\n\n\t\t\tMCMURPHY\n\t\t(arms open)\n\tCome here, sugar...\n\nCandy moves into McMurphy's arms as Rose, straightening her\ndress, turns to see Bromden looming. Rose SCREAMS.\n\n\t\t\tTURKLE\n\tWhat happened?\n\n\t\t\tROSE\n\t\t(backing into Turkle)\n\tWhat's that?\n\n\t\t\tTURKLE\n\t\t(mystified)\n\tWhat?\n\n\t\t\tROSE\n\t\t(pointing at Bromden)\n\tThat!\n\n\t\t\tTURKLE\n\tOh, that. That ain't nothin' to be\n\tafraid of, ma'am. Just ol Chief\n\tBromden. That's all...\n\n\t\t\tROSE\n\tIs he one of the loonies?\n\n\t\t\tMCMURPHY\n\tHe's a patient, Rose...\n\n\t\t\tROSE \n\tOh, yeah...\n\n\t\t\tMCMURPHY\n\tYeah...\n\n\t\t\tROSE \n\t\t(approaching Bromden\n\t\ttentatively)\n\tHi ya, big boy? How's it goin'?\n\tLike it in here?\n\n\t\t\tMCMURPHY\n\tHe can't hear you, Rose. He's just\n\ta big deaf an' dumb indian...\n\n\t\t\tCANDY\n\tPssst! Hey Rose! There they are!\n\n\t\t\tROSE\n\t\t(looking around)\n\tWhat? Where?\n\nCANDY points to the patients sleeping in the men's dorm.\n\n\t\t\tCANDY\n\tIn there.\n\n\t\t\tROSE\n\tWow! They're so quiet.\n\n\t\t\tTURKLE\n\tThey're sleeping, Miss. They're\n\tsleeping. An' we gotta keep it down\n\tso we don't disturb their sleep.\n\n\t\t\tROSE\n\tAre they dangerous when they're\n\tawake?\n\n\t\t\tTURKLE\n\tOh, no, Miss. Not these loonies.\n\tThese are nice guys. Nice guys.\n\n\t\t\tCANDY\n\tWhat's that smell?\n\n\t\t\tTURKLE\n\tWhat smell?\n\n\t\t\tCANDY\n\tSmells weird. Smells like\n\tpneumonia.\n\n\t\t\tTURKLE\n\tAmmonia, Miss...\n\n\t\t\tROSE\n\tSmells like piss. Is this real,\n\tCandy? Is this really real? I mean\n\twe are in an insane asylum, an' I\n\twanna know how we got ourselves\n\tinto this scene.\n\n\t\t\tTURKLE\n\tShhh, please, Miss. Keep it down...\n\nRose turns to McMurphy who has opened a bottle of booze and\nis taking a long pull.\n\n\t\t\tROSE\n\t\t(to McMurphy)\n\tWho is he?\n\n\t\t\tMCMURPHY\n\t\t(passing the bottle to\n\t\tTurkle)\n\tHe's in charge.\n\n\t\t\tROSE \n\tAre you a doctor?\n\n\t\t\tTURKLE\n\t\t(passing the bottle to\n\t\tRose)\n\tNot exactly, Miss. Not exactly.\n\n\t\t\tROSE\n\t\t(drinking and passing the\n\t\tbottle to Candy)\n\tYeah, well, I'll tell ya somethin'.\n\tI'll tell ya somethin'. I had this\n\tboyfriend, Chuck.\n\t\t(to McMurphy)\n\tYa know him, Mac. Ya remember,\n\tChuck.\n\n\t\t\tMCMURPHY\n\tSure, I know Chuck. I know him.\n\n\t\t\tROSE\n\tWell, listen to this. He got mad at\n\tme one day. Boy, did he get mad at\n\tme. He took the light bulb, ya\n\tknow. I thought he was going to\n\tcram it right up me, ya know. But\n\the ate it. He ate the whole fucking\n\tlight bulb.\n\t\t(to Turkle)\n\tNow, tell me! Is he crazy? Tell me!\n\tIs he crazy?\n\n\t\t\tTURKLE\n\tWell, Miss... I would say... I\n\twould say, yes. Yes, he's crazy.\n\n\t\t\tROSE\n\tI thought so.\n\n\t\t\tTURKLE\n\tIs he in an asylum?\n\n\t\t\tROSE\n\tHe's dead.\n\n\t\t\tTURKLE\n\tOh, I see. He was a very sick man.\n\tVery sick.\n\n\t\t\tROSE\n\tThat's what I told his mother. And\n\tshe said I was crazy. Her son ate\n\tthe whole fucking light bulb and\n\tshe said I was crazy.\n\n\t\t\tTURKLE\n\tI don't know anything about that,\n\tMiss. I would have to examine you\n\tfirst...\n\n\t\t\tROSE\n\tYou ol' fucker!\n\n\t\t\tTURKLE\n\tWell, I'm running a risk by letting\n\tyou in, Miss. You know I'm runnin'\n\ta risk of gettin' my black ass\n\tfired. If you understand what I\n\tmean...\n\n\t\t\tMCMURPHY\n\tSure, she understands what you\n\tmean. She's not dumb. Why do you\n\tthink Rose came to visit us? Rose\n\tis very interested in hospitals and\n\thospital facilities. Aren't you,\n\tRose?\n\n\t\t\tROSE\n\tWhat?\n\n\t\t\tTURKLE\n\tI'll be very glad to show you\n\taround, Miss...\n\n\t\t\tMCMURPHY\n\tYeah, that's a good idea, Turkle.\n\tWhy don't ya take Rose on a little\n\ttour of our facilities...\n\n\t\t\tROSE\n\tWait a minute...\n\n\t\t\tCANDY\n\tIt's okay, Rose. You can go with\n\thim.\n\n\t\t\tROSE\n\tOh yeah! Well if ya don't mind,\n\tI'll decide on my own date!\n\n\t\t\tCANDY\n\tShit, Rose! What's there to decide?\n\tThere's only four of us.\n\n\t\t\tROSE\n\tWhaddaya talkin' about? There's at\n\tleast twenty guys in there. Let's\n\twake 'em up and get this party on\n\tthe road.\n\n\t\t\tTURKLE\n\tNow, Miss. What do you want with\n\ttwenty zombies when you got a\n\ttwenty gun salute looking you right\n\tin the face.\n\n\t\t\tROSE\n\tOh, yeah...\n\n\t\t\tTURKLE\n\tYou better believe it, you sweet\n\tlittle thing. You better believe\n\tit...\n\n\t\t\tROSE\n\tDon't you sweet talk me you ol'\n\tspook, you!\n\n\t\t\tTURKLE\n\tOh, I'm all through talkin'. Now,\n\tlet's just you an' me trip on down\n\tthat hall.\n\n\t\t\tCANDY\n\tGo with him, Rose. Go with him.\n\n\t\t\tROSE\n\tWell, okay, but I just want to look\n\tat the facilities. That's all.\n\n\t\t\tTURKLE\n\tThat's all I'm going to show you.\n\nMcMURPHY'S POV - TURKLE AND ROSE\n\nas the two of them cross out of the day room toward the\nhallway, Turkle suddenly turns and hurries back to McMurphy,\ntakes the bottle of booze and hurries off clucking to\nhimself.\n\nBACK TO McMURPHY and CANDY.\n\n\t\t\tMCMURPHY\n\t'Kay, lets get under way.\n\nMcMurphy crosses to package of booze, selects another bottle,\nunscrews the top and takes a long pull, then hands the bottle\nto Bromden.\n\n\t\t\tMCMURPHY\n\tDown the ol' hatch, Chief.\n\nBromden takes a long pull on the bottle, gags and passes the\nbottle to McMurphy who crosses to the nurses' station and\npeeks around the corner.\n\nMcMURPHY\n\nas he peeks around the corner.\n\nMcMURPHY'S POV - TURKLE AND ROSE\n\nfar down the hallway, as Turkle shows Rose one room, then\nanother, and then the seclusion room, into which Turkle\nplayfully lures Rose, who playfully resists, but finally\nenters. A beat passes and they don't come out.\n\nBACK TO McMURPHY\n\nSatisfied, he crosses to the nurses' station, reaches in the\nopen side-door window, opens the door and enters.\n\nINT. NURSES' STATION - NIGHT\n\nas McMurphy enters the nurses' station and looks around.\n\nINT. MEN'S DORM - NIGHT\n\nThe patients are all asleep. A very long beat, then --\n\n\t\t\tMCMURPHY (V.O.)\n\t\t(through loudspeaker; very\n\t\tlow, ominous, drawn out)\n\tWho knows what evil lurks in the\n\thearts of men...\n\nOminous LAUGHTER, then the lights go flashing on and off.\n\n\t\t\tMCMURPHY (V.O)\n\t\t(through loudspeaker)\n\tMedication time! Medication time!\n\tRise and shine! Rise and shine!\n\tTime to say goodbye... Everybody\n\tup, up, up!\n\nSome of the patients immediately pop awake as Candy comes in\nand starts hustling the patients out of bed.\n\n\t\t\tCANDY\n\tUp and at 'em, boys.\n\n\t\t\tBILLY\n\t\t(waking up)\n\tH-H-Hi, Candy...\n\n\t\t\tCANDY\n\tHi, Billy.\n\nINT. DAY ROOM - NIGHT\n\nMUSIC OVER as the patients are queued up at the nurses'\nstation where Candy is handing out cups full of whiskey,\nMcMurphy backing her up, pouring the booze into the cups.\nHarding takes his cup and moves back into the day room as\nEllis automatically downs the booze, gags and goes spinning\noff across the hallway and is nailed to the wall.\n\n\t\t\t\t\tQUICK CUT TO:\n\nDOWN THE HALL - TURKLE\n\nsticks his head out the door to check the scene out. Sees\nwhat's happening and comes rushing down the hallway, without\nhis shirt, and zipping up his pants.\n\nINT. NURSES' STATION - NIGHT\n\nas Turkle shoves his way to the intercom system and switches\noff the lights and music.\n\n\t\t\tTURKLE\n\t\t(furiously pushing them\n\t\tout)\n\tYou crazy goons... shut up an' get\n\toutta here... Out! Out! Out!\n\nINT. HALLWAY - NIGHT\n\nSilence as the last man is driven out of the nurses' station.\n\nDown the hallway, a light goes on in the visitors' room.\n\n\t\t\tTURKLE\n\tShit, it's the soo-per-visor come\n\tto fire my black ass.\n\nA KEY is HEARD hitting the lock at the end of the hallway.\nWithout losing a beat, Turkle reverses his movement and\nstarts pushing everybody back into the nurses' station.\n\n\t\t\tTURKLE (CONT'D)\n\t\t(pushing)\n\tGet back in there! In! In! In!\n\nAs Turkle pushes the last man into the nurses' station, he\nsees Rose stick her head out of the seclusion room.\n\n\t\t\tTURKLE (CONT'D)\n\t\t(motioning and shouting)\n\tStay in there! Stay in there!\n\nRose ducks back into the seclusion room as, simultaneously,\nTurkle closes the door behind him to the nurses' station as\nthe door to the ward opens and the NIGHT SUPERVISOR, a middle\naged woman, enters the ward.\n\nINT. NURSES' STATION - NIGHT\n\nas Turkle, shushing the crowd, makes his way to the nurses'\nlounge and opens the door.\n\n\t\t\tTURKLE\n\t\t(harsh whisper)\n\tAlla ya goons, get in here!\n\nThe patients pile into the nurses' lounge, Turkle cramming\nthe last one through the door and closing it. He turns and\ncrosses to the side door and steps out.\n\nINT. HALLWAY - NIGHT\n\nas Turkle steps out of the nurses' station, closing the door\nbehind him.\n\n\t\t\tNIGHT SUPERVISOR\n\tOh, there you are, Mister Turkle.\n\n\t\t\tTURKLE\n\tEvenin', ma'am.\n\n\t\t\tNIGHT SUPERVISOR\n\tIs everything all right?\n\n\t\t\tTURKLE\n\t\t(blocking her way to the\n\t\tday room)\n\tWhy, sure, ma'am...\n\n\t\t\tNIGHT SUPERVISOR\n\tThe lights were flashing on and\n\toff, Mister Turkle.\n\n\t\t\tTURKLE\n\tJus' cleanin' up, ma'am.\n\n\t\t\tNIGHT SUPERVISOR\n\tAt this hour?\n\n\t\t\tTURKLE\n\tCleanliness is a twenty-four-hour\n\tjob, ma'am...\n\nHarding passes by and enters the latrine.\n\n\t\t\tNIGHT SUPERVISOR\n\tWhat are these men doing up\n\twandering around?\n\n\t\t\tTURKLE\n\t\t(leaning in)\n\tAh guess the natives are restless,\n\tma'am...\n\n\t\t\tNIGHT SUPERVISOR\n\t\t(getting a whiff of his\n\t\tbreath)\n\tYou've been drinking on the job\n\tagain, haven't you, Mister Turkle!\n\n\t\t\tTURKLE\n\tAh, no, ma'am... well, yes,\n\tma'am...\n\t\t(leaning in close)\n\tA man get awful lonely at night, if\n\tya know what Ah mean, ma'am...\n\nDown the hall, Rose sticks her head out the door, sees what's\nhappening, and ducks back in as the Night Supervisor turns on\nher heel and starts back down the hallway, Turkle at her\nheels.\n\n\t\t\tNIGHT SUPERVISOR\n\tI want those men put back to bed,\n\tMister Turkle!\n\n\t\t\tTURKLE\n\tYes, ma'am...\n\n\t\t\tNIGHT SUPERVISOR\n\tAnd you haven't heard the last of\n\tthis!\n\n\t\t\tTURKLE\n\tYes, ma'am...\n\nShe opens the gate, slams it behind her, crosses to the main\ndoor, opers it and exits to:\n\n\t\t\tTURKLE (CONT'D)\n\t\t(calling after her)\n\tNight, night.\n\nTurkle turns and the smile leaves his face as he hurries down\nthe hallway.\n\nO.S. the TOILET FLUSHES as Turkle stops at the seclusion room\nand sticks his head in.\n\n\t\t\tTURKLE (CONT'D)\n\tBe right back, honey...\n\nTurkle closes the door, crosses down to the nurses' station,\nand enters as Harding comes out of the latrine.\n\nINT. NURSES' STATION - NIGHT\n\nas Turkle enters, crosses to the nurses' lounge and opens the\ndoor to see the patients, silhouetted against the open\nrefrigerator light, moving around, pulling the room apart. It\nsmacks of Dante's Inferno as Turkle snaps on the light and\nsteps into the room.\n\nINT. NURSES' LOUNGE - NIGHT\n\nas Turkle steps into the room and sees the extent of the\nplundering. The filing cabinet is open. So is the medicine\ncabinet. Rolls of medical gauze are strewn around, cough\nsyrup and orange juice are flowing.\n\nThe patients start piling out of the room, carrying their\nplunder.\n\nFredrickson and Sefelt are SEEN sitting on the floor, in\nfront of the open refrigerator, looking through their\ndossiers.\n\n\t\t\tFREDRICKSON\n\tChrist, they even got my first\n\tgrade report card here...\n\n\t\t\tSEFELT\n\tLemme see...\n\nSefelt leans in, unintentionally tipping a bottle of cough\nsyrup in his hand which goes \"glug, glug, glug...\" all over\nthe papers.\n\n\t\t\tSEFELT (CONT'D)\n\tJesus, they're terrible grades,\n\tFred...\n\nTurkle stoically takes in the shattered remains of his job,\nunscrews the top to his bottle of whiskey, and takes the\nbiggest swig of his life as, O.S., Rose is HEARD SCREAMING.\n\nINT. HALLWAY - NIGHT\n\nas Rose, naked as the day she was born, runs screaming down\nthe hall, Ellis loping after her, reaching out his hand.\n\nINT. DAY ROOM - NIGHT\n\nas the others, who are laying out food, drinking booze and\nstringing up hospital gauze, turn to see Rose enter the room.\nShe runs behind McMurphy, pressing her body to his, as he\ngently takes hold of Ellis' outstretched hands.\n\n\t\t\tMCMURPHY\n\t\t(to Rose)\n\tDon't scream, honey...\n\nHe gently guides Ellis to the wall, with Rose still clinging\nto his back.\n\n\t\t\tMCMURPHY\n\tEllis ain't gonna hurt you... Ellis\n\tis nice... Nice Ellis... see the\n\tnice lady...\n\nHe pins Ellis to the wall.\n\n\t\t\tMCMURPHY\n\tThere, see, nice lady touch\n\tEllis...\n\nRose reaches out and touches Ellis.\n\nThe others stand agog, looking at this Holy Trinity.\n\n\t\t\t\t\tDISSOLVE TO:\n\nINT. DAY ROOM - NIGHT\n\nA SOFT NOSTALGIC NUMBER is HEARD OVER LOUDSPEAKER as Harding,\nBilly and Cheswick watch McMurphy dance with Candy,\nFredrickson with Sefelt and Rose, who is dressed, dance with\nTaber.\n\nMartini and Scanlon are busy draping hospital gauze around\nthe room.\n\nBromden sits by the window -- waiting.\n\n\t\t\t\t\tDISSOLVE TO:\n\nINT. DAY ROOM - NIGHT\n\nAnother SOFT NOSTALGIC NUMBER is HEARD OVER LOUDSPEAKER as\nMcMurphy, Candy, Harding, Cheswick, Taber, Sefelt and\nFredrickson watch Rose, on a table, doing a solo bump-and\ngrind dance, while Martini and Scanlon race around the room\nin wheelchairs.\n\nBilly sits, watching Candy and McMurphy, who sit across the\nroom.\n\nCandy is tired and bored.\n\nMcMurphy is drunk and starting to fade.\n\n\t\t\tCANDY\n\tIt's time to hit the road, Mack...\n\n\t\t\tMCMURPHY\n\t\t(snapping at her)\n\tDon't worry 'bout the road! We'll\n\thit the road! It'll be there when\n\twe're ready!\n\t\t(to the room)\n\tAin't that right, fellas?\n\nHe gets up and crosses to his friends.\n\n\t\t\tMCMURPHY\n\tI jus' want you guys to have a good\n\ttime... Are ya havin' a good time?\n\tYou... you... good... good... Lez\n\thave some fun...\n\nHe turns to see Billy, who isn't having fun.\n\n\t\t\tMCMURPHY\n\tWhatsa matter with ya...\n\nBilly turns away and McMurphy crosses to him.\n\n\t\t\tMCMURPHY\n\tAin'tcha havin' a good time...\n\t\t(no response)\n\tWhadaya want? Ya wanna drink? A\n\tcigarette...\n\nBilly looks up at McMurphy, his eyes are flooded with tears.\n\n\t\t\tMCMURPHY\n\tWhatsamatter, kid, what's botherin'\n\tyou...?\n\n\t\t\tBILLY\n\tAh-ah-ah-are y-y-y-you g-g-g-going\n\tt-t-t-to muh-muh-muh-marry her?\n\n\t\t\tMCMURPHY\n\tMarry who?\n\n\t\t\tBILLY \n\tC-C-C-C-Candy!\n\n\t\t\tMCMURPHY\n\tCandy? Hell no, Billy, she's just a\n\tgood friend, that's all...\n\n\t\t\tBILLY\n\tWu-wu-wu I-I-I-I th-th-think sh-sh\n\tsh-she's th-th-th-the ma-ma-ma-most\n\tbu-bu-bu-beautiful wu-wu-wu-woman\n\tin th-th-the whole world!\n\nA long beat as McMurphy looks at Billy, then Candy, then\nBilly.\n\n\t\t\tMCMURPHY\n\t\t(softly)\n\tWhy don't ya go tell 'er...\n\nBilly doesn't move.\n\n\t\t\tMCMURPHY\n\tGo on, son, now's your chance...\n\nBilly slowly crosses toward Candy, stopping halfway to look\nback at McMurphy, who gives him an affirmative gesture. He\ncrosses to Candy, who just looks at him.\n\n\t\t\tBILLY\n\tC-C-Candy, wu-wu-will y-y-you mu-mu\n\tmarry me!\n\n\t\t\tCANDY\n\tAh, Billy...\n\nCandy rises, kisses Billy on the cheek, and dances with him.\n\nMcMurphy beams on the twosome, unscrews his whiskey bottle,\ntakes a long pull on the juice, and looks at Bromden.\n\nBromden sits by the window waiting.\n\n\t\t\t\t\tDISSOLVE TO:\n\nINT. DAY ROOM - NIGHT\n\nas the MUSIC ENDS. A long silence, then another NUMBER begins\nas McMurphy, who has nodded off, starts awake and looks\naround.\n\nMcMURPHY'S POV\n\nBromden sits by the window waiting.\n\nCheswick is asleep on the table.\n\nMartini and Scanlon are sitting in their wheelchairs filling\ntheir cups from through the enema tube.\n\nHarding sits, maintaining his aloofness, smoking a cigarette.\n\nSefelt is sitting on the floor, in a drunken stupor, while\nFredrickson dances around him.\n\nCandy and Billy stand, locked in each other's arms, swaying\nto the MUSIC.\n\nMcMURPHY\n\nstruggles to his feet, steadies himself, crosses to the\nnurses' station.\n\nINT. NURSES' LOUNGE - NIGHT\n\nas McMurphy enters and goes to Turkle, who is dead asleep.\nMcMurphy lifts Turkle's keys and leaves.\n\nINT. DAY ROOM - NIGHT\n\nas McMurphy crosses to Billy and Candy, and gently parting\nthem, he puts his arms around them -- as much for support as\naffection.\n\n\t\t\tMCMURPHY\n\tCome on, you lovers, it's gettin'\n\tlate...\n\nThey move toward the hallway.\n\nBromden and Harding are the only two who watch them go.\n\nINT. HALLWAY - NIGHT\n\nas McMurphy passes several doors, reaches the door of his\nchoice, fumbles with the keys, finds the right one, and opens\nthe door to the seclusion room.\n\n\t\t\tMCMURPHY\n\t\t(standing aside)\n\tIn ya go...\n\n\t\t\tBILLY\n\t\t(holding back)\n\tM-M-M-Mack?\n\n\t\t\tMCMURPHY\n\tIt's okay, kid. Everything it going\n\tto be okay... I'll come back an'\n\tgetcha in a while... 'Kay...\n\nCandy and Billy, hand in hand, enter the small room, which\nhas a bed in it.\n\nMcMurphy closes the door, looks at the keys, and pockets\nthem. CAMERA TRACKS with McMurphy, who is a very weary man,\nback into the day room.\n\nINT. DAY ROOM - NIGHT\n\nMUSIC OVER LOUDSPEAKER as McMurphy crashes heavily into his\nchair. He can hardly keep his eyes open as he looks around.\n\nHarding sits nearby.\n\nTaber is lying on a couch, his head in Rose's lap.\n\nCheswick is asleep on the table.\n\nEllis stands nailed to the wall.\n\nBromden sits by the window -- waiting. CAMERA HOLDS on\nBromden.\n\n\t\t\tMCMURPHY (V.O.)\n\tHey, Harding, wake me in an hour.\n\n\t\t\tHARDING (V.O.)\n\tSure, Mack...\n\nCAMERA PUSHES INTO WINDOW. TIME LAPSE SHOT of the DAWN and\nSUN RISING.\n\n\t\t\tWASHINGTON (V.O.)\n\t\t(very far away; getting\n\t\tcloser)\n\tBibbit? Where's Bill Bibbit, ya\n\tdamn goons?\n\nINT. DAY ROOM - EARLY MORNING\n\nas Washington jostles McMurphy awake.\n\n\t\t\tWASHINGTON\n\tCome on, get over there!\n\nMcMurphy allows himself to be led to the heavy security\npartition, by the men's dorm, where all the patients are\nlined up.\n\nIt is morning and the day room is a mess:\n\nA few chairs turned over. Paper cups and empty bottles.\nPuddles of cough syrup, orange juice and apple juice worked\ninto sticky masses.\n\nRose sits by herself on the couch.\n\nBromden is the last one led to the lineup, where Big Nurse\nwaits.\n\n\t\t\tBIG NURSE\n\tThank you, Mister Washington!\n\tMister McMurphy, do you know where\n\tBilly is?\n\nMcMurphy shrugs \"no.\"\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Harding, have you seen\n\tBilly?\n\nHarding shrugs \"no.\"\n\n\t\t\tBIG NURSE (CONT'D)\n\tMister Sefelt...\n\nBig Nurse's question is cut off as all the patients and\nattendants turn their heads toward the hallway and start\nlaughing. Big Nurse turns to see Turkle, without his shirt\non, walk into the seclusion room and close the door behind\nhim.\n\nBig Nurse turns and starts down the hallway, the laughter\ntrailing after her when, suddenly, the laughter breaks off as\nBig Nurse stops and in the silence, she opens the door.\n\nINT. SECLUSION ROOM - EARLY MORNING\n\nas Big Nurse opens the door to see Candy snuggled up to\nBilly, who lies there, eyes closed, a smile on his face.\n\n\t\t\tTURKLE\n\t\t(buttoning up his shirt)\n\tMorning, Miss Ratched...\n\nHe slides out of the room as Billy opens his eyes. A long\nbeat as they look at each other.\n\n\t\t\tBILLY\n\tM-M-M-M-M-M-\n\nBig Nurse shakes her head and exits, closing the door behind\nher.\n\nINT. HALLWAY - MORNING\n\nas Big Nurse heads for the day room, walking straight for\nMcMurphy when:\n\n\t\t\tBILLY (O.S.)\n\t\t(shouting)\n\tM-M-M-Miss Ratched!\n\nBig Nurse stops and turns to see Billy, half naked, pulling\nhis pajama pants up as he runs, stumbling toward Big Nurse.\n\n\t\t\tBILLY (CONT'D)\n\t\t(crying out as he runs)\n\tP-p-p-please du-du-don't t-t-t-tell\n\tm-m-my muh-muh-muh-mummy!\n\nHe trips on his pajamas and falls sprawling at Big Nurse's\nfeet, his bare ass exposed to all.\n\n\t\t\tBILLY (CONT'D)\n\t\t(blubbering as he rises)\n\tP-p-p-please du-du-du-don't t-t\n\ttell her, p-p-please...\n\n\t\t\tBIG NURSE\n\tYou should have thought about that\n\tbefore you brought that woman in\n\there!\n\n\t\t\tBILLY\n\tN-n-n-n-no, no, I du-du-du-didn't,\n\tI didn't!\n\n\t\t\tBIG NURSE\n\tI don't want your mother to believe\n\tsomething like this but what am I\n\tto think?\n\n\t\t\tBILLY\n\tSh-sh-sh-she m-m-made m-m-me do it!\n\n\t\t\tBIG NURSE\n\tBilly, that girl couldn't have\n\tpulled you in there forcibly...\n\n\t\t\tBILLY\n\tSh-sh-she did! Everybody did!\n\n\t\t\tBIG NURSE\n\tWho? Tell me!\n\n\t\t\tBILLY\n\tM-M-Muh-Muh-McMurphy!\n\n\t\t\tMCMURPHY\n\tAhhh, Billy...\n\n\t\t\tBILLY \n\t\t(caught in his own\n\t\tanxiety)\n\tP-p-p-please duh-duh-duh-duh t-t\n\ttell, M-M-M-Miss R-R-Ratched, y-y\n\tyou don't need to!\n\n\t\t\tBIG NURSE\n\tGet up, Billy.\n\n\t\t\tBILLY\n\t\t(screaming)\n\tNo! No! No!\n\nBilly pitches forward and collapses on the floor, screaming,\npounding his fists and feet against the floor.\n\n\t\t\tBILLY (CONT'D)\n\tN-n-n-n-duh-duh-duh-pl-pl-pl-pl-muh\n\tmuh-muh...\n\n\t\t\tBIG NURSE\n\t\t(ignoring McMurphy)\n\tMister Washington.\n\n\t\t\tMCMURPHY\n\t\t(helplessly to Billy)\n\tHey, Billy, stop cryin'. You don't\n\thave to cry... You ain't got\n\tnothin' to be ashamed of. She ain't\n\tgonna tell you mother... stop\n\tcrying...\n\n\t\t\tWASHINGTON\n\tYes, Miss Ratched!\n\n\t\t\tBIG NURSE\n\t\t(to Washington)\n\tPut him in Doctor Spivey's office!\n\n\t\t\tWASHINGTON\n\tYes, Miss Ratched...\n\nWashington nods to Warren and the two of them scoop Billy off\nthe floor and carry him screaming to Doctor Spivey's office\nas Big Nurse crosses into the nurses' station and picks up\nthe phone as Candy eases her way into the day room and joins\nMcMurphy.\n\nA beat, then Miller starts herding the patients toward the\nwashroom, staying clear of McMurphy and Bromden, who don't\nmove.\n\nMcMurphy pulls the keys out of his pocket.\n\n\t\t\tMCMURPHY\n\t\t(to Candy)\n\tLet's go!\n\nMcMurphy checks the nurses' station, sees Big Nurse is busy\non the telephone.\n\n\t\t\tMCMURPHY\n\t\t(to Bromden)\n\tLet's go, Chief...\n\nMcMurphy crosses to the window, followed by Bromden, Candy\nand Rose, where he begins fumbling with the lock.\n\nMILLER\n\nas he herds the patients out of the day room. He turns to see\nMcMurphy trying to open the screen. Miller crosses to\nMcMurphy.\n\n\t\t\tMILLER\n\tHey, what's gone here?\n\nMcMurphy turns around and punches Miller.\n\nINT. NURSES' STATION - MORNING\n\nas Big Nurse, still on the phone, sees Miller go sprawling\nacross the floor. She grabs the intercom.\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(through loudspeaker)\n\tWashington! Warren! To the day\n\troom, immediately!\n\nINT. DAY ROOM - MORNING\n\nMcMurphy opens the screen, raises the window, and helps Candy\nand Rose out as Washington and Warren converge on them.\nMcMurphy and Bromden wheel around.\n\nWashington, Warren and Miller appear around the corner, take\none look, and head straight for McMurphy.\n\n\t\t\tWASHINGTON\n\t\t(stopping just short)\n\t'Kay, let's have the keys an'\n\tnobody get hurt!\n\nWashington's words are cut off as, O.S., Nurse Pilbow\nSCREAMS... a bloodcurdling scream. They turn to see Nurse\nPilbow enter the nurses' station, her uniform splattered with\nblood, hysterically talking to Big Nurse (we can't hear her).\n\nBig Nurse and Nurse Pilbow rush out of the nurses' station\nand head down the hallway.\n\nMcMurphy is glued to the spot.\n\n\t\t\tCANDY\n\t\t(calling from outside)\n\tCome on, come on, let's go!\n\nMcMurphy hesitates, then moves across the day room toward the\nhallway.\n\nINT. DOCTOR SPIVEY'S OFFICE - MORNING\n\nCAMERA SHOOTING TOWARD the door, crammed full of patients,\nwho stare at the scene with curious detached looks, as Big\nNurse and Nurse Pilbow force their way through the patients.\nThe crowd parts and Big Nurse stops in the doorway, horrified\nat what she sees. CAMERA HOLDS on Big Nurse's reaction. A\nbeat, then McMurphy appears alongside Big Nurse and is\nstricken by what he sees.\n\nMcMURPHY AND BIG NURSE'S POV - REVERSE SHOT - DOCTOR SPIVEY'S\nOFFICE\n\nThe office is splattered with blood. Billy is lying face up,\nhanging over Spivey's desk, dead. His throat and both wrists\nare cut. A broken picture frame, containing a photograph of\nSpivey's family, lies nearby.\n\n\t\t\tMCMURPHY\n\tBilly, oh, Billy boy...\n\nMcMurphy crosses into the room and kneels alongside Billy's\nbody. He gently lays his hand on Billy's face.\n\n\t\t\tBIG NURSE\n\tGet away from him! Don't you dare\n\ttouch him!\n\nMcMurphy turns and leaps at Big Nurse, grabbing her throat;\nhe drives her into the Acutes and Nurse Pilbow.\n\nINT. HALLWAY - MORNING\n\nas McMurphy, Big Nurse, Nurse Pilbow and several Acutes go\ndown, arms and legs intertwined, kicking, trying to get away\nas McMurphy strangles Big Nurse.\n\nNurse Pilbow screaming, as Washington, Warren, Miller rush\nin, trying to break his hold on Big Nurse's throat, her face\nturning blue. McMurphy's face, twisted by his passion, when\nWashington lands a rabbit punch and MeMurphy's face relaxes\nas he passes out.\n\n\t\t\t\t\tDISSOLVE TO:\n\nINT. DAY ROOM - DAY\n\nMUSIC OVER LOUDSPEAKER. The day room is as it was in the\nbeginning. Harding is dealing out a game of blackjack to\nMartini,\n\nScanlon, Cheswick and Fredrickson.\n\nTaber, pencil in band, sits pondering over a blank sheet of\npaper.\n\nRuckly is turning a grimy photograph over in his hands.\n\nBancini sits wagging his head, mumbling over and over,\n\"Tired... awful tired...\" Ellis stands against the wall, arms\noutstretched.\n\n\t\t\tHARDING (V.O.)\n\t\t(over last scene, in\n\t\tMcMurphy's style)\n\tOkay, suckers, place your bets...\n\nINT. HALLWAY - DAY\n\nBromden is mopping the floor near the security gate to the\nvisitors' room, when a key hits the lock. Bromden looks up\nexpectantly.\n\nBROMDEN'S POV\n\nas Sefelt and Miller enter the visitors' room, cross to the\nsecurity gate and pass into the hallway. Bromden goes back to\nhis mopping.\n\nINT. DAY ROOM - DAY\n\nas Sefelt jauntily enters the day room.\n\n\t\t\tBIG NURSE (V.O.)\n\t\t(through loudspeaker)\n\tDid everything go well, Mister\n\tSefelt?\n\nSefelt turns to the nurses' station where, inside, Big Nurse\nsits very erect, wearing a back brace that reaches up around\nher neck. Sefelt shows his teeth and gums to Big Nurse.\n\n\t\t\tBIG NURSE (V.O.) (CONT'D)\n\t\t(through loudspeaker)\n\tThat's very nice. Now, doesn't that\n\tmake you feel better, Mister\n\tSefelt?\n\n\t\t\tSEFELT\n\tYes, ma'am...\n\n\t\t\tBIG NURSE\n\tGood...\n\nShe turns back to her work.\n\nSefelt crosses to the card game, where he sits and catches\nFredrickson's attention; showing him his teeth. Fredrickson\nsmiles at Sefelt and blows him a kiss.\n\n\t\t\tHARDING\n\t\t(who has been dealing)\n\tBig Ace... a lovely lady... another\n\tace... an' a little trey, hey, hey,\n\twhadaya say... hit or sit?\n\n\t\t\tSCANLON\n\tHit!\n\n\t\t\tSEFELT\n\t\t(to Fredrickson)\n\tYa know what, Fred?\n\n\t\t\tFREDRICKSON\n\tWhat?\n\n\t\t\tHARDING\n\t\t(dealing a card to\n\t\tScanlon)\n\tBig king, too bad...\n\n\t\t\tSEFELT\n\tJust wait till you hear...\n\n\t\t\tHARDING\n\tHear what?\n\n\t\t\tSEFELT\n\tMcMurphy killed two attendants and\n\tescaped...\n\n\t\t\tHARDING\n\tWhen?\n\n\t\t\tSEFELT\n\tYesterday...\n\n\t\t\tHARDING\n\tWho told you that?\n\n\t\t\tSEFELT\n\tGary Blinker...\n\n\t\t\tSCANLON\n\tGary Blinker's fulla shit!\n\n\t\t\tMARTINI\n\tHe's not!\n\n\t\t\tSCANLON\n\tHe is!\n\nHarding slams his card down on the table, rises and crosses\nto the nurses' station where he taps on the side window.\n\nBig Nurse gets up, crosses to the window and slides it open.\n\n\t\t\tBIG NURSE\n\tYes, Mister Harding?\n\n\t\t\tHARDING\n\tIs it true McMurphy killed two\n\tattendants and escaped yesterday?\n\n\t\t\tBIG NURSE\n\tNo. Mister Harding, that is not\n\ttrue.\n\n\t\t\t\t\tDISSOLVE TO:\n\nINT. HALLWAY - LATE AFTERNOON\n\nBromden is squatting, leaning against the wall near the\nsecurity gate to the visitors' room, when a KEY HITS THE\nLOCK. He looks up expectantly. This time it is McMurphy. Or\nwhat was McMurphy, for his head is bandaged, and his tongue\nhangs out of his mouth as he is led across the visitors' room\nby an ATTENDANT.\n\nMcMurphy shows Bromden no sign of recognition, which Bromden\npays no attention to, thinking McMurphy is putting on the\nsame act he did when he came back from Electro-Shock Therapy.\n\nBromden joyously turns and runs down the hallway to the day\nroom.\n\nINT. DAY ROOM - LATE AFTERNOON\n\nas Bromden crosses into the day room, gets a seat, and sits\nfacing the hallway, bursting with expectation.\n\nA long beat, then the Attendant appears with McMurphy and\ntaps at the side door to the nurses' station.\n\nThe Acutes break off their card game and look at McMurphy;\ntheir faces hang open at his appearance.\n\nBig Nurse crosses to the side door, opens it, and steps out\ninto the day room. To the Attendant as she takes McMurphy by\nthe arm:\n\n\t\t\tBIG NURSE\n\tThank you...\n\n\t\t\tATTENDANT\n\tYes, ma'am...\n\nThe Attendant exits.\n\n\t\t\tBIG NURSE\n\t\t(to McMurphy)\n\tNow, let's find you a place to sit,\n\tshall we, Mister McMurphy?\n\nBig Nurse gently guides McMurphy to a seat on the Chronics'\nside of the room.\n\nBromden can hardly contain himself as he waits for McMurphy\nto go into his act.\n\nThe Acutes have already absorbed the reality of McMurphy's\ncondition as they exchange looks with each other.\n\n\t\t\tFREDRICKSON\n\t\t(whispering)\n\tLobotomy...\n\n\t\t\tHARDING\n\tYeah...\n\n\t\t\tSCANLON\n\tYeah, that Gary Blinker is fulla\n\tshit...\n\nThe Acutes turn back to their card game as Harding shuffles\nand deals the cards out.\n\nBromden keeps his eyes glued to Big Nurse and McMurphy.\n\n\t\t\tBIG NURSE\n\t\t(sitting McMurphy down)\n\tHere now, you sit here... That's\n\tit...\n\nBig Nurse pats McMurphy's face and crosses back to the\nnurses' station.\n\nMcMurphy just sits there, his head lolling to one side.\n\nBromden waits for McMurphy to go into his routine.\n\nMcMurphy just sits there.\n\nBromden snaps his fingers and slaps his thigh, then waits for\nMcMurphy to follow suit.\n\nMcMurphy just sits there slobbering.\n\nBromden slaps his thigh again.\n\nNo response from McMurphy.\n\nThe MUSIC PLAYS ON.\n\n\t\t\t\t\tDISSOLVE TO:\n\nINT. MEN'S DORM - DAYBREAK\n\nas Bromden stands by the window looking out. A long beat,\nthen he turns into the room and looks around.\n\nBROMDEN'S POV\n\nThe patients are all asleep. The new night attendant is fast\nasleep in the nurses' station.\n\nBromden quietly takes his pillow and goes to McMurphy's bed,\nwhere he kneels and puts his head very close to McMurphy's. A\nlong beat as Bromden studies McMurphy's face.\n\n\t\t\tBROMDEN\n\t\t(whispering in McMurphy's\n\t\tear)\n\tWhen I first came here I was so\n\tscared of being lost I had to\n\tholler so they could track me... I\n\tfigured anything was better than\n\tbeing lost...\n\nOn the last word, Bromden places his pillow over McMurphy's\nface and begins to suffocate him. McMurphy starts thrashing\nand Bromden lies full length on McMurphy. A long beat, then\nthe thrashing ends. Bromden gets off McMurphy, replaces his\npillow, and crosses down the aisle toward the day room.\n\nINT. DAY ROOM - DAYBREAK\n\nThe night attendant continues to sleep as Bromden passes the\nnurses' station, heading for the tub room.\n\nINT. TUB ROOM - DAWN\n\nas Bromden crosses to the heavy machine which McMurphy had\nonce tried to lift, sizes it up, then bends over and takes\nhold and heaves. The GRINDING WEIGHT is HEARD as Bromden\nexerts all his strength, slowly lifts the machine off the\nfloor, balances it above his shoulders, then crosses out of\nthe tub room.\n\nINT. DAY ROOM - DAWN\n\nas Bromden comes around the corner and past the sleeping\nnight attendant in the nurses' station.\n\nBromden lines himself up with the window across the room,\nthen starts toward it, picking up speed as he goes. Then, at\nthe last moment, he stops and, with an enormous effort, he\nhurls the machine through the security screen and the window.\nA LOUD CRASH.\n\nIn the nurses' station, the night attendant starts awake and\nlooks around. Too late as Bromden vaults through the window.\nCAMERA HOLDS on window as Bromden runs across the grounds and\ndisappears into the pine trees.\n\nINT. DAY ROOM - DAWN\n\nas the night attendant comes out of the nurses' station and\nlooks confusedly around. Then he spots the shattered window.\n\nEXT. COUNTRYSIDE - EXTREME LONG SHOT - SUNRISE\n\nRolling hills, forests and distant mountains, bathed in\nsunlight, as Bromden runs across a far-off meadow.\n\nCREDITS OVER.\n\n\t\t\tTHE END\n\n\n\n\n\n\n\nOne Flew Over the Cuckoo's Nest\nWriters :   Bo Goldman  Lawrence Hauben  Ken Kesey\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:32.355884"}