{"title": "Orphan", "film_link": "/Movie Scripts/Orphan Script.html", "script_link": "/scripts/Orphan.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Orphan Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Orphan.jpg\" title=\"Orphan Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/7-stars.gif\"/> (7.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=David Leslie Johnson\" title=\"Scripts by David Leslie Johnson\">David Leslie Johnson</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a><br/><br/>\n<b>Script Date</b> : February 2007<br/>\n<b>Movie Release Date</b> : July 2009<br/>\n<br/>\n<a href=\"/scripts/Orphan.html\">Read \"Orphan\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                                        ORPHAN\n</b>\n\n\n                                      Written by\n\n                                 David Leslie Johnson\n\n\n\n\n                                                         February 5, 2007   \n<b>          \n</b>\n<b>          FADE IN:\n</b><b>          CLOSE -- KATE COLEMAN (MID 30S )\n</b>          She's a simple beauty and very pregnant, propped up in a bed,\n          wearing a hospital gown. A heart rate monitor BEEPS. She touches\n          her swollen belly, flush with excitement, her eyes full of wonder.\n\n<b>          MAN'S VOICE (O.S.)\n</b>          Okayp, just relax.now. This'll be over\n          Caitti before you know it.\n          Kate looks up. Her smile falters-as we REVEAL:\n\n<b>          INT. DELIVERY ROOM - NIGHT\n</b>\n          Harsh lights overhead. -THUNDER rumbles outside. Kate's on a.\n          delivery table, legs already in the stirrups. A sheet hangs-  \n          across her belly so we can't see what's going on below her waist.\n          A DOCTOR and NURSE snap pn gloves, prepare instruments: SHARP\n          BLADES and CURETTES, NEEDLES and FORCEPS. Kate is stricken. She\n          tries to sit up.\n\n<b>          KATE\n</b>          Wait, I've changed my mind. I don't\n          want to do this anymore.\n          The Doctor gives the Nurse an exasperated look. The Nurse takes\n          Rate's hand, eases her back onto the table.\n\n<b>          NURSE\n</b>          Your baby is dead. There's nothing.\n          else we can do.\n          Kate reels, her world turned upside-dowp. Emotional free-fall.\n\n<b>          KATE\n</b>          No, this isn't what's supposed to\n          happen. My baby's alive!\n\n<b>          NURSE\n</b>          We're so sorry. A terrible loss, we're\n          so sorry...\n\n<b>          KATE\n</b>          But it's still alive! It's moving!\n          Feel it, you can feel it!\n          Kate tries to put the Nurse's hand on her.belly but the-Nurse-\n          pulls away and hands the Doctor a pair of gleaming.blunt-tipped\n          SURGICAL SCISSORS. The Doctor leans between Rate's spread legs,\n          disappearing behind the curtain. Rate gasps.\n\n<b>          RATE\n</b>          No, stop! I want to be asleep! \n<b>          \n</b>\n<b>          \n</b>\n<b>          2.\n</b>\n<b>          -DOCTOR-\n</b>          TOO late for anesthesia.'' The baby's\n          coming. You're.going to experience\n          some pressure now... -\n          Kate winces and bites her lip as the Doctor goes about his unseen\n          work. A GOOD-LOOKING MAN in surgical scrubs stands behind him..\n          Bizarrely, he's videotaping-the whole thing. He's Kate's husband,\n          JOHN (late 30's). He smiles at her from behind -the camera.\n\n<b>          JOHN\n</b>          It's okay, honeys You're doing great!\n          The Doctor hands the scissors, now slick with gore, to the Nurse.\n          H e takes a SUCTION. CATHETER and disappears behind-the curtain\n          again. The Nurse - presses a button on a vacuum pump and the\n          machine begins to HUM. Kate tightly closes her eyes.\n\n<b>          KATE\n</b>          This isn't happening. Wake up, wake\n          up, wake up...\n          Suddenly -- the thin wail of a BABY CRYING. Rate's eyes go wide\n          w ith horror as the smiling Nurse approaches with a wriggling\n          bundle wrapped in a blanket. Blood seeps through the pink fabric.\n          W e can't see what's inside, but it's moving. And it's CRYING.\n\n<b>          NURSE\n</b>          Congratulations, Mrs. Coleman. It's a\n          girl .\n          The Nurse offers her the bloody, blanketed bundle. Kate screams -\n\n<b>          INT. KATE AND JOHN'S BEDROOM - NIGHT\n</b>\n          -- then snaps awake. She's been having a nightmare. John lies\n          n ext to her in bed. Be stirs, but doesn't wake. Kate slips out\n          of bed and quickly pads to the bathroom;\n\n<b>          INT. KATE AND JOHN'S BATHROOM - NIGHT\n</b>\n          Kate closes the door. We now see that she's not pregnant in\n          reality, only in her nightmare. She slides to the cold floor in\n          t he dark, a hand on her flat belly as she starts to cry...\n\n<b>          INT. DOCTOR BROWNING'S OFFICE - DAY\n</b>\n          Water TRICKLES in a little Zen fountain. Kate sits across from\n          -DR. -BROWNING, a mousy-haired woman in her 50's.\n\n<b>          DR. BROWNING\n</b>          A lot of women experience difficulties\n          around the anniversary of the\n          miscarriage or the baby's expected due\n          date. It's perfectly normal.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          3.\n</b>\n<b>          KATE\n</b>          I was thinking of\" going back to work.\n          I really thought 1 was doing better.\n\n<b>          DR. BROWNING\n</b>          You are. Think about where you were\n          just four months ago. -\n          (off Kate's look)\n          Are you still sober?\n          Kate hesitates. Dr. Browning gives her a penetrating look.\n\n<b>          KATE\n</b>          I drove by the wine shop,on my.way.bome\n          the other day.\n\n<b>          DR. BROWNING\n</b>          Did you stop?\n\n<b>          KATE\n</b>          I really wanted to. The thought went\n          through m' head, you know. it wasn't\n          for me, it just might be nice to have a\n          bottle handy in case we had guests.\n\n<b>          DR. BROWNING.\n</b>          But you didn't go in?\n\n<b>          KATE\n</b>          No.\n\n<b>          DR. BROWNING\n</b>          That's all that matters. Let's try to\n          stay focused on the. positive. Grief is\n          different for everyone. You have to\n          take it at your own pace.. Keep writing\n          in your journal. You're doing fine.\n          Rate smiles weakly. unconvinced.\n\n<b>          INT. LIVING ROOM -.DAY\n</b>\n          Rate hangs curtains over a beautiful picture window. She steps'\n          back to admire her work, then sighs. Now what? Now that she s\n          done, the house suddenly seems-quiet and lonely and too big.\n\n<b>          INT. NURSERY - DAY\n</b>\n          Kate sits in a rocking chair, gazing out a distinctive ARCHED\n          'WINDOW. We realize that she's -In a fully furnished and decorated\n          nursery. Crib, changing table, baby swing. No baby.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY\n</b>\n          It's a big, dramatic home in an affluent neighborhood. Kate\n          % crosses the backyard into the nearby woods.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          4.\n</b>\n<b>          EXT. FOREST - DAY\n</b>\n          After a short walk, Kate sits by a PEACEFUL BROOK lost in her\n          thoughts. ,She pulls a JOURNAL filled. with handwritten entries\n          from her coat pocket. After a beat,'she begins to write.\n\n<b>          EXT. SCHOOL FOR THE DEAF - DAY\n</b>\n          Class has just let out, PARENTS arriving to pick up their KIDS.\n          But the playground is MOSTLY SILENT -- these children an deaf,\n          communicating to one another and their teachers by sign language.\n          'Kate pulls up in a luxury minivan. Her five-year-old daughter MAX\n          runs over togreet her. She's almost- ridiculously cute.\n          (NOTE: Max doesn't speak. Her \"dialogue\" is SIGNED and\n          SUBTITLED. She wears a REARING AID- to help her read lips. when\n          people speak to her, they must face her and/or sign.)\n          Kate kisses Max's'head and helps her into the van, buckling her\n          car seat. Max shows her an art project she's bringing home.\n\n<b>          KATE\n</b>          Wow, did you make this?\n\n<b>          MAX\n</b>\n<b>          MY TEACHER HELPED.\n</b>\n<b>          INT./EXT. KATE'S MINIM - DAY\n</b>\n          Kate's' driving. She stops at an intersection. A PREGNANT WOMAN\n          crosses the street in front of them and stops at the corner. Kate\n          watches her for a long beat as if transfixed...\n          In the backseat, Max-CLAPS her hands to get Kate's attention.\n          Kate turns and sees Max pointing to the traffic light. IVs\n          green. A car horn HONKS. Kate snaps -out of it and drives off.\n\n<b>          INT. MUSIC ROOM - DAY\n</b>\n          Kate sits at a baby grand piano,'trying to compose a piece of..\n          music. She plays a few NOTES, frowns, tries again, takes a pencil\n          and erases what she's written down.\n          She pauses to look over-at a beautiful ORCHID in an ornate plants=\n          by the window. For a moment, she just stares at it. Then:\n          13 1 She's startled by something outside BOUNCING off the side\n           of the house. She closes her eyes, frustrated. BANGI EANG1\n           BANG! She tries to ignore it, but can't.\n\n<b>          'EXT. COLEMAN RESIDENCE - DAY\n</b>\n          Max is playing basketball in the driveway, but the ball's too big\n          for her and the hoop's too.high. Every time she tries to shoot,\n          the ball falls short and BANGS against the house.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          5.\n</b>          Kate opens-the door, angrily signing as she speaks:\n          Stop banging that against the house!\n          I'm trying-to work!.\n\n<b>          MAX\n</b>\n<b>          SORRY.\n</b>          Max gives an abashed look. Kate sighs. She knows she was too\n          harsh with her.\n\n<b>          KATE\n</b>          -No, I'm sorry.. But just... take a\n          break for a little while, okay?\n          Max nods. Kate goes. back inside.\n          A CAR pulls into the-drive.. It's John and eleven--year-old-DANIEL,\n          Rate and John's other child. Daniel's blonde, brash, and-cocky,\n          the all-American kid. He's wearing.a Little League uniform.\n          Daniel runs toward Max. He steals her ball and dribbles-it around\n          her in circles. -Max watches glumly. He offers her the ball, but\n          when she reaches for it, he snatches it away and shoots a lay--up..-\n\n<b>          DANIEL\n</b>          Boo -yahl He shoots! He scores!\n\n<b>           \n</b>\n<b>          JOHN\n</b>          Nice one, champ! -\n          Daniel pumps his arm and runs inside. John walks up the drive,\n          carrying a bouquet of FLOWERS. He hands Max the ball and lifts\n          her up to the basket. Max happily puts the ball-through'the hoop.\n\n<b>          JOHN\n</b>          All right! Ginme five!\n          She smiles and gives him a high-five as he carries her inside.\n\n<b>          YN'. MUSIC ROOM - DAY -\n</b>          Kate has just sat back down at the piano when she hears Daniel\n          tear into the house and run upstairs. She slumps her shoulders\n          and closes her notebook. No more work today. John enters.\n\n<b>          JOHN\n</b>          Drapes look'nice.\n\n<b>          KATE\n</b>          Curtains.\n          (off his.look)\n          They're curtains, not drapes. And haw\n          exciting is my life that -I now know the\n          difference.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          6.\n</b>          He offers her the flowers..\n\n<b>          RATE\n</b>          .That's this for?\n\n<b>          JOHN\n</b>          Just love you.  \n          He kisses her as she takes them. Some of her gloomy mood melts.\n\n<b>          INT. MAX'S BEDROOM -- NIGHT\n</b>\n          Kate tucks Max into bed.\n\n<b>          MAX\n</b>\n<b>          READ ME A STORY?\n</b>\n<b>          KATE\n</b>          Ore story. Then bedtime. Okay?\n          Max nods. happily and picks up a book from her nightstand. Kate\n          groans inwardly when she sees what it is. It'.s called. \"We were\n          Going To Have A Baby, .But We Had An Angel Instead.\"\n\n<b>          KATE\n</b>          You want to hear about the baby again?\n          Max nods. Kate hesitates, then gives Max a sad smile.\n\n<b>          INT. MAX'S BEDROOM - HIGHT (TIMECUT)\n</b>\n          Kate sits on Max's bed, reading and showing her the pictures:\n\n<b>          KATE\n</b>          \"People send us flowers and cards, but\n          we still miss our baby. If this just\n          happened to you, I'm sorry you got an\n          angel instead of a'baby. I.think a\n          baby would have been more fun.\"\n          The last picture is a FAMILY WITH A BABY ANGEL watching over them.\n\n<b>          MAX\n</b>\n<b>          IS BABY JESSIE AN ANGEL?\n</b>\n<b>          KATE\n</b>          Yes, she is. She's with us every day.\n          Kate gives Max a gentle kiss on the forehead.\n\n<b>          INT. KATE AND JOHN'S BATHROOM - NIGHT\n</b>\n          Kate opens a medicine chest 'and shakes a PILL from a prescription\n          bottle. She swallows the pill-with a Dixie cup of water.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          7.\n</b>\n<b>          INT. XATB AND JOHN'S BEDROOM - NIGHT\n</b>\n          John watches TV in bed. Kate enters from the bathroom in a\n          nightshirt and sits on the bed. She.rubs lotion on her feet.\n          John watches her, then reaches out, runs his fingers uup and down\n          her back. Kate freezes. He can't see the-nervous look that\n          crosses her face. He moves closer, pushes her hair aside, kissing\n          hex-. neck. Kate responds stiffly, trying to get. in the mood.\n          He slides a hand around her waist, moves it up to her breast...\n\n<b>          KATE\n</b>          I'm sorry. I can't. Shit...\n          She moves away, tears suddenly in.her eyes. He gives a concerned\n          look, lets her have her space. A beat.\n\n<b>            KATE\n</b>          I'm so sick of feeling like this.\n          Christ, the kids must thing I'm crazy.\n\n<b>          JOHN\n</b>          Will you stop worrying about what\n          everybody else thinks?\n\n<b>          KATE\n</b>          How can I? I saw a pregnant woman\n          today on the way home and I almost lost\n          it. Just burst into tears with Max\n          sitting right there. Daniel barely\n          talks to me. You and I haven't had sex\n          in over a year now. What if I.never\n          get better? I don't want to lose you.\n\n<b>          JOHN\n</b>          You're never going to lose us. I\n          promise you. I just wish...\n          (off her look)\n          Have you thought any more about\n          adopting?\n\n<b>          KATE\n</b>          I can't even be a mother to the\n          children we already have.\n\n<b>          JOHN\n</b>          That's not true. The kids understand.\n          They just know you're not happy.\n\n<b>          KATE  \n</b>          But I should be.\n\n<b>          JOHN -\n</b>          Do you want another child?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          B.\n</b>\n<b>          KATE\n</b>          You Snow I do. More than anything.\n\n<b>          JOHN\n</b>          Even if it can-'t be'biologically ours.\n\n<b>          KATE-\n</b>\n<b>          YES\n</b>\n<b>          JOHN\n</b>          Then what are we talking about this\n          -for? Let's do it.\n\n<b>          KATE\n</b>          You-don't just adopt a child because\n          you're lonely and depressed.\n\n<b>          JOHN\n</b>          That's not why we'd be doing..it. We\n          wanted a child a year ago and we still\n          want one, now..\n\n<b>          KATE\n</b>          We can't replace our baby.\n\n<b>          JOHN\n</b>          No, 'we can't. But we can take the'\n          place we made for her in our hearts and\n          our home and give it to a child who\n          needs a family.\n\n<b>          (BEAT)\n</b>          Kate, we love being parents. We're\n          good at it and'it makes. us happy. What\n          better reason-do you want?\n          Kate looks at him for a beat, then smiles and lets her tears fall.\n\n<b>          INT.-LAWYER'S OFFICE -- DAY\n</b>\n          Kate and John are being interviewed by a FEMALE LAWYER.\n\n<b>          LAWYER -\n</b>          Are you both employed?\n\n<b>          JOHN\n</b>          I'm-an architect at a firm in the city.\n          The Lawyer turns to Kate. Kate hesitates.\n\n<b>          KATE\n</b>          I used to teach music at Yale. I\n          haven't worked for about a year.\n\n<b>          LAWYER -\n</b>          (a beat, considering)\n           You're sure you want an older child? - -\n\n<b>          (MORE) - - -\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          9.\n</b>\n<b>          LAWYER (CONT'D)\n</b>          With your background, you could have a\n          newborn in as little as a year.\n\n<b>          JOHN\n</b>          We've'alread y waited a.long time. :We'd\n          lake a child as:quickly as possible.\n\n<b>          LAWYER..\n</b>          Well, 'getting an older child-As\n          definitely quicker, not to mention\n          cheaper, but- there's a reason for that.\n          A lbt of these kids- have serious\n          behavioral problems.'\n\n<b>            JOHN\n</b>          We've already signed up for special-\n          needs-'adoption classes. Trust me,\n          we're ready for anything.  \n\n<b>          LAWYER\n</b>          You must have a lot of love to give.\n          Are you looking for a boy or a girl?\n\n<b>          RATE\n</b>\n<b>          (SMILES)\n</b>          A girl. We'd like a little girl.- - -\n\n<b>          EXT. RURAL HIGHWAY - AERIAL SHOT -- DAY\n</b>\n          CAMERA FINDS John's car winding its way along a tree-lined road... }\n\n<b>          INT. JOHN'S CAR - DAY\n</b>\n          John is driving. Kate is studying pages and pages of photocopied\n          records in a manila folder. -John gives her an amused look.\n\n<b>          KATE\n</b>          You're not worried about being\n          prepared?\n\n<b>          JOHN -\n</b>          There's not gonna be a pop quiz.\n          Kate smiles. She closes the folder and looks at a Polaroid of a\n          happy, seven-year-old Puerto Rican girl stapled to the cover. The\n          name next to the photo is YOLANDA.\n\n<b>          EXT. HOME FOR GIRLS - ESTABLISHING - DAY -\n</b>\n          It's a pillared mansion with a large porch. TWO NUNS supervise a'\n          GROUP OF YOUNG GIRLS on a playground.- A sign- out front reads \"ST.\n          CABRINI'S HOME FOR GIRLS.\" John's car pulls into the parking lot. \n          From-2L SHAKY, HANDHELD POV looking out a second floor window, we\n          see Kate and John get out of the'car. Someone in watching them...\n          Kate senses movement and looks up... but there's no one there.\n          ..y\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          10.\n</b>\n<b>          INT. HOME FOR GIRLS - PLAYROOM - DAY\n</b>\n          Yolanda; the girl from the Polaroid, is playing with a dollhouse.\n          The door-opens. Kate and John are led inside by SISTER ABIGAIL,\n          an African-American nun in her 50's.\n\n<b>          SISTER ABIGAIL\n</b>          Yolanda, look who's here to see you.\n          Yolanda, smiles at Kate and John.. She runs over to greet them, but\n          stands just out of their reach. -Kate kneels in front of her.\n\n<b>          RATE\n</b>          Don't you look pretty!\n\n<b>          YOLANDA\n</b>          6ister Abigail put ribbons in my hair.\n          See?\n\n<b>          KATE\n</b>          Wow, that was nice of her. Look, we\n          brought you something for the trip\n          tomorrow.\n          She hands her a bag of activity books and a \"Travel Turtle,\" a kid-\n          sized lap desk for coloring in the car_ Yolanda's face lights up.\n\n<b>          SISTER ABIGAIL\n</b>          What do you.say?\n\n<b>          YOLANDA\n</b>          Thank you.\n          Kate reaches out to her, but Yolanda pulls-away, focusing all her\n          attention on her presents. Rate gives her a sad 'smile.\n\n<b>          IT. HOME FOR GIRLS - PLAYROOM -- DAY (TIMECUT)\n</b>          Yolanda is drawing a picture, \"Travel Turtle\" on her lap. Kate\n          and Abigail sit nearby, watching. Kate seems worried. Abigail\n          notices. She speaks in a low voice so Yolanda won't hear:\n\n<b>          SISTER ABIGAIL\n</b>          Nervous?\n\n<b>          KATE\n</b>          Yeah. And happy. And excited. : And\n          proud. And scared shitless. It' s\n          funny. All the same feelings I had\n          when I was pregnant with our others.\n\n<b>          .SISTER ABIGAIL\n</b>          That's what really worries you, isn't\n          it? Something bad happened, the last\n          time you felt this way.\n          (off Kate's look)\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          SISTER ABIGAIL .CONT'D)\n</b>          Yolanda's doing something similar.\n          She's afraid of :getting hurt again,.\n          .too. Bit I have a-good feeling'about\n          you two. You can help. each other heal.\n          And you're lucky. You have a wonderful\n          husband who can be there for you both.\n           A flicker crosses Rate's eyes at the mention of het \"wonderful\n           husband.\" Doubt? uncertainty? Abigail.do'esn't see it.\n          I h T. HOME FOR GIRLS - CORRIDOR - DAY\n          'John emerges frcaitthe HEN'S ROOM. The walls of the hallway are\n          lined -with Children's-artwork. He glances at it as he walks by.\n          Suddenly, he stops short. Amidst the crude watercolors and\n          _macaroni mosaics are several beautiful ain s, s'% surprisingly\n          sophisticated, more Like the works of Henri 'R usseahan the\n          o crayon-and-stick-figure scribbles surrounding them.\n          Then he hears something: a LITTLE GIRL'S VOICE, softly HUN= G a\n          tune. We know the words. When I was juuust a lii.ittle yiiir., I\n          asked my mother, what will I be?...\n\n<b>          M. HOM13 OR GIRLS - ART ROOM - DAY\n</b>          .John follows the HUMMING to a stark, white room. Light slants in\n          from a big-window, shining on A LITTLE GIRL in a lacy white dress.\n          Her. back is to us, so.we can't see her face, just curls of\n          platinum blonde hair spilling to her shoulders. She sits at an\n          easel, all alone, painting another extraordinary picture.\n          John watches, curious. Suddenly; she senses his presence. She-\n          stops humming, the paintbrush freezes mid-stroke. She turns.\n          She looks about eight years old, with pale skin and-bright, doe-\n          like eyes, her delicate features framed by Shirley Temple curls.\n          It's the face- of a porcelain angel, a perfect little laving doll,\n          friendly and inviting. She wears a thick black velvet ribbon\n          around her neck and one around each wrist. Her'name is ESTHER.\n\n<b>          JOHN\n</b>          Hi there.\n\n<b>           ESTHER\n</b>          Hello. -\n          She speaks with a strange accent. Sounds Eastern European.\n\n<b>          JOHN\n</b>          Are these , paintings all yours?\n\n<b>          ESTH ER\n</b>          Yes. Do you like them?\n\n<b>          JOHN\n</b>          Very much. They're remarkable. -\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          12.\n</b>\n<b>          BSS\n</b>          h T ank :you. My name is Esther. What's\n          yours?\n\n<b>          JOHN\n</b>          John. It's nice to meet you.\n          She smiles and demurely offers her hand, giggling as he takes it.\n          She blushes, then turns back to her painting. It's a half-\n          finished jungle scene with a SMILING LION crouched beneath a tree.\n\n<b>          JOHN\n</b>          So what's this one going to bo? \n\n<b>          ESTHER\n</b>          My paintings are stories that come from\n          my imagination. -This one'-s about a'sad\n          mother lion who can't find her cube.\n\n<b>          JOHN\n</b>          She's smiling.\n\n<b>          ESTHER\n</b>          She's dreaming about her babies. It's\n          the only thing that makes her happy.\n\n<b>          JOHN\n</b>          Well, I hope she finds them.\n\n<b>          ESTHER\n</b>          She will. I,bok.\n          As she speaks, Esther dabs her brush and paints little lion cubs\n          curled up in front of their sleeping mother:\n\n<b>          ESTHER\n</b>          They were lost'in the jungle 'and they\n          were so scared because they didn't'have\n          a mother or father. But just when they\n          thought they'd be alone forever, they\n          found their mother sleeping under this\n          tree. And they felt so safe that they\n          fell asleep too. Now when-the mother\n          lion wakes up, her dream will have come\n          true. She has her family again.\n\n<b>          JOHN\n</b>          Where did you learn how to do this?\n\n<b>          ESTHER\n</b>           Y've just had lots of time to practice,\n          I guess. It's so boring here.\n\n<b>          JOAN\n</b>          You don't play outside with the other\n          girls? Sounds like they're having fun.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          13.\n</b>\n<b>          ESTHER\n</b>          I like staying inside. That way I\n          don't get my clothes dirty.\n\n<b>          JOHN\n</b>          (amused) -\n          Well, that's very responsible of you,\n          but I'll- bet the sisters could find\n          something else for you. to wear.\n\n<b>          ESTEER\n</b>          You.don't like my dress? - Don't you\n          think it's pretty? -\n\n<b>          JOHN\n</b>          Your dress is. very pretty. I'm ,just\n          saying. you could -probably go outside if\n          you really wanted to.\n\n<b>          - ESTHER\n</b>          (a beat, hesitant)\n          I don't like laying with the other\n          .girls. I'm different from everyone.\n\n<b>          JOHN\n</b>          There's nothing wrong with different.\n\n<b>          ESTHER\n</b>          Yes, there is. Everybody says there's\n          not, but it isn't true. I don't care.\n          If I'm sad or lonely, I just come in\n          here a nd paint a story with a happy\n          endingg And when people say they like.\n          my paintings, it makes me feel better.\n          (off his look)\n          I think.peo le should always try to\n          take the bad things that happen to them\n          and turn them into something good.\n          Don't you?\n          John is taken aback. Who j t1m1s )dc? Before he can respond:\n\n<b>          .- RATE (O.S.)\n</b>          There you are.\n          Rate and Sister Abigail stand in the doorway. John waves for Kate\n          to enter and Esther sits up eagerly when she does. Abigail's\n          expression darkens when she sees who John has been talking to.\n\n<b>          JOHN\n</b>          Hey, I'd like you to meet someone. -\n          (to Esther).\n          Esther, this is my wife, Kate.\n          Kate smiles and offers her hand, but instead of shaking it, Esther\n          lovingly presses it to her cheek.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          14. -\n</b>\n<b>          ESTIIR -\n</b>          Motta...\n          Kate'and John exchange a beumsed look'.\n\n<b>          JOHN\n</b>          She painted these all by herself.\n\n<b>          ' RATE\n</b>          Wow, you're quite the little-artist.\n\n<b>          ESTHE'R\n</b>          Thank you. You smell nice.\n          Kate laughs. Sister Abigail shifts uncomfortably.\n\n<b>          ESTHER\n</b>          Would you like me to paint you a\n          picture? You can watch me if-you want.\n          I'm normally a little shy, but --\n\n<b>          SISTER ABIGAIL'\n</b>          Esther, I'm sorry, they don't have time\n          for you to paint them a picture.\n          (off Esther's look)\n          They have to come with me now.\n          Yolanda's going home with them\n          tomorrow. isn't that wonderful?\n          Esther wilts. She releases Rate's hand and musters a weak smile.\n\n<b>          ESTHER\n</b>          Yes. I'm sure she'll be very happy.\n\n<b>          KATE\n</b>          It was nice meeting you.\n\n<b>          ESTHER -\n</b>          The pleasure was mine.\n\n<b>          JOHN\n</b>          (to Sister Abigail)\n          You've got a real talent on your hands\n          here.\n\n<b>          SISTER ABIGAIL\n</b>          Yes, we're very lucky to have her.\n          But there's something -strange-in Abigail's voice -- she definitely\n          doesn't un -lucky. Esther watches them go.\n\n<b>          INT. HOME FOR GIRLS - ENTRY - DAY\n</b>\n          Sister Abigail walks Kate and John to the front door.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          I5.\n</b>\n<b>          SISTER ABIGAIL\n</b>          The notary will be here at.ten for-you-\n          to sign the placement agreement.\n\n<b>          KATE\n</b>          Thank you so much for all your help.\n          Kate gives her a warm hug. But mid-embrace, she notices\n          something: Esther is at the end of the hallway, peering at them\n          from around a corner. Abigail and John see--her,' too.\n\n<b>          KATE\n</b>          What did she say to me.back there? It\n          sounded like... \"motta?\"\n\n<b>          SISTER ABIGAIL\n</b>          It's Russian. It means \"mother.\"\n          INT.JoHN'S CAR - NIGHT\n          John whistles \"Whatever Will Be, Will Be\" to himself as he drives.\n          Kate gives him an amused look, then Jokingly sings along:\n\n<b>          KATE -\n</b>          When you were juuust a liuittle\n\n<b>          JOHN\n</b>          Sorry, I've got that stuck in my head\n          now.\n\n<b>          KATE\n</b>          She. made quite an impression on.you.\n\n<b>          JOHN\n</b>          I wish you co'uld've heard the things.\n          she was saying before you c&amp;me in. I\n          Jatow adults who aren't that mature.\n\n<b>          (BEAT)\n</b>          I wonder' why they didn't show us her\n          case file.\n\n<b>          KATE\n</b>          She probably wasn't there when we were\n          first ,looking.\n\n<b>          JOHN\n</b>          It just blows may mind, a kid could go\n          through as much-as she must have and\n          still turn out like that.\n\n<b>          KATE\n</b>          You sound like you're sorry we're not\n          adopting her instead of Yolanda.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          16.\n</b>\n<b>          JOHN\n</b>          No, of course not. I just hope she.\n          gets the right break.\n          (off her look)\n          I wouldn't trade our littl'e' girl for\n          the world. You )maw that.\n          Rate gives him an adoring look and squeezes his hand.\n\n<b>          EXT. HOME FOR GIRLS - ESTABLISHING - MORNING .\n</b>\n          The sun is just rising,.warming the sky with an idyllic light.\n\n<b>          INT. HOME FOR GIRLS - DORMITORY.- MORNING\n</b>\n          The GIRLS (5-7) are busily getting dressed and making their beds.\n          The HOUSEMOTHER inspects each of-them in turn. One bed remains\n          unmade, its occupant missing. The Housemother turns to the room,\n          ready to give a scolding, but can't find who she's looking for:\n\n<b>          HOUSEMOTHER\n</b>          Where's Yolanda?\n\n<b>          INT. HOME FOR GIRLS - WASHROOM - MORNING\n</b>\n          The OLDER GIRLS (8-12) are-brushing their teeth and washing up.\n          The Housemother enters and looks around.\n\n<b>          HOUSEMOTHER\n</b>          Have any of you seen-Yolanda?\n          Nobody has.\n\n<b>          INT. HOME FOR GIRLS -- VARIOUS - MORNING\n</b>\n          Sister Abigail leads the NUNS and LAY ASSISTANTS in a search of\n          the home, looking for Yolanda. The playroom, art room, chapel,\n          classrooms, laundry room, rest rooms.-- they're all empty.\n\n<b>          INT. HOME FOR GIRLS - BASEMENT - MORNING\n</b>\n          A young-nun, SISTER JUDITH, walks downstairs into -a dark storage-\n          area. Lots of hiding places. -\n\n<b>          SISTER JUDITH\n</b>          Yolanda? Are you hiding-down here?\n          Then she notices a closet behind her. The door. is ajar. She\n          reaches out, opens it... and nearly gags at what she sees inside.\n\n<b>          LOW ANGIL - INSIDE THE CLOSET\n</b>           A child's bare feet dangle in mi , , a .,im3. The \"Travel Turtle\" is on\n          the floor beneath them. - A chair lies on its side nearby.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          17.\n</b>\n<b>          INT. HOTEL ROOM -- MORNING -\n</b>\n          Kate dries her' hair in the bathroom. The PHONE RINGS O.S. She\n          pauses, suddenly concerned for some reason. She opens the door.\n          As John reaches for-the phone, CAMERA MOVES IN on Kate. She\n          watches from the doorway, her  face already registering dread. She\n          knows. Even before he answers the phone, somehow she knows.\n\n<b>          JOHN (0,S-)\n</b>          Bello?\n\n<b>          EXT. HOTEL ROOM BALCONY - DAY\n</b>\n          The sky has turned gray. Kate stares out at the hotel parking-\n          lot, smoking a cigarette.  - Her eyes are red;- but she's long since\n          cried-herself out. John stands by the open-sliding glass door.\n\n<b>          JOHN\n</b>          .The birth family is claiming her body.\n          They're planning a private service.\n          He looks to Kate for a reaction, but she has none. He continues:\n\n<b>          JOHN\n</b>          Sister Abigail thinks she might have\n          been playing something called \"The\n          Choking Game.\" It's a kind of\n          schoolyard dare. You try to get a rush\n          by having someone choke you until you\n          almost pass out. There have been cases\n          where kids have tried it alone and\n          accidentally hanged themselves.\n          A beat. Kate's voice is distant, as;\n\n<b>          KATE\n</b>          So that's it? She just vanishes from\n          our lives?\n\n<b>          JOHN\n</b>          We can have our awn-service. I think\n          .it's important that we -\n\n<b>          KATE\n</b>          I've been' in grief counseling for\n          almost a year-and-a-half.. If you say\n          the word \"closure,.\" I'm going to-claw\n          your eyes out.\n          She's not angry, just matter-of-fact. Be wants to say something,\n          but holds his tongue. Silence hangs heavy between them.\n\n<b>          KATE\n</b>          Maybe we're not supposed.to do this.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          18.\n</b>\n<b>          - JOHN..\n</b>          No. Don't say that. -\n\n<b>          RATE- -\n</b>          we -try to .have a baby and I have a\n          'third-trimester miscarriage that leaves.\n          me sterile. 'We try to adopt and she\n          dies the night before we bring her\n          home. That doesn't sound like'\n          somebody's trying to tell us. something?\n\n<b>          JOHN   -\n</b>          Yolanda didn' t the to.teach us a\n          lesson.. We didn't make this-happen.\n\n<b>          KATE '\n</b>          It doesn't make.anndifference. I\n          can't go through this again.\n\n<b>          JOHN\n</b>          so let's not. Let's adopt.Bather.\n          This brings Kate back to reality. She eyes him coolly.\n\n<b>          KATE\n</b>          Her body's barely cold and you're\n          already thinking about replacing her?\n\n<b>          JOHN .\n</b>          We can't replace Yolanda any more than\n          We can replace Jessie. But we can't\n          help her anymore, either. Esther is\n          alive and needs a family. Right now.\n\n<b>          KATE\n</b>          We have to at least wait until.--\n\n<b>          JOHN\n</b>          -Until what? I don't want to waste\n          .a nother year of our lives wishing for\n          something that we.can't-have.\n          (beat).\n          I want us to feel like a family again.\n          Kate regards him for a beat, conflicted. Then:\n\n<b>          KATE\n</b>          Let's see what Sister Abigail thinks.\n\n<b>          INT. HOME FOR GIRLS - SISTER ABIGAIL'S OFFICE - DAY -\n</b>\n          Sister Abigail hands Rate and John a folder with a Polaroid of\n          Esther stapled to it. Her- case file.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          19.\n</b>\n<b>          SISTER ABIGAIL\n</b>          For the most -part, she's an'ideal\n          child. She's originally from Russia,\n          but her English is flawless, Smart as\n          a.tvhip and very mature Â°for her age. I\n          don't think I've-ever had to tell her\n          .anything-twice and I've never had to\n          clean-up after her.. She's a bit of a-\n          nQat-freak.\n\n<b>          JOHN\n</b>          I think we can handle that.\n\n<b>          SISTER.ABIGAIL\n</b>          She's also fiercely independent.,\n          Whatever the other-children want to do,\n          she wants to.dc the opposite.\n\n<b>          JOHN\n</b>          She told me they make fun of her.\n\n<b>          SISTER ABIGAIL\n</b>          I'm sure they do, but she doesn't make-\n          things any easier on herself. She just\n          doesn't seem interested in friends..\n          She doesn't even play like a normal\n          child. She just reads and paints.\n          Most of the time she barely-speaks.\n\n<b>            KATE  \n</b>          Why do'you think that is?\n\n<b>          SISTER ABIGAIL .\n</b>          Well, like most of the girls here,\n          there's been no shortage of hardship in\n          her life.- She's been orphaned twice--\n          her birthmother died of AIDS, then the\n          American family who adopted her was-\n          killed in.a house fire. And I strongly\n          suspect that she's been sexually abused\n          as well.\n\n<b>          KATE\n</b>          By who?\n\n<b>          SISTER ABIGAIL\n</b>          I don't know. There's nothing in her\n          -history, but that doesn't necessarily\n          mean anything. Russian adoption -\n          records. are notoriously unreliable.\n\n<b>          JOHN\n</b>          Then what are you basing this on?\n          Sister Abigail hesitates. Deciding how much to say.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          20.\n</b>\n<b>          SISTER ABIGAIL\n</b>          I wish I knew. There's just something\n          missing with her. A-spark you see in a\n          child's eyes that isn't there. I've\n          only seen that-before in cases where\n          the child had been severely\n          traumatized. It might also explain -\n          some of her idiosyncratic behaviors.\n\n<b>          JOHN\n</b>          Like what?\n\n<b>          SISTER ABIGAIL\n</b>          She refuses to shower or change clothes\n          with the other girls.' She won't even\n          allow the housemother in-the bathroom\n          with her. She.'.s also very concerned\n          with her physical appearance for her\n          age. She's like a teenager getting\n          ready for a date every morning. She\n          insists on wearing dresses-every day.\n          The ribbons around her wrists and neck\n          stay on day and night. . The only\n          trouble we ever had with her was when\n          we tried to take them off. She kicked\n          two of Sister Francis' teeth-out.\n          Kate and Tohn are taken. aback. Abigail sighs.\n\n<b>          SISTER ABIGAIL\n</b>          I'm sorry. I'm 'not trying to\n          discourage you. If you're serious,\n          I'll do everything I can to-expedite\n          the process, given the circumstances.\n\n<b>          (BEAT)\n</b>          My one reservation is..this. When-an\n          adoption fails, it's usually because\n          the parents didn't know what to expect.\n          -And'in this case, I can't' tell you what\n          to expect because the plain fact of the-\n          matter is that-I don't knaw.\n\n<b>          INT: HOME FOR GIRLS - CHAPEL DAY\n</b>          Esther is happily-helping a NUN clean the sanctuary. Kate and\n          John sit in a pew near the back of the empty chapel.\n\n<b>          KATE\n</b>          She really did open up with us, didn't\n          she?\n\n<b>          JOHN\n</b>          She latched. right onto you. We're\n          probably the best chance she has at a.\n          normal life.\n          Esther looks up from her work and waves at them. They wave back.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          21.\n</b>\n<b>          KATE\n</b>          A normal life..' That sounds really\n          good,',doesn't it? -\n          She smiles. and takes John- .'s hand.\n\n<b>          EXT. HOME FOR GIRLS - DAY.\n</b>\n          CAXERA FOLLOWS Esther's feet, saddle shoes CLICKING on -the walk.\n          Kate walks beside her, holding her hand. In Esther's free hand,\n          she clutches a DOG-EARED BIBLE held together with a rubber band.\n          Activity on the playground stops as the girls watch Esther leave.\n          None of them look sorry to see her go. She ignores them.\n          John puts.Esther's things ---- a small suitcase and her-paintings\n          in the trunk of the car.. Sister-Abigail sees them off.-\n\n<b>          SISTER ABIGAIL\n</b>          If you ever need anything, please don't\n          hesitate to call.\n          Before Kate. can respond, Esther tugs on her arm.\n\n<b>          _ESTHER\n</b>          Come on! Let's-go)\n          Kate laughingly lets Esther drag her away.\n\n<b>          RATE\n</b>          (to Abigail)\n          We wills\n          Sister Abigail happily watches them go.. Rate and Esther smile and\n          wave goodbye.' She'waves back... but once the car pulls out, her\n          smile fades. She seems'vaguely troubled as they drive away...\n\n<b>          INT./EXT. JOHN'S CAR - DAY\n</b>\n          Headed for home. Kate is showing Esther some SIGN LANGUAGE.\n          Esther makes the sign for each letter as she says it aloud:\n\n<b>          ESTHER\n</b>\n<b>          E-S-T-\n</b>\n<b>          KATE\n</b>          Put your thumb here.\n          She makes the sign for 'T.\" Esther. sees her mistake, corrects it.\n\n<b>          ESTHER\n</b>          T-H-E-R.' E-S-T-H-E-R. Esther.\n\n<b>          RATE\n</b>          Perfect l\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          22.\n</b>          Esther smiles and practices=it a few times.- Outside, the LEAVES\n          have turned color. Esther gazes out in-wonder. -\n\n<b>          ESTHER\n</b>          It's so beautiful, motta.\n\n<b>          KATE\n</b>          Sweetie, here we say \"Mont\" or. \"mommy.\"\n\n<b>          ESTHER\n</b>          Kate and John exchange-a warm look.\n\n<b>          EXT. PRIVATE ROAD - DAY\n</b>\n          John's car turns at a GATE and drives down the road leading-to\n          their private community. The secluded road winds through the\n          forest and crosses the little BROOK we saw earlier.\n\n<b>          EXT. NEIGHBORBOOD' - DAY\n</b>\n          The Coleman's neighborhood 3.s surrounded by forest,-an upscale\n          community of big houses and manicured lawns. A POSTMAN delivers\n          the mail. A HISPANIC NANNY pushes a BABY in a stroller.\n          GARDENERS tend someone's flowers. Esther\n          -soaks it all in.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY\n</b>\n          They pull into the driveway and get out. Esther's mouth\n          practically hangs open at the sight of their beautiful house.\n          The front door opens and Max runs out to meet them. Daniel\n          appears in the doorway-with DORIS COLEMAN (arid-60's), their\n          grandmother. Daniel stands aghast at the sight of the strange,\n          pale girl with the Goldilocks curls and frilly white dress.\n\n<b>          DANIEL\n</b>\n<b>          (SOFTLY)\n</b>          -Holy shit:..\n          Max. runs straight into Kate's arms and gets a big hug.\n\n<b>          KATE\n</b>          Oh, we missed you so muchll\n          Kate gives Max a kiss, then turns to Esther: Max hangs back, a\n          little shy. Esther signs' to Max without speaking: -\n\n<b>          ESTHER\n</b>\n<b>          HELLO, MAX. MY NAME IS ESTHER.\n</b>          Max gives Kate an excited smile.\n\n<b>          KATE\n</b>          She's been practicing the whole way.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          23.\n</b>          Kate takes the girls' hands and they all walk up'to the house.\n          Esther notices Man's hearing aid.\n\n<b>          EST-HER -\n</b>          What's that?\n\n<b>          KATE .\n</b>          That's a hearing aid. It helps her\n          hear.a little so she can read lips.\n          John gives Doris a Use on the cheek.\n\n<b>          JOHN\n</b>          Hi, Mont. Thanks for watching them.\n          (to Esther)\n          Esther, this is Grandma Doris.\n\n<b>          ESTSER\n</b>          A pleasure to meet you.\n          Esther surprises everyone by giving her a perfect ltttle rtse\n          Daniel fails to suppress a laugh. Kate silences him with a look.\n\n<b>          DORIS\n</b>          How precious! It's a pleasure-to meet\n          you, too.\n\n<b>          JUN\n</b>            (to Esther)\n          And this is our son, Daniel.\n          Esther smiles and puts out her hand. Daniel grudgingly takes it.\n\n<b>          ESTHER\n</b>          Hello, Daniel.\n\n<b>          DANIEL\n</b>          Hey.\n\n<b>          INT. COLEMAN RESIDENCE - VARIOUS - DAY\n</b>\n          Esther walks from room to room, in awe of her luxurious new home.\n          Kate and the rest of the family follow her.\n\n<b>          ESTHER\n</b>          Everything's so bigi\n          As Esther moves on to the next room, Daniel hangs back and\n          whispers to John, too loud:\n\n<b>          DANIEL\n</b>          Why is she dressed like that?\n\n<b>          JOHN\n</b>          Don't be rude.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          24.\n</b>          Esther overhears them, but pretends she didn't. Kate sees this-\n          and tries to distract her. -\n\n<b>          KATE\n</b>          Would you like to see-your room?\n          Esther smiles and nods eagerly. But on the way up the stairs, she\n          eyes Daniel furtively, sizing him up...\n\n<b>          INT. ESTHER'S BEDROOM - DAY\n</b>\n          Kate pushes the door open and Esther enters. We recognize the\n          room by the arched windows -- this used to be the-nursery.- It's\n          been completely made over as a little girl's room, complete with a\n          lacy white canopy bed covered with a mountain of STUFFED ANIMALS..\n          Esther turns to Kate and John with a toothpaste-commercial smile.\n\n<b>          ESTHER\n</b>          It's perfect.\n\n<b>          INT. ESTHER'S BEDROOM - NIGHT\n</b>\n          Esther is in bed, wearing a nightgown. Kate and John tuck her in.\n\n<b>          ESTHER\n</b>          I love.you, motta -- I mean, Monmiy.\n\n<b>          KATE\n</b>          I love you, too, sweetie.\n          She kisses Esther on the forehead. John leans in for a kiss and\n          Esther,hugs -him tight. Then he and Kate turn out the light and\n          close the door. Esther watches them go...-\n\n<b>          INT. UPSTAIRS HALLWAY - NIGHT\n</b>\n          Kate and John walk to their room, arms lovingly around each other.\n          They close their door, leaving the hallway empty and dark. Then:\n          CAMERA SLOWLY MOVES back down the hall toward.the closed door of\n          Esther's_room, PUSHING IN'on the doorknob, lingering there fora\n          long beat... Then we hear the lock CLICK shut.\n\n<b>          EXT. NEIGHBORHOOD - ESTABLISHING -- MORNING\n</b>\n          JOGGERS. PAPERBOY. Lawn sprinklers. KIDS running and -riding\n          bicycles. Saturday in the suburbs.\n\n<b>          INT. KITCHEN - MORNING '\n</b>\n          Esther and Max eat breakfast at the table while rate pours their\n          juice. Daniel tears through wearing a soccer iuniform.\n\n<b>          KATE\n</b>          Good luck II I love you II\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          25.\n</b>\n<b>          DANIEL\n</b>          Love you, tools\n          John follows Daniel, kissing Kate on his way out.'\n\n<b>          KATE\n</b>          Remember, it's only a game.\n\n<b>          JORN\n</b>          I'm a fan. Fans yell. _.I'll call to  \n          let you know who won.\n\n<b>          INT. ESTHER'S BEDROOM - DAY\n</b>\n          Kate and Esther are decorating. Esther pins up some of her  \n          paintings. Kate spreads out a selection of wallpaper borders.\n\n<b>          KATE\n</b>          Okay, which one do you like?\n\n<b>          ESTHER\n</b>          These are for a'younger child. Did you\n          pick them out for Yolanda?\n          Kate is taken aback. She stammers for a beat.\n\n<b>          KATE\n</b>          I'm sorry. I'll take them back and\n          pick some just for you.\n\n<b>          ESTHER\n</b>          It's all right. I rather like this\n          one.\n          Esther points out her.favorite and goes back to pinning up her\n          paintings. Kate sighs. As she rolls up the samples, she notices\n          the same Gothic mansion in several of Esther's older paintings.\n\n<b>          KATE\n</b>          '1s that a real place?\n\n<b>          ESTHER\n</b>          No. I just made it up. It's a haunted\n          castle where a beautiful- princess was\n          locked away. She waited so long and\n          was so sad that she filled the moat\n          with her tears, but then a handsome\n          prince swam ,across it and rescued her.\n\n<b>          (SMILES)\n</b>          I like happy ending's. Don't you?\n\n<b>          INS'. SHOPPING MALL - DAY\n</b>          Sliding doors open. Rate and the girls enter. Esther looks\n          around, dazzled by three stories of glass-ceilinged extravagance.\n          It's totally alien to her. -\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          26.\n</b>\n<b>          M. CLOTHING STORE - DAY \n</b>          Kate and the girls look through racks'. of children's clothes. Kate\n          pulls a pair'of jeans with. flowers embroidered on the pockets.\n\n<b>          KATE\n</b>          These are cute.\n\n<b>          ESTHER\n</b>          -Jeans are ugly.\n\n<b>          KATE\n</b>          But sweetie, you have to have something\n          you can play outside in.\n\n<b>          ESTHER\n</b>          That doesn't mean I have to look like a\n          boy.\n\n<b>          INT. SHOPPING MALL - DAY\n</b>\n          Kate leads the girls through the mall, carrying BAGS of purchases.\n          Something catches Esther's eye. She hangs back, distracted.\n          It's a pet store. ' In the display is an aguarium filled with\n          TROPICAL. FISH, their vibrant colors illuminated by a black light\n          in the tank. Esther gazes in, nose practically against the glass.\n\n<b>          RATE\n</b>          You like fish?\n\n<b>          ESTHER\n</b>          I like all beautiful things.\n          Kate taps Max's shoulder and signs to her.\n\n<b>          KATE\n</b>          You should show her Hodgepodge when we\n          get home.\n          Max nods eagerly. Esther givee.them a curious look.\n\n<b>          ESTHER\n</b>          Hodgepodge? What's that?\n\n<b>          INT. MAX'S 13EDROOM -- DAY\n</b>\n          HODGEPODGE is a hamster. Esther kneels in front of his cage for a\n          closer look. Kate stands behind her. Max beams proudly.\n\n<b>          KATE\n</b>          Max. takes care of him all bir herself.\n          It's her big girl responsibility.\n\n<b>          ESTHER\n</b>          Aaaww,-can I pet him?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          .27.\n</b>\n<b>          KATE\n</b>          Sure. But you have to promise not to-\n          let him out of his. cage .unless- Hcumey or\n          Daddy is,here to hold him.\n\n<b>          ESTEER\n</b>          Why? -\n\n<b>          KATE\n</b>          Because he's very delicate and you\n          could hurt him. Okay?\n          Esther xiods. Kate scoops.flodgepodge up and kneels between the\n          girls. Esther and Max share a  smile as they stroke his-fur.\n\n<b>          EXT. COLEMP RESIDENCE'- POOL -- DUSK\n</b>\n          A banner reading.\"WELCOME HOME, ESTHERII'\" has been hung. John\n          sprays LIGHTER rLUID on a charcoal grill and starts the fire.\n          Daniel watches attentively at his father's side.\n\n<b>          INT. KITCHEN - DUSK\n</b>\n          Kate and Doris prepare hamburgers and hot dogs for the barbecue.\n          They can see Esther and Max laughing and playing horseshoes in the\n          backyard, wearing NEW MATCHING SUNDRESSES.. Adorable;\n\n<b>          -DORIS\n</b>          They grow up fast, don't they?\n\n<b>          KATE\n</b>          Too fast.\n\n<b>          DORIS\n</b>          So what are your plans now?\n\n<b>          KATE\n</b>          Well, we'll get Esther settled, then\n          I'll probably go back, to work.\n\n<b>          DORIS\n</b>          Oh, so you think.they'll take you back?\n          Kate's eyes flicker with irritation.\n\n<b>          KATE\n</b>          I'm not talking about Yale. I'm going\n          to teach piano lessons from home.\n\n<b>          DORIS\n</b>          I see. That was such a good position\n          you had at Yale. It's a. shame.\n\n<b>          KATE\n</b>          I didn't quit because I wanted to. I\n          quit because.I couldn't work anymore.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          28.\n</b>\n<b>          DORIS\n</b>          I know. I'm 5o glad you're doing\n          better now.\n\n<b>          (BEAT)\n</b>          Bow's Maxine feeling?\n\n<b>          KATE\n</b>          She's fine.\n          Kate's pointedly not making eye contact with Doris now.\n\n<b>          DORIS\n</b>          Well, it's a shame that it took\n          something like that for you to :get\n          help, but I'm glad you did.\n          Kate takes. the plate of food and leaves without looking at her.\n\n<b>          EXT. COLEMAN RESIDENCE - POOL - NIGHT -\n</b>\n          Dinner's over. Daniel has changed into swim trunks and SPLASHES\n          around in the pool. Everyone else is gathered around Esther,\n          who's opening a few small presents. She unwraps a BOOK OF SIGN\n          LANGUAGE and gasps excitedly.\n\n<b>          ESTHER ,\n</b>          This is perfect! Thank you! Eiow do I\n          say \"thank you?\"\n          Kate shows her. Esther turns and makes the sign to Max.\n\n<b>          MAX\n</b>\n<b>          YOU'RE WELCOME.\n</b>          Behind them, Daniel climbs out of the pool and runs out to the end\n          of the diving board, poised to jump back in.-\n\n<b>          DANIEL,\n</b>          Dad! Watch this!\n          But John is focused on Esther.- She's opening a big present\n          la1aled \"FROMi DADDY.\" Daniel can't get his attention.\n\n<b>          DANIEL\n</b>          Dad! 'Dad!! Dad, look!!\n          John distractedly glances over his shoulder at him and Daniel does\n          a huge cannonball into the pool. SPLASH!\n          Suddenly, Esther squeals with glee. She's unwrapped an IIRT EASEL\n          and NEW PAINTING SUPPLIES. By the time Daniel-'s smiling face pops\n          out of the water, he's disappointed to find that Esther has drawn\n          John's attention again, barraging him with-hugs and kisses.\n          She looks at Daniel over John's shoulder and hticks her tongue out\n          at him. Daniel fumes.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          29.\n</b>\n<b>          INT. ESTHER'S BEDROOM -- NIGHT\n</b>\n          John walks behind Esther, his-hands over her eyes. Kate leads her\n          into the darkened roam by the hand.\n\n<b>          KATE\n</b>          Are you ready?\n          Esther nods excitedly. John uncovers her eyes. Esther stops\n          short in awe. It's the FISH TAN C from the shopping, mall.\n          Esther kneels before it, entranced. She turns the black light on\n          and off, marveling at- how it makes her dzess glow and the colors\n          in her paintings light- -up. She gives Kate and John a. big smile.\n\n<b>          INT. KATE AND JOHN'S BEDROOM - DAY\n</b>\n          Rate and John get dressed for church. John pulls on a tie. Kate\n          searches through a jewelry box. She's missing something.\n\n<b>          KATE\n</b>          nave-you seen my pearls?\n\n<b>          INT. CHURCH -- DAY\n</b>\n          Sunday morning in America. Kate and John sit with Doris and the\n          kids. -A.PRIEST reads-from the scripture and a SIGN LANGUAGE\n          II?TERPRETBR translates.\n          Esther follows along in her own Bible and Kate notices aphoto\n          poking from between its pages. All she can see is the face of a\n          RUGGED-LOOKING MAN in his 40's. She eyes it curiously...\n\n<b>          INT. MAX' S BEDROOM - DAY\n</b>\n          Kate is cleaning, picking Max's clothes up from off the.floor.\n          She sees something that gives her pause -- one of Max's STUFFED\n          ANIMALS has a STRING OF PEARLS hung around its neck.\n\n<b>          INT. FAMILY ROOM - DAY\n</b>\n          Esther and Max are playing a board game. Kate enters with the\n          pearls and shows them to Max. -  \n\n<b>          KATE\n</b>          Did you take this out of my jewelry\n          box?\n          Max shakes her head, confused.\n\n<b>          KATE\n</b>          Then-how did it get in your room?\n\n<b>          MAX\n</b>\n<b>          I DON'T KNOW.\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          30.\n</b>\n<b>          KATE\n</b>          Somebody put this around T.J.'s neck.\n          Who was it if it wasn't.you?\n          Max shrugs. She looks-nervous. Kate sighs.\n\n<b>          RATE\n</b>          Go take a time-out and think about it.\n\n<b>          ESTHER\n</b>          But we're playing]\n\n<b>          KATE\n</b>          She can finish your game later.\n          (to Max)\n          Come on.\n          Max pouts and follows Kate upstairs. Esther watches them go.\n\n<b>          INT. CLASSROOM - DAY\n</b>\n          Esther stands in front of a class full of KIDS. Their teacher,\n          MRS. GROSSE, is introducing her. Esther's wearing a pretty little\n          dress'and Shirley Temple curls, but her usually unflappable smile\n          seems wary, uncertain in the face of these staring third graders.\n\n<b>          MRS. CROSSE\n</b>          This is our new student. Her name is\n          Esther Coleman and I want you all to\n          make her feel very welcome today.\n          One of the kids, BRENDA, whispers. a wisecrack to a FRIEND. Esther\n          shifts uncomfortably.\n\n<b>          INT. CAFETERIA - DAY\n</b>\n          Esther sits at the end of the table where Brenda and her FRIENDS\n          are eating.. They eye her derisively. Esther ignores them- and\n          prays over her lunch. The other girls exchange amused looks.\n          Brenda folds her hands and makes an earnest, mocking face:\n\n<b>          BRENDA\n</b>          Dear Jesus, please help me to not dress\n          like such a freak tomorrow.\n          The girls laugh. Esther pays no attention.\n\n<b>          INT./EXT. TREEHOUSE - DAY\n</b>\n          Daniel and his friends AUSTIN and TREVOR run down a short path\n          through the woods behind.the Coleman's house to a tall tree.\n          CAMERA REVEALS an enclosed treehouse about ten feet up -This is'\n          no \"Little Rascals\" job -- this thing was professionally built.\n          They climb up to it. Inside, Daniel throws back a rug and pries\n          up a loose plank. Under it is a small STASH OF WEED. The other\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          31.\n</b>           boys open their 'video ina\" ine s, c\n          b o books, and an old a \"PLAYBOY'.' wï¿½h Cindy Crawford the c\n\n<b>          TREVOR\n</b>          Cindy Crawford? This- magazine's older\n          than we axe1 She's probably got Like\n          wrinkly-old grandma boobs Howl\n          They laugh. Daniel sparks up a joint. Suddenly:\n\n<b>          ESTHER (O.S.)\n</b>          Do you want to play?\n          The boys quickly waving the wke away. Esther and Max\n          are lo king up lat them\n\n<b>          O\n</b>\n<b>          DANIEL\n</b>          Get out of here! This is my treehouse.\n          Dad built it for mM.\n          Esther smiles, then leads Max away. The boys watch them go.\n\n<b>          AUSTIN\n</b>          Is your, like, whole family ietarded or\n          something?. -  \n          Trevor and Austin laugh. Daniel flushes, angry and embarrassed.\n\n<b>          INT. BATHROOM - NIGHT\n</b>\n          Kate finishes drawing a bath for Esther.\n\n<b>          KATE\n</b>          I think we should try this with the\n          door unlocked tonight. What do you\n          say?\n\n<b>          ESTHER\n</b>\n<b>          (PANICKED)\n</b>          What if someone comes in and sees me?\n\n<b>          KATE\n</b>          Nobody's'going to come in. I'll stand\n          right outside the door.\n\n<b>          ESTHER\n</b>          I could sing for you. At the home, I\n          used to sing so the sisters would know\n          I was all right. Please?\n          Esther's eyes are desperate, pleading.. Kate sighs.\n\n<b>          TNT. UPSTAIRS HALY,WAY - NIGHT\n</b>          Kate closes the door. The lock CLICKS shut. A moment later,\n          Esther starts BUMMING. Kate listens fbr a beat,-troubled..\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          '32.\n</b>\n<b>          .INT. MAX IS BEDROOM - NIGHT\n</b>\n          Esther and Max are huddled in bed and Kate reads-them a story.\n          John watches from the doorway. Kate sees him and smiles.\n\n<b>          INT. KATE AND JOHN'S BEDROOM -- NIGHT\n</b>\n          Kate's in bed, writing'in her journal by the light of d bedside\n          lamp.. Outside, rain PATTERS-on the window and lightning FL1SHBS.\n          John kisses her good night. She smiles and surprises him by\n          pulling him close and kissing him more deeply. He responds.. She\n          places his hand on her breast and he starts to undress her. Then:.\n          A KNOCK at the door. John and Kate cringe at the interruption.\n\n<b>          KATE\n</b>          Come in.\n          The door opens. It's Esther and Max.\n\n<b>          ESTHER\n</b>          We're scared of the lightning.\n          Max giggles. Kate and John exchange a resigned look.'\n\n<b>          JOHN\n</b>          Okay, come on. But just for tonight.\n          Esther and Max excitedly clamber into the bed and snuggle between\n          them. Kate and John share amused looks.-\n\n<b>          INT. KITCHEN - MORNING'\n</b>\n          The kids are eating breakfast. Esther reads her sign language\n          book at the table. Max signs to Daniel. He turns to Kate with a\n          frustrated sigh.\n\n<b>          DANIEL\n</b>          Mom, what's she saying?\n\n<b>          ESTHER\n</b>          She wants you to pass the milk.\n          Kate gives Daniel an admonishing look.\n\n<b>          RATE\n</b>          See? If you studied more, you wouldn't\n          have to ask all-the time.\n          Daniel glares fit Esther, but she doesn't see it. John enters,\n          ready for work. He-grabs his travel mug, gives Kate a kiss.\n\n<b>          JOHN\n</b>          See you later.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          33.\n</b>          Esther puts dut her arms for a hug. He leans in to kiss her, but\n          she clings to him and won't-let go. She pouts.\n\n<b>          ESTEER\n</b>          I want you to take us to school.\n          She looks up at him with big sad eye.a. He can't resist.\n\n<b>          JOHN\n</b>          I guess I can be late today.\n          (to Kate)\n          I can take them to school and you can\n          pick them up.\n\n<b>          ESTHER  \n</b>          Yay! We're going with Daddy! -\n          She jumps up from the breakfast table and runs off to get ready..\n\n<b>          INT. FOYER - MORNING  \n</b>\n          The kids are leaving for school with John. Kate sees them off.\n\n<b>          DANIEL\n</b>          Bye, Mom.\n          Kate-gives him and Max a kiss, but Esther-runs right by without\n          pausing, hurrying after John. Esther. takes- 'John 'a-hand, holding\n          it on the way to the car. Kate watches them, a little hurt...\n\n<b>          INT. LIVING ROOM - DAY\n</b>\n          Rate sits with Esther, watching her open a gift-wrapped box.\n          Inside is a JOURNAL like the one we've seen Kate writing in.\n\n<b>          KATE\n</b>          I have a journal just like this that I\n          write in every day.\n\n<b>          ESTHER -\n</b>          What kinds of things do you write\n          about?\n\n<b>          RATE\n</b>          what I did that day, how I feel.\n          Anything I don't want to forget. I\n          thought you and I could spend some time\n          together today and start a life book.\n\n<b>          ESTHER\n</b>          Whit's that?\n\n<b>          RATE\n</b>          It's like an adoption storybook. And\n          it's all about you. I did a couple\n          pages to gat you started. Look. -\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          34.\n</b>          She opens the journal. Pasted to.the first page is a photo.from\n\n<b>          \"HOMMY\n</b>          A DADDY GET rMARRIeED ng Esthermarvelskat Kate'sgwedding dress.\n\n<b>           ESTHER\n</b>           So beautiful,..   ,\n          Kate turns the page to a picture of.Khte and John with Daniel as a\n          BABY. Then Kate, John, and SIX=YEAR-OLD DANIEL with BABY MAX. \n\n<b>          KATE\n</b>          This is Daniel when he was born, And\n          there's Max; And there's you.\n          She turns next to a photo of the-whole- family taken at Esther' s\n          welcome home party. The caption reads, \"ESTHER JOINS THE FAMILY.\"\n\n<b>          RATE .\n</b>          If you want, we can put your other\n          pictures in here, too.\n\n<b>          ESTHER \n</b>          What other pictures?\n\n<b>          KATE\n</b>          The ones I saw in. your Bible.\n          Esther gives her a dismayed look.\n\n<b>          KATE -\n</b>          I'm sorry. They slipped out at church.\n          If they're private, we don't have.to ---\n\n<b>          ESTHER\n</b>          It's okay.' I want you to -see them.\n          She smiles, but it looks forced.\n\n<b>          INT. ESTHER'S BEDROOM - DAY\n</b>\n          Kate and Esther sit on the floor. Esther. removes the rubber band\n          from around her Bible and takes out a few battered photographs.\n          They're all of Esther with a rural family -- the man.Kate saw in\n          the photo at church, his WIFE,. and THREE BOYS, aged 6, 10, and 14.\n          In one, they're all posed together in front of a farmhouse.\n\n<b>          ESTHER\n</b>          These are the Wallaces. That's James\n          and Hannah. And that's Micah, Luke,  \n          and Isaiah.\n\n<b>          KATE -\n</b>          This is the American family that\n          adopted you from Russia?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          35.\n</b>          Esther nods'. They're candid -family snapshots full -of. laughter and\n          hugs. Esther'.s adopted father is in all-of them. The last one is\n          of him and. Esther, the same photo Kate. saw part, of at church.\n\n<b>          KATE'.\n</b>          They lookvery'n.ice. They must have\n          loved you'very much.\n          Ksther nods, but Kate-sees that she's holding back tears.\n\n<b>          RATE\n</b>          What's wrong?.\n\n<b>          ESTHER\n</b>          I hid these because Ididn't want you\n          to know how much I miss' them, I was\n          afraid you'd think I didn't love you.\n\n<b>          KATE\n</b>          It's okay, sweetie... I understand.\n          (beat; considers)\n          You know, I lost someone who was very\n          .special to me once, too.\n          Esther wipes her eyes and looks up, interest piqued.\n\n<b>          ESTHER\n</b>          Really?\n\n<b>          INT. MUSIC ROOM - DAY\n</b>\n          Kate shows Esther the orchid in its ornate planter.\n\n<b>          RATE\n</b>          We don't have any pictures of Jessica\n          because she died while she was still in\n          my tunny. But we spread her ashes in\n          here and as long as. this flower grows,\n          part of her will be alive inside it.\n\n<b>          (BEAT)\n</b>          It's okay to be sad.about the people\n          we've lost.. And it.'s okay to iniss\n          them, too.\n          Esther nods. They'smile at one another through their tears.\n\n<b>          INT. ELEMENTARY SCHOOL - HALLWAY - DAY\n</b>\n          Between classes, crowded with KIDS.,. Esther clutches her books to\n          her chest. Daniel and Trovor are walking the other way and as\n          they pass, Daniel dumps Esther's books. Trevor laughs.\n          Esther glares at'Daniel and kneels to pick up her books, bitt the\n          kids walking by purposefully kick them, laughing faces leering\n          down at her. She gathers her books, but one of them is missing.\n          She looks around. -Spots it.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          36.\n</b>          Esther's Bible lies on the floor at Someone's feet. A.hand\n          reaches down. and picks it up. It's Brenda.\n\n<b>          BRENDA\n</b>          Is this a Bibl?\n\n<b>          ESTHER\n</b>          Give it back to me.\n          She reaches for it, but Brenda laughs and raises-it over her head.\n\n<b>          BRENDA\n</b>          Jesus-freak brought a Bible to school!\n          Esther angrily swipes at it again, but one of Brenda's friends\n          grabs it first. Esther takes a deep breath, trying to calm down.\n\n<b>          I3STUER\n</b>          May I pleas. have my Bible?\n          The girl hesitates, shrugs and offers Sather the Bible... but\n          snatches it away again at the last second. Brenda laughs. 8sther\n          reaches for it, but the girls keep passing it between them.\n          Esther and Brenda grab it at the same time. There's a brief tug-\n          of-war, then the rubber band SNAPS and the Bible flies apart,\n          pages and hp otos scattering everywhere.\n          Esther gasps in horror and dives to the floor, desperately\n          scooping up the loose pages. A\"crowd gathers, watching and\n          snickering, Daniel and Trevor among them. Esther looks to Daniel\n          for help, but he just stands there, watching uncomfortably.\n          Brenda laughs at Esther crawling around on all fours.\n\n<b>          BRENDA\n</b>          Look at the cute little doggied Is\n          this your collar, little doggie?\n          Brenda reaches out and grabs the ribbon-around Rsthdrls neck...\n          The-second Brenda touches the ribbon, Esther flies into panic.\n          She screams an s Brenda'e hand away, aching h_ex e and\n          k coking feet, ster 11 s 5 riekincr At the toy Dg her.lungs.\n          Brenda leaps back, wide-eyed and freaked out.\n          The kids fall into stunned silence. Esther's screams echo in the\n          hallway. A TEACHER comes running. Trevor puts a hand over his\n          mouth so the teacher won't see him laughing.\n\n<b>          TREVOR\n</b>          Dude, your sister's a.total spazl\n\n<b>          DANIEL\n</b>          She's not my sister.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          .37.\n</b>\n<b>          1W-. KATE'S MINIVAN - DAY\n</b>          The drive home from school. is silent and tense. Esther stares out\n          the window. 'Kate eyes her in the rearview mirror, concerned.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY\n</b>\n          The minivan is'parked in the drive and the kids are climbing out.\n          As Daniel and Max head to the house, Kate takes Esther-aside.\n\n<b>          RATE\n</b>          Mrs. Grosse told me what happened\n          today. Do you want to talk. about it?\n          Daniel-hangs back to see if Esther is going, to tell on him. She\n          \"sees him standing there, then turns to Rate with a smile. -\n\n<b>          ESTHER\n</b>          There's nothing to talk about. We were\n          -just playing a game, that's all.\n          She walks away, passing Daniel without, a look. Kate is. dubious.\n\n<b>          INT. MAX'S BEDROOM - DAY\n</b>\n          Max enters, throws down her \"Hello Kitty\" bookbag ---- and stops\n          short. Hodgenodte's-cag .is empty. Max stands frozen for a beat,\n          then starts looking for him. Esther appears in the doorway.\n\n<b>          ESTHER\n</b>          What's the matter?\n          Max turns and tries to block the cage, but Esther sees that it's\n          empty. Esther gasps.\n\n<b>          ESTHER\n</b>          Where is he? Were you playing with\n          him?\n          Max frantically shakes her head. Esther quickly shuts the door.\n\n<b>          ESTHER\n</b>          You left his cage open! Look!\n          Sure enough, the door of the cage is wide open. Max shakes her\n          head, frightened tears in her eyes.\n\n<b>          MAX\n</b>\n<b>          I DIDN'T! I PROMISE!\n</b>\n<b>          ESTHER\n</b>          Then how did he get out?\n\n<b>          MAX\n</b>\n<b>          I DON'T XNOW41 I DON'T KNOW]\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          38.\n</b>\n<b>          ESTBER\n</b>          You have to think! Mommy's not going\n          to believe your. She didn't.believe you\n          about the necklace and she's not going\n          to believe you about this!\n          Max is devastated. She's sobbing now. Esther tries to calm her.\n\n<b>          ESTHER\n</b>          It' a okay. Don't cry. Look 'at me.\n          She takes Max by the shoulders. Max looks up, breath hitching.\n\n<b>          ESTSER\n</b>          I'll tell Monmy-it was-my fault. You\n          won't get in any trouble.. I'll tell\n          her I took him out of the cage without\n          your permission and he ran away, okay?\n          Max gives a grateful nod. Esther smiles and strokes Max's hair.\n\n<b>          ESTHER -\n</b>          Don't worry. It'll be our little\n          secret.\n          :Max nods again and gives her a-hug. She doesn't see the\n          calculating look in Esther's eyes...\n\n<b>          INT. SUNROOM - NIGHT\n</b>\n          A-glassed-in terrace off of Kate and John's bedroom filled with\n          plants. Kate is wearing only a long T-shirt, watering the plants\n          before bed. John enters in his pajama bottoms, snuggles into her\n          from behind. Kate smiles and.leans into him.\n\n<b>          INT. KATE AND JOHN'S BEDROOM - NIGHT\n</b>\n          The lights - are off. Kate and John are in bed, making lave. Slow,\n          passionate, intense. When they're finished,- breathless and\n          trembling, she cradles his face in her hands gazing lovingly up\n          at.him. Then something catches her eye in the moonlight:\n          Ethel Jg.wat ,them fr m the -open b edr door, hgr hen\n          frozen 9J1 tth dooxknob.\n\n<b>          KATE\n</b>          Oh, my God!\n          They hurriedly pull the sheets up and Kate turns on the bedside\n          lamp. Esther stares at them blankly.\n\n<b>          KATE .\n</b>          Esther, honey? What is it? Are you\n          okay?\n          Esther just glowers at'her, then turns and walks away.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          39.\n</b>\n<b>          INT.'ESTBER'S BEDROOM - DAY\n</b>\n          Esther. Sits at her easel, painting. Kate enters and sits down on'\n          the bed. Esther doesn't look:at her. She's painting a\n          sophisticated, stylized PORTRAIT OF KATE. -Other PORTRAITS of the\n          family -arealready pinned to the wall. Kate shifts uncomfortably.\n          We need to talk -about last night.\n\n<b>          ESTU\n</b>          Do we?\n\n<b>          KATE\n</b>          Yes. There are certain things that.\n          grown-ups do. that kids aren't supposed\n          to see. And that was one of them.\n          Esther keeps painting. She still hasn't looked at her. -\n\n<b>          KATE\n</b>          Esther, I need you to listen to me..\n          Esther pauses. She deliberately sets her paintbrush down and\n          turns to Kate. An awkward beat.\n\n<b>          KATE\n</b>          See, when two grown-ups love each other\n          very, very much, they like to. show that\n          love to each other --\n          Iknow.- They fuck.\n          Kate is dumbfounded. Esther regards her with a bored, aloof-look.\n\n<b>          INT. JOHN'S DEN - DAY\n</b>\n          John is troubled by what Kate has told him.\n\n<b>          JOHN\n</b>          - She could nave picked it up anywhere.\n          Bell, she probably heard it at school.\n\n<b>          KATE\n</b>          This wasn't something she overheard.\n          She knew what it meant. And the way\n          she said'it. I don't even think she\n          expected to get in trouble over it.\n\n<b>          JOHN\n</b>          We'll talk to her about it tonight.\n\n<b>          KATE\n</b>          You think that's enough?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          40.\n</b>\n<b>          JOHN'  \n</b>          What do you suggest?\n\n<b>          KATE '\n</b>          I could take her to Doctor Browning.\n\n<b>          JOHN\n</b>          It was one dirty word. I don't think\n          we need to call in the shrink just-yet.\n\n<b>          KATE    \n</b>          Maybe. It just reminded The of what\n          Sister Abigail said.. We really don't\n          know that much about her.'- The last\n          'family she-was with could have been -\n          like, \"Pass the fucking potatoes\" at\n          the dinner table for all we know. '\n\n<b>          JOHN\n</b>          Iget it, I just- don ''t want to make a\n          bigger deal out of it than it is.\n\n<b>          KATE\n</b>          If she's saying \"fuck\" to my face,\n          what's she doing when we're not around?\n          We have to be thinking about what kind\n          of influence she's having-on Daniel and\n          Max. Particularly Max.\n\n<b>          JOHN\n</b>          I wouldn't worry about it. You're\n          right, we don't know how she was\n          raised, but we do know she's a good\n          kid. if Danny and Max want to start\n          acting.like her, that's fine with me.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY\n</b>\n          Esther and Max pick wildflowers along the edge of the forest.\n\n<b>          ESTHER\n</b>          Let's pick flowers for Daddy.\n          Max.nods happily. 'Then Esther notices something that makes her\n          stop short. A girl approaching on a bicycle...\n          It's Brenda. She pretends to not see Bather, just rides right by.\n          Esther watches, her face strangely slack... then starts to follow\n          .her. Max gives Esther a confused look, but tags along.\n\n<b>          EXT. PARK -- DAY\n</b>\n          Esther finds Brenda's bike parked at a neighborhood playground ----\n          swings carousel, jun7le gym, and a-tall corkscrew slide made-tor\n          look like a rocket ship. There are KIDS playing. MOMS watching.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          41.\n</b>          A BONELESS GUY with a shopping cart full of stuffed garbage bags\n          asleep by a tree. WOMEN. doing pilates. Esther ignores them all.\n          Brenda is climbing on the jungle gym with some other kids. Esther\n          walks over with Max in tow and just watches Brenda play. Brenda\n          sees her and makes a face. Esther just stands there. Staring.\n\n<b>          BRENDA .\n</b>          What are you looking at?\n          No response. Max tug on Esther's arm, but she's rooted in place,\n          staring blankly at Brenda. Finally, Brenda can't take it. She\n          climbs off the jungle gym and walks away. Esther watches 'her go..\n          Brenda gets on a swing, but just as she starts to get some height,\n          Ester' right there,.star n ,_p a her again. Max happily grabs\n          a swing for herself, but Esther is fixated on Brenda.\n\n<b>          BRENDA\n</b>          Stop staring at.mel Stop ital.\n          But Esther is unwavering. Can't take her eyes off of her. Brenda\n          gets off the swing and runs\n          away. Esther calmly walks after her.\n\n<b>          BRENDA\n</b>          Go-away! Stop following me, freak!\n          Max sees Esther following Brenda and grudgingly gets off the\n          swing, hurrying to -catch up. Brenda gives them an angry look.\n\n<b>          \" BRENDA\n</b>          Why don't you two,go home and change\n          each other's diapers?\n          Esther and Max follow Brenda across the park,, Max still uncertain\n          about what's going on.. Brenda heads for. the tall corkscrew slide.\n          Steep stairs lead to the enclosed top, the tip of the rocket ship.\n          Brenda starts up the stairs, then pauses. She turns to Esther.\n\n<b>          BRENDA\n</b>          You go first.\n          Esther doesn't move, but Max gladly takes her turn. After a beat,\n          Esther follows Max up the stairs. Brenda stays behind, watching.\n          Max goes down the spiraling slide, but Esther just stands at the\n          top, looking down at Brenda.\n\n<b>          BRENDA\n</b>          Gol!\n          Esther, continues to stare down at her for a beat, then turns and\n          -disappears from eight. only. then does Brenda climb up.\n          Max runs to the stairs for- another turn. Brenda reaches the top\n          and looks around. She sees Max.' But where's Esther? She turns.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          42.\n</b>          Suddenly, Es er is right in ,AIL of her.   She didn't' go down the\n          slide, she was just crouched out of sight. Brenda gasps --\n          -- then Este spits Jn her face acrd ush hex dawn the airs.\n          Brenda SCREAMS as she falls,-limbs flailing, out-of-control. She\n          lands hard in the dirt and just lies there crying, clutching her\n          arm and bleeding from a gash in her forehead.\n          Brenda's scream draws alarmed looks. The Homeless Guy startles\n          awake. one of the playground mothers comes running to help. But\n          Max stands frozen, gaping at Esther in total shock. Esther stares\n          blankly down.at Brenda from atop the slide. Utterly emotionless.\n\n<b>          EXT. PARK - DAY (TIMCUT)\n</b>\n          BRENDA'S FATHER arrives on the scene. Brenda says something. to\n          -him and points at Esther and Max, who watch from a distance.\n\n<b>          ESTHER\n</b>          Are you going to tell on me?\n          Max shrugs.\n\n<b>          ESTHER\n</b>          I didn't mean to hurt her. I just\n          wanted her-to stop picking on me.\n          (off Max's look)\n          Don't you hate it when someone is mean\n          to you for no reason? Wouldn't you do\n          almost anything to make them stop?\n          A best. Max nods. Esther offers her hand and Max takes it.\n\n<b>          INT. DINING ROOM - NIGHT\n</b>\n          Esther and Max sit at the table. Kate and John eye them sternly.\n\n<b>          JOHN\n</b>          Brenda says you pushed her.\n\n<b>          ESTHER\n</b>          That's not true! We were just playing\n          and she tripped! I swear!\n\n<b>          KATE\n</b>          (to Max)\n          Did you see what happened?\n          Esther eyes Max expectantly. Max hesitates. Then:\n\n<b>          MAX\n</b>\n<b>          IT .WAS AN ACCIDENT.\n</b>          Kate sighs, not entirely convinced...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          43.\n</b>\n<b>          INT. MUSIC ROOM -- DAY.\n</b>\n          Kate carefully tends the memorial orchid, spraying it with a fine\n          mist of water.--\n\n<b>          INT. SUNROOM - DAY -\n</b>\n          Kate's watering the plants when she feels something on'her hand.\n          There's an ANT on it. She flicks it off. Then she seed ANOTHER,\n          this one crawling up her arm. She makes a face and looks down.\n          Thg g are ante arwl ng loon a-: arou her feet. She\n          quickly steps back,- brushing at her- arms and legs. She looks\n          under one of the plant tables to'see what's attracted them:\n          It's Hodgepodge. He's been dead for several days, his body\n          swarming with ants and MAGGOTS.\n\n<b>          EXT.-COLEMAN RESIDENCE ï¿½ GARDEN - NIGHT\n</b>\n          A hole has been dug in the backyard flower garden. Kate, John,\n          Esther, and Max stand around it. Max places a shoebox with\n          \"HODGEPODGE\" written on it in the hole and lays a flower on top of\n          it. John starts shoveling dirt into the bole.\n          Esther and Max exchange a knowing look...\n\n<b>          INT. MAX'S BEDROOM - DAY\n</b>\n          Esther and Max are giggling and playing dress-up. Clothes are\n          strewn everywhere. They're both trying to look grown-up. They're\n          even wearing makeup -- heavy mascara and pink, painted cheeks.\n          Daniel walks by and sees Max putting on lipstick. He takes it\n          away from her.\n\n<b>          DANIEL\n</b>          Hey, you're not allowed to wear makeup.\n          Does mom know you have this?\n\n<b>          ESTHER\n</b>          Give it-back.\n\n<b>          DANIEL,\n</b>          Make me.\n\n<b>          ESTHER\n</b>          Give it back'or I'll tell Daddy, that\n          you hit her and then you'll be in\n          trouble.\n          Max smiles. Daniel-scowls at Esther, then gives Max the lipstick.\n          He leaves. Max gives Esther a hug. Best friends forever.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          44.\n</b>          f l iT. SUPERMARKET - DAY\n          Kate waits in line -at the check-out. Esther and-Max are with her.\n          Aw .Kate pushes her cart up to the-counter, she looks over and sees\n          the nearby'\"WINE &amp; SPIRITS\" aisle. No big. deal, just a passing\n          glance, a flash of idle distraction. Her eyes unreadable. Then:\n\n<b>          ESTHER (O.S.)\n</b>          What kind of sex do men crave most?\n          Kate-looks back, shocked. Esther has picked up a \"COSMOPOLITAN\"\n          from the newsstand and is'reading the cover aloud-to Max.\n\n<b>          KATE\n</b>          Put that away. Don't look at those.\n          Kate puts the magazine back. There are several others just like\n          it at kids-eye level. \"Orgasms UNLIMITED!\" \"Thrill EVERY INCH- Of\n          Him J\" Kate'sighs and-'starts putting groceries on the conveyer.-\n\n<b>          ESTHER\n</b>          \"How To Hit Your G-spot Every Time.\"\n          Kate whirls. Esther has picked up the same magazine. Kate\n          angrily snatches it and pulls Esther toward her. Max startles.\n\n<b>          KATE\n</b>          Stand where I can see yowl\n\n<b>           \n</b>          The CASHIER and a couple CUSTOMERS turn to look at her. Kate\n          ignores them. Esther can't suppress a little smile.\n\n<b>          INT. DINING ROOM - NIGHT\n</b>\n          The family is eating dinner. Esther makes a face and pushes her\n          plate away half-finished.  \n\n<b>          ESTHER\n</b>          May I be excused?\n\n<b>          KATE  \n</b>          At least eat your chicken.\n\n<b>          ESTHER\n</b>          I'm not going to eat something that I\n          don't like just to make you feel\n          better. That's ridiculous.\n\n<b>          JOUN\n</b>          Esther, stop it. Eat the chicken and\n          then you can be excused.\n\n<b>          ESTHER\n</b>          Yes, sir.\n          Esther starts eating. Kate gives John an exasperatedlook.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          45.\n</b>\n<b>          IM. FOYER - DAY\n</b>          The doo;rbel]. RINGS. Esther ï¿½ï¿½dto Esther it. it's Sisttereys. a clipboard\n          Abigail. She's carrying\n\n<b>          ESTHER\n</b>          Hello, Sister Abigail.\n\n<b>          SISTER ABIGAIL.\n</b>          Hello, Esther.\n\n<b>          INT. STA'IRAELL  -- DAY\n</b>\n          Esther leads Sister Abigail upstairs. Kate and John follow-\n\n<b>          SISTER ABIGAIL\n</b>          to need updated charts I tÂ¢ also going t\n          from her. pediatrician and her dentist\n          for my supervision report.\n\n<b>          KATE\n</b>\n<b>          ECK-\n</b>          That's no problem. We've got a ch\n          up with the dentist next week.\n\n<b>          INT. ESTHER'S BEDROOM - DAY\n</b>\n          .Esther leads Kate, John, and Sister Abigail into her room.\n\n<b>          ESTHER\n</b>          Isn't it lovely? Look at my new\n          paintings. -I've=done a portrait -for\n          everyone in the family.\n          She shows sister Abigail the portraits pinned to her wall.\n          There's also a painting of everyone together.\n\n<b>          SISTER ABIGAIL\n</b>          That's one good-looking family you've\n          got..\n\n<b>          ESTHER\n</b>          I know. Aren't they perfect?\n          Sister Abigail gives Kate and John an amused look-\n\n<b>          INT. KITCHEN - DAY\n</b>\n          Kate, John, and Sister Abigail talk over coffee.\n\n<b>          JOHN\n</b>          I swear, we-didn't bribe her to say\n          that.\n          .y:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          46.\n</b>\n<b>          SISTER ABIGAIL\n</b>          No explanation necessary. I don't\n          think there e'anything that girl could\n          say that would surprise me.\n\n<b>          KATE.\n</b>          She dropped the 't--bomb on me a few\n          weeks ago.\n          'Sister Abigail raises her eyebrows in comic, exaggerated surprise.\n\n<b>          SISTER ABYGAYL\n</b>          Well. I'm glad to hear she's finally\n          come out of her shell.'\n\n<b>          1OBN\n</b>          She's just testing us. It's been\n          nowhere near as bad as we expected.\n\n<b>          SISTER ABIGAIL\n</b>          What kinds of things is she doing?\n\n<b>          -KATE\n</b>          Talking back to me. Purposefully\n          disobeying. She took Max to the park\n          without ppesrmission the other day. That\n          was the biggie. A girl they were\n          playing with got hurt.\n          A beat. Sister Abigail is suddenly apprehensive, tries to cover.\n\n<b>          SISTER ABIGAIL\n</b>          Really? is the girl all right?\n\n<b>          RATE\n</b>          She broke her arm and had to have\n          something like eleven stitches, I\n          think. She was lucky.\n\n<b>          SISTER ABIGAIL\n</b>          She doesn't. sound very lucky.\n\n<b>          JOHN\n</b>          She's lucky she didn't break her neck.\n          Sister Abigail seems troubled by this.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY\n</b>\n          Sister Abigail walks out to her car, concerned. She doesn't see\n          Esther spying down from her bedroom.window, just staring at her\n          with that strange, blank look...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          47.\n</b>\n<b>          INT. MUSIC ROOM - DAY\n</b>\n          Kate gives a piano lesson- to a.COLLEGE S7TUDENT, listening as he\n          runs. through a finger exercise.\n\n<b>          KATE=\n</b>          Relax;. wrists following fingers...\n\n<b>          EXT. NEIGHBORHOOD - DAY\n</b>\n          John leads Esther and Max on a bike ride around the neighborhood.\n          Esther speeds-up, leaving Max behind so she can ride next to John.\n\n<b>          ESTHER\n</b>          I'm Daddy's little girl, aren't I?\n\n<b>          JOHN\n</b>          That's right. You both are.\n          As they head home, they see JOYCE 'PATTERSON (late 30's) jogging\n          toward them. A blonde with dark roots and an overdone boob job.,\n          wearing a skimpy sports bra and mini shorts. She waves to tem.\n\n<b>          JOYCE -\n</b>          Look at these three cutiesl\n\n<b>          JOHN\n</b>          How're-you doing?\n\n<b>          JOYCE\n</b>          Hanging in there. Hey,,. I've got. a\n          chair X want moved upstairs. You think\n          you could come over and give me a hand?\n          John glances toward home. Kate's at the door, waving goodbye to\n          the College Student.- She sees John talking to Joyce and gives\n          them an unreadable look before going back inside.\n\n<b>          JOHN\n</b>          Uh, yeah. Maybe Kate and I -could help\n          you -out.\n\n<b>          JOYCE\n</b>          Okay, I'll call you.\n          John and Max start off again, but'Esther doesn't move. She's\n          openly looking Joyce over from head to toe.\n\n<b>          ESTHER\n</b>          You have a l ovely body.\n\n<b>          JOHN.\n</b>          Come on, Esther. Let's go.\n          Esther reluctantly follows. Joyce eyes her dubiously.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          48.\n</b>\n<b>          INT. KITCHEN -- DAY\n</b>\n          John acid the girls enter. Kate has juice boxes for the girls. A.\n          look passes between John and Rate. Esther notices.\n\n<b>          KATE\n</b>          How was the.iide? Did you have fun?\n          Max nods'and heads off; but Esther hangs back, eavesdropping:\n\n<b>          KATE\n</b>          Didn't waste -arty time-turning that\n          divorce settlement-into a tit job, did=\n            she?\n\n<b>          JOHN\n</b>          I didn't notice.\n\n<b>          KATE\n</b>          Yeah, right.\n          She's teasing, but there's something biting underneath it. Esther\n          walks away, sipping on her juice box..\n\n<b>          INT. HOME FOR GIRLS - SISTER ABIGAIL' S OFFICE - NIGHT\n</b>\n          After hours. Sister Abigail is at her desk. She opens a file and\n          reads. We see a Polaroid of Esther stapled to the cover...\n\n<b>          EXT. CARNIVAL - NIGHT\n</b>\n          Midway rides and boardwalk games have been set up in the parking\n          lot of Daniel and Esther's school. A banner reads \"\"EDGAR\n          ELEMENTARY ANNUAL HALLOWEEN HOOT.\" The place is packed with\n          excited children in Halloween costumes.\n          The school is at the'top of a steep hill. Kate and John walk up\n          it with the kids. Daniel's dressed as a ninja, Max is a \"FINDING\n          NEMO\" fish, and Esther's an angel, complete with a shiny halo.\n\n<b>          SERIES OF SHOTS\n</b>          John gives Daniel some money to hang out with Austin and Trevor...\n          On the BOARDWALK, playing games, winning prizes. Esther shoots\n          BBs at balloons with a toy rifle. She's pretty good at it...\n          On the MIDWAY, Esther and Max are whirled around on the Scrambler,\n          screaming and laughing. Kate and John watch and take pictures..'.\n\n<b>          THE HAUNTED -MAZE\n</b>          A cheap fun house attraction. The girls ran up to John and Kate..\n\n<b>          ESTHER\n</b>          We want to go in by ourselves)\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          49.-\n</b>\n<b>          JOHN\n</b>          Okay, just make sure you hold her hand.\n\n<b>          ESTHER\n</b>          I will. -\n          The girls. run inside. John smiles, but Kate watches anxiously.\n\n<b>          INT. HAUNTED' MAZE - NIGHT -\n</b>\n          Esther leads Max through the dark', winding fun house corridors.\n          Max starts to look cared. She nearly leaps. out of her skin when\n          a RUBBER--MASTED GHOUL jumps out at them. But Esther just laughs\n          at it. Max sees that she's not afraid and soon they're both\n          giggling at the CHEESY SPOOKS that try to scare them.\n\n<b>          EXT. CARNIVAL - NIGHT\n</b>\n          The girls emerge frtn- the'maze, clutching each other and laughing.\n\n<b>          ESTHSR\n</b>          Let's play \"hide and seek.\" You go\n          first.\n          Max excitedly runs off. Esther watches her vanish into the CROWD.\n          Moments later,-Kate and John appear. Rate-nervously looks around.\n\n<b>          RATE\n</b>          Where's Max?\n\n<b>          ESTHER\n</b>          I don't know. I was trying to hold her\n          hand, but she pushed me and ran away.\n\n<b>          KATE\n</b>          Oh,.my God...\n\n<b>          JOHN\n</b>          It's okay. Did YOU see where she went?\n\n<b>          ESTHER\n</b>          This way, I think.\n          She points the wrong way. Kate takes her hand and they quickly\n          move through the crowd, looking for Max. John stands on a bench\n          for a better vantage, Kate grabs passersby:\n\n<b>          KATE\n</b>          Have you seen a little girl in-a fish\n          costume? She has short brown hair?\n          Nobody's seen her. Kate grows frantic. Esther watches with a\n          nonchalant smile, enjoying the drama.- She tugs on Kate's arm.\n\n<b>          ESTHER\n</b>          i Mommy, I want scene cotton candy.\n           - 'ï¿½ 'ti\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          50.\n</b>\n<b>            ICATS\n</b>          Not now, Esther Iâ\u0080\u0094\n\n<b>          JOHN\"\n</b>          Kate, please. Take it easy. She's\n          gotta be around here\n          Then Kate spots Daniel approaching, holding Max's hand.' Kate\n          breathes a sigh of.relief and rushes to give Max a fierce hug.\n\n<b>          KATE\n</b>          Are you all right?- Don't you ever run\n          off like that[ What were you thinking?\n\n<b>          DANIEL\n</b>          They were playing \"hide and seek.\"- I-\n          saw Esther let her run off.\n          Esther gives him a sharp look. John turns on her, . angry.\n\n<b>          JOHN\n</b>          Did you lie to us? What did I tell you\n          about'holding her hand?\n\n<b>          ESTHER\n</b>          I'm sorry, sir.\n          She looks like she's going, to cry. John sighs, then turns to Kate\n          and Max. Esther gives Daniel a hateful look through her tears.\n\n<b>          EXT. COLEMAN RESIDENCE - MORNING\n</b>\n          The kids pile into the minivan for school. As Daniel climbs in,\n          Esther' drops something behind him and pretends to find it.\n\n<b>          ESTHER\n</b>          What's this?\n          She shows Kate a little PLASTIC BAGGIE OF WEED. Daniel blanches\n          when he sees it.. His.treehouse staah..\n\n<b>          INT. JOHN'S DEN - NIGHT\n</b>\n          Kate and John confront Daniel.\n\n<b>          DANIEL\n</b>          I wasn't taking it to school[\n\n<b>          RATE\n</b>          Then what was it doing 'in-your\n          backpack?-\n\n<b>          DANIEL\n</b>          I don't knowl\" She just put it there to.\n          get me in troubles\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          51.\n</b>\n<b>          JOHN\n</b>          Where would'Esther have gotten pot?\n\n<b>          DANIEL\n</b>          (a beat reluctant)\n          She saw me wCth it in the treehouse.\n\n<b>          -JOAN\n</b>          Is that what...you're doing- out .there\n          with Austin and Trevor? Smoking pot?!\n          Daniel stammers. John stews-.\n\n<b>          EXT. HOUSE - DAY\n</b>\n          John screws a hasp to the treehouse-door with -a POWER DRILL and\n          slaps a PADLOCK on it. Daniel stands below,-watching. John\n          climbs down, shows Daniel the padlock key, and pockets it.\n\n<b>          JOHN-\n</b>          Off limits until further notice.\n          Be heads to the house; Esther is playing in the backyard.. She\n          takes John's hand and walks inside with him. Daniel watches them.\n\n<b>          INT./EXT. KATE'S MINIVAN - DAY\n</b>\n          Kate pulls out of the driveway with Esther in the back seat. As\n          they leave the neighborhood, Joyce Patterson Jogs by in her skimpy\n          workout clothes. She-waves. Kate gives a polite nod.\n\n<b>          ESTHER\n</b>          Why does she have to'dress like that?\n\n<b>          KATE -\n</b>          She just likes the 'attention.\n\n<b>          ESTHER\n</b>          Well, I think it's immodest. I don't\n          know why Daddy -likes her so much.\n\n<b>          KATE .\n</b>          (a beat, apprehensive)-\n          What do you mean?\n\n<b>          ESTHER\n</b>          He's always smiling at her and talking\n          to her. She wants him to come over to\n          her house. Did you know that?\n          (off Kate's look))\n          Please don't tell Aaddy I told. I\n          don't want him to be mad at me.-\n          Kate doesn't respond, clearly disturbed.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          52..\n</b>\n<b>          I EXT. DENTIST'S OFFICE - PARKING' LOT - DAY\n</b>\n          Kate gets out Of the minivan, but Esther stays put'-in her seat.\n          Rate sighs, frazzled and distracted.\n\n<b>          KATE\n</b>          Esther, come on.\n\n<b>          ESTHER\n</b>          X told you, I don't like the de ntist.\n\n<b>          KATE\n</b>          There's nothing to be afraid of.\n\n<b>          ESTHER -\n</b>          I know. Because I'm not- going-\n\n<b>          KATE\n</b>          Esther, get out of the cart Righ t now!\n          For a moment, they just glare at each other. Mexican stand-off..\n          Then Esther sticks her nose in the air and does as she's told.\n\n<b>          INT.-DENTIST'S OFFICE - EXAM ROOM -- DAY\n</b>\n          The DENTIST lowers Esther back in the chair, pulls on rubber\n          gloves. The HYGIENIST clips a dental bib around Esther's neck.\n\n<b>          HYGIENIST\n</b>          She hasn't had a check-up in about two\n          years, so she's a little nervous.\n\n<b>          -DENTIST\n</b>          she doesn't look to me. Now\n          let's have a look at those co ppers.\n          Esther just looks at the ceiling with her mouth tightly shut.\n\n<b>          DENTIST.\n</b>          Come on, darling, open wide.\n          -Esther eyes him anxiously; then reluctantly opens. Just a bit.\n\n<b>          DENTIST\n</b>          That a girl: Little wider...\n          She opens more. He leans in to take a look...\n          Suddenly, she SHdMPS dawnn his jinx s hard Pnou h to draw blo-mss fr\n          and locks ï¿½n like Rottweileï¿½] The Hygienist is frozen in shock.\n\n<b>          DENTIST\n</b>          Aaagh! Goddammit!! Help me with her !\n          The Hygienist holds her down while the Dentist tries to pry her\n          mouth open. Finally, he yanks his fingers free, cradling them\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          53.\n</b>          painfully. Esther HISSES at ldm like a cat, lips flecked with\n          blood. The Dentist and Hygienist exchange a startled. lock.\n\n<b>          INT. DENTIST'S-OFFICE - WAITING ROOM -- DAY\n</b>\n          Canned MUSAK.. Kate bits waiting. The Hygienist enters.\n\n<b>          HYGIENIST -\n</b>          Mrs. Coleman?\n          Kate gives her a confused look. Then she notices Esther htanding\n          behind the Hygienist with a-smug grin on'her face.\n\n<b>          INT./EXT. KATE'S MINIVAN - DAY\n</b>\n          Driving home.. Kate stews, on her last frayed nerve. Esther gazes\n          out the window, seemingly oblivious, singing a little nonsense\n          song under her breath: \"La-la-la, la-la-la-la... La--la-la ...\"\n          Kate stops at a traffic light. Glances outside.\n          She's stopped next to a LIQUOR.STORE. Kate quickly looks .away,\n          her temptation real enough to startle her. The light turns green\n          and she drives off without looking back. Esther keeps SINGING..\n          A few blocks later, they pass a BAR. Then a bus shelter with a\n          big ABSOLUTE VODKA AD. Kate probably drives by them every day,\n          but now they're popping out at her, sly old enemies that never\n          really left, re-emerging from the shadowy recesses of her mind.\n          She tries to focus on the road, Esther's VOICE grating in her\n          head... \"La-la-la, la-la-la-la:.. La-la-la, la-la-la-la...\"\n\n<b>          INT. FOYER -- DAY\n</b>\n          Kate and Esther enter. Esther skips upstairs. Kate sighs, angry\n          and frustrated. She plays a message on the ANSWERING MACHINE.\n\n<b>          SISTER ABIGAIL (V.0.)\n</b>          Hello, this is Sister Abigail calling\n          for John and Kate. Please call me as\n          soon as you get this message. I have.\n          something that we need to discuss in\n          person. It's regarding. Esther.\n\n<b>          UPSTAIRS\n</b>          Esther stands at the top of the stairs, listening to-the message-\n          She's heard everything. And she's scared. Scared and pissed.\n\n<b>          INT. KATE AND JOHN'S BEDROOM.- NIGHT\n</b>\n          Kate and John get ready for bed.\n\n<b>          KATE\n</b>          He's been our dentist for ten years.\n          Why would he lie to us?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          54.\n</b>\n<b>          JQAN\n</b>          I didn't say he's lying. I just think\n          Ws-blowing it out of proportion,\n\n<b>          KATE\n</b>          I saw the bite marks. We're lucky he's\n          not suing us.\n\n<b>          JOHN\n</b>          Fine, but I don't believe for a\"second\n          that she just did it for no reason.\n\n<b>          RATE\n</b>          That's because she's always on her best\n          behavior with you.\n\n<b>          JOHN'\n</b>          That's. not true. I've had to deal with\n          her at her worst..\n\n<b>          - KATE\n</b>          What you think is her worst is what\n          she's like with me all the time. She's\n          completely- different with me than she\n          is with you'.,\n\n<b>          JOHN\n</b>          So you've seen her haul off'and bite\n          someone like an animal?\n\n<b>          KATE\n</b>          No, but she threw that fit at school\n\n<b>          JOEN\n</b>          Yeah, because the other kids were\n          harassing her. It's the same thing\n          here.\n          (off her reaction)\n          She's from a completely different\n          culture Kate. She has to be taught\n          that this. behavior isn't appropriate\n          but there's nothing malicious about it.\n          If'she says she bit him because she was\n          scared and he was hurting her, I don't\n          see any reason not to believe her.\n          A beat. Kate looks at him. She's stewing hbaut something.\n\n<b>          KATE\n</b>          So should .1 believe her when she says\n          you've been hitting on Joyce Patterson?\n\n<b>          JOHN'\n</b>          (taken aback)\n          Did she say that?\n          t.\n\n<b>           \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          55.\n</b>\n<b>          ]CATS\n</b>          Is it true?\n\n<b>          JOHN\n</b>          of course not!\n\n<b>          KATE\n</b>          Did-she invite You over?'\n\n<b>          JOHN\n</b>          She wanted me to help her move a chair.\n\n<b>          KATE\n</b>          Oh, - come on.\n\n<b>          JOHN\n</b>\n<b>          ON\n</b>          All right, she was obviously coming\n          to me. But I shut her down.\n\n<b>          KATE\n</b>          Then why didn't you tell me?\n\n<b>          JOHN\n</b>          Because I knew how you'd reactl\n\n<b>          KATE\n</b>          Really? You sure it wasn't because you\n          were coming-on to her so obviously that\n          an eight-year-old picked upon it?\n          A long-beat. John sighs, resigned.-\n\n<b>          JOHN\n</b>          How-long are you going to keep this\n          hanging over me? It was ten years ago.\n\n<b>          KATE\n</b>          You keep-saying that. But it's only\n          been about two years since you told me.\n          (a tense beat)\n          Having another child was -supposed to\n          bring us together.\n\n<b>          JOHN\n</b>          I'm sorry I didn't tell you-about it-\n          x just feel like I've earned a little\n          trust here.\n\n<b>          KATE -\n</b>          I don't know what you expect from me.\n          I might never completely trust you\n          again. Not like before.\n\n<b>          JOHN  \n</b>          I gave you a second chance.\n\n<b>          ï¿½4\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          56.\n</b>          Kate stops short. IIis words-are like a phybical blow.\n\n<b>          - KATE -\n</b>          That's not fair.\n\n<b>          JOHN\n</b>          So-you can keep bringing uP my . mistakes\n          over and Over, but we're not even\n          allowed to discuss yours?\n\n<b>          KATE\n</b>          I was sick! You were just an asshole\n          who wanted to fuck somebody else!\n\n<b>          JOHN\n</b>          You were a danger to our children. If\n          I didn't want to. make this work, I\n          could have left months ago and nobody\n          would have blamed me.\n\n<b>          KATE\n</b>          Nice. Is that-what-your mother told\n          you?\n          Angry tears well in her eyes. He realizes be went too far.. Kate\n          goes into the bathroom and SLAMS the door.\n\n<b>          INT. MAX'S BEDROOM - NIGHT -\n</b>\n          It's late. Esther and Max sit on the bed in their nightgowns.\n          Only the bedside light is on. They're signing to one anothe r.\n\n<b>          ESTHER\n</b>          THE MAN LADY YS Comm TOMORROW.\n\n<b>          MAX\n</b>\n<b>          I' M AFRAID. I DON'T WANT HER TO TAKE\n</b>\n<b>          YOU BACK TO THE HOME.\n</b>\n<b>          ESTHER\n</b>\n<b>          NEITUER DO 1. WE HAVE TO SCARE HER\n</b>\n<b>          AWAY. WILL YOU HELP ME?\n</b>          Max anxiously nods her head. Esther smiles.\n\n<b>          INT..JOHN'S DEN'- NIGHT\n</b>\n          The room is dark. The girls sneak in, still in their nightgowns,\n          and close the door. Esther turns on a :reading lamp.\n\n<b>          ESTHER '\n</b>          Look for the key to the treehouse.'\n          -Max nods and they start searching the room. Esther rifles through\n          John 's desk. - Nothing.  She looks in a closet. A DARK PLASTIC\n          CASE with Two PADLOCKS on it catches her eye...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          57.\n</b>          Max opens a. keepsake chest and finds SEVERAL KEYS on:a ring. She\n          excitedly shows them to Esther. Esther smiles and takes them. As\n          they're about to leave,.Esther. Uses. She looks back at the-\n          closed closet. Then looks at the keys. Max eyes her curiously.\n          Esther slides a chair over to. the closet and opens it.. She stands\n          on the chair, pulls down the case with the padlocks on it, and\n          sets it on the floor. She tries a couple of.keys. Then -- CLICK.\n          There's a GUN inside. A shiny revolver and a BOX OF AMMUNITION.\n          Esther's face lights up. She.carefully picks up the gun{-turns it\n          over, looks at it. Max's eyes nearly pop out. Esther gives her a\n          sly look, then loads a single bullet, SPINS. the cylinder...\n          .and points the cmn at ax. Ri.aht between the Bye\n\n<b>          ESTHER\n</b>          Do you -want to_ play? -\n          A beat. Max shakes her head. Esther smiles, fingers the trigger.\n          After a long, awful, pants wetting eternity, she lowers the gun.\n\n<b>          ESTHER\n</b>          You're right. We'd better not.\n\n<b>          (BEAT)\n</b>          Not yet. -\n\n<b>          INT. LIVING ROOM -- DAY\n</b>\n          Sister Abigail sits across from Kate and John with a grave look.\n\n<b>          SISTER ABIGAIL\n</b>          When you first asked about adopting\n          Esther, I expressed some misgivings.\n          But I wasn't completely straightforward\n          with you. You see, I love children.\n          I've worked with them my entire life.\n          And the thing about love is that it\n          sometimes clouds your judgement.\n\n<b>          (BEAT)\n</b>          But the truth is that I knew there was\n          something wrong with Esther from the\n          moment I laid eyes on her.\n          Kate sits up, concerned. John bristles.\n\n<b>          - KATE\n</b>          You said you suspected, some kind of\n          abuse.\n\n<b>          SISTER ABIGAIL\n</b>          Yes, but there was something else. It\n          was hard to say chat it was at first.\n          Just-a feeling that she was a\n          profoundly damaged little girl.\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          58.\n</b>\n<b>          SISTER ABIGAIL ' (CONY' D)\n</b>          (beat) s eemed\n          Then I notaced that she - always\n          k_ to. be around whenever ther' wwasa get\n          kind of trouble.- Two girls\n          iii a fight. And there she'd be .\n          Someone would get caught stealing. And ell\n          she'd -\n          myself it Was But I\n          never really. believed it.\n           (beat) l who\n          After you told me about the gir\n          broke her arm, -:E -started wondering\n          again. I called the achool:Esther went\n          to while she was with the Wallaces and\n          asked if there'd been any serious\n          accidents while she.Was there.. One\n          incident was still fresh in everyone's\n          minds. A boy in one of her classes was\n          stabbed in the throat with a pair of\n          'scissors. All the kids-who saw it\n          happen said it was an accident, that he\n          was running with the scissors and fell.\n          But once again, Esther, was there.\n\n<b>          ANGLE - ESTHER\n</b>          is eavesdropping from around the corner. She slips away.\n\n<b>          BACK TO SCENE\n</b>\n<b>          JOAN\n</b>          But none of these things were her\n          fault.\n\n<b>          SISTER ABIGAIL\n</b>          That's; g I was reluc!tant to t\n          anything bef ore. Now'I think th at may a\n          have been a mistake.\n          (off their-looks)\n          Children like Esther, who've spent\n          their entire lives-in institutions,\n            have never had' a chance to 'form normal,\n          lasting bonds.. The longterm effects\n          of 'this- can be devastating.   In the\n          very worst cases, children who fail to\n          form early attachments are unable to\n          learn the difference between'right and\n          wrong. They can lie, cheat, steal ---\n          .or worse -and and have no remorse\n          whatsoever for their actions.' They\n          view other human beings as objects,\n          pawns for their amusement. And they\n          can-be potentially very dangerous.\n\n<b>          INT. ESTHER'S BEDROOM - DAY\n</b>\n           white s gloves, like she's\n          Esther pulls on -a pair of . dinty hurCh services\n          dressing for morninga\n\n<b>          C\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          59.-\n</b>\n<b>          INT. LIVING ROOM'- DAY\n</b>\n          JOEt7-\n          This.doesh't sound like Esther at all.\n\n<b>          SISTER ABIGAIL\n</b>          A severely character-disturbed child\n          can appear to be -completely normal,\n          -even exceptional. It's like they have\n          two faces one-they show the outside\n          world in order'to get what they want,\n          and the other, their true face, lying\n          just beneath the surface.\n\n<b>          INT. MAX'S BEDROOM - DAY\n</b>\n          Max sits on her bed, wearing a jacket and clutching her \"Bello.\n           Kitty\" backpack. Anxious and waiting. Esther enters. -\n\n<b>          - E5T_HBR\n</b>          Let's go.\n\n<b>          INT. LIVING ROOM  - DAY -\n</b>\n\n<b>          KATE\n</b>          What about the orphanage in Russia\n          where she was raised? Wouldn't they\n          have been able to tell?\n\n<b>          SISTER ABIGAIL -\n</b>          I've put in a call to the director\n          there, but she could have easily\n          slipped through the. cracks.\n\n<b>          JOHN -\n</b>          So the bottom line here is that you\n          don't have proof of any of this.\n\n<b>          SISTER ABIGAIL\n</b>          That's true,-I don't. But I believe\n          the circumstantial evidence is enough\n          to warrant taking the next step.\n\n<b>          RATE\n</b>          Which is what? -\n\n<b>          SISTER -ABIGAIL\n</b>          Get Esther out of'the house.\n          Kate and John are stunned.\n\n<b>          JOHN\n</b>          You want to disrupt the adoption over\n          this?!\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          - 60.\n</b>\n<b>          SISTER ABIGAIL -\n</b>          If I'm-wrong, she-can come back home.\n          But you need to get her to a therapist\n          who can tell you what you're dealing\n\n<b>          WITH\n</b>\n<b>          JOHN\n</b>          She's just a kids -  \n\n<b>          SISTER ABIGAIL\n</b>          She's also the sole-survivor of a house\n          fire that killed her last family.\n          (off their looks)\n          It was arson. I did some checking.\n          Someone deliberately set that fire.\n          They-never caught who did it.\n\n<b>          JOHN\n</b>          Wait a minute, you're not suggesting --\n\n<b>          SISTER ABIGAIL\n</b>          Pyromania is one of the warning signs\n          of a character--disturbed child.\n          Rate blanches, realizing:\n\n<b>          KATE\n</b>          Do you think she had something to do\n          with'what happened to Yolanda?\n          A long beat. Sister Abigail hesitates, reluctant to answer.\n\n<b>          SISTER ABIGAIL -\n</b>          The thought that a child could cougnit\n          such a monstrous crime flies in the\n          face of everything I hold dear. But in\n          my opinion, at'a a possibility that you\n          need to take very seriously.\n\n<b>          INT. NOW SHED - DAY.\n</b>\n          Esther slides the door open -on SCREECHING rails and steps inside.\n          Walks over to John's workbench. Looks at the TOOL RACK above it.\n\n<b>          INT. LIVING ROOM - DAY\n</b>\n          Kate and John are stunned by what Sister Abigail has told them.\n\n<b>          JOHN\n</b>          We can take her to Doctor -Browning. -\n          Kate suggested doing that weeks ago.\n          But I don't want to send her away. Not\n          without at least some kind of proof.\n          Sister Abigail.sighs, frustrated. Kate turns to him:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          61.\n</b>\n<b>          KATE\n</b>          But what if 'the doctor says she's\n          dangerous?\n          A beat. He considers, uncertain and emotional.\n\n<b>          JOH1\n</b>          Then I guess we.won't.bave any choice.\n\n<b>          EXT. FOREST - DAY\n</b>\n          Daniel sits near.the brook, sullenly throwing rocks in the water.\n          He hears something behind him and turns. Esther and Max are\n          running off through.the woods, leaves CRASHING under their feet.'\n          Neither of them ree him. He eyes them curiously.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY\n</b>\n          Sister Abigail ie leaving. Rate and John stand by the front door,\n          'troubled, watching her go.\n\n<b>          EXT. PRIVATE ROAD -- DAY\n</b>\n          Esther and Max run toward'the bridge where. the road into the\n          neighborhood crosses the brook. They climb an embankment and\n          crouch. by the bridge abutment, out of breath. Esther looks both\n          ways. There's no traffic. She and Max hide behind the abutment.\n\n<b>          INT./EXT. SISTER ABIGAIL'S CAR - DAY\n</b>\n          Sister Abigail drives away., troubled. She takes a pack of\n          cigarettes from the glove compartment and lights one.\n\n<b>          EXT. PRIVATE ROAD - DAY\n</b>\n          The girlb wait by the abutment. The only sound is the RIPPLING\n          brook. Max looks nervous. Esther gives her a reassuring smile.\n\n<b>          ESTHER -\n</b>          It's going' to be fine. Just wave your\n          arms and make sure she stops.\n          Max nods. Then Esther hears a CAR coming. She peers out'from\n          behind the abutment. It's Sister Abigail's car. Esther quickly\n          ducks out of sight.\n\n<b>          ESTHER\n</b>          Here she. comes. Wait until she gets\n          close.\n          Max nervously peers out from behind the abutment. Esther stands\n          behind her. The car starts across the-bridge. Suddenly --\n          -- sthe pusbes Max it into the Load. stumbles and falls\n          ri ht ,m. on of the _speedï¿½ car.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          62.\n</b>          Sister Abigail gasps and SLAMS on the brakes, 'TIRES SQUEALING,\n          stopping the car mere feet from where Max lies in the road. She\n          frantically. jumps out of the car and kneels next to Max.\n\n<b>          SISTER ABIGAIL\n</b>          Dear Lord! Are you okay, honey?\n          Max looks up at her,-stunned, but unhurt. Sister Abigai1 is taken\n          aback. She recognizes her.\n\n<b>           SISTER ABIGAIL -\n</b>           Max...?! - -\n           A SHADOW falls on Abigail from behind. She turns and looks \"up.\n           Esther looms.over her, a CLAW HAMMER raised above her head.\n          efor is a Abigail Va e a , Esther angrily hits her in tie ' l\n           head as hard as she can with the hammer. CRUNCF#.\n          Max startles,'eyes wide with shock. Sister Abigail falls and lies\n          twitching on the pavement. Eyes staring blankly, one pupil wide\n          from the head trauma. Blood trickles from under her headdress.\n          As Max stares at. the body, paralyzed with fear, Esther scurries\n          into Sister Abigail's car and finds her purse. She flips through\n          her wallet. Cash, credit cards. Takes it all. Finds her rosary\n          beads. Grabs them, too. Then she hurries back to the body.\n\n<b>          ESTHER\n</b>          Help me get her off the road.\n          Max looks up blankly, then staggers .to her feet. They each take a\n          hand and start dragging Sister Abigail's body, but she's heavy and\n          they're little. It's all they can do to slowly move her.\n          Then Esther hears something. There's ANOTHER CAR coming. It's\n          still out of sight through the trees, but closing.\n          Esther and Max hurriedly drag the body, struggling it to the side\n          of the road, just as the car rounds the bend. Esther gives the'\n          body a kick,, sending it rolling down the embankment.\n          The car is almost on them. Esther and Max quickly hide under the\n          bridge.. Esther grabs Max's backpack and pulls u wig _cm.\n          The car reaches the bridge. Esther listens to it cross, tense,\n          gun . ready... . but it passes Abigail's car and continues without\n          stopping. Esther breathes a sigh of relief.\n          Suddenly, there's a CROARING_noise from behind them.' Esther\n          turns. It's Sister Abigail. She's still alive. She's trying to\n          speak, but all that comes out is an awful'MOAN.\n          Esther scowls and grabs the hammer. Sister Abigail looks up at\n          her,' moaning louder. Then Esther brings-the hammer down. CRUNCH.\n          The moans stop. Esther hits her AGAIN and AGAIN.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          63.\n</b>          Ma x 'pr cataton ipes her\n          Se p rettysdr sand white glove harernow splaa ered ith blood.\n           e s t t\n\n<b>          ESTHER\n</b>          Did you get any on you?\n          Max shakes her head, pale and shivering.\n\n<b>          ESTHER\n</b>          Good. Let's get her covered up.\n          Esther starts scooping leaves and debris onto Sister Abigail's\n          corpse. Max just watches fora long beat... then shuffles over\n          like a zombie and helps her. Esther smiles..\n\n<b>          INT. TREEBOUSE - DAY\n</b>\n          Esther is wearing a clean dress. -- She stuffs Max's \"Hello Kitty\"\n          backpack under the looUe floorboard where Daniel.used to keep his\n          weed. Max is huddled in a-corner, still dazed. As the y talk,\n          Esther laces the bloody from\n          Sister\"ibigails car i a lastic grocery bag s ade ties kit.off.\n\n<b>          P\n</b>\n<b>          ESTHER\n</b>          If you tell on me, you'll get in\n          trouble, too.\n\n<b>          MAX\n</b>\n<b>          YOU, TRICKED ME.  \n</b>\n<b>          ESTHER.\n</b>          That doesn't matter. 'They'll send you\n          to jail just for helping me bury her.\n          Max starts to cry. Esther moves closer, comforting.\n\n<b>          ESTHER\n</b>          She wanted to take me away from you.\n\n<b>          (BEAT)\n</b>          Now we eau be together forever.\n\n<b>          EXT. TREEHOUSE -- DAY\n</b>\n          Daniel heads home on the path through the forest. Be hears a\n          NOISE up ahead and sees Esther and Max emerge from the treeh ouse.\n          He quickly hides., 'watching. Esther locks the treehouse_and looks\n           around, see him. She and down and walk home\n          hol d din in g pe ers out at them...\n          g hands. Daniel\n\n<b>          PARK - DAY\n</b>          The usual suspects are here. Kids playing. Moms watching. The\n          Homeless Guy with.his shopping cart, rooting through a trash can.\n          A VENDOR selling a SpongeBob popsicle from a cart. CAMERA FOLLOWS\n          the SpongeBob pop as. the vendor hands it to a little girl...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          64.\n</b>          It's Esther. She smiles  at the. vendor and walks away. She- spots\n          the Homeless Guy across the park and casually heads toward him.\n          As she approaches, we see that she's carrying the -plastic yrocery\n          bag with the bloody hammer and sister Abigail's things in t.\n          She carefully looks around to snake sure nobody is watching, then\n          nonchalantly tosses the incriminating bag into the Homeless Guy's\n          shopping cart and keeps walking, sucking on her SpongeBob pop...\n\n<b>          INT. LIVING ' ROOM -  DAY\n</b>\n          Rate hangs up the phone and turns to John.\n\n<b>          RATE\n</b>          She's canceling some appointments-so we -\n          can get her in-tomorrow.\n           They hear Esther HUMMING upstairs and exchange a disgiuieted look.\n\n<b>          IN . BATHROOM -- DAY\n</b>          Esther HUMS O.S. -Her black velvet ribbons have been removed and\n          laid out in a row on the counter.' CAMERA MOVES to the bathtub,\n          where Esther is taking a bath. The water is faintly red. -She's\n          scrubbing under her fingernails. -Humming pleasantly to herself.\n          And now we see what the ribbons have been covering: the has\n          t ick, knotte t h e wa x u ht.r neck and -wrists.\n\n<b>          INT. JOHN'S DEN - NIGHT\n</b>\n          John sits on his. desk, eyeing Daniel--wearily.\n\n<b>          JOHN\n</b>          Esther and Max? You saw them?\n\n<b>          DANIEL\n</b>          Oh-huh.\n\n<b>          JOHN\n</b>          The treehouse is still locked.\n\n<b>          DANIEL\n</b>          Esther had the-keys.\n\n<b>          JOHN\n</b>          You mean these keys here?\n          He goes over tothe keepsake chest and opens it.. The KEY RING is\n          there. He holds it up. Daniel flusters..\n\n<b>          JOHN\n</b>          You're not lying to get them in-\n          trouble,.are you? '\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          65.\n</b>\n<b>          DANIEL\n</b>          No, I swear!\n\n<b>          JOHN\n</b>          (sighs, exasperated)\n          I don't know what's got into you\n          lately. Just go to your room.\n          Daniel leaves, dejected...\n\n<b>          IN THE HALLWAY\n</b>           and trudges upstairs. fe doesn't see Esthe emï¿½ eras from j -\n          a sh dows behin hiï¿½- She glares angrily, after him...\n\n<b>          BACK IN THE DEN\n</b>          Alone now, John looks at the.key ring, considering. Be goes to\n          the closet, looks at the'gun case. Takes it down. Unlocks it...\n          The gun.is right where it belongs. He sighs and closes the case.\n\n<b>          INT. DANIEL'S BEDROOM - NIGHT\n</b>\n          Daniel is in bed, sound asleep The doorknob turns, the door\n          CREAKS open. Someone sneaks into his room, approachinbglh1ss-bbed.\n          Turns on the bedside light, Daniel stirs, squinting,\n          It's Esther. Daniel looks up at her, confused. Ruaaenlv,,shs\n          fistful gf i hair and SLAM bis hea hMk.Aqg__inst the\n          Before he can cal ou ; $he w o a-PAI OF SCISSORS\n          an plunges them tows d his face---\n          Daniel gasps, but the gleaming point of the scissors stops short,-\n          hovering less than an inch from his wide, staring eye.\n\n<b>          ESTHER\n</b>           ssshhh.\n\n<b>           -\n</b>           Esther leans in, her face wild-and terrifying. Daniel lies there\n           breathless, paralyzed with fear. -The. scissors drift from his eye,\n           his between his legs.\n          holds fast by his ha ir. er'voiceis an'e\n           H il, ssibant bhiss\n\n<b>          ESTHER\n</b>          You te.11 anybody what you saw and I\n          will cut your hairless little prick off\n          before you even figure out what it'-s\n          for. Do you understand me?\n          She rapidly cuts the air with the scissors -- SNIP-SNIPI Daniel\n          frantically nods his head. She twists his hair again.\n\n<b>          ESTHER\n</b>          ,= -it\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>           \n</b>\n<b>          66.\n</b>\n<b>          N DANIEL\n</b>           I won't tells I won't tell, T xomisel p\n           She holds him for a beat, savoring his fear. A DABX STAIN seeps\n           through the bedspread. Esther' sees it and grins.\n\n<b>           ESTHER\n</b>           You pissed yourself.  \n           Daniel is crying, humiliated, belplesa.,'too terrified to dare make\n           a sound. Finally, she releases him and turns off the light. As\n           ick ad :it bWgan it she's go . up in\n           a b all and his faa in his pillow stifl\n           e his Bobs\n\n<b>           INT. DOCTOR BROWNING'S OFFICE - WAITING ROOM - DAY.\n</b>\n           A SECRETARY sits behind a desk. Kate flips through a magazine.\n           m John glances at his watch. Rate gives him a\n           moment later, Dr Browning emerges from r office u with Esther.\n\n<b>           E\n</b>\n<b>          ESTBER\n</b>          It was nice talking to you, Alice. I\n          I hope we can be friends.\n\n<b>          DR. BROWNING\n</b>          I'd like that.\n          (to.Kate and John)\n          You can come on in-\n\n<b>          INT. DOCTOR BROWNING'S OFFICE - DAY\n</b>\n          Dr. Browning's manner is serious. Kate and John sit, anxious.- '\n\n<b>          DR. BROWNING\n</b>          o Well, let's start with what youca me\n          here for. You don't have anything'\n          be worried about with Bsther.\n          John breathes a sigh of relief. Kate gives-a dubious smile.\n\n<b>          KATE\n</b>          She's not dangerous?\n\n<b>          DR. BROWNING\n</b>          No, of course not.\n\n<b>          JOHN\n</b>          Thank God.\n\n<b>          DR. BROWNING\n</b>          It's. not all good news . You do have a\n          serious problem in. your home..\n\n<b>          (BEAT)\n</b>          But the real issue is with you, Rate\n          Kate reacts, stunned.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          67.\n</b>\n<b>          INT. DOCTOR BROWNING'S OFFICE -WAITING ROOM - DAY\n</b>\n          Esther. fidgets, impatient. She turns to the Secretary:\n\n<b>          ESTRER\n</b>          May I go to the restroom?\n\n<b>          INT. DOCTOR BROWNING'S OFFICE.- DAY\n</b>\n          Dr. Browning continues. Kate' can't believe what 'she's hearing:\n\n<b>          DR. BROWNING\n</b>          I was able to coax her into admitting\n          that there's been some tension between\n          the two of-you. She's really tr!ing\n          very hard to please you. The problem\n          is that you're blocking her attempts-to\n          attach-with you. That's why whenever\n          something bad happens, you blame her,\n          whether it's really her fault or not.\n\n<b>          KATE\n</b>          But that's not what's.been happening.\n\n<b>          DR. BROWNING\n</b>          I doubt you're even aware that you're\n          doing it. But subconsciously you t aunt\n          her to be bad because' demonizing her is\n          your way of covering your own feelings _\n          of inadequacy as a mother.\n\n<b>          KATE\n</b>          I don't feel inadequate.\n\n<b>          DR. BROWNING\n</b>          But you do have doubts. You worry that'\n          you Could relapse.\n\n<b>          KATE\n</b>          What does that have to do with'Esther?\n\n<b>          DR. BROWNING\n</b>          Frankly, everything. Your guilt over\n          what happened with Max is preventing-\n          you from bonding with Esther.\n          Kate turns to John, aghast, but he's taking this very seriously.\n\n<b>          DR. BROWNING\n</b>          It's made you doubt your fitness as a\n          mother. And that terrifies you. So\n          you're having trouble with Esther,\n          alonV comes Sister Abigail with these\n          stories about her being some kind of\n          monster and you believe them because\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          68.\n</b>\n<b>          DR. BROWNING (CONT.'D)\n</b>          it f s easier than with yojW fear\n          ,that there's something hwrong th you.\n\n<b>          RATE .\n</b>          What the hell did she tell you?.\n\n<b>          DR. BROWNING ...\n</b>          Let's not m4ke this about herana m a d dne\n          real progress with her today\n          tell you with complete certainty that\n          Esther is not to blame here.\n\n<b>          INTERCUTS\n</b>\n<b>          INT. RESTROOM -- DAY\n</b>\n          in a C AMERA MOVES IN on one- , o 131sthex is\n           in a ba11 muttering t herself, her eyes glassy and star\n\n<b>          ING\n</b>\n<b>          ESTEER\n</b>          She didn't see. She doesn't know. She\n          doesn't knout Ahitl\n           She starts POUNDING the walls-of stall th her fists. We CUT\n          between her a Dr.-B rowning talking to ltate\n\n<b>           D =\n</b>\n<b>          DR. BROWNING\n</b>          She's an extremely bright, thoughtful,\n          sensitive little girl going through a\n          very challenging time.\n          Esther clutches her head, rocking back and forth.\n\n<b>          ESTHER\n</b>          Goddamn, coaksucking bitch!! Thinks\n          she knows well Doesn't know shit!!\n\n<b>          DR. BROWNING\n</b>          You just have to learn to be more\n          patient. .You're really very lucky to\n          have her.\n\n<b>          END   INTERCUT :\n</b>          Esther's fit has passed. She neatly composes herself and emerges\n          from the stall... and sees that there's a WOMAN at the sink. She\n          eyes Esther warily. Probably heard everything. Esther hesitates ,\n          then walks right by with. her nose in the air.\n\n<b>          TNT. GARAGE -. DAY\n</b>          John pulls the car in out of the RAIN. They get out and Esther.\n          goes Inside. When Kate is sure she's out of earshot:\n\n<b>          KATE\n</b>          Thanks for the support back there.  \n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          69.\n</b>\n<b>          JOHN\n</b>          Hey, I'm not a psychiatrist. And a lot\n          of what she's saying makes sense.\n          Before she can respond, Nate's cell phone RINGS. She turns away\n          from John' and'answers it. He sighs and goes inside.\n\n<b>          KATE -\n</b>          Hello?\n\n<b>          SISTER JUDITH (V.O.)\n</b>          is this Mrs. Coleman?\n\n<b>          KATE\n</b>          Yes. Who's calling?\n\n<b>          SISTER JUDITH (V:O.)\n</b>          This is Sister Judith from Saint\n          Cabrini's. I'm sorry to bother you.\n          Did-Sister Abigail make.it to 'her\n          appointment with you yesterday?\n          T tXNDER rolls.\n\n<b>          EXT. PRIVATE ROAD - NIGHT\n</b>\n          CRIME SCENE TAPE flutters in the rain. POLICE CARS are parked-on\n          the roadside, lights FLASHING. DETECTIVES shine flashli.ghts'Under\n          the bridge. sister Abigail's body- has been- discovered.\n\n<b>          INT. LIVING ROOM - DAY -\n</b>\n          Kate and John sit across from a POLICE DETECTIVE and TWO UNIFORMED\n          PATROL OFFICERS. Kate and john-are still in shock.\n\n<b>          JOHN\n</b>          We'll help in any way we can. We at\n          least owe her that much.\n\n<b>          KATE\n</b>          Do you have any idea who could have\n          done this? '\n\n<b>          DETECTIVE '\n</b>          We have .a suspect in custody based on\n          an anonymous -tip. We're just trying. to -\n          place ham at the time we think the -\n          murder took place. -\n\n<b>          JOHN\n</b>          Who is it?\n\n<b>          DETECTIVE\n</b>          I can't tell you that right now. But\n          he was found with the murder weapon,\n          along with some cash and credit cards.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          70.\n</b>\n<b>          JOHN\n</b>          Jesus..:: at kind of sick' monster\n          carjacks a nun?\n          Kate glances up, sees Esther crouched on the stairs, watching...\n          INT. fAMiLY ROOM - DAY\n          Daniel sits in a big recliner, sullenly playing a VIDEO GAME SHOOT-\n          EM-OP. Kate is researching- on the Internet. We get CLOSE SHOTS\n          of some of her Google.results, INTE Ctfs with Daniel BLASTING AWAY\n          at alien baddies, his face angry and intense:\n          \"Character-disturbed Children.\" -BLAME.-BLAME-BLAME \"Antisocial\n          Personality Djsorder.\" PL f-BLAMI- \"C ren o Kfll.\"\n          Esther enters holding Max's handy leadin her around like a pet.\n          Max numbly follows. They walk up to Daniel'in the recliner.\n\n<b>          ESTHER\n</b>          We want to sit there.\n\n<b>          KATE\n</b>          Esther, Daniel was there first. -\n          Daniel eyes Esther. Wary, but defiant. She sighs and makes a\n          -\"cutting\" motion with two fingers. Daniel brusquely turns off th e\n          game and gets out of the chair. - As' he leaves, Kate calls out,\n\n<b>          KATE\n</b>          Daniel? Daniel?\n          He ignores her and stomps upstairs. She watches him, concerned.\n\n<b>          INT. JOHN'S DEN - NIGHT\n</b>\n          Kate shows John some pages she's printed out from the Internet.\n\n<b>          KATE\n</b>          This is what Sister Abigail was telling\n          us about. Character-disturbed\n          children, 'Look at the, symptoms.\n\n<b>          (READING)\n</b>          \"Superficiallycharming. Difficulty\n          making and keeping frinnds. Cruelty to\n          pets. Bossy and controlling. Overly\n          affectionate with strangers.\"\n\n<b>          JOHN\n</b>          \"Extended period of bedwetting. Speech\n          pathology.  Abnormal eye contact.\" She\n          doesn't have half of these.\n\n<b>          KATE\n</b>          I still think Doctor Brow\n          have missed something. iner couldd\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          71.\n</b>\n<b>          RATE (CONT'D)\n</b>          have just told her what she wanted; to\n          hear. Look.\n          (flips ages, reading)\n          \"Character-disturbed children are\n          adroit manipulators. They can be\n          exceptionally charismatic, oftentimes\n          playing people off one another to get\n          what they want.\"\n\n<b>          JOHN\n</b>          save you showed this to Doctor.\n          BÂ±owiiing?\n\n<b>          KATE\n</b>          (hesitates)-\n          I'm not 'seeing her anymore..  \n\n<b>          JOHN\n</b>          You're not going to therapy? When did\n          you decide that?\n\n<b>          SATE\n</b>          When do you think?\n          John sighs. A tense-beat.\n\n<b>          JOHN\n</b>          I know you were. upset. But we have to\n          at least consider the possibility that\n          she's right about this.\n\n<b>          KATE\n</b>          No, we don't. Why does everybody\n          around here get the.benefit of the\n          doubt fro m you except me?\n\n<b>          JOHN\n</b>          That's not true. I'm just..worried\n          about you, that's all. We can hire\n          someone to help you with the kids if\n          it's getting to be too much.\n\n<b>          KATE\n</b>          I don't need help. All I want is for a\n          doctor who knows what they're doing to\n          give us a second opinion.\n\n<b>          INTERCUT:\n</b>\n<b>          INT. ESTHER'S BEDROOM - NIGHT\n</b>\n          All the lights are out except for the BLACK LIGHT in the aquarium.\n          Bather is touching up the PAINTING OF THE MOTHER LION we saw when\n          -we first met her, but we can't see what she's doing to it. The\n          black light causes some of the paints on her palette to fluoresce.\n          John and Kate's VOICES carry, up through the heating vent:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          72.\n</b>\n<b>          JOHN\n</b>          We're-not going to.keep taking her to\n          doctors until you hear what you want to\n          hear.  \n\n<b>           KATE -\n</b>          That's not what I'm trying to dal I\n          -want this to work just as much as you\n          do, but there are. serious questions.\n          that we still don't havethe answers\n          to. If Sister Abigail was right about\n          Esther,. then people are dead because of\n\n<b>          HEAL\n</b>\n<b>          JOHN -\n</b>          She didn't really believe that.\n\n<b>          RATS\n</b>          She didn't want to believe it. But she\n          was worried enough-to think we should\n          put her in foster care until we found\n          out for sure.\n\n<b>          JOHN\n</b>          For all, her good intentions, sister\n          Abigail was not a trained psychologist.\n          She'had certain suspicions about Esther\n          and they turned out to be wrong. Why\n          is can't you accept that?\n\n<b>          KATE\n</b>          (a beat, thin)ts)\n          What if somebody else thought there was\n          something wrong with her? Like the\n          director of the orphanage in Russia?\n          Esther stops painting and listens, suddenly apprehensive.\n\n<b>          KATE\n</b>          if it's a dead end, I'll drop it. - But\n          if they say the same thine, then we'd\n          have to get.a second opinion.\n          John considers. He doesn't want to be unreasonable. He nods.\n\n<b>          JOHN\n</b>          All right.- See what you can find out.\n\n<b>          END INTERCUT:\n</b>          Esther' fumes. She angrily throws her painting across the room.\n          rNT. KATE AND JOHN'S BATHROOM - MORNING\n          John-is shaving with his shirt off. He sees Esther in the\n          reflection, slyly watching him. She smiles at him.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          73.\n</b>\n<b>          .  ESTHER\n</b>          Will, you take me to school today?\n\n<b>          JOHN\n</b>          You'll have to get ready early,\n\n<b>          EST=\n</b>          I .don't mind.\n\n<b>          INT. LIVING ROOM - DAY\n</b>\n          Kate is on the. phone. She has pen and -paper ready to take notes.\n\n<b>          KATE\n</b>          Sister Judith? Hi, this is Kate\n          .Coleman. I teas.wondering if you'd\n          heard from anyone at the Sludianka\n          Orphan's Shelter in Russia. sister\n          Abigail said that...- Oh, you did? _\n          (listens, troubled)\n          What do you mean?... Well, I don't\n          understand. How could they not have\n          any record of her being there?\n\n<b>          (LISTENS)\n</b>          .Yes, please. Call me the moment you\n          hear anything. Thank you.\n          She hangs up, disturbed.\n\n<b>          INT. JOHN'S CAR - MORNING\n</b>\n          John drives. Esther rides next to him. She SNIFFLES and he\n          realizes that she's holding back tears.\n\n<b>          JOHN\n</b>          What's the matter?\n\n<b>          ESTHER\n</b>          I don't want to go to school.\n\n<b>          JOHN\n</b>          Why not?\n\n<b>          ESTHER  \n</b>          I hate it. Nobody likes me there.\n          Nobody ever likes me.\n          She stares forlornly out the window. Big sad eyes. John sighs.\n\n<b>          JOHN\n</b>          You want-to play hooky?\n          (off her look)\n          I can call in- sick and we'll go to -the\n          zoo. What do you think?\n          Esther smiles through her tears.\n\n<b>          1\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          74..\n</b>\n<b>            ESTHER\n</b>          I'd like that very much.\n          EXT. ME TARY SCHOOL  r MORNING\n          Kate drives up the steep hil1 in front of Daniel and Esther's\n          school and stops at the end of a long'line of parents dropping\n          kids off. Daniel. gets out without looking at Kate.\n\n<b>          KATE\n</b>          Daniel, wait a minute.\n          He hangs back. Rate gives him and Max a concerned-.look.\n\n<b>          RATE -\n</b>          How are you guys getting along with\n          Esther? - ,\n          Daniel freezes. An apprehensive look passes between him and Max.\n\n<b>          DANIEL\n</b>          Fine, I guess.\n\n<b>          KATE\n</b>          Does she ever make you guys feel\n          uncomfortable or do things you know\n          she's not supposed to? Has she ever\n          hurt either of you?\n          Daniel wants to say something, but the frightened look on Max's\n          face stops him. Rate realizes she's struck.a nerve.\n\n<b>          KATE\n</b>          Please. You can tell me anything.\n\n<b>          DANIEL\n</b>          -I gotta gu.\n          Before Kate can stop -him, he closes the car door and runs off.\n\n<b>          EXT. ZOO -- DAY\n</b>\n          John and Esther walk by the LION exhibit.- She takes John's hand\n          and presses it to her cheek.\n\n<b>          ESTHER\n</b>          You don't know how-long I've waited for\n          a 'daddy just. like you.\n\n<b>          JOHN\n</b>          And a monany, too. Right?\n          Esther hesitates. John notices. She gives a sad shrug.\n\n<b>          ESTHER\n</b>          I don't think !'Tommy likes me very much.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          75.\n</b>          John is taken aback. An awkward beat.-\n\n<b>          JOHN\n</b>          That's not true..- Mc=my loves 'you.\n\n<b>          ESTHER\n</b>          It's all right. I understand if she\n          doesn't. It must be difficult to love\n          an adopted child as much as- your own..\n\n<b>          JOHN\n</b>          Sweetheart, .you are just as much a part\n          of this family- as Danny. and Max are.\n          Mommy doesn't love'you any less because\n          you're adopted. Do you understand?\n          She nods, but doesn't look convinced. John thinks.\n\n<b>          JOHN\n</b>          Why don't you do something special for\n          her? So she can see what a good girl\n          you are. I'll bet she'd like that.\n          Esther's face brightens.\n\n<b>          EST LER\n</b>          That's a wonderful idea. I think I\n          know just what I'm.going to do, too.\n\n<b>          INT. KITCHEN - NIGHT\n</b>\n          After dinner. Kate is loading the dishwasher. John is brig ing\n          in dirty dishes from the dining room. Esther enters, all smiles.\n          Hands hidden behind her back. John gives Kate an expectant smile.\n\n<b>          ESTHER\n</b>          I have a special surprise for you,\n          Mommy.\n          Kate eyes her warily. No idea what to expect.\n\n<b>          KATE\n</b>          You do?\n\n<b>          ESTHER-\n</b>          I picked this flower just for youl\n          It's Kate's memorial orchid. Kate gasps. John is horrified.\n          Kate reaches for the flower.\n\n<b>          KATE\n</b>          Estherl Put that down --l\n          Esther laughs and playfully pulls it away. Kate grabs her by the\n          wrist and Esther suddenly drops the flower, SHRIEKING in pain.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          76.\n</b>\n<b>          ESTHER-\n</b>          You're,hurting me!\n           's eaction. Esther runs\n          from the room,-cr her wri wrist-\n           e ying, and startled clutching Esther\n\n<b>          JOHN\n</b>          What the hell did you do to her?\n\n<b>          KATE\n</b>          I just grabbed her arm!\n           aohn hurries after Esther. Kate hangs back, picks the orchid-up\"\n          from off the floor. it's ruined.\n\n<b>          INT. FAMILY ROOM - NIGHT\n</b>\n          Esther sits. on the nofa, still crying. john comforts. her. Kate\n          looks in on them. John shoots her an angry look.\n\n<b>          INT. WORK SHED.- NIGHT\n</b>\n          Darkness. Esther slips inside, closes the door, turns on a light.\n          Goes to the workbench. There's a VICE bolted to it. She finds\n          some rags and wraps them around her wrist where Rate grabbed her.\n          Then she places her wrist in the vice, puts the handle of a\n          SCREWDRIVER between her teeth, and bites down on it.\n          She takes a couple of deep breaths and sta s clo in the yicg of\n          her are. Grimacing in agonyy screwdriver clan ed between her\n          teeth against the pain, she twists the vice tighter and tighter..\n\n<b>          INT. KITCHEN - NIGHT\n</b>\n          Rate sits at the table. John has calmed down, but is still angry.\n\n<b>          KATE\n</b>          She knew what it meant to me. She did\n          it on purpose.,\n\n<b>          JOHN\n</b>          It wasn't even her idea.\n          (off her look)\n          I'm the one who told her she should try\n          to do something nice for you.\n          He leaves.\n\n<b>          INT.\" ESTHER'S BEDROOM - NIGHT\n</b>\n          It's late, The room is dark.Esther plaintively calls out:\n\n<b>          ESTHER\n</b>          Daddy! Daddy!\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          77.\n</b>          The door opens. John,.blearily -enters in his pajamas.\n\n<b>          JOHN\n</b>          what in it, sweetheart?\n\n<b>          ESTHER\n</b>          My arm huits .'\n\n<b>          JOHN - -\n</b>          Okay. Let me see.\n          He turns on a bedside lamp and sits on the bed. She pulls up.hex`\n          sleeve, cringing. Heir wrist is mottled with HORRIFIC B I\n\n<b>          INT. EMERGENCY ROOM - CURTAIN AREA -- NIGHT\n</b>\n          A camera flash POPS. Esther is in a hospital gown (still wearing\n          her black ribbons) while a SOCIAL WORKER photographs the bruises.\n\n<b>          , TNT. EMERGENCY ROOM -- EXAM ROOM - NIGHT\n</b>          Rate and John sit across from a harried ER DOCTOR. An x-ray of\n          Esther's arm is clipped to a light box. _\n\n<b>          ER DOCTOR\n</b>          It's a hairline fracture in her radius.\n\n<b>            KATE\n</b>          I swear, I barely touched her.\n\n<b>          ER DOCTOR\n</b>\n<b>          (SKEPTICAL)\n</b>          You'll need to talk to the social -\n          worker about that. She's going to come\n          in here- and ask you some questions.\n\n<b>          JOHN\n</b>          But.it was just an.accident.\n\n<b>          ER DOCTOR\n</b>          It's routine. We're required by law to\n          file. a report. Child Protective\n          Services will be in touch to schedule a\n          follow-up visit at your home.\n          Kate is shocked. John shoots her a dirty look.\n\n<b>          TNT. FOYER --NIGHT\n</b>          Home from the hospital. It's very late. The kids are wearing\n          coats over their pajamas.. Esther's arm is in a fiberglass cast.\n          John is carrying Max, who has fallen asleep..\n          As they start upstairs, Kate reaches out to John. He hangs back.\n          Daniel and Esther go to their rooms. When they're gone:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          78,\n</b>\n<b>          KATE\n</b>          You know I would never hurt any of the-.\n          kids on purpose.\n\n<b>          JOHN\n</b>          I know. It's not what you do on\n          purpose that scares me.\n          Kate watches him go. ..Be turns away and takes Max upstairs.\n\n<b>          .1\n</b>\n<b>          TNT. MUSIC ROOM - NIGHT -\n</b>          Kate site curled up on the window seat by the planter, holding the\n          wilting orchid and sobbing inconsolably, old wounds re-opened...\n\n<b>          INT. KATE AND JOHN.''S BEDROOM - NIGHT\n</b>\n          Dark. John is asleep, alone in the bed. The door is ajar.\n          Esther appears in the.doorway. She peers in, watching him sleep.\n          After a beat, she gathers her courage and quietly enters,\n          tiptoeing toward the bed. She pulls back the covers and.climba in\n          next to him. John doesn't stir. Esther curls up beside him.\n\n<b>          INT. KATE'S MINIVAN - DAY\n</b>\n          It's raining. Rate sits in the parked van. No sound except\n          RAINDROPS TAPPING the roof. She's looking out at something.\n          It's the LIQUOR STORE she drove by earlier. She's-parked in front\n          of it, staring at it through-the rain-streaked windshield...\n\n<b>          INT. LIQUOR STORE - NIGHT\n</b>\n          Kate puts TWO BOTTLES OF WINE on the counter. The CASHIER rings\n          them up. She's anxious, guilty, already hating herself.\n\n<b>          KATE\n</b>          We're having guests over for dinner.\n          The Cashier nods. Like be gives a shit. Kate lowers her eyes.-\n\n<b>          INT. KITCHEN - DAY\n</b>\n          The two wine bottles sit on the kitchen counter. One bottle is.\n          open, a GLASS already poured. But Kate's not drinking it. She's\n          just standing these, arms folded, looking at it. The house is.\n          quiet. She's alone here. Only her demons to keep her company-\n          A long moment of. awful indecision passes,, Kate paralyzed. Then\n          she looks up, her gaze moving past the wine glass to the window.,\n          Through it, she can see the backyard. It's the swimming pool that\n          holds her eyes, its cold-surface rippling in the rain. But- she's\n          seeing something else there, something awful. Impossible to know-\n          what she's thinking, but whatever it Is, it moves her to action:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          79.\n</b>          She, abruptly grabs the glass and quickly empties it in the sink\n          before she-can change hex mind. -Then she grabs the. open wine'\n          bottle and pours it all down the drain. She runs the water and\n          scrubs the sink with her fingertips, removing every trace. Tosses\n          the empty bottle in the trash and ties up the garbage bag.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY\n</b>\n          Kate hurries out in the rain and stuffs the kitchen trash in the\n          garbage can, burying it under-another bag.\n\n<b>          INT. KITCHEN - DAY -\n</b>\n          Kate re-enters, dripping wet. There's still the other wine\n          bottle. The unopened one. She 1}esitates.\n\n<b>          INT. KATE AND JOHN'S BEDROOM'  - DAY\n</b>\n          Rate's.in the walk-in closet. She hides' the wine bottle in a\n          cubby in her shoe rack and turns out the light.\n\n<b>          INT. KATE'S MINIVAN -- MORNING\n</b>\n          Driving the kids to school. Kate looks drawn and weak. Daniel\n          and Max stare off into space. Esther holds a stack of her\n          paintings in her lap, obliviously prattling:\n\n<b>          ESTHER\n</b>          I can't wait for show-and-tell. I hope\n          Mrs. Grosse. likes my paintings. I did\n          one especially for her..\n          .Nobody responds. Kate's blocking her out. Esther doesn't mind.\n\n<b>          EXT. ELEMENTARY SCHOOL/INT. KATE'S MINIVAN - MORNING\n</b>\n          Kate drives up the hill and pulls to the curb. Daniel gets out,\n          but'Esther struggles, her wrist cast making her clumsy, and she\n          awkwardly fumbles her paintings.. They land in the gutter and\n          start-blowing away. She gives Kate a horrible,-pleading-look\n\n<b>          ESTHER\n</b>          Moumiy! My paintings!\n          Kate eyes her accusingly.\n\n<b>          KATE\n</b>          You dropped them on purpose.\n\n<b>          ESTHER  \n</b>          No, I didn't! I swear!. -\n          Kate doesn't believe it for a second, but sees a CROSSING GUARD\n          and a FEW KIDS hurrying to grab the paintings as they're carried\n          off by the wind. Kate shoots Esther a dirty look, then sets the\n          parking brake with an exasperated sigh and gets out to help...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          80.\n</b>          acti But, the second-Rate is out of the van, Esther springs tut\n           like a snake that's been poised to strike. sh cï¿½ put s s then\n          gear shit in'neutral andggrabs the parki ng her\n          .an alarmed look. Esther smiles at her... releases t braka.\n          Daniel sees Esther jump out of the van, just ag it starts 1 roll\n          ._ ba hil\n\n<b>          DANIEL\n</b>\n<b>          MOROI\n</b>          Frazzled, Kate turns to. Daniel.. He points. to the van.\n\n<b>          KATE\n</b>\n<b>          SHITT\n</b>          she hurries after it, but it's already.inoving too fast, picking up\n           speed, rolling into oncoming e goes into a panic-\n           fueled 'run,. sure erupting into ic., Kat\n\n<b>           KATE\n</b>\n<b>           MAXI\n</b>          Drivers w van a\n           of s Parked a ars eSHEERING gerssi door.\n           c d\n           Max is trapped in her car seat, helpless, eyes wide in mute\n           terror,.as the minivan clears the parked cars, head ed for the\n           intersection at the bottom of the hill.. Kate chases it, powsrlen s\n           to do anything but watch.-\n\n<b>           KATE\n</b>\n<b>           MAAAAAX!1!\n</b>           The minivan cams into the intersection. Tires S â\u0096º horns\n           cars yrgave , and s = hal . T T3 sh - b\n          all and 0MV into a streetlight on the opposa.t e corns .\n          Kate frantically dashes across the street, hysterical with fear,\n          and throws open the back door. Max is crying and terrified, but\n          safe. Kate 'scoops Max into her arms, clutching her to her chest.\n          It's okay, baby. It's okay, you're all\n          right. Mo_irimy' s got you...\n\n<b>          BACK AT THE SCHOOL\n</b>          A crowd has out front; horrified,. watching\n           breathlesslyguntilehe sees pull uï¿½ Max lsafe y ï¿½ the van.'\n           A wave of relief washes over him. Then he whirls angrily, looking\n           for Esther. Be blithely headed to\n           class, paintings hertarmj,gas if nothing ha pened.\n\n<b>          P\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>          Bl.\n\n<b>          INT .'. LIVING ROOM - NIGHT\n</b>           Rate sits across from John and Dr. Browning.The mood fa grim:\n\n<b>           KATE\n</b>          I set the brake. . Bven if I hadn'tr the\n          police said it wouldn't have.:rolled\n          unless it was put in neutral.\n\n<b>          DR. BROWNING.\n</b>          But Max says she didn't see Esther do\n          anything wrong.\n          Max is cover.ng for her. And X don't\n          think it's the first time.\n\n<b>          DR. BROWNING\n</b>          It also-wouldn't be the first time that\n          you've tried to blame Esther for.\n          something that was really your fault.\n\n<b>          XATE\n</b>          This. isn-'t all in my head. Sister\n          Abigail was right. There is something\n          wrong with Esther. And I don't care\n          anymore if I can't prove it. I'want\n          her out of this house.\n          John and Dr. Browning exchange a dark look.\n\n<b>          DR. B' OWNING\n</b>          So you're at a place where you would\n          actually let somebody take her away?\n\n<b>          KATE\n</b>          I'll do whatever I have to,do to\n          protect my children.\n\n<b>          JOHN\n</b>          56 will 1.\n          (re: Dr. Browning)\n          That's why she's here.\n          something in his voice makes Kate apprehensive. An uneasy beat.\n\n<b>          DR. BROWNING\n</b>          I have an opening held for you at a\n          residential rehabilitation clinic about\n          forty-five miles from here. They\n          specialize in extended treatment for\n          women who are relapsed alcoholics.\n          Kate is stunned silent. She gapes at. them. with a mix of anger and\n          fear, unable to stop' a flash of guilt. How much do they know...?.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          .82..\n</b>\n<b>          KATE .\n</b>          What are you talking.about?\n\n<b>          -JOHN\n</b>          I'll stand by you through this for as\n          long as it takes. My mom'a already\n          agreed., to 'help look after the - kids . .\n\n<b>          RATS\n</b>          Tell her not to bother.\n          (to Dr. Browning)\n          I'd like you to leave now.\n\n<b>          JOHN\n</b>          Kate, don't.\n          John stands and takes something from inside the sideboard. Ile\n          : sets it on the coffee table between them...\n          qtr, s\n          the wine bottl g she hid \" he closet. Kate is stricken.\n          She looks at it like it was a poisonous spider.\n\n<b>          JOHN\n</b>          The girls found it while they were\n          playing in your. closet.\n\n<b>          KATE\n</b>          The girls?\" You mean Esther found it.\n\n<b>          JOHN\n</b>          Yes, Esther found it. Does that make a\n          difference? Is she lying?\n          A beat. Kate's silence-is answer enough.\n\n<b>          KATE\n</b>          I didn't... I bought two bottles. I\n          poured the other one down-the sink.\n\n<b>          JOHN\n</b>          But not this onie.\n          Again, no answer necessary.. Kate looks defeated, tears welling.\n\n<b>          KATE\n</b>          I'm not going to rehab.\n\n<b>          JQHN\n</b>          I'm not going to leave you-alone with\n          the kids again until you do. - .\n\n<b>          KATE\n</b>          I haven't had a drink in almost a year.\n          John sighs, frustrated.- Dr. Browning intervenes, her voice\n          infuriatingly even. and calm.'\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          83.\n</b>\n<b>          DR. DROWNING\n</b>          Relapse is very common in early\n          sobriety. We can help you. But not\n          until you drop the charade. -\n\n<b>          KATE\n</b>          It's not a charade. I wanted to- drink\n          i t. You have no fucking idea how.badly\n          I wanted to drink it. But I didn't.\n          (off John's look)\n          I know 1 should have told you..  I was\n          just afraid of what you'd do.\n\n<b>          JOHN\n</b>          I wanted you to come to me. That's why\n          ,I didn't confront you with it last\n          night. If Max had gotten hurt this\n          morning, it. would've been because I\n          trusted you tell me if there was a\n          problem.\n\n<b>          RATE\n</b>          What happened this morning had nothing\n          to do with this!\n\n<b>          JOHN\n</b>          l f ow do you expect me to believe that?\n\n<b>           KATE\n</b>          Max and Daniel are the only reason I'm\n          still sober. I would never do anything\n          that would hurt them.\n\n<b>          DR. BROWNING\n</b>          You don't think this behavior effects\n          them?\n\n<b>          KATE\n</b>          You know damn.well what I'm talking\n          about.\n          _ Her voice is brittle now, barely controlled. A beat. The tears\n          sta rt to spill.\n\n<b>          KATE\n</b>          When I look out at the pool and\n          think...\n          (to John)\n          When I try to imagine what would have\n          happened if you hadn't come home early\n          that day... it makes me want to kill\n          myself. I would the before I let\n          something like that happen again.\n\n<b>          JOHN\n</b>          Then why-not throw both bottles away?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          84,\n</b>\n<b>          KATE-\n</b>          Becauso\"I need help. i thought I could\n          handle it myself, but I can't. I'll go\n          back to-therapy. I'll start going to\n          A.A. meetings.\n\n<b>          JOHN\n</b>          That's not enough anymore.' I told you\n          last time what I'd do if this'ever\n          happened again. I'm trying to give you\n          another chance.\n\n<b>          KATE -\n</b>          You haven't heard.a word I've said.\n\n<b>          JOHN\n</b>          I've heard enough. If it was just the\n          two of us, that would be one thing.\n          But I can't let you be in a position\n          where you could hurt the kids.\n\n<b>          KATE\n</b>          I'm not the one you need to be worried\n          aboutt Seven people close to Esther\n          have died in the past year. Max was\n          almost the eighth. now many more\n          coincidences are you willing to ignore?\n\n<b>          JOHN\n</b>          Kate, stop it. You're talking about an\n          eight-year-old girl. And right now\n          she's making a lot more sense than you\n          are.\n\n<b>          KATE\n</b>          I know I haven't given you any reason\n          to believe me. But you have to. I'm\n          begging you.\n\n<b>          JOHN\n</b>          I'm sorry. Maybe if you'd been honest\n          with me from the start. But not now.\n\n<b>          ANGLE -- MAX AND ESTHER\n</b>          peer around the corner, watching them argue. Max is crying.\n\n<b>          JOHN\n</b>          You either check into rehab this week\n          or I leave and I take the kids with me.\n          Esther leans close and whispers into Max's hearing aid:\n\n<b>          ESTHER\n</b>          I'll kill her it you tell..\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          85.\n</b>          Max gives her a frightened look.- Just then, Doris.appears with a\n          bowl of popcorn. She quickly ehoos the girls away.\n\n<b>          DORIS\n</b>          Come on, you two. Let's go watch TV.\n          Max wipes her eyes. Esther takes her hand and leads her away.\n\n<b>          EXT. COLEMAN RESIDENCE -- NIGHT -\n</b>\n          John walks Doris out to her car.-He gives her a hug.\n\n<b>          JOHN -\n</b>          You sure you don't mind? She's not\n          going to appreciate your being around.\n\n<b>          DORIS\n</b>          .I don't care what she appreciates. You\n          can't leave those kids alone with her\n          while you're at work all day.\n          (off his look)\n          You're doing the right thing. Don't\n          let her change your mind.\n\n<b>          JOHN\n</b>          I'll see you tomorrow.\n          Doris gets In her car. John looks conflicted.\n\n<b>          INT. UPSTAIRS HALLWAY - NIGHT\n</b>\n          Bedtime. Esther can be heard HUMMING through the closed bathroom\n          door. Daniel listens as he sneaks down the hall in his pajamas...\n\n<b>          INT. MAX'S BEDRROM - NIGHT\n</b>\n          Max's eyes are red from crying. She's drawing a picture, but\n          hides it under some other papers when Daniel enters. Be closes\n          the door. Esther's HUMMING can be heard O.S. A tense beat.\n\n<b>          DANIEL\n</b>          Are you okay?'\n          Max nods. Daniel sits down next to her. He lowers his voice.\n\n<b>          DANIEL\n</b>          Did Esther do something to the van?\n          Max turns away and shakes her bead.\n\n<b>          DANIEL\n</b>          It's okay. You can tell no. I saw her\n          jump out before .it started to roll.\n          Max gives him a startled look, suddenly frightened.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          86..\n</b>\n<b>          MAX\n</b>\n<b>          DID XOD: TELL ON !3ER?\n</b>\n<b>          DANIEL\n</b>          No way. Dad won't believe me. You\n          have to do it with me.\n          Max shakes her head and starts signing, but Daniel can't keep up.\n\n<b>          DANIEL\n</b>          Slow down, 'I don't understand. Did she\n          make the van crash?\n          A long beat. Max reluctantly nods'. -\n\n<b>          DANIEL\n</b>          Then we have to tell Mom and Dad.\n          Max starts crying. She signs, but Daniel doesn't understand.\n          Frustrated, Max starts hitting him. Daniel grabs her arms\n\n<b>          DANIEL\n</b>          -Stop it!- She's going to kill us if we\n          don't tell! Morn and Dad can protect\n          us!\n          Max. shakes her head. Daniel releases her.\n\n<b>          DANIEL\n</b>          Why not?\n\n<b>          MAX\n</b>\n<b>          NOBODY CAN.\n</b>          Daniel stops short. Max hesitates, then gets up and shows him the\n          pictures that she hid from him when he first came in.\n          They're crude crayon drawings of Max and Esther. In the first,\n          Esther stands atop the rocket ship slide and pushes Brenda down\n          the stairs while Max watches..\n          The= next one turns Daniel's blood cold. X &amp;'s of Sister Abigail's\n          murder. Esther stands over Sister Abigail with a bloody hammer\n          wh e r e Max cowers under the bridge. The last one is of Esther and\n          Max in the treehouse. Esther is covered in blood.\n\n<b>          DANIEL\n</b>          What did she do in the treehouse?\n\n<b>          MAX\n</b>\n<b>          SHE PUT TEE BAD THINGS THERE.\n</b>          Suddenly, Esther's O.S.\"humming STOPS. Daniel looks up, alarmed.\n\n<b>          DANIEL\n</b>          r She's coming.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          87.\n</b>          'Max quickly hides the. pictures-. Daniel scrambles to the door, but\n          -pauses and signs to Max as best he can.\n\n<b>          DANIEL\n</b>          Everything's going to be all right.\n\n<b>          INT.'UPSTAIRS HALLWAY - NIGHT\n</b>\n          Daniel hurries back to his room and closes the door, just as\n          Esther emerges from the bathroom. She pauses, suspicious.\n          INT. KATE AND JOHN'S BEDROOM -r NIGHT\n           Kate and John are in bed. It's 3:23 a.m.' They both appear to be\n           sleeping. Then Kate. moves. She's still wide awake.\n           She looks over at John, slowly push the covers back, and inches\n           out of bed so that he doesn't wake u es' p. She quietly dresses.\n          INT tIPSTAIRS HALLWAY - NIGHT\n          Kate emerges from their bedroom with a small OVERNIGHT BAG and\n          cree ps into the dark hallway, careful not to make any noise. She\n          stops by the. door of Max's bedroom, and slowly opens it.\n\n<b>          TNT. MAX'S BEDROOM - NIGHT\n</b>          Kate slips inside, closes the door; and starts toward Max's bed...-\n          Suddenly, a desk light comes on. It's Bather. She's been sitting\n          there in the dark. The light casts strange shadows on her face.\n\n<b>          ESTHER..\n</b>          Going somewhere, Kate?\n          Kate startles and whirls to check on Max. She's. fast asleep.\n\n<b>          ESTHER\n</b>          She's fine. Lot's not wake her.\n\n<b>          KATE\n</b>          What are you doing in here?\n\n<b>          ESTHER\n</b>          1-couldn't sleep. I was-afraid you\n          might try to take Daniel and Max away.\n          Kate stands frozen, frustrated and'angry.\n\n<b>          KATE\n</b>          Go to your room.\n\n<b>          ESTHER\n</b>\n<b>          (LAUGHS)\n</b>          Honestly, we're past that now, aren't\n          we?.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          86.\n</b>          t KATE\n          I'um not going to let you hurt my\n          children. -\n\n<b>           ESTHER\n</b>           1m not the one who passedouutt drunk.\n          and let\n           I hear the first step is (on.ffideannttially) -admitting that.\n           you have a problem.\n\n<b>           KATE\n</b>           (a beat, stricken)\n           Who told you about that. -\n           Esther holds up Kate's journal:: Kate blanches.\n\n<b>           ESTHER\n</b>           It's in your journal. I found ï¿½it a few\n           weeks ago.. It's very intimate. 3\n          learned so much about you. Your\n          marital troubles, your drinking\n          problem. Where you hide your wine\n          bottles. You have lovely handwriting,\n          by the way. Would you like to bear my\n          favorite part?\n          Esther has a page marked. She reads:\n\n<b>          ESTHER\n</b>          \"Eight weeks before my due date,\n          Jessica died-from several undiagnosed\n          birth defects. I hadn't felt her move\n          for days, but now that I knew she was\n          dead, I started-to feel her kick again.\n          It's called phantom fetal movement,\n          like the pain felt in a missing limb.\n          I was an amputee and my baby was the\n          lost part of me. Because of other\n          complications, Doctor Kosgrove didn't\n          want to induce. So I had to wait to go\n          into labor. For sixteen days I carried\n          Jessica's body and felt her ghostnow a kicking in my-belly. y womb\n          coffin and inside me slept a corpse.\"\n          (to Kate)\n          How perfectly hideous. No wonder you\n          turned into a nasty, smelly drunk.\n          Kate is dumbfounded, trembling with impotent rage and raw emotion.\n\n<b>          ESTHER\n</b>          Kate. You don't know how lucky you are,\n          I'll never have children of my own. My\n          father paw to that while I was still-in\n          diapers. I. actually don't\"remember a\n          7 time when he wasn't fucking.me.\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          89.\n</b>\n<b>          E STHER (CONY' D )\n</b>          (off Kate's look)\n          I don't want your pity.' He did it to\n          make me strong. So 1 ,wouldn't turn out\n          weak and 'pathetic like you..\n\n<b>          RATE\n</b>          I'mi pot weak..\n\n<b>          ESTHER\n</b>          Please. You're soft. Like,&amp; worm.\n          Losing your baby could have. made you\n          stronger. But for you it's alwa s.more\n          therapy and more- pills and more booze.\n          Anything so that you don.'t have to\n          actually face the so state of your\n          miserable existence. And why should\n          you? You've got John to carry your\n          dead weight around.. But you know\n          something? You don't deserve him. And\n          sooner 'or later, he's going to figure\n          that out.\n          Esther stands up to leave. Kate-blocks her path.\n\n<b>          ESTHER\n</b>          What are you going to do? Hit me?\n          -Kate. looks really tempted. A beat. She puts out her hand for the\n          journal. Esther gives it to her with a smile. Kate steps aside.\n\n<b>            ESTHER\n</b>          See you tomorrow.\n          She leaves. Kate glares after her. -\n\n<b>          INT. KATE AND JOHN'S BEDROOM - DAY\n</b>\n          .Kate is on the phone, angry, trying to keep her voice low,\n\n<b>          KATE\n</b>          I need to know where she came from and\n          I need to know now.\n\n<b>          INTERCUT:\n</b>\n<b>          INT. HOME FOR GIRLS - OFFICE - DAY\n</b>\n          Sister Judith talks. to Rate on -the phone, looking harried.\n\n<b>          SISTER'JUDITH\n</b>          I'm sorry, we've called every orphanage\n          in Moscow trying to find out.\n\n<b>          KATE\n</b>          We adopted her from yquI How can you\n          not know anything about her?!-\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          90.\n</b>\n<b>          SISTER JUDITH\n</b>          The Wallaces could have adopted her\n          illegally. Are you-sure\n          remember anything that could he doesn't?\n\n<b>           END INTERCUT:\n</b>\n<b>          KATE -\n</b>          I'll call you back.\n          She curtly hangs up-\n\n<b>          INT. FAMILY ROOM - DAY\n</b>\n          Doris plays a game with the kids. Esther feigns' nonchalance, but.\n          the tension is thick between Dani?l and Max. Doris is oblivious.\n\n<b>          DORIS\n</b>          I say Professor Plum did it in the\n          Conservatory with the candlestick...\n\n<b>          INT. ESTHER'S BEDROOM - DAY\n</b>\n          Kate rifles. through Esther 'a things. She finds the life book that\n           e fli it.The p i till blank\n          exce forstherfaamily photos that fate put ingforahers\n          Then she notices that the first page has been torn out. And on\n          the page. captioned '\"ESTBER JOINS THE FAMILY,\" P.sther's face has\n          been et cu oval cut out Df \"h farm of r Creepy.\n          Kate ransacks the room,. searching for something,, anything. Then\n          she notices a.stuffed doll that she just knocked over. Its dress\n          has been flipped up, revealing ,g slit, cut in he doll's pack.\n          grabs it. Something has been hidden in the stuffing...\n          Tt's a 'ï¿½ Bible. Kate pulls it out and quickly looks through\n          the pictures that-Esther keeps inside. They're the same photos of\n          the Wallaces that we saw earlier. With one new addition.\n          It's the missing page from Esther'.s life book, the picture of Kate\n          and John at their wedding. But the face that Esther cut out, from\n          the other picture has been glued over Kate 'a.face here, p 3t\n          loo like JTobm DDd $ her are egï¿½S markied.\n          The caption is still \"MOMMY &amp; DADDY GET MARRIED.\" Kate shudders.\n\n<b>          KATE\n</b>          Jesus Christ...\n          She flips through the: Bible and shakes it, but there's nothing\n          else. She notices that the Bible -is in a foreign language.\n          There's an ink stamp on the inside cover. it's in the sa me.\n          language as the Bible. \"See on saarne rnatituat omand.\"\n          She focuses on two words: seamne.Inatituut.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          91.\n</b>\n<b>          INT. FAMILY ROOK! - DAY\n</b>\n          Daniel gets up from the.game.\n\n<b>          DORIS\n</b>          Where are you going?\n\n<b>          DANIEL\n</b>          Bathroom.\n          Esther eyes him as he leaves.\n\n<b>          INT. DOWNSTAIRS HALLWAY - DAY -\n</b>\n          Daniel hurriedly sneaks toward John's den, but stops just outside.\n          Be hears a keyboard CLACKING and warily peers around the. corner.\n          Kate ia'working on John's computer. Daniel eyes the KEEPSAKE BOX.\n          .No way to get to it unseen. Be thinks a beat, then slips away...\n\n<b>          'INT. JOHN'S DEN - DAY\n</b>\n          Kate googles \"SAARNE INSTITUUT.\" All the sites that come tap are\n          in the same language as Esther's Bible. She sighs, frustrated.\n          Then she sees something -- a photo of a Gothic mansion. The sign\n          out front reads: \"Saarne Instituut.\" Kate recognizes it   -\n          instantly. It's the same Gothic mansion from Bather's paintings.\n          She scours the web site for anything' decipherable. There's a -\n          link: \"KONTAKT JA XNFO.\" She clicks it. There's a phone number.\n\n<b>          INT. GARAGE -- DAY\n</b>\n          Daniel looks around, finds what he's looking for: a TIRE IRON.\n\n<b>          INT. JOHN'S DEN - DAY\n</b>\n          Kate is on the phone, anxiously 'listening to the TONE of a foreign\n           telephone ringing.- Then:\n\n<b>          RECEPTIONIST 01 (V.0.)\n</b>          Saarne Instituat. Xas ins -eaan teid\n\n<b>          AIDATA7\n</b>\n<b>          KATE\n</b>          Uh, hello.- I'm sorry, do you speak\n          English?\n\n<b>          RECEPTIONIST #1 (V.0.)\n</b>          Ruidas, palun7\n\n<b>          KATE\n</b>          Do you speak.English? Does anybody\n          there speak-English? This is very-\n          important.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          92.\n</b>\n<b>          RECEPTIONIST #1 (V.0.)\n</b>          Ma ei sac aru. Dote Like silmapilk.\n          Kate starts to-say somethf.ng, but she's interrupted by HOLD MUSIC.\n\n<b>          EXT. TREEHOUSE - DAY  \n</b>\n          I)aAje runs\n          lookslaround. o The coast is clear. Hetstartsï¿½climbing...\n\n<b>          INT. JOHN'S DEN - DAY\n</b>\n          Kate is still .on -hold. , Finally-, a MAX' picks up. Be speaks\n          English with the same ACCENT as Esther.\n          RECEPTIONIST #2 (V.a.)\n          Hello?\n\n<b>          KATE\n</b>          Is this the Saarne Institute?\n\n<b>          RECEPTIONIST #2 (V.O.)\n</b>          yes.\n\n<b>          KATE\n</b>          I need to talk to someone about one of\n          your children. She was adopted by.an\n          American family about a year ago.\n\n<b>          RECEPTIONIST #Z\n</b>          I beg your pardon?\n\n<b>          KATE\n</b>          A little girl, possibly adopted from\n          your orphanage. I'm trying to find\n          somebody who might remember her.\n\n<b>          RECEPTIONIST #2 (V.O.)\n</b>          This girl, she is -not come from here.\n\n<b>          KATE\n</b>          Can't you at least check?\n\n<b>          RECEPTIONIST #2'(V.0.)\n</b>          No, I am sorry.\n\n<b>          KATE\n</b>          Please, I know she at least spent some\n          time there.'\n\n<b>          RECEPTIONIST #2 (V.O.)\n</b>          No, 'ou not understand. Saarne\n          Institute is not orphanage. It is\n          mental hospital.\n          Off Rate's shocked reaction:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          93.\n</b>\n<b>          V. INT. /EXT. TREEHOU SE . -:-'DAY.\n</b>\n          CRAAAACK! Daniel uses the tire iron'to pry the hasp off the\n          treehouse door. The wood SPLINTERS and the hasp comes free.\n          He enters and looks'around. Nothing unusual. He throws back the\n          rug and pulls up the loose plank. Max's \"Hello Kitt l\" backpack is\n          stuffed inside. He unzips it, his, eyes going wide with ho or...\n          r r\n          he pulls Bsther' blood-stained d ess fro t L e ï¿½c ck.\n\n<b>           ESTHER (0.S.)\n</b>           I couldn't have,done it by myself, you -\n          know.\n          Daniel whirls around. 'CAMERA REVEALS Esther standing in the\n          doorway behind him.- She's holding something behind her back.\n\n<b>          ESTHER -\n</b>          Max is just ag-guilty as I am.\n          She steps toward him'and he backs..away, angered by her words, but\n          wary of those hands-behind her back. What's she biding...7\n\n<b>          DANIEL\n</b>          You leave her alone.\n\n<b>          ESTHER\n</b>          Think about it. Somebody had to have\n          helped me. If they find that dress,\n          they won't just be coming for me.\n          They'll becoming for Max, too.. Is\n          that really what you want?\n          She's maneuvering him away from the door. Daniel screws up-his\n          courage and stands his ground.\n\n<b>          DANIEL -\n</b>          You're full of shit. I'm telling Mom\n          what you did and you're gonna fry for\n          it.\n\n<b>          ESTHER\n</b>\n<b>          (SIGHS)\n</b>          All right. I was just trying to be.\n          nice.\n          And with that: she takes a can CHARCOAL, LIGHTER FLUID from\n          behind her back and tazts snravina the-floor At Daniel's feet\n          with Al. He gasps' and jumps back as it SPLATTERS in. front of hire.\n          She douses the floor from one side to the other.\n          Then she opens a BOOK OF MATCHES and lights one. Daniel blanches,\n\n<b>          ESTHER\n</b>          Goodbye, Daniel.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          94.\n</b>          She drops the match. - The lighter fluid IGNITES 'and a\n          wall between Daniel the door, Esther smiles at\n          him through fire the ER Tgl,pp3ES trapped.\n\n<b>          INT. JOHN' S DEN - -.DAY .\n</b>\n          Kate talks on the phone. She's e-mailing a picture of Esther.\n\n<b>          KATE\n</b>          It's called the Saarne Institute. S-A -\n          A-R-N-E. it's in Estonia:\n\n<b>          INT. HOME FOR GIRLS - OFFICE - DAY\n</b>\n          Sister Judith jots down the info.. -\n\n<b>          SISTER JUDITH\n</b>          Estonia? This can't be right. All he r\n          paperwork is from Russia.\n\n<b>          INT. JOHN'S DEN -.DAY\n</b>\n\n<b>          KATE\n</b>          Please, just try to find out if sh e was\n          ever a patient there. I'm sending them\n          a-picture of her right now.\n\n<b>          INT./EXT. TREEHOUSE - DAY\n</b>\n          SMOKE pours from the treehouse. Esther has climbed down and is\n          watching it burn . Inside, Daniel is surrounded by FLAM ES, choking\n          on black smoke. He stumbles to a window and sticks his head out.\n\n<b>          DANIEL\n</b>\n<b>          MOMI HELP! M0000MI\n</b>          The fire closes in. The place is going up like a tinderbox. He\n          carefully climbs out the window and stands- on the sill, fifteen\n          feet off the ground.\n\n<b>          DANIEL\n</b>\n<b>          MOOOOM!1\n</b>          He hugs the side of the treehouse, panicked. The FLAMES grow\n          higher, licking at his feet. No place to go now but up.\n          He reaches for the edge of the roof and struggles to pull himself\n          onto it, his legs kicking out over empty space. He gets an elbow\n          on the sloped roof and starts wriggling up onto it...\n          .suddenly -- he sue. He glide dawn, arel grabbing the q2 9\n          t h e with his fin e s aJ the last seco Esther gasps,\n           excited, like she's the front row of a great sports event.\n\n<b>          DANIEL\n</b>\n<b>          MOMMYI HELP MSEEII\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          95..\n</b>\n<b>          `.. INT. JOHN'S DEN DAY\n</b>\n           Kate's still on the phone. She glances out window\n           backyard and the woods beyond. Suddenly, her eyes wide. theA\n           COLOMN OF SMOKE rises above the treeetop s. Realization- and horror\n           slam home at the same time. t.\n\n<b>           EXT. TREEHOOSE - DAY\n</b>\n           Daniel fights desperately to hang on. Bother watches, eyes wide\n           with exhilaration. For alone, breathless beat ï¿½ï¿½ajustt.ï¿½gs a\n           there, dangling helplessly, fingers slipping y.\n           hen hg loses ,dg l b ur[-gts to ou d.\n          He lands hard and doesn't move. Esther walks over and crouches\n          next to him. She touches his neck for a pulse. He's still alive.\n          Esther pouts, disappointed. She- looks around, finds a HEA VY ROCK.\n          She lifts it over her head, ready to cave. in Daniel's skull...\n          Sudde l Y, Max rus e innc3 ushe gsaï¿½â\u0096º knck\n          from her hands. Esther whirls on Max, eye s flashing i rage. g\n          But then Kate is there, running up the path with Doris not far\n          behind. Kate sees Daniel's rumppledabodyta and his her world collapses,\n          everything else falling away.\n\n<b>          KATE\n</b>          Oh, my God! Daniell Baby, can you\n          hear me? Please, baby! Wake up.\n          He doesn't move. Kate calls out to Doris:.\n\n<b>          KATE\n</b>          Call nine-one--onel\n          Doris hurries back to the house. Kate catches Esther watching her\n          warily.. Kate glares at her with pure hate.\n\n<b>          EXT. COLEMAN RESIDENCE - DAY'\n</b>\n          FIREFIGIITERS have arrived to put out the treehouse. NEIGHBORS\n          gather to gawk. Max is in the house, watching from the window as\n          EMTS load Daniel into an ambulance. He's still unconscious an d in\n          full cervical immobilization. Doris bowers nervously.- gby Kthe atewrist.\n          climbs in with Daniel, angrily dragging Esther\n\n<b>          KATE\n</b>          Get in here.\n\n<b>          DORIS\n</b>          She can ride with us.\n\n<b>          KATE\n</b>          I'm not letting her out of my sight..\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          96.-\n</b>\n<b>          INT. HOSPITAL - WAITING ROOM - NIGHT\n</b>\n          Hours later. The-whole-family-waiting fpr-news  Kate and John\n          sit across from one another; The silence and tension heavy\n          between its with irls- DOC WAN)\n           en ers. Kate a drthesothers are inst ntly on eir feet:\n\n<b>           DR. RAJAH. '\n</b>           Me stopped.-the abdominal bleeding. -\n           Ue1B should\n           consider b yourselves ery lucky\n\n<b>          V\n</b>          Relief 'floods over .Kate and John. Esther listens, intent...\n\n<b>          JOHN\n</b>          Can we see him? -\n\n<b>          DR. RAJAN\n</b>          In a little while. He 'a resting in\n\n<b>          ICU. -\n</b>\n<b>          KATE\n</b>          Will he be able to tell us what\n          happened?\n          A pointed glance-between Kate and John. Dr. Rajan doesn't notice.\n\n<b>          DR. RAJAN\n</b>          It's possible. There's no way of -\n          knowing for sure what he'll remember\n          until he wakes up.\n          Esther shifts nervously. Not the answer she was hoping for...\n\n<b>          INT. HOSPITAL -,WAITING-ROOM.- NIGHT (TIMECUT)\n</b>\n          Rate has taken John aside, voices low, out of earshot of the\n          .others. She's shown him two pieces of paper: One is'a pa inting\n          Esther did of the old Gothic mansion.. The other in a printout of\n          the photo from the-Saarne Institute's web site.\n\n<b>          _ KATE\n</b>          She-told me she just made it up, but\n          it's.a real place.\n\n<b>          JOHN\n</b>          There has to be some other explanation.\n          She didn't come from an insane asylum!\n\n<b>          KATE\n</b>          How do we know? The orphanage we\n          thought she came from has never even'\n          heard of her[- Everything. about her\n          could be a lie!  \n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          97.\n</b>\n<b>          JOHN -\n</b>          We have her passport, her birth\n          certificate, her school and medical- .\n          records --\n\n<b>          KATE\n</b>          It's just paper, JohnI From halfway\n          around the world!-- This isn't last me\n          being paranoid. Call. Saint Cabrini's\n          yourself. if 'you don't believe me.\n          A beat. John looks like he's wavering.\n\n<b>          RATE\n</b>          Your own mother was there this time.\n          Only Esther or Daniel could have\n          started that fire. I know who I think\n          did It. Do you? .\n\n<b>          JOHN\n</b>          I don't know what to think anymore.\n\n<b>          KATE\n</b>          Well, I'm done connecting the dots for\n          you. You can believe what you want\n          about me. Blame me for everything.\n          I'll leave tonight if you want me to,\n          on one condition.\n\n<b>          (BEAT)\n</b>          Esther goes, too.\n\n<b>          ACROSS THE ROOM\n</b>          Esther watches Kate and John. She can't hear what'they're saying.\n          She looks worried. She turns to Doris.\n\n<b>          ESTHER\n</b>          Can I have a dollar for the pop\n          machine?\n          Doris gives her a dollar.from her'purse. Esther smiles and heads\n          toward the vending machines.. Max watches her go.\n          But as soon as Esther's out of sight, her cheery face turns to\n          graiii.te. She puts the dollar in her pocket and sneaks away...\n\n<b>          INT. FOYER - NIGHT\n</b>\n          Back at home, the phone RINGS. The answering machine picks up. A\n          MAN with an Estonian accent (DR. VARAVA) leaves a message:\n\n<b>          DR. VXMVA (V.O. )\n</b>          I'm.calling for Katherine Coleman. -\n          This is Doctor V.rava from the Saarne\n          Institute in Tallinn. Please- cill me\n          immediately;..\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          98.\n</b>\n<b>          INT. HOSPITAL - ICU - NIGHT\n</b>\n          Esther peers through a door.and sees Daniel lying unconscious with\n          a rigid A traction, both\n          his arms by wires heart rate monitor BEEPS\n          Esther approaches his bed like the angel of deaths slowly drawing\n          the CURTAIN around them. The HEART RATE MONITOR Is clipped to his\n          finger. Esther slips .it onto her own finger. The machine\n          continues to BEEP, registering her heartbeat instead of his.\n          Slowly, she climbs up onto the bed, prowling like,a cat. She\n          carefully straddles him and takes a pillow from under his head.\n          The movement causes him to stir. His eyelids flutter. At the\n          last moment, he sees her looming, over him...\n            Then s 'ash s the ' iï¿½ 1 down ova hin face. he al\n          Daniel struggles,. but he can barely move, traction wires JANGLING\n          as he thrashes helplessly. His SCREAMS are muffled under the\n          pillow. Esther viciously presses down with all her strength...\n\n<b>          INT. HOSPITAL - WAITING ROOM - NIGHT\n</b>\n          Max sits next to Doris, staring at. the hallway that leads tor-the\n          .vending area, waiting\n           She get s s p. walk toward iit, re d aounting.ï¿½looks worried.\n           t u and s d a\n          Maxine, where are you going?\n          Max turns the corner. The vending area is empty. Esther isn.'t\n          there. Max's eyes go wide with fear.\n\n<b>          INT. HOSPITAL -- ICU - NIGHT\n</b>\n          Daniel has stopped struggling. When Esther finally lifts the ,\n           pillow, his eyes are\n          them a and slid s the pillow d u is headr gently closes\n           e nderneath h\n          Then she climbs down from the bed and slips the heart rate monitor\n          back on his finger. FLATLINE. An ALARM sounds.\n\n<b>          IN. HOSPITAL - WAITING ROOM - NIGHT\n</b>          Max runs up to Kate and John. She urgently yanks Kate's arm.\n\n<b>          KATE\n</b>          What-is it, sweetie?\n          Suddenly, a CALL comes on the overhead speakers:\n\n<b>          HOSPITAL OPERATOR (V.0.)\n</b>          Code ninety-nine, ICU. Code ninety-\n          nine, ICU.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          99.\n</b>          .Dr. Rajan runs by at top speed. Kate gasps, panicked.\n\n<b>          RATE\n</b>          Oh, My. God... Daniell\n          She and John run after Dr. Rajan. Doris quickly grabs Max to keep\n          her from following.\n          INT. HOSPITAL -. lCD - NIGHT\n          Kate and John follow Dr. Rajan.to the room where a CODE TEAM races\n          to resuscitate Daniel.\n\n<b>          KATE\n</b>          Dan.iL-I!\n          Kate and John try to enter the room, but the ICU NURSE stops them.\n\n<b>          KATE\n</b>          What's happening --?1\n\n<b>          ICU NURSE\n</b>          You have to stay out here. _\n          They catch a glimpse of Dr. Rajan picking up defibrillator paddles\n          before the door is SLANHEI) in their terrified faces.\n          INT. HOSPITAL - ICU - NIGHT (TIMECtT)\n\n<b>           \n</b>          Rate and John sit outside, waiting. Dr. Rajan emerges. His face\n          tells.them everything. Rate's crying before he even says a word.\n\n<b>          DR. RAJAN\n</b>          I'm sorry.. His injuries were more\n          severe than we first thought.\n          John chokes back tears. He holds Kate close as she sobs.\n\n<b>          KATE\n</b>          Oh, no... Oh, no... Oh, my baby... _\n\n<b>          DR. RAJAN\n</b>          We're so sorry. A terrible loss, we're\n          so sorry...\n          Kate gets up and rushes into Daniel's room in time to see the ICU\n          Nurse cover his body with a sheet. Kate collapses to the floor,\n          weak with horror and grief. John tries to comfort her.\n          Then slowly, Kate's eyes turn steely and her grief burns into\n          rage. She pushes. John away and stands up.\n\n<b>          RATE\n</b>          Where is she?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          INT. HOSPITAL -- WAITING 'ROOM NIGHT\n</b>\n          Kate storms in and looks-'around, her-face a mask, of fury. John\n           hurries after her. She spots Esther. returning from ding\n          machines, - innocently sipping a. e c h t e 'ven\n\n<b>          KATE\n</b>          What did you do?!\n          Heads'turi. Doris and Max are taken aback. Kate looks insane.\n          She strides.toward Esther, gaining momentum with every step, but\n          Esther just looks up at her with a half-hidden smile on her fa ce.\n\n<b>             RATE,\n</b>           What did\"you do to him, you bitch?!.\n          Them ,he slaps sE ther As ha as she. cmn h t e face, sending\n           her reeling to it fioot  Everyone is-horrified.\n\n<b>          JOHN\n</b>          Kate! Stop it!\n          Rate looks ready to hit her again, but a NURSE holds her back.\n\n<b>          WAITING ROOM NURSE\n</b>\n<b>          ORDERLY I\n</b>          Esther touches her mouth. She's bleeding. For a beat, she just\n          lies r sr - uina\n           shock he Th o John u and-in g bursts a into tear sen\n           en-shewsees stantly\n\n<b>          ESTHER\n</b>          Daddy! Daddy! Help me!\n          John scoops her into his arms; Kate is apoplectic. It takes TWO\n          ORDERLIES to hold her. Max watches, crying.\n\n<b>          KATE\n</b>          She killed him! He was going to live\n          and she killed him!1\n\n<b>          JOHN\n</b>          She was out here the whole time!\n          Dr. Rajan rushes in, readying a syringe.  \n\n<b>          KATE  \n</b>          No! Get away from me l i!\n\n<b>          DR. RAJAH\n</b>          Hold her still!\n          A small crowd has gathered, watching with horror and pity as the\n          Orderlies overpower her. Dr. Rajan-grabs Kate's arm, quickly\n          hunts for a vein, then jabs the needle-in. Kate screams.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          101.\n</b>          Pleaeet Somebody listen to me! She\n          killed. my. babyI She killed my baby...\n          But her eyelids are already. drooping . John watches, nearly\n          overwhelmed with emotion. Kate goes limp in the Orderlies' arms.\n\n<b>          INT. HOSPITAL ROOM - NIGHT\n</b>\n          Kate lies in a bed, barely conscious. A NURSE. pushes -a 'sedative\n          into an IV tube taped to Kate's arm. Rate looks -up 'groggily. and\n          sees John talking to Dr. Rajan.\n\n<b>          DR. RAJAH\n</b>          We can keep her sedated overnight.\n          John nods. He waits for Dr. Rajan and the Nurse to leave, then\n          walks over and looks,down at Kate. She's fighting to stay awake.\n\n<b>          JOHN\n</b>          Mom's driving us home. I think it's\n          better if you stay here tonight. I\n          don't want you around the kids like\n          this.\n          Kate weakly grasps his hand, her voice a thready whisper:\n\n<b>          KATE\n</b>          John... Please... Please don't let\n          her take my family...\n          A long, emotional beat. John hesitates, conflicted.\n          Then he places her hand back on the bed and turns away. She tries\n          to call out, but doesn't have the strength. - She sees the girls\n          waiting in-the hallway. Max has been crying. She looks scared.\n          John leads them all away. And the last thing Kate sees-before\n          blacking-out again is Esther's devious smile...\n\n<b>          EXT. COLEMAN RESIDENCE - ESTABLISHING - NIGHT\n</b>\n          LIGHTNING flashes in the distance. There's a storm coming.\n\n<b>          INT. MAX'S BEDROOM - NIGHT\n</b>\n          John tucks Max into bed. When he leans down to kiss her, we see\n          Esther watching from the doorway. Max eyes her warily...\n\n<b>          JOHN\n</b>          What's wrong, sweetheart? -\n\n<b>          ESTHER\n</b>          She's thinking about Daniel.\n          (to Max)\n          Aren't you?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          1.02.\n</b>          Max reluctantly nods. John gives her a sad look.\n\n<b>          JOHN\n</b>          Me, tQO.\n          Esther enters and stands next to john at Max's bedside.\n\n<b>          BSTHER -\n</b>          Sweet dreams. -\n          As she kisses max good night, Esther fuitively redches out and\n          grabs Max's HEARING AID from off her.nigbtstand...\n          l f 7T. ESTHER'S BEDROOM - NIGHT -\n          Esther stands at her closet, 'looking through-her pretty dresses,\n          leasantly.SUNG to herself. She holds one up to her chin,\n          looks at herself in the mirror. Then another. She chooses a\n          RUFFLY DRESS and lays it out on her bed. Shersands ov er it with a\n          a pair of-Scissors in her h a nd , e y eing -it app g y.\n          After -a thoughtful beat, she starts cutting its rufflesoff...\n\n<b>          INT. FOYER - NIGHT\n</b>\n          Esther's HUMMING can be heard O.S. John trudges downstairs,.\n          exhausted and emotionally devastated. He-goes into the, living\n            room, slumps in a chair, buries his face in his hands, and cries.\n           CAMERA PULLS BACK, revealing the unnoticed answering machine in\n           f.g. The light on it is BLINKING. One new message...\n\n<b>           TNT. UPSTAIRS HALLWAY - NIGHT\n</b>           walks down the hall,ï¿½ray with her dress draped over h er-army\n           stillHUM MING. goes into the bathroom and c oses doo\n\n<b>          L\n</b>\n<b>          INT. HOSPITAL ROOM - NIGHT\n</b>\n          Esther's HUMMING continues, no other sound here at'all...\n          Rate comes to, fighting her drug-induced stupor. She forces\n          herself to sit up and gingerly pulls the IV needle out of her arm.\n\n<b>          INT. HOSPITAL - ICU -- NIGHT\n</b>\n          Esther's HUMK NG.continues, still no sound. Kate stands in rthede.\n          doorway. The bed Daniel was lying in is already-empty and\n          as if -he was never here. RAIN streaks down the window.\n          ]Cate enters and sits down heavily next to the bed. She touches\n          the place where her son lay dead only bourn before. She brehks\n          down and sobs inconsolably, but we can't hear it, only the SUMMING\n          of Esther's lighthearted, melodic tune.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          103.\n</b>\n<b>          INT. FAMILY ROOM - NIGHT\n</b>\n          Back to NORMAL SOUND. John sits on the sofa, eyes red anti teary,\n          watching a videotape-of Daniel pla'irig soccer. There's a NOISE\n          from the kitchen.. Be_pauses the video, listens.\n          A moment later, $OFT'KUSIC starts vlayin3 Q.S. An old, crackly\n          recording from the forties of The Ink Spots singing \"I'M MAKING\n          BELIEVE.\" Sentimental, bittersweet, and a little creepy.\n          Baffled, John goes to the kitchen...  \n\n<b>          INT. KITCHEN - NIGHT  \n</b>\n          ... and stops short at what he sees.\n          Esther stands on a chair, cutting slices of cheese with a LARGE\n          KNIFE. -She's prepared a plate of fruit, cheese,-and-crackers.\n          She's wearing the dress we saw her choose, but with some\n          alterations. The ruffles are gone, so are-the sleeves. It's low\n          cut and too grown up. Her hair is perfectly curled and her face\n          is caked with makeup --- powder, red lipstick, thick mascara, dark\n          eyeliner -- giving her a grotesque, woman-child, eight-year-old-\n          beauty-queen look. JonBenet Ramsey by way of Angelina Jolie.\n          John is stupefied. She szailes at him. Outside, THUNDER RUMBLES.\n\n<b>          ESTHER 4\n</b>          Hello, darling.\n\n<b>          JOHN\n</b>          What are you doing?\n\n<b>          ESTHER - -\n</b>          Making you a snack. You skipped your\n          dinner.\n\n<b>          JOHN\n</b>          Get down from there. That knife's too\n          sharp for you to be playing with.\n          Esther climbs down from the chair and nonchalantly carries the\n          cheese and cracker plate to the dining room, as-if he hadn't said\n          anything. John follows her, dumbfounded...\n\n<b>          INT. DINING ROOM.- NIGHT\n</b>\n          There are TWO GLASSES and a bottle of SPARKLING WATER on the\n          dining room table. Dim lighting and romantic MUSIC. John is\n          completely nonplussed. 'Esther sets the cheese plate on the table.\n\n<b>          JOHN\n</b>          What is this? -\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          104.\n</b>\n<b>          ESTHER.--\n</b>          I wanted to do something special for\n          you. I don't like my daddy to be\n          unhappy.\n\n<b>          JOHN -\n</b>          But why are you dressed like that?\n\n<b>          $STHSR\n</b>          Don't you like it?\n\n<b>          JOAN\n</b>          No, I don't.- You're not supposed to\n          play with Mommy's makeup.\n\n<b>            ESTHER\n</b>          I'm sorry, sir. I.just want to be as'\n          pretty for you-as she is.\n\n<b>          JOHN\n</b>          You don't need makeup to be pretty.\n          Esther is touched. She gazes up at. him lovingly.\n\n<b>          ESTHER\n</b>          You really mean that, don't you?\n\n<b>          JOHN\n</b>          of course. Why don't you go wash your\n          face and we'll tuck you back into bed.\n\n<b>          ESTHER -\n</b>          But-1 worked so hard. Can't we stay up\n          just a little longer?\n          She gives him the big, sad eyes. They're a little disconcerting\n          under all the makeup.. John sighs.'\n\n<b>          JOHN\n</b>          -All right. We'll have a little snack\n          and then off -to bed.\n          Esther beams. John sits down, reluctantly humoring her. Esther\n          starts pouring sparkling water into the glasses.\n\n<b>          ESTHER\n</b>          We really. should be drinking that\n          bottle-of wine, but I couldn't find it.\n\n<b>          JOHN\n</b>          Little girls aren't allowed to drink\n          wine.\n\n<b>          ESTHER.\n</b>          I'm not so little. To family..\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          105.\n</b>          She raises a glass in toast.: John gives her a sad look, but goes\n          along with it. They-CLINK their .glasses together and drink.\n          But. instead of sitting down,'Esther continues to stand next to\n          'him. She picks up a piece of cheese and tries to feed it to him.\n          John eyes her uneasily'. 'Be takes the cheese from her.and eats it.\n\n<b>          JOHN  \n</b>          Why don't you sit down?\n\n<b>          ESTBER\n</b>          I like being close to you.\n          She gazes into his eyes and.touches his face. John moves her hand\n          away, suddenly very uncomfortable. She hesitates, nervous...\n          then eans saes Qn h. John grabs her\n          arms and abruptly pushes. her away xn-shock and near-panic.\n\n<b>          ESTHER\n</b>          What's wrong? \n\n<b>          JOHN\n</b>          Don't ever do that again.\n\n<b>          ESTBSR\n</b>          I. thought you loved me. You said I was\n          pretty.\n\n<b>          JOHN\n</b>          Of course, I love you. But not...\n          it's different than how I love Mommy.\n          You're my little girl.\n\n<b>          ESTHER\n</b>          Will you stop saying that? We can be\n          together now, don't you see? She can't\n          come-between us anymore.\n\n<b>          JOHN\n</b>          Who can't? You mean Mommy?\n\n<b>          ESTHBR\n</b>          She's not my inormyl Please, sir, I'll\n          do anything for you...\n          She reaches out to touch his face again, but he grabs her hand.\n\n<b>          JOHN\n</b>          Esther, stop it! I mean it. This is\n          wrong.\n\n<b>          ESTHER\n</b>          Am I being bad? -   You can spank me. it\n          you-'.d like. I'll let you. I won't,\n          evn cry. Unless you want me to.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          106.\n</b>          John gapes with-disgust and horror,. He looks like he-might vomit.\n\n<b>          JOHN.\n</b>          God ouoin \n          A beat. Esther looks heartbroken. Suddenly, she tries to kiss\n          him again, desperate this time, throwing herself at him,\n          pushes her to the floor. She frantically crawls back to him. Be\n          hurries to the other side of the table.\n\n<b>          ESTHER\n</b>          Please! Please! You're ruin.ing it!\n\n<b>          JDHN\n</b>          Jesus Christ, lust stop talking! Go\n          upstairs and wipe that shit off your\n           facel Right nowt\n          Esther runs upstairst crying.- John just gapes in utter disma and\n          revulsion. He runs Into the kitchen and throws up in the sink.\n\n<b>          INT. ESTHER'S BEDROOM - NIGHT\n</b>\n          Esther situ at her little vanity table, looking at her overly made-\n          up face in the mirror, and sobs hysterically...\n\n<b>            INT. HOSPITAL - ICU - NIGHT. -\n</b>\n          Kate is still sitting at Daniel's empty. bed, eyes red and puffy\n          from crying. Outside, it's RAINING HARDER. Lightning FLASHES.\n          Her CELL PHONE CHIMES. She eyes it wearily, considers not\n          answering. 'After a few RINGS,-she picks up.,\n\n<b>          KATE\n</b>          Hello?\n\n<b>          DR. VARAVA V.O.)\n</b>          is this Katherine Coleman?\n\n<b>          KATE\n</b>          Who's calling?\n\n<b>          INTERCUT:\n</b>\n<b>          INT. SAARNE INSTITUTE - MORNING\n</b>\n          -Doctor Varava is a craggy-faced an in'his 50's. His manner is\n          urgent, almost desperate. as he speaks on the phone.\n\n<b>          DR. VARAVA .\n</b>          My name is Doctor Varava from the\n          Saarne Institute. I got your mobile\n          number from Sister Judith.\n          Kate sits up, suddenly roused.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          107.\n</b>\n<b>          RATE\n</b>          Did you get the picture I:sent? Did\n          you recognize her?\n\n<b>          DR. VARAVA-\n</b>          Yes, X did. Where is she now? Is- she.\n          with you? -\n\n<b>           KATE\n</b>           No, she's at home with my husband.\n\n<b>           DR. VARAVA\n</b>           Neetudl Call him ut and to\n           get your family of ï¿½ e ush er\n           call the police. -\n\n<b>          KATE\n</b>          He won't do it. He's not going to do\n          anything without some kind of proof.\n\n<b>          DR. VARAVA\n</b>          Then tell him that the little girl in\n          that picture isn't a little girl.\n          Kate stops short, confused and suddenly frightened.\n\n<b>          KATE .\n</b>          What are you talking about? The\n          picture I sent, you was of our adopted\n          daughter. She's only eight years old.\n\n<b>          DR, VARAVA.\n</b>          -No, she's not. She has a pituitary\n          disorder that causes proportional\n          dwarfism. She only Jcz Tike a child.\n\n<b>          INT. ESTHER'S BEDROOM -- NIGHT\n</b>\n          We're intercuttinq now with Esther at her vanity, her crying\n          building to a MANIACAL WAIL, her MAKEUP STREAKING. from her tears.\n\n<b>          DR. VARAVA\n</b>          Her real name is Veera Klammer, she\n          escaped from here eighteen months ago\n          and she's thirty-two years old!\n          Esther SCREAMS, slowly scratching her face with her fingernails..\n\n<b>          RESUME KATE AND VARAVA\n</b>          Kate's mind is reeling.\n\n<b>          KATE\n</b>          This can't be. There has to be a\n          mistake.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          108.\n</b>\n<b>          DR. VAPAVA\n</b>          Does she have the scars?\n\n<b>          RATE\n</b>          What scars?\n\n<b>          ESTHER\n</b>\n<b>          -\n</b>          has stopped crying, her sorrow burning into blind, monstrous rage.\n          She glares at her reflection, her mascara smeared down her cheeks.\n\n<b>          DR. 'VARAV-\n</b>          We'had to keep het .in a restraint\n          jacket when she was here to stop her\n          .from hurting' our staff, but she was\n          constantly fighting against it until\n           the collar and cuffs began deep into\n           her skin. She wound up p scars\n           from it. Around her wrists and neck;\n           Esther black from her wrists and\n           neck, revealing althe ly r scars over sew\n\n<b>           RATE AND VARAVA\n</b>\n<b>           RATE\n</b>\n<b>            E\n</b>           Oh, my God... - ow could this have\n           happened? H\n\n<b>          DR. - VARAVA\n</b>          She's been passing herself off as a\n          child for most of her life. 'She worked\n          as a prostitute for years, catering to\n          wealthy pedophiles.\n\n<b>          ESTHER\n</b>          curls her upper lip, looking at her top teeth. She reaches up,\n          pulls on her teeth and -- RA-CLICK. y come out\n\n<b>          DR. VARAVA\n</b>          She even had a dental.appliance'made to\n          complete the illusion by disguising her\n          adult teeth.\n           Re r- gerfect, earl white }aabY Beth e- d8rn at a\n          f, e s t of- CRgmp, Eoia,\n          fTx.\n          DR. VtAVA\n          When she was finally arrested, she\n          continued the pretense to stay out of\n          jail and: was sent to an orphanage.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          109.\n</b>\n<b>          A K TE .AD VARAVA\n</b>\n<b>           DR.' VARAVA\n</b>          You're not the first to have been\n          fooled. She's even-been adopted\n          before. A family here in Estonia took\n          her in.and lived with her fog over six.\n          months. They never suspected.\n          Kate-hesitatesa'b.eat, almost afraid to ask:\n\n<b>          KATE\n</b>          But why was ahe at your hospital?\n\n<b>          DA. VARAVA\n</b>          Veera is dangerously insane.. She was\n          molested by her father and sexualized\n          at a very early age. When. he. took\n          another lover, he told Veera it was\n          because she could heverbe a real\n          woman. Veera murdered them both.\n\n<b>          ESTHER\n</b>          just stares at herself in the mirror. With her scars revealed,\n          her face scratched, her mascara streaked down 'to her chin, and her\n          awful, yellow, snaggletoothed sneer, she looks like a monster.\n\n<b>          DR. VARAVA\n</b>          She now sees herself as trapped in the\n          body of a. child and it disgusts her.\n          She wants to. be what her father\n          considered to be a \"real woman.\" She t\n          wants o be a wife, a mother, a lover.\n          She wants to grow up. -\n          Suddenly, -she grabs her chair and SMASHES the mirror with it.\n          Then she whirls and swings the chair into her aquarium with a\n          'feral scream --= CRASH! Water-and fish flood onto the floor.\n\n<b>          DR. VARAVA\n</b>          When she was adopted here in Estonia,\n          = she tried to find love where she had\n          found as a child. With her new lather.\n          When he refused her, she bordered the\n          entire family in, their sleep.\n\n<b>          END INTERCUT:\n</b>\n<b>          KATE\n</b>          And then she burned the house down...\n\n<b>          DR. VARAVA\n</b>          Yes. How did you know?\n          off Kate's horrified look --\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>           110.  \n</b>\n<b>          4,. INT. ESTHER'S BEDROOM - NIGHT.\n</b>\n          John pushes the door open and looks inside.\n\n<b>          JOHN\n</b>          Esther? Are you-all right?\n          She's not here. The light is on, but the room is empty. Fish are\n          still FLAPPING around on the floor,-mouths. gasping. John gives\n          the-broken aquarium an unnerved look.\n\n<b>          JOHN\n</b>          Esther, where are you?\n          No answer. He turns off the light, about to look \"elsewhere...\n          then stops. With the overhead light off, the room is lit only\n           by the black light in Either ' s broken aquar i u m, t 7UVALI ma\n           Esther s p a n i tin ha a chap n S 's painted t = that they\n          ook f een vri d er black h - - - John takes a closer look,\n           turning the black light on and o ff.\n          Unde gal lights the painting he saw when he first met Esther,-\n          a mother lion and her sleeping cubs. .[Inds black Limos the cube\n          are now dead and 'the mother's mouth .s dripping with blood.\n          The paintings that looked like typical family portraits in normal\n          light are now nightmarish visions of death and violence. In one,\n          Kate's eyes have been gouged out. In another, Daniel's throat has\n          been slashed. In the picture of the whole family, John- and Esther\n          look normal, but Kate, Daniel, and Max are all decomposed corpses.\n          John staggers back in shock. The telephone RINGS, startling him.\n          The answering machine picks up. He hears KATE.'SVOICE,\n\n<b>          KATE (V. 0.\n</b>          John? Are you there?\n\n<b>          EXT. HOSPITAL PARKING LOT -- NIGHT\n</b>\n          Kate is on her cell., running to the- car. -\n\n<b>          KATE -\n</b>          John[ For God's sake, pick up the\n          fucking phone!\n\n<b>          INT. ESTHER'S BEDROOM - NIGHT\n</b>\n          John turns to leave  -- suddenly, th r bursts out mom undo her\n           pile \"of stuffed animals with ,s, 3ILD SC   Sj3g a n he heï¿½seï¿½lf\n          at John If rom the bed, } labs her scissors into his eve.\n          John screams and throws herto the floor. Be stumbles out of the\n          room, blood streaming down his face.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          UPSTAIRS HALLWAY\n</b>          John staggers to the stairs, the handle of the scissors jutting\n          from his eye socket. But just as he hits. the first step, Baer\n          rushes out and pushes tine cMm  the etz{rs.\n\n<b>          FOYER\n</b>          John-goes flying, head over heels, crashing into the railing hard\n          enough to SPLINTER it, and lands hard at the foot of the stairs.\n          Be lies there in a heap, too stunned. to move. Esther appears at\n          the top of the stairs. looking down at him. She. has a JU} P ROPE\n          in her hands and starts slowly walkinq toward him, softly singing:\n\n<b>          ESTHER\n</b>          When I was juuust, a lifitle g .iirl\n          I asked'my mother, what .will I be...\n          leg is broke John tries to stand, but cries out in agony. Big\n          He looks up, sees the table with the PHONE on it. As he painfully\n          crawls toward it, Esther closes in on him, singing and winding the\n          jump' rope around her fists like a garotte.\n\n<b>          -ESTHER -\n</b>          Que sera, sera, Whatever will be, will\n          be... The future's not ours to see...\n          John reaches for the phone, actually touches it, when Esther\n          straddles him from nd,- the iump rope around his neck,\n          and starts strangling with it. The phone.falls out of reach.\n          John itoo dazed from the fall to fight.\n\n<b>          EST[3ER\n</b>          When I grew uuup and feeell in looove\n          I asked my sweetheart what lies ahead\n          Will we have rainbows, day after day\n          Here's what my sweetheart said.-..\n          John chokes t clawing at the rope as she twists it tighter aid\n          tighter. Finally, his head droops his remaining eye goes blank.\n          Be'a dead. Esther gently lowers has body to the floor, a tear\n          running down her cheek. She kisses him. Whispers in his ear:\n\n<b>          ESTHER\n</b>          Qua sera, sera.\n          Suddenly -- a GASP from upstairs. Esther whirls.\n          I 's 5 N ax.. She stands atop the .stairs,- paralyzed- with fear. She's,\n           seen everything. Esther, looks-u at her with a reassuring smile\n           on her awful, mascara-streaked, blood-splattered monster face.\n\n<b>           ESTHER\n</b>           It's all right, baby. -Come to Mommy.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          312.\n</b>\n<b>          I\n</b>          Max runs away. Esther scowls.\n\n<b>          ESTHER\n</b>          Shit l.\n          She scrambles to her feet..\n\n<b>          INT. JOHN'.S DUN NIGHT\n</b>\n          'Esther Pulls John's gun case down-from the closet shelf,\n          frantically unlocks it, and grabs the }.\n\n<b>          INT.TEXT. JOHN'S CAR -.NIGHT\n</b>\n          Kate is speeding home, talking on her cell phone.\n\n<b>          911 OPERATOR ' (V . 0. )\n</b>          Dracena nine-one-one. What is-your\n          emergency?\n\n<b>          KATE\n</b>          I need the police. There's an intruder\n          in my home. _\n\n<b>          INT. MAX'S BEDROOM - NIGHT\n</b>\n          Esther enters, gun in hand, turns on the light. Max isn't here.\n          Esther looks under the bed, opens the closet. Nothing.\n\n<b>          UPSTAIRS HALLWAY\n</b>          Max carefully peers out from.around a corner...\n          Suddenly -- no sound.. This is how Max experiences the world. A\n          silent vacuum. Her perspective is shot MOS.\n          The hallway is empty and Max cautiously maces her way toward the\n          stairs. Suddenly, Esther emerges from Max's room. Max quickly\n          ducks into Daniel's room. Esther doesn't see her:\n\n<b>          DANXEL'S BEDROOM\n</b>          Max looks around for, a place to hide. She sees a TOY ROBOT lying\n          on the floor amongst Daniel's things...\n\n<b>          KATE AND JOHN'S BEDROOM\n</b>          Esther is searching the walk-in-closet when she hears a LOUD NOISE\n          from Daniel's room - something heavy falling over. She smiles.\n\n<b>          UPSTAIRS HALLWAY\n</b>          Esther edges toward Daniel's room, gun raised. There's a STRANGE\n          GRINDING SOUND coming from inside...\n\n<b>          0\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          7I\n</b>\n<b>          113.\n</b>\n<b>          DANIEL'S. BEDROOM\n</b>          Esther enters and looks around, confused. There's a PM OF BOOKS\n          that.have been knocked to the floor, but Max isn't here.\n          Then she sees what's making the GRINDING noise.' It's the TOY.\n          ROBOT. It's been placed atop a bookshelf, motor grinding, walking\n          on wobbly legs. As it walks, it pushes books off the edge of the,\n          bookshelf- onto the floor. That's what made the noise that lured\n          her here. Esther scowls furiously at the robot and SHOOTS it.\n          Her back is to.the doorway, so she doesn't see Max emerge from her\n          hiding place in the bathroom. and slip- past.\n          INT.fEXT. JOHN'S CAR -.NIGHT\n          Racing through. the streets, running stop lights. Rate is still on\n          her cell. -\n\n<b>          POLICE OPERATOR (V.O.)\n</b>          we have officers on the way, ma' amn.\n\n<b>          RATE\n</b>          Well, where the hell are they? Jesus\n          Christ, I'll be there before they will\n\n<b>          POLICE OPERATOR (V.0.)\n</b>          Ma'am,- I need you to stay calm. 'Do not\n          approach the house. Let the officers ---\n          Rate hangs. up.\n\n<b>          INT. BATHROOM - NIGHT\n</b>\n          Esther enters, looks in the linen closet, pulls back the shower\n          curtain. Nothing. she's getting frustrated.\n\n<b>          SUNROOM\n</b>          Streaking rain casts frightening shadowa in the glassed-in\n          terrace. Max quickly sneaks in and crawls under one. of the\n          numerous plant tables. Hanging leaves droop almost to the floor,\n          hiding. her. But as she curls up in the shadows, she bumps into a\n          table leg and unknowingly knocks over a FLOWER POT.\n          MOS: -The flower pot SMASHES TO PIECES on the floor directly\n          behind Max.' Naturally, she doesn't bear it.\n\n<b>          BATHROOM\n</b>          But E e does. She turns. Eyes narrowing, suspicious.\n\n<b>          SUNROOM -\n</b>          Max cowers underneath the table with her back to the door. She\n          oesn gee Esther enter.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          114.\n</b>          Esther looks around. The room is dark and- still: She starts\n          looking under the plant tables, vne by one,.HUMMING to herself.\n          Max is facing away from Esther and. doesn't see her-approaching\n          Can't hear her HUMMING. Es er 19 a ogin -,is ...\n          Suddenly, TIRES can be heard SQUEALING- out on the street. Esther\n          stops and hurries to look outside. She.stands right acr oss from\n          where Max ia hiding and seen her. Max presses 'her knees\n           to her chest, trying to di sappe4r wMa under the table.\n          Esther doesn't notice. Max is-right behind her, there are pieces\n          of BRO=N POTTERY right by Esther's feet, but she hhassher.face\n          pressed to the rain-streaked glass, trying\n\n<b>          EXT. COLEMAN RESIDENCE -- NIGHT\n</b>\n          Fate 's the house. durb\n           and SKIDS to a stop on the wet law n She jumps o of the ar and\n           sprints to the house. c\n\n<b>           INT. SUNROOM - NIGHT\n</b>\n           Esther sees Kate and leaves. Max breathes a sigh of relief-\n\n<b>           INT. FOYER - NIGHT\n</b>\n           Kate bursts through the front door and-runs insider from\n          the rain and s es'Johnï¿½'s crumpled on t e floor.\n           e h\n\n<b>          KATE\n</b>          John! Oh, my God! John!'1\n          She rushes to him, but it's obvious that he's dead. She leans\n          over his body and bursts into tears, aching at what has been done\n          to him... then stop and steels herself for what ]sh jds to do..\n\n<b>          JOHN'S DEN\n</b>           Kate hurries to the keepsake box and rummages for the.keys. Can't.\n           find them. She. quickly looks around. Her breath catches. The\n          CASE l ies empty on t floor, u let sca tered around it.\n\n<b>          KITCHEN\n</b>          Kate. runs in, sobbing She sees the big knife that Esther was\n          using earlier, grabs it. Reconsiders. She throws it aside an d\n          instead draws a huge goddamn BUTCHER'S KNIFE from the knife block.\n\n<b>          MAX'S BEDROOM\n</b>          Kate throws the door open. Max's bed is empty.\n\n<b>          KATE\n</b>          No!!\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          115.\n</b>\n<b>          UPSTAIRS HALLWAY,.\n</b>          Kate runs back out, - crying, frustrated, knife' trembling in- her\n          hand. She calls Esther out,.voice thundering with rage;.'\n\n<b>          KATE\n</b>\n<b>          VEERAI VEERA KLAMMHRI -\n</b>\n<b>          'DOWNSTAIRS\n</b>          Esther hears her real name and freezes. Realization bits. Gig.'s\n          up. It's over. Her eyes flit, panicky. She quietly darts away.\n\n<b>          BASEMENT STAIRWAY\n</b>          Esther opens the- door to the basement. She pulls open the breaker\n          box and starts flipping SWITCHES.\n\n<b>          UPSTAIRS HALLWAY\n</b>           Kate cautiously moves down the hall suddenly, he lights go\n          plunging - tlw o se into darkness.\n\n<b>          KATE AND JOHN'S BEDROOM\n</b>          Max freezes.- Now-she's blind as well as deaf. The only light\n          comes from the FLASHES OF LIGHTNING through rain-streaked windows.\n\n<b>          KATE AND JOHN'S BATHROOM\n</b>          Max hurries inside and hides in the linen closet.\n\n<b>          UPSTAIRS HALLWAY\n</b>          Esther sneaks upstairs, hugging the wall, gun held ready. She\n          pauses at the top of the stairs, waiting. Lightning FLASHES.. 'The-\n          hallway is empty. She sidles along the wall...\n\n<b>          LINEN CLOSET\n</b>          MOS: Max is huddled on the floor, terrified. Suddenly, there's a\n          FLASH of lightning --'mid Bhe A= fiba movement tï¿½mn qb The\n          7oUvered slBts-.in .t225 t efo8ï¿½.\n\n<b>          KATE AND JOHN'S BATHROOM\n</b>          Th&amp; shadowy fizmre is fate. She's within feet of Max's hiding\n          place and doesn't know it.\n\n<b>          LINEN CLOSET\n</b>          MOS: Max watches the shadowy figure, nearly hyperventilating, not\n          realizing that it'e Kate. It's coming closer, closer... then\n          moves away. Max catches her breath.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          116.\n</b>\n<b>          UPSTAIRS HALLWAY\n</b>\n<b>           -\n</b>           Kate heads back toward the stairs'. \n          Esther raises the gun and --\n           BLAM!  The knob on top of the bannister EXPLODES. Kate startles\n           and whirls' to see Bather, just as she pulls\n           frantically crawls/crabwalks into Esther's room, ehr teas ianother\n           SHOT blows a chunk out of the moulding by\n\n<b>          ESTHER'S ROOM\n</b>           Kate stands by the door with her back to the wail, holding her\n           bloody shoulder. Her eyes flit, searching for a weapon. Nothing.\n\n           She's standing right outside the door. Kate breath.\n           .Esther takes a wary step into the room, gun holds .her\n          Suddenly, Kate lunges body checking Esther against the door.\n          They struggle for the gun. It GOES OFF. Kate kno cks it out of\n          Esther's hand and slams her to the floor, but Esth er is like a\n          wild animal, kicking and shrieking and clawing at Kate'a face.\n<b>      \n</b>          For a moment, they're locked li ke that, Ka te's\n          hand wringing Esther's neck,  Esther's thumb into Kate's\n           wound. Kate screams in agony, twisting.\n           Esther wriggles out from under her and scrabbles/slides into the\n           hallway,-quickly scoops up the gun --\n\n<b>           FOYER\n</b>           =-bnt Rate mat-out TA S her 'and the tw-q of i o.tvmbl n\n           down the s. They-hit the already splintered secon of the\n           mailing and t gives way- -- CRASB 1   Rate and Esther fly through\n           the smashed railing and fall a tangled heap. Kate\n           cracks her head. The gun goe toSthe floor s\n          They're both stunned by the fall, breath knocked out. Kate is\n          dazed, unable to move. Esther recovers first, looks around for\n          the gun, can't find it. Kate stirs, fighting to stay cons cious.\n          Esther squirms away from her crawls over to John's body, and\n          wrenches the scissor from his eye so ket. Kate sees her\n          but can only watch helplessly as Esther stagg p towa-rd\n          her, bloody scissors clutched in her little fist like a dagger,\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          117.\n</b>          Then. TSOi hits Es a iï¿½g the ' the head.\n          ad and clocked her with a heavy Piece of Max 'has snuck up from be 1i\n          Way to go, slugger ! the broken railing stung like a .basebal l bat.\n          Esther stumbles to her 7mee6, but manages to shake it off. She\n          slowly rises and turns on Max with a feral snarl.\n          Max tries to- hit. her again, but Esther is ready this time and\n          swats the blow aside. She rips the piece of railing from Max's\n          bands and .tosses it across the .room. Then.she knocks Max to the\n          floor with a fierce backhand from her fiberglass cast..\n\n<b>          XATE'\n</b>          eees this and desperately searches fot the gun. She spots it under'nder a nearby table and starts dragging he rself toward it...\n           the Esther hears gun S he- es Y%ate\n          for the guw,tnd at her, scissors raised above head g\n           screaming with hate. Kate reaches whi the n. Esther 's ,\n           almost-on her. Kate grabs the gun, ls a nd ï¿½\n\n          Esther staggers back with a bZ hole an ehr the t .\n          Max watches, wide--eyed, as Esther limply drops the scissors and\n          gives the smoldering bullet hole in her chest a surprised look.\n          Blood.trickles from her mouth. She looks up at Kate, frightened\n          tears welling in her big, sad eyes.\n\n<b>          ESTHER\n</b>          Please\" don't hurt me, Mommy.\n          rat fucking chance, bitch. Kate SHOOTS her again. This one goes\n          right between those pretty eyes.\n          Esther falls to the floor, dead gaze staring at the ceiling, a\n          pool of blood .expanding around her pretty Shirley Tem ple curls.\n          Kate drops the gun and crawls over to Max, scooping her into her\n          arms and hiding her face from the horrible sights all around them-\n          For a long moment, mother anddaghte r o justï¿½holdaeacheother close.\n          Kate strokes Max's hair, cry ng u\n          What Kate can't see\"is the'slack, traumatized expression on Max's\n          bloodied face. .vacant and emotionless. That spark you should see\n          in the. eyes of a\"child, gone forever.\n          CAMERA PULLS BACK and we\n\n<b>          FADE - OUT .\n</b>\n\n\n<b>                                         THE END\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b><b> \n</b>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Orphan.jpg\"/>\n</td><td><h1>Orphan</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=David Leslie Johnson\" title=\"Scripts by David Leslie Johnson\">David Leslie Johnson</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Orphan Script.html#comments\" title=\"Orphan comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:12:59.973489"}