{"title": "Pacifier, The", "film_link": "/Movie Scripts/Pacifier, The Script.html", "script_link": "/scripts/Pacifier,-The.html", "info_raw": "\n\nPacifier, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Thomas Lennon  Robert Ben Garant  Jason Fulardi\nGenres  Comedy  Action  Family  Thriller\nScript Date : March 2004\nMovie Release Date : March 2005\n\nRead \"Pacifier, The\" Script\n\n\n", "script": "\n\n\n\n                                 THE PACIFIER\n\n\n                                  Written by\n          \n                      Thomas Lennon & Robert Ben Garant\n          \n          \n                             Previous Revisions by\n          \n              Jason Fulardi, Scott Alexander & Larry Karaszewki\n\n          \n          \n          \n          March 3rd, 2004\n                              \n          \n          \n                                                            FADE IN:\n          \n          EXT. PACIFIC OCEAN - DAY\n          \n          A fishing boat pushes over choppy water. FOUR GUN TOTING\n          MEN on Jet Skis wearing black wet suits and goggles\n          escort the boat. Flying above it is a HELICOPTER.\n          \n          INT. FISHING BOAT/CONTROL DECK - CONTINUOUS\n          \n          A SERBIAN MAN captains the wheel. SERB 2 scans the\n          horizon with binoculars. He checks the GPS system, then\n          his watch, then speaks into his throat mic. All italics\n          are Serbian w/ subtitles:\n          \n                                 SERB 2\n                   Fifteen minutes to delivery.\n          \n          EXT. PACIFIC OCEAN - CONTINUOUS\n          \n          The JET SKIER in the lead weighs in on a radio.\n          \n          INT. SEA HAWK 1 - CONTINUOUS\n          \n          The HELICOPTER PILOT weighs in.\n          \n                                 PILOT\n                    All clear from above.\n          \n          EXT. SKY - CONTINUOUS\n          \n           The camera descends as the boat passes, and dives beneath\n          the surface.\n          \n          EXT. PACIFIC OCEAN - CONTINUOUS\n          \n           The droning of engines becomes less pronounced. Foam\n          from the boat and skis bubbles.\n          \n          Calm. Then from out of nowhere five NAVY SEALs wearing RE-\n          BREATHERS appear, in neat formation like the Blue Angels.\n          JET PROPELLED BACKPACKS push the SEALs through the water.\n          \n          The LEAD SEAL: SHANE WOLFE, points upwards. All eyes\n          follow his finger to the underbelly of the boat above.\n          From his belt, Shane takes a steel wand with an adhesive\n          disc attached, aims it at the fleeing boat and FIRES.\n          A cable shoots up -- THUD... The disc sticks to the\n          boat's hull. Shane pushes a button on the wand retracting\n          the cable and drawing himself closer.\n          \n          Dangling from the cruiser, Shane fixes a BOMB to the\n          hull. He releases himself from the boat and speeds away --\n          \n                           \n          \n          \n                                                                   2.\n          \n          \n          \n          BOOM. A dense explosion sends ripples through the water\n          and ELECTRICITY crackling around the boat.\n          \n          INT. FISHING BOAT/CONTROL DECK - CONTINUOUS\n          \n          A SURGE of ELECTRICAL FORCE blasts from the control\n          panel. SPARKS fly.\n          \n          The two Serbian Men jolt backwards -- WHAM -- and hit the\n          wall. All the needles inside all the dials go LIMP. The\n          roar of the engines DIES and the boat STOPS.\n          \n          EXT. PACIFIC OCEAN, UNDER THE BOAT - CONTINUOUS\n          \n          Shane slips inside the hull, through the new hole.\n          \n          INT. SEA HAWK 1 - CONTINUOUS\n          \n          The chopper slows to a hover.   The Pilot looks below.\n          \n                                 PILOT\n                    What's happening?\n          \n          EXT. PACIFIC OCEAN - CONTINUOUS\n          \n          The jet skiers protectively circle the injured boat in a\n          SYNCHRONIZED SWIMMING move, and the Jet Ski drivers are\n          simultaneously YANKED below the surface: a split second\n          later they're replaced by our SEALS (ALSO IN BLACK WET\n          SUITS AND GOGGLES) -- the switch happens in less than a\n          second, way too fast for anyone to notice.\n          \n          INT. FISHING BOAT/CONTROL DECK - CONTINUOUS\n          \n          The shaken Serbs climb to their feet.\n          \n                                 SERBIAN 2\n                    What happened?\n          \n          They look around, and see the SEALS, on the jet skis: In\n          the masks they are indistinguishable from the GUN-TOTTING\n          MEN they switched paces with. All seems clear. Serb 1\n          pushes on the throttle... nothing.\n          \n                                 SERBIAN 1\n                    We've been hit. We're taking on water.\n          \n          Suddenly the boat lists -- and water pours in, under the\n          cabin door. They spring into action!\n          \n                                 SERBIAN 1 (CONT'D)\n                    Grab the professor, quick!\n          \n                                                                    3.\n          \n          \n          \n          EXT. DECK - CONTINUOUS\n          \n          Serb 1 rushes out, shouting orders: He alerts four ARMED\n          GUARDS and the Jet Ski drivers (now our Seals).\n          \n                                 SERBIAN 1\n                    Something must be below us! Shoot! Shoot!\n          \n          The Armed Guards fire relentlessly into the water. Serb 2\n          rushes below deck.\n          \n          INT. SHIP'S HOLD - CONTINUOUS\n          \n          PROFESSOR CHARLES PLUMMER, bound to a chair and gagged,\n          tries to YELP as the room begins to flood with water.\n          \n          INT. SHIP'S CORRIDOR - SIMULTANEOUS\n          \n          Serb 2 runs down steps to the lowermost hold. He tries to\n          force the door open. When it finally opens, he is forced\n          back by a three foot wall of water.\n          \n          INT. SHIP'S HOLD - CONTINUOUS\n          \n          Professor Plummer panics, as the water rises up to his\n          mouth He struggles, but can't get free. Up to his nose,\n          over his head.... He's gone.\n          \n          Then Shane Wolf rises out of the water, hauling the\n          Professor up. He cuts the Professor's GAG. Plummer\n          screams. Shane removes his mouth piece. Shane doesn't\n          seem the slightest bit fazed by the circumstances.\n          \n                                 SHANE\n                    Lieutenant Shane Wolfe, United States\n                    Navy. I'm gonna get you outta here. But\n                    you have to do exactly what I say, when I\n                    say it. My way -- no highway option. Do\n                    you copy?\n                           (Plummer nods, terrified.)\n                    Where's the briefcase?\n          \n          The Professor gestures across the room, where a metal\n          BRIEFCASE is floating. Shane calmly HANDCUFFS it to his\n          own waist. As the water rises, to the roof.\n          \n                                 PLUMMER\n                    How did you know where I...\n          \n          Shane sticks the mouth piece into Plummer's mouth, giving\n          him his oxygen.\n          \n          EXT. ON THE DECK - SIMULTANEOUS\n          \n                                                                    4.\n          \n          \n          \n          The Armed Guards stop shooting into the water. One of\n          our SEALS calls out to them, in PERFECT SERBIAN:\n          \n                                 SEAL\n                    KEEP SHOOTING!\n          \n          The Guards fire again. The SEAL speaks into his neck mic.\n          \n                                 SEAL (CONT'D)\n                    Give it a second, they're almost out of\n                    ammo.\n          \n          The Seal calls out: \"shoot more, more!\" They do, until\n          there's nothing but empty CLICKS from their guns.\n          \n                                 SEAL (CONT'D)\n                    Now Lieutenant. Chopper's four meters at\n                    your 10 o'clock.\n          \n          INT. SHIP'S HOLD - CONTINUOUS\n          \n          Just before the water envelopes him and Plummer...\n          \n                                 SHANE\n                           (into his mic)\n                    I've got the Prof and the case. First\n                    round's on me back at Virginia Beach.\n          \n          Shane takes a deep breath, and pulls himself, the\n          Professor and the briefcase UNDER the water.\n          \n          EXT. OCEAN'S SURFACE - MOMENTS LATER\n          \n          Shane and the Professor rise to the surface as the boat\n          falters behind them. Shane pulls out a retractable\n          CROSSBOW. It clicks open and he shoots a CABLE into the\n          belly of the helicopter above him.\n          \n                                 SHANE\n                    Hold on.\n          \n          INT. HELICOPTER - A SECOND LATER\n          \n          Shane appears at the Pilot's door, holding the Professor.\n          Shane addresses the Pilot in perfect SERBIAN.\n          \n                                 SHANE\n                    You know how to swim?\n          \n          The Pilot nods, terrified. Shane TOSSES the Pilot out.\n          \n          Shane swings into the hot seat and grabs the controls,\n          pulling the Professor in behind him.\n          \n                                                              5.\n          \n          \n          \n          ON THE SURFACE OF THE WATER - CONTINUOUS\n          \n          The SEALS on the Jet Skis SALUTE Shane in the chopper,\n          then disappear gracefully back into the water.\n          \n          INT. HELICOPTER - CONTINUOUS\n          \n          Shane smiles, clearly he loves this kind of day. He looks\n          beside him, the Professor looks terrified. The Professor\n          takes out his mouth piece.\n          \n                                 PLUMMER\n                    Oh my God. I can't believe you... how'd\n                    we... That was the most incredible...\n          \n          Shane sticks the mouth piece back in the Professors'\n          mouth, shutting him up.\n          \n                                 SHANE\n                    Better keep that on `til we get to the\n                    rendezvous point.\n          \n                                 PLUMMER\n                           (through the mouth piece)\n                    Why? Poison gas?\n          \n                                 SHANE\n                           (re: the oxygen)\n                    No. I'm just not big on chit chat.\n          \n          EXT. MOUNTAIN CLEARING - A LITTLE LATER\n          \n          A Pave Hawk SH-60 helicopter, rotors whirling slowly,\n          waits. Shane's chopper appears from behind a tree line\n          and sets down atop the mountain by a stream.\n          \n          Shane and Charles sprint from the chopper towards the\n          waiting Hawk. Charles stops Shane.\n          \n                                 CHARLES\n                    Lieutenant, thank you. (He pats his\n                    briefcase) You saved more than just my\n                    life today. Can I call my wife to let\n                    her know I'm okay?\n          \n                                 SHANE\n                    Negative. Not imperative to the mission.\n                    We have to keep moving. I have strict\n                    orders to get you out of here safely.\n          \n                                 CHARLES\n                    I'm safe, Lieutenant. Please. She thinks\n                    I'm dead. (then) Don't you have a family?\n          \n                  \n          \n                                                                    6.\n          \n          \n          \n                                  SHANE\n                            (this gets him:)\n                     Make it quick.\n          \n          Charles picks up his briefcase. He holds the lock up to\n          his mouth and whispers into it:\n          \n                                  CHARLES\n                     Joe, Todd, Lulu, Peter, Tyler.\n          \n          The briefcase pops open. Shane looks at him, puzzled.\n          \n                                  CHARLES (CONT'D)\n                     My kids. It's voice activated. Designed\n                     it myself. I do security, that's my\n                     specialty. (gestures back:) Those guys\n                     back there tried to get this case open\n                     for five days -- couldn't crack it. And\n                     you should see what happens to you if\n                     open it without the code. I have a\n                     picture of my kids in here, you want to\n                     see it?\n          \n                                  SHANE\n                     Negative.\n          \n          Charles takes a cell-phone out of the case. Shane looks\n          in the case: it's EMPTY, except for the phone and a\n          family PHOTO. Charles dials his cell phone... nothing\n          \n                                  CHARLES\n                     Battery's dead...\n          \n          Shane considers, then hands him his satellite phone.\n          Charles dials, and talks...\n          \n                                  CHARLES (CONT'D)\n                     Honey, I'm alive...\n          \n          INT. PAVE HAWK - CONTINUOUS\n          \n          Shane climbs in the Hawk and approaches the cockpit.    The\n          PILOT sits, back to him.\n          \n                                  SHANE\n                     We're almost ready.    Just gives us a -\n          \n          The Pilot slumps forward... DEAD. Shane turns-\n          \n                                  SHANE (CONT'D)\n                     Professor, RUN!!!\n          \n          WHAM.   Shane drops, knocked unconscious.   All goes black.\n          \n                    \n          \n          \n                                                                   7.\n          \n          \n          \n          EXT. PAVE HAWK - MOMENTS LATER\n          \n          The helicopter is on fire. Wolf lies facedown in the\n          stream. He looks around, barely conscious.\n          \n          SHANE'S P.O.V.: Everything is a blur, in slow-motion. He\n          sees Charles, unconscious. A Huey Helicopter lands. A\n          VERY TALL MAN steps out, and takes Charles' Briefcase.\n          There is huge explosion, as the chopper ignites.\n          Everything is ablaze. Shane reaches out, grabs the\n          picture of Charles' kids then goes unconscious.\n                                                      F\n                                                      ADE TO BLACK:\n          \n          EST. HOSPITAL - DAY\n          \n          TITLE CARD: 1 Month Later\n          \n          INT. HOSPITAL - DAY\n          \n          Shane lies in a hospital bed, despondent. His arm and\n          face bandaged.\n          \n          Shane's Captain enters: BILL FAWCETT (35) -- friendly,\n          unassuming. He looks like he hasn't slept in days. Shane\n          salutes him with his bandaged arm -- it hurts to salute,\n          but he does it anyway.\n          \n                                 SHANE\n                    Captain, sir.\n          \n                                 BILL\n                    As you were Lieutenant.\n          \n          Bill sits down beside the bed. He takes a long look at\n          Shane. He holds a REPORT in his hand.\n          \n                                 BILL (CONT'D)\n                    We've been through a lot together Shane.\n                    You're the best man I ever trained. And a\n                    good friend.\n          \n                                 SHANE\n                    ... I know sir. And I except full\n                    responsibility for the mission's failure.\n          \n                                 BILL\n                    Why the hell did you let him use the\n                    satellite phone?\n          \n                                 SHANE\n                    He had to call his family. A lapse in\n                    judgement on my part that I regret sir.\n          \n                                                                   8.\n          \n          \n          \n          Bill shakes his head, disappointed. He pulls up a chair,\n          and sits opposite Shane.\n          \n                                 BILL\n                    ... Plummer was the best security expert\n                    the department of defense ever had -- a\n                    genius. He was working on a program that\n                    scrambles launch codes. He called it\n                    G.H.O.S.T.: Guided High-altitude\n                    Scrambling Transmitter. One pulse from\n                    the GHOST satellite and a country can't\n                    launch its own nukes. That's what the\n                    Serbians kidnapped him for, but they\n                    couldn't get S\n                                 inside the briefcase.\n          \n                                 SHANE\n                    The case was empty sir, as I stated in my\n                    report.\n          \n          Bill considers this. Then...\n          \n                                 BILL\n                    Not a surprise, really. Not like the\n                    professor to hide things where someone\n                    might look for them. G.H.O.S.T. is still\n                    out there, (Bill smiles:) which is why\n                    I'm going to give you another shot.\n          \n          Shane sits up. He can't believe his good fortune.\n          \n                                 SHANE\n                    Sir. Thank you. I... appreciate your\n                    confidence.\n          \n          Invigorated, he pulls off bandages, disconnects an IV,\n          and starts to rise.\n          \n                                 SHANE (CONT'D)\n                    I'll need to put a team together. I'm\n                    gonna need the mini sub, I need access to\n                    an EP3 aries 2 spy plane...\n          \n                                 BILL\n                           (interrupting:)\n                    Negative. It's not that kind of mission.\n          \n          Shane listens, intrigued.\n          \n                                 BILL (CONT'D)\n                    Two days ago, I got a call from the\n                    professor's wife... Widow. She told me\n                    someone had broken into her home.\n                    Searched the place, top to bottom.\n                                 (MORE)\n          \n                             \n          \n                                                                   9.\n                                 BILL(CONT'D)\n                    She's scared. The family's scared.\n                    Whoever killed the professor must think\n                    G.H.O.S.T. is in that house. Maybe it is,\n                    maybe it isn't. Either way, I need\n                    someone to stay at that house, and\n                    protect them. And while you're there --\n                    find out if the program is in there.\n          \n                                 SHANE\n                    That's it? Why would you want me for\n                    that, sir.\n          \n                                 BILL\n                    The professor's wife requested you.\n          \n          Shane is surprised... Bill pulls a tiny tape recorder\n          from his pocket, presses play, we hear PROFESSOR\n          PLUMMER'S voice.\n          \n                                 CHARLES (O.S.)\n                    Honey, I'm alive. Listen: A lot can\n                    happen between here and home -- if\n                    anything happens to me, call Lt. Shane\n                    Wolfe. He's a good man... anyway, I\n                    should go. I'll call you in an hour. I\n                    love you.\n          \n          Shane is shocked, hearing the dead man's voice.\n          \n                                 BILL\n                    ... You gotta problem with this mission?\n          \n                                 SHANE\n                    Sirnosir. It's just that... I've never\n                    been very good with kids, sir. Not even\n                    when I was a kid sir.\n          \n                                                               CUT TO:\n          \n          INT. SHANE'S APARTMENT - NIGHT\n          \n          Shane packs his duffel bag. He opens a drawer: There's\n          five t-shirts, identical to the one he wears. He opens\n          another drawer: Five khaki pants, also identical to the\n          one he wears. He opens the closet: There's a massive fur-\n          collared coat. Hm. He rejects it.\n          \n          Shane packs his duffel with military gear: GPS compass,\n          night vision goggles, camouflage vest, machete... they\n          all go in. Shane heads to the door, then goes back to his\n          chest of drawers. He reaches in, and pulls out a small,\n          old MEDAL: the ribbon is faded and frayed. He looks at it\n          for a moment, then unzips his suit and pins it to the\n          inside, like it's a lucky rabbit's foot.\n          \n                          \n          \n          \n                                                                   10.\n          \n          \n          \n          EXT. SUBURBAN STREET - AFTERNOON\n          \n          A taxi door opens. Shane looks like a bad ass, ready for\n          anything. He steps from the taxi onto an adorable TROLL\n          doll on the sidewalk. It SQUEAKS.\n          \n          Shane's P.O.V.: Julie's unkempt suburban house, with toys\n          all over the lawn, and a \"BLESS THIS MESS\" welcome mat.\n          \n          Shane double-checks the address. The sprinklers go off.\n          Shane darts to the door and rings the bell (it's one of\n          those long cheerful doorbells).\n          \n          WE hear TINY FEET approach -- then the door swings open,\n          Shane looks down -- and sees LULU, 8, peering up at him.\n          \n          Shane eyes Lulu. Lulu eyes Shane, then:\n          \n                                 LULU\n                    Mom! There's some weird bald guy at the\n                    door!\n          \n          SLAM. Lulu shuts the door in Shane's face. Shane frowns.\n          WE hear heavier footsteps approaching.\n          \n                                  EMALE VOICE (o.s.)\n                           (before she sees Shane:)\n                    Look, if you're with the Hare Krishnas,\n                    we're not interested...\n          \n          The door opens revealing JULIE PLUMMER. Julie holds\n          NAKED baby PETER, 2. She sees Shane, and stops, a little\n          startled by his size...\n          \n                                 SHANE\n                           (salutes:)\n                    Lieutenant Shane Wolfe, reporting for\n                    duty.\n          \n                                 JULIE\n                    Of course. I'm so sorry.   Thank you for\n                    coming.\n          \n          She hugs him. He's not quite sure what to do -- he's a\n          rock, he doesn't flinch.\n          \n                                 JULIE (CONT'D)\n                    Come in and meet the rest of the gang.\n          \n          INT. PLUMMER HOUSE/FOYER - DAY\n          \n          It's warm and quiet.   Petite Julie SCREAMS up the stairs-\n          \n                                 \n          \n          \n                                                                   11.\n          \n          \n          \n                                   JULIE\n                    KIIIDDS!!!\n          \n          Shane startles, covers his ears.\n          \n                                 JULIE (CONT'D)\n                    Get your butts down here and say \"hello!\"\n          \n          And then three pairs of feet come down the stairs. Lulu,\n          ZOE, 15, and TODD, 14 line up like the perfect family\n          portrait. Todd's hair hangs in his face. He wears a Sid\n          Vicious shirt and a long trench coat.\n          \n                                 JULIE (CONT'D)\n                    You've already met Lulu. This is Peter,\n                    Zoe and Todd. Kids, this is Lieutenant\n                    Wolfe. He's the man who is going to be\n                    staying with us for a while.\n          \n          All the kids except for Todd-\n          \n                                   KIDS\n                    Hi.\n          \n          Shane nods, stern. On the stairs, a Romanian MAID walks\n          by, carrying a BABY.\n          \n                                 JULIE\n                    And this is Helga and Tyler.\n          \n          Shane nods hello to them.\n          \n                                 SHANE\n                           (official:)\n                    Ma'am... Baby.\n          \n                                 JULIE\n                    Kids, go finish your homework.   And I'll\n                    be checking.\n          \n          Zoe, Lulu and Todd climb back up the stairs. Julie leads\n          Shane into...\n          \n          INT. LIVING ROOM - DAY\n          \n          Julie sits, Shane stands \"at ease\" (which doesn't look\n          \"at ease\" at all).\n          \n                                 SHANE\n                    You have a pleasant family, ma'am.\n          \n                         \n          \n                                                                  12.\n          \n          \n          \n                                 JULIE\n                    Charles wasn't around too much. His work\n                    took him all over the world. He'd be gone\n                    six or seven months at a time. So I\n                    think for the younger ones it's a little\n                    confusing. Zoe and Todd... well, they're\n                    dealing like your normal teenagers.\n                    Maybe in Todd's case semi-normal.\n          \n                                 SHANE\n                    Mrs. Plummer, I have to tell you that I\n                    did everything I could...\n          \n                                  JULIE\n                    Charles was in a dangerous business. I\n                    knew it when I married him. No one's to\n                    blame here.\n                            (beat)\n                    Everyone thinks that Charles told me or\n                    the kids where he hid it. And until\n                    G.H.O.S.T. is found, we're all in danger.\n          \n                                 SHANE\n                    Nothing will happen to your family as\n                    long as I'm here. I've dealt with much...\n          \n          Suddenly from behind Shane's head a DUCK appears and\n          NIBBLES his ear. Shane spins in full fight stance. He\n          sees the Duck... and relaxes. Sort of.\n          \n                                 JULIE\n                    That's Gary. He was Charles'.\n          \n          The duck QUACKS angrily. Confused, Shane returns to \"at\n          ease,\" keeping one eye on the duck.\n          \n                                 SHANE\n                    Mrs. Plummer-\n          \n                                 JULIE\n                    Call me Julie.\n          \n          Beat.\n          \n                                 SHANE\n                    ... Mrs. Plummer, I'll go secure the\n                    perimeter.\n          \n                                 JULIE\n                    I'm glad you're here-\n          \n          \n          \n          \n                                                                    13.\n          \n          \n          \n          But Shane is already gone.\n          \n                                                                 CUT TO:\n          \n          MONTAGE. MILITARY MUSIC PLAYS:\n          \n          Shane secures the area.       He paces off the yard.\n          \n          He mounts surveillance cameras in the eaves.\n          \n          He attaches contact alarms in the doors and windows.\n          \n          Shane climbs a telephone pole, opens the circuit box and\n          TAPS the phones.\n          \n          Shane, now wearing an EAR TRANSMITTER, crawls through the\n          shrubs, hiding electric eyes.\n          \n           Nighttime -- the family eats dinner. We slowly pull\n          out... through the kitchen window... and reveal Shane\n          with night vision goggles on scoping the property.\n          \n          The phone RINGS inside. Through the window, Julie\n          casually answers it. Shane touches his ear transmitter\n          and LISTENS as he walks into the house.\n          \n                                 BILL (o.s.)\n                    Julie, it's Bill Fawcett. I have some\n                    potentially good news.\n          \n                                    JULIE\n                    What is it?\n          \n                                 BILL (o.s.)\n                    A safety deposit box under Charles' name\n                    was just found in Switzerland. I think\n                    it could contain GHOST.\n          \n                                 JULIE\n                    That's wonderful. This could all be over!\n          \n                                 BILL (o.s.)\n                    There's a catch. Swiss law says only his\n                    family can access it. I'm going to need\n                    you on a plane tomorrow morning.\n          \n          INT. LIVING ROOM - NIGHT\n          \n          Shane, listening to the conversation, enters-\n          \n                                 JULIE\n                    I'll be there.\n          \n                     \n          \n          \n                                                                  14.\n          \n          \n          \n          Julie and Shane share a look.\n          \n          INT. PLUMMER HOUSE/FOYER - MORNING\n          \n          Julie, with her suitcase, Shane, Helga and the Kids stand\n          in the doorway. Zoe listens to her I-Pod ignoring the hug\n          Julie gives her.\n          \n                                 JULIE\n                    Don't worry about the Kids, Helga will\n                    handle everything. (Worried:) But if\n                    there is an emergency, all the emergency\n                    numbers are on the fridge. And on the\n                    phone. And on the back door...\n          \n                                 ZOE\n                    Mom -- we'll be fine, chill.\n          \n                                 JULIE\n                           (a little choked up:)\n                    I know, it's just... I am a mom, it's my\n                    job to worry. ... I love you guys. I'm\n                    gonna miss you. I'll be back in 48 hours.\n                    And guys, whatever Lieutenant Wolfe asks\n                    you to do... do it. Okay?\n          A\n           ll the children nod in agreement except Zoe who pops her\n          chewing gum bubble.\n          \n                                 JULIE (CONT'D)\n                    Lieutenant, I don't want you to worry\n                    about anything except the safety of my\n                    children. Helga will take care of\n                    everything else.\n          \n                                 SHANE\n                    Don't worry. They'll be safe with me.\n          \n                                 HELGA\n                    Everything will be fine, Mrs. Plummer.\n          \n          Julie gets in the car and it drives away. Shane turns\n          back to the kids who loom in the doorway.\n          \n                                 HELGA (CONT'D)\n                    Tell me, are you licensed to kill?\n          \n                                 SHANE\n                    ... No.\n          \n                                 HELGA\n                           (she frowns)\n                    Too bad.\n          \n          H\n          \n          \n          \n          \n          S\n          \n          \n          \n          \n                                                                 15.\n          \n          \n          \n          Helga trudges up the path and in.\n          \n          INT. UPSTAIRS HALLWAY - NIGHT\n          \n          Shane, on a short ladder, screws in a surveillance camera\n          into the corner of a wall when he hears:\n          \n                                 MALE VOICE (o.s.)\n                    Prepare to be annihilated!\n          \n          Lulu SCREAMS. The sound of MACHINE GUN FIRING.\n          Immediately, Shane leaps off the ladder and bounds down\n          the stairs two at a time and into the...\n          \n          INT. HOUSE/FAMILY ROOM - NIGHT\n          \n           hane rushes in -- and finds Lulu screaming and giggling\n          in front of a VIDEO GAME. Shane shakes his head.\n          \n                                 SHANE\n                    Could you turn that dow-\n          \n          And Shane spies half of Todd's face peeking around a\n          corner staring at him...\n                                 S\n                                 SHANE (CONT'D)\n                    Hey-\n          \n          Todd disappears. WAAAAA!! WAAAAA!! Shane spins, looks\n          around for the CRYING BABY... can't find him.\n          \n                                 SHANE (CONT'D)\n                    ... Where's the baby?\n          \n          Without looking Lulu points. A diapered Peter stands in\n          the half full AQUARIUM, pouring in Cheerios. Helga\n          enters holding the wailing Tyler. Gary suddenly FLIES by -\n          - WHRRP! Shane ducks. Shane scowls at Helga:\n          \n                                 SHANE (CONT'D)\n                    You run a very loose ship.\n          \n                                 HELGA\n                    You don't like it? You're the SEAL. You\n                    do something. I make bottle.\n          \n           elga stomps out. Shane heads down the hall, when in the\n          corner of his eye -- he sees A FIGURE SCURRY ACROSS THE\n          BACK LAWN. Shane turns off the light. He shuts off the\n          window alarm and sneaks out silently.\n          \n                                                                   16.\n          \n          \n          \n          EXT. PLUMMER HOUSE - BACK YARD - CONTINUOUS\n          \n          The yard is littered with toys. In the middle is a\n          TRAMPOLINE. He spots the Figure climbing the TRELLIS.\n          Shane runs, jumps onto the trampoline. He flies in the\n          air and latches onto the figure. They both tumble to the\n          ground.\n          \n          Shane yanks off the DARK FIGURE's hood, revealing SCOTT\n          (16) a nervous teenager. He's dazed, but alright, wearing\n          SHARPER IMAGE night vision goggles.\n          \n                                 SCOTT\n                    ... Zoe?\n          \n          Zoe runs out the door, setting off the PIERCING ALARM.\n          \n                                 ZOE\n                    He's my boyfriend, tool.\n          \n                                 SHANE\n                    So you're the one who broke in.\n                    Zoe -- go back inside.\n          \n                                 ZOE\n                    Okay, fine... come on Scott.\n          \n          Shane grabs Scott by the scruff of the neck.\n          \n                                 SHANE\n                    Not with this kid. (to Todd:) You --\n                    Gimme twenty!\n          \n          Freaked, Scott fumbles for his wallet and gives Shane a\n          twenty dollar BILL.\n          \n                                 SHANE (CONT'D)\n                    I meant PUSH-UPS!\n          \n          Befuddled, Scott starts to   do lame push-ups. Shane grabs\n          the back of Scott's shirt,   LIFTING him in the air,\n          spinning him away from the   house like a marionette. Scott\n          runs off, calling out from   across the street.\n                                 S\n                                  COTT\n                    ... I'll call you, Zoe!\n          \n          Zoe storms inside. Shane stands there, fuming. The\n          Alarm's still blaring. The window of the house next door\n          opens: a Korean couple, THE CHUNS, pop their heads out.\n          They're arguing with each other in Korean. Shane\n          addresses them, IN PERFECT KOREAN with subtitles:\n          \n          S\n          \n          \n          \n          \n                                 S\n          \n          \n          \n          \n                                                                17.\n          \n          \n          \n                                 SHANE\n                    My apologies. We had an intruder. A\n                    simple misunderstanding.\n          \n                                 MR. CHUN\n                           (perfect English, no accent)\n                    We speak English, Kojak.\n          \n                                 SHANE\n                    Oh. Sorry.\n          \n                                 MRS. CHUN\n                    ... Look, about the 2000 decibel alarm\n                    and the kleig lights and stuff... we own\n                    a bakery, so we're up kind of early.\n                    Would you mind?\n          \n                                 SHANE\n                    Sorry.\n          \n          Shane pulls a remote control from his pocket and clicks\n          it. The alarm stops.\n          \n                                 MR. CHUN\n                    Thanks a bunch. Oh, and we found this in\n                    our pool filter... Try to keep that zoo\n                    reigned in, huh baby-sitter?\n          \n          Mr. Chun tosses him the TROLL DOLL and slam their window\n          shut. Shane's about to head inside, he pulls a tiny\n          camera phone from his pocket, and snaps a shot of the\n          Chun's car in their driveway.\n          I\n          INT. PLUMMER HOUSE - NIGHT\n          \n           hane marches Zoe up the stairs. Loud, angry rock music\n          blares from Todd's room.\n          \n                                 SHANE\n                    Your mother thought you were in real\n                    danger. You should have told her the\n                    truth.\n          \n                                 ZOE\n                    Who do you think you are -- my dad?\n          \n          Zoe starts to turn -- then suddenly spins and tries\n          kicking him in the CROTCH. But Shane catches her foot --\n          and whirls her away. She has to hop on one foot, to not\n          fall over. He \"hops\" her down the hall to her room.\n          \n          S\n                    W\n          \n          \n          \n          \n                                                                 18.\n          \n          \n          \n                                 ZOE (CONT'D)\n                    Let me go! It's Saturday night.   I have\n                    plans!\n          \n          Zoe's back to her door, Shane flips her foot in the air.\n          Zoe falls backwards into the room. Shane shuts her door.\n          \n                                   SHANE\n                    Not anymore.\n          \n          Shane marches back down the hall, bangs on Todd's door-\n          \n                                   SHANE (CONT'D)\n                    Lights out.\n          \n                                   TODD (o.s.)\n                    Bite me!\n          \n          Shane frowns, continues down the hall. He passes the\n          NURSERY (Peter and Tyler's room), where Helga is singing\n          a lullaby: (as annoying Has something Barney might sing).\n          \n                                  ELGA\n                    When you're down and low, lower than the\n                    floor.\n                    And you feel like you ain't got a chance.\n                    Don't make a move `til you're in the\n                    groove, and do the Peter Panda Dance.\n                    Just hop three times like a kangaroo --\n          \n          She does a little \"dance\" that goes with the lullaby: She\n          hops forwards three times, then \"crab-walks\" sideways.\n          \n                                 HELGA (CONT'D)\n                    Sidestep twice, just like the crabs do.\n                    Three steps forward, one step back.\n          \n          She does. The Children, in bed -- laugh and laugh.\n          \n                                 HELGA (CONT'D)\n                    Then quick like a turtle lie on your\n                    back!\n                     riggle like a snake `til you can't no\n                    more.\n          \n           he wriggles on the floor. Then jumps up, to their beds.\n          Shane shakes his head, keeps walking-\n          \n                                 SHANE\n                    This family's in for a rude awakening.\n          \n                                   T\n          \n          \n          \n          \n                                   Z\n          \n          Z\n          T\n          \n          \n          \n          \n                                                                  19.\n          \n          \n          \n          EXT. PLUMMER HOUSE - DAWN\n          \n          The sun rises over the neighborhood, warm orange light.\n          \n          INT. HOUSE - SAME TIME\n          \n          Everyone is asleep. In the bedrooms, a SERIES OF SHOTS:\n          \n          L\n          Tyler snores in his crib.       Peter in his bed.\n          \n           ulu is surrounded by stuffed animals.\n          \n           odd is out cold, motionless.\n          \n           oe is wrapped in blankets. Until A TRUMPET BLARES\n          \"REVEILLE\"! Zoe jumps, like she's been electrocuted.\n          \n                                     OE\n                    Huh?   Wha--?!\n          \n          INT. TODD'S ROOM - MORNING\n          \n          Todd sits up, disoriented, not understanding what's\n          happening. The Whistle GETS LOUDER. Suddenly his door\n          flies open -- and Shane strides in with a BOOM BOX. Todd\n          blinks groggily.\n          \n                                 TODD\n                    W-what are you doing??!\n          \n                                 SHANE\n                    You're burning daylight. Move.       Move.\n          \n                                  ODD\n                    It's Sunday...!\n                           (he squints at a clock)\n                    And it's six a.m. You're insane.\n          \n          Todd pulls the blanket over his head. Shane flips the\n          mattress over spilling Todd to the floor.\n          \n                                   SHANE\n                    Now move it!\n          \n          Todd scrambles to his feet and out the door.\n          \n          INT. HALLWAY - CONTINUOUS\n          \n          All the little kids are CRYING. Covering their ears.\n          Helga runs through in hair curlers, half-asleep and\n          angry, carrying the crying baby.\n          \n                                   L\n          \n          \n          \n          \n                                                                20.\n          \n          \n          \n                                 HELGA\n                    (She curses in Romanian)\n          \n                                 SHANE\n                    Hey. Not in front of the kids.\n          S\n           he gives him a look of disbelief.\n          \n                                 HELGA\n                    What's it matter? Nobody speaks Romanian.\n          \n                                 SHANE\n                    Usca mi-as chilotii pe crucea lu mata!\n          \n          Helga narrows her eyes, shocked.\n          \n                                 HELGA\n                    (She curses Again, in Romanian.)\n          \n          Shane's jaw drops.\n          \n          INT. KITCHEN - LATER\n          \n          The children are assembled, lined up tallest to shortest.\n          At the end on the floor is Baby Tyler, sucking on a\n          bottle. Shane firmly starts his Patton speech:\n          \n                                 SHANE\n                    Listen up, ladies. Your behavior is\n                    unacceptable. In order to maintain a\n                    state of safety we need to maintain a\n                    state of discipline and order. I've only\n                    got one rule: Everything is done my way.\n                    No highway option. Do you copy?\n          \n                                   LULU\n                    Do you copy?\n          \n                                  SHANE\n                    What?   I said -- do you...\n          \n                                  LULU\n                            (\"copying\" him)\n                    What?   I said -- do you...\n          \n                                 SHANE\n                    Do not copy me!\n          \n                                  ULU\n                    Make up your mind.\n          \n                                 L\n          \n          \n          \n          \n                                                                  21.\n          \n          \n          \n          Shane starts to speak then thinks better, he's furious.\n          Everyone stares blankly -- a tense silence. It's broken\n          by the sound of a large AIR BUBBLE from the aquarium.\n          \n                                    ULU (CONT'D)\n                    P\n                     eter farted.\n          \n          Everyone cracks up. Shane tries to maintain decorum. He\n          reaches into his bag and unpacks a set of small high-tech\n          SECURITY BRACELETS with a red light and a covered button.\n          He straps one to each Kid's wrist.\n          \n                                 SHANE\n                    Tracking devices. Now that I know I can't\n                    trust you... Never take them off. The\n                    panic button is only for emergencies.\n                    Touch that -- you better be dying, or\n                    you're dead.\n          \n                                 ZOE\n                    I am not wearing that. Just because my\n                    mom's paranoid doesn't mean we have to\n                    take orders from you.\n          \n          He yells at her, Marine sergeant style:\n          \n                                 SHANE\n                    Let me explain how the chain of command\n                    works. I tell you what to do -- and you\n                    do it. End of chain. Now I'm not gonna\n                    have time to learn your names. So you are\n                    -- (pointing) Red 1, Red 2, Red Leader,\n                    Red baby... wait, where's the older male?\n                    There were five.\n          \n                                 HELGA\n                           (mysterious)\n                    He walks like Dracula, with footsteps\n                    silent like death --\n          \n          Shane looks to Zoe for translation.\n          \n                                 ZOE\n                    He's in his room.\n          \n          Angry, Shane bounds up the stairs.\n          \n          INT. UPSTAIRS HALLWAY - SAME TIME\n          S\n           hane marches to Todd's shut door. He tries the knob,\n          but it's locked. Shane bangs hard on it.\n          \n          S\n          \n          \n          \n          \n                                                                  22.\n          \n          \n          \n                                   SHANE\n                    Red 4!    Open this door!\n          \n          No answer. Shane turns away from the door and DONKEY\n          KICKS it...SMASH! The wood CRACKS, then CRASHES inward.\n          The entire frame collapses.\n          \n          INT. TODD'S ROOM\n          \n           hane charges in-\n          \n                                 SHANE\n                    It didn't have to go down like-\n          \n          Todd isn't there. Down the hall -- a FLUSH. Oops.\n          \n          INT. HALLWAY - NIGHT\n          \n          The bathroom door opens, and Todd comes sauntering back.\n          He sees Shane, the destroyed door and wall...\n          \n                                 SHANE\n                    All I need is a hammer and some plaster\n                    of Paris. I can fix this.\n          \n          A piece of the ceiling falls, hits Shane on the head.\n          \n                                 TODD\n                    Can I get by?\n          \n          Embarrassed, Shane steps aside, then mutters-\n          \n                                 SHANE\n                    Here's your bracelet. If you'd been\n                    wearing it, this wouldn't have happened.\n          \n          Shane SNAPS it onto Todd's wrist, and head down the hall,\n          patrolling. Zoe comes up the stairs, to her room. She\n          stops at Todd's door -- they glare at Shane.\n          \n                                 ZOE\n                    He has to go.\n          \n          Todd nods in agreement.\n          \n          INT. PLUMMER HOUSE - MORNING - LATER\n          S\n           hane does one-handed push ups in the living room while\n          the Duck watches. With his other hand he loads the PHOTO\n          of the Chun's license plate into his laptop computer.\n          His head shifts, he hears something suspicious -- the\n          rumble of a car approaching.\n          \n                                    L\n          \n                                    S\n          \n          \n          \n          \n                                                                   23.\n          \n          \n          He rushes for the front door, clicks his alarm remote and\n          opens it, just as -- WHACK -- the MORNING PAPER connects\n          with his face, hard. From off-screen we hear a PAPERBOY.\n          \n                                    PAPERBOY (O.S.)\n                    SORRY DUDE!\n          \n          Shane rubs his nose. Lulu screams at the top of her\n          lungs. Shane turns, to see that Peter is chasing her,\n          wearing a towel as a sheet. He pretends to be a ghost.\n          \n                                    PETER\n                    Whhhoooooo!\n          \n                                 LULU\n                    Stop it, Peter!\n          \n          Lulu hides behind Shane. Peter Booos again. Lulu screams.\n          \n                                 SHANE\n                    Hey, hey, good soldiers aren't afraid of\n                    anything.\n          \n                                 LULU\n                    This house is haunted. Daddy even said\n                    so. He said there's a ghost.\n          \n          And then it hits Shane.       His eyes light up.\n          \n                                  SHANE\n                    Really?   And where is this ghost?\n          \n                                     ULU\n                    I don't know.     I've never seen it.\n          \n          INT. HALLWAY - LATER\n          \n          Shane walks slowly down the hall. As he walks he glides\n          his hands along the wall, feeling, pushing, scanning the\n          ceiling. Searching.\n          I\n          INT. STAIRWAY - SAME TIME\n          \n          Todd and Zoe kneel on the stairs. They surreptitiously\n          pour COOKING OIL all over the wood.\n          \n          Then -- a creak. Zoe whispers.\n          \n                                 ZOE\n                    Here he comes...!\n          \n          Zoe and Todd run downstairs and hide behind the couch.\n          \n          F\n          \n          \n          \n          \n                                                                24.\n          \n          \n          \n          Shane strides to the top step and RAPS on the wall. He\n          RAPS again, listening for hollow spaces. Nothing. Shane\n          lifts his left foot out to take a step down...\n          \n          When he hears an alert from his laptop. He goes back to\n          the living room, then turns his attention to his laptop.\n          MR. Chun's photo appears next to a VEHICLE REGISTRATION.\n          Shane scans it...\n          \n          Todd and Zoe's faces fall. The footsteps again-\n          \n                                 TODD\n                    He's coming back-\n          \n          But Helga, carrying a huge laundry basket, appears, takes\n          a step onto the stairs --\n          \n                                  HELGA\n                    AHHH!!!\n          \n          BUMP! BUMP! BUMP! She flies down the greased stairs,\n          BANGING her head and ass on each step, all the way down.\n          \n            inally, BAM! Helga HITS the bottom with a mighty crash.\n          She screams, as laundry flutters down from above.\n          T\n           IGHT - ZOE AND TODD\n          \n          They gulp, terrified.\n          \n                                  ZOE\n                    Uh-oh.\n          \n          EXT. SWISS BANK - DAY\n          \n          Establishing.\n          \n          INT. SWISS BANK - DAY\n          \n          Bill and Julie, looking jet-lagged, sit across a desk\n          from a SWISS BANKER. He seems to be about 100 years old.\n          He's reading a HUGE stack of paperwork with a magnifying\n          glass, mouthing along in FRENCH. It's taking him a LONG\n          time. They wait patiently -- til their patience runs out.\n          \n                                 BILL\n                    As we discussed, this is an urgent\n                    matter.\n          \n          The Banker puts up a finger to \"shush\" him. Then looks\n          back to the paperwork, then licks his finger to turn the\n          page. He licks his finger again, but can't get the page\n          to turn.\n          \n                                                                     25.\n          \n          \n          He feebly gets up, and shuffles across the room to a\n          WATER COOLER. He fills a paper cup with water and\n          shuffles back to his desk. He dips his finger in the\n          water to turn the page.\n          \n                                 JULIE\n                    Can't you call somebody? Do something to\n                    get us around all this paperwork?\n          \n                                 BILL\n                    Sorry. Not in Switzerland, I can't.\n          \n           Bill can't stand it anymore. He jumps to his feet.\n          \n                                  BILL (CONT'D)\n                    This is absurd. If we can't get some\n                    faster service, we're going to have to\n                    file a complaint.\n          \n          The Banker looks at him blankly.\n          \n                                   BANKER\n                    Marcel!\n          \n          Another Banker, MARCEL, enters.\n          \n                                   MARCEL\n                    Oui.\n          \n                                 BANKER\n                    Je ne comprende pas.\n          \n                                 MARCEL\n                           (to Bill and Julie:)\n                    I'm so sorry, the chief does not speak\n                    English. But I can tell you -- you will\n                    have access to the box tout-suite. As\n                    soon as your background checks clear.\n          \n                                 JULIE\n                    Thank you. How long is that?\n          \n          INT. PLUMMER HOUSE - SAME TIME\n          \n          Helga, suitcases in hand, heads to the door -- Shane\n          tries to block her path. Peter's in the aquarium. The\n          duck flies around, QUACKING.\n          \n                                    HELGA\n                    AGGH!     These brats!   Sugi Pula!\n          \n                                 SHANE\n                    Red Leader, remain calm --\n          \n          \n                                                                   26.\n          \n          \n          \n                                 HELGA\n                    I am calm. I QUIT, that makes me calm!\n          \n                                 SHANE\n                    Let's not be hasty.\n          \n          Suddenly, RING! Amid the chaos, Shane moves for the\n          phone. Helga takes the opening and runs for the door. He\n          grabs her suitcase. As she tries to wrestle it away,\n          Shane picks up the receiver.\n          \n                                 SHANE (CONT'D)\n                    Hello---\n                           (sees Helga crawling away)\n                    Don't even think about it.\n          \n          The suitcase handle breaks off, and Helga dashes for the\n          door. Shane dives, grabbing her foot. He DRAGS her back.\n          \n                                 SHANE (CONT'D)\n                    Ah, Mrs. Plummer.\n                           (covering the phone, so Julie\n                            can't hear the struggle)\n                    No no -- everything's fine. You're gonna\n                    be gone how much longer?\n          \n           here's a pause, the camera DOLLY/ZOOMS as he says it:\n          \n                                 SHANE (CONT'D)\n                    Five business days?\n          \n           elga's shoe comes off -- Helga falls forwards, and Shane\n          falls back, against the counter.\n          \n                                 SHANE (CONT'D)\n                    That is not a problem. Just doing my...\n          \n          He picks up his hand, that landed on a diaper.\n          \n                                 SHANE (CONT'D)\n                    Duty.\n          \n          Helga's at the door. Shane body-checks it closed. Helga\n          struggles to get him off. CRUNCH. Helga chomps down on\n          Shane's hand...\n          \n                                 SHANE (CONT'D)\n                    Ah! Things are GREAT!!! You do what you\n                    have to do.\n          \n          Shane lets go. Helga scampers out the door.\n          \n          \n          \n          \n                                                                    27.\n          \n          \n          \n                                 SHANE (CONT'D)\n                    Take care, Mrs. Plummer.\n          \n          Shane hangs up the phone, as Helga makes a dash down the\n          path to a waiting cab.\n          \n          EXT. HOUSE - CONTINUOUS\n          \n          Shane chases Helga to the cab.\n          \n                                 SHANE\n                    Red Leader! I command you to come back!\n                    That is a direct order! You can't leave\n                    a man behind!!\n          \n          Helga jumps in the cab.\n          \n                                 SHANE (CONT'D)\n                           (SCREAMING)\n                    I don't know the Peter Panda song!!\n          \n          As the cab pulls away, in the rear window, Helga glares\n          back, then does an obscene Romanian hand gesture.\n          \n          ANGLE - SHANE\n          \n          His jaw drops in disbelief. He drops his head, defeated.\n          Then -- he slowly glances up.\n          \n          ACROSS THE STREET\n          \n          The Korean couple is staring at him, dumbfounded.\n          \n                                 KOREAN WOMAN\n                    Don't worry, if she loves you, she'll\n                    come back.\n          \n          ANGLE - SHANE\n          \n          Rises, takes a deep breath and strides inside.\n          \n          INT. HOUSE - CONTINUOUS\n          \n          Shane enters... to find the kids are all gloomy.    The\n          baby cries. Shane awkwardly picks the baby up.\n          \n                                 SHANE\n                    Okay, listen up. There's been a change of\n                    plans. Your mom's not coming back as\n                    soon as she thought...\n          \n          \n          \n                                                                     28.\n          \n          \n          \n                                   LULU\n                             (worried)\n                      When is she coming back?\n          \n                                   SHANE\n                      Soon. In the meantime, we're just gonna\n                      have some more big fun.\n          \n                                   TODD\n                      That's what we've been doing?\n          \n                                   LULU\n                      But tomorrow's a school day.\n          \n                                   ZOE\n                      I need a signed release for Driver's Ed!\n          \n                                   LULU\n                      I've got Brownies!\n          \n          Shane reacts, inundated.\n          \n                                   SHANE\n                      Whoa, WHOA! HALT! We'll take this hill\n                      one inch at a time. Only then can we\n                      rise to the challenge. All for one, and\n                      one for all!\n          \n                                   LULU\n                             (singing)\n                      \"Be all that you can be!\"\n          \n                                   SHANE\n                      That's Army. I'm Navy.     But I appreciate\n                      your enthusiasm.\n          \n              nice moment.   Until -- FWRPPPP!\n          \n                                   SHANE (CONT'D)\n                      Tell me that was the duck?\n          \n          FWRPPP!    WE zoom in on the baby's leering face.\n          \n           hane quickly moves the Baby away from his body. Pure\n          self-preservation, everyone bolts from the room.\n          \n                                    SHANE (CONT'D)\n                      Hey.   HEY!\n          \n          Nobody will help.     Even Peter runs, holding his nose.\n          \n          \n                                                                  29.\n          \n          \n          \n          CLOSE-UP - SHANE\n          \n          He gulps.\n          \n          INT. BATHROOM - MOMENTS LATER\n          \n          Shane enters, holding out the Baby at full arm's length.\n          He lowers Tyler onto a changing pad, takes a deep breath,\n          then pulls out PLIERS and a SCREWDRIVER. Using the tools\n          as chopsticks, he cautiously unfastens the diaper... And\n          then -- it flops open. SShane GROANS, repelled.\n          \n                                   SHANE\n                      The things I do for my country.\n          \n          Shane tries approaching -- he can't do it. Aghast, he\n          looks around for a solution. Then: Shane picks up the\n          Baby and dips the bottom half in the toilet, then\n          FLUSHES, over and over and over.\n          \n          INT.   HALLWAY - NIGHT\n          \n          Shane patrols the hall, making sure all the doors and\n          windows are locked. Lulu is in her pj's.\n          \n          A hand tugs on Shane's shirt, he looks down to see Lulu.\n          \n                                   LULU\n                      Hi. Zoe thinks you look like the Hulk. I\n                      think you're cute.\n          \n                                   SHANE\n                             (unsure how to respond...)\n                      Thank you.\n          \n          Lulu doesn't go away, she just stares at him, it starts\n          making Shane uncomfortable.\n          \n                                   LULU\n                      Do you know Kung Fu?\n          \n                                     SHANE\n                      Affirmative.\n          \n                                   LULU\n                      Did you ever punch someone so hard that\n                      their head came off?\n          \n           hane walks away from Lulu. She follows. Shane is again\n          twirling the MEDAL in his fingers. Lulu follows at his\n          heels, like a puppy.\n          \n                       \n          \n                                                                  30.\n          \n          \n          \n                                 LULU (CONT'D)\n                    What's that medal for?\n          \n                                 SHANE\n                    None of your business.\n          \n                                 LULU\n                    I'll trade you a SpongeBob button for it.\n          \n          Shane walks room to room, pulling down the shades on\n          every window.\n          \n                                 LULU (CONT'D)\n                    Is that so people can't hurt us?\n          \n          He bends down to her level, and tries to sound sweet:\n          \n                                 SHANE\n                    I think -- it's time for you take a nappy-\n                    poo, in beddibye land, little girl.\n          \n          Lulu looks at him, like he's an idiot.\n          \n                                 LULU\n                    Do I look like I'm five to you?\n          \n          Lulu sulks off to bed, and shuts off her light.\n          \n          All the lights are out, all the kids asleep. Shane\n          breathes a sigh of relief, and patrols.\n          \n          INT. KITCHEN - BREAKFAST - MORNING\n          \n          The Kids are dressed for school. On the table in front of\n          each place is a tan BAG. The kids sit down at their\n          designated spots, confused by the MRE's (MEALS READY TO\n          EAT) in front of them.\n          \n                                 SHANE\n                    What are you waiting for?    Dig in.\n          \n          Todd, Lulu and Zoe all tear open their bags.\n          \n          Todd pulls out a bag of CORN BEEF HASH and a Snickers\n          bar. Zoe pulls out a bag of FETTUCCINE ALFREDO and some\n          matches. Lulu takes out a bag of turkey slices and a\n          coffee packet. Shane smiles, proud of his accomplishment.\n          The Kids stare at \"breakfast,\" dubious.\n          \n                                 SHANE (CONT'D)\n                    Don't worry, I can get lots more of\n                    those. And I've survived off this stuff\n                    for months.\n          \n                                \n          \n          \n                                                                  31.\n          \n          \n          \n                                 ZOE\n                    Like I'm really gonna eat all those\n                    carbs.\n          \n          Shane turns to address them:\n          \n                                 SHANE\n                    Okay, ladies. Your mama -- is not here to\n                    take care of you now. So -- here's how\n                    it's gonna be. We're gonna pull together,\n                    all for one, one for all. If I say in,\n                    you stay in, if I say out, you go out...\n          \n          Peter stands in his chair, dancing...\n          \n                                 PETER\n                    Ba ba do the hokie pokey...\n          \n                                   SHANE\n                    I did not say at ease!\n          \n          Peter's eyes fill with tears.\n          \n                                 ZOE\n                    He's only two, he doesn't have any idea\n                    what you're talking about. I don't have\n                    any idea what you're talking about...\n          \n          Shane sighs. Lulu asks Shane:\n          \n                                 LULU\n                    Can you kill a man with your bare hands?\n          \n                                 SHANE\n                    You play too many video games. (then:)\n                    Yes.\n          \n                                 LULU\n                    ... I can cross my eyes. Wanna see?\n          \n                                  SHANE\n                    Negative.\n          \n          Lulu crosses her eyes at Shane, then at Tyler -- who\n          SCREAMS at the top of his lungs. Shane turns to Lulu.\n          \n                                 LULU\n                    Tyler hates it when I do that...\n          \n          Peter starts bawling, too. He runs away, crying. The\n          table cloth is yanked to the floor. And the phone rings.\n          Shane answers, trying to hear over the screaming.\n          \n          \n          \n                                                                32.\n          \n          \n          \n                                 SHANE\n                    Plummer residence... yes, I know it's\n                    Monday. Oh. Thank you, sir.\n          \n          He hangs up. Zoe smiles at him, innocently.\n          \n                                 ZOE\n                    Who was that?\n          \n                                 SHANE\n                    Your vice principal. He said if you're\n                    late again, you and Todd are expelled. He\n                    wants to see you in his office. With your\n                    ... legal guardian.\n          \n          INT. GARAGE - MOMENTS LATER\n          \n          The garage door opens, dramatically unveiling Shane. He's\n          wearing Tyler in a SNUGGLE. Across his chest, he's got a\n          bandoleer of baby-bottles and juice boxes. Shane can't\n          hide his contempt as he sees: Julie's WHITE MINIVAN. A\n          bumper sticker declares \"World's Greatest Mom.\" Shane\n          puts Tyler in a CAR SEAT. Its interlocking buckle\n          connects FOUR WAYS. Shane fumbles with it for a while.\n          It just doesn't add up...\n          \n                                 LULU\n                    We're gonna be late.\n          \n                                 SHANE\n                    Not on my watch.\n          \n          Shane TIES the buckles in a fancy knot.\n          \n          EXT. GARAGE - MOMENTS LATER\n          \n          The car speeds out of the drive, backwards at sixty\n          m.p.h.. It does a skidding 180 and heads down the street.\n          \n          EXT. EAST BETHESDA K-12 SCHOOL - 9:29 A.M.\n          \n          A big suburban school, Busses and PARENTS are parked at\n          the curb, STUDENTS of all ages are hurrying inside. The\n          Minivan skids completely sideways, into a TINY parking\n          spot -- a death defying, perfect parallel park.\n          \n          INT. PRINCIPAL'S OFFICE - MOMENTS LATER\n          \n          CLOSE UP ON: a stopwatch. It hits ZERO, and at that\n          moment, the SCHOOL'S BELL RINGS.\n          \n          Holding the stopwatch is the VICE PRINCIPAL MURNEY\n          (50's). He's HUGE and mean.\n          \n                  \n          \n          \n                                                                33.\n          \n          \n          \n                                 MURNEY\n                    I always said these kids didn't need a\n                    baby sitter, they needed a parole\n                    officer. Looks like Mrs. Plummer finally\n                    listened.\n          \n          He glares at Shane, and the Kids: Shane sits with Tyler\n          in a Snuggle, holding Peter on a harness, as he plays on\n          the floor. The Kids are seated around him, mortified.\n          \n                                  MURNEY (CONT'D)\n                           (To Shane)\n                    What's your name, son?\n          \n                                 SHANE\n                    Wolfe. Shane. Lieutenant. I'm in charge\n                    of watching these kids for... a few days.\n          \n          Murney is unimpressed.\n          \n                                 MURNEY\n                     aby-sitter huh. Well, whatever work you\n                    can get. I'm Murphy. Duane. V.P in charge\n                    of discipline, conduct and truancy. Top\n                    to bottom, K thru 12. You're in my house\n                    now, boy. I coach wrestling, too. (re:\n                    Todd:) And the creeper here played hookey\n                    from every wrestling practice this month.\n          \n          The Kids crack up. Murney is furious.\n          \n                                 MURNEY (CONT'D)\n                    She's missed twenty-two Driver's Ed\n                    classes. Out of twenty-three. They're the\n                    worst students in my school.\n          \n                                    OMAN'S VOICE\n                    Your school?\n          \n          Murney grimaces as PRINCIPAL CLAIRE NELSON (early 30's)\n          enters. She's attractive, assured, tough. He withers.\n          \n                                 PRINCIPAL CLAIRE\n                    Good morning kids. What are you doing in\n                    my office, Murney?\n          \n                                 MURNEY\n                    I was explaining, that as vice principal,\n                    I am in charge of....\n          \n          \n                                                                     34.\n          \n          \n          \n                                 PRINCIPAL CLAIRE\n                    Very little. I thought I asked you to\n                    find out who stuck to the baloney slices\n                    to the cafeteria ceiling with mustard?\n          \n                                 MURNEY\n                    I'm got some leads. (then, confidential:)\n                    My informant's about to crack.\n          \n                                 PRINCIPAL CLAIRE\n                    Then hop to it. I think I can handle this\n                    from here.\n          \n          The opens the door for Murney. He exits, fuming.     The\n          BELL rings.\n          \n                                 SHANE\n                    Red 1, Red 2. Get moving.\n          \n          The teens hustle off to their classes. Shane checks his\n          TRACKER -- two little red DOTS move away. Good.\n          \n          Principal Claire eyeballs him... staring him up and down,\n          as he casually holds the three kids.\n          \n                                 PRINCIPAL CLAIRE\n                    So. You're the new baby-sitter?\n          \n                                 SHANE\n                    Bodyguard. You see, Mrs. Plummer called\n                    my captain, she thought the kids needed -\n          \n                                 PRINCIPAL CLAIRE\n                    It's okay, Lieutenant, I was briefed of\n                    the situation by Mrs. Plummer. She told\n                    me all about you.\n          \n          She notices NAVY SEAL tattoo on his upper arm. Claire\n          sees this -- and suddenly reacts, impressed.\n          \n                                 PRINCIPAL CLAIRE (CONT'D)\n                    Lieutenant, huh? You with \"The Teams?\"\n                           (Shane nods.)\n                    Petty Officer Third Class Claire Nelson\n                    at your service.\n          \n                                 SHANE\n                    ... You're kidding?\n          \n                                 PRINCIPAL CLAIRE\n                    Four years at Naval base Coronado.   The\n                    Service paid for my college.\n          \n          \n          \n                                                                   35.\n          \n          \n          \n          Shane stares not sure whether to believe. On the spot,\n          Claire looks nervously around. She lifts her pants leg...\n          revealing a tiny ANCHOR TATTOO on her ankle.\n          \n                                   SHANE\n                      \"Honor, Courage...\n          \n                                   PRINCIPAL CLAIRE\n                      Commitment\". That's the way I live my\n                      life, and the way I run my school.\n          \n                                   SHANE\n                      Can't be too careful. So. Permission to\n                      stick around and keep eyes on the kids?\n          \n          She smiles.\n          \n                                   PRINCIPAL CLAIRE\n                      Permission granted. Welcome aboard. Just\n                      try not to frighten the children.\n          \n                                   SHANE\n                      No one will even notice I'm here.\n          \n                                                          JUMP CUT TO:\n          \n          EXT. EAST BETHESDA K-12 SCHOOL - MID-MORNING\n          \n          Shane, dead serious, (Tyler in Snuggle) is riding the see-\n          saw in the school's playground. Peter rides on the other\n          side with a group of KIDS, to balance Shane. Shane types\n          on his laptop: CLAIRE NELSON. A picture of Claire in a\n          Naval uniform pops up as well as her stats...\n          \n                                   SHANE\n                      Clean as a whistle.\n          \n          Shane closes the computer, picks up a pair of binoculars.\n          \n           BINOCULARS P.O.V. as Shane goes from window to window of\n          the school: Zoe is glaring at him through the window from\n          her seat in a class. Todd, sitting in the back row of a\n          class, yanks his hood over his head. Lulu waves from 2nd\n          Grade, delighted.\n          \n          Along line of FIRST GRADERS wait for the seesaw.\n          \n                                   SHANE (CONT'D)\n                      Back off. Official Business.\n          \n                           \n          \n          \n                                                                36.\n          \n          \n          \n          ON THE PLAYGROUND:\n          \n          Shane stands with his Baby snuggle. Peter is running in\n          circles around him on his harness, like a tether ball. He\n          checks his tracking device...\n          \n          INT. CAFETERIA - LUNCH TIME\n          \n          BINOCULARS P.O.V.: Five hundred students eat at long\n          tables. Zoe, with a group of HIP FRIENDS, turns her back\n          to him embarrassed. Todd, in line to get lunch, does the\n          same. Lulu sees Shane and waves.\n          \n          Shane puts down his binoculars. He turns to the person in\n          front of him, with stern intensity.\n          \n                                 SHANE\n                    Give up now. Save us both a world of\n                    pain. Now -- last time: Open the hanger,\n                    Black Hawk coming in.\n          \n          Reveal: Shane is talking to Tyler, in his safety seat --\n          trying to get him to eat. Beside Shane, Peter is\n          destroying a sandwich with animal crackers.\n          \n                                 SHANE (CONT'D)\n                    Open in T minus three, two, one...\n          \n          Tyler gurgles, ignoring him. Shane sighs. Principal\n          Claire sits next to Shane with her lunch tray.\n          \n                                 PRINCIPAL CLAIRE\n                    What would you say is the secret with\n                    kids, Mr. Wolfe?\n          \n                                 SHANE\n                    Show no weakness.\n          \n                                  RINCIPAL CLAIRE\n                    I'll drink to that. (she toasts, with\n                    milk.) Shane... Can I call you Shane?\n          \n                                 SHANE\n                    ... Sure.\n          \n                                 PRINCIPAL CLAIRE\n                    So. When you agreed to serve your\n                    country, I bet you didn't know you'd be\n                    serving creamed bananas to one year olds,\n                    huh?\n          \n          Shane gives her a look. Principal Claire smiles.\n          \n                     \n          \n                                                                   37.\n          \n          \n          \n                                 SHANE\n                    Hey -- I out rank you, you know.\n          \n                                 PRINCIPAL CLAIRE\n                    Not here, you don't. You're on dry land,\n                    lieutenant. (she looks at his chair)\n                    Well, not so dry where you're sitting, I\n                    guess.\n          \n          Shane sees that Tyler is pouring his juice Box all over\n          Shane's pants. He yanks Tyler away from him.\n          \n                                 SHANE\n                    Oh, man...\n          \n          Tyler starts to cry -- but Shane stops him from crying by\n          making a funny face. Tyler laughs. Claire smiles.\n          \n                                 PRINCIPAL CLAIRE\n                    Don't take this personally -- but you're\n                    pretty good at this. Seriously, I'm\n                    impressed. A whole day, and all three\n                    Plummer's stayed out of trouble.\n                    That's... unusual.\n          \n          Suddenly there's a huge crash around the corner, and the\n          sound of Students in an uproar. Shane hands Tyler off to\n          the Principal and leaps over the table...\n          \n          INT. LUNCH-LINE - CONTINUOUS\n          \n          Students are in a ring, cheering, as four STUDENTS in\n          Wrestling Jackets hold Todd. One reaches down and gives\n          Todd a \"wedgy\" then another WRESTLER punches him. Todd\n          slips out of their hold and decks the Wrestler. VP Murney\n          is watching, but not stopping it. Zoe, in the crowd,\n          cheers Todd on:\n          \n                                 ZOE\n                    Kick his butt, Todd!\n          \n          Shane and Claire push through the Students. As soon as\n          they see the Principal, the crowd freezes.\n          \n                                  RINCIPAL CLAIRE\n                    Who started this?\n          \n          Silence. Then vice principal Murney steps forward.\n          \n                                 MURNEY\n                    He did. (Todd)\n          \n          \n                                                                    38.\n          \n          \n          \n                                 PRINCIPAL CLAIRE\n                    Todd started a fight with five students\n                    at once?\n          \n          Shane turns to Todd, and \"punches fists\" with him,\n          impressed.\n          \n                                 MURNEY\n                    The kid's mixed up. Look at him.\n          \n                                 PRINCIPAL CLAIRE\n                    If I catch anyone on the team fighting\n                    again, next week's tournament is off. I\n                    don't care who starts it.\n          \n          Murney smirks, and gives her a \"I'll handle it\" wink.\n          \n                                 MURNEY\n                    You heard the lady. Any more fighting and\n                    there'll be no more wrestling. Personally\n                    I think that's a little harsh. Boys'll be\n                    boys. (low, to Todd:) `Scept for Plummer\n                    here.\n          \n          Todd lunges at him. Shane effortlessly grabs Todd and\n          Judo FLIPS HIM -- Todd lands on his feet, sticking the\n          landing. No one is more Ssurprised than Todd and Shane.\n          \n                                 SHANE\n                    ... Nice moves, man.\n          \n          The Bell rings, the crowd breaks up. Murney approaches\n          Shane.\n          \n                                 MURNEY\n                    Pretty slick, Frogman -- I'm a black belt\n                    myself. S'why they asked me to coach the\n                    wrestling team.\n          \n          Murney makes a loud Kung Fu CRY and throws a punch,\n          stopping an inch from Shane's head. Shane doesn't flinch.\n          \n                                 MURNEY (CONT'D)\n                    See -- total control. Maybe you could\n                    stop by practice, we'd show the boys how\n                    a couple of pros do it, what do you say?\n                    Come on, promise I'll go easy on you.\n          \n                                 SHANE\n                    ... Sorry, sir. I'm on duty.\n          \n                           \n          \n          \n                                                                39.\n          \n          \n          \n                                 MURNEY\n                    Oh, yeah. That's right. I forgot you had\n                    to baby-sit. Maybe some other time then.\n          \n          Shane puts an arm over Todd's shoulder. Todd shakes him\n          off and heads to class. Murney snickers to Claire:\n          \n                                 MURNEY (CONT'D)\n                    Looks like pretty boy there's all bark\n                    and no bite.\n          \n                                 PRINCIPAL CLAIRE\n                    ... Don't even think it, Murney. He'd\n                    kill you so fast, I wouldn't even have\n                    time to get my camera.\n          \n          INT. SCHOOL HALLWAY - 2:55\n          \n          Shane looks exhausted. Peter is asleep in his shoulder,\n          Tyler is crying, as he keeps watch. The Principal strolls\n          up.\n          \n                                 PRINCIPAL CLAIRE\n                    Another day, another dollar twenty, minus\n                    taxes... aren't you gonna change him?\n          \n                                 SHANE\n                    I'd love to, for one who'll eat, and not\n                    cry.\n          \n                                 PRINCIPAL CLAIRE\n                    That's not what I mean, Lt.\n          \n          Then Shane smells what she means -- Tyler's diaper is\n          full. Shane recoils in disgust, holding Tyler out like a\n          grenade.\n          \n                                 SHANE\n                    Oh -- change him. Roger that. Uh...\n          \n          Panicked, he pushes Tyler towards the Principal.\n          \n                                 PRINCIPAL CLAIRE\n                    Sirnosir. Not my job.\n          \n                                 SHANE\n                    But...\n          \n                                 PRINCIPAL CLAIRE\n                    Instructions are right on the box.\n                    Bathroom's down the hall. Have fun.\n          \n                                                                   40.\n          \n          \n          \n          Just then, an alarm in his Jacket GOES OFF. He looks at\n          his tracker: it's flashing RED 3 RED 3. Shane hands off\n          Peter and Tyler to the Principal.\n          \n                                 SHANE\n                    Emergency!\n          \n          INT. 2ND GRADE HALLWAY - CONTINUOUS\n          \n          Shane runs down the hall, following his tracking device.\n          It leads him to a door. He bursts though it, doing a\n          shoulder roll.\n          \n          INT. 2ND GRADE CLASSROOM - CONTINUOUS\n          \n          2ND GRADERS are sitting on the floor. Lulu is in front of\n          the class, with the Panic Button in her hand. The board\n          reads: SHOW AND TELL. Shane lands in fight stance -- the\n          Class applauds. Next to Lulu is a very upstaged LITTLE\n          BOY with a FROG. Lulu sticks her tongue out at him.\n          \n                                 LULU\n                    See! My nanny can kick your nanny's butt.\n          \n          Shane is furious, but the FINAL BELL rings. At that\n          moment, his Tracker Alarm sounds again. He looks:\n          \n          CLOSE-UP ON THE TRACKER SCREEN: Two DOTS labeled RED 1\n          and RED 2, are heading away from the school fast.\n          I\n          INT. HALLWAY - CONTINUOUS\n          \n          Shane runs with Lulu through the mob of Kids. He hands\n          her to the Principal.\n          \n                                 SHANE\n                    Thanks.\n          \n          EXT. EAST BETHESDA K-12 SCHOOL - CONTINUOUS\n          \n          Shane dives into the Minivan. The DOTS on the tracker are\n          headed North. He speeds away after them.\n          \n          EXT. BUSY INTERSECTION - MOMENTS LATER\n          \n          The BLINKING DOTS on his tracker are side by side, racing\n          down the road ahead of Shane. They make a sharp right.\n          Shane makes a right, almost tipping the minivan. He\n          blasts through a red light.\n          \n          \n                                                                   41.\n          \n          \n          \n          EXT. IN FRONT OF A CONSTRUCTION SITE - MOMENTS LATER\n          \n          He turns a corner -- a PLYWOOD WALL surrounds the site.\n          He leaps out of the minivan. He looks at the tracker: Zoe\n          and Todd are dead ahead, through the fence.\n          \n          EXT. CONSTRUCTION SITE - CONTINUOUS\n          \n          Two BIG CONSTRUCTION workers are standing on the other\n          side of the plywood wall -- Shane KICKS out one entire\n          section, and charges through.\n          \n                                 CONSTRUCTION WORKER\n                    What hell do you think you're doing?\n          \n          He turns around, to see several CONSTRUCTION WORKERS, all\n          brandishing tools.\n          \n                                 SHANE\n                    Tell me where the kids are and I'll let\n                    you all live!\n          \n                                 CONSTRUCTION WORKER\n                    Buddy, you're about to get a beat down.\n          \n          Three Workers rush him. Shane easily takes them out. The\n          remaining Workers give Shane a scared look -- then RUN.\n          \n          ANGLE - SHANE\n          \n          He's alone. He catches his breath, then checks his\n          tracker. Todd and Zoe's BEEPS are coming from a MANHOLE.\n          \n          Shane pries off the manhole cover.    He looks down.\n          \n          IN THE MANHOLE - It's dark and dank.\n          \n          No sweat. Shane lowers himself down.\n          \n          INT. SEWER - SAME TIME\n          \n          Shane lands shoulder deep in DISGUSTING SLUDGE. He\n          winces, then checks the tracker -- the DOTS are CLOSE,\n          feet away. Shane trudges through the river of muck.\n          \n                                  SHANE\n                    Red 1?   Red 2?\n          \n          It's horrific. The DOTS BEEP LOUDER. He's almost there!\n          He splashes around a corner -- then gasps -- he sees the\n          blinking lights below the surface. He takes a deep\n          breath and dives under. He comes up for air with ZOE and\n          TODD'S HOMING BEACONS. A note is tied to them: \"Ha! Ha!\"\n          \n                                                                  42.\n          \n          \n          \n          INT. PLUMMER HOUSE - LIVING ROOM - LATER\n          \n          Principal Claire sits with the Kids in the living room.\n          From outside, they hear the front door open, and the\n          sound of OMINOUS, SQUISHY footsteps.\n          \n          Then the door swings open, revealing Shane, looking like\n          a Swamp Creature. Everyone gasps, then covers their\n          noses. A CUTE YOUNG COP enters behind Shane. Todd\n          stiffens. Zoe fixes her hair. The Cop looks at them.\n          \n                                 CUTE COP\n                    14 year old Male, weird hair. 16 year old\n                    female. Ditto. (into his radio:) Cancel\n                    that a.p.b..\n          \n          The Cop turns to Shane, with a smirk.\n          \n                                 CUTE COP (CONT'D)\n                    In the future, use our nonemergency\n                    number. That's the one to call if\n                    nobody's fleein' or bleedin'.\n          \n          The Cop leaves, Zoe checks him out as he goes...\n          \n                                 CLAIRE\n                    Shane are you okay?\n          \n                                 SHANE\n                           (eerily calm:)\n                    Just fine, thank you.\n          \n          Covering her nose. The smell is BAD.\n          \n                                 CLAIRE\n                    I should probably get going then. If you\n                    need anymore help... Call.\n          \n          She practically GAGS as she passes him. Shane looks\n          around at Scott and Zoe, he doesn't say anything, but\n          with his hand he makes a \"my eyes on you\" gesture.\n          \n          INT. BATHROOM - LATER\n          \n          Shane is in the shower. He pours an entire bottle of\n          SHAMPOO over himself.\n          \n          INT. BACK YARD - DAY\n          \n          Shane BURNS his clothes in the barbecue.\n          \n                              \n          \n          \n                                                                43.\n          \n          \n          \n          INT. KITCHEN - LATER\n          \n          Tyler is in a high-chair, Peter rocks in a cradle-swing.\n          \n          Shane enters, in just a towel. He sees on the fridge;\n          Helga'S SHOPPING LIST -- all junk food. He looks at it,\n          cringing in disgust, before he notices:\n          \n          Sitting around the table are Lulu's entire BROWNIE TROOP -\n          - a dozen little girls in uniforms, they're staring at\n          him. The Brownies applaud, and whistle.\n          \n                                 BROWNIE\n                     oo hoo! Hubba hubba!\n          \n          Shane covers up and leaps into the Family Room, pulling\n          Lulu after him.\n          \n          INT. FAMILY ROOM - CONTINUOUS\n          \n                                 SHANE\n                    Who are those people?\n          \n                                 LULU\n                    It's my troop, it's Monday. Monday,\n                    Wednesday and Saturday are troop nights.\n          \n                                 SHANE (O.S.)\n                    Get rid of them.\n          \n                                 LULU\n                    I can't. Everybody's parents go out on\n                    troop nights. They won't be home `til\n                    ten. Mom's our den mother.\n          \n          Lulu starts to sniffle, close to tears.\n          \n                                 LULU (CONT'D)\n                    Tonight we're supposed to sell cookies.\n          \n                                 SHANE\n                    Selling cookies isn't imperative to my\n                    mission.\n          \n                                 LULU\n                    We have to. If we don't sell enough\n                    cookies, we can't go the Jamboree, and if\n                    we can't go to the Jamboree.\n                           (whispers:)\n                    Come on, Shane. You gotta help me out.\n                    They already think I'm a loser. And it's\n                    not like I have any other friends, cause\n                    mom never lets me out of her sight...\n          \n                                                                 44.\n          \n          \n          \n          Lulu's about to burst into tears. Shane sighs.\n          \n          INT. KITCHEN - MOMENTS LATER\n          \n          Shane, back in \"uniform,\" paces in front of the Brownie\n          Troop. They are assembled, at attention, Indian Style.\n          \n                                 SHANE\n                    Alright, ladies. Here's how it's gonna\n                    be. Tonight, I'm gonna be your den --\n                    commander. That means if you want to live\n                    to see tomorrow, do as I say. DO WE\n                    UNDERSTAND EACH OTHER?\n          \n          The Brownies stare art him in stunned silence.\n          \n                                 BROWNIE\n                    Den Mother? ... I'm scared of you.\n          \n                                 SHANE\n                    Good. Now -- wait here.\n          \n          INT. LIVING ROOM - A LITTLE LATE\n          \n          The Brownies are in the living room, unpacking boxes of\n          cookies, getting ready to go. Zoe's on the phone.\n          \n                                 ZOE\n                    ... yeah, he's a total psycho. I think\n                    mom found him from one of those Tough\n                    Love boot camps or something...\n          \n          Shane blows passed her, revving a cordless POWER DRILL.\n          \n          VARIOUS SHOTS: As Shane uses the drill to seal every\n          window and door. He's not just locking them -- he's\n          SCREWING THEM SHUT WITH DRYWALL SCREWS.\n          \n          INT. ZOE'S BEDROOM - MOMENTS LATER\n          \n          Shane's finishing up the last window.\n          \n                                 ZOE\n                    This is totally cruel and unusual! You\n                    can't do this -- we could run out of air!\n          \n          Shane lifts her window so it's open a HALF INCH, then\n          drills it into place. Shane ushers the Troop out the\n          door, then loads Peter and Tyler into TWO SNUGGLES -- one\n          attached to his front, the other to his back. Shane\n          closes the front door and attaches a \"Club\" lock to it.\n          \n                 \n          \n                                                                 45.\n          \n          \n          \n          EXT. DRIVEWAY - MOMENTS LATER\n          \n          Shane Loads the brownies and toddlers into the minivan.\n          \n          As the minivan pulls out of the driveway, the camera\n          CRANES up to...\n          \n          ZOE'S WINDOW:\n          \n          Inside, Zoe picks up the phone, hits speed-dial.\n          \n                                 ZOE\n                     .. he's got us on lock-down, it's like\n                    Oz or something. No, not munchkin Oz --\n                    HBO Oz. (she listens:) Hm... I dunno if\n                    that's a good idea, Scott...\n          \n          EXT. GROCERY STORE - PARKING LOT - AFTERNOON\n          \n          Shane pulls the minivan into the crowded parking lot --\n          the Brownies are all singing 99 Bottles of Beer on the\n          Wall at the top of their lungs.\n          \n          EXT. GROCERY STORE - MOMENTS LATER\n          \n          Shane (double-Snuggled) helps the Brownies set up a card\n          table to display their cookies.\n          \n                                 SHANE\n                    I gotta get supplies. I can see you\n                    through the window, but if anything\n                    happens...\n          \n                                 LULU\n                           (flashing her bracelet)\n                    I know.\n          \n          INT. GROCERY STORE - MOMENTS LATER\n          \n          Shane watches the Brownies on the store's CLOSED CIRCUIT\n          monitor, as he pushes a cart into the store. He looks\n          around at the bright, colorful boxes of Children's\n          Cereals, Rainbow Fruit Roll-Ups, Snack packs... NOTHING\n          looks familiar -- nothing even looks like food.\n          \n          He sees: a huge, 100 pack VALUE CASE of SPAM. He smiles.\n          Tyler looks at him -- \"what are you, nuts?\"\n          \n          EXT. GROCERY STORE - CONTINUOUS\n          \n          The Brownies are trying to sell the cookies, but they're\n          very shy. SHOPPERS blow passed them without even noticing\n          them. One of the Brownies spots something...\n          \n                              \n          \n                                                                46.\n          \n          \n          \n                                 BROWNIE\n                    Oh no... they're back.\n          \n          SLOW MOTION: In a shot out of Reservoir Dogs, we see who\n          she means: A group of bad ass, chubby CUB SCOUTS. They're\n          headed straight towards the cookie table, menacingly.\n          \n                                 UGLY CUB SCOUT\n                           (to another Scout)\n                    Hey Skeever, what's stinky and floats\n                    `til you flush `em?\n          \n                                 2ND SCOUT\n                    Brownies?\n          \n          The Scouts cackle. The Ugly Scout yanks a box of cookies\n          away from Lulu. He rips it open, dumping the cookies on\n          the ground and grinding Uthem with his foot.\n          \n                                 UGLY CUB SCOUT\n                    This is Troop 16 territory. How are we\n                    supposed to sell raffle tickets when this\n                    place reeks of your skanky cookies?\n          \n                                 2ND SCOUT\n                    BEAT IT, before I get my face punching\n                    badge on you.\n          \n          The Brownies take off running, clutching their boxes. One\n          of the Scouts grabs Lulu -- she tugs and tugs, but can't\n          get away. Finally, the Cub Scout takes her SCARF. He\n          laughs, and lets her go. The Cub Scouts high-five.\n          \n          EXT. GROCERY STORE - MOMENTS LATER\n          \n          Shane heads to the Brownie's table -- but Lulu and the\n          Brownies are gone. In their place are the Chubby Scouts.\n          \n                                 SHANE\n                    Where are my troops?\n          \n                                 UGLY CUB SCOUT\n                    ... I haven't seen anybody, you Skeever?\n          \n                                 2ND SCOUT\n                    Nope. You wanna buy a raffle ticket?\n                    We're trying to win .22's.\n          \n          Around his neck, Shane's monitor starts beeping. Shane\n          takes off running in the direction of the signal.\n          \n                  \n          \n                                                                   47.\n          \n          \n          \n          EXT. PARKING LOT - SECONDS LATER\n          \n          Shane runs up to the minivan. The Brownies are huddled\n          behind it, trembling.\n          \n                                 SHANE\n                    What happened? (No one answers) Well?\n          \n                                 LULU\n                    Those boys over there broke our cookies.\n          \n          Shane eyes the Cub Scouts. Dead serious:\n          \n                                 SHANE\n                    Well then -- I'm afraid I have to\n                    eliminate them. If I don't come back --\n                    avenge my death.\n          \n          He heads toward the Scouts. The Brownies scream.\n          \n                                 BROWNIES\n                    No!\n          \n          Shane stops. He bends down, and points at Lulu's Panic\n          button. He firmly tells Lulu, who's close to tears:\n          \n                                 SHANE\n                    This is not a toy. I'm here to protect\n                    you. Not cookies. Get in the car, we're\n                    going home.\n          \n                                 BROWNIE\n                    You can't take us home yet, you're\n                    supposed to take us to dinner.\n          \n                                 SHANE\n                    Where?\n          \n          INT. CHUCK E. CHEESE - A LITTLE LATER - DAY\n          \n          An extreme CU of the Chuck E. Cheese MANAGER. He wears\n          braces and head-gear, which causes him to lisp.\n          \n                                 MANAGER\n                    Welcome to Chuck E. Cheese!\n          \n          Wider reveals...CHAOS. SCREAMING CHILDREN everywhere.\n          On stage, the Chuck E. Cheese automaton band JAMS.\n          \n                                 SHANE\n                    I wish I were in Chechnya.\n          \n          A LITTLE LATER:\n          \n                 \n          \n                                                                   48.\n          \n          \n          \n          Brownies are running around, playing video games and skee\n          ball. Shane's watching Peter, in the PLASTIC BALL POOL,\n          while he holds Tyler in the Snuggle. The Manager\n          approaches Shane.\n          \n                                 MANAGER\n                    Anything elsh I can do for you?\n          \n                                 SHANE\n                    In a big glass (he shows him)   This much\n                    ice... this much cyanide.\n          \n          The Manager laughs, but the headgear seems to hurt his\n          face when he smiles.\n          \n                                 MANAGER\n                    How `bout a re-fill on that pischer of\n                    Mischer Pibb?\n          \n                                   SHANE\n                    What?\n          \n                                 MANAGER\n                           (gesturing:)\n                    Pischer of Mischer Pibb?   Mischer Pibb?\n          \n          Frustrated, the Manager picks up a pitcher and exits.\n          Lulu approaches, she grabs Shane by the sleeve and drags\n          him over to the stand up Mortal Kombat game.\n          \n                                   LULU\n                    Let's fight!\n          \n                                 SHANE\n                    I'm watching your brother...\n          \n                                 LULU\n                    I pressed two player. I thought you liked\n                    combat. Unless you're scared.\n          \n          Shane doesn't like the sound of that. He steps up to the\n          machine. He cracks his knuckles, stretches. Then he takes\n          a joy stick. He checks over his shoulder -- Peter's\n          happily splashing about in the plastic balls.\n          \n          ON THE SCREEN: they each select a fighter. Lulu picks a\n          small female character. Shane picks a man who looks LIKE\n          SHANE. They begin, Lulu screams out with her fighter, in\n          unison:\n          \n                                 VIDEO GAME/LULU\n                    Prepare to be annihilated!\n          \n                                \n          \n                                                                49.\n          \n          \n          \n          She leaps over Shane in a somersault and throws a DOZEN\n          throwing stars. Then kicks him in the head repeatedly.\n          \n                                 SHANE\n                    That's not fair. Nobody can jump thirty\n                    feet.\n          \n                                 LULU\n                    The Hulk can.\n          \n                                 SHANE\n                    That wasn't a documentary.\n          \n          The second round starts, Brownies have gathered around to\n          watch. Lulu's fighter does a series of kicks. Shane can't\n          even get one punch in -- she pins him to the ground,\n          kneels on his head, then kicks him in the face. Shane is\n          taking it really seriously. He's really mad.\n          \n                                 SHANE (CONT'D)\n                    This isn't fair. My joystick's broken.\n          \n                                 LULU\n                    You wanna switch?\n          \n          They switch sides. Round three starts. Lulu's fighter\n          picks up Shane's in the air, spins her, then cracks her\n          in half over his knee... and then a kick in the face.\n          \n                                 SHANE\n                           (re: the Snuggle)\n                    You don't have a baby on your chest...\n          \n          Lulu's having fun now, she's just avoiding Shane's\n          fighter, dancing, jumping, while he pounds the buttons,\n          swinging and missing... Shane's really fuming.\n          \n                                 LULU\n                    You're not even trying...\n          \n                                 SHANE\n                    I AM TOO TRYING.\n          \n                                 LULU\n                    Too slow... come on -- take a shot...\n                    oops too slow... swing and a miss...\n          \n          She keeps dancing. It's really annoying. Shane's working\n          the joy stick hard, slamming buttons, but he can't hit\n          her. He is KO'd. She does a very obnoxious VICTORY DANCE.\n          \n                               \n          \n                                                                  50.\n          \n          \n          \n                                 LULU (CONT'D)\n                    In your face! I am the greatest hand-to-\n                    hand combat champion in the entire world!\n          \n          Shane screams and RIPS THE JOYSTICK OFF THE MACHINE.\n          Sparks fly. Shane looks around to see if the staff\n          noticed. He and the Brownies sneak away, leaving the\n          sizzling machine, its joystick dangling by its wires.\n          \n          INT. PLUMMER HOUSE - LIVING ROOM - CONTINUOUS\n          \n          Zoe's on the phone, the Zhouse is quiet.\n          \n                                 ZOE\n                    Mom -- stop worrying.\n          \n                                                        INTERCUT WITH:\n          \n          INT. HOTEL ROOM - CONTINUOUS\n          \n                                 JULIE (ON THE PHONE)\n                    I'm a mom, it's my job to worry.\n          \n                                 ZOE\n                    Seriously, everything's cool. The guy's\n                    just a control freak.\n          \n                                 JULIE\n                    It's only a few more days. I hate leaving\n                    you, but you know I have to do this. I\n                    love you.\n          \n                                 ZOE\n                    I know. Don't worry, we're okay. Tonight\n                    I'm just doing homework -- in my cell.\n          \n          INT. PLUMMER HOUSE - LIVING ROOM - CONTINUOUS\n          \n          As Zoe hangs up, we WIDEN OUT: The house is PACKED with\n          TEENAGERS: they're keeping quiet until the phone is in\n          its cradle, then the TEENAGE DJ starts the music back up.\n          \n          Zoe looks around at the mess. She turns to Scott, who\n          doesn't seem concerned at all.\n          \n                                 ZOE\n                    Dude, this is outta hand. Who are all\n                    these people?\n          \n                                 SCOTT\n                    Jus' ma peeps. And the folks who read my\n                    BLOG.\n          \n                                                                   51.\n          \n          \n          \n          Zoe rolls her eyes, then notices a WEIRD SWEATY KID,\n          who's throwing mustard covered baloney slices at the\n          ceiling, where they stick with a satisfying SQUISH.\n          \n                                 ZOE\n                    Dude, not cool...\n          \n          VARIOUS SHOTS - The Plummer House:\n          \n          - Its a huge party: the place is JAMMED, kids everywhere.\n          \n          - Teenagers come and go through the kitchen's DOGGY DOOR.\n          \n          EXT. MALL PARKING LOT - CONTINUOUS\n          \n          Shane (Tyler in Snuggle), loads Brownies into the\n          minivan, counting them. Barking at them like Marines:\n          \n                                 SHANE\n                    Move, move, move! Go go!\n          \n          EXT. SUBURBAN ROAD - MOMENTS LATER\n          \n          Shane drives, the Brownies are singing 99 Bottles...\n          again. Suddenly, a look of horror comes across Shane's\n          face... he spins the minivan in a 180 and floors it.\n          \n          INT. CHUCK E. CHEESE - LATER - DUSK\n          \n          Shane (Tyler in Snuggle) bursts in, the Brownies follow.\n          We see what he forgot: PETER, still happily playing in\n          the pool of plastic balls. The Manager is watching him.\n          \n                                 MANAGER\n                    I figured you'd come back for him -- they\n                    almost always do.\n          \n                                 SHANE\n                    Inexcusable, to leave a man behind like\n                    that...\n          \n                                 MANAGER\n                    Relax, we once found a kid in the ball\n                    pool when we opened in the morning --\n          \n          Shane wades into the ball pool and pulls Peter out, which\n          is fine, except that he's MISSING HIS DIAPER.\n          \n                                 MANAGER (CONT'D)\n                    WHOA, Whoa. Not okay, freestyling in the\n                    ball pool -- not okay.\n          \n          S\n          \n          \n          \n          \n                                                                    52.\n          \n          \n          \n          Shane grimaces. He holds his breath, and goes down for\n          the diaper. He disappears under the balls -- for a long\n          time. The Manager and the Brownies share a concerned\n          look. He's still down there. Silence.\n          \n                                 LULU\n                    Should we send someone in after him?\n          \n          He surfaces, gasping. He's holding the diaper, out away\n          from him. He charges across the room with the diaper.\n          \n                                 SHANE\n                    Clear out! GO GO GO!\n          \n          And he bursts out the other doors, at a full run.\n          \n          EXT. PLUMMER HOUSE - NIGHT\n          \n          Shane is exhausted, as he pulls up in the Minivan. He\n          gets out -- and groans in disbelief. It's insanity: HIP\n          HOP blasts, gyrating TEENAGERS everywhere, chugging\n          drinks, making out, peeing in the bushes, jocks throwing\n          footballs.\n          \n          Reeling, Shane takes Lulu, Peter and Tyler up the path.\n          He protectively guides them past the craziness -- until a\n          football suddenly WHIZZES by. Outraged, Shane snatches\n          it mid-air -- then CRUSHES the ball. POP!\n          \n           hane gives a blood-curdling stare.\n          \n                                 SHANE\n                    Party's over.\n          \n          The jocks flinch, scared, then RUN.   Shane unlocks the\n          CLUB lock off the door.\n          \n          INT. PLUMMER HOUSE - KITCHEN - CONTINUOUS\n          \n          Inside is worse, a total wreck.   Zoe's dancing with\n          Scott.\n          \n          Shane drags the needle across a record at the D.J.'s\n          turntables. Everyone recoils from the horrible sound.\n          \n                                 SHANE\n                    No one leaves until this house is\n                    spotless! I want to be able to eat off\n                    the floor! The latrine! Hell, I wanna\n                    be able to eat in the kitchen!!\n          \n          Nervous glances -- then everybody suddenly RUNS for the\n          back! Shane is confused, trying to understand...\n          \n                                                                  53.\n          \n          \n          then he intuitively dashes past them! He's scoping the\n          surroundings... windows... vents... AH! The doggy door!\n          \n          Scott is halfway through the doggy door when Shane grabs\n          his ankles and yanks him back in. Shane holds Scott\n          upsidedown by his ankles.\n          \n                                 SHANE (CONT'D)\n                    Oh no you don't. Now, we're gonna do this\n                    my way -- no highway option.\n          \n          Just then: A MUSTARD SOAKED BALONEY SLICE drops from the\n          ceiling, sticking to the TOP of Shane's head. PLOP.\n          Shane's eyes narrow, he takes it off, trying to maintain\n          his dignity. He fumes...\n          \n                                 SHANE (CONT'D)\n                     Start swabbing, ladies.\n          \n          He hands Scott the mop. Scott gulps - and starts mopping.\n          \n                                                       DISSOLVE TO:\n          \n          CLEANING THE HOUSE.\n          \n          Miserable TEENS scrub. In a bathroom, Scott and Zoe, in\n          Playtex gloves, furiously clean. Scott scrubs the toilet\n          with Pinesol as the Duck swims in the top of the toilet.\n          \n                                 SCOTT\n                    This is officially the worst party ever.\n          \n                                 ZOE\n                    It was YOUR idea! I don't even know most\n                    of these losers.\n          \n          INT. PLUMMER HOUSE/STUDY - NIGHT\n          \n          Shane inspects the house, as kids clean. Shane wipes a\n          finger down the sofa. Clean. He lifts the sofa, and rubs\n          his finger UNDER IT. He holds it up to a KID... residue.\n          The Kid quickly starts cleaning again.\n          \n          A GIRL reorganizes a stack of CD'S. Shane goes over\n          them, straightening -- then he notices something. He\n          pulls out a CD: It is a home-burned disk, labeled with a\n          Sharpie. It reads: GHOST. Oh my god...\n                                                               CUT TO:\n          \n          EXT. PLUMMER HOUSE - SIMULTANEOUS\n          \n          Two DARK CLAD FIGURES watch, through binoculars. They see\n          Shane find the CD, and walk out of sight.\n          \n          \n                                                                  54.\n          \n          \n          \n          INT. PLUMMER HOUSE/STUDY - CONTINUOUS\n          \n          Shane quickly tucks the CD into his pocket.\n          \n                                                               CUT TO:\n          \n          EXT. PLUMMER HOUSE - ALMOST DAWN\n          \n          A long line of exhausted party-goers files out. Scott's\n          the last one to leave.\n          \n          INT. PLUMMER HOUSE - VARIOUS\n          \n          Shane works his way through the house. It's SPOTLESS:\n          counter tops glisten, furniture polished. It looks like\n          Better Homes and Gardens. He heads upstairs. Zoe blows\n          past him -- into the bathroom, where she throws up. Shane\n          sits down, outside the bathroom door.\n          \n                                 ZOE\n                    ... Thanks a lot, Rambo. My friends will\n                    never come here again.\n          \n                                 SHANE\n                    Those people aren't your friends. They\n                    show no respect for you or your house.\n                    Because you have no respect for yourself.\n          \n                                 ZOE\n                    I do too respect myself.\n          \n           ueasy, she pukes again. Shane hands her a handkerchief.\n          \n                                 SHANE\n                    You got barf on your tank top.\n                    (Announces:) Company, downstairs!\n          \n          He walks down the hall, Zpounding on doors.\n          \n                                 ZOE\n                    You're not my dad!\n          \n          Shane stops. Lulu and Todd step into the hall. Zoe gets\n          up, shaky and furious, and screams in Shane's face.\n          \n                                 ZOE (CONT'D)\n                    We hate you, you hate us. You're like a\n                    robot. Why don't you just leave us alone?\n          \n          Silence. Lulu's crying, Todd picks her up. Shane stands,\n          helpless. After a beat...\n          \n                \n          \n          \n                                                                  55.\n          \n          \n          \n                                 SHANE\n                    You're right, Red 1. I'm not the man for\n                    this job.\n          \n                                 LULU\n                    Shane --!\n          \n                                 SHANE\n                    In all my years I have never been treated\n                    with such disrespect. Not even from the\n                    enemy. Don't worry, as soon as your mom\n                    comes back, I'm gone.\n          \n          Suddenly -- the power goes out.\n          \n                                 SHANE (CONT'D)\n                    Now what?\n          \n                                 ZOE\n                    (sighs, tired) It's Scott...\n          \n                                 SHANE\n                    Puberty... talking doesn't do any good.\n                    Go to your rooms.\n          \n          Suddenly, TWO NINJAS, all in black BURST in through the\n          window. Shane spins in fight-stance.\n          \n                                 SHANE (CONT'D)\n                           (to the kids:)\n                    Go!\n          \n          Terrified, Zoe and Todd scoop up the kids and rush down\n          the hall.\n          \n          The Ninjas pull a retractable KENDO STAFFS. Wielding them\n          with great skill. It takes all of Shane's skill to fend\n          them off -- the three fight, close-quarters and fast.\n          Until Shane pulls down attic's spring-loaded FOLDING\n          LADDER and clocks a Ninja with it. He goes down, but\n          Shane is SHOCKED from behind by the other NINJA. The\n          Ninjas attack, fiercely -- they're good. Their Kendo\n          staffs hiss with a powerful ELECTRIC CURRENT. The Ninjas\n          knock Shane backwards down the stairs...\n          \n                                 NINJA\n                    GHOST -- hand it over!\n          \n          They leap down after him, pounding him with their staffs,\n          knocking him into...\n          \n          \n          \n                                                                56.\n          \n          \n          \n          INT. PLAYROOM - CONTINUOUS\n          \n          There are TOYS EVERYWHERE -- like a tornado hit a TOYS-R-\n          US. Shane fends the Ninjas off. He spots a BASEBALL BAT,\n          and grabs it, facing them, fiercely. They step back...\n          \n                                 SHANE\n                    Okay -- who wants some?\n          \n          Shane swings the bat down on a Ninja's head: It's a\n          whiffle bat, it makes a silly thunk. Shane and the Ninja\n          share a surprised look -- then the Ninjas charge. Shane\n          fends them off with his Whiffle bat. With his foot, he\n          picks up a FISHER PRICE CORN-POPPER, and uses them both\n          to fend off blows. It rattles and pops as he fights with\n          both Toys -- until a Ninja breaks them with one blow.\n          Shane sees a FARMER JOHN TALKING GAME. He jumps up onto a\n          shelf and grabs it. He pulls the string, and swings the\n          plastic disk like a deadly bolo.\n          \n                                 FARMER JOHN GAME\n                    The rooster goes...\n          \n          WHACK, he hits a Ninja in the head. He swings the Farmer\n          John like a bull whip -- until a Ninja knocks the shelf\n          over. Shane crashes down, toys fly, several FURBIES hit\n          the floor. They echo the fight:\n          \n                                 FURBIES\n                    Ow! Ow!\n          \n          Shane sees: The Ninjas are wearing only Ninja socks -- no\n          shoes. He grabs a barrel of LEGOS, and flings them all\n          over the floor. The Ninjas move towards him -- the Legos\n          and Jacks dig into their feet.\n          \n                                 NINJA/FURBIES\n                    Ow! Ow ow! Crap!\n          \n          The Ninjas fight as they hobble around, avoiding Legos,\n          Shane runs to the changing table, then violently squeezes\n          DESITIN at a NINJA, blinding him.\n          \n          Shane hangs in the doorway and swings at them, KICKING a\n          Ninja in the chest. The Ninja CRASHES through the window!\n          \n           he other Ninja looks up, fearful. Suddenly he grabs a\n          bottle of BABY POWDER. He sprays it in Shane's face...\n          POOF! The room fills with a CLOUD OF WHITE.\n          \n          ANGLE - SHANE\n          \n                                                                   57.\n          \n          \n          \n          He squints, blinded. The cloud dissipates... and Shane\n          sees he's now alone. He runs to the broken window.\n          \n          OUTSIDE:\n          \n          The Ninja's are long gone. Shane bangs the window sill,\n          disappointed to have lost them.\n          \n          INT. HALLWAY - SECONDS LATER\n          \n          Composing himself, Shane approaches Zoe's door.     He\n          quietly knocks.\n          \n                                   SHANE\n                     Kids.   It's safe. You can open up.\n          \n          A long pause -- then the door creaks open. The kids run\n          out and hug Shane with all their strength, bawling. Todd\n          and Zoe enter, terrified. Shane isn't sure what to do...\n          Then, he hugs Peter and Lulu. He really hugs them.\n          \n                                  LULU\n                     Please don't leave us Shane.\n          \n                                  SHANE\n                     I'm not going anywhere.\n          \n          He hugs them, even Zoe is crying and hugging Shane.\n          \n                                  ZOE\n                     I'm sorry for giving you a hard time.\n          \n                                  SHANE\n                     Shhh... It's okay.\n          \n                                  TODD\n                     Who were they? What did they want...?\n          \n                                  SHANE\n                     They're looking for a program, that your\n                     father invented.\n          \n                                  ZOE\n                     So Mom's not paranoid? There really are\n                     people out to get us.\n          \n          He takes out the CD labeled GHOST.\n          \n                                  SHANE\n                     They're not after you. They want this.\n                     But nothing's gonna happen to you, as\n                     long as I'm here. And I'm not going\n                     anywhere.\n          \n                                                                   58.\n          \n          \n          \n          The kids shudder, relieved. They hug him tighter. He\n          looks Zoe, eye to eye. He dries her tears:\n          \n                                 SHANE (CONT'D)\n                    But I can't do this without your help,\n                    okay? We need a little more cooperation\n                    here. (the Kids nod) Tell you what --\n                    let's start over. From now on, you listen\n                    to me, and do what I say. (to Zoe and\n                    Todd:) And I... I'll listen to you too.\n                    Deal? Truce -- okay?\n          \n          Zoe and Todd nod. Shane offers his hand to shake. They\n          shake -- then they hug him, too.\n          \n          INT. LIVING ROOM - MOMENTS LATER\n          \n          Shane and the Kids sit around Shane's computer. Shane\n          slips the Ghost CD in the disc drive, pushes play --\n          \n                                 SHANE\n                    C'mon c'mon c'mon...\n          \n          CLOSE-UP - COMPUTER MONITOR\n          \n          The SOUND comes on: it's MUSIC. \"Unchained Melody.\" And\n          then, PICTURE: Demi Moore and Patrick Swayze at a pottery\n          wheel. Shane is furious -- a long pause. Then...\n          \n          Zoe laughs: she can't help it, it's been a long night.\n          Then, the other kids join in. Soon, even Shane is\n          laughing too: the telephone RINGS -- they all jump,\n          startled. Zoe answers it, all smiles, she tries to play\n          it cool and not frighten her mother:\n          \n                                 ZOE\n                    Hey mom we're fine, absolutely nothing\n                    happened you should worry about. Nope.\n          \n          Shane takes the phone.\n          \n                                 SHANE\n                    Mrs. Plummer... two men tried to get into\n                    the house tonight.\n          \n                                                       WE INTERCUT:\n          \n          INT. HOTEL ROOM - CONTINUOUS\n          \n                                 JULIE\n                    Oh my god!\n          \n                              \n          \n          \n                                                                     59.\n          \n          \n          \n                                 SHANE\n                    No - it's okay. They're gone, everyone's\n                    fine. They were looking for GHOST, but\n                    they didn't find it. You have any luck?\n          \n                                 JULIE\n                    Well, yes and no. We found something in\n                    the box... But we're not sure what it is.\n                    Bill thinks it's part of the GHOST. It\n                    looks like some kind of \"key\". We just\n                    don't know what its for.\n          \n          She holds up the strange, metal two pronged KEY.\n          \n                                 JULIE (CONT'D)\n                    The good news is I'll be home in two\n                    days, as soon as the customs paperwork\n                    clears.\n          \n                                 SHANE\n                           (very genuine)\n                    ...So soon? We were just starting to have\n                    fun. Don't worry -- we'll be just fine.\n          \n          EXT. SCHOOL - MORNING\n          \n          Early morning, students run in to school. The minivan\n          pulls up, and Shane emerges with the five kids.\n          \n                                 SHANE\n                    I gotta warn you guys: From now on, I'm\n                    gonna be sticking even closer.\n          \n          INT. LULU'S CLASSROOM - DAY\n          \n          The TEACHER shows the children how to dye Easter eggs.\n          \n          ANGLE on Lulu, making a mess of an egg.   She smiles.\n          \n          ANGLE on Shane, squashed at a little desk.   He dips an\n          egg in some purple dye.\n          \n          EXT. SCHOOL PARKING LOT - DAY\n          \n          Driver's Ed. An obstacle course with cones. Zoe\n          nervously drives a small sedan, a crazed TEACHER next to\n          her. He is gesticulating, SCREAMING, reacting each time\n          she HITS the gas, then BRAKES, HITS the gas, then BRAKES.\n          \n          Shane stands off to the side, shaking his head.    Peter\n          and Tyler are tight in their Snuggles.\n          \n                                                                60.\n          \n          \n          \n          INT. LULU'S CLASSROOM - LATER\n          \n          The TEACHER hangs a series of cute \"Turkey Hand\" drawings\n          above the blackboard (the kind where your fingers make\n          the feathers). She hangs one of a HUGE HAND, and smiles\n          at Shane, who sits in the back, sunglasses on. Shane\n          nods, \"yeah, I know it's good.\" Then...\n          \n                                 VOICE (OVER THE PA:)\n                    Will Shane Wolfe please report to Vice\n                    Principal Murney in the gym.\n          \n          Lulu's classmates all chant, in unison:\n          \n                                 SECOND GRADERS\n                    Ooooooooh! (You're in trouble!)\n          \n          INT. THE GYM - MOMENTS LATER\n          \n          Shane enters. Zoe sits in a folding chair, mortified. She\n          is holding a broken-off SIDE VIEW MIRROR. Murney stands,\n          Principal Claire next to him. They look concerned.\n          \n                                 SHANE\n                    Don't worry. So, she wrecked a driver's\n                    Ed. car -- she'll pay for the damage...\n          \n                                 MURNEY\n                    That? Lady drivers, what do you expect.\n                    No, it's not that -- it's the boy...\n          \n                                 SHANE\n                    Red two? I mean Todd?\n          \n          Claire nods. Shane gives Zoe a look. Zoe shrugs.\n          \n                                 PRINCIPAL CLAIRE\n                    Ordinarily I would wait for his mother to\n                    return... but -- I'm a bit concerned, and\n                    I'm not sure what to do...\n          \n                                 SHANE\n                    Has he been skipping class?\n          \n                                PRINCIPAL CLAIRE\n                    Well -- yes. He does always miss sixth\n                    period. But this...\n          \n          Murney calls into the hallway. Todd enters. Shane stops,\n          in shock: Todd's long hair is all shaved off, he now has\n          a bleach blonde BUZZ CUT, giving him a \"skinhead\" look.\n          \n                \n          \n          \n                                                                  61.\n          \n          \n          \n                                 MURNEY\n                    This is how he showed up to practice. And\n                    that's not all. I was doing a little re-\n                    con in his locker... and I found this:\n          \n          Murney hands Shane a book and Shane flips through it.\n          It's a book of photographs of NAZI UNIFORMS. Shane\n          scowls.\n          \n                                 MURNEY (CONT'D)\n                    If he'd had Hustler or something, boys\n                    will be boys -- but this is just sick.\n          \n                                 SHANE\n                    He's not a NAZI.\n          \n                                 PRINCIPAL CLAIRE\n                    It's certainly not normal.\n                           (pulls Shane aside.)\n                    See if you can talk to the boy.   Find out\n                    what's going on.\n          \n          Shane shakes his head: Todd is worse than he thought.\n          Todd and Zoe stand to go, and Shane walks them out.\n          \n          The WRESTLING TEAM is assembled, stretching. They snicker\n          and shake their heads at Todd, as he passes. Shane walks\n          the kids out, and Murney chases after him.\n          \n                                 MURNEY\n                      hope you won't go light on him -- that\n                    whole family's no good, if you ask me.\n          \n                                 SHANE\n                    I'll talk to him.\n          \n                                 MURNEY\n                    You're a good man, Shane. Bet you're a\n                    hell of a fighter on the mats, huh?\n                           (Shane ignores him, and keeps\n                            walking.)\n                    Maybe sometime we oughta strap up, we'll\n                    give these boys a treat.\n          \n          He \"fake-punches\" one of his Boys -- who flinches like\n          Murney has maybe hurt him a couple times. Murney laughs.\n          \n                                 SHANE\n                    Another time, maybe...\n          \n                                 MURNEY\n                    It's a date then. I'll show you a couple\n                    moves. I promise I won't hurt you.\n          \n                              \n          \n                                                                   62.\n          \n          \n          \n          Shane walks away. Without warning, Murney lets out a Kung\n          Fu SCREAM, and leaps at Shane, kicking him in the BACK,\n          Shane trips forwards to his knees. Murney tells his team:\n          \n                                 MURNEY (CONT'D)\n                    See that? You never know when your\n                    adversary is going to strike!\n          \n                                 SHANE\n                    Did you kick me in the back? Is there a\n                    footprint on my jacket?\n          \n          Shane dusts off his back, and leaves.\n          \n                                 MURNEY\n                    Come on Frogman! Don't be a sissy!\n          \n          Shane turns back. It looks like Shane might fight, but\n          instead he takes a deep breath, and leaves. Murney shakes\n          his head, and snickers to his Team.\n          \n          EXT. PLUMMER HOUSE - A LITTLE LATER\n          \n          The minivan pulls up, with Shane and all the Plummers\n          piled in. Shane parks, Todd runs towards the house. Shane\n          holds Todd back by the arm.\n          \n                                 SHANE\n                    Wait Todd, I want to talk to you...\n          \n           odd yanks his arm away and runs into the house.\n          \n          INT. TODD'S ROOM - CONTINUOUS\n          \n          Shane knocks on Todd's door. Nothing. He enters. The\n          window is wide open, Shane checks his window alarm --\n          there's a REFRIGERATOR MAGNET stuck to it, keeping the\n          contact, so the alarm didn't go off.\n          \n                                 SHANE\n                    Smart kid.\n          \n          Shane looks out the window -- far down the block, he can\n          see Todd, running around the corner. Shane hops out the\n          window. He sees Zoe, peering out her window.\n          \n                                 SHANE (CONT'D)\n                    Zoe, you're in charge. If anyone gets\n                    within forty clicks of the perimeter,\n                    signal me. Keep all doors sealed, do your\n                    homework, preheat the oven, and make sure\n                    Lulu brushes her teeth!\n          \n          \n                                                                   63.\n          \n          \n          \n          He starts to shut the window, but the Duck leaps up on\n          the sill.\n          \n                                 SHANE (CONT'D)\n                    You want in or out?\n          \n          The Duck leaps out. Shane screws the window shut. On the\n          corner, Shane sees Todd climbing on to a CITY BUS.\n          \n          Shane picks a GIRL'S BICYCLE up off the front lawn. It's\n          pink, with a flowered basket. It's small for him, but he\n          hops on and pedals furiously after the bus.\n          \n          EXT. CITY STREET NIGHT - MOMENTS LATER\n          \n          Shane, on the girl-bike, pedals after the bus. A few\n          HOMEBOYS watch him pass, curiously. He nods back, tough.\n          \n          EXT. OLD WAREHOUSE - DOWNTOWN D.C. - NIGHT - LATER\n          \n          The bus stops in a rundown neighborhood Todd hops off the\n          bus. Shane's arrives a moment later, dripping sweat. He\n          stashes the bike behind a mailbox...\n          \n          Shane'S P.O.V.: At the entrance to the old warehouse,\n          Todd meets up with three other TEENAGE BOYS, they're\n          dressed in brown HITLER YOUTH UNIFORMS, they head inside.\n          \n          Shane follows them, stealthily.\n          \n          INT. OLD WAREHOUSE - CONTINUOUS\n          \n          Shane follows the Hitler Youth into a large room, set up\n          with folding chairs. He hides in a dark corner. Todd and\n          the Hitler Youth enter, and take seats. A CREEPY MAN in\n          a scarf walks out, and stands in front of them. Shane\n          watches as the MAN addresses the Hitler Youth.\n          \n                                 MAN\n                    Alright. All my Nazis are finally here.\n                    Okay, I want all of you at attention.\n          \n          The Nazis stand at attention. Shane is horrified...\n          \n                                 MAN (CONT'D)\n                    And on stage left - (he yells) VON\n                    TRAPPS! I need my Von Trapps!\n          \n           hane watches... as a group of blonde ACTORS, all dressed\n          in lederhosen as the SINGING VON TRAPP family enter, and\n          join the \"Nazis.\" There's also a few NUNS, a CAPTAIN VON\n          TRAPP, and a MARIA. The Creepy Man is, in fact, a good\n          natured, slightly foppish DIRECTOR.\n          \n          \n                                                                64.\n          \n          \n          \n                                 DIRECTOR\n                    Okeydokey. Starting from where we left\n                    off Gimme Rolf and Liesl -- let's give\n                    You are Sixteen a run up der flagpole...\n          \n          Todd heads up to the stage, the Director arranges him and\n          the ACTRESS PLAYING LIESL (40ish) into position. An\n          ACCOMPANIST begins on piano, Todd sings, remarkably well:\n          \n                                 TODD\n                    You wait little girl, on an empty\n                    stage/for fate to turn the light on/your\n                    life little girl, is an empty page/that\n                    men will want to write on...\n          \n                                 ACTRESS/LIESL\n                    To write on...\n          \n                                 TODD\n                    You are sixteen, going on seventeen...\n          \n          Shane bursts into laughter. His whole face lights up for\n          the first time ever...\n          \n          Todd and Liesl dance. Todd is good, but nervous. He\n          attempts a spinning kick, but he slips, and hits the\n          stage, clutching his ankle. He gets up, and limps to the\n          seats. The Director walks onto the stage, upset. He\n          looks up, to heaven:\n          \n                                 DIRECTOR\n                    Baby Jesus, have I done some unspeakable\n                    evil that I deserve to be saddled with\n                    the world's worst production of Sound of\n                    Music? (he shouts, at the cast:) We open\n                    in a week. The set's not finished... The\n                    cast is a bunch of clumsy goats -- every\n                    kick ball change would make Bob Fosse dig\n                    himself out of the earth, so he could\n                    have a heart attack again.\n          \n                                 TODD\n                    I'm sorry... I'll get it right.\n          \n                                 DIRECTOR\n                    None of you will ever get it right! Which\n                    is why, I quit.\n          \n          He throws down his script. The Cast is stunned.\n          \n                                 DIRECTOR (CONT'D)\n                    And with that, he exits stage right...\n                    end scene.\n          \n                              \n          \n          \n                                                                   65.\n          \n          \n          \n          And, on his own cue... he exits stage right, in a huff.\n          The entire cast looks to Todd, fuming.\n          \n          Shane jumps up from his hiding place, startling\n          everybody. Everyone steps back. Todd is terrified.\n          \n          Shane kneels down beside Todd. He closes his eyes, and\n          begins rubbing his hands together like Mr. Miyagi.\n          \n                                 LIESL\n                    You gonna fix him?\n          \n                                 SHANE\n                    No. My hands are freezing.\n          \n          Shane grabs Todd's ankle hard and unceremoniously CRACKS\n          it, and yanks him to his feet.\n          \n                                 TODD\n                    I'm not going to quit. I hate wresting...\n          \n                                 SHANE\n                    AT EASE. (Todd shuts up) Would you\n                    listen, just once? Look, I don't know a\n                    hell of a lot about this kinda stuff,\n                    but... You're good. A lot to learn, but\n                    with hard work, discipline -- you could\n                    make a go of this.\n          \n                                 TODD\n                    ... but what about Murney?\n          \n                                 SHANE\n                    That guy's an idiot.\n          \n          Todd smiles, relieved. They sit on the edge of the stage.\n          \n                                 SHANE (CONT'D)\n                    \"Sound of Music\" is a great show. My dad\n                    took me to see it when I was a kid.\n          \n          Shane smiles wistfully. Todd relaxes.\n          \n                                 TODD\n                    You don't seem like the musical type.\n          \n                                 SHANE\n                    Come on. Julie Andrews was hot.\n          \n                                 TODD\n                    What if... girls'll think I'm... weird or\n                    something?\n          \n                                                                66.\n          \n          \n          \n                                 SHANE\n                    You know what girls think is weird?\n                    Wrestling. Men in leotards pinning each\n                    other to the floor? I've never understood\n                    that. Chicks dig guys who can dance.\n          \n                                 TODD\n                    Doesn't matter now anyway... show's\n                    off... it's over.\n          \n          Shane looks at the Cast, they look pretty glum as they\n          pack up their costumes. Todd looks devastated -- only a\n          moment after Shane saw him happier than ever. Shane\n          straightens up, grabbing Todd by the shirt collar. BEAT.\n          \n                                 SHANE\n                    COMPANY -- CENTER STAGE!\n          \n          Everyone looks around, they're not sure what to do... off\n          Shane's glare, they quickly assemble on stage.\n          \n                                 SHANE (CONT'D)\n                    DO YOU, OR DO YOU NOT HAVE WHAT IT TAKES\n                    TO PERFORM THIS MUSICAL?\n          \n          There's some mumbling. Liesl chimes in.\n          \n                                 LIESL\n                    We don't have a director...\n          \n          Shane shakes his head.\n          \n                                 SHANE\n                    No director? I have directed rescue\n                    missions in Afghanistan! I've directed\n                    numerous snatch and grabs in countries\n                    who's names you are not allowed to know.\n                    I have choreographed multi-pronged\n                    amphibious landings and stealth air\n                    attacks!\n                           (full of bravado)\n                    Do you think I have the stomach to whip\n                    this production into shape, or not?\n          \n          Everyone nods... Todd looks up at Shane. He smiles.\n          \n                                   TODD\n                    Yes.\n          \n                                   SHANE\n                    YES WHAT?\n          \n                           \n          \n          \n                                                                67.\n          \n          \n          \n                                 TODD/CAST\n                    YESSIR.\n          \n          INT. PLUMMER HOUSE - UPSTAIRS HALLWAY - LATER\n          \n          Shane's patrolling the hallway. He hears Zoe in her\n          room, BREAKING something, angrily. He peeks in -- just as\n          Zoe THROWS her cell-phone into the wall, furious.\n          \n                                 SHANE\n                    ... What's up?\n          \n                                 ZOE\n                           (embarrassed)\n                    Nothing... It's stupid... Scott. I called\n                    him in his room, another girl picked up\n                    the phone. I know it's no big deal. I\n                    don't know why I let it get to me.\n          \n                                 SHANE\n                    I don't see what you see in this guy.\n          \n                                 ZOE\n                    It's just nice to think someone's\n                    thinking about you, you know?\n                                 S\n                                 SHANE\n                           (He nods)\n                    It won't happen again.\n          \n                                 ZOE\n                    ... No wait! ...What are you gonna do?\n                    You're not gonna hurt him are you?\n                    Promise you won't touch him.\n          \n                                 SHANE\n                    Okay. I promise. I won't touch him.\n          \n          Shane exits. He turns out the light.\n          \n          INT. LULU'S ROOM - LATER\n          \n          Shane tucks Lulu into bed.\n          \n                                  ULU\n                    Tell me a story.\n          \n          Shane looks at her surprised. He sits on the bed...\n          Stumped. Then he starts:\n          \n                                SHANE\n                    Okay. Let's see. Once there was a family\n                    of Elves.\n                                (MORE)\n          \n                                 T\n          \n          \n          \n          \n                                 S\n          \n          \n          \n          \n                                 L\n          \n          \n          \n          \n                                                                 68.\n                                 SHANE(CONT'D)\n                    One day, the little Elf family -- Uh.\n                    Went into the magic forest. To find a\n                    secret gnome... facility, where gnomes\n                    where turning mushrooms into... Uranium.\n                    The elves had to go in and take it out.\n          \n                                  ULU\n                    Why?\n          \n                                 SHANE\n                    They were ordered to. By the Elf Unit\n                    commander at Elf station bravo. So --\n                    they waited for cloud cover, and they\n                    came in from the north...\n          \n          As Shane finishes the story, he illustrates, setting up\n          the scene with DOLLS, on Lulu's floor.\n          \n                                 SHANE (CONT'D)\n                    The Elf Team decided on an L Ambush -- so\n                    three elves formed a base leg and laid\n                    down a heavy suppressive fire on the\n                    gnomes while the others maneuvered around\n                    to the right flank and walked through\n                    finishing off anything left alive... I\n                    mean standing...                    D\n                                                         ISSOLVE TO:\n          \n          AN HOUR LATER:\n          \n          Shane's really into the story. Lulu's fallen asleep.\n          Shane's eyes are brimming with tears as he finishes:\n          \n                                 SHANE (CONT'D)\n                    ... And not one Elf got left behind that\n                    day. We got `em all. Even, the teeniest\n                    little elf of all -- Rodriquez.\n          \n          Then, from across the hall, Peter WAILS.   Todd pops his\n          head in the door.\n          \n                                  ODD\n                    You have to do the Panda Dance... or he\n                    won't stop.\n          \n                                 SHANE\n                    Oh, c'mon... I can't remember that thing.\n          \n                                 TODD\n                    I'll write it down for you...\n          \n          The wails get louder and LOUDER...\n          \n                                 S\n          \n          \n          \n          \n                                                                   69.\n          \n          \n          \n          INT. NURSERY - CONTINUOUS\n          \n          Tyler's asleep. Shane sighs, and whispers to Peter,\n          reading from Todd's notes:\n          \n                                 SHANE\n                    When you're down and low, lower than the\n                    floor. And you ain't got a chance. Don't\n                    make a move `til you're in the groove,\n                    and do the Panda Dance...\n          \n          Peter starts bawling. Shane doesn't know what's wrong.\n          Todd calls from the doorway...\n          \n                                 TODD\n                    You have to do the dance. Like dad used\n                    to do. He made it up for him.\n          \n          Shane sighs. He sings again, mortified. He does the dance\n          as he sings... Shane hops forward three times.\n                                 S\n                                 SHANE\n                    Just hop three times like a kangaroo --\n                    Sidestep twice, just like the crabs do.\n          \n          Peter applauds. Humiliated, Shane crab-walks sideways.\n          \n                                 SHANE (CONT'D)\n                    Take three steps forward and one step\n                    back... (He does.)\n          \n          EXT. PLUMMER HOUSE - MORNING - THE NEXT DAY\n          \n          As Mr. Chun gets his paper, Shane, (Tyler in the\n          snuggle), hands out bag lunches as the Kids load into the\n          minivan. Shane turns and catches Mr. Chun, staring.\n          \n                                 SHANE\n                    What are you looking at?\n          \n          INT. GARAGE - MOMENTS LATER\n          \n          Todd sits in the back of the Minivan, listening to Sound\n          of Music on his Walkman, Lulu is next to him, with her\n          Gameboy, Zoe and Peter are half asleep. Shane climbs into\n          the PASSENGER SEAT. Zoe realizes he's staring at her,\n          through the mirror.\n          \n                                 SHANE\n                    Today you drive.\n          \n          T\n          \n          \n          \n          \n                    A\n          \n          \n          \n          \n                                                                   70.\n          \n          \n          \n          The Kids sit bolt upright. They turn to Zoe, terrified.\n          She gets out in shock, and gets in the driver's seat. The\n          other Kid's seat belts CLICK loudly.\n          \n                                 ZOE\n                    But -- I can't even pass driver's Ed.\n          \n                                 SHANE\n                    Exactly.\n          \n                                 ZOE\n                    Have you given a driving lesson before?\n          \n                                 SHANE\n                    N\n                     ot in a car, no... but it's a lot like\n                    a Bradley Assault Vehicle.\n          \n                                 TODD\n                    Especially when Zoe's driving.\n          \n          The Kids share a dubious look. Zoe backs jerkily out.\n          \n          INT. MINIVAN - CONTINUOUS\n          \n          Zoe is super-tense as they drive. Shane is nervous, but\n          trying not to show it. Lulu and Todd are terrified.\n          \n                                 SHANE\n                    Do you know what causes most accidents?\n                     ttention span. The most important thing\n                    is that you keep an absolute focus on...\n          \n          Zoe's looking RIGHT at him, not the road.\n          \n                                 SHANE (CONT'D)\n                    THE ROAD! Don't look at me...\n          \n                                 ZOE\n                    What?!?\n          \n           he Minivan brakes abruptly at a red light, just as a\n          semi SCREAMS through the intersection. Shane is shaky.\n          \n                                 ZOE (CONT'D)\n                    You wanna drive?\n          \n                                 SHANE\n                    No. Keep going. I trust you.\n          \n          Zoe is surprised. Touched. She pulls out, jerkily.\n          \n                                 S\n          \n          \n          \n          \n                                 P\n          \n          \n          \n          \n                                                                   71.\n          \n          \n          \n          EXT. BETHESDA K-12 SCHOOL - LATER\n          \n          Zoe pulls to the curb, almost tapping a bus's rear\n          fender. Shane unclenches his teeth.\n          \n                                 SHANE\n                    Good. Next lesson, 1500 hours.\n          \n          Zoe smiles. And the other Kids all bolt from the car,\n          terrified. Lulu makes a big show of kissing the ground.\n          \n                                 ZOE\n                    Ha ha ha. Very funny.\n          T\n           hey head into the school.   Shane spots something.\n          \n          ANOTHER ANGLE reveals: SCOTT (Zoe's boyfriend), with a\n          few FRIENDS, laughing, being obnoxious. Shane jumps out\n          of the car. Before Scott knows what's happened, Shane's\n          LIFTED him in the air by his backpack. Scott's terrified.\n          \n                                 SHANE\n                    I know 437 ways to hurt a man without\n                    touching him. Broken promises lead to\n                    broken legs. Do we understand each other?\n          \n          Scott nods, trembling. Shane lets him down and heads into\n          school.\n          \n          INT. BETHESDA K-12 SCHOOL, CAFETERIA - LUNCHTIME\n          \n          Shane (Peter in lap, Tyler in snuggle) keeps an eye on\n          the Kids at their tables. KIDS boisterously run past.\n          Suddenly -- Claire BARKS out.\n          \n                                  RINCIPAL CLAIRE\n                    CHILDREN... STOP RUNNING!!\n          \n          The kids instantly freeze. Claire strides into view.\n          She's wearing a cute dress, and a little make-up.\n          \n                                 PRINCIPAL CLAIRE (CONT'D)\n                           (a long, severe stare)\n                    Now... WALK! DOUBLE TIME.\n          \n          Chastened, the kids gulp and orderly march away. Shane's\n          eyes alight, impressed.\n          \n                                  SHANE\n                    Wow.   I'm glad I never had you for a CO.\n          \n                                 S\n          \n          \n          T\n          \n          \n          \n          \n                                 P\n          \n          \n          \n          \n                                                                72.\n          \n          \n          \n                                 PRINCIPAL CLAIRE\n                           (she coyly smiles)\n                    I've noticed improvement in your troops\n                    lately, too. Noon and none of them have\n                    been called to my office. It's a miracle.\n          S\n           he sits beside him, and offers him a milk.\n          \n                                  RINCIPAL CLAIRE (CONT'D)\n                    Buy you a drink, sailor?\n          \n                                 SHANE\n                    Thanks.\n          \n           hey eat in silence. Shane`s not so good at small talk.\n          She's waiting for him to say... something.\n          \n                                 SHANE (CONT'D)\n                    You look nice today.\n          \n                                 PRINCIPAL CLAIRE\n                    This old thing? Well, you never know who\n                    you're going to run into.\n          \n          She smiles. He smiles back... Suddenly, there's a\n          commotion: Murney is marching Todd towards them, dragging\n          him by the ear. Principal Claire sighs \"not again.\" In\n          one move, Shane leaps over the table. Principal Claire\n          watches him leap:\n          \n                                 PRINCIPAL CLAIRE (CONT'D)\n                    ... Love it when he does that.\n          \n          Murney shoves Todd forward.\n          \n                                 MURNEY\n                    I've had it. I just caught this boy\n                    dancing under the bleachers like some\n                    kind of Bavarian fruitcake.\n          \n          Murney gets up in Shane's face.\n          \n                                 MURNEY (CONT'D)\n                    I want this freak outta my school and\n                    into treatment. Somebody needs to give\n                    this punk a talking to...\n          \n                                 TODD\n                    Hey. I'm right here. Talk.\n          E\n           veryone is shocked that Todd talked back. A hushed\n          whisper goes through the cafeteria. Murney turns around.\n          \n                                 M\n          \n          \n          \n          \n                                                                   73.\n          \n          \n          \n                                 MURNEY\n                    You got something to say? Boy?\n          \n                                 TODD\n                    Yeah. Yeah I do. I quit, Murney.\n          \n          A hushed \"oooh\" goes through the Students.\n          \n                                 MURNEY\n                    Winners never quit, boy. What're you so\n                    scared of, Freak?\n          \n          The Students snicker. Todd looks, intimidated. Then:\n          \n                                 TODD\n                    I am not scared. I... I want to sing.\n          \n          Silence. No one's sure they heard him right. Todd pulls\n          out a stack of SOUND OF MUSIC FLYERS and hands them out.\n          Todd is on the poster in his Rolf costume. Principal\n          Claire takes one: she laughs, now it all makes sense.\n          \n                                 TODD (CONT'D)\n                    I'm in Sound of Music. It opens Friday...\n          \n                                 MURNEY\n                    A musical? You're blowing off wrestling\n                    for a musical? (to Shane:) This is what\n                    happens when there's no man in the house.\n          \n                                 TODD\n                    There is a man in my house -- me. (Murney\n                    turns:) Let's get one thing clear. I'm\n                    not quitting cause I hate wresting. I'm\n                    quitting because you're a bad coach. You\n                    suck. The whole team wants to quit. I'm\n                    the only one with the guts to do it.\n          M\n           urney looks over at the Team. They look to the ground\n          sheepishly, Todd's telling the truth. Murney looks\n          around, humiliated, furious --\n          \n                                  URNEY\n                    So -- you're a tough guy now?\n          \n          Murney takes ONE STEP towards Todd -- Shane steps between\n          them, protecting him.\n          \n                                 MURNEY (CONT'D)\n                    Stay out of this, baby sitter!\n          \n          Murney glares at him -- face to face. So calm, it's scary\n          \n                    S\n          \n          \n          \n          \n                                                                   74.\n          \n          \n          \n                                 SHANE\n                    You said you wanted to wrestle. You win.\n                    Let's do it.\n          \n          Everyone is watching. Murney did not expect to be called\n          out. His voice cracks -- then he regains his calm:\n          \n                                 MURNEY\n                    After school. The Gym. Your ass is mine.\n          \n          He storms out. There is a stunned moment -- and then a\n          mob of Students, and a lot of CUTE GIRLS, swarm Todd,\n          taking flyers. Shane gives Todd a proud thumbs up.\n          \n          A QUICK SERIES OF SHOTS: Of STUDENTS whispering to other\n          STUDENTS, passing notes: A Kid opens a note -- it reads:\n          \"Murney's getting his ass kicked. 3:00.\"\n          \n          INT. GYM - 3:00\n          \n          The bleachers are PACKED. Murney struts out onto the mat.\n          The two fighters begin circling one another. The\n          Wrestlers scream for Murney. Todd cheers Shane on.\n                                 M\n                                  URNEY\n                     on, you're about to enter Murney's house\n                    of pain.\n          \n                                 SHANE\n                    I'll be sure to lock up when I'm through.\n          \n          Murney roars and CHARGES Shane. Shane defensively uses\n          Murney's momentum to flip him halfway across the mat.\n          WHAM. Murney lands on his back.\n          \n          The Wrestlers mouths drop. Murney, shocked, climbs to his\n          feet and CHARGES again, Shane side-steps, and sweeps\n          Murney -- sending him right into the wall, hard.\n          \n          Murney bounds to his feet, rushes Shane. Shane DIVES\n          OVER Murney, grabs onto Murney's waist. Shane's momentum\n          pulls Murney backwards -- BAM. Murney's shoulders hit the\n          mat with Shane smiling down on him.\n          \n          Todd flops to the mat, raises his hand and SLAPS it down-\n          \n                                 TODD\n                    Pinned!\n          \n          Shane stands. Shane throws an arm around Todd, and they\n          head out. The Wrestling Team huddles around Murney, who's\n          quietly twitching on the ground, mumbling something.\n          \n                                  S\n          \n          \n          \n          \n                                                                     75.\n          \n          \n          \n                                  TODD (CONT'D)\n                    Is he okay?\n          \n                                 SHANE\n                    Dislocated nerve, that's all. He'll be\n                    fine in (checking his watch) two months.\n          \n                                 TODD\n                    That was awesome.\n          \n          They walk out. The crowd cheers. Claire, too. Shane\n                                 S\n          smiles at her as he passes. She gives him a thumbs up.\n          \n                                 SHANE\n                           (to Todd)\n                    Let's go, Todd. I got my troops waiting.\n          \n                                                               CUT TO:\n          \n          EXT. FOREST - DAY\n          \n          Shane marches the Brownies through a FOREST.    He wears\n          Peter and Tyler in front and rear Snuggles.\n          \n                                 SHANE\n                    If you're ever lost in the woods, the\n                    first thing you have to do is find a\n                    source of drinking water! And make sure\n                    it's potable. If you're not sure, boil\n                    it for thirty minutes!\n          \n          The girls are loving it, fascinated.\n          \n                                 SHANE (CONT'D)\n                    You have to eat, right? Well let me tell\n                    you you're not gonna find Girl Scout\n                    cookies out here.\n          \n                                 LULU\n                    We're Brownies.\n          \n                                   SHANE\n                    No brownies   either. A lot of roots are\n                    edible. So    is some tree bark. When I\n                    HALO'd into   Rwanda, I lived off the\n                    underground   fern stem for three weeks!\n          \n          Shane kicks over a ROCK.    Underneath are crawling BUGS.\n          \n                                 SHANE (CONT'D)\n                    Insects. They look nasty but they're full\n                    of nutrients that may save your life.\n          \n                                                                76.\n          \n          \n          \n          He scoops up some bugs and EATS them.\n          \n                                 BROWNIE\n                    He's eating Roly-Polies!\n          \n          The Brownies are frozen in shock.\n          \n                                 SHANE\n                           (mouth full of bugs:)\n                    Wots of pwotien!\n          \n          E\n          UPBEAT MUSIC kicks in over the following MONTAGE:\n          \n          EXT. PLUMMER HOUSE - FRONT LAWN - DAWN\n          \n          Shane leads the Brownie Troop through Combat exercises.\n          In unison, the Girls PUNCH, KICK. PUNCH, PUNCH, KICK.\n          Shane's got Tyler's cradle next to him, in between\n          punches, in perfect tempo, he reaches out and rocks it.\n          The Duck watches all this -- fascinated.\n          \n          EXT. MALL PARKING LOT - EARLY MORNING\n          \n          The lot is empty. Shane and Zoe sit in the minivan, Shane\n          holds a stopwatch. He signals her, she burns rubber, and\n          races through a slalom of orange cones -- she hits EVERY\n          ONE -- the wheel hubs are CLOGGED with cones. She skids\n          to a stop just short of the \"Severe Tire Damage\" spikes.\n          \n          INT. NURSERY - DAY\n          \n          Shane changes Tyler's diaper WITH ONE HAND. In his other\n          hand he's reading The Brownie Handbook. It's open to a\n          page that reads \"Knot Tying.\"\n          \n          INT. OLD FACTORY - DAY\n          \n          The CAST is assembled on stage, where Shane has set up a\n          scale model of the set on the floor. He illustrates the\n          stage directions, by moving around toy army men:\n                                 S\n                                 SHANE\n                    Okay -- we'll put Von Trapps here, here,\n                    and... here at the top of the stairs. Now\n                    the Nazis are gonna come in, this way --\n                    and the Von Trapp is set...\n          \n          He laughs at his own joke... The Kids don't get it.\n          \n          EXT. MALL PARKING LOT - DAY\n          \n          Zoe leaps into the minivan through the windows. Zoe peels\n          out and weaves the cones...\n          \n                                   T\n          \n          \n          \n          I\n          \n          \n          \n          \n          E\n          \n          \n          \n          \n                                                                   77.\n          \n          \n          she only clips one, it teeters, but doesn't fall. Shane\n          gives her a signal, she throws it in reverse and drives\n          the course backwards.\n          \n          EXT. PLUMMER HOUSE - FRONT LAWN - DAY\n          \n          Lulu, in   her BROWNIE uniform, ties a complicated knot --\n          we WIDEN   to see she's tying Shane's hands behind his\n          back, as   the Brownie troop watches. He counts \"1,2,3...\"\n          and then   begins wriggling free. They watch closely.\n          \n          EXT. MALL PARKING LOT - DAY\n          \n          Shane and Zoe are huddled under the minivan's dashboard.\n          Shane's showing her the IGNITION WIRES.\n          \n          EXT. PLUMMER HOUSE - BACK YARD - DAY\n          \n          Shane has the Brownies assembled. He's attached SOFA\n          CUSHIONS to himself. The Brownies attack, mercilessly.\n          \n          INT. NURSERY - DAY\n          \n          Shane changes Tyler's diaper RAPID-SPEED.    Hands a blur.\n          \n          INT. OLD FACTORY - NIGHT\n          \n          Todd and \"Liesl\" work on the You Are Sixteen dance.\n          \n                                    ODD\n                      ... your life little girl, is an empty\n                      page/that men will want to write on...\n          T\n           odd tries the spinning kick, but blows it, landing hard.\n          Shane blows a WHISTLE.\n          \n                                   SHANE\n                      Why don't we just let the Nazis win\n                      tonight -- huh? Now. From the top --\n                      think of yourself as a gazelle prancing\n                      over the plains. Graceful.\n          \n          Todd tries the kick. THUD!    Shane BLOWS the whistle.\n          \n                                    SHANE (CONT'D)\n                      Gazelle.   Prancing. Graceful.   Again.\n          \n          INT. NURSERY - NIGHT\n          \n          At the end of Peter's crib, Shane performs the \"Panda\n          Dance.\" Singing and doing all the moves -- he's got it\n          down, adding a James Brown flourish, now and then.\n          \n                                  U\n          \n          \n          \n          \n                                                                 78.\n          \n          \n          \n                                 SHANE\n                    Don't touch that dial sleep for a while --\n                    HEAAAY! And say good night, Peter Panda.\n          \n          He does a spin kick. Then he tucks Peter in.\n          \n                                 SHANE (CONT'D)\n                    Good night, Peter.\n          \n                                 PETER\n                           (going to sleep)\n                    Good night, daddy.\n          \n          Shane is so touched, he almost bursts into tears. He\n          kisses Peter on the forehead.\n          \n                                 SHANE\n                    I'm not your daddy, Peter. But sweet\n                    dreams.\n          \n                                                         MONTAGE ENDS\n          \n          EXT. \"PRICE CLUB\" STORE - EVENING\n          \n          The Brownies sit at their cookie table beside the door.\n          Across the lot, the Chubby Cub Scouts, at their own\n          table, see them. The Scouts head towards the Brownies.\n                                 U\n                                  GLY CUB SCOUT\n                    Hey Skeever, what's in a Girl Scout's\n                    pants when she has diarrhea?\n          \n                                  2ND SCOUT\n                    Brown...\n          \n          He stops short, the Brownies have moved into a FORMATION,\n          ready to strike, Lulu at the front: it's (kind of) scary.\n          \n                                 LULU\n                    Go away and we won't hurt you.\n          \n          The Scouts share a look -- they LAUGH. The head Scout\n          steps forward and grabs Lulu's cookies. In one move, she\n          spins out of the way and pulls off his neckerchief.\n          \n                                   GLY CUB SCOUT\n                    Gimme that!\n          \n          He grabs the neckerchief, but like lightning, she wraps\n          it around his arm, tying him. She shoves a cookie in his\n          mouth.\n          \n                                                                 79.\n          \n          \n          \n                                 LULU\n                    Uh oh. You're gonna have to pay for that.\n          \n          The Scout struggles, the Other Scouts are scared.\n          \n                                 UGLY CUB SCOUT\n                    Let go! Let go -- MOMMY!\n          \n          She lets him go -- in a FLIP, he lands on the ground\n          hard. Lulu lets out another \"kia!\" The Girls move\n          forward in unison, striking a cool pose.\n          \n          INT. \"PRICE CLUB\" STORE - CONTINUOUS\n          \n          Shane shops, wearing the double snuggle. As he's\n          comparing prices -- he sees, on the security monitor: The\n          Brownies attacking the Cub Scouts. He smiles, proud.\n                                 S\n                                 SHANE\n                    That's my troop.\n          \n          EXT. \"PRICE CLUB\" STORE - A MOMENT LATER\n          \n          The Cub Scouts have all been tied with their own bandanas\n          to the CART CORRAL. Shane comes out of the store, and\n          catches Lulu, using his \"catchphrase.\"\n          \n                                 LULU\n                    From now on, you do things our way -- no\n                    highway option!\n          \n          The Scouts nod, terrified. Shane gives her a stern look,\n          then LAUGHS.\n          \n          INT. VAN - DRIVING - DUSK\n          \n          Shane drives. The Brownies joyously CHANT a MARCH.\n          \n                                 BROWNIES\n                    I don't care what has been said,\n                    Brownies rock! Full speed ahead!\n                    Give me guff, I'm in your face!\n                    Brownies rule the human race!\n          \n                                 SHANE\n                    Sound off!\n          \n                                 BROWNIES\n                    One two! Three four! One TWO THREE FOUR!\n          \n          INT. PLUMMER HOUSE - UPSTAIRS - LATER\n          \n          Shane works his way down the hall, checking on the kids:\n          \n                    N\n          \n          \n          \n          \n                                                                  80.\n          \n          \n          \n          - LULU'S ROOM: LULU is asleep.\n          \n          - TODD'S ROOM: The door is OPEN -- Shane peers in. Todd\n          has a SWITCHBLADE. He is practicing with it, clicking it\n          open, tossing it hand to hand. Off Shane's look:\n          \n                                 TODD\n                    West Side Story auditions in two weeks...\n          \n          Shane takes the switch blade, and performs an AMAZING\n          trick with it, spinning Sit like a pro.\n          \n                                 SHANE\n                    It's all in the wrist...\n          \n          He heads down to Zoe's room and peaks in -- SHE'S NOT IN\n          BED. He rushes in -- but she's out on...\n          \n          EXT. BALCONY - NIGHT\n          \n          Zoe sits on the railing, she seems sad. Shane approaches.\n          \n                                   ZOE\n                    Don't worry.    I'm not gonna jump.\n          \n                                 SHANE\n                    What's wrong... Scott?\n          \n                                 ZOE\n                     o. Scott's fine. I don't know what you\n                    did, but he's really straightened up.\n                    Flowers, phone calls. ...I've never been\n                    in love like this before.\n          \n          Shane nods.\n          \n                                 SHANE\n                    How long you been together?\n          \n                                   ZOE\n                    A month...\n          \n                                 SHANE\n                    That's longer than any relationship I've\n                    ever had.\n          \n                                 ZOE\n                    You're okay, Shane. I'm not used to\n                    anyone giving me the benefit of the\n                    doubt. My teachers don't trust me. Mom\n                    doesn't. My dad didn't care about us, he\n                    was never here...\n          \n                                   Z\n          \n          \n          \n          \n                                   Z\n          \n          \n          \n          \n                                   S\n          \n          \n          \n          \n                                                                 81.\n          \n          \n          \n                                 SHANE\n                           (interrupts her, stern:)\n                    Hey. Your father cared about you very\n                    deeply. He told me you were the greatest\n                    things in his life. That what's bothering\n                    you? Cause -- we can talk about it, if\n                    you want.\n          \n          Zoe's eye well up, then she cries. Shane holds her.\n          \n                                 ZOE\n                    I miss him so much...\n          \n          Shane is a little taken by surprise. Then -- he decides\n          to answer. He takes his Sfather's MEDAL out of his pocket.\n          \n                                 SHANE\n                    This was my dad's. He was the only family\n                    I ever had. Mom left when I was little,\n                    cause dad was always gone. Two years\n                    in... an indisclosable locale. Another\n                    six in... Another indisclosable locale. I\n                    didn't really have a home, so I went to\n                    military school -- then one day my mom\n                    got the letter. No more dad.\n          \n          He looks at the Medal.\n          \n                                 SHANE (CONT'D)\n                    I always wanted to be just like him. I'm\n                    starting to realize, I never really knew\n                    him. I don't know if I'm like him or not.\n          \n                                 ZOE\n                    That's horrible, Shane.\n          \n                                 SHANE\n                    The hardest part was living without any\n                    details...why? How? Where? I always\n                    wondered if he thought about me.\n          \n                                   OE\n                    Me too.   So how did you get through it?\n          \n                                 SHANE\n                    You could say I just shut down my\n                    emotions. I turned off all feelings and\n                    dedicated myself to becoming the perfect\n                    soldier.\n          \n                                  OE\n                    I never even got to say good bye.\n          \n                                    J\n          \n          \n          \n          \n                                                                  82.\n          \n          \n          \n          A tear runs down Zoe's face. She throws her arms around\n          Shane. The phone rings. Shane answers it.\n          \n                                                        INTERCUT WITH:\n          \n          J\n          INT. HOTEL - CONTINUOUS\n          \n           ulie's on the other end.\n          \n                                 JULIE\n                    The red tape is cleared up, we're on the\n                    first plane in the morning.\n          \n          INT. HALLWAY - MOMENTS LATER\n          \n          Zoe runs down the hall, telling the family:\n          \n                                 ZOE\n                    Mommy's coming home! Mommy's coming home!\n          \n          Everyone wakes up, happy, sleepy!\n          \n                                    TODD\n                    When?\n          \n                                 ZOE\n                    Tomorrow morning!\n          \n                                    PETER\n                    Mama!\n          \n          Excited, the kids are all abuzz, talking excitedly.\n          \n          ANGLE - SHANE\n          \n          He's left alone.\n          \n          EXT. BACK YARD - LATE NIGHT\n          \n          The house is dark. Shane sits in a lawn chair, scoping\n          the area with NIGHT VISION GOGGLES ON. Gary sits in the\n          next chair. Shane sighs morosely.\n          \n                                 SHANE\n                    Just another assignment. No reason for\n                    personal attachments.\n          \n          Shane takes a sip out of a juice box. He pets the Duck.\n          \n                                 SHANE (CONT'D)\n                    Hey Gary, your wings aren't clipped. How\n                    come you don't fly away?\n                           (pause)\n                                 (MORE)\n          \n          T\n          \n          \n          \n          \n                                  S\n          \n          \n          S\n          \n          \n          \n          \n                                  S\n          \n          T\n          \n          \n          \n          \n                                                                  83.\n                                  SHANE(CONT'D)\n                    I guess you've got it good.    Kids to play\n                    with. Three squares a day.\n          \n           he Duck stares, unblinking.\n          \n                                 SHANE (CONT'D)\n                    All quiet on the western front. I guess I\n                    better fix that Playroom window.\n          S\n           hane rises.\n          \n          INT. GARAGE - NIGHT\n          \n           hane turns the light on. Gary follows Shane as he looks\n          for tool. Suddenly, the Duck starts quacking... Shane\n          turns. Gary's foot is caught in a grate.\n          \n                                 SHANE\n                    What happened, Gary?\n          \n          Shane gets down on his hands and knees and gently pries\n          Gary's foot from the grate. Shane is about to stand when\n          something below catches his eye.\n          \n          Shane pulls out a pen flashlight, shines it down the\n          grate... we see a CRANK WHEEL.\n          \n                                 SHANE (CONT'D)\n                    What do you suppose this is?\n          \n          Shane tugs at the grate until it pops off. Shane grips\n          the valve and tries turning it. Nothing. He tries harder,\n          muscles rippling, and then it gives... The wheel spins.\n          \n           he floor opens, revealing a CIRCULAR STAIRCASE, leading\n          below the garage. Shane steps down it...\n          \n          INT. BOTTOM OF STAIRS - CONTINUOUS\n          \n          There's a small room, and a hall leading to a STEEL DOOR.\n          It's solid and inscrutable. No hinges or cracks. The only\n          break in its surface is a strange, TWO-PRONGED KEYHOLE.\n          Shane looks on stunned...\n          \n                                                         DISSOLVE TO:\n          \n          INT. GARAGE - MORNING\n          \n          Shane's at the Steel Door. He has high-tech tools laid\n          out in front of him. He's been trying, unsuccessfully, to\n          crack the lock all night. The Kids are watching his\n          progress, Lulu hands him a tool. Shane dials a phone.\n          \n                                                            INTERCUT:\n          \n                                  B\n          \n          \n          \n          \n                                  S\n          \n          \n          \n          \n                                                                  84.\n          \n          \n          \n          EXT. SEDAN - MOVING\n          \n          We pan up from the WHITE \"US GOV\" license plates to Bill\n          at the wheel. Julie sits beside him. Bill's cell phone\n          rings, he answers it.\n          \n                                SHANE\n                    Sir! Excellent news. I think I found\n                    GHOST.\n          \n          Bill reacts, excited.\n          \n                                 BILL\n                    ... Do you have it?\n          \n                                 SHANE\n                    No. It's in a steel vault. I've been\n                    trying all night, can't crack it, sir.\n          \n                                  ILL\n                           (remaining calm)\n                    Good! Good work. Okay, don't do\n                    anything further. We'll be there shortly\n                    -- don't do anything `til I get there.\n          \n                                                             BACK TO:\n          \n          INT. GARAGE - CONTINUOUS\n          \n          Shane smiles, pleased, and hangs up. Then we slowly MOVE\n          UP. Away from Shane... towards the neighbor's house.\n          W\n           e PUSH INTO the house. Through a window... revealing\n          the Korean neighbors standing in the dark. Silently\n          spying on Shane. An ominous pause.\n          \n                                  MRS. CHUN\n                    GHOST.\n          \n                                                             CUT TO:\n          \n          INT. GARAGE - CONTINUOUS\n          \n                                 SHANE\n                    One things for sure. After we turn this\n                    in to my CO, whoever's been bothering you\n                    guys won't be bothering you anymore.\n          \n          Everyone reacts happily, relieved.   Except for -- Lulu.\n          She looks stricken.\n          \n                                 SHANE (CONT'D)\n                    What's wrong, Lulu? You should be happy.\n          \n          I\n          \n          \n          \n          \n                                                                   85.\n          \n          \n          \n                                 LULU\n                    But, Shane -- does that mean you'll have\n                    to go?\n          \n          CLOSE-UP - SHANE\n          \n          He goes silent.    Tongue-tied, he has no answer.\n          \n                                 SHANE\n                    You guys better get ready.    Your mom\n                    should be home soon.\n          \n                                                               CUT TO:\n          \n          EXT. HOUSE - DAY\n          \n          Bill's Sedan pulls up.    Julie and Bill hop out.\n          \n          INT. JULIE'S HOUSE - MOMENTS LATER\n          \n          Julie opens the door, comes into the dark hall. Bill is\n          carrying her suitcases.\n          \n                                 JULIE\n                    I had a fight with Zoe when I left, so\n                    they probably trashed the place...\n          \n          She trails off...\n          \n                                 BILL\n                    What's wrong?\n          \n          They listen -- they hear, in the next room, Kids singing\n          a beautiful, a capella version of The Hills are Alive\n          (with The Sound of Music). She turns on the lights --\n          what she sees makes her drop her luggage, in shock.\n          J\n          JULIE'S P.O.V.: The house is spotless. The rug is\n          vacuumed. The fish tank is clear, filled with healthy\n          TROPICAL FISH.\n          \n                                 KIDS VOICES\n                           (singing, a capella)\n                    ... with songs they have sung, for a\n                    thousand years...\n          \n          Dumb-struck, Julie goes to the...\n          \n          INT. KITCHEN - CONTINUOUS\n          \n          The kitchen is sparkling clean, no dishes in the sink.\n          She sees, attached to the fridge with magnets: A flyer\n          for Sound of Music, featuring Todd.\n          \n                              (\n          \n          \n          \n          \n                                   B\n          \n          \n          \n          \n                                                                 86.\n          \n          \n          \n          JULIE almost faints. Bill steadies her. She staggers\n          to...\n          \n          INT. DINING ROOM - CONTINUOUS\n          \n          Shane and the Kids are holding up a home-made sign:\n          WELCOME HOME, MOM! Todd pushes STOP on a CD player: The\n          Sound of Music stops.\n          \n          Zoe is in a conservative dress, Todd a button down and\n          khakis: barely recognizable. Lulu has bows in her hair.\n          Peter is fresh faced, smiling, Tyler is asleep: a picture-\n          perfect family.\n          \n                                 ZOE\n                    Welcome home, mom.\n          \n          Julie starts bawling. The Kids rush forward and hug her.\n          Across the room, Shane sees Bill enter. Shane stiffens\n          and salutes proudly.   S\n                                   SHANE\n                    Captain.\n          \n                                 BILL\n                           (he smiles wryly, then\n                            salutes back)\n                    Good job, Lieutenant.\n          \n          INT. GARAGE - DAY\n          \n          Shane leads Bill inside. Bill holds the pronged key.\n          \n                                  ILL\n                    I'm really proud of you, Shane. I'm\n                    giving you your choice of assignment,\n                    anywhere you want. You just name it.\n          \n                                 SHANE\n                    That's kind of you, Sir...\n                            pause)\n                    But I'll have to think about it.\n          \n          Bill stops, surprised.   Shane continues, a bit reluctant.\n          \n                                 SHANE (CONT'D)\n                    Sir, all I've never known is the\n                    military. At nine years old my father\n                    put me in cadet school and from there I\n                    never looked back. Don't get me wrong, I\n                    wouldn't trade it for anything and I have\n                    no regrets...\n          \n          S\n          \n          \n          \n          \n                                   S\n          \n          \n          \n          \n                                                                    87.\n          \n          \n          \n                                 BILL\n                    I should hope not.\n          \n                                 SHANE\n                    But being with these kids has made me\n                    feel like there's more to life than\n                    taking out your enemy. And I think I\n                    want to explore that some more.\n          \n          Suddenly, an ANGRY VOICE.\n          \n                                 MAN'S VOICE\n                    PUT YOUR HANDS UP!!\n          \n          WIDE\n          \n          Shane and Bill spin, startled.    The CHUNS strides up,\n          GUNS DRAWN.\n          \n                                 MRS. CHUN\n                    Give US THE KEY!\n          \n                                 SHANE\n                    Mr. and Mrs. Chun?     They checked out-\n          \n                                   KOREAN MAN\n                    H\n                        ands up!\n          \n          Compliant, Shane puts his hands behind his head. He\n          takes a submissive position... Mrs. Chun comes closer,\n          reaching for Bill's key... Shane shoots Bill a glance...\n          \n                                   SHANE\n                    NOW!\n          \n          Shane SPINS and grabs both guns! He WHACKS the Koreans'\n          forearms, while SLAMMING their heads together.\n          \n           hane takes control! He smiles, relishing a second of\n          glory -- when suddenly, CRACK! A third gun BUTTS him in\n          the head.\n          \n          CLOSE-UP - SHANE\n          \n          Lights out. He turns, startled, and starts to fall.\n          Disoriented, confused, he looks up as he drops...\n          \n          SHANE'S POV\n          \n          He is losing consciousness. Things are spinning... woozy.\n          \n                                   B\n          \n          \n          \n          \n                                                                        88.\n          \n          \n          \n                                  KOREAN MAN\n                            (arguing with Bill)\n                     You promised us GHOST months ago!\n          \n                                  BILL\n                     I'm sorry, Mr. Chun. There were delays...\n          \n          Shane peers in confusion, then passes out.\n          \n                                                          FADE TO BLACK.\n          \n          FADE IN:\n          \n          INT. NURSERY - MOMENTS LATER\n          \n          Julie and the Kids are on the floor, tied up. Peter and\n          Tyler are caged in the play pen. Peter has a JUICE BOX.\n          The Korean Man (Mr. Chun) secures the room, closing the\n          window shades. Bill checks the knots binding the\n          children. They whimper, scared.\n                                 L\n                                    ULU\n                     SHANE!!\n          \n                                  BILL\n                     He won't be baby-sitting you anymore.\n          \n          He GAGS the kids.    Julie glares, livid.\n          \n                                  JULIE\n                     I trusted you. Charles trusted you. So\n                     did the Department of Defense.\n          \n                                   ILL\n                     North Korea pays better.\n                            (to Mr. Chun)\n                     Keep an eye on them. You -- with me.\n          \n          Bill GAGS Julie. The Kids are furious. Bill and Mrs. Chun\n          exit.\n          \n          INT. GARAGE - DAY\n          \n          Shane lies unconscious. Bill and Mrs. Chun approach the\n          steel door. Bill inserts the two-pronged key... and it\n          CLICKS. The door HUMS, then slides OPEN!\n          \n          Inside is a dark corridor.      Bill grins.   They enter...\n          \n          INT. SECRET VAULT\n          \n          Light is at the end.    They anxiously tiptoe, reaching...\n          \n                                                                 89.\n          \n          \n          \n          THE VAULT! Spare, bright and white. The floor is\n          covered with square tiles. At the far end is a LARGE\n          ELEVATED SAFE. Beside the safe is a red switch, with two\n          settings: ARMED and DISARMED. It's set on ARMED. The air\n          is filled with an ominous, low-pitched HUM, like a\n          monstrous computer. Bill eyes the safe.\n          \n                                 BILL\n                    You bring your stethoscope?\n          \n                                  MRS. CHUN\n                    No.   But I've got some C4.\n          \n          She confidently strides toward the safe -- which sets off\n          hidden flame-throwers in the walls. A jet blast of FLAME\n          shoots out! She leaps back just in time, but the shoulder\n          of her jacket is on fire. Bill pats out the flames with\n          his own jacket. Chun is Bokay, just missing BOTH eyebrows.\n          \n                                  ILL\n                    Charles never made things easy.\n          \n          Mrs. Chun's eyebrows are neatly, completely SINGED OFF.\n          \n                                 MRS. CHUN\n                    Just... had eyebrows... done.\n          \n          INT. HOUSE - SAME TIME\n          \n          Mr. Chun guards the kids, eyeballing them icily.\n          \n          Lulu \"looks\" scared. But behind her back, we reveal her\n          HANDS untying her ropes! Freed, she hits her panic\n          button! O.S., BEEPING. Lulu grins hopefully: Shane's\n          coming! A beat... then Mr. Chun pulls the Tracker from\n          his pocket. He sneers.\n          \n                                 MR. CHUN\n                    Think I'm stupid? Now stop bothering me.\n          \n          Lulu frowns, then leans back against Zoe. With a rapid\n          blur of finger-work, she unties Zoe! Then -- needing a\n          distraction, she signals Tyler and crosses her eyes.\n          \n          Tyler GASPS, horrified -- and SCREAMS HIS LUNGS OUT.\n          \n          Chun spins, startled -- and Lulu quickly ROLLS across the\n          room! She lands against Todd, quickly assuming a fake\n          bound position, as if she hadn't moved.\n          \n          Mr. Chun whirls -- the Kids look innocent. Mr. Chun is\n          confused for a second: \"wasn't he tied to the other one?\"\n          \n          I\n          \n          \n          \n          \n          W\n          \n          \n          \n          \n                                   Z\n          \n          \n          \n          \n                                                                   90.\n          \n          \n          \n          BEHIND TODD - Lulu frantically unties Todd's ropes --\n          it's gonna be close...\n          \n          Chun scowls. Skeptical, he steps closer... He leans down\n          to look at Todd's ropes Z--\n          \n                                    OE\n                    Now Peter!\n          \n          Peter SQUIRTS JUICE into Mr. Chun's face. The Kids use\n          the distraction: Todd POPS to his feet, then LEAPS into\n          his SPIN KICK: it connects with Mr. Chun's head.\n          \n                                    OE (CONT'D)\n                    Let's GO!\n          \n          All the kids bounce up. They untie Julie, then scoop up\n          Peter and Tyler. Mr. Chun growls and starts to stagger\n          up. Lulu lands in Karate stance and calls out:\n          \n                                   LULU\n                    Hi ya!\n          \n          The other Kids take off, Mr. Chun looks at Lulu.   Mr.\n          Chun laughs:\n          \n                                   MR. CHUN\n                    That's cute.\n          \n           HAM without warning, Lulu SWEEPS Mr. Chun's leg, he\n          drops to his knees in pain, then, when he's at her level,\n          she KICKS him right in the nuts. It HURTS.\n          \n          Mr. Chun tries to grab her by the wrist, but Lulu EVADES\n          with her cool, snake-like move. Lulu runs, slamming the\n          door behind her. Mr. Chun gets up and turns the\n          doorknob, but the door won't budge...\n          \n          INT. OUTSIDE THE NURSERY - CONTINUOUS\n          \n          Zoe shoves a chair between the door and the opposite\n          wall, they're trapped inside.\n          \n          INT. NURSERY - CONTINUOUS\n          \n          Mr. Chun punches the door, making a small hole. He\n          reaches out to knock the chair away but he can't quite\n          reach. He puts his face up to the hole he's made...\n          I\n          INT. OUTSIDE THE NURSERY - CONTINUOUS\n          \n          Todd's outside with a FIRE EXTINGUISHER: he blasts Mrs.\n          Chun's face.\n          \n          M\n          \n          E\n          \n          \n          \n          \n                                    M\n          \n          \n          \n          \n                                                                  91.\n          \n          \n          \n          INT. NURSERY - CONTINUOUS\n          \n          Mr. Chun falls back from the door, his face COATED in\n          white. He yells out furious!\n          \n                                 MR. CHUN\n                    That stuff doesn't hurt.\n          \n          He sticks his face out the hole... DONNGGG -- Todd hits\n          him square in the face with the fire extinguisher ITSELF.\n          \n          EXT. FRONT DOOR - SAME TIME\n          \n          The family comes scrambling out -- but as Julie exits, a\n          HAND suddenly GRABS her.\n          \n                                    JULIE\n                    AGGGH!\n          \n          She SCREAMS. Bill lurches into view, clutching her! The\n          kids are horrified. They start to run back, but she\n          urgently gestures --\n          \n                                    JULIE (CONT'D)\n                    Keep going!     RUN! Go GET HELP!!!\n          \n          The kids fret, unsure, then nod and run to the side\n          garage. Zoe and Todd load the kids into the minivan.\n          \n                                  ZOE/TODD\n                    Hurry!   C'mon! Buckle up!!\n          \n          INT. HOUSE - CONTINUOUS\n          \n          Bill pulls Julie inside. Mrs. Chun listens to Mr. Chun ON\n          THE RADIO, speaking in Korean:\n          \n                                  RS. CHUN\n                    They're headed for the car!\n          \n                                 BILL\n                    Relax -- I've got the keys, they're not\n                    going anywhere...\n          \n          INT. MINIVAN - CONTINUOUS\n          \n          SPARKS FLY as Zoe hot-wires the minivan. She floors it...\n          \n          EXT. HOUSE - CONTINUOUS\n          \n           r. Chun comes racing around the house -- as SCREEEECH!\n          The van suddenly FLOORS out, almost clipping him!\n          \n          Z\n          \n          \n          \n          \n                                    Z\n          \n          \n          \n          \n                                                                 92.\n          \n          \n          \n                                    MR. CHUN\n                    ARGHH!\n          \n          Chun falls, as the van PEELS backwards down the driveway,\n          and 360's. RRRR! It shifts into drive and ROARS away.\n          Chun hops into Bill's car and races after them.\n          \n          INT. VAN - CONTINUOUS\n          \n          Zoe floors it.\n          \n                                   OE\n                    Omigod!   What are we doing??!\n          \n                                 TODD\n                    Let's look for a cop!\n          \n          WIDE\n          \n          The sedan GUNS its engine, gaining on them.\n          \n           oe runs a yellow. She hits the curb and goes AIRBORNE.\n          WHOOOOOO! The kids SCREAM, as they sail through the\n          intersection! The sedan keeps chasing.\n          \n          INT. GARAGE - SAME TIME\n          \n          Bill has Julie at gunpoint, leading her to the secret\n          door. They step past Shane's body, lying on the concrete.\n          \n                                 BILL\n                    How does it work?\n          \n                                 JULIE\n                    How does what work?\n          \n                                 BILL\n                    Don't play dumb. It's getting old. I want\n                    to know how to get through the booby\n                    traps. What's the code?\n          \n                                 JULIE\n                    I don't know any code -- Charles didn't\n                    tell me about the room...\n          \n                                 BILL\n                    If I knew Charles had hidden it so well,\n                    I wouldn't have killed him so soon. Don't\n                    make me kill you too.\n          \n          Julie GASPS, chilled. Then, a CRACKLING of static.    Mrs.\n          Chun exits the vault, holding a military RADIO.\n          \n          B\n          \n          \n          \n          \n                                                                   93.\n          \n          \n          \n                                 MRS. CHUN\n                    Mr. Bill, my husband has question:\n          \n                                 MR. CHUN (OVER THE WALKIE)\n                    I have a clean shot at their tires. It's\n                                 B\n                    risky, they might wreck...\n          \n                                    ILL\n                    ... Do it.\n          \n                                   JULIE\n                    NO!\n          \n          Julie goes frantic, emotional.\n          \n                                 SHANE (O.S.)\n                    Bill, don't hurt the kids.\n          \n          Surprised, everyone looks down.\n          \n          ANGLE - SHANE\n          \n          They look over -- Shane is standing in the doorway.\n          \n                                 SHANE (CONT'D)\n                    I know the code. I'll get you in... just\n                    please don't hurt anyone.\n          \n           ill eyes him. The men stare down, Bill deciding if he\n          can trust him. Then -- he clicks \"talk\" on the radio.\n          \n                                 BILL\n                    Change of plan. Bring them back\n                    unharmed.\n          \n          Bill uncuffs Shane.\n          \n          EXT. BUSY STREET - DAY\n          \n          The vehicles race, Chun just inches from the kids' tail.\n          He tries to pass them on the right. It's like a chariot\n          race, Chun zooming by, half on the sidewalk, to cut them\n          off!\n          \n          INT. MINIVAN - CONTINUOUS\n          \n          Todd scrambles into the back seat. He does something we\n          can't see, as Zoe drives.\n          \n                                 ZOE\n                    What's taking you?\n          \n                                                                             94.\n          \n          \n          \n                                    TODD\n                       Don't wait for me!\n          \n          The sedan pulls up beside them. Zoe makes a very lewd\n          gesture at him. It throws Mr. Chun off for a beat.\n          \n                                         TODD (CONT'D)\n                       Now!\n          \n          Zoe floors it, Mr. Chun is now face to face with Todd --\n          who throws a dirty diaper into the his face. Mr. Chun\n          swerves and almost wrecks. Lulu starts PELTING Mr. Chun\n          with debris: milk cartons, crayons, orange peels.\n                                 M\n                                          R. CHUN\n                       Aah!     HEY --\n          \n          Rubbish clobbers him. Exasperated, Mr. Chun ROLLS UP his\n          window, then POUNDS the gas! Faster! About to pass...\n          \n          Zoe looks over. Chun is pointing a gun!             She suddenly\n          PULLS the emergency brake.\n          \n          WIDE\n          \n          RRRRRRRR!!    The Van SPINS into a squealing 360.\n          \n          Mr. Chun SCREAMS, disoriented, and loses control.\n          \n          In the van, Peter laughs.\n          \n                                         PETER\n                       Wheee!\n          \n          The Van spins madly. The sedan skids and PLOWS into a\n          store window. CRASH!! The kids cheer, triumphant.\n          \n          INT. SECRET VAULT - MOMENTS LATER\n          \n          Shane scopes out the vault. The walls and ceilings are\n          covered with high-tech weaponry. Mrs. Chun holds Julie.\n          Bill waits impatiently. Shane is figuring his options...\n          \n                                    SHANE\n                       Anybody got any perfume?          Hair spray...\n                       breath freshener...\n          \n          A bewildered beat -- then Julie pulls out a tube of\n          Binaca. Shane SQUIRTS it, revealing in the mist a myriad\n          of crisscrossing LASER BEAMS.\n          \n          Shane steps forward. He speaks aloud, confidently:\n          \n                                  J\n          \n          \n          \n          \n          B\n          \n          \n          \n          \n                                  B\n          \n          \n          \n          \n                                                                95.\n          \n          \n          \n                                 SHANE (CONT'D)\n                    Zoe, Todd, Lulu, Peter, Tyler!\n          \n          Bill reacts, puzzled.\n          \n                                 SHANE (CONT'D)\n                    The key is the kid's names. Watch.\n          \n          Shane steps forward - ZAP! The floor tile SHOCKS HIM,\n          sending him flying backwards. Bill laughs. Shane gets up,\n          in pain.\n          \n                                   ILL\n                    You think this is a game?!\n                                 S\n                                 SHANE\n                    But... That was the code! I swear! I saw\n                    Plummer use it on his briefcase.\n          \n                                 BILL\n                    Code or no code, go get it -- now.\n          \n           ill cocks his gun. Sweat drips down Shane's face. He\n          mists the air to see the beams: He steps forward, over\n          one beam and ducking under another -- he miscalculates: a\n          BURST OF FLAME blazes from the ceiling like a giant blow\n          torch, Shane leaps back, landing on his hands and knees.\n          \n                                 JULIE\n                    (to Bill) You can't make him do this --\n                    He doesn't have a chance.\n          \n          CLOSE-UP - SHANE\n          \n          Shane's thinks. He notices a GROOVE carved in the floor,\n          not quite centered to the room. He feels the Groove.\n          Something she said...\n          \n                                 SHANE\n                           (thinking)\n                    Haven't got a chance.\n          \n          Shane feels the Groove in the floor. He thinks. He looks\n          up at the ceiling (bottom of the first floor).\n          \n                                 SHANE (CONT'D)\n                           (sings softly to himself)\n                    ... When you're down and low, lower than\n                    the floor. And you haven't got a chance.\n                    Don't make a move `til you're in the\n                    groove, and do the Peter Panda Dance.\n          \n          E\n          \n          \n          \n          \n                                                                96.\n          \n          \n          \n          Shane LAUGHS sharply. That's the code! He shares a look\n          with Julie. Bill and Julie share a look -- they have no\n          idea what he's laughing about.\n          \n          Calmness comes to Shane's face. He takes a deep breath,\n                                 S\n          facing forwards:\n          \n                                 SHANE (CONT'D)\n                    Just hop three times like a kangaroo --\n          \n          He hops forwards three times, fearlessly. NOTHING\n          HAPPENS. No BOOBY TRAPS are set off.\n          \n                                 SHANE (CONT'D)\n                    Sidestep twice, just like the crabs do.\n          \n          He steps sideway, across two tiles. Again -- NOTHING\n          HAPPENS. It dawns on Julie what he's doing. Julie smiles,\n          relieved. Shane he steps forwards, then back:\n          \n                                 SHANE (CONT'D)\n                    Three steps forward and one step back.\n          \n          When he steps back -- A SPRING-LOADED SPIKE launches down\n          from the ceiling, imbedding itself where he was standing.\n          Shane is rattled, his focus gone. Until Julie shouts:\n          \n                                 JULIE\n                    QUICK LIKE A TURTLE LIE ON YOUR BACK!\n          \n          Shane snaps out of it and flops down on his back -- just\n          in time: FLAMES SHOOT FROM BOTH WALLS right at him. If\n          he'd been standing, he'd be toast.\n          \n          EXT. BUSY INTERSECTION - SIMULTANEOUS\n          \n          The Minivan blasts through another yellow.\n          \n                                 LULU\n                    Look out Zoe! Rollers!\n          \n          There is a POLICE CAR cruising the street ahead of them.\n          Zoe blows past it. Inside is the Cute Cop. The Squad\n          Car's lights flash on, and he catches up with the minivan\n          -- it takes a while, they're FLYING.\n          \n                                 ZOE\n                    Come on. Use the gas, not the brake, 5-0.\n          \n          Zoe slows down so the Police Car can pull up beside her.\n          The Cute Cop shouts over at Zoe.\n          \n                                                                 97.\n          \n          \n          \n                                 CUTE COP\n                    I'd say you could lose your license --\n                    but you haven't got one!\n          \n                                 ZOE\n                    People are trying to kill us. They have\n                    my mom, and our bodyguard -- you have to\n                    follow me!\n          \n                                 CUTE COP\n                    Just pull over!\n          \n                                 ZOE\n                    Fine. Don't follow me!\n          \n          She swerves into the Squad Car, almost running it off the\n          road. Zoe U-turns, and speeds back towards her house. The\n          Squad Car turns around and chases her.\n          \n          EXT. SUBURBAN STREET - MOMENTS LATER\n          \n          The Minivan speeds by. The Squad Car is on its tail. It\n          is joined by MORE SQUAD CARS. Following the chase, at a\n          safe distance, is Mr. Chun in his now-wrecked sedan.\n          \n          EXT. SCHOOL - SAME TIME\n          \n          Murney and Claire are watching a SOCCER GAME.   He's in a\n          NECK-BRACE.\n          \n                                 MURNEY\n                    That Baloney Bandit struck again. I\n                    accept full responsibility. My\n                    intelligence proved to be faulty, but if\n                    I had more resources...\n          \n          She shakes her head, Suddenly, the Minivan SPEEDS by.\n          VROOOOM! Then the Police Car CHASES by. VROOOM!! Then --\n          FIVE MORE POLICE CARS ZOOM BY. VROOOOOOM!!!\n          \n                                 MURNEY (CONT'D)\n                           (not that surprised:)\n                    I told you not to pass her in Driver's\n                    Ed.\n          \n          Claire frowns, concerned...\n          \n          INT. PLUMMER BASEMENT - CONTINUOUS\n          \n          Shane is on the floor, sliding forward, nervously.\n          \n                              \n          \n                                                                  98.\n          \n          \n          \n                                 SHANE\n                    Wriggle like a snake `til you can't no\n                    more. Then better jump quick, like there\n                    ain't no floor.\n          \n          Shane jumps up just AS THE FLOOR UNDER HIM DROPS AWAY,\n          revealing a pool of liquid. Shane has wedged himself in\n          the corner. A bead of his sweat falls into the liquid,\n          and sizzles in a cloud of smoke. It's acid.\n          \n                                 SHANE (CONT'D)\n                           (to himself, to calm down)\n                    Almost done, almost done... \"Just hold\n                    your breath, and jump to the left.\"\n          \n          He jumps, to the left of the HOLE. He lands in front of\n          THE SAFE. He's relieved -- then nozzles spray YELLOW GAS\n          at him. He holds his breath just in time. Still holding\n          his breath:\n          \n                                 SHANE (CONT'D)\n                    And that's the Peter Panda Dance.\n          \n          He flips the switch to DISARMED. The safe's red light\n          turns green. Immediately, the flamethrowers and blowguns\n          retract! The gas gets sucked into grates. The whole\n          room goes SILENT. Whew.\n          \n          Bill looks around. He nervously steps forward - he waves\n          his hand over the floor, and jumps back. Nothing happens.\n          \n          Bill signals for Mrs. Chun to go first. She gestures\n          back: you go. It's a stand-off. Finally, Bill takes a\n          breath -- and walks across the room. The Booby Traps are\n          disarmed. Mrs. Chun follows, pulling Julie along.\n          \n                                 BILL\n                    Thank you, Shane. You were always my best\n                    man. I knew you'd figure it out.\n          \n          Shane scowls, disgusted.\n          \n                                 BILL (CONT'D)\n                    You know, if you're willing to join up,\n                    I'd be happy to cut you in on the\n                    proceeds. What do you say -- we make a\n                    good team?\n          \n                                 SHANE\n                    I was devoted to you, sir. And you\n                    betrayed all of that. All that we stand\n                    for.\n          \n                             \n          \n          \n                                                                  99.\n          \n          \n          \n          Beat.   Bill shrugs.\n          \n                                  BILL\n                     I'll take that as a \"no.\"\n          \n          Bill turns to the safe. He starts to reach for the\n          dial... then catches himself. Something's not right.\n          \n                                  BILL (CONT'D)\n                     ... I think you better open it.\n          \n          Shane reaches for the safe, before he reaches the dial --\n          \n                                  BILL (CONT'D)\n                     Wait. That's just what you want isn't it?\n          \n          Bill thinks, trying to read Shane's poker face. Shane\n          shrugs. Bill gestures to Mrs. Chun.\n          \n                                    BILL (CONT'D)\n                     You open it.\n          \n          Mrs. Chun doesn't budge.\n          \n                                  BILL (CONT'D)\n                     Oh come on. I walked the floor first.\n          \n          Reluctantly - Mrs. Chun reaches out, and touches the\n          dial. Nothing happens. Relief. She turns it, and ZAPPPPP!\n          1000 volts ELECTROCUTES her, her hair on end, shaking\n          from the voltage...\n          \n          Bill is off guard, Shane kicks his gun away! The gun\n          skids into the acid and plunges, SIZZLING. Bill is\n          incensed, but Shane gazes coldly.\n          \n                                  SHANE\n                     There will be no mercy.\n          \n                                  BILL\n                     None requested.\n          \n          Full of himself, Bill LUNGES. And he's strong!     He\n          shoves Shane back, then PUNCHES him in the gut.\n          \n          Shane glares, then returns an onslaught of BLOWS.\n          Shane's fury is unleashed: A volley of attacks, hitting\n          Bill's arms, head, legs! He's crazed, unrelenting.\n          \n          But suddenly Mrs. Chun LEAPS onto his back.\n          \n                                    MRS. CHUN\n                     AAAAAA!\n          \n                                                                  100.\n          \n          \n          \n          She SCREAMS and grabs his throat. Shane struggles to\n          lose her. Suddenly, he drops and FLIPS her. She\n          catapults, stumbles backwards across the room, and stops\n          just inches from the acid! She teeters, tottering,\n          unable to gain her balance.\n          \n          Shane shakes his head, then runs to grab her outstretched\n          hand. She smiles, saved. But he's unforgiving.\n          \n                                 SHANE\n                    You're a... terrible neighbor.\n          \n          Shane COLD-COCKS her, knocking her out. Suddenly --\n          \n                                  JULIE\n                    Shane!   Watch out!\n          \n          Bill is charging him.   Shane whirls, delivering a\n          ROUNDHOUSE KICK. OOF!   Bill gets slammed in the chest.\n          \n          Bill tumbles, the wind knocked out of him. He jumps to\n          his feet, delivering a series of hard punches, which\n          Shane deflects -- they tangle like pro's. It's clear the\n          both have the same training. They punch, spin, kick,\n          connecting only occasionally. Bill wheels around and\n          lands a kicks squarely in Shane's chest. Shane tumbles,\n          landing on his back in front of the safe.\n          \n          ANGLE - BILL\n          \n          He steps over Shane. Leering mercilessly, he jabs the\n          spike against Shane's throat.\n          \n                                 BILL\n                    Any last words?\n          \n          Julie gasps. Shane narrows his eyes, then whispers/sings.\n          \n                                 SHANE\n                    ... Say, good night, Peter Panda!\n          \n          The CODE! A BELL rings, and the safe door flies open!\n          SLAMMING Bill in the head! BONG! Bill's collapses and\n          drops. K.O.!\n          \n          EXT. PLUMMER'S STREET - SAME TIME\n          \n          The minivan races toward the house.   The Police Cars\n          chase after, SIRENS wailing.\n          \n          IN THE VAN, everyone is SCREAMING.\n          \n                              \n                                                                   101.\n          \n          \n          \n                                 TODD\n                    Zoe! You're going too fast!! You're not\n                    gonna have enough time to stop-\n          \n                                 ZOE\n                    Hey, I'M the one in Driver's Ed!    I think\n                    I know what I'm doing!!\n          \n          WIDE\n          \n          She squeals into the driveway, then BRAKES.\n          \n          But it's too late. The van SKIDS, smoke BURNING from the\n          tires -- and hits a tree. The Kid spill out and run.\n          \n          The lead Police Car screeches to a stop.   POLICE leap\n          from the car.\n          \n          INT. SECRET VAULT - SAME TIME\n          \n          Shane and Julie stare at each other, then look in the\n          safe:\n          \n          Inside, the cavernous metal box holds but one object: A\n          tiny COMPUTER CHIP. Shane gently removes it.\n          \n                                   SHANE\n                    ... GHOST.\n          \n          They look in silence. She smiles at Shane, grateful.\n          \n                                 JULIE\n                    Thank you Shane. It's finally over. Now\n                    we can go back to our peaceful...\n          \n          Then -- a sudden AMPLIFIED VOICE from behind them:\n          \n                                  ULLHORN (V.O.)\n                    FREEZE! HOLD IT RIGHT THERE!\n          \n          EXT. HOUSE - SAME TIME\n          \n          Total commotion. The kids clamber from the van, with\n          their hands raised. Cops surround them. Even Peter and\n          Tyler have their little hands over their heads.   The\n          garage door raises, Shane steps out.\n          \n                                   SHANE\n                    Whoa, WHOA!    What are you doing to these\n                    kids??\n          \n                                 CUTE COP\n                    FREEZE. HANDS WHERE I CAN SEE THEM.\n          \n                                                                102.\n          \n          \n          \n          Cops cover Shane and Julie, Julie and Shane Freeze.\n          \n                                 ZOE\n                    But, officer...\n          \n                                 CUTE COP\n                    I said FREEZE. Zoe, you're in a lot of\n                    trouble... Reckless endangerment!\n                    Driving without a license. Numerous,\n                    uh... trafficS violations --\n          \n                                 SHANE\n                           (cutting him off)\n                    These kids are heroes. They just aided\n                    in exposing a high-level espionage ring.\n                    I suggest you call the FBI. Now.\n          \n          Silence. The Cops are unsure what to do. He scoffs.\n          \n                                 CUTE COP\n                    You expect me to believe any of that?\n          \n          Suddenly -- a CRAZED SCREAM.\n          \n                                  MR. CHUN (O.S.)\n                    EVERYBODY!   HIT THE GROUND!!!\n          \n          WIDE\n          \n          Everyone spins. Mr. Chun stands inside the gate,\n          pointing a ROCKET LAUNCHER. He's disheveled and manic.\n          \n                                 MR. CHUN (CONT'D)\n                    I WANT THE GHOST, TEN MILLION DOLLARS,\n                    AND A DIRECT FLIGHT TO PYONGYANG!\n          \n          The cops freeze, helpless. Shane weighs his not so many\n          options... Nobody is sure what to do.\n          \n          But then -- a WOMAN suddenly flips over the fence, vaults\n          onto Chun, and KNOCKS him out with a Karate Chop.\n          \n                                 PRINCIPAL CLAIRE\n                    Ya!!\n          \n          Claire lands on her feet, triumphant. Even Chun is\n          amazed, as he turns his head, Shane spins, and grabs the\n          rocket launcher.\n          \n          CLOSE-UP - SHANE\n          \n          He breaks into a big grin.\n          \n                                                                  103.\n          \n          \n          \n          CLOSE-UP - CLAIRE\n          \n          She proudly smiles back at him.\n          \n          ANGLE - THE CUTE COP\n          \n          He's flummoxed. This chaos is unsolvable.    Beaten, he\n          reaches for his radio.\n          \n                                 COP\n                    I think I'll call the FBI.\n          \n                                                        DISSOLVE TO:\n          \n          EXT. PLUMMER HOUSE - LATER\n          \n          F.B.I. AGENTS swarm the area. Bill and the Chuns are\n          being hauled away in cuffs. Julie huddles with the kids.\n          Shane talks with an F.B.I. Agent.\n                                 F\n                                  .B.I. AGENT\n                    Mr. Wolfe... that was nice work.   You're\n                    a one-man battalion.\n          \n                                 SHANE\n                    Just doing my job.\n          \n                                 F.B.I. AGENT\n                    The Bureau is always looking for good\n                    men. Do you have a card or something?\n          \n          The Agent hands him a BUSINESS CARD, then walks off.\n          Shane examines it, swelling with pride.\n          \n          INT. GARAGE - CONTINUOUS\n          \n          The Kids are looking around, watching the FBI Agents\n          work. Lulu is following one of the FBI Agents around.\n          \n                                 LULU\n                    Do you have to wear that thing in your\n                    ear all the time?\n          \n                                 FBI AGENT\n                    Yes.\n          \n                                 LULU\n                    Does it itch?\n          \n                                 FBI AGENT\n                    Yes...\n          \n                                                                  104.\n          \n          \n          \n          Zoe is looking at the safe. She sees, fallen onto the\n          floor, from the safe, a letter. Her siblings, and Julie\n          notice, and gather around. Zoe reads the LETTER:\n          \n                                 ZOE\n                    If you're reading this, then Julie found\n                    the key. Julie, Tyler, Peter, Zoe, Todd,\n                    Lulu -- I want to say: I love you more\n                    than anything. I always have.\n          \n          A tear comes to her eye. The Plummers hug each other.\n          \n          EXT. THE PLUMMER HOUSE - CONTINUOUS\n          \n          Claire walks up to Shane. Mock-angry.\n          \n                                 PRINCIPAL CLAIRE\n                    So. What happens now? You'll be stationed\n                    somewhere else, right? I guess there's no\n                    more reason for you to stick around here.\n          \n          Shane looks at her. He looks around: at the family. He\n          looks at Claire....\n          \n                                 SHANE\n                    Well. I'm kinda, re-conning the\n                    situation, here... And to tell the truth.\n                    I don't see anything but reasons to stay.\n                                 P\n                                  RINCIPAL CLAIRE\n                    So... What's the next move?\n          \n          Shane smiles slyly and pulls her close.\n          \n                                 SHANE\n                    ... I don't know. I'm on dry land. You're\n                    the superior office. You tell me.\n          \n                                 PRINCIPAL CLAIRE\n                    Well. Summer's almost here. What if you\n                    and me did a little amphibious recon\n                    mission. On, say -- Maui?\n          \n                                   SHANE\n                    Sir yes sir.\n          \n          Claire beams. The Plummers all approach, interrupting.\n          Zoe gives them a look -- that makes Shane and Claire\n          BLUSH. Lulu turns to Shane, sad.\n          \n                                 LULU\n                    This is it. Your work here is through.\n                    Guess you have to go now...\n          \n                                                                  105.\n          \n          \n          \n          She puts out her hand, to shake his.\n          \n                                 SHANE\n                    Ah, come here you.\n          \n          He surprises her with a BEAR HUG -- he hugs the whole\n          family at once, squeezing them off the ground. He puts\n          them down. Before he goes: he reaches down and gives Zoe -\n          - his medal. He squeezes her hand around it.\n          \n                                   ZOE\n                    But...\n          \n                                 SHANE\n                    He would've wanted me to give it to\n                    someone I care about. Like he did. Thank\n                    you. For everything.\n                                 P\n                                  ETER\n                    Love you, Shane.\n          \n          TIGHT - SHANE\n          \n          This is too much.    He wipes his face.\n          \n                                 SHANE\n                    Your dad would be so proud.\n          \n          Shane bawls -- he can't keep it in. He starts to head\n          off, Lulu calls after him:\n          \n                                 LULU\n                    Shane, we're never gonna see you again!\n          \n                                 SHANE\n                    What are you talking about?      I'm gonna\n                    see you Friday night.\n          \n          A long beat.    Julie looks up, baffled.\n          \n                                 JULIE\n                    What's Friday night?\n          \n          INT. VICTORIA THEATRE, BACKSTAGE - NIGHT\n          \n          Close on Shane:\n          \n                                 SHANE\n                    Tonight is the night we trained for, and\n                    failure is not an option! No detail is\n                    too small! We are the BEST! Remember\n                    your lines, hit your marks, and stay in\n                    character! I expect perfection!\n                                 (MORE)\n          \n          \n                                                                 106.\n                                  SHANE(CONT'D)\n                           (he grins)\n                    Now let's break a leg.\n          \n          Wider reveals the Cast of `The Sound of Music'.\n          \n                                                              CUT TO:\n          \n          Shane's military-march version of the musical. Nuns sing\n          \"How Do You Solve a Problem Like Maria?\" The Von Trapp\n          kids perform \"So Long, Farewell.\"\n          \n          In the audience, Julie watches in astonishment. She is\n          surrounded by her children. Scott: in a suit, his hair\n          combed, Claire: dressed to the nines, the little Brownie\n          Troop, even Murney. Lulu has a basket in her lap --\n          inside: GARY THE DUCK and his new family, the most\n          adorable ducklings you ever saw.\n          \n          They all watch, rapt.\n          \n          You Are Sixteen begins. Shane watches with bated breath.\n          Todd spins. In SLOW MOTION, he leaps into the SPIN KICK.\n          It's fantastic -- a Michael Jordan dunk. The AUDIENCE\n          goes nuts, Shane stands, and shouts:\n          \n                                 SHANE (CONT'D)\n                    YESSS! (And an Armed forces:) Huu-ah!\n          \n          The Audience stares at him, until he sits back down,\n          beaming with pride.\n          \n          Finally: \"CLIMB EVERY MOUNTAIN.\" Hearts swell, as the\n          family crosses the papier-mâché alps.\n          \n          A STANDING OVATION. The performers take their curtain\n          calls, then giddily gesture Shane to come out. He humbly\n          steps into view -- and the house goes crazy. Thundering\n          applause. A cellophane bouquet of flowers gets thrust on\n          him. Shane smiles, touched. Mission accomplished.\n          \n                                                            FADE OUT.\n          \n                                  THE END\n          \n \n\n\n\n\n\nPacifier, The\nWriters :   Thomas Lennon  Robert Ben Garant  Jason Fulardi\nGenres :   Comedy  Action  Family  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:39.530742"}