{"title": "Passion of Joan of Arc, The", "film_link": "/Movie Scripts/Passion of Joan of Arc, The Script.html", "script_link": "/scripts/Passion-of-Joan-of-Arc,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Passion of Joan of Arc, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Passion-of-Joan-of-Arc,-The.jpg\" title=\"Passion of Joan of Arc, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Joseph Delteil\" title=\"Scripts by Joseph Delteil\">Joseph Delteil</a><br/>  <a href=\"/writer.php?w=Carl Theodor Dreyer\" title=\"Scripts by Carl Theodor Dreyer\">Carl Theodor Dreyer</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Movie Release Date</b> : March 1929<br/>\n<br/>\n<a href=\"/scripts/Passion-of-Joan-of-Arc,-The.html\">Read \"Passion of Joan of Arc, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n\r\n\r\n<b>                     THE PASSION OF JOAN OF ARC\r\n</b>\r\n\r\n\r\n                            Written by\r\n\r\n                Carl Theodor Dreyer &amp; Joseph Delteil\r\n\r\n\r\n\r\n\r\n                           Translated by\r\n\r\n                        Oliver Stallybrass\r\n\r\n\r\n\r\n\r\n\r\n\r\n                 At the Bibliothèque Nationale in\r\n                 Paris it is possible to see one of\r\n                 the most famous documents in the\r\n                 history of the world - the official\r\n                 record of the trial of Joan of Arc.\r\n\r\n    The Bibliothèque Nationale's original record of the trial of\r\n    Joan of Arc is shown on the screen. An invisible hand turns\r\n    over the manuscript pages.\r\n\r\n                 ... If you turn over the pages,\r\n                 yellow with age, which contain the\r\n                 account of her martyrdom ...\r\n\r\n    Page after page is shown of this unique document with its\r\n    lines as straight as arrows, its marginal annotations, and\r\n    the naïve miniature drawings for which the notaries have\r\n    found time and space.\r\n\r\n                 ... you will find Joan herself ...\r\n                 not the military genius who\r\n                 inflicted on the enemy defeat after\r\n                 defeat, but a simple and natural\r\n                 young girl ... who died for her\r\n                 country.\r\n\r\n    The last pages are turned. Then the picture disappears and\r\n    gives way to the first scene of the film, which shows\r\n\r\n1   The prison, where Joan is sitting, praying. The flagstones,\r\n    the floor in Joan's cell. We see two straws and a hand,\r\n    Joan's hand, which lays the straws on the floor in the form\r\n    of a cross.\r\n\r\n2   Scenes from the church are shown: the chalice is brought out.\r\n\r\n3   In the prison we see Joan kneeling before   her straw cross -\r\n    this most fragile and exalted of crosses.   She prays in\r\n    ecstatic joy, at one moment bending right   forward so that her\r\n    forehead touches the flagstones, the next   moment kneeling\r\n    with her hands folded and her eyes raised   to heaven as if she\r\n    saw beings visible only to her. From time   to time she mutters\r\n    a short prayer.\r\n\r\n<b>4   THE CHURCH\r\n</b>\r\n    A young monk makes his way through rows of kneeling priests.\r\n    He is the Usher Massieu, who is on his way to summon Joan and\r\n    conduct her to her first examination.\r\n\r\n<b>5   THE PRISON\r\n</b>\r\n    Joan in front of her little cross. Suddenly the two straws\r\n    spin round in a mysterious gust of wind. What is it?\r\n<b>                                                             2.\r\n</b>\r\n\r\n    Joan sits for a moment, overcome with astonishment, then puts\r\n    the straws back in the form of a cross. Again a hostile power\r\n    attacks this cross and scatters it over the flagstones. Joan\r\n    doesn't know what to believe. Can it be one of her voices? A\r\n    divine intervention? Once again she replaces the cross. Then\r\n    there is a roar of laughter from the door behind her. Joan\r\n    turns and sees three soldiers, who have been standing in the\r\n    half-open door, blowing at her straw cross through a long\r\n    tube.\r\n\r\n    Enter the soldiers. They are tormentors and bullies of the\r\n    worst kind. They continue to jeer at her.\r\n\r\n6   Now the jailer appears, an elderly man, followed by a\r\n    blacksmith. Joan turns in terror and looks up at them. When\r\n    she sees the chains in the blacksmith's hands, her eyes fill\r\n    with tears, and she shrinks back a step. The jailer seizes\r\n    her by the foot, and the blacksmith puts the ankle-chains on\r\n    her.\r\n\r\n7   While he is thus occupied, Massieu enters. He is an engaging\r\n    young man of twenty-five, healthy, vivacious and open; he\r\n    radiates youth, health and life. He remains standing by the\r\n    door until the others have left the cell. The jailer, who\r\n    goes out last, certifies that the prisoner is the Maid. The\r\n    door closes behind the jailer. And now that Massieu is alone\r\n    with this woman, whom he has heard described as a dangerous\r\n    witch and an object of fear - he is afraid. He prays\r\n    inaudibly and crosses himself. He has brought with him a\r\n    small stoup and aspergillum, and as he stands by the door he\r\n    sprinkles Joan eagerly with holy water. Joan, who has dragged\r\n    herself over to the boards which serve as her bed, looks at\r\n    him in gay surprise, and with a slight smile says:\r\n\r\n                 Come a little nearer, I shan't fly\r\n                 away!\r\n\r\n    Massieu, astonished, approaches her, asks if she is Joan, the\r\n    Maid, and when she confirms this begins to read the summons:\r\n\r\n                 ... that you summon the aforesaid\r\n                 Joan, commonly called the Maid, to\r\n                 appear before us ...\r\n\r\n    Joan declares herself ready to follow him. Massieu calls for\r\n    the jailer. They lead Joan out.*\r\n\r\n<b>8   THE CHAPEL\r\n</b>\r\n    Bishop Cauchon takes the chair for the trial. To either side\r\n    of him sit the Inquisitor, Lemaître, and Jean d'Estivet, who\r\n    is to present the case against Joan.\r\n<b>                                                              3.\r\n</b>\r\n\r\n     These three men are surrounded by the other forty-one\r\n     clerics, all men of learning, thoroughly versed in the art of\r\n     dragging confessions out of accused persons.\r\n\r\n     A special table is reserved for the notaries.\r\n\r\n     Cauchon gives orders for the accused to be brought in.\r\n\r\n9    Every face turns towards the entrance. They all see Joan for\r\n     the first time. It is so quiet in the chapel that you can\r\n     hear the grating noise of the chains round Joan's ankles.\r\n\r\n10   Joan comes forward. Through the pointed, colored windows the\r\n     sunlight falls obliquely into the room in long shafts.\r\n     Suddenly Joan finds herself in the middle of one of these\r\n     shafts and stops for a moment. She becomes aware that every\r\n     eye is turned towards her; she sees that they are hard, cold\r\n     and uncomprehending. For a few seconds it seems as if she is\r\n     going to collapse, overcome by the cold, remorseless\r\n     atmosphere. On one side a completely human, simple, young\r\n     country girl; on the other the flower of this century's\r\n     talents, learned doctors, the fine fruits of the university,\r\n     every prodigy in Christendom ... the instruments of reason -\r\n     and of death. The personification on one side of innocence,\r\n     on the other of magnificence. The terrible, relentless way in\r\n     which they look at this girl in man's clothes, all these\r\n     bishops, all these ascetics and members of orders with their\r\n     newly cropped tonsures! These learned gentlemen regard her\r\n     man's shoes and short hair as something loathsome and\r\n     indecent. They believe as one man that it will be all easy\r\n     matter to get the upper hand over this child.\r\n\r\n11   With a harsh movement Cauchon orders Joan over to the seat\r\n     for the accused.\r\n\r\n12   She remains standing for a moment, drooping under the heavy\r\n     burden of her chains. Then she sits down. Her face is pale\r\n     and marked with grief and suffering. She lets her eyes wander\r\n     over these rows of men in clerical garb - alone and unaided\r\n     she must battle with them to save her name and her life. She\r\n     leans towards Massieu and says a few quiet words to him as if\r\n     to remind him of some promise. Massieu says to Cauchon:\r\n\r\n               The accused begs humbly for leave\r\n               to go to confession ...\r\n\r\n     The bishop, who is engaged in thumbing through some documents\r\n     which one of the prelates, Loiseleur, has just brought him,\r\n     discusses the request briefly with the Inquisitor, and\r\n     replies that he is obliged to deny her this favor because of\r\n     her indecent dress.\r\n<b>                                                              4.\r\n</b>\r\n\r\n13   Then he opens the session and orders Joan to take the oath.\r\n     With a gesture he indicates that the Bible is to be fetched\r\n     and placed in front of Joan. She kneels, folds her hands over\r\n     the book and recites the oath:\r\n\r\n               I swear by the Holy Gospels to\r\n               speak the truth, the whole truth\r\n               and nothing but the truth,\r\n               concerning the mission which has\r\n               been entrusted to me by the King of\r\n               Heaven.\r\n\r\n14   There is a hush in the room. At this moment, when everything\r\n     is quiet, a small door opens, giving direct access to the\r\n     castle from the chapel. It is Warwick, the English governor\r\n     and general, who enters. The respect shown to the new arrival\r\n     by some of the soldiers in his vicinity suggests that he is a\r\n     person of some importance. As the Commander-in-Chief of the\r\n     English army of occupation he is the real, though\r\n     unrecognized, driving force behind the trial. He has come for\r\n     the purpose of speeding things up, but he keeps in the\r\n     background - like an accomplished butler who supervises from\r\n     a distance and sees that everything is proceeding smoothly.\r\n     For the moment he remains standing just inside the door;\r\n     presently he comes further forward and is hidden by columns.\r\n     At one point we see him in conversation with Loiseleur.\r\n\r\n15   Joan has sat down again, and the hearing begins. Cauchon asks\r\n     Joan her name. She answers:\r\n\r\n               At home I am called Jeannette ...\r\n               Here they call me Joan!\r\n\r\n16   Cauchon asks her age. Joan thinks and counts on her fingers:\r\n\r\n               Nineteen ... I think.\r\n\r\n17   Cauchon, after smiling to his neighbor, asks:\r\n\r\n               Can you say Our Father?\r\n\r\n     Joan nods. Scenes from her childhood come rushing into her\r\n     memory. Her eyes are moist with tears, and when Cauchon asks:\r\n\r\n               Who taught it to you?\r\n\r\n     Joan can hardly produce a word, for her sobs are lying like a\r\n     knot in her throat. She answers so softly that hardly anybody\r\n     can hear:\r\n\r\n               My Mother ...\r\n\r\n18   The Promoter, Jean d'Estivet, whispers to Cauchon:\r\n<b>                                                              5.\r\n</b>\r\n\r\n               Tell her to say the Our Father! If\r\n               she refuses, it will be evidence of\r\n               her being possessed by the Devil.\r\n\r\n     Cauchon nods and tells Joan to say the Our Father. She\r\n     refuses. Jean d'Estivet and Cauchon exchange glances. Cauchon\r\n     tells her urgently to do his bidding, but Joan refuses again,\r\n     for she is afraid that memories of her mother and her home in\r\n     Domrémy are going to overwhelm her.\r\n\r\n     Cauchon puts further pressure on her: she is to repeat the\r\n     Our Father immediately and unconditionally. She declines to\r\n     do so.\r\n\r\n19   Cauchon rebukes her for this stubbornness and lets the\r\n     examining judge take over the interrogation. The latter makes\r\n     an inclination of the head and asks:\r\n\r\n               You say that you are sent by God?\r\n\r\n     Joan confirms this with a nod and adds:\r\n\r\n               To save France!\r\n\r\n     The judges burst out laughing. Joan's eyes are raised to\r\n     heaven, as if it was heaven that gave her courage and found\r\n     the right words for her. Her expression, which is filled with\r\n     the glory of a heavenly vision, is almost unearthly as she\r\n     answers:\r\n\r\n               That is why I was born!\r\n\r\n     More contemptuous laughter from the judges. The examining\r\n     judge confers with the other judges. Their expressions show\r\n     that they are setting a new trap for Joan.\r\n\r\n20   Finally he says:\r\n\r\n               So you believe that God hates the\r\n               English?\r\n\r\n     Joan does not immediately understand the question, and the\r\n     examining judge has to repeat it. Then Joan gives one of her\r\n     brilliant, inspired answers:\r\n\r\n               I know not whether God loves or\r\n               hates the English ...\r\n\r\n21   Disappointment on the judges' faces. Joan continues, with a\r\n     strength which suddenly reveals a new side of her character,\r\n     and turning towards the English soldiers:\r\n<b>                                                              6.\r\n</b>\r\n\r\n               But I know for certain that the\r\n               English will all be driven out of\r\n               France ...\r\n\r\n     Commotion and protests among the soldiers: why should Joan be\r\n     allowed to insult England? But Joan continues inflexibly:\r\n\r\n               ... except for those who are going\r\n               to die here!\r\n\r\n     The soldiers are furious. They can no longer contain\r\n     themselves. One of them makes a movement towards the accused.\r\n     Massieu leaps to her defense. But Cauchon intervenes and\r\n     orders silence; he has to use all his authority to restore\r\n     order among the judges. The hearing continues.\r\n\r\n22   Cauchon asks:\r\n\r\n               You have told how Saint Michael\r\n               appeared to you ... how did you\r\n               greet him?\r\n\r\n     Joan explains that she has always greeted Saint Michael in\r\n     the way one should greet a saint. One of the judges tells her\r\n     to show how she greeted Saint Michael.\r\n\r\n23   With touching simplicity Joan kneels, goes through the motion\r\n     of taking off her cap, and bows reverently before the\r\n     imagined saint. She gets up again, while the judges talk\r\n     together.\r\n\r\n24   Cauchon continues:\r\n\r\n               In what form did he reveal himself?\r\n\r\n     Joan does not immediately grasp the question. Half the judges\r\n     shout to one another.\r\n\r\n     Hundreds of questions fly across the room: Did he have wings?\r\n     Was his head like an ordinary man's? Was he wearing a crown?\r\n     Under this deluge of questions Joan makes a movement as if to\r\n     say that she cannot answer them all at once.\r\n\r\n25   Finally, when quiet is more or less restored, Cauchon\r\n     formulates his question more carefully:\r\n\r\n               What was Saint Michael wearing?\r\n\r\n     But Joan does not answer.\r\n\r\n26   An elderly canon is seen to rise, go over to the bishop and\r\n     whisper something in his ear. There is a suggestion of\r\n     pruriency about this man. The bishop nods and turns to Joan:\r\n<b>                                                                 7.\r\n</b>\r\n\r\n               How can you know whether the person\r\n               you saw was a man or a woman?\r\n\r\n     Joan is silent. She realizes that another trap is being laid\r\n     for her.\r\n\r\n27   Cauchon is reluctant to give up the ground he has won. He\r\n     asks a new question:\r\n\r\n               Was he naked?\r\n\r\n     Every ear strains to hear the reply, for now Joan has to\r\n     answer. And again she produces one of her brilliant, careful\r\n     answers:\r\n\r\n               Do you not believe that God would\r\n               have clothes for him?\r\n\r\n28   Cauchon realizes that his stratagem has failed, but\r\n     nevertheless he pursues the matter further:\r\n\r\n               Did he have any hair on his head?\r\n\r\n     But Joan, who now feels that she is on firm ground, smiles\r\n     and answers with artless inspiration:\r\n\r\n               Why should he have had it cut off?\r\n\r\n29   Cauchon sees that he will get nowhere with Joan by this\r\n     method. He confers with those sitting nearest him and then\r\n     gives way to the examining judge, who begins to question Joan\r\n     about her dress:\r\n\r\n               Why are you wearing men's clothes?\r\n\r\n     Joan refuses several times to answer and remains sitting\r\n     motionless, stiff as a ramrod. The judge says:\r\n\r\n               Are you willing to wear a woman's\r\n               dress?\r\n\r\n30   Massieu leans towards her and advises her to accept this\r\n     suggestion, which he thinks must be very easy for her to do.\r\n     But Joan looks at him with the air of one treasuring a great\r\n     secret, and says no to the judge. When the judge presses her\r\n     to tell him why she refuses, she answers:\r\n\r\n               When I have completed the task\r\n               which God has entrusted to me, then\r\n               I will wear women's clothes again.\r\n\r\n     Whispering among the judges -\r\n<b>                                                                 8.\r\n</b>\r\n\r\n31   An indication that another trap is being prepared. Then one\r\n     of the judges says:\r\n\r\n               So it is God who has commanded you\r\n               to go about in men's clothes?\r\n\r\n     Joan answers unhesitatingly:\r\n\r\n               Yes!\r\n\r\n     A smile of triumph spreads from face to face among Joan's\r\n     judges.\r\n\r\n32   The Promoter, Jean d'Estivet, complacently makes some notes.\r\n     Then he leans forward over his desk, smiles and asks in an\r\n     insincere tone of voice:\r\n\r\n               And what reward do you hope to\r\n               obtain from the Lord?\r\n\r\n33   Joan, whose expression is that of a saint, folds her hands on\r\n     her breast and raises her eyes to heaven:\r\n\r\n               The salvation of my soul!\r\n\r\n     She remains sitting in the same position; her look conveys\r\n     the impression that she can see into the furthest corner of\r\n     heaven.\r\n\r\n34   But Jean d'Estivet is incapable of controlling himself. He\r\n     gets up, goes right up to her, spits in her face and hisses:\r\n\r\n               Do you not understand that what you\r\n               are saying is blasphemy?\r\n\r\n     Then he goes back to his place. But on Joan's face there\r\n     lingers the expression of one who is far removed from this\r\n     world. From time to time throughout this episode two of the\r\n     judges, Nicolas de Houppeville and Martin Ladvenu, have been\r\n     seen to show signs of sympathy for the accused.\r\n\r\n35   After this last outrage on the part of the Promoter, de\r\n     Houppeville can control himself no longer. Provoked to the\r\n     limit, he rises and shouts:\r\n\r\n               This is unworthy ...\r\n\r\n     The whole room turns to him in amazement. He continues\r\n     fearlessly:\r\n\r\n               ... it is persecution!\r\n<b>                                                               9.\r\n</b>\r\n\r\n36   He leaves his place; Ladvenu tries to restrain him, but he\r\n     approaches the bishop and says to him:\r\n\r\n               We are treating this woman like an\r\n               enemy - not like a human being on\r\n               trial!\r\n\r\n37   Then he casts a look full of tenderness at Joan, who at this\r\n     moment is drying her cheeks, still wet from Jean d'Estivet's\r\n     spittle. Houppeville continues:\r\n\r\n               For me she is a saint!\r\n\r\n     He goes over to her, genuflects before her, and turns to go\r\n     out through the door.\r\n\r\n38   Warwick has followed these proceedings with an attentive eye.\r\n     He whispers a few words to an officer, who follows\r\n     Houppeville the length of the chapel.\r\n\r\n39   When he reaches the porch the officer takes two soldiers with\r\n     him and follows on Houppeville's heels.\r\n\r\n     Each of the judges in the room understands the fate in store\r\n     for Houppeville, and is seized with fear. An icy, unquiet\r\n     silence prevails.\r\n\r\n40   Paul Jorge [the name of one of the actors] prepares to rise\r\n     and ask the meaning of this incident.\r\n\r\n41   Cauchon stops him with a movement, and gives the order for\r\n     the session to continue. He asks Joan:\r\n\r\n               Has God promised you anything?\r\n\r\n     Joan gives an absent-minded nod. Cauchon presses her to tell\r\n     him what it is that God has promised.\r\n\r\n               Can you not tell us what it is that\r\n               God has promised you?\r\n\r\n     Cauchon asks with his most ingratiating smile, but Joan\r\n     shakes her head. Cauchon tries to persuade her:\r\n\r\n               You must tell us.\r\n\r\n     But Joan declines to answer:\r\n\r\n               That has nothing to do with your\r\n               trial!**\r\n\r\n42   Cauchon maintains the contrary, and Joan tells him to ask the\r\n     assembly. Cauchon turns to the judges and asks:\r\n<b>                                                             10.\r\n</b>\r\n\r\n               Has this question any bearing on\r\n               the trial?\r\n\r\n     He orders those who consider that it has to raise their\r\n     hands. Nearly every hand goes up. Then it is the turn of\r\n     those who take the opposite view. Ladvenu is the only one to\r\n     raise his hand, but when he sees that he is entirely alone he\r\n     takes it down again.\r\n\r\n43   And Cauchon is able to say to Joan that, since the relevance\r\n     of the question to the trial has been unanimously agreed, she\r\n     is obliged to answer. He repeats his question:\r\n\r\n               What has God promised you?\r\n\r\n     Joan does not answer.\r\n\r\n44   Cauchon continues:\r\n\r\n               Has God promised you that you will\r\n               be released from your prison?\r\n\r\n     Joan confirms this with a nod. Dalleu speaks in a low voice\r\n     to Cauchon, who asks:\r\n\r\n               When?\r\n\r\n     After sitting for a while, lost in thought, Joan answers:\r\n\r\n               I do not know the day or the hour!\r\n\r\n     A further exchange of words between Cauchon and d'Estivet\r\n     then Cauchon makes a sign for Massieu to take the accused\r\n     back to prison. Joan rises to go.\r\n\r\n45   She takes a few steps, turns and asks:\r\n\r\n               May I not be relieved from carrying\r\n               these chains?\r\n\r\n     Cauchon can see no reason for complying with her request. But\r\n     he sees the opportunity of imposing a condition which he\r\n     knows will be unacceptable to Joan:\r\n\r\n               Will you take an oath never to bear\r\n               arms against England again?\r\n\r\n46   Joan answers unhesitatingly:\r\n\r\n               No!\r\n\r\n     Then she is led away. Her chains clank as they drag over the\r\n     flagstones. The judges leave their places.\r\n<b>                                                             11.\r\n</b>\r\n\r\n47   They break up into groups, according to their friendships or\r\n     the order to which they belong. We see one group consisting\r\n     of Dominicans, another of canons, a third of mendicant\r\n     friars. The entire assembly talks and whispers. Monks'\r\n     cloaks, homespun tunics and cowls, caps and hats. Here a fat\r\n     old abbot, here a short, slim monk. Respectful inclinations\r\n     of the head, sanctimonious smiles, violent outbursts of\r\n     laughter. The witty ones recognizable by their thin lips and\r\n     legs. In the background beardless students, solemn as popes,\r\n     in earnest discussion.\r\n\r\n     But round the judges' table a discussion is going on between\r\n     Cauchon, Lemaître, Jean d'Estivet, the learned Thomas de\r\n     Courcelles, Loiseleur, Beaupère, Pierre Maurice and Warwick.\r\n     Warwick stays in the background, as if wishing to underline\r\n     that he has no part in the conspiracy against Joan; but it is\r\n     clearly understood that he has the last word in the matter.\r\n     They are considering what procedure to adopt. The point is to\r\n     lose as little time as possible in getting Joan to compromise\r\n     herself. Loiseleur propounds a scheme which receives general\r\n     approval. Warwick is asked a question, which he answers in\r\n     the affirmative. An order is given to a secretary, who at\r\n     once leaves the chapel.\r\n\r\n<b>48   THE PRISON\r\n</b>\r\n     Massieu has brought Joan back. The door closes behind her.\r\n     Overcome by fatigue, she sits on her bed. In front of the\r\n     judges she has restrained her weeping. Now that she is alone,\r\n     the pent-up tears pour from her eyes.\r\n\r\n<b>49   THE CHAPEL\r\n</b>\r\n     The conference is still going on. Loiseleur is dictating to\r\n     the notaries. At intervals one of the other judges interposes\r\n     a word or a suggestion.\r\n\r\n<b>50   THE PRISON\r\n</b>\r\n     Joan is still shaking with sobs. Suddenly she sees a cross\r\n     slowly forming on the floor close to her feet. It is the\r\n     shadow of the window grating. She knows this cross and loves\r\n     it. It always comes when she is feeling lonely and unhappy.\r\n     She has no doubt that it is God who sends her solace and\r\n     encouragement in this way. She dries her eyes and produces\r\n     from a hiding-place a piece of handiwork, with which she\r\n     occupies her hands and her thoughts when she is not before\r\n     the judges. It is a crown of plaited straw - very simple,\r\n     pretty and childlike. Soon she is completely absorbed in this\r\n     work, to which she devotes all her love. We see the Joan from\r\n     Domrémy who 'is second to no woman in Rouen, when it comes to\r\n     spinning or sewing.' From time to time she looks at the cross\r\n     on the ground.\r\n<b>                                                             12.\r\n</b>\r\n\r\n51   The conference in the chapel. Loiseleur finishes his\r\n     dictating. The notary reads back to him.\r\n\r\n<b>52   THE PRISON\r\n</b>\r\n     We see only Joan's hands which are occupied in plaiting her\r\n     crown. The shot is taken in such a way that the crown and the\r\n     cross on the ground can be seen together.\r\n\r\n53   The conference in the chapel. The notary finishes his reading\r\n     aloud and what he has read is approved. Meanwhile the\r\n     secretary has returned. He hands a document to Warwick, who\r\n     passes it round. It goes from hand to hand, and finally to\r\n     the notary.\r\n\r\n54   In the little ante-room leading to Joan's prison. The\r\n     soldiers are playing with a small English dog. An old serving\r\n     woman comes with food for Joan in an earthenware bowl. One of\r\n     the soldiers seizes the bowl; he selects the best piece of\r\n     meat and gives it to the dog. The latter swallows the meat\r\n     and licks the soldier's fingers. With the same fingers he\r\n     picks out another piece of meat and gives this also to the\r\n     dog.\r\n\r\n55   A short scene from the conference, featuring two documents. A\r\n     hand - that of the notary - is engaged in copying the\r\n     signature from one document to the other.\r\n\r\n<b>56   THE PRISON\r\n</b>\r\n     The soldier comes in with Joan's food, followed by the dog.\r\n     Two other soldiers appear in the door, for these rascals\r\n     never lose an opportunity of tormenting their victim. As the\r\n     soldier hands Joan the food, his eye falls on her ring. He\r\n     demands it from her, but she implores him to let her keep it:\r\n     it is her mother's ring. But the soldier is determined to\r\n     have it, even if he has to use force. He calls to the other\r\n     two soldiers to come and help him, and puts the bowl of food\r\n     on the ground in such a position that the dog naturally takes\r\n     advantage of it.\r\n\r\n57   Just as the first soldier has finally succeeded in forcing\r\n     the ring from Joan's finger Loiseleur appears in the open\r\n     door. He appears to be filled with genuine indignation at the\r\n     sight of the ill treatment to which the three rascals are\r\n     subjecting Joan. The soldiers have turned round. They are\r\n     afraid. Loiseleur threatens them and quickly goes up to the\r\n     soldier who has wrested Joan's ring from her. The soldier is\r\n     compelled to hand over the ring to Loiseleur, who thereupon\r\n     orders the three ruffians out of the cell.\r\n<b>                                                             13.\r\n</b>\r\n\r\n58   Loiseleur shuts the door. He is alone with Joan. He looks all\r\n     round him and goes over to Joan who regards him with deep\r\n     amazement which embraces gratitude as well; for after all it\r\n     is he who has just saved her from the soldiers' cruelties. He\r\n     remains standing a few paces from her, looks at her in a\r\n     serious and friendly way and says:\r\n\r\n               I have great sympathy for you!\r\n\r\n     A feeble smile appears at the corners of Joan's mouth, but\r\n     her expression of astonishment remains.\r\n\r\n59   Loiseleur has stopped by the cross; when he takes a pace\r\n     forward the cross disappears; but Joan fails to notice this,\r\n     absorbed as she is in wondering why this prelate has come to\r\n     visit her. Loiseleur, who has now come right up to Joan,\r\n     hands her the ring, which she receives gratefully. Then she\r\n     again fixes her look of enquiry on the prelate, whom she has\r\n     previously seen among her judges.\r\n\r\n60   Finally he says to her in a low whisper:\r\n\r\n               Would you recognize your King's\r\n               signature?\r\n\r\n     Joan nods, though without understanding the purpose of his\r\n     visit. From his cowl he produces a letter which he hands to\r\n     Joan. She takes it. She shows with a smile that she\r\n     recognizes Charles VII's signature. Then she returns the\r\n     letter and says:\r\n\r\n               I can't read!\r\n\r\n61   Loiseleur reads the letter aloud for her, as follows:\r\n\r\n               To our dearly beloved Joan.\r\n               Charles, the King, hereby informs\r\n               you that he is preparing to advance\r\n               on Rouen with a mighty army. He is\r\n               sending you a faithful priest, who\r\n               will stand by you. Have confidence\r\n               in him.\r\n\r\n     The reflection of an inner joy shines in her eyes. Her face\r\n     lights up during the reading and she smiles. Loiseleur does\r\n     not move from the spot. He stands watching her, motionless\r\n     and pale. He gazes at her with the eyes of a snake, while\r\n     Joan sits with an absent smile, completely absorbed in her\r\n     own joyful thoughts.\r\n<b>                                                             14.\r\n</b>\r\n\r\n62   Loiseleur suddenly raises his head and pricks up his ears.\r\n     Immediately behind the cell wall there is a secret room,\r\n     where a man can remain hidden, spying on the prisoner through\r\n     a judas, or chink in the wall. Alternating with the scenes\r\n     between Joan and Loiseleur are close-ups of Cauchon spying\r\n     and eavesdropping behind the chink.\r\n\r\n63   Loiseleur moves away from Joan and goes towards the hiding-\r\n     place; he is perfectly aware of its existence. When he\r\n     reaches the chink, he and Cauchon look at each other. First\r\n     Cauchon's serious eye is shown through the chink, then -\r\n     likewise through the chink - Loiseleur's small, cunning,\r\n     contracted eye. Loiseleur catches sight of the crown and\r\n     says:\r\n\r\n               Your martyr's crown.\r\n\r\n     Then he turns to Joan, who is still sitting with the King's\r\n     letter in her hands. He offers to hear her confession.\r\n\r\n64   She turns to him with a look of joy, hardly daring to believe\r\n     in this happiness. She drops a pretty curtsy, then kneels\r\n     with folded hands in a charming attitude suggestive of a\r\n     penitent child. He advises her strongly to speak to him with\r\n     an open heart. Here she is not before her judge, but before\r\n     her king. God can hear her!\r\n\r\n65   Joan confesses her sins like a schoolchild reciting a lesson.\r\n     Cauchon and his attendants follow the scene attentively from\r\n     the secret room. With a ledger on his lap the notary takes\r\n     down everything that Joan says, but it is clear that she is\r\n     saying nothing of any significance, for all the skill with\r\n     which Loiseleur presents his questions. So it is not long\r\n     before Loiseleur gives her a sugary smile and rattles off the\r\n     absolution. He makes the sign of the cross over her and\r\n     stands up.\r\n\r\n66   Cauchon and his confidants have left their hiding-place and\r\n     now come into the cell. The soldiers bring in chairs and a\r\n     table for the scribe. The judges group themselves in a circle\r\n     round Joan, some sitting, others standing. Loiseleur places\r\n     himself behind Cauchon. In addition to the judges, Massieu\r\n     also is present.\r\n\r\n67   Cauchon gestures to Lemaître who says to Joan:\r\n\r\n               You profess to be a daughter of\r\n               God? ...\r\n\r\n     Joan agrees with a nod, and Lemaître continues:\r\n\r\n               Then why will you not say Our\r\n               Father?\r\n<b>                                                              15.\r\n</b>\r\n\r\n     Joan sits motionless for a moment. The judges look at her\r\n     with watchful eyes. A perceptible change comes over Joan. Her\r\n     expression is transfigured. A heavenly light spreads over her\r\n     face, she folds her hands and begins to pray. The sight of\r\n     this small and helpless woman, turning to God in captivating\r\n     innocence, makes an involuntary impression on some of the\r\n     judges. The gentle Massieu in particular can hardly restrain\r\n     his tears.\r\n\r\n     Joan has said the Our Father. Jean d'Estivet is thus obliged\r\n     to eliminate this important point from his charge-sheet.\r\n\r\n68   Lemaître continues with the hearing:\r\n\r\n               Has God told you that you will be\r\n               released from your prison?\r\n\r\n     Joan smiles and gives Loiseleur a secret, confidential\r\n     glance. His eyes gleam back at her in complicity. She\r\n     answers:\r\n\r\n               Yes ... and by means of a great\r\n               victory!\r\n\r\n69   The judges are astonished and cross-examine her. They ask her\r\n     to explain precisely what she knows, and how she has come to\r\n     know it. But Joan answers:\r\n\r\n               I know that God will soon come to\r\n               my help in a miraculous way!\r\n\r\n70   Jean d'Estivet hastens to write down this important answer.\r\n     With great secrecy he grips Loiseleur's hand in gratitude.\r\n     Cauchon, Lemaître and some of the other judges plot together.\r\n\r\n71   Lemaître leans forward and begins to question her:\r\n\r\n               Has God promised you that you will\r\n               go to Paradise?\r\n\r\n     Joan knows instinctively that they have laid a trap for her.\r\n     In her uncertainty she looks for help from Loiseleur, who\r\n     indicates to her with a slight smile that she is to say yes.\r\n     Lemaître is satisfied with her answer but takes good care to\r\n     conceal his satisfaction. In a tone almost of boredom he\r\n     says:\r\n\r\n               So you are certain of being saved?\r\n<b>                                                                16.\r\n</b>\r\n\r\n72   Again Joan resorts to Loiseleur. He gives the same sign as\r\n     before, and Joan says yes.\r\n\r\n     Massieu's eyes are as if riveted to Joan's lips, and now when\r\n     she answers yes he forgets where he is, forgets that Cauchon\r\n     is just beside him, and almost without thinking says to Joan:\r\n\r\n               Do you realize that this is an\r\n               extremely important answer?\r\n\r\n     Cauchon pounces on Massieu and bursts out:\r\n\r\n               You had better hold your tongue!\r\n\r\n     Massieu wants to explain, but Cauchon cuts him short and\r\n     orders the hearing to continue.\r\n\r\n73   Lemaître presents his next question, which is only one link\r\n     in a chain of questions carefully prepared and ingeniously\r\n     related:\r\n\r\n               Since you are so certain of your\r\n               salvation ... why do you need to go\r\n               to confession?\r\n\r\n     Joan is already floundering in the net. She has the feeling\r\n     that her answer may decide her destiny. She is like a hunted\r\n     animal that looks for the smallest gap in the chain of\r\n     beaters in the hope of escaping its pursuers. The judges\r\n     never take their eyes from her. Ladvenu and Massieu are the\r\n     only ones whose faces show signs of sympathy and compassion.\r\n     Loiseleur, seeing that his plan is working out to perfection,\r\n     gives Cauchon a slight nudge with his knee. There is a pause.\r\n\r\n74   Lemaître realizes that the moment is ripe for presenting the\r\n     final question which will settle the issue:\r\n\r\n               Are you in a state of grace?\r\n\r\n     For a few seconds it is so still that you could hear a pin\r\n     drop. Joan tries to catch Loiseleur's eye, but he adroitly\r\n     avoids meeting her look of entreaty. Joan is obviously at a\r\n     loss how to answer.\r\n\r\n75   But then the honest and fair-minded Massieu moves\r\n     convulsively forward and shouts:\r\n\r\n               Don't answer, Joan - this question\r\n               is too dangerous...\r\n\r\n     Cauchon, enraged, rises in all his majesty and bellows with\r\n     the full power of his lungs:\r\n<b>                                                             17.\r\n</b>\r\n\r\n               Be quiet, will you, in the Devil's\r\n               name!\r\n\r\n     Massieu defends himself. He explains that nobody has the\r\n     right to ask such a question of an accused person, least of\r\n     all when the accused is a young girl standing on her own with\r\n     nobody to advise her. But Cauchon will tolerate no\r\n     insubordination. Massieu is forced to kneel there and then\r\n     and ask for pardon, and must consider himself fortunate not\r\n     to share de Houppeville's fate.\r\n\r\n76   When peace is restored Cauchon gives orders for the hearing\r\n     to continue. Lemaître, still seething, asks:\r\n\r\n               Answer now! Are you in a state of\r\n               grace?\r\n\r\n     Joan opens her mouth to answer, but appears to have second\r\n     thoughts and remains silent. She looks in the direction of\r\n     Loiseleur, who is apparently absorbed in his own reflection.\r\n     He is abandoning her to her fate. In his view she is a\r\n     certain prey; whether she answers yes or no, she is doomed to\r\n     perdition. But now that Joan has collected her thoughts\r\n     again, she gives this admirable answer:\r\n\r\n               If I am not, may God put me there!\r\n               And if I am, may God so keep me!\r\n\r\n77   Joan has broken the chain of beaters. She realizes this and\r\n     smiles. But her judges, who have sat there greedily waiting\r\n     for the prey to fall into the net so that they can hurl\r\n     themselves on it - these judges now sit not knowing what to\r\n     say or where to look. They gaze at each other in speechless\r\n     amazement. Some of them unconsciously make the sign of the\r\n     cross. Loiseleur is beyond doubt the most disconcerted. All\r\n     of them feel that they have suffered a defeat. This battle is\r\n     lost; now they must try to win the next one. A short\r\n     conference takes place. The judges rise to go.\r\n\r\n78   Joan throws herself at Cauchon's feet, embraces his knees and\r\n     begs him:\r\n\r\n               I implore you to let me come to\r\n               Mass!\r\n\r\n     Cauchon thrusts her away so brutally that she hits the bed.\r\n     She remains lying on the floor.\r\n\r\n79   Loiseleur has hastily stolen over to Cauchon and is\r\n     whispering something in his ear. Cauchon's face lights up. He\r\n     whispers to the others, letting them in on Loiseleur's plan.\r\n     Then he approaches Joan and says to her in his mildest voice:\r\n<b>                                                             18.\r\n</b>\r\n\r\n               Joan, if you were allowed to go to\r\n               Mass now ...\r\n\r\n     Joan looks up at Cauchon. Her eyes are already gleaming with\r\n     hope and expectation. Cauchon continues:\r\n\r\n               ... would you consent to give up\r\n               your men's clothes?\r\n\r\n     When Joan hears this condition, her hope is extinguished as\r\n     rapidly as it was kindled. Her expression reflects the\r\n     deepest disappointment. Her judges repeat Cauchon's question,\r\n     but she declines their offer. One of them helps her up. She\r\n     sits on the bed, and all those taking part in the session\r\n     crowd round her, saying that she must adopt the dress which\r\n     is appropriate to her sex, if she wants to obtain so great a\r\n     blessing, and if she wants to live up to her pious feelings.\r\n\r\n80   Finally Cauchon says:\r\n\r\n               Then you would rather keep your\r\n               men's clothes than come to Mass?\r\n\r\n     Joan explains through her tears that she is not allowed to do\r\n     otherwise:\r\n\r\n               I cannot do anything else ... it is\r\n               not in my power!\r\n\r\n     But Cauchon, unable to control his anger, persists:\r\n\r\n               ... this shameless costume ...\r\n\r\n     Joan tries in vain to make them understand that this form of\r\n     dress does not pollute her soul with sin, and that wearing it\r\n     is not in conflict with the Church's laws. Ignoring Joan's\r\n     remarks, Cauchon rages:\r\n\r\n               ... abominable in the eyes of God\r\n<b>               ...\r\n</b>\r\n     Joan writhes under these denunciations, she implores him to\r\n     show mercy, but he scourges her pitilessly:\r\n\r\n               ... You are no daughter of God ...\r\n\r\n     Joan weeps and sobs.\r\n\r\n81   Cauchon shows no sympathy. He lowers his voice, bends right\r\n     over her and hisses:\r\n\r\n               ... but a child of the Devil!\r\n\r\n     Joan cries out and collapses.\r\n<b>                                                                19.\r\n</b>\r\n\r\n     The judges watch her for a moment. Ladvenu full of sympathy.\r\n     Then Cauchon turns to Massieu and says:\r\n\r\n                  Go and prepare the instruments of\r\n                  torture!\r\n\r\n     Massieu can hardly believe his ears. Are they really going to\r\n     torture Joan? But a look from Cauchon prevents him from\r\n     saying anything. He goes out through the door, giving Joan a\r\n     look of compassion as he does so.\r\n\r\n82   The soldiers, who have witnessed the examination, escort him\r\n     out, and in the ante-room they reproach and abuse him:\r\n\r\n                  Why did you make signs to her and\r\n                  give her good advice?\r\n\r\n     They threaten to throw him into the Seine if this happens\r\n     again.\r\n\r\n<b>83   THE PRISON\r\n</b>\r\n     The judges leave Joan, Loiseleur being the last to go. Before\r\n     he leaves the cell he approaches Joan and pats her hair\r\n     sympathetically:\r\n\r\n                  Do not grieve ... place your trust\r\n                  in God, he will not forget you!\r\n\r\n     Joan turns her tear-stained face to him; full of gratitude\r\n     for his kind words, she kisses his hand. Then Loiseleur goes\r\n     out.\r\n\r\n     Joan is left in solitude for a mere moment, before the\r\n     soldiers enter in order to bait her in their usual manner.\r\n     Joan takes no notice of them. One of them tickles her in the\r\n     ear with a straw. Joan gets up laboriously and sits down on\r\n     the bed. One of the soldiers suddenly catches sight of the\r\n     straw crown. He laughs, picks it up, turns it round in his\r\n     hands, and finally places it on Joan's head. Outraged by this\r\n     form of sacrilege, she removes it and puts it on the bed; but\r\n     the soldier replaces the crown on her head, at the same time\r\n     giving her several slaps in the face. He steps back and peeps\r\n     through the hollow of his hand, as if to see her better.\r\n\r\n84   The other soldiers roar with laughter and say in mocking\r\n     tones:\r\n\r\n                  She looks just like a daughter of\r\n                  God, eh?\r\n\r\n     He takes an arrow from his quiver, and places it in Joan's\r\n     hands. She lets him do this without resistance.\r\n<b>                                                              20.\r\n</b>\r\n\r\n     Another soldier takes a pitcher of water, and sprinkles Joan\r\n     with his fingers. All three bow low before her as if she was\r\n     a saint, and finally kneel and say:\r\n\r\n               Saint Joan, pray for us!\r\n\r\n     Then, still bowing, they step back and go out.\r\n\r\n     Joan sits for a moment by herself. Without changing her\r\n     position she prays silently to God. She is praying to the\r\n     Almighty for strength and courage to endure her trial by\r\n     torture.\r\n\r\n85   Enter Massieu. He is to fetch Joan and bring her to the\r\n     torture-chamber. He is amazed at finding her decked out in\r\n     this way, but he gives her such comfort as he can, and leads\r\n     her out.\r\n\r\n<b>86   THE TORTURE-CHAMBER\r\n</b>\r\n     The judges have already arrived and are taking their places.\r\n     They consist of Pierre Cauchon, Lemaître, and nine doctors\r\n     and prelates. The two executioners, Maugier Leparmentier and\r\n     his assistant, are putting the instruments in order and\r\n     making other necessary preparations.\r\n\r\n87   Enter Massieu with Joan. She is told to come nearer. Cauchon\r\n     tells one of the younger judges to bring a stool for Joan.\r\n\r\n88   The judge who helps Joan to her seat says:\r\n\r\n               Look! at all these kind,\r\n               sympathetic men ...\r\n\r\n     He points at Cauchon, who sits surrounded by his\r\n     collaborators. Not one face expresses any feeling of\r\n     friendliness towards the accused. The judge continues:\r\n\r\n               Do you not consider that these\r\n               learned doctors are likely to be\r\n               endowed with more wisdom than you\r\n<b>               ...\r\n</b>\r\n89   Joan nods half absent-mindedly. The judge is pleased with his\r\n     happy idea and is about to continue his course of instruction\r\n     when Joan interrupts him:\r\n\r\n               ... but the wisdom of God is even\r\n               greater!\r\n\r\n     The judge, who has spoken to Joan as one speaks to a child\r\n     which stubbornly refuses to listen to reason, shrugs his\r\n     shoulders and gives up. There is nothing to be done about\r\n     this woman's arrogance.\r\n<b>                                                             21.\r\n</b>\r\n\r\n90   Cauchon has raised his hands to his face, outraged by such\r\n     obstinacy. Now he leans forward in his chair and says with\r\n     great emphasis:\r\n\r\n               Suppose we were to tell you now\r\n               that your visions did not - as you\r\n               believe - come from God ...\r\n\r\n     Joan looks up quickly, as if unable to believe her ears. She\r\n     searches the faces of her judges, one after the other.\r\n     Cauchon continues:\r\n\r\n               ... but are sent to you by the\r\n               Devil, who wants to bring your soul\r\n               to perdition!\r\n\r\n     Joan sits for a moment, deep in thought. Then a smile spreads\r\n     across her face. Almost unconsciously she shakes her head -\r\n     and smiles again. Assuredly the Devil has no power over her\r\n     and is not going to obtain it either.\r\n\r\n91   One of the judges asks:\r\n\r\n               If the Devil appeared in the form\r\n               of an angel, how could you be\r\n               certain whether it was a good or a\r\n               bad angel?\r\n\r\n     For a moment the smile fades from Joan's lips. She does not\r\n     answer. Cauchon looks at her for a long time and then says:\r\n\r\n               It is Satan to whom you have knelt,\r\n               not Saint Michael!\r\n\r\n     Joan finds this idea so comical that she has to laugh. She\r\n     cannot help herself; it is not a provocative laugh, only the\r\n     spontaneous laughter of a healthy person. But Cauchon strikes\r\n     the table in anger. Joan stops laughing. Cauchon gazes\r\n     fixedly at her for some time without saying a word. There is\r\n     complete silence in the room.\r\n\r\n92   Cauchon gets up, approaches Joan in a dignified manner, leans\r\n     towards her and says:\r\n\r\n               How can you believe that it is God\r\n               who guides your steps when you see\r\n               the abyss opening before your feet?\r\n\r\n     Joan is serious again. Cauchon continues, pronouncing the\r\n     words with steadily increasing emphasis:\r\n\r\n               Do you not understand that it is\r\n               the Devil who has turned your head\r\n<b>               ...\r\n</b><b>                                                             22.\r\n</b>\r\n\r\n     He pauses briefly, then continues:\r\n\r\n               ... who has deceived you ...\r\n\r\n     Then after another short pause:\r\n\r\n               ... and betrayed you?\r\n\r\n     While Cauchon has been speaking a change has come over Joan.\r\n     It is clear that she is tormented by doubts. God has promised\r\n     her that she will be set free. Why has God not kept his\r\n     promise to her? Why does he let her stand alone against all\r\n     these churchmen, these learned doctors? She even asks herself\r\n     whether she has the right to talk as she does in front of all\r\n     these gifted and erudite men. Is it true that she is full of\r\n     pride? Is it the Devil who has possessed her and insinuated\r\n     in her mind everything that she believed to have come from\r\n     God?\r\n\r\n93   Cauchon, judge of character that he is, has no difficulty in\r\n     seeing what is going on in this young woman's heart. While\r\n     Joan is wrestling with her doubts he orders a small table to\r\n     be set in front of her. He puts a document on the table and\r\n     then places a pen in her hand. Half absentmindedly she lets\r\n     him do all this, but when Cauchon tries to persuade her to\r\n     sign she tells him that she is unable to read. Cauchon tells\r\n     the notary to read the declaration aloud:\r\n\r\n               ... I declare that I am guilty of\r\n               the crimes with which I am charged,\r\n               and which the Devil has misled me\r\n               into committing. I confess that my\r\n               visions are the work of the Devil,\r\n               and I am ready to return to the\r\n               path of truth and, before all the\r\n               world, to recant ...\r\n\r\n94   When the notary has finished reading aloud, Cauchon tells\r\n     Joan warningly that she must sign the declaration, and adds:\r\n\r\n               The Church is opening her arms to\r\n               you ...\r\n\r\n     Joan's expression makes it clear that she has almost overcome\r\n     her doubts. Her faith in God and belief in her mission are on\r\n     the point of gaining the upper hand.\r\n\r\n     Cauchon threatens her:\r\n\r\n               ... but if you do not sign, the\r\n               Church will turn her back on you\r\n               and you will stand alone ...\r\n<b>                                                             23.\r\n</b>\r\n\r\n     Joan's crisis is over. Once again she sees clearly the path\r\n     she must follow. Quietly she puts away the pen. Cauchon sees\r\n     this and thunders:\r\n\r\n               ... alone ...\r\n\r\n     But a heavenly light shines from Joan's face. She smiles.\r\n     With her eyes raised to heaven she says:\r\n\r\n               ... alone - with God!\r\n\r\n95   Cauchon, realizing that his prey is about to escape him,\r\n     increases his exertions and displays all his powers of\r\n     persuasion. Does she know that the Church has the means to\r\n     compel her? Is she familiar with the secrets of the torture?\r\n     Cauchon's threats make no impression on Joan.\r\n\r\n     She feels safe with her God. Her face is transfigured by a\r\n     beautiful light as she says:\r\n\r\n               I would rather die than deny God's\r\n               acts.\r\n\r\n     Enraged by Joan's pig-headedness, Cauchon loses patience. He\r\n     orders Joan to be put to torture. While the executioners are\r\n     taking care of her the judges gather together in a group.\r\n\r\n     One instrument of torture after another is displayed for\r\n     Joan's benefit. With an executioner at her side she is\r\n     conducted past the various appliances. She looks at each one\r\n     for a long time, trembling with fear. Occasionally the\r\n     executioner demonstrates with a gesture how one of the\r\n     instruments is operated. They are trying to frighten Joan out\r\n     of her senses.\r\n\r\n     When the executioners have completed their preparations and\r\n     the torture can begin, Cauchon goes up to Joan and invites\r\n     her once again to sign the declaration. She refuses and says:\r\n\r\n               Even though you torture my soul out\r\n               of my body I shall confess nothing\r\n<b>               ...\r\n</b>\r\n     Cauchon gives orders for the torture to begin. Joan lets out\r\n     a scream of pain. She is seen to raise one hand. They all\r\n     think she is indicating her readiness to sign. A judge holds\r\n     the document out to her, but Joan thrusts it away so\r\n     violently that it falls on the ground. Somebody picks it up.\r\n     And Joan says vehemently:\r\n\r\n               ... and if I should confess\r\n               anything, I will afterwards declare\r\n               that it was only by using force\r\n               that you made me confess.\r\n<b>                                                                 24.\r\n</b>\r\n\r\n96    Joan collapses. The executioner bends over her. She has\r\n      fainted.\r\n\r\n97    The executioner and Massieu carry her out while the judges\r\n      confer on what procedure to adopt next.\r\n\r\n<b>98    THE PRISON\r\n</b>\r\n      Massieu has gone on ahead to notify Joan's keeper, who sends\r\n      a man out with a message for Warwick. Massieu prepares Joan's\r\n      bed and takes the little crown in his hands; he looks at it\r\n      for a moment, then flings it into a corner. Enter the\r\n      executioner and his assistant, carrying Joan between them.\r\n      They lay her on the bed and go out. Before Massieu leaves the\r\n      cell, he gives one of the soldiers instructions to keep an\r\n      eye on Joan.\r\n\r\n<b>99    THE TORTURE-CHAMBER\r\n</b>\r\n      The judges confer. Cauchon thinks the torture should\r\n      continue, and asks the judges to vote on this proposal, but\r\n      only one of them is in favor of continuing. This is\r\n      Loiseleur, who says:\r\n\r\n                   It is medicine for her soul!\r\n\r\n      Ladvenu gives Loiseleur a look of hostility.\r\n\r\n<b>100   THE PRISON\r\n</b>\r\n      Joan is lying on her wretched bed. The chains, the brutal\r\n      soldiers, terror, fatigue, and finally the torture have\r\n      exhausted her strength. She is unrecognizable. Her face is as\r\n      white as a sheet. Deep shadows under her eyes. When the scene\r\n      opens, she is lying in a feverish doze. She breathes rapidly\r\n      and with difficulty.\r\n\r\n      A soldier with a hard, repellent face is watching at her\r\n      side. Joan opens her eyes and says:\r\n\r\n                   I am thirsty!\r\n\r\n      The soldier looks at her with an unfeeling, hostile\r\n      expression. Then he takes the bowl of water and pours the\r\n      water over the floor.\r\n\r\n<b>101   THE TORTURE-CHAMBER\r\n</b>\r\n      The judges have not yet concluded their conference. They\r\n      still seem unable to agree on whether the torture shall\r\n      continue or not. However, Master Erard wins a majority of the\r\n      votes when he declares:\r\n\r\n                   This heart is much too hardened ...\r\n<b>                                                                 25.\r\n</b>\r\n\r\n                   there is no hope of our getting a\r\n                   recantation this time - we will\r\n                   have to wait!\r\n\r\n      Cauchon disagrees. A confession would be valuable, even if it\r\n      was subsequently withdrawn. But Erard continues:\r\n\r\n                   ... and she might die at our hands!\r\n\r\n      Cauchon yields to this argument. Even Loiseleur defers to\r\n      Erard and admits that it would be very damaging to all their\r\n      interests if Joan died at the hands of the executioner. She\r\n      would then be certain to enjoy a martyr's glory. Having\r\n      decided to give up the torture they leave the torture-\r\n      chamber.\r\n\r\n<b>102   THE PRISON\r\n</b>\r\n      Enter Warwick. He goes over to the bed and bends over Joan -\r\n      not with any feeling of sympathy. Joan opens her eyes for a\r\n      moment and meets his cold, hostile gaze. Then she relapses\r\n      into her state of lethargy. Warwick goes from the bed towards\r\n      the door, which he has left standing open behind him. Two\r\n      doctors whom he has sent for come into the cell. He follows\r\n      them over to the bed, where he speaks the famous words which\r\n      for sheer brutality are without parallel in history:\r\n\r\n                   I would not have her die a natural\r\n                   death on any account ... she has\r\n                   cost me too much for that...\r\n\r\n      The doctors begin to examine Joan. They feel her thighs and\r\n      right side.\r\n\r\n      Meanwhile Warwick has gone from the sick-bed over to the\r\n      door.\r\n\r\n103   Enter Loiseleur with the news that Cauchon is waiting in the\r\n      adjoining room. Warwick is about to go when one of the\r\n      doctors approaches him and says:\r\n\r\n                   She has a fever, we shall have to\r\n                   bleed her ...\r\n\r\n      Warwick shows signs of unease, and asks whether this is\r\n      really necessary.\r\n\r\n      The doctor insists that it is. Warwick consents, adding:\r\n\r\n                   But take good care that she does\r\n                   not do away with herself ... she is\r\n                   very crafty.\r\n<b>                                                              26.\r\n</b>\r\n\r\n104   The doctor turns back to the bed to prepare for the blood-\r\n      letting. Warwick accompanies Loiseleur into the adjoining\r\n      room, where Cauchon and some of the other judges are waiting.\r\n      Cauchon enquires after Joan. Warwick answers in a manner\r\n      which cannot be misunderstood:\r\n\r\n                She is very weak...\r\n\r\n      The two men exchange glances. Cauchon and the judges have\r\n      come to extort a confession from Joan. 'whether because they\r\n      were afraid of her escaping in this way and dying without\r\n      having made a recantation, or because her weakened physical\r\n      condition raised hopes of her soul being easier to purchase.'\r\n\r\n      Cauchon explains to Warwick how he wants to proceed.\r\n      Loiseleur joins in the discussion and proposes a drastic\r\n      remedy. Cauchon approves Loiseleur's idea and tells Massieu\r\n      and another young monk to fetch the holy vessel.\r\n\r\n105   While this is going on, scenes are shown from the sick-bed\r\n      and Joan's blood-letting. One of the doctors goes out in\r\n      order to report that the blood-letting is finished. The\r\n      patient is better and can undergo examination without danger.\r\n\r\n      Cauchon, Loiseleur and some of the other clerics come into\r\n      the cell. Warwick remains with the doctors in the adjoining\r\n      room.\r\n\r\n106   Joan is lying with closed eyes. Cauchon goes over to the bed\r\n      and bends over Joan with a benevolent, paternal expression.\r\n      He touches her on the temples. Joan opens her feverish eyes.\r\n      He asks her in a friendly manner how she is. She makes a\r\n      movement with her head and at the same time gives a feeble\r\n      smile. Her eyes shift from Cauchon to the others; what is\r\n      going to happen now? She is evidently taken by surprise.\r\n\r\n107   Cauchon guesses her thoughts, calms her and says:\r\n\r\n                We have come to give you comfort\r\n                and strength ...\r\n\r\n      A tiny glimmer of gratitude passes over Joan's face. Cauchon\r\n      and the others install themselves, sitting and standing round\r\n      her bed.\r\n\r\n      Cauchon, with the same benevolent air and kindly smile, asks\r\n      whether Joan has anything to say to him, whether perhaps she\r\n      has any wishes. Joan holds him for a long time in her gaze,\r\n      which the fever has made still more penetrating. Then she\r\n      makes a feeble movement with her head. Cauchon arranges the\r\n      pillow under her and comes close to her in order to hear\r\n      better. Joan, whose labored breathing makes it difficult for\r\n      her to speak, says in a weak voice:\r\n<b>                                                               27.\r\n</b>\r\n\r\n                I am afraid that I am going to die\r\n<b>                ...\r\n</b>\r\n108   Cauchon speaks some words of consolation to her in his\r\n      capacity of priest. Joan continues:\r\n\r\n                ... If I should die, I implore you\r\n                to have me buried in consecrated\r\n                ground!\r\n\r\n      Joan tries to read the answer from Cauchon's face; she sees\r\n      only utter benevolence and charitableness. In addition, all\r\n      the judges now seem full of affection and sympathy. They\r\n      tiptoe round her bed, first one and then another coming close\r\n      up to her. They tuck the blanket round her and touch the\r\n      place where she has been bled. Some of them kneel and pray\r\n      for Joan. She regrets not having been more amiable towards\r\n      these men who are revealing their true feelings, now that\r\n      they see her in such misery. She feels every confidence in\r\n      them and in Cauchon. He has caused her great suffering; now,\r\n      however, he appears no longer as a judge, but as one who has\r\n      come to show her goodness and compassion. And when Cauchon\r\n      strokes her hair and says:\r\n\r\n                The Church is merciful ...\r\n\r\n      Joan smiles trustfully.\r\n\r\n109   Cauchon continues:\r\n\r\n                She does not close her heart\r\n                against those who return to her ...\r\n\r\n      Joan, in her weakened state, does not know how to express her\r\n      gratitude. She squeezes Cauchon's large hand in her tiny one,\r\n      which is absolutely white. But Cauchon says in a gentle\r\n      voice:\r\n\r\n                What would you say if we gave you\r\n                the Sacrament?\r\n\r\n      Joan cannot believe her ears. She asks one question after\r\n      another, which Cauchon answers only with nods and his\r\n      paternal, benevolent smile. Joan has to find an outlet for\r\n      her joy, and with her two small hands she takes Cauchon's\r\n      great fist and places it against her cheek.\r\n\r\n110   Cauchon signals to Loiseleur, who opens the door. Enter\r\n      Massieu with the Eucharist. Cauchon helps Joan sit up in bed.\r\n      Beside herself with joy and anticipation, she follows the\r\n      preparations and keeps looking at Cauchon with gratitude.\r\n      Then she says joyfully:\r\n\r\n                I am a good Christian ...\r\n<b>                                                               28.\r\n</b>\r\n\r\n111   The judges in the cell send up a prayer of thanks to God for\r\n      restoring this lost sheep to the fold. Joan smiles happily.\r\n\r\n      Then the notary places a document in front of Joan and offers\r\n      her a pen. Joan looks in amazement at the document, which she\r\n      recognizes: it is the same declaration which was placed in\r\n      front of her for her to sign during the torture scene. Her\r\n      look of astonishment shifts from the notary to the document\r\n      and from the latter to Cauchon.\r\n\r\n112   She explains once more that all the accusations in the\r\n      document are what God has commanded her to do. She cannot\r\n      recant like this without denying her God. Cauchon bends over\r\n      her and says:\r\n\r\n                The Sacrament ... is it not a great\r\n                blessing?\r\n\r\n      Joan nods, and her expression seems to want to say: of\r\n      course, everybody knows that the Church has no greater\r\n      treasure.\r\n\r\n      Cauchon continues:\r\n\r\n                ... But you will never share in the\r\n                Church's blessings, if you do not\r\n                expiate your sins.\r\n\r\n113   He indicates to Joan that she must sign. One of the judges\r\n      approaches with a wafer. An expression of misery and pain\r\n      lies on Joan's face as she sits there, sick, feverish and\r\n      racked with doubts. On one side she sees the wafer, which is\r\n      more precious to her than life itself, on the other side the\r\n      document, which will make her confess that she is an agent of\r\n      the Devil.\r\n\r\n114   As if talking to herself and her conscience, she says:\r\n\r\n                I am a good Christian ...\r\n\r\n      As she sits there, alone with all these men, she is the\r\n      picture of utter despair and loneliness. They all gaze at her\r\n      with fixed stares. Nobody speaks to her. Finally Cauchon\r\n      breaks the silence. In a quiet voice he advises Joan to sign\r\n      and save her soul; but Joan has now mastered her temptation.\r\n      She hands back the paper. Her body is broken. But the\r\n      strength of her spirit is unaltered.\r\n\r\n      For a moment they are all struck dumb.\r\n\r\n115   Cauchon gestures, ordering the Sacrament to be carried out.\r\n      The tears run down Joan's cheeks, when she sees the priests\r\n      going out with the sacred vessel.\r\n<b>                                                               29.\r\n</b>\r\n\r\n                  I love God ... I love Him with all\r\n                  my heart!\r\n\r\n      she says.\r\n\r\n116   Loiseleur, who has accompanied the procession into the\r\n      adjoining room, tells Warwick the outcome.\r\n\r\n117   In the cell the atmosphere has changed abruptly. Cordiality\r\n      is replaced by coldness, gentleness by severity. The judges\r\n      are overcome by a feeling which can almost be called\r\n      irritation - irritation with Joan and what they call her pig-\r\n      headedness.\r\n\r\n118   Jean d'Estivet reproaches her harshly for allowing her vanity\r\n      to take precedence over the salvation of her soul. He\r\n      concludes with these words:\r\n\r\n                  If you die in this hour, you die as\r\n                  an infidel...\r\n\r\n      Joan, goaded by the mental torture to which she has been\r\n      subjected, answers in words conjured up by her sancta\r\n      simplicitas; but Jean d'Estivet, revelling in the pain his\r\n      speech has given Joan, obliterates her with the wounding\r\n      words, which sting like the lash of a whip:\r\n\r\n                  Your soul is doomed to perdition\r\n<b>                  ...\r\n</b>\r\n      To which one of the others adds:\r\n\r\n                  ... to everlasting torture in the\r\n                  flames of Hell!\r\n\r\n119   Groaning under the burden of the injustice and malice they\r\n      are heaping on her, Joan turns for comfort to Cauchon, whose\r\n      hand she has just pressed to her cheek; but Cauchon has no\r\n      comfort to give. He draws back and says coldly:\r\n\r\n                  Joan, you are a child of the Devil!\r\n\r\n120   She looks at him in unaffected terror. Then it is as if a\r\n      veil gradually falls from her eyes; as if the whole truth is\r\n      revealed to her in a flash of lightning. They have lied to\r\n      her in order to trap her. In her overwrought and exhausted\r\n      condition she loses all self-control. Fever and ecstasy take\r\n      charge of her features. As a stream of reproaches pours from\r\n      her lips they all gaze at her in terror: is this the last\r\n      flare-up before death, is it madness? All of them feel\r\n      themselves face to face with something unfamiliar and\r\n      extraordinary. Slowly they draw away. Cauchon rises and backs\r\n      round his chair.\r\n<b>                                                              30.\r\n</b>\r\n\r\n121   Foaming at the mouth, Joan continues to pour out a torrent of\r\n      words:\r\n\r\n                   You say that I am a child of the\r\n                   Devil...\r\n\r\n      and she continues:\r\n\r\n                   ... but I say it is you who have\r\n                   been sent by the Devil to torment\r\n                   me!\r\n\r\n      She stands up in bed, pointing at each judge in turn.\r\n\r\n      A violent storm of anger breaks out:\r\n\r\n                   Blasphemy! She is possessed! This\r\n                   is monstrous!\r\n\r\n      The judges huddle together in their agitation and terror, and\r\n      gradually withdraw.\r\n\r\n122   And now Joan falls back on her bed, exhausted. She groans and\r\n      gasps for breath. She wipes the sweat from her forehead with\r\n      her sleeve. For a moment there is silence. Only her groans\r\n      can be heard. The judges look at each other, not knowing what\r\n      to do. Then they turn to Cauchon who is pondering. It is he\r\n      who breaks the silence with the following words addressed to\r\n      Massieu:\r\n\r\n                   There is nothing for it ... give\r\n                   the executioner his orders!\r\n\r\n      While the doctors who have entered during the preceding scene\r\n      are attending to Joan, the judges leave the room.\r\n\r\n123   By the time the judges come out into the castle yard, there\r\n      are already rumors of what has happened in the cell. The\r\n      inhabitants of the castle crowd round to hear the news and\r\n      learn of the preparations now in hand for the penultimate act\r\n      of the drama. From the castle yard a small door leads out to\r\n      the churchyard, which lies outside the castle walls. The\r\n      judges make for the churchyard.\r\n\r\n<b>124   THE PRISON\r\n</b>\r\n      Some soldiers have come with a stretcher. They lift Joan onto\r\n      it and carry her out.\r\n\r\n<b>125   THE CHURCHYARD\r\n</b>\r\n      One group of judges after another is seen moving forward to\r\n      the spot from which they are to witness the impending\r\n      ceremony.\r\n<b>                                                              31.\r\n</b>\r\n\r\n126   Joan, lying on the stretcher, is carried into the churchyard.\r\n\r\n127   The churchyard, which is surrounded by walls, is very big,\r\n      but only a few graves can be seen in it. They are all covered\r\n      with flat stones after the custom of the Middle Ages. In\r\n      those days churchyards served as a meeting-place at certain\r\n      festivals, and the judicial authorities of the Church often\r\n      used them as a stage for important announcements and\r\n      abjurations, which they wanted known to as many people as\r\n      possible; they formed a theatrical setting, with graves and\r\n      gravestones as sets. A stench of putrefaction arose from this\r\n      earth filled with dead bodies. The poisonous smell of\r\n      nothingness. The smell of stones, corpses and worms. Against\r\n      the buttress of the church two platforms have been erected\r\n      and covered with red velvet. On one of them the entire\r\n      assembly of judges is sitting in state: Pierre Cauchon, the\r\n      Inquisitor, and a host of jurists in scarlet caps and purple\r\n      skull-caps. The other platform is for Joan.\r\n\r\n128   Escorted by English soldiers, Joan's little procession comes\r\n      slowly to this place.\r\n\r\n129   Everywhere in the churchyard, and even on the walls, there\r\n      are thousands of people, heads jostling. The great majority\r\n      of them are favorably disposed towards Joan. When she is\r\n      carried in, every neck is craned to catch a glimpse of her.\r\n      For her part Joan tries to read her destiny in their faces.\r\n      From the way they look at her she gets the impression that\r\n      their feelings towards her are friendly. Joan, who for months\r\n      has lived remote from this earth, is visibly moved. She\r\n      smiles at the tiny flowers which greet her from the grass.\r\n      She almost touches them with her hand and imagines that she\r\n      is caressing them. But when she looks in the other direction,\r\n      her eye falls on two gravediggers who are engaged in opening\r\n      up an old grave. She sees the worms swarming in the skulls\r\n      which are thrown up, and she is filled with the fear of\r\n      death. Once more she ponders over the words which the members\r\n      of the judicial body have addressed to her, and she thinks\r\n      sadly of her fellow countrymen, who seem to have forsaken her\r\n      completely.\r\n\r\n130   The tiny procession approaches the platform reserved for\r\n      Joan. Loiseleur comes forward to meet the procession and\r\n      assist her. She smiles happily at this man, whom she believes\r\n      to be on her side. She is helped to a seat on a little stool.\r\n\r\n131   Her face is as white as a sheet. She closes her eyes, which\r\n      have been hurting intensely, bows her head and places her\r\n      hands on her breast to all appearances indifferent to\r\n      everything happening around her. Erard, Massieu and two\r\n      notaries take their places at Joan's side.\r\n<b>                                                                 32.\r\n</b>\r\n\r\n132   Loiseleur goes back to the larger platform where he takes his\r\n      place near Cauchon, who now gets up and declares the session\r\n      opened.\r\n\r\n                Joan, for the last time I order you\r\n                to abjure. Are you willing to sign?\r\n\r\n      Joan sits motionless and expressionless. She hears nothing,\r\n      and smiles distantly.\r\n\r\n133   One of the prelates takes his place at Joan's side. He begins\r\n      an admonitory sermon, taking as text the words from Saint\r\n      John's Gospel: 'The branch cannot bear fruit of itself except\r\n      it abide in the vine.' Inspiring terror at one moment,\r\n      speaking sanctimoniously the next, he warns, he threatens, he\r\n      implores, he mocks, he calls her a cunning traitor, cruel,\r\n      greedy, a liar, a heretic, a witch. His anger rises in\r\n      measure with his words and finally reaches a point where it\r\n      overflows in a torrent. He is unquestionably a powerful\r\n      speaker.\r\n\r\n134   But the stream of words appears to flow over Joan's head\r\n      without touching her. The past and the present mingle in   her\r\n      thoughts; yet nothing of what goes on around her escapes   her\r\n      notice. She looks towards the open grave. She cannot see   the\r\n      actual gravedigger, only the earth which he is shoveling   up\r\n      from deep down. Then she hears a shout of command.\r\n\r\n135   In the densest part of the crowd the soldiers are clearing a\r\n      passage to allow a carriage into the churchyard. The new\r\n      arrivals are the executioner and his two assistants.\r\n\r\n136   Erard is enraged at Joan's apparent lack of interest in what\r\n      he is saying. He raises his voice and shouts furiously:\r\n\r\n                ... This woman's arrogance fills\r\n                one with disgust ...\r\n\r\n      Joan's attitude remains unchanged. She does not move. Erard's\r\n      voice trembles as he continues:\r\n\r\n                There has never been a monster in\r\n                France like the one which has\r\n                appeared in the form of Joan.\r\n\r\n      He pauses, leans towards her, and with a threatening gesture\r\n      shouts at Joan:\r\n\r\n                It is to you, Joan, I am talking...\r\n                it is to you I say that your king\r\n                is a heretic!\r\n<b>                                                                33.\r\n</b>\r\n\r\n137   Now Joan turns towards him. She can withstand all his\r\n      invective, when it is her own person and her own honor that\r\n      are at stake; but this accusation directed at her king deeply\r\n      outrages Joan's love of France and of Charles, the king. Her\r\n      expression is one of anger and indignation as she says:\r\n\r\n                Indeed, my lord, I am ready to\r\n                maintain, even at the risk of my\r\n                life, that my king is the noblest\r\n                man in all Christendom...\r\n\r\n138   A ripple of applause can be heard among the spectators. The\r\n      soldiers, who are standing side by side in closed ranks, turn\r\n      threateningly.\r\n\r\n139   Thrown out of his stride by Joan's answer, the preacher\r\n      embarks on a tirade, which Joan answers confidently; finally,\r\n      not knowing how to respond, he shouts to Massieu:\r\n\r\n                Make her be quiet!\r\n\r\n      The spectators derive much derisive enjoyment from this\r\n      little scene.\r\n\r\n      Order has been restored on the platform. Massieu has\r\n      persuaded Joan to keep quiet. The preacher is approaching his\r\n      peroration. He points to the judges and declares they have\r\n      proved incontestably that Joan has violated the Church's\r\n      doctrines in deed as well as in word; and asks her if she has\r\n      anything to say in answer to this. She reflects for a moment\r\n      and, while the spectators stand on tiptoe to see what is\r\n      happening, she rises to her feet and says:\r\n\r\n                I alone am responsible for\r\n                everything that I have said and\r\n                done ...\r\n\r\n      Joan draws a deep breath before continuing. All those\r\n      standing round her gaze at her expectantly. Then she says:\r\n\r\n                ... If have done any wrong, I am to\r\n                blame, and nobody else!\r\n\r\n140   She sits down calmly. Erard, however, is almost inclined to\r\n      interpret her words as a declaration that she is now ready to\r\n      recognize the error of her ways. He leans forward towards the\r\n      notary, who hands her a paper. Several of the judges have\r\n      come forward, also one of Warwick's secretaries. There is so\r\n      much tumult and confusion round Joan that she has difficulty\r\n      hearing. Sommaire explains:\r\n\r\n                It is the abjuration ...\r\n<b>                                                              34.\r\n</b>\r\n\r\n      Joan does not understand what this means. What is the meaning\r\n      of 'abjure'? She turns to Erard to ask his advice.\r\n\r\n                Explain it to her!\r\n\r\n      Erard orders Massieu. The latter asks to be excused, but\r\n      after glancing at Erard he does not dare to insist, and is\r\n      obliged to advise Joan of the danger she will incur by\r\n      refusing. He says to her:\r\n\r\n                If you do not sign you will be\r\n                burnt!\r\n\r\n141   Among the crowd thronging the place the word 'burnt' can be\r\n      heard flying from mouth to mouth. Around Joan on the platform\r\n      the air is filled with shouted words. Joan asks Massieu for\r\n      advice; he tells her that when the Church advises her to sign\r\n      she must do so. Once again she turns to Erard and asks him to\r\n      tell her whether she must abjure. He answers:\r\n\r\n                Either you sign - or you will go to\r\n                the stake!\r\n\r\n      and he points at the executioner, who at this moment\r\n      approaches at a sign from Warwick. Now Joan understands the\r\n      cruel death in store for her, and she is afraid. Jesus Christ\r\n      also was afraid when He learned that His hour was come. Fear\r\n      has overcome her spirit and is affecting her feelings as well\r\n      as her judgement; with the threat of the stake hanging over\r\n      her she now begins to consider the proposition which has been\r\n      put to her. Almost unconsciously she turns her face towards\r\n      the grave. She sees shovelful after shovelful of earth piling\r\n      up ... a human skull appears among the lumps of soil. Worms\r\n      are writhing in the eye-sockets. The spectators shout:\r\n\r\n                Sign, Joan, sign!\r\n\r\n142   But she does not hear them. She is breathing heavily and\r\n      feeling giddy. She looks vacantly at her surroundings like\r\n      somebody coming out of a faint, not knowing where he is. In a\r\n      whisper which is barely audible to anybody but herself she\r\n      says:\r\n\r\n                I have done no wrong ... I believe\r\n                in the twelve articles of the Creed\r\n                and in God's Ten Commandments!\r\n\r\n143   Even Erard's heart bleeds at the sight of such deep\r\n      unhappiness. His tone changes, and his voice becomes almost\r\n      syrupy as he says:\r\n\r\n                Joan, we have great sympathy for\r\n                you!\r\n<b>                                                              35.\r\n</b>\r\n\r\n      Warwick gives a sign to the executioner, who is approaching\r\n      with a rope.\r\n\r\n144   Now Loiseleur mounts the platform and takes up a position on\r\n      the other side of Joan. He says to her in a low voice:\r\n\r\n                You have no right to die ... you\r\n                must continue to fight for France\r\n                ... for the King of France.\r\n\r\n      Joan feels a pang in the pit of her stomach when he\r\n      pronounces the name of her country and her king, which mean\r\n      everything to her and are never out of her thoughts.\r\n\r\n145   The spectators follow with anxiety and deep involvement\r\n      everything taking place on the platform. Those standing round\r\n      her, who have witnessed her fear, make all kinds of golden\r\n      promises if only she will consent to sign. Cries of 'Sign,\r\n      sign!' resound from mouth to mouth, and Loiseleur urges her\r\n      earnestly to follow this advice.\r\n\r\n      Joan is dazed, and no longer understands a thing. Anxiously\r\n      she explores the eyes of those standing round her. Her\r\n      terrible uncertainty is reflected in her expression. The\r\n      moment has arrived when she begins to yield to the\r\n      unremitting pressure. And when, at this very moment, the\r\n      executioner rises up before her, she surrenders.\r\n\r\n146   She casts a frightened glance at her surroundings; then she\r\n      slowly kneels and bows her head. Sommaire seizes the document\r\n      which has been placed in front of Joan for her signature and\r\n      reads it aloud, sentence by sentence. Sentence by sentence\r\n      Joan repeats his words, smiling feebly and speaking in a\r\n      peculiar mechanical way which betrays the fact that she is\r\n      far away, absorbed in her own thoughts. During the reading\r\n      Erard gestures with the pen to the larger platform to inform\r\n      the judges that Joan is going to sign. The tension among the\r\n      spectators is at breaking point.\r\n\r\n      The reading is concluded. Joan gets to her feet. Erard puts a\r\n      pen in her hand; round Joan the excitement is palpable.\r\n      People seem to be afraid of her dying.\r\n\r\n147   But Joan is like somebody who has escaped from a great\r\n      danger, whose relief now finds expression in a tremendous\r\n      joy, almost resembling gaiety.\r\n<b>                                                               36.\r\n</b>\r\n\r\n148   She draws a circle, explaining as she does so that she is\r\n      unable to write. But this is not good enough for Erard. So\r\n      Loiseleur steps forward and guides Joan's hand, enabling her\r\n      to write the word JEHANNE, followed by a cross. When Joan has\r\n      signed, Erard, with the document raised over his head, gives\r\n      a wink of triumph to let the judges know that he has\r\n      succeeded in his task. The document passes from hand to hand\r\n      until it reaches Loiseleur, who says cheerfully to Joan:\r\n\r\n                You have done a good day's work\r\n                today ... you have saved your soul!\r\n\r\n149   And he hurries away to give Cauchon the document.\r\n\r\n      Among the spectators the tension is released in shouts of\r\n      joy. But one or two English soldiers, who have seen Joan's\r\n      smile, go up to her and shout at the priests around her:\r\n\r\n                She has only made fools of you!\r\n\r\n      The priests push them away. Cauchon, who has received the\r\n      document, now gives a signal for Joan to come forward and\r\n      hear her sentence of judgement.\r\n\r\n150   Joan descends from the platform, leaning on Massieu. In his\r\n      enthusiasm one of the spectators forgets himself and bursts\r\n      out:\r\n\r\n                Long live the Maid! ... Long live\r\n                France!\r\n\r\n      Two soldiers turn abruptly, force their way through the\r\n      crowd, seize the unfortunate man who has given vent to his\r\n      patriotic feelings, and lead him away.\r\n\r\n151   Joan has come before her judges' great platform. Cauchon\r\n      takes the document from his secretary and begins to read it\r\n      aloud:\r\n\r\n                In as much as you have at last\r\n                renounced the error of your ways,\r\n                we release you from excommunication\r\n                from the Church ...\r\n\r\n      Cauchon pauses for a moment. Joan stands before her judges\r\n      with folded hands. A smile of gratitude is sketched on her\r\n      face. She lowers her head to conceal her joy. Then Cauchon\r\n      continues:\r\n\r\n                But in as much as you have rashly\r\n                sinned we condemn you . ..\r\n\r\n      Joan looks up with an expression of fear and surprise.\r\n      Cauchon continues his reading:\r\n<b>                                                                37.\r\n</b>\r\n\r\n\r\n                     ... to perpetual imprisonment,\r\n                     there to eat the bread of sorrow\r\n                     and drink the water of affliction\r\n<b>                     ...\r\n</b>\r\n        Joan stands for a moment, dumbfounded. It is as if she cannot\r\n        grasp the meaning of what she has just heard. She feels as if\r\n        her heart is in her mouth. Her eyes have the expression of a\r\n        hunted animal. Then she hides her face in her hands and\r\n        weeps. Cauchon gives a sign for Joan to be led out. She\r\n        staggers away, leaning on Massieu's arm.\r\n\r\n<b>152-3   THE GATEWAY LEADING INTO THE CASTLE YARD\r\n</b>\r\n        Joan meets the two soldiers who earlier maintained that she\r\n        had made fools of her judges. They heap abuse upon her, and\r\n        Massieu has to protect her.\r\n\r\n<b>154     THE PRISON\r\n</b>\r\n        Joan is escorted in by the jailer. He makes her sit down on a\r\n        stool and starts cutting off her hair. Joan is seized by a\r\n        new and dispiriting fear. Although she is in pain, she\r\n        manages to weep inaudibly, sobbing without a sound. When her\r\n        weeping eases off for a moment she whispers:\r\n\r\n                     Oh, I am so tired, so tired ...\r\n\r\n        But the jailer is concentrating entirely on his work. The\r\n        locks of hair fall on the ground. Joan weeps ceaselessly. The\r\n        events in the churchyard pass in succession before her eyes,\r\n        but now she sees them in relation to one another, from a new\r\n        angle and with a sharper perception. She realizes that it is\r\n        the fear of death which has caused her to panic. She regards\r\n        what she has done as the greatest sin she has ever committed.\r\n        She is unable to forgive herself for having told lies through\r\n        fear of death. Bitter are the tears which well from her eyes,\r\n        from sources almost dried up, as Joan asks herself how she\r\n        may still atone for her sin and repair the damage she has\r\n        done. She turns to the jailer and says with an air of\r\n        entreaty:\r\n\r\n                     Oh, I am so tired ...\r\n\r\n        The jailer mumbles something incomprehensible. Sympathy is\r\n        not to be expected from this quarter. Joan feels like an\r\n        outcast; it is hard to imagine a greater humiliation for a\r\n        woman than to be shorn of her hair. And Joan is a woman.\r\n\r\n        At last the cutting operation is concluded.\r\n<b>                                                                38.\r\n</b>\r\n\r\n155   Joan gets up and sits on her bed. She is like somebody who is\r\n      on the verge of collapse from lack of sleep, and who does\r\n      mechanically whatever he is told. Unconsciously she raises\r\n      her hands to her face, shudders and looks at her hands with\r\n      dread, as if they were unclean. She feels ashamed. What has\r\n      she done? She has denied her God. She thinks of Peter's\r\n      denial, of his threefold denial before cock-crow.\r\n\r\n156   The jailer, who has left Joan by herself for a moment, now\r\n      returns with a broom. Almost without thinking, and with a\r\n      melancholy smile, Joan follows the broom as it sweeps up her\r\n      hair - hair from Orléans and from Rheims. The jailer sweeps\r\n      it up onto a shovel. He glances round the cell to see if\r\n      there is anything else he can sweep up while he is about it.\r\n      His eye falls on the plaited straw crown, the martyr's crown,\r\n      which has landed in a corner. Joan sees the broom gathering\r\n      in the crown. That too! It is as if in this little incident\r\n      Joan sees a sign from God. She bitterly laments the glory she\r\n      has lost by her abjuration.\r\n\r\n      The jailer leaves the cell. Joan sits by herself.   She thinks\r\n      of what she has done. This document signed by her   hand is a\r\n      denial, a denial of God. How she wishes she could   tear it to\r\n      shreds! She is in consternation over the enormity   of her sin.\r\n      Her soul is drowning in remorse. She flushes, she   shakes her\r\n      head violently: No! No! No!\r\n\r\n      She strikes her breast. She feels that she is damned\r\n      eternally, eternally abandoned by God. She raises her head in\r\n      bewilderment. She thinks of Hell. She stands up as if to cry\r\n      out in remorse. Then suddenly she recalls the executioner and\r\n      the stake at which her flesh will burn. She collapses again\r\n      on her bed. She sits there in agony, her head hidden in her\r\n      hands. The door opens. The jailer comes in. Now Joan rises,\r\n      having made her decision. She hurries over to the jailer and\r\n      shouts :\r\n\r\n                Go and fetch the judges ... I take\r\n                back ... I regret ... I have lied\r\n<b>                ...\r\n</b>\r\n      She looks at him with tear-stained eyes and gives him a push\r\n      to make him go and tell the prelates. She is seized by a\r\n      deadly fear, she is terrified that a new fit of weakness will\r\n      master her before she can put into effect the decision she\r\n      has just made. She knows that this decision will probably\r\n      lead to her death, but this she feels strong enough to meet.\r\n      And now that the first step has been taken she trembles with\r\n      impatience. She is weary of the struggle and longs to be\r\n      free.\r\n<b>                                                              39.\r\n</b>\r\n\r\n157   The spectators of the scene in the churchyard have still not\r\n      returned to the town, but have encamped in a large open space\r\n      where booths selling cider and other drinks have been set up.\r\n      They are grouped in families on the grass, some of them are\r\n      crowding round the booths, and the younger ones are dancing\r\n      and singing to the sound of music.\r\n\r\n      The preceding prison scenes alternate with short shots of\r\n      this folklife: dancing bears - acrobats - jugglers - a\r\n      musician - a hobby-horse - a dance-leader - a man with a\r\n      stick over his shoulder and a cask hanging from the stick -\r\n      penny in the bucket - another musician who has fastened\r\n      together a drum and a flute, which he holds in the left hand,\r\n      with the drum-stick in his right. A wild dance - a man\r\n      selling birds - dwarfs - contortionists.\r\n\r\n      The following prison scene is interrupted by glimpses of the\r\n      preparations round the bonfire which is to be lit in the\r\n      castle yard: a man carrying firewood to the stake, a broken\r\n      carriage-wheel in the fuel, etc.\r\n\r\n158   The jailer now finds Cauchon in conversation with Warwick at\r\n      the entrance to the chapel. The jailer explains briefly what\r\n      has happened in the prison. Warwick and Cauchon exchange\r\n      eloquent glances. At the same moment Loiseleur comes out from\r\n      the chapel. In a few words Cauchon puts him in the picture\r\n      and tells him to assemble some of the judges and notaries.\r\n\r\n159   Meanwhile Joan sits waiting impatiently in her prison. It is\r\n      evident that she does not make a sacrifice such as hers\r\n      without doing her nature an injury. She is racked by deep\r\n      despair and her nerves show it. She shivers; her teeth\r\n      chatter. She wrings her hands so that her knuckles are\r\n      completely white.\r\n\r\n160   Finally Cauchon enters, followed by various judges and\r\n      notaries. They find the young girl dissolved in tears, her\r\n      face contorted. It is a poor, helpless girl of twenty whom\r\n      they have defeated.\r\n\r\n      During the following scene Cauchon exudes an air of\r\n      benevolence and satisfaction. In contrast with his earlier\r\n      demeanor he is now calm and equable. His feelings are\r\n      pleasurable, but it is not a malicious pleasure; he is sure\r\n      of his prey!\r\n\r\n      They sit down, and Cauchon asks Joan why she has sent for\r\n      them. With a sob, but also with an expression of\r\n      determination, she answers:\r\n\r\n                I have committed a great sin ...\r\n\r\n      She has to break off, choked by tears.\r\n<b>                                                              40.\r\n</b>\r\n\r\n161   The judges comfort her and try to alleviate her grief, so\r\n      that she can continue:\r\n\r\n                ... I have denied God in order to\r\n                save my life.\r\n\r\n      The judges look at one another. Not one of them is so hard-\r\n      hearted as to be untouched by the young woman's genuine\r\n      distress.\r\n\r\n162   Even Cauchon is moved. It is a moment before he speaks. Then\r\n      he says:\r\n\r\n                So you still believe that you are\r\n                sent by God?\r\n\r\n      Joan nods in confirmation.\r\n\r\n163   Again the judges exchange looks. The notary raises his head\r\n      from his book. He examines the judges' faces searchingly,\r\n      looks at Joan and writes in his notes: 'Fatal answer.'\r\n      Cauchon has stood up. However dulled his human feelings may\r\n      be, it still goes against the grain with him to send Joan to\r\n      the stake, even though she herself is asking to die. He says\r\n      in a friendly tone:\r\n\r\n                But, Joan, you have admitted in\r\n                front of everybody that you were\r\n                misled by the Devil.\r\n\r\n      Joan, who has gradually regained her self-control, does not\r\n      answer immediately. It is only when the judges press her that\r\n      she replies:\r\n\r\n                Everything I said was for fear of\r\n                the stake!\r\n\r\n      Cauchon holds a whispered consultation with the others, but\r\n      it is clear that they all regard it as wasted effort to\r\n      continue. Cauchon says:\r\n\r\n                Have you anything else to tell us?\r\n\r\n      Joan shakes her head. The judges rise to go. When Cauchon\r\n      goes into the adjoining room his eye falls on Warwick, who\r\n      has just come up the stairs and now gives Cauchon a look of\r\n      enquiry. Cauchon merely says:\r\n\r\n                It is all over!\r\n\r\n      Warwick receives the news with no indication of surprise.\r\n<b>                                                                 41.\r\n</b>\r\n\r\n      Meanwhile the judges have started to go down the stairs, when\r\n      Cauchon holds the last two back. They are Ladvenu and\r\n      Massieu. Cauchon drops his voice and gives them an order.\r\n\r\n164   The two monks go into the cell, where they find Joan sitting\r\n      with her hands in her lap. She is now calm and decided. What\r\n      is she thinking about? About her home in Domrémy - or about\r\n      death? Massieu and Ladvenu remain standing by the door. Joan\r\n      does not see them, so preoccupied is she with her own\r\n      thoughts. They approach with cautious steps, as people do\r\n      involuntarily in the house of death. Ladvenu calls to her.\r\n      She looks up, surprised to see him. Then Ladvenu says:\r\n\r\n                Joan, I have come to prepare you\r\n                for death!\r\n\r\n      For a moment silence reigns, so deep that Joan's breathing\r\n      can be heard. Then she says in a barely audible voice:\r\n\r\n                Now ... already?\r\n\r\n      Ladvenu, struggling with the tears which are muffling his\r\n      voice, answers yes. Another long, long silence. Then Joan\r\n      asks, almost as if fearing the answer:\r\n\r\n                What kind of death?\r\n\r\n      Ladvenu, choked by his feelings, is unable to speak. He makes\r\n      a sign for Massieu to answer on his behalf. Massieu says:\r\n\r\n                At the stake!\r\n\r\n      A slight shudder passes over Joan's face, but in her soul\r\n      there is no longer any struggle or doubt.\r\n\r\n165   Ladvenu, who has now regained his self-control, gives Massieu\r\n      a quiet order. Massieu goes out hurriedly. When he has gone\r\n      Ladvenu says:\r\n\r\n                How can you still believe that you\r\n                are sent by God?\r\n\r\n      Joan smiles, as if she knows more than other men, and\r\n      answers:\r\n\r\n                His ways are not our ways!\r\n\r\n      After a pause she adds:\r\n\r\n                Yes, I am His child!\r\n\r\n      Ladvenu, moved by this persistent faith, says presently:\r\n\r\n                And the great victory?\r\n<b>                                                               42.\r\n</b>\r\n\r\n      Joan looks at him as if amazed at his asking such a stupid\r\n      question. She answers:\r\n\r\n                My martyrdom ...\r\n\r\n      Ladvenu nods. He looks at her as at a saint descended from\r\n      heaven. Yet he cannot refrain from asking one more question:\r\n\r\n                And your release?\r\n\r\n      Joan answers with a look of ecstasy in her eyes:\r\n\r\n                ... Death ... !\r\n\r\n      Her purity and the sincerity of her faith in God are almost\r\n      dazzling to Ladvenu. He gets up. He pities the unhappy Joan,\r\n      and is troubled over this soul which is endangered beyond\r\n      hope of salvation. He turns to Joan and asks her if she wants\r\n      to confess. She accepts his offer gratefully and kneels.\r\n\r\n166   Massieu has gone to fetch the Eucharist. A procession of\r\n      priests, wearing surplices and stoles, and carrying lights in\r\n      their hands, comes out of the chapel and goes in the\r\n      direction of the castle yard, singing litanies.\r\n\r\n167   Everyone in the castle yard kneels; the women are in tears.\r\n      To every entreaty the priests answer:\r\n\r\n                Pray for her!\r\n\r\n168   Presently the procession arrives at Joan's cell, and she\r\n      prepares to receive the Eucharist. Ladvenu takes the\r\n      consecrated Host in his hands, shows it to Joan and says:\r\n\r\n                Do you believe that this is the\r\n                Body of Christ?\r\n\r\n      Joan receives the Body of Christ with touching meekness. She\r\n      weeps copiously as once again she finds Him from whom she has\r\n      so long been kept apart. In the fullness of her heart she\r\n      raises her voice and offers to Jesus prayers of a childlike\r\n      gentleness and moving quality. The cell door stands open.\r\n\r\n169   In the ante-room Loiseleur has come into view. He hears Joan\r\n      talking with her Savior and is deeply moved. Even this man's\r\n      eyes well over with tears. He is afraid he will be unable to\r\n      stifle his emotion and withdraws.\r\n\r\n170   The solemn ceremony is over. The monks leave.\r\n\r\n171   The jailer comes in with a coat which Joan is to wear.\r\n<b>                                                                 43.\r\n</b>\r\n\r\n172   Meanwhile rumors are circulating among the crowd in the area\r\n      behind the churchyard that Joan has withdrawn her abjuration.\r\n      Now they set out in swarms for the castle, pressing over the\r\n      lowered drawbridge leading into the castle yard, where the\r\n      English soldiers control the flow in such a way that they\r\n      keep the invaders concentrated in one corner of the yard.\r\n      Through the gate hundreds of curious sightseers can be seen\r\n      climbing up into trees and standing on the parapets of the\r\n      bridge in the hope of seeing a tiny fragment of the\r\n      unaccustomed spectacle.\r\n\r\n173   In between, scenes from the prison are shown. Joan is wearing\r\n      a coat that comes down to her feet, which are bare. Her\r\n      earlier calm seems to have disappeared. She prays and weeps\r\n      incessantly. Ladvenu and Massieu, who have returned to fetch\r\n      her, lead her away.\r\n\r\n174   Joan has arrived at the castle yard. In her coat she appears\r\n      to many of those present as a vision from God. An old woman\r\n      approaches, hands Joan a cup of milk, weeps and kneels. The\r\n      poor child, who is herself in need of comfort, offers the\r\n      woman such comfort as she can, but the English soldiers put\r\n      an end to this scene.\r\n\r\n175   The stake is erected in the middle of the castle yard.*** The\r\n      fuel is piled up on a foundation of stone. The post to which\r\n      the victim is to be tied projects over the fuel. The\r\n      intention is for thousands of people to witness with their\r\n      own eyes that the Maid has really been burnt. A notice-board\r\n      is fastened to the stake, with the following inscription:\r\n      'Heretic, Relapsed, Apostate, Idolatress.'\r\n\r\n      Further away there is a platform for the judges and the\r\n      English nobility; another is reserved for the preacher and\r\n      for spectators.\r\n\r\n176   When Joan has taken her place at the stake one of the judges,\r\n      Nicolas Midi, stands and begins his sermon:\r\n\r\n                In the name of the Lord, amen!\r\n\r\n177   For Joan it is as if his voice has reached her from far away.\r\n      She weeps incessantly, as she watches the executioner's final\r\n      preparations; she sees him bending over\r\n\r\n178   His coal-bucket; later she sees him, with a knife in his\r\n      mouth, uncoiling the rope which is to fasten her to the\r\n      stake.\r\n\r\n179   Nicolas Midi continues his sermon:\r\n\r\n                ... Like a rotten member we cut you\r\n                off from the body of the Church.\r\n<b>                                                              44.\r\n</b>\r\n\r\n      The preacher turns to face Joan directly; she listens\r\n      attentively and gives an unconscious nod. At the same moment\r\n      she sees a flock of doves taking off and flying into the\r\n      heavens. Then Nicolas Midi ends his short address:\r\n\r\n                Joan, go forth in peace ... the\r\n                Church is unable to protect you!\r\n\r\n      Joan, who retains to the end her respect for the Church's\r\n      servants, inclines politely and gratefully in his direction.\r\n\r\n180   In a loud voice she prays:\r\n\r\n                Dear God, I accept my death\r\n                willingly and gladly ...\r\n\r\n      Her face becomes more serious and more anguished; she\r\n      continues:\r\n\r\n                ... but I entreat Thee, if Thou\r\n                lovest me, that my suffering may be\r\n                short ...\r\n\r\n181   Her lament, mild but strongly spoken, rings through the\r\n      hushed square. Everyone holds his breath to hear the\r\n      condemned Joan's last words; every eye turns towards her and\r\n      watches for her smallest movement. They are deeply affected\r\n      by the simplicity she shows, face to face with death. Many\r\n      are in tears, even some of the English soldiers.\r\n\r\n182   At the end of her prayer she says to Ladvenu, with tears in\r\n      her eyes:\r\n\r\n                Where will I be tonight?\r\n\r\n      Ladvenu exhorts her to have faith in God: with the help of\r\n      the Almighty she will attain her place in Paradise. The\r\n      English soldiers grow impatient, and one of their officers\r\n      approaches the platform and says:\r\n\r\n                Look here, priest, are you going to\r\n                be all day?\r\n\r\n183   Ladvenu insists on his right to prepare the young woman for\r\n      death. And he says to Massieu, who is bringing him a small\r\n      missal:\r\n\r\n                Joan wishes to have a cross with\r\n                her when she dies!\r\n<b>                                                               45.\r\n</b>\r\n\r\n184   Ladvenu instructs Massieu to fetch one from the chapel, and\r\n      with the little missal in his hand he reads the prayers for\r\n      those under sentence of death.\r\n\r\n      One of the English soldiers has heard Ladvenu's words to\r\n      Massieu. He extracts two bits of wood from a faggot lying\r\n      ready for the bonfire, and joins them so that they form a\r\n      modest little cross.\r\n\r\n185   Joan, who has followed his movements, is touched. She takes\r\n      the cross lovingly and reverently, and covers it with kisses.\r\n\r\n186   The English captain is now losing patience, and orders the\r\n      executioner to do his duty.\r\n\r\n187   Massieu returns with the processional cross. He shows it to\r\n      Joan; she is inexpressibly happy as she takes it with both\r\n      hands, kisses it with tears in her eyes, and addresses ardent\r\n      prayers to it.\r\n\r\n188   Now her eye falls on the executioner, who has climbed up on\r\n      the other side of her in order to tie her to the stake. He\r\n      drops the rope; she picks it up. She is bound brutally to the\r\n      stake.\r\n\r\n      Ladvenu remains standing. During Joan's prayer he remains\r\n      holding the crucifix in front of her, so that throughout she\r\n      can see her Savior. When the executioner has secured Joan he\r\n      descends. Ladvenu continues to speak words of comfort to\r\n      Joan.\r\n\r\n      All around her are now in tears. Loiseleur weeps. Even\r\n      Cauchon weeps. The executioner has made his final\r\n      preparations.\r\n\r\n189   In his hand he holds the flaming torch which is to set the\r\n      bonfire alight.\r\n\r\n190   Joan suddenly catches sight of the fire, but her first\r\n      thought is not for herself: she thinks only of Ladvenu, who\r\n      seems to have forgotten the danger he is exposed to. She\r\n      shouts to him:\r\n\r\n                The fire! Get down!\r\n\r\n191   But she implores him urgently to continue right up to the end\r\n      holding the cross raised before her eyes.\r\n\r\n192   The flames crackle and climb higher.\r\n<b>                                                              46.\r\n</b>\r\n\r\n193   Suddenly a deathly hush descends on the square. A dull\r\n      silence. Only the crackle of the flames and the mumbled\r\n      prayers of the priests can be heard. Oppressed by this\r\n      stillness, some of the spectators fall on their knees, and\r\n      others follow their example. Many of them light wax candles.\r\n\r\n194   The flames leap from one faggot to another ... they advance\r\n      in little jumps over cavities and gaps in the fuel. Sparks\r\n      fly, smoke whirls up; through the smoke, which occasionally\r\n      conceals Joan, can be seen part of her\r\n\r\n195   Face, which is raised to heaven, and her mouth, which is\r\n      whispering prayers. Then her eyes seek Christ, whom Ladvenu\r\n      continues to hold up towards her; Christ who, like herself,\r\n      is enveloped in smoke.\r\n\r\n196   Through the smoke she sees the executioner stirring the fire,\r\n\r\n197   And a soldier on his knees trying to get near enough to the\r\n      bonfire to throw the martyr's crown on it.\r\n\r\n198   She also sees Massieu, who is sprinkling holy water on the\r\n      bonfire from his stoup.\r\n\r\n199   Meanwhile the judges have risen. The clerics are not allowed\r\n      to witness the actual execution, but their departure is in\r\n      the nature of a flight. The eyes of most of them are filled\r\n      with tears. They all cross themselves as they withdraw.\r\n\r\n200   The English soldiers force a way for them through the crowd,\r\n      but as the priests approach the spectators the latter draw\r\n      back of their own accord to avoid contact with them. On every\r\n      face you can read contempt, in every quarter you can hear the\r\n      traitors being taunted as such.\r\n\r\n201   Suddenly the first tongues of flame lick round Joan's feet.\r\n      She squirms. The things of this earth are vanishing, and\r\n      Joan's thoughts are now only of the King of Heaven. In spite\r\n      of the pain and terror she does not forget her Christ -\r\n      indeed it is as if, with every second that passes, she is\r\n      coming steadily closer to Him.\r\n\r\n                Jesus!\r\n\r\n      she begins to scream in her long death-struggle.\r\n\r\n202   The weeping crowds repeat the name of Jesus.\r\n\r\n203   Innumerable tongues of flame, growing constantly in size,\r\n      number and fierceness, are now fanning round her.\r\n\r\n204   The rope binding her to the stake begins to burn.\r\n<b>                                                              47.\r\n</b>\r\n\r\n205   Joan is frantic with terror:\r\n\r\n                Jesus!\r\n\r\n      she screams in her agony.\r\n\r\n206   The echo repeats her cry in the sad and silent square. The\r\n      bystanders pray in chorus, while the women weep and wail:\r\n\r\n                Intercede for us ...\r\n\r\n      Others continue:\r\n\r\n                ... now and in our last hour.\r\n\r\n207   Joan's coat is already in flames, consumed by the fire as far\r\n      as the knees. Her feet are burning.\r\n\r\n208   But the executioner continues piling fuel on the bonfire. An\r\n      ominous, infernal silence prevails.\r\n\r\n209   Joan screams:\r\n\r\n                Jesus!   Jesus!\r\n\r\n210   But the bystanders, who during these final scenes stand as if\r\n      paralyzed by the fire and by Joan's cries, are seized by a\r\n      mood compounded of fear and ecstasy. Outbursts of anger and\r\n      indignation against the oppressors can already be heard. The\r\n      English soldiers take up a threatening posture.\r\n\r\n211   The flames climb steadily higher.\r\n\r\n212   The notice-board fastened over Joan's head goes up in flames\r\n      and falls into the bonfire.\r\n\r\n213   A last vision is caught of Joan's face, contorted in terror.\r\n      She pronounces once more the name of Jesus, lets her head\r\n      slump and gives up the ghost. The tumult grows among the\r\n      bystanders, clenched fists are raised in the air.\r\n\r\n214   Threatening words can be heard. Then somebody in the crowd\r\n      gives free expression to what everybody is thinking and\r\n      shouts:\r\n\r\n                You have burnt a saint!\r\n\r\n      The cry is taken up, until it is heard from every throat.\r\n\r\n215   The rope fastening Joan to the stake has burnt through and\r\n      falls in ashes. Joan's body totters and sinks into the\r\n      bonfire.\r\n<b>                                                              48.\r\n</b>\r\n\r\n216   At a sign from Warwick the soldiers pursue the mob out of the\r\n      castle yard with thrusts of their lances, through the gate\r\n      and over the drawbridge, which is then raised. Many fall\r\n      victim to the soldiers' brutality or are trampled to death.\r\n\r\n217   The smoke rises in a column, concealing Joan.\r\n\r\n218   On Warwick's orders the executioner rakes through the fire.\r\n      Normally no trace of Joan should remain - but what is this?\r\n      Joan's heart is undamaged. He shows it to Warwick and pours\r\n      oil on the flames, but still the heart will not catch fire.\r\n      He tries in vain, with the help of sulphur and coal, to make\r\n      it burn: the flame leaps up, guided by his expert hand, but\r\n      when the fire subsides again the executioner finds the heart\r\n      still intact. Convinced that he is witnessing a manifest\r\n      miracle, he looks questioningly at Warwick, who answers\r\n      curtly:\r\n\r\n                Throw this lot in the Seine!\r\n\r\n219   In his anguish the executioner falls on his knees before\r\n      Ladvenu, terrified that he will be condemned for having burnt\r\n      a saint.\r\n\r\n                As the sun went down Joan's heart\r\n                was sunk in the river, the heart\r\n                which from that time became the\r\n                heart of France, just as she\r\n                herself was the incarnation of the\r\n                eternal France.\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Passion-of-Joan-of-Arc,-The.jpg\"/>\n</td><td><h1>Passion of Joan of Arc, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Joseph Delteil\" title=\"Scripts by Joseph Delteil\">Joseph Delteil</a>  <a href=\"/writer.php?w=Carl Theodor Dreyer\" title=\"Scripts by Carl Theodor Dreyer\">Carl Theodor Dreyer</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Passion of Joan of Arc, The Script.html#comments\" title=\"Passion of Joan of Arc, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:13:11.950062"}