{"title": "Patriot, The", "film_link": "/Movie Scripts/Patriot, The Script.html", "script_link": "/scripts/Patriot,-The.html", "info_raw": "\n\nPatriot, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.07 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Robert Rodat\nGenres  Action  Drama  War\nScript Date : March 1999\n\nRead \"Patriot, The\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>\n<b>/*\n</b>Break-out-of-frames script\nBy Website Abstraction (http://wsabstract.com)\nOver 400+ free scripts here!\nAbove notice MUST stay entact for use\n<b>*/\n</b>\nif (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nPatriot - 1998 Draft\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t    THE PATRIOT\n\n\n\t\t\t\t    by\n\n\t\t\t\t    Robert Rodat\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t   October 9, 1998\n\n\n\n\n\n\nFADE IN:\n\nCREDITS OVER:\n\nEXT.  SOUTH CAROLINA COUNTRYSIDE - DAY\n\nWoodlands.  Beautiful.  Untamed.  Soaring old-growth elms\narch over riverside maples along the shores of the gently\ncurving, deep-water Santee River.\n\nSUPERIMPOSITION:\n\n\t\t\t\t  SOUTH CAROLINA\n\t\t\t\t    April, 1776\n\nUpstream, the swamps.  Beautiful.  Hundreds of BIRDS SING.\nShafts of sunlight pierce the canopy, cutting through the\nhanging moss and kudzu, falling onto soft, swaying ferns\ncovering the high ground.\n\nThe water is clear, with fields of floating lily pads,\neach with a stark white flower rising from it.\n\nSUPERIMPOSITION:\n\n\t\t THE FOLLOWING IS BASED ON A\n\t\t\tTRUE STORY\n\nEXT.  POND BLUFF - DAY\n\nA farm built between the banks of the river and the deep\ngreen of the swamps.  Good, fertile land, hacked out of\nthe wilderness.\n\nThe perfectly tended fields are ripe with barley, hops,\nalfalfa and tobacco.  Two sturdy brothers, NATHAN, 13 and\nSAMUEL, 12, work one of the fields, rhythmically swinging\nscythes through the barley.\n\nThe house, built of native brick, is well-constructed and\nwell-maintained.  There's a barn, a workshop and a forge.\nIt is a home of substance rather than wealth.  On the\nfront porch, MARGARET, 11, pumps a butter churn while her\nbrother, WILLIAM, 6, watches.\n\nGABRIEL, 18, strong and handsome, walks out of the woods\nwith a musket in his hand and a dozen game-birds over his\nshoulder.  At his side walks THOMAS, 14, also carrying a\nmusket.\n\nINT.  WORKSHOP - DAY\n\nA perfect colonial workshop, fastidiously arranged with\nevery conceivable tool of the period.  A foot-powered\nlathe.  A drop-forge.  A lifting saw.  Racks of tools,\nplanes, hammers, augers, drills, blocks, all hanging in\ntheir places.  All very well-worn.\n\nFRANCIS MARION methodically works his lathe, turning a\npiece of hardwood, shaving off tiny curls of wood with a\nrazor-sharp chisel.  He's in his late-forties, strong and\nweathered.  His hands, though big and callused, handle the\nchisel with a surgeon's precision.  Self-educated and\nself-sufficient, he has built himself, as he built his\nfarm, brick by brick, from the coarse clay of the earth.\n\nA finely-made rocking chair, missing only the dowel on\nwhich Marion is working, sits on the work table.  The\nchair is a work of art, thin and light, a spider-web of\nperfectly turned wood, no nails, no glue.\n\nSitting on the woodpile, SUSAN, 4, a silent, stone-face\nwisp of a child, watches her father.\n\nMarion takes the piece of wood out of the lathe, carefully\nfits it into the chair, inserts a peg and taps it into\nplace.  Then he steps back and appraises his handiwork.\n\nHe picks up the chair and hooks the top rail to a scale,\ncountering with a three-pound weight.  The chair floats.\n\nMarion blows softly on the weight which sinks.  Susan\nnods, so far, so good.  Marion puts the chair on the floor\nand walks slowly around it, checking every angle.\n\nThen, the acid test.  He takes a deep breath and lowers\nhimself onto the seat, gingerly adding an ounce at a time.\nNot a creak.  He smiles and sits back with a sigh.\n\nCRACK!  THE CHAIR SPLINTERS under Marion's weight, DUMPING\nHIM on his ass on a pile of broken wood.\n\n\t\t\t\tMARION\n\t\tDamnation!\n\nHe picks up some of the wood, about to fling it across the\nroom but stops as Susan shoots him a disapproving look.\nHe calms himself.\n\n\t\t\t\tMARION\n\t\tSorry.\n\nSusan gets down from the woodpile and puts the remains of\nthe chair in the fireplace.  As she climbs back up to her\nperch, Marion steps over to his wood rack, extracts a\nfresh dowel, fits it into the lathe and starts all over\nagain.\n\nEND CREDITS.\n\nEXT.  WORKSHOP - DUSK\n\nMarion leaves the workshop with Susan at his side.  Nathan\nand Samuel walk past, exhausted from their day in the\nfield.\n\n\t\t\t\tNATHAN\n\t\tFather, I saw a post rider at the\n\t\thouse.\n\n\t\t\t\tMARION\n\t\tThank you.  Did you finish the upper\n\t\tfield?\n\n\t\t\t\tSAMUEL\n\t\tWe got it all cut and we bundled\n\t\thalf of it.\n\n\t\t\t\tMARION\n\t\tThose swimming breaks cut into the\n\t\tday, don't they?\n\nMarion walks on without waiting for a reply from his\ncontrite sons who jostle one another, trying to pass off\nthe blame.  Gabriel and Thomas walk out of the barn.\n\n\t\t\t\tGABRIEL\n\t\tFather, a post rider came from\n\t\tCharleston.  You have a letter\n\t\tinside.\n\n\t\t\t\tMARION\n\t\tThank you.  How's the spotted one's\n\t\tmilk?\n\n\t\t\t\tTHOMAS\n\t\tBetter.  She's near ready to calve.\n\nMarion nods and motions for Susan to go with Gabriel and\nThomas to the house.  She does so and Marion walks on\nalone toward:\n\nEXT.  HILLTOP - POND BLUFF - SUNSET\n\nThe loveliest spot on the farm.  A beautiful view of the\nhouse, barns, river, fields and hills beyond.  A\ngravestone stands in the shade of a single apple tree.  It\nreads:\n\n\t\tELIZABETH PUTNAM MARION   1738-1773\n\nAbove her name is a carving of the night sky, at the\ncenter of which is the NORTH STAR, steady and guiding.\n\nMarion approaches.  He gives himself a moment to look at\nthe grave, then he starts picking apples, speaking to the\ngravestone in a quiet voice that is more matter-of-fact\nthan sorrowful.\n\n\t\t\t\tMARION\n\t\t... and they bundled half... almost\n\t\tno trace of the boys you knew...\n\nA soft wind blows some dry leaves along the ground.\nMarion pauses as if listening to a spoken reply.\n\n\t\t\t\tMARION\n\t\t... no, she still hasn't spoken...\n\t\tMargaret was her age when you... I\n\t\tremember the time at the river when\n\t\twe couldn't find Catherine... you\n\t\tcouldn't stop crying... and she was\n\t\tasleep in the wagon the entire\n\t\ttime...\n\nMarion pauses, remembering.  The CRASH OF A PLATE\nBREAKING, followed by the SOUND OF AN ARGUMENT rises from\nthe house below.  Marion shakes his head with an\nexasperated sigh.\n\n\t\t\t\tMARION\n\t\tYour children.\n\nHe heads down the hill toward the house, now glowing from\nthe lights of candles and oil lamps.\n\nINT.  MARION'S HOUSE - EVENING\n\nPre-dinner chaos.  Everyone talking at once.  Marion's\nseven children and his two family servants, ABIGAIL and\nAARON, a middle-aged black couple, prepare dinner.  Susan\nsilently watches from the stairs.  Marion walks in.\n\n\t\t\t\tMARION\n\t\tI smell turnips...\n\n\t\t\t\tWILLIAM\n\t\tFather, Samuel broke the blue\n\t\tplate...\n\n\t\t\t\tSAMUEL\n\t\tI did not...\n\n\t\t\t\tMARGARET\n\t\tDinner...\n\nMarion hands the apples to Abigail and steps over to open\nhis mail and dispatches.\n\n\t\t\t\tGABRIEL\n\t\tNews of Boston, father?\n\n\t\t\t\tNATHAN\n\t\tI hate turnips...\n\n\t\t\t\tSAMUEL\n\t\tWilliam knocked it right out of my\n\t\thands...\n\n\t\t\t\tGABRIEL\n\t\tFather...?\n\n\t\t\t\tMARION\n\t\tSamuel, William, both of you clean\n\t\tit up...\n\nMarion hands a packet of pamphlets to Gabriel and opens a\nletter.\n\n\t\t\t\tMARION\n\t\tThe Assembly has been reconvened,\n\t\tI've been called to...\n\nMarion's children go wild.\n\n\t\t\t\tMARGARET\n\t\tCharleston!\n\n\t\t\t\tNATHAN\n\t\tWe're going to Charleston!\n\n\t\t\t\tSAMUEL\n\t\tWhen, father, when?\n\n\t\t\t\tMARION\n\t\tWe'll leave tomorrow...\n\nThe children ERUPT INTO CHEERS and THUNDER into the dining\nroom.\n\n\t\t\t\tTHE CHILDREN\n\t\tCharleston!  We're going to\n\t\tCharleston!\n\nMarion and Gabriel exchange a stone-faced look.  Then\nMarion puts on a smile and inhales deeply.\n\n\t\t\t\tMARION\n\t\tI love turnips...\n\nMarion follows his children into the dining room.\n\nEXT.  MARION'S HOUSE - NIGHT\n\nQuiet.  The only sounds are the soft calls of a few\nNIGHTBIRDS and the DRONE OF CICADAS.  A faint light moves\nthrough the downstairs, passing windows in the otherwise\ndark house.\n\nINT.  MARION'S HOUSE - NIGHT\n\nMarion, holding a candle, does a father's bedtime check.\nThe CAMERA FOLLOWS him as he makes his rounds into:\n\nTHE KITCHEN.  Everything is clean and put away in its\nproper place.\n\nTHE MAIN HALLWAY.  Marion checks that the doors are closed\nand bolted.  He heads up the stairs.\n\nINT.  BOYS' BEDROOM - NIGHT\n\nMarion enters, finding William asleep on the floor and\nNathan and Samuel in bed.  He lifts William into bed,\ntakes a slingshot from Nathan's hand, tucks in Samuel and\nwalks out.\n\nINT.  GIRLS' BEDROOM - NIGHT\n\nMarion steps to the doorway, finding Margaret and Susan at\nthe window, looking up at the night sky.\n\n\t\t\t\tMARGARET\n\t\t... now count five finger lengths up\n\t\tfrom the front two stars of the Big\n\t\tDipper, and that's the North Star,\n\t\tthat's her.\n\nSusan gazes up at the North Star.  The girls notice Marion\nand climb into bed.  He puts a chair against Susan's bed\nand kisses her.  He pulls a blanket up around Margaret,\nwho whispers:\n\n\t\t\t\tMARGARET\n\t\tIt helps her to know Mother's there.\n\nMarion nods with a thin smile, kisses Margaret and walks\nout.\n\nINT.  MARION'S STUDY - NIGHT\n\nSquadrons of lead soldiers stand ready for battle as\nThomas, lying on the floor, deploys his men.  Gabriel\nreads the new pamphlets and broadsides.  Marion walks in\nand pours a drink.  Gabriel hands several of the pamphlets\nto his father.\n\n\t\t\t\tGABRIEL\n\t\tThe New York and Rhode Island\n\t\tassemblies have been dissolved...\n\n\t\t\t\tMARION\n\t\tThe middle colonies?\n\n\t\t\t\tGABRIEL\n\t\tRioting both sides of the bay, in\n\t\tChestertown they burned the Customs\n\t\tHouse and tar-and-feathered the\n\t\tCustoms Agent.  He died of burns.\n\t\tIn Wilmington they killed a Royal\n\t\tMagistrate and two Redcoats.\n\n\t\t\t\tMARION\n\t\tAnything about the convention in\n\t\tPhiladelphia?\n\n\t\t\t\tGABRIEL\n\t\tPoor Richard says they'll make a\n\t\tDeclaration of Independence by July.\n\nMarion shakes his head and sits down, carefully extracting\na delicate pair of reading glasses from a wooden box.  He\nbegins reading.\n\n\t\t\t\tGABRIEL\n\t\tScott Higgins joined the militia.\n\nMarion hears but doesn't respond.  Thomas looks up from\nhis lead soldiers.\n\n\t\t\t\tGABRIEL\n\t\tHe's seventeen.  A year younger than\n\t\tI.\n\nGabriel and Thomas wait for a reaction.  There is none.\nGabriel goes back to reading and Thomas resumes playing\nwith his toy soldiers.  Marion's eyes drift from the page\nto Gabriel.\n\nEXT.  SWAMP ROAD - DAY\n\nThe Marion family, in two tightly-packed carriages, drives\non a beautiful road, cut through the swamps.  The canopy\nof swamp maples and weeping willows forms a tunnel of\ngreen, mottled by sunlight.\n\nEXT.  BENNINGTON OVERLOOK - DAY\n\nThe two carriages pass a view of their entire valley.\nScattered farms with a patchwork of cultivated fields\nsurrounding the town of Bennington.\n\nEXT.  SANTEE ROAD - DAY\n\nPassing through rolling farmland, the Marions head toward\nthe coast.  They pass a large contingent of South Carolina\nMilitia, drilling in a field.  The children, particularly\nGabriel, watch avidly.\n\nEXT.  CHARLESTON - DAY\n\nA big, bustling city.  Marion and Gabriel negotiate the\ncarriages through the busy streets.  The children watch,\nwide-eyed, seeing taverns, a public gallows, drunkards,\nstreet entertainers, well-dressed ladies attended by their\nmaids, food venders, a man with a trained bear.\n\nEXT.  CHARLOTTE'S HOUSE - CHARLESTON - DAY\n\nGrand.  Four stories.  Marion and his children pull up.\nCHARLOTTE MOTTE hurries out.  She's in her mid-thirties,\nbeautiful, with a deep sadness that she keeps hidden as\nbest she can.\n\nThe children leap from the carriages and swarm around her,\nembracing her, smothering her with kisses.\n\n\t\t\t\tTHE CHILDREN\n\t\tAunt Charlotte!  Aunt Charlotte!\n\n\t\t\t\tCHARLOTTE\n\t\tWelcome!  Welcome!  Margaret,\n\t\tWilliam, look at you...!\n\t\t\t   (to Marion)\n\t\tThey're huge.  What have you been\n\t\tfeeding them?\n\n\t\t\t\tMARION\n\t\tThey're from good stock on their\n\t\tmother's side.\n\n\t\t\t\tCHARLOTTE\n\t\tThank you.\n\nCharlotte hustles the children toward the door.\n\n\t\t\t\tCHARLOTTE\n\t\tCome, come, inside, wait until you\n\t\tsee what I have...\n\n\t\t\t\tTHE CHILDREN\n\t\t\t   (simultaneous)\n\t\tPresents!  For me?  What do you\n\t\thave?\n\n\t\t\t\tCHARLOTTE\n\t\tInside, inside...\n\nCharlotte sweeps past Marion who smiles and follows her\ninto the house.\n\nINT.  PARLOR - CHARLOTTE'S HOUSE - DAY\n\nMarion watches as Charlotte finishes handing out presents.\nSusan plays with a new doll.  William has half-a-dozen new\nspinning tops, skimming around the floor.  Margaret holds\na new dress up to herself.  Samuel, Nathan and Thomas tear\ninto packages holding platoons of lead soldiers.  Gabriel\nlooks through a new book.\n\nCharlotte sees Marion watching her, rises and joins him at\nthe doorway.\n\n\t\t\t\tMARION\n\t\tYou look well, Charlotte.\n\n\t\t\t\tCHARLOTTE\n\t\tAs do you.\n\nSuddenly Thomas and Samuel race through the doorway,\nforcing Marion and Charlotte together, their bodies close.\nThey step back and exchange warm but uneasy smiles.\n\nThe moment is broken by the SOUND OF CHILDREN.  Marion and\nCharlotte gratefully turn their attention back to them.\n\nEXT.  CHARLESTON SQUARE - NIGHT\n\nDown the block from the Motte house.  A yelling crowd of\nSons of Liberty is massed around a Liberty Tree from which\nhang dozens of glowing lanterns.  Most of the men in the\ncrowd are drunk.  Vendors sell rum, ale, food and banners\nemblazoned with a coiled snake and the legend, \"Don't\nTread On Me.\"  Scores of on-lookers, including respectable\npeople, as well as street urchins, whores and drunkards,\nwatch the proceedings.\n\nSeveral Sons of Liberty string up effigies of King George\nIII and Governor Wilmington.  They light the effigies on\nfire.  As they begin to blaze, the crowd cheers.\n\nEXT.  CHARLOTTE'S BALCONY - NIGHT\n\nMarion's children, except Gabriel, stand on the balcony\nwatching the mob.  Marion steps out onto the balcony.\n\n\t\t\t\tMARION\n\t\tInside, all of you...\n\nThe children turn to Marion with stricken expressions.\nMarion relents.\n\n\t\t\t\tMARION\n\t\tVery well.\n\nThe children turn back to the mob.  Marion joins them.\n\n\t\t\t\tTHOMAS\n\t\tLook!  There's Gabriel!\n\nThey see Gabriel making his way through the crowd.  He\nsees them and waves, then enters the house.\n\nA moment later Charlotte steps out onto the balcony and\nsees:\n\nIN THE SQUARE, a pair of drunk Sons of Liberty, pull down\none of the smoldering effigies, cut off its head, then\nstart hacking at it's groin with a sword.\n\nAppalled, Charlotte shoots a glare at Marion and snaps at\nthe children.\n\n\t\t\t\tCHARLOTTE\n\t\tChildren, inside!  All of you!\n\t\tRight now.\n\nThe children start to protest, but a glance at Charlotte's\nresolute expression makes them think better of it.  They\nfile into the house.  Charlotte shoots a glare at Marion\nand shoos the children inside.  Gabriel steps out and\njoins them.\n\n\t\t\t\tMARION\n\t\tWhat news?\n\n\t\t\t\tGABRIEL\n\t\tThe British army is barricaded in\n\t\tBoston.  Harry Lee, is here from\n\t\tVirginia, recruiting for a\n\t\tContinental Army.\n\n\t\t\t\tMARION\n\t\tIs that why the Assembly was\n\t\tconvened?\n\n\t\t\t\tGABRIEL\n\t\tYes.  He seeks a levy of troops and\n\t\tmoney.\n\n\t\t\t\tMARION\n\t\tAnd the Governor?\n\n\t\t\t\tGABRIEL\n\t\tHe vowed that if the Assembly votes\n\t\ta single shilling to Lee, he'll\n\t\tdissolve the body.\n\n\t\t\t\tMARION\n\t\tWhich would force our delegates in\n\t\tPhiladelphia to vote for\n\t\tindependence.\n\n\t\t\t\tCHARLOTTE\n\t\tAnd send us to war alongside\n\t\tMassachusetts.\n\n\t\t\t\tMARION\n\t\tOur governor is a bigger fool than I\n\t\tthought.\n\n\t\t\t\tGABRIEL\n\t\tLee is counting on your vote and\n\t\texpects you to be the first to\n\t\tenlist.\n\nMarion nods thoughtfully without revealing what he thinks\nof Lee's expectations.  Marion turns back to watch the\nmob.\n\nEXT.  ASSEMBLY HALL - CHARLESTON - DAY\n\nThe capital building of South Carolina.  A large crowd of\nlower-class men and women is massed in front of the\nAssembly Hall.  As well-dressed Assemblymen walk into the\nbuilding, the CROWD YELLS words of encouragement to some\nand berates others.\n\nIn the square in front of the Assembly Hall a squadron of\nblue-uniformed AMERICAN CONTINENTAL SOLDIERS drills.  A\nrecruiting table is being set up by a Continental Captain\nand several military clerks.\n\nMarion and Gabriel walk across the square toward the\nAssembly Hall.  As they push their way through the crowd,\nGabriel eyes the Continentals.\n\nINT.  ASSEMBLY HALL - DAY\n\nTwo dozen ANGRY, YELLING, MEN OF PROPERTY.  Among them are\nROBINSON, HAMILL and JOHNSON, who are Patriots.  Opposed\nto them are SIMMS, WITHINGTON and BALDRIDGE who are\nLoyalists (loyal the the King).  As Marion makes his way\nto his seat, the SPEAKER OF THE ASSEMBLY POUNDS HIS GAVEL.\n\n\t\t\t\tSPEAKER\n\t\tORDER!  ORDER!\n\nSlowly, the room quiets down.\n\n\t\t\t\tSPEAKER\n\t\tOur first order of business...\n\n\t\t\t\tSIMMS\n\t\tAnd out last if we vote a levy...\n\nThe ROOM ERUPTS.\n\n\t\t\t\tSPEAKER\n\t\tORDER!  ORDER!  Mr. Simms, you do\n\t\tnot have the floor.\n\nThe ROOM SETTLES DOWN.\n\n\t\t\t\tSPEAKER\n\t\tOur first order of business is an\n\t\taddress by Colonel Harry Lee of the\n\t\tContinental Army.\n\nAn imposing figure rises and makes his way to the front of\nthe assembly.  He's COLONEL HARRY LEE, about Marion's age\nand cut from the same cloth -- strong, weathered, with a\npowerful bearing.  The room quiets down.\n\nLee sees Marion and offers a familiar nod, which Marion\nreturns, stone-faced.  Then Lee speaks, simply and\nclearly.\n\n\t\t\t\tLEE\n\t\tYou all know why I am here.  I am\n\t\tnot an orator and I will not try to\n\t\tconvince you of the worthiness of\n\t\tour cause.  I am a soldier and we\n\t\tare at war and with the declaration\n\t\tof independence we all expect from\n\t\tPhiladelphia, it will soon be a\n\t\tformal state of war.  In preparation\n\t\tfor that, eight of the thirteen\n\t\tcolonies have levied money in\n\t\tsupport of a Continental Army.  I\n\t\task South Carolina to be the ninth.\n\n\t\t\t\tSIMMS\n\t\tColonel Lee, Massachusetts may be at\n\t\twar, along with New Hampshire and\n\t\tRhode Island and Virginia, but South\n\t\tCarolina is not at war.\n\n\t\t\t\tLEE\n\t\tMassachusetts and New Hampshire are\n\t\tnot as far from South Carolina as\n\t\tyou might think and the war they're\n\t\tfighting is not for independence of\n\t\tone or two colonies.  It's for the\n\t\tindependence of a nation.\n\n\t\t\t\tWITHINGTON\n\t\tAnd what nation is that?\n\nRobinson, one of the Patriots, stands up.\n\n\t\t\t\tROBINSON\n\t\tAn American nation.  Colonel Lee,\n\t\twith your permission?\n\n\t\t\t\tLEE\n\t\tPlease.\n\n\t\t\t\tROBINSON\n\t\tThose of us who call ourselves\n\t\tPatriots are not seeking to give\n\t\tbirth to an American nation, but to\n\t\tprotect one that already exists.  It\n\t\twas born a hundred-and-seventy years\n\t\tago at Jamestown, Virginia and has\n\t\tgrown stronger and more mature with\n\t\tevery generation reared and with\n\t\tevery crop sown and harvested.  We\n\t\tare a nation and our rights as\n\t\tcitizens of that nation are\n\t\tthreatened by a tyrant three\n\t\tthousand miles away.\n\n\t\t\t\tLEE\n\t\tThank you.  Were I an orator, those\n\t\tare the exact words I would have\n\t\tspoken.\n\nLaughter.  Marion rises.\n\n\t\t\t\tMARION\n\t\tMister Robinson, tell me, why should\n\t\tI trade one tyrant, three thousand\n\t\tmiles away, for three thousand\n\t\ttyrants, one mile away?\n\nLaughter from the Loyalists.  Surprise from Lee and the\nPatriots.  In the gallery, Gabriel winces.\n\n\t\t\t\tROBINSON\n\t\tSir?\n\n\t\t\t\tMARION\n\t\tAn elected legislature can trample a\n\t\tman's rights just as easily as a\n\t\tKing can.\n\n\t\t\t\tLEE\n\t\tCaptain Marion, I understood you to\n\t\tbe a Patriot.\n\n\t\t\t\tMARION\n\t\tIt's Mister Marion.\n\n\t\t\t\tLEE\n\t\tI understood him to be a Patriot as\n\t\twell.\n\nMore laughter.\n\n\t\t\t\tMARION\n\t\tIf you mean by a Patriot, am I angry\n\t\tat the Townsend Acts and the Stamp\n\t\tAct?  Then I'm a Patriot.  And what\n\t\tof the Navigation Act?  Should I be\n\t\tpermitted to sell my tobacco to the\n\t\tFrench traders on Martinique?  Yes,\n\t\tand it's an intrusion into my\n\t\taffairs that I can't... legally.\n\nLaughter.\n\n\t\t\t\tMARION\n\t\tAnd what of the greedy, self-serving\n\t\tbastards who sit as Magistrates on\n\t\tthe Admiralty Court and have fined\n\t\tnearly every man in this room.\n\t\tShould they be boxed about the ears\n\t\tand thrown onto the first ship back\n\t\tto England?  I'll do it myself.\n\t\t\t   (beat)\n\t\tAnd do I believe that the American\n\t\tcolonies should stand as a separate,\n\t\tindependent nation, free from the\n\t\treins of King and Parliament?  I do,\n\t\tand if that makes a Patriot, then\n\t\tI'm a Patriot.\n\nMarion grows more serious.\n\n\t\t\t\tMARION\n\t\tBut if you're asking whether I'm\n\t\twilling to go to war with England,\n\t\tthe answer is, no.  I've been to war\n\t\tand I have no desire to do so again.\n\nThe room is quiet, the Assemblymen having been thrown off-\nbalance.  Gabriel is stunned and disappointed by his\nfather's speech.\n\n\t\t\t\tROBINSON\n\t\tThis from the same Captain Francis\n\t\tMarion whose anger was so famous\n\t\tduring the Wilderness Campaign.\n\nMarion glares at Robinson, then smiles.\n\n\t\t\t\tMARION\n\t\tI was intemperate in my youth.  My\n\t\tdeparted wife, God bless her soul,\n\t\tdampened that intemperance with the\n\t\tmantle of responsibility.\n\nRobinson looks derisively at Marion.\n\n\t\t\t\tROBINSON\n\t\tTemperance can be a convenient\n\t\tdisguise for fear.\n\nMarion bristles but before he can answer, Lee steps in.\n\n\t\t\t\tLEE\n\t\tMister Robinson, I fought with\n\t\tCaptain Marion in the French and\n\t\tIndian War, including the Wilderness\n\t\tCampaign.  We served as scouts under\n\t\tWashington and I have no doubts\n\t\tabout Captain Marion's courage or\n\t\tcompetence on a battlefield.\n\t\tThere's not a man in this room, or\n\t\tanywhere, for that matter, to whom I\n\t\twould more willingly trust my life.\n\n\t\t\t\tROBINSON\n\t\tI stand corrected.\n\n\t\t\t\tLEE\n\t\tNonetheless, I would like to know,\n\t\tMister Marion, how... how... how...\n\nLee's oratorical skills peter out.\n\n\t\t\t\tLEE\n\t\tDamn it, Francis!  How in God's name\n\t\tdo you expect to gain independence\n\t\twithout going to war?\n\n\t\t\t\tMARION\n\t\tHarry, Harry, Harry...\n\nMarion and Lee drop all formality and become nothing more\nthan two old friends, pissed off.\n\n\t\t\t\tLEE\n\t\tMy hairy arse!  You live in a cave\n\t\tif you think we'll get independence\n\t\twithout war...\n\nThe Speaker POUNDS HIS GAVEL.\n\n\t\t\t\tSPEAKER\n\t\tGentlemen!  Please!  This is not a\n\t\ttavern!\n\n\t\t\t\tMARION\n\t\tWasn't it a Union Jack we fought\n\t\tunder?\n\n\t\t\t\tLEE\n\t\tA long time ago...\n\n\t\t\t\tMARION\n\t\tThirteen years...\n\n\t\t\t\tLEE\n\t\tThat's a damn long time...\n\nThe Speaker POUNDS HIS GAVEL again.\n\n\t\t\t\tSPEAKER\n\t\tGentlemen!  Please!\n\nMarion and Lee ignore the speaker.\n\n\t\t\t\tMARION\n\t\tYou were an Englishman then...\n\n\t\t\t\tLEE\n\t\tI was an American, I just didn't\n\t\tknow it yet...\n\nThe astonished Assemblymen and now even the Speaker watch\nthe argument avidly, turning their heads in simultaneous\nanticipation of each rejoinder.\n\n\t\t\t\tMARION\n\t\tWe don't have to go to war to gain\n\t\tindependence...\n\n\t\t\t\tLEE\n\t\tBalderdash!\n\n\t\t\t\tMARION\n\t\tThere are a thousand avenues, other\n\t\tthan war, at our disposal...\n\n\t\t\t\tLEE\n\t\tName five hundred.\n\n\t\t\t\tMARION\n\t\tRoyal petition, delegates to court,\n\t\tjudicial redress, economic boycott,\n\t\tbribery...\n\n\t\t\t\tLEE\n\t\tThat's five, keep going...\n\n\t\t\t\tMARION\n\t\t... time, royal succession,\n\t\tregicide, bribery...\n\n\t\t\t\tLEE\n\t\tYou said bribery twice...\n\nMarion speaks slowly and firmly.\n\n\t\t\t\tMARION\n\t\tWe do not have to go to war to gain\n\t\tindependence.\n\nLee says nothing for a moment, then he speaks more\nseriously, quietly, grimly.\n\n\t\t\t\tLEE\n\t\tFrancis, I was at Bunker Hill.  It\n\t\twas as bad as anything you and I saw\n\t\ton the frontier.  Worse than the\n\t\tslaughter at the Ashuelot River.\n\t\tThe British advanced three times and\n\t\twe killed over seven hundred of them\n\t\tat point blank range.  And still,\n\t\tthey advanced and they took the\n\t\tground.  That is the measure of\n\t\ttheir resolve.  If your principles\n\t\tdictate independence, then war is\n\t\tthe only way.  It has come to that.\n\nMarion is silent for a long moment.  He softens, finds\nhimself unsteady and speaks far more honestly than he ever\nwanted to.\n\n\t\t\t\tMARION\n\t\tI have seven children.  My wife is\n\t\tdead.  Who's to care for them if I\n\t\tgo to war?\n\nLee is stunned by Marion's honesty and his show of\nweakness.  At first Lee has no answer, then:\n\n\t\t\t\tLEE\n\t\tWars are not fought only by\n\t\tchildless men.  A man must weigh his\n\t\tpersonal responsibilities against\n\t\this principles.\n\n\t\t\t\tMARION\n\t\tThat's what I'm doing.  I will not\n\t\tfight and because I won't, I will\n\t\tnot cast a vote that will send\n\t\tothers to fight in my stead.\n\n\t\t\t\tLEE\n\t\tAnd your principles?\n\n\t\t\t\tMARION\n\t\tI'm a parent, I don't have the\n\t\tluxury of principles.\n\nThe other Assemblymen, both Patriots and Loyalists, stare\nat him, appalled.  Marion, feeling weak, sits down.  Lee\nlooks at his friend with more sympathy than\ndisappointment.  Then Lee turns to Robinson who addresses\nthe chair.\n\n\t\t\t\tROBINSON\n\t\tMister Speaker, I call for a vote on\n\t\ta levy to the Continental Army.\n\n\t\t\t\tHAMILL\n\t\tSecond.\n\n\t\t\t\tSPEAKER\n\t\tSo moved.\n\nThe vote is taken on a roll call.  Gabriel watches from\nthe gallery.\n\n\t\t\t\tSPEAKER\n\t\tMr. Robinson.\n\n\t\t\t\tROBINSON\n\t\tYea.\n\n\t\t\t\tSPEAKER\n\t\tMr. Hamill.\n\n\t\t\t\tHAMILL\n\t\tYea.\n\n\t\t\t\tSPEAKER\n\t\tMr. Johnson.\n\n\t\t\t\tJOHNSON\n\t\tYea.\n\n\t\t\t\tSPEAKER\n\t\tMr. Simms.\n\n\t\t\t\tSIMMS\n\t\tNay.\n\n\t\t\t\tSPEAKER\n\t\tMr. Marion.\n\nNo response.\n\n\t\t\t\tSPEAKER\n\t\tMr. Marion.\n\n\t\t\t\tMARION\n\t\tNay.\n\nIn the gallery Gabriel turns and walks out.  The roll call\ncontinues.  Marion sits, eyes straight ahead.\n\nEXT.  ASSEMBLY HALL - DAY\n\nThe crowd waits.  The doors open and a PAGE BOY dashes out\nand runs to the Continental Captain at the recruiting\ntable.\n\n\t\t\t\tPAGE BOY\n\t\tTwenty-eight to twelve, the levy\n\t\tpassed!\n\nThe Continental Captain motions to an assembled squadron.\nThey raise their muskets and FIRE A VOLLEY into the air.\nOther soldiers, STRIKE UP A MARTIAL AIR ON FIFES AND\nDRUMS.  Volunteers crowd around the recruiting table,\nYELLING and jostling for position.\n\nThe delegates walk out.  Both Patriots and Loyalists give\nMarion a wide berth.\n\nMarion sees Gabriel, standing near the crowd at the\nrecruiting table.  Marion walks up to him.\n\n\t\t\t\tGABRIEL\n\t\tFather, I've lost respect for you.\n\t\tI thought you were a man of\n\t\tprinciple.\n\n\t\t\t\tMARION\n\t\tWhen you have children, I hope\n\t\tyou'll understand.\n\n\t\t\t\tGABRIEL\n\t\tWhen I have children, I hope I don't\n\t\thide behind them.\n\nMarion looks closely at Gabriel.\n\n\t\t\t\tMARION\n\t\tDo you intend to enlist without my\n\t\tpermission?\n\n\t\t\t\tGABRIEL\n\t\tYes.\n\nThey lock eyes for a moment, then Gabriel turns from his\nfather and walks away, joining the crush around the\nrecruiting table.\n\nMarion stands alone in the middle of the chaos.  The FIFES\nAND DRUMS continue to play.  Marion doesn't hear them.\n\nHarry Lee walks out of the Assembly hall with a triumphant\ngroup of Patriots who look at Marion coldly.\n\nLee excuses himself, and steps over next to Marion.  Lee\nsees that Marion is watching Gabriel at the enlistment\ntable.\n\n\t\t\t\tLEE\n\t\tOne of yours?\n\n\t\t\t\tMARION\n\t\tGabriel.\n\n\t\t\t\tLEE\n\t\tI recognize him now.  Is he as\n\t\timprudent as his father was at his\n\t\tage?\n\n\t\t\t\tMARION\n\t\tNo, thank the Lord.  He's more like\n\t\this mother.\n\n\t\t\t\tLEE\n\t\tI'll see to it that he serves under\n\t\tme.\n\n\t\t\t\tMARION\n\t\tThank you.\n\nThey shake hands.  Then Lee walks over to the soldiers.\nMarion takes a last look at Gabriel, then heads off\nthrough the crowded square, moving against the tide of men\nheaded toward the recruiting table.\n\nEXT.  POND BLUFF - DAY\n\nSpringtime.  The apple tree at the top of the hill is\ncovered with blossoms.\n\nSUPERIMPOSITION:\n\n\t\t\t\t \"TWO YEARS LATER\"\n\nEXT.  FIELD - POND BLUFF - DAY\n\nMarion plows a field.  Nathan leads the plowhorse.  Samuel\nfollows, breaking up the clods of dirt.  Hard work.  They\nstop to catch their breath.  A SOFT WIND blows.\n\nMarion turns his head as if listening for a faint voice.\nHe hears nothing.  He snaps the reins and continues\nplowing.\n\nINT.  MARION'S ATTIC - LATE AFTERNOON\n\nDark.  Thomas steps up into the attic.  He finds a trunk\nand opens it.  Lifting out some blankets, he uncovers a\ntrove of Marion's old military gear -- a worn battle coat,\na box of medals, a military sword, rusted into its\nscabbard.\n\nThomas puts on the coat, which hangs off his narrow\nshoulders.  He stands in front of a dusty mirror,\nappraising himself, then stops as he hears FOOTSTEPS\ncoming up the stairs.\n\nIt's Marion, tired and dirty from his plowing.  Thomas\ngrimaces, expecting him to be angry, but sees him shake\nhis head gently.\n\n\t\t\t\tMARION\n\t\tNot yet, Thomas.\n\n\t\t\t\tTHOMAS\n\t\tWhen?\n\nMarion looks closely at his son, giving him the courtesy\nof really thinking about the answer.\n\n\t\t\t\tMARION\n\t\tSeventeen.\n\n\t\t\t\tTHOMAS\n\t\tBut it's already been two years and\n\t\tthat's two more years.  The war\n\t\tcould be over by then.\n\n\t\t\t\tMARION\n\t\tGod willing.\n\nThomas considers it, then nods.\n\n\t\t\t\tTHOMAS\n\t\tAlright.  Seventeen.\n\nMarion offers his hand.  They shake firmly, like adults.\nMarion takes the coat off Thomas and puts it back in the\ntrunk.  They walk down the stairs together.\n\nINT.  POND BLUFF - DAWN\n\nAll is quiet.  A dawn mist hovers close over the ground.\nSome sparrows feed at the base of the apple tree near the\ngravesite.  DISTANT THUNDER.  Low and rolling.  The birds\nstop feeding, uneasy, then fly away.\n\nINT.  MARION'S BEDROOM - DAWN\n\nAt another roll of the DISTANT THUNDER Marion awakes.  He\ngets out of bed and pulls on his clothes.\n\nEXT.  FRONT PORCH - MARION'S HOUSE - DAWN\n\nMarion steps out to his front porch and listens.  He knows\nthe sound, the DISTANT STACCATO BOOMS OF CANNON and the\nPATTERING WAVE OF THOUSANDS OF MUSKETS FIRING.\n\nOne by one the children join him.  Thomas, Nathan and\nSamuel listen analytically.  Margaret and Susan press\nclose against their father.  William looks curiously at\nthe cloudless sky.\n\n\t\t\t\tWILLIAM\n\t\tIs it going to rain?\n\n\t\t\t\tTHOMAS\n\t\tThat's not thunder.\n\nThe SOUND BECOMES DEEPER, MORE OMINOUS.  They all notice\nthe change.\n\n\t\t\t\tNATHAN\n\t\tFather?\n\n\t\t\t\tMARION\n\t\tSix-pounders.  Lots of them.\n\n\t\t\t\tMARGARET\n\t\tHow far away?\n\n\t\t\t\tMARION\n\t\tFour, five miles.\n\n\t\t\t\tSAMUEL\n\t\tWaxhaus?\n\n\t\t\t\tMARION\n\t\tJust east of it.\n\n\t\t\t\tMARGARET\n\t\tAre we safe here?\n\nMarion puts on a smile.\n\n\t\t\t\tMARION\n\t\tDon't worry.\n\n\t\t\t\tMARGARET\n\t\tWe could go stay at Aunt Charlotte's\n\t\tfarm.  She's to the west.\n\n\t\t\t\tMARION\n\t\tNo, there'll be skirmishers on the\n\t\troads.  We're safer here.\n\nThomas appears at the doorway with a pair of muskets.  He\ngives one to Nathan and offers the other to his father.\n\n\t\t\t\tMARION\n\t\tPut those away.\n\n\t\t\t\tTHOMAS\n\t\tBut father, they might come this\n\t\tway.\n\n\t\t\t\tMARION\n\t\tPut them away.\n\nReluctantly, Thomas takes the muskets back into the house.\n\n\t\t\t\tMARION\n\t\tEnough.  I'll be in the workshop.\n\t\tSamuel, the cows.  Thomas, attend to\n\t\tyour studies here on the porch.\n\t\tNathan, on the back porch.  If you\n\t\tsee anyone, come get me.  Margaret,\n\t\tplease keep William close to you.\n\t\tNo one is to go past the yard wall.\n\nThey all nod.  Marion walks off toward the workshop,\nfollowed by Susan.  The others hesitate.\n\n\t\t\t\tMARION\n\t\tChildren.\n\nThey head off to do as they were told.\n\nINT.  WORKSHOP - DAY\n\nMarion works the lathe.  Susan watches from her perch on\nthe woodpile.\n\nEXT.  BARN - DAY\n\nThe SOUND OF A CRASH from inside the barn.  An angry cow\nruns out of the barn, dragging a tenacious Samuel who is\nholding onto the cow's neck.\n\nSamuel's grip fails and he lands in the dirt.  The cow\nruns about thirty yards down the hill, stopping on the\nbank of the river.  Samuel grabs a rope and heads down the\nhill to get the cow.\n\nON THE RIVERBANK\n\nAs Samuel approaches the cow, he see it skittishly\napproaching then retreating from the water.  Then he sees\nthe cause -- the water in the river has a pale, pink hue.\nSamuel stares at it, trying to figure out what it is.\n\nBehind him, Margaret sees her brother beyond the yard\nwall.\n\n\t\t\t\tMARGARET\n\t\tSamuel...\n\nHe doesn't respond.  Margaret, trailed by William, walks\ndown toward Samuel.\n\n\t\t\t\tMARGARET\n\t\tSamuel, get up to the house.  You\n\t\theard father...\n\nThen she sees it, too.  The pale pink is turning redder\nand redder.  And then the BODIES.  First one, then more,\nmany more.  Torn apart.  Missing limbs.  Those with wide-\nopen wounds, are already drained of blood.  Others are\nstill seeping, leaving trails of deep red in the paler red\nof the surrounding water.\n\nSamuel, Margaret and William stand frozen, appalled and\nfascinated.\n\nMARION steps out of the workshop and sees the children at\nthe river.  He can't see what they're looking at.\nIrritated, he walks toward them.  Then, as he nears the\nriver, he sees the color of the water and the bodies that\nhave hypnotized his children.  He quickens his stride,\nspeaking calmly but firmly, careful not to frighten them.\n\n\t\t\t\tMARION\n\t\tUp to the house, now.  All of you,\n\t\tcome on.  Now.\n\nEXT.  MARION'S HOUSE - NIGHT\n\nQuiet.  Dark.  Marion stands on the front porch, looking\nout into the night, listening, hearing nothing.  He\nglances up at the star-filled sky, tracking his eyes from\nthe Big Dipper to the NORTH STAR.\n\nBEHIND THE HOUSE, A FIGURE IN THE DARKNESS, carrying a\nmusket, moves from shadow to shadow.\n\nINT.  KITCHEN - NIGHT\n\nMargaret and Samuel and William talk, their voices low.\n\n\t\t\t\tSAMUEL\n\t\tThey're going to come.\n\n\t\t\t\tMARGARET\n\t\tQuiet.\n\n\t\t\t\tSAMUEL\n\t\tWe're going to have to fight them\n\t\toff.\n\n\t\t\t\tWILLIAM\n\t\tFather will do that.\n\n\t\t\t\tSAMUEL\n\t\tThey'll probably kill us men and do\n\t\tLord knows what to you women.\n\n\t\t\t\tMARGARET\n\t\tSamuel!\n\nA SOUND.  They all stop.  Something moved behind the\nkitchen.  Margaret silently eases the others out of the\nroom, through the darkened hall toward their father.\n\nSUDDENLY IN FRONT OF THEM, A BLOODY FIGURE\n\nBig.  Hulking.  In uniform.  Margaret SCREAMS.  William\nand Samuel CRY OUT.  The figure moves toward them...\n\nMarion, on the porch, hears the scream, races into the\nhouse.  He sees the figure, moves toward it...\n\nTHE FIGURE MOVES INTO THE LIGHT... Marion sees the\nbloodied face...\n\n\t\t\t\tMARION\n\t\tGabriel!\n\nGabriel is wounded, battered and dirty.  He carries a\nmusket and a dispatch case.  He sways.  Marion catches him\nand eases him to a seat.\n\n\t\t\t\tMARGARET\n\t\tYou're hurt.\n\n\t\t\t\tTHOMAS\n\t\tThe battle, were you there?\n\n\t\t\t\tMARION\n\t\tMargaret, get bandages and water.\n\t\tThomas, the porch, eyes open.\n\nMarion checks Gabriel's wounds which are nasty but not\nlife-threatening.\n\n\t\t\t\tGABRIEL\n\t\tHave you seen any Redcoats?\n\n\t\t\t\tMARION\n\t\tNot yet.  What happened?\n\nMargaret brings water and linen to Marion who expertly\ncleans Gabriel's wounds and applies field-dressings.\n\n\t\t\t\tGABRIEL\n\t\tIt wasn't like Saratoga.  There, we\n\t\tstayed in the trees, but this time\n\t\tGates marched us straight at the\n\t\tRedcoats.  They fired two volleys\n\t\tinto us and we broke like straw.  I\n\t\twas given these dispatches... I saw\n\t\tVirginia Regulars surrender... as\n\t\tthey laid down their weapons the\n\t\tBritish Green Dragoons rode into\n\t\tthem and hacked them to bits...\n\t\tkilled them all, over two hundred\n\t\tmen.\n\nMarion's appalled.\n\n\t\t\t\tMARION\n\t\tThey had surrendered?\n\nGabriel nods.  Marion's stunned.  Gabriel tries to rise.\n\n\t\t\t\tGABRIEL\n\t\tI have to get these dispatches to\n\t\tHillsboro.\n\n\t\t\t\tMARION\n\t\tYou're in no condition to ride.\n\n\t\t\t\tGABRIEL\n\t\tI have no choice, I...\n\nGabriel passes out.  Marion catches him and carries him to\na day-bed in the parlor.  As Marion lays him down, they\nhear HEAVY MUSKET FIRE, VERY CLOSE.\n\nMarion hurries to the door and looks out into the night,\nthe children cluster around him, seeing a strange sight.\n\nA SKIRMISH IN THE FIELD BELOW THE HOUSE\n\nPitch black.  Then a MUSKET FIRES, creating a FLASH OF\nLIGHT that illuminates a tableau of soldiers, about three\ndozen Redcoats and as many Patriots.\n\nThe strobe of the musket shot provides targets for an\nensuing VOLLEY OF SHOTS in every direction.  Then\ndarkness, punctuated by SCREAMS OF PAIN, CONFUSED\nHOLLERING and the RUSTLING OF ARMED MEN IN MOVEMENT.\n\nThen the pattern repeats itself:  A MUSKET FIRES,\nilluminating a tableau of targets for another MURDEROUS\nVOLLEY OF SHOTS.\n\n\t\t\t\tMARION\n\t\tMargaret, take William and Susan\n\t\tdown to the root cellar.  Thomas, go\n\t\tto the back porch.  Nathan and\n\t\tSamuel, the side windows.  Keep out\n\t\tof sight.\n\nThey hurry off.  Marion steps into the house and opens his\ngun cabinet.  He extracts two pistols and a pair of\nmuskets.  Then he steps back to the front door.  He waits\nand watches.\n\nEXT.  LOWER FIELD - POND BLUFF - DAWN\n\nFirst light.  The morning mist lies low over the field.\nMarion warily approaches the scene of the battle.  He\ncarries a Pennsylvania rifle, has another slung over his\nshoulder, and has a pair of pistols in his belt.\n\nAs Marion nears the field he sees, appearing out of the\nlow mist, a nightmarish vision.  Young Redcoats and\nContinentals are scattered on the ground, dead and\nwounded.  Many have been hideously torn apart by the\nmassive musket balls.  Blood is everywhere.  Marion\nhurries back toward the house.\n\nEXT.  LOWER FIELD - POND BLUFF - MORNING\n\nMarion loads the wounded men onto a wagon, helped by\nThomas, Nathan and Samuel.\n\nEXT.  MARION'S HOUSE - POND BLUFF - DAY\n\nThe porch and yard have been turned into a field hospital.\nThere are about two dozen wounded, a few more Patriots\nthan Redcoats.  Thomas, Nathan, Samuel and Margaret help\nMarion tend the soldiers.  William and Susan watch from\ninside.\n\nMarion treats an arm wound, retying a tourniquet,\nstanching an ugly flow of blood.\n\nMarion moves to the next of the wounded.  Thomas starts to\nhelp but Marion shakes his head.\n\n\t\t\t\tMARION\n\t\tHe's dead...\n\nMarion moves on to another.\n\n\t\t\t\tMARION\n\t\tThomas, help me turn him over...\n\nThey turn over a young Continental and see a horrible\nwound on his back.  Thomas, swoons.\n\n\t\t\t\tMARION\n\t\tThomas!\n\nA hard glare from Marion strengthens his son.  Together\nthey bandage the wounded man.\n\nEXT.  MARION'S HOUSE - AFTERNOON\n\nTriage completed.  Margaret and Samuel give water and\nfood.  Marion kneels next to a CONTINENTAL SERGEANT and a\nCOUPLE OF PRIVATES who are less severely wounded than the\nothers.\n\n\t\t\t\tCONTINENTAL SERGEANT\n\t\tThank you.\n\nMarion nods, uncomfortable with the thanks.\n\n\t\t\t\tMARION\n\t\tSergeant, there are seventeen\n\t\twounded men here.  Seven Redcoats\n\t\tand ten Patriots, counting my son\n\t\tinside.  That puts me in a difficult\n\t\tposition.\n\nThe Continental Sergeant knows what's coming.  The\nPrivates and Marion's children don't.\n\n\t\t\t\tMARION\n\t\tYou three are the least severely\n\t\twounded.  I have to ask you to leave\n\t\tand find care elsewhere.\n\nThe Privates are stunned at the request.  The Sergeant\nlooks at Marion's children and nods.\n\n\t\t\t\tSERGEANT\n\t\tI understand.\n\nHe struggles to his feet and jerks his head for the two\nPrivates to do the same.\n\n\t\t\t\tSERGEANT\n\t\tCome on, boys.\n\nNathan, Samuel and Margaret are confused.\n\n\t\t\t\tTHOMAS\n\t\tFather?\n\n\t\t\t\tNATHAN\n\t\tBut they're wounded.\n\n\t\t\t\tMARION\n\t\tThere are rules, even in war.\n\nMarion motions to a large, old scar on his arm.\n\n\t\t\t\tMARION\n\t\tAfter the Battle of Ashuelot River,\n\t\tagainst the French, I got this and\n\t\tthe one on my leg.  I couldn't walk.\n\t\tWashington had to march north.  He\n\t\tleft me with other wounded men and a\n\t\tlike number of French prisoners.\n\t\tNine for nine.  When the French\n\t\tfound us, their surgeon gave me the\n\t\tbest of care.  We'll be safe this\n\t\tway.\n\nMarion's children are not convinced.  The Sergeant and the\ntwo Privates gather themselves to leave.\n\n\t\t\t\tMARION\n\t\tYour best chance is in Bennington,\n\t\tseven miles east, along the river\n\t\troad.\n\nThe wounded men nod grimly and start off down the road.\n\n\t\t\t\tMARION\n\t\tThank you.\n\nMarion and his children watch them go.\n\nEXT.  POND BLUFF ROAD - DAY\n\nA dirt road runs along the edge of the Santee Swamps,\nstretching toward green, rolling hills beyond.  Beautiful\ncountry.  Peaceful.  Then, the GROUND BEGINS TO SHAKE.  A\nTHUNDEROUS SOUND rises, louder and louder.  HORSES HOOVES.\nFrom around a bend, a detachment of cavalry gallops:\n\nBritish GREEN DRAGOONS.  The finest light calvary in the\nworld.  Hard, strong men.  Excellent horsemen.  Their\nmounts are powerful, muscled and perfectly cared for.  The\nDragoons themselves are all hardened veterans, marked with\nthe blood and dirt of a recent battle.  Tired and\nvigorous.\n\nThey're armed to the teeth.  Each carries a flintlock\ncarbine, a brace of pistols and a sword.  Some carry\nlances as well.  Regimental flags flutter.  They are forty\nof the most imposing, frightening horsemen imaginable.\n\nAnd at their head, the most imposing man of all, LT.\nCOLONEL BANASTRE TARLETON.  \"The Butcher.\"  Aristocratic.\nStrong.  Dark.  A powerful horseman on the best mount of\nthe entire troop.  Decorated.  Imperious.  No temper, just\nhard, cold authority.  His men struggle to keep up with\nhim.\n\nBehind them, two dozen LOYALIST MILITIA CALVARY (American\ncivilians loyal to the crown).  Nasty, local men.\nCivilian clothes.  Riding at their head is AMOS GASKINS,\ngrizzled, lower-class, wearing ill-fitting patrician's\nclothing.\n\nAROUND A BEND\n\nThe three wounded Patriots who just left Marion's farm\nhear the horses coming, stand on the side of the road,\nraise their arms and a white cloth of surrender.\n\nThe Green Dragoons rein in.  Tarleton stops in front of\nthe three men.  He motions for one of his men to lower his\nweapon.  Then he speaks calmly, quietly, to the wounded\nmen.\n\n\t\t\t\tTARLETON\n\t\tYou're surrendering.\n\n\t\t\t\tCONTINENTAL SERGEANT\n\t\tYes, sir.\n\n\t\t\t\tTARLETON\n\t\tWhat unit?\n\n\t\t\t\tCONTINENTAL SERGEANT\n\t\tFirst Virginia Regulars under\n\t\tColonel Hamilton.\n\n\t\t\t\tTARLETON\n\t\tWho cared for your wounds?\n\nThey hesitate.\n\n\t\t\t\tCONTINENTAL SERGEANT\n\t\tWe did.\n\n\t\t\t\tTARLETON\n\t\tWith a lace table cloth?\n\nTarleton turns to his second-in-command, MAJOR WILKINS.\n\n\t\t\t\tTARLETON\n\t\tKill them.\n\nTarleton rides off.  Wilkins and several other Dragoons\ncalmly FIRE THEIR PISTOLS, killing the three Patriots.\nThe troops ride off, thundering past the bodies of the\nthree men.\n\nEXT.  POND BLUFF - DAY\n\nMarion and his children tend the wounded.  Gabriel, weak\nbut walking, helps.  REDCOAT INFANTRY appears out of the\nwoods, heading toward the house.  Three dozen men.  Scouts\nand flank units covering the main body.  Marion gathers\nhis family around him, stands and waits.\n\nThe Redcoats get to the house, warily eye the wounded and\nMarion's family.  A young REDCOAT LIEUTENANT motions his\nmen to check out the house and barn, then looks at the\nwounded, doing a silent count.  He turns to Marion.\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tThese men are of my regiment.  Thank\n\t\tyou.\n\nMarion nods.  ONE OF THE REDCOATS emerges from the house\ncarrying Gabriel's dispatch case.\n\n\t\t\t\tREDCOAT\n\t\tRebel dispatches, sir.\n\nGabriel steps up.\n\n\t\t\t\tGABRIEL\n\t\tI carried those.  I was wounded,\n\t\tthese people gave me care, they have\n\t\tnothing to do with the dispatches.\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tI understand.\n\nThe SOUND OF HORSES HOOVES.  All turn and see:\n\nTARLETON AND THE GREEN DRAGOONS\n\nThundering down the road toward the house.  It's an\nimpressive, frightening sight.\n\nThey rein in their horses, stopping in the yard, enveloped\nby their trailing cloud of dust.\n\nTarleton surveys the scene, then speaks to the young\nRedcoat Lieutenant.\n\n\t\t\t\tTARLETON\n\t\tLieutenant, have a detachment take\n\t\tour wounded to our surgeons at\n\t\tCamden crossing.  Use whatever\n\t\thorses and wagons you can find here.\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tYes, sir.\n\nHe hands the dispatch case to Tarleton.\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tWe found this, sir.\n\nTarleton opens it and quickly scans the contents.\n\n\t\t\t\tTARLETON\n\t\tWho carried this?\n\n\t\t\t\tGABRIEL\n\t\tI did.\n\n\t\t\t\tTARLETON\n\t\t\t   (to Lt. re: Gabriel)\n\t\tTake this one to Camden, he's a spy.\n\t\tHe will be hung.\n\nMarion quickly steps between Tarleton and Gabriel.\n\n\t\t\t\tMARION\n\t\tColonel, he's a dispatch rider and\n\t\tthat's a marked dispatch case.\n\nTarleton ignores Marion and continues speaking to the\nLieutenant.\n\n\t\t\t\tTARLETON\n\t\tFire the house and barns.\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tYes, sir.\n\n\t\t\t\tMARION\n\t\tColonel...\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tAnd the Rebel wounded?\n\n\t\t\t\tTARLETON\n\t\tKill them.\n\nThe Redcoat Lieutenant and several of his men are shocked\nby the order.  Marion is, also, but he's more concerned\nwith Gabriel.  He pushes past some Redcoats and stands at\nTarleton's mount, looking up.\n\n\t\t\t\tMARION\n\t\tA dispatch rider with a marked case\n\t\tcannot be held for spying.\n\nTarleton finally pays attention to Marion.  He looks down\nat his anguished face and offers the barest of smiles.\n\n\t\t\t\tTARLETON\n\t\tWe're not going to hold him, we're\n\t\tgoing to hang him.\n\n\t\t\t\tMARION\n\t\tBut...\n\nTarleton draws his pistol and points it at Marion.\nGabriel tries to intercede but is held back by a burly\nRedcoat Corporal.\n\n\t\t\t\tGABRIEL\n\t\tFather...\n\n\t\t\t\tTARLETON\n\t\tOh, he's your son.  You should have\n\t\ttaught him about loyalty.\n\n\t\t\t\tMARION\n\t\tColonel, I beg you, please\n\t\treconsider.  By the rules of war, a\n\t\tdispatch rider with a marked case...\n\nTarleton controls his shifting mount, keeping his pistol\ntrained on Marion's face.\n\n\t\t\t\tTARLETON\n\t\tWould you like a lesson in the rules\n\t\tof war?\n\nMarion doesn't answer.  He looks up at Tarleton coldly,\ntaking his measure, waiting to see if he's going to pull\nthe trigger.\n\nTarleton walks his horse a couple of steps and shifts his\naim, pointing the pistol among Marion's children.\n\n\t\t\t\tTARLETON\n\t\tPerhaps your children would.\n\nThe children are terrified.  Thomas is more angry than\nfrightened.  Marion quickly steps between the pistol and\nhis children and speaks quietly to Tarleton.\n\n\t\t\t\tMARION\n\t\tNo lesson is necessary.\n\nTarleton sees the terrified expressions on the faces of\nMarion's children.  He smiles at the effect.  Then he\nholsters his pistol.\n\nMarion and his children watch as one of the Redcoats ties\nGabriel's hands.  Thomas is beside himself.\n\n\t\t\t\tTHOMAS\n\t\tFather, do something.\n\nThomas grows increasingly agitated.  He sees that his\nfather is going to do nothing.  He gauges the distance\nbetween Gabriel and the cover of the nearby woods.\n\nThen suddenly, Thomas SPRINGS.  He RUNS, THROWING HIMSELF,\ninto the two Redcoats holding Gabriel, KNOCKING THEM DOWN.\n\n\t\t\t\tTHOMAS\n\t\tGabriel!  Run!\n\nGabriel is too shocked to take flight.  A few of the\nRedcoats, including one of the ones knocked down, shake\ntheir heads with sad laughter at Thomas' ineffectual\ngesture.  One of them grabs Thomas by the scruff of the\nneck and yanks him to his feet.\n\nTARLETON sees the commotion.  Without pausing he DRAWS HIS\nPISTOL AND FIRES, HITTING THOMAS IN THE BACK.\n\nTHOMAS is thrown to his knees by the shot.  Stunned,\nconfused, he looks down and sees the massive exit wound in\nhis chest.\n\nMARION, horrified, catches Thomas as he falls, easing him\nto the ground.\n\nMARGARET CRIES OUT.  THE OTHER CHILDREN are stunned to\nsilence.\n\nThe REDCOATS are frozen in place.  Tarleton's GREEN\nDRAGOONS are impassive, having seen worse.\n\nMARION holds his son, looking at the huge,\nincomprehensible wound.  He knows that Thomas is already\ndead, though his body still moves.\n\nMARION'S stunned agony turns to fury.  He rises, his eyes\ntrained on Tarleton, then stops as...\n\nTARLETON raises a second loaded pistol and a DOZEN GREEN\nDRAGOONS raise pistols and carbines, aiming them at Marion\nand his children.\n\nMARION FREEZES, torn between his fury and fear for his\nother children.  He locks his eyes on Tarleton.\n\nTARLETON calmly baths in Marion's anger.  Then, with a\nhard yank of the reins, he jerks his horse's head around\nand utters a sharp command to Wilkins.\n\n\t\t\t\tTARLETON\n\t\tMajor.\n\nTarleton spurs his horse and rides off without looking\nback.  His GREEN DRAGOONS THUNDER after him.\n\nMARION'S CHILDREN begin to cry.  Margaret tries to revive\nThomas' lifeless body, gently caressing his cheek.\n\n\t\t\t\tMARGARET\n\t\tThomas, please, Thomas...\n\nThe Redcoats watch in silence.  MARION LOOKS AT GABRIEL\nand turns to the Redcoat Lieutenant.   \n\n\t\t\t\tMARION\n\t\tLieutenant, please...\n\nThe Lieutenant wavers, but he looks after the departing\nTarleton and his resolve stiffens.  He turns coldly to\nMarion.\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tI have my orders.  Sergeant!\n\nThe Redcoat infantrymen scatter, some to get horses and\nwagons from the barn, others to torch the buildings.\n\nMARION stands among the children, all of whom look to\nMarion with pleading eyes, waiting for him to do\nsomething.\n\n\t\t\t\tMARGARET\n\t\tPapa, look what they did to\n\t\tThomas...\n\n\t\t\t\tNATHAN\n\t\tFather, they're going to take\n\t\tGabriel...\n\nWith stone-faced fury, Marion watches the Redcoats do\ntheir work.\n\nFrom the barns, they hear the sounds of MUSKETS FIRING and\nthe SQUEALS OF THE LIVESTOCK being killed.\n\nOther REDCOATS TORCH THE HOUSE, BARN AND OUTBUILDINGS.\nTHE FLAMES RISE.\n\nThe Redcoats bring out Marion's wagons and carriages and\nbegin loading the Redcoat wounded.\n\nThe Redcoat Lieutenant and several of his men walk among\nthe Patriot wounded who start to struggle to their feet,\nbegging for mercy.  The Redcoats quickly OPEN FIRE, as if\nto get it over with.\n\nThe WOUNDED PATRIOTS CRY OUT.  More SHOTS.  Then SILENCE.\n\nGABRIEL, his hands bound behind him, looks to his father\nwith a combination of resoluteness and fear.  Marion locks\neyes with him.\n\n\t\t\t\tNATHAN\n\t\tFather, you can't let them take\n\t\thim...\n\n\t\t\t\tMARION\n\t\tQuiet.\n\nMARION AND THE CHILDREN\n\nWatch as the Redcoats form up and move out, leading\nGabriel on a tether.  Gabriel looks back helplessly but a\nhard jerk on the rope by one of the Redcoats turns him\naround.  They disappear around a bend in the road.\n\nTHE INSTANT THE REDCOATS ARE OUT OF SIGHT, MARION speaks\nfirmly to his weeping children.\n\n\t\t\t\tMARION\n\t\tDon't move.\n\nMARION STRIDES to his front door and ENTERS THE BURNING\nHOUSE.\n\nINSIDE, FIRE EVERYWHERE.  Picking a route between the\nflames, Marion walks to his gun cabinet.  He opens it and\npulls out weapons -- two Pennsylvania rifles, two muskets,\ntwo pistols, a long-bladed knife and a worn tomahawk.  He\ncarries them, with powder horns and ammunition pouches\nback toward the door.\n\nMarion walks OUT OF THE BURNING HOUSE.\n\n\t\t\t\tMARION\n\t\tNathan, Samuel...\n\nWithout breaking stride, Marion throws muskets to Nathan\nand Samuel who catch them.\n\n\t\t\t\tMARION\n\t\tMargaret, take William and Susan to\n\t\tthe river shed.  Hide there.  If\n\t\twe're not back by dawn, go up the\n\t\triver to the Richardson's house.\n\t\tThey'll take you to your Aunt\n\t\tCharlotte's farm.  Nathan, Samuel,\n\t\tand I are going to get Gabriel.\n\n\t\t\t\tMARGARET\n\t\tBut what about Thomas?\n\n\t\t\t\tMARION\n\t\tLeave him.  Take care of William and\n\t\tSusan.\n\nMarion runs off toward the woods, Nathan and Samuel\nfollow.  Margaret hesitates, then herds William and Susan\ntoward the river.  The house is enveloped in flames.\n\nEXT.  WOODED PATH - AFTERNOON\n\nMarion runs, breathing hard, keeping a punishing, steady\npace.  Nathan and Samuel run behind, less winded than\ntheir father.  Marion makes up with cold fury what he\nlacks in youth.\n\nEXT.  WOODED HILLSIDE - AFTERNOON\n\nMarion runs up to the crest of a wooded hill.  Slows.\nCrawls the last few feet.  Nathan and Samuel just behind\nhim.  Looks over the hillside.\n\nA path runs through a glen, about fifty feet below.\nMarion's eyes dart, absorbing the terrain, looking for\nadvantage.  He points.\n\n\t\t\t\tMARION\n\t\tNathan, there.  Samuel, there.\n\nThe boys go where they're told.\n\n\t\t\t\tMARION\n\t\tI'll fire first.  Then, Nathan, kill\n\t\twhoever is standing closest to\n\t\tGabriel.  Samuel, kill the last man\n\t\tin the line.\n\nThey stagger under the weight of the orders.  Marion\nnotices but continues.\n\n\t\t\t\tMARION\n\t\tAfter that, Samuel, load for Nathan.\n\t\tIf something happens to me, put down\n\t\tyour weapons and run as fast as you\n\t\tcan, that way, downhill.  Hide in\n\t\tthe brush by the river, then make\n\t\tyour way home, get the others and go\n\t\tto Aunt Charlotte's farm.\n\nThe boys hesitate.  Marion looks at them firmly.\n\n\t\t\t\tMARION\n\t\tBoys... steady.\n\n\t\t\t\tNATHAN & SAMUEL\n\t\tYes, father.\n\nMarion disappears into the underbrush.\n\nDOWN THE PATH\n\nThe dozen Redcoats approach.  Leading Gabriel on the rope.\n\nAHEAD OF THEM\n\nMarion waits in the thick undergrowth.\n\nOn the hillside, Nathan and Samuel grip their muskets and\nexchange a frightened, troubled look.\n\nThe REDCOATS enter the glen.\n\nMARION waits, then picks his moment and FIRES, killing the\nRedcoat Lieutenant with a shot to the chest.\n\nNATHAN AND SAMUEL INSTANTLY FIRE, dropping the last\nRedcoat in the line and the one holding Gabriel's rope.\n\nTHE REDCOATS STOP in confusion...\n\nGABRIEL kneels, out of the line of fire.\n\nThe REDCOAT SERGEANT takes command...\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tFORM BY TWOS!  BACK-TO-BACK LINES...\n\nMARION KILLS the Sergeant with a shot to the throat...\n\nSamuel finishes reloading, swaps muskets with Nathan who\nFIRES, DROPPING ANOTHER REDCOAT.\n\n\t\t\t\tREDCOAT CORPORAL\n\t\tREADY...\n\nMarion FIRES, killing the Corporal, the last man of\nrank...\n\nMarion ducks to the side as a VOLLEY OF REDCOAT MUSKET\nFIRE tears into the spot marked by Marion's rifle smoke...\n\nFROM THIS MOMENT ON, MARION NEVER STOPS MOVING.  He\nstrides rather than runs, staying just inside the brush,\noffering only glimpses of himself.  He changes his pace\nand direction repeatedly, ducking and weaving, firing and\nloading while moving.  He never gives the Redcoats a\nstationary target, especially one marked by billowing\nsmoke from his flintlock.  It's an Indian tactic and it\nworks.\n\nThe Redcoats TRACK HIM WITH THEIR BARRELS, about to\nfire... Marion suddenly STOPS DEAD, REVERSES DIRECTION,\nseveral REDCOATS FIRE AND MISS.\n\nSix Redcoats left.  Some primed, some reloading.  A\nREDCOAT draws a bead on Marion who drops to the ground and\nFIRES, killing him.\n\nSamuel, WEEPING as he loads, hands a primed musket to\nNathan who FIRES...\n\nThe Redcoats turn their attention to THE SPOT MARKED BY\nNATHAN'S SMOKE...\n\nMarion SEES THE REDCOATS AIMING TOWARD THE BOYS.  He\ninstantly STRIDES OUT INTO THE OPEN, drawing the Redcoats'\nattention from his sons...\n\nMarion FIRES BOTH HIS PISTOLS, killing two Redcoats...\n\nOne Redcoat finishes reloading... Marion rushes him,\nshoves aside the barrel and SLAMS him in the face with the\nbutt of the musket...\n\nThis is a DIFFERENT MARION, a vicious, savage Marion,\nkilling with stunning brutality...\n\nMarion drops his own expended rifle and CATCHES THE\nREDCOAT'S LOADED MUSKET before it hits the ground shoves\nthat musket into another Redcoat's belly and FIRES...\n\nTwo Redcoats left, neither finished loading...\n\nMARION CHARGES, drawing his TOMAHAWK, ignores a GLANCING\nBAYONET WOUND to the neck, HACKS a Redcoat open...\n\nSplattering himself with BLOOD...\n\nThe final Redcoat, a cherubic-face young man, ducks into\nthe woods... Marion tears after him...\n\nA FOOTRACE... the young Redcoat BLASTING THROUGH THE\nBRUSH... the older Marion, panting, losing ground...\n\nA CLEARING... the Redcoat is almost to the cover of the\ntrees on the far side...\n\nMARION THROWS HIS TOMAHAWK which FLIES through the air and\nSINKS IN THE REDCOAT'S BACK...\n\nMarion runs to the wounded Redcoat, grabs his hair, yanks\nback his head and SLITS HIS THROAT...\n\nThen, without pausing, Marion wrenches the tomahawk from\nthe Redcoat's body, and races back toward his sons...\n\nAT THE GLEN\n\nNathan and a weeping Samuel, stunned at the carnage,\nstumble down the hillside toward Gabriel.  Marion runs up\nand motions for them to stop.\n\nMarion, checks the Redcoats, making sure they're all dead.\n\n\t\t\t\tMARION\n\t\tSamuel, reload.  Nathan, untie\n\t\tGabriel.\n\nThey quickly do so as Marion picks up a loaded musket and\nscans the road and the underbrush.  In a moment they're\nready.  Marion finds his own Pennsylvania rifle, then he\nand his sons disappear into the underbrush.\n\nEXT.  POND BLUFF - DAY\n\nThe house and barns smolder.  Thomas' body lies in the\nyard.  Nearby, the bodies of the Patriot wounded, now\ndead.\n\nEXT.  RIVER SHED - POND BLUFF - DAY\n\nMargaret waits in the shed with William and Susan.  They\nhear a SOUND.  APPROACHING FOOTSTEPS.  Margaret pulls her\nsister and brother to her and waits.\n\nThe door opens.  It's Marion and Gabriel, Nathan and\nSamuel.  Margaret and the little ones throw themselves\ninto Marion's arms.\n\nMargaret notices the blood on Marion.  She hesitates but\nher relief tightens her embrace.\n\nEXT.  POND BLUFF - DAY\n\nMarion, trailed by his children, walks past the soldiers'\nbodies and the remains of their house.\n\nHe kneels down next to Thomas' body.  On the ground Marion\nsees several of THOMAS' LEAD SOLDIERS.  He stares at them\nfor a moment, picks them up and puts them in his pocket.\n\nMarion picks up Thomas and carries him up the hill toward\nthe apple tree and Elizabeth's grave.  The children\nfollow.\n\nEXT.  HILLTOP - POND BLUFF - DAY\n\nMarion digs a grave.  The children watch.  The only sounds\nare Marion's labored BREATHING, the RASP OF THE SHOVEL and\nthe RUSTLE OF DEAD LEAVES blown along the ground by a soft\nwind.\n\nSome dry leaves catch on Thomas' still wet blood, as if\ntrying to bandage his wound.\n\nEXT.  HILLTOP - POND BLUFF - DAY (LATER)\n\nMarion puts the last shovelfuls of dirt on the grave.\nNear tears and unsure of what to do next, he turns to\nElizabeth's gravestone.  The soft wind blows.  Marion\nlistens.\n\nHe turns and sees his children looking up at him.  Holding\nin his own tears, he gathers the children around him and\nlet's them cry.\n\n\t\t\t\tMARION\n\t\tThere, there... he's alright... he's\n\t\twith your mother now...\n\nHe stiffens, speaking formally:\n\n\t\t\t\tMARION\n\t\tLord, we pray that You accept this\n\t\tchild, Thomas Marion and give him a\n\t\tplace at Your side with his mother.\n\t\tWe ask that You embrace him and help\n\t\tus to understand the manner in which\n\t\tYour mercy works.  This we ask, in\n\t\tYour name.  Amen.\n\n\t\t\t\tMARION'S CHILDREN\n\t\tAmen.\n\nMarion looks at Elizabeth's grave, then he gently eases\nhis children away.\n\nEXT.  BENNINGTON OVERLOOK - DAY\n\nMarion and his children stop at the overlook, seeing the\nSantee River valley spread out before them.  The SMOKE\nfrom two dozen farms rises.\n\n\t\t\t\tGABRIEL\n\t\tThe Morgans, the Halseys, Williams,\n\t\tStantons...\n\nThe smoke from the separate fires joins together high in\nthe sky, forming what looks like stormclouds.  They walk\non.\n\nEXT.  CHARLOTTE'S FARM - NIGHT\n\nMarion and his children wait in the cover of the woods.\nThey see a pair of shadowed figures coming toward them\nfrom the house, Gabriel and Charlotte.\n\n\t\t\t\tGABRIEL\n\t\tFather, it's safe.\n\nMarion hustles the children out of the woods.\n\nINT.  BEDROOM - NIGHT\n\nCharlotte sits, holding a sleeping Susan.  The other\nchildren lie awake on pallets.  Marion, still streaked\nwith dried blood and sweat, tucks William and Margaret\ninto bed.\n\n\t\t\t\tMARION\n\t\tSleep, now.\n\nMarion moves on to Nathan.\n\n\t\t\t\tNATHAN\n\t\tFather... I killed those men...\n\n\t\t\t\tMARION\n\t\tDon't blame yourself, you did what I\n\t\ttold you to do.\n\n\t\t\t\tNATHAN\n\t\tI'm glad I killed them... I'm\n\t\tglad...\n\nMarion isn't.  He turns to Samuel who's cried-out.  Marion\nreaches out to touch him but Samuel recoils from Marion's\nblood-streaked hand.  Marion sighs and tucks him in.\n\n\t\t\t\tMARION\n\t\tTry to get some sleep.\n\nMarion moves to take Susan from Charlotte who shakes her\nhead.\n\n\t\t\t\tCHARLOTTE\n\t\tI'll stay with them.\n\nMarion nods and leaves Charlotte with the children.\n\nINT.  CHARLOTTE'S LIVING ROOM - NIGHT\n\nMarion enters.  He starts to pace but grows unsteady.  He\nrears back as if screaming but no sound comes from his\nmouth, as he looks upstairs, knowing his children are\nsearching for the solace of sleep.\n\nHe opens a cabinet, pulls out a bottle of liquor, pours\nand drinks.  Then another.\n\nTHE SOUND OF HORSEMEN.  Gabriel walks in.  Tired.  Grim.\n\n\t\t\t\tGABRIEL\n\t\tHow are they?\n\nMarion just shakes his head.\n\n\t\t\t\tGABRIEL\n\t\tGates is at Hillsboro with the\n\t\tContinental Army.  I'll leave in the\n\t\tmorning to join him.\n\nMarion nods.  Marion and Gabriel stand in silence for a\nlong moment, neither one finding words.  Then Gabriel\nspeaks softly.\n\n\t\t\t\tGABRIEL\n\t\tI'll tend my horse.\n\nHe leaves Marion alone.\n\nINT.  CHARLOTTE'S FARMHOUSE - NIGHT (LATER)\n\nMarion stares at the fireplace.  Charlotte walks in\ncarrying a pitcher and fresh clothing.\n\n\t\t\t\tCHARLOTTE\n\t\tThey're asleep.\n\nMarion is silent.  Charlotte pours water into a washbowl\nand motions to Marion.  He takes off his shirt.  She\nbegins cleaning away the blood and tending the wound on\nhis neck.\n\n\t\t\t\tMARION\n\t\tHow did this... how did I let this\n\t\thappen?\n\n\t\t\t\tCHARLOTTE\n\t\tYou couldn't have known.\n\n\t\t\t\tMARION\n\t\tI should have known... once I would\n\t\thave... I used to be wary... and\n\t\ttoday I watched my son killed before\n\t\tmy eyes... your sister civilized me\n\t\tand I damn myself for having let\n\t\ther...\n\n\t\t\t\tCHARLOTTE\n\t\tThomas is dead but you've done\n\t\tnothing for which you should be\n\t\tashamed.\n\n\t\t\t\tMARION\n\t\tI've done nothing and for that I am\n\t\tashamed.\n\nShe looks at him closely.\n\n\t\t\t\tCHARLOTTE\n\t\tIf you go, I'll care for them as if\n\t\tthey were my own.\n\n\t\t\t\tMARION\n\t\tI'll leave in the morning with\n\t\tGabriel.\n\nHe stares past her, looking at the flames in the\nfireplace.  She tends his wounds.\n\nEXT.  PORCH - CHARLOTTE'S FARMHOUSE - MORNING\n\nMarion and Gabriel finish saddling their horses.  Marion\nembraces Nathan and Samuel.  Then he turns to Margaret,\nWilliam and Susan.\n\n\t\t\t\tWILLIAM\n\t\tWhen will you be back?\n\n\t\t\t\tMARION\n\t\tI don't know, William.\n\n\t\t\t\tWILLIAM\n\t\tTomorrow?\n\nMarion winces.  Margaret puts her arm around William.\n\n\t\t\t\tMARGARET\n\t\tNo, not tomorrow.\n\nMarion kisses them both, then moves on to Susan, trying to\ncoax a word out of the silent four-year-old:\n\n\t\t\t\tMARION\n\t\tGoodbye?\n\nShe just looks at him.\n\n\t\t\t\tMARION\n\t\tJust one word?  Goodbye?  That's all\n\t\tI want.\n\nSusan shakes her head.  He sighs, rises and turns to\nCharlotte.  They hesitate, then embrace, hugging deeply\nbut a bit awkwardly, holding each other just a moment\nlonger than one would expect.  She looks up at him... he\nkisses her on the cheek.\n\nMarion mounts up.  And he and Gabriel head off, Susan,\nunnoticed and unheard, whispers:\n\n\t\t\t\tSUSAN\n\t\tGoodbye.\n\nMarion and Gabriel ride away.\n\nEXT.  CAMDEN ROAD - DAY\n\nMarion and Gabriel ride past the signs of a small\nskirmish.  Bodies.  Abandoned wagons.  Dead horses.  A\nburning farm.\n\nEXT.  CAMDEN HILLSIDE - DAY\n\nMarion and Gabriel ride to the crest of a hill.  A vista\nspreads out before them.  They see an awesome sight -- A\nMASSIVE SLASH OF RED approaches a MASSIVE SLASH OF BLUE.\nA battle is taking place about five miles away.\n\nGabriel starts to spur his horse but Marion restrains him.\n\n\t\t\t\tMARION\n\t\tNo, it's too late.\n\nGabriel stops.  Marion points out brightly colored\nclusters of men behind each army.\n\n\t\t\t\tMARION\n\t\tCommand posts... Patriot...\n\t\tBritish...\n\nThe distant slash of red stops.  Marion and Gabriel hear\nonly a GENTLE WIND and some nearby SONGBIRDS.\n\nThen, from a black mass of the side of the red slash, a\nsudden, silent eruption of white smoke.\n\nAn instant later, the blue slash quivers.  A moment later\nthe SOUND OF THE CANNONS, RUMBLES UP THE HILL and rolls\nover Marion and Gabriel.\n\nThe RED SLASH STOPS moving.  It darkens as thousands of\nRedcoats raise their muskets and the front ranks kneel\ninto firing position.\n\nMarion's eyes dart.  He knows what's coming.\n\n\t\t\t\tMARION\n\t\tBreak for the trees... break for the\n\t\ttrees...\n\nA MASSIVE ERUPTION OF WHITE SMOKE billows from the red\nslash.  An instant later, the blue line starts to break up\nas hundreds of distant Patriots fall.\n\nThe SOUND OF THE BRITISH MUSKETS reaches Marion and\nGabriel like the pattering of rain.\n\nThen the SMOKE OF INEFFECTIVE, SCATTERED VOLLEYS erupts\nfrom the Patriot lines.  The red line holds firm.\n\n\t\t\t\tMARION\n\t\tSend them to cover!  Goddamn you!\n\nBut the blue line of the Patriots stays in the open field.\n\nFrom behind the Redcoats, FAST-MOVING GREEN AND RED MASSES\nmove quickly onto the battlefield.  CAVALRY.\n\n\t\t\t\tGABRIEL\n\t\tFather, we have to do something...\n\nThe British cavalry slams into the blue line, shattering\nit.  Tiny bits of blue move in every direction.\n\n\t\t\t\tGABRIEL\n\t\tFather...\n\n\t\t\t\tMARION\n\t\tIt's already over.\n\nMarion watches, appalled.  At this distance the moving\nslashes of color and billowing smoke are strangely\nbeautiful.  Marion turns his horse and heads down the\nhill, toward the rear of the Patriot lines.\n\nEXT.  AMERICAN ENCAMPMENT - NIGHT\n\nA nightmare.  SCREAMS OF AGONY.  A few hundred battered,\nPatriot survivors treat their wounded and prepare to move\nout.  The battle, so bloodless and beautiful at a\ndistance, has, in its aftermath, become horrifically\npainful and ugly.\n\nMarion and Gabriel ride into camp, passing nervous\nsentries and a field surgery which is surrounded by pools\nof blood and amputated legs and arms.  Marion sees HARRY\nLEE at a make-shift command post, barking orders, trying\nto pull things together.\n\n\t\t\t\tLEE\n\t\tDamn you, Sergeant, don't move the\n\t\twounded twice, put them straight on\n\t\tthe wagons from the surgeons.\n\n\t\t\t\tPATRIOT SERGEANT\n\t\tYes, sir.\n\n\t\t\t\tLEE\n\t\tLieutenant, detail men for\n\t\toutriders.  We move out as soon as\n\t\tthe wounded are ready.\n\n\t\t\t\tLIEUTENANT\n\t\tYes, sir.\n\nThe Lieutenant rushes off.  Lee notices Marion and\nGabriel, surprised to see them.  He jerks his head for\nthem to follow him into:\n\nLEE'S COMMAND TENT\n\nOnce out of sight of the men, Lee loses his command\nbearing.  Exhausted, he leans on his campaign table and\nlooks closely at Marion, asking with his eyes why Marion\nis here.\n\n\t\t\t\tMARION\n\t\tGreen Dragoons came to my home,\n\t\tkilled my son, Thomas.  It was\n\t\tTarleton himself.\n\n\t\t\t\tLEE\n\t\tI'm sorry.\n\n\t\t\t\tMARION\n\t\tI'm sorry I wasn't here for this.\n\n\t\t\t\tLEE\n\t\tThere's nothing you could have done,\n\t\tGates is a damned fool.\n\n\t\t\t\tMARION\n\t\tWe saw.\n\n\t\t\t\tLEE\n\t\tI begged him to stay in the cover of\n\t\tthe trees but he insisted the only\n\t\tway to break Cornwallis was muzzle-\n\t\tto-muzzle.  He spent too many years\n\t\tin the British army.\n\n\t\t\t\tMARION\n\t\tWhere is he now?\n\n\t\t\t\tLEE\n\t\tLast anyone saw, riding hard,\n\t\tnortheast, his staff a hundred yards\n\t\tbehind, trying to catch up.\n\n\t\t\t\tMARION\n\t\tWho's in command?\n\n\t\t\t\tLEE\n\t\tI am, I think.\n\n\t\t\t\tMARION\n\t\tWhat are my orders?\n\nLee gives Marion a tired smile.\n\n\t\t\t\tLEE\n\t\tIf you want orders, I've got some\n\t\tfor you.\n\nLee ROLLS OUT A MAP for Marion and Gabriel.\n\n\t\t\t\tLEE\n\t\tWe're a breath away from losing this\n\t\twar.  In the North, Washington is\n\t\treeling from Valley Forge, running\n\t\tand hiding from Clinton and twelve\n\t\tthousand Redcoats.\n\t\t\t   (pointing)\n\t\tHere in the South, Cornwallis has\n\t\tbroken our back.  He captured over\n\t\tfive thousand of our troops when he\n\t\ttook Charleston and today he\n\t\tdestroyed the only army that stood\n\t\tbetween him and New York.\n\n\t\t\t\tMARION\n\t\tSo now Cornwallis will head north,\n\t\tlink up with Clinton and finish off\n\t\tWashington.\n\n\t\t\t\tLEE\n\t\tAnd Patriots will start dying on the\n\t\tgallows instead of the battlefield.\n\t\t\t   (beat)\n\t\tUnless we can keep Cornwallis in the\n\t\tSouth until the French arrive.  A\n\t\ttreaty was signed at Versailles\n\t\tafter our victory at Saratoga.  The\n\t\tFrench are sending a fleet and ten\n\t\tthousand troops.\n\n\t\t\t\tMARION\n\t\tWhen?\n\n\t\t\t\tLEE\n\t\tFall, six months at the earliest.\n\n\t\t\t\tMARION\n\t\tLong time.\n\n\t\t\t\tLEE\n\t\tThe bigger problem is where, not\n\t\twhen.  The French fleet won't sail\n\t\tnorth of the Chesapeake for fear of\n\t\tearly storms.\n\n\t\t\t\tMARION\n\t\tSo you're going to try to keep\n\t\tCornwallis in the South until then.\n\n\t\t\t\tLEE\n\t\tNot me, you.  I'm going north with\n\t\tevery Continental regular I can find\n\t\tto reinforce Washington or he won't\n\t\tlast six weeks.\n\n\t\t\t\tMARION\n\t\tYou expect Cornwallis to be held\n\t\there by militia?\n\n\t\t\t\tLEE\n\t\tNot held, just slowed down.\n\n\t\t\t\tMARION\n\t\tThey're nothing but farmers and\n\t\tyou're asking them to try to keep a\n\t\ttiger in their backyard.  They'd be\n\t\tbetter off letting it move on.\n\n\t\t\t\tLEE\n\t\tThey'd be better off, but the cause\n\t\twouldn't be.\n\n\t\t\t\tMARION\n\t\tHow many men does Cornwallis have\n\t\tunder his command?\n\n\t\t\t\tLEE\n\t\tFour thousand infantry and around\n\t\tsix hundred cavalry...\n\t\t\t   (beat)\n\t\t... including the Green Dragoons\n\t\tunder Tarleton.\n\nAt the mention of Tarleton, Marion nods.\n\n\t\t\t\tMARION\n\t\tI'll do what I can.\n\nLee quickly writes something.\n\n\t\t\t\tLEE\n\t\tI'm giving you a field commission as\n\t\ta colonel.\n\nHe hands it to Marion.  Gabriel steps forward.\n\n\t\t\t\tGABRIEL\n\t\tColonel Lee, I request a transfer to\n\t\tColonel Marion's command.\n\n\t\t\t\tLEE\n\t\tGranted.\n\nLee scribbles another order and hands it to Gabriel.  Then\nhe turns to Marion.\n\n\t\t\t\tLEE\n\t\tGood luck.\n\nMarion nods.  They duck out of the tent.\n\nEXT.  AMERICAN ENCAMPMENT - NIGHT (LATER)\n\nMarion and Gabriel stand watching Lee and his Continental\nregulars move out.  Gabriel turns to Marion.\n\n\t\t\t\tGABRIEL\n\t\tWhat now, sir?\n\n\t\t\t\tMARION\n\t\tWe put out the word.  We'll start\n\t\talong the south side of the\n\t\tSantee...\n\n\t\t\t\tGABRIEL\n\t\tWe'd cover more ground if we split\n\t\tup.\n\n\t\t\t\tMARION\n\t\tIt's safer if we stay together.\n\nGabriel steps in front of Marion.\n\n\t\t\t\tGABRIEL\n\t\tColonel, I didn't request this\n\t\ttransfer because you're my father.\n\t\tI requested it because I believe in\n\t\tthis cause and this is where I can\n\t\tdo the most good.\n\n\t\t\t\tMARION\n\t\tOh?\n\n\t\t\t\tGABRIEL\n\t\tI've been doing this for two years.\n\t\tI'm the best scout in the\n\t\tContinental Army, the best horseman,\n\t\tthe best shot, the best scavenger\n\t\tand I know every deer path and swamp\n\t\ttrail between here and Charleston.\n\n\t\t\t\tMARION\n\t\tIs that so?\n\n\t\t\t\tGABRIEL\n\t\tYes, sir.\n\t\t\t   (beat)\n\t\tMy father taught me.\n\nMarion looks at Gabriel closely.\n\n\t\t\t\tMARION\n\t\tDid your father teach you humility?\n\n\t\t\t\tGABRIEL\n\t\tHe tried.  It didn't take.\n\nMarion looks Gabriel up and down.\n\n\t\t\t\tMARION\n\t\tAlright, Corporal, you take\n\t\tBennington, Harrisville, Acworth and\n\t\tthe farms along Black Swamp.  I'll\n\t\ttake the north side of the river.\n\t\tWe'll meet at Snow's Island.\n\n\t\t\t\tGABRIEL\n\t\tYes, sir.\n\nThey mount up.\n\n\t\t\t\tMARION\n\t\tAnd, Corporal...\n\t\t\t   (beat)\n\t\t... be careful.\n\n\t\t\t\tGABRIEL\n\t\tYes...\n\t\t\t   (beat)\n\t\t... father.\n\nThey ride off in different directions.\n\nEXT.  BRADFORD VILLAGE - NIGHT\n\nMarion rides into a small village, passing several bodies\nin blue Continental uniforms, hanging from lampposts.\nMarion stops in front of a tavern, dismounts and enters.\n\nINT.  TAVERN - BRADFORD - NIGHT\n\nAs Marion walks in he's greeted by cold stares from half-\na-dozen men, huddles over their drinks.\n\n\t\t\t\tMARION\n\t\tI'm looking for John Billings.\n\n\t\t\t\tBARTENDER\n\t\tHe's dead.\n\nMarion looks closely at the grim, suspicious men.\n\n\t\t\t\tMARION\n\t\tIf he comes back from the dead, tell\n\t\thim Francis Marion is looking for\n\t\thim.\n\n\t\t\t\tBARTENDER\n\t\tI'll be sure to do that.\n\nAs Marion turns to leave he notices an open bottle of\nMadeira on one of the tables.  He stops.\n\n\t\t\t\tMARION\n\t\tI'll wait.  Miracles happen.\n\nA stand-off.  Then, a hulking FIGURE appears in the\nshadows at the back doorway.  He's JOHN BILLINGS, big,\ncoarse, about Marion's age.  Billings jerks his head for\nMarion to join him in the back room.\n\nINT.  BACK ROOM - TAVERN - NIGHT\n\nDark.  Marion and billings talk over a bottle.\n\n\t\t\t\tBILLINGS\n\t\tYou expect to hold Cornwallis with\n\t\tmilitia?\n\n\t\t\t\tMARION\n\t\tI expect to try.\n\n\t\t\t\tBILLINGS\n\t\tTrust you and Harry Lee.  Remember\n\t\tthat damned overland you two thought\n\t\tup in '62 to hit Fort Louis?\n\n\t\t\t\tMARION\n\t\tIt worked.  How many men can you\n\t\traise?\n\n\t\t\t\tBILLINGS\n\t\tNot many.  Dalton, Scott, they've\n\t\tgot their reasons; Rev. Oliver,\n\t\the believes in the cause; some of\n\t\tthe young bucks; a few like me with\n\t\tnothing to lose...\n\t\t\t   (beat)\n\t\tWhat about you?  You've got a lot to\n\t\tlose.\n\nMarion drains his glass and stands up.\n\n\t\t\t\tMARION\n\t\tYou coming, or not?\n\nBillings drains his glass.  They walk out together.\n\nEXT.  TAVERN - BRADFORD - NIGHT\n\nMarion and Billings ride away from the tavern, passing the\nhanging Patriot bodies.\n\nEXT.  SNOW'S ISLAND - SANTEE SWAMPS - NIGHT\n\nA CACOPHONY OF BIRDS AND INSECTS.  Swamp maples and\nwillows form a canopy over moss-covered mounds and pools\nof plant-choked water.\n\nGabriel leads several men, riding along a dry path that\nsnakes through the swamp.  They cross a narrow land bridge\nonto a wooded island, joining a dozen-and-a-half men,\nincluding Marion who kneels at a campfire.\n\nCLOSE SHOT:  Several of Thomas' brightly painted LEAD\nSOLDIERS MELT in a cast-iron pan.  The little men fall to\ntheir knees then lose form, turning into bubbling, molten\nmetal.\n\nThe new arrivals dismount and greet the others.\n\nGabriel steps up behind Marion and watches as he pours the\nlead into a bullet mold, closes the lid and dips the mold\ninto a bucket of water which HISSES and STEAMS.\n\n\t\t\t\tGABRIEL\n\t\tFather, this war is about more than\n\t\tThomas.\n\nMarion doesn't look up.\n\n\t\t\t\tMARION\n\t\tIs it?\n\n\t\t\t\tGABRIEL\n\t\tIf you're here only for revenge,\n\t\tyou're doing a disservice to him as\n\t\twell as yourself.\n\n\t\t\t\tMARION\n\t\tHow old are you?\n\n\t\t\t\tGABRIEL\n\t\tYou know how old I am.\n\n\t\t\t\tMARION\n\t\tGod help us all when you're forty.\n\nMarion puts some more lead soldiers into the pan.  Gabriel\nshakes his head, turns away and goes to tend his horse.\n\nEXT.  SNOW'S ISLAND ENCAMPMENT - MORNING\n\nDay breaks.  A low, thick swamp mist covers the\nencampment.  Marion, sits alone by the embers of last\nnight's campfire.  The men are awake.  Some eat, others\ntalk.\n\nMarion pulls himself out of his dark reverie.  He takes\nthe bullets from the mold and puts them in a pouch\nattached to his weapons' belt.  Then he rises and heads\nover to the men.\n\nHe surveys his brigade.  Twenty-six men:  framers,\nartisans, mountain men, none in uniform.  Marion walks\namong them, nodding familiarly to several.  He notices an\nimposing looking Cherokee Indian, BROTHER JOSEPH, standing\na bit apart from the others.  They exchange nods.\n\nHe notices a stern-looking man in partial clerical garb,\nREV. CHARLES OLIVER.\n\n\t\t\t\tMARION\n\t\tReverend.\n\n\t\t\t\tREV. OLIVER\n\t\tI heard about your son.  I'm sorry.\n\nMarion accepts his condolences.  He notes GEORGE DALTON, a\ntough-looking, rustic man with an ice-cold, distant stare.\n\n\t\t\t\tMARION\n\t\tDalton.\n\nDalton doesn't respond.  Marion recognizes another face,\nABNER BROWN, African-American, around thirty, rugged.\n\nMarion addresses the men who do not gather around so much\nas just give him their attention.\n\n\t\t\t\tMARION\n\t\tYou all have your own reasons for\n\t\tbeing here.  I lost a son and I\n\t\tintend to kill the man who killed\n\t\thim...\n\nMarion pauses and looks over at Gabriel.\n\n\t\t\t\tMARION\n\t\t... But I don't consider that man's\n\t\tlife adequate payment for the life\n\t\tof my son, and killing him won't\n\t\tkeep the sons of other men from\n\t\tdying...\n\nGabriel nods, approvingly.\n\n\t\t\t\tMARION\n\t\tCornwallis has to move north.  We\n\t\thave to keep him right here.  If\n\t\the's south of the Chesapeake when\n\t\tthe French arrive, if the French\n\t\tarrive, we have a chance of winning\n\t\tthis war.\n\nMarion looks from face to face.\n\n\t\t\t\tMARION\n\t\tEat, get some rest, we move out in\n\t\ttwo hours.\n\nMarion heads back to his campsite, passing Gabriel without\nlooking at him, but very aware of his son's eyes on him.\n\nEXT.  BRITISH FIELD HEADQUARTERS - CAMDEN - DAY\n\nA massive British army field encampment.  Thousands of\nwell-armed, veteran troops.  Large detachments of Redcoats\nmarch through endless rows of tents.  Some are battle-\nworn, others are fresh troops moving out.\n\nTARLETON and his GREEN DRAGOONS, covered with dirt and\nsweat, ride into the encampment.  Tarleton and Wilkins\npeel off, riding to the front of a farmhouse that has been\ncommandeered for British headquarters.  They dismount and\nstride in.\n\nINT.  CORNWALLIS' HEADQUARTERS - CAMDEN FARMHOUSE - DAY\n\nBritish officers, clerks and aides work.  They're in good\nspirits.  LORD CORNWALLIS, a proud man, comfortable with\ncommand, coldly notes one of his officers slapping another\non the back.  MAJOR HUNTINGTON rolls out a map for\nCornwallis.\n\n\t\t\t\tCORNWALLIS\n\t\tGentlemen.\n\nThe officers gather around the map.\n\n\t\t\t\tCORNWALLIS\n\t\tMajor, this is not an adequate map.\n\n\t\t\t\tMAJOR HUNTINGTON\n\t\tWe have better coming on the\n\t\ttrailing supply convoy from\n\t\tCharleston.\n\n\t\t\t\tCORNWALLIS\n\t\tA useful place for our maps.\n\n\t\t\t\tMAJOR HUNTINGTON\n\t\tI'm sorry, sir, it won't happen\n\t\tagain.\n\nTarleton enters, followed by Wilkins.\n\n\t\t\t\tCORNWALLIS\n\t\tMy harrier.  Join us, Colonel.\n\n\t\t\t\tTARLETON\n\t\tSir.\n\nTarleton and Wilkins join them around the map.\n\n\t\t\t\tCORNWALLIS\n\t\tGentlemen, celebration is premature.\n\t\tWe have a difficult campaign ahead\n\t\tof us.  We are in predominately\n\t\thostile country and we cannot rely\n\t\ton forage.  As we move north, the\n\t\tbulk of our supplies will reach us\n\t\tby sea, through Charleston, which\n\t\twill give us a long and vulnerable\n\t\tsupply line, one that can only be\n\t\tsecured if the locals are loyal to\n\t\tthe crown.\n\n\t\t\t\tCORNWALLIS' OFFICERS\n\t\t\t   (multiple)\n\t\tYes, sir.\n\nCornwallis turns to his field officers, paying particular\nattention to Tarleton.\n\n\t\t\t\tCORNWALLIS\n\t\tNonetheless, we must remember that\n\t\tthis is a civil war...\n\nTarleton proudly holds Cornwallis' look.\n\n\t\t\t\tCORNWALLIS\n\t\tThese colonials are our brethren and\n\t\twhen this conflict is over, we will\n\t\tbe reestablishing commerce with\n\t\tthem.  Surrendering troops will be\n\t\tgiven quarter and unwarranted\n\t\tassaults on civilians will cease.\n\nWilkins shifts uneasily.  Tarleton isn't cowed.\n\n\t\t\t\tCORNWALLIS\n\t\tI expect this war to be fought in a\n\t\tvigorous but civilized manner.\n\nCornwallis looks at his other officers.\n\n\t\t\t\tCORNWALLIS\n\t\tHave I made myself clear, gentlemen?\n\n\t\t\t\tOFFICERS\n\t\t\t   (multiple)\n\t\tYes, sir.\n\nCornwallis shifts his eyes back to Tarleton who was not\namong those who spoke.  Tarleton pointedly pauses a\nmoment, then says:\n\n\t\t\t\tTARLETON\n\t\tYes, sir.\n\nCornwallis turns his attention back to the map.  His men\ngather around.\n\nEXT.  CORNWALLIS' FIELD HEADQUARTERS - CAMDEN - DAY\n\nTarleton and Wilkins walk out and mount up.\n\n\t\t\t\tWILKINS\n\t\tI believe he was speaking to us,\n\t\tColonel.\n\n\t\t\t\tTARLETON\n\t\tDid you know that Lord Cornwallis'\n\t\tfather was a tenant on the estate of\n\t\tmy grandfather?\n\nTarleton jerks his reins and rides off.  Wilkins laughs\nand follows.\n\nEXT.  WOODED ROAD - DAY\n\nA British supply train of several dozen wagons, a herd of\nhorses and accompanying Redcoats makes its way.\n\nON A WOODED HILLSIDE, Gabriel lies on the ground,\nobserving the convoy.  He eases back, mounts up, and rides\noff.\n\nEXT.  BRIDGE - SANTEE RIVER - DAY\n\nMarion and his men wait, well-hidden in the brush on a\nrise, just above the bridge.  Gabriel rides up.\n\n\t\t\t\tGABRIEL\n\t\tLess than a mile.  Forty-one wagons,\n\t\ta company of Redcoat infantry,\n\t\thorses at the rear.\n\n\t\t\t\tMARION\n\t\tFlanking riders?\n\n\t\t\t\tGABRIEL\n\t\tI didn't see any.\n\nMarion nods and motions to his men who check their weapons\nand pass the word.  Gabriel ties up his horse and takes a\nposition near his father.\n\nEXT.  SANTEE ROAD - NIGHT\n\nThe British convoy rounds the curve.  When two-thirds of\nthe wagons have crossed the bridge, Marion FIRES, killing\nthe Redcoat of highest rank, a CAPTAIN.\n\nBILLINGS AND DALTON heave CORKED BOTTLES which break,\nspreading their OILY CONTENTS on the wooden bridge.\n\nBROTHER JOSEPH fires a FLAMING ARROW, igniting the oil.\n\nThe BRIDGE BURSTS INTO FLAMES, cutting off the tail of the\nconvoy, stranding a dozen wagons and the herd of horses on\nMarion's side of the river.\n\nA REDCOAT LIEUTENANT takes command.\n\n\t\t\t\tREDCOAT LIEUTENANT\n\t\tAcross the river!  Covering fire!\n\t\tDouble rank!\n\nMarion calls to his men.\n\n\t\t\t\tMARION\n\t\tEpaulets first... Kill the officers.\n\nMarion and his men FIRE A WITHERING VOLLEY, KILLING ALL\nREDCOATS OF RANK -- two lieutenants, a sergeant and\nseveral corporals.\n\nThe LEADERLESS REDCOAT PRIVATES take cover as Marion's men\nOPEN UP on the Redcoats on their side of the river.\n\n\t\t\t\tMARION\n\t\tTHE WAGONS!\n\nWith half of his men FIRING COVER, Marion and the other\nhalf run to the wagons, passing Redcoat dead and\nwounded...\n\nDALTON, notices a WOUNDED REDCOAT and pauses...\n\nThe Redcoat looks up imploringly at Dalton who finishes\nreloading, then coldly FIRES, KILLING THE helpless\nRedcoat...\n\nMarion, Gabriel and Rev. Oliver see Dalton kill the\nwounded Redcoat as they race toward the wagons, British\nmusketballs SPLINTERING TREES all around them...\n\nThe horses nearest the burning bridge are terrified,\nBUCKING AND REARING, STRUGGLING in their traces...\n\nMARION LEAPS INTO THE SEAT of one wagon.  Gabriel and\nBillings grab the reins of two more wagons.\n\nThe Redcoats keep up a STEADY FIRE.  TWO OF MARION'S MEN\nFALL, one dead another wounded.\n\nMarion, Gabriel and Billings STRUGGLE TO CONTROL THE\nFRIGHTENED HORSES, backing them up around the curve to the\ncover of the woods.\n\nMARION'S REARGUARD, Brother Joseph, Abner, Dan Scott and\nothers, withdraws in leapfrog, FIRING BACK ACROSS THE\nRIVER.\n\nBRITISH MUSKET BALLS SLAM into the trees and SPLINTER THE\nWAGONS...\n\nAnother of Marion's men is WOUNDED.  Two of his comrades\nHEAVE HIM onto one of the wagons...\n\nAs Marion's men get the wagons turned and unblocked from\neach other, they DRIVE THEM OFF, one after another...\n\nBrother Joseph, Abner and the rest of the rearguard make\nit to Marion and LEAP INTO HIS WAGON...\n\nMARION snaps the reins and they THUNDER OFF, away from the\nBURNING BRIDGE and the FIRING Redcoats.\n\nEXT.  SNOW'S ISLAND - DAY\n\nMarion's men tend their wounded and look through the\nBritish wagons, taking inventory.\n\n\t\t\t\tREV. OLIVER\n\t\t... two-hundred-sixty-six Brown Bess\n\t\tmuskets, forty-one casks of powder,\n\t\tballs, tamping...\n\n\t\t\t\tBILLINGS\n\t\tWe have enough arms for an army.\n\t\tNow all we need is an army.\n\nMarion checks out a wagon full of tools with DAN SCOTT and\nROB FIELDING, a couple of sharp-eyed craftsmen.  They\noverlap dialogue, rapidly speaking the private language of\ncolonial artisans.\n\n\t\t\t\tSCOTT\n\t\tReamer, boring tool...\n\n\t\t\t\tMARION\n\t\tSwage, broach, etching tool...\n\n\t\t\t\tFIELDING\n\t\tA rolling gunsmith's shop...\n\n\t\t\t\tSCOTT\n\t\tWe can rifle those musket barrels...\n\n\t\t\t\tFIELDING\n\t\tGet another hundred yards out of\n\t\t'em...\n\n\t\t\t\tMARION\n\t\tWe'll need a forge...\n\n\t\t\t\tSCOTT\n\t\tEasy enough...\n\n\t\t\t\tMARION\n\t\tWe've got clay to make a chamber...\n\n\t\t\t\tFIELDING\n\t\tOak to make charcoal...\n\n\t\t\t\tSCOTT\n\t\tOil cloth and barrel staves to make\n\t\ta bellows...\n\n\t\t\t\tMARION\n\t\tAnd we can yank a wagon wheel,\n\t\tweight it, rig a piston and drive\n\t\tshaft and we'll have a flywheel to\n\t\tpower the bellows...\n\nScott and Fielding exchange an impressed look.\n\n\t\t\t\tSCOTT\n\t\t\t   (to Fielding)\n\t\tThat's why he's a colonel.\n\nScott and Fielding roll up their sleeves and get to work.\nMarion hears a COMMOTION OF BARKING DOGS AND YELLING MEN\nand strides over to find Billings cowering before TWO HUGE\nGREAT DANES who stand guard at one of the wagons.\n\n\t\t\t\tBILLINGS\n\t\tShoot them!  Shoot the damn things!\n\nDalton prepares to do so.\n\n\t\t\t\tMARION\n\t\tPut that pistol down!\n\n\t\t\t\tSCOTT\n\t\tThey followed us from the bridge.\n\t\tThey won't let anyone near the\n\t\twagon.\n\nMarion steps forward, speaking softly but firmly to the\ndogs.\n\n\t\t\t\tMARION\n\t\tStay... stay... stay...\n\nThe dogs waver between obeying Marion and ripping out his\nthroat.\n\n\t\t\t\tMARION\n\t\tDon't you growl at me!\n\nThe dogs decide to obey.  Marion lets them sniff his hand,\nthen firmly pats them.\n\n\t\t\t\tMARION\n\t\tNow let's see what's in this wagon.\n\nRev. Oliver and Abner join him.  Billings eases past the\ndogs.  Abner opens a large case and finds it filled with\nbottles.\n\n\t\t\t\tABNER\n\t\tRum, French Champagne, Madeira,\n\t\tPort...\n\n\t\t\t\tBILLINGS\n\t\tNo wonder they were guarding it.\n\nGabriel opens a trunk and finds it filled with powdered\nwigs, all perfectly coifed and stored on head-shaped wig-\nstands.  Rev. Oliver opens one of several identical cases\nand finds it filled with papers.\n\n\t\t\t\tREV. OLIVER\n\t\tMy heavens, personal correspondence\n\t\tof... Lord Cornwallis.\n\nMarion grabs some papers, scans them, then finds matching\ncases on nearby wagons.\n\n\t\t\t\tMARION\n\t\tThese four wagons must be his.\n\n\t\t\t\tGABRIEL\n\t\tAnd the dogs, too, I'll wager.\n\n\t\t\t\tBILLINGS\n\t\tI say we drink the wine, shoot the\n\t\tdogs, and use the papers for musket\n\t\twadding.\n\n\t\t\t\tMARION\n\t\tHis journals, letters, maps,\n\t\tbooks...\n\nAbner calls from another wagon.\n\n\t\t\t\tABNER\n\t\tColonel, we got a wagon full of\n\t\tofficer's uniforms and more powder\n\t\tand muskets here.\n\nIgnoring Abner, Marion, sits down on a stump with a pile\nof Cornwallis' papers and starts to read.\n\nEXT.  SNOW'S ISLAND - NIGHT\n\nMarion sits at Cornwallis' ornate, folding campaign desk,\nreading Cornwallis' journal, surrounded by Cornwallis'\nfield gear which includes furniture, music boxes, oil\npaintings and an elaborate folding commode.  The TWO GREAT\nDANES sit nearby, eyeing Marion warily.\n\nThe men have divided themselves into two groups, one\ncoarse, the other civilized, each clustered around a\nseparate fire.\n\nThe coarse men, including Dalton, Brother Joseph and\nRANDOLPH, a grizzled, black-toothed mountain man, drink\nand laugh loudly, wearing Cornwallis' wigs askew.\n\nThe civilized men, including Rev. Oliver, Gabriel, Scott,\nFielding and Abner, talk quietly.\n\nMarion puts down the journal and walks over to the\ncampfire where the rougher men are gathered.  He stands\njust inside the firelight and speaks loudly, so that all\ncan hear:\n\n\t\t\t\tMARION\n\t\tToday was hard earned but a good\n\t\tstart.\n\nMarion looks at Dalton, then turns to the other men as\nwell.\n\n\t\t\t\tMARION\n\t\tIn the future wounded British\n\t\tsoldiers will be given quarters.\n\n\t\t\t\tDALTON\n\t\tLike they gave quarter to my family?\n\t\tMy wife and three children were\n\t\thiding in our root cellar when they\n\t\tcame.  The Redcoats locked the door\n\t\tand torched the house.\n\n\t\t\t\tMARION\n\t\tYou have my sympathy... but the\n\t\torder stands.\n\n\t\t\t\tDALTON\n\t\tAnd who are you to give an order\n\t\tlike that?  We all know what you did\n\t\tafter Fort Wilderness.\n\nThat hits home but Marion remains calm.\n\n\t\t\t\tMARION\n\t\tI'm your commanding officer.  This\n\t\tis militia, not regular army.  I\n\t\tcan't hold you here, but as long as\n\t\tyou stay, you'll follow my orders.\n\nMarion looks from face to face.  Most begrudgingly nod.\nThat's enough for Marion.\n\nAs he heads back to his own campfire he's intercepted by\nRev. Oliver who speaks to him out of earshot of the other\nmen, except for Gabriel and Billings who overhear.\n\n\t\t\t\tREV. OLIVER\n\t\tThank you.\n\n\t\t\t\tMARION\n\t\tFor what?\n\n\t\t\t\tREV. OLIVER\n\t\tFor trying to impose some decency on\n\t\tthat sort.\n\n\t\t\t\tMARION\n\t\tDon't depend on my decency.  I'm one\n\t\tof that sort.\n\nMarion walks on.  Rev. Oliver exchanges a look with\nGabriel, then heads off.  As Marion joins Gabriel and\nBillings at his campfire, Billings grips his bottle.\n\n\t\t\t\tBILLINGS\n\t\tAm I one of that sort?\n\n\t\t\t\tMARION\n\t\tYou're the worst of that sort.\n\t\tYou're the sort that gives that sort\n\t\ta bad name.\n\nBillings considers that, then shrugs and takes a long\ndrink.  He hands the bottle to Marion who takes an equally\nlong drink.  Marion picks up his Pennsylvania rifle.\n\n\t\t\t\tMARION\n\t\tI'm going to check the watch.\n\nHe disappears into the darkness leaving Gabriel and\nBillings at the campfire.\n\n\t\t\t\tGABRIEL\n\t\tHe shouldn't make light.  That\n\t\tRedcoat should not have been killed.\n\n\t\t\t\tBILLINGS\n\t\tHe's not making light.\n\nGabriel shoots Billings a dubious look.\n\n\t\t\t\tBILLINGS\n\t\tYou don't know him very well, do\n\t\tyou?\n\n\t\t\t\tGABRIEL\n\t\tHe's my father.\n\nBillings looks closely at Gabriel.\n\n\t\t\t\tGABRIEL\n\t\tI know him well enough?\n\n\t\t\t\tBILLINGS\n\t\tDon't fault him for having grown up\n\t\ton the frontier.  It was a harder\n\t\ttime and a harder place than you\n\t\tknow.\n\nGabriel looks at Billings, then turns back to the fire.\n\nEXT.  SNOW'S ISLAND - DAWN\n\nThe men are beginning to stir, gathering around the\ncampfires, cooking, using pots, pans and other gear from\nthe stolen British wagons.\n\nMarion reads Cornwallis' journal.  He looks up, stretches\nand walks over to a campfire where Gabriel, Billings and\nRev. Oliver cook.  The dogs follow at a distance.\n\n\t\t\t\tBILLINGS\n\t\tWell?\n\n\t\t\t\tMARION\n\t\tI've just been inside the mind of a\n\t\tgenius.  Lord Cornwallis knows more\n\t\tabout war than I could in a dozen\n\t\tlifetimes.\n\n\t\t\t\tBILLINGS\n\t\tCheerful news to greet the morn.\n\n\t\t\t\tMARION\n\t\tHis victories at Charleston and\n\t\tCamden were perfect, strategically,\n\t\ttactically, logistically.  But he\n\t\thas a weakness.\n\nThey all turn to Marion.\n\n\t\t\t\tMARION\n\t\tLord Cornwallis is brilliant.  His\n\t\tweakness is that he knows it.\n\n\t\t\t\tGABRIEL\n\t\tFather?\n\n\t\t\t\tMARION\n\t\tPride is his weakness.\n\nThe men consider that.\n\n\t\t\t\tBILLINGS\n\t\tPersonally, I'd prefer stupidity.\n\n\t\t\t\tMARION\n\t\tPride will do.\n\nBEGIN MONTAGE:  Series of shots as follows:\n\n-- A VOLLEY OF MUSKET FIRE erupts from some thick\n   underbrush, cutting down half of a squadron of Redcoats\n   on the march.  The surviving Redcoats FIRE BACK into\n   the trees at unseen targets to little effect.\n\n-- Marion rides with about fifty men.\n\n-- A British supply convoy makes its way through the\n   woods.  Suddenly, Marion's men appear, rising up from\n   the ground as if by magic, having been camouflaged by\n   leaves and brush.  They OPEN FIRE on the convoy escort,\n   which holds for a moment, then flees.\n\n-- Marion rides with about seventy-five men.\n\n-- Cornwallis finishes reading a dispatch and furiously\n   flings it across the room.\n\n-- Marion rides with about one hundred men.\n\n-- Snow's Island.  Marion and his men do an inventory of a\n   large haul of stolen British supply wagons.  The booty\n   includes dozens of BRASS MUSICAL INSTRUMENTS, some of\n   which Marion's men BLARE in celebration.\n\n-- Marion rides with about one-hundred-fifty men.\n\n-- Marion, Gabriel, and some of the other men watch as the\n   flaming supports of a BURNING WOODEN BRIDGE collapse\n   into a river.\n\n-- A seething Cornwallis stands at the same spot, looking\n   at the charred, now cooled, remains of the bridge.\n   Cornwallis angrily mounts up and rides off.  His\n   contrite staff officers mount up and follow.\n\n-- Snow's Island.  Marion sits with his muddy feet on\n   Cornwallis' campaign desk, reading Cornwallis' journal,\n   with Cornwallis' Great Danes at his side.\n\nEXT.  CAMDEN - NIGHT\n\nGlittering lights shine from the Camden Inn, a grand\nstructure in the center of town.\n\nA line of OPULENT CARRIAGES discharges well-dressed\npassengers, arriving for a ball.  Ladies in their finery.\nPatrician husbands.  Redcoat and Green Dragoon officers in\nmagnificent dress uniforms.\n\nINT.  CORNWALLIS' PERSONAL QUARTERS - EVENING\n\nCornwallis, standing in front of a full-length mirror, is\ndressed by his VALET while Major Halbert, Colonel\nHuntington and Tarleton look on.\n\n\t\t\t\tCORNWALLIS\n\t\tWhy am I here, Colonel Halbert?\n\n\t\t\t\tMAJOR HALBERT\n\t\tFor the ball, sir?\n\nCornwallis holds his temper.\n\n\t\t\t\tCORNWALLIS\n\t\tWhy, after six weeks, are we still\n\t\there to attend a ball.  By now, we\n\t\tshould be attending balls in North\n\t\tCarolina, not South Carolina.\n\n\t\t\t\tMAJOR HALBERT\n\t\tOur supply line, sir?\n\n\t\t\t\tCORNWALLIS\n\t\tExcellent guess, Major.\n\nThe valet puts a dress coat on Cornwallis who looks at the\ngarment with deepest disdain.\n\n\t\t\t\tCORNWALLIS\n\t\tAnd what, praytell, is this?\n\n\t\t\t\tVALET\n\t\tUh... I borrowed it from Colonel\n\t\tNorth.  I took it in at the back,\n\t\tadded wider epaulets, a court sash\n\t\tand looped gold braiding on the\n\t\tcuffs...\n\n\t\t\t\tCORNWALLIS\n\t\tIt's a horse blanket.\n\t\t\t   (to Major Halbert)\n\t\tFirst my personal baggage, then half\n\t\tthe bridges and ferries between here\n\t\tand Charleston burned, a dozen\n\t\tconvoys attacked.  Colonel, if you\n\t\tcan't secure our supply line against\n\t\tmilitia, how do you expect to do so\n\t\tagainst Colonial regulars or the\n\t\tFrench when they come?\n\n\t\t\t\tCOLONEL HALBERT\n\t\tSir, they're not like regulars, we\n\t\tcan't find them and we don't know\n\t\twhen or where they're going to\n\t\tstrike.\n\n\t\t\t\tCORNWALLIS\n\t\tHow impolite.  And who leads these\n\t\tclever, secretive fellows?\n\n\t\t\t\tCOLONEL HALBERT\n\t\tWe don't know, sir.  He's called,\n\t\tthe Commander by some, the Swamp Fox\n\t\tby others.\n\n\t\t\t\tCORNWALLIS\n\t\tColonel, I'm a civilized man but I'm\n\t\tfinding to difficult to remain\n\t\tcivil.  Secure my supply line.\n\n\t\t\t\tCOLONEL HALBERT\n\t\tYes, sir.\n\nCornwallis looks at his reflection with dismay, sighs and\nstrides out.  Tarleton, amused, follows.\n\nEXT.  CAMDEN STREET - NIGHT\n\nAt the far end of town Marion, Gabriel, Billings, Dalton,\nScott and several other men slip through the shadows into\nan alley.  The lights from the ball shine from down the\nstreet and the MUSICAL STRAINS of a MINUET drift to them\nthrough the night.\n\nEXT.  ARMORY - NIGHT\n\nA block-like building on the far edge of town.  A pair of\nREDCOATS stand guard.  A PAIR OF DRUNKEN REDCOATS stagger\nout of a side-street, SINGING A MUMBLING SONG.  The\nRedcoat guards look at the drunk Redcoats enviously.\n\n\t\t\t\tREDCOAT GUARD\n\t\tHey, what you got there?\n\nThe drunken Redcoats look up, bringing their faces into\nthe light -- THE DRUNKEN REDCOATS ARE BILLINGS AND DALTON.\n\n\t\t\t\tBILLINGS\n\t\tWe got our own little party...\n\n\t\t\t\tDALTON\n\t\tTo hell with the officers and their\n\t\tfancy dress ball...\n\n\t\t\t\tGUARD\n\t\tGive us a nip, here.\n\nBillings and Dalton walk over to the Redcoats guards.  As\nthe guards reach for the bottles, Billings SLAMS one of\nthe guards back against the building...\n\nDalton DRAWS A KNIFE and PLUNGES IT into the second\nguard's belly and HACKS HIM OPEN...\n\nDalton shoves Billings out of the way, SLITS THE OTHER\nGUARD'S THROAT.  Billings is taken aback by the speed and\nferocity of Dalton's attack...\n\nMarion and Scott duck into the shadows of the doorway,\npull out hammer-less carving chisels and quickly and\nsilently start gouging out the wood around the hinges of\nthe heavy door.\n\nBillings and Dalton take the posts of the guards while the\nother men drag the bodies of the real guards out of sight.\nEverything appears as it should.\n\nINT.  BALLROOM - NIGHT\n\nGrand.  Opulent.  Cornwallis speaks with a small gathering\nof loyalist civilians, among whom is the spectacular MRS.\nTALBOT, who wears a daring dress that reveals an enormous\nexpanse of bosom.  At her side stands her toady of a\nhusband, MR. TALBOT.\n\n\t\t\t\tMRS. TALBOT\n\t\tNo!  The beasts took your dogs, as\n\t\twell?\n\n\t\t\t\tCORNWALLIS\n\t\tFine animals, a gift from His\n\t\tMajesty.  Dead now, for all I know.\n\n\t\t\t\tMRS. TALBOT\n\t\tIs there no decency?\n\n\t\t\t\tMR. TALBOT\n\t\tAmong the rebels?  We know the\n\t\tanswer to that.\n\n\t\t\t\tCORNWALLIS\n\t\tYes, we have learned.\n\nINT./ EXT.  CAMDEN ARMORY - NIGHT\n\nMarion and Scott shove their chisels through the door\nwhich falls away from the hinges.  They all duck inside\nfinding barrels and casks of gunpowder, boxes of weapons\nand hundreds of muskets.\n\nGabriel and the others load themselves up with the best of\nthe weapons as Marion opens a cask and pours a trail of\ngunpowder across the floor.\n\nEXT.  BALCONY - CAMDEN INN - NIGHT\n\nCornwallis, taking the night air with Mrs. Talbot, gazes\nat the moon, achieving the calculated effect.\n\n\t\t\t\tMRS. TALBOT\n\t\tYou seem far away.\n\n\t\t\t\tCORNWALLIS\n\t\tIt's the weight of command and the\n\t\tlot of a widower -- memories,\n\t\tloneliness...\n\t\t\t   (with a self-\n\t\t\t    deprecating laugh)\n\t\t... and long gazes at the moon.\n\nMrs. Talbot sympathetically sighs and touches her\nfingertips to her heart which is conveniently located\ninches above her stunning cleavage.   \n\n\t\t\t\tMRS. TALBOT\n\t\tOh, you poor man...\n\nA MASSIVE EXPLOSION LIGHTS UP THE NIGHT as a FIREBALL\nerupts from the armory.  British officers, including Major\nHalbert and Tarleton, RUSH OUT along with Mr. Talbot and\nother Loyalist civilians.\n\n\t\t\t\tMAJOR HALBERT\n\t\tGood God!\n\nMr. Talbot tears his eyes from the flames and looks at\nhis wife, clinging to Cornwallis' arm.\n\n\t\t\t\tMR. TALBOT\n\t\tThese rebels seem to lack fear as\n\t\twell as decency, eh, General?\n\nCornwallis registers the insult, glances at the hapless\nMajor Halbert, then turns to Tarleton.\n\n\t\t\t\tCORNWALLIS\n\t\tColonel Tarleton, you deal with\n\t\tthese damned rebels.\n\n\t\t\t\tTARLETON\n\t\tYes, sir.\n\nTarleton smiles grimly and strides off the balcony.\n\nEXT.  VIEW OF PEMBROKE VILLAGE - DAY\n\nThe village of Pembroke lies nestled in a valley,\nsurrounded by tilled fields and small farms.\n\nEXT.  PEMBROKE VILLAGE - DAY\n\nForty of Marion's men water their horses.  Marion, with\nthe two Great Danes at his side, speaks with PETER GREEN,\na middle-aged storekeeper with a marked limp.\n\n\t\t\t\tGREEN\n\t\t... four baskets of apples, salt\n\t\tpork, sweet potatoes, jerky, hard\n\t\ttack, salt and powder.  It's not\n\t\tmuch, but I'll get you more.\n\n\t\t\t\tMARION\n\t\tWe can't pay for this...\n\n\t\t\t\tGREEN\n\t\tI'll give you what I can, when I\n\t\tcan.  You pay me what you can.\n\nGreen's daughter, ANNE, very attractive, around sixteen,\njoins them.  Gabriel sees her and sidles over.\n\n\t\t\t\tGREEN\n\t\tFrancis, you remember my daughter,\n\t\tAnne.\n\n\t\t\t\tMARION\n\t\tNice to see you again, Anne.\n\nGabriel clears his throat.  Anne looks at him coolly.\n\n\t\t\t\tANNE\n\t\tI know who you are, Gabriel Marion.\n\t\tThe last time I saw you, I was nine\n\t\tand you put ink in my tea.\n\n\t\t\t\tGABRIEL\n\t\tI... uh... that wasn't me, it was\n\t\tSamuel... I mean Nathan...\n\n\t\t\t\tANNE\n\t\tIt was you and it turned my teeth\n\t\tblack for a month.\n\n\t\t\t\tGABRIEL\n\t\tUh... uh... I...\n\n\t\t\t\tGREEN\n\t\tHe's sorry.  Come.\n\nGreen heads across the square where some townspeople are\ngiving Marion's men provisions.  Anne and Gabriel follow.\nMarion turns to some waiting men, new recruits.\n\nBillings, nearby, reads A POSTED BROADSHEET that\nannounces:  \"Reward Offered:  For the capture or death of\nthe rebel known as 'The Swamp Fox'\".\n\nHe tears it down and walks over to Marion.\n\n\t\t\t\tMARION\n\t\t... and your terms of enlistment\n\t\twill be month-to-month.  Every\n\t\tthirty days you can re-enlist or\n\t\treturn to your families.\n\nREED, the sturdiest of the lot offers his hand to Marion.\n\n\t\t\t\tREED\n\t\tI'm in.\n\nThe others nod in agreement.\n\n\t\t\t\tMARION\n\t\tTalk to Abner and Scott about\n\t\tprovisions, powder and mounts.\n\nThe recruits head off.  Billings hands Marion the wanted\nposter which Marion glances at and crumbles up.\n\n\t\t\t\tBILLINGS\n\t\tTwenty men here, seventeen in New\n\t\tBrighton, a dozen along the Black\n\t\tRiver.  We'll pass three hundred by\n\t\tweek's end if this keeps up.\n\nON THE OTHER SIDE OF THE SQUARE\n\nGabriel and several of Marion's men take supplies from\nGreen, Anne, and some other townspeople.  Gabriel looks at\nAnne.\n\n\t\t\t\tGABRIEL\n\t\tIf I'd known you were going to look\n\t\tlike this, I never would have put\n\t\tink in your tea.\n\n\t\t\t\tANNE\n\t\tYou call that a compliment?\n\n\t\t\t\tGABRIEL\n\t\tIt's a start.\n\nShe gives him a bit of a smile.  He checks out her teeth.\n\n\t\t\t\tGABRIEL\n\t\tThey look nice.  As white as can be.\n\nShe tries to glare but she can't help but laugh.\n\nMARION AND BILLINGS watch as Anne gives Gabriel some\napples which he tosses into the air, one-by-one, catching\nthem behind his back, a cocky move, executed with a\ndisarming smile that makes Anne laugh again.  Marion\nsmiles at his son's flirtation.  Billings smiles as well.\n\n\t\t\t\tBILLINGS\n\t\tHe reminds me of you before you got\n\t\told and ugly.\n\n\t\t\t\tMARION\n\t\t\t   (softly)\n\t\tNo, he takes after his mother...\n\nBillings is taken aback by the gentleness of Marion's\nwords.\n\n\t\t\t\tMARION\n\t\t... the younger ones barely remember\n\t\ther but Gabriel spent more time with\n\t\tElizabeth... she taught him well,\n\t\tguided him, she was his North Star\n\t\tand mine... her father was a\n\t\tminister, in Boston, did you know\n\t\tthat?\n\nBillings nods.\n\n\t\t\t\tMARION\n\t\t... Gabriel's already a better man\n\t\tthan I could ever hope to be...\n\nMarion hears himself and pulls his eyes from Gabriel,\nadopting a coarse, joking tone.\n\n\t\t\t\tMARION\n\t\tWhat do you mean, old and ugly?\n\n\t\t\t\tBILLINGS\n\t\tYou got me beat on both accounts.\n\n\t\t\t\tMARION\n\t\tThe hell I do.\n\nThey mount up, grateful to leave the sincerity behind.\n\nGabriel sees Marion and his men starting to ride off.  He\nsays goodbye to Anne, then RUNS TO HIS HORSE, MOUNTING\nWITH A DRAMATIC LEAP.  He GALLOPS up, taking his place at\nhis father's side.  Marion doesn't turn to look at him,\nbut he knows he's there.\n\nEXT.  CAROLINA ROAD - DAY\n\nA patchwork of fields with a village visible in the\ndistance.  The ROLLINS BOYS, 10 and 12, work a field,\nharvesting grain.  Hearing the SOUND OF HORSES' HOOVES,\nthey stop and listen.\n\nThen they see a CLOUD OF DUST rising over the ridge line.\nGrowing excited, they throw down their scythes and race\ndown the hillside, madly stumbling and falling, trying to\nintersect the approaching sound.\n\nAt the bottom of the hill they pass their father, BEN\nROLLINS, who watches his sons plant themselves on the side\nof the road, gazing in awe at:\n\nMARION AND HIS MEN, THUNDERING BY.  They're an impressive\nsight, a hundred-and-fifty heavily armed men, on powerful\nmounts, raising a cloud of dust as they gallop down the\nroad.\n\nEXT.  CHARLESTON ROAD - DAY\n\nMarion and forty of his men, including Gabriel, sit on\ntheir motionless horses in the middle of the road.  There\nare a number of new faces among Marion's men, among them\nBen Rollins.  Gabriel is lost in thought.\n\n\t\t\t\tMARION\n\t\tGabriel?  Are you asleep?\n\n\t\t\t\tGABRIEL\n\t\tWe're low on salt.  I should go to\n\t\tPembroke and get some.\n\n\t\t\t\tBILLINGS\n\t\tYou got salt last week.\n\n\t\t\t\tGABRIEL\n\t\tOh, right.\n\t\t\t   (beat)\n\t\tBaking powder, we need baking\n\t\tpowder.\n\n\t\t\t\tBILLINGS\n\t\tWe've got plenty of baking powder.\n\t\tYou went to Pembroke and got five\n\t\tpounds two weeks ago.\n\nGabriel sighs.  They hear a SOUND APPROACHING, then see\ntwo British wagons round a curve with a guard of only SIX\nREDCOATS, commanded by a REDCOAT SERGEANT.  The Redcoat\nSergeant signals stop.\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tHalt.  Look alive, boys.\n\nThe young Redcoat privates nervously UNSHOULDER THEIR\nMUSKETS.\n\n\t\t\t\tMARION\n\t\tSergeant, this road is closed.\n\t\tThose wagons now belong to the\n\t\tContinental Army.\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tReady arms!  By twos!\n\nMarion's surprised by the Sergeant's order.\n\n\t\t\t\tMARION\n\t\tSergeant, there's no reason for you\n\t\tand your men to die.  Just leave the\n\t\twagons and go.\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tSteady, boys...\n\nMarion sighs and lets loose with a PIERCING WHISTLE.  The\nunderbrush parts and more of Marion's men show themselves,\nMUSKETS LEVELED at the outnumbered Redcoats.\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tThis is the King's highway and I\n\t\tadvise you and your men to make way.\n\t\t\t   (to his men)\n\t\tPrepare to fire.\n\nMarion exchanges a look with Rev. Oliver who, like Marion,\ndoesn't want to kill these men.  Seeing no other option,\nMarion turns to give the order, then stops, hearing a\nFAINT BARELY DETECTABLE, RUMBLING SOUND...\n\nA moment later Brother Joseph hears it as well... HORSES\nHOOVES, LOTS OF THEM, growing louder by the second,\nTHUNDERING toward them from the road behind the British\nwagons...\n\nThen, the SOUND OF MORE HORSES, coming in fast on both\nflanks.\n\n\t\t\t\tMARION\n\t\tIt's a trap...\n\nThe canvas sides of the British wagons are THROWN UP and\nDOZENS OF REDCOATS, armed with muskets, spill out...\n\nMarion's unmounted men run to their horses, LEAPING into\ntheir saddles...\n\nThen GREEN DRAGOONS appear, galloping down the wooded\nslopes on both flanks, astonishing horsemen, weaving\nthrough the trees without slacking their pace, SWORDS\nDRAWN, PISTOLS PRIMED...\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tFIRE!\n\nA THUNDEROUS VOLLEY ERUPTS from the Redcoat infantry,\nKILLING several of Marion's men...\n\nMarion's men FIRE BACK from their BUCKING MOUNTS, most of\ntheir shots going awry...\n\nBehind the British wagons, a huge detachment of GREEN\nDRAGOONS appears, TARLETON among them...\n\nMARION SEES THE DRAGOONS BUT NOT TARLETON HIMSELF...\n\nMARION AND HIS MEN spur their mounts, taking off down the\nroad in the opposite direction...\n\nThe FLANKING BODIES OF DRAGOONS gallop out of the woods,\nJOINING THE MAIN BODY, riding in hard pursuit...\n\nEXT.  WOODED ROAD - DAY\n\nMarion and his men GALLOP down the road.  The much larger\nbody of Green Dragoons THUNDER after them.\n\nEXT.  BLACK SWAMP ROAD - DAY\n\nMarion and his men ride along a raised road that drops off\ninto Black Swamp on either side...\n\nThey ROUND A CURVE AND STOP, reining back their horses in\nconfusion as they see:\n\nFIFTY GREEN DRAGOONS heading straight toward them...\n\nTHE DRAGOONS OPEN FIRE from both directions, KILLING\nseveral more of Marion's men, WOUNDING others...\n\nMarion's men FIRE BACK as best they can, caught in the\nCHAOS OF BUCKING AND FALLING HORSES and WOUNDED AND\nDISMOUNTED MEN...\n\nThey remount, doubling-up with the wounded...\n\nMARION sees an unaided wounded man.  LEAPS FROM HIS\nHORSE, heaves him onto his horse, slaps it...\n\nMarion's men head off both sides of the road into the\nswamp, struggling with their mounts as they hit the knee-\ndeep water...\n\nMarion on foot with four men, only three horses... A\nDRAGOON, aiming his pistol, THUNDERS down on Marion...\nMARION FIRES, killing the Dragoon...\n\nMarion's men mount, one motions to Marion...\n\n\t\t\t\tMARION\n\t\tGO!\n\nMarion's men ride off, leaving him ALONE... a Dragoon is\nalmost on him, SWORD RAISED.  Marion, his weapon spent,\nsees a thick branch on the ground, two feet long... grabs\nit...\n\nThe sword flashes and SINKS DEEPLY INTO THE WOOD... Marion\nYANKS, brings the rider off his horse, grabs the reins and\nSWINGS HIMSELF UP INTO THE EMPTY SADDLE.  Marion rides\ndown the embankment...\n\nThe Dragoons rein back, slowed by the dead horses and men.\nThey spur their reluctant mounts over the bodies and\nfollow Marion and his men into the swamp...\n\nEXT.  BLACK SWAMP - DAY\n\nMARION RIDES HARD, galloping along a circuitous, barely\nvisible dry trail... A MOMENT LATER, Tarleton and Green\nDragoons follow...\n\nEXT.  DEEP IN THE SWAMPS - EVENING\n\nMARION CATCHES UP to a dozen of his men, including Gabriel\nand Billings.  Several of the men are badly wounded,\nbarely clinging to their saddles...\n\nThey ride through the shallow water, get to a fork, SPLIT\nUP.  As they disappear into the swamp, the sounds of their\nhorses are swallowed up in the LOUD BUZZING OF SWAMP\nINSECTS and the CRIES OF THE SWAMP BIRDS...\n\nA moment later, Tarleton and the vanguard of Dragoons ride\nup.  Tarleton signals stop at the fork...\n\nLooks... nothing.  Listens... nothing.  Chooses a path,\nthe one Marion took.  Rides off, the Dragoons following...\n\nEXT.  DEEPER IN THE SWAMPS - NIGHT\n\nDarker still.  Tarleton and his men come to a dead end,\nblocked by a heavy tangle of huge swamp ferns and thorn\nbushes.\n\nThey rein back their horses, stopping in a confused mess.\nTarleton calls to Gaskins and the Loyalist scouts.\n\n\t\t\t\tTARLETON\n\t\tWhich way?\n\n\t\t\t\tGASKINS\n\t\tThis way... no this... I think...\n\nTarleton makes his own choice... rides off... the Green\nDragoons follow, the Loyalists bring up the rear.\n\nEXT.  SWAMP MORASS - NIGHT\n\nTarleton and his mounted Dragoons struggle through a\nnearly impassable morass of swamp-grass, reeds and\nswarming mosquitoes...\n\nThe exhausted Dragoons are wet, covered with mud, and\nbleeding from swamp briars.  The horses are spent and\nfoaming...\n\nTarleton struggles harder than any, but finally even he\nhas had enough.  He reins back his horse.\n\n\t\t\t\tTARLETON\n\t\tHALT!\n\nTarleton glares into the impenetrable darkness of plant-\nchoked water and swamp...\n\n\t\t\t\tTARLETON\n\t\tEnough of this.  There are other\n\t\tways to run down a fox.\n\nTarleton yanks on his reins, turns his horse and starts\nback the way they came.  His grateful men turn their\nhorses and follow.\n\nIN THE UNDERGROWTH, Marion, Gabriel, Billings and three\nbadly wounded men, with only four horses between them,\ncalm their mounts...\n\nThey can hear, but not see the Dragoons.  Then, through\nthe thick undergrowth, MARION CATCHES A GLIMPSE OF\nTARLETON...\n\nGabriel, tending the wounded men, sees his father lock his\neyes on Tarleton...\n\nMarion quickly opens his weapons pouch and pulls out one\nof the bullets he made from Thomas' lead soldiers.\nWalking to his horse, Marion loads...\n\nMarion mounts, scanning the terrain, planning a route...\n\n\t\t\t\tGABRIEL\n\t\tFather, no...\n\nAs Marion spurs his horse to ride after Tarleton, Gabriel\ngrabs the bridle.  He YANKS HARD, stopping Marion's horse\ndead.  THE HORSE BUCKS, nearly throwing Marion...\n\n\t\t\t\tMARION\n\t\tThat's him.  Tarleton.\n\nMARION SPURS THE HORSE which tries to respond but is\nJERKED BACK AGAIN by Gabriel.  Marion angrily turns on his\nson...\n\n\t\t\t\tMARION\n\t\tDamn you!  Let go!\n\nGabriel looks up at his father, never loosening his iron\ngrip on the bridles but speaking softly, almost\npleadingly:\n\n\t\t\t\tGABRIEL\n\t\tFather, please...\n\nMarion looks down at Gabriel.  Then Marion looks over at\nBillings and the three wounded men...\n\nOne bleeds from an ugly neck wound... their shared mounts\nare nearly spent...\n\nMarion takes a last look in the direction of the departing\nTarleton.  Then he dismounts and hurries over to help the\nwounded.  Gabriel watches his father for a moment, then\njoins him with the wounded.\n\nEXT.  WOODED GLEN - NIGHT\n\nDark.  Marion and his battered men gather, taking stock.\nMen drift in, mounted and on foot in ones and twos, past\nwary sentries.  GABRIEL RIDES UP, dismounts and reports to\nMarion, out of earshot of the other men.\n\n\t\t\t\tGABRIEL\n\t\tFourteen dead, eleven wounded,\n\t\teighteen captured.\n\n\t\t\t\tMARION\n\t\tI should have killed him when I had\n\t\tthe chance?\n\n\t\t\t\tGABRIEL\n\t\tWhen was that?  In the swamp at the\n\t\texpense of your men?  Or when he\n\t\tkilled Thomas at the expense of your\n\t\tfamily?\n\n\t\t\t\tMARION\n\t\tNo...\n\n\t\t\t\tGABRIEL\n\t\tOr perhaps tomorrow at the expense\n\t\tof our cause.\n\nMarion is silent.\n\n\t\t\t\tGABRIEL\n\t\tThere will be a time and a place for\n\t\trevenge but killing Tarleton at the\n\t\texpense of your duty serves no one\n\t\tbut yourself.\n\t\t\t   (beat)\n\t\tStay the course.\n\nThe parental-sounding formality of Gabriel's words brings\na thin smile to Marion's face.\n\n\t\t\t\tMARION\n\t\tStay the course... your mother used\n\t\tto say that to me when I'd get drunk\n\t\tor lose my temper.\n\n\t\t\t\tGABRIEL\n\t\tShe'd say it to me when I picked on\n\t\tThomas or Nathan.\n\n\t\t\t\tMARION\n\t\tYou learned her lessons better than\n\t\tI.\n\n\t\t\t\tGABRIEL\n\t\tShe got me at a more impressionable\n\t\tage.\n\nMarion smiles, nods a silent thanks to his son and heads\nover to help with the wounded.\n\nEXT.  MARION'S ENCAMPMENT - NIGHT\n\nA cold, winter rain falls.  Most of Marion's grim men are\nhuddled in lean-to's and around campfires.  Green and\nseveral other Pembroke townspeople unload a wagon of\nsupplies while Marion, Scott and Fielding stow the\nprovisions.\n\nGabriel and Anne sit at a fire, under the cover of a lean-\nto, taking quietly.  He's troubled.  She tries to be\nhopeful.\n\n\t\t\t\tANNE\n\t\tNext time we'll bring more blankets.\n\n\t\t\t\tGABRIEL\n\t\tThat would be nice.\n\n\t\t\t\tANNE\n\t\tMaybe we'll be lucky this winter and\n\t\thave just rain, no snow.\n\n\t\t\t\tGABRIEL\n\t\tThat would be nice, too.\n\nShe takes a pot off the campfire and pours him a cup of\ntea.\n\n\t\t\t\tANNE\n\t\tJust because the French didn't come\n\t\tthis fall, doesn't mean they're\n\t\tnever going to come.\n\nHe nods and takes a drink of the tea.  She smiles.\nGabriel smiles back to her, revealing a mouthful of ink-\nstained, black teeth.  Before she has time to laugh...\n\nROLLINS RIDES HARD INTO CAMP.  Marion hurries over,\naccompanied by the Great Danes.  The other men gather\naround.\n\n\t\t\t\tROLLINS\n\t\tThey're to be hung!\n\n\t\t\t\tGABRIEL\n\t\tBut they're prisoners-of-war!\n\nMarion isn't as surprised as Gabriel.  He is, however,\ntaken aback by Gabriel's black teeth.  Gabriel notices\neveryone looking at his mouth.\n\nAnne is embarrassed and regretful, seeing her joke fly in\nthe face of the troubling news.\n\nEXT.  FORT CAROLINA - DAY\n\nA REDCOAT SENTRY sees a lone figure on horseback ride out\nof distant woods.  It's Rev. Oliver, carrying a white flag\nwith one hand, holding a dispatch case in the other.  The\nsentry calls to the Commander of the Watch.\n\n\t\t\t\tREDCOAT SENTRY\n\t\tSir.\n\nINT.  CORNWALLIS' HEADQUARTERS - FORT CAROLINA - DAY\n\nA temporary HQ has been set up in a commandeered\nfarmhouse.  Cornwallis stands uncomfortably while a tailor\nmeasures him and marks alterations on a partially\ncompleted uniform.  Tarleton enters.\n\n\t\t\t\tTARLETON\n\t\tGeneral, a message from the\n\t\tcommander of the rebel militia.\n\nCornwallis reads the message.\n\n\t\t\t\tCORNWALLIS\n\t\tIt seems our Swamp Fox wants to have\n\t\ta formal parley.\n\n\t\t\t\tTARLETON\n\t\tAre you going to meet with him?\n\n\t\t\t\tCORNWALLIS\n\t\tMost certainly.  Arrange it.\n\nEXT.  CAROLINA ROAD - DAY\n\nMarion rides, trailed by Cornwallis' Great Danes.  Behind\nhim, two dozen heavily armed Patriots, including Rev.\nOliver who carries a white flag.\n\nA detachment of Redcoat Cavalry, lead by Major Halbert,\nwaits.  The Redcoats fall in on either side.  They ride\non.\n\nEXT.  FORT CAROLINA - DAY\n\nRedcoat sentries see the approaching Patriots and Redcoats\nand open the gates.  Billings and the other Patriots stop,\na hundred yards outside the barricades.\n\nMARION alone rides through the gates, flanked by the\nBritish cavalry, the Great Danes following closely behind.\n\nINT.  CORNWALLIS' HEADQUARTERS - DAY\n\nMajor Halbert ushers Marion in.  The Great Danes follow\nsniffing curiously, sensing something or someone.\n\n\t\t\t\tMAJOR HALBERT\n\t\tLord Cornwallis will be with you\n\t\tpresently.\n\n\t\t\t\tMARION\n\t\tThank you.\n\n\t\t\t\tMAJOR HALBERT\n\t\tYou may, of course, keep your\n\t\tweapons, but I must warn you that...\n\n\t\t\t\tMARION\n\t\t\t   (interrupting)\n\t\tI'm familiar with appropriate\n\t\tbehavior at a military parley.\n\n\t\t\t\tMAJOR HALBERT\n\t\tYes, quite, but you should know\n\t\tthat...\n\n\t\t\t\tMARION\n\t\tThat will be all, Major.  I'll wait\n\t\tfor Lord Cornwallis.\n\n\t\t\t\tMAJOR HALBERT\n\t\t\t   (coldly)\n\t\tYes... you will wait.\n\nMajor Halbert turns and starts to stride out.\n\n\t\t\t\tMARION\n\t\tOne other thing.\n\nMajor Halbert stops.\n\n\t\t\t\tMARION\n\t\tThe proper form of address to a\n\t\tsuperior officer, even one of an\n\t\topposing army, is \"Yes, sir.\"\n\nMajor Halbert sneers and strides from the room.  MARION\nALONE, EXCEPT FOR THE DOGS, allows himself a fleeting\nsmile.  Then he looks around the room.  He notes a rocking\nchair.  Curious, he hefts it.  Too heavy.  He puts it\ndown, sits and rocks.  The dogs walk over and lay at his\nfeet.\n\nINT.  CORNWALLIS' HEADQUARTERS - DAY (LATER)\n\nMarion patiently sits rocking.  One of the dogs has its\nhead in his lap and Marion scratches it behind the ears.\n\n\t\t\t\t\t\t\t    DISSOLVE TO:\n\nINT.  CORNWALLIS' HEADQUARTERS - DAY\n\nA stone-faced Marion stands in the center of the room,\nplaying with the dogs.  One of the dogs jumps up, putting\nits front legs on Marion's shoulders, and licks his face.\nJust then, Cornwallis walks in, overjoyed to see his dogs.\n\n\t\t\t\tCORNWALLIS\n\t\tJupiter!  Mars!\n\nThe dogs just look at Cornwallis.  He holds out his arms,\nwaiting for them to rush to him.  They look up at Marion\nwho nods to them.\n\n\t\t\t\tMARION\n\t\tGo.\n\nThe dogs run to Cornwallis and nuzzle him in a friendly\nbut not enthusiastic manner.  Cornwallis pats them\nvigorously, too vigorously for the moderate level of joy\nthe dogs are showing at their reunion.\n\n\t\t\t\tCORNWALLIS\n\t\tMy boys... my boys... you seem to\n\t\thave been well fed.  Thank you for\n\t\tthat, Colonel.\n\n\t\t\t\tMARION\n\t\tMy pleasure, sir.\n\n\t\t\t\tCORNWALLIS\n\t\tPlease forgive me for keeping you\n\t\twaiting.\n\n\t\t\t\tMARION\n\t\tApology accepted.\n\n\t\t\t\tCORNWALLIS\n\t\tThank you, Colonel... I'm afraid I\n\t\tdon't know your name.\n\n\t\t\t\tMARION\n\t\tColonel will do.\n\n\t\t\t\tCORNWALLIS\n\t\tAs you wish.\n\nTARLETON ENTERS with four Dragoons, all armed...\n\nMarion freezes...\n\nMarion and Tarleton lock eyes.  Marion searches for some\nsign that Tarleton recognizes him.  There's none.\n\n\t\t\t\tCORNWALLIS\n\t\tColonel... Colonel Banastre\n\t\tTarleton.\n\nTarleton nods.\n\n\t\t\t\tTARLETON\n\t\tColonel.\n\nMarion, like ice, looks Tarleton up and down.  Then he\nslowly turns and looks at the four Dragoons, two on either\nside of Tarleton.  Marion measures the odds and finds them\nwanting.\n\nWith a supreme effort of will, Marion forces himself to\nturn from Tarleton to Cornwallis and the matter at hand.\n\n\t\t\t\tMARION\n\t\tShall we proceed?\n\n\t\t\t\tCORNWALLIS\n\t\tLet us.  Unless you object, I would\n\t\tlike to deem this meeting a formal\n\t\tnegotiation and, as such, there are\n\t\tcertain customary practices.\n\t\tPerhaps I could explain them to\n\t\tyou...\n\n\t\t\t\tMARION\n\t\tI'm familiar with how a formal\n\t\tnegotiation is handled.\n\n\t\t\t\tCORNWALLIS\n\t\tOh?\n\n\t\t\t\tMARION\n\t\tI served in His Majesty's army in\n\t\tthe French and Indian War.\n\n\t\t\t\tCORNWALLIS\n\t\tOh.  Very well, then.  Would you, as\n\t\tthe initiating party, like to begin?\n\n\t\t\t\tMARION\n\t\tUnless you would like to claim\n\t\taggrieved status.\n\nCornwallis is surprised.  He exchanges a look with\nTarleton.\n\n\t\t\t\tCORNWALLIS\n\t\tYou are familiar with how these\n\t\tthings are done.  In fact, I would\n\t\tlike to claim aggrieved status.\n\n\t\t\t\tMARION\n\t\tVery well, proceed, sir.\n\n\t\t\t\tCORNWALLIS\n\t\tFirst, you have in your possession\n\t\tcertain belongings of mine,\n\t\tincluding clothing, private papers,\n\t\tfurniture and personal effects of a\n\t\tnon-military nature which I would\n\t\tlike to have returned to me.\n\n\t\t\t\tMARION\n\t\tI will do so as soon as possible.\n\nCornwallis is surprised.\n\n\t\t\t\tCORNWALLIS\n\t\tThank you.\n\n\t\t\t\tMARION\n\t\tPlease accept my apology for not\n\t\thaving done so sooner.\n\n\t\t\t\tCORNWALLIS\n\t\tApology accepted.  Now, on the\n\t\tmatter of the specific targeting of\n\t\tofficers during engagements, this is\n\t\tabsolutely unacceptable.\n\n\t\t\t\tMARION\n\t\tThat one is a bit more difficult.\n\n\t\t\t\tCORNWALLIS\n\t\tCertainly you must know that in\n\t\tcivilized warfare, officers in the\n\t\tfield must not be accorded\n\t\tinappropriate levels of hostile\n\t\tattention.\n\n\t\t\t\tMARION\n\t\tAnd what are inappropriate levels of\n\t\thostile attention?\n\n\t\t\t\tCORNWALLIS\n\t\tColonel, imagine the utter chaos\n\t\tthat would result from un-led armies\n\t\thaving at each other.  There must be\n\t\tgentlemen in command to lead and,\n\t\twhen appropriate, restrain their\n\t\tmen.\n\n\t\t\t\tMARION\n\t\tRestrain them from the targeting of\n\t\tcivilians, including women and\n\t\tchildren?\n\n\t\t\t\tCORNWALLIS\n\t\tThat is a separate issue.\n\n\t\t\t\tMARION\n\t\tI consider them linked.\n\n\t\t\t\tCORNWALLIS\n\t\tI beg to differ.  One is a command\n\t\tdecision on your part.  The other\n\t\trepresents nothing more than the\n\t\toccasional over-exuberance of field\n\t\tofficers attempting to carry out\n\t\ttheir duty in difficult\n\t\tcircumstances.\n\n\t\t\t\tMARION\n\t\tAs long as your soldiers attack\n\t\tcivilians, I will order the shooting\n\t\tof your officers at the outset of\n\t\tevery engagement.\n\t\t\t   (beat)\n\t\tAnd my men are excellent marksmen.\n\nCornwallis sighs.\n\n\t\t\t\tCORNWALLIS\n\t\tVery well, let us move on to...\n\n\t\t\t\tMARION\n\t\tPrisoner exchange.\n\n\t\t\t\tCORNWALLIS\n\t\tSir?\n\n\t\t\t\tMARION\n\t\tYou have eighteen of my men.  I want\n\t\tthem back.\n\n\t\t\t\tCORNWALLIS\n\t\tI do have eighteen criminals under\n\t\tsentence of death, but I hold no\n\t\tprisoners-of-war.\n\n\t\t\t\tMARION\n\t\tIf that's your position, then\n\t\teighteen of your officers will die.\n\t\tNineteen, if you hang me with my\n\t\tmen.\n\n\t\t\t\tCORNWALLIS\n\t\tWhat officers?\n\nMarion steps to the window, checks the view.  A wooded\nhillside is visible in the distance.  Marion reaches into\nhis jacket...\n\nThe Dragoons move on him...\n\nMarion extracts not a weapon, but a spyglass, which he\nhands to Cornwallis.\n\n\t\t\t\tMARION\n\t\tIn the clearing, just down from the\n\t\tcrest, to the left of the dark\n\t\tpines...\n\nCornwallis looks through the spyglass.\n\nVIEW THROUGH THE SPYGLASS\n\nThough difficult to see clearly through the shimmering\nhaze, Cornwallis can just make out a row of bound Redcoat\nofficers, with Patriot soldiers holding muskets at their\nheads.\n\nCORNWALLIS turns coldly to Marion.\n\n\t\t\t\tCORNWALLIS\n\t\tTheir names, ranks and posts?\n\n\t\t\t\tMARION\n\t\tThey refused to give me their names.\n\t\tTheir ranks are nine lieutenants,\n\t\tfive captains, three majors and one\n\t\tfat colonel who called me a cheeky\n\t\tfellow.  Their posts?  We picked\n\t\tthem up here-and-there last night.\n\nCornwallis glares at Marion.\n\n\t\t\t\tCORNWALLIS\n\t\tYou are not a gentleman.\n\nMarion can't help but laugh at the insult.\n\n\t\t\t\tMARION\n\t\tIf your conduct is the measure of a\n\t\tgentleman, I take that as a\n\t\tcompliment.\n\t\t\t   (coldly)\n\t\tGet my men.\n\nCornwallis turns to Colonel Huntington.\n\n\t\t\t\tCORNWALLIS\n\t\tArrange the exchange.\n\nColonel Huntington leaves to do so.\n\n\t\t\t\tMARION\n\t\tThank you, General.  I'm sure your\n\t\tofficers will thank you, as well.\n\nMarion salutes Cornwallis who doesn't return the salute.\n\nTHEN MARION TURNS TO TARLETON.  He walks up to him and\nlooks him in the eye.\n\n\t\t\t\tMARION\n\t\tYou don't remember me, do you?\n\nTarleton examines Marion's face, finding him familiar, but\nunable to place him... then Tarleton remembers...\n\n\t\t\t\tTARLETON\n\t\tAh, yes, that boy.\n\nTarleton calmly holds Marion's glare.\n\n\t\t\t\tTARLETON\n\t\tUgly business, doing one's duty.\n\n\t\t\t\tMARION\n\t\tYes, ugly business.\n\nMarion takes a step closer to Tarleton, then speaks very\nsoftly, very slowly, very clearly.\n\n\t\t\t\tMARION\n\t\tIf you are alive when this war is\n\t\tover, I'm going to kill you.\n\nMarion locks his eyes on Tarleton to make it perfectly\nclear that he means what he says.  Tarleton tries to cover\nhis reaction but it's apparent that he's taken aback by\nMarion's icy words.\n\nMarion turns and walks out.  The two Great Danes start to\nfollow, but Cornwallis SNAPS A COMMAND:\n\n\t\t\t\tCORNWALLIS\n\t\tJupiter!  Mars!\n\nTHE DOGS FREEZE, looking after Marion, who doesn't turn\nback.  The dogs reluctantly sidle over to Cornwallis'\nside.\n\nEXT.  ASSEMBLY YARD - FORT CAROLINA - DAY\n\nRedcoats glare at Marion who sits, mounted, waiting.  His\neighteen men are led out of the prison blockhouse and\ndirected to waiting horses.  Surprised to be freed, they\nmount up.\n\nCORNWALLIS AND TARLETON step out onto the front porch of\nCornwallis' headquarters and watch as Marion and his men\nride toward the gate.\n\nTHE TWO GREAT DANES, watch Marion from Cornwallis' side.\n\nCornwallis motions to the Redcoat Sentries to OPEN THE\nGATES.  They do so and Marion and his men, without\nhurrying, ride out.\n\nThen, just as the gates are closing behind him, Marion,\nwithout turning around, lets loose with a PIERCING\nWHISTLE...\n\nTHE TWO GREAT DANES INSTANTLY RACE AFTER MARION, making it\nthrough the gates just as they're closing.\n\nCORNWALLIS, seeing his dogs run after Marion, SPUTTERS,\nthen turns and storms back into his quarters.\n\nTARLETON, still off-balance from Marion's parting\nstatement, watches Marion ride away.  Then he turns to\nMajor Wilkins who stands nearby.\n\n\t\t\t\tTARLETON\n\t\tTake a detachment and go get our\n\t\tofficers.\n\nWilkins hurries off.\n\nEXT.  HILLSIDE CLEARING - ABOVE FORT CAROLINA - DAY\n\nMajor Wilkins and a detachment of Green Dragoons ride up\nthe wooded slope toward the bound Redcoat officers that\nCornwallis saw through the spyglass.  As the Dragoons ride\nout of the trees into the clearing they stop dead, seeing\nthat:\n\nTHE \"REDCOAT OFFICERS\" are not real -- they're nothing\nmore than SCARECROWS IN REDCOAT UNIFORMS.  There's no sign\nof Marion or his men.\n\nINT.  CORNWALLIS' HEADQUARTERS - FORT CAROLINA - DAY\n\nCLOSE SHOT:  One of the \"Redcoat Officers,\" stuffed with\nstraw is thrown onto Cornwallis' desk by Tarleton.\n\nCornwallis looks at the scarecrow, then turns to Tarleton.\n\n\t\t\t\tCORNWALLIS\n\t\tThis fox believes himself clever.\n\t\tWe shall see.\n\nEXT.  POND BLUFF - DAY\n\nTarleton and Wilkins wait while Green Dragoons and\nLoyalists search the remains of Marion's house and barn.\nGaskins, filthy from the ashes, walks up to Tarleton.\n\n\t\t\t\tGASKINS\n\t\tNothing.\n\n\t\t\t\tWILKINS\n\t\tNo one's been here for months.\n\n\t\t\t\tTARLETON\n\t\tBut now we have a name for our\n\t\tColonel... Francis Marion.  And with\n\t\ta name will come a family.\n\nEXT.  CHARLOTTE'S HOUSE - NIGHT\n\nA thick ground fog surrounds Charlotte's house.  The soft\nlights of candles glow in the windows.  All appears\npeaceful.\n\nThen, the SHADOWED FIGURES of THREE DOZEN GREEN DRAGOONS\nappear out of the mist, silently approaching the house on\nfoot.\n\nINT.  CHARLOTTE'S HOUSE - NIGHT\n\nA fire crackles in the fireplace.  A curtain blows in the\nopen window.  THE DOOR BURSTS OPEN.  WINDOWS BREAK.  Green\nDragoons pour into the house, muskets brandished.  No sign\nof occupants.  CAPTAIN MORROW barks a command:\n\n\t\t\t\tCAPTAIN MORROW\n\t\tUPSTAIRS!\n\nThe Dragoons THUNDER UP THE STAIRS... Tarleton and Wilkins\nstride in, watching the search... the parlor... nothing...\nThe kitchen... food is cooking...\n\nThe dining room... the table is set, half-eaten food is on\nthe plates, abandoned in mid-meal.  TARLETON WALKS INTO\nTHE DINING ROOM, touches some of the food, gauging its\nwarmth.\n\n\t\t\t\tTARLETON\n\t\tThey can't be far.  Check the\n\t\toutbuildings and the woods.\n\nThe Dragoons race outside.\n\nEXT.  CHARLOTTE'S HOUSE - NIGHT\n\nA TORCH BURNS.  A dozen Dragoons light torches off of it\nand fan out to search.  The thick fog turns the torches\ninto diffused, floating balls of light, turning the\nDragoons into ghost-like apparitions.\n\nCAMERA FOLLOWS ONE OF THE TORCHES, carried by a\nparticularly rough-looking Dragoon who skirts the edge of\nthe underbrush closest to the house.  As the torch moves,\nits flame sends long shadows and shafts of light into the\nunderbrush...\n\nThe CAMERA STOPS to reveal, in the brush, TWO FACES,\nGABRIEL AND CHARLOTTE, dark, motionless, watching the\nsearch.  Behind them, MARION'S OTHER CHILDREN, Nathan,\nSamuel, Margaret, William and Susan...\n\nAround them, SEVERAL MORE OF MARION'S MEN, including ABNER\nBROWN, weapons ready.  The moving lights play on their\nfaces.\n\nAT THE FRONT OF THE HOUSE, the torches converge,\nilluminating Tarleton who gives the unheard order.  The\ntorches fan out and begin SETTING FIRE TO THE HOUSE, BARNS\nAND OUTBUILDINGS.\n\nMARGARET grips Charlotte's arm.  Gabriel motions and they\nall ease back, disappearing into the brush.\n\nEXT.  SHANTY TOWN - NIGHT\n\nA compound of rude shacks, built of scraps of lumber and\nrough-hewn logs, stands on the side of the Magpie River.\n\nMarion's men wait with the children while Abner, Charlotte\nand Gabriel, flanked by Aaron and Abigail, Marion's\nmiddle-aged, black servants, seen in the opening sequence,\ntalk with several stern-looking, middle-aged, black\nFREEDMEN.\n\nThe conversation, which is out of the children's earshot,\nis testy, with one of the middle-aged freedmen\nparticularly troubled.\n\nMarion's stone-faced children look around, appraising\ntheir surroundings, registering the poverty of the shanty\ntown.\n\nTHE DISCUSSION BETWEEN THE GROWN-UPS ends with a guarded\nexchange of handshakes.  Gabriel, Charlotte, Abner, Aaron\nand Abigail rejoin the children and Marion's men.\n\n\t\t\t\tGABRIEL\n\t\tIt's all set.\n\nThey follow Aaron, down an alley to A SHACK.  Small.\nBarely standing.  The children stop in their tracks,\nknowing this is to be their new home.\n\nCharlotte sees their hesitation.  She walks up to the\nlittle structure, examining it with a critical eye.  She\nlooks on the doorway, seeing a single room, a dirt floor,\nwax-paper instead of glass in the windows, a rude,\nchimney-less fire-pit against the back wall.  She smiles.\n\n\t\t\t\tCHARLOTTE\n\t\tThis will do fine.\n\nShe turns to Aaron and Abigail.\n\n\t\t\t\tCHARLOTTE\n\t\tThank you.\n\nCharlotte walks inside without looking back.  The children\nhesitate, then follow her inside.\n\nINT.  SHACK - SHANTY TOWN - NIGHT\n\nThe children help Aaron and Abigail make beds out of\narmloads of hay.  OUTSIDE, Charlotte and Gabriel talk\nquietly.\n\n\t\t\t\tCHARLOTTE\n\t\tSo he's the one they talk about, the\n\t\tSwamp Fox.\n\n\t\t\t\tGABRIEL\n\t\tYes.\n\n\t\t\t\tCHARLOTTE\n\t\tI thought it might be him, the bits\n\t\tand pieces we heard, a veteran,\n\t\tfought in the French and Indian War,\n\t\tknows the swamps.\n\n\t\t\t\tGABRIEL\n\t\tThey won't stop looking for you and\n\t\tthe children.\n\n\t\t\t\tCHARLOTTE\n\t\tWe'll be alright, here, for now.\n\t\t\t   (beat)\n\t\tHow is he?\n\nGabriel searches for an honest answer.\n\n\t\t\t\tGABRIEL\n\t\tI don't know... I'm his son.\n\nGabriel steps over to his saddlebags, opens his pack and\npulls out a stack of letters which he hands to Charlotte.\n\n\t\t\t\tGABRIEL\n\t\tThese are for you and the children.\n\nThey sense someone behind them.\n\n\t\t\t\tSUSAN\n\t\tWhy didn't father come?\n\nGabriel is astonished to hear words coming from his\nheretofore silent sister.  Charlotte nods, smiling.\n\n\t\t\t\tCHARLOTTE\n\t\tSpeaking for months now.\n\n\t\t\t\tSUSAN\n\t\tWhy didn't he come?\n\n\t\t\t\tGABRIEL\n\t\tHe wanted to, Susan, but he couldn't\n\t\tleave his men.\n\n\t\t\t\tSUSAN\n\t\tHe left us.\n\n\t\t\t\tGABRIEL\n\t\tI know he did and he's sorry.  He'll\n\t\tcome back as soon as he can.\n\nSusan says nothing.  Gabriel continues, hopefully.\n\n\t\t\t\tGABRIEL\n\t\tThere are some letters here from\n\t\thim.  Some are just to you.\n\n\t\t\t\tSUSAN\n\t\tI don't care.  I hate him.\n\n\t\t\t\tGABRIEL\n\t\tYou don't hate him.\n\n\t\t\t\tSUSAN\n\t\tYes, I do.  I hate him and I hope he\n\t\tnever comes back.\n\nGabriel kneels down and embraces her.  She stands coldly\nwith her arms at her sides.\n\nEXT.  MARION'S ENCAMPMENT - DAY\n\nAn astonished Marion talks to Gabriel.\n\n\t\t\t\tMARION\n\t\tShe spoke?  Susan spoke?\n\n\t\t\t\tGABRIEL\n\t\tFull sentences.  As if she had been\n\t\tspeaking all along.\n\n\t\t\t\tMARION\n\t\tI don't believe it... and I wasn't\n\t\tthere for it...\n\nThe cloud passes quickly.\n\n\t\t\t\tMARION\n\t\tTell me everything she said, word\n\t\tfor word.\n\nGabriel hesitates.\n\n\t\t\t\tGABRIEL\n\t\tShe said... she loves you and misses\n\t\tyou but she understands why you\n\t\tcan't be there with her.\n\n\t\t\t\tMARION\n\t\tShe said that?  Oh, my Lord, she said\n\t\tthat?\n\nGabriel nods.\n\n\t\t\t\tMARION\n\t\tIsn't that something.\n\nMarion shakes his head at the thought, smiling to himself.\nGabriel, uncomfortable with the lie, changes the subject.\n\n\t\t\t\tGABRIEL\n\t\tFather, there's something else I\n\t\tneed to talk to you about.\n\n\t\t\t\tMARION\n\t\tWhat?\n\n\t\t\t\tGABRIEL\n\t\tCome with me.  I'll tell you when we\n\t\tget there.\n\nMarion nods and curiously follows Gabriel.\n\nEXT.  PEMBROKE VILLAGE - NIGHT\n\nDark.  The village square is deserted.  Marion follows\nGabriel into the shadow of the village church.  They\ndismount, tie up their horses and enter the back door of\nthe church.\n\nINT.  CHURCH - PEMBROKE VILLAGE - NIGHT\n\nMarion walks in and stops dead.  At the altar of the small\nsanctuary, HALF-A-DOZEN PEOPLE stand with Rev. Oliver.  At\nthe center of the tiny gathering is Anne Green, flanked by\nher parents.\n\n\t\t\t\tGABRIEL\n\t\tFather, I'm looking for a best man.\n\nMarion is stunned but recovers quickly.\n\n\t\t\t\tMARION\n\t\tI'd be honored.\n\nThey share a moment, then head down the aisle.  Marion\ngreets Anne's parents, shaking hands with her father and\nbowing to her mother.  Abner, at the door, nods that the\ncoast is clear.\n\n\t\t\t\tREV. OLIVER\n\t\tDearly beloved, we are gathered here\n\t\tin the sight of God to join this man\n\t\tand this woman in holy matrimony...\n\nMARION feels every word, looking straight ahead but\nknowing that he's standing next to his son.\n\nEXT.  CHURCH - NIGHT\n\nIn the shadows behind the church, the bride and groom say\ngoodbye to the wedding party.  Anne talks quietly with her\nparents.  Marion and Gabriel talk nearby.\n\n\t\t\t\tGABRIEL\n\t\tSir, I'd like to request a furlough.\n\t\tTwo days?\n\n\t\t\t\tMARION\n\t\tGranted.  Where are you going?\n\n\t\t\t\tGABRIEL\n\t\tCheraw Falls.\n\n\t\t\t\tMARION\n\t\tIt's beautiful there.  Your mother\n\t\tand I were there once, before you\n\t\twere born.\n\n\t\t\t\tGABRIEL\n\t\tI know.\n\nThey're silent for a moment.\n\n\t\t\t\tMARION\n\t\tShe would have been pleased.\n\nGabriel nods, then turns to his horse, unnecessarily\nchecking his pack ropes.  Anne joins them.  Marion\nembraces her and gives her a fatherly kiss.\n\n\t\t\t\tANNE\n\t\tI'm sorry we didn't give you more\n\t\twarning.\n\n\t\t\t\tMARION\n\t\tIt's alright.  I'm very happy for\n\t\tyou.\n\nHe helps her mount up.  Abner, on guard near the road,\nmotions them on.  They all watch as Gabriel and Anne ride\noff.\n\nEXT.  WOODED ROAD - NIGHT\n\nMarion, Rev. Oliver and Abner ride slowly down the road.\nIt's a beautiful, moonlit night.  Marion breaks the\nsilence, speaking as much for himself as the others.\n\n\t\t\t\tMARION\n\t\tIt's a good measure of a woman that\n\t\tshe'll have her honeymoon under the\n\t\tstars.\n\n\t\t\t\tREV. OLIVER\n\t\tFor richer, for poorer, in sickness\n\t\tand in health, 'til death do they\n\t\tpart.\n\nMarion nods.  They ride on.\n\nEXT.  SOUTH CAROLINA SHORE - DAY\n\nA British packet, a small, fast warship, lies anchored\njust offshore.  A rowboat, manned by half-a-dozen sailors,\ncarrying a Redcoat Lieutenant, beaches.  Several Redcoats\nwait.\n\nThe Lieutenant, carrying a dispatch case, jumps out off\nthe boat, mounts a waiting horse and rides off.\n\nEXT.  SMALL BRITISH FORT - DAY\n\nCornwallis, with his command staff clustered around him,\nsits on horseback reading the dispatch as the dispatch\nrider waits.  They're on a hillside, looking over the\nburned-out remains of a small British fort as some\nRedcoats pull the Union Jack out of a trench latrine.\n\nCornwallis motions Tarleton and they ride a few yards from\nthe other officers and speak, out of earshot.\n\n\t\t\t\tCORNWALLIS\n\t\tFrom General Clinton in New York...\n\t\t\t   (reading)\n\t\t\"... your request to move north is\n\t\tdenied until you have properly dealt\n\t\twith your militia problem.\"\n\t\t\t   (aside)\n\t\tHe underlined, 'militia'.\n\t\t\t   (reading)\n\t\t\"You have spent over six months\n\t\tdealing with a six-week problem.  It\n\t\tis essential that you quell the\n\t\tmilitia...\"\n\t\t\t   (aside)\n\t\tUnderlined again.\n\t\t\t   (reading)\n\t\t\"... insurgency, particularly\n\t\tbecause of the likely move south of\n\t\tWashington and the inevitable\n\t\tarrival of the French.  Militia, as\n\t\tyou have so often pointed out, is\n\t\tnot worth the attention of a\n\t\tsignificant army, hence it is\n\t\tmystifying why militia has bedeviled\n\t\tyou for so long...\"\n\nTarleton smiles slightly, enjoying the show.\n\n\t\t\t\tCORNWALLIS\n\t\t\t   (reading)\n\t\t\"... it is my fervent hope that the\n\t\tvigor of your campaign comes to\n\t\tmatch the vigor of your\n\t\tcorrespondence with your\n\t\tParliamentary and Court patrons.\n\t\tOnly then might you share in the\n\t\tvictory, on the verge of which I now\n\t\tstand.\"\n\t\t\t   (beat)\n\t\t\"Your guardedly respectful\n\t\tCommander, General Sir George\n\t\tClinton.\"\n\nCornwallis grows eerily calm and turns to Tarleton.\n\n\t\t\t\tCORNWALLIS\n\t\tIf I fail, you fail.\n\n\t\t\t\tTARLETON\n\t\tPerhaps.\n\n\t\t\t\tCORNWALLIS\n\t\tAnd if I triumph, you triumph.\n\n\t\t\t\tTARLETON\n\t\tProbably.\n\n\t\t\t\tCORNWALLIS\n\t\tHow can we end this madness?\n\n\t\t\t\tTARLETON\n\t\tDifficult, sir.  This is, as you\n\t\tpointed out, a civil war.\n\nCornwallis takes a moment, then speaks simply.\n\n\t\t\t\tCORNWALLIS\n\t\tCivility is a secondary virtue.  It\n\t\tis superseded by duty.\n\n\t\t\t\tTARLETON\n\t\tI understand, sir.\n\nTarleton salutes, yanks his reins, turning his horse, and\nrides off.\n\nEXT.  SMALL FARMHOUSE - SUNSET\n\nTarleton lounges in the grass on a slope in front of a\nfarmhouse, looking out at a lovely sunset, absentmindedly\npicking at the petals of some wildflowers.  A HIDEOUS\nSCREAM pierces the calm.\n\nTarleton analytically evaluates the tenor of the scream,\nthen rises, passing several Green Dragoons who wait with\ntheir horses in front of the farmhouse.\n\n\t\t\t\tTARLETON\n\t\tI believe they are almost ready.\n\nIN THE FARMHOUSE\n\nBlood is smeared on one wall, where half-a-dozen corpses\nlie in a jumbles mass on the floor.\n\nIn the parlor, Tarleton walks past more bodies, including\na dead woman who lies protectively but ineffectually over\nthe bloody bodies of her two young children, both under\neight-years-old.\n\nIn the kitchen, Tarleton finds Wilkins, some Green\nDragoons, and Gaskins, the Loyalist Militia commander and\nsome of his low-life men.\n\nRob Fielding, one of the craftsmen in Marion's force, is\ntied, spread-eagle to the table, showing the terrible\neffects of PROTRACTED TORTURE.  Wilkins and Gaskins are\nnervous and apologetic as Tarleton walks into the room.\n\n\t\t\t\tGASKINS\n\t\tI'm sorry, sir.  He died.\n\nTarleton sighs, irritated.\n\n\t\t\t\tTARLETON\n\t\tVery well, get one of the others.\n\nGaskins and a couple of his men step into an attached\nwoodshed where Billings sits, bound.  They roughly grab\nhim and drag him into the kitchen.\n\n\t\t\t\tBILLINGS\n\t\tDamn your eyes.  Do your worst.\n\n\t\t\t\tTARLETON\n\t\tI intend to.\n\nThey tie Billings to the table.\n\nINT.  SMALL FARMHOUSE - DAY\n\nSilence.  A tiny rivulet of blood runs along a plank in\nthe floor, disappearing into a gap between two\nfloorboards.\n\nMarion, Dalton, Rev. Oliver, and several other men walk\nslowly through the farmhouse, in stunned silence.\n\nMarion sees the body of the mother, draped over her two\nyoung children.  Marion turns to Rev. Oliver who can only\nstare, offering no solace.\n\nThey pass Fielding's body, then enter the kitchen and see\nBILLINGS, DEAD, still tied to the table.  Marion reels.\n\nEXT.  SMALL FARMHOUSE - DAY\n\nMarion's men dig graves.  Marion watches.  Dalton steps up\nnext to him.\n\n\t\t\t\tDALTON\n\t\tYou still want me to give wounded\n\t\tRedcoats quarter?\n\nMarion doesn't answer.  Gabriel GALLOPS up.  He reins back\nhis lathered horse and speaks to them without dismounting.\n\n\t\t\t\tGABRIEL\n\t\tTarleton has a list of our men, most\n\t\tare on it.  A regiment of dragoons\n\t\tis going to the homes on the list,\n\t\tburning them, killing whomever\n\t\tresists, women and children, as\n\t\twell.\n\n\t\t\t\tMARION\n\t\tWhere?\n\n\t\t\t\tGABRIEL\n\t\tSeven homes along the Black River so\n\t\tfar...\n\nRollins doesn't pause.  He rushes to his horse, mounts up\nand rides off.  Marion and the other men mount up and ride\noff fast after him.\n\nEXT.  BLACK RIVER ROAD - DAY\n\nMarion his brigade catch up to Rollins and ride on with\nhim.\n\nEXT.  ROLLINS' FARM - DAY\n\nThe small farm seen earlier, surrounded by hills, where\nthe two boys, Rollins' sons ran down the hillside to catch\na glimpse of the passing Marion and his brigade.\n\nThe house smolders.  No sign of life.  Gabriel, Abner and\na few other men warily ride the perimeter of the cleared\narea around the house.\n\nMarion, at the head of the rest of the brigade, waits next\nto an increasingly frantic, Rollins.  They see Gabriel\nwave, signaling all clear.\n\nMARION, ROLLINS AND THE OTHER MEN RIDE to the house.\nRollins is the first to see THE BODIES.  Horrified, he\nreins back and dismounts, almost falling.\n\nHis TWO SONS, WIFE, an OLDER MAN and WOMAN, lie dead in\nthe dirt.  Marion's men silently watch Rollins' agony.\nWeeping and confused, he moves in a mad, staccato manner,\nas if he were a marionette, whose strings were being\njerked by a drunken puppeteer.\n\nMarion and Rev. Oliver dismount and move toward him.\nRollins sees them coming.  He hardens and strides to his\nhorse, pulling his FLINTLOCK PISTOL from his saddle\nholster.\n\nRev. Oliver reaches out to embrace Rollins.\n\n\t\t\t\tREV. OLIVER\n\t\tIt's not time for vengeance, it's\n\t\ttime to mourn and...\n\nROLLINS PUTS THE PISTOL TO HIS HEAD AND PULLS THE TRIGGER,\nBLOWING HIS BRAINS OUT.\n\nEvery man freezes in place.  For a long moment no one\nmoves, no one speaks.  Then Marion pulls himself together\nand addresses the men:\n\n\t\t\t\tMARION\n\t\tFive day furlough for all men.\n\t\tAbner, Dan, Reverend, spread the\n\t\tword.  We'll reform at Acworth.  Any\n\t\tman who doesn't come back won't be\n\t\tthought a coward or uncommitted to\n\t\tthe cause.  Attend to your families.\n\nThe men mount up.  Marion and Gabriel ride off together.\n\nEXT.  PEMBROKE - NIGHT\n\nMarion scans the night as Gabriel and Anne mount up.  The\nthree of them ride off, pulling a line of horses, some\nheavily loaded packhorses and some saddled but empty\nmounts.\n\nEXT.  SHACK - SHANTY TOWN - NIGHT\n\nDark.  Quiet.  Gabriel and Anne wait in the shadows while\nMarion cocks his musket, checks his pistols and walks\nslowly toward the shack.\n\nHe warily checks every shadow.  No one anywhere.  Then a\nSOUND -- A SQUEAL OF LAUGHTER, immediately followed by:\n\n\t\t\t\tMARGARET (O.S.)\n\t\tIt's him!  I told you it was him!\n\nMARION'S CHILDREN RACE OUT OF THE SHADOWS to Marion.  He's\npractically bowled over as Margaret, Nathan, Samuel and\nWilliam fling themselves into his arms.\n\n\t\t\t\tNATHAN\n\t\tFather!\n\n\t\t\t\tWILLIAM\n\t\tPapa...\n\nCHARLOTTE STEPS OUT OF THE SHADOWS, watching the reunion\nas Marion covers the children with kisses, trying to hug\nall of them at once as they cling to him as if they'll\nnever let go.  MARION AND CHARLOTTE LOCK EYES over the\nheads of the children.\n\n\t\t\t\tMARION\n\t\tThank you.\n\nCharlotte smiles.  Then Marion notices SUSAN peeking out\nfrom behind Charlotte's patched and mended skirt.  He\nkneels down and opens his arms to her but she doesn't\nmove.\n\nHe smiles to her and speaks softly:\n\n\t\t\t\tMARION\n\t\tSusan...\n\nShe looks coldly at Marion, tightens her grip on\nCharlotte's skirt and retreats further behind her.  Marion\nlooks to Charlotte who nods with guarded reassurance.\nThen his attention is drawn away by the demanding embraces\nof his other children.\n\nEXT.  CHERAW FALLS PATH - NIGHT\n\nMarion rides, leading his children, Charlotte and Anne up\na steep, narrow path that cuts through a heavily wooded\nhillside.\n\nEXT.  CHERAW FALLS - NIGHT\n\nThe remains of a tiny abandoned backcountry farm.  The\nhouse is gone, leaving only an overgrown cellar hole.\n\nNearby is a barely-standing tobacco shed, one end of which\nhas fallen to the ground.  A SOFT WIND WHISTLES AND\nWHISPERS through the gaps in the rough-hewn boards of the\nstructure.\n\nMarion rides up to the edge of the clearing.  A\nMOCKINGBIRD SCREECHES nearby, startling him.  He looks\nback at the children, worried, anticipating a negative\nreaction.  Margaret smiles and turns to the other\nchildren, speaking for Marion's benefit.\n\n\t\t\t\tMARGARET\n\t\tI told you, things would get better.\n\nThe children smile and dismount.\n\nINT.  TOBACCO SHED - NIGHT\n\nPOURING RAIN.  The ceiling drips.  Marion lies, awake,\nwith his children huddled against him, sleeping in one of\nthe few dry spots.  They're covered with tattered quilts.\n\nOn the other side of the children, Charlotte is also\nawake.  She and Marion exchange a long, silent look in the\ndarkness, over the heads of the sleeping children.\n\nEXT.  WATERFALL OVERLOOK - DAY\n\nMarion walks the perimeter of their encampment with Nathan\nand Samuel.  They listen carefully.\n\n\t\t\t\tMARION\n\t\tThe overlook, up there should be\n\t\twhere you post the watch.  Work out\n\t\ta schedule.  Short watches,\n\t\tespecially at night.\n\t\t\t   (pointing)\n\t\tIf you can catch some of those\n\t\tmockingbirds you can make cages and\n\t\tput them along there for alarms.\n\t\t\t   (motioning for them\n\t\t\t    to follow)\n\t\tNow let's find someplace to cache\n\t\textra weapons...\n\nThey follow Marion like soldiers.\n\nEXT.  CHERAW FALLS - DAY\n\nMarion sits on a rock while Margaret cuts his hair.  She\ntakes her time, touching him on the head and shoulders,\nextending the process.  Marion, sits back, enjoying it.\nHe notices Susan, nearby, watching silently.  He smiles.\nShe turns away.\n\nEXT.  TOBACCO SHED - CHERAW FALLS - DAY\n\nDark.  Shafts of light shine in through the holes in the\nroof.  Marion, standing in the shadows, senses someone\ncoming.  He freezes.\n\nA figure rounds the corner.  It's... William.  MARION\nYELLS William SQUEALS IN DELIGHT, then chases his father\naround the corner, tagging him.  They laugh.  Marion\ncovers his eyes and William dashes off to hide.\n\nEXT.  CHERAW FALLS - RIVERSIDE - DAY\n\nMarion sits on the side of the river with Susan who avoids\nlooking at him.  Using the knife we've seen him use in\nbattle he cuts slices off an apple and eats them.\n\n\t\t\t\tMARION\n\t\tGood apple.\n\nNo response.\n\n\t\t\t\tMARION\n\t\tVery good.  Sweet.\n\nHe cuts a slice and offers it to her.  She doesn't take\nit.  He puts the slice between them.  After a long moment\nshe picks it up but as she's about to eat it, she stops,\nseeing something on it.  She puts it back.\n\nMarion looks at the apple slice and sees a dark red\nsplotch on it.  He looks at his knife and realizes that\nit's dried blood.\n\nOff-balance, he turns to Susan who stares straight ahead,\na thousand miles from Marion.\n\nEXT.  CHERAW FALLS RIVER - DAY\n\nMarion washes the knife carefully, almost obsessively.\nAnne steps up behind him.\n\n\t\t\t\tANNE\n\t\tMay I ask you a question?\n\nMarion finishes with the knife and puts it away without\nexplanation.\n\n\t\t\t\tMARION\n\t\tYes, of course.\n\nShe speaks with a sly, withheld smile.\n\n\t\t\t\tANNE\n\t\tDo you think Frances with an \"e\" is\n\t\ttoo manly a name for a girl?\n\n\t\t\t\tMARION\n\t\tNo.\n\n\t\t\t\tANNE\n\t\tDo you think Francis with an \"i\" is\n\t\ttoo womanly a name for a boy?\n\n\t\t\t\tMARION\n\t\tNo.\n\n\t\t\t\tANNE\n\t\tGood.\n\nAnne smiles and walks away.  Marion figures out what she\njust told him.\n\n\t\t\t\tMARION\n\t\tWhen?\n\n\t\t\t\tANNE\n\t\tLate summer.\n\n\t\t\t\tMARION\n\t\tCongratulations.\n\n\t\t\t\tANNE\n\t\tThank you.\n\nMarion laughs at the thought.\n\nEXT.  CHERAW FALLS - DAY\n\nMarion's children swim and play with the two Great Danes\nin the pond at the base of the falls, along with Gabriel\nand Anne.  Marion and Charlotte sit on the bank, watching\nthem.\n\nCharlotte turns and looks at Marion for a long moment.\nHe's unaware.  As Charlotte looks at him, her smile\ndisappears, replaced by anger.  She snaps at Marion.\n\n\t\t\t\tCHARLOTTE\n\t\tI'm not my sister.\n\nStartled, Marion turns to Charlotte.\n\n\t\t\t\tMARION\n\t\tExcuse me?\n\n\t\t\t\tCHARLOTTE\n\t\tI said, I'm not my sister.\n\n\t\t\t\tMARION\n\t\tI know that.\n\n\t\t\t\tCHARLOTTE\n\t\tDo you?\n\n\t\t\t\tMARION\n\t\tOf course, I do.\n\n\t\t\t\tCHARLOTTE\n\t\t\t   (irritated)\n\t\tVery well, then.\n\nShe turns from him.  Marion, tries to figure out what just\nhappened.  After a long moment he gets it.  Stunned at\nfirst, his gears turn.  After a very thoughtful moment he\nturns to Charlotte and offers a tentative smile.  She\nrolls her eyes.\n\nEXT.  CHERAW FALLS - NIGHT\n\nDark.  A full moon shines.\n\nINT.  TOBACCO SHED - NIGHT\n\nMarion wakes.  He looks across his sleeping children and\nsees that Charlotte isn't in her place on the other side\nof them.  He rises and walks out into the night.\n\nEXT.  GLEN - CHERAW FALLS - NIGHT\n\nMarion walks into the glen.  He tenses, sensing someone in\nfront of him.  Then he sees CHARLOTTE AT THE EDGE OF THE\nWOODS.  Neither one speaks...\n\nThey walk silently to each other.  They stop, looking at\neach other closely, as if seeing one another for the first\ntime...\n\nOnly then do they kiss.  The kiss grows more passionate...\nthen much more passionate...\n\nEXT.  CHERAW FALLS - DAY\n\nMarion finishes tying his gear onto his horse.  The\nchildren are silent.  He stands beside his horse.  One\nafter another, the children walk to him and embrace him --\nNathan, Samuel, Margaret, William.\n\nHe sees Susan, standing next to Charlotte.  He motions to\nher but she doesn't move.  Then he kneels down and gently\nhugs her.\n\n\t\t\t\tMARION\n\t\tJust a little goodbye?  One word?\n\t\tThat's all I want to hear.\n\nSusan remains silent, standing with her arms at her sides,\nnot responding to the embrace.\n\nFinally, Marion lets go of her.  She just stares at him.\n\nMarion stands and turns to Charlotte.\n\n\t\t\t\tMARION\n\t\tGoodbye, Charlotte.\n\n\t\t\t\tCHARLOTTE\n\t\tGoodbye.\n\nThey embrace.  Though the hug is chaste, their eyes tell a\ndifferent story.  Only Anne and Margaret notice, but to\nthem it's as clear as a bell.  They exchange a knowing\nlook.\n\nMarion and Charlotte break apart, self-consciously.\n\nMarion and Gabriel mount up and start to ride away.  As\nthey're about to round a curve and disappear, SUSAN CRIES\nOUT:\n\n\t\t\t\tSUSAN\n\t\tPapa!\n\nWith halting steps, then faster and faster, she runs down\nthe path toward Marion.\n\n\t\t\t\tSUSAN\n\t\tPapa, don't go, I'll say anything.\n\nMarion stops, turning in his saddle to see Susan running\nafter him, her eyes filled with tears.\n\n\t\t\t\tSUSAN\n\t\tPlease, Papa, I'll say anything you\n\t\twant!\n\nMarion yanks his reins, turning his horse.\n\n\t\t\t\tSUSAN\n\t\tJust tell me what to say!  Tell me\n\t\twhat to say!\n\nMarion spurs his horse straight toward her, GALLOPING\ntoward the running, crying child.\n\n\t\t\t\tSUSAN\n\t\tPlease, Papa, please don't go.\n\nMARION RIDES TOWARD HER...\n\nCharlotte, Anne and Marion's children watch as:\n\nMARION LEANS OVER IN THE SADDLE without slowing down...\n\nSWOOPING HER INTO HIS LAP...\n\nShe sits astride the saddle, facing him, her arms wrapped\naround him, pleading, the words tumbling from her, as fast\nas she can get them out...\n\n\t\t\t\tSUSAN\n\t\t... I'll talk to you, I'll say\n\t\tanything you want, just tell me what\n\t\tyou want me to say, I'll say\n\t\tanything, I promise, please, Papa,\n\t\tjust stay...\n\nMarion envelopes the sobbing wisp of a girl, holding her,\nletting her cry, fighting his own tears...\n\nHe reins back the horse, stopping in front of the\nothers...\n\nHe pleadingly looks to Charlotte who steps up to the\nhorse... to take Susan...\n\nMarion gives Susan a final embrace, and covers her face\nwith kisses...\n\n\t\t\t\tMARION\n\t\tI'll come back... I promise...\n\nMarion hands the still crying Susan down to Charlotte...\n\nMarion, in agony, averts his eyes, yanks his reins, and\nspurs his horse...\n\nAs he rides away the children take off after him, running.\n\nSusan seeing the others running after Marion, struggles\nout of Charlotte's arms, and runs after them as well...\n\nMarion rides, now joined by Gabriel, faster and faster,\nleaving a trail of dust...\n\nThe children slow, then stop, one after another, watching\nas they ride away.\n\nEXT.  PATRIOT ENCAMPMENT - ACWORTH - EVENING\n\nGrim.  The most rudimentary of the encampments we've seen.\nRain pours.  Some of Marion's men huddle under lean-to's\nand quickly rigged tents that offer only partial\nprotection from the cold rain.\n\nAbner and Scott do their best to keep a wet-wood fire\ngoing.  Rev. Oliver tries to cook.\n\nMarion and Gabriel ride up and dismount.  Marion joins\nRev. Oliver.\n\n\t\t\t\tMARION\n\t\tHow many came back?\n\n\t\t\t\tREV. OLIVER\n\t\tAbout a hundred and twenty.  Less\n\t\tthan a third.\n\nMarion nods.  He and Gabriel join some of the men under\none of the lean-to's.\n\nEXT.  RIVERSIDE - DAY\n\nThe rain has stopped.  The ground is still wet.  It's\nspring.  The first buds are on the maple trees.  A fox\ntentatively comes out of its winter den, followed by a\npair of pups.\n\nMarion stands on the side of a river, looking up at a\nchevron of Canadian geese flying north.\n\nEXT.  PEMBROKE - DAY\n\nThe Canadian Geese fly over Anne who is behind her\nfather's store, tying food and provisions to a couple of\npackhorses.  A mare and a foal cavort in a nearby paddock.\n\nSuddenly Anne senses someone behind her and turns to see\nHALF-A DOZEN REDCOATS.  She's initially frightened but the\nREDCOAT SERGEANT, speaks politely.\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tExcuse me, Ma'am, everyone has been\n\t\trequested to gather at the church.\n\n\t\t\t\tANNE\n\t\tEveryone?\n\n\t\t\t\tREDCOAT SERGEANT\n\t\tColonel Tarleton wants to address,\n\t\tthe whole village.\n\nThe Redcoat Sergeant deferentially motions for Anne to\nfollow him and his men.  She sees several other\ntownspeople, with Redcoat escorts, already heading down\nthe street.  She follows along.\n\nEXT.  PEMBROKE VILLAGE SQUARE - DAY\n\nTarleton and Wilkins, on horseback, watch as a large,\nmixed detachment of Green Dragoons and Redcoat Infantry\ndirects the villagers into the church.\n\nOne of the Redcoats walks out of the general store with a\nbowl of gumdrops.  As he starts giving them to a few of\nthe children their parents waver, unsure of the gesture,\nbut they reluctantly allow the children to take the candy.\n\nThe townspeople are uneasy but they follow the orders of\nthe Redcoats who, though carry muskets, are polite and\nunthreatening.\n\n\t\t\t\tREDCOAT\n\t\tInto the church, please.\n\n\t\t\t\tANOTHER REDCOAT\n\t\tColonel Tarleton wishes to address\n\t\tall of you.\n\nTarleton sees the last of the townspeople enter the\nchurch.  He nods to the Redcoats near the door.\n\nThe Redcoats CLOSE THE DOORS, chaining them shut.  The\nDOOR IS POUNDED ON from the inside.\n\n\t\t\t\tVOICE\n\t\tOpen this door!\n\n\t\t\t\tANOTHER VOICE\n\t\tBy what right are we made prisoners?\n\nTARLETON NODS TO GASKINS who, along with several rough-\nlooking LOYALIST MILITIAMEN, disappear into the blacksmith\nshop.  They reappear a moment later with FLAMING TORCHES\nand approach the church.\n\nSeveral Redcoats see what's about to happen and are\nappalled.  Even some of the Green Dragoons, including\nWilkins, are troubled.  Wilkins rides over to Tarleton.\n\n\t\t\t\tWILKINS\n\t\tSir?\n\n\t\t\t\tTARLETON\n\t\tYes, Major.\n\nGaskins and the Loyalist Militia stop around the church,\ntorches ready, waiting for the final go-ahead from\nTarleton.  The POUNDING AND CALLING from inside the church\ngrows louder.\n\n\t\t\t\tWILKINS\n\t\tSir, there is no honor in this.\n\n\t\t\t\tTARLETON\n\t\tThe honor is found in the end, not\n\t\tthe means.  This will be forgotten.\n\t\t\t   (to Gaskins)\n\t\tProceed.\n\nThe Redcoats turn to the Redcoat Officers.  The Redcoat\nofficers turn to Wilkins, who struggles with himself.\nTarleton calmly watches Wilkins' distress.\n\nFinally, Wilkins accepts it.  Weakly steadying his horse,\nhe takes his place next to Tarleton.\n\nThe Redcoats and Dragoons follow his lead and watch as\nGaskins and the Loyalist Militiamen light the church on\nfire, heaving their torches onto the roof, through the\nwindows and under the raised foundation.\n\nSCREAMS are heard from inside.  The DOOR THUDS with the\nshoulders of men trying to escape.  The CHAINS HOLD.\n\nAs the FLAMES RISE, another group of Loyalist Militiamen\nand some Redcoats drag half-a-dozen young women out of a\nside-street...\n\nAmong the women, desperately pleading, kicking and\nscreaming, is ANNE...\n\nThe men drag her and the other women into the livery\nstable...\n\nTarleton watches them carried off, stone-faced...\n\nThen he turns and watches the church go up in FLAMES...\n\nA WINDOW SHATTERS, with a chair heaved from inside...\n\nSOME MEN TRY TO CLIMB OUT, but waiting Redcoats FIRE THEIR\nMUSKETS POINT BLANK...\n\nKILLING THREE MEN, driving the others back...\n\nThe SCREAMS FROM INSIDE THE CHURCH grow louder...\n\nThe FLAMES AND SMOKE RISE...\n\nEXT.  WOODS - PEMBROKE OUTSKIRTS - DAY\n\nSILENCE.  A dark forest of old growth trees.  No\nunderbrush.  Marion and a couple dozen of his men,\nincluding Gabriel, Rev. Oliver, and Dalton ride warily on\na carpet of pine needles toward a thin column of smoke,\nvisible over the treetops in the distance.\n\nWith hand signals, Marion directs his men to fan out.\nThey do so, weaving through the dark forest, weapons\nready.\n\nEXT.  PEMBROKE - DAY\n\nMarion and his men slowly ride into Pembroke.  The remains\nof the church smolder only slightly.  The town is\ndeserted, no one, dead or alive, is visible.\n\nUnsure what they have found, Marion and his men spread out\nand dismount, warily checking out the buildings, looking\nfor some sign of life.\n\nRev. Oliver and a few other men head for the charred\nremains of the church.\n\nSide-stepping some still-hot, charred beams, Rev. Oliver\nlooks through the rubble...\n\nThen he sees the bodies...\n\nTHE CAMERA CATCHES ONLY A FLEETING GLIMPSE of...\n\nDozens of charred, blackened bodies, intertwined with the\nremains of the church...\n\nRev. Oliver staggers from the rubble...\n\nThe other men see what he has seen...\n\nOne-by-one Marion and his men walk over and look into the\nremains of the church...\n\nMarion see several charred hands extended through a\nshattered window, as if grasping for escape... one of the\nhands is tiny, A CHILD'S HAND...\n\nMarion is stunned...\n\nNo one says a word...\n\nDalton and a few of the other men continue the search,\nweapons ready...\n\nThey step into the livery stable, then walk out a moment\nlater, ashen faced...\n\nDalton speaks quietly to Marion, motioning toward an\nincreasingly frantic Gabriel who has just found Anne's\npackhorses...\n\nGabriel notices the gesture, he watches Marion walk into\nthe livery stable... Growing more nervous by the second,\nGabriel hurries after his father...\n\n\t\t\t\tGABRIEL\n\t\tAnne...?\n\nAs Gabriel gets to the entrance of the livery stable,\nMarion walks out and intercepts him.\n\n\t\t\t\tMARION\n\t\tDon't go in there.\n\n\t\t\t\tGABRIEL\n\t\tIs it her?  Is Anne in there?\n\n\t\t\t\tMARION\n\t\tShe is.  Don't go in there.\n\nGabriel understands... he reels... growing faint... Marion\ngrabs him... keeping him from falling...\n\nMarion holds Gabriel who begins to weep...\n\nEXT.  PEMBROKE - DAY\n\nMarion's men, led by Rev. Oliver, tend to the dead.  Some\ndig in the small graveyard adjacent to the remains of the\nchurch.  Others carry out the grim task of pulling the\ncharred bodies out of the rubble.\n\nON THE EDGE OF TOWN\n\nMarion sits alone.  Gabriel walks up behind him.\n\n\t\t\t\tGABRIEL\n\t\tFather, tell me what happened at\n\t\tFort Wilderness?\n\n\t\t\t\tMARION\n\t\tYou know what happened.\n\n\t\t\t\tGABRIEL\n\t\tNo, I don't.\n\n\t\t\t\tMARION\n\t\tEveryone knows.  It's what made me a\n\t\thero.  Me, Harry Lee, all of us.  I\n\t\tgot a medal.  Men bought me drinks.\n\t\tThey still do sometimes.  Everyone\n\t\tknows what happened.\n\n\t\t\t\tGABRIEL\n\t\tTell me what everyone doesn't know.\n\n\t\t\t\tMARION\n\t\tAnd what do they know?\n\n\t\t\t\tGABRIEL\n\t\tThat the French and Cherokees\n\t\tcaptured the fort and when you\n\t\tretook it, you took revenge on them\n\t\tfor what they did during the\n\t\toccupation.\n\n\t\t\t\tMARION\n\t\tThat's right.\n\n\t\t\t\tGABRIEL\n\t\tThat's not enough.  Tell me.\n\n\t\t\t\tMARION\n\t\tYour mother asked me the same\n\t\tquestion around the time you were\n\t\tborn.  I was drunk and I was foolish\n\t\tenough to answer her.\n\nMarion shakes his head to himself.\n\n\t\t\t\tMARION\n\t\tThat's why it was four years between\n\t\tyou and Thomas.  It took me that\n\t\tlong to regain her respect.\n\n\t\t\t\tGABRIEL\n\t\tI'm not my mother.  I can't have the\n\t\trespect without the knowing.\n\nMarion's quiet for a moment.  Then he speaks:\n\n\t\t\t\tMARION\n\t\tIt was in '63.  It was a bad time.\n\t\tThe French and the Cherokee had\n\t\traided along the Blue Ridge.  All\n\t\tthe English settlers took refuge at\n\t\tFort Wilderness but the French\n\t\tcaptured it.  We were sent in\n\t\trelief.  Harry Lee, Billings, sixty\n\t\tof us.  We already had something of\n\t\ta reputation for being... harsh.\n\t\tWhen we got there the fort was\n\t\tabandoned.  Not a French soldier or\n\t\tCherokee anywhere.  They had left a\n\t\tweek earlier.  What we found was...\n\t\tbad.\n\nMarion grows quieter with the memory of how bad.\n\n\t\t\t\tMARION\n\t\tThey had left the settlers there.\n\t\tThe men had been burned alive, the\n\t\twomen were in pieces and the\n\t\tchildren were on stakes.\n\nMarion's silent for a moment.\n\n\t\t\t\tMARION\n\t\tWe buried them, then we went to\n\t\ttrack.  It was a cold trail and they\n\t\twere moving fast.  We went faster.\n\t\tWe caught up to them at Kentucky\n\t\tFord.\n\n\t\t\t\tGABRIEL\n\t\tGo on.\n\n\t\t\t\tMARION\n\t\tWe took our time with them and gave\n\t\tevery one of them worse than they\n\t\thad given at the fort.  It was two\n\t\tweeks before they were all dead, all\n\t\texcept two.  We put the heads on a\n\t\tpallet and had the two we let live\n\t\ttake it to the French at Fort\n\t\tAmbercon.\n\t\t\t   (beat)\n\t\tThe eyes, fingers and tongues we put\n\t\tin a basket and sent that down the\n\t\tAsheulot to the Cherokee.\n\t\t\t   (beat)\n\t\tThe French stayed east of the Blue\n\t\tRidge after that and the Cherokee\n\t\tbroke their treaty with the French\n\t\tand stayed out of the fight.\n\t\t\t   (beat)\n\t\tThat seemed to make a difference.\n\t\tThe war went another year, things\n\t\twent better... and men bought us\n\t\tdrinks.\n\nGabriel is silent.  Marion looks at him closely.\n\n\t\t\t\tMARION\n\t\tIt was a different time, son.  And\n\t\tyou're a better man than that.\n\n\t\t\t\tGABRIEL\n\t\tI see, do as I say, not as I do.\n\n\t\t\t\tMARION\n\t\tYes.\n\nThey hear HORSES HOOVES.  Abner rides in from the opposite\nside of the village from the church, not having seen the\nresults of the massacre.  Excited, he dismounts.\n\n\t\t\t\tABNER\n\t\tTHEY'RE HERE!  CONTINENTALS, THEY'RE\n\t\tHERE!\n\nMarion and Gabriel just look at him.  Abner is confused by\ntheir reaction.  Then he sees the remains of the church\nand the laid out, charred bodies.\n\nEXT.  PATRIOT ENCAMPMENT - NIGHT\n\nMixed gatherings of Marion's militia and Continentals are\nclustered around the campfires, with more Continentals\narriving all the time.\n\nSome of the militiamen and regulars regale each other with\ntales of their exploits but most are grim and tired,\ntalking quietly.\n\nA couple of Patriots play a MELANCHOLY TUNE ON FIFE AND\nVIOLIN.\n\nMarion's tent is set up but he's nowhere to be seen.\nGabriel walks to Marion's gear.  Finding Marion's weapon's\nbelt he opens one of the bullet pouches and finds the\npaint-flecked MUSKET BALLS MADE FROM THOMAS' LEAD\nSOLDIERS.  As Gabriel takes one, Marion steps up behind\nhim.\n\n\t\t\t\tMARION\n\t\tIf this war is about more than\n\t\tThomas, it's about more than Anne,\n\t\tas well.  Stay the course.\n\n\t\t\t\tGABRIEL\n\t\tAs you did at Fort Wilderness?\n\nBefore Marion can answer they see HARRY LEE RIDE UP TO\nTHEM.  He dismounts, excited, voluble.  He strides over,\npleased to see Marion, oblivious to his and Gabriel's\nmood.\n\n\t\t\t\tLEE\n\t\tLook at you!  I knew you could do\n\t\tit!\n\nLee laughs, picks up a bottle and takes a big pull.\n\n\t\t\t\tLEE\n\t\tWe have a chance!  Better than a\n\t\tchance!  Cornwallis is running to\n\t\tthe Chesapeake, probably to meet his\n\t\tfleet at Yorktown.  I wish I could\n\t\tsee his face when he sees a dozen\n\t\tFrench ships floating there.  And\n\t\tWashington should be a day or two\n\t\tbehind him.\n\t\t\t   (beat)\n\t\tAnd on top of everything, I have a\n\t\tson!  Born last month in Alexandria.\n\nGabriel rises and walks away.  Lee finally tunes into the\npall hanging over Marion and the just departed Gabriel.\nHe turns to Marion.\n\n\t\t\t\tMARION\n\t\tHis wife was killed yesterday.  She\n\t\twas with child.\n\n\t\t\t\tLEE\n\t\tI'm sorry, I didn't know.\n\nMarion nods.  They stand in silence.  Lee hands Marion the\nbottle.  He takes a drink.\n\nEXT.  ENCAMPMENT - NIGHT\n\nDark.  Quiet.  Sentries are on duty.  Marion's tent glows\nfrom a single candle.  He blows the candle out, then steps\nout of the tent into the night.\n\nHe begins his nightly walk of the perimeter.\n\nAlmost immediately, Marion notices something amiss.\nDalton has discovered it at the same time and hurries over\nto Marion.\n\nAT ONE OF THE CAMPSITES\n\nMarion and Dalton and several of the other men look down\nat some empty bedrolls.\n\n\t\t\t\tDALTON\n\t\tGabriel and at least a dozen others.\n\t\tThey must have left right after the\n\t\twatch change.\n\n\t\t\t\tMARION\n\t\tThat means they have two hours on\n\t\tus.\n\nMarion strides to his horse.  The other men follow him.\n\nEXT.  WOODED ROAD - NIGHT\n\nMarion, Dalton and Rev. Oliver and two dozen other men\nride.\n\nEXT.  WOODED ROAD - NIGHT\n\nDark.  Very quiet.  A moonless night.  Marion and his men,\non foot, make their way along the side of the river.\nBrother Joseph hurries out of the darkness and speaks to\nMarion.\n\n\t\t\t\tBROTHER JOSEPH\n\t\tFifty Green Dragoons, camped about a\n\t\tquarter mile from here.  Sentries at\n\t\tfour points.\n\nSuddenly they hear the SOUNDS OF MUSKETS FIRE ahead of\nthem in the darkness.  Marion takes off at a full run with\nhis men right behind.\n\nEXT.  OUTSKIRTS OF GREEN DRAGOON ENCAMPMENT - NIGHT\n\nMarion and his men BLAST THROUGH THE BRUSH.  Running\ntoward the SOUNDS OF THE BATTLE, which grows louder with\nevery step...\n\nMarion cocks his pistol and extracts his tomahawk on the\nrun...\n\nThe LIGHTS OF THE BATTLE:  The STROBES OF THE MUSKET SHOTS\nilluminate the woods ahead of them...\n\nMoving fast, they PASS TWO DEAD BRITISH SENTRIES, without\nslowing down...\n\nTHEY BLAST OUT OF THE WOODS into...\n\nTHE CLEARING, seeing a tableau of TOTAL CHAOS:\n\nHalf-dressed GREEN DRAGOONS in formation FIRE IN\nVOLLEYS...\n\nRunning men.  Scattered MUSKET FIRE.\n\nThe strobes of the muskets illuminate RUNNING MEN and\nother men in HAND-TO-HAND COMBAT.\n\nWILKINS IS IN COMMAND.  Tarleton is nowhere to be seen.\n\nGabriel and Abner, both slightly wounded, fight a\ndesperate holding action...\n\nOn the other side of the clearing, a square of Dragoons\nforms near Wilkins.\n\n\t\t\t\tWILKINS\n\t\tFIRE!\n\nThe DRAGOONS FIRE A MASSED VOLLEY, hitting Gabriel, Abner\nand several other Patriots.\n\nGABRIEL, BADLY WOUNDED, falls to his knees...\n\nThe Dragoons pull their pistols about to fire again.\n\nMarion and his men OPEN FIRE...\n\nStaggering them...\n\nMarion sees Wilkins about to fire at Gabriel...\n\nMarion runs...\n\nSees another Redcoat about to fire at Gabriel...\n\nMARION KILLS HIM with a pistol shot.\n\nWilkins cocks his flintlock pistol, aims at Gabriel...\n\nMARION'S ABOUT TO THROW HIS TOMAHAWK... TOO LATE...\n\nWILKINS FIRES... HITTING GABRIEL WHO FLIES BACKWARD...\n\nMarion THROWS THE TOMAHAWK, sinking it into Wilkins'\nchest...\n\nThe rest of Marion's men thunder into the Dragoons...\n\nOverpowering them...\n\nMarion races to Gabriel...\n\nThrows himself onto the ground next to him...\n\nCradling him...\n\nGabriel is stunned, confused by the wounds.\n\n\t\t\t\tGABRIEL\n\t\tI'm alright, I...\n\nHe tries to stand...\n\n\t\t\t\tMARION\n\t\tLet me help you...\n\nGabriel weakens in Marion's arms... falters... Marion\nwatches the life drain from Gabriel... He tries to hold\nthe blood in, to no avail...\n\nDalton plants himself next to Marion, defending him and\nGabriel...\n\nMarion caresses Gabriel and watches as...\n\nGABRIEL DIES.\n\nThe life drains from Marion.  No anger.  Only pain.  He\nlooks at Gabriel, lost in a dream, an incomprehensible\nnightmare of loss and overwhelming emptiness.\n\nEXT.  CLEARING - DAWN\n\nMarion's men finish laying out the bodies of their dead.\nThe Dragoons are still where they fell.  The Patriots are\nlaid out in a row, their faces covered by their coats.\n\nMarion sits on the battlefield, next to Gabriel's body.\nDalton gingerly approaches him.\n\n\t\t\t\tDALTON\n\t\tColonel...\n\nMarion slowly stands and picks up Gabriel's body, cradling\nhim like a child.  They head off into the brush.\n\nEXT.  PATRIOT ENCAMPMENT - NIGHT\n\nMore Continentals have arrived, now outnumbering Marion's\nmen three-to-one.  The encampment is active.  A few of the\nmen drink and TALK LOUDLY.  The two men playing the fife\nand violin PLAY A MORE VIBRANT TUNE.\n\nINT.  MARION'S TENT - NIGHT\n\nDark.  Shadowed.  The sounds of celebration can be heard\noutside the tent.\n\nMarion sits on his camp chair.  Gabriel lies on the ground\ncarefully covered up to his chin with a blanket.  A single\ncandle burns.\n\nRev. Oliver enters the tent.\n\n\t\t\t\tREV. OLIVER\n\t\tMay I help you try to find solace\n\t\twith the word of God?\n\nNo response.\n\n\t\t\t\tREV. OLIVER\n\t\tColonel, let us help his soul find\n\t\tit's place with the Almighty and...\n\n\t\t\t\tMARION\n\t\tHe looks as if he's sleeping,\n\t\tdoesn't he?\n\n\t\t\t\tREV. OLIVER\n\t\tYes, he does.\n\nRev. Oliver pulls up a camp stool.  He and Marion sit in\nsilence.\n\nEXT.  MARION'S ENCAMPMENT - MORNING\n\nThe Patriots, Continentals and Militia, are moving out.\nMost of the tents have been taken down.  Wagons are\nrolling out.  Companies of Continentals march off in good\norder.\n\nMARION'S TENT still stands.  His men finish packing up,\nstoring their heavy gear in wagons, tying their field gear\nonto their horses.\n\nIN THE TENT\n\nMarion still sits.  A FLY BUZZES.  Gabriel's face has\ntaken on a deathly, ashen look.\n\nLee enters the tent.  He's silent for a moment, then\nspeaks softly to Marion.\n\n\t\t\t\tLEE\n\t\tYou have to bury him.\n\nNo response.\n\n\t\t\t\tLEE\n\t\tI'll help you bury him.\n\nLee moves toward Gabriel's body.\n\n\t\t\t\tMARION\n\t\tDon't touch him.\n\n\t\t\t\tLEE\n\t\tHow many men have we seen die?\n\n\t\t\t\tMARION\n\t\tTwo.  Gabriel and Thomas.\n\n\t\t\t\tLEE\n\t\tThey're gone.  And there is nothing\n\t\tyou or I can do to bring them back.\n\t\tBut there is something you can do to\n\t\thelp end all this.\n\n\t\t\t\tMARION\n\t\tIt is ended.\n\n\t\t\t\tLEE\n\t\tNo.  It's not over yet.  Two days\n\t\tride, Yorktown, Virginia.\n\t\tWashington, the French, Cornwallis\n\t\tand Tarleton.  It will end, one way\n\t\tor another.\n\t\t\t   (beat)\n\t\tFrancis, nothing will replace your\n\t\tsons but helping us will justify\n\t\ttheir sacrifice.\n\nMarion doesn't respond.  Lee waits for a long moment, then\nhe hears the SOUND OF THE DEPARTING TROOPS OUTSIDE THE\nTENT.\n\nHe looks at Marion, touches him on the shoulder and walks\nout.\n\nEXT.  PATRIOT ENCAMPMENT - DAY\n\nThe last of the soldiers move out, leaving their\nsmoldering campfires and refuse.  The only tent that\nremains is Marion's.\n\nEXT.  MARION'S TENT - DAY\n\nMarion sits in his tent, gazing obliquely at Gabriel's\nbody which has grown even more ashen.  A SOLITARY BIRD\nCRIES in the distance.\n\nEXT.  WOODED ENCAMPMENT - NIGHT\n\nA dark, moonless night.  The sky is filled with stars.  A\nSOFT WIND BLOWS dead leaves along the ground.  A few of\nthe leaves are blown through the opening of Marion's tent.\n\nINSIDE THE TENT\n\nMarion looks down, noticing the leaves, HEARING THE WIND.\nHe listens for a moment.  Then he stands and walks out of\nthe tent.\n\nOUTSIDE THE TENT\n\nMarion watches the leaves skittering along the ground.  He\nlistens to the wind.\n\nThe HE LOOKS UP AT THE NIGHT SKY.  The stars are bright.\nHis eyes are drawn to the Big Dipper and from there to the\nLittle Dipper and the...\n\nNORTH STAR.\n\nHolding his eyes on the faint, but steady star, he\ngradually reorients himself.  He looks around at the\nabandoned encampment.  Then he looks into the tent and\nsees Gabriel's body.  The SOFT WIND BLOWS AROUND HIM.\nMarion nods in response.\n\nEXT.  BURIAL GROUND - WOODED ENCAMPMENT - MORNING\n\nMarion finishes burying Gabriel, putting the last\nshovelfuls of dirt on the freshly turned earth.  He stands\nnext to the grave, looking down, and says a silent prayer.\n\nEXT.  YORKTOWN ROAD - DAY\n\nThe AMERICAN FORCES are on the move, all heading in the\nsame direction.  Continentals and militiamen fill the\nroad.  Some on horseback, others in wagons, most on foot.\n\nAmong them, a mixed unit of Continentals and Marion's\nbrigade, at the head of which ride Lee, Dalton, Abner and\nRev. Oliver.\n\nBehind them, a single horseman rides up.  It's MARION.\nWithout speaking, Marion rides up alongside Lee.  They\nexchange nods.\n\nMarion rides between Dalton on one side and Rev. Oliver on\nthe other.  They pass a sign that reads, \"Yorktown.  20\nmiles.\"\n\nEXT.  YORKTOWN OVERLOOK - DAY\n\nThe road to Yorktown skirts an OVERLOOK with a view of the\ntown and the harbor.  A few dozen arriving Patriots have\nstopped to look out at the view.  Marion, Lee, Rev. Oliver\nand Dalton join them.\n\nThe French Fleet is visible in the harbor.  The British\nencampments are on a pair of peninsulas, one jutting out\nfrom land, the other jutting toward the land from a large\nisland.  In a semi-circle around the landward peninsula,\nthe beginnings of the Patriot encirclement are visible.\nIt's a grand and impressive sight.\n\nMarion and the others turn their horses and head down the\nroad toward the American lines.\n\nEXT.  YORKTOWN ENCAMPMENT - DAY\n\nAN INTERMITTENT EXCHANGE OF CANNON FIRE.  Not a battle,\nbut pre-battle pot shots.  Behind the American\nembattlements, hundreds of American and French soldiers\ndrill, make camp and build secondary fortifications.\n\nMARION, stands behind a barricade, trying to get a view of\nthe British defenses.  A RUNNER, a boy about fifteen,\ndashes up to Marion.\n\n\t\t\t\tRUNNER\n\t\tYou called for me, sir?\n\nMarion reaches into his pocket and pulls out a single\nWALNUT which he hands to the boy.\n\n\t\t\t\tMARION\n\t\tTake this to General Washington.\n\nThe boy looks at the walnut and then looks at Marion as if\nhe's joking or crazy.  He's neither.  The boy shrugs and\nruns off with the walnut.\n\nEXT.  WASHINGTON'S HEADQUARTERS - YORKTOWN\n\nStaff officers.  Flags.  Tents.  French and American\nofficers look over maps and sort out dispatches.\nMessengers, runners and dispatch riders come and go\nhurriedly.\n\nThe flap of the central HQ tent opens and GEORGE\nWASHINGTON steps out, followed by a pair of AIDES.\nWashington is tall and powerfully-built, an imposing man,\nworthy of respect.\n\nHe looks around and sees the awe-struck, slightly confused\nmessenger boy, waiting nearby.\n\nWashington, holding the walnut in his hand, motions him\nover.\n\n\t\t\t\tWASHINGTON\n\t\tDid you bring me this?\n\n\t\t\t\tRUNNER\n\t\tYes, sir.\n\nWashington scribbles something on a piece of paper and\nhands it to the boy.\n\n\t\t\t\tWASHINGTON\n\t\tTake this to Colonel Marion.\n\n\t\t\t\tRUNNER\n\t\tYes, sir.\n\nThe boy runs off.  Washington smiles.\n\nEXT.  PATRIOT ENCAMPMENT - DAY\n\nCAMERA FOLLOWS Marion walking through the chaos of the\nencampment.  He walks to the cluster of tents around\nWashington's HQ.  He nods to the officer in charge.\n\n\t\t\t\tMARION\n\t\tColonel Francis Marion.\n\nWashington, leaning over the maps on his campaign table,\nhears the voice and turns around.  The officers nearby\nstop and watch, curious.\n\nMARION AND WASHINGTON\n\nStep up to one another, looking each other in the eye.\n\nTo the astonishment of Washington's officers, Marion\nreaches up and lifts off Washington's wig, looking at his\nhair underneath.  Marion shakes his head.\n\n\t\t\t\tMARION\n\t\tGray.\n\n\t\t\t\tWASHINGTON\n\t\tEarned.\n\nWashington holds out a small bag to Marion who reaches in\nand pulls out a walnut.\n\n\t\t\t\tWASHINGTON\n\t\tCome.  I have something I want to\n\t\tshow you.\n\nWashington turns to his staff officers.\n\n\t\t\t\tWASHINGTON\n\t\tGentlemen.\n\nWashington and Marion walk off with Washington's officers\nand aides.As Washington and Marion walk, they both CRUSH\nTHE WALNUTS SHELLS BETWEEN THEIR THUMBS AND FOREFINGERS, a\nprodigious display of strength that both men take for\ngranted.  They eat walnuts as they walk.\n\nEXT.  YORKTOWN HILLTOP - DAY\n\nWashington's officers who include HARRY LEE, COLONEL\nALEXANDER HAMILTON, LAFAYETTE, GENERAL PINKNEY, and\nvarious other aides and junior officers reach the crest of\nthe hill and wait for Washington and Marion who trail a\nbit behind them, talking privately, eating walnuts as they\ngo.\n\nWhile they wait, the officers look out at the view, seeing\nthe PUFFS OF SMOKE OF INTERMITTENT CANNON FIRE.\n\nWASHINGTON AND MARION\n\nFinish the walnuts.  They stop for a moment to catch their\nbreath.\n\n\t\t\t\tWASHINGTON\n\t\tI was sorry to hear about your son.\n\n\t\t\t\tMARION\n\t\tI lost another a year ago, Thomas.\n\t\tHe was only fifteen.\n\n\t\t\t\tWASHINGTON\n\t\tI've had no sons to lose, nor\n\t\tdaughters.\n\t\t\t   (beat)\n\t\tI lose the sons of other men.\n\nThey look out at the vista, knowing that they're looking\nat the sons of thousands and thousands of other men.\n\n\t\t\t\tWASHINGTON\n\t\tLife was easier when we only had\n\t\tourselves to get killed.\n\nThey walk on, joining the others on the crest of the hill.\nThe officers are looking out, some with spyglasses, at\nthe British emplacements.\n\n\t\t\t\tWASHINGTON\n\t\tGentlemen, what do we see?\n\n\t\t\t\tHAMILTON\n\t\tMortars, center, with two lines of\n\t\tenfilading trenches.\n\n\t\t\t\tPINKNEY\n\t\tMore along the right flank and\n\t\tbehind the forward redoubts.\n\n\t\t\t\tLAFAYETTE\n\t\tA formidable defensive position.\n\t\tVery formidable.\n\n\t\t\t\tHAMILTON\n\t\tThey could hold out for weeks.\n\nWashington nods and turns to Marion.\n\n\t\t\t\tWASHINGTON\n\t\tFrancis, tell me about General\n\t\tCornwallis.\n\n\t\t\t\tMARION\n\t\tRemember Braddock?\n\n\t\t\t\tWASHINGTON\n\t\tThat bad?\n\n\t\t\t\tMARION\n\t\tWorse.\n\n\t\t\t\tWASHINGTON\n\t\tProud, priggish and competent.  A\n\t\tvery bad combination in an\n\t\tadversary.\n\nWashington sighs.\n\n\t\t\t\tWASHINGTON\n\t\tFor those of you who don't know, we\n\t\tintercepted a British dispatch this\n\t\tmorning.  General Clinton has sailed\n\t\tfrom New York to relieve Cornwallis.\n\nThat hits Washington's officers hard.\n\n\t\t\t\tHAMILTON\n\t\tHow long before they arrive?\n\n\t\t\t\tWASHINGTON\n\t\tLess than a week.  Sixteen ships and\n\t\tover nine thousand Redcoats.\n\n\t\t\t\tLAFAYETTE\n\t\tSooner or later that message will\n\t\tget through to Cornwallis.\n\n\t\t\t\tPINKNEY\n\t\tAnd when it does, he'll just wait us\n\t\tout.\n\n\t\t\t\tWASHINGTON\n\t\tAnd when the British ships arrive,\n\t\tthe French ships will flee.  And\n\t\twhen the French ships flee, General\n\t\tRochambeau and the French troops\n\t\twill flee as well.\n\nMarion speaks up.\n\n\t\t\t\tMARION\n\t\tThen you must let the message go\n\t\tthrough.\n\nThey all turn to Marion, most of them looking at him as if\nhe's insane.\n\n\t\t\t\tWASHINGTON\n\t\tIf Cornwallis receives news that\n\t\tClinton is coming, he'll simply hold\n\t\ttight and wait.  He'll fight a\n\t\tpurely defensive battle and he'll\n\t\twin that.\n\n\t\t\t\tMARION\n\t\tNo, he won't.  There are two things\n\t\tyou need to know about Cornwallis.\n\t\tFirst, he is a very proud man, He\n\t\twould rather risk defeat than share\n\t\ta victory.\n\t\t\t   (beat)\n\t\tIf you give him what he thinks is an\n\t\tout, he'll take it.\n\n\t\t\t\tWASHINGTON\n\t\tAnd what is the second thing?\n\nMarion pulls Cornwallis' journal out of his haversack and\nleafs through it.\n\n\t\t\t\tMARION\n\t\tI'll let him tell you himself...\n\t\t\t   (reading)\n\t\t\"... but it is this colonial militia\n\t\tthat is the most irksome.  Not\n\t\tworthy of my attention, but\n\t\tdemanding it; not worthy of British\n\t\tblood, but taking it; and not worthy\n\t\tof a soldier's honor, but sullying\n\t\tit.  Those nights of mine that are\n\t\tnot sleepless, are filled with\n\t\tdreams of a cavalry charge on the\n\t\theels of fleeing farmers...\"\n\nMarion closes the journal.\n\n\t\t\t\tMARION\n\t\tHe has no respect for citizen\n\t\tsoldiers.  That's your bait...\n\t\tmilitia.\n\nWashington nods, considering it.\n\nEXT.  CORNWALLIS' HEADQUARTERS - YORKTOWN - EVENING\n\nUnder fire.  Cornwallis and his staff.  Major Halbert\nstrides in and gives Cornwallis a dispatch.\n\n\t\t\t\tMAJOR HALBERT\n\t\tSir, a dispatch from General Clinton\n\t\tmade it through the rebel lines.\n\nCornwallis takes the dispatch and reads it.  It staggers\nhim.  He sits down.\n\n\t\t\t\tWILKINS\n\t\tSir?\n\nCornwallis fumes.  His jaw sets with anger.  He slowly\ncrumples the dispatch and speaks with quiet fury.\n\n\t\t\t\tCORNWALLIS\n\t\tCall a general staff meeting.\n\n\t\t\t\tAIDE\n\t\tYes, sir.\n\nEXT.  YORKTOWN - PRE-DAWN\n\nMarion stands at the American battlements, looking out at\nthe British defensive works.  Above him, stars are\nvisible, but they're fading in the light of the pre-dawn\nglow from the horizon.\n\nMarion scans the disappearing stars, searching out the\nNORTH STAR, but in the increasingly harsh light of this\nday, he can't find it.  He turns his eyes back to the\nbattlefield.\n\nEXT.  YORKTOWN BATTLEFIELD - DAY\n\nThe sun has risen but a heavy ground fog limits visibility\nto a few dozen yards.  Men move like ghosts.\n\nTHE CAMERA finds waiting squadrons of men but in the mist.\nThere is no overview, just separate detachments:\n\nAn orderly regiment of CONTINENTAL CAVALRY, mounted,\nwaiting, steadying their horses.\n\nTwo long lines of CONTINENTAL INFANTRY RESERVES...\n\nAn American Command, including Washington, LaFayette and\ntwo dozen staff officers, attended by riders and\nrunners...\n\nAnd, finally, MARION AND HIS MEN, who stand in the middle\nof a long line of Patriot militia in the center of a long,\nvalley-line depression.\n\nThey stand silently, unable to see anything other than\neach other and the gently slope of the dew-covered grass\nin front of them.\n\nThey're all grim.  They know what's coming.\n\nThen, the SOUND OF A SINGLE DRUM, heard but unseen, coming\nfrom over the slope...\n\nThen, MORE DRUMS, more and more, A COMPETITION OF DRUM\nBEATS...\n\nMarion's men listen, turning their heads, trying to\nimagine what is happening on the other side of the rise in\nfront of them.\n\nMARION MOTIONS FOR HIS OFFICERS, Dalton, Scott, Rev.\nOliver and several other Patriot militia officers from\nother units.  They quickly gather around.   \n\n\t\t\t\tMARION\n\t\tThe British army believes in\n\t\tofficers.  I believe in soldiers.\n\t\tAfter we engage, there will be no\n\t\tmore orders.  Every man here must\n\t\tknow what I'm about to tell you.\n\nThey listen closely.\n\n\t\t\t\tMARION\n\t\tWe are the bait in a trap.  We're\n\t\tmilitia.  Cornwallis thinks we're\n\t\trabble, nothing more than a bunch of\n\t\tundisciplined farmers.  And if he\n\t\tthinks that's what we are, that's\n\t\twhat we're going to give him.\n\t\tListen up.\n\nThey gather around closer.\n\nEXT.  BRITISH LINES - DAY\n\nCornwallis, surrounded by his staff officers, including\nTarleton, stands on a low hill, trying, with the aid of a\nspyglass to catch the first view of the battlefield as the\nmorning mist begins to burn off.\n\nThrough the fog, he just makes out the American lines.  He\nturns to Tarleton who also peers through a spyglass.\n\n\t\t\t\tCORNWALLIS\n\t\tDo you see that, Colonel?\n\n\t\t\t\tTARLETON\n\t\tUnless I'm dreaming, I think I see\n\t\tirregulars at their center.\n\nCornwallis and Tarleton exchange a pleased look.\n\nEXT.  LOW MEADOW - YORKTOWN - MORNING\n\nMarion and his men wait.\n\nA STRANGE SOUND.  Soft, muted.  The men turn their heads,\nlistening, their eyes shifting.\n\nThey hear the SOUND OF THOUSANDS OF BOOTS ON WET GRASS,\nadvancing...\n\nTHE CAMERA WATCHES THE FACES OF MARION AND HIS MEN as they\nlisten to an unseen army approaching.\n\nON MARION'S FACE we see him hearing every sound and we see\nFLASH CUTS of what he knows he's hearing:\n\nThe BOOTS OF THE UNSEEN SOLDIERS...\n\nShouldered muskets CLICKING against pack buckles...\n\nSILENCE at a stop...\n\nMORE DRUMS...\n\nThe men around Marion wait.\n\nTHEN, THEY SEE IT...\n\nA MASSIVE WALL OF RED appears over the rise in front of\nthem...\n\nThousands of Redcoats, in perfect formation, marching in\nlockstep, straight for them.\n\nMarion sees the fear on his men's faces, but none of them\nmove...\n\nThe BRITISH DRUMS GROW LOUDER AND LOUDER... it's almost\nenough to drive a man to flight... almost.\n\nThe CAMERA explores the faces of Marion's men, faces that\nwe know, Rev. Oliver, Scott, Abner, Marion.  All are\nfrightened but all are motionless.\n\nCloser and closer, the British line approaches...\n\nThe American's don't move...\n\nThen, the BRITISH LINE STOPS...\n\nAt a flurry of commands, the Redcoats ready their muskets,\nthen aim...\n\nStill, Marion and the Americans don't move...\n\nDEAD SILENCE...\n\nThen, a single, thin voice calls out from the British\nlines...\n\nIN A THUNDEROUS, MASSIVE VOLLEY, three thousand British\nmuskets fire simultaneously... just as the entire line of\nAMERICAN MILITIAMEN DIVE TO THE GROUND...\n\nMany Americans are saved by the move but many, many others\nare torn apart by the British musketballs...\n\nTHE AMOUNT OF SMOKE IS INCREDIBLE... it obscures\neverything.  Each musket spits out a billow of think white\nsmoke a dozen feet in front of it and three thousand of\nthem just fired.  The massive, opaque white cloud quickly\nspreads over the entire battlefield.\n\nThe astonished Redcoats instantly reload...\n\nAnd watch as the Americans rise in DISORDERLY PANIC and\nFLEE...\n\nSome Redcoats laugh...\n\nON A RISE BEHIND THE BATTLEFIELD, CORNWALLIS, watches\nthrough his spyglass, trying to get a sense of what's\nhappening before the spreading cloud of musket smoke\nobscures everything.\n\nHe barks to his SIGNALMAN...\n\n\t\t\t\tCORNWALLIS\n\t\tFix bayonets... dispatch the Green\n\t\tDragoons.\n\nThe Signalman raises his semaphore flags and snaps the\nmessage.\n\nMARION AND HIS MEN are caught in the middle of the chaotic\nretreat...\n\nTHE BRITISH LINE advances at a quickstep, bayonets\nfixed...\n\nFrom behind them, THE GREEN DRAGOONS appear, at a full\ngallop, Tarleton at their head...\n\nTHE BATTLEFIELD\n\nIt's an astonishing sight... total madness... hell... a\npainting by Hieronymous Bosch...   \n\nThe mass of the British infantry charges after the fleeing\nPatriot militiamen...\n\nThe Redcoat infantry grows disorderly as it runs...\n\nTARLETON AND THE BRITISH CAVALRY THUNDERS to the head of\nthe Redcoats, closing in on the fleeing Patriots.  The\ncavalry swords are drawn and raised for a slaughter...\n\nTHEN SUDDENLY\n\nStepping into view from behind a low, grass covered rise,\na SOLID LINE OF BLUE APPEARS, rock solid...\n\nIt open up, allowing the fleeing Patriots to pass through\nit like water...\n\nthen it closes again, becoming a solid blue wall...\n\nMARION, HIS MEN AND THE ENTIRE MASS OF FLEEING MILITIA\nSTOPS DEAD, turns and joins the blue American line...\n\nA flurry of orders, then the BLUE WALL ERUPTS WITH A\nVOLLEY of musket fire that stops the disorderly British\nadvance in its tracks...\n\nHundreds of Redcoats fall instantly...\n\nHundreds of Green Dragoons and their horses fall with\nthem...\n\nThe effect of the volley is devastating...'\n\nThe American timing is perfect...\n\nAgain, the amount of SMOKE is astonishing... visibility\ndrops to less than twenty feet in most places...\n\nDrifting smoke opens up glimpses of the battle here and\nthere but it is primarily a battle of sound...\n\nMen simply follow the men in front of them...\n\nThe Blue Continentals advance in an orderly manner from\nboth flanks onto the Redcoats, trapping them...\n\nThe Redcoats try to flee...\n\nFighting small, gathered holding actions...\n\nMARION FIRES one of his pistols...\n\nDraws his sword...\n\nSlashes downward... killing one Redcoat after another...\n\nNo remorse, no hesitation, no pity...\n\nA relentless, simple battle...\n\nSlashing through the Redcoat infantry...\n\nHis sword sinks into the stock of an upraised British\nmusket and is pulled from his hands...\n\nMarion quickly kills the Redcoat with his pistol...\n\nTHEN, THROUGH THE SMOKE, MARION CATCHES A GLIMPSE OF\nTARLETON...\n\nMarion freezes... his eyes locked on Tarleton who is\nfighting a pitched battle, making his way toward the\nperimeter of the field, trying to escape back to the\nBritish lines...\n\nSeeing nothing but Tarleton, Marion hurriedly tears open\nhis weapons pouch and pulls out one of the bullets made\nfrom Thomas' lead soldiers...\n\nAs he loads the pistol, his eyes still trained on\nTarleton, Dalton runs up in the chaos...\n\n\t\t\t\tDALTON\n\t\tCOLONEL!  OUR LINE!\n\nMarion finishes reloading... distracted he turns to Dalton\nfor an instant...\n\n\t\t\t\tDALTON\n\t\tOUR LINE IS FALTERING...\n\nMarion takes a quick glance at the Continental line,\nseeing...\n\nScott, Rev. Oliver, Abner and a dozen more of his men, in\nthe middle of a confused battle, with a larger mass of\nRedcoats who are advancing through the broken Continental\nline...\n\nMARION IS TORN...\n\nHe looks to Tarleton, seeing him distracted, vulnerable\nbut too distant a target for the pistol...\n\nThen Marion looks to Rev. Oliver and the others... Dalton\ncan't wait... he runs off...\n\nMarion wavers...\n\nThen he takes a last look at Tarleton and heads off to\nhelp the faltering Patriots...\n\nTARLETON sees the movement of Marion and his men and sees\nMarion himself, his back exposed...\n\nAT THE PATRIOT LINE...\n\nMarion, Dalton and two dozen other militia cavalrymen\narrive at the same time, beating back the Redcoats...\n\nAs blue-uniformed Continentals reform the line, FIRING AT\nTHE FALTERING REDCOATS...\n\nTARLETON sees Marion and fights his way toward him...\n\nMarion is oblivious, concentrating on holding the American\nline...\n\nTarleton mounts a terrified, riderless horses, draws his\nsword and gallops back toward the British lines, on a path\nthat takes him directly past Marion...\n\nTarleton gets closer... raises his sword... slashes...\n\nMarion catches the flash of the blade out of the corner of\nhis eye...\n\nDiverts the blow, knocking Tarleton from the mount...\n\nTarleton hits the ground... Marion draws his pistol, about\nto fire at Tarleton...\n\nTarleton KICKS OUT, knocking the pistol from Marion's\nhand...\n\nTarleton GRABS HIS SWORD, SLASHES AT MARION who dodges the\nblow...\n\nTarleton advances... Marion scrambles back, then rises...\n\nMarion grabs a BROKEN CAVALRY LANCE and FENDS OFF REPEATED\nBLOWS from Tarleton's SWORD...\n\nThen Marion sees his pistol, loaded with a bullet from\nThomas' lead soldiers, lying on the ground...\n\nMarion makes his way toward the weapon... still BLOCKING\nBLOWS from Tarleton's sword...\n\nMarion focuses on the pistol... leaving himself exposed...\n\nTarleton sees the OPENING... MOVES ON MARION... TARLETON\nRAISES HIS SWORD, about to deliver the killing blow...\n\nMarion dives... GRABS HIS PISTOL... FIRES... KILLING\nTARLETON WITH A SHOT TO THE CHEST...\n\nMarion, stunned, exhausted and surprised to be alive,\nwatches Tarleton fall...\n\nMarion stands over Tarleton's body and gives himself a\nmoment of bitter triumph, then he turns back to the battle\nat hand...\n\nMarion picks up Tarleton's sword and runs to the AMERICAN\nLINE which stiffens as Dalton and Rev. Oliver are joined\nby Marion and a dozen other Patriots...\n\nThe blue-uniformed Continentals reform their line...\n\nMarion looks back toward Tarleton but finds that his body,\nalong with the place and the moment of his death, has\ndisappeared into the smoke of the battle...\n\nMarion and his men fight on... then, Redcoats start\nfleeing the field...\n\nFirst one Redcoat at a time... then more and more...\n\nEXT.  YORKTOWN - DAWN\n\nThe next day.  Silence.  The battlefield, as far as the\neye can see, is covered with the debris of war, dead men\nand scattered weapons.\n\nThe British have retreated back behind their defenses but\nhave left many of their men on the field.\n\nThe Patriots, regulars and militia, wait behind their\nbarricades.\n\nThen, a single figure appears on one of the British\nparapets.  A DRUMMER BOY, no more than ten-years-old.\nBehind him, a single British officer.\n\nThey boy begins to beat the drum.  The officer raises a\nwhite flag.\n\nIn the American lines, the men see the flag.  Some call\nout, some cheer, some laugh, most, among them MARION,\nsimply take a deep breath.  It's finally over.\n\nEXT.  YORKTOWN FIELD - DAY\n\nA massive ceremony, carefully orchestrated, laid out on\nthe cleaned up battlefield.\n\nThousands of men, everyone in his place, as if well-\ndirected actors in a grand theatrical performance.\n\nThe French and American armies, fifteen thousand men\nbetween them, stand in perfect formation on either side of\nthe field, forming an avenue for the British army which\nmarches out of it's fortification.\n\nAt the head of the avenue, WASHINGTON AND HIS STAFF stand\nwaiting.\n\nA musical band of Continentals, thirty men strong, loudly\nplays a tune, \"The World Turned Upside Down,\" a jaunty\nBritish air with a melancholy undercurrent.\n\nCORNWALLIS marches with his officers, eyes straight ahead,\ncovering his agony as best he can.\n\nAs he walks along the avenue he passes the remnants of the\nSouth Carolina militia.\n\nMARION, standing with Dalton, Rev. Oliver, Abner, Scott\nand the rest of his surviving men sees Cornwallis pass...\n\nCORNWALLIS glances over, noting what unit they are by a\ntattered battle standard that flies over them.  It's only\na glance and he DOESN'T PICK OUT MARION, who is just one\nman among the many...\n\nAT THE HEAD OF THE AVENUE\n\nCornwallis reaches Washington.  They exchange unheard\nformal greetings.\n\nCornwallis, DRAWS HIS SWORD AND HANDS IT TO WASHINGTON...\n\nFIFTEEN THOUSAND MEN, American and French, RAISE THEIR\nVOICES in a CHEER OF ASTONISHING VOLUME...\n\nWith every other pair of eyes directed toward the ceremony\nbetween Washington and Cornwallis, MARION quietly and\nunnoticed, slips out the back of the formation and walks\naway.\n\nEXT.  YORKTOWN - DAY\n\nThe surrender ceremony continues.  Marion, on the fringe\nof the field, finishes saddling his horses and prepares to\nleave.  LEE walks out of the crowd and joins him.  They\nlock eyes for a moment, then Marion mounts up.\n\n\t\t\t\tLEE\n\t\tGoodbye, Francis.\n\n\t\t\t\tMARION\n\t\tGoodbye, Harry.\n\nMarion reaches down.  They shake hands.\n\n\t\t\t\tMARION\n\t\tAnd congratulations on the birth of\n\t\tyour son.\n\n\t\t\t\tLEE\n\t\tThank you.  Maybe all of this will\n\t\tbuy him some peace.\n\n\t\t\t\tMARION\n\t\tI hope so.\n\nAs Marion starts to ride off, he reins back and stops,\nspeaking back to Lee over his shoulder.\n\n\t\t\t\tMARION\n\t\tYour son, what did you name him?\n\n\t\t\t\tLEE\n\t\tRobert.  Robert E. Lee.\n\nMarion smiles.\n\n\t\t\t\tMARION\n\t\tA good name for a farmer.\n\nLee nods.  Marion rides off.\n\nEXT.  CHERAW FALLS - DAY\n\nMarion's children and Charlotte sit by the river.  Samuel\nsits on the lookout ledge with his musket.  Suddenly he\nstands, looking out, seeing something.\n\nCharlotte and the others notice.  They're worried.  Then\nthey see Samuel throw down his musket and tear down the\npath, running as fast as he can, tumbling, then regaining\nhis feet...\n\nCharlotte and the others know who's coming...\n\nThe children take off running after Samuel...\n\nRacing toward the road...\n\nCharlotte hurries after them...\n\nAND THEN THEY SEE HIM...\n\nMARION, riding at a full gallop...\n\nThe children cry out with tears of joy...\n\nMARION see Susan...\n\nHe gallops toward her...\n\nLEANS OVER...\n\nWithout slowing, he SWOOPS HER UP into the saddle...\n\nShe wraps herself around him...\n\nHe reins back, stops and dismounts, just as the other\nchildren reach him...\n\nThey throw themselves into his arms... embracing him...\n\nCharlotte hurries up behind them...\n\nShe and Marion lock eyes and he is enveloped by the hugs\nof his children.\n\nEXT.  POND BLUFF - EVENING\n\nSummer.  The apple tree at the top of the hill is covered\nwith apples.\n\nMarion's house is partially rebuilt and habitable.  The\nworkshop is already completed.\n\nMARION'S CHILDREN, Nathan, Samuel, Margaret and William,\nplay in the tall grass in front of the house with the two\nGREAT DANES.\n\nCHARLOTTE sits on the front porch, NURSING AN INFANT.\n\nMARION walks out of his workshop, trailed by Susan.  He\ncarries a just-completed rocking chair.\n\nThe chair is a work of art, thin and light, a spider-web\nof perfectly turned wood, no nails, no glue.\n\nHe steps onto the porch next to Charlotte and places the\nrocking chair next to her.\n\n\t\t\t\tMARION\n\t\tTwo pounds, fourteen ounces.\n\n\t\t\t\tCHARLOTTE\n\t\tLovely.\n\nHe smiles and make a minute adjustment in the chair's\nposition.  Then he sits down, settles back and begins\nrocking.  Not a creak.\n\nMarion and Charlotte watch Susan run out of the yard,\ncalling as she joins the other children.\n\n\t\t\t\tSUSAN\n\t\tWait for me...\n\nAs the CAMERA CRANES UP, Marion and Charlotte disappear\nbeneath the overhang of the porch roof.  Suddenly, the\nSOUND OF A CRASH.\n\n\t\t\t\tMARION (O.S.)\n\t\tDamnation!\n\nThe CAMERA CONTINUES TO CRANE UP as Marion walks off the\nporch, crosses the yard and enters his workshop.  A moment\nlater, the SOUND OF MARION'S LATHE RISES.\n\n\t\t\t\t\t\t\t    FADE OUT.\n\n\t\t\t\tTHE END\n\n\n\n\n\n\nPatriot, The\nWriters :   Robert Rodat\nGenres :   Action  Drama  War\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:45.442114"}